{
  "url": "https://www.scmp.com/week-asia/people/article/3323015/malaysia-arrest-ex-pms-son-heroin-deepens-impunity-debate",
  "authorsByline": "Hadi Azmi",
  "articleId": "8cce251bb76b41fe934e4cddc9dd1e96",
  "source": {
    "domain": "scmp.com",
    "paywall": true,
    "location": {
      "country": "cn",
      "city": "Hong Kong Island",
      "coordinates": {
        "lat": 22.2805108,
        "lon": 114.1855595
      }
    }
  },
  "imageUrl": "https://cdn.i-scmp.com/sites/default/files/styles/1280x720/public/d8/images/canvas/2025/08/25/7fbe24b1-2064-4c80-9534-91c4115fb87d_571d6084.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T12:05:03+08:00",
  "addDate": "2025-08-25T04:12:12.239832+00:00",
  "refreshDate": "2025-08-25T04:12:12.239834+00:00",
  "score": 1.0,
  "title": "From Ferraris to felonies: son of ex-PM arrested with heroin in Malaysia",
  "description": "The arrest of the son of a former prime minister with heroin in his car is drawing comparisons to past cases of the elite escaping justice.",
  "content": "Selangor police confirmed late on Sunday that they had detained a man in his twenties, who was found with three grams (0.1 ounces) of heroin and drug paraphernalia in his car.\n\nThe suspect is the son of a former prime minister, according to state police chief Shazeli Kahar as reported by national news agency Bernama. Authorities have withheld his name, however, citing the ongoing investigation and the fact that formal charges have yet to be filed.\n\nThe incident marks the latest in a string of controversies involving relatives of Malaysia’s political elite, fuelling renewed scrutiny over whether the powerful are held to account under the law.\n\nPublic reaction was swift and incredulous, with images of the suspect’s red Ferrari – where the drugs were discovered – circulating widely on social media.\n\n“Drug possession as a user and a trafficker both carry different penalties in Malaysia. Don’t be shocked if he can simply be released even after this arrest,” wrote Arif Ayob in one comment.\n\nThe case has drawn comparisons to earlier scandals involving the families of prominent leaders. In 2023, the son-in-law of former prime minister fled the country to escape . while tax authorities continue to pursue more than 1 billion ringgit (US$24 million) in unpaid taxes from former prime minister and his two sons.",
  "medium": "Article",
  "links": [
    "https://www.scmp.com/topics/muhyiddin-yassin?module=inline&pgtype=article",
    "https://www.scmp.com/topics/najib-razak?module=inline&pgtype=article",
    "https://www.scmp.com/topics/malaysia?module=inline&pgtype=article",
    "https://www.scmp.com/week-asia/lifestyle-culture/article/3321429/malaysia-zaras-death-stirs-outrage-impunity-culture?module=inline&pgtype=article",
    "https://www.scmp.com/news/asia/southeast-asia/article/3252832/malaysia-charge-ex-pm-muhyiddins-son-law-graft-anwar-continues-corruption-purge?module=inline&pgtype=article"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "former prime minister",
      "weight": 0.0963603
    },
    {
      "name": "state police chief Shazeli Kahar",
      "weight": 0.08474456
    },
    {
      "name": "Drug possession",
      "weight": 0.07822422
    },
    {
      "name": "drug paraphernalia",
      "weight": 0.07802458
    },
    {
      "name": "national news agency Bernama",
      "weight": 0.07289783
    },
    {
      "name": "tax authorities",
      "weight": 0.07002473
    },
    {
      "name": "earlier scandals",
      "weight": 0.069273226
    },
    {
      "name": "Selangor police",
      "weight": 0.066658676
    },
    {
      "name": "Arif Ayob",
      "weight": 0.06643219
    },
    {
      "name": "Malaysia",
      "weight": 0.06612274
    }
  ],
  "topics": [
    {
      "name": "Social Issues"
    },
    {
      "name": "Heroin"
    }
  ],
  "categories": [
    {
      "name": "Auto"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.9677734375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.8447265625
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.8330078125
    },
    {
      "name": "/News/Other",
      "score": 0.818359375
    },
    {
      "name": "/Sensitive Subjects/Recreational Drugs",
      "score": 0.7138671875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.52978515625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Drug Laws & Policy",
      "score": 0.41357421875
    },
    {
      "name": "/News/Local News",
      "score": 0.392333984375
    }
  ],
  "sentiment": {
    "positive": 0.04500577,
    "negative": 0.7698118,
    "neutral": 0.18518244
  },
  "summary": "A man in his twenties, believed to be the son of former Malaysian Prime Minister, has been detained with three grams of heroin and drug paraphernalia in his car. The arrest has sparked public outrage, with images of the suspect's red Ferrari being circulated on social media. The incident is part of a trend of controversies involving relatives of Malaysia's political elite, with questions being raised about whether the powerful are held accountable under the law.",
  "shortSummary": "The son of former Malaysian PM's son was arrested with heroin and drug paraphernalia in a Ferrari, raising concerns about the legality of such incidents.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6150881c09494e46b3fe00dd96611363",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.scmp.com/topics/muhyiddin-yassin?module=inline&pgtype=article",
      "text": "TOPIC\n/\npeople\nMuhyiddin Yassin\n+ FOLLOW\nMuhyiddin Yassin\nThe latest news on Muhyiddin Yassin, Malaysian politician and former Prime Minister of Malaysia, including political news and updates.\nSHOW FULL PROFILE\nBorn\n15 May 1947\nIndustry\nPolitics\nJob Title\nFomer Prime Minister of Malaysia\nMalaysia\nMalaysians demand ‘liar’ PM Anwar step down in mass protest\nThe opposition-organised rally targets Prime Minister Anwar Ibrahim over unfulfilled promises and alleged authoritarian tendencies.\n26 Jul 2025 - 6:56PM\nMalaysia\nMahathir turns 100, still shaping Malaysia’s political landscape\n15 Jul 2025 - 11:28AM\nMalaysia\nMalaysia PM’s ex-son-in-law declared bankrupt over US$1.25million ‘friendly loan’\n4 Jul 2025 - 8:29PM\nMalaysia\nMalaysian court overturns Syed Saddiq’s corruption conviction\nThe appeal court also admonished the lower court for not throwing out the allegations of embezzling funds earlier.\n25 Jun 2025 - 3:31PM\nvideocam\nMalaysia\nMalaysia’s home minister ridiculed after his WhatsApp account hacked\nCritics question how Saifuddin Nasution can keep the country safe if he cannot even secure his own phone.\n27 May 2025 - 4:10PM\nMalaysia\nAre Malaysia’s whistle-blower laws protecting the wrong people?\nA businessman who exposed alleged corruption is now facing scrutiny himself, raising questions about Malaysia’s anti-graft legal framework.\n11 Apr 2025 - 10:28PM\nvideocam\nAdvertisement\nAdvertisement\nAdvertisement\nMalaysia\nFormer Malaysian PM Ismail Sabri shows up to give statement in corruption case\nHe had twice delayed reporting to Putrajaya authorities, citing health issues.\n13 Mar 2025 - 4:40PM\nMalaysia\nMy Take\n|\nHere we go again: Ismail Sabri is third Malaysian ex-PM on corruption carousel\nPrime Minister Anwar Ibrahim still has to make good 2018 election promise to push for clean political funding.\n7 Mar 2025 - 9:30AM\nMalaysia\nMalaysians appalled by another corruption probe involving an ex-prime minister\nAnti-corruption authorities are investigating former leader Ismail Sabri Yaakob after a huge amount of cash was found in several properties.\n4 Mar 2025 - 5:30PM\nMalaysia\nMalaysia’s ex-PM Ismail Sabri declares wealth to anti-corruption agency\nThe agency said Ismail Sabri Yaakob formally submitted a wealth declaration to authorities on February 10 after being ordered to do so.\n3 Mar 2025 - 8:35AM\nMalaysia\nMalaysian ex-PM Muhyiddin ordered to pay US$300,000 for defaming politician\nThe court also instructed him to retract the statements that Lim Guan Eng had revoked a tax exemption for a charitable organisation.\n8 Nov 2024 - 3:28PM\nMalaysia\nMalaysia’s Johor state reverting to Saturday-Sunday weekend after 11 years\nThe move had received the ‘consent and blessing’ of Malaysia’s king Sultan Ibrahim, his son Johor Regent Tunku Ismail Sultan Ibrahim said.\n7 Oct 2024 - 2:00PM\nMalaysia\nAsian Angle\n|\nInside PAS’ ‘brilliant move’ to consolidate political power in Malaysia\nSG4 aims to pool resources from Kedah, Kelantan, Perlis and Terengganu to attract investment – though feasibility issues remain.\n7 Oct 2024 - 9:17AM\nvideocam\nMalaysia\nMalaysian PM had no role in graft probe into rival Mahathir: senior Anwar aide\nMalaysia denies PM Anwar ordered anti-graft probe into rival Mahathir, calling allegations a ‘malicious attempt’ to destabilise the government.\n27 Sep 2024 - 8:00PM\nMalaysia\nPolice question Malaysian MP Teresa Kok over halal remarks\nPolice said 50 reports were lodged against the lawmaker by those who thought her request to review a halal certification plan was offensive.\n11 Sep 2024 - 3:58PM\nvideocam\nMalaysia\nMalaysia’s Muhyiddin Yassin suffers fresh legal blow in corruption case\nMuhyiddin’s legal woes follow a tumultuous year for his political bloc, with some lawmakers shifting allegiance to PM Anwar Ibrahim.\n11 Sep 2024 - 1:42PM\nvideocam\nMalaysia\nMalaysia’s ex-PM Muhyiddin faces sedition charge over monarchy remarks\nMuhyiddin will be the country’s first former leader to be charged under the colonial era law, and could face penalties including jail time if found guilty.\n26 Aug 2024 - 8:17PM\nAdvertisement\nAdvertisement\nAdvertisement\nMalaysia\nMalaysia’s ex-PM Muhyiddin swears loyalty to monarchy after police probe\nMuhyiddin Yassin has questioned the palace’s decision to invite Anwar Ibrahim to be Malaysia’s prime minister instead of him in 2022.\n21 Aug 2024 - 7:33PM\nvideocam\nMalaysia\nMalaysia’s anti-party hopping law tested by controversial ruling on sacked MPs\nThe parliamentary speaker’s decision to let the MPs keep their seats could undermine the law meant to maintain political stability.\n11 Jul 2024 - 6:03PM\nvideocam\nMalaysia\nMalaysia court reinstates abuse of power charges against ex-PM Muhyiddin\nA Kuala Lumpur high court had thrown out the four charges and acquitted Muhyiddin in August, ruling those had not detailed his alleged offences\n28 Feb 2024 - 7:35PM\nMalaysia\n‘Ready to prosecute’: Malaysia to charge ex-PM Muhyiddin’s son-in-law for graft\nAuthorities have been searching for Muhammad Adlan Berhan since August in relation to a probe on a project involving the registration and recruitment of foreign workers.\n22 Feb 2024 - 4:20PM\nMalaysia\nMahathir’s son given extension to declare assets in Malaysia anti-graft probe\nThe order is part of an anti-graft investigation after Mirzan’s name appeared in leaks of offshore business records that were revealed by a global media network.\n18 Feb 2024 - 9:21AM\nMalaysia\nMalaysia’s Muhyiddin Yassin reverses call to resign as opposition party president\nThe former prime minister, who also heads the wider opposition bloc Perikatan Nasional, told his Bersatu party on Saturday he had changed his mind after his wife urged him to ‘stay another term’.\n26 Nov 2023 - 10:37PM\nvideocam\nMalaysia\nMalaysia’s Muhyiddin Yassin to step down as opposition party president\nThe former PM leads the Bersatu party and chairs the Malay-dominated Perikatan Nasional alliance. If he relinquishes that, it could rob the bloc of one of the few leaders with broad appeal.\n24 Nov 2023 - 7:08PM\nvideocam\nMalaysia\nMuhyiddin says Malaysia's opposition MPs being coerced to back PM Anwar\nThe Bersatu party, which leads the opposition alliance, found that four lawmakers were getting threatened with legal action or offered cash bribes to back Prime Minister Anwar Ibrahim, according to its president Muhyiddin Yassin.\n10 Nov 2023 - 6:18PM\nMalaysia\nMalaysian lawmaker Syed Saddiq gets 7 years in jail, whipping for embezzlement\nA Kuala Lumpur court found the Muda leader guilty of embezzling more than US$200,000 of funds for a political party.\n9 Nov 2023 - 9:04PM\n16\nMalaysia\nMalaysia faces heat over faulty ventilators bought ‘on WhatsApp’ during Covid\nOfficials spent US$100 million on some 8.5 million vaccine doses that went unused, while US$4.2 million was wasted on mostly faulty ventilators, a parliamentary report said.\n1 Nov 2023 - 6:37PM\nMalaysia\nMalaysia’s PAS will stab Mahathir and Muhyiddin in the back, says Umno official\nFormer PMs Mahathir Mohamad and Muhyiddin Yassin ‘will stab PAS’, wrote Umno supreme council member Puad Zarkashi. ‘But PAS will stab them first’.\n31 Jul 2023 - 2:06PM\nvideocam\nAdvertisement\nAdvertisement\nAdvertisement\nHelp preserve 120 years of quality journalism.\nSUPPORT NOW\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement"
    },
    {
      "url": "https://www.scmp.com/topics/najib-razak?module=inline&pgtype=article",
      "text": "After nine years as Malaysia's prime minister, Najib Razak was driven from office in 2018 when he lost a general election to Mahathir Mohamad. The result was a political earthquake in Malaysia, where the Barisan Nasional coalition had held sway for more than 60 years. It also exposed Najib to prosecution over the vast corruption scandal engulfing state fund 1Malaysia Development Berhad (1MDB), which he established. Police seized luxury goods worth millions of dollars from Najib and his wife, Rosmah Mansoor, and Najib has since been charged over his role in the scandal, including several counts of criminal breach of trust, money laundering and abuse of power."
    },
    {
      "url": "https://www.scmp.com/week-asia/lifestyle-culture/article/3321429/malaysia-zaras-death-stirs-outrage-impunity-culture?module=inline&pgtype=article",
      "text": "In Malaysia, Zara’s death stirs outrage at impunity culture\nThe 13-year-old’s mysterious death at a boarding school has unearthed simmering public frustration as protests erupt nationwide\nThe 13-year-old schoolgirl died in hospital on July 17, a day after she was discovered unconscious outside the dormitory of her Islamic boarding school in Papar, Sabah state. Police initially suggested she had fallen from the third floor – an assumption her family has refused to accept.\nIn the weeks since her death, Zara’s mother, Noraidah Lamat, has spearheaded a campaign for justice that has captured the nation’s interest. Through her lawyer, she previously revealed she had found suspicious bruises on her daughter’s back before burial and questioned why no postmortem had been performed.\nStill, thousands rallied on Sunday afternoon in Zara’s quiet hometown of Sipitang – where most of the district’s 66,000 residents work in paper plantations, farming or fishing – to demand justice."
    },
    {
      "url": "https://www.scmp.com/news/asia/southeast-asia/article/3252832/malaysia-charge-ex-pm-muhyiddins-son-law-graft-anwar-continues-corruption-purge?module=inline&pgtype=article",
      "text": "Advertisement\nMalaysia ‘ready to prosecute’ ex-PM Muhyiddin’s son-in-law for graft, as Anwar’s corruption purge continues\n- Authorities have been searching for Muhammad Adlan Berhan since August in relation to a probe involving the registration and recruitment of foreign workers\n- PM Anwar Ibrahim’s administration has ramped up investigations against political rivals and their family members in recent months\nReading Time:1 minute\nWhy you can trust SCMP\nMalaysia’s anti-corruption agency said it is ready to charge former Prime Minister Muhyiddin Yassin’s son-in-law – who has been wanted by authorities since last year – for graft once he returns to the country.\nAdvertisement\nThe investigation against Muhammad Adlan Berhan has been completed and “we are ready to prosecute” upon his return to the country, Azam Baki, Malaysia Anti-Corruption Commission’s chief, told reporters in Kuala Lumpur.\nAdlan faces several charges for criminal breach of trust, he said.\nAuthorities have been searching for Adlan since August in relation to a probe on a project involving the registration and recruitment of foreign workers.\nPrime Minister Anwar Ibrahim’s administration has ramped up investigations against political rivals and their family members in recent months.\nMuhyiddin still has three pending criminal charges, while former finance minister Daim Zainuddin – a close ally of ex-premier and Anwar’s arch-rival Mahathir Mohamad – was charged in January for failing to declare his wealth.\nThe anti-graft agency has also ordered Mahathir’s sons to reveal their assets amid probes into their business activities.\nAdvertisement\nSelect Voice\nChoose your listening speed\nGet through articles 2x faster\n1.25x\n250 WPM\nSlow\nAverage\nFast\n1.25x"
    },
    {
      "url": "https://www.scmp.com/topics/malaysia?module=inline&pgtype=article",
      "text": "TOPIC\n/\nlocation\nMalaysia\n+ FOLLOW\nMalaysia\nLatest news, in-depth features and opinion on Malaysia, covering politics, economy, society and the Asean member-nation’s relationships with China, Singapore, and other Southeast Asian countries.\nSHOW FULL PROFILE\nCapital\nKuala Lumpur\nHead of State\nSultan Ibrahim ibni Almarhum Sultan Iskandar\nHead of Government\nPrime Minister Anwar Ibrahim\nSCMP Highlights\nChina’s military strides, future of Malaysian oil and gas: 5 weekend reads\nFrom the PLA’s advancements to Japan expanding its defence ties, here are five stories you may have missed over the weekend.\n10 minutes ago\nCrime\nFrom Ferraris to felonies: son of ex-PM arrested with heroin in Malaysia\n20 minutes ago\nSri Lanka\nStraight outta Brickfields: how Malaysia gave the world Tamil rap\n24 Aug 2025 - 5:05PM\nvideocam\nTourism\n‘Precious gift’: Malaysian state honours Fan Bingbing for boosting tourism\nThe Chinese actress said she deeply treasured the recognition, calling it a ‘precious gift’.\n24 Aug 2025 - 3:24PM\nAsean\nAsian Angle\n|\nWhat can East Timor bring to the Association of Southeast Asian Nations?\nThe newest member of the Asean bloc could be its most optimistic, bringing a renewed focus on international law and unity.\n24 Aug 2025 - 12:00PM\nDefence\nMalaysia’s king fires off a royal rebuke to ‘nonsensical’ defence deals\nA controversial Black Hawk deal has been scrapped after Sultan Ibrahim intervened, calling out ‘flying coffins’ and high procurement costs.\n24 Aug 2025 - 8:02AM\nvideocam\nAdvertisement\nAdvertisement\nAdvertisement\nVietnam\nVietnam’s island-building on disputed Spratlys to surpass China’s efforts: report\nSatellite images show Vietnam has begun reclamation on eight reefs and upgraded military infrastructure in disputed waters.\n23 Aug 2025 - 4:20PM\nRoyalty\nMalaysia’s king takes the controls on inaugural electric train journey\nThe long-delayed southern stretch of Malaysia’s electric train service will start operating at the end of the month.\n24 Aug 2025 - 8:29AM\nEducation\nLetters\n|\nLet’s not agree to disagree. Productive disagreement is what world needs\nReaders discuss how to better develop shared solutions to global challenges, content creation ethics, and Anti-Asian discrimination.\n23 Aug 2025 - 11:30AM\nChina trade\nMalaysia flexes rare earth muscle as mineral-hungry US seeks non-Chinese sources\nKuala Lumpur’s new ban on exports of unprocessed rare earth metals reflects how Malaysia is carving out its own path in the rare earth supply chain.\n23 Aug 2025 - 10:00AM\nMusic\nMeet the man on a mission to revive Malaysia’s indie music spirit\nAhmad Faris, founder of TapauFest music festival, has spent the past 15 years promoting Malaysia’s indie scene and regional musical talents.\n23 Aug 2025 - 9:30AM\nSouth China Sea\nMalaysia’s oil and gas future finds itself adrift in the South China Sea\nDecades of underinvestment have left Malaysia’s armed forces ill-prepared to protect its vital oil and gas reserves.\n3 hours ago\nSCO\nHow will China assert its diplomatic clout at SCO summit amid global challenges?\nWith political heavyweights set to attend landmark gathering, many are watching to see how China will position itself as a world power.\n22 Aug 2025 - 9:10PM\nvideocam\nMalaysia 1MDB scandal\nJPMorgan settles 1MDB scandal claims with Malaysia for US$330 million\nThe settlement resolves Malaysia’s civil lawsuit, while Swiss prosecutors found the bank negligent in preventing aggravated money laundering.\n22 Aug 2025 - 8:05PM\nvideocam\nSCMP Highlights\nApple joins RedNote, plane software mastermind leaves US for China: 7 highlights\nFrom Apple joining RedNote to top engineer leaving US for China, here are highlights from SCMP’s recent reporting.\n22 Aug 2025 - 12:54PM\nAnwar Ibrahim\nHow Malaysia’s bid to prevent a ‘corrupt-minded society’ is taking a comic turn\nAnti-corruption chief Azam Baki turns to comics, films and live-streams to stop Malaysia from becoming a ‘corrupt-minded society’.\n22 Aug 2025 - 2:05PM\nDefence\nMalaysia jet explosion reignites debate over ageing air force arsenal\nViral footage of the fiery crash has raised alarms over military readiness and old equipment.\n22 Aug 2025 - 3:44PM\nAdvertisement\nAdvertisement\nAdvertisement\nInsurance\nAIA profit rises 12% in first half on mainland visitors’ buying spree\nThe insurer’s value of new business, a key indicator of sales and future growth, rises 14 per cent to beat market estimates.\n21 Aug 2025 - 6:42PM\nCrime\nZara’s death: 5 teenagers plead not guilty to bullying Malaysian student\nThe suspects were charged with ‘making threatening or insulting communications’ towards 13-year-old Zara, who died on July 17.\n20 Aug 2025 - 3:09PM\nAnwar Ibrahim\nMalaysian employers warn cutting number of foreign workers may backfire\nWhile the government says the move will raise the wages of citizens and productivity, employers argue it will lead to higher business costs.\n20 Aug 2025 - 3:02PM\nCrime\n12-year-old girl’s online porn business exposes legal dilemma in Malaysia\nThe girl made money selling her nude photos, the home minister said, using the case to show the legal pitfalls in dealing with minors.\n20 Aug 2025 - 1:31PM\nScams and swindles\nMalaysian photographer duped by National Geographic scam faces derision\nA dream project in Kenya has turned sour for Tinesh Sritharan, who now faces public backlash and questions over donated funds.\n20 Aug 2025 - 1:43PM\nChina's military weapons\nChina says it will highlight joint combat groups in next month’s military parade\nVictory Day event to feature ‘combat-oriented joint formations’ and ‘star’ weaponry, official adds.\n20 Aug 2025 - 6:04PM\n5\nWorld of performing arts\nThis Malaysian musician can play 30 traditional instruments. She’s 19\nBelle Sisoski reveals how she fuses EDM with traditional instruments to create genre-defying sounds as she spearheads a cultural revival.\n20 Aug 2025 - 7:15AM\nvideocam\nUS-ally trade wars\nOpinion\n|\nTrump’s tariffs could prompt Asian nations to rethink export-led growth\nDisruptions from the new tariff regime open the door to a greater focus on household consumption in the region.\n19 Aug 2025 - 5:38PM\nvideocam\nSingapore\nMalaysia sentences Singaporean to 72 years’ jail for murdering wife, stepson\nShahrul Nizam Zuraimy ‘cut up their bodies like chickens’ before fleeing to Singapore, where he was arrested by the police.\n19 Aug 2025 - 3:27PM\nSCMP Highlights\n‘Singapore maths’ in US schools, Malaysians demand Zara justice: 7 Asia highlights\nFrom Southeast Asia’s widening wealth gap to Singaporean maths in US schools, here are a few highlights from SCMP’s recent Asia reporting.\n19 Aug 2025 - 1:15PM\nReligion\n‘We’ll be Taliban soon’: Malaysian state to jail Muslims for skipping prayers\nTerengganu’s legal move is the latest by the Islamist Pan-Malaysian Islamic Party, or PAS, to tighten religious enforcement.\n19 Aug 2025 - 12:03PM\n5\nAdvertisement\nAdvertisement\nAdvertisement\nHelp preserve 120 years of quality journalism.\nSUPPORT NOW\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement"
    }
  ],
  "argos_summary": "Selangor police detained a young man, identified as the son of a former Malaysian prime minister, after finding three grams of heroin and drug paraphernalia in his Ferrari. The suspect’s name is withheld pending investigation, but the case adds to a series of controversies involving the families of Malaysia’s political elite. Public reaction has been swift, with social media circulating images of the vehicle and comments suggesting the suspect may be released due to the distinction between user and trafficker penalties. The incident echoes earlier scandals, such as the 2023 case of a former prime minister’s son‑in‑law fleeing the country and unpaid tax disputes involving former leaders.",
  "argos_id": "F44YEWB4P"
}