{
  "url": "https://www.ibtimes.com/bleak-future-rohingya-bangladesh-seeks-tackle-crisis-3781596",
  "authorsByline": "Sheikh Sabiha ALAM",
  "articleId": "e080c30a25924389b72371ed719c15f5",
  "source": {
    "domain": "ibtimes.com",
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://d.ibtimes.com/en/full/4617732/hundreds-thousands-rohingya-live-sprawling-refugee-camps-bangladeshs-coxs-bazar.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T00:12:07-04:00",
  "addDate": "2025-08-25T04:36:58.131907+00:00",
  "refreshDate": "2025-08-25T04:36:58.131909+00:00",
  "score": 1.0,
  "title": "Bleak Future For Rohingya, As Bangladesh Seeks To Tackle Crisis",
  "description": "The rain was relentless the night Mohammad Kaisar fled for his life from his home in Myanmar's Maungdaw township.",
  "content": "The rain was relentless the night Mohammad Kaisar fled for his life from his home in Myanmar's Maungdaw township.\n\nBarefoot and exhausted, he trudged with his parents and four siblings on mud paths until they reached the Naf River.\n\nOn a flimsy boat, they crossed into Bangladesh, joining around a million of the largely Muslim Rohingya minority, fleeing a military crackdown in Myanmar's Rakhine state.\n\nThat was in 2017. Eight years later, rain still lashes down on his simple shelter in the sprawling refugee camps of Cox's Bazar.\n\nBut for the 28-year-old refugee, nothing has washed away his despair.\n\n\"War is raging. Hundreds are waiting at the border to enter Bangladesh. Every day, a new family from Rakhine takes refuge,\" Kaisar told AFP by telephone, speaking outside his cramped hut in Balukhali camp.\n\n\"How is it possible to return home? We were destined to stay in this crowded camp, sandwiched between small huts.\"\n\nBangladesh on Monday is holding talks aimed at addressing the plight of Rohingya refugees, even as fresh arrivals cross over from war-torn Myanmar and shrinking aid flows deepen the crisis.\n\nThe meetings in Cox's Bazar are taking place ahead of a UN conference in New York on September 30.\n\nBoth Bangladesh and the UN want to provide stable conditions in Myanmar for the Rohingya to eventually return.\n\nThat seems unlikely any time soon.\n\n\"I consistently hear from Rohingya refugees that they want to return to their homes in Myanmar, but only when it is safe to do so,\" Nicholas Koumjian, who heads the UN's Independent Investigative Mechanism for Myanmar, warned ahead of the meeting.\n\n\"Ending the violence and atrocities against civilians from all communities in Rakhine is critical for the eventual safe, dignified, voluntary and sustainable return of those that have been displaced.\"\n\nBut Kaisar's old homeland of Rakhine is the site of intense fighting in Myanmar's civil war, triggered by the 2021 coup that ousted the democratic government.\n\nBangladesh has recorded a surge of refugees from Myanmar since early 2024, with 150,000 more Rohingya arriving.\n\nFor Kaisar, life in Myanmar was a spacious home, running a small grocery shop.\n\nToday, in the grim camps, it's a battle for survival.\n\nSafety is fragile. Factional clashes have shaken the camp in recent months.\n\n\"We had two armed groups fighting only a few months ago. It was like a hostage situation,\" he said.\n\n\"Violence is common; children are the most vulnerable.\"\n\nIn Rahkine, restricted access due to fighting has been compounded by worldwide aid cutbacks spearheaded by US President Donald Trump's freeze on humanitarian funding.\n\nThe World Food Programme -- which received nearly half its 2024 donations from the United States -- warned this month that 57 percent of families in central Rakhine are now unable to meet basic food needs.\n\nIn the camps, food too is a constant worry.\n\nEach refugee receives a ration card worth about $12 a month. Kaisar listed what that buys: 13 kilogrammes of rice, a litre of oil, a handful of onions and garlic, and a packet of salt.\n\n\"It fills our stomachs, but there is no nutrition,\" he said.\n\n\"I have a three-year-old son. He needs milk, eggs, lentils, but we cannot afford them. Nutrition centres in the camps provide support to children under two. After that, we are left to struggle.\"\n\nEducation is the next looming hurdle, and Kaisar fears for his young son.\n\n\"Will he be able to study and get a job? Or will he spend his whole life as a refugee like me?\" Kaisar asked.\n\nHe recalled how ordinary villagers in Bangladesh once handed him dry clothes and food after his escape. But beyond that generosity, the future looks bleak.\n\nThe violence that uprooted him still rages across the border, and Rohingya militants working with the Myanmar junta have tried to recruit refugees, according to camp residents, UN reports and analysts.\n\n\"We civilians have been continuously betrayed,\" Kaisar said bitterly. \"Every side has used us as pawns.\"\n\nFor now, the father's appeal is simple: that Dhaka eases restrictions on education, to allow Rohingya children to attend regular Bangladeshi schools.\n\n\"At least allow our children to attend school,\" he said. \"If they can stand on their own, maybe their future won't be as hopeless as ours.\"",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Rohingya refugees",
      "weight": 0.09076869
    },
    {
      "name": "Rohingya children",
      "weight": 0.077832006
    },
    {
      "name": "Myanmar",
      "weight": 0.0750547
    },
    {
      "name": "camp residents",
      "weight": 0.069169834
    },
    {
      "name": "Rohingya militants",
      "weight": 0.06886242
    },
    {
      "name": "refugees",
      "weight": 0.06848327
    },
    {
      "name": "Balukhali camp",
      "weight": 0.06785296
    },
    {
      "name": "Rohingya",
      "weight": 0.06766732
    },
    {
      "name": "Mohammad Kaisar",
      "weight": 0.062857725
    },
    {
      "name": "Bangladesh",
      "weight": 0.06260987
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/People & Society/Other",
      "score": 0.958984375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.9326171875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.73681640625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.728515625
    },
    {
      "name": "/News/Other",
      "score": 0.70556640625
    },
    {
      "name": "/News/World News",
      "score": 0.51904296875
    },
    {
      "name": "/People & Society/Religion & Belief",
      "score": 0.37548828125
    }
  ],
  "sentiment": {
    "positive": 0.066200815,
    "negative": 0.7332436,
    "neutral": 0.20055556
  },
  "summary": "Mohammad Kaisar, a 28-year-old Rohingya refugee from Myanmar, fled a military crackdown in 2017 and joined around a million of the largely Muslim Rohingya minority in Bangladesh. Despite Bangladesh's efforts to provide stable conditions in Myanmar for the return, it is unlikely any time soon. The World Food Programme has warned that 57 percent of families in central Rakhine are now unable to meet basic food needs due to fighting and worldwide aid cutbacks. The UN's Independent Investigative Mechanism for Myanmar, Nicholas Koumjian, warned of the need for the safe, dignified, voluntary and sustainable return of those displaced. Bangladesh has recorded a surge of refugees from Myanmar since early 2024, with 150,000 more expected to arrive.",
  "shortSummary": "Bangladesh is addressing the Rohingya refugee crisis in Rakhine, where food shortages, violence, and aid shortages are worsening, with limited access and limited aid supplies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "61e486e1fffd420faec75786629b31a3",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Mohammad Kaisar, a 28‑year‑old Rohingya refugee, recounts the relentless rain, violence, and lack of nutrition that haunt his life in Cox’s Bazar’s Balukhali camp, where he and his family fled Myanmar’s 2017 crackdown. Despite Bangladesh’s talks with the UN ahead of a September conference, the Rohingya still face daily insecurity, dwindling aid, and food shortages that leave children nutritionally vulnerable. The UN’s Independent Investigative Mechanism stresses that only an end to Myanmar’s violence can enable a safe, voluntary return, while the Rohingya continue to be used as pawns by conflicting forces. Kaisar urges Dhaka to lift educational restrictions so children can attend regular Bangladeshi schools, hoping to break the cycle of hopelessness.",
  "argos_id": "FRLXRUC1E"
}