{
  "url": "https://www.express.co.uk/sport/football/2099494/Man-Utd-transfer-news-Senne-Lammens",
  "authorsByline": "Matthew Abbott",
  "articleId": "299b9218bb264cccbcc636136815e94c",
  "source": {
    "domain": "express.co.uk",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Stark County",
      "city": "Hartville",
      "coordinates": {
        "lat": 40.9636685,
        "lon": -81.3312195
      }
    }
  },
  "imageUrl": "https://cdn.images.express.co.uk/img/dynamic/67/1200x630/6381400.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-24T15:21:00+01:00",
  "addDate": "2025-08-24T14:35:36.529880+00:00",
  "refreshDate": "2025-08-24T14:35:36.529881+00:00",
  "score": 1.0,
  "title": "Man Utd's next transfer 'advanced' after major Senne Lammens decision made",
  "description": "Manchester United have wanted another goalkeeper since the start of this year, and the club could finally sign a new one before the summer transfer window ends",
  "content": "Manchester United are said to be advancing towards signing Senne Lammens. The Belgium international did not play for Royal Antwerp in their 2-1 win over KV Mechelen on Sunday. United have not dismissed the idea of bringing in a goalkeeper before the summer transfer window slams shut, but they're not in the market for a new number one. Earlier this year, the Manchester Evening News revealed that the club wanted a new shot-stopper.\n\nStay up-to-date with the latest Man Utd news Join us on WhatsApp Our community members are treated to special offers, promotions, and adverts from us and our partners. You can check out at any time. Read our Privacy Policy\n\nThe position, though, was not a top priority this summer. The Old Trafford outfit had explored the possibility of loaning Emiliano Martinez from Aston Villa, but they quickly dismissed suggestions of signing Gianluigi Donnarumma. Lammens is the latest option they are showing interest in, and Antwerp leaving their goalkeeper out of the squad for this weekend's game is the surest sign that his future lies away from the club. Michel-Ange Balikwisha was also missing as he is close to sealing a move to Celtic.\n\nLammens had started the first four matches of the Jupiler Pro League season, letting in a goal in each game while helping his team to an unbeaten start. Galatasaray, Inter Milan and Lille have all shown interest in the 23-year-old, but United appear to be the frontrunners. The journalist Fabrizio Romano claims negotiations are advancing with the clubs close to agreeing on a fee. Personal terms are said to be already approved by the player.\n\nLammens made 60 appearances for Antwerp across the last two seasons after signing from Club Brugge. The goalkeeper kept 12 clean sheets across those matches. He then earned a first senior national team call-up in March, with a second following during June. That came after nine appearances for the under-21s over recent years, who he is now no longer able to represent after turning 23 in July.",
  "medium": "Article",
  "links": [
    "https://www.express.co.uk/latest/manchester-united-fc",
    "https://www.express.co.uk/sport/football/2099430/Man-Utd-transfer-news-Senne-Lammens",
    "https://www.express.co.uk/latest/aston-villa-fc",
    "https://www.express.co.uk/latest/inter-milan-fc",
    "https://www.express.co.uk/sport/football/2099288/Man-Utd-transfer-news-Benjamin-Sesko",
    "https://www.express.co.uk/sport/football/2099472/man-utd-transfer-plans-donnarumma-agrees-terms-premier-league-rivals",
    "https://www.express.co.uk/sport/football/2099329/ruben-amorim-makes-promise-exiled-man-utd-players",
    "https://www.express.co.uk/latest/old-trafford",
    "https://www.express.co.uk/whatsapp-group-web/5?utm_source=article_widget&utm_medium=referral&utm_campaign=article_widget&utm_content=whatsapp-group-signup-in-article",
    "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/ruben-amorim-wants-new-manchester-30686843",
    "https://x.com/FabrizioRomano",
    "https://www.express.co.uk/latest/celtic-fc",
    "https://www.express.co.uk/latest/transfer-window",
    "https://www.express.co.uk/privacy-notice"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "major Senne Lammens decision",
      "weight": 0.074462555
    },
    {
      "name": "Senne Lammens",
      "weight": 0.073783174
    },
    {
      "name": "Royal Antwerp",
      "weight": 0.07308
    },
    {
      "name": "recent years",
      "weight": 0.06889912
    },
    {
      "name": "Antwerp",
      "weight": 0.06513071
    },
    {
      "name": "Manchester United",
      "weight": 0.064468324
    },
    {
      "name": "Man Utd",
      "weight": 0.064344615
    },
    {
      "name": "Lammens",
      "weight": 0.061653923
    },
    {
      "name": "Jupiler Pro League",
      "weight": 0.05915107
    },
    {
      "name": "special offers",
      "weight": 0.057063714
    }
  ],
  "topics": [
    {
      "name": "Football"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98193359375
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.9716796875
    }
  ],
  "sentiment": {
    "positive": 0.15945558,
    "negative": 0.23522894,
    "neutral": 0.60531545
  },
  "summary": "Manchester United is reportedly advancing towards signing Belgium international goalkeeper Senne Lammens. The decision comes after Lammen was not present for Royal Antwerp's 2-1 win over KV Mechelen. Despite rumours of a new goalkeeper, United has ruled out bringing in a new one before the summer transfer window closes. They also dismissed suggestions of signing Gianluigi Donnarumma. The 23-year-old goalkeeper has been linked with a move to Manchester United, with personal terms already approved by the player.",
  "shortSummary": "Manchester United are advancing with Senne Lammens as they seek a new goalkeeper, despite Antwerp's absence and interest from other clubs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b1e3d3433d8a4020a653b5a0633332e3",
  "places": [
    {
      "osmId": "99403577",
      "road": "Sir Matt Busby Way",
      "suburb": "Wharfside",
      "city": "Trafford",
      "stateDistrict": "Greater Manchester",
      "state": "England",
      "postcode": "M16 0RA",
      "country": "United Kingdom",
      "countryCode": "gb",
      "coordinates": {
        "lat": 53.46310955,
        "lon": -2.2913864850545362
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/ruben-amorim-wants-new-manchester-30686843",
      "text": "Ruben Amorim targeting transfer in key Manchester United position\nAndre Onana had a dire December after a positive start to the season and Man United are expected to be in the market for a new goalie this year.\nManchester United head coach Ruben Amorim wants a new goalkeeper to compete with Andre Onana this year.\nOnana, 28, has made several high-profile errors since Amorim took over at United after an impressive start to the season despite the team's flagging form.\nAmorim is intent on recruiting a 'keeper who will push Onana for the number one place, with Altay Bayindir not regarded as credible competition.\nBayindir, who joined United from Fenerbahce for £4.3million in September 2023, has made only four appearances for the club - all of them in the FA Cup and League Cup.\nThe Turkey international was pilloried for two costly errors in United's 4-3 League Cup quarter-final defeat at Tottenham last month. Bayindir was beaten directly from a corner for Son Heung-min's winner.\nBayindir, 26, would have to leave this month if United were to sign an immediate replacement. Third-choice 'keeper Tom Heaton, who turns 39 in April, is out of contract in the summer and Amorim believes he will have the leverage to strengthen the United goalkeeping department in the summer.\nOnana has conceded 26 goals in 19 Premier League games this term and had a particularly dire December, committing errors against Nottingham Forest, Viktoria Plzen and Wolves. His hesitancy at corners was exploited by Arsenal, who scored both goals from corner kicks in their 2-0 victory over United, before Wolves playmaker Matheus Cunha scored directly from a corner against Onana in United's 2-0 loss at Molineux.\nUnited paid Inter Milan £47.2m for Onana a year after he left Ajax on a free transfer. The Cameroon international has kept 20 clean sheets in 70 appearances."
    }
  ],
  "argos_summary": "Manchester United are reportedly pursuing Belgian goalkeeper Senne Lammens, who was left out of Royal Antwerp’s squad after a 2-1 win, signalling his potential move away from the club. United have not ruled out a new shot-stopper before the summer window closes, but a number one keeper is not a top priority, with the club already considering loan options like Emiliano Martinez. The club’s current goalkeeping situation—Andre Onana’s error‑prone performances and the limited impact of Altay Bayindir—has prompted manager Ruben Amorim to seek competition for the number one spot. Interest from clubs such as Galatasaray, Inter Milan and Lille has been noted, but United appear to be the frontrunners in negotiations for Lammens. ",
  "argos_id": "G56AMXE86"
}