{
  "url": "https://www.rt.com/news/623486-trump-channels-licenses-revoked/",
  "authorsByline": "RT",
  "articleId": "7ea5671b86a846e7a969b7300ab06336",
  "source": {
    "domain": "rt.com",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Shelby County",
      "city": "Russia",
      "coordinates": {
        "lat": 40.2338211,
        "lon": -84.4096729
      }
    }
  },
  "imageUrl": "https://mf.b37mrtl.ru/files/2025.08/article/68abe6e285f54049180ad445.jpg",
  "country": "ru",
  "language": "en",
  "pubDate": "2025-08-25T04:31:24+00:00",
  "addDate": "2025-08-25T04:39:48.390987+00:00",
  "refreshDate": "2025-08-25T04:39:48.390988+00:00",
  "score": 1.0,
  "title": "ABC and NBC should be taken off the air – Trump",
  "description": "US President Donald Trump has called for ABC and NBC to be stripped of their broadcasting licenses",
  "content": "The US president has accusesed the networks of political bias\n\nUS President Donald Trump said on Sunday that news channels ABC and NBC should have their broadcasting licenses revoked.\n\nTrump has long accused major media outlets of spreading lies about him and working to undermine his presidency on behalf of the Democrats.\n\nIn a post on Truth Social, Trump blasted ABC and NBC as “two of the absolute worst and most biased networks.”\n\n“They should lose their Licenses for their unfair coverage of Republicans and/or Conservatives, but at a minimum, they should pay up BIG for having the privilege of using the most valuable airwaves anywhere at anytime!” he wrote. He has previously labeled both networks “political pawns” of the Democrats.\n\nIn June, ABC dismissed veteran correspondent Terry Moran after he referred to senior Trump aide Stephen Miller as a “world-class hater.” In 2024, the network agreed to pay $15 million to Trump’s presidential library to settle a defamation lawsuit over inaccurate comments about his sexual assault and defamation trial involving columnist E. Jean Carroll.\n\nLast month, Paramount, the parent company of CBS News, agreed to pay $16 million as part of another settlement. Trump alleged the company deceptively edited a 2024 interview with then-Vice President Kamala Harris, who was at the time running against him in the presidential election.\n\nIn July, Trump filed a lawsuit against the Wall Street Journal’s parent company Dow Jones and its owner Rupert Murdoch over a report claiming he had sent a birthday letter to financier and convicted sex offender Jeffrey Epstein in the early 2000s.",
  "medium": "Article",
  "links": [
    "https://www.rt.com/news/622905-melania-trump-hunter-biden/"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "President Donald Trump",
      "weight": 0.10148553
    },
    {
      "name": "senior Trump aide Stephen Miller",
      "weight": 0.09952542
    },
    {
      "name": "Donald Trump",
      "weight": 0.0990605
    },
    {
      "name": "Trump",
      "weight": 0.09860839
    },
    {
      "name": "ABC",
      "weight": 0.073110774
    },
    {
      "name": "veteran correspondent Terry Moran",
      "weight": 0.07057614
    },
    {
      "name": "columnist E. Jean Carroll",
      "weight": 0.0665504
    },
    {
      "name": "major media outlets",
      "weight": 0.0659323
    },
    {
      "name": "NBC",
      "weight": 0.06467815
    },
    {
      "name": "political bias",
      "weight": 0.06233516
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9658203125
    },
    {
      "name": "/News/Other",
      "score": 0.95703125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.798828125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Networks & Stations",
      "score": 0.64306640625
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.322509765625
    }
  ],
  "sentiment": {
    "positive": 0.0485751,
    "negative": 0.77862155,
    "neutral": 0.17280331
  },
  "summary": "US President Donald Trump has criticised news channels ABC and NBC for their political bias, suggesting they should lose their broadcasting licenses. This comes after a series of allegations that they are spreading lies about him and working to undermine his presidency for the Democrats. In June, ABC dismissed veteran correspondent Terry Moran after he referred to senior Trump aide Stephen Miller as a \"world-class hater\".",
  "shortSummary": "US President Donald Trump called for ABC and NBC to lose their broadcasting licenses for political bias, citing as many as 20%.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f84eddf3ac4c4be8882f371db25347be",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.rt.com/news/622905-melania-trump-hunter-biden/",
      "text": "Melania Trump threatens to sue Hunter Biden for $1bn\nUS First Lady Melania Trump has threatened a $1 billion lawsuit against Hunter Biden over his “extremely salacious” remarks linking her to late disgraced financier and convicted sex offender Jeffrey Epstein.\nThe son of former US President Joe Biden made the comments during a YouTube interview with Channel 5 host Andrew Callaghan earlier this month. Biden alleged that Epstein had introduced Melania to her husband, Donald Trump, citing a book by American journalist Michael Wolff. According to Biden, the connections between the late sex trafficker and the Trumps “are, like, so wide and deep.”\nShortly after the explosive interview, the first lady’s attorney,Alejandro Brito, sent Biden a letter threatening him with a $1 billion lawsuit. Dated August 6 and circulated by the US media this week, the letter demanded that Biden “immediately retract the false, defamatory, disparaging, and inflammatory statements made about Mrs. Trump” or face the massive suit needed to “recover the overwhelming financial and reputational harm that you have caused her to suffer.”\nDonald Trump, who himself is no stranger to filing substantial litigation lawsuits, has backed the looming legal action against Biden.\n“I said go forward. You know, I’ve done pretty well on these lawsuits lately … and Jeffrey Epstein had nothing to do with Melania and introducing,” Trump told Fox News Radio host Brian Kilmeade on Thursday. Previously, the US president accused Wolff of making up stories to sell books and dismissed him as a “third-rate reporter.”\nBiden reappeared on Callaghan’s show on Thursday, being offered an opportunity to apologize. He refused to do so, however, and stood by his original remarks.\n“F**k that, that’s not going to happen,” he said. “[Epstein and Trump] knew each other well, they spent an enormous amount of time together.” Biden once again referenced Wolff’s claims, as well as cited several other publications alleging the link between Melania Trump and Epstein.\nAccording to the first lady’s best-selling memoir, ‘Melania’, she met her future husband at a 1998 Fashion Week party in New York, where the two were introduced by a modeling agent."
    }
  ],
  "argos_summary": "Former President Donald Trump has demanded that ABC and NBC lose their broadcasting licenses, accusing them of biased coverage and calling them political pawns of the Democrats. He cited recent settlements with ABC and Paramount, alleging defamation and deceptive editing, and has filed lawsuits against Dow Jones and Rupert Murdoch over a report linking him to Jeffrey Epstein. Meanwhile, First Lady Melania Trump has threatened a $1 billion lawsuit against Hunter Biden after he made claims in a YouTube interview that she was introduced to her husband by Epstein, a claim she denies. Biden has refused to retract the statements, asserting the alleged connections are true. The disputes highlight ongoing legal battles between the Trump family and media outlets over defamation and political bias allegations.",
  "argos_id": "G6TJOI9FH"
}