{
  "url": "https://finance.yahoo.com/news/china-ramps-longer-term-cash-034307490.html",
  "authorsByline": "Bloomberg News",
  "articleId": "269eae67d583414f9ed117f064285a32",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/YARykTT4mF4Q6_4HuWP2dA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_holding_pen_162/0a24a663f43f87375224abf5c9ddad7a",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T03:43:07+00:00",
  "addDate": "2025-08-25T04:33:26.769903+00:00",
  "refreshDate": "2025-08-25T04:33:26.769904+00:00",
  "score": 1.0,
  "title": "China Ramps Up Longer-Term Cash Boost With Bonds Under Pressure",
  "description": "The People’s Bank of China added a net 600 billion yuan ($84 billion) via its one-year medium-term facility as well as three and six-month outright reverse repos this month, the most since January, as per Bloomberg calculations.  China’s overnight money market rate fell while bond futures rose in response to the move.  It could also cool any redemption pressure on bond funds and avert spiraling losses as investors rush to buy stocks.",
  "content": "China dialed up its injection of longer term liquidity into its financial system in a move that’s likely intended at easing the selloff in bonds and ensuring adequate funding for the flailing economy.\n• We Need a Reality Check on Crime, Safety and Transit\n\nThe People’s Bank of China added a net 600 billion yuan ($84 billion) via its one-year medium-term facility as well as three and six-month outright reverse repos this month, the most since January, as per Bloomberg calculations. China’s overnight money market rate fell while bond futures rose in response to the move.\n\nThe measures underscore Beijing’s desire to retain stable funding conditions and facilitate government borrowing, after investors demanded the highest yields since December at a 30-year auction. It could also cool any redemption pressure on bond funds and avert spiraling losses as investors rush to buy stocks.\n\nThe PBOC will keep up its longer-term liquidity injections to ensure smooth issuance of government bonds and to foster an increase in bank loans, said Wang Qing, chief macro analyst at Golden Credit Rating Co. It “reassures market of a growth-supportive monetary policy stance.”\n\nThe PBOC indicated it’s holding back from aggressively easing monetary policy with moves such as interest-rate cuts, but pledged targeted support for the economy. Policymakers have also been cautious of using more forceful easing measures like — cutting the amount of cash banks need to keep as reserve, or purchasing government bonds — amid its efforts to quell deflation.\n\nThat along with a tax on bonds’ interest income has weighed on investor appetite for sovereign debt. However, the central bank has been making a steady stream of short-term cash infusions to support the market.\n\nLiquidity injections via MLF and outright reverse repo, the main instruments in PBOC’s toolkit after an overhaul earlier this year, are likely to help the central bank maintain ample cash conditions to support growth. That’s especially at a time when the relentless rally in stocks threatens to draw funds from household savings at banks and induce liquidity stress.\n\nChina’s overnight repo rate fell seven basis points to 1.35% on Monday. Futures on 30-year bonds rose as much as 0.7%, their biggest gain since April.\n• Taco Bell’s Not-So-Secret Sauce: An Endless Stream of New Stuff\n• Staff Cuts and Turmoil Hit the CFTC While the Crypto It Oversees Booms\n• Foreigners Are Buying US Homes Again While Americans Get Sidelined\n• Women’s Earnings Never Really Recover After They Have Children",
  "medium": "Article",
  "links": [
    "https://www.bloomberg.com/news/articles/2025-08-22/dc-crime-crackdown-deputizes-national-park-service-in-homeless-sweeps?utm_campaign=bn&utm_medium=distro&utm_source=yahooUS",
    "https://www.bloomberg.com/news/features/2025-08-19/j-crew-ceo-focuses-on-quality-relevance-prices-in-retailer-s-comeback?utm_campaign=bw&utm_medium=distro&utm_source=yahooUS",
    "https://www.bloomberg.com/news/features/2025-08-21/as-crypto-duties-loom-cftc-is-hit-by-staff-cuts-and-turmoil?utm_campaign=bw&utm_medium=distro&utm_source=yahooUS",
    "https://www.bloomberg.com/news/features/2025-08-18/women-s-earnings-take-a-hit-from-having-kids-per-wharton-economist?utm_campaign=bw&utm_medium=distro&utm_source=yahooUS",
    "https://www.bloomberg.com/news/features/2025-08-23/germany-is-giving-prefabricated-mass-housing-a-second-chance?utm_campaign=bn&utm_medium=distro&utm_source=yahooUS",
    "https://www.bloomberg.com/news/articles/2025-08-20/taco-bell-s-not-so-secret-sauce-an-endless-menu-of-new-special-offerings?utm_campaign=bw&utm_medium=distro&utm_source=yahooUS",
    "https://www.bloomberg.com/news/articles/2025-08-18/us-housing-market-draws-foreigners-while-locals-stay-on-sidelines?utm_campaign=bw&utm_medium=distro&utm_source=yahooUS",
    "https://www.bloomberg.com/news/articles/2025-08-21/how-transit-agencies-can-fight-the-fear-of-riding-public-transportation?utm_campaign=bn&utm_medium=distro&utm_source=yahooUS"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "government bonds",
      "weight": 0.09152128
    },
    {
      "name": "bond funds",
      "weight": 0.087680876
    },
    {
      "name": "longer term liquidity",
      "weight": 0.08346846
    },
    {
      "name": "bond futures",
      "weight": 0.08338541
    },
    {
      "name": "Bonds",
      "weight": 0.080577604
    },
    {
      "name": "bonds",
      "weight": 0.080577604
    },
    {
      "name": "bank loans",
      "weight": 0.070628546
    },
    {
      "name": "ample cash conditions",
      "weight": 0.06999034
    },
    {
      "name": "outright reverse repo",
      "weight": 0.067419
    },
    {
      "name": "banks",
      "weight": 0.06647848
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9892578125
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.919921875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.85107421875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.79248046875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.329345703125
    }
  ],
  "sentiment": {
    "positive": 0.2948057,
    "negative": 0.46417677,
    "neutral": 0.24101758
  },
  "summary": "China has increased its injection of longer term liquidity into its financial system, in an effort to reduce bond selloff and maintain adequate funding for the struggling economy. The People's Bank of China added a net 600 billion yuan ($84 billion) via its one-year medium-term facility and three and six-month outright reverse repos this month, the most since January. This move is seen as an attempt to maintain stable funding conditions and facilitate government borrowing. It could also help reduce any redemption pressure on bond funds and prevent losses as investors rush to buy stocks. The central bank has been making a steady stream of short-term cash infusions to support the market.",
  "shortSummary": "China increased its longer-term liquidity injection to support its struggling economy, easing bond selloff and ensuring stable funding conditions amid stock market rallies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "2dd3212d96804d08be5fa4a0241262d6",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "China’s central bank injected 600 billion yuan of longer‑term liquidity through its medium‑term lending facility and reverse repos, the largest since January, to calm bond market sell‑offs and support the struggling economy. The move lowered overnight rates and lifted 30‑year bond futures, signalling a growth‑supportive stance without aggressive rate cuts. Analysts say the injections aim to keep government borrowing smooth, boost bank lending, and prevent liquidity stress amid a stock rally that could drain household savings.",
  "argos_id": "GLJI3XJ06"
}