{
  "url": "https://www.yahoo.com/news/articles/israel-strikes-yemen-houthis-fire-151238770.html",
  "authorsByline": "Eyad Kourdi and Darna Karni, CNN",
  "articleId": "e5b152c1ce5f46c7879195f1930b54f0",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/cnn_articles_875/481bf0d44f693b3f4fde176227403ae0",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T15:12:38+00:00",
  "addDate": "2025-08-24T16:05:22.339999+00:00",
  "refreshDate": "2025-08-24T16:05:22.340001+00:00",
  "score": 1.0,
  "title": "Israel strikes Yemen after Houthis fire new type of missile",
  "description": "Israel struck Yemen’s Houthis on Sunday after the Iran-backed rebels fired a new type of missile at Israel.",
  "content": "Israel struck Yemen’s Houthis on Sunday after the Iran-backed rebels fired a new type of missile at Israel.\n\nThe Israeli military said it struck a military site where the presidential palace is located, as well as two power plants and a fuel storage site.\n\nThe Israel Defense Forces (IDF) said “the strikes were conducted in response to repeated attacks by the Houthi terrorist regime against the State of Israel and its civilians.”\n\nMore than 10 fighter jets participated in the strikes, according to an Israeli air force official, who said the furthest target was approximately 2,000 kilometers (1,240 miles) from Israel.\n\nA television station affiliated with the Houthis, who control the city, said there was “Zionist aggression ongoing on the capital Sanaa.”\n\nA member of the Houthi leadership, Mohammad al-Farrah said that the Houthis would continue to support the people of Gaza and would “not retreat from it until the aggression is lifted, the siege is broken, and the starvation of Gaza’s people is stopped.”\n\nThe strikes follow the Houthis’ launch of a missile against Israel on Friday.\n\nAn Israeli air force official said that for the first time, a Houthi missile contained a number of sub-munitions, which were intended to be detonated upon impact.\n\nPolice in the Tel Aviv district said Friday they were several sites where interception fragments had landed. No injuries were reported.\n\nFor more CNN news and newsletters create an account at CNN.com",
  "medium": "Article",
  "links": [
    "https://www.cnn.com/2025/07/06/middleeast/israel-strikes-houthis-iran-ceasefire-intl-latam?cid=external-feeds_iluminar_yahoo",
    "http://www.cnn.com/account/register?source=external-feeds_iluminar&cid=external-feeds_iluminar_yahoo&registration_email_campaign=https://www.cnn.com/newsletters"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Houthis",
      "weight": 0.08533022
    },
    {
      "name": "several sites",
      "weight": 0.07880599
    },
    {
      "name": "Israel",
      "weight": 0.07726082
    },
    {
      "name": "more CNN news",
      "weight": 0.07354355
    },
    {
      "name": "Houthi",
      "weight": 0.07331637
    },
    {
      "name": "Zionist aggression",
      "weight": 0.07183008
    },
    {
      "name": "missile",
      "weight": 0.070365526
    },
    {
      "name": "new type",
      "weight": 0.069891624
    },
    {
      "name": "Tel Aviv",
      "weight": 0.061153036
    },
    {
      "name": "repeated attacks",
      "weight": 0.05997032
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.97802734375
    },
    {
      "name": "/News/World News",
      "score": 0.9140625
    },
    {
      "name": "/News/Other",
      "score": 0.8818359375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.84423828125
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.728515625
    }
  ],
  "sentiment": {
    "positive": 0.082879476,
    "negative": 0.5857856,
    "neutral": 0.33133492
  },
  "summary": "Israel has struck Yemen's Houthis after the Iran-backed rebels launched a new type of missile. The Israeli military targeted a military site where the presidential palace is located, two power plants and a fuel storage site. The strikes were conducted in response to repeated attacks by the Houthi regime against Israel. The furthest target was approximately 2,000 kilometers from Israel. No injuries were reported.",
  "shortSummary": "Israel's military launched multiple air strikes against Yemen’s Houthi rebels after they fired a new type of missile, targeting key sites and sub-par artillery.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f93a2a54ec2049cbafd79ccb4d9f34fc",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnn.com/2025/07/06/middleeast/israel-strikes-houthis-iran-ceasefire-intl-latam?cid=external-feeds_iluminar_yahoo",
      "text": "Israel has carried out its first strikes against Houthi targets in Yemen since the Israel-Iran ceasefire, attacking ports and a power plant around midnight local time Sunday night into Monday morning.\nThe strikes come after at least three Houthi ballistic missiles were launched at Israel, according to the Israel Defense Forces (IDF), including one missile that was intercepted Saturday.\nThe Iran-backed Houthis also claimed responsibility for an attack on the bulk carrier ‘Magic Seas’ in the Red Sea on Sunday, the first on commercial shipping in the region by the rebels this year.\nIsrael struck the ports of Hodeida, Ras Isa, Salif and the Ras Kanatib power plant along the Red Sea. The IDF also hit the Galaxy Leader, a cargo ship seized by the Houthis in November 2023.\n“Houthi forces installed a radar system on the ship and have been using it to track vessels in the international maritime arena to facilitate further terrorist activities,” the IDF said in a statement following the strikes.\nA short time before the wave of attacks, the IDF’s Arabic language spokesman, Avichay Adraee, issued an evacuation warning for the ports and the power station.\nDefense Minister Israel Katz said the strikes were part of the newly named Operation “Black Flag.” In a statement on social media, Katz said, “The Houthis will continue to pay a heavy price for their actions” and promised more attacks would follow if the Houthis kept launching drones and ballistic missiles at Israel.\nThe Houthi military confirmed the strikes but said, “Yemeni air defenses effectively confronted the Israeli aggression,” using, “a massive barrage of locally manufactured surface-to-air missiles,” in a short statement on early Monday morning.\nThere are no immediate reports of casualties from the strikes.\nHouthi political bureau member Mohammed Al Farah said targeting Yemeni ports, power stations, and other “civilian facilities is an attempt to harm civilians and has no connection to any military activity,” according to the Houthi-run Al-Masirah TV.\nSince Israel’s war with Hamas in Gaza started in October 2023, the country has come under fire from missiles and rockets from Hezbollah in Lebanon and the Houthis in Yemen, who claim to strike Israel in solidarity with the Palestinians.\nOn Sunday, the Houthis attacked the ‘Magic Seas’ ship, claiming that the its owner had used Israeli ports.\nThe rebels said they had struck the vessel with unmanned boats, missiles and drones, and it had now sunk. They have warned that they will target shipping that uses ports in Israel, which they describe as “occupied Palestine.”\nThe vessel’s operator – Stem Shipping – told Reuters that the ‘Magic Seas’ had made a port call to Israel in the past, but the latest transit of the region appeared low-risk as it had nothing to do with Israel.\nThe ‘Magic Seas’ crew of 19 left the boat on Sunday and were being taken by another ship to Djibouti.\nThe United Arab Emirates foreign ministry said an Emirati operation rescued everyone aboard the ship, in close coordination with organizations like the United Kingdom Maritime Trade Operations (UKMTO). A vessel responded to a distress call from the ‘Magic Seas’ after it came under attack and sustained “damage” to its structure, causing its crew to abandon ship under “difficult maritime conditions” the ministry said.\nIn May, the Houthi group – which controls much of northern and central Yemen – agreed to halt attacks on US warships in the Red Sea after more than a month of airstrikes by US forces on its strongholds and missile infrastructure.\nBut it did not pledge to end attacks on other shipping with alleged connections to Israel and has continued to fire ballistic missiles at Israel in support of the Palestinian population in Gaza.\nThis story has been updated with additional developments."
    }
  ],
  "argos_summary": "Israel launched airstrikes on Yemen’s Houthi targets after the rebels fired a new missile type with sub‑munitions. The attacks hit a military site near the presidential palace, two power plants, a fuel depot, and several ports along the Red Sea, marking Israel’s first strikes against Houthi positions since the ceasefire. The Houthis said they would continue supporting Gaza and would not back down until the siege ends. No casualties were reported, and Israel warned of further retaliation if Houthi attacks continue.",
  "argos_id": "I2SJU04DF"
}