{
  "url": "https://www.bloomberg.com/news/videos/2025-08-19/balance-of-power-early-edition-8-19-2025-video",
  "authorsByline": "bn",
  "articleId": "6c93c68d3a8548c69dccfa5771b7e35b",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iXoyX7iZxs00/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-19T18:54:58.889000+00:00",
  "addDate": "2025-08-19T19:22:07.532357+00:00",
  "refreshDate": "2025-08-19T19:22:07.532358+00:00",
  "score": 1.0,
  "title": "Trump Says Putin, Zelenskiy Must Be Flexible",
  "description": "On the early edition of Balance of Power, Bloomberg Washington Correspondent Tyler Kendall and Senior Editor Michael Shepard discuss next steps in the peace process between Russia and Ukraine. On today's show, former United Kingdom Ambassador to the United States Peter Westmacott, Center for the Study of the Presidency and Congress Senior Democracy Fellow Jeanne Sheehan Zaino, BGR Group International Practice Partner Lester Munson and former Deputy National Security Advisor for Cyber and Emerging Technology in the Biden Administration Anne Neuberger. (Source: Bloomberg)",
  "content": "Live from Washington, D.C. This is balance of power with Joe Matthew. President Trump says it's on Russia and Ukraine to be flexible, in his words, and reach a peace deal. Welcome to our to a balance of power. On Bloomberg. As Bloomberg News reports, work has started already between U.S. and European officials on potential security guarantees for Ukraine. I'm Tyler Kendal here alongside Bloomberg's Michael Shepard in Washington. Joe, Matthew is off and we have a busy afternoon ahead. We'll bring you all of the updates, including an interview with Sir Peter Westmacott, former U.K. ambassador to the United States. He'll be here to talk about all the latest updates when it comes to the war in Ukraine as this White House ramps up the pressure for there to be momentum on the way forward. And it's not just our allies that are under pressure from the White House, but Federal Reserve Chair Jerome Powell, too. This week, our very own Michael McKee is live in Jackson Hole, Wyoming, fresh off of an interview with Fed vice chair of Supervision Michelle Bowman, who Michael Shepherd is a contender to potentially lead the central bank once Powell beats is his post as the chair. Her name has come up in discussions, but she was careful to demure on her interest and really focus on the task that she has as the chair of vice chair of supervision. She has a big task ahead of her, as she outlined in her interview with Mike, laying out the efforts to address what she referred to as deep banking, the issue affecting crypto, but also as President Donald Trump signaled in his executive order, perhaps some ideological bias behind banks behavior, too, when it comes to customers. Right, exactly. And there's other big stories that we're following here as well on Bloomberg, and we'll be talking about them throughout the hour, including one that I know that you watch closely, which has to do with the US potentially here becoming a stakeholder in Intel. Well, that's right. And this is a key moment really for the tech industry and especially for an iconic chip maker, and that is whether the US government will proceed with taking, as our colleagues here at Bloomberg have scooped a 10% stake in Intel. And that would make the US government the largest shareholder in this company. And it's something that's moving shares as we speak. Tyler And let's go to Charlie Pellet, the Voice of Bloomberg Radio and the New York subway for the latest on the markets. Hi, thank you very much. Very kind. We have got two Intel shares got to begin there because that stock surging 7%. Certainly a topic of conversation one. We'll have more on coming up on balance of power. But the Dow, the S & P, NASDAQ right now, we are at just about the lows of the day. Got to begin with Nasdaq because I'm looking at a sell off. It is intensifying there with the Nasdaq composite index down now by 313 points. That is a drop of one and a half percent. Keeping it all in context, the S & P just above 60, 400, down 40, now a decline there of 6/10 of 1%. Dow industrials down 13 on the Dow, a drop of just under 1/10 of 1%. A slide in the world's largest tech companies weighing on stocks. Big box retailers getting a boost from Home Depot's numbers this morning. Home Depot up now by 3%. The ten year 4.30% with the two year currently yielding 3.74%. Gold down $15. The ounce, 3317, a drop there of just about 4/10 of 1%, while West Texas Intermediate crude 6244 a barrel, down one and a half percent. And Bitcoin right now is lower. Bitcoin down 2.7% at 113,385 on Bitcoin metal platforms is splitting its newly formed Artificial intelligence group into four distinct teams and reassigning many of the company's existing employees. It's an attempt to better capitalize on billions of dollars worth of recently acquired talent. All of this, according to an internal memo Metro platform shares. They are trading lower now by 2.1%. Recapping, stocks declining, S & P down 39, down 6/10 of 1%. And for on demand news 24 hours a day. Subscribe to Bloomberg News. Now, wherever you get your podcasts back, we go to Washington. Once again, your hosts, Tyler Kendal and Michael SHAPIRO. Charlie Pellet in New York for us. Thank you, as always. As Charlie said, I'm Tyler Kendal here alongside Bloomberg's Michael Shepard in Washington, D.C., where it is already shaping up to be a busy news day. We had new reporting this morning from Bloomberg News. People familiar telling us that U.S. and European officials have already started working on plans to bolster Ukraine's military capabilities as part of any sort of security guarantees. This is going to be absolutely crucial in these negotiations going forward, since we know that an initial demand from the Kremlin was for Ukraine to abandon its defense industry, abandon Western military flows. And we heard from President Trump earlier today speaking in an interview with Fox News, laying out the stakes of what's happening here. I hope President Putin is going to be good and it is not going to be a rough situation. And I hope that Zelensky and President Wolinsky will do what he has to do is to show some flexibility also to be a part of that. But we've got the European nations and they'll frontloaded and they'll have some of them, France and Germany, a couple of them, U.K., they want to have, you know, boots on the ground. Not a not and I don't think it's going to be a problem, to be honest with you. I think I think Putin is tired of it. Tired of it. Joining us now for more is Bloomberg's national security reporter, Natalia DROZDIAK, who has been following the story, helps lead our coverage when it comes to foreign policy here at Bloomberg. And Natalia, something like one of the big takeaways yesterday was that we did see these firmer commitments from the White House, from President Trump when it comes to a U.S. backed security guarantee. But do we have any details on what this is actually going to look like in principle? Well, we did hear a bit more from President Trump today. I mean, he basically ruled out U.S. troops on the ground and and described a bit about potentially having air support to provide a sort of backstop to Western forces that would monitor some sort of peace in Ukraine once they reached that deal. But, you know, as you mentioned at the top of this, they're still trying to hash out the details right now. So we know that the national security advisers from Ukraine, the U.S. and the European nations are all trying to figure that out right now, especially ahead of the next meetings. Natalia, one of the bring up the next meeting and the idea from President Donald Trump and one shared by the European counterparts who were there yesterday would be a bilateral sit down between Vladimir Putin envelope to mirror Zelensky. But how would that work without perhaps a chaperone, for lack of a better word? And what sort of neutral location would even be feasible, given perhaps some of the U.S. president's estrangement of other neutral locations, potentially through tariffs, Switzerland and Brazil? Yeah, I think that's a great question. I mean, first off, we need to get Putin to actually commit to this because we haven't actually seen that yet. The Russians put out a statement yesterday saying they were exploring the idea of looking at more senior Russian and Ukrainian officials talking, but they didn't say anything specifically about Putin actually doing this. So we have to see first. But then in terms of of where this actually takes place, I think it's a really great question. You know, Switzerland was an idea that was thrown out there, but that's a country that has really clashed with Trump over trade. So that's pretty much ruled out Hungary is another option. But, you know, they have been a thorn in the Ukrainian side for many years, especially over the prospects of EU accession. So that seems unlikely. I think one area or one one place that where it might be possible would be in Turkey, because we've seen the last round of talks between the Ukrainians and the Russians at the lower level in May were held in Turkey. So that might be an option just in our final minute that we have with you, Natalia, what sort of reaction did we see from our European allies? Half a dozen of them descended here in Washington yesterday. I believe it was the German chancellor who said that this meeting actually exceeded his expectations. Yeah, I think we can't explain enough like how much anxiety there was going into this meeting from the Ukrainian and the European leaders just given what they had seen on on Friday when Putin and Trump had their big summit in Alaska, there was a lot of concern that Trump had essentially swung behind Putin and was disregarding concerns from the Ukrainian side. And, you know, as they after they met, there was a huge sense of relief also, because there wasn't another blow up in the Oval Office between Zelensky and Trump, as we had seen and in February. But then not only that, they also managed to pin Trump down on the security guarantee package. All right, Natalia DROZDIAK, we thank you, as always, for your coverage. A reporter here at Bloomberg News covering national security for us. As we were just talking about, the German chancellor Mursi came out yesterday. He spoke to reporters at the White House. And one of the topics of discussion, of course, we're talking a lot about security guarantees, but there were big questions to hear about what the future of territory is going to look like in any sort of potential deal. Here's what he told reporters yesterday about the potential for territory concessions. They did not strictly in the unspoken mixture or the one aspect which has not been discussed today is that Ukraine should not be forced to cede any territories entirely to Russia's a man the Kivu autonomous region is comparable, to put in perspective to a proposal that the US gave up. Florida. Florida 14. We're joined now by Sir Peter Westmacott, former UK ambassador to Turkey, France and the United States, and now a senior adviser at the Royal Institute of International Affairs in London. Sir Peter, thank you for being with us today. You have met with and know Keir Starmer well. Yes, we can hear you loud and clear. Sir Peter, thank you so much for joining us, sir. Peter President Trump is presenting a number of ideas around this peace plan in Ukraine. And then includes Europe, buying the EU, buying American made arms. No U.S. troops on the ground. No call for a cease fire yet. What is your read on the state of the American president's commitment to actually securing Ukraine for the long term? Well, I think what he's trying to do at the moment is to head off the demands that there have been from President Zelensky and from a number of European governments for Ukraine to be considered as a credible member of NATO. That is anathema, of course, to Putin, who doesn't want to have NATO's on his doorstep. He doesn't grasp, of course, that NATO is a voluntary alliance, but is defensive of countries, many of which were once under the Russian jackboot. He wants to rebuild the Russian Empire regardless of the wishes of the countries and the governments concerned. But, you know, leave that to one side. He has a real problem about Ukraine becoming eventually member of NATO. Now, if that's not going to be part of the deal and it perhaps can't be, then some sort of really strong military guarantees are going to be important. And that brings us to your point about, you know, how is that going to work? President Trump says no American boots on the ground. I don't know whether the French and the Germans and the British will want to have troops on the ground, but they will want to have them not very far away in the event that things do go wrong. Of course, although President Trump says that hundreds of billions of dollars of American taxpayers money have been spent on Ukraine so far, it's not entirely true. And of all the money that's gone on military equipment, 83% of it has gone to American defense companies. So, you know, it's not being just handouts. And so it's not surprising that he says that if there's to be more money, more arms, that they should be paid for by the Europeans. But it's already largely being paid for, shall we say, and it's already been good business for the American companies. But by saying we will strengthen Ukraine's defensive capabilities with this military equipment, then I think you're putting in place he's putting in place a credible alternative, I hope, to the possibility of eventual nature enlargement. That's what that's all about. It's about giving Zelensky and the others in Ukraine an assurance that if there is a deal and we haven't talked about territorial swaps and so on yet, we should come onto that. If there is a deal that is one that can be relied upon to be fair and lasting. Can we just dig down a little bit more on what this credible deterrence framework, what the look like? And as you're talking about the different sort of aspects that we could see, we keep hearing this idea about air cover and perhaps this is an area where the US would be pushing forward the most here. Can you give us some insight into how these negotiations are happening behind closed doors when it comes to what the U.S. would actually supply to a security guarantee to make sure that a potential deal would actually get through? Well, there's a lot of discussions still going on. There's a coalition of the willing meeting that was co-chaired by the French president and the British prime minister, I think today. There are military chiefs getting together in Washington. I think there's a lot of the detail of what it really means that has got to be worked out. But we do know from president's intensity that he would like to have I think he said ten different Patriot missile systems on Ukrainian territory. These are very expensive, but they are super effective and they are a very important part of the defense of Ukraine against ballistic missiles and other Russian hardware which might be fired there. Then I think other parts of it would be territorial guarantees. The president's talked about something that is Article five. In other words, an attack on one country is an attack on us all. That is to say that if Ukraine was attacked, then the coalition of the willing, if not NATO members themselves, would have regarded themselves as duty bound to come to help Ukraine. But there's an awful lot of detail on this military side that's got to be hammered out. And I'm not sure that President Trump is very clear where he wants it to be, but he has understood that there will not be a deal unless there is something like that. And there is an arrangement whereby Ukraine can have its own credible military deterrent and equipment to withstand any further attacks, because ultimately nobody trusts Putin to keep his word. Perhaps President Trump does, but nobody else does. Anyone who's dealt with him knows that, as we saw on the eve of the invasion of Ukraine, he lies through his teeth. So there's got to be something which is, you know, pretty strong and pretty credible. If the Ukrainian people in the Ukrainian government are to go along with it. Sir Peter, one thing President Donald Trump has made clear is his desire to move very quickly with this and outlined together with European leaders yesterday, a timetable of perhaps a bilateral meeting between the Russian and Ukrainian leaders within two weeks and perhaps a trilateral meeting, including him within three weeks. Is that overly optimistic and what are the risks of moving at this pace? Well, one of the benefits of having somebody like President Trump in the Oval Office is that he likes to move fast. You know, look at all the different things that he's done since he became president. Some of what we may like, some of you may not. But he doesn't hang around and he's a dealmaker, as he likes to remind us, regularly. So and he also would like to see an end to the killing, as would we all. So I think he wants to get on with this. He doesn't think there's any need for a cease fire, which is what Zelensky wants and what everybody else and the European side would like. And what the chancellor of Germany and the French president reminded him was a requirement for progress towards some sort of a settlement. He's now moved off that because Putin didn't want to have a ceasefire. He wants to go straight to a settlement, but to do a settlement in very short order. When you're talking about territorial issues and guarantees and Putin's desire, frankly, to dismantle the entire post-Cold War European order, you know, that's going to be very difficult. And that's that's a real problem. Let's let's hope that we can move fast. I think everybody would be delighted if there was rapid progress. But, you know, there are questions to be answered, such as what does the president mean by territorial exchanges or territorial swaps? Has anyone seen any sign of the Russians offering land of theirs in exchange for the land of Ukraine that they want to keep for themselves? I don't think we have. All we've seen is that there might just be the possibility of the Russians withdrawing from some little corners of Ukraine that they've already occupied in exchange for getting others. Well, that doesn't sound to me like a very fair deal, and I'm not sure that it would to President Zelensky either. So these territorial issues, as well as the military guarantees and the broader political questions that we've touched on, this does take time. But President Trump is a man in a hurry. He went to Alaska a couple of days later. There was everybody in the Oval Office. We've now got the coalition of the willing talking to each other. We've got military chiefs looking at the military guarantees question. It would be wonderful if we could make early progress, because each day that we speak, there are more people being murdered by Russian missile attacks on Ukraine. Sir Peter, in just the last 30 seconds that we have with you, I'd love to get your thoughts on what has been a relatively warm relationship between the UK Prime Minister Keir Starmer and President Trump throughout this process. What do you make of the evolution of this relationship, considering that the U.K. was the first to ink a trade deal, for example? Well, it was. And it started, I think, with a very successful visit to the Oval Office by Keir Starmer. Not everybody was convinced that it would work. You'd got President Trump who was willing to pull over and make our approach and somewhat protectionist. You've got Keir Starmer, who is a Labour politician, a free trader, you know, how is that going to work out? But I'm so sorry. We have to leave it there. Peter Westmacott, former UK Ambassador to the United States, we thank you so much for your time and joining Bloomberg. We'll catch up with you soon. But we're now going to go to a story that's going to take us to Wyoming, because that's where Federal Reserve Chair Jerome Powell will be in the spotlight later this week when he gives remarks at the Kansas City Fed's annual Economic Policy symposium. That's where we find Bloomberg's international economics and policy correspondent, Michael McKee, who's already there on the ground for us in Teton Village, Wyoming. And Mike, earlier today you sat down with the Fed vice chair of supervision, Michelle Bowman, who told you that she has a lot on her plate at the moment. What did we learn about how she's balancing priorities? Well, for right now, she says she's focusing on the regulatory issues instead of on whether or not the president is interested in making her the chairman to replace Jay Powell when he leaves office in May or to focus on monetary policy. Now, she did confirm that she hasn't changed her mind on the idea of rate cuts. That rate cuts should go ahead in September and all three remaining meetings this year. But she said the most important thing for her is getting some of these legislative proposals through. One of the ones she's talking about now is the supplementary leverage ratio. Another is the Basel three reforms. The Biden administration had put out a thousand page document on that that the Fed has basically recalled and is rewriting under her. And then, Dee, banking at issue for the people here where we are today, the the crypto conference, basically the Wyoming blockchain conference and a lot of people here concerned that banks don't want to take out of their business because of reputational risk. She says the Fed is going to be taking care of that. Yeah, Mike, widening the angle from the conversation with Michelle Bowman. What are you expecting to hear from Fed policymakers and other attendees there in Jackson Hole when it comes to tariffs? And the impact on the economy and how that may be influencing the September rate decision, which some are looking at as a possible cut. Well, I think pretty much everybody agrees that tariffs are inflationary and they are causing some inflation. It's been a question of how fast we see it, and we're beginning to see it more and more in the CPI, CPI and other indicators. Companies are coming out and talking about raising prices. But then the converse is what's happening with the labor market. We had a very low number of people hired in the last month and the unemployment rate went up a little bit. Does that signal that we're seeing the economy slow down enough to justify a rate increase or does inflation mean that they don't want to cut rates? And that's the debate they're going to have. And we'll hear from different people on the Fed about which way they are leaning at this point. We know Boeing and Chris Waller have said they would vote in favor of a rate cut. The other members of the Fed have been somewhere along a spectrum from probably to no, not yet. We're going to wait for more data. Powell said that data can find when he speaks on Friday. We expect him to sort of dance around the issue and say, we'll wait and see what the data tell us between now and then. Okay. We'll look forward to hearing more from you. Mike, thank you so much. We're going to now turn to our political panel, Jeanne Shaheen, Shan Zaino, senior democracy fellow with the Center for the Study of the Presidency in Congress and a Bloomberg Politics contributor, and Lester Munson, principal of the International Practice at the BGR Group here in Washington. Jeanne, I wanted to start with you again. We can turn to this whole question of tariffs. We did see a little bit of upside when it comes to the U.S. credit rating thanks to the tariff revenue coming in. But let's talk maybe about some of the downside that we could be seeing for consumers down the road. The administration is now widening the the application of some of those metals tariffs that were announced just weeks ago. That's right. And that's what we've all expected by some estimates. And we've heard this on Bloomberg repeatedly from some of the economic experts. It's going to be $2,000 per household as a result of these tariffs. And as we get into school shopping season and then certainly for the holidays, consumers will feel that. And we saw from the University of Michigan Consumer Sentiment survey released just the other day that consumers are concerned that they are not as confident in the economy going forward. And there is an upside to this revenue coming in, of course, as you mentioned. But the downside is, is that tariffs are taxes and so that money is not coming from foreign countries. It's coming from U.S. companies who will, if they're not already passed the price of those tariffs on to consumers in the United States. So there is a tendency to talk about these as tariffs on other countries. Of course, they're tariffs we pay as Americans to bring this material in. And companies pay for a certain amount of time until they pass them off to consumers. Well, I want to build on this headline that we did get today that S & P global ratings said that that tier of revenues will help soften the blow to the U.S. fiscal health. Our article on the Bloomberg says, quote, While Trump's trade war has rattled markets, unnerved foreign governments and provoked criticism from leading economists, S & P affirmed its double A-plus rating for the U.S.. Lester, how does the White House balance this with the argument that Gene and Democrats are going to be making ahead of 2026? We're already hearing it when it comes to the push and pull here with the tariff policy. Well, I don't happen to agree with the administration on its tariff policies, so I'm much more likely to agree with Jeanie. I think in the long run, tariffs are not at all beneficial to the American economy. There can be strategic moments when you need to protect a certain industry over a couple of years if you're very consistent and very determined and very focused. You can do some limited good. They can also be a tool to help other countries or to kind of compel other countries to lower their tariffs for American goods and services. But as a long term strategy, it doesn't make a lot of sense, even if there is some income coming into the U.S. Treasury as a result of this, that's effectively a tax on Americans, and it's generally a very regressive tax. So it's it falls more harshly on people who can least afford that kind of additional cost. So I think it's not a it's not a smart move. It may help the FISC a bit over the short term, but again, in the long run, a tariff policy is is kind of doomed to failure. The U.S. has benefits from open trade, free trade. And if we can find those, go back to those multilateral deals will be in a much better position than under this current structure. Genie, we've talked here about tariffs, but I want to get to another element of the president's policy when it comes to companies in particular. And we've seen news broken by Bloomberg over the past week about possible U.S. investments in Intel, the struggling chip maker, and yet an iconic one for the United States of America. Is this a good policy move? It certainly is a pivot for the Republican Party away from a very much hands off approach when it comes to the corporate sector. Yeah, absolutely, Mike. And it has been fascinating to watch how Donald Trump has dominated and changed the Republican Party in so many ways. I mean, we were just talking, of course, about isolationism a few minutes ago. And in terms of his approach to fiscal policy, as Lester just mentioned, tariffs, of course, and now this. And I think Donald Trump in this regard is representing, well, what he run brand as, which is a populist. And this is something that he can turn to his base and say, this is what we are. We are joining with these companies. This is what we are asking of them. So it is quite a shift for the Republican Party in this regard. And I think it's something that we will hear more about during the campaign. Donald Trump likes to tout his relationships with the business community, and he wants to show that it's going to benefit his base. And so I think that's what he's setting up for 2026. And of course, for the Republican Party going forward. We do want to bring you some breaking news here at the White House. Press Secretary Caroline Levitte is briefing reporters in the White House briefing room as we speak. If you're watching us on Bloomberg Television and for our radio listeners, you see Caroline Levitte there at the podium taking questions and some headlines crossing the terminal in just the last few moments. Levitte says that the president has ruled out boots on the ground in Ukraine as our allies are talking about those security guarantees in any such potential peace deal. She also said that accommodations for a Putin Zelensky meeting is underway. That is that bilateral meeting that we heard President Trump talk about in his post on true social yesterday. But we have yet to get confirmation from the Kremlin that that meeting is going to take place. Lester, to get your thoughts on the strategy here as we bring the conversation back to foreign policy and the meeting that we saw yesterday here in washington, what sort of strategy are we seeing from the White House as they try to show some forward progress and forward momentum here, getting all of these leaders together at the White House? Well, no surprise on the no U.S. troops on the ground. I think we all kind of knew that going into this whole scenario that that just wasn't very realistic. But if it's true that we're pushing towards a Putin Zelensky meeting, that is a modest victory for President Trump. Of course, those two have not talked. They're at war with each other. And if he can get them in the same room and at least begin some sort of discussion about a way forward here, that is that is exactly what President Trump has been outlining. It is effectively what he ran on last year. American people do not want to commit their own blood and treasure to this conflict any longer through our democratic process. We have learned that. So this is this is kind of the logical place to be. If he can use his very considerable diplomatic heft to promote these meetings. And good for President Trump. Of course, it remains incredibly difficult to get a deal here. Jimmy was right earlier in the show. This is this is a this is the thorniest issue there is in the world today, except perhaps for Gaza. So President Trump's taking out a big, big, big challenge. But this could be a significant step forward for him. All right. Our political panel today, Jaenisch and Zeno, senior democracy fellow with the Center for the Study of the Presidency and Congress, and Lester Munson, principal of the International Practice at BGR Group and a Republican strategist. We thank you both for being here on a busy news day. We're going to be following all of these developments. We'll bring you more headlines out of Caroline Levitt's press conference as they come through. And we have more conversations up ahead. You're not going to want to miss this one. We have. And Neuberger, the former deputy national security adviser for cyber and emerging technology in the Biden administration. We're going to talk about that. Bloomberg News reporting about a potential U.S. stake in Intel, the race for dominance in the air space with China. Stick with us. This is balance of power on Bloomberg TV and radio on Tower Kendall alongside Michael Schmidt. The markets and Washington are watching this big story today when it comes to Intel. Commerce Secretary Howard Lutnick confirming a Bloomberg News scoop that discussions are underway between the U.S. and Intel for the government to take a stake in the chipmaker, casting the plan as a bid to convert Chips and Science Act grants in to equity. This would be a big step. This could bolster the company's finances at a time when we've seen Intel has been slashing spending and cutting jobs. And lucky for us, my co-host today is Michael Sheppard, who happens to be our expert when it comes to the industry. He is our senior editor for tech and strategic industry. So, Mike, what do we have to know about this potential deal, particularly how it's structured here? How is this unique? Well, the structure remains a bit fluid, but our understanding is that they intend to take some of the money that was going to be allocated over time to Intel as part of the CHIPS Act and do it much more quickly and give the government in return equity an equity stake in the company. And that would amount to about 10% of Intel and it would make the U.S. the largest shareholder in this iconic chip maker, the one that really put the semiconductor industry on the map and, you know, coined in a way the words Silicon Valley. If you think about a tiler, it really is an iconic venture and it's one that the U.S. and certainly the Biden administration also made its own efforts to try to shore up domestic chipmaking. But some of the questions Howard Lutnick did answer were what governance role would the U.S. have? Would it take a board seat? Would it get a golden chair? At least for now? It doesn't look like that is going to be the case. But that could all change. The negotiations are still underway. It's still kind of a fluid situation. So we will have to see what emerges. And of course, Intel is up today because they also got good news of an investment from SoftBank, a $2 billion equity stake from them to help on the artificial intelligence front. So there's a lot of movement in this whole chip space right now. Well, a lot of movement, right, because this does seem like perhaps a reversal from President Trump, Right. Because just a couple of weeks ago, he was calling for the ouster of the head of Intel, right after we saw this inquiry or this request for documents from a leading U.S. senator over some ties to China. It really was an extraordinary turnabout because you saw it within a matter of days, the president pivot from calling essentially for lip button, the intel CEO to resign to them, welcoming him to the White House and then essentially calling him a great leader and a great CEO, embracing whatever vision he may have presented to the president about turning the company around. And yet the turnaround that Putin is pushing may not comport entirely with the U.S. effort to try to get more investment in the chip industry. It's an expensive proposition and it also requires a lot of customers for Intel. So this is a major challenge for the company and for the government. And we'll have to see what tension there is between the two. And we're pleased today to be joined by in Neuberger. She is the pain distinguished lecturer at Stanford University and a former deputy national security adviser in the Biden administration for cyber and emerging technology. And thank you so much for joining us. And we do want to stay on our main story of the moment in this area of tech with Intel. The question I have for you is what are the risks of the U.S. actually taking a stake in such a critical company and essentially becoming an owner and owning whatever problems it may have to be with you. Mike, thank you so much. You know, so the core risk is that doesn't achieve the overall goal. What's the overall goal? I think we know that the global semiconductor supply chain is both fragile and concentrated, while over just about 50% of chips are designed by American companies, only 12% of chips are manufactured in the United States, and 92% of the most advanced chips are manufactured in Taiwan, which gives both a unique dependence on the economic side and from a national security perspective, it's deeply concerning with regard to potentially a crisis around Taiwan and the dependence on manufacturing in Taiwan. So the goal of a U.S. investment would be to essentially help in this strategic sector, help the company be successful, because having domestic U.S. manufacturing is so critical because of the range of uses of semiconductors, from defense and military to critical infrastructure all the way through to connected toys our children play with. And at the same time that we've seen the Trump administration discuss whether to buy a portion in essence of any. We've also seen them open the door essentially to India to resume sales of some of its air chips to China and perhaps even sell a downgraded version of its more advanced Blackwell A.I. chip to Chinese customers. Is this a good idea? The Trump administration certainly thinks so in terms of disseminating the US tech stack. But what are the risks embedded in that strategy? As you know, both are core to the larger strategic tech competition the U.S. has with China, right? The goal of the first in equity stake would be to say the potential is to take the model that worked with the 2000 bailout of the auto industry, an equity stake tied to outcomes restricted to a time period, again, tied to those outcomes, and replacing the Biden administration approach, which was grants and loans, which is see you have Intel said was taking too long and potentially has the risks of you know, reducing the competitiveness of the company. So that's what's driving in terms of the broader US-China tech competition and ensuring there's a sovereign capability for chips on the high end in video chips. And AI is a strategic arena, both because of the application of A.I. for military and intelligence capabilities, as well as the broader economic competitiveness that we believe A.I. over time will drive across industries. So as a result, currently the highest end U.S. chips manufactured for air manufactured in the U.S. and balancing providing them to China, or whether a broader uptake of the US A.I. stack would drive global development on U.S. chips. Is the trade off the Trump administration has been thinking about and making? A number of people criticize the decision to provide high end chips to China because of a concern it will advance Chinese military capabilities. Certainly, CEO of NVIDIA makes the case that it will deepen global reliance on the US tech stack for this critical new industry is being built on A.I.. We do want to bring in some breaking news headlines from the White House press secretary who has now concluded her briefing at the White House. But as we're having this conversation, she was also having this conversation with reporters commenting on this story on Intel, saying that the Commerce secretary, Howard Lutnick, is currently ironing out the details of that deal. She said that it is a creative idea, in her words, as we try to glean some more details about what its structure is actually going to look like. And she adds that President Trump's interest in this really does have to do with a reshoring of manufacturing to build on this conversation. And can you just give us a little bit more context here about the urgency that the U.S. is facing when it comes to competitiveness in this space and how the White House is dealing with those those different factors here to try to strike a balance between making sure that our producers, our companies have enough time to move their supply chains, but also keeping up with this idea that we are in this race with China. Absolutely. So the core issue is around manufacturing of advanced edge semiconductors. And that's where, you know, there is an urgency in changing Intel's course. Intel's facility foundry plant in Ohio has been delayed until 2030, so accelerating the timeframe for foundry capability. So there is a backup in the United States is key. With that said, you know, chips are components used across industries. Companies have supply chain. So having more reliance and understanding of when chips will be available in the U.S., at what quantities, frankly, at what sizes larger and which are used in consumer products all the way through to the most refined smaller semiconductors, which are used in high end products. So really having a knowledge of helping Intel meet its timelines and tying potential equity stake to those timelines also would give greater assurance to the number of sectors relying on chips because so much of manufacturing is still just in time, one needs to rely on knowing when chips will come where. And I wanted to pivot a little bit to the other area of your expertise, and of course that is cybersecurity. And I wanted to ask you about how much artificial intelligence is changing the game when it comes to both defensive and offensive cyber security operations. It's a game changer across Booth. First, it's always easier to be on attack than defense, right? An attacker has to find one way in. A defender has to be monitoring every virtual door and window. What we're seeing now on the attack side is more attackers leveraging it for spear phishing, very focused emails that get people to click on them that are often the first point of entry and. Compromise, making them more believable. We're seeing that on offense. I think we also can anticipate that we'll see more advanced attacks, multi-stage attacks that use A.I. to adjust as a defender tries to defend. And I am concerned that one of the first areas we'll see that is in the burgeoning ransomware industry where criminals often in safe haven countries like Russia, try to attack companies that have insufficient defenses in order to force them to pay a ransom to get back their data or get back the operations of their networks. On the defense side, I can be a game changer in terms of actually helping identify misconfigurations in a network making sense of firewall logs that are often hard to pass and automating a lot of the manual work around cybersecurity. We're just seeing companies build in A.I. for defense. Google announced, you know, they had used an AI capability to find a major vulnerability in one of their products and patch it. Dafa at the recent Hackers conference announced a second phase as well of using A.I. to not only find but patch vulnerabilities. So the race is on. It will advantage both. And I think the race is really on to see which one advances further. Well, to put a finer point on this, and you had a really fascinating piece in Foreign Affairs earlier this month, and I want to pull a quote from it. It's titled that China is Winning the Cyber War. And you write that China's cyber dominance extends well beyond the telecommunications espionage going on to say these intrusions show little evidence of traditional intelligence gathering. In your view, in your expertise, what is the biggest, most urgent action that the U.S. government could take right now to fend off these threats when it comes to competition with China, fundamentally using AI for defense? So we're in a battle between democracies like the U.S. and authoritarian countries like China. In democracies, traditionally, governments haven't monitored the critical power, water and pipelines that underpin American lives because they're privately owned. And traditionally, governments have monitored privately owned networks in countries like China. Not only are pipelines, water and power companies, often state owned enterprises, but China has a great firewall where they monitor for both surveillance, obviously of their citizens, but also for cyber attacks. And they can block those attacks in line. So the asymmetry between the models means that in the U.S., we are at a disadvantage. We need to use AI to find and fix the most critical vulnerabilities in our critical infrastructure that Americans rely on. A.I. gives us the way to pull that data together, simulate attacks, and make the investments most purposeful for the attacks that could actually disable large amounts of critical infrastructure. So that could work within our model and a partnership between government agencies like the Department of Energy building digital replicas of our energy grid to model attacks and then work with companies to fix the most critical vulnerabilities. All right. And Newberger Payne, distinguished lecturer at Stanford University and former deputy national security adviser for cyber and emerging technology in the Biden administration. We thank you so much for your insight on that fascinating conversation about the competition with China when it comes to artificial intelligence. Thank you for joining us today on the early edition of Balance of Power. We'll have more for you here out of Washington at 5 p.m. Eastern Time. Tyler Kendall here alongside Bloomberg's Michael Shepard. Bloomberg Businessweek Daily is up next. Stick with us. This is what.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9892578125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.93603515625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.7158203125
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.57666015625
    },
    {
      "name": "/News/World News",
      "score": 0.40576171875
    }
  ],
  "sentiment": {
    "positive": 0.22204365,
    "negative": 0.26023784,
    "neutral": 0.5177185
  },
  "summary": "President Trump has called on Russia and Ukraine to be flexible and reach a peace deal, according to Bloomberg News. Work is already underway between U.S. and European officials on potential security guarantees for Ukraine. Federal Reserve Chair Jerome Powell is also under pressure from the White House, following an interview with Fed vice chair of Supervision Michelle Bowman. The news comes as the US government considers becoming a 10% stake in Intel, potentially making it the largest shareholder in the company. Meanwhile, the Nasdaq composite index is down by 313 points, with S&P down 6%. Bitcoin is lower, with 2.7% at 113,385 on Bitcoin metal platforms.",
  "shortSummary": "President Trump urges Russia and Ukraine to be flexible and reach a peace deal, amid declining stock, significant economic developments, and Fed speculation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5615a9b6365645d7a72d68e5c20dc3ad",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Bloomberg’s ‘Balance of Power’ covered Trump’s push for a Ukraine peace deal without U.S. troops, European security guarantees, and a potential U.S. stake in Intel; it also discussed Fed policy at Jackson Hole, tariff impacts, and AI in cyber warfare. Trump’s administration is moving fast on a bilateral Putin‑Zelensky meeting and is exploring a 10% Intel equity stake to boost domestic chip manufacturing. European leaders emphasized the need for credible military deterrence, while the Fed’s vice‑chair highlighted regulatory priorities and possible rate cuts. The show also touched on tariff revenue, consumer costs, and the broader U.S.–China tech competition.",
  "argos_id": "I35H3FBSN"
}