{
  "url": "https://finance.yahoo.com/news/eastern-intangible-heritage-meets-world-040300370.html",
  "authorsByline": "PR Newswire",
  "articleId": "d13d003ea7f7442786e8a7226b6fa54d",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/prnewswire.com/d3ff179ea1e2cb82dcc1336cf93ac5d8",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T04:03:00+00:00",
  "addDate": "2025-08-25T04:13:32.404608+00:00",
  "refreshDate": "2025-08-25T04:13:32.404610+00:00",
  "score": 1.0,
  "title": "When Eastern Intangible Heritage Meets the World Stage: Liaoning's Craftsmanship Blossoms at Expo 2025 Osaka",
  "description": "A report from China Trade News.",
  "content": "Inside the China Pavilion at Expo 2025 Osaka, Kansai, Japan, a cultural feast steeped in Liaoning's history and brimming with its innovative spirit is unfolding. Under the banner \"Poetic landscapes，Boundless vitality\", Liaoning Week employs intangible heritage showcases, live performances and exhibitions to reveal the province's distinctive cultural charm.\n\nAmong them, on-the-spot showings of traditional skills steal the limelight: Xiuyan Paper-cutting, Tieling Errenzhuan, Liaoxi Puppetry and Jinzhou Shaobei Boxing all shine beneath the Expo spotlights, evoking a cross-border cultural resonance.\n\nAt the intangible-heritage showcase, the booth of Wang Xinli—master of Xiuyan Paper-Cutting—was surrounded by an international crowd. Scissors in hand, she moved lightly across a sheet of crimson paper; in mere moments, a vivid \"cloth tiger\" sprang to life. The exhibition also featured a special piece that re-imagined the celadon flying-fish water pot from Liaoning Museum through the folk aesthetic of Xiuyan paper-cutting, delighting visitors on site.\n\nIn the southern square of the China Pavilion, the lively strains of Tieling Errenzhuan draw another crowd. Performers brandish folding fans, tap rhythmic steps and trade verses in perfect sync, transplanting the essence of Northeast China onto the Expo stage. \"Speaking, singing, acting, dancing and stunts\" are Errenzhuan's trademarks; soaring vocals, lacing with the flavor of Northeastern Chinese Drum Singing and Pingju Opera, and driven by suona and banhu, instantly igniting the square.\n\nSharing the spotlight is Jinzhou Shaobei martial arts from Jinzhou city of western Liaoning. Widely practiced across the Northeast China, the Jinzhou Shaobei martial arts emphasize explosive power tempered by softness, pursuing the union of hard and tender. \"Dual training\" (stances, chops, swings and stake-hitting) integrates hand, eye, body, leg, footwork and breath; \"Four arts\" encompass boxing, weapon using and Qigong altogether. During Liaoning Week, visitors are all enjoying this marriage of might and grace.\n\nThe intangible-heritage puppetry of Liaoning is equally captivating. Masters animate delicate marionettes in classic episodes. Silk sleeves flutter, pupils flash; every subtle gesture prompts a flurry of mobile-phone recordings.\n\nBeyond heritage demonstrations, Liaoning presents an original art form: the Chinese Knife+Carved Painting. Departing from the usual adding color technique using in traditional painting, the technique is like revealing color by subtraction. The artist wields a knife instead of a brush, carving specially coated paper to expose underlying hues and preserve every blade mark. The meticulous precision of Gongbi painting merges with the decisiveness of incision; minute variations in pressure, angle, direction and sequence trigger chromatic metamorphoses—dense or sparse, near or far—so that robustness and delicacy, realism and impression intertwine on a single sheet. Tourists lingered at the showing, unwilling to leave.",
  "medium": "Article",
  "links": [
    "https://mma.prnewswire.com/media/2756753/1.html",
    "https://mma.prnewswire.com/media/2756754/2.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Liaoning Week",
      "weight": 0.075117916
    },
    {
      "name": "Jinzhou Shaobei martial arts",
      "weight": 0.072872266
    },
    {
      "name": "Liaoning Museum",
      "weight": 0.07217997
    },
    {
      "name": "Liaoning",
      "weight": 0.07030109
    },
    {
      "name": "western Liaoning",
      "weight": 0.07019529
    },
    {
      "name": "intangible heritage showcases",
      "weight": 0.065474935
    },
    {
      "name": "Jinzhou Shaobei Boxing",
      "weight": 0.059908465
    },
    {
      "name": "Jinzhou Shaobei",
      "weight": 0.059455093
    },
    {
      "name": "Tieling Errenzhuan",
      "weight": 0.058699463
    },
    {
      "name": "crimson paper",
      "weight": 0.057426106
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Events & Listings/Other",
      "score": 0.720703125
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Expos & Conventions",
      "score": 0.69580078125
    },
    {
      "name": "/People & Society/Other",
      "score": 0.6494140625
    },
    {
      "name": "/Business & Industrial/Business Services/Corporate Events",
      "score": 0.61669921875
    },
    {
      "name": "/Arts & Entertainment/Visual Art & Design/Other",
      "score": 0.53662109375
    },
    {
      "name": "/Arts & Entertainment/Visual Art & Design/Art Museums & Galleries",
      "score": 0.40185546875
    },
    {
      "name": "/Reference/Humanities/History",
      "score": 0.34716796875
    }
  ],
  "sentiment": {
    "positive": 0.33994618,
    "negative": 0.16434711,
    "neutral": 0.4957068
  },
  "summary": "Liaoning Week, a cultural feast at Expo 2025 Osaka, Japan, has been held under the banner of \"Poetic landscapes\" and \"Boundless vitality\". The event includes intangible heritage showcases, live performances, exhibitions, and cultural performances. Traditional skills such as Xiuyan Paper-cutting, Tieling Errenzhuan, Liaoxi Puppetry, and Jinzhou Shaobei Boxing were featured. The Chinese Knife+Carved Painting was created using a knife instead of a brush to reveal color by subtraction. The performances and demonstrations of Jinzhou Shoobei martial arts were also featured.",
  "shortSummary": "Liaoning's traditional skills and cultural treasures dominate Expo 2025 Osaka, with exhibitions like Xiuyan Paper-cutting, Tieling Errenzhuan, and Jinzhou Shaobei martial arts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "695b982ab76446c0b12cd2d742ce7fa7",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "At Expo 2025 Osaka, the China Pavilion’s Liaoning Week showcased the province’s cultural heritage through live performances and exhibitions, highlighting Xiuyan paper‑cutting, Tieling Errenzhuan, Liaoxi puppetry, and Jinzhou Shaobei boxing. Master artisans demonstrated traditional techniques—such as Wang Xinli’s rapid paper‑cut tiger and the dynamic Errenzhuan verses—drawing international crowds. In addition, Liaoning introduced an innovative art form, the Chinese Knife+Carved Painting, where artists carve coated paper to reveal colors, blending meticulous Gongbi detail with decisive incision. The event celebrated Liaoning’s blend of historical tradition and creative innovation, engaging visitors with both familiar and novel artistic expressions.",
  "argos_id": "I9ACRFYEQ"
}