{
  "url": "https://www.bloomberg.com/news/videos/2025-08-21/balance-of-power-late-edition-8-21-2025-video?srnd=phx-politics",
  "authorsByline": "bn",
  "articleId": "11035e1fb6174b17a12686ca68e9e9fc",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ik8vneNG2O2c/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T23:54:57.213000+00:00",
  "addDate": "2025-08-22T00:24:17.711999+00:00",
  "refreshDate": "2025-08-22T00:24:17.712002+00:00",
  "score": 1.0,
  "title": "Trump Visits Police, Military Patrolling DC",
  "description": "\"Balance of Power: Late Edition\" focuses on the intersection of politics and global business. On today's show, Former Vice President Mike Pence shares his thoughts on President Trump calling for Federal Reserve Governor Lisa Cook to resign hoping these allegations are not part of a pressure campaign. Don Vultaggio, AriZona Beverage Company Co-Founder & Chairman, discusses how. President Trump's tariffs are threatening to increase the price tag of the company's iced teas. Federal Reserve Bank of Chicago President Austan Goolsbee discusses the \"mixed messages\" being sent by recent US economic data. (Source: Bloomberg)",
  "content": "> > THIS IS \"BALANCE OF POWER\" LIVE FROM WASHINGTON, D.C. TYLER: FROM BLOOMBERG'S WASHINGTON, D.C. STUDIOS, WELCOME TO \"BALANCE OF POWER.\" MICHAEL: THE DOJ SIGNALING PLANS TO POTENTIALLY INVESTIGATE FEDERAL RESERVE GOVERNOR LISA COOK FOLLOWING ALLEGATIONS OF WRONGDOING AS A TOP OFFICIAL ENCOURAGES HER REMOVAL. THE LATEST FROM THE WHITE HOUSE AHEAD. TYLER: THE PRESIDENT DEFENDING HIS DECISION TO SEND NATIONAL GUARD INTO WASHINGTON, D.C., SUGGESTING JOINT TROOPS COULD BE PATROLLING THE DISTRICT AS EARLY AS THIS EVENING. MICHAEL: ALSO TONIGHT, TEXAS IS ONE STEP CLOSER TO REDRAWING ITS CONGRESSIONAL MAPS, SETTING OFF A REDISTRICTING STANDOFF WITH BLUE STATES LIKE CALIFORNIA AS NEXT YEAR'S MIDTERMS TAKE SHAPE IN REAL TIME. TYLER: WHERE LIVE FROM JACKSON HOLE ONE DAY BEFORE JEROME POWELL TAKES THE STAGE. WE PREVIEW WHAT IS NEXT AND LIVE REACTION TO THE DEVELOPMENTS AROUND LISA COOK WHEN AUSTAN GOOLSBEE JOINS US. MICHAEL: WE BEGIN WITH DEVELOPMENTS IN THE PRESSURE CAMPAIGN ON THE FED, MORE SPECIFICALLY, FEDERAL RESERVE GOVERNOR LISA COOK. THE DEPARTMENT OF JUSTICE POTENTIALLY INVESTIGATING COOK FOLLOWING ALLEGATIONS OF MORTGAGE FRAUD. A DOJ OFFICIAL SIGNALING JEROME POWELL SHOULD FIRE COOK, DESPITE THE FED GOVERNOR DENYING ANY WRONGDOING AND PUTTING OUT A STATEMENT SAYING SHE WILL REMAIN IN OFFICE. FEDERAL HOUSING AND FINANCE AGENCY'S DIRECTOR SPOKE TO ROMAINE BOSTICK A SHORT TIME AGO. HERE WAS HIS REACTION WHEN PRESSED ON THE WHITE HOUSE'S ROLE ON THE COOK INVESTIGATION. ROMAINE: AT THE SAME TIME, WE ALSO HAVE RAISED CONCERN ABOUT THAT THIS MIGHT BE A WEAPONIZATION OF YOUR OFFICE, A WEAPONIZATION OF THE WHITE HOUSE, AND I AM CURIOUS IF THERE HAS BEEN DIRECT -- I DON'T KNOW -- GUIDANCE FROM THE WHITE HOUSE TO PURSUE THIS? BILL: WE DISCOVERED THIS WITHIN THE CONFINES OF OUR CHARTER THAT CONGRESS HAS GIVEN US. WE CONTINUE TO RECEIVE TIPS WITHIN THE CONFINES THAT CONGRESS HAS GIVEN US. AS I SAID, PEOPLE CAN GO AND EMAIL US. THEY CAN SEND US TIPS. WE ENCOURAGE THAT TO HAPPEN, AND THAT IS HOW THIS WAS SOURCED. MICHAEL: JOINING US WITH THE LATEST FROM THE ADMINISTRATION IS BLOOMBERG'S KATE SULLIVAN, WHO JOINS US FROM THE WHITE HOUSE NORTH LAWN. GIVE US A SENSE OF THE LATEST. WE ARE HEARING THAT THIS IS PART OF A WIDENING ANGLE ON THIS QUESTION OF MORTGAGE FRAUD. KATE: THAT'S RIGHT. I THINK WHAT WE ARE SEEING IS THIS IS PART OF A BROADER PRESSURE CAMPAIGN. THE DOJ, AS YOU MENTIONED, SIGNALED IT WOULD START AN INVESTIGATION INTO LISA COOK AND IS URGING CHAIR POWELL TO REMOVE HER FROM THE BOARD OF GOVERNORS, BUT IMPORTANTLY, POWELL DOES NOT HAVE THE LEGAL AUTHORITY TO DO THAT. THE ONLY PERSON WHO DOES IS THE PRESIDENT, AND EVEN IF THAT WERE TO HAPPEN, THERE WOULD HAVE TO BE BECAUSE -- THEY WOULD HAVE TO BE BECAUSE -- THERE WOULD HAVE TO BE CAUSE, AND FROM HAS SAID HE WOULD PREFER HER TO RESIGN INSTEAD. THIS IS OVER ALLEGATIONS THAT COOK FABRICATED MORE FAVORABLE BANKING DOCUMENTS TO GET A MORE FAVORABLE LOAN. TAYLOR: -- TYLER: ANOTHER STORY IS THAT PRESIDENT TRUMP SAYS HE MAY JOIN POLICE AND MILITARY HERE IN THE DISTRICT. WHAT SHOULD WE BE WATCHING OUT FOR LATER TONIGHT AS THIS UNFOLDS? KATE: TRUMP CALLED IN TO A RADIO SHOW EARLIER TODAY AND SAID THAT HE WANTED TO JOIN POLICE OFFICERS AND MEMBERS OF THE MILITARY AS PART OF A PATROL ON D.C. STREETS TONIGHT. RIGHT NOW, THE PLAN IS FOR THE PRESIDENT TO MOTORCADE TO A LAW ENFORCEMENT STAGING POINT IN THE CITY AND ADDRESS AGENTS WHO ARE PART OF THIS EASY OPERATION. I THINK THE OUTING IS CLEARLY TRYING TO HIGHLIGHT TRUMP'S EFFORTS, HIS QUITE STUNNING FEDERAL TAKEOVER OF THE D.C. POLICE AND THE DEPLOYMENT OF THE NATIONAL GUARD TO D.C., REALLY, AS HE MAKES A VERY AGGRESSIVE AND BIG SHOW TO CRACKDOWN ON CRIME IN D.C. TYLER: WE THANK YOU AS ALWAYS FOR YOUR REPORTING. JOINING US FOR REACTION TO THAT AND MUCH MORE, I'M PLEASED TO SAY, IS THE FORMER VICE PRESIDENT OF THE UNITED STATES, MIKE PENCE. VICE PRESIDENT PENCE, THANK YOU FOR BEING HERE. I WANT TO START WITH ONE OF THE TOP STORIES WE ARE FOLLOWING TODAY WHICH HAS TO DO WITH THE PRESSURE CAMPAIGN FROM THE WHITE HOUSE WHEN IT COMES TO THE FEDERAL RESERVE. YOU TOLD BLOOMBERG TELEVISION LAST MONTH THAT THE PRESIDENT NOT TO BE ABLE TO EXPRESS HIMSELF WHEN IT COMES TO BE FED, BUT I WANT TO GET YOUR THOUGHTS ON THESE LATEST ALLEGATIONS AGAINST FED GOVERNOR LISA COOK. FMR. VP PENCE: CERTAINLY I THINK IT IS APPROPRIATE FOR LISA COOK TO RESPOND. I KNOW THE PRESIDENT IS CALLING ON HER TO RESIGN, BUT SHE HAS A RIGHT TO DEFEND HERSELF. I DID READ TODAY THAT FEDERAL HELLO HAS FOUND MORE THAN 22,000 AMERICANS THAT HAVE FILED MORTGAGES, CLAIMING TWO RESIDENCES AT THE SAME TIME, SO I THINK SHE SHOULD HAVE A CHANCE TO ANSWER FOR IT, BUT WHAT I HOPE IS THAT THE EFFORT TO PUSH OUT ANOTHER MEMBER OF THE FEDERAL RESERVE IS NOT SIMPLE PART AND PARCEL OF AN EFFORT TO GET JEROME POWELL, WHO OUR ADMINISTRATION APPOINTED AS CHAIR, TO LOWER INTEREST RATES OR OTHERWISE TAKE ACTION THAT WOULD NOT OTHERWISE BE JUSTIFIED. I UNDERSTAND THE PRESIDENT'S FRUSTRATION WITH CHAIRMAN POWELL, AND HE IS ENTITLED TO SPEAK OUT ABOUT THAT, BUT MY HOPE IS THAT THESE LATEST ALLEGATIONS ARE NOT SIMPLY PART OF THAT OVERALL PRESSURE CAMPAIGN AND CAN BE GIVEN AND AFFORDED THE DUE PROCESS THEY DESERVE. MIKE: WE WOULD LIKE TO RETURN TO ANOTHER TOPIC WE HAVE BEEN COVERING CLOSELY THIS WEEK, THE QUESTION OF THE PRESIDENT'S EFFORT TO END THE WAR IN UKRAINE THROUGH A SETTLEMENT BETWEEN THE PRESIDENT OF UKRAINE AND HIS RUSSIAN COUNTERPART. YOU HAVE MET VLADIMIR PUTIN BEFORE. DO YOU BELIEVE PRESIDENT TRUMP IS PERHAPS PUTTING TOO MUCH TRUST IN THE RUSSIAN LEADER AND HIS WILLINGNESS TO END THE WAR? FMR. VP PENCE: I HAVE MET VLADIMIR, AND IT IS CLEAR TO ME THAT PUTIN DOES NOT WANT PEACE. PUTIN WANTS UKRAINE, AND I COMMEND PRESIDENT TRUMP CONTINUING TO PURSUE PEACE IN UKRAINE TODAY. HE IS, QUITE FRANKLY, SURROUNDED BY A LOT OF ISOLATIONIST VOICES IN AND OUTSIDE THE ADMINISTRATION THAT WOULD HAVE CUT UKRAINE OFF A LONG TIME AGO, SO I'M GRATEFUL THE PRESIDENT HAS STAYED AFTER IT. I'M GRATEFUL THAT HE RENEWED MILITARY SUPPORT, AND I COMMEND HIM FOR MEETING WITH PRESIDENT PUTIN AND MEETING WITH PRESIDENT ZELENSKYY AND OUR EUROPEAN ALLIES, BUT I THINK ONE THING IS MISSING. I BELIEVE THE TIME HAS COME FOR THE UNITED STATES SENATE TO ENACT THOSE STRONG SECONDARY SANCTIONS AGAINST RUSSIA AND SEND THEM TO THE PRESIDENT'S DESK. I BELIEVE THAT WOULD STRENGTHEN THE PRESIDENT'S HAND. THE PRESIDENT COULD IMPLEMENT THEM OR NOT IMPLEMENT AS HE SAW FIT, BUT MY DEEP CONVICTION, HAVING STUDIED VLADIMIR PUTIN AND HAVING SPOKEN TO HIM AND TOLD HIM THINGS HE DID NOT WANT TO HEAR, PUTIN IS NOT GOING TO STOP UNTIL HE IS STOPPED. WHILE THE PRESIDENT CONTINUES ON ONE HAND ON A VIGOROUS TRACK OF DIPLOMACY, I THINK THE TIME HAS COME FOR THE U.S. SENATE TO PUT ON THE PRESIDENT'S DESK OF THOSE STRONG SECONDARY SANCTIONS THAT WILL MAKE IT CLEAR TO VLADIMIR PUTIN AND TO THE RUSSIANS THAT UNLESS THEY CHOOSE THE PATHWAY OF PEACE THROUGH DIPLOMACY, WE WILL CONTINUE TO FIND MILITARY SUPPORT AND PASS THE KIND OF SECONDARY SANCTIONS THAT LITERALLY BREAK THEIR ECONOMY. TYLER: WHAT ABOUT SO-CALLED SECONDARY TARIFFS AGAINST CHINA? WOULD YOU BE IN FAVOR OF THE ADMINISTRATION MOVING TOWARDS THAT TOWARD BEIJING LIKE WE HAVE SEEN THEM TAKE TOWARD INDIA, EVEN IF THE ARGUMENT HAS BEEN THEY HAVE NOT DONE THAT YET BECAUSE THEY DO NOT WANT TO RISK THE TRADE TALKS HAPPENING WITH CHINA RIGHT NOW? FMR. VP PENCE: SECONDARY SANCTIONS AGAINST CHINA AND OTHER COUNTRIES ESSENTIALLY FUELING THE RUSSIAN WAR MACHINE, SANCTIONS AT 500% WOULD HAVE A DEVASTATING EFFECT ON THE RUSSIAN ECONOMY. I HAVE PLENTY OF REASONS TO SUPPORT STRONG TARIFFS AGAINST CHINA. DURING OUR ADMINISTRATION, WE CHANGE THE NATIONAL CONSENSUS ON CHINA. WE IMPOSED $250 BILLION IN TARIFFS AND BROUGHT CHINA TO THE NEGOTIATING TABLE FOR THAT IS ONE TRADE DEAL IN 2020, SO I THINK WE HAVE TO BE STRONG ON CHINA AFTER YEARS OF TRADE ABUSES, BUT OTHERWISE, I BELIEVE WE OUGHT TO BE PURSUING FREE TRADE WITH FREE NATIONS. WE OUGHT NOT TO BE CHEERING ON $150 BILLION IN TERROR OF REVENUE THAT IS ULTIMATELY PAID BY AMERICAN CONSUMERS AND AMERICAN BUSINESSES, BUT RATHER, WE OUGHT TO BE LOOKING TO LOWER TARIFFS WITH FREE NATIONS AROUND THE WORLD EVEN AS WE STAND FIRM WITH PHRASES LIKE CHINA. TYLER: WE DO WANT TO GET TO TRADE, BUT I HAVE ONE OTHER FOR YOU WHEN IT COMES TO RUSSIA BECAUSE A LOT OF DISCUSSION THIS WEEK HAS BEEN ABOUT SECURITY GUARANTEES. WE HAVE REPORTS THERE ARE DOUBTS GROWING ABOUT WHAT THOSE GUARANTEES CAN LOOK LIKE BECAUSE RUSSIA WANTS TO HAVE A SAY IN WHAT THOSE GUARANTEES WILL BE. WHAT IS FEASIBLE IN YOUR VIEW? WHAT CAN THE U.S. PUSH FOR WHEN IT COMES TO GUARANTEEING UKRAINE'S FUTURE, PARTICULARLY WHEN WE KNOW THIS WILL LIKELY BE LED FIRST BY EUROPE BUT THEN WITH THE UNITED STATES' BACKING? FMR. VP PENCE: THE PRESIDENT TOOK NATO MEMBERSHIP AT THE TABLE, WHICH HE IS ENTITLED TO DO, BUT I DON'T KNOW WHY THE UNITED STATES HAS GIVEN THE RUSSIANS VETO AUTHORITY OVER WHO JOINS NATO. BE THAT AS IT MAY, I THINK THE SECURITY COMMITMENTS WE SHOULD MAKE SHOULD REFLECT NATO. THEY SHOULD BE IN A SENSE LIKE ARTICLE FIVE WHERE THE UNITED STATES PROVIDES WHATEVER IS APPROPRIATE -- NOT BOOTS ON THE GROUND, BUT THE KIND OF STRATEGIC SUPPORT THAT IS NECESSARY TO ENSURE THAT ONCE VLADIMIR PUTIN IS STOPPED, THAT HE DOES NOT GO FORWARD AT ALL. IF I CAN COME BACK, THE REASON I'M SO CONFIDENT AND ADAMANT ABOUT THE SENATE NEEDING TO MOVE THESE SECONDARY SANCTIONS IS BECAUSE IT WAS BACK IN 2019 THAT PRESIDENT BRCA 1 SENT TANKS ACROSS THE BORDER INTO SYRIA. THEY WERE REACHING DOWN ON TOP OF OUR KURDISH ALLIES, AND PRESIDENT TRUMP PUT ME ON AIR FORCE TO AND SENT ME TO TURKEY TO NEGOTIATE A CEASE-FIRE. WHAT I WOULD TELL YOU AND YOUR VIEW IS IS IN THAT NEGOTIATION, WHAT WAS PERSUASIVE TO HIM WAS THE FACT THAT PRESIDENT TRUMP HAD GIVEN ME A SERIES OF SANCTIONS THAT WOULD BE IMPOSED ON MEMBERS OF HIS GOVERNMENT UNLESS HE AGREED TO A CEASE-FIRE TO ALLOW US TO EVACUATE OUR ALLIES FROM THE BORDER REGION. AS YOU REMEMBER, WE SECURED THAT CEASE-FIRE. OUR KURDISH ALLIES WERE ABLE TO EVACUATE SAFELY. THAT'S WHY I REALLY DO BELIEVE THAT IT WOULD STRENGTHEN PRESIDENT TRUMP'S HAND IF WHEN THE SENATE COMES BACK, ONE OF THEIR FIRST ACTS WOULD BE TO SEND THOSE SECONDARY SANCTIONS, THAT TOUGH BILL TO THE PRESIDENT'S DESK. I REALLY DO BELIEVE THAT AT THE END OF THE DAY, WE'VE GOT TO HAVE THAT HAND REACH OUT IN DIPLOMACY AND NEGOTIATIONS, BUT THE OTHER HAND REMINDING VLADIMIR PUTIN AND THE RUSSIANS THAT THERE WOULD BE SEVERE CONSEQUENCES AS THE PRESIDENT SAID THERE WOULD BE IF THE PATH OF DIPLOMACY FAILS. MICHAEL: WE WANTED TO MOVE ON TO DOMESTIC POLITICS AND THOSE QUESTIONS, AND THAT INCLUDES REDISTRICTING. IT HAS BEEN A BIG TOPIC THIS WEEK WITH WHAT IS HAPPENING IN TEXAS AND CALIFORNIA. AS A FORMER INDIANA GOVERNOR, WOULD YOU SUPPORT THAT HAPPENING IN THE HOOSIER STATE, AND WHAT WOULD BE THE LONG-TERM IMPLICATIONS? FMR. VP PENCE: AS A FORMER INDIANA GOVERNOR, I WILL SUPPORT THE CURRENT INDIANA GOVERNOR DECIDES IS APPROPRIATE WITH OUR GENERAL ASSEMBLY. THE CONSTITUTION GIVES THE STATES THE AUTHORITY TO SET THE TIME, PLACE, AND MANNER OF ELECTIONS, AND I RESPECT THAT. I ALSO UNDERSTAND THE FRUSTRATION THAT THE PRESIDENT AND MANY REPUBLICANS HAVE FELT. THERE WERE STATES PRESIDENT AND I THE TWO TIMES WE RAN TOGETHER WON 35%, 40% OF THE VOTE, AND YET, THE CONGRESSIONAL DELEGATION IS MORE LIKE 20% OR LESS. SOME STATES WHERE WE ENJOYED 35% SUPPORT THERE ARE NO REPUBLICANS IN CONGRESS. THERE'S AN OLD SAYING THAT WHAT YOU SO, YOU REAP HERE THE HEAVY HANDEDNESS OF MANY DEMOCRAT LEGISLATORS SET THIS PATHWAY. AT THE END OF THE DAY, IT WILL BE THE AMERICAN PEOPLE THAT DECIDE. TYLER: NO MATTER WHAT HAPPENS, WE KNOW THE ECONOMY WILL REMAIN A TOP ISSUE FOR AMERICAN VOTERS. U.S. SOYBEAN FARMERS THIS WEEK SAID THEY WERE NEAR A \"TRADE AND FINANCIAL PRECIPICE\" AND CANNOT SURVIVE A PROLONGED TRADE WAR, PARTICULARLY WHEN IT COMES TO CHINA. INDIANA IS ONE OF THE TOP FIVE SOYBEAN PRODUCING STATES. ARE YOU CONCERNED ABOUT FARMERS AND DO YOU THINK THIS ADMINISTRATION IS PLANNING AHEAD ENOUGH TO PROTECT FARMERS? FMR. VP PENCE: I HAVE ALWAYS BELIEVED THAT TRADE MEANS DROPS. IN OUR NEGOTIATIONS, IF IT WAS WITH CANADA OR MEXICO OR THE STRONG STAND WE TOOK WITH CHINA IMPOSING TARIFFS, IT WAS ALWAYS ABOUT LOWERING TRADE BARRIERS AND ENDING SUBSIDIES AND ENDING TRADE ABUSES. MY CONCERN, AND I THINK IT IS A CONCERN OF MANY FARMERS IN INDIANA AND ACROSS THE HEARTLAND THAT WHAT IS EMERGING FROM THIS ADMINISTRATION ARE BROAD-BASED, UNILATERAL TARIFFS BEING IMPOSED ON AND AND FOLLOW -- FRIEND AND FOE ALIKE. THAT IS INDUSTRIAL POLICY, AND I BELIEVE THAT HISTORY SHOWS AND EVEN SOMEBODY THAT KNOWS A LITTLE BIT ABOUT ECONOMICS KNOWS THAT AMERICAN COMPANIES AND AMERICAN CONSUMERS PAY AMERICAN TARIFFS. SOME OF THE COUNTRIES AROUND THE WORLD THAT EXPORT TO US WILL TAKE A SMALL REDUCTION OF THEIR PRICE, BUT IN THE MAIN, AMERICANS PAY THAT COST. IT IS PARTICULARLY MEANINGFUL FOR FARMERS WHO UNDERSTAND THAT WHEN THERE'S TARIFFS IMPOSED ON IMPORTED AGRICULTURAL GOODS HERE, THEY ALSO ALWAYS RESULT IN RETALIATION BY THOSE MARKETS AROUND THE WORLD. AGAIN, MY BELIEF HAS ALWAYS BEEN THAT FREE TRADE WITH FREE NATIONS, LET'S STAND STRONG ON TRADE ABUSERS LIKE CHINA AROUND THE WORLD, BUT LET'S LOOK TO LOWER TARIFFS, LOWER NON-TARIFF BARRIERS, AND THAT WAY, WE WILL WIN IN THE CITY AND ON THE FARM. MICHAEL: YOU BROUGHT UP INDUSTRIAL POLICY, AND WE WANTED TO ASK YOU ABOUT SOME HEADLINES WE HAVE SEEN AND BROKEN ABOUT INDUSTRIAL POLICY HEADLINE NEWS INCLUDING THE U.S. GOVERNMENT MAY TAKE A STAKE IN INTEL AS WELL AS TAKE A 50% CUT OF SALES OF NVIDIA AI CHIPS TO CHINA. WHERE THOSE KINDS OF IDEAS ON THE TABLE DURING YOUR TIME IN THE FIRST ADMINISTRATION, AND THINK THESE THINGS ARE A GOOD IDEA OR GOOD STRATEGY? FMR. VP PENCE: THIS WAS NOT A STRATEGY THAT WE EMPLOYED, AND I HAVE GREAT CONCERNS ABOUT HAVING THE U.S. GOVERNMENT TAKE A POSITION IN NIPPON STEEL OR JUST THE LATEST DISCUSSIONS ABOUT TAKING A PERCENT OF INTEL. THE NVIDIA AGREEMENT IS EVEN MORE PROBLEMATIC. WE HAVE EXPORT CONTROLS IN PLACE TO PROTECT OUR NATIONAL SECURITY. THE LIMITATIONS ON THE ABILITY OF NVIDIA TO SELL CHIPS TO CHINA WAS ON THE BASIS OF OUR NATIONAL SECURITY. SIMPLY TAKING 15% OF THOSE SALES DOES NOT SERVE OUR NATIONAL INTERESTS OR OTHER NATIONAL SECURITY, I WOULD ARGUE, SO I THINK WE NEED TO TAKE A STEP BACK ON ALL OF THIS. I ENCOURAGE THE ADMINISTRATION, AND IF I WERE SPEAKING TO THE PRESIDENT, I WOULD ENCOURAGE HIM, IT IS TIME FOR US TO THINK TWICE. STATE-OWNED ENTERPRISE IS NOT THE AMERICAN WAY. FREE ENTERPRISE IS THE AMERICAN WAY, AND A PRIVATE SECTOR WITH LESS TAXES AND LESS LEGISLATION HAS CREATED THE MOST PROSPEROUS ECONOMY IN THE HISTORY OF THE WORLD AND IF WE STAY ON THAT PATH, IT WILL ALWAYS BE TRUE. TYLER: THE LAST MINUTE WE HAVE WITH YOU, WE WANT TO ASK YOU ABOUT NEWS OF THE DAY. I WOULD LOVE YOUR THOUGHTS ABOUT PRESIDENT TRUMP'S DECISION TO CALL IN THE GUARD -- THE NATIONAL GUARD TO WASHINGTON, D.C. DO YOU THINK THIS WAS THE RIGHT MOVE? FMR. VP PENCE: STRONGLY SUPPORT THE PRESIDENT'S DECISION, TO USE HIS AUTHORITY UNDER THE CONSTITUTION TO REALLY BRING SAFETY BACK TO THE STREETS OF WASHINGTON, D.C. I KNOW THERE IS A LOT OF DEBATE ABOUT STATISTICS, BUT, YOU KNOW, HONESTLY, IF WASHINGTON, D.C., WAS A STATE, IT WOULD HAVE THE HIGHEST HOMICIDE RATE IN THE COUNTRY. 1600 VIOLENT CRIMES THIS YEAR ALONE IN A CITY THE SIZE IS JUST ASTOUNDING. I THINK THE RESIDENTS OF THE CITY AND PEOPLE AROUND THE COUNTRY APPRECIATE THE PRESIDENT TAKING THE STEPS HE IS TAKING TO CREATE SAFETY ON THE STREETS OF OUR NATION'S CAPITAL, AND I FULLY SUPPORT EFFORTS BY THE PRESIDENT TO PROVIDE RESOURCES FOR STATES AND LOCAL COMMUNITIES TO MAKE EVERY CITY AND EVERY TOWN IN AMERICA SAFE. MICHAEL: FORMER VICE PRESIDENT MIKE PENCE, THANK YOU. WE WILL BE RIGHT BACK. ♪ MICHAEL: THIS IS \"BALANCE OF POWER\" ON BLOOMBERG TV AND RADIO. JOINING US WITH REACTION TO OUR CONVERSATION WITH FORMER VICE PRESIDENT MIKE PENCE AND MORE IS THIS EVENING'S PANEL . THANK YOU BOTH FOR JOINING US. I WANTED TO GET YOUR IMPRESSIONS OF WHAT THE VICE PRESIDENT HAD TO SAY, IN PARTICULAR ON THE REDISTRICTING QUESTION, BECAUSE IT HAS BEEN SUCH A HOT TOPIC FOR REPUBLICANS, BUT NOW EVEN MORE SO FOR DEMOCRATS. > > I THINK WHAT IS IMPORTANT TO UNDERSTAND ABOUT THIS FIGHT IS THIS IS NOT A FIGHT HE THOUGHT WE WOULD BE IN, RIGHT, IN AUGUST OF 2025. THIS IS A 10-YEAR REDISTRICTING CYCLE, SO WE ARE CAUGHT BY SURPRISE THE FIGHT WE ARE HAVING IN THE TEXAS STATE HOUSE. WHAT IS IMPORTANT TO LOOK AT IS WHY ARE REPUBLICANS BUCKING THE LAW, BUCKING TRADITION AND PRECEDENT TO ENGAGE IN THIS BATTLE? BECAUSE PRESIDENT TRUMP SAID, FIND ME FIVE SEATS IN TEXAS. I THINK IF THIS IS NOT HANDLED PROPERLY, THIS WILL BE A GUIDEBOOK FOR OTHER STATES TO TRY THE SAME THING. TYLER: WHAT DO YOU MAKE OF THIS? IS THIS THE RIGHT MOVE BY REPUBLICANS WHO ARE TRYING TO GAIN ADVANTAGE WHEN THERE IS SUCH A NARROW MAJORITY? > > WHO SAID POLITICS, IT AIN'T BEANBAG? IT IS ALL FAIR GAME. I DON'T THINK IT IS AGAINST THE LAW. IT MAY BE UNPRECEDENTED, THAT'S TRUE, TO DO IT MID DECADE, BUT THIS IS A POLITICAL POWER PLAY. BOTH PARTIES DO IT. IT WAS A LITTLE IRONIC FOR ME AS A FORMER CHICAGOAN TO SEE THE TEXAS DEMOCRATS GO TO ILLINOIS TO TRY TO MAKE A POINT ABOUT THE EVILS OF GERRYMANDERING. ILLINOIS IS THE MOST GERRYMANDERED STATE IN THE COUNTRY. IT IS A WORK OF ART BY DEMOCRATS TO EXCLUDE REPUBLICANS FROM THE LEGISLATURE. FOR A POLITICAL THEATER, THAT WAS PRETTY GOOD TO ME. MICHAEL: WHEN IT COMES TO THE REDISTRICTING QUESTION, ARE WE HITTING A SLIPPERY SLOPE? WILL THIS BECOME A RACE TO THE BOTTOM AND ULTIMATELY BECOME SOMETHING THAT TURNS OFF VOTERS EVEN MORE ALREADY, IF YOU CAN IMAGINE THAT? > > THIS IS ABOUT HAVING A LEVEL PLAYING FIELD IN ELECTIONS, ABOUT REPRESENTATIVES NOT CHOOSING THEIR VOTERS AND SENT VOTERS CHOOSING THEIR REPRESENTATIVE. WHAT THIS SAYS TO OTHER STATES IS YOU, TOO, CAN POWER GRAB AND CHOOSE YOUR VOTERS AND NOT HAVE YOUR VOTERS CHOOSE YOU. YES, I AGREE IT IS A SLIPPERY SLOPE, AND I THINK WHAT DEMOCRATS ARE DOING IN FIGHTING BACK IS IMPORTANT BECAUSE THEY ARE FIGHTING ON BEHALF OF THE VOTERS SO THE VOTERS HAVE A VOICE IN CHOOSING THEIR ELECTED REPRESENTATIVES. TYLER: I WANT TO CONTINUE THE CONVERSATION WHEN WE WERE DISCUSSING WITH VICE PRESIDENT MIKE PENCE AND SHIFT FOCUS A LITTLE BIT. WE DIDN'T TALK ABOUT THE IMPACT OF TARIFFS, AND WE GOT SOME NEW TARIFF NEWS TODAY, INCLUDING THAT THE U.S. AND EU MADE AT LEAST ONE STEP CLOSER TO A DEAL. THEY PUT PEN ON PAPER WHEN IT CAME TO GETTING DOWN SOME OF THEIR LOGISTICS. ONE OF THE HEADLINES ON OUR TERMINAL IS THE VICE PRESIDENT SAID TARIFFS ARE ULTIMATELY PAID FOR BY AMERICANS. DO YOU THINK THIS WHITE HOUSE IS DOING A GOOD ENOUGH JOB WHEN IT COMES TO MESSAGING WHAT IS REALLY THE CENTERPIECE OF THEIR ECONOMIC PLAN? > > I THINK YOU ARE HIGHLIGHTING THE ONE ISSUE WHERE THERE IS A REAL DIFFERENCE BETWEEN THE FORMER VICE PRESIDENT AND CURRENT ADMINISTRATION. HE IS VERY MUCH A TRADITIONAL REPUBLICAN, AS, FRANKLY, I AM. WANTS TO SEE FREE TRADE. THAT IS A GOOD THING FOR AMERICA IN THE LONG RUN. THE CURRENT ADMINISTRATION DOES NOT SEE IT THAT WAY. THEY WANT TO USE TARIFFS AS A WAY TO MANAGE THESE BILATERAL RELATIONSHIPS. IT HAS NOT BEEN AS DAMAGING TO THE ECONOMY AS A LOT OF US THOUGHT, FRANKLY, AND I THINK THERE HAVE BEEN SOME MODEST GAINS IN THE DIPLOMATIC ARENA COME OVER IN THE GRAND SCHEME OF THINGS, UNDERMINING FREE TRADE IS NOT A GOOD THING. I AGREE WITH THE FORMER VICE PRESIDENT, AND I THINK IT IS JUST A DIFFERENCE WITH THE CURRENT ADMINISTRATION. MICHAEL: ON THE TRADE AND ECONOMY QUESTION, IS THIS SHAVING AND A SOMETHING DEMOCRATS CAN PIECE TOGETHER HEADING INTO 2026? > > I THINK THIS DYNAMIC IS USING THE ECONOMY AS A POLITICAL FOOTBALL. AMERICAN CONSUMERS ARE GOING TO BEAR THE BRUNT OF THESE TARIFFS AT A TIME WHEN REPUBLICANS REALLY CANNOT AFFORD FOR POLICIES TO BE MORE UNPOPULAR. WE LOOK AT THIS BIG, UGLY BILL THAT REPUBLICANS HAVE PASSED AND ARE STANDING BEHIND. THIS IS UNPOPULAR MESSAGING FOR THEM. WHEN YOU LOOK AT WHAT DEMOCRATS SHOULD BE DOING IN THE OFFENSE, IT IS POINTING TO HOW THIS WILL IMPACT AMERICAN CONSUMERS. TARIFFS DON'T WORK. A LOT OF DEALS THEY HAVE TRIED TO INK USING THESE TARIFFS HAVE NOT COME TO FRUITION YET, SO WE HAVE NOT EVEN SEEN THE FULL BRUNT OF THE EFFECT YET. TYLER: WE HAVE BEEN COVERING THE IMPACT OF MONETARY POLICY AND THE FED ALL DAY ABOUT THE WHITE HOUSE'S PRESSURE CAMPAIGN, NOW EXTENDING TO FED GOVERNOR LISA COOK. WHAT DO YOU MAKE OF PERHAPS THE NEED OF THE ADMINISTRATION IS TRYING TO THREAD HERE. IS IT EVEN THAT WHEN IT COMES TO RAMPING UP THIS CRITICISM OF THE FED? WE ASK VICE PRESIDENT ABOUT IT, AND HE WALKED THE LINE SINCE HE PREVIOUSLY SAID THE PRESIDENT HAS HIS OWN RIGHT TO TALK ABOUT HIS OPINIONS WHEN IT COMES TO THE FED. > > I THINK THE PRESIDENT DOES HAVE A RIGHT TO TALK ABOUT THE FED, BUT THE FED SHOULD BE INDEPENDENT. I THINK IT IS VERY CREATIVE -- I'M TRYING TO BE POSITIVE -- IT'S VERY CREATIVE OF THE ADMINISTRATION TO USE FEDERAL HOUSING REGULATORS TO TARGET POLITICAL OPPONENTS OR AT LEAST PEOPLE WHO DISAGREE WITH THEM ON ECONOMIC POLICY WITH SOME OF THESE CHARGES, AND I AGREE WITH THE VICE PRESIDENT THAT SHE SHOULD COME FORWARD AND DEFEND HERSELF. EXPLAIN WHAT HAS HAPPENED. IT IS A LITTLE CONCERNING TO ME THAT WE SEEM TO BE WEAPONIZING SO MANY ORGANS OF GOVERNMENT FOR POLITICAL PURPOSES, BUT FRANKLY, I PUT AS MUCH BLAME ON THE PREVIOUS ADMINISTRATION FOR THAT AS I DO ON THIS ONE. MICHAEL: HOW WOULD YOU RESPOND TO THAT POINT ON THE PRIOR ADMINISTRATION WEAPONIZING GOVERNMENT IN THAT WAY? AND, SPECIFICALLY, DO YOU SEE THE FED'S INDEPENDENCE AT STAKE? > > I AGREE THAT THE FED BEING INDEPENDENT IS INCREDIBLY IMPORTANT. WE CANNOT CREATE THIS PARTISAN FOOTBALL WE ARE THROWING AROUND WITH THE RELATIONSHIP WITH THE FED. WHAT IS IMPORTANT IS TO RECOGNIZE WHEN WE LOOK BACK AT THE PREVIOUS ADMINISTRATION, I DO NOT RECALL FORMER PRESIDENT BIDEN HAVING SUCH AN ADVERSARIAL RELATIONSHIP WITH THE CHAIR. FOR ALL THE RECRIMINATIONS OF HOW HE DEALT THE SITUATION, I THINK DONALD TRUMP HAS A MORE MARKET -- MARKED ADVERSARIAL RELATIONSHIP WITH THE FED, AND I THINK THAT TENSION CREATES INSTABILITY IN HOW WE THINK ABOUT THE ROLE OF THE FEDERAL RESERVE AND THAT IT SHOULD BE INDEPENDENT. TYLER: JUST TO GET YOUR THOUGHTS ON SOME BREAKING NEWS AS WE WATCH TO SEE PRESIDENT TRUMP MAKE HIS WAY TO STAND WITH THE TROOPS THAT HAVE BEEN DEPLOYED HERE IN THE DISTRICT. WE HEARD FORMER VICE PRESIDENT MIKE PENCE SAY THAT HE SUPPORTED THIS DECISION. WHERE DO REPUBLICANS FALL ON THE MESSAGING? > > I AM PRETTY CLOSE TO WHERE THE VICE PRESIDENT IS. I THINK IT IS A GOOD MOVE GENERALLY SPEAKING FOR THE ADMINISTRATION TO BOLSTER LAW ENFORCEMENT IN THE DISTRICT. WHEN I WAS A YOUNG PERSON, AND LEFT THE DISTRICT BECAUSE CRIME BECAME VERY CLOSE TO ME AND I HAD TO MOVE TO THE SUBURBS. I DID NOT WANT TO. I WAS FORCED TO BECAUSE OF THE CIRCUMSTANCES. THIS IS REMINISCENT OF THAT TO ME. I THINK THEY COULD DO IT IN A WAY THAT IS NOT SO PROVOCATIVE AND IN THE FACE OF PEOPLE WHO DISAGREE AND DO IT IN A WAY WHERE MORE PEOPLE WILL SUPPORT THIS INITIATIVE BECAUSE YOU REALLY DO HAVE TO HAVE THE SUPPORT OF PEOPLE WHO ACTUALLY LIVE IN THE DISTRICT TO DO THIS THE RIGHT WAY. TYLER: YOU DO SEE ON YOUR SCREEN THERE, FOR OUR RADIO LISTENERS, TROOPS IN WASHINGTON, D.C., WAITING FOR PRESIDENT TRUMP'S ARRIVAL LATER TONIGHT. THIS WAS A GREAT CONVERSATION. THANK YOU BOTH FOR JOINING US TODAY. THE UNCERTAINTY AROUND TARIFFS CONTINUES TO IMPACT MARKETS TODAY AS WE LEAD UP TO JACKSON HOLE. WE HEARD EARLIER TODAY HOW ANALYSTS REACTED TO ALL OF THIS MOVEMENT ON \"BLOOMBERG SURVEILLANCE.\" > > YOU CANNOT GO UP EVERY DAY, AND WE HAVE A GREAT CATALYST FOR THEIR HEIRS, SKEPTICS, AND NERVOUS INVESTORS TO TAKE PROFITS WITHOUT FORMAL -- WITHOUT FOMO OR FEAR OF MISSING OUT. THE REAL QUESTION IS WHEN WILL THE TARIFF EFFECTS TAKE PLACE AND BE FOUND IN THOSE NUMBERS. > > WE SEE THIS AS THE BEGINNING OF A PROCESS THAT HAS BEEN VERY SLOW AND CONTINUES IN THE MONTHS AHEAD, THE SOFTENING OF THE LABOR MARKET AND ECONOMY. COLLECT THE MARKET SENTIMENT FOR THE SECOND HALF OF THE YEAR WE THINK IS ALREADY PRETTY BEARISH. IF YOU LOOK AT FORECAST FOR GROWTH, FOR INFLATION, THERE IS A STAGFLATIONARY BIAS. > > THIS IS A STAGFLATIONARY ENVIRONMENT. YOU WILL HAVE SOME DEMAND DESTRUCTION. TYLER: FOR A CLOSER LOOK, WE TURN TO \"POWER MOVES\" WITH BLOOMBERG VONNIE QUINN. IT IS GOOD TO SEE YOU. HOW ARE MARKETS POSITIONING AHEAD OF FED CHAIR JEROME POWELL'S HIGHLY ANTICIPATED SPEECH? BONNIE: YOU HAD MANY INVESTORS THAT HAVE BEEN ON ALL DAY TALKING ABOUT THE CAVEATS AND FRAGILITY THAT MIGHT BE IN THIS MARKET. YOU DID THE STOCKS OFF TODAY. THE S & P 500 WAS DOWN .4%. THE NASDAQ 100 DOWN ABOUT .5%. TECH STOCKS BEARING THE BRUNT AND IT HAS BEEN A WEEK-LONG SLIDE, SO DEFINITELY, INVESTORS HAVE BEEN TAKING RISK OFF THE TABLE. JACKSON HOLE DOES HAVE TO DO WITH IT. NVIDIA DOWN ABOUT .25% EVEN AS ANALYSTS HAVE BEEN UPPING PRICE TARGETS BEFORE NEXT WEDNESDAY'S EARNINGS REPORT. HE HAD PALANTIR WHICH WAS DOWN MOST OF THE SESSION, DID FINISH IN THE GREEN. INTEL DOWN .2% AND TESLA DOWN 1.2%, SO TECH STOCKS HAVE BEEN BEARING THE BRUNT. IF YOU LOOK YEAR TO DATE, FOR EXAMPLE, THOUGH, THE S & P 500 IS STILL UP 8.3%. ASK ANY OF THE INVESTORS YOU HEARD KNOCKING THERE AND THEY WOULD BE HAPPY WITH THAT KIND OF RETURN IN ANY GIVEN YEAR. THE QUESTION IS -- WHAT HAPPENS FROM HERE? DOES THE RALLY STALL OUT OR DO THINGS GET WORSE? INVESTORS ARE HOPING FOR SOME SIGNAL. THE JACKSON HOLE SYMPOSIUM RUN EVERY YEAR BY THE KANSAS CITY FED HAS A THEME. THIS YEAR, THE FOCUS IS ON STRUCTURAL CHANGES IN THE LABOR MARKET, BUT THE FED CHAIR DOES GIVE A SPEECH AT 10:00 A.M. WE ARE DOING A SPECIAL AROUND IT. THE QUESTION IS WILL THE FED CHAIR TALK ABOUT INFLATION, WILL HE SKEW HAWKISH? IT APPEARS INVESTORS HAVE BEEN TAKING BETS OFF THE TABLE. 2/3 OF INVESTORS, ABOUT 65% ON A 25 BASIS POINT COME SEPTEMBER 15. WILL THE FED SAY ANYTHING THAT WILL GET THIS MARKET ANY KIND OF SIGNAL ABOUT WHAT THE FED IS THINKING IN TERMS OF TARIFFS, THEIR IMPACT ON INFLATION, ABOUT FRAGILITY IN THE LABOR MARKET? THAT IS PART OF THE PROBLEM. THE DATA ARE SIGNALING SEVERAL CROSSCURRENTS. YOU EVEN SAW TODAY IN WALMART, THAT STOP DOWN 4.5% AND MISSING PROFIT ESTIMATES, THE THINGS WORK QUITE HEALTHY BECAUSE AS WELL KNOW, EVEN THE HIGH-END BUYER HAS BEEN TRADING DOWN, BUT THE CEO SAID THEY HAVE ACTUALLY BEEN RAISING RATES A VERY LITTLE BIT EVERY SINGLE WEEK, PRICES ON THEIR GOODS AND PASSING THEM ON TO CONSUMERS BECAUSE OF THE TARIFFS, AND HE LITERALLY SAID THAT WILL KEEP HAPPENING EVERY WEEK UNTIL THE END OF THE YEAR. THAT IS JUST ANOTHER SIGNAL FOR THE FED CHAIR TO PARSE. MICHAEL: THANK YOU. AS MARKETS BRACE FOR THE FULL IMPACT OF TARIFFS, BUSINESSES ARE BEING FORCED TO CONSIDER OBSERVING -- ABSORBING THE COST FOR PASSING PRICES TO CONSUMERS INCLUDING THE ARIZONA 99'S ICED TEA CAN, -- 99-SENT ICED TEA CAN, A PRICE THE COMPANY SAYS IS BEING HARDER AND HARDER TO SUSTAIN. HOW LONG CAN YOU HOLD OUT ON KEEPING THAT PRICE LEVEL? > > WE ARE GOING TO KEEP TRYING TO HOLD IT AND WE HAVE BEEN DOING IT FOR 30-PLUS YEARS, AND WE DON'T WANT TO GET SIDETRACKED BY THIS RECENT TARIFF EFFECT, AND WE ARE HOPING THE TARIFF EFFECT WILL SETTLE DOWN AND PEOPLE TAKING ADVANTAGE OF THE TARIFF SITUATION GET BACKED OFF BY SOME GOVERNMENT OFFICIALS. THE PEOPLE WHO ARE INVOLVED IN THE SUPPLY OF ALUMINUM ARE PUSHING ALONG A TARIFF ON ALUMINUM EVEN THOUGH MOST OF THE ALUMINUM IS RECYCLED IN AMERICA, SO I THINK THAT IS UNFAIR AND I DON'T THINK THAT IS WHAT THE ADMINISTRATION WANTED. TYLER: CAN YOU GIVE US A LITTLE MORE INSIGHT, KOSPI ARE ABSORBING SO IT DOES NOT GET PASSED ON TO THE CONSUMER? > > THE MIDWEST PREMIUM WHICH WAS PUT IN PLACE IN THE 1980'S TO COVER THE COST OF FREIGHT USED TO BE A NICKEL TO EIGHT CENTS A POUND AND I WAS CLOSE TO $.70 A POUND. A LOT OF THAT IS DUE TO THE TARIFF EFFECT EVEN THOUGH A LOT OF THE LOANS COLLECTED FROM RECYCLERS IN AMERICA AND USED IN A LOT OF THE ALUMINUM PRODUCTS. GOOD NEWS ABOUT ALUMINUM IS IT IS RECYCLED OVER AND OVER AGAIN. THE POWER OF ALUMINUM IS THE FACT THAT IT IS VERY RECYCLABLE, AND A LOT OF IT IS BEING COLLECTED IN AMERICA IN RECYCLING PROGRAMS AND REUSED TO MAKE CONTAINERS, BUT THE EFFECT SHOULD NOT BE APPLIED TO RECYCLED METAL THAT IS COLLECTED IN AMERICA BUT IT IS, SO THERE IS MANIPULATION, AND HOPEFULLY THAT CAN BE RESOLVED. A LOT OF THE SMELTERS CLOSED UP BECAUSE OF THE COST OF ENERGY VERSUS THE COST IN CANADA, AND HOPEFULLY SOME OF THE THINGS THAT GO ON WITH GENERATING POWER COULD BE LOOKED AT AS WELL. WE ARE REDUCING THE PRICE ON PLASTIC BECAUSE THE PRICE OF THE FRUIT HAS DROPPED PRETTY DRAMATICALLY OVER THE LAST SIX MONTHS, SO WE ARE REFLECTING THAT COST SAVINGS BY GIVING THE CONSUMER AND LOWER PRICE ON A PRODUCT THAT WENT UP A WHILE AGO AND I WAS GOING BACK DOWN. RIGHT NOW, OUR INTENTION IS TO HOLD THE PRICE. MICHAEL: WE HAVE SEEN A NUMBER OF BUSINESS LEADERS VISITING THE WHITE HOUSE TO TALK TO PRESIDENT TRUMP AND HIS AIDES ABOUT TARIFFS AND TRADE POLICY. HAVE YOU HAD ENDING ENGAGEMENT WITH THE ADMINISTRATION. KEEP IN MIND THAT PRESIDENT TRUMP IS KNOWN TO BE FOND OF SOFT DRINKS HIMSELF. > > I HAVE NOT HAD A CONVERSATION WITH ANYONE, BUT I'M HERE IF THEY WANT TO BE EDUCATED ABOUT WHAT IS GOING ON. A LOT OF THINGS ARE UNINTENTIONALLY HAPPENING. I THINK THE AVERAGE AMERICAN LIKES THE IDEA OF MAKING MORE THINGS IN AMERICA AND KEEPING BUSINESS CLOSE TO HOME, BUT SOME THINGS JUST CANNOT HAPPEN HERE IN AMERICA. LIKE WE ARE IN THE COFFEE BUSINESS. THEY ARE NOT GROWING MANY COFFEE BEANS IN BROOKLYN AND WHAT HAVE YOU. A TARIFF ON THINGS THAT CAN NEVER BE MADE HERE IS FOOLISH BECAUSE IT ENDS UP AFFECTING THE CONSUMER AND THE CONSUMER WILL HAVE TO PICK UP THE TAB I DON'T THINK THE WHITE HOUSE WANTS THAT. I DO NOT WANT IT BECAUSE I DO NOT THINK AMERICANS NEED ANOTHER PRICE INCREASE ON A DRINK LIKE OURS OR ANYTHING ELSE. TYLER: COFOUNDER AND CHAIRMAN OF ARIZONA BEVERAGE COMPANY, WE THANK YOU SO MUCH. WE WANT TO BRING YOUR BREAKING NEWS. PRESIDENT TRUMP IS AT THE U.S. PARK POLICE ANACOSTIA OPERATIONS FACILITY ADDRESSING POLICE AND MEMBERS OF THE MILITARY ABOUT THE LATEST STATE OF WASHINGTON, D.C. LET'S LISTEN IN. > > WE STARTED FIVE MONTHS AGO IN TERMS OF INVESTMENT. BECAUSE THEY SEE WHAT HAS HAPPENED TO OUR COUNTRY, OR THERE WILL BE OVER 17 TRILLION -- TRILLION WITH A T -- DOLLARS OF INVESTMENT. THERE'S NEVER BEEN MORE THAN $1 TRILLION IN A YEAR. WE ARE TALKING OVER A FIVE-MONTH PERIOD, MAYBE SIX MONTHS IF YOU LOOK AT IT. WE ARE BUILDING AUTO PLANTS, AI PLANTS, ALL SORTS OF PLANTS ALL OVER THE COUNTRY. WE ARE GIVING THE RIGHT TO BUILD ELECTRIC PLANTS. THEY HAVE BECOME ALMOST LIKE A PUBLIC UTILITY BECAUSE WE HAVE OLD GRIDS. WE HAVE A LOT OF STUFF THAT IS OLD. WE WOULD NOT BE ABLE TO COMPETE WITH CHINA AI AND NOW WE ARE TOTALLY LEADING THE AI RACE AND THE ARTIFICIAL INTELLIGENCE. IT IS A BIG DEAL AND THE HARDEST THING THERE IS PROBABLY IN 35, 40 YEARS. A LOT OF PEOPLE DON'T KNOW WHAT IT IS. JUST TRUST ME. IT IS VERY HOT. IT IS BIG. THEY NEED MORE ELECTRICITY THAN WE HAVE RIGHT NOW IN THE WHOLE COUNTRY SERVICING EVERYTHING. WE HAVE TO AT LEAST DOUBLE IT UP TO BE COMPETITIVE AND TO BE LEADING, AND WE ARE MORE THAN DOUBLING IT UP. I'M LETTING ALL OF THESE VERY RICH COMPANIES -- THEY GOT A LOT OF MONEY AND THEY WANT TO INVEST IN THE UNITED STATES. THEY ARE BUILDING BIG PLANTS, BUT THEY ARE BUILDING ELECTRIC PLANTS WITH IT. I SAY YOU ARE BUILDING YOUR BUILDING, AND THESE ARE PLANTS THAT COST $30 BILLION, $40 BILLION, $50 BILLION WHEN YOU ADD EVERYTHING UP. I SAID I'M GOING TO LET YOU BUILD YOUR OWN ELECTRIC PLANTS TO LET YOU FIRE YOUR OWN ELECTRICITY AND ANYTHING LEFT OVER YOU SELL TO THE GRID. ALL OF THESE FACTORIES HAVE BUILT IT -- HAVE BEEN BUILDING THEIR OWN ELECTRICITY PLANTS FIRED BY COAL AND GAS -- THEY ARE NOT FIRED BY WIND, BY THE WAY BECAUSE IT DOES NOT WORK. IT DESTROYS EVERYTHING, IT LOOKS TERRIBLE, AND IT IS AN EXPENSIVE FORM OF ENERGY. WE ARE GOING BACK TO FOSSIL FUEL. I HOPE NOT TOO MANY OF YOU WILL BE UPSET, BUT WE HAVE TO GO BACK TO WHAT WORKS. CANNOT BE FOOLISH. WE ARE BUILDING MASSIVE ELECTRIC PLANTS ALL OVER THE COUNTRY. THEN THEY SELL IT BACK INTO THE GRID, BUT WE ARE BUILDING NUMBERS NOBODY HAS EVER SEEN. WE HAVE MANY AUTO PLANTS GOING UP, WHEREAS DURING THE LAST FOUR YEARS, AS YOU KNOW, WE HAD, LIKE , NONE. PEOPLE WERE NOT INVESTING HERE. THEY WERE NOT INVESTING AND THEY WERE LEAVING, BUT I JUST FINISHED BY SAYING THIS. I WAS WITH THE KINGDOM OF SAUDI ARABIA, AND I WAS WITH ALL OF THE NATO LEADERS A COUPLE OF WEEKS AGO, AND THEY ARE PUTTING UP NOT TO PERCENT BUT 5%. THEY SAID 5% OF GDP. THAT'S A LOT OF MONEY. THEY WERE PUTTING UP 2% BUT NOT PAYING IT. NOW THEY ARE PUTTING UP 5% AND ALL PAYING IT. THEY ALL SAID THE SAME THING. THEY SAID, ONE YEAR AGO, YOUR COUNTRY WAS DEAD. WE NEVER THOUGHT IT WAS COMING BACK, AND NOW YOU HAVE THE HOTTEST COUNTRY ANYWHERE IN THE WORLD. THESE ARE LEADERS OF OTHER COUNTRIES, THE PRIME MINISTER'S, THE PRESIDENT'S, EVERY ONE OF THEM SAID ESSENTIALLY THE SAME THING, SAID WE HAD A DEAD COUNTRY -- AND WE WERE. WE FELT THAT WAY. THIS PLACE WAS EMBLEMATIC WITH THE HORRIBLE CRIME. I WATCH THESE PHONY REPORTS. \"WE WERE ON THE WAY BACK,\" BUT WE WERE NOT ON THE WAY BACK. IT WAS WORSE THAN EVER. I THINK RIGHT NOW IT IS BETTER THAN IT HAS BEEN IN YEARS AND IN A COUPLE OF WEEKS, IT'S GOING TO BE EVEN FAR BETTER THAN THAT, AND EVERYBODY IS SAFE NOW. EVERYBODY FEELS SAFE AND THEY ARE ALL COMING IN. PEOPLE ARE MAKING RESERVATIONS TO COME IN AND THEY WANT TO BE IN WASHINGTON, D.C. ONE OF THE THINGS WE WILL BE DOING IS REDOING YOUR PARKS. I'M VERY GOOD AT GRASS. I HAVE A LOT OF GOLF COURSES AND I KNOW MORE ABOUT GRASS THAN I THINK ANY OTHER HUMAN BEING IN THE WORLD. IT WILL LOOK LIKE A GUSTO. IT WILL LOOK LIKE, MORE IMPORTANTLY, TRUMP NATIONAL GOLF CLUB. THAT IS EVEN BETTER. WE ARE GOING TO HAVE ALL COME IN FOR A NEW BEAUTIFUL GRASS. LIKE EVERYTHING ELSE, GRASS HAS A LIFE. DO YOU KNOW THAT? GRASS HAS A LIFE. YOU KNOW, WE HAVE A LIFE AND GRASS HAS A LIFE. THE GRASS HERE DIED ABOUT 40 YEARS AGO. WE WILL BE REBUILDING ALL OF YOUR PARKS, AND IT'S GOING TO BE FAST. IT'S GOING TO GO UP LIKE AMERICA ITSELF. YOU DO YOUR JOB FOR SAFETY. WE ARE GOING TO BE SO PROUD. LET'S SAY AT THE END OF THE YEAR, THIS PLACE WILL BE MAXED OUT IN TERMS OF BEAUTY. YOU WILL HAVE ALL NEW SURFACES. EVERYTHING IS GOING TO LOOK BEAUTIFUL. AND A LOT OF YOUR SIGNS WILL BE TAKEN DOWN. THEY HAVE BEEN UP FOR 40 YEARS. THEY LOOK LIKE HELL. THEY ARE BARELY STANDING UP. THEY ARE FALLING OFF THEIR HOLDERS. I WANT TO THANK DOUG FOR DOING SUCH AN INCREDIBLE JOB. HE HAS BEEN UNBELIEVABLE. POPULAR GUY. NO, HE IS AN AMAZING GUY. EVERYBODY LOVED -- WE LOVE YOU. AND HIS WIFE IS INCREDIBLE. TYLER: YOU HAVE BEEN LISTENING TO PRESIDENT TRUMP ADDRESS MEMBERS OF THE MILITARY AND POLICE AT THE U.S.-BASED ANACOSTIA OPERATIONS FACILITY HERE IN WASHINGTON, D.C., AFTER HE DEPLOYED THE NATIONAL GUARD HERE IN THE DISTRICT. HE TOUCHED ON EFFORTS TO TRY TO ADDRESS CRIME, EVEN AMID CRITICISM ABOUT HOW HE HAS GOING ABOUT IT. WE DID SPEAK TO VICE PRESIDENT MIKE PENCE WHO GAVE HIS FULL SUPPORT OF WHAT THE PRESIDENT WAS DOING. IT WAS PRETTY INTERESTING TO HEAR. PRESIDENT TRUMP TOUCHED ON SOMETHING THAT WE FOCUS A LOT ON HERE AT BLOOMBERG, WHICH IS INVESTMENTS. SOME HEADLINES CROSSING THE TERMINAL. PRESIDENT TRUMP SAYING WE ARE LEADING THE ARTIFICIAL INTELLIGENCE RACE AND THAT WE HAVE TO INCREASE ELECTRICITY CAPACITY TO LEAD AI, A CONVERSATION WE HAD JUST HERE YESTERDAY. MICHAEL: THAT'S RIGHT. WE HEARD A WIDE RANGE OF THINGS FROM THE PRESIDENT IN TERMS OF HIS APPEARANCE JUST NOW. IT IS NOT JUST PUBLIC SAFETY. HE USED THIS MOMENT TO TALK ABOUT INVESTMENTS IN AI, DATA CENTERS, TRYING TO DRAW COMPANIES TO THE U.S. TO BUILD PLANTS AND TOUTING THIS EFFORT. HE DOES NOT MISS A MOMENT OR AN OPPORTUNITY TO LEAN INTO THAT WHEN WE SEE HIM EITHER AT THE WHITE HOUSE SPEAKING OR OUT IN PUBLIC. IT IS REALLY SOMETHING THAT HAS BECOME PART OF HIS SHTICK, FOR LACK OF A BETTER WORD. EVEN IF IT MAY BE A LITTLE OUT OF CONTEXT, IT IS VERY MUCH OF A THEME FOR THE PRESIDENT, BUT HE DID CLOSE IN HIS REMARKS ON PUBLIC SAFETY. TYLER: RIGHT. WE DID SPEAK TO FORMER VICE PRESIDENT MIKE PENCE ABOUT ALL OF THIS. WE WANTED TO BRING UP ANOTHER TOPIC. HERE IS WHAT HE HAD TO SAY ON IF PRESIDENT TRUMP'S PRESSURE CAMPAIGN TO RAISE ALLEGATIONS AGAINST FED GOVERNOR LISA COOK THREATENS THE INDEPENDENCE OF THE CENTRAL BANK. FMR. VP PENCE: WHAT I HOPE IS THAT THE EFFORT TO PUSH OUT ANOTHER MEMBER OF THE FEDERAL RESERVE IS NOT SIMPLY PART AND PARCEL OF AN EFFORT TO GET JEROME POWELL, WHO OUR ADMINISTRATION APPOINTED AS FEDERAL RESERVE CHAIR, TO LOWER INTEREST RATES OR OTHERWISE TAKE ACTION THAT NOT OTHERWISE BE JUSTIFIED. I UNDERSTAND PRESIDENT'S FRUSTRATION WITH CHAIRMAN POWELL, AND HE IS ENTITLED TO SPEAK OUT ABOUT THAT, BUT MY HOPE IS THAT THESE LATEST ALLEGATIONS ARE NOT SIMPLY PART OF THAT OVERALL PRESSURE CAMPAIGN. TYLER: THESE COMMENTS AS MONETARY POLICY LEADERS TO SEND JACKSON HOLE, WYOMING, FOR THE FED'S ANNUAL POLICY SYMPOSIUM. THAT'S WHERE WE ARE JOINED BY MICHAEL MCKEE JOINED BY SPECIAL GUEST AUSTIN GOOLSBY. MICHAEL: THANK YOU VERY MUCH. WE WELCOME YOU, AUSTIN. THANKS FOR STOPPING BY. TALKING ABOUT INTEREST RATES THERE, THE VICE PRESIDENT. WHAT WILL HAPPEN SEPTEMBER 17? > > IT DEPENDS. FOR SURE, IT FEELS TO ME LIKE IT IS A LIVE MEETING. AS YOU KNOW, BEFORE APRIL 2, BEFORE WE GOT SOME UNCERTAINTIES COMING ON THE POLICY SIDE, I BELIEVED THAT WE HAD PRETTY STABLE, FULL EMPLOYMENT, THEN INFLATION IS COMING DOWN TO TARGET, THE ECONOMY IS LOOKING RELATIVELY SOLID, AND IT MADE SENSE FOR RATES TO COME DOWN A FAIR BIT MORE FROM WHERE THEY ARE RIGHT NOW. IN THE INTERIM, WE HAVE HAD MIXED MESSAGES. WE HAVE HAD SOME INFLATION REPORTS THAT CAME IN MILDER THAN WE EXPECTED, AND I WAS FEELING GOOD BECAUSE I THOUGHT IF THE TARIFFS KIND OF STAY IN THEIR LANE AND IMPORTED GOODS ARE ONLY 11% OF THE ECONOMY, THERE IS A REAL SENSE IN WHICH MAYBE WE NEVER LEFT THE GOLDEN PATH. WE THREW A BUNCH OF DIRT IN THE AIR, AS I DESCRIBED, AND CANNOT SEE THE ROAD FOR A BIT, BUT MAYBE WE ARE STILL ON IT AND IT WILL BE FINE. THE LAST INFLATION REPORT THAT CAME IN WHERE YOU SAW SERVICES INFLATION, WHICH IS PROBABLY NOT DRIVEN BY THE TARIFFS, REALLY STARTS SHOOTING UP, IS A DANGER -- THAT IS A DANGEROUS DATA POINT. I'M HOPING THAT IS A BIT OF A BLIP. I THINK WE STILL HAVE A FAIR BIT OF INFORMATION WE WILL GET BEFORE SEPTEMBER. MICHAEL CALLED IN THE MEETING APPLIES YOU COULD PERHAPS CUT INTEREST RATES. ARE YOU LEANING IN THAT DIRECTION? > > AS YOU KNOW, I DON'T LIKE TYING OUR HANDS AHEAD OF TIME. I WANT TO GET ALL THIS INFORMATION. IT IS PARTICULARLY IMPORTANT GIVEN THAT WE HAVE BEEN GETTING MIXED SIGNALS, AND I WANT TO HEAR WHAT MY COLLEAGUES HAVE TO SAY GOING INTO SEPTEMBER OR NOVEMBER, DECEMBER, GOING INTO NEXT YEAR. THE MOST IMPORTANT THING TO FIGURE OUT IS THE THROUGH LINE, AND THE THROUGH LINE IS EITHER WE ARE STILL ON PATH TO GET RATES DOWN A FAIR AMOUNT -- YOU KNOW, LET'S SAY THE SEP DOT PLOT WHERE THEY ASK THE MEMBERS OF THE FOMC WHERE THEY THINK RATES WILL SETTLE EVENTUALLY. THAT IS 100 BASIS POINTS PLUS BELOW WHERE WE ARE NOW AT THE MEDIAN, AND WHAT WILL DETERMINE IF WE CAN GET BACK ON THAT PATH OF RATES COMING DOWN IS GOING TO BE -- DO WE THINK INFLATION IS UNDER CONTROL? WE HAVE BEEN FAR AND A HALF YEARS ABOVE THE INFLATION TARGET. I THOUGHT -- AND WE MADE A LOT OF PROGRESS, AND I THOUGHT COMING INTO THIS YEAR WE WERE IN A DECENT SPOT, THAT YOU COULD MAKE THE CASE WE ARE HEADED BACK TO 2%. I'M STILL HOPEFUL THAT IS TRUE, BUT AS I SAY, IN THE LAST REPORT, THERE ARE A COUPLE OF WARNING SIGNS, AND HOW WE ARE GOING TO REACT TO A STAGFLATIONARY DIRECTION SHOCK, SOMETHING THAT IS DRIVING DOWN EMPLOYMENT AND UP PRICES AT THE SAME TIME -- THAT IS ALWAYS A DIFFICULT SPOT. TYLER: I WANT TO ASK YOU ABOUT QUESTIONS SURROUNDING THE FED'S INDEPENDENCE. WE JUST HAD FHS A DIRECTOR BILL PULTE WHO SAID HE WILL NOT LET UP ON HIS CAMPAIGN WHEN IT COMES TO ALLEGATIONS OF MORTGAGE FRAUD, INCLUDING AGAINST FED GOVERNOR LISA COOK. DO YOU SUPPORT COOK'S DECISION NOT TO RESIGN AND DO YOU THINK THIS PRESSURE CAMPAIGN FROM THE WHITE HOUSE HAS HURT THE FED'S CREDIBILITY? > > I RUN THE CHICAGO FED. WE ARE A REGIONAL BANK. I'M NOT GOING TO GET INTO TWITTER KERFUFFLE'S OR WHATEVER IS HAPPENING. LONG BEFORE I WAS AT THE FED, I WAS AN ECONOMIST, AND ECONOMISTS ARE PRETTY CLOSE TO UNANIMOUS THAT HAVING A CENTRAL BANK THAT IS INDEPENDENT OF POLITICAL INTERFERENCE IS CRITICALLY IMPORTANT TO THE OPERATION OF THE CENTRAL BANK, AND THE REASON THEY ARE UNANIMOUS ABOUT THAT TOPIC IS BECAUSE IF YOU JUST LOOK AT PLACES WHERE THAT IS NOT TRUE, WHERE THE GOVERNMENT CAN ORDER THE CENTRAL BANK TO CUT INTEREST RATES, INFLATION IS HIGHER, GROWTH SLOWER, UNEMPLOYMENT WORSE, AND IF WE DO NOT HAVE AN INDEPENDENT CENTRAL BANK, INFLATION IS COMING BACK, SO I THINK IT IS ABSOLUTELY CRITICAL THAT WE MAINTAIN INDEPENDENCE FROM POLITICAL INTERFERENCE. MICHAEL: I WANTED TO COME BACK TO THE BROADER QUESTION OF THE ECONOMY AND INFLATION, TOO, BECAUSE EARLIER THIS MONTH, WE SAW TARIFFS START TO TAKE EFFECT AND BE ENFORCED, AND WE MAY HAVE MORE COMING STILL ON DRUGS AND SEMICONDUCTORS. WHERE DO YOU SEE THIS IMPACT PLAYING OUT ACROSS THE ECONOMY, AND HOW SOON DO YOU EXPECT TO SEE BUSINESSES START TO PASS THESE COSTS ALONG TO CONSUMERS? > > THAT'S KIND OF THE CRITICAL TWO QUESTIONS ABOUT TARIFFS -- HOW MUCH WILL THEY DRIVE UP PRICES, AND HOW LONG WILL THAT PRICE INCREASE LAST? THERE IS AN ARGUMENT THAT IN PURE THEORY, IF IT WAS A ONE AND DONE TARIFF, THAT WOULD BE A ONE-TIME INCREASE IN THE PRICE LEVEL, AND AS AN INFLATIONARY IMPETUS, IT WOULD BE TRANSITORY, BUT AS SOON AS YOU USE THE WORD \"TRANSITORY,\" YOU WANT TO BE A LITTLE CAREFUL. THAT IS ONLY FOR A ONE AND DONE TARIFFS, AND THIS HAS NOT BEEN ONE AND IT DOES NOT SEEM CLOSE TO DONE. WE COULD GET ON A CYCLE THAT IS INFLATIONARY, AND IF THE TARIFFS ARE APPLIED TO INTERMEDIATE GOODS -- THAT IS PARTS, COMPONENTS, SUPPLIES, THINGS LIKE PRIMARY METALS, SEMICONDUCTORS, THINGS THAT GO INTO THE COST OF PRODUCTION FOR U.S. MANUFACTURING -- THAT IS ONE WAY THAT TARIFFS JUMP OUT OF THEIR 11% OF GDP LANE AND START MAKING ME MORE NERVOUS. NOW IT CEASES TO JUST BE AN INCREASE IN THE PRICES OF THE TARIFF-AFFECTED GOODS. NOW THOSE TARIFFS ARE RAISING PRICES IN THE INDUSTRIES THAT ARE USING THE TARIFF-AFFECTED GOODS, AND WE SAW IN COVID, THE FIGURE THAT IS, THE IS AFFECTING THE SUPPLY CHAIN AND DISRUPTING IT, THE LONGER AND PERSISTENT THAT COULD LAST. THOSE ARE THE QUESTIONS FLOATING AROUND THAT WE ARE GRAPPLING WITH. MICHAEL: I WANT TO GO BACK TO THE WHITE HOUSE VERSUS FED SITUATION FOR MOMENT. THE ADMINISTRATION HAS ALLEGED MORTGAGE FRAUD AGAINST THREE PEOPLE -- ADAM SCHIFF, CRADDICK ATTORNEY GENERAL, AND NOW, LISA COOK. YOU WERE THE CHAIRMAN OF THE ECONOMIC ADVISOR'S COUNSEL TO PRESIDENT OBAMA. YOU ARE A DEMOCRAT. ARE YOU WORRIED THEY MIGHT COME AFTER YOU? > > I DID NOT KNOW WHERE YOU WERE GOING WITH THAT. AS I SAY, I'M HERE, MEMBER OF THE FOMC. THE LAW IS QUITE CLEAR UP WHAT SHOULD DETERMINE INTEREST RATES. IT IS THE FOMC AND WE ARE SUPPOSED TO BE LOOKING AT STABILIZING PRICES AND MAXIMIZING EMPLOYMENT. YOU BECOME A MEMBER OF THE FEDERAL RESERVE, YOU ARE OUT OF THE POLITICS BUSINESS. I'M TRYING NOT TO GET DISTRACTED FROM THE BASIC THREAD OF WE MUST FIGURE OUT WHERE WE ARE ON THOSE DUAL MANDATE CROWNS WITH SETTING INTEREST RATES, AND THAT IS WHAT WE SHOULD BE RAISING INTEREST RATE DECISIONS ON. SHOULD NOT BE ABOUT POWER POLITICS. SHOULD NOT BE ABOUT WHAT SOMEBODY SAID ABOUT SOMEBODY ELSE ON TWITTER. WE GO INTO THAT ROOM AND WE TAKE THE JOB VERY SERIOUSLY. MICHAEL: AUSTIN GOOLSBY, THANK YOU VERY MUCH FOR JOINING US, THE PRESIDENT OF THE CHICAGO FEDERAL RESERVE. MICHAEL: BLOOMBERG'S MICHAEL MCKEE AND CHICAGO PRESIDENT -- CHICAGO FED PRESIDENT AUSTIN GOOLSBY, THANK YOU BOTH. TYLER: MORE, CHECK OUT THE NEWSLETTER ON THE TERMINAL AND ONLINE. THANKS FOR JOINING US. WE WILL BE BACK TOMORROW. ALONGSIDE MICHAEL SHEPARD, I'M TYLER KENDALL. KEEP IT HERE. THIS IS BLOOMBERG. ♪",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97705078125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9658203125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.701171875
    }
  ],
  "sentiment": {
    "positive": 0.088834435,
    "negative": 0.5584434,
    "neutral": 0.35272217
  },
  "summary": "The US President, Donald Trump, has defended his decision to send a National Guard Guard into Washington, D.C. The DOJ has announced plans to potentially investigate FEDERAL RESERVE GOVERNOR LISA COOK, following allegations of wrongdoing by the Federal Reserve (FED) and is considering removing her from the post. Despite this, a top official from the White House has urged the DOJ to remove COOK from her post. Meanwhile, TEXAS is close to redrawing its CONGRESSIONAL MAPS, potentially setting up a showdown with California as next year's midterms take shape. The White House is also facing scrutiny over the potential misuse of power by the DOJ regarding the COOK investigation. There are concerns that this could be a potential WEAPONIZATION of your office or a WEAP ON THE WHITE House.",
  "shortSummary": "President Trump visits Washington, amid investigations into FEDERAL REServe GoverNOR's alleged WRONGDOING and potential conflicts with states.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f5fd7576bd364ad5826c8c7c56988983",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The Bloomberg program \"Balance of Power\" covered a range of political and economic issues, including a DOJ pressure campaign to investigate Federal Reserve Governor Lisa Cook over alleged mortgage fraud and the White House’s push for her resignation. Trump announced the deployment of the National Guard to Washington, D.C. to address crime, while former Vice President Mike Pence expressed support for the move and highlighted concerns about the Fed’s independence. The discussion also touched on tariff policy, AI and electric‑grid investments, and the broader impact of trade measures on inflation and the economy. Pence and other guests emphasized the need for a balanced approach to tariffs and the importance of maintaining the Federal Reserve’s political neutrality as the market anticipates the upcoming Fed policy meeting at Jackson Hole.",
  "argos_id": "IL18LILP6"
}