{
  "url": "https://www.reuters.com/world/china/australia-pushes-ratify-nauru-security-treaty-ahead-china-investment-2025-08-25/",
  "authorsByline": "Kirsty Needham",
  "articleId": "05bcdfdef7384872890b6d953fe8c65f",
  "source": {
    "domain": "reuters.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.reuters.com/resizer/v2/466BJJQ7PVGY5O53NZ3KL65MHM.png?auth=b9c3bf166c40a6778eb5672993fde7c30a15f48329026674eff92afd8da1d0ca&height=1005&width=1920&quality=80&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T05:20:58.254000+00:00",
  "addDate": "2025-08-25T05:23:46.309261+00:00",
  "refreshDate": "2025-08-25T05:23:46.309262+00:00",
  "score": 1.0,
  "title": "Australia pushes to ratify Nauru security treaty ahead of China investment",
  "description": "Australia will seek to ratify a landmark security and economic treaty with its tiny neighbour Nauru by next month, Australian officials said on Monday, amid concern a A$1 billion (US$648.85 million) Chinese investment proposal could breach its provisions.",
  "content": "SYDNEY, Aug 25 (Reuters) - Australia will seek to ratify a landmark security and economic treaty with its tiny neighbour Nauru by next month, Australian officials said on Monday, amid concern a A$1 billion (US$648.85 million) Chinese investment proposal could breach its provisions.\n\nNauru, with a population of 12,000, announced an investment deal with the little-known China Rural Revitalization and Development Corp earlier this month.\n\nThe leaders of Nauru and Australia announced a treaty in December in which Australia pledged A$100 million in budget support and A$40 million for security, and gained a veto over Chinese involvement in critical areas including Nauru's security, banking, and telecommunications.\n\nThe treaty has been ratified by Nauru, but not Australia, because its parliament was dissolved for months for a national election.\n\n\"It's important that we move forward and ratify as quickly as possible,\" Mark Tattersall, an official with the Department of Foreign Affairs and Trade, told an Australian parliament committee examining the treaty on Monday.\n\nAn earlier press release from Nauru's government said the Chinese company would develop the renewable energy, phosphate industry, fisheries, water, agriculture, transportation and health sectors.\n\nAustralian diplomats had asked China and Nauru about the deal because of concern it could trigger provisions in Australia's security treaty, Tattersall said.\n\nNauru replied saying the Chinese investment had not yet been considered by Nauru's cabinet, he said.\n\n\"We have heard the details of the arrangement - it does appear as though actual implementation of any further investment in Nauru is potentially some time off,\" he added.\n\nAustralia has said it wants to announce the ratification of the Nauru treaty at a meeting of Pacific Island leaders next month, which China will not attend.\n\nAustralian concern about Beijing's ambitions in the Pacific Islands grew after the Solomon Islands signed a security deal with China in 2022, and China test-fired an intercontinental ballistic missile with a dummy warhead into the Pacific last year.\n\nChina has said its presence in the Pacific is focused on building infrastructure to improve people's lives.",
  "medium": "Article",
  "links": [
    "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
    "https://www.reutersagency.com/en/licensereuterscontent/?utm_medium=rcom-article-media&utm_campaign=rcom-rcp-lead"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Nauru security treaty",
      "weight": 0.13590844
    },
    {
      "name": "Nauru",
      "weight": 0.10544476
    },
    {
      "name": "China investment",
      "weight": 0.10319409
    },
    {
      "name": "security",
      "weight": 0.08644026
    },
    {
      "name": "Pacific Island leaders",
      "weight": 0.08283078
    },
    {
      "name": "Australian concern",
      "weight": 0.08174272
    },
    {
      "name": "China",
      "weight": 0.07989014
    },
    {
      "name": "Pacific Island",
      "weight": 0.079032
    },
    {
      "name": "Australian officials",
      "weight": 0.07817531
    },
    {
      "name": "Chinese involvement",
      "weight": 0.076370314
    }
  ],
  "topics": [
    {
      "name": "Australia"
    }
  ],
  "categories": [
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97509765625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.958984375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.92822265625
    },
    {
      "name": "/News/World News",
      "score": 0.7197265625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.50634765625
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.318359375
    }
  ],
  "sentiment": {
    "positive": 0.09296411,
    "negative": 0.6263619,
    "neutral": 0.280674
  },
  "summary": "Australia is planning to ratify a landmark security and economic treaty with Nauru by next month, amid concerns that a $1 billion Chinese investment proposal could breach its provisions. The treaty, announced by the leaders of Naurus and Australia in December, includes Australia pledging $100 million in budget support and $40 million for security, and gaining veto over Chinese involvement in critical areas such as Naurur's security, banking, and telecommunications. NaurU, with a population of 12,000, announced an investment deal with the little-known China Rural Revitalization and Development Corp earlier this month. Australia has asked China and Nauran about the deal, but N.ately, Australia plans to announce its ratification at a meeting of Pacific Island leaders next month.",
  "shortSummary": "Australia aims to ratify a key security treaty with Nauru by next month, amid concerns a Chinese investment proposal could breach its provisions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d37f359428a444a1a09e9b1a7e773514",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
      "text": "The Trust Principles\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity, and freedom from bias in the gathering and dissemination of information and news.\nTrust Principles – the history\nThe Trust Principles were created in 1941, in the midst of World War II, in agreement with The Newspaper Proprietors Association Limited and The Press Association Limited (being the Reuters shareholders at that time). The Trust Principles imposed obligations on Reuters and its employees to act at all times with integrity, independence, and freedom from bias.\nReuters Directors and shareholders were determined to protect and preserve the Trust Principles when Reuters became a publicly traded company on the London Stock Exchange and Nasdaq. A unique structure was put in place to achieve this. A new company was formed and given the name 'Reuters Founders Share Company Limited', its purpose being to hold a 'Founders Share' in Reuters.\nThe legal structure has evolved over time and the Founders Share and other contractual arrangements now confer a number of special rights upon the Thomson Reuters Founders Share Company. For example, (i) the Thomson Reuters Founders Share Company has enhanced voting rights in circumstances where someone is seeking to obtain a significant shareholding in, or acquire control of, Thomson Reuters and (ii) the prior consent of the Thomson Reuters Founders Share Company must be sought prior to undertaking any sale of, or other material transaction involving, the Reuters news business unit.\nThomson Reuters itself is obliged and committed to apply the Trust Principles to its operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the Thomson Reuters business and require Thomson Reuters Directors, in the performance of their duties, to have due regard to the Trust Principles, by the proper exercise of their powers and in accordance with their other duties as Directors.\nThe Trust Principles are:\n- That Reuters shall at no time pass into the hands of any one interest, group, or faction;\n- That the integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved;\n- That Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers and to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts;\n- That Thomson Reuters shall pay due regard to the many interests which it serves in addition to those of the media; and\n- That no effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business\nThomson Reuters Founders Share Company was established in 1984 when Reuters became a public company. The directors of Thomson Reuters Founders Share Company (known as ‘Trustees’) have a duty to ensure, to the extent possible, that the Trust Principles are complied with.\nThe Trustees are experienced and eminent people from diverse arenas in politics, diplomacy, media, public service and business. The Trustees are selected by a nomination committee and proposed to the board of the Thomson Reuters Founders Share Company for appointment. The nomination committee assists in scrutinizing candidates’ suitability and its members include two persons appointed by the chairman after consultation with the European Court of Human Rights and representatives of certain press associations. The Thomson Reuters Corporation board has two representatives on the nomination committee. The Chairman and Deputy Chairman of the Thomson Reuters Founders Share Company Board are members of the nomination committee, and the Chairman appoints three other directors of the Thomson Reuters Founders Share Company as members of the nomination committee. The Chairman of the Thomson Reuters Founders Share Company acts as chairman of the nomination committee.\nThe number of Trustees has to be at least 14 and not more than 18. Trustees have a minimum of two meetings per year, and receive reports on our activities in the different fields in which we operate (including Reuters news). The Trustees meet with both the Thomson Reuters Board and representatives of senior management. Through Thomson Reuters Founders Share Company's Chairman, regular contact is maintained with our company. The relationship is one of trust and confidence.\nIndependence of Thomson Reuters\nCustomers across the world depend on us to provide them with reliable and objective news and information.\nThis means that we have a special need to safeguard our independence and integrity and avoid any bias which may stem from control by specific individuals or interests.\nThe Thomson Reuters Trust Principles were adopted in 1941 and include the preservation of integrity, reliability of news, development of the news business, and related principles.\nToday, the Trust Principles are fundamental to our entire business.\nMore information\nContact us\nBrian Moss\nFor inquiries pertaining to Reuters reporting standards and the Trust Principles please email: brian.moss@thomsonreuters.com."
    }
  ],
  "argos_summary": "Australia plans to ratify a security and economic treaty with Nauru next month, which includes A$100 million in budget support, A$40 million for security, and a veto over Chinese involvement in key sectors. The treaty, already ratified by Nauru, is pending Australian approval because of concerns that a recent A$1 billion Chinese investment proposal could breach its provisions. Australian officials are monitoring the deal, which would allow Chinese investment in renewable energy, phosphate, fisheries, water, agriculture, transport and health, while maintaining control over Nauru’s security, banking and telecommunications. The ratification is expected to be announced at a Pacific Island leaders’ meeting, where China will not attend. The article also includes an unrelated section detailing Thomson Reuters’ Trust Principles and governance structure.",
  "argos_id": "IO2U2A3OE"
}