{
  "url": "https://www.aljazeera.com/sports/2025/8/24/marc-marquez-wins-hungarian-motogp-for-seventh-straight-victory",
  "authorsByline": "Al Jazeera",
  "articleId": "ed6c21e44c154f5e8266db13362376b9",
  "source": {
    "domain": "aljazeera.com",
    "paywall": false,
    "location": {
      "country": "qa",
      "city": "Doha",
      "coordinates": {
        "lat": 25.2856329,
        "lon": 51.5264162
      }
    }
  },
  "imageUrl": "https://www.aljazeera.com/wp-content/uploads/2025/08/2025-08-24T131340Z_1332171949_UP1EL8O10QREL_RTRMADP_3_MOTOR-MOTOGP-HUNGARY-1756042823.jpg?resize=1200%2C675",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T14:11:54+00:00",
  "addDate": "2025-08-24T14:19:48.596347+00:00",
  "refreshDate": "2025-08-24T14:19:48.596349+00:00",
  "score": 1.0,
  "title": "Marquez wins Hungarian GP for seventh straight sprint-race double",
  "description": "The six-time MotoGP world champion is undefeated since June and is rapidly closing in on another riders title.",
  "content": "The six-time MotoGP world champion is undefeated since June and is rapidly closing in on another riders title.\n\nDucati’s Marc Marquez has delivered a masterclass at the Balaton Park Circuit, winning the first Hungarian Grand Prix in 33 years to secure his seventh straight sprint and main race double and stretching his championship lead to a commanding 175 points.\n\nKTM’s Pedro Acosta and Aprilia’s Marco Bezzecchi joined Marquez on the podium on Sunday as reigning champion Jorge Martin came fourth – his best finish on the Aprilia since his return from injuries.\n\nGresini Racing’s Alex Marquez, second in the championship behind his brother, could manage only 14th place after an early fall on the opening lap.\n\nAgainst the picturesque backdrop of the largest lake in Central Europe, pole-sitter Marc Marquez lost the lead on lap one to drop out of the podium positions, but his tyre strategy proved decisive.\n\nHaving clinched his 13th sprint victory of the season on Saturday, Marquez had another good launch to lead into turn one.\n\nBut Bezzecchi took the lead on the next turn, as Marquez made contact with the Aprilia and lost speed to drop to fourth.\n\n“Luckily for both of us, I was able to save the crash, and he just continued his way. But from that point, the race changed a bit,” Marquez said.\n\nBezzecchi and then-second-placed Franco Morbidelli were on soft rear tyres while Marquez was on the medium compound with the Spaniard easily climbing to second once his tyres were fully warmed up.\n\nAcosta also made a smooth overtake on Morbidelli to move up to third, but he had a gap of nearly two seconds with Marquez, who had virtually erased Bezzecchi’s lead as they continually exchanged overtakes.\n\nMarquez patiently bided his time, staying on Bezzecchi’s rear wheel. The inevitable moment came on lap 11 when he pounced, using the Aprilia’s slipstream to reclaim the lead before streaking away.\n\n“When I saw that the soft rear tyres started to drop – I was with the medium – I started to attack,” he said. “I had a super nice rhythm. I was flowing on the track.”\n\nFive laps later, Acosta attacked Bezzecchi on the same straight heading into turn one, guiding his KTM past the Aprilia on the inside and carrying that momentum into the next turn to take second.\n\n“I needed the extra grip from the soft [tyre] in braking, so I risked it with the soft. But for us, maybe it was better [to use] the medium,” Bezzecchi said.\n\nAlthough Acosta had Marquez in his sights, the six-time champion found another gear towards the end of the race and extended his lead to more than three seconds to secure the victory.\n\nHowever, the second-year MotoGP rider was happy with second place after destroying his bike in a qualifying crash.\n\n“I just want to thank every one of them because yesterday they were working until 2am in the morning to just bring two completely new bikes for this [race],” Acosta said.\n\nThe Aprilia garage was all smiles when Martin, who started 16th on the grid, set a fastest lap before finishing fourth – suggesting that injury struggles are now behind him.",
  "medium": "Article",
  "links": [
    "https://www.aljazeera.com/sports/2025/8/23/ronaldo-breaks-unique-record-but-al-nassr-lose-saudi-super-cup-to-al-ahli",
    "https://www.aljazeera.com/sports/2025/8/24/barcelona-defeat-levante-with-thrilling-comeback-in-la-liga",
    "https://www.aljazeera.com/sports/2025/8/24/newcastle-vs-liverpool-premier-league-teams-start-lineups"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Marc Marquez",
      "weight": 0.09689085
    },
    {
      "name": "Marquez",
      "weight": 0.09250327
    },
    {
      "name": "Alex Marquez",
      "weight": 0.09239005
    },
    {
      "name": "soft rear tyres",
      "weight": 0.08081324
    },
    {
      "name": "Marco Bezzecchi",
      "weight": 0.07342014
    },
    {
      "name": "second place",
      "weight": 0.07262899
    },
    {
      "name": "Bezzecchi",
      "weight": 0.0712355
    },
    {
      "name": "Aprilia",
      "weight": 0.06960474
    },
    {
      "name": "reigning champion Jorge Martin",
      "weight": 0.06613179
    },
    {
      "name": "Pedro Acosta",
      "weight": 0.06214702
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9873046875
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.5908203125
    },
    {
      "name": "/Sports/Motor Sports/Auto Racing",
      "score": 0.5712890625
    }
  ],
  "sentiment": {
    "positive": 0.32437626,
    "negative": 0.24484459,
    "neutral": 0.43077916
  },
  "summary": "Ducati's Marc Marquez won the first Hungarian Grand Prix in 33 years, marking his seventh consecutive sprint and main race double. The six-time world champion is undefeated since June and is closing in on another riders title. KTM's Pedro Acosta and Aprilia's Marco Bezzecchi also finished on the podium. Reigning champion Jorge Martin came fourth, his best finish on the Aprilia since his return from injuries. Gresini Racing's Alex Marquez, who is second in the championship behind his brother, could only manage 14th place. Marquez's victory was attributed to his tyre strategy, which allowed him to reclaim the lead on lap 11.",
  "shortSummary": "Marc Marquez won the Hungarian Grand Prix, securing his seventh consecutive sprint and main race victory, while KTM's Pedro Acosta and Aprilia's Marco Bezzecchi finished second.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "5f4d8c9c5b7c4c74a27fe947ebfc26fb",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.aljazeera.com/sports/2025/8/24/barcelona-defeat-levante-with-thrilling-comeback-in-la-liga",
      "text": "Barcelona defeat Levante with thrilling comeback in La Liga\nReigning Spanish League champions recovered from a two-goal, halftime deficit to pull off a stunning comeback against Levante.\nBarcelona fought back from a two-goal deficit to win 3-2 at Levante with a late own-goal by the hosts in La Liga.\nDefending champions Barcelona needed Pedri Gonzalez and Ferran Torres to score early in the second half to equalise after the newly promoted Levante had rolled to a surprise two-goal lead at halftime on Saturday.\nRecommended Stories\nlist of 4 itemsReal Madrid seek to avoid slip up at newly-promoted Oviedo – all to know\nUS Open: All to know about 2025’s last tennis Grand Slam\nGaza bodybuilders fight to preserve muscle amid deliberate starvation\nLamine Yamal then helped to produce the winning goal when he curled a cross into the 6-yard box, and Levante’s Unai Elgezabal headed into his own net.\nLevante striker Ivan Romero earlier struck from a counterattack in the 15th minute that started with a ball lost by Yamal. Jose Luis Morales made it 2-0 in first-half injury time by converting a penalty after a video review called a handball by Alejandro Balde when he blocked Morales’s shot.\nBut Pedri started the fightback in the 49th when he received Yamal’s pass well outside the area, picked his spot in the corner of the net and blasted in a shot from long range.\nFerran, who had hit the woodwork in the first half, levelled in the 52nd when he fended off his marker and volleyed in Raphinha’s corner kick.\nBarcelona then pressed for the decider, which Yamal helped find just after the 90 minutes were up.\nBarcelona coach Hansi Flick praised Pedri for his goal, saying that “it changed the match”.\n“The first goal we scored helped us a lot to get our confidence in the box, but until the end, it was not easy for us to get the three points.”\nBarcelona won its opener at nine-man Mallorca 3-0 last weekend.\nRashford makes first league start\nNewcomer Marcus Rashford made his first league start for Barcelona since his loan move from Manchester United as a left-side forward for Flick.\nThe English international was replaced by Dani Olmo at halftime, after the biggest threats had come from Pedri’s passes in the middle and Yamal’s incursions down the right.\n“I think Marcus [Rashford] had some situations in the first half where he showed how good he is and how he can help us, and that is how we have to continue,” Flick said.\nBarcelona’s Robert Lewandowski played his first minutes of the season as a late substitute after recovering from a muscle injury.\nBarca will visit Rayo Vallecano next week as it continues its title defence. Levante, which has lost both its opening fixtures, will travel to Elche, hoping for a more positive result."
    },
    {
      "url": "https://www.aljazeera.com/sports/2025/8/24/newcastle-vs-liverpool-premier-league-teams-start-lineups",
      "text": "Newcastle vs Liverpool: Premier League – team news, start time and lineups\nDefending champions Liverpool arrive in Newcastle eyeing three Premier League points and the home side’s wantaway striker Alexander Isak.\nWho: Newcastle United vs Liverpool\nWhat: English Premier League\nWhere: St James’ Park, Newcastle, United Kingdom\nWhen: Monday, August 25 at 8pm (19:00 GMT)\nHow to follow: We’ll have all the updates on Al Jazeera Sport from 5pm (16:00 GMT) in advance of our live text commentary stream.\nRecommended Stories\nlist of 4 itemsRonaldo breaks unique record but Al Nassr lose Saudi Super Cup to Al-Ahli\nUS Open: All to know about 2025’s last tennis Grand Slam\nGaza bodybuilders fight to preserve muscle amid deliberate starvation\nLiverpool will visit Newcastle United on Monday night amid a juicy transfer saga involving the Reds trying to pry striker Alexander Isak away from the Magpies.\nThe Swedish striker has been training alone in advance of the new season with an impasse reached between the club and player.\nAl Jazeera Sport takes a look at the battle that has as much focus on off-field matters as those on it.\nWhat is the latest on the Isak situation?\nNewcastle so far have rebuffed the efforts of Liverpool. Isak, however, on social media has made clear his desire to make the move to the defending Premier League champions and his dissatisfaction with the Magpies for obstructing it.\nAs a result, he has been training away from the rest of the Newcastle squad as they prepare for a rematch of their 2025 Carabao Cup triumph, which marked the Magpies first major trophy win in 70 years.\nManager Eddie Howe confirmed Isak will not play Monday. But he is hopeful the Swedish striker who scored 23 league goals last season can be reintegrated into the squad, saying there is no personal animosity between them.\nHe also admits the ordeal has put the club in a difficult position.\n“It is a lose/lose situation to a degree for us because I don’t think we can come out of this winning in any situation,” Howe told reporters Friday. “We love Alex in the sense of what he’s done for the football club since he’s been here, what he’s contributed, what he’s given, how professional he’s been.”\nWhat was Newcastle’s result in their Premier League opener?\nWithout Isak, the Magpies were forced to settle for a 0-0 draw at Aston Villa to open their campaign despite creating the majority of the chances.\nHow did Liverpool fair in their Premier League opener?\nLiverpool looked excellent at times and vulnerable at others in their season-opening 4-2 home win against Bournemouth, one that came despite giving back a two-goal lead via Antoine Semenyo’s second-half brace.\nSubstitute Federico Chiesa scored the eventual winner in the 88th minute, and Mo Salah added his first of the year in second-half stoppage time. Summer signing Hugo Ekikite scored his first Liverpool goal and added his first assist to help the Reds to a 2-0 lead.\nWhat is Liverpool’s take on the Newcastle trip?\nLiverpool manager Arne Slot is mindful of the hostile atmosphere his side would be likely to face even without the Isak episode.\n“Nothing to do with anything that’s in the media a lot, but I think if you go to Newcastle, you know what to expect,” Slot said. “We’ve played them three times last season, and twice their intensity levels were above ours. In the away game, especially the first 60 minutes, they were so, so, so intense. They were fully deserved [of a point].”\nWhat happened the last time Newcastle met Liverpool?\nNewcastle were 2-1 winners against Liverpool in the Carabao Cup final in March.\nThe teams shared a 3-3 draw at St James’ Park last season, but the Reds did win the league meeting at Anfield 2-0.\nHead-to-head\nThis is the 189th meeting between the clubs, with Liverpool winning on 93 occasions compared to Newcastle’s 50 victories.\nNewcastle have not beaten Liverpool in the league since a 2-0 home win in December 2015.\nThe Reds have won 12 of 17 fixtures between the clubs since then.\nNewcastle team news\nIsak is the big-name omission from the Newcastle match-day squad once again.\nShould Joe Willock return from a calf problem, however, then Newcastle will otherwise have a fully fit squad to choose from.\nJacob Ramsey has signed from Aston Villa and could be in line for a debut for the Magpies.\nLiverpool team news\nOne of Liverpool’s new signings, Jeremie Frimpong, will be out after the international break with a hamstring injury.\nConor Bradley has returned to full training from injury, but Joe Gomez is still be assessed following a knock but may not yet be fully fit to start.\nPredicted Newcastle starting lineup\nPope; Trippier, Schar, Burn, Livramento; Guimaraes, Tonali, Joelinton; Elanga, Gordon, Barnes\nPredicted Liverpool starting lineup\nAlisson; Szoboszlai, Konate, Van Dijk, Kerkez; Gravenberch, Mac Allister; Salah, Wirtz, Gakpo; Ekitike"
    },
    {
      "url": "https://www.aljazeera.com/sports/2025/8/23/ronaldo-breaks-unique-record-but-al-nassr-lose-saudi-super-cup-to-al-ahli",
      "text": "Ronaldo breaks unique record but Al Nassr lose Saudi Super Cup to Al-Ahli\nCristiano Ronaldo is first player to score 100 goals for four professional clubs but Al Nassr lose final to Al-Ahli.\nCristiano Ronaldo became the first player to score 100 competitive goals for four different clubs, though Al Nassr lost to Al-Ahli in a penalty shootout after the Saudi Super Cup final ended 2-2.\nThe first half strike at Hong Kong Stadium on Saturday took the 40-year-old to his century for the Saudi Arabian club, which he joined in December 2022.\nRecommended Stories\nlist of 4 itemsIndia’s parliament bans vast online gambling industry\nGaza bodybuilders fight to preserve muscle amid deliberate starvation\nTop men’s tennis names shielded from ‘severe’ abuse by ATP AI tool\nIt adds to his 450 goals for Real Madrid, 145 for Manchester United and 101 for Juventus and moves Ronaldo ahead of the three players who had scored 100 times for three clubs: Isidro Langara, who played in Spain from 1930 to 1948, as well as Brazilian stars Romario and Neymar.\nRonaldo, who has yet to win a major trophy in Saudi Arabia, is also the leading international goalscorer with 138 goals for Portugal.\nThe five-time Ballon d’Or winner put Al Nassr ahead after 41 minutes with a penalty, though Franck Kessie quickly equalised for Al-Ahli.\nWith seven minutes remaining, Marcelo Brozovic restored Al Nassr’s lead, but there was still time for Brazilian defender Ibanez to head home a corner and take the game into a penalty shootout.\nRonaldo scored once more from the spot, but his teammate Abdullah al-Khaibari did not, and Al-Ahli won 5-3 to lift the first trophy of the Saudi Arabian season."
    }
  ],
  "argos_summary": "Marc Marquez dominated the Hungarian Grand Prix, securing his seventh straight sprint and main race double to extend his championship lead to 175 points. In La Liga, Barcelona staged a dramatic comeback to beat Levante 3-2 after a 2‑0 halftime deficit. Ahead of the Premier League clash, Newcastle are set to face Liverpool amid a transfer saga involving Alexander Isak, while Liverpool look to capitalize on their recent form. Meanwhile, Cristiano Ronaldo became the first player to score 100 goals for four professional clubs, though Al Nassr lost the Saudi Super Cup to Al‑Ahli on penalties.",
  "argos_id": "IXF0K2FTB"
}