{
  "url": "https://finance.yahoo.com/news/india-australia-trade-talks-hit-092419731.html",
  "authorsByline": "Manoj Kumar, Peter Hobson and Khushi Malhotra",
  "articleId": "20a787064e394b6a9cd269c0735eac47",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/reuters-finance.com/5b4653a58d0b466e907ae26950554406",
  "country": "us",
  "language": "en",
  "pubDate": "2025-07-11T09:24:19+00:00",
  "addDate": "2025-07-11T09:34:44.131487+00:00",
  "refreshDate": "2025-07-11T09:34:44.131488+00:00",
  "score": 1.0,
  "title": "India, Australia trade talks hit dairy, wine tariff hurdles as year-end deadline looms, say sources",
  "description": "NEW DELHI/CANBERRA (Reuters) -India has rejected Australia's push for deeper tariff cuts on dairy and alcohol, hampering efforts to conclude the second phase of a trade pact by year-end, two Indian government sources said.  An interim trade pact signed in 2022 lowered tariffs on a range of goods, but negotiations on a broader Comprehensive Economic Cooperation Agreement (CECA) covering goods, services and visas have slowed, with dairy and wine emerging as key sticking points, the sources said.  The officials declined to be named as they were not authorised to speak to media on confidential trade talks.",
  "content": "NEW DELHI/CANBERRA (Reuters) -India has rejected Australia's push for deeper tariff cuts on dairy and alcohol, hampering efforts to conclude the second phase of a trade pact by year-end, two Indian government sources said.\n\nAn interim trade pact signed in 2022 lowered tariffs on a range of goods, but negotiations on a broader Comprehensive Economic Cooperation Agreement (CECA) covering goods, services and visas have slowed, with dairy and wine emerging as key sticking points, the sources said.\n\nThe officials declined to be named as they were not authorised to speak to media on confidential trade talks.\n\nIndia's commerce ministry and Australia's Department of Foreign Affairs and Trade did not immediately respond to requests for comment.\n\nIndia's refusal to concede on politically sensitive dairy and agriculture products reflects mounting pressure from powerful farm groups, which is also shaping trade talks with other partners, including the United States.\n\n\"There is no question of agreeing to Australia's demands for further tariff cuts on dairy and wine,\" a senior Indian official with direct knowledge of the talks with Australia told Reuters.\n\n\"It could have an impact on millions of farmers and our nascent wine industry and grape producers.\"\n\nFarmer groups and politicians from Prime Minister Narendra Modi's home state Gujarat and grape-growing Maharashtra, along with the $35 billion alcoholic beverages industry, are strongly opposing any concessions, the official added.\n\nUnder the interim pact, tariffs on Australian wine priced above $5 per 750ml bottle were cut to 100% from 150%, with a provision of a reduction to 50% over 10 years, while for bottles above $15, tariffs dropped to 75%, with a target of 25% in a decade.\n\nAustralia is pushing to accelerate these cuts and gain better access for dairy products - including cheese, high- protein whey concentrate, lactose and processed items - currently taxed between 20% and 30%.\n\n\"We’d like to see a reduction in the price at which tariff reductions kick in and a speeding up of those reductions,\" said Lee McLean, CEO of industry body Australian Grape & Wine, noting rising demand could benefit both Indian and Australian winemakers because they make different products.\n\nEven relatively affordable Australian wines, he added, can retail for over A$100 ($65.77) in India due to high tariffs and taxes, despite costing just A$10-15 at home.\n\nKarl Ellis of Dairy Australia said India's vast and culturally sensitive dairy sector limits mainstream exports, but niche products like high-protein whey, lactose, and select cheeses offer promise.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "dairy products",
      "weight": 0.09288798
    },
    {
      "name": "tariff reductions",
      "weight": 0.09003657
    },
    {
      "name": "deeper tariff cuts",
      "weight": 0.08854827
    },
    {
      "name": "further tariff cuts",
      "weight": 0.088433094
    },
    {
      "name": "high tariffs",
      "weight": 0.08675958
    },
    {
      "name": "Australian wine",
      "weight": 0.08324097
    },
    {
      "name": "trade talks",
      "weight": 0.08273866
    },
    {
      "name": "confidential trade talks",
      "weight": 0.08137456
    },
    {
      "name": "tariffs",
      "weight": 0.080284126
    },
    {
      "name": "dairy",
      "weight": 0.07920073
    }
  ],
  "topics": [
    {
      "name": "Australia"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.98095703125
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.90234375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.888671875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.87158203125
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.8408203125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.74658203125
    },
    {
      "name": "/Business & Industrial/Agriculture & Forestry/Other",
      "score": 0.53564453125
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.46240234375
    },
    {
      "name": "/News/World News",
      "score": 0.34521484375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.308349609375
    }
  ],
  "sentiment": {
    "positive": 0.05215454,
    "negative": 0.7602539,
    "neutral": 0.18786621
  },
  "summary": "India has rejected Australia's request for further tariff cuts on dairy and alcohol, hampering efforts to conclude the second phase of a trade pact by the end of the year-end deadline. The agreement, signed in 2022, lowered tariffs on a range of goods but has since slowed negotiations on a broader Comprehensive Economic Cooperation Agreement (CECA) covering goods, services, and visas. India's refusal to concede on politically sensitive dairy and agriculture products is due to pressure from powerful farm groups, who are also influencing trade talks with other partners, including the United States. The Australian government is pushing to accelerate these cuts and gain better access for dairy products currently taxed between 20% and 30%.",
  "shortSummary": "India and Australia face significant tariff hurdles, with dairy and wine tariffs as key points for a potential CECA agreement.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7b99397634f748699eaf02861e1ea38c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "India has rejected Australia’s request for deeper tariff cuts on dairy and wine, stalling the finalisation of the second phase of the Comprehensive Economic Cooperation Agreement.  The move reflects pressure from powerful Indian farm groups and concerns over the impact on farmers and the nascent wine industry.  Australia seeks faster reductions and broader access for dairy products, while India maintains that further concessions would hurt its agricultural sector and domestic producers.",
  "argos_id": "J3DERJV5N"
}