{
  "url": "https://money.usnews.com/investing/news/articles/2025-08-25/orsted-cash-plan-at-risk-as-trump-government-blocks-us-wind-project",
  "authorsByline": "Reuters",
  "articleId": "69746eb341a945649ea28052e26c6343",
  "source": {
    "domain": "money.usnews.com",
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.usnews.com/dims4/USNEWS/d6ca6bf/2147483647/thumbnail/970x647/quality/85/?url=https%3A%2F%2Fwww.usnews.com%2Fcmsmedia%2F2c%2F58e40897fd876094f7c2564ba1c576%2Ftag%3Areuters.com%2C2025%3Anewsml_LYNXMPEL7O058%3A12025-08-25T050734Z_1_LYNXMPEL7O058_RTROPTP_3_ORSTED-RIGHTSISSUE.JPG",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T01:07:00-04:00",
  "addDate": "2025-08-25T05:23:18.103412+00:00",
  "refreshDate": "2025-08-25T05:23:18.103413+00:00",
  "score": 1.0,
  "title": "Orsted Cash Plan at Risk as Trump Government Blocks US Wind Project",
  "description": "US News is a recognized leader in college, grad school, hospital, mutual fund, and car rankings. Track elected officials, research health conditions, and find news you can use in politics, business, health, and education.",
  "content": "COPENHAGEN (Reuters) -Wind farm developer Orsted's plan to raise much-needed capital is at risk following a U.S. order to halt construction of a near-complete project, and the Danish group's share price could come under pressure on Monday, analysts said.\n\nThe Trump administration's Bureau of Ocean Energy Management (BOEM) published its stop-work order late on Friday, forcing the suspension of a project that was 80% complete with all offshore foundations in place and 45 out of 65 wind turbines installed.\n\nThe timing of the halt to Revolution Wind off Rhode Island is particularly damaging for Orsted, which announced earlier this month a plan to raise 60 billion Danish crowns ($9.42 billion) through a rights issue.\n\n\"This is a huge hurdle with regards to raising capital,\" Sydbank analyst Jacob Pedersen told Reuters. \"I've experienced a lot in my more than 20 years as a stock analyst, but this tops it all, I'm stunned,\" he added.\n\nAlphaValue analyst Pierre-Alexandre Ramondenc said the U.S. move could jeopardise the success of the rights issue, which he described as \"already highly dilutive.\"\n\n\"The news came as a major shock and amounts to nothing less than political hostage-taking by the U.S. administration, given the project's advanced stage,\" Ramondenc said.\n\nOn his first day in office in January, President Donald Trump suspended new offshore wind leasing pending environmental and economic review of projects. He has repeatedly criticised wind energy as ugly, unreliable and expensive.\n\nOrsted's share price, already down 30% since announcing its plan on August 11, now faces further downside risk, the analysts said.\n\nOrsted has said it will update investors on the impact of the BOEM order but has not said when and has declined to comment further.\n\nThe company is 50.1% owned by the Danish state, and Denmark's Finance Minister Nicolai Wammen said he was \"naturally following the case closely\".",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US Wind Project",
      "weight": 0.09273867
    },
    {
      "name": "Orsted Cash Plan",
      "weight": 0.090112396
    },
    {
      "name": "new offshore wind leasing",
      "weight": 0.084445044
    },
    {
      "name": "Sydbank analyst Jacob Pedersen",
      "weight": 0.08257815
    },
    {
      "name": "wind energy",
      "weight": 0.07707942
    },
    {
      "name": "President Donald Trump",
      "weight": 0.07379632
    },
    {
      "name": "analysts",
      "weight": 0.07367894
    },
    {
      "name": "projects",
      "weight": 0.072071575
    },
    {
      "name": "further downside risk",
      "weight": 0.071423
    },
    {
      "name": "Donald Trump",
      "weight": 0.06947545
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.93359375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.77294921875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.77001953125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.71826171875
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Renewable & Alternative Energy",
      "score": 0.650390625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.63525390625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.5732421875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.487548828125
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.39697265625
    }
  ],
  "sentiment": {
    "positive": 0.02347231,
    "negative": 0.857034,
    "neutral": 0.1194936
  },
  "summary": "Wind farm developer Orsted's plan to raise funds for the future of the company is at risk due to a U.S. government order to halt construction on a project that is 80% complete and has 45 out of 65 wind turbines installed. The timing of this decision is particularly problematic for Orsted, which had announced plans to raise 60 billion Danish crowns ($9.42 billion) through a rights issue earlier this month. Analysts believe this could jeopardise the success of the rights issue, which is already highly dilutive.",
  "shortSummary": "The Trump administration's suspension of a near-complete wind project in Rhode Island threatens Orsted's ability to raise capital through a significant share price drop.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "caaf5f5703584c90b1a0c03169c16c5f",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Orsted's near-complete Revolution Wind project in Rhode Island was halted by a BOEM stop‑work order, jeopardizing the company’s $9.42 billion rights issue and adding pressure to its shares, which have already fallen 30% since the announcement. Analysts say the halt is a major obstacle to raising capital and may force further dilution. The move follows President Trump’s earlier suspension of offshore wind leasing and reflects political opposition to wind energy.",
  "argos_id": "JFEUE0LAC"
}