{
  "url": "https://money.usnews.com/investing/news/articles/2025-07-11/india-australia-trade-talks-hit-dairy-wine-tariff-hurdles-as-year-end-deadline-looms-say-sources",
  "authorsByline": "Reuters",
  "articleId": "a9274e58a0044bb882ba6dc5ae36c67f",
  "source": {
    "domain": "money.usnews.com",
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.usnews.com/dims4/USNEWS/4f21a54/2147483647/thumbnail/970x647/quality/85/?url=https%3A%2F%2Fwww.usnews.com%2Fcmsmedia%2Fc6%2Fff50f182bb846cf871317319b01c2a%2Ftag%3Areuters.com%2C2025%3Anewsml_LYNXMPEL6A0C1%3A12025-07-11T093131Z_1_LYNXMPEL6A0C1_RTROPTP_3_AUSTRALIA-WINE.JPG",
  "country": "us",
  "language": "en",
  "pubDate": "2025-07-11T05:24:00-04:00",
  "addDate": "2025-07-11T09:44:22.667401+00:00",
  "refreshDate": "2025-07-11T09:44:22.667403+00:00",
  "score": 1.0,
  "title": "India, Australia Trade Talks Hit Dairy, Wine Tariff Hurdles as Year-End Deadline Looms, Say Sources",
  "description": "US News is a recognized leader in college, grad school, hospital, mutual fund, and car rankings. Track elected officials, research health conditions, and find news you can use in politics, business, health, and education.",
  "content": "NEW DELHI/CANBERRA (Reuters) -India has rejected Australia's push for deeper tariff cuts on dairy and alcohol, hampering efforts to conclude the second phase of a trade pact by year-end, two Indian government sources said.\n\nAn interim trade pact signed in 2022 lowered tariffs on a range of goods, but negotiations on a broader Comprehensive Economic Cooperation Agreement (CECA) covering goods, services and visas have slowed, with dairy and wine emerging as key sticking points, the sources said.\n\nThe officials declined to be named as they were not authorised to speak to media on confidential trade talks.\n\nIndia's refusal to concede on politically sensitive dairy and agriculture products reflects mounting pressure from powerful farm groups, which is also shaping trade talks with other partners, including the United States.\n\n\"There is no question of agreeing to Australia's demands for further tariff cuts on dairy and wine,\" a senior Indian official with direct knowledge of the talks with Australia told Reuters.\n\n\"It could have an impact on millions of farmers and our nascent wine industry and grape producers.\"\n\nFarmer groups and politicians from Prime Minister Narendra Modi's home state Gujarat and grape-growing Maharashtra, along with the $35 billion alcoholic beverages industry, are strongly opposing any concessions, the official added.\n\nUnder the interim pact, tariffs on Australian wine priced above $5 per 750ml bottle were cut to 100% from 150%, with a provision of a reduction to 50% over 10 years, while for bottles above $15, tariffs dropped to 75%, with a target of 25% in a decade.\n\nAustralia is pushing to accelerate these cuts and gain better access for dairy products - including cheese, high- protein whey concentrate, lactose and processed items - currently taxed between 20% and 30%.\n\n\"We’d like to see a reduction in the price at which tariff reductions kick in and a speeding up of those reductions,\" said Lee McLean, CEO of industry body Australian Grape & Wine, noting rising demand could benefit both Indian and Australian winemakers because they make different products.\n\nEven relatively affordable Australian wines, he added, can retail for over A$100 ($65.77) in India due to high tariffs and taxes, despite costing just A$10-15 at home.\n\n\"Current tariffs are prohibitive,\" he said, adding lower duties could help Australia tap into the $30-40 million market now served by European exporters.\n\nIndia is open to offer cutting tariffs on non-agricultural goods, including industrial items, while seeking more access for services and visas, a second official said.\n\nThe Australian Department of Foreign Affairs said the talks for CECA are backed by both prime ministers, and conclusion of the pact would boost two-way trade, while building a more resilient economic partnership.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "tariff reductions",
      "weight": 0.093364835
    },
    {
      "name": "deeper tariff cuts",
      "weight": 0.09089757
    },
    {
      "name": "further tariff cuts",
      "weight": 0.090712294
    },
    {
      "name": "Current tariffs",
      "weight": 0.08621768
    },
    {
      "name": "high tariffs",
      "weight": 0.08613094
    },
    {
      "name": "trade talks",
      "weight": 0.08563499
    },
    {
      "name": "tariffs",
      "weight": 0.08563008
    },
    {
      "name": "confidential trade talks",
      "weight": 0.08301601
    },
    {
      "name": "Australian wine",
      "weight": 0.082862444
    },
    {
      "name": "dairy products",
      "weight": 0.082298055
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Australia"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.97900390625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.9208984375
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.916015625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.81396484375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.80078125
    },
    {
      "name": "/Business & Industrial/Agriculture & Forestry/Other",
      "score": 0.72412109375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.61181640625
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.403076171875
    },
    {
      "name": "/News/World News",
      "score": 0.3623046875
    }
  ],
  "sentiment": {
    "positive": 0.067871094,
    "negative": 0.7128906,
    "neutral": 0.21887207
  },
  "summary": "India and Australia are in talks to conclude the second phase of a trade pact by year-end, with negotiations on a broader Comprehensive Economic Cooperation Agreement (CECA) covering goods, services, and visas slowing. This has led to a delay in the agreement, with India refusing to accept Australia's demands for further tariff cuts on dairy and alcohol. This stance has been supported by powerful farm groups, who are also influencing trade talks with other partners, including the US. Farmer groups and politicians from India's home state Gujarat and Maharashtra oppose any concessions. Australia is pushing to accelerate these cuts and gain better access for dairy products currently taxed between 20% and 30%.",
  "shortSummary": "India and Australia face delays in negotiating trade tariffs, with dairy and wine issues hindering efforts, while Australia seeks broader benefits.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7b99397634f748699eaf02861e1ea38c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "India has rejected Australia’s demand for deeper tariff cuts on dairy and wine, stalling the second phase of their Comprehensive Economic Cooperation Agreement. The decision reflects pressure from powerful Indian farm groups and concerns over the impact on farmers and the nascent wine sector. Australia seeks faster reductions to boost its wine and dairy exports to India, while India remains open to cuts on non‑agricultural goods and greater services and visa access.",
  "argos_id": "JRABYTUFM"
}