{
  "url": "https://www.benzinga.com/markets/tech/25/08/47301201/uber-ceo-says-building-camera-only-self-driving-system-very-difficult-elon-musk-responds-turned-off-the-radars-in-teslas-to-increase-safety",
  "authorsByline": "Badar Shaikh",
  "articleId": "90ba8dc7aafa47e08c1535ad4fa418d1",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "https://cdn.benzinga.com/files/images/story/2025/08/25/Uber-shutterstock-2416070631.jpeg?width=1200&height=800&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T00:54:24-04:00",
  "addDate": "2025-08-25T05:04:49.869597+00:00",
  "refreshDate": "2025-08-25T05:04:49.869599+00:00",
  "score": 1.0,
  "title": "Uber CEO Says Building Camera-Only Self-Driving System 'Very Difficult'—Elon Musk Responds, 'Turned Off The Radars In Teslas To Increase Safety' - Uber Technologies (NYSE:UBER)",
  "description": "Uber CEO offers insight on camera vs LiDAR debate in AVs, says safety needs superhuman levels to ensure smooth operations.",
  "content": "Uber Technologies Inc. UBER CEO Dara Khosrowshahi has offered his insight into the camera vs LiDAR system debate amid the U.S.'s self-driving push.\n\nCamera-Based Systems ‘Difficult' To Employ In The Near Term\n\nSpeaking on a podcast hosted by an Indian entrepreneur, Nikhil Kamath, on Sunday, Khosrowshahi said that he believes AVs (Autonomous Vehicles) need to have \"superhuman levels of safety,\" which exceeds human abilities by multitudes, adding that Alphabet Inc.'s GOOGL GOOG Waymo has proven it to be possible.\n\n\"I think in the near term, it's going to be very difficult and Elon [Musk] would tell me I'm wrong,\" Khosrowshahi said before adding that it was a possibility for a camera-only system to achieve superhuman safety levels \"at some point in the future.\"\n\nHe then mentioned that all of Uber's partners were using a combination of LiDAR and camera-based tech, which Khosrowshahi thinks is the \"right solution.\"\n\nFollowing the interview, Tesla CEO Elon Musk took to the social media platform X on Sunday, doubling down on camera-only systems.\n\n“Lidar and radar reduce safety due to sensor contention. If lidars/radars disagree with cameras, which one wins?” Musk said in the post, adding that Waymo autonomous cabs can’t drive on highways due to increased sensor ambiguity.\n\n“We turned off the radars in Teslas to increase safety. Cameras ftw,” Musk said in the post.\n\nThe interview comes as Uber's self-driving push gathers steam amid deals with Lucid Group Inc. LCID as well as self-driving company Nuro Inc. to deploy over 20,000 Robotaxis over the next six years.\n\nUber also says that customers on its platform are actively ditching human drivers for Robotaxis in Atlanta, where the company offers Waymo self-driving cabs.\n\nUber also invested in Nuro, which is now valued at $6 billion following series E funding, where the company raised over $203 million with other backers including Nvidia Corp NVDA.\n\nThe ride-hailing giant also announced a new incentive program for drivers in Colorado, offering $2,000 in benefits for switching to EVs, in addition to other state incentives.\n\nMeanwhile, Tesla Inc. TSLA FSD, or Full Self-Driving system, has been facing hurdles in the form of lawsuits filed against the company over misleading FSD capabilities, as well as a lawsuit filed by investors over FSD's safety concerns.\n\nThis comes as the NHTSA also announced it has launched an investigation into Tesla's delay in submitting self-driving crash reports, which the company said occurred due to data collection snags.\n\nElsewhere, Tesla has been criticized for its Robotaxis by experts, including former Waymo CEO John Krafcik, who slammed the effort as not being a \"real Robotaxi\" due to the presence of an onboard safety driver.\n\nTesla, on the other hand, is pushing on with Robotaxi testing, with a new job listing on the company's website showcasing an open position for a test driver in NYC to conduct trials and test runs of its Robotaxi in the city.\n\nUber scores well on Momentum and Growth metrics, while offering satisfactory Value. For more such insights, sign up for Benzinga Edge Stock Rankings today!\n\nCheck out more of Benzinga's Future Of Mobility coverage by following this link.",
  "medium": "Article",
  "links": [
    "https://www.benzinga.com/premium/ideas/benzinga-edge-2#:~:text=Turn%20Market%20Chaos,when%20markets%20rebound",
    "https://www.benzinga.com/topic/mobility",
    "https://www.benzinga.com/markets/tech/25/07/46496272/uber-partners-with-lucid-nuro-for-300m-push-into-self-driving-future",
    "http://www.benzinga.com/markets/tech/25/08/47278524/nvidia-uber-back-tesla-robotaxi-rival-nuro-to-6-billion-valuation-following-203-million-series-e-funding-round",
    "https://www.benzinga.com/markets/tech/25/08/46886208/elon-musk-says-its-never-actually-investors-as-tesla-faces-new-lawsuit-after-243-million-verdict",
    "https://www.benzinga.com/markets/tech/25/08/47180555/ubers-human-drivers-ghosted-in-atlanta-as-riders-hunt-for-waymo-robotaxis-report",
    "https://www.benzinga.com/markets/tech/25/08/47114834/uber-drivers-in-colorado-could-get-benefits-up-to-21500-switching-to-electric-heres-how",
    "https://www.benzinga.com/markets/tech/25/08/47277184/tesla-announces-surprise-price-hike-of-quickest-cybertruck-trim-amid-7500-ev-credit-deadline-declining-sales",
    "https://www.benzinga.com/markets/tech/25/08/47085436/elon-musks-tesla-offering-up-to-33-hour-for-nyc-robotaxi-test-drivers",
    "https://www.benzinga.com/markets/tech/25/08/47275062/nhtsa-launches-probe-into-elon-musk-led-tesla-following-crash-test-report-delays-involving-fsd-autopilot",
    "https://www.benzinga.com/markets/tech/25/08/47177159/ex-waymo-ceo-john-krafcik-unimpressed-by-tesla-robotaxi-as-elon-musk-slams-critics-they-will-switch"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Uber Technologies Inc.",
      "weight": 0.08074192
    },
    {
      "name": "Tesla CEO Elon Musk",
      "weight": 0.07804652
    },
    {
      "name": "Tesla Inc. TSLA FSD",
      "weight": 0.0736546
    },
    {
      "name": "superhuman safety levels",
      "weight": 0.07286355
    },
    {
      "name": "Tesla Inc.",
      "weight": 0.072015226
    },
    {
      "name": "Uber Technologies",
      "weight": 0.06963903
    },
    {
      "name": "UBER CEO Dara Khosrowshahi",
      "weight": 0.06773935
    },
    {
      "name": "former Waymo CEO John Krafcik",
      "weight": 0.066205725
    },
    {
      "name": "Uber CEO",
      "weight": 0.06593211
    },
    {
      "name": "self-driving company Nuro Inc.",
      "weight": 0.065624885
    }
  ],
  "topics": [
    {
      "name": "Business Leaders"
    },
    {
      "name": "Stocks"
    },
    {
      "name": "Ridesharing"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Auto"
    },
    {
      "name": "Finance"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.900390625
    },
    {
      "name": "/News/Technology News",
      "score": 0.85107421875
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Brand)/Tesla Motors",
      "score": 0.54248046875
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Hybrid & Alternative Vehicles",
      "score": 0.5419921875
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.53857421875
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Autonomous Vehicles",
      "score": 0.301025390625
    }
  ],
  "sentiment": {
    "positive": 0.18078536,
    "negative": 0.3501786,
    "neutral": 0.469036
  },
  "summary": "Uber CEO Dara Khosrowshahi has stated that building a Camera-Only Self-Driving System will be difficult in the near term, but it is possible for a camera-based system to achieve superhuman safety levels. Speaking on a podcast hosted by an Indian entrepreneur, Nikhil Kamath, he stated that all of Uber's partners are using a combination of LiDAR and camera technology. Following the interview, Tesla CEO Elon Musk responded by doubling down on camera-only systems, stating that they turned off the radars in Teslas to increase safety. This comes as Uber's self-driving push continues, with deals with Lucid Group Inc. and Nuro Inc. to deploy over 20,000 Robotaxis over the next six years. The company also announced a new incentive program for drivers in Colorado to switch to EV technology, and has invested in Nuro, now valued at $6 billion.",
  "shortSummary": "Uber CEO Dara Khosrowshahi states that camera-only self-driving systems are difficult to develop quickly, while Tesla defends them amid safety concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d3f6af6f75ec4e8a885f9b19f5887008",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.benzinga.com/markets/tech/25/08/47177159/ex-waymo-ceo-john-krafcik-unimpressed-by-tesla-robotaxi-as-elon-musk-slams-critics-they-will-switch",
      "text": "Alphabet Inc.'s GOOGL GOOG autonomous taxi service Waymo's former CEO, John Krafick, is skeptical about Tesla Inc.'s TSLA Robotaxi.\n‘Not A Robotaxi' Says John Krafcik\n\"Please let me know when Tesla launches a robotaxi, I’m still waiting,\" Krafcik said, adding that the company's ride-hailing service is not a Robotaxi since \"there’s an employee inside the car,\" Business Insider reported on Sunday.\nKrafcik also maintained that he had no interest in trying the Tesla robotaxi, the report suggests. He also criticized the company's ride-hailing service in the San Francisco Bay Area, comparing it with Uber Technologies Inc. UBER.\n\"If they were striving to re-create today’s Bay Area Uber experience, looks like they’ve absolutely nailed it,\" Krafcik said in the report.\nElon Musk Reacts\nFollowing Krafcik's comments, influencer Whole Mars Catalog took to social media platform X on Sunday, criticizing Krafcik. Replying to the post, Elon Musk also slammed Robotaxi critics.\n\"They will switch from claiming that Tesla self-driving is fake to Tesla self-driving is unfairly good,\" Musk said in the post.\nTesla's Bay Area Expansion, Musk's Ambitious Robotaxi Goal\nTesla currently operates an invite-only ride-hailing service in the San Francisco Bay Area, ever since Musk announced the company would be expanding into the region.\nHowever, the company's service has an onboard safety driver at all times since Tesla cannot operate Robotaxis in the state of California, as it does not have a permit.\nThe expansion follows Musk laying out the ambitious goal of serving over half the population of the U.S. with Tesla Robotaxis by the end of the year, which he shared during the company's second-quarter earnings call.\nTesla's Norway Defiance\nAmid the robotaxi expansions, Tesla has been grappling with poor sales figures across multiple regions in the world, with UK sales falling over 60% in July as Tesla delivered 987 units in the country.\nHowever, the Norwegian market has emerged as a defiant region for the company, as sales surged 24% in Norway with Tesla registering over 13,039 deliveries.\nTesla scores well on Momentum, Growth, and Quality metrics, but offers poor Value. For more such insights, sign up for Benzinga Edge Stock Rankings today!\nPhoto Courtesy: Josiah True on Shutterstock.com\nRead Next:\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/topic/mobility",
      "text": "España\nItalia\n대한민국\n日本\nFrançais\nMy Account\nBenzinga Edge\nBenzinga Research\nBenzinga Pro\nLogin\nGet Benzinga Pro\nData & APIs\nEvents\nPremarket\nAdvertise\nContribute\nEspaña\nItalia\n대한민국\n日本\nFrançais\nLogin\nRegister\nPremium Services\nFinancial News\nLatest\nEarnings\nGuidance\nDividends\nM&A\nBuybacks\nInterviews\nManagement\nOfferings\nIPOs\nInsider Trades\nBiotech/FDA\nPolitics\nHealthcare\nSmall-Cap\nMarkets\nPre-Market\nAfter Hours\nMovers\nETFs\nOptions\nCryptocurrency\nCommodities\nBonds\nFutures\nMining\nReal Estate\nVolatility\nRatings\nAnalyst Color\nDowngrades\nUpgrades\nInitiations\nPrice Target\nInvesting Ideas\nTrade Ideas\nLong Ideas\nShort Ideas\nTechnicals\nAnalyst Ratings\nAnalyst Color\nLatest Rumors\nWhisper Index\nStock of the Day\nBest Stocks & ETFs\nBest Penny Stocks\nBest S&P 500 ETFs\nBest Swing Trade Stocks\nBest Blue Chip Stocks\nBest High-Volume Penny Stocks\nBest Small Cap ETFs\nBest Stocks to Day Trade\nBest REITs\nMoney\nInvesting\nCryptocurrency\nMortgage\nInsurance\nYield\nPersonal Finance\nForex\nStartup Investing\nReal Estate Investing\nProp Trading\nCredit Cards\nStock Brokers\nFinancial News\nLatest\nEarnings\nGuidance\nDividends\nM&A\nBuybacks\nInterviews\nManagement\nOfferings\nIPOs\nInsider Trades\nBiotech/FDA\nPolitics\nHealthcare\nSmall-Cap\nMarkets\nPre-Market\nAfter Hours\nMovers\nETFs\nOptions\nCryptocurrency\nCommodities\nBonds\nFutures\nMining\nReal Estate\nVolatility\nRatings\nAnalyst Color\nDowngrades\nUpgrades\nInitiations\nPrice Target\nInvesting Ideas\nTrade Ideas\nLong Ideas\nShort Ideas\nTechnicals\nAnalyst Ratings\nAnalyst Color\nLatest Rumors\nWhisper Index\nStock of the Day\nBest Stocks & ETFs\nBest Penny Stocks\nBest S&P 500 ETFs\nBest Swing Trade Stocks\nBest Blue Chip Stocks\nBest High-Volume Penny Stocks\nBest Small Cap ETFs\nBest Stocks to Day Trade\nBest REITs\nMoney\nInvesting\nCryptocurrency\nMortgage\nInsurance\nYield\nPersonal Finance\nForex\nStartup Investing\nReal Estate Investing\nProp Trading\nCredit Cards\nStock Brokers\nResearch\nMy Stocks\nTools\nFree Benzinga Pro Trial\nCalendars\nAnalyst Ratings Calendar\nConference Call Calendar\nDividend Calendar\nEarnings Calendar\nEconomic Calendar\nFDA Calendar\nGuidance Calendar\nIPO Calendar\nM&A Calendar\nUnusual Options Activity Calendar\nSPAC Calendar\nStock Split Calendar\nTrade Ideas\nFree Stock Reports\nInsider Trades\nTrade Idea Feed\nAnalyst Ratings\nUnusual Options Activity\nHeatmaps\nFree Newsletter\nGovernment Trades\nPerfect Stock Portfolio\nEasy Income Portfolio\nShort Interest\nMost Shorted\nLargest Increase\nLargest Decrease\nCalculators\nMargin Calculator\nForex Profit Calculator\n100x Options Profit Calculator\nScreeners\nStock Screener\nTop Momentum Stocks\nTop Quality Stocks\nTop Value Stocks\nTop Growth Stocks\nCompare Best Stocks\nBest Momentum Stocks\nBest Quality Stocks\nBest Value Stocks\nBest Growth Stocks\nRecent\nMarkets\nMobility\nUber CEO Says Building Camera-Only Self-Driving System 'Very Difficult'—Elon Musk Responds, 'Turned Off The Radars In Teslas To Increase Safety'\nRivian To Build $5 Billion Georgia Plant, Tesla Offers $0 Down Leases, BYD EV Sales Jump 30% —Mobility This Week\nMusk Teases Flying Cybertruck: Is This A Pipe Dream Or A Future eVTOL?\nRivian To Build $5 Billion Georgia Plant, Tesla Offers $0 Down Leases, BYD EV Sales Jump 30% —Mobility This Week\nMusk Teases Flying Cybertruck: Is This A Pipe Dream Or A Future eVTOL?\nNio CEO Says Survival Matters Most As Company Bets On Aggressive Pricing For New ES8\nNvidia, Uber Back Tesla Robotaxi Rival Nuro To $6 Billion Valuation Following $203 Million Series E Funding Round\nNio CEO Says Survival Matters Most As Company Bets On Aggressive Pricing For New ES8\nNvidia, Uber Back Tesla Robotaxi Rival Nuro To $6 Billion Valuation Following $203 Million Series E Funding Round\nElon Musk's Tesla To Offer Grok, ChatGPT Rival DeepSeek, ByteDance's Doubao With Its Cars In China\nTesla Announces Surprise Price Hike Of Quickest Cybertruck Trim Amid $7,500 EV Credit Deadline, Declining Sales\nRead More...\nMobility Recent News\nTesla Cybertruck Secures 5-Star Safety Across The Board — Except For A 4-Star In This Category\nTesla Cybertruck receives NHTSA 5-star rating for driver and passenger safety, but sales continue to decline.\nNHTSA Launches Probe Into Elon Musk-Led Tesla Following Crash Test Report Delays Involving FSD, Autopilot\nNHTSA investigating Tesla for delays in self-driving crash reports under the Standing General Order 2021-01.\nChina's EHang Outclasses Joby, Archer In eVTOL Boom\nEHang's first-mover advantage and full certifications put it ahead of U.S. eVTOL rivals Joby and Archer. Profit forecast to skyrocket, while rivals lag.\nNio's Flagship ES8 SUV Enters Showrooms, Major Launch Event Hours Away\nNIO stock rises on analyst's price forecast update and release of third-generation ES8 SUV with larger size, fast charging, and 3-minute battery swap.\nTesla's Gigafactory In Germany Evacuated After Fire Incident Involving Battery Cells: Report\nTesla's Gigafactory in Germany was evacuated due to a fire incident involving EV battery cells on Monday afternoon.\nElon Musk's Tesla Launches $0 Down Leases On Used Model 3 And Model Y Vehicles In US Amid Sluggish Sales\nTesla offers $0 down leases on used EVs to boost sales amid declining figures; only available in CA and TX\nFord, SK On Kickstart EV Battery Production At $5 Billion Kentucky Assembly Plant\nFord and SK On's joint venture, BlueOval SK, has started production at their Kentucky plant to make batteries for the Ford F-150 Lightning.\nElon Musk Says Model Y L Might Not Be Coming To The US, Drawing Mixed Reactions From The Tesla Faithful: 'Really Bad Decision'\nTesla CEO Elon Musk hints that new Model Y L may not come to U.S. due to self-driving advancements, disappointing supporters.\nCalifornia Could Still Offer EV Incentives Despite Trump Ending $7,500 Federal Credit As Gavin Newsom Doubles Down On Electric Mobility\nCalifornia plans to offer incentives to EV buyers despite Trump ending federal credit, used cars and fleet operators may also get credits.\nBaidu's AI Cloud And Robotaxis Become Growth Engines As Ad Business Slows\nBaidu's Q2 results show AI Cloud growth cushioning a decline in ad revenue, while CEO Robin Li accelerates global robotaxi expansion.\nRivian Set To Break Ground On $5 Billion Georgia Factory After Delays: Report\nRivian will break ground on a $5 billion production facility in Georgia, with a $1.5 billion incentive package despite earlier delays.\nCathie Wood's ARK Invest Says Tesla Robotaxi Could Represent 90% Of TSLA's Value — Global Autonomous Taxi TAM Could Reach $10 Trillion By 2030\nCathie Wood's ARK Invest released a paper on Tesla's Robotaxi growth and production advantages, predicting a $10T global autonomous cab TAM.\nHere's Why You Will Still See SUVs From This Dead Tesla Rival On NYC Streets\nAmerican Lease, the largest fleet operator in NYC, bought 2,800 Fisker Ocean SUVs for $16k/unit for the Green Rides Initiative.\nTesla Begins Testing FSD In This Asian Country While Facing Lawsuits Back Home\nTesla is testing its FSD system in Asia, amid lawsuits and criticism over Robotaxis and ride-hailing expansion.\nElon Musk's Tesla Loses Bid To Dismiss Class Action Lawsuit Over Misleading FSD Claims\nTesla loses bid to dismiss class action lawsuit over misleading claims about FSD. Judge says lawsuit is justified.\nTesla Records 14K New Insured Registrations In China From August 11 To 17 — 60% Surge Over Last Quarter\nTesla's China sales surge 4.5% amid global decline, with 60% growth in Q2. Model Y L and Model 3+ released.\nTesla Insiders Have Unloaded More Than 50% Equity In Elon Musk's EV Giant Over The Last Year: Report\nTesla insiders sold over 50% equity, including board members like CFO Vaibhav Taneja and Musk's brother Kimbal Musk.\nAlphabet's Waymo Tests New Robotaxi With 6th-Gen Autonomous Hardware As Self-Driving Race Heats Up\nWaymo begins testing new Robotaxi with 6th generation AV hardware, including cameras, radars, LiDAR sensors, heaters, wipers, and sprayers.\nTesla's 208 Megapacks Power xAI's Colossus 1 Supercomputer—Musk's AI Giant To Invest Over $40 Billion To Train Grok\nxAI invests $40B in Memphis site, plans solar farm & sustainable cooling tower also on the cards amid Elon Musk's criticism of Apple.\nElon Musk's Tesla Launches 6-Seater Model Y L In China At $47K Amid Global Sales Slump\nTesla launches new Model Y with 6 seats and 467 miles of range in China amid poor sales. Offers FSD for extra cost.\nBlink Charging Stock Sinks After Mixed Q2 Earnings Report\nHere's a look at the Q2 earnings report from Blink Charging.\nWarren Buffett, Cathie Wood Share 2 Stock Investments In Common: Can You Guess What They Are?\nCathie Wood looks for growth and companies on their way to big profits. Warren Buffett prefers looking for value and consistent profits. The two investors have two stock investments in common.\nCarvana's Breakout Fuels Interest In Consumer & E-Commerce ETFs\nCarvana broke out of its trading range recently, rising almost 18% in late July to its highest levels since 2021, following Q2 earnings.\nCreate a Watchlist\nFREE: Follow your stocks and cryptocurrencies with the most actionable alerts on the internet.\nClick to Get Started"
    },
    {
      "url": "https://www.benzinga.com/markets/tech/25/08/47180555/ubers-human-drivers-ghosted-in-atlanta-as-riders-hunt-for-waymo-robotaxis-report",
      "text": "Users on Uber Technologies Inc.'s UBER ride-hailing platform are reportedly ditching rides with human drivers in favor of Alphabet Inc.'s GOOGL GOOG Waymo autonomous taxis.\nA Game Of Trial And Error\nUsers on Uber's ride-sharing platform have to engage in trial and error, ditching rides with human drivers offered on the app until they are paired with one of Waymo's Robotaxis, Business Insider reported on Sunday.\n\"The fact that it’s so challenging to get has turned it into a game,\" Nate Galesic, an Uber user cited in the report, said, adding that he had turned down over 20 rides with human drivers before finally getting a Waymo.\nAnother user cited in the report, Andrew Narney, said he had taken over five Robotaxi trips through Uber, adding that all of his rides cost under $12, were no more than four miles and did not have freeway driving.\nUber Looking To Expand Atlanta Robotaxi Fleet\nUber currently operates dozens of autonomous vehicles in Atlanta via the Uber app through its Waymo partnership and plans on expanding its fleet in the future, the report said, citing a spokesperson for Uber.\nThe spokesperson in the report also mentioned that the riders have a greater chance of finding a Robotaxi should they avoid freeway driving and high-demand times like weekends or nights.\nUber's $21,500 Benefits, Lucid Robotaxi Deal\nThe news comes as Uber has unveiled a program targeted at EV driver partners in Colorado, which could offer incentives up to $21,500 for driving on Uber's platform with an EV.\nUber also signed a deal with Lucid Group Inc. LCID to deploy over 20,000 Lucid Robotaxis in the U.S. over the next six years, with services kicking off in a major U.S. city next year.\nAutonomy Worth Billions, Tesla Robotaxi Criticism\nMeanwhile, analysts at Morgan Stanley predict that the autonomous driving market in the U.S. could be worth over $200 billion by the year 2030, with smart driving generating over $400 billion in revenue by 2035.\nElsewhere, Elon Musk's Tesla Inc. TSLA, another key player in the autonomous taxi industry, has been on the receiving end of criticism from former Waymo CEO John Krafcik, who says the company's ride-hailing service isn't a Robotaxi due to the presence of a safety driver onboard the vehicle at all times.\nUber offers Satisfactory Value, but scores well on the Momentum and Growth metrics. For more such insights, sign up for Benzinga Edge Stock Rankings today!\nCheck out more of Benzinga's Future Of Mobility coverage by following this link.\nRead Next:\nImage Via shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/markets/tech/25/08/47277184/tesla-announces-surprise-price-hike-of-quickest-cybertruck-trim-amid-7500-ev-credit-deadline-declining-sales",
      "text": "Tesla Inc. TSLA has raised the price of the quickest Cybertruck variant as the September 30 deadline for the federal EV credit looms.\nThe ‘Cyberbeast' Trim Costs $15,000 More Now\nTesla raised the price of the range-topping Cyberbeast trim from the original $99,990 to $114,990, the company's official website showed on Thursday.\nTesla says that the new pricing is a result of the company offering the Cybertruck with the \"Luxe package,\" which offers Supervised FSD and free access to Tesla's Supercharger Network.\nOther incentives include a four-year premium service option as well as connectivity features. Pricing for the other variants in the line remains unchanged.\nThe Cyberbeast trim offers a 0-60 mph time of 2.6 seconds and an EPA range of 320 miles on a single charge with a tri-motor all-wheel drive system and premium interiors.\nSource: Tesla\nCybertruck's 5-Star NHTSA Rating, Piling Inventories\nThe news comes as the Cybertruck received a 5-star crash test rating for both the driver as well as the passenger by the NHTSA. The pickup truck earlier received a 5-star rating only for the driver, while securing a 4-star rating for the passenger.\nDespite the Cybertruck's safety rating and its build quality, however, Tesla hasn't been able to sell units. The EV giant is said to be sitting on an inventory worth $200 million and is also accepting trade-ins for the vehicle, less than 2 years after its release.\nTesla's Broader Sales Woes, FSD Lawsuits\nThe price rise also comes as Tesla's broader sales have been lackluster, with the company recording double-digit drops in markets like the UK as well as other parts of Europe like Sweden, Denmark and France.\nAdding to the challenge are lawsuits that Elon Musk's company is currently facing over its FSD system, with a California judge certifying a class action lawsuit against Tesla for \"misleading\" claims about FSD's capabilities.\nTesla scores well on Momentum and Growth metrics, while offering satisfactory Quality, but poor Value. For more such insights, sign up for Benzinga Edge Stock Rankings today!\nCheck out more of Benzinga's Future Of Mobility coverage by following this link.\nRead Next:\nPhoto courtesy: wedmoments.stock / Shutterstock.com\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "http://www.benzinga.com/markets/tech/25/08/47278524/nvidia-uber-back-tesla-robotaxi-rival-nuro-to-6-billion-valuation-following-203-million-series-e-funding-round",
      "text": "Nvidia Corp NVDA and Uber Technologies Inc. UBER are among the companies backing Tesla Inc.'s TSLA Robotaxi rival Nuro Inc. in its latest funding round.\nNuro Raises $203 Million In Latest Funding Round\nThe company announced on Thursday that it secured $203 million in series E funding, taking the valuation of the self-driving startup to over $6 billion. The company said that an additional $97 million in funding follows the initial 106 million the company raised in April this year.\n\"The closing of our Series E reinforces the strong conviction our investors and strategic partners have in Nuro's technology,\" Nuro's co-founder and President Dave Ferguson said in the statement. The CEO also teased new partnerships coming in the future.\nNuro's Robotaxi Push With Lucid And Uber, Nvidia Halts H20 Chip\nThe news comes as Nuro has become a key figure in the $300 million partnership with Lucid Group Inc. LCID and Uber to develop and deploy over 20,000 autonomous cabs over the next six years.\nNvidia, on the other hand, told suppliers to stop working on the company's China-focused H20 chipset as Beijing pushes Chinese companies to look for domestic alternatives amid security concerns.\nTesla's Self-Driving Scrutiny\nMeanwhile, Tesla's Robotaxi efforts could face another hurdle in the form of lawsuits over the company's FSD or Full Self-Driving technology, which also faces a lawsuit by investors over safety concerns.\nThe NHTSA also announced it was launching a probe into the EV giant over delays in submitting autonomous driving crash data, which Tesla said occurred due to data collection challenges.\nCheck out more of Benzinga’s Future Of Mobility coverage by following this link.\nRead Next:\nImage Via Nuro\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/markets/tech/25/08/46886208/elon-musk-says-its-never-actually-investors-as-tesla-faces-new-lawsuit-after-243-million-verdict",
      "text": "Tesla Inc. TSLA is facing a proposed class action lawsuit filed by investors over the company's Robotaxi claims.\nTesla Robotaxis Are Dangerous, Plaintiffs Allege\nA new lawsuit accuses Tesla and CEO Elon Musk of securities fraud, alleging the company concealed significant risks associated with its Robotaxi program, Reuters reported Tuesday.\nPlaintiffs say that Tesla's Austin Robotaxi launch in June showcased that the vehicle had instances of speeding, driving over a curb, driving in the wrong lane, as well as dropping off passengers in the middle of the road, the report suggests.\nElon Musk Reacts To The News\nMusk reacted to the news, sharing his thoughts on the lawsuit in a reply to a post on social media platform X, which he owns, on Tuesday. \"It's never actually investors,\" Musk said in the post.\nMusk then slammed the \"class action lawyers,\" alleging that they were \"grifting for their percentage of the verdict,\" before delivering some harsh words for the lawyers.\nTesla's $243 Million Payment, Tougher Oversight\nThe news comes as Tesla was recently ordered by the court to pay $243 million in damages after failing to dismiss a lawsuit over 2019's fatal crash in Florida that resulted in the death of a woman when a Tesla on Autopilot crashed into a parked SUV.\nThe payment raises questions over the company's FSD or Full Self-Driving system, which could face increased scrutiny after President Donald Trump's nominee for the NHTSA administrator, Jonathan Morrison, called for tougher oversight on autonomous vehicles.\nMusk's Ambitious Robotaxi Plan\nAmid this, Musk had targeted an ambitious goal of serving over half the population of the U.S. with Tesla Robotaxis by the end of the year. Tesla recently also expanded its ride-hailing service in the San Francisco Bay Area.\nHowever, the plans have faced criticism from experts, including Gerber Kawasaki's co-founder Ross Gerber, who slammed the EV giant for calling its ride-hailing service the \"Robotaxi.\"\n\"Tesla should consider calling things by the right names. Not wild exaggerations,\" Gerber said. He also added that the term \"Supervised Full Self-Driving\" was \"an oxymoron.\"\nTesla scores well on Momentum, Quality and Growth metrics, but offers poor Value. For more such insights, sign up for Benzinga Edge Stock Rankings today!\nCheck out more of Benzinga's Future Of Mobility coverage by following this link.\nRead Next:\nPhoto courtesy: Frederic Legrand – COMEO On Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/premium/ideas/benzinga-edge-2#:~:text=Turn%20Market%20Chaos,when%20markets%20rebound",
      "text": "While Wall Street panics, Edge members stay one step ahead of the chaos. With real-time portfolio alerts, actionable stock ideas, and pro-grade tools…you get the complete investor’s arsenal — ready to help you profit in any market, starting now.\n“After months of feeling like a deer in headlights, Edge finally gave me the conviction to make a move—and it was the right one.”\n“I was juggling so many newsletters and software subscriptions I lost count… now I just use this! Way more effective. And way easier to manage.”\n“I check Edge before I check the news. Before emails. It’s that important. Especially in this market.”\nForget endless market noise. We’ll give you what actually matters -clear signals, actionable opportunities, and the tools you need to invest with confidence.\nGo beyond information overload, and get powerful trade ideas delivered straight to your inbox. We’re talking 5 hidden gems weekly, pre-market setups daily, and instant rankings on any ticker. Plus, two ‘done for you’ portfolios crushing the market so far in 2025.\nEdge gives you the same powerful research tools the pros use — track what politicians are trading, detect insider moves, and spot breakout signals before they hit the news. No $10K Bloomberg terminal required.\nEvery morning we zero in on ONE stock flashing clear technical signals...\nthen hand you a confusion free chart setup with high profit potential.\nGain unfiltered access to what politicians are buying and selling. Our Government Trade Tracker allows you to invest alongside the Washington elite. Because why should Nancy and co. have all the fun? (and make all the money.)\nNever be caught off-guard by market-moving moments. Access 10+ critical event calendars to track earnings, FDA decisions, product launches, and other pivotal events that can dramatically impact stock prices.\nUncover near endless opportunities with this advanced Stock Screener. It includes 100+ customizable filters. Target precise metrics from fundamentals to technical indicators. Save hours of research while discovering what other traders miss.\nEliminate guesswork with our powerful Smart Calculators. They make it easy to map your potential profit zones for margins, options, and forex. Save hours of manual work while maximizing returns and reducing costly errors.\nMonitor elite market moves with our real-time Insider Trading Tracker. Spot exactly when executives buy or sell their own company stock. Follow the smart money when insiders put their personal wealth on the line.\nSpot big-money options bets that often signal coming price moves. See what the pros are targeting before major market swings happen. The Unusual Options Activity tool shows you exactly when someone makes a huge options bet.\nWall Street Ratings: Tap directly into the minds of Wall Street's top 1000 analysts. See which stocks are gaining favor, losing appeal, or catching fresh attention—all with proven accuracy metrics that separate signal from noise.\nDiscover what’s really moving markets… get actionable intelligence on hidden drivers, and upcoming profit triggers most investors are missing.\nSpot tomorrow’s market leaders, today…uncover the stocks that will shape the future – before they hit mainstream news.\nTrack where billionaires and Wall Street insiders are putting their personal fortunes…then see how to profit alongside them.\nMost just give you more content – Edge gives you a complete investing advantage in three powerful ways:\n1) Exclusive Research – We uncover the real stories driving markets before they become common knowledge, so you’re always a step ahead of the crowd.\n2) Expert Vetted Stock Picks – Instead of vague recommendations, you get specific trades with proven track records from analysts who put their reputation on the line.\n3) Professional-Grade Tools – Access the same institutional-level trading technology to spot opportunities and analyze market moves.\nNot at all. Whether you’re just starting out or investing for decades for, Edge translates Wall Street complexity into clear opportunities. Every insight comes with straightforward action steps, so you always know exactly what to do next. Advanced traders particularly value our institutional-grade tools and deep market intelligence.\nThink of Edge as your personal market filter. Instead of drowning in data, you get only what drives profits: key market moves, actionable trade ideas, and critical alerts for your watchlist. Every feature is designed to cut through the noise, delivering exactly what you need to know – nothing more, nothing less. Plus, your welcome email shows you exactly how to use each tool for maximum profit potential.\nFor annual memberships at regular price, we offer a 7-day money-back guarantee. However, the special 43% New Member Discount is non-refundable due to its significant savings. That’s why most new members choose the New Member Discount – it’s simply too valuable to pass up. You get instant access to everything Edge offers at our lowest possible rate."
    },
    {
      "url": "https://www.benzinga.com/markets/tech/25/08/47085436/elon-musks-tesla-offering-up-to-33-hour-for-nyc-robotaxi-test-drivers",
      "text": "Tesla Inc. TSLA will pay NYC test operators of its Robotaxi up to $30 an hour amid CEO Elon Musk's ambitious robotaxi plans.\nTesla Is Looking For A ‘Prototype Vehicle Operator'\nThe company, on Tuesday, posted a job listing on its official website titled \"Vehicle Operator, Autopilot\" in New York City. The job requires candidates to drive a vehicle on NYC streets for \"5 to 8 hours, daily.\"\n\"As a Prototype Vehicle Operator, you will be responsible for driving an engineering vehicle for extended periods, conducting dynamic audio and camera data collection,\" the job listing said.\nTesla Will Offer Up To $33 an hour\nThe company says that the pay range for the job ranges from $25.25 – $27.60/hour and $28.75 – $30.60/hour. Tesla also says that night and afternoon shifts pay an additional 10%, taking the total pay to approximately $33/hour.\nSource: Tesla\nAs per ZipRecruiter, the average hourly rate in NYC is around $23, so Tesla is offering an above-average hourly rate.\nTesla Expands Ride-Hailing Service, Robotaxi Faces Lawsuit\nThe news comes as Tesla has expanded its ride-hailing service to the San Francisco Bay Area. However, the company offers the service with a safety driver on board, as Tesla does not have a permit to operate Robotaxis in the state.\nMeanwhile, the Tesla Robotaxi is facing a possible class-action lawsuit from investors who allege that the Robotaxi is dangerous following instances of speeding and driving in the wrong lane, among other incidents during June's launch event in Austin.\nElon Musk's $56 Billion Pay Package Hearing In October\nElsewhere, Musk's $56 billion pay package, which was struck down by a Delaware court in 2024, is scheduled to be heard in court in October as a five-judge panel will hear oral arguments over the case.\nTesla scores well on Momentum, Quality and Growth metrics, but offers poor Value. For more such insights, sign up for Benzinga Edge Stock Rankings today!\nCheck out more of Benzinga's Future Of Mobility coverage by following this link.\nRead Next:\nPhoto courtesy: Ken Wolter / Shutterstock.com\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/markets/tech/25/07/46496272/uber-partners-with-lucid-nuro-for-300m-push-into-self-driving-future",
      "text": "- Uber Technologies announced a partnership with Lucid and Nuro to add 20K+ AVs.\n- The company could invest hundreds of millions of dollars in the venture.\n- The market is reacting to Powell’s speech. Learn how to time your next move. Details here →\nUber Technologies Inc UBER Thursday announced a multi-year strategic partnership with Lucid Group Inc LCID and self-driving software maker Nuro to add more than 20,000 autonomous vehicles (AVs) to the Uber platform over the next six years.\n- BofA Securities analyst Justin Post maintained a Buy rating and price target of $115.\n- JPMorgan analyst Doug Anmuth reiterated an Overweight rating on the stock.\nCheck out other analyst stock ratings.\nBofA Securities: The launch of the partnership is expected \"later next year in a major US city,\" before it expands to \"dozens\" of markets around the world, Post said in a note. Lucid is an EV equipment manufacturer and Nuro will develop the self-driving software, he added.\n\"As a part of the deal, Uber will also make multi-hundred-million-dollar investments in Lucid and Nuro,\" the analyst wrote. Driven by AI, the AV ecosystem could grow over the next few years, which would benefit Uber as the demand aggregator, he further stated.\nJPMorgan: The partnership announcement indicates that Uber is aiming to build out \"the AV use case,\" Anmuth said. The company will invest $300 million in Lucid and \"hundreds of millions of dollars in Nuro,\" he added.\nThe announcement follows the partnership between Uber and Baidu BIDU announced earlier this week. The companies plan to deploy thousands of Apollo Go robotaxis on Uber's network in several non-US markets.\nThere could be several players across the market in the longer term, the analyst wrote.\nUBER Price Action: Shares of Uber Technologies had declined by 0.39% to $90.19 at the time of publication on Friday.\nRead More:\nImage: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/markets/tech/25/08/47114834/uber-drivers-in-colorado-could-get-benefits-up-to-21500-switching-to-electric-heres-how",
      "text": "Editor's Note: This article has been updated to clarify details of Uber's EV incentive program.\nUber Technologies Inc. UBER is rolling out a new EV incentive program by partnering with the Colorado Department of Public Health & Environment (CDPHE), offering drivers up to $2,000 directly. When combined with Colorado state and federal EV incentives, total potential savings can reach $21,500.\n$100 For Every 100 EV Trips, $6000 Colorado State Incentives\nThe company announced a host of incentives for drivers in a press release published on Wednesday. Drivers can earn $100 for every 100 trips completed in an electric vehicle, up to a maximum of $2,000 through Uber's incentive program, the company said.\nThe statement also said that drivers can qualify for up to $6,000 in Colorado state credits on the purchase of a new EV, as well as $6,000 for trading in an old vehicle. These state incentives can be stacked with the $7,500 federal EV credit. Combined with Uber's $2,000 incentive, total potential savings can reach $21,500.\nTest Drives, Additional $210 For 200 EV Trips\nUber also announced that drivers can get free test drives of any EV model at an event it will be hosting on Aug. 27. Additionally, drivers can earn an extra $210 for every 200 EV trips completed during 30 days.\nUber's Autonomous Taxi Plans, ‘Super App' Plans\nThe news comes as Uber has said that it plans to sell a stake in the company to fund its Robotaxi operations and unveiled different Robotaxi business models, under which the ride-hailing giant will operate autonomous cabs. The company also plans to create a \"Super App\" which will offer a host of Uber's various services under one umbrella.\n\"Fewer than one in five of our consumers are active across both mobility and delivery, and we believe this can and will go much higher over time,\" Khosrowshahi said, adding that the company is \"building towards\" a super app.\nUber's Robotaxi Deal With Lucid, Company Welcomes Tesla's Robotaxi Efforts\nUber also recently signed a deal with Lucid Group Inc. LCID to deploy over 20,000 Lucid Robotaxis on its platform over the next six years, with plans to kick off operations in a major U.S. city next year.\nThe company also welcomed Tesla Inc.'s TSLA Robotaxi efforts. Khosrowshahi said that Elon Musk's EV giant could be a competitor, but added that \"there will be no winner-take-all in this marketplace,\" which is said to be worth $1 trillion in TAMs.\nUber offers Satisfactory Value, but scores well on the Momentum and Growth metrics. For more such insights, sign up for Benzinga Edge Stock Rankings today!\nCheck out more of Benzinga’s Future Of Mobility coverage by following this link.\nRead Next:\nPhoto courtesy: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/markets/tech/25/08/47275062/nhtsa-launches-probe-into-elon-musk-led-tesla-following-crash-test-report-delays-involving-fsd-autopilot",
      "text": "The National Highway Traffic Safety Administration, or NHTSA, says it's investigating delays in submitting reports of self-driving crashes by Tesla Inc. TSLA.\nNHTSA Says Several Reports Arrived Months After Crash\nThe Office of Defects Investigation, or ODI, says that it received the reports from Tesla several months after the crash, the agency said in a statement released on Wednesday.\nThe agency said under the Standing General Order 2021-01, an order issued by the agency over driver assistance system-related crashes, companies are required to submit reports \"within one or five days\" of the crash.\nDelays Occurred Due To Data Collection Issues, Says Tesla\nThe EV giant says delays in submitting reports occurred due to issues with data collection, which have been fixed. The agency says Tesla submitted the reports in two ways.\n\"Many of the reports were submitted as part of a single batch, while others were submitted on a rolling basis,\" the NHTSA said in its statement.\nSource: NHTSA\nTesla's Robotaxi Probe, FSD Lawsuits\nThe news comes as the NHTSA also earlier announced it was investigating possible traffic violations committed by the company's Robotaxi during the Austin launch event in June.\nTesla also faces multiple lawsuits over its FSD or Full Self-Driving system. A judge in California recently certified a class action lawsuit against Elon Musk's automaker for \"misleading\" customers about the capabilities of the FSD system.\nTesla Investors Express Concerns About Musk's Pay Package, Germany Gigafactory Fire Incident\nMeanwhile, Tesla investors have expressed \"serious concerns\" about Musk's $29 billion pay package, which awards the CEO 96 million shares in the company and are demanding a NASDAQ probe into the award.\nTesla also reportedly evacuated its Gigafactory in Germany after a fire incident involving battery cells. Local authorities confirmed that the incident did not result in any injuries or fatalities.\nTesla scores well on Momentum and Growth metrics, while offering satisfactory Quality, but poor Value. For more such insights, sign up for Benzinga Edge Stock Rankings today!\nCheck out more of Benzinga's Future Of Mobility coverage by following this link.\nRead Next:\nPhoto courtesy: VTT Studio / Shutterstock.com\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    }
  ],
  "argos_summary": "Uber CEO Dara Khosrowshahi said that autonomous vehicles will need superhuman safety levels and that a camera‑only system is very difficult in the near term, favoring a LiDAR‑plus‑camera approach that Uber’s partners use. Elon Musk countered on X, arguing that cameras are safer and that Tesla has turned off radars to improve safety. Uber is expanding its robotaxi fleet through deals with Lucid and Nuro, offering incentives to drivers and seeing users switch from human drivers to Waymo‑powered cabs in Atlanta. Meanwhile, Tesla faces lawsuits over its Full Self‑Driving claims, NHTSA probes into crash‑report delays, and criticism that its robotaxi service still requires a safety driver, while Musk pushes an ambitious robotaxi rollout in the U.S. market.",
  "argos_id": "JVK1V3N91"
}