{
  "url": "https://www.benzinga.com/markets/market-summary/25/08/47300708/dow-futures-drop-nearly-60-points-as-nvidia-earnings-loom-nikkei-opens-higher-dollar-inches-up",
  "authorsByline": "Vishaal Sanjay",
  "articleId": "b435e9c86b414a3baed2f574d1521ede",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "https://cdn.benzinga.com/files/images/story/2025/08/24/Stock-Market-Graph-On-Screen--Ticker-On-.jpeg?width=1200&height=800&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T22:50:26-04:00",
  "addDate": "2025-08-25T02:58:04.051075+00:00",
  "refreshDate": "2025-08-25T02:58:04.051077+00:00",
  "score": 1.0,
  "title": "Dow Futures Drop Nearly 60 Points As Nvidia Earnings Loom: Nikkei Opens Higher, Dollar Inches Up - NVIDIA (NASDAQ:NVDA), Heico (NYSE:HEI)",
  "description": "US stock futures are down marginally on Sunday evening following Fed Chair Jerome Powell's dovish comments on Friday, during the Federal Reserve's annual Jackson Hole symposium, where he hinted at a potential rate cut in September.",
  "content": "U.S. stock futures are down marginally on Sunday evening following Fed Chair Jerome Powell’s dovish comments on Friday, during the Federal Reserve’s annual Jackson Hole symposium, where he hinted at a potential rate cut in September.\n\nInvestors are also anticipating Nvidia Corp.’s NVDA second-quarter earnings on Wednesday, closely watching for more cues on the direction and momentum of the fast-growing AI space.\n\nSee Also: Why Jackson Hole Is The Fed’s Mountaintop Moment—And Why It Matters More Than Ever\n\nThe company’s shares slipped on Friday, following reports that it had halted work on its H20 artificial intelligence chip for China, after Deepseek announced a new model that was optimized for local processors.\n\nAll three major indices are currently in the red, with Nasdaq Futures down 0.13%, or 31 points, trading at 23,539.50, while the S&P 500 Futures are down 0.13% and 8.50 points, at 6,474.50, followed by the Dow Jones Futures at 45,664.00, down 0.11% or 51 points.\n\nJapan’s benchmark Nikkei 225 is up 0.69% or 293.94 points, trading at 42,927.23 at the time of writing, with online retailers, luxury goods, and mining companies leading the charge.\n\nMeanwhile, the U.S. Dollar Index (DXY) rose 0.25% on Monday, trading at 97.951, after weakening on Friday, following Powell’s speech.\n\nTraders and investors on Monday will be closely watching the New Home Sales report, alongside the speeches of Dallas Fed President Lorie Logan and New York Fed President John Williams. Apart from this, the earnings reports of PDD Holdings Inc. PDD and Heico Corp. HEI could set the tone for this week.\n• Trump Mocks Biden’s Fed Board After Powell’s Jackson Hole Speech, Labels Chair ‘Too Late,’ Puts Red X On Cook As President Teases Top Successor",
  "medium": "Article",
  "links": [
    "https://www.benzinga.com/news/politics/25/08/47297134/trump-mocks-bidens-fed-board-after-powells-jackson-hole-speech-labels-chair-too-late-puts-red-x-on-cook-as-president-teases-top-successor",
    "https://www.benzinga.com/markets/tech/25/08/47278905/nvidias-china-trouble-could-slash-billions-from-revenue-analysts-warn",
    "https://www.benzinga.com/markets/macro-economic-events/25/08/47287571/federal-reserve-jackson-hole-summit-jerome-powell-interest-rates-2025"
  ],
  "labels": [
    {
      "name": "Roundup"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "New York Fed",
      "weight": 0.08318499
    },
    {
      "name": "New York Fed President John Williams",
      "weight": 0.08189742
    },
    {
      "name": "Jackson Hole",
      "weight": 0.08181587
    },
    {
      "name": "Dallas Fed President Lorie Logan",
      "weight": 0.0810567
    },
    {
      "name": "Heico Corp. HEI",
      "weight": 0.07800387
    },
    {
      "name": "Dallas Fed",
      "weight": 0.076618284
    },
    {
      "name": "Fed",
      "weight": 0.071629405
    },
    {
      "name": "Heico Corp.",
      "weight": 0.071347415
    },
    {
      "name": "Nvidia Earnings",
      "weight": 0.071256675
    },
    {
      "name": "Jerome Powell",
      "weight": 0.06564479
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "AI"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9951171875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.98291015625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.6630859375
    }
  ],
  "sentiment": {
    "positive": 0.040251993,
    "negative": 0.8460425,
    "neutral": 0.11370548
  },
  "summary": "U.S. stock futures have dropped slightly following Fed Chair Jerome Powell's dovish comments at the annual Jackson Hole symposium, where he hinted at a potential rate cut in September. Investors are also anticipating Nvidia Corp.’s second-quarter earnings, which could provide crucial insights on the direction and momentum of the rapidly growing AI space. All three major indices are currently in the red, with Nasdaq Futures down 0.13%, or 31 points, trading at 23,539.50, the S&P 500 Futures and Dow Jones Futures at 45,664.00. Meanwhile, Japan's benchmark Nikkei 225 is up 0.69% or 293.94 points, with online retailers, luxury goods, and mining companies leading the rally.",
  "shortSummary": "US stock futures drop slightly as investors await Nvidia’s second-quarter earnings and a potential rate cut, while Japan's Nikkei 225 rises amid rising investor interest.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "69ad74bb70dd438aa7f6d2842b1a6e74",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.benzinga.com/markets/macro-economic-events/25/08/47287571/federal-reserve-jackson-hole-summit-jerome-powell-interest-rates-2025",
      "text": "- The annual Jackson Hole summit is the Fed’s most influential forum for signaling global monetary shifts.\n- This year, Powell’s speech could sway rate-cut expectations and test Fed independence under political pressure.\n- See the seasonal trading strategy that's beating the S&P 500 by 6X this year. Details here →\nImagine being Jerome Powell this week. On Friday, August 22, the Federal Reserve chairman will step onto the stage at the Jackson Hole Economic Policy Symposium — the most closely watched monetary retreat in the world — with markets, politicians, and even building contractors staring him down.\nPresident Donald Trump is pressing him for interest-rate cuts. Congress is questioning Fed independence. Meanwhile, he's weathering criticism about a costly renovation of the central bank's D.C. headquarters. And hanging over it all: Trump and his allies are hyping a successor who pledges to keep cutting rates in 2026.\nNo pressure.\nBut while Powell juggles politics, markets, and Fed renovations, Jackson Hole itself offers a lens into why this remote Wyoming summit has become the epicenter of monetary policy debates — and why every word matters. From its origins and scenic setting to the historic moments that shaped global markets, here's a closer look at the questions investors and economists keep asking.\nSee Also: Trump Gets FAQ’d By Powell—No Champagne Rooms, Just Clearing Cancer Dust\nWhy Wyoming And Not Kansas?\nThe summit began in 1978 as a Kansas City Fed conference on agriculture. In 1982, organizers moved it to Wyoming to entice Fed Chair Paul Volcker, an avid fly fisherman. Volcker came, and prestige followed. Ever since, Jackson Hole has been the place where central bankers float new ideas, away from D.C. politics and Wall Street chatter.\nAs Antlers Arch puts it: “The remote, scenic setting also provides a relaxed atmosphere conducive to open discussion, away from the bustle of urban financial centers.”\nOver the years, the Kansas City Fed has turned Jackson Hole into a tradition as durable as monetary policy itself.\nWhat Were Some Historic Moments?\nJackson Hole has been a stage for major policy shifts. In 2005, IMF economist Raghuram Rajan warned that banks underestimated the risks of exotic derivatives. He famously stated, “The same way parents are asked, ‘Do you know where your children are?’, bankers nowadays are asked, ‘Do you know where your risks are held?'”\nHis peers dismissed him at the time, but the speech foreshadowed the 2008 crash.\nBen Bernanke, Fed Chair from 2006 to 2014, led the first so-called quantitative easing (QE1) effort in 2008 to stabilize markets after the financial crisis. Quantitative easing—where the central bank buys financial assets to inject money into the economy—was used again in QE2 in 2010 and QE3 in 2012 to sustain the recovery, support lending, prevent a deeper recession and combat deflation.\nAfter Bernanke, Janet Yellen assumed the role in 2014. In 2017, she emphasized that the U.S. financial system had become more resilient since the 2008 crisis, having reduced the system's vulnerability to “shocks” without unduly limiting credit or economic growth.\nPowell, since becoming Fed Chair in 2018, has faced a series of major challenges, from late-cycle market volatility and pre-pandemic rate hikes to the COVID-19 crisis and post-pandemic inflation surges. He noted in 2024 that inflation “eased substantially” from 7% to 2.7%, but was “still too high.” That hasn’t changed under Trump, regardless of the number of firing threats Powell receives. (Legally, a U.S. president cannot fire the Fed chair.)\nWhy Does It Matter So Much?\nBecause Jackson Hole isn't just about theory. It's where central bankers preview the policies that ripple across global markets. A single sentence can send bond yields spiking, stocks tumbling, or currencies swinging. Investors, economists, and politicians hang on every word, reading between the lines for hints of what's next.\nRecall 2022 when Powell discussed the “pain” households and businesses would feel in order to reduce inflation. The S&P 500 fell 12% in the month that followed, according to Reuters. Usually, the month that followed each of Powell’s last seven Jackson Hole speeches, the S&P 500 has fallen nearly 2% on average.\nMeanwhile, the 10-year Treasury yield spiked by an average of 21 bps and the dollar has risen 1.4% over the same period.\nWhat's At Stake This Year?\nThis year, the spotlight on Powell is even brighter. Inflation remains sticky, and markets are eager for clarity on potential rate cuts. At the same time, speculation swirls over Fed independence under a MAGA-aligned administration. Private equity and credit markets are particularly eager for cuts, hoping to reignite dealmaking.\nWhether Powell delivers soothing words or maintains caution, the speech will be highly scrutinized. And though he may be a \"lame duck\" Fed chair, Jackson Hole remains his forum — and he can still ruffle some feathers.\nNow Read:\nImage: Shutterstock\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/markets/tech/25/08/47278905/nvidias-china-trouble-could-slash-billions-from-revenue-analysts-warn",
      "text": "- Nvidia fell after halting H20 chip work in China as DeepSeek launched a domestic chip-ready AI model.\n- Beijing’s local chip push and DeepSeek’s V3.1 upgrade raised concerns over Nvidia’s China outlook.\n- The market is reacting to Powell’s speech. Learn how to time your next move. Details here →\nNvidia Corp. NVDA shares slipped on Friday after reports surfaced that the company has halted work on its H20 artificial intelligence chip for China, just as domestic rival DeepSeek unveiled a new model optimized for local processors.\nThe developments underscore mounting headwinds for Nvidia in a critical market where Beijing is accelerating efforts to reduce reliance on U.S. technology.\nDeepSeek, one of China’s most closely watched AI startups, launched its upgraded V3.1 model on Thursday. The system is designed to run on domestic chips, reflecting Beijing’s push for technological self-sufficiency.\nAlso Read: Nvidia’s AI Expansion Could Push Revenue To $300 Billion By 2026, Analyst Says\nThe update introduces faster processing capabilities, a new FP8 precision format, and a hybrid inference structure capable of toggling between reasoning and non-reasoning tasks. The company also added a “deep thinking” feature to its platforms and plans to implement new API pricing beginning September 6.\nThe move comes after DeepSeek encountered performance hurdles with Huawei’s Ascend processors, forcing the startup to rely on Nvidia hardware for earlier models. Its R1 release in January rattled global markets, erasing roughly $600 billion in Nvidia’s market value amid fears of a serious new competitor.\nAt the same time, Nvidia is facing heightened regulatory pressure in China. The company has reportedly instructed suppliers, including Amkor Technology AMKR and Samsung Electronics SSNLF, to suspend work on its China-focused H20 chip.\nThe pause follows meetings between Chinese regulators and tech giants such as Tencent Holdings TCEHY and ByteDance, in which officials urged companies to pivot away from Nvidia hardware in favor of domestic alternatives from Huawei and Cambricon.\nAnalysts caution that the disruption could weigh on Nvidia’s near-term results. KeyBanc Capital Markets estimates that excluding China sales could cut quarterly revenue by $2 billion to $3 billion. However, strong global demand and the company’s rollout of its next-generation Blackwell B200 chips may help offset some of the pressure. China contributed 13% of Nvidia’s revenue in fiscal 2024, highlighting the strategic importance of the market.\nDespite the latest setback, Nvidia stock has gained more than 30% this year, cementing its dominance in the graphics processing unit segment as Big Tech players including Microsoft MSFT and Meta Platforms META pour billions into AI infrastructure.\nPrice Action: NVDA stock is trading lower by 1.14% to $172.98 premarket at last check Friday.\nRead Next:\nImage via Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/news/politics/25/08/47297134/trump-mocks-bidens-fed-board-after-powells-jackson-hole-speech-labels-chair-too-late-puts-red-x-on-cook-as-president-teases-top-successor",
      "text": "President Donald Trump escalated his Federal Reserve confrontation Friday, threatening to fire Governor Lisa Cook while mocking Chair Jerome Powell as “Too Late” in a Truth Social post that divided Fed board members into opposing camps.\nTrump’s Fed Board Divide Graphic Sparks Market Attention\nTrump shared an image dividing Federal Reserve officials into camps aligned with former President Joe Biden versus those siding with him. Powell, whom Trump originally appointed as Fed Chair in 2018, earned the “Too Late” label referencing his delayed rate cut timing, while Cook received a prominent red “X” marked “The Fraudster.”\nThe graphic positions Trump appointees Christopher Waller, Michelle Bowman and nominee Stephen Miran as administration allies. This comes as markets price in September rate cuts following Powell’s dovish Jackson Hole speech that sparked broad rallies across equities and cryptocurrencies.\nCook Mortgage Controversy Intensifies DOJ Review\nCook faces mortgage fraud allegations from Federal Housing Finance Agency Director William Pulte, who claims she improperly designated properties as primary residences for favorable loan terms in 2021.\n“I’ll fire her if she doesn’t resign,” Trump told reporters Friday. Cook previously stated she has “no intention of being bullied to step down.”\nWaller Emerges as Powell Replacement Frontrunner\nPrediction markets show Waller leading Fed Chair succession odds at 51% on Kalshi, ahead of Kevin Hassett (30%) and Kevin Warsh (24%).\nWaller dissented at July’s Federal Open Market Committee meeting, advocating immediate 25-basis-point cuts while Powell held rates steady. His proactive stance aligns with Trump’s preference for a forward-looking monetary policy.\n“When labor markets turn, they often turn fast,” Waller stated, warning against falling behind the curve with GDP growth at just 1.2% in 2025’s first half.\nMarket Implications for Rate-Sensitive Sectors\nPowell’s Jackson Hole pivot triggered significant moves across asset classes. The Dow Jones jumped 2% to new highs above 45,680, while the S&P 500 climbed 1.4% and the Russell 2000 soared nearly 4%.\nBitcoin BTC/USD gained 3.5%, with Ethereum ETH/USD, Solana SOL/USD and Cardano ADA/USD posting double-digit gains as crypto markets entered “risk-on” mode.\nRate-sensitive sectors, including homebuilders, small caps, and regional banks, rallied sharply on accommodation expectations. Goldman Sachs‘ Jan Hatzius sees Powell’s remarks as “consistent with our expectation of a 25bp cut at the September FOMC meeting.”\nRead Next:\nPhoto Courtesy: eamesBot on Shutterstock.com\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    }
  ],
  "argos_summary": "U.S. stock futures slipped after Fed Chair Jerome Powell signaled a possible September rate cut at Jackson Hole, while investors await Nvidia’s Q2 earnings amid a slowdown in its China chip program following DeepSeek’s domestic‑chip‑optimized AI model launch. Nvidia shares fell after halting H20 chip work in China, a move that could shave $2‑$3 billion from quarterly revenue, though global demand and new Blackwell chips may offset the hit. Meanwhile, Trump’s public criticism of Powell and the Fed board has intensified political pressure on the central bank, with market expectations shifting toward a September rate cut and a potential leadership change at the Fed.”}",
  "argos_id": "KATUC00A8"
}