{
  "url": "https://www.dailymail.co.uk/sport/afl/article-15026963/AFL-Mad-Monday-scandals-Jimmy-Bartel-Jason-Akermanis-drunk-Dustin-Martin-footy-GWS-Giants-Geelong-Cats-Collingwood-Magpies.html",
  "authorsByline": "Josh Alston",
  "articleId": "5ccbec3d933846d880e3685c8a80f453",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/25/04/101481857-0-image-a-23_1756092526411.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-25T04:41:22+01:00",
  "addDate": "2025-08-25T03:45:51.113573+00:00",
  "refreshDate": "2025-08-25T03:45:51.113576+00:00",
  "score": 1.0,
  "title": "Revealed: The most scandalous - and funniest - Mad Mondays in the AFL",
  "description": "Here's why the mere mention of the words 'Mad Monday' sends shivers down the spines of officials at AFL clubs.",
  "content": "After years of scandals, the mere mention of the words 'Mad Monday' is enough to send shivers down the spine of the media teams at any AFL club.\n\nWhile some celebrations go off without a hitch and see footy stars enjoy a few drinks and a bit of fancy dress, the end-of-season parties have a dark side that has spawned stacks of controversies over the years – and even umpires aren't immune to the fallout.\n\nHere are some of the wildest, most controversial, and hilarious moments to come out of AFL Mad Monday celebrations in the modern era.\n\nStar gets dumped by his girlfriend in spectacular fashion\n\nBeing the partner of a footy player can be tough, as former Footscray ruckman Simon Atkins (pictured above) knows all too well. After the Bulldogs lost the 1992 qualifying final, there were no costumes or flair about their Mad Monday celebrations – just two days straight of solid contemplation and drinking.\n\nThat was too much for his girlfriend Shannon, who had all of his belongings and an eviction notice delivered to Melbourne's Albert Hotel, where the players were drowning their sorrows.\n\n'I think that will work itself out, though,' he laughed when asked about the delivery by media.\n\n'It's a bit of a joke, I think. I hope.'\n\nJason Akermanis gets barred from the Brownlow Medal\n\nAkermanis revealed that after a particularly heavy Mad Monday, he was in no condition to front up at the 2009 Brownlow Medal count, and his wife Megan sensibly told him to stay home.\n\nWhen critics accused Megan of being a 'princess' for the couple's no-show, Akermanis fired back, saying she had no desire for attention and was only trying to save him from embarrassment.\n\nHe explained that Megan was actually very understanding about the whole situation, insisting that she never seeks the spotlight and simply wanted what was best for him.\n\nWhile Megan was left disappointed about returning her designer gown and letting down the people who had helped her prepare for footy's night of nights, she joked that she would just keep it in the cupboard for the following year.\n\nAkermanis, meanwhile, was pleased to at least get the chance to wear his new 'Oceans 13-inspired' Soho Workshop suit on The Footy Show's Grand Final edition later that week.\n\nBrendan Fevola courts controversy twice during his heady days\n\nBrendan Fevola cemented his reputation for outrageous Mad Monday antics when he chose Melbourne's busiest pedestrian intersection to stage a stunt in a nightie with a sex toy stuffed in his pants in 2008.\n\nThe former Carlton and Brisbane forward shocked and offended passers-by as he strutted near Flinders Street Station, holding a beer and proudly displaying the plastic prop.\n\nThe controversy didn't end there. A year later, the same toy made a return appearance during another Carlton pub crawl.\n\nFevola, clearly intoxicated, was photographed at Naughton's Hotel swinging the sex toy above his head as fellow players partied around him.\n\nPatrons complained about the behaviour of several Blues footballers, adding to the fallout and scrutiny around the club's culture at the time.\n\nJimmy Bartel sparked controversy in 2011 when he turned up to Mad Monday dressed as the infamous 'St Kilda Schoolgirl' Kim Duthie, complete with a jumper featuring her initials.\n\nHe arrived hand-in-hand with teammate Mitch Duncan, who took the joke further by appearing in his underwear to mimic disgraced player manager Ricky Nixon.\n\nThe costumes referenced a scandal that had rocked the AFL, when Duthie leaked nude photos of St Kilda players and Nixon was caught visiting her in a hotel room.\n\nThe skit drew sharp criticism, with Geelong MP Ian Trezise calling it inappropriate and AFL legend Ron Barassi declaring it lacked class and taste.\n\nBartel, however, defended the choice, insisting it was meant as light-hearted fun after a long season and that he hoped people would see it as a harmless joke.\n\nSt Kilda midfielder Clinton Jones was fined $3000 after setting dwarf entertainer Blake Johnston's clothes alight during Mad Monday celebrations in South Melbourne.\n\nThe 2013 incident occurred while Johnston was speaking to another player, with Jones using a gas lighter to ignite his clothing.\n\nJohnston later confirmed he had received apologies from both Jones and the St Kilda Football Club, as well as the AFL.\n\nHe said he accepted the apology and would not be pursuing further action, adding that Jones had offered to donate to a charity of Johnston's choosing, the Kids with Cancer Foundation Australia.\n\nJones publicly expressed regret, admitting his behaviour was 'childish' and describing the act as an error of judgment.\n\nMelbourne Demons Dean Terlich and Alex Georgiou were sanctioned by the club for dressing up as Rolf Harris and a young girl for their 2014 Mad Monday celebrations.\n\nHarris was convicted as a child sex offender that year, leaving then-coach Paul Roos incredulous over their choice of costumes\n\n'I was just speechless [when informed about the outfits]. I just don't understand it,' he said.\n\n'The problem with days like yesterday is they just don't think. There is no malice, there's no intent, there's just no thought process goes into it and I think that is the worst part about it.\n\n'Some people take the view boys will be boys, I don't take that view, it's just unacceptable.'\n\nIn 2015, Richmond star Dustin Martin became embroiled in controversy after allegations surfaced from the Tigers' Mad Monday celebrations.\n\nReports claimed Martin had been involved in an incident in which he was filmed groping a topless woman during the post-season party.\n\nThe story quickly gained traction in the media, sparking outrage and prompting questions about the culture surrounding end-of-season festivities.\n\nAt the time, the AFL was under pressure to address off-field behaviour, and the claims against Martin intensified the scrutiny.\n\nRichmond confirmed they were aware of the allegations but no charges were laid, and the matter did not progress legally.\n\nMartin was also cleared of any wrongdoing by the AFL.\n\nIn 2022, Western Bulldogs premiership defender Zaine Cordy made headlines for an incident that quickly went viral.\n\nOutside a Melbourne pub, Cordy was spotted in a wobbly state before being 'carried' and put in a taxi by mates to make sure he got home safely.\n\nVideo footage captured him staggering and needing support, with onlookers laughing as the Bulldogs big man was bundled into the back seat.\n\nSocial media erupted, with fans and commentators dubbing it one of the funnier off-season footy moments rather than a scandal.\n\nThe club was quick to downplay the drama, saying there was no suggestion of illegal behaviour or serious misconduct.\n\nCordy, known as a laid-back character in the Dogs' ranks, took the ribbing in good humour.\n\nJeremy Cameron is about as bush kid as they come. So when Geelong won the premiership in 2022, he decided to take the celebrations back to his rural Victorian property.\n\nAt some point, he thought it would be a good idea to hang his premiership medal around the neck of one of his cows.\n\n'We've done something very silly here,' he posted at around 4am.\n\n'Umm, can I have my medal back…?\n\n'Let him have it for the night. Get out there, enjoy it, it's for all of us,' he slurred as the cow ran free into the night.\n\nGetting it back proved problematic, but Cameron had it sorted.\n\nDespite little sleep, Cameron fronted the Cats' supporters day at Kardinia Park on the following Sunday, medal safely around his neck after an early-morning wrangle.\n\n'I don't know who came up with the idea,' he said on stage.\n\nFresh from demolishing Sydney in the 2022 grand final, the Cats leaned into the constant jibes about being too old to win the premiership by turning the joke on themselves.\n\nStar players hobbled into the pub for Mad Monday with walking frames and mobility scooters, while others wore grey wigs, cardigans and slippers.\n\nTom Hawkins, Patrick Dangerfield and Joel Selwood were among those who embraced the gag, drawing roars of laughter from fans and cameras waiting outside.\n\nThe theme was a cheeky nod to critics who claimed the Cats were too far past it to win another flag, and the stunt turned into a viral hit.\n\nGWS push the boundaries too far\n\nSimply moving Mad Monday to a different day is not a licence to do what you please, as GWS found out in 2024.\n\nThirteen GWS Giants players were sanctioned by the AFL following a controversial post-season 'Wacky Wednesday' party that had a 'Controversial Couples' theme.\n\nYoung midfielder Josh Fahey received the harshest penalty, a four-game suspension, after he dressed as NRL star Jarryd Hayne and performed a skit with a blow-up doll.\n\nJake Riccardi was banned for two games for appearing as a taxi driver alongside Fahey, while Toby McMullin and Cooper Hamilton were also given two-game suspensions after they staged a skit that mocked the September 11 terror attacks.\n\nHarvey Thomas and Joe Fonti were handed the same penalty after they acted out a routine where Thomas dressed as a high-profile athlete, believed to be NBA player Josh Giddey, and Fonti played a young girl.\n\nAFL boss Andrew Dillon condemned the acts, saying he felt 'disbelief and then disappointment', and labelled the behaviour conduct unbecoming after a complaint was lodged.\n\nUmpires get in trouble too\n\nIt is not just the players who have landed in hot water for post-season celebrations gone too far. In 2024, AFL umpire Leigh Haussen was suspended for one round after dressing up as Osama Bin Laden for the officials' Mad Monday party.\n\nThe event was held in a private room in a Melbourne restaurant the day after the grand final, but the AFL learned of his costume and acted swiftly.\n\n'The theme for the gathering was \"characters from the 2000s\",' the AFL said.\n\n'[Haussen] changed into costume at the venue and wore a mask for only a short period of time before removing it.\n\n'He cooperated fully with the investigation after the AFL was made aware of the function and apologised for wearing the costume which was inappropriate, offensive and in poor taste.'\n\nHaussen admitted his choice of costume was 'inappropriate and offensive'.\n\nGeelong have built a reputation as the undisputed kings of Mad Monday costumes, consistently outshining rival clubs with their creativity.\n\nYear after year, Cats players deliver unforgettable looks, from pensioners with walking frames to spot-on pop culture parodies.\n\nTheir commitment to detail and group themes has made Geelong's Mad Monday outfits a fan favourite and a highlight of the post-season.\n\nThe 'Pies are not only the biggest club in the AFL, they also know how to party. Most of their Mad Monday celebrations have come after finals campaigns, and often premierships.\n\nSo over the years they have compiled a list of impressive costume choices at their end-of-season events.\n\nSome Magpies fancy-dress highlights include players dressing up as characters from TV hits like Peaky Blinders and Game of Thrones, and Isaac Quaynor nailing his look as F1 legend Lewis Hamilton.\n\nBut towering ruckman Mason Cox gets the best and fairest here for dressing up as a T-Rex dinosaur.",
  "medium": "Article",
  "links": [
    "https://www.dailymail.co.uk/tvshowbiz/brendan-fevola/index.html",
    "https://www.dailymail.co.uk/sport/dustin-martin/index.html",
    "https://www.dailymail.co.uk/sport/afl/article-11171357/Inside-Richmond-pub-Dustin-Martin-filmed-groping-topless-woman-Mad-Monday-party.html",
    "https://www.dailymail.co.uk/sport/afl/index.html",
    "https://www.dailymail.co.uk/news/melbourne/index.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "AFL Mad Monday celebrations",
      "weight": 0.08338139
    },
    {
      "name": "Mad Monday costumes",
      "weight": 0.0781513
    },
    {
      "name": "Mad Monday celebrations",
      "weight": 0.07809283
    },
    {
      "name": "Mad Monday",
      "weight": 0.075626075
    },
    {
      "name": "outrageous Mad Monday antics",
      "weight": 0.06686441
    },
    {
      "name": "St Kilda players",
      "weight": 0.057496034
    },
    {
      "name": "Cats players",
      "weight": 0.05725231
    },
    {
      "name": "Star players",
      "weight": 0.056882024
    },
    {
      "name": "AFL",
      "weight": 0.052267533
    },
    {
      "name": "players",
      "weight": 0.05186531
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.80126953125
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.603515625
    },
    {
      "name": "/Sports/Team Sports/Rugby",
      "score": 0.42529296875
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.33544921875
    }
  ],
  "sentiment": {
    "positive": 0.0535299,
    "negative": 0.72856736,
    "neutral": 0.21790276
  },
  "summary": "The Australian Football Club (AFL) has been hit by scandals throughout its Mad Monday celebrations, which have led to numerous controversies. These include star players being dumped by their girlfriend, former Footscray ruckman Simon Atkins, and even umpires. Jason Akermanis was banned from the Brownlow Medal after a particularly heavy Mad Monday, and his wife Megan advised him to stay home due to the lack of attention. Jimmy Bartel dressed up as Kim Duthie in 2011 and a teammate Mitch Duncan mimicked her in underwear to mimic disgraced player manager Ricky Nixon. In 2013, St Kilda player Clinton Jones was fined $3000 for setting dwarf Blake Johnston's clothes alight during celebrations in South Melbourne. The incident occurred while player John Johnston was speaking to another player with a lighter gas lighter, which was described as an 'childish' act of judgment.",
  "shortSummary": "The AFL's Mad Mondays have long been notorious for controversial and often controversial celebrations like Jason Akermanis' suspension for missing the Brownlow Medal and Brendan Fevola's sex toy stunt.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "612fa8afeb3c4cc284b0ac2722478025",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/brendan-fevola/index.html",
      "text": "Advertisement\nRELATED TOPICS FOR Brendan Fevola\nBrendan Fevola - Latest news, views, gossip, photos and video\nPage\nFooty legend Brendan Fevola claims the AFL is about to make a sensational last-minute change to the grand final that will make headlines around the world\n25/08/25 03:54\nFooty legend Brendan Fevola made his shocking prediction on Monday, telling his radio co-hosts, 'This will happen, take that to the bank.'...read\nLindy Klim announces shock career move: 'You're about to laugh at my expense!'\n20/08/25 00:13Lindy Klim stunned fans on Tuesday night by announcing a shock career move.Brendan Fevola lists stunning five-bedroom Melbourne home for $4.5million\n15/08/25 00:30Brendan Fevola and his wife Alex have listed their stylish Melbourne home on the market for $4.5m, four years after purchasing it.Mia Fevola puts on a brave face at hotel launch in Melbourne after announcing split with boyfriend and being kicked off Dancing with the Stars\n31/07/25 11:50Mia Fevola has suffered a few blows in recent weeks, but she is still smiling.British woman reveals how she was scammed out of $22,000 by a fake Dr Chris Brown\n24/07/25 08:34A middle-aged British woman is the latest victim to be targeted by a love scam using AI-generated videos and images of Dr Chris Brown.Troubled footy star's ex speaks for the first time since their split in cryptic video about disturbing behaviour\n09/07/25 06:19Jamarra Ugle-Hagan's ex girlfriend, Liv Kelly, has commented for the first time since the couple's breakup in 2024, making a cryptic post about disturbing behaviour.Brendan Fevola reveals what REALLY happened in wild footy brawl that saw him sent off the field - and the very Aussie thing he did straight after\n01/07/25 09:18Brendan Fevola has opened up on what really happened during his viral on-field scuffle during a local footy game this weekend.See the moment AFL legend turned radio star Brendan Fevola gets into a fight with three rivals in footy grudge match\n30/06/25 01:26The Carlton Blues great has regularly helped out struggling footy clubs lately - but he got a bit more than he bargained for when he ran out for South Whyalla.Footy legend Brendan Fevola calls for drastic change at Carlton - 'the board is just there for themselves'\n28/06/25 05:43AFL legend Brendan Fevola has called for fresh faces at Carlton following the horror 50-point loss to Port Adelaide on Thursday. It follows fans vandalising the club's headquarters as frustration mounts.Mia Fevola confirms she is single after two-year romance with boyfriend Bass Miller\n15/06/25 01:26Mia Fevola is back on the market after officially confirming she is single.The shock reason Dancing With The Stars contestant Osher Günsberg wore the same outfit on two shows\n13/06/25 12:06Osher Günsberg is no stranger to glitzy getups, but fans were left stunned after spotting a very familiar jacket in promos for the upcoming season of Dancing With The Stars.Mia Fevola takes embarrassing tumble ahead of Dancing With The Stars premiere: 'Not off to a great start'\n13/06/25 05:44Mia Fevola's rehearsals have begun for the 22nd season of Dancing With The Stars.Radio star Fifi Box shocks co-hosts with X-rated mistake live on air: 'Oopsie daisy'\n06/06/25 01:13Fifi Box made a very X-rated mistake live on The Fox's Fifi, Fev & Nick radio show on Thursday morning.Guy Sebastian hobbles out of court on crutches during trial with former manager Titus Day after being rushed to hospital for shock injury\n04/06/25 01:45Guy Sebastian hobbled out of Sydney's Downing Centre District Court on a set of crutches on Tuesday, just weeks after suffering a serious leg injury.Alex Fevola, 48, shows off her incredibly youthful looks in sleek black ensemble as she attends Melbourne Autumn Ball\n29/05/25 13:12Alex Fevola was looking decades younger than her years as she stepped out at a glitzy event on Thursday.Footy champ Brendan Fevola announces shock career move with starring role in feature film\n19/05/25 11:27Famed Australian footy star Brendan Fevola is set to make his movie debut.Guy Sebastian shares sweet throwback photo with wife Jules as the couple celebrate 17 years of marriage... after the pop star suffered a horrific sporting injury\n17/05/25 11:15Guy Sebastian has shared a sweet tribute to his wife Jules, as the couple celebrate their 17th wedding anniversary.Guy Sebastian rushed to hospital and awaiting surgery after serious injury: 'He's not well'\n12/05/25 00:20Australian music icon Guy Sebastian has landed in hospital after injuring himself during a footy match with AFL great Brendan Fevola.Brendan Fevola leads struggling footy side to victory, but it was bad news for singer Guy Sebastian\n10/05/25 06:00Brendan Fevola made a surprise return to the footy field on Saturday morning, helping struggling local club Masala Dandenong break a long losing streak in front of a buzzing crowd at Lois Twohig ReserveWhy AFL legend Brendan Fevola and Guy Sebastian have been investigated for trying to play a game of footy\n08/05/25 00:38AFL legend Brendan Fevola has agreed to make a shock return to footy alongside Aussie music star Guy Sebastian - but the famous pair were hit with a surprising hurdle.Celebrity pair kicked off The Amazing Race Australia after heated off-camera clash with TikTok stars\n29/04/25 10:39Brendan Fevola has reportedly had Ant Middleton and his brother Dan disqualified from The Amazing Race Australia: Celebrity Edition following an off-camera incident overseas.Fifi Box reveals horrifying moment she saved a drowning baby's life while on holiday in the Maldives: 'I was traumatised'\n29/04/25 02:26Fifi Box has revealed how a harrowing ordeal, that saw her leap into action to save a baby's life, left her traumatised.Pretty in pink! Mia Fevola stuns as she flaunts her toned frame and pert derrière in skimpy bikini\n17/04/25 00:46Mia Fevola ensured all eyes were on her on when she hit the beach in Melbourne for a refreshing dip.Footy great Brendan Fevola's daughter slams him over his 'disgusting' habit of leaving a VERY personal item in his car\n09/04/25 01:52The former Carlton full forward's daughter Lulu has treated her followers to a hilarious video sowing her exposing her famous dad's awful personal hygiene habit.The Amazing Race Australia 2025 cast confirmed - and it features surprising celebrity from rival network\n19/03/25 04:03The all-star cast of the upcoming The Amazing Race Australia has been revealed, and it features some very surprising faces.All-star cast of The Amazing Race 2025 is leaked ahead of the series premiere - and it features a legendary AFL player and veteran reality TV star\n17/03/25 23:18Excitement is soaring with preparations for the 2025 season of Channel Ten's The Amazing Race Australia well underway and the star-studded lineup has reportedly been leaked.Brendan Fevola leaves Fox FM listeners stunned with huge announcement: 'I'm leaving...'\n14/03/25 01:31Brendan Fevola shocked his Fox FM co-stars on Friday morning by revealing he would be stepping away from the program.Footy legend Brendan Fevola opens up on how he 'thought he had died' after being admitted to a mental health clinic - as he claims spending 70 days in rehab 'completely changed my life'\n12/03/25 10:51Fevola, who was 29 when he entered the facility, also revealed that spending 70 days in the facility had 'completely changed his life'.Lady Gaga teases first Australian tour in eleven years: 'She's coming back!'\n06/03/25 21:26US Pop superstar Lady Gaga has teased that a trip Down Under could very well be on the cards.Brooke Warne shares a heartbreaking tribute to father Shane on the third anniversary of his shock death\n03/03/25 23:18Shane Warne's eldest child Brooke has paid an emotional tribute to her late father on the third anniversary of his shock death.Woolworths employees spill the 'secret' 3pm detail in all stores that no shoppers know about: 'Drives me crazy'\n20/02/25 04:42Woolworths shoppers were surprised to learn about a little-known detail that takes place in all stores across Australia every day.AFL legend Brendan Fevola's shock new career move: 'I've got a new lease on life'\n13/02/25 00:37AFL legend Brendan Fevola says he's got a new lease on life after taking on an exciting new role that might surprise some footy fans.Brendan Fevola reveals he used to cry alone in his car as he breaks his silence on the darkest days of his footy career\n07/02/25 01:13Brendan Fevola has revealed he often cried in his car as he struggled with mental health issues during his footy playing days. He also wants the AFL to be more proactive with today's stars.Brendan Fevola reveals how his old housemate Troy Selwood saved him during a tough time before the star's death aged 40\n05/02/25 10:42Selwood enjoyed a distinguished career in the AFL, making 75 appearances for the Lions across a seven-year period.Aussie sport fans and stars react with horror after seeing how Jelena Dokic suffered abuse from her dad in confronting documentary\n30/01/25 01:04Australian sports fans have reacted in horror after seeing the shocking level of abuse former tennis star Jelena Dokic suffered at the hands of her father Damir at the peak of her career.Tennis legend Andy Murray is blown away by footy great Brendan Fevola's INSANE Uber Eats bill: 'You should get knighted for that'\n20/01/25 02:59AFL great Brendan Fevola has left tennis legend Andy Murray speechless after revealing he has ordered so much food through the app that he is in the top 0.001 per cent of Aussie customers.Mia Fevola shows off her incredible physique in skimpy bikini during Gold Coast getaway - after engagement rumours with boyfriend Bass Miller\n23/12/24 12:28Mia Fevola has been basking in the summer holidays this year.Mia Fevola shows off her incredible figure in a bikini during Byron Bay holiday - after engagement rumours with boyfriend Bass Miller\n17/12/24 12:14Mia Fevola is never shy when it comes to showing off her incredible physique.Mia Fevola flaunts her fit figure in athleisure wear - after breaking her silence on engagement rumours with boyfriend Bass Miller\n09/12/24 23:18Mia Fevola is known for her sizzling selfies where she shows off her banging body.Carrie Bickmore thanks her celebrity friends for 'all the birthday love' - but there's one very notable well-wisher missing\n04/12/24 07:06Carrie Bickmore has taken to social media to thank her celebrity friends for 'all the birthday love' she recently received - but there was one very notable exception.Brendan Fevola left shocked after finding out what his teen daughter got up to during Schoolies: 'I don't know what I've done wrong as a parent'\n28/11/24 01:36Brendan 'Fev' Fevola was left shocked by his 17-year-old daughter's antics at Schoolies in Byron Bay.Brendan Fevola texts family goodbye during mid-air emergency: 'I think I'm going to die'\n21/11/24 05:07The Melbourne-based radio star, 43, detailed the terrifying incident from his recent flight to Sydney, where his plane appeared to have an issue during landing.Footy great Brendan Fevola reveals he came incredibly close to getting into wild brawl while he was out with his daughters\n18/11/24 04:02The Carlton great was so close to the wild NBL brawl that rocked John Cain Arena in Melbourne on Sunday that he was concerned he might have to start throwing punches himself.Has Merrick Watts' next career move been revealed? Comedian breaks his silence on I'm A Celebrity... Get Me Out Of Here rumours\n12/11/24 02:18Merrick Watts has spoken out on rumours he will be appearing on the upcoming series of Channel Ten's I'm A Celebrity... Get Me Out Of Here!Footy great Brendan Fevola breaks down in tears live on air after hearing the shocking way an Aussie boy was treated after his father's death from cancer\n31/10/24 01:30The Carlton great, 43, was overcome with emotion when the boy's mother rang in to the Fifi, Fev & Nick radio show on Thursday morning.Could this be the end of Brendan Fevola's radio show with Fifi Box? AFL legend considers massive career change\n25/10/24 12:49Former AFL champ and radio star Brendan Fevola has teased fans about a massive career change.Champion Aussie snowboarder Scotty James and his Formula One heiress wife Chloe Stroll announce the arrival of their first child\n10/10/24 09:21Australian champion snowboarder Scotty James and his Formula One heiress wife Chloe Stroll have welcomed their first child.Dustin Martin makes a shock move that confirms many fans' suspicions about his retirement from footy\n13/09/24 04:56Richmond Tigers legend Martin bid an emotional farewell to the club's fans at their last game of the year on August 24 - and now, just weeks later, he has made a move that will leave them stunned.AFL legend Brendan Fevola reveals how he lost 14.5kg in one month with NO exercise\n10/09/24 06:47AFL great Brendan Fevola has revealed he has lost a whopping 14.5 kilograms in just one month without doing any exercise.AFL legend Brendan Fevola reveals gruesome injury in Grand Final win: 'It was worth it'\n09/09/24 05:53Footy legend Brendan Fevola has opened up about the brutal injury that saw him taken to the emergency room after starring in his park footy team's grand final over the weekend.The Block viewers slam the show's controversial cooking challenge as the teams compete to win a $120,000 boat: 'This isn't MasterChef'\n05/09/24 03:33The Block viewers were left confused on Wednesday night after the Channel Nine reality TV series aired a controversial cooking challenge.Brendan Fevola reveals shock health scare… after AFL legend detailed his dramatic 30kg weight loss\n27/08/24 01:32The AFL great, 43, recently told how he's shed a quarter of his body weight in the past 12 months in a huge health overhaul.Brendan Fevola doesn't look like this anymore! Ex-AFL star shocks fans with failed transformation\n23/08/24 01:32Brendan Fevola underwent a massive transformation on Thursday, but all did not go to plan when he finally unveiled it.Brendan Fevola drops bombshell about Collingwood boss who is under fire after allegedly making shocking racist remarks to staff\n22/08/24 02:43AFL great turned breakfast radio identity Brendan Fevola claimed there has been a huge development at Collingwood involving CEO Craig Kelly - prompting a response from the club.Dave Hughes explodes in unhinged rant after Logies snub: 'The amount of losers in that room'\n20/08/24 05:26Dave Hughes has exploded after he didn't get an invite to the 2024 Logies.Brendan Fevola shows off his slimmed down physique as he grabs a coffee in Melbourne after shedding an impressive 30kgs\n20/08/24 05:02Brendan Fevola cut a remarkably trim figure as he was spotted in public for the very first time since revealing his dramatic 30kg weight loss.AFL great Brendan Fevola reveals the secret behind his weight loss after shedding an impressive 30kgs\n14/08/24 04:59Brendan Fevola opened up on Wednesday about his dramatic weight loss journey over the past year, which has seen him shed over 30kgs and reach his target goal.Bronze statue of Brendan Fevola 'vanishes' from Melbourne's Flinders Street Station after first being unveiled in March\n03/08/24 14:57A life-sized statue of Brendan Fevola has 'vanished' from Flinders Street Station in Melbourne after first being unveiled in March.MasterChef Australia star Hayden Quinn gives his shock opinion of Dancing With The Stars judge - and reveals he has welcomed a new family member with wife Jax Raynor\n29/07/24 02:51Celebrity chef Hayden Quinn has opened up about his gruelling stint on Dancing With The Stars, following his shock elimination on Sunday night.Brendan Fevola reveals the staggering amount he was paid to star on I'm A Celebrity... Get Me Out Of Here!\n21/07/24 22:23Brendan Fevola has revealed the jaw-dropping amount he was paid to appear on I'm A Celebrity... Get Me Out of Here! Australia.Kylie Minogue lifts the lid on her time on Neighbours in the 1980s and kissing ex Jason Donovan in her car\n16/07/24 09:57Kylie Minogue has lifted the lid on her time on Neighbours.Kylie Minogue accidentally confirms first Australian tour in five years in surprise radio announcement: 'I wasn't meant to say that!'\n16/07/24 01:36The pop superstar, 56, last toured Down Under on her Golden tour back in March 2019 and is now lining up another string of concerts in the country.Mia Fevola flaunts her sensational bikini body as she enjoys lavish trip to Europe with boyfriend Bass Miller\n07/07/24 10:22Mia Fevola is soaking up the sun in Europe.Mia Fevola shows off her incredible bikini body as she enjoys lavish trip to Italy with boyfriend Bass Miller\n27/06/24 06:39Mia Fevola is enjoying a lavish holiday in Italy.Mia Fevola looks loved-up with boyfriend Bass Miller as she shows off her sensational bikini body in Italy\n25/06/24 12:16Mia Fevola has taken to Instagram to share stunning photos from her recent holiday in Sorrento, Italy, on Tuesday.Mia Fevola flaunts her stunning bikini body on luxurious Italian holiday - after AFL star ex Daniel Rioli announced engagement\n21/06/24 10:06Brendan Fevola's stunning daughter Mia is currently living life to the fullest on a sun-soaked luxurious holiday on the scenic Amalfi Coast in Italy.Western Bulldogs star Jamarra Ugle-Hagan appears to have split from his glamorous influencer girlfriend as they unfollow each other on Instagram\n21/06/24 06:38Western Bulldogs star Jamarra Ugle-Hagan and his glamorous influencer girlfriend Olivia Kelly appear to have split.Lara Worthington shows off her incredible figure in a rare vintage Jean Paul Gaultier corset dress during stunning photoshoot in Marrakech\n18/06/24 06:34Lara Bingle stunned followers on Friday when she stepped out wearing a very rare Jean Paul Gaultier piece while on holiday in Marrakech, Morocco.Footy great Brendan Fevola reveals the telling sign that Dustin Martin played his last game in Richmond colours in 300th game milestone\n18/06/24 02:34Carlton legend Brendan Fevola has bad news for Richmond fans, he believes Dustin Martin 's 300th match for the club was also his lastAFL legend Brendan Fevola returns to the field - and you'll never guess how many goals he scored\n16/06/24 01:59Footy legend and radio presenter Brendan Fevola has returned to the field for a Division 3 dust-up in Melbourne's northeast - and he had his eye on goal.Cruel moment Fifi, Fev and Nick taunt caller trying to guess FoxFM's secret sound only to be incorrect… after radio station was accused of copying KIIS FM\n30/05/24 01:07The Fox's Fifi Box, Brendan Fevola and Nick Cody have taunted a caller during their Secret Sound guessing game.Footy great Brendan Fevola drops a bombshell about Dustin Martin's retirement from the AFL - and Tigers fans should look away now\n28/05/24 03:38Brendan Fevola has poured petrol on rumours surrounding Martin's exit from the league. The 32-year-old has struggled for form so far this year, giving rise to speculation about his future.Lara Worthington 'recreates' infamous nude shower moment as she relaxes naked in an outdoor bath\n24/05/24 05:37Lara Worthington was in hot water in 2010 when a controversial affair with Brendan Fevola was outed by a nude shower photo.Beyoncé to rock the MCG? Rumours emerge that superstar is bringing her Cowboy Carter World Tour to Melbourne\n21/05/24 02:15Beyoncé is rumoured to be bringing her Cowboy Carter World Tour to Australia in late October to perform at the Melbourne Cricket Ground (MCG).Brendan Fevola admits he could've been jailed for drugs like fallen footy star Sam Fisher\n20/05/24 06:32Brendan Fevola has opened up about Sam Fisher's five-year prison sentence for trafficking drugs as the Carlton legend turned radio star revealed the pitfalls retiring players face.Mia Fevola talks about her powerful bond with her footy star 'dad' Brendan after her father tragically died when she was a baby: 'I can't remember life before him'\n19/05/24 22:33Mia Fevola has opened up about her close bond with stepfather Brendan Fevola.Mia Fevola says she will keep romance with boyfriend Bass Miller private after 'oversharing' relationship with ex Jamarra Ugle-Hagan led to 'negativity'\n18/05/24 14:33Mia Fevola is keeping her boyfriend Bass Miller close to her, and out of the public eye.Brendan Fevola fires up in defence of Fifi Box after a troll targets the radio star for being a single mother\n16/05/24 08:58Fox FM star Brendan Fevola came to the defence of his co-host Fifi Box on Thursday, after a cruel troll slammed her for being a working single mother.Jackie 'O' Henderson slams Melbourne radio rivals 'dumb games' after Fifi, Fev and Nick's copycat marketing campaign was revealed\n15/05/24 02:09Jackie 'O' Henderson has fired another shot in the 'radio wars' currently stirring the airwaves in the Melbourne market.KIIS FM staffer defaces Brendan Fevola statue in Melbourne… and even Kyle Sandilands brands the stunt 'childish'\n14/05/24 02:39As the Melbourne breakfast radio war rages on, a staffer for KIIS FM's The Kyle and Jackie O Show has taken a cheeky pot shot at Fox FM star Brendan Fevola.\nPage\nDON'T MISS\n-\nRio Ferdinand, 46, and wife Kate, 33, reveal they have moved to Dubai with their family as they show off their lavish mansion\n-\nCruz Beckham shares an intimate moment with Jackie Apostel after joining shirtless dad David aboard their lavish yacht\n-\nEmma Watson potters around in a sheer lace dress as she joins her hunky personal trainer for a hike in Saint Tropez\n-\nEXCLUSIVE\nI was desperate to know what this model got up to with England star. Now I've discovered truth, reveals KATIE HIND\n-\nSting is being sued for 'MILLIONS of pounds in lost royalties' by former bandmates in The Police\n-\nBeaches, history, waterparks, golf... Turkey (Türkiye) has it all: Here's why you'll never want to leave\nAd Feature\n- Selena Gomez stuns in black swimsuit on yacht for bachelorette party in Cabo... but was BFF Taylor Swift there? Looking good\n-\nWas this earliest sign of cracks forming between Meghan and Kate? Expert reveals signs that 'Fab Four' weren't getting on\n-\nEXCLUSIVE\nThe dark truth of Club Chalamet: She's a 58-year-old Timothée obsessive who HATES Kylie Jenner\n-\nCould an app really make you better with money? Putting a smart money app to the test\nAd Feature\n-\nBrooklyn Beckham and Nicola Peltz give fans a glimpse of their 'perfect Sunday' as couple unwind after family 'snub'\n-\nMeghan Markle 'placed status above reality' and struggled to separate her own image from Suits character, claims royal author\n- Zoe Kravitz seen arm-in-arm on romantic stroll in Rome with Harry Styles after getting cozy with Austin Butler See the pic\n- I Dream of Jeannie star Barbara Eden turns 94 and looks more glamorous than ever... see her now All change\n-\nGet your autumn on! From pumpkin throws to cosy hot chocolate mugs, here's our pick of homeware for the new season\nAd Feature\n-\nFrom Princess Margaret's sadistic streak to Meghan 'berating a gardener' - the most ill-mannered royals revealed\n-\nKaty Perry makes a braless fashion statement in curve-clinging dress... after Justin Trudeau romance rumors\n-\nWhy Millie Bobby Brown, 21, decided to shun Hollywood in favour of farm life in a nod to her British roots as she adopts a baby\n-\nBritney Spears reveals Sam Asghari 'felt like a fake distraction' to cope with being 'cut off' from sons\n-\nFrom auctions to EVs: 5 brilliant motoring brands every driver should know - from finance fixes to stunning electric SUVs\nAd Feature\n-\nBobby Brazier's love for Hare Krishna: From finding happiness through religion after tragic start - as soap star 'quits showbiz'\n-\nMum's the word! George, Charlotte and Louis join William and newly blonde Kate for church service in Balmoral\n-\nMillie Bobby Brown, 21, and Jake Bongiovi, 23, bond with baby daughter in NYC... days after announcing adoption\n-\nEmily Ratajkowski showcases her curves in leather dominatrix inspired lingerie\n-\nWhy Scottish Mortgage is backing the future of banking for long-term profits\nSponsored\n-\nStrictly Come Dancing bosses deliver verdict on future of BBC show after a male star was arrested on suspicion of rape\n-\nSuperman actor Dean Cain, 59, brutally mocked for struggling through training course after signing up with ICE\n-\nHidden detail in Kelly Clarkson's outfit which symbolizes 'healing and hope' after ex Brandon Blackstock's death\n-\nLily Collins' VERY famous father-in-law reveals he isn't a fan of her show Emily in Paris - but do YOU know who he is?\n-\nEastEnders star Cheryl Fergison reveals the devastating moment she found her husband in a 'dingy love nest' with another woman\n- Vogue Williams gives fans a glimpse at her early 40th birthday celebrations with family and friends Milestone celebration\n-\nPaul Merton reveals it 'felt natural' falling in love with third wife Suki Webster six months after becoming a widower\n-\nSir Elton John, Sir Rod Stewart and Jessie J join an array of music legends for tribute to 'funny and rude friend Steve Wright'\n-\nEXCLUSIVE\nIs 'Saint' Peter Andre REALLY an angel? Katie Price's ex mocked disabled son Harvey and told Junior not to kiss boys\n- Try Amazon Music Unlimited FREE for 30 days! Enjoy millions of songs, audiobooks and podcasts SHOPPING\n-\nPassenger princesses! Kate and Charlotte beam as Prince William drives family to church service in Balmoral\n- Bikini-clad Naomi Campbell, 55, shows off her age-defying physique as she enjoys a lavish trip to Ibiza She's still got it\n-\nVictoria and David Beckham look more smitten than ever after 26 years of marriage as they enjoy lunch with their children in Nerano\n-\nLove Island's Kaz Crossley and TOWIE's Elma Pazar among reality stars 'involved in horror crash'\n- Upgrade your home office with up to 50% off ergonomic desk chairs and standing desks (and we have an EXCLUSIVE extra code) SHOPPING\n-\nMyleene Klass shows off her harp playing skills as accomplished musician performs at 'dear friend' Clare Patterson's wedding\n-\nJackie Woodburne doesn't look like this anymore! Neighbours star is unrecognisable as she ditches the brunette crop she's had for decades and reveals grey hair\n- Queen's 20-year-old supercharged Range Rover sells for over ten times its typical market value at auction Pricey\n- Linda Robson reveals the real reason for major Loose Women changes amid fears for the show's future Speaking out\n- Shoppers flocking to Tesco after price slash on 'DELICIOUS' award-winning £20 Irish cream liqueur that's giving Baileys a run for its money SHOPPING\n-\nIconic supermodel's son shows he's inherited her chiseled looks as he's marched into court on assault charges\n-\nTyson Fury's daughter Venezuela, 15, goes Instagram official with 'mystery boyfriend' - and his profession runs in the family\n-\nThe Walking Dead star's son makes disturbing threat after being charged with assault\n-\nSuki Waterhouse treats fans to a raunchy performance as she takes to the stage in black fishnet tights and microscopic shorts\n- Why pay full price? This hack lets small businesses lease top tech for as little as £2.16 per MONTH - and no, there's no catch! SHOPPING\n- Jameela Jamil raises alarm over Serena Williams' weight loss drug promotion British star has blasted Williams\n-\nBritney Spears poses nude in new photo after sparking fan concerns over disheveled living conditions\n-\nLeigh-Anne Pinnock flashes her abs in a skimpy red bra as she she continues her tour of UK festivals with solo gig at Reading\n- TV host Jenni reveals secret to bikini body...no chips or crisps for 34 years! Still looking toned and trim\n- Shiseido launches upgraded viral skincare - get 20% off plus a free gift with our exclusive code SHOPPING:\n- Tulisa wears a strapless lime bustier as she she returns to the spotlight at Manchester Pride Looking good\n-\nDating Naked line-up REVEALED: Controversial Married At First Sight star joins new series of Rylan Clark's show\n-\nFeuding royal rivals William and Harry go to war. Sound familiar? CHRISTOPHER STEVENS reviews King & Conqueror\n- Zendaya says she loved getting to do 'normal' things during her time with fiancé Tom Holland in Scotland Close couple\n- Is YOUR mattress causing you sleepless nights? Don't miss out on the best Emma Sleep deals with up to 25% off - prices start at £50 SHOPPING\n-\nEXCLUSIVE\nLuisa Zissman shares bikini snaps amid skinny-shaming row - after sparking debate for smashing kids' iPads\n-\nJeering Dragons' Den panel called my business a 'delusional disaster' - now I'm worth £40million!\n- Pop star under fire as fans call out penis-shaped stage design on opening night of tour It got off to a very memorable start\n-\nPregnant Sophie Habboo accidentally posts full frontal picture of husband Jamie Laing to fans as they enjoy Bank Holiday weekend\n- Inside Kristin Cavallari's wild Las Vegas weekend The 38-year-old reality star splurged the cash during her lavish trip\n-\nJenni Falconer, 49, displays her flawless physique in a skimpy leopard-print bikini as she soaks up the sun during summer break\n-\nSelena Gomez's fiancé Benny Blanco is SLAMMED for purchasing $200 blueberries: 'I can't afford regular fruit'\n- Julianne Moore admits her wedding dress was a HUGE mistake after skipping tradition to wear white Big regret\n- Kylie Jenner gives rare update on beloved dog Norman that she got at age 17 She's had the pet since she was a teenager\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n-\nAll the celebrities who have REVERSED their cosmetic surgery from Chloe Ferry to Molly-Mae Hague and even Victoria Beckham\n- A-list celebrities rush to check on Kyle Sandilands following reports 'he was off-air due to stroke' Worrying\n-\nTaylor Swift's true feelings REVEALED over Kansas City Chiefs docuseries that explores Travis Kelce romance\n-\nMark Wright and Michelle Keegan put on a loved up display as they enjoy romantic date night at Coldplay's Wembley gig\n-\nEXCLUSIVE\nFormer Baywatch star Nancy Valen ditches Hollywood glamour in rare sighting - see her now\n-\nClaudia Schiffer shows support for her husband Matthew Vaughn's team by posing in a Brentford shirt\n- Gloria Estefan may sue Diddy accuser who name dropped her and husband Emilio The court officially dismissed all allegations\n-\nThe downfall of Marco Pierre White Jr: Son of Michelin star chef has shirked his upbringing to have multiple brushes with law\n-\nJosie Gibson admits she's 'stepped back' from TV work and reveals plans to live 'off-grid as humanly possible'\n-\nEXCLUSIVE\nWilliam Shatner, 94, and his ex-wife spark REMARRIAGE rumors as she steps out wearing huge diamond ring\n-\nBraless Myleene Klass heads to work in a bandeau top and mini skirt after Frankie Bridge broke her silence on their 'feud'\n-\nLady Gaga breaks down during concert after revealing what fiance said moments before she took the stage\n-\nCelebrities who have dated people who look JUST like their siblings with eerie similarities - but do you agree with the comparisons?\n-\nScarlett Thomas' staggering payday as her father Ryan insists she hasn't had a free ride - after nepo baby, 16, skipped GCSEs\n-\nCall me sweet and I'll tell you to f*** off: Dame Helen Mirren, 80, issues a very blunt response to 'condescending' comments about age\n-\nX Factor star who faced off with Simon Cowell looks unrecognisable after reinventing himself as a 'spiritual healer'\n-\n'Irresponsible' Sam Faiers and Billie Shepherd shock fans with their 'dangerous' holistic healthcare advice\n-\nMike Tindall reveals his 'sliding doors' moment when he first met Zara Tindall in 2003\n-\nDuncan James SPLITS from boyfriend after six years together as Blue singer shares post about 'growth' to fans amid heartache\n-\nAlec Baldwin shares sensual moment with wife Hilaria as couple reenact Dirty Dancing in what appears to be a desperate audition for DWTS\n-\nSerena Williams buries feud with Maria Sharapova with shock appearance as Russian enters tennis Hall of Fame\n-\nThe Hollywood stars you had no idea appeared on reality TV shows before they were famous\n-\nEXCLUSIVE\nThought the Biggest Loser was harsh? TV's self-declared 'lard police' Steve Miller insists he has 'no regrets' about his controversial Fat Families show\n-\nConor McGregor poses with 'yacht neighbour' David Beckham and sons Romeo and Cruz as UFC star hails football legend's 'dynasty'\n-\nColdplay's Chris Martin makes a cheeky swipe about the kiss-cam scandal before helping with a proposal and sharing sweet moment with autistic fan\n-\nFreddie Starr died 'penniless and estranged from his six children' as stranger stepped in to bring his body home from Spain and foot funeral bill\n-\nNelly Furtado, 46, delights fans with Noughties nostalgia as she storms the stage in a racy cut out top and mini skirt at the Big Feastival\n-\nSaturday Night Live boss Lorne Michaels says there will be a bloodbath of cast members within weeks\n-\nStacey Solomon and Joe Swash having another baby 'not off the table' following loved up display on luxurious family holiday\n-\nBobby Brazier, 22, 'is quitting showbiz and moving to India to pursue the Hare Krishna religion'\n-\nThis is just a saga now: Games critic Peter Hoskin checks out Echoes Of The End, an ambitious new video game from Iceland\n-\nThe exact treatments behind Karren Brady's transformation: The Apprentice star receives 'state-of-the-art technology for fat removal', says her very own cosmetic surgeon\n-\nLuisa Zissman reveals she smashed up her childrens' iPads in front of them because they 'p****d her off' - as controversial post sparks huge debate\n-\nNeighbours star Ian Smith shares major health update after being diagnosed with terminal lung cancer\n-\nOscar-winning actor looks unrecognisable in 90s comedy that has since become a cult classic - can YOU spot who he is?\n-\nRyan Thomas' nepo baby actress daughter Scarlett, 16, reveals she didn't sit her GCSEs\n-\nAlison Hammond, 50, is happier than ever with boyfriend David Putman, 28, and 'can't imagine her life without him as friends predict engagement'\n-\nEXCLUSIVE\nWas Hulk Hogan MURDERED? Estranged daughter Brooke has NEW information amid police investigation into death... here's all the evidence\n-\nEXCLUSIVE\nVile plot against Kylie Jenner with two-word code name... orchestrated by Timothee Chalamet's die-hard fans who say it's punishment for doing the unthinkable\n-\nUniversity Challenge's most memorable players: From irritating habits to disastrous blunders and wise cracks, the BBC boffins who stole the show\n-\nJacqueline Jossa and hubby Dan Osborne enjoy family holiday - months after a make-or-break getaway saved their marriage following brief split\n-\nMaya Jama 'considers moving to Manchester to be closer to footballer boyfriend Ruben Dias' as romance becomes more serious\n-\nStrictly Come Dancing gets 'major format shake-up' for this year's series that could 'disrupt chemistry' between celebrity and pro dance partners\n-\nStrictly Come Dancing star arrested on suspicion of rape in fresh blow for scandal-hit show just weeks before series returns to screens\n-\nNick Ferrari, 66, marries longtime love Clare surrounded by celeb pals including Piers Morgan, Myleene Klass and Christopher Biggins in idyllic venue in the south of France\n-\nKENNEDY: Shame on Serena Williams! She may be starving herself on prescription anorexia drugs. But this putrid stunt proves she's still a greedy beast\n-\nNetflix fans rave over 'simply fantastic' period drama hailed as 'a beautiful piece of storytelling' with huge Hollywood star in lead role\n-\nEXCLUSIVE\nFlorence Pugh's brother Toby Sebastian who starred in Game of Thrones has drastic new career change\n-\nThe tale of two Taylors! From Hollywood showmances to rebelling against studios - the incredible parallels between Taylor Swift and Elizabeth Taylor\n-\nNetflix fans gripped by 'harrowing and nightmarish' Vanessa Kirby sex work thriller - gushing over her 'powerhouse performance'\n-\nArnold Schwarzenegger's son Chris is unrecognizable in shockingly thin appearance after weight loss... see him now\n-\nAbbey Clancy wows in a bikini as she poses with husband Peter Crouch and their four children during idyllic summer holiday\n-\nKing Charles and Queen Camilla tell of 'deepest admiration for the unbreakable courage and spirit of the Ukrainian people' in Independence Day letter\n-\nMillie Bobby Brown weighs in on letting her kids pursue acting in resurfaced clip... after adopting baby girl at just 21\n-\nSopranos star Jerry Adler dies at 96: Late-blooming actor worked with Woody Allen and appeared on The Good Wife\n-\nEXCLUSIVE\nHome And Away tease the return of iconic couple Brax and Ricky after a decade away from Aussie soap\n-\nEXCLUSIVE\nI was the resident therapist on Celebrity Fit Club, the stars binged on pizza after weigh-ins and one was sacked after getting a gastric band mid-series\n-\nJack Osbourne honours late father Ozzy with heartfelt tribute in rare public appearance... one month after rock legend's death at 76\n-\nBradley Cooper, 50, and Gigi Hadid, 30, jet out for getaway together as age-gap romance heats up\n-\nEXCLUSIVE\nPride and Prejudice first look: Jack Lowden and Emma Corrin transform into Mr Darcy and Elizabeth Bennett for heated first scenes\n-\nMeghan and Harry's Michelin-starred wedding chef who features in new Netflix series reveals duchess's secret kitchen skills\n-\nEXCLUSIVE\nRaye forced to halt her performance as a fan collapses in the crowd at All Points East Festival\n-\nFKA Twigs puts on a very racy performance at All Points East after being drafted in as last minute replacement for Doechii\n-\nMeghan Markle's high street capsule wardrobe revealed: From staple crisp shirts to her go-to ballet flats\n-\nI'm A Celebrity star Dean McCullough speaks out as police investigate sick death threats\n-\nBrooks Nader's ex Gleb Savchenko seen on DWTS set after she claimed he was 'fired'\n-\nEXCLUSIVE\nTaking the Michael! ITV chiefs throw cash at comedian McIntyre in bid to nab him from BBC... but hit a snag because super-rich comic only cares about ratings\n-\nKylie Jenner's mini-me daughter Stormi steals the spotlight in her first commercial for mom's makeup\n-\nLil Nas X stripped completely nude on street before LA arrest in shocking new footage\n-\nLeigh-Anne Pinnock puts on an X-rated display as the former Little Mix star headlines Pride in Manchester\n-\nCoronation Street bosses face backlash for casting actor 'who broke another man's eye socket' as upcoming storyline reflects real life\n-\nLiam Gallagher extends major olive branch to his brother Noel during Oasis reunion tour - after years of feuding\n-\nGrief-stricken Kelly Clarkson appears shaken as she's seen for FIRST TIME since tragic death of ex-husband Brandon Blackstock\n-\nTALK OF THE TOWN: Moving in the right direction - Harry Styles set to start work on mega-mansion\n-\nSophie Turner reveals why she will never leave the UK again after moving back to London following divorce from ex Joe Jonas\n-\nJennifer Garner appears fresh-faced on solo outing after her kids celebrate dad Ben Affleck's low-key birthday\n-\nGRIFF RHYS JONES: My night with four young people (I paid, of course)...and why, in spite of all their witless opinions, I deplore the way their futures are being stifled\n-\nKatie Price displays her surgically-enhanced assets in a grey top as she steps out in London amid bitter feuds with her exes\n-\nEXCLUSIVE\nNew series depicts Princess Diana as an American mom with an addict daughter in Arizona - but friend behind the show insists he's not cashing in on her memory: KATIE HIND\n-\nEastEnders star Cheryl Fergison, 59, reveals she has suffered a worrying stroke - amid financial struggles\n-\n'Oh she's out!' Michelle Keegan lets her hair down as she posts selfie with a beer before partying at Coldplay's Wembley gig\n-\nLovely jubbly! Sir David Jason, 85, is in great spirits as he's mobbed by fans before his new show at Manchester's Lowry Theatre\n-\nMAFS UK expert Charlene Douglas in a wheelchair after being rushed to hospital as she gives health update\n-\nGeorgia Toffolo flaunts her toned abs in a skimpy white bikini as she shares snaps from sun-soaked holiday\n-\nJowita Przystal celebrates her birthday on wild night out as Pete Wicks shows off the moves she taught him on Strictly after pair reignited romance rumours\n-\nSam Thompson shows off new physique as he poses with equally buff brother-in-law Ryan Libbey after crashing sister Louise's family holiday\n-\nDid William the Conqueror really have an Asterix moustache? No, say historians - and that's just one of BBC blockbuster's howlers\n-\nKhloe Kardashian nearly upstages her friend at her birthday party as fans go wild over her 'amazing' look\n-\nJeremy Clarkson checks out the competition! Star samples a Britpop lager as he takes a break from his Cotswolds farm duties to enjoy Blur star Alex James' festival\n-\nEmily in Paris resumes filming in Venice two days after Netflix show's 'assistant director collapses and dies' in front of horrified crew\n-\nKylie Jenner gets roasted AGAIN after reposting snaps from her most-hated fashion shoot\n-\nThe dark past of William and Kate's 'forever home': Slavery links, an equerry who blew his brains out and a royal break-up...\n-\nThe Kooks frontman Luke Pritchard reveals why Rebel Wilson joined the band on stage and admits they only rehearsed an hour before\n-\nStunning wealth of Coco Gauff, 21, revealed as she's named the world's highest-earning female athlete\n-\nNepo baby son of Walking Dead star and 90s iconic supermodel arrested for assault\n-\nDua Lipa turns 30! Hitmaker sizzles in a sheer halter dress as she celebrates milestone birthday with intimate dinner while paying tribute to parents\n-\nSydney Sweeney who? Awards panel unveils 25 greatest films list with stars over 60 amid Hollywood's youth obsession\n-\nClaudia Schiffer sports a football shirt as she cheers on Brentford with husband Matthew Vaughn at the Gtech Community Stadium - after filmmaker invested in Premier League club\n-\nSophie Ellis Bextor stuns in glitter mini dress she makes surprise appearance at Reading Festival to perform Murder on the Dancefloor\n-\nAnd Just Like That... woke storylines killed the SATC reboot: From Miranda's 'late life lesbianism' to Charlotte's family gender issues - the moments that left viewers cringing\n-\nI met Amanda Holden when the Britain's Got Talent cameras weren't rolling - she showed her true colours straight away\n-\nLove Island's Yasmin Pettet reveals emotional reason she 'hasn't been intimate' with boyfriend Jamie Rhodes after leaving the villa\n-\nCountry superstar says chance meeting with Taylor Swift at Travis Kelce's charity camp lit up collab hopes\n-\nEXCLUSIVE\nSecret Lives of Mormon Wives explodes with lesbian twist as stars KISS in steamy first look at Season 3\n-\nImpossible contestant sent home empty-handed after struggling with a Harry Potter question on axed BBC show - but could YOU have guessed it?\n-\nBBC star Michael Ball reveals his mother has died as devastated singer is flooded with support by fans\n-\nSydney Sweeney's Americana director defends flop after box office crash\n-\nQueen Camilla is stylish in blue as she steps out at the final day of the York races\n-\nVicky Pattison leaves fans 'horrified' as she lets a dog lick her mouth in 'stomach churning' clip\n-\nBrookside legend Sue Johnston set to reprise iconic role after 35 years in historic Hollyoaks crossover\n-\nDrake back in bed with Bobbi Althoff after viral feud as they tease new project\n-\nLeona Lewis reveals how motherhood has changed her - as she gears up for her first-ever Las Vegas residency"
    },
    {
      "url": "https://www.dailymail.co.uk/sport/afl/article-11171357/Inside-Richmond-pub-Dustin-Martin-filmed-groping-topless-woman-Mad-Monday-party.html",
      "text": "Inside the Richmond pub where footy superstar Dustin Martin was filmed groping a topless woman at a Mad Monday party - as more new details about Tigers scandal emerge\n- The Richmond Tigers were rocked by images released on the eve of their final\n- The images show Martin groping a topless woman and then smiling\n- The venue where the incident occurred has now been revealed\n- The AFL and Richmond are expected to investigate now team's season is over\nNew details have emerged after footage surfaced online of Richmond champion Dustin Martin groping a topless woman's breast from behind after handing her a drink during an end-of-season celebration in 2015.\nThe vision was made public on the eve of the Tigers' elimination final against the Brisbane Lions, which saw Richmond bundled out of the finals in a tense two-point loss at the Gabba on Thursday night.\nMartin is pictured with the topless woman and smirking after the alleged incident\nThe incident occurred during a team function for Mad Monday at The Sporting Globe Bar & Grill in Richmond following the 2015 AFL season, according to the Herald Sun.\nThe players were allegedly in the venue's private function area when the images were taken.\nThe Sporting Globe Bar & Grill is a national chain of pubs/restaurants that have the premise of ensuring punters are 'always close to the action' with a wide array of screens and sporting channels delivering live sport from around the world.\nMartin trudges off the field dejected after the club's elimination final loss to the Brisbane Lions on Thursday night\nThere are 11 franchises in Victoria alone, including regional areas like Geelong and Ballarat. There are also two franchises in Brisbane, Sydney and three in Western Australia.\nThe Sporting Globe Bar & Grill in Richmond where the Mad Monday celebrations took place\nIn Victoria, venues require an Adult Entertainment Permit for the provision of sexually explicit entertainment under the Liquor Act 1992.\nHowever, under section 3 of the Sex Work Act 1994 [Victoria] stripping without toy play is not classified as sex work and could be exempt from requiring this permit.\nWith the Tigers' season now over, both the AFL and Richmond are expected to investigate the incident.\n'The Club has become aware of a video from 2015 that is circulating on-line involving Dustin Martin. The AFL has been informed and we are working cooperatively to understand the circumstances,' Richmond said in a statement.\nTigers coach Damien Hardwick admitted ahead of the club's elimination final loss that the Martin situation had been a distraction.\n'These thing happen from time to time in footy clubs,' he said on Fox Footy.\n'We've dealt with a few issues [before] and we'll deal with more issues again in the future, but the reality is the guys will move on with it.\n'It has been a little bit of a distraction but the fact of the matter is, the guys are here to get a job done and so are we.'\nFooty legend Garry Lyon described the fiasco as the AFL's 'worst nightmare'.\n'That would be, for all sorts of the reasons, the AFL's worst nightmare on the launch of this finals series,' Lyon said on SEN.\nThe Mad Monday scandal kicked off in this area of the hotel, easily indentifiable by the distinctive red beams shown in the video of Martin groping the woman\nLyon compared the Martin footage with the Jordan de Goey scandal earlier this season, in which the Collingwood star attempted to expose a woman's breast while away in Bali.\n'I don't know what to say to this other than you are responsible for your own actions,' Lyon added.\n'That was the thing from Jordan's perspective, unsolicited touching, whether you knew them or not, is not acceptable. That is why it will be an issue and that is why it will be a story that continues to rage throughout the day.'\nMartin's future at Richmond remains under a cloud. While he is contracted to the end of the 2024 season, he has been linked with a return to Sydney and a possible shift to either the Swans or GWS.\nTigers coach Damien Hardwick says he expects Martin to remain at the club in 2023 and 24\nHe has also been linked to a potential move to the Gold Coast, but coach Damien Hardwick said he expects Martin to be a Tiger in 2023 and beyond.\n'He's got two years of his contract to run so as far as I'm concerned all the speculation comes from the people sitting over that side of the table [media]. If you guys keep talking about it, it creates speculation,' he said.\n'The reality is I'm telling you that he's got two more years of his contract. He's not going anywhere.'\nMost watched Sport videos\n- Shilo Sanders ejected from game for throwing punch at player\n- Rampage Jackson's son brutally assaults wrestler in livestream\n- Father of Kansas State QB gets into fist-fight with his other son\n- Mother of trans athlete defends child in front of school board\n- Reporter's awkward clash with Titans coach Des Hasler\n- Footy star taken to hospital after suffering horrific head injury\n- See the miracle golden point finish by the Canberra Raiders\n- 'We missed the simple things' Pep Guardiola reacts to 2-0 nil loss\n- Moment beer can is smashed on Raja Jackson's head prior to assault\n- AFL star Izak Rankine leaves the country\n- Sean Dyche gatecrashes Kerry Katona's date on Celebs Go Dating\n- AFL CEO Andrew Dillon defends Snoop Dog"
    },
    {
      "url": "https://www.dailymail.co.uk/news/melbourne/index.html",
      "text": "Advertisement\nRELATED TOPICS FOR Melbourne\nMelbourne: News, Weather and updates on AFL Teams\nPage\nGeorgia Love shows off her revenge body following her split with husband Lee Elliot as she celebrates her birthday and appears to take another thinly veiled swipe at her ex\n25/08/25 04:25\nGeorgia Love confirmed her split from her husband Lee Elliot back in February after months of speculation. And on Friday, the 35-year-old showed her former man what he's missing as she turned heads at the opening night of Cirque Du Soleil's Corteo in Melbourne. The former Bachelorette star flashed a glimpse of her lace bra as she showed off her toned physique in a striped dress and black stockings....read\nThe AFL's Mad Monday is on again. Here's a look back at the code's biggest post-season party scandals - from drunken disgraces to a dwarf being set on fire\n25/08/25 03:41Here's why the mere mention of the words 'Mad Monday' sends shivers down the spines of officials at AFL clubs.Hollywood superstar John Cena confirms long-standing rumour about Melbourne\n25/08/25 03:40Melbourne is renowned as an Aussie city where coffee lovers can rely on grabbing a first-class brew just about anywhere.Melbourne shopper screams at security guard in explosive clash over his uniform: 'It's a white supremacist thing'\n25/08/25 02:56A video showing a woman confronting a security guard has sparked a debate.Jackie Woodburne doesn't look like this anymore! Neighbours star is unrecognisable as she ditches the brunette crop she's had for decades and reveals grey hair\n25/08/25 02:37Neighbours star Jackie Woodburne has debuted a shock new look, just one month after the long-running Australian soap opera ended production.Snezana Wood's daughter Eve, 19, returns to her hometown of Perth where her estranged biological father lives after sharing her heartbreak over their rift\n25/08/25 01:23Snezana Wood's daughter Eve has returned to her hometown of Perth where her estranged biological father lives.Explosive new claims emerge about Erin Patterson's life in jail - and why other female prisoners are not happy\n25/08/25 00:05Erin Patterson's former inmate has made shocking claims about the murderer's life behind bars.Our adult ADHD symptoms were crippling. Diets didn't work, neither did drugs. Then we tried the miracle 'third solution' no one talks about\n24/08/25 13:55There's an easier way to manage and reduce ADHD symptoms without medication, patients and experts say.Footy pundits make shocking prediction about Jamarra Ugle-Hagan's chances of playing AFL football in 2026\n24/08/25 13:52Footy great James Hird has expressed his worries that Jamarra Ugle-Hagan will struggle to get interest from other footy clubs, should he part company with the Bulldogs at the end of the season.Legendary Leeds United star reveals why his surprise career change means he has no interest in getting back to football right now\n24/08/25 09:42Leeds great Mark Viduka currently has played with the ide of getting back into football but admits he has other priorities right now.Grim discovery as woman is found dead at St Kilda Pier - a day after another was located at Ten Mile Beach in NSW\n24/08/25 06:05Two women have been found dead in eerily similar circumstances over the weekend.Loved ones of Erin Patterson's victims are set to confront the evil mushroom lunch killer during explosive hearing... with one major exception - as classmates reveal what she was like as a teenager\n24/08/25 04:10Erin Patterson will be forced to listen to victim impact statements from the loved ones of the three people she murdered.Why Brumby's Bakery is struggling - as its former boss launches a scathing attack on parent company Retail Food Group\n23/08/25 09:51In its heyday, Brumby's Bakery consisted of more than 320 stores across Australia and New Zealand and was as popular as its major rival, Bakers Delight.Bulldogs coach gives strong indication about the future of troubled superstar Jamarra Ugle-Hagan\n23/08/25 05:01The Western Bulldogs have given their strongest suggestion to date that troubled forward Jamara Ugle-Hagan will not be at the club next seasonGogglebox star rushed to hospital for emergency surgery following shock cancer diagnosis: 'It was a big scare'\n23/08/25 03:42A Gogglebox star was rushed into hospital this week to undergo emergency surgery in Melbourne after she was diagnosed with cancer.A man saving lives in Victoria as a firefighter is one of Home and Away's most famous stars - Here's why he turned his back on fame\n23/08/25 03:25Andrew Morley once lit up Australian screens, starring in two of the country's most iconic soaps, Neighbours and Home and Away.Experts issue dire warning about technology ahead of major childcare reforms\n23/08/25 01:40National Children's Commissioner Anne Hollonds said that the bold childcare reforms could work as potential deterrents to predators but must be matched with compulsory courses.Adrian Portelli's new reno show in trouble as Block rival series gets delayed after angry neighbours complained about billionaire's involvement: 'Something went wrong'\n22/08/25 16:06Adrian Portelli's new Channel Seven renovation series, My Reno Rules, has delayed production ahead of its 2026 debut.His wealthy Asian parents spent a fortune to give Ryan Yi Cho an elite education and medical degree. Now he faces vile allegations of hidden cameras and grubby pics taken secretly in Australian hospital toilets\n22/08/25 15:52A junior doctor accused of secretly filming oblivious co-workers had led a charmed life off the back of his hard working parents.Footy star Grace Belloni reveals why Hollywood heartthrob Zac Efron ended up spending a LOT of time at her house\n22/08/25 07:22Emerging Essendon Bombers AFLW player Grace Belloni had some very famous company at home last year.I see the dregs of society dragged through the courts every day - but the evil thugs behind Melbourne's latest terrifying crime wave shock even me, writes PAUL SHAPIRO\n22/08/25 06:49I've covered serious crime for almost a decade but I've never felt more ill than I do now witnessing Melbourne families traumatised by violence sweeping the city, writes PAUL SHAPIRO.The Block host Scott Cam reveals the surprising habit he picked up while filming in Daylesford\n22/08/25 06:40The Block host Scott Cam has opened up about the habit he picked up while filming in the regional Victorian town of Daylesford during this year's series of the reno show.Olympia Valance reveals the eye-watering price of her coffee table as she tries to offload it on Instagram\n22/08/25 05:37Olympia Valance has revealed the eye-watering price she once paid for a marble coffee table as she tries to sell it after becoming a mother.Young Aussie lies on her application to get a job - but it quickly became her biggest mistake\n22/08/25 05:06She thought one little lie on her resume would help her score easy money. Instead, the job quickly spiralled into a nightmare she never saw coming.'Hundreds' more charges expected for doctor accused of taking grubby toilet pics of his co-workers - as his parents fly in to help him beg a court for his freedom\n22/08/25 03:16A junior medic who allegedly took seedy snaps of doctors and nurses in hospital toilets now faces more than 130 charges - and a court was told the final total could top more than 500.Major Aussie star's stunning sister is a dead ringer for her famous sibling - can you guess who it is?\n22/08/25 02:50The striking sister of an Australian singer and actor has been sharing glimpses of her modelling life on social media, and their resemblance is uncanny.See the moment an AFL coach gets busted SPYING on rival team ahead of one of the biggest games of the year\n22/08/25 02:30Tension between the Western Bulldogs and Fremantle could boil over this Sunday as the teams face off, with the loser done for the season.Sophie Cachia and AFLW star Madison Prepakis pocket cool profit with sale of four-bedroom Melbourne home\n22/08/25 00:37Influencer Sophie Cachia and her partner, AFLW star Madison Prespakis, have pocketed a cool $1.165million after selling off their Melbourne home last week.Jelena Dokic cuddles up to her new 'love' Yane Veselinov as she continues romantic holiday in Bali\n21/08/25 23:30Jelena Dokic is clearly head over heels for her new boyfriend Yane Veselinov, as the pair soak up the sun on a romantic getaway in Bali.Desperate race to find extremely valuable treasure believed to be in a single remote Australian paddock\n21/08/25 14:58Residents from Bendigo to Ballarat and Melbourne 's outer west flooded social media, with a search of paddocks and animal poos underway.Qantas passenger lashes out at business class meal claiming it's a 'joke' - but not everyone agrees\n21/08/25 14:55The passenger, who was travelling from Melbourne to Singapore, sparked a backlash with their complaint.Baby boy is born in a VERY unusual location after husband's split second decision when his wife went into labour\n21/08/25 14:36The couple had to change their birth plans at the last minute.Is this the solution to our housing crisis? Aussie family creates a home that can be built in just weeks\n21/08/25 14:17Without bold action the housing dream could vanish for an entire generation.Infuriating moment Melbourne couple have their car stolen out from under them as they were packing it for their trip to Bali\n21/08/25 10:28Watch the shocking moment a Melbourne couple had their car stolen from their driveway while they were packing for their first family holiday.Waleed Aly doesn't look like this anymore! TV star reveals new VERY casual appearance as he's spotted for first time in weeks with rarely seen wife after losing job on The Project\n21/08/25 09:37Waleed Aly has been settling into some quiet family time after The Project was cancelled in June.See the shocking moment footy star Jamarra Ugle-Hagan gets caught up in 2.30am nightclub shooting\n21/08/25 07:44Vision has emerged of the moment Western Bulldogs forward Jamarra Ugle-Hagan was caught up in an alleged 2.30am shooting at a Melbourne nightclub.Read a mum's breathtaking excuse for setting a woman on FIRE after a furious row over an e-scooter\n21/08/25 05:38Jordan Spencer, 34, poured petrol on Paris Carpio's head and set her on fire outside a Middlesex Crescent home in Shepparton, in Victoria's north, on January 15, 2024.Dramatic moment good Samaritans stop car thief from stealing a luxury Mercedes-Benz off the street - as Aussies blast out-of-control crime in Melbourne\n21/08/25 02:21A man in a hooded jumper and track pants tried to drive off with the black sedan on Swan Street in Richmond, Melbourne, shortly before 5pm on Tuesday.DoorDash driver reveals 'absolutely shocking' reality of trying to make a living\n21/08/25 01:12A DoorDash driver has opened up on the brutal reality.Inside the jaw-dropping Brighton home that hides a spectacular secret behind its humble Victorian facade\n21/08/25 00:56A pleasant-looking property located in the upmarket Melbourne suburb of Brighton looks like any other classic and charming residence - from the outside...Aussie chiropractor suddenly dies in mysterious accident while on holiday in Vietnam\n20/08/25 14:49A Melbourne chiropractor, aged in his 20s, has died while on holiday in Vietnam.Why you are BANNED from knowing that one of the country's most notorious killers is dead - who spawned one of the greatest lines in Australian movie history\n20/08/25 14:02A gangland assassin who inspired a character in the hit Australian movie Chopper is believed to be dead but court orders prevent the publication of his name or details about his decades of crime.Tones and I flaunts her trim pins in thigh-skimming mini skirt as she debuts glam new look following incredible weight loss - and fans are forced to do a double take\n20/08/25 08:36Tones and I continues to turn heads with her dramatic transformation.Cleaning expert reveals the cheap household item that will banish mould inside the washing machine instantly\n20/08/25 07:01Cleaning expert Chantel Mila, from Melbourne, Australia, says mould inside a washing machine can be dealt with swiftly using two natural and inexpensive household products.Chilling moment accused killer parades his kids for the camera just moments after he allegedly murdered their mum in the next room\n20/08/25 06:49The man accused of murdering his wife in front of their two children presented them with gifts and paraded them on social media after committing the alleged crime.One of Australia's biggest fertility giants makes shock decision after catastrophic IVF bungles\n20/08/25 06:42An independent review into two separate embryo mix-ups at Monash IVF has been completed.Aussie business owner exposes her 'Birthday Reindeer' stalker after unbelievable saga unfolded when she asked a customer for a deposit - and the whole world is watching\n20/08/25 05:53A Melbourne business owner has shared her disbelief following the exchange with the customer.Footy legend predicts Jamarra Ugle-Hagan is on the verge of tragedy if he doesn't change his ways after 'almost being shot' in 2.30am nightclub incident\n20/08/25 05:37Jamarra Ugle-Hagan's horror year got even worse outside notorious Melbourne nightclub the Love Machine in the early hours of Sunday morning.AFL WAG is called 'entitled' after complaining about price of common café item: 'Your husband makes $500,000'\n20/08/25 04:00An AFL WAG has been called 'entitled' after complaining about a popular café item's price on the menu.Kym Marsh puts on a leggy display in a floral minidress as she films dramatic scenes for Channel 5 series Imposter in a beachside carpark in Melbourne\n19/08/25 15:12Kym Marsh put on a leggy display in a red floral minidress as she filmed dramatic scenes for her new Channel 5 series Imposter on Tuesday.The wannabe Sherlocks and Agathas think they know why Erin Patterson became a killer. CANDACE SUTTON has the evidence that proves they've fallen for a narcissist's lies\n19/08/25 14:34Forums dedicated to all things Erin include wild theories about what drove her to kill three members of her ex's family. One recurring narrative centres on her supposedly unhappy childhood.Tammy Hembrow 'plotting to overthrow' Bec Judd as queen of the WAGs with 'Brownlow red carpet heist' as her romance with AFL star Bailey Smith heats up\n19/08/25 12:03Tammy Hembrow is reportedly gearing up for a jaw-dropping appearance at this year's Brownlow Medal, that could rival Bec Judd's unforgettable red dress moment from 2004.Jamarra Ugle-Hagan makes telling admission about controversial weekend nightclub shooting: 'I'm lucky I wasn't hit'\n19/08/25 09:21The Western Bulldogs forward also revealed that he was left feeling 'traumatised' after the incident.Sam and Snezana Wood sell their stunning home for $6.6 million as they plan to join Melbourne's elite in Brighton and eye up $14 million mansion\n19/08/25 05:12Sam and Snezana Wood have finally sold their stunning Melbourne home for a reported $6.6 million.WAG calls out insane price of a popular café item for children in Melbourne\n19/08/25 02:48An AFL WAG has called out the insane price for a popular café item for kids.Cops find two young kids next to the dead body of a woman, 32, inside a tragic house of horror - as man, 45, is arrested by detectives in suspected murder probe\n19/08/25 02:39A man has been arrested over the suspected murder of a woman in a home that contained two children.Footy legend says troubled AFL star Jamarrah Ugle-Hagan will NEVER play another game after he was caught up in 2am nightclub shooting\n19/08/25 02:38Western Bulldogs star Jamarra Ugle-Hagan has come under scrutiny again despite being cleared by Victoria Police of any involvement in the firearm incident.First footy star Bobby Hill broke up with the mother of his kids - now he has to 'deal with a split in his own family'\n19/08/25 01:04Collingwood livewire Bobby Hill is facing division on two fronts as he deals with the fallout of his relationship breakdown.Horror at Melbourne petrol station as man is stabbed to death\n18/08/25 22:59Police are investigating after a man was stabbed to death at a Melbourne service station early on Tuesday morning.I just wanted to buy a home - but the real estate agent blew up the deal with a surprise demand before I could make a bid. Here's the real reason WHY they did it though…\n18/08/25 13:13A Melbourne real estate agent has sparked outrage amid claims it demanded $2,000 from a potential home buyer.Balinese princess Lindy Klim buys first car with her own money after going broke and having to borrow cash from friends and family following split with second husband\n18/08/25 10:18Lindy Klim is getting back on her feet after a very difficult period in her life.Cathy Freeman is spotted out with her mystery man AGAIN just after making a rare public appearance in front of thousands of fans\n18/08/25 09:27Aussie Olympic superstar Cathy Freeman was spotted at the airport this weekend with the same mystery man she was pictured holding hands with last year.Huge mistake at petrol station INSTANTLY destroys cars and leaves drivers fuming - as cops are called and motorists told to stay away\n18/08/25 07:04Motorists fear they could be on the hook for thousands in repairs after the petrol station blunder in Melbourne.Troubled footy star Jamarrah Ugle-Hagan gets caught up in shooting at notorious nightclub after 'getting banned' from other nightspots\n18/08/25 06:20Western Bulldogs star Jamarra Ugle-Hagan was reportedly at the club while he struggles to overcome personal issues that have kept him off the field all season.ABC host gives Albo's finance boss reality check on housing market\n18/08/25 06:12ABC News Breakfast presenter James Glenday raised concerns about future projections of the housing market.Footy star Daly Cherry-Evans' emotional post-match act with his wife kicks off bombshell theory about his future in the game\n18/08/25 06:02Manly captain Daly Cherry-Evans has triggered a blaze of speculation about his future following an emotional moment with his wife after Sunday's loss to the Tigers.Wild moment ABC host gives Albo's finance boss a brutal reality check about the dire state of Australia's housing market\n18/08/25 04:39ABC News Breakfast presenter James Glenday raised concerns about future projections of the housing market.I'm sick and tired of all the home invasions in Victoria... there's a very clear solution to this, and if you won't say it, I will\n18/08/25 02:54A Victorian has thrown his support behind calls to introduce a major change in his state.Bec Judd offers to sell $7.3m Melbourne mansion for an eye-watering price tag\n18/08/25 02:35Bec Judd has named the price it would take to sell her family home in Melbourne's Brighton.Father savagely stabbed in head while protecting his family as machete-wielding gang storms family home in Melbourne\n17/08/25 21:06A father has been stabbed in the head and face after five masked intruders, including one armed with a machete, stormed his family home in Melbourne.Maria thought her first overseas trip would be to a tropical paradise - instead, she ended up flying to a hellish prison to feed her mum behind bars\n17/08/25 14:07A Melbourne woman has revealed the heartbreak of taking her first international flight not to a tropical beach holiday she once imagined - but instead to visit her mother in a foreign prison.Bailey Smith gets back to work with Geelong Cats following hot weekend hookup with Tammy Hembrow - after blowing up at onlookers during training\n17/08/25 13:43Bailey Smith was back to doing what he does best on Sunday.Chris Hemsworth's Centr app shuts down Melbourne HQ and sacks 15 staff - just months after star sold $100 million company\n17/08/25 09:10Chris Hemsworth's wellness empire is slimming down - but not in the way subscribers hoped.Aussie slams major airline after 'mistake' costs her more than $6,000 as she desperately tries to get her money back: 'They're ignoring us'\n17/08/25 02:47Melbourne woman Daniella Melfi explained that she, her partner, and children flew to America to visit her husband's family.How 'fit and healthy' mum's 'party trick' turned out to be a warning sign behind her devastating diagnosis at 39\n16/08/25 05:49Becky Strange, from Victoria, now faces a soul-crushing diagnosis after doctors dismissed her agony for years.Shock reason pop star Dannii Minogue has been spotted in her hometown of Melbourne - after living in the UK for 30 years\n16/08/25 05:39Dannii Minogue, who lived in the UK for 30 years, looked very sad on Thursday when she was spotted out and about in Melbourne.Ex-Today sports presenter Alex Cullen's desperate bid to find a tenant for the home he has a huge mortgage on - after he was sacked by Nine and forced to move to Melbourne\n16/08/25 04:07Alex Cullen desperately slashed the price for his $1.9 million Summer Hill rental property from $1,800 to $1,500-a-week recently, after struggling to find a tenant.Tammy Hembrow and Bailey Smith seen on second date as the AFL star flies to the Gold Coast AGAIN to see the fitness influencer\n16/08/25 02:09Tammy Hembrow and Bailey Smith can't seen to get enough of each other, as the pair were spotted enjoying their second date at a beach on Friday.Brazen thieves target footy legend's luxury car in broad daylight - leaving his young family 'rattled'\n16/08/25 01:24Footy legend Trent Cotchin and his family remain in disbelief after they were victims of a daylight robbery. Thieves targeted Cotchin's car, stealing a wallet and other items on August 14.Chilling footage of the horrific moment five hooded thugs hammered, stabbed and shot a man - as new details are revealed about exactly WHAT the savages were hunting\n15/08/25 08:46Graphic CCTV footage captured the brutal assault, as a group of thugs beat and stabbed a 60-year-old man.\nPage\nDON'T MISS\n-\nRio Ferdinand, 46, and wife Kate, 33, reveal they have moved to Dubai with their family as they show off their lavish mansion\n-\nCruz Beckham shares an intimate moment with Jackie Apostel after joining shirtless dad David aboard their lavish yacht\n-\nEmma Watson potters around in a sheer lace dress as she joins her hunky personal trainer for a hike in Saint Tropez\n-\nEXCLUSIVE\nI was desperate to know what this model got up to with England star. Now I've discovered truth, reveals KATIE HIND\n-\nSting is being sued for 'MILLIONS of pounds in lost royalties' by former bandmates in The Police\n-\nBeaches, history, waterparks, golf... Turkey (Türkiye) has it all: Here's why you'll never want to leave\nAd Feature\n- Selena Gomez stuns in black swimsuit on yacht for bachelorette party in Cabo... but was BFF Taylor Swift there? Looking good\n-\nWas this earliest sign of cracks forming between Meghan and Kate? Expert reveals signs that 'Fab Four' weren't getting on\n-\nEXCLUSIVE\nThe dark truth of Club Chalamet: She's a 58-year-old Timothée obsessive who HATES Kylie Jenner\n-\nCould an app really make you better with money? Putting a smart money app to the test\nAd Feature\n-\nBrooklyn Beckham and Nicola Peltz give fans a glimpse of their 'perfect Sunday' as couple unwind after family 'snub'\n-\nMeghan Markle 'placed status above reality' and struggled to separate her own image from Suits character, claims royal author\n- Zoe Kravitz seen arm-in-arm on romantic stroll in Rome with Harry Styles after getting cozy with Austin Butler See the pic\n- I Dream of Jeannie star Barbara Eden turns 94 and looks more glamorous than ever... see her now All change\n-\nGet your autumn on! From pumpkin throws to cosy hot chocolate mugs, here's our pick of homeware for the new season\nAd Feature\n-\nFrom Princess Margaret's sadistic streak to Meghan 'berating a gardener' - the most ill-mannered royals revealed\n-\nKaty Perry makes a braless fashion statement in curve-clinging dress... after Justin Trudeau romance rumors\n-\nWhy Millie Bobby Brown, 21, decided to shun Hollywood in favour of farm life in a nod to her British roots as she adopts a baby\n-\nBritney Spears reveals Sam Asghari 'felt like a fake distraction' to cope with being 'cut off' from sons\n-\nFrom auctions to EVs: 5 brilliant motoring brands every driver should know - from finance fixes to stunning electric SUVs\nAd Feature\n-\nBobby Brazier's love for Hare Krishna: From finding happiness through religion after tragic start - as soap star 'quits showbiz'\n-\nMum's the word! George, Charlotte and Louis join William and newly blonde Kate for church service in Balmoral\n-\nMillie Bobby Brown, 21, and Jake Bongiovi, 23, bond with baby daughter in NYC... days after announcing adoption\n-\nEmily Ratajkowski showcases her curves in leather dominatrix inspired lingerie\n-\nWhy Scottish Mortgage is backing the future of banking for long-term profits\nSponsored\n-\nStrictly Come Dancing bosses deliver verdict on future of BBC show after a male star was arrested on suspicion of rape\n-\nSuperman actor Dean Cain, 59, brutally mocked for struggling through training course after signing up with ICE\n-\nHidden detail in Kelly Clarkson's outfit which symbolizes 'healing and hope' after ex Brandon Blackstock's death\n-\nLily Collins' VERY famous father-in-law reveals he isn't a fan of her show Emily in Paris - but do YOU know who he is?\n-\nEastEnders star Cheryl Fergison reveals the devastating moment she found her husband in a 'dingy love nest' with another woman\n- Vogue Williams gives fans a glimpse at her early 40th birthday celebrations with family and friends Milestone celebration\n-\nPaul Merton reveals it 'felt natural' falling in love with third wife Suki Webster six months after becoming a widower\n-\nSir Elton John, Sir Rod Stewart and Jessie J join an array of music legends for tribute to 'funny and rude friend Steve Wright'\n-\nEXCLUSIVE\nIs 'Saint' Peter Andre REALLY an angel? Katie Price's ex mocked disabled son Harvey and told Junior not to kiss boys\n- Try Amazon Music Unlimited FREE for 30 days! Enjoy millions of songs, audiobooks and podcasts SHOPPING\n-\nPassenger princesses! Kate and Charlotte beam as Prince William drives family to church service in Balmoral\n- Bikini-clad Naomi Campbell, 55, shows off her age-defying physique as she enjoys a lavish trip to Ibiza She's still got it\n-\nVictoria and David Beckham look more smitten than ever after 26 years of marriage as they enjoy lunch with their children in Nerano\n-\nLove Island's Kaz Crossley and TOWIE's Elma Pazar among reality stars 'involved in horror crash'\n- Upgrade your home office with up to 50% off ergonomic desk chairs and standing desks (and we have an EXCLUSIVE extra code) SHOPPING\n-\nMyleene Klass shows off her harp playing skills as accomplished musician performs at 'dear friend' Clare Patterson's wedding\n-\nJackie Woodburne doesn't look like this anymore! Neighbours star is unrecognisable as she ditches the brunette crop she's had for decades and reveals grey hair\n- Queen's 20-year-old supercharged Range Rover sells for over ten times its typical market value at auction Pricey\n- Linda Robson reveals the real reason for major Loose Women changes amid fears for the show's future Speaking out\n- Shoppers flocking to Tesco after price slash on 'DELICIOUS' award-winning £20 Irish cream liqueur that's giving Baileys a run for its money SHOPPING\n-\nIconic supermodel's son shows he's inherited her chiseled looks as he's marched into court on assault charges\n-\nTyson Fury's daughter Venezuela, 15, goes Instagram official with 'mystery boyfriend' - and his profession runs in the family\n-\nThe Walking Dead star's son makes disturbing threat after being charged with assault\n-\nSuki Waterhouse treats fans to a raunchy performance as she takes to the stage in black fishnet tights and microscopic shorts\n- Why pay full price? This hack lets small businesses lease top tech for as little as £2.16 per MONTH - and no, there's no catch! SHOPPING\n- Jameela Jamil raises alarm over Serena Williams' weight loss drug promotion British star has blasted Williams\n-\nBritney Spears poses nude in new photo after sparking fan concerns over disheveled living conditions\n-\nLeigh-Anne Pinnock flashes her abs in a skimpy red bra as she she continues her tour of UK festivals with solo gig at Reading\n- TV host Jenni reveals secret to bikini body...no chips or crisps for 34 years! Still looking toned and trim\n- Shiseido launches upgraded viral skincare - get 20% off plus a free gift with our exclusive code SHOPPING:\n- Tulisa wears a strapless lime bustier as she she returns to the spotlight at Manchester Pride Looking good\n-\nDating Naked line-up REVEALED: Controversial Married At First Sight star joins new series of Rylan Clark's show\n-\nFeuding royal rivals William and Harry go to war. Sound familiar? CHRISTOPHER STEVENS reviews King & Conqueror\n- Zendaya says she loved getting to do 'normal' things during her time with fiancé Tom Holland in Scotland Close couple\n- Is YOUR mattress causing you sleepless nights? Don't miss out on the best Emma Sleep deals with up to 25% off - prices start at £50 SHOPPING\n-\nEXCLUSIVE\nLuisa Zissman shares bikini snaps amid skinny-shaming row - after sparking debate for smashing kids' iPads\n-\nJeering Dragons' Den panel called my business a 'delusional disaster' - now I'm worth £40million!\n- Pop star under fire as fans call out penis-shaped stage design on opening night of tour It got off to a very memorable start\n-\nPregnant Sophie Habboo accidentally posts full frontal picture of husband Jamie Laing to fans as they enjoy Bank Holiday weekend\n- Inside Kristin Cavallari's wild Las Vegas weekend The 38-year-old reality star splurged the cash during her lavish trip\n-\nJenni Falconer, 49, displays her flawless physique in a skimpy leopard-print bikini as she soaks up the sun during summer break\n-\nSelena Gomez's fiancé Benny Blanco is SLAMMED for purchasing $200 blueberries: 'I can't afford regular fruit'\n- Julianne Moore admits her wedding dress was a HUGE mistake after skipping tradition to wear white Big regret\n- Kylie Jenner gives rare update on beloved dog Norman that she got at age 17 She's had the pet since she was a teenager\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n-\nAll the celebrities who have REVERSED their cosmetic surgery from Chloe Ferry to Molly-Mae Hague and even Victoria Beckham\n- A-list celebrities rush to check on Kyle Sandilands following reports 'he was off-air due to stroke' Worrying\n-\nTaylor Swift's true feelings REVEALED over Kansas City Chiefs docuseries that explores Travis Kelce romance\n-\nMark Wright and Michelle Keegan put on a loved up display as they enjoy romantic date night at Coldplay's Wembley gig\n-\nEXCLUSIVE\nFormer Baywatch star Nancy Valen ditches Hollywood glamour in rare sighting - see her now\n-\nClaudia Schiffer shows support for her husband Matthew Vaughn's team by posing in a Brentford shirt\n- Gloria Estefan may sue Diddy accuser who name dropped her and husband Emilio The court officially dismissed all allegations\n-\nThe downfall of Marco Pierre White Jr: Son of Michelin star chef has shirked his upbringing to have multiple brushes with law\n-\nJosie Gibson admits she's 'stepped back' from TV work and reveals plans to live 'off-grid as humanly possible'\n-\nEXCLUSIVE\nWilliam Shatner, 94, and his ex-wife spark REMARRIAGE rumors as she steps out wearing huge diamond ring\n-\nBraless Myleene Klass heads to work in a bandeau top and mini skirt after Frankie Bridge broke her silence on their 'feud'\n-\nLady Gaga breaks down during concert after revealing what fiance said moments before she took the stage\n-\nCelebrities who have dated people who look JUST like their siblings with eerie similarities - but do you agree with the comparisons?\n-\nScarlett Thomas' staggering payday as her father Ryan insists she hasn't had a free ride - after nepo baby, 16, skipped GCSEs\n-\nCall me sweet and I'll tell you to f*** off: Dame Helen Mirren, 80, issues a very blunt response to 'condescending' comments about age\n-\nX Factor star who faced off with Simon Cowell looks unrecognisable after reinventing himself as a 'spiritual healer'\n-\n'Irresponsible' Sam Faiers and Billie Shepherd shock fans with their 'dangerous' holistic healthcare advice\n-\nMike Tindall reveals his 'sliding doors' moment when he first met Zara Tindall in 2003\n-\nDuncan James SPLITS from boyfriend after six years together as Blue singer shares post about 'growth' to fans amid heartache\n-\nAlec Baldwin shares sensual moment with wife Hilaria as couple reenact Dirty Dancing in what appears to be a desperate audition for DWTS\n-\nSerena Williams buries feud with Maria Sharapova with shock appearance as Russian enters tennis Hall of Fame\n-\nThe Hollywood stars you had no idea appeared on reality TV shows before they were famous\n-\nEXCLUSIVE\nThought the Biggest Loser was harsh? TV's self-declared 'lard police' Steve Miller insists he has 'no regrets' about his controversial Fat Families show\n-\nConor McGregor poses with 'yacht neighbour' David Beckham and sons Romeo and Cruz as UFC star hails football legend's 'dynasty'\n-\nColdplay's Chris Martin makes a cheeky swipe about the kiss-cam scandal before helping with a proposal and sharing sweet moment with autistic fan\n-\nFreddie Starr died 'penniless and estranged from his six children' as stranger stepped in to bring his body home from Spain and foot funeral bill\n-\nNelly Furtado, 46, delights fans with Noughties nostalgia as she storms the stage in a racy cut out top and mini skirt at the Big Feastival\n-\nSaturday Night Live boss Lorne Michaels says there will be a bloodbath of cast members within weeks\n-\nStacey Solomon and Joe Swash having another baby 'not off the table' following loved up display on luxurious family holiday\n-\nBobby Brazier, 22, 'is quitting showbiz and moving to India to pursue the Hare Krishna religion'\n-\nThis is just a saga now: Games critic Peter Hoskin checks out Echoes Of The End, an ambitious new video game from Iceland\n-\nThe exact treatments behind Karren Brady's transformation: The Apprentice star receives 'state-of-the-art technology for fat removal', says her very own cosmetic surgeon\n-\nLuisa Zissman reveals she smashed up her childrens' iPads in front of them because they 'p****d her off' - as controversial post sparks huge debate\n-\nNeighbours star Ian Smith shares major health update after being diagnosed with terminal lung cancer\n-\nOscar-winning actor looks unrecognisable in 90s comedy that has since become a cult classic - can YOU spot who he is?\n-\nRyan Thomas' nepo baby actress daughter Scarlett, 16, reveals she didn't sit her GCSEs\n-\nAlison Hammond, 50, is happier than ever with boyfriend David Putman, 28, and 'can't imagine her life without him as friends predict engagement'\n-\nEXCLUSIVE\nWas Hulk Hogan MURDERED? Estranged daughter Brooke has NEW information amid police investigation into death... here's all the evidence\n-\nEXCLUSIVE\nVile plot against Kylie Jenner with two-word code name... orchestrated by Timothee Chalamet's die-hard fans who say it's punishment for doing the unthinkable\n-\nUniversity Challenge's most memorable players: From irritating habits to disastrous blunders and wise cracks, the BBC boffins who stole the show\n-\nJacqueline Jossa and hubby Dan Osborne enjoy family holiday - months after a make-or-break getaway saved their marriage following brief split\n-\nMaya Jama 'considers moving to Manchester to be closer to footballer boyfriend Ruben Dias' as romance becomes more serious\n-\nStrictly Come Dancing gets 'major format shake-up' for this year's series that could 'disrupt chemistry' between celebrity and pro dance partners\n-\nStrictly Come Dancing star arrested on suspicion of rape in fresh blow for scandal-hit show just weeks before series returns to screens\n-\nNick Ferrari, 66, marries longtime love Clare surrounded by celeb pals including Piers Morgan, Myleene Klass and Christopher Biggins in idyllic venue in the south of France\n-\nKENNEDY: Shame on Serena Williams! She may be starving herself on prescription anorexia drugs. But this putrid stunt proves she's still a greedy beast\n-\nNetflix fans rave over 'simply fantastic' period drama hailed as 'a beautiful piece of storytelling' with huge Hollywood star in lead role\n-\nEXCLUSIVE\nFlorence Pugh's brother Toby Sebastian who starred in Game of Thrones has drastic new career change\n-\nThe tale of two Taylors! From Hollywood showmances to rebelling against studios - the incredible parallels between Taylor Swift and Elizabeth Taylor\n-\nNetflix fans gripped by 'harrowing and nightmarish' Vanessa Kirby sex work thriller - gushing over her 'powerhouse performance'\n-\nArnold Schwarzenegger's son Chris is unrecognizable in shockingly thin appearance after weight loss... see him now\n-\nAbbey Clancy wows in a bikini as she poses with husband Peter Crouch and their four children during idyllic summer holiday\n-\nKing Charles and Queen Camilla tell of 'deepest admiration for the unbreakable courage and spirit of the Ukrainian people' in Independence Day letter\n-\nMillie Bobby Brown weighs in on letting her kids pursue acting in resurfaced clip... after adopting baby girl at just 21\n-\nSopranos star Jerry Adler dies at 96: Late-blooming actor worked with Woody Allen and appeared on The Good Wife\n-\nEXCLUSIVE\nHome And Away tease the return of iconic couple Brax and Ricky after a decade away from Aussie soap\n-\nEXCLUSIVE\nI was the resident therapist on Celebrity Fit Club, the stars binged on pizza after weigh-ins and one was sacked after getting a gastric band mid-series\n-\nJack Osbourne honours late father Ozzy with heartfelt tribute in rare public appearance... one month after rock legend's death at 76\n-\nBradley Cooper, 50, and Gigi Hadid, 30, jet out for getaway together as age-gap romance heats up\n-\nEXCLUSIVE\nPride and Prejudice first look: Jack Lowden and Emma Corrin transform into Mr Darcy and Elizabeth Bennett for heated first scenes\n-\nMeghan and Harry's Michelin-starred wedding chef who features in new Netflix series reveals duchess's secret kitchen skills\n-\nEXCLUSIVE\nRaye forced to halt her performance as a fan collapses in the crowd at All Points East Festival\n-\nFKA Twigs puts on a very racy performance at All Points East after being drafted in as last minute replacement for Doechii\n-\nMeghan Markle's high street capsule wardrobe revealed: From staple crisp shirts to her go-to ballet flats\n-\nI'm A Celebrity star Dean McCullough speaks out as police investigate sick death threats\n-\nBrooks Nader's ex Gleb Savchenko seen on DWTS set after she claimed he was 'fired'\n-\nEXCLUSIVE\nTaking the Michael! ITV chiefs throw cash at comedian McIntyre in bid to nab him from BBC... but hit a snag because super-rich comic only cares about ratings\n-\nKylie Jenner's mini-me daughter Stormi steals the spotlight in her first commercial for mom's makeup\n-\nLil Nas X stripped completely nude on street before LA arrest in shocking new footage\n-\nLeigh-Anne Pinnock puts on an X-rated display as the former Little Mix star headlines Pride in Manchester\n-\nCoronation Street bosses face backlash for casting actor 'who broke another man's eye socket' as upcoming storyline reflects real life\n-\nLiam Gallagher extends major olive branch to his brother Noel during Oasis reunion tour - after years of feuding\n-\nGrief-stricken Kelly Clarkson appears shaken as she's seen for FIRST TIME since tragic death of ex-husband Brandon Blackstock\n-\nTALK OF THE TOWN: Moving in the right direction - Harry Styles set to start work on mega-mansion\n-\nSophie Turner reveals why she will never leave the UK again after moving back to London following divorce from ex Joe Jonas\n-\nJennifer Garner appears fresh-faced on solo outing after her kids celebrate dad Ben Affleck's low-key birthday\n-\nGRIFF RHYS JONES: My night with four young people (I paid, of course)...and why, in spite of all their witless opinions, I deplore the way their futures are being stifled\n-\nKatie Price displays her surgically-enhanced assets in a grey top as she steps out in London amid bitter feuds with her exes\n-\nEXCLUSIVE\nNew series depicts Princess Diana as an American mom with an addict daughter in Arizona - but friend behind the show insists he's not cashing in on her memory: KATIE HIND\n-\nEastEnders star Cheryl Fergison, 59, reveals she has suffered a worrying stroke - amid financial struggles\n-\n'Oh she's out!' Michelle Keegan lets her hair down as she posts selfie with a beer before partying at Coldplay's Wembley gig\n-\nLovely jubbly! Sir David Jason, 85, is in great spirits as he's mobbed by fans before his new show at Manchester's Lowry Theatre\n-\nMAFS UK expert Charlene Douglas in a wheelchair after being rushed to hospital as she gives health update\n-\nGeorgia Toffolo flaunts her toned abs in a skimpy white bikini as she shares snaps from sun-soaked holiday\n-\nJowita Przystal celebrates her birthday on wild night out as Pete Wicks shows off the moves she taught him on Strictly after pair reignited romance rumours\n-\nSam Thompson shows off new physique as he poses with equally buff brother-in-law Ryan Libbey after crashing sister Louise's family holiday\n-\nDid William the Conqueror really have an Asterix moustache? No, say historians - and that's just one of BBC blockbuster's howlers\n-\nKhloe Kardashian nearly upstages her friend at her birthday party as fans go wild over her 'amazing' look\n-\nJeremy Clarkson checks out the competition! Star samples a Britpop lager as he takes a break from his Cotswolds farm duties to enjoy Blur star Alex James' festival\n-\nEmily in Paris resumes filming in Venice two days after Netflix show's 'assistant director collapses and dies' in front of horrified crew\n-\nKylie Jenner gets roasted AGAIN after reposting snaps from her most-hated fashion shoot\n-\nThe dark past of William and Kate's 'forever home': Slavery links, an equerry who blew his brains out and a royal break-up...\n-\nThe Kooks frontman Luke Pritchard reveals why Rebel Wilson joined the band on stage and admits they only rehearsed an hour before\n-\nStunning wealth of Coco Gauff, 21, revealed as she's named the world's highest-earning female athlete\n-\nNepo baby son of Walking Dead star and 90s iconic supermodel arrested for assault\n-\nDua Lipa turns 30! Hitmaker sizzles in a sheer halter dress as she celebrates milestone birthday with intimate dinner while paying tribute to parents\n-\nSydney Sweeney who? Awards panel unveils 25 greatest films list with stars over 60 amid Hollywood's youth obsession\n-\nClaudia Schiffer sports a football shirt as she cheers on Brentford with husband Matthew Vaughn at the Gtech Community Stadium - after filmmaker invested in Premier League club\n-\nSophie Ellis Bextor stuns in glitter mini dress she makes surprise appearance at Reading Festival to perform Murder on the Dancefloor\n-\nAnd Just Like That... woke storylines killed the SATC reboot: From Miranda's 'late life lesbianism' to Charlotte's family gender issues - the moments that left viewers cringing\n-\nI met Amanda Holden when the Britain's Got Talent cameras weren't rolling - she showed her true colours straight away\n-\nLove Island's Yasmin Pettet reveals emotional reason she 'hasn't been intimate' with boyfriend Jamie Rhodes after leaving the villa\n-\nCountry superstar says chance meeting with Taylor Swift at Travis Kelce's charity camp lit up collab hopes\n-\nEXCLUSIVE\nSecret Lives of Mormon Wives explodes with lesbian twist as stars KISS in steamy first look at Season 3\n-\nImpossible contestant sent home empty-handed after struggling with a Harry Potter question on axed BBC show - but could YOU have guessed it?\n-\nBBC star Michael Ball reveals his mother has died as devastated singer is flooded with support by fans\n-\nSydney Sweeney's Americana director defends flop after box office crash\n-\nQueen Camilla is stylish in blue as she steps out at the final day of the York races\n-\nVicky Pattison leaves fans 'horrified' as she lets a dog lick her mouth in 'stomach churning' clip\n-\nBrookside legend Sue Johnston set to reprise iconic role after 35 years in historic Hollyoaks crossover\n-\nDrake back in bed with Bobbi Althoff after viral feud as they tease new project\n-\nLeona Lewis reveals how motherhood has changed her - as she gears up for her first-ever Las Vegas residency"
    },
    {
      "url": "https://www.dailymail.co.uk/sport/dustin-martin/index.html",
      "text": "Advertisement\nDustin Martin\nDustin Martin, born June 26, 1991, is a retired AFL legend who played for the Richmond Tigers. Renowned for his explosive power and game-changing ability, Martin won three AFL Premierships and three Norm Smith Medals. With over 300 games and numerous accolades, including the 2017 Brownlow Medal, he is celebrated as one of the greatest players in AFL history.\nDustin Martin News, Stats and Updates\nPage\nDustin Martin 'will make a big-name return' to footy after his surprise appearance at Richmond match\n21/05/25 05:37\nAFL identities Kane Cornes and Caroline Wilson have declared on Channel 7's The Agenda Setters that Richmond legend Dustin Martin (pictured left) is poised to return to the sport this season. It follows 'Dusty's' recent appearance in the MCG sheds before a Tigers game (right)....read\nDustin Martin looks fit enough to still play AFL as he steps out with ex-team-mate after making a mysterious trip across the country\n17/04/25 15:37Richmond legend Dustin Martin stepped out for a quick coffee with old Tigers team-mate Jack Riewoldt.Emerging Richmond star strikes unexpected brand partnership after suffering unfortunate X-rated moment during his AFL debut\n18/03/25 13:56The 2024 No 1 draft pick shone during the Round 1 clash, kicking two goals on his AFL debut, while also amassing 18 disposals.New unlikely TV rivalry rears its head as two of Australia's top sport commentators go head-to-head in a war of words\n17/03/25 10:03The frosty spat related to No 1 Draft pick, Sam Lalor's, debut this weekend for Richmond, with the 18-year-old rising star putting the footy world on notice.The X-rated act from prized Richmond recruit Sam Lalor that left viewers watching on live TV shocked\n14/03/25 01:24The hype is justified when it comes to Richmond young gun Sam Lalor - but the teenager shocked many viewers on Thursday night when celebrating a goal on his AFL debut against Carlton.Dustin Martin looks fit enough to play tomorrow as footy great becomes obsessed with a very different new sport\n11/03/25 04:46He hasn't played a game of football since round 21 last year, but Tigers great Dustin Martin looked like he could claim a spot on any AFL side when he was spotted in Melbourne recently.Footy great drops big hint on Dustin Martin's future career - as Fox Footy's broadcast line-up is revealed\n19/02/25 12:01Both Fox Footy and Channel 7 have revealed their broadcasting line-ups for the 2025 season and the big news is that Bruce McAveney will return to 7 for 2025.The AFL rich list: There are now more millionaires playing footy than ever, as new figures reveal top stars are benefitting from a salary explosion\n10/02/25 15:30That too has been translated into how much some of the game's biggest and best stars are being paid.Dustin Martin is on the verge of a HUGE real estate payday after making a killing by selling his first home\n13/12/24 05:56Footy legend Dustin Martin is laughing all the way to the bank after selling the first home he purchased at Albert Park - just 4km south of Melbourne's CBD - for a significant profit in recent days.Richmond make huge call on Dustin Martin's iconic No 4 shirt after draft prospect puts his hand up to take retiring legend's guernsey\n03/12/24 11:37The Victorian club will also hold off on handing out jersey numbers for his former team-mates Jack Riewoldt (No 8) and Trent Cotchin (No 9) for the 2025 season.Footy fans have a HUGE problem with Dustin Martin's stunning 'new AFL career' - as star's manager breaks his silence over shock switch\n13/11/24 10:56The image sparked large speculation that Martin, a three-time Norm Smith Medallist, could be set to step into broadcasting, following his retirement in August.Dustin Martin spotted in secret a meeting as the Tigers legend could be 'set to start a completely new footy career'\n12/11/24 09:51Speculation has swirled in recent months that Martin, 33, could re-ignite his footy career after announcing his retirement in August.AFL team launches new logo to a VICIOUS reaction from their fans: 'Congrats to the 10yo child who put this together'\n07/11/24 01:16The Adelaide Crows are undertaking a brand shake up after a disappointing 2024 season and have officially launched their new team logo - but many fans aren't happy about the design.Dustin Martin breaks silence on rumours he could come OUT of retirement as Richmond legend gives two-word verdict on reunion with Damien Hardwick on the Gold Coast\n01/10/24 11:24There were emotional scenes when Martin, 33, hung up his boots at the end of the 2024 season, calling time on a glittering 15-year career.Adelaide Crows new AFL logo gets leaked - and the team's fans are NOT happy with the result\n27/09/24 03:21Adelaide Crows fans will be hoping for a better 2025 season after missing the finals again this year, but the club is not off to a good start after its new logo was leaked - and lashedDustin Martin caught up in very sad AFL grand final development after ditching the Brownlow Medal\n24/09/24 03:07Dustin Martin was a highly noticeable absentee from the Brownlow Medal 2024 ceremony on Monday night - and there could be a very good reason why the retired Richmond star brushed the event.Footy star leaves no dry eye in the house at the Brownlow Medal as he opens up on 'deep void' after shock retirement\n23/09/24 14:59Angus Brayshaw brought the house down at the Brownlow Medal on Monday night as the newly-retired Melbourne hero opened up on how he's adapted to life out of the game.Dustin Martin's great friend and ex-teammate Trent Cotchin reveals his stunning take on the chances of the Tigers legend coming out of 'retirement'\n19/09/24 05:46Cotchin and Martin combined to bring three premierships to the Tigers in the space of four years. Now the ex-Richmond skipper has spoken out about speculation his mate will join the Suns.Footy legend slams Dustin Martin's comeback plan: 'I don't know what he's thinking'\n17/09/24 07:20Premiership-winning AFL great Paul Roos has urged the Gold Coast Suns to call off their pursuit of retired Richmond champion Dustin Martin because 'it sends the wrong message'.Why this VERY rare photo of Dustin Martin enjoying himself has the footy rumour mill in overdrive about Tigers great's shocking retirement backflip\n16/09/24 05:53Social media photos of the former Richmond Tigers premiership winner relaxing are about as rare as a North Melbourne win, so it's no wonder this snap has fuelled speculation among footy fans.The one key question Gold Coast Suns will ask Dustin Martin before deciding whether to offer footy legend 2025 swansong\n15/09/24 08:46Martin, 33, announced his playing career was over on August 6, then bid an emotional farewell to Tigers fans at the club's final game of the year on August 24.Dustin Martin makes a shock move that confirms many fans' suspicions about his retirement from footy\n13/09/24 04:56Richmond Tigers legend Martin bid an emotional farewell to the club's fans at their last game of the year on August 24 - and now, just weeks later, he has made a move that will leave them stunned.Dustin Martin's bikie uncle proves he IS Aboriginal and therefore cannot be deported from Australia\n28/08/24 08:50The hearing has reportedly been vacated after Dean Martin provided further evidence to the court last week which proved his Aboriginal descent.Dustin Martin breaks down in tears and gives fans a VERY rare and emotional message as he bids farewell to footy\n24/08/24 23:07'Dusty' gave the Richmond Tigers everything in a 14-season, 302-game, three-premiership career - and topped it off with a very heartfelt statement as he said goodbye to his fans at the MCG on Saturday.Dustin Martin's teammate reveals the big secret Tigers great kept about his retirement - and guarantees there's one thing he WON'T do after leaving footy\n19/08/24 02:55Dustin Martin became the AFL's man of mystery as speculation swirled about his retirement - and now his fellow Tiger Tom Lynch has opened up about what was going on behind the scenes.Trent Cotchin: Dustin Martin's teammate and great friend has an eye-opening three-word prediction for how he'll deal with retirement\n15/08/24 03:16'Dusty' has been the subject of intense speculation about his future since he retired on August 6 - and now fellow Tigers great Trent Cotchin has given his take on what lies ahead for his mate.Tom Hawkins reveals the private text message he received from Dustin Martin after announcing his retirement from AFL\n11/08/24 00:32AFL star Tom Hawkins has revealed the private text he received from Dustin Martin after announcing his retirement from the sport.See what's next for Dustin Martin after his retirement bombshell - as footy great says AFL legend will make a shocking move\n06/08/24 03:08Dustin Martin's retirement announcement is effective immediately, leaving him at a loose end that is sure to see him chased for on and off-field roles. Here's how he has set himself up for life after footy.Tom Hawkins: Another footy great drops retirement bombshell just after Dustin Martin announced he's quitting the AFL immediately\n06/08/24 01:29Tom Hawkins has pulled the pin on a glittering AFL career that started in 2007 and saw him win three flags with Geelong. He recently suffered a serious injury but hopes to return to the field this year.Dustin Martin finally puts speculation about his footy future to rest with stunning announcement\n05/08/24 23:54Richmond Tigers superstar Dustin Martin has ended months of speculation about his playing future by making a major announcement to teammates at Punt Road today.AFL superstar bikie's uncle argues he can't be deported because he is Aboriginal\n30/07/24 15:10Ex-national president of the Rebels bikie gang Dean Martin, the uncle of Richmond Tigers star Dustin Martin has mounted a court challenge to avoid being deported to New Zealand .Why Lidia Thorpe claims ex-boyfriend bikie Dean Martin - uncle to AFL star Dustin Martin - cannot be deported from Australia\n24/07/24 03:43Dean Martin is a union delegate for the embattled CFMEU and is a former national president of the Rebels bikie gang. He is also the uncle of Richmond AFL legend Dustin Martin.Dustin Martin's bikie uncle arrested and faces deportation from Australia over alleged organised crime links\n23/07/24 09:36Dean Martin, 56, was the former national president of outlaw motorcycle gang the Rebels. He held office-bearer positions for over a decade with the firm.Dustin Martin is accused of giving up on Richmond over one VERY controversial act that has infuriated the club\n23/07/24 00:45There has been a lot of speculation about Martin's future as he finishes his nine-year deal with the Tigers at the end of this season - and there's a sign the flag-winner has already checked out.Richmond coach hits back at Dustin Martin accusation: 'Don't really care'\n21/07/24 04:45Richmond coach Adem Yze has defended the decision to allow superstar veteran Dustin Martin to travel to New Zealand while he struggles to shake a nagging back injury.Revealed: Dustin Martin's mystery overseas trip that meant he had no chance of proving his fitness for Richmond as doubts grow over footy legend's future\n18/07/24 09:00Richmond legend Dustin Martin was unable to prove his fitness for this weekend's game against Port Adelaide as he had been away in New Zealand.GWS Giants hint at footy's worst-kept secret in cheeky dig at Dustin Martin before triumphing over Richmond at the MCG\n14/07/24 10:52GWS have developed a reputation as one of the most creative clubs in the AFL, and they nailed it once again with a cheeky banner ahead of their win over Richmond on Sunday.Damien Hardwick REFUSES to deny Dustin Martin rumours after footy world was rocked by news Richmond superstar is '100 per cent' set to join the Gold Coast Suns in 2025\n03/07/24 09:57Martin is in the final year of his contract, the suggestion of a move north lingering ever since Hardwick took over from the axed Stuart Dew this season.Dustin Martin is '100 per cent' heading to the Gold Coast Suns in 2025, says AFL great: 'It's done'\n03/07/24 03:10Tigers superstar Dustin Martin will leave Richmond to sign with Gold Coast at the end of the 2024 season, according to Demons great David Schwarz.Dustin Martin's AFL future narrowed down to TWO options... and it's bad news for Richmond fans\n02/07/24 10:48Dustin Martin 's future have reportedly been narrowed down to just two options, and neither include Richmond, according to a new report from Channel 9.Richmond fans face nervous wait over Dustin Martin after 'uncomfortable' footy superstar made sad decision\n30/06/24 09:47While Patrick Cripps produced a masterful display in the wet, Martin could only watch on as he struggled through Sunday afternoon's game at the MCG.Richmond's new Dusty dilemma is another sign his incredible career is quickly coming to an end\n27/06/24 06:09Rumours and speculation surrounding the future of Richmond superstar Dustin Martin have been in overdrive this year - and coach Adem Yze has thrown petrol on the fire with a new revelation.How footy superstar Dustin Martin has set himself up for life with a multi-million-dollar property portfolio - as retirement looms\n21/06/24 00:43While speculation continues to swirl over the playing future of AFL star Dustin Martin there is one thing for sure, he won't be short of a dollar when he does retireFooty great Brendan Fevola reveals the telling sign that Dustin Martin played his last game in Richmond colours in 300th game milestone\n18/06/24 02:34Carlton legend Brendan Fevola has bad news for Richmond fans, he believes Dustin Martin 's 300th match for the club was also his lastAFL star Dustin Martin's 300th game no celebration as Richmond is belted by Hawthorn\n15/06/24 11:39Martin had the MCG crowd of 92,311 roaring in the Saturday twilight game when he kicked the opening goal, but the Hawks were too good.It all goes to script for Richmond champion Dustin Martin who boots the opening goal in his 300th match for the Tigers\n15/06/24 07:15The stage was set and Richmond talisman Dustin Martin launched himself straight into the spotlight, kicking the opening goal in his 300th match at the MCG on SaturdayFooty great Trent Cotchin lauds former Richmond teammate Dustin Martin ahead of his 300th game - and offers an insight into what makes the AFL superstar tick\n13/06/24 00:51Retired Richmond premiership captain Trent Cotchin has given a heartfelt tribute to good friend and ex-Tigers teammate Dustin Martin, but wishes he would share more of himself.Dustin Martin's manager makes major revelation as doubts surround footy superstar's AFL future\n10/06/24 12:49Dustin Martin has been eager to stay away from the spotlight and will not conduct a pre-match press conference while he is unlikely to be interviewed post-game.Dustin Martin is seen at the pub with footy bad boy Dane Swan in a rare public outing - as the Tigers star tries to hide something under the table\n03/06/24 05:53Photos of Martin out having a good time in public are as rare as a Richmond win this season - but now one has surfaced amid heavy speculation about the Tigers great's future.Footy great Brendan Fevola drops a bombshell about Dustin Martin's retirement from the AFL - and Tigers fans should look away now\n28/05/24 03:38Brendan Fevola has poured petrol on rumours surrounding Martin's exit from the league. The 32-year-old has struggled for form so far this year, giving rise to speculation about his future.Dustin Martin turns back the clock and silences critics in Dreamtime thriller: 'Looks like the Dusty of old'\n26/05/24 02:15Once again, Dustin Martin has let his football do the talking as he nearly led Richmond to a stunning AFL upset win over Essendon.See the incredible proof that West Coast young gun Harley Reid really is the new and improved Dustin Martin\n20/05/24 07:21West Coast No.1 draft pick Harley Reid has had an explosive start to 2024, drawing some comparison to his superstar idol Dustin Martin - now there's proof about how similar they are.Footy great reveals the tragic struggle behind his great mate Dustin Martin's poor form - as calls grow for Tigers champion to retire\n16/05/24 04:02Footy great Trent Cotchin has known Richmond's triple Norm Smith medallist for almost a decade and a half - leaving him with a rare insight into why Martin isn't hitting his usual stellar form this season.Dustin Martin's manager makes a VERY unusual statement as footy greats urge the Tigers champion to retire\n15/05/24 04:05So far this year the Richmond champion has been a long way off the form that saw him win a Brownlow and three Norm Smith Medals - turning up the volume on calls for him to give the game away.Footy great Trent Cotchin reveals why he thought Dustin Martin had the mental age of a 13-year-old when he joined the AFL\n13/05/24 11:19Richmond legend Cotchin had the luxury of playing alongside the footy great during their time together at the Tigers , in which they helped deliver three premierships for the Punt Rd team.Tigers legend Trent Cotchin drops a bombshell about his great mate Dustin Martin's future at the club\n18/04/24 01:32Cotchin and Martin won three flags together for the Tigers - and now the ex-skipper turned commentator has driven speculation with an eye-opening prediction about his time at Punt Road.AFL star Sam Durham confirms new relationship with Melbourne model Paris Bishop as they attend movie premiere together\n17/04/24 00:04AFL star Sam Durham is officially off the market and has recently gone public with his new girlfriend, Australian fashion model Paris Bishop.Footy great Matthew Lloyd tells the Tigers to make the hardest call of all about Dustin Martin\n16/04/24 00:59AFL great Matthew Lloyd believes Richmond need to have a tough conversation with Dustin Martin as the champion midfielder's impact on matches starts to drop in the twilight of his career.Dustin Martin could QUIT footy with 'fed up' Richmond superstar 'ready to walk away' in move that would rock the AFL\n08/04/24 12:25Martin, 32, remains one of the AFL 's biggest names having claimed the Norm Smith Medal in Richmond's three premiership triumphs of 2017, 2019 and 2020.Richmond great Trent Cotchin recalls the bizarre Dustin Martin act that made him 's**t myself' when they were living together\n14/03/24 03:44Footy legend Trent Cotchin and Dustin Martin go way back and have won three premierships together in a golden era for the Tigers - but their mateship also endured some strange moments.The cheeky photo posted by Damien Hardwick that has left Richmond supporters FURIOUS as they prepare to take on Gold Coast Suns\n09/03/24 00:25New Gold Coast Suns coach Damien Hardwick has posted a cheeky image to social media ahead of their clash against Richmond - and not all Tigers fans are happy about itRevealed: Footy's highest earners unmasked... and you won't believe how many millionaires are in the game!\n12/02/24 09:22Figures released by the league on Monday showed gross player payments have grown by more than $100 million over the last decade, from $181,560,623 in 2013 to last year's $280,862,089.Richmond star Dustin Martin looks thrilled to see a 'healthy' Ben Cousins make a cameo at his former team's training session - as AFL great shares some uplifting words\n17/01/24 03:28He has turned his life around after overcoming a drug addiction.It's a New Year and everybody starts on zero competition points. Here is what your AFL club will be most hoping for during the 2024 season\n29/12/23 04:49The New Year is a time for fresh beginnings and resolutions, which goes for your favourite footy club as well.Angry footy fans lash out at detail in photo of AFL's No.1 draft pick Harley Reid as he is picked by the West Coast Eagles\n21/11/23 04:44West Coast Eagles fans have high hopes that Reid can play a leading role in turning the struggling club around - but one detail from Monday night has left other supporters up in arms.Footy great Trent Cotchin reveals why he wanted NOTHING to do with superstar Dustin Martin off the field when they first became teammates\n09/11/23 04:06Retired Richmond captain Trent Cotchin has admitted that he once wanted nothing to do with his good friend and ex-Tigers teammate Dustin Martin off the field.How Dustin Martin stood out from other footy stars at the Brownlow Medal ceremony with one simple act\n26/09/23 05:50While the Brownlow Medal is typically a gala night for football players and their partners to shine on the red carpet, Richmond Tigers star Dustin Martin took a very different approach to the event.Damien Hardwick makes a call on getting Dustin Martin to follow him to the Suns after the Tigers superstar was spotted on the Gold Coast\n14/09/23 02:10Incoming Gold Coast Suns coach Damien Hardwick has confirmed Dustin Martin will be at Richmond next season. It comes as Martin closes in on 300 appearances for the Tigers.AFL hero has secret meeting with former coach as mystery surrounds his future\n07/09/23 10:45Martin, 33, has been the subject of intense speculation over the past 18 months, with the two-time Brownlow Medalist reportedly keen to get away from the Melbourne bubble.Dustin Martin and another Tigers great spotted on the Gold Coast - fuelling speculation 'Dusty' could join Damien Hardwick at the Suns\n06/09/23 00:42AFL superstar Dustin Martin has been spotted 'taking a little holiday' on the Gold Coast, sparking talk he may join former Richmond Tigers coach Damien Hardwick at the Suns.Richmond drop Dustin Martin bombshell on eve of crunch AFL clash with the Western Bulldogs\n03/08/23 10:00The absence of Martin, in particular, is a blow to Richmond's chances after interim coach Andrew McQualter spoke glowingly of the 32-year-old's form at his weekly press conference.Collingwood fan's wild ride in Richmond star Dustin Martin's $150,000 Range Rover after stealing it from a St Kilda petrol station and ramming a police car\n25/07/23 04:23Dustin Martin's $150,000 car was used by a drug addict Collingwood supporter to ram a police car during a wild crime spree across Melbourne.Video shows Tigers superstars Dustin Martin and Jack Riewoldt enjoying the roped-off luxury of business class on flight to Perth while the rest of their teammates are stuck in economy\n17/07/23 01:42AFL teams are usually desperate to avoid any perception of special treatment for their biggest stars - but Richmond didn't hide the privileges the two veterans got on their way west to play the Eagles.Dustin Martin's rare act as Richmond superstar pays tribute to Tigers teammate Trent Cotchin after the veteran played his 300th game for the club\n17/06/23 13:42Cotchin has led the club to three flags during his time at Punt Road and Martin - who registered a sublime 34 disposals on Saturday night - spoke to Channel 7 after the game about the club leader.AFL greats say Dustin Martin will leave Richmond after Damien Hardwick's shock resignation - and another big-name Tiger could be following him out of Punt Road\n30/05/23 00:41Leading AFL pundits believe Dustin Martin could be next out the door at Richmond following the shock resignation of coach Damien Hardwick last week.Damien Hardwick reveals superstar Dustin Martin's very cheeky suggestion for the first thing he should do after quitting as Tigers coach\n23/05/23 04:34Departing Richmond Tigers coach Damien Hardwick has shared the cheeky advice given to him by AFL star Dustin Martin about what he should do next.EXCLUSIVE: Inside the intriguing relationship between Dustin Martin and Brett Finch - as more photos emerge of AFL superstar partying with the disgraced NRL player's wife\n21/05/23 08:56Dustin Martin and the wife of disgraced footy player Brett Finch were an item a decade before they were dogged by unfounded rumours they had rekindled their romance.Former Richmond VFL star comes back to haunt his old club as Essendon snatch ONE-POINT victory over the Tigers in thrilling Dreamtime at the 'G battle\n20/05/23 13:02Former Richmond VFL player Sam Durham has marked and kicked a goal with seconds left to give Essendon a one-point win over the Tigers in their Dreamtime at the 'G AFL clash.EXCLUSIVE: Inside story of why rumours are running rampant that Dustin Martin and Brett Finch's wife are an item - as photos surface of their romantic Bali holiday years ago\n11/05/23 02:22Dustin Martin and the wife of disgraced footy player Brett Finch were an item years before they were dogged by rumours they had rekindled their romance.AFL superstar Dustin Martin is reported to be dating the wife of disgraced footy player Brett Finch after the pair 'split' following his child sex offence conviction\n09/05/23 07:59The 31-year-old has previously been linked with a number of models, including Jessica Gomes, Chontelle Berryman and Elissa Burns, and now the Herald Sun claims he is seeing Elli Johnston.\nPage\nStars of sport\n-\nConor McGregor poses with 'yacht neighbour' David Beckham and sons Romeo and Cruz as UFC star hails football legend's 'dynasty'\n-\nManchester United target Senne Lemmens spotted watching Antwerp's game after being left out of squad with £17m Old Trafford switch looming\n- Jude Bellingham's dad 'tried to confront his other son Jobe's manager' after he was subbed at HALF TIME during dismal display He was 'upset' at full time\n-\nJordan Pickford reveals his role in convincing Jack Grealish to sign for Everton and the Premier League club the Toffees should emulate\n-\nMarcus Rashford is subbed off at HALF-TIME in nightmare evening as England star's new club Barcelona stage a stunning comeback win\nmore stars of sport\n-\nCristiano Ronaldo's trophy curse in Saudi CONTINUES! Last-gasp goal - and a penalty shoot-out - deny Al-Nassr despite his record-breaking goal\n-\nChelsea star Axel Disasi shares unseen snap from their 'bomb squad' dressing room - as he shares what life is REALLY like for Enzo Maresca's cast-offs\n-\nWayne Rooney's son Kai, 15, scores for Man United's under-18s to complete 5-0 rout - while 14-YEAR-OLD wonderkid bags a double\n-\nStunning football TV presenter Diletta Leotta defends her glamorous looks as 'respect for the viewer' after colleague called her and other hosts 'vulgar'\n-\nMorgan Gibbs-White opens up on his failed move to Tottenham as he reveals complications with his fiancée's pregnancy were a factor\n-\nTop 10 transfer hijackings: Sir Alex Ferguson's phone call which denied rivals, Man City's deadline day shock, and the club who keep getting gazumped\n-\nI was born with a thumb and three fingers on each hand as well as only seven toes due to a rare genetic condition - now I've earned a place at the US Open\n-\nRoberto De Zerbi says Marseille dressing room brawl which saw Adrien Rabiot and team-mate transfer-listed was like a 'bar fight', forcing bodyguards to step in\n-\nFormer Premier League winner set to make festival debut at Reading after becoming a DJ in huge career change\n-\nFootball fans left baffled by Sean Dyche's friendship with Kerry Katona as ex-Everton boss makes surprise appearance on Celebs Go Dating\n-\nGlasner gives blunt response to Eze's absence as he confirms Arsenal-bound star won't play for them again - and sends warning to Liverpool on Guehi\n-\nEze's absence for Crystal Palace's first ever European game was a crying shame, but their win vs Fredrikstad is part of his legacy in south London\n-\nMarc Guehi flashes cheeky grin as he delivers pointed message to TV cameras after Crystal Palace's European win amid Liverpool links\n-\nTottenham dealt fresh injury blow with star man ruled out until the NEW YEAR as Thomas Frank ramps up search for reinforcements after Eberechi Eze snub\n-\nRooney insists there is 'no way back' for Alexander Isak after Newcastle strike and blasts Yoane Wissa's 'very disrespectful' Instagram stunt\n-\nOlympic champion Imane Khelif responds to retirement claims as gender row boxer skips World Championships after introduction of sex testing\n-\nRaducanu handed ANOTHER nightmare Grand Slam draw at US Open - but Draper has quarter-final shot before meeting world No 1 Sinner\n- EXCLUSIVE England hit by kit supplier blunder on eve of Women's Rugby World Cup in major blow to fans Not a good look on the eve of the tournament\n-\nRoy Keane reveals unseen details of his Man United contract - including the extraordinary demand Sir Alex Ferguson allowed\n-\nRio Ferdinand reveals why he is relocating to Dubai as Man United legend confirms huge lifestyle change after dramatically quitting punditry job\n- Liverpool Champions League winner set to 'rip up contract' after spending entire season in the RESERVES Six years on from famous win in Madrid\n-\nIsak arrives at Newcastle alone after his bombshell outburst, as Alan Shearer calls behaviour 'nonsensical' and ££40m bid for Wissa is 'REJECTED'\n- Revealed: New Bayern Munich signing is dating club legend's 17-year-old daughter One of Bayern Munich's new signings\n- US Open star Sachia Vickery's sex-work confession sends shockwaves through tennis world Attempting to qualify for the US Open this week\n-\nNeymar confronted by angry Santos fans and 'threatened with violence' at training ground after worst defeat of his career left him in tears\n- Mo Salah's cheeky reaction to Declan Rice goes viral as fans spot Arsenal jibe at PFA Awards Salah and Van Dijk couldn't resist a smile\n-\nRevealed: Man United's Carlos Baleba alternative has an ARSENAL tattoo on his arm and grew up idiolising former Gunners star\n- Awkward clip of Tom Brady flirting with 'beautiful' NFL reporter on Zoom emerges NFL great spoke to her over Zoom, discussing his own career in football\n-\nMoment Jack Draper is TOLD OFF by US Open mixed doubles partner Jessica Pegula for making a cheeky comment after British No 1's quarter-final win\n-\nEmma Raducanu shares an awkward exchange with Jack Draper after British No1 ended her US Open partnership with Carlos Alcaraz\n- Glamorous Olympic athlete is banned for FOUR YEARS for testosterone doping - but has already lined up stunning career switch New move\n-\nPep Guardiola reveals his daughter's brutally-honest reaction to his bold moustache look that left fans stunned during the summer break\n-\nLiverpool fans mock Trent Alexander-Arnold's 'stinker' Real Madrid LaLiga debut as woeful numbers give new boy brutal reality check\n-\nEXCLUSIVE\nNewcastle hit back after Alexander Isak breaks silence with bombshell statement claiming 'broken promises' as he tries to force Liverpool move\n-\nJamie and Rebekah Vardy's potential new life in Italy: God-like status with fans, romantic boat trips and partying... just don't expect pizza from boss!\n-\nMo Salah named PFA Player of the Year for a THIRD time after firing Liverpool to glory as he joins Premier League royalty at awards in Manchester\n-\nGiggling Emma Raducanu and Carlos Alcaraz show how much they enjoy each other's company with plenty of chemistry in US Open mixed doubles defeat,\n-\nWas Jordan Pickford let down by his 'penalty cheat sheet'? England keeper handed a nasty surprise on his water bottle - before Leeds striker scored winner in Premier League return\n- Red-faced Gary Neville caught making dig at Leeds fans live on Sky Sports in hot mic moment - prompting instant apology Leeds beat Everton\n-\nIga Swiatek tells cameraman to stop filming her as Wimbledon champion removed clothes on court at Cincinnati Open\n-\nTyrone Mings shares pointed message after Jacob Ramsey's £39m Newcastle move - after Aston Villa captain John McGinn appeared to aim swipe at financial rules\n-\nYoane Wissa UNFOLLOWS Brentford on Instagram, deletes all club photos and turns profile picture to black amid Bees' £50m demands to Newcastle\n- Jamie Vardy lined up for major shock transfer to Champions League team - in what could be a dream move for wife Rebekah European giants\n-\nTeenage star 1-0 Trolls! The moment footballer, 16, who was mocked for having acne in her unveiling photos, scores brilliant free-kick on her debut\n-\nNeymar left in floods of tears after former Liverpool star scores twice to inflict biggest defeat of his career as Brazilian icon admits: 'I'm ashamed'\n- Ben Askren leaves fans stunned with new video of his recovery after life-or-death double lung transplant at 41 Former UFC fighter\n-\nGary Lineker takes aim at the BBC boss who sacked him in his review of first Match of the Day since he got the boot from £1.35m-a-year contract\n- Strasbourg fan group RIPS into Chelsea owners' 'destructive' and 'abusive' running of club despite qualifying for Europe last season Part of multi-club network\n-\nFans are all saying the same thing after Sky Sports' US-style half-time interview with Martin Odegaard during Arsenal's showdown with Man United\n-\nPaul Scholes offers blunt response to daughter wearing Arsenal shirt as Man United legend watched Red Devils' Premier League opener\n-\nEberechi Eze appears emotional applauding Crystal Palace fans amid Tottenham interest - while Liverpool target Marc Guehi seems to IGNORE Oliver Glasner\n-\nAston Villa captain John McGinn aims dig at financial rules as Newcastle confirm £39m Jacob Ramsey signing from Premier League rivals\n-\nMan United fans make feelings clear on Alejandro Garnancho's future - as wantaway star's poster is DEFACED amid Chelsea interest\n- Man United fans label new ticketing system 'a disgrace' as thousands stuck in queues ahead of season opener against Arsenal Chaos\n-\nRevealed: Little-known rule that saw Eberechi Eze's goal disallowed against Chelsea - as Premier League release statement\n- Man United co-owner Avram Glazer spotted at Old Trafford as Red Devils kick off Premier League campaign against Arsenal First game of the season\n- British UFC star Lerone Murphy delivers stunning spinning-elbow KO just minutes after identical rare finish Manchester-born star aged 34\n-\nMatch of the Day viewers give verdict on first show without Gary Lineker as Wayne Rooney is criticised by fans after his debut following £800,000 deal\n- Erling Haaland pokes fun at Noni Madueke's infamous social media post ahead of Man City's clash with Wolves Cheeky comment\n-\nRicharlison scores 'goal of the season' contender with stunning overhead kick against Burnley - as fans hail 'legendary moment' for Spurs star\n- Ryan Reynolds and Rob McElhenney jet in to cheer on Wrexham's first Championship home game of the season See their side lose\n-\nThe moment Moses Itauma became Britain's next boxing superstar, as he floors Dillian Whyte with devastating combos in brutal first-round knockout\n-\nMan United outcast Jadon Sancho all but confirms romance with rapper Saweetie by inking her name on his neck - and REMOVES tattoo to ex-girlfriend\n-\nJD Vance's NIGHTMARE round at Donald Trump's golf course: US Vice President mocked after committing ultimate sin during UK holiday\n- Chelsea legend SPLITS from his wife of 26 years: Premier League icon shares emotional update on social media End of the road\n- Golf star Scottie Scheffler snaps at reporter over 'ridiculous' Ryder Cup questions in awkward press conference moment World No 1\n- Dillian Whyte turns up the heat on Moses Itauma during tense face-off in Saudi Arabia ahead of their heavyweight showdown Fight on Saturday night\n- Darwin Nunez scores AGAIN as Liverpool flop makes flying start to life in Saudi Arabia, while Reds continue their pursuit of Alexander Isak Left Liverpool last week\n- Louis Rees-Zammit declares return to rugby with maverick English Premiership side as 'the obvious choice' Ended NFL dream after 18 months in the US\n-\nWayne Rooney hits back at Tom Brady: Feud ignites as England legend claims NFL great does NOT understand football after his 'work ethic' was questioned\n- Bitter John Terry reveals he has given up dream career switch after being hit by 'baffling' rejections: 'I didn't even get a sniff' Moving on\n- EXCLUSIVE Coleen Rooney revives Wagatha Christie investigator skills as a detective in hilarious Paddy Power ad She has targets in sight\n-\nRoy Keane set to become a grandad AGAIN - as Man United icon's daughter announces pregnancy alongside England star in emotional snaps\n-\nRevealed: How Mats Hummels 'reacted to his ex-wife's fury' after she complained their son, 7, 'had NOT been invited' to Borussia Dortmund farewell matchr\n- Married football manager's awkward interviews go viral as he desperately tries to avoid eye contact with stunning reporter Set tongues wagging"
    },
    {
      "url": "https://www.dailymail.co.uk/sport/afl/index.html",
      "text": "Advertisement\nRELATED TOPICS FOR AFL\nAFL Latest News, Results, Scores and Fixtures\nPage\nThe AFL's Mad Monday is on again. Here's a look back at the code's biggest post-season party scandals - from drunken disgraces to a dwarf being set on fire\n25/08/25 03:41\nHere's why the mere mention of the words 'Mad Monday' sends shivers down the spines of officials at AFL clubs....read\nRevealed: The star who'll be playing the NRL grand final - and he's NOWHERE near as well known as the AFL's Snoop Dogg\n25/08/25 01:45The AFL has had the wood on the NRL when it comes to musical star power at the year's biggest game for the last few years - and that trend shows no signs of being reversed in 2025.Bec Judd makes heartbreaking family confession during solo work trip\n24/08/25 14:31Bec Judd has revealed how she really feels about being alone on a work trip in Western Australia.Footy pundits make shocking prediction about Jamarra Ugle-Hagan's chances of playing AFL football in 2026\n24/08/25 13:52Footy great James Hird has expressed his worries that Jamarra Ugle-Hagan will struggle to get interest from other footy clubs, should he part company with the Bulldogs at the end of the season.AFL star Nick Holland and wife Rachel announce shock split after 16 years of marriage - labelling it a 'restructure'\n24/08/25 08:04AFL star Nick Holland and his lawyer wife Rachel have split after 16 years of marriage.AFL star Izak Rankine leaves the country following four-match ban for homophobic slur\n24/08/25 01:53Footy star Izak Rankine has made a shock decision following his ban for four games by the AFL for using a homophobic slur during a match.Bulldogs coach gives strong indication about the future of troubled superstar Jamarra Ugle-Hagan\n23/08/25 05:01The Western Bulldogs have given their strongest suggestion to date that troubled forward Jamara Ugle-Hagan will not be at the club next seasonTarryn Thomas posts bizarre promotional video and hints at comeback\n23/08/25 02:02Troubled former North Melbourne player Tarryn Thomas has re-emerged publicly, posting a promotional video and suggesting he is eyeing a return to footballRappers, reality stars and Iron Men: Inside Tammy Hembrow's tumultuous love life before her new romance with AFL star Bailey Smith - and the nasty 'wet wipes' song that was written about her\n22/08/25 10:16It's no news that Tammy Hembrow's love life has long been in the spotlight.The AFL said Snoop Dogg's controversial takes on gay people were all in the past. The rapper just proved them wrong at the worst possible time\n22/08/25 07:32The furore over the league's choice of Snoop to perform at the grand final just won't go away - and this time it's the hip-hop icon himself who has poured petrol on the fire.Bec Judd's infamous 2004 Brownlow Medal gown achieves 'iconic moment': 'LOL!'\n22/08/25 07:22The racy gown that put Rebecca 'Bec' Judd on the map at the 2004 Brownlow Medal red carpet has now been 'immortalised' in the most 'iconic' way.Olympia Valance reveals the eye-watering price of her coffee table as she tries to offload it on Instagram\n22/08/25 05:37Olympia Valance has revealed the eye-watering price she once paid for a marble coffee table as she tries to sell it after becoming a mother.Perth businessman sues Married At First Sight star for defamation over 'malicious' social media posts\n22/08/25 04:28Perth businessman Aidan Ciaran Murphy has filed a defamation lawsuit against Married At First Sight star Lauren Dunn over social media posts made last month.Woman who sits on a government taskforce has her Aboriginal heritage questioned in explosive claim at Fair Work Commission\n22/08/25 03:36A 1980s children's TV star, who now sits on a government taskforce, has had her Aboriginality challenged in a claim before the Fair Work Commission.See the moment an AFL coach gets busted SPYING on rival team ahead of one of the biggest games of the year\n22/08/25 02:30Tension between the Western Bulldogs and Fremantle could boil over this Sunday as the teams face off, with the loser done for the season.Footy coach breaks his silence after being sacked over vile Tammy Hembrow slur - as his shocking 'kitchen' comment about a women's footy star surfaces\n22/08/25 02:25John Baggetta lost his job when his unthinkable comment about Hembrow surfaced soon after her headline-grabbing date with AFL star Bailey Smith.Gay fans of the Adelaide Crows smash the club after Izak Rankine's homophobic slur drama\n22/08/25 01:14The four-match suspension handed down to Rankine has left some greats of the game furious. Now the Crows have been sent a damning message by some of their own supporters.Sophie Cachia and AFLW star Madison Prepakis pocket cool profit with sale of four-bedroom Melbourne home\n22/08/25 00:37Influencer Sophie Cachia and her partner, AFLW star Madison Prespakis, have pocketed a cool $1.165million after selling off their Melbourne home last week.Tammy Hembrow risks major wardrobe malfunction as she flaunts her extreme bust in tiny top - after new beau Bailey Smith dropped relationship bombshell\n21/08/25 14:23Tammy Hembrow recently updated her breast implants and she has been happily showing them off ever since.Adelaide boss breaks silence after player cops ban for homophobic slur and admits he is 'nervous' for the small forward - as footy great blasts the AFL over sanction\n21/08/25 10:35The AFL handed down its sanction on Thursday after five days of talks with the Adelaide Football Club.How playing a Britney Spears hit song has landed an exclusive city nightclub beloved by celebs in VERY hot water\n21/08/25 09:03A Melbourne nightclub which hosted international megastars including 50 Cent and Travis Scott and is frequented by celebs and AFL footballers has been targeted by police for playing a hit song.Controversial footy great turned radio host is accused of trying to turn AFL star Izak Rankine into the VICTIM after he hit opponent with a homophobic slur\n21/08/25 06:39Former Adelaide Crows star turned radio presenter Stephen Rowe has been slammed over remarks he made about the incident that has become the talk of the AFL.The AFL hands down SHOCK decision on banning star for using a homophobic slur during match\n21/08/25 06:03Izak Rankine is the sixth AFL star to be banned for an on-field homophobic slur since April last year.Sam Newman hits back after being cancelled yet AGAIN despite promising not to talk about the Welcome to Country and trans women in sport\n21/08/25 05:41Controversial AFL identity Sam Newman has returned serve after he was suddenly axed from a speaking engagement with a well-known footy legend.Tammy Hembrow's son rushed to hospital after shock accident\n21/08/25 00:07Tammy Hembrow's 10-year-old son Wolf has been rushed to hospital following an accident at school camp.Troubled AFL star Bobby Hill's partner breaks her silence on their split as she lashes out at 'beyond disgusting' fan abuse\n20/08/25 14:03Bobby Hill's ex Georgia Devlin has made her first public comment on her split from the Collingwood AFL star - after she was subjected to the worst kind of online trolling.Revealed: How AFL team will use Snoop Dogg as a defence as they try to get their star off the hook for using a shocking anti-gay slur during a match\n20/08/25 09:13The Adelaide Football Club is trying to reduce a proposed five-game suspension that is set to be handed to their player Izak Rankine.Footy legend Patrick Dangerfield reveals the secret he shared with AFL coach just hours before he was stabbed to death by his son\n20/08/25 06:41Patrick Dangerfield has reflected on what he calls the toughest period of his life, which came after the tragic death of former Adelaide Crows coach Phil Walsh at the hands of his son.Tammy Hembrow breaks down in tears during moment with her son Wolf, 10, amid blossoming romance with AFL star Bailey Smith\n20/08/25 05:29Tammy Hembrow was seen crying as she dropped her 10-year-old son Wolf off at school camp on Wednesday.Revealed: The brutal sledge AFL star copped before he uttered anti-gay slur that looks set to end his season\n20/08/25 03:18Adelaide Crows star Izak Rankine is facing a season-ending ban following a homophobic slur directed at a Collingwood player.Father of footy reporter who died in horror traffic accident reveals his heartbreak over dropping a lifelong habit that connected him to his son\n20/08/25 01:53The father of sports reporter Sam Landsberger has given a raw account of what he 'couldn't live with' after the tragic accident that took his son's life.Bailey Smith drops relationship bombshell and it may not be good news for new love Tammy Hembrow\n20/08/25 00:58Bailey Smith has shared some interesting insights into his dating life - and it may not be good news for Tammy Hembrow.Lindy Klim announces shock career move: 'You're about to laugh at my expense!'\n20/08/25 00:13Lindy Klim stunned fans on Tuesday night by announcing a shock career move.Tammy Hembrow 'plotting to overthrow' Bec Judd as queen of the WAGs with 'Brownlow red carpet heist' as her romance with AFL star Bailey Smith heats up\n19/08/25 12:03Tammy Hembrow is reportedly gearing up for a jaw-dropping appearance at this year's Brownlow Medal, that could rival Bec Judd's unforgettable red dress moment from 2004.Tammy Hembrow's best friend shares VERY interesting timeline detail about her marriage breakdown with Matt Zukowski - as fitness influencer moves on with AFL star Bailey Smith\n19/08/25 06:37Tammy Hembrow's best friend has made a very telling comment about the timeline of her marriage breakdown with Matt Zukowski.AFLW star Moana Hope claims she was subjected to 'vile' abuse and threats in front of her young kids while playing in footy final\n19/08/25 02:55Moana Hope has alleged she was threatened with 'physical violence' in what she described as a 'horrible' experience she endured as her children watched her play.Footy legend says troubled AFL star Jamarrah Ugle-Hagan will NEVER play another game after he was caught up in 2am nightclub shooting\n19/08/25 02:38Western Bulldogs star Jamarra Ugle-Hagan has come under scrutiny again despite being cleared by Victoria Police of any involvement in the firearm incident.Tammy Hembrow is labelled 'strategic' after she films herself crying following marriage breakdown to Matt Zukowski: 'She had that video ready to go'\n19/08/25 02:37Tammy Hembrow has been labelled 'strategic' following the breakdown of her marriage to Matt Zukowski.Footy stars get suspended for anti-gay slurs. So should they also be banned for the vile things they say about each others' wives and families? One respected AFL commentator says YES\n19/08/25 02:04Izak Rakine could be gone for the rest of the season if he's found guilty of making a homophobic slur - but one of footy's most authoritative voices says other insults should be on the banned list.First footy star Bobby Hill broke up with the mother of his kids - now he has to 'deal with a split in his own family'\n19/08/25 01:04Collingwood livewire Bobby Hill is facing division on two fronts as he deals with the fallout of his relationship breakdown.Troubled footy star Jamarrah Ugle-Hagan gets caught up in shooting at notorious nightclub after 'getting banned' from other nightspots\n18/08/25 06:20Western Bulldogs star Jamarra Ugle-Hagan was reportedly at the club while he struggles to overcome personal issues that have kept him off the field all season.If you think AFLW stars aren't as skilled as the men, a stunning series of videos has proved you WRONG\n18/08/25 03:06No.1 draft pick Ash Centra has sparked a viral trend after being captured on video just before the first match of the AFLW season last Thursday night.Bec Judd offers to sell $7.3m Melbourne mansion for an eye-watering price tag\n18/08/25 02:35Bec Judd has named the price it would take to sell her family home in Melbourne's Brighton.Tammy Hembrow sets tongues wagging as she flaunts massive diamond ring on her left hand while wearing her new AFL beau Bailey Smith's jacket\n18/08/25 02:07Tammy Hembrow has been making headlines over the last two weeks after being spotted not once, but twice with AFL star Bailey Smith.Footy fans reveal what's driving them away from the AFL - from grog and violence to the sport becoming 'too American'\n18/08/25 01:43A new AFL Fans' Association survey has found that one in five supporters believe attending games this year has been a worse experience than it was last season.Tammy Hembrow brutally roasted over THAT crying video filmed during her marriage to Matt Zukowski: 'Drama queen'\n17/08/25 23:59Tammy Hembrow shocked fans over the weekend after posting a video montage of the moments she broke down in tears throughout her marriage to Matt Zukowski.AFL investigates one of the league's biggest stars for shocking alleged homophobic slur during match\n17/08/25 22:15The top-of-the-table clash between Adelaide and Collingwood on Saturday night could have some very unwelcome ramifications for the Crows and one of their best players.Bailey Smith gets back to work with Geelong Cats following hot weekend hookup with Tammy Hembrow - after blowing up at onlookers during training\n17/08/25 13:43Bailey Smith was back to doing what he does best on Sunday.Tammy Hembrow and Bailey Smith seen on second date as the AFL star flies to the Gold Coast AGAIN to see the fitness influencer\n16/08/25 02:09Tammy Hembrow and Bailey Smith can't seen to get enough of each other, as the pair were spotted enjoying their second date at a beach on Friday.Tammy Hembrow shares shock video of herself sobbing and shaking during her marriage to Matt Zukowski: 'Never thought I'd share this'\n16/08/25 00:35Tammy Hembrow has shared a shocking video montage of the moments she broke down in tears throughout her marriage to Matt Zukowski.Footy coach is SACKED after posing a truly unthinkable comment about Tammy Hembrow on Facebook - after the Daily Mail revealed her secret date with AFL star Bailey Smith\n15/08/25 06:51A Western Australian footy coach has been sacked after making a vile comment about fitness influencer Tammy Hembrow on social mediaTammy Hembrow's ex Matt Zukowski makes bombshell divorce claim - just days after fitness influencer's steamy date with AFL star Bailey Smith: 'It was unhealthy for me'\n15/08/25 04:34Matt Zukowski made a shocking claim about his divorce from Tammy Hembrow on Thursday, just days after she was spotted locking lips with AFL star Bailey Smith.Why transgender athlete believes she will be BANNED from the Olympics despite representing Australia for eight years\n15/08/25 02:56A transgender athlete blocked from playing AFLW is now fearing a fresh ban that would stop her from representing Australia at the Los Angeles OlympicsBrendan Fevola lists stunning five-bedroom Melbourne home for $4.5million\n15/08/25 00:30Brendan Fevola and his wife Alex have listed their stylish Melbourne home on the market for $4.5m, four years after purchasing it.Most parents would be mortified if their little boy gave the middle finger to strangers. Here's why a footy star had a range of T-shirts made up when his son did it in front of thousands of fans\n14/08/25 15:11Jeremy McGovern's son, Hudson, stole the show on Sunday afternoon, while his dad completed a lap of honour at the Optus Stadium.Former footy player learns fate over drink driving crash that killed the 'love of his life'\n14/08/25 11:34Ray Card has been sentenced to nine years in jail after the ex-Geelong player, who had been four times over the legal drink drive limit, caused a car accident in November 2024.Bailey Smith blows up at onlookers at Geelong Cats training session amid intense interest in his romance with Tammy Hembrow\n14/08/25 09:39Bailey Smith isn't weathering the storm of attention around his new romance with Tammy Hembrow.Footy star says anyone who disagrees with the AFL hiring Snoop Dogg to play at the grand final is a RACIST\n14/08/25 05:43Some fans and experts have blasted the AFL for turning its back on its commitment to stamping out sexism and homophobia by choosing the hip-hop legend to rap at the MCG.Telling sign that Tammy Hembrow and Bailey Smith are not a one time thing and may be in a secret relationship\n14/08/25 02:00Tammy Hembrow has given a very telling sign things are getting serious between her and AFL star Bailey Smith.NRL boss Peter V'landys says his code is smashing the AFL - but a damning new revelation proves he is actually WAY off the mark\n14/08/25 00:49Australian Rugby League Commission chairman Peter V'landys has been trumpeting the NRL's success in recent years after stealing a march on the AFL with its games in Las Vegas.Tammy Hembrow shocks as she strips off and flashes bare bottom - after packing on PDA with Bailey Smith\n13/08/25 23:22Tammy Hembrow was showing off her new haul of clothes on Thursday when she gave fans a little more than they bargained for.Bailey Smith's ex girlfriend Izzy Armitage makes explosive claims as his romance with Tammy Hembrow is revealed: 'The gloves are off'\n13/08/25 22:50Bailey Smith's ex girlfriend Izzy Armitage has seemingly ripped into the AFL star after he hooked up with Tammy Hembrow on the Gold Coast over the weekend.College football star breaks down during press conference\n13/08/25 15:34The punter arrived in Nebraska over the summer, having grown up nearly 10,000 miles away in Frankston South in the state of Victoria. He grew up playing Australian Rules football.Collingwood star Bobby Hill faces a devastating setback as he remains out of the game after breaking up with the love of his life\n13/08/25 13:48Hill has not played for the Magpies since their June 21 match against St Kilda, with the club saying he has been dealing with 'personal issues'.Footy WAG claims she had to move on from her job because of her social media posts\n13/08/25 07:18Paris Tier, the girlfriend of AFL star Conor Stone, has gone public with the drama she experienced with her former employer.AFL WAG Kellie Finlayson reveals HUGE news after her stage four cancer diagnosis\n13/08/25 05:41Kellie Finlayson has provided a major life update following her devastating stage four lung and bowel cancer diagnosis.David Koch 'makes move to SACK ex-Channel Nine star from AFL club' after he was accused of standing by disturbing conspiracy theories\n13/08/25 03:31There's been a major update on the boardroom drama at Port Adelaide, where the former Sunrise star serves as the club's chairman.College football star breaks down in tears after being caught off-guard by reporter's question at press conference\n12/08/25 23:40The punter arrived in Nebraska over the summer, having grown up nearly 10,000 miles away in Frankston South in the state of Victoria. He grew up playing Australian Rules football.Tammy Hembrow slams interest in her romance with Bailey Smith - after the wannabe WAG was viciously trolled\n12/08/25 14:11Tammy Hembrow has slammed the 'boring' attention on her new romance with AFL star Bailey Smith.NRL fans are warned not to celebrate star's history-making achievement - and the reason why is proof the nanny state has gone MAD\n12/08/25 11:45Alex Johnston needs only three tries to equal Ken Irvine's long-standing record, having scored the most tries of any player in Australian rugby league's top flight.Chris Judd reveals the fork-in-the-road moment that put him on the road to riches\n12/08/25 08:49Idolised as one of the greatest AFL players to have graced the game, former West Coast and Carlton superstar Chris Judd has opened up on his life after footy, and what motivates him now.Ben Cousins reveals horror incident that made him lose two years' worth of memories - and he even forgot he went to rehab for his drug problem\n12/08/25 07:37The controversial footy great has opened up about his memory loss for the first time, revealing he was in tears after the terrifying episode.TV star makes an embarrassing mistake about the end of a VERY high-profile AFL romance\n12/08/25 06:27Footy broadcaster Garry Lyon was apologetic after his on-air stuff-up on Tuesday. To make matters worse, it involved the brother of one half of a famous former footy romance.Aussie swimming queen Kaylee McKeown finds love with ex-footy star after heartache\n12/08/25 06:13Aussie swim queen Kaylee McKeown recently had some stunning victories at the World Championships - and now she has revealed she's been a winner away from the pool, too.The AFL gets blasted for turning its back on women by paying 'sexist' Snoop Dogg to play at the grand final\n12/08/25 05:33The official confirmation that the hip-hop icon will provide the halftime entertainment at the biggest game of the year wasn't warmly greeted by all footy fans.The three Australian children who no longer have any parents and the heartbreaking truth behind their mum's sudden death\n12/08/25 05:19Three Aussie siblings are left with no parents and shattered hearts after their loving mum's sudden death.NEW Tammy and Bailey pics reveal public act that stunned onlookers. Plus, 'wannabe WAG' group chats explode over our scoop - and rumours swirl about WHY she chose him over other star players\n12/08/25 04:19It was the story that had even the most prudish of AFL fans whispering into their iPhones, 'Hey Siri - who is Tammy Hembrow?' Now we can reveal the full story of Tammy and Bailey's dirty weekend.How Snoop Dogg revealed which AFL team he barracks for almost a DECADE ago - as footy fans are divided over his gig at this year's grand final\n12/08/25 02:50The words 'Snoop Dogg' don't exactly spring to mind when you think of high-profile Aussie Rules fans, but the rapper will be hoping one team raises the premiership cup on grand final day.Tammy Hembrow breaks her silence after being trolled over new romance with Bailey Smith\n12/08/25 01:40Tammy Hembrow has broken her silence after being trolled over her new romance with AFL star Bailey Smith.Shocking new footage of women fighting at footy game surfaces as radio star says brawling AFL fans get special treatment compared to soccer supporters\n12/08/25 01:35The comments on Melbourne's 3AW radio drew support from soccer fans who are tired of what they see as a double standard in Aussie sport.\nPage\nStars of sport\n-\nConor McGregor poses with 'yacht neighbour' David Beckham and sons Romeo and Cruz as UFC star hails football legend's 'dynasty'\n-\nManchester United target Senne Lemmens spotted watching Antwerp's game after being left out of squad with £17m Old Trafford switch looming\n- Jude Bellingham's dad 'tried to confront his other son Jobe's manager' after he was subbed at HALF TIME during dismal display He was 'upset' at full time\n-\nJordan Pickford reveals his role in convincing Jack Grealish to sign for Everton and the Premier League club the Toffees should emulate\n-\nMarcus Rashford is subbed off at HALF-TIME in nightmare evening as England star's new club Barcelona stage a stunning comeback win\nmore stars of sport\n-\nCristiano Ronaldo's trophy curse in Saudi CONTINUES! Last-gasp goal - and a penalty shoot-out - deny Al-Nassr despite his record-breaking goal\n-\nChelsea star Axel Disasi shares unseen snap from their 'bomb squad' dressing room - as he shares what life is REALLY like for Enzo Maresca's cast-offs\n-\nWayne Rooney's son Kai, 15, scores for Man United's under-18s to complete 5-0 rout - while 14-YEAR-OLD wonderkid bags a double\n-\nStunning football TV presenter Diletta Leotta defends her glamorous looks as 'respect for the viewer' after colleague called her and other hosts 'vulgar'\n-\nMorgan Gibbs-White opens up on his failed move to Tottenham as he reveals complications with his fiancée's pregnancy were a factor\n-\nTop 10 transfer hijackings: Sir Alex Ferguson's phone call which denied rivals, Man City's deadline day shock, and the club who keep getting gazumped\n-\nI was born with a thumb and three fingers on each hand as well as only seven toes due to a rare genetic condition - now I've earned a place at the US Open\n-\nRoberto De Zerbi says Marseille dressing room brawl which saw Adrien Rabiot and team-mate transfer-listed was like a 'bar fight', forcing bodyguards to step in\n-\nFormer Premier League winner set to make festival debut at Reading after becoming a DJ in huge career change\n-\nFootball fans left baffled by Sean Dyche's friendship with Kerry Katona as ex-Everton boss makes surprise appearance on Celebs Go Dating\n-\nGlasner gives blunt response to Eze's absence as he confirms Arsenal-bound star won't play for them again - and sends warning to Liverpool on Guehi\n-\nEze's absence for Crystal Palace's first ever European game was a crying shame, but their win vs Fredrikstad is part of his legacy in south London\n-\nMarc Guehi flashes cheeky grin as he delivers pointed message to TV cameras after Crystal Palace's European win amid Liverpool links\n-\nTottenham dealt fresh injury blow with star man ruled out until the NEW YEAR as Thomas Frank ramps up search for reinforcements after Eberechi Eze snub\n-\nRooney insists there is 'no way back' for Alexander Isak after Newcastle strike and blasts Yoane Wissa's 'very disrespectful' Instagram stunt\n-\nOlympic champion Imane Khelif responds to retirement claims as gender row boxer skips World Championships after introduction of sex testing\n-\nRaducanu handed ANOTHER nightmare Grand Slam draw at US Open - but Draper has quarter-final shot before meeting world No 1 Sinner\n- EXCLUSIVE England hit by kit supplier blunder on eve of Women's Rugby World Cup in major blow to fans Not a good look on the eve of the tournament\n-\nRoy Keane reveals unseen details of his Man United contract - including the extraordinary demand Sir Alex Ferguson allowed\n-\nRio Ferdinand reveals why he is relocating to Dubai as Man United legend confirms huge lifestyle change after dramatically quitting punditry job\n- Liverpool Champions League winner set to 'rip up contract' after spending entire season in the RESERVES Six years on from famous win in Madrid\n-\nIsak arrives at Newcastle alone after his bombshell outburst, as Alan Shearer calls behaviour 'nonsensical' and ££40m bid for Wissa is 'REJECTED'\n- Revealed: New Bayern Munich signing is dating club legend's 17-year-old daughter One of Bayern Munich's new signings\n- US Open star Sachia Vickery's sex-work confession sends shockwaves through tennis world Attempting to qualify for the US Open this week\n-\nNeymar confronted by angry Santos fans and 'threatened with violence' at training ground after worst defeat of his career left him in tears\n- Mo Salah's cheeky reaction to Declan Rice goes viral as fans spot Arsenal jibe at PFA Awards Salah and Van Dijk couldn't resist a smile\n-\nRevealed: Man United's Carlos Baleba alternative has an ARSENAL tattoo on his arm and grew up idiolising former Gunners star\n- Awkward clip of Tom Brady flirting with 'beautiful' NFL reporter on Zoom emerges NFL great spoke to her over Zoom, discussing his own career in football\n-\nMoment Jack Draper is TOLD OFF by US Open mixed doubles partner Jessica Pegula for making a cheeky comment after British No 1's quarter-final win\n-\nEmma Raducanu shares an awkward exchange with Jack Draper after British No1 ended her US Open partnership with Carlos Alcaraz\n- Glamorous Olympic athlete is banned for FOUR YEARS for testosterone doping - but has already lined up stunning career switch New move\n-\nPep Guardiola reveals his daughter's brutally-honest reaction to his bold moustache look that left fans stunned during the summer break\n-\nLiverpool fans mock Trent Alexander-Arnold's 'stinker' Real Madrid LaLiga debut as woeful numbers give new boy brutal reality check\n-\nEXCLUSIVE\nNewcastle hit back after Alexander Isak breaks silence with bombshell statement claiming 'broken promises' as he tries to force Liverpool move\n-\nJamie and Rebekah Vardy's potential new life in Italy: God-like status with fans, romantic boat trips and partying... just don't expect pizza from boss!\n-\nMo Salah named PFA Player of the Year for a THIRD time after firing Liverpool to glory as he joins Premier League royalty at awards in Manchester\n-\nGiggling Emma Raducanu and Carlos Alcaraz show how much they enjoy each other's company with plenty of chemistry in US Open mixed doubles defeat,\n-\nWas Jordan Pickford let down by his 'penalty cheat sheet'? England keeper handed a nasty surprise on his water bottle - before Leeds striker scored winner in Premier League return\n- Red-faced Gary Neville caught making dig at Leeds fans live on Sky Sports in hot mic moment - prompting instant apology Leeds beat Everton\n-\nIga Swiatek tells cameraman to stop filming her as Wimbledon champion removed clothes on court at Cincinnati Open\n-\nTyrone Mings shares pointed message after Jacob Ramsey's £39m Newcastle move - after Aston Villa captain John McGinn appeared to aim swipe at financial rules\n-\nYoane Wissa UNFOLLOWS Brentford on Instagram, deletes all club photos and turns profile picture to black amid Bees' £50m demands to Newcastle\n- Jamie Vardy lined up for major shock transfer to Champions League team - in what could be a dream move for wife Rebekah European giants\n-\nTeenage star 1-0 Trolls! The moment footballer, 16, who was mocked for having acne in her unveiling photos, scores brilliant free-kick on her debut\n-\nNeymar left in floods of tears after former Liverpool star scores twice to inflict biggest defeat of his career as Brazilian icon admits: 'I'm ashamed'\n- Ben Askren leaves fans stunned with new video of his recovery after life-or-death double lung transplant at 41 Former UFC fighter\n-\nGary Lineker takes aim at the BBC boss who sacked him in his review of first Match of the Day since he got the boot from £1.35m-a-year contract\n- Strasbourg fan group RIPS into Chelsea owners' 'destructive' and 'abusive' running of club despite qualifying for Europe last season Part of multi-club network\n-\nFans are all saying the same thing after Sky Sports' US-style half-time interview with Martin Odegaard during Arsenal's showdown with Man United\n-\nPaul Scholes offers blunt response to daughter wearing Arsenal shirt as Man United legend watched Red Devils' Premier League opener\n-\nEberechi Eze appears emotional applauding Crystal Palace fans amid Tottenham interest - while Liverpool target Marc Guehi seems to IGNORE Oliver Glasner\n-\nAston Villa captain John McGinn aims dig at financial rules as Newcastle confirm £39m Jacob Ramsey signing from Premier League rivals\n-\nMan United fans make feelings clear on Alejandro Garnancho's future - as wantaway star's poster is DEFACED amid Chelsea interest\n- Man United fans label new ticketing system 'a disgrace' as thousands stuck in queues ahead of season opener against Arsenal Chaos\n-\nRevealed: Little-known rule that saw Eberechi Eze's goal disallowed against Chelsea - as Premier League release statement\n- Man United co-owner Avram Glazer spotted at Old Trafford as Red Devils kick off Premier League campaign against Arsenal First game of the season\n- British UFC star Lerone Murphy delivers stunning spinning-elbow KO just minutes after identical rare finish Manchester-born star aged 34\n-\nMatch of the Day viewers give verdict on first show without Gary Lineker as Wayne Rooney is criticised by fans after his debut following £800,000 deal\n- Erling Haaland pokes fun at Noni Madueke's infamous social media post ahead of Man City's clash with Wolves Cheeky comment\n-\nRicharlison scores 'goal of the season' contender with stunning overhead kick against Burnley - as fans hail 'legendary moment' for Spurs star\n- Ryan Reynolds and Rob McElhenney jet in to cheer on Wrexham's first Championship home game of the season See their side lose\n-\nThe moment Moses Itauma became Britain's next boxing superstar, as he floors Dillian Whyte with devastating combos in brutal first-round knockout\n-\nMan United outcast Jadon Sancho all but confirms romance with rapper Saweetie by inking her name on his neck - and REMOVES tattoo to ex-girlfriend\n-\nJD Vance's NIGHTMARE round at Donald Trump's golf course: US Vice President mocked after committing ultimate sin during UK holiday\n- Chelsea legend SPLITS from his wife of 26 years: Premier League icon shares emotional update on social media End of the road\n- Golf star Scottie Scheffler snaps at reporter over 'ridiculous' Ryder Cup questions in awkward press conference moment World No 1\n- Dillian Whyte turns up the heat on Moses Itauma during tense face-off in Saudi Arabia ahead of their heavyweight showdown Fight on Saturday night\n- Darwin Nunez scores AGAIN as Liverpool flop makes flying start to life in Saudi Arabia, while Reds continue their pursuit of Alexander Isak Left Liverpool last week\n- Louis Rees-Zammit declares return to rugby with maverick English Premiership side as 'the obvious choice' Ended NFL dream after 18 months in the US\n-\nWayne Rooney hits back at Tom Brady: Feud ignites as England legend claims NFL great does NOT understand football after his 'work ethic' was questioned\n- Bitter John Terry reveals he has given up dream career switch after being hit by 'baffling' rejections: 'I didn't even get a sniff' Moving on\n- EXCLUSIVE Coleen Rooney revives Wagatha Christie investigator skills as a detective in hilarious Paddy Power ad She has targets in sight\n-\nRoy Keane set to become a grandad AGAIN - as Man United icon's daughter announces pregnancy alongside England star in emotional snaps\n-\nRevealed: How Mats Hummels 'reacted to his ex-wife's fury' after she complained their son, 7, 'had NOT been invited' to Borussia Dortmund farewell matchr\n- Married football manager's awkward interviews go viral as he desperately tries to avoid eye contact with stunning reporter Set tongues wagging"
    }
  ],
  "argos_summary": "The article chronicles a long line of AFL Mad Monday scandals, from player breakups and costume mishaps to on‑the‑field misconduct, highlighting incidents involving Simon Atkins, Jason Akermanis, Brendan Fevola, Jimmy Bartel, Clinton Jones, GWS and even an umpire. It details how these events have repeatedly drawn media scrutiny, club sanctions and public backlash. The linked sources focus on the 2015 Dustin Martin groping scandal, outlining the footage, club and AFL responses, and the impact on Martin’s career. Together, the piece illustrates how Mad Monday celebrations have become a recurring source of controversy for the league and its players.",
  "argos_id": "KR0ASVJRM"
}