{
  "url": "https://www.cbsnews.com/minnesota/news/lynx-beat-fever-august-24/",
  "authorsByline": "",
  "articleId": "33b1549fe14847cb828964627833596c",
  "source": {
    "domain": "cbsnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/08/25/189d011e-07eb-4c64-b3a7-46e576daeeeb/thumbnail/1200x630g8/ae570a746476e54558debdbcfc53bc9b/gettyimages-2231204863.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T21:36:38-05:00",
  "addDate": "2025-08-25T02:42:04.828389+00:00",
  "refreshDate": "2025-08-25T02:42:04.828391+00:00",
  "score": 1.0,
  "title": "Collier returns from 7-game absence, Lynx beat short-handed Fever 97-84",
  "description": "Napheesa Collier had 32 points and nine rebounds in her return from a seven-game absence and the Minnesota Lynx beat the Indiana Fever 97-84.",
  "content": "Napheesa Collier had 32 points and nine rebounds in her return from a seven-game absence and the Minnesota Lynx beat the Indiana Fever 97-84 on Sunday night.\n\nCollier, who was the favorite to win WNBA MVP before she suffered an ankle injury in the third quarter of a 111-58 win over Las Vegas on Aug. 2, shot 11 for 19 from the field.\n\nCourtney Williams had 14 points and 10 assists with no turnovers for Minnesota (30-7). Kayla McBride and Maria Kliundikova scored 13 points apiece.\n\nKelsey Mitchell led Indiana (19-18) with 26 points on 7-for-12 shooting and Shey Peddy scored a season-high 16. Aliyah Boston had 14 points and Natasha Howard scored 10. Aerial Powers had five points, five rebounds and three assists.\n\nCaitlin Clark (groin) missed her 15th consecutive game for the Fever. The 2024 WNBA rookie of the year has missed 24 of the Fever's 37 games this season due to various injuries.\n\nPeddy and Powers were signed Tuesday and Saturday, respectively, to seven-day hardship contracts following Sophie Cunningham's season-ending knee injury on Aug. 19.\n\nKliundikova scored or assisted (a short turn-around jumper by Collier) on every point in Minnesota's 11-0 run to close the second quarter and take a 52-45 lead into halftime. Collier hit a short jumper and then a 3 to give the Lynx a 12-point lead 46 seconds into the third quarter.\n\nThe Fever trailed by at least nine points the rest of the way.\n\nMinnesota shot 57.1% from the field (36 of 63) and 3-point range (12 of 21), and hit 13 of 14 (92.9%) from the free-throw line.\n\nThe Lynx beat Indiana 95-90 on Friday. The Fever beat Minnesota 74-59 to win the Commissioner's Cup championship on July 1.\n\nThe Fever host Seattle on Tuesday before the Storm visit the Lynx on Thursday.",
  "medium": "Article",
  "links": [
    "https://www.cbsnews.com/minnesota/sports/lynx/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Fever",
      "weight": 0.08438503
    },
    {
      "name": "Lynx",
      "weight": 0.079062566
    },
    {
      "name": "Napheesa Collier",
      "weight": 0.0781916
    },
    {
      "name": "Minnesota",
      "weight": 0.075849995
    },
    {
      "name": "Collier",
      "weight": 0.07178898
    },
    {
      "name": "various injuries",
      "weight": 0.06683978
    },
    {
      "name": "Indiana",
      "weight": 0.06549459
    },
    {
      "name": "WNBA MVP",
      "weight": 0.06448474
    },
    {
      "name": "Shey Peddy",
      "weight": 0.06363534
    },
    {
      "name": "Maria Kliundikova",
      "weight": 0.06194834
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9970703125
    },
    {
      "name": "/Sports/Team Sports/Basketball",
      "score": 0.98193359375
    },
    {
      "name": "/Sports/Sport Scores & Statistics",
      "score": 0.3388671875
    }
  ],
  "sentiment": {
    "positive": 0.24947387,
    "negative": 0.19876438,
    "neutral": 0.55176175
  },
  "summary": "Napheesa Collier returned from a seven-game absence to score 32 points and nine rebounds for the Minnesota Lynx against the short-handed Indiana Fever. Collier, who was the favorite to win WNBA MVP before suffering from an ankle injury, shot 11 for 19 from the field. Courtney Williams and Maria Kliundikova also contributed significantly to the win. Kelsey Mitchell led with 26 points and Shey Peddy scored a season-high 16. Meanwhile, Caitlin Clark missed her 15th consecutive game for the Fever due to injuries.",
  "shortSummary": "Napheesa Collier returned from a seven-game absence to post 32 points, leading the Minnesota Lynx to a 97-84 win over the Indiana Fever.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "de445008e4d14a019f73572cb4f10acf",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cbsnews.com/minnesota/sports/lynx/",
      "text": "Collier returns from 7-game absence, Lynx beat short-handed Fever 97-84\nNapheesa Collier had 32 points and nine rebounds in her return from a seven-game absence and the Minnesota Lynx beat the Indiana Fever 97-84.\nNapheesa Collier had 32 points and nine rebounds in her return from a seven-game absence and the Minnesota Lynx beat the Indiana Fever 97-84.\nKayla McBride scored 29 points, Jessica Shepard got the second triple-double in franchise history, and the Minnesota Lynx beat the Indiana Fever 95-90.\nAllisha Gray scored 27 points, Rhyne Howard added 16 and the Atlanta Dream held on for a 75-73 victory to hand the Minnesota Lynx consecutive losses for the first time this season.\nJonquel Jones had 22 points and 10 rebounds, Sabrina Ionescu added 17 points and 11 assists, and the New York Liberty beat the Minnesota Lynx 85-75 after losing the first three meetings between the teams this season.\nWith less than a month left in the WNBA regular season, the Minnesota Lynx have a firm lock on the top seed in the playoffs.\nKayla McBride scored 18 points and DiJonai Carrington added 15 to help the Minnesota Lynx beat the New York Liberty 83-71.\nAlanna Smith scored 25 points, Courtney Williams had 14 and the Minnesota Lynx held off the Washington Mystics 80-76 to improve to 16-1 at home this season.\nReeve, one of the league's most prominent voices, called for an end to the practice and accountability for those responsible on Thursday.\nCourtney Williams scored 14 of her 20 points in the second half, Jessica Shepard added 13 points and 13 rebounds and Kayla McBride made 6 of 6 from the free-throw line in the final 30 seconds to help the Minnesota Lynx beat the Seattle Storm 91-87.\nMinnesota Lynx forward Napheesa Collier will be sidelined after spraining her right ankle against the Las Vegas Aces on Saturday, the team announced Monday, though it's unclear how long she will be out.\nThe Minnesota Lynx are atop the WNBA standings by several games, and the two people most responsible for that success are getting their dues.\nThe WNBA-leading Minnesota Lynx have acquired DiJonai Carrington in a trade from Dallas.\nNapheesa Collier had 30 points and nine rebounds, Kayla McBride added 24 points, and the Minnesota Lynx beat the short-handed New York Liberty 100-93 in a rematch of last year's WNBA Finals.\nThe Minnesota Lynx finally have the chance to play the New York Liberty again after an overtime loss in the decisive Game 5 of the WNBA Finals last year.\nGrammy Award winner Justin Vernon, the frontman for Bon Iver, is teaming up with the Minnesota Lynx to give back to the community.\nNo one understands the importance of a strong team like athletes. Bill Walsh's family has helped him take care of Walsh Field in Gaylord for decades. But this summer, life threw him a curveball. He lost his wife. Mike Max shares a story of love, loss and legacy.\nNapheesa Collier had 32 points and nine rebounds in her return from a seven-game absence and the Minnesota Lynx beat the Indiana Fever 97-84.\nIt was the White Sox's first series win against the Twins since July 2023.\nTaj Bradley got off to a rough start in his first game with the Minnesota Twins after he was acquired in a trade with Tampa Bay.\nCarson Wentz is back in the NFL and Sam Howell is on the move again.\nRobin Lod and Joaquín Pereyra each scored a goal to help Minnesota United beat Real Salt Lake 3-1.\nColson Montgomery hit his first career grand slam and Luis Robert Jr. homered late as the Chicago White Sox snapped a three-game skid with a 7-3 victory over the Minnesota Twins.\nThe Minnesota Wild have signed center Marco Rossi to a three-year, $15 million contract.\nCam Ward, the No. 1 overall pick, helped the Tennessee Titans wrap up the preseason by beating the Minnesota Vikings 23-13 Friday night.\nA sports bar institution in Minneapolis is serving customers for the last time on Sunday.\nA new beer at the Minnesota State Fair is making waves for more than just its taste.\nTwo men are recovering after they were shot in south Minneapolis on Friday afternoon.\nMinnesota health officials say the state's blood supply is critically low and are calling for action to address the problem.\nThe Minnesota DFL's move to revoke the endorsement of Minnesota state Sen. Omar Fateh by the local Minneapolis party unit for the city's mayoral race has sparked backlash.\nThe sheriff's office says a 48-year-old woman from the Cloquet area and a 59-year-old man from out of state died in the crash.\nA Minnesota State Patrol helicopter, unveiled just last month, is being put to the test.\nA Northstar Commuter Rail train hit a truck \"stopped on the tracks\" Friday morning in Coon Rapids, Minnesota, according to Metro Transit police, halting service in both directions.\nCharges say when he was asked why he touches the children, the man said \"he hasn't had sex in a long time,\" and he did it because he had \"access.\"\nNineteen-year-old Owen Thurnau is being credited with saving a man's life after the Owatonna, Minnesota, Hy-Vee employee successfully gave the Heimlich maneuver to a choking man last month.\nA restraining order filed by a western Wisconsin teacher against her former school district's superintendent has been lifted, court documents show.\nOfficials say a traveler from out of state who visited two Wisconsin gas stations may have exposed others to measles.\nA deer hunter has discovered a rare subtropical wood stork in the wilds of Wisconsin.\nWolfdogs in northern Wisconsin are helping war veterans deal with their post-traumatic stress disorder.\nA motorcyclist from Minnesota was killed in a crash with a truck pulling a trailer in western Wisconsin on Sunday.\nA grandma's quiet craft shop in Holdingford, Minnesota, got a big surprise thanks to her loving grandson and a viral Facebook post.\nThe second annual Guns and Hoses event is being held to raise money for police officers, firefighters and paramedics across the state, including those who responded to the shootings that wounded Minnesota Sen. John Hoffman and his wife.\nAfter a monthslong push for more transparency, a community exposed to elevated lead emissions earlier this year was able to get some answers from investigators.\nDozens of students will be looking their best when heading back to school, thanks to the annual Youth Appreciation Day in St. Paul, Minnesota.\nSometimes there are milestones so rare that they turn a care center into the most joyful place in town.\nA federal judge has ruled that religious colleges in Minnesota that require students to sign a statement of faith cannot be excluded from a program allowing high school students to take college courses for credit.\nA federal judge on Friday blocked the Trump administration from cutting off federal funding from dozens of \"sanctuary\" cities and counties — covering several of the largest cities in the U.S.\nMinnesota DFL officials have revoked their endorsement for Minneapolis mayor. State Sen. Omar Fateh, a Democratic Socialist, had secured the support of delegates over incumbent Mayor Jacob Frey in July, but the party said it found flaws in the voting system, prompting a decision that’s sparking backlash. Caroline Cummings explains.\nThe Justice Dept. released transcripts of Deputy AG Todd Blanche's two-day interview with convicted sex trafficker and Jeffrey Epstein associate Ghislaine Maxwell.\nCaroline Cummings has the latest on the growing controversy in the Minneapolis mayoral race between incumbent Democrat Jacob Frey and state Sen. Omar Fateh, a democratic socialist.\nWhile the first day of the Great Minnesota Get-Together brought in big bucks for vendors, some families say the price of participation is expensive.\nWith almost three dozen new foods to try at the 2025 Minnesota State Fair, it can be difficult to plan the menu for your visit. WCCO is here to help.\nVisitors to this year's Minnesota State Fair might get sticker shock when buying some of their favorite foods.\nLocal organizations are stepping up to help families in need have a successful school year, from end-of-summer celebrations to free haircuts and full backpacks of essentials.\nOne Minnesota woman left the corporate world to run her own bakery in Saint Paul's Lowertown.\nFederal prosecutors seek a 41-month sentence for the woman who pleaded guilty to illegally buying weapons for her children's father, who then used them in the killing of three Burnsville first responders in 2024, according to court records.\nTwo men are recovering after they were shot in south Minneapolis on Friday afternoon.\nA man and a woman are expected to be in court on Friday for charges related to a Minneapolis drive-by shooting that left a 79-year-old woman who was inside her home at the time seriously hurt.\nA hit-and-run driver plowed into a 27-year-old woman pulling children in a wagon in a crosswalk on Thursday night in Eden Prairie, Minnesota, leaving one child in critical condition.\nCharges say when he was asked why he touches the children, the man said \"he hasn't had sex in a long time,\" and he did it because he had \"access.\"\nMinnesota health officials say the state's blood supply is critically low and are calling for action to address the problem.\nOfficials say a traveler from out of state who visited two Wisconsin gas stations may have exposed others to measles.\nToday, the program has nine helicopters, 45 pilots and it airlifts about 2,600 patients a year.\nThe southern Minnesota city of Waseca has closed several beaches, boat ramps and bodies of water due to possible water contamination.\nOne in every seven police officers worldwide suffers from post-traumatic stress disorder or depression, and one in every 10 struggles with other mental illnesses. Officers in Bloomington, Minnesota, are making sure to check in and take care of their fellow officers.\nJerry Adler's acting credits include \"The Sopranos\" and \"The Good Wife.\" He also had 53 Broadway productions to his name, all behind the scenes.\nThe sights and sounds of country band Old Dominion lit up the Grandstand at the Minnesota State Fair on Thursday ahead of the release of their latest album, \"Barbara.\"\nAround 5:50 a.m., LAPD officers responded to Ventura Boulevard and Vineland Avenue for a man walking in the street.\nAs the curtain prepares to rise for the stage adaptation of Prince's iconic film \"Purple Rain\", producers have released the names of those whose talents will be on display later this year at the State Theatre in Minneapolis.\nAmy Klobuchar, Minnesota's senior U.S. senator, says someone used AI to simulate her voice, making a \"vulgar and absurd\" critique of the controversial American Eagle jeans ad featuring actress Sydney Sweeney.\nNo one understands the importance of a strong team like athletes. Bill Walsh's family has helped him take care of Walsh Field in Gaylord for decades. But this summer, life threw him a curveball. He lost his wife. Mike Max shares a story of love, loss and legacy.\nNapheesa Collier had 32 points and nine rebounds in her return from a seven-game absence and the Minnesota Lynx beat the Indiana Fever 97-84.\nIt was the White Sox's first series win against the Twins since July 2023.\nTaj Bradley got off to a rough start in his first game with the Minnesota Twins after he was acquired in a trade with Tampa Bay.\nCarson Wentz is back in the NFL and Sam Howell is on the move again.\nMinnesota Secretary of State Steve Simons says Minnesota will join the fight if President Trump attempts to halt mail-in voting.\nMinnesota Secretary of State Steve Simons says Minnesota will join the fight if President Trump follows through with his call to end mail-in voting by the 2026 Midterm Elections. In Talking Points, Esme Murphy examines whether Trump has the authority to do so, as well as other election issues, including who should have access to voter information.\nFateh is a Democratic Socialist, part of a surging progressive wing of the Democratic Party both in Minnesota and nationwide.\nTuesday will mark one month until early voting begins in local municipal and school board elections around the state. That includes the Mayor's race in Minneapolis. In tonight's Talking Points, Esme Murphy looks at the candidacy of State Sen. Omar Fateh.\nA new Minnesota law requires governments and public entities to report cyberattacks within 72 hours to the state and notify victims whose data has been breached. Starting next year, the law will require the state to issue an annual report on cyberattacks.\nIt's been 50 years since WCCO has been at its current location at the \"Great Minnesota Get-Together.\"\nCaves that were once used for making beer in the 1800s are now used for making cheese. In this week's Finding Minnesota, John Lauritsen looks into the history of the cheese caves in Faribault.\nOn his five-acre property in Blaine, Minnesota, Erik Lund has plenty of space to fine-tune his golf game and his guitar game.\nThis Friday, the town of Braham will reach a milestone as it celebrates its 35th \"Pie Day.\" It's always the first Friday in August.\nIn the mid-90s, a group of Alexandria, Minnesota, residents wanted to highlight wooden boats and their craftsmanship, believing they were essentially works of art. So, they converted an old city garage into the Legacy of Lakes Museum.\nJeff Wagner looks at the winding road it took for the Minnesota State Fair to find its permanent home 140 years ago.\nThe first Tuesday of August is a unique night meant for nothing more than connection with those living on your street and the people tasked to protect it: National Night Out, which is now in its 42nd year.\nHomeowners know the saying, \"water finds a way.\" Add wildfire smoke to that distinction, another savvy invader harming indoor quality, where people should feel protected from it.\nBe sure to turn your eyes to the night sky, as brief flashes of light will streak through outer space on Tuesday night.\nFrom farmland to store shelves and, soon, your kitchen, produce is a healthy choice that sometimes needs a healthy rinse.\nThe Minnesota State Fair has unveiled its new food, drinks and vendors for 2025.\nA suspect was taken into custody after an attack on Pearl Street Mall in Boulder on June 1 in which there were 15 people and a dog who were victims. The suspect threw Molotov cocktails that burned some of the victims, who were part of a march for Israeli hostages.\nWCCO photojournalist Art Phillips shares some personal family photos taken by his father, Arthur Phillips Sr., in Vietnam during his time in service.\nThe new Minnesota Military and Veterans Museum is under construction just outside of Camp Ripley in Little Falls. Set to open in late 2026, the $40 million, first-of-its-kind project in the nation will be eight times the size of the existing museum. It will honor not only Minnesota's service members and their sacrifices, but the refugee experience as well. Watch and read more in Pauleen Le's series \"Vietnam 50 Years Later: Reflections on a War that Changed Minnesota.\"\nThe National Weather Service has issued multiple tornado warnings and many more severe thunderstorm warnings throughout wide swaths of southern and central Minnesota Monday afternoon.\nNEXT Weather meteorologist Lisa Meadows says temperatures will gradually warm throughout the week.\nIn Minnesota, weather can be all over the place. Here at WCCO, we want to give you what you need to prepare for what's happening next.\nWCCO meteorologist Adam Del Rosso says it'll be a largely dry day with a mix of sun and clouds, with gusts back near 30 mph.\nThe cool air continues to settle in Sunday, with afternoon highs staying in the 60s.\nWCCO meteorologist Adam Del Rosso says the cool air continues to settle in today, with afternoon highs staying in the 60s.\nDerek James shares the latest headlines and updates.\nNEXT Weather meteorologist Lisa Meadows says temperatures will gradually warm throughout the week.\nOwners say Land of Natura in Wisconsin Dells offers people a chemical free experience.\nUkrainians and supporters gathered in Minneapolis to mark Ukraine’s Independence Day.\nThe Corner Bar is closing after 22 years of operation."
    }
  ],
  "argos_summary": "Napheesa Collier returned from a seven‑game injury absence to score 32 points and grab nine rebounds, propelling the Minnesota Lynx to a 97‑84 victory over the Indiana Fever. Courtney Williams added 14 points and 10 assists, while Kayla McBride and Maria Kliundikova each scored 13. Indiana’s Kelsey Mitchell led the Fever with 26 points, but the Lynx maintained a lead after a 12‑point surge early in the third quarter. The win comes as the Fever are short‑handed, with rookie Caitlin Clark out and new hardship signings Shey Peddy and Aerial Powers filling gaps left by Sophie Cunningham’s season‑ending injury. Minnesota’s high shooting efficiency (57.1% from the field and 92.9% from the line) helped secure the win.",
  "argos_id": "KS73FE9YN"
}