{
  "url": "https://www.polygon.com/panta-rhei-impressions-indie-roguelike/",
  "authorsByline": "Austin Manchester",
  "articleId": "1c91af03bda3456a939eb97d3927d13a",
  "source": {
    "domain": "polygon.com",
    "paywall": false,
    "location": {
      "country": "be",
      "county": "Antwerp",
      "city": "Antwerp",
      "coordinates": {
        "lat": 51.2211097,
        "lon": 4.3997081
      }
    }
  },
  "imageUrl": "https://static1.polygonimages.com/wordpress/wp-content/uploads/2025/08/panta-rhei-key-art.jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T17:00:15+00:00",
  "addDate": "2025-08-24T17:06:58.265002+00:00",
  "refreshDate": "2025-08-24T17:06:58.265007+00:00",
  "score": 1.0,
  "title": "This indie gem could be the summer’s best roguelike",
  "description": "Time-bending roguelike Panta Rhei is one of the more approachable entries in the popular genre.",
  "content": "This article is part of Run, Die, Repeat, Polygon's week-long series exploring roguelikes.\n\nThe flow of time lies at the heart of Panta Rhei, the debut project from Reignite Games and one of the summer’s underrated indie gems. It’s a roguelike that has players taking control of Phi, a young Guardian of Time, after their realm is threatened by proper noun Chaos. They wield a sword, sure, but their ability to manipulate the world around them by pausing and rewinding time is their strongest weapon.\n\nInterestingly, the levels in Panta Rhei are very static, or at least the ones I played through during my first few hours with the game. Instead of Phi’s path being randomized whenever they set off on a fresh run, they tread the same levels. It’s an interesting departure from most roguelikes, in which you often don’t know what rooms you’re about to step into, and helped me better track my progress each run. However, I could see how fighting through the same level layouts every run could get a tad dull over time, even though there are a few off-the-beaten-paths to explore.\n\nPanta Rhei’s combat is so engaging, however, that the moment-to-moment gameplay never bores. Phi has light and heavy attacks, and combos that mix the two. All well and good there. What sets Panta Rhei apart is how rewinding Phi through time adds an exciting layer to combat. I really like using the whirlwind combo, which is two light attacks followed up by a heavy attack in which Phi lands multiple hits on foes. Once the animation is done, I can rewind and watch the same attacks play out in reverse for additional damage. This is also a nifty way to get out of danger, by rewinding Phi enough that they’re no longer on top of any enemy.\n\nRewinding attacks isn’t just a fun little trick: it’s necessary to damage shielded enemies. An aqua blue barrier encases some foes, and it can only be broken by attacking them as Phi rewinds. Some of the tougher enemies will become shielded midway through encounters, ensuring Panta Rhei keeps ya on your toes.\n\nPhi also has the power to rewind and pause time around certain objects. This is necessary in some levels (like reconstructing a broken bridge), and very helpful during certain combat encounters. Traps are often the bane of my existence in roguelikes, but in Panta Rhei, they’re my allies. I take so much joy in luring enemies near traps, then rewinding time and using them against unsuspecting foes.\n\nWhat I appreciate most about Panta Rhei is how approachable it is. Phi is healed after clearing an encounter, meaning managing HP isn’t as stressful as in many other roguelikes. As long as I keep the damage to a minimum, Phi will often be brought back up at full health after the encounter ends. Phi can also be revived during runs by using lifetime capsules, and runs start with two available. An additional capsule can be added via investing in Phi’s skill tree, meaning after just a couple hours of playtime, I’m able to enjoy runs with three revives in my pocket. Saving up my coins over the course of a run can even let me replenish them, if a merchant has one in stock.\n\nPanta Rhei feels like a roguelike for people who are put off by the typical difficulty of the genre. After just a few runs, Phi feels like a nimble powerhouse — one who thankfully won’t be derailed by an early or unexpected death.\n\nPanta Rhei is out now on Windows PC. The game was reviewed on PC using a prerelease download code provided by Reignite Games. Valnet Inc. has affiliate partnerships. These do not influence editorial content, though Valnet Inc. may earn commissions for products purchased via affiliate links. You can find additional information about Polygon’s ethics policy here.",
  "medium": "Article",
  "links": [
    "https://www.polygon.com/pages/ethics-statement",
    "https://www.polygon.com/why-roguelikes-are-fun/#how-roguelikes-turn-punishment-into-a-reward-according-to-psychologists",
    "https://www.polygon.com/roguelikes-appeal-why/",
    "https://www.polygon.com/gaming/608011/best-new-games-summer-2025/"
  ],
  "labels": [
    {
      "name": "Non-news"
    },
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Panta Rhei",
      "weight": 0.093037814
    },
    {
      "name": "Phi",
      "weight": 0.08653552
    },
    {
      "name": "runs",
      "weight": 0.07005089
    },
    {
      "name": "most roguelikes",
      "weight": 0.06710109
    },
    {
      "name": "many other roguelikes",
      "weight": 0.065195546
    },
    {
      "name": "time",
      "weight": 0.065065496
    },
    {
      "name": "certain combat encounters",
      "weight": 0.064945616
    },
    {
      "name": "roguelikes",
      "weight": 0.06395649
    },
    {
      "name": "shielded enemies",
      "weight": 0.055047654
    },
    {
      "name": "Panta Rhei’s combat",
      "weight": 0.054613993
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.97705078125
    },
    {
      "name": "/Games/Computer & Video Games/Action & Platform Games",
      "score": 0.7626953125
    },
    {
      "name": "/Games/Roleplaying Games",
      "score": 0.61474609375
    },
    {
      "name": "/Games/Computer & Video Games/Adventure Games",
      "score": 0.583984375
    },
    {
      "name": "/Games/Computer & Video Games/Massively Multiplayer Games",
      "score": 0.4091796875
    },
    {
      "name": "/Games/Computer & Video Games/Shooter Games",
      "score": 0.32275390625
    }
  ],
  "sentiment": {
    "positive": 0.13280198,
    "negative": 0.44915363,
    "neutral": 0.41804436
  },
  "summary": "Panta Rhei, the debut project from Reignite Games, is considered one of the summer's underrated indie gems. Players take control of Phi, a young Guardian of Time, who can manipulate the world around them by pausing and rewinding time. The game's gameplay is engaging and engaging, with players able to navigate through static levels rather than randomized ones. Players can also use the power to rewind and pause time around certain objects, which is particularly useful during combat encounters. Despite the difficulty of the genre, the game's approachability and ability to heal and revive players is praised. Panta Rhee is now available on Windows PC.",
  "shortSummary": "Panta Rhei, an indie roguelike featuring engaging combat and time-trading elements, is a refreshing addition to any challenging game.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "743fa99e49a94d9bafaaed122a65fa3c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.polygon.com/gaming/608011/best-new-games-summer-2025/",
      "text": "For video games, the summer season kicked off with a double-header: the release of the Nintendo Switch 2, smack amid the three-day slew of game reveals that comprise Summer Game Fest (and its surrounding press conferences). But the most exciting games of the summer aren’t all Switch 2 ports or massive studio tentpoles. In fact, it’s the smaller games — the indies and the AA gems — that have captured most of Polygon’s attention.\nFrom a management sim about temperamental clones to an open-world adventure in which you bike your way to saving the world, here are 11 under-the-radar games to watch out for this summer.\nThe Alters\nRelease date: June 13 (out now!)\nWhere to play: PlayStation 5, Windows PC, Xbox Series X\nHow well do you think you would enjoy working with a few radically different versions of yourself? That’s the question Jan Dolski is facing — that, and how he’s going to survive imminent death on a hostile world. In The Alters, Dolski is the sole survivor of a scientific expedition in search of a new element. Through survival and base-building gameplay, he, alongside the alternate versions of himself he brings to life, has to find a solution for survival while contending with how varied his life could have turned out if different choices were made.\nBloodRush: Undying Wish\nRelease date: July 1\nWhere to play: Windows PC\nBloodRush: Undying Wish is like if Bloodborne met Crank, that offbeat 2006 Jason Statham action flick (stay with me here). It’s a hack-‘n’-slash roguelike where your character is constantly bleeding out during combat. You can increase your blood by killing enemies, so the gameplay is fast and frenetic; you’re constantly dashing around the battlefield like you need adrenaline to survive. So, Crank. BloodRush is a fun time with gorgeous pixel art to boot. Check out a demo on Steam ahead of its early access launch.\nWheel World\nRelease date: July 23\nWhere to play: PlayStation 5, Windows PC, Xbox Series X\nIn Wheel World, you play as a cyclist with the simplest of simple tasks: save the world. (You’ve got this!) With a customizable bike, complete with a ghost head accessorizing it, you’ll pedal and race around an open world as you set out to save it. Originally unveiled as Ghost Bike in 2023 with a somber narrative, Wheel World was rejiggered in fall 2024 with a new title and a lighter tone focused on “the joy and freedom of living around bikes,” developer Messhof wrote in an update on Steam.\nNinja Gaiden: Ragebound\nRelease date: July 31\nWhere to play: Nintendo Switch, PlayStation 4, PlayStation 5, Windows PC, Xbox One, Xbox Series X\nIt’s a big year for the Ninja Gaiden franchise. Ninja Gaiden 2 Black, a remaster of 2008’s Ninja Gaiden 2, was surprise dropped earlier this year alongside the reveal of Ninja Gaiden 4, the first new mainline entry in over a decade. Between those releases, fans will also have the chance to play Ninja Gaiden: Ragebound, a side-scrolling action-platformer. The Ninja Gaiden series started on NES, so Ragebound takes it back to its roots in a way with its pixel art aesthetic. You can play its Steam demo to get a feel for the challenge of Ninja Gaiden: Ragebound, which comes from the developers behind the Blasphemous games.\nPanta Rhei\nRelease date: July 31\nWhere to play: Windows PC\nLike in Prince of Persia: The Sands of Time, wielding time is a core tenet of Panta Rhei, a roguelike that casts you as Phi, who must protect the flow of time. Bend time to solve environmental puzzles as well as to save your skin in combat. Panta Rhei’s art style and orange and violet hues remind me of Annapurna’s excellent Cocoon, so it’s already starting off on the right foot. Get a taste of its roguelike combat via its demo on Steam.\nArtis Impact\nRelease date: Aug. 7\nWhere to play: Windows PC\nArtis Impact follows Arkane and her AI companion, Bot, as they venture through a futuristic world full of murderous AI — and tasty potato croquettes. Its pixel art is great, and the manga-inspired comic panels that function as cutscenes are truly killer. Gameplay will be a mix of turn-based combat and regular life activities, like cooking or earning passive income. It may be set in a post-apocalyptic world, but it’s a cozy post-apocalyptic world.\nTiny Bookshop\nRelease date: Aug. 7\nWhere to play: Windows PC\nThere are two things the world can never have enough of: books and bookshops. In Tiny Bookshop, head to a small coastal town to start your own bookstore. It’s a quiet and cozy game, one that’s divorced from the stress of working retail IRL. Tiny Bookshop instead lets you sit back and recommend great books to customers who’ll buy them up. Decorate your bookshop on wheels to your heart’s content and keep your shelves stocked by purchasing used books from classified ads like it’s 1998 all over again.\nSword of the Sea\nRelease date: Aug. 19\nWhere to play: PlayStation 5, Windows PC\nDeveloper Giant Squid is known for stylish games Abzû and The Pathless, and Sword of the Sea looks to carry that stylish torch forward. Your big, cool sword isn’t needed for combat, but for traversal. Sword of the Sea’s gnarly movement is based on skateboarding, snowboarding, and surfboarding, and you’ll use your Hoversword to ride waves of sand. Over the course of the game, you’ll work to restore an ocean, and then catch its waves. Surf’s up, dude.\nThe Knightling\nRelease date: Aug. 28\nWhere to play: Nintendo Switch, PlayStation 5, Windows PC, Xbox Series X\nThe Knightling ditches swords and maces for a shield as its titular hero’s weapon of choice. It’ll be used in combat Captain America style, of course, but also for traversing the game’s open world via some very sick-looking shield surfing. The Knightling gives off the vibe of a PS2-era platformer with modern-day visuals, and I can’t wait to check it out this August — good thing it’s got a demo on Steam!\nHirogami\nRelease date: Sept. 3\nWhere to play: PlayStation 5, Windows PC\nSet in an origami world, where seemingly everything has been created via the delicate Japanese craft, Hirogami is an action-platformer. Hiro can fold himself into different transformations, like an armadillo or a frog, to traverse the fragile world and battle digital creatures who are threatening it. Play the demo on Steam to get a feel for Hiro’s origami powers yourself.\nHell is Us\nRelease date: Sept. 4\nWhere to play: PlayStation 5, Windows PC, Xbox Series X\nHell is Us wears the aesthetics of a Soulslike without some of the genre’s challenges; enemies stay dead, meaning your corpse runs won’t be as tenuous, and the game places a greater emphasis on exploration than combat. You’re cast as Remi as he enters and explores a war-torn country in search of his parents. Along the way, he encounters more than he bargained for in the way of some creepy enemies, and he’lll wield a big glowing sword to take them down."
    },
    {
      "url": "https://www.polygon.com/pages/ethics-statement",
      "text": "Editorial Ethics and Guidelines\nConduct\nWe do not generally accept travel or accommodations (e.g., flights, hotel rooms, rental cars) from companies that we cover. In the event that we do, we will disclose the circumstances in any resulting coverage.\nMembers of our editorial team will not accept gifts (including food and drinks) in excess of $50 in value.\nPolygon staffers are permitted to back video game Kickstarter campaigns at the minimum level necessary to acquire the game or hardware in question. No disclosure is needed.\nReviews\nWe do not score reviews, nor do we discuss review scores or opinions with publishers or developers prior to publication. Polygon awards the Polygon Recommends badge to media that it believes its readers should watch or play. To learn more about the program, read our announcement letter.\nPolygon may regularly adjust its assessment of games and hardware over the life of those products. These changes will always be explained and transparent. This is done completely at the discretion of Polygon writers and editors.\nConflicts of interest\nUnless specifically disclosed on their profile page, Polygon editorial team members do not cover companies (1) in which they have a financial investment, (2) that have employed them previously, or (3) that employ their spouse, partner, or someone else with whom the staffer has a close relationship. When a Polygon contributor has affiliations of prior employment experience that would represent a material conflict of interest with their reporting, that information will be disclosed in context or footnotes of their coverage.\nPolygon staffers are permitted to contribute to Patreon campaigns for members of the video game industry, but they need to disclose the details of those contributions on their profile page as well as in any related coverage they publish on the site.\nSources\nIt is our policy not to pay sources. On rare occasions, we may contract with a source as a co-creator of content. Anonymous sources must prove their identity to Polygon to be cited in a story. We protect the identity of our sources.\nCorrections\nPolygon makes every effort for stories to be completely accurate upon publication. We will correct, but not remove, inaccurate stories.\nAdvertising\nWe have advertisements on our site, and they are our main source of revenue. Our parent company, Valnet Inc., has its own advertising team responsible for selling ad space on our site. We do not accept money or other consideration from companies as a condition or incentive to write a review or story, whether favorable or unfavorable, on Polygon. All reviews and other editorial coverage on our site are based on our editorial discretion, not on the desire of any company, advertiser, or PR firm. Advertisers don’t ask us to cover their products, and we don’t comment about their ads. Our policies do not permit placements of advertorial on Polygon. We will endeavor to clearly mark any advertisement or “infomercial” shown on Polygon as an advertisement.\nOur website may also contain affiliate marketing links, which means we may be paid a commission on sales of products or services that we write about. Our editorial content is not influenced by advertisers or affiliate partnerships.\nGiveaways\nFrom time to time, Polygon may conduct contests and giveaways on the site for our readers. We will post rules for each contest, which will be binding on individuals who decide to participate. Giveaways of products are not, and should never be considered, endorsements of the companies involved or their products.\nProfessional appearances\nOur editors and writers are often asked to appear in a professional capacity as experts for various television shows, news programs, radio broadcasts, or other media. These appearances do not constitute endorsement of any products, companies, or services discussed. We may accept reimbursement for our travel expenses associated with one of these professional appearances (as long as the media outlet in question is not affiliated with any company that we cover).\nProduct samples for reviews\nCompanies may send products, download keys, streaming links, screening and event invites, or other samples to our staff in order for us to assess such samples and determine whether we will provide a review of the product or work in question on Polygon. We do not accept any samples with any preconditions, such as that we will agree to provide a review simply because a company sent us a sample. Please note that companies may provide these samples before a product or work is commercially available, in which case, we may agree to an embargo with the company or its PR firm. This means that we agree not to publish a review or associated coverage until a given time.\nOccasionally, we may decide to review something that has not been provided to us by a company. In this case, a staff member will either purchase the product or work for themselves — we buy a lot of games — or Valnet Inc. will purchase the product or work for the team.\nLast updated May 2025"
    },
    {
      "url": "https://www.polygon.com/why-roguelikes-are-fun/#how-roguelikes-turn-punishment-into-a-reward-according-to-psychologists",
      "text": "We can't quit roguelikes. Often literally. They drop us into danger with ever escalating powers and then, inevitably, send us back to the start. The possibility of that one perfect attempt keeps us hitting “restart.\"\nThis week, we’re diving deep into the systems and stories that make roguelikes impossible to resist. We’ll celebrate franchise experiments like Pokémon Mystery Dungeon, discover new contenders like Absolum, and investigate why players gravitate toward games that punish failure as much as they reward skill. Yes, there will be Hades talk. Check back all week during our celebration of the particular kind of maddening joy that comes from roguelike loops."
    },
    {
      "url": "https://www.polygon.com/roguelikes-appeal-why/",
      "text": "This article is part of Run, Die, Repeat, Polygon's week-long series exploring roguelikes.\nAh, the roguelike. A genre named after the 1980s game Rogue and one that I’ve tried time and time again to get into – so much so that I actually purchased Rogue a few weeks back to throw myself into it. I’d tried 2011’s The Binding of Isaac, even Slay the Spire when it first released in 2019, and now I thought I’d try the game that birthed this genre. Maybe, just maybe, my mind could be changed.\nI didn’t like Rogue. I tried my best to like The Binding of Isaac. And despite my numerous attempts to get into Slay the Spire and see the fun aspect of it, I left feeling like I had ultimately lost 4 to 5 hours of my life that I was never going to get back.\nSo, roguelike enjoyers, I have but one question: Who hurt you?\nFor those of you who are blissfully unaware of what a roguelike is, let me explain. While the ultimate definition varies greatly depending on who you ask, roguelikes are usually considered a subgenre of role-playing games. Players take on the role of a character and must hack and slash their way through a procedurally generated dungeon – or other such setting – while picking up upgrades for health, weapons, abilities, and so forth. However, if a player dies, they must start over from the beginning with no upgrades, no new fancy weapons and armor, just a brand-new character.\nI’m a fully-grown woman who writes for a living. I’ve got a niece to look after. Two very loud and obnoxious dogs who do not understand the concept of working from home and thus want me to throw ball 24/7. My neighbor does not understand what “a respectable level of noise” is when they blast Mitski at 10 p.m. As you can see, my periods of relaxation are very slim. So the whole concept of a subgenre that requires me to play continuously and, when I die (because I am going to die), have none of it matter makes me want to set myself on fire.\nAnd I get it. There’s something magnetic about the thought of making it to the end and completing a game with an encyclopedia of knowledge sitting in your noggin, which is only possible thanks to your hard efforts and many (many…many…) deaths. It feels a bit like when you go to those restaurants where, if you eat a plethora of food for a challenge, you get the honor of not paying for it. Painful, but worth it. Skillful even. Maybe I would enjoy it if I simply got good. But consider: What if I don’t have time to get good? My niece has managed to install several viruses on her phone, my dogs want to go out for their nightly walk, and they’ve figured out how to open the bathroom door, so there goes my last hiding space for a bit of peace and quiet. I still haven’t cooked dinner yet.\nBut despite my aversion to roguelikes, there is an alternative that I do love: roguelites. Games like Hades and Sword of the Necromancer incorporate roguelike elements, including random dungeons and a death mechanic that sends you back to the start of each run. But these games also allow you to keep the upgrades to your character, so that each new run doesn’t feel so agonizingly pointless. For some people, the difference between the two subgenres probably feels a tad like splitting hairs: What, the only difference is player progression? And to that I’d say yes, but the player progression aspect of roguelites versus roguelikes is incredibly important to me.\nFor gamers who turn their nose up at the thought of “shortcuts” in video games, the idea of player progression in roguelikes might seem like sacrilege. After all, roguelike players, much like soulslike players, get a (well-deserved) ego boost from these games. If you’re not skilled enough to get to the end without any help, the thinking goes, are you truly a gamer? However, this completely ignores just how different each gamer is. I may not be a competitive or even skilled person in the realm of roguelike gameplay, but that doesn't mean I should forego them forever, even if I just so happen to enjoy the story and other aspects that the game has. That doesn’t seem fair.\nThis is why the Hades series, in particular, is such an intriguing roguelite to me. As Zagreus or Melinoe, you fight your way through various realms of the ancient Greek afterlife, and even if you absolutely eat dirt two minutes in and are sent back to the start, the game doesn’t punish you for it. Instead, it leans on its cast of characters, in addition to unlockable features like weapons, locations, and item stores, to encourage you to get back into another run. It rewards you for your efforts, in other words.\nWhile I’ve felt frustrated at dying in a roguelite, in the Hades games (and other games that take on a similar framework), I’ve never felt as though I was the butt of a joke. I felt more like I learned something, could come back stronger, and used the time away from the dungeon to invest in upgrades and explore the main hub area where the main character’s friends, family, and love interests hang out. In my experience, true-to-form roguelikes do not have this sense of connection. Progression is rarely – if ever – reflected on you in a meaningful way.\nTo be frank, the main appeal of roguelites for me is that there’s a chance I actually get to the end. And I do want to progress through the game and get to the end, because to me, not completing something I’ve specifically set out to complete feels like a moral failure. I know, I know, discussion material for my therapist. So, to the game developers out there who know just how vital it can be to feel that progress, I salute you.\nAnd to roguelike enthusiasts, I will never understand you, but if they bring you joy, who am I to judge?"
    }
  ],
  "argos_summary": "Polygon’s review of Panta Rhei, a roguelike from Reignite Games, showcases its time‑manipulation mechanics that let players pause, rewind, and re‑play attacks to break shields and solve puzzles. Unlike most roguelikes, the game features static level layouts, making progress easier to track while still offering engaging combat and a forgiving health system that heals between encounters and provides revives. The article also situates Panta Rhei within a broader list of underrated indie titles slated for release in summer 2024, noting its approachable difficulty and emphasis on strategic use of time. Overall, Panta Rhei offers a fresh take on the genre by blending classic roguelike progression with a unique time‑based toolkit.",
  "argos_id": "KUJTUU1GH"
}