{
  "url": "https://finance.yahoo.com/news/geely-riddara-ships-rd6-phev-054500531.html",
  "authorsByline": "Newsfile",
  "articleId": "d238efd556f14dbaae4275873337581f",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/newsfile_64/1acaee8b48bd0a54a0e01e747f29c064",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T05:45:00+00:00",
  "addDate": "2025-08-25T05:58:37.422219+00:00",
  "refreshDate": "2025-08-25T05:58:37.422223+00:00",
  "score": 1.0,
  "title": "Geely Riddara Ships RD6 PHEV Pickups to the Middle East in Global Expansion",
  "description": "Shanghai, China--(Newsfile Corp. - August 25, 2025) - Geely Riddara, the new energy pickup brand under Geely Auto Group, announces the official shipment of its RD6 PHEV plug-in hybrid pickup series, with the Middle East as its first destination.The RD6 PHEV is equipped with the globally leading Geely EM-P Hybrid System, built on Geely Riddara's M.A.P (Multiplex Attached Platform) - China's first pickup-exclusive platform compatible with BEV, PHEV, and REEV powertrains. Featuring the...",
  "content": "Shanghai, China--(Newsfile Corp. - August 25, 2025) - Geely Riddara, the new energy pickup brand under Geely Auto Group, announces the official shipment of its RD6 PHEV plug-in hybrid pickup series, with the Middle East as its first destination.\n\nThe RD6 PHEV is equipped with the globally leading Geely EM-P Hybrid System, built on Geely Riddara's M.A.P (Multiplex Attached Platform) - China's first pickup-exclusive platform compatible with BEV, PHEV, and REEV powertrains. Featuring the industry-first 3DHT Hybrid Architecture, it pairs a 1.5T hybrid engine with seamless 3-speed adjustment, enabling a comprehensive range of over 1,000 km, accelerating from 0 to 100 km/h in 6.3 seconds. It delivers smooth handling that effortlessly tackles a variety of extreme driving conditions, while generating a maximum power output of 260 kW and peak torque of 914 N·m. After undergoing rigorous testing in extreme conditions from -30°C to 60°C and 40 million kilometres of endurance trials, whether navigating mountainous roads or deserts, the RD6 PHEV is engineered to meet the versatile driving needs of users worldwide.\n\nNot only does the RD6 PHEV deliver exceptional performance, but it also excels in energy efficiency. Equipped with an AI-powered energy management system, the RD6 PHEV reduces fuel consumption by 21% compared to ICE pickups. Its hybrid engine achieves an industry-leading thermal efficiency of 44.26%, setting a new benchmark in the segment. This advanced energy management system is particularly well-suited for regions like the Middle East and South America, where charging infrastructure is limited. It effectively addresses the high fuel consumption and suboptimal performance challenges of ICE pickups, providing an optimal energy solution for long-distance transport scenarios.\n\nGeely Riddara, guided by its product philosophy of \"Function like a pickup, drive like an SUV,\" has maintained its position as China's No.1 new energy pickup brand for three consecutive years. The brand, with its pure electric pickup models, has expanded its presence to over 60 countries and regions, with plans to gradually expand its footprint in the new energy market.\n\nBuilding on this momentum, Geely Riddara will launch its hybrid pickup series in the Middle East as the first stop, supporting the region's 2030 vision for accelerating EV adoption. And also the brand plans to roll out the new series - RD6 PHEV pickup in the Asia-Pacific, Latin American, and European markets later this year. By leveraging real-world validation in the Middle East - a high-value proving ground - Geely Riddara aims to further consolidate its position in the global new energy pickup market, delivering efficient, sustainable, and intelligent mobility solutions to shine on the world stage.",
  "medium": "Article",
  "links": [
    "https://images.newsfilecorp.com/files/7987/263710_a228ebd0940fc89a_001full.jpg"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "RD6 PHEV Pickups",
      "weight": 0.10589301
    },
    {
      "name": "ICE pickups",
      "weight": 0.09361892
    },
    {
      "name": "RD6 PHEV",
      "weight": 0.091607995
    },
    {
      "name": "Geely Riddara",
      "weight": 0.089252666
    },
    {
      "name": "energy efficiency",
      "weight": 0.07717863
    },
    {
      "name": "Chinas No.1 new energy pickup brand",
      "weight": 0.074356124
    },
    {
      "name": "the global new energy pickup market",
      "weight": 0.073352255
    },
    {
      "name": "Geely Auto Group",
      "weight": 0.07204153
    },
    {
      "name": "the new energy pickup brand",
      "weight": 0.07187776
    },
    {
      "name": "extreme driving conditions",
      "weight": 0.07125956
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/Autos & Vehicles/Vehicle Shopping/Vehicle Specs, Reviews & Comparisons",
      "score": 0.80126953125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.73779296875
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Hybrid & Alternative Vehicles",
      "score": 0.73583984375
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.640625
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Trucks, Vans & SUVs",
      "score": 0.4443359375
    }
  ],
  "sentiment": {
    "positive": 0.84619474,
    "negative": 0.018603817,
    "neutral": 0.13520135
  },
  "summary": "Geely Riddara, the new energy pickup brand under Geely Auto Group, has announced the official shipment of its RD6 PHEV plug-in hybrid pickup series to the Middle East as its first destination. The RD6PHEV is equipped with the Geely EM-P Hybrid System, China's first pickup-exclusive platform, and features a 1.5T hybrid engine with seamless 3-speed adjustment, enabling a range of over 1,000 km. It also offers exceptional performance and energy efficiency, with an AI-powered energy management system that reduces fuel consumption by 21% compared to ICE pickups. The brand plans to launch its hybrid pickupseries in the Middle Eastern as the first stop, supporting the region's 2030 vision for accelerating EV adoption.",
  "shortSummary": "Geely Riddara is launching its RD6 PHEV plug-in hybrid pickup series in the Middle East, enhancing performance and energy efficiency, with plans to expand globally.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "026c2dde69804dfd880683c5553ecb0f",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Geely Riddara has shipped its RD6 PHEV pickup to the Middle East, marking the first market for the brand’s new hybrid series. The RD6 uses Geely’s EM‑P Hybrid System on a dedicated M.A.P platform, offering a 1,000‑km range, 0‑100 km/h in 6.3 seconds, 260 kW power and 914 N·m torque, and has been tested in extreme temperatures and 40 million km of endurance. Its AI‑powered energy management cuts fuel consumption by 21 % and achieves a thermal efficiency of 44.26 %, making it suitable for regions with limited charging infrastructure. Geely plans to expand the RD6 into Asia‑Pacific, Latin America and Europe later this year, aiming to strengthen its global new‑energy pickup presence and support the Middle East’s 2030 EV adoption goals.",
  "argos_id": "LMI78CP7Z"
}