{
  "url": "https://www.express.co.uk/travel/europe/2099508/best-cities-in-europe-to-visit-naples",
  "authorsByline": "Jenna Campbell",
  "articleId": "a6da9f22a51c461a96ca2494f97e5876",
  "source": {
    "domain": "express.co.uk",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Stark County",
      "city": "Hartville",
      "coordinates": {
        "lat": 40.9636685,
        "lon": -81.3312195
      }
    }
  },
  "imageUrl": "https://cdn.images.express.co.uk/img/dynamic/200/1200x630/6381454.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-24T15:20:00+01:00",
  "addDate": "2025-08-24T14:52:11.979488+00:00",
  "refreshDate": "2025-08-24T14:52:11.979489+00:00",
  "score": 1.0,
  "title": "I flew 1,500 miles to European city people warned me not to visit",
  "description": "This place may have a reputation but it is a gem waiting for more people to explore it.",
  "content": "It is a place of extremes. From the minute you're shoved inside a taxi at the airport, you can feel the energy pulsing through your veins. Near-misses as cars jostle for position alongside Vespas are an everyday occurrence, as are the spontaneous conversations that break out at full volume across the street. The outlines of Diego Maradona and Scott McTominay's faces are scribbled on every last inch of the city's ancient walls. It's one of the oldest continuously inhabited areas in the world, a melting pot of chaos, culture and cuisine. It's also built at the base of an active volcano. Perched along the Mediterranean Sea under the shadow of Mount Vesuvius, Campania's capital city, Naples, boasts centuries-old history with countless monuments and relics to admire and alleyways heaving with tourists who sip Aperol in the midday sun. This being Italy, there are countless restaurants, kiosks and holes in the wall dishing out this city's most famous export: Neapolitan pizza.\n\nHowever, before a recent visit to Italy's third-largest city to try out some of its finest pizzerias and drinking spots I was issued a warning by several people: be very careful. The seaside city, just on the shin before the foot inside Italy's famous boot, does have a reputation. According to some, it is unsafe, dirty and chaotic, stemming from historical issues with crime, particularly the Camorra, Naples' local mafia which has infiltrated various aspects of city life. A lot of tourists skip the city and instead head to the picturesque Amalfi Coast and historic sites of Pompeii and Herculaneum, but this lively and culturally rich city is gradually stepping out of the shadow that has been cast over it.\n\nSince 2010, there has been a concerted effort by the local and national governments to boost Naples' perception amongst tourists and there has been a reduction in petty crime levels both in the historic centre and some residential neighbourhoods. While Naples is ranked far below other Italian cities for crime, like all big tourist spots there is a risk of petty theft and the advice is just to be mindful of your possessions and surroundings. The other thing to consider, and something you can't really ignore with it looming over the city, is the possibility of Mount Vesuvius erupting.\n\nIt's an active volcano so in theory could erupt at any point. But it's also one of the world's most-monitored volcanoes and there are stations all across the national park, with the advice to keep an eye on the UK Foreign Office (FOC) for any updates ahead of travel. With that clarified and a packed itinerary spanning just 48 hours, a group of us travelled from Manchester Airport to Naples to soak up as much of the culture as possible in a short space of time We headed out to Italy with Pizza Pilgrims ahead of the launch of their first Manchester site on Deansgate to learn about the growers, producers and chefs they work with to create their menus and to get an authentic taste of the city that has played a huge part in their journey over the last 15 years.\n\nWithin an hour of landing, we were zig-zagging through the city streets and dropped off at 'Pizza Street' (Via dei Tribunali) sipping on a €1 Campari Spritzes and essentially living la dolce vita. Sorbillo is notoriously hard to get into at peak times so it is a true exercise in patience as you wait for the man with the obnoxious loudspeaker to call out your number. There are plenty of pizzerias in this city, but this joint stands out for its blue-and-white awning and a shed load of people waiting outside desperate to try their lighter than air dough and myriad toppings.\n\nIt's hard to describe the energy, but as we packed around tables shoved together, elbows touching and beers flowing, it was easily one of the most atmospheric meals I've ever experienced. Ten pizzas ordered, one each, but really to be sliced up and shared around, it was a smorgasbord of tomato, smoked Provolone, Parmigiano Reggiano and extra virgin olive oil, plus salame Napoli mozzarrela di bufala. The pizzas were so large they hung over the side of the plates, while the crust was quite small nodding to traditional methods, but also satisfyingly chewy. Toppings are all locally sourced and AVPN (Associzione Verace Pizza Napoletana) approved meaning there were lashings of San Marzano tomatoes, Caputo flour and fresh buffalo mozzarella for that authentic Neapolitan experience.\n\nFounder Gino Sorbillo's influence can be felt across the city though with numerous pizzerias dotted around offering different kinds of pizzas. Their hole-in-the-wall spot for example serves 'world-class' fried pizza wrapped in paper, so you hold a slice in one hand and another spritz in the other. People may not know that Naples is also known for its pastry shops offering sweets like rum baba, Torta caprese and Sfogliatelle. The latter is a shell-shaped pastry meaning 'small, thin leaf or layer', and was created in the monastery of Santa Rosa in Campania in the 17th Century before being acquired by a chef from Naples in 1818 when he started selling it in the city. Day two featured a stop off at Sfogliatelle Attanasio bakery, which meant there was no short supply of these delicacies. There's two varieties, Sfogliatelle riccia ('curly'), the standard version, and Sfogliatelle frolla, a less labour-intensive pastry that uses a shortcrust dough and does not form the characteristic layers.\n\nConsidered to be the best sauce tomatoes in the world and protected under Italian law or DOP, they have a thick flesh, few seeds and thin skins, which allows them to soak up the sun and produce that distinctive, sweet and aromatic flavour. Back amidst the chaos of the city, pizza was on the cards for our second night as we headed to Salvo for something a little bit different.\n\nWith tables pouring out onto the street, the heat of the late summer night finally abating and the spritzes - which included local delicacy the Maradona variation of Prosecco, Blue Curacao and soda - alongside Campari, Aperol all served in plastic cups, its understandable why it's become such a popular and bustling spot. Though our visit was short, and only of a culinary nature on this occasion, the city that many warn is dangerous, dirty and edgier than other European summer destinations is, in my opinion, not so much a diamond in the rough but a gem waiting for more people to explore it.",
  "medium": "Article",
  "links": [
    "https://www.express.co.uk/privacy-notice"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "European city",
      "weight": 0.08186483
    },
    {
      "name": "other Italian cities",
      "weight": 0.08146581
    },
    {
      "name": "city life",
      "weight": 0.07875788
    },
    {
      "name": "Naples",
      "weight": 0.050264377
    },
    {
      "name": "other European summer destinations",
      "weight": 0.047811937
    },
    {
      "name": "Neapolitan pizza",
      "weight": 0.04647918
    },
    {
      "name": "Campanias capital city",
      "weight": 0.045943648
    },
    {
      "name": "petty crime levels",
      "weight": 0.04527366
    },
    {
      "name": "the city streets",
      "weight": 0.04424366
    },
    {
      "name": "Associzione Verace Pizza Napoletana",
      "weight": 0.0437218
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/Travel & Transportation/Travel Guides & Travelogues",
      "score": 0.91650390625
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Other",
      "score": 0.9052734375
    },
    {
      "name": "/Reference/Geographic Reference/Other",
      "score": 0.57861328125
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Beaches & Islands",
      "score": 0.302001953125
    }
  ],
  "sentiment": {
    "positive": 0.07880401,
    "negative": 0.68076277,
    "neutral": 0.24043323
  },
  "summary": "The article discusses a trip to Naples, Italy's capital city, which has a reputation for being unsafe, dirty and chaotic due to historical issues with crime, particularly the Camorra, Naples' local mafia. Despite efforts by the local and national governments to boost Naples' reputation among tourists, there has been a reduction in petty crime levels since 2010. While Naples is generally safer than other Italian cities for crime, there is a risk of petty theft and the city is also warned of the possibility of Mount Vesuvius erupting. The article also highlights the potential for Mount Vesuius to erupt, which is one of the world's most-monitored volcanoes and advises travellers to keep an eye on the UK Foreign Office (FOC) for updates ahead of travel.",
  "shortSummary": "Nova, a chaotic, historic Italian city built at the base of Mount Vesuvius, offers a unique blend of Italian culture, cuisine, and potentially violent, despite its reputation as a dangerous place.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "270df868e1264a0094a5a5980e11c591",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Naples is a vibrant, chaotic city steeped in history, known for its lively streets, iconic pizza, and pastry delicacies, yet it has a reputation for petty crime linked to the Camorra and the looming threat of Mount Vesuvius. Recent government efforts have reduced crime and improved the city’s image, encouraging tourists to explore beyond the Amalfi Coast. The author’s 48‑hour trip highlighted the energetic atmosphere of local pizzerias like Sorbillo, the authenticity of AVPN‑approved ingredients, and the rich pastry culture exemplified by Sfogliatelle. Despite warnings, the experience showcased Naples as a dynamic gem worth visiting, blending culinary excellence with cultural vibrancy.",
  "argos_id": "LPH8ZNDFC"
}