{
  "url": "https://www.newsmax.com/newsfront/crime-maryland-democrat/2025/08/24/id/1223742/",
  "authorsByline": "Eric Mack",
  "articleId": "7eb5b5e40e234641b0de4ccbe6806e77",
  "source": {
    "domain": "newsmax.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Palm Beach County",
      "city": "Boca Raton",
      "coordinates": {
        "lat": 26.3586885,
        "lon": -80.0830984
      }
    }
  },
  "imageUrl": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=08c70edd-b685-4464-8925-721801f9a4ac&SiteName=Newsmax",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T13:46:48-04:00",
  "addDate": "2025-08-24T18:04:48.631470+00:00",
  "refreshDate": "2025-08-24T18:04:48.631472+00:00",
  "score": 1.0,
  "title": "Trump Slams Md. Dem Gov. Moore on Crime, Bronze Star Claim",
  "description": "President Donald Trump blasted Maryland Gov. Wes Moore on Sunday, accusing the Democrat of mismanaging crime in Baltimore and questioning his military record.In a lengthy post on Truth Social, Trump mocked Moore's public invitation to \"walk the streets\" of Maryland with...",
  "content": "President Donald Trump blasted Maryland Gov. Wes Moore on Sunday, accusing the Democrat of mismanaging crime in Baltimore and questioning his military record.\n\nIn a lengthy post on Truth Social, Trump mocked Moore's public invitation to \"walk the streets\" of Maryland with him, linking the challenge to Baltimore's well-documented struggles with violence.\n\n\"Gov. Wes Moore of Maryland has asked, in a rather nasty and provocative tone, that I 'walk the streets of Maryland' with him,\" Trump wrote Sunday in a Truth Social rebuke. \"I assume he is talking about out of control, crime ridden, Baltimore? As president, I would much prefer that he clean up this crime disaster before I go there for a 'walk.'\"\n\nFormer Maryland 7th Congressional District GOP candidate Kim Klacik famously walked the streets of Baltimore during the 2020 Black Lives Matter era, starting the whole \"walk the streets\" political narratives.\n\nTrump pulled no punches on Moore's record from his January 2023 swearing in, saying Baltimore is only getting worse.\n\n\"Wes Moore's record on crime is a very bad one, unless he fudges his figures on crime like many of the other 'blue states' are doing,\" Trump continued. \"But if Wes Moore needs help, like Gavin Newscum did in L.A., I will send in the 'troops,' which is being done in nearby D.C., and quickly clean up the crime.\"\n\nIn contrast to Moore's record, Trump hailed the early returns on deploying the National Guard to D.C.\n\n\"After only one week, there is no crime and no murder in D.C.!\" Trump hailed. \"When it is like that in Baltimore, I will proudly 'walk the streets' with the failing, because of crime, governor of Maryland.\n\n\"P.S. Baltimore is ranked the 4th worst city in the nation in crime & murder. Stop talking and get to work, Wes. I'll then see you on the streets!!!\"\n\nTrump also noted the governor being ungrateful for past help from the Trump administration.\n\n\"Also, I gave Wes Moore a lot of money to fix his demolished bridge,\" Trump concluded, finishing with his new trademark for Truth Social posts. \"I will now have to rethink that decision??? Thank you for your attention to this matter. MAKE AMERICA GREAT AGAIN! President DJT.\"\n\nIn a follow-up post, the president went further, raising doubts about Moore's military credentials.\n\n\"Did Wes Moore, the Governor of Maryland, lie about getting a Bronze Star?\" Trump wrote on Truth Social.",
  "medium": "Article",
  "links": [
    "https://www.newsmax.com/politics/kimklacik-baltimore-congress-trump/2020/08/24/id/983690/",
    "https://truthsocial.com/@realDonaldTrump/115084149454997135",
    "https://truthsocial.com/@realDonaldTrump/115084162750679122"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Maryland Gov. Wes Moore",
      "weight": 0.120489925
    },
    {
      "name": "Wes Moore",
      "weight": 0.11375554
    },
    {
      "name": "Gov. Wes Moore",
      "weight": 0.111724034
    },
    {
      "name": "Trump",
      "weight": 0.09980613
    },
    {
      "name": "Donald Trump",
      "weight": 0.09887713
    },
    {
      "name": "Moore",
      "weight": 0.09811715
    },
    {
      "name": "Crime",
      "weight": 0.09599839
    },
    {
      "name": "crime",
      "weight": 0.09599839
    },
    {
      "name": "President Donald Trump",
      "weight": 0.095958754
    },
    {
      "name": "Md. Dem Gov. Moore",
      "weight": 0.09299676
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.994140625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.916015625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.71826171875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.693359375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.4921875
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.454345703125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.359619140625
    }
  ],
  "sentiment": {
    "positive": 0.045921966,
    "negative": 0.7866347,
    "neutral": 0.1674433
  },
  "summary": "President Donald Trump has criticised Maryland Gov. Wes Moore for mismanaging crime in Baltimore and questioning his military record. In a post on Truth Social, Trump mocked Moore's invitation to \"walk the streets\" of Maryland with him, linking the challenge to the city's struggles with violence. He also questioned Moore's military record and claimed that he lied about receiving a Bronze Star. Despite these criticisms, Trump praised the National Guard deployment in D.C. as a success, and warned against complacency.",
  "shortSummary": "President Donald Trump criticized Maryland Governor Wes Moore for mismanaging crime and questioned his military credentials, while defending his intervention in Baltimore.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9088da8439cf4baea524e4f1681151e8",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "President Donald Trump criticized Maryland Governor Wes Moore for his handling of crime in Baltimore, mocking Moore’s invitation to \"walk the streets\" and questioning his military record. Trump highlighted Baltimore’s high crime rates, compared them to a recent National Guard deployment in Washington, D.C., and accused Moore of misreporting crime statistics. He also referenced past federal aid to the governor and suggested a reevaluation of that support.",
  "argos_id": "LPT34HH4U"
}