{
  "url": "https://www.fastcompany.com/91389108/this-under-used-strategy-can-help-with-well-being",
  "authorsByline": "Tracy Brower",
  "articleId": "580f21e1dd9041dbb860e0be9479de2d",
  "source": {
    "domain": "fastcompany.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://images.fastcompany.com/image/upload/f_webp,q_auto,c_fit,w_1024,h_1024/wp-cms-2/2025/08/p-1-91389108-Work-Life-Storytelling-contributes-to-wellbeing.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T05:00:00+00:00",
  "addDate": "2025-08-24T05:07:26.108859+00:00",
  "refreshDate": "2025-08-24T05:07:26.108860+00:00",
  "score": 1.0,
  "title": "This underused strategy can help with well-being",
  "description": "You’ve heard plenty of solutions for stress from meditation to yoga, the list is long. But this one rarely makes the list and it should.",
  "content": "Thinking about the best ways to reduce stress has become increasingly relevant. According to Gallup, 49% of Americans report they frequently experience stress. A survey by Talker Research found that a third of people also say they expect this to be the most stressful year yet, with even more stress than the last three years. But storytelling can have a positive impact on how we feel and how we relate to others. Here’s why, and how to use storytelling to feel better, enhance well-being, and beat stress. One of the biggest reasons that storytelling has a positive effect is because it can build relationships. Storytelling helps us find common experiences and bond.\n\nAccording to research, this was true from the first hunter-gatherer tribes in which storytelling helped to clarify the norms and expectations of the group and reinforce cooperation. In addition, storytellers tended to be popular. They were the people others choose to be with most. In another study where older adults wrote their life stories, researchers found storytelling reduced depression. The study found that developing stories was helpful, but the process of sharing stories and spending time together also had a significant impact on well-being. You can use storytelling to connect with others by asking questions, both at work and in your personal life. Instead of just asking someone how it’s going or what they did over the weekend, ask them a question that gives them a chance to tell a story: ask what surprised them lately or what made them laugh. Listen as they tell stories to answer your questions.\n\nDon’t be afraid to share your own stories about things that are interesting or meaningful to you. All of these will create more space for enhanced time and connections. Another key element of storytelling is that it can help us create meaning and identity. When we repeat the story about how we bravely stood up for something that was especially important to us at work, we reinforce that we are courageous. When we talk about the time we had the great idea that transformed a solution, we’re reinforcing our role as innovators on a team. When we share the adventures and antics that occurred on our family vacation, we’re reinforcing our love of family and our fun-loving nature. In one study by the Family Institute at Northwestern University, couples were asked to tell stories about their relationships. When couples developed stories about their experiences, it helped reinforce their shared identity and it gave them greater meaning and purpose.\n\nYou can use storytelling to enhance well-being and create meaning by intentionally reflecting on your experiences. For example, at the end of a vacation, consider the time you spent with family and friends and what the experiences meant to you. Talk to each other about your favorite elements of your time together in order to cement your memories. Or the end of the workweek, reflect on your accomplishments and challenges and give thought to how they show your strengths and contributions to your team and your organization. Capturing these stories can help reinforce your meaning and identity. Storytelling can also help us make sense of things. In, a survey of almost 30,000 people in 31 countries, GlobeScan found that 78% of respondents believe that the world is changing too fast for them to keep up, and it’s creating anxiety.\n\nStorytelling can help us think things through. We consider what happened to us, why it was important, and how we feel about it as we create a story. The process of reflecting so we can tell a story clarifies our thinking and helps us make sense of disparate facts. Storytelling can also help us put things into context and help us think about where to go next. In the Northwestern University study, when couples told stories, they were able to consider future growth and motivate themselves to be a legacy to others in their lives. A study of storytelling published in the journal Healthcare (Basel) found that when sick patients shared their stories, it helped them to make sense of their experiences and even nurture a more positive, healing viewpoint.\n\nYou can use storytelling to enhance well-being and make sense of things by slowing down to reflect on what’s happening and giving thought to why it’s important to you. Also prioritize how you might respond and how you’d like the story to end based on the action you take. Use story to understand yourself and what’s going on around you, as well as where you’d like to go from here. We are moved by stories and they help us build empathy. Stories can also inspire us to take action. In fact, a study found when Super Bowl ads tell complete stories, they tend to get more views, more shares, better ratings; and they tend to result in greater sales. We prefer to learn through stories, and we thrive in communities with plenty of narrative shared among the group. When we face pressure, challenges, and struggles, storytelling helps us make connections, creat meaning, and make sense of it all.",
  "medium": "Article",
  "links": [
    "https://www.mansueto.com/privacy-policy/",
    "https://www.fastcompany.com/apply/most-innovative-companies",
    "https://news.gallup.com/poll/642704/americans-sleeping-less-stressed.aspx",
    "https://pmc.ncbi.nlm.nih.gov/articles/PMC9957174/",
    "https://www.fastcompany.com/newsletters",
    "https://globescan.com/2024/01/25/insight-of-the-week-people-feel-overwhelmed-by-pace-of-change-in-the-world/",
    "https://www.newswise.com/articles/we-stories-demonstrates-how-couples-can-tell-stories-to-strengthen-their-connection",
    "https://pmc.ncbi.nlm.nih.gov/articles/PMC5956751/",
    "https://talkerresearch.com/poll-a-quarter-of-americans-are-burnt-out-before-theyre-30/",
    "https://www.nature.com/articles/s41467-017-02036-8",
    "https://www.jstor.org/stable/43966584"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Stories",
      "weight": 0.10246611
    },
    {
      "name": "stories",
      "weight": 0.10246611
    },
    {
      "name": "story",
      "weight": 0.10246611
    },
    {
      "name": "complete stories",
      "weight": 0.10042469
    },
    {
      "name": "Storytelling",
      "weight": 0.081230804
    },
    {
      "name": "storytelling",
      "weight": 0.081230804
    },
    {
      "name": "enhanced time",
      "weight": 0.06782514
    },
    {
      "name": "greater meaning",
      "weight": 0.05941581
    },
    {
      "name": "time",
      "weight": 0.05547583
    },
    {
      "name": "their life stories",
      "weight": 0.054953318
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/People & Society/Self-Help & Motivational",
      "score": 0.81005859375
    },
    {
      "name": "/People & Society/Social Sciences/Psychology",
      "score": 0.48291015625
    },
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.391357421875
    }
  ],
  "sentiment": {
    "positive": 0.24727142,
    "negative": 0.36084437,
    "neutral": 0.3918842
  },
  "summary": "According to Gallup, 49% of Americans frequently experience stress and expect this year to be the most stressful year yet, with even more stress than the previous three years. However, storytelling can have a positive impact on how we feel and how we relate to others, particularly in relation to finding common experiences and bonding. It can also help us create meaning and identity, reinforcing our role as innovators and innovators on a team. Stories can also enhance well-being and create context for our experiences and help us make sense of things. A study by the Family Institute at Northwestern University found that when couples were asked to tell stories about their relationships, it gave them greater meaning and purpose. Stories also help to clarify the norms and expectations of the group and reinforce cooperation among groups. The use of storytelling to connect with others can create more time and connections, and it can help us understand and act based on the story to understand what is important to you.",
  "shortSummary": "Storytelling can enhance well-being, relationships, and create meaning, benefiting both work and personal lives, despite increasing stress and anxiety.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "364d71d220d34a9590983545c8b7a713",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://news.gallup.com/poll/642704/americans-sleeping-less-stressed.aspx",
      "text": "WASHINGTON, D.C. -- For the first time in Gallup polling since 2001, a majority of U.S. adults, 57%, say they would feel better if they got more sleep, while 42% say they get as much sleep as they need. This is nearly a reversal of the figures last measured in 2013, when 56% of Americans got the sleep they needed and 43% did not.\nAmericans’ perception that they aren’t getting enough sleep is borne out by the diminished number of hours of sleep they report getting per night.\nThese differences in average sleep reflect substantial changes over time in the percentage of U.S. adults sleeping eight or more versus five hours or less per night. In 1942, 59% were getting eight-plus hours of sleep, while only 3% reported getting five hours or less. By 1990, the percentage reporting eight or more hours had fallen to 27%, while the proportion getting five or less was up to 14%. Today, a quarter are still getting eight-plus hours, but the percentage getting five or less has risen to 20%.\nThe latest results are from a Dec. 1-20, 2023, Gallup poll.\nYoung Women Least Likely to Get Enough Sleep\nWomen have been consistently less likely than men to report getting enough sleep. The latest poll finds 36% of women versus 48% of men saying they get the sleep they need. Both figures represent significant declines from previous readings in 2013 and 2004 and are the lowest Gallup has measured for each group to date.\nGenerally, adults 65 and older are more likely than those who are younger to get the sleep they need. This holds true across the trend. That said, the decline this year in getting as much sleep as needed holds for all age groups, though it is less pronounced among young adults, aged 18 to 29. All other groups show declines in excess of 10 percentage points.\nYounger women, at 27%, are much less likely than other age-by-gender groups to report getting adequate sleep. Younger men, at 46%, and older women, at 44%, are about equally likely to report getting adequate sleep, while older men, as is typical, are most likely to do so, with 51% getting the sleep they need in 2023.\nGiven that the percentage of young women getting enough sleep is so much lower than for other groups, the gender gap is much larger among younger than older adults. In 2023, there is a 19-point difference between women and men aged 18 to 49, while the gap between women and men aged 50 and older is seven points.\nYounger men show only a modest drop in reporting getting adequate sleep over time, while a growing number of younger women aren’t getting the sleep they need. In 2001, a slight majority of younger men, 54%, reported getting enough sleep, dropping to 46% in 2023. For younger women, 42% reported getting the sleep they need in 2001, while today, only 27% say so.\nAmericans More Stressed Today Than Three Decades Ago\nWhat might be driving these downward trends in sleep? Research on health and wellness shows a strong connection between stress and sleep quality. According to the American Psychological Association, the relationship between sleep and stress goes both ways -- those who sleep less are more stressed, and those who are more stressed sleep less. Indeed, the new poll shows that 63% of those who report wanting more sleep say they frequently experience stress, compared with 31% of those who get the sleep they need.\nOver the past 30 years, the number of Americans who are stressed has been on a steady incline after a sharp drop in 2003. The most recent data show that nearly half of all Americans, 49%, report frequently experiencing stress, up 16 points over the past two decades and the highest in Gallup’s trend to date.\nJust as with sleep, there continues to be a gap in stress levels between women and men in the U.S. That gap has fluctuated over time; it was narrowest between 2004 and 2007. However, over the past six years, the gap has grown. In 2023, 53% of women report frequently experiencing stress, compared with 45% of men.\nYounger women are the most likely of the four major gender-by-age groups to say they frequently experience stress, exceeding men their age by 14 points. They are also 29 points more likely than women 50 and older to report frequent stress.\nYounger women have also experienced the sharpest increase in frequent stress of the four groups, with their levels rising 23 points since 2007, compared with an eight-point increase among older women. By contrast, the levels of reported frequent stress have increased three points among younger men and five points among men 50-plus since 2007.\nImplications\nAmericans are sleeping less and are less satisfied with the amount they sleep. Reports of frequently feeling stressed are also on the rise. Gallup polling and other research show a strong connection between sleep, stress, and overall health. Thus, the impact of both of these trends on Americans’ health could be substantial.\nThe decline in sleep and the increase in stress levels in the U.S. are consistently worse for younger women than for men and older women. This aligns with Gallup’s data on mental health and wellbeing, which show that younger Americans and women seem to be suffering at greater rates. For example, depression is on the rise for women and younger adults, and women and younger Americans are more likely to evaluate their mental health as fair or poor compared with men and older adults. Furthermore, a recent Walton Family Foundation and Gallup study on Generation Z finds that getting enough sleep and relaxation play an important part in happiness among America’s youth. Gen Z who report having enough time to sleep and relax are twice as likely to say they are happy as those who do not get enough sleep or relaxation.\nTo stay up to date with the latest Gallup News insights and updates, follow us on X.\nLearn more about how the Gallup Poll Social Series works."
    },
    {
      "url": "https://www.newswise.com/articles/we-stories-demonstrates-how-couples-can-tell-stories-to-strengthen-their-connection",
      "text": "Newswise — Evanston, IL – Reclaiming positive stories can help couples that have become distant, strained and stressed find ways to connect and strengthen their relationships. Dr. Karen Skerrett, a staff clinician and faculty member at The Family Institute at Northwestern University, explores this concept in her co-authored book, Positive Couple Therapy: Using We-Stories to Enhance Resilience (Routledge, 2014).\nUsing the authors’ combined years of psychological expertise, the book teaches couples and therapists unique methods for uncovering positive potential within a relationship, and focuses on “We-stories”: shared stories between the members of a couple that define and guide their relationship. The book defines and illustrates in concrete ways what is meant by the “we” — an element increasingly found in research to be a key dimension for couple resilience.\n“We-stories serve four vital positive functions for couples,” says Dr. Skerrett. “They help shape the couple’s mutual identity; provide meaning and purpose in the couple’s life; serve as guides for current interaction and future growth; and are positive repositories of the couple’s wisdom and a means of transmitting their legacy to others in their lives.”\nThe book demonstrate these “we-stories,” and how they help couples connect. Couples that are able to find their stories, share them with each other, and then carry them forward to family, friends and a larger community are more likely to preserve a sense of mutuality that will thrive over a lifetime of partnership.\n“The book arose from a joint passion to rebalance the negative emphasis in the field of couple treatment,” says Dr. Skerrett. It is filled with vivid couple stories, and case examples of couples from a diverse perspective such as LGBT and military couples. It contains exercises for partners and couples, and illustrates opportunities and challenges for couple growth at various stages across the life cycle.\n“The key ideas can be applied in therapy by assisting partners to discover significant memories that can form their we-story,” says Dr. Skerrett. “The memorable image or metaphor that emerges can become a couple touchstone and positive symbol of the relationship, and used as an anchor during challenging times.”\nDr. Karen Skerrett is a licensed clinical psychologist, Advanced Practice Registers Nurse and faculty member at The Family Institute at Northwestern University. Dr. Skerrett maintains a clinical and consulting practice specializing in the treatment of couples and families, particularly those challenged by illness and disability. She also teaches in the Counseling program and is a clinical supervisor for the postdoctoral fellows.\nTo get in touch with Dr. Skerrett, or to learn more about The Family Institute, contact Colleen O’Connor at 312-609-5300 ext. 485 or [email protected].\nABOUT THE FAMILY INSTITUTE AT NORTHWESTERN UNIVERSITY – For 45 years, The Family Institute at Northwestern University (www.family-institute.org) has been committed to strengthening and healing families from all walks of life through clinical service, education and research. An affiliate of Northwestern University, The Family Institute is a unique, innovative not-for-profit organization, governed by its own independent Board of Directors and responsible for its own funding. The Institute offers a wide range of high quality mental health counseling through our staff practice and our sliding-fee scale Bette D. Harris Family and Child Clinic, where we are committed to serving at-risk, under-resourced communities. The Family Institute also operates two nationally-renowned graduate programs in marriage and family therapy and counseling psychology in affiliation with Northwestern University, and conducts cutting edge research projects that lead to a better understanding and treatment of mental health issues."
    },
    {
      "url": "https://talkerresearch.com/poll-a-quarter-of-americans-are-burnt-out-before-theyre-30/",
      "text": "A quarter of Americans are burnt out before they’re 30, finds our latest research.\nOur survey of 2,000 adults looked at how the stress of the past decade has culminated and found that the average respondent experiences peak burnout at around 42 years old.\nFor Gen Z and millennial adults, now 18 to 44, the highest point of their stress is occurring even younger — averaging at 25 years old.\nLooking at how they got here through their current stress levels, the average person is at half of their stress capacity.\nYet, 42% are feeling even more stressed than this — with Gen Z and millennials feeling this more heavily than respondents belonging to Gen X or older (51% vs. 37%).\nWhen asked what’s currently causing their burnout, finances were most commonly ranked as the top factor (30%).\nPolitics (26%), work (25%) and their physical health (23%) were also significant sources of major worries for respondents.\nAll kinds of relationships are weighing on those surveyed, with one in six of those who named their love life or their family as a stressor putting it in the top spot (18% each).\nAmong younger generations, work is the greatest point of contention (33%), with finances (27%) and mental health (24%) following suit.\nGen X respondents, baby boomers and those belonging to the silent generation said that politics is most concerning (27%), while their physical health is also an area of worry (24%).\nGen Z and millennials are not as concerned with their social life (12%) and love life (14%), while older generations say that the balance of their life and personal growth goals fall to the wayside for them (13% each.)\nA third of Americans are gearing up for what they anticipate being their most stressful year yet, predicting that 2025 will be worse than the past three years.\nHowever, more are hopeful than not, that the rest of this year will be more promising than last (42%).\nWhen it comes to how stress will evolve with the years, 83% of those surveyed admit that entering adulthood today is more challenging than it was a decade ago.\nAdditionally, seven in 10 agree that it’ll only get more challenging to be an adult within the next 10 years (72%), with older Americans recognizing that more than the younger generations (75% vs. 63%).\nRebecka Parker, clinical social work and therapist, MSW, LCSW and writer at Birpnotes shared advice for how respondents of different generations can manage their stress before it becomes overwhelming:\n- “For Gen Z & millennials: Digital detoxes, financial literacy education, and prioritizing real-life social connections.\n- For Gen X & [baby] boomers: Mindfulness practices, setting boundaries, and proactive health screenings.\n- For all ages: Prioritizing mental health, seeking therapy when needed, and fostering strong support networks.”\nSurvey methodology\nTalker Research surveyed 2,000 Americans; the survey was administered and conducted online by Talker Research between Feb. 7 and Feb. 10, 2025.\nRead more about our methodology.\nFeatured photo by Gabrielle Henderson\nOther posts\nAugust 22, 2025\nAmericans are guilt tipping much less in 2025\nTalker Research reveals Americans are “guilt tipping” much less in 2025…\nAugust 21, 2025\nTravel trends: younger Americans are relying on AI more and more for travel planning\nOur recent travel trends survey shows that younger Americans are relying on AI…\nJuly 22, 2025\nPoll reveals which Zodiac signs take their birthday the most seriously\nA Talker Research poll found Gen Z Americans are the most passionate about…"
    },
    {
      "url": "https://www.nature.com/articles/s41467-017-02036-8",
      "text": "Abstract\nStorytelling is a human universal. From gathering around the camp-fire telling tales of ancestors to watching the latest television box-set, humans are inveterate producers and consumers of stories. Despite its ubiquity, little attention has been given to understanding the function and evolution of storytelling. Here we explore the impact of storytelling on hunter-gatherer cooperative behaviour and the individual-level fitness benefits to being a skilled storyteller. Stories told by the Agta, a Filipino hunter-gatherer population, convey messages relevant to coordinating behaviour in a foraging ecology, such as cooperation, sex equality and egalitarianism. These themes are present in narratives from other foraging societies. We also show that the presence of good storytellers is associated with increased cooperation. In return, skilled storytellers are preferred social partners and have greater reproductive success, providing a pathway by which group-beneficial behaviours, such as storytelling, can evolve via individual-level selection. We conclude that one of the adaptive functions of storytelling among hunter gatherers may be to organise cooperation.\nSimilar content being viewed by others\nIntroduction\nCooperation is a central problem in biology1, 2. This is especially true in humans given the range of extensive cooperation observed, including food sharing3, 4, allocare5, 6 and political coalitions7. Adaptive explanations for cooperation—broadly defined as a behaviour which evolved to benefit others8—often focus on the ‘free-rider problem’; that is, explaining how a behaviour which decreases fitness (at least in the short-term) can be evolutionarily advantageous. Many solutions to this problem have been proposed, such as kin selection9, reciprocal cooperation10, costly signalling11 and indirect reciprocity12, among others. However, even in situations where cooperation would be the best strategy for all involved, cooperation may not occur due to ‘problems of coordination’. Under these circumstances, cooperation is not hindered by the potential for free-riding, but rather by a lack of common knowledge over the behaviour of others13, 14. Meta-knowledge is therefore required to solve these problems of coordination. In other words, it is not enough to know how to act in a given situation; individuals need to know that others also know how to act. While language is undoubtedly essential as a medium of communication for coordination15, here we propose that storytelling in particular may have played an essential role in the evolution of human cooperation by broadcasting social and cooperative norms to coordinate group behaviour (see also refs. 16, 17).\nStorytelling is a human universal18 which occurs spontaneously in childhood19, while cross-cultural phylogenetic analyses have shown that folk stories may be highly conserved20. The universal presence and antiquity of storytelling indicates that it may be an important human adaptation21,22,23,24. Hunter-gatherer societies have strong oral storytelling traditions dictating social behaviour regarding marriage, interactions with in-laws, food sharing, hunting norms and taboos25,26,27. These stories appear to coordinate group behaviour and facilitate cooperation by providing individuals with social information about the norms, rules and expectations in a given society15, 28, 29. It has recently been argued that religion with high-gods is a form of fictional story that helped in the expansion of large-scale human cooperation30. However, moralistic high-gods cannot be the original form of norm-enforcing fiction in human societies, as phylogenetic reconstructions suggest that they only emerged after increased political complexity associated with agricultural expansion31. Furthermore, hunter-gatherers display widespread cooperation (such as camp-wide food sharing, rituals for conflict resolution and long-term cooperation with unrelated individuals), and, despite being inveterate storytellers25, 29, mostly lack the belief in moralistic high-gods32. Although others have proposed that storytelling was an important step in human evolution16, 21,22,23,24, this hypothesis remains largely untested using real-world empirical data. For these reasons, we decided to analyse the content and functions of storytelling in a hunter-gatherer population (the Agta).\nHere we show that: (i) Agta stories convey messages of cooperation, sex equality and social egalitarianism; (ii) stories from other hunter-gatherer societies also appear designed to coordinate social behaviour and promote cooperation; (iii) individuals from camps with a greater proportion of skilled storytellers are more cooperative; (iv) skilled storytellers are preferred social partners and more likely to be cooperated with and (v) skilled storytellers possess greater reproductive success. We conclude that storytelling may perform an adaptive function by organising cooperative systems in hunter-gatherer societies. These results also provide a pathway by which group-beneficial behaviours, such as storytelling, can evolve via individual-level selection.\nResults\nHunter-gatherer stories coordinate social behaviour\nWe collected stories in a community of Agta in Palanan, the Philippines. We asked three elders to tell us stories they normally tell children and each other. The elders told us four stories over three nights (Table 1). All stories featured humanised natural entities such as animals or celestial bodies, but no Agta. All stories conveyed norms and principles regulating cooperation and social behaviour, specifically sex equality (‘The sun and the moon’), social egalitarianism and friendship (‘The wild pig and the seacow’), group cooperation (‘The monkey and the giant’) and group identity and social acceptance (‘The winged ant’). In these stories the ending reflects a reconciliation of individual interests and differences, while also exemplifying various mechanisms of social norm enforcement, such as emphasising the benefits to cooperation over competition, examples of punishment for breaking norms, and reverse dominance hierarchies to prevent individual accumulation of power16, 33. These topics are recurrent in stories from other hunter-gatherer groups (Supplementary Table 1). To explore the content of hunter-gatherer stories in greater detail we collected 89 stories over seven different forager societies and coded them according to subject matter (see Methods for further details). Of these stories, around 70% were classified as pertaining to ‘social behaviour’ (i.e. prescribing social norms or coordinating behavioural expectations), more than any other category (Supplementary Table 2). Therefore, storytelling in general may provide a mechanism to coordinate behaviour and expectations, transmit social information and promote cooperation in hunter-gatherer camps.\nStorytelling is associated with camp-level cooperation\nConfirming this expectation, we found that camps with a greater proportion of skilled storytellers were associated with increased levels of cooperation. We measured individual reputations for storytelling by asking people (n = 297, over 18 camps in two municipalities) to name the best storytellers in camp (we imposed no lower or upper limit on the number of nominations; see ‘Methods’). For each camp, the average proportion of nominations received by each individual was used as a proxy for camp-level storytelling skill. We also asked 290 Agta adults from these camps to play an experimental resource allocation game in which subjects could either keep or share any desired fraction of a resource34. A multi-level linear regression model controlling for camp size, average camp relatedness and municipality showed that a greater proportion of individuals nominated as storytellers in a camp was significantly associated with increased cooperativeness (b = −215.6, 95% CI: [−47.8; −383.4], p = 0.012: Fig. 1, Supplementary Table 3). The regression coefficient implies that a 1% increase in nominations of good storytellers was associated with an increase in donations by 2.2 percentage points. This association is consistent with skilled storytellers spreading cooperative norms and promoting cooperation in camps. However, this association may have alternative explanations and result from other social processes. For example, more cooperative camps may tell a greater number of stories, perhaps because they are more socially cohesive (although in Supplementary Table 4 we demonstrate that this result is unlikely to be an artefact of camp-mate familiarity, as these findings hold when controlling for the frequency of repeated interactions in a sub-set of camps). Therefore, if storytelling plays a functional role in promoting cooperation, we predict that skilled storytellers would be preferred as social partners. In contrast, if storytelling is only a consequence or by-product of cooperation, preferred social partners are likely to be chosen on the basis of other characteristics, such as foraging skill or medicinal knowledge.\nSkilled storytellers are preferred social partners\nSince living in a more cooperative camp brings benefits at individual levels (even for non-cooperators), we tested whether people would prefer to live in camps with more skilled storytellers, where norms of cooperation are more likely to be spread. To assess storytelling reputation, for each camp the number of nominations received by each individual was converted into z-scores and transformed into a binary response variable (‘skilled’ vs. ‘non-skilled’ storyteller; see ‘Methods’). We asked 291 Agta across the 18 camps to choose who they would most like to live with (with a maximum of five nominations), obtaining 857 nominations out of a possible 6534 dyads (all of which were within-camp nominations). We ran a logistic generalised estimation equation (GEE) regression to predict the probability of being picked as a future camp mate from the measure of individual storytelling reputation. We found that skilled storytellers were nearly twice as likely to be nominated as less skilled individuals (Table 2, model 1). This pattern holds after controlling for kinship, reciprocal nominations, distance, as well as age and sex variables (Table 2, model 2). In addition to storytelling, other reputational measures were assessed, including skill in hunting, fishing, tuber gathering, medicinal knowledge and camp influence (Methods). Including these factors in the model (Table 2, model 3) indicated that storytelling was the most important reputational attribute, with skilled storytellers again having roughly double the odds of being nominated relative to non-skilled storytellers (OR = 1.95), an effect much larger than that of possessing a good fishing reputation, the second-best reputational predictor (OR = 1.5). Removal of all non-significant variables does not alter these findings (Supplementary Table 5). The effect size of storytelling ability was approximately the same magnitude as selecting primary kin (PK) and reciprocal partners. These results demonstrate that the Agta prefer to live in camps with skilled storytellers, who are even more valued than good foragers, which may reflect the importance of storytellers in promoting cooperation and bringing gains to all individuals in a camp (although storytellers may also be favoured for disseminating other fitness-relevant information as well, such as foraging, survival and geography16, 26, 35, 36). Although these results point to a group-level advantage of storytelling, they do not indicate what would be the individual benefit for storytellers (although see ref. 24). In other words, they do not explain why individuals would invest in acquiring a costly skill with no apparent individual fitness benefits compared to other skills such as hunting, gathering or fishing.\nSkilled storytellers have higher reproductive success\nStorytelling is a costly behaviour requiring an input of time and energy into practice, performance and cognitive processing37, 38. Indeed, several ethnographic sources highlight the theatrical and active nature often associated with storytelling performances27, 29. In addition, the group-level benefits of storytelling are susceptible to free-riders, who could reap the benefits of storytelling without paying the costs1. Thus, all else being equal non-storytellers should have higher fitness, unless storytelling brings direct fitness benefits to skilled storytellers. We therefore investigated reproductive success as a function of storytelling skill among the Agta. We ran a mixed-effects linear regression of number of living offspring on storytelling ability (controlling for age, sex and camp: Supplementary Table 6). The results show that skilled storytellers had an additional 0.53 living offspring compared to non-skilled storytellers (b = 0.53, 95% CI: [0.10; 0.96], n = 324, p = 0.016), indicating that storytelling skill is associated with increased fitness (Fig. 2). Both camp-mate nomination and fitness results are robust to manipulations, such as using continuous, rather than binary, assessments of storytelling ability, and quantifying storytelling ability separately for each sex (due to the potential for female Agta to be over-represented as skilled storytellers: see ‘Methods’ & Supplementary Tables 6–9).\nIt is possible that by performing an important social function skilled storytellers receive increased social support from others39, which has been associated with increased fitness among numerous primate species40, consistent with the fact that they are preferred social partners. Supporting this interpretation, we also demonstrate that skilled storytellers are more likely to be recipients of resource transfers in the experimental game (Supplementary Tables 10 and 11). This suggests that storytellers may be ‘rewarded’ for their public good by other camp mates who benefit from the increased cooperation which storytellers may promote, in what may be mutually beneficial trade-like relationships (although the individual-level benefits to those who cooperate with storytellers remain in need of further empirical study). People might also enjoy listening to stories for other reasons, such as a form of ‘mental simulation’ to learn about their social and physical environment24, 41,42,43,44,45,46,47, and be paying for the service (this effect could be independent from the function of storytelling in promoting cooperation).\nDiscussion\nWe conclude that storytelling may perform an important adaptive function in hunter-gatherer societies by organising cooperative systems, serving the function of ‘broadcasting’ cooperative norms. Storytelling among the Agta and other hunter-gatherers conveys strong messages of cooperation, sex and social equality, and inequality aversion, and are widely told in camps to adults and children25. These stories appear to promote cooperation within a camp, as the proportion of skilled storytellers is positively associated with measures of camp-level cooperation. Furthermore, people show a strong preference to live with good storytellers, even more so than with good foragers, despite the fact that Agta society is characterised by extensive food sharing4. By introducing individuals to situations beyond their everyday experience, narratives may also increase empathy and perspective taking towards others, including strangers48,49,50 (although see ref. 51), potentially facilitating camp-level coordination and cooperation. The value of good storytellers is reflected in the fact that they also have increased reproductive success and receive more resources than less-skilled storytellers. We therefore provide a pathway by which storytelling, a group-beneficial behaviour, can evolve via individual-level selection (however, further research is necessary to understand the individual-level benefits of camp-mates cooperating with storytellers). Although narratives are known to serve other adaptive functions, such as disseminating information on survival, foraging and the environment16, 26, 35, 36, or simply to entertain and hold the audience’s attention23, we provide evidence that storytelling may have also been an important factor in facilitating widespread human cooperation. It is therefore possible that cooperation and storytelling co-evolved via a process of mutual reinforcement.\nThe evidence provided here is consistent with the theory that storytelling acts as a mechanism to coordinate group behaviour and promote cooperation. However, these findings are largely correlational and further studies are required to conclusively demonstrate that storytelling performs a causal role in facilitating cooperative behaviour. One potential option would be to conduct longitudinal work to explore if patterns of camp-level cooperation vary with changes in camp composition, explicitly regarding the addition or loss of skilled storytellers. Logistically, however, this approach is very demanding, therefore a simpler approach to establish causality may be to use ‘priming’ experiments, such that those primed with a cooperative story ought to cooperate more in a subsequent task. Similar studies have previously been conducted (although not explicitly regarding storytelling), suggesting that individuals in experimental games are more cooperative if they can communicate and therefore coordinate their behaviour15, 52, consistent with the mechanism proposed here. Additionally, although we demonstrate an association between the presence of skilled storytellers in camp and levels of cooperation, future studies may benefit from utilising more direct indices of storytelling, such as the amount of storytelling in a camp, to assess this putative link in greater detail.\nHumans have evolved the cognitive ability to create and believe in stories. We propose that those features evolved in hunter-gatherer societies as precursors to more elaborate forms of narrative fiction, such as moralising high-gods. In hunter-gatherer societies, which are highly egalitarian53, 54 and cooperative4, 55, 56, but where organised religion and moralising high-gods are commonly absent32, storytelling appears to promote cooperation, spread cooperative norms57 and represent punishment of norm-breakers. In sum, we argue that storytelling may perform an adaptive function by organising cooperation in hunter-gatherers, preceding the emergence of more complex fictions such as all-knowing and punitive high-gods associated with the expansion of large-scale cooperation in human societies only after the origin of farming30. From simple storytelling to complex religion, and later formal institutions such as nation states, the evolution of storytelling may have been pivotal in organising and promoting human cooperation.\nMethods\nEthnographic background\nThe Agta are an indigenous Filipino population, believed to be descendants of the first colonisers of the Philippines over 35,000 years ago58, and are distinguishable from their non-Agta neighbours by their short ‘pygmy’ physique, dark skin, tight curly hair and predominantly foraging mode of subsistence. The Agta in the study population are from the Northern Sierra Madre Natural Park in Isabela Province, north-east Luzon, a remote area of protected forest land accessible only by plane, boat, or a three-day hike. Specifically, the study focuses on two sub-populations, the Palanan Agta, who number around 1,000 individuals, and the Maconacon Agta, who number around 250 individuals. These sub-populations live ∼50 km apart and are largely separate, with few genealogical links between the two. Both sub-populations live on or near river-banks or coastal areas, and predominantly engage in foraging activities, particularly fishing, but also hunting, collecting honey, and gathering wild plants, which they either consume or trade for rice with the local agricultural non-Agta population. Depending on availability, some Agta also participate in wage labour (often clearing land for non-Agta farmers) or assist in rice harvesting, where they often receive a share of the harvest. Camp sizes vary between solitary dwellings (7 individuals) and large camps of up to 26 houses (156 individuals), with an average of 7 houses (49 individuals). Although many Agta nominally classify themselves as Christian (of various denominations), few Agta regularly attend church or possess much knowledge about Christianity. A few camps are more integrated with organised religion, particularly due to Born Again Christian Missionaries, where traditional beliefs in ‘bad spirits’ (anitos) are combined with Christianity. In traditional Agta cosmology there are no moralising or punishing high-gods. Initial demographic fieldwork was conducted between April and June 2013, with further fieldwork conducted between February and October 2014.\nStorytelling definition\n‘Storytelling’ is defined loosely here to encompass a spectrum of narrative forms, from ‘ritualised’ storytelling, often in larger groups and accompanied by cosmological or religious content, to less-structured storytelling as a part of everyday conversation among smaller groups. Cutting across these contextual differences, a story can be broadly defined as ʻan account of a sequence of events in the order in which they occurred to make a point’59. A story can also be defined by its components, and several lines of evidence have converged from literary theory and cognitive psychology which suggest that narratives consist of: character, setting, events, causal connections and resolution (for a review see ref. 24). These are inclusive definitions of ‘storytelling’, which encompass both ritualised or fictional stories, as well as many aspects of everyday conversation which also contain non-fictional narratives, such as jokes, anecdotes or details of previous experiences. Although much research focuses on fictional stories29, the importance of non-fictional narratives should not be overlooked. For instance, in her work with the Ju/’hoansi, Wiessner25 provides details of several stories, all of which are non-fictional, which broadcast social norms concerning issues such as sex, marriage, sharing obligations and norm-breakers (see also Supplementary Table 1 for other examples of non-fictional stories, such as by the Batak).\nAssessing storytelling reputation\nTo assess storytelling reputation, 297 Agta over 18 camps (mean age = 37, range = 16–70, males = 142) were asked to name the best storytellers in camp (there was no limit on the number of names individuals could select). From this, storytelling ability was calculated for 324 Agta. To permit comparisons between camps of different sizes the number of nominations for each individual were converted into z-scores for each camp separately (calculated by subtracting the camp mean from the individual score, then dividing this by the camp standard deviation). Due to a heavily-skewed distribution (lots of poor, but few good, storytellers; Supplementary Fig. 1), these were converted into a binary variable, with skilled storytellers being those above the mean for their camp (i.e. a positive z-score). From this, 199 Agta were classified as ‘unskilled’ storytellers (males = 109), while 125 were categorised as ‘skilled’ (males = 51). The average relatedness of individuals to camp-mates, relative to the overall camp relatedness, was no different between skilled and unskilled storytellers (mean relatedness relative to overall camp relatedness for skilled storytellers = 0.001, SE = 0.005, mean relatedness relative to overall camp relatedness for unskilled storytellers = −0.001, SE = 0.004; t = −0.229, n = 324, p = 0.819), suggesting that nominations for storytellers were unaffected by relatedness.\nOne potential issue with this methodology is that it focuses on within-camp comparisons of storytelling ability, such that storytelling skill may be relative to each camp, rather than absolute for the population, which may hinder between-camp comparisons. However, this is unlikely to have occurred as the average proportion of nominations for each individual per camp ranged from 0.03 to 0.21 (see ‘Resource Allocation Game’ section below), indicative of substantial between-camp variation in the number of nominations for storytelling ability. Additionally, the proportion of individuals who nominated no-one varied considerably between camps (from 0% to 62.5%). A χ 2 test of independence reported that the frequency of individuals nominating no-one varied significantly between camps (χ 2(17, n = 297) = 82.28, p < 0.001). Together, these suggest that storyteller nominations were not simply relative to camp-mates, but rather reflect absolute differences in skill.\nIn a logistic regression containing age and sex, older individuals possessed a greater storytelling reputation (b = 0.04, 95% CI: [0.02; 0.06], n = 324, p < 0.001). An interaction was also found between age and sex (Supplementary Fig. 2), with storytelling ability increasing more with age for men than for woman (b = 0.04, 95% CI: [0.01; 0.08], n = 324, p = 0.033). Women were also more likely to be skilled storytellers than men (b = −0.76 (ref. female), 95% CI: [−0.27; −1.25], n = 324, p = 0.002). While both sexes selected an equivalent proportion of same-sex individuals as skilled storytellers (female mean = 0.73, male mean = 0.69, Mann Whitney U = 6,162, n = 297, p = 0.38), females nominated a greater number of individuals overall (female mean = 1.97, male mean = 1.47, Mann Whitney U = 8,760, n = 297, p = 0.004), which may explain why women were over-represented as skilled storytellers relative to men. If z-scores for storytellers are calculated separately for each sex to control for the bias of females nominating other females, we find that the effect of sex on storytelling skill is largely attenuated, but still approaches significance in the direction of more skilled female storytellers (b = −0.42, 95% CI: [0.05; −0.89], n = 324, p = 0.083). The effect of age is still strongly significant (b = 0.04, 95% CI: [0.02; 0.06], n = 324, p < 0.001), while a significant interaction between age and sex is again reported if this is included in the model (b = 0.04, 95% CI: [0.00; 0.08], n = 324, p = 0.04).\nIn addition to assessing storytelling reputation, these 297 individuals were also asked to nominate the best hunters, fishers, tuber-gatherers, and those with the most medicinal knowledge. Camp influence was also assessed, but in a slightly different way, by asking ʻif there is a discussion in camp, whose opinions are listened to the most? Who is malakas (strong)?’ Individual z-scores were again constructed for individuals in each camp in these domains. Although there were no restrictions against naming females as hunters or fishers, or males as tuber-gatherers, these were very rare, so all instances were removed prior to analysis and z-scores for these domains were only constructed for the relevant sex (hunting and fishing for males, tuber gathering for females). To allow all prestige measures across all individuals to be compared in the same model, all women were assigned a ‘0’ for hunting and fishing, while all men were given a ‘0’ for tuber gathering. Although including sex as a co-variate in analyses should control for these sex-specific foraging domains, to remove this potential confound we constructed an additional ‘overall foraging skill’ variable combining both male and female foraging activities (using average number of hunting and fishing nominations for male foraging skill, tuber-gathering nominations for female foraging skill, then merging the two). Using this new variable, we find no qualitative difference in our main findings regarding who individuals chose as camp-mates or as recipients of cooperation (Supplementary Table 12), with storytellers still selected more frequently than skilled foragers.\nAlthough there is some correlation between different reputational domains (Supplementary Table 13), these are generally weak (r < 0.3). Collinearity diagnostics cannot be conducted for GEE analyses, but a similar approach employing multiple regression using aggregate popularity for each individual (z-scores based on the number of nominations for each individual, calculating each camp separately) indicated that collinearity between these reputational domains is weak (all ‘variance inflation factors’ (VIFs) <1.5; a VIF greater than ‘3’ is indicative of severe collinearity), and is therefore unlikely to bias these results.\nAlthough it is difficult to validate all our reputational measures against actual behaviour, it was possible to assess a small sample of fishers from one particularly well-studied camp for which enough foraging trips were recorded to permit comparisons between individuals. In this camp, perceived skill in fishing was significantly correlated with both fishing returns per hour (r = 0.606, n = 16, p = 0.013) and total calories obtained from fishing (r = 0.802, n = 16, p < 0.001), indicating that these nominations likely reflect a combination of both effort and skill, and are therefore valid and can be used as a proxy for skill level. Further verifying this methodology, comparable protocols on Hadza hunting skill indicated a similar profile, with those perceived as possessing greater hunting skill having greater overall return rates and returns per hour60. Many of the Agta rated by others as skilled storytellers were also those who were the most engaging and knowledgeable during our fieldwork. These reputational measures therefore appear to reflect real-world dynamics among the Agta.\nResource allocation game\nA simple resource allocation game was played with 290 Agta (mean age = 37, range = 16–70, males = 140) across these 18 camps to assess levels of cooperation. Only camps with eight or more adult members present were included in the games for the statistical analysis to possess an adequate sample size. Due to the majority of Agta not knowing their exact ages, adults were defined as either married or divorced individuals, or those believed to be over the age of ~16. Approximately ten days were spent at each Agta camp. Games were only played on the last few days in order to maximise familiarity with the researchers and facilitate trust, but also to minimise the potential for collusion between camp-mates. We do not believe that this occurred, as there were no sudden shifts in game behaviour over time. Prior to playing the game in each camp, photographs of all players were taken and Polaroids printed.\nIn private, participants were shown their own picture, along with all other camp-mates (up to a maximum of 10). Thus, in camps with 12 or more members, 10 randomly selected camp-mates (in addition to ego) were chosen. The decision to randomly-select 10 individuals from larger camps, rather than include all individuals, was chosen for practical and comparative reasons. Firstly, including all camp-mates from larger camps would have been logistically unfeasible as the amount of rice needed would increase exponentially with camp size. Secondly, although it would have been possible to limit the amount of rice by including all individuals in a large camp and only using ten tokens, this would make comparisons between larger and smaller camps difficult as otherwise the ratio of equal tokens to potential recipients would be violated in larger camps.\nA number of tokens equal to the number of camp-mate pictures were then given to the participant, each of which represented one-eighth of a kilo of rice (125 g; approximately a meal for one individual). Participants were then asked, for each token, whether they would like to keep the rice for themselves, or give it to a camp-mate, and if so, to whom. After each iteration, tokens were placed on the respective individual. This was repeated until there were no tokens remaining. Only the participant, experimenter, and translator were aware of an individual’s decisions. Individuals were briefed on the games in their local language, and assured that all decisions would remain secret from other camp-mates. They were told that there were no correct answers, and that they, and whoever they gave rice to, would be given it before the researchers left camp. After finishing the game, participants were thanked and asked politely not to tell anyone else about how they played. In total, the procedure took about 10–15 min per participant. Prior to leaving camp, the amount of rice earned by each participant was given to them (the amount they received from others and the amount they kept for themselves), along with remuneration for their time and assistance in other aspects of the project conducted simultaneously.\nThis non-anonymous game structure was used in order for both levels of cooperative behaviour and patterns of cooperation (i.e. who individuals share with, such as kin, reciprocal partners or storytellers) to be ascertained. The game is similar to the ‘Gift Game’ conducted in several populations56, 61,62,63 where participants are given resources (e.g. sticks of honey) and have to decide who to give it to. Although the game used here is structurally alike, it possesses the added rule that participants could either keep a share for themselves if they wished, or give it to a camp-mate of their choosing. Although the Gift Game allows the choice of giving to multiple individuals, it does not measure levels of cooperation as there is no option for keeping gifts for one’s self, and is therefore not a social dilemma64 as there is no conflict between individual and group interests. On the other hand, although traditional economic games, such as the Ultimatum Game, Dictator Game, and Public Goods Game65, are social dilemmas, they include only anonymous partners, and therefore ignore the role that differences in relationship have on cooperation66 and cannot be used to explore who individuals preferentially share resources with.\nAfter preliminary trials with different resources, it was decided that rice would be used as the game resource as it is highly sought-after by the Agta and therefore carries enough value to cause a dilemma when deciding whether to share or not. Initial trials with other goods, such as honey sticks, were perceived to have little value (and were freely distributed to children). After discussing with the Agta which resources were most valued, rice was the unanimous choice. The Agta do not grow their own rice (although they may harvest it for neighbouring agricultural populations), and although it is a non-foraged commodity introduced by non-Agta agricultural populations it is one of the Agta’s primary sources of calories (when available) and is highly valued. The vast majority of meals are consumed with rice, and in some cases consist solely of rice.\nThe percentage of tokens kept for self was used as the dependent variable in this analysis, with a higher percentage meaning more rice kept for self and less given to others. This ranged from 0% to 100%, with a mean of 62.6%. Multi-level models were used to control for the non-independence of data points within camps67. The independent variable of interest was the average proportion of skilled storyteller nominations per individual for each camp, which ranged from 0.03 to 0.21, with a mean of 0.1. Proportion of nominations, rather than number of nominations, was used in this analysis to control for differences in camp size. For instance, in a camp of 10 individuals, if on average each camp-mate receives two nominations, the average proportion of nominations would be 0.2 per person. In contrast, for a camp of 20 individuals, an average of two nominations per individual only corresponds to an average proportion of nominations of 0.1 per person. Individuals from the first camp were therefore proportionally more likely to be nominated than individuals from the second group, suggesting that the first camp contains better storytellers. As group size68 and relatedness9 may influence cooperation, these were both included as fixed effects to control for these potential confounds. Municipality was also included as a dummy fixed effect to control for differences in cooperation between Palanan and Maconacon. An additional analysis was conducted with a sub-set of 11 camps from Palanan for which data on the frequency of repeated interactions were available to explore whether storytelling skill was confounded with camp-mate familiarity (Supplementary Table 4).\nCamp-mate and resource distribution network analyses\nTo assess social ties, 291 Agta (mean age = 37.3 range = 16–70, males = 138) were asked to name the five individuals they would most like to live with (similar to the ‘camp-mate network’ conducted with the Hadza61). This was conducted in a separate interview to the reputational questions in an attempt to forestall cross-over effects. Once nominations for non-Agta, non-camp-mates, and other camp-mates who did not take part in the camp-mate network were removed, a total of 857 nominations remained from a possible 6534 dyads. Logistic GEE regression methods were used to control for multiple nominations by the same individual69.\nFor the response variable, a matrix was constructed containing a ‘1’ if ego selected alter to live with or a ‘0’ if not. Between-camp dyads were coded as missing. The main independent variable of interest was storytelling reputation, as defined above, with skilled storytellers coded as ‘1’ and unskilled storytellers as ‘0’. Other predictor variables included: kinship, reciprocity (if alter chose to live with ego), distance, as well as age (of ego, alter, and age gap between ego and alter) and sex (of ego, alter, and whether ego and alter were of the same or different sex). Kin relationships were defined as: PK, with a relatedness coefficient of r = 0.5 to ego; distant kin (DK), with a relatedness coefficient between r = 0.25 to r = 0.03125 (second cousins) to ego; spouse; spouse’s primary kin/primary kin’s spouse (SPK/PKS); spouse’s distant kin/other affines (SDK/OA), which includes DK of spouse or other affinal relationships up to five steps away from ego (e.g. spouse’s brother’s wife’s mother (four steps away)); and non-relatives (NR), which includes everyone else without a kinship link to ego (for further details see ref. 53). As these are categorical variables, each of these kinship categories were compared against the probability of selecting to live with non-kin. The matrix for reciprocity was the transpose of the response variable (i.e. whether alter chose to live with ego). Distance was coded from one to four, reflecting increasing distance between ego and alter, with categories of; living in the same house as ego (1), living in the house next to ego (2), having a house between ego’s and alter’s (3) and living further away (4). The relationship between nominating an individual in the camp-mate network and other reputational domains (hunting, fishing, etc.) were also assessed. Camp size was included as a control in all models to control for larger camps possessing a greater number of potential recipients to nominate.\nThe resource allocation network employed an identical logistic GEE regression approach using the same methodology and variables as described above, but here using nominations of who individuals distributed resources to in the resource allocation game (n = 290, dyads = 1312). In this analysis the proportion of resources kept for self was used as a control variable to ensure that patterns of resource distributions were not confounded with overall levels of cooperation.\nReproductive success analysis\nNumber of living offspring was used as a proxy for reproductive success. This was ascertained by obtaining reproductive histories of all individuals during genealogical interviews. Both age and age-squared were included in the model to control for differences in age-specific fertility. As husbands are generally older than their wives among the Agta, this may result in lower estimates of age-specific reproductive success for men, so sex was also included as a control. Fertility, mortality and reproductive success among the Agta also vary depending on the camp70, so multi-level modelling was used to control for camp-level variation in reproductive success. When included, the interaction between storytelling skill and sex is non-significant (b = 0.61, CI: [−0.25; 1.47], n = 324, p = 0.17), suggesting that reproductive benefits of being a skilled storyteller may accrue to both sexes.\nRobustness checks\nIn this section we demonstrate that these results of storytellers possessing an increased number of camp-mate nominations as well as higher fitness are not a statistical artefact, as we replicate results now using storytelling as a continuous variable (rather than binary), and controlling for female-biased nominations of storytellers by quantifying storytelling skill separately for each sex (both as a binary and continuous variable; see ‘Assessing storytelling reputation’ section of Methods above). The results for fitness outcomes (Supplementary Table 6) and camp-mate nominations (Supplementary Tables 7–9) are qualitatively identical to those presented in the main text, with skilled storytellers both possessing greater reproductive success and more likely to be nominated in a camp-mate network. For camp-mate models using continuous, rather than binary, measures of reputations, z-scores for sex-specific domains (hunting, fishing and tuber gathering) were constructed using data from both sexes.\nStories from other hunter-gatherer societies\nWe conducted a literature search in order to compare the content of Agta stories against those from other Southeast Asian hunter-gatherer societies. This included other hunter-gatherer groups such as the Andamanese, the Batek (from peninsula Malaysia), the Maniq (from Thailand), and other populations from the Philippines (the Batak, Aeta and neighbouring Agta groups; Supplementary Table 1). It is difficult to obtain an unbiased sample of stories told by hunter-gatherers as different ethnographers tend to focus on different story contents (when investigated at all), but we specifically selected stories that concern norms of social behaviour, such as cooperation, relationships between the sexes and social hierarchies. Stories by the Ju/’hoansi from southern Africa25, 29 and Central African pygmies27 were also sought out and included in our content analysis (Supplementary Table 2), although they were not included in Supplementary Table 1. Among the Ju/’hoansi many stories concern marriage behaviour, in-law relationships, kinship networks and sharing norms25, as well as sex equality and the different (but complementary) roles of each sex29, 71. Similar trends are found among central African pygmy groups, such as the BaYaka27, who have legends and rituals which reinforce norms of sexual egalitarianism and social behaviour, as well as interactions with non-BaYaka.\nThese stories told by hunter-gatherers appear to differ dramatically from those of non-foraging populations. For instance, among the Bantu in southern Africa most stories concern maintaining the status quo to preserve the leader’s authority71, which is quite the opposite of hunter-gatherer stories which tend to extol the virtues of egalitarianism and equality. Further supporting these differences, in hunter-gatherers facing increased settlement and agriculture, rituals have shifted towards practices facilitating hierarchy and sexual inequality72.\nNot all stories obtained from these populations concerned social behaviour. Many stories not described here concern cosmological content, with seemingly little social relevance. Examples include Batek origins of the cosmos, Maniq origins of night and day (originating from a snake continuously eating and regurgitating its tail), and Andamanese origins of pigs (see references in Supplementary Table 1). Their existence does not diminish the importance of stories in facilitating cooperation, but merely highlights that stories can perform other functions, such as disseminating fitness-relevant information16, 26, 35 or just to hold the audience’s attention23. It is also possible that these stories, regardless of content, also play a functional role by acting as ‘ethnic markers’ which identify group membership, again coordinating behaviour and promoting cooperation73, 74, but this is a separate (and non-mutually exclusive) argument to that of the current paper.\nIn addition to the stories concerning social behaviour (Supplementary Table 1), we also performed a content analysis of all stories collected (n = 89) from these Southeast Asian hunter-gatherer populations in addition to two African forager groups (Ju/’hoansi and BaYaka; Supplementary Table 2). Each story was assessed for different types of content: social (content which prescribed and coordinated behaviour during interactions with others, such as cooperation, sex equality, norm-breaking, sex roles, punishment and interactions with out-groups); cosmological (content concerning the origins of the earth/universe); natural phenomena (content concerning navigation, animal origins/behaviour, fire and natural disasters/weather); and resource use (content about foraging and resource extraction). Each of these broad themes are common in forager folklore16, 25, 29, 35, 75. Many stories were classified along more than one criterion, such as many creation stories combining cosmological and social content (for instance, see Supplementary Table 1). Some sources presented several versions of the same basic story; to prevent unnecessary duplication, in these cases only the longest or most elaborate stories were used in this analysis. Any analysis of this kind will of course be subject to bias to some extent, such that others may categorise stories differently or their ‘emic’ interpretation in the specific society may be different. However, as social content was present in ~70% of stories, approximately double that of the second-highest content (natural phenomena; 39%), it is unlikely that any small changes in categorisation would greatly influence our conclusion that one of the functions of stories in hunter-gatherer societies may be to coordinate social behaviour.\nEthics\nEthical clearance was granted by the University College London Ethics Committee (UCL Ethics code 3086/003). Fieldwork permission was granted by local government units, including the Mayors of the Municipalities visited and from the Department of Environment and Natural Resources (DENR) as the research took place in a protected area. Each Agta community agreed to participate and informed consent was obtained from all individuals.\nData availability\nThe data that support the findings of this study are available from the authors upon reasonable request.\nReferences\nNowak, M. A. Five rules for the evolution of cooperation. Science 314, 1560–1563 (2006).\nWest, S. A., Griffin, A. S. & Gardner, A. Evolutionary explanations for cooperation. Curr. Biol. 17, 661–672 (2007).\nGurven, M. To give and to give not: the behavioral ecology of human food transfers. Behav. Brain Sci. 27, 543–583 (2004).\nDyble, M. et al. Networks of food sharing reveal the functional significance of multilevel sociality in two hunter-gatherer groups. Curr. Biol. 26, 2017–2021 (2016).\nHrdy, S. B. Mothers and Others: The Evolutionary Origins of Mutual Understanding (Harvard University Press, 2009).\nKramer, K. L. Cooperative breeding and its significance to the demographic success of humans. Annu. Rev. Anthropol. 39, 417–436 (2010).\nPatton, J. Q. Meat sharing for coalitional support. Evol. Hum. Behav. 26, 137–157 (2005).\nWest, S. A., Griffin, A. S. & Gardner, A. Social semantics: altruism, cooperation, mutualism, strong reciprocity and group selection. J. Evol. Biol. 20, 415–432 (2007).\nHamilton, W. D. The genetical evolution of social behavior. J. Theor. Biol. 7, 17–52 (1964).\nTrivers, R. L. The evolution of reciprocal altruism. Q. Rev. Biol. 46, 35–57 (1971).\nHawkes, K. & Bliege Bird, R. Showing off, handicap signaling, and the evolution of men’s work. Evol. Anthropol. 11, 58–67 (2002).\nNowak, M. A. & Sigmund, K. Evolution of indirect reciprocity by image scoring. Nature 393, 573–577 (1998).\nChwe, M. S. Y. Rational Ritual: Culture, Coordination, and Common Knowledge (Princeton University Press, Princeton, 2013).\nCronk, L. & Leech, B. L. Meeting at Grand Central: Understanding the Social and Evolutionary Roots of Cooperation (Princeton University Press, Princeton, 2013).\nSmith, E. A. Communication and collective action: language and the evolution of human cooperation. Evol. Hum. Behav. 31, 231–245 (2010).\nScalise Sugiyama, M. The forager oral tradition and the evolution of prolonged juvenility. Front. Psychol. 2, 133 (2011).\nCoe, K., Aiken, N. E. & Palmer, C. T. Once upon a time: ancestors and the evolutionary significance of stories. Anthropol. Forum 16, 21–40 (2006).\nBrown, D. E. Human Universals (McGraw-Hill, New York, 1991).\nScalise Sugiyama, M. The plot thickens: what children’s stories tell us about mindreading. J. Conscious. Stud. 16, 94–117 (2009).\nGraça da Silva, S. & Tehrani, J. J. Comparative phylogenetic analyses uncover the ancient roots of Indo-European folktales. R. Soc. Open Sci. 3, 150645 (2016).\nHarari, Y. N. Sapiens: A Brief History of Humankind (Penguin, London, 2011).\nDunbar, R. I. M. How conversations around campfires came to be. Proc. Natl Acad. Sci. USA 111, 14013–14014 (2014).\nBoyd, B. On the Origin of Stories: Evolution, Cognition, and Fiction (Harvard University Press, Cambridge, MA, 2009).\nScalise Sugiyama, M. in The Literary Animal: Evolution and the Nature of Narrative (eds Gottschall, J. & Wilson, D. S.) 177–196 (Northwestern University Press, Evanston, IL, 2005).\nWiessner, P. Embers of society: firelight talk among the Ju/’hoansi Bushmen. Proc. Natl Acad. Sci. USA 111, 14027–14035 (2014).\nBiesele, M. How hunter-gatherers’ stories ‘make sense’: semantics and adaptation. Cult. Anthropol. 1, 157–170 (1986).\nLewis, J. Forest hunter-gatherers and their world: a study of the Mbendjele Yaka pygmies of Congo-Brazzaville and their secular and religious activities and representations. Doctoral thesis, London School of Economics and Political Science (2002).\nConradt, L. & Roper, T. J. Consensus decision making in animals. Trends Ecol. Evol. 20, 449–456 (2005).\nBiesele, M. Women Like Meat: The Folklore and Foraging Ideology of the Kalahari Ju/’hoan (Indiana University Press, Bloomington, IN, 1993).\nPurzycki, B. G. et al. Moralistic gods, supernatural punishment and the expansion of human sociality. Nature 530, 327–330 (2016).\nWatts, J. et al. Broad supernatural punishment but not moralizing high gods precede the evolution of political complexity in Austronesia. Proc. R. Soc. B 282, 20142556 (2015).\nPeoples, H. C., Duda, P. & Marlowe, F. W. Hunter-gatherers and the origins of religion. Hum. Nat. 27, 261–282 (2016).\nBoehm, C. Hierarchy in the Forest: The Evolution of Egalitarian Behavior (Harvard University Press, Cambridge, MA, 1999).\nSmith, D. et al. Camp stability predicts patterns of hunter-gatherer cooperation. R. Soc. Open Sci. 3, 160131 (2016).\nScalise Sugiyama, M. Food, foragers, and folklore: the role of narrative in human subsistence. Evol. Hum. Behav. 22, 221–240 (2001).\nScalise Sugiyama, M. & Sugiyama, L. S. in Creating Consilience: Integrating the Sciences and the Humanities (eds Slingerland, E. & Collard, M.) 351–371 (Oxford University Press, New York, 2011).\nGailliot, M. T. et al. Self-control relies on glucose as a limited energy source: Willpower is more than a metaphor. J. Pers. Soc. Psychol. 92, 325–36 (2007).\nLaughlin, S. B., Steveninck, R. R. & Anderson, J. C. The metabolic cost of neural information. Nat. Neurosci. 1, 36–41 (1998).\nSugiyama, L. S. & Scalise Sugyiama, M. Social roles, prestige, and health risk: social niche specialization as a risk-buffering strategy. Hum. Nat. 14, 165–190 (2003).\nSilk, J. B. Social components of fitness in primate groups. Science 317, 1347–1351 (2007).\nPinker, S. How the Mind Works (Norton, New York, 1997).\nScalise Sugyiama, M. On the origins of narrative: Storyteller bias as a fitness-enhancing strategy. Hum. Nat. 7, 403–425 (1996).\nTooby, J. & Cosmides, L. Does beauty build adapted minds? Toward an evolutionary theory of aesthetics, fiction, and the arts. SubStance 30, 6–27 (2001).\nBoyd, B. The evolution of stories: from mimesis to language, from fact to fiction. Wiley Interdiscip. Rev. Cogn. Sci. e14444 (2017).\nMar, R. A. & Oatley, K. The function of fiction is the abstraction and simulation of social experience. Perspect. Psychol. Sci. 3, 173–192 (2008).\nScalise Sugyiama, M. in Encyclopedia of Evolutionary Psychological Science (eds Shackelford, T. K. & Weekes-Shackelford, V. A.) 1–6 (Springer, Cham, 2017).\nZunshine, L. Why we Read Fiction: Theory of Mind and the Novel (Ohio State University Press, Columbus, OH, 2006).\nDjikic, M., Oatley, K., Zoeterman, S. & Peterson, J. B. On being moved by art: how reading fiction transforms the self. Creat. Res. J. 21, 24–29 (2009).\nMar, R. A., Oatley, K., Hirsh, J., dela Paz, J. & Peterson, J. B. Bookworms versus nerds: exposure to fiction versus non-fiction, divergent associations with social ability, and the simulation of fictional social worlds. J. Res. Pers. 40, 694–712 (2006).\nKidd, D. C. & Castano, E. Reading literary fiction improves theory of mind. Science 342, 377–380 (2013).\nPanero, M. E. et al. Does reading a single passage of literary fiction really improve theory of mind? An attempt at replication. J. Pers. Soc. Psychol. 111, e46–e54 (2016).\nBochet, O., Page, T. & Putterman, L. Communication and punishment in voluntary contribution experiments. J. Econ. Behav. Organ. 60, 11–26 (2006).\nDyble, M. et al. Sex equality can explain the unique social structure of hunter-gatherer bands. Science 348, 796–798 (2015).\nVinicius, L., Mace, R. & Migliano, A. Variation in male reproductive longevity across traditional societies. PLoS ONE 9, e112236 (2014).\nLewis, H. M., Vinicius, L., Strods, J., Mace, R. & Migliano, A. B. High mobility explains demand sharing and enforced cooperation in egalitarian hunter-gatherers. Nat. Commun. 5, 5789 (2014).\nChaudhary, N. et al. Polygyny without wealth: popularity in gift games predicts polygyny in BaYaka Pygmies. R. Soc. Open Sci. 2, 150054 (2015).\nWiessner, P. Norm enforcement among the Ju/’hoansi Bushmen. Hum. Nat. 16, 115–145 (2005).\nBellwood, P. in The Cambridge Encyclopedia of Hunters and Gatherers (eds Lee, R. B. & Daly, R.) 284–288 (Cambridge University Press, Cambridge, MA, 1999).\nPolletta, F., Chen, P. C. B., Gardner, B. G. & Motes, A. The sociology of storytelling. Annu. Rev. Sociol. 37, 109–130 (2011).\nMarlowe, F. Showoffs or providers? The parenting effort of Hadza men. Evol. Hum. Behav. 20, 391–404 (1999).\nApicella, C. L., Marlowe, F. W., Fowler, J. H. & Christakis, N. A. Social networks and cooperation in hunter-gatherers. Nature 481, 497–501 (2012).\nThomas, M. G., Næss, M. W., Bårdsen, B.-J. & Mace, R. Saami reindeer herders cooperate with social group members and genetic kin. Behav. Ecol. 26, 1495–1501 (2015).\nHe, Q.-Q., Wu, J.-J., Ji, T., Tao, Y. & Mace, R. Not leaving home: grandmother and Mosuo male dispersal. Behav. Ecol. 27, 1343–1352 (2016).\nKollock, P. Social dilemmas: the anatomy of cooperation. Annu. Rev. Sociol. 24, 183–214 (1998).\nCamerer, C. F. Behavioral Game Theory: Experiments in Strategic Interaction (Princeton University Press, Princeton, 2003).\nRucas, S. L., Gurven, M., Kaplan, H. & Winking, J. The social strategy game: Resource competition within female social networks among small-scale forager-horticulturalists. Hum. Nat. 21, 1–18 (2010).\nKreft, I. & de Leeuw, J. Introducing Multilevel Modelling (Sage, Thousand Oaks, CA, 1998).\nBoyd, R. & Richerson, P. J. The evolution of reciprocity in sizable groups. J. Theor. Biol. 132, 337–356 (1988).\nZeger, S. L. & Liang, K. Y. Longitudinal data analysis for discrete and continuous outcomes. Biometrics 42, 121–130 (1986).\nPage, A. E. et al. Reproductive trade-offs in extant hunter-gatherers suggest adaptive mechanism for the Neolithic expansion. Proc. Natl Acad. Sci. USA 113, 4694–4699 (2016).\nBiesele, M. Sapience and scarce resources: communication systems of the!Kung and other foragers. Soc. Sci. Inf. 17, 921–947 (1978).\nTownsend, C. Baka ritual flow diverted. Hunt. Gather-. Res. 1, 197–224 (2015).\nEfferson, C., Lalive, R. & Fehr, E. The coevolution of cultural groups and ingroup favoritism. Science 321, 1844–1849 (2008).\nMcElreath, R., Boyd, R. & Richerson, P. J. Shared norms and the evolution of ethnic markers. Curr. Anthropol. 44, 122–130 (2003).\nEndicott, K. Batek Negrito Religion: The World-View and Rituals of a Hunting and Gathering People of Peninsular Malaysia (Claredon Press, Oxford, 1979).\nAcknowledgements\nThis project was funded by the Leverhulme Trust grant RP2011-R-045 to A.B.M. and R.M. R.M. also received funding from European Research Council Advanced Grant AdG 249347. We thank R. Schlaepfer for fieldwork support. We also thank our assistants in the Philippines, as well as the Agta communities.\nAuthor information\nAuthors and Affiliations\nContributions\nA.B.M. conceived the project. D.S., A.B.M., R.M. and L.V. designed the experiments. D.S. performed the experiments. D.S. and K.M. collected reputational data. P.S. and A.B.M. collected the data on Agta stories. M.N. and L.A. translated the Agta stories. D.S. collected data on stories from other hunter-gatherer societies. D.S., A.B.M., M.D., K.M. and A.E.P. collected the demographic data. D.S., L.V. and A.B.M. analysed the data. D.S., A.B.M. and L.V. wrote the manuscript. All authors contributed substantially to revisions, analyses and gave final approval for publication.\nCorresponding authors\nEthics declarations\nCompeting interests\nThe authors declare no competing financial interests.\nAdditional information\nPublisher's note: Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\nElectronic supplementary material\nRights and permissions\nOpen Access This article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons license, and indicate if changes were made. The images or other third party material in this article are included in the article’s Creative Commonslicense, unless indicated otherwise in a credit line to the material. If material is not included in the article’sCreative Commons license and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/.\nAbout this article\nCite this article\nSmith, D., Schlaepfer, P., Major, K. et al. Cooperation and the evolution of hunter-gatherer storytelling. Nat Commun 8, 1853 (2017). https://doi.org/10.1038/s41467-017-02036-8\nReceived:\nAccepted:\nPublished:\nDOI: https://doi.org/10.1038/s41467-017-02036-8\nThis article is cited by\n-\nNeural dynamics of semantic control underlying generative storytelling\nCommunications Biology (2025)\n-\nKing Lear in the upper palaeolithic: searching for ethical principles in prehistory\nMonash Bioethics Review (2025)\n-\nStability and malleability of emotional autobiographical memories\nNature Reviews Psychology (2024)\n-\nRevisiting the Heider and Simmel experiment for social meaning attribution in virtual reality\nScientific Reports (2024)\n-\nCatalysing cooperation: the power of collective beliefs in structured populations\nnpj Complexity (2024)"
    },
    {
      "url": "https://globescan.com/2024/01/25/insight-of-the-week-people-feel-overwhelmed-by-pace-of-change-in-the-world/",
      "text": "The year 2024 is set to be one of significant volatility and uncertainty, where many feel worried about a range of radical transformations and simultaneous challenges whether political, social, technological, economic, or environmental.\nGlobeScan’s global public opinion research shows that the public across all regions and demographics largely feel that they cannot keep up with a fast-changing world: nearly eight in ten people worldwide (78%) believe that “the world is changing too quickly for me,” indicating an overall sense of anxiety in this current state of polycrisis.\nWith people feeling overwhelmed with the pace and intensity of change, it will become increasingly difficult to build confidence in the emerging agendas of government as well as business, highlighting the need for a just transition where people feel that they are included in the potential benefits of a rapidly changing future, or at least understand what it will bring and how they will be supported. Failing that, a growing proportion of the global public might reject ambitious policy or business agendas, or become dismissive and retrench in the status quo – with severe implications for the sustainability agenda from climate to DE&I.\nFind out more about future dynamics and the implications for companies, governments, and NGOs during this time of great uncertainty by listening to our latest webinar 2024: Preparing for a Pivotal Year.\nSurvey Question: For each of the following statements, please indicate if you strongly agree, somewhat agree, somewhat disagree, or strongly disagree. – The world is changing too quickly for me.\nSource: GlobeScan Radar Trends Report (survey of 29,565 people in the general public across 31 countries and territories in July ‒ August 2023)"
    }
  ],
  "argos_summary": "Storytelling is shown to reduce stress, strengthen relationships, and give meaning to life by encouraging sharing, reflection, and empathy, which can help people cope with the fast‑changing world highlighted by GlobeScan’s 2023 survey. Gallup polls reveal that nearly half of Americans report frequent stress, and a growing majority feel they need more sleep, with younger women experiencing the sharpest decline in sleep and the highest stress levels. A 2017 study of the Agta hunter‑gatherers found that skilled storytellers are preferred partners, foster higher cooperation, and enjoy greater reproductive success, suggesting storytelling may have evolved as a mechanism for coordinating group behavior. Across multiple hunter‑gatherer societies, stories consistently convey norms of cooperation, equality, and social cohesion, underscoring storytelling’s potential as a universal tool for managing modern stress and uncertainty.",
  "argos_id": "LT83HU8K1"
}