{
  "url": "https://www.nasdaq.com/articles/argenxs-vyvgart-achieves-primary-endpoint-pivotal-study-achr-ab-seronegative-gmg",
  "authorsByline": "RTTNews",
  "articleId": "5c4274ad9da14551bdce28183270fdd8",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T05:25:55+00:00",
  "addDate": "2025-08-25T06:24:46.048113+00:00",
  "refreshDate": "2025-08-25T06:24:46.048115+00:00",
  "score": 1.0,
  "title": "Argenx's VYVGART Achieves Primary Endpoint In Pivotal Study For AChR-Ab Seronegative GMG",
  "description": "(RTTNews) - argenx SE (ARGX) reported that the pivotal ADAPT SERON study of VYVGART (IV: efgartigimod alfa-fcab) successfully met its primary endpoint. The study demonstrated a statistically significant and clinically meaningful improvement in MG-ADL (Myasthenia Gravis Activities",
  "content": "(RTTNews) - argenx SE (ARGX) reported that the pivotal ADAPT SERON study of VYVGART (IV: efgartigimod alfa-fcab) successfully met its primary endpoint. The study demonstrated a statistically significant and clinically meaningful improvement in MG-ADL (Myasthenia Gravis Activities of Daily Living) total score among AChR-Ab seronegative gMG patients treated with VYVGART compared to placebo.\n\nThe company said it plans to submit an sBLA to the U.S. FDA seeking expansion of the VYVGART label to include adult AChR-Ab seronegative gMG patients across all three subtypes - MuSK+, LRP4+, triple seronegative.\n\nAccording to the company, VYVGART was well tolerated and safe across AChR-Ab seronegative subtypes and consistent with the established safety profile in patients with AChR-Ab seropositive gMG and other indications. No new safety concerns were identified.\n\nThe Phase 3 ADAPT SERON study was a randomized, double-blind, placebo-controlled, multi-center study evaluating the safety and efficacy of efgartigimod in adults with AChR-Ab seronegative gMG (n=119) across North America, Europe, China, and the Middle East.\n\nFor More Such Health News, visit rttnews.com.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Pivotal Study",
      "weight": 0.10479049
    },
    {
      "name": "adult AChR-Ab seronegative gMG patients",
      "weight": 0.09837829
    },
    {
      "name": "AChR-Ab seronegative gMG patients",
      "weight": 0.09125647
    },
    {
      "name": "AChR-Ab seronegative gMG",
      "weight": 0.090101056
    },
    {
      "name": "VYVGART",
      "weight": 0.089998946
    },
    {
      "name": "AChR-Ab seronegative subtypes",
      "weight": 0.08806869
    },
    {
      "name": "More Such Health News",
      "weight": 0.08397074
    },
    {
      "name": "AChR-Ab seropositive gMG",
      "weight": 0.08314441
    },
    {
      "name": "AChR-Ab Seronegative GMG",
      "weight": 0.07568172
    },
    {
      "name": "Primary Endpoint",
      "weight": 0.074783504
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.92578125
    },
    {
      "name": "/News/Health News",
      "score": 0.86328125
    },
    {
      "name": "/Health/Pharmacy/Drugs & Medications",
      "score": 0.8017578125
    },
    {
      "name": "/Health/Health Foundations & Medical Research",
      "score": 0.76318359375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.75634765625
    },
    {
      "name": "/Health/Medical Literature & Resources/Other",
      "score": 0.53076171875
    },
    {
      "name": "/Health/Health Conditions/Cancer",
      "score": 0.31103515625
    }
  ],
  "sentiment": {
    "positive": 0.8849549,
    "negative": 0.01519678,
    "neutral": 0.09984829
  },
  "summary": "Argenx SE (Argenia), has reported that the ADAPT SERON study of VYVGART successfully met its primary endpoint, demonstrating a significant improvement in the MG-ADL (Myasthenia Gravis Activities of Daily Living) score among AChR-Ab seronegative gMG patients. The company plans to submit an sBLA to the U.S. for an extension of the VYVAL label to include adult AChr.",
  "shortSummary": "Argenx's VYVGART successfully met its primary goal in the pivotal ADAPT SERN study, and plans to expand the label.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "32ba1e4e8f084bf890a9ab9a18e371b7",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "argenx reported that its ADAPT SERON study of VYVGART met its primary endpoint, showing a statistically significant improvement in MG‑ADL scores for AChR‑Ab seronegative generalized myasthenia gravis patients compared with placebo. The company plans to submit an sBLA to the U.S. FDA to expand VYVGART’s label to include all seronegative subtypes—MuSK+, LRP4+, and triple seronegative. VYVGART was well tolerated with no new safety concerns identified, consistent with its established safety profile. The Phase 3 trial was a randomized, double‑blind, placebo‑controlled study involving 119 adults across North America, Europe, China, and the Middle East. This data supports the drug’s efficacy and safety in this patient population.",
  "argos_id": "LYK15EI6P"
}