{
  "url": "https://nypost.com/2025/08/25/us-news/comedian-reggie-carroll-dead-at-52-in-miss-shooting-suspect-in-custody/",
  "authorsByline": "Zoe Hussain",
  "articleId": "ca74168b83654f57a618a5201265ff18",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/comedian-reggie-carroll-dies-52-110052036.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T05:17:21+00:00",
  "addDate": "2025-08-25T05:20:02.440733+00:00",
  "refreshDate": "2025-08-25T05:20:02.440734+00:00",
  "score": 1.0,
  "title": "Comedian Reggie Carroll shot dead at 52 in Mississippi, suspect in custody",
  "description": "Carroll, often dubbed “The Knockout King of Comedy” for the stand-up special he hosted and produced under the name, built a loyal base through his comedy performances.",
  "content": "Comedian Reggie Carroll — A Baltimore native known for touring his stand-up routines across the country — was shot and killed in Mississippi last week, according to authorities.\n\nCarroll, 52, was gunned down in Southhaven on Wednesday, the Southhaven Police Department said in an update Saturday.\n\nOfficers responded to Burton Lane after reports of an isolated shooting and located “one male victim suffering from gunshot wounds,” cops said.\n\nDespite providing “life-saving” measures, the victim, later identified as Carroll, died from his injuries, authorities confirmed.\n\n“One male is in custody and has been charged with the murder of Reginald Carroll. Our thoughts are with the family of Mr. Carroll. Thank you to the community for their patience and understanding,” police added in a statement.\n\nThe investigation into the shooting remains ongoing, and the identity of the suspected shooter has not yet been released.\n\nCarroll, often dubbed “The Knockout King of Comedy” for the stand-up special he hosted and produced under the name, built a loyal base through his comedy performances.\n\nHe also made several television appearances, including on the variety series Showtime at the Apollo and The Parkers, according to his IMDb.\n\nFellow comedian and Oscar winner Mo’Nique, 57, paid tribute to Carroll, calling him her “brother in comedy,” in an Instagram story post, Deadline reported.\n\n“This is why I say treat people the best you can because you never know if you’ll get a chance to see them again, and the last time me and my brother Reggie, girl, was together,” she wrote.\n\n“That’s what it was, an amazing time, being on tour together, being on that road together, what a time, so I have no sad tears because all of our time together was amazing.”\n\nJonathan Carroll, the comedian’s brother, also thanked loved ones as he announced the tragic loss.\n\n“To all who have expressed condolences on the passing of Reggie Carroll, your love has been well received-thank you!!!” he wrote in a Facebook post, signing off as the “Carroll brothers,”",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/24/us-news/my-small-town-beer-buddy-vented-about-his-creepy-teaching-assistant-all-semester-it-turned-out-to-be-killer-bryan-kohberger/",
    "https://www.imdb.com/name/nm2648490/",
    "https://deadline.com/2025/08/comedian-reginald-carroll-killed-shooting-1236496443/",
    "https://www.facebook.com/SPD1980/posts/pfbid02ktsQ5CQwNqBcvzEk4KCuT1E9gYK2Fcr3RkZDUjrBHCWDQ1JEKbRTW8JSdkoJrd8Kl",
    "https://nypost.com/2025/08/24/us-news/cracker-barrel-board-member-under-fire-for-dei-background-after-restaurant-ditches-traditional-logo/",
    "https://nypost.com/2025/08/24/us-news/san-diego-ice-arrest-photo-goes-mega-viral-for-surprising-reason/",
    "https://www.facebook.com/jonathan.carroll.338206/posts/pfbid02ZwNmXscPCHXA5rhAe1UDZvzEmNK2pe2S2qN4vEtNjB8kbRJ5zJx26W25iM22LErzl?rdid=7s5OHnfhjI45F5Zp#"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Comedian Reggie Carroll",
      "weight": 0.11935179
    },
    {
      "name": "Reggie Carroll",
      "weight": 0.11852693
    },
    {
      "name": "Carroll",
      "weight": 0.106664516
    },
    {
      "name": "Reginald Carroll",
      "weight": 0.10593757
    },
    {
      "name": "Mr. Carroll",
      "weight": 0.10529864
    },
    {
      "name": "Jonathan Carroll",
      "weight": 0.10438968
    },
    {
      "name": "Reggie",
      "weight": 0.06653866
    },
    {
      "name": "several television appearances",
      "weight": 0.062738664
    },
    {
      "name": "last week",
      "weight": 0.06257045
    },
    {
      "name": "Burton Lane",
      "weight": 0.05802514
    }
  ],
  "topics": [
    {
      "name": "Crime"
    },
    {
      "name": "In Memoriam"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.97802734375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.96435546875
    },
    {
      "name": "/News/Local News",
      "score": 0.9326171875
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.7080078125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.54638671875
    }
  ],
  "sentiment": {
    "positive": 0.30505705,
    "negative": 0.40452984,
    "neutral": 0.29041314
  },
  "summary": "Comedian Reggie Carroll, a Baltimore native known for his stand-up routines, was shot and killed in Southhaven, Mississippi last week. Despite attempts to save him, Carroll died from his injuries. One male suspect is currently in custody and has been charged with Carroll's murder. The investigation into the shooting is ongoing. Fellow comedian and Oscar-winning actress Mo'Nique paid tribute to Carroll in an Instagram post.",
  "shortSummary": "Comedian Reggie Carroll, known for his stand-up routines, was shot dead at 52 in Southhaven, Mississippi, and a suspect is in custody, prompting tributes from celebrities like Mo'Nique.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "c362341fba7f4feb94b4f0770ea66993",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://deadline.com/2025/08/comedian-reginald-carroll-killed-shooting-1236496443/",
      "text": "Baltimore-based comic Reginald “Reggie” Carroll died after a fatal shooting in Mississippi, according to Southaven Police, CBS reported. He was 52.\nPer law enforcement, officers responded to the Burton Lane area regarding a shooting, where they found a victim with gunshot wounds. Despite life-saving efforts conducted at Memphis hospital Regional One Health, Carroll died from his injuries.\nThe Southaven Police Department said one man is in custody and has been charged with Carroll’s murder.\nWatch on Deadline\nEarly reports of the shooting, which took place Wednesday, indicated it was an isolated incident, though there is ongoing investigation.\nClub Mobtown Comedy paid tribute to the Maryland resident after his death, posting on social media: “🕊️Rest in power @comedianreggiecarroll, thank you for being one of the OGs who supported us early on. The Mobtown family and the Baltimore comedy community are very saddened by this loss of one of our city’s great talents. Sending our prayers to Reggie’s family 🙏🏽🙏🏽”\nCarroll toured his standup at comedy clubs across the country, with the likes of Mo’Nique, who called him her “brother in comedy.”\n“This is why I say treat people the best you can because you never know if you’ll get a chance to see them again, and the last time me and my brother Reggie, girl, was together,” the Oscar-winning actress said on her Instagram Story, chuckling, “that’s what it was, an amazing time, being on tour together, being on that road together, what a time, so I have no sad tears because all of our times together was amazing.\nPer his IMDb page, Carroll appeared in a 2000 episode of famed live variety series Showtime at the Apollo, filmed at Harlem’s Apollo Theater. He also appeared in an episode of Moesha spinoff The Parkers on UPN, opposite Mo’Nique and Countess Vaughn. Carroll produced and appeared in 2023 standup special Knockout Kings of Comedy and starred in the 2022 TV movie Rent & Go."
    },
    {
      "url": "https://nypost.com/2025/08/24/us-news/cracker-barrel-board-member-under-fire-for-dei-background-after-restaurant-ditches-traditional-logo/",
      "text": "Cracker Barrel board member under fire for DEI background after restaurant ditches traditional logo: ‘What qualified him?’\nOne member of Cracker Barrel’s board of directors is catching heat over his DEI-heavy background following negative reaction to the company’s new logo and redesigned interior and revelations about its embrace of far-Left values.\nGilbert Davila, 61, joined the restaurant chain’s board in July 2020 and is also among its top individual shareholders. Conservative activist Robby Starbuck called out Davila in a video criticizing the company’s leadership, calling the recent changes the culmination of a years-long campaign to cater to the far Left and abandon the values of its middle-America customer base.\n“What qualified him for this board seat?” Starbuck asks in the video. “Well, you see, he’s owned a DEI consulting and strategy firm for 15 years that focuses on pushing DEI and DEI advertising.”\nStarbuck was referring to DMI Consulting, a firm where Davila has served as president and CEO since 2010. Davila’s biography page on Cracker Barrel’s website describes the firm as “a leading multicultural marketing, diversity & inclusion and strategy firm in the United States.”\nFOX Business reached out to Cracker Barrel and Davila’s company for comment but did not hear back at the time of publication.\nConsumers have criticized Cracker Barrel after it unveiled a new logo that replaced the image of a man leaning on a barrel with just the restaurant’s name in black text over a yellow barrel-shaped backdrop. The chain also redesigned the interior of its restaurants, ditching the kitschy American aesthetic and replacing it with a slick modernist motif.\nBut Starbuck said those cosmetic changes are just part of a lurch away from American values. In his 15-minute video, he notes the company has been active in LGBTQ pride events, and aggressively employed diversity, equity and inclusion policies in hiring.\nDavila’s LinkedIn page states that he “is widely recognized… for his multicultural market knowledge and his proven track record on how to best embed a multicultural perspective into a corporation’s entire operation.”\n“People like him are behind the woke advertising push that we’ve seen in recent years,” Starbuck said of Davila in the video. “And he was also one of the people responsible for DEI at Disney.”\nPrior to his work at DMI, Davila worked at The Walt Disney Company, where he served as the vice president of global diversity and multicultural market development from 2003 to 2010.\nDavila earlier held the role of vice president of multicultural management for Sears & Roebuck Company and was a marketing director for Coca-Cola USA.\nDavila’s biography page also notes that he is a member of the Association of National Advertisers, co-founding and serving as a director of the group’s Alliance for Inclusive and Multicultural Marketing.\nStarbuck said he believes the controversy around Cracker Barrel’s logo change is about more than the removal of a man in his chair leaning on a barrel.\n“The American people are sick of having our culture and heritage stripped from us,” Starbuck told Fox News Digital last week."
    },
    {
      "url": "https://nypost.com/2025/08/24/us-news/san-diego-ice-arrest-photo-goes-mega-viral-for-surprising-reason/",
      "text": "Cheeky ICE arrest photo goes mega-viral — and not for the reason you think\nA cheeky ICE arrest photo showing the capture of an illegal Mexican migrant has gone mega-viral for an unexpected reason after being shared online — and many are accusing authorities of deliberately staging the photo for clicks.\nThe picture of Diego Hernandez, 42, posed next to a female ICE agent — who has her back to the camera and her hair flicked over her shoulder, while dressed in tight black pants — has almost 25 million views since being posted on X by the San Diego, California branch of ICE on Saturday.\nICE arrest photos are commonly staged so the arresting agent’s face is hidden to protect their identity, but this particular photo, of a sullen Hernandez wearing shorts and a South Park T-shirt, next to a curvy agent, took off on social media.\n“Am I f–king crazy, or is this them trying to humiliate a random immigrant and using an ICE agent’s fat delicious a– just to make sure it gains traction,” one X user asked, sharing the picture.\n“The Cartman shirt, the ICE agent facing the wall for no reason other than to show her a–, this is art. The parallels one could draw from this are endless. Satire is dead,” a second user wrote.\n“Anyone have the federal agents @,” a third asked.\n“If I renounce my citizenship, does that mean they will send her… to my house? asking for a friend,” another joked.\nHernandez, who has multiple drunk driving convictions, was arrested in San Diego after local law enforcement notified ICE, according to officials.\nHe is expected to be deported to Mexico.\n“ICE San Diego arrested Diego Hernandez, 42, an illegal alien from Mexico with multiple convictions for DUI and repeated illegal re-entry into the U.S.,” ICE San Diego said in a statement regarding the arrest.\n“He chose to break our laws again and again. He will remain in ICE custody pending removal- because public safety comes first.”"
    },
    {
      "url": "https://www.imdb.com/name/nm2648490/",
      "text": "Menu\nAll\nAll\nWatchlist\nSign in\nEN\nFully supported\nEnglish (United States)\nPartially supported\nFrançais (Canada)\nFrançais (France)\nDeutsch (Deutschland)\nहिंदी (भारत)\nItaliano (Italia)\nPortuguês (Brasil)\nEspañol (España)\nEspañol (México)\nUse app\nBiography\nIMDbPro\nAll topics\nReginald Carroll\nActor\nProducer\nIMDbPro\nStarmeter\nSee rank\nReginald Carroll is known for\nKnockout Kings of Comedy (2023)\n,\nThe Parkers (1999)\nand\nRent & Go (2022)\n.\nMore at IMDbPro\nContact info\nAgent info\nIMDbPro\nStarmeter\nSee rank\nAdd photos, demo reels\nAdd to list\nView contact info at IMDbPro\nMore at IMDbPro\nContact info\nAgent info\nKnown for\nKnockout Kings of Comedy\n9.0\nComedian\n2023\nThe Parkers\n6.9\nTV Series\nWillie\n2000 • 1 ep\nRent & Go\nTV Movie\nBig Mike\n2022\nIt's Showtime at the Apollo\n6.5\nTV Series\nSelf\n(as Reggie Carroll)\n2000 • 1 ep\nCredits\nEdit\nActor\n3\nProducer\n1\nSelf\n1\nIMDbPro\nCollapse below\nAll credits\nActor\nPrevious\n3\nKnockout Kings of Comedy\n9.0\nComedian\n2023\nRent & Go\nTV Movie\nBig Mike\n2022\nThe Parkers\n6.9\nTV Series\nWillie\n2000\n1 episode\nProducer\nPrevious\n1\nKnockout Kings of Comedy\n9.0\nproducer\n2023\nPersonal details\nEdit\nAlternative name\nReggie Carroll\nContribute to this page\nSuggest an edit or add missing content\nLearn more about contributing\nEdit page\nMore to explore\nRecently viewed\nYou have no recently viewed pages\nBack to top"
    },
    {
      "url": "https://nypost.com/2025/08/24/us-news/my-small-town-beer-buddy-vented-about-his-creepy-teaching-assistant-all-semester-it-turned-out-to-be-killer-bryan-kohberger/",
      "text": "My small-town beer buddy vented about his creepy teaching assistant all semester — it turned out to be Bryan Kohberger\nJohn Snyder is a kindly older man who lives in my small town. He’s what you’d consider a normal person — a married homeowner who teaches at the local university.\nHe’d been a public defender for almost 30 years when he took the opportunity to teach students about the legal system instead of defend them in it, feeling he was nearing burnout in a demanding profession.\nI’ve come to know John pretty well over the years, not just because we live in the same town — my wife, Alexis, is his favorite bartender, and he likes going out for dinner with his wife or having a beer after work as much as the next guy.\nBut there was a marked theme to John’s happy-hour conversation in fall 2022: His teaching assistant in Washington State University’s Criminal Justice and Criminology Department was “an a–hole” who was driving him crazy.\nNormal after-work grumbling, one might think, even if in a high quantity. Then bucolic life in our peaceful region was interrupted in November 2022 when four University of Idaho students were brutally murdered just 20 minutes away.\nAfter the new year, John came into the bar carrying a newspaper and looking bad enough that my wife said, “What’s wrong? You look like shit.”\nJohn held up the paper and confirmed what we suspected after the arrest: His teaching assistant was Bryan Kohberger.\nJohn Snyder has avoided the media since Kohberger’s arrest, but due to our friendship he agreed to meet me at the Palouse Caboose Bar & Grill, where my wife is a bartender, for some pitchers of beer and his first, and probably only, in-depth interview about supervising Bryan Kohberger.\nJohn graduated from the University of Idaho Law School in 1988 and began working as a public defender, his specialization throughout his legal career, saying, “Criminals are more honest and easier to work with than people going through a divorce.”\nHe was also attracted to the field by his sense of justice and desire to see people who may have disadvantages within society treated fairly by the legal system.\nAnd something of a troublemaker himself — his skill at pool paid his bar tabs all through law school — he could imagine being caught making some of the same mistakes as his clients.\nHe occasionally dealt with homicides or other serious crimes, but in a college town it’s mostly young people screwing up.\nJohn doesn’t feel this career has given him any greater ability to sense evil than the average person.\nAs a professor, John had a high volume of students and couldn’t get to know many of them well. Teaching assistants are different, and in normal circumstances one works with them extensively.\nIt used to be that professors chose preferred potential TAs from a list, but for reasons he never discovered, the school abandoned this system and randomized the process, which is how he was assigned Kohberger.\nWhen the graduate student came to introduce himself early in summer 2022, John didn’t think much of him: “He was a little odd, but a lot of people in academia are odd.”\nDespite the TA-assignment system being designed to prevent this exact problem, Kohberger had a scheduling conflict and thus limited attendance in class, though he also often didn’t show up when available.\nThe infrequency of his class appearances didn’t stop one female student from emailing a friend near the semester’s start, “My class’s TA looks like a murderer.”\nJohn says he tries to look at TAs’ individual attributes and put them to work where they will be the most useful while training them on their weaker points.\nIn this instance, however, “Bryan quickly disabused me of the idea that I would get a sufficient amount of work out of him, and I quickly figured out he was a bit of a douche. And within a few weeks I realized this was going to be an exceptionally long semester.”\nDespite Kohberger missing class, the prof saw him plenty.\nHere’s the latest coverage on Bryan Kohberger:\n- Bryan Kohberger’s classmates made 13 formal complaints about the killer for ‘being a d–k,’ making offensive comments: report\n- Bryan Kohberger’s creepy remark on night of Idaho murders revealed by surviving roommate\n- Eerie leaked videos of Bryan Kohberger with red hands inside cell being probed by Idaho prison\n- Bryan Kohberger’s phone records unveil similarities to Norman Bates: ‘Just super eerie’\n“He rapidly developed the habit of coming in at the end of the day, when I clearly wanted to go home,” he says. “He would start talking about inane, stupid and immature things. . . . I quickly realized this was a technique where he felt like he was in control as long as he was wasting my time.”\nKohberger once tried to tell John how he was going to get out of a parking ticket, even managing to get him to examine the “scene.” It turned out the TA had parked next to a yellow curb in a lot where he didn’t have a permit anyway.\nAdmonitions that in his experience as a defense attorney, people who believe they know the law better than the courts are always wrong fell on deaf ears.\nJohn says over time Kohberger “would follow me down the hall yapping, and I started calling it his ‘terrier routine.’”\nWhen John’s wife was waiting for him in the car once, she saw Kohberger following him and recoiled nearly to the other side, a reaction he’d never seen from her in many years of marriage.\nSnyder had grown to hate Kohberger over the course of the semester but never thought he was dangerous — he actually considered him a wimp.\nHe learned of Kohberger’s arrest along with everyone else. He was in his office Dec. 30 in a nearly empty building when the custodian told him the police had the basement sealed off.\nThey ended up walking to a picture board of department members, and the custodian started pointing at photos speculating whose office the police might be searching.\nWhen the custodian got to Kohberger, it hit him: His teaching assistant was the murderer.\nThen his phone rang; his brother-in-law told him Kohberger had been arrested. That call was interrupted by his son calling, which was interrupted by the Moscow, Idaho, police calling to set up an immediate interview; he drove to Moscow instead of waiting around for them to show up.\nFrom the police he learned Kohberger had a list of women’s names of unknown purpose — though surely not anything good — and one of them was a woman he knew from the department. But overall he wasn’t able to greatly help them besides describing Kohberger’s character.\nHaving worked with a mass murderer was a system shock for John, even if he always disliked the guy.\nThe university’s standard trauma-assistance programs proved unhelpful; the support “hotline” he called listed every imaginable identity group besides his own — old white men — and then said it could set an appointment in two weeks.\nBut he says the stream of graduate students and undergrads coming into his office to offer support “was one of the coolest things I’ve ever experienced.”\nThe department chair also transferred his own excellent teaching assistant to John for the next semester to ease his workload — and so there would be no more surprises.\nJohn says the reality of the crime isn’t what bothers him — it is instead someone studying criminology to become a better criminal instead of to pursue justice.\n“It was the assault on why I do what I do: promote justice and fairness, to find honor where there isn’t any, to teach people to be decent human beings, and to realize that life goes on, and to let people who had not experienced respect from the system know that the power to move past their troubles is inside them.”\nMost of the people he worked with throughout his career were in bad circumstances and needed help out of the abyss, while Kohberger chose to dive into it.\nThough this may be over for the public, for those affected it will never go away, and a feeling of safety is slow to return when you learn you have been in close contact with a monster.\nThis coming year is likely to be Snyder’s last spent teaching, not just because of Kohberger — he has been working to make a more just society since 1988 and is tired.\nLet’s hope some of the students he’s taught over the last 10 years can pick up the torch and none of them turns out to be the next Bryan Kohberger.\nAs for his former TA, it is John’s belief that being both extremely irritating and physically weak he won’t survive to the end of his natural life in prison.\nBrad Pearce writes The Wayward Rabbler on Substack."
    }
  ],
  "argos_summary": "Reggie Carroll, a 52‑year‑old Baltimore comedian known as “The Knockout King of Comedy,” was shot and killed in Southhaven, Mississippi, with police saying a suspect is in custody and the investigation ongoing. Tributes poured in from fellow comedians and actors, including Mo’Nique, who called him a brother in comedy, and his brother Jonathan thanked supporters. The article also briefly covers unrelated stories about a Cracker Barrel board member’s DEI background and a viral ICE arrest photo, but focuses primarily on Carroll’s death and the community’s response.",
  "argos_id": "M0OMUUBVC"
}