{
  "url": "https://www.reuters.com/sustainability/boards-policy-regulation/south-korea-parliament-passes-amended-bill-target-low-equity-valuations-2025-08-25/",
  "authorsByline": "Reuters",
  "articleId": "4787fabf0c93456fb7a864876a71c172",
  "source": {
    "domain": "reuters.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.reuters.com/resizer/v2/KDKM362XGJM37PPIFRYIMOQEPU.jpg?auth=b6d744a3d2f39839b9d10b4ed15ff47ba6e0fca40a559895bd35c865108d17a8&height=1005&width=1920&quality=80&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T03:16:13.499000+00:00",
  "addDate": "2025-08-25T03:23:54.173791+00:00",
  "refreshDate": "2025-08-25T03:23:54.173792+00:00",
  "score": 1.0,
  "title": "South Korea parliament passes amended bill to target low equity valuations",
  "description": "South Korea's parliament on Monday approved a bill that intends to increase the accountability of corporate boards to shareholders, as the ruling party-controlled parliament pushes reforms to boost the country's equity valuations.",
  "content": "SEOUL, Aug 25 (Reuters) - South Korea's parliament on Monday approved a bill that intends to increase the accountability of corporate boards to shareholders, as the ruling party-controlled parliament pushes reforms to boost the country's equity valuations.\n\nThe revised Commercial Act bill, a follow-up to earlier revisions passed on July 3, will force large companies to implement more separate votes when introducing audit committee members to strengthen oversight.\n\nThe bill also \"aims to enable minority shareholders to elect their own representatives to the board,\" said Kim Jin-wook, a Citi Research analyst based in Seoul.\n\nThe changes come as President Lee Jae Myung pledged to revive legislation to curb abuses by controlling shareholders after he signaled improving corporate governance could help eliminate the so-called \"Korea Discount\", a term that refers to lower valuations of Korean companies compared with overseas peers due to their opaque governance structure.\n\nThe ruling Democratic Party holds the majority in the 300-seat parliament, making the passage of contentious bills easier after Lee's predecessor, acting President Han Duck-soo, sided with conglomerates and vetoed the bill.\n\nThe commercial act revision has been fiercely opposed by South Korean businesses.\n\n\"We regret that the National Assembly passed a supplementary amendment to the Commercial Act just a month after the first revision, aimed at expanding the separate election of audit committee members and mandating a cumulative voting system,\" The Federation of Korean Industries said in a statement on Monday.\n\nIt also urged parliament to work on ways to minimize the impact now that \"the significant potential for increased management disputes and litigation risks\" is expected.",
  "medium": "Article",
  "links": [
    "https://www.reutersagency.com/en/licensereuterscontent/?utm_medium=rcom-article-media&utm_campaign=rcom-rcp-lead",
    "https://www.reuters.com/sustainability/boards-policy-regulation/south-korea-assembly-passes-commerce-bill-expanding-duty-boards-shareholders-2025-07-03/",
    "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
    "https://www.reuters.com/company/nvh-korea-inc/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "South Korea parliament",
      "weight": 0.0877027
    },
    {
      "name": "contentious bills",
      "weight": 0.084551856
    },
    {
      "name": "amended bill",
      "weight": 0.0840893
    },
    {
      "name": "audit committee members",
      "weight": 0.07835283
    },
    {
      "name": "parliament",
      "weight": 0.07576837
    },
    {
      "name": "President Lee Jae Myung",
      "weight": 0.074590564
    },
    {
      "name": "low equity valuations",
      "weight": 0.07279318
    },
    {
      "name": "increased management disputes",
      "weight": 0.07004549
    },
    {
      "name": "earlier revisions",
      "weight": 0.06931642
    },
    {
      "name": "corporate boards",
      "weight": 0.068952784
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9697265625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.92431640625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.8095703125
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.78662109375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.748046875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.50146484375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.486572265625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.31494140625
    }
  ],
  "sentiment": {
    "positive": 0.10700621,
    "negative": 0.5736882,
    "neutral": 0.31930557
  },
  "summary": "South Korea's parliament has approved a revised Commercial Act bill, aimed at increasing corporate board accountability to shareholders. The bill will require large companies to implement more separate votes when introducing audit committee members to strengthen oversight. The changes come as President Lee Jae Myung pledges to revive legislation to address abuses by controlling shareholders. Despite opposition from businesses, the Federation of Korean Industries has expressed regret over the bill's passage.",
  "shortSummary": "South Korea's parliament approved a bill to increase shareholder accountability on corporate boards and enhance equity valuations, despite opposition from major companies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ed21e887f9684ff681b7e931d926dc72",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
      "text": "The Trust Principles\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity, and freedom from bias in the gathering and dissemination of information and news.\nTrust Principles – the history\nThe Trust Principles were created in 1941, in the midst of World War II, in agreement with The Newspaper Proprietors Association Limited and The Press Association Limited (being the Reuters shareholders at that time). The Trust Principles imposed obligations on Reuters and its employees to act at all times with integrity, independence, and freedom from bias.\nReuters Directors and shareholders were determined to protect and preserve the Trust Principles when Reuters became a publicly traded company on the London Stock Exchange and Nasdaq. A unique structure was put in place to achieve this. A new company was formed and given the name 'Reuters Founders Share Company Limited', its purpose being to hold a 'Founders Share' in Reuters.\nThe legal structure has evolved over time and the Founders Share and other contractual arrangements now confer a number of special rights upon the Thomson Reuters Founders Share Company. For example, (i) the Thomson Reuters Founders Share Company has enhanced voting rights in circumstances where someone is seeking to obtain a significant shareholding in, or acquire control of, Thomson Reuters and (ii) the prior consent of the Thomson Reuters Founders Share Company must be sought prior to undertaking any sale of, or other material transaction involving, the Reuters news business unit.\nThomson Reuters itself is obliged and committed to apply the Trust Principles to its operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the Thomson Reuters business and require Thomson Reuters Directors, in the performance of their duties, to have due regard to the Trust Principles, by the proper exercise of their powers and in accordance with their other duties as Directors.\nThe Trust Principles are:\n- That Reuters shall at no time pass into the hands of any one interest, group, or faction;\n- That the integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved;\n- That Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers and to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts;\n- That Thomson Reuters shall pay due regard to the many interests which it serves in addition to those of the media; and\n- That no effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business\nThomson Reuters Founders Share Company was established in 1984 when Reuters became a public company. The directors of Thomson Reuters Founders Share Company (known as ‘Trustees’) have a duty to ensure, to the extent possible, that the Trust Principles are complied with.\nThe Trustees are experienced and eminent people from diverse arenas in politics, diplomacy, media, public service and business. The Trustees are selected by a nomination committee and proposed to the board of the Thomson Reuters Founders Share Company for appointment. The nomination committee assists in scrutinizing candidates’ suitability and its members include two persons appointed by the chairman after consultation with the European Court of Human Rights and representatives of certain press associations. The Thomson Reuters Corporation board has two representatives on the nomination committee. The Chairman and Deputy Chairman of the Thomson Reuters Founders Share Company Board are members of the nomination committee, and the Chairman appoints three other directors of the Thomson Reuters Founders Share Company as members of the nomination committee. The Chairman of the Thomson Reuters Founders Share Company acts as chairman of the nomination committee.\nThe number of Trustees has to be at least 14 and not more than 18. Trustees have a minimum of two meetings per year, and receive reports on our activities in the different fields in which we operate (including Reuters news). The Trustees meet with both the Thomson Reuters Board and representatives of senior management. Through Thomson Reuters Founders Share Company's Chairman, regular contact is maintained with our company. The relationship is one of trust and confidence.\nIndependence of Thomson Reuters\nCustomers across the world depend on us to provide them with reliable and objective news and information.\nThis means that we have a special need to safeguard our independence and integrity and avoid any bias which may stem from control by specific individuals or interests.\nThe Thomson Reuters Trust Principles were adopted in 1941 and include the preservation of integrity, reliability of news, development of the news business, and related principles.\nToday, the Trust Principles are fundamental to our entire business.\nMore information\nContact us\nBrian Moss\nFor inquiries pertaining to Reuters reporting standards and the Trust Principles please email: brian.moss@thomsonreuters.com."
    }
  ],
  "argos_summary": "South Korea’s parliament approved a revised Commercial Act that strengthens corporate governance by requiring separate votes for audit committee appointments and allowing minority shareholders to elect board representatives, aiming to lift the 'Korea Discount' and improve equity valuations. The ruling Democratic Party pushed the bill after President Lee Jae‑Myung pledged to curb controlling‑shareholder abuses, while the Federation of Korean Industries warned of increased litigation risks. The article also includes an unrelated detailed explanation of Thomson Reuters’ Trust Principles.",
  "argos_id": "MK4MMMUAM"
}