{
  "url": "https://www.nytimes.com/athletic/6572800/2025/08/25/max-dowman-premier-league-youngest-scorer-record/",
  "authorsByline": "Stuart James",
  "articleId": "89bc1320ef5c4583b9c92adc827500d4",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/24165403/2408-briefing.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T04:15:27+00:00",
  "addDate": "2025-08-25T04:23:24.633899+00:00",
  "refreshDate": "2025-08-25T04:23:24.633902+00:00",
  "score": 1.0,
  "title": "The Briefing: Why Max Dowman can break a 20-year Premier League record",
  "description": "The big talking points from the Premier League weekend, including more passing into trouble and the grappling 'crackdown'",
  "content": "Welcome to The Briefing, where every Monday during this season, The Athletic will discuss three of the biggest questions to arise from the weekend’s football in England.\n\nThis was the round of matches when a boy who should be getting his feet measured for a new pair of school shoes about now threatened to break a Premier League record several years older than he is.\n\nThe other talking points include ‘the most dangerous pass in football’ doing far more harm than good to Manchester City, and we also take a look at the referees’ clampdown on rugby-tackling at set pieces and wonder if it will be here today and gone tomorrow.\n\nRecords come and go, but the identity of the Premier League’s youngest goalscorer has remained unchanged for far longer than Everton’s James Vaughan could have imagined when he came off the bench, at the age of 16 years and 270 days, and turned home a cross against Crystal Palace at Goodison Park.\n\nThat was more than two decades ago – April 10, 2005, to be exact. Or, to put it another way, over four years after Max Dowman, who made his senior debut for Arsenal aged 15 years, five months and 28 days on Saturday against Leeds United, was born.\n\nVaughan took the record from the evergreen James Milner, who had held it for two and a half years. As for Milner, he knocked Wayne Rooney off his perch, only two months after the Everton teenager scored that goal against Arsenal. It was Michael Owen of Liverpool and – a blast from the past – Tottenham’s Andy Turner before all of that.\n\nIt seems strange to think that the youngest player to score in the Premier League since Vaughan that day is Federico Macheda, who was 17 years, seven months and 14 days when he got the winner for Manchester United against Aston Villa in April 2009.\n\nTo highlight how times change, in an interview with The Athletic’s Oliver Kay a couple of weeks ago, Milner told a story about how he spent his first Leeds win bonus on buying “my own phone line, my own Sky (satellite television) box and my own TV” for his bedroom at his parents’ house. Dowman, you imagine, will already be well covered in that respect.\n\nDowman, who is still at secondary school but has been playing under-18 football since he was 13, could have become the Premier League’s youngest ever player last season – a record held by his Arsenal team-mate Ethan Nwaneri – but for Premier League age restrictions which state that 15-year-olds can only play provided they are 15 by August 31 in the campaign in question.\n\nBut becoming the youngest Premier League goalscorer feels close to inevitable, given Dowman has almost the whole of the 2025-26 season to do it and the esteem in which he is held.\n\n“There is a kid here that has zero hesitation and is so convinced that, at 15, he can go and deliver, which I have never witnessed in my life,” Mikel Arteta, Arsenal’s manager, said. “For us, he brings joy, he brings emotion and something else that makes our jobs so great.”\n\nIt was an impressive half-hour cameo from Dowman against Leeds, featuring flair, confidence, pace, swagger and ability. The only thing missing was a goal – and you sensed that the rest of the Arsenal players wanted the kid to score every bit as much as he did himself.\n\nAt one point, Declan Rice relinquished the opportunity to shoot in favour of passing to Dowman, and there was a split-second later on when you wondered whether the Arsenal players might hand the ball to the teenager after he won the penalty that became their fifth and final goal of the game.\n\nWith or without any additional help, that landmark goal is surely going to come.\n\nWhy do teams keep playing that pass?\n\nLast season, The Athletic called it “the most dangerous pass in football”.\n\nWe were talking about the short, vertical ball that teams use to play out against a high press, generally from inside their own penalty area, often from a goal kick and typically from the ’keeper to a midfield pivot, all with the intention of finding the spare man.\n\nWell, it’s still giving supporters heart palpitations, driving managers bonkers, and serving up goalscoring opportunities on a plate for the other side.\n\nTottenham Hotspur doubled their lead at the Etihad Stadium in Saturday’s early game after Manchester City got themselves into a tangle, and that evening Viktor Gyokeres should have opened the scoring for Arsenal against Leeds following another mix-up.\n\nIt’s a high-stakes game of risk and reward that some managers would rather not play at any stage of the match, let alone in the closing moments.\n\nDavid Moyes, the Everton manager, threw his arms in the air in a mixture of frustration and despair when, with nine minutes of normal time remaining at Elland Road in Everton’s opening game of the season last Monday, goalkeeper Jordan Pickford chose to play a straight ball to the feet of the retreating Carlos Alcaraz, who had Ilia Gruev, the Leeds midfielder, chasing him down.\n\nAlcaraz tried to turn as he received midway inside his own half but slipped. Gruev collected the ball and, less than 20 seconds later, Leeds were awarded the penalty that decided the game.\n\nFor City, in contrast to Everton, this is a central component of how they play under Pep Guardiola, using ‘bounce’ passes to invite pressure and find the free man. The goalkeeper is key to that process, and perhaps we had taken for granted just how calm and capable Ederson was during those moments when it must feel like a net is closing around you.\n\nJames Trafford, a former City academy kid signed from Burnley in the summer, found himself in that scenario as Tottenham pushed five players forward in a narrow and high press that snared the home side’s Nico Gonzalez.\n\nMany people will shake their heads at the image above and wonder how the City midfielder, with Pape Matar Sarr tightly marking him and four other Spurs players within 10 yards, is the right pass.\n\nYou can’t help but question why Trafford didn’t either knock the ball to John Stones on his right or, better still, go over the top of the press, instead of delivering such a telegraphed pass.\n\nAt the same time, Gonzalez didn’t help himself. Typically from a goal kick, the midfielder receiving will arrive on the blindside of their marker, as with Rice in the images below from Arsenal’s game against Chelsea last season.\n\nGonzalez, however, made himself a sitting duck, and Trafford failed to recognise the danger.\n\nAs the camera cut to Guardiola seconds after Palhinha made it 2-0 to Tottenham, the picture said it all.\n\nAs for Leeds, they could count themselves fortunate that Gyokeres never realised how much time he had after Martin Zubimendi smothered Anton Stach following another signposted straight pass, albeit this time from a defender rather than the goalkeeper.\n\nThe intention, presumably, was for Pascal Struijk to find Joe Rodon via Stach. But Zubimendi read the script, Stach arrived straight, and it was an awkward pass for the midfielder to try to make to Rodon under intense pressure.\n\nIt evoked memories – and not good ones – of the way last season’s three promoted clubs (Ipswich Town, Leicester City and, in particular, Southampton) underestimated how difficult it is to execute those patterns against far better quality opponents than they had to deal with in the second-tier Championship.\n\nThe phrase “a time and a place” comes to mind.\n\nNo more holding on corners… but pushing is fine?\n\nAnd so the officials’ crackdown on holding at set pieces is a real thing, and Calvin Bassey has become an early victim of the promise to punish players for what has been described as performing a “non-footballing action” that impacts on an opponent’s movement. In other words, a rugby tackle.\n\nFulham’s Bassey ticked that box at Craven Cottage on Sunday when he wrestled Mason Mount to the floor at a Manchester United corner, with a VAR review of the first-half incident resulting in a penalty award. Bassey, much like Mount a few seconds earlier, didn’t have a leg to stand on at the end of it all, although that didn’t stop the central defender from protesting.\n\n“I still think it’s harsh,” Bassey told Sky Sports afterwards. “I understand why it’s given. (But) I’m trying to stay strong because I know the block is coming. And then I’ve just sort of pulled him over my foot. If it’s someone stronger, I don’t think it looks so bad.”\n\nAs it was, Mount was thrown to the floor like a rag doll.\n\nThat said, it seemed curious that Luke Shaw got away with doing something not dissimilar to the Fulham forward Rodrigo Muniz on the same corner just a few feet away from the Mount incident. The explanation given was that Bassey committed his foul before Shaw did.\n\nThe question with anything like this is whether a stricter application of the rules is here to stay or just a fad that, much like a New Year’s resolution, starts promisingly but quickly falls away.\n\nGrappling at corners and free kicks had been out of control for a while, to the point that the sight of defenders not even looking for the approaching ball while holding onto an opponent with both hands had almost become normalised.\n\nThe key for everyone – managers, players and supporters – is consistency around referees’ decision-making, and from Fulham’s point of view, they got a raw deal against United yesterday because of an incident that went against them in the second half of the game.\n\nReplays showed that Leny Yoro, the United defender, pushed Bassey in the lead-up to United opening the scoring, yet the goal was allowed to stand.\n\nPushing is clearly different to holding, or grappling, but it’s a foul all the same.\n• Only one place to start: Newcastle versus Liverpool on Monday night. Always a lively fixture, this latest instalment promises to be compelling viewing given the absence of Alexander Isak. His name will dominate the build-up after being at the centre of a messy and bitter transfer saga involving the two clubs.\n• It’s the second round of the Carabao Cup this week, the entry point for the 11 Premier League clubs not involved in European competition this season. Manchester United travel to Blundell Park, the home of Grimsby Town, on Wednesday. Grimsby are currently fifth in League Two and unbeaten in the fourth tier after five games. In short, it’s the last sort of fixture United need right now. Wolves and West Ham — the bottom two in the Premier League after the season’s first two weekends — would probably say the same about their meeting at Molineux tomorrow.\n• Maybe we cursed Celtic and Rangers in last week’s Briefing by talking about a “steady improvement” in Scottish clubs’ performances in Europe in recent years. Celtic promptly drew 0-0 at home against FC Kairat in their Champions League qualification play-off, while Rangers pressed the self-destruct button and lost 3-1 to visitors Club Brugge. Celtic’s second leg in Kazakhstan tomorrow still looks winnable, but it’s hard to say the same thing about Rangers in Belgium a day later.\n• Let’s not dwell on Crystal Palace’s Europa League/Conference League saga any longer. The bottom line is that their fans have waited a long time for European football, so it would be a crying shame if this proves to be a one-week-and-done affair. On Thursday, last season’s FA Cup winners are in the Norwegian city of Fredrikstad for the second leg of their Conference League play-off tie, holding a slender 1-0 lead. Palace will be hoping this isn’t the last time those supporters get their passports stamped this season.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6550783/2025/08/14/james-milner-interview-cameras/",
    "https://www.nytimes.com/athletic/6564479/2025/08/24/fulham-1-manchester-united-1-briefing/",
    "https://www.nytimes.com/athletic/6527590/2025/08/08/arsenal-max-dowman-breakthrough-player/",
    "https://www.nytimes.com/athletic/6083022/2025/01/24/max-dowman-arsenal-arteta-first-team/",
    "https://www.nytimes.com/athletic/6564448/2025/08/23/manchester-city-0-tottenham-2-guardiola-frank-trafford-palhinha/",
    "https://www.nytimes.com/athletic/6556954/2025/08/23/max-dowman-arsenal-age-first-team/",
    "https://www.nytimes.com/athletic/5991727/2024/12/20/goalkeeper-pass-danger-football-analysis/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Premier League",
      "weight": 0.06446133
    },
    {
      "name": "Premier League age restrictions",
      "weight": 0.059149
    },
    {
      "name": "Last season",
      "weight": 0.056350246
    },
    {
      "name": "last season",
      "weight": 0.056350246
    },
    {
      "name": "Leeds United",
      "weight": 0.054788534
    },
    {
      "name": "Conference League",
      "weight": 0.053767834
    },
    {
      "name": "Champions League",
      "weight": 0.05265437
    },
    {
      "name": "League Two",
      "weight": 0.052642975
    },
    {
      "name": "Europa League",
      "weight": 0.052534975
    },
    {
      "name": "Manchester United",
      "weight": 0.05027228
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9951171875
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.96337890625
    }
  ],
  "sentiment": {
    "positive": 0.10644582,
    "negative": 0.47857356,
    "neutral": 0.41498062
  },
  "summary": "The Briefing, The Athletic's weekly news program, focuses on three key issues in football, including why Max Dowman is threatening to break a 20-year Premier League record, several years older than he is. Dowman, who made his senior debut for Arsenal at 15 years, five months and 28 days old, could break the record for the youngest Premier League goalscorer in the history of the league. James Vaughan, who held the record at 16 years and 270 days ago, was the youngest player to score in the Premier League since then. The Briefing also discusses the referees' clampdown on rugby-tackling at set pieces and the potential for teams to continue playing the dangerous pass used by Manchester City.",
  "shortSummary": "Max Dowman, at 15, is poised to break a 20-year Premier League record as the youngest Premier League goalscorer, highlighting his confidence and skill.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6b6facd70ac341b0abec3b57e8001370",
  "places": [
    {
      "osmId": "154716043",
      "road": "Goodison Road",
      "suburb": "Walton",
      "city": "Liverpool",
      "stateDistrict": "Liverpool City Region",
      "state": "England",
      "postcode": "L4 4EL",
      "country": "United Kingdom",
      "countryCode": "gb",
      "coordinates": {
        "lat": 53.43868975,
        "lon": -2.9664192834741883
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6527590/2025/08/08/arsenal-max-dowman-breakthrough-player/",
      "text": "After Ethan Nwaneri and Myles Lewis-Skelly, there is no hiding from who appears to be next off the Hale End conveyor belt.\nMax Dowman’s involvement during pre-season should not have come as a surprise to anyone who follows Arsenal.\nManager Mikel Arteta spoke about the 15-year-old in press conferences earlier this year, and made public his plans for the England Under-17 international to travel to Singapore and Hong Kong.\nWhat may be surprising, however, is the ease with which the attacker has translated his exploits in youth football to playing against senior pros.\nHis introduction against Milan on July 23 at the Singapore National Stadium was a clear indicator of his talent, but the skilful and powerful run that resulted in a penalty against Newcastle United four days later at the same venue showed his confidence.\nHe won another penalty in his first senior game at the Emirates against Villarreal on August 5, but it was his ability to repeatedly dribble past his man to get shots off and crosses into the box that really caught the eye.\nIt was reminiscent of Dowman’s first appearance at the Emirates Stadium, an FA Youth Cup tie against Manchester United Under-18s in February. That night, there were times when he was triple-marked. Even so, he still found time to pick up the ball in his own half, drive up to the United penalty area, twist the opposition inside out to win a penalty, and then convert it.\nHe was playing three years above his age. By the end of the tour to Asia with the first team, the 15-year-old was being double-marked by Spurs’ Djed Spence and Son Heung-min in Hong Kong in the first north London derby on foreign soil on July 31.\n“It is special,” Arteta said after Dowman’s performance against Newcastle. “Obviously, what he’s done today against this team in the time that he had on the pitch is something certainly not common to witness for a 15-year-old.\n“We are extremely happy to have him. I think again the environment that he’s around in, his family, the people at the club, and around the academy as well (are) super helpful because they put him into this position so early in his journey, having a real chance and a real presence when he plays for the first team.”\nAdvertisement\nAfter his performance against Villarreal, the Arsenal manager added, “He continues to impress, without a doubt. The impact he had in the game again today, the efficiency that he shows in every attack and action, it’s incredible. Again, he deserves to have chances, and if he continues like this, let’s see what happens.”\nArteta’s use of Dowman on the right wing has made sense. As with Nwaneri last season, that is an area of the pitch that allows attacking players to get repetitive actions to showcase what they are good at. In Dowman’s case, it is showing his initial burst of pace over five yards and sustaining it over a distance that makes it a genuine challenge to keep up with him. From there, he can either take on the last line of defence on the dribble or have a shot.\nThose strides, paired with his close control, were also an issue for Europe’s best teenagers to deal with this year.\nAway in Albania for the Under-17 European Championship in May, he came up against Belgium midfielder Nathan de Cat. The 6ft 2in (188cm) 16-year-old, now 17, made 30 senior appearances for Anderlecht last season, scoring four goals and assisting another four. The pair had an intense midfield battle, each coming out on top in different moments, but to see Dowman survive against a player of that stature was encouraging.\nWhen it comes to his shooting, his ability off both feet sets him even further apart.\nWatching him for the first time in person, in October 2024 against Paris Saint-Germain in the UEFA Youth League, it was hard to distinguish which foot was the strongest.\nThat afternoon, he started the game on the bench, but was brought on after half an hour to play on the right wing. Towards the end of the first half, he latched onto a speculative ball forward and curled a well-struck left-footed effort just wide.\nBy the hour mark, he was hitting a strike just as firm off his right foot, which would have nestled in the top corner if not for the goalkeeper’s quick reactions.\nAs was the case against Milan on the recent tour, it wasn’t what he did in the final third that was the first impression. Instead, it was his awareness to let the ball run across his body followed by quick feet that saw him fouled within seconds of his introduction.\nDowman’s age makes his situation different from almost everyone who has come before him.\nAdvertisement\nNwaneri was 15 years and 181 days when he became the Premier League’s youngest player in September 2022, but he did not play back-to-back games until he was 17 last season.\nArteta cited this as the most similar situation to Dowman’s he has seen, but added, “It was a different stage. With Max, it’s been so fast. Even last year, when he was training with us, he was doing this kind of thing in training, and now he’s doing it in the game consistently. So the three or four games that he’s played, he’s managed to impact and have big moments in the game.”\nNwaneri’s first pre-season involvement came as a 16-year-old, when he featured away at Nuremberg, but not on the actual tour in the United States. At Barcelona, Lamine Yamal made his first-team debut at 15 years and 289 days in April 2023, but like Nwaneri, this was his only first-team appearance that season. He did play 37 La Liga games as a 16-year-old the following season, though.\nGoing further back, Cesc Fabregas and Jack Wilshere were both months past their 16th birthdays when Arsene Wenger gave them debuts in 2003 and 2008 respectively. Like Yamal, their first spells of regular football did not come until the seasons that followed.\nLionel Messi was 16 and four months old when he played in a Barcelona friendly against Porto, the inaugural game in their Estadio do Dragao in October 2003. It was not until a year later, at 17 and four months, that Messi made his competitive debut against Espanyol.\nWith little precedence for blooding a 15-year-old into a first-team environment, care will be needed.\nAsked how realistic Premier League involvement would be for Dowman this season, Arteta said: “Let’s see how it goes. Let’s go into Saturday (against Athletic Club), into the break as well. He needs a little break because he hasn’t had any holidays really. So, in the next few days, he’s going to have a break, which I think he needs. And then, following the week, he’ll be ready again to go.”\n(Top photo: David Price/Arsenal FC via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6550783/2025/08/14/james-milner-interview-cameras/",
      "text": "The Athletic has live coverage of Liverpool vs Bournemouth in the first match of the 2025-26 Premier League season\nThe 24th season of James Milner’s Premier League career began with a knock on the door of his hotel room at 5.15am on June 2, just eight days after the previous campaign had ended.\nHe was on a golfing trip in America with a group of friends, but while the others were sleeping off their jet lag before the day’s play, Milner and fitness coach Adrian Lamb were ready for work.\nAdvertisement\n“The 2025-26 season starts here,” Lamb told him with a grin — and so it did, a gruelling gym session representing day one of a 10-week build-up to the new campaign for the Premier League’s oldest player.\nThe Brighton & Hove Albion midfielder and Lamb go back a long way — to the summer of 2004, when the latter was taken aback by the sight of an 18-year-old Milner forcing his way to the front of the pack during a running drill on day one at Newcastle United under Sir Bobby Robson, an unexpected rival to the late Gary Speed’s crown as the king of pre-season fitness testing.\nMilner’s Premier League story goes back even further than that: as a 16-year-old, straight out of school, suddenly thrust into the first-team squad at Leeds United, training alongside his heroes, making his debut and then becoming the Premier League’s youngest goalscorer nine days before his 17th birthday while still living with his parents.\nAnd look at him now, more than two decades later, five months short of his 40th birthday, 15 matches away from Gareth Barry’s record of 653 Premier League appearances, counting down the days towards Brighton’s opening game at home against Fulham on Saturday. He has come back for more despite spending most of last season on the sidelines, worrying that he might not even be able to walk again — never mind play again — after complications arising from knee surgery left him unable to move his foot for months.\nPre-season was very different in those days at Leeds and Newcastle in the early and mid-2000s. “You didn’t get the balls out for the first two weeks,” Milner says. “These days, you get your fitness from your football sessions on the pitch. Those sessions are intense, but it’s a lot more ball-oriented as opposed to that base running on beaches and in forests, doing drills until someone was sick.\nAdvertisement\n“In those days, there was one fitness coach (at a club), two maximum. These days, you come in for pre-season and the first two days are pure testing: running tests, jumping tests, nutrition tests, blood tests, fat tests, balance tests, concussion tests, strength in your legs, your teeth, your eyes.”\nIn his time at Liverpool, Milner was famed for winning the pre-season “lactate test” — a brutal exercise which tests players’ aerobic endurance and measures their lactic acid level — year after year.\nHaving joined Brighton two years ago, he is no longer allowed to do some of the exercises — not to spare his younger team-mates’ blushes but “because of my age and because they’re looking after me”. “But I’m still covering a good distance when I play,” he says. “The high-intensity running and top speed have come down a little, but I can still get about the pitch. And they say as you get older, the first couple of yards are in the head.”\nDid he ever question whether he wanted to carry on after last season’s frustrations? Was there not a part of him that was starting to feel that, like Danny Glover’s world-weary cop in the Lethal Weapon movies, he was “getting too old for this s**t”?\n“I always wanted to carry on,” he tells The Athletic at Brighton’s training ground. “But there were major doubts about whether I could. For a long time, I couldn’t lift my foot up. That’s probably enough for most people to have doubts about me. I can’t really explain the feeling of trying to lift your toes, straining with everything you’ve got, and nothing is moving.\n“Sean Duggan (Brighton’s physio) did an incredible job looking after me all the way through. But with me not being able to lift my foot, we were both thinking it could be, ‘That’s it. Finished. Thanks for coming.’\n“But we broke it down, took the time, worked hard to get the foot moving again and got the knee as strong as we could. It was a monumental effort on Sean’s part to get me fit to come on at Spurs (in the final game of last season), and then the work has continued over the summer. I had literally a week off and then, from the start of June, I was straight on it again, trying to get ready for the season. Nothing changes.”\nNothing changes? It is tempting to say that, since 2002, Milner has been the one constant in an English game that has changed almost beyond recognition. That 2002-03 season was the last time David Beckham played in the Premier League, the last Manchester City played at Maine Road, the last Chelsea spent under the ownership of Ken Bates before their history — and the entire ownership model in English football — was transformed by the Roman Abramovich takeover.\nAdvertisement\nIt is extraordinary to think that a player who played under a manager born in 1933 (Robson) is now working for one born in 1993 (Fabian Hurzeler). Likewise to think that a player who sat on the Leeds bench alongside former England goalkeeper Nigel Martyn (born 1966) for his Premier League debut in November 2002 — and immediately came up against a West Ham United full-back born in 1963 (Nigel Winterburn) — now shares the Brighton dressing room with a £30million ($41m) centre-forward born in 2007 (Charalampos Kostoulas).\n“Mad, isn’t it?” Milner says. “We were working it out the other day and 15 of the lads here (Brighton) weren’t even born when I made my debut — something daft like that. There are lads I played with at the start of my career whose sons I’m now playing with or against: (Bournemouth forward) Justin Kluivert, I played with his dad (Patrick) at Newcastle; I played with (Derby County midfielder) Bobby Clark at Liverpool and played with his dad (Lee) at Newcastle; (Brighton winger) Tommy Watson’s girlfriend is (former Leeds full-back) Ian Harte’s daughter.”\nThis season might even bring him up against Arsenal’s 15-year-old prodigy Max Dowman, who was born on the final day of 2009 — by which time Milner was already an England international with more than 250 senior appearances to his name at club level. Without wishing to make him feel even older, Milner was probably already in his thirties at Liverpool, retired from international football, by the time Dowman first heard his name or found his image in a packet of football stickers.\nIt is one thing to break through early. It is quite another, having done so, to stay on the Premier League treadmill for 23 seasons and counting. It is often suggested that modern sports science has normalised longevity, but it isn’t really true. Players such as Cristiano Ronaldo (40), Luka Modric (39), Lionel Messi (38) and indeed Milner are freakish exceptions.\nShould Milner appear in the Premier League after his 40th birthday in January, he will be only the fifth outfield player to do so and the first since Ryan Giggs and Kevin Phillips, both of whom were born in 1973. Greater professional standards and advances in sports science might have helped to increase players’ longevity, but set against this is the increasing speed and physical requirements of the modern game, which in many cases seems to shorten careers at the highest level, particularly among early starters.\nMilner puts his longevity down to a combination of good fortune — he was an outstanding athlete from an early age — good influences (starting with his parents), good habits and a willingness to make sacrifices. As a teenager breaking into the first team at Leeds, he decided alcohol would not be part of his life. His unstinting dedication to his trade has at times seen him described as boring.\nSo many hugely talented players fall victim to pitfalls of one type or another early in their careers. Even among those who make it to the highest level, many seem jaded by the time they reach their late twenties or early thirties. You don’t have to think too hard to come up with examples of those who have either lacked a Milner-type mentality in the first place or who, whether sated by success and riches or weighed down by negativity, seem to have lost it somewhere along the way.\nHe is diplomatic when it comes to other players’ career trajectories — “every situation is different and everybody is different” — but as a senior professional, dating back to his days at Liverpool and even before that at City, he has often felt compelled to take young players aside and spell out both the size of the opportunity and the number of pitfalls that lie ahead.\nAdvertisement\n“You’ve got to want to do it,” says Milner, whose drive was evident when working with him on his book about life as a footballer in 2019. “You’ve got to have the love for it and the drive to do your best every day, season after season. The drive is probably the one reason I’m still playing. That thing of, ‘I don’t really feel like it today’, I’ve never really had that.\n“It’s not easy when you’re injured and you’re in the gym every day, doing your rehab, or when you’re getting up stupidly early on holiday to train. But if I didn’t have the drive to do that, it would probably be time to retire.”\nAs a 16-year-old playing and scoring for Leeds in the Premier League in 2002, Milner was earning £70 a week and still required to perform all the duties of a first-year apprentice — “cleaning the first-team players’ boots, picking their dirty kit up off the dressing-room floor”.\nWith his first win bonus, he went out and bought “my own phone line, my own Sky (satellite television) box and my own TV” for his childhood bedroom. It is a world away from the scenario faced by the Premier League’s teenage stars today, many of them multi-millionaires while still in their teens.\nIn some ways, Milner feels the integration from academy to Premier League is smoother these days for young players such as Ethan Nwaneri, 18, and Dowman at Arsenal and 16-year-old Rio Ngumoha at Liverpool.\n“They’re having proper training sessions at academies three times a week from eight years of age, playing tournaments all over the world in front of big crowds, getting used to it,” he says. “It is more natural in some ways. There’s all the support they have in academies these days. They’re treated as professionals from a very early age.\n“But the money, the social media, the hype… I don’t think any of that makes it easier. It becomes so easy to get ahead of yourself. It’s all thrust on them so early and there’s no hiding place for them, just because they’re amazing at football and playing first team at 16, 17, 18.\nAdvertisement\n“Everything is so public. There is talk about having cameras in dressing rooms, which for me is an absolute no-go. That can’t happen.\n“Some people are wise beyond their years, like (Brighton’s 20-year-old midfielder) Jack Hinshelwood, but you have others who might be equally talented who have had a different upbringing and different journey and they’re expected to grow up in public and somehow not make mistakes.\n“They’re on holiday, trying to get away from the pressure of it, and people are there with camera phones, recording their every move. And it’s going to grind you down. Then you get criticised, which is obviously a lot harder to take. And maybe it can get to that point where, for lads who have had all that from the start of their career, with that buzz and that energy, it starts to become a bit tiresome.\n“And then if you’re not getting a proper break in the summer, that becomes even harder. That’s another topic in terms of how many games people are playing. Every other year, players should get a full rest in the summer. But instead, it’s more and more games, less rest. With the Club World Cup and all of that now, it’s getting ridiculous.\n“If you’re expecting players to play from 18 to 32/33, when are they going to get a break? Everyone will burn out. It’s going to become completely impossible.”\nIf there had been no way back last season, if the doctors had told him it was over, would Milner have been able to make peace with that?\n“One hundred per cent, yeah,” he says. “I don’t think it would be the ideal way to finish any career, but I’ve been incredibly fortunate. I’ve played two careers, really. Some people are lucky enough to get eight or 10 years in the Premier League. I’ve had… what’s this? Season 24? Last season was unfortunate, but what have I got to moan about? You get to 34, 35 and you start to think, ‘If it ends at any point now, I can’t complain’.”\nAdvertisement\nHe was extremely grateful for the offer of a new one-year deal at Brighton at the end of that injury-ravaged campaign. He doesn’t know whether this one will be his last. “But if it is — maybe, maybe not — it would be nice for it to be more positive than last year was,” he says.\nWhat does he still hope to achieve? “It’s about being part of it and contributing to the team,” he says. “That’s always been it for me, to help drive the team and the club forward. I came here because I can see this club going places. This club is in a great position. We’ve got some great young players, a great young manager.\n“The club’s journey over the past 20 years or so has been incredible and I don’t think it’s beyond the realms of possibility to get into Europe again or win a trophy this season. There’s so much potential here. We just need to keep pushing forward.”\nIs breaking Barry’s record something he thinks about? “Only every time I do an interview and I get asked about it!” he says. “I keep hearing it’s 15 games (to equal it). Fifteen games when you’re 21 doesn’t sound like much. But this time last year, I started the first three league games and then I was out for nine months. I might play every game this year or I might not get anywhere near it.\n“It’s one of those: if I get it, fantastic, but to be honest I would rather be remembered for winning every domestic trophy with two clubs (Liverpool and City) or winning the Champions League (Liverpool) or scoring in the Premier League for Leeds when I was 16.”\nMilner has had plenty of time to think about what might come next.\nAt one point, he doubted whether he would be tempted into management or coaching, but he has earned his UEFA B and A Licence qualifications and, though he is yet to do the Pro Licence, he spent his time on the sidelines last season smartly, working closely with Hurzeler and his staff on an informal basis “to give me a taste for it”.\nAdvertisement\n“I wasn’t doing any actual coaching on the pitch,” he says, “but I did a lot of stuff with the manager and the coaches — game prep, videos, stuff like that. I learned a lot from being in the meeting rooms and the manager was open to me giving my opinion on certain things. That was great, and hopefully I was bringing some value from his point of view as well.\n“Whenever I do hang up my boots, I would still need that competition, whether that’s in football, out of football, management, whatever other options there might be. I would fancy running a marathon or a triathlon or Hyrox, which combines running with sledge pulls and things like that.\n“But whenever it is, I think a little break will be on the cards. It’s been quite intense for 24 years or whatever, so I’ll want to spend some time with my family.”\nThe 24th season of Milner’s Premier League career will involve a new shirt number: the No 20, which he will wear in honour of his former Liverpool team-mate Diogo Jota, who, along with his brother Andre Silva, died in a car crash in northern Spain on July 3.\n“I loved the guy, absolutely loved him,” Milner says. “Loved him as a player, loved him even more as a team-mate and a friend, absolutely loved him. Carlos (Baleba) wanted to change his number (Brighton's rising-star midfielder now has the 17 shirt), so the No 20 became available and it felt like the right thing for me to do. Every day when I put my kit on, I’ll think of him.\n“We were only together at Liverpool for three seasons and you might not have thought we had much in common — different nationalities, very different ages — but we hit it off immediately. Maybe it was because we were both so stubborn. Honestly, people say I’m stubborn, but Jots could give me a run for my money.\n“He was an unbelievable guy, one of my favourite team-mates I’ve had in all my time playing. He was always up for a laugh, always winding people up. He was one of those you could put in any corner of the dressing room, next to any other player, and he would click with them straight away.”\nAdvertisement\nThey messaged each other the night before the tragedy. “Nothing major, just checking in and asking each other how things were going,” Milner says.\nHe was at Brighton’s training ground when the terrible news began to circulate on social media that Thursday morning. “Someone asked, ‘Is that true?’ and I didn’t know at that point, obviously,” he says. “I messaged someone at Liverpool to try to find out and… just horrific. Not many tougher days than that.”\nLiverpool arranged a charter flight to take a group of players to Portugal the next day for the funeral. Milner was determined to be there even if it meant a five-hour drive from England's south coast after training. In his attempt to make it to Merseyside, he ended up snarled in traffic on the M25, so he flew out from Luton instead. He is hugely grateful to Brighton, as well as to Liverpool, for allowing him to pay his respects.\nThe footage of Jota’s former team-mates arriving in his hometown of Gondomar late that evening, before the funeral the following day, is harrowing. Milner describes the whole experience as “devastating” but says he felt “privileged to be able to pay my respects with the other lads and to spend a small amount of time with his wife and his family, which was important. It’s horrible to see a family go through that, but it’s the least we can do, to show them we’re there for them.”\nMilner looks and sounds like someone who still cannot believe what has happened. He keeps coming back to the same words: “devastating”, “horrific”.\nAt the same time, Jota’s death has brought certain things into sharp context, about how fragile life — and within that, something like a football career — can be.\n“It goes back to what we were saying about the season and life in general, about enjoying it, getting what you can out of it,” Milner says. “As you go through life, you get these reminders that every day is precious. You only get one go at a football career. You only get one go at everything, so you’ve got to give it everything you’ve got.”\n(Photo: Visionhaus/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6083022/2025/01/24/max-dowman-arsenal-arteta-first-team/",
      "text": "“No 7! No 7! Can we have your shirt please?”\nThose high-pitched cries felt like the soundtrack to the evening at a stadium on the outskirts of London on Saturday as a group of young children constantly pleaded with Arsenal’s right winger to hand over his jersey.\nThe venue was Meadow Park, home of non-League Boreham Wood, and the player in question was Max Dowman.\nAdvertisement\nPlaying three years above his age, Dowman was making his FA Youth Cup debut against Queens Park Rangers – a goalscoring debut, too. In September, he made his UEFA Youth League debut against Atalanta and, at the age of 14 years, eight months and 19 days, became the youngest player ever to score in the competition. In between, Dowman made his first appearance for Arsenal’s under-21s – a boy against men.\nPerhaps there would have been a Premier League debut as well this season but for the rules and regulations getting in the way. You need to be at least an under-16 (15 years of age by August 31, 2024 for the current season) to appear in the English top flight, which isn’t the case everywhere else. In theory, Dowman could play in La Liga now.\n“At the moment, with all the legislation, there are restrictions for your age — something that in other countries you don’t even mention,” Arsenal’s manager Mikel Arteta said this week when asked about the possibility of Dowman getting some first-team minutes. “We’ll have to wait and see. But he’s taking very fast steps because every time you put him at a different level he overcomes that hurdle pretty quickly.”\nGet ready to feel old. Dowman was born in 2009 — just. He celebrated his 15th birthday on New Year’s Eve, which means — and this part of his story is easy to overlook when you focus on his football journey — that he is currently in Year 10 at school and won’t be sitting his GCSE exams until the summer after next. It will be another two years before Dowman can drive a car in England and three years before he can buy a beer.\nIn other words, he is a gifted young footballer who plays with a maturity beyond his years but, ultimately, is still a teenage kid — and that adds an extra layer of responsibility to how you write about him.\nThose bursts of speed with the ball glued to his boot, his lovely knack of dropping his shoulder and gliding in off the right flank to shoot (or score, in the case of Saturday), the eye-of-the needle passes that he saw and you didn’t, and the way that he receives so naturally with the outside of his left foot before spinning away from opponents… it would be easy to make comparisons with players X, Y and Z. But it would also be silly to do that.\nWhat we can say without getting carried away is that Dowman has huge potential and that seeing him running with the ball on Saturday, leaving a trail of QPR players in his wake at times, took your breath away — even if you were supporting Arsenal’s opponents.\n“Oh, Jesus,” said the voice in the row in front as Dowman set off on another of his trademark surges in the second half.\nAdvertisement\nRemarkably, Dowman trained alongside him as a 14-year-old at Arsenal — Gabriel Jesus, that is. Indeed, at an age when his peers are kicking a ball about in the playground before double maths, Dowman has been wowing Arsenal’s first-team squad with his ability.\n“Some of the things that he does in training are unbelievable,” Arteta said on Tuesday, after Dowman took part in Arsenal’s session prior to their Champions League game against Dinamo Zagreb. “He’s a player with a huge talent.”\nReporting twice a week to London Colney (the home of Arsenal’s under-18s, under-21s and first team) as part of a bespoke development programme that includes one-to-one sessions, Dowman has been around Arteta’s squad for a while now.\nAt some point in the near future — and it’s surely just a question of when — the accelerated pathway that Dowman is on will culminate in a senior debut at Arsenal and see him join up permanently with Ethan Nwaneri and Myles Lewis-Skelly, who are still young enough to play in the FA Youth Cup this season but have both flown the under-18 nest to become regular members of the first-team squad.\nThat isn’t hyperbole in relation to Dowman. It’s just a logical progression for someone who featured for Arsenal under-18s when he was 13 and became the club’s youngest-ever under-21 player at the age of 14. In fact, pretty much from the moment he walked through the door at Arsenal at the age of four, Dowman has been playing in advance of his years. Even at international level, Dowman plays two years above his age for England Under-17s.\nWithout seeing Dowman play, the natural assumption would be that he is a powerful early developer, as is often the case with teenagers who are fast-tracked through the academy age groups. Dowman is that to a point — he’s a superb athlete, for sure — but he doesn’t thrive just because of his physicality. His acceleration is a big asset but his exceptional technical ability, and the intelligence with which he plays and sees the game, really stand out.\nAdvertisement\n“Please go online and check out this kid,” Rio Ferdinand said on his YouTube channel in November. “He was 14, I saw him coaching 18 and 19-year-olds on the pitch when he was playing with them. Bad player (which in this context actually means good player).”\nThose internet showreels of Dowman are jaw-dropping at times, especially given the age disparity, and give you an insight into what all the fuss is about. He’s capable of playing in multiple positions (many in the game think Dowman will end up more centrally, as a No 8 or a No 10), has a lovely range of passing, dribbles beautifully and scores freely.\nAt the same time, there’s nothing quite like seeing a player perform live. You get to take in the bigger picture that the video highlights don’t show, including how a player interacts with his team-mates and his coach, the positions they take up on the pitch when they don’t have the ball at their feet, and how they deal with moments of adversity.\nEarly in the second half on Saturday, after Dowman skipped away from an opponent on the touchline, another QPR player came across to make a robust challenge from the side. It was a fair tackle — he took the ball — but it was full-blooded too and he cleaned Dowman out in the process.\nOne of the other QPR players revelled in the moment — something that’s going to happen. It’s football. Teenage testosterone and all that. Plus, Dowman’s reputation as a rising star precedes him at academy level in particular and that will stir all sorts of emotions in others.\nShirt and shorts covered in mud, Dowman got up, brushed himself down (literally) and didn’t have any issue with the challenge. He seemed less impressed with the reaction elsewhere but dealt with it coolly, calmly waving his finger from a distance a few moments later and saying nothing. Others — and that includes players twice his age — might have been rattled and lost their focus.\nThat wasn’t the case with Dowman, whose talking was done with his boots. He never stopped showing for the ball across 136 minutes of football (it was a long night with extra time) and, not surprisingly, his Arsenal team-mates kept giving it to him.\nWith a little over 20 minutes of normal time remaining and Arsenal trailing 2-1, Dowman pounced on a defensive mistake, dummied to shoot, shifted inside to open up the angle on his left foot and drilled home the equaliser. The outcome felt inevitable from the moment he picked up the ball.\nAn important equaliser from Dowman 🪄#AFCU18 | #FAYouthCup pic.twitter.com/TlEtsTnchu\n— Arsenal Academy (@ArsenalAcademy) January 18, 2025\nHe also delivered an intelligent pass to release Dan Casey in the inside right channel to cross for Arsenal’s third goal on a night when 18-year-old Emmerson Sutton scored an impressive hat-trick for QPR.\nProbably the overriding impression after watching Dowman is how totally at ease he is with a ball at his feet. He never looked remotely flustered in possession, even when taking the ball under pressure deep inside his own half, and those levels of confidence and self-belief manifested themselves in other ways too.\nAdvertisement\nWhen the Arsenal players gathered in a huddle at the end of extra time and their coach Adam Birchall asked who wanted to take a penalty, Dowman’s hand went straight up in the air. Arsenal missed their first spot kick but Dowman scored their second and, following some heroics from their goalkeeper Jack Porter, they triumphed to set up a fifth-round tie against Fulham.\nAfter celebrating with his team-mates at the final whistle, Dowman climbed over the seats in the stand to embrace his family and friends. He was still wearing full kit, including the No 7 shirt that most people in the stadium — not just the children who wanted to take home a souvenir — had their eyes on all night.\n(Alex Burstow/Arsenal FC via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/5991727/2024/12/20/goalkeeper-pass-danger-football-analysis/",
      "text": "A sharp, anxious intake of breath, followed by a round of applause that carries a mixture of quiet admiration and, more than anything, relief. On other occasions, it ends with supporters shaking their heads and asking why.\nWe are talking about the crowd reaction to — and I’m borrowing this description from a colleague who is a regular at Stamford Bridge — “the most dangerous pass in football”.\nAdvertisement\nIt’s the short, vertical ball from the goalkeeper to — typically, but not always — the midfield pivot, who is receiving under pressure, back to goal and close to their own penalty area.\nExhibit A: Chelsea’s Robert Sanchez trying, and failing, to pass to Moises Caicedo against Brighton earlier this season, when Carlos Baleba scored.\nWhat a season Carlos is having! 🔥 pic.twitter.com/D7qC37kvwb\n— Brighton & Hove Albion (@OfficialBHAFC) September 29, 2024\nIt was a case of role reversal for Baleba against Fulham when Alex Iwobi profited from a stray pass from the Brighton goalkeeper Bart Verbruggen.\nForcing the error. 👊 pic.twitter.com/g0Jmd2O2LN\n— Fulham Football Club (@FulhamFC) December 6, 2024\nAs for Chelsea, they got their own back at Southampton, where Noni Madueke read Joe Lumley’s pass (35 seconds onwards in the clip below) to Kyle Walker-Peters and set up Christopher Nkunku for their second goal.\nTune into all of Wednesday night's action. 📺#CFC | #SOUCHE pic.twitter.com/zY3em5RMBA\n— Chelsea FC (@ChelseaFC) December 5, 2024\nFulham? It’s a minor miracle they didn’t concede against Newcastle when Bernd Leno signposted a pass to Emile Smith Rowe and Newcastle’s players were left shaking their heads in disbelief after Fabian Schar somehow failed to score.\nBrentford had a reprieve against Ipswich, who were perilously close to serving a goal up on a plate to West Ham in October. A VAR offside call rescued Tottenham Hotspur’s Fraser Forster at Bournemouth, whose goalkeeper, Kepa Arrizabalaga, was lucky that Gabriel Martinelli didn’t punish him for a loose straight ball against Arsenal, which is where Mads Hermansen passed Leicester and Harry Winks into trouble (see below) in September.\nAs for Manchester United, the awful goal they conceded against Viktoria Plzen in the Europa League last week was yet another example.\nThe list goes on and on and, in many ways, provides fuel for those who wonder why so many teams continue to take such chances playing out from the back and in particular by using this type of pass.\nThere are probably a few ways to answer that question. The first thing to say is that, on a broader level, the coaches that play this way believe it makes far more sense to attack in a controlled way, in possession, through a mix of established principles and rehearsed movement patterns, even if that leads to the odd mistake, rather than tossing a coin and hoping it lands heads up — which is how they view knocking longer balls forward.\nAdvertisement\nThe second point — and this shines through when you discuss some of the incidents highlighted above with coaches who are proponents of this style of play – is that the execution of that bounce pass close to goal, taking in the decision-making around it, the positioning, and the movement and the timing, is the problem when it goes wrong, not the pass itself.\nThird, it’s inevitable that the moments when it breaks down will get far more attention than the good passages of play.\nBefore we look at some more examples, it’s worth pointing out that some Premier League clubs — or maybe that should be ‘some Premier League managers and goalkeepers’ — have little or no inclination to play this game of risk and reward. The goalkeepers at Bournemouth (Arrizabalaga went off-piste against Arsenal), Crystal Palace, Everton, Newcastle United and Nottingham Forest in particular tend to play short sideways passes in build-up or go long.\nIn fact, even when the No 6 drops deep to receive a vertical ball in space with no sign of any pressure, the pass is often turned down by their goalkeepers. Below is Nottingham Forest’s Danilo, arms outstretched, asking for a ball he was never going to receive from the goalkeeper, Matz Sels.\nNewcastle’s Nick Pope does the same (Bruno Guimaraes is pointing out that Sandro Tonali is free below)…\n… as does Everton’s Jordan Pickford.\nThat said, Pickford bizarrely deviated from the script at Arsenal on Saturday. What followed was a car-crash moment between him and James Tarkowski, as the Everton goalkeeper bobbled a pass that the centre-back struggled to control, encouraging Martinelli to press. The expressions on the faces of the two Everton players afterwards said it all.\nTime to look at some passages of play that show the reward and not just the risk, beginning with Arsenal’s 1-1 draw at Chelsea in November.\nDeclan Rice is the player to watch here. He takes up a starting position behind Nicolas Jackson, on the opposite side to the free man (William Saliba) he wants to find after Arsenal have provoked Chelsea’s press with a short goal kick.\nCole Palmer makes the standard run (curved) for any player leading the press in this situation, attempting to force the ball one way. Jackson, meanwhile, is ready to jump to Gabriel if David Raya returns the pass.\nTiming and understanding are absolutely key to what happens next. Rice waits until Palmer gets closer to Raya and then runs on the blind side of Jackson to receive a soft pass in front of him that…\n… he can play first time to Saliba, and Arsenal are out.\nIt is a pattern you will see again and again at Arsenal and elsewhere.\nBelow is an example of Ryan Gravenberch doing the same thing for Liverpool on the opening day at Ipswich.\nGravenberch is an interesting player to watch when receiving straight passes because of his exceptional ability to take the ball under pressure on the half-turn. In the image below, Chelsea’s Romeo Lavia is pressing him.\nBut Caoimhin Kelleher’s pass is ‘safe side’ (away from where Lavia is approaching), and Gravenberch is a master of getting his body between the opponent and the ball to protect and turn in one motion.\nNot only are Arsenal and Liverpool retaining possession in these images, but they’re also taking opposition players out of the game while building an attack.\nTake a look at this example of Manchester City playing out against Liverpool at Anfield at the start of December. The image that starts this phase of play is remarkable and, in many ways, captures the modern game: Ruben Dias is playing one-versus-one against Luis Diaz, 10 yards out, with nobody in goal (Stefan Ortega is on the corner of the six-yard box, out of picture).\nAs soon as Dias passes to Ortega, Manuel Akanji knows he has to connect with the City goalkeeper. Cody Gakpo, circled on the left, is already anticipating the pattern and preparing to press Dias.\nThe natural thing for Akanji to do — and what happens 99 times out of 100 — would be to pass to Dias.\nIndeed, Mario Lemina did exactly that against Liverpool in September. Salah read him like a book but, uncharacteristically for him, shot wide of an open goal.\nAkanji, however, scanned prior to receiving from Ortega and, aided by Dias also pointing where to play next, recognised both the need and the opportunity for a different (and much more progressive) pass to Kyle Walker.\nAs the City right-back travels forward, a line of four Liverpool players are out of the game.\nBut that’s Arsenal, Liverpool and Manchester City, I hear you say. What about clubs outside the traditional ‘Big Six’?\nBrentford are a fascinating case study, in part because of their evolution under Thomas Frank. The percentage of long passes from their goalkeepers has dropped by a third in less than two years. Furthermore, the bounce pass to play out has been used frequently this season and with the exception of a mix-up against Ipswich that went unpunished and a slightly nervy moment in the first half against Chelsea on Sunday, it has worked extremely well.\nThe example below is from Brentford’s game against Villa and starts with Ethan Pinnock passing a goal kick to Mark Flekken. Vitaly Janelt’s clean technique and game intelligence really stand out in these scenarios.\nIn the image below, Janelt has his right hand outstretched, preaching calm and telling Flekken to wait as Ollie Watkins starts to make that familiar curved run. Clearly, this passage of play asks a lot of Flekken — or any goalkeeper. It’s not just about being good with their feet; they need to be calm, trust their team-mates, and make smart decisions in response to the opposition press.\nWhen Watkins gets closer, Janelt makes his move, arriving at pace and running off the back of John McGinn, who has his eyes on Flekken and Pinnock.\nYouri Tielemans leaves Yehor Yarmoliuk and jumps, along with McGinn, to press Janelt. But the Brentford midfielder and Flekken have worked it perfectly and Nathan Collins is ‘out’.\nThree Villa players have been bypassed as Collins drives forward and…\n… a few seconds later, Yoane Wissa has the ball inside the Villa half and Brentford have a four-versus-four attack.\nThe instinct is to say that the passages of play highlighted above look relatively straightforward. In reality, they require hours and hours of practice on the training ground as well as players who have both the technical ability and the mental fortitude to handle the ball in these situations and deal with the crowd anxiety. Indeed, that leads into a question that football fans will often ask about their team: are our players good enough to play this way?\nAdvertisement\nLet’s analyse some clips of where it goes wrong.\nThe clip below is from Manchester United’s game against Tottenham in September. Diogo Dalot, playing the role of auxiliary No 6, receives a straight pass from Onana with his back to goal. Both United centre-backs — Matthijs de Ligt and Lisandro Martinez — are higher than you would expect in this scenario.\nNormally, the pass made from the player occupying Dalot’s position here would be first time and with the left foot given where Dejan Kulusevski is pressing. But Dalot takes a touch to control with his right foot…\n… turns his whole body around and passes with his right foot, too, allowing Kulusevski to get close to blocking. That extra touch also means Brennan Johnson is able to press Martinez easier (admittedly, Martinez’s lack of depth doesn’t help).\nPanicked, Martinez blindly helps the ball on…\n… and Pedro Porro is now on the attack for Spurs.\nSome coaches are a lot more detailed with their messages than others. They will talk, for example, about the importance of goalkeepers receiving the ball in a neutral position, so that the opponent leading the press doesn’t know which side to jump and also discourage goalkeepers from making sweeping actions with their passes (picture that awkward Pickford ball to Tarkowski at Arsenal) to prevent the ball arriving with a bounce or with spin on it.\nIn other words, completing a pass to a team-mate isn’t enough when playing out against a press; it’s about giving the player receiving the ball the best possible opportunity of making their next action perfect — after all, multiple passes will often be required. It’s interesting to hear Liverpool players talking about how their manager, Arne Slot, has stopped training sessions because passes have not been played to the back foot of the receiver.\nAdvertisement\nThe problem with one sloppy pass is that it often leads to another. In the next photo, the Ipswich goalkeeper, Arijanet Muric, plays a ball around Tottenham’s Dominic Solanke using the outside of his right foot. It’s high risk and comes off, but the pass isn’t easy for Sam Morsy to play first time and that contributes to the next pass being untidy…\n… which ends up with Dara O’Shea jumping to try to get the ball under control and encouraging Spurs to press even more.\nIpswich are committed to playing out from the back under Kieran McKenna and their build-up involves a lot of straight passes that they generally execute well — the montage below is from Saturday’s game at Wolves.\nMcKenna — and this feels important for any coach who wants to play this way — took time to explain his philosophy to the Ipswich fans to try to manage the apprehension that often builds in stadiums during these phases of play.\nAway from home can be more challenging, though, and rival supporters will revel in the sort of moment that Ipswich endured at West Ham earlier in the season.\nThe first thing that jumps out when you watch the passage below is the setup. As well as being very close to the penalty area, both of Ipswich’s defensive midfielders, Morsy and Kalvin Phillips, are marked from behind before the goal kick and that feels like a red flag.\nMorsy is unable to arrive at speed or on the blind side of an opponent. As for Phillips, he makes the penalty area more crowded by dropping inside and bringing Lucas Paqueta with him.\nIn fact, Phillips almost gets in the way of Morsy’s pass…\n… which ends up at the feet of Paqueta.\nAmid a scene of chaos in the Ipswich penalty area, O’Shea clears off the line.\nOn the subject of overcrowding, there were 14 players (8 v 6) in a tight space when Southampton tried to play out against Villa this month (see the image below). Southampton survived this one, but they conceded against Liverpool in a not-dissimilar fashion and there was the Chelsea goal, too.\nWatching Southampton this season, it was hard to avoid the conclusion that neither Lumley nor Alex McCarthy, both of whom deputised for the injured Aaron Ramsdale, were equipped to play Russell Martin’s brand of football at this level — and maybe they weren’t alone.\nClearly, there are times when the straight pass isn’t on and the goalkeeper needs to adopt a more pragmatic approach. Fulham’s Sander Berge is pictured below signalling to Leno that he should miss him out and go over the top of Brighton’s aggressive press.\nGetting caught in two minds is probably the worst position for a goalkeeper to be in and that’s what happened to Tottenham’s Guglielmo Vicario against Brentford (below). It’s almost as if Vicario is so programmed to play that straight pass (it’s central to the way Spurs build up under their manager Ange Postecoglou) that he doesn’t recognise an alternative. Fabio Carvalho capitalised on Vicario’s indecision but, to the Spurs goalkeeper’s credit, he recovered and denied Bryan Mbeumo moments later.\nBoth Vicario and Forster, his deputy, have had their share of close shaves this season, most recently at Bournemouth a couple of weeks ago, where Kulusevski felt like a sitting duck for Tyler Adams when the straight pass arrived.\nOn Sunday, against Southampton, Spurs were at it again right from the kick-off.\nFour passes later, James Maddison was running through on goal and putting his team 1-0 up.\nThe risk, Postecoglou and others will argue, is worth the reward.\n(Top photos: Getty Images; design: Meech Robinson)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6556954/2025/08/23/max-dowman-arsenal-age-first-team/",
      "text": "Follow live updates of Arsenal vs Leeds United on The Athletic\nMax Dowman, the 15-year-old midfielder, made his Arsenal first team debut in a 5-0 win against Leeds United on Saturday.\nDowman is now the second-youngest player ever to appear for Arsenal. His team-mate Ethan Nwaneri holds the club and Premier League record having made his first appearance aged 15 years, five months and 28 days in a match against Brentford in September 2022.\nAdvertisement\nMikel Arteta named the England youth international on the bench for the game after a swift rise through the academy age group sides in north London and replaced Noni Madueke in the 64th minute.\nThis follow’s Dowman’s first senior appearance during the club’s preseason in Singapore, coming off the bench against Milan in July. He later caught the eye against Premier League opposition in Newcastle United four days later, winning a penalty in another substitute appearance.\nHe travelled with the squad for last weekend’s opening game against Manchester United at Old Trafford but did not make the final 20. Saturday’s game marked the first time he was included in a senior matchday squad for a competitive fixture.\nDowman’s development is being carefully managed by the club and coaching staff, but after consistently impressing in training with the first-team through last season and in recent months he made his latest step up on Saturday.\nPremier League rules allow a 15-year-old to play so long as they are 15 by August 31 of the campaign in question. Dowman therefore wasn’t eligible to feature last season.\nLast September, Dowman — who turned 15 in December — became the youngest player ever to score in a UEFA Youth League game when he scored in a 4-1 defeat to Atalanta.\nThe midfielder made his debut for Arsenal’s under-18 team in September 2023, aged 13, and played a number of league matches at that level in 2024-25 alongside several appearances in the UEFA Youth League.\nAsked during pre-season what the plan for the teenager would be this term, Arteta said: “We don’t know with all the young kids. At the end they are in and around the team constantly and they getting used to the dynamics and the demands.\n“And especially raising the physical levels because the demands they need to perform and impact at the level is really high physical standards. They are getting there and that gives them a good platform and they will have to earn it.”\nAdvertisement\nWas Dowman’s inclusion a surprise?\nBy The Athletic’s Arsenal Writer Art de Roche\nDespite his age, Dowman’s involvement in a Premier League matchday is not a total shock.\nMikel Arteta had been vocal about the 15-year-old in press conferences before last season had even finished.\nThe England Under-17 international was expected to feature in pre-season, and his ability to replicate his exploits from youth football against Premier League players was outstanding.\nHe was not just impressing in flashes, but actually impacting games by winning penalties against Newcastle United and Villarreal. Care will be needed around his development, but today shows the trust manager Mikel Arteta has in his ability.\nHow did Dowman play?\nAnalysis from football news writer Dan Sheldon\nMax Dowman became the second youngest-ever player to feature for Arsenal when he was introduced in the second half — but he looked like he had been playing in the Premier League for years, such was the assured nature of his 25-minute cameo.\nDowman played on the right flank and had his first look at goal in the 75th minute, bringing down a long diagonal ball with the outside of his left boot, before cutting in and getting a shot away.\nYes, it sailed over the bar, but the initial touch and confidence to drive forward and take on the Leeds defence is exactly why he is causing so much excitement.\nThere was another run a few minutes later, this time beating Gabriel Gudmundsson, only for Dowman to then be pulled down, prompting the Arsenal supporters to sing ‘Super Max Dowman’ in unison. It felt like the Arsenal crowd — and Dowman’s team-mates — were desperate for him to score.\nIt was turning into the Dowman show, with the teenager’s volley from the resulting free-kick zipping wide of the post. He won a penalty in added-time, skipping past Leeds defenders before he was brought down by Anton Stach.\nPoignantly, Arsenal ended the match with three Hale End graduates — Dowman, Nwaneri and Myles Lewis-Skelly — on the pitch, with all three showing plenty of signs that they will be mainstays in this Arsenal team for years to come.\n(David Price/Arsenal FC via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6564448/2025/08/23/manchester-city-0-tottenham-2-guardiola-frank-trafford-palhinha/",
      "text": "Tottenham Hotspur really love their trips to the Etihad Stadium.\nHaving won 4-0 there last season under Ange Postecoglou, Spurs pressed City high up the pitch under the instruction of Thomas Frank this time around — and it worked perfectly. Goals from Brennan Johnson and Joao Palhinha did the damage to make it three wins in their last five trips.\nAdvertisement\nCity lost left-back Rayan Ait-Nouri after 23 minutes to an ankle injury, with Nathan Ake replacing him. And it got worse for the home team 10 minutes before the break when Richarlison beat the tightest of offside calls to play in Johnson to fire beyond James Trafford — the goal given after a VAR check.\nThat was nothing compared to what happened in added time in the first period. Trafford had been fortunate when he escaped being penalised after a challenge on Mohammed Kudus, but when he attempted a pass to Nico Gonzalez in the area, it was intercepted by Pape Matar Sarr, and Palhinha rammed it home for his first Spurs goal.\nRodri returned for City after the break but Spurs were good value to continue Frank’s stunning start as Spurs head coach. (Eberechi who?)\nThe Athletic’s Jordan Campbell and Elias Burke analyse the action.\nWhat was James Trafford doing?\nGuardiola stuck with Trafford after handing him his debut last weekend in the routine win over Wolverhampton Wanderers but he was involved in a calamitous mix-up with Gonzalez to hand Spurs a second goal.\nTrafford was put under pressure regularly by Spurs, but in first half added time, he panicked. Rather than go long to Erling Haaland, as City had opted to at times, he played a straight pass to Gonzales inside his own penalty area.\nSpurs had set the trap, though and Sarr was ready to pounce. He stepped in to intercept and Palinha converted.\nOh my 🙈\nA costly City mistake is capitalised on by Palhinha!@tntsports & @discoveryplusUK pic.twitter.com/HPkufm9Gyn\n— Football on TNT Sports (@footballontnt) August 23, 2025\nAnd for U.S. readers\nDISASTER FOR MAN CITY. Spurs take a 2-0 lead. 😳 pic.twitter.com/0WyGTsJMhU\n— NBC Sports Soccer (@NBCSportsSoccer) August 23, 2025\nRuben Dias reacted angrily and Trafford looked to the sky for a moment. It was a tough moment for the 22-year-old in only his second start since returning to the club in a £27million deal from Burnley.\nEderson, who is the subject of interest from Galatasaray, watched on from the bench. It was just over a week ago that Guardiola stated he would start the season as his No 1 but the speculation has led to that spot being up in the air.\nAdvertisement\nTrafford would have hoped to use this window of opportunity to stake his claim, but this was a costly error that would not have done him any favours.\nJordan Campbell\nSpurs: Organised, aggressive, effective\nTottenham’s failed pursuits of Eberechi Eze and Morgan Gibbs-White have left Frank without a natural No 10 in the absence of Dejan Kulusevski and James Maddison, who are out with long-term knee injuries. But as Spurs proved in the first half, sometimes an aggressive, organised press can be as effective as any playmaker.\nFrom the first time Trafford received the ball in open play, it was evident that Frank had directed his players to swarm City’s goalkeeper. The initial demonstration of Spurs’ effective press happened inside the first 10 minutes, with Cristian Romero going man-to-man with Haaland, who had dropped to the edge of the box to receive a pass from City’s defenders.\nAs soon as the pass reached the Norway striker, Romero rushed in from behind and won the ball on the edge of the City box, leading to a Spurs free kick from 20 yards.\nThen, with Spurs already 1-0 up through Johnson, they doubled their lead as Sarr took advantage of a careless pass from Trafford to win the ball in the City box.\nPalhinha, on his first Premier League start for Spurs, then calmly converted from close range.\nElias Burke\nHow good a signing will Palhinha prove?\nFor long periods of last season, Tottenham were arguably the easiest team to counter-attack in the Premier League. Postecoglou tried (and failed) to find a combination at the base of his midfield to provide the protection he needed to play his attacking style, and Spurs invariably suffered as a result.\nIf this performance was anything to go by, Frank has found the answer in Palhinha, who has signed on loan for the season from Bayern Munich.\nAdvertisement\nIn the first half, Frank tasked Palhinha with marking Rayan Cherki out of the game, and the Portugal international thrived under the assignment. By the time Pep Guardiola had taken Cherki off on the 54th minute, he had been dispossessed twice and failed to make a meaningful impact on the game.\nMinutes later, it was Palhinha’s tough tackle on Cherki’s replacement, Bernardo Silva, that set Spurs off on a threatening counter-attack that could have put Spurs three in front had Johnson’s touch been better.\nPalhinha’s Spurs league debut may be remembered for his goal, but it is his steel and bite in midfield, combined with an underrated ability on the ball, that will make him essential to their success this season.\nElias Burke\nWas City’s rotation really needed?\nIt was a common sight in the first half to see Guardiola shaking his head on the touchline as another attempt at building up possession went awry.\nCity never looked fully confident under pressure, with Rico Lewis and Gonzalez both giving the ball away too often. Guardiola made two changes from the team that beat Wolves, bringing in Omar Marmoush and Cherki for Bernardo Silva and Jeremy Doku, but City badly lacked cohesion in the final third.\nMarmoush, whose primary position at Eintracht Frankfurt was through the centre, looked awkward at times receiving out wide, while Cherki barely linked with Haaland, if at all.\nGuardiola has spoken about playing more direct this season, perhaps an influence of his new assistant Pep Lijnders, but what replaced control was frantic rather than precision.\nChanging the profile of attacking players so drastically means City did not have the luxury of consistency, but this is what having such a deep squad necessitates. Rotation has been key to his previous title-winning teams, but the squad size right now is so big and so diverse in skill set.\nAdvertisement\nIn attempting to keep everyone happy, Guardiola has to ensure he does not sacrifice consistency and fluidity.\nJordan Campbell\nWhat did Guardiola say?\n“I have a feeling the performance was a little bit better than the result. We started well but conceded a goal that can happen and missed some simple things with the ball and after they scored the second goal it was difficult.\n“I decided to continue with James (Trafford) after he made a good first game. When I take decisions in the first part of the season, for all the players you play one or two everyone thinks, ‘OK this is the starting line up’…it was just today I decided that.\n“The game against Spurs this season is man marking, like Brentford, you have to play in a different way. We missed the simple things. The effort and running is extraordinary and I have no doubts about that. It’s been really good. But we missed the simple things. We created chances, we created enough. It happened, it’s football. It’s just the second game. The last game vs Wolves everyone said everything was fine but I said it’d just the first game and it’s the same now.\n“We have to improve. Step by step until we make it click and the good connections… we have seven days rest and then Brighton.”\nWhat did Frank say?\n“Very delighted. Extremely proud of the players performance, it was an exceptionally good performance. We know it’s always difficult to play against city. Here at the Etihad, even more difficult. The first 35 minutes, I thought, was fairly even, but with City on top.\n“It was a big mentality shift in terms of staying in the game and keep doing what we wanted to do, scoring a great goal. Maybe they changed a little bit of momentum, but we definitely stayed on top for 2-0.\n“Second half, we were very good. And the big spell where we could think that they would put pressure on us, we were very aggressive in the high pressure. I thought that we were very front footed, with the mindset to constantly go for third goal.\nAdvertisement\n“I must say that the clean sheet makes me very happy. It’s a big thing we’ve been working on. Not on clean sheets, that’s easier said than done, but on the defensive side of the game. High pressure, middle block, low block, defend the box mentality, blocking shots. Everything. Because if you get clean sheets you’re closer to winning a game.”\nWhat next for City?\nSunday, August 31: Brighton (Away), Premier League, 2pm UK, 9am ET\nWhat next for Spurs?\nSaturday, August 30: Bournemouth (Home), Premier League, 3pm UK, 10am ET\n(Top photo: Palhinha celebrates after making it 2-0. Clive Mason/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6564479/2025/08/24/fulham-1-manchester-united-1-briefing/",
      "text": "Two games into the Premier League season and Manchester United remain winless despite promising performances.\nAt Craven Cottage, usually a happy hunting ground for the visitors, substitute Emile Smith Rowe denied Ruben Amorim’s men three points with an equaliser in a hard-fought 1-1 draw.\nRodrigo Muniz scored an unfortunate own goal to give United the lead, as a Leny Yoro header from a Bryan Mbeumo corner deflected in off the striker in the 58th minute. The goal spared Bruno Fernandes’ blushes after the United captain had wildly missed a first-half penalty.\nAdvertisement\nBut with his first touch, Smith Rowe came off the bench to brilliantly guide Alex Iwobi’s fine cross home. It was a deserved goal for a Fulham team that finished the stronger of the two as Marco Silva’s substitutions made an impact.\nCarl Anka and Mark Carey analyse the action.\nHow did Fernandes miss his penalty so badly?\nUnited moved the ball sharply, working it quickly into the channels where one of Mason Mount, Matheus Cunha or Mbeumo was able to make it stick. All that was missing was the opening goal.\nThat breakthrough seemed a matter of routine in the 33rd minute when referee Chris Kavanagh was called over to the pitchside monitor to review some agricultural defending on a Fernandes corner. Replays showed Calvin Bassey throwing Mount to the ground before the corner was delivered and the penalty was consequently awarded. Luke Shaw was also grappling with Muniz in the box, but the VAR was not reviewing that.\nFernandes went for a stutter-step run-up, but did not use his usual hop before striking the ball, opting for a powerful effort aimed for the top left corner. He struck the ball while leaning back, an unusual error from the typically reliable penalty-taker.\nThe United captain’s regular routine appeared to be disrupted by the presence of the referee, who was in proximity to Fernandes before the midfielder started his run-up.\nThe referee’s attempt to walk around the player during his run-up saw Fernandes inadvertently back into him. Fernandes was visibly frustrated, and it may have thrown him from his usual rhythm, but it was nonetheless a bad miss.\nSpeaking to NBC, Fernandes said: “Like everyone, you have your own routine. I was preparing myself to get the penalty and that got a little bit on my nerves. But it is not because of that that I missed the penalty. I missed the penalty because I kicked very badly the ball. I took it too under and the ball ended up going over the bar.”\nCarl Anka\nMount gives Amorim a good problem to have\nIt is widely discussed that Mason Mount is a player every manager loves.\nHis ability to stitch together attacks and provide disciplined defensive displays was on show last week against Arsenal, and the same was true against Fulham. Beyond his positive performances in the short term, it prompts an important, wider question for the season: which of United’s new attacking signings is going to miss out as a consequence?\nFor now, Benjamin Sesko needs more time to get up to speed with his new squad, so two consecutive games starting on the bench are to be expected. However, the calls for Sesko, Mbeumo and Cunha to start together will be just around the corner, with fans likely to be clamouring to see their shiny new upgrades on the field at the same time.\nAdvertisement\nThe balance Mount offers to the team cannot be denied. Particularly accounting for Amorim’s 3-4-2-1 system, there were times last season when the midfield duo looked dangerously overrun with the spaces far too wide to cover defensively. With Mount in the side, Amorim has a player who is comfortable tucking in to plug gaps out of possession, while still offering the technical quality to progress United up the field when his side are on the attack.\nIt is a good problem for Amorim to have, but with no European football this season, it will be harder to keep all of his star players happy all at once if Mount continues his strong start to the season.\nMark Carey\nSilva’s case for new signings strengthened\nWith Fulham looking rather blunt in attack after the hour mark, Marco Silva looked to his bench. The arrival of Harry Wilson and Antonee Robinson was soon followed by Smith Rowe and Raul Jimenez — all of whom injected energy into the home side that led to Smith Rowe’s excellent equaliser, meeting Iwobi’s cross with a well-timed finish.\nSmith Rowe showed his eye for a late run into the box multiple times last season, knowing that his team-mates rarely need a second invitation to cross the ball. For context, no side averaged more than Fulham’s 17.6 open-play crosses per 90 last season.\nIt would be crass to suggest that Silva would be happy that Fulham are still chasing their first victory of the season, but with the transfer window still open, it might strengthen his case that his side still needs reinforcements after a quiet summer of incomings.\n“At this stage of last season, we had two/three players in,” Silva said at his press conference on Friday. “This season, we had a plan; the plan has fallen through. It’s our fault, not active at all. We cannot be pleased.”\nOn the one hand, there is plenty to be said about having a settled side going into a new season. Silva is excellent at managing his squad and making impactful substitutions, with 19 of Fulham’s goals being scored by players from off the bench since the start of last season.\nAdvertisement\nOn the other hand, new signings can provide added freshness, competition for places, and greater quality as Silva looks to build on last season. Depending on Fulham’s output this campaign, you can duly pick your narrative accordingly.\nMark Carey\nSesko will need time to acclimatise\nThe 53rd minute saw Amorim shake things up. Off came Casemiro and Amad to be replaced by Sesko and Diogo Dalot. That led to Mount dropping into the central midfield pivot, while Dalot offered some defensive security at right wing-back.\nBut Sesko, unfortunately, didn’t get many shooting opportunities, finishing the game with 15 touches and zero shots. Marco Silva’s decision to match United’s 3-4-2-1 in phases meant the 22-year-old was unable to go hunting in the right half-space, as he did last week in the 1-0 loss against Arsenal. Instead, Sesko spent much of his appearance standing between Joachim Andersen and Bassey, trying to peel off Andersen and attack Bassey’s blind side when the ball was funnelled out wide.\nFulham’s touch-tight approach when defending Mbeumo (he only had six touches of the ball between the 45th and 70th minutes) limited the creative supply to the striker. In the final 10 minutes, Sesko tried his best with the limited chances his team manufactured. But while the away section chanted “Attack, attack, attack attack attack!”, United’s players struggled to get the ball into the final third.\nWhen out of possession, Sesko could be found checking his shoulders to see if Cunha and Mbeumo would join his attempts to press. Amorim’s new front three have plenty of running power and technical trickery, but they will need time to synchronise. Two games in, and we’ve barely scratched the surface of Sesko’s talents.\nCarl Anka\nWhat did Amorim say?\n“It was a tough match. I think when we scored the goal we forget about maintaining the way we should play — we were just thinking about maintaining the result,” he told reporters.\n“We want to win so bad we forget about maintaining possession, push the opponent, we just gave a little bit of the game to Fulham. We started really well, until the goal I think we were a good team. We can do better. After the goal, I think we were just thinking about maintaining the advantage. We cannot do that.\n“We are going to score goals because we are creating so many chances and that is the important thing. Then we just have to move on.”\nWhat did Silva say?\n“The players that came on were brilliant,” said Silva, per Fulham’s official website. “Last week was the same and last season it was the story of the season.\n“Harry Wilson had a great pre-season and today he started on the bench, but a massive impact from him. Raul started last week and, of course, Emile, helped the team last week with the build-up for the goal and this afternoon he scored. He knows he’s important for us and he can arrive in the right spots.\nAdvertisement\n“They started better, but from 20 minutes we controlled really well. We didn’t give many spaces to them and they only created moments from set pieces. They scored, but it was a great reaction from the boys in a difficult moment of the game. We finished the game stronger, in and around their box with some good moments. I’m proud of the fans and the way they were with the team right until the end.”\nWhat next for United?\nWednesday, August 27: Grimsby (Away), Carabao Cup second round, 8pm UK, 3pm ET\nWhat next for Fulham?\nWednesday, August 27: Bristol City (Away), Carabao Cup second round, 7.45pm UK, 2.45pm ET\n(Top photo: Mike Hewitt/Getty Images)"
    }
  ],
  "argos_summary": "The article reviews the latest Premier League highlights, noting the enduring record of the youngest goalscorer and spotlighting 15‑year‑old Max Dowman’s rapid rise to Arsenal’s first team. It discusses tactical trends such as the risky ‘bounce pass’ that can create or break games, and the referees’ increased scrutiny of rugby‑style tackles at set pieces. The piece also covers recent match outcomes, including Tottenham’s win over Manchester City, Manchester United’s struggles, and the broader context of club strategies and player development. Overall, it paints a picture of a season where youth talent, tactical risk, and regulatory changes intersect to shape the English football landscape.",
  "argos_id": "MMDUS416B"
}