{
  "url": "https://finance.yahoo.com/news/india-ac-maker-blue-star-023333677.html?_guc_consent_skip=1756089624",
  "authorsByline": "Praveen Paramasivam",
  "articleId": "b1cf053649e645d3a6742f1a92a58bf7",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/cv/apiv2/cv/apiv2/social/images/yahoo-finance-default-logo.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T02:33:33+00:00",
  "addDate": "2025-08-25T02:41:32.550327+00:00",
  "refreshDate": "2025-08-25T02:41:32.550330+00:00",
  "score": 1.0,
  "title": "India AC maker Blue Star expects sales bump from Modi tax cuts, executive says",
  "description": "(Reuters) -India's Blue Star expects its room air conditioner sales to beat the company's previous forecast this financial year, thanks to new government plans to slash consumption taxes, a top executive said.  In the nation's biggest tax overhaul since 2017, Prime Minister Narendra Modi this month announced plans to cut taxes on the purchase of everyday goods and appliances from October, a move aimed at boosting consumption in the world's most populous nation as trade tensions with the U.S. grow.  Blue Star, which had forecast growth of 10% to 15% in room AC sales volumes for the year to March, now expects an increase of up to 20% in India's price-sensitive market, Managing Director B. Thiagarajan told Reuters on Friday.",
  "content": "(Reuters) -India's Blue Star expects its room air conditioner sales to beat the company's previous forecast this financial year, thanks to new government plans to slash consumption taxes, a top executive said.\n\nIn the nation's biggest tax overhaul since 2017, Prime Minister Narendra Modi this month announced plans to cut taxes on the purchase of everyday goods and appliances from October, a move aimed at boosting consumption in the world's most populous nation as trade tensions with the U.S. grow.\n\nBlue Star, which had forecast growth of 10% to 15% in room AC sales volumes for the year to March, now expects an increase of up to 20% in India's price-sensitive market, Managing Director B. Thiagarajan told Reuters on Friday.\n\nThe eventual tax rate on ACs is not clear but it is now at the maximum 28%, so the planned cut should help dealers and manufacturers, who have struggled this year due to a cooler summer.\n\n\"From 28% for ... air conditioner to (potentially) 18% is something which nobody would have dreamt of,\" Thiagarajan said by phone. \"Now this is an extraordinary step, and it will boost demand especially in a year where summer season has failed.\"\n\nBlue Star's unitary products business, which sells room ACs and commercial refrigeration systems, made up nearly half its revenue of 119.77 billion rupees ($1.37 billion) last year, when it commanded a market share of close to 14% in room ACs.\n\nBut there is going to be short-term pain for Blue Star and the $4 billion sector that also includes Tata Group's Voltas and Japan's Daikin, as consumers postpone AC purchases until the tax cuts take effect.\n\nIndustry watchers say electronics retailers could experience slow sales in the run-up to the Hindu festival of Deepavali in October, by which time Modi said the cuts would take effect.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "India AC maker Blue Star",
      "weight": 0.100159355
    },
    {
      "name": "room AC sales volumes",
      "weight": 0.09936929
    },
    {
      "name": "Modi tax cuts",
      "weight": 0.097869195
    },
    {
      "name": "Blue Star",
      "weight": 0.095455
    },
    {
      "name": "room ACs",
      "weight": 0.08965917
    },
    {
      "name": "last year",
      "weight": 0.085637644
    },
    {
      "name": "slow sales",
      "weight": 0.07661376
    },
    {
      "name": "sales bump",
      "weight": 0.07525096
    },
    {
      "name": "Prime Minister Narendra Modi",
      "weight": 0.07409026
    },
    {
      "name": "consumption taxes",
      "weight": 0.07123526
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Other",
      "score": 0.97412109375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.93115234375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.93017578125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.53369140625
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.413330078125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.38037109375
    }
  ],
  "sentiment": {
    "positive": 0.26583737,
    "negative": 0.3793099,
    "neutral": 0.35485283
  },
  "summary": "India's Blue Star expects its room air conditioner sales to exceed its previous forecast due to plans for reduced consumption taxes by up to 20%. The move is part of Prime Minister Narendra Modi's biggest tax overhaul since 2017 aimed at boosting consumption in the country. The eventual tax rate on ACs is currently at the maximum 28%, so this reduction should benefit dealers and manufacturers. However, there may be short-term pain for the sector, as consumers may postpone AC purchases until the tax cuts take effect.",
  "shortSummary": "Blue Star expects a 20% sales increase due to government tax cuts, which will reduce consumption by October, despite short-term pain for some retailers.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "be15dee02e424dccae9f7a81af80a7eb",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "India's Blue Star expects room air conditioner sales to exceed its previous forecast this financial year, citing new government plans to slash consumption taxes on appliances. The company had projected 10‑15% growth but now anticipates up to 20% volume increase as the tax rate on ACs could fall from 28% to around 18%. While the tax cut should boost demand in a market hit by a cooler summer, consumers may delay purchases until the cuts take effect, potentially causing short‑term sales dips for Blue Star and the broader $4 billion AC sector.",
  "argos_id": "MN7WUNXY0"
}