{
  "url": "https://finance.yahoo.com/news/veteran-fund-manager-dumps-microstrategy-231353735.html",
  "authorsByline": "Anushka Basu",
  "articleId": "c799c7ccd43f478b98f1e9afd167e910",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/thestreet_881/81b6927ef8d9aacb23b6023a4c961743",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-19T23:13:53+00:00",
  "addDate": "2025-08-19T23:48:24.020116+00:00",
  "refreshDate": "2025-08-19T23:48:24.020117+00:00",
  "score": 1.0,
  "title": "Veteran fund manager dumps Microstrategy stock over broken word",
  "description": "Josh Mandell exits MSTR, slams Saylor for breaking promises as stock slides 7%.",
  "content": "Strategy Inc. (formerly known as MicroStrategy) isn’t just a tech company anymore — it’s a massive bet on Bitcoin. And it’s one of the loudest on Wall Street.\n\nLed by co-founder and executive chairman Michael Saylor, Strategy holds over 629,000 Bitcoin worth more than $71 billion as of Aug. 19 afternoon.\n\nWith a market cap hovering around $96 billion, the company has become a proxy for Bitcoin exposure, especially after converting itself into what some call a “Bitcoin leverage ETF in disguise.”\n\nBut not everyone is sold on the Strategy.\n\nOn Aug. 19, veteran hedge fund manager and former MicroStrategy investor Josh Mandell announced his complete exit from the stock — and didn’t mince his words.\n\nMandell, who previously held shares in Strategy and disclosed a $2.1 million position in Bitwise’s Bitcoin ETF (BITB), revealed he had liquidated his MSTR holdings after what he described as a breach of trust by Saylor.\n\n“I actually bought above here, and then Saylor sold,” Mandell wrote on X. “He said they wouldn’t ... and then he did.”\n\nAt the heart of Mandell’s frustration is the issue of valuation multiples and shareholder promises.\n\nAccording to Mandell, Saylor had assured investors during a live results announcement that the company would not issue new shares unless the stock was trading at or above 2.5x its modified net asset value (mNAV), which measures the value of Strategy’s Bitcoin holdings versus its market cap.\n\nMSTR's mNAV currently stands at 1.55, down 3.73% in the last 24 hours.\n\nMandell says he relied on that verbal agreement when entering the stock. When the company broke from that guidance and issued stock below the 2.5x threshold, he felt misled.\n\n“A man is only as good as his word,” Mandell wrote. “I will not speak in support of anything that man does again.”\n\nMandell is a veteran hedge fund manager and well-known figure in the traditional finance world, with a background in short-term options trading and fixed-income investments like government bonds.\n\nOver the years, he built a reputation as a sharp market tactician with a particular focus on risk-adjusted returns.\n\nIn his post, Mandell took aim at Strategy’s recent financing structure. He mocked Saylor’s explanation that if the stock dropped too low, the company could pivot to buying back shares instead of issuing preferred stock.\n\n“Preferred shares need money from selling stocks to pay dividends,” Mandell added, suggesting the company is using equity issuance in a way that could harm long-term shareholders.\n\nTo Mandell, the entire approach undermines investor confidence and exposes a lack of discipline in managing shareholder capital.\n\nHis critique echoes broader concerns from other investors about Strategy’s aggressive capital structure — which includes $8.2 billion in debt and $6.3 billion in preferred stock — and its ability to support such leverage if Bitcoin prices weaken further.\n\nShares of MSTR were down 6.93% at $338.38 as of 3:36 p.m. ET, marking one of the biggest single-day drops for the stock in recent weeks. Trading volume was above average, clocking over $4.5 billion on the day.\n\nDespite a 150% gain over the past year, MSTR has declined 18% over the past three months, reflecting growing volatility around the company’s Bitcoin-heavy balance sheet.\n\nThe stock remains far below its 2021 highs, when Bitcoin euphoria pushed it well above $1,000 per share.\n\nMeanwhile, Bitcoin itself is trading at $113,591, down about 2.36% in the past 24 hours.\n\nVeteran fund manager dumps Microstrategy stock over broken word first appeared on TheStreet on Aug 19, 2025\n\nThis story was originally reported by TheStreet on Aug 19, 2025, where it first appeared.",
  "medium": "Article",
  "links": [
    "https://finance.yahoo.com/news/crypto-cryptocurrency-explained-163129889.html",
    "http://roundtable.rtb.io",
    "https://www.thestreet.com",
    "https://finance.yahoo.com/news/wall-street-debates-strategys-bitcoin-190724752.html",
    "https://www.thestreet.com/crypto/markets/strategy-hits-all-time-high-with-bitcoin-ranks-among-top-u-s-firms",
    "https://shopping.yahoo.com/rdlw?merchantId=cbfc0ba8-291b-4c8b-9240-df1b4766f148&siteId=us-y4p&pageId=1p-autolink&contentUuid=6fdd8584-2b08-30e6-b755-e5e1de43788c&featureId=text-link&merchantName=Kraken+Digital+Asset+Exchange&linkText=Bitcoin&custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5rcmFrZW4uY29tL3ByaWNlcy9iaXRjb2luP2NsaWNraWQ9VURGeFZKeWRueHljV3AxVXdUVVVqeUtKVWtwMklCeTR1UTEtemMwJnV0bV9zb3VyY2U9SW1wYWN0JnV0bV9tZWRpdW09QWZmaWxpYXRlJnV0bV9jYW1wYWlnbj02MDYzMzU5JnV0bV9jb250ZW50PWJpdGNvaW4lMjBwcmljZSUyMHBhZ2UmaXJjbGlja2lkPVVERnhWSnlkbnh5Y1dwMVV3VFVVanlLSlVrcDJJQnk0dVExLXpjMCZyZWZfdXJsX2N1c3RvbT0maXJnd2M9MSZtcGlkPTYwNjMzNTkiLCJyZXF1ZXN0SWQiOiJmMTJkNDFmMS0zZjdjLTQ4NDUtOWYwNS02MWYyYTg3MjcwYjEiLCJjb250ZW50VXVpZCI6IjZmZGQ4NTg0LTJiMDgtMzBlNi1iNzU1LWU1ZTFkZTQzNzg4YyIsIm9yaWdpbmFsVXJsIjoiaHR0cHM6Ly93d3cua3Jha2VuLmNvbS9wcmljZXMvYml0Y29pbj9jbGlja2lkPVVERnhWSnlkbnh5Y1dwMVV3VFVVanlLSlVrcDJJQnk0dVExLXpjMCZ1dG1fc291cmNlPUltcGFjdCZ1dG1fbWVkaXVtPUFmZmlsaWF0ZSZ1dG1fY2FtcGFpZ249NjA2MzM1OSZ1dG1fY29udGVudD1iaXRjb2luJTIwcHJpY2UlMjBwYWdlJmlyY2xpY2tpZD1VREZ4Vkp5ZG54eWNXcDFVd1RVVWp5S0pVa3AySUJ5NHVRMS16YzAmcmVmX3VybF9jdXN0b209JmlyZ3djPTEmbXBpZD02MDYzMzU5In0&signature=AQAAAZR2ri8MvSVuXp-ot2ig8ZnSSRNWkTojUrCHQhRIxdBX&gcReferrer=https%3A%2F%2Fwww.kraken.com%2Fprices%2Fbitcoin%3Fclickid%3DUDFxVJydnxycWp1UwTUUjyKJUkp2IBy4uQ1-zc0%26utm_source%3DImpact%26utm_medium%3DAffiliate%26utm_campaign%3D6063359%26utm_content%3Dbitcoin%2520price%2520page%26irclickid%3DUDFxVJydnxycWp1UwTUUjyKJUkp2IBy4uQ1-zc0%26ref_url_custom%3D%26irgwc%3D1%26mpid%3D6063359",
    "https://www.thestreet.com/crypto/markets/veteran-hedge-fund-manager-dumps-popular-tech-stock",
    "https://x.com/JoshMandell6/status/1957794663340953956",
    "https://finance.yahoo.com/news/veteran-hedge-fund-manager-claims-220831312.html",
    "https://finance.yahoo.com/news/microstrategy-earnings-beats-expectations-over-231333038.html",
    "https://roundtable.rtb.io/RTBHOME/josh-mandell-dumped-mstr-saying-saylor-broke-his-word-is-his-criticism-fair",
    "https://finance.yahoo.com/news/microstrategy-dons-orange-drops-micro-184531986.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "preferred stock",
      "weight": 0.09289652
    },
    {
      "name": "Microstrategy stock",
      "weight": 0.09198048
    },
    {
      "name": "stock",
      "weight": 0.089772254
    },
    {
      "name": "stocks",
      "weight": 0.089772254
    },
    {
      "name": "Bitcoin exposure",
      "weight": 0.08081473
    },
    {
      "name": "Bitcoin euphoria",
      "weight": 0.0798792
    },
    {
      "name": "Bitcoin",
      "weight": 0.07976154
    },
    {
      "name": "Bitcoin prices",
      "weight": 0.07934525
    },
    {
      "name": "Josh Mandell",
      "weight": 0.07865162
    },
    {
      "name": "Mandell",
      "weight": 0.077725545
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.90283203125
    },
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.705078125
    },
    {
      "name": "/Finance/Investing/Funds",
      "score": 0.6748046875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.48388671875
    }
  ],
  "sentiment": {
    "positive": 0.046983976,
    "negative": 0.7345942,
    "neutral": 0.21842173
  },
  "summary": "Strategy Inc. (formerly known as MicroStrategy) is a significant bet on Bitcoin, holding over 629,000 Bitcoin worth over $71 billion. However, not everyone is sold on the company, with veteran hedge fund manager and former MicroStrStrategy investor Josh Mandell stating that he felt misled by CEO Michael Saylor's promise to not issue new shares unless the stock was trading at or above 2.5x its modified net asset value (mNAV), which measures the value of Strategy’s Bitcoin holdings versus its market cap. Mandell also criticised Strategy”s aggressive capital structure, which includes $8.2 billion in debt and $6.3 billion in preferred stock, and its ability to support such leverage if Bitcoin prices weaken further.",
  "shortSummary": "Veteran hedge fund manager Josh Mandell dumped Microstrategy's shares due to investor disillusionment over its large Bitcoin exposure and unsustainable debt and shareholder expectations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c1035f6732c14907bd0b78d9d9748b07",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://finance.yahoo.com/news/crypto-cryptocurrency-explained-163129889.html",
      "text": "What is Crypto? Cryptocurrency explained originally appeared on TheStreet.\nYour paycheck already buys less than it did three years ago because the recent years inflation spike quietly eroded the real value of savings. Yet 1.4 billion adults still have no bank account at all, locking them out of the traditional system. Those who do send money abroad lose an average 6.62% in fees every time.\nCentral banks feel the pressure, too, 86% are now exploring their own digital currencies. Wall Street just moved in as well. After the SEC green-lit spot-Bitcoin ETFs on Jan 10. 2024, investors have funnelled more than $49 billion into them.\nIn short, crypto is no longer a niche experiment, it's leading the conversation on inflation hedging, financial inclusion, and institutional flows. But what is crypto exactly? Let’s dive in.\nJoin the discussion with Scott Melker on Roundtable here.\nWhat is cryptocurrency?\nThink of cryptocurrency as internet-native money. Instead of paper bills or a bank database, every coin is simply an entry on a public record called a blockchain.\nEach time coins move, the transaction is bundled into a “block” and chained, in order, to everything that came before, making the history permanent and tamper-resistant.\nBecause this ledger is copied to thousands of computers worldwide, no single company, government or hacker can change it unilaterally.\nWhy do people care?\nBut why should you care? There are three basic reasons:\nFirst, it’s open all day, every day: The network never closes, so a transfer at two a.m. settles in minutes, not the two-day window common for bank wires.\nSecond, lower fees: Moving value directly between users often costs less than traditional wire or card rails.\nThird, it’s borderless: A user in Brazil can send crypto to another user in Germany without currency conversion or correspondent banks.\nJoin the discussion with CryptoWendyO on Roundtable here.\nHow to get exposure?\nHow to get exposure you ask? You have three starting points:\nFirst is spot-Bitcoin or Ethereum ETFs: Tickers like IBIT or ETHA sit in ordinary brokerage accounts and trade at stock-market hours.\nSecond is crypto exchanges: These are online platforms where you can buy cryptocurrencies like Bitcoin. Just make sure to choose firms that comply with U.S. or EU regulations.\nThird is hot and cold wallets: This is where the true ownership and self custody lies. Keep in mind that you are 100% responsible for your cryptocurrencies at this stage. It's the most advanced form of ownership and you must keep your private keys, which is the secret code that proves ownership, very safe."
    },
    {
      "url": "https://finance.yahoo.com/news/wall-street-debates-strategys-bitcoin-190724752.html",
      "text": "One of Wall Street's most famous short sellers, Jim Chanos, has made a name for himself by finding firms whose market value is way higher than it should be. Now, his eyes are set on MicroStrategy, a Virginia-based software company that has lately changed its name to \"Strategy.\"\nThe company is well known for its corporate Bitcoin vault. But Chanos is clear in his criticism: the company's business model is \"financial nonsense,\" and its shares are worth a lot more than the Bitcoin they represent.\nChanos's main point is based on a single number: market net asset value, or mNAV. This represents the value of the company's Bitcoin holdings per share, minus its debts and preferred equity, relative to the actual stock price.\nStrategy now has around $77.2 billion worth of Bitcoin. However, the price of its shares suggests that each share is worth significantly more than the coins themselves. Traders call that extra gap the \"premium,\" and Chanos thinks it's not fair.\nStrategy's premium has been under both scrutiny and praise. The corporation doesn't just use cash reserves or issue traditional debt to get money. It also sells perpetual preferred shares, such as its STRD (\"Stride\") and STRC (\"Stretch\") offerings.\nInvestors in these preferreds receive regular dividends, typically ranging from 9% to 12%, which Strategy uses to purchase additional Bitcoin.\nThe method gives investors more power: when the market is strong, the extra Bitcoin raises returns for regular stockholders. But in poor markets, those fixed dividend obligations stay in place, which might lower value and force Strategy to keep raising money.\nIn favor of MSTR\nMichael Saylor, the executive chairman of Strategy and the person who came up with this plan, says the extra money is well worth it. He talks about it in terms of four main benefits.\nThe first is \"credit amplification,\" which means that the company can raise more money than its equity base would normally allow, which increases its exposure to Bitcoin.\nThe second is an \"options advantage.\" Strategy's common stock, which still trades under the MSTR ticker, has one of the most active options markets tied to the price of Bitcoin. This allows investors to set up trades using calls, options, and spreads in ways that aren't easily possible with direct Bitcoin holdings.\n\"Passive flows\" is the third pillar. MSTR is included in index funds and other investment products that follow regulations. These funds automatically acquire the stock, regardless of its cost, which keeps the demand consistent.\nLastly, there is \"institutional access.\" Many big pools of money, such as pension funds and endowments, can't acquire Bitcoin directly. By holding MSTR shares, they can still acquire exposure to Bitcoin's price swings.\n\"Believe it or not, there are a lot of people who …don't want the Bitcoin return. They want 100% return. So MicroStrategy, the equity, or strategy,..We actually aim to generate 2x the Bitcoin return and 2x the volatility.\"\nAnalysis by Ryan (@ryQuant) highlights that the perpetual preferred model could drive 51% annual growth and a $1,960 fair value, allowing Strategy to keep adding Bitcoin indefinitely by paying dividends.\nChanos and other skeptics are uncertain whether the benefits outweigh the costs.\nFirst of all, \"credit amplification\" costs money. Chanos says that preferred dividends must be paid no matter how well Bitcoin does, and that individual investors can often borrow money at lower rates than Strategy does.\nSkeptics also disagree with the \"passive flows\" thesis, arguing that index inclusions can alter the market and that the buying pressure they create is not permanent.\nCritics argue that the restrictions preventing large investors from buying Bitcoin directly are diminishing, particularly with the introduction of U.S.-listed spot ETFs.\nFurther, holding Bitcoin through a corporate wrapper introduces \"double taxation,\" where profits could be taxed at both the corporate and shareholder level, as per reports.\nChanos says that the biggest risk is that the premium itself might fall apart. If investors are less inclined to pay more than mNAV, MSTR's shares could drop a lot even if the price of Bitcoin stays the same.\nSome traders take a short position in MSTR and a long position in Bitcoin at the same time, anticipating that the premium would go down over time.\nAt press time, Strategy's mNAV stands at up by 0.62%. Interestingly, MSTR has been 91% volatile among all assets over the last year — even more extreme than Tesla or Bitcoin."
    },
    {
      "url": "https://finance.yahoo.com/news/microstrategy-dons-orange-drops-micro-184531986.html",
      "text": "MicroStrategy has officially rebranded as Strategy, marking a major shift in its identity while reinforcing its focus on Bitcoin and AI-powered business intelligence.\nThe company, which has positioned itself as the world’s largest Bitcoin Treasury Company, introduced a new logo featuring a stylized “B” to highlight its commitment to Bitcoin.\nThe brand’s primary color has been changed to orange, “signifying the company’s Bitcoin strategy, and its unique position as a Bitcoin Treasury Company. The brand’s primary color is now orange, representing energy, intelligence, and Bitcoin,” as per the company’s announcement.\nMichael Saylor, founder and executive chairman described Strategy as “one of the most powerful and positive words in the human language,” noting that the shift reflects the company’s most essential focus. “It also represents a simplification of our company name to its most important, strategic core.”\nMicroStrategy’s Bitcoin holdings cross 471,000 BTC\nStrategy remains committed to its Bitcoin-first strategy, with its holdings now exceeding 471,107 BTC as of Jan. 27.\nThese holdings are currently valued at approximately $27.9 billion, with an average purchase price of $62,473 per Bitcoin. The company now controls 2.24% of Bitcoin’s total supply.\nPhong Le, President and CEO, Strategy, said, “Strategy is innovating in the two most transformative technologies of the twenty-first century – bitcoin and artificial intelligence. Our new name powerfully and simply conveys the universal and global appeal of our company, and the value we bring to the strategies of our shareholders, customers, partners, and employees.”"
    },
    {
      "url": "https://finance.yahoo.com/news/microstrategy-earnings-beats-expectations-over-231333038.html",
      "text": "MicroStrategy earnings beats expectations by over 35,000% originally appeared on TheStreet.\nMicroStrategy (NASDAQ: MSTR) posted outstanding quarterly earnings of $32.52 per share, above the average expectation of -$0.09 by 35,447.83%. This is a 4,378.95% improvement over the -$0.76 per share loss posted in the same period previous year.\nThe firm also reported sales of $114.49 million, which was slightly more than the projected $112.96 million and above projections by 1.35%. Sales increased 2.73% from $111.44 million in the same quarter a year earlier.\nStrategy, previously known as MicroStrategy, is the world’s first and largest Bitcoin Treasury Company. These results come on the heels of Strategy increasing its preferred ‘Stretch’ stock offering to fund $2.47 billion to cover additional Bitcoin purchases.\nPrevious quarter EPS losses\nStrategy’s financial performance has been far from steady over the past ten years; its recent trajectory was primarily due to its aggressive buying of Bitcoin.\nMicroStrategy’s profits have been somewhat volatile, primarily and likely due to the company’s significant investment in Bitcoin.\nJoin the discussion with Scott Melker on Roundtable here.\nThe corporation reported a substantial loss in the first quarter of 2025, amounting to -$16.49 per share, which was far worse than the expected -$2.44. This was a 575% negative earnings surprise. This happened following a string of growing losses in 2024.\nEarnings Per Share (EPS) for the fourth quarter was -$3.03, representing a 3,214% surprise compared to the prediction of -$0.09. EPS for the third quarter was -$1.72, a 1,298% surprise compared to the predicted -$0.12.\nThis trend follows a longer-term pattern: MicroStrategy made steady but small profits from 2010 to 2019, but its recent turn to Bitcoin has amplified its earnings fluctuations.\nThe habit of underperformance began in the first quarter of 2024, when EPS missed its expectation of -$0.05 by -$0.31. The second quarter of 2023, on the other hand, had a +900% surprise, with EPS of $0.15 instead of the expected -$0.02.\nThese significant changes indicate that MicroStrategy's finances remain highly sensitive to fluctuations in the crypto market, as pointed by analysts, making it challenging for traditional investors to estimate earnings and understand the company's financials.\nThe company is also going to discuss its second quarter results in a webinar at 5PM ET.\nMicroStrategy earnings beats expectations by over 35,000% first appeared on TheStreet on Jul 31, 2025\nThis story was originally reported by TheStreet on Jul 31, 2025, where it first appeared."
    },
    {
      "url": "https://finance.yahoo.com/news/veteran-hedge-fund-manager-claims-220831312.html",
      "text": "Veteran hedge fund manager claims he is 'Bit Wiser' after misstep originally appeared on TheStreet.\nJosh Mandell, a longtime Wall Street trader with a track record in government bonds and short-dated options, as well as experience in leading hedge funds, has provided an interesting note this morning, offering a rare glimpse into his investment in crypto — and it has raised a few eyebrows.\nMandell posted on May 27, a screenshot that showed a 2.1 million dollar position in the Bitwise Bitcoin ETF (BITB), with a \"tiny\" gain of $1,491.80 on the day.\nHis post on X read, \"I've made some bad choices when deciding how to invest in Bitcoin, but today I'm a Bitwiser.\"\nBitwise is one of the largest firms providing exposure to Bitcoin via a regulated exchange-traded fund (ETF), so there is no need for traditional investors to invest in crypto assets directly, such as wallets and private keys.\nMandell's investment, as shown in the image, consisted of 35,000 shares in the ETF at an average purchase price of $59.98, corresponding to a current trading price of $60.02 for BITB.\nInvest in Gold\nA $1,491.80 gain is not notable in isolation, but concerning his $2.1 million investment capital, a 0.07% gain signals Mandell's level of interest in Bitcoin as a long-term store of value.\nJosh Mandell has a lengthy history of working in fixed income trading, options trading, and the hedge fund space, serving as a director and head of Caxton Associates, a high-profile investment firm specializing in fund management.\nHis public embrace of a Bitcoin ETF is indicative of an increasing interest in digital assets among traditional finance veterans.\nFor retail investors, this represents yet another sign that Bitcoin is slowly but surely becoming a deserving member of the financial mainstream.\nVeteran hedge fund manager claims he is 'Bit Wiser' after misstep first appeared on TheStreet on May 27, 2025\nThis story was originally reported by TheStreet on May 27, 2025, where it first appeared."
    }
  ],
  "argos_summary": "MicroStrategy, now rebranded as Strategy, has become a Bitcoin‑centric company with over 629,000 BTC on its balance sheet, making its stock a proxy for Bitcoin exposure. Veteran hedge fund manager Josh Mandell sold all his shares after feeling misled by executive Michael Saylor’s promise to avoid issuing new shares below a 2.5× modified net asset value (mNAV) threshold, citing a breach of trust. Mandell criticized the company’s aggressive capital structure—$8.2 billion in debt and $6.3 billion in preferred stock—and its use of equity issuance to fund Bitcoin purchases, arguing it undermines long‑term shareholder value. The sale came amid a sharp 6.9% drop in MSTR shares, reflecting growing volatility around the firm’s Bitcoin‑heavy balance sheet and concerns over its leverage if Bitcoin prices weaken further. The article also touches on broader crypto market developments and other investor perspectives on Strategy’s business model.",
  "argos_id": "MXRWMNEWC"
}