{
  "url": "https://www.cnbc.com/2025/08/25/south-korea-parliament-passes-amended-bill-to-target-low-equity-valuations.html",
  "authorsByline": "Reuters",
  "articleId": "b6f98735483a4098b56d792f904fe507",
  "source": {
    "domain": "cnbc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Bergen County",
      "city": "Englewood Cliffs",
      "coordinates": {
        "lat": 40.8853773,
        "lon": -73.9523597
      }
    }
  },
  "imageUrl": "https://image.cnbcfm.com/api/v1/image/108190033-1756091713917-gettyimages-1131924278-SKOREA_HYUNDAI.jpeg?v=1756091725&w=1920&h=1080",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T03:15:38+00:00",
  "addDate": "2025-08-25T03:25:50.268875+00:00",
  "refreshDate": "2025-08-25T03:25:50.268876+00:00",
  "score": 1.0,
  "title": "South Korea parliament passes amended bill to target low equity valuations",
  "description": "The commercial act revision has been fiercely opposed by South Korean businesses.",
  "content": "Signage for the Hyundai Motor Co. annual shareholders meeting stands at the company's headquarters in Seoul, South Korea.\n\nSouth Korea's parliament on Monday approved a bill that intends to increase the accountability of corporate boards to shareholders, as the ruling party-controlled parliament pushes reforms to boost the country's equity valuations.\n\nThe revised Commercial Act bill, a follow-up to earlier revisions passed on July 3, will force large companies to implement more separate votes when introducing audit committee members to strengthen oversight.\n\nThe bill also \"aims to enable minority shareholders to elect their own representatives to the board,\" said Kim Jin-wook, a Citi Research analyst based in Seoul.\n\nThe changes come as President Lee Jae Myung pledged to revive legislation to curb abuses by controlling shareholders after he signaled improving corporate governance could help eliminate the so-called \"Korea Discount\", a term that refers to lower valuations of Korean companies compared with overseas peers due to their opaque governance structure.\n\nThe ruling Democratic Party holds the majority in the 300-seat parliament, making the passage of contentious bills easier after Lee's predecessor, acting President Han Duck-soo, sided with conglomerates and vetoed the bill.\n\nThe commercial act revision has been fiercely opposed by South Korean businesses.\n\n\"We regret that the National Assembly passed a supplementary amendment to the Commercial Act just a month after the first revision, aimed at expanding the separate election of audit committee members and mandating a cumulative voting system,\" The Federation of Korean Industries said in a statement on Monday.\n\nIt also urged parliament to work on ways to minimize the impact now that \"the significant potential for increased management disputes and litigation risks\" is expected.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "South Korea parliament",
      "weight": 0.09103537
    },
    {
      "name": "contentious bills",
      "weight": 0.08538859
    },
    {
      "name": "amended bill",
      "weight": 0.0848968
    },
    {
      "name": "audit committee members",
      "weight": 0.07668931
    },
    {
      "name": "minority shareholders",
      "weight": 0.07410722
    },
    {
      "name": "parliament",
      "weight": 0.07382176
    },
    {
      "name": "Korean companies",
      "weight": 0.073614545
    },
    {
      "name": "President Lee Jae Myung",
      "weight": 0.07295243
    },
    {
      "name": "low equity valuations",
      "weight": 0.070856944
    },
    {
      "name": "South Korea",
      "weight": 0.07055505
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.96240234375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.927734375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.92578125
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.6640625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.53173828125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.50390625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.3564453125
    }
  ],
  "sentiment": {
    "positive": 0.10502605,
    "negative": 0.5580087,
    "neutral": 0.3369653
  },
  "summary": "South Korea's parliament has approved a revised Commercial Act bill to increase the accountability of corporate boards to shareholders. The bill, a follow-up to earlier revisions, will require large companies to implement more separate votes when introducing audit committee members to strengthen oversight. This comes as President Lee Jae Myung pledges to revive legislation to curb abuses by controlling shareholders.",
  "shortSummary": "South Korea's parliament approved a bill to enhance corporate accountability, introduce cumulative voting, and boost equity valuations amid regulatory concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "ed21e887f9684ff681b7e931d926dc72",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "South Korea’s parliament approved a revised Commercial Act bill that will strengthen corporate board accountability by requiring separate votes for audit committee appointments and allowing minority shareholders to elect board representatives. The changes aim to improve governance and help lift the country’s equity valuations, addressing the so‑called “Korea Discount.” President Lee Jae‑Myung supports the reforms, while the Federation of Korean Industries has opposed the amendments, citing increased litigation risks and management disputes.",
  "argos_id": "MYIU6XBY0"
}