{
  "url": "https://www.nasdaq.com/articles/thai-shares-tipped-open-upside-monday",
  "authorsByline": "RTTNews",
  "articleId": "6449bbcf3c214d988aecc9f335c1b0a7",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T02:02:00+00:00",
  "addDate": "2025-08-25T02:58:07.621518+00:00",
  "refreshDate": "2025-08-25T02:58:07.621522+00:00",
  "score": 1.0,
  "title": "Thai Shares Tipped To Open To The Upside On Monday",
  "description": "(RTTNews) - The Thai stock market has finished higher in two of three trading days since the end of the four-day losing streak in which it had slumped more than 40 points or 3.5 percent. The Stock Exchange of Thailand now sits just above the 1,250-point plateau and it's poised to",
  "content": "(RTTNews) - The Thai stock market has finished higher in two of three trading days since the end of the four-day losing streak in which it had slumped more than 40 points or 3.5 percent. The Stock Exchange of Thailand now sits just above the 1,250-point plateau and it's poised to extend its gains on Monday.\n\nThe global forecast for the Asian markets is upbeat on an improved outlook for interest rates. The European and U.S. markets were up and the Asian bourses are expected to follow that lead.\n\nThe SET finished modestly higher on Friday as gains from the resource, service and technology sectors were capped by weakness from the industrial and food stocks.\n\nFor the day, the index gained 8.60 points or 0.69 percent to finish at 1,253.39 after trading between 1,245.30 and 1,257.99. Volume was 8.209 billion shares worth 37.999 billion baht. There were 252 gainers and 190 decliners, with 201 stocks finishing unchanged.\n\nAmong the actives, Thailand Airport sank 0.66 percent, while Banpu and Asset World both improved 0.83 percent, Bangkok Bank advanced 0.97 percent, Bangkok Dusit Medical fell 0.47 percent, B. Grimm soared 4.31 percent, BTS Group was up 0.59 percent, CP All Public lost 0.55 percent, Charoen Pokphand Foods shed 0.41 percent, Energy Absolute strengthened 1.54 percent, Gulf climbed 1.06 percent, PTT Oil & Retail increased 0.79 percent, PTT Global Chemical plunged 3.57 percent, SCG Packaging stumbled 2.15 percent, Siam Commercial Bank collected 0.78 percent, Siam Concrete retreated 1.76 percent, True Corporation surged 4.42 percent, TTB Bank shed 0.52 percent and Kasikornbank, Krung Thai Bank, Krung Thai Card, Advanced Info, PTT, PTT Exploration and Production, Thai Oil and Bangkok Expressway were unchanged.\n\nThe lead from Wall Street is solid as the major averages opened higher on Friday and continued to trend upward as the day continued, ending near session highs.\n\nThe Dow surged 846.24 points or 1.89 percent to finish at 45,631.74, while the NASDAQ rallied 396.23 points or 1.88 percent to end at 21,496.54 and the S&P 500 jumped 96.74 points or 1.52 percent to close at 6,466.91.\n\nFor the week, the Dow spiked 1.5 percent, the NASDAQ slipped 0.6 percent and the S&P rose 0.3 percent.\n\nThe rally on Wall Street came in reaction to Federal Reserve Chair Jerome Powell's highly anticipated speech before the Jackson Hole Economic Symposium.\n\nWhile Powell touched only briefly on the outlook for monetary policy, his remarks have increased investor confidence that the Fed will lower interest rates next month.\n\nFollowing Powell's remarks, CME Group's FedWatch Tool jumped to indicate an 83.1 percent chance the Fed will lower rates by a quarter point next month, up from 75.0 percent a day earlier.\n\nCrude oil prices rose modestly on Friday as expectations of a Russia-Ukraine peace deal waned with no progress. West Texas Intermediate crude for October delivery was up $0.13 pr 0.20 percent at $63.65 per barrel.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Krung Thai Bank",
      "weight": 0.07051267
    },
    {
      "name": "PTT Oil",
      "weight": 0.067189045
    },
    {
      "name": "Bangkok Bank",
      "weight": 0.06552438
    },
    {
      "name": "Thai Oil",
      "weight": 0.063376345
    },
    {
      "name": "Thai Shares",
      "weight": 0.06251778
    },
    {
      "name": "PTT Global Chemical",
      "weight": 0.062275067
    },
    {
      "name": "PTT Exploration",
      "weight": 0.06205175
    },
    {
      "name": "Krung Thai Card",
      "weight": 0.062006418
    },
    {
      "name": "Siam Commercial Bank",
      "weight": 0.061019193
    },
    {
      "name": "Wall Street",
      "weight": 0.059965592
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.98828125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.94384765625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.3974609375
    }
  ],
  "sentiment": {
    "positive": 0.46295798,
    "negative": 0.24271412,
    "neutral": 0.29432788
  },
  "summary": "The Thai Stock Exchange of Thailand (SEX) is poised to extend its gains on Monday, after ending a four-day losing streak that saw it slump by over 40 points or 3.5%. The index gained 8.60 points or 0.69 percent to finish at 1,253.39 after trading between 1,245.30 and 1,257.99. The global outlook for Asian markets is positive due to an improved outlook for interest rates. The European and U.S. markets were also up and the Asian bourses are expected to follow this trend. Major averages from Wall Street also opened higher on Friday, with the Dow rising by 1.89 percent and the S&P rising by 0.3 percent.",
  "shortSummary": "The Thai stock market rose slightly, with gains offsetting losses from other markets, as investor confidence grows amid rising oil prices and a potential interest rate cut.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "430f3aa2082a40498cd235d230745f89",
  "places": [
    {
      "osmId": "8986366369",
      "road": "Sirat Expressway",
      "quarter": "Chatuchak Subdistrict",
      "suburb": "Chatuchak District",
      "city": "Bangkok",
      "state": "Bangkok",
      "postcode": "10900",
      "country": "Thailand",
      "countryCode": "th",
      "coordinates": {
        "lat": 13.8040313,
        "lon": 100.5417111
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "The Thai stock market recovered, with the SET closing at 1,253.39, up 0.69% after a four‑day slump. Global markets were upbeat, with U.S. indices rising and Asian bourses expected to follow. Fed Chair Jerome Powell’s speech at Jackson Hole bolstered confidence that the Fed will cut rates next month, raising the FedWatch probability to 83%. Crude oil prices ticked up modestly to $63.65 per barrel amid stalled Russia‑Ukraine peace talks.",
  "argos_id": "MZ546Q7CA"
}