{
  "url": "https://www.nasdaq.com/articles/1-green-flag-boeing-stock-right-now",
  "authorsByline": "The Motley Fool",
  "articleId": "318d8d9c4e084580ae5b4ac121a44972",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T11:46:00+00:00",
  "addDate": "2025-08-24T12:40:12.063200+00:00",
  "refreshDate": "2025-08-24T12:40:12.063202+00:00",
  "score": 1.0,
  "title": "1 Green Flag for Boeing Stock Right Now",
  "description": "Key PointsBoeing's commercial airplane business is making a recovery and regaining trust with airlines and investors.",
  "content": "Key Points\n• None Boeing's commercial airplane business is making a recovery and regaining trust with airlines and investors.\n• None The aerospace giant's defense business has finally returned to profitability after a senior management change.\n• 10 stocks we like better than Boeing ›\n\nIf you think that one executive can't change that much at Boeing (NYSE: BA), just ask shareholders at its partner, engine maker GE Aerospace, about its CEO, Larry Culp. While Boeing's CEO, Kelly Ortberg, is unlikely to generate the kind of returns that Culp has for the former General Electric investors, he is making great strides in improving matters at Boeing.\n\nBoeing's board of directors has been significantly improved in recent years, and it contains industrial heavyweights like Carrier Global CEO David Gitlin, former GE Aviation CEO David Joyce, and former United Technologies CFO Akhil Johri. Their choice of former Collins Aerospace CEO Ortberg (a colleague of both Gitlin and Johri at United Technologies) looks like a great decision.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now. Continue »\n\nSince Ortberg's appointment in August 2024, Boeing has improved its production rate on the 737 MAX, reaching its initial target of 38 a month in the second quarter, and Ortberg expects Boeing will seek approval from the Federal Aviation Administration (FAA) to increase production to 42 a month soon. Improving the production rate on the 737 MAX is the key to growing profit margin and cash flow at the company.\n\nHowever, the most significant improvement is arguably in the defense business, Boeing Defense, Space & Security (BDS). One of the first things Ortberg did was to replace BDS CEO Ted Colbert in September 2024 with Boeing veteran Steve Parker. As you can see in the chart below, BDS is now generating profit again, after a long period of losses.\n\nMost notably, Ortberg said BDS \"had another good quarter on our fixed-price development programs\" and held its estimated-at-completion (cost forecasts based on performance) for the second consecutive quarter. That's a big deal for a business which struggled to keep a lid on costs under Colbert.\n\nIt all points to improved execution at Boeing, and with a $619 billion backlog, there's plenty of potential for the improved execution to lead to profit growth at Boeing.\n\nShould you invest $1,000 in Boeing right now?\n\nBefore you buy stock in Boeing, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Boeing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $649,657!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,090,993!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 1,057% — a market-crushing outperformance compared to 185% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join Stock Advisor.\n\nLee Samaha has no position in any of the stocks mentioned. The Motley Fool recommends GE Aerospace. The Motley Fool has a disclosure policy.",
  "medium": "Article",
  "links": [
    "https://www.fool.com/author/2492/",
    "https://www.fool.com/legal/fool-disclosure-policy/",
    "https://www.fool.com/investing/stock-market/market-sectors/industrials/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=3201fbda-bff5-4082-a3a8-1401f983628b",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=16e6b877-cd65-41df-8875-850b4910c8e6&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001093%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_partners%26ftm_pit%3D17514&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=3201fbda-bff5-4082-a3a8-1401f983628b",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=744a28ad-e0db-4fed-91a4-fd5093fad0c4&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001096%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dtop_incontent_pitch_feed_partner%26ftm_pit%3D17547&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=3201fbda-bff5-4082-a3a8-1401f983628b",
    "https://www.fool.com/investing/stock-market/market-sectors/industrials/defense-stocks/biggest-defense-companies/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=3201fbda-bff5-4082-a3a8-1401f983628b",
    "https://www.nasdaq.com/market-activity/stocks/ba",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=9d42bcc8-b3ee-4507-a73a-8e777f9c0a49&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000069%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_partner%26ftm_pit%3D17995",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=16e6b877-cd65-41df-8875-850b4910c8e6&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001093%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D17514%26ftm_veh%3Darticle_pitch_feed_partners%26company%3DBoeing&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=3201fbda-bff5-4082-a3a8-1401f983628b"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Boeing Stock",
      "weight": 0.10481301
    },
    {
      "name": "Boeing",
      "weight": 0.09495451
    },
    {
      "name": "Boeing Defense",
      "weight": 0.09465739
    },
    {
      "name": "former Collins Aerospace CEO Ortberg",
      "weight": 0.08787709
    },
    {
      "name": "Boeing veteran Steve Parker",
      "weight": 0.08553122
    },
    {
      "name": "former GE Aviation CEO David Joyce",
      "weight": 0.08072608
    },
    {
      "name": "BDS CEO Ted Colbert",
      "weight": 0.07819217
    },
    {
      "name": "Motley Fool Stock Advisor",
      "weight": 0.073175184
    },
    {
      "name": "Carrier Global CEO David Gitlin",
      "weight": 0.07243223
    },
    {
      "name": "former United Technologies CFO Akhil Johri",
      "weight": 0.06653656
    }
  ],
  "topics": [
    {
      "name": "Airlines"
    },
    {
      "name": "Markets"
    },
    {
      "name": "Aviation"
    }
  ],
  "categories": [
    {
      "name": "Travel"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9853515625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.93017578125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.837890625
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.79150390625
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Aviation Industry",
      "score": 0.7197265625
    }
  ],
  "sentiment": {
    "positive": 0.8395423,
    "negative": 0.053513143,
    "neutral": 0.1069445
  },
  "summary": "Boeing's commercial airplane business is making a recovery and regaining trust with airlines and investors, but the defense business has finally returned to profitability after a senior management change. Boeing's CEO, Kelly Ortberg, has been making significant strides in improving matters at the company. Since Ortberg's appointment in August 2024, Boeing has improved its production rate on the 737 MAX, reaching its initial target of 38 a month in the second quarter, and expects Boeing to seek approval from the Federal Aviation Administration (FAA) to increase production to 42 a month soon. The most significant improvement is arguably in the Boeing Defense, Space & Security (BDS), which is now generating profit again after a period of losses. With a $619 billion backlog, there is plenty of potential for profit growth at Boeing.",
  "shortSummary": "Boeing's turnaround under Kelly Ortberg is evident in improving its commercial airplane business, while its defense business returns to profitability after years of losses.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "a217adc436e047f0994ede724e1318ed",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=16e6b877-cd65-41df-8875-850b4910c8e6&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001093%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_partners%26ftm_pit%3D17514&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=3201fbda-bff5-4082-a3a8-1401f983628b",
      "text": "Get Access to The Motley Fool's Top 10 Stock Picks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,057% vs. just 185% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to access our secure sign-up page.\nReturns are updated during market hours.The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://www.fool.com/legal/fool-disclosure-policy/",
      "text": "Here at The Motley Fool, when it comes to matters of money, we believe in transparency and accountability. Day in and day out, we dedicate ourselves to delivering responsible investing ideas and sound financial education. That's why, when it comes to talking about stocks, we think it's important that you know exactly where we're coming from. With this in mind, we have developed a company-wide disclosure policy to guide our business and communications. We call it Fool Disclosure. We invite you to take some time to read through it, and hope it helps inform your experience here in Fooldom.\nInvestors Communicating With Investors\nThe Motley Fool is a company that represents investors teaching and learning from other investors. Many financial publications do not permit their writers and editors to own stocks. The Motley Fool not only permits, but also encourages its staff to invest in common stock. Why? Two reasons.\nFirst, we strongly believe the most effective way to create wealth is through the long-term ownership of stocks. The stock market has compounded 10% average annual returns over the last century. We believe in using the stock market as a savings bank, and we strongly encourage treating money management as a lifelong endeavor. Therefore, we think it'd be downright mean of us to close that avenue of investment to our employees.\nSecond, and more important, we don't consider our employees to be journalists, but rather communicators and teachers of financial matters. It's a subtle but critical difference that affects our entire service -- from our online site at Fool.com, to our investment books, to our nationally syndicated newspaper column, to our newsletters and portfolio services. As a company, we utilize every available medium to teach people of all ages, all income levels, all backgrounds, and all genetic codes about money and its applications in modern life. Therefore, we believe our staff's involvement in managing their own money is critical to their learning more about the subject and their succeeding in their own lives. And who better to write about investing than those who do it themselves?\nThe Motley Fool writes about stocks in both free and paid content. We make stock recommendations in our various premium newsletter services and actually hold some of these shares in our portfolio services. We will disclose our recommendation or ownership until we cease to recommend the stock, or we sell our entire position. Of course, in both free and paid content we will continue to disclose whether the author has an interest in the stocks mentioned.\nInternally, the Fool has always strived to operate with the highest levels of integrity and transparency. As such, here are the key components of The Motley Fool's disclosure policy:\nDisclosure\n- When a writer writes about a stock that he or she has a position or beneficial interest in, that fact is disclosed at the end of the article.\n- If The Motley Fool recommends or holds a position in a stock, that fact is also disclosed at the end of the article.\n- All Fool employees and contractors -- that's anyone with a TMF prefix on their screen names -- are required to disclose their current positions, including stocks, mutual funds, and cryptocurrencies. We aggregate and display these positions for the entire company here. (We do not disclose the individual stocks that might be in a Fool's mutual funds.)\n- Affiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no knowledge of any affiliates' holdings and/or specific recommendations, and the affiliates' personnel have no knowledge of any editorial content before it is published. Our affiliate companies may also have their own disclosure policies, which they may make available on their respective sites.\nTrading Restrictions\nIn addition to the above disclosure requirements, Fool employees work under additional trading restrictions and guidelines. These restrictions require that they:\n- Must hold any stock they own for at least 10 days. (No day trading allowed -- as if we'd want to!)\n- Cannot write about a stock in the period of 2 market days before to 2 market days after purchasing or selling the stock.\n- Must clear trades with our compliance department prior to any transaction.\n- Must notify our compliance department every time they buy or sell a stock, regardless of whether they have written about it.\nInvestors in The Motley Fool\nThe Motley Fool is grateful to the people that have invested in us. The Fool's founders and some family members have invested in the company, and full-time employees receive stock options and/or stock in the company.\nBusiness and Technology Partners\nWe have business relationships with an ever-changing assortment of companies, including technology vendors, leasing companies, data providers, banks, distribution channels, advertisers, landlords, accountants, and the restaurants up the street from Fool HQ. Many of these companies are public companies operating in industries that we follow. There may be instances in which one of our newsletters recommends a company with whom we have a business relationship, or we may write an article about such a company on Fool.com. These occurrences are unintentional and coincidental, as the business end of The Motley Fool has no input or influence on the editorial side of things.\nIt would take too much space to list all the companies that we do business with, and we'd probably forget some anyway, but below are some of our major partners. (This list is most subject to change. We'll update it periodically, but we will not be able to keep pace with the rate of change.)\nInvesting Advertisers\nAs a general rule, if you see ads from a company on our site and emails, that company is paying us for such placement. Some of the major ones include E*Trade, Fidelity, Scottrade, OptionsHouse, and ShareBuilder. Additionally, companies pay us for inclusion in specific areas of our site (e.g., Registration Page, Broker Center).\nMotley Fool Money\nA portion of our site, branded as Motley Fool Money, writes reviews of personal finance products, including credit cards, mortgage offers, and brokerage accounts. We may receive compensation for offers that appear on Motley Fool Money, including compensation related to placement.\nWe may issue recommendations for preferred partners that we believe in and/or use ourselves. But keep in mind, this site may not include all available offers from our partners. For example, there are thousands of credit cards available. We’ll highlight a fraction of them. All picks are made at the editorial discretion of Motley Fool Money editorial team.\nFor a list of major advertisers on Motley Fool Money, click here.\nDistribution Partners\nSome of our major distribution partners include Yahoo! Finance, MSN Money, USA Today, AOL, Nasdaq, and CNN Money.\nNews, Quotes, Data, and Content Providers\nOur major providers include Xignite SIX Financial.\nMajor Service Providers or Other Partners\nSilicon Valley Bank, Slack, Namely, Charles Schwab, Interactive Brokers, Worldpay/Vantiv, and Jones Lang LaSalle.\nIn Conclusion\nWe have designed our disclosure and trading guidelines to serve our community, our customers, and our employees fairly. As always, though, you should remember to consider every piece of investment information you receive, here at the Fool or elsewhere, not as a de facto recommendation, but as an idea for further consideration. Even the strongest disclosure policy in the world does not excuse individuals from taking responsibility for their own decisions. Due diligence, critical thought, and use of the most extraordinary device in the world (the human brain) are crucial to your financial success.\nLast updated November 11th, 2024."
    },
    {
      "url": "https://www.fool.com/investing/stock-market/market-sectors/industrials/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=3201fbda-bff5-4082-a3a8-1401f983628b",
      "text": "The industrials sector is the backbone of the economy. It performs three main functions:\n- Manufacturing and distributing capital goods: This includes building products and machinery, as well as providing construction and engineering services.\n- Providing commercial and professional services: This includes environmental and facility services, along with human resources and employment services.\n- Providing transportation services: This includes operating an airline or railway.\nWhat are industrial stocks?\nWhat are industrial stocks?\nIndustrial companies operate in several subsectors of the economy, providing products and services related to:\n- Aerospace and defense\n- Air freight and logistics\n- Commercial and professional services and supplies\n- Industrial machinery and electrical equipment\n- Construction equipment and building supplies\n- Transportation, including cars, airlines, and railways\n- Waste management\nThe industrial industry is one of three economic segments. It's also known as the secondary sector. The other two economic segments are the primary sector, encompassing agriculture, fishing, and mining, and the service sector, which includes hospitality, consultancy, and nursing.\nBest industrial stocks\nBest industrial stocks to buy in 2025\nThese industrial stocks are some of the sector’s most durable long-term investments:\n| Name and ticker | Market cap | Dividend yield | Industry |\n|---|---|---|---|\n| Waste Management (NYSE:WM) | $91 billion | 1.39% | Commercial Services and Supplies |\n| FedEx (NYSE:FDX) | $56 billion | 2.36% | Air Freight and Logistics |\n| Ge Vernova (NYSE:GEV) | $165 billion | 0.08% | Electrical Equipment |\n| Lockheed Martin (NYSE:LMT) | $104 billion | 2.92% | Aerospace and Defense |\n| Caterpillar (NYSE:CAT) | $204 billion | 1.32% | Machinery |\n1. Waste Management\nWaste Management, or WM, is one of the leading waste management companies in North America. It provides waste collection, transfer, and disposal services, as well as recycling and resource recovery. The company is also a leading developer and operator of landfill gas-to-energy facilities that produce renewable natural gas (RNG).\nIt provides its services to residential, commercial, industrial, and municipal customers. With demand for waste hauling relatively stable, its business is more recession-resistant than other industrial companies.\nOver the years, WM has invested in automating its collection truck fleet and converting it to run on cleaner, cheaper natural gas, including RNG. Moves like these have allowed WM to consistently generate free cash flow, giving it the funds to make acquisitions. In late 2024, it acquired Stericycle to expand its comprehensive environmental solutions into the growing healthcare sector. It's also investing $3 billion through 2026 on new or upgraded recycling facilities and RNG production facilities.\nThe company also routinely returns money to shareholders via dividends and share repurchases while maintaining an investment-grade balance sheet. It hiked its dividend 10% for 2025, its 22nd straight year of increases. This strategy of expanding and also rewarding shareholders has enabled Waste Management to create significant shareholder value over the years.\n2. FedEx\nFedEx provides customers with transportation, e-commerce, and business services. The company operates a fleet of aircraft and vehicles, logistics facilities, and retail stores that help facilitate the shipment of millions of packages daily. It also offers a host of other logistics and e-commerce services that help businesses distribute their products to customers.\nE-commerce\nFedEx produces lots of free cash flow, which allows the company to pay a competitive and growing dividend. It can also repay debt to strengthen its balance sheet and make investments to expand its operations.\nFedEx’s strong cash flow also enables the company to invest in innovation. The shipping company is testing autonomous vehicles and delivery services. Meanwhile, the company bought RouteSmart Technologies in 2025 to help further optimize delivery.\nThe company announced plans in 2025 to separate its FedEx Freight operations by creating a new publicly traded company. The company hopes to complete the separation within 18 months. The transaction will create two leading industrial companies and should unlock value for shareholders.\n3. Lockheed Martin\nLockheed Martin is a leading global security and aerospace company. It researches, designs, develops, and manufactures advanced technology systems, products, and services, primarily for government customers. The defense contractor has four main business segments: aeronautics, missiles and fire control, rotary and mission systems, and space.\nThe company invests billions of dollars annually on research and development (R&D) to advance the latest defense technology. It routinely complements its internal R&D program with acquisitions. In late 2024, the company acquired Terran Orbital to enhance its space capabilities. It also bought Amentum's Rapid Solutions business in 2025 to enhance its ability to deliver innovative defense technology.\nThe defense contractor should continue growing in the coming years. Recent wars in Ukraine and the Middle East have increased global defense spending. That trend will likely continue as geopolitical tensions remain high.\nLockheed Martin also has an excellent record of returning cash to shareholders through dividends and repurchases. In late 2024, it delivered its 22nd annual dividend increase, while boosting its share repurchase authorization by $3 billion to a total of $10 billion.\n4. Caterpillar\nCaterpillar is a leading global manufacturer of construction and mining equipment, off-highway diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives. The company has three operating segments: construction industries, resource industries, and energy and transportation. It also provides financing and related services.\nCaterpillar is working toward making more sustainable equipment. It’s collaborating with companies in the rail, energy, mining, and technology sectors on developing new technologies with lower carbon emissions. For example, it’s working on both battery- and hydrogen-powered locomotives. It’s also developing zero-emission haul trucks and equipment for the mining industry. The focus on sustainability will be a major growth driver for Caterpillar in the coming years as the global economy continues making progress on reducing carbon emissions.\nAnother major growth driver for Caterpillar is the increasing investment in infrastructure in the coming years. The U.S. is one of many countries that have boosted their spending on projects to maintain and expand highway and rail systems, bridges, and other infrastructure. The increased spending should drive more demand for construction equipment.\nThe company has continued to reward shareholders throughout economic cycles. It has raised its dividend for 31 consecutive years.\n5. GE Vernova\nGE Vernova is an energy equipment manufacturing and services company. It formed in 2024 after the once-mighty industrial giant GE completed its breakup. GE Vernova is the former GE Power and GE Renewable Energy businesses.\nThe company has three business segments:\n- Power: It provides electricity generation solutions like natural gas turbines to customers to produce power.\n- Wind: The company is a leader in producing wind turbines and other components to produce wind energy.\n- Electrification: It developed solutions to help modernize and digitize the electric grid.\nGE Vernova's products currently produce about 25% of the world's electricity. It manufactures turbines (natural gas and wind), positioning it to grow as demand for lower carbon energy rises. It also services its turbines for customers, providing the company with very stable cash flow.\nIdentifying the best companies\nHow to identify the best industrial companies\nThe strongest industrial companies have diversified operations, low operating costs, and investment-grade credit ratings. Diversification, a low cost structure, and access to affordable debt are important because of the cyclicality of the industrials sector. Economic downturns directly reduce the demand for industrial goods and services.\nIndustrial companies also need access to affordable debt because their operations are often very capital-intensive. Most industrial companies need to borrow money to buy new capital equipment and build new manufacturing facilities. Another benefit of a low-cost structure is less exposure to rising cost pressures in inflationary environments.\nWhile a company's financial performance is always relevant for investors, companies in the industrial sector need to maintain particularly strong financial positions. Prospective investors should pay close attention to how specific industrial companies fare in times of crisis.\nRelated investing topics\nShould you invest?\nShould you buy industrial company stocks?\nThe industrial sector's cyclical nature makes industrial company stocks better suited for risk-tolerant investors. As we’ve seen many times over the years, economic conditions can significantly change almost overnight. But in a booming economy, industrial company stocks can generate impressive returns for investors. Buy-and-hold investors who are comfortable with volatility can often earn strong returns by owning shares of high-quality industrial companies for the long term."
    },
    {
      "url": "https://www.fool.com/investing/stock-market/market-sectors/industrials/defense-stocks/biggest-defense-companies/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=3201fbda-bff5-4082-a3a8-1401f983628b",
      "text": "The U.S. defense industry consists of a group of companies battling for contracts from a single customer -- the U.S. government -- with a seemingly insatiable appetite for its products.\nThe U.S. government spends $850 billion annually on defense, as well as billions more on intelligence and space. A good portion of the total goes to salaries and benefits for soldiers and other purposes, but the U.S. military also spends a hefty chunk on the tanks, ships, and planes built by defense contractors.\nWhy invest in defense stocks?\nWhy invest in defense stocks?\nThe large prime contractors get most of the attention from investors, and rightly so. The so-called primes that mostly deal directly with the government instead of serving as subcontractors to other companies have streamlined to become highly focused specialists competing for multibillion-dollar contract awards.\nDefense stocks tend not to be high fliers like tech stocks, but they do offer predictable and stable returns. They tend to move based on what is happening in Washington, D.C., rather than on the cyclical movement of the economy.\nThey can offer a mix of slow but steady growth and income to a portfolio. Thanks to the extended time frame of government contracting, they can offer predictable revenue well into the future.\nWhat to know before investing\nWhat to know before investing in defense contractors\nIt's important to understand a few basics about the defense industry. Broadly speaking, any company that receives the bulk of its revenue from government customers, whether it's the Pentagon, civil agencies, or intelligence services, is considered a defense contractor.\nThere are a few specialists, but after a period of intense consolidation during the 1990s, most of the large contractors have numerous different businesses. Most have at least two areas of emphasis, such as warplanes and missiles or ships and tanks, so they are not overly reliant on any one contract. But none is a jack-of-all-trades able to compete for whatever the Pentagon desires.\nThe key to investing in the sector is to choose carefully between the contractors based on areas of Pentagon emphasis and relative valuation gaps between the companies that can be explained away or should ease over time.\nBiggest defense companies\nBiggest defense companies\nHere's a look at some of the biggest names in defense:\n| Defense Company | Market Capitalization | Company Description |\n|---|---|---|\n| RTX (NYSE:RTX) | $194.7 billion | The product of a 2020 merger between Raytheon and United Technologies, RTX makes a number of missile systems and defense electronics systems, in addition to a broad range of commercial aircraft components. |\n| Boeing (NYSE:BA) | $162.8 billion | Best known as a maker of commercial airplanes, Boeing also has a large defense business focused on planes and drones, and is one of the leading space franchises. |\n| Lockheed Martin (NYSE:LMT) | $108.4 billion | The world's largest defense contractor, Lockheed Martin specializes in warplanes, helicopters, missiles, electronics, and space. |\n| General Dynamics (NYSE:GD) | $79.1 billion | General Dynamics defense is focused on warships, tanks, and information technology. It is also the parent of Gulfstream, one of the world's largest makers of business jets. |\n| Northrop Grumman (NYSE:NOC) | $72.6 billion | Northrop Grumman makes most of the U.S. fleet of bombers, has a key role in a number of space programs, and makes components for warplanes made by others. |\nCompanies 1 - 2\n1. RTX\nRTX doesn't have a massive signature program like a bomber or a warship, but it makes the electronics and high-tech sensors that go into many of those systems. Its missile systems, including the Patriot defense batteries, are among the best in the world, and it provides sensors and other equipment to the intelligence community.\nThanks to its 2020 merger between Raytheon and United Technologies, RTX has a broad portfolio of aerospace businesses, including Pratt & Whitney engines and Collins Aerospace. The mix of defense and commercial revenue means RTX is not overly reliant on either the Pentagon or commercial airlines. However, it also meant that when airlines were hobbled, like during the COVID-19 pandemic, RTX stock fell more than pure-play defense primes.\nRaytheon also has more international exposure than its peers, thanks to both its commercial business and the global appetite for missiles.\n2. Lockheed Martin\nLockheed Martin is the largest contractor in terms of defense revenue -- Boeing and RTX both get the majority of sales from nondefense businesses -- and the prime contractor for some of the Pentagon's biggest projects. Its flagship program is the F-35 Joint Strike Fighter, which is expected to generate more than $1 trillion in sales to both the U.S. and its allies over the course of its life cycle.\nHowever, Lockheed Martin is much more than just a one-hit wonder. It is a major producer of missiles and missile defense systems, and it has a dominant helicopter franchise and a rapidly growing space business.\nLockheed Martin is the manager of the famous Skunk Works research facility in California that has produced some of the most iconic military aircraft designs. These days, much of that research and development (R&D) muscle is going toward hypersonics, meaning the missiles and aircraft traveling at more than five times the speed of sound -- a priority for the Pentagon.\nCompanies 3 - 5\n3. Boeing\nBoeing is best known for its commercial jet empire, and defense makes up less than one-third of total sales. But that's still enough to place the company among the largest defense contractors.\nAs one might expect, much of Boeing's defense portfolio is aviation-based. Boeing has an extensive portfolio of planes and helicopters in service, including the F/A-18 Super Hornet, the F-15 fighter, the Apache helicopter, and a number of surveillance and support aircraft. The company also beat out Lockheed Martin to produce the next U.S. fighter jet, to be called the F-47.\nBoeing also manufactures several missiles and has a large space business. In addition, it has emerged as a leader in drones and other autonomous systems.\nIt has been a rough few years for Boeing's commercial business, and there is constant speculation about the company potentially spinning off its defense assets to raise cash. But the mix of defense and commercial should help even out the cyclicality inherent to both businesses, an argument for keeping the company intact.\n4. General Dynamics\nGeneral Dynamics has an impressive portfolio of defense products. It serves as the U.S. government's primary supplier of tanks and heavy land vehicles, and the company also owns a number of shipyards where destroyers and nuclear-powered submarines are manufactured. But the company has been an underperformer in recent years for reasons that have nothing to do with defense.\nGeneral Dynamics also owns Gulfstream, one of the world's largest manufacturers of business jets. That part of its business took nearly a decade to recover from the 2008-09 recession, eating into results and making General Dynamics an underperformer relative to its more defense-focused peers for an extended period of time.\nIn addition, the company is one of the primary IT vendors to the government, managing networks and doing top-secret work for the Pentagon, spy agencies, and civil bureaucracies.\n5. Northrop Grumman\nNorthrop Grumman is a contractor focused on the skies above. The company's signature programs are its bombers, including the original stealth bomber and the forthcoming B-21. It also makes important subsystems for the F-35 and other aircraft.\nThe B-21 is predicted to be a $200 billion program over its lifespan, and Northrop Grumman is also the lead contractor on the planned nine-figure overhaul of the nation's aging intercontinental ballistic missile arsenal.\nNorthrop Grumman was almost sold to Lockheed Martin in the late 1990s, but the deal was eventually blocked by antitrust concerns. The company seemed adrift for a while after that, unsure of how to navigate on its own. In recent years, though, Northrop Grumman has found a clear mission and is evolving into an air and space defense powerhouse.\nRelated investing topics\nBig defense companies are getting bigger\nBiggest doesn't always mean best, and simply buying the biggest names in the defense industry is no way to invest. But in an industry that requires massive specialized manufacturing skills, access to security clearances, and strong relationships with government buyers, size does matter.\nThe world isn't getting any safer, and the government's appetite for products from these companies is unlikely to dry up anytime soon. The order of the rankings might change over time, but there is good reason to expect that today's list of the largest defense companies will look quite similar to one made in a few years' time.\nFAQ\nDefense Stocks FAQ\nWhat is the world's largest defense company?\nThe world's largest pure-play defense company -- meaning the largest company focused entirely on defense -- is Lockheed Martin. However, if you include commercial aerospace businesses like aircraft engines, RTX is the largest company.\nWhat are the top five biggest defense companies?\nThe top five largest defense companies in terms of military sales are Lockheed Martin, RTX, Northrop Grumman, Boeing, and General Dynamics.\nWho is the richest defense contractor in the world?\nThere are varying definitions of \"rich\" when dealing with public companies, but Lockheed Martin would likely be considered the richest defense contractor in the world because it holds the top spot in terms of defense revenue, and it is the world's largest military aircraft manufacturer. Lockheed also has a stable balance sheet, implying that it can pay its bills and grow.\nShould I invest in defense stocks?\nDefense companies sell a lethal product, and some investors will likely want to shy away from the sector due to ethical concerns. But for those who are willing to buy in, defense stocks offer predictable growth and a steady stream of income to help build wealth over time.\nIs Lockheed or Northrop bigger?\nLockheed Martin ranks above Northrop Grumman both in terms of market capitalization and sales.\nHow big is the U.S. defense industry?\nU.S. defense is a $320 billion market, according to estimates. Note the Pentagon budget, which is more than $800 billion, is much larger, but the budget also includes expenses including salaries and benefits for soldiers, among other items."
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=9d42bcc8-b3ee-4507-a73a-8e777f9c0a49&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000069%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_partner%26ftm_pit%3D17995",
      "text": "5 Years From Now, You'll Probably Wish You Grabbed These Stocks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,057% vs. just 185% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to find out how to get access to these stocks.\nReturns are updated during market hours. The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=744a28ad-e0db-4fed-91a4-fd5093fad0c4&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001096%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dtop_incontent_pitch_feed_partner%26ftm_pit%3D17547&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=3201fbda-bff5-4082-a3a8-1401f983628b",
      "text": "Get Access to The Motley Fool's Top 10 Stock Picks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,057% vs. just 185% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to access our secure sign-up page.\nReturns are updated during market hours.The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=16e6b877-cd65-41df-8875-850b4910c8e6&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001093%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D17514%26ftm_veh%3Darticle_pitch_feed_partners%26company%3DBoeing&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=3201fbda-bff5-4082-a3a8-1401f983628b",
      "text": "Get Access to The Motley Fool's Top 10 Stock Picks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,057% vs. just 185% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to access our secure sign-up page.\nReturns are updated during market hours.The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://www.fool.com/author/2492/",
      "text": "Lee Samaha\nLee Samaha is a contributing Stock Market Analyst at The Motley Fool covering industrials, electricals, energy, materials, transportation, and infrastructure stocks. Prior to The Motley Fool, Lee was a Civil Engineer and Investment Manager. He holds a Bachelor of Civil and Structural Engineering from Southampton University and a Certificate in Investment Management from Chartered Institute for Securities & Investment. Lee first cut his investing teeth on The Motley Fool bulletin boards (commonly referred to as the “Fool Boards,”) and he’s infinitely grateful to all of the investors he learned from in this powerful investing community.\nRecent Articles by Lee Samaha\nThe 1 Thing Investors in GE Aerospace and RTX Need to Know Before Buying Stock (And Why Airplanes Are Set to Look Dramatically Different in the Future)\n1248 Management Ramps Up Its Position in Tesla\nEARNEST Partners Buys the Dip in Hexcel Stock\nSender Buys Into the Turnaround Story at Kenvue\nInvesting in Natural Gas Stocks\nStevens Capital Significantly Cuts its Tesla Position\nDrexel Morgan Takes a Bullish Position on UPS\nPremium Investing Services\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services."
    }
  ],
  "argos_summary": "Boeing’s commercial airplane division is regaining momentum under CEO Kelly Ortberg, with 737 MAX production hitting its target of 38 units per month and plans to increase to 42. The defense arm, Boeing Defense, Space & Security, has returned to profitability after a leadership change, with steady cost forecasts and a $619 billion backlog fueling future growth. Despite these improvements, The Motley Fool’s Stock Advisor does not currently recommend Boeing as a top pick, suggesting investors consider other high‑return opportunities. Overall, Boeing shows signs of operational turnaround but remains outside the top investment list at present.",
  "argos_id": "N2LL9C1D6"
}