{
  "url": "https://www.yahoo.com/news/articles/loss-occupations-identity-jobless-world-142111928.html",
  "authorsByline": "Professor Victoria Sutton",
  "articleId": "ad33639bed3746179f0ded24aa1b56dc",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/native_news_online_articles_488/ec72156c5d0096be437d3f4aafd42ed4",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T14:21:11+00:00",
  "addDate": "2025-08-24T14:39:49.336475+00:00",
  "refreshDate": "2025-08-24T14:39:49.336477+00:00",
  "score": 1.0,
  "title": "The Loss of Occupations and Identity in a Jobless World",
  "description": "The emerging technology of artificial intelligence suggested that soon we would all be losing our jobs.  The Screen Actors Guild and Writers Guild of America first recognized that Artificial Intelligence (AI) could take their identities and do their jobs, and negotiations to protect them were intense.  For now, humans are still needed and AI is still not replacing us, but let’s revisit some of the ideas of UBI (Universal base income) and how much our identities are tied with our occupation.",
  "content": "Guest Opinion. The emerging technology of artificial intelligence suggested that soon we would all be losing our jobs. The Screen Actors Guild and Writers Guild of America first recognized that Artificial Intelligence (AI) could take their identities and do their jobs, and negotiations to protect them were intense. Some suggest physicians and lawyers will soon be out of a job with AI. News like the student at MIT who dropped out because we will all be dead due to AI before she can graduate promises sensational headlines. For now, humans are still needed and AI is still not replacing us, but let’s revisit some of the ideas of UBI (Universal base income) and how much our identities are tied with our occupation.\n\nA Brookings study in 2019 concluded that “[A]pproximately 25 percent of U.S. employment (36 million jobs in 2016) will face high exposure to automation in the coming decades (with greater than 70 percent of current task content at risk of substitution).” A clear signal that there will not be enough jobs to go around. Andrew Wang has a solution. Wang brought the idea of universal basic income (a monthly payment to everyone in America from the government) to the center of his platform in his run to be the Democrat Presidential nominee. These two dynamics set the stage to converge the loss of jobs with the proposal just to pay people to stay home. Add to this fire, the unexpected accelerate, the “Great Resignation of 2021” where the quit rate reached an all time high in November 2021.\n\nNever miss Indian Country’s biggest stories and breaking news. Click here to sign up to get our reporting sent straight to your inbox every weekday morning.\n\nAndrew Wang’s proposal for a Universal Basic Income is a titillating concept for futurists who see no need for an advanced society to spend their days toiling away in jobs that artificial intelligence can do as good or better. Futurists imagine former workers will turn to art and the humanities, philanthropy and music with all this extra time.\n\nSome have pointed to Finland where in 2017 they did the first and only trial of a UBI nationwide study among a sample of the population for two years. The object of the study was how it affected employment after the end of the trial. The conclusion was that it did not have much effect. But the experiment is hailed as a demonstration of how UBI can work, despite the outcome.\n\nLike most political proposals, none of the unintended consequences are considered. Most of the work is focused on economics and how a government can afford to implement UBI, what the economics will be for GDP and other financial aspects of such a plan. Little to no work has been done on the psychological effect of losing an occupational identity.\n\nWe have to ask what will this void of meaningful occupations mean for humans?\n\nThe very first punishment was to work for your food until death, after the fall of man. Genesis 3:19 tells us, “By the sweat of your face you shall eat bread, till you return to the ground, for out of it you were taken; for you are dust, and to dust you shall return.” A grime reminder that we are being punished, but is work punishment? Those who have found work that is so enjoyable for them that it isn’t like work are truly fortunate (I count myself among those.) While not everyone is happy with their work, everyone has their identity tied to their work to some degree.\n\nFrom the beginning of time occupations have been closely tied to identity, in fact, surnames that came about in Europe often identified a family by their occupation —- Baker, Cook, Smith, Archer, Barber, Carpenter, Farmer, Fisher, Forester, Shoemaker, Tanner, Weaver, Gardner to name just a few. So occupational identity is still attached to those families to this day. If we named people for their occupations today, we might have surnames like Programmer, Advisor, Consultant, Driver, Designer or Engineer. But whether we have official surnames or not, identity is connected to our professions and occupations.\n\nSo what do we know from science about the psychology of work? The last meaningful book on the psychology of occupations was published in 1956, which finds that “occupational choice may be taken as an indication of some aspects of self-image.”\n\nLet’s take a quick look at the science we do have on the negative effects of losing one’s job or occupation: A meta-analysis of ninteen studies on the relationship of work to suicide rates found that there is a distress effect as a result of job loss, and evidence that distress improves on regaining employment. In the U.S. a study showed that depressive symptoms were associated with job loss, but with one major mediating factor —-occupational status. With the disappearance of occupations, that mediating factor will disappear, increasing the depressive effect found in these studies. Alcohol consumption increases with job loss, and drug overdoses increased significantly during the pandemic (but factors of isolation as well as job loss could also be attributable). One study showed that opioid deaths increased by 2.7% with the loss of 1,000 trade jobs.\n\nOther studies show that slow and incremental job loss has less of an effect on distress. But the same could be said for the proverbial frogs in the pot of water, oblivious to the fact that the water is imperceptably being slowly brought to a boil? The end result is not pretty for the frog.\n\nUniversities are the research centers for what lies ahead. Research also relates to what Universities teach. What will universities prepare you for? Likely not much will change except professional schools like engineering, medicine and law may be altered to reflect the new reality. Teaching basic human knowledge in the arts, humanities and science will be important to understand the world around us, just as it is today. Universities can still serve as the bridge to adulthood because the need for that will not change. With university tuition being free in the new world order, there is no pressure to select the right major to make the most money. But then what?\n\nWhat happens to the graduates that are now prepared to understand the world around them, yet are prepared for no job? Were they taught how to select a life of music and art and philanthropy? Why would they not select a life of crime? A UBI cannot completely kill the entrepreneurial spirit.\n\nGraduates from universities and non-graduates will have the same lifetime expected incomes, so do universities eventually lose their importance for societal status? Almost inevitably.\n\nWhat new identities will emerge if a UBI is the solution to joblessness? Wife, husband, mother, father, grandmother? Even those identities are closely intertwined with being the “breadwinner(s)” for the family, as the essential support for food and shelter.\n\nUsing the Seven Generations principle, we ask how this policy will affect seven generations. We look back at the previous three generations, our current generation and three future generations as we ask this question. We have looked back and work and occupation is indisputably tied to identity and self-worth. We look at today, and the convergence of artificial intelligence job replacement, political push to institute a universal basic income, and the pandemic effects that led to the Great Resignation suggests we are at a turning point in human society. Looking ahead, three generations are the decades ahead when this transition will take place. The next three generations are critical and this is the time when study and planning for such a transition might produce a better future, rather than throwing money at the future with a simplistic UBI that ignores the effect of identity and self-worth entangled with our occupations and professions.\n\nHave we managed to become so advanced that we have escaped the first punishment to work for our food until death? Indicators are that a move to UBI will likely be more of a leap from the frying pan into the fire — perhaps a hellish outcome, if we do not give this serious study and thought before embarking on a utopian scheme lacking any scientific support.\n\n[This article includes material from an article I wrote for unintended consequences in 2022.]\n\nTo read more articles by Professor Sutton go to: https://profvictoria.substack.com/\n\nProfessor Victoria Sutton (Lumbee) is Director of the Center for Biodefense, Law & Public Policy and an Associated Faculty Member of The Military Law Center of Texas Tech University School of Law.\n\nAbout the Author: \"Levi \\\"Calm Before the Storm\\\" Rickert (Prairie Band Potawatomi Nation) is the founder, publisher and editor of Native News Online. Rickert was awarded Best Column 2021 Native Media Award for the print\\/online category by the Native American Journalists Association. He serves on the advisory board of the Multicultural Media Correspondents Association. He can be reached at levi@nativenewsonline.net.\"",
  "medium": "Article",
  "links": [
    "https://nativenewsonline.net/subscribe-to-native-news-today"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "job loss",
      "weight": 0.075230554
    },
    {
      "name": "jobs",
      "weight": 0.06543613
    },
    {
      "name": "enough jobs",
      "weight": 0.06444976
    },
    {
      "name": "artificial intelligence job replacement",
      "weight": 0.0639085
    },
    {
      "name": "meaningful occupations",
      "weight": 0.055926673
    },
    {
      "name": "occupational identity",
      "weight": 0.055732787
    },
    {
      "name": "Other studies",
      "weight": 0.054157086
    },
    {
      "name": "Occupations",
      "weight": 0.053371355
    },
    {
      "name": "occupation",
      "weight": 0.053371355
    },
    {
      "name": "occupations",
      "weight": 0.053371355
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Jobs & Education/Jobs/Career Resources & Planning",
      "score": 0.61962890625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Work & Labor Issues",
      "score": 0.5849609375
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.537109375
    },
    {
      "name": "/News/Technology News",
      "score": 0.487548828125
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.474853515625
    },
    {
      "name": "/Jobs & Education/Jobs/Job Listings",
      "score": 0.3388671875
    }
  ],
  "sentiment": {
    "positive": 0.05922268,
    "negative": 0.6935017,
    "neutral": 0.24727564
  },
  "summary": "The article discusses the potential for the loss of occupations and identity in a jobless world, following a study by Brookings that predicts that approximately 25 percent of U.S. employment (36 million jobs in 2016) will face high exposure to automation in the coming decades. The study also indicated that over 70 percent of current task content is at risk of substitution. The author suggests that the future of work is uncertain, with potential employers like physicians and lawyers potentially losing their jobs. The article also mentions the rise of the “Great Resignation of 2021” where the quit rate will reach an all-time high in November 2021. It suggests that universal basic income (a monthly payment to all in America from the government) is a solution. However, most of the study's focus is on economics, rather than the psychological effects of losing an occupational identity.",
  "shortSummary": "The rise of AI and its potential impact on jobs and identity will push for a universal basic income (UBI) solution, though its practicality and economics remain uncertain.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "23a01a6e582946f8a4c29064865ab7d7",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The article argues that rapid AI-driven job displacement, highlighted by guilds and a Brookings study, may trigger widespread unemployment, prompting proposals like Universal Basic Income (UBI) to sustain livelihoods. It critiques UBI trials—such as Finland’s—showing limited impact on employment while ignoring psychological consequences of losing occupational identity, which research links to depression, suicide, and substance abuse. The piece warns that without addressing identity loss, UBI could worsen mental health and societal cohesion, especially as universities shift focus to non‑career skills. Ultimately, it calls for deeper scientific and policy analysis before adopting UBI as a blanket solution to the looming AI‑induced job crisis.",
  "argos_id": "NL5YYTLF2"
}