{
  "url": "https://www.bloomberg.com/news/videos/2025-08-20/us-must-be-part-of-ukraine-security-agreement-panetta-video",
  "authorsByline": "bn",
  "articleId": "68322340f610495780ba0fd5adfe36f8",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ipaX4d_qjlu0/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-20T22:01:18.591000+00:00",
  "addDate": "2025-08-20T22:08:44.349782+00:00",
  "refreshDate": "2025-08-20T22:08:44.349784+00:00",
  "score": 1.0,
  "title": "US Must be Part of Ukraine Security Agreement: Panetta",
  "description": "Leon Panetta, former US Secretary of Defense, shares what he believes security guarantees need to look like from the US and Europe to ensure Ukraine’s safety from Russia. Panetta also talks about what to expect the US to guarantee and if he believes Russian President Vladimir Putin will agree to a trilateral meeting, & what happens next if Putin does not. Leon Panetta speaks with Tyler Kendall and Michael Shepard on the late edition of Bloomberg’s “Balance of Power.” (Source: Bloomberg)",
  "content": "To your view, what do security guarantees need to look like to essentially prevent a repeat of what happened in 1994 with the Budapest Memorandum that really left Ukraine over the long run short of an adequate defense against a potential Russian invasion? Well, the primary point that needs to be made with these security assurances is that the United States and our European allies, particularly those that are part of NATO's will, in fact, make clear that they will come to the assistance of Ukraine if Russia should attack in the future. And so Europe has indicated that they're prepared to move in that direction. I think the president indicated that he was prepared to support security clearances, even though he was pull back on boots on the ground. He did say that they would look seriously at providing air support to help in those security assurances. The one the one problem right now is that Russia is saying that somehow it needs a veto power over what those assurances look like. And since the primary purpose of those security assurances is to be able to protect Ukraine from a Russian invasion, I'm not so sure that's something that's going to happen. Well, and, Mr. Secretary, we did have Bloomberg News reporting today, actually, that European leaders are discussing a guarantee for Ukraine that would commit allies to decide within 24 hours whether to provide military support to the country if it was attacked again by Russia. Much to your point. But just to drill down a little further on this, I'm wondering what is realistic? What should we expect from the U.S. when it comes to their side of contributing to these guarantees? For example, we hear a lot about air cover, and that seems to be an emerging themes in these in these discussions. Well, I think to be fair, security assurances are not going to work unless the United States is part of that agreement. We bring a lot to the table, obviously, from a military point of view and from the ability to try to support any military effort that might have to occur on the ground. So it's very important that the United States be part of those security assurances. It's very important that Europe agree that that they will come together and support Ukraine in that event. I think 24 hours is, you know, probably makes some sense, but it really has to look like implementation of a Title five kind of approach that once Russia decides to invade Ukraine again, that all of the nations of NATO's will again respond as they have now. Director Panetta last night on balance of power, we spoke with William Taylor, former U.S. ambassador to Ukraine. Here's what he had to say about the prospect of Vladimir Putin really participating in a bilateral or even trilateral meeting with the Amir Zelensky. Putin does want to end this war, but want to drag it out. He wants to keep pounding the Ukrainians until they give up. They're never going to give up. But he's going to keep pounding until he's forced to come to the table for a cease fire. So, no, I don't think he's eager. I don't think he's had any intention of coming to a bilateral meeting. He may say something on the phone to President Trump to tell President Trump that he's willing to do it, but they're not serious about these negotiations. And and Putin is not either. Putin wants all of Ukraine and he wants to pound them until he gets that. Director Panetta, we have yet to hear from Moscow about whether they will or will not agree to a meeting between the Emir Zelensky and Vladimir Putin. How much time should Donald Trump give the Russian leader to agree to a sit down? And what happens next if Putin balks or refuses? Well, again, there is a fundamental principle here, but that Bill Taylor referred to, which is that you can't trust Vladimir Putin in these issues. You just can't. I think it's 88% of the American people in a recent poll said do not trust Vladimir Putin. That's pretty good judgment on the part of the American people. That's the reality, is that it's very difficult to. Really try to find a way to get Putin to negotiate seriously. Right now, I think he's largely playing for time, but he's continuing the war. He's refused to agree to any kind of cease fire by even talking about the need to eliminate the root causes of the war. Well, the root cause of the war was that Russia invaded Ukraine on the basis that it is a part of Russia and not a sovereign democracy on its own. So he basically is saying he wants to win. I think it's very important for President Trump to make very clear to Putin that he wants them to participate in this trilateral or meeting with the landscape. And if it doesn't happen, I think the president really does have to. But he's got to he's got to come back and hold tough with Putin by implementing sanctions, by providing weapons, and by making very clear to Vladimir Putin that he cannot win this war. That is going to be very important for our ability to negotiate.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Vladimir Putin",
      "weight": 0.0862286
    },
    {
      "name": "security assurances",
      "weight": 0.0784546
    },
    {
      "name": "Ukraine",
      "weight": 0.0778157
    },
    {
      "name": "Ukraine Security Agreement",
      "weight": 0.075228825
    },
    {
      "name": "Putin",
      "weight": 0.07331622
    },
    {
      "name": "security guarantees",
      "weight": 0.0703158
    },
    {
      "name": "security clearances",
      "weight": 0.06464073
    },
    {
      "name": "President Trump",
      "weight": 0.060712192
    },
    {
      "name": "Part",
      "weight": 0.05977604
    },
    {
      "name": "part",
      "weight": 0.05977604
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97607421875
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.9375
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.93701171875
    },
    {
      "name": "/News/World News",
      "score": 0.86474609375
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.8017578125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.587890625
    }
  ],
  "sentiment": {
    "positive": 0.11755437,
    "negative": 0.50149035,
    "neutral": 0.38095528
  },
  "summary": "The US and European allies, particularly those that are part of NATO's (NATO) will need to make clear that they will assist Ukraine if Russia should attack again in the future, according to former U.S. ambassador to Ukraine, Leonid Panetta. These assurances need to be made to prevent a repeat of what happened in 1994 with the Budapest Memorandum, which left Ukraine short of an adequate defense against a potential Russian invasion. Panetta argues that security assurances are not going to work unless the United States is part of the agreement. He also criticizes Russia's claim that it needs a veto power over what these assurances look like, since the primary purpose of these assurances is to protect Ukraine from an invasion. Former U.K. ambassador, William Taylor, also commented on the prospect of Vladimir Putin participating in a bilateral or trilateral meeting with the Amir Zelensky.",
  "shortSummary": "Director Panetta stresses that the United States must provide security assurances for Ukraine to prevent a repeat of the 1994 Budapest Memorandum invasion.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "179e8506048a48738b65db92455df16a",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The discussion focuses on strengthening security guarantees for Ukraine to prevent a repeat of the 1994 Budapest Memorandum failure, emphasizing the need for clear U.S. and NATO commitments, including rapid military support and air cover. European leaders are considering a 24‑hour decision window for aid, while the U.S. stresses its essential role in any assurance framework. The conversation also addresses President Trump’s potential engagement with Putin, noting Putin’s reluctance to negotiate and the importance of sanctions and continued military aid to deter further aggression. Overall, the emphasis is on decisive, collective action to deter Russian invasion and uphold Ukraine’s sovereignty.",
  "argos_id": "NOIF1MJWF"
}