{
  "url": "https://finance.yahoo.com/video/p-500-ceos-saw-pay-160025723.html",
  "authorsByline": "Yahoo Finance Video",
  "articleId": "69f72c4806a94726b418ad87ab22f8a2",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/kdgQPXLnaZAK_a_Fatg8FA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzQ-/https://s.yimg.com/os/creatr-uploaded-images/2025-08/9005d5f0-7d07-11f0-99f7-ada5273c53da",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T16:00:25+00:00",
  "addDate": "2025-08-24T16:02:56.424110+00:00",
  "refreshDate": "2025-08-24T16:02:56.424112+00:00",
  "score": 1.0,
  "title": "S&P 500 CEOs saw their pay jump in 2024",
  "description": "S&P 500 CEOs saw their median pay rise 7.7% last year, mostly tied to stock performance, according to Farient Advisors. Patrick Moorhead, Moor Insights & Strategy Founder, CEO & Chief Analyst, Yahoo Finance Senior Reporter Brooke DiPalma, and Peter Berezin, BCA Research Chief Global Strategist and Director of Research, discuss the latest CEO pay data. To watch more expert insights and analysis on the latest market action, check out more Opening Bid.",
  "content": "Compensation for S&P 500 CEOs rose 7.7% last year according to new data from pay consultancy, Farian Advisors. Median total pay tallied $19 million. Wow. So my question is this, why are CEOs becoming even more overpaid? And are they worth it, Patrick? Over to you because a lot of the CEOs in here are big tech CEOs. Are big tech CEOs deserving of this very, very high compensation? Is is their job that important?\n\nWell, I I think they deserve it if they're driving returns for shareholders. And that's what, you know, the data misses, which is most of their compensation is tied to increase in the the stock price, right? Uh you know, their salaries are are reasonable, right? Um in the millions, um maybe even less, but they're really all tied to appreciation. So, yes, I think they are deserve deserved of that. And if and when the market starts going down, uh they will make less money.\n\nBrooke, a lot of these names are also uh a lot of these CEOs are also in the retail space. Um I suspect you and I will eventually be on a list like this.\n\nI mean, fingers crossed certainly, but what we have heard is you know, uh, Starbucks CEO, for example, his a paycheck, Brian Nickel there about 94% from what I know, is uh his pay comes from stock awards that are tied to the company's performance. And ultimately, this is something that many companies' board of directors have been leaning into, this idea that if the company does well, so will the executives do well here. And what we've seen is it certainly play out. I mean Starbucks is in the midst of a turnaround strategy here. We also know that other retail giants that have performed well, also have have compensated their executives well. And so certainly we're in this environment where board of directors are certainly leaning into this idea because they ultimately want to make investors happy, especially at these record high stock performance that we've been seeing.\n\nPeter, how do you assess a CEO and their impact on a business?\n\nWell, it's interesting to compare, say, Jeff Bezos. So I think his annual salary was like $80,000 a year. I mean, Really took one for the team, Peter. Really took one for the team. never took never got any shares. Like he owns a big chunk of Amazon, but he never got any additional shares from the board. And you contrast that with, you know, another CEO. I won't tell you his name. I'll just say his first name is Elon. Won't tell you his last name. Um, who has had the board just issue tons and tons of shares to him. I don't know. I don't know. I I I like Bezos' model a bit more. Uh Amazon was a successful company without the board having to issue him a lot of additional shares. I think other companies can look to that.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "big tech CEOs",
      "weight": 0.095155925
    },
    {
      "name": "CEOs",
      "weight": 0.08776605
    },
    {
      "name": "pay consultancy",
      "weight": 0.08048873
    },
    {
      "name": "Median total pay",
      "weight": 0.077960186
    },
    {
      "name": "other companies",
      "weight": 0.07776015
    },
    {
      "name": "stock awards",
      "weight": 0.071072035
    },
    {
      "name": "other retail giants",
      "weight": 0.070049584
    },
    {
      "name": "Starbucks CEO",
      "weight": 0.06983063
    },
    {
      "name": "board",
      "weight": 0.069591
    },
    {
      "name": "Jeff Bezos",
      "weight": 0.067355745
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Stocks"
    },
    {
      "name": "Business Leaders"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.96044921875
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.716796875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.6376953125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.374755859375
    },
    {
      "name": "/Jobs & Education/Jobs/Job Listings",
      "score": 0.35986328125
    }
  ],
  "sentiment": {
    "positive": 0.23605087,
    "negative": 0.44348437,
    "neutral": 0.3204648
  },
  "summary": "Compensation for S&P 500 CEOs rose by 7.7% last year, according to new data from pay consultancy, Farian Advisors. Most of these CEOs' compensation is tied to increase in the stock price. However, if the market begins going down, these CEOs will make less money. The author suggests that big tech CEOs deserve high compensation if they are driving returns for shareholders. She also notes that many companies believe that if the company does well, executives will perform well.",
  "shortSummary": "Compensation for S&P 500 CEOs rose 7.7% to $19 million in 2014, driven by increased stock prices, with big tech CEOs like Jeff Bezos earning significantly.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "538b59f107414a0fa83f44a831ac4411",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "S&P 500 CEOs saw a 7.7% rise in compensation last year, with a median pay of $19 million, largely driven by stock‑based awards tied to company performance. The discussion highlights that while some executives, like Starbucks’s CEO, receive most of their pay through performance‑linked stock, others such as Jeff Bezos have minimal salaries and rely on existing equity holdings. Critics question whether such high payouts are justified, but proponents argue they reward shareholder returns and incentivize growth. The debate reflects a broader trend of boards aligning executive rewards with market success, though the long‑term value of these incentives remains contested.",
  "argos_id": "O4ZEED2EB"
}