{
  "url": "https://fortune.com/2025/08/24/private-credit-bonds-loans-debt-ai-boom-bubble/",
  "authorsByline": "Josyana Joshua, Bloomberg, Olivia Fishlow",
  "articleId": "f686cbdf9d6b4a43aceff1c4be78cc27",
  "source": {
    "domain": "fortune.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://fortune.com/img-assets/wp-content/uploads/2025/08/GettyImages-2218344193-e1756067429429.jpg?resize=1200,600",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T20:38:02+00:00",
  "addDate": "2025-08-24T20:51:42.642537+00:00",
  "refreshDate": "2025-08-24T20:51:42.642539+00:00",
  "score": 1.0,
  "title": "Credit fuels the AI boom — and fears of a bubble",
  "description": "“Private credit funding of artificial intelligence is running at around $50 billion a quarter, at the low end, for the past three quarters.\"",
  "content": "Credit investors are pouring billions of dollars into artificial intelligence investments, just as industry executives and analysts are raising questions about whether the new technology is inflating another bubble.\n\nJPMorgan Chase & Co. and Mitsubishi UFJ Financial Group are leading the sale of a more than $22 billion loan to support Vantage Data Centers’ plan to build a massive data-center campus, people with knowledge of the matter said this week. Meta Platforms Inc., the parent of Facebook, is getting $29 billion from Pacific Investment Management Co. and Blue Owl Capital Inc. for a massive data center in rural Louisiana, Bloomberg reported this month.\n\nAnd plenty more of these deals are coming. OpenAI alone estimates it will need trillions of dollars over time to spend on the infrastructure required to develop and run artificial intelligence services.\n\nAt the same time, key players in the industry acknowledge there is probably pain ahead for AI investors. OpenAI Chief Executive Officer Sam Altman said this week that he sees parallels between the current investment frenzy in artificial intelligence and the dot-com bubble in the late 1990s. When discussing startup valuations he said, “someone’s gonna get burned there.” And a Massachusetts Institute of Technology initiative released a report indicating that 95% of generative AI projects in the corporate world have failed to yield any profit.\n\n“It’s natural for credit investors to think back to the early 2000s when telecom companies arguably overbuilt and over borrowed and we saw some significant writedowns on those assets,” said Daniel Sorid, head of U.S. investment grade credit strategy at Citigroup. “So, the AI boom certainly raises questions in the medium term around sustainability.”\n\nThe early build-out of the infrastructure needed to train and power the most advanced AI models was largely funded by the AI companies themselves, including tech giants like Alphabet Inc.’s Google and Meta Platforms Inc. Recently, though, the money has been increasingly coming from bond investors and private credit lenders.\n\nThe exposure here comes in many shapes and sizes, with varying degrees of risk. Many large tech companies — the so-called AI hyperscalers — have been paying for new infrastructure with gold-plated corporate debt, which is likely safe due to the existing cash flows that secure the debt, according to recent analysis from Bloomberg Intelligence.\n\nMuch of the debt funding now is coming from private credit markets.\n\n“Private credit funding of artificial intelligence is running at around $50 billion a quarter, at the low end, for the past three quarters. Even without factoring in the mega deals from Meta and Vantage, they are already providing two to three times what the public markets are providing,” said Matthew Mish, head of credit strategy at UBS.\n\nAnd many new computing hubs are being funded through commercial mortgage-backed securities, tied not to a corporate entity, but to the payments generated by the complexes. The amount of CMBS backed by AI infrastructure is already up 30%, to $15.6 billion, from the full year total in 2024, JPMorgan Chase & Co. estimated this month.\n\nSorid and a colleague at Citi put out a report on Aug. 8 focusing on the particular risks for the utility firms that have boosted borrowing to build the electrical infrastructure needed to feed the power-hungry data centers. They and other analysts share a commonly held concern about spending so much money right now, before AI projects have shown their ability to generate revenue over the long term.\n\n“Data center deals are 20 to 30 year tenor fundings for a technology that we don’t even know what they will look like in five years,” said Ruth Yang, global head of private market analytics at S&P Global Ratings. “We are conservative in our assessment of forward cash flows because we don’t know what they will look like, there’s no historical basis.”\n\nThe stress has begun to appear in the rise of payment-in-kind loans to tech-oriented private credit lenders, UBS Group noted. In the second quarter, PIK income in BDCs reached the highest level since 2020, climbing to 6%, according to UBS.\n\nBut the fire hose of money is unlikely to stop anytime soon.\n\n“Direct lenders are constantly raising capital, and it has to go somewhere,” said John Medina, senior vice president in Moody’s Global Project and Infrastructure Finance Team. “They see these hyperscalers, with this massive capital need, as the next long-term infrastructure asset.”",
  "medium": "Article",
  "links": [
    "https://fortune.com/company/jpmorgan-chase/",
    "https://www.bloomberg.com/news/articles/2025-08-15/openai-s-altman-expects-to-spend-trillions-on-infrastructure",
    "https://fortune.com/company/citigroup/",
    "https://fortune.com/company/facebook/",
    "https://fortune.com/company/alphabet/",
    "https://fortune.com/company/mitsubishi/",
    "https://www.bloomberg.com/news/articles/2025-08-20/jpmorgan-mufg-to-lead-22-billion-loan-for-vantage-data-centers",
    "https://fortune.com/company/ubs-group/",
    "https://www.bloomberg.com/news/articles/2025-08-19/how-pimco-outmaneuvered-apollo-kkr-to-win-29-billion-meta-deal",
    "https://mlq.ai/media/quarterly_decks/v0.1_State_of_AI_in_Business_2025_Report.pdf"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "AI infrastructure",
      "weight": 0.07877209
    },
    {
      "name": "private credit markets",
      "weight": 0.071904205
    },
    {
      "name": "Private credit funding",
      "weight": 0.071528524
    },
    {
      "name": "private credit lenders",
      "weight": 0.07089728
    },
    {
      "name": "AI investors",
      "weight": 0.06920372
    },
    {
      "name": "Credit investors",
      "weight": 0.06664987
    },
    {
      "name": "credit investors",
      "weight": 0.06664987
    },
    {
      "name": "AI projects",
      "weight": 0.06645832
    },
    {
      "name": "new infrastructure",
      "weight": 0.0661447
    },
    {
      "name": "artificial intelligence investments",
      "weight": 0.06542342
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.958984375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.9248046875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.91015625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.8193359375
    },
    {
      "name": "/News/Technology News",
      "score": 0.65771484375
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.438720703125
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.353271484375
    },
    {
      "name": "/Business & Industrial/Business Finance/Venture Capital",
      "score": 0.350830078125
    }
  ],
  "sentiment": {
    "positive": 0.13964687,
    "negative": 0.45587668,
    "neutral": 0.40447643
  },
  "summary": "Credit investors are investing billions of dollars into artificial intelligence investments, raising concerns about whether the technology is inflating another bubble. JPMorgan Chase & Co. and Mitsubishi UFJ Financial Group are leading the sale of a $22 billion loan to support Vantage Data Centers’ plan to build a massive data-center campus. Meta Platforms Inc., the parent of Facebook, is receiving $29 billion from Pacific Investment Management Co and Blue Owl Capital Inc. for a data center in rural Louisiana. However, OpenAI CEO Sam Altman compared the current investment frenzy to the dot-com bubble in the late 1990s, and a report by the Massachusetts Institute of Technology suggests that 95% of generative AI projects in the corporate world have failed to generate any profit. Much of the debt funding now is coming from private credit markets. Many new computing hubs are being funded through commercial mortgage-backed securities, tied not to a corporate entity, but to the payments generated by the complexes.",
  "shortSummary": "Credit investors are pouring billions into artificial intelligence investments, raising concerns about potential bubbles and uncertain long-term prospects.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "a53ec3fe8e514cde9f789dc8bdd41530",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://fortune.com/company/jpmorgan-chase/",
      "text": "The largest of the “Big Four” banks in the U.S., JPMorgan Chase is at the center of the American financial system through its core offerings of consumer and community banking, commercial and investment banking, and asset and wealth management. The towering institution has its roots in different companies, including financial tycoon J.P. Morgan’s firm, and Chase Manhattan, with which it merged in 2000. Jamie Dimon has served as CEO since late 2005, shepherding the bank through the Global Financial Crisis. The question of who will succeed him has become one of the most closely watched stories in the business world, though Dimon has downplayed any intention of stepping down in the near term.\nMichael Nagle—Bloomberg via Getty Images"
    },
    {
      "url": "https://fortune.com/company/ubs-group/",
      "text": "UBS used to be one of a pair of gigantic Swiss banking groups, until its great rival Credit Suisse failed in 2023. UBS acquired the company that year in a 3 billion Swiss franc all-shares emergency deal, brokered and guaranteed by the Swiss government, leaving it with $5 trillion in invested assets. That acquisition marked the culmination of more than a century of consolidation in the country’s financial sector: UBS was formed through mergers and acquisitions of hundreds of banks, the earliest founded in 1747. The group, which is headquartered in Zurich, is focused primarily on global wealth management and private banking—representing just over half of its revenues—alongside investment banking, asset management, and retail banking in Switzerland itself.\nUBS Group\nUBS Group in Fortune Rankings\n- About\nArnd WiegmannBloomberg/Getty Images\n- Company Information\n- Key Financials (last Fiscal Year)\n- Profit Ratios\n- Fastest-growing Companies\n- World's Most Admired Companies\n- Europe's Most Innovative Companies"
    }
  ],
  "argos_summary": "Credit investors are pouring billions into AI infrastructure, with banks like JPMorgan and Mitsubishi UFJ financing massive data‑center projects for companies such as Meta and Vantage Data Centers. While AI firms previously funded their own build‑outs, private credit and CMBS now dominate, with quarterly private‑credit flows around $50 billion and CMBS exposure up 30 % to $15.6 billion. Industry leaders warn that the rapid, long‑term debt financing—often 20‑30 year tenors—may inflate a bubble, citing high failure rates of corporate generative‑AI projects and uncertain future cash flows. Despite concerns, lenders continue to raise capital, viewing hyperscalers as long‑term infrastructure assets, and payment‑in‑kind loans are rising, signaling sustained funding pressure.",
  "argos_id": "OBQMETU6O"
}