{
  "url": "https://techcrunch.com/2025/08/24/pintarnya-raises-16-7m-to-power-jobs-and-financial-services-in-indonesia/",
  "authorsByline": "Kate Park",
  "articleId": "2eba876d088b4bb6a44640834ee6b731",
  "source": {
    "domain": "techcrunch.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://techcrunch.com/wp-content/uploads/2022/07/GettyImages-1405746444.jpg?resize=1200,800",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T22:00:00+00:00",
  "addDate": "2025-08-24T22:04:39.159685+00:00",
  "refreshDate": "2025-08-24T22:04:39.159686+00:00",
  "score": 1.0,
  "title": "Pintarnya raises $16.7M to power jobs and financial services in Indonesia",
  "description": "The Indonesian startup, now backed by $16.7M in Series A funding, helps workers find full-time and side gigs while offering financial solutions",
  "content": "Pintarnya, an Indonesian employment platform that goes beyond job matching by offering financial services along with full-time and side-gig opportunities, said it has raised a $16.7 million Series A round.\n\nThe funding was led by Square Peg with participation from existing investors Vertex Venture Southeast Asia & India and East Ventures.\n\nGhirish Pokardas, Nelly Nurmalasari, and Henry Hendrawan founded Pintarnya in 2022 to tackle two of the biggest challenges Indonesians face daily: earning enough and borrowing responsibly.\n\n“Traditionally, mass workers in Indonesia find jobs offline through job fairs or word of mouth, with employers buried in paper applications and candidates rarely hearing back. For borrowing, their options are often limited to family/friend or predatory lenders with harsh collection practices,” Henry Hendrawan, co-founder of Pintarnya, told TechCrunch. “We digitize job matching with AI to make hiring faster and we provide workers with safer, healthier lending options — designed around what they can reasonably afford, rather than pushing them deeper into debt.”\n\nAround 59% of Indonesia’s 150 million workforce is employed in the informal sector, highlighting the difficulties these workers encounter in accessing formal financial services because they lack verifiable income and official employment documentation.\n\nPintarnya tackles this challenge by partnering with asset-backed lenders to offer secured loans, using collateral such as gold, electronics, or vehicles, Hendrawan added.\n\nSince its seed funding in 2022, the platform currently serves over 10 million job seeker users and 40,000 employers nationwide. Its revenue has increased almost fivefold year-over-year and expects to reach break-even by the end of the year, Hendrawn noted. Pintarnya primarily serves users aged 21 to 40, most of whom have a high school education or a diploma below university level. The startup aims to focus on this underserved segment, given the large population of blue-collar and informal workers in Indonesia.\n\n“Through the journey of building employment services, we discovered that our users needed more than just jobs — they needed access to financial services that traditional banks couldn’t provide,” said Hendrawan. “We digitize job matching with AI to make hiring faster and we provide workers with safer, healthier lending options — designed around what they can reasonably afford, rather than pushing them deeper into debt.”\n\nWhile Indonesia already has job platforms like JobStreet, Kalibrr, and Glints, these primarily cater to white-collar roles, which represent only a small portion of the workforce, according to Hendrawan. Pintarnya’s platform is designed specifically for blue-collar workers, offering tailored experiences such as quick-apply options for walk-in interviews, affordable e-learning on relevant skills, in-app opportunities for supplemental income, and seamless connections to financial services like loans.\n\nThe same trend is evident in Indonesia’s fintech sector, which similarly caters to white-collar or upper-middle-class consumers. Conventional credit scoring models for loans, which rely on steady monthly income and bank account activity, often leave blue-collar workers overlooked by existing fintech providers, Hendrawan explained.\n\nWhen asked about which fintech services are most in demand, Hendrawan mentioned, “Given their employment status, lending is the most in-demand financial service for Pintarnya’s users today. We are planning to ‘graduate’ them to micro-savings and investments down the road through innovative products with our partners.”\n\nThe new funding will enable Pintarnya to strengthen its platform technology and broaden its financial service offerings through strategic partnerships. With most Indonesian workers employed in blue-collar and informal sectors, the co-founders see substantial growth opportunities in the local market. Leveraging their extensive experience in managing businesses across Southeast Asia, they are also open to exploring regional expansion when the timing is right.\n\n“Our vision is for Pintarnya to be the everyday companion that empowers Indonesians to not only make ends meet today, but also plan, grow, and upgrade their lives tomorrow … In five years, we see Pintarnya as the go-to super app for Indonesia’s workers, not just for earning income, but as a trusted partner throughout their life journey,” Hendrawan said. “We want to be the first stop when someone is looking for work, a place that helps them upgrade their skills, and a reliable guide as they make financial decisions.”",
  "medium": "Article",
  "links": [
    "https://techcrunch.com/2022/05/18/pintarnya-is-building-a-super-app-for-indonesias-blue-collar-workers/",
    "https://pintarnya.com/",
    "https://techcrunch.com/2021/04/05/singapore-based-career-platform-glints-gets-22-5m-in-series-c-funding/",
    "https://www.kantar.com/Campaigns/APAC/Uncovering-the-World-of-Gig-workers-in-Indonesia#:~:text=How%20Large%20Is%20the%20Population,or%20categorized%20as%20business%20owners).",
    "https://www.brookings.edu/articles/accelerating-growth-in-indonesia-an-industrial-policy-for-the-rural-informal-sector/#:~:text=They%20do%20not%20register%20to,selected%20locations%20as%20specified%20below.",
    "https://techcrunch.com/events/tc-disrupt-2025/?utm_source=tc&utm_medium=ad&utm_campaign=disrupt2025&utm_content=ticketsales&promo=tc_inline_rb&display="
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "financial services",
      "weight": 0.0866563
    },
    {
      "name": "formal financial services",
      "weight": 0.08265195
    },
    {
      "name": "job platforms",
      "weight": 0.074947946
    },
    {
      "name": "employment services",
      "weight": 0.07493006
    },
    {
      "name": "job matching",
      "weight": 0.06931584
    },
    {
      "name": "Pintarnya",
      "weight": 0.06649878
    },
    {
      "name": "Henry Hendrawan",
      "weight": 0.06573482
    },
    {
      "name": "job fairs",
      "weight": 0.06443652
    },
    {
      "name": "most Indonesian workers",
      "weight": 0.06399897
    },
    {
      "name": "financial decisions",
      "weight": 0.063040234
    }
  ],
  "topics": [
    {
      "name": "Venture Capital"
    },
    {
      "name": "Startups"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98388671875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.6875
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.53271484375
    },
    {
      "name": "/Jobs & Education/Jobs/Job Listings",
      "score": 0.50732421875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.45556640625
    },
    {
      "name": "/Jobs & Education/Jobs/Career Resources & Planning",
      "score": 0.4267578125
    },
    {
      "name": "/Business & Industrial/Business Finance/Venture Capital",
      "score": 0.35693359375
    },
    {
      "name": "/Business & Industrial/Small Business/Other",
      "score": 0.340087890625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.316650390625
    }
  ],
  "sentiment": {
    "positive": 0.29665682,
    "negative": 0.27798676,
    "neutral": 0.42535648
  },
  "summary": "Pintarnya, an Indonesian employment platform, has raised a $16.7 million Series A round to address two challenges: earning enough and borrowing responsibly. The funding was led by Square Peg with participation from existing investors Vertex Venture Southeast Asia & India and East Ventures. The startup, founded by Ghirish Pokardas, Nelly Nurmalasari, and Henry Hendrawan, aims to provide financial services for blue-collar and informal workers, who often struggle in accessing formal financial services due to lack of verifiable income and official employment documentation. Since its seed funding in 2022, the platform currently serves over 10 million job seeker users and 40,000 employers nationwide. Since then, revenue has increased almost fivefold year-over-year and expects to reach break-even by the end of the year.",
  "shortSummary": "Pintarnya, an Indonesian employment platform combining financial services with job matching, has raised $16.7 million to expand its financial services and enhance employment opportunities.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "fea3271be1834db693df9301daea2d13",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://techcrunch.com/2022/05/18/pintarnya-is-building-a-super-app-for-indonesias-blue-collar-workers/",
      "text": "Indonesia’s 60 million blue-collar workers contribute 20% to its gross domestic product, but they face a lot of uncertainty. Many are forced to bounce from job to job, some fall victim to scam job postings and without a steady employment history, are unable to qualify for financial services, say the founders of Pintarnya. That’s why they created the app, which includes verified job postings and financial services, like loans, for blue-collar workers. The startup announced today it has raised $6.3 million in seed funding led by Sequoia Capital India and General Catalyst. The funding includes a $100,000 grant from Sequoia Spark, a program for women founders in which co-founder Nelly Nurmalasari participated.\nPintarnya was launched this May in major Indonesian cities by Nurmalasari, Henry Hendrawan and Ghirish Pokardas. Nurmalasari and Hendrawan were formerly senior executives at lifestyle super app unicorn Traveloka, while Pokardas was a KKR executive who worked with portfolio companies in financial services.\nIn an email, the co-founders told TechCrunch that Nurmalasari also owned a hair salon and as an SME owner, she experienced the pain points of trying to hire, filter and verify applicants for blue-collar jobs. She also saw that they struggled to obtain loans from traditional financial institutions because of their lack of verifiable employment and income history.\n“The problem became clear when the spillover of her employee’s struggles became hers as these challenges impact employee performance,” they said. “This fortified the vision for a one-stop digital platform that can help in tackling this challenge, to be more employable and access financial services products.”\nPintarnya focuses on the food and beverage, hotel and retail sectors, now reopening after COVID lockdowns, and logistics. It plans to expand into other sectors as well and is open to partnering with employers from other industries.\nJob seekers register and create a profile, then Pintarnya uses that information to recommend job openings based on their requirements, location, skills and other data. Key criteria include the distance between a job and their home, their profile and job history and their self-determined capabilities. The team said that as they build a track record of successfully connecting and placing jobseekers with employers, Pintarnya’s recommendation algorithms will become better by “understanding what other jobseeker traits have a higher propensity of converting their application into a successful job placements.” Variables that it takes into consideration include a jobseeker’s current salary and availability, whether or not they have a photo on their CV and the frequency in which they switch jobs.\nPintarnya also works with employers to screen and recruit the most suitable workers for their needs, including online tests. It also verifies job listings’ authenticity to avoid scams and highlights verified job posts using green shield markers. Verification includes checking that a job listing came from a real employer and curating them based on new posts, jobs closest to a jobseeker, jobs for people without experience, salary information and other factors that the platform is experimenting with.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.\n“Technology has transformed the kinds of jobs being created in Indonesia, but the process of hiring, especially in the blue collar segments, continue to be broken,” said Sequoia India managing director Abheek Anand in a statement. “Pintarnya’s founding team brings years of exceptional experience building tech and financial products to solving this problem, and we are thrilled to partner with them in their journey to help millions of Indonesians realize their full economic potential.”\n5 lessons from ‘Star Wars’ that can transform startup managers’ strategies and tactics"
    },
    {
      "url": "https://www.kantar.com/Campaigns/APAC/Uncovering-the-World-of-Gig-workers-in-Indonesia#:~:text=How%20Large%20Is%20the%20Population,or%20categorized%20as%20business%20owners).",
      "text": "Indonesia benefits from a large productive-age population, fueling economic growth. However, industry innovations and disruptions bring new challenges, particularly for Gig Workers. In a recent study, KANTAR delved deep into one of the most discussed challenges following the boom of workforce and human capital in Indonesia, which is the challenges of Gig Workers. The study seeks to explore and understand the different conditions and partnership models of key sectors and industries such as Transportation and Logistics, Construction, Fisheries, Agriculture, and other various services.\nGig Workers: Flexibility Shadowed by Income Uncertainty and Job Insecurity\nDefining “Gig Workers” varies by context, complicating consensus on a single definition. Generally, Gig Workers can be identified by three main characteristics: they do not receive a regular salary but are paid per task, order, outcome, or hours worked. They work under short-term contracts without full-time employment status, and they have flexible working arrangements, either fully or partially, especially in terms of work schedules. While this flexibility is appealing, it often results in income instability, job insecurity, and unclear boundaries of rights and obligations. This flexibility is indeed one main appeal point for Gig Workers but also lies a more unfortunate flipside of this flexibility, which is observed in the uncertainty and instability in terms of income, job security and clear boundaries of rights-and-obligations.\nThere are 3 distinct aspects used as a framework to identify and differentiate gig workers in Indonesia: Compensations, Contracts, and Flexibility in working. Apart from Compensations and Contracts, which are the shared elements among the various types of Gig Workers, flexibility is proven to be the primary differentiating factor for Gig Workers from other informal workers, and even between Gig Workers themselves.\nHow Large Is the Population of Gig Workers in Indonesia\nThe Indonesian Informal Workers population accounts for approximately 84.2 million people, which, according to the National Labor Force Survey (SAKERNAS or Survei Angkatan Kerja Nasional) rolled out by the Central Agency of Statistics (BPS or Badan Pusat Statistik), represents approximately 60% of the total active labour force. Of this total, there are around 41.6 million Gig/Independent Workers, who make up 50% of the total informal workforce (this distinction is made to differentiate between paid workers and those who are unpaid labourers or categorized as business owners).\nIn Indonesia, Gig Workers mainly populate the Agricultural, Forestry and Fishery sectors, followed by the Retail, Automotive, Manufacturing and Construction sectors respectively. However, the study also identified that Gig Workers in those sectors does not conform strongly with the general definition of Gig Workers and often works under the arrangement as labourers – commonly referred to as unskilled blue-collar workers.\nAmong the independent workers, approximately 39.6 million are identified as blue-collar Gig Workers, distinguishing them from white-collar counterparts. The service industry houses nearly 25% of the aforementioned Gig Workers, where this category notably includes the highly discussed, tech-focused roles like online car and motorcycle hailing services, which make up about 1.8 million or 4.6% of the Gig Workers.\nTherefore, despite the close association of Gig Workers with flexibility and technological openness, a major part of the demographic in Indonesia particularly still resides within the traditional as well as informal sectors that demand intensive physical labour.\nWhat Are the Challenges in the Compensation System and Welfare Protection?\nThe compensation system for gig workers is commonly either of these two: basis of working hours or time-based and or achievement based.\nAn interesting point surfaced among digital tech-based gig workers, where the “profit-sharing” model is particularly prevalent, often observed as a misunderstanding where it is perceived as a “deduction”, subtracted from their actual income, on contrary to its actual definition. This negative perception usually arises due to the lack of understanding from Gig Workers themselves but is also further enabled by a lack of transparency from companies. As a result, Gig Workers often see this payment method, as well as employers, in a negative light.\nGig Workers often miss out on benefits like health insurance, protection from work-related accidents, and opportunities for training or career development. Very few businesses provide full insurance for Gig Workers. Most companies only register them for the BPJS Kesehatan (Indonesian National Health Insurance) program and offer minimal protection against work accidents, particularly in the transportation and logistics sectors. This shows that the welfare of gig workers is far from ideal, especially for those in high-risk jobs.\nWhat Are the Uncertainties for Gig Workers in Indonesia?\nMany Indonesian Gig Workers face challenges due to the absence of written contracts, often relying on verbal agreements without clear terms of rights and responsibilities, especially in the informal sectors. A few groups of Gig Workers have written contracts, typically in digital sectors like Transportation and Logistics. These contracts are usually set up as partnership agreements rather than employment contracts, offering some security and clarity on rights and responsibilities. The lack of written agreements leaves many Gig Workers vulnerable to poor conditions and unfair treatment, as their rights are often overlooked.\nThe Various Degrees of Flexibility Among Gig Workers\nFlexibility has been a key aspect that embodies the uniqueness of gig workers from other informal workers. There are 3 indicators that measure the extent of flexibility in a Gig Worker:\n1. Autonomy - Gig Workers can seek and choose their own work.\n2. Workday Control - Gig Workers can decide whether they wish to work or not, pertaining to workdays.\n3. Time Ownership - Gig Workers can set their own work hours freely and are not bound to any fixed schedules. On top of the 3 main aspects, Gig Workers are Non-Exclusive - not bound by exclusivity towards a certain company, as they are freely able to work with whoever and wherever they want.\nDepending on the level of flexibility, Gig Workers can be separated into 3 groups: Fully Flexible, Partially Flexible, and Non-flexible.\n- Gig Workers who are \"Fully Flexible\" have total control over their activities. They typically work with digital tech companies, such as ride-hailing drivers and online domestic service providers. Conventional taxi drivers and agents also enjoy full flexibility.\n- \"Partially Flexible\" Gig Workers work on shifts, choosing whether to work on a particular day but following a fixed schedule. Examples include bus drivers, hotel receptionists, and third-party logistic couriers.\n- \"Non-Flexible\" Gig Workers have traditional labour setups, despite not being formally recognized as workers or partners. This is common in the construction, agriculture, and fishery sectors, as well as among conventional businesses and service providers.\nOne notable finding is although flexibility is frequently cited as a defining characteristic of gig work, many are actually engaged in the Non-Flexible grouping, where it also covers a significant population out of the top 5 sectors by worker population in Indonesia.\nHow Diverse Are Gig Workers in Terms of Skills and Sectors?\nThe large number of gig workers in Indonesia is extensively spread across different sectors, creating large diversity in the shaping of conditions and groups of Gig Workers. This high variance presents another challenge in coming up with a comprehensive image incorporating every sector and sub-groups involving Gig Workers.\nThe absence of a clear definition of “Gig Workers” amplifies the complexity to determine their exact number and understand their conditions. Different studies define Gig Workers differently, ranging from street vendors to those who use digital technology. However, using an analytical framework based on Compensation, Contracts, and Flexibility, it is evident that Flexibility is the key factor that can help categorize Gig Worker partnership models in Indonesia. This approach gives us a clearer picture of their current state and conditions.\nOne apparent observed trend was how the existence of “digital intermediaries” (usually referring to digital-tech based companies and services such as food delivery applications or ride-hailing applications) helps enable Gig Workers to achieve Category 1 Full Flexibility. Additionally, they tend to also provide a clear cooperative agreement as partners for Gig Workers.\nIs There a Clear Direction for the Welfare of Gig Workers?\nDespite the high flexibility of Gig Workers, a major portion of these workers in Indonesia are still facing less ideal welfare, primarily in high-risk sectors. In more “traditional/conventional” sectors such as Agriculture, Fishery and Construction, there are almost no written agreements implemented. This shows that despite Gig Workers' appeal primarily in their flexibility, working conditions still would prove to be their largest challenge, particularly in less regulated sectors.\nAlthough recent labor law changes have complicated conditions for gig workers, specific regulations addressing their needs are still lacking. Established digital platforms have introduced welfare programs to support gig workers, but achieving a balance that sustains livelihoods and provides necessary protections remains a challenge. This calls for collaboration between public and private sectors in policy making and problem-solving to adapt to the evolving global labor landscape.\nAbout this study\nThis study employed a mixed methodology to explore gig worker partnership models in Indonesia. Primary research comprised 16 Focus Group Discussions (FGDs) with Gig Workers from diverse sectors, providing firsthand insights into their experiences and challenges. Complementing this, In-Depth Interviews (IDIs) were conducted with six employers or intermediaries to garner their perspectives on partnership models and Gig Worker management. Additionally, the research included discussions with a panel of academic experts from top Indonesian universities and labour union representatives to understand the regulatory, policy, and social dynamics affecting gig workers.\nSecondary research involved analysing data from the National Labor Force Survey (SAKERNAS) managed by BPS to estimate the number and distribution of Gig Workers across various sectors. This was supplemented by online research to provide a comprehensive analysis. These combined efforts aim to offer informed recommendations for developing inclusive and sustainable work policies and practices for Gig Workers in Indonesia.\nTo learn more about Kantar Indonesia's capabilities or if you would like to explore potential collaborations, we are always open for discussion on how our qualitative insights can create a meaningful impact for you, your brand, or your business. Reach out to Putu at putu.aditya@kantar.com or Abimanyu at raihan.abimanyu@kantar.com.\nPutu Aditya\nQualitative Associate Director at Kantar Insights Indonesia\nRaihan Abimanyu\nQualitative Research Manager at Kantar Insights Indonesia\n*However, due to the lack of any definitive categorization relating to ‘Digital tech-based/Online Transportation Workers’ from SAKERNAS, the mentioned figure can and will fluctuate when accounting for individuals who may work part-time as online car/motorcycle hailing services and or individuals who works multiple jobs and didn’t declare or mention his or her online car/motorcycle hailing services job in the survey."
    },
    {
      "url": "https://www.brookings.edu/articles/accelerating-growth-in-indonesia-an-industrial-policy-for-the-rural-informal-sector/#:~:text=They%20do%20not%20register%20to,selected%20locations%20as%20specified%20below.",
      "text": "Informality is often likened to a persistent low-grade fever; it drains resources and stifles growth. The small scale, technological limitations, and low productivity of informal enterprises weigh heavily on the economy, leaving policymakers grappling for solutions.\nIn Indonesia, the cost of informality is coming into sharper focus as the Prabowo administration seeks to accelerate economic growth. With poverty eradication also high on the agenda, rural informality demands particular attention.\nThis blog examines how a fresh approach to the rural informal sector could unlock national economic growth. Specifically, it explores how rural industrialization—driven by an industrial policy tailored to the informal economy—could be a catalyst for faster development.\nInformality in Indonesia\nIndonesia’s informal sector accounts for 36% of GDP, and an astonishing 59% of the nation’s 144 million workers are engaged in informal activities. Informality in rural Indonesia is typical of other Southeast Asian countries. Most activities are small-scale employing less than 5 workers and self-employment is common, production whether of goods or services is labor intensive, workers are generally unskilled or semi-skilled, more women than men are engaged in informal activities, productivity and earnings are well below those of workers in the formal sector, and representation is higher in the services sector (e.g., retail, transport, repair, hospitality). Informal units are not subject to official regulation or taxation and do not benefit from the social safety net, if any. They do not register to avoid taxes, and because they are reluctant to grow or borrow from the formal banking system.\nWith the Prabowo government aspiring to grow the economy by 8% per annum while eradicating poverty, there is an urgent need to reduce informality and facilitate the transition of resources from the informal to the formal economy. The elusive goal is a policy package that could spark a virtuous cycle: boosting the productivity of informal businesses, enhancing their contribution to economic growth and ultimately integrating them into the formal sector. We believe that the industrialization of the rural informal sector might do the trick, but this will require a rethink of the policies required for support.\nIndustrial policy for the rural informal sector aims to develop manufacturing activities in selected rural areas that initially meet local demands for processed foodstuffs, household goods, paper and ceramic products, construction materials, agricultural chemicals, and other items. These would create non-farm jobs and once they acquire traction, could be scaled up with successful businesses merging with the formal sector. To succeed, it would need to be trialed in carefully selected locations as specified below.\nLessons from international models\nThe experiences of China and Taiwan offer support. In both these economies, the modernization of agriculture and the emergence of rural manufacturing activities raised labor productivity, serviced many of the requirements of the local population, increased the investible surplus, and generated exports.\nIn China, the decollectivization of agriculture in the late 1970s raised land productivity and permitted township and village enterprises (TVEs) to proliferate. Supported by local authorities, the number of TVEs increased from zero in 1978 to 17 million in 1988. These informal enterprises initially met rural demand for machinery, inputs, and consumer goods. This was partly responsible for the increase in the average annual growth of agricultural output from 2.9% in 1952-1978 to 6.3% between 1978 and 1987. The mushrooming of TVEs also boosted by 2% or more China’s GDP growth from the 6.5 average rate during 1980-1981 to 11.47% from 1982 to 1988. As incomes rose, TVEs expanded into construction materials, consumer durables, and subcontracting for urban state-owned enterprises (SOEs). By the mid-1980s, they were key exporters that fueled China’s rapid growth. In the 1990s, many evolved into large firms within the formal sector, driving in situ urbanization as villages transformed into towns and cities through manufacturing.\nTaiwan underwent a similar transformation, starting from a stronger agricultural base shaped by Japanese colonial policies (1895–1945). In the 1950s and 1960s, a modernizing agriculture sector generated high-value exports of vegetables, fruit, tea and sugar, and spurred small-scale informal manufacturing, laying the foundation for Taiwan’s SME-driven growth. Initially focused on food processing and agricultural tools, SMEs expanded into textiles, bicycles, and appliances, and by the 1970s, they were producing higher-value electronics and machinery. Like South Korea, Taiwan’s success was tied to export-led industrialization, with early growth rooted in the rural informal economy, similar to China.\nStrategic Recommendations for Indonesia\nIndonesia’s agriculture is a major economic force producing palm oil, rubber, coffee, cocoa, tea, fruit, spices, rice and other staples for export and domestic consumption. Large plantations coexist with smallholder agriculture and together they comprise a substantial market for agricultural inputs, machinery, consumer goods and construction materials for infrastructure and housing. Currently most of these are procured from urban suppliers or imported. More than one half of the informal workforce—43.5 million people—is rural.\nFollowing the example of China, Taiwan, and countries in Latin America where agriculture is a leading sector, Indonesia could add 1-2 percentage points per annum to its longer-term growth rates. This can be accomplished by strategically implementing an industrial policy for the rural informal sector, leveraging the large informal workforce currently adding little value, and taking advantage of ongoing electrification. As in China, at first, rural industry would be servicing mostly local or provincial demand and increasing the productivity especially of smallholders, which is well below that of plantations and a fraction of the theoretical maximum. As it moves up the learning curve, acquires scale and some firms become formalized, rural industry could complement and add value to the exports of agricultural commodities.\nChina demonstrated the advantage of first testing a policy in a selected locale and working out the kinks before implementing it more broadly. A phased approach would be the prudent course for Indonesia as well. The experimental rollout of an industrial policy for the rural informal sector should be in a region with (1) a large modernizing agricultural system; (2) a well-staffed local government with implementation capacity and a strong revenue record; (3) a labor force with baseline education and technical skills; and (4) adequate infrastructure.\nA pilot in either Java or Sumatra in the vicinity of a city such as Medan would be ideal. This would permit nascent rural industry to benefit from urban services and develop a supply chain.\nThe support to the rural informal sector must take account of existing programs, assess their impact to date, learn from successes and failures and use them where appropriate to buttress rural industrialization. In addition, it would be important to identify and involve the major stakeholders, such as foreign companies, NGOs, research, education and training institutions, and cooperatives.\nA coordinated targeting of the principal drivers and bottlenecks would impart the needed momentum. A strong local government with the backing of the center must play an active role, devise a workable strategy, and test instruments to stimulate start-up activity. Targeting will be guided by the composition of agricultural activities and crop yields, and the sophistication and productivity of current activities. Manufacturing is more likely to flourish where agriculture is being “industrialized,” with increased use of machineries, chemical and biological inputs, and modern capital-intensive techniques of planting, harvesting, and downstream processing (e.g., palm oil, rubber, rice, fruit, and other food crops).\nOne important initiative would be to scale up (public and private) venture capital for start-ups, building on an existing program. This could include creating a few publicly owned firms in selected activities to demonstrate opportunities and technologies and help train and spur local entrepreneurship. Incubators and accelerators tailored to opportunities and available skills in rural areas could enlarge the population of young firms. Low and medium tech activities can benefit from incubators just as much as high tech activities.\nSupport to the transport and digital sectors, which directly facilitate manufacturing activities in the pilot areas, could ease bottlenecks. Such investments coordinated with the plantation sector would give rise to demand for construction materials and to jobs. An efficient transport system would reduce time to market and absorb more workers into productive employment. This would create openings for informal enterprises to supply both goods and services. Digital infrastructure plus some training would widen e-commerce market channels for rural firms, some of which already have a digital presence. China’s Rural Taobao Program can be a point of reference.\nFrom pilot to policy\nAn industrial policy for the rural informal sector could deliver quick wins. As with any policy, success is not guaranteed, but a pilot project is a low-cost option that can be adjusted or discontinued if necessary. However, if successful, it could pave the way for broader rural industrialization across Indonesia and transform informal enterprises into a driving force for economic growth.\n-\nAcknowledgements and disclosures\nOpinions are solely those of the authors. The authors gratefully acknowledge comments from Homi Kharas, Tshering Lhamo, Sujala Pant, Norimasa Shimomura, Juliaty Sopacua, and Zhu Linghui. This blog builds on BOLD—“Building Opportunities for Leadership in Development”—UNDP’s new high-level advisory program designed to drive bold shifts in development strategy amid a rapidly evolving landscape.\nThe Brookings Institution is committed to quality, independence, and impact.\nWe are supported by a diverse array of funders. In line with our values and policies, each Brookings publication represents the sole views of its author(s).\nCommentary\nAccelerating growth in Indonesia: An industrial policy for the rural informal sector\nMarch 7, 2025"
    },
    {
      "url": "https://techcrunch.com/events/tc-disrupt-2025/?utm_source=tc&utm_medium=ad&utm_campaign=disrupt2025&utm_content=ticketsales&promo=tc_inline_rb&display=",
      "text": "TechCrunch Disrupt 2025\nTechCrunch Disrupt is where you’ll find innovation for every stage of your startup journey. Whether you’re a budding founder with a revolutionary idea, a seasoned startup looking to scale, or an investor seeking the next big thing, Disrupt offers unparalleled resources, connections, and expert insights to propel your venture forward.\nFind innovation for every stage at Disrupt 2025\nFrom idea to IPO, Disrupt 2025 will map out the path for startups to achieve their next major milestone.\nJoin 10,000 startup and VC leaders\nLooking to meet founders, connect with investors, seek advice, or land your next big role? Disrupt is the must-attend event to make it all happen in person.\nBuild and scale your business faster\nDisrupt is more than a startup launchpad — it’s a growth accelerator. Dive into sessions on scaling, sales, and leadership, and connect with the investors and tech experts who can help take your business to the next level.\nGain insights from today’s tech giants\nTap into the wisdom of founders and tech titans at Disrupt. From actionable tips to hard-won lessons, they’ll share what works (and what doesn’t) to guide you as you build your own path forward.\nDisrupt 2025 speakers\nPartner Sequoia Capital\nChief Technology Officer US Dept of Navy\nCEO and Co-Founder Writer\nChief Product Officer Netflix\nCEO Wayve\nCo-Founder & CEO Box\nFounder and CEO Pinecone\nCo-CEO Waymo\nCo-Founder ElevenLabs\nCaptain of Moonshots X, The Moonshot Factory\nI’ve always thought, “What can I do that opens up possibilities?” I grew up in South Africa and went to an Afrikaans high school, and we didn’t speak English at home. But I pushed myself to go to an English-speaking university, and that opened up a door. Then I chose to work for McKinsey, because I thought it would open another door and maybe I’d get a chance to work overseas. I was reading about what was happening in Silicon Valley in the mid 90s, before I came to the U.S. Already, I’m starting to see the beginnings of the internet. Did I fathom how big it would be? Absolutely not. I didn’t know what venture capital was. I didn’t know that I would join a startup. I just had an intuition that I needed to be here. A friend of mine introduced me to Elon in 1999 and I joined PayPal. Then when Mike Moritz asked me to come interview at Sequoia, that was just another door opening. Where might this one lead? Whenever I interview people, I ask about those key moments in somebody’s life where they’ve made career decisions. And I think about companies in the same way—there are these crucible moments that have an enormous bearing on ultimate outcomes.\nRoelof's Sessions\nWhat Sequoia Sees Coming Next\nAs one of the most influential VCs of the modern era, Roelof Botha has seen it all; booms, busts, and billion-dollar breakout bets. In this fireside chat, the Sequoia Capital managing partner opens up about how today’s most ambitious founders are navigating AI, geopolitics, and a shifting capital landscape.\nJustin Fanelli is the Chief Technology Officer for the Department of the Navy and Technical Director of PEO Digital, driving measurable technology improvements and secure, high-performance digital transformation. He champions private-public collaboration to deliver innovation with unprecedented value. Fanelli advises numerous national science and technology boards and has held key roles including Chief Architect for Defense Health, DARPA Service Chiefs Fellow, and Chief Systems Engineer for Joint Command and Control. He teaches at Georgetown and has lectured all over the country at CMU, MIT, Stanford and others. He recently gave a TED Talk on innovation adoption and the Innovation Adoption Kit covered by TechCrunch, Forbes, CSIS and others. Fanelli holds engineering degrees from Penn State and the University of Pennsylvania and is a Senior Executive Fellow at Harvard Kennedy School. He’s been an angel investor, VC and has been privileged to serve on public and private boards. His work has earned national awards including the Etter Award, Fed100, Defense50, and CMMI Project of the Year. He lives in Arlington, VA and enjoys book recommendations.\nJustin's Sessions\nAI and National Security in the High-Stakes Race to Innovate\nFrom defense labs to Wall Street and naval operations, AI is reshaping how countries protect themselves and project power. DARPA’s Kathleen Fisher, Point72’s Sri Chandrasekar, and Navy CTO Justin Fanelli dive into the cutting-edge AI breakthroughs driving security innovation. They’ll discuss what it means for entrepreneurs, investors, and the future of global stability.\nMay Habib is the CEO and co-founder of Writer, a leader and pioneer in enterprise AI. With Writer’s end-to-end AI agent platform, hundreds of companies like Accenture, Mars, Uber, and Vanguard are building and scaling AI agents that are grounded in their company’s data and fueled by Writer’s enterprise-grade LLMs. From faster product launches to deeper financial research to better clinical trials, companies are quickly transforming their most important business processes for the AI era in partnership with Writer. Writer houses the world’s only enterprise-specific AI research lab. Its family of enterprise-grade Palmyra LLMs includes state-of-the-art frontier models, as well as self-evolving, open-source, and domain-specific models. Palmyra models define industry-leading standards for enterprise-grade transparency, reliability, safety, efficiency, and observability. May is an expert in natural language processing and AI-driven language generation. She has led Writer to become one of the world’s fastest-growing generative AI companies, securing its position as a Forbes 50 AI company and inclusion in the World Economic Forum’s Unicorn Community. Founded in 2020 with its headquarters in San Francisco and offices around the globe, Writer is backed by world-leading investors, including Premji Invest, Radical Ventures, ICONIQ Growth, Insight Partners, Balderton, B Capital, Salesforce Ventures, Adobe Ventures, Citi Ventures, IBM Ventures, and others. May and the Writer team have raised over $326M in funding at a valuation of $1.9B. May graduated with high honors in Economics from Harvard University. She is a World Economic Forum Young Global Leader, a Fellow of the Aspen Global Leadership Network, a recipient of Inc.’s Female Founder Award, and one of Worth’s Groundbreaking Women for 2025.\nMay's Sessions\nWriting the Future with AI?\nWhat happens when AI learns to write with purpose, personality, and persuasion? Writer CEO May Habib joins us to talk about the evolving relationship between language and machines and what the rise of generative content means for the future of brand, business, and beyond.\nEunice Kim was named Chief Product Officer in October 2023. She previously led the company’s global Consumer Product Innovation team. Eunice joined Netflix in early 2021 after having spent 10 years in product leadership roles at Google Play and YouTube. Prior to Google, she worked at several tech startups as well as PepsiCo and Adobe Systems. Eunice holds a B.A. from Columbia University and an M.B.A. from the University of Chicago Booth School of Business. She serves on the Board of Directors for Cure CMD.\nEunice's Sessions\nWhat's Next for Netflix and for Streaming Itself\nAs CPO of Netflix, Eunice Kim is steering the future of entertainment for hundreds of millions of users. In this fireside chat, Kim will break down how Netflix is evolving its product strategy—from personalized discovery to global growth, from ad tiers to gaming. We’ll explore how Netflix is adapting to a shifting content landscape, what it means to innovate at massive scale, and what design surprises Netflix has up its sleeve. For anyone building consumer experiences, this will be a masterclass.\nAlex co-founded Wayve in 2017 to reimagine autonomous mobility through embodied intelligence. From his award-winning research at the University of Cambridge, he seized the opportunity to use deep learning to pioneer an entirely new way to solve self-driving. He showed for the first time that it was possible to teach a machine to understand where it is and what’s around it and then give it the “intelligence” to make its own decisions based on what it sees with computer vision. As CEO, Alex is responsible for the company’s overall strategy, primarily focusing on establishing all necessary ingredients to develop and deploy AV2.0 globally. He also works closely with our partners and investors to ensure that our technology is commercially viable and can be widely adopted. Under Alex’s leadership, Wayve is fast becoming one of the most exciting companies in the autonomous vehicle industry. Before founding Wayve, Alex’s passion for autonomous vehicles began as a research fellow at the University of Cambridge, where he earned his PhD in Computer Vision and Robotics. His research has received numerous awards for scientific impact and made significant contributions to the field of computer vision and AI. He was selected on the Royal Academy of Engineering’s SME Leaders Programme and named on the Forbes 30 Under 30 innovators list.\nAlex's Sessions\nDriving Intelligence\nFrom self-driving cars to self-learning systems, Alex Kendall is rethinking how machines perceive and act in the world. The Wayve CEO joins us to explore how real-world autonomy is shaping the next chapter of AI, and why breakthroughs on the road may unlock progress far beyond it.\nAaron Levie is Chief Executive Officer, Cofounder at Box, which he launched in 2005 with CFO and cofounder Dylan Smith. He is the visionary behind the Box product and platform strategy, incorporating the best of secure content collaboration with an intuitive user experience suited to the way people work today. Aaron leads the company in its mission to transform the way people and businesses work so they can achieve their greatest ambitions. He has served on the Board of Directors since April 2005. Aaron attended the University of Southern California from 2003 to 2005 before leaving to found Box.\nAaron's Sessions\nSurvive, Scale, Reinvent: Lessons from a Cloud OG\nAaron Levie built Box before cloud was cool and the company is still thriving while competitors have come and gone. Known for his sharp takes and startup instincts, Levie joins us to unpack how to keep innovating inside a public company, the possibilities AI and agents bring to enterprise software, and why reinvention is the name of the game in tech right now. Expect real talk and a playbook for building companies that last in the world of AI.\nEdo Liberty is the founder and CEO of Pinecone whose mission is to make AI knowledgeable. Pinecone is the leading vector database for building accurate and performant AI applications at scale in production. Prior to founding Pinecone, Edo was a Director of Research at AWS and Head of Amazon AI Labs where his team worked on data systems and services including SageMaker and OpenSearch. Before AWS, Edo was a Senior Research Director at Yahoo and Head of Yahoo’s Research Lab in New York. As an adjunct professor at Princeton and Tel Aviv University, Edo taught long-term memory in AI and data mining. His academic work focuses on numerical linear algebra, streaming algorithms, data mining, and mathematical foundations of machine learning. Edo holds a B.Sc in physics and computer science from Tel Aviv University, and a Ph.D. in computer science from Yale. He has authored more than 75 academic papers and patents.\nEdo's Sessions\nWhy the Next Frontier Is Search\nIn a world overflowing with data, finding what matters is everything. Pinecone founder Edo Liberty unpacks why infrastructure, not algorithms, might be the biggest unlock in AI, and what’s coming next in the race to power smarter applications at scale.\nTekedra N. Mawakana is the co-CEO of Waymo, an autonomous driving technology company. As co-CEO, Tekedra oversees the company’s strategy for the wide adoption of the Waymo Driver. She boasts 20+ years of experience advising consumer technology companies to advance their business interests globally. Tekedra currently serves on the Board of Directors for Intuit and the Advisory Council for Boom Technology. She is a social impact-focused angel investor and an Advisor and LP with the Operator Collective.\nTekedra's Sessions\nThe Self-Driving Reality Check\nAutonomous vehicles have been “just around the corner” for years—until now. Tekedra Mawakana, Co-CEO of Waymo, takes the Disrupt Stage to talk about where AVs actually stand, what it’s taken to get to real deployments, and why the race isn’t just about tech, it’s about trust. From regulation to rider experience to competition with Tesla and Tesla-adjacent hype, this conversation gets real about what’s next in mobility.\nMati Staniszewski is the co-founder and CEO of ElevenLabs, a research company building audio AI tools to solve audio intelligence and make digital interactions feel more human — with voice as the most direct path to that. Before founding ElevenLabs, Mati worked at Palantir as a Deployment Strategist, managing large-scale implementations across public and private sectors, and at BlackRock, where he helped launch the Aladdin Wealth platform.\nMati's Sessions\nSynthetic Voices and Real Impact\nFrom audiobooks to avatars, synthetic speech is having a moment. ElevenLabs is helping lead the charge. CEO Mati Staniszewski joins us to explore what it takes to build AI that speaks like us and how voice technology is reshaping the creative industries, accessibility, and entertainment.\nDr. Astro Teller currently oversees X, Alphabet’s moonshot factory for building breakthrough technologies and businesses designed to help tackle huge problems in the world. Before joining Google / Alphabet, Astro was the co-founding CEO of Cerebellum Capital, Inc, an investment management firm whose investments are continuously designed, executed, and improved by a software system based on techniques from statistical machine learning. Before his tenure as a business executive, Dr. Teller taught at Stanford University and was an engineer and researcher for Phoenix Laser Technologies, Stanford’s Center for Integrated Systems, and The Carnegie Group Incorporated. Dr. Teller holds a Bachelor of Science in computer science from Stanford University, Masters of Science in symbolic and heuristic computation, also from Stanford University, and a Ph.D. in artificial intelligence from Carnegie Mellon University, where he was a recipient of the Hertz fellowship.\nAstro's Sessions\nMoonshots, AI, and the Future of Alphabet\nFrom self-driving cars to internet balloons to AI-fueled breakthroughs, Astro Teller leads the lab where Alphabet incubates the nearly impossible. In this rare Disrupt stage appearance, he shares what’s actually working inside X, why “failing fast” isn’t just a mantra, and how moonshots may evolve in the AI age. If you think your startup is ambitious, wait until you hear what he’s launching next.\nMore reasons to attend Disrupt\nFind Your Ticket Type\nFind the ticket type that fits you best with up to $600+ savings. Groups can save up to 30%.\nLatest TechCrunch Disrupt 2025 news\nPress/Media Passes\nEvery year, hundreds of top media outlets cover TechCrunch Disrupt — from independent reporters to veteran TC hosts. It’s where the brightest voices in tech gather. Follow the steps below to apply for your free media pass.\nTechCrunch Disrupt regularly partners with leading voices across tech, startups, and beyond. As a Creator Partner, you’ll receive free passes and the chance to amplify Disrupt 2025 with a discount to your audience.\nPartner with TechCrunch\nTechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. Get in touch with us to learn more.\nLocation\nUpcoming TechCrunch events\n-\nGet on waitlist to get exclusive early access to limited tickets!\nTechCrunch Disrupt 2025 is innovation for every stage\n10,000+ tech leaders. 250+ sessions. 200+ speakers. 3 days. 6 stages. One epic experience of insights, strategy, and connections. Save up to $600+ before rates increase.\nSubscribe\nEvent Updates\nGet the latest event announcements, special discounts and other event offers.\nPartner with TechCrunch\nTechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. Get in touch with us to learn more."
    },
    {
      "url": "https://techcrunch.com/2021/04/05/singapore-based-career-platform-glints-gets-22-5m-in-series-c-funding/",
      "text": "Glints, the Singapore-based career platform, announced today it has raised $22.5 million in Series C funding led by Japanese human resources management firm PERSOL Holdings. The new capital will be used on Glints’ expansion in Singapore, Indonesia, Vietnam and Taiwan and hiring for its product and engineering teams.\nGlints co-founder and chief executive officer Oswald Yeo said this is the largest funding round to date for a talent platform in Southeast Asia, and brings the startup’s total raised to $33 million. Other participants included returning investors Monk’s Hill Ventures, Fresco Capital, Mindworks Ventures, Wavemaker Partners, Flipkart co-founder Binny Bansal and former Goldman Sachs TMT China head and partner Xiaoyin Zhang.\nFounded in 2013, Glints says it has been used by more than 1.5 million professionals and 30,000 organizations, including Gojek, Tokopedia, Starbucks and Mediacorp. Most of its current users are from the tech and financial services sectors, but Glints has a “broad horizontal focus on young to mid-level professionals,” and its long-term goal is to be sector agnostic, Yeo told TechCrunch.\nCakeResume, which wants to become Asia’s largest tech talent pool, raises $900,000 seed round\nOne of the ways Glints differentiates from other job platforms active in its markets, like LinkedIn, JobStreet and CakeResume, is by building a “full-stack” of services for people who want to advance their careers. In addition to its job marketplace, which the company says has more than 7,000 active listings and 4 million visitors each month, Glints also offers community features and skills education, like online classes.\nOne of Glints’ value propositions is helping companies, especially in tech, cope with the regional talent shortage, a topic it recently covered in a comprehensive report with Monk’s Hill Ventures.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.\nOne of the solutions the report highlighted is hiring teams based in different Southeast Asian countries to address talent crunches in specific markets, like Singapore. Glints says its cross-border remote work hub, TalentHub, doubled its business in 2020 as the pandemic also made employers more open to hiring remotely."
    }
  ],
  "argos_summary": "Pintarnya, an Indonesian employment platform that blends AI‑powered job matching with financial services for blue‑collar workers, secured a $16.7 million Series A led by Square Peg and backed by Vertex Venture and East Ventures. The startup, founded in 2022, serves over 10 million job seekers and 40,000 employers, offering secured loans backed by collateral such as gold and electronics to address the informal workforce’s limited access to credit. With revenue growing five‑fold YoY, Pintarnya aims to break even by year‑end and expand its platform and financial offerings regionally. The funding will strengthen technology, broaden services, and support growth in Indonesia’s large informal labor market.",
  "argos_id": "OHGS60LMZ"
}