{
  "url": "https://finance.yahoo.com/news/mizuho-mufg-join-race-japans-010243345.html",
  "authorsByline": "Iain Withers and Anton Bridge",
  "articleId": "2c5a1ea52ecf4ddb8e2a595f604ee82d",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/reuters-finance.com/64f06edfe0ffd01a0bf3b125bf0e164a",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T01:02:43+00:00",
  "addDate": "2025-08-25T01:10:23.595499+00:00",
  "refreshDate": "2025-08-25T01:10:23.595502+00:00",
  "score": 1.0,
  "title": "Mizuho, MUFG join race by Japan's banks for money manager deals overseas",
  "description": "LONDON/TOKYO (Reuters) -Japanese banks Mizuho and MUFG are targeting buying or partnering with overseas money managers, they told Reuters, joining other Japanese financial companies aiming for a larger share of the global investing market.  Mizuho is prioritising a tie-up with a private asset specialist in Europe or the United States to give it a foothold in areas such as the booming credit market or infrastructure financing, an executive told Reuters.  MUFG, meanwhile, has identified overseas asset management - particularly in the United States and Europe - as a priority area for potential deals, the company said.",
  "content": "LONDON/TOKYO (Reuters) -Japanese banks Mizuho and MUFG are targeting buying or partnering with overseas money managers, they told Reuters, joining other Japanese financial companies aiming for a larger share of the global investing market.\n\nMizuho is prioritising a tie-up with a private asset specialist in Europe or the United States to give it a foothold in areas such as the booming credit market or infrastructure financing, an executive told Reuters.\n\nMUFG, meanwhile, has identified overseas asset management - particularly in the United States and Europe - as a priority area for potential deals, the company said.\n\nThe banks, two of the largest in Japan, collectively manage about $1.3 trillion through their asset management arms, largely for local clients. They declined to comment on whether discussions with target companies had already taken place and there is no certainty transactions will happen.\n\nJapan's largest financial groups have become increasingly acquisitive overseas as they contend with sluggish growth at home due to an ageing and shrinking population.\n\nThe government and regulators are also pursuing reforms aimed at establishing Japan as a leading asset management centre, with the relatively stable fee income on offer from money management proving a key selling point.\n\nNomura acquired Macquarie Group's U.S. and European public asset management businesses for $1.8 billion in April. Insurers Dai-ichi Life and Meiji Yasuda have also acquired or taken stakes in overseas firms this year.\n\nMizuho and MUFG's investment divisions - which offer a mix of passive and actively-managed funds - currently have limited international operations focused primarily on distributing Japanese equities funds.\n\n\"We definitely are keeping an eye on any potential opportunities... It might be a partnership, it might be an acquisition, nothing is decided as of this point,\" said Oleg Kapinos, London-based head of global distribution strategy for Mizuho's investments arm AM One, which manages about $489 billion.\n\nThe Japanese companies could face challenges executing successful deals in an investment industry that has seen many takeovers go awry. There is also fierce competition for prized assets in hot sectors such as private markets, where deep-pocketed giants like BlackRock are active.\n\n\"The buying opportunities are fairly rare and when there is an attractive asset it is likely to attract a lot of attention,\" Kapinos said.\n\nMUFG Asset Management (MUFG AM) is looking for \"attractive non-organic growth opportunities\" alongside growing in the first place its existing business, a spokesperson said. Just a fifth of its 120.7 trillion yen ($818 billion) of assets under management are from outside Japan, the company said.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "overseas asset management",
      "weight": 0.10804316
    },
    {
      "name": "prized assets",
      "weight": 0.087145545
    },
    {
      "name": "assets",
      "weight": 0.08571094
    },
    {
      "name": "money management",
      "weight": 0.08567992
    },
    {
      "name": "other Japanese financial companies",
      "weight": 0.077584326
    },
    {
      "name": "overseas money managers",
      "weight": 0.0739436
    },
    {
      "name": "management",
      "weight": 0.073732495
    },
    {
      "name": "attractive non-organic growth opportunities",
      "weight": 0.07258809
    },
    {
      "name": "money manager deals",
      "weight": 0.07200131
    },
    {
      "name": "MUFG AM",
      "weight": 0.07154081
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97705078125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.8583984375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.837890625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.83447265625
    },
    {
      "name": "/Finance/Banking/Other",
      "score": 0.79052734375
    },
    {
      "name": "/Finance/Credit & Lending/Other",
      "score": 0.302490234375
    }
  ],
  "sentiment": {
    "positive": 0.18994324,
    "negative": 0.22975594,
    "neutral": 0.5803008
  },
  "summary": "Japanese banks Mizuho and MUFG are targeting deals with overseas money managers, joining other Japanese financial companies in their quest to a larger share of the global investing market. Both banks, two of the largest in Japan, are prioritising partnerships with private asset specialists in Europe or the United States to gain access to areas such as the booming credit market or infrastructure financing. MUFG has identified overseas asset management as a priority area for potential deals. The banks, which manage about $1.3 trillion through their asset management arms, declined to comment on whether discussions with target companies had already taken place.",
  "shortSummary": "Japanese banks Mizuho and MUFG are exploring overseas asset management, aiming to expand their operations despite domestic economic challenges and high competition.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "60b7812397db42c88d6dc67ddec41ece",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Japanese banks Mizuho and MUFG are looking to acquire or partner with overseas money managers to expand their global footprint amid sluggish domestic growth. Mizuho seeks a tie‑up with a private asset specialist in Europe or the U.S. to enter credit and infrastructure markets, while MUFG prioritises U.S. and European asset‑management deals. Both banks manage roughly $1.3 trillion in assets, mostly for local clients, and face competition from global giants like BlackRock. The move aligns with government reforms to position Japan as a leading asset‑management centre.",
  "argos_id": "PA57YBYVQ"
}