{
  "url": "https://www.digitaltrends.com/space/spacex-launches-to-iss/",
  "authorsByline": "Trevor Mogg",
  "articleId": "413b80329a514af28c2b6dfaaf4a0986",
  "source": {
    "domain": "digitaltrends.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "OR",
      "county": "Multnomah County",
      "city": "Portland",
      "coordinates": {
        "lat": 45.5202471,
        "lon": -122.6741949
      }
    }
  },
  "imageUrl": "https://www.digitaltrends.com/wp-content/uploads/2025/08/spacex-resupply-ISS-mission.jpg?resize=1200%2C630&p=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T20:06:40-07:00",
  "addDate": "2025-08-25T03:10:00.041486+00:00",
  "refreshDate": "2025-08-25T03:10:00.041488+00:00",
  "score": 1.0,
  "title": "Starship launch was scrubbed. Watch the earlier one SpaceX pulled off on Sunday",
  "description": "Starship engineers are eager to match the reliability of SpaceX's workhorse Falcon 9 rocket.",
  "content": "With less than an hour to go before launch, SpaceX scrubbed the 10th launch of the Starship — the largest rocket ever to fly — on Sunday.\n\nThe scrub came as a big disappointment for the many people watching in person close to the launch site at SpaceX’s Starbase facility in Boca Chica, Texas, as well as for those watching online. The company said it needed time “to troubleshoot an issue with ground systems,” and has yet to announce a new launch schedule for the 121-meter-tall rocket.\n\nStill, much earlier in the day, at 2:45 a.m. ET, SpaceX managed to launch its 33rd commercial resupply mission to the International Space Station (ISS) from Cape Canaveral in Florida. The mission used SpaceX’s workhorse Falcon 9 rocket and a Dragon spacecraft carrying more than 5,000 pounds of supplies for the orbital outpost. Generating just 1.7 million pounds of thrust at launch — compared to the 17 million produced by the mighty Starship — the Falcon 9 may lack the spectacle of SpaceX’s next-gen rocket, but it has a level of reliability that Starship engineers are keen to match.\n\nYou can watch the Falcon 9 lift off in the video clip below:\n\nAround eight minutes after launch, the first-stage booster returned to a droneship waiting in the ocean just off the coast of Florida. Here’s some footage showing the booster touching down.\n\nThe perfect landing means the booster can now be refurbished and used for another flight.\n\nSunday’s mission marked the seventh flight of this particular booster, having previously launched O3b mPOWER-E, Crew-10, Bandwagon-3, O3b mPOWER-D, and two Starlink missions.\n\nThe Dragon will take about 28 hours to reach the space station, where it’s expected to dock on Monday at around 7:30 a.m. ET. Besides delivering food and science experiments for the crew, the capsule will also perform a reboost operation to demonstrate its ability to help sustain the station’s altitude, which slips over time.\n\nThe Dragon will remain docked at the ISS for about four months, after which it’ll return to Earth with research equipment and cargo, splashing down off the coast of California.",
  "medium": "Article",
  "links": [
    "https://twitter.com/SpaceX/status/1959509871038242996?ref_src=twsrc%5Etfw",
    "https://t.co/aD3fKAZeHN",
    "https://twitter.com/SpaceX/status/1959507875384160629?ref_src=twsrc%5Etfw",
    "https://www.digitaltrends.com/space/starship-10th-launch-weather/",
    "https://www.digitaltrends.com/space/spacex-scrubs-sundays-launch-attempt-of-starship-rocket/",
    "https://t.co/RtepEflEpe"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Starship launch",
      "weight": 0.096989825
    },
    {
      "name": "launch",
      "weight": 0.08170887
    },
    {
      "name": "SpaceX",
      "weight": 0.07863342
    },
    {
      "name": "Starship engineers",
      "weight": 0.06908854
    },
    {
      "name": "Starship",
      "weight": 0.06250252
    },
    {
      "name": "Dragon",
      "weight": 0.057678014
    },
    {
      "name": "research equipment",
      "weight": 0.054249432
    },
    {
      "name": "science experiments",
      "weight": 0.05411614
    },
    {
      "name": "ISS",
      "weight": 0.05384371
    },
    {
      "name": "ground systems",
      "weight": 0.053367075
    }
  ],
  "topics": [
    {
      "name": "Space"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.71142578125
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Space Technology",
      "score": 0.70556640625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.65283203125
    },
    {
      "name": "/Science/Astronomy",
      "score": 0.52294921875
    },
    {
      "name": "/News/Other",
      "score": 0.370361328125
    }
  ],
  "sentiment": {
    "positive": 0.24964553,
    "negative": 0.22126988,
    "neutral": 0.52908456
  },
  "summary": "SpaceX has postponed its 10th launch of the Starship, the largest rocket ever to fly, due to an issue with ground systems. The cancellation of the launch was a major disappointment for many people watching near the launch site and online. However, earlier in the day, SpaceX managed to launch its 33rd commercial resupply mission to the International Space Station using a Falcon 9 rocket and a Dragon spacecraft carrying more than 5,000 pounds of supplies. The company has yet to announce a new launch schedule for the 121-meter-tall rocket. The Falcon 9 has previously launched O3b mPOWE, Crew-10, Bandwagon-3, and two Starlink missions.",
  "shortSummary": "SpaceX scrubbed the Starship launch due to technical issues with ground systems, but SpaceX managed to launch its 33rd commercial resupply mission to the ISS with a Falcon 9.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5fe6875b720145459831f2de7f844ab0",
  "places": [
    {
      "osmId": "15680987",
      "county": "Cameron County",
      "state": "Texas",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 25.9881319,
        "lon": -97.18611551391173
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.digitaltrends.com/space/starship-10th-launch-weather/",
      "text": "Barring any last-minute technical issues, it’s really only the weather that can cause problems for SpaceX’s Starship launch on Sunday, August 24. So, how’s it looking?\nThe weather forecasts for SpaceX’s Starbase launch site near Boca Chica, Texas, appear to be looking good for Sunday’s launch of the most powerful rocket ever built, which is targeted for 7:30 p.m. ET.\nAs of Saturday morning, The Weather Channel suggests it’ll be “partly cloudy” at Starbase at launch time, with only a 12% chance of rain and only light winds in the area.\nAccuWeather also expects light winds and puts the chances of rain slightly higher, but not at a level that should trouble the SpaceX team organizing Sunday’s launch.\nThe team will also be closely monitoring factors such as upper-level winds, wind shear, cloud layers, and any storm activity in the area and further away along the rocket’s ascent path. The fact that up to now SpaceX has said nothing about any concerns bodes well for Sunday’s planned liftoff.\nIf there are any changes to the schedule, whether due to technical issues or inclement weather, SpaceX will announce them first on its X account. We’ll update here, too, just as soon as we can.\nIf you’re interested in watching a livestream of the SpaceX’s 10th launch of its Starship rocket, Digital Trends has all the details you need.\nThe 121-meter-tall rocket creates a massive 17 million pounds of thrust when it leaves the launchpad, more than any other rocket in history.\nAfter the first-stage Super Heavy booster separates from the upper-stage Starship spacecraft, the booster will attempt a controlled a landing in the sea rather than return to the launch site (in spectacular fashion!) as it has done in several of its previous flights.\nThe spacecraft’s flight, meanwhile, will conduct several experiments focused on enabling the vehicle to return to the launch site on a future flight, such as testing alternative materials for the tiles protecting the vehicle during reentry. It will also deploy eight Starlink simulators.\n“Flight tests continue to provide valuable learnings to inform the design of the next generation Starship and Super Heavy vehicles,” SpaceX said.\nNASA will be watching Sunday’s test closely as it plans to use the rocket for crew and cargo flights to the moon, and possibly even Mars, in the coming years."
    },
    {
      "url": "https://www.digitaltrends.com/space/spacex-scrubs-sundays-launch-attempt-of-starship-rocket/",
      "text": "SpaceX has called off Sunday’s launch attempt of the Starship rocket. The team halted the countdown clock with 40 minutes to go and then scrubbed the launch a short while later.\nThe plan had been to launch the Starship on its 10th test flight at 7:30 p.m. ET on Sunday, August 24, and everything was looking good at the launch site in Starbase, near Boca Chica,Texas. But then SpaceX posted a message on its X account confirming the news that no one wanted to hear.\n“Standing down from today’s tenth flight of Starship to allow time to troubleshoot an issue with ground systems,” SpaceX said in the message. It’s yet to say when it will try again for launch.\nThe 121-meter-tall Starship, which comprises the first-stage Super Heavy booster and upper-stage Starship spacecraft, packs a colossal 17 million pounds of thrust at launch, making it the most powerful rocket ever to fly. The vehicle, which NASA is planning to use for crew and cargo missions to the moon, and possibly even to Mars, first launched in April 2023. The nine test flights to date have produced mixed results, though data from the tests has allowed SpaceX engineers to refine the design to edge the vehicle toward full certification.\nHad Sunday’s launch gone ahead, the Super Heavy booster would have made a controlled landing in the ocean rather than return to the launch site as it has done in several of its earlier test flights. Notably, the booster will fly for the first time with three grid fins instead of the usual four — part of a new design that gives the fins a surface area about 50% larger than the previous design. SpaceX recently shared a photo showing their enormous size. Increasing their size allows the rocket to return to Earth at a more extreme angle, allowing for greater fuel efficiency, among other advantages.\nOn the 10th flight, whenever it takes place, the upper-stage spacecraft will perform a number of experiments aimed at enabling the vehicle to return to the launch site on a future flight. They include testing alternative materials for the heat-resistant tiles that protect the spacecraft during reentry.\nOnce SpaceX reveals a new launch schedule, we’ll update here and also on our “how to watch the launch” page."
    }
  ],
  "argos_summary": "SpaceX scrubbed its 10th Starship launch with less than an hour to go, citing a ground‑system issue, while earlier that day a Falcon 9 successfully delivered a Dragon cargo spacecraft to the ISS. The Starship, the world’s most powerful rocket, was scheduled to launch from Boca Chica, Texas, amid favorable weather forecasts. The Falcon 9 booster landed safely on a droneship, marking its seventh flight, and the Dragon is expected to dock with the ISS in about 28 hours. NASA will continue to monitor the Starship tests as it plans future crew and cargo missions to the Moon and Mars. The company has not yet announced a new launch date for the Starship.",
  "argos_id": "PFWC8MZ9N"
}