{
  "url": "https://financialpost.com/pmn/business-pmn/us-and-china-are-thwarting-indias-shot-at-7-trillion-solar-prize",
  "authorsByline": "Bloomberg News",
  "articleId": "6d00514f5f054a9db7bb30cde4367963",
  "source": {
    "domain": "financialpost.com",
    "paywall": true,
    "location": {
      "country": "ca",
      "city": "Toronto",
      "coordinates": {
        "lat": 43.6534817,
        "lon": -79.3839347
      }
    }
  },
  "imageUrl": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/08/relying-on-china-indias-solar-sector-remains-dependent-on-c.jpg",
  "country": "ca",
  "language": "en",
  "pubDate": "2025-08-22T00:24:27+00:00",
  "addDate": "2025-08-22T00:35:31.623392+00:00",
  "refreshDate": "2025-08-22T00:35:31.623395+00:00",
  "score": 1.0,
  "title": "US and China Are Thwarting India's Shot at $7 Trillion Solar Prize",
  "description": "To seize its opportunity to become a global force in solar power, nation must address tariff tensions and fix a supply chain still hugely reliant on Beijing.",
  "content": "An analysis of trade data by Bloomberg News shows just how difficult a reordering of supply chains could prove. China remains the dominant supplier of almost every item required — including specialized glass, encapsulant film, crystalline silicon wafers and copper ribbon, to fully finished solar cells, and the modules that cluster those cells together. For solar glass and aluminum frames, four of India’s main panel producers were each more than 97% dependent on Chinese imports in 2024, while only 2 of 7 leading firms sourced more than half of their manufacturing equipment outside China. Last year, two Chinese companies accounted for more than half of all manufacturing machinery purchases by India’s 10 largest solar importers. Reliance alone spent roughly $300 million sourcing equipment for a giant plant in Gujarat with a single supplier — Suzhou Maxwell Technologies Co., the trade data show. Jiangsu-province based Suzhou declined to comment, Reliance didn’t immediately respond to a request for comment. Waaree works “with a variety of global suppliers to meet immediate needs, while we continue to strengthen our domestic manufacturing capabilities,” Chief Executive Officer Amit Paithankar said. FS India Solar’s parent company First Solar Inc. declined to comment. Adani Group’s Mundra Solar Energy Ltd., Tata Power and Emmvee Photovoltaic Power didn’t immediately respond to requests for comment. While progress is being made on localizing the solar supply chain, ReNew Energy Global Plc has slowed plans to invest in solar wafer-making capacity because of a lack of local availability of specialist machinery, Chief Financial Officer Kailash Vaswani said. India’s success in onshoring more of the supply chain will determine exactly how much the nation can benefit from global solar investment through 2050. That could total $4.8 trillion if the world sticks with economics-led policies, and as much as $6.9 trillion under more aggressive decarbonization efforts to hit net zero by 2050, according to BNEF estimates. There’s potential for India to add significant numbers of additional jobs in the solar industry, which already employs more than 300,000 people, according to the International Renewable Energy Agency. Development of the sector will also help to drive down the costs of the nation’s electricity, said Rishabh Jain, senior program lead at the Council on Energy, Environment and Water, a New Delhi-based think tank. “Our priority should be to reduce our dependency on China,” CEEW’s Jain said. “There is room even for India to raise its ambition for clean energy deployment.” Prime Minister Narendra Modi’s government – which aims to have 500 gigawatts of clean energy capacity by 2030, roughly double the current total — has had some, albeit limited, impact with policies aimed at stimulating the domestic solar sector. A total of 22 gigawatts of new renewables capacity was added in the first half of 2025, a record volume and 56% more than a year earlier, according to the Central Electricity Authority. Import duties of 40% on solar modules and 25% on solar cells were imposed in 2022. Project developers must also use modules supplied only by a government-approved list of manufacturers. While India’s module imports totaled about 20 gigawatts in 2024 — 85% of which were from China — the total plunged after the rule was brought back into force last April, following a year of relaxation to ease a module supply crunch. Module production has grown twelve-fold since early 2021 and solar cell manufacturing capacity more than doubled in the past year, government data shows. A crucial next task is to ensure India is producing sufficient quantities of solar cells — which would enable local firms to assemble more finished modules and panels. An approved cell supplier list is scheduled to kick in from June 2026, though that deadline could be dependent on the continued rapid expansion of local plants and the ability of domestic producers to lower costs.\n\nFor now, China-made modules remain cheaper than domestic products even after a 40% import tax is applied, though costs of India-made equipment fell almost a third last year and are expected to continue to decline as the local industry builds scale. The US is India’s dominant export market, and was the destination for 97% of module shipments in the first half. India’s manufacturers have had ambitions of rapidly lifting those volumes, and capitalizing on US wariness about China’s dominance of clean technology. Yet the strategy faces a fresh challenge from President Donald Trump’s trade policies. Trump on Aug. 6 threatened to double tariffs on India to 50% by next week as a result of the nation’s purchases of Russian oil, and when combined with an existing 14% levy on solar imports it will mean manufacturers face more punitive terms than some rivals. US solar companies too, are raising objections to the prospect of increased flows of India-made products. The Alliance for American Solar Manufacturing and Trade, which includes First Solar, Mission Solar Energy and Qcells, in July filed trade petitions against India, Indonesia and Laos, alleging illegal practices by largely Chinese-owned companies operating in those countries. The group has called for antidumping duties of 213.96% to be imposed on India. The US Department of Commerce — which in April set new duties as high as 3,521% on solar imports from four Southeast Asian countries — has launched an investigation. While there is likely to be a short-term negative hit, “we are hopeful that over a period of time these markets will remain open to us,” Premier Energies’ Rustagi said. “India is in a strong position to supply solar panels and other clean tech equipment to the US and other markets.” An additional barrier for solar firms outside China has been the No. 2 economy’s grip on supply of manufacturing equipment, and particularly the appliances used at vital stages of the production process. That’s creating further risks for Indian producers, with China already showing a willingness to restrict the flows of some specialized appliances or expertise in competitive sectors. “They’re not sharing that right now with the rest of the world,” ReNew’s Vaswani said. “They would like to obviously retain that part of the value within the country.” Apple Inc.’s main assembly partner Foxconn Technology Group has faced curbs on equipment imports to India, amid a wider drive by authorities in Beijing to curb technology transfers and to prevent the development of rival supply chains overseas, people familiar with the matter said earlier this year. In July, Foxconn asked hundreds of Chinese engineers and technicians to return home from its iPhone factories in India, according to people with knowledge of the details. Talks this week in New Delhi between Modi and Chinese Foreign Minister Wang Yi, along with the Indian leader’s pending visit to China, have raised some expectations for a thawing of restrictions. India is gradually building up capacity across the solar supply chain, and will continue to add import restrictions and other measures to foster local manufacturing — potentially including domestic manufacturing requirements for solar projects, according to government officials, who requested anonymity to discuss private policy plans. In February, Finance Minister Nirmala Sitharaman outlined a broader national manufacturing mission with an aim to bolster India’s export competitiveness. While fine details of the policies are still being developed, solar equipment is being considered among potential priorities, some of the officials said. India’s Ministry of New and Renewable Energy didn’t immediately respond to a request for comment. “Every country has to decide their path for energy security and India has clarity on that, it is taking steps to become self-reliant,” Waaree’s Paithankar said in an interview.\n\nInvestors too are showing increasing enthusiasm over India’s green prospects. Solar projects attracted a record $14.2 billion of investment in India last year, according to data complied by BNEF. Waaree, Premier Energies and Acme Solar Holdings Ltd. were among firms that led a flurry of clean energy-related initial public offerings in 2024, while Rayzon Solar, Juniper Green Energy and Emmvee have all filed documents to prepare for a new raft of listings. At Borosil’s plant in Bharuch, Kheruka explains the facility uses mainly equipment from Europe, though crucial glass tempering machinery was imported from China. The company in May confirmed plans to add 600 tons a day of additional capacity. The producer has pressed India’s government to continue to support the development of local supply chains and insists greater self-sufficiency in the solar sector is an achievable goal. “We’re making satellites — this is nothing, it’s not rocket science,” Kheruka said. “China has absolutely nothing that’s unique to them.”",
  "medium": "Article",
  "links": [
    "https://financialpost.com/opinion/post-american-world-economy-grim-place?itm_source=trending",
    "https://financialpost.com/personal-finance/taxes/cra-penalizes-taxpayer-failure-report-sale-principal-residence?itm_source=trending",
    "https://financialpost.com/pmn/business-pmn/us-and-china-are-thwarting-indias-shot-at-7-trillion-solar-prize",
    "https://financialpost.com/entrepreneur/small-business/small-businesses-year-tariff-changes-cfib?itm_source=trending",
    "https://twitter.com/intent/tweet?url=https%3A//financialpost.com/pmn/business-pmn/us-and-china-are-thwarting-indias-shot-at-7-trillion-solar-prize&text=US%20and%C2%A0China%20Are%20Thwarting%20India%27s%20Shot%20at%20%247%20Trillion%20Solar%20Prize&via=",
    "https://www.linkedin.com/sharing/share-offsite/?url=https%3A//financialpost.com/pmn/business-pmn/us-and-china-are-thwarting-indias-shot-at-7-trillion-solar-prize",
    "https://www.linkedin.com/sharing/share-offsite/?url=https://financialpost.com/pmn/business-pmn/us-and-china-are-thwarting-indias-shot-at-7-trillion-solar-prize",
    "https://financialpost.com/subscribe",
    "https://financialpost.com/category/opinion/",
    "https://financialpost.com/fp-work/why-returning-office-pay-cut-many-people?itm_source=trending",
    "https://www.reddit.com/submit?kind=link&url=https%3A//financialpost.com/pmn/business-pmn/us-and-china-are-thwarting-indias-shot-at-7-trillion-solar-prize&title=",
    "https://financialpost.com/feature/canada-housing-market-slump-spells-trouble-economy?itm_source=trending",
    "https://financialpost.com/category/real-estate/",
    "https://financialpost.com/video-centre/",
    "https://pinterest.com/pin/create/button/?url=https://financialpost.com/pmn/business-pmn/us-and-china-are-thwarting-indias-shot-at-7-trillion-solar-prize&media=https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/08/relying-on-china-indias-solar-sector-remains-dependent-on-c.jpg",
    "https://financialpost.com/category/personal-finance/taxes/",
    "https://financialpost.com/category/fp-work/",
    "https://www.tumblr.com/widgets/share/tool?canonicalUrl=https://financialpost.com/pmn/business-pmn/us-and-china-are-thwarting-indias-shot-at-7-trillion-solar-prize&title=US%20and%C2%A0China%20Are%20Thwarting%20India%27s%20Shot%20at%20%247%20Trillion%20Solar%20Prize",
    "https://www.reddit.com/submit?kind=link&url=https%3A//financialpost.com/pmn/business-pmn/us-and-china-are-thwarting-indias-shot-at-7-trillion-solar-prize&title=US%20and%C2%A0China%20Are%20Thwarting%20India%27s%20Shot%20at%20%247%20Trillion%20Solar%20Prize",
    "https://financialpost.com/category/entrepreneur/small-business/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "solar equipment",
      "weight": 0.07803469
    },
    {
      "name": "India",
      "weight": 0.07692867
    },
    {
      "name": "solar modules",
      "weight": 0.076853864
    },
    {
      "name": "solar imports",
      "weight": 0.0761377
    },
    {
      "name": "solar cell manufacturing capacity",
      "weight": 0.07581844
    },
    {
      "name": "solar cells",
      "weight": 0.07312622
    },
    {
      "name": "solar firms",
      "weight": 0.072095685
    },
    {
      "name": "solar glass",
      "weight": 0.07056694
    },
    {
      "name": "solar panels",
      "weight": 0.06950774
    },
    {
      "name": "solar projects",
      "weight": 0.069351
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Other",
      "score": 0.9931640625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.89208984375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.822265625
    },
    {
      "name": "/News/Technology News",
      "score": 0.5791015625
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Renewable & Alternative Energy",
      "score": 0.53271484375
    },
    {
      "name": "/Business & Industrial/Manufacturing/Other",
      "score": 0.370361328125
    }
  ],
  "sentiment": {
    "positive": 0.2533434,
    "negative": 0.3332881,
    "neutral": 0.41336846
  },
  "summary": "The US and China are threatening to undermine India's potential for a $7 Trillion solar prize, according to a Bloomberg News analysis. The study revealed that China remains the dominant supplier of almost all items required, including specialized glass, encapsulant film, crystalline silicon wafers and copper ribbon, to fully finished solar cells. Four of India's main panel producers were more than 97% dependent on Chinese imports in 2024, while only 2 of 7 leading firms sourced over half of their manufacturing equipment outside China. The success of India onshoring more of the supply chain will determine how much the nation can benefit from global solar investment through 2050. The International Renewable Energy Agency estimates that India could add significant numbers of additional jobs in the solar industry, which already employs over 300,000 people. However, the strategy faces challenges from US President Donald Trump, who has threatened to double tariffs on India's solar imports.",
  "shortSummary": "India’s solar industry faces challenges from China and other dominant suppliers, with local production limited and import duties imposed amid ongoing production challenges.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "ff74ecb101b044a5a96ef3d0de257556",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://financialpost.com/fp-work/why-returning-office-pay-cut-many-people?itm_source=trending",
      "text": "Why returning to the office is a pay cut for many people\nThe Ontario government and banks are forcing people back into the office but what if you don't want to go?\nIt’s been more than five years since the pandemic and employers are still trying, unsuccessfully in many cases, to force their workers to return to the office.\nIt’s not shocking to see employees object because the bottom line is that a return to the office constitutes a pay cut for them.\nThe Ontario government is one of the latest to say employees have to be in the office five days a week, though not until 2026. Premier Doug Ford wants municipalities to do the same.\nOthers, such as Toronto-Dominion Bank, Bank of Nova Scotia, Bank of Montreal and Royal Bank of Canada, are making their employees commute at least four days a week come September.\nWhat’s in it for the employees besides a loss of time, increased transportation costs and a higher budget for lunch and other expenses?\nEmployees got a financial break when the COVID-19 lockdown happened. There was a social impact, but anyone with children or family pressures gladly took that on even though — let’s face it — that burden still falls mainly on women.\nI’m not going to debate productivity. Employers say they are losing it by having remote workers, while employees maintain the opposite.\nBut the financial debate comes down to who is paying to bring people into the office. Traditionally, the worker bears those costs.\n“The classic simple model of cities is everybody working downtown and they all have to commute. People traded the lower cost of a house in the suburbs for the longer commute,” Tsur Somerville, a professor at the University of British Columbia’s Sauder School of Business, said.\nThe pandemic let those commuters win on two counts: they got a bigger house and no commute, but household savings also rose to $350 billion.\n- Posthaste: Canadians are dragging their feet back to the office — with many opting to cheat or quit\n- Howard Levitt: When working from home means working two jobs\n- Advertisement embed-more-topicStory continues below\nI’ll declare my bias, having left a job that had moved to five days in the office, while the Financial Post has a flexible workplace policy.\nNancy D’Onofrio, a director at recruitment and human resources company Randstad Canada, said workplace issues are at the forefront of negotiations today.\n“Flexibility is key. It’s just massive and people are still looking for it,” she said. “Based on our stats, flexibility ranks supreme.”\nAmong 26,000 people surveyed globally by Randstad, 55 per cent won’t take a job without scheduling flexibility. Another 37 per cent of workers quit a previous job because of a lack of flexibility.\n“The market is working for employers and people are scared to make moves,” D’Onofrio said. “But when the (job) market improves, there could be waves of people (leaving) in the future.”\nAs a result, employers need to shift their strategy, especially for high-demand talent.\n“Sometimes employers struggle to find bilingual talent,” she said, adding it is clear that people will take less money in exchange for flexibility. “If you are saying you have to come into the office, it will shrink your talent pool.”\nDavid Cairns, a longtime broker at CBRE Group Inc. and now a strategist at Kadence Inc., a global hybrid workplace platform, said the latest return-to-office mandates will not work.\n“Look at (the data) when it comes to cellphone pings, badge swipes, etc., and ‘work from home’ has been flat since 2023,” he said, adding that new return-to-office mandates might add a “couple of percentage points.”\nCairns points out that pre-pandemic, offices were occupied 50 per cent to 60 per cent of the time.\nBut there is a rising wave of returnees to offices in Toronto based on data from the Strategic Regional Research Alliance that measures the percentage of employees returning to the office compared to pre-COVID-19 times.\nAs of July 15, average weekly occupancy was 78 per cent compared to pre-pandemic. Peak day occupancy is 88 per cent and the low is 51 per cent. That looks like a lot of people still have flexible work arrangements.\n“We did this same thing last year,” Cairns said about new mandates. “The only thing that looks a little different is that there are a few more. But I call it sentiment, not reality. The data shows it is not reality, nor will it be.”\nJamie Grossman, managing principal and a broker at tenant representation firm Cresa, said there has been an uptick in leasing demand, but it’s not one-size-fits-all for every industry.\n“Finance is leaning more into the office. There is some flexibility, but there is a point now where people get an office or workstation that is their own,” he said, adding that doesn’t mean it gets used five days a week. “We will never go back to what pre-pandemic was.”\nCairns said the math is simple. Daily commute times average 60 minutes round trip, which amounts to about $42 in driving costs based on mileage rates. The time cost of commuting based on average wages is worth $44 daily.\n“It’s a double hit. It’s obvious why employees favour hybrid,” he said, especially after adding in costs such as the “uniform tax” of office life, which he calculates at $8 per day. Food and coffee are $6 to $8 per day cheaper at home with healthier options. Utility costs go up, he said, but only $3 to $5 daily.\nBut what about your career path and salary?\n“The long tail of this is no,” Cairns said, predicting that younger chief executives will grow into leadership roles and offer flexible working.\nJon Pinkus, an employment lawyer at Samfiru Tumarki LLP, said unionized government employees have limited choices legally.\nBut if your employment agreement is unclear, a change in your workplace could amount to constructive dismissal and lead to a settlement.\n“I haven’t been deluged with clients,” Pinkus said about workers looking for a legal out. “It might change as these things come into effect.”\nIn the case of specific industries such as the oligopolies that are the banks, he said movement is inhibited because you can’t find a job in the same industry and that limits pushback.\nSome people want to be back at the office, and, in some industries, there will be no choice because the employee has no leverage.\nIn others, such as high-demand technology jobs, employers are going to pay more for a rigid workplace policy.\nThe genie is out of the bottle; people will negotiate on flexible workplace policy. Flexibility is part of compensation. There is no turning back.\n• Email: gmarr@postmedia.com\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
    },
    {
      "url": "https://financialpost.com/feature/canada-housing-market-slump-spells-trouble-economy?itm_source=trending",
      "text": "Safe as houses? How Canada's ailing housing market could spell trouble for the whole economy\nReal estate is not only a major source of wealth for Canadians, it's also one of the country's top economic drivers. Jordan Gowling looks at how one of the worst housing markets in decades could drag on jobs, government revenues and the stability of the financial system\nArticle content\nHolly Calderwood has worked in the Vancouver real estate industry for two decades, and there’s only been a handful of times when she has seen the housing market this bad.\n“I think the last time I saw this was in 2008-2009 during the financial crisis,” she said. “And in 2020 during COVID-19.”\nCalderwood has built a career specializing in selling luxury real estate from condos to waterfront properties, and she has recently noticed both a decline in sales and prices, as well as a rise in foreclosures.\n“It really picked up last year, but this year, too,” she said. “A lot of foreclosures and then you just see the price dropping. Sometimes people are losing a couple of million.”\nCalderwood attributes the causes for that trend to homeowners renewing at higher interest rates, a foreign buyer ban and a trade war with the United States that has put a damper on investment sentiment and demand.\nEconomists and industry insiders say some markets have entered a buyer’s market for the first time in years, with cities such as Toronto, Vancouver and even Calgary recording significant drops in sales activity and posting record highs in inventory.\nThat could be a sign of price bubbles bursting, which is welcome news for would-be buyers, but could also spell trouble for the Canadian economy, which has relied on housing in recent years as an important economic driver, and it could lead to a drag on jobs, government revenues and the stability of the financial system.\nThe housing market recently peaked in mid-2022, before it started declining as the Bank of Canada began raising interest rates to deal with post-pandemic inflation. Earlier this year, the industry was hoping the market would begin a slow recovery after the central bank began delivering rate relief in 2024. Data from June and July seem to suggest a pickup in activity, but prices and sales are down compared to last year.\nRobert Hogue, assistant chief economist at Royal Bank of Canada, projects home resales will decline 3.5 per cent in Canada to 467,100 units in 2025, with the drop largely concentrated in Ontario and British Columbia.\nTrade uncertainty and general worries about the Canadian economy have been blamed for the slowdown, but some markets have also become unaffordable for many buyers.\n“We have had a structural shift in interest rates,” Charles St-Arnaud, chief economist at Alberta Central, said. “That changed the affordability equation quite significantly for many markets.”\nHe said mortgage rates are 150 basis points higher than they were in the decade before the pandemic and that has left a lot of would-be buyers not being able to afford what they thought they could afford.\n“That’s why we’ve been seeing prices going nowhere; no one can afford to overbid for a house in aggregate,” he said.\nBy the numbers\nSome politicians like to talk about lowering housing market prices as a social good, but housing and real estate investments remain a key economic driver for Canada and investors need to know they’ll get a return on their money.\nIn May, Canada’s newly appointed Housing Minister Gregor Robertson said the quiet part out loud when he was asked whether house prices should go down.\n“No, I think that we need to deliver more supply, make sure the market is stable,” he said during a scrum on Parliament Hill. “It’s a huge part of our economy.”\nLast year alone, the housing sector contributed $143.4 billion to the economy and supported 1.2 million jobs. Someone buying a home often translates into spin-off consumption in other areas of the economy, such as household appliances, renovation services and materials.\n“You’ve often heard the saying in the U.S. that when the housing market is doing well, the general economy is doing well,” St-Arnaud said. “Strong housing starts, strong building construction, have a lot of spillover to the rest of the economy.”\nResidential investment contributed 10 per cent to Canada’s gross domestic product (GDP) in 2021 during the pandemic housing boom and 7.5 per cent in 2023. The total value of housing assets grew to $4.2 trillion last year, representing 25 per cent of national wealth.\nThe total residential dollar value of all homes sold in Canada in June was $33.1 billion, according to the Canadian Real Estate Association, compared to $25.1 billion in June 2019, which represents a 24 per cent increase in six years. This has been helped by an increase in the average home price, which climbed to $691,634 in June from $505,500 in June 2019.\nMike Moffatt, an economist and founding director of the Missing Middle Initiative at the University of Ottawa, said governments are trying to achieve two things at once: restore affordability while also maintaining an environment that encourages confidence in the market and developers to keep building.\n“The governments are trying to do two things that are, on the face of it, inherently contradictory,” he said. “We do need prices to fall. But we’ve seen over the last three years what happens when prices continue falling. It basically just breaks the economics for builders by eliminating the incentive to build. That creates a challenging situation where we want low prices, but we also want to create the conditions for builders to build more.”\nMoffatt said all levels of government benefit from housing development, often through development charges, HST/GST and other fees.\nBut cracks are starting to show in this industry. The condo markets in Ontario and British Columbia have experienced significant losses in pricing value, with signs of financial distress in the sector. What used to be an attractive area for investors to park their money is no longer the case.\nCondo apartment sales have dropped by 75 per cent in the Greater Toronto Area and 37 per cent in Vancouver since the pandemic peak in 2022, according to Canada Mortgage and Housing Corp. (CMHC).\n“The story of the dog-crate condominiums is well understood here in Toronto and in downtown Vancouver,” Ron Butler, a mortgage broker and host of the Angry Mortgage Podcast, said.\nHe said buyers who bought at preposterous prices five years ago, particularly in the pre-construction condo market, will not be able to see a return on their investment. Even worse, a number of condo projects in Canada’s two largest cities have entered receivership or been cancelled over the last two years.\nOne reason for the industry’s decline is that Canada’s population growth slowed to a crawl at the beginning of this year after several years of record-breaking growth in immigration. Some economists credited the previous surge in newcomers for masking the underlying weaknesses in the economy coming out of the pandemic as well as for keeping housing demand high in urban centres.\nButler said a combination of immigration curbs introduced last fall by the federal government and an increased number of for-purpose rentals entering the market are now the biggest contributors to a decline in rental prices.\n“You literally couldn’t imagine a worse set of circumstances (for these investors),” he said.\nCondo prices in Toronto’s surrounding suburbs are recording even more significant drops than in the city itself, according to a recent report by Moody Analytics. For example, prices in Halton Hills have fallen by as much as 50 per cent from their peak.\nPrices are dropping elsewhere, too. The average national price of a one-bedroom rental unit in Canada decreased 3.6 per cent year over year to $1,857 in May 2025, according to the latest National Rent Report by Rentals.ca and Urbanation Inc.\n“Odds are that rent is probably going to continue falling over the near term, so I wouldn’t expect investors to make their way back anytime soon,” Hogue said.\nHe said the 10 per cent decline from the peak prices in the Toronto area is significant, but it has not completely reversed the price run-up experienced during the pandemic.\n“A 10 per cent price decline historically would have been very significant and a big correction,” he said. “But after the period we have gone through, it’s only reversing a small fraction of the price increase we saw during the pandemic.”\nTiming and speculation\nInvestor speculation in the real estate industry has often been a point of criticism from housing advocates. Butler said today’s condo market debacle is what happens when you build a product solely around the priorities of investors instead of homeowners since it can lead to an oversupply of a product no one wants or can afford.\n“The model of building high-rise condos is that you have to sell 75 per cent of the building on a presale basis, with people who will give you 20 per cent down,” he said. “First of all, a lot of first-time homebuyers don’t have the 20 per cent or need to come by it slowly, and, secondly, most of the 75 per cent of presales were comprised of investors.”\nInvestor participation in the real estate market has also been criticized for turning housing into an asset and for taking capital away from other productive parts of the economy. Canada’s lagging business investment and productivity are longstanding issues.\nBut many regular homeowners often use their houses as a funding source for retirement or it may be the only major asset they own.\n“We can think about the boomers who are sitting on big appreciation in their house values, but we can also think of recent buyers who probably overstretched themselves to get on the market,” St-Arnaud said. “How do we deal with that if in 25 years they have zero appreciation on their main asset and they can’t save for anything else?”\nWhile this price adjustment is happening in the condo market, it is also happening in the house market in certain regions in Southern Ontario and British Columbia.\nBut not all regions are equal, since housing markets in the Prairies and Quebec are showing some resilience.\n“The Quebec market seems to be on a sustained gradual upward movement,” Butler said. “It’s probably a reflection of the fact that it’s just not badly priced.”\nBut once fast-growing markets such as Calgary are also facing more buyer-friendly conditions for the first time in years, though conditions are not as bad as they are for sellers in Vancouver and Toronto.\nJustin Warthe, a realtor and real estate investor in Calgary, said the city’s benchmark prices rose above $700,000 during the 2022-2023 peak from the mid-$500,000 range in 2020. The market has cooled since mid-2023, when interest rates rose, and the market has returned to having more than three months of inventory.\n“It’s definitely more of a buyer’s market right now,” he said.\nWarthe said he has to sit some clients down who think their houses will sell overnight and tell them that’s not the reality anymore.\nStill, despite this softening in some markets, St-Arnaud said Canada’s housing remains the most expensive in the G7.\n“House prices are still 26 per cent above where they were pre-COVID,” he said.\nTo get into the market, Canadians have heavily leveraged themselves, with residential mortgage debt reaching $2.3 trillion in February this year, compared to $1.6 trillion in 2019. Nearly half of all lending by Canadian banks is for residential mortgages.\nThe increase in mortgages has led to an increase in household debt, though Canada’s current debt-to-disposable-income ratio at 173 per cent is a slight decline from the 179 per cent reported in 2024.\n“It’s one of the highest in the G20,” St-Arnaud said. “How much more debt do we want our households to take? How much more vulnerability?”\nThe worst-case scenario for mortgage renewals if a longstanding global trade war leads to higher unemployment and depleted house prices was laid out by the Bank of Canada in its financial stability report in May.\n“Results suggest that the share of mortgages in arrears by at least 90 days could rise to a level comparable with or higher than levels reached in the 2008-09 global financial crisis,” the central bank said.\nThis is, of course, the most severe scenario policymakers worked out and does not represent a likely eventuality.\nAbout 60 per cent of mortgages in Canada will renew in 2025 or 2026, with 60 per cent of those mortgage holders expected to see an increase in their payments. That said, many of those mortgage holders are expected to be able to handle the higher payments.\nBut, as many economists have noted, the mortgage renewal risk will only be contained if the labour market holds. The unemployment rate held steady at 6.9 per cent in July, but Statistics Canada said net employment has only increased by 27,000 since the beginning of the year.\n“A chief risk officer will tell you the three most important things about mortgage default, it’s unemployment, unemployment and unemployment,” said Butler.\nFor now, the weakness has been driven by slow hiring, not layoffs, and recent GDP data suggests economic growth has merely flatlined in the second quarter, so the country has not entered a contraction.\n“As long as there are no job losses, as long as people still have an income, we’ll be OK,” St-Arnaud said. “If there is a negative shock, if there is a recession and we start to see relatively big layoffs, I would be really concerned for the housing market and the ramifications to the broader economy.”\nBut the unemployment rate is rising in many places. For example, the jobless rate hit 7.9 per cent in Ontario in July and increased to 5.9 per cent in British Columbia. The construction industry led the way, with employment down 22,000 positions in July after five consecutive months of little change in the sector, according to Statistics Canada’s latest release.\nThe stalling economy seems to be affecting homebuilders. CMHC forecasts that housing starts will come in at 237,800 in 2025, down from 245,367 in 2024. The Crown corporation also forecasts 227,734 housing starts next year and 220,016 in 2027. Those figures are all well below the 430,000 to 480,000 new homes per year it said are needed to restore affordability to 2019 levels.\n“We are seeing the most expensive markets experiencing a price decline,” Moffatt said. “And because of it, new home sales have basically evaporated in those two markets.”\nCalderwood said developers are dealing with tariff-related cost increases and the new-build market has considerably slowed.\n“I’ve had builders contact me and say it’s the slowest they have ever seen it,” she said.\nMoffatt said this slowdown will only exacerbate the supply issue. It may be hard to imagine now, but that lack of supply could fuel another bubble in pricing by the end of the decade.\n“If we go through a period where nothing gets built and then the economy improves, we’re not going to have a lot of inventory once people are ready to buy again,” he said.\nButler said the supply of homes that people want to buy will remain constrained for the foreseeable future.\n“The undersupply is in first-time, low-rise homes for people to buy, whether they’re single-family, townhouses or semis,” he said. “In that particular area, in Ontario and British Columbia, building of that product collapsed 16 months ago.”\nThe CMHC expects the average house price to drop by two per cent this year, with a slow recovery starting in 2026 as trade tensions ease and economic conditions improve.\nCalderwood said markets can quickly change, but she remains pessimistic that things will improve.\n“A lot of realtors say they can predict the market, but we’re not psychics,” she said. “As long as Trump is in power and with that all the tariffs and chaos, I don’t see it trending upward.”\n• Email: jgowling@postmedia.com\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
    },
    {
      "url": "https://financialpost.com/opinion/post-american-world-economy-grim-place?itm_source=trending",
      "text": "William Watson: The 'post-American world economy' will be a grim place\nFor 80 years the U.S. provided insurance for a stable world trading system. Now it's extracting profits from its allies and former friends\nUnique in so many ways already, Donald Trump has broken yet another precedent and prompted a special pre-release of the Fraser Institute’s “Economic Freedom of the World” report. This week’s spoiler details how Trump’s tariffs are affecting freedom in a country whose anthem claims it’s “the land of the free” (also “the home of the brave, except regarding Vladimir Putin”).\nThe latest U.S. freedom news is not good. Largely because of the tariffs, the Americans have dropped from fifth place overall to 10th. The pre-release doesn’t say where we stand but in last year’s ranking we were eighth, so if that holds we’re more free economically than they are. In terms of freedom to trade, the Americans are way down, falling from 56th place to 76th — compared with our own 34th place.\nDeciding for yourself who to buy goods and services from is clearly a big part of economic freedom. In that respect, Trump’s tariffs substantially reduce Americans’ freedom. And their effect isn’t small. The president’s trademark vagaries mean the tariffs have been a moving target, but in mid-April the U.S. had the second highest average tariffs of 165 countries tracked, behind only the Bahamas. World bests are often prized — ask the Guinness people — but being near the top of the tariff list put the U.S. in undistinguished company: numbers three, four and five were Sudan, Djibouti and Iran. No disrespect to the fine people who live in those places but they are not economic exemplars.\nThe pre-release’s authors (Robert Lawson of Southern Methodist University and Matthew D. Mitchell of the Fraser Institute) stress the strong inverse correlation between tariffs and GDP. Per capita GDP among the 15 countries with the highest average tariffs (not including the U.S.) was just US$9,703, while among the 15 countries with the lowest average tariffs it was US$43,502. Correlation isn’t causality and the U.S. won’t soon see its GDP falling to Sudanese or even Bahamian levels but those numbers do give pause.\n- William Watson: Any help for tariff-hit firms needs to be temporary\n- Terence Corcoran: CUPE and the ‘crime’ behind the Air Canada strike\n- Advertisement embed-more-topicStory continues below\nThe U.S. tariff revolution has happened stunningly quickly. On Feb. 3, not yet 200 days ago, the average U.S. tariff rate was still 2.4 per cent, pretty much where it had been for 20 years, according to the Yale Budget Lab. As of this writing, it’s 18.6 per cent, its highest level since the mid-1930s. In fairness, Donald Trump did run in 2024, as he had in 2016, on a platform of higher tariffs. But he ran on hundreds of other things, too, and while most of his supporters (and many of his opponents) almost certainly appreciate aggressiveness on trade policy, I doubt they expected tariffs this high.\nWhich gives hope to us liberal-internationalists that, like the calamitous Smoot-Hawley tariff spikes in the early 1930s, the Trump episode can soon be reversed — though preferably more quickly than the two-plus decades it took to get average U.S. tariffs back down to their post-World War I lows.\nIf that doesn’t happen, a new article in Foreign Affairs Magazine argues that life as a U.S. ally and continental neighbour will not be fun. Titled “The New Economic Geography,” it’s by Adam Posen, president of the Peterson Institute for International Economics. Both the magazine and the institute are arsenals of liberal-internationalist thinking, so you know where he’s coming from. But his argument is persuasive.\nIt is that in “the post-American world economy,” the U.S. will no longer provide the extensive insurance services — military, financial and economic — that it has supplied for the past 80 years. These have included freedom of navigation, support for property rights, “rules for international trade, and stable dollar assets in which to transact business and store money.” The U.S. itself benefited a lot from the relatively benign international environment its influence created. But now Donald Trump “has switched the United States’ role from global insurer to extractor of profit” — or, you might say, protection money. Today the U.S. itself is the threat, with the Trump administration promising “to spare clients from its own assaults for a higher price than before.” Nice little economy you have here; you wouldn’t want anything to happen to it, would you?\nIronically, in this “gangster’s paradise,” the country “whose behaviour most U.S. officials want to change (China’s), will likely be least affected, while the United States’ closest allies will be the most damaged.” That means us, of course — though perhaps we’re not quite as close a U.S. ally as we like to think, given our absence from this week’s Washington strategy session on Ukraine.\nPosen argues that other close U.S. allies will eventually follow our lead, such as it is, and try to diversify away from the U.S. But that will cost: “If substitute markets, investments and products were just as valuable,” they would have been chosen in the first place.\nAnd what is the likely U.S. reaction to attempts to diversify? Suppose we follow through on this week’s approach to Sweden by Industry Minister Mélanie Joly regarding our possible purchase of Gripen E fighter jets instead of U.S. F-35s. What sort of hissy fit will that prompt from Donald Trump? Closing the U.S. border to the six Canadian NHL teams? Diverting the Niagara River to shut down the falls? Non-CUSMA tariffs of 1,000 per cent or higher? Unilateral suspension of CUSMA?\nIf you’re easily depressed, don’t read Posen all the way through. With hard times ahead, it’s best to enjoy what’s left of summer.\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
    },
    {
      "url": "https://financialpost.com/subscribe",
      "text": "Online Access\nFor readers who mean business.\nregular price $28, now available for $19 per month\nregular price $280, now available for $190 per year\n- Exclusive articles from Barbara Shecter, Joe O'Connor and Gabriel Friedman, plus daily newsletters and curated Financial Times content.\n- Opportunity to engage with our commenting community and learn from fellow readers in a moderated forum.\n- Unlimited online access to Financial Post.\n- Personalized news feed based on your interests and favourite journalists in the Financial Post App. Available now in the App store.\n- National Post ePaper, an electronic replica of the print edition to view on any device, share and comment on.\n- Support local journalism."
    },
    {
      "url": "https://financialpost.com/video-centre/",
      "text": "Home | Financial Post Home Page | Financial Post\nAdvertisement 1\nAdvertisement 2\nStories continue below\n- Advertisement 2Stories continue below\nAdvertisement 3\nStories continue below\n- Advertisement 3Stories continue below\nAdvertisement 4\nStories continue below\n- Advertisement 4Stories continue below\nAdvertisement 5\nStories continue below\n- Advertisement 5Stories continue below\nAdvertisement 6\nStories continue below\n- Advertisement 6Stories continue below\nAdvertisement 7\nStories continue below\n- Advertisement 7Stories continue below\nAdvertisement 8\nStories continue below\n- Advertisement 8Stories continue below\nAdvertisement 9\nStories continue below\n- Advertisement 9Stories continue below\nAdvertisement 10\nStories continue below\n- Advertisement 10Stories continue below\nAdvertisement 11\nStories continue below\n- Advertisement 11Stories continue below\nAdvertisement 12\nStories continue below\n- Advertisement 12Stories continue below\nAdvertisement 13\nStories continue below\n- Advertisement 13Stories continue below\nAdvertisement 14\nStories continue below\n- Advertisement 14Stories continue below\nAdvertisement 15\nAdvertisement"
    },
    {
      "url": "https://financialpost.com/entrepreneur/small-business/small-businesses-year-tariff-changes-cfib?itm_source=trending",
      "text": "38% of small businesses won’t last a year without tariff changes: CFIB\n19% of small businesses won't last another six months under current conditions\nReviews and recommendations are unbiased and products are independently selected. Postmedia may earn an affiliate commission from purchases made through links on this page.\nCanada’s trade with the United States will force the closure of nearly 40 per cent of Canadian small businesses within a year without changes in the tariff rates between the two countries, according to the Canadian Federation of Independent Business (CFIB).\nThe CFIB on Wednesday also said 19 per cent of small businesses won’t last another six months under current conditions, with 62 per cent of them dealing with higher expenses and 48 per cent facing lower revenue.\n“Small businesses don’t have a lot of runway left,” Corinne Pohlmann, executive vice-president of advocacy at CFIB, said in a release. “They are trying their best to absorb the costs, but if nothing changes, they will be forced to make some tough decisions. The worst outcome for Canada in the trade war is a bad deal, but the second-worst outcome is the never-ending uncertainty small business owners have been wrestling with for the past six months.”\nEarlier this month, U.S. President Donald Trump hiked tariffs on Canadian imports to 35 per cent on products not covered under the Canada-U.S.-Mexico Agreement (CUSMA).\nThe U.S. has also imposed a 50 per cent levy on steel, aluminum and copper, and Trump has threatened tariffs on pharmaceuticals.\nTrump has also pledged to remove the “de minimis” exemption on Aug. 29, which allows parcels valued at less than US$800 to cross the border tariff-free.\nMeanwhile, Canada’s canola industry is facing 76 per cent tariffs from China.\nThe CFIB said the tariffs on metal are hurting 59 per cent of Canadian small businesses, retaliatory tariffs are causing problems for 58 per cent of them and nearly losing the de minimis exemption could hurt a third.\nIn response to the latest U.S. tariff hike, Prime Minister Mark Carney offered a $1.2-billion aid package to the lumber industry and suggested lowering counter tariffs.\n- Carbon rebates for small businesses won't be taxed\n- CFIB to work with feds in dealing with tariff battle\n- Advertisement embed-more-topicStory continues below\n“We look at what we can do for our industry that’s most effective,” he said earlier this month. “In some cases, that will be to remove tariffs.”\nBut the CFIB is pushing for more support measures to help Canadian businesses.\n“The federal government needs to provide some stability and return tariff revenue to help small businesses,” Pohlmann said. “We’ve suggested several options, including temporarily reducing the federal small business tax rate to zero or a tariff rebate designed on earlier models, like the carbon tax rebate.”\nThe Liberals during the election campaign projected that counter tariffs would bring in $20 million in revenue within 12 months, though the situation can rapidly change.\nThe CFIB is pushing for all tariff revenues to be sent to affected businesses.\n“If the government wants to build one Canadian economy, it needs to ensure small businesses are part of the solution and that includes providing them with tariff support during this very challenging time,” Pohlmann said.\n• Email: bcousins@postmedia.com\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
    },
    {
      "url": "https://financialpost.com/personal-finance/taxes/cra-penalizes-taxpayer-failure-report-sale-principal-residence?itm_source=trending",
      "text": "CRA penalizes taxpayer for failure to report the sale of residential real estate\nJamie Golombek: Taxpayer failed to report capital gain of $159,282 and the CRA also hit him with a $21,000 gross negligence penalty\nReviews and recommendations are unbiased and products are independently selected. Postmedia may earn an affiliate commission from purchases made through links on this page.\nPerhaps the biggest tax break remaining for ordinary Canadians is the principal residence exemption (PRE), which allows individuals to realize an unlimited tax-free gain upon the sale of their home. Contrast that to the U.S. where the exemption is currently limited to US$250,000 for single filers (US$500,000 for married couples filing jointly), although last month, a bill was introduced in the U.S. that would provide an unlimited exemption just like in Canada.\nUnder our tax rules, if you do sell your principal residence, as of 2016 you need to report that sale on your tax return even if it fully qualifies for the PRE. The designation of your principal residence is reported on the front page of Schedule 3 of your return, and you must also complete the appropriate sections of Form T2091(IND), Designation of a Property as a Principal Residence by an Individual.\nFor a property to qualify as your principal residence for a particular tax year, four criteria must be satisfied: 1. the property must be a housing unit; 2. you must own the property (either alone or jointly with someone else); 3. you or your spouse (or common-law partner) or kids must “ordinarily inhabit” the property and 4. you must “designate” the property as a principal residence.\nNote that a seasonal residence, such as a cottage, cabin, lake house or even ski chalet, can be considered to be “ordinarily inhabited in the year” even if you only use it during vacation periods “provided that the main reason for owning the property is not to gain or produce income.”\nA rental property, however, is generally not considered a principal residence, and you could be on the hook for capital gains tax when you sell it. Similarly, you may be precluded from claiming the PRE if you bought or built a home with the purpose of selling it for a profit.\nIn recent years the government has been cracking down on residential house flipping. New anti-flipping rules for residential real estate (including rental properties) came into effect Jan. 1, 2023, and were designed to “reduce speculative demand in the marketplace and help to cool excessive price growth.”\n- CRA loses case as judge rules in favour of taxpayers' Home Buyers' Plan withdrawal timing\n- CRA prevails over Holt Renfrew saleswoman in battle over wardrobe deduction\n- Advertisement embed-more-topicStory continues below\nThe rules prevent you from claiming the PRE to shelter the capital gain realized on the sale of your home if you’ve owned it for less than 12 months. And, any gain on the sale of residential real estate held under 12 months is taxable not as a 50 per cent capital gain, but rather as 100 per cent taxable business income, subject to certain exemptions for life events such as death, disability, separation and work relocation.\nIf you sold residential real estate (including a rental property) that you owned for less than 365 days, you are obligated to declare that sale on Part 2 of the Schedule 3 of your personal tax return for the year of sale.\nAnd, although the flipped property rules only came into play for 2023 and future years, the Canada Revenue Agency can still challenge real estate flips that took place prior to 2023 if it feels a taxpayer has speculated and flipped a property for a quick profit.\nIn recent years, the CRA has also been cracking down on perceived abuse of the PRE even when properties are held for more than a year. Take the recent decision of the Tax Court, decided in June 2025, involving a Toronto taxpayer whose 2016 tax return was reassessed by the CRA because he failed to report a capital gain of $159,282 on the sale of residential real estate. To make matters worse, he was also hit with a $21,000 gross negligence penalty for failure to report the gain.\nThe taxpayer, an avid investor who was “particularly fond of real property,” purchased several properties along a certain portion of Toronto’s Yonge Street between 2010 and 2017. In 2016, the taxpayer sold multiple real estate holdings.\nOne of these properties was his principal residence in which he lived from May 2010 to July 2016. The CRA allowed him to claim the PRE on the sale of this property even though he failed to report its disposition on his 2016 tax return.\nThe taxpayer also failed to report the disposition of a second property sold at a gain in 2016, claiming that it was “always intended as a principal residence.” This claim was rejected by the CRA for a variety of reasons, including the fact he never resided at the property, did not file a T2091 to report it and already had a different principal residence at the same time in the same taxation year.\nUnfortunately, this was not the first time the taxpayer failed to report a disposition of real estate. It turns out that in 2011 the taxpayer was also reassessed, penalized and “red flagged for future vigilance by the (CRA)” for failure to report a sale.\nIn his defense, the taxpayer claimed that he reviewed his 2016 tax return with his accountant, reported the disposition of two other properties he sold in 2016, but omitted the gain on his principal residence and the property in question, believing that the gains were sheltered by the PRE.\nThe taxpayer blamed his accountant for failing to disclose the sale of his principal residence since 2016 was the first year this was required and his “accountant likely was ignorant” of the need to report it. When asked why his accountant didn’t testify, the taxpayer said it was because he had “moved to the States.”\nBut the judge wasn’t buying this excuse, noting that the taxpayer had a master’s degree, was experienced in real estate and even became a licensed real estate broker in 2022. The judge upheld the CRA’s assessment of the unreported gain.\nThe judge also concluded that in failing to report any disposition from the sale of the property, the taxpayer “knowingly or under circumstances amounting to gross negligence” made a false statement or omission on his 2016 tax return. Consequently, the CRA was justified in levying a gross negligence penalty for failure to report the gain associated with the sale of the property.\nJamie Golombek, FCPA, FCA, CFP, CLU, TEP, is the managing director, Tax & Estate Planning with CIBC Private Wealth in Toronto. Jamie.Golombek@cibc.com.\nIf you liked this story, sign up for more in the FP Investor newsletter.\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
    }
  ],
  "argos_summary": "India’s solar sector remains heavily dependent on Chinese components, with major panel makers sourcing over 90% of key inputs from China and facing supply‑chain bottlenecks that slow localisation efforts. Efforts to build domestic manufacturing are hampered by limited access to specialised machinery and by U.S. tariff threats that could curb Indian exports to the U.S. market. Meanwhile, Canadian small businesses are under strain from rising U.S. tariffs, with many citing higher costs and reduced revenue, while the Canadian tax agency has intensified enforcement on real‑estate capital‑gain reporting. These developments underscore the broader impact of trade tensions on supply chains, investment flows and domestic economies.",
  "argos_id": "PSRZJ6OCU"
}