{
  "url": "https://finance.yahoo.com/news/bernstein-socgen-asserts-circle-internet-042126443.html",
  "authorsByline": "Abdul Rahman",
  "articleId": "3d17bcf26a1748c0882d22758772429f",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/uficRzxAESpMBg81Tmk7wg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM7Y2Y9d2VicA--/https://media.zenfs.com/en/insidermonkey.com/ab83ee8c847f705f8147ce9375d25473",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T04:21:26+00:00",
  "addDate": "2025-08-25T04:38:55.136715+00:00",
  "refreshDate": "2025-08-25T04:38:55.136716+00:00",
  "score": 1.0,
  "title": "Bernstein SocGen Asserts Circle Internet Group’s (CRCL) ‘Outperform’ Rating on Crypto Growth Prospects",
  "description": "Circle Internet Group (NYSE:CRCL) in Cathie Wood’s Stock Portfolio is one of the top 10 stocks to buy now. On August 13, Bernstein SocGen Group reiterated an ‘Outperform’ rating on the stock and a $230 price target. The positive stance follows the stock’s impressive momentum, characterized by a 70.1% year-to-date gain. Bernstein SocGen Group remains […]",
  "content": "Circle Internet Group (NYSE:CRCL) in Cathie Wood's Stock Portfolio is one of the top 10 stocks to buy now. On August 13, Bernstein SocGen Group reiterated an ‘Outperform’ rating on the stock and a $230 price target. The positive stance follows the stock’s impressive momentum, characterized by a 70.1% year-to-date gain.\n\nA businessperson checking their laptop, highlighting the company's integration of technology across its banking and financial services.\n\nBernstein SocGen Group remains optimistic about Circle Internet Group’s prospects following its first quarterly earnings report after going public in June. According to the research firm, the financial results were inconsequential as the IPO had generated significant investor interest.\n\nSimilarly, Bernstein SocGen Group expects third-quarter results to have a significant impact on the stock’s sentiment, given that significant Ethereum price movements and USDC stablecoin growth during Q3 will be key metrics to watch. The firm has also echoed Circle Internet Group’s push to win big in the digital asset space, as it addresses near-term challenges.\n\nCircle Internet Group (NYSE:CRCL) is a financial technology firm that focuses on enabling businesses to utilize digital currencies and public blockchain’s for payments, commerce, and financial applications. It provides infrastructure and services for businesses to integrate digital currencies into their operations.\n\nWhile we acknowledge the potential of CRCL as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock.\n\nREAD NEXT: 12 Best Consumer Goods Stocks Billionaires Are Quietly Buying and Goldman Sachs Penny Stocks: Top 12 Stock Picks.\n\nDisclosure: None. This article is originally published at Insider Monkey.",
  "medium": "Article",
  "links": [
    "https://www.insidermonkey.com/blog/goldman-sachs-penny-stocks-top-12-stock-picks-2-1563813/",
    "https://www.insidermonkey.com/",
    "https://www.insidermonkey.com/blog/cathie-wood-stock-portfolio-top-10-stocks-to-buy-now-1595479/",
    "https://finance.yahoo.com/quote/CRCL",
    "https://www.insidermonkey.com/blog/three-megatrends-one-overlooked-stock-massive-upside-1548959/",
    "https://www.insidermonkey.com/blog/12-best-consumer-goods-stocks-billionaires-are-quietly-buying-1562974/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "certain AI stocks",
      "weight": 0.106609695
    },
    {
      "name": "Circle Internet Group",
      "weight": 0.104625165
    },
    {
      "name": "Goldman Sachs Penny Stocks",
      "weight": 0.09650771
    },
    {
      "name": "Bernstein SocGen Group",
      "weight": 0.09609379
    },
    {
      "name": "significant Ethereum price movements",
      "weight": 0.075320035
    },
    {
      "name": "digital currencies",
      "weight": 0.07375647
    },
    {
      "name": "Bernstein SocGen Asserts",
      "weight": 0.070098065
    },
    {
      "name": "CRCL",
      "weight": 0.066412814
    },
    {
      "name": "financial applications",
      "weight": 0.066106744
    },
    {
      "name": "Circle Internet Group’s prospects",
      "weight": 0.06554722
    }
  ],
  "topics": [
    {
      "name": "Cryptocurrency"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.986328125
    },
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.8095703125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.73876953125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.703125
    }
  ],
  "sentiment": {
    "positive": 0.69580126,
    "negative": 0.024302322,
    "neutral": 0.27989638
  },
  "summary": "Circle Internet Group (CRCL) is one of the top 10 stocks to buy in Cathie Wood's Stock Portfolio. On August 13, Bernstein SocGen Group reiterated an 'Outperform' rating on the stock and a $230 price target. This follows the stock's 70.1% year-to-date gain. The firm remains optimistic about Circle Internet Group's prospects following its first quarterly earnings report after going public in June. It also noted that the company's IPO had significant investor interest.",
  "shortSummary": "Bernstein SocGen Group reiterated its Outperform rating for Circle Internet Group, citing strong investor interest and potential for future growth in digital currencies and financial services.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "9b556feadf28476b8e4908d47ab0e9c9",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.insidermonkey.com/",
      "text": "10 Best Dividend Penny Stocks to Buy According to Analysts\nHaving a stable income, in the shape of dividends, is one thing, and owning a stock that is cheap yet valuable is perhaps a cherry on top.\nHedge Funds\nNews & Analysis\nTop Fund Managers\nBest Performing Funds\nFeatured Content\nInsider Trading\nNews & Analysis\nLatest Insider Purchases\nNeuberger bought 800,000 Nb Asset-Based Credit Fund shares at $10.00\nDisanto bought 600 Eastern Co shares at $23.00\nDisanto bought 414 Eastern Co shares at $22.98\nHawkesby bought 67,269 Reynolds Consumer Products Inc. shares at $23.04\nHawkesby bought 4,317 Reynolds Consumer Products Inc. shares at $23.16\nLatest Insider Sales\nGreat sold 17,956 Great Elm Capital Corp. shares at $11.20\nGreat sold 26,705 Great Elm Capital Corp. shares at $11.20\nArougheti sold 5,800 Ares Management Corp shares at $183.63\nArougheti sold 16,684 Ares Management Corp shares at $182.83\nArougheti sold 30,357 Ares Management Corp shares at $181.91\nFeatured Content\nDo not Miss"
    },
    {
      "url": "https://www.insidermonkey.com/blog/12-best-consumer-goods-stocks-billionaires-are-quietly-buying-1562974/",
      "text": "In this article, we will look at the 12 Best Consumer Goods Stocks Billionaires Are Quietly Buying.\nUS stocks are doing exceedingly well, shrugging off threats from tariffs and tax policies. That’s the sentiment echoed by analysts at Barclays, who insist the markets are poised to stop constantly responding to President Trump’s tariff policy and the “One Big Beautiful” tax bill.\nInstead, Barclays analysts expect investor’s sentiments in the equity market to shift to macro-economic data and the role of artificial intelligence in driving growth.\n“In our view, financial markets will increasingly tune out tariff and tax headlines coming from Washington, DC,” said Ajay Rajadhyaksha, the bank’s global chairman of research. “The focus should turn instead to macro data and the extent to which the AI dividend will boost corporate earnings, especially for large tech firms.”\nThe remarks come as the labor market has remained resilient and inflationary pressures subsided, consequently offering support to consumer’s purchasing power. Similarly, the outlook for consumer goods companies has improved, as Barclays analysts expect the US to avoid a recession.\nAmidst concerns over tariffs and interest rates, Rajadhyaksha expects the world economy to weather the current uncertainty triggered by the trade war unscathed. Sharing similar sentiments is HSBC strategist Max Kettner, who insists that investors are not bullish enough, even though the overall US market is expected to bounce back significantly.\nWith that in mind, let’s look at the 12 Best Consumer Goods Stocks Billionaires Are Quietly Buying.\nOur Methodology\nTo create the list of the 12 Best Consumer Goods Stocks Billionaires Are Quietly Buying, we analyzed the U.S. equity markets with a focus on consumer goods companies. From this pool, we shortlisted stocks that had positive returns over the past year and were held by the billionaire investors, based on Insider Monkey’s proprietary database. Finally, we ranked the selected stocks in ascending order by the number of billionaire holders.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nBest Consumer Goods Stocks Billionaires Are Quietly Buying\n12. Kenvue Inc. (NYSE:KVUE)\nOne-year Return as of July 3: 14.96%\nNumber of Billionaire Investors: 7\nKenvue Inc. (NYSE:KVUE) is one of the 12 best consumer goods stocks billionaires are quietly buying. On June 24, the company confirmed the departure of Asia Pacific president Ellie Bing Xie, effective July 14. However, he will remain with the company through August 8, 2025, to assist in the transition.\nThe company has already appointed Anindya (Andy) Dasgupta to take over as the Group President of Asia Pacific, effective July 14, 2025. He joins the company as a 30-year global consumer products industry veteran. The Asia Pacific Group contributed about $3 billion in net sales for Kenvue in 2024.\nDasgupta joins the company with vast experience in health, nutrition, and food and beverage sectors across emerging and developed markets. He also brings extensive experience in commercial strategy, sales, marketing, and business development.\nKenvue Inc. (NYSE:KVUE) is a global consumer health company that develops, manufactures, and sells over-the-counter (OTC) medicines, personal care products, and other healthcare products. It is known for iconic brands like Tylenol, Neutrogena, Listerine, and Johnson’s, among others.\n11. Mattel, Inc. (NASDAQ:MAT)\nOne-year Return as of July 3: 25.82%\nNumber of Billionaire Investors: 10\nMattel, Inc. (NASDAQ:MAT) is one of the 12 best consumer goods stocks billionaires are quietly buying. On June 16, UBS maintained its Buy rating and $29 price target for Mattel Inc. following a meeting with the company’s new CFO, Paul Ruh. The firm praised Ruh’s strong background in consumer packaged goods, especially in areas like cost control and financial discipline. However, it noted his limited exposure to intellectual property-driven businesses like toys.\nUBS expressed confidence in Mattel’s continued strategic direction, citing Ruh’s steady approach to capital allocation and cost management. The company’s guidance practices will remain unchanged, sticking to annual forecasts. Ruh’s prior experience with IPOs and corporate turnarounds was highlighted as a valuable asset for navigating Mattel’s evolving landscape.\nMattel, Inc. (NASDAQ:MAT) is a leading consumer goods company operating globally, known for designing, manufacturing, and marketing iconic toys and entertainment products under brands like Barbie, Hot Wheels, Fisher-Price, American Girl, and more. With a broad portfolio that includes dolls, vehicles, games, digital content, and licensed merchandise from major partners like Disney and WWE, Mattel distributes its products through retail stores, e-commerce, and licensing channels worldwide. As its offerings are purchased directly by consumers for leisure and lifestyle, Mattel is classified as a consumer discretionary stock within the consumer goods sector, driven by branding, innovation, and seasonal demand.\n10. Keurig Dr Pepper Inc. (NASDAQ:KDP)\nOne-year Return as of July 3: 3.27%\nNumber of Billionaire Investors: 12\nKeurig Dr Pepper Inc. (NASDAQ:KDP) is one of the 12 best consumer goods stocks billionaires are quietly buying. On June 30, Piper Sandler reiterated an ‘Overweight’ rating and $40 price target. The research firm maintains a bullish stance on improved conditions in the company’s US coffee segment.\nAdditionally, Piper Sandler is impressed by the continued momentum in the US refreshment beverage division. Consequently, the research firm expects Keurig Dr Pepper to deliver solid results in the second quarter. It anticipates growth contribution from Ghost in Q2 as it completes full distribution through the KDP network.\nPiper Sandler also expects the company to deliver earnings per share of $2.06 in 2025 and $2.17 in 2026, driven by strong demand for coffee pods. In addition, Keurig Dr Pepper plans to launch a new product dubbed Bloom Pop in the modern soda segment as part of its expansion strategy.\nKeurig Dr Pepper Inc. (NASDAQ:KDP) is a leading beverage company in North America, with a diverse portfolio of over 125 owned, licensed, and partner brands. It produces and sells a wide variety of beverages, including coffee, tea, juice, water, and carbonated soft drinks."
    },
    {
      "url": "https://www.insidermonkey.com/blog/three-megatrends-one-overlooked-stock-massive-upside-1548959/",
      "text": "There’s a once-in-a-generation convergence happening right now. Three unstoppable megatrends are reshaping the global economy—and one under-the-radar stock is perfectly positioned to profit from all of them.\nThis isn’t a flashy AI stock or a speculative play. It’s the infrastructure backbone of the future—and it’s trading at a bargain.\nLet me explain.\nTrend #1: The AI Arms Race\nArtificial intelligence is the most transformational force since the steam engine—and it’s just getting started.\nBut behind every ChatGPT prompt and robotic breakthrough is something few investors are thinking about:\nPower. Lots of it.\nWall Street is pouring hundreds of billions into artificial intelligence—training smarter chatbots, automating industries, and building the digital future. But there’s one urgent question few are asking:\nWhere will all of that energy come from?\nEven Sam Altman, the founder of OpenAI, issued a stark warning: “AI depends on an energy breakthrough.”\nElon Musk was even more blunt:\n“AI will run out of electricity by next year.”\nAs the world chases faster, smarter machines, a hidden crisis is emerging behind the scenes. Power grids are strained. Electricity prices are rising. Utilities are scrambling to expand capacity.\nAnd that’s where the real opportunity lies…\nOne little-known company—almost entirely overlooked by most AI investors—could be the ultimate backdoor play. It’s not a chipmaker. It’s not a cloud platform. But it might be the most important AI stock in the US.\nAs demand from AI data centers explodes, this company is gearing up to profit from the most valuable commodity in the digital age: electricity.\nThe “Toll Booth” Operator of the AI Energy Boom\n- It owns critical nuclear energy infrastructure assets, positioning it at the heart of America’s next-generation power strategy.\n- It’s one of the only global companies capable of executing large-scale, complex EPC (engineering, procurement, and construction) projects across oil, gas, renewable fuels, and industrial infrastructure.\n- It plays a pivotal role in U.S. LNG exportation—a sector about to explode under President Trump’s renewed “America First” energy doctrine.\nWhile investors pile into chip stocks with sky-high valuations, this company is quietly supplying the electricity that makes AI possible. No matter who wins the AI race—Microsoft, Google, Amazon, Meta—this company gets paid.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nTrend #2: Trump’s Tariff Strategy Could Trigger a U.S. LNG Export Boom\nDonald Trump has made one thing clear: he’s coming back to renegotiate global trade—on America’s terms.\nHis top priority? Narrowing the U.S. trade deficit. And this time, he’s not just targeting Chinese imports—he’s taking aim at every trade partner who’s been running a surplus at America’s expense.\nTrump’s team is already working behind the scenes to revise trade deals with Japan, Europe, and South Korea. And while the media focuses on tariffs and quotas, savvy investors are watching where the real money will flow:\nInto American LNG.\nHere’s why: The U.S. is sitting on a massive glut of natural gas—thanks to the shale boom. Domestic prices are near historic lows, while Europe and parts of Asia are paying 3–5x more for the same fuel. It’s the perfect imbalance.\nAnd Trump knows it.\nThat’s why he’s pressuring our trading partners to buy American energy as part of future trade agreements. It’s a simple way to cut the trade deficit without slapping tariffs on U.S. consumers.\nThat sets the stage for a massive wave of U.S. LNG exports, backed by political momentum and international demand.\nNow here’s where our stock comes in…\nOur stock is a tollbooth operator in this booming sector. This company builds the infrastructure that makes LNG exports possible—the pipelines, terminals, and systems that physically move U.S. gas to global buyers.\nIf Trump succeeds in tying LNG purchases to trade deals—and all signs suggest he will—this company will be printing money on every contract signed. The more the world buys American gas, the more this company earns.\nAnd this isn’t some hypothetical “if.” The groundwork is already being laid:\n- Europe is scrambling to replace Russian gas permanently.\n- Japan is actively sourcing non-Chinese, non-Russian LNG.\n- India and South Korea are deepening energy ties with the U.S.\n- New terminals are being planned and permitted in anticipation of the coming surge.\nTrump’s tariff threats may dominate the headlines—but his behind-the-scenes LNG diplomacy could be the real financial windfall for U.S. energy companies.\nAnd our pick is sitting in the perfect spot to benefit.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nTrend #3: The Great Onshoring Boom—And the $9 Billion Clue in Indiana\nFor decades, America offshored its industrial base. Now, that trend is reversing—and fast.\nFrom semiconductors to pharmaceuticals, manufacturing is coming back to U.S. soil. Rising geopolitical tensions, Trump-era tariffs, and global supply chain shocks have forced companies to rethink their entire operating models. The result? A tidal wave of onshoring—and our stock is riding it like a pro.\nJust look at what’s happening in Lebanon, Indiana.\nPharma giant Eli Lilly is investing $9 billion into two state-of-the-art manufacturing facilities at the LEAP Lebanon Innovation and Research District. This is one of the largest life sciences manufacturing investments in U.S. history—and it’s not a one-off.\nOur company—a global leader in engineering, procurement, and construction management (EPCM)—has already been awarded a $3.2 billion contract for this project. That’s not a preliminary deal. This is full notice to proceed. Shovels are in the ground. Steel is going up. Money is already flowing.\nAnd this is just the beginning.\nThe Lilly project is a bellwether for what’s coming: dozens of similar large-scale facilities across the country, spanning sectors from biotech to clean energy to advanced manufacturing. Each one will require complex infrastructure, deep engineering know-how, and flawless execution.\nThat’s exactly what our company delivers.\nThis isn’t speculative future revenue. This is high-margin, long-duration, politically supported work—backed by blue-chip clients and megatrends. And as more companies race to bring operations home, our stock is in the pole position to win contract after contract.\nn fact, you can think of it this way:\nWherever America rebuilds its industrial backbone, this company gets paid.\nIt’s not just an AI play. It’s not just an energy play. It’s also the ultimate onshoring pick-and-shovel stock—a contractor to the next American manufacturing supercycle.\nAnd while Wall Street focuses on headlines, smart investors are loading up on the company quietly collecting billion-dollar checks behind the scenes.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nBuilt for the Future: Zero Debt, Cash to Deploy, and AI in Its Sights\nWhile most energy and utility firms are buried under mountains of debt and coughing up hefty interest payments just to appease bondholders…\nThis company is completely debt-free.\nIn fact, it’s sitting on a war chest of cash—equal to nearly one-third of its entire market cap.\nIt also owns a huge equity stake in another red-hot AI play, giving investors indirect exposure to multiple AI growth engines without paying a premium.\nAnd here’s what the smart money has started whispering…\nThe Hedge Fund Secret That’s Starting to Leak Out\nThis stock is so off-the-radar, so absurdly undervalued, that some of the most secretive hedge fund managers in the world have begun pitching it at closed-door investment summits.\nThey’re sharing it quietly, away from the cameras, to rooms full of ultra-wealthy clients.\nWhy? Because excluding cash and investments, this company is trading at less than 7 times earnings.\nAnd that’s for a business tied to:\n- The AI infrastructure supercycle\n- The onshoring boom driven by Trump-era tariffs\n- A surge in U.S. LNG exports\n- And a unique footprint in nuclear energy—the future of clean, reliable power\nYou simply won’t find another AI and energy stock this cheap… with this much upside.\nThis isn’t a hype stock. It’s not riding on hope.\nIt’s delivering real cash flows, owns critical infrastructure, and holds stakes in other major growth stories.\nThis is your chance to get in before the rockets take off!\nThe Reveal: Our Top Short-Term Stock Pick for 2025\nThis is the moment when most newsletters put up a paywall and ask you to spend $99.99 to find out the name of the stock.\nBut we’re not doing that today.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nAt Insider Monkey, we believe in earning your trust first—by delivering real value, upfront. We’re confident that once you see the quality of our research and the strength of our ideas, you’ll want to subscribe on your own terms.\nSo here it is—our top short-term stock pick of 2025:\n👉 Fluor Corporation (Ticker: FLR)\nWhen we published our premium report at the end of April, FLR was trading around $35 per share. Based on everything we’ve laid out—from the AI infrastructure boom to the LNG export surge and the American manufacturing revival—we believe FLR is poised to double over the next 12 to 24 months.\nAnd this isn’t just a recommendation—it’s a conviction.\nI personally took a double-sized position in my own portfolio. That’s how strongly I believe in Fluor’s upside.\nThis is our free gift to you.\nWe want you to profit from it—and see firsthand the power of aligning your investments with long-term megatrends.\nIf you’re interested in going even deeper…\nIf you’d like to access our #1 long-term AI stock pick—one that we believe has 10,000% upside potential over the next decade—click here to learn more.\nWe’ve shown you what we can do.\nNow imagine what you’ll unlock as a premium subscriber."
    },
    {
      "url": "https://finance.yahoo.com/quote/CRCL",
      "text": "Circle Internet Group (CRCL)\nThis price reflects trading activity during the overnight session on the Blue Ocean ATS, available 8 PM to 4 AM ET, Sunday through Thursday, when regular markets are closed.\n- Previous Close\n131.80 - Open\n132.99 - Bid --\n- Ask --\n- Day's Range\n131.05 - 144.70 - 52 Week Range\n64.00 - 298.99 - Volume\n13,214,371 - Avg. Volume\n26,411,496 - Market Cap (intraday)\n33.898B - Beta (5Y Monthly) --\n- PE Ratio (TTM)\n-- - EPS (TTM)\n-1.74 - Earnings Date Nov 11, 2025\n- Forward Dividend & Yield --\n- Ex-Dividend Date --\n- 1y Target Est\n179.92\nCircle Internet Group, Inc. operates as a platform, network, and market infrastructure for stablecoin and blockchain applications. The company provides a suite of stablecoins and related products that include a network utility and application platform for organizations to benefit from stablecoins and the internet financial system; and issues a U.S. dollar-denominated stablecoin. Its stablecoins network comprises circle stablecoins, tokenized funds, liquidity, payments, and developer services, as well as integration services. The company was founded in 2013 and is based in New York, New York.\nwww.circle.com--\nFull Time Employees\nDecember 31\nFiscal Year Ends\nSector\nIndustry\nRecent News: CRCL\nView MorePerformance Overview: CRCL\nTrailing total returns as of 8/22/2025, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) .\nYTD Return\n1-Year Return\n3-Year Return\n5-Year Return\nCompare To: CRCL\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\nStatistics: CRCL\nView MoreValuation Measures\nMarket Cap\n31.25B\nEnterprise Value\n30.34B\nTrailing P/E\n--\nForward P/E\n--\nPEG Ratio (5yr expected)\n--\nPrice/Sales (ttm)\n14.58\nPrice/Book (mrq)\n13.18\nEnterprise Value/Revenue\n14.33\nEnterprise Value/EBITDA\n--\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n-16.21%\nReturn on Assets (ttm)\n--\nReturn on Equity (ttm)\n--\nRevenue (ttm)\n2.12B\nNet Income Avi to Common (ttm)\n-397.88M\nDiluted EPS (ttm)\n-1.74\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n1.12B\nTotal Debt/Equity (mrq)\n9.35%\nLevered Free Cash Flow (ttm)\n--"
    },
    {
      "url": "https://www.insidermonkey.com/blog/goldman-sachs-penny-stocks-top-12-stock-picks-2-1563813/",
      "text": "In this article, we will look at the Goldman Sachs Penny Stocks: Top 12 Stock Picks.\nIn a June 24, 2025, podcast, Goldman Sachs’ Christian Mueller-Glissmann and Alexandra Wilson-Elizondo examined the dynamics driving markets. They also discussed the investment strategies that could work in the second half of 2025. There were many insightful takeaways, but one stood out: they noted that diversification paid off in the first half of 2025, especially away from mega-cap stocks.\nA few days later, Goldman Sachs released a report that highlighted a surge in penny stock activity. A particular day stands out in the report’s analysis. It says that on June 12, penny stocks priced under $1 accounted for 47% of total U.S. equity trading volume. Overall, daily volume in this category of equities has increased threefold since 2021.\nHowever, some market analysts caution that this heightened activity is a warning sign. Cetera Investment Management’s Gene Goldman, for instance, warns that elevated penny stock activity is a “sign of a market top when investors are buying first and asking questions later.”\nOthers insist that penny stocks have been vilified over the years, but this time is different. For example, a Bespoke Investment Group analysis found that penny stocks are outperforming well-established companies. Their data shows that of the 14 stocks in the Russell 3000 that surged more than 200% since the S&P 500’s April 8 low, 10 were penny stocks. In other words, big names may rule the headlines, but many of the market’s future stars begin as under-the-radar underdogs.\nOur Methodology\nTo identify Goldman Sachs’ top 12 penny stock picks, we analyzed the investment bank’s equity holdings as of the first quarter of 2025. We focused on companies trading under $5 per share and also examined the popularity of these stocks among hedge funds. The list is presented in ascending order of Goldman’s stake in the companies.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nGoldman Sachs Penny Stocks: Top Stock Picks\n12. VinFast Auto Ltd. (NASDAQ:VFS)\nGoldman Sachs’s Q1 2025 Stake: $428,158\nShare Price as of July 3: $3.64\nNumber of Hedge Fund Investors In Q1 2025: 8\nVinFast Auto Ltd. (NASDAQ:VFS) is one of Goldman Sachs’ top penny stock picks. On June 29, VinFast began production at its second factory in Ha Tinh, Vietnam, aiming to boost the output of its mini EVs. The new plant has an annual capacity of 200,000 units and complements its main Haiphong factory, which aims to reach 950,000 units by 2026.\nDespite ambitious plans to expand globally with new factories in the U.S., India, and Indonesia, VinFast has faced challenges such as lower demand and intense competition. Its U.S. plant has been delayed until 2028, while the India facility is set to begin operations next month.\nVinFast aims to deliver 200,000 vehicles in 2025 and sold 56,000 units in the first five months of this year. In Q1, it reported a net loss of $712.4 million—an improvement from the prior quarter—but still 20% higher than last year. Revenue surged 150% year-over-year to $656.5 million.\nVinFast Auto Ltd. (NASDAQ:VFS), a subsidiary of Vingroup, designs and manufactures electric vehicles, e-scooters, and e-buses across Vietnam, Canada, and the U.S. It operates through three main segments: Cars, E-scooters, and E-buses, offering a wide range of EVs including SUVs, compact EVs, pickup trucks, MPVs, e-bikes, and related battery services. The company is headquartered in Hai Phong City, Vietnam.\n11. Altimmune, Inc. (NASDAQ:ALT)\nGoldman Sachs’s Q1 2025 Stake: $1,952,000\nShare Price as of July 3: $4.90\nNumber of Hedge Fund Investors In Q1 2025: 13\nAltimmune, Inc. (NASDAQ:ALT) is one of Goldman Sachs’ top penny stock picks. On June 26, the company reported positive topline results from its Phase 2b IMPACT trial evaluating Pemvidutide, a treatment candidate for metabolic dysfunction-associated steatohepatitis (MASH). The results mark a key milestone in advancing potential therapies for this chronic liver condition.\nAccording to the company, the trial’s findings indicate that Pemvidutide is the first product candidate to demonstrate significant MASH effects and weight loss within 24 weeks. The trial achieved its primary endpoint, showing “statistically significant MASH resolution without worsening of fibrosis.” This was observed in up to 59.1% of participants in an intent-to-treat (ITT) analysis. In the ITT analysis, MASH resolution without worsening of fibrosis was achieved in 59.1% of participants treated with 1.2 mg of Pemvidutide and in 52.1% with 1.8 mg, compared to 19.1% in the placebo group (p < 0.0001 for both doses).\nThe trial met several secondary endpoints, including reductions in liver fat content and liver enzyme levels. As such, the company concluded that Pemvidutide has additional therapeutic benefits for MASH patients.\nThese positive results are expected to pave the way for Altimmune to engage with the FDA in an End-of-Phase 2 meeting. The objective will be to define the path forward, including the design and scope of a Phase 3 trial. A final readout from the 48-week treatment period is anticipated in the fourth quarter of 2025.\nAltimmune, Inc. (NASDAQ:ALT) is a clinical-stage biopharmaceutical company. It develops peptide-based treatments for obesity, liver diseases, and metabolic disorders. Its lead product is Pemvidutide, a dual GLP-1/glucagon receptor agonist being tested for obesity, metabolic-associated steatohepatitis (MASH), and alcohol use disorder.\n10. Medical Properties Trust, Inc. (NYSE:MPW)\nGoldman Sachs’s Q1 2025 Stake: $3,821,000\nShare Price as of July 3: $4.46\nNumber of Hedge Fund Investors In Q1 2025: 19\nMedical Properties Trust, Inc. (NYSE:MPW) is one of Goldman Sachs’ top penny stock picks. On June 30, RBC Capital reiterated its “Sector Perform” rating on the company’s stock. RBC lowered its price target for the stock from $5.00 to $4.50 and appended a “Speculative Risk” qualifier to the rating.\nAccording to RBC, the adjustment is explained by two factors: the recent joint venture debt refinancing and higher operating expense leakage due to vacant assets. That said, RBC analysts anticipate that Medical Properties Trust’s stock will likely remain volatile in the coming period due to several ongoing uncertainties. These include several tenant situations (referring to challenges related to tenants like Steward Health Care); the company’s ability to monetize non-revenue-generating assets; and elevated leverage metrics.\nDespite the lowered price target, RBC emphasized that its stance on Medical Properties Trust’s stock performance relative to the overall sector remains neutral. This explains the “Sector Perform” rating.\nMedical Properties Trust, Inc. (NYSE:MPW) is a real estate investment trust (REIT). It owns and leases hospital facilities, including acute care, rehabilitation, and behavioral health hospitals. The company operates across nine countries, including the U.S., U.K., Germany, and Spain."
    },
    {
      "url": "https://www.insidermonkey.com/blog/cathie-wood-stock-portfolio-top-10-stocks-to-buy-now-1595479/",
      "text": "In this article, we will take a look at the Cathie Wood Stock Portfolio: Top 10 Stocks to Buy Now.\nCathie Wood, the CEO and chief investment officer of ARK Investment Management, has established a reputation thanks to high-conviction bets that often yield significant returns. While her investment firm has always been associated with positions in high-flying names, her focus on emerging and undervalued names has also set her apart on Wall Street.\nThe diversified nature of the Ark Investment portfolio is one reason investors have always paid attention to Cathie Wood plays and charter in the market. In May, the Chief Investment Officer reiterated that U.S. President Donald Trump’s tariffs were poised to be a turning point for the stock market. Wood reiterated that international trade negotiations would lead to a “freeing up of markets,”\n“If that is where we end up, that’s a tax cut. That’s a positive,” Wood said. Nothing could be further from the truth, as the overall stock market has bounced from its April lows and rallied to all-time highs.\nLikewise, Wood has been one of the beneficiaries of the blockbuster rally owing to her growth stock picks. Wood’s largest exchange-traded fund is up by more than 40% over the last three months and up by over 70% over the past year.\nThe blockbuster gains stem from a robust investment portfolio spanning electric vehicles, artificial intelligence, e-commerce, gaming, cryptocurrency payments, gene editing, and streaming, among others.\nOur Methodology\nTo come up with our list of Cathie Wood Stock Portfolio: Top 10 Stocks to Buy Now, we scanned the Ark Investment Management’s Q2 2025 portfolio. We focused on the hedge fund’s largest equity holdings. Additionally, we provided insights into their popularity among elite hedge funds based on second-quarter 2025 data. We also provided insights on why they stand out as a buy. Finally, we ranked the stocks in ascending order based on Ark Investment Management’s equity stakes in them.\nWhy are we interested in the stocks that hedge funds pile into? The reason is straightforward: our research has demonstrated that we can outperform the market by replicating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nCathie Wood Stock Portfolio: Top Stocks to Buy Now\n10. Advanced Micro Devices Inc. (NASDAQ:AMD)\nArk Investment Management Equity Stake: $384.28 Million\nNumber of Hedge Fund Holders: 113\nAdvanced Micro Devices Inc. (NASDAQ:AMD) is one of the top 10 stocks to buy now according to Cathie Wood. On August 13, the company inaugurated its new state-of-the-art office and engineering lab facility in Bayan Lepas, Penang.\nThe opening of the state-of-the-art facility marks a significant milestone in the company’s efforts to expand its business services and engineering presence in Malaysia. The 209,000-square-foot facility features state-of-the-art equipment that AMD will utilize to advance semiconductor design.\nThe new facility will allow the company to develop, build, and deliver the next generation of high-performance and artificial intelligence computing solutions. It will also play an essential role in enhancing AMD’s growth while driving the country’s semiconductor ecosystem.\nAdvanced Micro Devices Inc. (NASDAQ:AMD) is a semiconductor company that designs and manufactures high-performance computing and graphics products. It is best known for central processing units (CPUs) and graphics processing units (GPUs) used in computers, data centers, gaming consoles, and other devices.\n9. Tempus AI, Inc. (NASDAQ:TEM)\nArk Investment Equity Stake: $471.58 Million\nNumber of Hedge Fund Holders: 27\nTempus AI, Inc. (NASDAQ:TEM) is one of the top 10 stocks to buy now according to Cathie Wood. On August 13, an analyst at TD Cowen raised their price target of the stock to $72 from $62 while reiterating a ‘Buy’ rating.\nThe price target hike comes on the research firm being impressed by the company’s substantial genomic volumes and positive outlook in the Ambry business. Tempus AI continues to deliver improved performance in its genomic segment, prompting analysts to increase volume growth projections. TD Cowen also expects Tempus AI to continue gaining market share and growth in its Ambry business.\nThe growth forecast comes as Tempus AI delivered $314.6 million in revenue in the second quarter, significantly above the anticipated revenue of $297.8 million. The company also reported a narrow loss of $0.22 per share, compared to an expected loss of $0.25 per share.\nTempus AI, Inc. (NASDAQ:TEM) is a technology company focused on precision medicine by applying artificial intelligence to healthcare data. They have built an extensive library of multimodal data and an operating system to make it accessible and useful for clinicians and researchers. This enables them to deliver AI-enabled solutions for personalized patient care, facilitating the discovery, development, and delivery of optimal treatments."
    }
  ],
  "argos_summary": "The article highlights Circle Internet Group (CRCL) as a top buy, noting its 70% YTD gain, an ‘Outperform’ rating from Bernstein SocGen with a $230 target, and expectations that Q3 earnings and Ethereum/USDC growth will further boost sentiment. It also profiles other high‑profile stocks, including consumer goods names in Cathie Wood’s portfolio and a list of AI‑infrastructure plays like Fluor Corp, while discussing broader market trends such as AI energy demands, U.S. LNG export prospects, and onshoring momentum. The piece mixes analyst commentary, performance data, and strategic outlooks for these companies, underscoring their potential upside amid macro‑economic shifts. Overall, it presents a bullish case for several tech and consumer stocks driven by emerging megatrends and institutional backing.",
  "argos_id": "PVSDHMFQV"
}