{
  "url": "https://www.bloomberg.com/news/videos/2025-08-20/bloomberg-tech-8-20-2025-video",
  "authorsByline": "bn",
  "articleId": "ad36a32a132e42e0a9f5b9bc5f884347",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iMKv.22EYF78/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-20T21:22:40.060000+00:00",
  "addDate": "2025-08-20T21:45:58.133224+00:00",
  "refreshDate": "2025-08-20T21:45:58.133226+00:00",
  "score": 1.0,
  "title": "Tech Selloff Continues as Investors Question AI ROI",
  "description": "Bloomberg’s Caroline Hyde discusses the tech sell-off as shares fall for a second day. Plus Bank of America’s new chief technology and information officer talks about the bank’s use of AI as a new report from MIT shows most enterprises see no return on investment from their AI spend. And analysts offer their take on Meta restructuring its AI team again. (Source: Bloomberg)",
  "content": "> > BLOOMBERG TECH IS LIVE FROM COAST-TO-COAST WITH CAROLINE HYDE AND LEADING -- ED LUDLOW. > > THE TECH SELLOFF ACCELERATES AS INVESTORS QUESTION VALUATIONS FOR THE AI TRADE. THIS AS M.I.T. SPARKS CONCERNS. WE SPEAK ABOUT THE RETURN OF TECH INVESTORS WITH THE BANK OF AMERICA'S TOP TECHNOLOGY OFFICER. AND A MADE BY GOOGLE EVENT KICKS OFF THIS AFTERNOON. FIRST, WE RETURN TO THE MARKETS, HAVING ANOTHER UGLY DAY. WE ARE SINKING ON THE NASDAQ 100. LET'S GET TO SOME OF THE BIGGEST DRAGS. WE HAVE NETFLIX STUMBLING AND LOOKING AT PALANTIR HAVING ITS WORST TWO DAYS IN AT LEAST FOUR YEARS, SINCE 2022, OFFLINE -- OFF BY 8%. THOSE VALUATIONS ARE COMING DOWN A BIT. NVIDIA IS DOWN ABOUT 3% AND INTEL IS OUTPERFORMING THE REST OF THE MARKET PREVIOUSLY ON HOPES OF U.S. INVESTMENT FROM THE GOVERNMENT AND 2 BILLION DOLLARS FROM SOFTBANK, BUT TODAY IT SUCCUMBS TO THE ANXIETY. LET'S STICK WITH SELLOFF RISK AND THE WORRIES IN THE MARKET. WE ARE HAVING A QUESTIONING OF AI VALUATION. IS IT MACRO CONCERNS? IS IT LIQUIDITY? WHAT IS IT? > > I HAVE HEARD THIS IS A SEASONAL ISSUE WE HAVE SEEN IN PAST YEARS. THE -- YOU HAVE A NUMBER OF NAMES THAT HAVE COME UP THIS YEAR APPEARED YOU MENTIONED PALANTIR. ALSO, NVIDIA AND MAG 7 NAMES THAT HAVE HAD STRONG PERFORMANCE THIS YEAR THAT HAS BROUGHT MULTIPLES AND VALUATIONS TO LEVELS THAT ARE GETTING TOUGHER TO JUSTIFY. WE ARE OUT OF THE EARNINGS SEASON. IT IS SORT OF A SLOW NEWS ENVIRONMENT NOW AND IT SEEMS LIKE WE HAVE SEEN MOVES LIKE THIS AND WHEN YOU HAVE SUCH HIGH MOMENTUM NAMES LIKE PALANTIR YOU START TO SEE THE MOST AGGRESSIVE SELLING. CAROLINE: PALANTIR CURRENTLY TRADING AT HUNDRED 80 TIMES FUTURE PROFIT, BUT THAT IS DOWN FROM 240 TIMES FUTURE PROFITS PREVIOUSLY, TWO DAYS AGO. YOU HAVE BEEN DIGGING INTO VALUATIONS THAT RECENTLY WERE CALLED IN. I THINK OF AND TELL ME FACT THEY ADDED 24 BILLION DOLLARS IN MARKET CAPITALIZATION THIS MONTH ALONE. THAT IS COMING DOWN TODAY, BUT IT SHOWS A DESIRE TO GET INTO SOME AI RELATED NAMES. RYAN: INTEL IS A SPECIAL CASE. YOU MENTIONED REPORTS OF GOVERNMENT WANTING TO TAKE A STAKE. YOU HAD SOFTBANK WANTING TO INVEST IN THE COMPANY. I THINK THE STOCK ROSE 20% TO 30%. THIS IS THE THIRD 20% RALLY INTEL HAS SEEN THIS YEAR. WE DID SEE PREVIOUS RALLIES FADE QUICKLY. THERE CONTINUES TO BE A LOT OF QUESTIONS AND CONCERNS ABOUT WHETHER INTEL WILL BE ABLE TO REESTABLISH ITSELF AS A MAJOR PLAYER BUT ALSO CHIP DESIGN IS BEHIND NVIDIA AND AI CHIPS. IT IS BEHIND THE MANUFACTURING SIDE. THERE ARE A LOT OF QUESTIONS THERE. IT IS NOT SURPRISING TO SEE STOCK PULLBACK AFTER INITIAL EXCITEMENT, ESPECIALLY SINCE MULTIPLES GOT TO LEVELS LAST SEEN IN THE.COM ERA. CAROLINE: INTERESTING THAT SOFTBANK IS PULLING BACK AS WELL. WE HAVE SEEN A GLOBAL ANXIETY AROUND TECH. TELL US ABOUT THE NEXT SET OF CATALYSTS. AT THE MOMENT, WE HAVE BEEN TREADING WATER AROUND MACRO CONCERNS. WE GET NVIDIA RESULTS NEXT WEEK. RYAN: A LOT OF PEOPLE ARE WAITING TO SEE WHAT IS SAID THERE. THERE IS A LOT OF OPTIMISM ABOUT THE REPORT BECAUSE WE JUST CAME OUT OF EARNINGS SEASON. MAJOR CUSTOMERS AFFIRMED THEIR PLANS TO CONTINUE INVESTING AGGRESSIVELY IN AI, WHICH IS GOING TO HELP NVIDIA AMONG THE INFRASTRUCTURE PLAYS. IF THEY SAY ANYTHING ABOUT THE OUTLOOK WEAKENING OR FURTHER SKEPTICISM ABOUT CHINA, THERE IS ROOM FOR US TO CONTINUE MOVING DOWN BECAUSE WE HAVE SEEN STRONG GAINS IN SOME STOCKS SO FAR THIS YEAR. THERE IS ROOM FOR THEM TO MOVE DOWN. IF NVIDIA IS STRONG, IT IS POSSIBLE THAT IS THE SIGNAL PEOPLE USE TO BUY THE DIP AND MAYBE MOVE BACK INTO TECH. CAROLINE: THANK YOU. LET'S GET BREAKING NEWS NOW. ACTUALLY REVOLVING AROUND A BIG TECH PLAYER. MICROSOFT IS ON THE MOVE. THE COMPANY SAYS IT HAS CURTAILED CHINESE COMPANY ACCESS TO ADVANCED NOTIFICATIONS ABOUT CYBER SECURITY VULNERABILITIES IN ITS TECHNOLOGY AFTER INVESTIGATING WHETHER A LEAK LEAD TO A SERIES OF HACKS IN ITS SHAREPOINT SOFTWARE. THE ANNOUNCEMENT FOLLOWS A CAMPAIGN OF CYBERATTACKS THAT MICROSOFT BLAMED ON STATE-SPONSORED HACKERS IN CHINA WHO TARGETED SECURITY WEAKNESSES IN ITS SHAREPOINT SERVERS. WE ARE OFF BY .7%, NOT AS BAD AS THE REST OF THE MARKET, BUT STILL TRADING LOWER. LET'S GET YOU FULL CONTEXT OF THIS MARKET. WHAT A DIFFERENCE A COUPLE DAYS MAKES. WHAT DO YOU MAKE OF THE SUDDEN AI VALUATION ANXIETY? > > IN SOME WAYS, IT IS EXPECTED. YOU CANNOT EXPECT EVERYTHING TO GO UP ALL THE TIME. THERE IS SOMETHING TO BE SAID ABOUT AUGUST BEING SPECIAL IN A SEASONAL WAY, BUT THE OTHER THING IS THERE ARE PEOPLE TAKING GAINS. THERE IS FEAR THAT COMES INTO THE MARKETS. USUALLY THE ONES THAT ARE CASUALTIES FIRST ARE THE ONES WITH THE HIGHEST VALUATIONS AND BIG TECH NAMES. I DO NOT THINK THIS WILL BECOME A TREND, BUT IT IS PART OF BEING AN INVESTOR. CAROLINE: HOW DO YOU PROTECT WOULD HAVE BEEN PROFITS MADE? IS THIS A PROFIT TAKING MOMENT AND PEOPLE ARE LOCKING IN BIG WINS THAT THEY HAVE SEEN RUN UP THIS SUMMER? ANNA: IT WOULD BE PRUDENT TO LOCK IN SOME OF THOSE GAINS, BUT I DO NOT THINK YOU CAN BE OUT OF IT BECAUSE AI IS WHERE ALL THE GROWTH AND INVESTMENT IS GOING INTO IT. WE SAW A MONTH AGO THE TRUMP ADMINISTRATION BASICALLY PLEDGING HIS SUPPORT BEHIND AI AND DATA CENTERS AND INFRASTRUCTURE AND HARDWARE THAT IS PART OF IT. I THINK THIS MOVE INTO TAKING IT COULD WE STAKE IN INTEL AS PART OF THAT STORY AND ALSO PART OF THE STORY OF BRINGING MANUFACTURING BACK TO THE UNITED STATES SO THERE IS A LOT OF MOMENTUM HERE. GOVERNMENT BEING PART OF A PRIVATE COMPANY IS A DOUBLE EDGED SWORD, BUT IF WE ARE TO LOOK AT THE UPSIDE THERE IS A LOT OF SUPPORT AROUND AI AND TECH SO I DO NOT THINK INVESTORS CAN IGNORE IT. CAROLINE: WHEN YOU GET INTEL RUNNING UP VALUATION, THE MOST EXPENSIVE SINCE THE.COM ERA, SHOULD YOU PUT THAT MUCH CREDENCE IN GOVERNMENT BACKING AND THE ABILITY FOR THEM TO SECURE LONG-TERM DEMAND FOR FUTURE CHIP INNOVATIONS? ANNA: I DO NOT THINK THIS IS JUST ABOUT THE GOVERNMENT BECAUSE WE ALSO HAVE SOFTBANK COMMITTING -- TALKING ABOUT COMMITTING IN TERMS OF INVESTMENT, SO I DO NOT THINK THIS IS THE END OF IT AND ALSO I KNOW THE TRUMP ADMINISTRATION SAID THEY ARE NOT GOING TO BE TAKING A GOVERNANCE ROLE IN THIS, BUT IF YOU ARE THE U.S. GOVERNMENT AND ONE OF THE LARGEST SHAREHOLDERS, YOU CAN DEFINITELY INFLUENCE. IF THE GOVERNMENT HAS SKIN IN THE GAME, IS IT GOING TO SIT ON THE SIDELINES AND LOOK AT INTEL MAYBE NOT FOLLOWING THROUGH? I COULD SEE A SCENARIO IN WHICH THE GOVERNMENT CAN HELP GARNER CUSTOMERS. I DO NOT THINK THIS IS TAKE AN EQUITY STAKE AND BE DONE WITH THAT. CAROLINE: SOFTBANK CAME ON BOARD. MANY FELT WE COULD SEE REAL COMPETITION EVEN TO NVIDIA IN THE LONGER TERM. LET'S THINK ABOUT NVIDIA FOR A MOMENT. IT IS TWO DOWN OVER THE LAST COUPLE DAYS. MORE BROADLY, ARE THE TECH TAILWINDS STILL UP? ANNA: I THINK IT IS STILL ON. META JUST CAME OUT. I THINK THERE ARE ISSUES THERE WITH THE MANAGEMENT AND TEAM STRUCTURE. I DO NOT THINK IT IS NECESSARILY GOOD NEWS FOR META. CAROLINE: GO INTO THAT. WHY IS THE RESTRUCTURING OF THE AI DEPARTMENT, ALEXANDER WANG LEADING, WHY IS THAT NOT BAD NEWS -- GOOD NEWS FOR META? ANNA: IT IS NOT GOOD NEWS IN THE SENSE THAT MAC THE LAST TWO MONTHS WE HAVE SEEN A LOT OF RESTRUCTURING. THIS IS THE TYPE OF STUFF THAT MAKES INVESTORS NERVOUS. YOU CAN HIRE THE SMARTEST PEOPLE AT A HIGH PRICE TAG AND PUT THEM IN A ROOM AND IF THEY CANNOT WORK TOGETHER AND THEY CANNOT PRODUCE A PRODUCT THEN YOU DO NOT REALLY HAVE ANYTHING. YOU DO NOT HAVE ROI ON THAT. THIS IS THE TYPE OF STUFF THAT MAKES INVESTORS NERVOUS, SO I THINK THAT IS A META SPECIFIC PROBLEM. CAROLINE: I LOVE THAT YOU HAVE THAT IDEA OF OUR OH AI -- RO AI. WE ARE BLAMING THIS PARTICULAR REPORT SAYING 95% OF THE WORK DONE BY COMPANIES TO INTEGRATE AI HAS NOT RETURNED MONEY OR PRODUCTIVITY. WHAT DO YOU MAKE OF THE REPORT? ANNA: WHAT WOULD YOU EXPECT? THIS IS SUCH NEW TECHNOLOGY. I THINK YOU HAVE TO EXPECT A LOT OF THESE EFFORTS TO FAIL IN THE BEGINNING. YOU HAVE TO HAVE FAILURES BEFORE YOU CAN HAVE -- THAT IS WHY LOOK AT THE AI NUMBERS AS INCUBATION. TO LOOK AT ROI AND EXPECTED WITHIN A YEAR OR TWO OF EMBARKING AND INVESTING IN IT IS TOO SOON. I THINK THIS IS A LONG-TERM PLAY, SO THAT REPORT WAS EXPECTED IN MY MIND. CAROLINE: IT IS GREAT TO HAVE YOU BACK ON. COMING UP, WE ARE GOING TO BE DIGGING INTO THE RETURN ON AI INVESTMENT AND HARI GOPALKRISHNAN OF BANK OF AMERICA, ALL ABOUT FOCUSING ON ARTIFICIAL INTELLIGENCE AND TECH MORE BROADLY. LET'S GET TECH MORE BROADLY FOR A MOMENT. WE ARE OFF BY 1.5% ON THE NASDAQ 100. THE SEMI CONDUCTOR INDEX OFF BY 2.4%. PALANTIR HAVING ITS WORST COUPLE DAYS IN THREE YEARS. THIS IS BLOOMBERG TECH. ♪ CAROLINE: ORACLECAROLINE:'S CLOUD INFRASTRUCTURE UNIT HAS PROPELLED THE CEO TO BE THE SECOND RICHEST PERSON IN THE WORLD. GETTING A FOOTHOLD AMONG KEY CUSTOMERS TIKTOK, OPENAI. FOR MORE, BRADY JOINS US NOW. ORACLE ALMOST PUSHED AGAINST THIS TREND AND NOW THEY ARE INTO IT. > > 2008, LARRY ELLISON GAVE A SPEECH SAYING THE CLOUD IS GIBBERISH. THEY WERE MAKING SO MUCH MONEY AND CONTINUE ON OLD-SCHOOL DATABASE SOFTWARE, BUT AT THE LAST COUPLE YEARS THEY HAVE MANAGED TO REINVENT THEMSELVES FROM A LEGACY COMPANY TO ONE OF THE CENTER OF THE AI BOOM. THERE IS NO BETTER EXAMPLE THAN THEIR WORK WITH OPENAI AND STARGATE. WE HAVE THE DETAILS ON ONE NEW DATA CENTER IN WEST TEXAS. THEY WILL SPEND OVER $1 BILLION PER YEAR. THAT IS BEFORE CONSTRUCTION. THAT IS BEFORE ALL THE CHIPS. THE SCALE OF THE CLOUD BUILD OUT FOR AI IS A COMICAL SCALE THAT WE HAVE NOT SEEN BEFORE AND ORACLE HAS FOUND ITSELF AT THE CENTER OF IT. CAROLINE: LET'S TALK ABOUT WHO HAS DRIVEN THIS BECAUSE THE CEO -- HOW MUCH HAS SHE BEEN PINPOINTING THIS GROWTH AREA? WHAT DO YOU MAKE OF THE INTERNAL WORKING OF THE BUSINESS? BRADY: WE SPOKE WITH A LOT FOLKS CLOSE TO THE BUSINESS. THE CEO -- EVERYBODY WANTS MONEY FOR YOU -- FROM YOU APPEARED FOR A LONG TIME, SAFRA SAID WE ARE NOT GIVING YOU THE MONEY IT TAKES TO BUILD THESE DATA CENTERS. THEN THESE BIG DEALS STARTED HITTING. TIKTOK IN 2022 WAS MAKING SO MUCH MONEY IT WAS BIGGER THAN THE ENTIRE REST OF ORACLE'S CLOUD PUT TOGETHER. SHE SAW DEALS LIKE THAT AND OPENAI AND THAT IS WHEN IT BECAME CLEAR THIS IS NOT JUST PART OF ORACLE'S BUSINESS THIS IS GOING TO BE THE BUSINESS. WALL STREET EXPECTS BY 2029 THAT CLOUD WILL BE THE LARGEST SHARE OF ORACLE REVENUE. THIS IS A TRUE REINVENTION OF THE COMPANY FOR GOOD AND POTENTIALLY FOR BAD. IT IS A LOWER MARGIN BUSINESS. THERE IS MORE RISK, BUT FOR NOW THE SENTIMENT IS GOOD AND SOMETHING IS WORKING WELL FOR THEM. CAROLINE: AND THE BREADTH OF CUSTOMER HERE. WE THINK OF TIKTOK AND WE KNOW THEY ARE A KEY INFRASTRUCTURE PLAYER. WE KNOW THE RELATIONSHIP WITH STARGATE AND OPENAI, HOW BROAD IS THIS GETTING? BRADY: IT IS A BIT CONCENTRATED. THE MAJORITY OF THE BACKLOG IS A IDEALS, LARGELY TRAINING. THERE ARE QUESTIONS OUT THERE AROUND HOW LONG THE TRAINING LASTS, WHAT ARE THE MARGINS OF IT. IT IS AN IMPRESSIVE CUSTOMER LIST. WE HAVE OPENAI AND TIKTOK AND ELON MUSK'S XAI AND ALL THE AI NAMES THAT WE ALL KNOW, SO THEY HAVE SIGNED ALL THE RIGHT PEOPLE BUT THE REAL TEST GOING FORWARD IS CAN YOU SELL THESE FOLKS MORE THAN JUST GP USE? CAROLINE: AND WHAT CAN THEY DO WITH THEM? THANK YOU. LET'S TALK ABOUT WHAT YOU CAN DO WITH ALL THIS COMPUTE AND HOW IT ULTIMATELY BRINGS PRODUCTIVITY. A STUDY FROM M.I.T. SAYS DESPITE THE BILLIONS ENTERPRISES HAVE SPENT ON GENERATIVE AI, ONLY 95% OF ORGANIZATIONS SAY THEY ARE GETTING ZERO RETURN THE'S FAR. ONLY 5% HAVE GOT ANY RETURN. IS THIS TRUE? HARI GOPALKRISHNAN IS WITH US FROM BANK OF AMERICA. YOU HAVE BEEN A BANK OF AMERICA FOR 14 YEARS BUT RECENTLY TAKEN ON THIS GLOBAL JOB. BASICALLY, IF YOU TRY TO MAKE IT UP AND BUILD SOME CHATGPT LIKE PRODUCTS, I DID NOT ALWAYS WORK, BUT WHAT HAVE YOU BEEN DOING TO MAKE THINGS WORK FOR BANK OF AMERICA? HARI: THANKS FOR HAVING ME. WE GET TO SERVE 70 MILLION CLIENTS EVERY DAY AND AI IS NOT NEW TO US. IF I CAN OFFER YOU SOUNDBITES WHAT WE HAVE SEEN IN YOU LAST FIVE YEARS, 99% OF CUSTOMERS INTERACT WITH US DIGITALLY. AND THE CONSUMER BUSINESS, WE HAVE 65% OF OUR ACCOUNT OPENING IS DIGITALLY DONE. 10 YEARS AGO, A 0%. OUR CLIENT SATISFACTION NUMBER HAS GONE FROM THE HIGH 70'S TO 89.1. BETTER CLIENT SATISFACTION. SHIFT TO MORE SELF-SERVICE CHANNELS AND AUTOMATION ALWAYS YIELDS GREAT RESULTS AND AI HAS BEEN PART OF THE JOURNEY FOR US. CAROLINE: THE CUSTOMER PERSPECTIVE IS ERICA BUT YOUR EMPLOYEE BASE -- HOW HAVE THEY BEEN ADOPTING GENERATIVE AI? HARI: OUR FIRST JOURNEY STARTED WITH THINGS LIKE FRAUD ALGORITHMS. WE HAVE 250 MODELS IN PRODUCTION WITH THINGS LIKE AI MODELS AND WE REALIZED HUMANS WANTED TO INTERACT WITH MACHINES IN A MORE HUMANISTIC FASHION. BEFORE LARGE LANGUAGE MODELS CAME ALONG, WE THOUGHT ABOUT THINGS LIKE ERICA, THAT ALLOWS A CUSTOMER TO SAY A FEW WORDS AND FOR US TO FIGURE OUT WHAT THEY WANT. THAT IS WHERE WE HAVE SEEN SIGNIFICANT ADOPTION. WE HAD A PRESS RELEASE THAT WE NOW HAVE 3 BILLION TRANSACTIONS CONDUCTED ON ERICA. THAT CONTINUES TO GROW AT A NEXT FINANCIAL PACE SO THAT IS OUR CLIENTS AND CUSTOMERS SAYING YOU LIKE TO ENGAGE WITH YOU THIS WAY. WHEN HE PIVOTS TO OUR EMPLOYEE BASE, THEY ARE LIKE, WHY CAN'T WE USE THE SAME CAPABILITY? WE HAVE TAKEN THE PLATFORM AND BROADENS THE USE. A HIGH NET WORTH ADVISOR CAN SAY, I NEED TO HEAR ABOUT COMPLEX POLICY IN DELAWARE. CAN YOU TELL ME HOW TO TALK TO THE CLIENT ABOUT IT? OR RECENT HAS BEEN I'M ABOUT TO MEET A CLIENT. HOW DO I PREPARE FOR THE MEETING? BEFORE, A JUNIOR BANKER WOULD TAKE DAYS TO PREPARE. NOW WE CAN USE GENERATIVE AI TO CREATE A FIRST DRAFT THAT SAVES HOURS. CAROLINE: IN MANY WAYS, THIS IS YOUR SECRET SAUCE, BUT I AM READING YOU HAVE 7800 PATENTS OF YOUR OWN. HOW MUCH ARE YOU HAVING TO DEPEND ON PURPOSE BUILT GENERATIVE AI? HOW MUCH ARE YOU LOOKING TO AI FOR ENTERPRISE OFFERINGS? HARI: WE HAVE A MULTILEVEL APPROACH. WE HAVE ENOUGH REALITY TO KNOW WE ARE NOT GOING TO BUILD FOUNDATION MODELS. WANT TO BUILD UPON ALL THE INVESTMENT HAPPENING IN THE INDUSTRY BUT THEY ARE CALLED FOUNDATION MODELS BECAUSE THEY LET YOU DO THINGS ON TOP OF THEM. HAVE A LEVEL WHERE WE WILL EMBRACE COMMODITY. I THINK A LITTLE BIT OF EVERYTHING. WE DO NOT WANT TO BE WEIGHTED TO ANY SINGLE SOLUTION. WHEN IT COMES TO COMPLEX WORKFLOWS, WHEN YOU THINK ABOUT BUSINESS PROCESSES, IF IT WAS AS SIMPLE AS BUY SOMETHING OFF THE SHELF, EVERYONE OF US WOULD BE DONE. YOU HAVE TO TAKE THESE MODELS IN AND THE WAY YOU UNLEASH PRODUCTIVITY IS APPLYING THESE TO OUR BUSINESS PROCESS, UNDERSTANDING HOW YOUR CURRENT PROCESS WORKS. FIGURE OUT WHERE YOU CAN ELIMINATE PARTS OF IT AND THEN USE AI TO GO AFTER IT. WE HAVE SEEN TREMENDOUS RESULTS. CAROLINE: YOU SAID WE ARE COUNTING. HOW ARE YOU MEASURING PRODUCTIVITY GAIN APART FROM INTERACTIONS AND NUMBERS? HARI: WE HAVE 17,000 DEVELOPERS IN MY TEAM THAT USE CODING AGENTS TO HELP DAY-TO-DAY ACTIVITIES. WITHIN THAT, WE MEASURE THINGS LIKE DEFECT DENSITY AND PRODUCTIVITY METRICS AND WE LOOK AT BEFORE AND AFTER. WE EXPECT TO DO SIMILAR THINGS ON A BUSINESS PROCESS BASIS TO UNDERSTAND THE METRICS WHEN WE WENT INTO THE PROBLEM, HOW WE DEPLOY CAPABILITIES, SO WE NEED TO MAKE SURE THERE IS AN ROI COMPONENT BUT BE ABLE TO SEE WHAT COMES OUT AND BELFAST IF IT SEEMS LIKE A PROCESS DOES NOT LEND ITSELF. CAROLINE: OF EMPLOYEES EMBRACING THESE CODING AGENTS, HOW ARE THEY FEELING ABOUT BEING AUGMENTED OR REPLACED? HARI: IT ALLOWS US TO GET TO A BACKLOG THAT WE CAN EVER GET TO. THERE'S ALWAYS MORE WORK THAN YOU CAN GET TO. THE FIRST REACTION FROM TEAMMATES IS THIS FREES THEM TO DO MORE INNOVATIVE WORK RATHER THAN MONDAY AND WORK THAT WAS CONSUMING TIME AND RESOURCES. I THINK WE WILL SEE THAT PATTERN PLAY OUT OVER TIME. CAROLINE: IT IS WONDERFUL TO SPEAK WITH YOU. HE IS THE CHIEF TECHNOLOGY AND INFORMATION OFFICER AT BANK OF AMERICA. COMING UP, LAST YEAR'S BEST-SELLING GAME GETS A SEQUEL. MEANWHILE, WE ARE WATCHING SHARES OF THE NASDAQ, DOWN FOR A SECOND STRAIGHT DAY. WE BOUNCE OFF OUR LOWS BUT CLEARLY ANXIETY IN THE MARKET AROUND TECH VALUATIONS. THIS IS BLOOMBERG TECH. ♪ CAROLINE: TALKING TECH. XIAOMI ANNOUNCE ITS STRATEGY AFTER POSTING A 31% RISE IN QUARTERLY REVENUE BOOSTED BY THE LAUNCH OF ITS SECOND EV. ACCORDING TO THE XIAOMI PRESIDENT, THE COMPANY IS DOING RESEARCH AND PREPARATION. THERE IS NO SPECIFIC PRODUCT PLAN YET. SHARES OF BAIDU ARE LOWER AS IT FACES ECONOMIC DOWNTURN IN CHINA. AI RIVALS AND DIFFICULTY IN NET GROWTH AREAS IN PARTICULAR. CHINA IS LOOKING TO GENAI TO DRIVE FUTURE GROWTH WAS STRUGGLING AS OPEN-SOURCE MODELS LIKE DEEPSEEK GAIN TRACTION. A STARTUP GAME HAS UNVEILED IS WORKING ON A SUCCESS -- THE COMPANY SHOULD OFF A TEASER TRAILER TO THE SEQUEL TO 2024'S \"BLACKSMITH: -- BLACK MYTH: WUKONG. META MAKING RESTRUCTURING MOVES OF ITS AI GROUP. THE DETAILS NEXT. FIRST, LET'S CHECK IN ON MARKETS. WE ARE DOWN SIGNIFICANTLY, THE NASDAQ 100 ACCELERATING LOSSES. WE ARE SEEING SOME OF THE WORST SELLOFF IN A FEW MONTHS AND NAMES LIKE PALANTIR ERODING VALUATION, HAVING ITS WORST COUPLE DAYS IN THREE YEARS. OTHER NAMES SUCH AS APPLE CONTRIBUTING TO THE POINT PERSPECTIVE. THIS IS BLOOMBERG TECH. ♪ CAROLINE: LET'S TAKE A LOOK AT THESE MARKETS. WE ARE BOUNCING OFF OUR LOWS. WORST SELLOFF SINCE ABOUT APRIL. WE HAVE SOME DEEP EXCITING SURROUNDING VALUATIONS PARTICULARLY IN THE AI TREE IN, WHETHER CONCERNS AS WE ANTICIPATE JAY POWELL AND FED TALK, WHAT RATES ME, BUT ALSO WHAT VALUATIONS TO EXTREME LEVELS MEAN WHEN YOU HAVE ENTERPRISE NOT FULLY ADOPTING PRODUCTIVITY AS ANTICIPATED. LET'S MOVE TO THE INDIVIDUAL MOVERS THAT WE KEEP AN EYE ON, OFF BY 5.5% FOR PALANTIR, WORST SELLOFF IN A COUPLE YEARS. INTEL IS WIPING OUT A LOT OF YESTERDAY'S GAINS AFTER ENTHUSIASM AROUND SOFTBANK INVESTING IN THIS COMPANY AND TALK OF THE U.S. GOVERNMENT TAKING A STAKE. WE PULL BACK ON INTEL AS PEOPLE LOCK IN PROFITS ON META, DOWN FOR THREE STRAIGHT TRADING DAYS, HAVING LOST 5.6% IN THOSE THREE DAYS. LET'S STICK WITH META, THE COMPANY ANNOUNCING ANOTHER RESTRUCTURING OF ITS AI GROUP PURSUING SUPER INTELLIGENCE. IT WILL SPLIT ITS AI TEAM INTO FOUR DISTINCT TEAMS AND MOVE -- A MOVE THE COMPANY SAYS WILL ALLOW IT TO CAPITALIZE ON RECENTLY ACQUIRED TALENT. YOU ARE IN SAN FRANCISCO DIGESTING WHAT SEEMS TO BE A FOCUS ON LLM'S STILL ON THE FRONT TIER RESEARCH WITHIN THE APPLICATION OF THIS RESEARCH AND INFRASTRUCTURE. > > YESTERDAY, WE WERE ABLE TO OBTAIN A MEMO SHARED BY THE NEW CHIEF OF META SUPER INTELLIGENCE LABS. HE IS LAYING OUT THE STRUCTURE FOR THIS ORGANIZATION AFTER WEEKS OF EFFORT TO HIRE TALENT. THIS IS HUNDREDS OF MILLIONS OF DOLLARS, SOMETIMES NEARING BILLION-DOLLAR TOTAL COMPENSATION FOR INDIVIDUAL AI RESEARCHERS AND NOW THEY ARE FINDING THEIR HOME WITHIN THESE FOUR TEAMS. CAROLINE: HOW ARE YOU SEEING WHAT SOME HAVE REPORTED BEHIND THE SCENES OF SOME JOSTLING OR DISCOMFORT WITH WHAT HAD BEEN SUDDENLY EXPENSIVE TALENT COMING IN AND A REORG -- REORIENTATION OF WHERE FOCUS IS? DOES THIS BETTER ALIGN TALENT AND PUSH FORWARD AND IS IT OPEN LARGE LANGUAGE MODELS? ARE THEY GOING TO DELVE INTO CLOSED ONES? > > THAT IS A BURNING QUESTION FOR ALL OF US. ONE TEAM WILL CONTINUE TO BE DEDICATED TO LARGE LANGUAGE MODELS, THE PRODUCT THAT UNDERPINS THE AI EFFORTS BROADLY AND THE ONE TEAM I REALLY AM KEEPING AN EYE ON IS THE INFRASTRUCTURE TEAM. MARK ZUCKERBERG PLEDGED TO SPEND HUNDREDS OF BILLIONS OF DOLLARS ON AI INFRASTRUCTURE AND NOW WE ARE SEEING TALENT FROM WITHIN THE COMPANY GO AND LEAD THAT EFFORT. WE EXPECT MORE CAPITAL TO BE DEPLOYED THIS YEAR AND NEXT. CAROLINE: LET'S GET SOME OF THE INVESTOR ANALYSIS NOW. THAT COMMITMENT TO INFRASTRUCTURE, THAT MONEY, IS IT PROVING OUT? > > SO FAR, WHAT WE HAVE SEEN LOOKING BACKWARDS THE LAST 12, PERHAPS 15 MONTHS, META IS PROBABLY THE BEST POSTER CHILD IN PROVIDING QUALIFIABLE RETURNS ON INVESTMENT IN AI INFRASTRUCTURE. THE COMPANY HAS DEMONSTRATED ACCELERATING REVENUES AND UPSIDE TO INDUSTRY GROWTH AND OTHER BELLS AND WHISTLES AROUND AI INVESTMENT. LOOKING BACKWARDS, DEFINITELY. LOOKING FORWARD, THAT IS THE QUESTION. CAROLINE: THEY HAVE BEEN ABLE TO MAKE IT WORK FOR ADVERTISING AND THE BUSINESS MODEL, BUT FOR SUPER INTELLIGENCE, WHAT BUSINESS MODEL DOES THAT ALIGN WITH FOR META? HOW MUCH ARE WE GOING TO SEE GENERATIVE AI AFFECT THE WAY IN WHICH WE INTERACT AND COMMUNICATE? ROHIT: THE PROBLEMS THAT META HAS TRIED TO SOLVE USING AI AND USING SUPER INTELLIGENCE ARE COMPOUNDING WITH THE DATA THAT THEY ARE COLLECTING AND THE POSSIBLE BUSINESS MODELS THEY ARE EXPLORING. THEY HAVE INVESTED A LOT IN AUGMENTED REALITY AND VIRTUAL REALITY GLASSES FOR THE LAST FOUR YEARS. NOW PROBABLY WE ARE LOOKING AT 2027 FOR THE LAUNCH SO THERE IS A TIMETABLE WITHIN THOSE GLASSES. I THINK THAT WILL TAKE A LOT OF MONEY AND INTEGRATING THE THREE APPS THEY HAVE, THE THREE LARGEST MOBILE APPS IN THE WORLD, OVER BILLIONS OF PEOPLE USING ON A DAILY BASIS, TO MAKE THOSE SUPER INTELLIGENT AND STICKY IS A MONUMENTAL INVESTMENT FOR THEM. THESE ARE OPPORTUNITIES, BUT BOTH ARE GOING TO BE SOMETHING THAT ZUCKERBERG IS GOING TO BE FULLY INVESTED IN. CAROLINE: AT $1.87 TRILLION, IS THAT A FULL VALUATION FOR THIS FULL INVESTMENT THEME YOU HAVE? ROHIT: THE LAYERS UNPACKING IN THE FUTURE IS GOING TO BE SOMETHING WE ARE GOING TO BE EXCITED ABOUT. WE HAVE STILL NOT YET SCRATCHED THE SURFACE OF THE POTENTIAL GENAI ON A LARGE, MULTIDIMENSIONAL PLATFORM LIKE META. ZUCKERBERG IS INVESTING AS IF IT IS AN EXISTENTIAL, ONCE IN A LIFETIME OPPORTUNITY TO EVEN BIGGER THAN WHEN IPHONE WAS LAUNCHED, SO I FEEL THE EXCITEMENT AND ATTITUDE THAT THEY CAN DISRUPT THE APPLE CARD WHILE DOING SOMETHING NEW IS SOMETHING INVESTORS ARE WILLING TO BE PATIENT AROUND CAROLINE:, AND SO ARE WE. YOU STILL HAVE A BUY RATING. COMPARE AND CONTRAST OTHER KEY COMPANIES THAT YOU ANALYZE. YOU ARE LOOKING AT ALPHABET AND AMAZON. ARE THEY AS BIG OF WINNERS? DO THEY HAVE AS GOOD A ROADMAP AS YOU ARTICULATE FOR META? ROHIT: SO FAR, META IS THE WINNER. AMAZON IS PROBABLY NUMBER THREE AND GOOGLE IS A NUMBER TWO WINNER. FOR DEMO SHOOTING RETURNS ON GENAI INVESTMENT. I THINK THE COMPLEX PROBLEMS THAT EACH OF THESE LARGE COMPANIES ARE SOLVING OR TRYING TO SOLVE USING AI ARE ESSENTIALLY COMPOUNDING EVERY DAY. THAT IS LEADING TO MORE INVESTMENT AND MORE INVESTMENT NEEDED TO SOLVE THOSE PROBLEMS. THINK OF THE MULTIDIMENSIONAL E-COMMERCE CLOUD ADVERTISING, PRIME VIDEO, SAME-DAY DELIVERY. ALL THESE ELEMENTS CAN BE OPTIMIZED USING AI AND AT ANY GIVEN TIME AMAZON IS FOCUSED ON ONE OR TWO OF THOSE. OVER THE LONGER ARC, THE BIGGER WINNERS PROBABLY GOING TO BE A COMPANY LIKE AMAZON GIVEN THE SURFACE AREA OF IMPROVEMENT AND POTENTIAL, BUT IN THE NEAR TERM PROBABLY A ONE TRICK PONY LIKE FACEBOOK HAS EXECUTED BETTER IN THE LAST 18 MONTHS AND THEY ARE DEMONSTRATING BETTER RETURNS TODAY. CAROLINE: I HATE TO TALK ABOUT THE NEAR TERM BECAUSE I KNOW YOU LIKE TO GIVE LONGER-TERM PROJECTIONS, BUT WHEN YOU ARE SEEING A SELLOFF LIKE WE HAVE HAD, A LOT OF IT IS TIED UP WITH WORRIES AND THE STATE OF AI AND BUSINESS. DO YOU GIVE CREDENCE TO THAT? DO YOU THINK THERE IS A LACK OF NUANCE OR WE SHOULD BE WORRIED ABOUT HOW MUCH WE ARE INVESTING IN RETURNS ON IT? ROHIT: THERE ARE TWO WAYS TO INTERPRET THE OVERALL QUESTIONS BEING RAISED. WE APPLIED GENAI AND INVESTED SO MUCH WHAT ARE NOT GETTING THE RETURNS AS MUCH AS WE WANTED. THE WAY THESE LARGE COMPANIES ARE TRYING TO SOLVE LARGE PROBLEMS, THE EFFICIENCY GAINS THEY WILL PROVIDE OVER THE NEXT 12 MONTHS ARE SOMETHING WE ARE CONFIDENT ON. WHETHER THAT TRANSLATE INTO REVENUE UPLIFT REMAINS TO BE SEEN. ONLY A COMPANY LIKE META HAS DEMONSTRATED THAT OTHER GUYS ARE GOING TO -- THAT IS WHY META IS THEY WANT TO BUY. CAROLINE: IT IS GREAT TO CATCH UP WITH YOU. COMING UP, A PLATFORM USED TO AUTOMATE COMPLEX TASKS IN HEALTH CARE AND HOUSING ANNOUNCED ITS LATEST FUNDING ROUND. WE WILL DIG INTO IT NEXT. LET'S CHECK IN ON MARKETS. I WANT TO SHOW YOU THE NASDAQ 100 IS NOW DOWN ONLY .9%, LOWER EARLIER IN TRADE, SO WE ARE CLAWING BACK SOME LOSSES AND BITCOIN HAS TURNED INTO THE GREEN VERSUS WHAT WE HAVE SEEN OF LATE. NEVERTHELESS, A LITTLE BIT OF BUYING IN THE MARKET. THIS IS BLOOMBERG TECH. ♪ ELISE AI ANNOUNCED A SERIES EE ROUND. THE START UP FOUNDED IN ACT 2017 OFFERS OPPOSITIONAL AI FOR USERS . THE CEO AND FOUNDER IS HERE WITH ME. YOU ARE BASED IN NEW YORK. HOW WAS IT RAISING THESE FUNDS? HOW QUICKLY ARE YOU ABLE TO RAISE SUCH AN ENORMOUS AMOUNT OF MONEY QUESTION MARK -- MONEY? > > IT WAS PRETTY QUICK. INVESTORS ARE EXCITED ABOUT INVESTING IN VERTICAL AI THAT SOLSTICES -- SPECIFIC PROBLEMS FOR SPECIFIC INDUSTRIES, WHICH IS WHAT WE DO IN THE HOUSING AND HEALTH CARE INDUSTRIES. CAROLINE: WHY THOSE INDUSTRIES? WAS IT THE PAIN POINTS WERE SO OBVIOUS TO YOU? MINNA: IT IS PRETTY OBVIOUS TO ALL OF US HOW INEFFICIENT AND LIMITED THE TECHNOLOGY IS WHEN WE INTERACT WITH THESE INDUSTRIES, BUT THE CORE MISSION OF THE COMPANY HAS ALWAYS BEEN TO DEVELOP ADVANCED TECHNOLOGY FOR INDUSTRIES THAT SERVE FUNDAMENTAL HUMAN NEEDS. HOUSING AND HEALTH CARE ARE SOME OF THE MOST IMPORTANT DECISIONS WE MAKE AND MOST BASIC NEEDS WE HAVE AS HUMANS. CAROLINE: YOU ARE SELLING CONVERSATIONAL AI BUT THEN IT IS ME THAT ENDS UP EXPERIENCING IT AS A CONSUMER. HOW HAVE YOU' SEEN HEALTH CARE INSTITUTIONS AND HOUSING INSTITUTIONS''S WILLINGNESS TO PURCHASE THESE PRODUCTS? > > THEY ARE EXCITED TO USE IT. ONE IN EVERY EIGHT APARTMENTS ARE USING OUR AI SOFTWARE. WE ARE USING AI TO AUTOMATE MANUAL PROCESSES. THESE INEFFICIENCIES AFFECT ALL OF US. WHEN AN INDUSTRY IS AN EFFICIENT, THEN THAT DRIVES UP COSTS FOR OWNERS, WHICH TRICKLES DOWN TO RENTERS, WHICH IS IMPORTANT AND AFFECTS ALL OUR LIVES. THERE IS A LOT OF EXCITEMENT ABOUT IT. CAROLINE: WITH THE MONEY, YOU DO WANT? MINNA: A SIGNIFICANT AMOUNT OF FUNDS GO TO EXPANDING OUR TEAMS, SO A LOT OF ENGINEERING TEAM MEMBERS, RESEARCH, OPERATIONS, AND MORE. THERE ARE EXPANDING OUR OFFICES IN NEW YORK CITY AND BOSTON. WE ARE LOOKING FOR PEOPLE WHO WANT TO HAVE REAL-WORLD IMPACT AND SOLVE IMPORTANT PROBLEMS THAT IMPACT MILLIONS OF LIVES. CAROLINE: WE HAVE TALKED ABOUT TALENT WARS AND HOW EXPENSIVE CERTAIN RESEARCH HAS BECOME. IS IT THE MISSION THAT ATTRACTS THEM OR THE PAYCHECK AND REWARD? MINNA: THE MISSION. PEOPLE WHO WANT TO APPLY THESE ADVANCEMENT IN ARTIFICIAL INTELLIGENCE WANT TO SEE REAL-WORLD IMPACT THAT CAN AFFECT ALL OF US. CAROLINE: HOW DO YOU OFFER -- WHEN YOU THINK ABOUT PACKAGES -- ARE PEOPLE COMING ON BOARD ON TEAM TO SEE A ROADMAP FOR YOU TO GO PUBLIC? MINNA: WE ARE FOCUSED ON BUILDING A GENERATIONAL COMPANY. WE WANT TO CHANGE THE FACE OF HOUSING IN HEALTH CARE AND WE WANT PEOPLE TO LOOK BACK ON IT AND SAY I CANNOT IMAGINE WHAT IT WAS LIKE BACK WHEN ALL OF THESE SERVICES WERE SO EXPENSIVE. WHY WERE THEY LIKE THAT? AND PEOPLE WHO ARE JOINING WANT TO BE PART OF MAKING THAT CHANGE HAPPEN. CAROLINE: HOW DO YOU CALL HIM ANY ANXIETY THAT YOU ARE NOT GOING TO SUDDENLY DO A BIG PURCHASE WHERE U.S. FOUNDER GET LIFTED BUT LEAVE OTHERS BEHIND? HOW DO YOU ENSURE THIS IDEA THAT YOU TAKE THE TEAM WITH YOU REMAINS RESILIENT? > > WE HAVE BEEN DEDICATED TO THE MISSION OF THE COMPANY AND THERE IS SO MUCH MORE THAT WE ALL WANT TO BE PART OF TO MAKE THIS ALL HAPPEN AND IT IS AN EXCITING JOURNEY TO BE ON. WE HAVE NO PLANS TO DO THAT. CAROLINE: IT SEEMS CLIENTS SPEAK HIGHLY ABOUT THE IMPACT THEY WERE TECHNOLOGY IS HAVING, SERVING PEOPLE IN HEALTH CARE AND HOUSING. WE CONGRATULATE HER. MEANWHILE, SOARING VALUATIONS COMING FROM THE MAJOR FOUNDATIONAL MODELS. THINK OPENAI BUT ALSO DATA BRICKS. THEY ARE CREATING PERHAPS A FULL SENSE OF STRENGTH. ONLY THE TOP 1% OF COMPANIES ARE PULLING IN THE MAJORITY OF CAPITAL AND MORE INVESTORS ARE BEGINNING TO WORRY ABOUT THE HEALTH OF YOUNG SILICON VALLEY STARTUPS. YOU HAVE BEEN IN COVERING SOME OF THE TRENDS, SO THESE BIG VALUATIONS COVER UP A DARKSIDE? > > THERE IS A TALE OF TWO MARKETS IN VENTURE CAPITAL RIGHT NOW. YOU HAVE AI MEGA COMPANIES RAISING ROUNDS IN WHAT FEELS LIKE A MONTHLY CADENCE AND THEN YOU HAVE OTHER STARTUPS AND MANY OF THEM ARE STRUGGLING OR RAISING DOWN ROUNDS. CAROLINE: WE JUST HAD ELISEAI, ACTUALLY MANAGING TO RAISE, BUT WHO ARE THOSE WHO HAVE BEEN LEFT BEHIND, PARTICULARLY WHO DID WELL IN 2021 AND DO NOT WANT TO HAVE TO ADMIT THEY ARE FACING A DOWN ROUND? > > IT IS A LOT OF THE UNICORNS MINTED IN 2021. VC'S CALL THESE THE NON-AI NATIVE COMPANIES THAT ARE TRYING TO INCORPORATE AI BUT THEY WERE BORN BEFORE CHATGPT. CAROLINE: SOME OF THEM HAVE MADE THE PIVOT. THEY MANAGED AN IPO AND PEOPLE HAVE MANAGED TO THINK OF THEM AS A GENERATIVE AI BUSINESS EVEN THOUGH THEY HAVE INTEGRATED AS THEY GREW. WHERE ARE SOME OF THE PITFALLS AND INDUSTRY EXPOSURES THAT WE ARE NOT LIKING NOW? KATE: YOU HAVE TO LOOK AT E-COMMERCE, FINTECH, CRYPTOCURRENCY. THERE ARE AREAS WHERE INVESTORS ARE NOT AS EXCITED BECAUSE THEY DO NOT SEE HOW GENERATIVE AI CAN HELP THAT BUSINESS. THE POINT OF WEAKNESS ARE THE COMPANIES THAT RAISE HIGH VALUATIONS DURING THE LAST HYPE CYCLE AND INVESTORS DO NOT SEE A PATH TO ALLOWING THEM TO RAISE MONEY AT A HIGHER PRICE SO THOSE COMPANIES ARE BECOMING WHAT VC'S CALL ZOMBIE UNICORNS AND SLOWLY DYING. CAROLINE: WILL THEY BE ALLOWED TO DIE? WILL THEY BE FORCED TO CONSOLIDATE? KATE: THERE WILL BE SOME CONSOLIDATION, BUT YOU WILL SEE COMPANIES QUIETLY DISAPPEAR AND DIE OVER TIME. OF COURSE THERE WILL BE WINNERS AND COMPANIES THAT STILL FIND SUCCESS. CAROLINE: AND YOU WILL BE THERE TO DOCUMENT IT ALL. COMING UP, MADE BY GOOGLE 2025 STARTS LATER TODAY. LET'S CHECK IN ON THE MARKETS MORE BROADLY. WE TALK ABOUT SOME PRIVATE BUBBLES AND SAM ALTMAN CAUSED WAVES BY SAYING MAYBE THERE WAS A BUBBLE IN AI BUT HE IS NOT ONE OF THEM. NASDAQ 100 OFF BY PERCENTAGE POINT. BITCOIN TURNS AROUND A BIT. THIS IS BLOOMBERG TECH. ♪ CAROLINE: GOOGLE IS SET TO SHOW OFF NEW PIXEL HARDWARE AT ITS NEW MADE BY GOOGLE EVENT. LET'S TALK ABOUT HOW IMPORTANT IS THE HARDWARE FOR ALPHABET, PARENT COMPANY OF GOOGLE. > > EVERYONE REALIZES GOOGLE HAS AN ADVANTAGE ON THE CUSTOM CHIP SIDE. I THINK THAT IS GOING TO SHOW UP REPEATEDLY. THEY RELEASE PIXEL EVERY YEAR, SO YOU WILL SEE A BETTER PIXEL VERSION THAT CAN RUN LLM'S NATIVELY. THAT IS THE ONE THING EVERYONE WANTS APPLE TO DO. I THINK GOOGLE IS ALREADY DOING THAT. ON DEVICE LLM'S IS NOT BIG THAT UP -- OF AN OPPORTUNITY NOW, BUT WHATEVER PEOPLE THINK IN TERMS OF AI AGENTS, TO ME AI AGENT OPPORTUNITY WILL COME THROUGH ON DEVICE LLM'S. THERE WILL BE APPS THAT GRANT -- RUN AI LLM'S. BROWSER IS IMPORTANT. IN THE CASE OF GOOGLE, THEY HAVE CHROME BROWSER FOR NOW. AND LAYERING IT ON THE OPERATING SYSTEM GIVES IT A UNIQUE ADVANTAGE ALONG WITH THE CHIPS SO THAT IS WHAT I FEEL THEY WILL EMPHASIZE. CAROLINE: THIS ASSET IS USEFUL TO THEM AND ONLY USEFUL TO THEM. BUT COMPARE AND CONTRAST HOW IMPORTANT IT IS TO SHOW OFF WITHIN THEIR HARDWARE. SAMSUNG WAS ALSO INFUSED WITH GEMINI. MANDEEP: FROM THAT PERSPECTIVE, WHAT GOOGLE HAS DONE IS TO SHOWCASE AI CAPABILITIES ON ALL KINDS OF HARDWARE. EVEN THE EARBUDS THAT THEY WILL SHOWCASE I EXPECT WILL HAVE SOME INTEGRATION OF AI INTO WEARABLES BECAUSE THAT IS WHAT THEY WANT TO SHELL. AT THE END OF THE DAY, LLM'S WILL BE DISTILLED INTO SMALLER VERSIONS THAT CAN DO INTELLIGENT TASKS, WHETHER SCHEDULING OR VOICE ASSISTANTS. THAT IS WHERE GOOGLE HAS AN ADVANTAGE BECAUSE IT HAS CHIPS AND DATA AND IT HAS THE FAMILY OF APPS AND THAT IS WHY IT CAN DO PERSONALIZED AI THAT OTHERS CANNOT. TO MY MIND, THEY ARE IN A UNIQUE POSITION. THEY HAVE A SMALL MARKET SHARE WHEN IT COMES TO SMARTPHONES, BUT THEY ARE DOING ENOUGH TO SHOWCASE THAT EMBEDDED AI ELEMENT WHICH COULD POTENTIALLY DRIVE OUT -- DRIVE UP THE SHARE WHEN IT COMES TO THE HARDWARE SIDE. CAROLINE: HOW MUCH COULD THEY STEAL FROM A LACKLUSTER SIRI OFFERING? MANDEEP: APPLE HAS THEIR PROBLEMS. THEY HAVE TO FIGURE OUT A WAY TO INTEGRATE LLM THROUGH PARTNERSHIPS OR THEIR OWN. IN THE CASE OF GOOGLE, THEY WILL USE THE ADVANCEMENTS AT THE OPERATING SYSTEM LAYER BUT THEY HAVE TO SHOWCASE THAT IN THEIR OWN HARDWARE FIRST. THAT IS WHY THE EVENT IS IMPORTANT. CAROLINE: WE WAIT IN ANTICIPATION OF WHETHER THEY ARE ABLE TO KEEP CHROME AS WELL. WE ANTICIPATE SOME OF THAT HARDWARE COMING OUT, BUT THAT DOES IT FOR THIS EDITION OF BLOOMBERG TAX. ONE LAST CHECK ON THESE MARKETS BEFORE WE LEAVE. IT HAS BEEN A VOLATILE HOUR OF TRADING. WE ARE UP BY 1.2 5% ON THE NASDAQ 100. WE ARE OFF BY 2% ON THE SEMI CONDUCTOR INDEX. CRYPTO BACK INTO THE RED. WE SEE SOME PROFIT TAKING. DO NOT FORGET TO CHECK OUT OUR PODCAST. YOU CAN FIND ON THE TERMINAL AS WELL AS ONLINE. FROM NEW YORK, THIS IS BLOOMBERG TECH. ♪",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "AI MEGA COMPANIES",
      "weight": 0.06723859
    },
    {
      "name": "GENERATIVE AI",
      "weight": 0.058323428
    },
    {
      "name": "AI INFRASTRUCTURE",
      "weight": 0.057944845
    },
    {
      "name": "AI",
      "weight": 0.056354128
    },
    {
      "name": "INTEGRATE AI",
      "weight": 0.05629855
    },
    {
      "name": "AI CAPABILITIES",
      "weight": 0.055432837
    },
    {
      "name": "VERTICAL AI",
      "weight": 0.05426684
    },
    {
      "name": "PERSONALIZED AI",
      "weight": 0.054197054
    },
    {
      "name": "CONVERSATIONAL AI",
      "weight": 0.05414435
    },
    {
      "name": "AI RIVALS",
      "weight": 0.054100312
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9921875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.96533203125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9541015625
    },
    {
      "name": "/News/Technology News",
      "score": 0.8037109375
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.60400390625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.59619140625
    }
  ],
  "sentiment": {
    "positive": 0.034569852,
    "negative": 0.83755076,
    "neutral": 0.12787937
  },
  "summary": "The Tech Selloff continues as investors question the value of AI (AI) in the tech sector, with investors questioning the ROI of the AI industry. This comes as M.I.T.T., the leading technology companies, including NVIDIA, and Intel, struggle to meet expectations and perform well in the market. The article discusses the ongoing tech selloff and the return of tech investors to the banks of America's top technologist, with a return of investors with a GOOGLE event. The author discusses the recent surge in the Nasdaq 100, with NetFLIX, OfFLINE, ofFLINE and NVIDIA both down by 8%, while Intel outperforming the rest of the market with recent strong performance. The report also discusses the potential for a significant turnaround in the AI market. There are also concerns about the future of AI technology in the US, with some suggesting that it could lead to significant declines in its value.",
  "shortSummary": "The tech selloff continues as investors question AI valuations, causing significant losses and market instability, with NVIDIA, Intel, and AI-related names under scrutiny.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "dd206e10a9f54ce98e518fbad0d9cff3",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Bloomberg Tech reports a sharp tech sell‑off as investors question AI valuations, with Palantir and Intel pulling back after high‑profile funding and Microsoft tightening Chinese access to its SharePoint security.  Oracle’s cloud expansion and Meta’s AI restructuring highlight the race to monetize generative AI, while Bank of America showcases real‑world productivity gains from AI tools.  Startups like Elise AI raise significant capital for vertical AI in housing and healthcare, amid concerns that many pre‑ChatGPT unicorns may struggle to sustain high valuations.  Market volatility continues, with the Nasdaq 100 and semiconductor index fluctuating as investors weigh macro risks and the long‑term payoff of AI investments.",
  "argos_id": "Q2G68OLEK"
}