{
  "url": "https://www.miamiherald.com/news/nation-world/national/article311782364.html",
  "authorsByline": "Julie Appleby",
  "articleId": "6a75251ed43f424d8711e2d9dac86ea3",
  "source": {
    "domain": "miamiherald.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Miami-Dade County",
      "city": "Miami",
      "coordinates": {
        "lat": 25.7741728,
        "lon": -80.19362
      }
    }
  },
  "imageUrl": "https://www.mcclatchy-wires.com/public/incoming/cpuvxx/picture311782161/alternates/LANDSCAPE_1140/6fbe3dcc-c964-45ec-be09-092fa6fe7c2b",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T22:42:52-04:00",
  "addDate": "2025-08-25T02:58:04.051709+00:00",
  "refreshDate": "2025-08-25T02:58:04.051711+00:00",
  "score": 1.0,
  "title": "Breaking down why Medicare Part D premiums are likely to go up",
  "description": "Medicare enrollees who buy the optional Part D drug benefit may see substantial premium price hikes ...",
  "content": "Medicare enrollees who buy the optional Part D drug benefit may see substantial premium price hikes - potentially up to $50 a month - when they shop for next year’s coverage.\n\nSuch drug plans are used by millions of people who enroll in what is called original Medicare, the classic federal government program that began in 1965 and added a drug benefit only in 2006. The drug plans are offered through private insurers, and enrollees must pay monthly premiums.\n\nIt’s not known whether insurers will pursue the maximum increase allowed, as premium prices for next year won’t be revealed until closer to open enrollment, which starts Oct. 15.\n\nIncreases are expected to mainly affect stand-alone Part D plans, not the drug coverage offered as part of Medicare Advantage, the private sector alternative to original Medicare. More on that later.\n\nPolicy experts say premiums are likely to go up for several reasons, including increased use of some higher-cost prescription drugs; a law that capped out-of-pocket spending for enrollees; and changes in a program aimed at stabilizing price increases that the Trump administration has continued but made less generous.\n\nOne thing is surer than ever, say many policy experts: Beneficiaries should not simply roll over their existing stand-alone Medicare drug plans.\n\n“Everyone should shop plans in open enrollment,” said Stacie Dusetzina, a professor of health policy at Vanderbilt University Medical Center.\n\nHere are three reasons prices would rise.\n\nEvery year, insurers keep an eye on what they’re spending on drugs so they can build that into their premium estimates. Spending covers both the prices charged by drugmakers and volume, meaning how many people take the medications and how often.\n\nAnd it’s up. Spending by insurers and government programs for prescription drugs in 2024 across the market grew more than 10%, which is slightly greater than in recent years, according to a research report published in last month’s issue of the American Journal of Health-System Pharmacy. Estimates are not yet available for this year’s trends.\n\nStill, in 2024, researchers found that drug prices overall decreased slightly. Spending rose because of drugs coming on the market and increased utilization, especially for pricey weight loss drugs and another category of medications that treat various autoimmune conditions, such as rheumatoid arthritis.\n\nSuch increased use is evident in Medicare. Many beneficiaries, for example, are treated for autoimmune conditions. And even though Medicare doesn’t cover treatment for weight loss, many members have diabetes or other conditions that the new type of weight loss drugs can treat.\n\nThe Trump administration, according to The Washington Post, is considering a five-year pilot program in which Medicare Part D plans could voluntarily expand access to the drugs, which can cost more than $1,000 a month without insurance. Details have not yet been provided, but the pilot program would not begin in Medicare until 2027.\n\nAnother wild card for insurers is the Trump administration’s tariffs on businesses that purchase products made overseas, which could boost drug prices because the U.S. imports a lot of its pharmaceuticals. Much, however, remains unknown about whether drugmakers will pass along any additional tariff costs to consumers.\n\nSo, while rising spending is one factor, it isn’t the only reason next year’s premium prices are expected to go up.\n\nChanges made to Medicare aimed at helping people with high out-of-pocket costs for expensive medications may be a bigger factor.\n\nHere’s why: Starting this year, Medicare enrollees have a limit on how much they must pay out-of-pocket for prescription drugs. It’s capped at $2,000, a threshold that will rise each year to cover inflation.\n\nLawmakers in Congress set those changes in the Inflation Reduction Act under President Joe Biden. The law also shifted a larger share of the cost of drugs used by Medicare beneficiaries from the federal program to insurers.\n\nThat $2,000 cap is a big change from previous years, when people taking expensive drugs had a higher threshold to meet annually and were on the hook to pay 5% of the drug’s cost even after meeting that amount. Those additional 5% payments ended last year under the provisions of the IRA.\n\nBefore that law passed, “people would spend $10,000 or $15,000 out-of-pocket each year just for a single drug,” Dusetzina said. “The Inflation Reduction Act was necessary to make Part D proper health insurance, but there’s a cost to do so.”\n\nWhile the cap is a big help for affected consumers, the reduced amounts paid by some beneficiaries - coupled with the cost shift to insurers - could lead plans to spread their increased expenses across all policyholders through higher premiums. A growing number of health plans have also begun to require enrollees to pay a percentage of a drug’s cost, rather than a flat-dollar copay, which can lead to larger-than-expected costs at the pharmacy counter, Dusetzina said.\n\nWhile consumers not currently taking high-cost specialty drugs may not see a benefit in the $2,000 cap initially, they might one day, say policy experts, who note that drugmaker prices continue to rise and that enrollees could fall ill with a condition like cancer or multiple sclerosis for which they need a very high-priced drug.\n\n“It’s important to think not just in context of those groups who hit the cap every year, but also people are paying more in premiums to protect their future selves as well,” said Casey Schwarz, the senior counsel for education and federal policy at the Medicare Rights Center, an advocacy group.\n\nThe new prescription drug cap and other changes apply to both the stand-alone Part D drug plans and Medicare Advantage plans. But those Medicare Advantage plans are not expected to increase the drug portion of their premiums, partly because the private sector plans are paid more per member than what it costs taxpayers for the traditional program.\n\nThat means Advantage plans have far more money to add benefits, such as vision and dental coverage, which traditional Medicare does not include, or to use them to cushion the impact of rising spending on drug costs, thus limiting premium increases.\n\nThose additional benefits are advertised to attract customers to Medicare Advantage, which also sometimes offers plans with minimal or no monthly premium costs. There are other differences between traditional Medicare and private sector plans. For example, Advantage members must stick to doctors and hospitals in the plan’s networks, and they may face more prior authorization or other hurdles than in the traditional program.\n\nThe growing difference between premiums - fueled by the extra rebates flowing to the private sector plans - “is increasingly tilting coverage toward Medicare Advantage and making traditional Medicare plus a stand-alone PDP [prescription drug plan] unaffordable for many enrollees,” said Juliette Cubanski, deputy director of the program on Medicare policy at KFF, a health information nonprofit that includes KFF Health News.\n\nThe final factor in the premium increase equation is a program set up to slow the rise of premiums in stand-alone Part D plans.\n\nIt began under the Biden administration to offset premium increases tied to changes in the Inflation Reduction Act by temporarily injecting additional federal dollars to help insurers adjust to the new rules.\n\nThat plan sent just over $6 billion this year to Part D insurers.\n\nAnd it had an effect.\n\nThe average monthly premium for a stand-alone Part D drug plan dropped 9%, from $43 last year to $39 this year, according to KFF, even when factoring in that some plans raised prices by up to $35 a month, the maximum increase allowed under the stabilization plan for this year.\n\nIn a memo released in late July, the Trump administration said it would continue the program for next year, while shaving about 40% of the funding. A government official told The Wall Street Journal that the administration felt that keeping the full funding would have mainly benefited the insurers and cost taxpayers an “enormous, excess amount.”\n\nThe stabilization effort next year will send $10 a month per enrollee to Part D insurers to help keep premiums in check, down from $15 this year. Among other changes, it allows insurers to raise premiums by as much as $50 a month, up from the $35 allowed this year.\n\nThat would be a substantial increase, Cubanski noted, although it is not clear just how many insurers would pursue the full amount.\n\n“We did see some plans this year were taking premium increases of that $35 amount in 2025, and I fully expect we will see some plans with increases up to $50 a month” next year, she said.\n\nAnother reason to take a close look at all the options once open enrollment begins.\n\nCopyright (C) 2025, Tribune Content Agency, LLC. Portions copyrighted by the respective providers.",
  "medium": "Article",
  "links": [
    "https://www.wsj.com/health/healthcare/medicare-part-d-drug-plan-premiums-set-to-rise-16ef919c?utm_campaign=KHN%3A%20Daily%20Health%20Policy%20Report&utm_medium=email&_hsenc=p2ANqtz-_Y95aq8XcKSYcEqQQ97a1tbyd4bL9HN1xp-BFnXqEK1PvAArAr50sE4qLHrkiLkeXjiMuE8YSwS_a476pM0N7ihMvxyg&_hsmi=373463125&utm_content=373463125&utm_source=hs_email",
    "https://academic.oup.com/ajhp/article/82/14/806/8117945",
    "https://www.milliman.com/en/insight/part-d-trend-insights-analysis-specialty-drug-utilization",
    "https://www.cms.gov/files/document/july-28-2025-parts-c-d-announcement.pdf",
    "https://www.miamiherald.com/news/nation-world/national",
    "https://publichealth.jhu.edu/2025/tariffs-and-us-drug-prices#:~:text=%E2%80%9COne%20of%20the%20most%20immediate,individual%20drugmakers%20respond%20to%20tariffs.",
    "https://www.kff.org/medicare/issue-brief/medicare-part-d-in-2025-a-first-look-at-prescription-drug-plan-availability-premiums-and-cost-sharing/",
    "https://www.dhcs.ca.gov/services/medi-cal/Pages/medicarepartd.aspx",
    "https://www.washingtonpost.com/health/2025/08/01/medicare-medicaid-weight-loss-drugs/",
    "https://www.goodrx.com/mounjaro/how-much-is-mounjaro-without-insurance?srsltid=AfmBOoqdr8kT8M1nlgOiGXYX9ufAU_Inr83HB3zHizu2MY1Ga3NdttQq",
    "https://www.kff.org/medicare/issue-brief/key-facts-about-medicare-part-d-enrollment-premiums-and-cost-sharing-in-2025/#:~:text=The%20Part%20D%20premium%20demonstration,in%20the%20premium%20stabilization%20demonstration."
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "prescription drug plan",
      "weight": 0.09965814
    },
    {
      "name": "Such drug plans",
      "weight": 0.09894015
    },
    {
      "name": "drug costs",
      "weight": 0.095185325
    },
    {
      "name": "Medicare Part D premiums",
      "weight": 0.09512713
    },
    {
      "name": "Medicare Part D plans",
      "weight": 0.09505958
    },
    {
      "name": "drug prices",
      "weight": 0.09313156
    },
    {
      "name": "Medicare Advantage plans",
      "weight": 0.08810004
    },
    {
      "name": "prescription drugs",
      "weight": 0.08669118
    },
    {
      "name": "drugs",
      "weight": 0.084340006
    },
    {
      "name": "expensive drugs",
      "weight": 0.08294683
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/Health/Public Health/Health Policy",
      "score": 0.869140625
    },
    {
      "name": "/Finance/Insurance/Health Insurance",
      "score": 0.8232421875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.440673828125
    }
  ],
  "sentiment": {
    "positive": 0.3463978,
    "negative": 0.35898957,
    "neutral": 0.29461268
  },
  "summary": "Medicare enrollees who buy the optional Part D drug benefit may see significant premium price hikes, potentially up to $50 per month, when they shop for next year's coverage. The increase is expected to mainly affect stand-alone Part D plans, not the drug coverage offered as part of Medicare Advantage. Policy experts suggest that premiums may increase due to increased use of some higher-cost prescription drugs, a law that caps out-of-pocket spending for enrollees, changes in a program aimed at stabilizing price increases, and changes in the Trump administration's policy regarding drug prices could also increase. The Trump administration is considering a five-year pilot program in which Medicare Part D programs could voluntarily expand access to the drugs, which can cost over $1,000 a month without insurance. Changes to Medicare aimed at helping people with high out-off-pocket costs for expensive medications may also be a factor. The cost of prescription drugs has also been increased by more than 10% in 2024, according to a research report published in the American Journal of Health-System Pharmacy. The rise in premium prices is also predicted by policy experts.",
  "shortSummary": "Medicare Part D drug benefit premiums may rise by up to $50 per month due to increased drug costs, despite caps on out-of-pocket spending, and potential tariff increases.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "83b05d730d034b2b83b316d3aadaf49f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.kff.org/medicare/issue-brief/key-facts-about-medicare-part-d-enrollment-premiums-and-cost-sharing-in-2025/#:~:text=The%20Part%20D%20premium%20demonstration,in%20the%20premium%20stabilization%20demonstration.",
      "text": "Key Facts About Medicare Part D Enrollment, Premiums, and Cost Sharing in 2025\nThe Medicare Part D program provides an outpatient prescription drug benefit to more than 50 million older adults and people with long-term disabilities in Medicare who enroll in private plans, including stand-alone prescription drug plans (PDPs) to supplement traditional Medicare and Medicare Advantage prescription drug plans (MA-PDs) that include drug coverage and other Medicare-covered benefits. This brief analyzes Medicare Part D enrollment and costs in 2025 and trends over time, based on data from the Centers for Medicare & Medicaid Services (CMS).\nHighlights for 2025\n- Enrollment in Medicare Part D stand-alone PDPs remained stable at 23 million in 2025, despite monthly premium increases in some PDPs of up to $35, the maximum increase allowed for plans participating in the Part D premium stabilization demonstration, which included measures intended to stabilize the PDP market as major changes to the Part D benefit took effect in 2025, including a new $2,000 out-of-pocket spending cap.\n- Medicare Advantage continues to be the primary source of Part D drug coverage for people with Medicare, with close to 32 million enrollees. Overall, Part D enrollment is concentrated in a handful of large plan sponsors, including UnitedHealth, Centene, Humana, and CVS Health.\n- Enrollment in the Part D Low-Income Subsidy (LIS) decreased in 2025, from 13.7 million to 13.1 million, the first decrease in enrollment since 2007, the first full year of the Part D program. This decrease is likely related to Medicaid disenrollment among dual-eligible individuals that stemmed from the unwinding of the Medicaid continuous enrollment provision in place during the COVID-19 pandemic\n- Average monthly premiums decreased for both PDPs and MA-PDs in 2025, but the average monthly premium for Part D coverage is still substantially higher for PDPs than for MA-PDs ($39 versus $7), mainly because most MA-PD enrollees are in zero-premium plans, which is related to the ability of Medicare Advantage plan sponsors to reduce their Part D premiums using rebates, which are not available to PDP sponsors.\n- Median cost-sharing amounts for drugs covered on some formulary tiers are the same or similar in PDPs and MA-PDs, but PDP enrollees are more likely than MA-PD enrollees to face coinsurance for preferred brands and non-preferred drugs, while MA-PD enrollees face higher median coinsurance for specialty tier drugs.\nPart D Enrollment\nMedicare Advantage drug plans continue to enroll more beneficiaries than stand-alone drug plans, but PDP enrollment has stabilized\nMore than half (58%) of all Part D enrollees in 2025 are in Medicare Advantage drug plans, continuing a trend of increasing enrollment in Medicare Advantage plans (Figure 1). Despite some concerns about the stability of the stand-alone PDP market as changes to the Part D benefit took effect in 2025 and an overall reduction in the number of PDPs for 2025, that decline did not result in lower overall PDP enrollment in 2025. In fact, the number of PDP enrollees has increased by 1 million since 2023. MA-PD enrollment growth was more than three times larger over the same period, however, with enrollment in MA-PDs increasing by 3.3 million between 2023 and 2025.\nPart D Low-Income Subsidy enrollment is tilted even more towards Medicare Advantage drug plans than overall Part D enrollment, but overall LIS enrollment decreased in 2025\nThe Medicare Part D Low-Income Subsidy (LIS) provides financial assistance with drug plan premiums and cost sharing for low-income enrollees. Two-thirds of LIS enrollees – 8.8 million out of 13.1 million – are enrolled in Medicare Advantage drug plans in 2025 (Figure 2). Six million LIS enrollees are enrolled in Medicare Advantage Special Needs Plans (SNPs), nearly all of whom are in plans designed specifically for dual-eligible individuals (Table 1). LIS enrollment in MA-PDs has increased over time in tandem with overall enrollment of Medicare beneficiaries in Medicare Advantage plans.\nAt the same time, Part D LIS enrollment overall decreased in 2025, from 13.7 million to 13.1 million – the first decrease in enrollment since 2007, the first full year of the Part D program. This decrease is likely due to Medicaid disenrollment among dual-eligible individuals that stemmed from the unwinding of the Medicaid continuous enrollment provision in place during the COVID-19 pandemic. Medicare beneficiaries with Medicaid coverage (dual-eligible individuals) automatically qualify for LIS, meaning a loss of Medicaid coverage would lead to a loss in LIS unless eligible individuals apply and enroll separately.\nFive firms cover nearly three-fourths of Part D enrollees in 2025\nPart D enrollment is concentrated in a handful of top plan sponsors, with 5 firms covering 73.5% of all Part D enrollees in 2025, or 40.2 million out of 54.8 million enrollees (Figure 3). Nearly 1 in 4 enrollees (12.6 million) are in Part D plans sponsored by UnitedHealth, including both stand-alone PDPs and MA-PDs. CVS, Humana, and Centene each have around 15% of the Part D market, with enrollees in both types of Part D plans.\nCentene is the top firm in the PDP market, with one-third (34%) of all PDP enrollees, followed by CVS Health (18%) and UnitedHealth (15%), while UnitedHealth is the top firm in the MA-PD market, with 29% of all MA-PD enrollees, followed by Humana (17%) and CVS Health (11%).\nNearly 5 million PDP enrollees – more than 1 in 4 – are enrolled in the lowest-premium PDP in 2025\nAmong the 12 national PDPs available in 2025, only one – Wellcare Value Script – has an average monthly premium less than $10 and, likely for this reason, has attracted a substantial share of all PDP enrollees, with more than 1 in 4, or 5 million, PDP enrollees in 2025 (Figure 4). Between 2024 and 2025, Wellcare Value Script gained 1.2 million PDP enrollees, as several other national PDPs experienced smaller increases and some PDPs lost enrollment, even after taking plan consolidations into account (Table 2).\nThe number and share of LIS enrollees in national PDPs vary considerably, which is related to the fact that only 5 of these 12 plans are benchmark PDPs, meaning they are available to Part D enrollees receiving LIS for no premium. For example, a majority of all enrollees in Wellcare Classic (83% or 2.1 million) are receiving LIS; this is a benchmark plan in 33 of 34 PDP regions (Table 3). More than two-thirds of enrollees in Cigna Healthcare Assurance Rx, a benchmark plan in 12 regions, are LIS enrollees (69% or 0.7 million). In contrast, only 3% of the 5 million enrollees in Wellcare Value Script are LIS enrollees; despite its low average premium, this is an enhanced PDP and therefore does not qualify to be a benchmark plan.\nOverall, 15% (0.6 million) of the 4.2 million PDP enrollees receiving LIS (excluding those in employer group plans) are enrolled in non-benchmark PDPs. LIS enrollees in non-benchmark plans are required to pay a portion of the plan’s premium for the cost of basic benefits that exceeds the LIS benchmark amount in their region or if their plan charges a premium for enhanced benefits.\nPart D Premiums\nAverage monthly premiums decreased for both PDPs and MA-PDs in 2025, but the average monthly premium for Part D coverage is still substantially higher for PDPs than for MA-PDs\nThe Part D premium demonstration for stand-alone PDPs established by the Biden administration in 2024 worked as intended to stabilize PDP premiums, with the average monthly PDP premium decreasing 9% between 2024 and 2025 from $43 to $39, despite monthly premium increases in some PDPs of up to $35, the maximum increase allowed for plans participating in the premium stabilization demonstration.\nThe $39 average monthly PDP premium, based on current enrollment after the end of the open enrollment season for 2025, is lower than the estimated $45 monthly PDP premium for 2025, which was based on enrollment in June 2024 and did not account for plan switching by current enrollees or plan choices by new enrollees during the open enrollment period. Taking into account plan switching and new enrollment into lower premium plans resulted in the lower enrollment-weighted average monthly premium for 2025.\nOn average, PDP enrollees continue to pay substantially more each month for their Part D drug coverage than enrollees in Medicare Advantage drug plans. The $39 average monthly PDP premium is nearly 6 times higher than the $7 average monthly premium for drug coverage in MA-PDs (weighted by enrollment) (Figure 5). (The total average premium for MA-PDs, including all Medicare-covered benefits, is $13 per month in 2025.) The weighted average MA-PD premium decreased by 25% between 2024 and 2025 (down from $9 to $7).\nThe difference between average monthly premiums for drug coverage offered by PDPs and MA-PDs has been growing larger, with the average PDP premium rising and the average MA-PD premium falling. The average premium for drug coverage in MA-PDs is heavily weighted by zero-premium plans because MA-PD sponsors can use rebate dollars from Medicare payments to lower or eliminate their Part D premiums. Rebates to Medicare Advantage plans have doubled since 2018 and now exceed $2,000 per year per beneficiary.\nEight in 10 MA-PD enrollees without low-income subsidies pay no monthly premium for Part D coverage compared to 3 in 10 PDP enrollees\nNearly 80% of MA-PD enrollees without low-income subsidies (15.1 million) pay no monthly premium for Part D coverage in 2025, compared to 31% of PDP enrollees without LIS (4.3 million). For 2025, Medicare beneficiaries had access to 29 zero-premium MA-PD plans on average, whereas only 1 PDP – Wellcare Value Script – was available for zero premium for non-LIS enrollees in most PDP regions (29 out of 34), and 6 other PDPs were available for zero premium in 5 or fewer PDP regions.\nJust over half of PDP enrollees without LIS (51%) pay $30 or more – including 1 in 7 PDP enrollees without the LIS (14%) who pay at least $100 per month for their Part D plan (Figure 6). In contrast, less than 10% of MA-PD enrollees pay $30 or more per month for Part D coverage, and less than 1% pay $100 per month or more.\nOut-of-Pocket Costs\nMost Part D enrollees are in plans that charge a deductible for drug coverage in 2025, including 60% of MA-PD enrollees and 85% of PDP enrollees\nAmong MA-PD enrollees, 60% (12.3 million) are in a plan that charges a deductible for drug coverage – an increase from 2024, when only 23% of MA-PD enrollees were in a plan charging a drug deductible. In 2025, 12% of MA-PD enrollees are in a plan that charges the standard deductible of $590 (up from 3% in 2024) and 49% face a partial deductible averaging $328 (Figure 7).\nA large majority of PDP enrollees (85% or 15.3 million) are in a plan that charges a drug deductible in 2025, including more than three-fourths (77%) in a plan that charges the standard deductible of $590 and 8% facing a partial deductible averaging $495. (These estimates include Part D enrollees receiving Low-Income Subsidies, who do not pay a deductible regardless of whether their plan\nPDP enrollees are more likely than MA-PD enrollees to face coinsurance for preferred brands and non-preferred drugs, while MA-PD enrollees face higher median coinsurance for specialty tier drugs\nAs in previous years, Part D enrollees face low copayments for generic drugs and higher cost-sharing amounts for preferred brands, non-preferred drugs, and specialty drugs, regardless of whether they are in PDPs or MA-PDs (Figure 8). Median copayments for drugs covered on generic tiers are the same in PDPs and MA-PDs, but for preferred brands and non-preferred drugs, PDP enrollees are much more likely than MA-PD enrollees to pay coinsurance, or a percentage of a drug’s price. Whereas most MA-PD enrollees face a median copayment of $47 for preferred brands, most PDP enrollees face median coinsurance of 21%. For non-preferred drugs, a somewhat larger share of MA-PD enrollees face median coinsurance of 42% than a copayment of $100, while all PDP enrollees face coinsurance for non-preferred drugs, with a median rate of 40%.\nMedian coinsurance for specialty tier drugs (those that cost over $950 in 2025) is higher for MA-PD enrollees than PDP enrollees – 30% vs. 25%. Plans that waive some or all of the standard deductible, which most MA-PDs do, are permitted to set the specialty tier coinsurance rate above 25%.\nThese cost-sharing amounts apply when beneficiaries fill prescriptions in the initial coverage phase of the Part D benefit. Under a provision in the Inflation Reduction Act, beneficiaries no longer face cost sharing in the catastrophic coverage phase of the Part D benefit. In 2025, Medicare beneficiaries will pay no more than $2,000 out of pocket for prescription drugs covered under Part D.\nAmong the 12 PDPs offered nationwide, most charge $0 for preferred generics but only 2 charge flat copayments for preferred brands and all charge coinsurance for non-preferred drugs\nPart D enrollees in 8 of the 12 national PDPs face a median copayment of $0 for preferred generics, while median copays for drugs on the standard generic tier range from $0 to $10 (Figure 9). For preferred brands, 10 of 12 national PDPs charge coinsurance, with median amounts ranging from 15% to 25%, and only 2 national PDPs charge copays. All 12 national PDPs charge coinsurance for non-preferred drugs, ranging from 31% to 50% at the median, and coinsurance for specialty tier drugs ranging from 25% to 33%.\nJuliette Cubanski is with KFF. Anthony Damico is an independent consultant."
    },
    {
      "url": "https://www.kff.org/medicare/issue-brief/medicare-part-d-in-2025-a-first-look-at-prescription-drug-plan-availability-premiums-and-cost-sharing/",
      "text": "Medicare Part D in 2025: A First Look at Prescription Drug Plan Availability, Premiums, and Cost Sharing\nDuring the Medicare open enrollment period from October 15 to December 7 each year, people with Medicare can enroll in a plan that provides Part D prescription drug coverage, either a stand-alone prescription drug plan (PDP) for people in traditional Medicare, or a Medicare Advantage plan that covers all Medicare benefits, including prescription drugs (MA-PD). In 2024, 53 million of the 67 million Medicare beneficiaries are enrolled in Medicare Part D plans, including employer-only group plans; of the total, 57% are enrolled in MA-PDs and 43% are enrolled in stand-alone PDPs. This analysis provides an overview of Part D plan availability, premiums, and cost sharing in 2025 and key trends over time. (Separate analyses of 2025 Medicare Advantage plans, premiums and benefits are also available.) (See Methods box for details on this analysis.)\nOverall, KFF analysis shows that the market for Part D coverage remains robust based on the overall number of plan options, but the number of sponsors, plans, and enrollees in the stand-alone PDP market has trended downward over time, while the MA-PD market remains stable and continues to experience steady enrollment growth. In part, this reflects the predominance of low- or zero-premium MA-PDs and the availability of extra benefits, which are enabled by rebates in the Medicare Advantage payment system and amplified by aggressive marketing. Monthly premiums for stand-alone PDPs are substantially higher than for MA-PDs.\nChanges to the Part D benefit in the Inflation Reduction Act, including a new $2,000 out-of-pocket drug spending cap, will mean lower out-of-pocket costs for some Part D enrollees but higher costs for Part D plans overall. Some stand-alone PDPs are increasing monthly premiums for 2025 by up to $35, the maximum increase allowed for plans participating in a new premium stabilization demonstration, while a larger share of MA-PD plans are imposing deductibles for drug coverage and coinsurance for certain types of drugs in 2025 compared to 2024. Part D plans often make other changes from one year to the next that could affect drug coverage and costs, including changes to formularies and preferred pharmacies, re-enforcing the value for Part D enrollees in comparing plans during the annual open enrollment period.\nMedicare Part D Highlights for 2025\n- The average Medicare beneficiary has a choice of 48 Medicare plans with Part D drug coverage in 2025, including 14 Medicare stand-alone prescription drug plans (7 fewer than in 2024) and 34 Medicare Advantage drug plans (2 fewer than in 2024). Over the past 10 years, the number of PDPs available to the average beneficiary has decreased by 52% while the number of MA-PDs has increased by 143%.\n- The number of firms offering stand-alone PDPs has dropped from 11 in 2024 to 7 in 2025, along with a reduction in the overall number of PDPs (down from 709 to 464).\n- In 2025, a smaller number of PDPs will be “benchmark” plans – that is, PDPs available for no monthly premium to Medicare Part D enrollees receiving the Low-Income Subsidy (LIS) – than in any year since Part D started. Medicare beneficiaries will have access to 1 less benchmark PDP in 2025 than in 2024, on average – two out of the average 14 PDPs available overall. An estimated 1.1 million LIS enrollees (26% of all LIS PDP enrollees) need to switch plans during the 2024 open enrollment period if they want to be enrolled in a benchmark plan in 2025.\n- The estimated average enrollment-weighted monthly premium for Medicare Part D stand-alone PDPs is projected to be $45 in 2025, a modest increase from $42 in 2024 (based on June 2024 enrollment). After accounting for enrollment choices by new enrollees and plan changes by current enrollees, the actual average weighted PDP premium for 2025 is likely to be lower than the estimated average of $45.\n- Monthly premiums for drug coverage are estimated to be six times higher for PDPs compared to MA-PDs in 2025 – $45 versus $7. The average monthly premium is projected to increase for PDPs but decrease for MA-PDs. MA-PD sponsors can use rebate dollars from Medicare payments to lower or eliminate their Part D premiums, as well as provide extra benefits, but there is no equivalent rebate system for PDPs.\n- Average monthly premiums for the 12 national PDPs are projected to range from around $3 to $128 in 2025. Premium variation across plans is in part related to whether plans offer basic or enhanced benefits and the value of benefits offered, as well as variation in the underlying costs that plans incur for their enrollees.\n- More than half of non-LIS Part D PDP enrollees (7.0 million out of 13.1 million) will see a reduction or no change in their monthly premium in 2025 if they make no changes during open enrollment, but 1 in 5 non-LIS PDP enrollees (2.6 million) will see their monthly premium increase by $35 if they stay in their same plan for 2025. This is the maximum increase allowed for PDPs participating in the new Part D premium demonstration, which includes measures intended to stabilize the PDP market as major changes to the Part D benefit take effect in 2025, including a new $2,000 out-of-pocket drug spending cap.\n- The share of MA-PD enrollees who will be in plans that charge a deductible for Part D coverage will nearly triple from 21% in 2024 to 60% in 2025 if they do not switch plans. Most stand-alone PDP enrollees (84%) will also be enrolled in plans that charge a deductible for drug overage in 2025, similar to the share in 2024 (87%). (Some of the enrollees in these plans receive low-income subsidies that cover their deductible.) The average deductible in 2025 will be more than twice as large for PDP enrollees as for MA-PD enrollees ($486 versus $225) (the standard deductible in 2025 is $590).\n- Many Part D enrollees will face coinsurance rather than copayments for both preferred brands and non-preferred drugs, which can mean less predictable out-of-pocket costs. This includes a larger share of MA-PD enrollees compared to 2024: 28% will be in plans that charge coinsurance for preferred brands versus 2% in 2024, and 57% will be in plans that charge coinsurance for non-preferred drugs versus 11% in 2024. Among PDP enrollees, 83% will be in plans that charge coinsurance for preferred brands and 100% in plans charging coinsurance for non-preferred drugs in 2025. For specialty tier drugs (those that cost more than $950 per month), median coinsurance will be 25% for PDP enrollees and 30% for MA-PD enrollees.\nPart D Plan Availability\nFor 2025, the Average Medicare Beneficiary Has Fewer Stand-Alone Prescription Drug Plan Options Than in Prior Years but a Similar Number of Medicare Advantage Drug Plan Options\nThe Part D market for 2025 offers the average Medicare beneficiary fewer choices for drug coverage from stand-alone prescription drug plans than in prior years, but a similar number of choices for coverage from Medicare Advantage drug plans. The average Medicare beneficiary has a choice of 48 options for Part D coverage in 2025, including 14 PDPs (7 fewer than in 2024) and 34 MA-PDs (2 fewer) (Figure 1). Over the past 10 years, the number of PDPs available to the average beneficiary has decreased by 52% while the number of MA-PDs has increased by 143%.\nOf the 14 PDPs available to the average beneficiary in 2025, 12 are national PDPs (available in all 34 PDP regions nationwide) (Appendix Table 1). This reduction of two national PDPs from 2024 is the result of one plan sponsor (CVS Health/Aetna) consolidating its 3 PDP offerings in 2024 (SilverScript Choice, Plus, and SmartSaver) to 1 PDP in 2025 (SilverScript Choice). The 2.0 million enrollees in the SilverScript Plus and SmartSaver PDPs (as of June 2024) will be automatically enrolled in SilverScript Choice for 2025 unless they choose a different plan during open enrollment.\nA Total of 7 Firms Will Offer 464 Stand-Alone Prescription Drug Plans in 2025, the Lowest Number of PDP Sponsors and Plans Since Part D Started\nThe number of firms sponsoring stand-alone PDPs is decreasing from 11 firms in 2024 to 7 firms in 2025, the smallest number since the Part D benefit was launched (Figure 2). Due to the market withdrawal of Mutual of Omaha from the PDP market and the termination of Clear Spring Health PDPs by the Centers for Medicare & Medicaid Services (CMS) due to low quality ratings over three years, the 537,000 enrollees in these firms’ PDPs (as of June 2024) will need to select a new Part D plan from a different plan sponsor during the 2024 open enrollment period if they want their Part D coverage to continue in 2025.\nA total of 464 PDPs will be offered by these 7 firms in the 34 PDP regions (plus another 10 PDPs in the territories), a decrease of 245 PDPs (-35%) from 2024, and the lowest number of PDPs available in any year since Part D started in 2006.\nDespite the reduction in PDP availability overall, beneficiaries in each state will have a choice of multiple plans, ranging from 12 PDPs in 12 states and the District of Columbia to 16 PDPs in California, plus multiple MA-PDs offered at the local level (Figure 3, Appendix Table 2).\nPremiums\nStand-Alone Prescription Drug Plan Enrollees Will Pay Higher Monthly Premiums Than Medicare Advantage Drug Plan Enrollees in 2025 – $45 versus $7, on Average\nThe estimated national average monthly PDP premium is projected to be $45 in 2025, which is six times higher than the average $7 monthly premium for drug coverage in MA-PDs (Figure 4). Between 2024 and 2025, the average monthly premium is increasing by $3 for PDPs but decreasing by $2 for MA-PDs. MA-PD sponsors can use rebate dollars from Medicare payments to lower or eliminate their Part D premiums and offer extra benefits, but there is no equivalent rebate system for PDPs. According to MedPAC, Medicare Advantage monthly rebates per enrollee have more than doubled since 2018, from $95 to $194 in 2024, and of the $194 total monthly rebate amount in 2024, $24 was used to reduce MA-PD Part D premiums.\nIt is likely that, after accounting for enrollment choices by new enrollees and plan changes by current enrollees, the actual average weighted PDP premium for 2025 will be lower than the estimated weighted average of $45 but still well above the average MA-PD premium.\nThere are two mechanisms in place that are helping to constrain Part D premium increases for PDPs between 2024 and 2025:\n- One is a premium stabilization provision in the Inflation Reduction Act that capped annual growth in the Part D base beneficiary premium at 6% beginning in 2024. (The base beneficiary premium is not the same as the amount that Part D enrollees pay for coverage, and the law did not cap the growth in individual plan premiums to 6%.)\n- The other is a new voluntary Part D premium stabilization demonstration for PDPs, which capped premium increases at $35 per month, along with other measures intended to stabilize the PDP market as changes to the Part D benefit take effect in 2025, including a new $2,000 out-of-pocket drug spending cap. MA-PDs are not eligible for this demonstration.\nWithout these mechanisms in place, it is likely that the average PDP premium increase, and monthly PDP premium amounts in 2025, would have been larger.\nAverage Monthly Premiums for the 12 National PDPs Are Projected to Range from $3 to $128 in 2025\nActual Part D premiums for 2025 vary widely across plans, as in previous years, and may be increasing by more or less than the national average (or even decreasing). Among the 12 national PDPs, there is a difference of more than $1,500 in average annual premiums between the highest-premium PDP and the lowest-premium PDP. At the high end, the monthly premium for Humana Premier Rx Plan (the 8th largest plan by overall enrollment) will be $128, totaling more than $1,500 annually. At the low end, the monthly premium for Wellcare Value Script (the largest plan) will average just over $3, or $38 annually (Figure 5).\nIn addition to Humana Premier Rx Plan, two other national PDPs will charge monthly premiums of more than $100 in 2025, on average: Cigna Healthcare Extra Rx, the 12th largest plan ($102), and Wellcare Medicare Rx Value Plus, the 10th largest plan ($107). An estimated 1.3 million people will be enrolled in the 3 national PDPs that charge more than $100 per month in premiums in 2025 if they make no changes to their coverage during open enrollment. Another 2.0 million enrollees will pay an average $95 monthly premium for the AARP Medicare Rx Preferred PDP in 2025, unless they switch plans.\nMonthly premiums for several national PDPs vary widely around each plan’s national average (Figure 5). For 6 of the 12 national PDPs, there is a difference of $90 or more across the 34 PDP regions between the plan’s lowest and highest premiums. For example, the monthly premium for the AARP Medicare Rx Saver PDP averages $67 but ranges from $0 to $128 across regions; and for Humana Basic Rx, the average premium is $43 but ranges across regions from $0 to $121. For most of these 12 national plans, monthly premiums are consistently higher in New York and California relative to other regions.\nMore Than Half of Stand-Alone PDP Enrollees Will See a Reduction or No Change in Their Monthly Premium in 2025 if They Stay in Their Current Plan\nOf the 13.1 million Part D PDP enrollees who are responsible for paying the entire premium, which excludes Low-Income Subsidy (LIS) recipients, more than half (54%), or 7.0 million enrollees, will see either a reduction in their monthly premium (41%) or no change (13%) if they stay in their current plan for 2025 (Figure 6). Just under half of Part D stand-alone plan enrollees (46%, or 6.0 million) will see their monthly premium increase in 2025 if they make no change to their coverage during open enrollment for 2025. This is lower than the two-thirds of non-LIS PDP enrollees (66%, or 8.6 million) who were projected to pay higher monthly premiums if they remained in their plan for 2024.\nOf the 6 million non-LIS PDP enrollees who will see an increase in their Part D premium if they stay in their current plan, 3.4 million (26% of non-LIS PDP enrollees overall) will see an increase of less than $35 and 2.6 million (20% overall) will see an increase of exactly $35. This is the maximum monthly premium increase allowed for PDPs participating in the new Part D premium stabilization demonstration. According to CMS, virtually all PDP enrollees are in plans sponsored by insurers that opted to participate in the voluntary demonstration.\nMedicare Part D enrollees in national PDPs in 2024 will face a range of premium increases and decreases if they make no change to their coverage for 2025 during open enrollment (Figure 7). Notably, enrollees in two of the three PDPs sponsored by CVS Health-Aetna could see substantial premium changes, with the consolidation of SilverScript Plus and SilverScript SmartSaver PDPs into one PDP for 2025 (SilverScript Choice). If they make no changes during open enrollment, the 0.3 million enrollees in SilverScript Plus in 2024 will see their monthly premiums reduced by more than half when they are crosswalked to SilverScript Choice, from $103 to $45. On the other hand, the 1.7 million enrollees in SilverScript SmartSaver will face a substantial increase, from $11 to $44, on average.\nDeductibles and Cost Sharing\n6 in 10 Medicare Advantage Drug Plan Enrollees Will Be in Plans That Charge a Deductible for Drug Coverage in 2025, up from 1 in 5 in 2024, and the Average Deductible is Increasing Four-Fold for MA-PD Enrollees\nAmong MA-PD enrollees, 60% (10.9 million) will be in a plan that charges a deductible for drug coverage if they stay in their same plan, though only 11% will be in a plan that charges the standard $590 deductible (Figure 8). The share of MA-PD enrollees who will be in plans charging a deductible for drug coverage in 2025 is increasing substantially over 2024 levels, when only 21% of MA-PD enrollees were in a plan charging a drug deductible, including 3% in plans charging the standard deductible amount.\nA majority of PDP enrollees (84% or 14.5 million) will be in plan that charges a drug deductible in 2025, including three-fourths (76%) who will be in a plan that charges the standard deductible of $590, assuming no change in enrollment (Figure 8). (These estimates include Part D enrollees receiving Low-Income Subsidies, who do not pay a deductible regardless of whether their plan charges one.)\nThe average drug deductible charged by MA-PD plans is increasing four-fold from $59 in 2024 to $225 in 2025 (Figure 9). Of the 34 MA-PD plan choices available to the average beneficiary in 2025, 7 will charge the standard $590 deductible, while 13 will charge no deductible. In contrast, only 3 of the 36 MA-PD plan options available to the average beneficiary in 2024 charged the standard deductible and 21 MA-PDs charged no deductible.\nFor PDP enrollees, the average deductible is increasing from $423 in 2024 to $486 in 2025 – a higher average deductible amount but a smaller increase than for MA-PD enrollees, reflecting the fact that most PDP enrollees were already (and will continue to be) enrolled in plans that charge the standard deductible. Of the 12 national PDPs in 2025, 8 will charge the standard $590 deductible, 2 will charge a lower deductible, and 2 will charge no deductible.\nA Larger Share of MA-PD Enrollees Will Face Coinsurance Rather Than Copayments for Preferred Brands and Non-Preferred Drugs in 2025 Compared to 2024\nIn 2025, as in prior years, Part D enrollees will face much higher cost-sharing amounts for brands and non-preferred drugs (which can include both brands and generics) than for drugs on a generic tier, and a mix of copayments and coinsurance for different formulary tiers. Coinsurance can mean less predictable out-of-pocket costs than copayments. The typical five-tier formulary design in Part D includes tiers for preferred generics, generics, preferred brands, non-preferred drugs, and specialty drugs.\nIn a notable change for 2025, a larger share of MA-PD enrollees is in plans charging coinsurance rather than flat copayments for preferred brands and non-preferred drugs compared to 2024 levels. The share of MA-PD enrollees facing coinsurance for preferred brands is increasing from 2% in 2024 to 28% in 2025, and the share facing coinsurance for non-preferred drugs is increasing from 11% in 2024 to 57% in 2025.\nAmong all Part D plans, median standard cost sharing in 2025 for different types of drugs is (Figure 10):\n- Generics: $0 for preferred generics and $5 for other generics in both PDPs and MA-PDs.\n- Preferred brands: a copayment of $47 in both PDPs and MA-PDs, or coinsurance of 20% in PDPs and 24% in MA-PDs); 83% of PDP enrollees and 28% of MA-PD enrollees face coinsurance rather than copayments for preferred brands.\n- Non-preferred drugs: For non-preferred drugs, which can include both brands and generics, all PDP enrollees face a median coinsurance of 40%; 57% of MA-PD enrollees face a median coinsurance rate of 42%, and 43% of MA-PD enrollees face a median copayment of $100.\n- Specialty drugs: Median coinsurance for specialty drugs is 25% for PDP enrollees and 30% for MA-PD enrollees.\nAmong the 12 national PDPs, 8 PDPs will charge $0 for preferred generics in 2024, but copays of $45 to $47 or coinsurance of 15% to 25% for preferred brands, and coinsurance ranging from 31% to 50% for non-preferred drugs; 4 out of the 12 national PDPs are charging the maximum 50% coinsurance for non-preferred drugs. Coinsurance for specialty tier drugs ranges from 25% to 33% in these plans, with 8 of the 12 national PDPs charging 25% and 2 charging 33%. (Plans that charge the standard deductible amount of $590 cannot charge more than 25% for specialty tier drugs.)\nLow-Income Subsidy Plan Availability\nIn 2025, a Smaller Number of Stand-Alone PDPs Will Be Premium-Free to Enrollees Receiving the Low-Income Subsidy Than in Any Year Since Part D Started\nThrough the Part D LIS program, enrollees with low incomes and modest assets are eligible for assistance with Part D plan premiums and cost sharing. Nearly 14 million Part D enrollees are receiving LIS, including 9 million (66%) in MA-PDs and 4.7 million (34%) in PDPs.\nIn 2025, a smaller number of PDPs will be premium-free benchmark plans – that is, PDPs available for no monthly premium to Medicare Part D enrollees receiving the Low-Income Subsidy (LIS) – than in any year since Part D started, with 90 premium-free benchmark plans, or 19% of all PDPs in 2025 (Figure 11). The number of benchmark plans available in 2025 will vary by region, from one to five (Appendix Table 2).\nPDPs offering basic benefits qualify to be benchmark plans if they have premiums below the benchmark amount in a region. The benchmark is calculated as a weighted average of the beneficiary premiums for basic drug coverage offered by both PDPs and MA-PDs in a region (calculated before taking MA rebates into account). (MA-PD premiums are included in this calculation even though MA-PDs do not qualify as benchmark plans.)\nOn average, LIS beneficiaries will have 2 benchmark plans available to them out of the average 14 PDPs available overall for 2025 – one fewer than the average number of benchmark plan options in 2024. All LIS enrollees can select any plan offered in their area, but if they enroll in a non-benchmark plan, they must pay some portion of their chosen plan’s monthly premium.\nOne quarter (26%) of all LIS PDP enrollees who are eligible for premium-free Part D coverage (1.1 million LIS enrollees) will pay Part D premiums averaging $30 per month in 2025 unless they switch or are reassigned by CMS to premium-free plans during the open enrollment period.\nJuliette Cubanski is with KFF. Anthony Damico is an independent contractor.\nMethods\nThis analysis focuses on the Medicare Part D drug plan marketplace in 2025 and trends over time, including both stand-alone prescription drug plans (PDPs) and Medicare Advantage drug plans (MA-PDs). The analysis focuses on the 17.6 million enrollees in PDPs and 18.1 million enrollees in individual MA-PDs (as of June 2024). The analysis excludes enrollees in non-individual MA-PDs (including Special Needs Plans) and enrollees in employer-group only PDPs and MA-PDs plans for whom plan premium and benefits data are unavailable.\nData on Part D plan availability, enrollment, and premiums were collected from a set of data files released by the Centers for Medicare & Medicaid Services (CMS):\n- Medicare plan landscape file, released each fall prior to the annual open enrollment period\n- Part D plan crosswalk files, released each fall\n- Part D contract/plan/state/county level enrollment files, released monthly\n- Part D Low-Income Subsidy enrollment files, released each spring\n- Medicare plan benefit package files, released periodically each year\nIn this analysis, premium and deductible estimates are weighted by June 2024 enrollment unless otherwise noted. Percentage and dollar differences are calculated based on non-rounded estimates and in some cases differ from percentages and dollar differences calculated based on rounded estimates presented in the text."
    },
    {
      "url": "https://www.milliman.com/en/insight/part-d-trend-insights-analysis-specialty-drug-utilization",
      "text": "In our prior trend report, we discussed emerging utilization and unit cost trends in the Part D market through the third quarter of 2024. This iteration of our trend series presents a more detailed review of utilization and cost patterns in the individual Part D market (i.e., excluding employer group plans) through the fourth quarter of 2024. Of note, we observe significant increases in specialty drug utilization; across all market segments, specialty1 utilization increased by nearly 10% between 2023 and 2024. This is largely driven by a 24% increase in specialty utilization among the non-low income (NLI) population between 2023 and 2024. While parsing out the secular utilization trend from any induced utilization driven by the removal of cost sharing in the catastrophic phase in 2024 is difficult, we assume the trends observed between 2023 and 2024 for the NLI population are heavily influenced by Part D benefit changes enacted by the Inflation Reduction Act (IRA) of 2022 given the wide gap in trends between NLI and LI beneficiaries.\nKey findings\nSpecialty utilization trends among NLI beneficiaries outpace those of LI beneficiaries.\nWe observe a significant upward trend throughout CY2024 in specialty drug utilization, particularly pronounced among NLI beneficiaries. Figure 1 shows the year-over-year utilization trend by quarter (e.g., 2024Q1 relative to 2023Q1) among NLI and LI beneficiaries in Medicare Part D.\nFigure 1: NLI vs. LI beneficiary trend in specialty drug utilization per 1,000, 2024 vs. 2023\nNLI beneficiaries drive the specialty utilization trend in 2024; prescription drug plans (PDPs) see the greatest impact.\nThroughout 2024, specialty drug utilization among NLI beneficiaries enrolled in PDPs increased 36%, whereas specialty drug utilization among NLI beneficiaries enrolled in Medicare Advantage Prescription Drug (MAPD) plans increased 21% from Q1 to Q4 2024 (Figure 2). In comparison, the specialty utilization among LI beneficiaries increased 14% on average over the same period. Utilization patterns of beneficiaries enrolled in PDPs also appear to exhibit a greater degree of seasonality, with a sharper decline in Q1, relative to beneficiaries enrolled in MAPD plans. This may be due to the greater prevalence of $0 deductibles and copays among MAPD plans relative to PDPs in 2023 and 2024. Of note, many MAPD plans added deductibles and/or moved brand cost sharing from copays to coinsurance in 2025. This may drive some convergence in utilization patterns between NLI beneficiaries in PDP and MAPD plans as there will be fewer differences in plan designs in 2025.\nFigure 2: NLI beneficiary specialty drug utilization per 1,000\nAmong many of the top drug classes, 2024 drug utilization trends for NLI beneficiaries significantly outpaced utilization trends for LI beneficiaries.\nWhile the overall drug utilization levels of LI beneficiaries remain much higher than those of NLI beneficiaries, utilization trends of certain high-cost therapies are markedly different between NLI and LI beneficiaries in 2024. Among the top five drug classes, the difference between NLI and LI trends for autoimmune agents and immunomodulators is particularly high (Figure 3), likely driven by the introduction of a maximum out-of-pocket (MOOP) limit that affects NLI beneficiaries more than LI beneficiaries, whose copays are already heavily subsidized.\nFigure 3: CY2024 vs. CY2023 drug utilization trend: top five classes2\nAverage cost trends decreased despite increases in utilization trends.\nWhile average utilization trends increased modestly for both MAPD and PDP beneficiaries in 2024, allowed cost per 30-day equivalent script trends decreased, falling approximately 6% for PDP beneficiaries and 1% for MAPD beneficiaries. The reduction in average cost per script demonstrates a large increase to the average point-of-sale (POS) discount driven by the requirement to move pharmacy direct and indirect remuneration (DIR) to the POS as outlined in the 2023 Centers for Medicare and Medicaid Services (CMS) final rule as well as several high volume drugs reducing list prices in 2024 (e.g., several insulins and inhalers).3,4 Figure 4 shows that the 5% differential between PDP and MAPD implies a larger DIR to POS discount conversion for PDP sponsors relative to MAPD sponsors. Further, the average cost per script decline is particularly driven by large decreases in the average cost of generics compared to brands, where we observe decreases of more than 20% for generics and more modest decreases in the average cost per script of brand drugs between 2023 and 2024.\nFigure 4: CY2024 vs. CY2023 average allowed cost per 30-day trends\nConclusion\nThe utilization patterns observed in the last quarter of 2024 confirmed expectations of beneficiary utilization changes in response to legislative changes enriching the Part D benefit. Reviewing these trends by income status reveals that NLI beneficiary utilization trends are significantly outpacing those of the LI beneficiary population. Further, reviewing year-over-year trends in the average cost per script between PDP and MAPD claim utilization reveals a large difference in the effects of the requirement of DIR at POS enacted by the 2023 CMS Final Rule.\nIn our next article, we will review emerging Q1 2025 Part D claims patterns as the first year of the Medicare Part D benefit redesign will be in place with a $2,000 MOOP limit along with the first year of the Medicare Prescription Payment Plan (M3P). If the trends described in this article continue to hold true, we expect NLI beneficiary drug utilization trends to continue to outpace those of LI beneficiaries throughout 2025, given the incremental marked reduction in financial barriers for NLI beneficiaries in 2025.\nData and methodology\nMilliman Medicare Market Intelligence (MedIntel) provided the data underpinning this whitepaper. The MedIntel platform is built upon CMS’s 100% Research Identifiable Files (RIF), highly enriched with supplementary data assets, and curated to address the needs of all Medicare stakeholders (plan sponsors, pharmacy benefit managers, manufacturers, providers, and others). Data are refreshed with as little as two weeks of lag, offering MedIntel subscribers near real-time insights to support their business needs. We relied on RIF data from January 2023 through December 2024, including claim costs from 100% of beneficiaries enrolled in Medicare Part D. For more information, contact your Milliman consultant.\nQualifications\nGuidelines issued by the American Academy of Actuaries require actuaries to include their professional qualifications in all actuarial communications. The authors are members of the American Academy of Actuaries and meet the qualification standards for rendering the actuarial opinions contained herein.\n1 Specialty is defined as exceeding the CMS specialty threshold of $950 per 30-day supply.\n2 Top classes based on gross Part D per member per month (PMPM) costs.\n3 See the full text of the CMS CY2023 Final Rule at https://www.federalregister.gov/d/2022-09375.\n4 See Part D trend insights: Initial snapshot of 2024 trends through Q3 at https://www.milliman.com/en/insight/part-d-trend-insights-snapshot-2024-q3."
    },
    {
      "url": "https://publichealth.jhu.edu/2025/tariffs-and-us-drug-prices#:~:text=%E2%80%9COne%20of%20the%20most%20immediate,individual%20drugmakers%20respond%20to%20tariffs.",
      "text": "What Pharmaceutical Tariffs Would Mean for Americans\nThe potential impacts include higher prices and drug shortages, experts say.\nFor decades, pharmaceuticals entering the U.S. have been largely tariff-free. In April, President Donald Trump threatened to change that with 25% or higher tariffs on imported drugs.\nThe stated rationale is that tariffs would incentivize drugmakers to set up shop in the U.S., create more jobs, and improve national security by reducing reliance on countries who might halt trade in the event of war or other emergency.\nIt's unclear whether tariffs would achieve these goals. But if they did take effect, public health experts say they would likely mean higher drug prices and more drug shortages.\nU.S. Reliance on Imported Drugs\nIn the past decade, U.S. pharmaceutical imports have more than doubled in value, from $73 billion in 2014 to over $215 billion in 2024, according to U.S. customs data.\nThe U.S. once had substantial drug manufacturing operations in several states. But in the past two decades, pharmaceutical manufacturers have prioritized investment in overseas manufacturing and shifted operations to Europe, taking advantage of favorable tax policies in Switzerland, Ireland, and Germany.\nFor generic drugs, the U.S. relies on lower-cost manufacturing in India and China.\nThe potential impact of imposing pharmaceutical tariffs is quite different for generic and branded drugs.\nThe High Price of Branded Drugs\nFor branded, patent-protected drugs, drugmakers effectively have a monopoly on production, and a major concern is how tariffs would impact cost. Branded drugs already account for 15% of U.S. prescriptions, but nearly 90% of drug spending.\nThe U.S. pays on average three to four times more than other developed countries for the same branded drugs—leaving about a quarter of Americans unable to afford the branded drugs they need, said Mariana Socal, MD, PhD ’17, an associate professor in Health Policy and Management, in a June 11 media briefing.\n“One of the most immediate consequences [of tariffs] could be price increases” on drugs the U.S. already pays more for than other countries do, Socal said.\nBut how this plays out for patients would depend on how individual drugmakers respond to tariffs.\nTo preserve their market share, high-profit drugmakers could choose to absorb the cost of the tariffs rather than pass higher prices on to the consumer. They also could opt to relocate to the U.S. and avoid tariffs, but may choose in that case to “incorporate some of the costs of relocation into the price of their product,” Socal said in the June 9 episode of Public Health On Call.\nEither way, the price hikes will be passed on to insurance companies, who may in turn change their policies and raise their premiums. Higher prices would also be “passed through to the Medicare program” and result in higher prices for Medicare Part D premiums, Jeromie M. Ballreich, PhD, MHS, an associate research professor in Health Policy and Management, said in the media briefing.\nQuality Concerns for Generic Drugs\nFor generic drugs—such as ibuprofen, aspirin, and antibiotics—the U.S. relies on producers in India and China, where labor costs are cheaper and drugmakers' profit margins are lower.\nUnlike branded drugs, the U.S. pays the same or even a bit less than other countries for generics.\n“We get these at lower cost, but we do have manufacturing problems like … the possibility of contamination, prompting the U.S. to inspect plants, and supply can be disrupted,” Socal said.\nGeneric drugmakers in India and China likely can't afford to relocate to the U.S. to avoid tariffs and may seek other ways to absorb the cost, said Socal.\n“Tariffs may mean that manufacturers start cutting corners, sending cheaper, lower-quality products that raise more issues and disrupt our supply” and exacerbate the already serious problem with generic shortages.\n“Every day hospitals report problems with generic supply,” said Socal. In the first three months of 2024, a record 323 drugs were in shortage—and 70% of drug shortages are related to generics, Socal noted.\nShortages of generic drugs—such as key chemotherapy treatments—can force patients to rely on more expensive branded drugs that are second-line treatments and not necessarily ideal for their condition, Socal said.\nSome drug companies are already stockpiling supplies in anticipation of possible tariffs.\nFor example, drug imports from Ireland—the single largest exporter of branded pharmaceuticals to the U.S.—in March 2025 were five times higher than in March 2024, said Ballreich.\nNational Security Questions\nOne rationale for the proposed drug tariffs is shoring up national security by maintaining a sustainable supply of prescription drugs on U.S. soil, said Socal.\nBut this raises big questions about which drugs to produce.\n“Should we produce every single drug? Which drugs are more strategic for us to produce domestically? We need more information to create incentives to target the drugs that we need the most,” said Socal. A better remedy, she said, is policies that resolve supply issues in the first place.\nAnd it's unlikely that tariffs will spur U.S. manufacturing, said Ballreich. The labs needed to produce complex branded drugs, like injection drugs and more complicated oral medicines, take years to set up. For example, Novo Nordisk, which makes Wegovy and Ozempic, announced plans to build a plant in North Carolina in 2024—but the plant will not be operational until 2029.\nWhile the U.S. has some manufacturing capacity that could be expanded, “the short answer is, I do not think we're going to see a significant surge in U.S. manufacturing of branded pharmaceuticals in the near future,” said Ballreich.\nTariffs are a “very blunt instrument” to incentivize manufacturing of branded drugs in the U.S., he said. If that is the goal, there are other important strategies to consider than simply building chemical plants—such as tax policy and subsidies, building a well-trained pharmaceutical workforce, and considering incentives akin to the CHIPS Act, which was designed to lure microchip manufacturers to the U.S."
    }
  ],
  "argos_summary": "Medicare Part D enrollees may face premium hikes of up to $50 a month next year as insurers absorb higher drug costs, a $2,000 out‑of‑pocket cap, and a reduced federal stabilization program. Stand‑alone PDPs are most affected, while Medicare Advantage plans can use rebates to keep drug premiums low and add extra benefits. Rising specialty drug use, especially for autoimmune and weight‑loss medications, and potential U.S. tariffs on imported drugs add pressure on costs. Beneficiaries are urged to shop plans during open enrollment to avoid automatic roll‑overs that could lock in higher premiums.",
  "argos_id": "QEQ6ZUYF2"
}