{
  "url": "https://www.nytimes.com/athletic/6571536/2025/08/25/this-is-why-arsenal-invested/",
  "authorsByline": "Dan Sheldon",
  "articleId": "8a244d906f5d4edd9f6d042e163f4656",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/23172630/GettyImages-2230842451-scaled-e1755984425884.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T04:18:55+00:00",
  "addDate": "2025-08-25T04:35:18.275134+00:00",
  "refreshDate": "2025-08-25T04:35:18.275137+00:00",
  "score": 1.0,
  "title": "This is why Arsenal invested",
  "description": "Arsenal's dominant victory on Saturday still threw up some familiar issues - but they are now in better position to deal with them",
  "content": "Mikel Arteta went into this season knowing Arsenal could not afford a repeat of 2024-25’s injury-riddled campaign.\n\nIf they were to finally end their run of three consecutive second-place finishes in the Premier League, Arteta — and the club’s board — understood the squad would require significant additions in the summer transfer window.\n\nSo, when Kai Havertz picked up a knee injury last week, they acted quickly to get in ahead of Tottenham Hotspur to sign Eberechi Eze from Crystal Palace in a deal worth up to £67.5million.\n\nEze’s arrival not only added genuine quality to an already talented squad, it also helped to alleviate concerns around Havertz’s absence and added attacking depth.\n\nBut when Martin Odegaard and then Bukayo Saka left the pitch early during Arsenal’s 5-0 win over Leeds United on Saturday, you could forgive Arteta — and the club’s supporters — for having a sense of deja vu.\n\nOnly this season, they have enough strength in depth to cope. That’s off the back of a summer that has seen them, so far, sign Martin Zubimendi from Real Sociedad for €65m (£55.8m), Sporting CP’s Viktor Gyokeres for €63.5m (£54.8m), Noni Madueke (£48.5m) and goalkeeper Kepa Arrizabalaga (£5m) from Chelsea for a combined £53.5m, Valencia’s Christian Mosquera in a £13m deal, and Christian Norgaard from Brentford for £10m.\n\nThat is not to underplay what a significant blow it would be to lose either Saka or Odegaard from the starting XI for any length of time, and fortunately for the club the scans on Sunday showed neither player’s injury was as serious as first feared, but Arsenal are much better equipped to deal with it now than they were last season.\n\n“That’s what we need,” Arteta said after the Leeds win when asked about the importance of squad depth. “The other way (a small squad) is not realistic to survive at the levels that we want for 10 months. None of the other top teams in the league do it, so why would we be different?\n\n“They (our rivals) still have even bigger squads than we have, so that’s the minimum we can have to compete and be able to do what we want.”\n\nSuch was the depth of Arsenal’s bench on Saturday, Arteta chose not to bring on Gabriel Martinelli, who must be wondering about his long-term future at the club despite making 51 appearances in all competitions in 2024-25 for the north London side.\n\nArteta instead turned to Max Dowman, one of their most impressive performers during pre-season, even at the age of 15, to come off the bench in the second half and occupy the right flank that is normally home to Saka.\n\nAnd given how impressive Dowman’s 25-minute cameo was, where he won a penalty and electrified the Emirates with his assured confidence, silky touch and dazzling runs, the next question will be: when does the schoolboy earn his first start?\n\nThere were plenty of occasions last season when Arsenal’s attacking depth was found wanting, be it when Ethan Nwaneri played on the right to cover the injured Saka, even though the 18-year-old came through the academy playing in midfield, or Mikel Merino had to feature as a makeshift forward to fill in for Havertz.\n\nAnd what would have stung Arteta most about deploying Merino, a midfielder, up front is that it happened after they did not buy a striker in January.\n\nWhile Havertz was out following surgery on a torn hamstring, he was joined in the rehab room by Martinelli, Saka and Gabriel Jesus. Arteta was without four strikers at a crucial point in the season.\n\nSo, you can understand why there was such a desperate need to learn from the lessons of 2024-25 to ensure they weren’t in the same boat again.\n\nNow they are in a position where they have cover for Saka, Havertz and Odegaard in Gyokeres, Madueke and Eze — and as he did on Saturday, Nwaneri has shown he is more than capable of filling in for Odegaard in midfield.\n\nSaka’s possible absence on the right creates an opportunity for Madueke, who started on the left against Leeds, while Dowman will only grow in confidence in the position with each impressive cameo.\n\nArteta and Arsenal had to learn the hard way last season.\n\nGoing to Liverpool next weekend, having lost Havertz and potentially Odegaard and Saka in the space of a week, would have made for an even more daunting prospect.\n\nBut arriving at Anfield with a slew of marquee names — especially those that come with big-game experience in Madueke, Eze and Gyokeres — should mean the panic stations at London Colney can remain vacated, even if the physio room unfortunately again could be busy.\n\nArsenal have spent a significant amount of money to make this possible, knowing it is what they needed to win their first Premier League title since 2003-04 and take the challenge to Liverpool, who have spent over £300million since the summer transfer window opened.\n\nThere is no doubt Arteta would much prefer a clean bill of health, but he will also know they are more equipped than ever when it comes to navigating an injury pile-up.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6568120/2025/08/23/inside-eberechi-eze-arsenal-transfer/",
    "https://www.nytimes.com/athletic/6572330/2025/08/24/bukayo-saka-martin-odegaard-injuries-news-arsenal/",
    "https://www.nytimes.com/athletic/6571395/2025/08/23/arsenal-saka-odegaard-injury-arteta/"
  ],
  "labels": [
    {
      "name": "Non-news"
    },
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "last season",
      "weight": 0.06847533
    },
    {
      "name": "Mikel Arteta",
      "weight": 0.066155374
    },
    {
      "name": "squad depth",
      "weight": 0.06502261
    },
    {
      "name": "Arteta",
      "weight": 0.06312393
    },
    {
      "name": "Bukayo Saka",
      "weight": 0.061422512
    },
    {
      "name": "Saka",
      "weight": 0.06045555
    },
    {
      "name": "Arsenal",
      "weight": 0.056992613
    },
    {
      "name": "season",
      "weight": 0.05627783
    },
    {
      "name": "Kai Havertz",
      "weight": 0.05540812
    },
    {
      "name": "Havertz",
      "weight": 0.05500297
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98291015625
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.97265625
    }
  ],
  "sentiment": {
    "positive": 0.15751632,
    "negative": 0.4461007,
    "neutral": 0.3963829
  },
  "summary": "Arsenal manager Mikel Arteta has stated that the club cannot afford to repeat their previous injury-riddled season, which saw three consecutive second-place finishes in the Premier League. The club's transfer window saw them sign Eberechi Eze from Crystal Palace in a deal worth up to £67.5m, which helped alleviate concerns about Kai Havertz's knee injury and added attacking depth. However, the club's injuries were confirmed as not as serious as first feared, but they are now more equipped to cope with them now than last season. This follows a summer that saw Arsenal sign Martin Zubimendi from Real Sociedad, Viktor Gyokeres from Sporting CP, Noni Madueke from Sporting Lisbon, goalkeeper Kepa Arrizabalaga from Chelsea, and Christian Norgaard from Brentford for £10m.",
  "shortSummary": "Arsenal's season was marred by injuries, resulting from key signings like Eberechi Eze, yet the club’s current strength and flexibility remains crucial.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d45cfee1615a451a86af16cc2df1bc2f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6571395/2025/08/23/arsenal-saka-odegaard-injury-arteta/",
      "text": "Mikel Arteta says Martin Odegaard and Bukayo Saka will undergo further assessments to determine the severity of their respective shoulder and hamstring injuries suffered in Arsenal’s 5-0 win over Leeds United.\nOdegaard, who was making his 200th Arsenal appearance, came off for Ethan Nwaneri about 10 minutes after he received on-pitch treatment in the first half. Saka, on the other hand, was replaced immediately after talking to the club physio on the pitch. He appeared to sustain an injury to his left hamstring.\nAdvertisement\nThis comes after Arsenal lost Kai Havertz to a knee injury, which also requires further tests.\nOn the injuries, in his post-match press conference, Arteta said: “Martin felt something in his shoulder when he landed. We will have to scan it tomorrow and understand it a bit better. Bukayo was carrying the ball, wrestling with the defender and he felt something in his hamstring.\n“It’s not the same one as the previous injury. But it’s been two weeks and we’ve already lost Kai, Martin and Bukayo, so it tells you how well equipped you have to be in this league to maintain the level we want.”\nSpeaking to beIN Sports post-match, the Arsenal manager added: “For Bukayo to come off, for sure it looks like something that is significant.”\nLast season, Saka injured his right hamstring in December and required surgery, keeping him out for over three months.\nArteta reacted to Saka’s injury on Saturday by bringing on Leandro Trossard, who recently agreed a new contract with Arsenal, and moving Noni Madueke from the left to the right wing.\nWhile Odegaard and Saka are two of Arsenal’s most important players, having the ability to replace them without having players out of position has not always been a luxury Arteta has had.\nOn the options in his squad, he said: “That’s what we need. The other way (a small squad) is not realistic to survive at the levels that we want for 10 months. None of the other top teams in the league do it, so why would we be different.\n“They still have even bigger squads than we have, so that’s the minimum we can have to compete and be able to do what we want.”\nArsenal have won their opening two Premier League matches, keeping clean sheets in both. Their next game is away to Liverpool next Sunday, August 31.\n(Justin Setterfield/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6568120/2025/08/23/inside-eberechi-eze-arsenal-transfer/",
      "text": "It’s not a hijack, it’s a love story.\nOn Wednesday, Eberechi Eze was expecting to sign for Tottenham. It was undeniably a good move: a London club, a Champions League club, no less. For his career, it represented a step up.\nBut before he committed, there was one phone call he needed to make. Eze called Mikel Arteta.\nAdvertisement\nIt was not the first time they had spoken. Arteta and Eze had a conversation at the end of June, when Arsenal first explored a potential deal for the 27-year-old Crystal Palace playmaker. Since then, however, Arsenal’s interest had seemingly waned. Tottenham had stepped up their pursuit.\nFrom a professional perspective, Eze was happy to sign for Spurs. But he had grown up an Arsenal fan. He wept when released from the club’s academy aged 13. Before signing anything, Eze needed to know if there was any chance of making a deal with Arsenal happen.\nTiming is everything, and Eze’s couldn’t have been better. Arsenal were still reeling from the news that Kai Havertz had been sidelined with a knee injury. They were actively looking for ways to reinforce their attack.\nArteta told Eze that Arsenal had a board meeting that afternoon. By the time that meeting had concluded, an ecstatic Eze was informed that the deal was all but done. By Wednesday night, Arsenal had an agreement with Crystal Palace for an initial £60million ($81.2m) with a potential £7.5m in add-ons. Eze’s representatives had also agreed personal terms on a four-year contract with the option of a further year.\nThere was no real tug-of-war with Tottenham. There couldn’t be. If Arsenal were at the table, there was only one destination for this player.\nAs well as speaking to Arteta, Eze lobbied England team-mates at Arsenal to push the club for his arrival. As with Viktor Gyokeres before, Arsenal were struck by a player prepared to do whatever it took to get his preferred move.\nFor Eze, the transfer is a dream come true. For Arsenal, it’s a statement of ambition. When Havertz went down, Arsenal were determined that this would not be another season defined by injuries.\nAfter that initial conversation in June, Eze never entirely left Arsenal’s thoughts. In the end, they could not resist him. Wresting him away from their local rivals was simply the icing on the cake.\nEze loves Arsenal, but the feeling is mutual. Arteta had grown increasingly enamoured with the attacker, and the club have pushed the boat out to make a deal happen. He brings audacious talent, considerable experience, and the hunger to rewrite his Arsenal story.\nTo tell the inside story of this transfer, The Athletic has spoken to sources from clubs involved and linked to players, who spoke anonymously to protect relationships.\nA player of Eze’s calibre was always going to feature on Arsenal’s radar. Initially, however, there were other priorities to attend to in the window — chiefly the acquisition of a new No 9.\nWhen Arsenal first began exploring a potential deal for Eze, it was linked to their contract negotiations with Ethan Nwaneri. While Arsenal were always hopeful Nwaneri would extend, talks reached a delicate stage.\nAdvertisement\nNwaneri had just 12 months to run on his existing deal. With interest in the 18-year-old from the Premier League and abroad, Arsenal were clear that they could not allow him to enter the final year of his contract. The club never wanted to sell Nwaneri, but there were fears it might come to that.\nSensibly, Arsenal began exploring contingencies. They discussed Morgan Rogers and Morgan Gibbs-White, but it was Eze who held the most appeal. In early dialogue between the parties, Eze’s personality made a strong impression.\nThe clear issue was price. For much of the summer, Eze had a release clause enabling him to leave for a fee of £60million plus £8m in add-ons. Arsenal considered that price steep for a 27-year-old. They hoped to pay closer to £40m, perhaps ranging up to £50m with add-ons. For Palace, that was a no-go.\nArsenal’s concerns proved to be moot: in the first half of July, they had a breakthrough in contract talks with Nwaneri. The interest in Eze was shelved — temporarily, at least. Arsenal saw Eze primarily as a central player, and at the time, Arsenal prioritised strengthening the wings. They moved forward with a deal for Noni Madueke, paying an initial £48.5million — a price they felt was attractive given the market.\nArsenal and Tottenham’s pursuit of Eze have something in common: they were both accelerated by injury. When James Maddison suffered an ACL injury during a pre-season friendly against Newcastle, Spurs stepped up their interest in the Palace man.\nLike Arsenal, Spurs were reluctant to meet the release clause. They started indirect negotiations with Crystal Palace over a fee. The two clubs were initially far apart in their valuations, but they steadily grew closer. By August 15, they were said to be “very close” to an agreement.\nOn August 18, Spurs chairman Daniel Levy held face-to-face talks with his Palace counterpart, Steve Parish. They agreed on the broad outline of a deal for £50million with a further £10m in add-ons.\nAdvertisement\nThe following day, however, the deal took a backwards step. The devil was in the details: while the broad terms were agreed, there was a dispute over the bonus structure. Both sides were frustrated. By Tuesday evening, the deal appeared to be in some jeopardy.\nOn the other side of north London, Arsenal were experiencing problems of their own that evening. Havertz had missed Arsenal’s penultimate friendly with a knee issue, but this time, the injury appeared altogether more serious. Scans on Tuesday did not provide a clear timeline for recovery, but Arsenal were concerned. At best, he’d miss weeks — weeks in which Arsenal face crucial games against Liverpool, Newcastle and Manchester City. At worst, it could be months.\nLosing Havertz for any length of time was a hammer blow. Had he been fully fit, many at Arsenal felt he was in line to start at Old Trafford. Arteta had envisaged relying on the German international while Viktor Gyokeres built up his match fitness.\nArsenal bought Gyokeres to ensure they had real depth and options at centre-forward. A lengthy lay-off for Havertz would put them back where they started. Arsenal recognised they would need to re-enter the market.\nOn Wednesday morning, in an attempt to push through the transfer, Spurs submitted a formal offer which acceded to all of Palace’s demands — including allowing Eze to participate in their UEFA Conference League qualifier on Thursday night. They never heard back. Within hours, Parish had struck a deal with Arsenal.\nIt’s well-known that Eze preferred Arsenal. But Palace did too.\nThe good relationship between Parish and Arsenal’s executive vice-chair Tim Lewis was key. While Arsenal had backed away from Eze, they were able to remain informed on proceedings, perhaps hoping to return if they made sales. Negotiations between Tottenham and Palace had been difficult, and when Lewis and Arsenal came forward as an alternative buyer, Parish was happy to oblige.\nAdvertisement\nArsenal had discussed a number of options to replace Havertz. They toyed with the idea of a No 9, but knew that would create congestion when Havertz returned. Some lobbied for a left-winger, with Rodrygo of Real Madrid once again discussed.\nBut it was Eze who won out. He had left a big impression on Arteta, and Arsenal decided he could bring qualities they did not have elsewhere in the squad.\nOnce approval had been received from Arsenal’s owners — co-chairman Josh Kroenke is in Europe for the start of the Premier League season and signed off on behalf of Kroenke Sports & Entertainment — they proceeded with a bid. Spurs had been negotiating for weeks — Arsenal struck their deal in less than 24 hours.\nArsenal know what it feels like to be in Tottenham’s position. In January 2023, they were gazumped in a similar fashion by Chelsea for Mykhailo Mudryk. This time, the shoe is on the other foot.\nFor Palace, the outcome was ideal. The final agreement was for an initial £60million with a further £7.5m in possible add-ons — virtually the same as the release clause that expired before the start of the Premier League season. Palace had benefited from the interest of two parties in Eze.\nArsenal also agreed that Eze would be available to play against Fredrikstad on Thursday night, scheduling his medical for the following day.\nArsenal’s willingness to spend big on Eze before securing any significant sales has surprised many. Arsenal have spent almost £70million on a player they allowed to leave their academy for nothing. Even internally, some urged caution. Arsenal are sailing ever closer to the wind on UEFA’s squad cost ratio legislation.\nBut Arsenal have taken an aggressive approach this summer. This was not, they deemed, the time for hesitation.\nEze, who will wear the No 10 shirt, is another Tier 1 addition to the Arsenal squad — a player with the quality to be a starter. He is well-known to many of the group through the England squad. He brings creativity, flair, and end product, with 14 domestic goals and 11 assists for Palace last season.\nAdvertisement\nHe offers tactical intelligence, too. Under Oliver Glasner, he has shown an ability to thrive in a nuanced system.\nHe is not a direct replacement for Havertz, but he has the versatility to offer a number of potential solutions. Despite originally envisaging him as a central player, Arsenal are giving consideration to using Eze off the left. His presence in the squad also liberates the likes of Leandro Trossard and Mikel Merino to fill in for Havertz when required.\nIn the end, Eze did not play against Fredrikstad. On Thursday morning, he explained to Glasner that he did not feel able to play. His mind was elsewhere. His heart, too.\nArsenal have not just bought Eze. They have brought him home.\nIt was nearly Spurs, but it was always Arsenal.\n(Illustration: Eamonn Dalton / The Athletic; Chris Brunskill/Fantasista/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6572330/2025/08/24/bukayo-saka-martin-odegaard-injuries-news-arsenal/",
      "text": "Arsenal have received a boost after scans suggested neither Bukayo Saka nor Martin Odegaard have sustained long-term injuries following their early exits in Saturday’s 5-0 win over Leeds United.\nThe north London side’s head coach Mikel Arteta initially feared Saka had suffered a “significant” hamstring injury in the second half of the victory at the Emirates Stadium, while captain Odegaard also left the pitch clutching his right shoulder during the first half.\nAdvertisement\nThis followed on from Kai Havertz sustaining an injured knee on the opening weekend, which prompted Arsenal to sign Eberechi Eze from Crystal Palace in a deal worth up to £67.5million.\nSources with knowledge of Saka’s and Odegaard’s situation, though, have said to The Athletic that the scans showed the injuries are not as serious as first feared.\nSaka missed four months of last season after a hamstring surgery on his right leg and a fresh problem for the winger, who doubled Arsenal’s lead on Saturday, would have been a major blow for Arteta and the club – particularly ahead of the huge meeting with Liverpool next weekend.\nWhile it remains unclear if the pair will be available to face the league champions on Sunday August 31, they are now not expected to be sidelined for significant periods.\nArsenal were missing Kai Havertz, Ben White, Christian Norgaard and Gabriel Jesus from the squad for the win over Leeds but announced new £67.5million signing Eberechi Eze from Crystal Palace, who could make his debut at Anfield, ahead of kick off.\nJurrien Timber and Viktor Gyokeres, Arsenal’s new £64million striker, scored twice and Max Dowman made his top-flight debut aged only 15 years and 235 days old, winning a stoppage-time penalty which was converted by Gyokeres."
    }
  ],
  "argos_summary": "Arsenal have strengthened their squad depth with a string of summer signings—Eberechi Eze, Viktor Gyokeres, Noni Madueke, and others—so that injuries to key players like Saka, Odegaard and Havertz no longer threaten the title push.  Arteta stresses that a small squad is unrealistic for a 10‑month campaign and that the new arrivals give the team the flexibility to cover multiple positions.  The club’s recent 5‑0 win over Leeds saw a 15‑year‑old Max Dowman make a striking debut, while scans suggest Saka and Odegaard’s injuries are not severe.  The Eze transfer, secured after a swift deal with Crystal Palace, underscores Arsenal’s ambition to secure creative firepower and maintain competitive depth.",
  "argos_id": "QFE752Y8M"
}