{
  "url": "https://www.businessinsider.com/ukraine-strike-deep-russia-atacms-neptune-flamingo-zelenskyy-us-approval-2025-8",
  "authorsByline": "Matthew Loh",
  "articleId": "28f4a66b68f84acbb3a076ba9a41147a",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/68abe0fda17a8c5b405362b5?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T05:14:51+00:00",
  "addDate": "2025-08-25T05:19:51.360247+00:00",
  "refreshDate": "2025-08-25T05:19:51.360250+00:00",
  "score": 1.0,
  "title": "Ukraine now has its own weapons to strike deep into Russia without US approval, Zelenskyy says",
  "description": "Zelenskyy said Ukraine hadn't been discussing long-range attacks with the US, after a new report said the Pentagon had blocked some ATACMS strikes.",
  "content": "Ukraine can now strike deep into Russia without needing coordination with the US, Ukrainian President Volodymyr Zelenskyy said on Sunday.\"As of today, we are using our domestically produced long-range weapons. And to be honest, we haven't been discussing such matters with the US lately,\" Zelenskyy said at a joint press conference with Canadian Prime Minister Mark Carney.\"There was a time when there were different signals regarding our retaliatory strikes after their attacks on our energy system,\" Zelenskyy said, referring to Russia's strikes on Ukrainian infrastructure. \"That was already a very long time ago. Today, we don't even mention it.\"The Ukrainian leader's statement signals a massive change in what had, for years, been a status quo in Kyiv's deep strike capability. Ukraine, reliant for much of the war on long-range Western systems such as the US-made Army Tactical Missile Systems, typically needed approval from Washington and its allies for strikes into Russia.The ATACMS in particular requires US-provided satellite data and targeting for successful precision strikes, affording the Pentagon greater authority over what the weapons can be used for.NATO countries, fearing escalation with Moscow, withheld permission for Kyiv to launch attacks into Russia for months, limiting strikes to targets in Ukrainian territory.Ukrainian officials repeatedly voiced frustration at the restriction, saying they were kneecapped and unable to strike the Kremlin's forces massing on the border.In November, after an extended period of indecision, the Biden administration and US allies began permitting selected attacks on Russian soil with munitions such as ATACMS and Storm Shadow missiles.But that arrangement may be in question. The Wall Street Journal reported on Saturday, citing two unnamed US officials, that the Pentagon had blocked Ukraine from firing its ATACMS into Russia and had denied at least one request.Karoline Leavitt, the White House press secretary, said to WSJ that there had been \"no change in military posture in Russia-Ukraine at this time.\"The report comes as the Trump administration has tried to entice Russian President Vladimir Putin to the negotiating table, hoping to mediate a peace deal.President Donald Trump also raised the topic in a Thursday TruthSocial post while criticizing his predecessor, former President Joe Biden.\"It is very hard, if not impossible, to win a war without attacking an invader's country. It's like a great team in sports that has a fantastic defense, but is not allowed to play offense. There is no chance of winning! It is like that with Ukraine and Russia,\" Trump wrote.Notably, he told Time Magazine in December that he had disagreed \"very vehemently\" with Ukraine's ATACMS strikes on Russia the month before.But Ukraine has, in the last few years, developed its own long-range missiles and systems, which would allow Kyiv more leeway to independently launch precision strikes on Russian targets.One example is the Neptune, a truck-launched subsonic cruise missile meant to hit naval targets.The Neptune was in development before the full-scale invasion, but Ukraine has more recently unveiled a new ground-launched munition.On August 18, its defense minister said the country was now serially producing the Flamingo, a domestically manufactured missile touted to have a range of 1,800 miles.That distance would allow Ukraine to possibly threaten Russia's key military production facilities in faraway areas such as the Urals.Zelenskyy said on Friday that the Flamingo could enter mass production by February.\"The missile has undergone successful tests. It is currently our most successful missile,\" he told reporters.These precision munitions aside, Ukraine has also been regularly launching deep strikes against Russian energy facilities and weapons production plants with fixed-wing drones, which are far slower.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "successful precision strikes",
      "weight": 0.07869373
    },
    {
      "name": "precision strikes",
      "weight": 0.07714106
    },
    {
      "name": "US allies",
      "weight": 0.075569026
    },
    {
      "name": "US approval",
      "weight": 0.07535533
    },
    {
      "name": "deep strikes",
      "weight": 0.075022854
    },
    {
      "name": "Ukrainian President Volodymyr Zelenskyy",
      "weight": 0.07330191
    },
    {
      "name": "Ukraine",
      "weight": 0.07118872
    },
    {
      "name": "US",
      "weight": 0.07103985
    },
    {
      "name": "strikes",
      "weight": 0.07072872
    },
    {
      "name": "Russian President Vladimir Putin",
      "weight": 0.06798011
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.98291015625
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.98193359375
    },
    {
      "name": "/News/World News",
      "score": 0.9453125
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.91259765625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.91015625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.5322265625
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.4697265625
    }
  ],
  "sentiment": {
    "positive": 0.049900044,
    "negative": 0.72437906,
    "neutral": 0.2257209
  },
  "summary": "Ukraine's President, Volodymyr Zelenskyy, has stated that Ukraine can now strike deep into Russia without needing coordination with the US. This shift from relying heavily on long-range Western systems like the US-made Army Tactical Missile Systems (ATACMS), which requires US-provided satellite data and targeting for successful precision strikes, could potentially undermine Ukraine's ability to independently launch precision strikes on Russian targets. However, this arrangement may be in question, according to reports from the White House that the Pentagon had blocked Ukraine from using its ATACMS into Russia and had denied at least one request. This comes as the Trump administration attempts to negotiate with Russian President Vladimir Putin to reach a peace deal.",
  "shortSummary": "Ukraine now can launch long-range missile strikes into Russia without US approval, significantly increasing its capabilities, despite years of reliance on Western-produced systems.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "597208a5b93c42b39662af52c7f1e8ea",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Ukrainian President Volodymyr Zelenskyy announced that Kyiv can now launch deep strikes into Russia using domestically produced long‑range weapons without needing U.S. coordination, marking a shift from earlier restrictions that required Washington’s approval for ATACMS and other precision munitions. The move follows the U.S. and NATO’s recent loosening of rules that had limited Ukraine to strikes inside its own territory, although reports suggest the Pentagon may still block certain ATACMS launches. Ukraine has been developing its own missile systems—such as the Neptune cruise missile and the 1,800‑mile‑range Flamingo—while also conducting deep‑strike drone attacks on Russian energy and weapons facilities. The announcement comes amid U.S. political debate, with former President Trump criticizing the U.S. stance and the Biden administration reportedly reconsidering its policy on Ukraine’s strikes into Russia.",
  "argos_id": "QGGEASPJX"
}