{
  "url": "https://www.bloomberg.com/news/videos/2025-08-25/nvidia-earnings-traders-hope-chip-firm-can-soothe-fears",
  "authorsByline": "bn",
  "articleId": "c436f13f8dd340068cf7d2011de718d8",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iAjSAflPbSTk/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T05:30:11.817000+00:00",
  "addDate": "2025-08-25T05:34:32.447925+00:00",
  "refreshDate": "2025-08-25T05:34:32.447927+00:00",
  "score": 1.0,
  "title": "Nvidia Earnings: Traders Hope Chip Firm Can Soothe Fears",
  "description": "Nvidia is set to report quarterly earnings on Wednesday after the market close. Traders are hoping the chip giant at the center of artificial intelligence development can soothe fears about AI spending and effectively confirm that the stock market’s latest rally isn’t just a technology bubble. Annabelle Droulers reports. (Source: Bloomberg)",
  "content": "What should we be watching out for from what is probably the most or one of the most important stocks to follow this week? I think I think you could probably have that that the most going to be the most tracked company this week really. I mean it makes up around 3% of all the global market cap. It's it's the heaviest weighting on the S & P 500 as well that around 8%. It's going to be really important to track because you have seen tech stocks a little bit under pressure of late. Concerns resurfacing once again around the health of of the LED rally, whether that should be sustained moving forward here. You're taking a look at some of those numbers we're expecting. So revenue, for instance, expected to come in at $46 billion for the period That would be around a 50% jump in revenue on the year adjusted earnings per share of just over a dollar US as well. Options traders certainly saying you're going to be seeing big swings in either direction around 6% plus or minus post the numbers. One of the big questions as well for analysts going into this is what is NVIDIA going to be saying about China? Because last week one of the big stories was how, yes, the US has has reversed its decision to halt sales of H 20 CHIP to China. But now you're hearing the Chinese government is also encouraging firms not to to to to to buy up that chip that was specifically designed for the mainland market. So now exactly what does Nvidia do about this question Mark, given we're hearing they've also halted production of that chip as well and they continue to have reliance on the mainland market as well.",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Roundup"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Chip Firm",
      "weight": 0.09912793
    },
    {
      "name": "big swings",
      "weight": 0.08226904
    },
    {
      "name": "tech stocks",
      "weight": 0.079469584
    },
    {
      "name": "last week",
      "weight": 0.06942116
    },
    {
      "name": "Options traders",
      "weight": 0.06673342
    },
    {
      "name": "firms",
      "weight": 0.06544134
    },
    {
      "name": "revenue",
      "weight": 0.06271041
    },
    {
      "name": "US",
      "weight": 0.060779136
    },
    {
      "name": "Traders",
      "weight": 0.059947696
    },
    {
      "name": "sales",
      "weight": 0.05179005
    }
  ],
  "topics": [
    {
      "name": "AI"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.98291015625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.97314453125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.94482421875
    },
    {
      "name": "/News/Technology News",
      "score": 0.75634765625
    },
    {
      "name": "/Computers & Electronics/Computer Hardware/Computer Components",
      "score": 0.41552734375
    }
  ],
  "sentiment": {
    "positive": 0.066125885,
    "negative": 0.64761645,
    "neutral": 0.28625765
  },
  "summary": "The most anticipated company for the week is Nvidia, which makes up around 3% of the global market cap and is expected to be the most closely followed by the S&P 500. The company is also facing questions about the health of the LED rally and whether it should be sustained. However, options are expected to see significant swings in either direction following the results.",
  "shortSummary": "Nuclear engineering giant Nvidia's earnings report is likely to be the most closely watched, with significant market interest due to concerns over the health of the LED rally.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "639a4a007336491c83b260c91695b0cd",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The article highlights Nvidia as a key stock to monitor, noting its significant weight in global market cap and the S&P 500. It projects a 50% revenue increase to $46 billion and EPS above $1, while options traders anticipate large swings post-earnings. Analysts are also focused on Nvidia’s stance on China amid U.S. policy reversals and Chinese discouragement of certain chip purchases, as the company has halted production of a mainland‑specific chip.",
  "argos_id": "QRULGGL11"
}