{
  "url": "https://www.cbsnews.com/boston/news/pickup-truck-crash-raynham-dollar-tree/",
  "authorsByline": "By\n                        \n              \n                            \n          \n            \n                Samantha  Chaney\n            \n\n            \n              \n                \n                  \n                \n              \n\n              \n                                  \n                    \n                  \n                \n                \n                  Samantha  Chaney\n\n                                  \n              \n\n                              \n                  Samantha Chaney joined WBZ-TV in September 2024 as a multi-skilled journalist and reporter.\n                \n              \n              Read Full Bio\n            \n          \n\n          \n            Samantha  Chaney",
  "articleId": "d9957107874e4e37997933cfffa92c83",
  "source": {
    "domain": "cbsnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/08/25/df91ea46-37c8-40d3-8b33-427e849ef2e1/thumbnail/1200x630/e06da9f36192d55b3325b1dea0bf825e/raynham-crash-11p-sun-vo-transfer-frame-291.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T23:10:42-04:00",
  "addDate": "2025-08-25T03:23:04.566890+00:00",
  "refreshDate": "2025-08-25T03:23:04.566892+00:00",
  "score": 1.0,
  "title": "Man killed in violent crash after \"confrontation\" at nearby Dollar Tree in Massachusetts",
  "description": "At least one person is dead after a violent crash involving a pickup truck Sunday night in Raynham.",
  "content": "One person is dead and another person is critically injured after a violent crash involving a pickup truck Sunday night in Raynham, Massachusetts.\n\nPolice said they received a 911 call at 8:12 p.m. Sunday for the report of a person driving \"erratically\" near South Street West. Police then received a report that a pickup truck crashed into a tree on the same street. On the scene, debris was scattered all across the road and one of the pickup's back wheels was torn off.\n\nPolice said the crash happened after some sort of confrontation happened at a Dollar Tree store just up the road from where the crash happened.\n\nThe driver of the pickup, a 31-year-old man, was killed in the crash. The only passenger, a 33-year-old woman, was taken to the hospital with life-threatening injuries. Neither victim has been identified.\n\nThe cause of the crash remains under investigation. No other information was immediately available.\n\nRaynham is in Bristol County and is located about 34 miles south of Boston.",
  "medium": "Article",
  "links": [
    "https://www.cbsnews.com/team/samantha-chaney/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "violent crash",
      "weight": 0.12556884
    },
    {
      "name": "nearby Dollar Tree",
      "weight": 0.09795215
    },
    {
      "name": "Dollar Tree",
      "weight": 0.09328818
    },
    {
      "name": "Bristol County",
      "weight": 0.078122914
    },
    {
      "name": "Sunday",
      "weight": 0.077234454
    },
    {
      "name": "South Street West",
      "weight": 0.07701429
    },
    {
      "name": "confrontation",
      "weight": 0.07077496
    },
    {
      "name": "a violent crash",
      "weight": 0.06659293
    },
    {
      "name": "Raynham",
      "weight": 0.06556972
    },
    {
      "name": "Police",
      "weight": 0.065445304
    }
  ],
  "topics": [
    {
      "name": "Crime"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.97412109375
    },
    {
      "name": "/News/Local News",
      "score": 0.9658203125
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.91162109375
    }
  ],
  "sentiment": {
    "positive": 0.045036245,
    "negative": 0.75469613,
    "neutral": 0.2002677
  },
  "summary": "A violent incident occurred in Raynham, Massachusetts, involving a pickup truck and a vehicle. The driver of the vehicle, a 31-year-old man, was killed and the only passenger, a woman, taken to the hospital with life-threatening injuries. The incident occurred after a \"confrontation\" occurred at a nearby Dollar Tree store. The cause of the crash remains under investigation.",
  "shortSummary": "A 31-year-old man was killed and another was critically injured in a pickup truck crash in Raynham, Massachusetts, on Sunday.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "0404cff82d274ee1962bc95a89321243",
  "places": [
    {
      "osmId": "9517659",
      "road": "South Street West",
      "town": "Raynham",
      "county": "Bristol County",
      "state": "Massachusetts",
      "postcode": "02767",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 41.9070637,
        "lon": -71.0571021
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.cbsnews.com/team/samantha-chaney/",
      "text": "Man killed in violent crash after \"confrontation\" at Dollar Tree in Raynham\nAt least one person is dead after a violent crash involving a pickup truck Sunday night in Raynham.\nSamantha Chaney joined WBZ-TV in September 2024 as a multi-skilled journalist and reporter.\nA Minnesota native, she has now called the East Coast her home for the past 7 years. Before moving to Boston, she worked in New York City as a general assignment reporter at News 12 The Bronx, where she covered a wide range of impactful stories and was nominated for a New York Emmy Award as part of the station's team coverage of record flooding in the community.\nSamantha has always considered herself part of the CBS family. She grew up in a newsroom, following in her father's footsteps. He was a photojournalist at WCCO-TV in Minneapolis for 46 years. Prior to News 12, she also worked in various off-air roles for the CBS Political Unit, CBS This Morning, and the CBS Evening News with Norah O'Donnell.\nChaney is a proud alumna of Howard University, where she graduated summa cum laude with a Bachelor of Science degree in journalism and political science. She also earned a master's degree from Columbia University's Graduate School of Journalism.\nWhen Chaney isn't reporting at WBZ, you can find her trying new restaurants around the city, traveling the world, and spending time with her family and friends.\nAt least one person is dead after a violent crash involving a pickup truck Sunday night in Raynham.\nA body was found in a car parked at South Shore Hospital in Weymouth on Saturday afternoon.\nMassachusetts is exploring the possibility of banning cellphones in schools. In Watertown, they might have a solution for everyone.\nRoaming the aisles of Stop & Shop in Massachusetts, you may soon be putting more in your cart, but paying less at checkout.\nBoston Lyric Opera's summer camp is teaching kids how to write their own opera.\nA man was medflighted to a Boston hospital after he was seriously burned when a boat went up in flames in a yard on Cape Cod.\nMore than 100 people were illegally riding bicycles, dirt bikes, and motorized scooters on Route 93 in Boston Saturday.\nThe price of vegetables shot up nearly 40% compared to this time last year.\nA homeowner in Pembroke awoke early Sunday to find a pickup truck crashed through his garage door.\nA man pulled from the water off Nantasket Beach in Hull on Saturday later died, police said.\nThis weekend, Massachusetts is offering shoppers a break with many retail items exempt from a usual sales tax.\nWhile Massachusetts is a health care leader, it's actually quite difficult to find a primary care doctor in the state.\nBeverly, Massachusetts has claimed the title of the \"hottest\" ZIP code in the country for 2025, according to Realtor.com.\nThree young Palestinian girls arrived in Boston Sunday to receive urgent medical care after being evacuated from Gaza.\nA woman in Boston claims to have been bitten by a rat while she was walking down Mountfort Street in the Fenway area Friday night."
    }
  ],
  "argos_summary": "A pickup truck crashed into a tree on South Street West in Raynham, Massachusetts, after a confrontation at a nearby Dollar Tree, killing the 31‑year‑old driver and critically injuring a 33‑year‑old passenger. The crash, reported at 8:12 p.m. Sunday, left debris scattered across the road and a torn back wheel. Police are investigating the cause, and neither victim has been identified yet.",
  "argos_id": "R4CPNPZ26"
}