{
  "url": "https://www.dailymail.co.uk/news/article-15029455/las-vegas-casino-closing-poker-palace-tourist-slump.html",
  "authorsByline": "Sophie Gable",
  "articleId": "6ccbdc9e4b9b4f58a6bfaab2b02939d8",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/24/14/101502379-0-image-m-15_1756043961591.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-24T15:22:15+01:00",
  "addDate": "2025-08-24T14:24:49.089361+00:00",
  "refreshDate": "2025-08-24T14:24:49.089363+00:00",
  "score": 1.0,
  "title": "Las Vegas casino CLOSING triggering devastating tourist slump",
  "description": "A local staple in North Las Vegas is shuttering its doors permanently in the fall, marking another hit to the city's declining tourism.",
  "content": "A mom-and-pop casino in Las Vegas is set to close in the fall, after Sin City's rip-off prices sent tourism into freefall.\n\nPoker Palace, a casino in North Las Vegas situated on the Las Vegas Boulevard, notified its 126 employees on July 29 that layoffs were set for September 30, with a final closing date of October 1, according to a Worker Adjustment and Retraining Notification.\n\nWARN notices are required by federal law to inform employees of closings and mass layoffs at least 60 days in advance.\n\nThe casino was sold, impacting all of the employees' jobs, but it's unclear what the future holds for the local spot.\n\nNo reason for the closure has been given. Las Vegas saw tourist numbers fall by 11 percent in June compared to the same time last year\n\nSoaring prices and viral complaints about rip-offs have put some prospective visitors off. Canadian tourists - who are particularly important to the local economy - are also shunning Las Vegas and the US after President Trump threatened to turn their country into the 51st state.\n\nAnd while Poker Palace doesn't sit in a tourist hotspot, the citywide slump has seen many locals losing their jobs and falling behind on mortgage repayments, giving them less to spend at the city's off-the-beaten-track spots.\n\nPoker Palace has served the community of North Las Vegas since 1974, when the casino was simply a blackjack table, eight slot machines, and two pool tables.\n\nThe entire casino was the size of a studio apartment at a measly 700 square feet. Poker Palace grew over four decades to a 25,000 square foot casino with over 250 slots, seven table games, eight poker tables, and a bingo room.\n\nPoker Palace prides itself on being the 'Locals' Casino'. They've advertised as a place where residents of Las Vegas can 'Come, relax & experience for yourself the \"neighborly\" hospitality that we have to offer'.\n\nThe casino also has a restaurant called Maddy's Cafe that's open late on the weekends and was branded 'one of North Las Vegas’ favorite restaurants'.\n\nThe closure of a North Las Vegas staple marks a troubling trend for the city as tourism declines.\n\nAccording to the Las Vegas Convention and Visitors Authority, tourism dropped by 11.3 percent in June compared to last summer.\n\nVisitors checking in at local hotels have declined 7.3 percent, and consumer spending in the city is down.\n\nBrian Gordon, a consultant with a Las Vegas-based firm, told the Las Vegas Review-Journal that there's been a 'pullback' in the market.\n\nThe combination of increased tariffs, inflation rates, and high prices has prevented people from traveling to the notorious spending city.\n\nLas Vegas has also shifted its reputation from a gambler's paradise to a luxury enclave with soaring resort costs and expensive prices.\n\nMichael Schoenberger, a professor of hospitality management, echoed this sentiment to Business Insider.\n\n'You're starting to change the mentality of the visitor where they're thinking, \"Well, I could go to Las Vegas, but it's going to be a pain in my neck, or I could go to Cancún\"'.\n\n'It's a cumulative effect that's just now starting to show up'.\n\nAndrew Woods, the director of the University of Las Vegas's Center for Business and Economic Research, told the Las Vegas Review-Journal that the city's reliance on discretionary spending means it often gets hit the hardest before other markets.\n\nWoods told the publication that if the US economy struggles, Sin City often gets the brunt of economic downturn first and recovers last.\n\nThe city continues to rake in cash from gamblers, but other sectors, such as restaurants and retailers, have experienced a slump due to fewer tourists visiting Sin City.\n\nDaily Mail reached out to Poker Palace for comment on the casino's closure.",
  "medium": "Article",
  "links": [
    "https://www.businessinsider.com/las-vegas-tourism-decline-recession-economy-gambling-high-prices-2025-8",
    "https://www.dailymail.co.uk/news/article-14986013/Latest-disturbing-sign-Las-Vegas-dying-amid-soaring-prices-Trump-tourism-boycotts.html",
    "https://www.reviewjournal.com/business/the-whole-town-is-slower-las-vegas-economy-hits-the-brakes-3427769/",
    "https://www.dailymail.co.uk/news/las-vegas/index.html",
    "https://www.dailymail.co.uk/galleries/article-14882447/Las-Vegas-sees-fall-tourists-prices-blame.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Las Vegas casino",
      "weight": 0.12520477
    },
    {
      "name": "Las Vegas",
      "weight": 0.11986678
    },
    {
      "name": "North Las Vegas",
      "weight": 0.11795611
    },
    {
      "name": "Poker Palace",
      "weight": 0.07662737
    },
    {
      "name": "North Las Vegas’ favorite restaurants",
      "weight": 0.072786495
    },
    {
      "name": "a North Las Vegas staple",
      "weight": 0.0709862
    },
    {
      "name": "North Las Vegas’",
      "weight": 0.06961402
    },
    {
      "name": "the Las Vegas Boulevard",
      "weight": 0.06662775
    },
    {
      "name": "Soaring prices",
      "weight": 0.06523694
    },
    {
      "name": "devastating tourist slump",
      "weight": 0.061608505
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.89208984375
    },
    {
      "name": "/Travel & Transportation/Hotels & Accommodations/Other",
      "score": 0.68994140625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.5146484375
    },
    {
      "name": "/Business & Industrial/Hospitality Industry/Other",
      "score": 0.43310546875
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Other",
      "score": 0.380859375
    },
    {
      "name": "/News/Other",
      "score": 0.361083984375
    },
    {
      "name": "/Games/Card Games/Poker & Casino Games",
      "score": 0.3564453125
    },
    {
      "name": "/Games/Gambling/Other",
      "score": 0.3515625
    }
  ],
  "sentiment": {
    "positive": 0.021812078,
    "negative": 0.88933295,
    "neutral": 0.08885492
  },
  "summary": "Poker Palace, a casino in North Las Vegas, is set to close in the fall due to a severe decrease in tourism due to high prices and rising prices in Las Vegas. The casino notified its 126 employees that layoffs were set for September 30 and the final closing date of October 1. The closure marks a troubling trend for the city as tourism declines, with tourist numbers dropping by 11.3 percent in June compared to the same time last year. The citywide slump has resulted in many local locals losing their jobs and falling behind on mortgage repayments, leading to less spending on Las Vegas and the US. The decline in tourism has led to increased tariffs, inflation rates, and high prices, leading people to shun the city.",
  "shortSummary": "Poker Palace in North Las Vegas is closing, impacting 126 jobs, as tourism declines due to high prices and increased consumer spending.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "43d3975f3bbb47e5a59bb8d7b776e42e",
  "places": [
    {
      "osmId": "4567435089",
      "road": "Las Vegas Boulevard North",
      "city": "North Las Vegas",
      "county": "Clark County",
      "state": "Nevada",
      "postcode": "89030",
      "country": "United States",
      "countryCode": "us",
      "amenity": "Poker Palace",
      "coordinates": {
        "lat": 36.2100482,
        "lon": -115.107488
      }
    },
    {
      "osmId": "33957359",
      "road": "South Las Vegas Boulevard",
      "suburb": "Las Vegas Strip",
      "town": "Paradise",
      "county": "Clark County",
      "state": "Nevada",
      "postcode": "89109",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 36.121746,
        "lon": -115.17512621500933
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.businessinsider.com/las-vegas-tourism-decline-recession-economy-gambling-high-prices-2025-8",
      "text": "Despite what you may have seen on the internet lately, Las Vegas is not dead. The casinos are not empty. The streets aren't bare. If I'm being honest here, I wouldn't have minded a little less crowding during my little mid-August gals' jaunt to Sin City in an ill-fated attempt to see Kelly Clarkson, who canceled her residency there this month. But the vibe in Vegas is different. It's a slow summer, and it shows.\nTouristically speaking, this has been an unfun year for Vegas. The Las Vegas Convention and Visitors Authority says visitor volume to the city fell by 11.3% in June compared to the prior year. Convention attendance and hotel occupancy declined, too. The total number of visitors is down 7.3% over the first half of 2025. Gaming revenue is up, a signal that the people who are going are still gambling. But consumer spending, including at restaurants and bars and apparel and jewelry retailers, is down millions of dollars over the last 11 months compared to the prior stretch. Some casinos have laid off workers.\nWhy this is happening doesn't have one straight answer. A lot of factors are in play — the rocky state of the economy, tighter US immigration policies, hangover effects from the California wildfires that have some would-be visitors staying home. The tentpole events that drew in scads of visitors in recent years, such as March Madness and the Super Bowl, aren't around this year for a 2025 boost. There are still Formula 1, the Raiders, and whatever is going on with the Sphere, which is hosting the Backstreet Boys, but those attractions are extra pricey in a moment when many travelers are feeling extra price sensitive.\nLas Vegas has relatively recently developed a reputation for being expensive and for nickel-and-diming people at every opportunity. The costs of plane tickets, hotel rooms, food, drinks, and even parking have skyrocketed. The nature of the city has changed, too. Instead of existing as America's slightly seedy city of vice, Vegas has gotten a sort of glow-up in an attempt to broaden its appeal. The upside: A broader audience might be up for a trip to Vegas than in the past. The downside: Vegas now resembles so many other destinations that it loses out to similarly priced (or even cheaper) competitors, especially if visitors aren't having a bang-up time.\n\"You're starting to change the mentality of the visitor where they're thinking, 'Well, I could go to Las Vegas, but it's going to be a pain in my neck, or I could go to Cancún,'\" says Michael Schoenberger, a professor of hospitality management at the College of Southern Nevada. \"It's a cumulative effect that's just now starting to show up.\"\nWhile the \"what's wrong in Las Vegas\" conversation is peaking right now, things have been shaky for a while, says Amanda Berlarmino, an assistant professor of hospitality at the University of Nevada, Las Vegas. \"To be honest, we've struggled with visitation since the pandemic,\" she says.\nAsian tourism has not recovered, she says, and this year, there's been a decline in other international visitors, including, importantly, Canadian tourism, thanks in part to President Donald Trump's antagonism towards America's neighbors to the north. International visitors tend to do longer stints than domestic visitors, who might just pop down for a weekend, which makes their pullback cut a little deeper.\nWe are a more expensive market now than we've ever been before.\nThe domestic picture isn't especially pretty, either. Worries about the economy may be keeping Americans at home. A disproportionate amount of Las Vegas visitors tend to come from California, but the number of vehicles crossing the California-Nevada border on Interstate 15 declined by 4.3% in June compared to the same month last year. Berlarmino chalks much of it up to the fires that hit Southern California at the start of the year. Schoenberger notes that disruptions from highway construction have been a problem, too.\nSteve Hill, the president and CEO of the LVCVA, says while these issues are not ideal, Las Vegas has seen worse in the recent past. \"It is not the crisis situation like we've seen through Covid or the extended downturn through the Great Recession,\" he says.\nBeyond some of these more acute issues, one major complication that's gradually been growing may finally be reaching an inflection point: pricing. To put it plainly, Las Vegas is hella expensive.\nThe longtime proposition of Las Vegas was that it was relatively cheap to get there and stay there, because once people got there, the amount they spent on gambling at the casinos and resorts more than made up for it. But that's no longer the case. Flights to the city may still be slightly less expensive than some destinations, but they're not that far from trips to New Orleans, Miami, or Washington, DC. The same goes for hotels, though prices can vary widely. The typical clientele has also shifted. While Las Vegas' traditional market was people over 60 who tended to be value-conscious, now more people are coming in their prime earning years and demanding more premium services and experiences. Resort economics have changed, too. Gambling is no longer so important as a revenue driver — it's hotel rooms, food and beverage, and events. Combine all of that with inflation and consumer wallets being squeezed, and you can see why some visitors may shorten trips or just scrap them altogether.\n\"We are a more expensive market now than we've ever been before,\" Berlarmino says.\nMany Las Vegas casinos and hotels started charging for parking in the mid-2010s, and they're piling on resort fees, too. My recent four-night stay at the Cosmopolitan Hotel included $249.44 in resort fees and associated taxes. While there are ways to do Las Vegas that aren't so costly — staying in budget or value hotels away from the Strip, buying food and alcohol at a store, or abstaining from drinking entirely — all the little add-on fees can make people feel like they're being ripped off.\n\"Since starting right before the pandemic and then continuing after the pandemic, we've introduced a lot of pain points to the visitors that historically were not present,\" Schoenberger says. \"Why we charge people to drink what drinks cost in New York City, I have no idea.\"\nHill says that the narrative around the cost of Vegas is \"overblown,\" and says there are \"all kinds of ways\" to achieve a budget-friendly experience. \"We've got 150,000 rooms and they, right this minute, run from $9 probably to $600,\" he says. The slowdown in visitors has led some hotels to cut their prices, he adds.\nWhy we charge people to drink what drinks cost in New York City, I have no idea.\nGambling being more widely available around the US is both a blessing and a curse for Las Vegas, which used to be one of two major places in the states, along with Atlantic City, where you could legally bet. On the one hand, people who have the gambling itch can probably find a place to scratch it within a couple of hours from their homes. On the other hand, the proliferation of gambling may also mean more people get the itch.\nChris Grove, a sports-gambling-industry investor at Acies Investments, tells me the growth of sports betting has been \"nothing but a net positive for Vegas.\" It's given people a taste of betting, and if they like it, it might inspire them to go to the biggest place in America there is to do it.\nGrove compared it to the poker boom of the early 2000s. \"Online poker got really popular, and you ask the question: Did that do anything to dissuade people from coming to Vegas to play poker? And the answer is no,\" Grove says.\nPlus, summer is a slow time for sports gambling. If people were sitting home on their couches on sports betting apps instead of going to Vegas, they'd be doing so during the NFL season and March Madness.\nOther Vegas developments have been a mixed bag. Formula 1, back in Vegas since 2023, is an attraction, but preparing for it has caused transit disruptions, Schoenberger says. In the company's second-quarter earnings call, MGM Resorts CEO Bill Hornbuckle said that Las Vegas remains \"fundamentally solid\" and blamed the company's 9% drop in earnings from its Strip resorts on a \"uniquely disruptive remodel\" at its MGM Grand and slow mid-week bookings at two of its value operations. Caesars said in its second-quarter earnings that it had seen decent gaming results in Las Vegas during the period, even in the face of weaker demand for its hospitality offerings.\n\"The top third-ish of the market is still doing exceptionally well,\" Hill, of the Convention and Visitors Authority, says. It's when you get into the middle third that \"it becomes more acute, the more budget-conscious the visitor needs to be.\"\nIt's tempting to ascribe to Las Vegas' slowdown some greater meaning. Maybe it's just a temporary blip, but what if it's a recession indicator? Or a sign of the times and proof that Las Vegas is over?\nDeclaring that the slow summer is the end of Sin City as we know it would be a bit premature. The same goes for calling it a surefire sign of a recession. But it does seem like Vegas is in a sort of weird limbo, even if it's only temporary. It's a place that feels stuck in time — besides some of the outfits and what's on the TV, you might not know if you're in a casino in 2010 or 2025. After all, DJ Pauly D of \"Jersey Shore\" fame is playing. Where it is getting more modern, like the additions of the Sphere and the NFL's Raiders, it's still figuring out the logistics. It's responding to consumer demand for a higher-end experience, but still faces with consumers who may not be prepared to pay such high-end prices. If a trip to Vegas is going to run you the same as a vacation to New York, San Francisco, Miami, or even Mexico, you might think twice about how much of a premium you actually put on the Sin City experience, especially when the main differentiator is that in Vegas, you're surrounded by tables and machines designed to suck money out of you.\nTo be clear, Las Vegas is lovely. Gambling is fun, as long as it is done responsibly. The shows are great, the hotels are comfy. Its nightlife offers a good amount of (responsible) debauchery, and its daylife is fairly family-friendly. When it's not sweltering hot out, the outdoor stuff is really great, too. Despite the videos, pictures, and memes floating around online, it was far from empty. (Also, anywhere could be painted as bare if you go at the right time of day.)\nThe city might just be in the midst of a slight pivot moment — not that it's changing its identity, but it's finding an identity in a culture and economy that are changing around it.\n\"Las Vegas is still attractive to people,\" Schoenberger says, \"because it's a place where you can go and no matter where you're from in the world, it looks different.\"\nEmily Stewart is a senior correspondent at Business Insider, writing about business and the economy.\nBusiness Insider's Discourse stories provide perspectives on the day's most pressing issues, informed by analysis, reporting, and expertise."
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-14986013/Latest-disturbing-sign-Las-Vegas-dying-amid-soaring-prices-Trump-tourism-boycotts.html",
      "text": "Latest disturbing sign Las Vegas is dying amid soaring prices and Trump tourism boycotts\nLas Vegas has shown yet another worrying sign that it's on the decline as soaring prices and tourist boycotts have driven visitors away.\nTipping in Las Vegas has plunged by as much as 50 percent, according to Fox News.\nWorkers are blaming a sharp drop in visitors, which they say has left them with fewer customers and lower pay.\n'No tax on tips, that's a rad thing,' Charlie Mungo, 36, a tattoo artist in downtown Las Vegas, told the Wall Street Journal of President Trump's new policy.\n'But it doesn't really do us much good if there isn't any people to get tips from.'\nMungo said he now makes about $1,500 a month and has lost nearly a third of his clients after Canadian tourists who used to represent 30 percent of his business stopped coming.\nMany blame the economy, rising costs and even political boycotts of the city.\nSome service workers are pointing fingers at Donald Trump, saying his presidency has led to a drop in international visitors, while others say the real problem is Vegas itself.\nTipping in Las Vegas has plunged by as much as 50 percent. Workers are blaming a sharp drop in visitors, which they say has left them with fewer customers and lower pay\nIn June, there was a reported 11.3 percent drop in visitors compared to June 2024, while international travel to the city has fallen 10 percent\n'We're all starting to freak out,' Mungo said.\nJacob Soto, 22, a supervisor at Pinkbox Doughnuts in downtown Vegas, told the Wall Street Journal that his credit card tips have shrunk from $200 a week to $100–$150.\n'I kinda rely on tips at the end of the day,' he said.\nOn Reddit's r/VegasLocals forum, one cocktail waitress said she used to average about '80 cents a drink.'\n'Now I'm averaging about 10 cents,' the waitress wrote.\nAnother server added: 'We are working triple what we used to and making a quarter of what we did.'\nAccording to the Las Vegas Convention and Visitors Authority, overall visits to Sin City are down more than 6 percent this year.\nLas Vegas welcomed 3.39 million visitors in March, down almost eight percent from 3.68million in February.\nSome service workers are pointing fingers at Donald Trump , saying his presidency has led to a drop in international visitors, while others say the real problem is Vegas itself\nAccording to the Las Vegas Convention and Visitors Authority, overall visits to the city are down more than 6 percent this year\nApril saw just over 3.3 million visitors, a drop of 5.1 percent from last year.\nHotels were 82.9 percent full the same month, compared with 85.3 percent in March 2024.\nMidweek occupancy recorded a decline of 2.5 percent in the same period, despite more than half a million people attending conferences there.\nAnd in June, there was a reported 11.3 percent drop in visitors compared to June 2024, while international travel to the city has fallen 10 percent."
    },
    {
      "url": "https://www.reviewjournal.com/business/the-whole-town-is-slower-las-vegas-economy-hits-the-brakes-3427769/",
      "text": "‘The whole town is slower’: Las Vegas economy hits the brakes\nUpdated August 22, 2025 - 5:31 pm\nWhen Mike Tafoya opened a dessert shop along the Strip, he was banking on strong foot traffic to drive sales.\nHe’s near the Las Vegas Convention Center and gets a boost when conferences are in town. But he normally isn’t too busy on weekdays, and neighboring shops also are grappling with a slowdown.\nOverall, business hasn’t been terrible this year at his store, Lost Sweets, “but it hasn’t been great,” Tafoya said.\nLas Vegas’ tourism-dependent economy is hitting the brakes. Visitor volume and consumer spending are tumbling in America’s casino capital, and the local unemployment rate is hovering among the highest in the country for big metro areas.\n“The whole town is slower,” said Crazy Horse 3 owner Nando Sostilio, whose strip club recently announced a slate of specials to draw more customers.\nSouthern Nevada relies heavily on outsiders traveling here to spend big eating, drinking, gambling, partying and going to shows and conventions to fuel the economy. But amid a series of financial headwinds — and as President Donald Trump’s trade wars spark widespread economic anxiety — fewer people are taking Vegas vacations this year.\nSostilio, for one, said this is the slowest summer in Las Vegas he’s seen in a long time.\n“We’re starting to see some pullback in the Las Vegas market, there’s no doubt about it,” said Brian Gordon, a principal with Las Vegas consulting firm Applied Analysis.\n‘Thinking twice about how they’re spending money’\nGordon said the downshift “feels painful,” but he contends the economy is heading toward more normal levels that were seen before the pandemic.\nGovernment stimulus checks helped fuel consumer spending after the public health crisis shut off much of the economy overnight. That extra cash stopped coming years ago, but after a stretch of high inflation, people still face elevated prices on everyday goods, credit card balances have climbed and consumer confidence has weakened, all while higher tariffs on imports could push up prices yet again.\n“All of those things are hitting all at once and contributing to how people are responding in their daily lives,” Gordon said.\nThis includes pulling back on discretionary spending, such as trips to Las Vegas and other destinations, he added.\nAndrew Woods, director of UNLV’s Center for Business and Economic Research, said that he hasn’t seen any major layoffs lately and that while the economy is slowing, it seems to be holding up.\nBut he noted the region can be a bellwether for consumer habits because of its heavy reliance on discretionary spending.\nThere is also growing frustration over resort fees, parking costs and other expenses that can make Las Vegas a pricey place to visit. Casino operators and others have rolled out price breaks this summer to boost business, but if someone feels less secure in their finances or future job prospects, not taking a trip to Vegas can be an easy way to save cash.\nWoods noted that people are thinking twice about how they’re spending money and where they’re traveling. He also said that Las Vegas’ economy tends to get hit before other markets.\nIf the U.S. economy weakens a lot, Las Vegas will feel it first and recover last, he said.\nTourism jobs\nLas Vegas’ economy, which has a history of booms and busts, is looking bruised.\nThe local unemployment rate in June, 5.8 percent, was third highest among the 50-plus metro areas with at least a million people, federal data shows.\nAround 19.5 million people visited Las Vegas this year through June, down 7.3 percent from the same six-month stretch last year, according to the Las Vegas Convention and Visitors Authority.\nIn June alone, visitor volume tumbled more than 11 percent from June of last year.\nThe leisure and hospitality sector accounts for 27 percent of Las Vegas’ workforce — compared with 11 percent nationally — and employment remains high.\nLocally, more than 308,000 people worked in the industry as of June, well above pre-pandemic levels, federal data shows.\nHowever, the unemployment rate consists of more than just layoffs, according to David Schmidt, chief economist with the Nevada Department of Employment, Training and Rehabilitation.\nNevada has a high share of people who are out of work for other reasons, including people who quit their jobs, or entered the labor pool for the first time and are trying to find a job, or weren’t working for a while and are now looking again, he explained.\nStill, he noted that Las Vegas’ economy overall is “a lot flatter” than it used to be and that when economic uncertainty rises, it’s harder to make any long-term plans.\n“If you are less secure in your finances, you’re probably a little bit more defensive in your mindset,” Schmidt said.\n‘Less money to go around’\nThe Las Vegas area had nearly 2.4 million residents as of last summer and welcomes millions of visitors monthly. However, consumer spending has tumbled amid the tourism slump.\nSuch purchases aren’t down across the board, but the data points to a pullback at restaurants, clothing stores and other shops in Southern Nevada.\nSales at food and beverage outlets; car and auto parts dealers; clothing, shoe and jewelry retailers; and furniture, electronics and appliance stores in Clark County all fell in a recent 11-month period as compared with the prior same stretch, according to the Nevada Department of Taxation.\nSome categories encompass locals and tourists alike. Food service and drinking outlets, for instance, logged nearly $11.7 billion in sales from July 2024 through May 2025, down 1.6 percent from the same period a year earlier.\nThe percentage drop looks small but amounts to a huge pile of money: a decline of almost $191.5 million.\nThere are essentially fewer consumers in the Las Vegas area because of its sliding visitor volume, which itself could lead to cutbacks in local workers’ hours and paychecks, according to Bryan Wachter, president of the Retail Association of Nevada.\nHe also cited ongoing inflationary pressures and noted that when households pay more for essentials, they often pull back on discretionary spending.\nGordon, the consultant, said consumers’ finances are getting squeezed.\n“There’s just less money to go around,” he said.\n‘Trump slump’\nIt’s still too early to gauge the full impact of Trump’s tariffs. But the U.S. economy has been on a roller coaster this year as the president’s ever-shifting trade wars threaten to push up prices for businesses and consumers alike.\nBryon Watkins of Las Vegas, who said he has been driving a taxi for several years, stated that business was great the past few years and that he used to pay many of his bills from tips alone.\nHowever, business fell “almost instantly” after Trump started threatening higher tariffs, he said.\n“Tourism slumped quickly,” Watkins said.\nTed Pappageorge, secretary-treasurer of Las Vegas’ powerful Culinary union, argues that the “Trump slump” has arrived in Southern Nevada.\nTrump has bred plenty of resentment in Canada, for instance, with his rising tariffs and calls for turning America’s northern neighbor into the 51st state.\nCanada has long been a key source of tourists for Las Vegas, but visitation from the country is falling fast.\nCanada’s WestJet, the biggest international carrier to Las Vegas, flew 344,250 passengers in and out of Harry Reid International Airport this year through June — down 21.5 percent from the same stretch in 2024, according to airport data.\nAir Canada, the second-biggest international carrier to Las Vegas, flew 290,461 passengers in and out of Reid International this year through June — down 13 percent from the same period last year.\nInternational visitors comprise a much smaller share of Las Vegas’ tourist base than domestic travelers. But compared with U.S. visitors, they typically stay longer and spend more money here.\nWhen you tell the rest of the world that they’re not welcome, they may go somewhere else, said Pappageorge, whose union includes resort workers on the Strip and downtown.\n“It’s pretty hard to piss off Canadians, but this administration has managed to do that,” he said.\nLas Vegas consultant John Restrepo, founder of RCG Economics, said that as the prospect of higher tariffs hangs over the economy, there have been ups and downs in the stock market and weakness in business and consumer confidence.\nThe final outcome remains to be seen, he noted, “but it’s not heading in a good direction at this point.”\n‘Just have to push through’\nTafoya, the dessert shop owner, serves taiyaki, or warm fish-shaped pastries with fillings, as well as soft serve and other treats.\nHis shop is in a retail plaza on Las Vegas Boulevard at Convention Center Drive, and he figured that with massive properties such as Resorts World Las Vegas and the Convention Center nearby, there would be plenty of customers walking around.\nHe said he opened in the plaza early this year and wanted to hire employees. But so far, he can’t afford to take on staff and works the counter himself.\nThe way things are looking now, he won’t be able to hire anyone soon, he noted. Still, Tafoya said he isn’t disappointed in the location and is hopeful business will pick up in the coming months.\n“We just have to push through,” he said.\nContact Eli Segall at esegall@reviewjournal.com or 702-383-0342."
    },
    {
      "url": "https://www.dailymail.co.uk/galleries/article-14882447/Las-Vegas-sees-fall-tourists-prices-blame.html",
      "text": "Las Vegas sees fall in tourists - prices could be to blame\nLas Vegas's high prices could be putting off potential tourists, according to new visitor figures. Tourist numbers have fallen every month this year with 6.5 percent fewer visitors than in 2024, according to the Las Vegas Convention and Visitors Authority.\nInternational arrivals at Harry Reid Airport were 8.7 percent lower in May than the same month in 2024. It is thought that Sin City's soaring prices could be to blame for its falling visitor numbers.\nA visitor recently shared her shock after she was charged $26/£19.11 for a bottle of Fiji water from the minibar in her room at the Aria Resort & Casino. And a British magician was also left outraged after he was billed $74.31/£54.63 for two drinks at Sphere in Las Vegas.\nAnthony Curtis, publisher of the Las Vegas Advisor website, told The Times : 'On the Strip, people get taken for a ride. 'Once they get here they're like, \"I've had enough of this crap, I'm tired of being treated like this. I'm tired of having to pay these ridiculous prices\".'\nThe Vegas expert explained that many casinos have 'turned their back on the middle market' in order to focus on more affluent tourists. A 2024 study found that the average income of Las Vegas holidaymakers is now $93,000/£68,365, with many budget travelers priced out of the gambling capital.\nIn a Reddit post, a person who recently visited Vegas describes the city as 'amazing' but 'absurdly priced'. The user writes: 'Walking around the different themed casinos was like a fever dream. Sadly I felt like a spectator instead of a participant. I have honestly never been to a place that was more absurdly priced.'\nThey claim they had to spend $30/£22 on a glass of house wine and were charged $50/£36 for two bottles of water from the minibar. On another Reddit thread, a user says Las Vegas is 'extortionately expensive'. They wrote: 'I live in a very high cost of living area.\n'Vegas is extortionately expensive. Shows. Restaurants. Everything is far more expensive in Vegas than here.' Meanwhile, another commenter says: 'I used to love going Vegas, but the last few times I had sticker shock on everything.\n'It doesn't feel like a relaxing, exciting vacation when you're price gouged up to your ears and come home feeling robbed.' However, another traveller claims it is still possible to enjoy Vegas on a budget. They said: 'People come to Vegas expecting champagne on a beer budget.\n'You can have an amazing time in Vegas on any budget, but if your budget is on the lower end, then you may have to forego some experiences and types of restaurants.' And another user writes: 'Yes Vegas is expensive, but it's a high end destination in a tourist area and you're getting some of the best food and service in the world.'"
    },
    {
      "url": "https://www.dailymail.co.uk/news/las-vegas/index.html",
      "text": "Advertisement\nRELATED TOPICS FOR Las Vegas\nLas Vegas: News and Updates on Nevada's resort city from Mail Online.\nPage\nInside Kristin Cavallari's wild Las Vegas weekend\n24/08/25 23:47\nKristin Cavallari made her 'millennial dreams' come true during a wild weekend in Las Vegas where she hung out with the Backstreet Boys. The 38-year-old reality star splurged on the Grammy-nominated boyband's $1,103 meet-and-greet experience during which Brian Littrell kindly agreed to carry her for the backstage photo opp....read\nSelena Gomez stuns in black swimsuit on yacht for bachelorette party in Cabo... but was BFF Taylor Swift there?\n24/08/25 23:45Selena Gomez was pictured letting loose in Cabo San Lucas, Mexico, on Sunday, during what was rumored to be her bachelorette party.Las Vegas church outrages neighbors as congregation parks SIX HUNDRED cars on lawns and driveways\n24/08/25 22:29Las Vegas residents have been left outraged as congregants at an Ethiopian orthodox church continue to illegally park their vehicles on lawns and driveways.Backstreet Boys' estimated earnings from Vegas residency\n24/08/25 18:00The Backstreet Boys are raking in an astonishing amount of money from their Las Vegas residency at the Sphere, according to an expert who spoke exclusively with the Daily Mail.Las Vegas casino announces it is closing\n24/08/25 16:21A local staple in North Las Vegas is shuttering its doors permanently in the fall, marking another hit to the city's declining tourism.Classic Las Vegas casino announces it is CLOSING, as Sin City's rip-off prices trigger devastating tourist slump\n24/08/25 14:22A local staple in North Las Vegas is shuttering its doors permanently in the fall, marking another hit to the city's declining tourism.Leona Lewis reveals how motherhood has changed her as she gears up for first-ever Las Vegas residency\n23/08/25 15:10She welcomed her daughter, Carmel Allegra, with husband Dennis Jauch in July 2022.Celebrity chef who starred on Rachael Ray Show and Shark Tank claims Wells Fargo accused him of fraud because he's black\n23/08/25 05:43The lawsuit accuses the defendants of racial discrimination, defamation, negligence, and intentional infliction of emotional distress.Tourist hotspots at center of foreclosure boom as locals struggle to survive\n23/08/25 02:46Americans are increasingly losing their homes after failing to keep up with mortgage payments.Shocking prison transformation of heavily-tattooed woman who killed carpet cleaner in random act of violence\n22/08/25 22:06Kayla Alery, 28, was sentenced to a minimum of 16 years behind bars for murdering Raul Cardoza, 41, at an apartment complex.The staggering amount of money the Backstreet Boys are raking in from their Las Vegas residency, according to an expert\n22/08/25 20:58The Backstreet Boys are raking in an astonishing amount of money from their Las Vegas residency at the Sphere, according to an expert who spoke exclusively with the Daily Mail.Teen Mom's Jenelle Evans and son Jace, 16, are living thousands of miles apart amid bitter family feud\n21/08/25 23:25Jace is residing in the family's home state of North Carolina following a conflict with his mother Jenelle, 33, who resides in Las Vegas, Nevada.Taylor Swift stuns in a racy rhinestone bikini for vinyl release of Baby, That's Show Business\n21/08/25 18:29'The Life of a Showgirl: Baby, That's Show Business Vinyl Collection is available now on my site for 48 hours, while supplies last ❤️,' wrote the performer.Father of NBA superstar Jaylen Brown arrested for attempted murder after 'stabbing man in Vegas parking dispute'\n21/08/25 15:50According to the Las Vegas Metropolitan Police Department, Brown, 57, was taken into custody after allegedly stabbing a man during a verbal dispute that escalated in a public park.Find out if Kelly Clarkson's talk show will be delayed... after the shock death of her ex Brandon Blackstock\n20/08/25 15:43Kelly postponed her Las Vegas residency in order to spend more time with their children, River, 11, and Remington, nine, right before his death.'Nervous' The Repair Shop guest gasps 'I don't know what to say' as prized item dubbed 'part of the family' is totally transformed\n20/08/25 10:52Husband and wife David and Carol, from Wales, brought along a huge soft toy hound dog to be restored in Tuesday's episode of the show.MTG slams Trump admin for allowing Israel official to leave country after Las Vegas arrest for child sex sting\n20/08/25 01:14Greene slammed the State Department in a lengthy post to X that also called on the US to bring in children from Gaza who need life-saving medical treatment.Mother grins from ear-to-ear as son, 15, who killed dad for taking away his phone is SPARED prison\n19/08/25 18:33A teenager will serve no prison time after he shot and killed his father after the 15-year-old's phone was taken away as punishment.Star boxer Nikita Tszyu reveals the troubling reason he quit his old life as a white-collar worker\n19/08/25 15:19Nikita Tszyu has revealed that a 'spiritual experience' saw him decide to quit his old job as an architect.Las Vegas is in freefall, expert warns\n19/08/25 13:28The Nevada city, known for its lavish shows and around-the-clock gambling, has recorded a large drop in tourism and spending in recent months.Las Vegas really IS in freefall, expert warns, as outraged visitor shares entitled tip demand amid rip-off anger\n19/08/25 12:47The Nevada city, known for its lavish shows and around-the-clock gambling, has recorded a large drop in tourism and spending in recent months.Justin Bieber impersonator tricks his way into a Vegas nightclub and performs for stunned crowd\n19/08/25 05:25The situation involving the doppelgänger of the two-time Grammy-winner, 31, unfolded in Sin City over the weekend, Wynn officials said.Pandemic hangover and 'corporate greed' blamed for Vegas tourism collapse\n17/08/25 13:33A Sin City regular has blamed a pandemic hangover and 'corporate greed' for the tourism collapse in Las Vegas.$80 bill for six beers lays bare rip-off Vegas prices as Sin City battles to restore tanking tourism sector\n17/08/25 10:35A six-pack of beers for nearly $80 has shed a shameful light on the tanking tourism industry in Las Vegas.Anger after Howard Stern's crude 'Buttaface Competition' footage resurfaces\n17/08/25 10:24Anger after Howard Stern's crude 'Buttaface Competition' footage resurfacesI used to go to Vegas four times a year like clockwork - there are two reasons why the city is dying\n17/08/25 04:19One frequent Las Vegas visitor has revealed two reasons why they believe visitors are boycotting Sin City.Son of £2million bigamist accountant whose two Vegas brides are fighting over his fortune brands wife number 3 a 'gold digger' - only interested in his cash\n16/08/25 13:27Millionaire divorcee property developer James Dinsdale, 55, took two different women to a celebrity chapel in Las Vegas in five years for instant weddings but never divorced the first.Excruciating Las Vegas drinks prices go viral as tourism tanks in city amid rip-off fury and Trump travel boycotts\n15/08/25 20:42Stunned Las Vegas partiers went viral after sharing the extortionate drinks prices vendors are charging in Sin City amid its tanking tourism industry.Tarek El Moussa gets battery charge from Las Vegas scuffle dismissed - after fulfilling certain conditions\n15/08/25 18:45El Moussa was able to show proof that he completed the diversion program requirements, and a judge dismissed his case on Aug. 5WNBA fans go into meltdown over Caitlin Clark's NBA2K video game rating\n15/08/25 18:37Caitlin Clark remains injured for the Indiana Fever, but that isn't stopping WNBA fans from making her the center of the league's latest controversy.Jessica Simpson shares sexy bikini flashback video while announcing Las Vegas concert\n15/08/25 18:07The 45-year-old singer will be performing in Las Vegas for one night only later this year. The Texas native will perform at PH Live at Planet Hollywood Resort & Casino on Saturday, November 8.Anger after Howard Stern's crude 'ugliest girl' competition resurfaces\n15/08/25 17:45Stern hosted the infamous 'Buttaface Contest' in Las Vegas for many years in the early 2000s, with users slamming the host as 'derogatory' and 'heartless'.'Godfather of AI' reveals how humanity can survive superintelligent AI\n15/08/25 13:40Professor Geoffrey Hinton, a Nobel Prize-winning researcher dubbed the 'Godfather of AI', says there is a 10 to 20 per cent chance that AI wipes out humanity.The 'godfather of AI' reveals the only way humanity can survive superintelligent AI\n15/08/25 11:27Professor Geoffrey Hinton, a Nobel Prize-winning researcher dubbed the 'Godfather of AI', says there is a 10 to 20 per cent chance that AI wipes out humanity.Bodybuilder dies at 37\n14/08/25 19:26Champion bodybuilder Hayley McNeff has passed away at the age of 37, becoming the sixth bodybuilder to pass away within the past six months.Shame of four Las Vegas men who've just found their names added to city's notorious 'Black Book'\n14/08/25 18:13Mark Branco. James Russell Cooper, Anthony Granito and Jeffrey Martin are now on Sin City's ultimate list of shame.Neglectful French bulldog owner let pet die in agony after leaving animal outdoors in Las Vegas heat for 20 hours, police say\n14/08/25 18:11Olivia Viola Underwood, 31, of North Las Vegas, was arrested on May 31 after her dog Jazzy died from a heat stroke.Courtney Stodden shows off her very slender 109lb figure in a string bikini after radical diet change\n14/08/25 15:27The pinup also shared a note this week about her traumatic past as a teen bride. 'Everything I thought would ruin me ended up making me stronger,' began the wife of movie producer Jared Safier.Report: Las Vegas foreclosures surge by 32%\n14/08/25 14:42Increasing numbers of Las Vegas homeowners have started the foreclosure process as Sin City suffers from a decrease in tourism.Foreclosures rocket by 32% in Las Vegas after rip-off prices and Trump boycotts triggered slump in tourist city\n14/08/25 14:24Increasing numbers of Las Vegas homeowners have started the foreclosure process as Sin City suffers from a decrease in tourism.How lost tourism is changing a beloved US destination\n14/08/25 12:31Known for its bright lights, casinos and wild parties, the city has been a popular place to visit for years. But recently the once-popular place has seen a decline in tourists flocking to its colourful streets.The beloved US city that lost its magic - as bookings plummet and tourism drops\n14/08/25 08:54Known for its bright lights, casinos and wild parties, the city has been a popular place to visit for years. But recently the once-popular place has seen a decline in tourists flocking to its colourful streets.NRL boss Peter V'landys says his code is smashing the AFL - but a damning new revelation proves he is actually WAY off the mark\n14/08/25 00:49Australian Rugby League Commission chairman Peter V'landys has been trumpeting the NRL's success in recent years after stealing a march on the AFL with its games in Las Vegas.Bindi Irwin shares painful health update - after she was rushed to hospital for emergency surgery: 'It's time to have open discussions'\n14/08/25 00:35Bindi Irwin has given followers a painful-but hopeful-health update, just months after she was rushed to hospital for emergency surgery.School let vicious gang of bullies beat disabled student, 17, to death, stricken dad's lawsuit claims\n13/08/25 21:33The father of Las Vegas teen Jonathan Lewis, 17, who was beaten to death by a gang of bullies in November 2023, has launched a lawsuit accusing his son's school district of negligence.New blow Vegas as report warns airline passenger numbers set to slump\n13/08/25 21:02Capacity rates at Sin City's Harry Reid International Airport have been forecast to continue plummeting in the second half of 2025 after suffering a severe drop in tourism throughout the year.New hammer blow for ailing Las Vegas as report warns airline passenger numbers set to slump\n13/08/25 19:59Capacity rates at Sin City's Harry Reid International Airport have been forecast to continue plummeting in the second half of 2025 after suffering a severe drop in tourism throughout the year.Machine Gun Kelly theorizes he has ALIEN lineage after mother revealed she may have been abducted by UFO\n13/08/25 16:56The rapper, 35, revealed his mother suspects she may have been abducted by a UFO - which may explain for some unusual traits he has noticed about himself.Bella Hadid goes braless under a semi-sheer cropped shawl as she launches latest perfume\n13/08/25 07:49Bella was in high spirits as she showed off the new gem from her collection, which she described as a 'woody, sweet, fruity skin parfum.'Imogen Anthony doesn't look like this anymore! Kyle Sandilands' ex unveils bold new look\n13/08/25 00:33Imogen Anthony has debuted a bold new look on social media.Historic Las Vegas casino removing live table dealer games\n12/08/25 14:04Although electronic table games have been in casinos around the globe for decades, the oldest casino in Las Vegas will be the first in downtown to completely eliminate human dealers.Las Vegas casino dumps human dealers for computers as soaring prices and Trump boycotts decimate tourism industry\n12/08/25 13:09Although electronic table games have been in casinos around the globe for decades, the oldest casino in Las Vegas will be the first in downtown to completely eliminate human dealers.Lily Allen confirms she's moving out of her New York townhouse following split from David Harbour as she reveals decorating her new London flat has 'helped me' amid her 'hard time'\n12/08/25 12:18Lily Allen has confirmed she's moving out of her New York townhouse following her split from husband David Harbour .Aussie is refused flight into the US over huge error - and he claims it wasn't his fault: 'It ruined my holiday'\n12/08/25 06:49Aaron Drooger said he was left thousands of dollars out of pocket as a result.Kelly Clarkson gets emotional 12 days before ex-husband's death\n11/08/25 18:19A fan's recording of Kelly Clarkson tearing up on stage less than two weeks before her ex-husband Brandon Blackstock's August 8 death has gone viral on TikTok.Kelly Clarkson's ex-husband's cause of death confirmed\n11/08/25 17:35Blackstock, a talent manager and the former stepson of country superstar Reba McEntire, died on Thursday, August 7.Kelly Clarkson's ex-husband Brandon Blackstock's cause of death confirmed after passing aged 48\n11/08/25 17:00Blackstock, a talent manager and the former stepson of country superstar Reba McEntire, died on Thursday, August 7.Kelly Clarkson holds back tears singing poignant song just weeks before ex-husband's death\n11/08/25 16:22A fan's recording of Kelly Clarkson tearing up on stage less than two weeks before her ex-husband Brandon Blackstock's August 8 death has gone viral on TikTok.Machine Gun Kelly offers dramatic three-word response to THOSE Sydney Sweeney dating rumors\n11/08/25 13:10The rapper, 35, was asked about the speculation during an appearance on Watch What Happens Live - and it was clear he didn't want to discuss the Anyone But You star.Josh Duhamel makes rare comment on son, 11, with Fergie as he reveals the pre-teen's camp crush\n10/08/25 17:04Josh Duhamel is preparing to be the dad of a pre-teen. The Ransom Canyon star, 52, made a rare comment about his son Axl, after the boy's trip to summer camp.Sick allegations revealed as Las Vegas Super Moms' Facebook group creator accused of child abuse\n10/08/25 04:05The creator of a Las Vegas 'Super Moms' Facebook group has been accused of disturbing allegations.Latest sign Las Vegas is dying\n10/08/25 00:03Las Vegas has shown yet another disturbing sign it's on the decline as soaring prices and Trump tourism boycotts have driven visitors away and slashed servers' tips on the Strip.Latest disturbing sign Las Vegas is dying amid soaring prices and Trump tourism boycotts\n09/08/25 20:37Las Vegas has shown yet another disturbing sign it's on the decline as soaring prices and Trump tourism boycotts have driven visitors away and slashed servers' tips on the Strip.Grief-stricken Kelly Clarkson shifts career focus after ex Brandon Blackstock's shock cancer death\n09/08/25 18:53Kelly Clarkson is putting her children first after the death of their father and her ex-husband Brandon Blackstock.Reba McEntire's son shares heartbreaking post in wake of half-brother Brandon Blackstock's death\n09/08/25 04:18The former talent manager died following a three-year cancer battle with melanoma - and is the ex-husband of singer Kelly Clarkson.Kelly Clarkson's talk show future is revealed amid her ex-husband Brandon Blackstock's tragic death\n09/08/25 00:58Blackstock died on Thursday at age 48 after a three-and-a-half-year battle with the skin cancer melanoma.Kelly Clarkson's ex husband seen weeks before death\n08/08/25 17:48Kelly Clarkson's ex-husband Brandon Blackstock posed with his daughter for a poignant family snap just weeks before his death from cancer aged 48.Kelly Clarkson's ex Brandon Blackstock seen WEEKS before death with daughter Savannah in heartbreaking photo\n08/08/25 16:08Kelly Clarkson's ex-husband Brandon Blackstock posed with his daughter for a poignant family snap just weeks before his death from cancer aged 48.Kelly Clarkson's NBC shows could be affected by her ex-husband's death\n08/08/25 14:35The unexpected news that Kelly Clarkson's ex-husband Brandon Blackstock has died following a private battle with cancer could have a major impact on her shows for NBC.How Kelly Clarkson's TV shows could be impacted after her ex's shock death\n08/08/25 13:09The unexpected news that Kelly Clarkson's ex-husband Brandon Blackstock has died following a private battle with cancer could have a major impact on her shows for NBC.Tom Brady's prized Las Vegas Raiders rookie Ashton Jeanty endures horrific NFL debut\n08/08/25 12:52The Las Vegas Raiders selected Ashton Jeanty with the No. 6 overall pick out of Boise State in April's draft. However, the running back's NFL career got off to a disappointing start on Thursday night.The man who discovered Elvis... and then destroyed him: How the King spiralled into addiction and death at the hands of his high-rolling manager - revealed in bombshell biography by a writer who saw it happen\n08/08/25 00:31Addiction was the glue that held Elvis Presley and his manager 'Colonel' Tom Parker together during the last few years of the singer's life.Kelly Clarkson's ex-husband dies aged 48\n07/08/25 18:36Kelly Clarkson's ex-husband Brandon Blackstock has died aged 48.Kelly Clarkson fans all saying the same thing as her ex-husband's illness forces Vegas residency cancellation\n07/08/25 17:34The singer, 43, shocked the world on on Wednesday when she announced the postponement of her remaining Las Vegas residency concerts.Self-made entrepreneur reveals how he went from flat-broke to $700K a year after family 'lost everything'\n07/08/25 13:08A Las Vegas man has revealed how he turned his life around, going from broke and homeless to pulling in $700,000 a year as a self-made software entrepreneur.Two wives battle it out over dead British accountant's £1.8m fortune after he married them BOTH in Las Vegas wedding chapels five years apart without getting divorced\n07/08/25 08:36Wealthy James Dinsdale died of cancer, aged 55, in October 2020, leaving his vast estate to be fought over by his two spouses, who he married in separate Vegas weddings.Kelly Clarkson reveals heartbreaking news on ex-husband Brandon Blackstock as she CANCELS Las Vegas residency\n07/08/25 02:14Kelly Clarkson threw her fans for a loop on Wednesday when she announced the postponement of her remaining Las Vegas residency concerts in August.How I went from broke and homeless to making $700K\n06/08/25 19:46Michael Brandon Pope, 26, from Las Vegas, Nevada, spent years wondering where they'd sleep that night or if they'd have enough money to eat. But now, he lives a life of luxury.How I went from broke and homeless to making $700k a year without a degree\n06/08/25 17:41Michael Brandon Pope, 26, from Las Vegas, spent years wondering where his family would sleep that night or if they'd have enough money to eat. But now he lives a life of luxury.Courtney Stodden says her 'body, mind, spirit' are better after quitting alcohol as she reveals her exact weight\n06/08/25 14:10'I am healing from past trauma,' added the blonde beauty who is married to movie producer Jared Safier. 'It's my sober journey for my overall health. I used alcohol to deal with pain.'\nPage\nDON'T MISS\n-\nRio Ferdinand, 46, and wife Kate, 33, reveal they have moved to Dubai with their family as they show off their lavish mansion\n-\nCruz Beckham shares an intimate moment with Jackie Apostel after joining shirtless dad David aboard their lavish yacht\n-\nEmma Watson potters around in a sheer lace dress as she joins her hunky personal trainer for a hike in Saint Tropez\n-\nEXCLUSIVE\nI was desperate to know what this model got up to with England star. Now I've discovered truth, reveals KATIE HIND\n-\nSting is being sued for 'MILLIONS of pounds in lost royalties' by former bandmates in The Police\n-\nBeaches, history, waterparks, golf... Turkey (Türkiye) has it all: Here's why you'll never want to leave\nAd Feature\n- Selena Gomez stuns in black swimsuit on yacht for bachelorette party in Cabo... but was BFF Taylor Swift there? Looking good\n-\nWas this earliest sign of cracks forming between Meghan and Kate? Expert reveals signs that 'Fab Four' weren't getting on\n-\nEXCLUSIVE\nThe dark truth of Club Chalamet: She's a 58-year-old Timothée obsessive who HATES Kylie Jenner\n-\nCould an app really make you better with money? Putting a smart money app to the test\nAd Feature\n-\nBrooklyn Beckham and Nicola Peltz give fans a glimpse of their 'perfect Sunday' as couple unwind after family 'snub'\n-\nMeghan Markle 'placed status above reality' and struggled to separate her own image from Suits character, claims royal author\n- Zoe Kravitz seen arm-in-arm on romantic stroll in Rome with Harry Styles after getting cozy with Austin Butler See the pic\n- I Dream of Jeannie star Barbara Eden turns 94 and looks more glamorous than ever... see her now All change\n-\nGet your autumn on! From pumpkin throws to cosy hot chocolate mugs, here's our pick of homeware for the new season\nAd Feature\n-\nFrom Princess Margaret's sadistic streak to Meghan 'berating a gardener' - the most ill-mannered royals revealed\n-\nKaty Perry makes a braless fashion statement in curve-clinging dress... after Justin Trudeau romance rumors\n-\nWhy Millie Bobby Brown, 21, decided to shun Hollywood in favour of farm life in a nod to her British roots as she adopts a baby\n-\nBritney Spears reveals Sam Asghari 'felt like a fake distraction' to cope with being 'cut off' from sons\n-\nFrom auctions to EVs: 5 brilliant motoring brands every driver should know - from finance fixes to stunning electric SUVs\nAd Feature\n-\nBobby Brazier's love for Hare Krishna: From finding happiness through religion after tragic start - as soap star 'quits showbiz'\n-\nMum's the word! George, Charlotte and Louis join William and newly blonde Kate for church service in Balmoral\n-\nMillie Bobby Brown, 21, and Jake Bongiovi, 23, bond with baby daughter in NYC... days after announcing adoption\n-\nEmily Ratajkowski showcases her curves in leather dominatrix inspired lingerie\n-\nWhy Scottish Mortgage is backing the future of banking for long-term profits\nSponsored\n-\nStrictly Come Dancing bosses deliver verdict on future of BBC show after a male star was arrested on suspicion of rape\n-\nSuperman actor Dean Cain, 59, brutally mocked for struggling through training course after signing up with ICE\n-\nHidden detail in Kelly Clarkson's outfit which symbolizes 'healing and hope' after ex Brandon Blackstock's death\n-\nLily Collins' VERY famous father-in-law reveals he isn't a fan of her show Emily in Paris - but do YOU know who he is?\n-\nEastEnders star Cheryl Fergison reveals the devastating moment she found her husband in a 'dingy love nest' with another woman\n- Vogue Williams gives fans a glimpse at her early 40th birthday celebrations with family and friends Milestone celebration\n-\nPaul Merton reveals it 'felt natural' falling in love with third wife Suki Webster six months after becoming a widower\n-\nSir Elton John, Sir Rod Stewart and Jessie J join an array of music legends for tribute to 'funny and rude friend Steve Wright'\n-\nEXCLUSIVE\nIs 'Saint' Peter Andre REALLY an angel? Katie Price's ex mocked disabled son Harvey and told Junior not to kiss boys\n- Try Amazon Music Unlimited FREE for 30 days! Enjoy millions of songs, audiobooks and podcasts SHOPPING\n-\nPassenger princesses! Kate and Charlotte beam as Prince William drives family to church service in Balmoral\n- Bikini-clad Naomi Campbell, 55, shows off her age-defying physique as she enjoys a lavish trip to Ibiza She's still got it\n-\nVictoria and David Beckham look more smitten than ever after 26 years of marriage as they enjoy lunch with their children in Nerano\n-\nLove Island's Kaz Crossley and TOWIE's Elma Pazar among reality stars 'involved in horror crash'\n- Upgrade your home office with up to 50% off ergonomic desk chairs and standing desks (and we have an EXCLUSIVE extra code) SHOPPING\n-\nMyleene Klass shows off her harp playing skills as accomplished musician performs at 'dear friend' Clare Patterson's wedding\n-\nJackie Woodburne doesn't look like this anymore! Neighbours star is unrecognisable as she ditches the brunette crop she's had for decades and reveals grey hair\n- Queen's 20-year-old supercharged Range Rover sells for over ten times its typical market value at auction Pricey\n- Linda Robson reveals the real reason for major Loose Women changes amid fears for the show's future Speaking out\n- Shoppers flocking to Tesco after price slash on 'DELICIOUS' award-winning £20 Irish cream liqueur that's giving Baileys a run for its money SHOPPING\n-\nTyson Fury's daughter Venezuela, 15, goes Instagram official with 'mystery boyfriend' - and his profession runs in the family\n-\nThe Walking Dead star's son makes disturbing threat after being charged with assault\n-\nSuki Waterhouse treats fans to a raunchy performance as she takes to the stage in black fishnet tights and microscopic shorts\n- Jameela Jamil raises alarm over Serena Williams' weight loss drug promotion British star has blasted Williams\n- Why pay full price? This hack lets small businesses lease top tech for as little as £2.16 per MONTH - and no, there's no catch! SHOPPING\n-\nBritney Spears poses nude in new photo after sparking fan concerns over disheveled living conditions\n-\nLeigh-Anne Pinnock flashes her abs in a skimpy red bra as she she continues her tour of UK festivals with solo gig at Reading\n- TV host Jenni reveals secret to bikini body...no chips or crisps for 34 years! Still looking toned and trim\n- Tulisa wears a strapless lime bustier as she she returns to the spotlight at Manchester Pride Looking good\n- Shiseido launches upgraded viral skincare - get 20% off plus a free gift with our exclusive code SHOPPING:\n-\nDating Naked line-up REVEALED: Controversial Married At First Sight star joins new series of Rylan Clark's show\n-\nFeuding royal rivals William and Harry go to war. Sound familiar? CHRISTOPHER STEVENS reviews King & Conqueror\n- Zendaya says she loved getting to do 'normal' things during her time with fiancé Tom Holland in Scotland Close couple\n-\nEXCLUSIVE\nLuisa Zissman shares bikini snaps amid skinny-shaming row - after sparking debate for smashing kids' iPads\n- Is YOUR mattress causing you sleepless nights? Don't miss out on the best Emma Sleep deals with up to 25% off - prices start at £50 SHOPPING\n-\nJeering Dragons' Den panel called my business a 'delusional disaster' - now I'm worth £40million!\n- Pop star under fire as fans call out penis-shaped stage design on opening night of tour It got off to a very memorable start\n-\nPregnant Sophie Habboo accidentally posts full frontal picture of husband Jamie Laing to fans as they enjoy Bank Holiday weekend\n- Inside Kristin Cavallari's wild Las Vegas weekend The 38-year-old reality star splurged the cash during her lavish trip\n-\nJenni Falconer, 49, displays her flawless physique in a skimpy leopard-print bikini as she soaks up the sun during summer break\n-\nSelena Gomez's fiancé Benny Blanco is SLAMMED for purchasing $200 blueberries: 'I can't afford regular fruit'\n- Julianne Moore admits her wedding dress was a HUGE mistake after skipping tradition to wear white Big regret\n- Kylie Jenner gives rare update on beloved dog Norman that she got at age 17 She's had the pet since she was a teenager\n-\nAll the celebrities who have REVERSED their cosmetic surgery from Chloe Ferry to Molly-Mae Hague and even Victoria Beckham\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n- A-list celebrities rush to check on Kyle Sandilands following reports 'he was off-air due to stroke' Worrying\n-\nTaylor Swift's true feelings REVEALED over Kansas City Chiefs docuseries that explores Travis Kelce romance\n-\nMark Wright and Michelle Keegan put on a loved up display as they enjoy romantic date night at Coldplay's Wembley gig\n-\nEXCLUSIVE\nFormer Baywatch star Nancy Valen ditches Hollywood glamour in rare sighting - see her now\n-\nClaudia Schiffer shows support for her husband Matthew Vaughn's team by posing in a Brentford shirt\n- Gloria Estefan may sue Diddy accuser who name dropped her and husband Emilio The court officially dismissed all allegations\n-\nThe downfall of Marco Pierre White Jr: Son of Michelin star chef has shirked his upbringing to have multiple brushes with law\n-\nJosie Gibson admits she's 'stepped back' from TV work and reveals plans to live 'off-grid as humanly possible'\n-\nEXCLUSIVE\nWilliam Shatner, 94, and his ex-wife spark REMARRIAGE rumors as she steps out wearing huge diamond ring\n-\nBraless Myleene Klass heads to work in a bandeau top and mini skirt after Frankie Bridge broke her silence on their 'feud'\n-\nLady Gaga breaks down during concert after revealing what fiance said moments before she took the stage\n-\nCelebrities who have dated people who look JUST like their siblings with eerie similarities - but do you agree with the comparisons?\n-\nScarlett Thomas' staggering payday as her father Ryan insists she hasn't had a free ride - after nepo baby, 16, skipped GCSEs\n-\nCall me sweet and I'll tell you to f*** off: Dame Helen Mirren, 80, issues a very blunt response to 'condescending' comments about age\n-\nX Factor star who faced off with Simon Cowell looks unrecognisable after reinventing himself as a 'spiritual healer'\n-\n'Irresponsible' Sam Faiers and Billie Shepherd shock fans with their 'dangerous' holistic healthcare advice\n-\nMike Tindall reveals his 'sliding doors' moment when he first met Zara Tindall in 2003\n-\nDuncan James SPLITS from boyfriend after six years together as Blue singer shares post about 'growth' to fans amid heartache\n-\nAlec Baldwin shares sensual moment with wife Hilaria as couple reenact Dirty Dancing in what appears to be a desperate audition for DWTS\n-\nSerena Williams buries feud with Maria Sharapova with shock appearance as Russian enters tennis Hall of Fame\n-\nThe Hollywood stars you had no idea appeared on reality TV shows before they were famous\n-\nEXCLUSIVE\nThought the Biggest Loser was harsh? TV's self-declared 'lard police' Steve Miller insists he has 'no regrets' about his controversial Fat Families show\n-\nConor McGregor poses with 'yacht neighbour' David Beckham and sons Romeo and Cruz as UFC star hails football legend's 'dynasty'\n-\nColdplay's Chris Martin makes a cheeky swipe about the kiss-cam scandal before helping with a proposal and sharing sweet moment with autistic fan\n-\nFreddie Starr died 'penniless and estranged from his six children' as stranger stepped in to bring his body home from Spain and foot funeral bill\n-\nNelly Furtado, 46, delights fans with Noughties nostalgia as she storms the stage in a racy cut out top and mini skirt at the Big Feastival\n-\nSaturday Night Live boss Lorne Michaels says there will be a bloodbath of cast members within weeks\n-\nStacey Solomon and Joe Swash having another baby 'not off the table' following loved up display on luxurious family holiday\n-\nBobby Brazier, 22, 'is quitting showbiz and moving to India to pursue the Hare Krishna religion'\n-\nThis is just a saga now: Games critic Peter Hoskin checks out Echoes Of The End, an ambitious new video game from Iceland\n-\nThe exact treatments behind Karren Brady's transformation: The Apprentice star receives 'state-of-the-art technology for fat removal', says her very own cosmetic surgeon\n-\nLuisa Zissman reveals she smashed up her childrens' iPads in front of them because they 'p****d her off' - as controversial post sparks huge debate\n-\nNeighbours star Ian Smith shares major health update after being diagnosed with terminal lung cancer\n-\nOscar-winning actor looks unrecognisable in 90s comedy that has since become a cult classic - can YOU spot who he is?\n-\nRyan Thomas' nepo baby actress daughter Scarlett, 16, reveals she didn't sit her GCSEs\n-\nAlison Hammond, 50, is happier than ever with boyfriend David Putman, 28, and 'can't imagine her life without him as friends predict engagement'\n-\nEXCLUSIVE\nWas Hulk Hogan MURDERED? Estranged daughter Brooke has NEW information amid police investigation into death... here's all the evidence\n-\nEXCLUSIVE\nVile plot against Kylie Jenner with two-word code name... orchestrated by Timothee Chalamet's die-hard fans who say it's punishment for doing the unthinkable\n-\nUniversity Challenge's most memorable players: From irritating habits to disastrous blunders and wise cracks, the BBC boffins who stole the show\n-\nJacqueline Jossa and hubby Dan Osborne enjoy family holiday - months after a make-or-break getaway saved their marriage following brief split\n-\nMaya Jama 'considers moving to Manchester to be closer to footballer boyfriend Ruben Dias' as romance becomes more serious\n-\nStrictly Come Dancing gets 'major format shake-up' for this year's series that could 'disrupt chemistry' between celebrity and pro dance partners\n-\nStrictly Come Dancing star arrested on suspicion of rape in fresh blow for scandal-hit show just weeks before series returns to screens\n-\nNick Ferrari, 66, marries longtime love Clare surrounded by celeb pals including Piers Morgan, Myleene Klass and Christopher Biggins in idyllic venue in the south of France\n-\nKENNEDY: Shame on Serena Williams! She may be starving herself on prescription anorexia drugs. But this putrid stunt proves she's still a greedy beast\n-\nNetflix fans rave over 'simply fantastic' period drama hailed as 'a beautiful piece of storytelling' with huge Hollywood star in lead role\n-\nEXCLUSIVE\nFlorence Pugh's brother Toby Sebastian who starred in Game of Thrones has drastic new career change\n-\nThe tale of two Taylors! From Hollywood showmances to rebelling against studios - the incredible parallels between Taylor Swift and Elizabeth Taylor\n-\nNetflix fans gripped by 'harrowing and nightmarish' Vanessa Kirby sex work thriller - gushing over her 'powerhouse performance'\n-\nArnold Schwarzenegger's son Chris is unrecognizable in shockingly thin appearance after weight loss... see him now\n-\nAbbey Clancy wows in a bikini as she poses with husband Peter Crouch and their four children during idyllic summer holiday\n-\nKing Charles and Queen Camilla tell of 'deepest admiration for the unbreakable courage and spirit of the Ukrainian people' in Independence Day letter\n-\nMillie Bobby Brown weighs in on letting her kids pursue acting in resurfaced clip... after adopting baby girl at just 21\n-\nSopranos star Jerry Adler dies at 96: Late-blooming actor worked with Woody Allen and appeared on The Good Wife\n-\nEXCLUSIVE\nHome And Away tease the return of iconic couple Brax and Ricky after a decade away from Aussie soap\n-\nEXCLUSIVE\nI was the resident therapist on Celebrity Fit Club, the stars binged on pizza after weigh-ins and one was sacked after getting a gastric band mid-series\n-\nJack Osbourne honours late father Ozzy with heartfelt tribute in rare public appearance... one month after rock legend's death at 76\n-\nBradley Cooper, 50, and Gigi Hadid, 30, jet out for getaway together as age-gap romance heats up\n-\nEXCLUSIVE\nPride and Prejudice first look: Jack Lowden and Emma Corrin transform into Mr Darcy and Elizabeth Bennett for heated first scenes\n-\nMeghan and Harry's Michelin-starred wedding chef who features in new Netflix series reveals duchess's secret kitchen skills\n-\nEXCLUSIVE\nRaye forced to halt her performance as a fan collapses in the crowd at All Points East Festival\n-\nFKA Twigs puts on a very racy performance at All Points East after being drafted in as last minute replacement for Doechii\n-\nMeghan Markle's high street capsule wardrobe revealed: From staple crisp shirts to her go-to ballet flats\n-\nI'm A Celebrity star Dean McCullough speaks out as police investigate sick death threats\n-\nBrooks Nader's ex Gleb Savchenko seen on DWTS set after she claimed he was 'fired'\n-\nEXCLUSIVE\nTaking the Michael! ITV chiefs throw cash at comedian McIntyre in bid to nab him from BBC... but hit a snag because super-rich comic only cares about ratings\n-\nKylie Jenner's mini-me daughter Stormi steals the spotlight in her first commercial for mom's makeup\n-\nLil Nas X stripped completely nude on street before LA arrest in shocking new footage\n-\nLeigh-Anne Pinnock puts on an X-rated display as the former Little Mix star headlines Pride in Manchester\n-\nCoronation Street bosses face backlash for casting actor 'who broke another man's eye socket' as upcoming storyline reflects real life\n-\nLiam Gallagher extends major olive branch to his brother Noel during Oasis reunion tour - after years of feuding\n-\nGrief-stricken Kelly Clarkson appears shaken as she's seen for FIRST TIME since tragic death of ex-husband Brandon Blackstock\n-\nTALK OF THE TOWN: Moving in the right direction - Harry Styles set to start work on mega-mansion\n-\nSophie Turner reveals why she will never leave the UK again after moving back to London following divorce from ex Joe Jonas\n-\nJennifer Garner appears fresh-faced on solo outing after her kids celebrate dad Ben Affleck's low-key birthday\n-\nGRIFF RHYS JONES: My night with four young people (I paid, of course)...and why, in spite of all their witless opinions, I deplore the way their futures are being stifled\n-\nKatie Price displays her surgically-enhanced assets in a grey top as she steps out in London amid bitter feuds with her exes\n-\nEXCLUSIVE\nNew series depicts Princess Diana as an American mom with an addict daughter in Arizona - but friend behind the show insists he's not cashing in on her memory: KATIE HIND\n-\nEastEnders star Cheryl Fergison, 59, reveals she has suffered a worrying stroke - amid financial struggles\n-\n'Oh she's out!' Michelle Keegan lets her hair down as she posts selfie with a beer before partying at Coldplay's Wembley gig\n-\nLovely jubbly! Sir David Jason, 85, is in great spirits as he's mobbed by fans before his new show at Manchester's Lowry Theatre\n-\nMAFS UK expert Charlene Douglas in a wheelchair after being rushed to hospital as she gives health update\n-\nGeorgia Toffolo flaunts her toned abs in a skimpy white bikini as she shares snaps from sun-soaked holiday\n-\nJowita Przystal celebrates her birthday on wild night out as Pete Wicks shows off the moves she taught him on Strictly after pair reignited romance rumours\n-\nSam Thompson shows off new physique as he poses with equally buff brother-in-law Ryan Libbey after crashing sister Louise's family holiday\n-\nDid William the Conqueror really have an Asterix moustache? No, say historians - and that's just one of BBC blockbuster's howlers\n-\nKhloe Kardashian nearly upstages her friend at her birthday party as fans go wild over her 'amazing' look\n-\nJeremy Clarkson checks out the competition! Star samples a Britpop lager as he takes a break from his Cotswolds farm duties to enjoy Blur star Alex James' festival\n-\nEmily in Paris resumes filming in Venice two days after Netflix show's 'assistant director collapses and dies' in front of horrified crew\n-\nKylie Jenner gets roasted AGAIN after reposting snaps from her most-hated fashion shoot\n-\nThe dark past of William and Kate's 'forever home': Slavery links, an equerry who blew his brains out and a royal break-up...\n-\nThe Kooks frontman Luke Pritchard reveals why Rebel Wilson joined the band on stage and admits they only rehearsed an hour before\n-\nStunning wealth of Coco Gauff, 21, revealed as she's named the world's highest-earning female athlete\n-\nNepo baby son of Walking Dead star and 90s iconic supermodel arrested for assault\n-\nDua Lipa turns 30! Hitmaker sizzles in a sheer halter dress as she celebrates milestone birthday with intimate dinner while paying tribute to parents\n-\nSydney Sweeney who? Awards panel unveils 25 greatest films list with stars over 60 amid Hollywood's youth obsession\n-\nClaudia Schiffer sports a football shirt as she cheers on Brentford with husband Matthew Vaughn at the Gtech Community Stadium - after filmmaker invested in Premier League club\n-\nSophie Ellis Bextor stuns in glitter mini dress she makes surprise appearance at Reading Festival to perform Murder on the Dancefloor\n-\nAnd Just Like That... woke storylines killed the SATC reboot: From Miranda's 'late life lesbianism' to Charlotte's family gender issues - the moments that left viewers cringing\n-\nI met Amanda Holden when the Britain's Got Talent cameras weren't rolling - she showed her true colours straight away\n-\nLove Island's Yasmin Pettet reveals emotional reason she 'hasn't been intimate' with boyfriend Jamie Rhodes after leaving the villa\n-\nCountry superstar says chance meeting with Taylor Swift at Travis Kelce's charity camp lit up collab hopes\n-\nEXCLUSIVE\nSecret Lives of Mormon Wives explodes with lesbian twist as stars KISS in steamy first look at Season 3\n-\nImpossible contestant sent home empty-handed after struggling with a Harry Potter question on axed BBC show - but could YOU have guessed it?\n-\nBBC star Michael Ball reveals his mother has died as devastated singer is flooded with support by fans\n-\nSydney Sweeney's Americana director defends flop after box office crash\n-\nQueen Camilla is stylish in blue as she steps out at the final day of the York races\n-\nVicky Pattison leaves fans 'horrified' as she lets a dog lick her mouth in 'stomach churning' clip\n-\nBrookside legend Sue Johnston set to reprise iconic role after 35 years in historic Hollyoaks crossover\n-\nDrake back in bed with Bobbi Althoff after viral feud as they tease new project\n-\nLeona Lewis reveals how motherhood has changed her - as she gears up for her first-ever Las Vegas residency"
    }
  ],
  "argos_summary": "Poker Palace, a long‑time locals casino in North Las Vegas, will close in October after a sale and layoffs announced in July, reflecting a broader slump in tourism and consumer spending in the city.  Las Vegas has seen an 11% drop in visitors in June, driven by soaring prices, a shift toward luxury resorts, and political boycotts that have deterred Canadian and other international tourists.  The closure underscores the strain on local businesses and workers as the city struggles to balance its gambling heritage with rising costs and a changing visitor profile.",
  "argos_id": "RILGLKL8O"
}