{
  "url": "https://www.morningstar.com/news/dow-jones/2025082594/emea-morning-briefing-markets-boost-bets-on-fed-rate-cuts",
  "authorsByline": "",
  "articleId": "a9f02efee8c64a6db6ca129833d292f1",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T23:19:00-05:00",
  "addDate": "2025-08-25T04:38:24.390787+00:00",
  "refreshDate": "2025-08-25T04:38:24.390789+00:00",
  "score": 1.0,
  "title": "EMEA Morning Briefing: Markets Boost Bets on Fed Rate Cuts",
  "description": "",
  "content": "European stock futures were mixed after Asia stocks broadly rose. The dollar strengthened, Treasury yields were flat. Oil futures were flat while gold rose.\n\nEuropean futures were mixed after Fed Chair Jerome Powell said a rate cut may be warranted, due to growing concern about a sluggish labor market. While falling short of a promise of a September rate cut, Powell's comments were seen as opening the door for one or more cuts this year, giving investors a fresh dash of optimism.\n\n\"Although we think that a September cut is not quite a done deal, the bar now seems sufficiently high for the data to surprise positively that we shift our longstanding on-hold call for the Fed to a base case for 25bp rate cuts at both the September and December meetings,\" analysts at BNP Paribas said.\n\nFed Chair Powell's dovish speech likely gives more scope for a downward move in the dollar against the yen, Nomura's Global Markets Research team said.\n\nPowell's remarks increased the likelihood of a Fed rate cut at its September meeting, the team says, adding USD will probably continue to weaken in the near term.\n\nPowell delivered a \"virtuoso performance\" during his highly anticipated speech Friday at the Jackson Hole Economic Policy Symposium in Wyoming, said Michael Arone, chief investment strategist at State Street Investment Management.\n\nTreasury yields returned to their lowest levels in more than a week, according to Dow Jones Market Data.\n\n\"The market is saying, 'We expect some rate cuts coming here between now and the end of the year,'\" said Arone. \"I wouldn't be surprised if we get three,\" with a cut of 25 basis points at each of the Fed's remaining three meetings in 2025, he added.\n\nWhite House trade adviser Peter Navarro recently said that he expected U.S. tariffs on India to double on Aug. 27 as a penalty for Russian-oil purchases, ANZ Research analysts said.\n\nThese worries have increased after President Trump renewed his threat to impose sanctions on Russia unless progress is made to reach a peace deal with Ukraine, the analysts added.\n\nGold price's gains may also be constrained by uncertainty about Fed rate cuts beyond September, analysts said.\n\n\"Powell also said that the U.S. central bank would proceed carefully, which means that even if the Fed cuts rates in September, there is no surety it will continue to cut in October and December,\" said Vasu Menon, managing director for investment strategy at OCBC.\n\nIron ore futures rose as prices are likely supported by risk-on sentiment across markets due to signs of weaker supply, the ANZ Research team wrote.\n\nWhile the Chinese property market is stabilizing, meaningful growth in steel and iron ore demand is unlikely until there's an increase in new construction activity, they said, noting that China's steel industry will be relatively immune to U.S. trade tensions as other markets--including Europe and Asia--pick up the slack.\n\nTrump's Pressure Campaign on the Fed Casts Shadow Over Jackson Hole Gathering\n\nJACKSON HOLE, Wyo.-Central bankers debated artificial intelligence, demographics and interest rates during their annual conference here this weekend. But institutional survival became the unmistakable and pervasive undercurrent at what is normally a staid academic gathering.\n\nOn Friday, the first full day of the conference, President Trump escalated a brazen and relentless campaign to remake the Federal Reserve, when he said he was considering firing governor Lisa Cook over mortgage-fraud allegations made by a Trump administration housing official.\n\nHow a Historic Immigration Drop Is Changing the Job Market\n\nLast week, Federal Reserve Chair Jerome Powell said the U.S. labor market has entered \"a curious kind of balance.\" The demand for workers has cooled, yet the unemployment rate has held steady because the supply of labor has slowed abruptly.\n\nBehind that slowing in the labor supply is a dramatic swing in immigration, from one of the biggest waves in U.S. history to almost none. Economists say that could have subtle but lasting consequences.\n\nThis month, a beaten-up, Soviet-era propeller-driven plane taxied to a halt on a rural runway and two of Ukraine's top air aces clambered out, one carrying a rifle. The pair, clad in olive-drab flight suits, are part of a low-tech solution to the high-tech problem of Russian drones.\n\nThe 56-year-old pilot, who learned to fly as a hobby before the war, and the gunner, 38, a former auto mechanic who had never been in a plane before the invasion, are part of a squadron dedicated to knocking down the unmanned Russian attack and reconnaissance aircraft that are the bane of ground troops and civilians.\n\nWASHINGTON-The Pentagon has for months been blocking Ukraine's use of long-range missiles to strike inside Russia, U.S. officials said, limiting Kyiv from employing a powerful weapon in its fight against Moscow's invasion.\n\nA high-level Defense Department approval procedure, which hasn't been announced, has prevented Ukraine from firing any U.S.-made long-range Army Tactical Missile Systems, or Atacms, against targets in Russia since late spring, the officials said. On at least one occasion, Ukraine sought to use Atacms against a target on Russian territory but was rejected, two officials said.\n\nAI's Big Leaps Are Slowing. That Could Be a Good Thing.\n\nThe advance of cutting-edge AI is showing signs of slowing. For many companies looking to harness the technology, that wouldn't be a terrible thing.\n\nExcitement about AI reached feverish levels at the end of 2022 with the release of OpenAI's ChatGPT and has stayed red-hot since. A regular cadence of more impressive large language models from startups and big tech companies alike has kept the party going, lifting stocks-including shares of AI-chip giant Nvidia-to lofty heights.\n\nNvidia is halting production of an artificial-intelligence chip it developed for China after the government in Beijing told companies not to buy it, the latest twist in the U.S.-China tech war centered on the $4 trillion chip designer.\n\nNvidia in recent days has told some partners to stop work related to making its H20 product, which was approved by the Trump administration for sale in China in exchange for 15% of the sales going to the U.S. government, people familiar with the matter said. The pause came after Chinese officials raised concerns about potential security risks in the chips.\n\nAll times in GMT. Powered by Onclusive and Dow Jones.\n\nWrite to us at newsletters@dowjones.com\n\nWe offer an enhanced version of this briefing that is optimized for viewing on mobile devices and sent directly to your email inbox. If you would like to sign up, please go to https://newsplus.wsj.com/subscriptions.\n\nThis article is a text version of a Wall Street Journal newsletter published earlier today.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Fed Rate Cuts",
      "weight": 0.07906747
    },
    {
      "name": "Fed rate cuts",
      "weight": 0.07906747
    },
    {
      "name": "Fed Chair Jerome Powell",
      "weight": 0.060762405
    },
    {
      "name": "U.S. officials",
      "weight": 0.05717465
    },
    {
      "name": "interest rates",
      "weight": 0.056319166
    },
    {
      "name": "rates",
      "weight": 0.05598328
    },
    {
      "name": "big tech companies",
      "weight": 0.052528434
    },
    {
      "name": "U.S. trade tensions",
      "weight": 0.051202554
    },
    {
      "name": "Federal Reserve Chair Jerome Powell",
      "weight": 0.051018633
    },
    {
      "name": "Fed",
      "weight": 0.050358225
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.994140625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.7451171875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.693359375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.68505859375
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.564453125
    }
  ],
  "sentiment": {
    "positive": 0.17967786,
    "negative": 0.5962312,
    "neutral": 0.22409092
  },
  "summary": "European stock futures were mixed after Fed Chair Jerome Powell suggested that a rate cut may be necessary due to concerns about a sluggish labor market. His comments were seen as opening the door for one or more cuts this year. The dollar strengthened, Treasury yields were flat, and oil futures were flat while gold rose. Despite this, Nomura's Global Markets Research team said that Powell's remarks increased the likelihood of a Fed rate cut at its September meeting. BNP Paribas also shifted its on-hold call for 25bp rate cuts at both the September and December meetings. The dovish speech likely gives more scope for a downward move in the dollar against the yen, adding that USD will likely continue to weaken in the near term.",
  "shortSummary": "Global markets rose as investors bet on Fed rate cuts, amid signs of a slowing labor market and rising tensions with Russia.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "9126c032a5644640b245495a5609a3a3",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "European stock futures were mixed after Asia stocks rose, while the dollar strengthened and Treasury yields stayed flat. Fed Chair Jerome Powell’s dovish remarks at Jackson Hole suggested a 25‑basis‑point rate cut in September and possibly December, boosting optimism and weakening the dollar against the yen. Gold and iron‑ore futures rose on risk‑on sentiment, though uncertainty about further cuts may temper gains. Trump’s comments on the Fed and trade tensions, along with broader geopolitical concerns, added volatility to markets.",
  "argos_id": "RWSXUUDY6"
}