{
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-15030607/Zoe-Kravitz-Harry-Styles-romantic-stroll-Rome.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "authorsByline": "Sonia Horon",
  "articleId": "4c155282220b4861b47b898d9c68da56",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/25/03/101513533-0-image-a-93_1756088254769.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-25T04:11:49+01:00",
  "addDate": "2025-08-25T03:15:46.914681+00:00",
  "refreshDate": "2025-08-25T03:15:46.914684+00:00",
  "score": 1.0,
  "title": "Zoe Kravitz seen arm-in-arm on stroll in Rome with pop megastar",
  "description": "Zoe Kravitz was pictured enjoying a romantic stroll with a pop megastar, just days after getting cozy with Austin Butler.",
  "content": "Zoe Kravitz was pictured enjoying a romantic stroll with Harry Styles, just days after getting cozy with Austin Butler.\n\nThe Batman actress, 36, was seen walking arm-in-arm with the pop megastar, 31, in Rome on Sunday, in a fan video shares to social media.\n\nZoe — who's the daughter of Lisa Bonet and rocker Lenny Kravitz — stunned in a white mini dress with black ballet flats and a dark baseball hat.\n\nShe had a white tote bag slung over her arm, and carried a white cup in her other hand.\n\nMeanwhile the Watermelon Sugar hitmaker donned a denim jacket and matching jeans, along with black and white sneakers.\n\nThe two linked arms as they strolled, appearing engaged in conversation. At one point, Zoe turned to look at Harry as she listened intently.\n\nThe sighting has prompted fan speculation about Zoe and Harry's relationship status.\n\n'Well that was not expected,' one person wrote.\n\n'At a bar in paris with austin butler then in rome with your arm around harry styles, zoë kravitz i need you to put me onto your game,' another joked.\n\n'Harry and Zoe weren’t on my 2025 bingo card.'\n\n'HARRY AND ZOË KRAVITZ IS SO INSANE TO ME.'\n\nIt comes after Zoe enjoyed an extremely flirty display with co-star Austin, 34, at a Paris bar this week.\n\nThe Caught Stealing co-stars, who are both fresh out of high-profile romances with Kaia Gerber and Channing Tatum respectively, were seen drinking, hugging and leaning in close to one another while out late at trendy hotspot Dragon after their film's premiere on Thursday.\n\nThe Elvis looked intently at a stunning Kravitz during the pair's cozy chat - with an insider exclusively dishing on their 'chemistry' to the Daily Mail.\n\n'There's definitely chemistry between them and they're loving spending time together promoting the movie,' the insider said.\n\n'It's not quite a fully fledged romance but Austin hasn't been friend-zoned either. Working together on the film was intense as the director Darren Aronofsky is known for pushing his actors.\n\nThe pair star alongside Hollywood legend Liev Schreiber as well as former Doctor Who star Matt Smith, Vincent D'Onofrio, Regina King and Bad Bunny in Darren Aronofsky's comedy crime film.\n\nAs per Deadline, the film 'follows Hank Thompson (Butler), a burned-out former baseball player, as he's unwittingly plunged into a wild fight for survival in the downtown criminal underworld of '90s New York City.'\n\nZoe was also recently linked to actor Noah Centineo after they were spotted together on multiple occasions in NYC.\n\nIt comes after the actress and her ex Tatum, 45, ended their engagement in October 2024.\n\nThe couple had begun dating after the actor starred in Blink Twice.\n\nPrior to kicking off their relationship three years ago, Kravitz was coming off a divorce from her first husband, the actor Karl Glusman, while Tatum had only recently finalised his divorce from Jenna Dewan, with whom he has one daughter.\n\nZoe released her directorial debut film Blink Twice in late August after years of working in front of the camera.\n\nHer acting credits include HBO's mini-series Big Little Lies, Hulu's now-cancelled show High Fidelity and The Batman (2022) with Robert Pattinson and Colin Farrell.\n\nMeanwhile Harry made headlines last month when he was photographed sharing a steamy kiss with producer Ella Kenny at Glastonbury Festival and, just weeks later, appeared in Rome spending time with Belgian-Congolese interior architect and designer Kim Mupangilai.\n\nHarry was previously linked to Olivia Wilde, 41, from January 2021 until November 2022 after they met on the set of her film Don't Worry Darling.",
  "medium": "Article",
  "links": [
    "https://www.dailymail.co.uk/tvshowbiz/zoe-kravitz/index.html",
    "https://www.dailymail.co.uk/tvshowbiz/harry_styles/index.html",
    "https://www.instagram.com/reel/DNwc4sq2lvN/?utm_source=ig_embed&utm_campaign=loading",
    "https://www.dailymail.co.uk/tvshowbiz/lenny-kravitz/index.html",
    "https://www.dailymail.co.uk/tvshowbiz/article-15025795/Austin-Butler-Zoe-Kravitz-intimate-couple-bar-video.html"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Zoe Kravitz",
      "weight": 0.075772405
    },
    {
      "name": "co-star Austin",
      "weight": 0.069635615
    },
    {
      "name": "arm",
      "weight": 0.065801114
    },
    {
      "name": "arms",
      "weight": 0.065801114
    },
    {
      "name": "Harry Styles",
      "weight": 0.05964053
    },
    {
      "name": "Zoe",
      "weight": 0.05936464
    },
    {
      "name": "former Doctor Who star Matt Smith",
      "weight": 0.059017785
    },
    {
      "name": "rocker Lenny Kravitz",
      "weight": 0.05836849
    },
    {
      "name": "Lenny Kravitz",
      "weight": 0.057617474
    },
    {
      "name": "Harry",
      "weight": 0.056725334
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9990234375
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.96240234375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.63525390625
    },
    {
      "name": "/Arts & Entertainment/Movies/Other",
      "score": 0.615234375
    },
    {
      "name": "/Arts & Entertainment/Online Media/Online Image Galleries",
      "score": 0.34228515625
    }
  ],
  "sentiment": {
    "positive": 0.17890754,
    "negative": 0.36790192,
    "neutral": 0.45319048
  },
  "summary": "Zoe Kravitz, the daughter of Lisa Bonet and rocker Lenny Kavitz, was seen walking arm-in-arm with pop megastar Harry Styles in Rome on Sunday, prompting speculation about their relationship status. This comes after Zoe shared a romantic stroll with co-star Austin Butler in Paris, where they were seen having an intimate conversation. The pair, who are fresh from high-profile romances with Kaia Gerber and Channing Tatum respectively, are reportedly enjoying 'chemistry' between them and working together on the film, Blink Twice. Zoe recently released her directorial debut film Blink Twice and has acting credits including HBO's mini-series Big Little Lies and High Fidelity.",
  "shortSummary": "Zoe Kravitz and Harry Styles were spotted arm-in-arm in Rome, sparking speculation about their relationship, after a brief stroll with Austin Butler and a steamy kiss with Noah Centineo.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b51a9170bdeb43beb9f2391fc7ae7155",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/article-15025795/Austin-Butler-Zoe-Kravitz-intimate-couple-bar-video.html",
      "text": "Newly single Austin Butler and Zoe Kravitz get VERY intimate at late-night bar... as friends dish on their 'chemistry'\nAustin Butler and Zoe Kravitz sent romance rumors into overdrive with their extremely flirty display at a Paris bar this week.\nThe Caught Stealing co-stars, who are both fresh out of high-profile romances with Kaia Gerber and Channing Tatum respectively, were seen drinking, hugging and leaning in close to one another while out late at trendy hotspot Dragon after their film's premiere on Thursday.\nElvis star Butler, 34, looked intently at a stunning Kravitz, 36, during the pair's cozy chat - with an insider exclusively dishing on their 'chemistry' to the Daily Mail.\n'There's definitely chemistry between them and they're loving spending time together promoting the movie,' the insider said.\n'It's not quite a fully fledged romance but Austin hasn't been friend-zoned either. Working together on the film was intense as the director Darren Aronofsky is known for pushing his actors.\n'Promoting it and getting to spend time together without that pressure has been the reward for them both.\nAustin Butler and Zoe Kravitz sent romance rumors into overdrive with their extremely flirty display at a Paris bar this week\nThe two actors previously sparked romance rumors following their respective splits, however a source poured cold water on the claims when speaking to TMZ\n'Austin thinks Zoe is cool and hilarious, his pals would not be surprised if something progressed.'\nThe Daily Mail has contacted representatives for Austin Butler and Zoe Kravitz for comment and has yet to hear back.\nThe pair star alongside Hollywood legend Liev Schreiber as well as former Doctor Who star Matt Smith, Vincent D'Onofrio, Regina King and Bad Bunny in Darren Aronofsky's comedy crime film.\nAs per Deadline, the film 'follows Hank Thompson (Butler), a burned-out former baseball player, as he's unwittingly plunged into a wild fight for survival in the downtown criminal underworld of '90s New York City.'\nCaught Stealing marks Butler's latest high-profile role after starring in Dune: Part Two.\nThe Dune sequel - which also starred Timothee Chalamet, Zendaya and Florence Pugh - has raked in over $700million worldwide since it premiered in March last year.\nThe American actor earned his first Golden Globe and an Oscar nomination for Best Actor in 2023 for his portrayal of the late music icon Elvis Presley in Baz Luhrmann's acclaimed 2022 musical biopic.\nElvis catapulted him to A-list stardom — over two decades after he found fame in the early 2000s as a child star on Nickelodeon.\nThe Caught Stealing co-stars were seen drinking, hugging and leaning in close to one another after their film's premiere\nElvis star Butler, 34, looked intently at a stunning Kravitz, 36, during the pair's cozy chat - with an insider exclusively dishing on their 'chemistry' to the Daily Mail\nThe pair were letting loose amid their intense press tour\nButler leaned in and hugged Kravitz during their drinks\nThe pair wore matching black ensembles during the evening\nThe superstars looked close as they chatted after the premiere\nKravitz enjoyed a drink as she chatted with Butler\n'There's definitely chemistry between them and they're loving spending time together promoting the movie,' an insider said\nButler split from Kaia Gerber, 23, at the end of of 2024 after three years (pictured together in April 2023 in NYC)\nKravitz split from fiance Channing Tatum, 45, in October 2024 (pictured August 2024)\nAs for Kravitz, the daughter of rock star Lenny Kravitz released her directorial debut film Blink Twice in late August after years of working in front of the camera.\nHer acting credits include HBO's mini-series Big Little Lies, Hulu's now-cancelled show High Fidelity and The Batman (2022) with Robert Pattinson and Colin Farrell.\nButler's split from Cindy Crawford's model daughter Gerber, 23, after a three-year romance was revealed in January.\nThey were first linked back in December 2021.\nPrior to his relationship with Gerber, Butler had been in a long-term relationship with Vanessa Hudgens from 2011 to 2020, and was reportedly with his Elvis co-star Olivia DeJonge for several months in 2020, before being seen sharing a kiss with Lily-Rose Depp in August 2021.\nKravitz and Tatum, 45, ended their engagement in October 2024.\nThe couple had begun dating after the actor starred in Blink Twice.\nPrior to kicking off their relationship three years ago, Kravitz was coming off a divorce from her first husband, the actor Karl Glusman, while Tatum had only recently finalised his divorce from Jenna Dewan, with whom he has one daughter."
    },
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/harry_styles/index.html",
      "text": "Advertisement\nHarry Styles\nHarry Styles is an English singer and actor from Holmes Chapel, Cheshire. He gained fame as a member of the globally successful boy band One Direction. Following the band's hiatus, Styles launched a solo career, releasing two commercially successful albums: 'Harry Styles' and 'Fine Line'. He has also appeared in films such as 'Dunkirk' and 'Don't Worry Darling'.\nRELATED TOPICS FOR Harry Styles\nHarry Styles - Latest News and Updates\nPage\nZoe Kravitz seen arm-in-arm on romantic stroll in Rome with Harry Styles after getting cozy with Austin Butler\n25/08/25 03:11\nZoe Kravitz was pictured enjoying a romantic stroll with Harry Styles, just days after getting cozy with Austin Butler. The Batman actress, 36, was seen walking arm-in-arm with the pop megastar, 31, in Rome on Sunday, in a fan video shares to social media. Zoe - who's the daughter of Lisa Bonet and rocker Lenny Kravitz - stunned in a white mini dress with black ballet flats and a dark baseball hat. ...read\nTALK OF THE TOWN: Moving in the right direction - Harry Styles set to start work on mega-mansion\n23/08/25 22:04The former One Direction singer, right, is combining two luxury homes on a private estate in Hampstead, north London.Sir Cliff Richard, 84, shows off his sweet side for 2026 calendar as he offers up biscuits and poses with wings for his highly anticipated annual photoshoot\n08/08/25 23:02Congratulations - and celebrations are in order for Sir Cliff Richard for he is back and in an epic way.Top plastic surgeons issue warning over viral surgery trend that leaves patients with facial scars\n06/08/25 00:09A bizarre new plastic surgery procedure is dividing the internet after going viral on social media.Harry Styles spotted with stunning designer after kissing another woman at Glastonbury Festival\n04/08/25 09:54Harry Styles has been spotted soaking up the sights in Italy with a new female companion, weeks after he enjoyed a steamy smooch with someone else.Harry Styles soaks up the sights with stunning Belgian designer in Italy after THAT steamy snog with Ella Kenny at Glastonbury Festival\n03/08/25 12:41The singer, 31, showed off his favourite spots in Vatican City and Rome to Belgian-Congolese designer Kim Mupangilai.Zoe Ball reveals she tried to buy one of Harry Styles' sold out sex toys when she regained her libido after struggling with it during the menopause\n31/07/25 14:51Zoe Ball has revealed she was keen to purchase one of Harry Styles' sold-out sex toys after her libido returned following the menopause.Harry Styles was 'very behind' his lifestyle brand Pleasing expanding to include X-rated products, says Zoë Ligon who designed sex toys with the singer\n29/07/25 19:53According to sex educator and author Zoe Ligon, who helped create the product line, the singer was 'very behind' his lifestyle brand Pleasing expanding into the world of sexual wellness.Harry Styles sends fans into a frenzy after releasing X-rated new product line\n24/07/25 19:53It's been a while since Harry Styles' fans have heard from the popstar.Harry Styles fans are convinced the star's brand Pleasing is launching a VERY naughty product after cryptic clip\n24/07/25 08:24The One Direction star, 31, is set to release a new item for his accessory and fragrance brand at 11am on July 25.Liam Payne's sister Ruth Gibbins shares emotional tribute on 15th anniversary of One Direction - nine months after his tragic death\n23/07/25 23:31The band - made up of Liam, Niall Horan, Zayn Malik, Harry Styles, and Louis Tomlinson - become one of the biggest boy bands in history after being put together on the X Factor in 2010.The A-listers trading first-class travel for London's e-bikes as Pedro Pascal, Olivia Rodrigo, and Timothée Chalamet all jump on the city's hottest mode of transport\n19/07/25 12:08Swapping high-end lifestyles for everyday moments, these stars remind us they're not always living in the fast lane.Olivia Wilde cuts a trendy figure in a white love heart T-shirt and flared trousers as she goes shopping in London\n15/07/25 18:31Olivia Wilde cut a trendy figure as she stepped out for a spot of shopping in London's Primrose Hill on Tuesday.The A-list passengers who have swapped luxury travel for humble public transport as Dua Lipa was pictured travelling via Kings Cross\n12/07/25 12:54Celebrities often portray an overtly glamorous life that the public cannot hope to replicate.Olivia Dean admits she 'doesn't need to be in a relationship to survive' and her ability to love has 'got her into trouble' after she was linked to singer Harry Styles\n10/07/25 00:42Singer Olivia Dean has insisted she 'doesn't need to be in a relationship to survive' after she was linked to fellow hitmaker Harry Styles.M&S releases men's range of VERY short shorts inspired by A-listers like Paul Mescal and Harry Styles - as shoppers hail 'thigh-high summer'\n08/07/25 10:27The supermarket giant has introduced a new men's ultra-short shorts range online and in UK stores, allowing Britons to recreate the Normal People actors' trademark look.Olivia Dean dating drummer Eddie Burns as couple make their public debut at Wimbledon after singer was romantically linked to Harry Styles\n08/07/25 08:48The soul singer, 26, has been linked to the US musician, 27, since April, after she began liking several of his photos on Instagram.Zayn Malik reveals his experiences with racism as he teases new song\n07/07/25 08:35Zayn Malik has reflected on his experiences with racism while performing as part of One Direction.Zayn Malik drops bombshell about facing 'racism' during One Direction days\n06/07/25 19:52In an upcoming new song, Zayn Malik touches on his experience with racism while he was in the band that made him famous, One Direction.Harry Styles' new love interest Ella Kenny is seen for the first time since their steamy Glastonbury kiss as it's revealed she is friends with singer's ex-girlfriend's stylist\n03/07/25 00:41EXCLUSIVE: The producer Harry Styles was seen kissing at Glastonbury has been pictured for the first time since their steamy night together.Harry Styles' new love interest Ella Kenny shares her first snap from Glastonbury posing with DJ Nia Archives and stylist who worked with singer's ex-girlfriend Taylor Russell - after THAT late night festival kiss\n02/07/25 10:08The former One Direction star, 31, partied into the early hours with pals at Worthy Farm on Saturday, where he was seen getting very close to the 28-year-old producer.Harry Styles' mystery new woman is 'REVEALED' after pair were seen passionately snogging in VIP area of Glastonbury Festival\n30/06/25 19:42Harry Styles' mystery new woman has reportedly been revealed after the pair were seen passionately snogging in VIP area of Glastonbury Festival over the weekend.New picture of Harry Styles at Glastonbury emerges after he was seen 'passionately kissing mystery woman'\n30/06/25 11:17With a drink in hand, the former One Direction star was accompanied by a group of friends while making his way across the Worthy Farm site during a weekend of partying.Harry Styles 'passionately snogs mystery woman at Glastonbury Festival as sparks fly in the VIP section'\n29/06/25 23:26The former One Direction star, 31, descended on Worthy Farm on Saturday. But as he partied into the early hours of the morning, Harry was seen getting very close to an unknown woman in the VIP area.Robbie Williams responds to Glastonbury surprise set rumours after he fuelled speculation with cryptic post\n28/06/25 14:07The Angels hitmaker stamped out rumors that he'd be popping up at Glastonbury with a secret set, despite fuelling them on Instagram just yesterday.Eddie Redmayne and wife Hannah Bagshawe 'can't keep their hands off each other' as they share a passionate kiss while soaking up the sun at Glastonbury\n27/06/25 20:26The couple, who have been married for 11 years, could barely keep their hands off of one another as they attended the festival while their two children were nowhere to be seen.Why your hangover REALLY is getting worse the older you get... and it's not what you think: POLLY VERNON exposes the secret world of the female body, from common lifestyle problems that trigger menopause to how much breasts weigh\n23/06/25 00:42How much do you know about the female body? Your body? Or your friend's, your sister's, your daughter's?ALEXANDRA SHULMAN'S NOTEBOOK: Why I give short shrift to men in their shorts\n22/06/25 01:23ALEXANDRA SHULMAN'S NOTEBOOK: This summer there's a trend for women in culottes, which strike me as the worst of both worlds.Stylish Olivia Wilde enjoys drinks with producer friend Saul Germaine on day out in ex-boyfriend Harry Styles' London neighbourhood\n21/06/25 15:27Olivia Wilde was all smiles and laughter as she enjoyed drinks with her producer friend Saul Germaine. The actress, 41, donned a loosely fitted shirt for drinks in the London heatwave.Handlebar, Walrus, or 70s? Expert reveals how to find the right moustache for your face shape - and why Justin Bieber and Michael Cera got it wrong\n15/06/25 07:36Picking the right moustache one can seem like a minefield. But don't worry, chaps - as it turns out particular variations suit certain face shapes.Harry Styles dons 'Techno Is My Boyfriend' hat as he puts on a very stylish display while strolling though London\n12/06/25 12:03The singer, 31, who has famously shunned wireless headphones in favour of the older wired option, was seen strolling the streets while listening to songs.As Oasis prepare to return to their Manchester roots on tour - these are the humble homes of northern band stars\n11/06/25 15:42While the brothers Noel and Liam Gallagher, will rake in millions thanks to ticket sales, merchandise and even a documentary - it wasn't always this way.Britain's biggest-ever lottery jackpot of £208million is still up for grabs after no EuroMillions winners last night means prize rolls over to Tuesday\n07/06/25 07:43The eye-watering sum would see the winner pip the likes of Harry Styles and Rory McIlroy on the wealth scale.EuroMillions jackpot rolls over AGAIN: One ticketholder could now land an eye-watering £208MILLION in Friday's draw\n03/06/25 23:34The jackpot has rolled over again after Tuesday's £199million draw, which would also have been a record-breaking amount, had no winners.Bad news for manly men! Women prefer blokes with more FEMININE faces, study finds\n02/06/25 15:18It's bad news for macho stars like Chris Hemsworth and Jason Momoa, as science suggests women prefer blokes with more feminine faces.Harry Styles shows off his muscular physique in a pair of tiny shorts as he runs errands in London\n02/06/25 09:27The singer, 31, shielded his face with a purple baseball cap and oversized sunglasses for a stroll.The celebrity hotspot besieged by e-bikes: Primrose Hill restaurant says dozens of cycles are being dumped on doorstep and blocking deliveries\n22/05/25 17:00Greek restaurant Lemonia, which has been a staple of the trendy suburb for 50 years, regularly has up to 60 Lime and Forest bikes dumped outside.Georgia Toffolo stuns in a chic polka dot bikini on luxury girls' trip to Greece as she treats staff after her staggering nine figure net worth was revealed\n21/05/25 15:40Sharing a series of photos to her Instagram Story, Toff teamed her bikini with a straw hat and went makeup-free.Georgia Toffolo flaunts her toned physique in a polka dot bikini and shows off huge holiday villa after jetting to luxury sun-soaked location\n20/05/25 18:27Georgia Toffolo flaunted her toned physique in a polka dot bikini and showed off her huge holiday villa on Tuesday.Beautiful Victorian home owned by Harry Styles' band hits the market for $2.8M and has intriguing secrets\n18/05/25 19:28A Victorian gem with royal roots and rockstar ties - Harry Styles' bandmates' Pasadena home hits the market for $2.8M.Harry Styles' massive weekly wage revealed as he becomes the fourth wealthiest celebrity under 40\n18/05/25 18:39Harry Styles banked a massive £872,000 per week last year, according to new accounts filed for his business.James Watt reveals how finding love with wife Georgia Toffolo cost him £150,000 as newlyweds explain why they 'constantly have to keep earning' despite staggering £425M net worth\n18/05/25 12:03The BrewDog co-founder, 42, and the Made in Chelsea star, 30, began dating in 2023, before tying the knot in a low key ceremony in March this year.Georgia Toffolo's staggering nine figure net worth revealed after she shocked fans with empty joint bank account balance and 'slap dash' low-key wedding\n16/05/25 14:37Georgia Toffolo's staggering net worth has been revealed and the reality star boasts a fortune bigger than that of both Ed Sheeran and Harry Styles.Battle of the war films: Brits vote on their favourite WW2 movies of all time - which do YOU think came out on top?\n09/05/25 23:56The Second World War still looms large in the imagination of Brits - but the winner of a poll to find the nation's most cherished WW2 film might surprise you.Harry Styles fans in meltdown after he's spotted in crowd greeting new Pope in St. Peter's Square\n08/05/25 23:11The Grammy-award winning artist, 31, was seen in the crowd as Pope Leo XIV delivered his first public remarks in his new position.George Michael's £10m London mansion 'gets modern makeover' after his sister was granted planning permission despite protests from locals\n02/05/25 21:47Yioda Panayiotou, who is the Wham ! star's only living sibling, was given ownership of the property following the singer's tragic death on Christmas Day 2016 at the age of 53.Niall Horan's affectionate response to Ed Sheeran's Instagram throwback as pair confirm their 'rift' is over... 11 years after One Direction star's 'fling' with Ellie Goulding\n30/04/25 15:32Sheeran hinted at a bitter fall-out with the former One Direction star in 2014 after singing about an ex-girlfriend cheating with one of his friends.Black Mirror viewers 'driven to madness' after spotting alternate versions of the same episode - and even claim Netflix is 'gaslighting' them\n14/04/25 10:29The seventh series of the science fiction drama landed on Netflix last week and the second instalment has caused a stir amongst fans.How hair loss became hot! A-list sex symbols embracing their receding hairlines are leaving swooning fans hot under the collar\n13/04/25 08:58Balding is back and stars such as Walton Goggins who recently made waves in the third series of The White Lotus, Jude Law and even Harry Styles are leaning in to their widow's peaks.Black Mirror fans left 'screaming at the screens' as chart-topping pop star makes rogue Netflix cameo NOBODY saw coming\n11/04/25 08:52The seventh series of the science fiction drama landed on Netflix on Thursday (April 10) - and fans have already started binging the lot.Harry Styles' delighted mum Anne Twist reveals hilarious crochet tribute to her popstar son as fans go wild over the 'cute' gift\n10/04/25 14:21Harry Styles' delight mum Anne Twist has revealed she has a crochet doll of her pop star son in a new Instagram video on Wednesday.I went to lunch with the world's most famous porn star. Here are 12 things she told me that will change your sex life forever - including the thing almost EVERYONE is getting wrong in the sack: JANA HOCKING\n09/04/25 14:31Now let me be clear, Angela isn't just a porn star. She's the porn star. A powerhouse with both brains and beauty, she's one of the most respected names in the adult industry.Harry Styles shows off his muscular physique in tiny shorts as he goes for a stroll\n09/04/25 09:07The singer, 31, teamed the retro style red Adidas shorts with a graphic printed white sweater for his outing.Harry Styles 'given go ahead on £30million super-mansion' - but there's a strict set of rules\n08/04/25 08:40The singer, 31, is restoring a Grade II-listed former 18th century mansion back to its former glory after it was divided up into two semi-detached homes in the 1950's.CBB's Chesney Hawkes, 53, revealed he blew £8.2m fortune on 'crazy' lifestyle in his heyday - yet has taken 'low' £25k appearance fee on show for 'exposure not cash'\n08/04/25 08:31Chesney Hawkes entered the Celebrity Big Brother house on Monday night, having netted a reported £25,000 appearance fee.Euphoria star Jacob Elordi channels Harry Styles as he debuts moustache while attending TV premiere in Sydney\n07/04/25 12:25The actor, 27, flaunted the neat facial hair at the glitzy event in Sydney on Monday as he wore a navy collared jacket with a matching pair of high-waisted trousers.Harry Styles continues to sport a thick moustache as he channels Michael Jackson in socks and YSL loafers while picking up a matcha in London\n02/04/25 14:40Harry Styles was spotted enjoying the British sunshine as he picked up an iced Matcha in Mayfair, London on Wednesday afternoon.Harry Styles listens to music through wired headphones as he passes a starstruck Deliveroo driver - amid fan speculation over the release of his hotly-anticipated fourth album\n28/03/25 14:13Harry Styles was spotted listening to music through a pair of wired headphones while out and about in central London on Thursday afternoon.Harry Styles sports thick walrus moustache as he reignites his bromance with a slimline James Corden at health-conscious cafe\n26/03/25 11:30The singer, 31, and comedian, 46, struck up a friendship after the former One Direction member shot to fame on X Factor in 2010.Olivia Wilde brings her son Otis to LA's California Science Center in rare sighting\n24/03/25 15:49The 41-year-old Independent Spirit Award-winning filmmaker treated little Otis - who turns 11 on April 23 - to the $92.99 'Space Shuttle' bomber jacket in the museum gift shopFitness guru Tracy Anderson is accused of MOCKING Meghan Markle\n20/03/25 19:37The workout guru appeared to shade The Duchess as she introduced the new Tracy's Green Goddess Crunch Salad in partnership with Goop Kitchen.Can YOU guess which world-famous star grew up in this modest home? Quaint three-bedroom property goes up for sale for £350,000\n17/03/25 14:47A quaint three-bedroom property in the north of England has hit the market for £350,000, but one of the country's biggest stars spent his childhood there.Lily Allen reunites with Grammy winning producer for long awaited comeback album after seven-year hiatus\n15/03/25 19:38Lily Allen is gearing up for a major musical comeback, reuniting with Grammy-winning producer Greg Kurstin in a bid to release her first album in seven years.Michael B Jordan sparks dating rumours with Harry Styles' ex Taylor Russell as they're spotted on a day out in London\n14/03/25 10:39The 38-year-old heartthrob, known for his roles in Black Panther and Creed, has been linked to high-profile beauties like Kendall Jenner and Lori Harvey .Is Michael B. Jordan dating Harry Styles' ex? Fans buzzing over new sighting\n14/03/25 04:09Michael B. Jordan is one of Hollywood's most sought-after actors, so it's no surprise that his love life keeps fans buzzing. Now, fresh speculation swirls around the star and Harry Styles' ex.Olivia Wilde enjoys sexy date night with former basketball player after ex Harry Styles reacts to new romance\n12/03/25 19:36Olivia Wilde enjoyed a romantic date night with her new boyfriend, Dane DiLiegro, amid reports that her ex Harry Styles feels 'massive relief' she has moved on.The fitness regime that prepped Harry Styles for his impressive Tokyo Marathon time as the singer's PT reveals his training secrets\n07/03/25 01:50The singer, 30, who placed 6,010th of the 26,706 runners has clearly been working hard to beat more than 20,000 other runners across the finish line.Doechii puts on a cheeky display in a plunging black bodysuit as she joins leggy Kate Moss and braless Camilla Rowe leading the racy arrivals at the Tom Ford Paris Fashion Week show\n06/03/25 09:31The Tom Ford Paris Fashion Week show was nothing short of a racy affair as Doechii led the scantily-clad arrivals at the Pavillon Vendôme on Wednesday evening.Emily Ratajkowski, 33, flashes underwear in see-through dress as she flirts with Chris Rock, 60, at Oscar party\n03/03/25 16:31Not only did the Gone Girl star stun in a see-through lace dress that showed off her tiny black underwear, but she also got some one-on-one time with a big male star.Harry Styles bags a Golden time as he completes the Tokyo Marathon - beating more than 20,000 runners\n03/03/25 01:43Harry Styles bagged an impressive time during the Tokyo Marathon on Sunday as he joined fellow runners taking part in the 26.2mile race.Revealed: UK pop stars drop out of global bestseller charts - but who came out on top this year?\n24/02/25 00:01After a period of success for British musicians, it has emerged that, for the first time in more than twenty years, there are no British performers in the worldwide top 10 of top selling albums or singles.Harry Styles was left 'devastated' by SNL impression of him, star says\n20/02/25 18:56Saturday Night Live cast member Chloe Fineman admitted that her impression of Harry Styles left him absolutely shattered.Harry Styles' ex Taylor Russell beams with happiness as she walks arm-in-arm with a female friend - months after her 'split' from One Direction star\n18/02/25 10:24Taylor Russell beamed with happiness as she was spotted walking arm-in-arm with a female friend in London on Monday, nine months after her split with ex Harry Styles.Boden's new jumper is inspired by an iconic Princess Diana (and Harry Styles) look\n17/02/25 16:31When it comes to British fashion icons, Princess Diana and Harry Styles definitely make the cut.Singer recreates her iconic neon pink BRITs hairdo as she films sketch ahead of 2025 ceremony... but can you guess who it is?\n14/02/25 11:04The ex Page 3 model, 58, was joined on set by a Mick Fleetwood lookalike, 35-years after their now infamous gig presenting the show left fans cringing.One Direction 'make a huge decision on whether they'll reunite at the BRIT Awards to pay tribute to bandmate Liam Payne following his death'\n11/02/25 21:14The group were reportedly approached by bosses about the prospect of performing live at the event on March 1.George Michael's sister bids to restore singer's £10m London mansion to its former glory: Star's only living sibling plans to chop down garden trees and refurbish parts of building after it fell into disrepair\n05/02/25 19:17Yioda Panayiotou, who is the Wham! star's only living sibling, is planning to chop down trees and refurbish parts of the property in upmarket Hampstead.Olivia Wilde flashes her toned abs in an unusual bra top after claims she is dating a hunk\n04/02/25 17:24Olivia Wilde showcased her fit form after what appeared to be a very sweaty workout in Los Angeles Monday.Emotional moment Liam Payne is honoured at The Grammys with touching montage in his own words and poignant Chris Martin tribute\n03/02/25 11:14On Sunday, the music industry's most important figures gathered together at the Crypto.com Arena in Los Angeles for the 67th Grammy Awards 2025.Liam Payne fans in tears over Grammys 2025 tribute 4 months after One Direction star's death at 31\n03/02/25 05:12Liam Payne fans were left sobbing as The Grammys 2025 paid tribute to the One Direction icon on Sunday.\nPage\nDON'T MISS\n-\nRio Ferdinand, 46, and wife Kate, 33, reveal they have moved to Dubai with their family as they show off their lavish mansion\n-\nCruz Beckham shares an intimate moment with Jackie Apostel after joining shirtless dad David aboard their lavish yacht\n-\nEmma Watson potters around in a sheer lace dress as she joins her hunky personal trainer for a hike in Saint Tropez\n-\nEXCLUSIVE\nI was desperate to know what this model got up to with England star. Now I've discovered truth, reveals KATIE HIND\n-\nSting is being sued for 'MILLIONS of pounds in lost royalties' by former bandmates in The Police\n-\nBeaches, history, waterparks, golf... Turkey (Türkiye) has it all: Here's why you'll never want to leave\nAd Feature\n- Selena Gomez stuns in black swimsuit on yacht for bachelorette party in Cabo... but was BFF Taylor Swift there? Looking good\n-\nWas this earliest sign of cracks forming between Meghan and Kate? Expert reveals signs that 'Fab Four' weren't getting on\n-\nEXCLUSIVE\nThe dark truth of Club Chalamet: She's a 58-year-old Timothée obsessive who HATES Kylie Jenner\n-\nCould an app really make you better with money? Putting a smart money app to the test\nAd Feature\n-\nBrooklyn Beckham and Nicola Peltz give fans a glimpse of their 'perfect Sunday' as couple unwind after family 'snub'\n-\nMeghan Markle 'placed status above reality' and struggled to separate her own image from Suits character, claims royal author\n-\nBobby Brazier's love for Hare Krishna: From finding happiness through religion after tragic start - as soap star 'quits showbiz'\n- Zoe Kravitz seen arm-in-arm on romantic stroll in Rome with Harry Styles after getting cozy with Austin Butler See the pic\n-\nGet your autumn on! From pumpkin throws to cosy hot chocolate mugs, here's our pick of homeware for the new season\nAd Feature\n-\nFrom Princess Margaret's sadistic streak to Meghan 'berating a gardener' - the most ill-mannered royals revealed\n-\nWhy Millie Bobby Brown, 21, decided to shun Hollywood in favour of farm life in a nod to her British roots as she adopts a baby\n- I Dream of Jeannie star Barbara Eden turns 94 and looks more glamorous than ever... see her now All change\n-\nMum's the word! George, Charlotte and Louis join William and newly blonde Kate for church service in Balmoral\n-\nFrom auctions to EVs: 5 brilliant motoring brands every driver should know - from finance fixes to stunning electric SUVs\nAd Feature\n-\nMillie Bobby Brown, 21, and Jake Bongiovi, 23, bond with baby daughter in NYC... days after announcing adoption\n-\nEmily Ratajkowski showcases her curves in leather dominatrix inspired lingerie\n-\nStrictly Come Dancing bosses deliver verdict on future of BBC show after a male star was arrested on suspicion of rape\n-\nSuperman actor Dean Cain, 59, brutally mocked for struggling through training course after signing up with ICE\n-\nWhy Scottish Mortgage is backing the future of banking for long-term profits\nSponsored\n-\nHidden detail in Kelly Clarkson's outfit which symbolizes 'healing and hope' after ex Brandon Blackstock's death\n-\nLily Collins' VERY famous father-in-law reveals he isn't a fan of her show Emily in Paris - but do YOU know who he is?\n-\nEastEnders star Cheryl Fergison reveals the devastating moment she found her husband in a 'dingy love nest' with another woman\n- Vogue Williams gives fans a glimpse at her early 40th birthday celebrations with family and friends Milestone celebration\n-\nPaul Merton reveals it 'felt natural' falling in love with third wife Suki Webster six months after becoming a widower\n-\nSir Elton John, Sir Rod Stewart and Jessie J join an array of music legends for tribute to 'funny and rude friend Steve Wright'\n-\nEXCLUSIVE\nIs 'Saint' Peter Andre REALLY an angel? Katie Price's ex mocked disabled son Harvey and told Junior not to kiss boys\n-\nPassenger princesses! Kate and Charlotte beam as Prince William drives family to church service in Balmoral\n- Bikini-clad Naomi Campbell, 55, shows off her age-defying physique as she enjoys a lavish trip to Ibiza She's still got it\n- Try Amazon Music Unlimited FREE for 30 days! Enjoy millions of songs, audiobooks and podcasts SHOPPING\n-\nVictoria and David Beckham look more smitten than ever after 26 years of marriage as they enjoy lunch with their children in Nerano\n-\nLove Island's Kaz Crossley and TOWIE's Elma Pazar among reality stars 'involved in horror crash'\n-\nMyleene Klass shows off her harp playing skills as accomplished musician performs at 'dear friend' Clare Patterson's wedding\n-\nJackie Woodburne doesn't look like this anymore! Neighbours star is unrecognisable as she ditches the brunette crop she's had for decades and reveals grey hair\n- Upgrade your home office with up to 50% off ergonomic desk chairs and standing desks (and we have an EXCLUSIVE extra code) SHOPPING\n- Queen's 20-year-old supercharged Range Rover sells for over ten times its typical market value at auction Pricey\n- Linda Robson reveals the real reason for major Loose Women changes amid fears for the show's future Speaking out\n-\nIconic supermodel's son shows he's inherited her chiseled looks as he's marched into court on assault charges\n-\nTyson Fury's daughter Venezuela, 15, goes Instagram official with 'mystery boyfriend' - and his profession runs in the family\n- Shoppers flocking to Tesco after price slash on 'DELICIOUS' award-winning £20 Irish cream liqueur that's giving Baileys a run for its money SHOPPING\n-\nThe Walking Dead star's son makes disturbing threat after being charged with assault\n-\nSuki Waterhouse treats fans to a raunchy performance as she takes to the stage in black fishnet tights and microscopic shorts\n- Jameela Jamil raises alarm over Serena Williams' weight loss drug promotion British star has blasted Williams\n-\nBritney Spears poses nude in new photo after sparking fan concerns over disheveled living conditions\n- Why pay full price? This hack lets small businesses lease top tech for as little as £2.16 per MONTH - and no, there's no catch! SHOPPING\n-\nLeigh-Anne Pinnock flashes her abs in a skimpy red bra as she she continues her tour of UK festivals with solo gig at Reading\n- TV host Jenni reveals secret to bikini body...no chips or crisps for 34 years! Still looking toned and trim\n- Tulisa wears a strapless lime bustier as she she returns to the spotlight at Manchester Pride Looking good\n-\nDating Naked line-up REVEALED: Controversial Married At First Sight star joins new series of Rylan Clark's show\n- Shiseido launches upgraded viral skincare - get 20% off plus a free gift with our exclusive code SHOPPING:\n-\nFeuding royal rivals William and Harry go to war. Sound familiar? CHRISTOPHER STEVENS reviews King & Conqueror\n- Zendaya says she loved getting to do 'normal' things during her time with fiancé Tom Holland in Scotland Close couple\n-\nEXCLUSIVE\nLuisa Zissman shares bikini snaps amid skinny-shaming row - after sparking debate for smashing kids' iPads\n-\nJeering Dragons' Den panel called my business a 'delusional disaster' - now I'm worth £40million!\n- Is YOUR mattress causing you sleepless nights? Don't miss out on the best Emma Sleep deals with up to 25% off - prices start at £50 SHOPPING\n- Pop star under fire as fans call out penis-shaped stage design on opening night of tour It got off to a very memorable start\n-\nPregnant Sophie Habboo accidentally posts full frontal picture of husband Jamie Laing to fans as they enjoy Bank Holiday weekend\n- Inside Kristin Cavallari's wild Las Vegas weekend The 38-year-old reality star splurged the cash during her lavish trip\n-\nJenni Falconer, 49, displays her flawless physique in a skimpy leopard-print bikini as she soaks up the sun during summer break\n-\nSelena Gomez's fiancé Benny Blanco is SLAMMED for purchasing $200 blueberries: 'I can't afford regular fruit'\n- Julianne Moore admits her wedding dress was a HUGE mistake after skipping tradition to wear white Big regret\n- Kylie Jenner gives rare update on beloved dog Norman that she got at age 17 She's had the pet since she was a teenager\n-\nAll the celebrities who have REVERSED their cosmetic surgery from Chloe Ferry to Molly-Mae Hague and even Victoria Beckham\n- A-list celebrities rush to check on Kyle Sandilands following reports 'he was off-air due to stroke' Worrying\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n-\nTaylor Swift's true feelings REVEALED over Kansas City Chiefs docuseries that explores Travis Kelce romance\n-\nMark Wright and Michelle Keegan put on a loved up display as they enjoy romantic date night at Coldplay's Wembley gig\n-\nEXCLUSIVE\nFormer Baywatch star Nancy Valen ditches Hollywood glamour in rare sighting - see her now\n-\nClaudia Schiffer shows support for her husband Matthew Vaughn's team by posing in a Brentford shirt\n- Gloria Estefan may sue Diddy accuser who name dropped her and husband Emilio The court officially dismissed all allegations\n-\nThe downfall of Marco Pierre White Jr: Son of Michelin star chef has shirked his upbringing to have multiple brushes with law\n-\nJosie Gibson admits she's 'stepped back' from TV work and reveals plans to live 'off-grid as humanly possible'\n-\nEXCLUSIVE\nWilliam Shatner, 94, and his ex-wife spark REMARRIAGE rumors as she steps out wearing huge diamond ring\n-\nBraless Myleene Klass heads to work in a bandeau top and mini skirt after Frankie Bridge broke her silence on their 'feud'\n-\nLady Gaga breaks down during concert after revealing what fiance said moments before she took the stage\n-\nCelebrities who have dated people who look JUST like their siblings with eerie similarities - but do you agree with the comparisons?\n-\nScarlett Thomas' staggering payday as her father Ryan insists she hasn't had a free ride - after nepo baby, 16, skipped GCSEs\n-\nCall me sweet and I'll tell you to f*** off: Dame Helen Mirren, 80, issues a very blunt response to 'condescending' comments about age\n-\nX Factor star who faced off with Simon Cowell looks unrecognisable after reinventing himself as a 'spiritual healer'\n-\n'Irresponsible' Sam Faiers and Billie Shepherd shock fans with their 'dangerous' holistic healthcare advice\n-\nMike Tindall reveals his 'sliding doors' moment when he first met Zara Tindall in 2003\n-\nDuncan James SPLITS from boyfriend after six years together as Blue singer shares post about 'growth' to fans amid heartache\n-\nAlec Baldwin shares sensual moment with wife Hilaria as couple reenact Dirty Dancing in what appears to be a desperate audition for DWTS\n-\nSerena Williams buries feud with Maria Sharapova with shock appearance as Russian enters tennis Hall of Fame\n-\nThe Hollywood stars you had no idea appeared on reality TV shows before they were famous\n-\nEXCLUSIVE\nThought the Biggest Loser was harsh? TV's self-declared 'lard police' Steve Miller insists he has 'no regrets' about his controversial Fat Families show\n-\nConor McGregor poses with 'yacht neighbour' David Beckham and sons Romeo and Cruz as UFC star hails football legend's 'dynasty'\n-\nColdplay's Chris Martin makes a cheeky swipe about the kiss-cam scandal before helping with a proposal and sharing sweet moment with autistic fan\n-\nFreddie Starr died 'penniless and estranged from his six children' as stranger stepped in to bring his body home from Spain and foot funeral bill\n-\nNelly Furtado, 46, delights fans with Noughties nostalgia as she storms the stage in a racy cut out top and mini skirt at the Big Feastival\n-\nSaturday Night Live boss Lorne Michaels says there will be a bloodbath of cast members within weeks\n-\nStacey Solomon and Joe Swash having another baby 'not off the table' following loved up display on luxurious family holiday\n-\nBobby Brazier, 22, 'is quitting showbiz and moving to India to pursue the Hare Krishna religion'\n-\nThis is just a saga now: Games critic Peter Hoskin checks out Echoes Of The End, an ambitious new video game from Iceland\n-\nThe exact treatments behind Karren Brady's transformation: The Apprentice star receives 'state-of-the-art technology for fat removal', says her very own cosmetic surgeon\n-\nLuisa Zissman reveals she smashed up her childrens' iPads in front of them because they 'p****d her off' - as controversial post sparks huge debate\n-\nNeighbours star Ian Smith shares major health update after being diagnosed with terminal lung cancer\n-\nOscar-winning actor looks unrecognisable in 90s comedy that has since become a cult classic - can YOU spot who he is?\n-\nRyan Thomas' nepo baby actress daughter Scarlett, 16, reveals she didn't sit her GCSEs\n-\nAlison Hammond, 50, is happier than ever with boyfriend David Putman, 28, and 'can't imagine her life without him as friends predict engagement'\n-\nEXCLUSIVE\nWas Hulk Hogan MURDERED? Estranged daughter Brooke has NEW information amid police investigation into death... here's all the evidence\n-\nEXCLUSIVE\nVile plot against Kylie Jenner with two-word code name... orchestrated by Timothee Chalamet's die-hard fans who say it's punishment for doing the unthinkable\n-\nUniversity Challenge's most memorable players: From irritating habits to disastrous blunders and wise cracks, the BBC boffins who stole the show\n-\nJacqueline Jossa and hubby Dan Osborne enjoy family holiday - months after a make-or-break getaway saved their marriage following brief split\n-\nMaya Jama 'considers moving to Manchester to be closer to footballer boyfriend Ruben Dias' as romance becomes more serious\n-\nStrictly Come Dancing gets 'major format shake-up' for this year's series that could 'disrupt chemistry' between celebrity and pro dance partners\n-\nStrictly Come Dancing star arrested on suspicion of rape in fresh blow for scandal-hit show just weeks before series returns to screens\n-\nNick Ferrari, 66, marries longtime love Clare surrounded by celeb pals including Piers Morgan, Myleene Klass and Christopher Biggins in idyllic venue in the south of France\n-\nKENNEDY: Shame on Serena Williams! She may be starving herself on prescription anorexia drugs. But this putrid stunt proves she's still a greedy beast\n-\nNetflix fans rave over 'simply fantastic' period drama hailed as 'a beautiful piece of storytelling' with huge Hollywood star in lead role\n-\nEXCLUSIVE\nFlorence Pugh's brother Toby Sebastian who starred in Game of Thrones has drastic new career change\n-\nThe tale of two Taylors! From Hollywood showmances to rebelling against studios - the incredible parallels between Taylor Swift and Elizabeth Taylor\n-\nNetflix fans gripped by 'harrowing and nightmarish' Vanessa Kirby sex work thriller - gushing over her 'powerhouse performance'\n-\nArnold Schwarzenegger's son Chris is unrecognizable in shockingly thin appearance after weight loss... see him now\n-\nAbbey Clancy wows in a bikini as she poses with husband Peter Crouch and their four children during idyllic summer holiday\n-\nKing Charles and Queen Camilla tell of 'deepest admiration for the unbreakable courage and spirit of the Ukrainian people' in Independence Day letter\n-\nMillie Bobby Brown weighs in on letting her kids pursue acting in resurfaced clip... after adopting baby girl at just 21\n-\nSopranos star Jerry Adler dies at 96: Late-blooming actor worked with Woody Allen and appeared on The Good Wife\n-\nEXCLUSIVE\nHome And Away tease the return of iconic couple Brax and Ricky after a decade away from Aussie soap\n-\nEXCLUSIVE\nI was the resident therapist on Celebrity Fit Club, the stars binged on pizza after weigh-ins and one was sacked after getting a gastric band mid-series\n-\nJack Osbourne honours late father Ozzy with heartfelt tribute in rare public appearance... one month after rock legend's death at 76\n-\nBradley Cooper, 50, and Gigi Hadid, 30, jet out for getaway together as age-gap romance heats up\n-\nEXCLUSIVE\nPride and Prejudice first look: Jack Lowden and Emma Corrin transform into Mr Darcy and Elizabeth Bennett for heated first scenes\n-\nMeghan and Harry's Michelin-starred wedding chef who features in new Netflix series reveals duchess's secret kitchen skills\n-\nEXCLUSIVE\nRaye forced to halt her performance as a fan collapses in the crowd at All Points East Festival\n-\nFKA Twigs puts on a very racy performance at All Points East after being drafted in as last minute replacement for Doechii\n-\nMeghan Markle's high street capsule wardrobe revealed: From staple crisp shirts to her go-to ballet flats\n-\nI'm A Celebrity star Dean McCullough speaks out as police investigate sick death threats\n-\nBrooks Nader's ex Gleb Savchenko seen on DWTS set after she claimed he was 'fired'\n-\nEXCLUSIVE\nTaking the Michael! ITV chiefs throw cash at comedian McIntyre in bid to nab him from BBC... but hit a snag because super-rich comic only cares about ratings\n-\nKylie Jenner's mini-me daughter Stormi steals the spotlight in her first commercial for mom's makeup\n-\nLil Nas X stripped completely nude on street before LA arrest in shocking new footage\n-\nLeigh-Anne Pinnock puts on an X-rated display as the former Little Mix star headlines Pride in Manchester\n-\nCoronation Street bosses face backlash for casting actor 'who broke another man's eye socket' as upcoming storyline reflects real life\n-\nLiam Gallagher extends major olive branch to his brother Noel during Oasis reunion tour - after years of feuding\n-\nGrief-stricken Kelly Clarkson appears shaken as she's seen for FIRST TIME since tragic death of ex-husband Brandon Blackstock\n-\nTALK OF THE TOWN: Moving in the right direction - Harry Styles set to start work on mega-mansion\n-\nSophie Turner reveals why she will never leave the UK again after moving back to London following divorce from ex Joe Jonas\n-\nJennifer Garner appears fresh-faced on solo outing after her kids celebrate dad Ben Affleck's low-key birthday\n-\nGRIFF RHYS JONES: My night with four young people (I paid, of course)...and why, in spite of all their witless opinions, I deplore the way their futures are being stifled\n-\nKatie Price displays her surgically-enhanced assets in a grey top as she steps out in London amid bitter feuds with her exes\n-\nEXCLUSIVE\nNew series depicts Princess Diana as an American mom with an addict daughter in Arizona - but friend behind the show insists he's not cashing in on her memory: KATIE HIND\n-\nEastEnders star Cheryl Fergison, 59, reveals she has suffered a worrying stroke - amid financial struggles\n-\n'Oh she's out!' Michelle Keegan lets her hair down as she posts selfie with a beer before partying at Coldplay's Wembley gig\n-\nLovely jubbly! Sir David Jason, 85, is in great spirits as he's mobbed by fans before his new show at Manchester's Lowry Theatre\n-\nMAFS UK expert Charlene Douglas in a wheelchair after being rushed to hospital as she gives health update\n-\nGeorgia Toffolo flaunts her toned abs in a skimpy white bikini as she shares snaps from sun-soaked holiday\n-\nJowita Przystal celebrates her birthday on wild night out as Pete Wicks shows off the moves she taught him on Strictly after pair reignited romance rumours\n-\nSam Thompson shows off new physique as he poses with equally buff brother-in-law Ryan Libbey after crashing sister Louise's family holiday\n-\nDid William the Conqueror really have an Asterix moustache? No, say historians - and that's just one of BBC blockbuster's howlers\n-\nKhloe Kardashian nearly upstages her friend at her birthday party as fans go wild over her 'amazing' look\n-\nJeremy Clarkson checks out the competition! Star samples a Britpop lager as he takes a break from his Cotswolds farm duties to enjoy Blur star Alex James' festival\n-\nEmily in Paris resumes filming in Venice two days after Netflix show's 'assistant director collapses and dies' in front of horrified crew\n-\nKylie Jenner gets roasted AGAIN after reposting snaps from her most-hated fashion shoot\n-\nThe dark past of William and Kate's 'forever home': Slavery links, an equerry who blew his brains out and a royal break-up...\n-\nThe Kooks frontman Luke Pritchard reveals why Rebel Wilson joined the band on stage and admits they only rehearsed an hour before\n-\nStunning wealth of Coco Gauff, 21, revealed as she's named the world's highest-earning female athlete\n-\nNepo baby son of Walking Dead star and 90s iconic supermodel arrested for assault\n-\nDua Lipa turns 30! Hitmaker sizzles in a sheer halter dress as she celebrates milestone birthday with intimate dinner while paying tribute to parents\n-\nSydney Sweeney who? Awards panel unveils 25 greatest films list with stars over 60 amid Hollywood's youth obsession\n-\nClaudia Schiffer sports a football shirt as she cheers on Brentford with husband Matthew Vaughn at the Gtech Community Stadium - after filmmaker invested in Premier League club\n-\nSophie Ellis Bextor stuns in glitter mini dress she makes surprise appearance at Reading Festival to perform Murder on the Dancefloor\n-\nAnd Just Like That... woke storylines killed the SATC reboot: From Miranda's 'late life lesbianism' to Charlotte's family gender issues - the moments that left viewers cringing\n-\nI met Amanda Holden when the Britain's Got Talent cameras weren't rolling - she showed her true colours straight away\n-\nLove Island's Yasmin Pettet reveals emotional reason she 'hasn't been intimate' with boyfriend Jamie Rhodes after leaving the villa\n-\nCountry superstar says chance meeting with Taylor Swift at Travis Kelce's charity camp lit up collab hopes\n-\nEXCLUSIVE\nSecret Lives of Mormon Wives explodes with lesbian twist as stars KISS in steamy first look at Season 3\n-\nImpossible contestant sent home empty-handed after struggling with a Harry Potter question on axed BBC show - but could YOU have guessed it?\n-\nBBC star Michael Ball reveals his mother has died as devastated singer is flooded with support by fans\n-\nSydney Sweeney's Americana director defends flop after box office crash\n-\nQueen Camilla is stylish in blue as she steps out at the final day of the York races\n-\nVicky Pattison leaves fans 'horrified' as she lets a dog lick her mouth in 'stomach churning' clip\n-\nBrookside legend Sue Johnston set to reprise iconic role after 35 years in historic Hollyoaks crossover\n-\nDrake back in bed with Bobbi Althoff after viral feud as they tease new project\n-\nLeona Lewis reveals how motherhood has changed her - as she gears up for her first-ever Las Vegas residency"
    },
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/lenny-kravitz/index.html",
      "text": "Advertisement\nRELATED TOPICS FOR Lenny Kravitz\nLenny Kravitz - Latest news, views, gossip, photos and video\nPage\nZoe Kravitz sparks concern over shockingly thin appearance as she steps out in NYC after surprise Emmy nom\n20/07/25 04:42\nZoe Kravitz has sparked fan concern over her 'thin' appearance as she enjoyed an outing in NYC this week. The Batman actress, 36 - who has been romantically linked to hunky actor Noah Centineo - kept busy on Thursday in the Big Apple while putting on a leggy display in a stylish look. However, some social media users voiced worry over the star's slim figure in the comment section of an Instagram post shared by gossip site DeuxMoi....read\nInsider reveals the TRUTH about Ryan Seacrest's new pictures\n02/07/25 13:27The American Idol host surprised fans with his slimmed down physique, but insiders insist there's nothing to worry about.Lauren Sanchez fangirls over Met Gala outfits after Jeff Bezos connection stopped her attending\n07/05/25 14:37Despite not making the list, Lauren hasn't shied away from applauding all her A-list friends' outfits.Zoe Kravitz looks almost unrecognizable with ultra glam appearance at Oscars pre-party\n01/03/25 08:28Zoe Kravitz revealed a soft makeover while attending the Saint Laurent x Vanity Fair pre-Oscars dinner on Friday evening. She modeled a dress with a plunging neckline and asymmetric hem.Zoe Kravitz wears earrings reminiscent of her engagement ring at 2025 Golden Globes after Channing Tatum split\n06/01/25 01:22Zoe Kravitz made a statement with her jewelry while attending the 2025 Golden Globes on Sunday.Lenny Kravitz ghosted Cynthia Bailey after asking for her number, the RHOA star reveals\n04/11/24 06:00Real Housewives of Atlanta star Cynthia Bailey is spilling some tea on an encounter with famed rock star Lenny Kravitz .Zoe Kravitz and Channing Tatum have 'no bad blood' between them as they call off engagement\n02/11/24 00:34Zoë Kravitz and Channing Tatum have been in touch with each other since they broke up earlier this week. The couple had been together for three years and were engaged to be married.A look back at Channing Tatum and Zoe Kravitz's hot romance including last bedroom selfie before shock split\n30/10/24 03:00Channing Tatum and Zoe Kravitz have ended their engagement as the pair officially split following a three-year romance - and DailyMail.com takes a look back at their relationship.Is a romance brewing between Kylie Minogue and Lenny Kravitz? 'Sparks fly' as pair reunite at the Singapore Grand Prix\n30/09/24 03:39Kylie Minogue and Lenny Kravitz reunited at the Formula 1 Grand Prix in Singapore last week.Lenny Kravitz, 60, stuns fans with his VERY youthful appearance at Paris Fashion Week - so is his unusual diet and skin care routine the reason?\n26/09/24 09:12The rockstar stepped out at the Saint Laurent's womenswear show at Paris Fashion Week on Tuesday, alongside his 35-year-old daughter, actress Zoë Kravitz.Zoe Kravitz joins dad Lenny at the Saint Laurent womenswear show\n25/09/24 10:58Preview text goes hereZoe Kravitz and Kate Moss share a sweet interaction as the excited actress sits beside the supermodel on the Saint Laurent front row at Paris Fashion Week\n25/09/24 07:58The pair were among those in attendance at the star-studded Saint Laurent's Ready To Wear womenswear show in Paris on Tuesday.Zoë Kravitz, 35, goes braless beneath a sheer minidress as she joins musician dad Lenny, 60, at the Saint Laurent womenswear show during Paris Fashion Week\n25/09/24 00:30The Catwoman actress, 35, sent pulses racing as she attended the fashion event wearing a black lace mini dress.From Meagan Good to Lenny Kravitz - here's why celebs are going celibate and what health benefits are behind the lifestyle\n23/09/24 18:56More Americans than ever are taking cues from celebrities and abstaining from sex to improve their health in other ways, a trend that, while divisive, has some real health benefits.Kylie Minogue makes a stylish appearance at the Singapore Grand Prix in a green cargo jumpsuit after performing live ahead of her new tour\n22/09/24 20:10The singer rocked the pocketed long-sleeve garment with black boots, and later was seen putting on a very radiant display while waving the chequered flag at the end of the race.Lenny Kravitz dedicates 2024 MTV VMA to late mother Roxie Roker\n12/09/24 03:28The singer-songwriter, 60, looked back more than three decades as he collected the honors at the UBS Arena in Elmont, New York.Halsey stuns in red and black gown that matches her red hair before performing at 2024 VMAs\n12/09/24 00:57Halsey was a stunning lady in red while hitting the red carpet for the 2024 VMAs in New York City.Zoe Kravitz sweetly holds hands with dad Lenny Kravitz after taping The Drew Barrymore Show in New York City\n06/09/24 03:47While leaving the taping of The Drew Barrymore Show, the Catwoman star, 35, put on a stylish display in a casual ensemble featuring a colorful top.Zoë Kravitz reveals the inspiration behind her provocative thriller Blink Twice\n04/09/24 15:30Zoë Kravitz shed light on what inspired her to start writing her psychological thriller, Blink Twice, which examines the power dynamics between men and women.Channing Tatum says fiancee Zoe Kravitz is a 'nerd for movies' while praising her filmmaking skills in directorial debut\n23/08/24 11:51Channing Tatum says fiancee Zoe Kravitz is a 'nerd for movies' while praising her filmmaking skills in directorial debutMegan Thee Stallion announced as host for 2024 MTV VMAs - but not everyone is happy about it\n22/08/24 18:14Megan Thee Stallion has been announced as the host for next month's MTV Video Music Awards - but not all fans are happy about it.Channing Tatum calls fiancée Zoë Kravitz 'nerd for movies' while praising her filmmaking skills in directorial debut Blink Twice on NBC talk show\n22/08/24 08:01Channing Tatum, 44, called his fiancée Zoë Kravitz, 35, a 'nerd for movies' on Wednesday while praising her directorial debut Blink Twice on Late Night with Seth Meyers.Lenny Kravitz and Halsey added to list of performers for upcoming 2024 MTV VMAs... along with newcomers Benson Boone and Blackpink's Lisa\n22/08/24 03:42Lenny Kravitz, Halsey, Benson Boone, and Blackpink's Lisa were all added to MTV VMAs lineup that will hit the big stage at USB Arena in Long Island, New York on September 11.Channing Tatum calls future father-in-law Lenny Kravitz 'pops' - as Magic Mike star smooches Zoe at Blink Twice photocall\n18/08/24 17:21Channing Tatum threw some love in the direction of his future father-in-law, rock god Lenny Kravitz. He shared a photo of Lenny performing and captioned the post: 'Let's go pops!!!'Zoe Kravitz gets candid about 'hurtful' decision to move in with father Lenny Kravitz after split from mom Lisa Bonet\n15/08/24 02:19Zoe Kravitz, 35, opened up during a candid discussion about the 'hurtful' choice to move in with her father, Lenny Kravitz, after splitting from mother, Lisa Bonet.Zoe Kravitz wows in lace look for Esquire - as she reacts to iconic meme of her riding the back of Channing Tatum's bike\n14/08/24 15:23Zoe Kravitz stunned on the cover of the September issue of Esquire magazine.Zoe Kravitz stars in a VERY racy YSL video where she flashes her butt in thongs, touches herself, smokes, drinks and romances Jeremy Allen White\n11/07/24 17:05Zoe Kravitz was seen in a new ad campaign for French fashion house Yves Saint Laurent with The Bear star Jeremy Allen White.Zoe Kravitz says she wanted to title her forthcoming film P***y Island instead of Blink Twice 'but we're not there yet' as a society\n10/07/24 06:03Zoe said she didn't want to jeopardize the film's commercial potential with a title that could be considered too provocative for mainstream audiences.Lenny Kravitz, 60, cruises around Paris with a mystery woman in a gold car after admitting he's been celibate for nine years\n09/07/24 09:18The 60-year-old rocker looked typically stylish in a double denim ensemble as he stepped out of his gold car for a photo.Gavin Rossdale, 58, shows off his incredibly ripped physique - following in the footsteps of rocker Lenny Kravitz, 60\n26/06/24 22:57Bush rocker Gavin Rossdale sent his fans into a frenzy after showing off his rippling abs in his latest Instagram post on Tuesday afternoon.Paris Hilton wows in a baby blue broderie midi dress as she joins glamorous Jessica Alba at dinner party during Cannes Lions event\n19/06/24 08:36Paris Hilton and Jessica Alba were dressed to impress on Tuesday as they attended a lavish dinner party during the Cannes Lions International Festival of Creativity.Lenny Kravitz, 60, goes viral again with shirtless workout video… after admitting he's been CELIBATE for nine years\n17/06/24 07:17Lenny Kravitz, 60, shared a shirtless workout video on social media while preparing for his upcoming concert tour.Tiffany Haddish reveals how she came on to Leonardo DiCaprio (and was NOT shy at all!): 'I told him \"I want to f**k\"'\n07/06/24 17:25'When I first met him, I told him, \"I want to f**k, but only if you are your character out of What's Eating Gilbert Grape,' Tiffany recounted.Ice-T, 66, labels Lenny Kravitz's nine-year celibacy 'weirdo s***' after singer revealed he hasn't dated for nearly 10 YEARS while embracing spirituality\n31/05/24 06:47Ice-T, 66, shared his candid thoughts on Lenny Kravitz's recent revelation that he has been celibate for nine years - and labeled the choice as 'weirdo s***.'Lenny Kravitz is open to making music with actress daughter Zoe but says it 'would have to be an organic creative experience' - as he talks upcoming Las Vegas residency\n30/05/24 23:38Lenny Kravitz says he would 'love' to make music with his daughter Zoe Kravitz in the near future.Lenny Kravitz, 60, reveals he's celibate and hasn't dated for nine years after turning his back on rock excess and embracing spirituality because he was 'becoming a player'\n30/05/24 09:53Forever viewed as the archetypal rock sex-symbol, Kravitz admits he's on a newfound spiritual journey after turning his back on music industry excess.Lenny Kravitz rings in 60th birthday and celebrates new album release with ex-wife Lisa Bonet and daughter Zoe Kravitz at star-studded bash in Paris\n25/05/24 23:41Kicking off the weekend ahead of turning 60 on May 26, the singer-songwriter was seen arriving at the Hôtel de Crillon in the City of Love alongside a mystery woman on his arm.Sacha Baron Cohen cuts a solo figure as he heads to Lenny Kravitz's 60th birthday party in Paris - while his estranged wife Isla Fisher films Bridget Jones 4 across the Channel in London\n25/05/24 21:25The actor, 48, was seen arriving at Lenny Kravitz's 60th birthday party in Paris for the first time since announcing his split from his estranged wife Isla Fisher, who is currently just across the channel.Gayle King, 69, gets flirty with Lenny Kravitz, 59, as she jokes if he has a girlfriend she will 'beat her a**' in interview about his new album\n24/05/24 03:53Gayle King got flirty when she asked Lenny Kravitz whether he has a 'significant other in his life'and And can I beat her a** if she is?'Lenny Kravitz, 59, showcases his chiseled abs while doing shirtless pull-ups in JEANS... after explaining why he wears leather pants to the gym\n09/05/24 20:29Lenny Kravitz showed that age has little impact on his sculpted physique when he shared a video of himself doing some impressive pull-ups on Thursday.Lenny Kravitz, 59, explains the reason why he wears leather pants and boots during gym workouts\n02/05/24 07:31Lenny Kravitz explained why he sometimes wears tight leather pants, boots and sunglasses during a workout at the gym, three weeks after his video of a workout on a benchpress went viral.Eric B. & Rakim unbothered by exclusion from 2024 Rock and Roll Hall of Fame after nomination: 'Keep voting ... we'll join you soon!'\n23/04/24 02:00The Long Island, New York-based duo held out hope their day is coming, as they were nominated this year.Lenny Kravitz, 59, left Rita Moreno, 92, so giddy when they met that she 'nearly peed my britches'\n18/04/24 20:40Rita introduced herself to Lenny at the Vanity Fair Oscar Party last month, prompting him to fall to his knees and start gushing about the fact that he had 'admired' her since he was a child.Lenny Kravitz, 59, exudes youthful magnetism as he goes SHIRTLESS to shows off sculpted physique while plugging new album\n16/04/24 22:15The Are You Gonna Go My Way hitmaker went shirtless while promoting the vinyl edition of his upcoming album Blue Electric Light, which is slated for release on May 24.Lenny Kravitz hilariously trolled by fans for working out in leather trousers: 'Never breaks character'\n10/04/24 00:41His fans reacted with hilarity, writing comments such as: 'Who trains in leather pants ??? Only Lenny does,' interspersed with crying laughing emoji and: 'Lenny is himself at all times.'Lenny Kravitz gives approval to daughter Zoë Kravitz roasting him during his Hollywood Walk of Fame ceremony while promoting new album\n21/03/24 06:18Lenny Kravitz, 59, gave his approval to daughter Zoë Kravitz, 35, roasting him during his Hollywood Walk of Fame ceremony on Wednesday on The Tonight Show Starring Jimmy Fallon.Zoe Kravitz bundles up in a red hoodie while smoking a cigarette on a loading dock with a friend in New York City\n18/03/24 19:57Zoë Kravitz looked effortlessly cool in a long beige coat, layered over a bright red hoodie, while out with a friend in New York City on Monday.Channing Tatum leaves hilarious comment on future father-in-law Lenny Kravitz's steamy shirtless photo\n18/03/24 01:02On Friday, the 43-year-old actor joked that his future father-in-law, 59, would 'hurt someone' with the steamy snap showing off his ripped physique and toned abs.Lenny Kravitz, 59, showcases very impressive physique as he goes shirtless in social media snap... after daughter Zoe roasted him at his Hollywood Walk of Fame ceremony\n15/03/24 23:03On Friday, Lenny Kravitz, 59, put on a pair of very well-fitting, low-rise, artfully ripped jeans and a pair of sunglasses and headed out into nature, shirtless and shoeless as he looked up at the sun,Lenny Kravitz talks turning 60 and going nearly nude for his TK421 music video: 'It's all about longevity now'\n13/03/24 16:21The four-time Grammy winner celebrates his milestone birthday on May 26 and he's finally 'feeling very comfortable exactly where I am'Zoe Kravitz sweetly holds hands with fiance Channing Tatum as she attends dad Lenny Kravitz's Hollywood Walk of Fame ceremony\n12/03/24 21:57The couple couldn't have looked any happier as they attended Lenny's monumental ceremony on Tuesday in the heart of Hollywood.Lenny Kravitz embraces daughter Zoe Kravitz and BFF Denzel Washington at his star-studded Hollywood Walk of Fame ceremony\n12/03/24 20:48Lenny Kravitz was joined by his beloved daughter Zoe Kravitz and Denzel Washington as he was honored with a star on the Hollywood Walk of Fame on Tuesday.Jeff Bezos' fiancée Lauren Sanchez looks red hot in plunging sheer gown as they mingle with Kim Kardashian, Sofia Vergara and Lenny Kravitz at Vanity Fair's Oscars after-party\n11/03/24 06:15Jeff Bezos and his fiancé Lauren Sanchez were seen lighting up the red carpet a the 2024 Vanity Fair Oscars after-party.Lenny Kravitz and Hannah Waddingham lead celebrity tributes to fashion icon Iris Apfel who has died aged 102\n02/03/24 05:11The news was announced on her Instagram Friday, with a photo of her in a regal black and gold gown and her signature black glasses. 'Iris Barrel Apfel, August 29, 1921 - March 1, 2024,' read the caption.People's Choice Awards 2024: Kylie Minogue, 55, looks youthful in an emerald frock before giving a captivating performance of Grammy-winning song Padam Padam\n19/02/24 07:29Kylie Minogue, 55, turned heads while donning an emerald gown as she attended the 2024 People's Choice Awards in Santa Monica on Sunday before performing at the event.People's Choice Awards 2024: Lenny Kravitz performs an electrifying medley of his greatest hits and is honored with the Music Icon Award\n19/02/24 04:04The 59-year-old singer was honored for his impact in music before performing a medley of some of his greatest hits at the award ceremony held at the Barker Hangar in Santa Monica, California.Cher, Mariah Carey, Lenny Kravitz, Ozzy Osbourne and Sinéad O'Connor are among Rock & Roll Hall of Fame 2024 nominees\n10/02/24 23:50The nominations are in for the Rock and Roll Hall of Fame's 2024 class and the 15 nominees represent several genres of music. Inductees will be announced in late April.Red carpet rocks! From Lenny Kravitz to Ice Spice, the cross returns as a style choice with the music industry's biggest names at the Grammys\n05/02/24 20:54The music industry's biggest names shone bright at the Grammy Awards last night in Los Angeles, with cross necklaces being the trendiest bling of the night.Beyonce drops a sizzling gallery of snaps from the Grammys in her Louis Vuitton cowgirl look WITHOUT husband Jay-Z - after he attacked the awards for not honouring his wife\n05/02/24 12:55Beyonce has shared a slew of incredible snaps of her cowgirl-inspired outfit from Sunday night's Grammy Awards - but her husband did not feature in any of them.Jay-Z reopens the Beyonce vs Taylor saga as he attacks the Grammys for never awarding his wife Album Of The Year - while Swift has received four - 14 years after Kanye West disrupted the VMAs with a similar outburst\n05/02/24 10:08In a move that viewers claimed was reminiscent of Kanye West 's infamous 2009 MTV VMAs speech , Jay-Z launched into an impassioned rant during Sunday's ceremony.Lenny Kravitz is fine at 59! Rock star flashes his SIX-PACK in sheer black top and skinny leather pants at Grammys\n05/02/24 07:03Lenny Kravitz, 59, put his upper body muscles on display in a sheer black shirt on Sunday at the 2024 Grammy Awards in Los Angeles.Lenny Kravitz, 59, stays close to Charlotte Lawrence, 23, while leaving a pre-Grammys party at The Bird Street Club in West Hollywood\n04/02/24 20:48Lenny Kravitz was joined by Charlotte Lawrence while leaving The Bird Street Club in West Hollywood on Saturday evening. The 59-year-old performer and the 23-year-old singer stayed close.Fans are stunned after finding out who Lenny Kravitz's famous mother is\n04/02/24 17:13Fans were stunned after finding out why Lenny Kravitz 's famous mother is. In the new People cover story, the singer talked about his mother, who was a TV star.Megan Thee Stallion, Janelle Monáe, Paris Hilton and Lana Del Rey get glam in stunning ensembles to lead the stars at Clive Davis' iconic Pre-GRAMMY Gala\n04/02/24 04:10Dua Lipa stole the spotlight at Clive Davis' Pre-GRAMMY Gala in Los Angeles on Saturday night. The Houdini hitmaker looked like she stepped off the runway in a red leather trench coat.New mom Halle Bailey looks sensational as she joins Lenny Kravitz and Kelsea Ballerini at glitzy pre-Grammy event in LA\n03/02/24 00:48The 23-year-old new mom, 59-year-old rock star and 30-year-old country singer all brought their individual sense of style to the red carpet.Lenny Kravitz says he still loves ex-wife Lisa Bonet and she is a 'part of my life that will never leave'... after divorcing 30 years ago\n02/02/24 19:03The 59-year-old performer was thrust into the spotlight after he began seeing the actress in the mid-1980s, and they maintained a high-profile romance for nearly a decade.Lenny Kravitz shows off his rock star credentials in black leather pants and croppped jacket as he receives Global Impact Award during annual pre-Grammy event in LA\n02/02/24 08:02Lenny Kravitz shows off his rock star credentials in black leather pants and cropped jacket as he receives Global Impact Award during annual pre-Grammy event in Los Angeles.Mariah Carey's bum note! Diva suffers fashion fail in crotch-flashing gold corset with huge booty bustle as she leads stars at 2024 Recording Academy Honors Presented By The Black Music Collective\n02/02/24 06:43Mariah Carey wore a head-turning outfit on Thursday, as she lead stars at the third annual Recording Academy Honors in Los Angeles.Jason Momoa shows off his musclebound arms in a clinging tank top while leaving a sushi restaurant in Los Angeles\n25/01/24 18:19The Aquaman heartthrob's latest steamy sighting came in the wake of claims that Jason enjoys a 'good friendship' with Lenny Kravitz after his split from their mutual ex-wife Lisa Bonet.Jason Momoa still enjoys 'good friendship' with Lenny Kravitz after Lisa Bonet split... and the two men 'hugged' and were seen 'laughing and joking' at a recent party\n17/01/24 04:24'They were laughing and joking a lot. They hugged when they first saw each other and it was obvious they had a really good rapport,' said an insider who observed the two men at a party.Lenny Kravitz says he will NOT write a speech for daughter Zoe Kravitz's wedding to Channing Tatum... and he reveals the reason\n17/01/24 01:25Rumors began flying that Zoë and Channing were engaged after she attended a Halloween party with a massive diamond on her left hand ring finger. The news was quickly confirmed.Ariana DeBose's Hamilton co-star Anthony Ramos BLASTED for not defending her vocal prowess during THAT Critics Choice Awards joke\n15/01/24 18:30Much ado has been made over Bella Ramsey joking that Ariana was as an 'actor who thinks they're singer' while presenting the best song trophy during Sunday's Critics Choice AwardsInside the craziest moments of the Critics Choice Awards 2024: Ryan Gosling's instant meme moment, Ariana DeBose's rage at singing jab and Paul Giamatti's joke about THAT viral In-N-Out snap\n15/01/24 04:43Ryan Gosling 's hilarious confused reaction to his Barbie track I'm Just Ken winning Best Song at the Critics Choice Awards led the craziest moments at the awards show on Sunday.Ariana DeBose left FUMING as she's lumped into a joke about 'actors who think they are singers' at Critics Choice Awards - before star hits back: 'I didn't find it funny!'\n15/01/24 03:55Triple-threat actor, singer and dancer Ariana DeBose broke her silence over being lumped into a joke about 'actors who think they are singers' at the Critics Choice Awards.Jennifer Lawrence steps out for sushi at celeb-friendly Sushi Park with husband Cooke Maroney in Los Angeles\n13/01/24 19:23Jennifer Lawrence and her husband Cooke Maroney are enjoying a visit to Los Angeles this week. The New York-based couple met up with Emma Stone for some sushi at Sushi Park in West Hollywood.Emily Blunt proudly wears same suit Lenny Kravitz wore to Golden Globes for late night TV interview... but stays silent on THAT viral 'divorce' video\n12/01/24 07:56Emily Blunt opened up about deciding to wear the same jumpsuit with cutouts that Lenny Kravitz wore to the Golden Globes for her apperance on Late Night.Lenny Kravitz says he's 'blessed' to have a happy family amid daughter Zoë Kravitz's engagement to Channing Tatum\n05/01/24 07:02The singer-songwriter, 59, spoke about the relationship between Zoë, 35, and Tatum, 43, as news of their engagement went public about two months ago.Kim Kardashian shows off her VERY trim waist as she joins Kendall Jenner, Ivanka Trump at Justin Timberlake concert in Vegas Grand Opening\n14/12/23 18:08Kim Kardashian showcased her jaw-dropping physique in a figure-hugging black dress while attending Justin Timberlake's invite-only show in Las Vegas.Tom Brady looks handsome in suit as he rubs shoulders with A-listers at grand opening of $3.7bn Fontainebleau hotel in Las Vegas... after rekindling romance with Irina Shayk\n14/12/23 15:38The 46-year-old NFL legend was just one of the many A-listers in attendance at the launch of Fontainebleau Las Vegas - the newest upscale resort in Sin City.Matthew Pritzker, billionaire cousin of Illinois governor is dumped from glitzy L.A. Biden fundraiser as the Dem mega-donor prepares to appear in New York court to face sex assault charges\n07/12/23 19:28The 41-year-old was one of dozens of wealthy Biden supporters named as a co-host of the event in LA on Friday. But his name now has been quietly dropped from the lineup amid sexual assault allegations.\nPage\nDON'T MISS\n-\nRio Ferdinand, 46, and wife Kate, 33, reveal they have moved to Dubai with their family as they show off their lavish mansion\n-\nCruz Beckham shares an intimate moment with Jackie Apostel after joining shirtless dad David aboard their lavish yacht\n-\nEmma Watson potters around in a sheer lace dress as she joins her hunky personal trainer for a hike in Saint Tropez\n-\nEXCLUSIVE\nI was desperate to know what this model got up to with England star. Now I've discovered truth, reveals KATIE HIND\n-\nSting is being sued for 'MILLIONS of pounds in lost royalties' by former bandmates in The Police\n-\nBeaches, history, waterparks, golf... Turkey (Türkiye) has it all: Here's why you'll never want to leave\nAd Feature\n- Selena Gomez stuns in black swimsuit on yacht for bachelorette party in Cabo... but was BFF Taylor Swift there? Looking good\n-\nWas this earliest sign of cracks forming between Meghan and Kate? Expert reveals signs that 'Fab Four' weren't getting on\n-\nEXCLUSIVE\nThe dark truth of Club Chalamet: She's a 58-year-old Timothée obsessive who HATES Kylie Jenner\n-\nCould an app really make you better with money? Putting a smart money app to the test\nAd Feature\n-\nBrooklyn Beckham and Nicola Peltz give fans a glimpse of their 'perfect Sunday' as couple unwind after family 'snub'\n-\nMeghan Markle 'placed status above reality' and struggled to separate her own image from Suits character, claims royal author\n-\nBobby Brazier's love for Hare Krishna: From finding happiness through religion after tragic start - as soap star 'quits showbiz'\n- Zoe Kravitz seen arm-in-arm on romantic stroll in Rome with Harry Styles after getting cozy with Austin Butler See the pic\n-\nGet your autumn on! From pumpkin throws to cosy hot chocolate mugs, here's our pick of homeware for the new season\nAd Feature\n-\nFrom Princess Margaret's sadistic streak to Meghan 'berating a gardener' - the most ill-mannered royals revealed\n-\nWhy Millie Bobby Brown, 21, decided to shun Hollywood in favour of farm life in a nod to her British roots as she adopts a baby\n- I Dream of Jeannie star Barbara Eden turns 94 and looks more glamorous than ever... see her now All change\n-\nMum's the word! George, Charlotte and Louis join William and newly blonde Kate for church service in Balmoral\n-\nFrom auctions to EVs: 5 brilliant motoring brands every driver should know - from finance fixes to stunning electric SUVs\nAd Feature\n-\nMillie Bobby Brown, 21, and Jake Bongiovi, 23, bond with baby daughter in NYC... days after announcing adoption\n-\nEmily Ratajkowski showcases her curves in leather dominatrix inspired lingerie\n-\nStrictly Come Dancing bosses deliver verdict on future of BBC show after a male star was arrested on suspicion of rape\n-\nSuperman actor Dean Cain, 59, brutally mocked for struggling through training course after signing up with ICE\n-\nWhy Scottish Mortgage is backing the future of banking for long-term profits\nSponsored\n-\nHidden detail in Kelly Clarkson's outfit which symbolizes 'healing and hope' after ex Brandon Blackstock's death\n-\nLily Collins' VERY famous father-in-law reveals he isn't a fan of her show Emily in Paris - but do YOU know who he is?\n-\nEastEnders star Cheryl Fergison reveals the devastating moment she found her husband in a 'dingy love nest' with another woman\n- Vogue Williams gives fans a glimpse at her early 40th birthday celebrations with family and friends Milestone celebration\n-\nPaul Merton reveals it 'felt natural' falling in love with third wife Suki Webster six months after becoming a widower\n-\nSir Elton John, Sir Rod Stewart and Jessie J join an array of music legends for tribute to 'funny and rude friend Steve Wright'\n-\nEXCLUSIVE\nIs 'Saint' Peter Andre REALLY an angel? Katie Price's ex mocked disabled son Harvey and told Junior not to kiss boys\n-\nPassenger princesses! Kate and Charlotte beam as Prince William drives family to church service in Balmoral\n- Bikini-clad Naomi Campbell, 55, shows off her age-defying physique as she enjoys a lavish trip to Ibiza She's still got it\n- Try Amazon Music Unlimited FREE for 30 days! Enjoy millions of songs, audiobooks and podcasts SHOPPING\n-\nVictoria and David Beckham look more smitten than ever after 26 years of marriage as they enjoy lunch with their children in Nerano\n-\nLove Island's Kaz Crossley and TOWIE's Elma Pazar among reality stars 'involved in horror crash'\n-\nMyleene Klass shows off her harp playing skills as accomplished musician performs at 'dear friend' Clare Patterson's wedding\n-\nJackie Woodburne doesn't look like this anymore! Neighbours star is unrecognisable as she ditches the brunette crop she's had for decades and reveals grey hair\n- Upgrade your home office with up to 50% off ergonomic desk chairs and standing desks (and we have an EXCLUSIVE extra code) SHOPPING\n- Queen's 20-year-old supercharged Range Rover sells for over ten times its typical market value at auction Pricey\n- Linda Robson reveals the real reason for major Loose Women changes amid fears for the show's future Speaking out\n-\nIconic supermodel's son shows he's inherited her chiseled looks as he's marched into court on assault charges\n-\nTyson Fury's daughter Venezuela, 15, goes Instagram official with 'mystery boyfriend' - and his profession runs in the family\n- Shoppers flocking to Tesco after price slash on 'DELICIOUS' award-winning £20 Irish cream liqueur that's giving Baileys a run for its money SHOPPING\n-\nThe Walking Dead star's son makes disturbing threat after being charged with assault\n-\nSuki Waterhouse treats fans to a raunchy performance as she takes to the stage in black fishnet tights and microscopic shorts\n- Jameela Jamil raises alarm over Serena Williams' weight loss drug promotion British star has blasted Williams\n-\nBritney Spears poses nude in new photo after sparking fan concerns over disheveled living conditions\n- Why pay full price? This hack lets small businesses lease top tech for as little as £2.16 per MONTH - and no, there's no catch! SHOPPING\n-\nLeigh-Anne Pinnock flashes her abs in a skimpy red bra as she she continues her tour of UK festivals with solo gig at Reading\n- TV host Jenni reveals secret to bikini body...no chips or crisps for 34 years! Still looking toned and trim\n- Tulisa wears a strapless lime bustier as she she returns to the spotlight at Manchester Pride Looking good\n-\nDating Naked line-up REVEALED: Controversial Married At First Sight star joins new series of Rylan Clark's show\n- Shiseido launches upgraded viral skincare - get 20% off plus a free gift with our exclusive code SHOPPING:\n-\nFeuding royal rivals William and Harry go to war. Sound familiar? CHRISTOPHER STEVENS reviews King & Conqueror\n- Zendaya says she loved getting to do 'normal' things during her time with fiancé Tom Holland in Scotland Close couple\n-\nEXCLUSIVE\nLuisa Zissman shares bikini snaps amid skinny-shaming row - after sparking debate for smashing kids' iPads\n-\nJeering Dragons' Den panel called my business a 'delusional disaster' - now I'm worth £40million!\n- Is YOUR mattress causing you sleepless nights? Don't miss out on the best Emma Sleep deals with up to 25% off - prices start at £50 SHOPPING\n- Pop star under fire as fans call out penis-shaped stage design on opening night of tour It got off to a very memorable start\n-\nPregnant Sophie Habboo accidentally posts full frontal picture of husband Jamie Laing to fans as they enjoy Bank Holiday weekend\n- Inside Kristin Cavallari's wild Las Vegas weekend The 38-year-old reality star splurged the cash during her lavish trip\n-\nJenni Falconer, 49, displays her flawless physique in a skimpy leopard-print bikini as she soaks up the sun during summer break\n-\nSelena Gomez's fiancé Benny Blanco is SLAMMED for purchasing $200 blueberries: 'I can't afford regular fruit'\n- Julianne Moore admits her wedding dress was a HUGE mistake after skipping tradition to wear white Big regret\n- Kylie Jenner gives rare update on beloved dog Norman that she got at age 17 She's had the pet since she was a teenager\n-\nAll the celebrities who have REVERSED their cosmetic surgery from Chloe Ferry to Molly-Mae Hague and even Victoria Beckham\n- A-list celebrities rush to check on Kyle Sandilands following reports 'he was off-air due to stroke' Worrying\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n-\nTaylor Swift's true feelings REVEALED over Kansas City Chiefs docuseries that explores Travis Kelce romance\n-\nMark Wright and Michelle Keegan put on a loved up display as they enjoy romantic date night at Coldplay's Wembley gig\n-\nEXCLUSIVE\nFormer Baywatch star Nancy Valen ditches Hollywood glamour in rare sighting - see her now\n-\nClaudia Schiffer shows support for her husband Matthew Vaughn's team by posing in a Brentford shirt\n- Gloria Estefan may sue Diddy accuser who name dropped her and husband Emilio The court officially dismissed all allegations\n-\nThe downfall of Marco Pierre White Jr: Son of Michelin star chef has shirked his upbringing to have multiple brushes with law\n-\nJosie Gibson admits she's 'stepped back' from TV work and reveals plans to live 'off-grid as humanly possible'\n-\nEXCLUSIVE\nWilliam Shatner, 94, and his ex-wife spark REMARRIAGE rumors as she steps out wearing huge diamond ring\n-\nBraless Myleene Klass heads to work in a bandeau top and mini skirt after Frankie Bridge broke her silence on their 'feud'\n-\nLady Gaga breaks down during concert after revealing what fiance said moments before she took the stage\n-\nCelebrities who have dated people who look JUST like their siblings with eerie similarities - but do you agree with the comparisons?\n-\nScarlett Thomas' staggering payday as her father Ryan insists she hasn't had a free ride - after nepo baby, 16, skipped GCSEs\n-\nCall me sweet and I'll tell you to f*** off: Dame Helen Mirren, 80, issues a very blunt response to 'condescending' comments about age\n-\nX Factor star who faced off with Simon Cowell looks unrecognisable after reinventing himself as a 'spiritual healer'\n-\n'Irresponsible' Sam Faiers and Billie Shepherd shock fans with their 'dangerous' holistic healthcare advice\n-\nMike Tindall reveals his 'sliding doors' moment when he first met Zara Tindall in 2003\n-\nDuncan James SPLITS from boyfriend after six years together as Blue singer shares post about 'growth' to fans amid heartache\n-\nAlec Baldwin shares sensual moment with wife Hilaria as couple reenact Dirty Dancing in what appears to be a desperate audition for DWTS\n-\nSerena Williams buries feud with Maria Sharapova with shock appearance as Russian enters tennis Hall of Fame\n-\nThe Hollywood stars you had no idea appeared on reality TV shows before they were famous\n-\nEXCLUSIVE\nThought the Biggest Loser was harsh? TV's self-declared 'lard police' Steve Miller insists he has 'no regrets' about his controversial Fat Families show\n-\nConor McGregor poses with 'yacht neighbour' David Beckham and sons Romeo and Cruz as UFC star hails football legend's 'dynasty'\n-\nColdplay's Chris Martin makes a cheeky swipe about the kiss-cam scandal before helping with a proposal and sharing sweet moment with autistic fan\n-\nFreddie Starr died 'penniless and estranged from his six children' as stranger stepped in to bring his body home from Spain and foot funeral bill\n-\nNelly Furtado, 46, delights fans with Noughties nostalgia as she storms the stage in a racy cut out top and mini skirt at the Big Feastival\n-\nSaturday Night Live boss Lorne Michaels says there will be a bloodbath of cast members within weeks\n-\nStacey Solomon and Joe Swash having another baby 'not off the table' following loved up display on luxurious family holiday\n-\nBobby Brazier, 22, 'is quitting showbiz and moving to India to pursue the Hare Krishna religion'\n-\nThis is just a saga now: Games critic Peter Hoskin checks out Echoes Of The End, an ambitious new video game from Iceland\n-\nThe exact treatments behind Karren Brady's transformation: The Apprentice star receives 'state-of-the-art technology for fat removal', says her very own cosmetic surgeon\n-\nLuisa Zissman reveals she smashed up her childrens' iPads in front of them because they 'p****d her off' - as controversial post sparks huge debate\n-\nNeighbours star Ian Smith shares major health update after being diagnosed with terminal lung cancer\n-\nOscar-winning actor looks unrecognisable in 90s comedy that has since become a cult classic - can YOU spot who he is?\n-\nRyan Thomas' nepo baby actress daughter Scarlett, 16, reveals she didn't sit her GCSEs\n-\nAlison Hammond, 50, is happier than ever with boyfriend David Putman, 28, and 'can't imagine her life without him as friends predict engagement'\n-\nEXCLUSIVE\nWas Hulk Hogan MURDERED? Estranged daughter Brooke has NEW information amid police investigation into death... here's all the evidence\n-\nEXCLUSIVE\nVile plot against Kylie Jenner with two-word code name... orchestrated by Timothee Chalamet's die-hard fans who say it's punishment for doing the unthinkable\n-\nUniversity Challenge's most memorable players: From irritating habits to disastrous blunders and wise cracks, the BBC boffins who stole the show\n-\nJacqueline Jossa and hubby Dan Osborne enjoy family holiday - months after a make-or-break getaway saved their marriage following brief split\n-\nMaya Jama 'considers moving to Manchester to be closer to footballer boyfriend Ruben Dias' as romance becomes more serious\n-\nStrictly Come Dancing gets 'major format shake-up' for this year's series that could 'disrupt chemistry' between celebrity and pro dance partners\n-\nStrictly Come Dancing star arrested on suspicion of rape in fresh blow for scandal-hit show just weeks before series returns to screens\n-\nNick Ferrari, 66, marries longtime love Clare surrounded by celeb pals including Piers Morgan, Myleene Klass and Christopher Biggins in idyllic venue in the south of France\n-\nKENNEDY: Shame on Serena Williams! She may be starving herself on prescription anorexia drugs. But this putrid stunt proves she's still a greedy beast\n-\nNetflix fans rave over 'simply fantastic' period drama hailed as 'a beautiful piece of storytelling' with huge Hollywood star in lead role\n-\nEXCLUSIVE\nFlorence Pugh's brother Toby Sebastian who starred in Game of Thrones has drastic new career change\n-\nThe tale of two Taylors! From Hollywood showmances to rebelling against studios - the incredible parallels between Taylor Swift and Elizabeth Taylor\n-\nNetflix fans gripped by 'harrowing and nightmarish' Vanessa Kirby sex work thriller - gushing over her 'powerhouse performance'\n-\nArnold Schwarzenegger's son Chris is unrecognizable in shockingly thin appearance after weight loss... see him now\n-\nAbbey Clancy wows in a bikini as she poses with husband Peter Crouch and their four children during idyllic summer holiday\n-\nKing Charles and Queen Camilla tell of 'deepest admiration for the unbreakable courage and spirit of the Ukrainian people' in Independence Day letter\n-\nMillie Bobby Brown weighs in on letting her kids pursue acting in resurfaced clip... after adopting baby girl at just 21\n-\nSopranos star Jerry Adler dies at 96: Late-blooming actor worked with Woody Allen and appeared on The Good Wife\n-\nEXCLUSIVE\nHome And Away tease the return of iconic couple Brax and Ricky after a decade away from Aussie soap\n-\nEXCLUSIVE\nI was the resident therapist on Celebrity Fit Club, the stars binged on pizza after weigh-ins and one was sacked after getting a gastric band mid-series\n-\nJack Osbourne honours late father Ozzy with heartfelt tribute in rare public appearance... one month after rock legend's death at 76\n-\nBradley Cooper, 50, and Gigi Hadid, 30, jet out for getaway together as age-gap romance heats up\n-\nEXCLUSIVE\nPride and Prejudice first look: Jack Lowden and Emma Corrin transform into Mr Darcy and Elizabeth Bennett for heated first scenes\n-\nMeghan and Harry's Michelin-starred wedding chef who features in new Netflix series reveals duchess's secret kitchen skills\n-\nEXCLUSIVE\nRaye forced to halt her performance as a fan collapses in the crowd at All Points East Festival\n-\nFKA Twigs puts on a very racy performance at All Points East after being drafted in as last minute replacement for Doechii\n-\nMeghan Markle's high street capsule wardrobe revealed: From staple crisp shirts to her go-to ballet flats\n-\nI'm A Celebrity star Dean McCullough speaks out as police investigate sick death threats\n-\nBrooks Nader's ex Gleb Savchenko seen on DWTS set after she claimed he was 'fired'\n-\nEXCLUSIVE\nTaking the Michael! ITV chiefs throw cash at comedian McIntyre in bid to nab him from BBC... but hit a snag because super-rich comic only cares about ratings\n-\nKylie Jenner's mini-me daughter Stormi steals the spotlight in her first commercial for mom's makeup\n-\nLil Nas X stripped completely nude on street before LA arrest in shocking new footage\n-\nLeigh-Anne Pinnock puts on an X-rated display as the former Little Mix star headlines Pride in Manchester\n-\nCoronation Street bosses face backlash for casting actor 'who broke another man's eye socket' as upcoming storyline reflects real life\n-\nLiam Gallagher extends major olive branch to his brother Noel during Oasis reunion tour - after years of feuding\n-\nGrief-stricken Kelly Clarkson appears shaken as she's seen for FIRST TIME since tragic death of ex-husband Brandon Blackstock\n-\nTALK OF THE TOWN: Moving in the right direction - Harry Styles set to start work on mega-mansion\n-\nSophie Turner reveals why she will never leave the UK again after moving back to London following divorce from ex Joe Jonas\n-\nJennifer Garner appears fresh-faced on solo outing after her kids celebrate dad Ben Affleck's low-key birthday\n-\nGRIFF RHYS JONES: My night with four young people (I paid, of course)...and why, in spite of all their witless opinions, I deplore the way their futures are being stifled\n-\nKatie Price displays her surgically-enhanced assets in a grey top as she steps out in London amid bitter feuds with her exes\n-\nEXCLUSIVE\nNew series depicts Princess Diana as an American mom with an addict daughter in Arizona - but friend behind the show insists he's not cashing in on her memory: KATIE HIND\n-\nEastEnders star Cheryl Fergison, 59, reveals she has suffered a worrying stroke - amid financial struggles\n-\n'Oh she's out!' Michelle Keegan lets her hair down as she posts selfie with a beer before partying at Coldplay's Wembley gig\n-\nLovely jubbly! Sir David Jason, 85, is in great spirits as he's mobbed by fans before his new show at Manchester's Lowry Theatre\n-\nMAFS UK expert Charlene Douglas in a wheelchair after being rushed to hospital as she gives health update\n-\nGeorgia Toffolo flaunts her toned abs in a skimpy white bikini as she shares snaps from sun-soaked holiday\n-\nJowita Przystal celebrates her birthday on wild night out as Pete Wicks shows off the moves she taught him on Strictly after pair reignited romance rumours\n-\nSam Thompson shows off new physique as he poses with equally buff brother-in-law Ryan Libbey after crashing sister Louise's family holiday\n-\nDid William the Conqueror really have an Asterix moustache? No, say historians - and that's just one of BBC blockbuster's howlers\n-\nKhloe Kardashian nearly upstages her friend at her birthday party as fans go wild over her 'amazing' look\n-\nJeremy Clarkson checks out the competition! Star samples a Britpop lager as he takes a break from his Cotswolds farm duties to enjoy Blur star Alex James' festival\n-\nEmily in Paris resumes filming in Venice two days after Netflix show's 'assistant director collapses and dies' in front of horrified crew\n-\nKylie Jenner gets roasted AGAIN after reposting snaps from her most-hated fashion shoot\n-\nThe dark past of William and Kate's 'forever home': Slavery links, an equerry who blew his brains out and a royal break-up...\n-\nThe Kooks frontman Luke Pritchard reveals why Rebel Wilson joined the band on stage and admits they only rehearsed an hour before\n-\nStunning wealth of Coco Gauff, 21, revealed as she's named the world's highest-earning female athlete\n-\nNepo baby son of Walking Dead star and 90s iconic supermodel arrested for assault\n-\nDua Lipa turns 30! Hitmaker sizzles in a sheer halter dress as she celebrates milestone birthday with intimate dinner while paying tribute to parents\n-\nSydney Sweeney who? Awards panel unveils 25 greatest films list with stars over 60 amid Hollywood's youth obsession\n-\nClaudia Schiffer sports a football shirt as she cheers on Brentford with husband Matthew Vaughn at the Gtech Community Stadium - after filmmaker invested in Premier League club\n-\nSophie Ellis Bextor stuns in glitter mini dress she makes surprise appearance at Reading Festival to perform Murder on the Dancefloor\n-\nAnd Just Like That... woke storylines killed the SATC reboot: From Miranda's 'late life lesbianism' to Charlotte's family gender issues - the moments that left viewers cringing\n-\nI met Amanda Holden when the Britain's Got Talent cameras weren't rolling - she showed her true colours straight away\n-\nLove Island's Yasmin Pettet reveals emotional reason she 'hasn't been intimate' with boyfriend Jamie Rhodes after leaving the villa\n-\nCountry superstar says chance meeting with Taylor Swift at Travis Kelce's charity camp lit up collab hopes\n-\nEXCLUSIVE\nSecret Lives of Mormon Wives explodes with lesbian twist as stars KISS in steamy first look at Season 3\n-\nImpossible contestant sent home empty-handed after struggling with a Harry Potter question on axed BBC show - but could YOU have guessed it?\n-\nBBC star Michael Ball reveals his mother has died as devastated singer is flooded with support by fans\n-\nSydney Sweeney's Americana director defends flop after box office crash\n-\nQueen Camilla is stylish in blue as she steps out at the final day of the York races\n-\nVicky Pattison leaves fans 'horrified' as she lets a dog lick her mouth in 'stomach churning' clip\n-\nBrookside legend Sue Johnston set to reprise iconic role after 35 years in historic Hollyoaks crossover\n-\nDrake back in bed with Bobbi Althoff after viral feud as they tease new project\n-\nLeona Lewis reveals how motherhood has changed her - as she gears up for her first-ever Las Vegas residency"
    },
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/zoe-kravitz/index.html",
      "text": "Advertisement\nRELATED TOPICS FOR Zoe Kravitz\nZoe Kravitz - Latest news, views, gossip, photos and video\nPage\nZoe Kravitz seen arm-in-arm on romantic stroll in Rome with Harry Styles after getting cozy with Austin Butler\n25/08/25 03:11\nZoe Kravitz was pictured enjoying a romantic stroll with Harry Styles, just days after getting cozy with Austin Butler. The Batman actress, 36, was seen walking arm-in-arm with the pop megastar, 31, in Rome on Sunday, in a fan video shares to social media. Zoe - who's the daughter of Lisa Bonet and rocker Lenny Kravitz - stunned in a white mini dress with black ballet flats and a dark baseball hat. ...read\nZoe Kravitz wows in barely there lace slip dress as she joins co-star Austin Butler at Caught Stealing Paris premiere - as they continue to spark romance rumours\n21/08/25 22:22The daughter of Lenny Kravitz and Lisa Bonet, 36, and the American hunk, 34, were snapped gazing into one another after continuing to spark romance rumours recently.Austin Butler and co-star Zoe Kravitz put another cosy display at the Caught Stealing photocall in Paris amid romance rumours\n21/08/25 17:35Austin Butler and Zoe Kravitz looked cosy while attending the Caught Stealing photocall in Paris on Thursday, after sparking romance rumours.Lottie Moss wears a shimmering gold corset and fitted skirt as she attends Caught Stealing screening in London\n19/08/25 20:11The model, 27, teamed a gold corset and matching fitted skirt with a pair of towering platform heels for the event.Zoe Kravitz stuns in a plunging halterneck gown with Austin Butler at Caught Stealing screening in London after sparking romance rumours\n19/08/25 18:35The actress, 36, who stars as Yvonne in the film, wore a black, plunging halterneck gown as she walked the blue carpet at Odeon Luxe in Leicester Square.Austin Butler cosies up to co-star Zoe Kravitz at the Caught Stealing photocall in London after sparking romance rumours\n19/08/25 15:20Austin Butler looked very cosy with his co-star Zoe Kravitz as the pair attended the Caught Stealing photocall in London on Tuesday.Zoe Kravitz shares her candid reaction after hearing Taylor Swift's upcoming album The Life Of A Showgirl\n19/08/25 00:03Zoe Kravitz revealed that she has already 'heard bits' of her BFF Taylor Swift's upcoming album The Life Of A Showgirl - and has offered her honest opinion on the new music.Zoe Kravitz sparks concern over shockingly thin appearance as she steps out in NYC after surprise Emmy nom\n20/07/25 04:42Fans voiced worry over the star's slim figure in the comment section of an Instagram post shared by gossip site DeuxMoi. One wrote, 'She doesn't look healthy.'Birkenstock clogs are on sale everywhere - including up to £116 off our favourite Boston-style in the Amazon Prime Day sale\n08/07/25 10:23Not so long ago, if you'd announced that clogs were the height of fashion, most people would have laughed at the notion. However, that was before the Birkenstock Boston clog became the shoe du jour, worn by stylish celebrities such as Kendall Jenner, Zoe Kravitz and Kaia Gerber.Channing Tatum looks tense with girlfriend, 25, at daughter's graduation as he risks run-in with Jenna Dewan\n05/06/25 16:11Channing Tatum looked a bit tense as he arrived at his daughter Everly's graduation with his 25-year-old girlfriend, just steps away from his ex-wife Jenna Dewan.The best Birkenstock Boston clog alternatives that are in stock right now, including £14 supermarket mules that look just as chic\n28/05/25 16:25Over the past year, Adidas Sambas have been replaced as the shoe du jour by an unlikely candidate: the Birkenstock Boston clog.Jennifer Aniston the $300m superstar jumps on another basic footwear trend in $40 shoe\n23/05/25 05:17Jennifer Aniston , who is reportedly worth $320 million, joined an ultra-casual trend that has been sweeping Hollywood celebrities.Austin Butler drives fans wild with major buff body makeover as he strips down for new role\n21/05/25 22:07Austin Butler drove fans wild in the new trailer of his film Caught Stealing, which dropped Wednesday.Huge Britney Spears rumor finally put to bed after 25 years\n16/05/25 16:10Fans of the singer have finally learned the truth behind her iconic Oops!... I Did It Again album cover.Alicia Vikander puts on a leggy display in a black disc-embellished mini dress as she joins glamorous Zoë Kravitz at star-studded Moët Hennessy party in London\n16/05/25 00:15Alicia Vikander and Zoë Kravitz were dressed to impress as they attended the Moët Hennessy Dom Pérignon Revelations dinner party at Tate Modern in London on Thursday.What's happened to Noah Centineo? Gen Z heartthrob shocks with worrying new look\n28/03/25 04:27Noah Centineo's latest red carpet appearance has sparked concern among fans. The Gen Z heartthrob, 28, presented a worrying new look while attending the Warfare premiere on Thursday.Channing Tatum's much younger lover flashes her abs on date night after his 'fat' comment\n24/03/25 00:26Channing Tatum and new girlfriend Inka Williams cozied up during a date night with friends in Los Angeles over the weekend.Zoe Kravitz continues to spark romance rumors with hunky actor months after heartbreaking Channing Tatum split\n19/03/25 19:32The 36-year-old nepo baby was seen out with 28-year-old actor Noah Centineo once again i n New York on Tuesday.Inka Williams, 25, revs up new romance with Channing Tatum, 44, in Melbourne - after the Hollywood actor went official with the Aussie model almost half his age\n15/03/25 04:31Hollywood star Channing Tatum is currently in Melbourne with his new Aussie model girlfriend Inka Williams to attend the Formula 1 at the Australian Grand Prix.Kate Moss suffers wardrobe mishap as she arrives at Zoe Kravitz's house with makeup stains all over her chic black jumpsuit after celebrating at Yves Saint Laurent PFW party\n12/03/25 19:54The supermodel, 51, was spotted making her way to the actress' property after celebrating the end of Paris Fashion Week at the Yves Saint Laurent after-party.Channing Tatum's new Australian model girlfriend Inka Williams stuns in backless red gown as she goes solo to Crown Glam Villa in Melbourne\n12/03/25 10:00Channing Tatum's new Aussie model girlfriend Inka Williams was making waves on Wednesday night.Channing Tatum's new Aussie model girlfriend Inka Williams shows off her slim figure in a crop top as she jets to Melbourne ahead of their rumoured appearance at the F1 Grand Prix\n12/03/25 01:48Channing Tatum's new Aussie model girlfriend Inka Williams was spotted jetting out of Sydney Airport on Wednesday.Braless Zoe Kravitz turns heads as she flashes her nipples in a satin slip dress at the Paris Fashion Week Saint Laurent show\n11/03/25 21:30The 36-year-old actress has been making the most of the festivities in the French capital in the last week, but seemingly saved her most racy look until last.Hailey Bieber and Zoe Kravitz look chic as they walk hand-in-hand through Paris after YSL Fashion Week show\n11/03/25 08:58Departing the Yves Saint Laurent's womenswear show, the close friends were seen hopping into a waiting car.Zoe Kravitz puts on an effortlessly stylish display in a black satin co-ord as she leaves Costes party during Paris Fashion Week\n08/03/25 09:01The 36-year-old actress looked incredible as she left the star-studded bash in the cropped top and matching midi skirt, featuring lace hems.Braless Paris Jackson shows off her assets in completely sheer dress as she puts on ANOTHER very racy display at Costes party during PFW\n07/03/25 14:11Paris Jackson stepped out in another racy look during Paris Fashion Week as she arrived at the star-studded Costes party on Thursday evening.Inside Channing Tatum's new fling with model half his age after split from Zoe Kravitz and ugly divorce\n05/03/25 02:45Channing Tatum is 'happy' with his new model girlfriend Inka Williams - only days after the pair confirmed their romance at a pre-Oscars bash over the past weekend.Zoe Kravitz puts on a cheeky display in backside-baring peephole dress at 2025 Vanity Fair Oscar Party\n03/03/25 08:01On Sunday, the 36-year-old actress joined in on the festivities as she walked the star-studded red carpet at the iconic afterparty following the annual Academy Awards in Los Angeles.Zoe Kravitz and Noah Centineo spark romance rumors after leaving party together after Channing Tatum split\n02/03/25 21:29Zoë Kravitz and Noah Centineo are continuing to spark romance rumors after leaving a party together in West Hollywood.Tyra Banks makes shock admission as she addresses America's Next Top Model backlash\n02/03/25 02:09Tyra Banks has addressed backlash over her reality competition series America's Next Top Model after previously being on the air for 24 seasons.Channing Tatum, 44, CONFIRMS romance with new Aussie girlfriend Inka Williams, 25, as they pack on the PDA at the CAA pre-Oscar party - four months after his split from Zoe Kravitz\n01/03/25 11:24The Step Up alum, 44, who split from ex Zoe Kravitz in October after three years of dating, held hands with the brunette beauty as they made their way out of the A-list event.Zoe Kravitz looks almost unrecognizable with ultra glam appearance at Oscars pre-party\n01/03/25 08:28Zoe Kravitz revealed a soft makeover while attending the Saint Laurent x Vanity Fair pre-Oscars dinner on Friday evening. She modeled a dress with a plunging neckline and asymmetric hem.Zoe Kravitz offers a big update on Big Little Lies season three\n25/02/25 20:04The show, created by David E. Kelly and based on the novel by Liane Moriarty, follows four Southern California mothers as they navigate friendship, motherhood, and domestic violence.Zoe Kravitz opens up on her 'journey' with ex-fiancé Channing Tatum and admits she still 'cares for him very much' after their shock split\n25/02/25 14:17Posing for the cover of ELLE, the actress, 36, opened up about their 'journey' after meeting on the set of Blink Twice, admitting that it 'warms her heart' to hear fans praising his performance.Who is Channing Tatum's new Aussie girlfriend? Actor is 'dating' model Inka Williams four months after splitting from fiancée Zoe Kravitz\n21/02/25 21:59Channing Tatum is rumoured to be dating Australian model Inka Williams.Zoe Kravitz spotted with Noah Centineo four months after Channing Tatum split\n15/02/25 06:31Channing, 44, and Zoe, 35, were romantically involved for three years and engaged for one before they called off the wedding at the end of October.Madonna's daughter Lourdes Leon goes BRALESS in a sheer catsuit as she joins modest Zoe Kravitz and Iris Law at Saint Laurent's PFW show\n29/01/25 00:54Lourdes Leon went braless in a racy sheer catsuit as she led the stars at Saint Laurent's Paris Fashion Week show on Tuesday.Robert Pattinson cosies up to Zoe Kravitz and Adriana Lima for snaps at star-studded Paris party to celebrate his new film Mickey 17\n27/01/25 13:34The actor, 38, hosted the glitzy event in the French capital on Sunday one month ahead of the release of his movie Mickey 17, a sci-fi thriller directed by Parasite creator Bong Joon-Ho.Windswept Cara Delevingne links arms with friends Anya Taylor-Joy and Zoe Kravitz at star-studded Golden Globes after-party\n06/01/25 09:22Cara Delevingne was surrounded by her close pals Anya Taylor-Joy and Zoe Kravitz as she left the Golden Globes after-party on Sunday.Zoe Kravitz wears earrings reminiscent of her engagement ring at 2025 Golden Globes after Channing Tatum split\n06/01/25 01:22Zoe Kravitz made a statement with her jewelry while attending the 2025 Golden Globes on Sunday.Sabrina Carpenter puts on a leggy display in a pink mini dress as she joins stylish Demi Moore and Zoe Kravitz at star-studded W Magazine bash\n05/01/25 12:21It was a star-studded affair at W Magazine's annual party at Chateau Marmont in LA on Saturday night.Zoe Kravitz breaks silence about ex-fiancé Channing Tatum's 'charisma' after shock split\n20/12/24 02:20Despite recently calling off their engagement, Zoë Kravitz remembers Channing Tatum 's 'charisma.' She opened up about casting and working alongside her ex in her film Blink Twice.Newly single Zoe Kravitz shows off her slender physique in baby pink gown as she attends the 2024 Gotham Awards in her first red carpet appearance since Channing Tatum split\n03/12/24 14:48The actress, 35, appeared to be enjoying her evening at Cipriani on Wall Street in New York in her first red carpet appearance since splitting from fiancée Channing Tatum last month.Newly single Zoe Kravitz enjoys girls' night with Dianna Agron amid Channing Tatum split\n17/11/24 02:02Keeping it effortlessly chic, Kravitz rocked a black fuzzy coat as she stayed low-key in the backseat of a car alongside her glamorous friend.Curse of the Oscars selfie: How several stars in the photo that 'broke the internet' have been beset by scandal since the snap went viral 10 years ago\n16/11/24 12:11Little did the A-Listers know that the moment in Los Angeles would mark a new era - one of bad luck and controversy that many of them have failed to shake off, even 10 years laterNewly single Channing Tatum spends quality time with daughter after split from Zoe Kravitz\n10/11/24 00:02Channing Tatum spent some quality time with his daughter Everly 11, in the wake of his split from his fiancée Zoë Kravitz, 35. He shared two images to featuring giant teddy bears.Smoking celebs spark fears they're making cigarettes 'cool' as Addison Rae and Charli XCX lead stars lighting up\n09/11/24 16:27Health experts have expressed fears that celebrities are making smoking 'cool' again after a number of A-listers have been pictured out puffing on cigarettes.Taylor Swift celebrates six Grammy nominations with newly single Zoë Kravitz after Channing Tatum breakup\n09/11/24 15:35Taylor Swift looked enchanting as she stepped out to celebrate her six nominations at the 2025 Grammy over dinner with her longtime pal Zoë Kravitz in New York City .Channing Tatum meets up with Zoe Kravitz's friend days after ending engagement\n04/11/24 22:21Tatum, 44, was spotted sharing a friendly embrace with Ben Jacobson in New York City on Sunday.Channing Tatum looks downcast as he smokes a cigarette following shock split from ex-fiancée Zoe Kravitz\n03/11/24 23:52Channing Tatum looked contemplative as he spent some alone time in New York City on Saturday following his recent split from former fiancée Zoe Kravitz.Zoe Kravitz and Channing Tatum have 'no bad blood' between them as they call off engagement\n02/11/24 00:34Zoë Kravitz and Channing Tatum have been in touch with each other since they broke up earlier this week. The couple had been together for three years and were engaged to be married.Newly-single Zoe Kravitz poses with stars dressed as Princess Diana at Halloween bash after Channing Tatum split\n01/11/24 18:39Newly-single Zoe Kravitz brushed off her split from fiance Channing Tatum as she joined stars dressed as Princess Diana for a Halloween party Thursday.Jenna Dewan is seen with fiancé Steve Kazee after he laughed at her ex Channing Tatum's split with Zoe Kravitz\n01/11/24 17:22Jenna Dewan and fiancé Steve Kazee took their kids trick-or-treating in Los Angeles on Thursday evening. It comes after Jenna's ex Channing Tatum split from fiancee Zoe Kravitz.Channing Tatum looks disheveled puffing on a cigarette as Zoe Kravitz smiles after calling off engagement\n30/10/24 21:59The 44-year-old star of Magic Mike was dressed very casually while puffing on a cigarette on a solo outing in Gastonia, North Carolina on WednesdayBraless Zoe Kravitz smiles as she's seen in New York for the first time since calling off Channing Tatum engagement\n30/10/24 19:27Zoë Kravitz cracked a relaxed smile as she stepped out for the first time since news broke of her shock split from Channing Tatum after three years of dating.Jenna Dewan's fiancé seemingly laughs after Channing Tatum and Zoe Kravitz's breakup in bizarre post\n30/10/24 16:18Jenna Dewan's fiance Steve Kazee shared a cryptic post via his Instagram Stories on Tuesday, in the wake of Channing Tatum and Zoe Kravitz's breakup.Channing Tatum and Zoe Kravitz announce new project together just hours before shock split was revealed\n30/10/24 10:08Sources confirmed to People on Tuesday that the Magic Mike star, 44, and The Batman actress, 35, have gone their separate ways - after first being linked back in 2021.A look back at Channing Tatum and Zoe Kravitz's hot romance including last bedroom selfie before shock split\n30/10/24 03:00Channing Tatum and Zoe Kravitz have ended their engagement as the pair officially split following a three-year romance - and DailyMail.com takes a look back at their relationship.Channing Tatum and Zoe Kravitz SPLIT after 3 years as they call off engagement\n29/10/24 22:48Channing Tatum and Zoë Kravitz are ending their engagement just a year after they made plans to tie the knot.Zoe Kravitz reunites with Big Little Lies costar Shailene Woodley in NYC\n22/10/24 22:09The talented twosome enjoyed dinner at Buvette on Tuesday to celebrate Shailene starting rehearsals for her Broadway debutWhat is TikTok's contrast theory, and how should it change your make-up regime?\n21/10/24 15:23Anyone with TikTok will know how much conflicting make-up advice there is on the app.Zoe Kravitz and Tobey Maguire have a chat and share a hug while out in NYC\n19/10/24 03:42Zoe Kravitz and Tobey Maguire caught up with each other while out and about in NYC. The 35-year-old Blink Twice director and 49-year-old Great Gatsby actor shared a friendly hug and chat.Zoe Kravitz is ultra chic in LBD with Natasha Lyonne at starry Jean-Michel Basquiat tribute event in NYC\n11/10/24 07:08Zoe Kravitz joined stylish Natasha Lyonne at Dom Pérignon's tribute celebration for late artist Jean-Michel Basquiat on Thursday night.Austin Butler holds hands with girlfriend Kaia Gerber as they enjoy a romantic date night in New York City\n06/10/24 16:10Austin Butler and Kaia Gerber attempted a low key date night in New York City on Saturday. Butler, 33, wore a black mask over his face for part of the evening.Austin Butler leaps in front of a taxi as he joins Zoe Kravitz to film scenes for Caught Stealing in New York City\n04/10/24 09:06The actor, 33, plays Hank Thompson in the thriller, a former baseball player who finds himself caught up in the criminal underworld of 90s New York City.Austin Butler and Zoe Kravitz share passionate KISS while shooting crime thriller Caught Stealing in New York\n02/10/24 23:23Zoe Kravitz and Austin Butler were caught sharing a steamy kiss on the New York City set of Darren Aronofsky's new film Caught Stealing on Wednesday.Zoe Kravitz joins dad Lenny at the Saint Laurent womenswear show\n25/09/24 10:58Preview text goes hereZoe Kravitz and Kate Moss share a sweet interaction as the excited actress sits beside the supermodel on the Saint Laurent front row at Paris Fashion Week\n25/09/24 07:58The pair were among those in attendance at the star-studded Saint Laurent's Ready To Wear womenswear show in Paris on Tuesday.Nicole Richie sizzles in emerald mini dress and faux-fur coat at Saint Laurent show during Paris Fashion Week\n25/09/24 06:04Nicole Richie made heads turn while attending the Saint Laurent show during Paris Fashion Week. The Simple Life star, 43, looked elegant in a lowcut emerald mini dress on Tuesday.Zoë Kravitz, 35, goes braless beneath a sheer minidress as she joins musician dad Lenny, 60, at the Saint Laurent womenswear show during Paris Fashion Week\n25/09/24 00:30The Catwoman actress, 35, sent pulses racing as she attended the fashion event wearing a black lace mini dress.Zoe Kravitz shows off her taut tummy in crop top and low-rise pants on set of upcoming crime thriller Caught Stealing in New York City\n21/09/24 21:03The 35-year-old actress showed off her toned abs in a white, cropped camisole and a thick, flannel jacket layered over an open, dark blue button-down.Channing Tatum shows off Zoe Kravitz 'inking' as he sparks speculation he got hand tattoo of his fiancee's initials\n10/09/24 20:05The hunk, 44, had his fiancee Zoe Kravitz 's initials etched onto the back of his hand. It's not clear if the 'ZK' was permanent or merely a temporary fixture drawn on with a Sharpie pen.Drew Barrymore fights back tears as she opens up about her shame over 'blackout' drinking\n10/09/24 16:13Drew, 49, who has been sober for five years, opened up about her relationship with alcohol as she addressed the theme of substances in Zoe Kravitz's new film Blink Twice.Zoe Kravitz sweetly holds hands with dad Lenny Kravitz after taping The Drew Barrymore Show in New York City\n06/09/24 03:47While leaving the taping of The Drew Barrymore Show, the Catwoman star, 35, put on a stylish display in a casual ensemble featuring a colorful top.Zoë Kravitz reveals the inspiration behind her provocative thriller Blink Twice\n04/09/24 15:30Zoë Kravitz shed light on what inspired her to start writing her psychological thriller, Blink Twice, which examines the power dynamics between men and women.Shirtless Channing Tatum shares candid photo of his fiancee Zoe Kravitz sleeping on him as he admits he worried she would 'break' and thanks her for 'seeing him' in loving post\n03/09/24 20:38Channing Tatum has shared an insight into his relationship with Zoe Kravitz while posting a sleepy snap of her snoozing on his chest.Style swap! Celebrities can't get enough of these controversial comfy shoes - and this £37 Amazon pair looks identical\n03/09/24 08:31SHOPPING: Eagle-eyed Amazon shoppers have found an 'amazing' £66.90 alternative to the celebrity-loved Birkenstock Boston clogs but for a much more reasonable price tag.Deadpool & Wolverine battles it out with newcomers Blink Twice and The Crow for top of the box office\n26/08/24 01:32Deadpool and Wolverine is back at the top of the box office fighting away the competition that included two high profile newcomers after its brief fall to second last week.Big Little Lies author Liane Moriarty reveals plans for season three and whether the series will differ from the book - after Nicole Kidman and Reese Witherspoon confirmed they'll be back\n24/08/24 14:46Liane Moriarty has shared plans to pen a third season of the critically acclaimed streaming series Big Little Lies.Taylor Swift supports BFFS Sabrina Carpenter and Zoe Kravitz on Instagram - but STILL stays silent on Blake Lively's It Ends With Us\n23/08/24 22:02Taylor Swift praised her longtime pal Zoe Kravitz on her directorial debut, Blink Twice, and Sabrina Carpenter on the release of her sixth album Short 'n Sweet on Friday.\nPage\nDON'T MISS\n-\nRio Ferdinand, 46, and wife Kate, 33, reveal they have moved to Dubai with their family as they show off their lavish mansion\n-\nCruz Beckham shares an intimate moment with Jackie Apostel after joining shirtless dad David aboard their lavish yacht\n-\nEmma Watson potters around in a sheer lace dress as she joins her hunky personal trainer for a hike in Saint Tropez\n-\nEXCLUSIVE\nI was desperate to know what this model got up to with England star. Now I've discovered truth, reveals KATIE HIND\n-\nSting is being sued for 'MILLIONS of pounds in lost royalties' by former bandmates in The Police\n-\nBeaches, history, waterparks, golf... Turkey (Türkiye) has it all: Here's why you'll never want to leave\nAd Feature\n- Selena Gomez stuns in black swimsuit on yacht for bachelorette party in Cabo... but was BFF Taylor Swift there? Looking good\n-\nWas this earliest sign of cracks forming between Meghan and Kate? Expert reveals signs that 'Fab Four' weren't getting on\n-\nEXCLUSIVE\nThe dark truth of Club Chalamet: She's a 58-year-old Timothée obsessive who HATES Kylie Jenner\n-\nCould an app really make you better with money? Putting a smart money app to the test\nAd Feature\n-\nBrooklyn Beckham and Nicola Peltz give fans a glimpse of their 'perfect Sunday' as couple unwind after family 'snub'\n-\nMeghan Markle 'placed status above reality' and struggled to separate her own image from Suits character, claims royal author\n-\nBobby Brazier's love for Hare Krishna: From finding happiness through religion after tragic start - as soap star 'quits showbiz'\n- Zoe Kravitz seen arm-in-arm on romantic stroll in Rome with Harry Styles after getting cozy with Austin Butler See the pic\n-\nGet your autumn on! From pumpkin throws to cosy hot chocolate mugs, here's our pick of homeware for the new season\nAd Feature\n-\nFrom Princess Margaret's sadistic streak to Meghan 'berating a gardener' - the most ill-mannered royals revealed\n-\nWhy Millie Bobby Brown, 21, decided to shun Hollywood in favour of farm life in a nod to her British roots as she adopts a baby\n- I Dream of Jeannie star Barbara Eden turns 94 and looks more glamorous than ever... see her now All change\n-\nMum's the word! George, Charlotte and Louis join William and newly blonde Kate for church service in Balmoral\n-\nFrom auctions to EVs: 5 brilliant motoring brands every driver should know - from finance fixes to stunning electric SUVs\nAd Feature\n-\nMillie Bobby Brown, 21, and Jake Bongiovi, 23, bond with baby daughter in NYC... days after announcing adoption\n-\nEmily Ratajkowski showcases her curves in leather dominatrix inspired lingerie\n-\nStrictly Come Dancing bosses deliver verdict on future of BBC show after a male star was arrested on suspicion of rape\n-\nSuperman actor Dean Cain, 59, brutally mocked for struggling through training course after signing up with ICE\n-\nWhy Scottish Mortgage is backing the future of banking for long-term profits\nSponsored\n-\nHidden detail in Kelly Clarkson's outfit which symbolizes 'healing and hope' after ex Brandon Blackstock's death\n-\nLily Collins' VERY famous father-in-law reveals he isn't a fan of her show Emily in Paris - but do YOU know who he is?\n-\nEastEnders star Cheryl Fergison reveals the devastating moment she found her husband in a 'dingy love nest' with another woman\n- Vogue Williams gives fans a glimpse at her early 40th birthday celebrations with family and friends Milestone celebration\n-\nPaul Merton reveals it 'felt natural' falling in love with third wife Suki Webster six months after becoming a widower\n-\nSir Elton John, Sir Rod Stewart and Jessie J join an array of music legends for tribute to 'funny and rude friend Steve Wright'\n-\nEXCLUSIVE\nIs 'Saint' Peter Andre REALLY an angel? Katie Price's ex mocked disabled son Harvey and told Junior not to kiss boys\n-\nPassenger princesses! Kate and Charlotte beam as Prince William drives family to church service in Balmoral\n- Bikini-clad Naomi Campbell, 55, shows off her age-defying physique as she enjoys a lavish trip to Ibiza She's still got it\n- Try Amazon Music Unlimited FREE for 30 days! Enjoy millions of songs, audiobooks and podcasts SHOPPING\n-\nVictoria and David Beckham look more smitten than ever after 26 years of marriage as they enjoy lunch with their children in Nerano\n-\nLove Island's Kaz Crossley and TOWIE's Elma Pazar among reality stars 'involved in horror crash'\n-\nMyleene Klass shows off her harp playing skills as accomplished musician performs at 'dear friend' Clare Patterson's wedding\n-\nJackie Woodburne doesn't look like this anymore! Neighbours star is unrecognisable as she ditches the brunette crop she's had for decades and reveals grey hair\n- Upgrade your home office with up to 50% off ergonomic desk chairs and standing desks (and we have an EXCLUSIVE extra code) SHOPPING\n- Queen's 20-year-old supercharged Range Rover sells for over ten times its typical market value at auction Pricey\n- Linda Robson reveals the real reason for major Loose Women changes amid fears for the show's future Speaking out\n-\nIconic supermodel's son shows he's inherited her chiseled looks as he's marched into court on assault charges\n-\nTyson Fury's daughter Venezuela, 15, goes Instagram official with 'mystery boyfriend' - and his profession runs in the family\n- Shoppers flocking to Tesco after price slash on 'DELICIOUS' award-winning £20 Irish cream liqueur that's giving Baileys a run for its money SHOPPING\n-\nThe Walking Dead star's son makes disturbing threat after being charged with assault\n-\nSuki Waterhouse treats fans to a raunchy performance as she takes to the stage in black fishnet tights and microscopic shorts\n- Jameela Jamil raises alarm over Serena Williams' weight loss drug promotion British star has blasted Williams\n-\nBritney Spears poses nude in new photo after sparking fan concerns over disheveled living conditions\n- Why pay full price? This hack lets small businesses lease top tech for as little as £2.16 per MONTH - and no, there's no catch! SHOPPING\n-\nLeigh-Anne Pinnock flashes her abs in a skimpy red bra as she she continues her tour of UK festivals with solo gig at Reading\n- TV host Jenni reveals secret to bikini body...no chips or crisps for 34 years! Still looking toned and trim\n- Tulisa wears a strapless lime bustier as she she returns to the spotlight at Manchester Pride Looking good\n-\nDating Naked line-up REVEALED: Controversial Married At First Sight star joins new series of Rylan Clark's show\n- Shiseido launches upgraded viral skincare - get 20% off plus a free gift with our exclusive code SHOPPING:\n-\nFeuding royal rivals William and Harry go to war. Sound familiar? CHRISTOPHER STEVENS reviews King & Conqueror\n- Zendaya says she loved getting to do 'normal' things during her time with fiancé Tom Holland in Scotland Close couple\n-\nEXCLUSIVE\nLuisa Zissman shares bikini snaps amid skinny-shaming row - after sparking debate for smashing kids' iPads\n-\nJeering Dragons' Den panel called my business a 'delusional disaster' - now I'm worth £40million!\n- Is YOUR mattress causing you sleepless nights? Don't miss out on the best Emma Sleep deals with up to 25% off - prices start at £50 SHOPPING\n- Pop star under fire as fans call out penis-shaped stage design on opening night of tour It got off to a very memorable start\n-\nPregnant Sophie Habboo accidentally posts full frontal picture of husband Jamie Laing to fans as they enjoy Bank Holiday weekend\n- Inside Kristin Cavallari's wild Las Vegas weekend The 38-year-old reality star splurged the cash during her lavish trip\n-\nJenni Falconer, 49, displays her flawless physique in a skimpy leopard-print bikini as she soaks up the sun during summer break\n-\nSelena Gomez's fiancé Benny Blanco is SLAMMED for purchasing $200 blueberries: 'I can't afford regular fruit'\n- Julianne Moore admits her wedding dress was a HUGE mistake after skipping tradition to wear white Big regret\n- Kylie Jenner gives rare update on beloved dog Norman that she got at age 17 She's had the pet since she was a teenager\n-\nAll the celebrities who have REVERSED their cosmetic surgery from Chloe Ferry to Molly-Mae Hague and even Victoria Beckham\n- A-list celebrities rush to check on Kyle Sandilands following reports 'he was off-air due to stroke' Worrying\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n-\nTaylor Swift's true feelings REVEALED over Kansas City Chiefs docuseries that explores Travis Kelce romance\n-\nMark Wright and Michelle Keegan put on a loved up display as they enjoy romantic date night at Coldplay's Wembley gig\n-\nEXCLUSIVE\nFormer Baywatch star Nancy Valen ditches Hollywood glamour in rare sighting - see her now\n-\nClaudia Schiffer shows support for her husband Matthew Vaughn's team by posing in a Brentford shirt\n- Gloria Estefan may sue Diddy accuser who name dropped her and husband Emilio The court officially dismissed all allegations\n-\nThe downfall of Marco Pierre White Jr: Son of Michelin star chef has shirked his upbringing to have multiple brushes with law\n-\nJosie Gibson admits she's 'stepped back' from TV work and reveals plans to live 'off-grid as humanly possible'\n-\nEXCLUSIVE\nWilliam Shatner, 94, and his ex-wife spark REMARRIAGE rumors as she steps out wearing huge diamond ring\n-\nBraless Myleene Klass heads to work in a bandeau top and mini skirt after Frankie Bridge broke her silence on their 'feud'\n-\nLady Gaga breaks down during concert after revealing what fiance said moments before she took the stage\n-\nCelebrities who have dated people who look JUST like their siblings with eerie similarities - but do you agree with the comparisons?\n-\nScarlett Thomas' staggering payday as her father Ryan insists she hasn't had a free ride - after nepo baby, 16, skipped GCSEs\n-\nCall me sweet and I'll tell you to f*** off: Dame Helen Mirren, 80, issues a very blunt response to 'condescending' comments about age\n-\nX Factor star who faced off with Simon Cowell looks unrecognisable after reinventing himself as a 'spiritual healer'\n-\n'Irresponsible' Sam Faiers and Billie Shepherd shock fans with their 'dangerous' holistic healthcare advice\n-\nMike Tindall reveals his 'sliding doors' moment when he first met Zara Tindall in 2003\n-\nDuncan James SPLITS from boyfriend after six years together as Blue singer shares post about 'growth' to fans amid heartache\n-\nAlec Baldwin shares sensual moment with wife Hilaria as couple reenact Dirty Dancing in what appears to be a desperate audition for DWTS\n-\nSerena Williams buries feud with Maria Sharapova with shock appearance as Russian enters tennis Hall of Fame\n-\nThe Hollywood stars you had no idea appeared on reality TV shows before they were famous\n-\nEXCLUSIVE\nThought the Biggest Loser was harsh? TV's self-declared 'lard police' Steve Miller insists he has 'no regrets' about his controversial Fat Families show\n-\nConor McGregor poses with 'yacht neighbour' David Beckham and sons Romeo and Cruz as UFC star hails football legend's 'dynasty'\n-\nColdplay's Chris Martin makes a cheeky swipe about the kiss-cam scandal before helping with a proposal and sharing sweet moment with autistic fan\n-\nFreddie Starr died 'penniless and estranged from his six children' as stranger stepped in to bring his body home from Spain and foot funeral bill\n-\nNelly Furtado, 46, delights fans with Noughties nostalgia as she storms the stage in a racy cut out top and mini skirt at the Big Feastival\n-\nSaturday Night Live boss Lorne Michaels says there will be a bloodbath of cast members within weeks\n-\nStacey Solomon and Joe Swash having another baby 'not off the table' following loved up display on luxurious family holiday\n-\nBobby Brazier, 22, 'is quitting showbiz and moving to India to pursue the Hare Krishna religion'\n-\nThis is just a saga now: Games critic Peter Hoskin checks out Echoes Of The End, an ambitious new video game from Iceland\n-\nThe exact treatments behind Karren Brady's transformation: The Apprentice star receives 'state-of-the-art technology for fat removal', says her very own cosmetic surgeon\n-\nLuisa Zissman reveals she smashed up her childrens' iPads in front of them because they 'p****d her off' - as controversial post sparks huge debate\n-\nNeighbours star Ian Smith shares major health update after being diagnosed with terminal lung cancer\n-\nOscar-winning actor looks unrecognisable in 90s comedy that has since become a cult classic - can YOU spot who he is?\n-\nRyan Thomas' nepo baby actress daughter Scarlett, 16, reveals she didn't sit her GCSEs\n-\nAlison Hammond, 50, is happier than ever with boyfriend David Putman, 28, and 'can't imagine her life without him as friends predict engagement'\n-\nEXCLUSIVE\nWas Hulk Hogan MURDERED? Estranged daughter Brooke has NEW information amid police investigation into death... here's all the evidence\n-\nEXCLUSIVE\nVile plot against Kylie Jenner with two-word code name... orchestrated by Timothee Chalamet's die-hard fans who say it's punishment for doing the unthinkable\n-\nUniversity Challenge's most memorable players: From irritating habits to disastrous blunders and wise cracks, the BBC boffins who stole the show\n-\nJacqueline Jossa and hubby Dan Osborne enjoy family holiday - months after a make-or-break getaway saved their marriage following brief split\n-\nMaya Jama 'considers moving to Manchester to be closer to footballer boyfriend Ruben Dias' as romance becomes more serious\n-\nStrictly Come Dancing gets 'major format shake-up' for this year's series that could 'disrupt chemistry' between celebrity and pro dance partners\n-\nStrictly Come Dancing star arrested on suspicion of rape in fresh blow for scandal-hit show just weeks before series returns to screens\n-\nNick Ferrari, 66, marries longtime love Clare surrounded by celeb pals including Piers Morgan, Myleene Klass and Christopher Biggins in idyllic venue in the south of France\n-\nKENNEDY: Shame on Serena Williams! She may be starving herself on prescription anorexia drugs. But this putrid stunt proves she's still a greedy beast\n-\nNetflix fans rave over 'simply fantastic' period drama hailed as 'a beautiful piece of storytelling' with huge Hollywood star in lead role\n-\nEXCLUSIVE\nFlorence Pugh's brother Toby Sebastian who starred in Game of Thrones has drastic new career change\n-\nThe tale of two Taylors! From Hollywood showmances to rebelling against studios - the incredible parallels between Taylor Swift and Elizabeth Taylor\n-\nNetflix fans gripped by 'harrowing and nightmarish' Vanessa Kirby sex work thriller - gushing over her 'powerhouse performance'\n-\nArnold Schwarzenegger's son Chris is unrecognizable in shockingly thin appearance after weight loss... see him now\n-\nAbbey Clancy wows in a bikini as she poses with husband Peter Crouch and their four children during idyllic summer holiday\n-\nKing Charles and Queen Camilla tell of 'deepest admiration for the unbreakable courage and spirit of the Ukrainian people' in Independence Day letter\n-\nMillie Bobby Brown weighs in on letting her kids pursue acting in resurfaced clip... after adopting baby girl at just 21\n-\nSopranos star Jerry Adler dies at 96: Late-blooming actor worked with Woody Allen and appeared on The Good Wife\n-\nEXCLUSIVE\nHome And Away tease the return of iconic couple Brax and Ricky after a decade away from Aussie soap\n-\nEXCLUSIVE\nI was the resident therapist on Celebrity Fit Club, the stars binged on pizza after weigh-ins and one was sacked after getting a gastric band mid-series\n-\nJack Osbourne honours late father Ozzy with heartfelt tribute in rare public appearance... one month after rock legend's death at 76\n-\nBradley Cooper, 50, and Gigi Hadid, 30, jet out for getaway together as age-gap romance heats up\n-\nEXCLUSIVE\nPride and Prejudice first look: Jack Lowden and Emma Corrin transform into Mr Darcy and Elizabeth Bennett for heated first scenes\n-\nMeghan and Harry's Michelin-starred wedding chef who features in new Netflix series reveals duchess's secret kitchen skills\n-\nEXCLUSIVE\nRaye forced to halt her performance as a fan collapses in the crowd at All Points East Festival\n-\nFKA Twigs puts on a very racy performance at All Points East after being drafted in as last minute replacement for Doechii\n-\nMeghan Markle's high street capsule wardrobe revealed: From staple crisp shirts to her go-to ballet flats\n-\nI'm A Celebrity star Dean McCullough speaks out as police investigate sick death threats\n-\nBrooks Nader's ex Gleb Savchenko seen on DWTS set after she claimed he was 'fired'\n-\nEXCLUSIVE\nTaking the Michael! ITV chiefs throw cash at comedian McIntyre in bid to nab him from BBC... but hit a snag because super-rich comic only cares about ratings\n-\nKylie Jenner's mini-me daughter Stormi steals the spotlight in her first commercial for mom's makeup\n-\nLil Nas X stripped completely nude on street before LA arrest in shocking new footage\n-\nLeigh-Anne Pinnock puts on an X-rated display as the former Little Mix star headlines Pride in Manchester\n-\nCoronation Street bosses face backlash for casting actor 'who broke another man's eye socket' as upcoming storyline reflects real life\n-\nLiam Gallagher extends major olive branch to his brother Noel during Oasis reunion tour - after years of feuding\n-\nGrief-stricken Kelly Clarkson appears shaken as she's seen for FIRST TIME since tragic death of ex-husband Brandon Blackstock\n-\nTALK OF THE TOWN: Moving in the right direction - Harry Styles set to start work on mega-mansion\n-\nSophie Turner reveals why she will never leave the UK again after moving back to London following divorce from ex Joe Jonas\n-\nJennifer Garner appears fresh-faced on solo outing after her kids celebrate dad Ben Affleck's low-key birthday\n-\nGRIFF RHYS JONES: My night with four young people (I paid, of course)...and why, in spite of all their witless opinions, I deplore the way their futures are being stifled\n-\nKatie Price displays her surgically-enhanced assets in a grey top as she steps out in London amid bitter feuds with her exes\n-\nEXCLUSIVE\nNew series depicts Princess Diana as an American mom with an addict daughter in Arizona - but friend behind the show insists he's not cashing in on her memory: KATIE HIND\n-\nEastEnders star Cheryl Fergison, 59, reveals she has suffered a worrying stroke - amid financial struggles\n-\n'Oh she's out!' Michelle Keegan lets her hair down as she posts selfie with a beer before partying at Coldplay's Wembley gig\n-\nLovely jubbly! Sir David Jason, 85, is in great spirits as he's mobbed by fans before his new show at Manchester's Lowry Theatre\n-\nMAFS UK expert Charlene Douglas in a wheelchair after being rushed to hospital as she gives health update\n-\nGeorgia Toffolo flaunts her toned abs in a skimpy white bikini as she shares snaps from sun-soaked holiday\n-\nJowita Przystal celebrates her birthday on wild night out as Pete Wicks shows off the moves she taught him on Strictly after pair reignited romance rumours\n-\nSam Thompson shows off new physique as he poses with equally buff brother-in-law Ryan Libbey after crashing sister Louise's family holiday\n-\nDid William the Conqueror really have an Asterix moustache? No, say historians - and that's just one of BBC blockbuster's howlers\n-\nKhloe Kardashian nearly upstages her friend at her birthday party as fans go wild over her 'amazing' look\n-\nJeremy Clarkson checks out the competition! Star samples a Britpop lager as he takes a break from his Cotswolds farm duties to enjoy Blur star Alex James' festival\n-\nEmily in Paris resumes filming in Venice two days after Netflix show's 'assistant director collapses and dies' in front of horrified crew\n-\nKylie Jenner gets roasted AGAIN after reposting snaps from her most-hated fashion shoot\n-\nThe dark past of William and Kate's 'forever home': Slavery links, an equerry who blew his brains out and a royal break-up...\n-\nThe Kooks frontman Luke Pritchard reveals why Rebel Wilson joined the band on stage and admits they only rehearsed an hour before\n-\nStunning wealth of Coco Gauff, 21, revealed as she's named the world's highest-earning female athlete\n-\nNepo baby son of Walking Dead star and 90s iconic supermodel arrested for assault\n-\nDua Lipa turns 30! Hitmaker sizzles in a sheer halter dress as she celebrates milestone birthday with intimate dinner while paying tribute to parents\n-\nSydney Sweeney who? Awards panel unveils 25 greatest films list with stars over 60 amid Hollywood's youth obsession\n-\nClaudia Schiffer sports a football shirt as she cheers on Brentford with husband Matthew Vaughn at the Gtech Community Stadium - after filmmaker invested in Premier League club\n-\nSophie Ellis Bextor stuns in glitter mini dress she makes surprise appearance at Reading Festival to perform Murder on the Dancefloor\n-\nAnd Just Like That... woke storylines killed the SATC reboot: From Miranda's 'late life lesbianism' to Charlotte's family gender issues - the moments that left viewers cringing\n-\nI met Amanda Holden when the Britain's Got Talent cameras weren't rolling - she showed her true colours straight away\n-\nLove Island's Yasmin Pettet reveals emotional reason she 'hasn't been intimate' with boyfriend Jamie Rhodes after leaving the villa\n-\nCountry superstar says chance meeting with Taylor Swift at Travis Kelce's charity camp lit up collab hopes\n-\nEXCLUSIVE\nSecret Lives of Mormon Wives explodes with lesbian twist as stars KISS in steamy first look at Season 3\n-\nImpossible contestant sent home empty-handed after struggling with a Harry Potter question on axed BBC show - but could YOU have guessed it?\n-\nBBC star Michael Ball reveals his mother has died as devastated singer is flooded with support by fans\n-\nSydney Sweeney's Americana director defends flop after box office crash\n-\nQueen Camilla is stylish in blue as she steps out at the final day of the York races\n-\nVicky Pattison leaves fans 'horrified' as she lets a dog lick her mouth in 'stomach churning' clip\n-\nBrookside legend Sue Johnston set to reprise iconic role after 35 years in historic Hollyoaks crossover\n-\nDrake back in bed with Bobbi Althoff after viral feud as they tease new project\n-\nLeona Lewis reveals how motherhood has changed her - as she gears up for her first-ever Las Vegas residency"
    }
  ],
  "argos_summary": "Zoe Kravitz was photographed walking arm‑in‑arm with pop star Harry Styles in Rome, sparking fan speculation about a new romance just days after her recent flirty outing with co‑star Austin Butler. The actress, who has been linked to several high‑profile partners—including ex‑fiancé Channing Tatum—continues to be the focus of celebrity relationship rumors. Meanwhile, her film \"Caught Stealing\" with Butler has drawn attention to their on‑screen chemistry. The story highlights Kravitz’s ongoing media attention as she navigates new romantic possibilities while promoting her latest project.",
  "argos_id": "SAOJXX8OS"
}