{
  "url": "https://www.bloomberg.com/news/videos/2025-08-20/balance-of-power-late-edition-8-20-2025-video?srnd=phx-economics-v2",
  "authorsByline": "bn",
  "articleId": "c6cb1b7139eb411bb83066a1ae67a618",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iEhFN5N1I_8U/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-20T23:56:48.588000+00:00",
  "addDate": "2025-08-21T00:21:04.160800+00:00",
  "refreshDate": "2025-08-21T00:21:04.160801+00:00",
  "score": 1.0,
  "title": "Trump Demands Lisa Cook Resign From Fed Board",
  "description": "\"Balance of Power: Late Edition\" focuses on the intersection of politics and global business. On today's show, Wally Adeyemo, former US Deputy Treasury Secretary under the Biden Administration, discusses how President Trump’s pressure campaign to get Federal Reserve Governor Lisa Cook to resign attacks the Fed’s independence. Danielle DiMartino Booth, QI Research CEO & Chief Strategist, on what to expect to hear from Federal Reserve Chairman Powell's speech at Jackson Hole. Leon Panetta, Former US Secretary of Defense, on what security guarantees the US and Europe should give to Ukraine. Databank CEO, Raul Martynek, on can the US energy grid support the demand from AI, and Rob Bonta (D) California Attorney General talks about California joining the growing redistricting war. (Source: Bloomberg)",
  "content": "> > THIS IS \"BALANCE OF POWER.\" > > FROM BLOOMBERG'S WASHINGTON TV STUDIOS TO OUR TV AND RADIO AUDIENCES WORLDWIDE, WELCOME TO \"BALANCE OF POWER.\" > > TRUMP RATCHETS UP THE PRESSURE ON THE FEDERAL RESERVE. > > THE STRONG WORDS FROM THE PRESIDENT TARGETING ANOTHER MEMBER OF THE FED. THIS TIME FED GOVERNOR LISA COOK. WHAT THE PRESIDENT IS ALLEGING ON THE EVE OF THE JACKSON HOLE FORUM AND HOW WASHINGTON IS REACTING. > > FOLLOWING ANOTHER RUSSIAN DRONE BARRAGE, NATO'S DEFENSE CHIEFS MEET ON THE NEXT STEPS TO GUARANTEE SECURITY FOR UKRAINE. WE WILL DISCUSS WHAT A POTENTIAL OUTCOME MIGHT LOOK LIKE WITH THE FORMER DEFENSE SECRETARY. > > HOW CALIFORNIA IS LOOKING TO MATCH TEXAS' REDISTRICTING EFFORTS WHEN CALIFORNIA'S ATTORNEY GENERAL JOINS US. > > ONE MONTH AFTER THE PRESIDENT SIGNED A SERIES OF ARTIFICIAL INTELLIGENCE EXECUTIVE ORDERS ARE WE HEADED FOR A DATA CENTER BONANZA? IN NORTHERN VIRGINIA'S DATA CENTER ALLEY FOR HOW THE ISSUE IS PLAYING OUT ON THE GROUND. WE BEGIN WITH THE LATEST FROM THE TRUMP ADMINISTRATION. THE PRESIDENT RAMPING UP ATTACKS ON THE FEDERAL RESERVE. THIS TIME AIMING HIS IRE AT LISA COOK, CALLING FOR HER RESIGNATION AFTER TRUMP APPOINTEE FHFA DIRECTOR BILL PULTE URGED AN INVESTIGATION INTO COOK OVER A PAIR OF MORTGAGES. TRUMP TAKING TO TRUTH SOCIAL TO POST COOK, WHO WAS APPOINTED BY JOE BIDEN, \"MUST RESIGN NOW,\" CITING HER ALLEGATIONS. > > IT ALL COMES AS THE JACKSON HOLE ECONOMIC POLICY SYMPOSIUM KICKS OFF WITH FED CHAIR JEROME POWELL SLATED TO SPEAK 2 DAYS FROM NOW. WE HAVE THE NEWS COVERED FOR YOU WITH KATE SULLIVAN FROM THE WHITE HOUSE, MICHAEL MCKEE IN JACKSON HOLE, FORMER SECRETARY -- WITH US IN WASHINGTON. WE BEGIN WITH KATE SULLIVAN. THANKS FOR BEING HERE. BREAK DOWN WHAT WE ACTUALLY KNOW ABOUT THESE ALLEGATIONS PRESIDENT TRUMP IS PUSHING WHEN IT COMES TO FED GOVERNOR LISA COOK. > > TRUMP IS TRYING TO EXERT POWER AND CONTROL OVER THE FED. AS YOU MENTIONED, HE CALLED ON THE FED GOVERNOR TO RESIGN. IN THE TRUTH SOCIAL POST WHERE HE CALLED ON HER TO RESIGN, HE SHARED A BLOOMBERG ARTICLE WRITTEN BY JOSH WINGROVE THAT WAS TALKING ABOUT WHAT THE ALLEGATIONS WERE. THE FEDERAL HOUSING FINANCE AGENCY DIRECTOR IS URGING PAM BONDI TO INVESTIGATE COOK OVER A PAIR OF MORTGAGES SHE TOOK OUT. THE ALLEGATIONS ARE HIM SUGGESTING THERE COULD BE CRIMINAL ACTIVITY AND CLAIMING SHE FALSIFIED A BANK DOCUMENTS AND PROPERTY RECORDS TO GET A MORE FAVORABLE LOAN. TRUMP IS POINTING TO THESE ALLEGATIONS TRYING TO PRESSURE ANOTHER TOP FED OFFICIAL TO RESIGN. > > KATE SULLIVAN, WE THANK YOU FOR YOUR REPORTING. NOW FOR A CLOSER LOOK INTO WHAT PRESIDENT TRUMP'S RECENT FED BECAUSE FOR THE CENTRAL BANK, WE TURNI TO MICHAEL MCKEE JACKSON HOLE AHEAD OFN THE POLICY SYMPOSIUM. LET'S START WITH THE PRESSURE CAMPAIGN WE HAVE SEEN FROM THE WHITE HOUSE. -- THIS IS LIKELY TO PLAY OUT. > > THE FEDERAL RESERVE ACT SAID GOVERNORS ARE APPOINTED TO 14 YEAR TERMS UNLESS REMOVED BY THE PRESIDENT FOR CAUSE. IT IS THAT FOR CAUSE CLAUSE THAT IS AT ISSUE. THE SUPREME COURT SAID THE DECISION EARLIER THIS YEAR THAT THE WAY THE FED IS SET UP, THE FED PRESIDENT CANNOT JUST FIRE SOMEBODY. THEY NEED TO HAVE A REASON. BILL PULTE IS ALLEGING THERE IS A REASON, THAT IT IS FRAUD ON HER MORTGAGE APPLICATIONS, THAT WOULD BE CAUSE. NOW WHETHER LISA COOK IS ON THE BOARD IS NOT REALLY GOING TO HELP THE PRESIDENT AND HIS DESIRE TO GET LOWER INTEREST RATES. SHE VOTES FOR THE MAJORITY ALL THE TIME AND WITH THE CHAIR. AT THIS POINT SHE IS CONSIDERED SOMEONE WHO IS NOT GOING TO BREAK RANKS. IF THE MAJORITY VOTES FOR A RATE CUT, SHE WOULD GO ALONG. WHAT MAY BE HAPPENING IS THE PRESIDENT IS LOOKING TO GET HER OFF THE BOARD TO APPOINT A FOURTH MEMBER TO THE FED GOVERNOR'S BOARD, THEN HE WOULD HAVE SOME SORT OF CONTROL IF HE COULD GET ALL 4 OF THE MEMBERS HE HAS APPOINTED IN THE FED AND TRY TO PUSH INTEREST RATES LOWER AND DO SOME OTHER POLICY CHANGES AT THE CENTRAL BANK. > > MICHAEL MCKEE, THANK YOU. NOW FOR A LOOK AT THE ECONOMIC IMPACT OF PRESIDENT TRUMP'S CALL FOR THE FED GOVERNOR TO RESIGN IS A FORMER U.S. DEPUTY TREASURY SECRETARY IN THE BIDEN ADMINISTRATION WHO JOINS US IN OUR. WASHINGTON BUREAU THANK YOU FOR BEING WITH US. -- WHEN IT COMES TO THE U.S. POSITION OF GLOBAL TRUST ACROSS THE WORLD ECONOMY. > > IT IS IMPORTANT TO LOOK AT THIS AS AN ATTACK ON ONE INDIVIDUAL FED GOVERNOR, BUT AN ATTACK ON AN INSTITUTION. THE INDEPENDENCE OF THE FEDERAL RESERVE HAS BEEN AT ITS CORE CENTER TO THE CONFIDENCE INVESTORS AROUND THE WORLD HAVE IN THE U.S. ECONOMY. IN MY OLD JOB, ONE OF THE THINGS I DID WAS MEET WITH INVESTORS OF THE U.S., BUT PEOPLE AROUND THE WORLD WHO WANT TO DEPLOY CAPITAL IN THE U.S., AND ONE OF THE REASONS THEY FELT CONFIDENT WAS THE RULE OF LAW AND THE STRENGTH OF OUR INSTITUTIONS. ONE OF THE STRONGEST INSTITUTIONS HAS BEEN THE FEDERAL RESERVE. MAINTAINING THAT INDEPENDENCE IS KEY TO OUR ECONOMIC GROWTH. THE CALLS FOR VARIOUS FED GOVERNORS TO RESIGN WHO ARE DEMOCRATS AND REPUBLICANS, ALL OF WHOM HAVE FOCUSED ON THE DATA RATHER THAN THE POLITICS, UNDERMINES ONE OF THE KEY STRENGTHS OF THE ECONOMY. > > A QUICK FOLLOW ON THE NOTION OF TRUST, WHAT DOES IT MEAN IN THE WORLD'S TRUST IN THE DOLLAR, THE GLOBAL RESERVE CURRENCY? > > THE REALITY IS ONE OF THE THINGS THE FED IS CHARGED WITH IS MAKING MONETARY POLICY DECISIONS. ULTIMATELY, THOSE DECISIONS AND CALLS THEY MAKE, BEING INDEPENDENT OF POLITICAL INTERFERENCE, IS ONE OF THE REASONS COUNTRIES AROUND THE WORLD ARE WILLING TO LEND MONEY TO THE U.S., KNOWING THAT THE FED WILL MAKE A DECISION BASED ON ITS DUAL MANDATE, NOT BASED ON POLITICS. REGARDLESS IF A PRESIDENT IS DEMOCRAT OR REPUBLICAN. HAVING THAT CONFIDENCE IN THE FED IS IMPORTANT TO NOT DEMOCRATS OR REPUBLICANS, BUT AMERICANS IN TERMS OF OUR ABILITY TO MAKE SURE WE HAVE AN ECONOMY THAT CONTINUES TO GROW. > > THE FED MONETARY POLICY AND THE WAIT AND SEE MODE FROM THE CENTRAL BANK HAS TO DO WITH THE PARENT -- PRESIDENT'S TARIFFS PLANS. I WANT TO PULL A QUOTE FROM A PIECE WHERE YOU WRITE \"TRUMP DESERVES SOME CREDIT FOR FORCING THE WORLD TO GRAPPLE WITH THE FAILURES OF THE EXISTING GLOBAL TRADE ORDER, DECADES OF DE INDUSTRY LESION HAS LED TO SWATHS OF THE AMERICAN WORKFORCE AND UNDERMINES U.S. SECURITY BY CREATING SUPPLY-CHAIN DEPENDENCIES ON POTENTIAL ADVERSARIES. WHEN WE ARE LOOKING HOLISTICALLY AT THE WHITE HOUSE'S TARIFFS PLANS, WHAT IN YOUR VIEW IS WORKING VERSUS WHAT IS NOT? > > WHAT THE PRESIDENT HAS DONE IS FOCUS ATTENTION ON THE ISSUE, BUT WHAT WE NEED IS A TRADE STRATEGY THAT LOWERS COSTS FOR THE AMERICAN PEOPLE, CREATES MANUFACTURING JOBS FOR WORKERS AND COMPANIES, BUT ALLOWS AMERICANS TO BE ABLE TO EXPORT THINGS TO THE REST OF THE WORLD. WHAT IS WORKING IS THE PRESIDENT HAS DRAWN ATTENTION TO THE ISSUE. THE CHALLENGE IS THE STRATEGY HE HAS PUT IN PLACE IS INCREASING COSTS ON AMERICANS. THE BEST EXAMPLE IS THE F-150 TRUCK, MADE IN THE U.S. WHEN YOU LOOK AT THE TARIFF TAXES ON THAT VEHICLE, IT IS GOING TO COST MORE THAN A TOYOTA CAR. THAT IS MADE IN THE U.S., IT WILL COST MORE FOR TARIFFS THAN A TOYOTA VEHICLE MADE IN JAPAN SHIPPED TO THE U.S. THAT CANNOT BE AN OUTCOME ANYONE WANTS. > > PART OF THE ADMINISTRATION'S PUSH HAS BEEN THE IDEA OF NATIONAL SECURITY. THE SECTION 200 32 TARIFFS. YOU TALKED ABOUT THE EMPHASIS ON NATIONAL SECURITY CAR BOUNCE. TALK ABOUT WHAT THE ADMINISTRATION WOULD NEED TO THREAD WHEN YOU HEAR PERHAPS THE CURRENT TREASURY SECRETARY TALKING ABOUT THE DIFFERENCE BETWEEN DECOUPLING VERSUS DE-RISKING WHEN WE ARE LOOKING AT THOSE COUNTRIES WHERE WE HAVE THE NATIONAL SECURITY CONCERNS LIKE CHINA? > > ONE OF THE IMPORTANT THINGS ABOUT THE NATIONAL SECURITY ISSUES IS THEY BE DONE IN A BIPARTISAN WAY. WE DO IT WITH THE CHIPS AND SCIENCES ACT, ALLOWING AMERICA TO BUILD CHIPS IN A CUTTING EDGE WAY. BUT WE HAVE TO SEPARATE OUT WHAT IS NATIONAL SECURITY VERSUS ECONOMICS. SOME SAY BUILDING TEXTILES AND SHOES IN THE U.S. IS A KEY TO NATIONAL SECURITY. THAT CANNOT BE TRUE. WE NEED TO FOCUS ON TRUE NATIONAL SECURITY CONCERNS, BE THEY CHIPS OR THINGS LIKE CRITICAL MINERALS KEY TO OUR DEFENSE INDUSTRIAL BASE BECAUSE DOING SO WILL ALLOW US TO INVEST IN THESE THINGS, PROTECT THE U.S., BUT ALLOW AMERICAN COMPANIES AND FIRMS TO COMPETE WITH THE REST OF THE WORLD. WE ARE IN THE MIDDLE OF EARNINGS SEASON. WHEN WE HEAR THESE CEOS TALK, THEY MAKE IT CLEAR TARIFFS ARE COSTING MONEY AND THEY PLAN ON PASSING THOSE COSTS ONTO THEIR CONSUMERS. THAT IS NOT IN ANYONE'S INTEREST. WE NEED A STRATEGY THAT ALLOWS AMERICAN COMPANIES TO GROW, WORKERS TO EARN MONEY, AND FOR US TO SELL AMERICAN GOODS AROUND THE WORLD. > > YOU BROUGHT UP THE CHIPS AND SCIENCES ACT. WE ARE SEEING AND HAVE BROKEN THE NEWS THE ADMINISTRATION IS WEIGHING WHETHER TO USE THE CHIPS ACT MONEY TO TAKE AN EQUITY STAKE IN INTEL AND PERHAPS OTHER COMPANIES? IS IT A GOOD USE OR PROPER USE OF THAT MONEY? IS IT AN EFFECTIVE STRATEGY TO HAVE THE GOVERNMENT TAKING THE OWNERSHIP STAKE IN COMPANIES LIKE THAT? > > MY VIEW IS I BELIEVE IN THE PRIVATE SECTOR AND ITS ABILITY TO INNOVATE AND A SHOULD LARGELY STAY OUT OF RUNNING PRIVATE COMPANIES UNLESS IT IS ABSOLUTELY NECESSARY. BASED ON WHAT WE HAVE SEEN BASED ON PRIVATE INVESTMENTS IN INTEL, THE KEY IS TO MAKE SURE THAT WHAT THE GOVERNMENT DOES, ESPECIALLY WITH CHIPS AND SCIENCES MONEY, IS CREATE INVESTMENTS THAT ALLOW THEM TO CREATE GOOD PAYING JOBS IN THE U.S. AND UNLOCK THE ABILITY OF THE PRIVATE SECTOR TO DELIVER FOR THE AMERICAN PEOPLE. WHEN THE CHIPS AND SCIENCE ACT WAS PASSED, IT WAS DONE ON A BIPARTISAN BASIS BECAUSE WE KNEW THAT IN ADDITION TO NATIONAL SECURITY CONCERNS, WE WANTED TO MAKE SURE WE HAVE THE ABILITY TO CREATE GOOD PAYING JOBS IN THE U.S. THE GOAL WAS NOT FOR THE U.S. GOVERNMENT TO BE THE DRIVER OF CHIP CREATION. WE WANTED TO MAKE SURE AMERICAN COMPANIES NOT ONLY BUILT CHIPS FOR AMERICA, BUT TO MY POINT, THE CHIPS THAT WERE BUILT HERE, WE COULD SHIP TO THE REST OF THE WORLD SO AMERICAN JOBS COULD BE CREATED AT SHIPPING THINGS ACROSS THE WORLD. > > MOVING FORWARD, WHEN YOU SEE THE ADMINISTRATION TAKE MORE HANDS-ON INDUSTRIAL POLICY, WE SAW THIS WITH THE NEW POND DEAL, THE SO-CALLED GOLDEN SHARE. HOW DO YOU SEE THIS EVOLVING IF IT APPEARS TO BE THE PATH THAT AT LEAST THIS ADMINISTRATION IS ON? > > THE REALITY WAS IN THE BIDEN ADMINISTRATION, A GREAT DEAL WAS DONE WHEN IT CAME TO INDUSTRIAL POLICY. THE QUESTION IS AROUND ARE YOU CREATING INCENTIVES AND ALLOWING THE PRIVATE SECTOR TO TAKE IT FROM THERE? OR IS THE GOVERNMENT TAKING OWNERSHIP STAKE AND CONTROLLING COMPANIES AND THE ECONOMY? MY VIEW IS WE SHOULD LET THE PRIVATE SECTOR DO WHAT IT DOES WELL, INNOVATE, CREATE JOBS, AND MOVE FORWARD. IN SOME CASES, IT IS IMPORTANT FOR THE GOVERNMENT TO CREATE INCENTIVES. WE HAVE DONE THAT ON CHIPS AND SCIENCE AND WE NEED TO DO IT IN SELECT INDUSTRIES KEY TO OUR NATIONAL SECURITY AND BUILDING OUR ECONOMY. THE CHALLENGE IS TARIFFS, INSTEAD OF CREATING THOSE OPPORTUNITIES AND CREATING JOBS, WE SEE THEY ARE INCREASING THE COST FOR CONSUMERS AND MAKING IT HARDER FOR COMPANIES TO OPERATE. > > THE SOONER WE START SEEING THOSE COSTS PLAY THEIR WAY THROUGH THE ECONOMY FROM BUSINESSES AND TO CONSUMERS, -- > > I'M SURPRISED YOU HAVE NOT SEEN MORE. THE EARNINGS CALLS, CEOS ARE MAKING CLEAR YOU ARE SEEING THE COST INCREASES AND THEY ARE PASSING THEM TO CONSUMERS. ON THE CHALLENGE IS AS YOU LOOK AT THE LABOR MARKET AND YOU ARE STARTING TO SEE APPAREL COSTS, AND AS PARENTS GET READY TO GO SHOPPING FOR BACK TO SCHOOL, THEY WILL SEE POTENTIALLY HIGHER COSTS FOR CLOTHING. THESE COMPANIES ARE SEEING HIGHER COSTS FOR INPUTS. THAT MEANS AMERICAN COMPANIES HAVE TO BE LESS COMPETITIVE, COMPANIES IN CHINA OR THE REST OF THE COMPANIES IN THE WORLD, THAT IS NOT ANYONE'S GOAL. WE THINK IT IS IMPORTANT FOR US TO WORK TOGETHER WITH OUR ALLIES TO LOWER TARIFFS AND JOINTLY CONFRONT CHINA IN A WAY THAT ALLOWS US TO CREATE JOBS, LOWER COSTS, AND CREATE OPPORTUNITIES FOR AMERICAN COMPANIES TO SELL THINGS NOT JUST IN THE U.S., BUT AROUND THE WORLD. > > FASCINATING CONVERSATION. THE FORMER U.S. DEPUTY TREASURY SECRETARY UNDER THE BIDEN ADMINISTRATION, THANK YOU FOR JOINING US. AS PRESIDENT TRUMP CALLS FOR THE FED GOVERNOR LISA COOK TO RESIGN, THE CENTRAL BANK LEADERS ARE GATHERING IN JACKSON HOLE TO AWAIT JEROME POWELL'S SPEECH. HIS FINAL SPEECH AS FED CHAIR AT THE ECONOMIC POLICY SYMPOSIUM. HERE ARE SOME ANALYSTS ON BLOOMBERG SURVEILLANCE PREVIEWING THE REMARKS WE COULD EXPECT LATER. > > THERE IS LINGERING CONCERNS ABOUT WHAT WILL HAPPEN FRIDAY. IF THERE IS A DOWNSIDE RISK TO HIS COMMENTS, IT WILL BE MIGHT SOMETHING THAT DINGS HOMEOWNERS. > > UNLIKE LAST YEAR WHEN POWELL MADE IT CLEAR A CUT WAS COMING IN SEPTEMBER 2020 FOUR. HE WILL KEEP HIS OPTIONS OPEN. > > WHAT WE ARE LIKELY TO SEE HIS HEARING FROM THE OTHER CENTRAL BANKERS, PUSHING BACK AT DEFENDING THE FED, THE IMPORTANCE OF INDEPENDENCE. > > FOR MORE INSIGHT INTO THIS WEEK'S SYMPOSIUM, WE TURN TO DANIEL DEMARTINO BOOTH, SHE JOINS US FROM WORLD HEADQUARTERS IN NEW YORK. THANK YOU FOR BEING HERE. AS WE HEAD INTO FRIDAY'S SPEECH WITH JEROME POWELL, PERHAPS OVERSHADOWING IS THESE NEW ALLEGATIONS FROM PRESIDENT TRUMP WHEN IT COMES TO FED GOVERNOR LISA COOK. DOES YOUR INITIAL REACTION ON HOW INVESTORS SHOULD BE WEIGHING THIS RHETORIC FROM THE ADMINISTRATION AS WE GET THE MINUTES TODAY AND POWELL'S SPEECH ON FRIDAY? > > WE ARE IN AN INTERESTING TIME. THE ADMINISTRATION PROBABLY HAS A GREATER APPRECIATION FOR THE HISTORY OF MARRINER ECCLES, WHO IN 1948, WHEN TRUMAN BOOTED HIM OUT AS THE CHAIR OF THE FED, DECIDED TO FINISH OUT HIS 14 YEAR TERM AS A FED GOVERNOR. WE KNOW THAT JAY POWELL CAN STAY THROUGH THE END OF JANUARY 2028. AND AS SUCH, IT IS CLEAR THE ADMINISTRATION FEELS LIKE IT NEEDS TO MAKE ROOM TO PUT SOMEBODY ELSE ON THE COMMITTEE THAT IS GOING TO SPEAK IN ITS VOICE. I THINK THAT IS A LOT OF WHAT IS DRIVING THIS. THE BLOOMBERG TERMINAL HAD A GREAT STORY COVERING THE PHILADELPHIA FED AND RESEARCH IT CONDUCTED AND RELEASED IN 2023 THAT SHOWS THIS TYPE OF MORTGAGE FRAUD, WHICH IS BEING ALLOCATED, THIS IS 2% TO 3% OF THE MORTGAGES THAT HAVE EXISTED AFTER THE HOUSING BUST OF THE LATE 2000'S. IT IS NOT CRYSTAL CLEAR THE ADMINISTRATION WILL PREVAIL, BUT IT IS CLEAR TRUMP REALLY WANTS TO CHANGE THE COMPLEXION OF THE LEADERSHIP AT THE FED ONE WAY OR ANOTHER. > > WHAT DO YOU EXPECT FROM CHAIR JAY POWELL DURING HIS REMARKS ON FRIDAY WHEN IT COMES TO DEFENDING FED INDEPENDENCE? THIS IN A WAY WILL BE HIS VALEDICTORIAN REMARKS AT JACKSON HOLE AS FED CHAIR. IT WOULD BE AN OPPORTUNITY PERHAPS FOR HIM TO LAY DOWN MORE OF A MARKER. > > IT CERTAINLY WOULD. INDEMNIFYING HIS LEGACY IS CLEARLY GOING TO BE FRONT AND CENTER FOR HIM. HE WILL LEAN ON THE IMPORTANCE OF FED INDEPENDENCE. AND AS YOUR PRIOR GUEST SAID, THAT WILL BE EXTREMELY IMPORTANT FOR EVERYBODY IN THE AUDIENCE AS WELL. HE WILL HAVE A VERY WELCOMING AUDIENCE THAT WANTS TO SAFEGUARD THE INDEPENDENCE OF THE FED. I THINK A LOT REMAINS ON TOMORROW MORNING'S DATA, WE WILL GET THE SURVEY WE DATA OUT FOR AUGUST PAYROLLS IN THE INITIAL JOBLESS CLAIMS DATA RELEASED TOMORROW. WE HOPE THAT IS AS BENIGN AT IS -- AS IT HAS BEEN RECENTLY. BUT POWELL GIVEN THE THEME OF JACKSON HOLE, CENTERS ON THE LABOR MARKET, HE DOES NOT NEED MORE AMMUNITION AGAINST HIM IN THE HARD DATA. > > BUILDING OFF OF WHEN WE ARE TALKING ABOUT THE LABOR MARKET, WE GOT THE FOMC MINUTES. THE MAJORITY SEEING INFLATION RISKS OUTWEIGHING EMPLOYMENT RISKS. THEY ALSO SAID PERHAPS NOT SURPRISINGLY THAT SEVERAL COMMITTEE MEMBERS EXPECTED COMPANIES WILL PASS ON THOSE TARIFFS TO CONSUMERS. AND WONDERING WHICH SECTORS YOU ARE WATCHING. I ALSO WANT TO POINT OUT ANOTHER DATA POINT. HOW DOES LOWER INCOME GROWTH LIMIT THE EXTENT TO WHICH FIRMS CAN PASS ON THOSE COSTS TO CONSUMERS? > > YOU BRING UP A VALID POINT. IT IS NOT THAT AMERICAN COMPANIES DON'T WANT TO PASS ALONG HIGHER INPUT COSTS, WE ARE SEEING THE MARGIN SQUEEZE PLAY OUT IN REAL TIME. IS THERE PURCHASING POWER? THE ATLANTA FED WAGE GROWTH TRACKER ISN'T SHOWING A SUSTAINED DECLINE IN WAGE GAINS ALL THE WAY BACK TO WHERE WE WERE PRIOR TO THE PANDEMIC. AND YOU HAVE MULTIPLE -- RECORD NUMBERS OF AMERICANS WORKING MULTIPLE JOBS. PLENTY WORKING PART-TIME WHEN THEY WOULD RATHER HAVE FULL-TIME POSITIONS. 440 THOUSAND FULL-TIME POSITIONS WERE LOST IN THE MONTH OF JULY ALONE. THAT PURCHASING POWER IS ABSOLUTELY KEY. ONE OF THE REASONS WE SEE FOOD INFLATION REIGNITE IN AREAS WHERE YOU ABSOLUTELY HAVE NO CHOICE BUT TO PASS ALONG THOSE HIGHER INPUT COSTS. IT REMAINS TO BE SEEN, TO ME AT LEAST, WHEN WE WILL SEE THE TARIFFS PASS THROUGH IN MORE DISCRETIONARY CONSUMPTION AREAS. > > DANIEL DEMARTINO BOOTH, CEO AND CHIEF STRATEGIST AT QI RESEARCH. TURNING OVERSEAS NOW. WHERE UKRAINE WAS HIT OVERNIGHT BY A BARRAGE OF RUSSIAN DRONES, IGNITING A FIRE AT AN ENERGY FACILITY IN THE ODESSA REGION THAT HAD EMERGENCY WORKERS RACING TO THE SCENE. A DRONE CRASHING INTO POLAND. POLAND AND EU AND NATO MEMBER CLAIMING THE CRASH WITH A PROVOCATION FROM RUSSIA. THAT COMING THE SAME DAY THE NATO MILITARY CHIEFS MET REMOTELY AS WE AWAIT MORE DETAILS FROM A POTENTIAL TRILATERAL MEETING BETWEEN PRESIDENT TRUMP, VLADIMIR PUTIN, AND ZELINSKI. FOR MORE, LEON PANETTA, FORMER U.S. SECRETARY OF DEFENSE AND FORMER DIRECTOR OF THE CIA. THANK YOU FOR JOINING US. WE WANT TO START WITH THIS QUESTION OF SECURITY GUARANTEES, THE MAIN AND DRIVING TOPIC OF UKRAINE SINCE THE MEETING ON MONDAY AT THE WHITE HOUSE BETWEEN PRESIDENT TRUMP AND EUROPEAN LEADERS. TO YOUR VIEW, WHAT DO SECURITY GUARANTEES NEED TO LOOK LIKE TO ESSENTIALLY PREVENT A REPEAT OF WHAT HAPPENED IN 19 94 WITH THE BUDAPEST MEMORANDUM, THAT LEFT UKRAINE OVER THE LONG RUN SHORT OF AN ADEQUATE DEFENSE AGAINST A POTENTIAL RUSSIAN INVASION? > > THE PRIMARY POINT THAT NEEDS TO BE MADE WITH THESE SECURITY ASSURANCES IS THE UNITED STATES AND OUR EUROPEAN ALLIES, PARTICULARLY THOSE PART OF NATO, WILL IN FACT MAKE CLEAR THEY WILL COME TO THE ASSISTANCE OF UKRAINE IF RUSSIA SHOULD ATTACK IN THE FUTURE. EUROPE HAS INDICATED THEY ARE PREPARED TO MOVE IN THAT DIRECTION. I THINK THE PRESIDENT INDICATED HE WAS PREPARED TO SUPPORT SECURITY CLEARANCES, EVEN THOUGH HE PULLED BACK ON BOOTS ON THE GROUND. HE DID SAY THEY WOULD LOOK SERIOUSLY AT PROVIDING AIR SUPPORT TO HELP IN THOSE SECURITY ASSURANCES. THE ONE PROBLEM RIGHT NOW IS RUSSIA IS SAYING SOMEHOW IT NEEDS A VETO POWER OVER WHAT THOSE ASSURANCES LOOK LIKE. SINCE THE PRIMARY PURPOSE OF THOSE SECURITY ASSURANCES IS TO BE ABLE TO PROTECT UKRAINE FROM A RUSSIAN INVASION, I'M NOT SO SURE THAT SOMETHING IS GOING TO HAPPEN. > > MR. SECRETARY, WE HAD BLOOMBERG NEWS REPORTING THAT EUROPEAN LEADERS ARE DISCUSSING A GUARANTEE FOR UKRAINE THAT WOULD COMMIT ALLIES TO DECIDE WITHIN 24 HOURS WHETHER TO PROVIDE MILITARY SUPPORT TO THE COUNTRY IF IT WAS ATTACKED AGAIN BY RUSSIA. MUCH TO YOUR POINT. TO DRILL DOWN FURTHER ON THIS, I'M WONDERING WHAT IS REALISTIC? WHAT SHOULD WE EXPECT FROM THE U.S. WHEN IT COMES TO THEIR SIDE OF CONTRIBUTE INTO THESE GUARANTEES? WE HEAR ABOUT AIR COVER. THAT SEEMS TO BE AN EMERGING THEME IN THESE DISCUSSIONS. > > TO BE FAIR, SECURITY ASSURANCES ARE NOT GOING TO WORK UNLESS THE U.S. IS PART OF THAT AGREEMENT. WE BRING A LOT TO THE TABLE FROM A MILITARY POINT OF VIEW AND THE ABILITY TO TRY AND SUPPORT ANY MILITARY EFFORT THAT MIGHT HAVE TO OCCUR ON THE GROUND. IT IS VERY IMPORTANT THAT U.S. BE PART OF THOSE SECURITY ASSURANCES AND EUROPE AGREE THAT THEY WILL COME TOGETHER AND SUPPORT UKRAINE IN THAT EVENT. I THINK 24 HOURS PROBABLY MADE SOME SENSE. BUT IT REALLY HAS TO LOOK LIKE IMPLEMENTATION OF A TITLE V KIND OF APPROACH THAT ONCE RUSSIA DECIDES TO INVADE UKRAINE AGAIN, ALL OF THE NATIONS OF NATO WILL AGAIN RESPOND AS THEY HAVE. > > LAST NIGHT, WE SPOKE WITH WILLIAM TAYLOR, FORMER U.S. AMBASSADOR TO UKRAINE. HERE'S WHAT HE HAD TO SAY ABOUT THE PROSPECT OF VLADIMIR PUTIN PARTICIPATING IN A BILATERAL OR TRILATERAL MEETING WITH VOLODYMYR ZELENSKYY. > > PUTIN DOESN'T WANT ANY OF IT. HE WANTS TO DRAG IT DOWN. HE WANTS TO KEEP POUNDING THE UKRAINIANS UNTIL THEY GIVE UP. THEY WILL NEVER GIVE UP. HE WILL KEEP POUNDING UNTIL HE'S FORCED TO COME TO THE TABLE FOR A CEASE-FIRE. I DON'T THINK HE HAS ANY INTENTIONS OF COMING TO A BILATERAL MEETING. HE MAY SAY SOMETHING ON THE PHONE TO PRESIDENT TRUMP, TO TELL HIM HE IS WILLING TO DO IT. THEY ARE NOT SERIOUS ABOUT THESE NEGOTIATIONS. VLADIMIR PUTIN WANTS ALL OF UKRAINE AND HE WANTS TO POUND THEM UNTIL HE GETS THAT. > > DIRECTOR, WE HAVE YET TO HEAR FROM MOSCOW ABOUT WHETHER THEY WILL OR WILL NOT AGREE TO A MEETING BETWEEN VOLODYMYR ZELENSKYY AND VLADIMIR PUTIN. HOW MUCH TIME SHOULD DONALD TRUMP GIVE THE RUSSIAN LEADER TO AGREE TO A SIT DOWN, AND WHAT HAPPENS NEXT IF VLADIMIR PUTIN REFUSES? > > AGAIN, THERE IS A FUNDAMENTAL PRINCIPLE THAT YOU TRUST VLADIMIR PUTIN IN THESE ISSUES. YOU JUST CAN'T. I THINK IT IS 88% OF THE AMERICAN PEOPLE SAID DO NOT TRUST VLADIMIR PUTIN. PRETTY GOOD JUDGMENT ON THE PART OF THE AMERICAN PEOPLE. THAT IS THE REALITY. IT IS VERY DIFFICULT TO REALLY TRY TO FIND A WAY TO GET VLADIMIR PUTIN TO NEGOTIATE SERIOUSLY. RIGHT NOW I THINK HE'S LARGELY PLAYING FOR TIME. HE'S CONTINUING THE WAR, HE'S REFUSED TO AGREE TO ANY KIND OF CEASE-FIRE. HE EVEN TALKED ABOUT THE NEED TO ELIMINATE THE ROOT CAUSES OF THE WAR. WHILE THE ROOT CAUSE OF THE WAR WAS THAT RUSSIA INVADED UKRAINE ON THE BASIS THAT IT IS A PART OF RUSSIA AND NOT A SOVEREIGN DEMOCRACY ON ITS OWN. HE BASICALLY IS SAYING HE WANTS TO WIN. I THINK IT IS VERY IMPORTANT FOR PRESIDENT TRUMP TO MAKE VERY CLEAR TO VLADIMIR PUTIN HE WANTS HIM TO PARTICIPATE IN THIS TRILATERAL OR MEETING WITH VOLODYMYR ZELENSKYY. AND IF IT DOES NOT HAPPEN, I THINK THE PRESIDENT REALLY HAS TO -- HE'S GOT TO COME BACK AND HOLD TOUGH WITH VLADIMIR PUTIN BY IMPLEMENTING SANCTIONS, PROVIDING WEAPONS, AND MAKING VERY CLEAR TO VLADIMIR PUTIN HE CANNOT WIN THIS WAR. THAT IS GOING TO BE VERY IMPORTANT FOR THE ABILITY TO NEGOTIATE. > > LEON PANETTA, FORMER U.S. SECRETARY OF DEFENSE AND FORMER DIRECTOR OF THE CIA, THANK YOU FOR JOINING US. COMING UP, CALIFORNIA DEMOCRATS HAVE ADVANCED THEIR REDISTRICTING PLAN. REPUBLICAN COLLEAGUES GEARING UP FOR A FIGHT TO THAT PROPOSAL. STICK WITH US. THIS IS BLOOMBERG. ♪ > > THIS IS \"BALANCE OF POWER.\" , ALONGSIDE MICHAEL SHEPARD, I'M TYLER KENDALL. THE ARTIFICIAL INTELLIGENCE RACE HAS BEEN THE DRIVER BEHIND TECH STOCKS RECENT SURGE TO RECORD HIGHS. DEMAND FOR THE DATA CENTERS TO SUPPORT AI IS SO STRONG, THAT BLOOMBERG IS REPORTING MORGAN STANLEY TURNED TO PRIVATE CREDIT INVESTORS FOR $29 BILLION IN FINANCING FOR META-SERVICE. > > IT IS NOT JUST MONEY THEY ARE CONSUMING WITH THE FOUR ATROCIOUS APPETITE. -- FEROCIOUS APPETITE, THEY ARE DEVELOPING POWER AND LAND, MAKING FOR A TENSE SITUATION IN COMMUNITIES NATIONWIDE. FOR MORE, NORTHERN VIRGINIA, A DATA CENTER HOTBED THAT JOSH SAUL VISITED AS PART OF A BLOOMBERG ORIGINALS REPORT. HERE IS A PART OF THAT PIECE. > > HERE IS OUR CONTAINMENT SYSTEM. THIS IS WHERE THE CABINETS LANDED AND LINED UP. > > WHY DOES IT HAVE TO BE COLD? > > WE HAVE TO MAKE SURE THEY STAY COLD WHILE THE SERVERS ARE ON THE INSIDE OF EACH RACK. WE HAVE TO MAKE SURE THE OUTPUT THEY ARE DOING IS STAYING AS COLD AS POSSIBLE SO THEY RUN EFFICIENTLY. > > HOW MUCH ELECTRICITY WITH THIS ROOM CONSUME? > > AT FULL CAPACITY IT CAN GO UP TO FOUR MEGAWATTS OF POWER. > > HOW MANY HOMES COULD THAT POWER? > > BREAK IT DOWN, ONE MEGAWATT CAN POWER ABOUT 3000 TO 4000 HOMES. IT CAN POWER UP TO 12,000 HOMES. > > WHAT ARE WE GOING TO SEE OUT HERE? > > WE ARE ON THE ROOF OF THIS DATA CENTER. IT IS FILLED WITH WHAT WE NEED TO COOL DOWN ALL OF THOSE CRACKED UNITS, THE UNITS WE SAW INSIDE OF THE DATA HALL. THESE ARE CALLED AC USE, AIR CONDITION COMPRESSOR -- > > THEY ARE NOISY. > > YES, THAT IS WHY WE HAVE THE WALLS, IT BOXES IN THE SOUND. WE KEEP RESIDENTS IN MIND TO MAKE SURE THE SOUND IS AS BUFFERED IN AS POSSIBLE. THEY WOULD BE LOUDER DURING THE SUMMERTIME. > > IT IS KIND OF COLD, SHOULD HAVE BROUGHT OUR JACKETS. WHY ARE THEY RUNNING? > > THEY ARE RUNNING ON A FREE POOLING MODE, MEANS THEY ARE USING THE OUTSIDE AIR INSTEAD OF THE BIG FANS. > > WHY IS IT SO IMPORTANT YOU HAVE POWER CONTINUALLY? IF YOU DID NOT HAVE POWER THEY ARE SHUT DOWN FOR A COUPLE OF DAYS. > > WE HAVE HEALTH CARE, TRANSPORTATION, GOVERNMENT. IMAGINE A GOVERNMENT SHUTDOWN, HOW CHAOTIC THAT IS. SOMETHING HAPPENS LIKE THAT IN A DATA CENTER, NO ONE CAN SEND AN EMAIL OR WORK. EVERYONE LOVES THE DAY OFF BUT IT HAS A HUGE IMPACT ON THE NEIGHBORHOOD, THE CITY, THE WORLD. > > I WAS ELECTED IN NOVEMBER 2023. I WANTED TO RUN BECAUSE I DISAGREED WITH THE DIRECTION THE COUNTY WAS GOING IN. PARTICULARLY WITH LAND-USE AND THE DATA CENTERS. DATA CENTERS TO GENERATE REVENUE. AND LAST YEAR WHEN WE RAISED THE TAX RATE, WE GENERATED MORE MONEY FOR THE COUNTY AND OUR SCHOOLS. BUT EVERYTHING IN MODERATION. FOR US, WE HAVE TO BE THE TRAFFIC COP. WE CANNOT APPROVE A DATA CENTER ANY AND EVERYWHERE. THESE ARE INDUSTRIAL WAREHOUSES. THEY SHOULD NOT BE NEXT TO HOMES, SCHOOLS, NATIONAL PARKS. THEY SHOULD BE IN AREAS THAT HAVE ENOUGH POWER TO RUN THESE FACILITIES. THE LAND WE GIVE TO DATA CENTERS IS LAND OF THEIR ARE ABLE TO PURCHASE AND WE ARE NOW ABLE TO USE IT FOR HOUSING OR RETAIL OR ANY OTHER DEVELOPMENT. VIRGINIA IS A BEAUTIFUL COMMONWEALTH, VERY SCENIC. WE HAVE SO MUCH HISTORY HERE. I'M AFRAID THAT WILL BE LOST IF WE ARE JUST GIVING IN TO DATA CENTER DEMANDS. > > WHEN YOU TALK WITH LEGISLATORS, BE CLEAR WE ARE NOT AGAINST DATA CENTERS. WE WANT THEM TO BE BETTER. > > ARE MORNING STARTED EARLY AND IN A REALLY COLD AND DARK PARKING LOT. DATA CENTER OPPONENTS AND WE GOT ON A BUS TO TRAVEL TO RICHMOND WHERE THEY WERE LOBBYING LAWMAKERS FOR WHAT THEY WOULD CALL RESPONSIBLE DATA CENTER DEVELOPMENT. > > TRANSPORTATION, SPEED LIMITS, SAFETY STANDARDS, NOISE LIMITS. WE WILL BE ABOUT AN INDUSTRY IN VIRGINIA THAT IS OVERWHELMING US AND THERE ARE NO LAWS AND STANDARDS. > > WE TRAVELED WITH ONE WOMAN WHO IS SORT OF AT THE CENTER OF THIS FIGHT. SHE'S BEEN GOING TOE TO TOE WITH THE BIGGEST DATA CENTER DEVELOPERS FOR THE PAST DECADE. > > THAT IS SOMETHING I WANT TO MESSAGE THE LEGISLATORS. THE HISTORY BOOKS ARE BEING WRITTEN RIGHT NOW AND THE QUESTION IS WHAT DO YOU WANT THE HISTORY BOOKS TO SAY ABOUT YOU? > > THE FIRST YEAR WE WENT, NO ONE KNEW ABOUT DATA CENTERS. THE NEXT YEAR WE WENT, SUDDENLY PEOPLE ARE STARTING TO GO THERE IS MAYBE SOMETHING ABOUT DATA CENTERS. SO THE LEGISLATIVE REVIEW COMMISSION REPORT FINALLY CAME OUT AND MY FAVORITE WORD WAS UNCONSTRAINED. UNCONSTRAINED DATA CENTER DEVELOPMENT IS RISKING OUR RELIABLE ENERGY AND ARE CLEAN AIR AND CLEAN WATER. THE HEALTH AND WELL-BEING OF THE STATE OF VIRGINIA. > > HAD TO BLOOMBERG ORIGINALS YOUTUBE PAGE TO WATCH THE REST OF THAT REPORT. > > WE WANT TO BRING YOU SOME BREAKING NEWS BREAKING MOMENTS AGO. THE FEDERAL RESERVE GOVERNOR, LISA COOK, ISSUING A STATEMENT FOLLOWING PRESIDENT TRUMP'S ALLEGATIONS OF MORTGAGE FRAUD AND CALLING FOR HER RESIGNATION. SHE SAID IN A STATEMENT \"I HAVE NO INTENTION OF BEING BULLIED TO STEP DOWN. I DO INTEND TO TAKE ANY QUESTIONS ABOUT MY FINANCIAL HISTORY SERIOUSLY AS A MEMBER OF THE FEDERAL RESERVE, SO I'M GATHERING THE ACCURATE INFORMATION TO ANSWER ANY LEGITIMATE QUESTIONS AND PROVIDE THE FACTS. WE WILL BE FOLLOWING THIS STORY ALL DAY ON BLOOMBERG AND WE WILL COME UP WITH MORE NEWS WHEN MICHAEL MCKEE JOINS US FROM JACKSON HOLE. > > FOR NOW, REPORTING ON DATA CENTERS. JOINING US IS A REPORTER FEATURED IN THAT PIECE, JOSH SAUL, WHO JOINS US FROM WORLD HEADQUARTERS IN NEW YORK. ALMOST A MONTH SINCE THE PRESIDENT ANNOUNCED HIS AI ACTION PLAN AND EXECUTIVE ORDERS LOOSENING RESTRICTIONS ON DATA CENTERS. WHAT HAVE WE SEEN CHANGE AND WHAT IS THE VIBE OUT THERE IN THE PLACES WHERE THESE DATA CENTERS ARE GOING TO BE BUILT? > > DATA CENTER DEVELOPERS WERE CHOMPING AT THE BIT TO BUILD HUGE NUMBERS IN THESE NEW FACILITIES. AND UTILITIES ARE EXTREMELY EXCITED FOR THESE NEW CUSTOMERS. I WOULD SAY TRUMP'S ACTION PLAN AND THESE EXECUTIVE ORDERS ARE A TAILWIND, THAT IS KIND OF HEATING UP AN ALREADY SUPER HOT PART OF THE ECONOMY. > > GIVE US A LITTLE BIT MORE INSIGHT INTO WHAT PRESIDENT TRUMP'S AI ACTION PLAN ACTUALLY DOES IN PRINCIPLE. WHAT DID THE ADMINISTRATION OUTLINED WHEN THEY UNVEILED THIS? > > HIS MAIN IDEA NEEDS -- IS THE U.S. NEEDS TO BE THE GLOBAL LEADER IN ARTIFICIAL INTELLIGENCE. THE GRID IS NO LONGER A BORING CONCERN OF UTILITIES, IT IS A TOP NATIONAL PRIORITY. HIS ACTION PLAN, THE EXECUTIVE ORDERS, THEY AIM TO LOOSEN RESTRICTIONS ON AI AND DATA CENTER DEVELOPMENT AND TO SUPERCHARGE ENERGY DOMINANCE AND THE ENERGY SUPPLY SO THERE IS ENOUGH ELECTRICITY MOVING AROUND TO POWER THESE DATA CENTERS. THAT IS CRUCIAL. WITHOUT ELECTRICITY, DATA CENTERS CANNOT REALLY DO ANYTHING. > > FASCINATING STUFF, JOSH SAUL, THANK YOU FOR YOUR REPORTING. AND FOR MORE, TURNING TO ROMAR IN IT, CEO OF DATABANK, THE HOLDER OF OVER 60 DATA CENTERS NATIONWIDE. HE JOINS US FROM WORLD HEADQUARTERS. THANK YOU SO MUCH FOR JOINING. I WANT TO PICK UP ON SOMETHING JOSH WAS JUST TALKING ABOUT WHEN IT COMES TO HOW MUCH ENERGY CONSUMPTION THE DATA CENTERS USE . IN YOUR VIEW, CAN THE U.S. ENERGY GRADE AS IT STANDS RIGHT NOW SUPPORT ALL OF THE DEMAND WE ARE SEEING FROM DATA CENTERS? > > AS JOSH HAS SAID, THERE HAS BEEN A TREMENDOUS AMOUNT OF DEMAND FOR DATA CENTERS ACROSS THE COUNTRY. YOU SEE SOME MARKETS HAVE BEEN STRUGGLING TO MEET THAT DEMAND. ULTIMATELY WHAT IS HAPPENING IS JUST LIKE ANY ECONOMIC SYSTEM, DEVELOPERS ARE GOING TO PLACES WHERE THERE IS POWER, LAND, AN ABILITY TO BUILD THEM. YOU ARE SEEING DATA CENTER DEVELOPMENTS IN PLACES LIKE NORTH DAKOTA AND WESTERN TEXAS, WYOMING, PLACES TRADITIONALLY, DATA CENTERS DID NOT DEVELOP. IT WILL BE A TIGHT SUPPLY AND DEMAND BALANCE. BUT THE SECTOR IS GOING TO CONTINUE TO EVOLVE AND PEOPLE WILL FIND A WAY TO BRING THE DATA CENTERS TO MARKET. > > I WANT TO DRILL DOWN ON THE IDEA OF ENERGY CONSUMPTION'S WITH DATA CENTERS. I WAS AT THE PENNSYLVANIA ENERGY AND INNOVATION SUMMIT. WHERE THE TRUMP ADMINISTRATION UNVEILED A LOT OF ITS PLANS TO KEEP THE U.S. COMPETITIVE WHEN IT COMES TO ARTIFICIAL INTELLIGENCE. AS THE NAME SUGGESTS, ENERGY WAS REALLY THE MAIN COMPONENT HERE. THERE WAS A CONVERSATION ABOUT HOW AI ENERGY DEMAND IS IMPACTING CONSUMERS. I HAD THE CHANCE TO ASK THE COREWEAVE CEO HIS THOUGHTS ON THIS AND WHETHER OR NOT IT IS PROVING TO BE A BURDEN TO CONSUMERS. HERE'S WHAT HE SAID. > > I THINK POLICYMAKERS RAISING THAT ISSUE TO ENSURE DATA CENTERS, THE CONSUMERS OF COMPUTE ARE PAYING THEIR FAIR SHARE IS A COMPLETELY REASONABLE APPROACH. IT IS NECESSARY BUT ALSO NECESSARY TO UNDERSTAND IT IS AN ABSOLUTELY CRITICAL INFRASTRUCTURE BILL THAT IS GOING ON AND WILL CONTINUE TO GO ON FOR MANY YEARS. > > I WOULD LOVE TO GET YOUR VIEW ON THIS. IS IT THE REALISTIC INTERPRETATION? HOW MUCH CONCERN DO YOU HAVE THE CONSUMPTION FROM THESE AI DATA CENTERS COULD POSE A BURDEN ON CONSUMERS WHEN IT COMES TO ENERGY PRICES? > > IT IS A COMPLICATED TOPIC. A LOT TO UNPACK. THE REALITY IS AS PEOPLE KNOW, OVER THE LAST TWO DECADES, ELECTRIC DEMAND IN THE U.S. HAS BEEN TOTALLY FLAT. IT HAS RESULTED IN UNDERINVESTMENT IN THE ELECTRIC GRID. OVER THE LAST FIVE YEARS, A NUMBER OF TRENDS TRENDING TOWARD RENEWABLE ENERGY, THE CHIPS ACT, DRIVING SEMI MAY THE U.S., TRUMP'S POLICIES LOOKING TO BRING BACK MANUFACTURING TO THE U.S., AND YOU HAVE AI DATA CENTERS AND REGULAR DATA CENTERS DRIVING DEMAND. A CLASSIC CASE OF DEMAND AND SUPPLY COMING OUT OF BALANCE AT THIS POINT. ULTIMATELY THESE USERS OF ELECTRICITY, WHEN WE CONNECT TO THE GRID, WE ARE BUYING OFF UTILITY TARIFFS. BY DEFINITION IT IS MADE SO THE UTILITY CAN MAKE -- RECOVER THEIR COSTS AND EARN A RETURN. NO ONE IS GETTING A FREE RIDE. WE ARE PAYING FOR THE POWER WE ARE CONSUMING. AND THE UTILITIES RIGHTLY SO ARE MAKING SURE THEY DON'T BUILD TOO MUCH THAT DOES NOT GET USED IN THE FUTURE. ULTIMATELY THIS IS ALL GOING TO SOLVE ITSELF THROUGH NORMAL MARKET FACTORS. YOU ALREADY SEE IT HAPPEN. > > WE ARE ALREADY SEEING THIS ENTHUSIASM BY THE ADMINISTRATION AND THE TECH INDUSTRY TO BUILD, BAY BE ON AI AND DATA CENTERS. YET THE REPORT WE JUST SAW SUGGESTED THERE MIGHT BE A LITTLE BIT OF FEAR AND LOATHING IN THE COMMUNITIES WHERE SOME OF THESE DATA CENTERS ULTIMATELY MAY BE LOCATED. WHAT IS THE RESPONSIBILITY THAT THE INDUSTRY AND COMPANIES LIKE YOU HAVE TO BE GOOD NEIGHBORS AND ADDRESS ISSUES LIKE NOISE AND OTHER QUESTIONS? > > ABSOLUTELY. I THINK EVERY RESPONSIBLE DATA CENTER DEVELOPER, NOT -- LET'S NOT FORGET THE LARGEST DEVELOPERS ARE KIND OF THE HYPERSCALERS, AMAZON, MICROSOFT, GOOGLE. AS AN INDUSTRY WE HAVE BEEN GOOD NEIGHBORS, WE TRY TO DEVELOP VERY EFFICIENT DATA CENTERS BECAUSE EFFICIENCY IS A WAY WE CAN DRIVE DOWN COSTS. DATA CENTER DEVELOPMENT ONLY OCCURS WITH LOCAL ZONING. WE CANNOT JUST BUILD A DATA CENTER ANYWHERE, WE HAVE TO GO TO PLACES THE LOCAL COMMUNITY HAS DICTATED THAT FROM A ZONING PERSPECTIVE YOU CAN BUILD A DATA CENTER. YOU DO HAVE MARKETS WHERE HISTORICALLY DATA CENTERS HAVE DEVELOPED WITH LESS ZONING CONTROLS LIKE THE NORTHERN VIRGINIA AREA THE VIDEO POINTED OUT. BUT FOR THE MOST PART, WE ARE DEVELOPING IN INDUSTRIAL AREAS, OUTSIDE OF URBAN AREAS. THE TOWN IS TELLING US WE CAN CITE A DATA CENTER. ABOUT 50 MILES SOUTH OF ASHBURN, THERE IS A COMMUNITY CALLED CULPEPER. WHAT THEY DECIDED TO DO IS WE WANT DATA CENTERS, BUT WE WANT TO CONTROL HOW THEY GET DEVELOPED. SO THE CREATED A COUPLE THOUSAND ACRE TECHNOLOGY ZONE. IN THAT AREA, DEVELOPERS CAN BUILD DATA CENTERS BECAUSE IT IS A PLACE WHERE ELECTRICITY CAN BE BROUGHT IN IN A COST EFFECTIVE MANNER AND YOU CAN STILL PRESERVE THE OTHER USES FOR DIFFERENT TYPES OF DEVELOPMENT OUTSIDE OF THAT ECONOMIC ZONE. I LOOK AT EXAMPLES LIKE THAT AS HOW THE DATA CENTER SECTOR CAN COLLABORATE TO BRING THIS COMMODITY TO MARKET. LET'S NOT FORGET WHAT HAPPENS IN THE DATA CENTER IS THE ENTIRE DIGITAL LIFE. EVERYONE WANTS TO WORK REMOTELY, SEND EMAILS, ONCE ACCESS TO MEDICAL HEALTH RECORDS. EVERY DIGITAL INTERACTION ORIGINATES AND TERMINATES IN A DATA CENTER. DATA CENTERS ARE SUPPORTING OUR ECONOMY, A WAY OF LIFE. WE NEED TO FIND A WAY TO HARMONIOUSLY MAKE IT WORK AND LIVE TOGETHER. > > ROMAR NET, CEO OF DATABANK. THANK YOU. TURNING BACK TO THE BREAKING NEWS FROM FED GOVERNOR LISA COOK. PULLING OUT A STATEMENT MOMENTS AGO SAYING SHE IS NOT STEPPING DOWN DESPITE THE PRESIDENT'S CALL FOR HER RESIGNATION. MIKE MCKEE IS BACK WITH US FROM JACKSON HOLE IN WYOMING. WHAT ARE WE SEEING IN THIS STATEMENT? SHE IS STANDING HER GROUND. ARE WE GETTING ANY SENSE THE FED IS CLOSING RANKS AROUND HER AND ARE WE EXPECTING TO SEE HER AT THE SYMPOSIUM IN JACKSON HOLE LATER THIS WEEK? > > SHE WAS EXPECTED HERE, WE DON'T KNOW HER PLANS ARE IF THEY HAVE CHANGED. BUT SHE PUT OUT A STATEMENT A SHORT TIME AGO SAYING SHE WOULD NOT BE BULLIED INTO RESIGNING, STEPPING DOWN BECAUSE OF SOME QUESTIONS RAISED IN A TWEET. SHE INTENDS TO TAKE QUESTIONS ABOUT HER FINANCIAL HISTORY SERIOUSLY AS A MEMBER OF THE FEDERAL RESERVE. GATHERING THE ACCURATE INFORMATION TO ANSWER ANY LEGITIMATE QUESTIONS AND PROVIDE THE FACTS. MORE TO COME ON THIS FROM LISA COOK AND THE FED. AS FAR AS WHETHER THE FED IS CLOSING RANKS AROUND HER, WE ASSUME TO A CERTAIN EXTENT THEY WOULD. FED OFFICIALS WILL NOT HAVE THE ANSWERS EITHER. I WOULD EXPECT MOST OF HER COLLEAGUES ON THE FED WOULD SAY WE CANNOT COMMENT AT THIS TIME. > > CAN YOU GIVE US MORE CONTEXT INTO WHETHER OR NOT THIS IS CLOUDING THIS MEETING THAT IS HAPPENING BY THE KANSAS CITY FED? A LOT OF DIFFERENT THINGS ON THE HORIZON AHEAD OF JEROME POWELL'S SPEECH ON FRIDAY, NOT TO MENTION THE POTENTIAL FOR A SEPTEMBER RATE CUT. > > THERE ARE THREE THINGS ON THE UNOFFICIAL AND OFFICIAL AGENDAS THAT WILL BE OVERLAPPING AND TAKE UP A LOT OF TIME. ONE IS JAY POWELL'S SPEECH AND WHETHER HE GIVES THE MARKETS A HINT OF A SEPTEMBER RATE CUT. THE OTHER IS WHAT IS HAPPENING WITH LISA COOK. SEVERAL SENIOR FED OFFICIALS HAVE ARRIVED IN THE LAST COUPLE OF HOURS AND ALL WE TALKED ABOUT WAS THE LISA COOK ISSUE AT THIS MOMENT. AND WHAT IS IT THE PRESIDENT IS TRYING TO DO TO THE FED? TRYING TO TAKE OVER? TRYING TO TAKE LISA COOK OUT TO APPOINT SOMEBODY ELSE? THAT WILL BE AN ISSUE FOR PEOPLE'S DISCUSSION AS WELL AS WHAT THE FED IS GOING TO DO IN SEPTEMBER AND IF THE PRESIDENT'S EFFORTS WILL HAVE ANY KIND OF EFFECT ON WHAT THE FED IS THINKING WHEN THEY GET TO THAT MEETING. MIKE, YOU HAVE BEEN TO A NUMBER OF THESE MEETINGS IN JACKSON HOLE OVER THE YEARS. WE ARE ALSO EXPECTING CENTRAL BANKERS FROM AROUND THE WORLD. ARE THEY PREPARING TO MOUNT A GLOBAL DEFENSE OF SORTS OF THE FED AGAINST THIS PRESSURE, AGAINST ITS INDEPENDENCE BY DONALD TRUMP? > > I THINK OF SORTS IS THE RIGHT WAY TO PUT IT. FOREIGN CENTRAL BANKERS AT THE MEETING, THE ECB ANNUAL MEETING IN PORTUGAL IN JUNE DID GIVE FAIRLY ROBUST DEFENSES OF CENTRAL INDEPENDENCE, SAYING CENTRAL BANKS THAT WERE FREE TO MAKE THEIR OWN MONETARY POLICY AS BEST THEY SAW FIT WOULD HAVE BETTER RESULTS FOR THEIR ECONOMIES. WE EXPECT SOME OF THEM TO SAY SIMILAR THINGS HERE. BUT THEY PROBABLY WILL NOT PUT IT IN THE CONTEXT OF JAY POWELL OR LISA COOK, JUST CENTRAL BANKS IN GENERAL. > > MICHAEL MCKEE, THANK YOU. TURNING TO TEXAS. THIS IS THE SCENE PLAYING OUT ON THE FLOOR OF THE HOUSE CHAMBER WITH STATE REPUBLICANS ON THE VERGE OF PASSING A KEY HURDLE IN ADOPTING NEW CONGRESSIONAL MAPS IN THE STATE THAT COULD GIVE THE GOP UP TO FIVE SEATS MORE AWAY FROM DEMOCRATS. THE FLOOR DEBATE HAPPENING AS STATE DEMOCRATS REMAIN UNDER SUPERVISION OF POLICE TO STAY IN THE STATE AS THE LEGISLATURE PROCEEDS WITH THEIR SPECIAL SESSION. A MOVE THAT LAWMAKERS PROTESTED AGAINST LAST NIGHT. NOW DEMOCRATS IN BLUE STATES ARE VOWING PAYBACK FOR THE TEXAS MAP WITH CALIFORNIA LAWMAKERS POISED TO APPROVE THEIR OWN RETALIATORY GERRYMANDERING MAP FOR VOTERS TO CONSIDER IN NOVEMBER. JOINING US FOR MORE IS ROB BONTA, ATTORNEY GENERAL OF CALIFORNIA. ATTORNEY GENERAL, WE HAVE TO ASK , REPUBLICANS IN CALIFORNIA ARE PREPARING TO MOUNT LEGAL CHALLENGE OF THEIR OWN AGAINST WHATEVER GAVIN NEWSOM AND DEMOCRATS IN THE STATE MAY TRYING TO DO WHEN IT COMES TO GERRYMANDERING AND REDISTRICTING. HOW ARE YOU PREPARING TO FEND OFF THAT CHALLENGE AND ENSURE THAT WHATEVER NEW MAPS ARE PROPOSED, AND PERHAPS PASSED BY THE LEGISLATURE ACTUALLY HOLD UP? > > I THINK IT IS REALLY IMPORTANT, THANK YOU FOR HAVING ME. IT IS IMPORTANT TO REMEMBER TRUMP STARTED THIS, HE CALLED GOVERNOR ABBOTT AND ASKED FOR FIVE MORE SEATS LIKE IN 2020 FOLLOWING THE ELECTION HE LOST. HE CALLED THE SECRETARY OF STATE ASKING FOR 11,000 MORE VOTES. GOVERNOR ABBOTT STARTED THIS, TEXAS STARTED THIS, REPUBLICANS STARTED THIS. CALIFORNIA THROUGH GOVERNOR NEWSOM AND THE LEGISLATURE ARE TRYING TO END THIS. STOP THIS ABUSE OF POWER AND THE RIGGING OF THE SYSTEM TO TRY TO DEFEND AGAINST WHAT IS INEVITABLE, THAT DEMOCRATS WILL WIN THE MIDTERM ELECTIONS AND RETAKE THE HOUSE. AND THE PLAN THAT GOVERNOR NEWSOM HAS ARTICULATED IN THE LEGISLATURE AND SEEMS TO BE SUPPORTIVE OF, WE WILL SEE HOW THEY VOTE, TO PRESENT MAPS TO THE PEOPLE. LET THEM VOTE. THE ULTIMATE FORM OF DIRECT DEMOCRACY. AND THE NEW MAPS WOULD ONLY TAKE EFFECTIVE TRIGGERED BY TEXAS OR ANOTHER RED STATE IMPROPERLY, ABUSIVELY, TRYING TO RIG THE SYSTEM. AND ADD MORE SEATS. AND WE WOULD GO BACK TO AN INDEPENDENT REDISTRICTING COMMISSION IN 2030 AFTER THE NEXT CENSUS COUNT, ACCORDING TO EVERYTHING THE GOVERNOR HAS SAID AND THE LEGISLATURE SEEMS TO BE SUPPORTING. IT IS A PRINCIPLED, LAWFUL RESPONSE TO AN ABUSE OF POWER BY TEXAS AND TRUMP AND REPUBLICANS AND AVID AND BY RED STATES. MY ROLE WOULD BE IF THERE IS A LAWSUIT, AND THERE HAS ALREADY BEEN AT LEAST ONE FILED EARLIER THIS WEEK, WE WILL DEFEND THE STATE OF CALIFORNIA TO THE EXTENT AN AGENCY OR DEPARTMENT ASKS FOR OUR REPRESENTATION AND OUR JOB IS TO REPRESENT THE LAWS OF THE STATE OF CALIFORNIA AND THE COURT WHICH WE WILL DO DUTIFULLY AND PROFESSIONALLY AND ETHICALLY. > > MR. ATTORNEY GENERAL, SOUNDS LIKE YOU FEEL CONFIDENT THERE IS A LEGAL ARGUMENT WHEN IT COMES TO CALIFORNIA. I'M WONDERING IF YOU HAVE LEVEL CONCERNS ABOUT THIS POTENTIALLY BACKFIRING, CONSIDERING VOTER SENTIMENT IN CALIFORNIA AROUND INCUMBENTS. HOW ARE YOU FACTORING THAT INTO THESE CALLS WHEN IT COMES TO POTENTIALLY REMAKING THE CONGRESSIONAL MAP? > > I THINK THERE IS A STRONG DESIRE TO STOP THE ABUSIVE CONDUCT OF TRUMP, REPUBLICANS. IT IS CLEARLY, TRANSPARENTLY AN ATTEMPT TO RIG THE SYSTEM. IF THEIR POLICIES WERE SO POPULAR, CLEARLY POLLING SHOWS THEY ARE NOT, THEY WOULD NOT HAVE TO FIND MORE DISTRICTS. THEY COULD JUST RUN ON THEIR RECORD, ON THEIR POLICIES. THEY CANNOT, SO THEY ARE TRYING TO CHOOSE VOTERS INSTEAD OF HAVING THE VOTERS CHOOSE THEM AND THE CONSTITUTION AND THE MAJORITY OF THE HOUSE. SO I THINK THE PEOPLE OF CALIFORNIA WANT CALIFORNIA TO FIGHT. THEY WANT US TO PUSH BACK AGAINST ABUSIVE ACTIONS LIKE WHAT IS HAPPENING IN TEXAS TO BLOCK IT, NEUTRALIZE IT, AND TO NOT ALLOW IT TO HAPPEN. OF COURSE, THE INDEPENDENT REDISTRICTING CONSTITUTION IS A GOOD IDEA. I SUPPORTED IT AT THE TIME. I THINK EVERY STATE SHOULD HAVE IT. BUT WE CANNOT TIE ONE HAND BEHIND OUR BACK IN CALIFORNIA. THE GOVERNOR HAS SAID. WE HAVE TO FIGHT FIRE WITH FIRE. WE CANNOT BE INVOLVED IN UNILATERAL DISARMAMENT, THE GOVERNOR HAS SAID, AND I AGREE. > > ATTORNEY GENERAL, I WANT TO BRING UP ANOTHER POINT OF CONFLICT BETWEEN THE STATES AND THIS WHITE HOUSE, THAT IS CRIME. EARLIER TODAY, VICE PRESIDENT VANCE WAS AT WASHINGTON'S UNION STATION MEETING WITH NATIONAL GUARD TROOPS PATROLLING IN THE CITY. AND HERE IS THE VICE PRESIDENT'S MESSAGE, PROTESTERS IN THE BACKGROUND. > > WE DO NOT HAVE TO ALLOW OUR CITIES TO BE TAKEN OVER BY VIOLENCE AND DISORDER AND CHAOS. YOU CAN ACTUALLY DO STUFF, YOU CAN ACTUALLY BRING LAW AND ORDER TWO COMMUNITIES. YOU JUST HAVE TO HAVE THE POLITICAL WILLPOWER TO DO IT. IF WE SET A STANDARD IN WASHINGTON, D.C. THAT POLITICAL WILLPOWER CAN BRING SOME COMMON SENSE ALONG ORDER BACK TO THESE COMMUNITIES, MAYBE SOME OTHER COMMUNITIES AND OTHER CITIES WILL FOLLOW SUIT. > > ATTORNEY GENERAL, HOW CONCERNED ARE YOU THAT THE PRESIDENT MAY TRY AGAIN TO SEND GUARD TROOPS AND MOBILIZE THEM AND SEND THE U.S. MILITARY TO CITIES IN CALIFORNIA AND PERHAPS OTHER CITIES ACROSS THE COUNTRY WHERE HE MAY NOT HAVE A DIFFERENCE AND WHAT CAN -- WHAT IS THE LEGAL RESPONSE TO THAT? > > IT IS TRUMP'S ARTICULATED DESIRE TO TREAT THE PATRIOTIC MEN AND WOMEN OF OUR MILITARY AS POLITICAL PONDS, AS HIS PERSONAL ARMY TO DEPLOY THEM IN ONLY BLUE CITIES AND BLUE STATES, COMPLETELY, TRANSPARENTLY PARTISAN ABOUT IT. AND TO DO SO UNLAWFULLY, IN VIOLATION OF THE POSSE, TATA'S ACT, WHICH HAS BEEN IN PLACE SINCE THE LATE 1800S OVER A CENTURY, PART OF THE FOUNDING PRINCIPLES OF OUR NATION, THE BRITISH MONARCHY PLACED THE ARMY AND THE COLONIES TO BE INVOLVED IN CIVILIAN LAW ENFORCEMENT. HE CANNOT PLACE THE MILITARY INTO AMERICAN CITIES ON AMERICAN SOIL TO ENGAGE IN CIVILIAN LAW ENFORCEMENT, IT IS AGAINST THE LAW. HE IS SAYING HE WANTS TO FIGHT CRIME. THAT IS THE DEFINITION OF CIVILIAN LAW ENFORCEMENT. IF HE SEEKS TO DO IT, WE WILL SEE HIM IN COURT, WE WILL STOP HIM, BLOCK HIM, HE WILL BE IN VIOLATION OF THE LAW. HE IS A REPEAT OFFENDER, LAWLESS AND LAWBREAKING. WE HAVE SUED HIM 39 TIMES IN 30 WEEKS. WE HAVE SECURED RESTRAINING ORDERS AND JUNCTIONS. OVER 90% OF THE TIME WHEN THE COURT HAS RULED ON A REQUEST. HE IS TAKING LOSSES EVERY DAY IN COURT BECAUSE HE BREAKS THE LAW. HE COMPLAINS ABOUT LOSING IN COURT AND COURT ORDERS AGAINST HIM. HE DOES NOT WANT COURT ORDERS AGAINST HIM. HE SHOULD STOP BREAKING THE LAW. HE BREAKS THE LAW, WE SUE. HE DOESN'T, WE SUE. > > MR. ATTORNEY GENERAL, IN THE LAST 30 SECONDS, I WANT TO KEEP ON THIS TOPIC. I KNOW YOU'RE PART OF A LITIGATION EFFORT AGAINST THE TRUMP ADMINISTRATION BLOCKING ACCESS TO GRANTS FOR VICTIMS OF CRIME. HAVE YOU GOTTEN A RESPONSE FROM THE ADMINISTRATION? > > NO, WE FILED ON MONDAY. THIS IS AN ANTI-PUBLIC SAFETY, ANTI-VICTIM ADMINISTRATION. THEY ARE TRYING TO TREAT THE VICTIMS AS POLITICAL PAWNS, VICTIMS OF DOMESTIC VIOLENCE, GUN VIOLENCE, SEXUAL ASSAULT, AND PULL FUNDING AWAY FROM -- THROUGH THE VICTIMS OF CRIME ACT, WHICH OFFERS OVER $1 BILLION TO VICTIMS EVERY YEAR, TRYING TO LEVERAGE THAT FUNDING TO FORCE STATES UNLAWFULLY TO ENGAGE AND PARTICIPATE IN THEIR MASS DEPORTATION, CRUEL IMMIGRATION AGENDA. IT IS AGAINST THE LAW, THEY CANNOT DO IT. IF TRUMP WANTS TO HELP PLACES THAT NEED HELP WITH CRIME, HE SHOULD LOOK AT LOUISIANA, ALABAMA, ARKANSAS, WHICH AS OF 2022 HAVE THE TOP THREE HIGHEST HOMICIDE RATES IN THE NATION. > > ROB BONTA, ATTORNEY GENERAL OF CALIFORNIA, THANK YOU FOR JOINING BLOOMBERG. > > TUNE INTO BALANCE OF POWER TOMORROW FOR MICHAEL MCKEE'S INTERVIEW WITH AUSTIN GOOLSBY. THAT WILL BE RIGHT HERE AT 5:45 P.M. EASTERN ON BLOOMBERG TV AND RADIO. > > LETS TUNE IN TOMORROW NIGHT FOR OUR INTERVIEW WITH MIKE PENCE, TOMORROW AT 5:00 P.M. EASTERN. THANK YOU FOR JOINING US. THIS IS BLOOMBERG. ALONGSIDE MICHAEL SHEPARD, I'M TYLER KENDALL. WE WILL SEE YOU BACK TOMORROW.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.98828125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9326171875
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.4951171875
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.440673828125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.419677734375
    }
  ],
  "sentiment": {
    "positive": 0.05193456,
    "negative": 0.69318235,
    "neutral": 0.25488305
  },
  "summary": "President Donald Trump has called on Federal Reserve Board member Lisa Cook to resign following a series of aggressive actions by the president towards FED GOVERNOR LISA COOK. This comes as the president continues to escalate pressure on the FEDERAL RESERVE. This follows another RUSSIan drone incident involving a Russian drone, and NATO's defense chiefs are meeting to discuss securing security for UKRAINE. The president is also attempting to exert power over the Federal Reserve (Feds) and is urging an investigation into COOK over a pair of fraudulent mortgage purchases. The White House has been criticized for setting up a \"BALANCE of Power\" initiative to address this issue, which could potentially impact the future of the Feds.",
  "shortSummary": "President Donald Trump demands Lisa Cook Resign from the Fed, escalating pressure on the FED, amid ongoing investigations into alleged insider trading.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f615e42bf2a54c50a90d55e29f1cd8dd",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The broadcast covers President Trump’s recent attack on Federal Reserve Governor Lisa Cook, citing alleged mortgage fraud and calling for her resignation, and the potential impact on the Fed’s independence ahead of the Jackson Hole symposium where Chair Jerome Powell is expected to speak. It also discusses Trump’s AI executive orders that loosen restrictions on data‑center development, the surge in demand for AI infrastructure, and the energy‑consumption concerns that accompany it. In addition, the program reports on political battles over redistricting, with California’s attorney general defending the state’s proposed map against a Texas‑style gerrymandering challenge, and touches on broader national security and law‑enforcement issues raised by the administration. Overall, the show highlights tensions between executive power, institutional independence, and economic policy in the current political climate.",
  "argos_id": "SOL40FBE7"
}