{
  "url": "https://www.bloomberg.com/news/videos/2025-08-21/bloomberg-brief-8-21-2025-video",
  "authorsByline": "bn",
  "articleId": "bb53108d2cd9406eb6c55af57f2d722b",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iXyx.QRg5uoQ/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T11:04:16.433000+00:00",
  "addDate": "2025-08-21T11:30:22.552067+00:00",
  "refreshDate": "2025-08-21T11:30:22.552069+00:00",
  "score": 1.0,
  "title": "Stocks Waver Ahead of Jackson Hole; Tech Set for More Weakness",
  "description": "US equity futures waver as traders remain guarded ahead of the Federal Reserve’s gathering at Jackson Hole. Tech stocks are set for more weakness after a a two-day selloff that shaved 2% off of the Nasdaq 100. Freya Beamish of TS Lombard believes markets should be not expect a hawkish turn from the Fed this week. Kelsey Berro of JPMorgan says the tariff impact on the market will be a \"slow burn.\" Vern Perry of Blackstone discusses the growth potential in private secondary markets. “Bloomberg Brief” delivers the market news, data and analysis you need to set your agenda.  (Source: Bloomberg)",
  "content": "GOOD MORNING, IT’S 5:00 A.M. IN NEW YORK CITY, I’M MATT MILLER IN FOR DANI BURGER. DAYS OF SELL-OFF, THE DOLLAR HITS A FRESH TWO WEEK HIGH AHEAD OF THE ANNUAL JACKSON HOLE SYMPOSIUM KICKING OFF AS THE LATEST FED MINUTES HIGHLIGHT INFLATION CONCERNS AND RETAIL EARNINGS CONTINUE WITH THE BIGGEST IN THE WORLD, WAL-MART, AS WELL AS ROSS STORES ON DECK TODAY. LET’S LOOK WHAT’S GOING ON IN TERMS OF FUTURES. YOU SEE THAT S & P FUTURES ARE LOSING A BIT MORE, NASDAQ FUTURES ARE DOWN NOW. THEY HAD BEEN UP EARLIER IN THE SESSION AND AFTER THE TRADE LAST NIGHT, RUSSELL FUTURES ARE DOWN THE MOST RIGHT NOW. IT LOOKS LIKE SENTIMENT IS SOURING AS WE APPROACH THE OPEN ABOUT 4 1/2 HOURS AWAY. FOR SOME OF THE STOCKS WE WANT TO WATCH, LET’S GET TO VALLEY TIE TELL -- VALERIE TIE TELL IN LONDON -- VALERIE TYTEL. VALERIE: A SURPRISE LOSS OF TWO CENTS PER SHARE, COTY’S DROPPED 21% PREMARKET AND OWNS BRANDS SUCH AS REMEL AND COVER GIRL. THEY HAD A FIVE-YEAR PLAN BUT THEY HAVE ROOM TO GO. THEY’RE SEEING SOFT CONSUMER DEMAND AND THAT’S CAUSING A BUILDUP OF INVENTORY. LET’S MOVE TO THE TECH SECTOR. POSITIVE NEWS FOR CORE WEAVE, THE A.I.D. CENTER COMPANY THAT WENT PUBLIC IN MARCH AROUND 1.5% AFTER REGULATORY FILINGS SHOWED THAT JANE STREET HAD TAKEN A PASSIVE STAKE IN THE COMPANY AROUND 5.4%. WAL-MART REPORTING BEFORE THE BELL, WAL-MART BEING THE LARGEST PRIVATE EMPLOYER OF AMERICANS, SHY SAY, REPORTING BEFORE THE BELL, DOWN 1% IN PREMARKET TRADE. NOTE THAT PREVIOUSLY IN THEIR GUIDANCE IT WAS VERY, VERY CONSERVATIVE IN THE LAST QUARTER SO THERE ARE BULLISH EXPECTATIONS AND EXPECTATIONS AS THEY UPGRADE THEIR GUIDANCE UNTIL WE HAVE CLARITY ON TARIFFS. MATT: STOCK UP 4% YEAR TO DATE AND A LITTLE SELL-OFF IN THE FUTURES BUT INVESTORS ARE POSITIVE ON THAT STOCK. VALERIE TYTEL IN LONDON. MOMENTS FROM NOW, WE DISCUSS THE FED’S RATE PATH. LATER THIS HOUR WE’LL LOOK AHEAD TO JACKSON HOLE WITH JP MORGAN. THAT SYMPOSIUM IS KICKING OFF LATER TODAY WITH FED CHAIR POWELL SET TO SPEAK TOMORROW ON FRIDAY. LET’S BRING IN JILL FOR MORE. WHAT ARE INVESTORS PRICING IN RIGHT NOW FOR JACKSON HOLE? JILL: THERE ARE TWO THINGS YOU WANT TO LOOK FOR OUT OF JACKSON HOLE THIS WEEK, OBVIOUSLY ALL EYES ARE GOING TO BE ON THAT POWELL SPEECH ONCE WE GET TO THAT ON FRIDAY. REMEMBER, HE’S TRADITIONALLY USED THIS CONFERENCE TO TELEGRAPH SOME NEWS ABOUT THE FED’S RATE TRAJECTORY AND WE SAW IT A BIT LAST YEAR WHEN WE WERE TALKING ABOUT THE BEGINNING OF THE CUTTING CYCLE AND SAW IT IN 2022 TALKING ABOUT HIKES AND SAW A MASSIVE AMOUNT OF MARKET MOVEMENT OFF OF THAT. IN TERMS OF HOW MUCH POWELL ACTUALLY GIVES AWAY THIS TIME AROUND ON FRIDAY, I THINK A LITTLE BIT OF THAT IS LESS UNCLEAR BUT CERTAINLY WE WOULD WANT TO KNOW WHETHER THERE’S GOING TO BE ANY KIND OF A HINT AS TO HOW MUCH ACTION THE FED MAY TAKE AT ITS NEXT FOMC MEETING NEXT MONTH. THAT’S CERTAINLY A COMPONENT OF THIS CONFERENCE. I THINK EASILY THE MOST IMPORTANT ONE. THE OTHER THING I’D ULTIMATELY LOOK AT, TOO, IS CERTAINLY THERE’S BEEN A LOT OF QUESTIONS ABOUT THE FED’S INDEPENDENCE AND HOW MUCH OF A PRESSURE CAMPAIGN THE TRUMP ADMINISTRATION HAS PUT ON POWELL AND THE FED AND WILL BE AN OPPORTUNITY FOR A LOT OF THE FED’S ALLIES AND COLLEAGUES. YOU’RE LOOKING AT LAGARDE AND BAILEY FROM THE B.O.E. AND THE B.O.J. ARE ATTENDING. REALLY AN OPPORTUNITY FOR THE CENTRAL BANKERS TO RALLY AROUND THE FED AND CONCEPT OF INDEPENDENCE. MATT: SINCE YOU’RE IN HONG KONG THE FED DOESN’T OPERATE IN A VACUUM AND NOTICED M-2 IN THE U.S. IS CLIMBING TO AN ALL TIME HIGH AND OUR LIVE TEAM SAID LIQUIDITY IN THE CHINESE ECONOMY IS ALSO INCREDIBLY HIGH. WHAT DOES THE CHINESE ECONOMY LOOK IN TERMS OF HOW IT RELATES TO THE U.S.? JILL: I THINK AT THIS POINT, REALLY WHEN YOU’RE LOOKING AT THE CHINESE ECONOMY, A LOT OF THE ISSUES THE CHINESE ECONOMY IS FACING, WORLD’S SECOND LARGEST, HAS UNDERGONE A PERIOD OF ECONOMIC SLOWDOWN THE PAST COUPLE YEARS AND THOSE ISSUES ARE SPECIFICALLY DOMESTIC OR PROPERTY RELATED BUT THE WAY WE LOOK AT THE CHINESE ECONOMY RELATIVE TO THE UNITED STATES ECONOMY IS REALLY WHEN IT COMES DOWN TO EXPORTS, YOU KNOW, IMPACT OF TARIFFS, THOSE KINDS OF THINGS I THINK IS WHERE THAT RELATIONSHIP IS REALLY KIND OF KEY AND I THINK WHEN WE’RE LOOKING MORE BROADLY AT THE U.S.-CHINA RELATIONSHIP, THE MORE IMPORTANT THINGS TO KEEP IN MIND THERE ARE THINGS LIKE THE TARIFF RELATIONSHIPS. OBVIOUSLY WE HAVE THE TRADE TRUCE SPINNING OUT TO NOVEMBER AT THIS POINT AND WHERE I LOOK AT THOSE LEVELS OF CONCERN THERE. MATT: THANKS VERY MUCH. TAKING A LOOK AT THE FED AND WHAT IS HAPPENING IN CHINA AS WELL. JOINING US IS THE CHIEF ECONOMIST AT T.S. LOMBARD. GREAT TO SEE YOU THIS MORNING. I’VE BEEN LOOKING AT THE WORLD INTEREST RATE POSSIBILITY FUNCTION AT BLOOMBERG AND THE PERCENTAGE CHANCE THAT FUTURES ARE PRICING IN AT A RATE CUT CONTINUES TO FALL. LAST WEEK IT WAS 100% AND DWINDLED DOWN TO 95%. YESTERDAY IT WAS 85% AND TODAY IT’S 80% EVEN. MARKETS ARE PRICING IN LESS AND LESS CHANCES OF A RATE CUT. > > FREYA: IT’S BOUNCED AROUND A LOT BUT COME DOWN SINCE THE C.P.I. PRINT. I THINK THAT’S THE RIGHT DIRECTION. IT’S A PUNT, HONESTLY. SEPTEMBER IS A PUNT. THEY’VE TOLD US QUITE CLEARLY THAT THEY’RE NOT GOING TO WAIT AROUND ANY LONGER IF THE C.P.I. PRINT COMES IN AND IT’S STILL KIND OF EQUIVOCAL AND YOU CAN’T TELL TO WHAT DEGREE TARIFFS ARE COMING THROUGH. IF YOU LOOK UNDER THE DETAILS YOU SEE TARIFFS ARE STARTING TO COME THROUGH AND EXPECT THAT TO CONTINUE. IF THE C.P.I. PRINT DOESN’T POP BETWEEN NOW AND THEN, THEN THEY PROBABLY ARE GOING TO GET AHEAD AND CUT. WHERE I HAVE MORE CONVICTION, THOUGH, AND I DON’T ACTUALLY EXPECT POWELL TO DO A GREAT DEAL OF SIGNALING IN SEPTEMBER BECAUSE THE LAST THING HE WANTS TO DO IS COME OUT AND SIGNAL AND THE C.P.I. DOES POP AND THERE’S JUST GOING TO BE A COMPLETE TURN AROUND AS A RESULT OF THAT. WHERE I START TO GET MORE CONVICTION IS WITH REGARDS TO SEPTEMBER. AND I THINK JUST THE BACKDROP HERE IS LOOKING INCREASINGLY INFLATIONARY. I REALIZE THE PASS-THROUGH RATE HAS ONLY CLIMBED -- WE STARTED 5%, 10%, 15%. IT’S GETTING HIGHER WITH EACH PRINT. I WOULD EXPECT THAT TO CLIMB UP TO 50% BY THE END OF THE YEAR AND THAT MEANS INFLATION IS GOING TO BE MOVING AWAY FROM TARGET, HITTING THE 3% HANDLE. MAYBE EVEN GOING HIGHER THAN THAT IF WE LOOK AT THE TARIFF RATES IN THE SYSTEM AT THE MOMENT, TWO MAJOR TRADING PARTNERS AT 15%. CHINA IS STILL WAY UP THERE. THAT’S VERY CLOSE TO WHAT I WOULD CALL A TIPPING POINT IN THE INFLATION REGIME. YOU HAVE A SLOW AND STABLE INFLATION REGIME AND A VOLATILE REGIME. I DON’T SEE THEM SIGNALING ANYTHING AS HAWKISH AS THIS WEEK BUT WHERE YOU WILL START TO GET AN INKLING OF THINGS IN THE TERMINAL RATE TO THE EXTENT THE FED REMAINS IN CONTROL OF THAT AND INDEPENDENT FROM NOW UNTIL THAT TERMINAL RATE IS WITH REGARDS TO THE RESEARCH THAT IS GOING TO COME OUT OF JACKSON HOLE LOOKING AT THE LABOR SUPPLY AND WHAT IT IMPLIES. WE’RE ALL USED TO 100 BEING THAT MOMENT THAT’S MUTUAL ON THE UNEMPLOYMENT RATE AND PROBABLY BECAUSE OF DEMOGRAPHICS GETTING PULLED DOWN. I DON’T NECESSARILY EXPECT THEM TO TALK A LOT ON THE IMMIGRATION SIDE BUT THE IMMIGRATION SIDE OF IT OVER THE COURSE OF THE NEXT 12 MONTHS WILL PULL THE NFP BREAK EVEN RATE DOWN ON A REASONABLE ASSUMPTION. 60 POTENTIALLY BELOW THAT DEPENDING ON HOW MUCH THE I.C.E. DETENTIONS REACCELERATE DEPENDING ON SELF DEPORTATIONS OR THE DECLINE ON THE IMMIGRATION RATE. AND THESE THINGS ALL MAKE IT EASIER FOR THE ECONOMY TO OVERHEAT. I THINK THE PHILIPS CURVE IS PROBABLY HIGHER AS WELL. SO IF WE’RE ALREADY AT THE TOP OF THE PHILIPS CURVE THAT’S PROBABLY GOING TO BE PREVAILING OVER THE NEXT 10 YEARS, WE’RE GOING TO BE SEEING LATE DOMESTIC LABOR TIGHTNESS MORE LIKELY TO FEED INTO WAGE GROWTH AND THAT PROBABLY MORE LIKELY TO FEED INTO C.P.I. INFLATION AS WELL. MATT: LET ME ASK ON THE LABOR MARKET, IF THE SUPPLY-SIDE IS AN ISSUE, AND CLEARLY THAT’S BEEN HIGHLIGHTED, WHAT IS THE DEMAND SIDE LOOK LIKE TO YOU? FREYA: GOOD POINT. I THINK AT THIS MOMENT IN TIME, I’LL CALL IT AT THIS STAGE THE LABOR MARKET IS ON PAUSE. IT’S NOT RECESSIONARY AND IS ON PAUSE BECAUSE THE DEGREE OF UNCERTAINTY THAT’S BASKETBALL FORCED ON THE U.S. ECONOMY. I WOULD EXPECT THE LABOR MARKET TO RECOVER IN SOME DEGREE BUT WHERE WE PUT THE DEMAND SIDE AND SUPPLY-SIDE BACK TOGETHER AGAIN, WHAT IS THAT DEGREE THAT’S IMPORTANT FOR THE FED, IF WE’RE SEEING LABOR MARKET PRINTS, IF WE’RE SEEING THE N.F.P. COME IN AT 100 NOW AND GIVEN THE DEMOGRAPHIC CHANGES AND CHANGES IN IMMIGRATION POLICY, THAT’S ACTUALLY PUSHING US TOWARDS OVERHEATING WHICH IS A VERY STRANGE SITUATION TO BE IN AND LESS PRODUCTIVITY GROWTH IS REALLY PICKING UP AND PRODUCTIVITY GROWTH WON’T BE PICKING UP, TAKE IT FROM US IN THE U.K. WHEN THERE’S THIS LEVEL OF UNCERTAINTY, CAPEX CAN’T GET OFF THE GROUND. MATT: WE HAVE CAPEX SOARING HERE CERTAINLY ON THE WEST COAST AND A.I. THE GREAT COMMENT IS IT CAN HELP BECAUSE I’M ON CHATGPT ALL THE TIME. YOU DON’T SEE IT ADDING TO THIS EXCEPTIONAL ECONOMY HERE IN AMERICA? FREYA: I THINK THAT’S BEEN THE STORY ALREADY, THE U.S. ECONOMY HAS BROKEN OUT IN PRODUCTIVITY CONCERNS ON THE POSITIVE SIDE OVER THE PAST COUPLE YEARS UNDER THE INFLUENCE OF POSITIVE DEMAND SHOCKS. THERE’S A BIG DIFFERENCE BETWEEN WAGE GROWTH AS A RESULT OF A POSITIVE DEMAND SHOCK, SO SUBSIDIES AND PUTTING MONEY EFFECTIVELY IN PEOPLE’S BANK ACCOUNTS AND WAGE GROWTH AS A RESULT OF THE NEGATIVE SUPPLY SHOCK WHICH IS THE POLICY WE’RE SHIFTING TOWARDS, THAT BEING TARIFFS AND DEPORTATIONS, DETENTIONS AND ARE NEGATIVE SUPPLY SHOCKS. WHEN YOU HAVE WAGE GROWTH AS A PART OF POSITIVE DEMAND SHOCK, THERE’S MORE OF A REASON FOR BUSINESSES TO GO OUT THERE AND INVEST, BOTH BECAUSE THEY SEE THE SALES REVENUE BUT BECAUSE THEY WANT TO CURTAIL THE UNIT LABOR COST GROWTH. THAT’S THE KEY TERM HERE IN TERMS OF WHETHER WE’LL SEE THAT CAPEX COMING THROUGH. I THINK THE U.S. ECONOMY, DON’T GET ME WRONG. I’M NOT SAYING THE U.S. ECONOMY IS DONE. THERE’S SOMETHING SPECIAL ABOUT THE U.S. ECONOMY AND HAS BEEN FOR DECADES AND DECADES. IN FACT, LOOKING BACK OVER A 100-YEAR TIME HORIZON, THE U.S. ECONOMY IS FREAKISHLY ABLE TO SUSTAIN 50% RETURNS CONSISTENTLY AS A TREND BASIS. WHAT THE PROBLEM IS AT THIS MOMENT IN TIME IS THAT THERE IS THIS SHIFT TOWARDS NEGATIVE SUPPLY SHOCK POLICY AND THAT’S GOING TO UNDERMINE SOME OF THE RESILIENCE AND DINE MIMS OF THE U.S. ECONOMY. IT’S NOT TO SAY THAT IT’S DONE, IT’S JUST COMPARED WITH EXPECTATIONS WHICH IS WHAT WE CARE ABOUT IN MARKETS, YOU ACTUALLY CAN START TO GET A LITTLE BIT MORE POSITIVE ABOUT THE EUROPEAN STORY AS WE’VE SEEN THIS YEAR, WE THINK THAT’S A MULTIYEAR STORY THAT IS BASED ON A STRONG KIND OF REPRICING OF RISK ADJUSTIVE CONCERNS BETWEEN THE U.S. AND EUROPEAN ECONOMY AND CERTAINLY THAT UNCERTAINTY ASPECT IS A PROBLEM FOR THE U.S. AND SPECIFICALLY ON A.I., THE PROBLEM I HAVE WITH THAT AS A DRIVER OF THE STOCK MARKET, IN THE WEIGHT THAT’S BEEN INTERPRETED SO FAR, WE’RE TRYING TO EXTRAPOLATE AND SEEMS LIKE INVESTORS ARE TRYING TO REPLICATE THE BENEFITS OF DIGITALIZATION WHICH OCCURRED VERY NARROWLY TO A SELECT GROUP OF FIRMS, THE TECH FIRMS, ON TO THE STORY FOR A.I. AND ACTUALLY, I THINK THE STORY FOR A.I. ON PRODUCTIVITY GROWTH DISBURSES MUCH MORE INTO THE REAL ECONOMY WHICH IN SOME WAY IS A GOOD THING AND THERE ARE DEFINITE POSITIVES COMING THROUGH AS WELL AND I SPEND TIME WITH MY CHATGPT WITH MY PYTHON OPEN AS WELL AND OTHER ENHANCEMENT MEASURES THAT WILL COME THROUGH BUT IS AS WELL FOR A ITALIAN FIRM AS A U.S. FIRM AS WELL AND IF THERE’S A DEMAND STORY THERE, THEN THAT’S LIKELY TO COME THROUGH. MATT: AWESOME TO GET TIME WITH YOU. FREYA OF T.S. LOMBARD WHERE SHE’S THEIR CHIEF ECONOMIST. LET’S GET TO THE OTHER TOP STORIES, LISA COOK HAS A MESSAGE FOR PRESIDENT TRUMP AND CAN’T BE BULLIED INTO STEPPING DOWN. IN AN EMAIL STATEMENT SHE HAD NO INTENTION OF LEAVING THE FED DESPITE THE PRESIDENT’S CALL FOR HER RESIGNATION OVER ALLEGATIONS OF MORTGAGE FRAUD, A RESIGNATION, IF HAPPENED WOULD CREATE ANOTHER OPENING FOR TRUMP TO FILL ON THE FED BOARD. SHAKEUP ON WALL STREET, BANK OF AMERICA ANNOUNCEED NEW CO-HEADS OF THE GLOBAL INVESTING UNIT. THE BANK ANNOUNCED A NUMBER OF OTHER CHANGES IN ITS CORPORATE BANKING AND MARKETS UNITS AS THEY SHUFFLE THE DECK THERE IS. EUROPE’S PRIVATE SECTOR IS GAINING MOMENTUM. THE EURO AREA’S BUSINESS ACTIVITY GREW AT THE QUICKEST PACE IN MONTHS AND THE E.U. TRADE DEAL LOCKS IN HIGHER TARIFFS FOR THE EURO ZONE BLOCK. THE PATH TO PEACE FACING SOME COMPLICATIONS. MORE ON THE TALKS BETWEEN KYIV AND MOSCOW. NEXT. THIS IS BLOOMBERG. ♪ MATT: PEACE TALKS BETWEEN KYIV AND MOSCOW UNDERWAY FOLLOWING PRESIDENT TRUMP’S RECENT INTERVENTIONS IN THE EASTERN EUROPEAN CONFLICT. TAKE A LISTEN TO VICE PRESIDENT J.D. VANCE TELLING FOX NEWS ABOUT THE PROGRESS. VICE PRESIDENT VANCE: THE RUSSIANS ARE TALKING TO THE UKRAINIANS AND TALKING DETAILS ON WHAT WOULD BE NECESSARY ON EACH SIDE TO STOP THE KILLING. WE’VE MADE MORE PROGRESS IN THREE MONTHS THAN THE COMPANY MADE IN THREE YEARS IN STOPPING THIS CONFLICT. I THINK IT’S BECAUSE SOMETIMES YOU NEED A PRESIDENT WHO WILL JUST PICK UP THE PHONE AND CALL SOMEBODY. MATT: FOR MORE I’M JOINED BY BLOOMBERG INTERNATIONAL AFFAIRS COLUMNIST MARC CHAMPION. I’VE HEARD GENERAL AFTER GENERAL ON BALANCE OF POWER, OUR POLITICS PROGRAM IN THE AFTERNOONS SAY RUSSIA IS LOSING THIS WAR. WHY WOULD UKRAINE GIVE MOSCOW TERRITORY IT DOESN’T EVEN OCCUPY MARC: RIGHT. THAT IS A RED LINE FOR THE UKRAINIANS AND HAVE NO INTENTION OF DOING SO. THERE ARE MULTIPLE PROBLEMS HERE. THE FIRST IS THAT THE RUSSIANS ARE ASKING FOR TWO SETS OF PIECES OF TERRITORY. THE FIRST, WHICH THEY SPOKE DIRECTLY TO DONALD TRUMP ABOUT IS IN DONETSK WHICH IS WHERE UKRAINE HAS FORTRESS CITIES THEY ARE CALLED AND THE RUSSIANS HAVE BEEN TRYING TO TAKE SINCE 2014 AND HAVE FAILED TO DO SO. ROUGH ESTIMATES, IF THE RUSSIANS WERE TO CONTINUE AT THEIR CURRENT PACE, THEY MIGHT TAKE THAT AREA THAT THEY’RE ASKING FOR IN FOUR YEARS’ TIME. OF COURSE THE PACE CAN CHANGE. THERE’S A SECOND, MUCH LARGER GROUP OF TERRITORIES THAT THEY ARE ASKING FOR IN THE PROVINCES FURTHER SOUTH AND FURTHER TO THE EAST. THEY’RE NOT SAYING AT THE MOMENT THAT THOSE MUST BE PART OF THE INITIAL DEAL BUT THEY ARE ALSO SAYING THAT THEY DO BELONG TO RUSSIA. THERE WOULD BE A CEASE-FIRE THERE. THEY WOULD NOT RENOUNCE THEIR CLAIMS. THE UKRAINIANS AND RUSSIANS ARE A LONG WAY APART AND WHEN VICE PRESIDENT VANCE SAYS THEY’RE SUDDENLY TALKING ABOUT DETAILS. ACTUALLY, AT THE LEVELS THEY’RE TALKING NOW, THEY’VE BEEN TALKING ALL THROUGH THE WAR. THE QUESTION IS WHETHER PRESIDENT PUTIN WILL MEET WITH ZELENSKYY AND WE STILL HAVE NO SIGN OF THAT. MATT: WE’RE ALSO LEARNING MOSCOW WANTS TO BE A PART OF THE SECURITY FORCES THAT REMAIN IN UKRAINE, POSSIBLY BRINGING IN THE CHINESE AS WELL. IS THAT ALSO, I IMAGINE, A NONSTARTER? MARC: YES, IT IS A NONSTARTER. IT’S NOT JUST IN THIS INSTANCE BUT IN GENERAL IN THESE KINDS OF SITUATIONS YOU’RE INTRODUCING A PEACEKEEPING FORCE, YOU WOULD USE FORCES THAT ARE SYMPATHETIC ON EITHER SIDE TO THE LOCAL POPULATIONS ON EITHER SIDE OF AN AREA THAT IS BEING CARVED OUT AS A BUFFER ZONE, IF YOU’D LIKE. SO FAR THERE’S NO DISCUSSION OF HAVING THAT KIND OF BUFFER ZONE, IT’S SIMPLY THE RUSSIANS SAYING YOU GIVE US TERRITORY THAT IS ON YOUR SIDE AND OTHERWISE THERE IS A CEASE-FIRE LINE, WE KEEP EVERYTHING WE’VE OCCUPIED SO FAR. SO WE’RE ONLY TALKING ABOUT PUTTING A PEACEKEEPING FORCE ON THE UKRAINIAN SIDE OF THE LINES AND THERE’S NO REASON WHATSOEVER THEY SHOULD AGREE OR WILL AGREE TO HAVE OPPOSITION FORCES. WHAT THEY SEE AS OPPOSITION FORCES THERE. MATT: GREAT TO GET YOUR TAKE ON THIS. MARC CHAMPION COVERS GEOPOLITICS FOR US AND WRITES FOR BLOOMBERG OPINION. CHECK OUT HIS WORK BY TYPING OPIN GO ON THE TERMINAL OR SEARCHING FOR IT ON BLOOMBERG.COM. ♪ MATT: TIME FOR YOUR FRONT PAGE NEWS. FIRST UP ON \"THE NEW YORK TIMES,\" ISRAEL APPROVES NEW SETTLEMENTS IN THE HEART OF THE OCCUPIED WEST BANK, UNDER THE PLAN, 3,400 ADDITIONAL HOUSING UNITS WILL BE BUILT ON ONE OF THE MOST SENSITIVE TRACKS OF REAL ESTATE IN THE WEST BANK CALLED E-1. THE IDEA OF A PALESTINIAN STATE IS BEING ERASED FROM THE TABLE. NEXT UP THE FINANCIAL TIMES REPORTS CHINA TURNED AFTER NVIDIA’S A.I. CHIPS AFTER HOWARD LUTNICK MADE REMARKS. AND HIS COMMENTS THAT U.S. ISN’T SELLING CHINA ITS BEST TECH. AND \"WASHINGTON POST\" LEADS IN IMPASSE WITH PEACE TALKS BETWEEN MOSCOW AND KYIV DAYS AFTER THE WHITE HOUSE CELEBRATED SPLASHY SUMMITS WITH LEADERS OF RUSSIA AND UKRAINE AND RUSSIA SIGNALED THERE IS BARELY ANY CHANGE TO THE PATH TENDING THE WAR. THIS IS BLOOMBERG. MATT: 5:30 A.M. IN NEW YORK CITY, I’M MATT MILLER IN FOR DANI BURGER WITH YOUR \"BLOOMBERG BRIEF.\" HERE’S WHAT YOU NEED TO KNOW, TECH PRESSURE HAS BEEN WANING. EQUITY FUTURES SCHOOLED DOWN AFTER DAYS OF SELL-OFF. THE DOLLAR HITS A FRESH TWO-WEEK HIGH AHEAD OF THE JACKSON HOLE SYMPOSIUM THAT KICKS OFF AS THE LATEST FED MINUTES HIGHLIGHT CONCERNS ABOUT INFLATION BUT CAME OUT BEFORE THE HORRIBLE JOBS REVISIONS. AND RETAIL EARNINGS CONTINUE WITH THE BIGGEST IN THE WORLD, WAL-MART ON DECK AS WELL AS ROSS STORES. WE’LL SEE WHAT THE DISCOUNTER IS DOING. IN TERMS OF WHAT’S GOING ON IN MARKETS, WE’VE SEEN NASDAQ FUTURES FALL LOWER. THEY WERE UP OVERNIGHT AND RIGHT NOW YOU’RE LOOKING AT RED ARROWS, NOTHING MUCH CHANGED ON S & P OR NASDAQ FUTURES BUT BOTH ARE DOWN. IN TERMS OF WHAT’S GOING ON IN THE TREASURY CURVE. YOU SEE THE TWO-YEAR YIELD AT 3.75, BARELY MOVING. IN FACT NOTHING ON THE CURVE IS MOVING THAT MUCH. 4.30 ON THE 10-YEAR AND 4.90 ON THE 30. LOOKS LIKE INVESTORS ARE SITTING ON THEIR HANDS WAITING FOR FED CHAIR JEROME POWELL TO SPEAK. FOR STOCKS TO WATCH, LET’S GET TO LONDON WITH VALERIE TYTEL WITH THE INDIVIDUAL MOVERS. VALERIE: GOOD MORNING. I WANT TO START WITH EARNINGS FROM LAST NIGHT, ONE FROM COATE BRANDS. THIS IS A MASSIVE CONGLOMERATE AND OWN COMPANIES LIKE COVER GIRL, COTY. BIG IN THE PERFUME SPACE. THE STOCK IS DOWN NEARLY 24% IN PREMARKET TRADE AND CAME OUT WITH A LOSS IN PREMARKET SHARES AND PENCILED IN A PROFIT. THEY FORECAST PRETTY STEEP SALES DECLINE AND COMES BACK NOT NECESSARILY FEEDING INTO THE TARIFF DISCUSSION, IT’S MORE ON THE FACT THIS IS A STRUGGLING RETAILER AND FAILED TO TURN AROUND AND NEAR AT THE END OF ITS FIVE-YEAR TURN AROUND PLAN AND STILL HAVING ISSUES, COTY BEAUTY DOWN 24% IN PREMARKET. MOVING ON TO THE TECH SPACE, CORE WEAVE IS MOVING HIGHER, UP 1.7% ON THE BACK OF REGULATORY FILINGS THAT SHOWED THAT JANE STREET TOOK A PASSIVE STAKE IN THE COMPANY AROUND 5.4% AND STOCK REALLY LIKING THAT NEWS THIS MORNING. LASTLY, LET’S LOOK AT WHAT’S TO COME. WAL-MART IS REPORTING EARNINGS BEFORE THE BELL. NOT ONLY IS IT U.S.’ LARGEST EMPLOYER BUT KNOWN AS A PROXY FOR HOW THE CONSUMER IS HOLDING UP. THE SHARES IN THE RED SO FAR, TRADING DOWN 1.5%. THE EXPECTATIONS FOR THIS STOCK, MATT, ARE QUITE HIGH AFTER THEIR CONSERVATIVE GUIDANCE THEY GAVE IN THE PREVIOUS QUARTER AND SEE IF THEY WILL DELIVER. MATT: LOOKING FORWARD TO THAT IN AN HOUR AND A HALF’S TIME WE’LL GET THE NUMBERS. VALERIE GIVING US THE SINGLE STOCK STORIES OUT OF LONDON. NOW TO THE MACROPICTURE, DAY ONE OF THE JACKSON HOLE SYMPOSIUM FOLLOWING THE RELEASE OF THE FOMC MINUTES YESTERDAY. BLOOMBERG’S JILL DECES. WE GOT A LOOK AT THE CONCERNS FROM THE FOMC ON INFLATION BUT THAT CAME BEFORE SOME REALLY SIGNIFICANT DOWNWARD JOBS REVISIONS. JILL: THAT’S RIGHT, MATT. WHEN YOU’RE LOOKING AT THOSE FOMC MINUTES, WHAT’S INTERESTING IS HOW MANY OF THOSE FED BOARD MEMBERS WERE FOCUSED ON INFLATION AS BEING THE BIGGER CONCERN OF THE DUAL MANDATE OF INFLATION AND JOBS. SINCE THAT MEETING WAS HELD, WE’VE HAD A LOT OF DATA THAT’S KIND OF SHAKEN THINGS UP A BIT. THE JOBS REVISION NUMBER IN PARTICULAR. I THINK WHAT WILL BE PARTICULARLY INTERESTING GOING INTO JACKSON HOLE THIS WEEK IS LOOKING AT THAT FRIDAY SPEECH FROM JEROME POWELL, DOES HE SAY ANYTHING THAT WILL GIVE US FURTHER HINTS OR CLUES WHAT THE FED MAY BE THINKING FOR SEPTEMBER. AGAIN, IT’S ONE THING TO LOOK AT THE FOMC MINUTES AND MAYBE YOU GET A LITTLE VIEW BUT BECAUSE THERE’S BEEN SO MUCH SINCE THEN AND WE’RE EXPECTING ADDITIONAL DATA, LOOKING AT THE POWELL COMMENTS FOR FURTHER NEWS WILL BE VITAL. AND WE’VE BEEN DISCUSSING HE’S USED JACKSON HOLE IN PRIOR YEARS TO GIVE THE HINT OF WHERE THE FED WILL BE GOING AND WHAT THE TRAJECTORY MAY BE. WILL HE DO IT THIS TIME AROUND? THAT’S WHAT WE’RE WAITING FOR IT. MATT: JILL TALKING ABOUT IT FROM HONG KONG. THE WORLD REALLY WAITING FOR JEROME POWELL TO SPEAK. JOINING US WITH HER TAKE IS KELSEY BARROW WHO JOINS US HERE BRIGHT AND EARLY ON SET. GREAT TO HAVE YOU HERE. WHAT DO YOU EXPECT FROM THE FED CHAIR BECAUSE WE’VE SEEN THE PROBABILITY OF A RATE CUT AS PRICED BY FUTURES OR OVERNIGHT INTEREST SWAPS IN THE MARKET CONTINUE TO FALL. KELSEY: RIGHT. RIGHT AFTER THE JOBS REPORT, THE MARKET PRICED IN A VERY HIGH PROBABILITY OF A 25 BASIS POINT RATE CUT AND THEN WE GOT THE C.P.I. DATA WHICH WAS MIXED BUT CAME IN ESSENTIALLY AT EXPECTATIONS. WHAT CAUSED THE MARKET TO START TO REDUCE THE PROBABILITY OF THE 25 BASIS POINT RATE CUT, WHICH IS STILL THE BASE CASE IN THE MARKET, STILL 80% PROBABILITY, YOU HAVE THE P. I. DATA WHICH IS A LITTLE HOTTER THAN EXPECTED AND NOW I THINK PEOPLE ARE STARTING TO PREPARE FOR THE POSSIBILITY THAT POWELL IS GOING TO BE A BIT MORE BALANCED, MORE CONSISTENT WITH THE PRESS CONFERENCE THAT HE GAVE AFTER THE JULY FOMC MEETING. OUR VIEW IS THAT HE’S NOT GOING TO COMMIT TO A RATE CUT IN SEPTEMBER SO THOSE WHO ARE EXPECTING MORE OF A CLEAR SIGNAL OF YES, WE’RE GOING TO GO SIMILAR TO LAST YEAR, I WOULDN’T EXPECT THAT. I WANT TO SEE A MARKET THAT CONTINUES TO TRADE AROUND WHERE IT IS NOW AND HE SHOULD BE LOOKING TO LET THE DATA GUIDE THE MARKET PRICING RATHER THAN HIS TONE COMMENTARY. THAT REALLY PUTS A LOT OF THE EMPHASIS ON THE AUGUST JOBS REPORT THAT COMES OUT THE BEGINNING OF SEPTEMBER. MATT: WHAT ABOUT THE INFLATION NUMBERS COMING OUT? BECAUSE, AS YOU SAY, OF COURSE C.P.I. WAS WIDELY IN LINE WITH EXPECTATIONS BUT RISING RATHER THAN FALLING AT THE 2% TARGET AT 3.1%. I THINK A LOT OF ECONOMISTS, CORRECT ME IF I’M WRONG, EXPECT THE BRUNT OF THE TARIFF CAUSED PRICE INCREASES TO HIT LATER IN THE THIRD QUARTER OR EVEN IN THE FOURTH QUARTER. SO THAT’S STILL COMING. KELSEY: I WOULD AGREE AND IT’S INTERESTING TO HEAR SOME OF THE EARNINGS CALLS FROM THE RETAILERS, FOR EXAMPLE, AND HOME DEPOT EARLIER THIS WEEK SAY WE’RE STILL WORKING THROUGH THE INVENTORY WE GENERAL BENEFITLY SHIFT -- GENUINELY SHIFT BEFORE THAT BUT IT WILL BE A SLOWER BURN OVER TIME AND A ROLLING IMPACT. EACH COMPANY IS ON THEIR OWN SCHEDULE DEPENDENT ON THE SPECIFICS OF THEIR MARKET, THE SPECIFICS OF THEIR CONSUMERS, THE ELACTICITY OF THOSE CONSUMERS IN TERMS OF HOW WILLING ARE THEY TO BEAR THE PRICES. AND SO I DO THINKING WE’RE GOING TO SEE IT BUT IT’S GOING TO HAPPEN MORE GRADUALLY OVER TIME. FOR THE FED, THAT’S KIND OF IN THE PRICE AND THEY KNOW CORE GOODS INFLATION IS GOING TO RISE AND WHAT THEY’RE MORE FOCUSED ON IS CORE SERVICES AND INFLATION EXPECTATIONS. SO IF YOU LOOK AT THE SIX MONTH RUN RATE ON CORE SERVICES C.P.I., THAT ACTUALLY REACHED A NEW CYCLE LOW IN THE LAST REPORT. THAT’S BEEN A FUNCTION OF SHELTER PRICES MODERATING AND WE’VE SEEN WAGE PRICES NOTED RATE AND INFLATION EXPECTATIONS REMAIN ANGERED. THOSE ARE THE THINGS THAT GIVE THE FED CONFIDENCE THOUGH INFLATION IS NOT MAKING PROGRESS AND IS NOT EXPECTED TO MAKE PROGRESS IN A YEAR OVER YEAR BASIS IN THE SHORT TERM THAT THEY CAN FEEL COMFORTABLE THAT OVER TIME THEY’RE STILL INCREDIBLY MOVING TOWARDS THEIR GOALS. MATT: WHAT DO YOU SEE THE CURVE DOING, DOES IT CONTINUE TO STEEPEN? KATIE GUY FIELD REMINDED ME EVEN AS THE FED WAS CUTTING THE FEDERAL FUNDS OVERNIGHT RATE WE SAW THE 10-YEAR YIELD RISING. DOES THAT STEEPENING CONTINUE TO HAPPEN? KELSEY: GENERALLY WE ARE IN A CURVE STRENGTHENING REGIME, WHETHER THE U.S. OR LOOKING AT OTHER COUNTRIES LIKE GERMANY, THE OTHER EUROPEAN BOND MARKETS, WE’RE SEEING STEEPENING TRENDS THERE AND IT’S A VERY SUBSCRIBED TRADE AND SOMETHING WHERE MANY INVESTORS ARE EXPECTING IT AND HAVE POSITIONED FOR IT. YOU CAN ARGUE THAT POSITIONING IS A BIT CROWDED AND SUSCEPTIBLE TO SHAKEOUTS. MORE RECENTLY, IF YOU LOOK AT THE TREND IN THE U.S., THE TREND AND RANGE HAS BEEN PRETTY NARROW BETWEEN 40 AND 60. WE HAVEN’T BEEN ABLE TO BREAK OUT STEEPER IN THE LAST FEW MONTHS. THE MAJORITY OF THE STEEPENING HAPPENED RIGHT AROUND LIBERATION DAY AND SINCE THEN WE’VE BEEN TRADING IN A RANGE. ULTIMATELY WHAT GETS THE CURVE STEEPER IS GOING TO BE, IN OUR VIEW, THE FED CUTTING RATES MORE AGGRESSIVELY. THAT BRINGS DOWN THE FRONT END RATHER THAN A MATERIAL SELL-OFF IN THE LONG END GIVEN WE VIEW VALUATIONS AT THE VERY LONG END AND TERM PREMIUMS ARE ALREADY FAIRLY LOFTY. MATT: WHAT DO YOU THINK OF CORPORATE CREDIT BECAUSE EVEN INVESTMENT GRADE SPREADS ARE SUPERTIGHT, EVEN JUNK SPREADS ARE SUPERTIGHT. AT THE SAME TIME WE’RE LOOKING AT MOST BANKRUPTCIES WE’VE SEEN SINCE THE COVID PANDEMIC. SO WHAT’S GOING ON THERE? WHY ARE WE LOOKING AT SUCH TIGHT SPREADS WHEN COMPANIES ARE FILING FOR PROTECTION FROM CREDITORS? KELSEY: THIS MAY BE A DISCONNECT OF WHICH COMPANIES WE’RE TALKING ABOUT. WHEN YOU’RE TALKING ABOUT THE INVESTMENT GRADE OR HIGH YIELD MARKET AND WE LOOK AT THOSE CORPORATE FUNDAMENTALS, DEFAULT RATES IN THE HIGH YIELD MARKET HAVE BEEN VERY LOW, AND CORPORATE FUNDAMENTALS IN THE GRADE MARKET HAVE BEEN VERY SOLID AND JUSTIFY NARROW SPREADS AND WHAT KEEPS THEM NARROW WILL ULTIMATELY BE DEMAND FOR CREDIT. THE REASON WE’VE SEEN DEMAND FOR CREDIT DESPITE NARROW CREDIT SPREADS, ONE, OF COURSE, THE CORPORATE FUNDAMENTALS ARE RELATIVELY STABLE AND STARTING FROM A HIGH STARTING POINT BUT I THINK IT’S ALSO THE ALL IN YIELD THAT’S ATTRACTING PEOPLE. IF YOU LOOK AT HIGH YIELD, FOR EXAMPLE, THE SPREADS IN THE FIFTH PERCENTILE OR MAYBE EVEN NARROWER VERSUS HISTORY. THE YIELDS ARE IN THE 50TH PERCENTILE. THAT’S ACTUALLY STILL A DECENT KIND OF STARTING POINT FOR INVESTORS AND SPREADS ARE ONE METRIC OF VALUATION PEOPLE ARE LOOKING AT BUT THE ONE COMPELLING IS THE ALL IN YIELD. MATT: THE BANKRUPTCIES ARE COMING FROM THE COMPANIES THAT AREN’T NECESSARILY SELLING DEBT, CERTAINLY NOT INVESTMENT GRADE CREDIT. GREAT TO GET YOUR TAKE. THANKS SO MUCH FOR JOINING US AT 5:30 IN THE MORNING, KELSEY BERRO OF JP MORGAN. LET’S GET TO THE OTHER TOP STORIES TRENDING ON THE BLOOMBERG TERMINAL THIS MORNING. VLADIMIR ZELENSKYY PUSHED BACK AGAINST MOSCOW’S IDEA TO ADD CHINA AS A SECURITY GUARANTOR IN THE EVENT AFTER CEASE-FIRE. VICE PRESIDENT J.D. VANCE TOLD FOX NEGOTIATIONS OVER ENDING THE WAR HINGES ON TERRITORIES THEY WANT TO CONTROL. AND COOK SAID SHE CAN’T BE BULLIED TO STEPPING DOWN AND IN A STATEMENT SHE SAID SHE HAD NO INTENTION TO LEAVE WITH THE PRESIDENT CALLING OUT MORTGAGE FRAUD. THE RESIGNATION WOULD CREATE ANOTHER OPENING FOR TRUMP TO FILL ON THE BOARD OF THE FED IF IT HAPPENED. PALANTIR’S LOSING STREAK HANDS A RARE WIN TO SHORT SELLERS. IT WIPED OUT MORE THAN $730 BILLION OF THE COMPANY’S MARKET CAP. DATA FROM THEM SHOW THEY’RE GIVING THEM .6 BILLION AND SHARES DOWN 17% FROM A RECORD ALL TIME HIGH EARLIER THIS MONTH. IT’S BEEN A TOUGH WEEK FOR TECH. MORE ON THE SELL-OFF AND BEINGLE’S A.I. PUSH AS WELL. THIS IS BLOOMBERG. ♪ > > WE’RE GOING THROUGH THIS A.I. FATIGUE, IF YOU WILL. EVERYONE SAYING THEY HAVE SOMETHING BETTER, A BETTER MOUSETRAP, BUYERS ARE HOLDING OFF AND USERS ARE LIKE WE GOT ENOUGH. WE’RE IN A DIGESTION PHASE AND VERY ENCOURAGED WHAT WILL HAPPEN LONG TERM. THIS IS CLASSIC OF A NEW TECHNOLOGY UNVEILING. IT’S JUST GOING TO TAKE TIME TO ACQUIRE, GET THE TASTE OF IT AND USE IT IN A WAY THAT IS HELPFUL. NONE OF THIS IS SURPRISING. MATT: THAT WAS BRENT BILL FROM JEFFRIES REACTING TO THE LATEST SELL-OFF IN TECH, A TWO-DAY SELL-OFF THAT MAY EXTEND ITS WEAKNESS AFTER SHAVING 2% OFF THE NASDAQ 100. THERE’S LITTLE CHANGE IN FUTURES. WE’VE BEEN UP AND WE’VE BEEN DOWN AND THE OPEN IS IN LESS THAN FOUR HOURS FROM NOW. JOINING US TO TALK TECH IS BLOOMBERG’S TOM MCKENZIE AND HOSTS BLOOMBERG TECH EUROPE AND HAS BEEN COVERING MULTIPLE PLACES FOR YEARS. WHAT DO YOU THINK OF THE SELL-OFF, VALUATIONS HIT SUCH INCREDIBLE HIGHS AND I WAS MARVELING AT PALANTIR TRADING AT MORE THAN 100 TIMES SALES FORECAST AND IS NOT SOMETHING YOU SEE OFTEN. DOES IT JUST LOOK LIKE A BREATHER, THE PAUSE THAT REFRESHES OR ARE INVESTORS REPRICING THE RISK? TOM: YOU SAW THE BUY THE BET ISSUE AND PALANTIR, SOMEONE DESCRIBED THE VALUATION AT NOSEBLEED LEVELS AND THE STOCK IS UP 100% YEAR TO DATE AND THE BEST PERFORMING STOCK. AND THE MARKET CAP IS OFF $70 BILLION U.S. DOLLARS ALONE. THE SHORT TRADES IN PALANTIR FINALLY PAYING OFF FOR SOME OUT THERE WITH GAINS OF .4 BILLION U.S. DOLLARS FOR THE SHORT HOLDERS OF THAT STOCK AND SOME SHORTING THE STOCK BUT YEAR TO DATE THEY’RE FIRMLY IN THE RED ON A PAPER VALUE LEVEL. PALANTIR MAYBE IS IN ITS OWN KIND OF WORLD GIVEN THE VALUATION YOU HIGHLIGHTED THERE. WHAT ARE THE CATALYSTS? IS IT PROFIT TAKING AHEAD OF WHAT WE HEAR FROM JAY POWELL IF HE PUSHES BACK AND RATES STAY HIGHER LONGER IN THE U.S. THOUGH MOST MAJOR TECH COMPANIES DO WELL IN A HIGH INVESTMENT RATE THAN IT COSTS THEM, OR IS IT JUST THE RUN-UP, THE MOMENTUM WHEN YOU HEAR HOWARD MARKS SAYING WE’RE IN THE EARLY STAGES OF A BUBBLE AND SAM ALTMAN SAID A LITTLE BIT OF HYPE AND FROTH WHEN IT COMES TO INVESTOR EXPECTATIONS AROUND A.I. IT COULD BE A NUMBER OF THOSE FACTORS ALTOGETHER AND WHAT WE EXPECT FROM JAY POWELL WHO WE HEAR FROM HIM ON FRIDAY. MATT: AND I HEARD THEY’LL SPEND MILLIONS ON A.I. INFRASTRUCTURE AND THAT’S A FASCINATING STORY. GOOGLE ALSO IS ACTIVE IN THE NEWS, PUTTING OUT A WHOLE NEW LIST OF THINGS, FROM PHONES TO WATCHES TO EAR BUDS. ARE THEY REALLY TRYING TO MAKE A PUSH TO TAKE SHARE AWAY FROM APPLE, HAS THAT BEEN EXPECTED? TOM: YOU SEE THEM SWITCHING OUT FOR PIXEL PHONE COMING OUT AROUND OCTOBER AND DOES REMAIN A KEY QUESTION. IF THE A.I. PIECE OF THIS CAN WORK FOR GOOGLE, MAYBE YOU GET TO A TIPPING POINT, A PIVOT POINT, A MOMENT WHERE PEOPLE REALLY START TO BREAK OUT OF THE APPLE ECOSYSTEM THAT PROVES SO STICKY FOR SO MANY BUT COMES DOWN FROM GEMINI AND YOU’RE GETTING A SENSE FROM GOOGLE THEY LIKE IT AND HAVE PLAYED THE CATCH-UP STORY WITH OPEN A.I. AND CHATGPT AND FIELD LIKE THEY’RE MATCHING IF NOT EXCEEDING THAT AND THEY’RE DOING A VICTORY LAP AROUND APPLE AT THIS POINT. MATT: GREAT DELIVERY, INTERESTING STUFF, TOM. I ENJOYED WATCHING YOUR TELEVISION PROGRAM. FANTASTIC JOB, BLOOMBERG TECH, AND TOM MCKENZIE TALKING ABOUT THE SELL-OFF THAT MAY CONTINUE OR WHAT’S OFFERED BIGEMINY COULD BREAK PEOPLE OUT OF THE APPLE ECOSYSTEM BUT TENDS TO BE A LONG BET. TURNING TO OUR PRIVATEER MARKETS, DANI BURGER SPOKE WITH BLACKISTONE’S VERN PERRY ABOUT THE CONTINUED UPSIDE IN SECONDARY MARKETS. VERN: IF YOU THINK WHERE THE SECONDARY MARKET HAS COME THE PAST FEW YEARS, .3 BILLION IN 2,000 AND ROUGHLY HALF A PERCENT IS THE TURNOVER RATE AND WHAT PERCENTAGE IS THE 1.3 OF TOTAL AVAILABLE DOLLARS IN PRIVATE MARKET FUNDS AND THIS YEAR I EXPECT IT TO BE $220 BILLION AND ONLY WILL REPRESENT 1.4% OF TOTAL AVAILABLE DOLLARS IN FUNDS. IT’S TINY. I THINK SECONDARIES IS THE MOST UNDERUTILIZED TOOL IN PRIVATE MARKETS AND THE TURNOVER RATE SHOULD BE CLOSER TO 9% AND THAT 9% IS DECADES AWAY FROM MY OPINION BUT THE GROWTH POTENTIAL FROM HERE IS ENORMOUS. DANI: THE REASON THERE’S BEEN SO MUCH GROWTH THIS YEAR TO LAST YEAR, GROWTH IS SLOWING AND PEOPLE ARE LOOKING FOR LIQUIDITY SOURCES AND IF DEAL VOLUME PICKS UP AND GET SOME OF THAT UNLOCKED, DOES IT SLOW THE FLOW AT ALL? VERN: THE ANSWER IS NO. THINK OF LAST YEAR, 2024, A RECORD YEAR, 60 BILLION OF CONSECUTIVE VOLUME AND THE PREVIOUS RECORD WAS 2021. WE KNOW WHAT WAS HAPPENING IN 2021, A LOT OF M & A AND WHETHER IT’S A ROBUST OR WEAK MARKET, THE ROLE WILL INCREASE AS A SOLUTION TO PRIVATE MARKET INVESTORS. DANI: YOU’RE TALKING ABOUT SOMETHING STRUCTURAL SHIFTING AND WHAT DOES IT MEAN FOR HOW THE INDUSTRY, HOW FUNDS THINK ABOUT LIQUIDITY AND EXITS MORE BROADLY. LET’S TALK ABOUT L.P.’S, THE REASON THEY ACCESS THE SECONDARY MARKET IS MULTIPLE REASONS. THE FIRST ONE IS A HUGE MISPERCEPTION. PEOPLE ASSUME IF YOU’RE SELLING ON THE SECONDARY MARKET, YOU’RE DISTRESSED, YOU’RE ADMITTED DEFEAT, YOU DON’T LIKE THE G.D.P. AND MOST PEOPLE ARE SELLING DUE TO ACTIVE PORTFOLIO MANAGEMENT AND THEY’RE CRYSTALLIZING GAINS TO PLAY OFFENSE AND REINVEST IN G.P.’S AND FUNDS THEY LIKE. YOU’RE RIGHT, OVER THE PAST 3 1/2 YEARS, DISTRIBUTION HAS BEEN SLOW AND DOWN 50% IN 2023. AND WE’RE STARTING TO SEE THE TREND REVERSE. YEAR TO DATE UP 25%. YEAH, PEOPLE ARE SELLING TO GENERATE DISTRIBUTIONS TO PAID IN CAPITAL OR I DID QUESTIONEDDITY BUT THE REASON PEOPLE ADDRESS THE SECONDARY MARKET IT FOR ACTIVE MANAGEMENT. DANI: LET’S SAY YOU HAVE CREDIT GROWING RAPIDLY AND SECONDARY AND IS SUPPOSED TO BE A THING THAT’S A SHORTER DURATION AND YOU GET A RETURN TO INVESTORS MORE QUICKLY AND WHAT DOES IT MEAN IF CREDIT IS BECOMING ANOTHER PART OF THE HOT MARKET. VERN: IF YOU WAIT LONG ENOUGH YOU’LL GET YOUR CASH BACK. BUT THAT IGNORES THE POINT OF WHAT DO OTHER OPTIONS DO INVESTORS HAVE? SOMEONE MAY LOOK TO CREDIT TO HAVE MORE OCTANE OR LOCK IN GAINS. MATT: THE INTERVIEW OF VERN PERRY WITH BLACKISTONE. THIS IS BLOOMBERG. MATT: LET’S LOOK AT WHAT’S AHEAD TODAY. WAL-MART REPORTS EARNINGS BEFORE THE BELL THIS MORNING, JUST ABOUT ONE HOUR’S TIME. NUMBERS YOU WANT TO PAY CLOSE ATTENTION TO BECAUSE THEY’LL TELL YOU A LOT ABOUT THE U.S. ECONOMY. ALSO ON THE U.S. ECONOMY AT THE JACKSON HOLE ECONOMIC SYMPOSIUM, KICKS OFF TODAY, TOMORROW WE HEAR FROM FED CHAIR JEROME POWELL. WE’LL HEAR FROM SCHMID, BOSTIC AND OTHERS THROUGHOUT THE DAY CAPPED OFF BY THE CHAIR SPEECH ON FRIDAY. SPECIAL COVERAGE OF THAT. IN TERMS OF MOVERS, COTY AS VALERIE TYTEL HAS BEEN TELLING US FORECASTS DEEP DECLINES AS RETAILERS CLEAR OUT EXISTING INVENTORY AND THOSE SHARES DOWN 22%. WAL-MART FALLING AHEAD OF EARNINGS THAT COME OUT IN AN HOUR AND H.P. ENTERPRISE, MORGAN STANLEY TAKING IT TO OVERWEIGHT CLOSING THE JUNIPER DEAL. ♪",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "PRIVATE MARKET INVESTORS",
      "weight": 0.05236103
    },
    {
      "name": "PRIVATE MARKETS",
      "weight": 0.050725102
    },
    {
      "name": "LAST YEAR",
      "weight": 0.050110377
    },
    {
      "name": "PRIVATE MARKET FUNDS",
      "weight": 0.049966447
    },
    {
      "name": "MARKETS",
      "weight": 0.049202077
    },
    {
      "name": "LABOR MARKET PRINTS",
      "weight": 0.04912408
    },
    {
      "name": "SECONDARY MARKETS",
      "weight": 0.04894581
    },
    {
      "name": "MARKET MOVEMENT",
      "weight": 0.04721856
    },
    {
      "name": "YEAR",
      "weight": 0.04510147
    },
    {
      "name": "YEARS",
      "weight": 0.04510147
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.96240234375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.93115234375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.443603515625
    }
  ],
  "sentiment": {
    "positive": 0.05828854,
    "negative": 0.7715591,
    "neutral": 0.1701524
  },
  "summary": "The Dollar hits a two-week high ahead of the annual Jackson Hole Symposium, which is set to kick off as the Fed brings in significant inflation concerns and retail sales. Stocks are expected to continue to deteriorate, with S & P FUTURES (S & P) and NASDAQ FUTures (NASDAQ) futures also showing signs of weakness. Meanwhile, COTY's dropped 21% PREMARKET, the largest retailer in the world, saw a significant drop in its value due to a 21% drop in pre-market share. CORE WEAVE, the A.I.D. CENTER COMPANY, a company that debuted in March by 1.5% after regulatory filings, saw positive news about soft consumer demand and a significant increase in sales. The article also discusses the FED’s RATE PATH and the potential for HIKES and CYAWAWAWAVE to be discussed at the Jackson Hole symposium.",
  "shortSummary": "Stocks waver as investors await the annual Jackson Hole symposium, with RUSSELL FUTures (R) down 21% ahead of the event.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "12f3048f2884457a8ea76981c55f3751",
  "places": [
    {
      "osmId": "3043957739",
      "road": "3rd Avenue",
      "suburb": "Manhattan",
      "city": "New York",
      "county": "New York County",
      "state": "New York",
      "postcode": "10016",
      "country": "United States",
      "countryCode": "us",
      "amenity": "Jackson Hole",
      "neighbourhood": "Manhattan Community Board 6",
      "coordinates": {
        "lat": 40.7461718,
        "lon": -73.9775484
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "Bloomberg’s morning briefing highlighted a sell‑off in equity futures, a two‑week high in the dollar, and a muted Treasury curve as investors await Fed Chair Jerome Powell’s speech at the Jackson Hole symposium. Market watchers noted that the Fed’s minutes emphasize inflation concerns, while the probability of a September rate cut has fallen to about 80% as inflation data remain sticky. Earnings previews focus on Walmart and retail names like Coty, with tech stocks experiencing a sharp pullback amid valuation concerns and a broader AI fatigue narrative. Private‑market commentary underscored a growing role for secondary markets as investors seek liquidity and returns amid a tightening credit environment.",
  "argos_id": "T8V9WXMKC"
}