{
  "url": "https://www.businessinsider.com/handshake-ceo-ai-young-workers-advantage-college-grads-job-transformation-2025-8",
  "authorsByline": "Lee Chong Ming",
  "articleId": "db99c94e077244f3b2cc7f60ec044054",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/68abd94dcfc04e97619bed5b?width=1000&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T05:04:43+00:00",
  "addDate": "2025-08-25T05:10:07.068312+00:00",
  "refreshDate": "2025-08-25T05:10:07.068315+00:00",
  "score": 1.0,
  "title": "AI could be the best thing to happen to young workers, says Handshake's CEO",
  "description": "AI may transform jobs, but Handshake's CEO, Garrett Lord, said Gen Z's fluency with AI gives them a major edge.",
  "content": "The rise of AI has fueled panic about the end of entry-level jobs. But one founder says young workers may actually have the upper hand.Garrett Lord, the CEO of job search and AI training platform Handshake, said on an episode of \"Lenny's Podcast\" published Sunday that today's graduates are uniquely positioned to succeed because they're \"AI native.\"Knowing how to leverage AI is like \"having your Iron Man suit on,\" Lord said.While headlines warn that AI will wipe out junior roles, Lord said employers on Handshake's platform — from Fortune 500 companies to federal agencies — are telling him the opposite.\"A lot of people are kind of hyperbolic at saying that all young people won't have jobs,\" Lord said. \"That's not what we're hearing from our employers,\" he added.Instead, young workers who grew up with AI tools can now take on the work of entire teams. In fields like social media marketing, for example, one employee can shoot videos, design assets, post across multiple platforms, and run analytics on their own, Lord said.\"They don't need a data science degree to be able to do that,\" he added.Lord also said that \"hundreds of millions of jobs will evolve\" and workers will have to reskill, but AI is ultimately an accelerant.\"I'm really a believer that this is just like enabling human beings to be even more productive and create more impact,\" he said.Lord did not respond to a request for comment from Business Insider.Other tech leaders have also suggested that Gen Z graduates may be in the right place at the right time.OpenAI CEO Sam Altman recently said on Cleo Abram's \"Huge Conversations\" YouTube show that AI will undoubtedly eliminate jobs — but that younger workers are better positioned to adapt.\"If I were 22 right now and graduating college, I would feel like the luckiest kid in all of history,\" Altman said, adding that he's more worried about how older employees will adapt to AI changing the workplace than college graduates.Reid Hoffman, the venture capitalist who cofounded LinkedIn, said young people should use their familiarity with AI as a selling point when seeking work.\"You are generation AI. You are AI native. So bringing the fact that you have AI in your tool set is one of the things that makes you enormously attractive,\" Hoffman said in a video he published on his YouTube channel in June.Still, not every tech CEO is optimistic.Anthropic CEO Dario Amodei said in a May interview that AI could wipe out up to half of entry-level, white-collar jobs in the next five years. \"Most of them are unaware that this is about to happen,\" he said. \"It sounds crazy, and people just don't believe it.\"",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "young workers",
      "weight": 0.089112535
    },
    {
      "name": "younger workers",
      "weight": 0.089112535
    },
    {
      "name": "AI tools",
      "weight": 0.08663592
    },
    {
      "name": "young people",
      "weight": 0.08170549
    },
    {
      "name": "AI",
      "weight": 0.07805737
    },
    {
      "name": "generation AI",
      "weight": 0.07584645
    },
    {
      "name": "Garrett Lord",
      "weight": 0.070037596
    },
    {
      "name": "Lord",
      "weight": 0.06949911
    },
    {
      "name": "jobs",
      "weight": 0.06723723
    },
    {
      "name": "Gen Z graduates",
      "weight": 0.06638669
    }
  ],
  "topics": [
    {
      "name": "AI"
    },
    {
      "name": "Business Leaders"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.78515625
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.68505859375
    },
    {
      "name": "/News/Technology News",
      "score": 0.6611328125
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.63037109375
    },
    {
      "name": "/Jobs & Education/Jobs/Career Resources & Planning",
      "score": 0.62060546875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.479736328125
    },
    {
      "name": "/Jobs & Education/Jobs/Job Listings",
      "score": 0.46630859375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Work & Labor Issues",
      "score": 0.4169921875
    }
  ],
  "sentiment": {
    "positive": 0.07448385,
    "negative": 0.63563555,
    "neutral": 0.28988057
  },
  "summary": "Garrett Lord, CEO of job search and AI training platform Handshake, believes that young workers are better positioned to succeed due to their \"AI native\" skills. While headlines have warned that AI will eliminate entry-level jobs, Lord says that employers on Handshake's platform are telling him the opposite. He believes that while hundreds of millions of jobs will evolve, workers will have to adapt to AI, it is ultimately an accelerant. Other tech leaders have suggested that Gen Z graduates may be in the right place at the time of AI's arrival. However, not all are optimistic about the future of AI, with Anthropoid CEO Dario Amodei suggesting it could eliminate up to half of entry-levels in the next five years.",
  "shortSummary": "The rise of AI has led to a belief that young workers, particularly Gen Z graduates, are uniquely positioned to succeed due to their extensive knowledge of AI tools.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f44b8197f8e84f9b87fae288526d8b90",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "AI is reshaping entry‑level jobs, but many experts say young workers who are \"AI native\" may actually have an advantage. Garrett Lord, CEO of Handshake, argues that graduates who can leverage AI tools can perform multi‑role tasks and that employers are not seeing a mass job loss. Other leaders such as Sam Altman and Reid Hoffman echo this optimism, while some, like Dario Amodei, warn that AI could eliminate up to half of entry‑level white‑collar roles. The consensus is that AI will accelerate job evolution, requiring reskilling but also boosting productivity for those who adapt.",
  "argos_id": "TBW1QRKYW"
}