{
  "url": "https://www.inc.com/moshe-engelberg/the-ceos-playbook-for-team-feedback-that-delivers-results/91230468",
  "authorsByline": "Moshe Engelberg",
  "articleId": "6694b352be9f4beb945201be994e66bb",
  "source": {
    "domain": "inc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://img-cdn.inc.com/image/upload/f_webp,q_auto,c_fit,w_1024,h_1024/vip/2025/08/team-feedback-inc-2107366827.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T17:00:00+00:00",
  "addDate": "2025-08-24T17:21:52.776494+00:00",
  "refreshDate": "2025-08-24T17:21:52.776495+00:00",
  "score": 1.0,
  "title": "The CEO’s Playbook for Team Feedback That Delivers Results",
  "description": "CEOs set the tone for their companies. By modeling personal input and follow-up, you create a culture where feedback is normal and growth is expected.",
  "content": "How can people work together to help one another succeed? It’s a deceptively simple question, and one of the most powerful tools you have as a CEO. Imagine introducing a practice of you and your senior leaders each identifying one specific, observable behavior to improve yourselves. These are concrete actions such as “end every meeting with agreed next steps” or “pause before responding to tough questions.” You choose which actions to prioritize by blending what matters most to you with what your colleagues say would make the biggest difference for them.\n\nSet the tone at the top. When you, as CEO, go first—inviting feedback, listening without defensiveness, and adding your own insight to the mix—you give your team permission to do the same. This is the essence of stakeholder-centered coaching, a process pioneered by Marshall Goldsmith and colleagues. It combines external feedback from those affected by your leadership with your own internal clarity about what matters most right now. That combination produces goals that are both meaningful and doable. Once you’ve set your personal focus, share it openly and ask a few people to watch for it in action. Follow up periodically, with check-in statements such as “I’ve been working on my communication—what are you noticing about it?” These brief exchanges keep the process alive and send a clear signal—progress matters, feedback is welcome, and everyone is accountable for their own growth. Throughout time, this becomes less “the CEO’s latest project” and more “just how things are done here,” a habit of learning with real accountability.\n\nWhat’s your first response to the idea of getting and giving behavioral feedback being a routine part of your culture? What one behavior rises to the top when you combine your own self-assessment with feedback from others? How will you model this practice so that your team feels safe and inspired to do the same? 7 steps for you and your leadership team\n• Ask and reflect. Gather quick input from three to five colleagues on one behavior you can improve. Next, weigh it alongside your own priorities and the organization’s needs and performance review initiatives.\n• Make it public. Share your chosen focus with your team so they can notice and support your progress.\n• Check progress regularly. Once or twice a month, ask those same colleagues what they’ve observed and thank them for their input.\n• Coach your team to do the same. Walk each senior leader through the process. Help them identify their behavior, seek input, and set a check-in plan.\n• Embed feedback into leadership meetings. Start monthly leadership meetings with a five-minute “what I’m working on” round. Keep it light but consistent.\n• Pair people up. Encourage leaders to choose an “accountability buddy” who will observe their shift and give real-time feedback.\n• Capture and share wins. Create a shared document or quick Slack channel where leaders can post “small wins” and what they’ve noticed about themselves or others. As CEO, your behavior sets the tone inside your company. By modeling a clear, consistent cycle of input, reflection, action, and follow-up to improve your own behaviors, you create a culture that welcomes feedback and facilitates growth. When leaders at every level see you doing this—choosing your own focus, asking for input, acting on it, and looping back—they’re far more likely to follow suit. Throughout time, the practice becomes part of your organization’s DNA. Thus, your company culture becomes more adaptive, connected, and effective. All because you started with one well-chosen behavior, the courage to work on it openly, and the willingness to invite your team to join you.\n\nThe opinions expressed here by Inc.com columnists are their own, not those of Inc.com.",
  "medium": "Article",
  "links": [
    "https://mgscc.net/",
    "https://www.inc.com/moshe-engelberg/how-internal-alignment-can-drive-business-success/91198420",
    "https://www.inc.com/moshe-engelberg/why-self-awareness-is-crucial-to-effective-leadership/91223479"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Team Feedback",
      "weight": 0.09746893
    },
    {
      "name": "behavioral feedback",
      "weight": 0.07892801
    },
    {
      "name": "feedback",
      "weight": 0.07708004
    },
    {
      "name": "external feedback",
      "weight": 0.07702488
    },
    {
      "name": "leadership meetings",
      "weight": 0.06804403
    },
    {
      "name": "quick input",
      "weight": 0.06802207
    },
    {
      "name": "monthly leadership meetings",
      "weight": 0.06692301
    },
    {
      "name": "input",
      "weight": 0.06005945
    },
    {
      "name": "leaders",
      "weight": 0.05853394
    },
    {
      "name": "colleagues",
      "weight": 0.055751327
    }
  ],
  "topics": [
    {
      "name": "Business Leaders"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Business Operations/Management",
      "score": 0.78173828125
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.68603515625
    },
    {
      "name": "/Jobs & Education/Jobs/Career Resources & Planning",
      "score": 0.5185546875
    },
    {
      "name": "/People & Society/Self-Help & Motivational",
      "score": 0.3212890625
    }
  ],
  "sentiment": {
    "positive": 0.20663781,
    "negative": 0.32059434,
    "neutral": 0.47276777
  },
  "summary": "The CEO's playbook for team feedback is a powerful tool that allows people to identify one specific behavior to improve themselves. This involves setting the tone at the top and allowing your team to respond to feedback without defensiveness. The process of stakeholder-centered coaching, pioneered by Marshall Goldsmith and colleagues, combines external feedback from those affected by your leadership with internal clarity about what matters most. Once you identify a specific behavior, share it publicly and follow up with check-in statements such as \"I’ve been working on my communication,\" or \"pause before responding to tough questions\". These statements establish a clear culture that welcomes feedback and facilitates growth. The CEO's behavior sets the tone inside your company and encourages others to follow suit.",
  "shortSummary": "As CEO, CEO, can foster a cohesive, collaborative culture by encouraging team collaboration through integrating individual behavior into daily practices, creating a consistent, consistent culture.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "71fdf1a8bb0e4296a7330fddcee8d467",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://mgscc.net/",
      "text": "At Marshall Goldsmith Stakeholder Centered Coaching® , we don’t just certify coaches. We equip you with a structured, results-driven methodology that guarantees measurable leadership growth. Our proven methodology helps you create lasting change for your clients so you can stand out, build a thriving coaching business, and elevate your credibility.\nAnd you won’t be doing it alone. When you join our certification program, you become part of a global network of top coaches and mentors, all committed to your success. Because coaching isn’t just about what you know, it’s about the impact you deliver.\nWant to learn more about Stakeholder Centered Coaching® and how it can transform your coaching practice? Let’s talk.\nThe process is simple, but not easy. Think of it as a 5-step approach.\n1. Pick a leadership skill to improve.\n2. Get buy-in from the stakeholders.\n3. Use FeedForward to action plan.\n4. Lead change with monthly involvement.\n5. Measure changes in leadership effectiveness.\nThe research-based process ensures that you are continuously more effective in your coaching practice, guaranteed. Best of all, the habits you establish through the program will stay with you forever.\nBecome a Stakeholder Centered Coach today.\nWe are the world’s leading experts on executive coaching. For more than 30 years we’ve been pioneering the coaching field and paving the way for those who came after us. Our coaching process is so powerful that we guarantee improvement for our clients. Now you can, too.\nLearn what took us decades of research & development to perfect.\nCoaching in\nUsed in\norganizations\nExecutive Coach Training Program\nHere are a few organizations who love doing business with us.\nSpeak with a program advisor to learn more about the Stakeholder Centered Coaching® methodology and how it fits into your unique situation.\nYou’ll be paired with a certified coach to guide your steps and mentor you through the process.\nYour new stakeholder centered skills give you the pathway to guaranteed growth as a coach. Use our world-famous Mini-Survey™ tool (the first one’s on us!).\nStay connected and stay informed! Be the first to know about our upcoming events, latest publications, and exciting pro bono opportunities.\nAt the heart of our organization is the Stakeholder Centered Community. Our community is ‘a place where we can connect, collaborate, and co-create’ and consists of coaches, leaders, entrepreneurs, thought leaders, and more. Some of the following events are exclusively for our certified coaches. If you’d like to request a public event, webinar, or workshop, please email contact@mgscc.net.\nJoin weekly live-facilitated Coaching Labs as we explore real leadership challenges from real coaching engagements. Learn the 7 most important skills of a behavioral coach and get targeted feedback from expert coaches on your performance.\nWelcome to our Office Hours, a dedicated time for you to connect directly with our expert coaches and receive personalized guidance and support. During these interactive sessions, you’ll have the opportunity to ask questions, discuss challenges, and gain valuable insights tailored to your unique needs. Our Office Hours provide a safe and supportive space for you to engage with experienced professionals in a one-on-one or group setting. Don’t miss this exclusive opportunity to tap into their expertise and accelerate your journey towards success.\nWelcome to our Office Hours, a dedicated time for you to connect directly with our expert coaches and receive personalized guidance and support. During these interactive sessions, you’ll have the opportunity to ask questions, discuss challenges, and gain valuable insights tailored to your unique needs. Our Office Hours provide a safe and supportive space for you to engage with experienced professionals in a one-on-one or group setting. Don’t miss this exclusive opportunity to tap into their expertise and accelerate your journey towards success.\nWelcome to our Office Hours, a dedicated time for you to connect directly with our expert coaches and receive personalized guidance and support. During these interactive sessions, you’ll have the opportunity to ask questions, discuss challenges, and gain valuable insights tailored to your unique needs. Our Office Hours provide a safe and supportive space for you to engage with experienced professionals in a one-on-one or group setting. Don’t miss this exclusive opportunity to tap into their expertise and accelerate your journey towards success.\nWelcome to our Office Hours, a dedicated time for you to connect directly with our expert coaches and receive personalized guidance and support. During these interactive sessions, you’ll have the opportunity to ask questions, discuss challenges, and gain valuable insights tailored to your unique needs. Our Office Hours provide a safe and supportive space for you to engage with experienced professionals in a one-on-one or group setting. Don’t miss this exclusive opportunity to tap into their expertise and accelerate your journey towards success.\nIs there something we’ve missed? You’ve seen who we are and who we help. You learned about the methodology and seen the results that are reliably produced. Perhaps you’re looking for some After Action Reviews from real clients? Maybe you wanted to learn more about our award winning Coach Training Program. Or you may be simply wanting some free resources. If there’s any stone left unturned or if you want to get in touch with us, we’re ready to listen.\nEstablished in 1987, for more than 30 years we’ve been pioneering the coaching field and paving the way for those who came after us. Our coaching process is the culmination of decades of research and development with more than 250,000 individuals from the world’s top organizations. Now you can benefit from the growth-guarantee that took us years to perfect.\n© 2024 · Stakeholder Centered Coaching Ltd. · All Rights Reserved.\nJoin our mailing list to get new insights, resources, and the latest podcast episodes.\nPrivacy Policy: We hate spam and promise to keep your email address safe."
    }
  ],
  "argos_summary": "The article explains how CEOs can foster a culture of continuous improvement by modeling stakeholder‑centered coaching—seeking feedback, setting a specific behavior to improve, and publicly sharing progress. It outlines a seven‑step process: gather input, choose a behavior, make it public, check progress, coach leaders, pair accountability buddies, and celebrate wins. By embedding short feedback rounds into leadership meetings and encouraging leaders to do the same, the practice becomes part of the organization’s DNA, leading to a more adaptive, connected, and effective culture.",
  "argos_id": "TGYFX66U6"
}