{
  "url": "https://www.usatoday.com/story/news/politics/2025/08/24/donald-trump-chris-christie-bridgegate-investigation/85811006007/",
  "authorsByline": "Joey Garrison",
  "articleId": "d0bc8ded9ad04bdabc4016ed504d4b80",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/25/USAT/85811345007-624669710.jpg?crop=2911,1638,x0,y0&width=2911&height=1638&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T02:46:21+00:00",
  "addDate": "2025-08-25T02:51:43.827607+00:00",
  "refreshDate": "2025-08-25T02:51:43.827610+00:00",
  "score": 1.0,
  "title": "President Trump threatens Chris Christie with new 'Bridgegate' investigation",
  "description": "President Donald Trump threatened to open an investigation targeting Chris Christie over \"Bridgegate\" after Christie criticized Trump on television.",
  "content": "WASHINGTON ― President Donald Trump threatened to open an investigation targeting Chris Christie over the former New Jersey governor's decade-old \"Bridgegate\" scandal after Christie criticized Trump on television earlier in the day.\n\nThe threat came just days after the FBI searched the home and office of another Trump critic, former National Security Adviser John Bolton, as part of an open criminal investigation. Trump lashed out at the former friend-turned-foe Christie in an evening Aug. 24 post on Truth Social, remarking that he just watched \"Sloppy Chris Christie\" on ABC's This Week.\n\n\"Can anyone believe anything that Sloppy Chris says?\" Trump wrote. \"Do you remember the way he lied about the dangerous and deadly closure of the George Washington Bridge in order to stay out of prison, at the same time sacrificing people who worked for him, including a young mother, who spent years trying to fight off the vicious charges against her.\"\n\nTrump added: \"Chris refused to take responsibility for these criminal acts. For the sake of JUSTICE, perhaps we should start looking at that very serious situation again? NO ONE IS ABOVE THE LAW!\"\n\nAs the Republican governor of New Jersey, Christie's \"Bridgegate\" scandal arose in 2013 when top officials of his administration ordered the closure of access lanes to the George Washington Bridge in a bizarre scheme to create a traffic jam to get back at a Democratic mayor who had not endorsed Christie's reelection bid.\n\nChristie was not charged with crimes, but two officials in his administration were, though the Supreme Court later overturned their federal convictions in 2020.\n\nChristie, a onetime close Trump ally who led Trump's 2016 presidential transition team, is today one of the president's most outspoken Republican critics. Christie was the only Republican candidate to regularly go on the attack against Trump in the 2024 Republican primary.\n\nTrump did not specify what Christie said during his ABC appearance that set him off. Christie accused Trump of politicizing the Justice Department as he was interviewed on the show.\n\n\"You were told that this was what he was going to do,\" Christie said. \"And not by me, by Donald Trump during the 2024 campaign. He told you he was going to do this – that he was going to have a Justice Department that acted his personal legal representation, and that is what they’re doing.”\n\nChristie made a jab at Trump over the FBI's search of Bolton's Bethesda, Maryland, home and Washington, D.C. office, which Vice President JD Vance said involved \"classified documents.\"\n\n\"I think it’s kind of funny to hear the president talk the way he does about Bolton and classified information, yet when he had classified information, the same rules didn’t apply,\" Christie said, referring to the FBI's search of Trump's Mar-a-Lago home in 2022.\n\nIn his interview on \"This Week,\" Christie also suggested that comments from Jeffrey Epstein accomplice Ghislaine Maxwell ‒ in which she said Trump was not guilty of any wrongdoing and praised him as \"cordial\" and \"kind\" ‒ should be taken with a grain of salt.\n\n\"She might as well have taken out Donald Trump, or President Trump, and said, 'The man who can pardon me has never done anything wrong. The man who can pardon me has always been wonderful,\" Christie said, though later adding he doesn't believe Trump had any involvement with Epstein over anything \"untoward or illegal.\"",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/news/politics/2025/08/24/chris-christie-ghislaine-maxwell-donald-trump/85808132007/",
    "https://www.usatoday.com/story/news/politics/2025/07/25/trump-jeffrey-epstein-friendship-conspiracy/85307396007/",
    "https://www.usatoday.com/story/news/politics/2025/08/23/ghislaine-maxwell-transcripts-audio-takeaways/85795551007/",
    "https://www.usatoday.com/story/news/2025/03/27/where-what-mar-a-lago-donald-trump-home-florida/82686108007/",
    "https://www.usatoday.com/picture-gallery/news/politics/2025/01/20/donald-trumps-47th-presidency-in-pictures/77839237007/",
    "https://www.usatoday.com/story/news/politics/2020/05/07/bridgegate-new-jersey-political-pranksters-win-supreme-court/4934370002/",
    "https://www.usatoday.com/news/politics/donald-trump/",
    "https://www.usatoday.com/story/news/politics/2025/08/22/fbi-searches-home-john-bolton/85774763007/",
    "https://truthsocial.com/@realDonaldTrump/posts/115086563627159779",
    "https://truthsocial.com/@realDonaldTrump/115086563627159779"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Chris Christie",
      "weight": 0.10968451
    },
    {
      "name": "Sloppy Chris Christie",
      "weight": 0.10601739
    },
    {
      "name": "President Trump",
      "weight": 0.103883125
    },
    {
      "name": "Donald Trump",
      "weight": 0.10126453
    },
    {
      "name": "Trump",
      "weight": 0.1009905
    },
    {
      "name": "President Donald Trump",
      "weight": 0.10054068
    },
    {
      "name": "Christie",
      "weight": 0.100142404
    },
    {
      "name": "Sloppy Chris",
      "weight": 0.06638438
    },
    {
      "name": "former National Security Adviser John Bolton",
      "weight": 0.06628846
    },
    {
      "name": "Chris",
      "weight": 0.059211724
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.98388671875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.919921875
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.7900390625
    },
    {
      "name": "/News/Gossip & Tabloid News/Scandals & Investigations",
      "score": 0.7138671875
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.36669921875
    }
  ],
  "sentiment": {
    "positive": 0.042940192,
    "negative": 0.7719876,
    "neutral": 0.18507217
  },
  "summary": "President Donald Trump has threatened to open an investigation into former New Jersey governor Chris Christie over the decade-old \"Bridgegate\" scandal. This comes after Christie criticized President Trump on television. The threat comes just days after the FBI conducted a raid on the home and office of another Trump critic, former National Security Adviser John Bolton. Christie, who was once a close ally of the president, accused Trump of politicizing the Justice Department. The scandal arose in 2013 when Christie's administration ordered the closure of access lanes to the George Washington Bridge in a bid to counterbalance a Democratic mayor who had not endorsed Christie's reelection bid.",
  "shortSummary": "President Donald Trump threatened to investigate Chris Christie over the \"Bridgegate\" scandal, amid ongoing investigations into John Bolton and other Trump critics.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d3024a5267f04d48a8822fd6cc44a764",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/news/politics/2020/05/07/bridgegate-new-jersey-political-pranksters-win-supreme-court/4934370002/",
      "text": "Supreme Court calls George Washington Bridge high jinks political, not criminal\nWASHINGTON – The Supreme Court ruled unanimously Thursday that fraud convictions and prison sentences for the perpetrators of a political scheme that blocked a New Jersey community from the world's busiest bridge were a bridge too far.\nThe decision to overturn the convictions brought to a close a case of partisan retribution that came to symbolize the Garden State's unique brand of dirty politics, often mixed with ethical lapses and scandal.\nTo get back at a Democratic mayor who had not endorsed Republican Gov. Chris Christie's 2013 reelection bid, top officials of his administration and the Port Authority of New York and New Jersey closed access lanes to the George Washington Bridge and created a traffic jam in Fort Lee, New Jersey, that lasted for days.\nThough the high court did not minimize the officials' actions, it ruled that William Baroni and Bridget Anne Kelly sought only political gains and losses, not personal profit.\n\"The evidence the jury heard no doubt shows wrongdoing – deception, corruption, abuse of power. But the federal fraud statutes at issue do not criminalize all such conduct,\" Associate Justice Elena Kagan wrote for the court.\n\"Not every corrupt act by state or local officials is a federal crime,\" Kagan wrote. \"Because the scheme here did not aim to obtain money or property, Baroni and Kelly could not have violated the federal-program fraud or wire fraud laws.\"\nThe scandal, which became known as \"Bridgegate,\" was hatched when Baroni and Kelly faked a traffic study to create gridlock for several days in Fort Lee.\nMore: Supreme Court's war on prosecutors meets 'Bridgegate'\nChristie, who attended oral argument in January, was not charged. But the scandal helped turn the popular governor with presidential ambitions into a joke on late-night television, helping to tank his political future.\nThe ex-governor responded to the ruling within minutes, criticizing the work of former U.S. Attorney Paul Fishman and the \"Obama Justice Department\" and alluding to his own tainted reputation.\n\"What cannot be undone is the damage that was visited upon all of the people dragged through the mud who had nothing to do with this incident,\" Christie said in a statement. The result, he said, \"cost the taxpayers millions in legal fees and changed the course of history.\"\nKelly said the ruling \"gave me back my name and began to reverse the six-and-a-half-year nightmare that has become my life.\"\nAnd President Donald Trump sounded off about the decision Thursday afternoon. \"Congratulations to former Governor of New Jersey, Chris Christie, and all others involved, on a complete and total exoneration (with a 9-0 vote by the U.S. Supreme Court),\" the president tweeted.\nThe case was the latest of many in which the high court has looked skeptically – and often reversed – federal prosecutors' creative use of criminal laws to win convictions.\nIn 2016, the court vacated the conviction of former Virginia Gov. Robert McDonnell, who had been sentenced to two years in prison for accepting luxury gifts and loans from a wealthy businessman in exchange for \"official acts.\" The justices ruled unanimously that those were commonplace actions taken on behalf of constituents.\nThe ruling made it harder for prosecutors to use federal fraud statutes against public officials by characterizing what the justices called common favors as crimes.\nThe Supreme Court began pushing back against public corruption prosecutions in 1987, reversing the conviction of Kentucky officials who skimmed money paid by the state to insurance companies. The court reasoned that fraud statutes do not guarantee officials will \"perform their duties honestly.\" A generation later, it added that \"honest services\" fraud must include bribery or kickbacks.\nMore recently, the justices have sided frequently with small-time criminal defendants swept up by large-scale prosecutions.\nIn 2014, the court ruled unanimously that the federal government had no business using an international chemical weapons treaty to prosecute a jilted wife who committed a \"two-bit local assault\" against her husband's lover.\nIn 2015, it ruled that a law aimed at corporate chieftains who destroy evidence should not have been used to convict a Florida fisherman for destroying evidence – in his case, 72 undersized grouper."
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/08/23/ghislaine-maxwell-transcripts-audio-takeaways/85795551007/",
      "text": "From Epstein suicide to Trump and Clinton, 5 takeaways from Ghislaine Maxwell transcripts\nGhislaine Maxwell questioned if Jeffrey Epstein died by suicide, but she waived away conspiracy theories suggesting he was blackmailing powerful men who participated in a sex-trafficking ring.\nThere were no bombshells in newly-released transcripts and audio files from the Justice Department's interviews last month with convicted sex offender and Jeffrey Epstein associate Ghislaine Maxwell, after the department touted the interviews as part of its effort to increase transparency when it comes to Epstein.\nThe hundreds of pages of redacted transcripts and handful of audio clips released Aug. 22 showed that Maxwell questions a medical examiner's finding that the financier killed himself in jail in 2019, while he was awaiting a criminal trial on federal sex-trafficking charges. However, Maxwell waived away conspiracy theories suggesting someone outside the jail had him killed, and said she never saw any man in Epstein's orbit acting inappropriately with a woman.\n\"I never, ever saw any man doing something inappropriate with a woman of any age,\" Maxwell told Deputy Attorney General Todd Blanche, a former defense lawyer to Trump who handled the interviews personally.\nThe non-revelatory transcripts probably won't satisfy people who insist Epstein maintained a list of powerful clients who participated in a sex-trafficking ring, as he rubbed shoulders with some of the world's most rich and powerful men. The Trump administration has faced outrage from members of Trump's own base for refusing to release its files on Jeffrey Epstein, after several people in Trump's inner circle fanned the flames of Epstein-related conspiracy theories for years.\nMaxwell is currently serving a 20-year prison sentence for sex trafficking a minor to Epstein and other sex crimes. Soon after giving the interviews in late July, she was transferred to a cushier, minimum-security prison camp in Texas.\nHere are five takeaways from the newly-released transcripts:\nMaxwell praises Donald Trump, who holds the power to pardon her\nMaxwell appeared to go out of her way to praise President Donald Trump, who was friends with Epstein in the 1990s and early 2000s, and who now holds the power to pardon her. Maxwell's defense lawyer, David Oscar Markus, has said he hopes Trump will exercise that power \"in the right and just way,\" and that Maxwell would be happy to testify before Congress if Trump gives her clemency first.\nTrump noted that power during questioning by reporters about Maxwell on July 28 in Scotland, but added it would be “inappropriate” to discuss it.\nAsked about Trump's relationship with her and with Epstein, Maxwell said Trump was always kind and cordial with her.\n\"And I just want to say that I find, I, I admire his extraordinary achievement in becoming the President now,\" she said. \"And I like him, and I've always liked him.\"\nMaxwell said specifically that she never saw Trump receiving a massage. Epstein has been accused of luring underage girls into sex acts by arranging for them to give massages that would turn sexual. In 2008, he was convicted of a Florida prostitution offense involving minors.\n\"I never witnessed the President in any inappropriate setting in any way. The President was never inappropriate with anybody,\" she said. \"In the times that I was with him, he was a gentleman in all respects.\"\nMaxwell says she never saw Bill Clinton behave inappropriately\nMaxwell characterized President Bill Clinton, who traveled on Epstein's plane, as someone she – rather than Epstein – was close with.\n\"President Clinton was my friend, not Epstein's friend,\" she said.\nClinton traveled on Epstein's plane about 26 times, she said, but she characterized it as \"one journey\" and said she knows Clinton didn't receive a massage during it.\n\"That would've been the only time that I think that President Clinton could have even received a massage,\" she said. \"And he didn't, because I was there.\"\nMaxwell questions if Epstein died by suicide\nIn a two-page July memo declaring it wouldn't be releasing its files on Epstein, the FBI said its investigators concluded Epstein died by suicide in his Manhattan jail cell in August of 2019. Maxwell questioned that finding in her interview with Blanche.\n\"I do not believe he died by suicide, no,\" she said.\nHowever, Maxwell also disputed conspiracy theories suggesting someone outside the jail had Epstein killed to keep him silent.\n\"Of course it's possible,\" Maxwell said. \"But I don't know of any reason why, and I don't believe in the blackmail or in any of this, I don't think Epstein had a hit on like that.\"\nShe added that she thought the idea was \"ludicrous\" because Epstein would have been \"a very easy target\" before he was jailed in 2019, if a powerful person had actually decided to take him out. If Epstein was murdered, she believes it was \"an internal situation\" involving someone else at the jail.\nMaxwell says she can't explain massive money transfers from Epstein\nBlanche asked Maxwell about banking records indicating that Epstein sent her or her entities about $30 million in money over several years. The transfers included about $18.3 million in 1999, $5 million in 2002, and $7.4 million in 2007.\nBy 2005, Epstein was under investigation for sex crimes involving minors.\nMaxwell denied that Epstein was paying her for recruiting underage girls to be sexually abused, as prosecutors suggested at her trial. She said some of the transfers could have been to accounts controlled by Epstein's accountants, or could have been loans from Epstein for her business ventures.\n\"He never paid me ... for any nefarious reason,\" Maxwell said. \"I don't think this money is mine.\"\nMaxwell maintains innocence, despite convictions\nMaxwell maintained her innocence throughout the two days of interviews, despite being convicted in 2021 of conspiring to entice and transport minors for illegal sex acts and of sex trafficking a minor to Epstein. Maxwell currently has an appeal pending at the U.S. Supreme Court.\nShe said she never knowingly recruited someone underage to perform massages for Epstein and never witnessed sexual abuse.\n\"I never saw a single masseuse ever look unhappy or not come back or whatever,\" she said.\nThe seeming dead end when it comes to new accountability is unlikely to satisfy victims, who were already upset by the Justice Department's decision to shift Maxwell to a lower-security prison after she spoke with Blanche.\n\"President Trump has sent a clear message today: Pedophiles deserve preferential treatment and their victims do not matter,\" the surviving siblings of Epstein victim Virginia Giuffre, who died by suicide in April, said in a statement along with victim Annie Farmer and her sister, Maria Farmer, following reports of the move.\nAfter the transcripts' release, Maxwell defense lawyer David Oscar Markus said in a statement on X that his client \"is innocent\" and never participated in sexual abuse against anyone."
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/07/25/trump-jeffrey-epstein-friendship-conspiracy/85307396007/",
      "text": "How Trump and 'terrific guy' Jeffrey Epstein's party boy friendship ended badly\nDonald Trump and Jeffrey Epstein partied together for more than a decade. One became president, the other died in jail.\nLong before the little black book, before the conspiracy theories, before one died by suicide in jail and one ascended to the White House, Jeffrey Epstein and Donald Trump were poster boys for ’90s New York City excess.\nParties. Models. Mansions.\nThey danced with cheerleaders at Mar-a-Lago and dined with celebrities in Manhattan. Trump flew on Epstein’s private jet between New York – where they lived blocks apart − and Florida, where they owned mansions 2 miles from each other. Their lives intersected over decades, with Epstein once claiming he introduced Trump to his third wife, Melania.\n“Donald Trump and Jeffrey Epstein were both horny rich guys with an eye for young models,” Michael Gross, author of the 1995 book “Model: The Ugly Business of Beautiful Women,” told USA TODAY. Now, their friendship plagues Trump's second term in the White House.\nTrump hasn’t been accused of any wrongdoing in the Epstein case, but he is among the dozens of politicians, actors and tech leaders connected to the billionaire who was first convicted in 2008 of paying teenage girls for sex acts and accused in 2019 in a sprawling sex trafficking scheme. Epstein died before he went to trial on those charges.\nThough dead nearly six years, Epstein now dominates Trump’s agenda amid a tornado of outrage since the White House and Department of Justice tried to close the book on the case after the president and his closest allies – including the attorney general and the FBI director – spent years claiming Democrats had suppressed evidence of an Epstein “client list” and a wider child abuse conspiracy.\n\"We already know almost everything there is to be known about the Epstein files. The story isn’t Epstein anymore. It’s Donald Trump talking about Epstein,\" says Mike Rothschild, author of \"The Storm is Upon Us: How QAnon Became a Movement, Cult, and Conspiracy Theory of Everything.\"\nTrump’s MAGA movement has rebelled after being promised lurid Epstein revelations by the very officials who now say there are none.\nOn July 22, Speaker Mike Johnson, R-Louisiana, sent the House of Representatives on an early summer recess to prevent passage of a bipartisan measure forcing the DOJ to release its Epstein documents.\n\"The GOP is so intent on not talking about Epstein and not releasing any details, it makes you wonder if there is something they don’t want released,\" Rothschild said. \"It starts driving you toward conspiracy theory.\"\nOn July 22, Trump said the Epstein furor was “sort of a witch hunt,” and railed against the media, former Secretary of State Hillary Clinton and former President Barack Obama.\nOne day later, the Wall Street Journal and CNN reported that Attorney General Pam Bondi told Trump in May that he was named multiple times in the government's files on Epstein.\nBut long before Epstein’s conviction and questions about who might want his secrets buried, he and Trump were charter members of a decadent New York party scene.\nWhen Donald met Jeffrey\nEpstein and Trump met, it’s believed, in 1990 when Epstein bought a mansion 2 miles from Trump's Mar-a-Lago club and estate.\nBorn seven years and a borough apart in New York, Epstein was from Brooklyn and Trump from Queens. They partied hard, but neither drank alcohol.\nTrump was living loud in 1990. He had divorced his first wife, Ivana, with whom he had three children, and was dating model Marla Maples. Epstein was rich and single, a former high school teacher running his own financial advisory firm.\nTrump was known for hosting parties at the Plaza Hotel, which he owned at the time, that attracted rich men and younger women.\n“If they were checking IDs, it was to make sure the girls were young enough,” Gross, who’s known Trump for more than 40 years, said jokingly.\nIt wasn’t enough to simply invite models to events: Trump started his own agency and Epstein invested in one.\nTrump launched Trump Models in 1999. It represented Melania Knauss, who would later become his wife, and signed on teen models such as Alexia Palmer.\nEpstein would later invest in Jean-Luc Brunel’s MC2 modeling agency. Brunel had been banned from his former agency in Europe after accusations of abuse.\nTrump and Epstein were “representative of a type that has nibbled at the edges of the modeling business. If you’re in the market for women as sex toys, a higher echelon of that is models. They are, by definition, beautiful women. They also are beautiful young women,” Gross says. “You can go from there.”\nBrunel was suspected of transporting girls or young women for Epstein. In 2022, less than three years after Epstein's death, he died by suicide in a French jail.\n'Rhythm is a Dancer'\nIn July 2019, after Epstein's arrest on federal sex trafficking charges, Trump said in the Oval Office that he was “not a fan” of the financier. But it wasn't always that way.\nIn 1992, Epstein joined Trump for a party at Mar-a-Lago, where a video shows Trump chatting and laughing next to Epstein. Trump sways to the Eurodance hit “Rhythm is a Dancer,” as the pair hang with cheerleaders for the Buffalo Bills and Miami Dolphins.\nLater that year, Trump and Epstein would again meet at Mar-a-Lago, at an invite-only event for a “calendar girl” competition organized by George Houraney, according to The New York Times. The Florida businessman had created the event at Trump’s request.\n\"At the very first party,” Houraney told the Times, “I said, ‘Who’s coming tonight? I have 28 girls coming.’ It was him and Epstein.”\nEpstein moved into one of the largest private homes in Manhattan in 1995, a townhouse previously owned by billionaire Victoria’s Secret owner Les Wexner. Trump was 1 mile away in a penthouse at Trump Tower.\n“Terrific guy,” he famously told New York magazine in 2002 for a story that called Epstein an \"international money man of mystery.\"\n“He’s a lot of fun to be with,\" Trump said. \"It is even said that he likes beautiful women as much as I do, and many of them are on the younger side.\"\n'I sort of get away with things'\nWhen his modeling agency never quite took off, Trump turned to beauty pageants. In October 1996, he bought Miss Universe, Miss USA, and Miss Teen USA.\nIn a 2005 interview with Howard Stern, Trump bragged about his access to contestants, some of whom were as young as 14.\n“I’ll go backstage before a show and everyone’s getting dressed and ready and everything else and no men are anywhere …. I’m allowed to go in because I’m the owner of the pageant and therefore I’m inspecting it,” Trump told Stern.\n“The girls are standing there with no clothes on, and so I sort of get away with things like that,” he said.\nTasha Dixon was competing in the Miss USA pageant in 2001 in Gary, Indiana, when she, a former Miss Arizona, met Trump. He walked in, she told CNN, as contestants changed into their bikinis.\nThe theme that year was empowering women.\n\"Who do you complain to? He owns the pageant,” she said.\nAs Trump approached his third marriage − and alleged affairs, which he denies, with an adult film star and a former Playboy playmate − court testimony shows his friend Epstein was abusing teenagers.\nSometime in the summer of 2000, a 16-year-old Mar-a-Lago locker room assistant was recruited into Epstein's circle by Epstein's procuror and former girlfriend Ghislaine Maxwell. She would later accuse Epstein and Maxwell of years of sexual abuse. Virginia Giuffre died by suicide last April at the age of 41.\nA lenient 2008 plea deal Epstein received from state and federal prosecutors in Florida included restitution to 36 victims. A 2019 federal indictment cited \"dozens\" of victims.\nThe breakup\nIn 2003, The Wall Street Journal reported, Epstein received a leather-bound volume of tributes from friends for his 50th birthday. A lewd message in the book was attributed to Trump, the paper reported. It ended: “Happy Birthday − and may every day be another wonderful secret.” (Trump denied writing the letter and has sued The Wall Street Journal over the report.)\nA year after Epstein turned 50, Trump, in his book \"Trump ‒ How to Get Rich,\" described a call from a person he called \"the mysterious Jeffrey.\"\n\"As mysterious as Jeffrey is, he’s one of the few people I know who can get by on just a first name,\" Trump wrote. \"My staff never asks for a last name in his case, which in a way puts him up there with Elvis.\"\nBut that year, Epstein and Trump fell out over an oceanfront mansion in Palm Beach called Maison de l’Amitie − the House of Friendship. Trump outbid Epstein for the estate, paying $41 million, and in 2008 flipped it for $95 million to a Russian billionaire.\nOther reports say they broke after Ghislaine Maxwell solicited the daughter of a Mar-a-Lago member and her father complained to Trump.\n“The fact is that the president kicked him out of his club for being a creep,\" said White House Communications Director Steven Cheung.\nMaxwell is now serving a 20-year prison sentence for trafficking a minor to Epstein for sexual abuse. After her 2020 arrest, when asked if Maxwell might cut a deal with prosecutors, Trump said: \"I just wish her well.\" On July 24, Deputy Attorney General Todd Blanche, who previously served as a criminal defense lawyer for Trump, flew to Florida for two days of talks at a women's prison.\n'Boring stuff'\nTrump and Epstein appear to have not spoken for 15 years before his death.\nAs Epstein continues to dog his presidency, Trump says he’s bewildered by the attention.\n“I don’t understand why the Jeffrey Epstein case would be of interest to anybody,\" he told reporters. \"It’s pretty boring stuff.”\nLaura Trujillo is a national columnist focusing on health and wellness. She is the author of \"Stepping Back from the Ledge: A Daughter's Search for Truth and Renewal,\" and can be reached at ltrujillo@usatoday.com."
    },
    {
      "url": "https://www.usatoday.com/news/politics/donald-trump/",
      "text": "Cannabis can heal folks like me, an ex-NFL player – if the law changes\nVoices\nNew poll shows more Americans 'strongly disapprove' of Trump's second term\nPolitics\nTrump sends warm letter to Zelenskyy as he presses for Putin meeting\nPolitics\n'A terrible position': States are bracing for rural hospital closures\nPolitics\nVance has been tasked with persuading you to like Trump's budget bill\nColumnists\nBill Maher is a fan of Newsom's Trump mockery\nTV\nTrump admin. wants to send Kilmar Abrego Garcia to Uganda: Filings\nNation\nSite of World War II internment camp used to detain immigrants\nNation\nHow many Americans identify as transgender?\nGraphics\nCan Trump and the GOP beat the midterm odds - and history - in 2026?\nPolitics\nHe won over Charlamagne tha God. Now Gavin Newsom is coming for Trump\nPolitics"
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/08/24/chris-christie-ghislaine-maxwell-donald-trump/85808132007/",
      "text": "'Give me a break': Chris Christie slams Ghislaine Maxwell's Trump praise as phony\nFormer New Jersey Gov. Chris Christie slammed comments from Jeffrey Epstein accomplice Ghislaine Maxwell in which she said President Donald Trump was not guilty of any wrongdoing and praised him as \"cordial\" and \"kind.\"\n\"She might as well have taken out Donald Trump, or President Trump, and said, 'The man who can pardon me has never done anything wrong. The man who can pardon me has always been wonderful,\" Christie, a rare vocal critic of Trump in the Republican party, told ABC's \"This Week\" on Aug. 24.\n\"I don't think Donald Trump had anything to do with Jeffrey Epstein that was untoward or illegal, but we're going to believe Ghislaine Maxwell?\" Christie asked. \"Give me a break.\"\nMaxwell praises Trump as a 'gentleman'\nMaxwell told Attorney General Todd Blanche during hours of interviews last month that Trump \"was never inappropriate with anybody,\" and was \"a gentleman in all respects.\"\n\"Trump was always very cordial and very kind to me. And I just want to say that I find, I admire his extraordinary achievement in becoming the president now,\" Maxwell said, according to transcripts of the conversations released publicly by the Justice Department on Aug. 22.\nMaxwell is serving out a 20-year sentence after she was convicted of procuring young girls to be sexually abused by Epstein, the disgraced financier whose past tight relationship with Trump has stirred a firestorm in recent months.\nMaxwell has appealed her conviction and signaled in the interviews that she hopes for a pardon from Trump, who has not ruled it out, saying he is \"allowed\" to pardon her.\nA pardon for Maxwell would further fan the flames of raging speculation over the nature of Trump's connection to Epstein and whether his administration withheld the Epstein files because they contain Trump's name or implicate him. Maxwell was also quietly moved to a lower-security prison soon after her interviews with Blanche.\nThe Wall Street Journal reported that Attorney General Pam Bondi told Trump his name was in the files and that Trump sent Epstein a bizarre birthday card with a doodle of a nude woman, further fueling suspicion.\nTrump has slammed them as a \"hoax\" and said they were \"run\" by his commonly invoked enemies, like former President Joe Biden and FBI Director James Comey.\nThe House Oversight Committee subpoenaed the Epstein files and received the first trove on Aug. 22, but Democrats on the committee have said that the vast majority of documents they received were already public."
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/08/22/fbi-searches-home-john-bolton/85774763007/",
      "text": "FBI searches home of Trump critic and former national security adviser John Bolton\nWASHINGTON − FBI agents searched former national security adviser John Bolton’s house in suburban Maryland, in what the agency called a “court authorized activity\" and critics of the administration called \"vindictive\" and \"unnecessary.\"\nBolton, who served in President Donald Trump’s first term, was previously investigated for allegedly including classified information in his 2020 book about the administration. But the Justice Department dropped that inquiry without charges.\nBolton has become a vocal critic of the administration’s foreign policy and called the president unfit to serve. Trump, who revoked Bolton's security detail and his security clearance after returning to the White House this year, called Bolton a “lowlife” on Aug. 22 but said he didn’t know more about the search than what he saw on television.\nVice President JD Vance said “classified documents are certainly part of” the search of Bolton’s house and not political retaliation, in an interview with “Meet the Press with Kristen Welker\" that will air Aug. 24. Here's what you need to know about the search:\nBolton in 2020: Trump efforts to block his book all about politics, not classified information\nJohn Bolton said in a 2020 USA TODAY interview that then-President Donald Trump didn’t want Bolton’s tell-all memoir coming out before the November presidential election and that Trump’s effort to block its publication “has nothing to do with classified information.”\nBolton made the comments in a June 18, 2020, interview with USA TODAY’s Susan Page, referring to Trump's accusations he had included classified information in his book, \"The Room Where It Happened: A White House Memoir.”\nTrump’s Justice Department at the time started a criminal investigation and filed a federal lawsuit to block publication of Bolton's $2 million book, alleging that it contained “significant amounts of classified information,” including some classified as “TOP SECRET.” The inquiry was dropped without charges.\n\"In my view, it was never my intention to disclose classified information. I had plenty to write about without doing that,” Bolton told Page at the time. As a result, he said, “I didn't really feel I had to submit the book for pre-publication review for that reason, but I did out of abundance of caution.”\nBolton said he and his lawyer went through an arduous four-month classification review process and the government itself in its complaint agreed that there was no more classified information in the manuscript.\nBut then the Trump administration went back to do a second review, Bolton said, to “try and stretch out whatever they can.”\n“I think the main thing that the president wants to avoid is the book coming out before the election. This has nothing to do with classified information,” Bolton told Page. “It's the revelation about the president himself that bothers him. He's not worried about foreign governments reading this book. He's worried about the American people reading this book.\"\n--Josh Meyer and Susan Page\nVance says classified documents are part of Bolton inquiry\nVice President JD Vance said “classified documents are certainly part of” the search of Bolton’s house but federal authorities have broad concerns about the former national security adviser, in an interview with “Meet the Press with Kristen Welker.”\nVance said the investigation is “in the very early stages” and that if no evidence of crimes is found Bolton wouldn’t be charged.\n“Classified documents are certainly part of it, but I think that there's a broad concern about, about Ambassador Bolton,” Vance told NBC.\nVance denied Bolton was targeted because he is a critic of the administration.\n“We are investigating Ambassador Bolton, but if they ultimately bring a case, it will be because they determine that he has broken the law,” Vance told NBC. “We're going to be deliberate about that, because we don't think that we should throw people even if they disagree with us politically, maybe especially if they disagree with us politically, you shouldn't throw people willy-nilly in prison.”\n--Bart Jansen\nFBI confirms activity at Bolton house but doesn't identify target of investigation\nThe FBI confirmed the activity around Bolton’s home but didn’t identify the target of the investigation before declining further comment.\n“The FBI is conducting court authorized activity in the area,” the agency said in a statement. “There is no threat to public safety.”\nJohn Bolton recently described Trump’s second term as ‘a retribution presidency’\nFormer Trump national security advisor John Bolton said Aug. 10 that he was worried about President Donald Trump’s vow to get revenge against him and other outspoken critics, describing Trump’s second term as “a retribution presidency.”\nTrump was asked by ABC News’ Jonathan Karl ABC News “This Week with George Stephanopoulos” about what Karl described as “Trump's retribution campaign we're seeing at the FBI and the Justice Department.”\n“You're obviously on his enemies list. At least Kash Patel's enemies list,” Karl said in reference to Trump’s FBI director. “Are you worried that they're going to come after you in some way? I mean, he's hinted at it before.”\n“Well, I think he's already come after me and several others in withdrawing the protection that we had for … the Iranians for the attack on Qasem Suleimani,” Bolton said. “So I think, and I said in the new forward to the paperback edition of my book, I think it is a retribution presidency.”\n--Josh Meyer\nFBI search ‘an obvious act of intimidation,’ says former Obama White House ethics czar\nFormer White House ethics czar Norm Eisen called the FBI action “an obvious act of intimidation,” and another example of the double standards President Donald Trump is applying “as he puts himself and his cronies above the law, and weaponizes it against his perceived enemies.”\nEisen, executive chair of Democracy Defenders Fund and a former Obama administration ethics lawyer, said in a statement that the FBI action in “raiding the home of a high- profile critic in this way is an attack on the fundamental American right to disagree with the government.”\n“If this President, who tramples on the Constitution and laws every day, is willing to abuse his power to go after his own former National Security Adviser, he can do it to anyone,” Eisen said in the statement co-written with Susan Corke, executive director of Democracy Defenders Fund.\n“As prominent Republicans pointed out this morning, when the FBI searched Mar-a-Lago under the Biden Administration, it negotiated with President Trump’s team for a year beforehand,” Eisen and Corke wrote. “And his possession of those documents was defended by none other than his current FBI Director Kash Patel.”\n--Josh Meyer\nFBI search may be “a lawful search, but still completely unwarranted,’ former DOJ official says\nFormer senior Justice Department prosecutor Andrew Weissmann said the FBI action at John Bolton’s residence may be “a lawful search” but expressed concern that President Donald Trump is trying to equate it to the court-ordered search of his Mar-a-Lago residence in August 2022.\nThe Mar-a-Lago search warrant to find classified documents Trump took with him when leaving office in January 2021 “was necessary after repeated attempts verbally and through a subpoena to obtain the thousands of government documents being kept there,” said Weissmann, a lead prosecutor in Robert Mueller's special counsel investigation into Russian interference in the 2016 election.\n“Only when that failed, was a search warrant required to be obtained and executed. So key issues will be what notice was given to Bolton, if any (my surmise is none at all), and the volume of alleged documents (if any),” Weissmann wrote on Substack.\n“This may be, at the end of the day, a lawful search, but still completely unwarranted and inappropriate government activity,” Weissmann, a frequent critic of Trump, wrote. “Right now, we do not know enough facts, but I would worry about those who make it seem like this is just doing what the DOJ did with respect to the Trump compound in FLA.”\n--Josh Meyer\nTrump calls Bolton ‘lowlife’ but knows little about FBI search\nTrump told reporters Aug. 22 that he knew little about the FBI searching Bolton’s home but that he is a “lowlife.” He said the Justice Department would probably brief him on the search.\n\"I'm not a fan of John Bolton,\" Trump told reporters at The People’s House museum near the White House. \"He's a real, sort of a lowlife.\"\nJournalist livestreaming FBI Bolton raid, calls it ‘theatrical.’ ‘Doing it this way allows lots of pictures.’\nJournalists and neighbors are lined up outside John Bolton's home in Bethesda to watch – and livestream -- the FBI search of the Trump critic's home. One of them is Benjamin Wittes, the editor in chief of Lawfare, which has been critical of the Trump administration Justice Department.\nWittes was using his cameraphone and Substack journalism platform to livestream the action, available here.\nWittes “has been chronicling Trump's acts of retribution on a near-daily basis,” according to CNN, which reported on Wittes’ livestream, calling the FBI action \"theatrical\" and noting that \"doing it this way allows lots of pictures.\"\n--Josh Meyer\nAttorney General Pam Bondi: 'Justice will be pursued'\nThe Justice Department didn't immediately respond to USA TODAY's request for comment on the investigation into Bolton. However, the department's head, Attorney General Pam Bondi, re-posted FBI Director Kash Patel's morning statement on X that \"NO ONE is above the law.\" Above that post, Bondi included a message of her own.\n\"America’s safety isn’t negotiable. Justice will be pursued. Always,\" Bondi said above Patel's message. She didn't clarify what she was referring to.\n– Aysha Bagchi\nBolton lawyer has claimed in the past his 2020 memoir contained no classified information despite White House claims\nCharles Cooper, a lawyer who has represented Bolton in the past, was unavailable for comment on Aug. 22, a Cooper aide said.\nBut in 2020, when in news broke of Bolton’s forthcoming book, “The Room Where It Happened: A White House Memoir,” Cooper defended it against Trump White House accusations that it contained top-secret information.\n\"We do not believe that any of that information could reasonably be considered classified,” Cooper wrote in a letter to the White House, Axios reported at the time.\nThe White House had made public a Jan. 23, 2020, letter addressed to Cooper that claimed Bolton's manuscript contains \"significant amounts of classified information\" that could \"cause exceptionally grave harm\" to U.S. national security, Axios said.\n--Josh Meyer\nBolton faces ‘serious legal risk’ over book, but timing of search appears ‘vindictive’: expert\nMark Zaid, a national security lawyer who represents whistleblowers against the government, said in a social media post Aug. 22 that “there is serious legal risk for Bolton” from the dispute over his book.“But timing of this raid is highly – and I mean highly – suspicious,” Zaid said. “Looks like retaliatory, vindictive behavior.”--Bart Jansen\nTrump administration has accused Bolton of using classified info in book\nThe Justice Department during Trump's first term filed a federal lawsuit and started a criminal investigation into Bolton over allegations that the book, \"The Room Where It Happened: A White House Memoir,\" contained classified information.\n\"The United States seeks an order requiring Defendant to abide by his contractual and fiduciary duties to complete the pre-publication review process and not disclose classified information without written authorization, thereby protecting the national security of the United States,\" according to the filing.\nBolton’s attorney, Chuck Cooper, called the lawsuit “a transparent attempt to use national security as a pretext to censor” Bolton.\nA judge rejected the lawsuit’s request to block the book and the Justice Department dropped both the lawsuit and the criminal inquiry during the Biden administration.\nThe lawsuit filed in June 2020 alleged that Ellen Knight, the senior director for records access at the National Security Council, found “significant amounts of classified information” including some classified as “TOP SECRET,” in the $2 million book while reviewing it for publication.\nBut the lawsuit alleged that Bolton was frustrated with the pace of the review and chose to publish before waiting for it to be completed, despite having signed classified nondisclosure agreements.\nBolton had been targeted in Iranian assassination plot\nTrump canceled Bolton’s security detail despite the discovery of an Iranian plot to kill him. A member of Iran's Islamic Revolutionary Guard Corps, Shahram Poursafi, was charged in 2022 in a murder-for-hire plot targeting Bolton.The plot was in retaliation for a U.S. drone strike that killed Iran commander Qasem Soleimani in 2020 in Baghdad, according to Justice Department officials.\nFBI Director Kash Patel: 'NO ONE is above the law'\n“NO ONE is above the law,” Patel said in a social media post Aug. 22 after the search began. “@FBI agents on mission.”\nBolton didn’t mention the search in a social media post Aug. 22 but said he didn’t see “any progress” in Trump leading peace talks between Russia and Ukraine.\n“Meanwhile, meetings will continue because Trump wants a Nobel Peace Prize, but I don't see these talks making any progress,” Bolton said.\nBolton, a Trump critic, had said Putin 'clearly won' summit with Trump\nEarlier, Bolton had told CNN after Trump met with Russia’s President Vladimir Putin on Aug. 15 that Putin \"clearly won\" the summit in Alaska.\n“It’s far from over, but I’d say Putin achieved most of what he wanted,” Bolton said. “Trump achieved very little.”\nFormer FBI deputy director calls search 'really stunning' on CNN\nAndrew McCabe, a former deputy director FBI, told CNN on Aug. 22 the search was \"really stunning.\" McCabe said there were reasons to look at the search \"with a jaundiced eye\" because of what might have motivated the search warrant.\n“I don’t think many people saw this one coming,\" McCabe said. “There is this very fraught relationship between the two, and the President's history of going after people, using the level, the levers of power that he has access to, particularly the Department of Justice, to go after people he doesn't like.\""
    },
    {
      "url": "https://www.usatoday.com/story/news/2025/03/27/where-what-mar-a-lago-donald-trump-home-florida/82686108007/",
      "text": "Can the public stay at Mar-a-Lago? What to know about President Trump's Florida home, club\n- Mar-a-Lago, owned by President Donald Trump, is his private home and club in Palm Beach, Florida.\n- Mar-a-Lago has been the site of several security breaches, including trespassing incidents and attempts to gain unauthorized access.\n- The property, spanning 17 acres, features amenities such as a spa, tennis courts, a ballroom, and a beach club.\nMar-a-Lago, the posh Florida resort synonymous with Donald Trump, is likely one of the most famous clubs in the world.\nA site for special events, glamorous weddings, Super Bowls and holiday parties, Mar-a-Lago has also gained a reputation as the site for significant political events, thanks to its famous, presidential owner.\nIt's also the backdrop of most of the president's weekend events. President Trump has spent all but two weekends since his re-election at his Florida home. Many of those weekends, the president had friends and colleagues in-tow, like special government employee and Tesla and SpaceX billionaire Elon Musk; and also first lady Melania Trump's father, Viktor Knavs.\nBy the end of March and only weeks into his second term, Trump had already spent seven weekends at Mar-a-Lago. Now that Donald Trump is president again, there’s intense interest in the Trump family — from Melania Trump to their only child Barron Trump — and in their iconic home.\nDuring his first presidential term, Donald Trump dubbed Mar-a-Lago the \"Southern White House\" or \"Winter White House,\" due to the amount of time he spent there.\nHere’s what to know about the history of Mar-a-Lago, where it is and if the public can access the private club.\nWho first built Mar-a-Lago? Who owned Mar-a-Lago originally?\nPost Cereal heiress Marjorie Merriweather Post was Mrs. Edward F. Hutton when she commissioned Marion Sims Wyeth to build her a 58-bedroom Spanish-Moorish-Portuguese-Venetian palace on 17 acres of jungle between the ocean and the Intracoastal.\nBy the time it was finished in 1927, Joseph Urban, a Viennese architect and theater designer, had provided much of the ornamentation.\nSix hundred workers labored for more than three years to build Mar-a-Lago, using boatloads of Italian stone and about 36,000 antique Spanish and Portuguese tiles, as well as old marble floors and roof tiles from Cuba. The estate’s 75-foot tower is a South Florida landmark — and a navigational aid to boaters.\nWhen she died in 1973, Post gave Mar-a-Lago to the U.S. government for a presidential retreat, but the government balked at its million-dollar-a-year maintenance cost and its location under the Palm Beach International Airport’s flight path.\nIs Mar-a-Lago private or public? When does Mar-a-Lago open for the season?\nMar-a-Lago is a private club, and is generally not open to the public. The main entrance to the private club is on South Ocean Boulevard. To see Mar-a-Lago, you have to do a drive-by. People can park and walk by, though you'll be in the roadway.\nIt's not uncommon for people to pull over their cars to catch a view. It is, however, very dangerous because there is no sidewalk, and there's no shoulder on the side of the road.\nMar-a-Lago closes on Mother's Day after the traditional final brunch of the social season and reopens on Halloween.\nHow big is Mar-a-Lago?\nMar-a-Lago is 17 acres. It sounds like a lot for an estate, but there's a lot going on there.\nIn 1985, Donald Trump paid $10 million for the 17-acre estate. It originally boasted 33 bathrooms, three bomb shelters and a nine-hole golf course.\nTen years later, Trump updated the already-luxurious estate and converted it into an even-more ritzy private club with a spa, tennis and croquet courts, ballroom and a beach club.\nThe size of the living quarters at Mar-a-Lago are speculated to be somewhere between 2,000 and 3,000 square feet. The private club has around 500 members. The ballroom was completed in 2005.\nDoes Mar-a-Lago have a golf course?\nTrump’s Mar-a-Lago Resort and Club does not have a golf course on its campus, but Trump International Golf Club in West Palm Beach is less than 10 minutes away.\n“Five minutes from The Mar-a-Lago Club sits the spectacular Trump International Golf Club, West Palm Beach. The American Academy of Hospitality Sciences awarded Trump International with the prestigious Five-Star Diamond Award, rating it the best golf course in Florida,” the Mar-a-Lago website says.\n“This incredible golf course, designed by world-renowned architect, Jim Fazio, boasts 27 of the most magnificent golf holes anywhere and a clubhouse that has no rival in the state of Florida.”\nIt’s important to note that Mar-a-Lago is a private club, not a resort hotel that’s open to the public. A hefty membership fee is required to join, and Mar-a-Lago is like a country club for the uber-wealthy.\nWhat does 'Mar-a-Lago' mean?\nMar-a-Lago, which means “Sea to Lake” in Spanish, sits between the Atlantic Ocean and the Intracoastal Waterway.\nHow much money is Mar-a-Lago worth?\nIn 2018, Forbes estimated the value of the Mar-a-Lago estate at about $160 million.\nIn February 2024, Trump claimed that his Florida home was severely undervalued and claimed its value sits at $1 billion.\n\"A New York judge ruled that Donald Trump offered a 'fraudulent' valuation of his famed Palm Beach club and residence for the balance of a decade,\" The Palm Beach Post reported in 2024.\n\"Trump has said that his valuations were 'conservative.' During the legal battles, he said the Mar-a-Lago property was worth as much as $1 billion.\"\nWhere is Mar-a-Lago located in Florida?\nThe luxury estate, which spans 17 acres of prime waterfront real estate, is located in Palm Beach, Florida.\nDuring Trump's first presidency and now during his second, his motorcade takes Southern Boulevard for his trips between the Palm Beach International Airport and Mar-a-Lago.\nThat also means that Southern Boulevard in Palm Beach County is often lined with some Trump supporters, protestors and anyone else who wants to catch a glimpse of the presidential motorcade that will escort Trump to and from his Florida home on the weekends he visits his Florida home.\nWhat are some interesting Mar-a-Lago facts?\nThese quick hits were from the Palm Beach Post archives. Subscribe to the Palm Beach Post to read more fascinating stories about Mar-a-Lago, Trump and other Palm Beach coverage.\n- In 1928, a deadly hurricane came ashore that year near West Palm Beach. Mar-a-Lago was left relatively unscathed.\n- The owner’s bedroom is still decorated as it was then in a Louis XV style.\n- Several rooms have themes and names such as the Adam and American room.\n- The fireplace in the nursery has a Sleeping Beauty theme.\nSecurity at Mar-a-Lago\nThere were a number of security breaches during Trump's first presidency, with some occurring when he wasn't in town.\n- In January 2020, an opera singer made it through the security checkpoints. There was a high-speed chase through all of the barricades all the way down past Mar-a-Lago. Her car was shot at multiple times. She survived, but her car was destroyed. The woman, who has a history of mental illness, entered an insanity defense.\n- Two Chinese women tried to enter Mar-a-Lago. One woman was carrying four cell phones and a USB infected with malware.\n- A University of Wisconsin student was intercepted when he was in the tunnel, which connects the club to the beach.\n- Other people have hidden in the bushes — and been caught.\nTrump's second presidency has also seen a few attempts. In December 2024, shortly after he was re-elected, two people, a woman and a teenage boy, were arrested in separate trespassing incidents at the president-elect's private club.\nIn February, authorities arrested a man who jumped over a wall and onto the lawn of Mar-a-Lago one day before the president was scheduled to return to the Palm Beach estate.\nContributing: Hannah Phillips, Christine Stapleton, Antonio Fins, Palm Beach Post"
    }
  ],
  "argos_summary": "President Trump threatened to investigate former New Jersey governor Chris Christie over the 2013 Bridgegate scandal after Christie criticized Trump on ABC, while Trump also criticized the FBI’s search of former national security adviser John Bolton’s home. The Supreme Court’s 9‑0 ruling overturned federal fraud convictions tied to Bridgegate, a move Christie praised. Meanwhile, Ghislaine Maxwell’s recent interview praised Trump, prompting Christie to dismiss her comments. These events highlight ongoing tensions between Trump and former allies, as well as legal scrutiny of political figures.",
  "argos_id": "THH0WQFIL"
}