{
  "url": "https://www.reuters.com/sports/athletics-lhp-jacob-lopez-dealing-with-left-forearm-tightness-2025-08-25/",
  "authorsByline": "Reuters",
  "articleId": "d3ea3ffb0eaa4eae9caef01eb3930b55",
  "source": {
    "domain": "reuters.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.reuters.com/resizer/v2/75QCJUOGONJKHPHA3WPIEJSSJY.jpg?auth=38a9e0973df5ca7557a1799d87489cee5418862f2b787c74801fa11ec31daae6&height=1005&width=1920&quality=80&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T04:27:51.564000+00:00",
  "addDate": "2025-08-25T04:31:57.071263+00:00",
  "refreshDate": "2025-08-25T04:31:57.071266+00:00",
  "score": 1.0,
  "title": "Athletics: LHP Jacob Lopez dealing with left forearm tightness",
  "description": "Athletics rookie pitching standout Jacob Lopez was diagnosed with left forearm tightness after his uncharacteristic rough outing on Sunday, manager Mark Kotsay said following the 11-4 loss to the host Seattle Mariners.",
  "content": "August 25 - Athletics rookie pitching standout Jacob Lopez was diagnosed with left forearm tightness after his uncharacteristic rough outing on Sunday, manager Mark Kotsay said following the 11-4 loss to the host Seattle Mariners.\n\nLopez fell to 7-7 with a 4.08 ERA after allowing nine runs on six hits -- including a pair of historic two-run homers by Mariners catcher Cal Raleigh -- and a career-high six walks with two strikeouts in two-plus innings.\n\nThe left-hander was 4-0 with a 0.70 ERA in four previous starts this month. Lopez did not allow a run in four starts from July 26 to Aug. 12 before yielding three runs (two earned) on four hits and one walk while fanning eight in a 6-3 win at Minnesota on Tuesday.\n\n\"I felt it a little bit after the start in Minnesota,\" Lopez said of the forearm discomfort, per mlb.com. \"I did some more things in between starts and thought I was good.\"\n\nThe walks, and Raleigh setting the major league record for most home runs in a season by a primary catcher with his 48th and then 49ths blasts, were all Kotsay needed to see. The pitcher was pulled after facing four batters (two walks, two singles) in the third inning.\n\n\"The lack of command showed back up,\" Kotsay said, per mlb.com. \"When we took Jacob out, he didn't really feel great ... It might have led to the outing. But sometimes you're on a roll and you have a bad one.\"\n\nLopez, 27, didn't blame his ailing arm, only \"poor pitches.\"\n\n\"Just one of those days where I was the worst player on the field,\" said Lopez, who has 113 strikeouts and 37 walks in 92 2/3 innings over 21 games (17 starts).\n\nThe Athletics acquired Lopez and left-hander Jeffrey Springs from the Tampa Bay Rays last December for two minor leaguers and a draft pick. Lopez missed the 2022 season after having Tommy John surgery in 2021 while a Rays prospect.\n\n\"I have no idea right now,\" Lopez said of the extent of his arm injury. \"I've already had a TJ. This feels different. It feels more in my flexor, so, we'll see how it goes.\"\n\n--Field Level Media",
  "medium": "Article",
  "links": [
    "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
    "https://www.reutersagency.com/en/licensereuterscontent/?utm_medium=rcom-article-media&utm_campaign=rcom-rcp-lead"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Jacob Lopez",
      "weight": 0.10781476
    },
    {
      "name": "LHP Jacob Lopez",
      "weight": 0.10326231
    },
    {
      "name": "Athletics rookie pitching standout Jacob Lopez",
      "weight": 0.097988546
    },
    {
      "name": "Lopez",
      "weight": 0.09734467
    },
    {
      "name": "left forearm tightness",
      "weight": 0.08737802
    },
    {
      "name": "most home runs",
      "weight": 0.08304702
    },
    {
      "name": "Mariners catcher Cal Raleigh",
      "weight": 0.07775663
    },
    {
      "name": "starts",
      "weight": 0.07746461
    },
    {
      "name": "manager Mark Kotsay",
      "weight": 0.0755769
    },
    {
      "name": "Mark Kotsay",
      "weight": 0.072267495
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98388671875
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.9384765625
    }
  ],
  "sentiment": {
    "positive": 0.048683487,
    "negative": 0.7511971,
    "neutral": 0.2001194
  },
  "summary": "Rookie Athletics rookie pitcher Jacob Lopez has been diagnosed with left forearm tightness following a rough performance in an 11-4 loss to the Seattle Mariners. Lopez, who was pulled from the team after allowing nine runs on six hits and a career-high six walks, had a 4.08 ERA following a nine-run performance, including two historic two-run homers by Mariners catcher Cal Raleigh. Despite the struggles, Lopez did not blame his arm for the performance, blaming \"poor pitches.\" Lopez's overall record-breaking 113 strikeouts and 37 walks in 92 2/3 innings over 21 games (17 starts). The Athletics acquired Lopez and Jeffrey Springs from the Tampa Bay Rays last December for two minor leaguers and a draft pick.",
  "shortSummary": "Athletics rookie Jacob Lopez experienced forearm tightness after a rough outing, leading to nine runs and six walks, in a 9-4 loss to the Mariners.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "13fb57ae2ab6469aaf64e6f65acd7ca1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
      "text": "The Trust Principles\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity, and freedom from bias in the gathering and dissemination of information and news.\nTrust Principles – the history\nThe Trust Principles were created in 1941, in the midst of World War II, in agreement with The Newspaper Proprietors Association Limited and The Press Association Limited (being the Reuters shareholders at that time). The Trust Principles imposed obligations on Reuters and its employees to act at all times with integrity, independence, and freedom from bias.\nReuters Directors and shareholders were determined to protect and preserve the Trust Principles when Reuters became a publicly traded company on the London Stock Exchange and Nasdaq. A unique structure was put in place to achieve this. A new company was formed and given the name 'Reuters Founders Share Company Limited', its purpose being to hold a 'Founders Share' in Reuters.\nThe legal structure has evolved over time and the Founders Share and other contractual arrangements now confer a number of special rights upon the Thomson Reuters Founders Share Company. For example, (i) the Thomson Reuters Founders Share Company has enhanced voting rights in circumstances where someone is seeking to obtain a significant shareholding in, or acquire control of, Thomson Reuters and (ii) the prior consent of the Thomson Reuters Founders Share Company must be sought prior to undertaking any sale of, or other material transaction involving, the Reuters news business unit.\nThomson Reuters itself is obliged and committed to apply the Trust Principles to its operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the Thomson Reuters business and require Thomson Reuters Directors, in the performance of their duties, to have due regard to the Trust Principles, by the proper exercise of their powers and in accordance with their other duties as Directors.\nThe Trust Principles are:\n- That Reuters shall at no time pass into the hands of any one interest, group, or faction;\n- That the integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved;\n- That Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers and to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts;\n- That Thomson Reuters shall pay due regard to the many interests which it serves in addition to those of the media; and\n- That no effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business\nThomson Reuters Founders Share Company was established in 1984 when Reuters became a public company. The directors of Thomson Reuters Founders Share Company (known as ‘Trustees’) have a duty to ensure, to the extent possible, that the Trust Principles are complied with.\nThe Trustees are experienced and eminent people from diverse arenas in politics, diplomacy, media, public service and business. The Trustees are selected by a nomination committee and proposed to the board of the Thomson Reuters Founders Share Company for appointment. The nomination committee assists in scrutinizing candidates’ suitability and its members include two persons appointed by the chairman after consultation with the European Court of Human Rights and representatives of certain press associations. The Thomson Reuters Corporation board has two representatives on the nomination committee. The Chairman and Deputy Chairman of the Thomson Reuters Founders Share Company Board are members of the nomination committee, and the Chairman appoints three other directors of the Thomson Reuters Founders Share Company as members of the nomination committee. The Chairman of the Thomson Reuters Founders Share Company acts as chairman of the nomination committee.\nThe number of Trustees has to be at least 14 and not more than 18. Trustees have a minimum of two meetings per year, and receive reports on our activities in the different fields in which we operate (including Reuters news). The Trustees meet with both the Thomson Reuters Board and representatives of senior management. Through Thomson Reuters Founders Share Company's Chairman, regular contact is maintained with our company. The relationship is one of trust and confidence.\nIndependence of Thomson Reuters\nCustomers across the world depend on us to provide them with reliable and objective news and information.\nThis means that we have a special need to safeguard our independence and integrity and avoid any bias which may stem from control by specific individuals or interests.\nThe Thomson Reuters Trust Principles were adopted in 1941 and include the preservation of integrity, reliability of news, development of the news business, and related principles.\nToday, the Trust Principles are fundamental to our entire business.\nMore information\nContact us\nBrian Moss\nFor inquiries pertaining to Reuters reporting standards and the Trust Principles please email: brian.moss@thomsonreuters.com."
    }
  ],
  "argos_summary": "Athletics rookie Jacob Lopez was diagnosed with left forearm tightness after a rough outing against the Seattle Mariners, where he allowed nine runs and was pulled after four batters. Manager Mark Kotsay cited a lack of command and Lopez’s forearm discomfort as the cause, noting Lopez’s prior strong performance earlier in the month. Lopez, who missed the 2022 season due to Tommy John surgery, said the injury feels different and uncertain about its extent. The article also contains a detailed overview of Thomson Reuters’ Trust Principles, outlining the company’s commitment to integrity and independence.",
  "argos_id": "TIOQKU3JT"
}