{
  "url": "https://www.polygon.com/planet-of-lana-2-preview-gamescom/",
  "authorsByline": "Marloes Valentina Stella",
  "articleId": "4c09477b1b5c4402ae74952302a068ae",
  "source": {
    "domain": "polygon.com",
    "paywall": false,
    "location": {
      "country": "be",
      "county": "Antwerp",
      "city": "Antwerp",
      "coordinates": {
        "lat": 51.2211097,
        "lon": 4.3997081
      }
    }
  },
  "imageUrl": "https://static1.polygonimages.com/wordpress/wp-content/uploads/2025/08/planet-of-lana-2-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T14:30:16+00:00",
  "addDate": "2025-08-24T14:37:07.060267+00:00",
  "refreshDate": "2025-08-24T14:37:07.060268+00:00",
  "score": 1.0,
  "title": "All sequels should strive to level up the way Planet of Lana 2 is",
  "description": "There are creatures stranger than Mui here",
  "content": "Planet of Lana 2: Children of the Leaf took me high up snowy mountains and deep into underwater trenches — but environmental diversity isn't the only reason why the sequel to Wishfully Studios’ 2023 puzzle-platformer promises a lot of range. During a 45-minute hands-on demo at Gamescom, I got a glimpse of a deeper narrative and a set of puzzle mechanics far more complex than the original game.\n\nAt the start of the first game, Lana’s planet is overrun by robotic abductors who swiftly clear her village of all its inhabitants, leaving Lana as the sole escapee. Luckily, Lana soon meets an adorable cat-like friend called Mui, and together they run tirelessly towards the right side of the screen in an attempt to save Lana’s family and friends, crossing serene forests, dark caves, and barren wastelands along the way.\n\nIn Planet of Lana 2, there’s still plenty of trouble ahead as Lana and Mui leave on another dangerous journey — this time, to investigate an ancient mystery. I don’t know the details beyond that, but I did spot a potential supervillain during the demo: a cloaked scientist-type figure who put poor little Mui in a cage. Surely he doesn’t mean to extract and misuse Mui’s powers?\n\nAs I expressed my interest in the history of Lana’s tribe and the reason behind the invasion, creative director Adam Stjärnljus told me that Planet of Lana 2 will have more narrative depth: “You will get to explore much more of the lore and the history of the planets. You’ll learn why everything is the way it is.”\n\n“There are more NPCs, including some friends that you come across along the way, and also new villages,” Stjärnljus explained. “They may join you on your journey.”\n\nAs delighted as I was to hear this, it made me wonder if Planet of Lana 2 is easy enough to understand if you haven’t played the original. “Of course, they are tied together,” Stjärnljus said, “but as the narrative is separate from the first game. It’s not necessary to play Planet of Lana.”\n\nBut enough about the story; what about the gameplay? As the demo consisted of four different segments, I was able to explore a snowy mountain, a colorful underwater realm, an ominous industrial building, and a lush forest. While this is in line with the varied landscapes seen in the first game, which included everything from a swamp to a desert, the industrial and underwater sections in Planet of Lana 2 have a far more distinct feel to them — instead of just looking different, they really play differently.\n\nTo traverse the underwater realm, Lana has to open entryways to deep caverns, swim past deadly fish, and find air bubbles before her oxygen runs out. There’s just one issue: Mui can’t swim. Just like the original game, the player controls Lana and directs Mui, so you must instruct Mui to stay put, run ahead, interact with an item, or use a hypnotizing ability on other black-and-white creatures. Leaving Mui on the shore, I swam down with Lana to find the solution to my problem: a black bubble-like creature (or thing?) to carry Mui like a little submarine on a leash.\n\nI soon ran into another problem when both Mui and Lana couldn’t jump from one pool to another, but to my surprise, I could use Mui to hypnotize and take control of a tiny black-and-white fish. After jumping into the desired pool, I swam down and dropped a big cloud of ink (let’s assume it’s ink, and not something else) in front of a dangerous fish, allowing Lana and Mui to continue the adventure.\n\nPerhaps an even more interesting part of the game was the industrial building, which felt a bit like an escape room. After watching Lana wake up in a prison, I had to push a bunch of colorful buttons in the correct order to free Mui and help him enter the air vents. Mui’s range (how far he can move from Lana, which was rather limited in the original game), has clearly been improved. Lana and Mui then had to proceed downwards, reaching new rooms by moving magnetic cubes from wall to wall, which is but one of several new abilities.\n\n“The puzzles are more complex than those in the first Planet of Lana,” Stjärnljus told me. “The collaboration between Lana and Mui has been expanded upon, which should make it more fun and varied, with new jamming and hacking abilities, and the fact that you can take over creatures.”\n\nI didn’t get to control any animals other than Mui in the industrial section, but once I’d reached the forest, I got hold of a cute blob creature that could float around while carrying water. By watering the nearby bamboo shoots, I caused tall, swishy poles to grow that could help Lana climb upwards and reach higher cliffs.\n\nBecause of the new puzzle mechanics and controllable creatures, I started to suspect the sequel is a far chunkier game than the five-hour-long original. Stjärnljus confirmed this: “The game is around double the length of the first Planet of Lana. The narrative, the gameplay, the puzzles — everything is expanded upon.”\n\nOf all four gameplay segments, the forest was my personal favorite, partly because it looked positively magical. The snow segment impressed me the least, but I’m not saying that because I got blown off a mountain about one minute into the demo — it’s because I didn’t discover gameplay mechanics as unique as the ones in the other three areas. That said, seeing the four sections together, and especially the promise of additional lore and characters, make me very excited for Planet of Lana 2: Children of the Leaf.\n\nPlanet of Lana 2 will release on PlayStation 4, PlayStation 5, Windows PC, Xbox One, Xbox Series X, and Nintendo Switch in 2026.",
  "medium": "Article",
  "links": [
    "https://www.polygon.com/22528345/planet-of-lana-hand-painted-adventure-puzzle-xbox-summer-game-fest/",
    "https://www.polygon.com/impressions/606153/planet-of-lana-impressions/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Lana",
      "weight": 0.0984317
    },
    {
      "name": "Mui",
      "weight": 0.082507975
    },
    {
      "name": "poor little Mui",
      "weight": 0.08036861
    },
    {
      "name": "Planet",
      "weight": 0.05915737
    },
    {
      "name": "Planet of Lana",
      "weight": 0.05742037
    },
    {
      "name": "puzzle mechanics",
      "weight": 0.056281112
    },
    {
      "name": "several new abilities",
      "weight": 0.055816177
    },
    {
      "name": "new rooms",
      "weight": 0.053213626
    },
    {
      "name": "gameplay mechanics",
      "weight": 0.052222777
    },
    {
      "name": "Lana’s planet",
      "weight": 0.051438674
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.986328125
    },
    {
      "name": "/Games/Computer & Video Games/Action & Platform Games",
      "score": 0.75927734375
    },
    {
      "name": "/Games/Computer & Video Games/Adventure Games",
      "score": 0.712890625
    },
    {
      "name": "/Games/Roleplaying Games",
      "score": 0.6806640625
    },
    {
      "name": "/Games/Computer & Video Games/Massively Multiplayer Games",
      "score": 0.404541015625
    },
    {
      "name": "/Games/Computer & Video Games/Shooter Games",
      "score": 0.317138671875
    }
  ],
  "sentiment": {
    "positive": 0.2585967,
    "negative": 0.31379852,
    "neutral": 0.42760473
  },
  "summary": "The sequel to Wishfully Studios' 2023 puzzle-platformer, Planet of Lana 2: Children of the Leaf, has been released by the studio and features a deeper narrative and a more complex set of puzzle mechanics than the original game. The game follows the story of Lana, whose planet is overrun by robotic abductors who clear her village of inhabitants, leaving Lana as the sole escapee. She and her cat-like friend, Mui, navigated a dangerous journey together to investigate an ancient mystery. Creative Director Adam Stjärnljus revealed that Planet of Lana 2 will have more narrative depth and more gameplay options, including more NPCs and new villages. The player controls Lana and Mui while controlling Mui and instructing them to stay put, run ahead, or interact with an item, or use a hypnotizing ability on other black-and-white creatures. The gameplay is described as varied, with the industrial and underwater sections playing differently. The collaboration between the two characters has been expanded with new puzzles and puzzles, which are more complex than those in the first game.",
  "shortSummary": "Planet of Lana 2: Children of the Leaf offers a more diverse and immersive experience, with deeper narrative and more advanced puzzle mechanics than its predecessor.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "898d69146ed6421897b6db5d1fab6bef",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.polygon.com/22528345/planet-of-lana-hand-painted-adventure-puzzle-xbox-summer-game-fest/",
      "text": "Planet of Lana is a beautiful new cinematic puzzle adventure game from the Swedish indie studio, Wishfully. It was announced during Summer Games Fest kick-off event on Thursday.\nThe story follows Lana, and her animal companion as they embark on a mission to save Lana’s sister. Their planet — which used to be a place in perfect harmony between human, nature — has fallen into chaos and now must endure a faceless army.\nWhat’s interesting though, is that this game expressly isn’t about war or conflict. “This is a story about a vibrant, beautiful planet –and the journey to keep it that way,” a description from the developers said.\nThe world in Planet of Lana looks stunning. From what we saw in the trailer, the game boasts stunning hand-painted graphics and a Miyazaki-esque world.\nA release shared that the visual style “combines hand-drawn artwork, complex parallax layering and subtle use of 3D graphics to give the look of an interactive painting.” The game will run on high-end PCs and the Xbox Series X with a native resolution of 4K at 60 frames per second, “allowing its incredible artwork to come to life.”\nIn the trailer, we see a young woman, Lana, embrace a cute and chirpy black creature. The opening scene is tranquil. There’s a large moon in the background, a gentle breeze blowing the tall grass, and you can hear birds in the background.\nHowever, as the camera zooms out we see what looks to be dozens of rockets fast approaching the planet. It’s a grim, but captivating juxtaposition that introduces us to its new world.\nPlanet of Lana is slated to come out in 2022 to PC Windows, Xbox One, and Xbox Series X in late 2022."
    },
    {
      "url": "https://www.polygon.com/impressions/606153/planet-of-lana-impressions/",
      "text": "May 2023 was kind of a big deal. A little ol’ game called The Legend of Zelda: Tears of the Kingdom (ring any bells?) was released, and everyone was playing it; Tears sold almost 20 million copies in under two months. However, it wasn’t the only game that came out that month. While it may not have generated as much buzz at the time, Planet of Lana is one of 2023’s best indies — and it's getting a sequel next year.\nPlanet of Lana is a cinematic puzzle-platformer. You play as Lana as she tries to rescue her best friend and fellow villagers after they were taken by mechanical alien beings. She’s accompanied by a little cat-like creature named Mui (because any game is made better by having a cat in it). Together, they outwit the alien robots in various puzzles on their way to rescuing the villagers.\nThe puzzles aren’t too difficult, but they still provide a welcome challenge; some require precise execution lest the alien robots grab Lana too. Danger lurks everywhere as there are also native predators vying to get a bite out of Lana and her void of a cat companion. Mui is often at the center of solving environmental puzzles, which rely on a dash of stealth, to get around those dangerous creatures.\nPlanet of Lana’s art style is immediately eye-catching; its palette of soft, inviting colors contrasts with the comparatively dark storyline. Lana and Mui travel through the grassy plains surrounding her village, an underground cave, and through a desert. The visuals are bested only by Planet of Lana’s music, which is both chill and powerful in parts.\nOf course, all ends well — this is a game starring a child and an alien cat, after all. Nothing bad was really going to happen to them. Or at least, that was certainly the case in the first game, but the trailer for Planet of Lana 2: Children of the Leaf ends with a shot of poor Mui lying in some sort of hospital bed or perhaps at a research station. Lana looks on, and her worry is palpable in the frame.\nBut, Planet of Lana 2 won’t come out until 2026, so I don’t want to spend too much time worrying about the little dude. The cat’s fine (Right? Right?). What’s not fine, however, is Lana’s village and her people. In the trailer for the second game, we see more alien robots trying to zap her and her friend, and a young villager falls into a faint.\nChildren of the Leaf is certainly upping the stakes and widening its scope. Ships from outer space zoom through a lush forest, and we get exciting shots of Lana hopping from ship to ship. Lana also travels across various environments, including a gorgeous underwater level, and rides on the back of one of the alien robots from the first game.\nI’m very excited to see how the lore of Planet of Lana expands with its sequel, and I can’t wait to tag along for another journey with Lana and Mui when Planet of Lana 2: Children of the Leaf launches in 2026. You can check out the first game on Nintendo Switch, PS4, PS5, Xbox One, Xbox Series X, and Windows PC."
    }
  ],
  "argos_summary": "Planet of Lana 2: Children of the Leaf, set to release in 2026, expands on the original’s hand‑drawn, Miyazaki‑inspired world with new environments such as snowy peaks, underwater trenches, industrial escape‑rooms, and lush forests, each featuring distinct puzzle mechanics that deepen the collaboration between Lana and her cat‑like companion Mui. A 45‑minute Gamescom demo showcased more complex puzzles, new abilities such as hypnotizing creatures, and a richer narrative that explores the planet’s lore and introduces new NPCs and a potential supervillain. The sequel promises roughly double the length of the first game, with a focus on storytelling and gameplay variety, while remaining accessible to newcomers who haven’t played the original. It will launch on PlayStation, Windows, Xbox, and Nintendo Switch in 2026.",
  "argos_id": "UP1ZD45R9"
}