{
  "url": "https://www.latimes.com/business/story/2025-08-22/trump-says-intel-agreed-to-give-us-a-stake-in-its-company",
  "authorsByline": "Michelle L. Price and Michael Liedtke",
  "articleId": "f461f2a2c151418a8ae7a5d56b639ff5",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/a38b4d9/2147483647/strip/true/crop/3748x1968+0+256/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F47%2F31%2F45560a3ce34d39d307f16f065e4d%2F7ec7f01fdf6241c0b9062338a621623c",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T23:18:11.220000+00:00",
  "addDate": "2025-08-22T23:21:40.168780+00:00",
  "refreshDate": "2025-08-22T23:21:40.168781+00:00",
  "score": 1.0,
  "title": "Trump trumpets deal giving US a 10% stake in downtrodden Intel",
  "description": "Trump says Intel agreed to give US a stake in its company",
  "content": "The Intel logo is displayed on the exterior of Intel headquarters in Santa Clara, Calif., Jan. 12, 2011.\n\nPresident Donald Trump on Friday announced the U.S. government has secured a 10% stake in struggling Silicon Valley pioneer Intel in a deal that was completed just a couple weeks after he was depicting the company’s CEO as a conflicted leader unfit for the job.\n\n“The United States of America now fully owns and controls 10% of INTEL, a Great American Company that has an even more incredible future,” Trump wrote in a post.\n\nThe U.S. government is getting the stake through the conversion of $11.1 billion in previously issued funds and pledges. All told, the government is getting 433.3 million shares of non-voting stock priced at $20.47 apiece — a discount from Friday’s closing price at $24.80.\n\nThat spread means the U.S. government already has a gain of $1.9 billion, on paper. The remarkable turn of events makes the U.S. government one of Intel’s largest shareholders at a time that the Santa Clara, California, company is in the process of jettisoning more than 20,000 workers as part of its latest attempt to bounce back from years of missteps taken under a variety of CEOs.\n\nIntel’s current CEO, Lip-Bu Tan, has only been on the job for slightly more than five months, and earlier this month, it looked like he might be on shaky ground already after some lawmakers raised national security concerns about his past investments in Chinese companies while he was a venture capitalist.\n\nTrump latched on to those concerns in an August 7 post demanding that Tan resign.\n\nBut Trump backed off after the Malaysian-born Tan professed his allegiance to the U.S. in a public letter to Intel employees and went to the White House to meet with the president, leading to a deal that now has the U.S. government betting that the company is on the comeback trail after losing more than $22 billion since the end of 2023.\n\nTrump hailed Tan as “highly respected” CEO in his Friday post. In a statement, Tan applauded Trump for “driving historic investments in a vital industry” and resolved to reward his faith in Intel.\n\n“We are grateful for the confidence the President and the Administration have placed in Intel, and we look forward to working to advance U.S. technology and manufacturing leadership,” Tan said.\n\nIntel’s current stock price is just slightly above where it was when Tan was hired in March and more than 60% below its peak reached 25 years ago when its chips were still dominating the personal computer boom before being undercut by a shift to smartphones a few years later.\n\nThe company’s market value currently stands at about $108 billion - a fraction of the current chip kingpin, Nvidia, which is valued at $4.3 trillion. The stake is coming primarily through U.S. government grants to Intel through the CHIPS and Science Act that was started under President Joe Biden’s administration as a way to foster more domestic manufacturing of computer chips to lessen the dependence on overseas factories.\n\nBut the Trump administration, which has regularly pilloried the policies of the Biden administration, saw the CHIPs act as a needless giveaway and is now hoping to make a profit off the funding that had been pledged to Intel.\n\n“We think America should get the benefit of the bargain,” U.S. Commerce Secretary Howard Lutnick said earlier this week. “It’s obvious that it’s the right move to make.”About $7.8 billion had been been pledged to Intel under the incentives program, but only $2.2 billion had been funded so far. Another $3.2 billion of the government investment is coming through the funds from another program called “Secure Enclave.”\n\nAlthough the U.S. government can’t vote with its shares and won’t have a seat on Intel’s board of directors, critics of the deal view it as a troubling cross-pollination between the public and private sectors that could hurt the tech industry in a variety of ways.\n\nFor instance, more tech companies may feel pressured to buy potentially inferior chips from Intel to curry favor with Trump at a time that he is already waging a trade war that threatens to affect their products in a potential scenario cited by Scott Lincicome, vice president of general economics for the Cato Institute.\n\n“Overall, it’s a horrendous move that will have real harms for U.S. companies, U.S. tech leadership, and the U.S. economy overall,” Lincicome posted Friday.\n\nThe 10% stake could also intensify the pressure already facing Tan, especially if Trump starts fixating on Intel’s stock price while resorting to his penchant for celebrating his past successes in business.\n\nNancy Tengler, CEO of money manager Laffer Tengler Investments, is among the investors who abandoned Intel years ago because of all the challenges facing Intel.\n\n“I don’t see the benefit to the American taxpayer, nor do I see the benefit, necessarily to the chip industry,” Tengler said while also raising worries about Trump meddling in Intel’s business.\n\n“I don’t care how good of businessman you are, give it to the private sector and let people like me be the critic and let the government get to the business of government.,” Tengler said.\n\nAlthough rare, it’s not unprecedented for the U.S. government to become a significant shareholder in a prominent company. One of the most notable instances occurred during the Great Recession in 2008 when the government injected nearly $50 billion into General Motors in return for a roughly 60% stake in the automaker at a time it was on the verge of bankruptcy.\n\nThe government ended up with a roughly $10 billion loss after it sold its stock in GM. The U.S. government’s stake in Intel coincides with Trump’s push to bring production to the U.S., which has been a focal point of the trade war that he has been waging throughout the world.\n\nBy lessening the country’s dependence on chips manufactured overseas, the president believes the U.S. will be better positioned to maintain its technological lead on China in the race to create artificial intelligence.\n\nEven before gaining the 10% stake in Intel, Trump had been leveraging his power to reprogram the operations of major computer chip companies. The administration is requiring Nvidia and Advanced Micro Devices, two companies whose chips are powering the AI craze, to pay a 15% commission on their sales of chips in China in exchange for export licenses.",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/biden-science-technology-united-states-economy-2fa651c540c9869890dfe670bcdcb7ea",
    "https://newsroom.intel.com/corporate/my-commitment-to-you-and-our-company",
    "https://www.latimes.com/business/story/2025-08-21/heres-why-you-dont-want-the-trump-administration-to-buy-stock-in-intel",
    "https://www.latimes.com/business/story/2025-08-22/l-a-unions-push-for-new-deal-ahead-of-2028-olympics",
    "https://www.latimes.com/business",
    "https://www.latimes.com/business/story/2025-08-07/trump-says-intel-ceo-is-highly-conflicted-calls-for-resignation",
    "https://apnews.com/article/intel-new-ceo-lipbu-tan-chips-efcf8ab220b5927783924dd316cb4575",
    "https://www.latimes.com/business/story/2025-08-20/say-farewell-to-the-ai-bubble-and-get-ready-for-the-crash",
    "https://www.latimes.com/business/story/2025-08-20/sale-of-graffiti-tarnished-towers-in-downtown-los-angeles-still-dragging-on",
    "https://www.latimes.com/business/story/2025-08-01/intel-used-to-be-the-most-valuable-u-s-chipmaker-how-it-fell-behind-nvidia",
    "https://apnews.com/article/nvidia-amd-15-revenue-share-deal-c06e20d9c3418f1d0b1292891c4610c6",
    "https://x.com/scottlincicome/status/1958947606580600865",
    "https://truthsocial.com/@realDonaldTrump/posts/115074444617901812",
    "https://truthsocial.com/@realDonaldTrump/114987288040725570",
    "https://apnews.com/article/intel-chips-layoffs-a3a83e4bb8cd71e2615e964b432dd37f"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. government grants",
      "weight": 0.09199927
    },
    {
      "name": "U.S. companies",
      "weight": 0.091956064
    },
    {
      "name": "Intel",
      "weight": 0.08565877
    },
    {
      "name": "Intel headquarters",
      "weight": 0.08401149
    },
    {
      "name": "Intel employees",
      "weight": 0.08383342
    },
    {
      "name": "downtrodden Intel",
      "weight": 0.08282355
    },
    {
      "name": "U.S.",
      "weight": 0.07696676
    },
    {
      "name": "major computer chip companies",
      "weight": 0.07689209
    },
    {
      "name": "U.S. tech leadership",
      "weight": 0.07643211
    },
    {
      "name": "more tech companies",
      "weight": 0.073780976
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.939453125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.921875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9013671875
    },
    {
      "name": "/News/Technology News",
      "score": 0.890625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.382568359375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.32080078125
    }
  ],
  "sentiment": {
    "positive": 0.3782707,
    "negative": 0.2598545,
    "neutral": 0.36187488
  },
  "summary": "The US government has secured a 10% stake in Intel, making it one of the largest shareholders in the struggling Silicon Valley company. The deal was completed just weeks after President Donald Trump criticized the company's CEO, Lip-Bu Tan, for being a conflicted leader. The government is receiving 433.3 million shares of non-voting stock priced at $20.47 apiece, a discount from Friday's closing price at $24.80. The stake is primarily through U.S. government grants to Intel through the CHIPS and Science Act, a program started under President Joe Biden to foster more domestic manufacturing of computer chips. Critics argue that this could potentially harm the tech industry in a variety of ways, as tech companies may feel pressured to buy inferior chips from Intel.",
  "shortSummary": "President Donald Trump announced the US government’s acquisition of a 10% stake in struggling Intel, despite internal opposition and potential trade war.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "c384b5bdf918493597b10773422a5e0b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/business/story/2025-08-01/intel-used-to-be-the-most-valuable-u-s-chipmaker-how-it-fell-behind-nvidia",
      "text": "Intel used to be the most valuable U.S. chipmaker. How it fell far behind Nvidia\n- Share via\n- Intel, once the most valuable U.S. chipmaker, is at a pivotal point in its 57-year history as the AI race with rivals such as Nvidia heats up.\n- Intel’s new chief executive is trying to turn around the company. Missed opportunities, manufacturing delays and management missteps slowed down Intel’s growth throughout the years, analysts said.\nEarlier this year, Intel’s new chief executive Lip-Bu Tan made frank remarks about how the Silicon Valley chipmaker keeps coming up short.\n“For quite a long time for Intel, we fell behind on innovation. As a result, we have been too slow to adapt and to meet your needs,” Tan told Intel’s customers and partners at a company event in late March. “You deserve better, and we need to improve, and we will.”\nIntel, a Santa Clara-based tech behemoth that fueled the rise of personal computers, sits at a major crossroads in the company’s 57-year-old history as the competition to dominate artificial intelligence escalates. Known for making the “brains” that power computers, Intel used to be the most valuable U.S. chipmaker before Nvidia claimed the top spot. It’s also facing more competition from rivals such as Advanced Micro Devices and Samsung.\nThe AI frenzy has greatly benefited Nvidia, a company that created a specialized computer chip that’s proven valuable not only for gaming but also for AI model training, data centers and robotics. While Nvidia’s worth ballooned to more than $4 trillion, Intel has seen its market value drop to around $87 billion.\nSanta Clara chipmaker Nvidia has ridden the AI revolution to briefly vault over Microsoft and Apple and become the world’s most valuable company.\n“It’s going to be tough for them,” said Mario Morales, group vice president for enabling technologies and semiconductors at the International Data Corporation. “They missed a very big shift and they don’t yet have the products in AI to compete — and that market is growing fast.”\nIn the last five years, Intel’s stock price has plunged more than 58%. It posted a net loss of $18.8 billion in 2024 and plans to slash roughly 25,000 workers this year.\nIntel’s lengthy history has been filled with highs and lows, but a series of big missed opportunities, manufacturing delays and management missteps hampered the growth of a company long synonymous with Silicon Valley’s rise, analysts say. Tan, a 65-year-old tech leader who became Intel’s chief executive in March, is trying to steer the company in the right direction.\nIntel has bet big on its foundry business, taking on Taiwan Semiconductor Manufacturing Co., which makes chips for other companies such as Apple and Nvidia. Reining in costs, Intel has scrapped manufacturing projects in Germany and Poland while slowing construction of its Ohio factories.\n“There are no more blank checks. Every investment must make economic sense,” Tan told employees in a memo last week.\nIntel’s rise and fall\nFounded in 1968, Intel focused heavily on researching and developing new technologies in its early days.\nRobert Noyce and Gordon Moore, already well-known tech figures, left their jobs at Fairchild Semiconductor to launch what would become Intel. Noyce co-invented the integrated circuit, laying the foundation for the development of laptops, smartphones and other modern electronics. Moore was known for making an observation that became a guiding principle for the semiconductor industry.\nThe company grew rapidly in its early years. Intel’s first engineers worked from a conference room in Mountain View, Calif., before the company moved to its own facility in Santa Clara. The company released memory chips before creating the world’s first commercially available microprocessor and other innovations that made it possible for companies to build more affordable computers. As computer sales from Dell, Microsoft and other tech companies rose, Intel saw its market value reach a record $495 billion in 2000 during the dot-com boom, according to Reuters.\nBut the company also made a series of missteps that would haunt it later, analysts said. Intel declined to comment.\n“It’s been on a weak footing for so long because of those historical poor decisions,” said Jacob Bourne, a technology analyst at eMarketer. “Now it’s at this point where it has to cut all these costs to try and become profitable.”\nOne of Intel’s biggest missed opportunities: supplying chips for the first iPhone in 2007.\nFormer Intel Chief Executive Paul Otellini told The Atlantic in 2013 that Apple was interested in paying a certain price for a chip but it was below what Intel forecasted. That prediction turned out to be wrong and Otellini expressed regret for not following his gut.\nApple Inc. is planning to use its own chips in Mac computers beginning as early as 2020, replacing processors from Intel Corp., according to people familiar with the plans.\n“We ended up not winning it — or passing on it, depending on how you want to view it. And the world would have been a lot different if we’d done it,” Otellini said in that interview.\nBut strategic missteps weren’t Intel’s only problems. The company experienced process technology delays, opening the door for its rivals such as AMD that offered powerful and efficient chips to capture customers.\nPat Gelsinger, who served as Intel’s chief technology officer before returning to lead the chipmaker in 2021, focused on an ambitious and costly turnaround plan for the company. He set a goal in which Intel would develop five new semiconductor process nodes within four years.\nThe federal government awarded Intel billions of dollars last year to support its semiconductor manufacturing expansion in the United States but the company’s net losses were also widening. In 2024, Intel’s foundry business reported an operating loss of $13.4 billion, nearly double compared with the previous year‘s loss, according to its annual report.\n“Gelsinger threw fuel on the fire, because he started spending money like crazy to build out this massive amount of manufacturing capacity for business that they did not have,” said Stacy Rasgon, a senior analyst at Bernstein covering U.S. Semiconductors.\nThen the board reportedly forced out Gelsinger, who announced his retirement last year before Tan took over as chief executive.\nAnother turnaround plan\nIntel’s new chief executive has been focused on cutting costs including around the company’s foundry business. He told employees in a note last week the company invested too much money without enough demand.\nAnd Intel said it might pause or discontinue its upcoming chip manufacturing process technology known as 14A if it can’t land a “significant” customer.\nIntel Corp. is shedding thousands of workers and cutting expenses as its new CEO works to revive the struggling chipmaker’s fortunes.\nWhile Intel has been eclipsed by some of its rivals, the company is still a big player in the semiconductor industry.\nIDC, which analyzed semiconductor revenue, said in 2024 Intel ranked third behind Nvidia and Samsung. It dropped to the fourth spot behind SK Hynix, a South Korean company that supplies memory chips, during the first quarter of this year.\nAnalysts don’t see Intel going away anytime soon. And as tech companies work on rolling out new AI-powered hardware, that could also present another opportunity for Intel.\nAlvin Nguyen, a senior analyst at Forrester, said some of the concerns around Intel being in trouble might be “overstated.”\n“They may not be at the top like they once were, but they are still, ultimately, very important for all industries because their chips are used virtually everywhere,” he said."
    },
    {
      "url": "https://apnews.com/article/intel-chips-layoffs-a3a83e4bb8cd71e2615e964b432dd37f",
      "text": "Intel cuts back spending, workforce as struggling chip maker mounts comeback\nIntel Corp. is shedding thousands of workers and cutting expenses as its new CEO works to revive the fortunes of the struggling chipmaker that helped launch Silicon Valley but has fallen behind rivals like Nvidia Corp. and Advanced Micro Devices Inc.\nIn a memo to employees Thursday, CEO Lip-Bu Tan said Intel plans to end the year with 75,000 “core” workers excluding subsidiaries, through layoffs and attrition. That’s down from 99,500 core employees at the end of last year. The company previously announced a 15% workforce reduction.\n“I know the past few months have not been easy. We are making hard but necessary decisions to streamline the organization, drive greater efficiency and increase accountability at every level of the company,” Tan wrote.\nIn addition, Intel will scrap previously planned projects in Germany and Poland and also move assembly and test operations in Costa Rica to larger sites in Vietnam and Malaysia. Costa Rica will remain a “home to key engineering teams and corporate functions,” Tan said in the memo.\nIn the U.S., the company said it will “further” slow construction of a semiconductor plant in Ohio.\nFounded in 1968 at the start of the PC revolution, Intel missed the technological shift to mobile computing triggered by Apple’s 2007 release of the iPhone, and it’s lagged more nimble chipmakers. Intel’s troubles have been magnified since the advent of artificial intelligence — a booming field where the chips made by once-smaller rival Nvidia have become tech’s hottest commodity.\nThe Santa Clara, California-based company’s market cap was $98.71 billion as of the market close on Thursday, compared with Nvidia’s $4.24 trillion.\nTan said Intel is focusing on its “core product portfolio” and artificial intelligence offerings to better serve customers.\n“There are no more blank checks,” Tan wrote. “Every investment must make economic sense.”\nFor the second quarter, Intel reported a loss of $2.9 billion, or 67 cents per share, down from a loss of $1.6 billion, or 38 cents per share, a year earlier. Excluding one-time items, the company posted a loss of 10 cents a share.\nRevenue was flat at $12.9 billion. Analysts, on average, were expecting adjusted earnings of 1 cent per share on revenue of $12 billion, according to a poll by FactSet."
    },
    {
      "url": "https://apnews.com/article/intel-new-ceo-lipbu-tan-chips-efcf8ab220b5927783924dd316cb4575",
      "text": "Intel hires former board member as new CEO in struggling chipmaker’s latest comeback attempt\nStruggling chipmaker Intel has hired former board member and semiconductor industry veteran Lip-Bu Tan as the latest in a succession of CEOs to attempt to turn around a once-dominant company that helped define Silicon Valley.\nTan, 65, will take over the daunting job next Tuesday, more than three months after Intel’s previous CEO, Pat Gelsinger, abruptly retired amid a deepening downturn that triggered massive layoffs and raised questions about the chipmaker’s ability to survive as an independent company.\nThis won’t be Tan’s first time running a semiconductor company, nor his first association with Intel. He spent more than a decade as CEO of Cadence Design Systems, which makes software that helps designs processors, and joined Intel’s board of directors in 2022 before stepping down last August. Tan will rejoin Intel’s board in addition to becoming CEO.\n“Lip-Bu is an exceptional leader whose technology industry expertise, deep relationships across the product and foundry ecosystems, and proven track record of creating shareholder value is exactly what Intel needs in its next CEO,” Intel’s interim Executive Chairman Frank Yeary said.\nIntel has been led by interim co-CEOs, David Zinsner and Michelle Johnston Holthaus, since Gelsinger walked away from a job that he undertook in February 2021.\nAlthough Gelsinger arrived at Intel amid high hopes, his tenure was a major letdown as Intel’s stock price plunged 60%, wiping out $160 billion in shareholder wealth. Leading up to his departure last year, Intel laid of 17,500 of its employees — about 15% of its workforce — and suspended its dividend to save money on its way to an annual loss of $19 billion.\nMore recently, Intel delayed the opening of two new chip factories i n Ohio to ensure the projects are completed in a “financially responsible manner.” The project is supposed to draw upon the $7.8 billion in funding earmarked for Intel in the CHIPS Incentives Program created during the administration of President Joe Biden.\nIt was the latest sign of distress for Intel, a Santa Clara, California, company that helped launch Silicon Valley by developing the microprocessors that enabled the personal computer revolution under the leadership of its CEO at that time, Andy Grove.\nBut as its leadership changed Intel missed the technological shift to mobile computing triggered by Apple’s 2007 release of the iPhone, and it’s lagged more nimble chipmakers. Intel’s troubles have been magnified since the advent of artificial intelligence — a booming field where the chips made by once-smaller rival Nvidia have become tech’s hottest commodity.\nNvida now boasts a market value of $2.8 trillion compared to Intel’s $90 billion. Intel’s stock price rose more than 10% in Wednesday’s extended trading after Tan’s hiring was announced, indicating investors believe he will revive the company’s fortunes.\nWhile Tan was Cadence Design’s CEO from January 2009 to May 2021, the company’s stock price increased by 44-fold.\nTan’s past accomplishments resulted him being named winner of the Semiconductor Industry Association’s 2022 Robert Noyce Award — an honor named after one of Intel’s co-founders."
    },
    {
      "url": "https://www.latimes.com/business/story/2025-08-07/trump-says-intel-ceo-is-highly-conflicted-calls-for-resignation",
      "text": "Trump says Intel CEO is ‘highly conflicted,’ calls for his resignation\n- Share via\nChipmaker Intel is the latest tech company facing political pressure from President Trump.\nOn Thursday, Trump called for the immediate resignation of Intel Chief Executive Lip-Bu Tan, who took the helm in March to turn around the beleaguered company.\nThe Silicon Valley tech giant, which has a new leader, has lagged behind its rivals during the AI boom and is slashing costs.\n“The CEO of INTEL is highly CONFLICTED and must resign, immediately. There is no other solution to this problem. Thank you for your attention to this problem!” Trump wrote on his social media platform.\nTrump didn’t say what the conflicts were in his post, but his remarks came after Sen. Tom Cotton (R-Ark.) sent a letter to Intel’s board, expressing national security concerns about Tan’s reported ties to Chinese companies. Cotton cited a report from Reuters that said Tan has invested in more than 600 Chinese firms and some of them have links to the country’s military.\nTrump’s call for Tan’s resignation adds to a list of issues Intel already has to deal with.\nThe 57-year-old tech company, once the most valuable U.S. chipmaker, is trying to keep up as the race to dominate artificial intelligence escalates. The Santa Clara, Calif., company has been losing money and has seen its stock price plunge while it falls behind rivals such as Nvidia and Advanced Micro Devices.\nIntel’s share price closed at $19.77 on Thursday, down 3%.\nThe company said in a statement that its board and Tan are “deeply committed to advancing U.S. national and economic security interests and are making significant investments aligned with the President’s America First agenda.”\nTrump said Wednesday during an event in which Apple announced an additional $100-billion investment in the United States that he plans to place a tariff on semiconductors, but that there won’t be a charge for companies building in the U.S.\nPresident Trump has criticized Apple for manufacturing iPhones outside of the United States.\nAlthough he praised companies such as Apple and Nvidia, he criticized Intel.\n“Intel was just taken over the coals. They were taken to the cleaners, frankly, and moved to other places, in particular Taiwan,” Trump said at the event.\nIntel, known for making the “brains” that power computers, has been investing heavily in its foundry business, taking on Taiwan Semiconductor Manufacturing Co., which makes chips for companies including Apple and Nvidia. During the Biden administration, the Department of Commerce awarded Intel roughly $8 billion to support manufacturing and advanced packaging projects in the U.S."
    },
    {
      "url": "https://www.latimes.com/business/story/2025-08-20/say-farewell-to-the-ai-bubble-and-get-ready-for-the-crash",
      "text": "Say farewell to the AI bubble, and get ready for the crash\n- Share via\nMost people not deeply involved in the artificial intelligence frenzy may not have noticed, but perceptions of AI’s relentless march toward becoming more intelligent than humans, even becoming a threat to humanity, came to a screeching halt Aug. 7.\nThat was the day when the most widely followed AI company, OpenAI, released GPT-5, an advanced product that the firm had long promised would put competitors to shame and launch a new revolution in this purportedly revolutionary technology.\nAs it happened, GPT-5 was a bust. It turned out to be less user-friendly and in many ways less capable than its predecessors in OpenAI’s arsenal. It made the same sort of risible errors in answering users’ prompts, was no better in math (or even worse), and not at all the advance that OpenAI and its chief executive, Sam Altman, had been talking up.\nAI companies are really buoying the American economy right now, and it’s looking very bubble-shaped.\n— Alex Hanna, co-author, “The AI Con”\n“The thought was that this growth would be exponential,” says Alex Hanna, a technology critic and co-author (with Emily M. Bender of the University of Washington) of the indispensable new book “The AI Con: How to Fight Big Tech’s Hype and Create the Future We Want.” Instead, Hanna says, “We’re hitting a wall.”\nThe consequences go beyond how so many business leaders and ordinary Americans have been led to expect, even fear, the penetration of AI into our lives. Hundreds of billions of dollars have been invested by venture capitalists and major corporations such as Google, Amazon and Microsoft in OpenAI and its multitude of fellow AI labs, even though none of the AI labs has turned a profit.\nPublic companies have scurried to announce AI investments or claim AI capabilities for their products in the hope of turbocharging their share prices, much as an earlier generation of businesses promoted themselves as “dot-coms” in the 1990s to look more glittery in investors’ eyes.\nNvidia, the maker of a high-powered chip powering AI research, plays almost the same role as a stock market leader that Intel Corp., another chip-maker, played in the 1990s — helping to prop up the bull market in equities.\nIf the promise of AI turns out to be as much of a mirage as dot-coms did, stock investors may face a painful reckoning.\nAI ‘hallucinations’ are causing lawyers professional embarrassment, sanctions from judges and lost cases. Why do they keep using it?\nThe cheerless rollout of GPT-5 could bring the day of reckoning closer. “AI companies are really buoying the American economy right now, and it’s looking very bubble-shaped,” Hanna told me.\nThe rollout was so disappointing that it shined a spotlight on the degree that the whole AI industry has been dependent on hype.\nHere’s Altman, speaking just before the unveiling of GPT-5, comparing it with its immediate predecessor, GPT-4o: “GPT-4o maybe it was like talking to a college student,” he said. “With GPT-5 now it’s like talking to an expert — a legitimate PhD-level expert in anything any area you need on demand ... whatever your goals are.”\nWell, not so much. When one user asked it to produce a map of the U.S. with all the states labeled, GPT-5 extruded a fantasyland, including states such as Tonnessee, Mississipo and West Wigina. Another prompted the model for a list of the first 12 presidents, with names and pictures. It only came up with nine, including presidents Gearge Washington, John Quincy Adama and Thomason Jefferson.\nExperienced users of the new version’s predecessor models were appalled, not least by OpenAI’s decision to shut down access to its older versions and force users to rely on the new one. “GPT5 is horrible,” wrote a user on Reddit. “Short replies that are insufficient, more obnoxious ai stylized talking, less ‘personality’ … and we don’t have the option to just use other models.” (OpenAI quickly relented, reopening access to the older versions.)\nThe tech media was also unimpressed. “A bit of a dud,” judged the website Futurism and Ars Technica termed the rollout “a big mess.” I asked OpenAI to comment on the dismal public reaction to GPT-5, but didn’t hear back.\nNone of this means that the hype machine underpinning most public expectations of AI has taken a breather. Rather, it remains in overdrive.\nA projection of AI’s development over the coming years published by something called the AI Futures Project under the title “AI 2027” states: “We predict that the impact of superhuman AI over the next decade will be enormous, exceeding that of the Industrial Revolution.”\nShares in AI companies have powered a huge runup in the stock market this year, but users are beginning to question whether the craze will fall flat.\nThe rest of the document, mapping a course to late 2027 when an AI agent “finally understands its own cognition,” is so loopily over the top that I wondered whether it wasn’t meant as a parody of excessive AI hype. I asked its creators if that was so, but haven’t received a reply.\nOne problem underscored by GPT-5’s underwhelming rollout is that it exploded one of the most cherished principles of the AI world, which is that “scaling up” — endowing the technology with more computing power and more data — would bring the grail of artificial general intelligence, or AGI, ever closer to reality.\nThat’s the principle undergirding the AI industry’s vast expenditures on data centers and high-performance chips. The demand for more data and more data-crunching capabilities will require about $3 trillion in capital just by 2028, in the estimation of Morgan Stanley. That would outstrip the capacity of the global credit and derivative securities markets. But if AI won’t scale up, most if not all that money will be wasted.\nAs Bender and Hanna point out in their book, AI promoters have kept investors and followers enthralled by relying on a vague public understanding of the term “intelligence.” AI bots seem intelligent, because they’ve achieved the ability to seem coherent in their use of language. But that’s different from cognition.\n“So we’re imagining a mind behind the words,” Hanna says, “and that becomes associated with consciousness or intelligence. But the notion of general intelligence is not really well-defined.”\nIndeed, as long ago as the 1960s, that phenomenon was noticed by Joseph Weizenbaum, the designer of the pioneering chatbot ELIZA, which replicated the responses of a psychotherapist so convincingly that even test subjects who knew they were conversing with a machine thought it displayed emotions and empathy.\n“What I had not realized,” Weizenbaum wrote in 1976, “is that extremely short exposures to a relatively simple computer program could induce powerful delusional thinking in quite normal people.” Weizenbaum warned that the “reckless anthropomorphization of the computer” — that is, treating it as some sort of thinking companion — produced a “simpleminded view of intelligence.”\nMeta’s LLaMA chatbot was trained on a database of 200,000 books, including mine, without pay. How should authors like me think about that?\nThat tendency has been exploited by today’s AI promoters. They label the frequent mistakes and fabrications produced by AI bots as “hallucinations,” which suggests that the bots have perceptions that may have gone slightly awry. But the bots “don’t have perceptions,” Bender and Hanna write, “and suggesting that they do is yet more unhelpful anthropomorphization.”\nThe general public may finally be cottoning on to the failed promise of AI more generally. Predictions that AI will lead to large-scale job losses in creative and STEM fields (science, technology, engineering and math) might inspire feelings that the whole enterprise was a tech-industry scam from the outset.\nPredictions that AI would yield a burst of increased worker productivity haven’t been fulfilled; in many fields, productivity declines, in part because workers have to be deployed to double-check AI outputs, lest their mistakes or fabrications find their way into mission-critical applications — legal briefs incorporating nonexistent precedents, medical prescriptions with life-threatening ramifications and so on.\nSome economists are dashing cold water on predictions of economic gains more generally. MIT economist Daron Acemoglu, for example, forecast last year that AI would produce an increase of only about 0.5% in U.S. productivity and an increase of about 1% in gross domestic product over the next 10 years, mere fractions of the AI camp’s projections.\nThe value of Bender’s and Hanna’s book, and the lesson of GPT-5, is that they remind us that “artificial intelligence” isn’t a scientific term or an engineering term. It’s a marketing term. And that’s true of all the chatter about AI eventually taking over the world.\n“Claims around consciousness and sentience are a tactic to sell you on AI,” Bender and Hanna write. So, too, is the talk about the billions, or trillions, to be made in AI. As with any technology, the profits will go to a small cadre, while the rest of us pay the price ... unless we gain a much clearer perception of what AI is, and more importantly, what it isn’t.\nMore to Read\nInsights\nL.A. Times Insights delivers AI-generated analysis on Voices content to offer all points of view. Insights does not appear on any news articles.\nViewpoint\nPerspectives\nThe following AI-generated content is powered by Perplexity. The Los Angeles Times editorial staff does not create or edit the content.\nIdeas expressed in the piece\nThe author argues that GPT-5’s launch on August 7 marked a definitive end to perceptions of AI’s relentless advancement, describing the release as “a bust” that was less user-friendly and capable than its predecessors. The model made embarrassing errors, including creating a fantasy map of the U.S. with states like “Tonnessee” and “West Wigina,” and struggled with basic tasks like listing the first 12 presidents.\nAccording to the author’s perspective, the AI industry represents a dangerous bubble reminiscent of the 1990s dot-com era, with hundreds of billions invested in AI companies despite none achieving profitability. The author contends that public companies are frantically announcing AI capabilities merely to inflate their stock prices, while Nvidia plays a similar market-propping role that Intel did during the previous tech bubble.\nThe author maintains that GPT-5’s disappointing performance has shattered the fundamental “scaling up” principle that underpins AI development—the belief that more computing power and data will lead to artificial general intelligence. This principle has justified massive expenditures on data centers and chips, with Morgan Stanley estimating $3 trillion in required capital by 2028, which the author argues will largely be wasted.\nThe piece emphasizes that “artificial intelligence” is fundamentally a marketing term rather than a scientific one, arguing that AI promoters exploit public misunderstanding by anthropomorphizing chatbots and labeling their mistakes as “hallucinations.” The author cites the 1960s ELIZA chatbot experiment to demonstrate how humans have long been susceptible to attributing consciousness to simple computer programs.\nThe author concludes that predictions of AI-driven productivity gains and job displacement have failed to materialize, with some workers actually becoming less productive due to the need to verify AI outputs, while economists like MIT’s Daron Acemoglu project minimal economic benefits from AI advancement.\nDifferent views on the topic\nDespite initial user complaints, industry data suggests GPT-5’s adoption has been successful, with ChatGPT usage actually increasing since the model’s release according to OpenAI’s head of ChatGPT[1]. The model now serves nearly 700 million weekly users, indicating sustained market confidence in AI technology[2].\nOpenAI and industry partners present GPT-5 as representing significant technological advancement, describing it as achieving “state-of-the-art performance across coding, math, writing, health, visual perception, and more”[4]. Companies like Amgen report that GPT-5 has met their high scientific accuracy standards and demonstrates improved navigation of ambiguous contexts compared to previous models[2].\nTechnology companies and developers offer evidence of GPT-5’s superior capabilities, with Cursor describing it as “the smartest model [they’ve] used” and Windsurf reporting it has “half the tool calling error rate over other frontier models”[3]. These assessments suggest meaningful technical progress rather than stagnation.\nIndustry leaders acknowledge implementation challenges while maintaining confidence in the underlying technology’s trajectory, with OpenAI CEO Sam Altman quickly responding to user feedback by promising doubled rate limits, restored access to older models, and personality improvements[1]. The company’s rapid response demonstrates adaptability rather than fundamental failure.\nThe business integration of GPT-5 continues expanding across major enterprises including Microsoft platforms, with organizations like BNY, California State University, and T-Mobile already deploying AI systems for operational transformation[2][3]. This widespread adoption indicates sustained corporate belief in AI’s practical value proposition."
    },
    {
      "url": "https://www.latimes.com/business/story/2025-08-22/l-a-unions-push-for-new-deal-ahead-of-2028-olympics",
      "text": "L.A. unions push for ‘New Deal’ ahead of 2028 Olympics\n- Share via\nA crowd of local union members and organizers formed in front of the classical-style arches of the Los Angeles Memorial Coliseum early Thursday morning, holding a banner with the colorful, iconic Olympic rings and “Fair Games” printed across them.\nWith the city of Los Angeles set to become a mega sporting events capital of the world — scheduled to host the FIFA World Cup, the Super Bowl, the Olympic and Paralympic Games all in the next few years — labor groups pushed for what they are calling a “New Deal” to get the city and the LA28 Olympics organizing committee to make commitments to improve the lot of working people.\nThe unions are calling for multibillion-dollar investments to build 50,000 units of housing, a prohibition on Airbnb and other short-term rentals, more transparency in venue agreements and protections for immigrant workers — as well as foreign visitors and fans — from federal raids.\n“Let’s fight for our future, let’s fight for our democracy. Because together we can hold LA28 and the [International Olympic Committee] accountable,” said Victor Sanchez, executive director of advocacy group Los Angeles Alliance for a New Economy, at the Thursday rally.\nUnion officials noted that world sporting events have often failed to produce lasting benefits for host cities, causing price increases that displace low-income residents and leaving communities indebted.\n“After the Games are over, what’s left for L.A.? “ said Armando Elenes, secretary-treasurer of United Farm Workers, in an interview.\nOlympic organizers and corporate partners rejected the idea that local residents would be left out of the economic benefits of hosting the Games.\nJacie Prieto Lopez, a spokesperson for LA28, said in a statement that the Olympic and Paralympic Games “will mean good-paying jobs and real opportunities for working people in Los Angeles, including benefits that reach the neighborhoods and families who keep this city running.”\n“In collaboration with the City of Los Angeles, we look forward to our partnerships with local unions and remain confident the Games will bring positive economic impact to the region and leave behind a stronger future for working people,” Lopez said.\nThe region’s intractable housing and homelessness crisis is at the core of the union push.\nThe campaign calls for the International Olympic Committee to end its partnership with Airbnb, which it announced in 2019 and is set to last through 2028, covering five Games. Short-term rental companies have been accused of depleting housing stock by removing them from the long-term rental market, thereby driving up rents and exacerbating L.A.’s homelessness crisis.\nAnd it calls on the Olympic committee as well as LA28 to contribute $5 billion to fund housing construction.\nAirbnb representatives pushed back on claims that it hurt housing stock. The company cited a study it published last year that found it had generated $4.4 billion in economic activity in L.A. in 2023, supporting thousands of jobs and bringing in $1.2 billion in tax revenue.\n“Airbnb is focused on ensuring Los Angeles’ visitors have an affordable place to stay, while the city gets the revenue it needs to prevent cuts to public services — all without taxing Angelenos,” Justin Wesson, a senior public policy manager at Airbnb, said in a statement. “UNITE HERE continues to put hotel special interests ahead of what’s best for locals.”\nThe company said it fills a crucial lodging gap, with the 2028 Olympics expected to draw as many as 2.3 million tourists to the Los Angeles region. Hotels in the Los Angeles area can accommodate approximately 174,000 guests per day, out of the estimated need of accommodating about 575,000 guests per day, according to Airbnb.\nThe International Olympic Committee did not immediately respond to a request for comment.\nKurt Petersen, co-president of Unite Here Local 11, said that in the early stages LA28 Chairman Casey Wasserman had said that if Los Angeles won its bid to host the Olympics, it would build an Olympic Village with 17,000 beds for athletes, coaches and staff that would later be converted into permanent housing. Those plans in L.A. fell through, Petersen said.\n“Housing is the No. 1 problem for everyone,” Petersen said. “We gave [housing construction] up here. and we’re saying ‘no no no.’ We need to have that vision — that vision that somehow disappeared.”\nA spokesperson for LA28 said Wasserman’s comments were made before a bid was submitted. The city’s official bid to host the Olympics had named UCLA’s campus as the site for the Olympic and Paralympic Village."
    },
    {
      "url": "https://apnews.com/article/nvidia-amd-15-revenue-share-deal-c06e20d9c3418f1d0b1292891c4610c6",
      "text": "US will get a 15% cut of Nvidia and AMD chip sales to China under a new, unusual agreement\nNEW YORK (AP) — Nvidia and AMD have agreed to share 15% of their revenues from chip sales to China with the U.S. government, as part of a deal to secure export licenses for the semiconductors.\nThe Trump administration halted the sale of advanced computer chips to China in April over national security concerns, but Nvidia and AMD revealed in July that Washington would allow them to resume sales of the H20 and MI308 chips, which are used in artificial intelligence development.\nPresident Trump confirmed the terms of the unusual arrangement in a Monday press conference while noting that he originally wanted 20% of the sales revenue when Nvidia asked to sell the “obsolete” H20 chip to China. The president credited Nvidia CEO Jensen Huang for negotiating him down to 15%.\n“So we negotiated a little deal. So he’s selling a essentially old chip,” Trump said.\nNvidia did not comment about the specific details of the agreement or its quid pro quo nature, but said they would adhere to the export rules laid out by the administration.\n“We follow rules the U.S. government sets for our participation in worldwide markets. While we haven’t shipped H20 to China for months, we hope export control rules will let America compete in China and worldwide,” Nvidia wrote in a statement to the AP. “America cannot repeat 5G and lose telecommunication leadership. America’s AI tech stack can be the world’s standard if we race.”\nAMD did not immediately reply to a request for comment.\nRep. John Moolenaar, the Republican chair of the House Select Committee on China, expressed concern over the deal.\n“There are questions about the legal basis for doing so,” he said. “Export controls are a frontline defense in protecting our national security, and we should not set a precedent that incentivizes the government to grant licenses to sell China technology that will enhance its AI capabilities.”\nThe top Democrat on the panel also raised concerns over the reported agreement, calling it “a dangerous misuse of export controls that undermines our national security.”\nRep. Raja Krishnamoorthi, the ranking member of the House Select Committee on China, said he would seek answers about the legal basis for this arrangement and demand full transparency from the administration.\n“Our export control regime must be based on genuine security considerations, not creative taxation schemes disguised as national security policy,” he said. “Chip export controls aren’t bargaining chips, and they’re not casino chips either. We shouldn’t be gambling with our national security to raise revenue.”\nDerek Scissors, senior fellow and China expert at the conservative American Enterprise Institute, reiterated Moolenaar’s point about the constitutionality of the deal.\n“There’s no precedent for this, probably because export taxes are unconstitutional, ” said Derek Scissors, senior fellow and China expert at the conservative American Enterprise Institute. “They call it a fee, but 15% of sales revenue is about a standard a tax as it comes. For this reason, I don’t think the ‘arrangement’ is at all durable. ‘’\n“If it were to last, it has two possible implications. First, there’s a possible export tax that high-profile companies and goods must consider. Or the tax only applies in exceptional situations, such as changing export controls. Then we’d risk national security for the sake of tax revenue, which is effectively the same as cutting the defense budget,” Scissors said.\nBack in July, Nvidia argued that tight export controls around their chip sales would cost the company an extra $5.5 billion. They’ve argued that such limits hinder U.S. competition in a sector in one of the world’s largest markets for technology, and have also warned that U.S. export controls could end up pushing other countries toward China’s AI technology.\nCommerce Secretary Howard Lutnick told CNBC in July that the renewed sale of Nvidia’s chips in China was linked to a trade agreement made between the two countries on rare earth magnets.\nRestrictions on sales of advanced chips to China have been central to the AI race between the world’s two largest economic powers, but such controls are also controversial. Proponents argue that these restrictions are necessary to slow China down enough to allow U.S. companies to keep their lead. Meanwhile, opponents say the export controls have loopholes — and could still spur innovation. The emergence of China’s DeepSeek AI chatbot in January particularly renewed concerns over how China might use advanced chips to help develop its own AI capabilities.\n—-\nAssociated Press writers Josh Boak, Shawn Chen, Didi Tang and Paul Wiseman contributed to the reporting."
    },
    {
      "url": "https://www.latimes.com/business",
      "text": "Columns\nEntertainment Investigations\nIn Depth\nWith downtown’s office rental market mired in high vacancies and falling values, stakeholders are clamoring for more city support to convert high-rises to housing that would help address the city’s persistent housing shortage.\nCalifornia Economy\nFires, government restrictions and interest in mid-term rentals are thought to be driving the decline in have in short-term rental licenses.\nCalifornia Business\nMost Read\nPersonal Finance and Guides\nA Pew Research Study found that 73% of adults have experienced one or more online scams. Experts provide tips on how to avoid them.\nMoney Talk with Liz Weston\nMore Business News\nBuying a home for the first time is one of life’s sweet milestones."
    },
    {
      "url": "https://www.latimes.com/business/story/2025-08-20/sale-of-graffiti-tarnished-towers-in-downtown-los-angeles-still-dragging-on",
      "text": "Graffiti-tarnished towers in downtown L.A. remain in limbo\n- Share via\nEarly last year, vandals breached fencing, climbed dozens of flights of stairs and painted bold, colorful graffiti on the exterior of three unfinished high-rises that make up the abandoned Oceanwide Plaza development.\nThe so-called Graffiti Towers — visible from great distances on the 110 Freeway and looming over thousands of visitors attending events across the street at Crypto.com Arena — were expected to be sold in a bankruptcy auction a year ago.\nGraffiti artists made Oceanwide Plaza in downtown Los Angeles infamous. But a far more complex question looms over the real estate catastrophe: Can it be salvaged?\nBut the long-running bankruptcy sale of downtown Los Angeles’ most spectacular eyesore drags on with no clear end in sight. Experts blame a confluence of factors, including high interest rates, rising construction costs and delays in attracting viable bidders.\nConstruction on what would have been one of the city’s most notable landmarks, with high-rise housing, a hotel and a shopping center, halted in 2019 when Beijing-based conglomerate Oceanwide Holdings ran out of money to pay contractors after spending $1.2 billion on the complex that fills a large city block on Figueroa Street.\nBusiness leaders have expressed alarm that the graffiti some find artistic will prove embarrassing when global attention is focused on the World Cup next year and the Summer Olympics in 2028.\nResolution of the Oceanwide Plaza saga also can’t come soon enough for many downtown stakeholders who see the graffitied towers — rising as high as 49 stories — as a dark presence besmirching the city and sending a negative message about the neighborhood.\nWith downtown’s office rental market mired in high vacancies and falling values, stakeholders are clamoring for more city support to convert high-rises to housing that would help address the city’s persistent housing shortage.\n“The Graffiti Towers have worldwide infamy at this point,” said Cassy Horton, co-founder of the DTLA Residents Assn. “It’s like this beacon that shines and says, ‘Come create mischief down here and you won’t get in trouble. This is the spot to do it.’”\nThe graffiti is likely to remain until a new owner takes on the painstaking task of removing it.\nMore than a year ago, a federal judge set a Sept. 17 auction of the property, saying there were several potential bidders. The winner of the auction ultimately wasn’t able to come up with the promised purchase price and negotiations commenced with other bidders.\nThe real estate broker managing the sale, Mark Tarczynski of Colliers, declined to comment on the status of the sale but told real estate publication the Real Deal recently that two real estate development companies, one from the U.S. and one from abroad, are now competing as bidders. He said he anticipates closing the deal by the end of the year.\nThe purchase price, which would be used to pay creditors including general contractor Lendlease and EB-5 visa investors, would just be the beginning of expenses for the new owner. Estimates to complete the project reach $1 billion, even though it is about 60% completed.\nChallenges to get it done include market conditions that are hamstringing other planned real estate developments. Builders complain of high interest rates for borrowing money to finance construction.\nNew tariffs are driving up the cost of imported construction materials while raising uncertainty about how long the tariffs may last or what new ones may arise. Labor costs have also been increasing in recent years, and the recent Immigration and Customs Enforcement raids have added a destabilizing effect on the construction labor pool, industry observers have said.\nLos Angeles architect Douglas Hanson, who designed the 35-story Circa apartment complex next to Oceanwide Plaza, has an idea to shield people’s gaze from the graffitied towers and bring in some money.\nHe suggests rolling down vinyl advertising signs that could be seen on the from the freeway on the west side of the complex and lowering other vinyl coverings on the east side that would display a beach scene or some other art.\n“You can get good money for advertising in that neighborhood,” which allows large commercial displays, Hanson said. Ad revenue would more than pay for the signs, he said.\nThe buildings wouldn’t be fully wrapped like a Christo art project, he said. “Just drape them down and leave a little bit of the history of the building behind them.”\nThe Oceanwide Plaza site was a sprawling asphalt lot used for event parking when Oceanwide Holdings bought it in 2014 with a vision to build a fancy, mixed-use development that was far bigger in scale than what is typically built in the U.S.\nOceanwide set to work on the complex, which was intended to house luxury condominiums, apartments, a five-star Park Hyatt hotel and an indoor mall that would include deluxe shops and restaurants. A massive electronic sign on its facade was to bring a flavor of Times Square to Figueroa Street.\nMany of the residents and visitors were expected to be Chinese citizens, but the country’s government implemented tighter controls on money leaving the country in 2019 and the pool of potential condo buyers shrunk."
    },
    {
      "url": "https://www.latimes.com/business/story/2025-08-21/heres-why-you-dont-want-the-trump-administration-to-buy-stock-in-intel",
      "text": "Here’s why you don’t want the Trump administration to buy stock in Intel\n- Share via\nBack in 1935, the drafters of Social Security told Congress of their plans to build up a government pension reserve that would reach $47 billion.\nThe number shocked lawmakers. It was nearly three times the outstanding federal debt of the time.\n“What in heaven’s name are you going to do with $47 billion?” Sen. Arthur Vandenberg, Republican of Michigan, asked Arthur Altmeyer, one of the drafters.\nIf we’re going to give you the money, we want a piece of the action.\n— Trump’s rationale for taking stock in Intel (according to Commerce Secretary Lutnick)\n“You could invest it in U.S. Steel and some of the large corporations,” Altmeyer suggested.\nVandenberg threw up his hands in horror. “That would be socialism!” he exclaimed.\nYet the idea of federal government investments in public corporation stock has never died. It walks among us like a zombie today, with the Trump administration talking about taking a 10% ownership stake in the chipmaker Intel and musing about creating a sovereign wealth fund akin to those established by Saudi Arabia, Singapore, Norway and other countries.\nHere’s what history tells us about the virtues of this idea for the United States: There aren’t any.\nSuch funds “usually reflect the quality of governance of the states that sponsor them,” observed Steven Feldstein and Jodi Vittori of the Carnegie Endowment for International Peace in April. “Considering the Trump administration’s self-dealing and erosion of accountability, there is an acute risk that the U.S. SWF could become a source of graft to reward Trump’s friends, coerce political support for his priorities and bring personal enrichment.”\nOn Wednesday, the government said second-quarter GDP growth was 3% annualized. On Friday, the government said job growth had cratered, pointing to recession.\nLeaving aside the quality of governance in Trump’s White House or legislators’ fears of “socialism,” the idea of federal investment in public companies has never found lasting favor on Capitol Hill, for it has been almost impossible for lawmakers to overcome the touchy economic, political and philosophical issues.\nA federal fund with the authority to purchase corporate stock would be one of the largest and most potent investors in the market. As I wrote in 2005, when the idea of allowing Social Security to invest its trust fund in equities was under consideration again, the potential for conflicts of interest is inescapable.\nThe government might be a major shareholder in a corporation it was prosecuting for criminal activity. The government might end up on one side of an international issue as a member of a coalition of nations, and on the opposite side as a shareholder.\nIts financial interests might stand in opposition to its social interests: In his 1999 State of the Union message, for example, President Clinton simultaneously threatened to sue the tobacco industry over its threat to public health, and advocated allowing Social Security to invest in all equities — tobacco included.\nIn 1935, Congress addressed the conundrum by mandating that the Social Security Administration invest its reserves only in U.S. Treasury securities, a rule that exists to this day.\nSocial Security’s would-be reformers periodically revive proposals to shift some of the program’s trust fund — which held more than $2.7 trillion in treasuries at the end of last year — into equities, pointing to their superior long-term returns compared with bonds. But those efforts have never come to fruition.\nThe federal government taking an equity stake in a public company wouldn’t be unprecedented. In 2009, the Obama administration acquired a 60.8% ownership of General Motors in return for almost $50 billion in bailout funds. The government also acquired a smaller stake in Chrysler, which was subsequently sold to Fiat.\nWith his tariff ‘deals,’ President Trump leaves international trade relationships even more unsettled than before.\nThe government sold the last of its GM holdings in 2013, booking a direct loss of about $10.5 billion. But its bailout has been deemed a success, given that it saved as many as 1.9 million jobs at GM, Chrysler and their suppliers.\nThe auto bailouts were emergency initiatives, taken to stave off what was shaping up as the auto industry’s imminent collapse. Obama made clear that these were temporary measures and that the government would sell off its stockholdings as soon as that was practicable. The government abjured any control over GM’s day-to-day operations, but it did orchestrate the exit of GM Chief Executive Rick Wagoner, oversaw the replacement of a majority of its board members and imposed compensation limits on its top executives.\nThe auto bailouts followed numerous examples of U.S. government takeovers, or attempted takeovers, of private businesses. In 1791, Congress authorized the government to take a 20% stake in the Bank of the United States, and in 1816, to take the same stake in the Second Bank of the United States. These are seen today as precursors to the creation of the Federal Reserve Bank as a central banking authority.\nDuring the Great Depression, the Reconstruction Finance Corp., a Hoover creation that lived well into Franklin Roosevelt’s New Deal, took preferred shares in numerous impaired banks in return for capital infusions they needed to survive.\nBy the end of 1935, RFC-owned preferred stock amounted to nearly 40% of total bank common stock in the United States; the RFC’s hard-charging chairman, Texan Jesse Jones, was not shy about imposing “reasonable” compensation caps on its executives or replacing them when they faltered, or prodding their managements to make loans to private borrowers, a key element of FDR’s program of economic recovery.\nZohran Mamdani’s remarks about billionaires has the defenders of plutocrats in a tizzy. They should stop whining already.\nThe government also exercises effective control over Fannie Mae and Freddie Mac, two government-sponsored mortgage companies, via a conservatorship implemented in 2008, when the housing crash heralded the outset of the Great Recession. Stock in both companies remains in private hands, but warrants allow the government to acquire up to 79.9% of the common stock of each. Those warrants haven’t been exercised, but they equate to firm government authority over the firms’ activities.\nTrump’s proposed Intel investment would occur in a very different economic environment and have very different features from any of those precursors. The terms of the plan have been murky.\nCommerce Secretary Howard Lutnick confirmed during an appearance on CNBC Tuesday that the government would demand Intel shares in return for the roughly $10 billion in funds allocated to Intel via the Biden-era CHIPS Act, which aimed to shore up America’s position in high-tech hardware.\n“We’ll deliver the money, which was already committed under the Biden administration,” Lutnick said. “We’ll get equity in return for it.” He quoted Trump as saying, “If we’re going to give you the money, we want a piece of the action.”\nA $10-billion stake would be about 10% of Intel’s shares. That would make the government the company’s largest shareholder, outstripping the stakes held by institutional investors Vanguard and BlackRock. Lutnick said the government wouldn’t exercise voting rights or involve itself in governance. But he didn’t talk about a time-limited ownership, or specify what corporate policies the Trump administration would favor. As it happens, Trump has publicly demanded the resignation Intel CEO Lip-Bu Tan, a Malaysian, over Tan’s ostensible connections to China.\nDespite its stumbles in recent years, Intel doesn’t appear to be facing extinction, as the automakers arguably did in 2008 and 2009. Nor would Intel’s demise have anywhere near the impact on the U.S. economy that a GM collapse might have had amid the Great Recession.\nHiltzik: Crypto was already in bad odor before jumping into bed with Trump. Now it smells worse\nTrump’s cryptocurrency deals have even Republicans getting concerned about the potential — and possibly the reality — of conflicts of interest and unconstitutional transactions.\nOnce the linchpin of the high-tech boom of the 1990s, Intel has plainly lost its mojo. As my colleague Queenie Wong reported, its strategic blunders have included missing out on the artificial intelligence investment boom that has made Nvidia, the maker of chips for AI development, a darling of today’s stock market.\nIntel hasn’t commented on the White House’s interest in taking an equity stake, but Intel investors don’t appear to know what to make of the idea. Shares in the company gained about 7% on Aug. 19, after Bloomberg first reported on the possibility, but have since fallen back, despite news that the Japanese investment firm SoftBank would take a $2-billion stake in the company.\nIntel shares fell 7% Wednesday in Nasdaq trading, closing at $23.54, a hair below their price prior to the Bloomberg report.\nWhether Trump could resist jawboning Intel, or any other companies in which the government holds shares, into instituting policies he favors is doubtful. He has frequently tried to exert pressure on CEOs of companies in which the government has no ownership, after all.\nThat concern would be heightened if the administration has control over a sovereign wealth fund. Trump aired that proposal via an executive order in February. The order called on Lutnick and Treasury Secretary Scott Bessent to submit a plan by the beginning of May, but none has yet surfaced.\nA U.S. sovereign wealth fund wouldn’t be based on the same principles as those of many other such ventures. “SWFs have traditionally been set up by states rich in natural resources to manage their budgetary surplus, diversify their economies, and protect their wealth for future generations,” observed the Carnegie Endowment’s Feldstein and Vittori. That’s the case with the funds of both Saudi Arabia and Norway. The U.S., however, “doesn’t have excess funds to put into a SWF,” Feldstein and Vittori write.\nIn a fact sheet accompanying the executive order, Trump mentioned $5.7 trillion in government assets, including “natural resource reserves.” He has also talked about profits from crypto investments and the government take from tariffs — though the latter are essentially a tax on American consumers, who might have different ideas about how to spend the money.\nThe Carnegie researchers note that the most successful sovereign wealth funds such as Norway’s “maintain operational independence and make investments based on rigorous financial criteria.” Neither quality is a hallmark of the Trump administration.\nFeldstein and Vittori point out that by building a U.S. fund via tariff income or income from Trump’s “gold card” proposal, which would give rich foreigners the right to live in the U.S. for a $5-million fee, might allow Trump to evade Congress’s constitutional monopoly on raising and spending money and even allow him to manage the fund behind closed doors.\nStill, it would be up to Congress to establish the fund and oversee its operations. Will the lawmakers accept their responsibility? If not, Trump’s idea is a dangerous one. “Giving a president who aspires to be a king a potent financial weapon with ill-defined purposes and methods,” Feldstein and Vittori write, “presents a grave risk to American democracy.”\nMore to Read\nInsights\nL.A. Times Insights delivers AI-generated analysis on Voices content to offer all points of view. Insights does not appear on any news articles.\nViewpoint\nPerspectives\nThe following AI-generated content is powered by Perplexity. The Los Angeles Times editorial staff does not create or edit the content.\nIdeas expressed in the piece\nThe proposal for government equity stakes in companies like Intel creates inherent conflicts of interest, as the federal government could find itself as a major shareholder in corporations it simultaneously prosecutes for criminal activity or opposes on international issues. Historical precedent from Social Security’s design shows lawmakers’ longstanding wariness of such arrangements, with Congress in 1935 mandating investment only in Treasury securities to avoid these complications.\nTrump’s governance record raises particular concerns about potential abuse of a sovereign wealth fund or equity stakes, with risks that such vehicles could become sources of graft to reward political allies, coerce support, and enable personal enrichment rather than serving genuine public interests. The administration’s track record of self-dealing and eroded accountability heightens these risks compared to more professionally managed sovereign wealth funds in other countries.\nUnlike successful government interventions such as the 2009 auto bailouts, which were emergency measures with clear exit strategies during an imminent industry collapse, the Intel investment lacks similar justification since the company does not face extinction and its potential demise would not devastate the broader economy. The auto bailouts were explicitly temporary with defined parameters, while the Intel proposal offers no such limitations or timeframes for divestiture.\nThe proposed sovereign wealth fund differs fundamentally from successful international models, as the United States lacks the budget surpluses from natural resources that typically fund such vehicles, instead relying on tariff revenues that essentially tax American consumers. This structure could potentially allow circumvention of Congress’s constitutional authority over government spending and create opportunities for behind-closed-doors management without proper oversight.\nDifferent views on the topic\nThe Trump administration justifies the equity stake approach as ensuring taxpayers receive value for government investments, with Commerce Secretary Howard Lutnick explaining the logic as “If we’re going to give you the money, we want a piece of the action” regarding the $10 billion in CHIPS Act funding already committed to Intel[1][2]. This transactional approach aims to create direct financial returns for the government rather than simply providing subsidies without equity participation.\nThe Intel equity stake represents a strategic move to strengthen U.S. competitiveness in the semiconductor industry amid ongoing tensions with China, building on the Biden administration’s CHIPS Act framework while adding an ownership component that could provide ongoing influence over critical technology infrastructure[1][3]. This approach seeks to ensure sustained American leadership in crucial semiconductor manufacturing capabilities.\nGovernment equity participation has historical precedents of success, particularly the 2008-2009 auto industry bailouts that saved approximately 1.9 million jobs at General Motors, Chrysler, and their suppliers, demonstrating that temporary government ownership can preserve critical industrial capacity during challenging periods. The Reconstruction Finance Corporation during the Great Depression similarly took preferred shares in banks, helping stabilize the financial system while maintaining private operations.\nThe revenue-sharing model with companies like Nvidia and AMD, where the government takes a 15% cut of China sales in exchange for export licenses, provides a mechanism to monetize strategic trade decisions while maintaining national security controls[2][4]. This approach allows companies to access restricted markets while generating government revenue that could fund broader technological competitiveness initiatives."
    },
    {
      "url": "https://apnews.com/article/biden-science-technology-united-states-economy-2fa651c540c9869890dfe670bcdcb7ea",
      "text": "Congress OKs bill to aid computer chip firms, counter China\nCongress OKs bill to aid computer chip firms, counter China\nWASHINGTON (AP) — The House on Thursday passed a $280 billion package to boost the semiconductor industry and scientific research in a bid to create more high-tech jobs in the United States and help it better compete with international rivals, namely China.\nThe House approved the bill by a solid margin of 243-187, sending the measure to President Joe Biden to be signed into law and providing the White House with a major domestic policy victory. Twenty-four Republicans voted for the legislation.\n“Today, the House passed a bill that will make cars cheaper, appliances cheaper, and computers cheaper,” Biden said. “It will lower the costs of every day goods. And it will create high-paying manufacturing jobs across the country and strengthen U.S. leadership in the industries of the future at the same time.”\nAs the vote was taking place, Biden was discussing the economy with CEOs at the White House. During the event, he was handed a note informing him it was clear the bill would pass — a development that produced a round of applause before the tally was final.\nRepublicans argued the government should not spend billions to subsidize the semiconductor industry and GOP leadership in the House recommended a vote against the bill, telling members the plan would provide enormous subsidies and tax credits “to a specific industry that does not need additional government handouts.”\nRep. Guy Reschenthaler, R-Pa., said the way to help the industry would be through tax cuts and easing federal regulations, “not by picking winners and losers” with subsidies — an approach that Rep. Joseph Morelle, D-N.Y., said was too narrow.\n“This affects every industry in the United States,” Morelle said. “Take, for example, General Motors announcing they have 95,000 automobiles awaiting chips. So, you want to increase the supply of goods to people and help bring down inflation? This is about increasing the supply of goods all over the United States in every single industry.”\nSome Republicans viewed passing the legislation as important for national security. Rep. Michael McCaul, the top Republican on the House Foreign Affairs Committee, said it was critical to protect semiconductor capacity in the U.S. and that the country was too reliant on Taiwan for the most advanced chips. That could prove to be a major vulnerability should China try to take over the self-governing island that Beijing views as a breakaway province\n“I’ve got a unique insight in this. I get the classified briefing. Not all these members do,” McCaul said. “This is vitally important for our national security.”\nThe bill provides more than $52 billion in grants and other incentives for the semiconductor industry as well as a 25% tax credit for those companies that invest in chip plants in the U.S. It calls for increased spending on various research programs that would total about $200 billion over 10 years, according to the Congressional Budget Office.\nThe CBO also projected that the bill would increase deficits by about $79 billion over the coming decade.\nA late development in the Senate — progress announced by Wednesday night by Democrats on a $739 billion health and climate change package — threatened to make it harder for supporters to get the semiconductor bill over the finish line, based on concerns about government spending that GOP lawmakers said would fuel inflation.\nRep. Frank Lucas, R-Okla., said he was “disgusted” by the turn of events.\nDespite bipartisan support for the research initiatives, “regrettably, and it’s more regrettably than you can possibly imagine, I will not be casting my vote for the CHIPS and Science Act today,” Lucas said.\nRep. Kevin McCarthy, the Republican leader in the House, likened the bill’s spending to “corporate welfare to be handed out to whoever President Biden wants.”\nLeading into the vote, it was unclear whether any House Democrats would join with Sen. Bernie Sanders, I-Vt., in voting against the bill; in the end, none did.\nCommerce Secretary Gina Raimondo talked to several of the most progressive members of the Democratic caucus in a meeting before the vote, emphasizing that the proposal was a critical part of the president’s agenda and that Democrats needed to step up for him at this important moment.\nSome Republicans criticized the bill as not tough enough on China, and GOP leaders emphasized that point in recommending a “no” vote. Their guidance acknowledged the threat China poses to supply chains in the U.S., but said the package “will not effectively address that important challenge.”\nBut, as McCaul pointed out, China opposed the measure and worked against it. The bill includes a provision that prohibits any semiconductor company receiving financial help through the bill from supporting the manufacture of advanced chips in China.\nZhao Lijian, a Chinese foreign ministry spokesman, commenting before the House vote, said the U.S. “should not put in place obstacles for normal science, technology and people-to-people exchanges and cooperation” and “still less should it take away or undermine China’s legitimate rights to development.”\n___\nAssociated Press video producer Liu Zheng in Beijing and AP writer Zeke Miller contributed to this report."
    }
  ],
  "argos_summary": "President Trump announced that the U.S. government has secured a 10% stake in Intel by converting $11.1 billion of CHIPS Act funds into 433.3 million non‑voting shares, giving the government a paper gain of about $1.9 billion. The move, made while Intel is cutting 20,000 jobs and struggling under CEO Lip‑Bu Tan, has drawn criticism for blurring public‑private lines and potentially giving the administration leverage over a major tech company. Trump’s action follows a broader push to keep chip manufacturing in the U.S., including a 15% revenue‑sharing deal with Nvidia and AMD for sales to China, and contrasts with past government bailouts such as the 2009 GM rescue. The deal has sparked debate over the appropriateness of government equity holdings in private firms and the risks of political influence on corporate strategy.",
  "argos_id": "VFKZAGZL4"
}