{
  "url": "https://www.bloomberg.com/news/videos/2025-08-19/spain-fm-albares-on-commitment-to-european-security-video?srnd=phx-markets",
  "authorsByline": "bn",
  "articleId": "a9571eed487c4fcb9580bd96c005539d",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iyzygtlc2qcg/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-19T09:39:53.884000+00:00",
  "addDate": "2025-08-19T09:52:05.391979+00:00",
  "refreshDate": "2025-08-19T09:52:05.391981+00:00",
  "score": 1.0,
  "title": "Spain Foreign Minister José Albares on Commitment to Europe’s Security",
  "description": "\"We are an important part of backing Ukraine's sovereignty\" says José Albares, Spain's Minister for Foreign Affairs. He joins Bloomberg TV on the White House Summit between US President Donald Trump, Ukrainian President Volodymyr Zelenskiy and several European Leaders. (Source: Bloomberg)",
  "content": "Not directly represented at that meeting yesterday, although under the EU umbrella, I suppose, represented there. What did you make of the conclusions so far from those meetings at the White House? And I'm just underline for us why it was that Spain was not in attendance. Spain is part of the coalition of the willing. Today at noon here in Europe, we will be joining and we are a very bold on board in backing Ukraine's sovereignty. Yesterday was discussing with the vice prime minister of Ukraine about European integration. President Sanchez is in full contact with President Zelensky and we are committed to back Ukraine as long as it take. Yesterday, we saw President Zelensky back by Europeans leaders in the White House talking about peace. And any conversation about peace is welcome. But we must be talking, always giving the same content to the war, peace, a just and lasting peace, a peace that will not be just a parenthesis between two wars. That's why we need a ceasefire. First of all, to make sure that we stop the killing of people. And then we will want to see Russia that is giving no sign of being in good faith, engage in real conversation for a just and lasting peace. Yes, we've seen some in other European countries calling for that cease fire. But President Trump doesn't seem minded to go in that direction. Just sticking with this theme of why Spain was not in attendance. Does it have anything to do with the way that Spain stood apart from other European nations, that NATO's meeting and didn't quite commit to the level of NATO's spending that the United States wanted to see? We haven't got any signs of of do things being related because Spain is a very committed ally. We have a historical deployment of troops in the eastern flank of of Natal with 3000 soldiers, tanks, aeroplanes. We are an integral part of the security of the Baltic countries. We are present in countries like Slovakia. Before in Romania we have a Patriot battery deploy in Turkey, another need to our allies and we have been since the very beginning, part of the financial, humanitarian and military equipment effort to Ukraine. So I think that the commitment of a Spain to Europe like this security is out of question. And we in the last meeting we assembled with are a lower percentage than 5%. We could meet all the objectives, all the targets that we had to meet, both in capacities and in joining the Euro-Atlantic security. So I think both things are not related. There are many other Europeans leaders that were not present, for instance, the current presidency of the European Union, the president of Denmark. Minister, good morning. If the requirement was that Europe needed to put troops boots on the ground in Ukraine, would Spain be providing some of those boots, some of those troops? I don't like to make political fiction. The reality today is that Russia has not given Egypt any sign that once a real peace. I want to see, first of all, if that Zelensky Putin meeting becomes concrete, if they can agree on a ceasefire and work towards a real peace. So there are a lot of things to talk, including, sure, security guarantees and that what we should be focusing today and not in future scenarios doesn't exist. The reality of how far would is that Russia continues to wage a war, an unjustified war against Ukraine. How far would Spain be prepared to go in providing security guarantees for Ukraine? Was that were there to be a ceasefire or peace? How far would your country be prepared to go to guarantee Ukraine's security? We have been giving all the support that Ukraine has been asking for and request in so far. Military equipment of all sorts, financial assistance, humanitarian assistance with 200,000 Ukrainian refugees in our soil. Accession talks for joining European Union were opened during our European Union presidency. So we are on all sides helping Ukraine to defend variety and its territorial integrity. Would would Article five like guarantees be acceptable to Spain? Article five is not something that is on the table right now. The best security guarantee for Ukraine so far today, talking with the reality on the ground is to reinforce the Ukrainian army, because that's what's providing today safety. So the reality, freedom for Ukraine and that's what we are doing, providing military equipment to make sure that the Ukrainian army is capable of guaranteeing sovereignty and territorial integrity for Ukraine. If Spain were to be Pardes minister of these forces, or support efforts to try and provide security for Ukraine, what role would Europe require the US to play? I think we are both allies in Europe. Atlantic security and the security of Europe is directly at stake in this war in Ukraine. That's very clear. What will be the future of Ukraine? It's also what will be the future of Europe. And we have to be together. Europeans and the United States, since the very beginning of this war, of aggression of Russia to Ukraine. So what I expect is that these continue in the same path, both of us being together to make peace and to give security guarantees to Ukraine, to make sure that this is not just a break between two wars, but a real just and lasting peace, because the security of Europe and therefore the Euro-Atlantic security is at the stake. Minister, I know that the domestic attention in Spain is very much on the wildfires that are taking place there in Spain and during one of its worst fire crises in its history, I am told. Can you give us any kind of update as to when you expect these wildfires to be under control? This is a terrible situation right now in Spain with 40 fires that are active in different parts of the country. And I really want to to to to have a thought for those that have lost their lives. The government is doing everything that is in our hand. We have thousands of people deployed fighting against this fire. And I want to thank all those countries, seven countries so far from the European mechanism of civil assistance that are joining with their capacities to fight against this fire. The president today will be visiting some of those places, unfortunately. These there are many reasons for these. But climate emergency is very much related to this. This is not something that affects only Spain. We see right now several countries in Europe. And every year we have the same type of fire. That's why the president has proposed to all political forces a big estate agreement to prevent to reinforce the capacities and to do as much as we can against this climate emergency. We need prevention to make sure that this is the last time we see this sort of fires. Minister, you started the conversation talking about the fact that Spain does not need to increase its defense spending because it can meet the capabilities that are required of it with current amounts of money being deployed. If we start seeing Spain using its military, though, to deal with wildfires and the environmental catastrophe, can we still argue that Spain is spending enough to be able to meet all its commitments, including fighting wildfires, and deliver everything at the same time with the current budget? We will do it and we are proving that we will do it. We have a European mechanism today is a Spain that is receiving that's help from several European countries. But during many summers in the past it has been a Spain put in its capacities because we have a big capacity. We are a south, a country with high peaks of of heat. Therefore, we have big capacities to fight against fire with with aeroplanes and with different equipment that we have been lending to to other countries. So you can be sure that the Spain will meet all the targets, both the security targets that are earmarked. But Natal, we are a very committed and reliable ally and we are proving it with our historical deployment in the eastern flank, both with soldiers on the ground 3000, but also with equipment of all sorts. And at the same time, we have to make sure that this is the last time we see this type of fire. That's why we have proposed to all political forces in Spain this big a state national agreement to increase the capabilities and to increase the prevention even more than we have been doing in so far.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Spain",
      "weight": 0.08849083
    },
    {
      "name": "Spain Foreign Minister José Albares",
      "weight": 0.0772021
    },
    {
      "name": "other European countries",
      "weight": 0.072739884
    },
    {
      "name": "security guarantees",
      "weight": 0.07263349
    },
    {
      "name": "Ukraine",
      "weight": 0.07079732
    },
    {
      "name": "several European countries",
      "weight": 0.06798523
    },
    {
      "name": "other countries",
      "weight": 0.06594709
    },
    {
      "name": "Atlantic security",
      "weight": 0.06380963
    },
    {
      "name": "security",
      "weight": 0.06294499
    },
    {
      "name": "several countries",
      "weight": 0.05963231
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9951171875
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.93017578125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.92333984375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.86767578125
    }
  ],
  "sentiment": {
    "positive": 0.10777845,
    "negative": 0.5292105,
    "neutral": 0.36301103
  },
  "summary": "Spain's Foreign Minister, José Albares, has stated that Spain is committed to supporting Ukraine as long as it takes. He also addressed the need for a ceasefire and for Russia to engage in real conversation for a just and lasting peace. Spain is part of the coalition of the willing and has deployed troops in the eastern flank of of Natal and is an integral part of Ukraine's security of the Baltic countries. However, Albares stated that the commitment to Europe like this security is out of question due to Russia's ongoing war against Ukraine. He suggested that Spain could meet all the objectives, all the targets and in joining the Euro-Atlantic security. He stressed that the future of Ukraine and Europe's security role will depend on the United States and the European Union's ability to support Ukraine.",
  "shortSummary": "Spain's Foreign Minister José Albares discusses Spain's commitment to European security and Ukraine's sovereignty, emphasizing the need for peace and cooperation to prevent conflict.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "39e0ce3df3ff442aa6baa5fdd93d3226",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The Spanish minister highlighted Spain’s strong commitment to Ukraine, noting military, financial and humanitarian support and stressing the need for a ceasefire and lasting peace. He explained Spain’s absence at a recent White House meeting was unrelated to its NATO spending and reaffirmed Spain’s willingness to reinforce Ukraine’s army and provide security guarantees. The minister also addressed the severe wildfires in Spain, describing extensive firefighting efforts, international aid, and a proposed national agreement to improve prevention and climate resilience. He concluded that Spain’s current defense budget is sufficient to meet both its security commitments and domestic emergency responses.",
  "argos_id": "VL8L978A3"
}