{
  "url": "https://www.nytimes.com/athletic/6568993/2025/08/25/garnacho-jackson-zinchenko-and-the-other-players-premier-league-clubs-are-trying-to-transfer/",
  "authorsByline": "Dan Sheldon",
  "articleId": "7edcdd45952f43d8905ec0758f77eed6",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/22074344/GARNACHOJACKSON.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T04:06:56+00:00",
  "addDate": "2025-08-25T04:58:59.650745+00:00",
  "refreshDate": "2025-08-25T04:58:59.650750+00:00",
  "score": 1.0,
  "title": "Garnacho, Jackson, Zinchenko and the other players Premier League clubs are trying to transfer",
  "description": "Billions have been spent but moving unwanted players on is now a necessity for many clubs before a transfer window closes",
  "content": "More than £2billion has been spent by Premier League sides this summer, and that figure will go up before the transfer window closes next Monday — September 1.\n\nAs clubs scramble around to complete their incomings, it can be easy to forget about the players they need to offload, not only to balance the books but because they are surplus to requirements.\n\nThe ‘bomb squad’ is a term given to senior players who no longer have a future at their club, and it can be a lonely existence — especially if they are training away from their first-team colleagues.\n\nAt Manchester United, for example, Alejandro Garnacho, Jadon Sancho, Tyrell Malacia and Antony have not made Ruben Amorim’s final cut and so are in need of a move. Marcus Rashford was part of that contingent too, but has now been loaned to Barcelona for the season.\n\nUncertainty surrounding a player’s future is replicated throughout the Premier League, whether it is at Arsenal and Chelsea, or Liverpool and Sunderland — trimming the squad is becoming a necessity.\n\nA club who appear to enjoy player trading more than any other are Chelsea.\n\nEnzo Maresca, the head coach, used his pre-match press conference on Thursday to announce that Nicolas Jackson and Christopher Nkunku were not going to be part of his squad for the following evening’s Premier League trip to West Ham United, even though both strikers were available for selection.\n\nDespite Nkunku having just under four years remaining on his contract and Jackson’s deal not expiring until 2033, they are for sale. Jackson is attracting interest from within the Premier League, and Nkunku is being targeted by RB Leipzig of Germany, the club he left for Chelsea two years ago.\n\nIn June, more than 10 Chelsea players reported for training at the club’s Cobham base, south of London, knowing they were surplus to requirements. They included Joao Felix, Ben Chilwell, Lesley Ugochukwu, Djordje Petrovic, Axel Disasi, Armando Broja, Renato Veiga and Alfie Gilchrist. Former England winger Raheem Sterling has been training away from the first-team group.\n\nWhile Chelsea have secured sales for Joao Felix (Al Nassr), Petrovic (Bournemouth), Ugochukwu, Broja (both Burnley) and Veiga (Villarreal), they are yet to shift Disasi, Sterling and Chilwell. David Datro Fofana and Tyrique George may leave, while Carney Chukwuemeka is closing in on a move to Borussia Dortmund.\n\nSterling and Chilwell have two years remaining on high-salary contracts and Chelsea’s preference would be to sell, although they could also send them out on loan, as happened with both players last season, then try again to offload them next year when their values will have reduced even further.\n\nAmorim is in the same boat as Maresca in terms of wanting rid of certain players, although one of his bomb squad — Garnacho — may end up at Stamford Bridge.\n\nThe Manchester United head coach has decided Garnacho, Sancho, Malacia and Antony are not part of his plans, so it is incumbent on the club to find a way to sell them. Amorim has said that he would reintegrate them into his plans if United are unable to secure the transfer fees they want. However, as the deadline looms, buying clubs know they have a better chance of securing a more favourable deal.\n\nIt has become clear that Rasmus Hojlund faces an uncertain future at Old Trafford after Amorim left him out of United’s Premier League squad for the Arsenal and Fulham matches.\n\nArsenal are keen to balance their squad by trying to offload several players, including Oleksandr Zinchenko, Albert Sambi Lokonga, Reiss Nelson, Fabio Vieira. Their need for sales is more to do with manager Mikel Arteta wanting to balance the squad than a late push to comply with the Premier League’s profitability and sustainability rules (PSR). Karl Hein, Arsenal’s reserve goalkeeper has joined Werder Bremen on loan for the season, but there are still plenty of outgoings required at the Emirates.\n\nUp the road in north London at Tottenham Hotspur, the issue this summer has been signing their targets as opposed to selling players.\n\nYves Bissouma looks the most likely to leave the Europa League champions, due to only having one year remaining on his contract and the fact Thomas Frank, their new head coach, left the midfielder out of his squad for the recent UEFA Super Cup game against Paris Saint-Germain as a punishment for poor timekeeping. Another player Spurs could look to move on, even though he is currently recovering from injury, is winger Manor Solomon.\n\nChampions Liverpool are leading the way in terms of expenditure this summer — their total outlay is north of £300million — but have been selling plenty of players too, with Darwin Nunez (Al Hilal), Luis Diaz (Bayern Munich), Jarell Quansah (Bayer Leverkusen) and Ben Doak (Bournemouth) leaving.\n\nThey even persuaded Real Madrid to pay a £10m fee for Trent Alexander-Arnold so he could play for his new team in the Club World Cup in June, despite the right-back’s Anfield contract expiring barely a month later. Another Liverpool are trying to move on is Kostas Tsimikas, with the Greece left-back wanting to join a club where he can play regular European football rather than risk watching it from Arne Slot’s bench.\n\nFollowing the return of James Trafford to the club after two seasons with Burnley, there is a chance that Manchester City’s backup goalkeeper Stefan Ortega will be allowed to move on. Manager Pep Guardiola has spoken about the importance of trimming his squad, and they are working on that.\n\nEderson, who has been City’s No 1 since his arrival in 2017, and defender Manuel Akanji, could both leave too, but City are not actively seeking to move them on.\n\nNewcastle United, going through a tumultuous summer with the Alexander Isak saga rumbling on, have made full-backs Matt Targett and Harrison Ashby available. Long-serving centre-back Jamaal Lascelles could depart St James’ Park.\n\nTheir fierce local rivals Sunderland don’t need to sell for PSR reasons following promotion back to the Premier League but are keen to offload Luis Semedo, Ian Poveda, Jay Matete, Abdoullah Ba and Nazariy Rusyn. All five know they can leave: in true bomb-squad fashion, they have not been given squad numbers this season.\n\nWolves’ Fabio Silva, whose arrival in 2020 was a club-record £35million deal, has been sent out on loan in each of the past three seasons, and with only a year left on his contract, they are working to move the Portuguese forward on again.\n\nTalking of flops, Nottingham Forest’s £10million signing of striker Emmanuel Dennis in August 2022 has been a big-time failure, with only two league goals in his 19 appearances. They are trying to shift him once more, after loaning Dennis out three times in two seasons. Omar Richards is yet to make a first-team appearance since joining Forest in that same summer window three years ago and falls into the category of players they are looking to sell, although there is a small chance he could be kept on as emergency full-back cover. David Carmo and Josh Bowler — remember them? — are available too.\n\nMeanwhile, at Crystal Palace, Marc Guehi is in the curious position of being considered indispensable by his manager Oliver Glasner — who has played him in every match for the club this season — but available for sale by chairman Steve Parish, who is concerned at the prospect of losing the England centre-half for nothing next summer when his contract expires. Liverpool are Guehi’s biggest suitors but a deal remains a distant prospect.\n\nPremier League clubs will no doubt continue spending money over the next eight days, but you can be sure they’re working just as hard to ensure unwanted players are packing their bags too.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6399330/2025/08/24/carney-chukwuemeka-aaron-anselmino-transfers-borussia-dortmund-chelsea/",
    "https://www.nytimes.com/athletic/6561186/2025/08/24/alexander-isak-physical-impact-training-alone/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Premier League clubs",
      "weight": 0.08452509
    },
    {
      "name": "Premier League",
      "weight": 0.07153436
    },
    {
      "name": "Premier League sides",
      "weight": 0.06790894
    },
    {
      "name": "players",
      "weight": 0.06145965
    },
    {
      "name": "unwanted players",
      "weight": 0.061427947
    },
    {
      "name": "clubs",
      "weight": 0.061393626
    },
    {
      "name": "several players",
      "weight": 0.06092662
    },
    {
      "name": "certain players",
      "weight": 0.060907397
    },
    {
      "name": "senior players",
      "weight": 0.06080724
    },
    {
      "name": "buying clubs",
      "weight": 0.060745567
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98193359375
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.97314453125
    }
  ],
  "sentiment": {
    "positive": 0.08488858,
    "negative": 0.43746126,
    "neutral": 0.47765023
  },
  "summary": "The number of players being sold by Premier League clubs is expected to increase before the transfer window closes on September 1. Players deemed surplus to requirements include Alejandro Garnacho, Jadon Sancho, Tyrell Malacia and Antony, who have not made Ruben Amorim's final cut for Manchester United. Chelsea, however, have been selling several players, including Joao Felix, Ben Chilwell, Lesley Ugochukwu, Djordje Petrovic, Axel Disasi, Armando Broja, Renato Veiga and Alfie Gilchrist. Manchester United's head coach, Enzo Maresca, announced that Nicolas Jackson and Christopher Nkunku were not going to be part of his squad for the upcoming Premier League match against West Ham United, despite both strikers being available for selection. The club is also facing interest from within the Premier League, and Nikunku is being targeted by RB Leipzig of Germany.",
  "shortSummary": "Premier League clubs are prioritizing player transfer targets like Manchester United's Garnacho, Chelsea's Nkunku, and Arsenal’s Vieira to balance their books.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "dc332f8cf10c422086c115486475e898",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6399330/2025/08/24/carney-chukwuemeka-aaron-anselmino-transfers-borussia-dortmund-chelsea/",
      "text": "Borussia Dortmund are closing in on agreements to sign Chelsea pair Carney Chukwuemeka and Aaron Anselmino.\nChukwuemeka is due to join the German club on a permanent deal, while Anselmino, 20, is set for a season-long loan – which does not include an option nor obligation to buy.\nThe duo have been given permission to travel to Germany to complete their moves.\nAdvertisement\nThe transfer would see Chukwuemeka return to the club where he spent the second half of the 2024-25 season on loan.\nThe 21-year-old signed a six-year contract at Chelsea in 2022 after moving from Aston Villa, before joining Dortmund in February 2025. He played in 10 Bundesliga matches, winning eight of them and scoring once.\nIn the first half of last season, he made five appearances in the Conference League and Carabao Cup for Chelsea.\nThe midfielder’s original loan agreement had him return to parent club Chelsea on June 30, but it was extended to cover the duration of the Club World Cup. He played four matches during the tournament in the United States, with Dortmund losing in the quarter-final to Real Madrid.\nChukwuemeka has played 23 times for England at youth level and appeared once in the 2023 Under-20 World Cup.\nAnselmino joined the London club from Boca Juniors in August 2024 for a fee in the region of £17million. He went immediately back on loan to his boyhood club but was recalled by Chelsea in January.\nThe Argentinean defender was training with the first team and remained with the side until the end of the season but only played twice, once with the Under-21 side and once as a substitute during the Club World Cup which they won.\nHe has had three hamstring injuries over the past two seasons which has impacted his playing time, the most significant of which came in February after his return to Stamford Bridge.\nAnselmino made 23 senior appearances for Boca Juniors, scoring twice and registering three assists.\nDortmund finished the 2024-25 campaign with a run of five consecutive victories, and they qualified for the Champions League on the final day of the Bundesliga season due to Freiburg’s defeat to Eintracht Frankfurt.\n‘Chukwuemeka can become a superstar’\nAnalysis by German football correspondent Sebastian Stafford-Bloor\nAdvertisement\nA rollercoaster of a saga.\nDortmund were taken with Chukwuemeka’s ability from the moment of his arrival in January, but his durability was a concern and at the original asking price — close to €50million — it would have been far too much of a risk for a player whose minutes were limited and who missed six Bundesliga games in the second half of the season alone.\nBut this renegotiation suits all parties. Dortmund desperately need another chance creator in their side to lessen the burden on Julian Brandt and Chukwuemeka’s vision and ball-carrying — and in his strength and skill in possession — will solve that problem many times over and add a new dimension to Niko Kovac’s midfield.\nIn addition, part of the club’s focus this summer has been on recruiting players who can improve (and appreciate in value), which has long been held up as part of the Dortmund brand but has been in retreat for a few years now.\nJamie Gittens was sold for a lot of money this summer, as was Jude Bellingham two years before, but big sales and healthy profits have been scarce aside from those highlights.\nThe hope will be for Chukwuemeka to correct that trend. With his talent there’s no question that he can become a superstar in the Bundesliga and become one of the most valuable players in Germany. He just needs momentum, though, and to find a rhythm that has so far eluded him during his career.\n(Photo: Maja Hitij/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6561186/2025/08/24/alexander-isak-physical-impact-training-alone/",
      "text": "As the transfer saga of the summer goes on, the player at the centre of it is left with one task: keep himself as fit as possible so that when a resolution is eventually found, he’s ready to go — no matter what shirt he’s wearing.\nBut there’s just one hitch. For the past month or so, Newcastle United’s Alexander Isak has been training alone.\nAdvertisement\nFootballers are used to being part of a pack. They spend large parts of their time surrounded by team-mates, support staff and coaches. Training sessions are competitive and intense, designed to get the best out of players and prepare them for the heat of battle in the Premier League. When that scenario is taken away from them, it is bound to have an impact.\nSo, from a physical standpoint, what does that look like for a footballer who might spend weeks or even months training solo?\nThe first thing to note is that the FA has one key rule regarding how clubs have to treat players who are training alone. Whether that is because they are on the brink of a transfer elsewhere or for disciplinary reasons, they have to be provided with a first-team coach to train them each day.\nIt could be one of the fitness coaches as opposed to a football coach; it just has to be someone associated with the first team.\nClubs are not under any obligation to allow them to train at a particular time, though. It is not unheard of for a club that is keen to ease a player out to schedule their sessions at 5pm, so the rest of the team has been and gone. They might ban them from the dressing room and restaurant, too; tactics that are designed to make life as uncomfortable as possible for the player and force the move.\nThat is not the case for every player training solo. Some are players the club would much rather hang on to, if they could.\nOne thing that is true for most players in the top flight now is that they have private support teams around them who keep them in shape even when they are not with their clubs. The days of footballers spending long summers on the beach losing their fitness are long gone. Now, they are more likely to be found working away in gyms and on training pitches around the world, ensuring they return to their clubs for pre-season in good shape.\nAdvertisement\nSometimes they might team up with other players for those off-season training blocks, but some will work solo, in a similar scenario to that of players who are made to train alone once a season is under way.\n“We now live in a world where players are physically and physiologically fit when they report back for pre-season,” says sports scientist Chris Barnes, who has spent time working at Middlesbrough, West Bromwich Albion and Nottingham Forest and has been a consultant for UEFA for the past seven years.\n“The purpose of pre-season, then, is to transition that physical fitness into football fitness with the introduction of the ball and working with their team-mates. Team training is very different to individual football training, which is very different to individual physical and physiological training.”\nBryan Mbeumo trained in the gym at Brentford before moving to Manchester United and performance scientist Andrew Wiseman considers there to be three subsections beneath the umbrella term of “fitness”: “You have ‘fitness’, you have ‘fitness but poorly conditioned’ and then you have ‘fit to play’,” he tells The Athletic.\n“That means you can have general fitness — so you might be able to run 5k in a decent time but that doesn’t mean it’s applicable to the game. Then you get that other level of fitness (that is applicable), but you can’t really execute the skills of the game. Then you get the fit to compete, which is where you want your players to be.”\nWiseman was working for NWSL team Utah Royals during the first Covid lockdown in 2020 and says the challenge of building a training programme for players to do individually that replicates game demands is one that a lot of people discovered during the pandemic. “It certainly made me rethink my individual conditioning of players,” he says.\nAdvertisement\nOne of the hardest areas to replicate, says Wiseman, is accelerations and decelerations.\n“A player might cover 50 or 60 accelerations and decelerations in a game,” he says. “Across a training week, that might be 100-150, depending on how people train. Somehow you’ve got to keep that up (when training alone), but it’s really difficult.”\nThe deceleration component is particularly challenging, he explains. “Ideally, you want them to stop fast, turn quickly, but that can be really difficult without team training.”\nThe drills that are harder on the body are the ones that are executed at a higher velocity, says Wiseman.\n“That might be over 3m/s2. You have to design drills that are going to try to get that within the context of that player and their game. If it’s a wing-back, you can do drills where you work on their high-speed running or sprint distance and put in accelerations and decelerations at the end. But if you’ve got a forward who presses quite a lot, it might shift your focus slightly in terms of what you’re working on.”\nGiven that the 2025-26 season is now under way, the challenge for any player who is working solo is the speed of the transition (when it comes) from individual training into team training and match play — whether that is as part of a new team or after being welcomed back into the fold of their employer. In the former scenario, the pressure is immediately on because everybody wants to have a look at the new signing.\nBut if that transition from training on their own to training and playing with the team isn’t appropriately managed — i.e. they’re thrown straight in — then in certain circumstances that can raise red flags, says Barnes.\nWhy? What exactly is it that they are missing when training solo, even under the guidance of a first-team coach?\n“When you’re working on your own, the majority of work you’re doing will be almost coded and pre-determined when it comes to movement patterns and skills, which is good and really useful,” says Barnes. “But what it doesn’t give you is what’s going on in an environment where you’ve got multiple players trying to play in a system.\n“The amount of information you’re receiving and having to take on board then is much greater. A lot of what you’re doing in the team environment is reacting off that, and reactive movement patterns can often be very different.”\nClubs need to have the confidence to hold these players back, just briefly, from what everybody wants, which is to see them in the shirt, playing in competitive games.\nAdvertisement\nWiseman compares the situation of a player training alone to that of a player returning from injury. In the latter scenario, he says a player would progress from isolated conditioning — which focuses on specific physical components like speed, agility or strength, often in a drill format, without direct relation to game situations — to integrated conditioning, which combines physical training with technical and tactical elements, often in game-like situations i.e. small-sided games or drills with tactical constraints.\nFor a player training alone, not for rehab purposes, he says, “a blend of the isolated and integrated is quite good to follow. You don’t want soft tissue injuries in training, so you have to be able to prepare them, which means understanding what the player needs to be exposed to.”\nInjury risk is something Barnes says increases with any form of transition. “When you join a new club, when a new coach joins your club — all these things are a period of transition and each period of transition does elevate injury risk. That’s why it’s so important that that transition is managed.”\nWhat does it look like, in fitness terms, when a player who has been training individually finally finds their way into a team?\nWiseman says it’s about “sharpness”. “There’s ‘fit’ and ‘match-fit’. Also, the physical demands on a player change based on the playing formation and style. For example, if Isak is going to be played as a target No 9 in a 4-2-3-1, the demands on him will be a lot different to if he plays in a 4-3-3.\nBarnes looks specifically at the physical response of the player during that transition, and the relationship between the work they are doing and how they respond to that physically and physiologically.\n“The way we measure the response, generally speaking, is through heart-rate measurements,” he says. “At the point of introduction to working with a squad again, their heart-rate response will reflect all this additional stress and will be higher.\nAdvertisement\n“If the player is with a new club, they’re going to be keen to impress their new team-mates and their coach — and that’s another contributor to this stress, which will mean that the internal cost of the amount of work they’re doing is increased.\n“Over a period of time — not long, maybe a week or 10 days — it will settle down and an equilibrium will be established. For the same amount of work, they will become more efficient and have a lower heart-rate response.\n“It’s this relationship between what we call the external load (the work they’re doing) and the internal load, which is the body’s response.”\nTraining solo can only take players so far, then. Whatever the next step is for them — whether that is back into the fold of their team or into a new one — there will be gaps in their preparation that can only be filled when they are back training and playing with a team.\n(Top photo: Isak has been training away from Eddie Howe’s squad. Serena Taylor/Newcastle United via Getty Images)"
    }
  ],
  "argos_summary": "Premier League clubs have spent over £2 billion this summer, but many are also trimming squads by selling or loaning surplus players, a process dubbed the ‘bomb squad’. Chelsea, Manchester United, Arsenal, Tottenham, Liverpool, City, Newcastle, Sunderland, Wolves, Forest and Palace are all offloading key names such as Joao Felix, Ben Chilwell, Jadon Sancho, and others to balance books and squad size. Meanwhile, Dortmund is closing deals to bring in Chelsea’s Carney Chukwuemeka and Aaron Anselmino, while the article also discusses the challenges players face when training alone before a transfer. The piece highlights how clubs manage these transitions, the financial pressures of the Premier League’s sustainability rules, and the physical and tactical gaps that arise when players are isolated from team training.",
  "argos_id": "VL8V97VP9"
}