{
  "url": "https://www.bostonglobe.com/2025/08/24/world/peace-talks-ukraine-all-lead-donbas/",
  "authorsByline": "Constant Méheut, Kim Barker",
  "articleId": "749610fdde6346829d0a7a701d54881e",
  "source": {
    "domain": "bostonglobe.com",
    "location": null
  },
  "imageUrl": "https://www.bostonglobe.com/pf/resources/images/logo-bg.jpg?d=571",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T22:11:24.848000+00:00",
  "addDate": "2025-08-24T22:27:10.841496+00:00",
  "refreshDate": "2025-08-24T22:27:10.841498+00:00",
  "score": 1.0,
  "title": "Peace talks in Ukraine all lead to the Donbas",
  "description": "KYIV, Ukraine — For President Trump, the map of Ukraine on an easel in the Oval Office had an obvious message. Russia has taken a big chunk of territory in an eastern region known as the Donbas. That territory, shaded in red, was gone. Ukraine needed to make a deal to get peace, or it risked losing more.",
  "content": "For President Volodymyr Zelensky of Ukraine, the map, displayed at a meeting Monday with the two presidents and European leaders, presented a far more complicated picture. This was not a business deal or a poker game. This was personal.\n\nKYIV — For President Trump, the map of Ukraine on an easel in the Oval Office had an obvious message. Russia has taken a big chunk of territory in an eastern region known as the Donbas. That territory, shaded in red, was gone. Ukraine needed to make a deal to get peace, or it risked losing more.\n\nAway from the cameras, he told Trump that his grandfather had fought in World War II to free the cities of the Donbas from the Nazis. He could not just give it up.\n\nOn Wednesday, hours after he returned to Kyiv, Ukraine’s capital, Zelensky reiterated the point.\n\n“There were many such families” who fought to free the Donbas, Zelensky told reporters. “Many fell and many were wounded. And I explained that this is a particularly painful moment in our history and a particularly painful part of life in Ukraine. It is not as simple as it may appear to some.”\n\nIt is not clear where exactly the recent flurry of diplomacy spearheaded by Trump to end the deadliest war in Europe since World War II will lead. But the Donbas — a mineral-rich territory that consists mainly of two regions, Donetsk and Luhansk — will be at the center of any negotiations.\n\nAlmost the size of West Virginia, the Donbas is where much of this war has been fought. Tens of thousands of soldiers on both sides have died there for the smallest of gains. Russia is now trying to seize the last 2,500 square miles of the Donbas still under Ukrainian control.\n\nPresident Vladimir Putin of Russia has demanded that Ukraine give up all of the Donbas. His demand includes even the part run by Kyiv, where more than 200,000 Ukrainians live in cities like Kramatorsk and Sloviansk, places Zelensky’s grandfather fought to defend.\n\nFor years, Putin has tried to use the Donbas to manipulate the Ukrainian government. Before invading, he exploited a Russian-backed insurgency in the region as a wedge against Ukraine’s hopes to join Western organizations like NATO. And now, in the fourth year of this war, he wants to not just seize the Donbas, but to use it to politically torpedo Zelensky, analysts said.\n\nMost Ukrainians still oppose ceding any territory to Russia, polls show, and the Ukrainian Constitution prohibits surrendering it. Zelensky faces the choice of either supporting something unpopular with Ukrainians or risking Trump’s ire.\n\n“It is a poison pill,” said Vadym Prystaiko, a former foreign affairs minister. “Ukraine will have to swallow it and then we’ll see how Ukraine will digest it.”\n\nZelensky has avoided questions from journalists about whether he would give up land, saying he could discuss this issue only with Putin, who has not yet agreed to meet him.\n\nFormer Ukrainian officials and political analysts said the only way Zelensky could convince Ukrainians to cede territory would be to deliver an American-backed security guarantee. That has eluded Ukraine since Trump ruled out NATO membership.\n\nBut the guarantee would have to be strong, with some mixture of European troops and US air support, for example, that would deter Russia from future attacks.\n\nBalazs Jarabik, a former political adviser for the European Union in Kyiv, said Ukraine may have reached a point where it could accept ceding territory “for a peace deal which brings Western security guarantees for Ukraine.” He added, “If in exchange, it should get rid of the Donbas, I think it would.”\n\nThe Donbas used to be seen as a pro-Russian backwater. Many of the 6.7 million residents spoke only Russian and no Ukrainian, and 9 out of 10 people voted for a pro-Russian president, Viktor Yanukovych, in 2010.\n\nWhen pro-European protests forced Yanukovych to resign in early 2014, Russia reacted swiftly. First it seized the Crimean Peninsula. Then it fomented separatist movements, which, with the help of Russian troops, seized a third of the Donbas in a low-scale conflict that foreshadowed the current war.\n\nUkraine’s government considered granting self-government to certain areas of the Donbas to settle the conflict after a peace accord negotiated in February 2015 in Belarus, although Putin wanted any autonomous Donbas to have veto power over Kyiv, especially over its hopes to join NATO.\n\n“The point was to turn Ukraine into a country which could not exercise its full sovereignty, especially when it came to its foreign policy,” said Harry Nedelcu, a senior director at Rasmussen Global, a research organization.\n\nAs negotiations dragged on, Zelensky, a political novice, ran for Ukrainian president in 2019 on the promise of bringing peace with Russia.\n\nZelensky won. Back then, he was open to the idea of a compromise and granting “special status” to the Donbas region. He thought he could make a deal to end the war at a peace summit in Paris with Putin in December 2019. But at home, he faced political pressure to avoid any deal that would relinquish Ukrainian control over the Donbas.\n\n“It seemed like you could get along” with the Russians, said Ihor Novikov, a presidential adviser at the time, noting that Moscow had agreed to prisoner swaps and seemed interested in negotiating.\n\n“As soon as that meeting in Paris happened, I think Zelensky was actually the first person to realize that you can’t make a deal with Russia,” he said. “And he did a U-turn in Paris, and it angered Putin.”\n\nIn February 2022, Russia began its full-scale invasion of Ukraine, chewing up cities in the Donbas and driving millions from their homes. Shocked by the invasion, Zelenskyy appeared to reconsider granting some form of autonomy to the Donbas.\n\n“We can discuss and find a compromise on how these territories will live on,” he told ABC News a week into the invasion.\n\nBut after Ukrainian troops pushed back Russian forces, and after mass slaughters of Ukrainian civilians became public, his views changed again. He pushed for Ukraine to reclaim the Donbas, even the parts Russia had seized before the invasion.\n\nAs Russia pushed on the battlefield, Zelensky for the first time last fall talked about the idea of temporarily ceding occupied territory to Russia in exchange for the security guarantee of joining NATO.\n\nBut in a win for Zelensky, Trump said last week that the United States would participate in security guarantees for Ukraine. Marco Rubio, the US secretary of state and national security adviser, is leading efforts to work out the details.\n\nWhether Russia would accept such guarantees is the real question. Ukraine wants NATO-like protections, but Russia started the war in the Donbas a decade ago in part to block Kyiv’s path to NATO. Why would Russia allow serious security guarantees now?\n\n“So basically, we’re back to square one,” said Nedelcu, the analyst from Rasmussen Global. Unless a change is forced on Putin, he said, “nothing will happen” with the peace talks in the near future. Instead, he added, “I see more fighting happening.”\n\nThis article originally appeared in The New York Times.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/2025/08/24/world/europe/russia-ukraine-donbas-peace-talks-putin-trump-zelensky.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Donbas",
      "weight": 0.077603325
    },
    {
      "name": "Ukraine",
      "weight": 0.0703107
    },
    {
      "name": "Russia",
      "weight": 0.066270985
    },
    {
      "name": "Zelensky",
      "weight": 0.06250618
    },
    {
      "name": "Volodymyr Zelensky",
      "weight": 0.061529838
    },
    {
      "name": "President Volodymyr Zelensky",
      "weight": 0.060867522
    },
    {
      "name": "security guarantees",
      "weight": 0.058906008
    },
    {
      "name": "Western security guarantees",
      "weight": 0.058786638
    },
    {
      "name": "occupied territory",
      "weight": 0.057738658
    },
    {
      "name": "territory",
      "weight": 0.057154413
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9921875
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.95263671875
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.892578125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.88720703125
    },
    {
      "name": "/News/World News",
      "score": 0.818359375
    }
  ],
  "sentiment": {
    "positive": 0.04412489,
    "negative": 0.74923694,
    "neutral": 0.20663817
  },
  "summary": "Ukraine's President, Volodymyr Zelensky, has stated that Ukraine needs to make a deal to secure peace in the Donbas, an eastern region where Russia has taken a significant portion of territory. This comes as Vladimir Putin of Russia has demanded that Ukraine give up all of the region, including the part run by Kyiv. Most Ukrainians still oppose ceding any territory to Russia, and the Ukrainian Constitution prohibits surrendering it. The only way Zelenski could convince Ukrainians to cede territory is to deliver an American-backed security guarantee. Analysts suggest that Ukraine may accept ceding territory for a peace deal that includes Western security guarantees for Ukraine.",
  "shortSummary": "Ukraine’s President Volodymyr Zelensky emphasized the importance of securing Ukrainian territory in the Donbas to secure peace with Russia, which Russia seeks to manipulate Ukraine's government.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "483f54d950ca4c3483dd458e17caeef5",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "President Zelensky faces pressure to cede the Donbas amid Trump‑led diplomacy, but most Ukrainians oppose giving up territory and the constitution forbids it. Trump has signaled a willingness to provide a NATO‑style security guarantee, but Russia demands the entire Donbas and would likely reject such guarantees. Zelensky has oscillated between seeking autonomy for the region and insisting on reclaiming it, while analysts warn that without strong Western guarantees the conflict will continue.",
  "argos_id": "VOA99WI2V"
}