{
  "url": "https://finance.yahoo.com/news/failed-nuclear-power-vote-adds-132039902.html?_guc_consent_skip=1756098230",
  "authorsByline": "Linda Lew and Yian Lee",
  "articleId": "040e9b3383a4449f81774af34b03d14d",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/bloomberg_holding_pen_162/ea7cf97f3147a754253e2ee17277c143",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T04:16:13+00:00",
  "addDate": "2025-08-25T05:05:26.174941+00:00",
  "refreshDate": "2025-08-25T05:05:26.174942+00:00",
  "score": 1.0,
  "title": "Failed Nuclear Vote Leaves Taiwan in an Energy Conundrum",
  "description": "The upshot is a defeat that, according to analysts like William Yang at the International Crisis Group, still sends a significant message on changing public perceptions.  “This result, even though it falls short of the legal threshold, showcases the gap between the government’s preferred policy line and the public opinion,” Yang said.",
  "content": "(Bloomberg) — The failure of a weekend vote to restart a key nuclear plant in Taiwan is an apparent win for the island’s ruling party, but one that leaves the government scrambling to satisfy energy security concerns and the growing demands of a vital chip industry.\n• We Need a Reality Check on Crime, Safety and Transit\n\nSome 74% of those who voted in a referendum backed the return of the Maanshan nuclear plant, shuttered earlier this year. That’s a significant change from 2021, when voters struck down a proposal to open the mothballed Lungmen plant. Still, the affirmative vote did not meet the threshold of 25% of eligible voters required for the opposition-backed referendum to pass and, ultimately, to provide a route to the widespread use of atomic power.\n\nThe upshot is a defeat that, according to analysts like William Yang at the International Crisis Group, still sends a significant message on changing public perceptions.\n\n“This result, even though it falls short of the legal threshold, showcases the gap between the government’s preferred policy line and the public opinion,” Yang said. “It also reflects the public’s anxiety and concern about Taiwan’s energy resilience and capability to maintain stable energy supply.”\n\nThe debate over the future of nuclear power in Taiwan has been a challenging one for President Lai Ching-te.\n\nHis Democratic Progressive Party has long opposed any change, given concerns around waste disposal and accidents, but it is now left to deal with the risk that comes with importing 96% of the self-governed democracy’s energy. That’s a dependence on seaborne cargoes that leaves the island — and a globally vital chip industry, including companies such as Taiwan Semiconductor Manufacturing Co. — vulnerable in the event of a Chinese blockade.\n\nRestarting Taiwan’s mothballed nuclear power plants is one of the key things the government should do to bolster its energy security against threats from China, according to two top former US security officials who were said to have made the recommendations to Lai recently.\n\nIt also runs counter to a global nuclear renaissance, as nations race to fuel artificial intelligence infrastructure and meet climate-change emissions targets. Jensen Huang, chief executive officer of Nvidia Corp., said during a stopover in Taipei last week that nuclear power is an “excellent option” for Taiwan. Taiwan’s power demand is projected to rise 13% by the end of the decade, largely driven by data centers and chipmakers.",
  "medium": "Article",
  "links": [
    "https://www.bloomberg.com/news/articles/2025-08-21/how-transit-agencies-can-fight-the-fear-of-riding-public-transportation?utm_campaign=bn&utm_medium=distro&utm_source=yahooUS",
    "https://www.bloomberg.com/news/articles/2025-08-22/dc-crime-crackdown-deputizes-national-park-service-in-homeless-sweeps?utm_campaign=bn&utm_medium=distro&utm_source=yahooUS",
    "https://www.bloomberg.com/news/features/2025-08-23/germany-is-giving-prefabricated-mass-housing-a-second-chance?utm_campaign=bn&utm_medium=distro&utm_source=yahooUS"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "nuclear power",
      "weight": 0.09274639
    },
    {
      "name": "energy security concerns",
      "weight": 0.08960714
    },
    {
      "name": "Failed Nuclear Vote",
      "weight": 0.08094322
    },
    {
      "name": "Taiwan Semiconductor Manufacturing Co.",
      "weight": 0.07907669
    },
    {
      "name": "Taiwan",
      "weight": 0.07590509
    },
    {
      "name": "Taiwan’s mothballed nuclear power plants",
      "weight": 0.072073914
    },
    {
      "name": "stable energy supply",
      "weight": 0.069007516
    },
    {
      "name": "atomic power",
      "weight": 0.0657861
    },
    {
      "name": "chief executive officer",
      "weight": 0.056641534
    },
    {
      "name": "concern",
      "weight": 0.055275053
    }
  ],
  "topics": [
    {
      "name": "ESG"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.990234375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.92919921875
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.69970703125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.471435546875
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.378173828125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.35400390625
    }
  ],
  "sentiment": {
    "positive": 0.12314692,
    "negative": 0.62113106,
    "neutral": 0.25572202
  },
  "summary": "The failure of a weekend vote to restart a key nuclear plant in Taiwan has left the government in a difficult position, with energy security concerns and the growing demands of a vital chip industry. 74% of voters in the referendum supported the return of the Maanshan nuclear plant, a significant change from 2021 when voters rejected a proposal to open the mothballed Lungmen plant. However, the vote did not meet the threshold of 25% of eligible voters required for the opposition-backed referendum to pass. The defeat indicates a gap between the government's preferred policy line and public opinion, and reflects public concern about Taiwan's energy resilience and ability to maintain stable energy supply. The future of nuclear power in Taiwan is uncertain as the country imports 96% of its energy, leaving it vulnerable to a Chinese blockade.",
  "shortSummary": "A failed referendum to restart a key nuclear plant in Taiwan leaves the government facing energy security concerns and a crucial chip industry demand.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "79c22a7792ab47e8842931cdd62a65a5",
  "places": [
    {
      "osmId": "2482559274",
      "city": "New Taipei",
      "country": "Taiwan",
      "countryCode": "tw",
      "coordinates": {
        "lat": 24.7764921,
        "lon": 121.4660139
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "A referendum to restart Taiwan’s Maanshan nuclear plant failed to meet the 25% voter turnout threshold, marking a setback for the ruling Democratic Progressive Party and highlighting a public gap between government policy and energy security concerns. Analysts note the result underscores anxiety over Taiwan’s heavy reliance on imported energy and the vulnerability of its critical chip industry to potential Chinese blockades. The government now faces pressure to pursue alternatives—such as reviving mothballed nuclear plants—to meet rising power demand driven by data centers and semiconductor manufacturing.",
  "argos_id": "VX8KFLE57"
}