{
  "url": "https://finance.yahoo.com/news/buy-brookfield-asset-management-while-153200994.html",
  "authorsByline": "Reuben Gregg Brewer, The Motley Fool",
  "articleId": "d9b3bf96e9a14a68819acb9cd40646cf",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/upnan6l2zvGArDpyWWKFsA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MTg7Y2Y9d2VicA--/https://media.zenfs.com/en/motleyfool.com/1c8e9c5a41f583e8a6e940b16f3a45ae",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T15:32:00+00:00",
  "addDate": "2025-08-24T16:00:46.324525+00:00",
  "refreshDate": "2025-08-24T16:00:46.324527+00:00",
  "score": 1.0,
  "title": "Should You Buy Brookfield Asset Management While It's Below $60?",
  "description": "It has had a material run over the past year, but management's growth goals are still huge.",
  "content": "• Brookfield Asset Management's shares are up more than 40% over the past 12 months.\n• The Canadian asset manager has been highlighting its growth goals.\n• If it hits its goals, there is still material growth ahead.\n• 10 stocks we like better than Brookfield Asset Management ›\n\nThe S&P 500 (SNPINDEX: ^GSPC) is up around 13% over the past year. The shares of Brookfield Asset Management (NYSE: BAM) have risen over 40%. Investors clearly see opportunity in the Canadian asset manager's future. But have they priced in all the good news? Probably not, given the company's huge growth goals. Here's why Brookfield Asset Management could still be worth buying while it hovers around $60 a share.\n\nWhat does Brookfield Asset Management do?\n\nBrookfield Asset Management is an asset manager, taking money from others and investing it on their behalf. The company also manages its own money. The big story to watch is what Brookfield Asset Management calls fee-bearing capital, which is the money it handles for others. It charges management fees for doing this, and, thus, the amount of fee-bearing capital it has will have the biggest effect on the business' revenues and earnings.\n\nAlthough Brookfield Asset Management's history is rooted in infrastructure, with a global focus, today it handles money across five different investment categories. Renewable power, infrastructure, and real estate all stick closely to the company's historical focus. But it has also reached out into private equity and credit, expanding its reach and growth opportunities. These businesses are all being positioned to take advantage of what management believes are key global themes: Digitization, decarbonization, and deglobalization.\n\nBrookfield Asset Management operates in over 30 countries around the world. Thus, it has a wide reach as it looks for investment opportunities for itself and for its customers. Overall, Brookfield Asset Management has roughly $1 trillion in assets under management. Of that sum, roughly $550 billion is fee-bearing capital.\n\nWhere to from here for Brookfield Asset Management?\n\nBrookfield Asset Management has been talking up its growth opportunity for a little while now. Given the price gain over the past year, it looks like investors are starting to listen. A big example of the growth opportunity came when the company raised its dividend per share 15% at the start of 2025. That is a very big dividend increase, but it's just the foundation of the story.\n\nManagement has laid out its growth goal through the end of the decade. The plan is to increase the fee-bearing capital it handles in every one of its segments, with the total expected to double to around $1.1 trillion. That, in turn, will increase the company's revenues and earnings. The expectation is that fee-bearing earnings will rise 17% a year, on average, between 2024 and 2029. That, in turn, will allow the company to continue increasing the dividend by 15% each year.",
  "medium": "Article",
  "links": [
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=cc756338-3b51-43c2-b39e-8c06b63e0534&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000053%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_yahoo%26ftm_pit%3D17670",
    "https://www.fool.com/terms/a/asset-management/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=aa3d251e-85f7-4fd3-acbe-1344125a0f83",
    "https://www.fool.com/investing/stock-market/market-sectors/energy/renewable-energy-stocks/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=aa3d251e-85f7-4fd3-acbe-1344125a0f83"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Brookfield Asset Management",
      "weight": 0.1393475
    },
    {
      "name": "Management",
      "weight": 0.10176897
    },
    {
      "name": "growth opportunities",
      "weight": 0.09902457
    },
    {
      "name": "Brookfield Asset Managements shares",
      "weight": 0.0865571
    },
    {
      "name": "Brookfield Asset Managements history",
      "weight": 0.08424253
    },
    {
      "name": "management fees",
      "weight": 0.08353103
    },
    {
      "name": "Brookfield Asset Managements",
      "weight": 0.082238555
    },
    {
      "name": "material growth",
      "weight": 0.08050331
    },
    {
      "name": "investment opportunities",
      "weight": 0.08037865
    },
    {
      "name": "opportunity",
      "weight": 0.07077101
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.98193359375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.94482421875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.896484375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.8662109375
    },
    {
      "name": "/Finance/Investing/Funds",
      "score": 0.67236328125
    },
    {
      "name": "/Finance/Financial Planning & Management/Asset & Portfolio Management",
      "score": 0.37548828125
    }
  ],
  "sentiment": {
    "positive": 0.7190153,
    "negative": 0.04565197,
    "neutral": 0.23533274
  },
  "summary": "The shares of Brookfield Asset Management (NYSE: BAM) have risen over 40% over the past year, with the company's shares hovering at around $60 per share. The company, which focuses on investing money for others and manages its own money, has been highlighting its growth goals and expects significant growth if it meets them. The growth of fee-bearing capital, which is the company that it charges management fees for managing money for other clients, will determine how much of this will affect the business's revenues and earnings. Management plans to increase the fee-sharing capital in every segment to double to around $1.1 trillion, with expectations that fee-related earnings will rise 17% a year, on average, between 2024 and 2029, allowing the company to continue increasing the dividend by 15% each year.",
  "shortSummary": "Brookfield Asset Management's shares rose over 40% amid strong growth goals, including increasing fee-bearing capital and dividends, despite current market valuations of around $60 a share.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "cce0e1547f6943bdb816174f6aecc22a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/investing/stock-market/market-sectors/energy/renewable-energy-stocks/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=aa3d251e-85f7-4fd3-acbe-1344125a0f83",
      "text": "The global economy is rapidly working on switching energy sources. Due to climate change concerns, the world is moving away from carbon-based fossil fuels to cleaner alternative energy sources, including renewable energy. The decarbonization of the global economy will take trillions of dollars in investment each year.\nRenewable energy will play a crucial role in this energy transition. Here's a closer look at how to invest in the renewable energy industry.\nWhy invest?\nWhy invest in clean energy stocks?\nRenewable energy sources, such as wind, solar, and hydroelectric power, supply more than 20% of the electricity generated by the U.S. power sector. The industry has been growing briskly, quadrupling its electricity-generating capacity over the past decade. Given increasing climate change concerns, the pace has quickened in recent years. It needs to continue accelerating to help rapidly decarbonize the economy.\nClimate change is forcing companies and other institutions to focus on how they can do their part to decarbonize. Many companies are signing power purchase agreements (PPAs) with electric utilities and other electricity generators to specifically buy power produced from renewable sources.\nMeanwhile, others are investing directly in renewable energy development projects. Some are making renewable investments to be viewed as socially responsible global citizens. However, clean energy is increasingly economical due to the falling costs of solar panels, wind turbines, and batteries for energy storage, making the sector a more attractive investment opportunity.\nGovernments are also working to accelerate global decarbonization by proposing and passing legislation to increase investment in the sector.\nMany view these spending packages as only a down payment on the investment needed to decarbonize the economy. The view suggests that future legislation could further boost the country's investment level.\nTop renewable energy stocks for 2025\nFive top renewable energy stocks in 2025\nMany companies focus on renewable energy, putting them in an excellent position to benefit from this investment megatrend. However, a few energy companies stand out above their peers as the best renewable energy stocks to buy. Top-tier green energy companies include:\n| Renewable Energy Stock | Ticker Symbol | Market Capitalization |\n|---|---|---|\n| NextEra Energy | NYSE:NEE | $138.9 billion |\n| Brookfield Renewable | NYSE:BEP, NYSE:BEPC | $6.3 billion |\n| Clearway Energy | NYSE:CWEN, NYSE:CWEN.A | $2.9 billion |\n| First Solar | NASDAQ:FSLR | $20.1 billion |\n| Constellation Energy | NASDAQ:CEG | $95.9 billion |\nHere's a closer look at these leading renewable energy stocks.\n1 - 3\n1. NextEra Energy\nNextEra Energy (NEE 0.18%) is one of the world's largest producers of wind and solar energy. It generates power at its Florida utilities and its energy resources segment, which sells electricity under PPAs to other utilities and large corporate buyers.\nFew companies are betting bigger on renewable energy than NextEra Energy. The utility's ambitious Real Zero plan aims to eliminate carbon emissions from its operations by 2045. It plans to significantly expand its solar energy and storage capacity while replacing natural gas in its power plants with green hydrogen and renewable natural gas.\nNextEra has an excellent track record of creating shareholder value by investing in renewable energy. It has produced an average annual total return of 15.7% during the past 20 years (well ahead of the S&P 500's 10.2% average annual total return). Its above-average growth rate has powered strong investment returns. NextEra has expanded its adjusted earnings per share (EPS) at a 9% compound annual rate since 2003. Meanwhile, it has boosted its dividend at a 10% annual rate during that period, pushing its growth streak to 30 consecutive years.\nThe company expects its investments to continue paying dividends to shareholders. It predicts earnings will increase at or near the top end of its 6% to 8% annual target range through 2027. It also expects to deliver dividend growth of around 10% annually through at least 2026. Meanwhile, it is likely to maintain one of the best balance sheets in the utility sector, giving the company the financial flexibility to continue expanding.\n2. Brookfield Renewable\nBrookfield Renewable (BEP 2.54%) is a global leader in renewable energy. It's one of the world's largest producers of hydroelectric power, which comprises almost half its portfolio. Brookfield also has been increasing its wind (onshore and offshore), solar (utility-scale and distributed generation, such as rooftop solar), and energy storage expertise. The company sells the bulk of its power under long-term PPAs that generate steady cash flow.\nBrookfield has an excellent track record. It has increased its dividend payments at a 6% compound annual rate since 2001 while growing its funds from operations (FFO) per share at a 12% rate since 2016. The steady expansion of its portfolio through acquisitions and development projects has driven its growth.\nBrookfield sees even more growth ahead. It believes it can deliver more than 10% annual FFO per share growth over the next decade, powered by rising power prices, its extensive pipeline of renewable energy development projects, and additional acquisitions. The earnings growth should enable the company to hike its dividend by 5% to 9% annually -- making it one of the best renewable energy dividend stocks. It expects to maintain a top-notch balance sheet, giving it the financial flexibility to keep expanding.\nCarbon Credits\n3. Clearway Energy\nClearway Energy (CWEN 1.21%) is one of the largest owners of renewable energy generating facilities in the U.S. It complements its wind and solar energy portfolio with highly efficient facilities powered by natural gas. Clearway also sells its power via PPAs that generate a steady cash flow for the company.\nThe company has a lot of growth lined up. A combination of higher power prices, organic expansion projects, and secured acquisitions of operating assets and development projects provide Clearway with increasing growth visibility through 2027. It expects to grow its cash available for distribution by a 7.5% to 12% annual rate through 2027.\nThat positions the company to grow its dividend within its 5% to 8% annual target range for the foreseeable future. Meanwhile, it anticipates maintaining a solid financial profile, which will give it the flexibility to continue expanding. Clearway Energy is positioned to continue capitalizing on opportunities to increase its renewable energy operations in the coming years while creating substantial value for shareholders.\n4 - 6\n4. First Solar\nFirst Solar (FSLR 5.35%) develops and manufactures thin-film solar panels that use their larger size to generate more energy than competing technologies, making them ideal for utility-scale solar energy projects.\nAs one of the world's leading solar panel makers, the company is in an excellent position as demand for solar panels accelerates. It's actively investing to increase its capacity to produce solar panels and meet demand. Entering 2025, it had contracts in place to sell panels through 2030, giving it significant visibility into future revenue.\nFirst Solar has the means to continue expanding because it boasts one of the best balance sheets in the sector. Even with its heavy investments in building new manufacturing capacity, the company expected to end 2024 with $500 million to $700 million in net cash. The cushion gives it tremendous financial flexibility to continue expanding to capitalize on the increasing demand for solar panels. It was building two new manufacturing facilities in the U.S. (Alabama and Louisiana), with the first factory starting up at the end of 2024 and the latter expected to begin producing panels in 2026.\nIt also has the flexibility to make acquisitions to enhance its technology and operations. For example, in 2023, First Solar acquired leading European thin film company Evolar to improve its ability to develop next-generation solar technology. Meanwhile, it bought a facility in Ohio in 2024 that it plans to turn into a new distribution facility for its manufacturing operations in the state.\nFiscal Quarter\n5. Constellation Energy\nConstellation Energy (CEG -0.77%) is the country's largest producer of carbon-free energy. That's largely due to its leading fleet of nuclear energy plants. The company also has a diverse mix of hydro, wind, and solar energy assets. Overall, Constellation powers more than 20 million homes and businesses, with 90% of its generation coming from carbon-free energy sources.\nThe company took a big step toward enhancing its already leading clean energy position in early 2025 by agreeing to acquire Calpine in a $26.6 billion deal. The transaction will create the country's largest clean energy provider, adding Calpine's natural gas, geothermal, and battery storage fleet to its portfolio. Those assets supply baseload power to help mitigate the intermittency of renewable energy.\nThe combined company expects to have ample opportunities to expand its clean energy capacity. Current and potential growth projects include nuclear energy restarts and renewals, solar plus battery storage projects, carbon capture and storage, and new natural gas capacity.\nRelated investing topics\nStrong returns for investors\nClimate change and socially responsible investing are major catalysts for the clean energy revolution. The trend will drive trillions of dollars of investment in renewable energy in the decades ahead.\nAlthough the rising tide of clean energy should lift all boats, the top renewable energy stocks should generate some of the best returns for investors. Green energy companies that have already proven to be value creators and have the financial strength to capture opportunities should yield outsize total returns in the coming years.\nFAQ\nRenewable energy FAQ\nWhat is renewable energy?\nGreen energy sources include:\n- Wind.\n- Solar.\n- Hydro.\n- Biomass.\n- Geothermal.\n- Ocean waves and currents.\n- Green hydrogen.\nIs renewable energy a good investment?\nThe clean energy sector represents a massive opportunity for investors. However, they must pick stocks carefully since not all will take full advantage of this opportunity. Two key characteristics to look for are a strong balance sheet and a solar energy-focused growth profile. Those factors could give a company the power to generate higher returns.\nWhich stock is best for renewable energy?\nThere are several top renewable energy companies. Brookfield Renewable is one of the best stocks for renewable energy. The company has a globally diversified renewable energy platform, including hydroelectric, wind, and solar operations. It also has a sustainable solutions business, which invests in manufacturing solar panels, producing green hydrogen, and making renewable natural gas. The company also has an excellent track record of growing shareholder value, including increasing its dividend at a 6% compound annual rate over the last 20 years.\nAre there any renewable energy ETFs?\nThere are several renewable energy ETFs. Three of the biggest by assets under management (AUM) in early 2025 were:\n- Invesco Solar ETF (NYSEMKT: TAN) with $873.6 million in AUM.\n- First Trust NASDAQ Clean Edge Energy Index Fund (NASDAQ: QCLN): $588.7 million.\n- iShare Global Clean Energy ETF (NYSEMKT: ICLN): $1.5 billion.\nExpert Q and A\nExpert Q&A on renewable energy\nThe Motley Fool got the chance to chat with investing expert Professor Priya Parrish of University of Chicago Booth School of Business. Here's what Parrish had to say about investing in the renewable energy realm.\nExpert advice\nProfessor Priya Parrish\nThe Motley Fool: What is renewable or green energy?\nProfessor Parrish: Energy generated from natural resources that does not product pollution. Solar, wind, and geothermal are examples of green energy sources that are also renewable. There are a number of businesses and investment opportunities related to the renewable energy sector, from infrastructure to financing and workforce development.\nThe Motley Fool: What’s your advice for someone looking to invest in renewable energy?\nProfessor Parrish: Investors with a genuine passion for and commitment to sustainability are more likely to succeed, as the market is complex and changing fast. Entrepreneurs in this sector are also more driven to take capital from those firms with a mission alignment. This is related to the need for sustainability investors to understand these markets in-depth from multiple angles.\nThis includes:\n- Both the supply and demand drivers\n- Policy and regulatory factors\n- Business models and operational considerations\n- Supply chain risks\nWe see successful investors bringing forward both operating experience in the energy, utilities, or infrastructure industries as well as a sound understanding of energy and commodity markets and policies.\nThe Motley Fool: What are some of the pros and cons of investing in renewable energy?\nProfessor Parrish: Investing in secular growth trends that are tied to real societal needs provides a strong investment backdrop for long-term investors. However, in the past few years we have seen an influx of capital looking to invest in sustainability deals as there is growing awareness of the opportunity. Many of these investors are unsophisticated and can create market noise. For investors willing to invest in developing a deep knowledge of renewable technologies, markets and companies, I think it is an opportunity worth pursuing.\nThe Motley Fool: What are some emerging areas of renewable energy? Are you particularly optimistic about any of them?\nProfessor Parrish: In addition to energy transition, we are optimistic about related opportunities in waste reduction, climate risk management in the supply chain, sustainable food and agriculture, and carbon capture."
    },
    {
      "url": "https://www.fool.com/terms/a/asset-management/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=aa3d251e-85f7-4fd3-acbe-1344125a0f83",
      "text": "Asset management is a service offered by financial companies to oversee their clients' financial assets. Many asset managers decide how to administer a client's assets based on their investment strategy. Here's a closer look at asset management, what asset management firms do, how they make money, and some examples of asset managers.\nWhat is asset management?\nWhat is asset management?\nAsset management oversees financial assets owned by other organizations or individuals. An asset manager allocates a client's investments across the different asset classes based on their stated goals, strategy, and risk tolerance. Those asset classes include:\n- Cash: Cash assets include cash equivalents, money market funds, U.S. Treasury bills, and certificates of deposit (CDs). Cash investments seek to preserve an investor's money.\n- Fixed income: Fixed-income investments include various types of bonds like savings bonds, municipal bonds, Treasury bonds, and corporate bonds. Fixed-income investments strive to generate income for an investor at a fixed annual rate.\n- Equities: Equity is an ownership interest in a business or other financial investment with capital appreciation potential. Equity investments include stocks, exchange-traded funds (ETFs), and mutual funds. Equity investments aim to deliver higher returns than fixed income through price appreciation.\n- Alternative Investments: Alternative investments are investments offered outside the traditional banking system or public markets. Alternatives include real estate, precious metals, cryptocurrency, private equity, hedge funds, commodities, art, and forex (foreign exchange). Alternative investments aspire to produce higher returns than traditional equity and fixed-income investments.\nWhat does an asset management firm do?\nWhat does an asset management firm do?\nAn asset manager oversees their client's financial assets and allocates them across the various asset classes based on their client's investment strategy, risk profile, and situation. Asset managers aim to grow their clients' assets by investing the money into fixed-income, equity, or alternative investments while taking on risks appropriate for their client's needs.\nThere are several types of asset managers, including:\n- Registered Investment Advisers (RIAs): These firms advise clients on managing their portfolios and may make changes on a client's behalf.\n- Investment brokers: These companies enable clients to buy stocks and other securities on their platforms. They don't make changes to a client's portfolio on their behalf but serve as a custodian over their assets.\n- Financial advisors: These financial professionals advise clients on how to manage their assets. Some actively manage client accounts, while others only serve in an advisory role.\n- Robo-advisors: These platforms use a computer program to automatically monitor and allocate assets on behalf of clients.\nRobo Advisor\nHow do asset management companies make money?\nHow do asset management companies make money?\nCompanies engaged in asset management typically charge clients administration fees for managing their assets. The most common structure is to levy fees based on a percentage of the assets under management (AUM). The average asset management fee is around 1% of a client's portfolio value. So, if a client had a $1 million portfolio, the asset manager would earn $10,000 in administration fees each year.\nSome asset managers may also charge a fee for each trade they make on a client's behalf. Asset managers might also earn a commission for selling certain financial products to their clients, like mutual funds, insurance products, or annuities.\nFinally, some asset managers earn a percentage of the return they generate for investors above a certain threshold. These profit-based earnings are known as a “promote” in a real estate investment and “carried interest” in private equity, hedge funds, and venture capital funds. For example, if a private real estate investment achieves its return threshold, the deal's sponsor will often split the profits with investors above that level (usually 70% to 80% to investors and 20% to 30% to the sponsor as their promote income).\nExamples of asset management companies\nExamples of asset management companies\nSeveral companies focus on providing asset management services to clients. Some focus on managing traditional asset classes like fixed income and equities, while others concentrate on alternatives.\nBlackRock (BLK 2.03%) is the biggest asset management firm. The company had nearly $8.6 billion in AUM at the end of 2022. That was down about 14% from the prior year due to falling asset values. The company provides asset management services to retail, ETF, and institutional clients across equity, fixed income, multi-asset, alternatives, and cash management products. Blackrock generated $17.9 billion of revenue in 2022, which included administration fees and other revenue sources like performance fees and advisory revenue.\nBlackstone (BX 4.17%) is the largest alternative asset manager. The company ended 2022 with $975 billion in AUM (up 11% year over year) across real estate, private equity, hedge fund solutions, and private credit and insurance. Blackstone's clients include institutional and high-net-worth investors. The company produced $4.4 billion of fee-related earnings in 2022. In addition, Blackstone realized $3 billion of performance and investment income, which includes carried interest earned from its various funds."
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=cc756338-3b51-43c2-b39e-8c06b63e0534&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000053%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_yahoo%26ftm_pit%3D17670",
      "text": "5 Years From Now, You'll Probably Wish You Grabbed These Stocks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,057% vs. just 185% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to find out how to get access to these stocks.\nReturns are updated during market hours. The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    }
  ],
  "argos_summary": "Brookfield Asset Management’s shares have surged over 40% in the past year as investors chase its ambitious growth targets, including a plan to double fee‑bearing capital to $1.1 trillion and raise dividends by 15% annually through 2029. The firm’s diversified portfolio spans renewable power, infrastructure, real estate, private equity and credit, positioning it to benefit from global trends in digitization, decarbonization and deglobalization. Amid a broader renewable‑energy boom, the article highlights top green stocks such as NextEra Energy, Brookfield Renewable, Clearway Energy, First Solar and Constellation Energy, noting their strong balance sheets, expanding pipelines and attractive dividend prospects. Overall, Brookfield’s robust growth outlook and the accelerating clean‑energy transition suggest continued upside potential for the asset manager and its related renewable‑energy peers.",
  "argos_id": "W6527HNAA"
}