{
  "url": "https://www.yahoo.com/news/articles/authorities-bust-illegal-makeshift-structure-024500716.html",
  "authorsByline": "Grace Howarth",
  "articleId": "65a2afc90d0847fbbdfb54358dcbb62c",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/XklojnvPEUzjF0UfHARrow--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/0529fe0107f0ea900acdb50a4302384d",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T02:45:00+00:00",
  "addDate": "2025-08-25T03:43:34.999989+00:00",
  "refreshDate": "2025-08-25T03:43:34.999991+00:00",
  "score": 1.0,
  "title": "Authorities bust illegal makeshift structure established in protected national park: 'Not a private playground'",
  "description": "\"Queensland's national parks are for everyone to enjoy, not for a select few to exploit for personal gain.\"",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nTourists were fined for secretly building a holiday shack in part of a Great Barrier Reef national park.\n\nAccording to reporting by 7News, eighteen individuals were fined after they secretly built a cabin in Australia's Curtis Island National Park.\n\nThe Department of Environment, Science and Innovation received reports and surveillance of the illegal building and launched a compliance investigation.\n\nTheir investigation found a relatively high-tech construction, filled with bunk beds, solar panels, rainwater tanks, a veranda, a barbecue, and cooking facilities. Not only that, the individuals associated with the shack were taking part in other prohibited activities, like hunting with firearms and using unauthorized vehicles in the park.\n\nTo build this construction, the intruders had to cut down trees to make space, and their use of illegal four-wheel drives damaged fragile ecosystems.\n\nThe Curtis Island National Park is filled with rare birds, as well as turtle nesting grounds, endangered species, and delicate dunes. The disruptive actions of the shack builders put the natural beauty spot and all of its many inhabitants at risk.\n\nUnder the Nature Conservation Act 1992, all fires and structures are completely banned from Curtis Island National Park, according to 7News.\n\nThe Department of Environment, Science and Innovation (DESI) tracked down and fined the rogue builders and people who visited the shack. It fined 18 people a total of $7,606, which will hopefully act as a deterrent to others and help protect the area.\n\nThough the rules and regulations at National Parks may seem quite strict on the surface, they are in place so that we can all visit these spots of natural beauty without damaging them.\n\nIt's so easy for ecosystems to be harmed by invasive species of plants and insects that can accidentally be carried in on people's shoes or clothes, which is why it's important to check you're not bringing in any mud, seeds, or pests from elsewhere.\n\nWhen these areas are already at such high risk, the last thing they need is selfish acts of destruction from people who want to turn a National Park into their holiday home.\n\nDESI commented, per 7News, \"Curtis Island is a national park, not a private playground.\"\n\nThe organization added, \"Queensland's national parks are for everyone to enjoy, not for a select few to exploit for personal gain.\"\n\nJoin our free newsletter for good news and useful tips, and don't miss this cool list of easy ways to help yourself while helping the planet.",
  "medium": "Article",
  "links": [
    "https://guide.thecooldown.com/recording-votes/do-you-think-america-does-a-good-job-of-protecting-its-natural-beauty/?answer=4&article=rec5wUYGxKVaLSBv8",
    "https://guide.thecooldown.com/recording-votes/do-you-think-america-does-a-good-job-of-protecting-its-natural-beauty/?answer=2&article=rec5wUYGxKVaLSBv8",
    "https://parks.desi.qld.gov.au/parks/curtis-island/about",
    "https://guide.thecooldown.com/actions/explore-critical-climate-issues/",
    "https://7news.com.au/news/illegal-holiday-shack-built-in-protected-great-barrier-reef-national-park-c-19360442",
    "https://guide.thecooldown.com/recording-votes/do-you-think-america-does-a-good-job-of-protecting-its-natural-beauty/?answer=1&article=rec5wUYGxKVaLSBv8",
    "https://rb.gy/ivhzmj",
    "https://guide.thecooldown.com/recording-votes/do-you-think-america-does-a-good-job-of-protecting-its-natural-beauty/?answer=3&article=rec5wUYGxKVaLSBv8",
    "https://www.thecooldown.com/future-newsletter/?rec5wUYGxKVaLSBv8"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Curtis Island National Park",
      "weight": 0.09122283
    },
    {
      "name": "protected national park",
      "weight": 0.079563364
    },
    {
      "name": "Curtis Island",
      "weight": 0.073768504
    },
    {
      "name": "illegal makeshift structure",
      "weight": 0.069980085
    },
    {
      "name": "National Parks",
      "weight": 0.06831838
    },
    {
      "name": "people",
      "weight": 0.059793122
    },
    {
      "name": "Australias Curtis Island National Park",
      "weight": 0.05964824
    },
    {
      "name": "such high risk",
      "weight": 0.058710545
    },
    {
      "name": "natural beauty",
      "weight": 0.058223926
    },
    {
      "name": "The Curtis Island National Park",
      "weight": 0.058189943
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.97509765625
    },
    {
      "name": "/News/Other",
      "score": 0.8173828125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.779296875
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Regional Parks & Gardens",
      "score": 0.50048828125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.490966796875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.34130859375
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Other",
      "score": 0.34130859375
    }
  ],
  "sentiment": {
    "positive": 0.040117074,
    "negative": 0.7419505,
    "neutral": 0.2179324
  },
  "summary": "A tourist tourist group was fined $7,606 for secretly building a holiday shack in part of a Great Barrier Reef national park in Australia's Curtis Island National Park. The Department of Environment, Science and Innovation (DESI) found the illegal structure, which included bunk beds, solar panels, rainwater tanks, a veranda, and cooking facilities, and prohibited activities such as hunting with firearms and unauthorized vehicles in the park. To build the construction, the intruders had to cut down trees to make space and their use of illegal four-wheel drives damaged fragile ecosystems. DesI stated that the actions of these individuals put the natural beauty spot and its inhabitants at risk. The rules and regulations at National Parks are in place to ensure that visitors can visit these spots of natural beauty without damaging them.",
  "shortSummary": "A group of tourists built an illegal holiday shack in Australia's Curtis Island National Park, violating regulations, and were fined $7,000 for violating environmental regulations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e4908725f20c4dcb931047ab8a2849ec",
  "places": [
    {
      "osmId": "8386773",
      "state": "Queensland",
      "country": "Australia",
      "countryCode": "au",
      "coordinates": {
        "lat": -23.70307575,
        "lon": 151.27554085739285
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://7news.com.au/news/illegal-holiday-shack-built-in-protected-great-barrier-reef-national-park-c-19360442",
      "text": "Eighteen people have been fined after authorities busted an illegal holiday shack hidden deep inside a protected national park.\nThe cabin was secretly constructed on Curtis Island, near Gladstone, Queensland, without any approvals.\nIt effectively turned part of the Great Barrier Reef World Heritage Area into what officials slammed as a “private playground”.\nKnow the news with the 7NEWS app: Download today\nThe off-grid structure featured solar panels, rainwater tanks, bunk beds and cooking facilities, even a verandah and barbecue area, allowing “guests” to stay comfortably in the remote wilderness.\nBut the luxury came at an environmental cost.\nIllegal 4WD tracks were carved through fragile dune ecosystems to access the site, while trees were illegally felled by hand and used to build the hut and surrounding camp structures, authorities said.\nThe Department of Environment, Science and Innovation (DESI) launched a compliance investigation after receiving community reports and surveillance footage.\n“Curtis Island is a national park, not a private playground,” DESI said.\n“We take these matters seriously and our dedicated officers work hard to protect Queensland’s precious natural places.\n“We will not hesitate to prosecute people who disregard the rules.”\nThe investigation uncovered the site was linked to other prohibited activities including hunting with firearms and unauthorised vehicle use inside the park.\nCurtis Island, accessible only by ferry from Gladstone, is popular with 4WD tourists for its pristine beaches, bushland and fishing spots.\nThe island is also home to crucial turtle nesting grounds, rare birdlife and fragile dune systems.\nAuthorities said the illegal hut was built near protected areas where 4WD tracks, rubbish and noise risk disturbing nesting turtles and damaging fragile dune systems.\nCamping on Curtis Island is only permitted at designated sites with bookings.\nFires are completely banned, and all structures — even temporary ones — are strictly prohibited under the Nature Conservation Act 1992.\nDESI fined 18 people — including the accused builders and visitors caught at the illegal site — a total of $7,606.\n“Queensland’s national parks are for everyone to enjoy, not for a select few to exploit for personal gain,” the department warned.\nOfficials are now urging anyone with information about unauthorised activities to come forward and help preserve Queensland’s unique natural heritage for future generations.\nStream free on"
    },
    {
      "url": "https://parks.desi.qld.gov.au/parks/curtis-island/about",
      "text": "About Curtis Island\nPark features\nCurtis Island is the third largest continental island in Queensland. Located in the southern region of the Great Barrier Reef World Heritage Area the island contains a very high diversity of landforms and ecosystems. The island is a unique part of the central Queensland coast. Coastal heath and littoral rainforest scatter the sand dunes and beach ridges, while extensive salt flats make up the large plain on the northern section of the island.\nThe small settlement of Southend is the entry point for your stay on the southern end of this scenic island. Driving north from here you will reach Southend Conservation Park, Curtis Island Conservation Park and Curtis Island National Park. The parks offer tranquil ocean vistas and stretches of uninhabited beaches.\nThe endangered Capricorn yellow chat has been recorded in remnant wetlands on Curtis Island Conservation Park to the island’s north. The threatened flatback turtle nests on the island's beaches.\nLooking after the park\n- Toilets are not provided—use a portable toilet. A toilet waste dump point is available to dispose of toilet waste 18km to the south near the Oceanview junction\n- Generators and chainsaws are prohibited.\n- Read and obey signs. Some areas of the park are closed to public access. Please read all signs and do not enter restricted or protected areas.\n- Keep wildlife wild. Do not feed or interfere with native animals. All plants, animals and natural features are protected. Disturb nothing.\n- Take rubbish with you. Bins are not provided. Please help and collect rubbish left by others. A council rubbish transfer station is located north of Southend.\n- Avoid clearing plants and leaf litter when setting up camp. All vegetation—including grasses, vines, fallen timber and leaves—are part of the natural ecosystem. Remember, all plants are protected on national parks and collecting is not permitted.\n- Cook without campfires. Fires are prohibited in the park, please use a gas or liquid fuelled stove for cooking. Open fires are also prohibited on tidal land (beaches).\nBe pest-free!\nOur precious Great Barrier Reef World Heritage islands are among the most pest-free islands in the world. They need your help to stay this way. Please Be pest-free! , Be pest-free! video—YouTube before your visit.\nBefore you visit, please check that your boat, clothing, footwear and gear are free of soil, seeds, parts of plants, eggs, ants and insects (and their eggs), spiders, lizards, toads, rats and mice.\nBe sure to:\n- Unpack your camping gear and equipment and check it carefully as pests love to hide in stored camping gear.\n- Clean soil from footwear and gear as invisible killers such as viruses, bacteria and fungi are carried in soil.\n- Check for seeds in pockets, cuffs and hook and loop fastening strips, such as Velcro.\nWhile you are on the islands, remove soil, weeds, seeds and pests from your boat, gear and clothes before moving to a new site. Wrap seeds and plant material, and place them in your rubbish.\nEveryone in Queensland has a General Biosecurity Obligation to minimise the biosecurity risk posed by their activities. This includes the risk of introducing and spreading weeds and pests to island national parks.\nSee the guidelines on caring for parks for more information about protecting our environment and heritage in parks.\nPark management\nQueensland Parks and Wildlife Service (QPWS) manage Curtis Island National Park, Conservation Park and State Forest for the enjoyment of visitors and the conservation of our natural and cultural heritage. Work is currently being undertaken to manage feral animals—pigs, foxes and cats—to conserve biodiversity on the island. Signs will be in place when pest control activities are being undertaken. Please comply with sign directions for your own safety.\nTourism information links\nGladstone Information Centre\nwww.gladstoneregion.info\nMarina Ferry Terminal\nBryan Jordan Drive\nGladstone QLD 4680\nPhone: (07) 4972 9000\nEmail: gladstonevic@gapdl.com.au\nCurtis Ferry Services\nwww.curtisferryservices.com.au\n215 Alf O'Rourke Drive\nGladstone QLD 4680\nPhone: (07) 4972 6990\nEmail: info@curtisferryservices.com.au\nFor tourism information for all regions in Queensland see Queensland Holidays.\nNature, culture and history\nCurtis Island contains a high diversity of regional coastal vegetation and landscape types that are in near ‘natural condition’ and are considered excellent examples of their type. This diversity, within well-defined boundaries, presents Curtis Island as a major natural asset where connectivity and resilience of ecosystems and habitats has been maintained.\nThe vegetation communities, many of which are ‘endangered’ or ‘of concern’, include wetlands, littoral rainforests, eucalypt forests and woodlands, lowland melaleuca swamps, open heathlands, low shrublands and dune communities. Although the island occurs in one of the drier zones of the Queensland coast, it contains a diversity of vegetation with both tropical and sub-tropical floristics.\nCurtis Island has biogeographical significance for species and communities that are at their distribution limits including 33 plant species including four mangrove species, the southernmost rookery site of the ‘vulnerable’ flatback turtle Natator depressus and the most southern occurrence of a tropical marine plain community. These features supported the listing of the eastern half of Curtis Island on the Register of the National Estate in 1993.\nThe 4,000ha marine plain is major habitat for the critically endangered Capricorn yellow chat Epthianura crocea subsp macgregori, migratory waders and other significant wetland species. Located in the north of the island, the marine plain is part of the ‘Northeast Curtis Island’ listing in the Directory of Important Wetlands in Australia. ‘Northeast Curtis Island’ is a highly significant wetland at regional, state and national levels.\nThere are also significant historical values such as the Cape Capricorn lighthouse precinct, Sea Hill pilot station, quarantine station and recent years marked the end of 150 years of cattle grazing."
    },
    {
      "url": "https://www.thecooldown.com/future-newsletter/?rec5wUYGxKVaLSBv8",
      "text": "TCD\nNewsletters\nThe coolest tech shaping our cleaner future,\nstraight to your inbox💡\nTCD Marketplace\n💡Connect with these trusted partners to save more, waste less, and upgrade your life\nCooler Future — Straight To Your Inbox\nAt The Cool Down, we're all about keeping you on the cutting edge of a cleaner, cooler future.\nYes, we're facing serious challenges, but there are real solutions to our problems, and the solutions are going to make all of our lives better — they're going to make us safer, richer, healthier, and happier. All we have to do is make the choice to act.\nOur newsletters deliver good news, useful advice, and easy hacks straight to your inbox — and we hope you'll let us be your guide in building a cooler future for yourself and your loved ones."
    },
    {
      "url": "https://rb.gy/ivhzmj",
      "text": "TCD\nMarketplace\nYour go-to resource for helping yourself while\nhelping the planet💡\nMarketplace Spotlight\n💡Connect with these trusted partners to save more, waste less, and upgrade your life\nAt The Cool Down, we're all about making it easy to help yourself while helping the planet.\nThe lifestyle solutions we've curated here feature partners we've vetted across a wide range of everyday activities — everything from the way you power your home to the way you buy your food to the way you get rid of your old stuff. Check out the list below, and don't miss the TCD Guide for a deep dive into all the smart choices you can make for yourself and your family.\nPS: We regularly add new partners to our marketplace, so be sure to sign up for alerts below, and please drop us a line at hello@thecooldown.com if you have specific problems you're trying to solve.\nJump to...\n🏠 Upgrade your home and lower your bills\n🍔 Eat better food and save money on groceries\n💸 Declutter your life and make money on your stuff\n🏠 Upgrade your home and lower your bills\nThanks to massive tax credits and rapid innovation, it's never been cheaper or easier to cut your utility bills by upgrading your home and using less energy. Here's how to get started:\n✅ Rewiring America can help you make sense of all the tax incentives available to you.\n✅ EnergySage makes it easy to save thousands on home solar by comparing quotes from trusted installers — and depending on where you live, they can help you save big on a heat pump or take advantage of community solar too.\n✅ Duxtop offers a sleek, affordable induction burner that lets you try the hottest, healthiest cooking technology without tearing out your old stove.\nMore from the TCD Guide\n🍔 Eat better food and save money on groceries\nGrocery bills are officially out of control these days, but there are more options than ever before to save money on delicious food and contribute to waste reduction along the way. These are our favorites:\n✅ Flashfood's free app makes it easy to browse for massive deals at local grocery stores on fresh food that's nearing its expiration date.\n✅ Too Good To Go's free app lets you pick up surprise bags of extra food from local restaurants at ridiculous discounts.\n✅ Martie and Misfits Market both give you ultra-convenient options for steep discounts on home deliveries.\nMore from the TCD Guide\n💸 Declutter your life and make money on your stuff\nIf you're like us, you probably have a closet (or closets) full of old stuff you need to get rid of but feel bad about trashing. Fortunately, the circular revolution means there are plenty of ways to give your stuff a second life and make money in the process:\n✅ GotSneakers will pay you cash every time you send in a free bag of your old shoes.\n✅ Trashie's convenient Take Back Bag can handle everything from clothes to shoes to towels to sheets — and earns you $30 in rewards every time you use it.\n✅ For that junk drawer full of old electronics, Walmart, Best Buy, Target, Costco, and Apple will all give you store credit when you bring in old devices."
    },
    {
      "url": "https://guide.thecooldown.com/actions/explore-critical-climate-issues/",
      "text": "Being part of the climate solution starts with understanding the problem and the things we can do about it.\nThe more you know, the easier it is to make smart decisions for yourself and have meaningful conversations with your friends and family.\nGuide\nRecommendations for how to take action\n-\nHow To Start\nFollow climate media brands (like TCD 😉) that provide interesting, important, and trusted information on our world’s changing climate.\n-\nWhat Comes Next\nTalk to your family and friends regularly about what you’re hearing on climate topics. Chances are you’ll learn a lot from them too.\nExperiences\nLet the community know your personal tips and tricks\nRelated Articles\nRead inspiring stories about people building a more sustainable future\nRelated Actions\nExplore all the big and small things you can do to make a difference\nPolls\nShare your viewpoint with the community on trending topics\nYou Ask, We Answer\nHave a question? The community is here to help"
    }
  ],
  "argos_summary": "Eighteen people were fined $7,606 for secretly building an off‑grid shack on Curtis Island National Park, part of the Great Barrier Reef World Heritage Area. The illegal structure, complete with solar panels, rainwater tanks and bunk beds, was built after cutting down trees and carving 4WD tracks that damaged fragile dune ecosystems and threatened turtle nesting sites. The Department of Environment, Science and Innovation launched a compliance investigation that also uncovered other prohibited activities such as firearms hunting and unauthorized vehicle use. Under the Nature Conservation Act 1992, all fires and structures are banned in the park, and authorities warned that the area is for public enjoyment, not private exploitation.",
  "argos_id": "XFQVZ3I7W"
}