{
  "url": "https://www.bloomberg.com/news/videos/2025-08-22/balance-of-power-late-edition-8-22-2025-video",
  "authorsByline": "bn",
  "articleId": "3c788fc7d76e4972bf2b1d1508de470c",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/itIIrYlUQ_o8/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T23:35:29.034000+00:00",
  "addDate": "2025-08-22T23:49:46.466290+00:00",
  "refreshDate": "2025-08-22T23:49:46.466292+00:00",
  "score": 1.0,
  "title": "US Govt. Makes $8.9B Investment in Intel Stock",
  "description": "\"Balance of Power: Late Edition\" focuses on the intersection of politics and global business. On today's show, Former Kansas City Fed President, Esther George, discusses whether or not when the Federal Reserve decides to cut rates will it risk Fed credibility. Dominic LeBlanc, president of the King's Privy Council for Canada and minister for Canada-US trade, explains why Canada is removing its retaliatory tariffs on a long list of US products that comply with the existing North American trade deal. Evelyn Farkas, former Deputy Assistant Secretary of Defense for Russia, Ukraine, & Eurasia shares her thoughts on how much leverage President Trump has in stopping the war in Ukraine. (Source: Bloomberg)",
  "content": "> > THIS IS BALANCE OF FROM WASHINGTON, D.C. > > FROM BLOOMBERG'S WASHINGTON, D.C. STUDIOS TO OUR TV AND RADIO AUDIENCES WORLDWIDE, WELCOME TO BALANCE OF POWER. ALONGSIDE MICHAEL SHEPARD, I'M TYLER KENDALL. > > JEROME POWELL LEADS THE DOOR OPEN TO RATE CUTS BUT IS THAT ENOUGH TO QUIET THE PRESIDENTS PRESSURE CAMPAIGN? > > JAY POWELL SAID TODAY HE SUGGESTED THAT THEY MIGHT CUT INTEREST RATES. > > WE CALL HIM TOO LATE FOR A REASON. HE SHOULD HAVE CUT THEM A YEAR AGO. HE IS TOO LATE. > > WE WILL BRING YOU SOME OF THE REMARKS THAT SENT STOCKS AND BONDS SURGING AND A FRESH REACTION FROM JACKSON HOLE WHEN FORMER KANSAS CITY FED PRESIDENT ESTHER GEORGE JOINS US. > > DEVELOPMENTS FROM THE WHITE HOUSE REGARDING AN BATTLE CHIPMAKER INTEL. THE COMPANY HAS AGREED TO GIVE THE GOVERNMENT 10% EQUITY STAKE IN THE COMPANY. WE WILL HAVE MORE ON THAT POTENTIAL DEAL LIVE FROM THE WHITE HOUSE. MICHAEL: PRIME MINISTER MARK CARNEY ANNOUNCING A DECISION A SHORT TIME AGO. WHY AND WHY NOW. THE MINISTER RESPONSIBLE FOR CANADA U.S. TRADE JOINS US UP AHEAD. TYLER: WE BEGIN WITH FEDERAL RESERVE CHAIRMAN JEROME POWELL FROM THE POLICY SYMPOSIUM. HE DISCUSSED THE SHIFT IN POLICY STANCE FOLLOWING RECENT DATA. CHAIR POWELL: THE STABILITY OF THE UNEMPLOYMENT RATE AND LABOR MARKET MEASURES ALLOWS US TO PROCEED CAREFULLY WITH CHANGES TO THE POLICY STANCE. NONETHELESS FOR THE SHIFTING BALANCE OF RISKS MAY WARRANT ADJUSTING OUR POLICY STANCE. TYLER: JOINING US NOW FOR MORE LIVE FROM JACKSON HOLE, WYOMING FOLLOWING CHAIR POWELL'S REMARKS IS BLOOMBERG MICHAEL MCKEE. WHAT DETAILS DID WE REALLY GLEAN FROM THE FED CHAIR? MIKE: YOU NOTICE HE QUALIFIED IT IN THAT STATEMENT SAYING IT MAY BE TIME TO ADJUST OUR RATE, BUT THE MARKET DOES NOT DO NUANCE. THEY READ THAT WE WILL CUT RATES SEPTEMBER 17. PEOPLE THOUGHT HE WOULD BE A LITTLE BIT MORE CAUTIOUS AND TRY TO HEDGE BETS. WE HAVE TWO THINGS GOING ON. WE HAVE THE LABOR MARKET WEAKENING AND THAT WOULD REQUIRE ONE KIND OF MONETARY POLICY. THAT WOULD REQUIRE ANOTHER RESPONSE. THEY SAID IT WILL BE A FASTER REACTION THAN INFLATION. INFLATION WILL TAKE LONGER TO SHOW UP BECAUSE IT HAS TO GO SECTOR BY SECTOR AND COUNTRY BY COUNTRY. AND SO THEY THINK THE IMMEDIATE DANGER IS MORE IN THE LABOR MARKET. WE WILL HAVE TO SEE WHAT HAPPENS WHEN WE GET THE PAYROLLS REPORT AND THE NEXT CPI REPORT BUT FOR RIGHT NOW IT LOOKS LIKE THEY ARE POISED TO CUT RATES. MICHAEL: BLOOMBERG'S MICHAEL MCKEE, THANK YOU. THIS AFTERNOON A REPORT CIRCULATED THAT PRESIDENT DONALD TRUMP WILL BE MEETING WITH THE INTEL CEO AT THE WHITE HOUSE TODAY. THIS COMES MOMENTS AFTER THE PRESIDENT ANNOUNCED THE CHIPMAKER HAD AGREED TO GIVE THE U.S. A 10% STAKE IN THE COMPANY. TAKE A LISTEN. > > I THINK THE UNITED STATES SHOULD BE GIVEN 10% OF INTEL. AND HE SAID I WOULD CONSIDER THAT. I SAID, I WOULD LIKE YOU TO DO THAT BECAUSE INTEL HAS BEEN LEFT BEHIND. MICHAEL: JOINING US NOW WITH THE LATEST FROM PRESIDENT DONALD TRUMP'S ANNOUNCEMENT TODAY IS SKYLER WOODHOUSE WHO IS WITH US FROM THE WHITE HOUSE NORTH LAWN. WE HAVE GOTTEN SOME MORE DETAILS ON WHAT THE DEAL IS LOOKING LIKE. CAN YOU GO THROUGH THEM AND ALSO LAY OUT A LITTLE BIT ABOUT HOW THE PRESIDENT DESCRIBED THE WAY THE DEAL CAME ABOUT? > > ABSOLUTELY. THIS IS REALLY PRESIDENT TRUMP'S LATEST MOVE. BRINGING MANUFACTURING BACK TO THE U.S., SOTO SETTING THE PRECEDENT THAT THE U.S. IS THIS DOMINANT GLOBAL PARTNER. HE HAS SAID SINCE TAKING OFFICE THAT THE U.S. IS SORT OF GOING TO YOU NO SET ITS MARK ON THE WORLD. THIS IS WHAT WE ARE SEEING WITH INTEL AND THE U.S. TAKING A 10% STAKE IN THE AMERICAN COMPANY. IT IS STUNNING THE WAY THE U.S. HAS INTERVENED. WE WILL HAVE TO SEE. WHAT WE HAVE RECEIVED, MEETING WITH THE INTEL CEO, THAT THE U.S. WILL GET 9.9% AND FULLY DILUTED COMMON SHARES. WE WILL SEE WHEN THIS TAKES EFFECT. THIS IS PRESIDENT TRUMP LEANING INTO AMERICAN DOMINANCE AND STATECRAFT. TYLER: THE OTHER TOP STORY WE ARE FOLLOWING IS THE PRESSURE CAMPAIGN. LET'S TAKE A LISTEN TO WHAT HE HAD TO SAY ABOUT LISA COOK. > > THE FED GOVERNOR? PRES. TRUMP: I WILL FIRE HER IF SHE DOESN'T RESIGN. WHAT SHE DID WAS BAD. I WILL FIRE HER IF SHE DOESN'T RESIGN. SKYLAR: WE SHOULD GIVE THE CONTEXT THAT HE IS ELEVATING IT AND THEY ARE JUST ALLEGATIONS, NO FORMAL CHARGES HAVE BEEN FILED. WHAT DO WE KNOW ABOUT THE LEGAL BASIS THAT PRESIDENT TRUMP MIGHT BE CONSIDERING AND WHAT DOES THIS TELL US ABOUT THE WHITE HOUSE'S STRATEGY WHEN IT COMES TO THE PRESSURE ON THE CENTRAL BANK? SKYLAR: HE IS LOOKING TO WIN THE MAJORITY ACROSS THE FED BOARD. IF HE IS ABLE TO REMOVE A FED GOVERNOR LISA COOK, WHETHER THAT IS HER RESIGNING WITH HER OWN MERIT AND THAT GIVES TRUMP THE OPPORTUNITY TO BRING IN THE NEW BOARD. WHAT WE HAVE SEEN FROM PRESIDENT TRUMP, WE HAVE SEEN THE REPEATED ATTACKS. THIS IS FED CHAIR JEROME POWELL. THIS IS THE NEXT STEP IN HIM CONTINUING HIS WAR AGAINST THE FED. PRESIDENT TRUMP TODAY DID NOT SAY HOW LONG HE WOULD GIVE LISA COOK TO EVALUATE IF HE WOULD RESIGN. TYLER: A VERY HIGH LEGAL BAR OF PRESIDENT TRUMP WERE TO DO SO. SKYLER WOODHOUSE, WE THINK YOU SO MUCH FOR YOUR REPORTING. I'M PLEASED TO SAY WE'RE JOINED NOW BY ESTHER GEORGE, THE FORMER PRESIDENT OF THE FEDERAL RESERVE BANK OF KANSAS CITY. SHE IS LIVE WITH US FROM JACKSON HOLE WYOMING. THANK YOU SO MUCH FOR BEING HERE. I WANT TO PICK UP THIS CONVERSATION WHEN IT DOES COME TO THE WHITE HOUSE'S PRESSURE CAMPAIGN. DO YOU THINK THAT THERE IS RISK TO FED CREDIBILITY IF AND WHEN THE FED DOES CUT RATES? > > THAT'S ALWAYS THE CONCERN BECAUSE THE FED HAS BEEN DESIGNED TO BE INSULATED FROM THE PRESSURE AND THE MORE THAT PRESSURE COMES TO BEAR IT BEGINS TO CREATE A CLOUD OVER THEIR DECISION-MAKING. I THINK THAT IS NOT TRUE FOR THE INDIVIDUALS AROUND THE TABLE. THEY ARE QUITE FOCUSED ON THEIR RESPONSIBILITIES TO THE AMERICAN PUBLIC. THE COMMUNICATION THAT RUNS INTO THIS ISSUE CAN BECOME MORE DIFFICULT. MICHAEL: WERE YOU EXPECTING TO HEAR A LITTLE BIT MORE FROM JEROME POWELL IN DEFENSE OF CENTRAL-BANK INDEPENDENCE GIVEN THAT THIS IS IN ESSENCE HIS VALEDICTORY SPEECH AT JACKSON HOLE? > > YES, I WASN'T SURPRISED. HE HAS BEEN VERY CLEAR HE IS FOCUSED ON THE JOB THAT WAS GIVEN TO THE COMMITTEE. TALKING ABOUT THE ECONOMY. TALKING ABOUT HOW THE FED GOES ABOUT ITS BUSINESS I THINK WAS HIS WAY OF SAYING WE ARE STICKING TO THE BUSINESS AT HAND. I THINK THAT WAS APPROPRIATE FOR HIM. TYLER: LET'S PICK UP ON THAT FRAMEWORK BECAUSE I DO WANT TO ASK YOU ABOUT INFLATION CONCERNS BECAUSE THE MONETARY POLICY FRAMEWORK REVIEW WAS REVISED. WHAT CAN THE FED DO IF YOU WERE ADVISING HERE TO KEEP CONSUMER EXPECTATIONS WELL ANCHORED WHEN WE HAVEN'T SEEN THEM DELIVER IN RECENT MEMORY ON THAT 2% TARGET? > > I THINK IT'S UP AT A BIG ISSUE RIGHT NOW FOR THE FEDERAL RESERVE AND YOU HEARD THE CHAIRMAN CHARACTERIZE THE UPSIDE RISK TO INFLATION THAT EXISTS. YOU HEARD HIS EMPHASIS IN THE FRAMEWORK REVIEW, THAT HAVING WELL ANCHORED LONG-RUN INFLATION EXPECTATIONS WOULD BE CRITICAL FOR THE COMMITTEE TO DO ITS WORK. RIGHT NOW DEPENDING ON WHERE YOU ARE LOOKING FOR EVIDENCE OF THAT ANCHORING, I THINK YOU HAVE CONSUMERS FEELING ONE WAY, YOU HAVE BUSINESSES THINKING ABOUT HOW THE INFLATION PRESSURES THAT LIE AHEAD MIGHT BE AFFECTING THEM SO I THINK IT CREATES A TENTATIVE ENVIRONMENT, IF YOU WILL, ABOUT WHAT THE PUBLIC EXPECTS INFLATION TO BE DOWN THE ROAD AND THAT OF COURSE IS GOING TO BE ONE OF THE COMMITTEE'S BIGGEST CHALLENGES AHEAD. YOU HAVE AN INFLATION DYNAMIC RIGHT NOW WHERE INFLATION WAS ALREADY RUNNING WELL ABOVE THE FED STATED TARGET. THEIR DEFINITION OF PRICE STABILITY. NOW YOU HAVE THE TARIFF EFFECTS, WHICH THE COMMITTEE MIGHT BE WILLING TO LOOK THROUGH BUT IT BECOMES PRETTY DIFFICULT TO DISENTANGLE WHERE SOME OF THOSE EFFECTS ARE COMING FROM. IT IS THE TIME I THINK OF REALLY HAVING TO LEAN IN TO WHERE ARE THE RISKS AROUND THIS MONETARY POLICY? MICHAEL: I WANTED TO DIAL INTO THE QUESTION OF TARIFFS AND THEIR IMPACT ON PRICES AND TODAY DURING HIS REMARKS, JEROME POWELL DID INDICATE THAT HE SAW IT MORE AS A FLEETING IMPACT ON INFLATION RATHER THAN SOMETHING THAT WOULD BE PERSISTENT. HE DIDN'T RULE OUT THE LATTER SCENARIO ENTIRELY. WHAT IS YOUR VIEW ABOUT THE RISK DOWN THE ROAD, GIVEN THAT THE ADMINISTRATION IS NOT DONE WITH THE IMPOSITION OF TARIFFS? > > I THINK THAT IS WHY THIS QUESTION BECOMES SO DIFFICULT TO ANSWER. IF TARIFFS WERE COMING IN ONE DISCRETE MOVE IN A VERY PRECISE AMOUNT, YOU MIGHT FEEL MORE COMFORTABLE SAYING THIS IS A ONE-TIME HIT TO THE PRICE LEVEL AND WE CAN LOOK THROUGH THAT. THE TRUTH IS YOU NOW HAVE INFLATION THAT IS REACTING TO HOW THE TARIFFS ARE BEING CARRIED OUT. THEY ARE BEING CARRIED OUT WITH A FAIR AMOUNT OF DISCRETION BY COUNTRY, COMPANIES WILL BE RESPONDING TO THOSE IN DIFFERENT WAYS I THINK THAT IS WHY IT WILL BE DIFFICULT AND FRANKLY MORE CHALLENGING AS THEY TRY TO KEEP THE INFLATION EXPECTATION ANCHORED TO KNOW WHAT IS DRIVING THE IMPACT OF INFLATION HERE. IT CREATES A LOT OF UNCERTAINTY AND I THINK YOU HEARD THAT TODAY, THIS IS BEING CONDUCTED IN SIGNIFICANT UNCERTAINTY. > > WE ARE JEROME POWELL TALK ABOUT HOW TIGHTENING IMMIGRATION POLICY IS IMPACTING THE LABOR MARKET AND THEM CURIOUS WHAT YOU THING ABOUT THIS AS FIRMS TRY TO AVOID -- ABSORB EXCESS COSTS. WILL THEY BE FACED WITH HIGHER LABOR COSTS AS WE WATCH MORE OF THE ADMINISTRATION POLICIES PLAY OUT? > > I THINK THIS IS ALSO A VERY OPEN QUESTION. DIANE -- THE DYNAMICS BETWEEN THESE TWO ARE GOING TO BE WORTH WATCHING. WE WILL BE WATCHING FOR THE WAGE IMPACT AS WE SEE PRICE EFFECTS COME INTO PLAY. WE WILL HAVE TO LOOK AT WHETHER THEIR ABILITY TO PASS ON COSTS, PAY WORKERS, ALL OF THAT MAKES IS GOING TO BE VERY IMPORTANT AND HOW THE FED JUDGES WHAT ITS NEXT STEPS ARE? THOSE TWO ARE TIGHTLY LINKED. WE HEARD THE CHAIRMAN SAY THE LABOR MARKET IS REACTING TO SUPPLY AND DEMAND FACTORS. I THINK HE USED THE WORD A CURIOUS MIX TO COME UP WITH THE CURRENT UNEMPLOYMENT RATE. IT'S A TIME OF UNCERTAINTY. UNDERSTANDING THE DYNAMICS AFFECTING PRICE INFLATION AND LABOR RATES IS GOING TO BE IMPORTANT FOR THEM TO DECIPHER. MICHAEL: ESTHER GEORGE, THANK YOU SO MUCH. COMING UP, VOLODYMYR ZELENSKYY SAYS ONLY PRESIDENT TRUMP CAN STOP PUTIN. WE WILL DISCUSS WITH EVELYN FARKAS OF THE MCCAIN INSTITUTE. CANADA SAYS THEY WILL REMOVE RETALIATORY TARIFFS. WE WILL DISCUSS THIS WITH DOMINIC LEBLANC. ♪ CHAIR POWELL: IS REMOVING HIS RETALIATORY TARIFFS WHICH I THOUGHT WAS NICE AND WE WILL HAVE ANOTHER CALL SOON. WE HAD A VERY GOOD CALL. I LIKE HIM. I'M FIGHTING FOR THE UNITED STATES. CANADA AND MEXICO TAKE A LOT OF OUR BUSINESS OVER 25 OR 30 YEARS. MICHAEL: THAT WAS PRESIDENT TRUMP EARLIER TODAY DISCUSSING CANADIAN PRIME MINISTER MARK CARNEY'S DECISION TO REMOVE RETALIATORY TARIFFS ON U.S. PRODUCTS THAT COMPLY WITH THE USMCA DEAL THAT APPEARS TO BE IN ALL OF BRANCH TO THE U.S. AFTER MONTHS OF TRADE NEGOTIATIONS. JOINING US NOW IS DOMINIC LEBLANC, PRESIDENT OF THE KINGS PRIVY COUNCIL OF CANADA AND THE MINISTER RESPONSIBLE FOR CANADA-U.S. TRADE. THANK YOU FOR JOINING US. DOMINIC: GOOD EVENING. MICHAEL: THIS IS COMING ACROSS AS SOMETHING OF AN OLIVE BRANCH TO THE U.S., BUT WHAT IS CANADA GETTING IN RETURN AT THIS MOMENT AND THEN DOWN THE ROAD FROM THIS GESTURE? DOMINIC: THANK YOU FOR THE QUESTION. AS THE PRESIDENT SAID TODAY AND AS HE SAID TO THE PRIME MINISTER IN WHAT WE THOUGHT WAS A POSITIVE TELEPHONE CONVERSATION YESTERDAY, IF WE ARE PREPARING FOR A REVIEW OF THE USMCA OF THE TRADE AGREEMENT WHICH IS BUILT INTO THE AGREEMENT IN 2026, THE AMERICANS HAD IN THEIR TARIFFS, RESPECTED IMPORTS THAT WERE COMPLIANT TO THE USMCA AGREEMENT AND WE THOUGHT IT WAS APPROPRIATE FOR CANADA TO ASSUME A SIMILAR POSTURE. WE WANTED TO ENSURE THAT WE WERE RESPECTING THOSE GOODS THAT ARE COMPLIANT WITH THE USMCA. BASED ON MY CONVERSATIONS WITH SECRETARY LUTNICK, THE PRIME MINISTER SPEAKING ON PRESIDENT, WE ARE OPTIMISTIC WE CAN WORK WITH PRESIDENT TRUMP AND HIS ADMINISTRATION AND COME TO AN AGREEMENT THAT CAN BE BENEFICIAL FOR THE ECONOMY OF BOTH COUNTRIES. THERE ARE SO MANY THINGS WE CAN DO COLLABORATIVELY. THE ECONOMIES ARE SO INTEGRATED AND STRATEGIC SECTORS IMPORTANT TO THE PRESIDENT, WE THINK THIS IS A POSITIVE THING WE CAN DO. TYLER: I DO WANT TO DRILL DOWN ON THE STRATEGIC SECTORS AND ASK IN NEGOTIATIONS ARE GOING WHEN IT COMES TO STEEL AND ALUMINUM TARIFFS. 50% LEVEES OF COURSE A VERY HIGH RATE. HAVE YOU GOTTEN ANY INDICATIONS THAT THAT RATE IS GOING TO COME DOWN? DOMINIC: NO, NOT YET. WE ARE OPTIMISTIC AND CONTINUING TO TALK TO SECRETARY LUTNICK AND AMBASSADOR GREER AND OTHERS IN THE ADMINISTRATION. YOUR QUESTION IS A GOOD ONE. THE SECTION 232 TARIFFS ON THE STRATEGIC SECTORS THE PRESIDENT HAS APPLIED WITH VERY LITTLE RELIEF, THOSE TARIFFS INCLUDING AGREEMENT SIGNED WITH THE EUROPEAN UNION OR THE UNITED KINGDOM, SO OTHER MAJOR TRADING PARTNERS HAVE NOT GOTTEN MUCH RELIEF FROM THE 232 TARIFFS. THE DIFFERENCE WITH CANADA IS THAT THOSE ARE PRECISELY THE PARTS OF OUR ECONOMIES THAT ARE MOST INTEGRATED. WHETHER THE AUTOMOBILE TARIFFS, ALUMINUM, AUTOMOBILE IS ANOTHER EXAMPLE. FOR DECADES, WE HAVE INTEGRATED SUPPLY CHAIN, JUST-IN-TIME DELIVERY. I'VE SAID BEFORE, CANADA AND THE UNITED STATES DON'T AS MUCH SELL THINGS TO EACH OTHER, BUT BUILD THINGS TOGETHER AND SELL THEM AROUND THE WORLD. WE HAVE TAKEN VERY TOUGH MEASURES AS HAS THE UNITED STATES WITH RESPECT TO DUMPING FROM COUNTRIES LIKE CHINA OF STEEL AND ALUMINUM AND WE ARE OPTIMISTIC WE CAN CONTINUE TO HAVE THOSE CONVERSATIONS WITH PRESIDENT TRUMP'S ADMINISTRATION AND MAKE THE CASE FOR AN ECONOMIC OPPORTUNITY FOR BOTH COUNTRIES IF WE RESET SOME OF THOSE TARIFFS. MICHAEL: I NUMBER OF OTHER U.S. TRADING PARTNERS INCLUDING JAPAN AND THE EUROPEAN UNION HAVE MADE INVESTMENT PLEDGES IN THE U.S. AS A WAY OF PERHAPS LOWERING THE TARIFF BURDEN THEY MIGHT FACE FROM WASHINGTON ULTIMATELY. IS CANADA CONSIDERING MAKING A SIMILAR COMMITMENT TO INVEST IN THE U.S. THE WAY THAT OTHER TRADING PARTNERS HAVE SO FAR? DOMINIC: THOSE HAVE ABSOLUTELY BEEN PART OF OUR DISCUSSIONS WITH PRESIDENT TRUMP'S ADMINISTRATION. CANADA IS ALREADY THE SECOND MOST IMPORTANT FOREIGN DIRECT INVESTOR IN THE U.S. ECONOMY. IF YOU TAKE JUST THE PENSION FUNDS IN CANADA, THERE ARE EIGHT LARGE PENSION FUNDS THAT INVEST AROUND THE WORLD. IF YOU TAKE THAT ENTERPRISE VALUE, IT IS ALMOST ONE TRILLION DOLLARS OF INVESTMENT IN THE UNITED STATES ECONOMY AND THAT FIGURE CAN GROW $100 BILLION A YEAR. TO ANSWER YOUR QUESTION DIRECTLY , THERE ARE NUMEROUS EXAMPLES WERE CANADIAN PRIVATE SECTOR AND BECAUSE I PUBLIC-SECTOR CAN INVEST IN VERY IMPORTANT SECTORS TO PRESIDENT TRUMP AND THE U.S. ECONOMY. YOU COULD THINK OF ENERGY, MINERAL PROJECTS. BUT WE CAN ALSO INVEST IN CANADA AND DO THINGS JOINTLY, DEFENSE, SECURITY, JUST TO OFFER89 TWO QUICK EXAMPLES AGAIN WHERE CANADA AND THE UNITED STATES, WE ARE INCREASING INVESTMENTS IN THOSE SECTORS. TYLER: IN THE FINAL MINUTES WE HAVE WITH YOU, I WANT TO ASK YOU ABOUT THIS IDEA THAT CANADA WAS REALLY ONE OF THE ONLY COUNTRIES TO RETALIATE AGAINST PRESIDENT TRUMP'S TARIFF PLANS AND WHEN YOU HAVE SEEN THE MORE PREFERENTIAL RATES OTHER TRADING PARTNERS HAVE BEEN ABLE TO SECURE, AND RETROSPECT WOULD YOU HAVE TAKEN THE SAME TACK? DOMINIC: SURE, I THING WE WOULD HAVE. I THINK THE CIRCUMSTANCE OF LAST FEBRUARY OR MARCH IS DIFFERENT THAN THE CIRCUMSTANCE AT THE END OF AUGUST. THE U.S. ADMINISTRATION HAS BEEN CLEAR IN TERMS OF THE 232 SECTORAL TARIFFS. WE HAVE SEEN THE AGREEMENTS THEY HAVE SIGNED WITH OTHER COUNTRIES THAT HAVE NOT PROVIDED MUCH RELIEF IN THE 232 SECTORAL TARIFFS. THE FACT THAT PRESIDENT TRUMP AND HIS EXECUTIVE ORDER AT THE END OF JULY CONFIRMED ACCORDING TO IMPORTS THAT THEY ARE COMPLIANT WITH THE USMCA FREE-TRADE AGREEMENT MEANS CANADA SHOULD MIRROR THAT EXEMPTION AND THAT IS THE DECISION PRIME MINISTER CARNEY ANNOUNCED TODAY. WE BELIEVE IN THE USMCA. WE BELIEVE IT IS IN THE INTEREST OF THE CANADIAN AND AMERICAN AND MEXICAN ECONOMIES, THAT WE STRENGTHEN AND COMMIT OURSELVES TO THAT AGREEMENT. PRESIDENT TRUMP DID THAT WITH THE CARVEOUT HE PROVIDED CANADA, WHICH PUTS US AT A MARGINAL ADVANTAGE TO OTHER COUNTRIES. BUT WE WANT TO RESPECT THAT COMMITMENT AND ENSURE WE ARE ALSO MIRRORING THAT DECISION PRESIDENT TRUMP MADE. TYLER: ALL RIGHT, DOMINIC LEBLANC, PRESIDENT OF THE KINGS PRIVY COUNCIL FOR CANADA AND THE MINISTER RESPONSIBLE FOR CANADA-U.S. TRADE. THINK YOU SO MUCH. MIKE, THIS IS A STORY WE WATCH VERY CLOSELY AT BLOOMBERG AND WHEN YOU LOOK AT THE OTHER MORE PREFERENTIAL RATES OTHER COUNTRIES HAVE BEEN ABLE TO SECURE, WE'VE BEEN WAITING FOR SOME SET OF UPDATE FROM CANADA. MICHAEL: IT IS SUCH AN IMPORTANT TRADE RELATIONSHIP YET IT IS ONE THAT HAD REALLY GONE OFF THE RAILS FROM THE TIME THAT DONALD TRUMP TOOK OFFICE. THEY REALLY HAVE BEEN AT LOGGERHEADS AND HAVING DIFFICULTY IN REACHING THIS UNDERSTANDING AND MAYBE WE HAVE A PATH THROUGH INVESTMENT. TYLER: ALL RIGHT, WE WILL CONTINUE THAT CONVERSATION, BUT COMING UP FIRST, A FEDERAL JUDGE HAS ORDERED ALLIGATOR ALCATRAZ MUST WIND DOWN OPERATIONS. WE WILL BRING YOU THOSE DETAILS AND THE LATEST ON THE WAR IN UKRAINE. THIS IS BLOOMBERG. ♪ > > THE BASELINE OUTLOOK AND SHIFTING BALANCE OF RISKS MAY WARRANT ADJUSTING OUR POLICY STANCE. OUR POLICY IS RESTRICTIVE MODESTLY SO IN MY VIEW. LABOR MARKET MEASURES ALLOWS US TO PROCEED CAREFULLY. THE LABOR MARKET SEEMS TO BE IN BALANCE BUT IT'S A CURIOUS BALANCE. AS REFLECTED IN MARKET AND SURVEY BASED MEASURES APPEAR TO BE ANCHORED. WE WON'T ALLOW THIS TO BECOME AN ONGOING INFLATION PROBLEM. TYLER: THAT WAS FED CHAIR JEROME POWELL DELIVERING HIS SPEECHES AS THE HEAD OF THE CENTRAL BANK. THEORIES ABOUT A POSSIBLE RATE CUT IS WHAT WALL STREET WANTED TO HEAR. WE TURN TO VONNIE QUINN. THAT REALLY IS THE QUESTION, ARE TRAITORS ONLY HEARING WHAT THEY WANTED TO HEAR? WERE THERE NOT HAWKISH NOTES THAT COULD BE DIVINED? VONNIE: IT'S FUNNY YOU MENTION THAT, OUR OWN ANNA WONG IS POINTING TO THAT, SAYING THERE ARE PLENTY OF HAWKISH NOTES TO THE SPEECH. FERTILITY IN THE LABOR MARKET THAT MIGHT GET WORSE, AND THE FED CHAIR POINTED TO OTHER SCENARIOS THAT COULD COME TO FRUITION SUCH AS TARIFF AFFECTS HAVING A LONGER-TERM IMPACT ON INFLATION OR EXPECTATIONS, WHICH WOULD BE SOMETHING THE FED WOULD BE WORRIED ABOUT BECAUSE IT WOULD IMPACT THE CONSUMER GREATLY. AS YOU MENTIONED, MARKETS TOOK THE SIGNAL FOR A SEPTEMBER CUT AND RAN WITH IT COME UPRISING ABOUT A 90% CHANCE OF A CUT IN SEPTEMBER AGAIN. NOT FULLY 100% BUT A 90% CHANCE AND MAJOR INDEXES WERE HIGHER ON THE DAY. THE DOW JONES INDUSTRIAL AVERAGE HAD ITS FIRST RECORD THIS YEAR, IT HADN'T BEEN THIS HIGH SINCE LAST DECEMBER. SAME FOR THE S & P 500, IT REVERSED THE KLEINS. THE NASDAQ 100 AND IN THE WEEK POSITIVELY. YIELDS ARE WHERE YOU SAW THE MOST REACTION. THE TWO YEAR YIELD DROPPING NEARLY 11.5 BASIS POINTS ON THE SESSION, INCREDIBLE PLUMMETING ON THE FRONT END, THE MOST SENSITIVE PART OF THE CURVE TO WHATEVER THE FED DECIDES TO DO NEXT. TRADERS WILL BE LOOKING TO OCTOBER AND DECEMBER TO THE NEXT FED AND PERHAPS AFTER A BREAK, WHAT THE FED WILL DO BUT THERE'S MORE DATA, INFLATION DATA NEXT FRIDAY AND THE SEPTEMBER JOBS REPORT AT THE BEGINNING OF SEPTEMBER AS WELL. I WANT TO POINT TO THE WEAKER DOLLAR, IT WILL HAVE AN IMPACT ON OUR TRADING PARTNERS. AND OTHER POLITICAL NEWS TODAY, THE STAKE IN INTEL. THE PRESIDENT TWEETING OUT THAT THEY REACHED A DEAL WITH THE CEO OF INTEL, TALKING ABOUT THE 10% GOVERNMENT SHARE IS VALUED AT ROUGHLY $11 BILLION, A VERY UNORTHODOX DEAL. WE HAVEN'T SEEN THE GOVERNMENT TAKE A STAKE LIKE THIS SINCE THE FINANCIAL CRISIS. WE LEARNED FROM INTEL EARLIER IT WILL BE A PASSIVE OWNERSHIP STAKE, THE U.S. GOVERNMENT HAS AGREED TO VOTE WITH THE BOARD. THE U.S. WILL GET AN ADDITIONAL 5% OF INTEL, ALMOST A 15% STAKE, ONCE IT FULLY VESTS. THE PRESIDENT TWEETING THIS OUT A FEW MOMENTS AGO. THOSE SHARES WERE HIGHER, AS WAS THE BROADER MARKET AS THE MARKET DIGESTS WHAT THIS MEANS. ANOTHER STORY FOR YOU SIRI USERS, IT LOOKS LIKE APPLE IS EXPLORING GOOGLE GEMINI TO MAKE IT BETTER. I KNOW SOME PEOPLE WOULD LIKE THAT. IT'S ALSO IN TALKS WITH OTHERS LIKE OPENAI. OUR REPORTER CALLED IT A LITTLE BIT OF A BAKE-OFF AND IT WILL COME DOWN TO COST AND WHOSE MODEL WORKS THE BEST. TYLER: A GREAT ROUND UP BY VONNIE QUINN. THANK YOU. WE TURN TO OVERSEAS AND THE WAR IN UKRAINE AFTER PRESIDENT TRUMP TOLD REPORTERS THIS AFTERNOON HE'S NOT HAPPY ABOUT WHAT'S HAPPENING IN THE RUSSIA-UKRAINE TALKS, BUT HE'S GIVING THE RUSSIAN PRESIDENT ANOTHER TWO WEEK DEADLINE TO COME TO THE TABLE. > > I'M NOT HAPPY ABOUT ANYTHING ABOUT THAT WAR, NOTHING, NOT HAPPY AT ALL. WE WILL SEE WHAT HAPPENS. THE NEXT TWO WEEKS WE WILL FIND OUT WHICH WAY YOU WILL GO AND I BETTER BE VERY HAPPY. TYLER: JOINING US NOW WITH ANALYSIS IS EVELYN FARKAS FROM ARIZONA STATE UNIVERSITY. IT'S GOOD TO SEE YOU AND THANK YOU FOR BEING HERE. WE HEARD FROM THE UKRAINIAN PRESIDENT EARLIER TODAY, WHO SAID PRESIDENT TRUMP IS CURRENTLY THE ONLY PERSON WHO CAN STOP PUTIN. CAN YOU PUT THIS INTO CONTEXT, IS THAT THE RIGHT ASSESSMENT? HOW MUCH LEVERAGE DOES THE U.S. PRESIDENT HAVE WHEN IT COMES TO TRYING TO GET THE WAR TO END? EVELYN: I WOULD AGREE. IF THERE'S A SINGLE PERSON WHO CAN PUT AN END TO THE WAR, IT'S VLADIMIR PUTIN BECAUSE HE IS WAGING WAR AGAINST UKRAINE AND UKRAINE DOESN'T WANT A WAR, THEY WOULD PUT DOWN THEIR WAR -- THEIR WEAPONS THE MOMENT RUSSIA IS WILLING TO MAKE PEACE. SHORT OF VLADIMIR PUTIN, THE NEXT PERSON WITH THE CARDS AND INFLUENCE TO MAKE THE WAR AND IS PRESIDENT TRUMP. IT REQUIRES US TO PUT MORE PRESSURE ON THE KREMLIN. THAT MEANS SANCTIONS, PROVIDING MORE WEAPONS TO UKRAINE AND I'M GLAD TO SEE PRESIDENT TRUMP IS THREATENING SANCTIONS AGAIN ALTHOUGH I WILL SAY I DON'T KNOW WHY HE'S WAITING TWO WEEKS BECAUSE PRESIDENT PUTIN HAS CLEARLY BEEN PLAYING FOR TIME TO GET HIS TROOPS MORE TIME ON THE BATTLEFIELD AND THAT'S NOT IN THE INTEREST OF THE UNITED STATES. MICHAEL: WE'VE HEARD FROM THE RUSSIAN FOREIGN MINISTER ESSENTIALLY THAT THEY HAVE VERY LITTLE INTEREST IN A MEETING RIGHT NOW. HE WAS DISMISSIVE IN AN INTERVIEW ON MEET THE PRESS, IT WILL AIR THIS WEEKEND, OF THE IDEA OF A MEETING BETWEEN VLADIMIR PUTIN AND PRESIDENT ZELENSKYY, AND YET DONALD TRUMP SIGNALING HE COULD GIVE AS MUCH AS TWO WEEKS TO THE RUSSIAN LEADER. IS THAT TOO MUCH TIME? SHOULD DONALD TRUMP TURN AROUND AND SAY IT'S TIME TO MOVE ON SANCTIONS? EVELYN: YES, HE SHOULD HAVE DONE THAT WHEN THE RUSSIAN PRESIDENT REFUSED HIS CEASE-FIRE ULTIMATUM AT THE MEETING IN ALASKA LAST FRIDAY. I THINK OUR PRESIDENT IS BEING WAY TOO LENIENT WHEN IT COMES TO VLADIMIR PUTIN AND WE HAVE ALL THE POWER TO MAKE VLADIMIR PUTIN SO AFRAID THAT WHEN PRESIDENT TRUMP THREATENED SANCTIONS BEFORE, PUTIN SAID DON'T SANCTION ME, I WILL MEET YOU IN ALASKA. HE CAME TO ALASKA AND PRESIDENT TRUMP SAID YOU NEED TO GIVE US A CEASE-FIRE AND START NEGOTIATING IN EARNEST AND PRESIDENT PUTIN SAID NO, WENT AWAY, AND I GUESS GAVE PRESIDENT TRUMP THE IMPRESSION HE WOULD MEET WITH PRESIDENT ZELENSKYY ONE-ON-ONE. THOSE OF US WHO KNOW HOW PUTIN THINKS AND UNDERSTAND THE IDEOLOGY DRIVING HIM KNOW THAT HE DOESN'T BREW PRESIDENT -- VIEW PRESIDENT ZELENSKYY AS AN EQUAL AND HE WOULD NEVER MEET ONE ON ONE UNLESS HE WAS DEFEATED MILITARILY AND PRESIDENT TRUMP INSISTED ON IT. I THINK THE RUSSIANS HAVE BEEN MISLEADING OUR PRESIDENT AND WE NEED TO SLAPS SANCTIONS ON AS YOU SAID IMMEDIATELY. TYLER: WE ARE SHOWING PRESIDENT TRUMP, IN THE OVAL OFFICE EARLIER TODAY SHOWING A PICTURE OF HIMSELF AND PRESIDENT PUTIN. ONE OF THE MAIN THREATS WE'VE BEEN FOLLOWING THIS WEEK HAS BEEN THE IDEA OF EUROPE AND THE U.S. TRYING TO GET SOMETHING ON PAPER WHEN IT COMES TO SECURITY GUARANTEES. THAT HAS BEEN DOMINATING THE CONVERSATION, THERE SEEMED TO BE OPTIMISM AT THE START OF THE WEEK AND NOW WE SEE ROADBLOCKS AND REPORTING INDICATES A LOT IS COMING FROM RUSSIA WANTING TO HAVE A SAY IN WHAT SECURITY GUARANTEES ARE GOING TO LOOK LIKE. I KNOW YOU'RE TALKING ABOUT THE U.S. GIVING PERHAPS MORE WEAPONS AND SUPPORT BUT WHEN IT COMES TO LONG-TERM GUARANTEES, WHAT IS REALISTIC TO EXPECT? WHAT CONNECTION GET DONE THAT WOULD GET A DEAL OVER THE FINISH LINE? EVELYN: THAT'S A REALLY GOOD QUESTION BECAUSE WHAT IS THE RIGHT THING TO DO, THE SMART THING TO DO, MIGHT NOT BE REALISTIC YET. AT THE MOMENT, THE RIGHT THING TO DO IS TO GIVE AN ARTICLE FIVE LIKE AGREEMENT TO UKRAINE, MEANING THE UNITED STATES WILL COME TO UKRAINE'S MILITARY DEFENSE IN EVERY WAY POSSIBLE. ONE BETTER WOULD BE TO INCLUDE UKRAINE AND NATO, THEY DESERVE IT, THEY ARE THE LARGEST FIGHTING POWER BECAUSE OF THE WAR THRUST ON THEM, AND IT WOULD BE HORRIBLE IF THEY WERE ON THE OTHER SIDE OF THE EQUATION IF RUSSIA CONQUERED THEM. THAT WOULD BE THE BEST CASE SCENARIO. UNFORTUNATELY, THE RUSSIANS SOMETIMES GIVE PRESIDENT TRUMP THE IMPRESSION, THEY BE WEEK THEY GAVE THE IMPRESSION THEY WOULD BE WILLING TO HAVE TRIPWIRE TROOPS ON UKRAINIAN TERRITORY AND NOW THE RUSSIANS ARE SAYING NO WAY. AT THE END OF THE DAY THE UKRAINIANS WILL WANT FOREIGN TROOPS TO GUARANTEE THAT PIECE BUT THEY ALSO WANT AN ARTICLE FIVE AARON T, THAT IF THEY ARE AGAIN ATTACKED BY RUSSIA WE WILL COME TO DIRECT MILITARY ASSISTANCE. UKRAINE AS MUCH AS THEY WANT TO STOP THIS WAR, THEY DON'T WANT TO BE RE-INVADED BY RUSSIA AND THEY DON'T WANT TO CEASE-FIRE, THAT MEANS THEY HAVE TO BE ON ALERT AND CAN'T LIVE AS FREE PEOPLE BECAUSE RUSSIA IS GOING TO INVADE AGAIN. LET ME SAY ONE OTHER THING, CHINA IS WATCHING. IS NOT JUST ABOUT UKRAINE AND EUROPE. I'M AFRAID VLADIMIR PUTIN WILL TRY TO DISTRACT OR CHINA WILL TRY TO DISTRACT, AND CREATE MORE CONFUSION BY TRYING TO ATTACK TAIWAN OR THAT VLADIMIR PUTIN WILL CONDUCT SOME LOWER LEVEL MILITARY ACTION AGAINST A NATO ALLY. MICHAEL: I'M GLAD YOU BROUGHT UP CHINA BECAUSE NEXT WEEK XI JINPING IS HOSTING A MEETING OF THE EATERS OF RUSSIA, TURKEY AND INDIA. WE TALK ABOUT SECONDARY SANCTIONS, THESE ARE THE LARGEST TARGETS FOR DONALD TRUMP BUT IT WOULD BE AT ODDS WITH HIS VIEWS ON TRADE WITH THOSE ECONOMIES. EVELYN: THIS IS WHERE IT GETS COMPLICATED, PUTTING MORE TARIFFS ON CHINA AND IT COMES TO OIL AND GAS COULD BE PROBLEMATIC FOR THE UNITED STATES BECAUSE WE ARE ALSO TRYING TO WORK OUT AN OVERALL TARIFF DEAL WITH CHINA. WE DON'T WANT TO GLOBAL TRADE WAR AND THE STAKES ARE VERY HIGH WHEN IT COMES TO THE UNITED STATES AND CHINA. I THINK PRESIDENT TRUMP CASTAWAY THAT IN THE BALANCE BUT FRANKLY I THINK IF THE CHINESE ARE FACED WITH THAT KIND OF SANCTION MAYBE THEY WOULD PUT PRESSURE ON RUSSIA TO STOP THE WAR AND MAKE A DEAL. THESE ARE THE KIND OF THINGS ACTUALLY PRESIDENT TRUMP IS EQUIPPED TO ASSESS BECAUSE HE IS TO TAKE ON RISK IN A WAY THAT IS DIFFERENT FROM OTHER PRESIDENTS AND I GIVE HIM CREDIT FOR THAT BECAUSE HE'S NOT AFRAID TO SAY I PUT SANCTIONS ON IT. HE PUT HIGHER TARIFFS ON INDIA BECAUSE THEY WERE CONTINUING TO BUY OIL FROM RUSSIA, WHICH IS SOMETHING NO ONE FORESAW. MICHAEL: EVELYN FARKAS, DIRECTOR OF ARIZONA STATE UNIVERSITY'S MCCAIN INSTITUTE AND FORMER DEPUTY ASSISTANT SECRETARY OF DEFENSE. THANK YOU FOR YOUR INSIGHT. COMING UP, CLOSED DOOR TESTIMONY RELEASED TO CONGRESS. PLUS THE FBI RAID ON JOHN BOLTON WHEN WE ASSEMBLE OUR LOCAL PANEL NEXT ON \"BALANCE OF POWER.\" ♪ > > MOST FUNDAMENTAL, BOTTOM-LINE THING IS WE WANT AMERICA TO WIN THE GLOBAL AI RACE. THIS IS BEEN ONE OF THE PRESIDENT'S TOP PRIORITIES AND HE WANTS TO UNLEASH THE ANIMAL SPIRITS OF AMERICAN INNOVATION IN AI. MY JOB AS THE CONSUMER PROTECTION WATCHDOG IS TO MAKE SURE AS WE UNLEASH AMERICAN INNOVATION, CONSUMERS ARE BEING TOLD HONESTLY HOW AI PRODUCTS WORK, WHAT THEY CAN DO, WHAT THE CONSEQUENCES ARE. MICHAEL: THIS IS BALANCE OF POWER AND THAT WAS THE FTC CHAIR SPEAKING WITH BLOOMBERG EARLIER TODAY ON THE ADMINISTRATION APPROACH TO EMBRACING AND REGULATING ARTIFICIAL INTELLIGENCE. YOU CAN FIND THE INTERVIEW ONLINE AND ON THE TERMINAL. TYLER: LET'S GET TO SOME TOP STORIES. MICHAEL: A FEDERAL JUDGE SAYS THE SPRAWLING IMMIGRANT DETENTION CAMP IN THE FLORIDA EVERGLADES WAS BUILT WITHOUT A PROPER ENVIRONMENTAL REVIEW AND MUST BE DISMANTLED. STATE AND FEDERAL OFFICIALS HAVE 60 DAYS TO REMOVE THE FENCING, LIGHTING AND OTHER INFRASTRUCTURE INSTALLED TO SUPPORT THE FACILITY. THE JUDGE REJECTED AN ARGUMENT THE FACILITY WAS EXEMPT FROM REVIEW BECAUSE IT WAS BUILT BY THE STATE OF FLORIDA, NOTING THE TRUMP ADMINISTRATION PLEDGED $600 MILLION IN FEDERAL FUNDING TO SUPPORT THE INITIATIVE. A FLORIDA STATE OFFICIAL FILED A NOTICE OF APPEAL. TYLER: NVIDIA IS INSTRUCTING PRODUCERS TO STOP PRODUCTION ON AN INTELLIGENCE CHIP. THIS AFTER BEIJING URGED LOCAL COMPANIES TO AVOID USING THE H20 CHIPS, ORIGINALLY DESIGNED SPECIFICALLY FOR THE CHINESE MARKET. NVIDIA AND AMD RECENTLY SECURED WASHINGTON'S APPROVAL TO RESUME LOWER AND AI CHIP SALES TO CHINA BUT ONLY ON THE CONDITION THEY GIVE THE U.S. GOVERNMENT 15% OF RELATED REVENUE. WE HAVE NOT INDEPENDENTLY CONFIRMED THIS REPORT. MICHAEL: FBI AGENTS RAIDED THE HOME OF PRESIDENT TRUMP'S FORMER NATIONAL SECURITY ADVISOR JOHN BOLTON, A SIGN THE CAMPAIGN -- THE WHITE HOUSE IS STEPPING UP A CAMPAIGN OF RETRIBUTION AGAINST CRITICS. A SOURCE TELLS US THAT IT IS LINKED TO WHETHER BOLTON OBTAINED ENTERED CLASSIFIED DOCUMENTS. PRESIDENT TRUMP ADDRESSED THE RAID EARLIER. > > , PHAM JOHN BOLTON. -- I AM NOT A FAN OF JOHN BOLTON. HE'S A LOWLIFE, NOT A SMART GUY. HE COULD BE A VERY UNPATRIOTIC GUY AND WE WILL FIND OUT. MICHAEL: DURING TRUMP'S FIRST TERM, PROSECUTORS INVESTIGATED BOLTON OVER HIS MEMOIR THAT DETAILED THE BELIEF THAT TRUMP WAS UNFIT FOR THE PRESIDENCY. TRUMP ACCUSED HIM OF USING CLASSIFIED INFORMATION IN THE BOOK AND SUED UNSUCCESSFULLY TO BLOCK ITS PUBLICATION. TYLER: JOINING US WITH REACTION TO THIS STORY AND MORE IS OUR POLITICAL PANEL. DEMOCRATIC IN A LIST -- ANALYST JEANNE SHEEHAN ZAINO ARROW, AND OUR REPUBLICAN STRATEGIST. LET'S START WITH THE LATEST STORY WHEN IT COMES TO THE FBI RAID AGAINST BOLTON. WE HAD AN INTERESTING CONVERSATION ABOUT THIS ON THE EARLY ADDITION OF \"BALANCE OF POWER\" AND I WOULD LOVE TO GET YOUR THOUGHTS AGAIN. WHAT IS YOUR LEVEL OF CONCERN? JEANNIE: IT IS CONCERNING BUT I THINK WE SHOULD ALL JUST TAKE A BREATH AND WAIT BECAUSE IN THIS CASE IT'S NOT JUST THE EXECUTIVE RANCH GOING IN OR DIRECTING THE DOJ TO GO IN, IT IS A JUDGE WHO SIGNED OFF ON AN AFFIDAVIT AND WAS CONVINCED THERE WAS ENOUGH POTENTIALLY PROBABLE CAUSE TO CONDUCT A SEARCH. GIVEN THAT, I THINK WE SHOULD TAKE A HANDS-OFF APPROACH AND WAIT AND SEE IF AND WHAT THEY FIND. THAT SAID, THE TIMING IS INTERESTING, COMING ON THE SAME DAY CONGRESS GETS THE EPSTEIN FILES. THE DOJ DECIDED AT THE TIME THOSE ARE RELEASED AND THE TRANSCRIPTS, THEY WOULD DO THIS. THE TIMING IS INTERESTING I WOULD HOLD OFF ON JUDGMENT UNTIL WE SEE WHAT THEY FOUND. MICHAEL: MATT, WHAT IS YOUR TAKE ON THE RAID? DO YOU THINK THIS IS PART OF A PURSUIT BY THE PRESIDENT AGAINST SOME OF HIS ADVERSARIES, INCLUDING FORMER ALLIES? MATT: IT WAS GOOD TO SEE THE PRESIDENT SAY HE WAS UNAWARE OF THE RAID, THAT IT WOULD HAPPEN, BUT PRESIDENT TRUMP HAD HIS HOME RAIDED. THERE'S NO QUESTION -- THERE'S MORE INFORMATION WE NEED TO FIND OUT BUT JUDGES SIGNED OFF, IT WASN'T JUST THE PRESIDENT GOING IN AND SAYING THIS IS ME DOING THIS, JUDGES SIGNED OFF AND WE HAVE TO WAIT AND SEE. MICHAEL: JEANNIE, A DIFFERENT TOPIC, MAYBE ONE MATT CAN ADDRESS AS WELL, ON INVESTMENT BY THE GOVERNMENT IN INTEL. YESTERDAY AND EARLIER TODAY WE HEARD FROM MIKE PENCE AND SOMEONE ELSE EXPRESSING RESERVATIONS AND CONCERNS ABOUT THE U.S. TAKING THIS KIND OF ROLE AND INDUSTRIAL POLICY. IS THIS A GOOD IDEA? WHAT SORT OF PRECEDENT ARE WE SETTING IF ANY? JEANNIE: IT'S SO STUNNING TO ME THAT THE REPUBLICAN PARTY THAT HAS A LONG TALKED ABOUT -- THAT HAS LONG TALKED ABOUT THE FREEDOM TO CONDUCT A UNENCUMBERED BY THE GOVERNMENT HAS LONG SUPPORTED FREE TRADE AND THE LIKE IS NOW IN A POSITION OF NOT ONLY MOVING AWAY FROM TRADITIONAL TRADE POLICIES BUT ALSO TAKING THE BIGGEST STEAK WE'VE SEEN IN A COMPANY LIKE THIS. IT HERALDS A NEW DAY OF WHAT IT MEANS TO BE A REPUBLICAN. I HAVE ENORMOUS CONCERNS ABOUT THAT. AT THE TOP OF THEM IS WHAT DOES THIS MEAN FOR INNOVATION AND AS IT IMPACTS NATIONAL SECURITY. THOSE THINGS WEIGH HEAVILY. I AGREE WITH MIKE PENCE AND I SELDOM SAY THAT. IT'S A CONCERNING CHANGE. TYLER: MATT, WHAT IS YOUR TAKE, MORE A HANDS-ON INDUSTRIAL POLICY AND THE SO-CALLED GOLDEN SHARE? YOU HEAR WHITE HOUSE OFFICIAL SEEING PERHAPS THIS IS THE PUSH THEY NEED IN ORDER TO ACCOMPLISH THEIR INDUSTRIAL POLICIES? MATT: IT'S NOT THE FIRST TIME U.S. HAS MADE INVESTMENT IN THE COMPANY BUT IT DOES MAP THE PRESIDENTS STRATEGY TRYING TO ONSHORE PRODUCTION IN THE COUNTRY. SEMICONDUCTORS AND CHIPS. A LOT OF IT TAKING SHAPE AND BEING PRODUCED IN TAIWAN. TO GET THAT PRODUCED IN THE U.S., PART OF IT IS ECONOMIC OPPORTUNITY IMPART HIS NATIONAL SECURITY. WE ARE BUILDING OFF THE GRANTS PROVIDED UNDER THE BIDEN ADMINISTRATION TO THIS COMPANY ANYTHING A LOT OF AMERICANS ARE SAYING WHY ARE WE PROVIDING TAXPAYER-FUNDED GRANTS TO ACCOMPANY WORTH BILLIONS OF DOLLARS. YOU'RE GIVING BILLIONS OF DOLLARS OF GRANTS TO COMPANY WORTH BILLIONS OF DOLLARS. IT'S AN OPPORTUNITY FOR THE U.S. TO GET EQUITY OUT OF THIS AND GET A RETURN ON INVESTMENT AS TAXPAYERS. PART OF IT IS THE STRATEGY OF WHAT YOU OUTLINED, BUT PART OF IT IS A PHILOSOPHY THAT PEOPLE WILL RALLY AROUND WASHINGTON IN GENERAL ON THAT. MICHAEL: JEANNIE, A STORY WE'VE BEEN FOLLOWING, THE QUESTION OF FED INDEPENDENCE IN THE LIGHT OF THE PRESSURE CAMPAIGN ON CHAIR POWELL TO LOWER RATES. THIS WEEK, CALLS FOR LISA COOK TO RESIGN. HAVE WE GONE PAST THE POINT OF NO RETURN WHEN IT COMES TO POLITICIZING THE CENTRAL BANK AND CHALLENGING ITS INDEPENDENCE? JEANNIE: I REALLY HOPE NOT. SOMETIMES IT'S HARD TO PUT THE GENIE BACK IN THE BOTTLE. THE INDEPENDENCE OF THE FED IS RADICAL AND WE SEEN IT IN OTHER COUNTRIES AND WE'VE SEEN IT HERE. WE SHOULD HAVE AN INDEPENDENT FED. I WAS STRUCK BY THE FACT THAT JEROME POWELL IN HIS REMARKS DIDN'T GO BEYOND SAYING THEY WOULD CONTINUE TO MAKE DECISIONS BASED ON THE DATA. WE HAVEN'T SEEN THE FED AT LEAST IN MY LIFETIME UNDER THIS MUCH POLITICAL PRESSURE WE WANT AN INDEPENDENT FED BECAUSE REPUBLICANS HAVE TO REMEMBER IF IT'S NOT INDEPENDENT IT WILL BE DEMOCRATS PUSHING IT AS WELL. ALL PRESIDENTS WANT LOWER INTEREST RATES AND CONTROL OF THE FED. TYLER: ONLY 15 SECONDS, SHOOK THE PRESIDENT BE PRESSURING THE FED? MATT: HE'S RIGHT TO DO WHAT HE'S DOING, TO VOCALLY EXPRESS HOW HE FEELS AND HE BELIEVES YOU GOT TO GET THE RATES DOWN. YOU SAW THE MARKET RALLY TODAY WITH THE NOTION THERE MAY BE RATE CUTS ON THE WAY. PRESIDENT TRUMP HAS AN ECONOMIC AGENDA HE WANTS TO FULFILL AND WE WILL SEE WHAT HAPPENS. MICHAEL: JEANNIE AND MATT, THANK YOU BOTH. MAKE SURE TO TUNE INTO A NEW WALL STREET WEEK WITH DAVID WESTIN AT 6:00 P.M. TYLER: THANK YOU FOR JOINING US FOR \"BALANCE OF POWER.\" THIS IS BLOOMBERG. WE WILL SEE YOU BACK HERE MONDAY. ♪",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "PRESIDENT TRUMP",
      "weight": 0.07414965
    },
    {
      "name": "PRESIDENT DONALD TRUMP",
      "weight": 0.0710233
    },
    {
      "name": "PRESIDENT PUTIN",
      "weight": 0.06341458
    },
    {
      "name": "PRESIDENT",
      "weight": 0.059693854
    },
    {
      "name": "PRESIDENT ZELENSKYY",
      "weight": 0.05872536
    },
    {
      "name": "CANADA U.S. TRADE",
      "weight": 0.05498323
    },
    {
      "name": "DONALD TRUMP",
      "weight": 0.053018983
    },
    {
      "name": "MORE TARIFFS",
      "weight": 0.051976267
    },
    {
      "name": "TRUMP",
      "weight": 0.051206313
    },
    {
      "name": "OTHER U.S. TRADING PARTNERS",
      "weight": 0.05093016
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97607421875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.91162109375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.74462890625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.71728515625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.424072265625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.35205078125
    }
  ],
  "sentiment": {
    "positive": 0.08596315,
    "negative": 0.5865916,
    "neutral": 0.32744527
  },
  "summary": "The US government has made an investment of $8.9B in Intel Stock, with the company agreeing to give the government a 10% equity stake. The investment comes after the company agreed to give its customers a lower rate of interest. Federal Reserve Chairman, Jay POWELL, discussed the shift in policy stance following recent data and suggested that it might be time to cut interest rates. The company has also agreed to share a 50% equity stake with the US government. The potential impact on the economy is uncertain as a result of the weak economy and potential for inflation.",
  "shortSummary": "The US government makes an $8.9B investment in Intel, amid concerns over economic instability and potential market volatility, with potential for interest rate cuts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "717f9fb4a603414b83c57ab4911f6ba2",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Bloomberg’s \"Balance of Power\" covered a wide range of political and economic stories, including Fed Chair Jerome Powell’s hints at possible rate cuts amid a cautious labor market, President Trump’s controversial 10% stake in Intel and his trade actions with Canada and tariffs on China. The show also discussed Trump’s pressure on Fed Governor Lisa Cook, the U.S. stance on the Ukraine war and potential sanctions, and the federal judge’s order to dismantle a Florida detention camp. Additional segments addressed AI regulation, Nvidia’s chip sales to China, and the FBI raid on former national security adviser John Bolton, highlighting the administration’s aggressive domestic and foreign policy moves.",
  "argos_id": "XQWTVR71K"
}