{
  "url": "https://www.inquirer.com/wires/ap/ap-top-news-254-pm-edt-20250824.html",
  "authorsByline": "",
  "articleId": "4113d4122f144d5a900b703485436691",
  "source": {
    "domain": "inquirer.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "PA",
      "county": "Philadelphia County",
      "city": "Philadelphia",
      "coordinates": {
        "lat": 39.9527237,
        "lon": -75.1635262
      }
    }
  },
  "imageUrl": "https://www.inquirer.com/resizer/_mMWDlY5tyNB8_fDmmbqUOR3y_4=/1200x0/center/middle/www.inquirer.com/resources/images/default-img.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T06:00:54-04:00",
  "addDate": "2025-08-24T20:19:49.685838+00:00",
  "refreshDate": "2025-08-24T20:19:49.685840+00:00",
  "score": 1.0,
  "title": "AP Top News at 3:11 p.m. EDT",
  "description": "AP Top News at 3:11 p.m. EDT",
  "content": "CAIRO (AP) — Israeli airstrikes hit Yemen ’s capital on Sunday, days after the Houthi rebels fired a missile toward Israel that its military described as the first cluster bomb the rebels had launched at it since 2023. The Iranian-backed Houthis said multiple areas across Sanaa were hit while the Houthi-run health ministry said at least two people were killed and 35 others were wounded. The rebels' Al-Masirah satellite television reported a strike on an oil company, and video on social media showed a fireball erupting there. Israel’s military said it struck the Asar and Hizaz power plants, calling them “a significant electricity supply facility for military activities,” along with a military site where the presidential palace is located.\n\n4 Palestinians shot dead by Israeli forces while seeking aid near Gaza City, witnesses say\n\nDEIR AL-BALAH, Gaza Strip (AP) — Israeli forces shot dead four Palestinian aid-seekers traveling Sunday through a military zone south of Gaza City that is regularly used to reach a food distribution point, a hospital and witnesses said. Gaza City is in famine after 22 months of war, while Israel’s military moves ahead with a planned offensive to seize the city, perhaps within days. Israel's defense minister has warned that the city of hundreds of thousands of people could be destroyed. Al-Awda Hospital and two witnesses told The Associated Press the Palestinians were killed when troops opened fire on a crowd heading to a site run by the Israeli-backed U.S.\n\nMoscow says Kyiv has struck a nuclear power plant as Ukraine marks Independence Day\n\nRussia accused Ukraine on Sunday of launching drone attacks that sparked a fire at a nuclear power plant in its western Kursk region overnight, as Ukraine celebrated 34 years since its independence. Russian officials said several power and energy facilities were targeted in the overnight strikes. The fire at the nuclear facility was quickly extinguished with no injuries reported, according to the plant’s press service on Telegram. While the attack damaged a transformer, radiation levels remained within normal ranges. The United Nations’ nuclear watchdog said it was aware of media reports that a transformer at the plants had caught fire “due to military activity,” but hadn’t received independent confirmation.\n\nTrump expands cities targeted for possible military deployment to Baltimore in a spat with governor\n\nWASHINGTON (AP) — President Donald Trump on Sunday threatened to expand his military deployments to more Democratic-led cities, responding to an offer by Maryland's governor to join him in a tour of Baltimore by saying he might instead “send in the ‘troops.’” Last week, Trump said he was considering Chicago and New York for troop deployments similar to what he has unleashed on the nation's capital, where thousands of National Guard and federal law enforcement officers are patrolling the streets. Trump made the threat to Baltimore in a spat with Maryland Gov. Wes Moore, a Democrat who has criticized Trump's unprecedented flex of federal power aimed at combatting crime and homelessness in Washington.\n\nEpstein accuser Virginia Giuffre wrote a memoir. Months after her death, it's coming out\n\nNEW YORK (AP) — A posthumous and “unsparing” memoir by one of Jeffrey Epstein's most prominent accusers, Virginia Roberts Giuffre, will be published this fall, publishing house Alfred A. Knopf said Sunday. “Nobody's Girl: A Memoir of Surviving Abuse and Fighting for Justice” is scheduled for release Oct. 21, the publisher confirmed to The Associated Press. Giuffre, who died by suicide in April at age 41, had been working on “Nobody's Girl” with author-journalist Amy Wallace and had completed the manuscript for the 400-page book, according to Knopf. The publisher's statement includes an email from Giuffre to Wallace a few weeks before her death, saying that it was her “heartfelt wish” the memoir be released “regardless” of her circumstances.\n\nBARCELONA, Spain (AP) — Three young sisters have died after an overcrowded rubber dinghy took on water in bad weather while trying to cross the Mediterranean Sea to Italy, a German nonprofit organization reported Sunday. The sisters from war-torn Sudan, who were 9, 11 and 17 years old, are the latest known victims of a Mediterranean migration route that has claimed more than 30,000 lives since the International Organization for Migration started counting in 2014. Volunteers with the German group RESQSHIP found their bodies after rescuing some 65 people from the unseaworthy boat in international waters north off Libya on the night of Friday to Saturday.\n\nWhat to know: Four ways ICE is training new agents and scaling up\n\nBRUNSWICK, Ga. (AP) — Immigration and Customs Enforcement is an agency inside the Department of Homeland Security that is integral to President Donald Trump’s vision of carrying out the mass deportations he promised during the campaign. Deportation officers within a unit called Enforcement and Removal Operations are the ones who are responsible for immigration enforcement. They find and remove people from the United States who aren’t American citizens and, for a variety of reasons, no longer can stay in the country. Some might have gone through immigration court and a judge ordered them removed. Or they were arrested or convicted of certain crimes, or they’ve repeatedly entered the country illegally or overstayed a visa.\n\nSCARBOROUGH, Maine (AP) — Rick Clough spent some four decades fishing for lobsters and sea urchins off the Maine coast before spotting one of the ocean's most recognized predators — a great white shark. The approximately 8-foot (2.4-meter) shark, seen off the beach town of Scarborough in July, surprised Clough, but didn’t make him fear the ocean — though he admitted, “I’m not sure I’d want to go urchin diving now.” Boaters, beachgoers and fishermen like Clough who spend time in the chilly waters of New England and Atlantic Canada are learning to live with great white sharks, the creatures made famous by the 1975 film “Jaws.” Sightings of the apex predators are up in places like Maine, where they were once very rarely spotted.\n\nUS Open tennis players don't necessarily think more is better when it comes to starting on Sunday\n\nNEW YORK (AP) — Roger Federer and Maria Sharapova made clear they didn't love the idea of starting a Grand Slam tournament on a Sunday instead of a Monday when the French Open was the first to do it nearly 20 years ago and they were on the schedule for the new, earlier Day 1. Now that the trend has reached the U.S. Open this year, not every current player is exactly a proponent of the switch, either — even if the crowds were gathering on-site Sunday morning before the start of competition. “I hate the Sunday start,” said Jordan Thompson, an Australian who's been ranked as high as No.\n\nTrump says he'll be at Ryder Cup and he thinks captain Keegan Bradley should play\n\nATLANTA (AP) — President Donald Trump says he will be at the opening round of the high-charged Ryder Cup next month in New York, and he thinks U.S. captain Keegan Bradley should be playing. Trump posted Saturday night on his social media site that he would be there on Friday, Sept. 26, for the start of three-day matches between the United States and Europe. He said he was invited by the PGA Tour, making a common mistake distinguishing between the tour and the PGA of America, which runs the Ryder Cup in America. A PGA of America spokesman said the organization and Bradley invited Trump.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Roundup"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "President Donald Trump",
      "weight": 0.055664185
    },
    {
      "name": "Donald Trump",
      "weight": 0.053879112
    },
    {
      "name": "Sunday",
      "weight": 0.053517483
    },
    {
      "name": "possible military deployment",
      "weight": 0.051254924
    },
    {
      "name": "military activities",
      "weight": 0.04987182
    },
    {
      "name": "military activity",
      "weight": 0.04987182
    },
    {
      "name": "Trump",
      "weight": 0.048492566
    },
    {
      "name": "AP Top News",
      "weight": 0.047460917
    },
    {
      "name": "federal power",
      "weight": 0.04743043
    },
    {
      "name": "AP",
      "weight": 0.046848804
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.9912109375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.927734375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.82958984375
    },
    {
      "name": "/News/World News",
      "score": 0.81591796875
    }
  ],
  "sentiment": {
    "positive": 0.07433315,
    "negative": 0.69127494,
    "neutral": 0.23439194
  },
  "summary": "Israeli airstrikes hit Yemen's capital, Sanaa, following a missile launched by the Houthi rebels that Israel described as the first cluster bomb the rebels had launched at it since 2023. Israel's military said it struck the Asar and Hizaz power plants, a significant electricity supply facility for military activities, and a military site where the presidential palace is located. Four Palestinians were shot dead by Israeli forces near Gaza City, which is in famine after 22 months of war. Russia accused Ukraine of launching drone attacks that sparked a fire at a nuclear power plant in its western Kursk region, as Ukraine celebrated 34 years since its independence. President Donald Trump threatened to expand his military deployments to more Democratic-led cities in response to Maryland's governor's offer to tour Baltimore.",
  "shortSummary": "Israeli airstrikes targeted Yemen's capital Sanaa, killing two civilians and setting off a nuclear fire, while President Donald Trump considers expanding military operations in more Democratic-led cities.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "487b2b7536994f949cbac8b3817c62dd",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Israeli airstrikes hit Yemen's capital after a Houthi missile launch, killing at least two and wounding 35, while Israeli forces also shot dead four Palestinians seeking aid near Gaza City. Meanwhile, Russia accused Ukraine of striking a nuclear plant in Kursk, though no injuries were reported. In the U.S., President Trump threatened to deploy troops to Baltimore and announced his attendance at the Ryder Cup, while the Associated Press reported on a posthumous Epstein accuser memoir and a tragic Mediterranean boat disaster that claimed three Sudanese sisters. Other stories covered ICE agent training, a great‑white shark sighting off Maine, and tennis players' opposition to Sunday starts at the U.S. Open.",
  "argos_id": "YBT8PUAB0"
}