{
  "url": "https://www.nbcnews.com/news/us-news/weekend-rundown-august-24-rcna226701",
  "authorsByline": "Jeremy Mikula, Nick Duffy, Amina Kilpatrick",
  "articleId": "c311fd65424f441db0d3e30402866714",
  "source": {
    "domain": "nbcnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-08/250815-Alaska-Sergei-Lavrov-ac-746p-2a7132.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T22:00:00+00:00",
  "addDate": "2025-08-24T22:03:18.517825+00:00",
  "refreshDate": "2025-08-24T22:03:18.517827+00:00",
  "score": 1.0,
  "title": "Kremlin dampens peace hopes, and Giuffre family 'outraged' by Ghislaine Maxwell's DOJ interview: Weekend Rundown",
  "description": "Plus, carjackings are still roiling Washington, and some parents are going to extremes for the kids’ dorms.",
  "content": "Vice President JD Vance remains confident the U.S. can broker an end to the war between Russia and Ukraine despite potential hang-ups that have emerged since President Donald Trump’s meeting this month with Russian President Vladimir Putin.\n\n“We believe we’ve already seen some significant concessions from both sides, just in the last few weeks,” Vance said in an exclusive interview on NBC News’ “Meet the Press.”\n\n“We’re going to eventually be successful, or we’ll hit a brick wall. And if we hit a brick wall, then we’re going to continue this process of negotiation, of applying leverage,” the vice president added. “This is the energetic diplomacy that’s going to bring this war to a close.”\n\nMeanwhile, Russia’s top diplomat, Foreign Minister Sergey Lavrov, put a damper on hopes that Trump will propel a swift end to the war in Ukraine.\n\nHe told “Meet the Press” moderator Kristen Welker that Ukraine has hindered the process, saying Ukrainian President Volodymyr Zelenskyy and European leaders “don’t want peace.”\n\n“Zelenskyy said no to everything,” Lavrov said. “How can we meet with a person who is pretending to be a leader?”\n\nLavrov said Putin is ready to meet with Zelenskyy “when the agenda is ready.” But he suggested that Putin would not sign a peace agreement with Zelenskyy, whose legitimacy Moscow has questioned since Ukrainian elections were postponed last year amid martial law.\n\n“When we come to a stage when you have to sign documents, we would need a very clear understanding by everybody that the person who is signing is legitimate,” he said. “And according to the Ukrainian constitution, Mr. Zelenskyy is not at the moment.”\n\nJustice Department gave Ghislaine Maxwell ‘a platform to rewrite history,’ family of Virginia Giuffre says\n\nFamily members of Virginia Giuffre, a prominent Jeffrey Epstein accuser, said they were “outraged” by the Justice Department’s decision to release transcripts from Ghislaine Maxwell’s testimony last month, arguing the interviews provided Maxwell a “platform to rewrite history.”\n\n“The content of these transcripts is in direct contradiction with felon Ghislaine Maxwell’s conviction for child sex trafficking,” the family of Virginia Roberts Giuffre said in a statement. The family added, “This travesty of justice entirely invalidates the experiences of the many brave survivors who put their safety, security, and lives on the line to ensure her conviction, including our sister.”\n\nThe Justice Department on Friday released audio and transcripts of the two-day interview, during which Maxwell disputed several allegations of wrongdoing against her and Epstein, including by Giuffre, who died by suicide in April.\n\nMaxwell said she never witnessed any inappropriate conduct from any man, including Trump, and denied the existence of an incriminating “client list” of those who benefited from Epstein’s crimes.\n\nOn “Meet the Press,” Sen. Adam Schiff echoed the Giuffre family’s view, claiming that Maxwell has the motivation to say anything that could potentially get her pardoned.\n\n“She says exactly what her lawyers tell her is going to be necessary to get a pardon. No one should be surprised here,” Schiff said.\n• Padding passage: The Republican-controlled Texas state Senate passed the party’s new congressional maps — designed to pad the GOP majority in the U.S. Congress — completing a legislative odyssey that sparked a nationwide scramble over redistricting.\n• Undelivered: Postal services across the world are halting parcel deliveries to the United States amid mounting confusion over new import duties imposed on small shipments under Trump’s new tariff regime.\n• Baltimore next? Trump on Truth Social threatened to send the military into Baltimore to “quickly clean up” crime, the latest in a line of threats to replicate the deployment of National Guard troops to Washington.\n\nThe federal takeover of Washington has sparked a fierce debate over the state of crime in the city. What’s beyond dispute is that carjackings exploded during the pandemic and are not yet back to pre-pandemic levels. It’s a particularly brutal crime, experts say, one that often causes lasting psychological damage.\n\n“It became the crime of the pandemic,” said Chuck Wexler, executive director of the Police Executive Research Forum, a Washington-based organization of current and former law enforcement officials focused on improving policing. “And the reason you still have it is because juveniles learned how to do it. That presents a lot of challenges for the justice system.”\n\nThe soaring number of young people who have engaged in carjacking is indeed one of the key factors that has driven the surge in the Washington area and beyond, according to interviews with more than half a dozen police officials, criminologists and youth advocates.\n\nSome of these perpetrators stole vehicles to use them to commit more crimes. Many others commit carjackings simply for the thrill of it, or to earn respect and attention on social media, according to police investigators and advocates who have spoken to the young offenders.\n\nOver the last 18 months, the carjacking numbers have fallen in the area. Sgt. Josh Scall, a supervisor in the carjacking unit in neighboring Prince George’s County, Maryland, said he’s proud of the progress, but even one carjacking is one more than he wants to see in his county.\n\n“We can parade that we’re not at 573,” Scall added, referring to the record number of carjackings recorded in Prince George’s in 2023. “But it’s still unacceptable in our books.”\n\nSending a freshman off to college is almost always an expensive endeavor, but the latest viral trend is taking back-to-school shopping to the next level.\n\nExtreme dorm makeovers are becoming increasingly popular, with some parents shelling out tens of thousands of dollars and hiring professional interior designers to transform their kids’ humble abodes into the dorm rooms of their dreams.\n\nFar removed from the beat-up mini-fridges and crooked posters of the past, the dramatic transformations are unnecessary, some say, and reflect the widening line between the haves and have-nots in the United States.\n\n“Wealth disparity just becomes obvious on a college campus, because suddenly your lifestyle is either funded by you or it’s not,” said Mya Mendola, who graduated from the University of Minnesota last year.\n\nFrank Ilett announced last October he wouldn’t trim his locks until his beloved Manchester United won five soccer matches in a row. More than 320 days later, he’s still waiting.\n\nIn case you missed it\n• Kilmar Abrego Garcia, wrongfully deported to a notorious prison in El Salvador, now faces removal to Uganda after being freed from federal custody.\n• Police on Saturday identified the five people who were killed in a tour bus crash in western New York.\n• Jerry Adler, best known for playing a mobster’s confidant on “The Sopranos,” dies at 96.\n• A judge in Mexico said boxer Julio César Chávez Jr. will stand trial over alleged cartel ties and arms trafficking but could await that trial outside of detention, the boxer’s lawyer said.\n• The son of “Walking Dead” star Norman Reedus was arrested and charged following an alleged assault in a New York City apartment.\n• More than 20 hospitals and health systems have temporarily or indefinitely rolled back transgender care for minors and some young adults this year amid threats of federal investigations and cuts to government funding.\n• Home Depots have become prime locations for immigration enforcement as federal agents target day laborers in search of work.\n• A lawsuit against Delbarton, an elite all-boys Catholic school where several former students have come forward with sex abuse allegations, is set to be the first civil trial involving the Catholic Church in New Jersey.",
  "medium": "Article",
  "links": [
    "https://www.nbcnews.com/news/us-news/home-depots-become-prime-locations-immigration-enforcement-rcna226643",
    "https://www.nbcnews.com/politics/white-house/trump-threatens-military-baltimore-crime-key-bridge-funding-chicago-rcna226846",
    "https://www.nbcnews.com/politics/jd-vance/vance-optimism-energetic-diplomacy-will-end-war-ukraine-rcna226606",
    "https://www.nbcnews.com/politics/justice-department/justice-department-gave-ghislaine-maxwell-platform-rewrite-history-fam-rcna226797",
    "https://www.nbcnews.com/sports/soccer/manchester-united-soccer-fan-haircut-english-premier-league-rcna224398",
    "https://www.nbcnews.com/news/us-news/kilmar-abrego-garcia-may-be-deported-uganda-rcna226756",
    "https://www.nbcnews.com/news/us-news/extreme-dorm-makeovers-back-school-shopping-rcna226638",
    "https://www.nbcnews.com/news/us-news/son-walking-dead-actor-norman-reedus-charged-assault-rcna226853",
    "https://www.nbcnews.com/news/us-news/carjacked-capital-crime-pandemic-still-roiling-dc-rcna224655",
    "https://www.nbcnews.com/news/us-news/sex-abuse-lawsuit-elite-delbarton-school-poised-first-civil-trial-invo-rcna225786",
    "https://www.nbcnews.com/politics/trump-administration/ghislaine-maxwell-transcript-interview-full-doj-tapes-epstein-files-rcna226689",
    "https://www.nbcnews.com/politics/elections/texas-senate-passes-new-republican-drawn-congressional-map-rcna226278",
    "https://www.nbcnews.com/news/us-news/new-york-tour-bus-crash-victims-identified-rcna226776",
    "https://www.nbcnews.com/world/mexico/boxer-julio-cesar-chavez-jr-stand-trial-mexico-alleged-cartel-ties-rcna226831",
    "https://www.nbcnews.com/nbc-out/out-news/least-21-hospitals-ended-restricted-trans-care-minors-january-rcna226640",
    "https://www.nbcnews.com/pop-culture/pop-culture-news/sopranos-actor-jerry-adler-dies-age-96-rcna226840",
    "https://www.nbcnews.com/world/europe/kremlin-casts-doubt-trumps-push-ukraine-peace-rifts-remain-unresolved-rcna226742",
    "https://www.nbcnews.com/world/europe/global-mail-carriers-suspend-us-deliveries-confusion-new-duties-rcna226828"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ghislaine Maxwell",
      "weight": 0.0543599
    },
    {
      "name": "Giuffre family",
      "weight": 0.0517055
    },
    {
      "name": "Ukrainian President Volodymyr Zelenskyy",
      "weight": 0.0490061
    },
    {
      "name": "last month",
      "weight": 0.048770677
    },
    {
      "name": "last year",
      "weight": 0.04856821
    },
    {
      "name": "carjacking",
      "weight": 0.04767437
    },
    {
      "name": "carjackings",
      "weight": 0.04767437
    },
    {
      "name": "more crimes",
      "weight": 0.04662583
    },
    {
      "name": "Maxwell",
      "weight": 0.046416033
    },
    {
      "name": "Virginia Giuffre",
      "weight": 0.046279717
    }
  ],
  "topics": [
    {
      "name": "The Kremlin"
    },
    {
      "name": "Epstein Case"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9921875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.90771484375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.90771484375
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.78173828125
    },
    {
      "name": "/News/World News",
      "score": 0.76171875
    }
  ],
  "sentiment": {
    "positive": 0.065256715,
    "negative": 0.72952354,
    "neutral": 0.2052197
  },
  "summary": "Vice President JD Vance remains confident that the US can end the war between Russia and Ukraine, despite potential issues emerging since President Donald Trump's meeting with Russian President Vladimir Putin. Vance stated that significant concessions have been made from both sides in recent weeks. Russia's Foreign Minister, Sergey Lavrov, suggested that Ukraine has hindered the peace process, citing Ukrainian President Volodymyr Zelenskyy as a key figure. The family of Virginia Giuffre, a prominent Jeffrey Epstein accuser, expressed outrage over the Justice Department's decision to release transcripts from Ghislaine Maxwell’s testimony, claiming it provided her a “platform to rewrite history.”",
  "shortSummary": "Russian officials and families criticized the release of transcripts of Ghislaine Maxwell’s DOJ interview, while the Trump-Russia peace talks raise concerns over Ukraine's civil war.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5898c6e6d3d2420a990952c719854f61",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nbcnews.com/news/us-news/home-depots-become-prime-locations-immigration-enforcement-rcna226643",
      "text": "LOS ANGELES — The sight of masked federal agents in tactical gear descending on Home Depots across Southern California is forcing undocumented day laborers to weigh earning badly needed income against the risk of being arrested or deported.\nAt least two Home Depot parking lots in the Los Angeles area were targeted Friday amid the Trump administration’s immigration crackdown. Day laborers were detained in North Hollywood and Alhambra as organizers shouted demanding to see warrants and attempted to obtain as much information as possible from handcuffed workers.\nThe scene has become familiar this summer to day laborers, who are desperate to maintain a steady income in a local economy still recovering from January's wildfires and the rising cost of building materials caused by tariffs.\nThey wait in parking lots each morning, hoping to earn a day’s wage or, if they’re lucky, get hired for a long-term project that could mean weeks or months of steady pay.\nBut the constant threat of arrest is taking a toll on many workers, who say they are traumatized and can’t sleep after watching friends and family members being arrested and taken to jail.\n“What can you do? In this country you can’t stay home. You need money for kids, bills, rent, food,” said Arturo, a day laborer who lives in Los Angeles and spoke in Spanish.\nArturo and other laborers interviewed by NBC News spoke on the condition of anonymity because they feared being targeted by Immigration and Customs Enforcement agents or other federal officers.\nFriday's Home Depot operations took place about a week after Roberto Carlos Montoya Valdez, a day laborer from Guatemala, died after fleeing from agents at a Home Depot parking lot in Monrovia. He ran onto a nearby freeway and was hit by a car.\nImmigration advocates and community members said Montoya, who was in the U.S. without legal authorization, was not a criminal but a hardworking father.\n“He came here to work hard. My uncle was not a criminal,” his niece, Mariela Mendez, told mourners during a vigil last week for Montoya. “He wanted what a lot of us want: a better life.”\nThe Department of Homeland Security said Montoya was not being pursued by federal agents when he died.\nHome Depot declined to comment on his death or say how many arrests have occurred on its properties.\n“We aren’t notified that ICE activities are going to happen, and in many cases, we don’t know that arrests have taken place until after they’re over,” the Atlanta-based company said in an emailed statement. “We’re required to follow all federal and local rules and regulations in every market where we operate.”\nSitting in his truck parked close to where Montoya started running, Jose quietly sobbed as he looked at the small tree where his friend used to lock up his bike every morning.\nJose said he had known Montoya for about five years and described him as friendly and chatty with the other workers who assembled every morning in the parking lot.\nOn the day Montoya died, Jose said he arrived a few hours later than usual and was confused by all the commotion. Helicopters roared overhead and traffic came to a standstill.\n“It’s like it happened to all of us,” he said in Spanish through tears. “We all know each other. We’re all the same.”\nJose said that returning to the scene of Montoya’s death was heartbreaking, but his choices were limited. He needs to work, and the idea of not earning money every day keeps him up at night.\n“He wasn’t a criminal. He wasn’t a bad guy,” Jose said, adding that he doesn't understand why Montoya ran onto the freeway. “I wish he had taken his chances with an immigration judge.”\nA few paces away, Felipe stood in the shade of a tree, waiting for someone to hire him. He has lived in the U.S. since 2015 and worked in restaurants until the Covid pandemic crippled the industry, he said. He has returned to this Home Depot most days for five years, but the opportunities have dried up, he said. First it was the wildfires, then it was the tariffs and now it’s the fear of immigration enforcement.\nFelipe remembers a time when he could pick and choose which jobs to do on which days. Now, he’s lucky to be hired even for a few hours.\n“Thank God I wasn’t here when they got Carlos,\" he said. \"I’d be in Mexico without clothes.”\nWhen asked about the last time he saw Montoya, Felipe pointed to the little tree nearby.\n“He was sitting there talking with somebody,” Felipe said. “He seemed happy.”\nNancy Meza, an organizer with the National Day Laborers Organizing Network, works with dozens of volunteers stationed at Home Depots across Southern California. They patrol parking lots and street corners, watching for incoming signs of immigration enforcement activity. When spotted, volunteers signal each other in a group chat and shout warnings to nearby workers.\nMeza said she hears a mix of stress and determination from day laborers. Many vow to continue working for a sense of normalcy and to maintain a steady income, despite the personal cost.\n“There’s a feeling of, 'If we stay home and just sit back in fear, it makes things worse, we feel really anxious, powerless,'” she said. “They would rather take their chances.”\nStanding outside a different Home Depot on a blistering hot day, Arturo said he has lived in the United States for 25 years and regrets not learning English or trying to become a citizen. When he first arrived, he said, he was too embarrassed to attend night classes covered in sweat and paint after a day’s work.\nThe citizenship process also is costly and time-prohibitive, he said, noting that many of his friends who managed to obtain lawyers and go through the process said it cost them some $15,000 and nearly a decade of waiting. Arturo thought his time would be better spent earning money so he could leave sooner.\nLike many undocumented people, Arturo intended to return home to Mexico within a few years of arriving. But he fell in love and had two children. They are now teenagers and he can't leave them behind, he said. If he took them to Mexico, he worries they would feel too out of place in a country they have never visited.\nInstead, he encourages them to study hard and attend college. To help make that happen, he works six days a week, leaving Sundays open to spend with his children and attend church.\nHe said the benefit of what he is doing outweighs the risk.\n“All you can do is work to survive,” he said. “Immigration or no, people come out because they have to eat.”"
    },
    {
      "url": "https://www.nbcnews.com/pop-culture/pop-culture-news/sopranos-actor-jerry-adler-dies-age-96-rcna226840",
      "text": "Jerry Adler, best known for playing a mobster’s confidant on “The Sopranos,” died on Saturday at the age of 96, according to an obituary from the Riverside Memorial Chapel in New York.\nThe obituary did not provide details. Adler’s friend Frank J. Reilly confirmed his death Saturday on X.\n“You know him from one of his iconic roles [and] from many of his guest appearances,” Reilly wrote. “Not bad for a guy who didn’t start acting until he was 65.”\nAdler came from a theater family, the son of Group Theatre manager Phil Adler and the nephew of actor Jacob Pavlovich Adler, he told the Southern New England Jewish Ledger in 2014.\nHe was a theater veteran who worked behind the curtain on some of Broadway’s biggest shows. Adler worked as stage manager for the original 1956 production of “My Fair Lady” featuring Julie Andrews and Rex Harrison.\nHe’d later direct the revival in 1976 after having worked on shows like “Annie,” “Marlene Dietrich” and “We Interrupt This Program...” as a production supervisor and director.\nAdler wouldn’t receive his first acting credit until 1991, when he appeared on an episode of “Brooklyn Bridge.” He appeared on popular television series such as “Quantum Leap” and “Law & Order” and even had some leading roles in shows like “Hudson Street.”\nBut the world will most likely best remember Adler for his six seasons on the HBO series “The Sopranos.”\nHesh Rabkin, played by Adler, was a confident to lead character Tony Soprano, a troubled New Jersey mafia boss struggling with his work and his family.\nA recurring character, Rabkin was a loan shark who often doled out advice to the younger mafioso.\n\"Sopranos\" actor Michael Imperioli paid tribute to his former co-star on Instagram, describing Adler as a \"true class act\" and saying he loved spending time with him.\n\"JERRY ADLER (1929-2025) was a fantastic actor and the kindest of human beings,\" Imperioli wrote. \"He brought so much humor, intelligence and truth to the role of Herman 'Hesh' Rabkin and was one of my favorite characters on The Sopranos.\nAdler made appearances in a number of other hit series, such as “Broad City,” “Curb Your Enthusiasm” and “Transparent.” He was a recurring guest on “The Good Wife,” a legal procedural led by Julianna Margulies.\nRobert King, co-creator of “The Good Wife,” recalled Adler’s role on the show as Howard Lyman in a social media post Sunday. He described Adler as “one of our favorite collaborators.”\n“The intent was only to have him for one episode of THE GOOD WIFE, but he was so funny in a diner scene, yelling ‘I said ice cream, you stupid b----’ we had him back for six years of Good Wife and three years of Good Fight,” King wrote.\nWhat was meant to be one episode turned into 30 for Adler, according to his IMDb page. He then appeared in two episodes of the show’s spinoff “The Good Fight.”\nPeople shared kind words about Adler in the comments of his online obituary, with some who knew him personally sharing memories. A woman named Sharon Aiuvalasit wrote that she was able to go to the set of her favorite show, \"Santa Barbara,\" because of a family friend who knew Adler.\n\"Jerry welcomed my mom, dad and little brother to the set for 12 hours and it continues to be one of the most magical memories of my life,\" Aiuvalasit wrote.\nA man named Jimmy Horton recalled that his very first job at 18 was working with Adler on the drama \"Search for Tomorrow.\" He worked on Broadway over the years and reunited with Adler in Larry David's 2015 play, \"Fish in the Dark.\"\n\"When rehearsals started I reintroduced myself and we reminisced about Search and the great people there and I got to see Jerry as an actor six nights a week for several months and he was a delight, a real mensch and a terrific actor to see up close,\" Horton wrote.\nAdler wrote a memoir released last year called \"Too Funny for Words,\" writing about moments like his first job working for his father as an assistant stage manager on \"Gentleman Prefer Blondes.\" He told CT Insider in an interview promoting his book that he had to lead Carol Channing by flashlight because she was \"terribly near-sighted.\"\nAsked about his career, Adler told the outlet that \"it's been a glorious run.\"\n\"I wrote this book during the pandemic because I thought the world could use some laughs,\" Adler said. \"I still have more stories to tell, too, about working on the Tony Awards shows, about all the summer stock productions, about all the 'My Fair Lady' revivals. Maybe there can be 'Too Funny for Words, Part Two.'\""
    },
    {
      "url": "https://www.nbcnews.com/news/us-news/son-walking-dead-actor-norman-reedus-charged-assault-rcna226853",
      "text": "The son of “Walking Dead” star Norman Reedus was arrested and charged following an alleged assault in a New York City apartment on Saturday.\nMingus Reedus, 25, pleaded not guilty to five charges Saturday, according to court records. The model faces charges of third-degree assault, assault recklessly causing injury, criminal obstruction of breathing, second-degree harassment and aggravated harassment.\nOfficers responded to an assault in progress in Manhattan’s Chelsea neighborhood at 8:40 a.m. Saturday, New York police said. A 33-year-old woman was observed with “minor injuries” to her neck and leg.\nShe was taken to Bellevue Hospital, and Mingus Reedus was taken into custody, police said.\nMingus Reedus’ attorney, Priya Chaudhry, insisted in a statement Sunday that her client’s innocence would become clear as the facts of the case emerged.\n“Despite what the prosecutor said in court — which is not evidence — they chose to charge Mingus with misdemeanors or less,” Chaudhry said. “This speaks volumes, and much louder than the prosecutor’s unsupported in-court comments.”\nShe also noted that the judge released Mingus Reedus on his own recognizance, “with neither bail nor supervision.”\nMingus Reedus is the son of Norman Reedus and model Helena Christensen. He accepted a plea deal in 2022 after he was accused of assaulting a woman at the San Gennaro festival in New York City’s Little Italy, according to E! News.\nThe woman alleged that Mingus Reedus punched her in the face after a verbal argument, but he told the New York Daily News that the woman and her friends “swarmed” him after having bumped into his group of friends. He described the incident as an accident."
    },
    {
      "url": "https://www.nbcnews.com/news/us-news/extreme-dorm-makeovers-back-school-shopping-rcna226638",
      "text": "Sending a freshman off to college is almost always an expensive endeavor, but the latest viral trend is taking back-to-school shopping to the next level.\nExtreme dorm makeovers are becoming increasingly popular, with some parents shelling out tens of thousands of dollars and hiring professional interior designers to transform their kids’ humble abodes into the dorm rooms of their dreams.\nFar removed from the beat-up mini-fridges and crooked posters of the past, the dramatic transformations are unnecessary, some say, and reflect the widening line between the haves and have-nots in the U.S.\n“Wealth disparity just becomes obvious on a college campus, because suddenly your lifestyle is either funded by you or it’s not,” said Mya Mendola, who graduated from the University of Minnesota last year.\nNevertheless, transformation videos are all over TikTok, showing drab, undecorated freshman dorms elevated into luxurious oases. Crystal chandeliers, plush bedding and monogrammed pillows overflow in the small spaces.\n“They’re away from home for the first time,” said Shelly Gates, a professional dorm designer. “They need their own little comfortable space.”\nGates, who owns Mary Margaret Designs, an interior design company in Mississippi, has gone viral for her elaborate room transformations. Her dorm makeover videos have garnered hundreds of thousands of views online, showing her clients’ shocked reactions at their unrecognizable rooms.\n“My end goal is not to be on TikTok,\" Gates said. \"It’s not to show off these designs, but my goal is always for the moms to be happy and the girls to be happy.”\nShe continued: “Old people like me grew up in dorms that literally were cinder block prison cells, and now our kids are the age to go to college, and we don’t want them to have that experience.”\nThe viral makeovers are not just for girls. Some parents are transforming their sons' freshman rooms into full-fledged man caves with gaming chairs, brick wallpaper, leather couches and neon signs.\nA market for elaborate dorm designs has grown since 2020, when Tamara Wingerter and Stephanie Knight started the Facebook group Dorm Rooms of Mississippi and Beyond to share their extravagant renovations.\nWingerter, who now has her own business, said she has seen designs costing anywhere from $500 to $20,000.\n“If someone has a $100,000 budget, I mean, I have never seen one of those yet, but you never know,” said Wingerter. “People drop that on a birthday party, so why not for nine months?\"\nAfter countless vision boards and full online shopping carts, Wingerter says her favorite part is seeing the students’ reaction when a room is finished.\n“College is hard enough. It’s such a big transition for our children, why shouldn’t we make their rooms somewhere where they’re comfortable and happy that expresses their personality?” said Wingerter.\nMendola, the recent college grad, said the extravagant dorm rooms are nothing like what she had in school.\n“Everyone had, like, a funny, cool, interesting theme,” said Mendola. “Nobody was going for aesthetics.”\n“It makes you wonder — she went on — what level of individuality is coming into your room versus what level is something you curated online? Are we losing some self-expression, because so much of it is based on what’s cool on the internet?”\nMendola and Megan Stout, who graduated from the University of North Carolina, Chapel Hill, in 2018, said they were shocked to hear what some people were paying for makeovers.\n“I shopped at Target. I got the $5 floor-length mirror,” Stout said. “I think our futon at the time was like $100. So, nothing crazy.”\nStout said she didn't see the point of spending so much money on a “cinder block dorm room.”\n“Twenty-thousand dollars, that’s literally a down payment!” she said. “There’s always families that can afford more and buy their kids more.”"
    },
    {
      "url": "https://www.nbcnews.com/politics/justice-department/justice-department-gave-ghislaine-maxwell-platform-rewrite-history-fam-rcna226797",
      "text": "Family members of a prominent Jeffrey Epstein accuser said they were “outraged” by the Justice Department’s decision to release transcripts from Ghislaine Maxwell’s testimony last month to a federal prosecutor, arguing it provided Maxwell a “platform to rewrite history.”\n“The content of these transcripts is in direct contradiction with felon Ghislaine Maxwell’s conviction for child sex trafficking,” the family of Virginia Roberts Giuffre said in a statement. The family added, “This travesty of justice entirely invalidates the experiences of the many brave survivors who put their safety, security, and lives on the line to ensure her conviction, including our sister.”\nDeputy Attorney General Todd Blanche last month questioned Maxwell, who is serving a 20-year prison sentence on sex trafficking charges, for two days as part of a stated effort by the Trump administration to uncover more information about Epstein’s crimes.\nThe Justice Department on Friday released audio and transcripts of the two-day interview, during which Maxwell disputed several allegations of wrongdoing against her and Epstein, including by Giuffre, who died by suicide in April.\nGiuffre accused Maxwell of grooming her to be sexually abused by Epstein and trafficked to several of his powerful friends, including Prince Andrew, Duke of York. Giuffre separately sued Andrew in 2021 alleging he sexually abused her as a minor, which he has denied. The two later settled the case for an undisclosed amount in 2022.\nDuring the interview last month with Blanche, Maxwell said Giuffre’s allegation against Andrew “doesn’t hold water,” and disputed key facts in the case, including an alleged photo of Giuffre with Andrew.\n“I believe that this whole thing was manufactured, and I can point you to some potentially corroborating evidence of this,” Maxwell told Blanche.\nGiuffre’s family accused the deputy attorney general of not sufficiently challenging Maxwell’s assertions during her testimony, suggesting that by publicly releasing the interview, the Justice Department provided Maxwell the opportunity to dispute her case in the court of public opinion.\n“During [Deputy Attorney General] Todd Blanche’s bizarre interview, she is never challenged about her court-proven lies, providing her a platform to rewrite history,” the family statement read.\nMaxwell also said she never witnessed any inappropriate conduct from any man, including Donald Trump. She denied the existence of an incriminating “client list” of individuals who benefited from Epstein’s crimes and maintained her innocence after being convicted of sex trafficking in 2021.\nOn Sunday, Sen. Adam Schiff, D-Calif., criticized Maxwell’s statements to Blanche, claiming that she has the motivation to say anything that could potentially get her pardoned.\n“They go and they do this interview without the presence of a prosecutor who actually knows the facts,” Schiff told NBC News’ “Meet the Press,” referring to Blanche.\n“She wants a pardon. She says exactly what her lawyers tell her is going to be necessary to get a pardon. No one should be surprised here,” Schiff added.\nIn a statement, Maxwell's attorney David Oscar Markus called Schiff \"flat-out wrong.\"\n\"Ghislaine Maxwell has been consistent from day one, and her testimony is backed by documents — not politics. If she wanted to make up stories to curry favor, she could have targeted Democrats like President Clinton. She didn’t because she’s telling the truth. The good Congressman may fancy himself a mind reader, but on this he’s flat-out wrong,\" Markus said.\nGiuffre’s family has for months been critical of the Justice Department’s interactions with Maxwell amid the Trump administration’s claimed push to uncover more information about Epstein’s crimes, a key topic of interest among Trump’s base.\nIn late July, after Maxwell met with Blanche, the family urged the government not to provide Maxwell any favorable treatment, describing her then as a “monster who deserves to rot in prison for the rest of her life.”\nTrump has not ruled out the idea of pardoning Maxwell, whom he has known for several decades. When asked last month about the prospect of granting Maxwell legal relief, Trump said, “I’m allowed to do it, but it’s something I have not thought about.”\nAbsent a pardon from Trump, Maxwell is seeking legal relief from the Supreme Court, which has indicated it will decide whether to review Maxwell’s appeal of her conviction during a private conference in September.\nGiuffre’s family also condemned the Justice Department’s decision to transfer Maxwell to a minimum-security prison following her meeting with Blanche.\n“By moving convicted felon Maxwell to a minimum-security, country club prison, the DOJ sends a disturbing message that child sex trafficking is acceptable and will be rewarded,” the family said Saturday in a statement.\nFederal officials moved Maxwell, Epstein’s co-conspirator and confidant, from a co-ed, low-security prison in Tallahassee, Florida, to a women-only, minimum-security facility in Bryan, Texas. The Bureau of Prisons at the time did not specify why Maxwell was transferred to the facility, which also houses reality television star Jen Shah and disgraced Theranos founder Elizabeth Holmes.\nThe release of the Maxwell transcripts came as the Justice Department also partially fulfilled a subpoena by the House Oversight Committee for all files related to the federal investigation of Epstein. The Justice Department released roughly 33,000 documents, however Democrats on the committee have said the “vast majority” of the records included in the first batch were already public."
    },
    {
      "url": "https://www.nbcnews.com/world/europe/kremlin-casts-doubt-trumps-push-ukraine-peace-rifts-remain-unresolved-rcna226742",
      "text": "Russia’s top diplomat laid out the wide gaps between Moscow and Kyiv and put a damper on hopes that President Donald Trump will propel a swift end to the war in Ukraine.\nForeign Minister Sergey Lavrov told NBC News’ “Meet the Press” moderator Kristen Welker in an exclusive interview taped Friday that there was no meeting planned between Russian President Vladimir Putin and Ukraine’s Volodymyr Zelenskyy, and that key issues — including security guarantees for Ukraine and territorial disputes— remain unresolved.\nPutin “is ready to meet with President Zelenskyy, provided this meeting is really going to decide something,” he said. “To meet, for Zelenskyy to have another opportunity to be onstage, is not what we believe is useful.”\nEven as Trump has met separately this month with Putin, Zelenskyy and European leaders, his overtures for peace have been undermined by Russia’s continued deadly strikes on Ukraine, including on a U.S.-owned factory last week.\nThe White House is now seeking a Putin-Zelenskyy summit, but Lavrov’s grievances underscored just how far apart the two sides remain.\nHe said it was Ukraine that was hindering the peace process, along with European leaders who Lavrov said “don’t want peace.”\n“They say, ‘We cannot allow defeat of Ukraine. We cannot allow Russia to win.’ They speak in these terms: win, defeat and so on,” he said.\nUkraine, which celebrated its independence day on Sunday, is being pressured to give up Russian-annexed Crimea as well as its eastern Donbas region and abandon any hope of joining NATO, the U.S.-led military alliance founded after World War II to counter the threat posed by the Soviet Union.\n“Zelenskyy said no to everything,” Lavrov said. “How can we meet with a person who is pretending to be a leader?”\nRussian invasion\nLavrov, whose country launched a large-scale invasion of Ukraine in 2022, claimed Russia had “proposed several times a peaceful resolution on a diplomatic basis.”\nRussia has been unwilling to discuss giving up the 20% of Ukraine it occupies, and insists that Ukraine remain nonaligned and unarmed.\nWhen Welker pressed him on whether Russia had indeed invaded Ukraine, Lavrov declined to use the term, instead using Russia’s preferred phrase of “special military operation.”\nLavrov acknowledged that Ukraine “has the right to exist” but said it must “let people go.”\nPutin has long claimed, without evidence, that Kyiv has committed genocide against Russian speakers in Ukraine’s eastern Donbas region, almost all of which his forces now occupy.\nRussia doesn’t have “any interest in territories,” Lavrov said, but is concerned about people identifying as ethnically Russian “who live on those lands, whose ancestors lived there for centuries and centuries.”\nMost of the international community rejects the idea that Ukraine is repressing Russian language and culture and says Russia launched its invasion under false pretenses.\nCivilians under fire\nRussia has killed or injured close to 50,000 civilians during the war including in strikes on maternity wards, churches, schools and hospitals, U.N. experts say, with civilian casualties reaching a three-year monthly high in July. Last week, a kindergarten was among the dozens of buildings hit in a deadly Russian strike on the western city of Lviv.\n“Either the Russian military has terrible aim or you are targeting civilians,” Welker said. “Which is it?”\nLavrov said Russia only targeted sites linked to the Ukrainian military.\n“We never targeted the civilian targets of the kind you cited,” he said, going on to say it was Ukraine that was “purposely” hitting churches and civilian settlements. Ukraine denies targeting civilians.\nOvernight Thursday to Friday, Russia launched its largest assault since early July, firing nearly 600 drones and 40 ballistic cruise missiles, including at a U.S.-owned factory in western Ukraine that makes coffee machines and other electronics. At least 15 workers were injured.\nLavrov said that he had not heard of the factory incident, but that some people are “really naïve, when they see a coffee machine in the window, when they believe that this is the place where coffee machines are produced.”\nFlex Ltd., the Texas-based company that owns the factory, said in a statement last week that the factory is “strictly focused on civilian consumer manufacturing” and “does not produce, supply, or support any military equipment or defense-related components.”\nPutin and Trump\nRussian attacks on Ukraine have doubled since Trump took office in January and continued during talks with Putin in Alaska, leading some lawmakers to ask whether Putin is stringing Trump along.\n“If President Putin has so much regard for President Trump, why is he taking actions that are undermining his push for peace?” Welker asked.\nLavrov said Putin respected Trump’s focus on the U.S. national interest, and that he believed “President Trump respects the same attitude of President Putin to protecting national interests of Russia.”\nWhatever Trump and Putin discuss “is not a secret” and both leaders “want peace in Ukraine,” he said.\nOn Friday, Putin praised Trump and said that it might be possible for the U.S. and Russia to fully restore relations he said were at “an extremely low point.”\n“With President Trump, I believe that a light at the end of the tunnel has nonetheless appeared,” he said, calling their meeting in Alaska “very good.”\nSecurity guarantees\nLavrov addressed Russian demands that it should be a part of any international talks on Ukraine’s security after defense chiefs from the U.S., U.K., France, Germany, Italy, Finland, Ukraine and NATO met Wednesday to hash out protections that Kyiv’s allies could offer in a deal.\n“Security guarantees must be subject to consensus,” he said, claiming Russia had presented security guarantees “several times.”\nPutin is ready to meet with Zelenskyy “when the agenda is ready,” Lavrov said. But he suggested that Putin would not sign a peace agreement with Zelenskyy, whose legitimacy Moscow has questioned since Ukrainian elections were postponed last year amid martial law.\n“When we come to a stage when you have to sign documents, we would need a very clear understanding by everybody that the person who is signing is legitimate,” he said. “And according to the Ukrainian constitution, Mr. Zelenskyy is not at the moment.”\nOn Friday, optimism appeared to be on the wane in Washington.\nIn a separate interview with Welker, Vice President JD Vance said Russia had made “significant concessions” to Trump, including recognizing Ukraine’s “territorial integrity” after the war and not trying “to install a puppet regime in Kyiv.”\nBut Vance acknowledged there were “hills and valleys” in the negotiations. “We’re going to eventually be successful, or we’ll hit a brick wall,” he said.\nTrump also appeared to temper his expectations.\n“We’ll see what happens,” he told reporters on Friday. “I think over the next two weeks, we’re going to find out which way it’s going to go. And I better be very happy.”\n“It’s going to be a very important decision, and that’s whether or not it’s massive sanctions or massive tariffs, or both,” he continued. “Or do we do nothing and say, ‘It’s your fight.’”"
    },
    {
      "url": "https://www.nbcnews.com/news/us-news/carjacked-capital-crime-pandemic-still-roiling-dc-rcna224655",
      "text": "It was just after 8 p.m. when Michael Waller pulled up to his home on a well-to-do block near Capitol Hill in Washington, D.C. Waller, then 59, glanced at his phone to check his email. Within seconds, two men appeared on either side of his gray Mercedes waving Glock handguns.\nThe man on the passenger side opened the door and slammed his gun into Waller’s right ear and scalp, knocking him out for a moment. When he came to, he was still strapped into his seat belt, blood flowing down the side of his head.\nThe gunmen ordered him out of the car and commanded him to throw his phone into the bushes. As they began to drive away, one pointed his gun at Waller and threatened to kill him on the spot — prompting Waller, battered and bloodied, to duck into an alley.\n“These guys knew what they were doing, and they were so smooth about it,” said Waller, a defense and foreign policy strategist at the Center for Security Policy, a conservative think tank. “They seemed like real professionals.”\nThe carjacking in August 2021 made no headlines. It was part of a crime wave that shook the city during the pandemic. Four years later, the capital is teeming with National Guard troops and federal officers called in by President Donald Trump, who also took over the Metropolitan Police Department after highlighting the recent attempted carjacking of an administration staffer.\nThe takeover has sparked a fierce debate over the state of crime in D.C. What’s beyond dispute is that carjackings exploded in Washington and several other major cities in the U.S. after 2019.\nIt’s a particularly brutal crime, experts say, one that often causes lasting psychological damage. And while most types of crime that surged during the pandemic have since dropped off, carjackings are one of the few that have remained well above pre-pandemic levels in certain big cities like D.C., police data shows.\n“It became the crime of the pandemic,” said Chuck Wexler, executive director of the Police Executive Research Forum, a D.C.-based organization of current and former law enforcement officials focused on improving policing. “And the reason you still have it is because juveniles learned how to do it. That presents a lot of challenges for the justice system.”\nThe soaring number of young people who have engaged in carjacking is indeed one of the key factors that has driven the surge in the Washington area and beyond, according to interviews with more than a half-dozen police officials, criminologists and youth advocates.\nSome of these perpetrators stole vehicles to use them to commit more crimes. Many others commit carjackings simply for the thrill of it, or to earn respect and attention on social media, according to police investigators and advocates who have spoken to the young offenders.\nMany of those who were arrested in or around Washington were out of police custody in a day or two, the investigators and advocates said. In Waller’s case, court records show that the men who were later arrested for being in the stolen car were not prosecuted at all — an outcome that those familiar with the system in D.C. said was not uncommon.\nOver the last 18 months, the carjacking numbers have fallen in the D.C. area. Sgt. Josh Scall, a supervisor in the carjacking unit in neighboring Prince George’s County, Maryland, said he’s proud of the numerous arrests his unit has made in recent years, and the impact that’s having on the crime rate. But even one carjacking is one more than he wants to see in his county.\n“People look at these numbers and they don’t take a minute to realize, numbers are people,” Scall said. “These are people who were violently removed from their vehicle and are going to be psychologically changed for the rest of their lives.”\n“We can parade that we’re not at 573,” Scall added, referring to the record number of carjackings recorded in Prince George’s in 2023. “But it’s still unacceptable in our books.”\n'Spiraled out of control'\nPeter Newsham was entering his fourth year as the chief of Washington’s Metropolitan Police Department when Covid began to sweep across the country. Crime skyrocketed in D.C. and other major cities spurred by a perfect storm of factors, including school closures, mass layoffs and social unrest following the death of George Floyd.\n“I had never seen anything like it in my time in Washington, D.C.,” said Newsham, who joined the force in 1989.\nCarjacking was among the crimes that rose the highest and the fastest. Newsham’s department was dealing with a staffing crisis, low morale and new legislation that reduced penalties for young offenders.\nEven when investigators were successful in tracking down suspects, Newsham said, they were often right back on the street in a matter of days. That was especially true for those under the age of 18, who amounted to 65% of the 243 arrests the department made for carjacking in 2020 and 2021, according to police data.\n“These young people knew they could get away with it,” he said. “There was very little consequence, and it spiraled out of control.”\nRoughly 150 carjackings took place in the district in 2019. In 2020 that number more than doubled to 360, according to police data.\nNewsham left the department in January 2021 to become chief of police in Prince William County, Virginia. That year, the number of carjackings in D.C. rose to 424. It went even higher — to 484 — in 2022.\nBut the next year was when the situation got really out of hand. A total of 957 carjackings — nearly three a day — were reported in D.C. in 2023, according to police data.\nLt. Scott Dowling, who leads the more than two dozen detectives in the Metropolitan Police Department carjacking task force, said a relatively small group of offenders helped drive the explosion in cases.\n“The same people were committing multiple, multiple, multiple offenses,” Dowling said. In one case in 2023, a search warrant led to the arrest of three people suspected of carrying out roughly 50 carjackings and thefts, according to Dowling.\nThe carjacking trajectory in D.C. during the pandemic mirrored that of other major U.S. cities.\nPhiladelphia went from 224 carjackings in 2019 to 409 in 2020. The numbers kept rising over the next two years — to 866 in 2021 and 1,311 in 2022.\nIn Chicago, carjackings rose from 603 in 2019 to 1,852 in 2021. The city experienced a slight dip in 2022, recording 1,649.\nThe numbers began to drop sharply in those cities and many others in 2023. Not so in D.C. or one of its closest neighbors — Prince George’s County.\nSituated along Washington’s eastern border, the sprawling, 900,000-person county is more residential than the nation’s capital. It's home to the National Harbor and the main campus of the University of Maryland but also has pockets of low-income areas with high crime.\nSgt. Scall, the carjacking unit supervisor, said the volume of cases was so extreme in 2023 that he would go to bed with his phone in his hand.\n“We had some really bad incidents happen where we were surveilling for cars and we were shot at,” Scall said. “That happened three times. It was pure insanity.”\nScall said the stolen cars were rarely going to chop shops, where the perpetrators could make quick cash. It was far more common for people to steal cars for the thrill of it, to get recognition online or to use them to commit other crimes, he said.\nAnd it wasn’t just young people from poorer neighborhoods behind the crimes.\n“There’s no quintessential carjacker,” Scall said. “We’ve done search warrants at million-dollar houses. It really crossed over financial lines.”\nThe number of carjackings in Prince George’s County dropped to 368 in 2024, down nearly 40% from 2023. So far this year, there have been 113, which is roughly 50% fewer than the 250 recorded at this point in 2024.\nScall attributes the drop to his unit’s increased prowess in busting the carjackers.\n“If you do a carjacking in Prince George’s County, we’re usually closing it in a day or two,” he said. “We’ve sharpened our skills. We know what to do. We know where to look.”\nBut it’s not lost on Scall that the numbers this year are still trending far higher than the 93 recorded in 2019. He said policy shifts have helped keep repeat offenders off the street for longer than before, but he thinks the juvenile justice system is “still playing catch up.”\n“If they are a juvenile, I don’t expect them to go to jail for 20 years,” Scall said. “But I think if you violently rob someone you should probably sit out for a little bit.”\nIn D.C., 183 carjackings were recorded through July of this year. That’s about 40% fewer than the same period in 2024. But it’s already higher than the 152 incidents in all of 2019.\nThe case that got Trump’s attention — the attempted carjacking of Edward Coristine, 19, better known by his online nickname “Big Balls — took place in the early morning hours of Aug. 3. According to the police report, officers on patrol spotted about 10 \"juveniles\" assaulting Coristine, who worked under Elon Musk at the so-called Department of Government Efficiency, or DOGE, before moving to the Social Security Administration. The officers managed to arrest two suspects — a boy and a girl, both 15.\nDowling said he believes new tracking software in cars, as well as new laws that raised penalties for gun crimes and thefts, helped to bring down the incidents of carjacking. But old-fashioned police work also played a significant role, he said.\n“My detectives are phenomenal,” Dowling said. “I often say that I don’t get impressed very easily, but they impress me.”\nHelping teens\nJawanna Hardy, the founder of the nonprofit Guns Down Friday, has devoted her adult life to helping victims of crime and young people caught up in the criminal justice system in the D.C. area. That gave her an intimate glimpse into the factors driving the carjacking crisis.\nAs the pandemic took hold, children suddenly lost the structure that school brought. Many in lower income areas experienced losses far dearer to them, Hardy said.\n“A lot of my kids lost their grandparents, their strongest support system, during Covid,” said Hardy.\nVideo clips glorifying car thefts caught fire on social media. Hardy noticed that young people in different cities were boasting about their exploits.\n“Everybody had a name. They had a song,” Hardy said. “I could understand why the children were into it. It was exciting.”\nAs the months went on, Hardy also noticed that the youths who were being brought to her for mentorship after getting caught up in the justice system were younger than she was used to seeing.\n“For some reason, the 15-year-olds were tearing the city up,” she said. “I’d say 75% of the kids I was working with were 15 when they started committing these crimes.”\nWhen NBC News first reached out to Hardy last week, she was with a 15-year-old who had recently been arrested for stealing cars. He was one of the so-called Kia Boys, who had been using basic tools to break into the vehicles and start them.\n“I don’t know what made me decide to do it,” the teen said. “There was just a freedom. You’re not supposed to be inside a vehicle, but it’s moving fast at your feet. I enjoyed feeling that rush.”\nAccounts like that sparked a light bulb moment for Hardy.\n“I realized we were addressing the violent piece, but we weren’t addressing the need to want to drive,” she said.\nSo for young people who were at least 16, she began to help them navigate how to get a learner’s permit. It was clear they wanted to drive. Why not help them do it legally?\n“That’s what we’re doing right now,” Hardy said. “We’re trying to get kids into the mindset of, ‘I can get a license. I can get a car. I can do this the right way.’”\n‘Why have laws?’\nA day after Waller’s Mercedes was stolen, Prince George’s County officers spotted it at a busy intersection 6 miles from his home. When they tried to pull the car over, the driver sped off, according to a police spokesperson. The Mercedes crossed into D.C. but crashed into another vehicle on a highway there.\nD.C. police arrested the four occupants, one of whom had a handgun with an extended magazine, according to a police report on the incident. Investigators also recovered pills with labels indicating they were oxycodone, according to the report.\nThe suspects included two brothers, Davon Alston, 18, and Juvan Alston, 19. The two other suspects were 18 and 21. The four were booked on a range of charges, including carrying a pistol without a license, unauthorized use of a vehicle, fleeing a law enforcement officer and possession with intent to distribute a controlled substance, the police report says. (It does not make clear who was hit with the gun charge.)\nFor reasons unknown, federal prosecutors declined to bring charges, according to court records obtained by NBC News. The U.S. Attorney’s Office for the District of Columbia did not respond to a request for comment.\nWaller, for his part, knew that his car had been recovered and that some suspects had been arrested. A detective had asked him to participate in a virtual line-up, but Waller said it took him too long to identify the one gunman he got a decent look at, the one who had pistol-whipped him.\nWaller said he never heard back from the police or prosecutors. When NBC News informed him this week that the men in the car weren’t charged, Waller noted that he had no way of knowing whether the four were involved in the carjacking.\nEven still, he was aghast.\n“They’re literally letting criminals in a stolen car, who are escaping police, back on the streets,” Waller said. “Then why have laws?”\nEleven months after the carjacking, a 17-year-old was shot dead outside a home in Southeast D.C. Two teenagers were arrested and charged with murder: the Alston brothers.\nThey have pleaded not guilty and their trials are slated for next year.\nPolice charging documents say a video posted to Instagram 30 minutes after the fatal shooting showed Davon Alston and a second person riding in a Mercedes that was believed to have been used in the shooting.\nAccording to the documents, it had been carjacked about an hour earlier."
    },
    {
      "url": "https://www.nbcnews.com/politics/elections/texas-senate-passes-new-republican-drawn-congressional-map-rcna226278",
      "text": "The Republican-controlled Texas state Senate passed the party’s new congressional maps overnight, completing a legislative odyssey that included significant Democratic delays and sparked a nationwide scramble over redistricting in the process.\nThe vote means the maps, which were designed to pad the Republican majority in the U.S. Congress, will go into effect when signed by Gov. Greg Abbott, a proponent of the plan who has been cheered on by President Donald Trump.\n“The One Big Beautiful Map has passed the Senate and is on its way to my desk, where it will be swiftly signed into law,” Abbott said in a statement issued Saturday.\nDemocrats have promised to challenge the measure in court.\nTrump initially led the calls for Texas to redraw its congressional map, saying his party is “entitled to” five more congressional seats from the state. That’s what the maps intend to do: By redrawing congressional district boundaries in key cities as well as along the state’s border, Texas will have 30 congressional districts that Trump carried last fall by a double-digit margin.\nThe GOP currently controls 25 of the state’s 38 congressional districts.\nRepublicans have been adamant, and blunt, from the start of the process that their exercise has been a political one aimed solely at increasing their party’s power in Washington, where the House is almost evenly balanced. Democrats need a net gain of just three seats in the 2026 elections to take the majority.\nDemocrats have accused Republicans of setting a dangerous precedent by not waiting until 2031 to redraw the lines, as is customary, and they said the new maps would hurt minority representation in the state, a charge their Republican colleagues denied.\nUnlike the state House, where business ground to a halt earlier this month when dozens of Democrats fled the state to deny the body a quorum to move forward with legislation, forcing Abbott to call another special session, the Senate has not been stymied by those efforts.\nThe move drew swift condemnation from opponents of the measure.\n“This is not democracy, this is disgraceful,” state Sen. Sarah Eckhardt said on X.\nDemocrats had planned to push back the Senate vote into the morning Saturday in a last-ditch attempt to delay passage.\nEarlier, state Sen. Carol Alvarado, leader of the Senate Democratic caucus, announced on social media that she planned to filibuster the bill with a long speech and intended to speak for several hours. But just when she expected to start, the Senate broke for a long dinner break.\nWhen members returned, Alvarado never had a chance to filibuster because Republicans accused her of breaking Senate rules by attempting to fundraise off the coming filibuster.\nSen. Charles Perry said it “appears to be potentially unlawful, at least unethical, using state resources for a campaign purpose.”\nWith Abbott poised to sign the new maps into law, the spotlight shifts to California, where Democratic lawmakers have their own proposal to redraw their state’s congressional boundaries as political retribution for Texas’ move. Unlike in Texas, where regular legislation is enough to change the maps, California Democrats’ proposal must also be approved by the voters in a special election this fall in order to take effect."
    },
    {
      "url": "https://www.nbcnews.com/news/us-news/new-york-tour-bus-crash-victims-identified-rcna226776",
      "text": "Police identified the five people who were killed in a tour bus crash in western New York on Friday.\nNew York State Police said in a news release on Saturday that Shankar Kumar Jha, 65, of Madhubani, India; Pinki Changrani, 60, of East Brunswick, New Jersey; Columbia University student Xie Hongzhuo, 22, of Beijing, China; Zhang Xiaolan, 55, of Jersey City, New Jersey; and Jian Mingli, 56, of Jersey City, died in the crash.\nColumbia University said in a statement Saturday: “We are devastated by the death of one of our students, Xie Hongzhuo, in the tragic bus accident near Buffalo on Friday.”\n“This heartbreaking loss is felt deeply across our community. We are in close contact with her family and offering them our full support,” the statement continued, noting counseling services are available to students. “Our thoughts and deepest sympathies are with her family, friends, and all who have been touched by this tragedy.”\nThe tour bus, which was traveling from Niagara Falls to New York City, careened out of control and fell on its side along an interstate parkway near Buffalo around 12:45 p.m. Friday.\nThe bus was carrying 54 people, including the driver and a tour guide. Some of the occupants were ejected from and trapped under the bus, according to authorities.\nDozens of the occupants were hospitalized for their injuries, including several children.\nErie County Medical Center, where 21 passengers were hospitalized for injuries, said that 14 patients remained at the hospital as of Saturday afternoon, but were in stable condition.\nAuthorities are still investigating the cause of the crash, which did not involve any other vehicles.\nHowever, they said Friday they believe the driver, Bin Shao, 55, of Flushing, New York, “became distracted, lost control, and overcorrected.” Shao “had no signs of impairment and the tour bus had no mechanical failure,” according to the news release.\nAuthorities added that the bus was at “full speed” during the crash, but did not specify how fast the vehicle was driving. Interstate 90 has a speed limit of 65 mph.\nIt does not appear that the driver has been accused of or charged with any crimes.\nA National Transportation Safety Board team was dispatched Friday to investigate the crash. The scope of the investigation will include the crash site, the mechanical condition of the bus, highway design and the driver — including fatigue, distraction and qualifications.\nAt a Saturday news conference, the NTSB asked witnesses or anyone with video footage to contact the agency.\nThe tour company operating the vehicle, M&Y Tour Inc. of Staten Island, has not returned requests for comment."
    },
    {
      "url": "https://www.nbcnews.com/world/europe/global-mail-carriers-suspend-us-deliveries-confusion-new-duties-rcna226828",
      "text": "LONDON — Postal services across the world are halting shipments to the United States this week amid mounting confusion over new import duties that will apply to parcels starting Friday.\nPresident Donald Trump signed an executive order last month abolishing the trade loophole known as “de minimis,” which since 2016 had allowed goods worth up to $800 to enter the U.S. duty-free.\nThe end of the exemption is being extended worldwide after the loophole was closed in May for packages from mainland China and Hong Kong.\nUnder the new rules, personal gifts worth less than $100 will still be duty-free, but all other packages will face the same tariffs as standard imports from their country of origin.\nThe planned policy shift, which operators say lacks clear procedures, has raised concerns about backlogs as services are put on hold.\nPostal providers in Belgium, Denmark and New Zealand are among several operators that have already suspended shipments of packages to the U.S. until they can retool their systems to comply with the new rules. Letters and documents are generally unaffected.\nServices in Germany, France, Britain and India have announced they will follow suit in the coming days.\nFrance’s national postal service, La Poste, said in a statement that the U.S. did not provide full details or allow enough time to prepare for new customs procedures. New Zealand’s postal service said parcel deliveries to all U.S. states and territories would be “temporarily unavailable until further notice” while systems are updated to meet new U.S. customs requirements.\nDHL, one of the world’s largest courier companies, said Friday that it will stop accepting parcels containing goods from business customers destined for the U.S. beginning Monday.\nThe company cited unresolved “key questions” about the process, including “how and by whom customs duties will be collected in the future, what additional data will be required, and how the data transmission to the U.S. Customs and Border Protection will be carried out.”\nDHL will, however, continue to deliver private parcels labeled as gifts valued under $100, in line with White House assurances.\nThe White House said ending the duty-free exemption would help combat “escalating deceptive shipping practices, illegal material, and duty circumvention,” claiming some shippers had “abused” the exemption to send illicit drugs such as fentanyl into the U.S.\nIt said the number of de minimis parcels jumped from 134 million in 2015 to more than 1.36 billion in 2024 as shippers “deceptively exploit the de minimis privilege in an effort to evade duties, inspection, and U.S. law.”\nMost of those packages came from mainland China and Hong Kong, which the Trump administration initially targeted as part of efforts to curb American shoppers from ordering low-value goods from China-linked retailers such as Temu and Shein.\nThe White House briefly closed the loophole for mainland China and Hong Kong in February, but quickly extended the deadline to May 2 amid confusion over how the new duties would be collected."
    },
    {
      "url": "https://www.nbcnews.com/nbc-out/out-news/least-21-hospitals-ended-restricted-trans-care-minors-january-rcna226640",
      "text": "More than 20 hospitals and health systems have temporarily or indefinitely rolled back transgender care for minors and some young adults this year amid threats of federal investigations and cuts to government funding, an NBC News analysis found.\nTwelve hospitals have announced they have discontinued or will discontinue puberty blockers and hormone therapy for trans patients younger than 19. Four announced they are no longer providing transition-related surgeries to those patients; one said it discontinued gender-affirming care for teens; and four said they temporarily stopped transgender care for those under 19 after an executive order from President Donald Trump in January but resumed after a judge blocked part of the order in March.\nIn addition to those 21 hospitals, another five have removed webpages dedicated to trans care for minors from their websites this year — one said it is still providing trans care to minors, one would only say it continues “to comply with applicable state and federal laws and regulations,” and three did not respond to requests for comment. And separately, a health center in Iowa stopped providing hormone therapy to trans adults due to a Trump order that prohibits federal funds from being used to “promote gender ideology,” the Iowa Capital Dispatch reported.\nThe changes have come as hospitals attempt to comply with state laws, which in many instances prohibit discriminating against trans people in medical care, as well as federal guidance, which in recent months has threatened to revoke hospitals’ federal funding or charge them with civil or criminal penalties if they continue to provide trans care to patients younger than 19.\nPatients and families affected by these changes in care have described the effects as devastating.\nOne Florida mom, who asked that her name not be published due to fears that she could face harassment or be targeted by the federal government, recently bought one-way tickets to Berlin so she and her 15-year-old trans daughter could move there next month. The mom has acquired a language-learning visa, and her daughter will be able to live with her because she is a minor.\nWhen her daughter first sought access to transition care, Florida Gov. Ron DeSantis’ administration and state Republican legislators were trying to ban it, so in September 2021, the teen and her dad started driving 11 hours to Alabama every few months so she could access care at the University of Alabama’s gender clinic. Then, in August 2023, a court allowed a care ban to take effect in Alabama. Last July, they began flying to Washington, D.C., to receive care at Children’s National Hospital.\nLast month, the hospital announced in a message on its website that “in light of escalating legal and regulatory risks to Children’s National, our providers, and the families we serve, we will be discontinuing the prescription of gender-affirming medications” effective Aug. 30.\nThe mom said even if she could find another doctor in the U.S. for her daughter, she fears the family might have just one visit “before the government steps in again.”\n“Where can we go?” she said. “Growing up, we were always told that America is the greatest country in the world, and now we’re having to flee so that my child can get the health care she needs, and for our safety.”\n‘These threats are no longer theoretical’\nSince 2021, 27 states have enacted measures prohibiting access to puberty blockers, hormone therapy and/or surgeries for trans minors as part of a wider effort to restrict trans rights.\nSupporters of the legislation say the care has not been adequately studied, can have harmful long-term effects and that minors cannot actually consent to it. However, doctors who treat trans youth say puberty blockers and hormone therapy have been provided to minors who are not trans for decades to treat other conditions, such as precocious puberty. In addition, nearly all major medical associations in the United States support access to transition-related care for minors and oppose restrictions on it, with the American Medical Association calling government restrictions “a dangerous intrusion into the practice of medicine.”\nA study published earlier this year in JAMA Pediatrics found that less than 0.1% of adolescents in the U.S. with private insurance in the United States are trans and are prescribed puberty blockers or gender-affirming hormones. A 2024 study published by the Harvard T.H. Chan School of Public Health found that the rate of teens ages 15 to 17 undergoing gender-affirming surgery was 2.1 per 100,000.\nThe remaining states where care is legal — particularly California, Colorado, Oregon, Illinois, Washington, Connecticut and Pennsylvania — have seen an influx of out-of-state patients, with some parents of trans minors even relocating their families to those states to maintain care for their kids.\nParents of trans youths have seen those states — and hospitals such as the Children’s Hospital Los Angeles, which is home to one of the nation’s oldest gender clinics — as safe havens.\nHowever, in January, the Trump administration began targeting providers of trans care, including an executive order that sought to bar federal funding from going to medical schools and hospitals that provide such care to people younger than 19. In March, a federal judge blocked that part of the order, and some hospitals resumed treatments.\nBut then, in April, Attorney General Pam Bondi issued a memo that said the Justice Department would investigate doctors who provide transition care to minors under existing laws, including laws against genital mutilation. In July, the DOJ sent subpoenas to more than 20 doctors and clinics that provide such care. A subpoena sent to the Children’s Hospital of Philadelphia, which was made public Monday as part of a legal filing attempting to block the investigations, requested the names, birth dates, Social Security numbers, addresses and parent/guardian information of all patients who were prescribed puberty blockers or hormone therapy.\nThe Department of Health and Human Services, the Centers for Medicare and Medicaid Services, the FBI and the Federal Trade Commission have also taken action to restrict care, both for minors and adults.\nChildren’s Hospital Los Angeles mentioned all of these actions and more in a June 12 letter to hospital staff detailing its decision to close the Center for Transyouth Health and Development, which has been running for three decades, effective July 22.\nThe letter, which a spokesperson for the hospital shared with NBC News, described an HHS review published in May “dismissing current evidence-based care protocols and standards of care while promoting alternative best practices for the treatment of pediatric gender dysphoria.” The HHS review “included dozens of references to CHLA and the Center for Transyouth Health and Development,” the letter said.\n“Taken together, the Attorney General memo, HHS review, and the recent solicitation of tips from the FBI to report hospitals and providers of [gender-affirming care] strongly signal this Administration’s intent to take swift and decisive action, both criminal and civil, against any entity it views as being in violation of the executive order,” this hospital’s leadership wrote. “These threats are no longer theoretical. The federal government has already cut off hundreds of millions of dollars from U.S. academic and research institutions for noncompliance with executive orders, often with little to no warning.”\nEarlier this month, more than a dozen states, led by New York Attorney General Letitia James, sued the Trump administration to block investigations into doctors and hospitals who provide gender-affirming care to minors.\nThe complaint argued that the federal government was trying to institute a national ban on such care when Congress has not passed one, violating the 10th Amendment by trying to usurp the power of states that have not passed bans. It also argued that hospitals were being forced to either defy the federal threats or comply and violate state laws against discrimination in medical care.\nTaylor Rogers, a White House spokesperson, said in a statement at the time that Americans support Trump’s efforts to stop “the despicable mutilation and chemical castration of children,” using inflammatory language to describe transition care.\n“The President has the lawful authority to protect America’s vulnerable children through executive action, and the Administration looks forward to ultimate victory on this issue,” Rogers said.\nRobin Maril, an assistant professor of constitutional law at Oregon’s Willamette University, said the Trump administration is attempting to restrict access to transition care through guidance issued by regulatory agencies. That guidance tells doctors and hospitals “exactly how the government is going to go after them,” Maril said.\nHospitals are weighing losing all federal funding, which could force them to close, Maril said, or standing up to the Trump administration.\n“To stand up to the Trump administration at this point would result in kids losing care for all sorts of things,” Maril said.\n‘That’s just not fair’\nThe climate created by the administration’s policies, the investigations and the legal battles have been surreal for Dr. Kade Goepferd, the chief education officer at Children’s Minnesota and a pediatrician in the hospital’s Gender Health Program, which has not ceased or paused trans care for minors.\nGoepferd, who uses they/them pronouns, said their patients’ parents are scared, and the kids don’t understand why their friends can access any health care when needed, but they might not be able to access this specific type of care because they’re trans.\n“They feel very singled out,” Goepferd said. “The teenagers feel a lot of hopelessness. The younger kids feel a lot of fear for what their future may or may not be like.”\nGoepferd said they have several patients who have moved or plan to move out of the country due to the increasingly restrictive care landscape for trans youth, and the number of out-of-state patients they see has increased over the last few years. The clinic’s waitlist for a first appointment is about six months.\nThey said one of their greatest concerns “is that we are tying the ability of transgender young people to access care they need, and the ability of their parents to make medical decisions for them, to the general public’s ability to understand who they are and what their medical care is.”\n“That’s just not fair,” they said. “We don’t do that with other areas of medicine. We rely on medical guidelines and expertise to make decisions. So we’re treating essential health care for transgender youth as exceptional in some way, and what I wish people knew more than anything is that it is not. I provide this type of health care the same way I provide any other type of health care.”\nAs for the Florida mom, she said that as soon as her daughter could talk she would point to Daphne in the cartoon “Scooby Doo” and say, “I that girl.” A psychiatrist said the child was “persistent, insistent and consistent” in her gender for years, and they have supported her and spent at least $7,500 on travel to access care in other states.\nBut now, she said, it feels like they’re out of options, and she’ll be flying to Berlin with her daughter in September and leaving her three other children in the States with their dad.\n“It was like a nice fantasy that I would live in Europe one day, but then it became this absolute necessity, and I have to leave my other kids, and I don’t even know how to explain how fearful I feel and how heartbreaking this is,” she said."
    },
    {
      "url": "https://www.nbcnews.com/news/us-news/sex-abuse-lawsuit-elite-delbarton-school-poised-first-civil-trial-invo-rcna225786",
      "text": "Delbarton, an elite all-boys Catholic prep school in northern New Jersey where several former students have come forward to allege abuse at the hands of the Benedictine order’s monks, could soon find itself under a harsh spotlight.\nA trial resulting from a lawsuit by a former Delbarton student who says he was 15 when he was sexually abused by a monk is scheduled to begin Sept. 2 in Morris County Superior Court in what would be the first civil trial involving the Catholic church in the Garden State.\nIdentified by the initials T.M., the ex-student alleges he was assaulted by a former Delbarton teacher, the Rev. Richard Lott, and he’s accused the Benedictine order of “enabling that abuse,” according to court records.\nThe lawsuit names Delbarton School and its connected monastery, St. Mary’s Abbey as defendants. Lawyers from both sides have been barred by the judge from discussing the case, according to a letter the school sent to the greater school community, including students, their families, alumni and faculty on Aug. 15.\nT.M.’s case is one of dozens that have been filed against Delbarton, a college prep school in Morristown where the tuition is $48,725-a-year and that boasts well-known alumni like New York Yankees shortstop Anthony Volpe, “Game of Thrones” star Peter Dinklage, and the sons of former New Jersey Gov. Chris Christie.\nIn the lawsuit he alleges that in 1975 Lott plied him with liquor before assaulting him in a barn on campus where the priest lived, and he also alleges in his lawsuit that Lott would invite other underaged students over for frequent illicit parties.\nT.M. said he reported the alleged assault to Abbott Brian Clarke in a letter after he graduated in 1977, court records show.\nClarke, however, said he did not discipline Lott or notify the police, and admitted, when he was deposed on Sept. 13, 2018, that he destroyed the letter “Because it’s bad for the reputation of a school when there is sexual abuse associated with it,” according to a transcript of Clarke’s testimony.\nClarke, who was the abbot of St. Mary’s Abbey from 1975 to 1995, died in 2019. Lott, who is 89 and no longer lives on campus, could not be located for comment. Lott’s lawyer did not immediately respond to a request for comment.\nIn a joint statement, Abbot Jonathan Licari, St. Mary’s Abbey administrator, and the Rev. Michael Tidd, the Order of St. Benedict and Delbarton School headmaster, said they “cannot comment on any current litigation.”\nIn 2018, the school publicly acknowledged that at least 30 men had come forward with allegations that over the course of three decades they had been victimized by 13 past or current priests and monks at the school — and by a lay faculty member who is now retired.\nThen-Abbot Richard Cronin and Tidd, in a letter dated July 20, 2018, said that eight civil actions against the school and St. Mary’s Abbey, which is the monastery on the campus, had been settled and seven remained. In the letter, the school said it had notified the Morris County Prosecutor’s Office of each allegation and continue to work closely with the office through its investigation.\n“In every single case that was settled, there was no admission of liability by the order,” said Greg Gianforcaro, a lawyer who represented some of the accusers.\nAfter the initial lawsuits in 2018, more than 30 more people have come forward with allegations of sexual abuse against the school’s monks and have either filed their own lawsuits or joined existing cases, he said. In 2019 to 2021, New Jersey’s Child Victim’s Act went into effect, allowing people to file civil claims of sexual abuse even when that abuse fell outside of the statute of limitations. It is unclear how many cases are still pending against the school; a spokesperson for the school said they could not provide those numbers.\nBilly Crane, who along with his twin brother, Tom, sued Delbarton in 2012 alleging sex abuse by two priests in the 1970s, had his case settled in 2018. He said the school did not have to admit liability as part of the settlement. The brothers did not attend the school but were on campus regularly because their father was a teacher there.\nIn an interview with NBC News, Crane said that some of the monks had coined a name for the dozens of former students who have come forward with allegation of sexual abuse at the hand of the school’s clergymen — \"termites.\"\n“I’ve heard that from other survivors going through the legal system now,” Crane told NBC News. “It shows what they really think of us.”\nThe “termites” reference appears in a 2011 interview conducted by Steve Ordway of the mediation firm Little Voices, with the Rev. Donal Fox, one of the Delbarton monks accused of sexual misconduct. That interview could be entered into evidence for T.M.’s trial.\nIn the interview, Ordway asked Fox, who is now deceased, whether there were “any more termites out there” and Fox replied there were seven other “incidents of concern.”\nThe firm was put in place to make sure the accused monks were complying with their “safety plan,” which includes enforcing restrictions that would bar them from having contact with the children, according to court records and Ordway’s wife, Ann Ordway, who also worked with Little Voices.\n“That doesn’t sound like the kind of language he would use,” Ann Ordway, said of her husband, an ailing Vietnam vet, in an interview. “But he could have been repeating language he heard from the monks.”\nThe court record that includes the quote does not make clear the origins of the term and does not indicate whether Ordway was repeating a word someone else used first.\nIn reference to accusers being referred to as “termites,” the school said that “derogatory remarks made by either a monk or a layperson are neither condoned nor tolerated at St. Mary’s Abbey or Delbarton School.”\nAmong the monks who’ve been accused in lawsuits of preying on students decades ago are the Revs. Benedict Worry, 73, and Jude Salus, 79, both of whom still live in the monastery on the 187-acre campus that is only a short stroll from the classrooms and athletic facilities used by the students, the school confirmed.\nLicari and Tidd said that the two monks are “overseen by Abbey leadership and the Abbey’s Safe Environment policies.”\n“These monks have no contact with our students and are not permitted in or near any school facilities,” they said.\nOf the two cases involving Worry, one has been settled and the other is pending. The lawsuit filed against Salus is ongoing, Gianforcaro said.\nCrane said he found it \"very disturbing\" that Worry and Salus were still living on campus, \"that they could potentially have contact with students.”\n“They’re like unsupervised predators,\" he said.\nCrane went on to say, “There’s really nothing besides their consciences to stop them from walking out. … And their consciences have been corrupted.”\nThe school, however, made clear that the monks are heavily supervised.\n“As required by the Abbey’s Safe Environment protocols, each monk’s activities and movements are monitored under a Safety Plan that is annually reviewed by Abbey leadership and independent, third-party oversight from the Abbey Review Board,\" Licari and Tidd said in a statement. \"Both men are disabled, have limited mobility, and must be accompanied by an adult informed about their Safety Plan’s requirements on the infrequent occasions that they leave campus, typically for a doctor’s appointment.\""
    },
    {
      "url": "https://www.nbcnews.com/world/mexico/boxer-julio-cesar-chavez-jr-stand-trial-mexico-alleged-cartel-ties-rcna226831",
      "text": "A judge in Mexico said boxer Julio César Chávez Jr. will stand trial over alleged cartel ties and arms trafficking but could await that trial outside of detention, the boxer’s lawyer said.\nChávez’s lawyer, Rubén Fernando Benítez Alvarez, confirmed that the court imposed additional measures and granted three months of further investigation into the case. He described the claims against his client as “speculation” and “urban legends” following the court hearing on Saturday in the northern Mexican city of Hermosillo.\nIf convicted, Chávez — who took part in the hearing virtually from a detention facility — could face a prison sentence of between four and eight years, Alvarez said.\nChávez, 39, who had been living in the United States for several years, was arrested in early July by federal agents outside his Los Angeles home for overstaying his visa and providing inaccurate details on an application to obtain a green card. The arrest came just days after a fight he had with famed American boxer Jake Paul in Los Angeles.\nSince 2019, Mexican prosecutors have been investigating the boxer following a complaint filed by U.S. authorities against the Sinaloa Cartel for organized crime, human trafficking, arms trafficking and drug trafficking.\nThe case led to investigations against 13 people, among them Ovidio Guzmán López — the son of convicted drug lord Joaquín “El Chapo” Guzmán — along with some collaborators, hitmen and accomplices of the criminal organization. Guzmán López was arrested in January 2023 and extradited to the U.S. eight months later.\nFollowing the inquiry, the Federal Attorney General’s Office issued several arrest warrants, including one against Chávez.\nMexican President Claudia Sheinbaum said Chávez was wanted since 2023 in Mexico, but that he wasn’t detained because he spent most of the time in the U.S.\n“The hope is that he will be deported and serve the sentence in Mexico,” Sheinbaum said in July.\nThe boxer, who is the son of Mexican boxing great Julio César Chávez, was deported by the U.S. on Aug. 19 and handed over to agents of the Federal Attorney General’s Office in the state of Sonora, who transferred him to the Federal Social Reintegration Center in Hermosillo.\nThe high-profile case comes as the Trump administration is pressuring Mexico to crack down on organized crime, canceling visas of notable Mexican artists and celebrities and ramping up deportations.\nChávez has struggled with drug addiction throughout his career and has been arrested multiple times. In 2012, he was found guilty of driving under the influence in Los Angeles and was sentenced to 13 days in jail.\nHe was arrested last year for weapons possession. Police reported that Chávez had two rifles. He was released shortly afterward upon posting $50,000 bail, on the condition that he attend a facility to receive treatment for his addiction."
    },
    {
      "url": "https://www.nbcnews.com/politics/trump-administration/ghislaine-maxwell-transcript-interview-full-doj-tapes-epstein-files-rcna226689",
      "text": "Here's the full transcript of the Justice Department's interview with Ghislaine Maxwell, who'd been convicted sex offender Jeffrey Epstein's accomplice.\nDeputy Attorney General Todd Blanche interviewed Maxwell, who's serving a 20-year prison sentence on sex trafficking charges, over a two day period last month.\nThe unusual interview came after the DOJ and FBI came under fire from President Donald Trump's supporters for saying in a memo that they had reviewed the Epstein files and no other people were expected to be charged and no further information would be released.\nEpstein died in jail while awaiting trial in 2019. His death was ruled a suicide, but that ruling sparked numerous conspiracy theories, some of which were fueled by Trump and his allies. The DOJ-FBI memo agreed his death was a suicide, while also rejecting conspiracies that he'd had an incriminating “client list” and had blackmailed prominent individuals."
    },
    {
      "url": "https://www.nbcnews.com/news/us-news/kilmar-abrego-garcia-may-be-deported-uganda-rcna226756",
      "text": "Kilmar Abrego Garcia, the man who was wrongfully deported to a high-security prison in El Salvador, was notified by immigration authorities that he may be deported to Uganda, less than 24 hours after his release from federal custody.\nAbrego \"may be removed to Uganda no less than 72 hours absent weekends,\" a source familiar with the case told NBC News on Saturday.\nIt is unclear if Abrego would be imprisoned or walk free in Uganda if he is deported there.\nSimon Sandoval-Moshenberg, one of Abrego’s attorneys, said he would \"fight tooth and nail against any form of deportation to Uganda\" or nearby countries in Africa.\n“It is preposterous that they would send him to Africa, to a country where he doesn’t even speak the language, a country with documented human rights violations, when there are so many other options,\" he told reporters. \"This family has suffered enough.\"\nThe father of three was accidentally deported to the El Salvador’s CECOT prison, notorious for its harsh conditions, in March, in what they called an “administrative error.”\nHis deportation conflicted with a withholding of removal order from 2019 that prevents Abrego's deportation to El Salvador, where is originally from, due to concerns that he would be persecuted by violent gangs. The 2019 protective order does not bar Abrego from being deported to another country.\nAfter months of resisting, the Trump administration brought Abrego back to the U.S. in June.\nThe administration immediately jailed Abrego and charged him with conspiracy to unlawfully transport illegal aliens for financial gain and unlawful transportation of illegal aliens for financial gain. He has pleaded not guilty to the charges.\nFor months, the administration has also accused Abrego of being a member of the violent gang MS-13, which his lawyers and family members have repeatedly denied. Abrego's lawyers have said he illegally immigrated to the U.S. when he was 16 to join his brother in Maryland to escape gang violence in El Salvador.\nOn Friday, Abrego was released on parole from the jail where he was held, near Nashville, Tennessee, and immediately returned to Maryland. He was reunited with his family after spending nearly half a year away from home.\nImages of the reunification, released by advocates, show a teary-eyed Abrego holding his youngest son, who was with his father when Abrego was picked up by immigration authorities in March.\n\"Today has been a very special day because I have seen my family for the first time in more than 160 days,\" he said in a statement on Friday.\n\"I'd like to thank all the people who have supported me because after this long time I have witnessed that so many people have been by my side with such positivity,\" he added. \"Today I am grateful to God because He has heard me and today I am out. We are steps closer to justice, but justice has not been fully served.\"\nSean Hecker, another one of Abrego’s attorneys, said in a court filing on Saturday that the Trump administration offered Abrego a plea deal earlier this week to deport him to Costa Rica.\nHecker wrote that if Abrego agreed to pause his release from federal custody until Monday, and plead guilty to both counts of the criminal indictment against him in Tennessee, “then the government would promise to deport Mr. Abrego to Costa Rica after serving any sentence imposed by the Court.”\nThe court filing contains correspondence from the Trump administration and Costa Rican government, showing that the Costa Rican government said it would not detain Abrego upon his arrival to the country.\n“There can be only one interpretation of these events: the DOJ, DHS, and ICE are using their collective powers to force Mr. Abrego to choose between a guilty plea followed by relative safety, or rendition to Uganda, where his safety and liberty would be under threat,” Hecker wrote.\nSandoval-Moshenberg appeared to suggest that deportation to Costa Rica might be favorable for his client.\n\"That’s a pretty reasonable option, right? I mean, Costa Rica makes sense,\" he said. \"It’s a Spanish speaking country. It’s proximate to the United States. His family can visit him there easily.\"\nThe White House continued to berate Abrego on Friday, accusing him of being a violent gang member.\n\"He will face justice for his crimes. It’s an insult to his victims that this left-wing magistrate intervened to put him back on the streets,\" White House spokesperson Abigail Jackson said in a statement. \"Garcia will be subject to ankle monitoring to ensure the safety of the American public until further action can be taken.\"\nDepartment of Homeland Security Secretary Kristi Noem called Abrego's release \"a new low.\"\n\"By ordering this monster loose on America’s streets, this judge has shown a complete disregard for the safety of the American people,\" she wrote on X. \"We will not stop fighting till this Salvadoran man faces justice and is OUT of our country.\"\nAbrego's lawyers have now notified the judge in the Middle District of Tennessee that ICE has informed Abrego of its intent to deport him to Uganda. Abrego could not face the criminal charges of human smuggling brought against him by Department of Justice in that case if he is out of the country.\nHis trial is set for January."
    },
    {
      "url": "https://www.nbcnews.com/politics/jd-vance/vance-optimism-energetic-diplomacy-will-end-war-ukraine-rcna226606",
      "text": "Vice President JD Vance remains confident the U.S. can broker an end to the war between Russia and Ukraine despite potential hang-ups that have emerged since President Donald Trump’s meeting this month with Russian President Vladimir Putin.\n“We believe we’ve already seen some significant concessions from both sides, just in the last few weeks,” Vance said in an exclusive interview on NBC News’ “Meet the Press.”\nVance also weighed in on a Russian missile strike in western Ukraine overnight Thursday that hit an electronics factory owned by a U.S.-based company. Asked by moderator Kristen Welker if he was “enraged” by the strike, which the company said injured several workers, Vance pivoted to a criticism of former President Joe Biden.\n“I don’t like it,” Vance said of the assault. “But this is a war, and this is why we want to stop the killing. The Russians have done a lot of things that we don’t like. A lot of civilians have died. We’ve condemned that stuff from the get-go and, frankly, President Trump has done more to apply pressure and to apply economic leverage to the Russians, certainly, than Joe Biden did for 3 ½ years, when he did nothing but talk, did nothing to bring the killing to a stop. So you asked me what I’m enraged by? What I’m enraged by is the continuation of the war.”\nTrump told reporters Friday that he was not happy about the strikes on western Ukraine and indicated that any peace deal between the countries could be weeks away.\n“I think over the next two weeks, we’re going to find out which way it’s going to go,” Trump said.\nDuring his interview with “Meet the Press,” Vance did not characterize the strike, and a number of other issues, as long-term hindrances to peace, saying there was still plenty of room for negotiation.\n“We’re going to eventually be successful, or we’ll hit a brick wall. And if we hit a brick wall, then we’re going to continue this process of negotiation, of applying leverage,” Vance added. “This is the energetic diplomacy that’s going to bring this war to a close.”\nWelker then asked Vance what the pressure is on Russia if the U.S. is not “imposing new sanctions.”\n“How do you get them to a place of getting to the table with Zelenskyy and stopping to drop bombs?” she asked.\nVance replied by saying Trump has applied “aggressive economic leverage,” such as “secondary tariffs on India, to try to make it harder for the Russians to get rich from their oil economy.”\nAsked by Welker if he could guarantee that the U.S. would not send troops to help enforce any peace deal, Vance reaffirmed Trump’s opposition to such a deployment.\n“The president has been very clear,” Vance said. “There are not going to be boots on the ground in Ukraine. But we are going to continue to play an active role in trying to ensure that the Ukrainians have the security guarantees and the confidence they need to stop the war on their end and the Russians feel like they can bring the war to a conclusion on their end.”\nThe interview, which aired Sunday, comes amid new, heightened tensions in the effort to end the war.\nOn Friday, Russia’s top diplomat told NBC News that no meetings between Putin and Ukrainian President Volodymyr Zelenskyy had been scheduled, raising further doubts about Trump’s ability to mediate the conflict.\nMeanwhile, details about security guarantees for Ukraine — and Russia’s role in shaping them — remain unresolved.\nIn the interview, Vance said he doesn’t believe the Russians are stringing Trump along.\n“I think the Russians have made significant concessions to President Trump for the first time in 3 ½ years of this conflict,” he added. “They’ve actually been willing to be flexible on some of their core demands. They’ve talked about what would be necessary to end the war.”\nTrump, Vance added, stepped up efforts to negotiate a diplomatic solution “because this war is not in anyone’s interest. It’s not in Europe or the United States’ interest.”\nWhile acknowledging some of the hurdles that have popped up since Trump’s Aug. 15 meeting with Putin in Alaska, Vance expressed optimism that persistence would deliver results.\n“There are hills and valleys to the negotiations,” Vance said. “We sometimes feel like we’ve made great progress with the Russians, and sometimes, as the president has said, he’s been very frustrated with the Russians. We’re going to keep on doing what we have to do to bring this thing to a close. I don’t think it’s going to happen overnight. I think that we’re going to continue to make progress. But, ultimately, whether the killing stops, that determination is going to belong to whether the Russians and Ukrainians can actually find some middle ground here.”\nPutin has rejected calls — including from Trump before their recent meeting — for a ceasefire.\n“I didn’t say they conceded on everything,” Vance said in the interview, referring to Russia. “But what they have conceded is the recognition that Ukraine will have territorial integrity after the war. They’ve recognized that they’re not going to be able to install a puppet regime in Kyiv. … Have they made every concession? Of course they haven’t. Should they have started the war? Of course they [shouldn’t have], but we’re making progress.”\nAsked about disagreements surrounding how involved Russia will be in establishing security guarantees for Ukraine, Vance asserted that “there’s a little bit of talking past each other here.”\n“First of all, we’re not talking about security guarantees until after the war has come to a close,” Vance said. “And, of course, the Russians are going to be a part of the conversation about bringing that war to a close. So, of course, they’re going to have some stake in this.”\nThe interview with Vance also touched on several domestic issues, including new congressional maps passed by the Republican-controlled Texas House of Representatives that could pad the GOP’s majority by as many as five seats. The issue has become a political flashpoint, with California Democrats preparing retaliatory moves and other states aiming to redraw maps, too.\n“All we’re doing, frankly, is trying to make the situation a little bit more fair on a national scale,” Vance said of GOP efforts. “The Democrats have gerrymandered their states really aggressively. We think there are opportunities to push back against that, and that’s really all we’re doing.”\nOn the subject of his own political ambitions, Vance again sidestepped questions about whether he sees himself as Trump’s heir apparent in 2028, when the president is term-limited.\n“I see myself as a vice president who’s trying to do a good job for the American people ... and if I do a good job, and if the president continues to be successful, as I know that he will be, the politics will take care of itself,” Vance said. “We can cross that bridge when we come to it.”\nWelker asked if Vance has discussed the possibility with Trump.\n“As you know, the president talks about everything, and if it’s in the news, the president and I have certainly discussed it,” Vance replied. “But I think the president is just focused on doing a good job for the American people. He wants me to be focused on doing a good job for the American people. That’s what I’ll keep on doing.”"
    },
    {
      "url": "https://www.nbcnews.com/politics/white-house/trump-threatens-military-baltimore-crime-key-bridge-funding-chicago-rcna226846",
      "text": "President Donald Trump on Sunday threatened to send the military into Baltimore to “quickly clean up” crime.\n“But if Wes Moore needs help, like Gavin Newscum did in L.A., I will send in the ‘troops,’ which is being done in nearby DC, and quickly clean up the Crime,” Trump said in a post on Truth Social, referring to the Democratic governors of Maryland and California and using a derogatory nickname for Gavin Newsom.\nTrump’s comments are the latest in a line of threats to replicate the D.C. deployment in cities across the country after hundreds of National Guard troops were brought to D.C. in what he’s described as an effort to fight crime, though critics have painted the move as an overreach for political purposes.\nReached for comment, Moore said in a statement that Trump “would rather attack his country’s largest cities from behind a desk than walk the streets with the people he represents.”\n“The President should join us in Baltimore because the blissful ignorance, tropes, and the 1980s scare tactics benefit no one,” Moore continued. “We need leaders who are there helping the people who are actually on the ground doing the work.”\nTrump’s push to deploy National Guard troops to cities like D.C. is a significant departure from how presidents typically deploy the Guard, which is usually used to respond to situations like natural disasters and civil unrest.\nThe president first deployed thousands of National Guard troops and Marines to Los Angeles in June amid protests against immigration enforcement actions. Newsom vehemently opposed the move, accusing Trump of “hoping for chaos so he can justify more crackdowns, more fear, more control.”\nTrump deployed the National Guard to D.C. this month as part of a stated effort to fight crime, though at the time of his announcement, violent crime had decreased 26% compared to last year, according to D.C. police data.\nNBC News reported last week that Defense Secretary Pete Hegseth signed an order authorizing about 2,000 National Guard troops in D.C. to carry weapons. Law enforcement agents have arrested hundreds of people in D.C. since Aug. 7, according to a White House official.\nMaryland’s Moore said Friday that “many of the comments that are being made from the White House come off as so, so tone deaf and so ignorant” about fighting crime.\n“It’s because they have not walked our streets,” he said on CNN on Friday. “They have not been in our communities, and they’re more than happy of just making these repeated tropes about us, but not actually working with us to be able to make sure that our streets are safe and that people can have a real opportunity to feel safe in their own neighborhoods.”\nTrump criticized Moore’s remarks in his Sunday Truth Social post, saying he assumed that Moore “is talking about out of control, crime ridden, Baltimore.”\n“As President, I would much prefer that he clean up this Crime disaster before I go there for a ‘walk,’” Trump added.\nHomicides in Baltimore have decreased by more than 24% this year compared to the same period last year, Baltimore Mayor Brandon Scott said this month. His office has also said that nonfatal shootings have declined 18% this year.\nMoore said this month on CNN that Trump was using the military as a “tool” for political purposes.\n“I take very seriously about how, when and why I deploy members of our National Guard in cases of emergency and in true crises,” he said in the interview. “And I will not authorize the usage of Maryland National Guard forces for missions that I do not deem to be either mission critical or mission aligned.”\nThe president on Sunday also threatened to pull federal funding for the replacement of the Francis Scott Key Bridge, which collapsed in 2024. The federal government had previously agreed to pay for the bridge’s replacement.\n“I gave Wes Moore a lot of money to fix his demolished bridge,” Trump wrote. “I will now have to rethink that decision???”\nMoore slammed Trump’s message, saying in a statement that “any threats to this funding will cause irrevocable damage to the national economy and to the entire State of Maryland.”\n“We have already begun rebuilding, and now that Maryland is showing great progress, our President is threatening to intentionally harm Maryland,” he continued.\nSen. Chris Van Hollen, D-Md., slammed Trump's comments, saying the president's \"desire to play dictator with our military on American soil should be alarming to everyone, as should his unlawful threats to claw back federal funding that Congress explicitly approved.\"\nHe added that \"we have made important strides in public safety,\" and though \"there’s more we can do together, Trump’s threats to invade our cities are not the answer.\"\nSen. Angela Alsobrooks, D-Md., also responded to Trump's threats Sunday afternoon, saying that her focus and that of \"Team Maryland\" will be to continue their work for the state.\n\"Trump is now threatening to extend his drastic overreach by using the U.S. military against Americans — we are not interested in his distractions away from his disastrous policies that have cut health care, raised the cost of insurance, and the cost of living for all of us,\" Alsobrooks said in a statement.\nSeparately, Rep. Johnny Olszewski, D-Md., said in a statement responding to Trump's post that “Baltimore is making real progress, but sustaining our momentum requires collaboration at all levels of government.”\n“President Trump’s threats to deploy troops to American cities and cancel funding approved by Congress are illegal, unhelpful and directly at odds to that progress,” added Olszewski, who represents parts of Baltimore.\nIn recent days, Trump has also threatened to deploy the National Guard to other cities. He praised the National Guard’s work on Friday, going on to say, “I think Chicago will be our next, and then we’ll help with New York.”\nIllinois Gov. JB Pritzker hit back on Saturday, accusing Trump in a post to X of “attempting to manufacture a crisis, politicize Americans who serve in uniform, and continue abusing his power to distract from the pain he’s causing families.”"
    },
    {
      "url": "https://www.nbcnews.com/sports/soccer/manchester-united-soccer-fan-haircut-english-premier-league-rcna224398",
      "text": "Frank Ilett made a choice as a kid that would eventually haunt him.\nRather than support Liverpool, his mother’s favorite soccer club, he aligned his fandom with Manchester United, the team of his grandfather, uncle and cousin. The decision has recently led to anguish, frustration — and more than a year without a haircut.\nUnlike Liverpool, which cruised to the English Premier League title last season, Manchester United struggled from the get-go. By early October it sat in 14th place, its worst start since 1989.\nHoping to lighten the mood of a fan base in the doldrums, Ilett announced on social media he would not cut his hair until the club won five matches in a row. Unfortunately for the 29-year-old (and his hairdresser, used to consistent appointments), the team never accomplished that feat. In fact, it never won more than three consecutive games.\n“I thought that’d be funny,” Ilett, who runs \"The United Strand\" on social media, told NBC News of the bet. “A nice funny challenge to make people laugh, and then it’ll be all over. But it kept going.”\nFor 323 days, as of late August. And with no signs of stopping anytime soon.\nManchester United opened the season with a 1-0 home defeat to Arsenal last weekend, taking Ilett and his bet back to square one. A trim could be possible soon. United’s upcoming schedule features a run of smaller clubs, starting with Fulham on Sunday followed by Grimsby Town and Burnley. But perennial power and rival Manchester City awaits on the road before a home clash with Chelsea.\nThere’s a high likelihood, barring upset victories, Ilett will be sporting a dark, thick shock of hair well into the fall. He says his girlfriend doesn’t mind.\n“She likes the king’s guard look,” he joked.\nIlett says the wager largely stemmed from boredom. He moved from outside Oxford, England, to Castellón, Spain, in November 2023 to be closer to his girlfriend’s family and raise their 14-month-old daughter. Without any family or friends nearby and in between jobs, he entertained himself by watching Manchester United games.\nBut on Oct. 6, following four straight winless matches, he decided something needed to be done. Something that really spoke to the soccer gods and helped get the club back in a positive light.\nSo Ilett buzzed his hair and hit “post” on Instagram.\n“Day 1 of not cutting my hair until Man United win five games in a row,” he said in the video. “Aston Villa today. I’m not feeling that confident.”\nThe team drew 0-0 that day and the rest is history.\nThe rules of the challenge were simple: be victorious in five competitive matches in a row. That meant any Premier League, Europa League or domestic cup game counted, while friendlies and exhibitions did not.\nOver the first 10 days of the challenge, he said, he noticed “a few people were interested.” It slowly started to build to 2,000, then 10,000 and then a month later 50,000. As of Aug. 20, “The United Strand” has 227,000 followers.\n“I didn’t expect it to go on for this long. I thought it would be a few months,” he said. “A funny little thing to do. Make some Man United fans laugh in a tough time, and then that would be it, it would be all over. We’d be back to normal, back to winning ways. But it hasn’t quite worked out like that.”\nSome of his followers are Manchester United fans who are supporting him during this trying time. Others, he said, are opposing fans rooting for losses to keep the hair growing.\n“On the whole, I’ve been really pleased. It has been very positive. Everyone’s been very nice, very supportive, and everyone’s kind of behind me, I suppose, rooting for me,” he said. “There’s even a lot of rival fans. I’ve had a few Liverpool fans say, ‘You’re the only Man United fan that I like.’ And I think that’s the biggest compliment that you could ever get.”\nIlett’s videos are typically less than 10 seconds long and simply state the challenge rules with the current day number. The real fun, however, is how he wears his hair. It’s become so long he’s now taking requests on how to showcase it.\nSome days it’ll be poofy while others it’ll be curly or straight. Some days he’ll dunk it in a pool or put it up in colorful hair ties. The newest request is pulling items out of his mane — a recent video has him playing with multiple fidget spinners.\nIlett says while he’s enjoying his newfound fame, he’s ready for it to be over. Though there’s a very small chance he never cuts his hair again, he sees the challenge ending this year.\n“I am genuinely optimistic that it will happen this season,” he said. “Now, if you ask me in a year’s time, if it hasn’t happened, then maybe I might not be smiling as much. I’m quite positive, quite optimistic that we’re going to have a good season this season, and at some point those five wins are going to come together.”\nWhen his hair is cut, he intends on donating his locks to Little Princess Trust, a U.K.-based charity that makes wigs for people diagnosed with cancer.\nEven more incentive for the bet to be completed.\n“I feel like I’ve come this far now,” he said. “I have to see it through to the end, however long that might take.”\nThough Manchester United has won England’s top division 20 times, tied with Liverpool for most in history, the last United championship came in 2013. The team made moves this offseason it believes will get it back into contention. After loaning Marcus Rashford to Barcelona, the club brought in forwards Matheus Cunha from Wolves and Bryan Mbeumo from Brentford. Its latest addition may be the most crucial: striker Benjamin Šeško from RB Salzburg, considered among the top young scoring talents in the world.\nNBC Sports’ Joe Prince-Wright said manager Ruben Amorim knows “a top-six finish and a strong cup run is the very least United need to achieve this season if they’re going to show people they’re back on the right path.”\n“United has been going through this rebuild for most of the last decade, but it still feels very similar to the New England Patriots’ current painful rebuild after the glory days of Bill Belichick and Tom Brady,” Prince-Wright said. “But there’s hope that United can be competitive, and if they can stay solid defensively, they now have the right combination of players, and characters, in attack to win games.”\nHopefully five of them in a row, for Ilett’s sake.\nHe said if the team wins four, he would love to possibly experience the final win in person at Old Trafford.\n“It’s going to be like the Champions League final for me. It’s going to be crazy,” he said. “If we got to four wins in a row, and I went to the fifth game and I was watching it and we didn’t win, I think it would be the most heartbreaking moment of my entire life.”"
    }
  ],
  "argos_summary": "Vice President JD Vance remains optimistic about ending the Ukraine war, citing recent concessions, while Russia’s Lavrov dampens hopes, noting Ukraine’s reluctance. The Justice Department released Ghislaine Maxwell transcripts, sparking criticism from Epstein accuser families and Senator Schiff. Texas passed GOP‑favored congressional maps, prompting Democratic legal challenges. Additional stories cover postal duty changes, Home Depot immigration enforcement, and other unrelated news.",
  "argos_id": "YC7NF10OV"
}