{
  "url": "https://nypost.com/2025/08/25/sports/novak-djokovic-shakes-off-rust-for-sloppy-win-to-start-us-open/",
  "authorsByline": "Zach Braziller",
  "articleId": "aed8398aa20e4906a183bb5cd7a54d13",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-l3jxepvyg-1756098632414.jpg?quality=75&strip=all&1756084270&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T05:17:46+00:00",
  "addDate": "2025-08-25T05:21:02.799132+00:00",
  "refreshDate": "2025-08-25T05:21:02.799135+00:00",
  "score": 1.0,
  "title": "Novak Djokovic shakes off rust for sloppy win to start US Open after nearly six-week break",
  "description": "It has been roughly six weeks since Novak Djokovic played a competitive singles match.",
  "content": "It has been roughly six weeks since Novak Djokovic played a competitive singles match.\n\nRather than take part in warmup hard-court events ahead of the U.S. Open, the 24-time major champion gave himself a breather, using the break to spend time with family and prepare for the final grand slam of 2025.\n\nHe looked like someone with some rust, struggling at times against unranked American teenager Learner Tien in a 6-1, 7-6 (3), 6-2 victory at Arthur Ashe Stadium on Sunday night.\n\nHe committed four double-faults and 34 unforced errors, miscues that could hurt him against a better opponent.\n\n“I really was surprised how bad I was feeling in the second [set] physically,” said the seventh-seeded Djokovic, who was treated for a blister on his big toe early in the third set. “Yeah, we had long exchanges, but also, I kind of dropped my level and made a lot of unforced errors and kind of got him back into the match. I’m glad that I kind of reset myself after [the] second set. And the third one was — the third set was OK to finish up the match.\n\n“There are positives but also things that hopefully won’t happen in terms of, like, how I feel on the court physically, the way I felt in the second set. Hopefully, that doesn’t happen because then it makes my life on the court definitely much more challenging.”\n\nNot at his best, Djokovic still did enough to advance without much drama.\n\nIt took him just 24 minutes to wrap up the first set, then Tien and his big groundstrokes gave Djokovic plenty of problems in the second.\n\nDjokovic needed to fight off four break points to stay in the set, eventually finding a way in the tiebreak after initially trailing by a mini-break.\n\nThe third set was like the first, quick and mostly easy, the former world’s No. 1 wearing down his young opponent.\n\n“It was a strange kind of match. The first set was 20 minutes, and then the second one was one hour and 20, so quite the opposite sets we played,” Djokovic said in his on-court interview after improving to 19-0 in the first round in Flushing. “It was key for me to hold my nerves in the second set and clinch it in a tie-break. After that, I started feeling better. I can always do better, but it’s a great way to start this year’s campaign.”\n\nPrior to the start of the U.S. Open, Djokovic said his plan moving forward is just to play in the four majors because those tournaments are what motivate him and give him joy at the age of 38.\n\nIt remains to be seen if his time off ahead of this tournament will help him get back on top, and win his first major since claiming his fourth U.S. Open crown in 2023.",
  "medium": "Article",
  "links": [
    "https://nypost.com/sports-plus/",
    "https://nypost.com/2025/08/24/sports/emma-raducanu-clears-hurdle-with-first-us-open-win-since-2021-title/",
    "https://nypost.com/2025/08/24/sports/venus-williams-thrilled-to-extend-her-own-record-at-us-open/",
    "https://nypost.com/2025/08/25/sports/daniil-medvedev-loses-it-on-umpire-after-cameraman-sparks-us-open-delay/",
    "https://nypost.com/2025/08/24/sports/us-open-the-perfect-place-to-overthrow-tennis-newest-kings/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Novak Djokovic",
      "weight": 0.0864961
    },
    {
      "name": "Djokovic",
      "weight": 0.083051786
    },
    {
      "name": "U.S. Open",
      "weight": 0.07809761
    },
    {
      "name": "second",
      "weight": 0.070966005
    },
    {
      "name": "time",
      "weight": 0.06994696
    },
    {
      "name": "times",
      "weight": 0.06994696
    },
    {
      "name": "unforced errors",
      "weight": 0.06880961
    },
    {
      "name": "US Open",
      "weight": 0.068217
    },
    {
      "name": "unranked American teenager Learner Tien",
      "weight": 0.067734756
    },
    {
      "name": "first",
      "weight": 0.06673954
    }
  ],
  "topics": [
    {
      "name": "Tennis"
    },
    {
      "name": "Sports Figures"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9912109375
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.8828125
    },
    {
      "name": "/Sports/Individual Sports/Racquet Sports",
      "score": 0.59375
    }
  ],
  "sentiment": {
    "positive": 0.099701084,
    "negative": 0.5706668,
    "neutral": 0.32963216
  },
  "summary": "Novak Djokovic returned to competitive tennis after a six-week hiatus after nearly six weeks of absence from competitive matches. Despite struggling at times, he managed to secure a 6-1, 7-6 (3), 6-2 victory over unranked American teenager Learner Tien in the first round of the US Open. Despite committing 34 unforced errors and committing four double-faults in the match, the Serbian star managed to advance without much drama. Despite his struggles, Djokov remains confident about his ability to win his first major since claiming his fourth U.S. Open crown in 2023. He plans to continue playing in the four major tournaments he believes will motivate him and give him joy at age 38.",
  "shortSummary": "Novak Djokovic returned from a six-week break with a sloppy 6-1 win over Learner Tien in the first round of the US Open.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5548a76caeb84bea9d920d8017836508",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/24/sports/emma-raducanu-clears-hurdle-with-first-us-open-win-since-2021-title/",
      "text": "Emma Raducanu’s smile is back.\nSo is her game.\nThe young Brit broke her three-year U.S. Open drought, winning her first match in Flushing Meadows since the breakthrough 2021 title that changed her life.\nRadacanu rolled past qualifier Ena Shibahara 6-1, 6-2 at Louis Armstrong Stadium with a 26-minute first set and a brisk one-hour domination.\nShe’s cleared a huge mental hurdle, making New York her happy place for the first time in years.\n“Yeah, it has been on my mind,” said Radacanu, 22. “It’s been four years, and it’s a very special tournament for me. I did feel different coming into it this year. I felt like I was doing the right things day to day, but still, it’s in the back of your head. So I’m just very pleased to have overcome that.\n“It’s my first win here since 2021, so it’s extra special. First rounds are always difficult and especially at a Slam. I’m just so happy with the way I came through that.”\nRadacanu won the 2021 U.S. Open as an 18-year-old qualifier, dazzling with not just her game but her megawatt smile.\nBut after her title defense ended with a first-round loss to Alize Cornet — making her just the fourth reigning U.S. Open champ ousted in the opening round — she missed 2023 due to injury and suffered another first-round exit last year to Sofia Kenin.\nShe acknowledged New York had become a mental hurdle.\n“I really struggled when I came back in 2022. I didn’t enjoy coming back here,” Radacanu said. “Now is the first time that I feel like I can come back to the U.S. Open and really enjoy the memories that I made here. I can be proud of that and see it as a happy place.”\nRadacanu looked happy on the court Sunday, serving well and taking an aggressive return position.\nShe seemed confident, self-assured and in control.\nShe also seemed comfortable with her new coach, Francisco Roig.\nRafa Nadal’s ex-coach, the Spaniard constantly gave loud positive reinforcement.\n“I put a lot of trust in what I’m doing with Francisco on the practice court,” Radacanu said. “We’re just working really well, doing the right stuff on the practice court, and I just feel like I’m improving. To take confidence from what I’m doing behind the scenes and not just have confidence because I’ve won these matches on the tour.\n“I’m doing a lot day to day. It’s going well, and I’m enjoying it. I’m enjoying getting better, and the process of feeling like, at the end of the day, I’m satisfied I got a little bit better and just repeating it. That’s probably the biggest success and reason why I feel the way I do right now.”\nDespite being nervous beforehand, starting quickly helped Radacanu settle in.\nShe ended up with an encouragingly clean match, just six unforced errors — one in the second set — to 36 by her outmatched Japanese foe.\nRaducanu raced out to a quick 5-0 lead and cruised.\n“I started off really well, and that helped relax me a lot,” she said. “Especially serving first game, that was a confident start, and then I felt like I could keep going.”\nNow, Raducanu has a chance to keep going.\nShe’s provisionally up to world No. 33 in the live rankings after the win and well-placed to crack the top 30.\nWith No. 24 Veronika Kudermetova getting upset by Janice Tjen, Raducanu gets to face another qualifier.\nWith an extra day baked into the first round this year, she’ll get some free time in New York, now a happy place again.\n“My nana — it’s not my actual grandma, but I’m like her adopted granddaughter, I’d like to think — she’s from New York, and she told me to go to the Frick Collection,” Raducanu said. “I’ve been into my art a lot more recently, and it’s reopened after I think four or five years of being under construction. That will be really exciting.”"
    },
    {
      "url": "https://nypost.com/2025/08/24/sports/us-open-the-perfect-place-to-overthrow-tennis-newest-kings/",
      "text": "“It has been 86 Grand Slam tournaments,” the elderly Rose DeWitt Bukater said wistfully, “since an American man has won a major singles championship.”\nThere were the decades through which the Yankees owned Major League Baseball. There has been NFL domination by the Patriots and Chiefs over much of the past two decades. The Canadiens, Islanders and Oilers had deeds to the Stanley Cup for the better part of 20 years. First, the Celtics, then the Bulls and Lakers were lords of the NBA.\nBut there has never been a sport ruled by hegemony like the men’s side of tennis since the 2003 U.S. Open, when Andy Roddick became the last American man to win a Grand Slam. A pro sport or pro sport league has never been more dynastic.\nFor while there have been 86 majors since Roddick’s triumph, just 13 different champions have emerged, The Big Three of Novak Djokovic (24), Rafael Nadal (22) and Roger Federer (19) combining for 65 of them with Carlos Alcaraz (5) and Jannik Sinner combining for nine tiles and indeed all seven Slams over the past two calendar years."
    },
    {
      "url": "https://nypost.com/2025/08/24/sports/venus-williams-thrilled-to-extend-her-own-record-at-us-open/",
      "text": "Venus Williams says playing in the U.S. Open again isn’t old — it’s exciting.\nThe icon may as well have been talking about herself.\n“Super thrilling to be back,” Williams said. “It does not get old. It just gets more exciting.”\nWhen Williams takes on 11th-ranked Karolina Muchova on Monday night in Arthur Ashe Stadium, it will be her record-extending 25th appearance in the U.S. Open.\nIt comes at the ripe age of 45, making her the oldest player to compete in singles at the U.S. Open since 47-year-old Renée Richards set the record in 1981.\n“I love my job,” Williams said. “So there’s the joy right there.”\nWhile Williams is one of the all-time greats, with seven Grand Slam singles titles, including in 2000 and 2001 here in Flushing Meadows, this was an unexpected comeback.\nShe got a wild-card entry after being ranked 610th in the world.\nIt comes following a 16-month layoff from tennis that included surgery for uterine fibroids.\nShe had just returned last month at the Washington Open.\n“I want to be my best, and that’s the expectation I have for myself, to get the best out of me. That’s all any player can ask for,” Williams said. “I haven’t played as much as the other players, so it’s a different challenge when you’re dealing with that. So I’m just trying to have fun, stay relaxed and be my personal best.”\nMonday’s appearance comes 28 years after Williams’ 1997 debut at the U.S. Open, and she doesn’t plan to stop swinging a racket anytime soon.\n“I think I’ll always play tennis. It’s in my DNA. So it doesn’t matter if it’s now or 30 years from now,” Williams said. “God willing, I’ll be here. We’ll all be here. We’ll all be hitting balls. But in any case, tennis will always be one of the most important parts of my life.”\nJanice Tjen upset No. 24 Veronika Kudermetova 6-4, 4-6, 6-4 in her opener.\nIt made her the first Indonesian to advance here since 2003.\n“Yeah, it means a lot. I feel proud to be able to do this for my country. Hopefully, this — by me making [an] appearance here — will help, will inspire more tennis players, younger kids to play tennis, and also believing that they can be here, too,” said Tjen, who came to the sport by chance.\n“I started playing tennis because of my good friend. She’s also on tour. Her name is Priska Madelyn Nugroho. …She [was] like, ‘Oh, do you want to try playing tennis?’ My parents [were] like, ‘Yeah, just go play the sport.’ Just having exercise so I’m not going to be in my room just doing nothing.”\nTjen, who played at Pepperdine, won 30 points at the net and earned a second-round date against 2021 champ Emma Raducanu.\nTaylor Fritz beat Emilio Nava 7-5, 6-2, 6-3 and has won 22 of his past 27 matches since the end of the French Open, the most wins of any man on tour over that span.\nHe’ll have two days off before playing Sebastian Baez or Lloyd Harris.\nNo. 6 Ben Shelton ripped Ignacio Buse 6-3, 6-2, 6-4 and faces either Pablo Carreno Busta or Pablo Llamas Ruiz.\nShelton — an entertainer whose celebrations seemingly vexed Novak Djokovic — was asked if he’d like to see tennis ease up on the stoic decorum and etiquette, citing the attention the Noah Lyles-Kenny Bednarek beef in track and field has drawn.\n“Yeah, I understand respecting your opponents and the traditions of tennis. At the same time, people get called out for little things or the wrong things that it’s, like, really? We’re going to give someone a hard time about that?” Shelton said. “Having a younger crowd in tennis is really important in attracting younger fans, the future fans of our sport. The kids love the flair and excitement and competition, and Bednarek shoving Lyles and them talking about it in the press conference afterwards, it’s exciting.\n“Now when they go to Tokyo for the World Championships, something’s on the line and everyone’s tuning in. That’s sports.”"
    },
    {
      "url": "https://nypost.com/sports-plus/",
      "text": "Breaking News\nSports Plus\ninside the liberty\nWhat the roller-coaster Liberty need to address before beginning their true title defense\nThe Liberty are in the final push of the regular season, and with only 1 ½ games separating the No. 2 and 5 seeds, the playoff picture remains murky.\nbeyond the back page\nWhy Yankees-Red Sox has a chance to reclaim its rightful place in our favorite rivalries\nStill, while the somewhat equal recent fortunes of both franchises will make it difficult to replicate the electric energy that once fed the city, there is an opportunity this weekend to feel a similar jolt again.\ninside the mets\nNolan McLean dreams of the next great homegrown Mets rotation, too\nThough it was clear there was competition for the first promotion, that didn’t affect the friendship of two of the Mets’ most prized pitching prospects.\nPlay ball! The story of the iconic Wiffle Ball and the family-run factory where it’s still made to this day\nThey are timeless, resilient, perforated, polyethylene-coated Americana, at home in a Norman Rockwell painting or the front lawn of a frat house."
    },
    {
      "url": "https://nypost.com/2025/08/25/sports/daniil-medvedev-loses-it-on-umpire-after-cameraman-sparks-us-open-delay/",
      "text": "A wild scene unfolded at the US Open when a photographer entered the court during the match between Daniil Medvedev and Benjamin Bonzi, leading to chaos and a nearly seven-minute delay in the match as Medvedev let his emotions get the better of him.\nWith Bonzi serving for the match — leading 6-3, 7-5, 5-4 — a photographer entered the playing surface for an unknown reason, leading chair umpire Greg Allensworth to call for time on the court at Louis Armstrong Stadium.\n“Wait please, not now,” Allensworth shouted. “Get off the court, please.”\n“First serve. Ladies and gentlemen, because of the delay caused by an onside interference, first serve has been granted,” Allensworth then called.\nThe decision infuriated Medvedev and went over to confront the chair ump, encouraging the crowd to boo the decision before crashing out on the official and questioning what was wrong.\n“Are you a man? Are you a man? Why are you shaking? What’s wrong, huh? Guys, he wants to leave. He gets paid by the match not by the hour,” the 13th-seeded Medvedev said into the camera that was positioned right next to the chair umpire.\nThe crowd continued to boo for another five minutes, with the unseeded Bonzi refusing to serve until the amped up Queens crowd quieted down.\nThey also chanted “Second serve!”\nMedvedev managed to fend off match point once play continued and rallied back to send it to a fifth set, but Bonzi prevailed and earned the upset with a 6-3, 7-5, 6-7 (5), 0-6, 6-4 victory."
    }
  ],
  "argos_summary": "Novak Djokovic returned to the U.S. Open after a six‑week break, winning a hard‑fought match against Learner Tien despite physical discomfort and a blister, signalling his intent to focus on the four majors. 22‑year‑old Emma Raducanu broke her four‑year first‑round drought with a decisive win over Ena Shibahara, marking a mental breakthrough and a return to the top 30. 45‑year‑old Venus Williams made a surprise comeback as the oldest singles competitor in the tournament’s history, while Indonesian Janice Tjen upset No. 24 Veronika Kudermetova, becoming the first Indonesian to reach the second round since 2003.  The early rounds also featured notable performances from Taylor Fritz, Ben Shelton, and a chaotic incident involving a photographer during Medvedev’s match, underscoring the drama and unpredictability of the event.",
  "argos_id": "YPXHXOXT1"
}