{
  "url": "https://www.bloomberg.com/news/videos/2025-08-20/bloomberg-brief-8-20-2025-video?srnd=phx-markets",
  "authorsByline": "bn",
  "articleId": "b0382914e6454645b4c2d60911c6cabe",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iWUI4Uem3pt4/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-20T10:46:32.912000+00:00",
  "addDate": "2025-08-20T11:42:55.761228+00:00",
  "refreshDate": "2025-08-20T11:42:55.761233+00:00",
  "score": 1.0,
  "title": "Bessent Satisfied with US-China Tariff Setup; Retail Earnings on Deck",
  "description": "US equity futures remain lower amid signs of easing from Tuesday's tech selloff, with Nvidia poised to rebound from its slump. Treasury Secretary Scott Bessent says the US is satisfied with the current trade arrangement with China. Retail earnings continue with Lowe's, Target and TJX. Andrew Balls of PIMCO sees a potential for the Fed to cut rates lower than the market is pricing in. Cayla Seder of State Street thinks more concentration in tech stocks will be expected without more rate cuts. “Bloomberg Brief” delivers the market news, data and analysis you need to set your agenda. (Source: Bloomberg)",
  "content": "DANI: 5:00 A.M. IN NEW YORK CITY. A TECH SELL OF LEAKS INTO GLOBAL MARKETS AFTER NVIDIA'S WORST DECLINE IN PERFORMANCE. TREASURY SECRETARY BESSENT SAYS THE TARIFF SET UP WITH CHINA IS WORKING PRETTY WELL. A HOUSE DIVIDED. JULY'S FED MINUTES ARE ON DECK WITH INSIGHT INTO THE DISSENTING DOVES. IT WAS A ROTATION OUT OF MOMENTUM YESTERDAY. MOMENTUM DID REALLY POORLY. WE HAD ONE OF THE BIGGEST SELLOFFS FOR NVIDIA IN SOME TIME. IT'S DOWN ABOUT HALF OF 1%. THE S & P IS DOWN AND THE NASDAQ IS DOWN .2%. THAT IS WHAT HAPPENS WHEN ONE OF THE BIGGEST WEIGHTINGS SELLS OFF. IT DOESN'T MATTER THAT INTEL OR HOME DEPOT HAD A GOOD DAY. FOR THIS BOND MARKET WE RALLY BREAKING A THREE-DAY LOSING STREAK. WE TAKE A BREATHER FROM THAT. A LITTLE CHANGED ON THE BOND MARKET, THE 10-YEAR YIELD AT 43 03. > > NVIDIA IS NO LONGER IN THE RED, IT IS TRADING FLAT. MAYBE THE TECH SLIDE HAS DONE ITS WORK FOR NOW. MAYBE THAT'S THE BULLISH WAY TO LOOK AT IT. SOME PEOPLE HAVE BEEN POINTING FINGERS AT THE M.I.T. REPORT THAT SHOWED THAT 95% OF GENERATIVE AI PILOT PROGRAMS USED BY CORPORATIONS ARE FAILING TO GENERATE REVENUE. SOME MAY BE SAYING THAT CAUSED A BIT OF WEAKNESS ACROSS THE TECH NAMES BUT NVIDIA IS TRADING FLAT. THE PREMARKET AFTER ITS WORST SESSION SINCE APRIL. LET'S MOVE ON TO INTEL. INTEL WAS IN THE GREEN, RESILIENT TO THE NASDAQ A SLIDE. IT'S NOW TRADING IN THE RED, DOWN ONE POINT 5%. SOME ATTENTION ON THE PE MULTIPLE FOR INTEL HAS REACHED DOT COM LEVEL HIGHS. I GUESS THOSE DRAWING ATTENTION TO THAT SAYING THAT MAYBE THEY SHOULD PAUSE THE RECENT RALLY. THE RETAILERS, LA-Z-BOY GETTING QUITE TROUNCED IN THE PLEA -- PREMARKET, SHOWING SOME ISSUES WITH EXPENSES AND WITH FOOT TRAFFIC. IT'S MORE MODERN BRAND JOY BIRD. WE HERE FOR MORE RETAILERS TODAY. IT DOESN'T END THERE. TARGET AND LOWE'S REPORT BEFORE THE BELL. DANI: ALSO IN THIS HOUR WE SPEAK WITH ANDREW BALLS OF PIMCO TO DISCUSS U.S. DEBT CONCERNS AND OTHER MATTERS FOR THE TREASURY MARKET. LOOKING AHEAD TO THE FOC MINUTES WITH CAYLA SEADER. AT PIMCO, HIGHER THAN USUAL PROBABILITY OF U.S. RECESSION WRITING, WHILE THE TRUMP TO PLANO FISCAL PACKAGE IS LIKELY TO WIDEN U.S. DEFICITS AND DEBT BEYOND POLICY PROJECTIONS THE OVERALL PHYSICAL SPACE REMAINS CONSTRAINED LIMITING ROOM TO RESPOND TO FUTURE DOWNTURNS. NOT A RECESSION PREDICTION BUT HOW WE RESPOND TO IT. ANDREW JOINS US NOW. YOU AND YOUR TEAM RIGHT IN YOUR OUTLOOK FOR 2025 THAT WE HAVE LIMITED ROOM TO RESPOND TO ANY DOWNTURN IF THERE IS A DOWNTURN. IS THAT WHAT YOU ARE SEEING PLAY OUT IN THE LONG END AT THE MOMENT. SOME OF THE TENSION AS WE SEE THE 5-30'S CURVE MOVED TO ITS STEEPEST SINCE 2021. ANDREW: YOU HAVE SEEN SIGNIFICANT STIMULUS WITH THE BIG, BEAUTIFUL BILL, STIMULUS THAT WILL IMPACT GROWTH OVER THIS INTO NEXT YEAR. BUT LOOKING FORWARD, GIVEN THE LEVEL OF DEFICITS, WE DO THINK IN THE EVENT OF A RECESSION, IN THE EVENT OF A SIGNIFICANT DOWNTURN IN THE ECONOMY, THERE IS LESS ROOM NOW GIVEN THE STARTING LEVEL OF THE DEFICIT. THE GOOD NEWS IS, IF YOU LOOK AT THE FEDERAL RESERVE'S POLICY RATES, THERE IS PLENTY OF ROOM FOR CONVENTIONAL MONETARY POLICY EASING, SO OUR EXPECTATION OF HER TIME AS THERE IS POTENTIAL FOR THE FED TO CUT RATES SIGNIFICANTLY LOWER THAN THE MARKET IS PRICING. YES, AS YOU SAID MORE RISK PREMIUM IS BEING BUILT INTO THE LONG END OF THE CURVE. WE THINK THAT MAKES SENSE GIVEN THE LONG-TERM FISCAL OUTLOOK. IT MADE SENSE FOR THE MARKET TO WANT MORE RISK PREMIUM AT THE LONG END OF THE CURVE. YOU ARE SEEING THAT IN THE U.S. AND GLOBALLY IN OTHER MARKETS. DANI: YOU ALSO WRITE THAT YOU DON'T NECESSARILY FORESEE A FISCAL CRISIS BUT OR SEE MORE EPISODES. OF VOLATILITY I'VE GOT TO SAY THIS MARKET HAS LACKED SERIOUS VOLATILITY FOR AT LEAST A MONTH SINCE THE SPRING. WE'VE BEEN TRADING IN A TIGHT RANGE FOR THIS TREASURY MARKET. WHAT CHANGES TO REIGNITE THAT VOLATILITY, AND WHAT DO YOU MAKE OF THE LACK OF IT AT THIS POINT DESPITE THE HEADLINE RISK THAT HAS BEEN COMING AT US FAST? ANDREW: THERE IS A LOT OF HEADLINE RISK IN MARKETS. VOLATILITY, HAVE PERFORMED VERY STRONGLY. IN BROAD TERMS, YES, THERE IS A LOT OF UNCERTAINTY IN, THE OUTLOOK THE GLOBAL TRADE WAR, BUT THIS IS BEING REDUCED GIVEN THE DEALS AT BASELINE WE HAVE NOW ACROSS COUNTRIES, AND THIS MAKES IT EASIER FOR MARKET PARTICIPANTS, FOR BUSINESS DECISION-MAKERS, TO PLAN AHEAD. WHEN YOU STEP BACK THERE IS A LOT OF ECONOMIC UNCERTAINTY, GEOPOLITICAL UNCERTAINTY. YOU SEE THIS EVERY DAY IN THE NEWS AND FROM THAT PERSPECTIVE SOME THINGS ARE VERY COMPLICATED AND SOME THINGS ARE MORE SIMPLE. IF YOU HAVE HIGH QUALITY FIXED INCOME PORTFOLIOS, YIELDS 6% OR 7% , WE SEE THAT IS A VERY ATTRACTIVE RETURN POTENTIAL OVER THE NEXT FEW YEARS AT A TIME OF GREAT UNCERTAINTY. YOU CAN STEP BACK A LITTLE BIT FROM THE DAY TO DAY AND FOCUS ON THE LONGER-TERM OUTLOOK. YES, 6%, 7%-TYPE EXPECTED RETURNS GIVEN THE STARTING YIELDS ARE VERY ATTRACTIVE FOR HIGH-QUALITY PORTFOLIOS. DANI: FOR THE LONGER-TERM OUTLOOK, BECAUSE AT THE MOMENT WHAT WE ARE CONTENDING WITH, FUELING GROWTH IS CONTINUED AI SPEND ON DATA CENTERS, THEN YOU HAVE THE ONE, BIG BEAUTIFUL BILL ADDING TO THE SUGAR RUSH AT THE START OF NEXT YEAR. WHAT HAPPENS WHEN TWO OF THOSE STORIES START TO SLOW? SPENDING FROM THE TECH GIANTS OR LATE 2026-20 27 AND SOME OF THE FISCAL SUGAR RUSH STARTS TO PETER OUT? IS THAT A CONCERN IN THE LONG TERM? ANDREW: YOU HAVE SEEN A DOWNSHIFT IN TERMS OF GROWTH. THE U.S. IS OPERATING AT ABOUT 1% THIS YEAR. CAPEX IS SUBDUED OUTSIDE OF THE TECH SECTOR, SO YOU SEEN THE SLOWDOWN IN THE U.S. ECONOMY. I THINK THE DIFFICULT THING FOR THE FEDERAL RESERVE, FOR MARKET TOP PARTICIPANTS, IS WHEN YOU GET THIS SORT OF SLOW DOWN EXACTLY HOW MUCH ARE YOU GOING TO GET? WE SAW THE WEAKNESS AND REVISIONS IN THE LABOR MARKET REPORT. THAT CLEARLY IS VERY IMPORTANT FOR THE FEDERAL RESERVE. ON OUR FORECAST WE WOULD EXPECT SOME IMPROVEMENT IN GROWTH NEXT YEAR, IN PART BECAUSE OF THE FISCAL STIMULUS. BUT YES, WHEN YOU HAVE AN ECONOMY SLOW DOWN, WHEN YOU HAVE ALL THIS TARIFF-RELATED UNCERTAINTY, IT'S HARDER THAN NORMAL TO DO YOUR FORECAST. THE FED CLEARLY IS DEALING WITH THE SAME CHALLENGES. THE GOOD NEWS IS, THE MARKET IS PRICING IN THE FEDERAL RESERVE TO CUT RATES BUT REMAIN ABOVE THEIR ESTIMATE, OUR ESTIMATE FOR NEUTRAL POLICY RATES. IF YOU DO GET WORSE THAN EXPECTED GROWTH OUTCOMES, AND THERE'S PLENTY OF ROOM FOR THE FED TO CUT RATES BELOW THE 3 OR 3-AND-A BIT POLICY RATE THAT IS PRICED IN. DANI: THEY DON'T WANT TO SAY ANYTHING GIVEN TO YOUR POINT HOW HARD IT IS TO FORECAST, I WOULD SAY THE CASH IN THE CREDIT KEEPS GUSHING AN OVERWHELMING SUPPLY. IG SPREADS REACHING THE TIGHTEST SINCE 1990. IT SEEMS LIKE THERE IS A SPLIT. THE BANK OF AMERICAS AND HSBC'S REMAINING OPTIMISTIC. WHERE DO YOU STAND ON THIS? ANDREW: I THINK THE CREDIT SPREADS DON'T LOOK SUPER ATTRACTIVE IN THE BASELINE. I THINK THEY ARE FINE, BUT THERE IS CERTAINLY NOT A LOT OF EXCESS COMPENSATION FOR CREDIT RISK GIVEN THE MACRO RISKS THAT WE'VE DISCUSSED. WHAT WE FIND IS WE CAN RELY A LITTLE LESS ON CORPORATE CREDIT AND LOOK ELSEWHERE IN THE MARKET TO GENERATE ATTRACTIVE YIELD. WE THINK MORTGAGES LOOK VERY ATTRACTIVE, PRIVATELY MORTGAGE LOOK ATTRACTIVE, HAD SOME GLOBALLY DIVERSIFIED POSITIONS IN TERMS OF MORTGAGES. AGAIN, YOU CAN BUILD YIELD 6%, 7% FOR HIGH-QUALITY PORTFOLIOS WITHOUT RELYING TOO MUCH ON CORPORATE CREDIT. IN PARTICULAR, HIGH YIELD LOOKS A LITTLE LESS ATTRACTIVE IN MORE ECONOMICALLY-SENSITIVE SECTORS. WE THINK IT'S WORTH BEING QUITE CAREFUL THERE. UP IN QUALITY COME UP IN LIQUIDITY YOU CAN BUILD ATTRACTIVE RETURN PORTFOLIOS WITHOUT HAVING TO RELY TOO MUCH ON CORPORATE CREDIT RISK. DANI: ANDREW, IS SO WONDERFUL TO HAVE YOU THIS MORNING. THAT IS ANDREW BALLS OF PIMCO. OTHER TOP STORIES, U.K. INFLATION HAS CLIMBED TO AN 18-MONTH HIGH AFTER A PICKUP IN FUEL, FOOD, AND TRANSPORT PRICES. THE BANK OF ENGLAND IS NOW UNDER PRESSURE TO RECONSIDER THE PACE OF INTEREST RATE CUTS. CONSUMER PRICES ROSE THREE POINT 8% FROM A YEAR EARLIER AND SERVICES INFLATION CLIMBED TO 5%. PRIME MINISTER MODI WELCOME TO IMPROVED TIES WITH CHINA AFTER MEETING WITH THE FOREIGN MINISTER. HE SAYS THAT THE RELATIONS BETWEEN THE TWO COUNTRIES HAVE MADE STEADY PROGRESS AND PRIME MINISTER MODI SAYS THAT HE'S LOOKING FORWARD TO VISITING CHINA THIS MONTH, HIS FIRST TRIP TO THE COUNTRY IN SEVEN YEARS, AND MEETING PRESIDENT HSING. POP H-MART ROSE THE MOST IN FOUR MONTHS AFTER THE CEO SAID THE COMPANY COULD EASILY SURPASS ITS ANNUAL SALES PROJECTION. THE CEO SAID THAT HE IS UNABLE TO PREDICT GROWTH AS A RESULT OF THE GLOBAL FRENZY FOR THE LABUBU DOLLS. I GUESS HE IS MAKING A MINI VERSION. JOY. THAT FRENZY WILL CONTINUE IN A MINI FORM. IF IT'S NOT BROKE, DON'T FIX IT. MORE ON THAT NEXT ON YOUR \"BRIEF.\" ♪ DANI: YOU ARE WATCHING \"BLOOMBERG BRIEF.\" TREASURY SECRETARY SCOTT BESSENT SAYS THAT HE'S HAPPY WITH THE STATUS QUO WHEN IT COMES TO TRADE ARRANGEMENTS WITH CHINA. HE SPOKE TO FOX NEWS ABOUT IF A TRADE DEAL WAS COMING UP AMID ONGOING TALKS BETWEEN WASHINGTON AND BEIJING. SEC. BESSENT: CHINA IS RIGHT NOW THE BIGGEST REVENUE LIME IN -- LINE IN THE TARIFF INCOME. IT IS NOT BROKE DON'T FIX IT. THEY HAVE A 10% TARIFF ON US. THEY STARTED SHIPPING THE RARE EARTH MAGNETS, WHICH WE AGREED TO. WE HAD PUT COUNTERMEASURES ON THEM THAT WE'VE TAKEN OFF. I THINK RIGHT NOW THE STATUS QUO IS WORKING PRETTY WELL. DANI: WE ARE JOINED BY BLOOMBERG'S SUZANNE LYNCH. IT SOUNDS LIKE CAN KICKING MIGHT BECOME THE NEW POLICY. SUZANNE: VERY MUCH SO. WE KNOW THE TRADE TRUCE HAS BEEN EXTENDED UNTIL NOVEMBER, AND THOSE COMMENTS FROM THE TREASURY SECRETARY SUGGEST THAT THERE IS NO RUSH TO CHANGE THINGS BEFORE THEN. AS HE SAID, IT IS WORKING WELL, AS THEY SEE IT. THE FOCUS NOW IS IF THEY PLANNED, POSSIBLE SUMMIT BETWEEN PRESIDENT TRUMP AND XI JINPING TAKES PLACE BEFORE THE END OF THE YEAR. WE ARE EXPECTING THAT MAY TAKE PLACE. THERE ARE SOME WRINKLES. THERE ARE SOME COMPLAINTS BY U.S. SOYBEAN PRODUCERS, FOR EXAMPLE, THAT CHINA ISN'T BUYING THEIR SOYBEANS IN THIS COULD INCREASINGLY BECOME AN ISSUE FOR SOME U.S. EXPORTERS. DANI: ON THAT SIDE OF THINGS, YOU HAVE THE CHINA AND U.S. TRADE TALKS GOING ON, BUT AMID THIS YOU HAVE INDIA TALKING ABOUT CLOSER TRADE TIES TO CHINA, ANOTHER STICKING POINT FOR THE U.S. WHAT IS IT SAYING ABOUT THE U.S. AND INDIA IF YOU HAVE WHAT SEEMS TO BE A PUSH FOR THEM TO LOOK ELSEWHERE? SUZANNE: ABSOLUTELY. THAT'S WHAT WE ARE SEEING NOW. INDIA WAS OBVIOUSLY QUITE SURPRISED BY THE LEVEL OF TARIFFS THAT WERE IMPOSED BY WASHINGTON ON NEW DELHI. YES, THIS WEEK WE SAW TALKS AT THE VERY SENIOR LEVEL BETWEEN INDIA AND CHINA IN NEW DELHI. INDIA IS OBVIOUSLY MAKING SURE THAT IT IS LOOKING ELSEWHERE IN CASE THE TRADE RELATIONSHIP THAT IT HAS WITH THE UNITED STATES DETERIORATES EVEN FURTHER. ONE OF THE BIG BELIEFS THAT DONALD TRUMP HAS WITH INDIA IS THAT IT IS PURCHASING RUSSIAN OIL AND BESSENT REPEATED THAT CONCERN YESTERDAY. OF COURSE, WE KNOW THAT IT DOESN'T SEEM TO HAVE THE SAME CONCERN WITH CHINA. IT HASN'T PUNISHED CHINA FOR PURCHASING RUSSIAN OIL AND IT HIT INDIA WITH A 50% TARIFF CITING THAT IT WAS BUYING RUSSIAN OIL. INDIA SAYS THAT IT'S ITS OWN RIGHT TO BUY THE OIL AT HIS CHEAPEST LEVEL, BUT IT DOES GO TO THE HEART OF WHAT IS BECOMING AN INCREASINGLY FRACTIOUS RELATIONSHIP BETWEEN THE UNITED STATES AND INDIA. DANI: BEFORE WE LET YOU GO, WE HAD FILINGS FROM THE WHITE HOUSE LYIN -- LAYING OUTCOMES INVESTMENTS. WHAT DID WE LEARN? SUZANNE: DONALD TRUMP'S INVESTMENTS AND THAT, MUNICIPAL DEBT AND CORPORATE HOLDINGS. INTERESTING NAMES. COMPANIES LIKE HOME DEPOT, META. I SUPPOSE IT RAISES THE QUESTION OF THE U.S. PRESIDENT INVESTING IN COMPANIES BEING AFFECTED BY HIS OWN POLICIES AND THE WHITE HOUSE. U.S. PRESIDENTS ARE NOT OBLIGED TO DIVEST THEIR ASSETS WHEN THEY BECOME PRESIDENT, BUT MOST HAVE DONE SO. TRUMP HAS BROKEN PRESIDENT HERE. BUT HE WAS OBLIGED TO FILE LAST NIGHT, AND THAT'S WHERE WE ARE GETTING THOSE DETAILS FROM. DANI: APPRECIATE YOU BRINGING US THOSE DETAILS. THAT IS SUZANNE LYNCH ON THE LATEST IN WASHINGTON. COMING UP, CLOSER LOOK AT META'S RESTRUCTURING PLAN AND THEIR CONTINUED NONSTOP SPEND ON AI COMING UP NEXT ON YOUR BRIEF. YOU ARE WATCHING BLOOMBERG. ♪ DANI: YOU ARE WATCHING BLOOMBERG BRIEF. I AM DANI BURGER IN NEW YORK. THE FRONT PAGES, FIRST UP ON THE WALL STREET JOURNAL, THEY ARE LEADING WITH THE REPORT THAT ELON MUSK IS QUIETLY PUMPING THE BRAKES ON HIS PLANS TO START A POLITICAL PARTY. HE TOLD ALLIES THAT HE WANTS TO FOCUS ON HIS COMPANIES AND IS RELUCTANT TO ALIENATE POWERFUL REPUBLICANS BY STARTING HIS OWN PARTY. SOURCES SAY THAT MUSK IS WEIGHING USING HIS FINANCIAL RESOURCES TO BACK VP JD VANCE IF HE DECIDES TO RUN FOR PRESIDENT IN 20 28. THE WASHINGTON POST REPORTING THAT U.S. ATTORNEY PURO SAID THAT FEDERAL PROSECUTORS AND D.C. HAVE BEEN INSTRUCTED NOT TO SEEK FELONY CHARGES AGAINST PEOPLE CARRYING RIFLES OR SHOTGUNS. THE SHIFT COMES AT AN UNEXPECTED TIME WITH THE TRUMP ADMINISTRATION RAMPING UP FEDERAL LAW ENFORCEMENT ON THE STREETS OF WASHINGTON. SHE SAID HER OFFICE WOULD CONTINUE CHARGING VIOLENT CRIMES AND FIREARMS TRAFFICKING INVOLVING THOSE WEAPONS. THE FT LEAVING WITH U.S. TECH STOCKS GETTING HIT AS WARNINGS THAT THE HYPE SURROUNDING AI COULD BE OVERDONE. TRADERS PENDING SOME DECLINES IN THE U.S. ON A CRITICAL REPORT AUTHORED BY A BRANCH OF M.I.T. THAT SAID 95% OF ORGANIZATIONS ARE GETTING ZERO RETURNS ON THEIR INVESTMENT IN GENERATIVE AI. A FORMER JP MORGAN STRATEGIST SAYING IT LOOKS LIKE A BUBBLE. META IS DOUBLING DOWN RESTRUCTURING ITS ARTIFICIAL INTELLIGENCE GROUP. THE IDEA IS TO BETTER CAPITALIZE ON ITS RECENTLY ACQUIRED TALENT. THE BLOOMBERG TECH EUROPE ANCHOR TOM MACKENZIE JOINS US NOW. WHAT WE KNOW ABOUT THE RESTRUCTURING? TON: TWO KEY AIMS FOR MARK ZUCKERBERG. ONE IS TO CAPITALIZE ON THE HUGE INVESTMENT IN TERMS OF TALENT AND, INCREASINGLY, INFRASTRUCTURE BEING PUT TO PLAY. THE OTHER, THIS TIES INTO THE NEXT PART, PLAYING CATCH-UP TO THE LIKES OF OPENAI AND GOOGLE. THEY ARE BEHIND, META, WHEN IT COMES TO THEIR LARGE LANGUAGE MODELS. THEY SPENT THIS MONEY ON TALENT AND INFRASTRUCTURE AND THEY NEED TO CATCH UP. PART OF THE RATIONALE IS TO DO THAT. THEY WANT TO GET WHAT MARK ZUCKERBERG DESCRIBES AS SUPER INTELLIGENCE WERE ARTIFICIAL GENERAL INTELLIGENT. HE SEES THAT IS CENTRAL TO META. THE INFRASTRUCTURE PIECE FOCUSED ON RESEARCH FOCUSED ON LARGE LANGUAGE MODELS AND THE PRODUCT PIECE, HOW AI FITS INTO META'S EXISTING ECHO SYSTEM IN TERMS OF PRODUCTS GETTING TO CONSUMERS. DANI: HOW MUCH DOES THIS UNDERSCORE THAT SPENDING TO META IS LIKE THE SIDESHOW? THEY WILL SPARE NO EXPENSE? THE NUMBERS THEMSELVES DON'T MATTER? THEY ARE WILLING TO PLOW SO MUCH CAPITAL INTO THIS PROJECT? TOM: THERE HAS BEEN NO SHORTAGE, IT SEEMS, OF CAPITAL THAT META IS PUTTING TO WORK TO TRY TO CLOSE THAT GAP. WHETHER IT IS SIGNING $100 MILLION CHECKS FOR NEW HIRES OR PLEDGING TO INVEST UP TO 72 BILLION U.S. DOLLARS THIS YEAR AND MORE IN 2020 SIX ON INFRASTRUCTURE AND ENERGY. BUT THERE IS A TENSION. MONEY DOESN'T SOLVE ALL OF YOUR ISSUES. THEY HAVE BROUGHT IN THE NEW HIRES. ACCORDING TO THE NEW YORK TIMES THERE IS TENSION BETWEEN THE NEW HIRES, LIKE ALEXANDER WANG. HE NOW OVERSEES ALL OF THE. AI PROGRAM FOR META TENSIONS BETWEEN HIM AND HIS TEAM AND SOME OF THE PREVIOUS HIRES, THE OLD HANDS AT META, EXIST. RADICAL CHANGES, BREAKING UP INTO FOUR DIFFERENT UNITS. ACCORDING TO THE NEW YORK TIMES THEY ARE POTENTIALLY LOOKING AT USING OTHER AI LARGE LANGUAGE MODELS FROM THIRD-PARTY COMPANIES TO BUILD ON AS WELL. THERE IS A CONTINUING DEBATE WITHIN META THAT HAS LONG PUSHED OPEN SOURCE MODELS TO POTENTIALLY MOVE TO A CLOSED MODEL SYSTEM. THAT AS WELL IS CAUSING SOME INTERNAL TENSION. MONEY ALONE WON'T CLOSE THAT GAP, BUT IT COULD GO A LONG WAY FOR MARK ZUCKERBERG AND THE TEAM AT META. DANI: YOU CAN SEE HOW THESE YOUNG ADULTS COMING IN TRYING TO PUSH OTHERS AROUND MIGHT UPSET A FEW PEOPLE. TOM, THANK YOU FOR THAT REPORTING. THAT IS BLOOMBERG TECH ANCHOR TOM MACKENZIE. SAM ALTMAN OF OPENAI SAYING, ARE WE IN A PHASE WHERE INVESTORS ARE OVEREXCITED BY AI? IN MY OPINION, YES. YOU ARE SEEING SOME OF THAT REFLECTING OR MAY BE MOMENTUM UNWINDING. LOOKING AHEAD TO THE LATEST FED MINUTES. THAT IS COMING UP NEXT ON YOUR BRIEF. DANI: IT IS 5:30 AM IN NEW YORK CITY, I AM DANI BURGER WITH YOUR \"BLOOMBERG BRIEF.\" HERE'S WHAT YOU NEED TO KNOW THIS WEDNESDAY. A TECH SELLOFF LEADS INTO GLOBAL MARKETS AFTER NVIDIA'S WORST DECLINE IN FOUR MONTHS. HAPPY WITH THE STATUS QUO. SECRETARY BESSENT SAYS THE CURRENT TARIFF SET UP WITH CHINA IS WORKING PRETTY WELL. A HOUSE DIVIDED. JULY'S FED MINUTES ON DECK WITH INSIGHTS INTO THE DISSENTING DOVES. WE ARE WEAKER FOR A THIRD CONSECUTIVE DAY AFTER THE CLOSE YESTERDAY. WILL TODAY MAKE IT A FOURTH? TECH IN PARTICULAR HAS BEEN HARD-HIT DESPITE A BOOST FROM HOME DEPOT AND INTEL YESTERDAY. IT WAS A MOMENTUM TRADE UNWIND. DOWN ABOUT .2% FOR THE NASDAQ. IT WAS A 10-YEAR RALLY YESTERDAY THAT BROKE A THREE-DAY SLIDE, BUT YIELDS ARE LITTLE CHANGED THIS MORNING. FED MINUTES TODAY AND TOMORROW JACKSON HOLE KICKS OFF. WE ARE AT 43023. VALERIE: A CHECK ON NVIDIA AFTER ITS WORST SIDE SINCE APRIL AND THE SESSION YESTERDAY. WE ARE TRADING A BIT STRONGER THIS MORNING BUT ONLY FRACTIONALLY. UP .3%. IT WAS DOWN NEARLY HALF OF 1% EARLIER IN PREMARKET TRADE SO IT SEEMS TO BE THE MOMENTUM FOR TECH STOCKS IS PICKING UP AS WE GET CLOSER TO THE BILL. INTEL, A LITTLE BIT OF A DIFFERENT PICTURE. INTEL WAS QUITE RESILIENT TO THE TECH SLIDE YESTERDAY. IN THE GREEN, UP 6% AT THE CLOSE BUT FALLING IN PREMARKET, DOWN AROUND ONE POINT 5% FOR THE U.S. CHIPMAKER AS IT HAD QUITE A REMARKABLE RUN. 27% SINCE THE CEO MET WITH TRUMP IN THE WHITE HOUSE SEVEN SESSIONS AGO. GETTING BACK SOME GAINS FOR INTEL, DOWN 1.5%. EARNINGS, THERE WAS AN INTERESTING PICTURE THAT WE GOT FROM THE U.S. HOMEBUILDERS. WE HAD THE LUXURY HOME BUILDER TOLL BROTHERS PULLING BACK ON THEIR GUIDANCE FOR NEW HOME DELIVERIES, NEW CONSTRUCTION BEING SOFT. JAMES ALREADY, A BUILDING MATERIALS MAKER, WHO POINTED -- JAMES ALREADY, A BUILDING MATERIALS MAKER, WHO POINTED THAT THEY ARE SEEING WEAK DEMAND FOR MATERIALS IN THE U.S. AND CANADA PAINTING A WEAK PICTURE ON THE U.S. HOUSING FRONT WHEN IT COMES TO TOLL BROTHERS AND JAMES HARDY. DANI: THE LATEST FED MEETING MINUTES COMES THIS AFTERNOON AT 2:00 P.M. EASTERN. WITH A SET UP ON WHAT TO LOOK UP TO HERE IS OUR BLOOMBERG LIVE TEAM. WHAT ARE YOU LOOKING AT IN TODAY'S MINUTES? > > IT IS GOING TO BE AN INTERESTING SET OF MINUTES. UNDER POWELL'S FED WE HAVEN'T SEEN A TEAM CHARACTERIZED BY TOO MANY DISSENTS AND LAST MONTH THEY GOT TWO FROM CHRISTOPHER WALLER AND MICHELLE BOWMAN. IT WILL BE INTERESTING. THE MARGIN MAKES THOSE MINUTES INTERESTING. MUCH WATER HAS FLOWED UNDER THE BRIDGE. WE HAVE HAD A VERY WEAK LABOR REPORT AND PRETTY WEAK ISM MANUFACTURING INDEX FOR, SO THE MARKETS HAVE QUICKLY REPOSITIONED THEMSELVES TO AN 80% POSSIBILITY OF A RATE CUT IN SEPTEMBER. OF COURSE, THE ELEPHANT IN THE ROOM IS THE JACKSON HOLE ADDRESS FROM POWELL ON FRIDAY. THE MARKETS ARE WONDERING WHAT HE'S GOING TO SAY. IF YOU WILL STAND IN THE WAY OF THE TWO RATE CUTS THAT THE FED PENCILED IN BY THE END OF THE YEAR. IF YOU TAKE REALIZED INFLATION SO FAR THIS YEAR INTO ACCOUNT, THE FED RATE SHOULD BE 3.75. THERE'S QUITE A BIT OF MARGIN FOR THE FED TO CUT RATES HERE. THE QUESTION IS WHETHER POWELL WILL STAND IN THE WAY OF THE TWO RATE CUTS THAT THE FED ITSELF HAS FLAGGED. DANI: THANK YOU FOR THAT SET UP FOR THE REST OF THE WEEK. JOINING US IS CAYLA SEDER, MULTI-ASSET STRATEGIST AT STATE STREET. THE LAST POINT FROM VEN, THE IDEA OF IF POWELL WILL STAND IN THE WAY OF MARKET PRICING. THE MARKET PRICING IS SOMETHING LIKE 80% WILL GET A CUT IN SEPTEMBER. DOES POWELL HAVE ANY INCENTIVE TO PUSH BACK OR CONFIRM THAT? CAYLA: FIRST OFF, THANKS FOR HAVING ME. WHEN IT COMES TO POWELL AND WHAT WE ARE LOOKING FOR IT JACKSON HOLE THIS WEEK, HOW MUCH IS HE GOING TO CONFIRM A CUT FOR SEPTEMBER? IN THE PAST HE HAS ECHOED THE MANTRA OF DATA DEPENDENCE, AND WE HAVE A LOT OF DATA COMING UP BETWEEN JACKSON HOLE AND THE NEXT FED MEETING. I THINK HE IS GOING TO ECHO THIS MESSAGE OF, WE HAVE A LOT OF DATA THAT IS YET TO COME. FOR MARKETS, THAT CAN BE A RISK. LIKE YOU SAID, AN 80% CHANCE OF A CUT IN SEPTEMBER. THE MARKET REALLY LOOKING FOR THAT 25. UNLESS THERE IS CONFIRMATION THAT THE 25 IS DEFINITELY COMING, WHICH LOOKS UNLIKELY GIVEN THE HISTORY OF THE TONE POWELL HAS SAID, WE COULD SEE, ESPECIALLY IN EQUITIES, MORE OF THE TRENDS WE'VE SEEN OVER THE LAST COUPLE OF DAYS WHERE THEY TAKE MORE OF A HIT. DANI: I WAS GOING TO ASK WHERE THE VULNERABILITIES ARE. IT SOUNDS LIKE RISK ASSETS. IS IT A FRAGILE MARKET RIGHT NOW, GIVEN EVERYTHING WE ARE PRICING IN? CAYLA: THE WAY I WOULD THINK ABOUT IT IS, WILL WE SEE MORE CONCENTRATION? THROUGHOUT THIS ENTIRE PROCESS, FROM WHEN THE FED STARTED HIKE IN 2022 TO THIS REALLY SLOW TRICKLE OF CUTS OVER THE LAST YEAR, WHAT WE HAVE SEEN IS, TECH CONTINUES TO REALLY STAND OUT. THERE IS CONCERN OF, IS TECH A BUBBLE? DO WE SEE THESE TRENDS CONTINUE TO METASTASIZE AND GROW? I THINK UNTIL WE SEE DEFINITIVE SIGNS THAT LOTS OF CUTS ARE COMING YOU WILL PROBABLY SEE MORE OF THAT CONCENTRATION. GETTING BACK TO YOUR QUESTION AROUND, OUR MARKETS FRAGILE OR NOT? -- ARE MARKETS FRAGILE OR NOT? UNTIL WE SEE SIGNS THAT CUTS WILL SEQUENTIALLY BE COMING, THE CONCENTRATION WILL PROBABLY CONTINUE. DANI: SEQUENTIAL CUTS, THAT LOTS OF CUTS ARE COMING. IF WE CUT IN SEPTEMBER OR TWICE THIS YEAR, SOMETHING THAT LOOKS NEUTRAL, IS THAT A -- IS THAT NOT ENOUGH FOR THE BROADENING OUT TRADE? CAYLA: WHEN YOU LOOK AT THE PROFITABILITY OF A LOT OF THESE TECH COMPANIES, EVEN WITH CAPEX SPENDING, ARE THE COME OF THE AI TRENDS, YOU STILL SEE A WIDE MARGIN BETWEEN TECH AND A LOT OF OTHER PARTS OF THE MARKET. I DO THINK IT WILL TAKE MORE THAN 25 BASIS POINTS OF CUTS TO REALLY GET INVESTORS INTERESTED IN THESE OTHER PARTS OF THE MARKET. THERE ARE SOME PLACES WHERE POSITIONING IS EXCEPTIONALLY UNDERWEIGHT. YOU COULD SEE MORE INTEREST THERE, BUT BY AND LARGE IT WILL TAKE MORE OF A SHIFT TO REALLY BREAK THAT GAP BETWEEN TECH AND THE REST OF THE MARKET. DANI: WHEN IT COMES TO THE BOND MARKET, SCOTT BESSENT WAS ADVOCATING ON CNBC YESTERDAY THAT WE NEED MORE CUTS. THAT IT'S A HOUSING MARKET UNDER PRESSURE. THIS MARKET HAS PRICED IN 100 BASIS POINTS OF CUTS OVER THE NEXT 12 MONTHS AND THE 10-YEAR HAS BASICALLY REMAINED UNCHANGED AS WE PRICED THAT IN. IF WE COULD CUTS, HOW CONFIDENT OR NOT CONFIDENT ARE YOU THAT WE WOULD EVEN GET, FROM THE LONGER END COME THAT WOULD TRANSLATE INTO THE STRENGTH OF THE HOUSING MARKET? CAYLA: DOES A GREAT WAY TO THINK ABOUT IT. IF THE FRONT AND COMES DOWN WHAT WILL THE LONG AND DO? THERE ARE UPSIDE RISKS TO THE LONG END, THE PREMIUM, OR THE DEFICIT. IF YOU THINK THE LONG END IS GOING TO RISE WHEN YOU SEE FED CUTS, THAT TELLS YOU A LOT. IT TELLS YOU, SHOULD THE FED REALLY BE CUTTING IS MUCH AS THE MARKET EXPECTS? I THINK, MOVING FORWARD ONE THING WE ARE SEEING ON OUR DATA ON THE REAL MONEY INVESTOR SIDE IS THAT THERE ISN'T A LOT OF DEMAND FOR 10-YEAR BONDS. WHAT WE SEE IS MORE SELLING. REAL MONEY INVESTORS ARE REALLY STICKING TO THE FRONT END OF THE CURVE.THAT TELLS YOU A LOT RIGHT THERE . THERE ARE UPSIDE PRESSURES ON THE LONGER END OF THE CURVE. DANI: BESSENT SAID HE STARTS TO STUDY THE NEXT FED CHIEF CANDIDATE AROUND LABOR DAY AND THEN HE WOULD WHITTLE DOWN THE LIST. FROM WHAT YOU'RE TALKING ABOUT IMPORTANTLY, HOW DOVISH THE FED IS, OR PERCEIVED TO BE MOVED DOVISH IN THE LONG END, HOW IMPORTANT IS IT? CAYLA: THERE ARE A LOT OF VOTERS, NOT THAT ONE VOTE MATTERS MORE THAN ANYONE ELSE'S. THE CHAIRMAN'S JOB IS IMPORTANT IN BUILDING THAT CAN SENSE IS, HOWEVER I WOULD KEEP IN MIND THAT IT'S GOING TO TAKE A LOT MORE VOTERS TO TURN THE OVERALL FED TO BE DOVISH. BUT IT WILL DEPEND ON THE DATA. THAT'S THE MOST IMPORTANT THING. DANI: SPEAKING OF THE DATA AND MARKET FRAGILITY, WE WERE SPEAKING TO TOM MACKENZIE EARLIER ABOUT HOW MUCH META IS SPENDING. THEY ARE GOING CRAZY. IT'S NOT JUST THEM. IT IS ALL OF THE HYPERSCALERS. IF WE ARE IN A SITUATION WHERE THERE IS AN M.I.T. STUDY SING 95% OF SPENDING ON GENERATIVE AI IS NOT MAKING RETURNS, I DON'T KNOW HOW THEY MEASURE THAT, IF WE GET TO AN ENVIRONMENT WHERE ANY BIG TECH PLAYER PULLS BACK, HOW DEPENDENT HAVE WE GOTTEN ON AI? NOT JUST FOR THE MARKET BEFORE THE ECONOMY, THE NUMBERS THEY ARE PUTTING UP? WHAT IS THE RISK IF A PULLBACK? CAYLA: THERE IS THE RISK OF THAT. IN OUR DATA WE CONTINUE TO SEE STRONG DEMAND FOR SEMIS, WHERE INFLOWS ARE THE STRONGEST. IF YOU SEE SIGNS THAT THE META'S OF THE WORLD ARE DECREASING APPETITE TO INVEST IN THE AI TRADE, THAT COULD PUT THE SEMI TRADE AT RISK. YOU COULD SEE SOME SELLOFF. SO FAR, THIS TREND HAS REALLY BEEN ALL ABOUT AI. AGAIN AND AGAIN FOR THE PAST YEAR WE HAVE HAD CONVERSATIONS AROUND, ARE THESE TECH COMPANY SPENDING TOO MUCH ON AI? SO FAR THE ANSWER HAS BEEN NO. THAT CONTINUES TO SUPPORT THIS OVERALL SEMIS TRADE WHERE WE SEE LONGER-TERM INVESTORS CONTINUE TO ALLOCATE THEIR ASSETS. DANI: DO YOU BUY ANY OF THE CROWDING OUT IDEA THAT A LOT OF INVESTMENT IS GOING INTO TECH? IT MAKES ENERGY MORE EXPENSIVE FOR EVERYDAY PEOPLE. EMIN'S INVESTMENTS ARE BEING FUNNELED INTO AI -- IT MEANS INVESTMENTS ARE BEING FUNNELED INTO AI. IS IT A RISK FOR OTHER PARTS OF THE ECONOMY? CAYLA: I THINK AI HAS THE POTENTIAL TO IMPACT MORE THAN TECH. IF YOU'RE FOLLOWING THE AI TRADE, THERE ARE OTHER SECTORS THAT CAN BENEFIT. WE THINK ABOUT UTILITIES. WHAT HAS THE POWER THIS TRADE. YOU CAN THINK ABOUT PLACES LIKE HEALTH CARE. THAT HAS A LOT OF POTENTIAL TO BENEFIT FROM THE AI TRADE. EVEN SOMETHING LIKE SUPPLY CHAINS WHERE SUPPLY CHAINS TO DO A BETTER JOB IF THEY INCORPORATE SOME OF THESE AI TOOLS WE'VE LEARNED ABOUT. I THINK BECAUSE THE BREADTH OF AI CAN BE WIDE, THE LIKELIHOOD THAT IT'S A BUBBLE OR IS CROWDING OUT OTHER PARTS OF THE MARKET IS LOWER. DANI: WE WILL END THERE. THANK YOU FOR JOINING, CAYLA SEDER OF STATE STREET. OTHER TOP STORIES TURNING ON THE TERMINAL, U.K. INFLATION CLIMBED TO AN 18-MONTH HIGH AFTER A PICKUP IN FUEL, FOOD, AND TRANSPORTATION PRICES. THE BANK OF ENGLAND IS UNDER PRESSURE TO RECONSIDER THE PACE OF INTEREST RATE CUTS. CONSUMER PRICES ROSE 3.8% FROM A YEAR EARLIER. SERVICES INFLATION CLIMBED TO 5%. PRESIDENT TRUMP MET WITH THE CEOS OF THE WORLD'S TWO BIGGEST MINING COMPANIES TO DISCUSS A COPPER PROJECT IN ARIZONA. RIO TINTO AND BHP WERE AT THE WHITE HOUSE TO DISCUSS THE PROJECT THAT COULD SUPPLY THE WHITE HOUSE WITH 25% OF ITS ANNUAL COPPER NEEDS FOR AS MANY AS 40 YEARS. PRESIDENT TRUMP HAS BOUGHT HUNDREDS OF BONDS SINCE RETURNING TO OFFICE. DOCUMENTS SHOW THAT HE MADE SIX HUNDRED 90 TRANSACTIONS BEGINNING THE DAY AFTER HIS INAUGURATION TOTALING AT LEAST $103.7 MILLION. AMONG THE DEBT HE BOUGHT WERE THOSE SOLD BY U.S. COMPANIES AFFECTED BY POLICY CHANGES HE CHAMPIONED. COMING UP, TREASURY SECRETARY SCOTT BESSENT'S VIEW ON CHINA TRADE FOR NOW IS, IF IT AIN'T BROKE DON'T FIX IT. MORE ON THAT NEXT. YOU ARE WATCHING BLOOMBERG TV. ♪ DANI: YOU ARE WATCHING \"BLOOMBERG BRIEF.\" I AM DANI BURGER IN NEW YORK. SECRETARY BESSENT SAYS THE U.S. IS HAPPY WITH TRADE ARRANGEMENTS WITH CHINA. HE SPOKE TO FOX NEWS ABOUT IF A DEAL WITH BEIJING WAS COMING UP. SEC. BESSENT: WE ARE AT 50% OR 55%. CHINA RIGHT NOW IS THE BIGGEST REVENUE LINE IN THE TARIFF INCOME. IF IT'S NOT BROKE, DON'T FIX IT. THEY HAVE A 10% TARIFF ON US. THEY STARTED SHIPPING THE RARE EARTH MAGNETS, WHICH WE AGREED TO. WE HAD PUT COUNTERMEASURES ON THEM THAT WE HAVE TAKEN OFF. I THINK RIGHT NOW THE STATUS QUO IS WORKING PRETTY WELL. DANI: FOR MORE WE ARE JOINED BY BLOOMBERG'S BRENDAN MURRAY. WHAT IS THE PROGRESS ON CHINA AND U.S. TRADE TALKS? DOES IT SEEM LIKE THE STATUS QUO IS IN PLACE OF THE PROGRESS, THAN CAN KICKING IS THE NEW POLICY FROM HERE ON OUT? BRENDAN: IT SOUNDS LIKE TREASURY SECRETARY BESSENT IS COMFORTABLE WITH THE RHYTHM THEY'VE GOTTEN INTO, THE ONCE EVERY THREE MONTHS OR SO RENEGOTIATING/RESETTING OF THE RELATIONSHIP. HE TALKED ABOUT HOW THE IMPORTANT THING IN THAT CONVERSATION THAT HE HAD WAS THE REVENUE THAT THE U.S. IS GETTING FROM CHINA. IT DOESN'T SOUND LIKE IT IS THE REBALANCING OF THE U.S.-CHINA TRADE RELATIONSHIP THAT'S THE MAIN PRIORITY NOW. IT'S ALL THE MONEY THEY ARE ABLE TO GET FOR THE U.S. TREASURY THAT SEEMS TO BE A BIG FACTOR. ONE OF THE THINGS WE DIDN'T HEAR FROM SECRETARY BESSENT IS CHINA IS NOT BUYING ANY AMERICAN SOYBEANS WHICH HAS U.S. FARMERS IN A TIGHT SPOT. CHINA HAS PURCHASED NO NEW CROPS, SOYBEANS, FROM THE U.S. HEADING INTO THE HARVEST. YOU'VE GOT TO WONDER, AT SOME POINT THOSE WORRIES FROM A STRONG BASE OF TRUMP SUPPORTERS WILL START TO GET LOUDER AND LOUDER, AND ALL THE REVENUE COMING IN FROM TARIFFS ON CHINESE IMPORTS IS GOING TO MEET HEAD ON WITH A BUNCH OF ANGRY FARMERS WHO AREN'T GOING TO MAKE MONEY THIS YEAR. DANI: CAN WE TALK ABOUT THAT REVENUE? YESTERDAY THERE WAS A LOT OF TALK ABOUT HOW S & P DOUBLE RATINGS LEFT THE AA PLUS RATING ON THE U.S. BECAUSE OF THE TARIFF REVENUE COMING IN. HOW SUSTAINABLE DOES IT LOOK GIVEN THE TENSIONS YOU'VE BEEN DISCUSSING? BRENDAN: IT LOOKS PRETTY SUSTAINABLE. ACROSS THE BOARD THE TRUMP ADMINISTRATION HAS IMPOSED TARIFFS OF 10% ON JUST THE U.K., BUT 15% IS THE BASE FOR MANY OTHER COUNTRIES. THE MONEY IS STARTING TO COME INTO THE TREASURY ON A MONTHLY BASIS. IT IS LOOKING SOMETHING IN THE ORDER OF $30 BILLION. YOU START ADDING THAT UP OVER TIME AND THAT STARTS TO MAKE A BIG DENT IN THE U.S. DEBT AND DEFICIT THAT IT MAINTAINS. THIS INCREASINGLY SOUNDS LIKE THE RATIONALE FOR THE TARIFFS. IF INFLATION STARTS TO FLAREUP MORE THAN IT HAS IN SOME POCKETS, THIS IS THE DEFENSE THAT THE TRUMP ADMINISTRATION AND THEIR SUPPORTERS IN CONGRESS HAVE THAT THIS IS HELPING FUND THE GOVERNMENT IN A BIG WAY. DANI: BLOOMBERG'S BRENDAN MURRAY ON TRADE. EARNINGS, RESULTS FROM RETAILERS WITH TARGET, TJX, AND LOWS TO REPORT BEFORE THE BELL AFTER HOME DEPOT SAW SALES RETURN TO GROWTH IN THE SECOND QUARTER. THE OPPENHEIMER SENIOR ANALYST SPOKE ABOUT HOW IT COULD IMPACT OTHER RETAILERS. > > I THINK IT BODES WELL FOR LOWE'S. MY WEIGHT OF SING TO MY CLIENTS, YOU -- IF YOU WANT TO WAIT OUT THE HOUSING INTEREST DYNAMIC, THE BETTER PLAY IS LOWE'S. THERE IS OPERATIONAL SLACK AND LOWE'S IS A MUCH CHEAPER STOCK. DANI: IT IS GREAT TO SEE YOU. I KNOW THAT THE HOME DEPOT READ THROUGH TO OTHER RETAILERS MAY NOT BE A DIRECT 1:1 BECAUSE SO MUCH DEPENDS ON THE HOUSING MARKET, BUT PEOPLE ARE SPENDING. THE RETAIL NUMBERS IN THE U.S. LAST WEEK WERE STILL STRONG, TOO. HOW DOES THAT SET US UP FOR TJX, TARGET, AND OTHER RETAILERS WE ARE BOUND TO GET? > > THERE ARE A FEW INTERESTING. YES, HOME DEPOT WAS STRONG BUT IN SMALLER PROJECTS. PEOPLE ARE STILL RELUCTANT TO TAKE ON REMODELING, LIKE A NEW KITCHEN OR A NEW BATHROOM WHICH WE NEED FINANCING WITH HIGH INTEREST RATES. INTERESTING DYNAMICS IN JULY FED INTO THE RETAIL SALES. THERE WERE A LOT OF DISCOUNTS. AMAZON PRIME DAY AND EVERYONE JOINED IN WITH THEIR OWN OFFERS. WE FOUND CONSUMERS WERE STOCKING UP ON BACK-TO-SCHOOL EARLY. THEY WERE BUYING ESSENTIAL ITEMS FROM THESE DEALS TO TRY TO GET AHEAD OF TARIFFS AND SAVE MONEY. WHEN YOU ARE BUYING THE THINGS YOU NEED ON DISCOUNT, THAT DOESN'T EXACTLY SCREAM CONSUMER CONFIDENCE. DANI: THE WALL STREET JOURNAL REPORTING THIS MORNING THAT MCDONALD'S WILL BE CUTTING THE COMBO MEAL PRICES BY 15%. WE'VE SEEN A LOT OF THE FAST-CASUAL TYPE OF RESTAURANTS NEEDING TO APPEAL TO THE VALUE CONSUMER. ANDREA, TO WHAT DEGREE IS THIS A RETAIL SECTOR THAT NEEDS TO APPEAL TO VALUE CUSTOMERS AND MAY FACE MARGIN PRESSURE BECAUSE OF THAT? ANDREA: EXACTLY. WHAT WE HAVE IS CONSUMERS, THEY WENT THROUGH THE FINANCIAL CRISIS, THROUGH THE PANDEMIC, THROUGH THE SPIKE IN INFLATION AFTER THE PANDEMIC, AND THEY HAVE A READY-MADE PLAYBOOK TO DEAL WITH THIS. IT MIGHT BE JOINING WITH FRIENDS AND FAMILY TO BUY IN BULK FOR A BETTER INPUT PRICE. IT MIGHT BE SALES OR WAITING FOR DISCOUNTS. THEY HAVE BEEN THROUGH THIS BEFORE. TRADING DOWN FROM BRANDS TO PRIVATE LABELS. THE CONSUMER IS GOING INTO THIS WITH A WELL-PREPARED STRATEGY ON HOW TO BEAT INFLATION. THAT MEANS THEY AREN'T GOING TO EAT AS MUCH OF IT AS MAY HAVE BEEN EXPECTED. DANI: AN INTERESTING POINT. WE WILL GET TJX, LOWE'S, AND TARGET EARNINGS ON DECK AND WE WILL LAY OUT THE REST OF YOUR DAY. FED SPEAK AND FED MINUTES COMING UP NEXT IN YOUR TRADING DIARY. STAY WITH US. YOU ARE WATCHING BLOOMBERG TV. ♪ DANI: WELCOME BACK. I AM DANI BURGER IN NEW YORK. LET'S GET YOU SET UP FOR YOUR TRADING DAY. A SLATE OF RETAIL EARNINGS BEFORE THE BELL. TARGET, TJX, AND LOWE'S AFTER HOME DEPOT EARNINGS THAT SOUGHT SHARES MOVE HIGHER. FED SPEAK FROM WALLER AND BOSTIC AT 11:00 A.M. AND 3:00 P.M. EASTERN RESPECTIVELY. 2:00 P.M., THE MINUTES FROM THE LATEST FOMC MEETING, THE FIRST IN MORE THAN 30 YEARS TO SEE TWO DISSENTERS. WE FINALLY GET SOME OF THE DETAILS. INDIVIDUAL STOCKS MOVING AHEAD OF THE MARKET OPEN. NVIDIA IS BOUNCING BACK. YESTERDAY IT FELL 3.5 PERCENT. IT WAS THE WORST A DECLINE IN FOUR MONTHS, DRAGGING DOWN EVERYTHING WITH IT. LOWE'S DOWN 1.3% AHEAD OF THEIR EARNINGS REPORT THIS MORNING. NOVO NORDISK SEEING A DECLINE ABOUT ONE POINT 7%. THERE ARE REPORTS THAT THERE IS A HIRING FREEZE AT THE OZEMPIC MAKER. THEY HAD A TOUGH START GIVEN THE COMPETITION THEY ARE FACING. THEY HAD ONE OF THEIR DRUGS APPROVED FOR LIVER DISEASE, SO THAT IS HELPING THEM OUT IN THE SHORT TERM. AS FOR THE OVERALL STOCK MARKET, IT'S BEEN AN MOMENTUM UNWIND WE HAVE WITNESSED, TECH WITHOUT A SPECIFIC CATALYST THAT I STARTED TO SELL OFF. SOME PEOPLE FLAGGING AND M.I.T. REPORT THAT 95% OF TECH AI INVESTMENTS NOT HAVING A RETURN. EVEN SO, ANOTHER DAY OF WEAKNESS. WILL THIS BE A FOURTH CONSECUTIVE DAY OF DECLINES FOR THIS MARKET? WE ARE DOWN JUST OVER .1% FOR THE S & P AND NASDAQ 100. THE RUSSELL 2000 OUTPERFORMS, LITTLE CHANGED THIS MORNING. FED MINUTES ARE ON DECK AND THEN JACKSON HOLE, A BUSY REST OF THE WEEK. THAT IS IT FOR BLOOMBERG \"BRIEF\" AND SURVEILLANCE WILL BREAK IT DOWN FROM HERE. YOU ARE WATCHING BLOOMBERG TV. ♪",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. TECH STOCKS",
      "weight": 0.056943167
    },
    {
      "name": "OTHER MARKETS",
      "weight": 0.055847395
    },
    {
      "name": "U.S. COMPANIES",
      "weight": 0.05393434
    },
    {
      "name": "GLOBAL MARKETS",
      "weight": 0.050320752
    },
    {
      "name": "CHINA TRADE",
      "weight": 0.049595512
    },
    {
      "name": "U.S. DEFICITS",
      "weight": 0.04951145
    },
    {
      "name": "U.S.",
      "weight": 0.049382474
    },
    {
      "name": "TECH AI INVESTMENTS",
      "weight": 0.04900553
    },
    {
      "name": "MARKETS",
      "weight": 0.048948016
    },
    {
      "name": "U.S. DEBT CONCERNS",
      "weight": 0.048808023
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.98828125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.79296875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.75244140625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.68408203125
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.61083984375
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.56640625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.4462890625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.3544921875
    },
    {
      "name": "/News/World News",
      "score": 0.3544921875
    }
  ],
  "sentiment": {
    "positive": 0.037889037,
    "negative": 0.8208541,
    "neutral": 0.14125684
  },
  "summary": "The US-China Tariff Setup is reportedly working well with the US and China, with the TREASURY SECRETARY BESSENT stating that the TARIFF established with China is working well. NVIDIA's performance has been down to about half of 1% and the S & P is also down, but the NASDAQ is down by only.2%. Meanwhile, the 10-Year YIELD at 43 03 has been at 43.03. NVIDIA is no longer in the red, trading flat. The M.I.T. report has found that 95% of 95 percent of AI PILOT programs used by corporations are failing to generate revenue. The Retail Earnings on Deck includes a report by TARGET and Lowe on the PIMCO to discuss U.S. DEBT concerns and other important topics for the market.",
  "shortSummary": "TARIFFs in China are working well, but global markets are struggling with declining tech sales, especially in NVIDIA, Intel, and bond markets.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "22fddd8e8d384c41a6512e3d47295c38",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Bloomberg Brief highlighted a tech sell‑off after NVIDIA’s worst decline in four months, but markets showed limited momentum loss and a brief rebound in the Nasdaq.  Treasury Secretary Scott Bessent said the current tariff arrangement with China is working well, while the U.S. remains cautious about further trade moves.  Fed minutes are expected to reveal a potential rate cut in September, with market expectations of two cuts this year, amid concerns over a slowing AI‑driven tech rally and a possible bubble.  Other stories included rising UK inflation, Trump’s Treasury revenue from tariffs, and Meta’s heavy AI investment amid a MIT report that 95% of corporate AI spend yields no return.",
  "argos_id": "ZEO2LC4W9"
}