{
  "url": "https://www.makeuseof.com/features-only-tor-has/",
  "authorsByline": "Afam Onyimadu",
  "articleId": "d1a9eb29784841ef9277d01e1104f331",
  "source": {
    "domain": "makeuseof.com",
    "location": null
  },
  "imageUrl": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/12/tor-browser-logo-on-purple-tor-background.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T16:30:16+00:00",
  "addDate": "2025-08-24T16:41:26.231663+00:00",
  "refreshDate": "2025-08-24T16:41:26.231664+00:00",
  "score": 1.0,
  "title": "I Quit Using Tor Browser, but These 5 Features Are Impossible to Replace",
  "description": "Tor spoiled me forever.",
  "content": "I quit using the Tor Browser simply because I lost faith in the project. From malicious or compromised exit nodes to deanonymization exploits, it wasn't the private alternative internet I had hoped it would be. Sadly, there are a few Tor features I have truly missed and have not been able to replace, at least not in a single browser or service.\n\nBrowser fingerprinting is a technique that creates persistent digital profiles of individuals, allowing them to be traced across the web. This tracking is possible because websites you visit may run scripts that gather unique browsing characteristics, details such as device type, operating system, hardware, time zone, and IP address. But for good reason, Tor became the go-to for journalists and whistleblowers who needed to remain anonymous.\n\nHere is why: Tor is able to report all sessions as if they were using the same type of operating system and browser version, making it harder to fingerprint individual users. By default, the Tor Browser also limits or disables APIs like WebGL, Canvas, and AudioContext, which are known to generate unique fingerprints. A fingerprinting test on the Tor Browser will usually show a non-unique or random result.\n\nThis is not the case with many modern browsers. While some may offer fingerprint protection, a lot of them typically require extensive configuration and, in some cases, additional extensions or scripts.\n\nDuring browsing sessions, you start to build a specific type of profile for each session. You accumulate cookies, cached files, and login states. If you have similar habits across sessions, it becomes easier for sites to link past actions with current ones.\n\nTor provides an easy-click New Identity button. This feature instantly severs ties with your current session, making any gathered user habits redundant without the need to restart the browser. It resets all circuits, clears session data, breaks correlation attempts, and provides a strong defense against persistence.\n\nI have used at least a dozen browsers, and this is one feature I have not seen anywhere else. On Brave, for instance, the only way to get close to the New Identity feature is by manually clearing cookies, cache, and site data, then opening a new private window. Even at that, circuits are still not automatically rebuilt or routed through new relays.\n\nWith Firefox's Multi-Account Containers, you get session separation and per-site isolation, but you still don't get a reset of all circuits or network paths as you do with the Tor Browser. Even using VPNs with private browsing will, at best, give you a new IP address but still retain the same cookies, cache, and other browser-level identifiers.\n\nBrowser hardening for added privacy and security has become very common in certain circles. This entails using scripts or extensions to enhance privacy or security, and in some cases, changing a set of configurations in the browser settings. There is just one problem with this approach: the more hardening you do, the less convenient and usable the browser becomes.\n\nYou may quickly notice that some websites break, or certain features on the sites become unusable. In this case, you will have to uninstall scripts or extensions, or revert the settings you adjusted back to their original values. This can be stressful, as you may not remember every single setting.\n\nTor allows you to make these changes by choosing one of three options: Standard, Safer, and Safest. When a website breaks, instead of adjusting multiple settings to restore functionality, you simply switch back to one of these pre-configured privacy levels. It is very convenient.\n\nIf you ever used Tor, you may have tried out a few .onion services. These special website-like services allow the publisher or a user to remain anonymous. They function quite differently from regular websites. Instead of using the Domain Name System (DNS) to resolve human-readable domains into an IP address, .onion services are confined to the Tor network for higher privacy and security.\n\nRegular browsers have no substitute for .onion services, and you must constantly be on the open web when browsing. That said, it's true that you may get similar functionality on the I2P network, Freenet, or ZeroNet. But in each of these alternatives, the size of the repository pales in comparison to what Tor offers.\n\nWith regular browsers, traffic flows from your device to your ISP, and then to the destination server. This is simple, straightforward, and fast. The only downside is that your ISP may see your IP address, DNS requests, and metadata.\n\nTor Browser, however, takes a different approach, and this is a feature I have not seen replicated in other browsers. It routes traffic through three layers: Guard, Middle, and Exit. This is called Onion Routing. Each layer has limited knowledge of the travel routes and information. In this way, your personally identifiable details, such as your IP, are protected, making your online sessions more private and secure.\n\nThese are all great features, and I am often tempted to return to using the Tor Browser. However, I cannot overlook claims that government agencies influence Tor or the numerous cases of malicious exit nodes. These are my personal thoughts. If you quit Tor like I did, are these features a good enough reason to revisit it again?",
  "medium": "Article",
  "links": [
    "https://www.makeuseof.com/how-block-browser-fingerprinting/",
    "https://ip2.network/",
    "https://freenet.org/",
    "https://blog.torproject.org/malicious-relays-health-tor-network/",
    "https://www.makeuseof.com/how-to-make-your-browser-more-private/",
    "https://www.torproject.org/download/",
    "https://www.bbc.com/news/technology-35924859",
    "https://zeronet.io/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Tor Browser",
      "weight": 0.092833586
    },
    {
      "name": "Tor",
      "weight": 0.080991
    },
    {
      "name": "Browser hardening",
      "weight": 0.07049876
    },
    {
      "name": "other browsers",
      "weight": 0.070314616
    },
    {
      "name": "Regular browsers",
      "weight": 0.06965118
    },
    {
      "name": "regular browsers",
      "weight": 0.06965118
    },
    {
      "name": "Browser fingerprinting",
      "weight": 0.06895577
    },
    {
      "name": "browser version",
      "weight": 0.06812852
    },
    {
      "name": "browsing sessions",
      "weight": 0.06717102
    },
    {
      "name": "certain features",
      "weight": 0.0665738
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Computer Security/Network Security",
      "score": 0.53173828125
    },
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.5244140625
    },
    {
      "name": "/Computers & Electronics/Programming/Other",
      "score": 0.32177734375
    },
    {
      "name": "/Reference/Technical Reference",
      "score": 0.3095703125
    }
  ],
  "sentiment": {
    "positive": 0.08749044,
    "negative": 0.52174246,
    "neutral": 0.39076707
  },
  "summary": "The article discusses the reasons I quit using the Tor Browser due to its lack of privacy and security features, including a New Identity button that instantly removes ties with current session without restarting the browser. The Tor Browser's ability to report all sessions as if they were using the same type of operating system and browser version, making it harder to fingerprint individual users and limiting or disabling APIs like WebGL, Canvas, and AudioContext, which generate unique fingerprints. The author also notes that while some modern browsers offer fingerprint protection, many require extensive configuration and additional extensions or scripts. Despite this, Tor allows users to make changes to their browser when a website breaks, allowing them to revert to one of these pre-configured privacy levels. The article concludes that while using Tor's privacy features, the more difficult and convenient approach to achieve this, the less convenient and usable nature of the browser becomes.",
  "shortSummary": "The Tor Browser's key features, including fingerprinting, privacy protections, and easy-click New Identity button, can't replace modern browsers without extensive security and configuration adjustments.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "868fc67d7a3142758248d5977c658d96",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.makeuseof.com/how-block-browser-fingerprinting/",
      "text": "Quick Links\nBrowser fingerprinting tracks and identifies you based on the unique characteristics of your browser and device. Unlike cookie-based tracking, browser fingerprinting is more invasive, but thankfully, you can protect yourself against it using these methods.\n1 Use Popular Browsers With No Extensions Installed\nOne of the easiest ways to protect yourself from fingerprinting is through camouflage. This works like a charm because of the way browser fingerprinting works; it identifies how unique your browser characteristics are versus everyone else.\nIn this case, uniqueness is based on different attributes of your device and browser, which are used to create your fingerprint. The more unique your device, device settings, browser, browser preferences, browser add-ons, fonts, and other attributes are, the easier it is to identify you among the crowd.\nYou can achieve camouflage by using any of the most popular browsers on the market and not installing extensions. The second part is important because the general population doesn't use extensions (even ad-blockers, though they're the most commonly used extensions). According to Statscounter, the most popular browsers as of October 2024 (arranged from most to least popular) include Google Chrome, Safari, Microsoft Edge, and Mozilla's Firefox.\n2 Switch to Privacy-Focused Browsers\nThe first option might not be viable if you require extensions installed in your browser for a good browsing experience or if your job requires one. The easiest alternative to protect yourself against browser fingerprinting is to switch to privacy-focused browsers.\nExamples include Firefox, Brave, DuckDuckGo, and Tor, all of which have built-in blockers for fingerprinting scripts. These blockers allow you to use your browser with any extensions that you need without giving away your identity. But these four are not the only options; there are other anonymous browsers.\n3 Use Privacy-Enhancing Extensions and Add-Ons\nBesides switching to a privacy-focused browser, another way to avoid browser fingerprinting is to install privacy-enhancing extensions that specifically block fingerprinting. However, keep in mind that the number of all-in-one extensions that can block all fingerprinting methods is limited.\nFor example, Privacy Badger can only detect and block canvas-based fingerprinting as of this writing. The same applies to the Canvas Blocker extension. The only extension that offers protection against different fingerprinting techniques as of now is All Fingerprint Defender.\nDownload: Privacy Badger for Firefox | Edge | Chrome | Opera\nDownload: Canvas Blocker for Chrome | Edge\nDownload: All Fingerprint Defender for Chrome\n4 Disable JavaScript\nMany fingerprinting techniques rely on JavaScript to obtain details about your device and browser profile. As such, disabling JavaScript can help block fingerprinting. However, before you do it, this method isn't perfect because it will break some websites that rely on JavaScript to render content.\nIf you go this route and face any issues viewing a given website, you'll need to enable JavaScript again, which can be extra work. That's why we list this as the last option for preventing fingerprinting.\nThe steps for disabling JavaScript vary from browser to browser. For instructions on how to do so, check out our article on how to disable JavaScript in Chrome, Edge, and Firefox. You can also disable JavaScript in Tor and any other browser.\nBrowser fingerprinting is way more invasive than cookie-based tracking as it relies on profiling your device specifications and browser characteristics. Because of its nature, browser fingerprinting can be hard to keep at bay. However, you can clamp it down using the four methods above."
    },
    {
      "url": "https://freenet.org/",
      "text": "Freenet is the internet as it should be—fully decentralized, designed to put you back in control. Imagine a global shared computer where you can communicate and collaborate freely, without reliance on big tech. Freenet lets you regain your digital independence.\nFreenet is a peer-to-peer network that transforms users’ computers into a resilient, distributed platform on which anyone can build decentralized services. Every peer contributes to a fault-tolerant collective, ensuring services are always available and robust.\nToday’s web is a series of siloed services, but every system built on Freenet is fully interoperable by default. Freenet apps can be built with popular web frameworks, accessed through any browser just like the web.\nUseful Links\nNews\n- April 10, 2025 - Developer Meeting\n- February 7, 2025 - Weekly Developer Meeting\n- December 23, 2024 - Weekly Developer Meeting\n- November 30, 2024 - Understanding Freenet's Delta-Sync\n- November 25, 2024 - Understanding Small World Networks"
    },
    {
      "url": "https://zeronet.io/",
      "text": "ZeroNet\nOpen, free and uncensorable websites,\nusing Bitcoin cryptography and BitTorrent network\nPeer-to-Peer\nYour content distributed directly to other visitors without any central server.\nUncensored\nIt's nowhere because it's everywhere!\nNo hosting costs\nSites are served by visitors.\nAlways accessible\nNo single point of failure.\nSimple\nNo configuration needed:\nDownload, unpack and start using it.\n.bit domains\nDecentralized domains using Namecoin cryptocurrency.\nNo passwords\nYour account is protected by the same cryptography as your Bitcoin wallet.\nFast\nPage response time is not limited by your connection speed.\nDynamic content\nReal-time updated, multi-user websites.\nWorks everywhere\nSupports any modern browser on\nWindows, Linux or Mac platforms.\nAnonymity\nYou can easily hide your IP address using the Tor network.\nOffline\nBrowse the sites you're seeding even if your internet connection is down.\nOpen Source\nDeveloped by the community for the community."
    },
    {
      "url": "https://www.bbc.com/news/technology-35924859",
      "text": "FBI resists call to reveal Tor hacking secrets\n- Published\nThe FBI is resisting calls to reveal how it identified people who used a child pornography site on the Tor anonymising network.\nThe agency was ordered to share details by a Judge presiding over a case involving one alleged user of the site.\nDefence lawyers said they need the information to see if the FBI exceeded its authority when indentifying users.\nBut the Department of Justice (DoJ), acting for the FBI, said the details were irrelevant to the case.\n\"Knowing how someone unlocked the front door provides no information about what that person did after entering the house,\" wrote FBI agent Daniel Alfin in court papers filed by the DoJ which were excerpted on the Vice news site, external.\nIdentity parade\nThe Judge ordered the FBI to hand over details during a court hearing in late February.\nThe court case revolves around a \"sting\" the FBI carried out in early 2015 when it seized a Tor-based site called Playpen that traded in images and videos of child sexual abuse. The agency kept the site going for 13 days and used it to grab information about visitors who took part in discussion threads about images of child abuse.\nTor, aka The Onion Router, aims to hide the identity of people who use it by bouncing traffic through many different routers and encrypting it at each step. As well as letting people browse the web anonymously it has also given rise to hidden sites that sit on the Tor network.\nThe defence team is keen to see if the FBI's use of technical tricks to identify people on Tor exceeded the authorisations it got in a warrant to run the sting. It has argued that the investigative technique used by the FBI amounted to \"gross misconduct\".\nThe lawyers also want more details to ensure that their client has been properly identified.\nIn its legal filing, Mr Alfin said defence lawyers were \"wrong\" to think more information would help them work out if the FBI went further than it was allowed. It said the FBI had already provided details for the defence experts to work this out.\nHe also said he was confident that the defendant was properly identified. The DoJ documents conclude by asking the Judge to reconsider the order to reveal more information.\n- Published25 February 2016\n- Published19 February 2016\n- Published19 November 2015\n- Published12 November 2015"
    },
    {
      "url": "https://blog.torproject.org/malicious-relays-health-tor-network/",
      "text": "Malicious relays and the health of the Tor network\nRunning relays is a significant contribution to our project and we've designed that process so that the barrier of entry is low, making it possible for a variety of people with different backgrounds to participate. This openness is important as it makes our network (and the privacy guarantees it offers) more robust and resilient to attacks. However, that low threshold of contributing to our network also makes it easier for malicious operators to attack our users, e.g. via Man-in-the-Middle (MitM) attacks at exit nodes.\nThis blog post explains what we're doing to detect malicious actors (and remove their relays), how we developed these strategies, and what we're working on to make it harder for bad operators to run attacks. Additionally, we want to shine some light on this part of our day-to-day work at Tor. Because this is an arms race, we have to balance being transparent with effective detection of malicious actors. In this post we hope to offer more transparency about our approach without compromising the methods we use to keep our users safe.\nWhat does bad-relay work look like?\nWhether a relay is \"bad\" or \"malicious\" is often not as clear-cut as it might sound at first. Maybe the relay in question is just misconfigured and is, e.g., missing family settings (for the family configuration option see section 5 in our post-install instructions). Does that mean the operator has nefarious intentions? To help us react to those situations, we have developed a set of criteria and a process for dealing with potentially bad relays. Now, when we get a report or detect suspicious behavior, we follow that process. First, we try to fix the underlying issue together with the operator, and if that does not work or the behavior is outright malicious, we propose the relay for rejection (or maybe assigning the badexit\nflag).\nThere is an important point here to be made about the process of removing relays from the network: while we do have staff who are watching the network and reviewing reports from volunteers, it is not Tor staff who reject relays (and that is by design). Instead, rejecting relays from the network is the job of the directory authorities. Directory authorities are special-purpose relays that maintain a list of currently-running relays and periodically publish a consensus together with the other directory authorities. Directory authorities are run mostly by trusted volunteers from our community. They rely on recommendations from the Network Health team to evaluate and address malicious relays, but they only reject a potentially malicious relay if the majority of directory authorities agree to do so.\nKAX17 and failures in the past\nIn December 2020, we noticed a weird pattern in our relay graphs. This pattern showed that dozens of relays would join the network on 00:00:00 at the first of a month just to vanish slowly again. This had been ongoing for months before we saw that pattern, and when we noticed it, we speculated that we were witnessing a bug in Tor's hibernation code.\nThen in early September 2021, based on our own monitoring and investigation, we saw some unusual relay additions to our network that caught our attention: relays that seemed to belong to a single operator were showing up, but they did not have a family declaration. Moreover, there was no way to contact the operator as the contact information field was empty. Based on the set of criteria for dealing with potentially bad relays we had established, we proposed that these relays be rejected from the network, and the directory authorities approved this rejection. As soon as these relays were rejected, though, similar relays kept showing up on the network which then in turn got rejected as well.\nAt the end of October 2021, we got a tip from an anonymous Tor user who helped us to eventually detect and remove a relay group that was later dubbed \"KAX17\". We don't know who was running those relays or what they were doing or trying to achieve (their behavior was quite different from the more well-known attack where malicious exit relay operators are trying to do MitM-attacks on our users). However, after we kept a close eye on KAX17 relays, both the spikes at the begin of each month and the relay flooding stopped, and it's fair to assume that the KAX17 operator was responsible for both of them as well.\nThe KAX17 operator was active for months, maybe years, on the network. How is that possible?\nThere are three important reasons for that failure on our side worth highlighting here:\nFirstly, while it is always way easier to connect different dots like the ones above in hindsight, our failure to do so should remind us that we invested too little effort in our bad-relay tooling over the last several years. In particular, we did not monitor the network closely enough to understand which kind of tools we might still be missing or would be needed most.\nSecondly, fighting and removing malicious relays requires trust between all involved parties (volunteers, Tor staff, and directory authorities) and that trust was missing from time to time, creating friction and frustration, which in turn made the work to detect and reject bad relays even harder.\nThirdly, and most importantly, we were not set up as an organization to work effectively on detecting and removing malicious relays: we lacked resources to broaden our detection mechanisms and to enhance our relay policies, network monitoring, and community outreach. Even though the previous two reasons were affected by this as well, the organizational shortcoming deserves to be a separate item on this list.\nLessons learned\nJanuary 2020, we launched the Network Health team at Tor with the goal to get our work related to monitoring the network and the health of our relays up to speed and organized. This included bad-relay work. While having dedicated staff working in that area is important, it is no remedy to the third item of the list above by itself. We needed to set up policies for our day-to-day work that matched expectations related to the trust angle mentioned above. Additionally, in the past, the Tor Project teams worked in silos. We needed to increase coordination between teams to do this work effectively. In particular, working closely with the Community team has given us another very efficient tool in our fight against malicious relays.\nBeyond increasing coordination and organization, we developed new tools that help in the fight against exit relays doing MitM- attacks on our users and in proactively detecting groups of potentially malicious relays. We believe that this proactive stance has significantly raised the bar for malicious operators entering the network during the past months which is an exciting development in this arms race.\nMany of the improvements discussed above come from organizing our work in new ways, like opening lines of communication and coordination between teams. These improvements are also possible because of the investment of our donors and funders. We were able to increase capacity and stability with additional funding and the support of our community. Thank you to everyone who has made a donation in the last few years; you've made it possible for us to fight back and keep users safe.\nWhat is coming up next?\nWe believe we have ramped up our bad-relay work significantly during the past year and we are moving in promising directions. Coordinating with the Tor Browser team resulted in Tor Browser 11.5 (due later this year) that will ship an HTTPS-Only mode enabled by default, which should help tremendously in the arms race with exit relays trying to MitM user connections: while we do have several defenses in place against those attacks, we believe that HTTPS-Only mode in Tor Browser will be a game-changer as it will strongly reduce incentives to spin up exit relays for MitM attacks in the first place. You can try out a recent desktop alpha release where this change is already getting some testing (and please report any bugs you find so we can improve the HTTPS-Only user experience where needed).\nWe are in particular excited about upcoming funding for work on more tools in our bad-relay toolbox including new and improved ways of monitoring our network, but also building a stronger relay operator community, given that just relying on monitoring tools is not a sufficient strategy in the bad-relay area. A stronger relay community is an essential building block in our longer-term plan to limit large-scale attacks on the network which we hope making progress on in the upcoming months and years.\nSo, stay tuned!\nPlease remember: if you witness malicious relays in our network, please report them to us for our users' safety sake to bad-relays[@]lists[.]torproject[.]org. We need everyone staying vigilant and helping to keep our users safe as malicious operators are trying to adapt their strategies to get around our defenses.\nComments\nWe encourage respectful, on-topic comments. Comments that violate our Code of Conduct will be deleted. Off-topic comments may be deleted at the discretion of the moderators. Please do not comment as a way to receive support or to report bugs on a post unrelated to a release. If you are looking for support, please see our FAQ, user support forum or ways to get in touch with us."
    },
    {
      "url": "https://www.makeuseof.com/how-to-make-your-browser-more-private/",
      "text": "I dug into my browser's settings and explored other options to make it a bit more private, which has made me feel better about all the hours I spend surfing the internet. Here are a few simple steps to privacy-proof your browser, just like I did.\n1 Use Your Browser's Built-in Privacy Features\nOne of the easiest ways I've made my browsing experience more private is by launching my browser in Incognito Mode. It keeps your browsing history, cookies, and site data from being stored on your device once you close the session. However, remember that this doesn't stop websites from tracking you or your internet service provider (ISP) from seeing what you're doing.\nMost browsers have a feature that warns you when you're about to visit a website known for being risky, whether it's trying to steal your data or infect your device with malware. On Chrome, it's called Enhanced Safe Browsing. Firefox calls it Phishing Protection. And if you use Microsoft Edge, it is called Enhanced Security mode. To enable it, go into the settings and look for this feature—steps will vary depending on your browser.\nI also swapped out Google as my default search engine for something more privacy-focused. There are privacy-focused search engines out there, like DuckDuckGo or Startpage, that don't track your search history or build a creepy profile about you.\nLastly, depending on your browser, you can tweak settings to limit the data advertisers collect (like your browsing activity) or even opt out of personalized ads altogether, which I've found incredibly useful. You can also block third-party cookies, which are notorious for following your every move online and reporting to advertisers and data brokers.\n2 Configure Browser Settings to Maximize Privacy Protection\nYou can start by turning off \"Enhanced Spell Check\" in your browser. This feature sends everything you type to Google's servers for analysis. That's not just searching for spelling mistakes—any form you fill out, any password you mistype, any search you make—all of it could potentially be sent off to the cloud.\nI used to think search suggestions were super convenient with features like \"Improve Search Suggestions\" and \"Make Searches and Browsing Better\" enabled. I start typing \"how to make,\" and before I even finish, it's suggesting \"pancakes,\" \"money,\" and \"your ex jealous.\" But then I realized these search suggestions could potentially send my search queries to the cloud. So, I switched this off to stop auto-suggest in my browser with its (sometimes wildly inaccurate) guesses about what I'm searching for. Sure, it means I have to type a few more letters before hitting enter, but I'll trade that for more privacy any day.\nI've also made it a rule to review site permissions regularly and deny access to anything—location, camera, microphone, or notifications—that feels unnecessary. While there are legitimate reasons some sites need access to these (like video calls or maps), others are just being nosy.\n3 Regularly Clear Browser Data\nI make it a habit to clear my browser data whenever I'm done using my browser. I don't mind logging back into a few websites if it means I keep prying eyes at bay. Plus, it's refreshing to know that my browser isn't holding onto a miniature archive of everything I've looked at over the past month.\nMost browsers let you automate this process, so you can set it up to clear cookies and cache every time you close your browser.\n4 Use Privacy-Enhancing Extensions\nYou can install a few privacy-enhancing browser extensions that work behind the scenes to block trackers, ads, and other shady stuff trying to follow you around the web. If you're wondering whether using these extensions will slow down your browser, I don't think so. In fact, because they're blocking so much junk from even loading in the first place (like ads and tracking scripts), my pages often load faster. It's a win-win: better privacy and a smoother browsing experience.\nIf you're new to using extensions, don't go overboard. You don't need to install every privacy-related extension out there. Too many extensions can sometimes cause issues with websites not loading properly, so it's all about finding the right balance.\n5 Use a VPN\nISPs are notorious for collecting user data, selling it to advertisers, or even sharing it with the government. And let's not forget the risks when you connect to public Wi-Fi networks—the kind you find at your local coffee shop or airport—where bad guys can intercept your data. A VPN turns that sketchy public Wi-Fi into a much safer experience.\nThere are many good VPN services out there, but I recommend going with one with a no-logs policy (this means they don't keep records of your online activity). Be cautious of free VPNs, too. They often come with major security trade-offs, like collecting and selling your data themselves.\n6 Use a Privacy-Focused Browser\nIf you're using a mainstream browser like Chrome, you might want to consider the trade-off you're making for convenience. Google's Chrome is fast, reliable, and, well, everywhere. But here's the catch: Chrome is owned by Google, a company whose business model revolves around collecting and monetizing your data. That means unless you take steps to tighten your privacy, your browsing history, searches, and habits are all feeding into a massive data-collection machine that's used to target ads and track you across the web.\nThankfully, several browsers built with privacy in mind, like Brave and LibreWolf, are available. Switching to one of them could save you the hassle of beefing up privacy settings on your current browser."
    }
  ],
  "argos_summary": "The author explains why they stopped using Tor Browser, citing concerns over malicious exit nodes and deanonymization, but also highlights unique features such as fingerprinting protection, the New Identity button, and onion routing that other browsers lack. They compare Tor to privacy‑focused alternatives like Brave, Firefox containers, and decentralized networks (I2P, Freenet, ZeroNet), noting the trade‑offs in convenience and coverage. The article reviews recent Tor network security updates, including detection of malicious relays, the launch of HTTPS‑Only mode, and ongoing efforts to improve network health. Finally, it offers practical tips for enhancing browser privacy, from disabling JavaScript to using privacy‑focused browsers and VPNs.",
  "argos_id": "ZQ5S8SBKK"
}