{
  "url": "https://www.reuters.com/world/china/global-markets-wrapup-5-2025-08-29/",
  "authorsByline": "Caroline Valetkevitch",
  "articleId": "0c50b3dcd1f447458d2a62e1cf0ac7ee",
  "source": {
    "domain": "reuters.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.reuters.com/resizer/v2/VI6OEDUNZNJ3PG3KHSBM3ZYTQQ.jpg?auth=73260690e5a356bcf3a34fc2d9aba747c7928bfa3d7fc83d47e4b24b123c1810&height=1005&width=1920&quality=80&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-29T02:33:06.411000+00:00",
  "addDate": "2025-08-29T16:16:44.243950+00:00",
  "refreshDate": "2025-08-29T16:16:44.243956+00:00",
  "score": 1.0,
  "title": "Stocks decline, US Treasury yields rise; US inflation data mostly in line",
  "description": "Major stock indexes eased while U.S. Treasury yields rose on Friday, with U.S. inflation data largely in line with economists' views and keeping expectations of a September interest rate cut intact.",
  "content": "LONDON, Aug 29 (Reuters) - Major stock indexes eased while U.S. Treasury yields rose on Friday, with U.S. inflation data largely in line with economists' views and keeping expectations of a September interest rate cut intact.\n\nU.S. stock index futures trimmed losses after the data, while the U.S. dollar index pared gains a little. But the S&P 500 was last down 0.7%, with technology shares leading the way lower. Shares of Dell Technologies (DELL.N) were down more than 9% following its results and guidance.\n\nThe U.S. Commerce Department said on Friday its Personal Consumption Expenditures Price Index (PCE) 0.2% in July, versus an unrevised 0.3% increase in June and matching the estimate of economists polled by Reuters.\n\nIn the 12 months through July, PCE inflation increased 2.6% after climbing 2.6% in June. Stripping out the volatile food and energy components, the so-called core PCE Price Index increased 0.3% last month. That followed a 0.3% rise in the core inflation in June.\n\n\"You have to love it when a plan comes together. Today's numbers on both the personal consumption, expenditure, and income, and spending, were right down the middle of the fairway,\" Art Hogan, chief markets strategist for B. Riley Wealth in Boston, said via email.\n\n\"This leaves the door wide open for the Fed to cut rates in September and likely again in October and in December.\"\n\nFed funds futures traders are now pricing in 89% odds of a cut next month, up from 84% before the data.\n\nTraders had increased bets on more cuts after Fed Chair Jerome Powell last Friday adopted an unexpectedly dovish tone.\n\nThe Dow Jones Industrial Average (.DJI) fell 205.66 points, or 0.45%, to 45,431.24, the S&P 500 (.SPX) fell 44.52 points, or 0.68%, to 6,457.34 and the Nasdaq Composite (.IXIC) fell 232.19 points, or 1.07%, to 21,472.97.\n\nMSCI's gauge of stocks across the globe (.MIWD00000PUS) fell 5.43 points, or 0.57%, to 950.91.\n\nThe pan-European STOXX 600 (.STOXX) index fell 0.53%.\n\nEarlier, shares in China (.CSI300) notched up their best month in almost a year with a more than 10% gain on hopes that its economy, especially the tech sector, is picking up.\n\nThe euro was last down 0.19% at $1.166. Against the Japanese yen , the dollar strengthened 0.2% to 147.22. The dollar index , which measures the greenback against a basket of currencies, was up slightly at 98.06.\n\nWhile U.S. Treasury yields rose on the day, interest rate sensitive two-year yields were on track for their largest monthly drop in a year, with major U.S. financial markets closed for the Labor Day holiday on Monday.\n\nThe 2-year note  yield was last up 0.2 basis points on the day at 3.637%. It has fallen 32 basis points this month, the most since last August.\n\nThe yield on benchmark U.S. 10-year notes  rose 2.3 basis points to 4.23%.\n\nGermany's 30-year yield , which touched its highest since 2011 earlier in August, has risen 12 basis points this month, putting it on track for its biggest monthly jump since March, when a historic move towards looser fiscal policy sent bond yields surging. Bond yields move inversely with prices.\n\nFed Governor Christopher Waller on Thursday said he wanted to start cutting interest rates next month and \"fully expects\" more rate cuts to follow, to bring the Fed's policy rate closer to a neutral setting.\n\nOil prices were lower but set for a weekly gain. U.S. crude fell 0.33% to $64.39 a barrel and Brent fell to $68.24 per barrel, down 0.55% on the day.",
  "medium": "Article",
  "links": [
    "https://www.reuters.com/markets/quote/.IXIC",
    "https://www.reuters.com/business/finance/feds-waller-sees-rate-cuts-over-next-3-6-months-starting-september-2025-08-28/",
    "https://amers1-apps.platform.refinitiv.com/web/apps/quotewebapi?RIC=US2YT=RR",
    "https://www.reuters.com/markets/quote/.SPX",
    "https://www.reuters.com/markets/quote/.DJI",
    "https://www.reuters.com/markets/quote/.CSI300",
    "https://amers1-apps.platform.refinitiv.com/web/apps/quotewebapi?RIC=US10YT=RR",
    "https://amers1-apps.platform.refinitiv.com/web/apps/quotewebapi?RIC=DE30YT=RR",
    "https://www.reuters.com/markets/companies/DELL.N",
    "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
    "https://www.reuters.com/markets/quote/.MIWD00000PUS",
    "https://www.reuters.com/world/germany/",
    "https://www.reutersagency.com/en/licensereuterscontent/?utm_medium=rcom-article-media&utm_campaign=rcom-rcp-lead",
    "https://www.reuters.com/markets/quote/.STOXX"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. Treasury yields",
      "weight": 0.087235264
    },
    {
      "name": "more rate cuts",
      "weight": 0.0839291
    },
    {
      "name": "U.S. stock index futures",
      "weight": 0.0830385
    },
    {
      "name": "U.S. inflation data",
      "weight": 0.080669075
    },
    {
      "name": "interest rates",
      "weight": 0.07334307
    },
    {
      "name": "U.S. financial markets",
      "weight": 0.07291642
    },
    {
      "name": "US Treasury yields",
      "weight": 0.07274992
    },
    {
      "name": "U.S. Treasury",
      "weight": 0.07222519
    },
    {
      "name": "more cuts",
      "weight": 0.07027643
    },
    {
      "name": "Bond yields",
      "weight": 0.069979705
    }
  ],
  "topics": [
    {
      "name": "Inflation"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "World"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9912109375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.89892578125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.78662109375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.7421875
    }
  ],
  "sentiment": {
    "positive": 0.023915607,
    "negative": 0.9142335,
    "neutral": 0.061850898
  },
  "summary": "US stock indexes and the dollar index all dropped following inflation data, largely in line with economists' views. The Commerce Department reported that the Personal Consumption Expenditures Price Index (PCE) rose 0.2% in July, compared to an unrevised 0.3% increase in June. The S&P 500 was last down 0.7%, with technology shares leading the way lower. The core PCE Price Index increased 0. 3% last month, and this follows a rise of 0.4% for June. Fed funds futures traders are now pricing in 89% odds of a cut next month, up from 84% before the data. Meanwhile, shares in China had their best month in almost a year with a more than 10% gain.",
  "shortSummary": "US stock markets and Treasury yields rose as inflation data indicated potential interest rate cuts, with expectations remaining high amid falling oil prices and rising bond yields.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "15b2a2e96d5f4399b9d858102789ff42",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
      "text": "The Trust Principles\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity, and freedom from bias in the gathering and dissemination of information and news.\nTrust Principles – the history\nThe Trust Principles were created in 1941, in the midst of World War II, in agreement with The Newspaper Proprietors Association Limited and The Press Association Limited (being the Reuters shareholders at that time). The Trust Principles imposed obligations on Reuters and its employees to act at all times with integrity, independence, and freedom from bias.\nReuters Directors and shareholders were determined to protect and preserve the Trust Principles when Reuters became a publicly traded company on the London Stock Exchange and Nasdaq. A unique structure was put in place to achieve this. A new company was formed and given the name 'Reuters Founders Share Company Limited', its purpose being to hold a 'Founders Share' in Reuters.\nThe legal structure has evolved over time and the Founders Share and other contractual arrangements now confer a number of special rights upon the Thomson Reuters Founders Share Company. For example, (i) the Thomson Reuters Founders Share Company has enhanced voting rights in circumstances where someone is seeking to obtain a significant shareholding in, or acquire control of, Thomson Reuters and (ii) the prior consent of the Thomson Reuters Founders Share Company must be sought prior to undertaking any sale of, or other material transaction involving, the Reuters news business unit.\nThomson Reuters itself is obliged and committed to apply the Trust Principles to its operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the Thomson Reuters business and require Thomson Reuters Directors, in the performance of their duties, to have due regard to the Trust Principles, by the proper exercise of their powers and in accordance with their other duties as Directors.\nThe Trust Principles are:\n- That Reuters shall at no time pass into the hands of any one interest, group, or faction;\n- That the integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved;\n- That Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers and to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts;\n- That Thomson Reuters shall pay due regard to the many interests which it serves in addition to those of the media; and\n- That no effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business\nThomson Reuters Founders Share Company was established in 1984 when Reuters became a public company. The directors of Thomson Reuters Founders Share Company (known as ‘Trustees’) have a duty to ensure, to the extent possible, that the Trust Principles are complied with.\nThe Trustees are experienced and eminent people from diverse arenas in politics, diplomacy, media, public service and business. The Trustees are selected by a nomination committee and proposed to the board of the Thomson Reuters Founders Share Company for appointment. The nomination committee assists in scrutinizing candidates’ suitability and its members include two persons appointed by the chairman after consultation with the European Court of Human Rights and representatives of certain press associations. The Thomson Reuters Corporation board has two representatives on the nomination committee. The Chairman and Deputy Chairman of the Thomson Reuters Founders Share Company Board are members of the nomination committee, and the Chairman appoints three other directors of the Thomson Reuters Founders Share Company as members of the nomination committee. The Chairman of the Thomson Reuters Founders Share Company acts as chairman of the nomination committee.\nThe number of Trustees has to be at least 14 and not more than 18. Trustees have a minimum of two meetings per year, and receive reports on our activities in the different fields in which we operate (including Reuters news). The Trustees meet with both the Thomson Reuters Board and representatives of senior management. Through Thomson Reuters Founders Share Company's Chairman, regular contact is maintained with our company. The relationship is one of trust and confidence.\nIndependence of Thomson Reuters\nCustomers across the world depend on us to provide them with reliable and objective news and information.\nThis means that we have a special need to safeguard our independence and integrity and avoid any bias which may stem from control by specific individuals or interests.\nThe Thomson Reuters Trust Principles were adopted in 1941 and include the preservation of integrity, reliability of news, development of the news business, and related principles.\nToday, the Trust Principles are fundamental to our entire business.\nMore information\nContact us\nBrian Moss\nFor inquiries pertaining to Reuters reporting standards and the Trust Principles please email: brian.moss@thomsonreuters.com."
    }
  ],
  "argos_summary": "U.S. stock indices slipped as Treasury yields rose, following a PCE inflation reading that matched expectations and kept September rate‑cut bets alive. The core PCE rose 0.3% in July, supporting the Fed’s dovish stance and raising odds of a September cut to 89%. While the 2‑year yield fell 32 bps this month, the 10‑year climbed 2.3 bps to 4.23%. Oil prices edged lower, and the dollar index ticked up slightly at 98.06.",
  "argos_id": "97MD1FHW8"
}