{
  "url": "https://www.latimes.com/world-nation/story/2025-08-29/south-korea-exports-its-convenience-stores",
  "authorsByline": "Max Kim",
  "articleId": "e9b9b49f670748dab53c290c6b65aef6",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/266dd10/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F14%2Fb0%2F16d75617430882a21f78d1405335%2F1518417-fg-south-korea-covenience-stores-th-157.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-29T10:00:00+00:00",
  "addDate": "2025-08-29T10:04:11.725323+00:00",
  "refreshDate": "2025-08-29T10:04:11.725324+00:00",
  "score": 1.0,
  "title": "70 new food items each week? South Korea is the convenience store capital of the world",
  "description": "TVs, gold bars, cocktails and up to 70 new food items each week: South Korea's convenience stores are not like ours.",
  "content": "In many parts of the world, convenience stores are the shops of last resort: cigarettes, sodas and laundry detergent. But in South Korea, you might find single malt whiskies, $800 French wines, 24K gold bars, shampoo and conditioner refill stations, televisions or a dine-in instant noodle bar with more than 200 varieties of ramyon.\n\nA customer might be able to pick up a package, wash and dry their clothes, or sign up for a new debit card.\n\nThe stores are best known for their numerous feats of “instant-izing” food, a process in which nearly every conceivable dish is turned into a packaged meal: spaghetti, Japanese udon, fried rice that you squeeze out of a tube. These have turned convenience stores into a $25-billion industry in South Korea and those food products are churned out at a staggering pace: up to 70 new food items hit the shelves each week, effectively offering a live feed of South Korean tastes.\n\n“In South Korea’s food retail market, you go extinct if you’re not quick to change,” says Chae Da-in, who says her obsession with convenience stores is decades old. “It’s all about being diverse and fast.”\n\nKnown in the national media and on social media as a “convenience store critic,” Chae is the author of three books on the world of convenience store foods, which has led to TV appearances and newspaper interviews.\n\nEvery Friday, she tours a handful of convenience stores near her home to keep up with what’s new. Over the last two decades, she estimates she has consumed at least 800 varieties of convenience store samgak gimbap — rice wrapped in dried seaweed and a grab-and-go staple.\n\nIn recent years, Chae has watched her obsession go global. Much like South Korean movies, TV shows and music, South Korean convenience stores have become a cultural sensation.\n\nSpecific locations, such as the store that appeared in Netflix’s hit series “Squid Game,” have made the news. On TikTok and YouTube, mukbang — videos of people eating — of South Korean convenience store foods have gathered millions of views.\n\n“Giant cheese sausage,” announces one reviewer in a TikTok video series titled “ONLY Eating Food from a Korean Convenience Store.” The meal also includes blue lemonade that comes in a plastic pouch, a “3XL” spicy tuna mayo samgak gimbap and a carbonara-flavored Buldak (“fire chicken”) noodle cup.\n\nSouth Korean convenience stores are now expanding into nearby countries such as Mongolia or Malaysia. CU, one of the country’s leading operators with more than 600 stores in Asia, is set to open its first U.S. location in Hawaii later this year.\n\n“The percentage of the Asian population in Hawaii is six times that of the mainland U.S., making it a place where there is a high level of familiarity and positive attitudes toward Korean culture,” said Lim Hyung-geun, the head of overseas operations at BGF Retail, CU’s parent company.\n\n“On top of that, we’re seeing the sustained popularity of Korean culture, such as a Korean food boom among American teenagers and young people in their 20s and 30s, which we believe will be a big boost for CU’s future expansion.”\n\nLim calls CU’s overseas locations “‘miniature South Koreas’ where people can experience the products that have become popular with the K-wave.\n\n“But as is the case here, K-convenience stores aren’t just a place to experience South Korean culture,” he said. “They are also restaurants, cafes and a general amenity.”\n\nIn other words, everything stores that are everywhere and open all the time.\n\nLike many things South Korea has embraced and spun off into something novel, convenience stores are an import to the country. The first such store was American — the Southland Ice Co., which was founded in Texas in 1927 and changed its name to 7-Eleven in 1946. The first of the 7-Elevens opened for business in Seoul in the 1980s.\n\nToday, South Korea is the convenience store capital of the world. Like the bodegas of New York, they have become part of the fabric of contemporary urban life, multifunctional spaces that can be restaurants or coffee shops or bars with microwaves and outdoor seating. Chae calls them the “oasis of the streets.”\n\n“People hang out in convenience stores,” she said. “They’ve become a social place.”\n\nPart of what makes them such a force in the country is their sheer numbers.\n\nThere are around 55,000 convenience stores in South Korea — a country the size of Indiana — amounting to one convenience store for every 940 people. In Seoul, where their numbers have quadrupled in the last 15 years, it sometimes feels like there’s one on every corner.\n\nMuch of this has to do with the fact that roughly one in every four workers in South Korea is self-employed, a high number relative to other developed countries. For those in this mom-and-pop economy, which includes older workers pushed into early retirement or others who have been boxed out of the traditional labor market, convenience stores offer the most accessible form of entrepreneurship.\n\n“Compared to the hundreds of thousands it would cost to open another business, the main draw of convenience stores is that you can open one with starting capital as little as 20 million won [$14,000],” said Oh Sang-bong, the head of social policy research at the Korean Labor Institute. “Of course it’s not easy. There are a lot of cautionary tales. But there are success stories, too.”\n\nThis profusion has made the convenience store business one of the most fast-paced and competitive in the country — one that moves in lockstep with boom-and-bust social media attention spans.\n\nHit products generate the kind of buzz you might see only for a limited-edition sneaker or the latest iPhone, necessitating preorders or, when inventories inevitably dry up, leading to scalping.\n\nBut the lows are abrupt. When it was first released last year, CU’s “Dubai-style chocolate” — an in-house take on the global TikTok food trend — commanded lines outside of stores and sold out in a day. Four months later, sales had dropped to a sixth of what they were.\n\n“The lifespan of products is now incredibly short because social media fads come and go so quickly,” said Kim, a merchandiser for a leading convenience store franchise who asked to be identified only by his surname because he is not authorized to speak to the media.\n\n“In the past when the market wasn’t so saturated, revenue would naturally rise as everyone opened more stores. But now there are so many stores, and then you’re competing not just with other convenience stores but with e-commerce platforms, coffee shops, restaurants — everybody who’s following the same trend.”\n\nMost of Kim’s job involves scrolling through social media platforms such as TikTok, looking for the next hot-ticket item, such as a distant food trend that shows signs of making landfall.\n\n“It’s brutal. It’s like trying to find the eye of a needle over and over again,“ he said. “If you miss something big and a competitor releases it first? Then you’re getting chewed out by your boss.”\n\nKwon Sung-jun is a chef who specializes in Italian cuisine and the winner of “Culinary Class Wars,” a hit reality cooking competition released by Netflix last year. He has a ritual of stopping by a convenience store every night after work — even if he doesn’t have anything to buy.\n\n“It’s very useful for staying abreast of any trends in the culinary world,” he said, and his routine proved to be pivotal in winning the $223,000 prize for “Culinary Class Wars.”\n\nIn one stage of the competition, contestants were tasked with cooking a dish using ingredients sourced from a true-to-life replica of a convenience store on set. Kwon, 30, handily won with a chestnut tiramisu whipped together from chestnuts, milk, coffee and a package of biscuits.\n\n“I came up with the idea in 30 seconds,” he said. “Because I had a mental list of what convenience stores have, I also planned substitute options for each of the key ingredients like chestnut, cream and so on.”\n\nSince winning the competition, he has avoided convenience stores; just two weeks after that episode aired, CU released a mass-produced version of his tiramisu, with Kwon’s face on the packaging.\n\n“It’s a little embarrassing to see those photos of myself,” he said.\n\nAll of this makes running a convenience store no easy feat, says Kim Hye-ryeon, the 52-year-old owner of a GS25 in Seoul’s Hongdae district.\n\nBecause franchisees are responsible for picking out their own inventory from the company catalog, which is updated three times a week, running a successful convenience store is less about the labor of stocking shelves and cashing out customers than keeping up with the frenetic cycle of food trends.\n\n“Whenever there’s a popular item, the owners who are a step ahead buy up all the stock so sometimes I can’t get any for my store,” she said. “You have to know what’s popular with young people at all times.”\n\nIn recent years, as South Korea’s cultural footprint has expanded, the assignment has gotten even more complicated. Streets that were once quiet are now popular thoroughfares for tourists staying in the guesthouses and Airbnbs that have opened in the area. Global tastes must be accounted for, too.\n\n“There’s been a noticeable increase since the pandemic,” she said. “Before, it was mostly Chinese or Japanese tourists, but now it’s from all over, especially Americans and Europeans.”\n\nFrom behind the counter, she has been keeping mental notes of what this international consumer base is buying, noting, for example, how her Muslim customers carefully study the labels to check whether the item is halal.\n\n“Most of the tourists come looking for products related to Korean movies or TV shows like dalgona [a traditional Korean candy] because they saw it on ‘Squid Game,’” she said. “They also really like ice creams, especially bingsu [Korean shaved ice].”",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/world-nation/story/2025-07-24/apartments-have-long-been-looked-down-upon-in-the-u-s-but-in-south-korea-they-are-king",
    "https://www.latimes.com/world-nation/story/2025-08-02/south-koreans-are-obsessed-with-netflixs-kpop-demon-hunters-heres-why",
    "https://www.latimes.com/world-nation/story/2025-08-28/immigration-deportation-los-angeles-mexico",
    "https://www.latimes.com/world-nation/story/2025-08-24/a-commuter-college-thought-it-could-avoid-trumps-education-crackdown-heres-what-happened",
    "https://www.latimes.com/world/la-xpm-2012-nov-27-la-na-scout-leader-slaying-20121128-story.html"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "convenience store foods",
      "weight": 0.10684773
    },
    {
      "name": "convenience stores",
      "weight": 0.10568982
    },
    {
      "name": "South Korean convenience store foods",
      "weight": 0.102338105
    },
    {
      "name": "South Korean convenience stores",
      "weight": 0.101811655
    },
    {
      "name": "other convenience stores",
      "weight": 0.09949213
    },
    {
      "name": "convenience store samgak gimbap",
      "weight": 0.09446648
    },
    {
      "name": "stores",
      "weight": 0.08442992
    },
    {
      "name": "more stores",
      "weight": 0.083914556
    },
    {
      "name": "a leading convenience store franchise",
      "weight": 0.060380567
    },
    {
      "name": "the convenience store business",
      "weight": 0.059193913
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Food & Drink/Food & Grocery Retailers/Other",
      "score": 0.61083984375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.56396484375
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.489501953125
    }
  ],
  "sentiment": {
    "positive": 0.36638433,
    "negative": 0.17485145,
    "neutral": 0.4587642
  },
  "summary": "South Korea is known for its fast food industry, with convenience stores producing up to 70 new food items a week, often offering a live feed of South Korean tastes. The country's convenience stores are known for their \"instant-izing\" process, which turns nearly every dish into a packaged meal. Convenience stores also offer discounts, wash and dry clothes, and have become a $25-billion industry. The author of three books on the world of convenience store foods, Chae Da-in, tours a handful of convenience stores near her home to keep up with the latest trends. South Korean convenience stores have become an international hit, with some locations featured in Netflix's hit series “Squid Game” and videos of people eating South Korean food have been viewed millions of times on TikTok and YouTube. South Korea's leading operator, BGF Retail, is set to open its first U.S. location in Hawaii later this year.",
  "shortSummary": "South Korea is the convenience store capital of the world, with its convenience stores offering diverse and innovative food products, enhancing its cultural appeal and appeal globally.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ab621bd4f6d94f1e8d254f01c750628a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/world-nation/story/2025-07-24/apartments-have-long-been-looked-down-upon-in-the-u-s-but-in-south-korea-they-are-king",
      "text": "- Share via\nSEOUL — For many Americans, the apartment where 29-year-old IT specialist Lee Chang-hee lives might be the stuff of nightmares.\nLocated just outside the capital of Seoul, the building isn’t very tall — just 16 stories — by South Korean standards, but the complex consists of 36 separate structures, which are nearly identical except for the building number displayed on their sides.\nThe 2,000-plus units come in the same standardized dimensions found everywhere in the country (Lee lives in a “84C,” which has 84 square meters, or about 900 square feet, of floor space) and offer, in some ways, a ready-made life. The amenities scattered throughout the campus include a rock garden with a fake waterfall, a playground, a gym, an administration office, a senior center and a “moms cafe.”\nBut this, for the most part, is South Korea’s middle-class dream of homeownership — its version of a house with the white picket fence.\n“The bigger the apartment complex, the better the surrounding infrastructure, like public transportation, schools, hospitals, grocery stories, parks and so on,” Lee said. “I like how easy it is to communicate with the neighbors in the complex because there’s a well-run online community.”\nMost in the country would agree: Today, 64% of South Korean households live in such multifamily housing, the majority of them in apartments with five or more stories.\nSuch a reality seems unimaginable in cities like Los Angeles, which has limited or prohibited the construction of dense housing in single-family zones.\n“Los Angeles is often seen as an endless tableau of individual houses, each with their own yard and garden,” Max Podemski, an L.A.-based urban planner, wrote in The Times last year. “Apartment buildings are anathema to the city’s ethos.”\nIn recent years, the price of that ethos has become increasingly apparent in the form of a severe housing shortage. In the city of Los Angeles, where nearly 75% of all residential land is zoned for stand-alone single-family homes, rents have been in a seemingly endless ascent, contributing to one of the worst homelessness crises in the country. As a remedy, the state of California has ordered the construction of more than 450,000 new housing units by 2029.\nThe plan will almost certainly require the building of some form of apartment-style housing, but construction has lagged amid fierce resistance.\nSixty years ago, South Korea stood at a similar crossroads. But the series of urban housing policies it implemented led to the primacy of the apartment, and in doing so, transformed South Korean notions of housing over the course of a single generation.\nThe results of that program have been mixed. But in one important respect, at least, it has been successful: Seoul, which is half the size of the city of L.A., is home to a population of 9.6 million — compared with the estimated 3.3 million people who live here.\nFor Lee, the trade-off is a worthwhile one.\nIn an ideal world, she would have a garage for the sort of garage sales she’s admired in American movies. “But South Korea is a small country,” she said. “It is necessary to use space as efficiently as possible.”\nApartments, in her view, have spared her from the miseries of suburban housing. Restaurants and stores are close by. Easy access to public transportation means she doesn’t need a car to get everywhere.\n“Maybe it’s because of my Korean need to have everything done quickly, but I think it’d be uncomfortable to live somewhere that doesn’t have these things within reach at all times,” she said. “I like to go out at night; I think it would be boring to have all the lights go off at 9 p.m.”\nA general view shows steam rising from office and apartment buildings that define the Seoul skyline. (Ed Jones / AFP via Getty Images)\nApartment buildings light up in the evening as people return home from work in Seoul on March 25, 2021. (Marcus Yam / Los Angeles Times)\n::\nApartments first began appearing in South Korea in the 1960s and 1970s, as part of a government response to a housing crisis in the nation’s capital — a byproduct of the era’s rapid industrialization and subsequent urban population boom.\nIn the 1960s, single-family detached dwellings made up around 95% of homes in the country. But over the following decade, as rural migrants flooded Seoul in search of factory work, doubling the population from 2.4 to 5.5 million, many in this new urban working class found themselves without homes. As a result, many of them settled in shantytowns on the city’s outskirts, living in makeshift sheet-metal homes.\nThe authoritarian government at the time, led by a former army general named Park Chung-hee, declared apartments to be the solution and embarked on a building spree that would continue under subsequent administrations. Eased height restrictions and incentives for construction companies helped add between 20,000 to 100,000 new apartment units every year.\nThey were pushed by political leaders in South Korea as a high-tech modernist paradise, soon making them the most desirable form of housing for the middle and upper classes. Known as apateu, which specifically refers to a high-rise apartment building built as part of a larger complex — as distinct from lower stand-alone buildings — they symbolized Western cachet and upward social mobility.\n“Around the late 1990s and early 2000s, almost every big-name celebrity at the time appeared in apartment commercials,” recalled Jung Heon-mok, an anthropologist at the Academy of Korean Studies who has studied the history of South Korean apartments. “But the biggest reason that apartments proliferated as they did was because they were done at scale, in complexes of five buildings or more.”\nEssential to the modern apateu are the amenities — such as on-site kindergartens or convenience stores — that allow them to function like miniature towns. This has also turned them into branded commodities and class signifiers, built by construction conglomerates like Samsung, and taking on names like “castle” or “palace.” (One of the first such branded apartment complexes was Trump Tower, a luxury development built in Seoul in the late 1990s by a construction firm that licensed the name of Donald Trump.)\nAll of this has made the detached single-family home, for the most part, obsolete. In Seoul, such homes now make up just 10% of the housing stock. Among many younger South Koreans like Lee, they are associated with retirement in the countryside, or, as she puts it: for “grilling in the garden for your grandkids.”\n::\nThis model has not been without problems.\nThere are the usual issues that come with dense housing. In buildings with poor soundproofing, “inter-floor noise” between units is such a universal scourge that the government runs a noise-related dispute resolution center while discouraging people from angrily confronting their neighbors, a situation that occasionally escalates into headline-making violence.\nSome apartment buildings have proved to be too much even for a country accustomed to unsentimentally efficient forms of housing. One 19-story, 4,635-unit complex built by a big-name apartment brand in one of the wealthiest areas of Seoul looks so oppressive that it has become a curiosity, mocked by some as a prison or chicken coop.\nThe sheer number of apartments has prompted criticism of Seoul’s skyline as sterile and ugly. South Koreans have described its uniform, rectangular columns as “matchboxes.” And despite the aspirations attached to them, there is also a wariness about a culture where homes are built in such disposable, assembly line-like fashion.\nMany people here are increasingly questioning how this form of housing, with its nearly identical layouts, has shaped the disposition of contemporary South Korean society, often criticized by its own members as overly homogenized and lockstep.\n“I’m concerned that apartments have made South Koreans’ lifestyles too similar,” said Maing Pil-soo, an architect and urban planning professor at Seoul National University. “And with similar lifestyles, you end up with a similar way of thinking. Much like the cityscape itself, everything becomes flattened and uniform.”\nJung, the anthropologist, believes South Korea’s apartment complexes, with their promise of an atomized, frictionless life, have eroded the more expansive social bonds that defined traditional society — like those that extended across entire villages — making its inhabitants more individualistic and insular.\n“At the end of the day, apartments here are undoubtedly extremely convenient — that’s why they became so popular,” he said. “But part of that convenience is because they insulate you from the concerns of the wider world. Once you’re inside your complex and in your home, you don’t have to pay attention to your neighbors or their issues.”\nStill, Jung says this uniformity isn’t all bad. It is what made them such easily scalable solutions to the housing crisis of decades past. It is also, in some ways, an equalizing force.\n“I think apartments are partly why certain types of social inequalities you see in the U.S. are comparatively less severe in South Korea,” he said.\nThough many branded apartment complexes now resemble gated communities with exclusionary homeowner associations, Jung points out that on the whole, the dominance of multifamily housing has inadvertently encouraged more social mixing between classes, a physical closeness that creates the sense that everyone is inhabiting the same broader space.\nEven Seoul’s wealthiest neighborhoods feel, to an extent that is hard to see in many American cities, porous and accessible. Wealthier often means having a nicer apartment, but an apartment all the same, existing in the same environs as those in a different price range.\n“And even though we occasionally use disparaging terms like ‘chicken coop’ to describe them, once you actually step inside one of those apartments, they don’t feel like that at all,” Jung said. “They really are quite comfortable and nice.”\n::\nPeople pose for photos among a field of cosmos flowers in front of high-rise apartment buildings in Goyang, west of Seoul. (Ed Jones / AFP via Getty Images)\nNone of this, however, has been able to stave off Seoul’s own present-day housing affordability crisis.\nThe capital has one of the most expensive apartment prices in the world on a price-per-square-meter basis, ranking fourth after Hong Kong, Zurich and Singapore, and ahead of major U.S. cities like New York or San Francisco, according to a report published last month by Deutsche Bank. One especially brutal stretch recently saw apartment prices in Seoul double in four years.\nPart of the reason for this is that apartments, with their standardized dimensions, have effectively become interchangeable financial commodities: An apartment in Seoul is seen as a much more surefire bet than any stock, leading to intense real estate investment and speculation that has driven up home prices.\n“Buying an apartment here isn’t just buying an apartment. The equivalent in the U.S. would be like buying an ideal single-family home with a garage in the U.S., except that it comes with a bunch of NVIDIA shares,” said Chae Sang-wook, an independent real estate analyst. “In South Korea, people invest in apateu for capital gains, not cash flow from rent.”\nSome experts predict that, as the country enters another era of demographic upheaval, the dominance of apartments will someday be no more.\nIf births continue to fall as dramatically as they have done in recent years, South Koreans may no longer need such dense housing. The ongoing rise of single-person households, too, may chip away at a form of housing built to hold four-person nuclear families.\nBut Chae is skeptical that this will happen anytime soon. He points out that South Koreans don’t even like to assemble their own furniture, let alone fix their own cars — all downstream effects of ubiquitous apartment living.\n“For now, there is no alternative other than this,” he said. “As a South Korean, you don’t have the luxury of choosing.”"
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-02/south-koreans-are-obsessed-with-netflixs-kpop-demon-hunters-heres-why",
      "text": "South Koreans are obsessed with Netflix’s ‘K-pop Demon Hunters.’ Here’s why\n- Share via\nSEOUL — When South Koreans start to obsess over a movie or TV series, they abbreviate its name, a distinction given to Netflix’s latest hit “K-pop Demon Hunters.” In media headlines and in every corner of the internet, the American-made film is now universally referred to as “Keh-deh-hun” — the first three syllables of the title when read aloud in Korean.\nAnd audiences are already clamoring for a sequel.\nThe animated film follows a fictional South Korean girl group named “HUNTR/X” as its three members — Rumi, Mira and Zoey — try to deliver the world from evil through the power of song and K-pop fandom.\nSince its release in June, it has become the most watched original animated film in Netflix history, with millions of views worldwide, including the U.S. and South Korea, where its soundtrack has topped the charts on local music streaming platform Melon. Fans have also cleaned out the gift shop at the National Museum of Korea, which has run out of a traditional tiger pin that resembles one of the movie’s characters.\nMuch of the film’s popularity in South Korea is rooted in its keenly observed details and references to Korean folklore, pop culture and even national habits — the result of having a production team filled with K-pop fans, as well as a group research trip to South Korea that co-director Maggie Kang led in order to document details as minute as the appearance of local pavement.\nThere are nods to traditional Korean folk painting, a Korean guide to the afterlife, the progenitors of K-pop and everyday mannerisms. In one scene, at a table in a restaurant where the three girls are eating, viewers might notice how the utensils are laid atop a napkin, an essential ritual for dining out in South Korea — alongside pouring cups of water for everyone at the table.\n“The more that I watch ‘Keh-deh-hun,’ the more that I notice the details,” South Korean music critic Kim Yoon-ha told local media last month. “It managed to achieve a verisimilitude that would leave any Korean in awe.”\n::\nDespite its subject matter and association with the “K-wave,” that catchall term for any and all Korean cultural exports, “K-pop Demon Hunters,” at least in the narrowest sense, doesn’t quite fit the bill.\nProduced by Sony Pictures and directed by Korean Canadian Kang and Chris Appelhans — who has held creative roles on other animated films such as “Coraline” and “Fantastic Mr. Fox” — the movie is primarily in English and geared toward non-Korean audiences. But its popularity in South Korea is another sign that the boundaries of the K-wave are increasingly fluid — and that, with more and more diaspora Korean artists entering the mix, it flows in the opposite direction, too.\nThose barriers have already long since broken down in music: many K-pop artists and songwriters are non-Korean or part of the Korean diaspora, reflecting the genre’s history of foreign influences such as Japanese pop or American hip-hop.\n“Once a cultural creation acquires a universality, you can’t just confine it to the borders of the country of origin, which is where K-pop is today,” said Kim Il-joong, director of the content business division at the Korea Creative Content Agency, a government body whose mission is to promote South Korean content worldwide. “Despite what the name ‘K-pop’ suggests, it is really a global product.”\nIn “K-pop Demon Hunters,” Zoey is a rapper from Burbank. In addition, the soundtrack was written and performed by a team that includes producers, artists and choreographers associated with some of the biggest real-life K-pop groups of the past decade.\nStreaming productions are increasingly flying multiple flags, too: Apple TV’s “Pachinko” or Netflix’s “XO, Kitty” are both American productions that were filmed in South Korea. But few productions have been able to inspire quite the same level of enthusiasm as “K-pop Demon Hunters,” whose charm for many South Koreans is how accurately it captures local idiosyncrasies and contemporary life.\nWhile flying in their private jet, the three girls are shown sitting on the floor even though there is a sofa right beside them. This tendency to use sofas as little more than backrests is an endless source of humor and self-fascination among South Koreans, most of whom would agree that the centuries-old custom of sitting on the floor dies hard.\nSouth Korean fans and media have noted that the characters correctly pronounce “ramyeon,” or Korean instant noodles. The fact that ramyeon is often conflated with Japanese ramen — which inspired the invention of the former decades ago — has long been a point of exasperation for many South Koreans and local ramyeon companies, which point to the fact that the Korean adaption has since evolved into something distinct.\nIt’s a small difference — the Korean version is pronounced “rah myun” — but one that it pays to get right in South Korea.\nThe girls’ cravings for ramyeon during their flight also caught the eye of Ireh, a member of the real-life South Korean girl group Purple Kiss who praised the film’s portrayals of life as a K-pop artist.\n“I don’t normally eat ramyeon, but whenever I go on tour, I end up eating it,” she said in a recent interview with local media. “The scene reminded me of myself.”\nSouth Korean fans have also been delighted by a pair of animals, Derpy and Sussy, which borrow from jakhodo, a genre of traditional Korean folk painting in which tigers and magpies are depicted side by side, popularized during the Joseon Dynasty in the 19th century.\nIn the film, Derpy is the fluorescent tiger with goggle eyes that always appears with its sidekick, a three-eyed bird named Sussy.\nThough they have long since been extinct, tigers were once a feared presence on the Korean peninsula, at times coming down from the mountains to terrorize the populace. They were also revered as talismans that warded off evil spirits. But much like Derpy itself, jakhodo reimagined tigers as friendlier, oftentimes comical beings. Historians have interpreted this as the era’s political satire: the magpie, audacious in the presence of a great predator, represented the common man standing up to the nobility.\nThe movie is peppered with homages to Korean artists throughout history who are seen today as the progenitors of contemporary K-pop. There are apparent nods to the “Jeogori Sisters,” a three-piece outfit that was active from 1939 to 1945 and is often described as Korea’s first girl group, followed by the Kim Sisters, another three-piece that found success in the U.S., performing in Las Vegas and appearing on “The Ed Sullivan Show.”\nLongtime K-pop fans might recognize the demon hunters from the 1990s as S.E.S., a pioneering girl group formed by S.M. Entertainment, the label behind present-day superstars Aespa and Red Velvet. (Bada, S.E.S.’s main vocalist, recently covered “Golden,” the film’s headline track, on YouTube.)\nFor a long time, South Korean audiences have often complained about outside depictions of the country as inauthentic and out of touch. Not anymore.\n“Korea wasn’t just shown as an extra add-on as it has been for so long,” Kim said. “‘K-pop Demon Hunters’ did such a great job depicting Korea in a way that made it instantly recognizable to audiences here.”"
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-28/immigration-deportation-los-angeles-mexico",
      "text": "- Share via\n- Jesús Cruz came to Los Angeles 33 years ago. He was sent back to Mexico and his wife faced an impossible decision. Should she and their children join him in Mexico? Or stay in Inglewood?\n- ‘I want them to have a better life,’ Cruz says of his U.S.-born children. ‘Not the one I had.’\nKINI, Mexico — On a hot June night Jesús Cruz at last returned to Kini, the small town in Mexico’s Yucatán Peninsula where he spent the first 17 years of his life.\nHis sister greeted him with tearful hugs. The next morning she took him to see their infirm mother, who whispered in his ear: “I didn’t think you’d ever come back.”\nAfter decades away, Cruz was finally home.\nYet he was not home.\nSo much of what he loved was 3,000 miles away in Southern California, where he resided for 33 years until immigration agents swarmed the car wash where he worked and hauled him away in handcuffs.\nCruz missed his friends and Booka, his little white dog. His missed his house, his car, his job.\nBut most of all, he missed his wife, Noemi Ciau, and their four children. Ciau worked nights, so Cruz was in charge of getting the kids fed, clothed and to and from school and music lessons, a chaotic routine that he relished because he knew he was helping them get ahead.\n“I want them to have a better life,” he said. “Not the one I had.”\nNow that he was back in Mexico, living alone in an empty house that belonged to his in-laws, he and Ciau, who is a U.S. permanent resident, faced an impossible decision.\nShould she and the children join Cruz in Mexico?\nOr stay in Inglewood?\nCruz and Ciau both had families that had been broken by the border, and they didn’t want that for their kids. In the months since Cruz had been detained, his eldest daughter, 16-year-old Dhelainy, had barely slept and had stopped playing her beloved piano, and his youngest son, 5-year-old Gabriel, had started acting out. Esther, 14, and Angel, 10, were hurting, too.\nBut bringing four American kids to Mexico didn’t seem fair, either. None of them spoke Spanish, and the schools in Kini didn’t compare with those in the U.S. Dhelainy was a few years from graduating high school, and she dreamed of attending the University of California and then Harvard Law.\nThere was also the question of money. At the car wash, Cruz earned $220 a day. But the day rate for laborers in Kini is just $8. Ciau had a good job at Los Angeles International Airport, selling cargo space for an international airline. It seemed crazy to give that up.\nCiau wanted to hug her husband again. She wanted to know what it would feel like to have the whole family in Mexico. So in early August she packed up the kids and surprised Cruz with a visit.\nKini lies an hour outside of Merida in a dense tropical forest. Like many people here, Cruz grew up speaking Spanish and a dialect of Maya and lived in a one-room, thatched-roof house. He, his parents and his five brothers and sisters slept in hammocks crisscrossed from the rafters.\nHis parents were too poor to buy shoes for their children, so when he was a boy Cruz left school to work alongside his father, caring for cows and crops. At 17 he joined a wave of young men leaving Kini to work in the United States.\nHe arrived in Inglewood, where a cousin lived, in 1992, just as Los Angeles was erupting in protest over the police beating of Rodney King.\nCruz, soft-spoken and hardworking, was overwhelmed by the big city but found refuge in a green stucco apartment complex that had become a home away from home for migrants from Kini, who cooked and played soccer together in the evenings.\nEventually he fell for a young woman living there: Ciau, whose parents had brought her from Kini as a young girl, and who obtained legal status under an amnesty extended by President Reagan. They married when she turned 18.\nAs their family grew, they developed rituals. When one of the kids made honor roll, they’d celebrate at Dave & Buster’s. Each summer they’d visit Disneyland. And every weekend they’d dine at Casa Gambino, a classic Mexican restaurant with vinyl booths, piña coladas and a bison head mounted on the wall. On Fridays, Cruz and Ciau left the kids with her parents and went on a date.\nAs the father of four Americans, Cruz was eligible for a green card. But the attorneys he consulted warned that he would have to apply from Mexico and that the wait could last years.\nCruz didn’t want to leave his children. So he stayed. When President Trump was reelected last fall on a vow to carry out mass deportations, he tried not to worry. The government, he knew, usually targeted immigrants who had committed crimes, and his record was spotless. But the Trump administration took a different approach.\nOn June 8, masked federal agents swarmed Westchester Hand Wash. Cruz said they slammed him into the back of a patrol car with such force and shackled his wrists so tightly that he was left with bruises across his body and a serious shoulder injury.\nCiau, who was helping Esther buy a dress for a middle school honors ceremony, heard about the raid and raced over. She had been at the car wash just hours earlier, bringing lunch to her husband and his colleagues. Now it was eerily empty.\nAt the Westchester Hand Wash last June, an employee tells a customer that they are closed due to a recent immigration raid. (Genaro Molina/Los Angeles Times)\nAt a news conference in June at Culver City Express Hand Car Wash and Detail, Noemi shows a photo of her husband, Jesús, who was taken into custody by immigration agents that month at a car wash.\n(Genaro Molina/Los Angeles Times)\nCruz was transferred to a jail in El Paso, where he says he was denied requests to speak to a lawyer or call his family.\nOne day, an agent handed him a document and told him to sign. The agent said that if Cruz fought his case, he would remain in detention for up to a year and be deported anyway. Signing the document — which said he would voluntarily return to Mexico — meant he could avoid a deportation order, giving him a better shot at fixing his papers in the future.\nCruz couldn’t read the text without his glasses. He didn’t know that he very likely would have been eligible for release on bond because of his family ties to the U.S. But he was in pain and afraid and so he signed.\nReturning to Kini after decades away was surreal.\nSprawling new homes with columns, tile roofs and other architectural flourishes imported by people who had lived in the U.S. rose from what had once been fields. There were new faces, too, including a cohort of young men who appraised Cruz with curiosity and suspicion. With his polo shirts and running shoes, he stood out in a town where most wore flip-flops and as few clothes as possible in the oppressive heat.\nCruz found work on a small ranch. Before dawn, he would pedal out there on an old bicycle, clearing weeds and feeding cows, the world silent except for the rustle of palm leaves. In all his years in the big city, he had missed the tranquility of these lands.\nHe had missed his mother, too. She has multiple sclerosis and uses a wheelchair. Some days, she could speak, and would ask about his family and whether Cruz was eating enough. Other days, they would sit in silence, him occasionally leaning over to kiss her forehead.\nHe always kept his phone near, in case Ciau or one of the kids called. He tried his best to parent from afar, mediating arguments and reminding the kids to be kind to their mother. He tracked his daughters via GPS when they left the neighborhood, and phoned before bed to make sure everyone had brushed their teeth.\nHe worried about them, especially Dhelainy, a talented musician who liked to serenade him on the piano while he cooked dinner. The burden of caring for the younger siblings had fallen on her. Since Cruz had been taken, she hadn’t touched the piano once.\nDuring one conversation, Dhelainy let it slip that they were coming to Mexico. Cruz surged with joy, then shuddered at the thought of having to say goodbye again. He picked them up at the airport.\nThat first evening, they shared pizza and laughed and cried. Gabriel, the only family member who had never been to Mexico, was intrigued by the thick forest and the climate, playing outside in the monsoon rain. For the first time in months, Dhelainy slept through the night.\n“We finally felt like a happy family again,” Ciau said. But as soon as she and the kids arrived, they started counting the hours to when they’d have to go back.\nDuring the heat of the day, the family hid inside, lounging in hammocks. They were also dodging unwanted attention. It seemed everywhere they went, someone asked Cruz to relive his arrest, and he would oblige, describing cold nights in detention with nothing to keep warm but a plastic blanket.\nBut at night, after the sky opened up, and then cleared, they went out.\nIt was fair time in Kini, part of an annual celebration to honor the Virgin Mary. A small circus had been erected and a bull ring constructed of wooden posts and leaves. A bright moon rose as the family took their seats and the animal charged out of its pen, agitated, and barreled toward the matador’s pink cape.\nCruz turned to his kids. When he was growing up, he told them, the matador killed the bull, whose body was cut up and sold to spectators. Now the fights ended without violence — with the bull lassoed and returned to pasture.\nIt was one of the ways that Mexico had modernized, he felt. He felt pride at how far Mexico had come, recently electing its first female president.\nThe bull ran by, close enough for the family to hear his snorts and see his body heave with breath.\n“Are you scared?” Esther asked Gabriel.\nWide-eyed, the boy shook his head no. But he reached out to touch his father’s hand.\nLater, as the kids slept, Cruz and Ciau stayed up, dancing cumbia deep into the night.\nThe day before Ciau and the kids were scheduled to leave, the family went to the beach. Two of Ciau’s nieces came. It was the first time Gabriel had met a cousin. The girls spoke little English, but they played well with Gabriel, showing him games on their phones. (For days after, he would giddily ask his mother when he could next see them.)\nThat evening, the air was heavy with moisture.\nThe kids went into the bedroom to rest. Cruz and Ciau sat at the kitchen table, holding hands and wiping away tears.\nThey had heard of a U.S. employer who, having lost so many workers to immigration raids, was offering to pay a smuggler to bring people across the border. Cruz and Ciau agreed that was too risky.\nThey had just paid a lawyer to file a lawsuit saying Cruz had been coerced into accepting voluntary departure and asking a judge to order his return to the U.S. so that he could apply for relief from removal. The first hearing was scheduled for mid-September.\nCruz wanted to return to the U.S. But he was increasingly convinced that the family could make it work in Mexico. “We were poor before,” he told Ciau. “We can be poor again.”\nCiau wasn’t sure. Her children had big — and expensive — ambitions.\nDhelainy had proposed staying in the U.S. with her grandparents if the rest of the family moved back. Cruz and Ciau talked about the logistics of that, and Ciau vowed to explore whether the younger kids could remain enrolled in U.S. schools, but switch to online classes.\nWhen the rain began, Cruz got up and closed the door.\nThe next morning, Cruz would not accompany his family to the airport. It would be too hard, he thought, “like when somebody gives you something you’ve always wanted, and then suddenly takes it away.”\nJesús comforts his son Angel as they walk to the car to leave for the airport. (Juan Pablo Ampudia/For The Times)\nJesús hugs his son Gabriel as they say goodbye. (Juan Pablo Ampudia/For The Times)\nGabriel wrapped his arms around his father’s waist, his small body convulsed with tears: “I love you.”\n“It’s OK, baby,” Cruz said. “I love you, too.”\n“Thank you for coming,” he said to Ciau. He kissed her. And then they were gone.\nThat afternoon, he walked the streets of Kini. The fair was wrapping up. Workers sweating in the heat were dismantling the circus rides and packing them onto the backs of trucks.\nHe thought back to a few evenings earlier, when they had celebrated Dhelainy’s birthday.\nThe family had planned to host a joint sweet 16 and quinceñera party for her and Esther in July. They had rented an event hall, hired a band and sent out invitations. After Cruz was detained, they called the party off.\nThey celebrated Dhelainy’s Aug. 8 birthday at the house in Kini instead. A mariachi band played the Juan Gabriel classic, “Amor Eterno.”\n“You are my sun and my calm,” the mariachis sang as Cruz swayed with his daughter. “You are my life / My eternal love.”"
    },
    {
      "url": "https://www.latimes.com/world/la-xpm-2012-nov-27-la-na-scout-leader-slaying-20121128-story.html",
      "text": "Scoutmaster’s slaying, sexual abuse claims roil New Jersey town\n- Share via\nSTILLWATER, N.J. — Dennis J. Pegg was happy to pay local boys a few bucks to mow the lawn at his house, which sat atop a hill overlooking the elementary school. He was eager to guide Boy Scouts as they mastered the skills of the great outdoors, and to assist hikers trekking the nearby Appalachian Trail.\nPegg appeared to have no enemies in his close-knit, lakeside town of leafy glens and rolling hills — until last June, when his throat was slit and he was repeatedly stabbed in a killing that has raised questions about whether Pegg exploited his position in the Scouts for years to molest young boys.\n“This is a really, really ugly story. The blood of this man is on the hands of many people here,” said Carol Fredericks, whose brother-in-law, Clark Fredericks, 46, confessed to the slaying. Pegg, who was 68, had been a local scoutmaster in the 1970s, when, Carol Fredericks said, Pegg sexually abused Clark and others.\nOthers have since echoed his claims, clouding the image of a man whose online obituary drew sentimental tributes from scores of people who knew Pegg as a bird-watcher; as a “trail angel” who gave food and water to hikers; as a former corrections officer with the Sussex County Sheriff’s Office; as an Army veteran and firearms expert; and as a mentor to local youth.\nThe case is playing out as the Boy Scouts of America contends with a national scandal arising from its handling of past sexual abuse allegations. Hundreds of confidential files released in recent weeks show that leaders molested the boys they were supposed to be mentoring, and often were never held to account. The files have stirred uncomfortable memories and anger among men around the country who say they have been abused in the Scouts.\nPegg was not in the files, either because he was never written up by the Scouts or because the records were destroyed.\nA photograph on the Facebook page of the Stillwater Historical Society, where Pegg was an active member, shows a cheerful, burly man leaning on a walking stick, smiling warmly and waving at the camera.\n“I’d have put my life in his hands. I trusted him that much,” said one of his fiercest defenders, attorney Ernest Hemschot III, who had dinner with Pegg two nights before he was killed and who now represents his estate. Pegg, who never married or had children, divided his belongings among a circle of close friends and two nephews.\nHemschot said he and others were stunned by the accusations against Pegg, whose large, granite headstone reads in part, “vir spectabilis,” or “notable man.” “If it did happen, my heart goes out to the victims. But I just find it hard to believe,” Hemschot said. “He was the go-to guy, the one anybody who had a problem or difficulty went to for help.”\nThat’s not the way Fredericks saw Pegg, and when he went to see him on June 12, friendship was the last thing on his mind.\nThat night, Fredericks, who lived with his mother a few minutes’ drive from Pegg, got his friend Robert Reynolds to go with him to Pegg’s house. They got in through the unlocked front door and, according to an arrest report, Fredericks immediately began stabbing Pegg. The pair then fled, leaving Pegg with his throat slashed and his torso punctured. Blood soaked the carpet and a leather recliner in the front room. Nothing was stolen — not the DVD player, jewelry box, shotguns, rifles or ammunition.\nFredericks’ mother became alarmed after her son came home about 2 a.m., his hands and clothes bloodied. She alerted the counselor her son had been seeing, saying she feared Fredericks “may have hurt or killed someone,” according to a police affidavit. Hours later, as he was arrested, Fredericks told police “in effect that the victim got what was coming to him, and that he has been a child molester for years,” the affidavit said.\nFredericks was charged with first-degree murder, but that could be downgraded to manslaughter — which carries a prison term of five to 10 years — if investigators are convinced that horrors of past abuse drove Fredericks to spin out of control. Reynolds, who has not alleged abuse by Pegg, is charged with being an accomplice to murder, conspiracy and evidence-tampering.\nBoth have pleaded not guilty.\nMany, including Fredericks’ relatives, are convinced he was driven to act after following coverage of the sexual abuse trial of former Penn State University assistant football coach Jerry Sandusky, which began June 11.\nAlready, “multiple people” have bolstered Fredericks’ claims, said Sussex County Assistant Prosecutor Gregory Mueller.\nInvestigators face challenges because the alleged molestations occurred more than 30 years ago, and because of the absence of physical evidence and of law enforcement and Boy Scout records that might have shown decades-old complaints about Pegg.\nOne person recalled seeing a box containing photographs of child pornography in Pegg’s home, but a search warrant failed to turn it up. “The witness described seeing this box roughly 35 years ago, so it’s not overly surprising we were unable to find it,” Mueller said.\nAt least one person is believed to have gone to state police in the late 1970s with complaints about Pegg, Mueller added. But the statute of limitations for sexual assault at the time was five years, and state police had a policy of destroying closed-out files.\nA spokesman for the Boy Scouts, Deron Smith, said the national office had no files related to Pegg, who was registered with the Boy Scouts from 1973 to 1980 as a scoutmaster in Stillwater and then in Bloomingdale.\nThat’s the time that a man known in court documents as John Doe 1, who has backed up Fredericks’ allegations, was in the Scouts. John Doe 1’s attorney, Kevin Kelly, says his client was lured to Pegg’s home with promises of money for mowing the lawn. Pegg invited the boy, a sixth-grader at the time, into his home, plied him with beer, showed him pornography and had sex with him, Kelly said.\nAfterward, Pegg would have the boy shower and wipe him down with witch hazel to erase evidence, Kelly said. When the boy tried to break off contact, Pegg followed him after school, to the roller rink and elsewhere. Eventually, Kelly said, Pegg gave up and “moved on” to other boys. The man, now 47, gave a similar account to the Star-Ledger of Newark, N.J.\nMueller said prosecutors had interviewed John Doe 1 and that his allegations “are supported and corroborated by other aspects” of the investigation.\nLike Fredericks, John Doe 1 still lives in the area. Those who know both men — neither of whom is married or has children — say they were plagued by Pegg’s presence in Stillwater, a rural area 70 miles west of New York City. Both are said to have struggled under the weight of keeping the past secret from relatives and friends.\nKelly’s client lives with his parents and is unemployed. Fredericks, also unemployed, was trying to start his own tire repair business.\nThe case is the subject of speculation and rumor in Stillwater. Much of the talk takes place at a local market, which serves as the water cooler for residents who stop by for fishing worms, deli sandwiches or just coffee and conversation.\nLocals who say they had found Pegg “creepy” because of his focus on boys and young men acknowledged that they would wave hello when they saw him at local events or at the diner, and that they knew him as a Facebook friend.\nPegg seems to have been aware that some harbored suspicions about him, even if they never came right out and said so.\n“In a rural community, there’s always somebody looking at you funny, like, ‘Why are you doing this?’” he said in a 2003 story in the Record newspaper about his reputation for helping hikers. “It hurts.”\nTimes staff writer Jason Felch contributed to this report."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-24/a-commuter-college-thought-it-could-avoid-trumps-education-crackdown-heres-what-happened",
      "text": "A commuter college thought it could avoid Trump’s education crackdown. It was wrong\n- Share via\nCOLORADO SPRINGS, Colo. — Administrators at the state university’s campus in Colorado Springs thought they stood a solid chance of dodging the Trump administration’s offensive on higher education.\nLocated on a picturesque bluff with a stunning view of Pikes Peak, the school is far removed from the Ivy League colleges that have drawn President Trump’s ire. Most of its students are commuters, getting degrees while holding down full-time jobs. Students and faculty alike describe the university, which is in a conservative part of the blue state of Colorado, as politically subdued, if not apolitical.\nThat optimism was misplaced.\nAn Associated Press review of thousands of pages of emails from school officials, as well as interviews with students and professors, reveals that school leaders, teachers and students soon found themselves in the Republican administration’s crosshairs, forcing them to navigate what they described as an unprecedented and haphazard degree of change.\nWhether Washington has downsized government departments, rescinded funding or launched investigations into diversity programs or campus antisemitism, the University of Colorado-Colorado Springs has confronted many of the same challenges as elite universities across the nation.\nThe school lost three major federal grants and found itself under investigation by the Trump Education Department. In the hopes of avoiding that scrutiny, the university renamed websites and job titles, all while dealing with pressure from students, faculty and staff who wanted the school to take a more combative stance.\n“Uncertainty is compounding,” the school’s chancellor told faculty at a February meeting, according to minutes of the session. “And the speed of which orders are coming has been a bit of a shock.”\nThe college declined to make any administrators available to be interviewed. A spokesman asked the AP to make clear that any professors or students interviewed for this story were speaking for themselves and not the institution. Several faculty members also asked for anonymity, either because they did not have tenure or they did not want to call unnecessary attention to themselves and their scholarship in the current political environment.\n“Like our colleagues across higher education, we’ve spent considerable time working to understand the new directives from the federal government,” the chancellor, Jennifer Sobanet, said in a statement provided to the AP.\nStudents said they have been able to sense the stress being felt by school administrators and professors.\n“We have administrators that are feeling pressure, because we want to maintain our funding here. It’s been tense,” said Ava Knox, a rising junior who covers the university administration for the school newspaper.\nFaculty, she added, “want to be very careful about how they’re conducting their research and about how they’re addressing the student population. They are also beholden to this new set of kind of ever-changing guidelines and stipulations by the federal government.”\nA White House spokesperson did not respond to a request for comment.\nMisplaced optimism\nShortly after Trump won a second term in November, University of Colorado-Colorado Springs leaders were trying to gather information on the incoming president’s plans. In December, Sobanet met the newly elected Republican congressman who represented the school’s district, a conservative area that Trump won with 53% of the vote. In her meeting notes obtained by the AP, the chancellor sketched out a scenario in which the college might avoid the drastic cuts and havoc under the incoming administration.\n“Research dollars — hard to pull back grant dollars but Trump tried to pull back some last time. The money goes through Congress,” Sobanet wrote in notes prepared for the meeting. “Grant money will likely stay but just change how they are worded and what it will fund.”\nSobanet also observed that dismantling the federal Education Department would require congressional authorization. That was unlikely, she suggested, given the U.S. Senate’s composition.\nLike many others, she did not fully anticipate how aggressively Trump would seek to transform the federal government.\nConservatives’ desire to revamp higher education began well before Trump took office.\nThey have long complained that universities have become bastions of liberal indoctrination and raucous protests. In 2023, Republicans in Congress had a contentious hearing with several Ivy League university leaders. Shortly after, the presidents of Harvard and the University of Pennsylvania resigned. During the presidential campaign last fall, Trump criticized campus protests against the war in Gaza, as well as what he said was a liberal bias in classrooms.\nHis new administration opened investigations into alleged antisemitism at several universities. It froze more than $400 million in research grants and contracts at Columbia, along with more than $2.6 billion at Harvard. Columbia reached an agreement last month to pay $220 million to resolve the investigation.\nWhen Harvard filed a lawsuit challenging Trump’s actions, his administration tried to block the school from enrolling international students. The Trump administration has also threatened to revoke Harvard’s tax-exempt status.\nNorthwestern University, Penn, Princeton and Cornell have seen big chunks of funding cut over how they dealt with the protests about Israel’s war in Gaza or over the schools’ support for transgender athletes.\nTrump’s decision to target the wealthiest, most prestigious institutions provided some comfort to administrators at the approximately 4,000 other colleges and universities in the country.\nMost higher education students in the United States are educated at regional public universities or community colleges. Such schools have not typically drawn attention from culture warriors.\nStudents and professors at UCCS hoped Trump’s crackdown would bypass the school and others like it.\n“You’ve got everyone — liberals, conservatives, middle of the road” at the college, said Jeffrey Scholes, a professor in the philosophy department. “You just don’t see the kind of unrest and polarization that you see at other campuses.”\nThe purse strings\nThe federal government has lots of leverage over higher education. It provides about $60 billion a year to universities for research. In addition, a majority of students in the U.S. need grants and loans from various federal programs to help pay tuition and living expenses.\nThis budget year, UCCS got about $19 million in research funding from a combination of federal, state and private sources. Though that is a relatively small portion of the school’s overall $369-million budget, the college has made a push in recent years to bolster its campus research program by taking advantage of grant money from government agencies such as the U.S. Defense Department and National Institutes of Health. The widespread federal grant cut could derail those efforts.\nSchool officials were dismayed when the Trump administration terminated research grants from the National Endowment for the Humanities, the Defense Department and the National Science Foundation, emails show. The grants funded programs in civics, cultural preservation and boosting women in technology fields.\nSchool administrators scrambled to contact federal officials to learn whether other grants were on the chopping block, but they struggled to find answers, the records show.\nSchool officials repeatedly sought out the assistance of federal officials only to learn those officials were not sure what was happening as the Trump administration halted grant payments, fired thousands of employees and closed agencies.\n“The sky is falling” at NIH, a university official reported in notes on a call in which the school’s lobbyists were providing reports of what was happening in Washington.\nThere are also concerns about other changes in Washington that will affect how students pay for college, according to interviews with faculty and education policy experts.\nWhile only Congress can fully abolish the Department of Education, the Trump administration has tried to dramatically cut back its staff and parcel out many of its functions to other agencies. The administration laid off nearly 1,400 employees, and problems have been reported in the systems that handle student loans. Management of student loans is expected to shift to another agency.\nIn addition, an early version of a major funding bill in Congress included major cuts to tuition grants. Though that provision did not make it into the law, Congress did cap loans for students seeking graduate degrees. That policy could have ripple effects in the coming years on institutions such as UCCS that rely on tuition dollars for their operating expenses.\nDEI and transgender issues\nTo force change on campus, the Trump administration has begun investigations targeting diversity programs and efforts to combat antisemitism.\nThe Education Department, for example, opened an investigation in March targeting a PhD scholarship program that partnered with 45 universities, including the University of Colorado-Colorado Springs, to expand opportunities for women and nonwhites in graduate education. The administration alleged the program was only open to certain nonwhite students and amounted to racial discrimination.\n“Sorry to be the bearer of bad news UCCS is included on the list” of schools being investigated, wrote Annie Larson, assistant vice president of federal relations and outreach for the entire University of Colorado system.\n“Oh wow, this is surprising,” wrote back Hillary Fouts, dean of the graduate school at UCCS.\nUCCS also struggled with how to handle executive orders, particularly those on transgender issues.\nIn response to an order that aimed to revoke funds to schools that allowed trans women to play women’s sports, UCCS began a review of its athletic programs. It determined it had no transgender athletes, the records show. University officials were also relieved to discover that only one school in their athletic conference was affected by the order, and UCCS rarely if ever had matches or games against that school.\n“We do not have any students impacted by this and don’t compete against any teams that we are aware of that will be impacted by this,” wrote the vice chancellor for student affairs to colleagues.\nAvoiding the spotlight\nThe attacks led UCCS to take preemptive actions and to self-censor in the hopes of saving programs and avoiding the Trump administration’s spotlight.\nEmails show that the school’s legal counsel began looking at all the university’s websites and evaluating whether any scholarships might need to be reworded. The university changed the web address of its diversity initiatives from www.diversity.uccs.edu to www.belonging.uccs.edu.\nAnd the administrator responsible for the university’s division of Inclusive Culture & Belonging got a new job title in January: director of strategic initiatives. University professors said the school debated whether to rename the Women’s and Ethnic Studies department to avoid drawing attention from Trump, but so far the department has not been renamed.\nAlong the same lines, UCCS administrators have sought to avoid getting dragged into controversies, a frequent occurrence in the first Trump administration. UCCS officials attended a presentation from the education consulting firm EAB, which encouraged schools not to react to every news cycle. That could be a challenge because some students and faculty are calling for vocal resistance on issues from climate change to immigration.\nSoon after Trump was sworn in, for example, a staff member in UCCS’s sustainability program began pushing the University of Colorado system to condemn Trump’s withdrawal from an international agreement to tackle climate change. It was the type of statement universities had issued without thinking twice in past administrations.\nIn an email, UCCS’ top public relations executive warned his boss: “There is a growing sentiment among the thought leadership in higher ed that campus leaders not take a public stance on major issues unless they impact their campus community.”\nTau writes for the Associated Press. AP education writer Collin Binkley in Washington contributed to this report."
    }
  ],
  "argos_summary": "South Korean convenience stores have evolved into a $25‑billion cultural phenomenon, offering a rapid‑cycle menu of instant‑ized foods, luxury goods, and even dining experiences, driven by a highly competitive retail environment that churns out up to 70 new items weekly. The industry’s expansion beyond Korea—into markets such as Hawaii, Mongolia, and Malaysia—leverages the global popularity of K‑wave content, while domestic stores serve as multifunctional social hubs and entrepreneurial opportunities for a significant share of the self‑employed workforce. This rapid innovation, coupled with social media amplification, has positioned convenience stores as a key barometer of Korean consumer trends and a catalyst for cross‑border retail growth.",
  "argos_id": "B6K0ZJQ59"
}