{
  "url": "https://www.forbes.com/sites/tylerroush/2025/08/29/us-economic-pessimism-grows-as-worries-persist-over-rising-prices/",
  "authorsByline": "Ty Roush",
  "articleId": "06bf6476240b48b8a41656eb968fcf1f",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://specials-images.forbesimg.com/imageserve/687572502ae11138836be17d/First-Inflation-Report-Of-2025-Released/960x0.jpg?cropX1=0&cropX2=759&cropY1=79&cropY2=505",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-29T15:41:33+00:00",
  "addDate": "2025-08-29T16:41:04.586330+00:00",
  "refreshDate": "2025-08-29T16:41:04.586332+00:00",
  "score": 1.0,
  "title": "Americans More Worried About Rising Prices In New Survey",
  "description": "More Americans expressed concerns that tariffs would impact prices.",
  "content": "Consumer sentiment—a measurement of Americans’ views on the economic outlook—dropped to 58.2 in August from 61.7 in July, well below the historical benchmark of 100, a reading of the University of Michigan’s survey found, after economists expected the reading to hold at a preliminary reading of 58.6. Americans expect inflation to rise to 4.8% over the next year, above July’s projections of 4.5%, and for prices to increase 3.5% over the next five to 10 years, an uptick from 3.9% in the survey’s preliminary reading, but still above last month’s 3.4%. The survey also found roughly 63% of consumers believe unemployment will worsen over the next year. Joanne Hsu, the survey’s director, said in a statement that buying conditions for durable goods—long-lasting products like appliances—dropped to their lowest in a year as personal finances declined 7%, as Hsu cited “heightened concerns about high prices.”\n\nWhat To Watch For\n\nThe Bureau of Labor Statistics will release unemployment data next week—the first since President Donald Trump fired its director—as Wall Street expects a slight uptick from 4.2% in July to 4.3% in August, according to FactSet. About 92,500 nonfarm jobs are projected to have been added last month, above the 73,000 recorded last month. The BLS will likely face scrutiny after Trump fired commissioner Erika McEntarfer, whom he accused of manipulating jobs data during the 2024 election to benefit Kamala Harris. Trump nominated Heritage Foundation economist E.J. Antoni as the next commissioner. Antoni, a public critic of McEntarfer, has been criticized by former Democrat officials as being “completely unqualified” for the role and alleged Antoni may abuse his role as an “extreme partisan.”\n\nDeclining optimism among American consumers comes as inflation remained above the Federal Reserve’s 2% goal in July. Core personal consumption expenditures (PCE) price index data released earlier Friday found annual inflation hit 2.9% in July, matching economist’s projections and a 0.1% increase from June. Consumer spending increased 0.3% over the month to a four-month high, however, as the Bureau of Labor Statistics rose 0.4%. The PCE data—the central bank’s preferred reading for inflation—and upcoming jobs report will be the last before the Fed considers a possible interest rate cut in September. Fed Governor Christopher Waller, who voted in favor of a quarter-point reduction in July, said Thursday he would again support rates falling from a range of 4.25% to 4.5%, where they have sat since December. Fed Chair Jerome Powell, who has faced pressure from President Donald Trump to lower rates, has argued in favor of a cautious monetary policy, citing potential impacts of Trump’s tariffs on the economy in the near future.",
  "medium": "Article",
  "links": [
    "https://www.sca.isr.umich.edu/",
    "https://www.forbes.com/sites/tylerroush/2025/08/29/inflation-hit-29-last-month-as-prices-rose-as-expected-last-month-feds-gauge-shows/",
    "https://x.com/jasonfurman/status/1955046454147371326?s=46"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "President Donald Trump",
      "weight": 0.081644535
    },
    {
      "name": "Donald Trump",
      "weight": 0.0777639
    },
    {
      "name": "jobs data",
      "weight": 0.0751316
    },
    {
      "name": "last month",
      "weight": 0.07013483
    },
    {
      "name": "Heritage Foundation economist E.J. Antoni",
      "weight": 0.06956444
    },
    {
      "name": "unemployment data",
      "weight": 0.06951964
    },
    {
      "name": "Rising Prices",
      "weight": 0.06924078
    },
    {
      "name": "Trump",
      "weight": 0.06882399
    },
    {
      "name": "July",
      "weight": 0.06810961
    },
    {
      "name": "annual inflation",
      "weight": 0.064140804
    }
  ],
  "topics": [
    {
      "name": "Polls"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.98291015625
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.8388671875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.7001953125
    }
  ],
  "sentiment": {
    "positive": 0.03773147,
    "negative": 0.8955935,
    "neutral": 0.06667502
  },
  "summary": "Consumer sentiment has dropped to 58.2 in August from 61.7 in July, a reading from the University of Michigan's survey. This is below the historical benchmark of 100. Americans expect inflation to rise to 4.8% over the next year, above July's projections of 4.5%, and for prices to increase 3.5% over five to ten years. The survey also found that 63% of consumers believe unemployment will worsen over the year. The Bureau of Labor Statistics is set to release its unemployment data next week, with expectations of a slight uptick from 4.2% in July to 5.3% in August. The Federal Reserve is expected to consider a possible interest rate cut in September.",
  "shortSummary": "Consumer sentiment dropped to 58.2 in August, with Americans increasingly concerned about rising prices and rising unemployment, amid rising inflation and political tensions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ace2cde3b76a45f6836f9e98cf212408",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.sca.isr.umich.edu/",
      "text": "Final Results for August 2025\n| Aug | Jul | Aug | M-M | Y-Y | |\n| 2025 | 2025 | 2024 | Change | Change | |\n| Index of Consumer Sentiment | 58.2 | 61.7 | 67.9 | -5.7% | -14.3% |\n| Current Economic Conditions | 61.7 | 68.0 | 61.3 | -9.3% | +0.7% |\n| Index of Consumer Expectations | 55.9 | 57.7 | 72.1 | -3.1% | -22.5% |\nRead our August 15th special report, Trade Policy and Expected Consumer Spending\nNext data release: Friday, September 12, 2025 for Preliminary September data at 10am ET\nSurveys of Consumers Director Joanne Hsu\nConsumer sentiment confirmed its early-month reading, moving down about 6% from July. Sentiment now stands about 11% above readings from April and May but remains at least 10% below 6 and 12 months ago. This month’s decrease was visible across groups by age, income, and stock wealth. Moreover, perceptions of many aspects of the economy slipped. Buying conditions for durable goods subsided to their lowest reading in a year, and current personal finances declined 7%, both due to heightened concerns about high prices. Expectations for business conditions and labor markets contracted in August as well. That said, expectations for personal finances held steady this month, albeit at relatively subdued levels relative to a year ago. This month, few consumers spontaneously mentioned the recent events at the Bureau of Labor Statistics and the Federal Reserve (interviews closed on Monday, August 25, the day Trump announced he was firing Governor Cook).\nYear-ahead inflation expectations moved up from 4.5% last month to 4.8% this month. This rise was seen across multiple demographic groups. Independents and Republicans both exhibited month-over-month increases; expectations for Democrats were unchanged from July. Long-run inflation expectations edged up from 3.4% in July to 3.5% in August. This month ended two consecutive months of receding inflation for short-run expectations and three straight months for long-run expectations. Still, both readings remain well below the highs seen briefly in April and May 2025.\nYear-ahead inflation expectations moved up from 4.5% last month to 4.8% this month. This rise was seen across multiple demographic groups. Independents and Republicans both exhibited month-over-month increases; expectations for Democrats were unchanged from July. Long-run inflation expectations edged up from 3.4% in July to 3.5% in August. This month ended two consecutive months of receding inflation for short-run expectations and three straight months for long-run expectations. Still, both readings remain well below the highs seen briefly in April and May 2025."
    },
    {
      "url": "https://www.forbes.com/sites/tylerroush/2025/08/29/inflation-hit-29-last-month-as-prices-rose-as-expected-last-month-feds-gauge-shows/",
      "text": "Topline\nAn inflation measurement favored by the Federal Reserve matched Wall Street’s expectations as consumer spending hit a four-month high, according to federal data released Friday.\nKey Facts\nAnnual inflation was 2.9% in July and a 0.1% uptick from June, according to core personal consumption expenditures (PCE) price index data released Friday by the Bureau of Economic Analysis, matching consensus analyst forecasts, according to FactSet.\nThe reading remained above the Fed’s 2% target for core PCE inflation, the central bank’s preferred gauge of price changes that excludes food and energy markets, for the 53rd consecutive month.\nConsumer spending, adjusting for inflation, increased 0.3% month-over-month to a four-month high as personal income jumped 0.4%.\nHeadline PCE inflation was 2.6%, matching June’s price increases and matching projections.\nWhat To Watch For\nFriday’s PCE report is the last before the Fed’s policy committee meeting in September. Investors are anticipating interest rates, which have been held between 4.25% and 4.5% since December, to be lowered during the September session after Fed Chair Jerome Powell signaled the agency would likely ease its monetary policy earlier this month. The Fed operates on a policy of setting rates to keep inflation and unemployment low, yet Powell warned earlier this year the impact of tariffs on the economy has yet to be seen and could raise prices. Powell noted the “balance of risks [appears] to be shifting” between unemployment and inflation, citing “sweeping changes” in trade, immigration and tax policy under the Trump administration.\nBig Number\n85.3%. Those are the odds the Fed eases interest rates by at least a quarter-point in September, according to CME’s FedWatch. Investors traded at odds as high as 99.9% earlier this month after earlier inflation data indicated prices increased more slowly than expected.\nKey Background\nThe central bank favors core PCE data more than inflation readings released by the Bureau of Labor Statistics because it allows the Fed to better understand how Americans spend their money and how their spending habits change. President Donald Trump has pressured the Fed to cut interest rates and called on Powell to resign, claiming Powell has been “too late” to opt for a looser monetary policy. Fed governors Michelle Bowman and Christopher Waller have argued for a quarter-point reduction and dissented with a decision to hold rates at the Fed’s last meeting in June. Some economists have warned Trump’s tariffs on U.S. trade partners will raise prices for Americans this year: UBS analysts forecast CPI inflation hitting 3.9% by December, while Bank of America projected core PCE inflation rising to 3.1%. Avery Shenfeld, chief economist at CIBC World Markets, wrote in a note earlier this week that “if it weren’t for all the politics,” inflation remaining above the Fed’s 2% goal is “not exactly crying out for a rate cut in September.”"
    }
  ],
  "argos_summary": "Consumer sentiment fell to 58.2 in August from 61.7 in July, reflecting heightened inflation worries and a decline in durable‑goods buying conditions. Year‑ahead inflation expectations rose to 4.8% and long‑run expectations to 3.5%, while core PCE inflation hit 2.9% in July, staying above the Fed’s 2% target. The BLS will release August jobs data next week, with markets anticipating a modest rise in unemployment and 92,500 new non‑farm jobs. Fed officials signal a possible rate cut in September, though political pressure and tariff concerns may temper easing.\n",
  "argos_id": "HOHU35S67"
}