{
  "url": "https://www.usatoday.com/story/money/shopping/2025/08/28/jcpenney-store-closing-orange-county-california/85864881007/",
  "authorsByline": "Greta Cross, Mike Snider",
  "articleId": "b273a37690ff494bb663496732014dbe",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/28/USAT/85864962007-20231124-t-123529-z-673764545-rc-2-oj-4-ax-8-vjh-rtrmadp-3-usaholidayshoppingblackfridayactivities.JPG?crop=4031,2268,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T17:34:38+00:00",
  "addDate": "2025-08-28T17:43:13.269607+00:00",
  "refreshDate": "2025-08-28T17:43:13.269609+00:00",
  "score": 1.0,
  "title": "JCPenney is closing a 51-year-old store. See which location is closing its doors.",
  "description": "The JCPenney in the Westminster Mall in Orange County, California, will be open to the public through Nov. 16.",
  "content": "• JCPenney is closing its location inside the Westminster Mall in Orange County, California.\n• The store will remain open to the public through Nov. 16. The store will close on or about Nov. 21.\n• Seventy-six employees who work at the store will be affected by its closure.\n\nJCPenney is closing yet another location, this time in Orange County, California.\n\nJCPenney will close its location in the Westminster Mall on or about Nov. 21, according to a Worker Adjustment and Retraining Notification (WARN) Notice filed on Aug. 18, obtained by USA TODAY. The store will remain open to the public through Nov. 16.\n\nSeventy-six employees work at the location and will be affected by the closure, the WARN Notice states. These employees may be offered employment at other JCPenney locations, dependent on business needs and associate interests.\n\n\"Closing the store was a difficult decision. We thank you for the time and effort you have dedicated to JCPenney,\" reads a letter to associates at the location, obtained by USA TODAY.\n\nJCPenney was unable to continue its lease at the mall and has been unable to find another location in the area, according to a JCPenney statement obtained by USA TODAY.\n\nThis particular JCPenney store opened in August 1974, coinciding with the grand opening of the Westminster Mall. JCPenney is one of the mall's anchor stores, along with Macy's and Target. The former of which is also closing this year, USA TODAY previously reported.\n\nThe Orange County closure comes after JCPenney announced in July that the Boston private equity firm Onyx Partners, Ltd., purchased 119 stores for $947 million. The companies expect to close the deal by Sept. 8.\n\nProperty management companies Newmark and Hilco Real Estate have been seeking buyers for these JCPenney locations for Copper Property, a trust formed by JCPenney's lenders as part of the retailer's reorganization after its 2020 bankruptcy filing.\n\nFollowing JCPenney's bankruptcy, Copper Property took control of about 160 JCPenney locations and six distribution centers. Simon Property Group and Brookfield Asset Management Inc. took over JCPenney operations and the remaining locations. The department store chain, which currently has about 650 stores, is one of the largest retailers to file for Chapter 11 bankruptcy protection.\n\nThe money from the acquisition will go to JCPenney's creditors. After closing costs, $928 million to $932 million will be distributed, principal financial officer Larry Finger said during a conference call discussing the transaction on July 28.\n\nGreta Cross is a national trending reporter at USA TODAY. Story idea? Email her at gcross@usatoday.com.\n\nMike Snider is a national trending news reporter for USA TODAY. You can follow him on Threads, Bluesky, X and email him atmikegsnider & @mikegsnider.bsky.social & @mikesnider & msnider@usatoday.com",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/money/2025/02/12/jcpenney-stores-closing-locations/78461292007/",
    "https://www.usatoday.com/story/money/2025/08/23/burlington-opening-new-stores-19-states/85778240007/",
    "https://app.adjust.com/1el9h6z4",
    "https://www.usatoday.com/story/money/2025/08/20/target-ceo-steps-down-brian-cornell-michael-fiddelke/85737105007/",
    "https://www.usatoday.com/story/money/2020/12/30/store-closures-2021-macys-jcpenney-among-vulnerable-retailers/3974684001/",
    "https://www.prnewswire.com/news-releases/hilco-real-estate-announces-the-marketing-of-121-net-leased-jcpenney-properties-302369659.html",
    "https://www.usatoday.com/story/money/2025/03/27/macys-stores-closing-list/82686537007/",
    "https://bsky.app/profile/mikegsnider.bsky.social",
    "https://www.usatoday.com/story/money/2025/08/22/cracker-barrel-stock-dropped-after-logo-rebranding-backlash/85785319007/",
    "https://www.threads.net/@mikegsnider",
    "https://edd.ca.gov/en/jobs_and_training/Layoff_Services_WARN/",
    "https://www.ctltrust.net/press-releases/detail/149/copper-property-ctl-pass-through-trust-announces-binding",
    "https://www.usatoday.com/story/money/2025/08/25/de-minimis-exception-end-date-shoppers-impacted/85744435007/",
    "https://www.usatoday.com/story/money/2025/08/22/italian-restaurant-chain-bravo-brio-bankruptcy/85780352007/",
    "https://www.usatoday.com/story/money/shopping/2025/08/25/louis-vuitton-la-beaute-luxury-makeup-cosmetics/85758493007/",
    "https://puzzles.usatoday.com/",
    "https://www.usatoday.com/picture-gallery/news/nation/2025/02/25/department-store-scenes-16-classic-images-of-shoppings-bygone-era/80305900007/",
    "https://www.usatoday.com/story/money/2025/06/25/jcpenney-closing-warehouse-layoffs/84351283007/",
    "https://twitter.com/MikeSnider",
    "https://www.usatoday.com/story/money/2025/07/29/jcpenney-stores-sold-locations/85424797007/",
    "https://westminstermall.com/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other JCPenney locations",
      "weight": 0.12981512
    },
    {
      "name": "JCPenney",
      "weight": 0.11341498
    },
    {
      "name": "JCPenney operations",
      "weight": 0.11127093
    },
    {
      "name": "USA TODAY",
      "weight": 0.086716406
    },
    {
      "name": "This particular JCPenney store",
      "weight": 0.07420009
    },
    {
      "name": "these JCPenney locations",
      "weight": 0.07275045
    },
    {
      "name": "principal financial officer Larry Finger",
      "weight": 0.07064428
    },
    {
      "name": "Copper Property",
      "weight": 0.06767758
    },
    {
      "name": "Orange County",
      "weight": 0.06282156
    },
    {
      "name": "JCPenneys bankruptcy",
      "weight": 0.062427446
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.984375
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.82861328125
    },
    {
      "name": "/News/Local News",
      "score": 0.62890625
    },
    {
      "name": "/Food & Drink/Food & Grocery Retailers/Other",
      "score": 0.481201171875
    }
  ],
  "sentiment": {
    "positive": 0.048862457,
    "negative": 0.6061186,
    "neutral": 0.3450189
  },
  "summary": "JCPenney is closing its location at the Westminster Mall in Orange County, California, which opened in 1974. The store will remain open to the public until Nov. 16 and will close on or about Nov. 21. Seventy-six employees who work at the store will be affected by the closure, with some potentially offered employment at other locations. This closure follows the purchase of 119 stores by Boston private equity firm Onyx Partners for $947 million by Onyx. The money from the acquisition will be distributed to JCPenny's creditors after closing costs.",
  "shortSummary": "JCPenney is closing its 51-year-old store in Orange County, affecting 70 employees, while remaining open to the public through November 16.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "b89cb5bc5dfb4ddb95d9059c0d878bfd",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/money/2025/08/20/target-ceo-steps-down-brian-cornell-michael-fiddelke/85737105007/",
      "text": "Target CEO Brian Cornell steps down; Michael Fiddelke takes over after weak quarter\nTarget's board of directors has appointed a new chief executive officer to lead the retail giant, the company announced Aug. 20.\nMichael Fiddelke, Target's current chief operating officer, will succeed Brian Cornell as chief executive officer, the company said in a release.\nCornell, who has served as the company's CEO since 2014, will step down and Fiddelke will take over the role on Feb. 1, 2026.\nAfter finishing his tenure as CEO, Cornell will serve as executive chair of Target's board of directors. Target said it will announce its new COO — Fiddelke's successor — \"at a later date.\"\nThe announcement came the same day Target released its second quarter earnings, revealing the quarter's comparable sales fell by nearly two percent.\n\"I step into the role with an urgent commitment to drive growth and deliver better results,\" Fiddelke said in a statement.\nTarget releases second-quarter earnings, names new CEO\nTarget released its second-quarter earnings on Aug. 20 after slashing its annual sales forecast in May.\nThe company reported net sales of $25.2 billion in the second quarter, which was 0.9% lower than last year.\nSecond quarter comparable sales decreased 1.9%, and operating income of $1.3 billion was 19.4% lower than last year.\nIn May, after releasing its first quarter earnings, Target said it expects a single-digit decline in annual sales. The company previously forecast net sales growth of around 1%.\nFiddelke, Target's newly-appointed CEO, said during a media call on the second quarter earnings report that the company needs \"to move faster, much faster,\" Reuters reported.\n\"My number one goal is to get us back to growth,\" Fiddelke said.\nWho is Target's new CEO, Michael Fiddelke?\nFiddelke, 49, has worked at Target for more than two decades, having joined the company as an intern in 2003, according to Target's website.\nPrior to being named chief operating officer in January 2024, Fiddelke was Target's chief financial officer.\nIn addition to assuming the role of CEO, Fiddelke will join Target's board of directors on Feb. 1, 2026, the company said.\n\"After more than 20 years at Target, I know the power of our brand, the talent of our team, and the special place we hold in retail,\" Fiddelke said in a statement.\nHe has a master of Business Administration degree from Northwestern University and a Bachelor of Science in industrial engineering from the University of Iowa.\nThis story has been updated with new information.\nContributing: Reuters\nMelina Khan is a national trending reporter for USA TODAY. She can be reached at melina.khan@usatoday.com."
    },
    {
      "url": "https://www.usatoday.com/story/money/2020/12/30/store-closures-2021-macys-jcpenney-among-vulnerable-retailers/3974684001/",
      "text": "More store closings in 2021? These are the most vulnerable major retailers of 2021 as pandemic continues\nFor retailers that survived the catastrophe that was 2020, there's hope on the horizon in 2021.\nBut there's no guarantee they'll keep their engines running long enough to reach the light at the end of the tunnel.\nWhile 2020 was a mess for many retailers, leading to the liquidation of chains like Stein Mart and Pier 1 Imports, it was a boon to others, like Walmart, Target and Dick's Sporting Goods.\n\"If you’re in a sector like department stores or specialty or off-price or apparel, you suffered the most in 2020,\" said Mickey Chadha, vice president and senior credit officer of Moody's Investor Service, who studies the retail sector.\nSave better, send better: We'll tell you how and send money tips, advice delivered right to your inbox. Sign up here\nMore J.C. Penney store closings: After exiting bankruptcy, 15 additional stores will shutter in spring 2021. See the list.\nDespite the crushing shutdowns that temporarily brought physical sales to a standstill in the early months of the coronavirus pandemic across the nation, the industry's struggling retailers are now hoping that a nationwide vaccination campaign will bring them back from the brink.\nRestrictions still continue in California and other states also continue to limit the number of shoppers that can enter stores. Apple temporarily closed all 53 of its California stores again and about a dozen other stores across the country because of COVID-19 surges.\n\"It really comes down to how long COVID persists,\" said Chris Hudgins, who analyzes retail data for research firm S&P Global Market Intelligence. \"If we see this vaccine roll out and a lot of the cases come down and people go out and start shopping more, that will alleviate some strain on the retail sector.\"\nThere's one bright spot retailers are in a position to benefit from: E-commerce sales growth has been enormous and is expected to continue. Moody's projected growth of 14% to 15% for e-commerce sales in 2021, even as people are expected to return to stores as the pandemic ebbs.\nHere's a list of major retailers for whom 2021 could be a make-or-break year based on USA TODAY research, public data and analyst reports:\nJ.C. Penney\nThe department store chain filed for Chapter 11 bankruptcy protection in May after its sales collapsed amid temporary store closures.\nThe company was at risk of total liquidation for months as it negotiated with its creditors. After reaching a deal to sell to a consortium of property owners, including mall company Simon Property Group, J.C. Penney emerged from bankruptcy in December having closed more than 150 stores.\nWhile that's good news for fans of the chain founded by James Cash Penney that remains an icon of the era when shopping malls dominated American retail, it's not out of the woods yet. 2021 will be crucial to whether J.C. Penney can prove its relevance to consumers who grew more comfortable than ever with online shopping in 2020.\n\"For a long time, we’ve seen foot traffic at department stores declining,\" Hudgins said.\nAnother 15 stores have been added to the chopping block and are scheduled to close by the end of March and it's possible more closings could be added.\nSears and Kmart\nYou might think they're already out of business since thousands of their stores have closed in recent years, but they're not gone.\nBoth chains were owned by a company that filed for Chapter 11 bankruptcy protection in 2018 and narrowly escaped liquidation in early 2019. They were sold to their longtime investor and CEO, Eddie Lampert, who has kept them alive on a shoestring budget.\nIn February 2020, another 51 Sears and 45 Kmart locations closed, leaving some 182 surviving stores. There have been additional closings but no large closing announcements have been made since then.\nWhile Sears and Kmart are a shadow of their former selves, they remain in operation. But given that they have been struggling for ages in healthy times, experts say it's hard to see how they can mount a turnaround during or in the wake of a pandemic.\nRite Aid\nRite Aid's outlook has been gloomy for several years and Moody's considers the company to be a \"very high credit risk.\"\nThe company is stuck in an uncomfortable netherworld: not big enough to present a big threat to drugstore rivals Walgreens and CVS but not agile or rich enough to reinvent itself.\nA few bad breaks haven't helped: A merger deal with grocery chain Albertsons collapsed in 2018, leaving the company's path to reinvention unclear.\nPlans for a mega-merger between Walgreens and Fred's also collapsed in June 2017 amid federal antitrust concerns.\nLike Moody's, S&P Global Ratings views Rite Aid as facing a risk of failing to meet its financial obligations if something goes wrong.\nParty City\nQuite simply, it's a tough time to be selling party goods when parties are, in some states, illegal.\nGiven restrictions on large gatherings intended to reduce the transmission of the coronavirus, the market for balloons, streamers, party decorations and costumes is naturally limited.\nParty City was already facing challenges before this crisis began. The company has closed 76 stores since 2019, most of them before the pandemic, leaving it with 739 locations as of Sept. 30.\nIts financial troubles mounted in 2020. The company posted a loss of $432 million in the first nine months of 2020, compared with a loss of $264 million in the same period of 2019.\nJo-Ann Stores\nThis fabrics retailer remains on the edge of trouble. Owned by private equity firm Leonard Green & Partners, Jo-Ann faces the challenge of digging out of debt while dealing with the retail industry's other challenges.\nPrivate-equity ownership has been a problem for many other retailers in recent years, such as Toys R Us, which liquidated after accumulating too much debt and facing intense competition.\n\"A lot of the weaker players that we have now in the distressed space are still owned by private equity firms and still have weak balance sheets,\" Moody's executive Chadha said. \"And those companies are going to find it difficult, even when things normalize, to compete with stronger players that got stronger in 2020 because it’s just going to be that much more competitive.\"\nNeiman Marcus\nOne of the first major retailers to file for bankruptcy protection during the pandemic, Neiman Marcus entered Chapter 11 in early May.\nIt successfully navigated the debt-cutting process and emerged from bankruptcy in September, giving it another shot at achieving sustainability.\nBut time could be running out for the department store model. Neiman Marcus is already on Moody's list of vulnerable retailers based on their financial circumstances.\nTuesday Morning\nTuesday Morning was already struggling when the coronavirus pandemic began and went into a free fall when it was forced to temporarily close its locations due to the crisis.\nThe off-price retailer – which sells a wide variety of merchandise including home decor, bath and body goods, crafts, food, and toys – filed for bankruptcy protection in May. The company said it expected to stay in business while using the bankruptcy process to restructure operations.\nAs of Sept. 30, it had 490 states in 40 states after closing 197 stores as part of its reorganization plans.\nChristopher & Banks\nApparel retailer Christopher & Banks, which caters to women over 40, announced on Dec. 10 that it hired strategic advisers including B. Riley Securities Inc. and is working to refinance debt and explore alternatives.\nThe Minneapolis-based company obtained a $10 million loan under the Paycheck Protection Program in June.\n“We believe that COVID has had an outsized impact on our customer demographic as her shopping behavior is more pragmatic with limited demand for new outfits in the absence of social engagements,\" Keri Jones, president and CEO, said in a statement on Dec. 10. \"In addition, based on our own retail traffic trends we believe she remains hesitant to shop in stores.\"\nAs of Oct. 31, the company operated 452 stores in 44 states, including 316 Missy, Petite, Women stores, 77 outlet stores, 31 Christopher & Banks stores, and 28 C.J. Banks stores.\nJones said COVID-19 was expected to continue to depress sales over the next several months.\nJ. Jill\nThe women's retailer announced in September that it had worked with lenders to restructure its debt out of court. The company, which has more than 280 stores nationwide, had signaled it would consider filing for bankruptcy.\nInterim CEO James S. Scully said in December that the company's third-quarter results showed improvement because stores were open for the entire quarter versus the temporary closures from the second quarter. A permanent CEO, Claire Spofford, will join the company in early 2021.\nMacy's\nMacy's announced in February 2020 that it planned to cut 2,000 jobs and close one-fifth of its stores or roughly 125 locations over the next couple of years while also opening smaller stores that are not located in malls.\nMacy's along with other department store chains temporarily shuttered all of its stores amid the pandemic in mid-March. The company, which includes Bloomingdale's and Bluemercury, started reopening stores in May and added curbside pickup.\nMacy's appears to be in better shape than some of its competitors. In June, officials said the company received a credit line of $3.15 billion backed by its inventory, bringing its total new financing to $4.5 billion.\nIn September, Macy's Inc. Chairman and CEO Jeff Gennette said the timeline for permanent store closings could be adjusted as the company monitors the competition and the recovery from the pandemic.\n\"Retail today has been disrupted. And while that disruption creates challenges, it also holds opportunity,\" Gennette told analysts during the September quarterly earnings call. \"With many competitors closing or struggling, we see the potential to bring new customers into our brands and gain market share.\"\nIn November, Gennette said the company entered the quarter \"in a stronger than expected position.\"\nAscena Retail Group\nAlso listed on USA TODAY's 2020 list of struggling retailers, Ascena Retail Group, the parent company of Lane Bryant and Ann Taylor, which filed for bankruptcy in July.\nThe New Jersey-based company said at the time of the Chapter 11 filing that it plans to \"reduce their store fleet from approximately 2,800 stores to approximately 1,200 stores,\" which represents a 56% reduction in the company's total number of stores.\nThe company shuttered all of its Catherines plus-size stores and in November announced it sold the rights, title, licenses and e-commerce business of its Justice tween brand to management company Bluestar Alliance LLC. Most Justice stores have already closed and the remaining locations are expected to close in early 2021.\nOn Dec. 23, the company announced it sold Ann Taylor, Loft, Lou & Grey and Lane Bryant brands to Sycamore Brands, a New York private equity firm. Ascena also sold two of its brands, Maurices and Dressbarn, in 2019 before bankruptcy.\nBed Bath & Beyond\nEven before the pandemic, Bed Bath & Beyond planned to close stores but in July the number increased to 200 planned closures, accounting for some 21% of the company's namesake stores.\nIn September, the New Jersey-based home goods retailer – which also operates buybuy Baby and Harmon Face Values – revealed the first 63 namesake stores that would shutter as part of the plan by the end of 2020. In late October, company officials said the 200 stores are expected to close by the end of the 2021 fiscal year.\nUnder the leadership of CEO Mark Tritton, who joined Bed Bath & Beyond in November 2019 from Target, the company has been selling some of its brands.\nOn Dec. 14, the company announced it was selling Cost Plus World Market, which has 243 stores, to Los Angeles-based private equity firm Kingswood Capital Management. Bed Bath & Beyond sold its Christmas Tree Shops brand with 80 stores in November.\nVictoria's Secret\nIn May, L Brands, the parent company of Victoria's Secret and Bath & Body Works, said it would permanently close approximately 250 stores in the U.S. and Canada in 2020.\nAs of the end of October, the company reported it had closed 223 Victoria's Secret stores and three Pink locations and opened 18 new Victoria's Secret and two Pink stores. It also closed 13 of its 38 stores in Canada.\nWith the openings and closings, it has 704 Victoria's Secret and 143 Pink stores.\nIn February, L Brands announced a deal to sell 55% of Victoria’s Secret to Sycamore Partners. After the pandemic struck, Sycamore went to court to back out of the deal and in early May, both parties called it off.\n“We would expect to have a meaningful number of additional store closures beyond the 250 that we're pursuing this year, meaning there will be more in 2021 and probably a bit more in 2022,” interim Victoria’s Secret CEO Stuart Burgdoerfer told analysts in May.\nCompany officials said they still plan to separate Victoria's Secret and Bath & Body Works into two companies, which has pleased investors.\nDespite sales improving in the third quarter, L Brands CEO Andrew Meslow said in November the company was cautious \"given anticipated constraints on store traffic, online fulfillment and shipping capacity, as well as other uncertainties related to the COVID pandemic.\"\nExpress\nFashion retailer Express launched a turnaround plan in January 2020 and announced it would close 100 of its 600 stores.\nExpress CEO Timothy Baxter told the Wall Street Journal in December that the company had hired investment bank Lazard Frères & Co. to help raise enough financing to carry the company through the pandemic.\nEarlier in December, the company said it had completed a 10% workforce reduction at its Columbus, Ohio, corporate office.\nThe reductions are expected to save $13 million in 2021 in addition to the $95 million cash tax benefit the company expects to receive in the second quarter of 2021 as part of the CARES Act.\nFollow USA TODAY reporters Nathan Bomey and Kelly Tyko on Twitter @NathanBomey and @KellyTyko."
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/08/23/burlington-opening-new-stores-19-states/85778240007/",
      "text": "Burlington opening new stores in 19 states: See locations, dates\nIf you're a fan of Burlington stores, there may be one opening near you soon.\nBurlington has new store grand openings scheduled in 19 states, in addition to recently opened locations, according to the retailer's website.\nThe company, originally called Burlington Coat Factory, opened its first store in 1972 in Burlington, New Jersey. The first store was operated out of a factory, hence its name. The company went on to open 29 additional stores between 1973 and 1982, and today has over 1,000 stores across the United States, according to its website.\nBurlington touts itself as an \"off-price retailer,\" similar to stores such as TJ Maxx and Marshalls, and sells a wide assortment of brand-name clothing and shoes for men, women, juniors and kids, as well as products in the home and beauty categories.\nWhich states are getting new Burlington locations?\nNew stores are scheduled to open at the following locations on the following dates, according to Burlington's website:\nArizona\n- Aug. 29: 18705 S I 19 Frontage Rd., Green Valley\n- Oct. 10: 7333 W. Thomas Rd., Phoenix\n- Oct. 17: 4255 W. Thunderbird Rd., Phoenix\nCalifornia\n- Aug. 22: 1840 Countryside Dr., Turlock\n- Sept. 5: 5709 Lone Tree Way, Antioch\n- Sept. 19: 3615 Elkhorn Blvd., North Highlands\n- Oct. 3: 21640 Valley Blvd., City of Industry\n- Oct. 10: 4895 E. Cesar Chavez Blvd., Fresno\n- Oct. 10: 3138 R Street, Merced\n- Oct. 10: 720 W. Riggin Ave., Visalia\nConnecticut\n- Aug. 22: 185 Union Street, Waterbury\n- Oct. 17: 78 Frontage Rd., East Haven\nFlorida\n- Sept. 19: 13123 N. Dale Mabry Highway, Tampa\n- Oct. 17: 7873 S. Orange Blossom Trl, Orlando\nGeorgia\n- Sept. 5: 31 Hwy 138, Suite 150, Stockbridge\n- Oct. 10: 2625 Battlefield Pkwy., Fort Oglethorpe\n- Oct. 17: 3303 Buford Hwy NE, Atlanta\n- Oct. 17: 860 Duluth Hwy, Suite 110, Lawrenceville\nIllinois\n- Sept. 5: 1524 West Lane Rd., Machesney Park\n- Oct. 3: 175 Randall Rd., Algonquin\nKentucky\n- Oct. 3: 6801 Dixie Highway, Louisville\nMaine\n- Sept. 26: 6 Bangor Mall Blvd., Bangor\nMassachusetts\n- Aug. 22: 555 Hubbard Avenue, Pittsfield\nMichigan\n- Aug. 29: 23691 Greenfield Road, Southfield\n- Oct. 3: 4655 Canal Ave SW, Grandville\n- Oct. 10: 3150 Carpenter Rd., Ypsilanti\nMissouri\n- Oct. 17: 1927 Wentzville Pkwy., Wentzville\nNevada\n- Aug. 22: 2201 Civic Center Drive, North Las Vegas\n- Sept. 5: 3940 Blue Diamond Rd., Las Vegas\n- Oct. 17: 5055 W Sahara Ave., Las Vegas\nNew Jersey\n- Sept. 12: 855 St Georges Avenue, Woodbridge\n- Oct. 10: 3129 John F. Kennedy Blvd, North Bergen\nNew York\n- Sept. 5: 946 Kings Highway, Brooklyn\n- Sept. 12: 5520 Sunrise Highway, Massapequa\n- Oct. 3: 2255 East Ridge Road, Irondequoit\n- Oct. 3: 61-35 Junction Blvd, Suite A302, Rego Park\n- Oct. 10: 1851 Sunrise Hwy., Bay Shore\nOhio\n- Oct. 3: 4063 Richmond Road, Warrensville Heights\nPennsylvania\n- Sept. 19: 1015 N Main Street, Warrington\nTennessee\n- Oct. 10: 2626 East Stone Drive, Unit 170, Kingsport\n- Oct. 17: 5305 Hickory Hollow Pkwy., Antioch\nTexas\n- Aug. 29: 5431 N. Interstate 35, Austin\n- Aug. 29: 4351 Dallas Fort Worth Turnpike, Dallas\n- Aug. 29: 6101 Gateway Blvd W., El Paso\n- Aug. 29: 10960 Westheimer Rd., Houston\n- Aug. 29: 6022 E Sam Houston Pkwy N., Houston\n- Sept. 12: 11066 Pecan Park Blvd, Suite XG, Cedar Park\n- Sept. 26: 2420 Bob Bullock Loop, Laredo\n- Oct. 3: 4743 Hwy 6 N., Houston\nWashington\n- Sept. 19: 120 31st Ave SE., Puyallup\nGabe Hauari is a national trending news reporter at USA TODAY. You can follow him on X @GabeHauari or email him at Gdhauari@gannett.com."
    },
    {
      "url": "https://www.usatoday.com/story/money/shopping/2025/08/25/louis-vuitton-la-beaute-luxury-makeup-cosmetics/85758493007/",
      "text": "Would you pay $160 for lipstick? Louis Vuitton's first makeup line, La Beauté, sparks debate\n\"It's a luxury brand. Everyone is not meant to have it,\" TikToker Rakeedah Bell said.\nWould you pay $160 for a lipstick? Louis Vuitton seems to think some will.\nOn Monday, Aug. 25, Louis Vuitton released its first cosmetics collection, La Beauté. The luxury line was crafted by Dame Pat McGrath, a world-renowned makeup artist, and features lipsticks, lip balms and eyeshadows.\nThe line was teased back in March, but product images and prices were released early last week. Professional makeup artists, makeup enthusiasts and folks who just enjoy a good Chapstick took to social media to share their awe for the line. Some were overjoyed with the lines' luxurious appearance and traditional color palette, while others couldn't get over the retail price, with one lipstick starting at $160.\nThe line is available at select Louis Vuitton stores and the Louis Vuitton website starting on Friday, Aug. 29.\nHere's what we know about La Beauté, including what the collection includes, the full breakdown and how makeup enthusiasts feel about it all.\nWhat does the La Beauté collection include?\nThe debut collection features more than 70 products. Here's a look:\nRouge Complete Lipsticks\nThe La Beauté collection features 55 Rouge Complete Lipsticks, including 27 \"creamy satin hues\" and 28 \"velvety matte shades,\" according to a Louis Vuitton news release.\nThe lipsticks are made with natural waxes from rose, jasmine and mimosa flowers; shea butter; and hyaluronic acid, according to the news release.\nBaume Complete Lip Balm\nIn addition to the vibrant lipsticks, the collection features 10 Baume Complete Lip Balms, made with shea butter and hyaluronic acid, according to the news release. The balms are lightly tinted, including a burgundy brown, pink pearl and rosewood.\nEach lipstick and lip balm features a fragrance, designed by Louis Vuitton Master Perfumer Jacques Cavallier Belletrud, the news release states. The lipsticks feature mimosa, jasmine and rose scents, and the balms feature mint and raspberry.\nOmbres Complete Eyeshadows\nThe line is rounded out with eight eyeshadow palettes, each featuring four shades. The news release states that each palette contains three \"wearable, everyday shades, with one unexpected twist.\" The palettes include both matte and glitter shadows.\nThe eyeshadows are made with plant-derived squalane, known for protecting the skin, and camelina flower oil extract, the news release states.\nEach product, lipstick, lip balm and eyeshadow, is refillable.\nThe makeup pigments, scents and ingredients were not the only details considered in the collection's making.\nGerman designer Konstantin Grcic designed each of the product's packaging. An example detail – each lipstick's name and shade is engraved on the refill and a window at the top of the product. Grcic also crafted the floral motif lock system on each product.\nLa Beauté prices\nHere's a breakdown of the prices for products in the new La Beauté line:\n- Rouge Complete Lipstick: $160\n- Baume Complete Lip Balm: $160\n- Ombres Complete Eyeshadows: $250\n- Rouge and Baume Refills: $69\n- Ombres Refills: $92\nHow do other luxury beauty brands compare?\nIn social media videos, blogs and beauty publication stories, makeup artists and enthusiasts alike are comparing La Beauté to other luxury cosmetic brands. Here's a look at where some other high-end prices stack up for lipsticks, specifically:\n- Hermès Silky Lipstick Shine: $81\n- Guerlain Ultra-Care Lipstick: $80\n- Gucci Rouge à Lèvres Lipstick: $50\n- Prada Monochrome Lipstick: $50\n- Chanel Rouge Lipstick: $48-52\nIs the price point worth it? The internet is divided\nSocial media posters were divided on whether the high cost is worth it or not for Louis Vuitton's latest venture.\nLifestyle content creator Erin Nicole, who has been reviewing luxury beauty products on YouTube for a decade, said she is disappointed by the cost. She had hoped the lipsticks would start at under $100.\n\"I wish the price point was more widely accessible, especially for beauty junkies like me who are excited to support the iconic 'Mother' Pat McGrath,\" Nicole told USA TODAY. \"There are too many established competitors in the luxury market, I'm not sure the (Louis Vuitton) lipstick will really stand the test of time at $160.\"\nDominicia Baird, who goes by PhD in Pretty on social media, criticized the price of La Beauté in a recent TikTok video. She was surprised to see the prices rise above McGrath's own line. For reference, McGrath's Mothership eyeshadow palettes, which feature a minimum of nine shades, start at $128 on her website – in comparison to Louis' $250 for four shades.\nBut others aren't fazed.\nIn a recent TikTok video, content creator Rakeedah Bell said the new makeup line isn't supposed to be accessible.\n\"It's a luxury brand. Everyone is not meant to have it, and I don't say that as, like, I'm rolling around in Beyoncé money,\" Bell said. \"Don't get me wrong, I absolutely think $160 for a lipstick is ridiculous. I'm not here to say that it's not. My argument is, why do we do this? It's Louis Vuitton. What did we expect? It's a designer house. It's in the name.\"\nShades leave some makeup artists wanting more\nLa Beauté features more than 70 products, but some feel the pickings are too slim.\nMakeup content creator Sarah Meister said she finds makeup lines from other luxury brands, like Gucci, Prada and Hermès, more \"imaginative.\"\n\"La Beauté by Louis Vuitton color range doesn’t interest me, the product finishes and textures look very standard, and the packaging, while perfectly fine-looking, doesn’t stand out amongst the crowd,\" Meister told USA TODAY.\nCelebrity makeup artist Alexis Oakley, who has worked with names like Demi Lovato and Tana Mongeau, told USA TODAY that she wishes the line had started with a more diverse variety of products.\n\"Maybe a complexion range to showcase inclusivity or some innovative textures that stand out in the crowded luxury beauty market,\" she said.\nAre luxury makeup brands worth the cost?\nAcross the board, the makeup enthusiasts who spoke with USA TODAY said yes, luxury brands can be worth the cost, though there are plenty of great options on a more affordable budget.\nBaird said luxury products can be worth the cost if they are meaningful to the buyer.\n\"Some people will fall in love with the Louis Vuitton connection or with a particular shade, while others find that same sense of value in a Maybelline lipstick because of the color or performance,\" she said. \"What makes it worth it is if it brings the person joy.\"\nNicole echoed Baird's sentiment.\n\"The key is investing in the right luxury products that you genuinely love and enjoy,\" Nicole said. \"As long as you can afford it and it makes you feel confident, let's allow people, especially women, to enjoy the little things like applying our favorite lipsticks.\"\nWould you pay $160 for a Louis Vuitton lipstick? Let us know\nGreta Cross is a national trending reporter at USA TODAY. Story idea? Email her at gcross@usatoday.com."
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/07/29/jcpenney-stores-sold-locations/85424797007/",
      "text": "119 JCPenney stores sold in nearly $1 billion deal. See list of locations.\nAbout five years after JCPenney filed for bankruptcy, a Boston private equity firm will pay $947 million for 119 JCPenney stores.\nThe all-cash sale of 119 JCPenney properties to an affiliate of Onyx Partners, Ltd. was announced by Copper Property CTL Pass Through Trust on July 25. The companies expect a Sept. 8 closing of the deal for the net-lease stores, which pay rent and operating expenses.\nProperty management company Newmark and Hilco Real Estate had been seeking buyers for these JCPenney locations for Copper Property, a trust formed by JCPenney's lenders as part of the retailer's reorganization after its 2020 bankruptcy filing. \"The Buyer has now completed its due diligence, and its deposit under the Agreement is non-refundable,\" Copper Property Trust said in a news release on July 25.\nFollowing JCPenney's bankruptcy, Copper Property took control of about 160 JCPenney locations and six distribution centers. Simon Property Group and Brookfield Asset Management Inc. took over JCPenney operations and the remaining locations. The department store chain, which currently has about 650 stores, was one of the largest retailers to file for Chapter 11 bankruptcy protection.\nThe money from the transaction will go to JCPenney creditors. After closing costs, between $928 million and $932 million will be distributed, principal financial officer Larry Finger said on July 28 during a conference call discussing the transaction.\nJCPenney stores sold: Will all remain open?\nAll 119 stores that were sold are currently operational. The buyer, Onyx Partners, did not respond to a request for comment from USA TODAY.JCPenney closed more than 200 U.S. locations when the retailer filed for bankruptcy amid the COVID-19 pandemic. More recently, seven store closings announced in February 2025 became official in May 2025.\nWhich JCPenney stores are being sold? See map, list\nNewmark had told prospective buyers its JCPenney Retail Portfolio comprised 121 properties totaling 16.05 million square feet of retail space across 35 states, including 21 in Texas and 19 in California.\nTwo properties – one in Florida and one in Pennsylvania, according to a Securities and Exchange Commission filing – were sold to the Simon and Brookfield group for $21 million earlier this year.\nMike Snider is a national trending news reporter for USA TODAY. You can follow him on Threads, Bluesky, X and email him at mikegsnider & @mikegsnider.bsky.social & @mikesnider & msnider@usatoday.com\nWhat's everyone talking about? Sign up for our trending newsletter to get the latest news of the day"
    },
    {
      "url": "https://edd.ca.gov/en/jobs_and_training/Layoff_Services_WARN/",
      "text": "Worker Adjustment and Retraining Notification (WARN)\nWARN Act - Overview\nThe WARN Act requires employers to give 60-days’ notice before a mass layoff, plant closure, or relocation. Employers must notify employees and both state and local representatives. This helps workers prepare for job loss, find new jobs, or train for new opportunities.\nReview WARN Frequently Asked Questions to learn more.\nWho Receives the WARN Notice?\nYou are required to notify:\n- Your affected employees.\n- The Employment Development Department (EDD).\n- Your Local Workforce Development Area (Local Area).\n- The chief elected official of the local government affected by the WARN Notice.\nNote: The chief elected official will vary according to the local government structure. In the case of elected boards, the notice is to be served upon the board’s chairperson.\nNotifying Employees\nYou must notify your employees using a method of delivery that ensures their receipt of the notice at least 60 days before the mass layoff, plant closure, or relocation. Examples include:\n- First class mail.\n- Personal delivery with optional signed receipt.\n- A notice in your employee’s pay envelope.\nNote: A ticketed or preprinted notice regularly included in each employee’s paycheck or pay envelope does not meet the requirements.\nNotifying State and Local Representatives\nYou must submit all notices in writing to the EDD, your Local Area, and the chief elected official. Submitting an accurate WARN Notice ensures that assistance is promptly provided to affected employees.\nThe written notice must include the following information:\n- Name and address of the employment site where the mass layoff, plant closure, or relocation will occur.\n- Name and phone number of a company official who can be contacted if we need more information.\n- Statement that says if the planned action will be permanent or temporary.\n- Statement that says if the entire plant will be closed.\n- Expected date of the first separation, and the expected schedule for subsequent separations.\n- Job titles of affected positions, and the number of employees to be laid off in each job title.\n- For a lay-off affecting multiple locations, list the job titles and the number of affected employees by job title for each location. Please refer to this for multiple impacted locations.\n- List if bumping rights exist.\n- Name of each union representing affected employees, if applicable.\n- Name and address of the chief elected officer of each union, if applicable.\nNote: For more information on what must be in a WARN notice delivered to your employees, please refer to Title 20 Code of Federal Regulations Section 639.7.\nFiling a WARN Notice with the EDD\nTo file your WARN Notice with the EDD, email EDDWarnNotice@edd.ca.gov. Your email should:\n- Include the employer name in the subject line.\n- Include the written WARN notice as an attachment. (Accepted file types include: .DOC, .DOCX, and .PDF)\n- Include contact information in case we have questions.\nFiling a WARN Notice with your Local Area and Chief Elected Officials\nYou can find your Local Area in the Local Workforce Development Area Administrators listing.\nYour Local Area will then help you contact the appropriate chief elected official.\nWhat Happens After I File the WARN Notice?\nAfter your WARN Notice is filed and processed, your Local Area will contact you to provide Rapid Response Services to the workers impacted by the mass layoff, plant closure, or relocation.\nThe Rapid Response teams will work with your company to minimize the disruptions associated with job loss on your business, workers, and community. The Rapid Response Teams are a combined effort between our staff, and the Local Areas through the America’s Job Center of CaliforniaSM (AJCC).\nRapid Response Teams share information about the adult and dislocated worker services available:\n- Under Title I of the Workforce Innovation and Opportunity Act.\n- Through the AJCCs.\n- Through our Unemployment Insurance programs.\nFor more information about Rapid Response Services, review the following Fact Sheets:\nIf worker dislocation is the result of foreign competition or foreign relocation, the dislocated worker may be eligible for Trade Adjustment Assistance Program, which can include:\n- Employment and case management services\n- Training benefits\n- Trade Readjustment Allowances\n- Job Search allowances\n- Relocation allowances\n- Alternative or Reemployment Trade Adjustment Assistance\nOn a continuous basis, we process WARN Notices filed by employers. The WARN reports are created by the CalJOBSSM system and include the basic information we receive from employers.\nLatest WARN Report\nYou can download the latest WARN Report: WARN notices processed from July 1, 2025, to present (XLSX).\nListing of WARN Notices From Previous Years\nThe WARN reports listed below are available in Adobe Portable Document Format (PDF). You may need to download the no-cost Adobe Reader to view and print these reports.\n- 2024-2025 WARN Report from July 01, 2024 through June 30, 2025 (PDF)\n- 2023-2024 WARN Report from July 01, 2023 through June 30, 2024 (PDF)\n- 2022-2023 WARN Report from July 01, 2022 through June 30, 2023 (PDF)\n- 2021-2022 WARN Report from July 01, 2021 through June 30, 2022 (PDF)\n- 2020-2021 WARN Report from July 01, 2020 through June 30, 2021 (PDF)\n- 2019-2020 WARN Report from July 01, 2019 through June 30, 2020 (PDF)\n- 2018-2019 WARN Report from July 01, 2018 through June 30, 2019 (PDF)\n- 2017-2018 WARN Report from July 01, 2017 through June 30, 2018 (PDF)\n- 2016-2017 WARN Report from July 01, 2016 through June 30, 2017 (PDF)\n- 2015-2016 WARN Report from July 01, 2015 through June 30, 2016 (PDF)\n- 2014-2015 WARN Report from July 01, 2014 through June 30, 2015 (PDF)\nFor Public Records Requests: Submit your Public Records Request through the GovQA portal by selecting the WARN Notice Request category.\nWARN Act Coordinator\nFor more information about WARN-related services, contact the WARN Act Coordinator or your Local Workforce Development Area Administrator.\nMedia Requests\nFor all media requests, contact the EDD Media Services Office. WARN requests will be processed within 10 days of receiving your request.\nOther Contacts\nDepartment of Industrial Relations\nContact the Department of Industrial Relations about the enforcement of the California WARN law.\nNote: A Guide to Advance Notice of Closings and Layoffs provides additional information about the Federal WARN Act.\nNotification Requirements\nGeneral Provisions of the Federal and California WARN Laws\nEmployers should review both the Federal WARN law and the California WARN law for a full understanding of the notification requirements.\nThe following is a side-by-side chart that provides the general standards of the law:\n| Category | Federal WARN | California WARN |\n|---|---|---|\n| Covered Employers | Applicable only to employers with 100 or more full-time employees who must have been employed for at least 6 months of the 12 months preceding the date of required notice in order to be counted. (29 USC 2101 and 20 CFR 639.3) | Applicable to a “covered establishment” that employs or has employed in the preceding 12 months, 75 or more full and part-time employees. As under the federal WARN, employees must have been employed for at least 6 months of the 12 months preceding the date of required notice in order to be counted. [California Labor Code Section 1400.5 (a) and (h)] |\n| Mass Layoff, Termination, Relocation or Relocation of a Call Center | Plant closings involving 50 or more employees during a 30-day period. Layoffs within a 30-day period involving 50 to 499 full-time employees constituting at least 33% of the full-time workforce at a single site of employment. Layoffs of 500 or more are covered regardless of percentage of workforce. (29 USC, et seq., 2101 and 20 CFR 639.3) | Plant closure affecting any amount of employees. Layoff of 50 or more employees within a 30-day period regardless of % of workforce. Relocation of at least 100 miles affecting any amount of employees. Relocation of a call center to a foreign country regardless of the percentage of workforce affected. [California Labor Code Section 1400.5 (d)-(f) and 1409 (b)] |\n| Legal Jurisdiction | Enforcement of WARN requirements through United States district courts. The court, in its discretion, may allow the prevailing party a reasonable attorney’s fee as part of the costs. (29 USC 2101, et seq) | Civil action may be brought in “any court of competent jurisdiction” related to a Mass Layoff, Termination, Relocation, or Relocation of a Call Center. The court may award reasonable attorney’s fees as part of costs to any prevailing plaintiff. The California WARN law is in the Labor Code and the authority to investigate through the examination of books and records is delegated to the Labor Commissioner. The Labor Commissioner may enforce the notice requirements, including investigating an alleged violation and ordering appropriate temporary relief to mitigate the violation pending the completion of a full investigation or hearing. (California Labor Code Sections 1404 and 1406) |\n| Employer Liability | An employer who violates the WARN provisions is liable to each employee for an amount equal to back pay and benefits for the period of the violation, up to 60 days, but no more than half the number of days the employee was employed by the employer. [29 USC; 2104 (a)]. |\nA possible civil penalty of $500 a day for each day of violation. Employees may receive back pay to be paid at employee’s final rate or 3-year average rate of compensation, whichever is higher. In addition, employer is liable for cost of any medical expenses incurred by employees that would have been covered under an employee benefit plan. The employer is liable for period of violation up to 60 days or one-half the number of days the employee was employed whichever period is smaller. (California Labor Code Section 1403) A call center employer who does not provide notice is ineligible to be awarded or have renewed any direct or indirect state grants or state-guaranteed loans for five years and shall be ineligible to claim a tax credit -for five taxable years. (California Labor Code Section 1411 (a)) |\n| Notice Requirements | An Employer must provide written notice 60-days prior to a plant closing or mass layoff to employees or their representative, the State dislocated worker unit (the Employment Development Department, Workforce Services Division in California), and the chief elected official of local government within which such closing or layoff is to occur. (29 USC, 2102; 20 CFR 639.5) | An employer must give notice 60-days prior to a mass layoff, termination, relocation, or relocation of a call center. In addition to the notifications required under federal WARN, notice must also be given to the Local Workforce Development Board, and the chief elected official of each city and county government within which the termination, relocation or mass layoff occurs. (California Labor Code Section 1401) |\n| Exceptions and Exemptions to Notice Requirements |\nRegular Federal, State, local and federally recognized Indian tribal governments are not covered. The following situations are exempt from notice: There is an offer to transfer employee to a different site within a reasonable commuting distance. The closure is due to unforeseeable business circumstances, a natural disaster. The closing or layoff constitutes a strike or constitutes a lockout not intended to evade the requirement of this chapter. |\nCalifornia WARN does not apply when the closing or layoff is the result of the completion of a particular project or undertaking of an employer subject to Wage Orders 11, 12 or 16, regulating the Motion Picture Industry, or Construction, Drilling, Logging and Mining Industries, and the employees were hired with the understanding that their employment was limited to the duration of that project or undertaking. The notice requirements do not apply to employees involved in seasonal employment where the employees were hired with the understanding that their employment was seasonal and temporary. Notice is not required if a mass layoff, relocation or plant closure is necessitated by a physical calamity or act of war. Notice of a relocation or termination is not required where, under multiple and specific conditions, the employer submits documents to the Department of Industrial Relations (DIR) and the DIR determines that the employer was actively seeking capital or business, and a WARN notice would have precluded the employer from obtaining the capital or business. (California Labor Code Section 1402.5) This exception does not apply to notice of a mass layoff as defined in California Labor Code Section 1400.5 (d). |\nWork Sharing Program\nThinking about layoffs? Instead, apply for the Work Sharing Program. Cut hours and wages while we pay partial unemployment benefits. Keep great employees! Avoid the cost of hiring and training new employees when your business or the economy improves. This program has less impact on your unemployment taxes than a full layoff, and it can positively affect employee morale and loyalty.\nSenate Bill (SB) No. 1089 – Grocery and Pharmacy Closures\nEffective January 1, 2025, SB 1089 requires that certain grocery stores and pharmacies provide written notice of their closure to the EDD and other specified entities no later than 45 days before the closure takes effect. This notification requirement is separate from the WARN Notice. If the closure meets the conditions requiring a WARN Notice, employers are not required to issue a separate SB 1089 closure notice to the EDD. Review the SB 1089 Frequently Ask Questions to learn more."
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/08/22/cracker-barrel-stock-dropped-after-logo-rebranding-backlash/85785319007/",
      "text": "Cracker Barrel stock dips after rebranding backlash. What to know\nCracker Barrel is facing widespread backlash after rolling out a new logo and plans to update its restaurants to a more modern style.\nOn Aug. 19, the chain restaurant announced changes to its logo and menu as part of a campaign titled \"All the More.\" The rebrand features new and returning menu items, \"refreshed\" restaurant remodels and an \"enhanced brand look and feel,\" according to a news release.\nDespite the chain's excitement in its announcement, many were disappointed, and even outraged, by the change. Customers were so upset, in fact, that the chain saw an almost $10 drop in stock value over the course of one day.\nHere's what you need to know about the company's current financial situation.\nHow much has Cracker Barrel stock dropped?\nCracker Barrel's announcement on Aug. 19 didn't attract national attention until late on Aug. 20, which is reflected in the company's stock value.\nWhen the market closed on Aug. 20, shares were valued at $59.02. However, they took a sharp turn midday on Aug. 21, with stock prices falling to $50.76 by midday. By the end of the trading day, the prices had recovered slightly to $54.80 a share.\nWhile this may seem like a major hit for the company, it's not the lowest shares have been for the organization this year. The company reached a high in late January, when its shares were valued at $64.98, but they soon began to drop and hit a year-low of $35.11 in early April.\nThe peak value of shares this year was on July 23, only four weeks ago, when stocks were valued at $71.86.\nWhat does Cracker Barrel's new logo look like?\nWhile still featuring the company's classic gold and brown color palette, the new Cracker Barrel logo offers a simplified version that no longer depicts a man seated next to a wooden barrel.\nThe new logo includes the restaurant's name in brown lettering against a golden yellow border.\nThe rebrand comes as Cracker Barrel continues renovations at some of its locations around the country, giving restaurants a more modern facelift.\nCONTRIBUTING: Stephen J. Beard, Melina Khan, USA TODAY"
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/08/25/de-minimis-exception-end-date-shoppers-impacted/85744435007/",
      "text": "Key trade loophole 'de minimis' ends this week. What it means for shoppers.\nPrices on imported low-cost goods are likely to rise soon, as a trade loophole allowing many retailers to avoid President Donald Trump’s tariff hikes is set to expire this week.\nThe exception, which applied to items shipped to the United States and valued at $800 or less, will end on Friday, Aug. 29, following the president’s executive order in late July, effectively sunsetting the \"de minimis trade agreement\" for all nations. In 2024, de minimis shipments were valued at more than $1.36 billion, according to U.S. Customs and Border Protection.\nThis means consumers may see higher costs and possible supply disruptions, as the Trump administration effectively ends the duty-free program across the board.\nIn preparation of the change, Reuters reports postal groups in several European counties have announced they will pause standard parcel shipments to the U.S. Austria's postal service cited both the scrapping of the de minimis exemption as well as uncertainty over future U.S. postal customs clearance as reasons for its move.\n\"This tightening poses major challenges for all postal companies worldwide when sending goods to the USA,\" Austria Post said.\nHere's what to know about the de minimis exception and how its end could impact consumers.\nWhat is the de minimis exception?\nThe de minimis exemption refers to Section 321 of the Tariff Act of 1930, which allows the Secretary of the Treasury to waive some duties or fees where it is more inconvenient to collect the tax than the revenue would be worth. In practice, the policy allowed companies to ship low-value packages to the U.S. tariff-free. The Trump administration said in April, before the executive order ending the exemptions, that Customs and Border Patrol processes over 4 million de minimis shipments into the U.S. each day.\nThe exception has been the subject of back-and-forth over the past few months between the Trump administration and China, and it hit an early speed bump. It was originally set to end in February, but it was then postponed after packages began piling up without time to plan and execute the policy change.\nThe Aug. 29 deadline comes a few months after the loophole was closed on May 2 for imports, specifically from China and Hong Kong, where behemoth low-value retailers like Shein and Temu ship a significant portion of their products from. Over half of all packages with de minimis exemptions come from China, and more than 30% of all daily packages shipped under de minimis are from Temu and Shein, Reuters reported in February.\nThe two popular online retailers sell a wide range of products, including clothes and linens, toys, home goods and electronics. Both retailers gained popularity in the U.S. over the past several years, thanks in part to the de minimis exemption, which helped the companies keep prices low.\nBoth Temu and Shein experienced a sharp decline in sales growth and customer growth rates since Trump announced sweeping trade tariffs, according to data collected by consultancy Bain & Company, per Reuters. Engagement on Temu has also dropped significantly following the end of the de minimis exemption, said Morgan Stanley equity analyst Simeon Gutman in a May note.\nHow will the end of de minimis impact consumers?\nWith the end of the exception now just days away for imports from all other nations, the same impacts that Shein and Temu have wrestled with may soon hit other low-value goods retailers.\nErnie Tedeschi, director of economics at Yale Budget Lab, said the end of de minimis could affect health and beauty items, apparel, household goods and various bespoke or boutique items that are imported.\n\"For consumers that are shopping at a lot of big name-brand stores like Target, Walmart, Costco, this is not relevant to them,\" Tedeschi said. \"Those stores have already been hit by tariff increases, and so that should be incorporated into those prices at the moment.\"\nYet, shoppers may see a disruption in availability or stock before they notice any price hikes, according to Tedeschi. He pointed to the package pile-up when Trump first tried ending the exemption, forcing the administration to put the order on hold after more than a million packages piled up at New York's John F. Kennedy International Airport.\n\"It's not clear to me that the administration has solved that problem yet,\" Tedeschi said. \"All of that means that the initial effect that consumers see may not be an increase in price, at least initially, it may just be that goods are not there at all, goods that previously came in from de minimis.\"\nKathryn Palmer is a national trending news reporter for USA TODAY. You can reach her at kapalmer@usatoday.com and on X @KathrynPlmr."
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/02/12/jcpenney-stores-closing-locations/78461292007/",
      "text": "JCPenney closing 'handful' of stores by mid-2025: Here's what we know\nA \"handful\" of JCPenney locations are soon to be closing, a company spokesperson said, adding to the retailer's long list of shuttered stores since it filed for bankruptcy in 2020.\nThe spokesperson did not specify how many or which locations would be closing, but added the company did not plan to \"significantly reduce\" its store count.\nJCPenney announced plans to close more than 200 locations across the country after the retailer filed for Chapter 11 bankruptcy protection in May 2020. The chain was later acquired by Simon Property Group and Brookfield Asset Management Inc. in December 2020.\nLast month, JCPenney announced it had partnered with fashion retailer Forever 21 to create a new company called Catalyst Brands. The merger also includes Brooks Brothers, Aéropostale, Lucky Brand, Nautica and Eddie Bauer. Catalyst Brands is expected to open 1,800 store locations and hire 60,000 employees. The JCPenney spokesperson said the store closures are not related to the Catalyst Brands merger.\nHere's what we know about the closures.\nWhich JCPenney stores are closing?\nJCPenney did not confirm which \"handful\" of stores would be closing this year.\nWhen are the stores closing?\nA JCPenney spokesperson told USA TODAY the stores are expected to close by mid-2025.\nContributing: Jonathan Limehouse and Kelly Tyko, USA TODAY\nGreta Cross is a national trending reporter at USA TODAY. Follow her on X and Instagram @gretalcross. Story idea? Email her at gcross@usatoday.com."
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/08/22/italian-restaurant-chain-bravo-brio-bankruptcy/85780352007/",
      "text": "Popular Italian restaurant chain files for bankruptcy a second time\nThe parent company of Bravo! Italian Kitchen and Brio Italian Grille have filed for Chapter 11, the restaurant chains' second bankruptcy in just more than five years.\nBravo Brio Restaurants LLC, which includes 25 Brio Italian Grille restaurants and 23 Bravo Italian Kitchen restaurants, had closed seven restaurants before filing in U.S. Bankruptcy Court for the Middle District of Florida on Aug. 18. The company cited \"the acute financial distress\" across the restaurant industry, which has led to recent bankruptcy filings by Red Lobster, Tijuana Flats, TGI Fridays and Hooters, it states in the filing.\nEarl Enterprises, which also owns Planet Hollywood, Bertucci's and other restaurants, acquired the restaurants in June 2020 from FoodFirst Global Restaurants, which had filed for bankruptcy two months earlier.\nThrough the bankruptcy proceedings, Bravo Brio Restaurants seeks \"to improve its financial position as it brings on a new investor,\" the company said in a news release. \"The Chapter 11 process will allow the Company to quickly and efficiently reorganize its business for a sustainable and successful future, including closing underperforming locations, restructuring debt, and streamlining and reducing operational expenses.\"\nWill Brio locations close following bankruptcy filing?\nA spokesperson told Today.com there are no current plans to close any locations. The company did not respond to USA TODAY's questions about any immediate closings.\nLocations in Virginia and Missouri were closed earlier in the year, according to local news reports. A Brio restaurant in Beavercreek, Ohio, closed the same day as the filing, according to WHIO. Another location in Delaware closed concurrently with the bankruptcy filing, reported Delaware Online, part of the USA TODAY Network.\nThe company listed assets of $50 million to $100 million, including furniture, restaurant equipment and inventory valued at about $25 million. Liabilities of more than $50 million include wages of $900,000 currently owed to employees and $1.9 million owed to food provider Sysco, according to the filing.\n\"The Debtors have worked diligently to weather the storm, but earnings and cash flow remain strained by several above-market leases and underperforming locations,\" the filing reads.\nCurrent restaurants will continue operating during the bankruptcy process, the company said.\nMike Snider is a national trending news reporter for USA TODAY. You can follow him on Threads, Bluesky, X and email him at mikegsnider & @mikegsnider.bsky.social & @mikesnider & msnider@usatoday.com\nWhat's everyone talking about? Sign up for our trending newsletter to get the latest news of the day"
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/06/25/jcpenney-closing-warehouse-layoffs/84351283007/",
      "text": "JCPenney closing warehouse, laying off nearly 300 workers\nJCPenney is set to close a Texas warehouse and lay off nearly 300 employees this year.\nJCPenney announced in May it will permanently close its Alliance Supply Chain facility in Haslet, Texas around Nov. 1, according to a Worker Adjustment and Retraining Notification (WARN) Act Notice obtained by USA TODAY. As a result of the closure, as many as 296 employees could be laid off, though \"a few\" workers may be offered positions at other JCPenney locations.\n\"While this decision was difficult, it was necessary to build a stronger, more competitive company,\" a JCPenney spokesperson told USA TODAY. \"We appreciate the contributions of all affected associates, who had been previously notified of our decision, and are committed to supporting them with transition resources, including severance and benefits.\"\nIn May, JCPenney closed seven of its underperforming locations. This came after the company shuttered more than 200 stores nationwide after filing for Chapter 11 bankruptcy protection in 2020.\nHere's what to know about the Alliance Supply Chain facility closure.\nWhat is the JCPenney Alliance Supply Chain facility?\nThe JCPenney Alliance Supply Chain facility is one of the company's major retail distribution centers.\nWhy is JCPenney closing the Texas warehouse?\nJCPenney has not indicated specifically why it is closing its Alliance Supply Chain facility in Haslet, Texas.\nWhat types of jobs will be affected by the layoffs?\nA variety of positions will be affected by the mass layoffs, including jewelers, supply chain managers, mechanics and electricians, according to the WARN Notice.\nWhen will layoffs occur?\nAs many as 296 employees are set to be laid off in two waves, JCPenney's WARN notice states: 42 employees face layoffs between Aug. 1-14 and 254 employees are set to be let go between Nov. 1-14. All employees have been notified, the WARN notice states.\nLetters sent to employees remind them that they do not have the \"contractual right to assume positions that are already filled by other associates\" at other JCPenney locations, per the WARN notice.\nGreta Cross is a national trending reporter at USA TODAY. Story idea? Email her at gcross@usatoday.com."
    },
    {
      "url": "https://www.prnewswire.com/news-releases/hilco-real-estate-announces-the-marketing-of-121-net-leased-jcpenney-properties-302369659.html",
      "text": "NORTHBROOK, Ill., Feb. 6, 2025 /PRNewswire/ -- Hilco JCP, LLC, an affiliate of Hilco Real Estate, LLC and Manager of Copper Property CTL Pass Through Trust (the \"Trust\"), recently announced the Trust has placed on the market 121 net-leased JCPenney properties located across 35 states representing over 16 million square feet. The majority of the portfolio's properties are strategically located in major metropolitan areas surrounding such cities as Austin, Miami, Houston, Los Angeles, and New York, with 50% of the portfolio assets located in the high-growth Sunbelt region.\nThis real estate portfolio is the subject of an absolute, triple net long-term master lease with the sole tenant, JCPenney. JCPenney is owned in a joint venture comprised of two of the largest retail mall owners in the U.S., Simon Property Group and Brookfield Asset Management.\nHilco JCP, LLC has chosen Newmark's national retail capital markets team to market this portfolio. A call-for-offers date has been set for February 26, 2025. For sale details, please visit https://bit.ly/4jAHRG6 for portfolio information and offer procedures.\nAdditional information on this sale and other pertinent details can be found on the Trust's website, located at www.ctltrust.net.\nAbout Copper Property CTL Pass Through Trust\nCopper Property CTL Pass Through Trust (the \"Trust\") was established to acquire 160 retail properties and 6 warehouse distribution centers (the \"Properties\") from J.C. Penney as part of its Chapter 11 plan of reorganization. The Trust's operations consist solely of owning, leasing and selling the Properties. The Trust's objective is to sell the Properties to third-party purchasers as promptly as practicable. The Trustee of the trust is GLAS Trust Company LLC. The Trust is externally managed by an affiliate of Hilco Real Estate LLC. The Trust is intended to be treated, for tax purposes, as a liquidating trust within the meaning of United States Treasury Regulation Section 301.7701-4(d). For more information, please visit www.ctltrust.net.\nAbout Hilco Real Estate\nSuccessfully positioning the real estate holdings within a company's portfolio is a material component of establishing and maintaining a strong financial foundation for long-term success. At Hilco Real Estate (HRE), a Hilco Global company (HilcoGlobal.com), we advise and execute strategies to assist clients seeking to optimize their real estate assets, improve cash flow, maximize asset value and minimize liabilities and portfolio risk. We help clients traverse complex transactions, coordinating with internal and external networks and constituents to navigate ever-challenging market environments.\nThe trusted, full-service HRE team has secured billions in value for hundreds of clients over 20+ years. We are deeply experienced in complex transactions including artful lease renegotiation, multi-faceted sales structures, strategic asset management and capital optimization. We understand the legal, financial and real estate components of the process, all of which are vital to a successful outcome. HRE can help identify the most viable options and direction for a company and its real estate portfolio, delivering impressive results in every situation.\nForward Looking Statement\nThis news release contains certain \"forward-looking statements\". All statements other than statements of historical fact are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. These statements may be identified by the use of forward-looking terminology such as \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"might,\" \"our vision,\" \"plan,\" \"potential,\" \"preliminary,\" \"predict,\" \"should,\" \"will,\" or \"would\" or the negative thereof or other variations thereof or comparable terminology and include, but are not limited to, the Trust's expectations or beliefs concerning future events and stock price performance. The Trust has based these forward-looking statements on its current expectations, assumptions, estimates and projections. While the Trust believes these expectations, assumptions, estimates and projections are reasonable, such forward-looking statements are only predictions and involve known and unknown risks and uncertainties, many of which are beyond its control. These factors, including those discussed in the Trust's Registration Statement on Form 10 filed with the Securities and Exchange Commission (the \"SEC\"), may cause its actual results, performance or achievements to differ materially from any future results, performance or achievements expressed or implied by these forward-looking statements. For a further list and description of such risks and uncertainties, please refer to the Trust's filings with the SEC that are available at www.sec.gov. The Trust cautions you that the list of important factors included in the Trust's SEC filings may not contain all of the material factors that are important to you. In addition, in light of these risks and uncertainties, the matters referred to in the forward-looking statements contained in this news release may not in fact occur. The Trust undertakes no obligation to publicly update or revise any forward-looking statement as a result of new information, future events or otherwise, except as otherwise required by law.\nCompany Website\nhttps://ctltrust.net/about/default.aspx\nView source version on newsdirect.com: https://newsdirect.com/news/copper-property-ctl-pass-through-trust-sells-seven-of-its-jcpenney-retail-locations-for-65-2-million-374512416\nSOURCE Hilco Real Estate, LLC\nWANT YOUR COMPANY'S NEWS FEATURED ON PRNEWSWIRE.COM?\nNewsrooms &\nInfluencers\nDigital Media\nOutlets\nJournalists\nOpted In\nShare this article"
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/03/27/macys-stores-closing-list/82686537007/",
      "text": "Macy's is starting to close 'underproductive' stores: See list of stores set to shut doors\nMacy's in January named 66 of the 150 stores it is planning to close as part of its revitalization plan, and some stores on the list appear to have already closed or be closing soon.\nThe retailer announced in February 2024 plans to shut down 150 \"underproductive\" Macy's store locations by 2026. The plan \"is designed to return the company to sustainable, profitable sales growth,' Macy's said in a press release in January 2025.\nMacy's still plans to close a total of about 150 underproductive stores, while investing in its 350 current Macy’s locations, through the company's 2026 fiscal year, which ends Jan. 30, 2027, the company said in the press release.\nThe 66 stores named in January included locations in New York, Florida, Arizona and California, among others, and included some of the chains most iconic locations.\nAccording to local outlets WPIX and News12 Brooklyn, the Macy's store in downtown Brooklyn closed last weekend after a nearly three-decade run in the location. WPIX reports that Macy's took over the building on Fulton Street in 1995 after it originally housed the first Abraham & Straus department store.\nAdditionally, another iconic store in New York, located on Long Island at Sunrise Mall, is also set to close its doors next month, according to Daily Mail, The Mirror US, and other local reports.\n“Closing any store is never easy, but as part of our Bold New Chapter strategy, we are closing underproductive Macy’s stores to allow us to focus our resources and prioritize investments in our go–forward stores, where customers are already responding positively to better product offerings and elevated service,” Macy's CEO and chairman Tony Spring said in a statement in January.\nMacy's did not immediately respond to a USA TODAY request for comment on Thursday.\nHow many Macy's stores are closing?\nThe company has said it plans to close about 150 by the end of next year, leaving 350 Macy's stores across the U.S.\nWhat Macy's stores are closing?\nSo far, Macy's has only shared 66 of the locations it plans on closing. Macy's didn't say when it would announce what other stores will close.\nShop smarter: Sign up for USA TODAY's Daily Money newsletter.\nWhen will some Macy's stores close?\nThe timeline of the closures is unclear but clearance sales began in January and were scheduled to run for approximately 8-12 weeks, according to Macy's website.\nFor Macy's Backstage stores and Macy's Furniture Galleries, clearance sales will begin in February and will run about six weeks.\nIf you are unsure about whether your local store is open or closed, you can find Macy's stores near you on the Macy's website.\nContributing: Julia Gomez, USA TODAY\nGabe Hauari is a national trending news reporter at USA TODAY. You can follow him on X @GabeHauari or email him at Gdhauari@gannett.com.\nFollow Mike Snider on Threads, Bluesky and X: mikegsnider & @mikegsnider.bsky.social & @mikesnider."
    },
    {
      "url": "https://app.adjust.com/1el9h6z4",
      "text": "The USA TODAY news app gets you to the heart of the matter — fast. Whether it's money, sports, entertainment, or breaking news, get succinct, personalized coverage along with award-winning videos, captivating photography, and interactive user features. The point is — get major news coverage all in a compact device that fits right in the palm of your hand.\nAPP FEATURES\n• National and breaking news, including access to 200+ local publications.\n• News to the point: Easily keep up with news, sports, money, entertainment, health, and more with quick reads.\n• A personalized feed: Pick your favorite subjects in My Topics and receive a curated feed on the For You page.\n• eNewspaper: Just like our print edition but accessible on your mobile devices. And access to 200+ local eNewspapers.\n• Puzzles: Play Crossword, QuickCross, and Sudoku (tablet only) to keep your mind sharp.\n• Award-winning podcasts: Listen to your favorite USA TODAY NETWORK podcasts on demand.\n• Stay up-to-date with election news, analysis, and results.\nSubscription Information:\n• The USA TODAY app is free to download and all users can access a sampling of free articles every month.\n• Subscriptions are charged to your account at confirmation of purchase and automatically renew each month or year, unless turned off in your account settings at least 24 hours before the end of the current period. See \"Subscription Support\" in the app's Settings for more details and customer service contact information.\nMore Information:\n• Privacy Policy: https://cm.usatoday.com/privacy/\n• Terms of Service: https://cm.usatoday.com/terms/\n• Questions or comments? Visit http://www.usatoday.com/mobile-apps or email: mobilesupport@gannett.com"
    },
    {
      "url": "https://www.ctltrust.net/press-releases/detail/149/copper-property-ctl-pass-through-trust-announces-binding",
      "text": "Copper Property CTL Pass Through Trust Announces Binding Purchase and Sale Agreement for Sale of Portfolio\nJersey City, New Jersey – Copper Property CTL Pass Through Trust (the “Trust”) announced today that on July 23, 2025 it entered into an amendment that made its Purchase and Sale Agreement with an affiliate of Onyx Partners, Ltd. of Boston, MA (the “Buyer”) binding (the “Agreement”) for the sale of a portfolio consisting of the Trust’s 119 properties (the “Properties”). The aggregate purchase price for the Properties is $947 million in an all-cash transaction, subject to customary closing adjustments and prorations. This transaction is the culmination of an extensive marketing process run by Newmark. The Properties are subject to a long-term triple-net master lease with Penney Intermediate Holdings LLC or affiliates thereof. The Buyer has now completed its due diligence, and its deposit under the Agreement is non-refundable.\nThe transaction is scheduled to close on or before September 8, 2025, subject to customary real estate closing conditions. The Trust intends to distribute the net proceeds to Certificateholders in accordance with the terms of the Trust Agreement following the consummation of the sale. The Agreement provides certain limited termination rights on a property-by-property basis in connection with purchase rights in favor of ground lessors or purchase rights pursuant to reciprocal easement agreements, certain title defects, casualty events, or condemnation proceedings. Due to the various conditions to closing, the Trust cannot make any assurances that the disposition of the Properties is certain.\nThe Trust will host a live conference call on Monday, July 28, 2025, at 12:00 pm Eastern Time. Members of the Trust’s management team will discuss the announcement, and the conference call will include a question and answer (Q&A) session.\nConference Call Details:\nDATE: Monday, July 28, 2025\nTIME: 11:00 am CDT | 12:00 pm EDT\nDIAL-IN: U.S. & Canada Toll Free: (877) 841-2983 or International (215) 268-9893\nWEBCAST: www.ctltrust.net via the Investor Relations Section or click here to access\nREPLAY (Available for 30 days):\nU.S. & Canada Toll Free: (877) 660-6853 / International: (201) 612-7415\nConference ID#: 13755230\nTelephone Replays will be made available approximately 3 hours after the conference end time. Participants will be required to state their name and company upon accessing the replay.\nAdditional information, including the Trust’s Monthly and Quarterly Reports, as well as other filings with the SEC can be accessed via the Trust’s website at www.ctltrust.net.\nAbout Copper Property CTL Pass Through Trust\nCopper Property CTL Pass Through Trust (the “Trust”) was established to acquire 160 retail properties and 6 warehouse distribution centers (the “Properties”) from J.C. Penney as part of its Chapter 11 plan of reorganization. The Trust’s operations consist solely of owning, leasing and selling the Properties. The Trust’s objective is to sell the Properties to third-party purchasers as promptly as practicable. The Trustee of the trust is GLAS Trust Company LLC. The Trust is externally managed by an affiliate of Hilco Real Estate LLC. The Trust is intended to be treated, for tax purposes, as a liquidating trust within the meaning of United States Treasury Regulation Section 301.7701-4(d). For more information, please visit https://www.ctltrust.net/.\nForward Looking Statement\nThis news release contains certain “forward-looking statements”. All statements other than statements of historical fact are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. These statements may be identified by the use of forward looking terminology such as “anticipate,” “believe,” “continue,” “could,” “estimate,” “expect,” “intend,” “may,” “might,” “our vision,” “plan,” “potential,” “preliminary,” “predict,” “should,” “will,” or “would” or the negative thereof or other variations thereof or comparable terminology and include, but are not limited to, the Trust’s expectations or beliefs concerning future events and stock price performance. The Trust has based these forward-looking statements on its current expectations, assumptions, estimates and projections. While the Trust believes these expectations, assumptions, estimates and projections are reasonable, such forward-looking statements are only predictions and involve known and unknown risks and uncertainties, many of which are beyond its control. These factors, including those discussed in the Trust’s Registration Statement on Form 10 filed with the Securities and Exchange Commission (the “SEC”), may cause its actual results, performance or achievements to differ materially from any future results, performance or achievements expressed or implied by these forward-looking statements. For a further list and description of such risks and uncertainties, please refer to the Trust’s filings with the SEC that are available at www.sec.gov. The Trust cautions you that the list of important factors included in the Trust’s SEC filings may not contain all of the material factors that are important to you. In addition, in light of these risks and uncertainties, the matters referred to in the forward-looking statements contained in this news release may not in fact occur. The Trust undertakes no obligation to publicly update or revise any forward-looking statement as a result of new information, future events or otherwise, except as otherwise required by law.\nCONTACT\n|\nLarry Finger | Principal Financial Officer Copper Property CTL Pass Through Trust 310-526-1707 | lfinger@ctltrust.net |\nJessica Cummins | Sr VP Finance & Accounting Copper Property CTL Pass Through Trust 847-313-4755 | jcummins@hilcoglobal.com |\nReleased July 25, 2025"
    }
  ],
  "argos_summary": "JCPenney is shutting its Westminster Mall location in Orange County, California, with the store remaining open to the public until Nov. 16 and closing on or about Nov. 21. The WARN notice filed on Aug. 18 cites the loss of the lease and inability to secure a new site, affecting 76 employees who may be offered positions elsewhere. The closure is part of a broader pattern of JCPenney store shutdowns following its bankruptcy and recent sale of 119 stores to Onyx Partners for $947 million.",
  "argos_id": "P8AP425FM"
}