{
  "url": "https://www.forbes.com/councils/forbestechcouncil/2025/08/29/why-the-smartest-boards-treat-cybersecurity-as-a-business-enabler/",
  "authorsByline": "Avtar Sehmbi",
  "articleId": "3ed325b08bcd44f3b8083dcb3059a23e",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/672e0bb910d332484f9aec13/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-29T12:15:00+00:00",
  "addDate": "2025-08-29T12:23:37.100673+00:00",
  "refreshDate": "2025-08-29T12:23:37.100675+00:00",
  "score": 1.0,
  "title": "Why The Smartest Boards Treat Cybersecurity As A Business Enabler",
  "description": "In my experience advising executive teams and boards, cybersecurity delivers measurable commercial value in five key areas.",
  "content": "Having served as CISO and transformation head across global institutions including Deloitte, HSBC, Cigna and Verizon, I have seen cybersecurity evolve from a technical safeguard into a board-level growth priority. What was once a cost of compliance is now a core enabler of revenue, trust and resilience.\n\nIn today’s operating environment, cybersecurity is no longer treated as a back-office issue. It is a strategic function that shapes deal outcomes, partner access, product delivery and customer loyalty. The organizations that understand this shift are already gaining a competitive advantage.\n\nToday, digital trust is inseparable from business growth. Whether in investment banking, energy, telecoms or retail, customers expect their data to be protected, transactions to be secure and platforms to remain available. When those expectations are met, companies benefit from faster digital adoption, higher retention and a smoother path to market.\n\nI have seen entire deals influenced by the strength of a company's cybersecurity posture. Enterprise clients, especially in regulated sectors, are asking detailed questions about how their data is stored, processed and protected. In cloud-native product launches, embedding security from day one can make the difference between scalable success and delayed rollout.\n\nWhile at Deloitte, I supported several large-scale public sector transformation programs where cybersecurity certifications were not just preferred but required. Agencies handling sensitive citizen data would not even evaluate a proposal without clear evidence of high levels of security compliance.\n\nHigh-value, multiyear bids hinge entirely on an organization's ability to demonstrate security maturity. In these environments, cybersecurity was not just a governance measure. It was the price of market entry.\n\nThis same dynamic now defines private sector ecosystems. Across digital supply chains, third-party access is increasingly conditional on cybersecurity assurance. Organizations are placing contractual requirements on partners to align with frameworks such as ISO 27001, NIST and zero-trust architecture before integration, connectivity or data exchange is permitted.\n\nIn several firms I have worked with, onboarding required not just technical validation but also executive-level signoff confirming that cyber standards were met. These conditions are no longer unusual; they are becoming the norm. Cyber maturity now directly influences partner selection, accelerates onboarding and plays a critical role in closing commercial deals.\n\nRegulations such as the EU’s Digital Operational Resilience Act (DORA), New York’s DFS cyber rules and India’s Digital Personal Data Protection Act are reinforcing this trend, but the real shift is commercial. Cybersecurity has become a de facto condition of trust, access and growth.\n\nIn my experience advising executive teams and boards, cybersecurity delivers measurable commercial value in five key areas:\n\n1. Customer Trust: Strong security builds confidence. In both B2B and B2C markets, it accelerates conversions and supports long-term relationships. We all want our information to stay safe perpetually.\n\n2. Operational Resilience: The ability to prevent, detect and respond to incidents protects business continuity and supports regulatory compliance. We all want our information to be available when we need it.\n\n3. Protection Of Intellectual Property: Guarding proprietary algorithms, source code and product designs protects margin and preserves competitive advantage, and who doesn’t want to stay ahead of the competition?\n\n4. Data Monetization: Companies that can manage and share data securely unlock new revenue streams through advanced analytics, personalization and third-party integration. Here again, why would we not want to leverage a revenue opportunity?\n\n5. Partner Of Choice Status: In platform models and digital ecosystems, cybersecurity maturity determines who becomes the default integration point for others.\n\nThis transformation also demands new skills and structures, and leading organizations no longer isolate cybersecurity in a single function, instead using an embedding strategy across teams, including product, engineering, legal, procurement and customer experience teams.\n\nIn high-performing firms, I have seen cybersecurity included in leadership development curriculum across onboarding, vendor evaluation, developers and marketers, to name a few. Cyber is no longer a niche capability. It is becoming the core of what we all need to know and think about in our day-to-day lives.\n\nWhat Boards And CEOs Must Prioritize\n\nFor boards and executive leadership, several priorities now define cyber-aligned strategy:\n• Align cyber investment with commercial KPIs, not just audit metrics.\n• Treat resilience as a condition of product readiness and market expansion.\n• Maintain board-level oversight and governance that connects cyber to enterprise risk.\n\nOf course, in the banking environment, cyber is a core component of non-financial risk management; however, these embedded structures are now traversing across financial services, as boards increase preparedness through cyber incident simulations and resilience planning.\n\nThe Rise Of The Cyber-Savvy CEO\n\nThis is where the concept of the \"cyber CEO\" becomes essential. Today’s finance and operations leaders are not only responsible for managing cost and compliance. They are increasingly expected to understand how cybersecurity contributes to growth, customer confidence and long-term enterprise value.\n\nCybersecurity is now part of sales conversations, procurement terms, investor disclosures and platform roadmaps. Treating it as a cost center misses the strategic opportunity.\n\nDone well, cybersecurity reduces churn, protects brand equity, shortens sales cycles and increases partner confidence. It is no longer just a risk topic; it is clearly now a revenue focus.\n\nis an invitation-only community for world-class CIOs, CTOs and technology executives.",
  "medium": "Article",
  "links": [
    "https://www.linkedin.com/in/avtarsehmbi/",
    "https://www.meity.gov.in/static/uploads/2024/06/2bf1f0e9f04e6fb4f8fef35e82c42aa5.pdf",
    "https://councils.forbes.com/forbestechcouncil?utm_source=forbes.com&utm_medium=referral&utm_campaign=forbes-links&utm_content=in-article-ad-links",
    "https://www.dfs.ny.gov/industry_guidance/cybersecurity",
    "https://www.eiopa.europa.eu/digital-operational-resilience-act-dora_en",
    "https://councils.forbes.com/qualify?utm_source=forbes.com&utm_medium=referral&utm_campaign=forbes-links&utm_term=ftc&utm_content=in-article-ad-links"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "cybersecurity maturity",
      "weight": 0.078199714
    },
    {
      "name": "Cybersecurity",
      "weight": 0.07597504
    },
    {
      "name": "cybersecurity",
      "weight": 0.07597504
    },
    {
      "name": "cybersecurity certifications",
      "weight": 0.07474341
    },
    {
      "name": "cybersecurity assurance",
      "weight": 0.073682055
    },
    {
      "name": "Cyber maturity",
      "weight": 0.05933398
    },
    {
      "name": "cyber incident simulations",
      "weight": 0.057581417
    },
    {
      "name": "cyber investment",
      "weight": 0.057017226
    },
    {
      "name": "digital trust",
      "weight": 0.056813277
    },
    {
      "name": "partner access",
      "weight": 0.055219974
    }
  ],
  "topics": [
    {
      "name": "Security"
    },
    {
      "name": "Cyber Crime"
    },
    {
      "name": "Security Breach"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Computer Security/Network Security",
      "score": 0.76171875
    },
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.609375
    },
    {
      "name": "/Computers & Electronics/Enterprise Technology/Other",
      "score": 0.56494140625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.482177734375
    },
    {
      "name": "/Business & Industrial/Business Operations/Management",
      "score": 0.382568359375
    },
    {
      "name": "/News/Technology News",
      "score": 0.33935546875
    }
  ],
  "sentiment": {
    "positive": 0.24050827,
    "negative": 0.24728104,
    "neutral": 0.51221067
  },
  "summary": "Cybersecurity has evolved from a technical safeguard to a board-level growth priority, becoming a central enabler of revenue, trust and resilience. Cybersecurity is no longer being treated as a back-office issue, but as a strategic function that shapes deal outcomes, partner access, product delivery and customer loyalty. Companies that understand this shift gain a competitive advantage. The author suggests that cyber security is now a de facto condition of trust, access and growth. Cyber maturity now directly influences partner selection, onboarding and playing a critical role in closing commercial deals. The article also notes that cybersecurity is now being included in leadership development curriculum across onboarding, vendor evaluation, developers and marketers. It suggests that boards and executive leadership must define cyber-aligned strategy with commercial KPIs, not just audit metrics, but also increase preparedness through cyber incident planning.",
  "shortSummary": "Cybersecurity has evolved from a technical safeguard to a strategic business enabler, driving increased trust, trust, and resilience within organizations, enhancing revenue and trust.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4f865584d9e84f34bff8c102a4704a99",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dfs.ny.gov/industry_guidance/cybersecurity",
      "text": "Introduction\nOn March 1, 2017, the Department of Financial Services enacted a regulation establishing cybersecurity requirements for financial services companies, 23 NYCRR Part 500 (referred to below as “Part 500” or “the Cybersecurity Regulation”). Part 500 was amended for the first time in April 2020 to change the date of the required annual certification filing from February 15 of each year to April 15.\nSince the regulation was adopted, the cybersecurity landscape has changed tremendously as threat actors have become more sophisticated and more prevalent, cyberattacks have become easier to perpetrate (such as with ransomware as a service) and more expensive to remediate, and additional cybersecurity controls are available to manage cyber risk at reasonable cost. Moreover, the Department has found, from investigating hundreds of cybersecurity incidents, that there is a tremendous amount that organizations can do to protect themselves. As a result, Part 500 was amended again, effective November 1, 2023.\nNotably, DFS-regulated individuals and entities required to comply with the amended Cybersecurity Regulation (referred to below as “Covered Entities”) continue to include, but are not limited to, partnerships, corporations, branches, agencies, and associations operating under, or required to operate under, a license, registration, charter, certificate, permit, accreditation, or similar authorization under the Banking Law, the Insurance Law, or the Financial Services Law.\nThis Resource Center is designed to help explain how to comply with the Cybersecurity Regulation. Among other things, it provides links to industry guidance, FAQs and provides detailed information on how to submit cybersecurity-related filings, including notifications to DFS regarding compliance, cybersecurity incidents, and exemption status.\nThis Resource Center is frequently updated, and you may sign up for email updates on important regulatory guidance, cybersecurity alerts, and other information related to cybersecurity in the financial services sector by going to the DFS Email Updates Signup Page and subscribing to Cybersecurity Updates. These emails will come from the email address [email protected].\nQuestions regarding the Cybersecurity Regulation may be sent to [email protected].\nAmended Cybersecurity Regulation\nOn November 1, 2023, DFS announced amendments to Cybersecurity Regulation, 23 NYCRR Part 500. (See the final adopted regulatory documents on the Regulatory Activity - Financial Services Law page.)\nTraining and Compliance Resources\nTo help regulated entities plan for compliance, the Department has developed the following Part 500 resources:\n- Cybersecurity Regulation Training Presentation (PDF)\n- Cybersecurity Regulation Training Presentation (Video)\n- 'Am I Exempt from DFS's Cybersecurity Regulation?' Flowchart (PDF)\n- Requirement Checklist (for Regulated Entities with Limited Exemptions) (PDF)\n- Cybersecurity Program Template (PDF)\nAdditional videos, resources, and training opportunities will be posted to this section of the Cybersecurity Resource Center.\nKey Compliance Dates\nThe amended regulation’s new compliance requirements will take effect in phases. Unless otherwise specified, covered entities have 180 days from date of adoption to come into compliance, or until April 29, 2024. Changes to reporting requirements take effect one month after publication of the amended regulation, or December 1, 2023. For certain other requirements, the regulation provides for up to one year, 18 months, or two years to come into compliance.\nThe below Cybersecurity Implementation Timelines outline key compliances dates for each of the categories of businesses impacted by the amended regulation:\n- Implementation Timeline for Small Businesses\n- Implementation Timeline for Class A Businesses\n- Implementation Timeline for Covered Entities\nPart 500 Video Refreshers\nDFS Cybersecurity Regulation Refresher: Cybersecurity Awareness Training\nDFS Cybersecurity Regulation Refresher: Multi-Factor Authentication\nDFS Cybersecurity Regulation Refresher: Encryption Requirements\nDFS Cybersecurity Regulation Refresher: Enhanced Governance Requirements\nDFS Cybersecurity Regulation Refresher: Incident Response & Business Continuity and Disaster Recovery Plans\nDFS Cybersecurity Regulation Refresher: Incident Response & Business Continuity and Disaster Recovery Plans\nDFS Cybersecurity Regulation Refresher: Monitoring\nIndustry Guidance\nRecent Updates (past 6 months)\nCybersecurity Alerts and Advisories\nOther Cybersecurity-Related Industry Letters\n- See all Industry Letters\nCybersecurity-Related Reports and Publications\n| Subject | Date |\n|---|---|\n| Report on the SolarWinds Cyber Espionage Attack and Institutions’ Response (related press release) | April 2021 |\n| Twitter Investigation Report (related press release) | October 2020 |\n| Update on Cybersecurity in the Banking Sector: Third Party Service Providers | April 2015 |\n| Report on Cybersecurity in the Insurance Sector | February 2015 |\n| Report on Cybersecurity in the Banking Sector | May 2014 |\n- See all Reports and Publications\nCybersecurity-Related Settlements\nSee all DFS Enforcement Actions\nFAQs\nAnswers to frequently asked questions concerning the Cybersecurity Regulation are below. Capitalized terms used below have the meanings assigned to them in the definition section of Part 500. “Section” references are to sections of the Cybersecurity Regulation unless otherwise stated. The Department may revise or update the below information from time to time, as appropriate.\n500.1 Definitions\n(d) Class A Company\nAn Affiliate of a Class A Company with business operations in NY only has to comply with DFS’s Cybersecurity Regulation if it is a Covered Entity. In other words, affiliates of Class A Companies must comply with relevant sections of Part 500 only if the entity operates under or is required to operate under a “license, registration, charter, certificate, permit, accreditation or similar authorization” pursuant to New York’s Banking, Insurance, or Financial Services Law. 23 NYCRR § 500.1(e) (defining Covered Entity).\n(e) Covered Entities\nYes. Both HMOs and CCRCs are Covered Entities. Pursuant to the Public Health Law, HMOs must receive authorization and prior approval of the forms they use and the rates they charge for comprehensive health insurance in New York. The Public Health Law subjects HMOs to DFS authority by making provisions of the Insurance Law applicable to them. CCRCs are required by Insurance Law Section 1119 to have contracts and rates reviewed and authorized by DFS. The Public Health Law also subjects HMOs and CCRCs to the examination authority of the Department. As this authorization is fundamental to the ability to conduct their businesses, HMOs and CCRCs are Covered Entities because they are \"operating under or required to operate under\" DFS authorizations pursuant to the Insurance Law, and whether or not they are regulated by another governmental entity is irrelevant to this determination.\nUnder N.Y. Banking Law Section§ 590(2)(b-1), an Exempt Mortgage Loan Servicer needs to notify DFS that it will act as a servicer. Since the notification is not an authorization from the Department, an exempt Mortgage Loan Servicer is not a Covered Entity under Section 500.1(e). However, if an Exempt Mortgage Loan Servicer also holds a license or, registration, or received approval under the provisions of Section§ 418.2(e) of Part 418 of the Superintendent’s Regulations, it will be considered a Covered Entity and required to comply with the Cybersecurity Regulation. Given the increasing cybersecurity risks that all financial services organizations face, DFS strongly encourages all financial institutions, including those Exempt Mortgage Loan Servicers that are not Covered Entities, to adopt cybersecurity protections consistent with those required by Part 500.\nYes. Not-for-profit mortgage brokers are Covered Entities. 3 NYCRR Part 39.4(e) provides that Mortgage Brokers \"which seek exemption may submit a letter application,” along “with such information as may be prescribed by” the Superintendent, to the Mortgage Banking unit of the Department at the address set forth in Section 1.1 of Supervisory Policy G 1. As this authorization is necessary for a not-for-profit Mortgage Broker, it is a Covered Entity under Part 500.\nYes, they are considered Covered Entities and, as such, must comply with Part 500. Only the Information Systems supporting the branch, agency or representative office, and the Nonpublic Information of the branch, agency or representative office, are subject to the applicable requirements of Part 500, whether through the branch's, agency's, or representative office's development and implementation of its own cybersecurity program or through the adoption of an Affiliate's cybersecurity program.\n500.2 Cybersecurity Program\nA Covered Entity may adopt an Affiliate's cybersecurity program in whole or in part as provided for in Section 500.2(d), as long as the Covered Entity's overall cybersecurity program meets all requirements of Part 500. The Covered Entity remains responsible for full compliance with the requirements of Part 500. To the extent a Covered Entity relies on an Affiliate's cybersecurity program in whole or in part, that program must be made available for examination by the Department.\n500.4 Cybersecurity Governance\nTo the extent a Covered Entity utilizes an employee of an Affiliate or Third-Party Service Provider to serve as the Covered Entity's CISO for purposes of Section 500.4(a), the Covered Entity retains full responsibility for compliance with the requirements of Part 500 at all times, including ensuring that the CISO responsible for the Covered Entity is performing the duties consistent with this Part.\nYes. The Senior Governing Body is defined in Section 500.1(q) and includes an appropriate committee of the board of directors.\n500.9 Risk Assessment\nThe Risk Assessment required by Sections 500.9 & 500.2(b) is the foundation of the comprehensive cybersecurity program required by DFS’s Cybersecurity Regulation, and a cyber assessment framework is a useful component of a comprehensive Risk Assessment. DFS does not require a specific standard or framework for use in the risk assessment process. Rather, DFS expects Covered Entities to use a framework and methodology that best suits their risk and operations. Among the widely used frameworks Covered Entities employ are the CRI Profile and the NIST Cybersecurity Framework.\nYes. Section 500.9(a) states that Risk Assessments “shall be reviewed and updated as reasonably necessary, but at a minimum annually, and whenever a change in the business or technology causes a material change to the Covered Entity’s cyber risk.” Furthermore, Section 500.8(b) states that the institution’s application security “procedures, guidelines and standards shall be reviewed, assessed and updated as necessary by the CISO (or a qualified designee) of the Covered Entity at least annually.” Accordingly, when a Covered Entity is acquiring or merging with a new company, the Covered Entity will need to do a factual analysis of how the requirements of Part 500 apply to that particular acquisition. Some important considerations include, but are not limited to, the type of business the acquired company engages in, the target company’s cybersecurity risks including its access to Nonpublic Information, the safety and soundness of the Covered Entity, and the integration of data systems. The Department emphasizes that Covered Entities must conduct thorough due diligence and prioritize cybersecurity when considering any new acquisitions.\nWhen a subsidiary or other Affiliate of a Covered Entity presents risks to the Covered Entity’s Information Systems or the Nonpublic Information stored on those Information Systems, those risks must be evaluated and addressed in the Covered Entity’s Risk Assessment, cybersecurity program and cybersecurity policies (see Sections 500.9, 500.2 and 500.3, respectively). Other regulatory requirements may also apply, depending on the individual facts and circumstances.\nUnder Part 500, the Covered Entity is responsible for compliance with respect to its Information Systems. Therefore, the Covered Entity must evaluate and address any risks that a BHC (or other Affiliate of the Covered Entity) presents to the Covered Entity’s Information Systems and/or Nonpublic Information. For example, if a Covered Entity shares its data, including Nonpublic Information, and Information Systems with a BHC, the Covered Entity must ensure that such shared data and systems are protected. Specifically, the Covered Entity must evaluate and address in its Risk Assessment, cybersecurity program and cybersecurity policies the risks that the BHC poses with respect to such shared Information Systems and/or Nonpublic Information. In the same manner, a Covered Entity must also evaluate and address other cybersecurity risks that a BHC may pose to it. A Covered Entity will ultimately be held responsible for protecting its Information Systems and Nonpublic Information that are shared with a BHC or that otherwise may be subjected to risk by a BHC. Other regulatory requirements may also apply, depending on the individual facts and circumstances.\nPart 500 covers a broad range of Covered Entities that vary in size, type of business, and scope of operations, among other things. Since the Cybersecurity Regulation takes a risk-based approach, what constitutes a “material change” to a Covered Entity’s cyber risk that requires reviewing and updating their Risk Assessment will vary depending on the specific circumstances of the Covered Entity. When making this determination, Covered Entities should consider various factors, including but not limited to, the industry in which they operate, their size, the type and amount of data they maintain or can access, and the size and nature of potential impact to its cybersecurity risk created by the change in business or technology.\nFor example, merging with or acquiring another company very likely constitutes a material change that would require reviewing and potentially updating a Covered Entity’s Risk Assessment. Similarly, a plan to migrate or outsource key business processes or other key workloads or data to a Third-Party Service Provider will very likely constitute a material change that would require a review and potential update of the Covered Entity’s Risk Assessment.\n500.11 Third-Party Service Provider Security Policy\nNo. The Department emphasizes the importance of a thorough due diligence process in evaluating the cybersecurity practices of a Third-Party Service Provider. Solely relying on the Certification of Material Compliance will not be adequate due diligence. Covered Entities must assess the risks each Third-Party Service Provider poses to their Nonpublic Information and Information Systems and effectively address those risks.\nSection 500.11, among other things, generally requires a Covered Entity to develop and implement written policies and procedures designed to ensure the security of the Covered Entity’s Information Systems and Nonpublic Information that are accessible to, or held by, Third-Party Service Providers. Section 500.11(b) requires a Covered Entity to include in those policies and procedures guidelines, as applicable, addressing certain enumerated issues. Accordingly, Section 500.11(b) requires Covered Entities to make a Risk Assessment regarding the appropriate controls for Third-Party Service Providers based on the individual facts and circumstances presented and does not create a one-size-fits-all solution.\nYes. If an entity is both a Covered Entity and a Third-Party Service Provider, the entity is responsible for meeting the requirements of Part 500 as a Covered Entity.\nWhen a Covered Entity is using an independent UR agent, that Covered Entity should be treating them as Third-Party Service Providers. Since UR agents will be receiving Nonpublic Information from that Covered Entity, that Covered Entity must assess the risks each Third-Party Service Provider poses to their data and Information Systems and effectively address those risks. The Covered Entity will ultimately be responsible for ensuring that their data and systems are protected.\n500.12 Multi-Factor Authentication\nBased on its Risk Assessment, each Covered Entity must use effective controls, which may include MFA or risk-based authentication, to protect against unauthorized access to Nonpublic Information or Information Systems. MFA must be used for any individual accessing the Covered Entity’s internal networks from an external network, unless the Covered Entity’s CISO has approved in writing the use of reasonably equivalent or more secure access controls.\nStarting on November 1, 2025, a Covered Entity will be required to use MFA for any individual accessing any Information Systems of the Covered Entity, regardless of location, type of user, and type of information contained on the Information System being accessed, unless the Covered Entity has a CISO that approves in writing the use of reasonably equivalent or more secure compensating controls (and reviews this determination periodically but at a minimum annually), or the Covered Entity qualifies for a limited exemption pursuant to Section 500.19(a), in which case MFA shall only be required for (1) remote access to the Covered Entity’s Information Systems, (2) remote access to third-party applications, including but not limited to those that are cloud based, from which Nonpublic Information is accessible, and (3) all privileged accounts other than service accounts that prohibit interactive login. If a Covered Entity that is exempt under Section 500.19(a) also has a CISO, the CISO may also grant the exception described above.\nYes. Under Section 500.12(b), MFA is required when accessing internal networks from an external network unless the Covered Entity’s Chief Information Security Officer has approved in writing the use of reasonably equivalent or more secure access controls. Internal networks include email, document hosting, and related services whether on-premises or in the cloud such as, for example, O365 and G-Suite. These services contain Nonpublic Information that Covered Entities are required to protect.\n500.17 Notices to Superintendent\n500.17(a): Cybersecurity Incidents\nSection 500.17(a) requires Covered Entities to notify DFS as promptly as possible but in no event later than 72 hours after determining that a Cybersecurity Incident has occurred at the Covered Entity, its Affiliates, or a Third-Party Service Provider.\nA Cybersecurity Incident is a Cybersecurity Event that (1) impacts the Covered Entity and requires the Covered Entity to notify any government body, self-regulatory agency or any other supervisory body; (2) has a reasonable likelihood of materially harming any material part of the normal operation(s) if the Covered Entity; or (3) results in the deployment of ransomware within a material part of the Covered Entity’s information system. (Section 500.1(g)) A Cybersecurity Event is any act or attempt, whether successful or not, to gain unauthorized access to, disrupt, or misuse an information system or information stored on such system. (Section 500.1(d))\nAn attack on a Covered Entity may constitute a reportable Cybersecurity Event even if the attack is not successful. The Department recognizes that Covered Entities are regularly subject to many attempts to gain unauthorized access to, disrupt or misuse Information Systems and the information stored on them, and that many of these attempts are thwarted by the Covered Entities’ cybersecurity programs. The Department anticipates that most unsuccessful attacks will not be reportable, but seeks the reporting of those unsuccessful attacks that, in the considered judgment of the Covered Entity, are sufficiently serious to raise a concern. For example, notice to the Department under Section 500.17(a) would generally not be required if, consistent with its Risk Assessment, a Covered Entity makes a good faith judgment that the unsuccessful attack was of a routine nature.\nThe Department believes that analysis of unsuccessful threats is critically important to the ongoing development and improvement of cybersecurity programs, and Covered Entities are encouraged to continually develop their threat assessment programs. Notice of the especially serious unsuccessful attacks may be useful to the Department in carrying out its broader supervisory responsibilities, and the knowledge shared through such notice can be used to timely improve cybersecurity generally across the industries regulated by the Department. Accordingly, Covered Entities are requested to notify the Department of those unsuccessful attacks that appear particularly significant based on the Covered Entity’s understanding of the risks it faces. For example, in making a judgment as to whether a particular unsuccessful attack should be reported, a Covered Entity might consider whether handling the attack required measures or resources well beyond those ordinarily used by the Covered Entity, like exceptional attention by senior personnel or the adoption of extraordinary non-routine precautionary steps.\nThe Department recognizes that Covered Entities’ focus should be on preventing cybersecurity attacks and improving systems to protect the institution and its customers. The Department’s notice requirement is intended to facilitate information sharing about serious events that threaten an institution’s integrity and that may be relevant to the Department’s overall supervision of the financial services industries. The Department trusts that Covered Entities will exercise appropriate judgment as to which unsuccessful attacks must be reported and does not intend to penalize Covered Entities for the exercise of honest, good faith judgment.\nYes. Section 500.17(a) must be read in combination with other laws and regulations that apply to consumer privacy. Under Section 500.17(a)(1), a Covered Entity must notify the Department of any Cybersecurity Event for which notice is required to be provided to “any government body, self-regulatory agency or any other supervisory body,” which includes many Cybersecurity Events that involve consumer harm, whether actual or potential. To offer just one example, New York’s information security breach and notification law requires notices to affected consumers and to certain government bodies following a data breach. Under Section 500.17(a)(1), when such a data breach constitutes a Cybersecurity Event, it must also be reported to the Department.\nIn addition, under Section 500.17(a), Cybersecurity Events must be reported to the Department if they “have a reasonable likelihood of materially harming any material part of the normal operation(s)” of the Covered Entity. To the extent this type of Cybersecurity Event involves material consumer harm, it is covered by this provision.\nYes. Section 500.17(a) requires a Covered Entity that has been impacted by a Cybersecurity Event that occurred at one of its Third-Party Service Providers to notify DFS if the Covered Entity is also required to notify any government body, self-regulatory agency, or any other supervisory body. This is required of the Covered Entity even if the Third-Party Service Provider also notifies DFS. Reporting Cybersecurity Events such as these enables the Department to more rapidly identify techniques used by attackers and alert industry, respond quickly to new threats, and continue to protect consumers and the financial services industry.\nDFS’s Cybersecurity Regulation does not explicitly require a Covered Entity to notify consumers affected by a Cybersecurity Event, but New York’s information security breach and notification law, N.Y. Gen Bus. Law § 899-aa, does require a Covered Entity to notify consumers affected by a Cybersecurity Event in certain circumstances. Furthermore, the Cybersecurity Regulation does require Covered Entities to maintain incident response plans that address external communications, including those required to be sent to consumers affected by a Cybersecurity Event.\n500.17(b): Notice of Compliance\n500.17(b)(1): Annual Compliance Notification of Certification of Material Compliance or Acknowledgment of Noncompliance\nNo. A chapter amendment referenced in the Governor’s signing memorandum on Senate Bill 2659-B was introduced on January 8, 2025. The amendment, when enacted, clarifies that only Covered Entities, as defined in Section 500.1(e), are required to notify DFS of Cybersecurity Incidents, as defined in Section 500.1(g), in accordance with Section 500.17(a). Accordingly, when amended, the SHIELD Act only requires businesses and individuals “operating under or required to operate under a [DFS] license, registration, charter, certificate, permit, accreditation or similar authorization under the Banking Law, the Insurance Law or the Financial Services Law” to notify DFS of a data breach if that data breach “(1) impacts the covered entity and requires the covered entity to notify any government body, self-regulatory agency or any other supervisory body; (2) has a reasonable likelihood of materially harming any material part of the normal operation(s) of the covered entity; or (3) results in the deployment of ransomware within a material part of the covered entity’s information systems.” 23 NYCRR §§ 500.1(e), 500.1(g), and 500.17(a).\nNo. The amendment to the SHIELD Act, signed into law on December 21, 2024, and revised on February 14, 2025, does not limit or modify any existing reporting requirements currently imposed on Covered Entities, which are defined in 23 NYCRR § 500.1(e). Section 500.17(a) of the Cybersecurity Regulation requires Covered Entities to notify DFS of Cybersecurity Incidents, as defined in Section 500.1(g), to DFS electronically through the DFS Portal. Detailed information on requirements related to Cybersecurity Incidents can be found in the Report a Cybersecurity Incident section of this website.\n500.17(b): Notice of Compliance\n500.17(b)(1): Annual Submission of Certification of Material Compliance or Acknowledgment of Noncompliance\nNo. Each Covered Entity is required to notify DFS of its own compliance with Part 500 annually.\nA Covered Entity may not submit a certification of material compliance under Section 500.17(b) unless the Covered Entity was in material compliance with all applicable requirements of Part 500 for the calendar year for which it is certifying. A Covered Entity that was not in material compliance with the Cybersecurity Regulation for the preceding calendar year must file an Acknowledgment of Noncompliance pursuant to Section 500.17(b)(1)(ii).\nIt depends on the exemption for which the Covered Entity qualifies. If it qualifies for a full exemption pursuant to Section 500.19(b), (e), or (g), and submitted a Notice of Exemption, the Covered Entity does not need to submit an annual compliance notification. If, however, the Covered Entity qualifies for a limited exemption and filed a Notice of Exemption pursuant to Sections 500.19(a), (c) or (d), it does need to submit an annual notification regarding its compliance.\nIf the Covered Entity filed a Notice of Exemption under sections 500.19(a), (c) or (d), it is still required to file an annual compliance notification with the sections of the Cybersecurity Regulation that apply to it as specified in the regulation. Consequently, if a Covered Entity filed for an exemption under subsection (a) of Section 500.19, it is still required to: maintain a cybersecurity program as required in Section 500.2; maintain a cybersecurity policy as required in Section 500.3; limit access privileges as required in Section 500.7; conduct a Risk Assessment as required by Section 500.9; implement a Third-Party Service Provider policy as required by Section 500.11; limit data retention as required in Section 500.13; and provide notices to DFS as required by Section 500.17, which includes submitting cybersecurity incident and extortion payment notifications and annual compliance notifications.\nAdditionally, starting in November 2024, Covered Entities qualifying for a Section 500.19(a) exemption will also be required to comply with the Multi-Factor Authentication requirements in Section 500.12 and provide cybersecurity awareness training pursuant to Section 500.14(a)(3).\nIf a Covered Entity qualifies for an exemption under Sections 500.19(c) or (d) it is still required to: conduct a Risk Assessment as required by Section 500.9; implement a Third-Party Service Provider policy as required by Section 500.11; limit data retention as required in Section 500.13; and provide notices to the Superintendent as required by Section 500.17, which includes submitting cybersecurity incident and extortion payment notifications and annual compliance notifications.\nAll Covered Entities, including non-residents, are required to submit notifications regarding their compliance unless they qualify for a full exemption pursuant to Section 500.19(b), (e), or (g) and have filed a Notice of Exemption.\nIt depends. An individual licensee may be exempt from the requirement to submit an annual compliance notification only if they do not otherwise qualify as a Covered Entity and qualify as an:\n- inactive individual insurance broker (subject to Insurance Law Section 2104) who (a) does not maintain, control or use, even indirectly, any Information Systems and does not maintain any Nonpublic Information, and (b) has not, for anything of value, acted or aided in any manner in soliciting, negotiating or selling any policy or contract or in placing risks or taking out insurance on behalf of another person for at least one year;\n- individual insurance agent placed in inactive status under Insurance Law Section 2103; or\n- individual mortgage loan originator placed in inactive status under Banking Law Section 599-i.\nHowever, an individual licensee not working in the field may qualify for a limited exemption pursuant to Section 500.19(c) if the individual does not maintain any Information Systems and does not possess any Nonpublic Information, including information concerning former or potential customers. Section 500.19(c) is a limited exemption that still requires compliance with certain provisions of the regulation (see table below in the Part 500 Exemptions section of this website), including the requirement to submit an annual compliance notification.\nA Covered Entity must determine whether any noncompliance with the Cybersecurity Regulation was significant in the overall context of the Covered Entity’s circumstances. When making that determination, Covered Entities should consider various factors, including but not limited to, the industry in which they operate, their size, the type and amount of data they maintain or can access, and the nature, duration, scope, and potential impact of the noncompliance.\nOne example of material noncompliance that would require a Covered Entity to file an Acknowledgment of Noncompliance is the failure to conduct a cybersecurity Risk Assessment since its Cybersecurity Program must be based on such a Risk Assessment. See 23 NYCRR § 500.2(b). Another example of material noncompliance is the failure of a Covered Entity to implement procedures designed to ensure the security of Information Systems and Non-public Information that are accessible to, or held by, Third-Party Service Providers, especially in light of the significant cybersecurity risks associated with Third-Party Service Providers.\nOn the other hand, a single event involving an inadvertent lapse in the operation of the cybersecurity program of short duration and with no or minimal impact is not likely to be considered an instance of material noncompliance that would require the filing of an Acknowledgment of Noncompliance. However, several immaterial violations, when considered in the aggregate, might constitute a material violation, necessitating an Acknowledgment of Noncompliance be filed instead of a Certification of Material Compliance.\nNo matter which notification is filed, Covered Entities must maintain all relevant records, schedules, and other documentation and data supporting their decision to file that type of notification, including documentation regarding the reasons why such decisions were made. See 23 NYCRR § 500.17(b)(3).\n500.17(b)(2): Signatories\nThe annual compliance notification for an individual licensee only needs to be signed by the individual as that individual is functionally acting as the highest-ranking executive and Senior Officer responsible for the cybersecurity program of the Covered Entity.\nThe annual compliance notification must be signed by the highest-ranking executive at a Covered Entity and that Covered Entity’s CISO. The term CISO is defined in Section 500.1(c) as “a qualified individual responsible for overseeing and implementing a covered entity’s cybersecurity program and enforcing its cybersecurity policy.” Part time or outsourced CISOs may sign the annual compliance notification provided that they meet these standards.\nOften, part time and outsourced CISOs provide services that are based on contracts that limit the scope of their duties and responsibilities. If a Covered Entity uses a part time or outsourced CISO, the Covered Entity itself is responsible for its compliance with the Cybersecurity Regulation and is required to designate a senior member of its personnel to oversee a part time or outsourced CISO.\nIf a Covered Entity does not have its own CISO as defined in Section 500.1(c), then the senior officer responsible for the cybersecurity program of the Covered Entity must sign the annual compliance notification along with the CEO or highest-ranking executive of the Covered Entity.\nAll Covered Entities that do not qualify for an exemption are required to designate a CISO pursuant to Section 500.4(a). A CISO is defined in Section 500.1(c) as “a qualified individual responsible for overseeing and implementing a covered entity’s cybersecurity program and enforcing its cybersecurity policy.”\nIf the Covered Entity designates an individual that is qualified, and responsible for overseeing and implementing its cybersecurity program and enforcing its cybersecurity policy, then that individual should sign the annual compliance notification as the CISO.\n500.17(b)(3): Documentation\nYou do not need to send supporting documentation if you are submitting a Certification of Material Compliance. If you are submitting an Acknowledgment of Noncompliance, you must identify all sections of the Cybersecurity Regulation you did not materially comply with, describe the nature and extent of such noncompliance, and provide a remediation timeline or confirmation that remediation has been completed. No additional explanatory or other materials are required as part of these submissions.\nThe Cybersecurity Regulation does require, however, that Covered Entities maintain records, schedules, and data that support their annual compliance notification – whether a certification or an acknowledgment -- for 5 years and provide such information to the Department upon request. The information you must keep includes, but is not limited to, the identification of all areas, systems, and processes that require or required material improvement, updating or redesign, remedial efforts undertaken to address such areas, systems and processes, and remediation plans and timelines for their implementation.\n500.19 Exemptions\nWhether an individual who performs services for a Covered Entity is an independent contractor or an employee for purposes of Section 500.19(a) depends upon many factors including how much control the Covered Entity has over the individual, whether the services provided are integral to the Covered Entity’s business operations, and whether the Covered Entity sets the individual’s work hours, requires prior permission for absences, reserves the right to terminate the individual on short notice, provides benefits, compensates the individual hourly or the same amount each week, and provides equipment, facilities, tools or supplies. The ultimate decision rests upon the actual relationship between the individual and the Covered Entity and not how many hours a week the individual works, or language in a contract, if one exists, between the Covered Entity and the individual.\nIn general, independent contractors are in business for themselves, make their services available to the public, and perform services without supervision or direction from the Covered Entity. Alternatively, employees typically are subject to a Covered Entity’s supervision and direction, work at the Covered Entity’s offices and use the Covered Entity’s computers, supplies and other tools, and are paid a salary.\nTo qualify for the limited exemption in Section 500.19(a)(1), a Covered Entity and all of its Affiliates combined must have a total of fewer than 20 employees and independent contractors. When determining how many employees and independent contractors a Covered Entity and its Affiliates have, a Covered Entity must include all of the Covered Entity’s employees and independent contractors and all of the Covered Entity’s Affiliates’ employees and independent contractors regardless of where any of the employees and independent contractors are located.\nNote that Affiliate is defined very broadly in Section 500.1 as any individual or entity, including but not limited to any partnership, corporation, branch, agency or association, that controls, is controlled by, or is under common control with any other individual or entity, including but not limited to any partnership, corporation, branch, agency or association. For purposes of this definition, control means the possession, direct or indirect, of the power to direct or cause the direction of the management and policies of a person, whether through the ownership of stock of such person or otherwise.\nYes, but a Covered Entity that qualifies for a limited exemption does not have to comply with every section of the Cybersecurity Regulation. Covered Entities that qualify for the limited exemption in Section 500.19(a) do not have to comply with Sections 500.4, 500.5, 500.6, 500.8, 500.10, 500.14(a)(1), 500.14(a)(2), 500.14(b), 500.15 and 500.16; those that qualify for a limited exemption in Section 500.19(c) do not have to comply with Sections 500.2, 500.3, 500.4, 500.5, 500.6, 500.7, 500.8, 500.10, 500.12, 500.14, 500.15 and 500.16; and those that qualify for the limited exemption in Section 500.19(d) do not have to comply with Sections 500.2, 500.3, 500.4, 500.5, 500.6, 500.7, 500.8, 500.10, 500.12, 500.14, 500.15 and 500.16. Notably, all of the limited exemptions require qualifying Covered Entities to submit an annual compliance notification regarding their compliance with Part 500, but they only need to notify DFS about their compliance with the sections applicable to them based on their exemption.\nA Covered Entity qualifying for a limited exemption pursuant to Section 500.19(a) must comply with Sections 500.2, 500.3, 500.7, 500.9, 500.11, 500.12, 500.13, 500.14(a)(3), and 500.17. A Covered Entity qualifying for a limited exemption pursuant to Section 500.19(c) or (d) must comply with sections 500.9, 500.11, 500.13 (as of November 1, 2025, this will also include asset management requirements), and 500.17.\nWhen calculating gross annual revenue for purposes of determining whether a Covered Entity qualifies for an exemption under Section 500.19(a)(2), the Covered Entity must include (1) the gross annual revenue from all of its business operations regardless of whether such operations are located in NY or anywhere else in the world and (2) the gross annual revenue from the New York business operations of their Affiliates. If an Affiliate does not have any gross annual revenue from business operations in New York, its gross annual revenue does not need to be included in the calculation for purposes of qualifying for a Section 500.19(a)(2) limited exemption. The limited exemption set forth in Section 500.19(a) is, and always has been, meant for small businesses, not for small branches or affiliates of large companies.\n“Affiliate” is a term defined in the Cybersecurity Regulation as “any Person that controls, is controlled by or is under common control with another Person”, and “control” means “the possession, direct or indirect, of the power to direct or cause the direction of the management and policies of a person, whether through the ownership of stock of such person or otherwise.” 23 NYCRR § 500.1(a). The Cybersecurity Regulation defines “Person” as “any individual or entity, including but not limited to any partnership, corporation, branch, agency or association.” 23 NYCRR § 500.1(m).\nA Covered Entity is entitled to a Section 500.19(b) exemption in such cases only if it is an employee, agent, representative, or designee that is fully covered by the cybersecurity program of one of the Covered Entities for which it is an employee, agent, representative or designee. In other words, if a Covered Entity is an employee, agent, representative or designee of more than one other Covered Entity, it will only qualify for a Section 500.19(b) exemption if the cybersecurity program of at least one of those Covered Entities fully covers all aspects of its business.\nWhen submitting the notice for a Section 500.19(b) exemption, a Covered Entity must provide the name of the Covered Entity whose cybersecurity program its business is covered by, along with the name of an individual at that Covered Entity who can verify the coverage.\nTo qualify as a wholly owned subsidiary that is fully exempt from the requirements of Part 500 pursuant to Section 500.19(b), a Covered Entity must be (1) either directly or indirectly 100 percent owned by another Covered Entity and (2) covered by, and follow, the cybersecurity program of the parent Covered Entity.\nCovered Entities that have determined they qualify for an exemption should submit a Notice of Exemption within 30 days of making that determination. Notices of Exemption must be submitted through the DFS Portal. Instructions on How to File a Notice of Exemption can be found in the “Part 500 Exemptions” section of this website.\nYes. Section 500.19 subsections (a) through (e) set forth exemptions from different requirements of Part 500. Section 500.19(f) requires Covered Entities that qualify for any of those exemptions to submit a Notice of Exemption within 30 days of determining that it so qualifies.\nYes. If there are changes, the Covered Entity should amend its Notice of Exemption in the DFS Portal, where there is an option to choose “amend exemption.”\nThe Department also emphasizes that Notices of Exemption should be filed electronically via the DFS Portal. A Covered Entity should use the account it used to file its original Notice of Exemption or, if the Covered Entity’s exemption was submitted as part of a bulk filing, create a new account to amend its exemption.\nIf a Covered Entity ceases to qualify for a previously claimed exemption, the Covered Entity should, as soon as reasonably possible, notify the Department through the DFS Portal by terminating its previously filed exemption. Under Section 500.19(h), a Covered Entity has 180 days to comply with all applicable requirements of Part 500 once it ceases to qualify for an exemption.\nBy permission, the Department will approve the filing by certain Covered Entities of Notices of Exemption on behalf of their employees or captive agents who are also Covered Entities. This option, called “Bulk Filing,” will only be available if 50 or more employees or captive agents qualify for the same exemption.\nA Covered Entity that wants to use the Bulk Filing process should review the subsection on Bulk Exemption Submissions in the Part 500 Exemptions section of this site.\nExceptions/Deferrals to other regulators\nA CTF that is administered by another Covered Entity can rely on the cybersecurity program of that Covered Entity, as long as that cybersecurity program conforms with Part 500 and fully protects the CTF. Under these circumstances, the Covered Entity must submit a Certification of Compliance with the Department. If the CTF is administered by a national bank, then the Department will defer to that bank’s primary regulator to ensure that the CTF has a proper cybersecurity program. Further, to protect markets, the Department strongly encourages all financial entities, including CTFs administered by national banks, to adopt cybersecurity protections consistent with the safeguards and protections of Part 500.\nNew York is a signatory to the Nationwide Cooperative Agreement, revised as of December 9, 1997 (the “Agreement”), an agreement among state banking regulators that addresses supervision in an interstate branching environment. Pursuant to the Agreement, the home state of a state-chartered bank with a branch or branches in New York under Article V-C of the New York Banking Law is primarily responsible for supervising such state-chartered bank, including its New York branches. In keeping with the Agreement’s goals of interstate coordination and cooperation with respect to the supervision and examination of bank branches, including compliance with applicable laws, DFS will defer to the home state supervisor for supervision and examination of the New York branches, with the understanding that DFS is available to coordinate and work with the home state in such supervision and examination. DFS notes that New York branches are required to comply with New York state law, and DFS maintains the right to examine branches located in New York. With respect to the Cybersecurity Regulation, given the ever-increasing cybersecurity risks financial institutions face, DFS strongly encourages all financial institutions, including New York branches of out-of-state domestic banks, to adopt cybersecurity protections consistent with the safeguards and protections of Part 500.\nPart 500 Exemptions\nCovered Entities may not have to comply with some or all of the Cybersecurity Regulation’s requirements if they qualify for an exemption. There are two types of exemptions: full and limited, both of which are in section 500.19. This section first explains what qualifies a Covered Entity for an exemption, then describes the cybersecurity requirements a Covered Entity must comply with if it qualifies for an exemption, and finally provides directions on how to submit notifications to the Department regarding a Covered Entity’s exempt status.\nQualifications for Full Exemptions\nThree subsections of 500.19 provide for full exemptions: 500.19(b), 500.19(e), and 500.19(g).\nTo qualify for a 500.19(b) exemption, a Covered Entity must be an employee, agent, wholly owned subsidiary, representative, or designee of another DFS-regulated business and all aspects of the Covered Entity’s business must be fully covered by the Cybersecurity Program of the other DFS-regulated business.\nTo qualify for a 500.19(e) exemption, a Covered Entity must be an inactive individual insurance broker (subject to Insurance Law section 2104) who (1) does not maintain, control or use, even indirectly, any Information Systems and does not have any Nonpublic Information; (2) has not, for anything of value, acted or aided in any manner in soliciting, negotiating, or selling any policy or contract or in placing risks or taking out insurance on behalf of another person for at least one year; and (3) does not otherwise qualify as a Covered Entity (for example, does not hold another type of license). For exact language, see 500.19(e).\nTo qualify for a 500.19(g) exemption, a Covered Entity must not otherwise qualify as a Covered Entity by virtue of another license and must be (1) a charitable annuity society, (2) a risk retention group not chartered in NY, (3) an individual insurance agent placed in inactive status under Insurance Law §2103, (4) an individual mortgage loan originator placed in inactive status under Banking Law §599-i, or (5) an accredited reinsurer, certified reinsurer, or recognized reciprocal jurisdiction reinsurer pursuant to 11 NYCRR Part 125. For exact language, see 500.19(g).\nQualifications for Limited Exemptions\nThree subsections of section 500.19 provide for limited exemptions: 500.19(a), 500.19(c), and 500.19(d).\nThere are three ways a Covered Entity may qualify for a 500.19(a) limited exemption:\n- A Covered Entity and its Affiliates combined must have fewer than 20 employees and independent contractors (500.19(a)(1));\n- To qualify for a limited exemption under §500.19(a)(2), a Covered Entity must have less than $7,500,000 in gross annual revenue in each of the last 3 fiscal years from (1) all its business operations, wherever located, and (2) its affiliates’ New York business operations.\n- A Covered Entity must have less than $15,000,000 in year-end total assets, including assets of all Affiliates.\nAffiliate, for purposes of the Cybersecurity Regulation and determining whether a Covered Entity qualifies for any of the 500.19(a) exemptions, is defined very broadly as “any person that controls, is controlled by, or is under common control with another person.” Control here “means the possession, direct or indirect, of the power to direct or cause the direction of the management and policies of a person, whether through the ownership of stock of such person or otherwise.” (500.1(a))\nTo qualify for a 500.19(c) limited exemption, a Covered Entity must not directly or indirectly operate, maintain, utilize, or control any Information Systems, and must not be required to, directly or indirectly control, own, access, generate, receive, or possess Nonpublic Information.\nTo qualify for a 500.19(d) limited exemption, a Covered Entity must be a captive insurance company that does not and is not required to directly or indirectly control, own, access, generate, receive, or possess Nonpublic Information other than information relating to its corporate parent company or affiliates.\nCybersecurity Requirements for Exempt Covered Entities\nIf a Covered Entity qualifies for a full exemption, it must submit a Notice of Exemption to DFS. As long as it remains qualified for a full exemption, it does not have to comply with any other section of the Cybersecurity Regulation.\nIf a Covered Entity qualifies for a Section 500.19(a), (c), or (d) limited exemption, it must submit a Notice of Exemption, comply with some sections of the Cybersecurity Regulation (which sections depend on the type of limited exemption and are listed in the table below), and submit annually a notice regarding the Covered Entity’s compliance with Part 500.\nThe below table outlines what sections of the regulation a Covered Entity is exempt from and must comply with if it qualifies for a Section 500.19(a) exemption.\n| Exemptions: | Compliance Requirements: |\n| 500.4 Cybersecurity governance | 500.2 Cybersecurity program |\n| 500.5 Vulnerability management | 500.3 Cybersecurity policy |\n| 500.6 Audit trail | 500.7 Access privileges and management |\n| 500.8 Application security | 500.9 Risk assessment |\n| 500.10 Cybersecurity personnel and intelligence | 500.11 Third-party service provider security policy |\n| 500.14(a)(1) Monitor user activity | 500.12 Multi-factor authentication (as of November 1, 2024) |\n| 500.14(a)(2) Implement risk-based controls to protect against malicious code | 500.13 Data retention requirements (as of November 1, 2025, this will also include asset management requirements) |\n| 500.14(b) Monitoring and training – for Class A companies | 500.14(a)(3) Provide cybersecurity awareness training (as of November 1, 2024) |\n| 500.15 Encryption of nonpublic information | 500.17 Notices to superintendent |\n| 500.16 Incident response and business continuity management |\nThe below table outlines what sections of the regulation a Covered Entity is exempt from and must comply with if it qualifies for a Section 500.19(c) or (d) exemption.\n| Exemptions: | Compliance Requirements: |\n| 500.2 Cybersecurity program | 500.9 Risk assessment |\n| 500.3 Cybersecurity policy | 500.11 Third-party service provider security policy |\n| 500.4 Cybersecurity governance | 500.13 Access management and data retention requirements (as of November 1, 2025, this will also include asset management requirements) |\n| 500.5 Vulnerability management | 500.17 Notices to superintendent |\n| 500.6 Audit trail | |\n| 500.7 Access privileges and management | |\n| 500.8 Application security | |\n| 500.10 Cybersecurity personnel and intelligence | |\n| 500.12 Multi-factor authentication | |\n| 500.14 Monitoring and training | |\n| 500.15 Encryption of nonpublic information | |\n| 500.16 Incident response and business continuity management |\nSubmitting Notice of Exemption Regarding Exempt Status\nCovered Entities that have determined they qualify for an exemption should submit a Notice of Exemption within 30 days of making that determination. 500.19(f). Some Covered Entities qualify for more than one exemption, and they can indicate that on their Notice of Exemption.\nCovered Entities must submit their Notices of Exemption through the DFS Portal. Detailed instructions for making this submission can be found in the Instructions on How to File a Notice of Exemption (PDF).\nAmending a Filed Exemption\nIf a Covered Entity no longer qualifies for an exemption, it should amend or terminate its Notice of Exemption within 30 days. A Covered Entity should amend its Notice of Exemption when its qualifications for an exemption change, but it still qualifies for at least one exemption. Covered Entities must amend their Notices of Exemption through the DFS Portal. Detailed instructions for amending exemption status can be found in the Instructions on How to Amend Previously Filed Notices of Exemptions (PDF).\nTerminating a Filed Exemption\nA Covered Entity that no longer qualifies for any exemption must terminate their exemption as soon as reasonably possible after they no longer qualify. No matter when the termination is submitted, however, the Covered Entity has 180 days from the date they are no longer qualified to become fully compliant with the Cybersecurity Regulation. Covered Entities must terminate their Notices of Exemption through the DFS Portal. Detailed instructions for notifying DFS that a Covered Entity no longer qualifies for an exemption can be found in the Instructions on How to Terminate Previously Filed Notices of Exemption (PDF).\nBulk Exemption Submissions\nCovered Entities that employ 50 or more individual Covered Entities that qualify for the same exemption may file exemptions on behalf of those employees through the bulk submission process.\nCovered Entities that qualify and would like access to use the bulk submission process should email the Department at [email protected] from the email address associated with their DFS Portal account, and the Department will send further instructions. The submitter will need to provide their name, DFS identification number, type of license, and email address for every Covered Entity on whose behalf they are submitting. The Covered Entity using the bulk submission process will be able to add and terminate exemptions as their employees’ employment and exemption status changes.\nCovered Entities that have their Notice of Exemption filed as part of a bulk filing will receive an email from DFS confirming the filing. The email will include a receipt number and list the exemption(s) filed. Covered Entities must retain a copy of this receipt number for future reference as it will be the only receipt you will get from DFS regarding the submission.\nPlease note that Covered Entities are ultimately responsible for ensuring their compliance with Part 500. Therefore, a Covered Entity must ensure that either their employer or they notify the Department of any changes in status.\nSubmission Confirmation\nAfter each submission is complete, the submitter will receive an email that includes a receipt number. The email receipt is the only confirmation of the submission that the submitter will receive. The receipt number is an important piece of information that should be kept by the Covered Entity. Covered Entities may need their receipt numbers to renew their licenses.\nSubmit a Compliance Filing\nCybersecurity Compliance Submission Notice: You will need a DFS Portal account to submit a cybersecurity filing via the DFS Portal – your LINX username and password will not work to access DFS Portal. If you are experiencing password login issues when trying to submit your annual cybersecurity filing, visit the Lost Passwords and Locked Accounts page on the DFS Portal and follow the instructions. The system is currently experiencing a high volume of submissions, which may result in system time outs. It this occurs while logging in or submitting your filing, please try again.\nStarting in 2024, Covered Entities will continue to be required to submit an annual notice regarding their compliance with Part 500, but will have the choice of submitting either a Certification of Material Compliance or an Acknowledgment of Noncompliance. Section 500.17(b). All Covered Entities that are not exempt from the requirement to comply with 500.17 must file one or the other each year by April 15 regarding their compliance during the previous calendar year. Covered Entities that qualify for a limited exemption pursuant to 500.19(a), (c), or (d) are required to submit one of these annual notifications by April 15 as well, but they only have to certify compliance or acknowledge noncompliance with the sections from which they are not exempt.\nAnnual notifications regarding compliance for the calendar year 2023 are due by April 15, 2024. They must be signed by the Covered Entity’s highest-ranking executive and its Chief Information Security Officer (“CISO”) or, if the Covered Entity does not have a CISO, the Senior Officer responsible for the cybersecurity program of the Covered Entity. Covered Entities may submit these notifications starting on January 1, 2024.\nCovered Entities that have more than one license must file separate annual notifications for each license they hold. Covered Entities must keep all data and documentation supporting their annual notifications for 5 years and provide that information to the Department upon request. 500.17(b)(3).\nCertification of Material Compliance\nCovered Entities that were materially compliant with all sections of the Cybersecurity Regulation that applied to it during the previous calendar year must submit a Certification of Material Compliance. See instructions for how to submit a Certification of Material Compliance below.\n- Certification of Material Compliance for Entities (PDF)\n- Certification of Material Compliance for Individual Licensees (PDF)\nAcknowledgment of Noncompliance\nIf a Covered Entity cannot certify that it was in material compliance with the Cybersecurity Regulation for the prior calendar year, it must file a written Acknowledgment of Noncompliance which (1) acknowledges that the Covered Entity did not materially comply with all the requirements applicable to it; (2) identifies all sections of Part 500 that the Covered Entity has not materially complied with; (3) describes the nature and extent of such noncompliance; and (4) provides a remediation timeline or confirmation that remediation has been completed. 500.17(b). To submit an acknowledgment, please go to the DFS Portal and follow the instructions below.\n- Acknowledgement of Noncompliance for Entities (PDF)\n- Acknowledgement of Noncompliance for Individual Licensees (PDF)\nNote to NY LINX Users: You will need a DFS Portal account to submit cybersecurity filings via the DFS Portal, your LINX username and password will not work to access DFS Portal.\nReport a Cybersecurity Incident\nCovered Entities must notify the Department of a Cybersecurity Incident as promptly as possible but in no event later than 72 hours after determining that a Cybersecurity Incident has occurred at the covered entity, its affiliates, or a third-party service provider. 500.17(a).\nA Cybersecurity Incident is any act or attempt, whether successful or not, to gain unauthorized access to, disrupt, or misuse an information system or information stored on such system that:\n- impacts the covered entity and requires the covered entity to notify any government body, self-regulatory agency or any other supervisory body;\n- has a reasonable likelihood of materially harming any material part of the normal operation(s) if the covered entity; or\n- results in the deployment of ransomware within a material part of the covered entity’s information system. 500.1(f) and (g)\nCovered Entities must report a Cybersecurity Incident to DFS through the DFS Portal. To ensure that reports are matched to the correct individual or entity, the Portal requires the submitter to use an identifying number. An identifying number can be a NYS License number, NAIC/NY Entity number, NMLS number, or Institution number. The DFS Portal contains a look-up feature for submitters who do not know any of their identifying numbers. To notify DFS of a Cybersecurity Incident, go to the DFS Portal and follow the Instructions on How to Report a Cybersecurity Incident (PDF).\nNote to NY LINX Users: You will need a DFS Portal account to submit cybersecurity filings via the DFS Portal, your LINX username and password will not work to access DFS Portal.\nReport an Extortion Payment\nUnfortunately, ransomware attacks continue to threaten financial services companies and their customers. DFS, like the FBI and other regulators, recommends against paying ransoms. While Covered Entities are not prohibited from making such payments, as of December 1, 2023, a Covered Entity that has made an extortion payment in connection with a cybersecurity event that occurred on its Information Systems must file a Notice of Extortion Payment within 24 hours of payment. Within 30 days of payment, the Covered Entity will be required to provide the reasons payment was necessary, alternatives to payment that were considered and the diligence, or research, it conducted to find these alternatives. Furthermore, the Covered Entity must describe the diligence it performed to ensure compliance with all applicable rules and regulations including those of the Office of Foreign Assets Control. 500.17(c). To notify DFS of an extortion payment, please go to the DFS Portal and follow the Instructions on How to Report an Extortion Payment (PDF).\nNote to NY LINX Users: You will need a DFS Portal account to submit cybersecurity filings via the DFS Portal, your LINX username and password will not work to access DFS Portal.\nSubmission Confirmation\nAfter each submission is complete, the submitter will receive an email that includes a receipt number. The email receipt is the only confirmation of the submission that the submitter will receive. The receipt number is an important piece of information that should be kept by the Covered Entity. Covered Entities may need their receipt numbers to update DFS regarding a reported Cybersecurity Incident.\nSupervision and Examinations\nTo safeguard financial services organizations and the confidential information of New Yorkers, DFS uses a multi-pronged approach to monitor cyber risk. The cyber supervision program supplements traditional examinations with new types of information-gathering and analysis activities intended to create a holistic view of the cybersecurity risk posture of the thousands of New York financial services firms regulated by DFS.\nThe Department's approach was a first among regulators when it was launched as a pilot in December 2021 and has three key components:\nRegulatory Examinations and Data Analysis\nDFS will continue to conduct regular examinations that include a focus on cybersecurity/IT risk and compliance. It will also assess Covered Entities for cybersecurity risk based on their previous examination reports, annual cybersecurity regulation compliance filings, reported incidents, and other regulatory filings.\nCyber Controls Assessment Questionnaires\nDFS will periodically ask Covered Entities to complete assessment questionnaires, such as the Cybersecurity and Information Technology Baseline Risk Questionnaire. Such questionnaires will be independent of the examination process and are based on similar assessments used by industry and insurers to assess risk for financial services companies.\nExternal Data Scans and Analysis\nTo better and faster assess cyber risk facing Covered Entities, DFS uses various sources of information to develop an “outside-in” view of cyber risk of specific regulated entities as well as New York State’s financial services sector overall. Such information may come from information-sharing arrangements with public sector partners and industry organizations. DFS also conducts data gathering and analysis through its dedicated Cyber Intelligence Unit which draws on a mix of sources including DFS data, publicly available information, and commercial scanning and threat analysis capabilities.\nProducers, Individual Licensees, and Small Businesses\nCybersecurity Compliance Submission Notice: If you are experiencing password login issues when trying to submit your annual cybersecurity filing, visit the Lost Passwords and Locked Accounts Portal page and follow the instructions. You will need a DFS Portal account to submit a cybersecurity filing via the DFS Portal – your LINX username and password will not work to access DFS Portal. The system is currently experiencing a high volume of submissions, which may result in system time outs. It this occurs while logging in or submitting your filing, please try again.\nThis part of the Cybersecurity Resource Center has been developed specifically for DFS-regulated individuals and small businesses. It is intended to provide clear, step-by-step instructions for complying with the Cybersecurity Regulation.\nStep 1. Determine whether you need to comply with the Cybersecurity Regulation.\nIf you have a license issued by DFS or are otherwise regulated by DFS, you must comply with the Cybersecurity Regulation. That is because the Cybersecurity Regulation applies to all individuals and small businesses that are “operating under or required to operate under a license, registration, charter, certificate, permit, accreditation or similar authorization” under the Banking, Insurance or Financial Services Laws. Section 500.1(e).\nStep 2. Determine whether you qualify for any of the exemptions listed in the Cybersecurity Regulation.\nMany individual brokers, agents, and adjusters, as well as some small businesses, qualify for an exemption. The exemptions are listed in Section 500.19 and fall into two categories: full and limited.\nExemptions available to DFS-regulated individuals and small businesses\nFull Exemptions\nThree subsections of 500.19 provide for full exemptions: 500.19(b), 500.19(e), and 500.19(g).\nTo qualify for a 500.19(b) exemption, a Covered Entity must be an employee, agent, wholly owned subsidiary, representative or designee of another DFS-regulated business and all aspects of the Covered Entity’s business must be fully covered by the Cybersecurity Program of the other DFS-regulated business (referred to as the Covering Entity). Individuals who only work for one company and do not work on any other outside matters typically qualify for this exemption.\nTo qualify for a 500.19(e) exemption, a Covered Entity must be an inactive individual insurance broker (subject to Insurance Law section 2104) who (1) does not maintain, control or use, even indirectly, any Information Systems and does not have any Nonpublic Information; (2) has not, for anything of value, acted or aided in any manner in soliciting, negotiating or selling any policy or contract or in placing risks or taking out insurance on behalf of another person for at least one year; and (3) does not otherwise qualify as a Covered Entity (for example, does not hold another type of license). For exact language, see 500.19(e).\nTo qualify for a 500.19(g) exemption, a Covered Entity must not otherwise qualify as a Covered Entity by virtue of another license and must be (1) a charitable annuity society, (2) a risk retention group not chartered in NY, (3) an individual insurance agent placed in inactive status under Insurance Law §2103, (4) an individual mortgage loan originator placed in inactive status under Banking Law §599-i, or (5) an accredited reinsurer, certified reinsurer, or recognized reciprocal jurisdiction reinsurer pursuant to 11 NYCRR Part 125. For exact language, see 500.19(g).\nWhether you qualify for one of these exemptions depends on your specific circumstances. DFS cannot make that determination for you.\nLimited Exemptions\nIf you don’t qualify for any of the full exemptions, you may qualify for a limited exemption, which means that, if you qualify, you must submit a Notice of Exemption through the DFS Portal, comply with certain sections of the Cybersecurity Regulation (which we will discuss in Step 4), and submit an annual Certification of Material Compliance or Acknowledgment of Noncompliance.\nThe following are the most common exemptions for small businesses and individuals: Sections 500.19(a)(1), 500.19(a)(2), and 500.19(a)(3).\nTo qualify under Section 500.19(a)(1), a business, along with any Affiliates, must have fewer than 20 employees and independent contractors.\nTo qualify for a limited exemption under §500.19(a)(2), an individual or small business must have less than $7,500,000 in gross annual revenue in each of the last 3 fiscal years from (1) all its business operations, wherever located, and (2) its affiliates’ New York business operations.\nTo qualify under Section 500.19(a)(3), an individual or business must have less than $15,000,000 in year-end total assets, including assets of all Affiliates.\nAffiliate, for purposes of the Cybersecurity Regulation and determining whether any of the 500.19(a) exemptions apply, is defined very broadly as “any person that controls, is controlled by or is under common control with another person.” Control here “means the possession, direct or indirect, of the power to direct or cause the direction of the management and policies of a person, whether through the ownership of stock of such person or otherwise.”\nIndividuals and small businesses may also qualify for the limited exemption set forth in Section 500.19(c) if they (1) do not operate, maintain, use, or control a computer or other device that holds electronic data, including phones; and (2) do not, and are not required to, control, own, access, generate, receive, or possess confidential customer and other sensitive business and private information.\nYou may qualify for more than one of the limited exemptions listed above. If you do, you should indicate that when you submit your Notice of Exemption.\nWhether you qualify for an exemption depends on your specific circumstances. DFS cannot make that determination for you.\nIf you do NOT qualify for an exemption, you must comply with all sections of the Cybersecurity Regulation and can skip Steps 3 and 4.\nStep 3. If you qualify for one or more limited exemptions or the 500.19(b) or 500.19(e) full exemptions, submit a Notice of Exemption.\nTo receive the benefits of qualifying for an exemption, you must submit a Notice of Exemption through the DFS Portal (see instructions on setting up a DFS Portal account.)\nNote that if you qualify for a full exemption pursuant to Section 500.19(b), you will need to provide the name of the Covering Entity (the DFS-regulated entity whose cybersecurity program covers all aspects of your work) when submitting your Notice of Exemption. If your business qualifies for the Section 19(b) exemption because it is a wholly owned subsidiary of another DFS-regulated entity, you will need to provide the name of your DFS-regulated parent company whose cybersecurity program covers all aspects of your business’s work. You or your business cannot claim yourself or itself as the Covering Entity or parent company.\nNotices of Exemption are good until they are terminated which means you do not need to submit a Notice each year; however, if you qualify for a full exemption pursuant to Sections 500.19(b), (e), or (g), you should review your status every year to determine whether you still qualify for the exemption. If you qualify for a limited exemption pursuant to Sections 500.19(a), (c), or (d), you will be asked whether you still qualify for an exemption when you submit your annual Certification of Material Compliance or Acknowledgment of Noncompliance.\nIf your qualifications for an exemption have changed (for example, when you stop working for the DFS-regulated company or stop using their cybersecurity program), you are responsible for making sure your exemption is amended or terminated. If your company submitted a Notice of Exemption on your behalf, the company may terminate your exemption, but it is your responsibility to make sure that is done.\n- Instructions on How to File a Notice of Exemption (PDF)\n- Instructions on How to Amend Previously Filed Notices of Exemptions (PDF)\n- Instructions on How to Terminate Previously Filed Notices of Exemption (PDF)\nIf you qualify for a full exemption and have submitted your Notice of Exemption, you do not need to proceed past this step. However, if you only qualify for one or more limited exemptions pursuant to Section 500.19(a), (c) or (d), you must submit a Notice of Exemption AND proceed to Step 4.\nStep 4. If you qualify for one of the limited exemptions, determine which sections of the Cybersecurity Regulation you must comply with.\nIf you qualify for a Section 500.19(a)(1), (2), or (3) exemption, you are still required to: maintain a cybersecurity program as required in Section 500.2 and cybersecurity policies as required in Section 500.3; limit access privileges as required in Section 500.7; conduct a Risk Assessment as required by Section 500.9; implement a Third-Party Service Provider policy as required by Section 500.11; limit data retention as required in Section 500.13; and provide notices to DFS as required by Section 500.17, which includes submitting cybersecurity incident and extortion payment notifications and annual notifications regarding its compliance.\nAdditionally, starting in November 2024, you will also be required to comply with the MFA requirements in Section 500.12 and provide cybersecurity awareness training pursuant to Section 500.14(a)(3).\nIf you qualify for a Section 500.19(c) or (d) exemption, you are still required to: conduct a Risk Assessment as required by Section 500.9; implement a Third-Party Service Provider policy as required by Section 500.11; limit data retention as required in Section 500.13; and provide notices to the Superintendent as required by Section 500.17, which includes submitting cybersecurity incident and extortion payment notifications and annual notifications regarding its compliance.\nImportantly, if you qualify for a limited exemption, you still must submit a Certification of Material Compliance or an Acknowledgment of Noncompliance by April 15 every year pursuant to Section 500.17. However, you only need to certify that you are materially complying with the sections of the Cybersecurity Regulation that are applicable to you or acknowledge your noncompliance with those sections.\nStep 5. Take action to comply with the sections of the Cybersecurity Regulation applicable to you.\nOnce you determine which sections of the Cybersecurity Regulation apply to you (see Step 4), take action to comply. You can use the short descriptions below to prepare a list of the sections that apply to you along with any needed actions.\nSection 500.2 – Maintain a cybersecurity program. This section requires you to have a cybersecurity program that enables you or your company to identify and assess cybersecurity risks; protect nonpublic information (such as confidential customer information or sensitive business information) and the computers, phones, and other electronic devices storing such information from unauthorized access and other malicious acts; detect, respond, and recover from cybersecurity events; and comply with applicable regulatory reporting obligations.\nSection 500.3 – Maintain cybersecurity policies. This section requires you to establish and maintain written cybersecurity policies that essentially comprise the framework for your cybersecurity program. These policies should be created after an assessment of your cybersecurity risks. Those risks include how much data you hold, the types of data you hold, the number of people who can access that data, and other similar factors. DFS partnered with the Global Cyber Alliance (GCA) to develop a set of cybersecurity policy templates which can provide a helpful starting point for individuals and small businesses.\nYou only need to establish and maintain policies that are relevant to your business, but you must consider whether you need policies that cover the following topics and controls, all of which are listed in Section 500.3:\n- Information security\n- Data governance and classification\n- Asset inventory and device management\n- Access controls and identity management\n- Business continuity and disaster recovery planning and resources\n- Systems operations and availability concerns\n- Systems and network security\n- Systems and network monitoring\n- Systems and application development and quality assurance\n- Physical security and environmental controls\n- Customer data privacy\n- Vendor and third-party provider management\n- Risk assessment\n- Incident response\nAs of April 29, 2024, you will also be required to consider whether you need policies that cover the following areas:\n- Data retention\n- End of life management\n- Remote access\n- Security awareness and training\n- Application security\n- Incident notification\n- Vulnerability management\nYour policies need to be approved by your senior leadership, such as a senior officer or manager or an appropriate committee of your board (if one exists).\nSection 500.7 – Control who can access your computer system and nonpublic information. This section requires you to know who has access to the confidential customer and business information held by your business AND to limit that access to people who need it for their job. This section also requires you to periodically review who has and needs such access.\nAs of May 1, 2025, you must also impose limits with respect to privileged accounts, only allow secure connections where devices can be remotely controlled, promptly terminate access when employees leave, and have a written password policy that meets industry standards, among other things.\nSection 500.9 – Conduct risk assessments. You must base your cybersecurity program on the identification, evaluation, and prioritization of cybersecurity risks to your business operations, including but not limited to risks to your Information Systems, the Nonpublic Information maintained on those systems, and your customers. You must conduct periodic risk assessments in accordance with written policies and procedures which have to include: the criteria you will use to evaluate and categorize identified cybersecurity risks and threats; the criteria you will use to assess the confidentiality, integrity, security, and availability of your Information Systems and the Nonpublic Information maintained on them; and requirements that describe how identified risks will be controlled, minimized, or accepted and how your cybersecurity program will address those risks. These assessments must be reviewed and updated at least annually and when any changes to your business or technology materially impacts your cyber risk.\nSection 500.11 – Maintain a policy regarding the use of third-party service providers. You must have written policies and procedures designed to ensure the security of the confidential customer and sensitive business information that is accessible to, or held by, third parties. A third party, for purposes of the Cybersecurity Regulation, is an individual or organization that provides services to you, has access to your confidential customer and other sensitive business information, and is not affiliated with you or your company. Law firms, internet hosting companies, and electronic storage providers are examples of third-party service providers.\nSection 500.13 – Limit the data you keep. You must not keep confidential customer and sensitive business information any longer than it is needed for business purposes. A legitimate business purpose includes anything you are required to retain by law or regulation.\nAs of November 1, 2025, you will also need to have policies in place to implement and maintain an up-to-date asset inventory covering your information systems.\nSection 500.17 – The following are required notifications to DFS:\n- Annual Compliance Submissions – Submit either a Certification of Material Compliance or an Acknowledgment of Noncompliance each year by April 15th regarding your compliance during the previous calendar year.\n- If you were materially compliant with all sections of the Cybersecurity Regulation that applied to you during the previous calendar year, submit a Certification of Material Compliance.\n- If you cannot certify that you were in material compliance with the sections of the Cybersecurity Regulation that were applicable to you during the prior calendar year, you must submit an Acknowledgment of Noncompliance which (1) acknowledges that you did not materially comply with all the requirements applicable to you; (2) identifies all sections of the Cybersecurity Regulation that you have not materially complied with; (3) describes the nature and extent of the noncompliance; and (4) provides a remediation timeline or confirmation that remediation has been completed.\n- Cybersecurity Incident Notifications – Notify DFS within 72 hours after you determine that you experienced a Cybersecurity Incident, which includes acts or attempts to gain unauthorized access to, disrupt, or misuse your Information Systems or the Nonpublic Information stored on those Information Systems that:\n- impacted you and required you to notify another government body, self-regulatory agency or any other supervisory body;\n- has a reasonable likelihood of materially harming any material part of your normal operations; or\n- resulted in the deployment of ransomware within a material part of your Information Systems.\n- Extortion Payment Notifications – If you make an extortion payment in connection with a Cybersecurity Event that occurred on your Information Systems, you must notify DFS within 24 hours of payment. Within 30 days of payment, you must provide the reasons payment was necessary, alternatives to payment that were considered and the diligence, or research, you conducted to find these alternatives. You must also describe the diligence you performed to ensure compliance with all applicable rules and regulations including those of the Office of Foreign Assets Control.\nIf you qualify for a Section 500.19(a) limited exemption, as of November 1, 2024, you will also need to comply with two other Sections of the Cybersecurity Regulation: Section 500.12 and Section 500.14(a)(3).\nSection 500.12 – Use multi-factor authentication (“MFA”) for any remote access you allow into your information systems, or to third-party applications where Nonpublic Information is accessible (including any cloud applications), or to privileged accounts. If – and only if – you have a CISO, you may be able to use reasonably equivalent or more secure compensating controls as long as the CISO approves and reviews the controls to ensure their reasonable equivalence at least annually.\nSection 500.14(a)(3) – Provide cybersecurity awareness training that includes social engineering for all personnel at least annually.\nIf you do not qualify for any exemption, then you must comply with all sections of the Cybersecurity Regulation. The above list does NOT include a discussion of all of the sections that are applicable to you if you don’t qualify for an exemption.\nStep 6. If you are complying with all of the sections of the Cybersecurity Regulation applicable to you, submit a Certification of Material Compliance annually by April 15. If not, submit an Acknowledgment of Noncompliance by April 15.\nIf you qualify for an exemption and are in material compliance with the sections of the Cybersecurity Regulation that are applicable to you, submit a Certification of Material Compliance by April 15 of each year through the DFS Portal.\nIf you cannot certify that you were in material compliance with the Cybersecurity Regulation for the prior calendar year, you must submit a written Acknowledgment of Noncompliance which (1) acknowledges that you did not materially comply with all the requirements applicable to you; (2) identifies all sections of Part 500 that you have not materially complied with; (3) describes the nature and extent of such noncompliance; and (4) provides a remediation timeline or confirmation that remediation has been completed. See Section 500.17(b).\nIf you do not qualify for an exemption, submit a Certification of Material Compliance or an Acknowledgment of Noncompliance by April 15 of each year through the DFS Portal.\nAnswers to Questions Frequently Asked by Individuals and Small Businesses\nQuestions regarding DFS Portal submissions (Section 500.17)\n1. What should I do if I am having trouble logging in to the DFS Portal or resetting my password?\nNote: You will need to create a DFS Portal account, your LINX username and password will not work for DFS Portal. If you have a Portal account and have reset your password, and are still not able to log in, email [email protected] with “Trouble Logging into the Portal” or “Password Reset” in the subject line. If you haven’t received a response within 10 business days from the date you sent your message, DFS may not have received it. In this event, please resend your email.\nIf you did not receive an email from DFS after making a submission, you may email [email protected] with “Confirm My Submission” in the subject line. We will need your name or your company’s name (as it appears on the DFS license) and one of the following for you or your company: NYS License number, NAIC number, NMLS Identification number, or Institution number.\nQuestions regarding filing annual notifications regarding compliance (Certifications of Material Compliance and Acknowledgements of Noncompliance) (Section 500.17(b))\nAll Covered Entities, including non-residents, are required to submit notifications of their compliance unless they qualify for a full exemption pursuant to Section 500.19(b), (e), or (f) and have filed a Notice of Exemption.\n4. If I am licensed by DFS but not currently working in the field, do I need to submit an annual notification regarding my compliance?\nThe following inactive licensees who do not otherwise qualify as a Covered Entity (for example, who do not hold another type of license) are exempt from the annual requirement to notify DFS regarding their compliance:\n- inactive individual insurance brokers (subject to Insurance Law section 2104) who (a) do not maintain, control or use, even indirectly, any Information Systems and do not have any Nonpublic Information, and (b) have not, for anything of value, acted or aided in any manner in soliciting, negotiating or selling any policy or contract or in placing risks or taking out insurance on behalf of another person for at least one year;\n- individual insurance agents placed in inactive status under Insurance Law §2103; and\n- individual mortgage loan originators placed in inactive status under Banking Law §599-i.\nIf none of the above apply to your situation, then as long as you are licensed by DFS, you need to comply with the Cybersecurity Regulation. However, you may qualify for the limited exemption pursuant to Section 500.19(c) which applies to any regulated entity or licensed Person that does not maintain any Information Systems and does not possess any Nonpublic Information, including information concerning former or potential customers. Even if you do qualify, Section 500.19(c) is a limited exemption that still requires compliance with certain provisions of the regulation (see table below), including the requirement to submit an annual Certification of Material Compliance or an Acknowledgment of Noncompliance.\nThe annual notification of compliance that is required by Section 500.17(b) must be signed by the Covered Entity’s highest-ranking executive and its Chief Information Security Officer (“CISO”) or, if the Covered Entity does not have a CISO, the Senior Officer responsible for the cybersecurity program of the Covered Entity. If you are an individual, you should sign as the highest-ranking executive and if you don’t have a CISO – even a virtual one or one at a managed service provider – you should sign as the senior officer responsible for your cybersecurity program.\nYou do not need to send supporting documentation if you are submitting a Certification of Material Compliance. If you are submitting an Acknowledgment of Noncompliance, you must identify all sections of the Cybersecurity Regulation you did not materially comply with, describe the nature and extent of such noncompliance, and provide a remediation timeline or confirmation that remediation has been completed. No additional explanatory or other materials are required as part of these submissions.\nThe Cybersecurity Regulation does require, however, that Covered Entities maintain records, schedules, and data that support their annual notification – whether a certification or an acknowledgment -- for 5 years and provide such information to the Department upon request. The information you must keep includes, but is not limited to, the identification of all areas, systems, and processes that require or required material improvement, updating or redesign, remedial efforts undertaken to address such areas, systems and processes, and remediation plans and timelines for their implementation.\nQuestions About Limited Exemptions (500.19(a), (c), and (d))\nIt depends on the exemption for which you qualify. If you qualify for a full exemption pursuant to Section 500.19(b), (e), or (g), and submitted a Notice of Exemption, you do not need to submit an annual notification regarding your compliance. If, however, you qualify for a limited exemption and filed a Notice of Exemption pursuant to Sections 500.19(a), (c) or (d), you do need to submit an annual notification regarding your compliance with the sections of the Cybersecurity Regulation applicable to you based on the exemption for which you qualify. For example, if you qualify for a Section 500.19(a) exemption, you must file an annual notification regarding your compliance only with Sections 500.2, 500.3, 500.7, 500.9, 500.11, and 500.17.\nUnder Section 500.19(a)(1), which is also referred to as the Small Business Exemption, smaller Covered Entities are exempted from certain requirements of Part 500 when a Covered Entity and all of its Affiliates combined have a total of fewer than 20 employees and independent contractors. When determining whether a Covered Entity and its Affiliates have fewer than 20 employees and independent contractors, all of the Covered Entity’s employees and independent contractors and all of the Covered Entity’s Affiliates’ employees and independent contractors must be counted regardless of where any of the employees and independent contractors are located.\nNote that Affiliate is defined very broadly in Section 500.1 as any individual or entity, including but not limited to any partnership, corporation, branch, agency or association, that controls, is controlled by, or is under common control with any other individual or entity, including but not limited to any partnership, corporation, branch, agency or association. For purposes of this definition, control means the possession, direct or indirect, of the power to direct or cause the direction of the management and policies of a person, whether through the ownership of stock of such person or otherwise.\nQuestions about full exemptions (Section 500.19(b))\nYou are entitled to a Section 500.19(b) exemption in this case only if you are an employee, agent, representative, or designee that is fully covered by the cybersecurity program of one of the Covered Entities for which you are an employee, agent, representative or designee. In other words, if you are an employee, agent, representative or designee of more than one other Covered Entity, you will only qualify for a Section 500.19(b) exemption if the cybersecurity program of at least one of those Covered Entities fully covers all aspects of your business.\nWhen submitting the notice for a Section 19(b) exemption, you must provide the name of the Covered Entity whose cybersecurity program your business is covered by, along with the name of an individual at that Covered Entity who can verify the coverage.\nIf you work for a company that has 50 or more employees who qualify for an exemption, and your company has submitted a Notice of Exemption on your behalf through the bulk filing process, you must ask your employer to terminate your exemption when you stop working for that company. If you cannot confirm that they have done so, you may terminate your exemption. See the Instructions on How to Terminate Previously Filed Notices of Exemption to learn how to do so.\nYes. If there are any changes, you should amend your Notice of Exemption by going to the DFS Portal where there is an option to choose “amend exemption.”\nDISCLAIMER: This part is explanatory and provided for informational purposes only. In the event of an inconsistency between this part and the Cybersecurity Regulation, the Cybersecurity Regulation will prevail.\nTools for Small Businesses\nAs doing business online becomes indispensable, it is essential that small businesses protect themselves and their customers from cybercrime. However, cybersecurity can be especially challenging for small businesses.\nThe Department is committed to supporting small businesses in this regard. To help improve their cybersecurity, DFS has partnered with the Global Cyber Alliance (GCA) to highlight the availability of free cybersecurity resources. GCA has created a Cybersecurity Toolkit for Small Business that contains a set of free tools, guidance, resources, and training for small businesses. It is targeted to small businesses that do not have a dedicated cybersecurity staff.\nBecause governance is critical to effective cybersecurity, DFS also partnered with GCA to develop sample cybersecurity policies. These policies are designed to help small businesses install the governance and procedures necessary for effective cybersecurity. The sample policies provide a helpful starting point for all small businesses.\nThe sample policies include:\n- Cybersecurity Policy\n- Access Control Policy\n- Asset Inventory & Device Management Policy\n- Data Classification Policy\n- Physical & Environmental Security Policy\n- Risk Assessment Policy\n- System & Network Security Policy\n- Third Party Service Provider Policy\nAll cybersecurity policies created by a business should be tailored to the business’s specific needs, risks, resources, and structure. Some businesses may require additional actions beyond those suggested in the sample policies; likewise, not every action suggested will be required for every business. Policies based only on the samples therefore may not constitute full compliance with state and federal laws and regulations, including the Cybersecurity Regulation. Best practices can also change over time.\nBusinesses should review their policies for accuracy, completeness, and applicability, and update them as needed based on their risk assessments.\nMore guidance for small businesses can be found in our Information for Small Businesses section.\nOther small business resources\nArchived Materials\nMaterials in this section were on our Resource Center previously. Given the evolving cybersecurity landscape, they have been replaced with materials set forth in the other sections of this Resource Center. Everything currently required of Covered Entities can be found in the sections above and the materials in the other sections supersede any conflicting material found below.\n- May 24, 2022: Spotlight on Small Business: DFS and the Global Cyber Alliance Share Achievable Cybersecurity Controls for Smaller Organizations\n- April 26, 2022: The Human Factor: Leadership, Governance, and Diversity in Cybersecurity\n- March 29, 2022: The Unrelenting Cybersecurity Battle: 5 Years of Evolving Threats and Control\n- December 10, 2014: Industry Letter Regarding New Cyber Security Examination Process"
    },
    {
      "url": "https://www.linkedin.com/in/avtarsehmbi/",
      "text": "“Avtar is a very rare global leader who combines extensive industry expertise with compassion, charisma, and authenticity which inspires and builds high performing totally committed organizations. This naturally drives productivity, collaboration innovation, morale, creativity etc. in other words, remarkable results. But this is not just about building teams, his global expertise is remarkable, and the diversity of experience across operations, technology, finance, innovation through multi-industries with a global pedigree and purview allows Avtar to draw upon these experiences and create a clear vision, execution goals and results. Throughout this, another notable experience if you ever have the privilege to be part of his organization in the future is, Avtar manages to stay focused on empathy, kindness, and implements a people-first approach (every time!). A true visionary and exceptional leader. If you're looking for a leader who will inspire, motivate, and mobilize all to move the organization forward, look no further.”\nAbout\nActivity\n-\nI’d choose influence over authority anytime, and so should you. Here’s why! Many think authority is the mark of effective leadership. But I believe…\nI’d choose influence over authority anytime, and so should you. Here’s why! Many think authority is the mark of effective leadership. But I believe…\nLiked by Avtar Sehmbi\n-\nStill using MS Word for creating resumes? 🚫 It’s time to upgrade to tools that are faster, easier, and ATS-friendly (Applicant Tracking…\nStill using MS Word for creating resumes? 🚫 It’s time to upgrade to tools that are faster, easier, and ATS-friendly (Applicant Tracking…\nLiked by Avtar Sehmbi\n-\nEarlier this year, I visited Mumbai, Pune, and Chennai with Al Tarasiuk, Head of Foundational Services at CIti. From insightful meetings to…\nEarlier this year, I visited Mumbai, Pune, and Chennai with Al Tarasiuk, Head of Foundational Services at CIti. From insightful meetings to…\nLiked by Avtar Sehmbi\nExperience & Education\nRecommendations received\n64 people have recommended Avtar\nJoin now to viewMore activity by Avtar\n-\nPrivileged to have shared the stage at the Khaleej Times #FutureSec2025 conference with the amazing Dee Deu CISSP , Jacob Mathew and Mohamed EL…\nPrivileged to have shared the stage at the Khaleej Times #FutureSec2025 conference with the amazing Dee Deu CISSP , Jacob Mathew and Mohamed EL…\nLiked by Avtar Sehmbi\n-\nPlease join me in a shout out to all the global Eskenzi PR and Marketing team! On today's team call I was told by the modest bunch that I have…\nPlease join me in a shout out to all the global Eskenzi PR and Marketing team! On today's team call I was told by the modest bunch that I have…\nLiked by Avtar Sehmbi\n-\nHappy Fourth to everyone celebrating. I would like to extend my warmest wishes to all our customers, clients, and members across the US and around…\nHappy Fourth to everyone celebrating. I would like to extend my warmest wishes to all our customers, clients, and members across the US and around…\nLiked by Avtar Sehmbi\n-\nWishing you a peaceful Eid filled with joy, meaning, and moments that nourish both heart and health. From all of us at Cigna Healthcare. نتمنى لكم…\nWishing you a peaceful Eid filled with joy, meaning, and moments that nourish both heart and health. From all of us at Cigna Healthcare. نتمنى لكم…\nLiked by Avtar Sehmbi\n-\nOur Cigna Healthcare International Health IHSLT team gathered in Dubai last week for an impactful two-day Team Health Meeting led by Paul Allen from…\nOur Cigna Healthcare International Health IHSLT team gathered in Dubai last week for an impactful two-day Team Health Meeting led by Paul Allen from…\nLiked by Avtar Sehmbi\n-\nOur Head of HR, Yadhu Kishore Nandikolla, recently joined industry leaders at KPMG’s flagship event, “Global Mobility: New World, Be Brave” in a…\nOur Head of HR, Yadhu Kishore Nandikolla, recently joined industry leaders at KPMG’s flagship event, “Global Mobility: New World, Be Brave” in a…\nLiked by Avtar Sehmbi\n-\nWhy India’s GCC ecosystem is becoming the world’s AI sandbox India’s Global Capability Centers (GCCs) are undergoing a profound evolution. From once…\nWhy India’s GCC ecosystem is becoming the world’s AI sandbox India’s Global Capability Centers (GCCs) are undergoing a profound evolution. From once…\nLiked by Avtar Sehmbi\n-\nThis is an exciting time for Cigna Healthcare International Health in the Asia Pacific region. I am incredibly proud of the role we play in…\nThis is an exciting time for Cigna Healthcare International Health in the Asia Pacific region. I am incredibly proud of the role we play in…\nLiked by Avtar Sehmbi\nOther similar profiles\nExplore top content on LinkedIn\nFind curated posts and insights for relevant topics all in one place.\nView top content"
    },
    {
      "url": "https://councils.forbes.com/forbestechcouncil?utm_source=forbes.com&utm_medium=referral&utm_campaign=forbes-links&utm_content=in-article-ad-links",
      "text": "Forbes Technology Council Is A Vetted Professional Organization For Senior-Level Technology Executives\nWho is Forbes Technology Council for?\nMembers of Forbes Technology Council are respected technology leaders selected for the Council for their depth and diversity of experience.\nTo qualify, you must be a senior-level technology executive and your company must generate at least $1,000,000 USD in annual revenue, or have received $1,000,000 USD in funding to date.\nEligible applicants are vetted by our selection committee, and if approved, are invited to select and purchase a membership package.\nExamples of Forbes Technology Council members include founders, partners, and CEOs of technology companies, C-level technology executives such as CTOs and CIOs, and VPs of technology teams.\nStart Your Application\nWhy Join Forbes Technology Council\nBe Recognized As An Expert\nOur platform allows you to easily share your technology expertise through quick, concise quotes using our mobile app or web portal via Expert Panels. Members can select questions they have a unique perspective on and provide a response in under 400 characters. Then, the most apt responses are curated by our editorial team and distilled into a single piece.\nExpert Panels are the ideal path to increasing your visibility while balancing a demanding schedule, and all include your name, company name, and link to your Executive Profile.\nPublishing Bylined Articles on Forbes.com\nForbes Technology Council members can submit bylined articles to be published on Forbes.com, each piece is edited collaboratively with our team of expert editors to meet the publication’s guidelines. Articles are published on Forbes.com and syndicated across our social media channels, select pieces get extra promotion in our Tech Pulse newsletter.\nArticles feature your headshot and bio. You’ll also receive an author page on Forbes.com which includes your headshot, name, short-form bio, and a link to your full Executive Profile.\nYour Executive Profile on Forbes.com\nYour Executive Profile on Forbes.com is optimized to be search-friendly, affirming your credibility as a technology leader. Profiles include your headshot, professional bio, company description, links to your social media and website, and all of the content you’ve been featured in on Forbes.com.\nYou’ll also receive an assortment of badging options for use on social media and business websites, highlighting your status as a Forbes Technology Council member.\nForbes Technology Council gives us credibility inside our industry and with customers. It helps distinguish us from the competition.\nCarlos Melendez\nCOO and Co-Founder, Wovenware\nAdditional Benefits for Forbes Councils Members\nConnect, Learn, and Grow With Your Peers\nThrough our member portal and mobile app, you’ll be able to connect with a network of like-minded, successful entrepreneurs. As a member, you’ll be able to message others directly, share insights, pose questions, and participate in council-wide and group conversations.\nWith exclusive access to other technology leaders, the opportunities for business development and strategic partnerships are plenty.\nOur members are committed to a lifetime of learning and growth. We host regular virtual events, led by a broad range of experts on the topics most relevant to you and your work, providing you you the breadth of information required to address dynamic, real-time technology challenges.\nInteractive Groups\nWithin our exclusive member app, you’ll be able to join and create Groups — where you can connect, ask and answer questions, and start conversations with members of similar interests and industries.\nMember Badges\nAs a member, you’ll have access to Forbes Councils badges, email signatures, social graphics, and press release templates. We make it easy for you to share your affiliation with the Forbes community.\nVirtual Events\nBe inspired by experts at virtual live events and in interactive member-led Groups. Our private events are hosted by industry experts in a variety of fields to address today’s critical issues.\nMobile App\nStay updated on the go with the Forbes Councils mobile app available on iOS and Android making it easy to participate in Expert Panels and connect with other members.\nEXEC Benefits Program\nYou’ll receive complimentary access to EXEC, a curated hotel, travel, lifestyle, and business benefits program designed to improve the lives of busy executives.\nPrivate Business Coaching\nAvailable for an additional cost, you can get matched with a certified coach, who will guide you and your company to reach your highest professional and business goals.\nDedicated Member Support Team\nAt the core of the Forbes Councils experience is our member support team. Our team is dedicated to helping you get the most of your membership and resources.\nComplimentary Strategy Session\nQualified members receive access to a free 30-minute strategy session with a premium business coach to help you discover hidden profit drivers and hone your focus.\nTech Council\nForbes Tech Council Members\nI think Forbes Councils really helps from a leadership perspective and with our branding. It shows that we’re a force to be reckoned with.\nMichelle Drolet\nCEO, Towerwall\nWhen people hear I’m part of Forbes Councils and that we have content there, they’re more eager to read it, and that adds credibility to the business.\nFrancis Dinha\nCEO, OpenVPN\nForbes Technology Council gives me the opportunity to extend my reach as a thought leader in the security industry. It’s an incredible platform.\nCaroline Wong\nChief Strategy Officer, Cobalt.io\nForbes Technology Council gives us credibility inside our industry and with customers. It helps distinguish us from the competition.\nCarlos Melendez\nCOO and Co-Founder, Wovenware\nWe try to take as much advantage of Forbes Councils publishing opportunities as we can because it is vital to our growth as a company.\nChalmers Brown\nCTO, Due\nI think [Forbes Technology Councill acts as an amplifier. It helps me build my credibility and my persona and makes me want to research topics more deeply.\nCarlo Brayda\nChairman, Tortora Brayda Institute\nThe thought leadership positioning [through Expert Panels] has been immense. It's generated friendships, new conversations, expanded my network, and helped with new business leads that end up becoming long term clients.\nMarc Fischer\nCo-Founder & CEO, Dogtown Media LLC\nThe visibility and credibility that come with being a Forbes Councils member have opened doors for me and my company. Clients now see us not just as a service provider, but as an industry leader. This has given us the momentum to take on bigger projects that can make a real difference in the world.\nMargarita Simonova\nFounder and CEO, ILoveMyQA\nForbes [Councils] gives me additional credibility and helps with my personal branding.\nElaine Montilla\nChief Technology Officer, Pearson"
    },
    {
      "url": "https://councils.forbes.com/qualify?utm_source=forbes.com&utm_medium=referral&utm_campaign=forbes-links&utm_term=ftc&utm_content=in-article-ad-links",
      "text": "Forbes Councils Application For Membership\nQuestions? Call us at: (800) 837-3734\nOur selection committee will evaluate your initial application for membership based on the information you provide. Expect a response to your submission within 2-4 business days.\nTo be considered, you must meet the following minimum qualifications:\nSenior Level Executive\n- Your business generates a minimum of $1M USD in revenue, or…\n- Your business has a minimum of $1M USD in financing\nBusiness\n- Business applicants, minimum annual revenue requirement is $500,000\n- Executive Coach applicants, 3 years of experience as a publicly recognized leadership, career, or executive coach\nPlease note: Meeting the basic criteria does not guarantee acceptance. No MLM/direct sales, gambling, adult entertainment, adult websites, adult products, or cannabis companies are allowed. Certain types of marketing agencies who pose a conflict of interest such as link sellers or guaranteed media placements are not allowed. Certain cryptocurrency industry companies such as those attached to initial coin offerings (ICOs) are not allowed.\nTo apply, please fill out the information below.\nThe information you provide will only be shared with our internal membership selection committee."
    }
  ],
  "argos_summary": "Cybersecurity has evolved from a compliance cost to a strategic growth engine, driving customer trust, operational resilience, IP protection, data monetization, and partner selection. Board-level oversight and embedding security across product, legal, procurement, and marketing functions are now essential for securing deals, accelerating digital adoption, and maintaining competitive advantage.",
  "argos_id": "TEDOY55SV"
}