{
  "url": "https://www.pymnts.com/real-time-payments/2025/fraud-is-31x-more-likely-on-checks-than-real-time-payments/",
  "authorsByline": "PYMNTS",
  "articleId": "be73d68aa7e341b9a1368628c1fb658f",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2025/08/fraud-checks-real-time.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-29T08:00:39+00:00",
  "addDate": "2025-08-29T08:06:33.998965+00:00",
  "refreshDate": "2025-08-29T08:06:33.998966+00:00",
  "score": 1.0,
  "title": "Fraud Is 31x More Likely on Checks Than Real-Time Payments",
  "description": "Banks say they fear fraud on real-time payment rails. The numbers say they shouldn’t. The August 2025 report, “Fact vs. Fiction in Real-Time Payments",
  "content": "Banks say they fear fraud on real-time payment rails. The numbers say they shouldn’t.\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\nThe August 2025 report, “Fact vs. Fiction in Real-Time Payments Fraud,” published by PYMNTS Intelligence and The Clearing House, gives rise to a striking contradiction: financial institutions are disproportionately worried about fraud risks in real-time payments, even as those same rails show the lowest fraud rates in the industry.\n\nThat fear is shaping decisions at the infrastructure level. According to the report, 78% of organizations choose to start their real-time implementation in receive-only mode, a risk-avoidance strategy that limits the value of faster payments and stalls ecosystem-wide adoption.\n\nBut the data undermines the fear. Fraud is happening, but not where banks expect it.\n\nThe headline findings from the report are familiar. Real-time payments are gaining ground, but adoption is hindered by persistent myths. The RTP network and FedNow Service, the two primary real-time rails in the U.S., are designed with built-in fraud mitigation tools — yet only 22% of banks have embraced full send-and-receive functionality.\n\nThe report makes the case that security fears are less a reflection of actual threats and more a legacy mindset carried over from fraud-prone systems like checks and wires.\n\nWhat’s buried beneath the top-line summary, however, is this:\n• Just 2% of firms reported any fraud on RTP or FedNow. In contrast, a staggering 63% of firms reported check fraud in 2024, while ACH and wire transfers saw fraud rates of 38% and 30%, respectively.\n• Only 3% of financial institutions characterized real-time fraud as “significant.” Most categorized the fraud impact as either “moderate” or “slight”—and a large portion reported no impact at all.\n• Despite these numbers, 85% of U.S. payment professionals still expect fraud to rise with real-time payments. Among large institutions (50,000+ employees), that expectation climbs to 95%, with half anticipating a sharp increase.\n\nThe discrepancy isn’t just academic. It has market consequences. Institutions are over-indexing on risk and under-leveraging one of the industry’s most secure payment systems. The irony is stark: checks remain in use by 75% of firms despite being the most fraud-prone instrument.\n\nMeanwhile, real-time systems — designed with push-only architecture, API-level security, and instant transaction visibility — are still eyed with suspicion.\n\nPart of the problem may be optics. Fraud that does occur on real-time rails — such as authorized push payment (APP) scams — tends to make headlines, while the day-to-day security wins go unnoticed. Still, tools like Confirmation of Payee (CoP) have near-universal support (96% of banks) and have already cut fraud 60% in the U.K. market. In the U.S., however, partial adoption risks rerouting fraud to less protected institutions.\n\nOther findings in the report further reinforce the case for real-time rails. The Clearing House and the Fed continue to expand fraud defenses with tools like real-time monitoring, collaborative data exchange, and scam classification models. Banks themselves are prioritizing AI, multifactor authentication, and interbank data sharing to further reduce risk. Yet without broader adoption, those efforts risk being underutilized.\n\nThe path forward doesn’t require new tech; it requires a mindset shift. The report offers ample evidence that the real-time rails are ready. Now it’s time for institutions to catch up.",
  "medium": "Article",
  "links": [
    "https://www.pymnts.com/tracker_posts/reality-check-fact-vs-fiction-in-real-time-payments-fraud/",
    "https://www.theclearinghouse.org/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "fraud risks",
      "weight": 0.09757305
    },
    {
      "name": "check fraud",
      "weight": 0.09719855
    },
    {
      "name": "fraud rates",
      "weight": 0.091394104
    },
    {
      "name": "Fraud",
      "weight": 0.09074739
    },
    {
      "name": "fraud",
      "weight": 0.09074739
    },
    {
      "name": "fraud defenses",
      "weight": 0.08967224
    },
    {
      "name": "time",
      "weight": 0.087012544
    },
    {
      "name": "real-time payment rails",
      "weight": 0.078190506
    },
    {
      "name": "real-time fraud",
      "weight": 0.077902004
    },
    {
      "name": "U.S. payment professionals",
      "weight": 0.07712004
    }
  ],
  "topics": [
    {
      "name": "Fraud"
    },
    {
      "name": "Corruption"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.74365234375
    },
    {
      "name": "/Shopping/Consumer Resources/Consumer Advocacy & Protection",
      "score": 0.7041015625
    },
    {
      "name": "/Finance/Banking/Other",
      "score": 0.39990234375
    },
    {
      "name": "/Shopping/Consumer Resources/Identity Theft Protection",
      "score": 0.39501953125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.386962890625
    }
  ],
  "sentiment": {
    "positive": 0.19896047,
    "negative": 0.39045024,
    "neutral": 0.4105893
  },
  "summary": "A report by PYMNTS Intelligence and The Clearing House has found that banks fear fraud on real-time payment rails, despite the fact that these rails have the lowest fraud rates in the industry. The report suggests that financial institutions are more concerned about fraud risks due to the low implementation of these rails. This fear is influencing infrastructure decisions, with 78% of organizations starting in receive-only mode limiting the value of faster payments and hindering ecosystem-wide adoption. Despite these findings, 85% of U.S. payment professionals predict that fraud will rise with real time payments, with a 95% expectation of a sharp increase among large institutions. The study also highlights the difficulty of adoption of these systems, with tools like Confirmation of Payee (CoP) supporting 96% of banks and cutting fraud 60% in the UK market.",
  "shortSummary": "Banks fear fraud on real-time payment rails, despite the fact that fraud rates are significantly lower, and adoption is hindered by persistent myths.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c7fef7c938a34c8b99cac81b2d53e333",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.pymnts.com/tracker_posts/reality-check-fact-vs-fiction-in-real-time-payments-fraud/",
      "text": "Reality Check: Fact vs. Fiction in Real-Time Payments Fraud\nFraud fears still cloud real-time rails adoption, yet actual fraud rates remain low. So why do myths about fraud in faster payments still hold sway?\n01\nFear of fraud remains one of the biggest hurdles to real-time payments adoption. Many banks limit participation to receive-only mode, driven by concerns that speed increases exposure to scams and fraud risk.\n02\nDespite these anxieties, current fraud rates on faster payment rails are significantly lower than for traditional payment systems. Real-time transactions face less fraud than checks, wires or ACH—yet many institutions still view them as riskier.\n03\nFinancial institutions must raise awareness of real-time payments’ strong fraud prevention tools to encourage broader adoption. Many FIs already support advanced solutions—and U.S. real-time rails are fully on board, launching their own initiatives.\nGet Unlimited Access\nComplete the form below for free, unlimited access to all our Data Studies, Trackers, and MonitorEdge reports.\nThank you for registering. Please confirm your email to view all our Trackers.\nFaster payments are gaining traction, but fraud fears haven’t kept pace with facts. Convinced that speed invites scams, many banks in the United States remain hesitant about fully embracing real-time rails such as the RTP® network and the FedNow® Service. This fear persists—even though it’s outdated. Today’s instant rails offer stronger fraud defenses than checks, wires or automated clearing house (ACH). Still, stubborn myths about payment speed and its attendant risks shape how financial institutions (FIs) act. Too many try to “play it safe” by offering receive-only service, bottlenecking adoption and limiting faster payments’ value. It’s time for a reset. Clearing up misperceptions could unlock real-time payments’ broader benefits—from better customer experience to lower fraud exposure.\nFraud Fears Still Hamper Real-Time Payments Adoption\nFear of fraud remains one of the biggest hurdles to real-time payments adoption. Many banks limit participation to receive-only mode, driven by concerns that speed increases exposure to scams and fraud risk.\nBanks’ fear of fraud in instant payments is widespread—and growing.\nFraud remains a central fear restricting real-time payments adoption at scale. In a recent study by RedCompass Labs, 85% of U.S. payment professionals said they expect fraud to increase as instant payments become more common. Larger banks, worried about being bigger targets, are the most on edge. Ninety-five percent of firms with more than 50,000 employees expect fraud to rise, and half predict a sharp increase, according to the same findings.\n85%\nof U.S. payment professionals expect more fraud as instant payments scale.\nIn fact, fraud’s ranking as a hurdle to real-time rails adoption saw the biggest increase this year, climbing to fourth place from ninth in 2024, though this was still relatively low, cited by 26% of FIs. Of all the named obstacles to instant payments implementation, fraud followed fierce competition from FinTechs at number one (36%), the challenge of needing to offer 24/7 availability at number two (34%), and the difficulty of updating architecture and internal systems at number three (28%). Researchers noted that the rise of fraud concerns as a barrier makes sense as banks come to grips with the actual operation of instant payments after focusing almost exclusively on structural challenges until now.\nAmid rising financial fraud, robust protection is essential.\nThe 2025 Faster Payments Barometer found that the specific fraud fears surrounding real-time payments adoption mirror those in the financial industry at large. At 35%, account takeover fraud ranks as the top worry regarding instant payments, followed closely by authorized push payment (APP) fraud, such as scams that trick users into sending money, at 30%. Other risks—including synthetic identity and invoice fraud—draw more moderate urgency (10% to 15%). Meanwhile, so-called money mule activity—when fraudsters use individuals to transfer stolen funds—occupies a lower yet still significant tier of concern, at less than 5%.\nThese apprehensions suggest that FIs should prioritize authentication and customer education to address both the technical and the human weaknesses that fraudsters exploit. However, many institutions are taking the less rational approach of forgoing adoption altogether.\nOpting out of instant payments serves no one.\nFears tied to authorized sender fraud—especially on platforms like Zelle, where it has drawn regulators’ attention—are shaping real-world choices, with many banks adopting receive-only functionality to reduce exposure. According to the 2025 Faster Payments Barometer, 78% of all surveyed organizations planned to begin their implementations with receive-only capabilities, whereas just 22% intended to launch full send-and-receive services.\nThe assumption behind these decisions? “Faster payments equal faster fraud.” That myth still shapes how institutions act, even as today’s rails tell a different story. FIs that limit engagement due to a lack of confidence in their defenses only create a bottleneck that constricts adoption across the banking ecosystem.\nFraud on the RTP® Network and FedNow® Remains Rare\nDespite these anxieties, current fraud rates on faster payment rails are significantly lower than for traditional payment systems. Real-time transactions face less fraud than checks, wires or ACH—yet many institutions still view them as riskier.\nLegacy rails face higher fraud risk than real-time payments.\n63%\nof firms report check fraud. Just 2% report fraud on RTP or FedNow.\nFraud on traditional rails still exceeds real-time payments fraud by a wide margin. According to the 2025 Association for Financial Professionals (AFP) Payments Fraud and Control Survey Report, 63% of firms reported attempted or actual check fraud in 2024, compared to just 2% on RTP or FedNow. According to The Clearing House (TCH), fraud rates on the RTP network are a fraction of a percentage point. In April 2025, for example, out of 35 million transactions, there were just 123 instances of reported fraud. Meanwhile, ACH debits and wire transfers took second and third place in actual or attempted fraud, at 38% and 30%, respectively.\nThose findings reflect how fraudsters target older systems that move high volumes while lacking modern safeguards. Real-time networks, by contrast, often run in tokenized API environments that improve transaction security and access control. Real-time payments networks allow only push payments, where the account holder must send the transaction. This is unlike other payment types, such as ACH, where pull (debit) payments are allowed.\nChecks still dominate payments despite high fraud exposure.\nChecks remain widely used, despite persistent fraud risks. Although nearly two in three institutions experienced check fraud in 2024 and nearly one in four incidents involved stolen mail, 75% of firms still plan to keep using checks over the next two years. Instant payments are often better protected, but that advantage still hasn’t revolutionized institutional behavior.\nMeanwhile, the government is taking action against the tidal wave of check fraud. The U.S. Treasury and banking groups are fast-tracking the digitization of federal checks per an executive order ahead of a September deadline. This move, which specifically recommends real-time payments as a safer alternative, is a crucial step in the government’s broader efforts to safeguard federal payments against fraud.\n“Removing paper Treasury checks from circulation is an important step toward reducing theft and the related losses,” top banking associations said in a recent joint letter to the Treasury regarding the order.\nMost fraud cases tied to RTP and FedNow are low-impact.\nMoreover, the severity of fraud’s impact on faster payments is often limited. According to the Faster Payments Barometer, just 3% of financial institutions report real-time payments’ fraud impact as “significant.” Most incidents are categorized as “slight” or “moderate,” and a large portion of FIs report zero impact. These findings suggest that current controls are working, though sustained investment is still needed to stay ahead of evolving threats.\nFraud Prevention Tools Win Bank Support\nFinancial institutions must raise awareness of real-time payments’ strong fraud prevention tools to encourage broader adoption. Many FIs already support advanced solutions—and U.S. real-time rails are fully on board, launching their own initiatives.\nBanks back stronger fraud defenses—but broader adoption is needed for them to work.\nMany institutions back targeted tools to contain fraud. For example, nearly all banks, at 96%, support introducing an ID verification system like Confirmation of Payee (CoP). The principle is simple: Before processing a transaction, the recipient’s details are matched against the sender’s entered information, with the sender then notified of any discrepancy. Among small to mid-sized banks, support rises to 97%.\nSuch a system has already proven effective at combating APP fraud in the United Kingdom, where its mandate has resulted in a 60% reduction in fraud cases. However, for tools like CoP to work, bank participation must be near-universal. The concern is that partial adoption of this tool, as in the fragmented U.S. real-time payments market, would simply reroute fraud to banks that are not covered.\nThe top five tools banks say they need.\nRedCompass Labs asked U.S. banks which fraud prevention measures they consider most urgent. Leading the list: artificial intelligence (AI) and machine learning (ML) (40%), followed by real-time detection (39%) and multifactor authentication (MFA) (35%). Data sharing among banks (32%) and coordination with telecom and tech firms (27%) round out the top five.\nAll five strategies aim to stop fraud before funds move. Confidence is growing in technology’s potential to achieve just that, with 54% of U.S. big banks this year believing AI can improve financial crime detection, up from only 31% overall last year.\nTCH and the Fed step up fraud defense.\nBanks that participate in the major U.S. real-time networks, meanwhile, will find these rails’ defenses already robust and gaining strength. The Clearing House and the Federal Reserve have each launched new fraud mitigation tools for the RTP network and FedNow, respectively. These include real-time monitoring, collaborative data exchange and the Fed’s ScamClassifier model—a framework for tracking scam types and patterns. These efforts matter. With the measures’ continued success fueling more bank participation, the U.S. could quickly become a leader in the real-time payments race.\nTurning the Page on Faster Payments Myths\nEven as fraud rates remain low, persistent myths about risk are slowing real-time payments adoption. To move forward, stakeholders must confront the perception gap, equipping institutions and consumers alike with the tools and clarity needed to build trust at scale.\nFraud is still a top concern—but not the top threat. Just 2% of firms report fraud on real-time rails, versus 63% on checks.\nRisk is concentrated, not constant. Account takeover and push payment scams top the threat list, yet most fraud events have limited impact on faster payment rails.\nCoP-style ID checks have near-universal support. Ninety-six percent of banks want them—but coverage must be consistent to close gaps.\nTechnology works best when paired with collaboration. Banks rank AI, MFA and real-time monitoring highly—but also want stronger data sharing.\nNetwork operators are stepping up. RTP and FedNow are expanding real-time defenses and scam-tracking frameworks.\nReal-time payments have reached an inflection point. While risk won’t disappear entirely anytime soon, the tools to manage it are mature, tested and widely endorsed. Widespread instant payments adoption now depends on better communication, smarter coordination and closing the trust gap.\nAbout\nThe Clearing House operates U.S.-based payments networks that clear and settle funds through ACH, check image, the RTP® network and wire transfers. The RTP network supports the immediate clearing and settlement of payments along with the ability to exchange related payment information across the same secure channel. Learn more at www.theclearinghouse.org.\nPYMNTS Intelligence is a leading global data and analytics platform that uses proprietary data and methods to provide actionable insights on what’s now and what’s next in payments, commerce and the digital economy. Its team of data scientists include leading economists, econometricians, survey experts, financial analysts and marketing scientists with deep experience in the application of data to the issues that define the future of the digital transformation of the global economy. This multilingual team has conducted original data collection and analysis in more than three dozen global markets for some of the world’s leading publicly traded and privately held firms.\nThe PYMNTS Intelligence team that produced this Tracker:\nJohn Gaffney, Chief Content Officer\nAdam Putz, PhD, Senior Writer\nAlexandra Redmond, Senior Content Editor\nJoe Ehrbar, Content Editor\nAugusto Solari, Senior Research Analyst\nWe are interested in your feedback on this report. If you have questions\nor\ncomments, or if you would like to subscribe to this report, please email\nus at\nfeedback@pymnts.com.\nDisclaimer\nThe Real-Time Payments Tracker® Series may be updated periodically. While reasonable efforts are made to keep the content accurate and up to date, PYMNTS MAKES NO REPRESENTATIONS OR WARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, REGARDING THE CORRECTNESS, ACCURACY, COMPLETENESS, ADEQUACY, OR RELIABILITY OF OR THE USE OF OR RESULTS THAT MAY BE GENERATED FROM THE USE OF THE INFORMATION OR THAT THE CONTENT WILL SATISFY YOUR REQUIREMENTS OR EXPECTATIONS. THE CONTENT IS PROVIDED “AS IS” AND ON AN “AS AVAILABLE” BASIS. YOU EXPRESSLY AGREE THAT YOUR USE OF THE CONTENT IS AT YOUR SOLE RISK. PYMNTS SHALL HAVE NO LIABILITY FOR ANY INTERRUPTIONS IN THE CONTENT THAT IS PROVIDED AND DISCLAIMS ALL WARRANTIES WITH REGARD TO THE CONTENT, INCLUDING THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE, AND NONINFRINGEMENT AND TITLE. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF CERTAIN WARRANTIES, AND, IN SUCH CASES, THE STATED EXCLUSIONS DO NOT APPLY. PYMNTS RESERVES THE RIGHT AND SHOULD NOT BE LIABLE SHOULD IT EXERCISE ITS RIGHT TO MODIFY, INTERRUPT, OR DISCONTINUE THE AVAILABILITY OF THE CONTENT OR ANY COMPONENT OF IT WITH OR WITHOUT NOTICE.\nPYMNTS SHALL NOT BE LIABLE FOR ANY DAMAGES WHATSOEVER, AND, IN PARTICULAR, SHALL NOT BE LIABLE FOR ANY SPECIAL, INDIRECT, CONSEQUENTIAL, OR INCIDENTAL DAMAGES, OR DAMAGES FOR LOST PROFITS, LOSS OF REVENUE, OR LOSS OF USE, ARISING OUT OF OR RELATED TO THE CONTENT, WHETHER SUCH DAMAGES ARISE IN CONTRACT, NEGLIGENCE, TORT, UNDER STATUTE, IN EQUITY, AT LAW, OR OTHERWISE, EVEN IF PYMNTS HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\nSOME JURISDICTIONS DO NOT ALLOW FOR THE LIMITATION OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, AND IN SUCH CASES, SOME OF THE ABOVE LIMITATIONS DO NOT APPLY. THE ABOVE DISCLAIMERS AND LIMITATIONS ARE PROVIDED BY PYMNTS AND ITS PARENTS, AFFILIATED AND RELATED COMPANIES, CONTRACTORS, AND SPONSORS, AND EACH OF ITS RESPECTIVE DIRECTORS, OFFICERS, MEMBERS, EMPLOYEES, AGENTS, CONTENT COMPONENT PROVIDERS, LICENSORS, AND ADVISERS.\nComponents of the content original to and the compilation produced by PYMNTS is the property of PYMNTS and cannot be reproduced without its prior written permission.\nThe Real-Time Payments Tracker® Series is a registered trademark of What’s Next Media & Analytics, LLC (“PYMNTS”)."
    },
    {
      "url": "https://www.theclearinghouse.org/",
      "text": "Registration Is Now Open for The Clearing House Annual Conference 2025: November 4-5 in NYC\nJoin us for two jam-packed days of content-rich sessions covering key issues across banking, policy, and payments. Attendees have the opportunity to network with industry peers while they explore and discuss the latest trends and insights facing financial institutions today. Take advantage of early-bird rates!\nLearn More and Register Now\nCHIPS® Liquidity Algorithm Unlocks Over $5 Billion in Annual Savings, Delivering Efficiency to the Global Financial Market\nThe patented liquidity savings algorithm on the CHIPS® network provided $321 billion in daily liquidity savings to participating banks in 2024.\nLearn More\nWhy Instant Payments Are Just Getting Started in the U.S. — A Conversation with Two Payments CEOs\nTom Warsop, President and CEO of ACI Worldwide, and David Watson, President and CEO of The Clearing House, dive into instant payments in the United States.\nLearn more"
    }
  ],
  "argos_summary": "Banks fear fraud on real‑time payment rails, yet the 2025 PYMNTS‑Clearing House report shows only 2% of firms report fraud on RTP or FedNow versus 63% on checks, and most incidents are slight or moderate. Despite this, 78% of institutions launch with receive‑only mode and 85% expect fraud to rise, stalling ecosystem adoption. The report argues that robust built‑in safeguards—AI, MFA, real‑time monitoring, and tools like Confirmation of Payee—are already in place and should be widely adopted to close the perception gap and unlock the benefits of instant payments.",
  "argos_id": "UH48CVWX8"
}