{
  "url": "https://www.nasdaq.com/articles/sp-500-posts-new-record-high-resilient-us-economy",
  "authorsByline": "Barchart",
  "articleId": "3f1add30807e4682b5b51804044db41d",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "http://nasdaq.com/sites/acquia.prod/files/barchart/Wall%2520street%2520sign%2520in%2520New%2520York%2520with%2520New%2520York%2520Stock%2520Exchange%2520background%2520by%2520Stuart%2520Monk%2520via%2520Shutterstock.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T22:22:00+00:00",
  "addDate": "2025-08-28T22:38:39.377499+00:00",
  "refreshDate": "2025-08-28T22:38:39.377501+00:00",
  "score": 1.0,
  "title": "S&P 500 Posts a New Record High on a Resilient US Economy",
  "description": "The S&P 500 Index ($SPX ) (SPY ) on Thursday closed up by +0.32%, the Dow Jones Industrials Index ($DOWI ) (DIA ) closed up by +0.16%, and the Nasdaq 100 Index ($IUXX ) (QQQ ) closed up by +0.58%.  September E-mini S&P futures (ESU25 ) rose +0.32%, and September...",
  "content": "The S&P 500 Index ($SPX) (SPY) on Thursday closed up by +0.32%, the Dow Jones Industrials Index ($DOWI) (DIA) closed up by +0.16%, and the Nasdaq 100 Index ($IUXX) (QQQ) closed up by +0.58%. September E-mini S&P futures (ESU25) rose +0.32%, and September E-mini Nasdaq futures (NQU25) rose +0.56%.\n\nStock indexes rallied on Thursday, with the S&P 500 posting a new all-time high and the Nasdaq 100 posting a 1.5-week high. Signs that the US economy is holding up pushed stock prices higher on Thursday after Q2 GDP was revised higher than expected, showing the economy expanded more than initially estimated. Also, US weekly initial unemployment claims fell as expected, easing concerns about the labor market. Strength in software stocks and chip makers led the overall market higher on Thursday.\n\nLimiting gains in stocks on Thursday was some disappointing earnings news. Hormel Foods fell more than -13% after reporting weaker-than-expected Q3 adjusted EPS and forecasting Q4 adjusted EPS below consensus. Additionally, there's some weakness in AI stocks following Nvidia's sales forecast, which fell short of lofty expectations. Nvidia fell -0.79% after reporting weaker-than-expected Q2 data center revenue and giving a revenue forecast that was seen as underwhelming.\n\nUS Q2 GDP was revised upward to +3.3% (q/q annualized) from the previously reported +3.0%, stronger than expectations of +3.1%.\n\nUS weekly initial unemployment claims fell -5,000 to 229,000, close to expectations of 230,000.\n\nUS Jul pending home sales fell -0.4% m/m, weaker than expectations of -0.2% m/m.\n\nRegarding tariffs, President Trump late Monday threatened to impose new tariffs and export restrictions on advanced technology and semiconductors in retaliation against other nations' digital services taxes that hit American companies. Last week, Mr. Trump widened steel and aluminum tariffs to include more than 400 consumer items that contain the metals, such as motorcycles, auto parts, furniture components, and tableware. The change went into effect last Monday and did not exclude goods already in transit.\n\nIn other recent tariff news, Mr. Trump on August 13 extended the tariff truce with China for another 90 days until November. On August 6, Mr. Trump announced that he will double tariffs on US imports from India to 50% from the current 25% tariff, due to India's purchases of Russian oil. According to Bloomberg Economics, the average US tariff will rise to 15.2% if rates are implemented as announced, up from 13.3% earlier, and significantly higher than the 2.3% in 2024 before the tariffs were announced.\n\nThe markets this week are focusing on any fresh tariff news or developments on ending the Ukraine-Russian war. On Friday, July personal spending is expected to climb +0.3% m/m, and July personal income is expected to rise +0.4% m/m. Also, the July core PCE price index, the Fed's preferred inflation gauge, is expected to climb +0.2% m/m and +2.9% y/y. In addition, the Aug MNI Chicago PMI is expected to fall -0.6 to 46.5. Finally, the University of Michigan's final-Aug US consumer sentiment index is expected to be unrevised at 58.6.\n\nFederal funds futures prices are discounting the chances for a -25 bp rate cut at 86% at the next FOMC meeting on September 16-17. The markets are discounting the chances at 53% for a second -25 bp rate cut at the following meeting on October 28-29.\n\nEarnings reports indicate that S&P 500 earnings for Q2 are on track to rise +9.1% y/y, much better than the pre-season expectations of +2.8% y/y and the most in four years, according to Bloomberg Intelligence. With Q2 earnings season winding down, over 95% of S&P 500 firms having reported Q2 earnings, about 82% of companies exceeded profit estimates.\n\nOverseas stock markets on Thursday settled higher. The Euro Stoxx 50 closed up +0.07%. China's Shanghai Composite closed up +1.14%. Japan's Nikkei Stock 225 closed up +0.73%.\n\nSeptember 10-year T-notes (ZNU5) on Thursday closed up +4 ticks, and the 10-year T-note yield fell -2.3 bp to 4.209%.\n\nSep T-notes climbed to a 4-month nearest-futures high on Thursday, and the 10-year T-note yield fell to a 2-week low of 4.201%. T-notes moved higher on Thursday, benefiting from positive carryover from Wednesday, when New York Fed President Williams stated that at some point, it will be appropriate for the Fed to move rates down, as it is still in a \"modestly restrictive\" stance on policy.\n\nGains in T-notes are limited after the US Q2 GDP was revised higher than expected and after weekly jobless claims declined as expected, which are hawkish factors for Fed policy. Also, weak demand for the Treasury's $44 billion auction of 7-year T-notes was bearish for T-note prices as the auction had a bid-to-cover ratio of 2.49, weaker than the 10-auction average of 2.66.\n\nEuropean government bond yields on Thursday moved lower. The 10-year German bund yield fell to a 2-week low of 2.679% and finished down -0.5 bp to 2.695%. 10-year UK gilt yield fell -3.6 bp to 4.699%.\n\nThe Eurozone's August economic confidence indicator unexpectedly fell -0.5 to 95.2, weaker than expectations of an increase to 96.0.\n\nEurozone July new car registrations rose 7.4% year-over-year to 914,680, the biggest increase in 15 months.\n\nThe summary of the July 23-24 ECB meeting showed that policymakers deemed the risks to inflation to be \"broadly balanced\" and that the Eurozone economy has so far remained resilient to headwinds ranging from tariffs to wars.\n\nSwaps are discounting the chances at 3% for a -25 bp rate cut by the ECB at the September 11 policy meeting.\n\nChipmakers rallied on Thursday to provide support to the broader market. Marvell Technology (MRVL) closed up more than +4%, and Micron Technology (MU) and Broadcom (AVGO) closed up more than +3%. Also, Advanced Micro Devices (AMD), Applied Materials (AMAT), and NXP Semiconductors NV (NXPI) closed up more than +1%.\n\nSnowflake (SNOW) closed up more than +18% to lead software stocks higher after reporting Q2 product revenue of $1.09 billion, better than the consensus of $1.04 billion, and raising its 2026 product revenue forecast to $4.40 billion from a previous estimate of $4.33 billion, stronger than the consensus of $4.34 billion. Also, Datadog (DDOG) closed up more than +6% to lead gainers in the S&P 500 and Nasdaq 100, and MongoDB (MDB) closed up more than +7%. In addition, Cloudflare (NET) closed up more than +3% and Atlassian (TEAM) closed up more than +2%. Finally, Salesforce (CRM) closed up more than +1% to lead the gainers in the Dow Jones Industrials.\n\nPure Storage (PSTG) closed up more than +31% after reporting Q2 revenue of $861 million, above the consensus of $845.9 million, and raising its 2026 revenue forecast to $3.60 billion-$3.63 billion from a previous forecast of $3.52 billion, stronger than the consensus of $3.52 billion.\n\nPhibro Animal Health Corp (PAHC) closed up more than +18% after forecasting 2026 net sales of $1.43 billion to $1.48 billion, above the consensus of $1.42 billion.\n\nAgilent Technologies (A) closed up more than +5% after reporting Q3 net revenue of $1.74 billion, above the consensus of $1.67 billion, and raising its full-year revenue estimate to $6.91 billion-$6.93 billion from a previous estimate of $6.73 billion-$6.81billion.\n\nHP Inc. (HPQ) closed up more than +4% after reporting Q3 net revenue of $13.93 billion, better than the consensus of $13.74 billion.\n\nBurlington Stores (BURL) closed up more than +4% after reporting Q2 adjusted EPS of $1.59, well above the consensus of $1.27, and raising its full-year adjusted EPS forecast to $9.19-$9.59 from a previous forecast of $8.70-$9.30, the midpoint above the consensus of $9.26.\n\nFive Below (FIVE) closed up more than +3% after reporting Q2 comparable sales rose +12.4%, stronger than the consensus of +9.14%, and raising its full-year net sales forecast to $4.44 billion-$4.52 billion from a previous forecast of $4.33 billion-$4.42 billion.\n\nHormel Foods (HRL) closed down more than -13% to lead losers in the S&P 500 after reporting Q3 adjusted EPS of 35 cents, below the consensus of 40 cents, and forecasting Q4 adjusted EPS of 38 cents-40 cents, weaker than the consensus of 49 cents.\n\nNvidia (NVDA) closed down -0.79% after reporting Q2 data center revenue of $41.10 billion, below the consensus of $41.29 billion.\n\nCooper Cos (COO) closed down more than -12% after cutting its full-year revenue forecast to $4.08 billion-$4.10 billion from a previous forecast of $4.11 billion-$4.15 billion, weaker than the consensus of $4.12 billion.\n\nVeeva Systems (VEEV) closed down more than -7% after reporting Q2 adjusted gross margin of 77.5%, below the consensus of 78.2%.\n\nNutanix (NTNX) closed down more than -5% after forecasting Q1 revenue of $670 million-$680 million, the midpoint below the consensus of $677 million.\n\nBrown-Forman (BF.B) closed down more than -4% after reporting Q1 EPS of 36 cents, below the consensus of 37 cents.\n\nBest Buy (BBY) closed down more than -3% despite reporting better-than-expected Q2 EPS after warning that tariffs continue to weigh on its business ahead of the crucial holiday season.",
  "medium": "Article",
  "links": [
    "https://www.nasdaq.com/market-activity/etf/dia",
    "https://www.nasdaq.com/market-activity/stocks/mu",
    "https://www.nasdaq.com/market-activity/etf/qqq",
    "https://www.nasdaq.com/market-activity/stocks/mrvl",
    "https://www.nasdaq.com/market-activity/stocks/pahc",
    "https://www.nasdaq.com/market-activity/stocks/snow",
    "https://www.nasdaq.com/market-activity/stocks/avgo",
    "https://www.nasdaq.com/market-activity/stocks/hpq",
    "https://www.barchart.com/futures/quotes/NQ*0/overview",
    "https://www.nasdaq.com/market-activity/stocks/amat",
    "https://www.nasdaq.com/market-activity/stocks/burl",
    "https://www.nasdaq.com/my/barchart-newsletters/barchart-brief",
    "https://www.nasdaq.com/market-activity/etf/spy",
    "https://www.nasdaq.com/market-activity/stocks/a",
    "https://www.nasdaq.com/market-activity/stocks/coo",
    "https://www.barchart.com/futures/quotes/%24DOWI/overview",
    "https://www.nasdaq.com/market-activity/stocks/bf.b",
    "https://www.nasdaq.com/market-activity/stocks/ddog",
    "https://www.nasdaq.com/market-activity/stocks/ntnx",
    "https://www.nasdaq.com/market-activity/stocks/five",
    "https://www.nasdaq.com/market-activity/stocks/net",
    "https://www.nasdaq.com/market-activity/stocks/bby",
    "https://www.nasdaq.com/market-activity/stocks/crm",
    "https://www.nasdaq.com/market-activity/stocks/pstg",
    "https://www.nasdaq.com/market-activity/stocks/team",
    "https://www.nasdaq.com/market-activity/stocks/amd",
    "https://www.nasdaq.com/market-activity/stocks/veev",
    "https://www.barchart.com/futures/quotes/%24IUXX/overview",
    "https://www.barchart.com/futures/quotes/ES*0/overview",
    "https://www.nasdaq.com/market-activity/stocks/nvda",
    "https://www.barchart.com/futures/quotes/%24SPX/overview",
    "https://www.barchart.com/futures/quotes/ZN*0/overview",
    "https://www.nasdaq.com/market-activity/stocks/mdb",
    "https://www.nasdaq.com/market-activity/stocks/nxpi"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Q2 revenue",
      "weight": 0.07010311
    },
    {
      "name": "Q2 product revenue",
      "weight": 0.06704286
    },
    {
      "name": "US Q2 GDP",
      "weight": 0.06696291
    },
    {
      "name": "new tariffs",
      "weight": 0.0663399
    },
    {
      "name": "Q2 data center revenue",
      "weight": 0.065322034
    },
    {
      "name": "Q2 adjusted EPS",
      "weight": 0.06443182
    },
    {
      "name": "Q2 earnings",
      "weight": 0.060999535
    },
    {
      "name": "other recent tariff news",
      "weight": 0.060748965
    },
    {
      "name": "tariffs",
      "weight": 0.060696017
    },
    {
      "name": "Q2 earnings season",
      "weight": 0.05951599
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "US Politics"
    },
    {
      "name": "Stocks"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.98828125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.89453125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.55712890625
    }
  ],
  "sentiment": {
    "positive": 0.057393588,
    "negative": 0.87870413,
    "neutral": 0.063902244
  },
  "summary": "The S&P 500 Index closed up by +0.32%, the Dow Jones Industrials Index ($DOWI) (DIA), and the Nasdaq 100 Index ($IUXX) (QQQ) rose by 0.58%. These gains were driven by signs of a strong US economy, with Q2 GDP revised higher than expected and US weekly initial unemployment claims falling as expected, easing concerns about the labor market. However, disappointing earnings news led to Hormel Foods falling more than -13% and Nvidia's sales forecast fell short of high expectations. President Trump has threatened to impose new tariffs and export restrictions on advanced technology and semiconductors in response to other nations' digital services taxes. Recent tariff news included the extension of a tariff truce with China and doubling of tariffs on US imports from India to 50% due to India's purchases of Russian oil. Federal funds futures prices discount the chances for a -25 bp rate cut at 86%.",
  "shortSummary": "The S&P 500 hit a record high as strong Q2 GDP and weaker earnings reports raised investor confidence.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "b7675e0543fe4d899dfe797f121c80e4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.barchart.com/futures/quotes/NQ*0/overview",
      "text": "The Quote Overview page gives you a snapshot view for a specific futures symbol. During market hours, delayed exchange price information displays (Futures: 10 minute delay, CT) and new delayed trade updates are updated on the page (as indicated by a \"flash\").\nBarchart Symbol Notes Tutorial (8:43)\nQuoteboard data fields include:\n- Day High / Low: The highest and lowest trade price for the current trading session.\n- Open: The opening price for the current trading session is plotted on the day's High/Low histogram.\n- Previous Close: The closing price from the previous trading session.\n- Bid: The last bid price and bid size.\n- Ask: The last ask price and ask size.\n- Volume: The total number of shares or contracts traded in the current trading session.\n- Average Volume: The average number of shares traded over the last 20 days.\n- Weighted Alpha: A measure of how much a stock or commodity has risen or fallen over a one-year period.\nChart Snapshot\nA thumbnail of a daily chart is provided, with a link to open and customize a full-sized chart.\nPrice Performance\nThis section shows the Highs and Lows over the past 1, 3 and 12-Month periods. Click the \"See More\" link to see the full Performance Report page with expanded historical information.\nMore Futures Quotes\nThis section displays additional open contracts for the futures symbol you are viewing.\nSeasonal Chart\nA seasonal chart is designed to help you visualize how futures contracts have performed during a calendar year. They help show patterns and price trends for commodities whose prices often change with the seasons.\nThe widget shows the Last Price of the commodity you are viewing, compared to the average last price of the same commodity for the past 18 months.\nRelated ETFs\nFind exchange traded funds (ETFs) whose sector aligns with the same commodity grouping as the symbol you are viewing. Analysis of these related ETFs and how they are trading may provide insight to this commodity.\nCommitment of Traders Positions\nThis widget shows the latest week's Commitment of Traders open interest. The COT data, as reported by the US Commodity Futures Trading Commission (CFTC), is from Tuesday, and is released Friday by the CFTC. Reporting firms send Tuesday open interest data on Wednesday morning. The CFTC then corrects and verifies the data for release by Friday afternoon. The Barchart site's data is then updated, after the official CFTC release.\nYou will see the Long and Short positions from the Legacy Commitments of Traders report, plus either the Long and Short positions from the Disaggregated Report or the Financial TFF Report.\nA link to view a chart with both COT studies applied is also available.\nRelated Stocks\nFor comparison purposes, find information on other symbols contained in the same sector.\nBarchart Commodities Insider Commentary\nBarchart Commodities Insider is Ag market commentary for Grains and Oilseeds, Energy, Gold, Silver, Cocoa, Coffee, and Sugar markets.\nMost Recent Stories\nView the latest top stories from the Associated Press or Canadian Press (based on your Market selection)."
    },
    {
      "url": "https://www.barchart.com/futures/quotes/%24SPX/overview",
      "text": "The Quote Overview page gives you a snapshot view for a specific index. During market hours, indices are 15 minute delay, ET. New delayed trade updates are updated on the page as indicated by a \"flash\".\nBarchart Symbol Notes Tutorial (8:43)\nQuoteboard data fields include:\n- Day High / Low: The highest and lowest trade price for the current trading session.\n- Open: The opening price for the current trading session is plotted on the day's High/Low histogram.\n- Previous Close: The closing price from the previous trading session.\n- Weighted Alpha: A measure of how much a stock or commodity has risen or fallen over a one-year period. Barchart takes this Alpha and weights this, assigning more weight to recent activity, and less (0.5 factor) to activity at the beginning of the period. Thus, Weighted Alpha is a measure of one-year growth with an emphasis on the most recent price activity.\n- YTD High, Low, Change, %Change: The high and low price year-to-date, with the change and percent change year-to-date.\nChart Snapshot\nA thumbnail of a daily chart is provided, with a link to open and customize a full-sized chart.\nPrice Performance\nThis section shows the Highs and Lows over the past 1, 3 and 12-Month periods. Click the \"See More\" link to see the full Performance Report page with expanded historical information.\nOptions Overview\nHighlights important summary options statistics to provide a forward looking indication of investors' sentiment.\n- Implied Volatility: The average implied volatility (IV) of the nearest monthly options contract that is 30-days or more out. IV is a forward looking prediction of the likelihood of price change of the underlying asset, with a higher IV signifying that the market expects significant price movement, and a lower IV signifying the market expects the underlying asset price to remain within the current trading range.\n- 30-Day Historical Volatility: The average deviation from the average price over the last 30 days. Historical Volatility is a measurement of how fast the underlying security has been changing in price back in time.\n- IV Percentile: The percentage of days with IV closing below the current IV value over the prior 1-year. A high IV Percentile means the current IV is at a higher level than for most of the past year. This would occur after a period of significant price movement, and a high IV Percentile can often predict a coming market reversal in price.\n- IV Rank: The current IV compared to the highest and lowest values over the past 1-year. If IV Rank is 100% this means the IV is at its highest level over the past 1-year, and can signify the market is overbought.\n- IV High: The highest IV reading over the past 1-year and date it happened.\n- IV Low: The lowest IV reading over the past 1-year and date it happened.\n- Put/Call Vol Ratio: The total Put/Call volume ratio for all option contracts (across all expiration dates). A high put/call ratio can signify the market is oversold as more traders are buying puts rather than calls, and a low put/call ratio can signify the market is overbought as more traders are buying calls rather than puts.\n- Today's Volume: The total volume for all option contracts (across all expiration dates) traded during the current session.\n- Volume Avg (30-Day): The average volume for all option contracts (across all expiration dates) for the last 30-days.\n- Put/Call OI Ratio: The put/call open interest ratio for all options contracts (across all expiration dates).\n- Today's Open Interest: The total open interest for all option contracts (across all expiration dates).\n- Open Int (30-Day): The average total open interest for all option contracts (across all expiration dates) for the last 30 days.\nBarchart Technical Opinion\nThe Barchart Technical Opinion widget shows you today's overall Barchart Opinion with general information on how to interpret the short and longer term signals. Unique to Barchart.com, Opinions analyzes a stock or commodity using 13 popular analytics in short-, medium- and long-term periods. Results are interpreted as buy, sell or hold signals, each with numeric ratings and summarized with an overall percentage buy or sell rating. After each calculation the program assigns a Buy, Sell, or Hold value with the study, depending on where the price lies in reference to the common interpretation of the study. For example, a price above its moving average is generally considered an upward trend or a buy.\nThe Opinion will show on the Quote Overview Page for all asset classes with this exception: For all U.S. Stocks, the Market Cap must be greater than $1B.\nA symbol will be given one of the following overall ratings:\n- Strong Buy (greater than \"66% Buy\")\n- Buy (greater than or equal to \"33% Buy\" and less than or equal to \"66% Buy\")\n- Weak Buy (\"0% Buy\" through \"33% Buy\")\n- Hold\n- Strong Sell (greater than \"66% Sell\")\n- Sell (greater than or equal to \"33% Sell\" and less than or equal to \"66% Sell\")\n- Weak Sell (\"0% Sell\" through \"33% Sell\")\nThe current reading of the 14-Day Relative Strength Index is also factored into the interpretation. The following information will appear when the following conditions are met:\n- If the Relative Strength is above 80, the following displays: \"Relative Strength is above 80%. The market is in extreme overbought territory. Beware of a trend reversal.\"\n- If the Relative Strength has moved to 'above 80' with today's session, the following displays: \"Relative Strength just crossed above 80%. The market has entered extreme overbought territory.\"\n- If the Relative Strength has moved to 'below 80' with today's session, the following displays: \"Relative Strength just crossed below 80%. The market has dropped from extreme overbought territory, indicating a possible trend reversal. \"\n- If the Relative Strength is above 70, the following displays: \"Relative Strength is above 70%. The market is in overbought territory. Watch for a potential trend reversal.\"\n- If the Relative Strength has moved to 'above 70' with today's session, the following displays: \"Relative Strength just crossed above 70%. The market has entered overbought territory.\"\n- If the Relative Strength has moved to 'below 70' with today's session, the following displays: \"Relative Strength just crossed below 70%. The market has dropped from overbought territory. Beware of a potential mean reversion.\"\n- If the Relative Strength has moved to 'above 50' with today's session, the following displays: \"Relative Strength just crossed above 50%. The market is indicating support for a bullish trend.\"\n- If the Relative Strength has moved to 'below 50' with today's session, the following displays: \"Relative Strength just crossed below 50%. The market is indicating support for a bearish trend.\"\n- If the Relative Strength has moved to 'above 30' with today's session, the following displays: \"Relative Strength just crossed above 30%. The market has bounced from oversold territory. Beware of a potential mean reversion.\"\n- If the Relative Strength has moved to 'below 30' with today's session, the following displays: \" Relative Strength just crossed below 30%. The market has entered oversold territory.\"\n- If the Relative Strength is below 30, the following displays: \"Relative Strength is below 30%. The market is in oversold territory. Watch for a potential trend reversal.\"\n-\n- If the Relative Strength has moved to 'above 20' with today's session, the following displays: \" Relative Strength just crossed above 20%. The market has bounced from extreme oversold territory, indicating a possible trend reversal.\"\n- If the Relative Strength has moved to 'below 20' with today's session, the following displays: \"Relative Strength just crossed below 20%. The market has entered extreme territory.\"\n- If the Relative Strength is below 20, the following displays: \"Relative Strength is below 20%. The market is in extreme oversold territory. Beware of a trend reversal.\"\nRelated Stocks\nFor comparison purposes, find information on other symbols contained in the same sector.\nBarchart Commodities Insider Commentary\nBarchart Commodities Insider is Ag market commentary for Grains and Oilseeds, Energy, Gold, Silver, Cocoa, Coffee, and Sugar markets.\nMost Recent Stories\nView the latest top stories from the Associated Press or Canadian Press (based on your Market selection).\nToday's New Highs & Lows\nThe New Highs/Lows widget provides a snapshot of US stocks that have made or matched a new high or low price for a specific time period. Stocks must have traded for the specified time period in order to be considered as a new High or Low.\nNew Highs/Lows only includes stocks traded on NYSE, NYSE Arca, Nasdaq or OTC-US exchanges with over 5 days of prices, with a last price above $0.25 and below $10,000, and with volume greater than 1000 shares.\nCalculations are adjusted for stock splits but not dividend distributions. Numbers exclude exclude unit investment trusts, closed end funds, warrant stocks, preferred securities and any non-SIC classified stock.\nPercentage of Stocks Above Moving Average\nFor the major indices on the site, this widget shows the percentage of stocks contained in the index that are above their 20-Day, 50-Day, 100-Day, 150-Day, and 200-Day Moving Averages.\nIn theory, the direction of the moving average (higher, lower or flat) indicates the trend of the market. Its slope indicates the strength of the trend. Longer averages are used to identify longer-term trends. Shorter averages are used to identify shorter-term trends. Many trading systems utilize moving averages as independent variables and market analysts frequently use moving averages to confirm technical breakouts.\nWhen prices are rising they are usually above the average. This is to be expected since the average includes data from the previous, lower priced days. As long as prices remain above the average there is strength in the market."
    },
    {
      "url": "https://www.barchart.com/futures/quotes/%24DOWI/overview",
      "text": "The Quote Overview page gives you a snapshot view for a specific index. During market hours, indices are 15 minute delay, ET. New delayed trade updates are updated on the page as indicated by a \"flash\".\nBarchart Symbol Notes Tutorial (8:43)\nQuoteboard data fields include:\n- Day High / Low: The highest and lowest trade price for the current trading session.\n- Open: The opening price for the current trading session is plotted on the day's High/Low histogram.\n- Previous Close: The closing price from the previous trading session.\n- Weighted Alpha: A measure of how much a stock or commodity has risen or fallen over a one-year period. Barchart takes this Alpha and weights this, assigning more weight to recent activity, and less (0.5 factor) to activity at the beginning of the period. Thus, Weighted Alpha is a measure of one-year growth with an emphasis on the most recent price activity.\n- YTD High, Low, Change, %Change: The high and low price year-to-date, with the change and percent change year-to-date.\nChart Snapshot\nA thumbnail of a daily chart is provided, with a link to open and customize a full-sized chart.\nPrice Performance\nThis section shows the Highs and Lows over the past 1, 3 and 12-Month periods. Click the \"See More\" link to see the full Performance Report page with expanded historical information.\nOptions Overview\nHighlights important summary options statistics to provide a forward looking indication of investors' sentiment.\n- Implied Volatility: The average implied volatility (IV) of the nearest monthly options contract that is 30-days or more out. IV is a forward looking prediction of the likelihood of price change of the underlying asset, with a higher IV signifying that the market expects significant price movement, and a lower IV signifying the market expects the underlying asset price to remain within the current trading range.\n- 30-Day Historical Volatility: The average deviation from the average price over the last 30 days. Historical Volatility is a measurement of how fast the underlying security has been changing in price back in time.\n- IV Percentile: The percentage of days with IV closing below the current IV value over the prior 1-year. A high IV Percentile means the current IV is at a higher level than for most of the past year. This would occur after a period of significant price movement, and a high IV Percentile can often predict a coming market reversal in price.\n- IV Rank: The current IV compared to the highest and lowest values over the past 1-year. If IV Rank is 100% this means the IV is at its highest level over the past 1-year, and can signify the market is overbought.\n- IV High: The highest IV reading over the past 1-year and date it happened.\n- IV Low: The lowest IV reading over the past 1-year and date it happened.\n- Put/Call Vol Ratio: The total Put/Call volume ratio for all option contracts (across all expiration dates). A high put/call ratio can signify the market is oversold as more traders are buying puts rather than calls, and a low put/call ratio can signify the market is overbought as more traders are buying calls rather than puts.\n- Today's Volume: The total volume for all option contracts (across all expiration dates) traded during the current session.\n- Volume Avg (30-Day): The average volume for all option contracts (across all expiration dates) for the last 30-days.\n- Put/Call OI Ratio: The put/call open interest ratio for all options contracts (across all expiration dates).\n- Today's Open Interest: The total open interest for all option contracts (across all expiration dates).\n- Open Int (30-Day): The average total open interest for all option contracts (across all expiration dates) for the last 30 days.\nBarchart Technical Opinion\nThe Barchart Technical Opinion widget shows you today's overall Barchart Opinion with general information on how to interpret the short and longer term signals. Unique to Barchart.com, Opinions analyzes a stock or commodity using 13 popular analytics in short-, medium- and long-term periods. Results are interpreted as buy, sell or hold signals, each with numeric ratings and summarized with an overall percentage buy or sell rating. After each calculation the program assigns a Buy, Sell, or Hold value with the study, depending on where the price lies in reference to the common interpretation of the study. For example, a price above its moving average is generally considered an upward trend or a buy.\nThe Opinion will show on the Quote Overview Page for all asset classes with this exception: For all U.S. Stocks, the Market Cap must be greater than $1B.\nA symbol will be given one of the following overall ratings:\n- Strong Buy (greater than \"66% Buy\")\n- Buy (greater than or equal to \"33% Buy\" and less than or equal to \"66% Buy\")\n- Weak Buy (\"0% Buy\" through \"33% Buy\")\n- Hold\n- Strong Sell (greater than \"66% Sell\")\n- Sell (greater than or equal to \"33% Sell\" and less than or equal to \"66% Sell\")\n- Weak Sell (\"0% Sell\" through \"33% Sell\")\nThe current reading of the 14-Day Relative Strength Index is also factored into the interpretation. The following information will appear when the following conditions are met:\n- If the Relative Strength is above 80, the following displays: \"Relative Strength is above 80%. The market is in extreme overbought territory. Beware of a trend reversal.\"\n- If the Relative Strength has moved to 'above 80' with today's session, the following displays: \"Relative Strength just crossed above 80%. The market has entered extreme overbought territory.\"\n- If the Relative Strength has moved to 'below 80' with today's session, the following displays: \"Relative Strength just crossed below 80%. The market has dropped from extreme overbought territory, indicating a possible trend reversal. \"\n- If the Relative Strength is above 70, the following displays: \"Relative Strength is above 70%. The market is in overbought territory. Watch for a potential trend reversal.\"\n- If the Relative Strength has moved to 'above 70' with today's session, the following displays: \"Relative Strength just crossed above 70%. The market has entered overbought territory.\"\n- If the Relative Strength has moved to 'below 70' with today's session, the following displays: \"Relative Strength just crossed below 70%. The market has dropped from overbought territory. Beware of a potential mean reversion.\"\n- If the Relative Strength has moved to 'above 50' with today's session, the following displays: \"Relative Strength just crossed above 50%. The market is indicating support for a bullish trend.\"\n- If the Relative Strength has moved to 'below 50' with today's session, the following displays: \"Relative Strength just crossed below 50%. The market is indicating support for a bearish trend.\"\n- If the Relative Strength has moved to 'above 30' with today's session, the following displays: \"Relative Strength just crossed above 30%. The market has bounced from oversold territory. Beware of a potential mean reversion.\"\n- If the Relative Strength has moved to 'below 30' with today's session, the following displays: \" Relative Strength just crossed below 30%. The market has entered oversold territory.\"\n- If the Relative Strength is below 30, the following displays: \"Relative Strength is below 30%. The market is in oversold territory. Watch for a potential trend reversal.\"\n-\n- If the Relative Strength has moved to 'above 20' with today's session, the following displays: \" Relative Strength just crossed above 20%. The market has bounced from extreme oversold territory, indicating a possible trend reversal.\"\n- If the Relative Strength has moved to 'below 20' with today's session, the following displays: \"Relative Strength just crossed below 20%. The market has entered extreme territory.\"\n- If the Relative Strength is below 20, the following displays: \"Relative Strength is below 20%. The market is in extreme oversold territory. Beware of a trend reversal.\"\nRelated Stocks\nFor comparison purposes, find information on other symbols contained in the same sector.\nBarchart Commodities Insider Commentary\nBarchart Commodities Insider is Ag market commentary for Grains and Oilseeds, Energy, Gold, Silver, Cocoa, Coffee, and Sugar markets.\nMost Recent Stories\nView the latest top stories from the Associated Press or Canadian Press (based on your Market selection).\nToday's New Highs & Lows\nThe New Highs/Lows widget provides a snapshot of US stocks that have made or matched a new high or low price for a specific time period. Stocks must have traded for the specified time period in order to be considered as a new High or Low.\nNew Highs/Lows only includes stocks traded on NYSE, NYSE Arca, Nasdaq or OTC-US exchanges with over 5 days of prices, with a last price above $0.25 and below $10,000, and with volume greater than 1000 shares.\nCalculations are adjusted for stock splits but not dividend distributions. Numbers exclude exclude unit investment trusts, closed end funds, warrant stocks, preferred securities and any non-SIC classified stock.\nPercentage of Stocks Above Moving Average\nFor the major indices on the site, this widget shows the percentage of stocks contained in the index that are above their 20-Day, 50-Day, 100-Day, 150-Day, and 200-Day Moving Averages.\nIn theory, the direction of the moving average (higher, lower or flat) indicates the trend of the market. Its slope indicates the strength of the trend. Longer averages are used to identify longer-term trends. Shorter averages are used to identify shorter-term trends. Many trading systems utilize moving averages as independent variables and market analysts frequently use moving averages to confirm technical breakouts.\nWhen prices are rising they are usually above the average. This is to be expected since the average includes data from the previous, lower priced days. As long as prices remain above the average there is strength in the market."
    },
    {
      "url": "https://www.barchart.com/futures/quotes/ES*0/overview",
      "text": "The Quote Overview page gives you a snapshot view for a specific futures symbol. During market hours, delayed exchange price information displays (Futures: 10 minute delay, CT) and new delayed trade updates are updated on the page (as indicated by a \"flash\").\nBarchart Symbol Notes Tutorial (8:43)\nQuoteboard data fields include:\n- Day High / Low: The highest and lowest trade price for the current trading session.\n- Open: The opening price for the current trading session is plotted on the day's High/Low histogram.\n- Previous Close: The closing price from the previous trading session.\n- Bid: The last bid price and bid size.\n- Ask: The last ask price and ask size.\n- Volume: The total number of shares or contracts traded in the current trading session.\n- Average Volume: The average number of shares traded over the last 20 days.\n- Weighted Alpha: A measure of how much a stock or commodity has risen or fallen over a one-year period.\nChart Snapshot\nA thumbnail of a daily chart is provided, with a link to open and customize a full-sized chart.\nPrice Performance\nThis section shows the Highs and Lows over the past 1, 3 and 12-Month periods. Click the \"See More\" link to see the full Performance Report page with expanded historical information.\nMore Futures Quotes\nThis section displays additional open contracts for the futures symbol you are viewing.\nSeasonal Chart\nA seasonal chart is designed to help you visualize how futures contracts have performed during a calendar year. They help show patterns and price trends for commodities whose prices often change with the seasons.\nThe widget shows the Last Price of the commodity you are viewing, compared to the average last price of the same commodity for the past 18 months.\nRelated ETFs\nFind exchange traded funds (ETFs) whose sector aligns with the same commodity grouping as the symbol you are viewing. Analysis of these related ETFs and how they are trading may provide insight to this commodity.\nCommitment of Traders Positions\nThis widget shows the latest week's Commitment of Traders open interest. The COT data, as reported by the US Commodity Futures Trading Commission (CFTC), is from Tuesday, and is released Friday by the CFTC. Reporting firms send Tuesday open interest data on Wednesday morning. The CFTC then corrects and verifies the data for release by Friday afternoon. The Barchart site's data is then updated, after the official CFTC release.\nYou will see the Long and Short positions from the Legacy Commitments of Traders report, plus either the Long and Short positions from the Disaggregated Report or the Financial TFF Report.\nA link to view a chart with both COT studies applied is also available.\nRelated Stocks\nFor comparison purposes, find information on other symbols contained in the same sector.\nBarchart Commodities Insider Commentary\nBarchart Commodities Insider is Ag market commentary for Grains and Oilseeds, Energy, Gold, Silver, Cocoa, Coffee, and Sugar markets.\nMost Recent Stories\nView the latest top stories from the Associated Press or Canadian Press (based on your Market selection)."
    },
    {
      "url": "https://www.barchart.com/futures/quotes/ZN*0/overview",
      "text": "The Quote Overview page gives you a snapshot view for a specific futures symbol. During market hours, delayed exchange price information displays (Futures: 10 minute delay, CT) and new delayed trade updates are updated on the page (as indicated by a \"flash\").\nBarchart Symbol Notes Tutorial (8:43)\nQuoteboard data fields include:\n- Day High / Low: The highest and lowest trade price for the current trading session.\n- Open: The opening price for the current trading session is plotted on the day's High/Low histogram.\n- Previous Close: The closing price from the previous trading session.\n- Bid: The last bid price and bid size.\n- Ask: The last ask price and ask size.\n- Volume: The total number of shares or contracts traded in the current trading session.\n- Average Volume: The average number of shares traded over the last 20 days.\n- Weighted Alpha: A measure of how much a stock or commodity has risen or fallen over a one-year period.\nChart Snapshot\nA thumbnail of a daily chart is provided, with a link to open and customize a full-sized chart.\nPrice Performance\nThis section shows the Highs and Lows over the past 1, 3 and 12-Month periods. Click the \"See More\" link to see the full Performance Report page with expanded historical information.\nMore Futures Quotes\nThis section displays additional open contracts for the futures symbol you are viewing.\nSeasonal Chart\nA seasonal chart is designed to help you visualize how futures contracts have performed during a calendar year. They help show patterns and price trends for commodities whose prices often change with the seasons.\nThe widget shows the Last Price of the commodity you are viewing, compared to the average last price of the same commodity for the past 18 months.\nRelated ETFs\nFind exchange traded funds (ETFs) whose sector aligns with the same commodity grouping as the symbol you are viewing. Analysis of these related ETFs and how they are trading may provide insight to this commodity.\nCommitment of Traders Positions\nThis widget shows the latest week's Commitment of Traders open interest. The COT data, as reported by the US Commodity Futures Trading Commission (CFTC), is from Tuesday, and is released Friday by the CFTC. Reporting firms send Tuesday open interest data on Wednesday morning. The CFTC then corrects and verifies the data for release by Friday afternoon. The Barchart site's data is then updated, after the official CFTC release.\nYou will see the Long and Short positions from the Legacy Commitments of Traders report, plus either the Long and Short positions from the Disaggregated Report or the Financial TFF Report.\nA link to view a chart with both COT studies applied is also available.\nRelated Stocks\nFor comparison purposes, find information on other symbols contained in the same sector.\nBarchart Commodities Insider Commentary\nBarchart Commodities Insider is Ag market commentary for Grains and Oilseeds, Energy, Gold, Silver, Cocoa, Coffee, and Sugar markets.\nMost Recent Stories\nView the latest top stories from the Associated Press or Canadian Press (based on your Market selection)."
    },
    {
      "url": "https://www.barchart.com/futures/quotes/%24IUXX/overview",
      "text": "The Quote Overview page gives you a snapshot view for a specific index. During market hours, indices are 15 minute delay, ET. New delayed trade updates are updated on the page as indicated by a \"flash\".\nBarchart Symbol Notes Tutorial (8:43)\nQuoteboard data fields include:\n- Day High / Low: The highest and lowest trade price for the current trading session.\n- Open: The opening price for the current trading session is plotted on the day's High/Low histogram.\n- Previous Close: The closing price from the previous trading session.\n- Weighted Alpha: A measure of how much a stock or commodity has risen or fallen over a one-year period. Barchart takes this Alpha and weights this, assigning more weight to recent activity, and less (0.5 factor) to activity at the beginning of the period. Thus, Weighted Alpha is a measure of one-year growth with an emphasis on the most recent price activity.\n- YTD High, Low, Change, %Change: The high and low price year-to-date, with the change and percent change year-to-date.\nChart Snapshot\nA thumbnail of a daily chart is provided, with a link to open and customize a full-sized chart.\nPrice Performance\nThis section shows the Highs and Lows over the past 1, 3 and 12-Month periods. Click the \"See More\" link to see the full Performance Report page with expanded historical information.\nOptions Overview\nHighlights important summary options statistics to provide a forward looking indication of investors' sentiment.\n- Implied Volatility: The average implied volatility (IV) of the nearest monthly options contract that is 30-days or more out. IV is a forward looking prediction of the likelihood of price change of the underlying asset, with a higher IV signifying that the market expects significant price movement, and a lower IV signifying the market expects the underlying asset price to remain within the current trading range.\n- 30-Day Historical Volatility: The average deviation from the average price over the last 30 days. Historical Volatility is a measurement of how fast the underlying security has been changing in price back in time.\n- IV Percentile: The percentage of days with IV closing below the current IV value over the prior 1-year. A high IV Percentile means the current IV is at a higher level than for most of the past year. This would occur after a period of significant price movement, and a high IV Percentile can often predict a coming market reversal in price.\n- IV Rank: The current IV compared to the highest and lowest values over the past 1-year. If IV Rank is 100% this means the IV is at its highest level over the past 1-year, and can signify the market is overbought.\n- IV High: The highest IV reading over the past 1-year and date it happened.\n- IV Low: The lowest IV reading over the past 1-year and date it happened.\n- Put/Call Vol Ratio: The total Put/Call volume ratio for all option contracts (across all expiration dates). A high put/call ratio can signify the market is oversold as more traders are buying puts rather than calls, and a low put/call ratio can signify the market is overbought as more traders are buying calls rather than puts.\n- Today's Volume: The total volume for all option contracts (across all expiration dates) traded during the current session.\n- Volume Avg (30-Day): The average volume for all option contracts (across all expiration dates) for the last 30-days.\n- Put/Call OI Ratio: The put/call open interest ratio for all options contracts (across all expiration dates).\n- Today's Open Interest: The total open interest for all option contracts (across all expiration dates).\n- Open Int (30-Day): The average total open interest for all option contracts (across all expiration dates) for the last 30 days.\nBarchart Technical Opinion\nThe Barchart Technical Opinion widget shows you today's overall Barchart Opinion with general information on how to interpret the short and longer term signals. Unique to Barchart.com, Opinions analyzes a stock or commodity using 13 popular analytics in short-, medium- and long-term periods. Results are interpreted as buy, sell or hold signals, each with numeric ratings and summarized with an overall percentage buy or sell rating. After each calculation the program assigns a Buy, Sell, or Hold value with the study, depending on where the price lies in reference to the common interpretation of the study. For example, a price above its moving average is generally considered an upward trend or a buy.\nThe Opinion will show on the Quote Overview Page for all asset classes with this exception: For all U.S. Stocks, the Market Cap must be greater than $1B.\nA symbol will be given one of the following overall ratings:\n- Strong Buy (greater than \"66% Buy\")\n- Buy (greater than or equal to \"33% Buy\" and less than or equal to \"66% Buy\")\n- Weak Buy (\"0% Buy\" through \"33% Buy\")\n- Hold\n- Strong Sell (greater than \"66% Sell\")\n- Sell (greater than or equal to \"33% Sell\" and less than or equal to \"66% Sell\")\n- Weak Sell (\"0% Sell\" through \"33% Sell\")\nThe current reading of the 14-Day Relative Strength Index is also factored into the interpretation. The following information will appear when the following conditions are met:\n- If the Relative Strength is above 80, the following displays: \"Relative Strength is above 80%. The market is in extreme overbought territory. Beware of a trend reversal.\"\n- If the Relative Strength has moved to 'above 80' with today's session, the following displays: \"Relative Strength just crossed above 80%. The market has entered extreme overbought territory.\"\n- If the Relative Strength has moved to 'below 80' with today's session, the following displays: \"Relative Strength just crossed below 80%. The market has dropped from extreme overbought territory, indicating a possible trend reversal. \"\n- If the Relative Strength is above 70, the following displays: \"Relative Strength is above 70%. The market is in overbought territory. Watch for a potential trend reversal.\"\n- If the Relative Strength has moved to 'above 70' with today's session, the following displays: \"Relative Strength just crossed above 70%. The market has entered overbought territory.\"\n- If the Relative Strength has moved to 'below 70' with today's session, the following displays: \"Relative Strength just crossed below 70%. The market has dropped from overbought territory. Beware of a potential mean reversion.\"\n- If the Relative Strength has moved to 'above 50' with today's session, the following displays: \"Relative Strength just crossed above 50%. The market is indicating support for a bullish trend.\"\n- If the Relative Strength has moved to 'below 50' with today's session, the following displays: \"Relative Strength just crossed below 50%. The market is indicating support for a bearish trend.\"\n- If the Relative Strength has moved to 'above 30' with today's session, the following displays: \"Relative Strength just crossed above 30%. The market has bounced from oversold territory. Beware of a potential mean reversion.\"\n- If the Relative Strength has moved to 'below 30' with today's session, the following displays: \" Relative Strength just crossed below 30%. The market has entered oversold territory.\"\n- If the Relative Strength is below 30, the following displays: \"Relative Strength is below 30%. The market is in oversold territory. Watch for a potential trend reversal.\"\n-\n- If the Relative Strength has moved to 'above 20' with today's session, the following displays: \" Relative Strength just crossed above 20%. The market has bounced from extreme oversold territory, indicating a possible trend reversal.\"\n- If the Relative Strength has moved to 'below 20' with today's session, the following displays: \"Relative Strength just crossed below 20%. The market has entered extreme territory.\"\n- If the Relative Strength is below 20, the following displays: \"Relative Strength is below 20%. The market is in extreme oversold territory. Beware of a trend reversal.\"\nRelated Stocks\nFor comparison purposes, find information on other symbols contained in the same sector.\nBarchart Commodities Insider Commentary\nBarchart Commodities Insider is Ag market commentary for Grains and Oilseeds, Energy, Gold, Silver, Cocoa, Coffee, and Sugar markets.\nMost Recent Stories\nView the latest top stories from the Associated Press or Canadian Press (based on your Market selection).\nToday's New Highs & Lows\nThe New Highs/Lows widget provides a snapshot of US stocks that have made or matched a new high or low price for a specific time period. Stocks must have traded for the specified time period in order to be considered as a new High or Low.\nNew Highs/Lows only includes stocks traded on NYSE, NYSE Arca, Nasdaq or OTC-US exchanges with over 5 days of prices, with a last price above $0.25 and below $10,000, and with volume greater than 1000 shares.\nCalculations are adjusted for stock splits but not dividend distributions. Numbers exclude exclude unit investment trusts, closed end funds, warrant stocks, preferred securities and any non-SIC classified stock.\nPercentage of Stocks Above Moving Average\nFor the major indices on the site, this widget shows the percentage of stocks contained in the index that are above their 20-Day, 50-Day, 100-Day, 150-Day, and 200-Day Moving Averages.\nIn theory, the direction of the moving average (higher, lower or flat) indicates the trend of the market. Its slope indicates the strength of the trend. Longer averages are used to identify longer-term trends. Shorter averages are used to identify shorter-term trends. Many trading systems utilize moving averages as independent variables and market analysts frequently use moving averages to confirm technical breakouts.\nWhen prices are rising they are usually above the average. This is to be expected since the average includes data from the previous, lower priced days. As long as prices remain above the average there is strength in the market."
    }
  ],
  "argos_summary": "US stocks rallied, with the S&P 500 hitting a new all‑time high and the Nasdaq 100 posting a 1.5‑week high, driven by a stronger‑than‑expected Q2 GDP revision and falling initial jobless claims.  Earnings disappointments from Hormel and Nvidia tempered the rally, while the market remains wary of potential Fed rate cuts, discounting a 25‑bp cut at the next meeting.  Trump’s threat to raise tariffs on semiconductors and the extension of the China tariff truce add uncertainty, and global markets posted modest gains—Euro Stoxx 50 +0.07%, Shanghai +1.14% and Nikkei +0.73%.  Treasury yields eased slightly, with the 10‑year UST at 4.209% and the Bund at 2.679%, reflecting hawkish economic data and cautious monetary outlook.",
  "argos_id": "VDO8D9T7M"
}