{
  "url": "https://www.cnbc.com/2025/08/29/bank-of-america-gold-price-trump-federal-reserve-independence.html",
  "authorsByline": "Spencer Kimball",
  "articleId": "42169082487c405b8ca598d4dbfb1952",
  "source": {
    "domain": "cnbc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Bergen County",
      "city": "Englewood Cliffs",
      "coordinates": {
        "lat": 40.8853773,
        "lon": -73.9523597
      }
    }
  },
  "imageUrl": "https://image.cnbcfm.com/api/v1/image/108189455-1755837837539-gettyimages-2207841764-20090101250404-99-437438.jpeg?v=1756471264&w=1920&h=1080",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-29T14:07:00+00:00",
  "addDate": "2025-08-29T14:34:09.890894+00:00",
  "refreshDate": "2025-08-29T14:34:09.890896+00:00",
  "score": 1.0,
  "title": "Bank of America raises gold forecast, noting Trump threat to Federal Reserve independence",
  "description": "The Wall Street investment bank said it remains bullish on gold, \"with a short-/medium-term target of US$4,000/oz.\"",
  "content": "Bank of America on Friday raised its average gold price forecast for the next six years by 6% to $3,049 per ounce, citing President Donald Trump's threats to undermine the Federal Reserve's independence among other factors. The Wall Street investment bank said it remains bullish on gold, \"with a short-/medium-term target of US$4,000/oz.\" The bank left its near-term forecasts unchanged with gold forecast to hit $3,356 this year and $3,659 next year. Gold is viewed by investors as a safe-haven asset in times of financial and geopolitical instability. And Trump's repeated attacks on the Federal Reserve are raising concern in some corners of the market that the U.S. central bank's capacity to make independent monetary decisions is at risk. Gold futures have been on a tear this year, gaining about 31% to recently trade at about $3,473. \"In our view, conditions that have led to recent strength in gold prices look likely to persist,\" Bank of America analysts led Jason Fairclough told clients. \"Namely: (1) U.S. structural deficit; (2) Inflationary pressure from deglobalization; (3) perceived threats to independence of the U.S. central bank; and (4) global geopolitical tensions & uncertainty.\" Trump has sought to fire Federal Reserve Board Governor Lisa Cook over allegations that she made false statements on mortgage applications. He is the first president to attempt to oust a Fed governor, in a move that Wall Street largely views as an attempt to gain control over the central bank. If Trump is successful and moves quickly to name a Cook replacement, he would have a path to consolidate a majority on the Fed board. This would potentially give him the ability to reshape the Federal Open Market Committee and gain more influence over interest rate decisions. Trump's pick to fill a vacancy on the Fed board, Stephen Miran, is scheduled for a hearing before the U.S. Senate Banking Committee on Sept. 4. Fairclough and his team also bumped their silver forecasts, lifting the average silver price 7.5% to $38 an ounce.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Federal Reserve independence",
      "weight": 0.09933265
    },
    {
      "name": "Federal Reserve",
      "weight": 0.09558217
    },
    {
      "name": "Federal Reserve Board",
      "weight": 0.09373425
    },
    {
      "name": "Federal Reserve Board Governor Lisa Cook",
      "weight": 0.092829324
    },
    {
      "name": "Trump threat",
      "weight": 0.0865539
    },
    {
      "name": "gold prices",
      "weight": 0.08469681
    },
    {
      "name": "gold forecast",
      "weight": 0.07971614
    },
    {
      "name": "Donald Trump",
      "weight": 0.0744147
    },
    {
      "name": "Gold futures",
      "weight": 0.071250476
    },
    {
      "name": "Trump",
      "weight": 0.06987609
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Federal Reserve"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9150390625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.72705078125
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.697265625
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.517578125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.39599609375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.33837890625
    }
  ],
  "sentiment": {
    "positive": 0.21126539,
    "negative": 0.4625175,
    "neutral": 0.32621717
  },
  "summary": "Bank of America has raised its average gold price forecast for the next six years by 6% to $3,049 per ounce, citing threats from President Donald Trump to undermine the Federal Reserve's independence. The Wall Street investment bank remains bullish on gold, with a short-term target of US$4,000/oz. The bank left its near-term forecasts unchanged, with gold forecasted at $3356 this year and $33,659 next year. The move comes as a concern about the Federal Mortgage Board's ability to make independent monetary decisions. If successful, Trump could consolidate a majority on the Fed board, gaining more influence over interest rate decisions.",
  "shortSummary": "Bank of America raises its gold price forecast by 6% to $3,049 per ounce amid concerns over President Donald Trump's potential undermining of Federal Reserve independence.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "95a205aa76324157a66c69ee1254c670",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Bank of America raised its 6‑year gold forecast by 6% to $3,049/oz, citing Trump’s attacks on Fed independence, a structural deficit, de‑globalisation‑driven inflation, and geopolitical tensions. The bank keeps a short‑term target of $4,000/oz and unchanged near‑term forecasts of $3,356 this year and $3,659 next year. Gold futures have surged 31% this year to about $3,473/oz. The bank also lifted its silver forecast by 7.5% to $38/oz.",
  "argos_id": "XUP8IRL2R"
}