{
  "url": "https://finance.yahoo.com/news/august-11-national-811-day-150000720.html",
  "authorsByline": "PR Newswire",
  "articleId": "20f2819659e942ea888e079abf4dcb79",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/prnewswire.com/f0844c4620276d7a2695c57f2fec9236",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T15:00:00+00:00",
  "addDate": "2025-08-08T15:14:32.757442+00:00",
  "refreshDate": "2025-08-08T15:14:32.757445+00:00",
  "score": 1.0,
  "title": "August 11 is National 811 Day--A Reminder to Call 811 Before Any Digging Project, Large or Small",
  "description": "Monday, August 11, is recognized as National 811 Day, to raise awareness of the importance of making a free call to 811 before any digging project, large or small. Whether you are a property owner or a contractor, calling 811 will help ensure that projects involving digging can be done safely while avoiding expensive repairs due to damaged underground utility lines.",
  "content": "A Free Call to 811 Will Help Keep You Safe and Avoid Expensive Repairs Averaging $3,500\n\nOAKLAND, Calif., Aug. 8, 2025 /PRNewswire/ -- Monday, August 11, is recognized as National 811 Day, to raise awareness of the importance of making a free call to 811 before any digging project, large or small. Whether you are a property owner or a contractor, calling 811 will help ensure that projects involving digging can be done safely while avoiding expensive repairs due to damaged underground utility lines.\n\nUnderground utility lines can be shallow, sometimes only a few inches below the surface, so it is important to call 811 before any project that involves digging, including building or replacing a fence, planting or landscaping, and beginning construction work.\n\nIn Pacific Gas and Electric Company's (PG&E) service area, underground gas and electric lines have been damaged due to digging 471 times so far this year. In 59% of those cases, 811 wasn't called. For residential customers, 90% of those striking lines while digging didn't call 811.\n\nMaking a free call to 811 will not only help keep you safe, it can save you money, as damaging an underground line while digging leads to repair costs averaging $3,500.\n\n\"By making a fast and free call to 811, utility professionals will come to your home or job site and mark the location of underground lines so that you can dig safely and avoid expensive repairs. Know what's below before you start any size digging project, whether you are planting, landscaping, or doing fence work and call 811 two days before you dig,\" said PG&E Damage Prevention Director Mitch Smith.\n\nWhen a call is placed to 811 to have lines located and marked, a professional locator will come to your project site to mark the location of underground utility lines, including gas, electric, water, telecom and sewer, free of charge. Knowing where underground lines are buried while you are digging and following safe digging practices will help keep you and your family safe and connected to essential utility services.\n\nWarmer weather months see an increase in digging projects and a corresponding increase in the number of strikes to underground lines that have not been marked ahead of time. In fact, in 2025 throughout PG&E's service area of Northern and Central California:\n• There have been 471 incidents where underground utility lines were damaged due to digging, and in 59% of incidents when an underground utility line was damaged due to digging, 811 was not called\n• For homeowners specifically, that percentage rises to 90%\n• The average cost to repair a damaged utility line is $3,500\n• Leading causes of damages to underground utility lines while digging include: building or replacing a fence, gardening and landscaping, planting a tree or removing a stump, sewer and irrigation work and building a deck or patio",
  "medium": "Article",
  "links": [
    "https://mma.prnewswire.com/media/1975784/Pacific_Gas_and_Electric_Logo.html"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Underground utility lines",
      "weight": 0.13671409
    },
    {
      "name": "underground utility lines",
      "weight": 0.13671409
    },
    {
      "name": "damaged underground utility lines",
      "weight": 0.13629067
    },
    {
      "name": "underground lines",
      "weight": 0.12731878
    },
    {
      "name": "digging projects",
      "weight": 0.10388142
    },
    {
      "name": "lines",
      "weight": 0.10079982
    },
    {
      "name": "safe digging practices",
      "weight": 0.09005826
    },
    {
      "name": "essential utility services",
      "weight": 0.08855231
    },
    {
      "name": "utility professionals",
      "weight": 0.08347479
    },
    {
      "name": "an underground utility line",
      "weight": 0.0806844
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Lifestyle"
    }
  ],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Construction & Maintenance/Other",
      "score": 0.9013671875
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Other",
      "score": 0.475830078125
    },
    {
      "name": "/Business & Industrial/Construction & Maintenance/Civil Engineering",
      "score": 0.318115234375
    }
  ],
  "sentiment": {
    "positive": 0.1583252,
    "negative": 0.3708496,
    "neutral": 0.47094727
  },
  "summary": "August 11, 2025, is designated as National 811 Day to raise awareness of the importance of calling 811 before any digging project, large or small, to ensure safety and avoid costly repairs due to damaged underground utility lines. In Pacific Gas and Electric Company's service area, in California, underground gas and electric lines have been damaged 471 times this year, 59% of these cases were not called, and 90% of those striking lines while digging did not. The average repair costs to repair a damaged utility line are $3,500. Utility professionals will be dispatched to mark the location of underground utilities lines, including gas, electric, water, telecom and sewer, free of charge.",
  "shortSummary": "National 811 Day urges people to call 811 before any large digging project to prevent costly underground utility damage, potentially saving money and safety.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "84292b72556247969a97167a16d2fe86",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "National 811 Day on August 11 emphasizes the importance of calling 811 before any digging project to prevent damage to underground utility lines and avoid costly repairs averaging $3,500. In PG&E's service area, there have been 471 incidents of damaged lines this year, with 59% occurring when 811 was not called, and this figure rises to 90% for homeowners. Calling 811 ensures that professionals mark the location of underground utilities, promoting safety and preventing expensive damages.",
  "argos_id": "03X20W3BW"
}