{
  "url": "https://finance.yahoo.com/news/ardagh-group-transaction-support-agreement-233000741.html",
  "authorsByline": "PR Newswire",
  "articleId": "67e86b8429b44e76b977d3b60d69925a",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/prnewswire.com/5d90414f7b2a4007339965311bb44f44",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T23:30:00+00:00",
  "addDate": "2025-08-08T23:50:46.217845+00:00",
  "refreshDate": "2025-08-08T23:50:46.217846+00:00",
  "score": 1.0,
  "title": "Ardagh Group Transaction Support Agreement - Accession Update",
  "description": "Ardagh Group S.A. (the \"Company\" or \"Ardagh\") is pleased to announce that, as of August 8, 2025, holders of over 90% of the senior secured notes (the \"SSNs\", and the indentures pursuant to which the SSNs are issued being the \"SSN Indentures\") issued by Ardagh Packaging Finance PLC and Ardagh Holdings USA Inc., over 90% of the senior unsecured notes issued by Ardagh Packaging Finance PLC and Ardagh Holdings USA Inc. (the \"SUNs\", and the indentures pursuant to which the SUNs are issued being the \"",
  "content": "Ardagh has obtained the support of over 90% of holders under each of the SSN Indentures and SUN Indentures and over 75% of holders under the PIK Notes Indenture\n\nLUXEMBOURG, Aug. 9, 2025 /PRNewswire/ -- Ardagh Group S.A. (the \"Company\" or \"Ardagh\") is pleased to announce that, as of August 8, 2025, holders of over 90% of the senior secured notes (the \"SSNs\", and the indentures pursuant to which the SSNs are issued being the \"SSN Indentures\") issued by Ardagh Packaging Finance PLC and Ardagh Holdings USA Inc., over 90% of the senior unsecured notes issued by Ardagh Packaging Finance PLC and Ardagh Holdings USA Inc. (the \"SUNs\", and the indentures pursuant to which the SUNs are issued being the \"SUN Indentures\") and over 75% of the senior secured toggle notes due 2027 issued by ARD Finance S.A. (the \"PIK Notes\", and the indenture pursuant to which the PIK Notes are issued being the \"PIK Notes Indenture\"), have entered into the transaction support agreement dated July 28, 2025, between, among others, the Company and certain holders of SSNs, SUNs and PIK Notes (the \"TSA\").\n\nThe Company encourages all remaining holders of the SSNs, SUNs and PIK Notes to accede to the TSA prior to the early bird deadline of August 12, 2025, in order to receive the Early Consent Consideration (as defined in the TSA), which is summarized in the appendix of this announcement. Holders of SSNs, SUNs and PIK Notes who wish to access further information relating to the Agreed Recapitalization Transaction and accede to the TSA to contact Kroll Issuer Services Limited, the exchange and tabulation agent, via email at ard@is.kroll.com .\n\nCapitalized terms used in this summary appendix shall have the meaning given to the equivalent defined term in the TSA. This appendix is only intended to provide a summary of the Early Consent Consideration construct set out in Part A (Implementation Term Sheet) of Exhibit A to the TSA for ease of reference and the TSA should be consulted for further detail. For the avoidance of doubt, this summary assumes that all relevant conditions under the TSA have been satisfied.\n\nThe Early Consent Time is currently .\n\nConsenting SSN Holders who sign up or accede to the TSA on or before the Early Consent Time will exchange their Existing SSNs at par into new Exchange SSNs.\n\n\n\n Each other Consenting SSN Holder or Non-Consenting SSN Holder will exchange their Existing SSNs at a rate of $800 in principal amount of Exchange SSNs for each $1,000 in principal amount of Existing SSNs. Each Consenting SUN Holder and Non-Consenting SUN Holder will receive their pro rata portion of 70% of the 92.5% allocation of EquityCo Shares.\n\n\n\n In addition to the allocation in the paragraph above, each Consenting SUN Holder who signs up to or accedes to the TSA on or before the Early Consent Time will additionally receive their pro rata share of 30% of the 92.5% allocation of EquityCo Shares. Each Consenting PIK Holder and Non-Consenting PIK Holder will receive their pro rata portion of 70% of the 7.5% allocation of EquityCo Shares.\n\n\n\n In addition to the allocation in the paragraph above, each Consenting PIK Holder who signs up to or accedes to the TSA on or before the Early Consent Time will additionally receive their pro rata share of 30% of the 7.5% allocation of EquityCo Shares.\n\nArdagh Group is a global supplier of infinitely recyclable metal and glass packaging for brand owners around the world. Ardagh operates 58 metal and glass production facilities in 16 countries, employing approximately 19,000 people with sales of approximately $9.1 billion in 2024.",
  "medium": "Article",
  "links": [
    "https://mma.prnewswire.com/media/946748/Ardagh_Group_Logo.html"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "TSA",
      "weight": 0.088267475
    },
    {
      "name": "Non-Consenting PIK Holder",
      "weight": 0.08644169
    },
    {
      "name": "Consenting SSN Holders",
      "weight": 0.084130235
    },
    {
      "name": "PIK Notes",
      "weight": 0.083773166
    },
    {
      "name": "Non-Consenting SSN Holder",
      "weight": 0.0814989
    },
    {
      "name": "Ardagh Group Transaction Support Agreement",
      "weight": 0.078375615
    },
    {
      "name": "Ardagh Packaging Finance PLC",
      "weight": 0.07734816
    },
    {
      "name": "Ardagh Holdings USA Inc.",
      "weight": 0.0768759
    },
    {
      "name": "Ardagh Group S.A.",
      "weight": 0.076654024
    },
    {
      "name": "Consenting SUN Holder",
      "weight": 0.07607467
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.99609375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.970703125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.91748046875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.833984375
    }
  ],
  "sentiment": {
    "positive": 0.17053223,
    "negative": 0.06921387,
    "neutral": 0.7602539
  },
  "summary": "Ardagh Group S.A. (the Company) has announced that as of August 8, 2025, over 90% of holders under each of the SSN Indentures and SUN Indenture have agreed to a transaction support agreement (the \"TSA) between Ardagh Group and certain holders of SSNs, SUNs, and PIK Notes. The company encourages all remaining holders of these notes to accede to the TSA prior to the early bird deadline of August 12, 2025 to receive the Early Consent Consideration (as defined in the TSA). The Early Consent Time is currently at $800 per year for each $1,000 in principal amount of Exchange SSNs. Each Consenting SUN Holder and Non-Consenting PIK Holder will receive their pro rata share of 30% of the 92.5% allocation of EquityCo Shares.",
  "shortSummary": "Ardagh Group secured over 90% of senior notes and PIK Notes in a transaction support agreement, urging accede to the TSA before the Early Consent Time.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "10e1610f660845338d90652a4bb4863a",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Ardagh Group S.A. has secured the support of over 90% of holders for its senior secured and unsecured notes, as well as over 75% for its senior secured toggle notes, under a transaction support agreement dated July 28, 2025. The company encourages remaining holders to join the agreement by the early bird deadline of August 12, 2025, to receive Early Consent Consideration. The agreement outlines the terms for exchanging existing notes for new ones and the allocation of EquityCo Shares.",
  "argos_id": "04XW40DWX"
}