{
  "url": "https://www.foxnews.com/media/gutfeld-reminisces-fallon-about-supportive-mothers-during-tonight-show-appearance",
  "authorsByline": "David Rutz",
  "articleId": "8adf3dff2a1b44a8afc5590a1c512803",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/gutfeld2.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T19:00:20-04:00",
  "addDate": "2025-08-08T23:10:39.866599+00:00",
  "refreshDate": "2025-08-08T23:10:39.866601+00:00",
  "score": 1.0,
  "title": "Gutfeld reminisces with Fallon about their supportive mothers during 'Tonight Show' appearance",
  "description": "Greg Gutfeld reminisced with Jimmy Fallon about their supportive mothers during his \"Tonight Show\" appearance, sharing stories about his late mother Jackie.",
  "content": "Fox News host Greg Gutfeld reminisced with Jimmy Fallon about their supportive mothers during an appearance on NBC's \"The Tonight Show\" on Thursday.\n\nThe top-rated \"Gutfeld!\" host made a late-night crossover appearance on the iconic program, where Fallon noted that Gutfeld's mother Jackie served as a \"senior correspondent\" when he hosted the Fox News show \"Red Eye.\"\n\n\"You know what her job was? Her job was to watch Fox News,\" Gutfeld said. \"She would watch Fox News and tell me what was going on during the day.\"\n\nHe added that his mother was so popular with his friends growing up that he would sometimes come to his house and see his friends already there.\n\nGREG GUTFELD SHARES HILARIOUS STORY ON HOW HE FIRST MET JIMMY FALLON DURING 'TONIGHT SHOW' APPEARANCE\n\n\"They'd be in the backyard with my mom,\" Gutfeld said.\n\n\"I had that too. My friends loved my parents,\" Fallon said.\n\n\"They dumped me for my mom. So I realized at that point that she was good. She was no BS, and she was a supporter of everything I did, which is like your mom,\" Gutfeld said, referring to Fallon's late mother Gloria.\n\nGutfeld noted his mother, who passed away in 2014, saw his success on \"Red Eye\" and then \"The Five,\" which is now cable news' top-rated show.\n\nJAY LENO CRITICIZES MODERN LATE-NIGHT COMEDY FOR ALIENATING HALF THE AUDIENCE WITH PARTISAN POLITICS\n\n\"She didn't see me for the rest of the stuff, but that's probably well and good,\" Gutfeld quipped.\n\nFallon said having a supportive mother meant a lot and was no doubt proud of her son's success. Fallon memorably paid tribute to his mother Gloria on \"The Tonight Show\" when she passed away in 2017.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nGutfeld also discussed with Fallon their chaotic first meeting, as well as his FOX Nation game show, , where contestants who've been isolated for months try to pick real from fake news.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/video/6376702695112",
    "https://nation.foxnews.com/greg-gutfelds-what-did-i-miss-nation/",
    "https://www.foxnews.com/shows/gutfeld",
    "https://www.foxnews.com/video/6376697355112",
    "https://www.foxnews.com/media/greg-gutfeld-shares-hilarious-story-how-he-first-met-jimmy-fallon-during-tonight-show-appearance",
    "https://www.foxnews.com/media/fox-news-channel-dominates-all-television-july-cnn-hits-rock-bottom-among-key-demo",
    "https://foxnews.com/media",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.youtube.com/watch?v=gjXrm2Q-te4",
    "https://www.foxnews.com/entertainment/jay-leno-criticizes-modern-late-night-comedy-alienating-half-audience-partisan-politics"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Fox News host Greg Gutfeld",
      "weight": 0.114505515
    },
    {
      "name": "Greg Gutfeld",
      "weight": 0.101335
    },
    {
      "name": "Gutfeld",
      "weight": 0.09954169
    },
    {
      "name": "Fox News",
      "weight": 0.0926287
    },
    {
      "name": "Jimmy Fallon",
      "weight": 0.090657495
    },
    {
      "name": "Fallon",
      "weight": 0.08746544
    },
    {
      "name": "Fallons late mother",
      "weight": 0.07641581
    },
    {
      "name": "Red Eye",
      "weight": 0.07415745
    },
    {
      "name": "Tonight Show",
      "weight": 0.0736406
    },
    {
      "name": "FOX NEWS APP",
      "weight": 0.07302869
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.939453125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.92431640625
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.71044921875
    },
    {
      "name": "/News/Other",
      "score": 0.70263671875
    }
  ],
  "sentiment": {
    "positive": 0.1459961,
    "negative": 0.50927734,
    "neutral": 0.34423828
  },
  "summary": "Fox News host Greg Gutfeld and comedian Jimmy Fallon reminisced about their supportive mothers during a late-night appearance on NBC's \"The Tonight Show\" on Thursday. Fallon noted that Gutfeld's mother, Jackie, served as a \"senior correspondent\" when he hosted Fox News show \"Red Eye\" and \"The Five,\" which is now the top-rated show on cable news. Fallon also expressed pride in his mother's support for his son's success. Gutfeld also discussed his FOX Nation game show, where contestants try to distinguish real from fake news.",
  "shortSummary": "Fox News host Greg Gutfeld and Jimmy Fallon discussed their supportive mothers during a late-night appearance on NBC's \"The Tonight Show.\"",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "40884a62134d4d94be6d129c1b11811a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/media/greg-gutfeld-shares-hilarious-story-how-he-first-met-jimmy-fallon-during-tonight-show-appearance",
      "text": "Fox News' Greg Gutfeld revealed how he first met fellow late-night host Jimmy Fallon during his Thursday appearance on NBC's \"The Tonight Show.\"\nAfter giving Fallon a warm embrace, Gutfeld quipped that it \"brought back memories.\"\n\"This is hilarious – we've met before,\" Fallon began.\n\"Yes, you have no memory of it,\" Gutfeld responded. \"Which is understandable, because we were wasted.\"\nFOX NEWS' GREG GUTFELD DOMINATES LATE-NIGHT TELEVISION RATINGS AS CBS ENDS COLBERT'S 'LATE SHOW'\nThe \"Gutfeld!\" host said their encounter took place at an \"illegal speakeasy\" in Hell's Kitchen roughly 15 years ago owned by their mutual friend Tracy, saying the inside looked \"like a place where special ops forces waterboard terrorists.\"\n\"You're not making this up. I totally know what you're talking about,\" Fallon interjected as his memory was coming back to him. \"I think I remember bringing beer into the bar, and then him charging me for my own beer.\"\n\"That's Tracy. He's very cheap, but if you want somebody dead, he'll do it,\" Gutfeld joked.\nGutfeld then said he and Fallon saw each other, and the latter's eyes lit up.\nFOX NEWS CHANNEL DOMINATES ALL OF TELEVISION IN JULY, CNN HITS ROCK BOTTOM AMONG KEY DEMO\n\"And you run towards me, and you tackle me, like you're a giant golden retriever,\" Gutfeld recalled. \"You're like on top of me. And so we're wrestling. We're wrestling. And then you change, and you start wrestling my buddy Andy, and you're wrestling him. And you guys get on the ground. You guys are now on the ground wrestling.\"\n\"What?!\" Fallon reacted in disbelief.\n\"Yes,\" Gutfeld told him. \"So I pull out a cigarette. I light a cigarette, and I'm smoking it, and you stop, and you come over to me, and you grab it, and you crinkle it, and you go, ‘These things will kill you!’ and you threw it. And then I go, ‘Dude, I’m not rich. You're rich.' Cigarettes are expensive in New York City. I yell, and all of a sudden, your face changed, and you looked sad, and then you left.\"\nBut, Gutfeld revealed, Fallon returned with a fresh pack just five minutes later and handed it to his future guest.\n\"I go, ‘That was really sweet. You want me to die,'\" Gutfeld said, as Fallon and the audience laughed.\nCLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE\n\"I'm sorry I tackled you,\" Fallon said later with a grin.\n\"It was all very good-natured, and it was a great memory,\" Gutfeld told the NBC host. \"And I'm so glad I finally got to tell you!\"\n\"I'm so happy,\" Fallon replied. \"That's a true story… I remember. All the details you said are correct.\"\nGutfeld and Fallon also discussed his FOX Nation game show, \"What Did I Miss?\", where contestants who've been isolated for months try to pick real news from fake news, as well as Gutfeld's winding path to his top-rated hosting gigs on \"Gutfeld!\" and \"The Five.\""
    },
    {
      "url": "https://www.foxnews.com/entertainment/jay-leno-criticizes-modern-late-night-comedy-alienating-half-audience-partisan-politics",
      "text": "Jay Leno reflected on why he always kept his jokes politically balanced while hosting \"The Tonight Show\" for over two decades.\nThe 75-year-old comedian recently sat down for an interview with David Trulio, the president and CEO of the Ronald Reagan Presidential Foundation, during which he was questioned about his approach to political humor.\n\"I read that there was an analysis done of your work on ‘The Tonight Show’ for the 22 years and that your jokes were roughly equally balanced between going after Republicans and taking aim at Democrats. Did you have a strategy?\" Trulio asked.\n\"It was fun to me when I got hate letters [like] ‘Dear Mr. Leno, you and your Republican friends’ and ‘Well, Mr. Leno, I hope you and your Democratic buddies are happy' — over the same joke,\" Leno recalled.\nJAY LENO, WIFE MAVIS RELY ON FAITH, FAMILY TO OVERCOME LIFE'S HARDSHIPS\n‘And I go, ’Well, that's good,'\" he said. \"That's how you get a whole audience.\"\nLeno went on to note how late-night comedy has changed amid the current divisive political landscape.\n\"Now you have to be content with half the audience because you have [to] give your opinion,\" Leno said.\nWhen Trulio asked if Leno had any advice for comedians today, the \"Jay Leno's Garage\" host referred to his longtime friendship with late comedy legend Rodney Dangerfield.\n\"I knew Rodney 40 years,\" he said. \"I have no idea if he was Democrat or Republican. We never discussed [it], we just discussed jokes.\"\n\"And to me, I like to think that people come to a comedy show to kind of get away from the things, you know, the pressures of life, whatever it might be,\" Leno continued. \"And I love political humor, don't get me wrong, but it's just what happens when people wind up cozying too much to one side or the other.\"\nWhile speaking with Trulio, Leno discussed how comedy could be used to create common ground.\n\"Funny is funny,\" Leno said. \"It's funny when someone who's not….when you make fun of their side and they laugh at it, you know, that's kind of what I do.\"\n\"I just find getting out — I don't think anybody wants to hear a lecture,\" he continued. \"When I was with Rodney, it was always in the economy of words — get to the joke as quickly as possible.\"\nTrulio pointed out that both Leno and Dangerfield achieved massive success during their careers, noting the two's \"approach worked in the marketplace.\"\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\n\"Well, why shoot for just half an audience all the time? You know, why not try to get the whole [audience],\" Leno replied.\n\"I mean, I like to bring people into the big picture,\" he explained. \"I don't understand why you would alienate one particular group, you know, or just don't do it at all. I'm not saying you have to throw your support or whatever, but just do what's funny.\"\nLeno's comments came prior to the uproar that ensued after CBS announced on July 17 that it was canceling \"The Late Show with Stephen Colbert\" with the show's final episode scheduled to air in May 2026.\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\nAt the time, the network clarified that the cancellation was \"purely a financial decision against a challenging backdrop in late night,\" and noted, \"It is not related in any way to the show's performance, content or other matters happening at Paramount.\"\nWeeks ahead of the cancellation, CBS and Paramount paid President Donald Trump a $16 million settlement following his lawsuit against the news network for airing an edited interview with former Vice President Kamala Harris ahead of the 2024 election.\nColbert, who frequently blasts Trump on his show, criticized the settlement and described it as a \"big fat bribe\" during an episode that aired days before the cancellation was announced.\nThe host's supporters, including several politicians, have accused CBS and Paramount of canceling \"The Late Show with Stephen Colbert\" for political reasons.\nTrump celebrated the news of the cancellation in a post on his platform Truth Social, which drew a fiery response from Colbert, who told the president \"Go f--- yourself\" during the opening monologue of his show on Monday.\nCLICK HERE TO GET THE FOX NEWS APP\nSeveral fellow late night show hosts and comedians have rallied around Colbert. \"The Tonight Show\" host Jimmy Fallon and \"Late Night\" host Seth Meyers, \"Last Week Tonight\" host John Oliver and \"The Daily Show\" host Jon Stewart attended Colbert's taping on Monday in a show of support. Stewart and Oliver previously worked alongside Colbert on \"The Daily Show.\"\nOn Friday, \"The Late Show\" creator David Letterman slammed CBS' decision to cancel the long-running show as \"pure cowardice\" and asserted that the network mistreated Colbert, who succeeded him as host in 2015.\nFox News Digital's Gabriel Hays contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/media/fox-news-channel-dominates-all-television-july-cnn-hits-rock-bottom-among-key-demo",
      "text": "Fox News Channel dominated all of television during July, outdrawing broadcast networks in critical categories, while CNN hit rock bottom among viewers sought after by advertisers.\nFox News averaged 1.5 million total day viewers to dominate all cable throughout July as No. 2 MSNBC settled for an average audience of 530,000 and CNN managed only 370,000 average total day viewers.\nDuring primetime, Fox News averaged a staggering 2.4 million viewers, to more than double the audience of runner-up MSNBC, which managed 865,000 average viewers from 8-11 p.m. ET.\nCNN averaged a dismal primetime audience of 497,000 to finish behind ESPN, HGTV and Hallmark, in addition to Fox News and MSNBC. Fox News has now topped both CNN and MSNBC during primetime for 54 straight months.\nFOX NEWS MEDIA LOSES BELOVED FIELD PRODUCER ROBERT SHAFFER AFTER LONG ILLNESS\nWhile Fox News dominated cable, it also all beat broadcast networks in primetime as NBC managed 2.1 million viewers and CBS and ABC settled for 2 million apiece.\nSince the first day of summer on June 20, Fox News has also led the broadcast networks in primetime with 2.6 million viewers, compared to ABC’s 2.3 million viewers, NBC’s 2.1 million viewers and CBS’ 2 million viewers.\nFox News also completely obliterated competition among the advertiser-coveted demographic of adults aged 25-54 during July, a critical category that has long plagued MSNBC.\nFox News averaged 184,000 total day viewers among the demo to finish atop all cable offerings, including ESPN, TBS, USA, Comedy Central, FX and Food Network.\nFOX NEWS' GREG GUTFELD DOMINATES LATE-NIGHT TELEVISION RATINGS AS CBS ENDS COLBERT'S 'LATE SHOW'\nCNN managed only 62,000 demo viewers for its lowest-rated July of all time and MSNBC achieved only 52,000 as they failed to top Fox News combined.\nFox News averaged 257,000 demo viewers during primetime, compared to only 92,000 for CNN, which had its worst month ever in that category, too. But while CNN failed to crack the top ten cable networks in the critical category and had its worst July of all time, it still managed to trounce MSNBC.\nMSNBC’s primetime lineup averaged only 81,000 demo viewers to finish with a smaller audience than a variety of cable options, including A&E, TLC, Bravo, Nick-at-Nite, Comedy Central and Adult Swim.\nJuly marked the 53rd straight month that Fox News swept cable news among both total viewers and the key demo. Fox News commanded 63% of the cable news share with viewers across total day and 64% in primetime.\n\"The Five,\" with Dana Perino, Greg Gutfeld, Jesse Watters, Jessica Tarlov and Harold Ford Jr., averaged 3.5 million total viewers and 378,000 among the demo to lead cable news in both categories.\n\"Jesse Watters Primetime,\" \"Gutfeld!,\" \"Hannity,\" \"Special Report with Bret Baier,\" \"The Ingraham Angle\" and \"The Will Cain Show\" all finished with larger audiences than anything CNN or MSNBC had to offer as Fox News swept the top seven programs.\n\"Gutfeld!\" outdrew \"The Late Show with Stephen Colbert\" despite the free advertising the CBS program generated by announcing it would cancel the program in 2026.\nThe most-watched, non-Fox News program was MSNBC’s \"The Rachel Maddow Show,\" which managed an average audience of 2 million. However, \"Maddow\" only aired three times during the entire month of July as its namesake continues to only work on Monday nights.\nKAROLINE LEAVITT STOPS BY ‘RUTHLESS’ TO TOUT TRUMP’S 'INCREDIBLE' FIRST SIX MONTHS OF SECOND TERM\n\"FOX & Friends\" finished July with 1.3 million viewers and 169,000 in the demo, remaining the No. 1 cable news program in the mornings in both categories for the 53rd consecutive month.\n\"America’s Newsroom with Bill Hemmer and Dana Perino,\" \"The Faulkner Focus,\" \"Outnumbered,\" \"America Reports with John Roberts and Sandra Smith\" and Martha MacCallum’s \"The Story\" all also had strong months to help Fox News crush the competition during the day and \"Fox News @ Night\" dominated its timeslot.\nCLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE\n\"The Big Weekend Show\" averaged 1.5 million viewers to finish as the No. 1 cable news program on Saturdays, while \"Sunday Morning Futures\" averaged 1.7 million to take the Sunday title. \"My View with Lara Trump\" was the most-watched weekend program in primetime with over 1.4 million viewers.\nFox News was also No. 1 in cable news with Asians and Hispanics and upscale viewers throughout total day viewership during July.\nRatings data courtesy of Nielsen Media Research."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    }
  ],
  "argos_summary": "During his appearance on NBC's 'The Tonight Show,' Fox News host Greg Gutfeld shared fond memories of his late mother, Jackie, who was a supportive figure in his life and career. Gutfeld reminisced about how she would watch Fox News and provide him updates, and he humorously noted that his friends often preferred her company over his. The conversation also touched on Gutfeld's first meeting with Jimmy Fallon, which involved a chaotic yet humorous encounter at a speakeasy.",
  "argos_id": "14UT7SCOP"
}