{
  "url": "https://gizmodo.com/is-marshall-feeling-generous-these-on-ear-bluetooth-headphones-are-priced-like-a-donation-2000640512",
  "authorsByline": "Zainab Falak",
  "articleId": "4eccf831b86f4ec8bc84310bc5889919",
  "source": {
    "domain": "gizmodo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://gizmodo.com/app/uploads/2025/08/marshall-v-1200x675.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T15:40:35+00:00",
  "addDate": "2025-08-08T15:47:11.733076+00:00",
  "refreshDate": "2025-08-08T15:47:11.733077+00:00",
  "score": 1.0,
  "title": "Is Marshall Feeling Generous? These On-Ear Bluetooth Headphones Are Priced Like a Donation",
  "description": "Treat yourself to the Marshall Major V Headphones for under $100.",
  "content": "If on-ear headphones are more your thing, now is a great time to upgrade your listening experience.\n\nWe just spotted the Marshall Major V going for $100 on Amazon after a 38% discount. That’s a $60 drop on a pair that brings the classic Marshall look and sound without breaking the bank, but it’s a limited-time deal. Grab it before the good folks at Amazon decide to push the price back up, or the shelves clear for good.\n\nThe overall look and feel is exactly what you’d expect from a Marshall product – rugged, but in a good way. The design is foldable, so fitting these in a tote or your backpack won’t be a problem. They fit snugly without being too tight – you won’t be left with sore ears after an hour of listening.\n\nSound-wise, Marshall sticks to the classics. The pair delivers the familiar Marshall signature sound that is clear and detailed without being too overpowering. Rihanna’s Diamonds plays with clean highs, while Jordan Peterson’s podcasts will be even easier to follow. From gamers to casual listeners, everyone will appreciate the instant sound quality upgrade it brings. Note that these don’t offer active noise cancelling, so you’ll still hear some background sounds while having them on.\n\nYou’re also getting over 100 hours of wireless playtime (you read that right) on a single charge. That’s way more than most headphones and earbuds offer in this price range. Use them for a week straight without worrying about battery life, or even take these with you on short trips without the charger. Plus, since Major V supports wireless charging, you don’t have to stick to cables at all. Snap them onto a compatible wireless charger when you’re out and about for a quick top-up.\n\nThe headphones feature a customizable M-button on the left speaker, which activates Spotify Tap by default – no need to open your phone or app to start playing music. If that’s not your thing, you can reassign it to modify your EQ settings or access voice assistant for added convenience.\n\nIn conclusion, these Marshall headphones offer a bunch of advanced features with great sound and an impressive battery life, all for just $100. While the headphones are available in four colors, only the black and the cream colors are discounted. We don’t expect them to stay in stock or on sale for long, so if you’ve been looking to invest in a solid pair of headphones, this might be it.",
  "medium": "Article",
  "links": [
    "https://shop.gizmodo.com/go/2327/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "great sound",
      "weight": 0.08949592
    },
    {
      "name": "most headphones",
      "weight": 0.082409754
    },
    {
      "name": "sound",
      "weight": 0.079500206
    },
    {
      "name": "headphones",
      "weight": 0.07890594
    },
    {
      "name": "Marshall",
      "weight": 0.078506045
    },
    {
      "name": "wireless playtime",
      "weight": 0.071163386
    },
    {
      "name": "wireless charging",
      "weight": 0.06990053
    },
    {
      "name": "battery life",
      "weight": 0.06434318
    },
    {
      "name": "the familiar Marshall signature sound",
      "weight": 0.06284434
    },
    {
      "name": "sore ears",
      "weight": 0.06263069
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.9404296875
    },
    {
      "name": "/Shopping/Consumer Resources/Coupons & Discount Offers",
      "score": 0.3671875
    }
  ],
  "sentiment": {
    "positive": 0.31640625,
    "negative": 0.117614746,
    "neutral": 0.56591797
  },
  "summary": "The Marshall Major V Bluetooth headphones are being sold for $100 on Amazon for a 38% discount, marking a significant $60 drop. The headphones offer a classic Marshall look and sound without breaking the bank. They are foldable and offer over 100 hours of wireless playtime on a single charge, more than many other headphones and earbuds in this price range. Despite not offering active noise cancelling, these headphones still hear background sounds while listening. They also feature a customizable M-button on the left speaker, which activates Spotify Tap by default. While the headphones are available in four colors, only the black and the cream colors are discounted.",
  "shortSummary": "Marshall's Marshall Major V Bluetooth Headphones are selling for $100 on Amazon, offering excellent sound, foldable, and wireless charging, with excellent sound and extensive battery life without charging.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "eb430aba131b4fedac3daa7d14e6e5d6",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The Marshall Major V on-ear headphones are currently available for $100 on Amazon, reflecting a 38% discount. They feature a rugged, foldable design, deliver the signature Marshall sound, and offer over 100 hours of wireless playtime on a single charge. With customizable features and a sleek look, these headphones are a great option for anyone seeking quality audio at an affordable price, but the deal is time-sensitive.",
  "argos_id": "1NB0BRU8Q"
}