{
  "url": "https://www.yahoo.com/news/articles/oregon-ethics-commission-pursues-legislative-201730731.html",
  "authorsByline": "Shaanth Nanguneri",
  "articleId": "36c39df99a394150824ff76f4af36196",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/75fffdb141edf9bd2b2288369360361363ca875753af1a458c1eddefe7de39f3/ynews/resizefill_w1200/https://media.zenfs.com/en/oregon_capital_chronicle_articles_871/892bea2f2cb458708cc4a751c026e0e9",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T20:17:30+00:00",
  "addDate": "2025-08-08T20:25:54.035101+00:00",
  "refreshDate": "2025-08-08T20:25:54.035104+00:00",
  "score": 1.0,
  "title": "Oregon ethics commission pursues legislative action, further revision on meetings policy",
  "description": "Leaders of Oregon’s Government Ethics Commission agreed Friday that there isn’t enough clarity surrounding their recently-acquired power to ensure public officials only make governing decisions in front of their constituents, leaving the door open for future legislative action or additional guidance from the commission. During a discussion on communications and public records law, members of […]",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nMembers of the Philomath City Council vote to refer a two-year moratorium to voters. The Oregon Government Ethics Commission agreed Friday that councils like these deserve more clarity from state officials on the use of communications and public meetings law.(Mike McInally/Oregon Capital Chronicle)\n\nLeaders of Oregon’s Government Ethics Commission agreed Friday that there isn’t enough clarity surrounding their recently-acquired power to ensure public officials only make governing decisions in front of their constituents, leaving the door open for future legislative action or additional guidance from the commission.\n\nDuring a discussion on communications and public records law, members of the statewide ethics board raised questions about the implementation of House Bill 2805, a 2023 law passed by the Oregon Legislature which gave the nine-member commission the power to investigate and train public officials across the state to comply with public meetings law. The commission is investigating the Salem City Council for such violations in a novel case, an issue that Commission Chair David Fiskum said could come to the board in its September meeting.\n\nThe 2023 legislation aimed to crack down on what the law calls “serial communications,” in which a majority of members of a governing body discuss issues relevant to their work and make decisions outside of the public eye in text messages, emails or private meetings. It’s long been illegal for a majority to meet and make decisions outside of public meetings.\n\nIllegal serial communications could include one council member working to coordinate and deliver messages to a majority of the governing board before a meeting.\n\nThe law, however, does not aim to crack down on public staff aiming to collect background information or data or officials speaking with the media or engaged citizens. Fiskum told members of the body on Friday that lawmakers may act to further clarify the law in the 2027 legislative session, when they’ll have more time than 2026’s 35-day short session.\n\n“That reality will carry implications for our administration of this law, as well as for public policy in general,” he said. “Internally, that inability to change things until 2027 means that all of us will have to live with sometimes longer agendas.”\n\nThe law sparked debate and confusion statewide about the appropriate bounds of conduct when it comes to public meetings. The ethics commission advised members of the Salem City Council in late July that they are allowed to attend neighborhood association meetings and speak with the media after an initial state ethics investigation found that its mayor and city councilors held an illegal serial meeting prior to the resignation of a city manager.\n\nIn another case, Patricia Mulvihill, executive director of the Salem-based League of Oregon Cities, wrote to the ethics commission in May, saying the agency had a “gross misinterpretation” of the law’s enforcement via trainings delivered to Portland city councilors since November 2024, as reported by the Oregon Journalism Project. In one training, according to the letter, officials were told a mayor’s comments to a local newspaper about city business could raise a potential violation.\n\nThe acrimony has already caught the attention of one Salem lawmaker, who warned of an unintended chilling effect on effective collaboration among elected officials. Rep. Kevin Mannix, R-Salem, requested the commission pause enforcement of the law until May 2026 for further legislative clarity in a July 23 letter.\n\n“In conversations with colleagues at both the state and local levels, it has become apparent that the fear of inadvertently violating public meetings requirements is discouraging legitimate, informal discussions among elected officials,” Mannix wrote to the commission. “This is particularly problematic when officials are trying to gather information, understand complex issues, or develop thoughtful policy proposals before bringing them forward for formal public consideration.”\n\nThe commission rejected Mannix’s request on the grounds that state law requires them to move forward with enforcement. But commissioners on Friday parsed through a Frequently Asked Questions document, aiming to assuage some of those fears.\n\nThat document details how violations of state open meetings law require that a quorum of elected officials be in communication and that those communications include discussing decisions they’ll make. For instance, four of seven city councilors calling each other to talk about lowering parking fees would constitute a violation, but those four city councilors texting each other about a sports team would not.\n\n“I want to stress, because everyone has been saying, ‘You guys need to rescind this,’ It’s not a matter of rescinding it.” she said. “There may be fine-tuning that we do to examples or adding or deleting questions as time goes on and as the commission has more opportunity to consider the specific issues.”\n\nThe FAQ notes that meeting with a neighborhood association or discussing business that is outside of the governing body’s work is not a violation, but not all commissioners were convinced the guidance was clear enough. One key question was the extent to which members of a communication chain would all be impacted. For instance, should the original sender be implicated for sending a message that spiraled into backroom negotiations they weren’t a part of?\n\n“Somebody else may share your communication and down the line it may become a quorum, and ergo, you may be violating public meetings laws,” said Commissioner Shenoa Payne. “To me, I mean as a lawyer, it seems like a tough pill to swallow.”\n\nMyers said she’s been talking with key stakeholders about the issue, including a leader of the effort to pass the 2023 law, Rep. Nathan Sosa, D-Hillsboro. She said legislative action could be forthcoming as soon as the 2026 legislative session, but that she would prefer receiving advice from the Oregon Law Commission as well, a nonpartisan law reform body that was established in 1997 with the goal of identifying gaps in existing law.\n\nSUBSCRIBE: GET THE MORNING HEADLINES DELIVERED TO YOUR INBOX",
  "medium": "Article",
  "links": [
    "https://www.salemreporter.com/2025/06/13/ethics-commission-votes-to-investigate-salem-mayor-councilors-over-possibly-unethical-communications/",
    "https://law-olc.uoregon.edu/",
    "https://www.salemreporter.com/2025/07/30/city-councilors-told-they-can-resume-attending-neighborhood-association-meetings/",
    "https://www.wweek.com/news/city/2025/05/08/league-of-oregon-cities-says-ethics-commission-has-distorted-public-meetings-law/",
    "https://www.oregon.gov/ogec/about-us/Documents/Commission%20Meetings/Meeting%20Book%20Materials/2025/2025.08.08-Public-Session-Meeting-Materials-Updated.pdf",
    "https://olis.oregonlegislature.gov/liz/2023R1/Measures/Overview/HB2805",
    "https://oregoncapitalchronicle.com/subscribe"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "public meetings law",
      "weight": 0.10324958
    },
    {
      "name": "public meetings laws",
      "weight": 0.10324958
    },
    {
      "name": "state open meetings law",
      "weight": 0.09155638
    },
    {
      "name": "public meetings",
      "weight": 0.087678
    },
    {
      "name": "state law",
      "weight": 0.08433781
    },
    {
      "name": "public officials",
      "weight": 0.083260424
    },
    {
      "name": "public meetings requirements",
      "weight": 0.082972854
    },
    {
      "name": "Oregon ethics commission",
      "weight": 0.07576558
    },
    {
      "name": "existing law",
      "weight": 0.073057234
    },
    {
      "name": "state officials",
      "weight": 0.07131951
    }
  ],
  "topics": [
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9990234375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.9873046875
    },
    {
      "name": "/News/Local News",
      "score": 0.89990234375
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.888671875
    },
    {
      "name": "/News/Other",
      "score": 0.368896484375
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.348876953125
    }
  ],
  "sentiment": {
    "positive": 0.05496216,
    "negative": 0.6376953,
    "neutral": 0.3076172
  },
  "summary": "The Oregon Government Ethics Commission is seeking legislative action and further revision on the use of the state's communications and public meetings law, following concerns about implementation of the 2023 law passed by the Oregon Legislature that allows the commission to investigate and train public officials across the state to comply with public meetings laws. The law, which aims to crack down on \"serial communications,\" where a majority of members of a governing body discuss issues relevant to their work and make decisions outside of public meetings. The commission is investigating the Salem City Council for such violations, which could come before the board's meeting in September. However, the law does not aim to stop public staff from collecting background information or data or officials speaking with the media or engaged citizens. The ethics commission has advised members of the Salem city Council that they are allowed to attend neighborhood association meetings and speak with media after an initial state ethics investigation found that its mayor and city councilors held an illegal serial meeting prior to the resignation of a city manager.",
  "shortSummary": "The Oregon ethics commission is considering legislative action and training to clarify public meetings law amid concerns over potential violations and potential conflicts of interest.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9e0f5379a5504e058ed2a4482711f8de",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.salemreporter.com/2025/06/13/ethics-commission-votes-to-investigate-salem-mayor-councilors-over-possibly-unethical-communications/",
      "text": "Ethics commission votes to investigate Salem mayor, councilors over possibly unethical communications\nThe Oregon Government Ethics Commission voted Friday to investigate Salem Mayor Julie Hoy and all seven Salem city councilors to determine if they participated in an illegal serial meeting leading up to former Salem City Manager Keith Stahley’s abrupt resignation in February.\nThe commission voted 5-2 with one commissioner not voting due to a conflict of interest, to initiate a full investigation into a possible prohibited serial meeting between the mayor and city councilors. The commission agreed that there was a “substantial objective basis” that Hoy and her colleagues violated state ethics rules and that an investigation is warranted.\nThe councilors subject to investigation are Irvin Brown, Linda Nishioka, Shane Matthews, Deanna Gwyn, Vanessa Nordyke, Micki Varney, and Paul Tigan.\nThe investigation was triggered by a complaint filed in March by a Salem resident.\nExecutive Director Susan Myers explained that a prohibited serial communication is when a quorum of a government body, in this case the Salem City Council, communicates to deliberate or decide on a matter that is within the governing body’s jurisdiction.\nIn this case, members of the commission argued, the subject of the city manager was within the council’s jurisdiction.\nCommissioners on Friday considered whether the possible serial meeting was a technical violation of ethics rules that wasn’t at a level to warrant investigation or if it was a more serious offense given that the possible serial communication resulted in Stahley’s departure.\nStahley submitted his letter of resignation in February after he was told by Council President Linda Nishioka that the mayor and a majority of the council supported his ouster.\nDuring a non-public executive session, Hoy and her attorney, Jill Gibson, argued that Hoy didn’t have the necessary knowledge and training before she called her colleagues to discuss an unfavorable performance review of the former city manager. Gibson argued that the mayor first consulted with City Attorney Dan Atchison before reaching out to her colleagues.\nGibson said Hoy received written instructions from Atchison encouraging her to make the phone calls to relay factual information and to discuss the audit.\nHoy told the commission the possibility of a serial meeting can be attributed to her inexperience as a public official. She said if she had known she was committing an ethics violation, she would not have spoken to her colleagues.\n“I am truly a volunteer and not a politician. I do not have years of experience in this role and I am here to learn,” Hoy told the commission. “People like me who do not do this type of work all the time need the education and information that you can provide for us.”\nThe commission will now proceed with a full investigation into the matter. If it is determined that Hoy and her colleagues engaged in a serial meeting, each will be issued a letter of education, creating a record the commission can point to in the event that a similar incident should occur in the future, Myers said during the executive session.\nThis is a developing story.\nRELATED COVERAGE:\nRecords reveal Nishioka wanted to sue Hoy after Stahley resigned\nContact reporter Joe Siess: [email protected] or 503-335-7790.\nA MOMENT MORE, PLEASE – If you found this story useful, consider subscribing to Salem Reporter if you don’t already. Work such as this, done by local professionals, depends on community support from subscribers. Please take a moment and sign up now – easy and secure: SUBSCRIBE.\nJoe Siess is a reporter for Salem Reporter. Joe joined Salem Reporter in 2024 and primarily covers city and county government but loves surprises. Joe previously reported for the Redmond Spokesman, the Bulletin in Bend, Klamath Falls Herald and News and the Malheur Enterprise. He was born in Independence, MO, where the Oregon Trail officially starts, and grew up in the Kansas City area."
    },
    {
      "url": "https://www.wweek.com/news/city/2025/05/08/league-of-oregon-cities-says-ethics-commission-has-distorted-public-meetings-law/",
      "text": "In an April 9 letter to the Oregon Government Ethics Commission, the League of Oregon Cities lambasted the body’s interpretation of a new public meetings law that tightens restrictions on how local elected officials may communicate.\n“The advice being given by the Commission’s staff is a profound and disturbing misreading of ORS 192.700,” wrote Patty Mulvihill, executive director of the LOC, in a letter addressed to ethics commission chair David Fiskum. “It is also patently unrealistic in its application and so far outside the bounds of what any member of the Legislature would have intended upon the enactment of the statute.”\nAt issue is a new state law that prohibits local elected officials from using “serial communications” to essentially operate as a quorum outside of the public eye. The League says that the commission’s interpretation has caused ripples of confusion and alarm across Oregon cities that are subject to the new restrictions.\nThe Legislature passed House Bill 2805 in June 2023. Gov. Tina Kotek signed it into law in July 2023, and the ethics commission finalized the rules in October 2024.\nThe bill did two things.\nFirst, it barred “serial communications” that formed a quorum—that is, a majority of a governing body—outside of public view. An easy way to think of a serial communication is like a game of telephone: If one city councilor talks to another about a policy and where they stand on it, and that councilor runs into a colleague in the hallway and describes what they just talked to the first councilor about, that would be a serial communication that effectively formed a quorum. (For a Portland City Council policy committee with five members, three people is a quorum.)\nSecondly, HB 2805 required the ethics commission to provide annual training sessions to all local elected officials across the state on Oregon‘s public meetings laws, including the new serial communications law. The law allows third parties to conduct the training sessions so long as their materials are approved by the ethics commission.\nThe law went into effect in late 2023, but the ethics commission took until October 2024 to finalize rulemaking, and training sessions began in November for hundreds of freshly elected officials, including the 12 members of the new Portland City Council.\nBut the League of Oregon Cities now says the ethics commission‘s interpretation of the serial meetings law is a “gross misinterpretation” and is causing ripples of confusion and frustration all across Oregon’s cities.\nMulvihill wrote in her letter that the commission’s interpretation has led to “grave concerns” among elected city officials across the state.\n“As Commission staff have begun training public officials themselves on Oregon’s Public Meetings Law, city officials from across the state began calling the LOC with grave concerns over the content of the training,” Mulvihill wrote. “For example, Commission staff have asserted in trainings that a mayor’s quote in a newspaper about city business could result in a serial meeting violation, that a councilor’s conversation with a city manager about city business could result in a serial meeting violation, and that an elected official’s conversation with a constituent about one of their concerns could result in a serial meeting violation.”\nMulvihill also wrote that the LOC would “consider all other avenues of legal recourse available to it in its effort to ensure the statutes enacted by the Legislature are being reasonably interpreted and enforced” and said she‘s asking all of its city members to no longer send their elected officials to ethics commission training sessions until a “formal opinion from the Commission can be obtained.”\nEthics commission executive director Susan Myers says the commission is “scheduling a meeting with representatives of the League of Oregon Cities to discuss the concerns raised in their letter.”\nBefore passing HB 4805 in 2023, members of Legislature raised questions about the potential complications stemming from a serial meetings law.\nTwo lobbyists provided information about the bill at the time, one from the League of Oregon Cities and another representing the Society of Professional Journalists. They explained to the Joint Committee on Ways and Means Subcommittee on General Government in a May 25, 2023, meeting what would be prohibited by the law.\n“Say two of you are at lunch and talk about something, and then one of you goes and talks to a couple more people on this committee, and then soon effectively you’ve got a quorum,” explained SPJ lobbyist Tom Holt, adding that email threads also counted as serial communications.\nSeveral state lawmakers raised concerns about the proposed serial meetings law, even though it would exempt the Legislature.\n“How do you enforce that?” asked Rep. Greg Smith (R-Heppner). “If we‘re at lunch, and he and I talk, it’s outside of my control whether he talks to someone else.”\nSmith later added that such rules would paralyze legislative business because “the basic tenet of being in this building is vote counting and building coalitions.”\nRep. Gomberg (D-Otis) laid out a hypothetical scenario: “Tell me how you think we might appropriately communicate with each other on this committee, for example, with a vote coming up. We bump into each other in the elevator or hallway or lunch room, and I talk to Rep. Smith, and the next day Rep. Smith talks to Rep. Chaichi and Rep. Reschke bumps into the two of us, and suddenly we‘ve got a quorum problem. What’s the right way to do that?”\nHolt replied: “Of course, in a legislative context that kind of thing happens all the time. But in the context of a local government elected body, you have to be careful about avoiding those kinds of situations.”\nJust one problem: The new Portland City Council functions as a legislative body, similar to a state legislature. It has five-member policy committees that hear and discuss legislation and refer policies to a vote of the full council.\nSeveral Portland city councilors have told WW that the new state laws around serial meetings have made it much dicier, and legally murkier, to talk about potential legislation with their colleagues outside of public meetings.\nThe matter has come up during a handful of subcommittee meetings of the City Council, and other times in full council sessions.\nCouncilor Steve Novick tells WW that the ethics commission‘s rules have made it exceptionally difficult for him to communicate with his fellow councilors, especially those with which he serves on subcommittees.\n“The purpose of the public meetings law is to prohibit backroom deals and have the votes counted in advance. That’s dramatically different from being able to explain to each other in advance, here‘s what the proposal is so they can start thinking about it,” Novick says.“The result has been that you have public meetings where councilors seem completely confused, and the public is wondering, why haven’t you worked this out in advance?”\nThe answer, Novick says, is because that’s sometimes “the first time we‘re hearing of it because we can’t discuss it outside of the context of a public meeting.”\nThe council’s Governance Committee discussed the new rules at an April 21 meeting, and the murkiness of what, exactly, a violation would look like.\nCouncilor Candace Avalos, who does not sit on the committee but was present to offer testimony, said the council was “really struggling to navigate how we can meet and when” and that there was a certain level of fear and “precarity” around the new rules.\nEveryone seemed confused about what could constitute a violation, both in real time and retroactively. One scenario that came up: If three of five committee members talked about something that was simply within the scope of their work within the committee, and then something they discussed came in front of the committee two months later as an agenda item, would that be a violation?\nCity Attorney Robert Taylor told them that yes, that could be an issue. “That’s something they should avoid doing,” Taylor said.\nAnother scenario presented by Councilor Jamie Dunphy: Three members of the governance committee participate in a public forum where governance is discussed, and something that’s touched on comes in front of the council months down the road as a policy.\n“That would be a problem,” Taylor said.\nDunphy replied: “I worry that this limits our ability to communicate with the public, too.”\nCity Council President Elana Pirtle-Guiney tells WW that the law and subsequent rules “have created a lot of uncertainty, and that makes it difficult for councilors to know what conversations they’re allowed to have and who they can talk with. This has all made it harder for us to do our work.”\nTaylor, the city’s attorney, echoed that, saying the “new law and rule changes have created uncertainty, and the city is doing its best to navigate those uncertainties.”\nCity spokesman Cody Bowman says the city has been in communication with the League of Oregon Cities to address the problems."
    },
    {
      "url": "https://www.salemreporter.com/2025/07/30/city-councilors-told-they-can-resume-attending-neighborhood-association-meetings/",
      "text": "City councilors told they can resume attending neighborhood association meetings\nSalem city councilors will resume going to neighborhood association meetings but expressed both gratitude and concern Monday night after new guidelines on state public meetings law were released by the Oregon Government Ethics Commission last Friday.\nThe highly anticipated guidelines came after councilors were left confused by a new state law concerning illegal serial communications after attending a commission training earlier this year that gave them the impression speaking with the press, or with their constituents at neighborhood association meetings or other events was risky business.\nThat interpretation of the law led councilors to temporarily pause going to neighborhood association meetings until matters were clarified.\nCouncilors now plan to continue engaging with constituents at meetings starting in August.\nCouncilors expressed that while they appreciate the clarity, there is still some ambiguity in the new guidelines, and said they were left fatigued by the whiplash from contradictory advice from the commission.\n“I am seriously frustrated with the fact that they did a 180. They did a 180 on us,” Councilor Irvin Brown said on Monday night. “That 180 that they did on us, it put us in a place of paralysis, and that is unfair to us as elected officials.”\nOn Monday, councilors discussed the newly released guidelines which Salem City Attorney Dan Atchison said was consistent with guidance provided to councilors by the city for years, and with guidance provided by statewide organizations like the League of Oregon Cities.\nThe guidelines also clarify that councilors can speak to the press about city business and respond to constituent emails or concerns about matters that are due to come before the council.\nWhile reassuring, Atchison said the new guidance is a departure from what the commission had been telling councilors about the new law. He also said more clarity will be necessary.\n“This is a good start…I think there needs to be further clarification on what you can and can’t do. Can you meet with other members of council and discuss items that are on the agenda? I think it is relatively clear from this FAQ that you can,” Atchison said. “But that’s really inconsistent with what they’ve said in a number of forums to each of you at different points in the past. So, I’d like further clarity from (the commission) on that.”\nAtchison said the commission is clear that councilors can attend neighborhood associations as long as a quorum does not meet together at the event. That would mean five or more city councilors.\nHe said the rules make it so that councilors can attend and express their opinions on city matters. He said the new guidelines are not as cautious as previous commission guidance concerning intermediaries.\n“When you are speaking to neighborhood associations or any member of the public for that matter, don’t ask them or direct them to say, ‘Hey go find out what this other councilor thinks about this issue, or don’t convey my opinion to that other councilor,’” Atchison said. “Basically they say members of governing bodies may meet and discuss pending governing body business with both the media and third parties such as neighborhood associations and residents.”\nSome of the caution exercised by city councilors stems from the fact that Mayor Julie Hoy and the entire city council are currently under investigation by the commission after investigators determined the body likely engaged in an illegal serial communication leading up to the abrupt resignation of former City Manager Keith Stahley in February.\nCouncilor Mai Vang, who was sworn in after Stahley’s resignation, is the only city councilor not implicated in the commission’s probe.\nAtchison said the commission’s interpretation of what constitutes deliberations is broad.\n“Based on this definition, most communications between council members concerning the substance of a matter will constitute deliberation. So, you are sharing information about what the issue is. That is information gathering,” Atchison said. “That is part of the deliberative process. You are providing your opinion about what you think about the issue. That is information that people are going to weigh in making the decision, that is part of the deliberative process.”\nAtchison said the guidelines appear to allow less than a quorum of the council to communicate and even deliberate on a matter of city business, but if that communication expands to a quorum, then things get complicated.\n“That can happen without your consent, without your knowledge even…there is still a good likelihood that a serial meeting violation would occur,” Atchison said. “So, you can do it. You can meet in less than a quorum to have these discussions, but you have to be careful about those communications getting shared with other members of the council.”\nCouncil President Linda Nishioka said she met with Susan Myers, the commission’s executive director, to express her concerns prior to the new guidelines being released. She said the clarification means she can confidently return to her constituents at neighborhood associations. She expressed her sense of how the council had been feeling about the new rules.\n“It’s almost like I can’t even say ‘Hi’ to my fellow councilors because of fear that this is going to be communication that might be derived as something outside of what we should be doing,” Nishioka said. “So, I am looking forward to more clarifications.”\nCouncilors Micki Varney and Mai Vang said despite the clarification there is still a cloud of uncertainty and some ambiguity that remains.\nCouncilor Paul Tigan reminded his colleagues that the public meeting rules, which were issued by state legislators, only applies to governing bodies on the local level and not to state-level public officials. He too was concerned by the 180 from the commission.\n“This isn’t just an evolving document, this document counters things that we’ve heard from OGEC in the last few months,” Tigan said. “I received direct advice that if I was to communicate with a member of the press ahead of one of our meetings it could be sort of headed down this slippery slope towards using a member of the press as an intermediary and thus creating a quorum and violating public meetings law. Just by talking with a news reporter.”\nRELATED COVERAGE:\nSalem councilors staying mum in instances, fearing ethics trouble\nState investigator concludes Salem council discussed manager’s ouster out of public view\nContact reporter Joe Siess: [email protected] or 503-335-7790.\nA MOMENT MORE, PLEASE – If you found this story useful, consider subscribing to Salem Reporter if you don’t already. Work such as this, done by local professionals, depends on community support from subscribers. Please take a moment and sign up now – easy and secure: SUBSCRIBE.\nJoe Siess is a reporter for Salem Reporter. Joe joined Salem Reporter in 2024 and primarily covers city and county government but loves surprises. Joe previously reported for the Redmond Spokesman, the Bulletin in Bend, Klamath Falls Herald and News and the Malheur Enterprise. He was born in Independence, MO, where the Oregon Trail officially starts, and grew up in the Kansas City area."
    }
  ],
  "argos_summary": "The Oregon Government Ethics Commission is addressing confusion surrounding a new law aimed at preventing 'serial communications' among local elected officials, which can lead to decision-making outside public meetings. The law, enacted in 2023, has sparked debates and concerns among city councilors about its implications for their ability to communicate effectively. The commission is currently investigating the Salem City Council for potential violations related to these communications, while also working to clarify guidelines for public officials to ensure compliance with the law.",
  "argos_id": "1VPFS8SOX"
}