{
  "url": "https://www.yahoo.com/news/articles/50th-summerfest-continues-bring-world-164506922.html",
  "authorsByline": "Ivy Farguheson",
  "articleId": "8765846dcfc74d1cb41794d122551d60",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/fe51ce8d1228a6d861656a8729887c39d60d81b9e6702fb2243bad6de7751b80/ynews/resizefill_w1200/https://media.zenfs.com/en/deseret_news_992/6e5fc358cdc03504c6d9f2705b04fa76",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T16:45:06+00:00",
  "addDate": "2025-08-08T17:32:24.048842+00:00",
  "refreshDate": "2025-08-08T17:32:24.048843+00:00",
  "score": 1.0,
  "title": "50th Summerfest continues to bring the world to Bountiful",
  "description": "The Bountiful Davis Art Center is hosting its 50th Summerfest arts celebration Friday and Saturday, with dances, visual art creations and various crafts from folks from Mexico, Peru, China, India, the Pacific Island region and more.",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nThe world is coming to south Davis County this weekend.\n\nThe Bountiful Davis Art Center is hosting its 50th Summerfest arts celebration, a time for visitors to witness the dances, visual art creations and various crafts from folks from Mexico, Peru, China, India, the Pacific Island region and more.\n\nIt is also an opportunity for Utah’s diverse population to create art.\n\n“People forget that we’re all creative. That’s what makes us human,” said Sarina Ehrgott, executive director of the Bountiful Davis Art Center. “And there is enough culture here in the state of Utah that want to bring attention to that.”\n• None When: Friday and Saturday, Aug. 8 and 9, 10 a.m. to 8 p.m.\n• None Cost: Entrance is free. Cost varies for food from Food League trucks and participation in some workshops.\n\nThe art center opened 51 years ago, and shortly thereafter, officials organized Summerfest as a way to learn, celebrate and share the art of different cultures. Folk groups have sung and danced. Hindi dance groups have wowed with their movements. Mexican visual artists have taught families how to create piñatas.\n\nThis weekend, guests will see similar activities and performances, but in a different locale than in recent years. Bountiful City Park will host the 2025 Summerfest, the first time since before the COVID-19 pandemic.\n\nOn average — at any point during a Summerfest weekend — 150 people could be seen watching performances, taking their children to the Art Yard, an area to create, or maybe eating food from different cultures due to the Food Truck League’s participation in the event.\n\nThis year, Ehrgott anticipates 200 people will participate in a Summerfest program at any point in time, but in truth, the art center’s focus is on getting more people connected to art and to different cultures, not on counting how many people are coming in and out of the event.\n\nThe event is free to allow everyone the opportunity to come and participate in the art celebration, Ehrgott said. Anyone can sit and watch a dance performance, and children are free to run around the Art Yard.\n\nAs Ehrgott, who is the only full-time employee at the center, says art is a human right, and as such it should be accessible to everyone.\n\nArt is also a perfect entryway into learning about different cultures, she said. Art can be what allows someone in Bountiful, who does not have a connection with anyone from a different culture, to ease their way into learning about a new heritage or background.\n\nIn other words, everyone — every culture — creates art, as Larry Fitzpatrick, a tech expert, wrote in BBN Times when highlighting tech culture and art.\n\nYou do not need to get on a plane to gain access to the human right of artistic expression, as Ehrgott said. This weekend, you can gain access to art right here in Bountiful.\n\n“We want people to know that you can be involved in art in many ways,” Ehrgitt said. “It’s about having a moment to yourself. It’s about the process.”\n\nTo see a schedule of Summerfest events and activities, visit www.bdac.org/summerfest.",
  "medium": "Article",
  "links": [
    "https://www.bdac.org/summerfest/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "visual art creations",
      "weight": 0.09360779
    },
    {
      "name": "different cultures",
      "weight": 0.09348623
    },
    {
      "name": "Art",
      "weight": 0.093254395
    },
    {
      "name": "art",
      "weight": 0.093254395
    },
    {
      "name": "Summerfest events",
      "weight": 0.079111114
    },
    {
      "name": "tech culture",
      "weight": 0.077739984
    },
    {
      "name": "50th Summerfest",
      "weight": 0.0746935
    },
    {
      "name": "enough culture",
      "weight": 0.073370144
    },
    {
      "name": "Summerfest",
      "weight": 0.07026144
    },
    {
      "name": "more people",
      "weight": 0.06761526
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Events & Listings/Other",
      "score": 0.939453125
    },
    {
      "name": "/News/Local News",
      "score": 0.7939453125
    },
    {
      "name": "/Reference/Geographic Reference/Other",
      "score": 0.78759765625
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Other",
      "score": 0.7666015625
    },
    {
      "name": "/Travel & Transportation/Travel Guides & Travelogues",
      "score": 0.54248046875
    },
    {
      "name": "/Hobbies & Leisure/Special Occasions/Holidays & Seasonal Events",
      "score": 0.52685546875
    }
  ],
  "sentiment": {
    "positive": 0.2927246,
    "negative": 0.22460938,
    "neutral": 0.48266602
  },
  "summary": "The Bountiful Davis Art Center is hosting its 50th Summerfest arts celebration in south Davis County, Utah, attracting visitors from around the world. The event, which opened 51 years ago, features performances from Mexico, Peru, China, India, the Pacific Island region, and is also an opportunity for Utah’s diverse population to create art. The art center's focus is on connecting more people to art and learning about different cultures, not counting how many people attend the event. The 2025 Summerfest will be held at Bountful City Park for the first time since before the COVID-19 pandemic. The cost of food from Food League trucks and participation in some workshops varies.",
  "shortSummary": "The 50th Summerfest in Bountiful, Utah, showcases diverse artworks, encouraging participation and learning about different cultures, using AI to generate takeaways.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "1d347a7101484c95938e374447b15d8b",
  "places": [
    {
      "osmId": "36806531",
      "town": "Bountiful",
      "county": "Davis County",
      "state": "Utah",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.8956919,
        "lon": -111.88408920635344
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.bdac.org/summerfest/",
      "text": "The Bountiful Davis Art Center Summerfest is an annual cultural arts festival that brings together artisans, performers, and audiences in a vibrant celebration of global traditions. Summerfest is a cornerstone event that highlights the universal language of art and its ability to connect people across cultures. FREE | Open to everyone.\n2025 Summerfest August 8 & 9, 10am–8pm at Bountiful City Park.\nVOLUNTEER DURING SUMMERFEST!\nWhether you're an individual, a family, or part of a service group, there’s a place for you at Summerfest. Help out in the Art Yard, support performers, or assist with workshops and activities—we’d love to have you on the team!\nPERFORMANCES\nFRIDAY AUGUST 8\nOaxaca en Utah\nLove Juliet\nWasatch Alphorns\nWasatch Alphorns Interactive Demonstration\nCallanish\nLittle Cottonwood\nDANZARTE\nKargi Kala Kendra\nRaices d’sudamerica\nSAUTRDAY AUGUST 9\nWXHS Pacific Island Club\nMariachi Fuego 🔥\nHalau Ku Pono I Kamalani\nHakan UT Ecuador\nUtah Flamenco Gipsy Fire\nEchoing Spirit Dancers\nEsencia de Mexico\nKenshin Taiko\nJung Hing Lion Dance Club\nWORKSHOPS\nSIGN UP INFO BELOW\nLearn from master artists as they share traditional techniques rooted in their cultural heritage. Each hands-on workshop is led by a practicing cultural artist and includes historical context to deepen understanding of the art form’s origins and significance.\nART YARD\nA hands-on creative zone for all ages! From cyanotype sun prints to bubble art and collaborative murals, the Art Yard invites kids and families to explore, play, and create together. Discover art inspired by cultures around the world—fun, free, and open to all!\nHeritage Arts Workshops\nAccessible to everyone 14+, from beginners to those with some experience\nStarts Aug 9\n60 US dollarsLoading availability...\nLoading availability...\nArt Yard At Summerfest\nA Creative Space for All Ages\nThe Art Yard is a welcoming, hands-on creative area where children, teens, and families can participate in fun, interactive art activities during Summerfest. With adult supervision, participants are invited to explore different artistic techniques and express themselves freely through a variety of workshops, stations, and collaborative projects.\nCyanotype Workshop\nWith Artist Sara Serratos\nLed by photographer, educator, and interdisciplinary artist Sara Serratos, this workshop introduces participants of all ages to the magic of cyanotype printing, a photographic technique known for its striking blue tones. During the session, you'll learn how to coat paper with UV-sensitive chemicals, arrange natural or translucent objects on the surface (like leaves, flowers, or lace), and expose your design to sunlight. After rinsing and drying, you'll be left with a beautiful one-of-a-kind blueprint! Sara will guide participants through the process in both Spanish and English. Materials will be provided, but you’re welcome to bring your own objects to print.\nCollective Painting: \"World in Peace, Cultures Safe, We Are Stronger\"\nJoin us in creating a large-scale collaborative mural! Kids and teens can express their hopes for a peaceful, united world through painting. The finished canvas will be proudly displayed in our community space after Summerfest. Prompt: What would you like to say to the world? How can we live peacefully and celebrate our beautiful planet together?\nRainbow Bubble Station\nPlay with color and form by making vibrant bubble art! Using safe food coloring and bubble mixtures, kids can create playful, abstract patterns and enjoy the magic of movement, color, and experimentation.\nArchitectonic Frets Station\nInspired by architectural patterns from different cultures, this station invites all ages to design and build their own geometric frets using recyclable materials like cardboard and paper. Discover how design connects us across time and place.\nA Platform for Artists and Performers\nFor artists and performers, Summerfest is a platform to share their talents, techniques, and traditions with an enthusiastic audience. Artisans showcase their handmade crafts, each item reflecting cultural stories and meticulous craftsmanship. Musicians, dancers, and other performers transform the festival stage into a dynamic tapestry of sound and movement, presenting cultural narratives in ways that captivate and inspire.\nCultural Workshops\nBeyond the festival itself, Summerfest extends its reach through a series of cultural workshops held throughout the summer. These workshops provide residents with opportunities to engage directly with master artists and cultural practitioners, learning traditional techniques and exploring the stories behind various art forms. Whether creating pottery, learning a traditional dance, or delving into global culinary arts, participants gain hands-on experiences that foster a deeper understanding of artistic heritage.\nSummerfest bridges our community with the global cultural landscape, celebrating the beauty and diversity of artistic traditions across arts disciplines.\nA Feast of Flavors\nSummerfest partners with the Food Truck League to bring a curated selection of cultural cuisine to the festival. Attendees can enjoy a diverse array of flavors from around the world, perfectly complementing the artistic and cultural performances on stage. Whether you're savoring a dish inspired by global traditions or discovering a new favorite, the carefully chosen food trucks enhance the festival experience.\nAs you shop for handmade crafts and take in the vibrant performances, the culinary offerings provide an opportunity to explore another layer of culture, making Summerfest a true feast for the senses.\nArt Yard at Summerfest\nThe Art Yard at Summerfest invites young attendees to dive into the world of creativity with project-based activities inspired by the diverse cultures showcased at the festival. Through engaging, hands-on art projects, children can learn about global traditions while expressing their creativity. This interactive space offers a meaningful and fun way for families to connect with the rich cultural heritage celebrated throughout Summerfest.\nBuilding Cultural Bridges\nSummerfest enriches the lives of residents by exposing them to diverse artistic practices and cultural traditions from around the world. The festival creates an atmosphere of unity and understanding, offering attendees the chance to experience the richness of global cultures firsthand. At the same time, it provides artists and performers with a space to connect with new audiences, fostering appreciation and exchange."
    }
  ],
  "argos_summary": "The Bountiful Davis Art Center is hosting its 50th Summerfest arts celebration on August 8 and 9, featuring performances, workshops, and cultural activities from various global traditions. The event, which is free to the public, aims to connect Utah's diverse population through art and cultural expression, emphasizing that art is a human right accessible to all. Attendees can enjoy performances, participate in hands-on workshops, and explore the Art Yard, all while experiencing a variety of international cuisines from food trucks.",
  "argos_id": "2A6SPVW2D"
}