{
  "url": "https://www.cnet.com/tech/mobile/my-iphone-17-pro-wishlist-item-isnt-a-feature-give-me-colors-beyond-monochrome-or-metal/",
  "authorsByline": "David Lumb",
  "articleId": "2ed919c95ae54d8395051194ba0ac0e5",
  "source": {
    "domain": "cnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.cnet.com/a/img/resize/1d732b3a03610df48bd1e90d6958c48554a4ebbc/hub/2024/09/09/98412b9f-353c-4d99-9922-4f0787f4cbc9/screenshot-2024-09-09-at-11-15-28am.png?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T19:15:00+00:00",
  "addDate": "2025-08-08T19:20:16.319941+00:00",
  "refreshDate": "2025-08-08T19:20:16.319945+00:00",
  "score": 1.0,
  "title": "My iPhone 17 Pro Wishlist Item Isn't a Feature: Give Me Colors Beyond Monochrome or Metal",
  "description": "Commentary: Apple's pro phones need to embrace colors beyond black, white, silver and gold.",
  "content": "Sure, a lot of people wrap their new iPhone in a case, but I've always cared a lot about how my smartphone looks. And for the iPhone Pro line, the colors have historically been muted. So when I saw rumors that the iPhone 17 Pro could arrive in colors such as orange, I started dreaming about a world where Apple's best phones exude a sense of fun like their siblings.\n\nFor years, Apple has split its phones into two tiers: the \"regular\" iPhones and the Pro models. The former offer lower specs and prices with bolder colors, while the latter are pricier premium models with more subdued tones. The iPhone Pro and Pro Max typically come in black, white and a silver-gray -- along with one trendier color that changes each year. For being the best that Apple offers, their colorways leave a lot to be desired, in my opinion.\n\nBut the iPhone 16 Pro comes in desert titanium, which is gold in all but name. The year before, the iPhone 15 Pro was available in a gray-blue (which I remember well, if not fondly, for not matching my vintage Bondi blue case). In 2022, the iPhone 14 Pro left white behind for gold and added a pastel purple alongside its black and silver hues -- and so on.\n\nSome people dropping $1,000-plus on a souped-up iPhone Pro want their device to look svelte, not superlative -- elite over effervescent, cultured instead of colorful. I'm not that person. When I saw the iPhone 5C, I didn't mind the cheaper-looking plastic case -- the vibrant colors popped. I don't think buying a premium phone should sentence you to a purgatory of dimmer hues.\n\nAnd yes, there are those of you out there who don't care what your phone looks like, since its colors will only briefly see the light of day before the handset is stuffed in its case to survive life's inevitable bounces and falls. That's completely valid, too.\n\nSo hearing that there's a potential Liquid Glass color coming to the iPhone 17 Pro that we expect to launch (as we do every year) in September, I got tentatively excited. But there's a big caveat: The rumor, sourced to Weibo-based leaker Instant Digital, didn't include a photo or any imagery of this potential debut. Instead, the leaker suggested that (as translated by Google Translate) the iPhone 17 Pro color is expected to be white, but with a finish that shifts or changes subtly under different lighting conditions.\n\nWhere are my prismatic phone colors?\n\nApple introduced its Liquid Glass update during WWDC 2025 in June, unveiling a new design strategy for the iPhone 17 Pro line that emphasizes translucence and rounded icons to give iOS 26 a fresh UI facelift. App makers responded to the initial developer betas with disdain, criticizing the design's distracting and disorienting lack of visual separation -- icons in the Control Center overlay were hard to see. Thankfully, subsequent tweaks improved the redesign ahead of the recently launched iOS 26 public beta.\n\nBut how Liquid Glass's design looks as an iPhone color is a bit harder to fathom. Instant Digital's claim that it'll be white but will shift with the light offers clues -- and it could end up looking like some beloved colors from smartphones of yore.\n\nFor instance, the 2018 Samsung Galaxy S10 came in a rather fetching prism white color that shimmered when you rotated it in the light, giving off a pearlescence of subtle pinks, purples and blues. Watch how it compares to the standard cream-colored ceramic white hue in this video from Sakitech.\n\nContrast that with the more wildly prismatic \"aura glow\" color in the Samsung Galaxy Note 10 from the same year, which reflected every color of the rainbow. This bombastic choice sure was eye-catching, but I'd guess it's too flamboyant for Apple. (And the beautiful glass back sure couldn't stand up to a fall.)\n\nTrue, Apple has dabbled in subtly shimmering colors -- the iPhone 13 and 13 Mini came in midnight, a black so deep it was almost blue, reflecting hints of hidden hues underneath. That same year's iPhones had another color, starlight, that was essentially the same effect in white.\n\nBut looking more closely at iPhone Pro designs from past years, I doubt we'll see anything as vivacious as those Samsung hues -- not only because Apple has avoided vibrant colors, but also because in recent years it's used a frosted rear glass that blurs and mutes the color beneath. Just what we end up getting from a Liquid Glass color, if anything at all, is very uncertain given Apple's design priorities.\n\nBut I'm hoping, just this once, the Pro phones get to show off a bit more of their stuff. And who knows -- maybe that'll be what finally sells us on the upcoming Liquid Glass redesign that's set to change the look and feel of iOS, like it or not.",
  "medium": "Article",
  "links": [
    "https://www.cnet.com/tech/mobile/apple-iphone-16-pro-and-pro-max-review-compelling-upgrade-with-my-favorite-iphone-feature-in-years/",
    "https://www.apple.com/newsroom/2023/09/apple-unveils-iphone-15-pro-and-iphone-15-pro-max/",
    "https://weibo.com/5143897135/PBvjkzMJ1",
    "https://www.cnet.com/reviews/galaxy-note-10-is-the-best-galaxy-phone-to-buy-right-now-review/",
    "https://www.cnet.com/tech/mobile/shades-of-style-my-journey-to-the-perfect-iphone-15-pro-max-case/",
    "https://www.cnet.com/wwdc/",
    "https://medium.com/utopian/apples-liquid-glass-sucks-6647bae0279f",
    "https://www.youtube.com/watch?v=mMxVnjYVWTk",
    "https://www.cnet.com/tech/mobile/apple-iphone-15-pro-and-15-pro-max-review-love-at-first-zoom/",
    "https://www.cnet.com/tech/mobile/is-the-iphone-17-pro-going-to-be-big-and-orange-we-rounded-up-the-rumors/",
    "https://www.cnet.com/reviews/samsung-galaxy-s10-dont-abandon-2019-flagship-just-yet-review/",
    "https://www.cnet.com/tech/mobile/iphone-17-rumors-everything-to-know-from-a-slim-air-model-to-fresh-colors/",
    "https://www.cnet.com/reviews/apple-iphone-5c-review/",
    "https://www.cnet.com/tech/mobile/best-iphone/",
    "https://www.cnet.com/tech/mobile/iphone-14-pro-max-review-welcome-apples-dynamic-island/",
    "https://www.techradar.com/news/why-samsung-galaxy-note-10-needs-a-case"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "iPhone Pro designs",
      "weight": 0.10551989
    },
    {
      "name": "iPhone Pro",
      "weight": 0.104970194
    },
    {
      "name": "vibrant colors",
      "weight": 0.09575285
    },
    {
      "name": "Colors",
      "weight": 0.09542494
    },
    {
      "name": "colors",
      "weight": 0.09542494
    },
    {
      "name": "bolder colors",
      "weight": 0.09389745
    },
    {
      "name": "iPhone",
      "weight": 0.07906488
    },
    {
      "name": "Pro",
      "weight": 0.07838895
    },
    {
      "name": "Pro Max",
      "weight": 0.07781489
    },
    {
      "name": "Liquid Glass",
      "weight": 0.06972218
    }
  ],
  "topics": [
    {
      "name": "Electronics"
    },
    {
      "name": "iPhone"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.849609375
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.7880859375
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.697265625
    },
    {
      "name": "/News/Technology News",
      "score": 0.67724609375
    }
  ],
  "sentiment": {
    "positive": 0.3017578,
    "negative": 0.23669434,
    "neutral": 0.46118164
  },
  "summary": "Apple's iPhone 17 Pro is expected to launch in colors such as orange in September, according to a rumor from Weibo-based leaker Instant Digital. The color changes each year for the Pro and Pro Max models, which Apple has traditionally come in muted colors. However, Instant Digital suggested that the new color will shift with the light and could resemble some beloved colors from smartphones like the Samsung Galaxy Note 10. Apple has previously opted for muted colors for its premium phones, with the iPhone 16 Pro coming in desert titanium and the iPhone 15 Pro in gray-blue. Despite these changes, the author believes Apple's priorities are unclear given given the current color choices.",
  "shortSummary": "Apple's upcoming iPhone 17 Pro will feature vibrant colors like orange and gold, but its overall design and aesthetics remain uninspiring.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a3e44f9fee82465d927e3bd801538bb5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnet.com/tech/mobile/shades-of-style-my-journey-to-the-perfect-iphone-15-pro-max-case/",
      "text": "My iPhone 12 Pro served me well through photographing overnight train trips and journeys through Germany, but its cameras were getting a bit long in the tooth compared to the latest phones. The time was ripe to upgrade to an iPhone 15 Pro Max, so I went to my carrier store and picked one up. But there was a problem. Upon receiving a case that I ordered online, I realized I'd gotten an iPhone in the wrong color. Should be easy to switch it out, right?\nRight?\nOn the whole, it took me over a month to swap my phone out for another one in a different color. I drove to multiple stores. I called helplines. I ended up having to ship my phone to a regional warehouse, and then call to see if I could get a new one shipped out. Well, it could've been easier if I'd made some different choices.\nIn the end, I got what I wanted: an iPhone 15 Pro Max that exactly matched a case with lots of personal meaning. If you could honor your childhood iMac with your stylish case, wouldn't you? In the hopes you never have to go through something similar, I'll tell my tale of wrong assumptions and belated discoveries -- along with the lessons about the phone industry I learned along the way.\nYou can have any iPhone color you want, as long as it's blue\nAfter using an iPhone 12 Pro for three years, I opted for the iPhone 15 Pro Max, as I wanted its 5x zoom, along with 512GB of storage for plenty of on-device space.\nI'm currently a Verizon plan subscriber, so it made sense to go to one of their stores to get my new Pro. I walked in, chatted with a friendly clerk, and walked out with an iPhone 15 Pro Max in titanium blue, the only color they had with 512GB of storage.\nAfter that, I ordered a case from Spigen that captured my imagination when I saw it. It was a phone case styled after the iconic \"Bondi Blue\" iMac G3 from 1998. When it came in the mail, I made a tragic discovery: the phone's dark blue hue didn't match the case at all, which had white translucent highlights reminiscent of the classic iMac.\nI could've left it. I should've left it. But as a mobile reporter, I felt compelled to fulfill my ideal smartphone vision to make 2024 look like 1998 in the best way. All I needed was a white iPhone 15 Pro Max. Unknown to me at the time was that it would take a month to get one -- I needed a model with 512GB.\nLife is easier with lower storage\nThe easiest thing to do would be to drive back to the Verizon store and swap it out for a white one. But since I needed a white one with 512GB of storage, I figured I'd call first. After speaking with a helpful employee, I learned that any location should have the configurations on hand.\nTragically overconfident, I drove out to the closest Verizon store, according to Yelp. Unfortunately it was a third-party store that couldn't handle my exchange. So I drove to the next-closest official Verizon retail location that had a white iPhone 15 Pro Max but only the 256GB model. The employees there found a store with a 512GB version in white that was another 20-minute drive away.\nSadly, the inventory software was wrong, I was told. What's more, the staff there didn't think Verizon sold white 512GB models in-store. I'd have to special order it -- by calling that centralized hotline.\nA few days later, I called the hotline, and a friendly operator helped me order a white 512GB iPhone. But first, I had to ship my current phone back, and that meant swapping service to another phone in the meantime. Luckily for me, as a reviewer, I had a few lying around.\nI hastily agreed to transfer service to another non-iPhone I had on hand (the operator just needed its IMEI number). But I foolishly forgot that that phone was locked to a different carrier. To add insult to injury, I had been calling the operator on my blue iPhone 15 Pro Max, which I didn't realize would be a problem until the call went dead when she transferred service.\nPhoneless, bereft in a cold and uncaring world, I drove across town to pick up my old iPhone 12 Pro that I'd left with my family to upgrade to from their older iPhone. I can't remember the last time I went anywhere without my smartphone's data umbilical to the outside world; it was so surreal and isolating that it forced me to reckon with our modern phone dependency.\nIn any case, I drove back to the original Verizon store to help transfer service back to my old iPhone 12 Pro, where I ran into another fun reality of modern smartphone switching: Bridging the world of SIM and eSIM.\nThe pros and cons of leaving SIMs for eSIMS\nFor years, reviewing different phones was as easy as popping out my SIM card and inserting it into the new phone. But in upgrading to the iPhone 15 Pro Max, I surrendered my account identity to the digital world and transferred it to an eSIM -- because, in another surrender to trends, the US models of the iPhone 15 series don't have physical SIM slots, a change that debuted in the iPhone 14.\nThe good news is that it was easy for me to walk into a Verizon store and have them swap my service to the eSIM slot on the iPhone 12 Pro (lucky for me, that model was the first to use eSIMs).\nThe bad news for us reviewers, and anyone who regularly changes phones, is that it takes a similar interaction with your carrier to transfer your account between different phones' eSIM slots. Those of us rotating between many handsets find this process gets in the way where physical SIMs did not.\nCNET Senior Editor Lisa Eadicicco had a similar situation years ago when she called her carrier at the end of the workday to switch service to an eSIM on a phone she was reviewing, leaving her to ride the subway home without a phone. But as she explained to me, swapping eSIMs can result in some very strange roadblocks.\nWhen she switched from an Android device to an iPhone via eSIM last year, she inexplicably lost access to MMS (multimedia messages) between her handset and other Android phone owners. Lots of troubleshooting and even her carrier couldn't help, but trawling forums revealed an answer: resetting the iPhone's settings completely.\n\"My experience was annoying, and it's hard to pinpoint exactly what happened and why,\" Eadicicco said.\nAfter my own eSIM trouble, I got my old iPhone 12 Pro back, shipped out my blue iPhone 15 Pro Max, and... waited. I wasn't exactly sure when it would get to a Verizon warehouse. A week or so later, I called the customer support hotline and asked them if they'd received the phone (they had), if my account was credited (it was), and if I could then order the phone I wanted in white (I could). After a $50 restocking fee was debited, the phone was on its way.\nWhen I opened up the white 512GB iPhone 15 Pro Max and slapped that case on, all was well. And I came away with some lessons from the ordeal, too.\nThe takeaways of torturing myself\nUnless you've done this carrier retail store rodeo before, you probably don't know that it can be tricky to get the right color and storage configuration. Most people, myself included, usually pick from what they have available. I just happened to have a specific (and glorious) vision for how I wanted my phone and case to look.\nIt was a surprise to discover that, at least in my area, Verizon stores don't have every single color and storage configuration. If you want one that wasn't normally sold in-store, you have to order it from a regional warehouse. Not a big deal on the whole, but interesting to see presumed market forces decide in-store options. Most buyers are probably fine with the titanium blue color for the iPhone 15 Pro series, since the other choices are white, black and the gray-tan \"natural titanium.\"\nI could've made my life a lot easier if I had just bought the iPhone 15 Pro Max through another retailer or via Apple itself, simply returning and exchanging it for the proper color and configuration. But not every online or in-person retailer has financing options like a carrier, nor would they have the same trade-in deals that might be more generous at carriers running promotions.\nMaking my 2024 iPhone recall the wonder of my 1998 iMac\nIt's easy to forget that the iPhone in my pocket is a modern miracle, especially compared to the tech I had as a kid. That's why I found it so delightful to symbolize that quantum leap when decorating my phone. Growing up, my family had an Apple Macintosh IIsi. It was compact and had a user-friendly experience that ran Kid Pix and word processing. But one day late in the '90s, my family upgraded from its yellowed desktop to something truly next-generation: the original iMac.\nWith a teardrop shell of striking Bondi Blue-and-white plastic, the 1998 iMac G3 was the future -- streamlined, stylized and ready for something brand-new to our house called the internet. That revolution was encased in bright, translucent blue-green plastic that rode the wave of see-through consumer tech, which packs a lot more personality than today's era of black or silver gaming consoles, laptops and desktop PCs. Phone manufacturers get a bit more color into their lineups, but they still feel like the same glass-and-metal rectangles released year after year.\nWhen I saw Spigen's case, my silly nerdy heart was yanked back in time to when products felt tactile in a way that stays with me -- I can hear the iMac's disc drive pop out after pushing its central button and feel the infamous puck mouse under my hand.\nAdmittedly, I've spilled a ton of digital ink inadvertently shilling for a phone case. But it speaks to a personalization and sense of belonging that I want from the things in my life, especially the glass rectangle in my pocket that serves as my gateway to the outside world. When I'm typing Slack messages to colleagues or work emails to sources, I can look at my case and be brought back to the days when everything in the future was bursting out of Bondi Blue plastic.\nBut if you ever find a phone case that's bottled some of your childhood, I hope you take my story to heart and avoid a month-long odyssey in realizing your smartphone dream."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/apple-iphone-16-pro-and-pro-max-review-compelling-upgrade-with-my-favorite-iphone-feature-in-years/",
      "text": "Pros\n- Larger screens/thinner bezels\n- 4K slo-mo, OMG\n- Audio Mix is brilliant\n- iOS 18\nCons\n- No Apple Intelligence out of the box\n- Camera Control placement not optimal for one-handed shooting\n- Elegant finishes aren't very colorful\n- Only 128GB of storage for $999\nA few days into my week-long test of the iPhone 16 Pro and Pro Max, it became obvious to me that the best feature on Apple's premium devices isn't the new camera control button, bigger screen or larger battery. It isn't even Apple Intelligence.\nThe iPhone 16 Pro's ability to record high-resolution slow-motion video is the best new iPhone feature I've seen in years. I used the 16 Pro to record footage of a lion dance rehearsal and was surprised by how the slow motion made the dancers' fast acrobatic movements look graceful, sustained and powerful -- something that's difficult to appreciate in real time. OK, I'm biased because I used to make short films and love the beauty of slo-mo.\nSee more: Apple iPhone 16 and 16 Plus Review: Little Improvements Add Up\nBut is the 16 Pro's 4K, 120-frames-per-second video capability really enough to get people who aren't camera nerds excited about Apple's new premium iPhones -- especially as the company touts the power of its Apple Intelligence suite of generative AI features?\nWith its straight-sided titanium build and Siri's rainbow glow, Apple hyped the iPhone 16 Pro as a vessel that will bring generative AI, in the form of Apple Intelligence, into our everyday lives.\nTurns out, the complete vision for the iPhone 16 Pro with Apple Intelligence that the company showed off at its September iPhone event just isn't ready yet. I appreciate that Apple is taking its time to wade into the gen-AI waters -- it can hopefully avoid the blunders associated with a rushed rollout that we saw with Google's AI Overviews release. But it's unfortunate that people who may have bought the iPhone 16 Pro or 16 Pro Max specifically for Apple Intelligence will have to wait before experiencing it on their new phone.\nAnd while I did get to test an early preview version of Apple Intelligence on the iPhone 16 Pro, key features were missing. I didn't get to test the ChatGPT integration, Genmoji or Image Playground.\nHowever, other standout features left me impressed with the 16 Pro. That high-resolution slow-mo recording function, various iOS 18 capabilities as well as hardware upgrades help the iPhone 16 Pro feel like a compelling upgrade.\nSee more: Best VPN for iPhone 2024\nBut should you buy it?\nIf you're buying the $999 iPhone 16 Pro (£999, AU$1,799) or the $1,199 iPhone 16 Pro Max (£1,199, AU$2,149) for Apple Intelligence, don't. At least not yet. Apple has indicated that iOS 18.1, which will introduce the AI features, will come out in October.\nIf you have an iPhone 12 Pro or older, upgrading to the 16 Pro makes a lot of sense. If you're on a 13 Pro and still have a decent battery capacity, I'd say save your money. And if you're on a 14 Pro or 15 Pro, there's no need to upgrade. Also, I should note that the entry-level $999 iPhone 16 Pro only has 128GB of storage. For perspective, Motorola's $300 Moto G Power comes with 128GB. Apple's charging over three times the price, so it could have at least included 256GB of storage in the base model.\nThis year the 16 Pro and 16 Pro Max have the exact same cameras -- unlike the 15 Pro and 15 Pro Max, which had different telephoto options. Screen size, battery life and price should be the deciding factors when you're choosing between the two.\nShortcomings aside, the iPhone 16 Pro is impressive, and it will likely be even more so as software updates and promised features are added. Just don't buy it hoping for Apple Intelligence (yet).\niPhone 16 Pro's 4K 120fps slow motion\nThe year was 2020 and in the middle of the lockdown, Sony sent me the Xperia 5 II, which could record 4K, 120fps, slow-motion videos. The feature was the first time slow-motion video in 4K resolution had ever been offered on a phone. The Xperia 5 II was clearly ahead of its time and, until now, had been the high-water mark for phone-based slo-mo recording.\nApple takes all this to another level.\nNot only can the 16 Pro and 16 Pro Max record 4K 120fps slow motion video, it can do so with little effort. Unlike the Xperia 5 II, which required using a professional camera app to record and preserve the footage, Apple bakes in the ability right into the iPhone's native camera app.\nAnd the results look outstanding, which is why this feature is such a big deal. Previous slow motion videos shot on the iPhone could look good if there was a lot of light. But they topped out at a lower HD resolution and the image quality was a significant step down from regular 4K 30fps video recording.\nThe iPhone 16 Pro's new slo-mo has great details, good dynamic range and accurate colors which puts it on par with regular iPhone video quality. Even when I was recording a lion dance rehearsal by the Lion Dance Me company in their San Francisco warehouse space, under medium lighting, the video looked good. You can see this slo-mo footage and more in the video below.\nApple Intelligence: Beta steps\nThe review unit Apple loaned me ran the iOS 18.1 developer beta, which allowed me to preview some Apple Intelligence features. It was a similar experience I had running the developer beta of 18.1 on my iPhone 15 Pro. And while Apple Intelligence is the headline feature for the phone, it's not quite fully baked. But from what I was able to test, I found Apple Intelligence to be useful and fun, and could see its potential.\nThe writing tools are clever. You can have it proofread something you wrote, or prompt it to rewrite it in a different tone and style, like concise, professional or friendly. The professional style is a bit stilted. It rewrote a text to a neighbor who was cat sitting for me, in which I joked about my cat being sad that I was gone. It conjured: \"My feline companion is experiencing distress due to my excessive work commitments, which have resulted in a neglect of his preferred activities, such as playtime and quality interactions.\"\nI found this hysterical.\nAs a professional writer, I don't expect I'd use these rewrite tools regularly. But one Apple Intelligence feature that I did use a ton was the Summarize tool, especially in Safari for news stories. I read a bunch of articles every day, so I can see the Summarize tool being the key to help weed out the clickbait from stories I should actually peruse.\nThe Create a Memory Movie in the Photos app is fun. I gave it the prompt \"San Francisco brunch,\" and it made a Memory Movie titled \"Brunching in the City\" complete with the song Cissy Strut by The Meters.\nBut probably the most notable feature has to be the Clean Up tool in Photos, which lets you remove unwanted elements from an image. In this photo of CNET's Lisa Eadicicco, I removed a chair on the left side and monitor on the right. I would have a hard time telling if there had been something there – aside from the leftover chair wheels.\nHere's one of CNET's Lexy Savvides and Celso Bulgatti.\nBelow is the same photo after I used the Clean Up tool to remove a person from the background who was talking to someone out of the frame. The results are good. But when I removed the van from the background, it was replaced with a Salavdor Dali-like bike wheel blob.\nSiri's glowing interface looks cool and the assistant seems faster and more helpful. When talking to Siri, I can be more natural and change what I say mid-thought. But this is far from the Gemini Live capability on Google's Pixel 9 phones, which has its own issues. Siri handles changing phone controls well, but when I asked what my phone's serial number was, it was unresponsive. The same was true when I asked how much storage I had on my phone.\nAgain, this was a preview version of Apple Intelligence, and the public release should arrive in October. While I take issue with Apple linking the iPhone 16 Pro and Apple Intelligence despite the gen-AI feature not being available, I do see where Apple is headed with generative AI and large language models, and I'm glad it's taking its time to get there.\nThe iPhone 16 Pro has more Camera Control\nApple added the Action button last year, and in 2024 gave us the Camera Control button -- which is so much more than just a button. Essentially, it's a shortcut key for the camera. Press it to open the camera and press it again to take a photo. Press and hold to record a video.\nThe button, located just below the power button, sits flush with the iPhone's side and can also be lightly double-tapped to bring up a gorgeous tiny menu of camera tools that gives me Q-Tip-in-the-ear levels of satisfaction every time I see it. If you select the zoom tool, you can slide your finger across the button to zoom in and out, almost like a miniature MacBook trackpad. You can also set it to adjust the \"aperture\" for Portrait mode photos to make the background look more or less blurry.\nMy favorite use is for swiping through Apple's new Photographic Styles to get a preview of different looks before I take a photo. Apple said that more functionality is in the works, including the ability to half-press the button to lock focus and exposure and full-press to take a photo -- like a dedicated professional mirrorless camera.\nThe biggest downside is if I'm holding the phone one-handed (I'm right-handed) to take a horizontal photo, I usually have my index finger across the side to help get a good grip on the phone, and that can accidentally interact with the Camera Control key.\nAs useful as the Camera Control button is, it seems ideally geared for Visual Intelligence, which can add context to whatever your iPhone's cameras are pointed at, a bit like Google Lens. Unfortunately, it won't arrive until later this year.\nThe Camera Control button will work with other photography apps, but I wish it could be used to swipe in apps like TikTok, or scroll through social media feeds and stories. It could be the elegant 2024 version of Blackberry's iconic scroll wheel.\niPhone 16 Pro cameras and photos\nIn essence, the regular iPhone 16 Pro has three new cameras. It inherits the 12-megapixel 5x telephoto camera from the Pro Max, replacing last year's 3x telephoto on the 15 Pro. It gets a new 48-megapixel ultrawide camera, and the main camera's 48-megapixel sensor gets upgraded to a faster one. And it's worth noting again that both the 16 Pro and 16 Pro Max have the same cameras.\nTake a look at some of my favorite photos from the iPhone 16 Pro and 16 Pro Max.\nThe higher resolution ultrawide camera allows for truly great macro photos: super close-up ones like this one of a lion dance head mask -- look at the details in that fur!\nBut the ultrawide in macro mode can also grab good food snaps like this image of a Four Barrel cortado and scone.\nUltrawide photos look good and are closer in parity to the main camera in terms of image quality, but there's still quite a gulf between them. Check out this photo of a wine bar taken with the main camera.\nAnd here's an image of the same bar taken with the ultrawide.\nI like the contrast in the ultrawide photo, but it has less dynamic range than the main camera's image, which is also brighter. Lens flares are minimal; notice the street light (out of frame) bleeding in at the top of this photo and the small soft flare.\nMain camera images have a wide dynamic range like this shot of the SoMa neighborhood in San Francisco.\nPhotos from the main camera have great image quality. Skin tones look wonderful. Here's a group shot of some CNET-ers backlit by a San Francisco sunset. Everyone's complexion has a nice soft glow -- maybe a tad too soft, but it's far from looking plastic-y and processed.\nHere's a night mode photo of San Francisco's city hall taken on a foggy evening.\nApple overhauled its Photographic Styles, and this is one of the places where I enjoy using the camera control button the most, just swiping between styles to achieve the look I want. It reminds me to an extent of the film simulations on the Fujifilm X100VI -- not only in how these styles smartly change aspects of a photo, but for the fact that you can take control and customize each.\nWhen reviewing a photo or video in the Photos app, especially right after shooting it, you have to tap the display to see it full screen. It's not the end of the world. But when I'm filming a video and want to check a shot, it's just one more step - and sometimes in the heat of the moment, this adds friction that doesn't need to be there.\niPhone 16 Pro's Audio Mix is outstanding\nSpeaking of the Photos app, I'm impressed with the new Audio Mix feature for videos. iPhone 16 Pro videos straight out of camera already have a solid default noise-isolation feature. Audio Mix lets you adjust the audio you've recorded even more to isolate a person talking on camera, and make them sound like they're recording on a studio microphone. You can also place voices on a center audio track for film and preserve environmental sounds on a separate audio track.\nWatch the review video that's attached to this story to see Audio Mix in action. I recorded a video of CNET's Jessica Fierro singing and playing a guitar on a noisy rooftop. And we were blown away by how Audio Mix was able to remove city sounds, HVAC noise and wind.\nThe iPhone 16 Pro is all about iOS 18 and A18 Pro\nOne of the best parts of the 16 Pro and Pro Max is iOS 18, which is all about personalizing your iPhone to fit your needs. Whether it's being able to move apps anywhere on the home screen, change icon colors and size or even remove app names, or add shortcuts to the Control Center, iOS wants you to customize your iPhone.\nThe flashlight controls in the Dynamic Island are fun and useful, and being able to use any emoji or live photos sticker as a tapback in Messages is such a delight. The QR code in the Passwords app for Wi-Fi is fantastic. For more on the new iPhone software, read CNET's iOS 18 review.\nPowering everything on the 16 Pro series is Apple's new A18 Pro chip. In use, the 16 Pro has been peppy, and able to handle big workloads from filming copious amounts of 4K slow-mo footage to playing video games and everyday scrolling.\nIn terms of battery, I've been primarily using the smaller 16 Pro, and it gets through a day fine. On my heaviest day of use (filming on it, having the screen at full brightness) the phone started at 6:30 a.m. with a full charge and dropped to 12% by 7 p.m. I topped it off for 15 minutes, which brought it back up to 37%, and it made it to 1 a.m. with 22% left. Check back on this review, as I will be updating it with results from CNET's battery tests.\niPhone 16 Pro wrap-up\nThe iPhone 16 Pro and 16 Pro Max have everything we've come to expect in a year-over-year upgrade. Even without Apple Intelligence, the 6.3-inch iPhone 16 Pro and 6.9-inch iPhone 16 Pro Max have a slew of upgrades including a good battery life, outstanding photo and video chops and iOS 18. And the negatives are as thin as the borders around the larger screens: You only get 128GB of storage for a grand, plus drab color options and a new camera button that might get accidentally tapped.\nThe iPhone 16 Pro and Pro Max are excellent phones worthy of a spot in your pocket -- if you can afford them.\nHow we test phones\nEvery phone tested by CNET's reviews team was actually used in the real world. We test a phone's features, play games and take photos. We examine the display to see if it's bright, sharp and vibrant. We analyze the design and build to see how it is to hold and whether it has an IP-rating for water resistance. We push the processor's performance to the extremes using standardized benchmark tools like GeekBench and 3DMark, along with our own anecdotal observations navigating the interface, recording high-resolution videos and playing graphically intense games at high refresh rates.\nAll the cameras are tested in a variety of conditions from bright sunlight to dark indoor scenes. We try out special features like night mode and portrait mode and compare our findings against similarly priced competing phones. We also check out the battery life by using it daily as well as running a series of battery drain tests.\nWe take into account additional features like support for 5G, satellite connectivity, fingerprint and face sensors, stylus support, fast charging speeds and foldable displays, among others that can be useful. We balance all of this against the price to give you the verdict on whether that phone, whatever price it is, actually represents good value. While these tests may not always be reflected in CNET's initial review, we conduct follow-up and long-term testing in most circumstances.\nApple's iPhone 16 and 16 Pro lineup\n| Apple iPhone 16 | Apple iPhone 16 Plus | Apple iPhone 16 Pro | Apple iPhone 16 Pro Max | |\n|---|---|---|---|---|\n| Display size, resolution, refresh rate | 6.1-inch OLED; 2,556x1,179 pixels; 60Hz refresh rate | 6.7-inch OLED; 2,796x1,290 pixels; 60Hz refresh rate | 6.3-inch OLED; 2,622x1,206 pixels; 1-120Hz adaptive refresh rate | 6.9-inch OLED; 2,868x1,320 pixels; 1-120Hz adaptive refresh rate |\n| Pixel density | 460 ppi | 460 ppi | 460 ppi | 460 ppi |\n| Dimensions (inches) | 5.81 x 2.82 x 0.31 inches | 6.33 x 3.06 x 0.31 inches | 5.89 x 2.81 x 0.32 inches | 6.42 x 3.06 x 0.32 inches |\n| Dimensions (millimeters) | 147.6 x 71.6 x 7.8mm | 160.9 x 77.8 x 7.8mm | 149.6 x 71.5 x 8.25mm | 163 x 77.6 x 8.25mm |\n| Weight (grams, ounces) | 170g (6 oz) | 199g (7.03 oz) | 199g (7.03 oz) | 227g (7.99 oz) |\n| Mobile software | iOS 18 | iOS 18 | iOS 18 | iOS 18 |\n| Camera | 48-megapixel (wide), 12-megapixel (ultrawide) | 48-megapixel (wide), 12-megapixel (ultrawide) | 48-megapixel (wide), 48-megapixel (ultrawide), 12-megapixel (5x telephoto) | 48-megapixel (wide), 48-megapixel (ultrawide), 12-megapixel (5x telephoto) |\n| Front-facing camera | 12-megapixel | 12-megapixel | 12-megapixel | 12-megapixel |\n| Video capture | 4K up to 60fps; spatial video at 1080p at 30fps | 4K up to 60fps; spatial video at 1080p at 30fps | 4K up to 120fps; spatial video at 1080p at 30fps | 4K up to 120fps; spatial video at 1080p at 30fps |\n| Processor | Apple A18 | Apple A18 | Apple A18 Pro | Apple A18 Pro |\n| RAM/storage | 128GB, 256GB, 512GB | 128GB, 256GB, 512GB | 128GB, 256GB, 512GB, 1TB | 256GB, 512GB, 1TB |\n| Expandable storage | No | No | No | No |\n| Battery | Up to 22 hours video playback; up to 18 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Up to 27 hours video playback; up to 24 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Up to 27 hours video playback; up to 22 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Up to 33 hours video playback; up to 29 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W |\n| Fingerprint sensor | None (Face ID) | None (Face ID) | None (Face ID) | None (Face ID) |\n| Connector | USB-C | USB-C | USB-C | USB-C |\n| Headphone jack | No | No | No | No |\n| Special features | Apple Intelligence, Action button, Camera Control button, Dynamic Island, 1 to 2,000 nits display brightness range, IP68 resistance. Colors: black, white, pink, teal, ultramarine. | Apple Intelligence, Action button, Camera Control button, Dynamic Island, 1 to 2,000 nits display brightness range, IP68 resistance. Colors: black, white, pink, teal, ultramarine. | Apple Intelligence, Action button, Camera Control button, 4x audio mics, Dynamic Island, 1 to 2,000 nits display brightness range, IP68 resistance. Colors: black titanium, white titantium, natural titanium, desert titanium. | Apple Intelligence, Action button, Camera Control button, 4x audio mics, Dynamic Island, 1 to 2,000 nits display brightness range, IP68 resistance. Colors: black titanium, white titantium, natural titanium, desert titanium. |\n| US price starts at | $799 (128GB), $899 (256GB), $1,099 (512GB) | $899 (128GB), $899 (256GB), $1,199 (512GB) | $999 (128GB), $1,099 (256GB), $1,299 (512GB), $1,499 (1TB) | $1,199 (256GB), $1,399 (512GB), $1,599 (1TB) |\n| UK price starts at | £799 (128GB), £899 (256GB), £1,099 (512GB) | £899 (128GB), £999 (256GB), £1,199 (512GB) | £999 (128GB), £1,099 (256GB), £1,299 (512GB), £1,499 (1TB) | £1,199 (256GB), £1,399 (512GB), £1,599 (1TB) |\n| Australia price starts at | AU$1,399 (128GB), AU$1,599 (256GB), AU$1,949 (512GB) | AU$1,599 (128GB), AU$1,799 (256GB), AU$2,149 (512GB) | AU$1,799 (128GB), AU$1,999 (256GB), AU$2,349 (512GB), AU$2,699 (1TB) | AU$2,149 (256GB), AU$2,499 (512GB), AU$2,849 (1TB) |"
    },
    {
      "url": "https://www.cnet.com/reviews/galaxy-note-10-is-the-best-galaxy-phone-to-buy-right-now-review/",
      "text": "Galaxy Note 10, or Note 10 Plus? For the first time ever, Samsung announced two sizes of the same Note phone, with only a few differences beyond their screen dimensions and price. Finally, we can answer the questions we've been chewing on since Samsung's reveal: do the differences matter, and which phone is the better buy?\nThe Good\nThe Bad\nThe Bottom Line\nWhile the 6.8-inch Note 10 Plus impresses in nearly every way, I'm happy to say that the cheaper, smaller 6.3-inch Note 10 is the best pick for most.\nIts large screen gives you room to do what you want without being too cumbersome to hold (case in point: I dropped it a lot less than the Note 10 Plus), and the features it trades off -- no depth camera on the phone's back, no microSD card slot, less RAM, a smaller battery -- all even out when you consider the Note 10's relative portability and $150 price savings compared to the Plus.\nThe Galaxy Note 10 costs $949, versus the Note 10 Plus' $1,099 starting price (both with 256GB). In the UK that's £869 versus £999, and in Australia it's AU$1,499 versus AU$1,699.\nAs usual with Samsung variants, the two phones share the most important core features, from a crystal-clear AMOLED screen and appealing design to the Snapdragon 855 chipset and S Pen stylus. They both have the same main rear- and front-facing cameras, fast charging with an included 25-watt charger, water-resistance (IP68) and the ability to wirelessly charge another Qi-enabled device. They run Android 9 and will be upgradable to Android 10 -- no word on a timeline yet. (Scroll to the end for the full specs comparison.)\nAnd how does the Note 10 match up to Samsung's other Galaxy phones, like the Galaxy S10 Plus , cheap-premium Galaxy S10E and \"fast\" handsets like the Note 10 Plus 5G and Galaxy A90 5G? If you're comfortable with a $1,000 budget -- or with waiting for deals -- it simply delivers the best design and meaningful feature set for the price. That's so long as you can adjust to using wireless or USB-C headphones. Honestly, I just learned to carry the included headphones with me.\nRead more: Best headphones for Samsung Galaxy Note 10, Note 10 Plus\nAs for Samsung's loftier devices, we recommend holding off on 5G phones until the networks are more developed and the handset prices come down.\nHow the Note 10 and Note 10 Plus compare\n- The smaller Note 10 is easier to hold and use.\n- Note 10 Plus' larger screen is better for watching movies and reading stories.\n- Note 10 Plus' depth camera only works with mediocre 3D scanning and AR measuring apps right now; you don't need it for portrait photos or portrait video.\n- No onboard storage on the Note 10 is a shame, but 256GB is more than enough for most.\n- Battery life lasted 18 hours in our video loop test in airplane mode, versus the Plus' 21 hours.\n- The smaller Note 10 doesn't support Samsung's $50 after-market 45-watt charger.\n- Most people won't notice the Note 10's 8GB of RAM versus the Plus' 12GB.\nBoth Note 10 phones also have some issues with the edge-to-edge display sometimes registering mispresses that it should reject, which means you might launch or close an app by accidentally touching the screen.\nFor everything else, from the solid camera quality to the striking finish of the Note 10 in Aura Glow, read my full Galaxy Note 10 Plus review.\nGalaxy Note 10 versus Note 10 Plus\n| Samsung Galaxy Note 10 | Samsung Galaxy Note 10 Plus | |\n|---|---|---|\n| Display size, resolution | 6.3-inch AMOLED; 2,280x1,080 pixels | 6.8-inch AMOLED; 3,040x1,440 pixels |\n| Pixel density | 401 ppi | 498 ppi |\n| Dimensions (inches) | 5.94 x 2.83 x 0.31 in. | 6.39 x 3.04 x 0.31 in. |\n| Dimensions (millimeters) | 151 x 71.8 x 7.9 mm | 162.3 x 77.2 x 7.9 mm |\n| Weight (ounces, grams) | 5.93 oz.; 168g | 6.91 oz.; 196g |\n| Mobile software | Android 9.0 Pie | Android 9.0 Pie |\n| Camera | 12-megapixel (wide-angle), 16-megapixel (ultrawide-angle), 12-megapixel (telephoto) | 12-megapixel (wide-angle), 16-megapixel (ultrawide-angle), 12-megapixel (telephoto), 3D depth (HQVGA) |\n| Front-facing camera | 10-megapixel | 10-megapixel |\n| Video capture | 4K | 4K |\n| Processor | Qualcomm Snapdragon 855 processor, or Samsung Exynos 9825 | Qualcomm Snapdragon 855 processor, or Samsung Exynos 9825 |\n| Storage | 256GB | 256GB, 512GB |\n| RAM | 8GB | 12GB |\n| Expandable storage | No | Up to 1TB |\n| Battery | 3,500 mAh | 4,300 mAh |\n| Fingerprint sensor | In-screen | In-screen |\n| Connector | USB-C | USB-C |\n| Headphone jack | No | No |\n| Special features | S Pen stylus; Wireless PowerShare; hole punch screen notch; water resistant (IP68) | S Pen stylus; Wireless PowerShare; hole punch screen notch; water resistant (IP68) |\n| Price off-contract (USD) | $949 | $1,099 |\n| Price (GBP) | £899 | £999 |\n| Price (AUD) | AU$1,499 | AU$1,699 |"
    },
    {
      "url": "https://www.cnet.com/tech/mobile/iphone-17-rumors-everything-to-know-from-a-slim-air-model-to-fresh-colors/",
      "text": "Key takeaways:\n- The iPhone 17 could feature a redesigned camera bump, though it may not be as drastic a difference as the Pro models.\n- A higher refresh rate could be coming to the full lineup, potentially enabling the baseline iPhone to have an always-on display.\n- Prices remain uncertain with tariffs, but they'll likely go up, given it's been years since Apple raised the price of the iPhone.\nThe anticipated reveal of Apple's newest iPhone is just around the corner. For months now, rumors have been swirling about what the upcoming device, likely called the iPhone 17, could look like, from a redesigned camera module to fresh colors and a higher refresh rate. The phone is expected to debut in early September, although Apple hasn't confirmed anything yet. You can also check out our rumors on the iPhone 17 Pro and the thinner iPhone 17 Air.\nPerhaps the biggest looming question is whether iPhones could get pricier, especially with tariffs. President Donald Trump has said Apple will have to pay a 25% tariff on iPhones made outside the US. This would almost certainly lead to a price hike for consumers. We'll have to wait to see how Apple responds and if shoppers really do end up shouldering that extra cost. But even without tariffs, the iPhone may be due for a markup, as it's been years since Apple raised prices on its handsets.\nHere's everything analysts and leakers predict about the baseline iPhone 17.\nSee also: Thinking About Buying a New iPhone? Here's Why You Should Wait\nCamera bump redesign\nIt's not an iPhone release without a camera upgrade, and there have been plenty of rumors about what the camera module could look like on Apple's upcoming phones. In January, a leaked image from Majin Bu on X suggested the phone could feature a pill-shaped camera bar, essentially resembling what you'd find on Google's Pixel 9 phone. In February, Bu followed up with CAD renders of what's said to be the iPhone 17 lineup, featuring horizontal camera bars, as well as larger rectangular bars on the iPhone 17 Pro models.\nIn April, Bloomberg reported the \"iPhone 17 Pro will look a lot more like the 16 Pro than anticipated,\" adding, \"From the front, the 17 Pro will appear quite similar to the 16 Pro. It's the back camera that will look meaningfully different.\" The latest rumors suggest the iPhone 17 Pro's three-lens camera arrangement will be maintained but will sit on a new panel that stretches across the phone's width and is the same color as the rest of the phone.\nLater in April, Bu again posted an image of the purported iPhone 17 lineup, showing those wider camera bars with the stacked lenses still configured to the left.\nNot until next year, for the 20th anniversary of the iPhone, will Apple be \"preparing a major shake-up\" for the phone's design, Bloomberg says. That includes a (long-rumored) foldable version and a \"bold new Pro model that makes more extensive use of glass.\"\nAnother camera-related rumor is that the selfie camera on all iPhone 17 models will be upgraded to 24 megapixels, according to analyst Jeff Pu. That's a decent bump from the current 12-megapixel front-facing camera on the iPhone 16 lineup, although it's important to remember that more megapixels don't automatically mean better photos. Still, given how much people increasingly rely on their front cameras to snap selfies and record videos for TikTok and Instagram, this surely will be a welcome advancement.\niPhone 17 display upgrade\nRumor has it that all models of the iPhone 17 will feature a 120Hz display, bumping the non-Pro models up from their current 60Hz refresh rate. That could be a welcome change, as the discrepancy between the Pro and non-Pro refresh rate is surprising; when Apple debuted the iPhone 16 and 16 Plus with a 60Hz display, there was a bit of an outcry from folks who expected more in 2024. This rumored update could remedy that -- and possibly bring the always-on display to the baseline model.\nThere's been a lot of back-and-forth about whether the latest iPhones will have a scratch-resistant, anti-reflective display. A July report from MacRumors suggests that feature will in fact be arriving on the iPhone 17 Pro and Pro Max, just not the baseline iPhone 17 or the Air. This would make the Pro models the first iPhones with an anti-reflective screen, giving them a feature that CNET's Patrick Holland deemed one of the best attributes of the Samsung Galaxy S25 Ultra.\nThere also have been contradictory reports on whether the Dynamic Island on the iPhone 17 lineup will look any different. In May, Pu said all iPhone 17 models will use a new metalens technology for the proximity sensor, which could allow Apple to reduce the size of the Face ID sensor and the Dynamic Island, according to 9to5Mac. Analyst Ming-Chi Kuo, on the other hand, said in January that the Dynamic Island would remain \"largely unchanged\" in the iPhone 17 lineup compared to the iPhone 16. We'll have to see what ends up being true.\nRumors on what frames the iPhone 17 lineup will feature have gone back and forth. In February, Pu suggested the iPhone 17, iPhone 17 Pro and iPhone 17 Pro Max will all have aluminum frames. He noted that the iPhone 17 Air could be the outlier with a titanium frame.\nNew chipset\nIn May, Pu noted the iPhone 17 would have the same A18 chip used in the iPhone 16, while the iPhone 17 Air and Pro models will feature an A19 chip. It's possible the phones could also include the Apple-developed 5G modem, called the C1 chip, which debuted on the iPhone 16E.\nIn February, Kuo noted Apple will swap out Broadcom's Wi-Fi chips for in-house chips across the iPhone 17 lineup, stating this would \"enhance connectivity across Apple devices.\" It's not yet clear what exactly this would mean, but it would be interesting if Apple's C1 chip was also accompanied by its own Wi-Fi chip.\niPhone 17 battery\nSo far, rumors suggest only the pricer iPhone 17 Pro Max could get a bigger battery, according to Ice Universe. The leaker says the top-of-the-line phone could go from 8.25mm on the iPhone 16 Pro Max to 8.725mm on the iPhone 17 Pro Max as a result. In addition, leaker Instant Digital suggests the high-end phone could have about a 5,000 mAh battery, a notable increase over the 4,685 mAh on the iPhone 16 Pro Max, according to third-party tests.\nBut that doesn't mean the baseline version won't get any boost. Even if battery capacity stays the same (which it may not), the AI-powered Adaptive Power feature arriving with iOS 26 can help extend battery life. The feature automatically adjusts your iPhone's performance based on how you're using it at the moment, according to Apple. This could especially be helpful with the slimmer iPhone 17 Air, which will likely also have a thinner battery.\niOS 26 brings a fresh look\nApple has revamped its mobile operating system with iOS 26 (not iOS 19), which is named after the last two digits of the upcoming year. And with iPadOS, MacOS, WatchOS, TVOS and VisionOS following the same naming convention, the move is designed to bring more uniformity -- naming-wise and appearance-wise -- across the operating systems.\nThe new Liquid Glass interface brings a more transparent, lens-like look to the iPhone and other Apple devices. With iOS 26, the Camera app also adopts a more minimalistic design and Photos once again makes it easier to find your albums by adding separate tabs for your Library and Collections, instead of forcing you to scroll through a single cluttered screen. Updates to Messages include being able to add backgrounds to chat windows and create polls in group chats, and a new screening tool can better detect spam texts and move messages from unknown senders to a dedicated folder. You can read more about iOS 26 features here.\nIn April, tipster Digital Chat Station noted that given the use of Apple Intelligence and AI on a \"large scale,\" the iPhone 17 lineup will come with 12GB of RAM, instead of the current 8GB. Kuo noted the iPhone 17 Air and Pro models would sport that increased 12GB of RAM, but that Apple was still deciding whether to equip the baseline model with 8GB or 12GB of RAM. In May, Pu noted the baseline would remain at 8GB.\nPrice and release date\nWe expect the iPhone 17 to become available in September although it's not yet clear exactly when, as Apple hasn't confirmed anything.\nHistorically, Apple has unveiled its new iPhones on the first Tuesday of September after Labor Day. However, the first Tuesday in 2025 is the day after Labor Day so it's possible Apple could either push its iPhone event to Wednesday, Sept. 3, or hold it the following week on Tuesday, Sept. 9.\nThat would mean the phones could then become available on either Sept. 12 or 19. Preorders would kick off a week before general availability, on either Sept. 5 or 12.\nBloomberg's Mark Gurman has said that the new iPhone announcement should come Sept. 9 or 10.\nPrice is also a big unknown. Jefferies analyst Edison Lee has said the iPhone 17 Air, 17 Pro and 17 Pro Max will get a $50 price increase to offset tariffs and the higher cost of components, but didn't mention the baseline iPhone 17. If that's true, the starting prices for the full lineup could be:\n- iPhone 17: $829\n- iPhone 17 Air: $979\n- iPhone 17 Pro: $1,049\n- iPhone 17 Pro Max: $1,249\nRegardless of higher component costs or tariffs, the iPhone is overdue for a price increase, because the last price hike was five years ago.\nThe latest rumors suggest the iPhone 17 could be available in black, blue, silver, purple and green.\nWe'll continue to update this piece as more rumors surface so be sure to follow along."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/best-iphone/",
      "text": "There are five models in Apple's current iPhone 16 lineup, and we tested and reviewed them all. Each has a different appeal, depending on your needs and budget. The $829 iPhone 16 gets you new buttons for shortcuts, an additional camera and MagSafe. Then there's the $999 iPhone 16 Pro, which has a new camera and a bigger screen. The $599 iPhone 16E is the most affordable. It has the same chip as the iPhone 16, along with a single rear camera, but it lacks Apple's most notable features, like MagSafe charging. Please note that we expect the iPhone 17 series to be revealed in September. So it might be best to hold off on buying any new iPhone until then.\nOur Picks\nMOBILE DEALS OF THE WEEK\n- $449 (save $50)\n- $550 (save $50)\n- $300 (save $100)\nWhat's the best iPhone right now?\nThe best iPhone for most people is the $799 iPhone 16. We think the iPhone 16 and 16 Plus are ideal for most people looking for a great phone that will last for years. It comes in two sizes: a 6.1-inch regular iPhone 16 model or a larger, 6.7-inch iPhone 16 Plus model that starts at $899. The phones have a new 12-megapixel ultrawide camera that performs better in low light and can now take macro photos, meaning you'll be able to focus close to take amazing food snaps.\nThe iPhone 16 and 16 Plus have a handful of Apple Intelligence tools for writing, removing distractions from photos and creating summaries of messages and web pages. There's also ChatGPT integration with Siri. The phones have an Action button, too, which can be programmed for different functions like turning on the flashlight, recording a voice memo, changing the focus mode and more. There's also a new Camera Control button that not only lets you take photos and quickly change things like zoom, Portrait mode aperture and Photographic Styles, but can also trigger a new feature called Visual Intelligence, which will add context to whatever the camera is pointed at.\nBest iPhones of 2025\nPros\n- Camera Control is useful for switching camera settings\n- Photographic Styles makes photos pop\n- Ultrawide camera is better in low light\nCons\n- Apple Intelligence isn’t out yet\n- No always on display\n- No changes to wired charging speeds\n- No upgrades to the Action button\nWhen I tested the iPhone 16 and 16 Plus I was definitely impressed by the new photography features, the convenient Action button and the elegant build. I consider these phones to be top-notch choices for Apple fans. Parts of the iPhone 16’s key feature, Apple Intelligence, are now out, and the fact that these phones will support it means they’ll likely feel future-proofed for years to come. Aside from screen size (6.1 inches on the regular, 6.7 inches on the Plus), battery size and price, the iPhone 16 and 16 Plus are identical in every way.\nThe iPhone 16 isn’t perfect -- it’s missing an always-on display, and it feels like it’s been ages since Apple improved its wired charging speeds. But it checks all the important boxes and then some.\nWhy we like it\nThe iPhone 16 and 16 Plus rank so high in our testing because the phones appeal to both novice users and power players a like. They offer about 90% of the experience of Apple's Pro models but cost hundreds of dollars less. Not only is the iPhone 16 a wonderful phone out of the box, Apple has a long track record of updating its software and security patches for years.\nWho it's best for\nWhen you think about how the Camera Control key, the Action button and the Dynamic Island come together, along with the camera and battery improvements Apple has made over the last several years, the iPhone 16 is a compelling upgrade for someone coming from an older iPhone, especially if that person is on an iPhone 13 or older. For those who don’t need the Pro’s extra photography prowess and battery life, the iPhone 16 won’t disappoint.\nWho shouldn’t get it\nI wouldn't recommend buying the iPhone 16 just for the Camera Control button or the better ultrawide camera.\nPros\n- Larger screens/thinner bezels\n- 4K slo-mo OMG\n- Audio Mix is brilliant\n- iOS 18\nCons\n- No Apple Intelligence out of the box\n- Camera Control placement not optimal for one-handed shooting\n- Elegant finishes aren't very colorful\n- Only 128GB of storage for $1,000\nThe iPhone 16 Pro and 16 Pro Max have everything I've come to expect in a year-over-year upgrade. The 6.3-inch iPhone 16 Pro and 6.9-inch iPhone 16 Pro Max have a slew of upgrades including one of the best batteries on any phone I've tested as well as. In our testing it will easily last a day on a single charge.\nThe phones also have larger displays, outstanding photo and video chops, high-resolution slo-mo, a new Camera Control button, iOS 18 goodies and a handful of Apple Intelligence tools. The negatives are as thin as the borders around the new screens: You only get 128GB of storage for $1,000; there are only drab color options, and a the new camera button is easy to tap accidentally. Read our full iPhone 16 Pro and 16 Pro Max review.\nWhy we like it\nThis year the 16 Pro and 16 Pro Max have the exact same cameras -- unlike the 15 Pro and 15 Pro Max, which had different telephoto options. Screen size, battery life and price should be the deciding factors when you're choosing between the two. The iPhone 16 Pro and Pro Max are excellent phones worthy of a spot in your pocket (and mine) if you can afford them.\nWho it's best for\nIf you have an iPhone 12 Pro or older, upgrading to the 16 Pro makes a lot of sense. If you're on a 13 Pro and still have a decent battery capacity, I'd say save your money. And if you're on a 14 Pro or 15 Pro, there's no need to upgrade. Also, I should note that the entry-level $999 iPhone 16 Pro only has 128GB of storage.\nWho shouldn't get it\nIf you are looking for a budget phone or don't need a phone with the latest features or tech.\nPros\n- Does most of the Apple stuff I want\n- Battery life is great\n- Matte finish back\n- The rear camera is good\n- A18 chip performance\nCons\n- $599 price isn't cheap\n- Odd value proposition\n- Lacks MagSafe\n- Screen is good, but wonder how it will age\nApple took a Taco Bell-like approach with the $599 iPhone 16E, mixing and matching parts and features from prior phones to create a \"new\" iPhone. Its design and screen are similar to the iPhone 14. Its A18 processor is the same as the one in the iPhone 16. In my testing, I found that this gives the iPhone 16E a weird value proposition. It's new, but it's old. It's affordable, but not cheap.\nIf you're rocking an iPhone SE, an iPhone 11 or older, the 16E will be a nice upgrade in every way, from the camera to the battery life -- though you might miss that ultrawide camera. I also think that this is a good phone for people using Android phones who want to switch and dip the proverbial toe into Apple's waters. I do recommend looking into carrier deals, discounts and trade-ins to drop that price a bit, unless you're set on doing an installment plan over a couple of years. Read our iPhone 16E review.\nWhy we like it\nAfter testing the iPhone 16E, I was most surprised by how wonderfully uneventful it was to use. Along with all the standard iOS 18 functions and goodies, like iMessage and FaceTime, I used Apple Intelligence, made calls on 5G, took a bunch of share-worthy photos and videos and played video games like Resident Evil 4. If this is all you want in an iPhone, look no further.\nWho it's best for\nIf you're rocking an iPhone SE, an iPhone 11 or older, the 16E will be a nice upgrade in every way, from the camera to the day plus battery life -- though you might miss that ultrawide camera. I also think that this is a good phone for people using Android phones who want to switch and dip the proverbial toe into Apple's waters.\nWho shouldn't get it\nChoosing between the $829 iPhone 16 and the $599 16E is a tough choice. If you have the budget, I'd go with the regular 16. You get a brighter screen, MagSafe, and an ultrawide camera that doubles as a macro lens -- great for taking close-up photos like of food since the main camera automatically switches to a cropped version of the ultrawide in order to nail focus.\nPros\n- USB-C port is more convenient charging\n- Colorful matte design\n- Improved camera that can automatically take people and pet portraits\n- Dynamic Island brings better multitasking\nCons\n- No always-on display\n- Find My Friends feature only works with other iPhone 15 phones\n- Discounted iPhone 14 Pro may be a better value\n- Galaxy S24 offers a longer optical zoom\nWith the launch of the iPhone 16, the regular iPhone 15 is being sold at a discount -- $100 off. That means that the iPhone 15 now starts at $699. And you might be able to find steeper discounts throughout the coming weeks and months. With the Dynamic Island, a USB-C port for more convenient charging and a high resolution camera and a sharper digital zoom, I found the iPhone 15 to be a significant upgrade for those with older iPhones.\nThe iPhone 15 is available in two size options: the 6.1-inch iPhone 15 and the 6.7-inch iPhone 15 Plus. They run on the same chip as iPhone 14 Pro, the A16 Bionic, which should bring notable performance upgrades to those with an iPhone that's several years old. These phones also have Apple's second-generation ultra wideband chip, enabling a new feature that makes it easier to find friends or family members in a crowd which I found handy. Read our full iPhone 15 review.\nWhy we like it\nThe iPhone 15 and 15 Plus are heavily influenced by the iPhone 14 Pro. That includes the Dynamic Island, a dedicated area near the top of the screen for viewing time-sensitive data like your Uber's ETA, and the A16 Bionic processor. Overall, these changes come together to make the iPhone 15 feel like a big step forward for those upgrading from an aging iPhone.\nWho it's best for\nThe iPhone 15 is for someone coming from an iPhone 12 or older. In 2025, Apple sells it for $699. But I recommend looking for one that's discounted. If you're contemplating the iPhone 16E but really want an ultrawide camera (remember the 16E only has a single rear camera) and MagSafe charging, then grab an iPhone 15.\nWho shouldn't get it\nApple sells the $599 iPhone 16E which makes the iPhone 15 a curious value. If you can score a discounted iPhone 15 I'd go that way. But otherwise, the iPhone 16E might be a better buy.\nThe iPhone 16 is the recipient of a CNET Editors' Choice award, and you can get one for free when you switch to T-Mobile. You just need to sign up for a qualified Experience Beyond Plan with up to four lines. There's no trade-in required, and T-Mobile will pay off your current eligible phone, up to $800, via a prepaid Mastercard. It’s never been easier to switch. (New line and port-in are required, and a $10 device activation charge applies.)\nBest iPhone models compared\n| Product | Apple iPhone 16 | Apple iPhone 16 Plus | Apple iPhone 16E | Apple iPhone 16 Pro | Apple iPhone 16 Pro Max | Apple iPhone 15 |\n|---|---|---|---|---|---|---|\n| Display size, tech, resolution, refresh rate | 6.1-inch OLED; 2,556 x 1,179 pixel resolution; 60Hz refresh rate | 6.7-inch OLED; 2,796 x 1,290 pixel resolution; 60Hz refresh rate | 6.1-inch OLED display; 2,532x1,170 pixels; 60Hz refresh rate | 6.3-inch OLED; 2,622 x 1,206 pixel resolution; 1-120Hz adapative refresh rate | 6.9-inch OLED; 2,868 x 1,320 pixel resolution; 1-120Hz adapative refresh rate | 6.1-inch OLED; 2,556x1,179 pixels; 60Hz refresh rate |\n| Pixel density | 460 ppi | 460 ppi | 460 ppi | 460 ppi | 460 ppi | 460 ppi |\n| Dimensions (inches) | 5.81 x 2.82 x 0.31 inches | 6.33 x 3.06 x 0.31 inches | 5.78 x 2.82 x 0.31 in. | 5.89 x 2.81 x 0.32 inches | 6.42 x 3.06 x 0.32 inches | 2.82x5.81x0.31 inches |\n| Dimensions (millimeters) | 147.6 x 71.6 x 7.8mm | 160.9 x 77.8 x 7.8mm | 146.7 x 71.5 x 7.8 mm | 149.6 x 71.5 x 8.25mm | 163 x 77.6 x 8.25mm | 71.6x147.6x7.8 mm |\n| Weight (grams, ounces) | 170 g (6 oz.) | 199 g (7.03 oz.) | 167g (5.88 oz.) | 199 g (7.03 oz.) | 227 g, (7.99 oz.) | 171g (6.02 oz.) |\n| Mobile software | iOS 18 | iOS 18 | iOS 18 | iOS 18 | iOS 18 | iOS 17 |\n| Camera | 48-megapixel (wide), 12-megapixel (ultrawide) | 48-megapixel (wide), 12-megapixel (ultrawide) | 48-megapixel (wide) | 48-megapixel (wide), 48-megapixel (ultrawide) 5x telephoto | 48-megapixel (wide), 48-megapixel (ultrawide) 5x telephoto | 48-megapixel (wide), 12-megapixel (ultrawide) |\n| Front-facing camera | 12-megapixel | 12-megapixel | 12-megapixel | 12-megapixel | 12-megapixel | 12-megapixel |\n| Video capture | 4K | 4K | 4K | 4K | 4K | 4K |\n| Processor | Apple A18 | Apple A18 | Apple A18 | Apple A18 Pro | Apple A18 Pro | Apple A16 Bionic |\n| RAM + storage | RAM N/A + 128GB, 256GB, 512GB | RAM N/A + 128GB, 256GB, 512GB | RAM unknown + 128GB, 256GB, 512GB | RAM N/A + 128GB, 256GB, 512GB, 1TB | RAM N/A + 256GB, 512GB, 1TB | RAM N/A + 128GB, 256GB, 512GB |\n| Expandable storage | None (Face ID) | None (Face ID) | None | None (Face ID) | None (Face ID) | None (Face ID) |\n| Battery | Up to 22 hours video playback; up to 18 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Up to 27 hours video playback; up to 24 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Up to 26 hours video playback, 21 hours streamed video playback, 90 hours of audio playback. 20W wired charging, 7.5W Qi wireless charging | Up to 27 hours video playback; up to 22 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Up to 33 hours video playback; up to 29 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Undisclosed; Apple claims up to 20 hours of video playback (16 hours streamed) |\n| Fingerprint sensor | None (Face ID) | None (Face ID) | None, Face ID | None (Face ID) | None (Face ID) | Face ID |\n| Connector | USB-C | USB-C | USB-C | USB-C | USB-C | USB-C |\n| Headphone jack | None | None | None | None | None | None |\n| US starting price | $799 (128GB) | $899 (128GB) | $599 (128GB) | $999 (128GB) | $1,199 (256GB) | $799 (128GB) |\n| UK starting price | £799 (128GB) | £899 (128GB) | £599 (128GB) | £999 (128GB) | £1,199 (256GB) | £799 (128GB) |\n| Australia starting price | AU$1,399 (128GB) | AU$1,599 (128GB) | AU$999 (128GB) | AU$1,799 (128GB) | AU$2,149 (256GB) | AU$1,499 (128GB) |\nRecent updates\nIn March 2025, we added the iPhone 16E to this list. The $599 price is more than Apple's previous cheap phone, the $429 iPhone SE, but it has a similar appeal especially for those currently on an older iPhone.\nFactors to consider when buying a new iPhone\nHold the iPhone first: You may love or hate the way it looks and feels in person.\nDon't discount the last year's model: Apple has a history of keeping recent iPhone models from previous years around at a lower price. You can get a great phone that does almost everything that a new iPhone 16 can do for a fraction of the price. The iPhone 15 packs a great camera and a big battery, but comes at a more reasonable price.\nBuy an iPhone case and screen protector: You'll protect your iPhone from costly damage, and will increase the phone's resale or trade-in value for when you're ready to move on.\nKnow what you care about most: Is it screen size? Camera quality? Battery life? Phones like the iPhone 15 Pro or Pro Max, for example, pack incredible cameras that almost rival the quality you'd get from a DSLR. If you're a photographer, then spending money here is a good idea.\nSeek out holiday discounts: Look for deep discounts and promo deals around major holidays, especially Amazon's Prime Day and Cyber Monday. And find out what your grace period is in case you need a quick return or exchange.\nHow we test iPhone models\nWe test every iPhone in real-world scenarios focusing on its features, design, performance, cameras, battery life and overall value. We document our findings in an initial review that is periodically updated when there are new iOS updates or to compare against new phones from competitors like Samsung, Google and OnePlus.\nPhotography\nPhotography is a major focus for the iPhone, so we take pictures and videos of various subjects in a variety of settings and lighting scenarios. We try out any new camera modes, such as 4K 120fps slow-mo video that debuted with the iPhone 16 Pro and 16 Pro Max.\nBattery life\nBattery testing is conducted in a variety of ways. We assess how long the iPhone lasts during a typical day of use, and note how it performs during more focused sessions of video calls, media streaming and gaming. We also conduct a video playback test and a 45-minute drain test starting with a full battery, which isn't always included in the initial review and added later in an update.\nPerformance measuring\nWe use benchmarking apps to measure the performance, alongside our own anecdotal experiences using the phone for our review. Of particular note are how graphics and animations look. Are they smooth? Or do they lag or stutter? We also look at how quickly the phone switches between horizontal and vertical orientations and how fast the camera app opens and is ready to take a photo.\nWe perform processor-heavy tasks like editing photos and videos, exporting videos and playing games. We evaluate whether a newer version of the iPhone includes enough features to make it worth upgrading from older models. Some of these tests are added later in updates after the initial review is published.\nRead more: How CNET Tests Phones\nOther iPhones we tested\nWhile Apple doesn't sell the iPhone 15 Pro, you can still find it at carriers and third-party retailers. The 15 Pro has a 6.1-inch adaptive-refresh rate screen that adjusts between 1-120Hz depending on what's on the screen. It has excellent cameras, a fast processor, an always-on display, supports iOS 18 and safety features like Crash Detection and Emergency SOS via Satellite. Driving all these upgrades is Apple's A17 Pro chip which in use feels peppy. The iPhone 15 Pro is still an excellent phone in 2025. Check out our iPhone 15 Pro review.\nKey terms\neSIM\nAn eSIM takes all of the important information about your phone account -- including its number, wireless carrier and subscription -- and stores it in software instead of on a physical SIM card.\nWith the iPhone 14, 15 and 16 series Apple removed the physical SIM card tray and embraced embedded SIM cards in the US. This means you can't just pluck your SIM card out of your current phone and put it into a new one. But this shouldn't affect your experience since all the major US carriers and a number of smaller operators work with eSIM.\nApple has long supported eSIM, dating back to 2018's iPhone XS, XS Max and XR. When setting up a new iPhone 14, 15 or 16, tthe device will guide you through transferring your current provider over to the new phone. A list of supported wireless networks can be found on Apple's website.\niOS 18\nApple's iOS 18 is the latest iPhone software version. It's on the iPhone 16 by default and is also available as an update for the iPhone XR and later. iOS 18 includes new features such as being able to move apps anywhere on your home screen, change an app icon's color and a size, add buttons to Control Center, use emoji and live photo stickers as Tapbacks in Messages, support for RCS in messages and eventually Apple Intelligence on some models.\niPhone FAQs\nWhen is the best time of year to buy a new iPhone?\niPhone or Android?\nShould I wait for the new iPhone model (iPhone 17)?\nHow reliable is an iPhone?\nHow long does an iPhone last?\nWhat to look forward to in 2025\nThere's already been plenty of buzz about what we could see with the next iPhone, likely called the iPhone 17 -- from a slimmer version of the upcoming device to a new screen with a higher refresh rate on baseline models. The camera module could also get a makeover, and reports suggest Apple will overhaul the look and feel of its software with the launch of iOS 19. Apple doesn't release details on future products, but to get an idea of what to expect, we rounded up rumors, leaks and analysis on the iPhone 17 Air (one of several nicknames for Apple's next iPhone). Read CNET's iPhone 17 rumor roundup for more info."
    },
    {
      "url": "https://www.cnet.com/reviews/apple-iphone-5c-review/",
      "text": "Editors' note (September 19, 2014): The iPhone 6 and iPhone 6 Plus are now the flagship phones in Apple's 2014-2015 product line. However, in addition to theiPhone 5S, Apple is also still sellingthe iPhone 5C -- but only in a single 8GB capacity, down from its original 16GB and 32GB models. It's priced at $450 in the US (\"free\" with a 2-year contract), £319 in the UK, and AU$529 in Australia. If you can't find an older 16GB or higher model available for sale, the paltry 8GB capacity makes this 2014 update of the 5C tougher to recommend.\nThe Good\nThe Bad\nThe Bottom Line\nThe iPhone 5C is kinda, sorta, technically a new product -- colorful, cute, with a variety of interchangeable color cases much like the recently released\nTo be clear, we loved the iPhone 5 when it first hit in 2012. It met every one of our needs, kept up with the competition, and presented a sweet spot of features: fast LTE wireless, a larger 4-inch screen, plenty of performance tweaks, a faster processor, and a really great camera. All of those features are back with the 5C.\nThe only new additions to the 5C (versus the old 5) are\nWhat the iPhone 5C isn't is a radical \"budget\" iPhone. It's not the affordable contract-free prepaid device some dreamed of. Instead, it's an iPhone 5 with a candy-colored polycarbonate shell. If you want something more advanced under the hood, the\nStill, despite largely year-old tech inside, the iPhone 5C does a fine job for most people. Don't be surprised if it's a go-to choice for kids, for instance, who may value the color choices (and parents looking to get out of the store for less than $100.) It's the Basic White MacBook of iPhones. And, for everyday tasks, you'll have a hard time right now noticing the performance gap between it and the 5S with the naked eye. That's likely to change in a few months or a year, as Apple evolves iOS computing to areas where, perhaps, only the bleeding-edge 64-bit A7 chip in the iPhone 5S can reach. But for everyday people who aren't following every evolutionary step of the iPhone, the 5C covers most of the important bases. Just make sure you set your expectations to \"last year's iPhone 5.\"\nEditors' note (September 19, 2013): Call quality section with audio sample added. We will continue to update this review in the coming days, based on subsequent testing. Ratings should be considered tentative, and may evolve as testing continues.\nConfigurations and carriers\nThe iPhone 5C comes in 16GB and 32GB variations, for $99 and $199 on contract, respectively, or contract-free for $549 and $649. That's a hundred dollars less than an iPhone 5S at identical storage capacities across the board. In the US, the 5C is available on all four major carriers: AT&T, Sprint, Verizon, and T-Mobile. And T-Mobile's new \"Uncarrier\" model lets you buy the phone for zero (16GB) or $99 (32GB) down and spread the cost of the hardware over a two-year period, for $20 extra a month.\nThe 5C not only looks more like an iPod Touch, it even comes packaged in an iPod Touch-like jewel box with clear plastic. Inside you get the phone, a Lightning cable (with AC adapter), and pair of EarPod in-ear headphones with a built-in mic.\nWhat do you give up over the 5S?\nThis is the question everyone's going to ask: what am I missing out on between the iPhone 5C and 5S for that extra hundred dollars? For starters, the 5S has that crisp metal design. It also has a newer, faster A7 processor, a fingerprint-sensing Home button, an even better camera with faster autofocus, burst shooting, better low-light and antiblur features, and a Slow-Mo video recording mode that records at 120 frames per second at 720p. What's more, the 5S is capable of 64-bit computing, has better graphics, and has an M7 processor for enabling future built-in motion-tracking and health/fitness apps. And it's also available in a 64GB capacity, versus just 16GB or 32GB for the 5C.\nA lot of those features are theoretical, or embedded so deeply the casual person wouldn't notice. The 5C and 5S have the same screen size and Retina resolution, and the same LTE antenna bands. Those are features most people will notice a lot more. The 5C, from an everyday boot-up, application-loading standpoint, feels similar to the 5S. That said, I wouldn't be surprised to see the phones' speed begin to diverge as the months and years progress -- once more advanced apps begin to appear that are optimized for the more sophisticated hardware of the 5S.\nDesign\nA brightly colored plastic iPhone: it sounds like something new, doesn't it? Not exactly: Apple's had brightly colored iPods for years, and the iPod Touch got its multicolored refresh in 2012. The iPhone 5C just feels like the extension of that bright-color philosophy into the iPhone line.\nIt doesn't feel like cheap plastic, though; the smooth, shiny polycarbonate shell around the back feels like a candy lacquer coating. It's a dense device, heavier than the iPhone 5 by nearly an ounce, but it has a comfortable feel -- maybe even better than the more hard-angled metal iPhone 5/5S. It's a return to the plastic iPhone, three years later.\nThe funny thing is, pull out an old iPhone 3G or 3GS and you'll see a remarkably similar finish. The 3GS looks bulbous and squat by comparison -- the 5C is flat-backed and longer, but it shares the wrap-around polycarbonate feel. This is not new so much as old and familiar.\nThe cosmetic differences between the 5C and the 5S feel like the old white MacBook versus the MacBook Pro line: plastic versus metal. Maybe this is meant to paint the iPhone 5S as a \"pro\" device. The 5C is comfortable, smooth and clean; the 5 and 5S have an angular, descended-from-a-spaceship industrial design.\nThe 5C is a hair longer (4.9 versus 4.87 inches), a hair wider (2.33 versus 2.31 inches), and a little thicker (0.35 versus 0.3 inches) than the iPhone 5 and 5S. What this really means is you can't put most iPhone 5 cases on it.\nIt's also heavier: 4.65 ounces, versus the iPhone 5S' 3.95 ounces. But it's still a little thinner and lighter than the iPhone 4S, if you're keeping score.\nJust like the iPhone 5 and 5S, the headphone jack's on the bottom. Audio comes from a small four-holed grille on the bottom, and is as loud as that from the iPhone 5. The home button below the display remains exactly the same as previous iPhones: there's no fingerprint sensor here.\nThe iPhone 5C will be a far more appealing phone for kids: it seems less fragile, warmer, even simpler. It feels like an iPod: even the side volume rocker buttons are more elongated and iPod Touch-like. The colors are bright and oddly pastel, except for the white-backed 5C I ended up reviewing. All the iPhone 5Cs, incidentally, have black fronts. iOS 7 comes preinstalled with color-matched wallpaper and themes for each phone, which helps tie the whole color package together. The EarPods...well, those are still white.\nCase and accessories\nA new design means new cases: Apple's selling its own, at $29 each, in a variety of bright colors, made of the same polyurethane/microfiber material as the iPad Smart Covers and Smart Cases. The bright cases are attractive; they're punched with large holes, so the iPhone's colors and the case colors play off each other for color combinations. You can only imagine third-party case manufacturers are going to be all over this type of idea.\nApple's own cases are comfy, but oddly designed: the open holes expose some of the stamped FCC and model information on the back of the iPhone. Peeking at bits of text ruins a bit of the ultra-clean effect. Why not shift those holes higher up, or place the text elsewhere? It's nitpicky, but Apple's design usually prides itself on these sorts of details.\nDisplay and speakers\nThe iPhone 5C's 4-inch, 1,136x640-pixel Retina Display seems every bit as bright and crisp as on the iPhone 5. But, it's also the same exact display: no extra pixel resolution, no added screen size. In a world of ever-larger smartphones, the iPhone 5C is more on its own now than it would have been in 2012. There's a lot of extra unused space above and below the screen.\nThat being said, Apple's iPhone 5 Retina Display remains one of the brightest and most color-accurate displays CNET's tested. It's an excellent display, and has very good 326 ppi pixel density. It could just be...well, a little bigger. There are 4.3- and 4.7-inch-display Android phones that don't feel honkingly large to hold, and perhaps show how Apple could have worked in a little extra screen.\nA single speaker to the right of the Lightning port pumps out equivalently loud audio to the iPhone 5. Just like previous iPhones, it's possible to accidentally bottle up all noise by pressing a thumb to the speaker grille while playing a game or watching a movie.\nCamera\nThe same iSight rear-facing 8-megapixel camera that was in the iPhone 5 is in the 5C. iOS 7 adds a few more extras, such as digital zoom when recording video. Both 1080p video recording, photos and panoramic pictures all look great, but the iPhone 5S camera is even more refined, and adds slow-motion recording and multiburst.\nA front-facing FaceTime HD camera has been slightly improved, adding better light sensitivity. Dimly lit selfies in my apartment hallway came out better on the 5C.\nAre there better cameras on phones? Absolutely. However, at this price range, the iPhone 5 still does a very, very good job.\nAntenna and wireless connectivity\nThe iPhone 5C has dual-band 802.11 a/b/g/n Wi-Fi, just like the iPhone 5, along with Bluetooth 4.0. Apple's AirDrop technology in iOS 7 allows for local file sharing, perhaps minimizing the omission of NFC in the iPhone, but it's worth noting that NFC still isn't in any Apple device. Both the iPhone 5C and 5S also lack faster 802.11ac Wi-Fi, which has been introduced in many products, including 2013 MacBook Airs and AirPort routers. Also, note that like the iPhone 5, the CDMA iPhone 5C (so, the Verizon and Sprint versions) do not support simultaneous voice and data.\nCall quality\nNot a surprise, but the iPhone 5C's call quality seems equivalent to the iPhone 5 and 5S. That's good to know, since the 5C sports a slightly different antenna construction than the 5/5S, but network reception and audio quality seem on par.\nI tried making a sample call on my AT&T review unit to a land line answering machine for an audio sample: you can hear it below.\niPhone 5C call quality sample\nListen now:\nFaceTime Audio (available via iOS 7) calls made over Wi-Fi sounded far clearer, more like Skype audio. I predict that a lot of people will start moving to FaceTime audio, both for call quality and potential long distance call savings.\niOS 7\nBoth the iPhone 5C and 5S come preinstalled with iOS 7, Apple's latest version of the mobile operating system. Much like the iPhone 5 was to iPhone hardware last year, iOS 7 is a soup-to-nuts graphical and design overhaul: familiar apps have new layouts, Siri's been greatly enhanced to do more and show more, and there are even new ringtones and alert sounds.\nAs an operating system, iOS 7 runs smoothly on the iPhone 5C, but its aesthetics sometimes feel like a mixed bag. New display-maximizing layouts in many apps like Safari are a huge plus, but these come along with sometimes-confusing new interfaces and menus. Much like a Facebook redesign, I think many longtime users will find themselves suddenly (and hopefully temporarily) confused. Some additions, like an expanded Notifications pull-down screen, are welcome; others, like a new, confusing Calendar app that lacks appointment lists, will throw hard-core iPhone users off their game.\nLuckily, iOS 7 does have its distinct advantages: AirDrop for local person-to-person wireless file sharing; crisp and excellent-sounding FaceTime Audio calls, which don't use up much bandwidth and can be used to make calls over Wi-Fi for free; and also the brilliant flip-up Control Panel, which puts many necessary settings and controls at your fingertips at any time. Siri's smarter and can do more things, like turn on Bluetooth or play requested movie trailers.\nRedesigned Camera and Photo apps are part of the iOS 7 package, as well, and both feel like big improvements. Digital zoom for video and added photo filters, plus an Instagram-esque \"square\" photo-crop mode, come built-in. The Photo app presents previous photos in a large timeline organized by year and location. It's a great way to sift through thousands of photos, but this level of presentation feels better-suited to a Mac version of iPhoto. That archive-style presentation would be a lot better if iCloud enabled full syncing and uploading of Mac/PC photo libraries.\nApple's also offering its core suite of iWork and GarageBand/iMovie iOS apps for free with new device purchases, a nice little package of tools that finally gives iOS devices the type of productivity software that's increasingly being bundled on competing mobile products.\nThe A6 processor, revisited\nCompared to most cutting-edge phones in 2013, the iPhone 5's once bleeding-edge dual-core A6 processor doesn't feel quite as amazing. It still tested well in the benchmarks we used, but it's the iPhone 5S with its 64-bit dual-core A7 processor that makes the leap the iPhone 5 did last year. Across GeekBench 3, Linpack, 3DMark and Sunspider tests, the iPhone 5C looks like the same phone as the iPhone 5...which it is. Most tests show it performing at about half the speed of the iPhone 5S' A7 processor, though, and some more recent Android phones may outperform it.\nThe A6 remains an excellent processor for handling nearly every iPhone user's need, and is capable of impressive graphics. And, keep in mind, the iPhone 5C has a more powerful processor than the fifth-gen iPod Touch and 2012 iPad Mini, both of which use the older A5 instead.\n(Longer bars indicate better performance)\n(Longer bars indicate better performance)\nBattery life\nApple claims there's a slightly larger battery in the 5C versus last year's 5. Using a video-playback battery drain at half-brightness and airplane mode turned on, it lasted 10 hours and 16 minutes via the first run, which is better than the iPhone 5. Stay tuned for final battery results.\nFully charged in the morning, the 5C lasted me most of a full day. It's not a super battery by any means, but it gets the job done.\nThe iPhone 5C versus the $99 competition\nThere are a lot of very good phones falling into the $99-with-a-new-contract territory. The\nThe iPhone 5C, equipped one of the best digital imaging systems to ever grace a smartphone (at least until the iPhone 5S), can also capture photos and video of comparable quality with Android's heavy hitters from Samsung, HTC, and Motorola. Now factor in the 5C's low $99 price and that's when things really get interesting. Its closest competitors -- namely the Droid Mini ($99.99, Verizon) and the One Mini ($99.99, AT&T) -- make more compromises than the 5C to reach the same price. For instance, while the 5C has the same Retina display as the 5S, both the One Mini and Droid Mini have inferior displays when compared with their full-size counterparts. At least the One Mini flaunts an aluminum-build quality, arguably better than the iPhone 5C's premium polycarbonate chassis, but the Droid Mini's cheap plastic design wouldn't impress anyone.\nWho is this phone for?\nMuch like the White MacBook was to Apple laptops, the iPhone 5C feels like a perfect cover-all-your-needs smartphone, offering the average person a complete set of tools to get everything done. The extras on the iPhone 5S aren't necessarily ones you'll miss: unlike like last year's leap from the iPhone 4S to iPhone 5, all the basic requirements are covered.\nOf course, a $99 iPhone isn't anything new. Apple's been selling \"last year's iPhones\" for years at a hundred-dollar discount alongside whatever new versions are sold. For the past 12 months, 2011's\nThose who don't care about the latest and greatest graphics or camera quality, or are due for an upgrade -- like my mom -- would be a perfect fit for the iPhone 5C. It's a good year to make an upgrade if you haven't done so recently, because both the 5C and 5S are very polished phones.\nBut if you own an iPhone 5, you already have a 5C in metal. And you certainly don't need to upgrade.\nIncidentally, I tried to convince my mom to get the iPhone 5C, until I realized that she upgrades so infrequently, and uses her phone so much as a camera for getting snapshots of her grandkids, that the iPhone 5S is probably worth her extra $100 investment. So might the argument go for many. But, more than before, Apple's new step-down iPhone is a great destination for newcomers. It feels like the new baseline for the mainstream iPhone. The 5S is the \"pro\" model with technologies that need to be worked out; the 5C has less to bank on.\nIn the end, I steered my mom to the iPhone 5S. You should too, unless you really, truly need to save a hundred dollars. In that case -- or in the event you really love brightly colored plastic -- get the iPhone 5C. Apple may not have set the global smartphone world on fire, but the 5C is another small step toward a more affordable iPhone. And if I were to pick an iPhone that wasn't cutting-edge but still had everything most people needed to do everything they wanted, the iPhone 5C is it."
    },
    {
      "url": "https://www.apple.com/newsroom/2023/09/apple-unveils-iphone-15-pro-and-iphone-15-pro-max/",
      "text": "PRESS RELEASE\nSeptember 12, 2023\nApple unveils iPhone 15 Pro and iPhone 15 Pro Max\nFeaturing a strong and lightweight titanium design with new contoured edges, a new Action button, powerful camera upgrades, and A17 Pro for next-level performance and mobile gaming\nCUPERTINO, CALIFORNIA Apple today debuted iPhone 15 Pro and iPhone 15 Pro Max, designed with aerospace-grade titanium that’s strong yet lightweight to deliver Apple’s lightest Pro models ever. The new design also features contoured edges and a customizable Action button, allowing users to personalize their iPhone experience. Powerful camera upgrades enable the equivalent of seven pro lenses with incredible image quality, including a more advanced 48MP Main camera system that now supports the new super-high-resolution 24MP default, the next generation of portraits with Focus and Depth Control, improvements to Night mode and Smart HDR, and an all-new 5x Telephoto camera exclusively on iPhone 15 Pro Max. A17 Pro unlocks next-level gaming experiences and pro performance. The new USB‑C connector is supercharged with USB 3 speeds — up to 20x faster than USB 2 — and together with new video formats, enables powerful pro workflows that were not possible before.1 And with the addition of Roadside Assistance via satellite, the iPhone 15 Pro lineup builds on Apple’s innovative satellite infrastructure to connect users to help if they have car trouble while off the grid.\niPhone 15 Pro and iPhone 15 Pro Max will be available in four stunning new finishes, including black titanium, white titanium, blue titanium, and natural titanium. Pre-orders begin Friday, September 15, with availability beginning Friday, September 22.\n“This is the most pro lineup we have ever created, with a state-of-the-art titanium design, the best iPhone camera system yet that enables game-changing new workflows, and the A17 Pro chip, which ushers in a new chapter of performance and games never before seen on iPhone,” said Greg Joswiak, Apple’s senior vice president of Worldwide Marketing. “iPhone 15 Pro and iPhone 15 Pro Max represent the best of Apple design and industry-first innovations to help enrich the everyday experiences of our users, while enabling them to unleash their creativity.”\nA Stunning, Lightweight, and Durable Design\nAvailable in 6.1-inch and 6.7-inch display sizes,2 iPhone 15 Pro and iPhone 15 Pro Max feature a strong and lightweight titanium design — a first for iPhone. This premium alloy — the same used in spacecraft — has one of the highest strength-to-weight ratios of any metal, making this Apple’s lightest Pro lineup ever. Both models feature a new refined brush texture, contoured edges, and the thinnest borders on iPhone. The Pro lineup is built to last, combining the strength of titanium with the toughest back glass in a smartphone and the industry-leading Ceramic Shield on the front. Using an industry-first thermo-mechanical process, the titanium bands encase a new substructure made from 100 percent recycled aluminum, bonding these two metals with incredible strength through solid-state diffusion. The aluminum frame helps with thermal dissipation and allows the back glass to be easily replaced. This new design highlights the Super Retina XDR display with Always-On and ProMotion technologies for an exceptional viewing experience.\nThe all-new Action button replaces the single-function switch used to toggle between ring and silent, offering additional options so users can choose between quickly accessing the camera or flashlight; activating Voice Memos, Focus, Translate,3 and accessibility features like Magnifier; or using Shortcuts for more options. A press-and-hold gesture with fine-tuned haptic feedback and visual cues in the Dynamic Island ensure the new button launches the intended action.\nA17 Pro: A New Generation of Apple Silicon for iPhone\nBringing pro performance and capabilities, iPhone 15 Pro and iPhone 15 Pro Max are powered by A17 Pro, the industry’s first 3-nanometer chip. Continuing Apple’s leadership in smartphone silicon, A17 Pro brings improvements to the entire chip, including the biggest GPU redesign in Apple’s history. The new CPU is up to 10 percent faster with microarchitectural and design improvements, and the Neural Engine is now up to 2x faster, powering features like autocorrect and Personal Voice in iOS 17. The pro-class GPU is up to 20 percent faster and unlocks entirely new experiences, featuring a new 6-core design that increases peak performance and energy efficiency. Now with hardware-accelerated ray tracing — which is 4x faster than software-based ray tracing — iPhone 15 Pro offers smoother graphics, as well as more immersive AR applications and gaming experiences. iPhone 15 Pro brings true-to-life gaming to the palm of users’ hands with console titles never before seen on a smartphone, like Resident Evil Village, Resident Evil 4, DEATH STRANDING DIRECTOR’S CUT, and Assassin’s Creed Mirage.4\nA17 Pro includes a dedicated AV1 decoder, enabling more efficient, high-quality video experiences for streaming services. Additionally, a new USB controller enables USB 3 speeds on iPhone for the first time, now supporting much higher transfer speeds and video output up to 4K at 60 fps HDR.\nA Powerful Pro Camera System for More Creative Control\nThrough a deep integration of hardware and software, the advanced camera systems on iPhone 15 Pro and iPhone 15 Pro Max both pack the equivalent of seven pro lenses — all enabled by A17 Pro. With the power of computational photography, the 48MP Main camera, built exclusively for the Pro lineup, gives users even more flexibility with a new 24MP super-high-resolution default, offering incredible image quality at a practical file size ideal for storing and sharing. The Main camera allows users to switch between three popular focal lengths — 24 mm, 28 mm, and 35 mm — and even choose one as a new default. In addition to 48MP ProRAW, the Main camera also supports 48MP HEIF images with 4x more resolution. iPhone 15 Pro features an expansive 3x Telephoto camera, and iPhone 15 Pro Max provides the longest optical zoom ever on iPhone: 5x at 120 mm. Great for close-ups, wildlife photos, and catching the action from further distances, the new Telephoto camera on iPhone 15 Pro Max has an innovative tetraprism design with a combined optical image stabilization and autofocus 3D sensor-shift module, Apple’s most advanced stabilization system yet.\nNext-generation portraits on iPhone 15 Pro and iPhone 15 Pro Max feature sharper detail, more vivid colors, and better low-light performance. For the first time, users can take portraits without having to switch to Portrait mode. When there’s a person, dog, or cat in the frame, or when a user taps to focus, iPhone automatically captures depth information, so users can turn photos into stunning portraits later in the Photos app on iPhone, iPad, or Mac. For greater creative control, users can also adjust the focus point after the photo has been taken.\nAdditional features that benefit all cameras on iPhone 15 Pro and iPhone 15 Pro Max include:\n- Night mode gets better with sharper details and more vivid colors, now powered by the Photonic Engine, including Night mode portraits, enabled by the LiDAR scanner.\n- New Smart HDR captures subjects and the background with more true-to-life renderings of skin tones, while ensuring photos have brighter highlights, richer midtones, and deeper shadows when viewed in the Photos app. This advanced HDR rendering is also available to third-party apps, so images can look even better when shared online.\n- The best quality video in a smartphone is upgraded thanks to A17 Pro, with improvements in low-light video and Action mode.\nThe preferred smartphone for creative pros and filmmakers gets even better with new pro workflows. Users can now get up to 20x faster transfer speeds with an optional USB 3 cable. iPhone and third-party solutions like Capture One also help photographers create a pro studio, allowing them to shoot and instantly transfer 48MP ProRAW images from iPhone to Mac. ProRes video can be recorded directly to external storage, enabling higher recording options up to 4K at 60 fps, and greater flexibility on set when using iPhone as the main camera. iPhone 15 Pro also introduces a new option for Log encoding and is the first smartphone in the world to support ACES, the Academy Color Encoding System, a global standard for color workflows.\nComing later this year, iPhone 15 Pro will add a new dimension to video capture with the ability to record spatial video for Apple Vision Pro. Users will be able to capture precious moments in three dimensions and relive those memories with incredible depth on Apple Vision Pro when it is available early next year in the U.S.\nNext-Level Wireless Performance and Connectivity\nThe iPhone 15 Pro lineup offers convenient new ways to charge, find friends in busy places, and stay connected while traveling. Both models use the USB‑C connector, a universally accepted standard for charging and transferring data, allowing the same cable to charge iPhone, Mac, iPad, and the updated AirPods Pro (2nd generation). Users can also charge AirPods or Apple Watch directly from iPhone with the USB‑C connector. iPhone 15 Pro and iPhone 15 Pro Max support USB 3 for data transfer speeds up to 10 gigabits per second, up to 20x faster than before.\nBoth models feature the second-generation Ultra Wideband chip, enabling two iPhone devices with this chip to connect at three times the range as before. This opens up a new way to use Precision Finding for Find My friends, so iPhone 15 users can share their location and find each other, even in crowds. Precision Finding is built with the same privacy protections that users have come to trust in Find My.5\niPhone 15 Pro and iPhone 15 Pro Max now support Wi-Fi 6E for greater wireless performance, including up to 2x faster speeds, and introduce the first Thread-enabled smartphones, opening up future opportunities for Home app integrations.\niPhone 15 Pro and iPhone 15 Pro Max come equipped with super-fast 5G,6 and include:\n- Support for MagSafe and future Qi2 wireless charging.\n- Improved audio quality on phone calls, including those made on FaceTime or third-party apps. Sound quality gets even better when users select Voice Isolation, so conversations come through loud and clear, even if they are somewhere noisy.\n- eSIM with support from more than 295 carriers. When traveling the world, users can stay connected through affordable international roaming plans from their existing carrier, or purchase prepaid eSIM plans in over 50 countries and regions, including Australia, Italy, Thailand, and more.\nExpanded Safety Capabilities for Peace of Mind\nThe iPhone 15 lineup offers critical safety capabilities to provide assistance when it matters most, including Crash Detection7 and Emergency SOS via satellite.8 Currently available in 14 countries and regions on three continents, Emergency SOS via satellite has made a significant impact in users’ lives. This groundbreaking service will come to Spain and Switzerland later this month.\nBuilding on this innovative satellite infrastructure, iPhone 15 Pro and iPhone 15 Pro Max introduce Roadside Assistance via satellite. Beginning in the U.S., when a user has car trouble and cellular and Wi-Fi coverage are not available, they can now connect to AAA, the country’s largest roadside assistance provider.9 An intuitive interface, including a short questionnaire to capture important details, will transmit the information via satellite so AAA can message with the user directly and dispatch help to their exact location. Access to Roadside Assistance via satellite will be included for free for two years. Service is covered according to AAA membership, but is also available separately for nonmembers.10\nFeaturing iOS 17\niPhone 15 Pro and iPhone 15 Pro Max feature iOS 17,11 making iPhone even more personal and intuitive with new features:\n- The Phone app gets major updates, with Contact Posters that allow users to customize how they appear to their contacts, and Live Voicemail, which leverages the power of A17 Pro to see real-time on-device transcription as someone leaves a voicemail. Users can even pick up the call while the caller is leaving their message.\n- Messages gets a new stickers experience, more powerful search, transcription of audio messages, and Check In, which allows users to automatically notify friends and family when they have made it to their destination safely.\n- NameDrop gives users a new way to use AirDrop to more easily share contact information by simply bringing two iPhone devices together. The same gesture can be used to AirDrop content and more, and now users can step away from each other and finish sending large files over the internet.12\n- StandBy gives users a customizable full-screen experience with glanceable information designed to be viewed from a distance when iPhone is on its side and charging. With the Always-On display of iPhone 15 Pro and iPhone 15 Pro Max, StandBy stays on to show useful information — perfect on a desk, nightstand, or kitchen counter.\n- Interactive widgets on the Home Screen, Lock Screen, and in StandBy allow users to take action with just a tap, making it easy to complete a to-do, or play or pause a song right from the widget.\n- Safari adds greater protection for Private Browsing and introduces profiles, helping users separate their browsing for topics like work and personal.\niOS 17 delivers many more updates, including Journal,13 a new app that helps iPhone users reflect and practice gratitude through journaling, improvements to autocorrect and Dictation that make entering text faster and easier than ever before, password and passkey sharing with iCloud Keychain, and much more.\nBetter for the Environment\niPhone 15 Pro and iPhone 15 Pro Max are designed with the environment in mind. As Apple continues to work toward its 2030 goal of making every product carbon neutral — from design to manufacturing to customer use — the company is prioritizing clean electricity across the entire supply chain and designing products with recycled and other low-carbon materials. iPhone 15 Pro and iPhone 15 Pro Max now use more recycled content, with a 100 percent recycled aluminum substructure and 100 percent recycled cobalt in the battery — both firsts for Apple. iPhone 15 Pro and iPhone 15 Pro Max also include 100 percent recycled rare earth elements in all magnets and 100 percent recycled gold in the USB‑C connector as well as the gold plating and tin soldering in multiple printed circuit boards. Both models meet Apple’s high standards for energy efficiency and are free of mercury, PVC, and beryllium. Over 99 percent of the packaging is fiber-based, bringing Apple closer to its goal of completely removing plastic from its packaging by 2025.\nTo further reduce impact on the planet, Apple will no longer use leather in any new Apple products, including iPhone accessories. Apple is introducing a new FineWoven Case with MagSafe and FineWoven Wallet with MagSafe, made from a durable and elegant microtwill with a soft, suedelike feel. The material is made from 68 percent post-consumer recycled content and has significantly lower carbon emissions compared to leather.\nPricing and Availability\n- iPhone 15 Pro and iPhone 15 Pro Max will be available in black titanium, white titanium, blue titanium, and natural titanium finishes. iPhone 15 Pro remains at the same starting price of $999 (U.S.) or $41.62 (U.S.) per month, available in 128GB, 256GB, 512GB, and 1TB storage capacities. iPhone 15 Pro Max starts at $1,199 (U.S.) or $49.95 (U.S.) per month, available in 256GB, 512GB, and 1TB storage capacities.\n- Apple offers great ways to save and upgrade to the latest iPhone. Customers in the U.S. can get $200-$650 (U.S.) in credit when they trade in an iPhone 11 or later and upgrade to iPhone 15 Pro or iPhone 15 Pro Max by visiting the Apple Store Online, or at an Apple Store location. To see what their device is worth and for terms and conditions, customers can visit apple.com/shop/trade-in.\n- Customers can get iPhone 15 Pro for as low as $0 (U.S.) after a qualifying trade-in with select U.S. carriers. For eligibility requirements and more details, see apple.com/shop/buy-iphone/carrier-offers.\n- Customers in more than 40 countries and regions, including Australia, Canada, China, France, Germany, India, Japan, Mexico, the UAE, the U.K., and the U.S., will be able to pre-order iPhone 15 Pro and iPhone 15 Pro Max beginning at 5 a.m. PDT this Friday, September 15, with availability beginning Friday, September 22.\n- iPhone 15 Pro and iPhone 15 Pro Max will be available in Macao, Malaysia, Türkiye, Vietnam, and 17 other countries and regions beginning Friday, September 29.\n- FineWoven Wallet with MagSafe and FineWoven Case with MagSafe will both be available for $59 (U.S.) in five new colors for the iPhone 15 lineup: black, taupe, mulberry, pacific blue, and evergreen. In addition to the iPhone 15 Pro and iPhone 15 Pro Max Clear Case, available for $49 (U.S.), a Silicone Case with MagSafe will be available for $49 (U.S.) in black, storm blue, clay, light pink, guava, orange sorbet, cypress, and winter blue.\n- iOS 17 will be available as a free software update on Monday, September 18.\n- Beginning September 18, iCloud+ will offer two new plans: 6TB for $29.99 (U.S.) per month and 12TB for $59.99 (U.S.) per month, providing additional storage to keep files, photos, videos, and more safe, accessible, and easy to share. The new plans are great for users with large photo and video libraries or those using Family Sharing, and will provide access to premium features, including Private Relay, Hide My Email, Custom Email Domains, and HomeKit Secure Video support.\n- Customers who purchase iPhone 15 Pro and iPhone 15 Pro Max will receive three free months of Apple Arcade and Apple Fitness+ with a new subscription.\nShare article\nMedia\n-\nText of this article\n-\nImages in this article\n- Requires a USB 3 cable with 10Gb/s speeds.\n- The display has rounded corners that follow a beautiful curved design, and these corners are within a standard rectangle. When measured as a standard rectangular shape, the screen is 6.12 inches (iPhone 15 Pro), or 6.69 inches (iPhone 15 Pro Max) diagonally. The actual viewable area is smaller.\n- Translate is coming to the Action button later this year.\n- Resident Evil Village, Resident Evil 4, and DEATH STRANDING DIRECTOR’S CUT are coming to iPhone 15 Pro and iPhone 15 Pro Max later this year. Assassin’s Creed Mirage will be available in the first half of 2024.\n- Precision Finding for Find My friends requires Ultra Wideband and isn’t available in all countries or regions. With iOS 17, Precision Finding will be available to iPhone 15, iPhone 15 Plus, iPhone 15 Pro, or iPhone 15 Pro Max.\n- A data plan is required. 5G, Gigabit LTE, VoLTE, and Wi-Fi calling are available in select markets and through select carriers. Speeds are based on theoretical throughput, and vary based on site conditions and carrier. For details on 5G and LTE support, customers can contact their carrier or visit apple.com/iphone/cellular.\n- Crash Detection is designed for four-wheel passenger vehicle crashes with certain mass, G-force, and speed profiles consistent with severe, life-threatening crashes. It was designed for severe, life-threatening, high-impact front and rear collisions, side-swipe, T-bone, and rollover crashes. Crash Detection is available worldwide on iPhone 15, iPhone 15 Plus, iPhone 15 Pro, iPhone 15 Pro Max, iPhone 14, iPhone 14 Plus, iPhone 14 Pro, iPhone 14 Pro Max, Apple Watch Series 9, Apple Watch Ultra 2, Apple Watch Series 8, Apple Watch Ultra, and Apple Watch SE (2nd generation).\n- Emergency SOS via satellite and Find My via satellite are currently available in 14 countries and regions, including Australia, Austria, Belgium, Canada, France, Germany, Ireland, Italy, Luxembourg, the Netherlands, New Zealand, Portugal, the U.K., and the U.S., and will be available in Spain and Switzerland later this month.\n- Emergency SOS via satellite and Roadside Assistance via satellite were designed for use in open spaces with a clear line of sight to the sky. Performance may be impacted by obstructions such as trees or surrounding buildings.\n- Roadside Assistance via satellite is launching in the U.S. with AAA and is included free for two years starting at the time of activation of a new iPhone 15, iPhone 15 Plus, iPhone 15 Pro, iPhone 15 Pro Max, iPhone 14, iPhone 14 Plus, iPhone 14 Pro, or iPhone 14 Pro Max. This satellite service requires iOS 17. AAA may charge for roadside assistance services. iPhone 15 and iPhone 14 users who are not AAA members can take advantage of Roadside Assistance via satellite on a pay-per-use basis for AAA’s roadside assistance services.\n- Some features may not be available for all countries or all areas. View a complete list at apple.com/ios/feature-availability.\n- The ability to continue AirDrop transfers over the internet is coming in a software update later this year.\n- Journal is coming in a software update later this year."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/apple-iphone-15-pro-and-15-pro-max-review-love-at-first-zoom/",
      "text": "Pros\n- Lighter and more comfortable to hold\n- 15 Pro Max's 5x optical zoom adds versatility\n- A17 Pro for console video games\n- Being able to change the focus in Portrait photos is welcome\nCons\n- Action button can only trigger one action\n- Baseline 15 Pro Max is $100 more\n- The only color option is blue\nI've reviewed and tested iPhones for years, but Apple's new iPhone 15 Pro Max is the first time I've ever been this enamored. (The iPhone 12 Mini is a close second.) Both phones, along with the iPhone 15 and 15 Plus and new Apple Watches, are now available in stores.\nI tested the iPhone 15 Pro and 15 Pro Max for five days, but it wasn't until I was photographing a bodega cat named Kit Kat that I realized just how many improvements these phones have. They are brimming. After I took Kit Kat's picture, I saw the option to turn his image into a portrait mode photo. It's a minor detail but one with a significance: Nearly any photo can now be a portrait photo. And this isn't even the biggest addition.\nApple gave its Pro models a glow-up with a refreshed lighter build, a new shortcut button and the world's smallest processor. And it did all this while managing to keep that tried-and-true iPhone aesthetic front and center. In my time reviewing both phones, I recorded videos of penguins swimming, played the console game Resident Evil Village on the 15 Pro, gave the 15 Pro Max's new zoom lens a spin atop a San Francisco Ferris wheel and tried, absentmindedly, to put a Lightning cable into the new USB-C port. Old habits, am I right?\nThe iPhone 15 Pro and 15 Pro Max are defined by their refinements. This pair of phones is one of the most compelling releases from Apple in years.\nBut all this comes at a cost. While the 15 Pro costs $999 (£999, AU$1,849), the same price as the 2017 iPhone X, the barrier of entry for the 15 Pro Max is $100 more than it was last year. Apple got rid of the cheapest 128GB storage option leaving the $1,199 model with 256GB of storage as the new baseline. And that's a price right on par with Samsung's Galaxy S23 Ultra.\nIf you're curious about the other phones Apple is launching, check out CNET Senior Editor Lisa Eadicicco's review of the iPhone 15 and 15 Plus.\nPricing and storage comparison\n| Phone | Storage | US price | UK price | Australia price |\n|---|---|---|---|---|\n| iPhone 15 Pro | 128GB | $999 | £999 | AU$1,849 |\n| iPhone 15 Pro | 256GB | $1,099 | £1,099 | AU$2,049 |\n| iPhone 15 Pro Max | 256GB | $1,199 | £1,199 | AU$2,199 |\n| iPhone 15 Pro | 512GB | $1,299 | £1,299 | AU$2,399 |\n| iPhone 15 Pro Max | 512GB | $1,399 | £1,399 | AU$2,549 |\n| iPhone 15 Pro | 1TB | $1,499 | £1,499 | AU$2,749 |\n| iPhone 15 Pro Max | 1TB | $1,599 | £1,599 | AU$2,899 |\niPhone 15 Pro design embraces titanium and USB-C\nThe new titanium body is lovely, light and easy to hold thanks to its ever-so-slightly rounded edges. It feels less bulky than the straight-edged 12, 13 and 14 series. In fact, it's almost like Apple merged the curved sides of the X, XS and 11 families with the blocky sides of recent years to find a Goldilocks-style middle ground with the 15 Pro and 15 Pro Max. That said, most people will likely put a case on the phone and not notice these changes at all.\nThere are two more major changes to the body. The first is the inclusion of a USB-C port instead of the Lightning port found on previous models. While the move definitely made headlines even before Apple announced it, in reality it's not a radical change. I now plug in a USB-C cable (which comes with the phone) instead of a Lighting one. But it's convenient to use the \"one ring to rule them all\" of charging cables.\nThen there are the buttons. The volume buttons feel a bit more springy than the buttons on previous stainless steel Pro models. It's like wearing a pair of foam-soled sneakers, where you get that extra spring in your step, rather than the airbag cushioning we had in shoes like the Nike Air Max back in the '80s and '90s. Both are comfortable, but the newer design with foam is more so.\nGoodbye mute switch, hello action button\nThe mute (or silence) switch is gone and replaced with an action button. By default it lets you silence your iPhone, but you can also customize it to turn on the flashlight, record a voice memo and open the camera, among other things. I especially liked having it open the camera. Once the app is open, the action button doubles as a physical shutter button to take a photo. But the simple fact that I can use the button to trigger a shortcut multiplies its possibilities.\nThe button only reacts to two kinds of input: a tap or a press. It can only trigger one feature at a time which seems limiting. I do hope that Apple opens this up and lets people program multiple presses and taps to trigger different presets. Like maybe two presses in a row launches a shortcut and one press silences the phone. Right now, the only way to change what the button does is to go into the Settings app, scroll down to the action button and change it there. Also I'd welcome the ability to add a Control Center button that gets me into this action button menu quicker.\nRead more: This Is the Only Way You Should Turn On Your iPhone Flashlight\nLike last year's 14 and 14 Plus, the 15 Pros have a completely redesigned interior that makes it easier to repair. If the back glass is damaged, it should be faster and more affordable to have it replaced. Below is a comparison of how much it costs to replace the back glass on the new phone versus older Pro iPhone models.\nBack glass replacement cost\n| Phone | iPhone 15 Pro | iPhone 15 Pro Max | iPhone 14 Pro | iPhone 14 Pro Max |\n|---|---|---|---|---|\n| Cost | $169 | $199 | $499 | $549 |\niPhone 15 Pro Max's 5x zoom\nLet's just get this out of the way. The zoom lens on the small Pro is different from the one on the big Pro Max. The 15 Pro has a tried and true 3x telephoto camera like previous models. But the 15 Pro Max has a new 5x telephoto camera that's made with multiple prisms and some clever engineering.\nIn contrast, there are a number of Android phones with periscope-style telephoto lenses that use a single prism to bounce light to the sensor, like the 10x zoom on the Samsung Galaxy S23 Ultra. The advantage to Apple's design is that the lens takes up much less space and allows the image sensor to sit parallel with the lens, eliminating the restriction of having a telephoto image sensor that's limited in size by the thickness of the phone.\nBoth Pro phones also have a larger 48-megapixel sensor on the main camera, which helps improve performance in low light. When I was photographing with the iPhone 15 Pro Max and 14 Pro Max after dusk, I noticed that the newer phone didn't have to go into night mode as much. Also the photonic engine, Apple's fancy-pants name for photo processing, seems to help with highlights more.\nTake a look at some of my favorite photos that I took with the iPhone 15 Pro and 15 Pro Max.\niPhone 15 Pro Max cameras vs. Pixel 7 Pro, Galaxy S23 Ultra\nTo test the versatility of these cameras, I decided to do a studio photo shoot with my CNET colleague, Abrar Al-Heeti, an award-winning journalist and connoisseur of tea parties. I grabbed photos of Abrar with the Pixel 7 Pro, Galaxy S23 Ultra, iPhone 15 Pro Max and iPhone 15 Pro. I did my best to frame her the same way for each phone.\nOf the five photos, the 10x zoom photo from the S23 Ultra is my least favorite. The Pixel's photo made the background dark and smoothed out the paper's textures and flaws behind Abrar. In terms of her skin, both the iPhone 15 Pro and 15 Pro Max skewed her complexion warmer while retaining the most detail.\nThe Samsung's 3x optical zoom shot looks wonderful, but has a heavy amount of skin smoothing, which some people prefer. And the Pixel did the best at accurately capturing Abrar's skin in terms of color and detail. Again, all of these photos are good. However, the 15 Pro Max and Pixel images are my favorites.\nI also decided to take the 15 Pro Max, the Pixel and S23 Ultra up on a Golden Gate Park Ferris wheel in San Francisco. It was overcast and there was fog (ah, San Francisco summers!), and those conditions challenged all three phones. But the Galaxy S23 Ultra was at even more of a disadvantage.\nWhile the Pixel 7 Pro and iPhone 15 Pro Max both have a 5x optical zoom, in order to match it on the S23 Ultra, I set it to 5x digital zoom and, as you can see below, the results weren't great. The Pixel fared better, but notice the detail in the trees looks muddy compared to what the iPhone grabbed. None of these photos are great but the iPhone's snap is the best of the three.\nBut wait, Samsung has something the other phones don't: a 10x optical zoom. It gets much closer. The quality isn't great, but it looks better than the iPhone 15 Pro Max's 10x digital zoom. The Galaxy S23 Ultra photo is fighting against that fog and the contrast is heavy-handed.\nAlso if, like me, you're wondering what that building is, it's the University of San Francisco. But at the time I didn't know. So I used the iPhone's Visual Lookup tool to find out. While the iPhone did identify it as a landmark, it couldn't actually tell me what it was. In fact, it shared a photo of Sa'at Tower in Iran. So, I hopped on my Pixel, used Google Lens, and found out correctly that it was the university, which adds up since I live in San Francisco, not Iran.\niPhone 15 Pro portraits are a no brainer\nThen there's portraits in photo mode which let you take a regular photo and change it to a portrait mode pic after the fact for certain subjects (humans, dogs and cats). Here's a photo I took of Kit Kat the bodega cat in photo mode. Remember him from the beginning? I can turn portrait mode on, adjust the aperture to keep his whiskers in focus and even apply portrait lighting effects.\nBut I can also change focus after the fact. Check out the '90s grunge band photos of me and my pal Beacham. I can change the focus from me to him after I take the photo. This is going to be a killer feature for parents.\nI'm also happy to say that the new lens coating on the 15 Pro and 15 Pro Max helps reduce light source reflections. On the whole if there is a reflection or lens flare it's minimal at best and usually a single point.\nIn night mode, I did get some strange light streaking when using the 5x telephoto camera on the 15 Pro Max with string lights and a lamp inside a bar. I wonder if it has something to do with the prisms used for the lens. But to be clear, out of the hundreds of photos I've taken only three had these streaks.\nVideo recordings look good. I'm excited about being able to record in log format, which makes footage look flat with desaturated colors. Recording in log gives more leeway to make iPhone videos match the color with footage from other cameras you use, versus baking in the color into the video file. I can see using Apple log videos for films where you're using multiple cameras from different brands or in social media videos, like the one we made for this review.\nThe iPhone 15 Pro is the next gaming console\nThe brain behind everything on the 15 Pro and 15 Pro Max is the new A17 Pro chip. Its processing and graphics performance is best shown off with video games. And I'm not talking about Candy Crush.\nThe 15 Pro and 15 Pro Max support full console games like Resident Evil Village, which I got to test… well, at least the beginning. Resident Evil Village looks phenomenal on the 15 Pro Max's screen, especially in terms of the lighting and shading. In my time, and through my casual gamer's eyes, I was impressed. It speaks volumes that games like this can come to the iPhone.\nI'm not even a week into using the new iPhones, so I still need to run CNET's array of battery drain and charging tests. But I can share how the battery has fared so far. For the most part the 15 Pro Max's battery made it through a full day of use (from 7 a.m. to 10 p.m) usually ending the day with 20 to 25% to spare. On perhaps the most demanding day I spent with the phone (taking photos, recording videos and with the screen at max brightness) the 15 Pro Max started out with a full battery in the morning and had 7% left by the end of the day.\nI did run a wired charging test with both the 15 Pro and Pro Max. I used the included USB-C cable that comes in the box and a Twelve South 20-watt wall charger. Over 30 minutes the 15 Pro's battery went from 4% to 66% and the 15 Pro Max recharged from 7% to 56%. Both phones support wired charging up to 27 watts which I plan to test and will update this review with the results.\nThe iPhone 15 Pro and 15 Pro Max also support 15-watt wireless charging via MagSafe or Qi2. I tested both on a Belkin BoostCharge Pro stand. Over 30 minutes, the 15 Pro went from 30% to 52% and the 15 Pro Max went from 7% to 28%, which are remarkably similar results.\nThe iPhone 15 Pro is home for iOS 17\nIf the A17 Pro chip is the brains, then iOS 17 is the 15 Pro and 15 Pro Max's soul. The new OS is filled with lots of small quality of life improvements throughout. StandBy mode has won me over. I love being able to have my lock screen show the time in alarm clock-size numbers, app widgets or photos while it charges. The interface is clean and contemporary and breathes new life into the iPhone.\nI also love making custom stickers from photos and live photos in Messages. It makes communicating with friends and family even more expressive. Autocorrect on the keyboard works so well for me. I'm usually a horrible phone typist, but this new autocorrect gets me. And I don't even curse that much.\nRead more: iOS 17 Review: StandBy Mode Changed My Relationship With My iPhone\nAt the end of the day, I am impressed with the iPhone 15 Pro and 15 Pro Max. I recommend both for anyone coming from a 12 Pro, 12 Pro Max or older. If you're trying to decide between the 15 Pro and the 15 Pro Max, that 5x telephoto on the Pro Max is compelling. But if you don't take a lot of zoomed in photos, it might be best to stick with the smaller Pro size. Also, if you're considering buying either phone there are a number of trade-in discounts you should consider.\niPhone 15 Pro specs vs. iPhone 15 Pro Max, Google Pixel 7 Pro, Galaxy S23 Ultra\n| iPhone 15 Pro | iPhone 15 Pro Max | Google Pixel 7 Pro | Galaxy S23 Ultra | |\n|---|---|---|---|---|\n| Display size, tech, resolution, refresh rate, brightness | 6.1-inch OLED; 2,556x1,179 pixels; 120Hz adaptive | 6.7-inch OLED; 2,796x1,290 pixels; 120Hz adaptive | 6.7-inch OLED display, QHD+ (1,440x3,120 pixels), 120Hz refresh rate, 1,500-nit brightness | 6.8-inch AMOLED; 3,088x1,440 pixels; 120Hz adaptive |\n| Pixel density | 460 ppi | 460 ppi | 512 ppi | 500 ppi |\n| Dimensions (inches) | 2.78 x 5.77 x 0.32 in | 3.02 x 6.29 x 0.32 in | 6.4 x 3.0 x 0.3 in | 3.07 x 6.43 x 0.35 in |\n| Dimensions (millimeters) | 70.6 x 146.6 x 8.25 mm | 76.7 x 159.9 x 8.25 mm | 162.9 x 76.6 x 8.9 mm | 78 x 163.3 x 8.9 mm |\n| Weight (grams, ounces) | 187 g (6.6 oz) | 221 g (7.81 oz) | 212g (7.5 oz) | 234 g (8.25 oz) |\n| Mobile software | iOS 17 | iOS 17 | Android 13 | Android 13 |\n| Camera | 48-megapixel (wide), 12-megapixel (ultrawide), 12-megapixel telephoto (3x optical) | 48-megapixel (wide), 12-megapixel (ultrawide), 12-megapixel telephoto (5x optical) | 50-megapixel (main), 12-megapixel (ultrawide), 48-megapixel (telephoto) | 200-megapixel (wide), 12-megapixel (ultrawide) 10-megapixel (telephoto) 10-megapixel (telephoto) |\n| Front-facing camera | 12-megapixel | 12-megapixel | 10.8-megapixel | 12-megapixel |\n| Video capture | 4K | 4K | 4K | 8K |\n| Processor | A17 Pro | A17 Pro | Google Tensor G2 | Qualcomm Snapdragon 8 Gen 2 for Galaxy |\n| Storage | 128GB, 256GB, 512GB, 1TB | 256GB, 512GB, 1TB | 12GB RAM + 128GB, 256GB, 512GB | 8GB + 256GB; 12GB + 256GB; 12GB + 512GB; 12GB + 1TB |\n| Expandable storage | None | None | None | None |\n| Battery | Undisclosed; Apple claims up to 23 hours of video playback (20 hours streamed) | Undisclosed; Apple claims up to 29 hours of video playback (25 hours streamed) | 5,000 mAh | 5,000 mAh (45W wired charging) |\n| Fingerprint sensor | None (Face ID) | None (Face ID) | In-display | In-display |\n| Connector | USB-C | USB-C | USB-C | USB-C |\n| Headphone jack | None | None | None | None |\n| Special features | 5G (mmw/Sub6), Action Button, Always-On display, IP68 rating, MagSafe, Dynamic Island, 5x optical zoom (120mm equivalent), satellite connectivity, eSIM, Thread networking technology | 5G (mmw/Sub6), Action Button, Always-On display, IP68 rating, MagSafe, Dynamic Island, 5x optical zoom (120mm equivalent), satellite connectivity, eSIM, Thread networking technology | 5G, Magic Eraser, Photo Unblur, Real Tone, Face Unblur, Long Exposure Mode, Action Pan; Hold For Me, Wait Times, Direct My Call Live Translate, | 5G (mmw/Sub6), IP68 rating, wireless PowerShare to charge other devices, integrated S Pen, 100x Space Zoom, 10x Optical Zoom, UWB for finding other devices |\n| US price off-contract | $999 (128GB, $1,099 (256GB), $1,299 (512GB), $1,499 (1TB) | $1,199 (256GB), $1,399 (512GB), $1,599 (1TB) | $899 (128GB + 12GB) | $1,200 (12GB/256GB) |\n| UK price | £999 (128GB), £1,099 (256GB), £1,299 (512GB), £1,499 (1TB) | £1,199 (256GB), £1,399 (512GB), £1,599 (1TB) | £849 | £1,249 (12GB/256GB) |\n| Australia price | AU$1,849 (128GB), AU$2,049 (256GB), AU$2,399 (512GB), AU$2,749 (1TB) | AU$2,199 (256GB), AU$2,549 (512GB), AU$2,899 (1TB) | AU$1,299 | AU$1,949 (12GB/256GB) |\nHow we test phones\nEvery phone tested by CNET's reviews team was actually used in the real world. We test a phone's features, play games and take photos. We examine the display to see if it's bright, sharp and vibrant. We analyze the design and build to see how it is to hold and whether it has an IP-rating for water-resistance. We push the processor's performance to the extremes using both standardized benchmark tools like GeekBench and 3DMark, along with our own anecdotal observations navigating the interface, recording high-resolution videos and playing graphically intense games at high refresh rates.\nAll the cameras are tested in a variety of conditions from bright sunlight to dark indoor scenes. We try out special features like night mode and portrait mode and compare our findings against similarly priced competing phones. We also check out the battery life by using it daily as well as running a series of battery drain tests.\nWe take into account additional features like support for 5G, satellite connectivity, fingerprint and face sensors, stylus support, fast charging speeds, foldable displays among others that can be useful. And we of course balance all of this against the price to give you the verdict on whether that phone, whatever price it is, actually represents good value. While these tests may not always be reflected in CNET's initial review, we conduct follow-up and long-term testing in most circumstances."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/iphone-14-pro-max-review-welcome-apples-dynamic-island/",
      "text": "Pros\n- The Dynamic Island is delightful\n- Main camera takes excellent photos\n- A16 Bionic chip is blazing fast\nCons\n- Telephoto camera is only good in bright light\n- Wish there was an easier way to simplify the always-on display\n- Both phones are hefty\nEditors' Note: The iPhone 14 Pro and 14 Pro Max come with improved cameras, iOS 16, the fastest phone processor we've ever tested, and an upgraded yet familiar design. Features like the Dynamic Island and Emergency SOS via Satellite make the 14 Pro and 14 Pro Max some of the best phones you can buy in 2022, which is why they received a CNET Editors' Choice Award. The original review follows.\nApple's iPhone 14 Pro and Pro Max may look identical to last year's iPhone 13 Pro on the back, but don't let that fool you. It's the iPhone 14 Pro's screen where there's something different and wonderful going on. The iPhone's display notch, which has defined Face ID iPhones since 2017's iPhone X, has been replaced with a pill-shaped screen cutout that houses an upgraded TrueDepth camera system. On its own, that cutout will make some people happier than the notch did. But it's the space around the cutout, which now shows system alerts and background activities, that's become one of my favorite features.\nApple calls it the Dynamic Island, and it enlarges and shrinks when you receive a call and to display the music you're playing, timers and other notifications. I know it's not the best name, but it's truly one of the best features on the iPhone 14 Pro and 14 Pro Max.\nThe new Apple phones also get upgraded cameras, a faster processor, an always-on display and iOS 16 as well as new safety features including Crash Detection and Emergency SOS via Satellite.\nThe 6.1-inch iPhone 14 Pro starts at $999 (£1,099, AU$1,749) and the 6.7-inch 14 Pro Max at $1,099 -- which are the same prices as 2019's iPhone 11 Pro and 11 Pro Max. After spending some time with the phones, I think they're worth every penny.\nThe new Pros come in space black, gold, silver and deep purple -- which, depending on the light, can look like a drab shade of gray or like Grimace purple. The iPhone 14 Pro and 14 Pro Max go on sale Friday, Sept. 16, and are currently available for preorder.\niPhone 14 Pro and 14 Pro Max pricing breakdown\n| Phone | US price | UK price | AU price |\n|---|---|---|---|\n| iPhone 14 Pro 128GB | $999 | £1,099 | AU$1,749 |\n| iPhone 14 Pro Max 128GB | $1,099 | £1,199 | AU$1,899 |\n| iPhone 14 Pro 256GB | $1,099 | £1,209 | AU$1,899 |\n| iPhone 14 Pro Max 256GB | $1,199 | £1,309 | AU$2,099 |\n| iPhone 14 Pro 512GB | $1,299 | £1,429 | AU$2,249 |\n| iPhone 14 Pro Max 512GB | $1,399 | £1,529 | AU$2,419 |\n| iPhone 14 Pro 1TB | $1,499 | £1,649 | AU$2,599 |\n| iPhone 14 Pro Max 1TB | $1,599 | £1,749 | AU$2,769 |\nHow iPhone 14 Pro's Dynamic Island works\nThere are few external ways that the iPhone 14 Pro is different from previous models. There's the aforementioned display cutout. The camera bump is a skosh chunkier. And, like the iPhone 14, US models lack a SIM card tray and instead use an eSIM.\nBut it's that strangely named Dynamic Island that defines the phone. The more time I spent with the 14 Pro, the more delightful I found it. It works in numerous situations and is an easy way to see what's going on without pulling your attention completely away from what you're doing.\nThe Dynamic Island is interactive. For example, if music is playing, a miniature waveform and tiny thumbnail of the album artwork appears on either side of the cutout. When you tap either side, Spotify brings up the song that's currently playing. If you're on a FaceTime call, you can tap and hold on the interface to bring up controls.\nYou can tap directly on the TrueDepth cameras or off to the sides. In my time using it, I didn't notice any smudges accumulating over the selfie camera and Face ID didn't seem to be affected.\nIf you have more than one background activity in progress, like maybe you're listening to music and have a timer on, the Dynamic Island splits into two parts like a sideways lower-case letter i.\nThe iPhone 14 Pro and the Dynamic Island are an excellent example of Apple packaging a powerful tool into an enjoyable interface. It's a shame you can only use it on the iPhone 14 Pro and 14 Pro Max. Such a fun and approachable feature is bound to be a big hit with people who don't use Pro versions of the iPhone.\niPhone 14 Pro has an always-on display\nThe iPhone 14 Pro runs on iOS 16, which adds a bunch of welcome features including new ways to customize your lock screen. But there's one lock screen feature reserved for the 14 Pro and 14 Pro Max: an always-on display.\nThe always-on display is a low-power version of your lock screen that can show essential information when your phone is locked. Most Android phones have had the feature for years, but Apple's implementation might be the most gorgeous one yet.\nThe 14 Pro's always-on display shows the time, date, your widgets, notifications and shaded-out version of your lock screen's wallpaper. Depending on how your lock screen is set up, it can look vastly different when it's shown as an always-on display. I had fun auditioning different lock screen combinations of wallpaper and widgets to see how they'd look. The color wallpaper is also the biggest difference Apple's always-on display makes from Android phones, which typically just light up the time and notifications in monochrome.\nSeeing my iPhone 14 Pro sitting on a table with its screen on took some getting used to. I kept thinking that I'd forgotten to lock it. To wake, just tap the screen or unlock the phone.\nWhen the 14 Pro is faced down, in a pocket, in a bag or near another Apple device that you're using, it doesn't turn on. Also, there's an option in Settings to turn it off completely.\nI wish there was an option to make the always-on display look more discreet and, for example, just show the time and date. Technically, you could probably set a black wallpaper as your lock screen and only select the date and time for a more minimal always-on display. Visually, the 14 Pro's always-on display has a lot going on which I found distracting when my phone was face-up next to me.\nTaken in total, the Dynamic Island, the new lock screen layout and the always-on display make the 14 Pro the most approachable iPhone for managing alerts and notifications. And I imagine that experience will only get better once live activities for the lock screen in iOS 16 is available in full. (The live activities feature displays real time updates from apps on your lock screen, so you can track the progress of a rideshare or follow the score of a sporting event.)\niPhone 14 Pro camera\nThe iPhone 14 Pro has three rear cameras: a main wide-angle camera, an ultrawide and a telephoto camera with 3x optical zoom. The lens on the main camera has a wider focal length, going from a 26mm equivalent on previous iPhone models to a 24mm one. It's not drastically different, but it helps get more of the scene into the frame.\nThe main camera also gets a new larger 48-megapixel sensor. While more megapixels doesn't necessarily mean better photos, Apple divides the pixels into groups of four and combines them into one larger pixel. The result is a 12-megapixel photo that's brighter, has less image noise and better detail.\nThe main camera takes excellent photos: The image quality and details are great for a phone. I noticed the most improvement is in medium and low-light situations: Colors look good and textures are great. Check out the photo below, which I took on a foggy morning in San Francisco. Notice the textures in the buildings' bricks and the gradual way the 14 Pro captured the fog engulfing the top of Salesforce Tower.\nThe photo below was shot under a palm tree's dark canopy. The 14 Pro did a solid job of capturing the different textures in the leaves and bark while also boosting the brightness.\nIf you're so inclined, you can capture 48-megapixel photos using the phone's ProRaw setting. I should warn you that these files are big. The file for the photo below of the Bay Bridge at sunset is 48 megabytes. After editing, the photo is saved as a much smaller JPEG. Look closely at the details of the cars and the bridge's support cables.\nThe ultrawide camera gets a new sensor with more focus pixels and a stepped-down f2.2 aperture lens. All this adds up to much sharper ultrawide photos. The sensor -- combined with Apple's revamped photo processing, which it calls the Photonic Engine -- gives you much better photos in less ideal situations.\nUltrawide photos and videos are still a step down compared to those from the main camera, but these improvements are welcomed.\nMacro photos also get a boost. When you try to take a photo with the main camera when standing close to a subject, the iPhone 14 Pro switches to the ultrawide camera and crops the framing to mimic the main camera. This allows for a closer focus, which is great for close-up shots of small things. Last year's 13 Pro had a similar feature, but with the new ultrawide, macro photos have better image quality, especially in medium and low light.\nThe telephoto camera is basically identical to the one on last year's 13 Pro, but gets a lift from the 14 Pro's Photonic Engine processing. As with the ultrawide, image quality is a step behind the main camera -- especially in dimmer environments.\nThe TrueDepth camera got an upgraded lens with a brighter f1.9 aperture. And the selfie camera has autofocus for the first time ever, which works great for group selfies. Here are some more photos that I took with the iPhone 14 Pro and 14 Pro Max.\nCinematic mode can now record in 4K and at 24 frames per second. There's a new video image stabilization tool called Action mode. When you shoot a video you can toggle it on and the phone crops in a bit to keep the image centered and the horizon level. If you're shooting in 4K, Action mode drops the resolution to 2.8K but the results are still impressive. While other phones, like the Galaxy S22 Ultra, have similar stabilization functions, it's wonderful to see the tool come to the iPhone. And it works across all three rear cameras.\nWhile testing video shot with and without Action mode, I was reminded how good the image stabilization is in regular video mode. Check out the video below to see the clips I shot with the iPhone 14 Pro and 14 Pro Max.\niPhone 14 Pro speed\nDriving all these upgrades is Apple's new A16 Bionic chip. In use, everything feels peppy. Gaming is an absolute delight. And subtle things, like animations as you move in and out of the Dynamic Island, are super smooth. In our benchmark tests, the iPhone 14 Pro and 14 Pro Max proved that they're not only faster than any iPhone we've ever tested, but they're the fastest phones you can buy today.\nCheck out our benchmark test results below.\niPhone 14 Pro battery\nThe regular 14 Pro's battery had no problem making it through a day. I typically got 6 hours of screen-on time. With the 14 Pro Max, I was able to consistently get a day and a half on a single charge.\nCharging is OK. I charged the 14 Pro Max for 30 minutes and the battery went from 14% to 59%. The 14 Pro went from 51% to 84%.\niPhone 14 Pro vs. iPhone 13 Pro, 12 Pro, 11 Pro\nIf you have last year's iPhone 13 Pro, I don't think you should upgrade. While the improvements and new features have a lot of sizzle, you aren't getting a drastically different experience. Upgrade your 13 Pro to iOS 16 and enjoy the new features from that software update instead.\nBut if you have an iPhone 12 Pro and have the itch to upgrade, the 14 Pro is a sizable step up in terms of performance, battery life, camera quality and additional features like the Dynamic Island.\nAnd if you're rocking an iPhone 11 Pro or older, the iPhone 14 Pro is a giant upgrade all around.\niPhone 14 specs vs. iPhone 14 Plus, 14 Pro, 14 Pro Max\n| iPhone 14 | iPhone 14 Plus | iPhone 14 Pro | iPhone 14 Pro Max | |\n|---|---|---|---|---|\n| Display size, resolution | 6.1-inch OLED; 2,532x1,170 pixels | 6.7-inch OLED; 2,778x1,284 pixels | 6.1-inch Super Retina XDR, OLED display, 2,556x1,179 pixels | 6.7-inch Super Retina XDR, OLED display, 2,796x1,290 pixels |\n| Pixel density | 460 ppi | 458 ppi | 460 ppi | 460 ppi |\n| Dimensions (Inches) | 5.78 x 2.82 x 0.31 in. | 6.33 x 3.07 x 0.31 in. | 5.81 x 2.81 x 0.31 in. | 6.33 x 3.05 x 0.31 in. |\n| Dimensions (Millimeters) | 147 x 72 x 7.8mm | 161 x 78 x 7.8mm | 147.5 x 71.5 x 7.85mm | 160.7 x 77.6 x 7.85mm |\n| Weight (Ounces, Grams) | 6.07 oz.; 172g | 7.16 oz.; 203g | 7.27 oz.; 206g | 8.47 oz.; 240g |\n| Mobile software | iOS 16 | iOS 16 | iOS 16 | iOS 16 |\n| Rear cameras | 12MP (wide), 12MP (ultrawide) | 12MP (wide), 12MP (ultrawide) | 48MP (wide), 12MP (ultrawide), 12MP (telephoto) | 48MP (wide), 12MP (ultrawide), 12MP (telephoto) |\n| Front-facing camera | 12-megapixel | 12-megapixel | 12-megapixel | 12-megapixel |\n| Video capture | HDR video recording with Dolby Vision up to 4K at 60 fps | HDR video recording with Dolby Vision up to 4K at 60 fps | HDR video recording with Dolby Vision up to 4K at 60 fps | HDR video recording with Dolby Vision up to 4K at 60 fps |\n| Processor | Apple A15 Bionic | Apple A15 Bionic | Apple A16 Bionic | Apple A16 Bionic |\n| Storage | 128GB, 256GB, 512GB | 128GB, 256GB, 512GB | 128GB, 256GB, 512GB, 1TB | 128GB, 256GB, 512GB, 1TB |\n| RAM | Undisclosed | Undisclosed | Undisclosed | Undisclosed |\n| Expandable storage | No | No | No | No |\n| Battery | Undisclosed; Apple lists 20 hours of video playback | Undisclosed; Apple lists 26 hours of video playback | Undisclosed; Apple lists 29 hours of video playback | Undisclosed; Apple lists 29 hours of video playback |\n| Fingerprint sensor | No (Face ID) | No (Face ID) | No (Face ID) | No (Face ID) |\n| Connector | Lightning | Lightning | Lightning | Lightning |\n| Headphone jack | No | No | No | No |\n| Special features | 5G enabled; MagSafe; water resistant (IP68); wireless charging; dual-SIM capabilities (e-SIM) | 5G enabled; MagSafe; water resistant (IP68); wireless charging; dual-SIM capabilities (e-SIM) | Dynamic Island; Always-On display; 5G enabled; MagSafe; water resistant (IP68); wireless charging; dual-SIM capabilities (e-SIM) | Dynamic Island; Always-On display; 5G enabled; MagSafe; water resistant (IP68); wireless charging; dual-SIM capabilities (e-SIM) |\n| Price off-contract (USD) | $799 (128GB), $899 (256GB), $1,099 (512GB) | $899 (128GB), $999 (256GB), $1,199 (512GB) | $999 (128GB), $1,099 (256GB), $1,299 (512GB), $1,499 (1TB) | $1,099 (128GB), $1,199 (256GB), $1,399 (512GB), $1,599 (1TB) |\n| Price (GBP) | £849 (128GB) | £949 (128GB) | £1,099 (128GB) | £1,199 (128GB) |\n| Price (AUD) | AU$1,399 (128GB) | AU$1,579 (128GB) | AU$1,749 (128GB) | AU$1,899 (128GB) |"
    },
    {
      "url": "https://www.cnet.com/reviews/samsung-galaxy-s10-dont-abandon-2019-flagship-just-yet-review/",
      "text": "Our expert, award-winning staff selects the products we cover and rigorously researches and tests our top picks. If you buy through our links, we may get a commission.How we test phones\nGalaxy S10 review: Don't abandon Samsung's 2019 flagship just yet\nThe Galaxy S10 is still a terrific phone, even after it's been outclassed by the next generation. For some, it'll be a smarter buy now than it was in 2019.\nJessica DolcourtVP, Content Operations and Commerce, CNET Group and CNET Labs\nJessica is a passionate content strategist and team leader across the CNET family of brands. She leads a number of teams, including commerce, performance optimization and the copy desk. Her CNET career began in 2006, testing desktop and mobile software for Download.com and CNET, including the first iPhone and Android apps and operating systems. She continued to review, report on and write a wide range of commentary and analysis on all things phones, with an emphasis on the iPhone and Samsung devices. Jessica was one of the first people in the world to test, review and report on foldable phones and 5G wireless speeds.\nJessica began her leadership role managing CNET's How To section for tips and FAQs in 2019, guiding coverage of topics ranging from personal finance to phones to home. She holds an MA with Distinction from the University of Warwick in the UK.\nThe poor Galaxy S10 always suffered from middle-child syndrome. Being sandwiched between the larger, more lavishly appointed Galaxy S10 Plus and the smaller, pluckier, far cheaper Galaxy S10E was never easy. In fact, I wondered more than once why it even existed, other than to suddenly look like a deal during promotional sales.\nThe name change is significant, representing a major shift in what it means to be a premium Galaxy phone:\n5G\n, real camera improvements and more megapixels, a huge battery, a 120Hz screen refresh rate.\nThe Galaxy S10 can't compete against those specs, especially when it comes to future-proofing the phone in the rising age of blistering 5G data speeds. But for some people, the S10 could settle into the obvious choice for a high-end phone with a reasonable price, especially when the price inevitably drops even further.\nYet for many, 5G phones won't be a practical option for several years. Buying a 4G phone this year that you hold onto for another two or three years isn't a terrible idea for many, especially if 5G still hasn't arrived where you live, and it means saving a sizable chunk of change. Specs wise, the Galaxy S10 will valiantly carry you through one more cycle of phone ownership -- just so long as it comes down to a price you're willing to pay.\nThe Galaxy S10 initially started at $900 (£799 and AU$1,349), only $100 cheaper than the Plus ($1,000, £899, AU$1,499) and $150 more than the S10E ($750, £669, AU$1,199). Expect price drops to settle even further now that the Note 20 is here, with further seasonal discounts by store and carrier, such as buy one, get one free offers.\nGalaxy S10, S10 Plus, S10E: Every camera lens and curve\nThe Galaxy S10 remains as terrific a phone as it was when I first reviewed it in March 2019. The screen, camera and battery life are top notch. That's unsurprising when you consider that it's just a pared-down version of the excellent Galaxy\nS10 Plus\n, which was one of the top phones in a talent-stacked year.\nIf I liked any phones more it would be the\nGalaxy Note\n10 for value-for-money-meets-luxury specs, and the Note 10 Plus for even more power features and specs.\nFor more details on the Galaxy S10's individual features, read my Galaxy S10 Plus review. With a few exceptions, the core features are the same as the Plus model. Keep reading below for a full specs comparison among the Galaxy S10, S10 Plus and S10E."
    },
    {
      "url": "https://www.techradar.com/news/why-samsung-galaxy-note-10-needs-a-case",
      "text": "This is exactly why your Samsung Galaxy Note 10 needs a case\nSamsung Galaxy No-oh no\nNot minutes - mere seconds - after photographing the new, top-of-the-line Samsung Galaxy Note 10, I placed it securely on top of another phone. And it promptly slipped off, plummeted just over two feet, and struck a chair strut. When I picked up the Note 10, I surveyed the damage: a thoroughly shattered glass back. Queue the sad times soundtrack.\nI don’t feel responsible for this... except that I feel a bit responsible for this. Everyone knows the pristine glass backs of flagship phones are prone to splintering at the slightest impact. If I’d been a responsible Phone Parent, I would have swaddled my expensive device in a case the moment I got it back from our photo team.\nBut..but...glass backs for some of these flagships have been polished to such a degree that they practically hover over slick surfaces. Place one on the slightest incline and it will start to glide, trusting that your peripherals won’t notice its glacial escape into mortal peril.\nLike a toddler with a death wish, my Note 10 slipped off my desk the moment my back was turned. I picked it up off the carpeted floor expecting a meager scratch for my lapsed attention - other glass phones in the TechRadar office have made the same desk-to-floor journey with such minor consequences - but the impact with the chair leg doomed the beautiful rear Aura Glow cover, too pure for this world.\nIf Samsung had slipped a case into the box along with its very expensive handset, perhaps the back would have survived the fall. But any case made of a non-glass material would have had the traction to stop the phone from sliding to begin with. Even the laser-etched or chemical-treated matte finishes on smartphones like the Google Pixel 3 or OnePlus 7 Pro might have been enough to keep them from slipping into free-fall.\nBut that’s not the world we live in. No, we exist in a time and place where Samsung and Apple release phones that gleam like precious stones - beautiful and endangered by the outside world from the moment they leave their boxes until their owners ensconce them in their case of choice.\nSafe in a case–but with all that glass beauty hidden from the world. Even clear cases warp phones’ elegant designs through a bubble of translucent material. It doesn’t even seem like a choice anymore: secure your investment or tempt the wrath of an unkind universe.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nIt’s a logical end to a design trend away from the smartphone’s practical and industrial beginnings, ballooning in size and price to become the statement pieces and status flexes we all chase for elite looks and features, not pure functionality. The miracles in our pockets are now very precious.\nConsumer tech’s views on the matter have certainly evolved over time - even those of Apple’s patron saint. Back in 2011, journalist Steven Levy wrote in Wired about Steve Jobs’s reaction to his practice of wrapping an early iPhone in a case:\n“Jobs recoiled as if I had introduced something toxic into the room. His look seemed to say, why would you hide something so gorgeous? My translucent neoprene was making a mockery of all the innovation and sweat that he and his employees had expended on visual design. Besides, he told me, \"I think stainless steel looks beautiful when it wears.\"\nWhat would Jobs say about a world where all that visual design is only appreciated for moments in a smartphone’s lifetime?\nDavid is now a mobile reporter at Cnet. Formerly Mobile Editor, US for TechRadar, he covered phones, tablets, and wearables. He still thinks the iPhone 4 is the best-looking smartphone ever made. He's most interested in technology, gaming and culture – and where they overlap and change our lives. His current beat explores how our on-the-go existence is affected by new gadgets, carrier coverage expansions, and corporate strategy shifts."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/is-the-iphone-17-pro-going-to-be-big-and-orange-we-rounded-up-the-rumors/",
      "text": "Key takeaways:\n- New iPhone 17 Pro rumors include camera upgrades, including an additional control button and a telephoto lens with up to 8x optical zoom.\n- The Pro is rumored to be getting a scratch-resistant antireflective display.\n- The new iPhone is expected to be released in early September.\nWe're about six weeks away from seeing the new iPhone, and the latest whispers about the iPhone 17 Pro have the rumor mill working overtime.\nIn fact, there was a whole slew of rumors about the iPhone 17 Pro camera leaked over the weekend -- including a possible movable telephoto lens -- by an anonymous tipster who reached out to MacRumors. While we can't confirm any of the rumors independently, MacRumors has a good track record. We'll zoom in on the details in a bit.\nAlthough speculation about an ultrathin iPhone 17 Air has hogged the spotlight, the Pro models tend to include more upgraded features. In addition to the camera, the Pro could get a surprising new color and the much-coveted scratch-resistant, antireflective display. But with looming tariffs still threatening to hike the price, there's a lot to watch for with the rumored iPhone 17.\nThere's even a rumored video of the iPhone 17 Pro posted from the X account @skyfops, although there's no confirmation this was in fact the actual iPhone 17 Pro or perhaps a dummy model:\nApple hasn't announced anything or confirmed any rumors, and we likely won't find out for sure until the next iPhone officially comes out. Until then, we're tracking all the biggest leaks and rumors about the iPhone 17 Pro and sharing what we've heard so far.\nRead more: I May Upgrade to the iPhone 17 Pro Max If These 6 Rumors Are True\niPhone 17 Pro's rumored camera bump redesign and movable telephoto lens\nThe iPhone 17 Pro's camera has been the subject of multiple rumored changes, but recent ones come from an anonymous tipster.\nMacRumors says a tipster who claimed to be familiar with an iPhone Pro commercial revealed features that included a telephoto lens -- upgraded to 8x optical zoom from 5x on the iPhone 16 Pro -- that can apparently move. A moving lens could allow continuous optical zoom at various focal lengths, according to MacRumors.\nCNET Managing Editor Patrick Holland, who's been reviewing phones for CNET since 2016, noted that Sony, which for years made the sensors for the iPhone, had a couple of phones with a variable zoom lens that worked like an actual camera zoom lens. While Apple may not use the exact same technology as Sony's, Holland notes, it could adapt some of it for the iPhone 17 Pro.\nMacRumors also reported the iPhone 17 Pro could have an additional Camera Control button, which would be in addition to the bottom-right edge camera button the iPhone 16 models sport, as well as a new camera and video app.\nIn January, Bu posted a leaked image on X suggesting that the phone could feature a pill-shaped camera bar that looks a lot like the camera bar on Google's Pixel 9 phone.\nThat raised the question of whether the iPhone 17 Pro would align the three camera lenses in a single row or leave them stacked in a pyramid design, as it did with the iPhone 16 Pro.\nIn February, Bu posted CAD renders of what could be the iPhone 17 lineup, and Front Page Tech also shared iPhone 17 Pro renders in this video on YouTube (Apple filed a lawsuit against YouTuber Jon Prosser, featured in this video, over leaks about the iOS26):\nBoth showed horizontal camera bars for the iPhone 17 Pro models that keep the stacked lens layout.\nPu wrote in March that the iPhone 17 Pro and Pro Max will feature a 48-megapixel telephoto rear camera, up from 12 megapixels on the iPhone 16 Pro models. That would mean all three cameras on the iPhone 17 Pro models -- wide-angle, ultrawide and telephoto -- would be 48 megapixels.\nAnd as for your selfies, analyst Jeff Pu reports that the front-facing camera will be upgraded from 12 megapixels on the iPhone 16 to 24 megapixels on all iPhone 17 models.\nFront Page Tech reported in April that the iPhone 17 Pro and iPhone 17 Pro Max may also add a built-in video feature that allows you to record with the front and rear cameras simultaneously. The feature would let you overlay a shot of your face over an outward-facing video. A video upgrade from the already stellar iPhone 16 Pro could add some serious value for video creators considering the iPhone 17 Pro.\nRead more: Apple, Please Don't Let AI Ruin the iPhone 17's Camera\nPro displays could get an antireflective upgrade\nOn July 16, MacRumors cited a \"reliable source\" in reporting that the Pro and Pro Max could get a scratch-resistant antireflective display, reversing itself on previous reports that Apple had to scrap plans due to scaling issues. If the latest rumor proves true, the upgrade from Apple's Ceramic Shield display could prove an enticing feature for the Pro and Pro Max.\nHolland called the antireflective display one of the best attributes of the Samsung Galaxy S25 Ultra.\nApple Insider reported in May that the iPhone 17 could get a larger display than the iPhone 16. DSCC founder and Counterpoint Research VP Ross Young posted on X that the base iPhone 17 will be 6.3 inches, an upgrade from the iPhone 16's 6.1-inch display. In theory, that means the iPhone 17 would have the same screen size as the iPhone 17 Pro.\nThe iPhone 17 Pro and Pro Max are rumored to continue with a 6.3-inch and 6.9-inch display, respectively, similar to the iPhone 16 Pro Max.\nRumored design changes for the iPhone 17 Pro and Pro Max\nThe latest rumors about the iPhone 17 Pro and Pro Max design include colorful developments and a new frame composition.\nOrange among the Pro color lineup\nRumors of a new color for the iPhone started in April, when Twitter user and leaker Majin Bu (not the Dragon Ball Z character) posted that the iPhone 17 Pro and Pro Max could get a sky blue option.\nBut on July 14, Bu posted that Apple is ditching sky blue for the Pro Models, with only the rumored iPhone Air claiming the hue. Then on July 29, Bu posted a video on X of Pro mockups in four colors:\n- black\n- silver\n- dark blue\n- orange\nDigital blogger Weibo said that one of the colors is \"related to the liquid glass design of iOS 26,\" saying it would be white but with different visual effects depending on which light it was in.\nFor reference, the iPhone 16 and Plus made a splash last year when they debuted pink, teal and ultramarine color options, alongside the standard white and black. The iPhone 16 Pro and Pro Max introduced a new color, desert titanium -- a restrained shade of peach -- alongside the classic natural titanium, white titanium and black titanium options.\nThe Pro models have traditionally featured more muted colors, so the prospect of an orange or glass-inspired color could offer an exciting new look for the Pro.\nApple logo moving lower\nThe Apple logo on the back of the phone may be moving lower on the Pro models, as shown in a Bu post on X of an iPhone 17 mockup:\nThe change in location is reportedly coming to make room for the larger camera bump design.\nImproved audio quality\nOn June 2, wccftech, said the iPhone 17 Pro and Pro Max would get longer earpieces, citing a post on X from @duanrui1205. In theory, that could signal improved audio clarity. At the Worldwide Developers Conference later in June, Apple said audio quality will improve with software updates in AirPods with H2 chipsets. CNET got to learn firsthand how Apple tests, calibrates and tunes the audio (and video) on an iPhone. Additional improvements in audio quality could potentially elevate an already impressive feature.\nMore RAM for iPhone 17 lineup\nApple Intelligence and AI are likely to play more prominent roles with the iPhone 17. To support the new features, all the iPhone 17 models will step up to 12GB of RAM, tipster Digital Chat Station reported in April. Kuo said the iPhone 17 Air and Pro models would get that increased 12GB of RAM, but not the base model.\nConsidering that the iPhone 16 lineup had 8GB of RAM across all models, this could be a big upgrade for the iPhone 17.\nAluminum frames for all, except Air\nThere's been plenty of discussion about whether the iPhone 17 Pro will ditch its titanium alloy frame for an aluminum one. In February, MacRumors said Pu predicted that the iPhone 17, iPhone 17 Pro and iPhone 17 Pro Max will have all-aluminum frames or potentially part glass, part aluminum for better durability. The iPhone 17 Air would stick with Apple's current titanium frame -- or possibly a mix of titanium and aluminum.\nDynamic Island size in question\nPu predicted in May that all iPhone 17 models will use a new metalens technology for the proximity sensor, which could result in a smaller Face ID sensor and Dynamic Island, according to a report by 9to5Mac. However, Pu's report contradicts Kuo, who said that the iPhone 17's Dynamic Island would remain \"largely unchanged\" compared with the iPhone 16.\nDimensions\nAccording to a report by 9to5Mac in May, the iPhone 17 Pro line may be thicker, 8.725mm, compared with the iPhone 16 Pro, which clocks in at 8.25mm thick. That larger size could potentially make room for more battery.\nIn a post on X on July 11, Majin Bu showed a video of a case for a thicker iPhone 17 Pro model, with the design likely based on the iPhone 17 Pro's rumored dimensions:\nNew A19 Pro chip could improve performance\nThere's been some back and forth about the chip for the rest of the iPhone 17 lineup, but rumors have consistently given the iPhone 17 Pro and Pro Max the A19 Pro chip.\nMore recently, MacRumors reported that a Weibo account known as Fixed Focus Digital said the iPhone 17 Air will also come with an A19 Pro chip, like the Pro models. But the Air would have a 5-core GPU, according to the rumor, whereas the iPhone 17 Pro and Pro Max would get a 6-core GPU. An upgraded GPU could improve graphics and video rendering.\nBattery life could get a big boost\nWhat good is a new phone if it doesn't last all day, right? The iPhone 17 Pro Max will get the biggest ever battery in an iPhone, the Weibo leaker known as Instant Digital said in a post on X, as reported by MacRumors. However, the site noted Instant Digital's spotty record with Apple rumors. If the Pro's dimensions are identical to the Pro Max's, as they're rumored to be, it stands to reason that the Pro could get the bigger battery, too.\nAnd Majin Bu posted on July 3 that the iPhone 17 Pro and Pro Max will feature a vapor chamber cooling system, which could help prevent the bigger battery from overheating.\niPhone 17 Pro release date expected in September\nIn the past several years, Apple has consistently announced its new phones on the first Tuesday of September after Labor Day. However, the first Tuesday is the day after Labor Day in 2025, so that could push the date for the iPhone event to Wednesday, Sept. 3 or Tuesday, Sept. 9. That would mean a release date of Sept. 12 or 19.\nThis likely will be the case with the full iPhone 17 lineup, with the exception of the iPhone 17E, which could arrive in early 2026, according to Apple analyst Ming-Chi Kuo and a report from The Information.\nThe iPhone 17 lineup may be the last to follow this fall-release model. Starting with the iPhone 18, Apple will reportedly split its phone releases so that lower-cost iPhones launch in the first half of the year and the higher-end Pro models become available later in the year. But that isn't expected to happen until 2026 so you can likely still expect the iPhone 17 Pro to become available this fall.\nPreorders for a new iPhone typically begin the Friday after the announcement, with the phone shipping a week later. Based on the expected announcement on Sept. 3 or 9, the preorder date could be either Sept. 5 or 12.\nTariffs could raise the price, but there are other factors\nTrump has raised, lowered and paused tariffs a dizzying number of times since February, all of which could affect the cost of the iPhone 17 Pro.\nApple, which says it could move much of US iPhone production from China to India, has escaped many of the tariff hikes thanks to a reciprocal tariff exemption list that includes many phones, laptops and other electronics that Apple produces.\nHowever, all the reprieves appear to be temporary so reciprocal tariffs could still affect prices by the time the iPhone 17 is released.\nTrump threatened Apple with a 25% tariff on all iPhones made outside the country in a social media post on May 23. Later that day, he said that all smartphones -- not just iPhones -- would be hit with the 25% tariff by the end of June if they don't move operations to the US.\nRegardless of how tariffs play out, Apple plans to raise iPhone prices later this year, The Wall Street Journal reported. Apple apparently plans to ascribe the price increase to better features and design costs so it can avoid pointing the finger at tariffs and incurring the wrath of Trump (like Amazon temporarily did).\nHolland points out that the iPhone is overdue for a price bump. He noted that Apple has never increased the price for an iPhone Pro ($999) since the iPhone X was first introduced in 2017.\nSo yes, you should expect to pay more for the iPhone 17, regardless of tariffs.\nRead more: Thinking About Buying a New iPhone? Here's Why You Should Wait\nAre new iPhone rumors and leaks to be trusted?\nHere's the part where I come in and say: Everything's a rumor until Apple officially releases the next iPhone. Rumors and speculation leading up to the iPhone's release are often based on insider knowledge or leaked information from teams working on the iPhone's designs, but those designs are works in progress -- not necessarily the final product."
    }
  ],
  "argos_summary": "The upcoming iPhone 17 Pro is rumored to feature a redesigned camera system with an upgraded telephoto lens capable of 8x optical zoom and a new camera control button. Additionally, it may include a scratch-resistant antireflective display and a variety of new colors, including a potential orange option. The phone is expected to be announced in September, with speculation about a price increase due to tariffs and enhanced features.",
  "argos_id": "2PSA2IFDS"
}