{
  "url": "https://www.cnn.com/2025/08/08/business/fannie-freddie-ipo",
  "authorsByline": "Alejandra Jaramillo, Samantha Delouya, Matt Egan, David Goldman",
  "articleId": "dfbc9d6da3da4ffeb2af32ee08ce9660",
  "source": {
    "domain": "cnn.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2176941020.jpg?c=16x9&q=w_800,c_fill",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T17:06:42.872000+00:00",
  "addDate": "2025-08-08T17:16:58.514278+00:00",
  "refreshDate": "2025-08-08T17:16:58.514280+00:00",
  "score": 1.0,
  "title": "Trump is planning a massive IPO of the government’s mortgage companies",
  "description": "President Donald Trump and his economic advisers are planning a historic sale of stock in Fannie Mae and Freddie Mac, the government-owned mortgage giants that help provide stability and affordability to America’s home loan market.",
  "content": "President Donald Trump and his economic advisers are planning a historic sale of stock in Fannie Mae and Freddie Mac, the government-owned mortgage giants that help provide stability and affordability to America’s home loan market.\n\nThe plans, first reported by the Wall Street Journal, have not yet been finalized, and Trump continues to weigh various options, according to a senior administration official. But the White House believes an initial public offering of up to 15% of the two companies’ shares could raise $30 billion, which could make it the largest IPO in history.\n\nThe president has been weighing an IPO for years. Trump’s first administration tried — and failed — to privatize Fannie and Freddie from the government conservatorship. But Trump has renewed his effort in his second term. In May, he posted on Truth Social that he was “giving very serious consideration to bringing Fannie Mae and Freddie Mac public.” He said would consult with cabinet members and make a decision “in the near future.”\n\nTrump has met with various Wall Street bank CEOs in recent weeks, including JPMorgan’s Jamie Dimon, Goldman Sachs’ David Solomon and, this week, Bank of America’s Brian Moynihan, with whom Trump discussed a potential Fannie and Freddie IPO, according to a source familiar with their discussions.\n\nMany of Trump’s allies in the Republican Party have long advocated for ending the government conservatorship that Fannie and Freddie were placed under during 2008 global financial crisis. The conservatorship ensured their survival during the housing crisis that precipitated the Great Recession, but government control of the two entities was intended to be temporary.\n\nProponents say the companies are viable on their own, and returning Fannie and Freddie to the public could help raise money for a government that is flooded with debt.\n\nBut some economists have warned that attempts to privatize Fannie and Freddie could upset the balance in the mortgage market, making it even more expensive for Americans to borrow money to purchase a home. Mark Zandi, chief economist at Moody’s Analytics, estimated in 2024 that privatization could cost the typical American taking out a new mortgage between $1,800 and $2,800 per year.\n\nCritics have also noted that Fannie and Freddie have enormous backing from hedge fund investors, so much of the proceeds of an IPO would go to wealthy financial backers, not taxpayers.\n\nThe companies guarantee 70% of America’s mortgages. Although they don’t issue mortgages to borrowers, Fannie and Freddie help ensure America’s housing market functions properly: They buy mortgages from lenders and repackage them for investors, helping money flow in and out of the housing market.\n\nFannie and Freddie are both instrumental in making 30-year mortgages possible – and relatively affordable (although rates have surged in recent years for a variety of reasons).\n\nAn IPO would return Fannie and Freddie to their pre-2008 state, when they were publicly traded companies backed by the US Treasury. They were placed under government control on September 7, 2008, after facing massive losses amid crashing home values. A week later, Lehman Brothers collapsed, sparking a global financial crisis.",
  "medium": "Article",
  "links": [
    "https://www.cnn.com/2019/03/27/politics/donald-trump-memo-fannie-mae-freddie-mac/index.html",
    "https://www.wsj.com/finance/regulation/trump-aiming-to-ipo-fannie-mae-and-freddie-mac-later-this-year-13b138cf?mod=hp_lead_pos1",
    "https://www.cnn.com/2024/12/02/economy/fannie-mae-freddie-mac-mortgage-rates-housing/index.html",
    "https://www.cnn.com/2024/12/02/economy/fannie-mae-freddie-mac-mortgage-rates-housing",
    "https://www.cnn.com/2025/06/09/economy/fannie-mae-and-freddie-mac-private",
    "https://www.cnn.com/follow",
    "https://www.cnn.com/2025/05/21/business/trump-fannie-freddie-mortgage-privatization"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Fannie Mae",
      "weight": 0.09232684
    },
    {
      "name": "Freddie Mac",
      "weight": 0.08956284
    },
    {
      "name": "Fannie",
      "weight": 0.08859851
    },
    {
      "name": "Freddie",
      "weight": 0.087230474
    },
    {
      "name": "government control",
      "weight": 0.07571006
    },
    {
      "name": "Donald Trump",
      "weight": 0.07367844
    },
    {
      "name": "Trump",
      "weight": 0.07262516
    },
    {
      "name": "President Donald Trump",
      "weight": 0.0712746
    },
    {
      "name": "mortgages",
      "weight": 0.07037127
    },
    {
      "name": "various Wall Street bank CEOs",
      "weight": 0.06623896
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "IPO"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Politics"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.88818359375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.84765625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.60888671875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.595703125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.576171875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.52880859375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.453125
    }
  ],
  "sentiment": {
    "positive": 0.13183594,
    "negative": 0.4338379,
    "neutral": 0.43432617
  },
  "summary": "President Donald Trump is planning a historic IPO of Fannie Mae and Freddie Mac, the government-owned mortgage giants that provide stability and affordability to America's home loan market. The White House believes an initial public offering of up to 15% of the two companies' shares could raise $30 billion, making it the largest IPO in history. The plans have not yet been finalised. Critics argue that privatizing Fannie and Freddie could upset the balance in the mortgage market and make borrowing more expensive. An IPO would return the companies to their pre-2008 state, when they were publicly traded companies backed by the US Treasury.",
  "shortSummary": "President Donald Trump is considering a historic IPO of Fannie Mae and Freddie Mac, potentially raising $30 billion to support his economic goals.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "11586043e4884de8ada64d05c0e22013",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnn.com/2025/05/21/business/trump-fannie-freddie-mortgage-privatization",
      "text": "President Donald Trump on Wednesday said he soon planned to decide whether to privatize Fannie Mae and Freddie Mac, the government-sponsored entities that help provide stability and affordability to America’s home mortgage market.\n“I am giving very serious consideration to bringing Fannie Mae and Freddie Mac public,” Trump posted on his social media website, Truth Social, on Wednesday, saying he would consult with cabinet members and make a decision “in the near future.”\n“Fannie Mae and Freddie Mac are doing very well, throwing off a lot of CASH, and the time would seem to be right,” the post said.\nBut at a time when mortgage rates remain stubbornly high and home prices keep climbing, some economists have warned that attempts at privatizing Fannie and Freddie could upset the balance in the mortgage market, making it even more expensive for Americans to borrow money to purchase a home.\nMany of Trump’s allies in the Republican Party have long advocated for ending the government conservatorship that Fannie and Freddie were placed under after their role in the 2008 global financial crisis. Government control of the two entities was intended to be temporary.\nIn fact, Trump attempted to untangle Fannie and Freddie from US government control in 2019 during his first administration and failed.\nFannie and Freddie essentially grease the wheels of America’s home lending market by buying mortgages from lenders and repackaging them for investors. This helps enable a reliable flow of money, allowing mortgage lenders to offer more affordable mortgage rates to would-be homebuyers.\nMany experts credit the two entities with helping to prop up the 30-year fixed-rate mortgage, the most popular type of home loan in the US due to its relatively low monthly payments compared to shorter-term loans.\nBefore 2008, Fannie and Freddie were private companies, backed by the US Treasury – though both were originally created by the government. They were placed under government control on September 7, 2008, after facing massive losses amid crashing home values that ignited the Great Recession. A week later, Lehman Brothers collapsed, sparking a global financial crisis.\nPrivatizing Fannie and Freddie could spook the investors who buy up mortgage loans, leading them to demand a higher return for their investments and pushing up mortgage rates, experts warn.\nMark Zandi, chief economist at Moody’s Analytics, estimated in 2024 that privatization could cost the typical American taking out a new mortgage between $1,800 and $2,800 per year.\nFannie and Freddie are currently controlled by the Federal Housing Finance Agency (FHFA), which has been run by William Pulte since his confirmation in March. At that time, Pulte told CNN that any effort to privatize Fannie and Freddie would need to include “significant study” on what the effort might do to mortgage rates.\nThat may take a few years. In a note to clients on Wednesday, TD Cowen financial services and housing policy analyst Jaret Seiberg said he did not expect the Trump administration to attempt a spin-off until late 2026 or early 2027."
    },
    {
      "url": "https://www.cnn.com/2019/03/27/politics/donald-trump-memo-fannie-mae-freddie-mac/index.html",
      "text": "The Trump administration is calling on federal agencies to draft plans to overhaul the nation’s housing finance system, years after the US government seized the mortgage giants Fannie Mae and Freddie Mac.\nPresident Donald Trump on Wednesday signed a memo directing the Treasury Department and the Department of Housing and Urban Development to develop both legislative and regulatory plans to revamp the two companies still under the government’s control since the 2008 financial crisis, the White House said in a statement.\nTrump’s directive calls for ending the conservatorship of Fannie and Freddie and improve the federal government’s regulatory oversight over them.\nThe Treasury Department will spearhead drafting a reform plan for the two companies, while HUD will design a separate regulatory protocol to oversee the housing finance agencies.\n“The housing finance system of the United States is in urgent need of reform,” the President’s memo read, which noted three White House priorities: reducing taxpayer risk, expanding the private sector’s role and improving access to sustainable home ownership.\nThose plans should be delivered to the President “as soon as practicable,” the White House said in the statement.\nThe presidential memo comes as the Senate Banking Committee held two days of hearings on Capitol Hill on the viability of blueprint to reform the housing finance market. The proposal was introduced by Republican Sen. Mike Crapo of Indiana, chairman of the panel, in February.\n“I have long said that the status quo is not a viable option, and I consider it a top priority this Congress to find a comprehensive solution,” said Crapo on Tuesday in his opening remarks at the hearing.\nA spokeswoman for the senator did not immediately respond to comment from CNN on the President’s initiative.\nPolicy analysts were quick to note there were few signs of progress reform, a top priority for Crapo.\n“Nothing we heard … on reform of Fannie and Freddie convinced us that Congress is ready to act,” wrote Jaret Seiberg, managing director at Cowen Washington Research Group, in a note to clients.\nFannie and Freddie, along with other government-insured mortgages, currently dominate the mortgage market with roughly 70% of all mortgages touched by the federal government.\nTreasury Secretary Steven Mnuchin has previously said he would prioritize working with Congress this year on a bipartisan basis to fix the government-sponsored enterprises and relinquish them from conservatorship.\nIn a statement on Wednesday, the secretary endorsed the President’s move, saying, “We support a system that provides for access to lending for hardworking Americans, while also protecting taxpayers from risk.”\nAmong the criteria laid out in the presidential memo includes asking Treasury to craft a plan that would minimize risks to the financial system, provide that the federal government be “properly compensated” for any explicit or implicit support it provides to the GSEs or the secondary mortgage market.\nTreasury’s reform plan should also preserve homeowners access to 30-year fixed-rate mortgages, establish adequate capital and liquidity requirements for Fannie and Freddie and expand the private sector’s share of the US mortgage market, among other factors. The White House is also asking the agency to specify whether each proposed reform would require approval from Congress or could be done administratively.\nThe President also asked HUD to prepare a list of its own reform proposals, including determining the benefits and risks tied to providing assistance to first-time homebuyers, including down payment assistance."
    },
    {
      "url": "https://www.cnn.com/2025/06/09/economy/fannie-mae-and-freddie-mac-private",
      "text": "A long-held stake by a handful of hedge funds may finally yield returns under the Trump administration, but it risks sending shockwaves through America’s $12 trillion mortgage market.\nLast month, President Donald Trump said he had plans to take mortgage financing giants Fannie Mae and Freddie Mac public. Such a move would end 17 years of federal government conservatorship over the two companies, which have played a central role in America’s housing finance system by providing liquidity to the mortgage market.\nSome experts warn that severing Fannie and Freddie from government control could raise mortgage rates and restrict access to popular mortgage products — like the 30-year fixed loan — at a time when housing affordability remains out of reach for many Americans. Last week, Senate Democrats sent a letter to William Pulte, who leads the Federal Housing Finance Agency, asking him to pause efforts to take the two public, citing the risk that it could increase costs for homebuyers.\nA group of investors has been anxiously awaiting the day Fannie and Freddie return to the public markets. None has been more vocal than billionaire investor Bill Ackman, whose hedge fund, Pershing Square Capital, is one of the largest holders of common shares in Fannie and Freddie.\n“We have been leading the charge on behalf of all (Fannie and Freddie) shareholders to help them to exit from conservatorship,” Ackman posted on social media on Tuesday. A representative for Ackman pointed to his commentary on social media when asked about Pershing Square’s current stake.\nAckman isn’t the only hedge fund investor who bet on Fannie and Freddie after the government seized them during the 2008 financial crisis, when both were on the brink of collapse.\nOther investors, including billionaire hedge fund managers Carl Icahn and John Paulson, have previously disclosed stakes in Fannie and Freddie, though neither responded to CNN’s request for information about the current size of their stakes.\nTaking the two mortgage giants public may be challenging, said Lori Goodman, a fellow at the Urban Institute, who has studied the history of Fannie Mae and Freddie Mac.\nTogether, Fannie and Freddie’s total net worth is more than $150 billion. Goodman estimates any public offering of Fannie and Freddie shares would likely eclipse the largest IPO in history: state-owned oil company Saudi Aramco, which raised $26 billion when it went public in 2019.\n“This is an enormously complicated undertaking,” she said.\nFannie and Freddie were never meant to permanently remain in a conservatorship arrangement, but Trump failed in an initial attempt to spin them off during his first administration.\nInvestors are wagering that his next try will be successful. Shares of Fannie (FNMA) and Freddie (FMCC), which trade over the counter, surged after Trump was elected in November. In the last year, shares of Fannie’s stock are up nearly 500% and Freddie’s gained nearly 400%.\nHomebuyers could pay more\nFannie and Freddie essentially grease the wheels of America’s home lending market, one of the world’s largest, by buying mortgages from lenders and repackaging them for investors. This helps enable a reliable flow of money to mortgage lenders, allowing them to offer more affordable rates to would-be homebuyers. Today, the mortgage giants guarantee more than half of America’s mortgages, according to the FHFA.\nGoodman said she expects that any plan to take the companies public would lead to higher borrowing costs for homebuyers.\nThe risk is that spinning off Fannie and Freddie could unsettle investors without the assurance of a government backstop, like the one provided during the 2008 crisis. In response, lenders might demand higher rates, especially from lower-income borrowers.\n“You’ve got a trillion-dollar mortgage-backed securities market, both single-family and multi-family, that they’re a critical part of,” Goodman said of Fannie and Freddie. “You can’t tamper with the government guarantee without upsetting that huge market.”\nLast month, Trump addressed the issue of the government’s guarantee, writing on social media: “I am working on TAKING THESE AMAZING COMPANIES PUBLIC, but I want to be clear, the U.S. Government will keep its implicit GUARANTEES, and I will stay strong in my position on overseeing them as President.”\nBut a social media post might not be enough to assure investors in the multitrillion-dollar mortgage-backed securities market, Goodman said. It is possible that Fannie and Freddie could pay a fee to assure the government’s guarantee long-term, but that cost would also likely be passed on to homebuyers, she added.\nAny rise in mortgage rates would likely be unwelcome news to prospective homebuyers, who have been grappling with elevated borrowing costs since the Federal Reserve hiked its benchmark interest rate in 2022 to combat inflation. Mortgage rates, which track the 10-year Treasury yield, have recently been climbing again as growing concerns about the national debt and Trump’s tariff policy have fueled fears of an economic slowdown.\nDemocrats have criticized the Trump administration’s plans to overhaul Fannie and Freddie. Last week’s letter to Pulte, the Federal Housing Finance Agency director, accused the Trump administration of being primarily motivated by “rewarding President Trump’s billionaire campaign contributors.”\n“We have serious concerns that you plan to make significant changes to the Enterprises in a way that would put investor profits over the homes of millions of Americans,” Senate Democrats wrote in the letter.\nThere is also the question of whether it makes sense to release Fannie and Freddie into the public market in their current form, said Norbert Michel, a director at the Cato Institute, a libertarian think tank.\n“This system of privatized profit and socialized loss is what led to the 2008 crisis in the first place,” Michel said. “Under no circumstances should they be released as they were prior.”\n“That was a bad system. We should not have that system,” he added.\nA risky trade\nIt remains unclear what exactly the Trump administration plans to do with Fannie and Freddie, which means it’s also unclear whether hedge fund stakes, such as Ackman’s, are worth anything at all.\nThat’s because, as part of the conservatorship agreement, the US Treasury owns a preferential stake in Fannie and Freddie that takes priority over all other shareholders: Fannie and Freddie must pay back a $190 billion debt to the government for its bailout assistance before it can exit its conservatorship, which would prevent other shareholders from making a profit.\nAckman has advocated for the removal of the government’s preferred shares, arguing that Fannie and Freddie have already paid back more money than it cost to bail them out. Since entering conservatorship, the two companies have paid $301 billion in dividends to the Treasury.\n“(Fannie and Freddie) shareholders don’t have their hands out. The opposite is the case,” Ackman wrote last week on social media. “(Fannie and Freddie) shareholders are simply seeking credit for payments that have already been made to the government so that a release from conservatorship can occur.”\nBut financial analysts say investing in Fannie and Freddie is risky.\n“At the moment, on an economic basis, the private shareholders’ equity is about negative $200 billion, because that is what Fannie and Freddie owe the government,” said Bose George, a managing director at Keefe, Bruyette & Woods, a boutique investment banking company. “Owning the shares is speculative because you’re making an assumption that the government is going to forgive this debt.”"
    }
  ],
  "argos_summary": "President Donald Trump is considering a historic IPO for Fannie Mae and Freddie Mac, potentially raising $30 billion and ending their 17-year government conservatorship. While proponents argue that privatization could stabilize the mortgage market, critics warn it may lead to higher borrowing costs for homebuyers and disrupt the housing finance system. Economists estimate that privatization could increase mortgage costs for Americans by up to $2,800 annually, raising concerns about affordability in an already challenging housing market.",
  "argos_id": "316WOXANO"
}