{
  "url": "https://www.sciencealert.com/plastics-impact-on-health-costs-1-5-trillion-every-year-report-warns",
  "authorsByline": "AFP",
  "articleId": "36f07942bdab46ac98adc926394d9e83",
  "source": {
    "domain": "sciencealert.com",
    "paywall": false,
    "location": {
      "country": "pt",
      "county": "Faro",
      "city": "Alcoutim",
      "coordinates": {
        "lat": 37.402329300000005,
        "lon": -7.6690393944051864
      }
    }
  },
  "imageUrl": "https://www.sciencealert.com/images/2025/08/plastic_and_shells_header.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-09T02:00:11+00:00",
  "addDate": "2025-08-09T02:14:53.083487+00:00",
  "refreshDate": "2025-08-09T02:14:53.083489+00:00",
  "score": 1.0,
  "title": "Plastic's Impact on Health Costs $1.5 Trillion Every Year, Report Warns",
  "description": "Plastic pollution is a \"grave, growing and under-recognised danger\" to health that is costing the world at least $1.5 trillion a year, experts warned in a report on Monday.",
  "content": "Plastic pollution is a \"grave, growing and under-recognised danger\" to health that is costing the world at least $1.5 trillion a year, experts warned in a report on Monday.\n\nThe new review of the existing evidence, which was carried out by leading health researchers and doctors, was published one day ahead of fresh talks opening in Geneva aiming to seal the world's first treaty on plastic pollution.\n\n\"Plastics cause disease and death from infancy to old age and are responsible for health-related economic losses exceeding US$1.5 trillion annually,\" said the review in The Lancet medical journal.\n\nRelated: Study Reveals The Shocking Amount of Plastic We Breathe in Every Day\n\nComparing plastic to air pollution and lead, the report said its impact on health could be mitigated by laws and policies.\n\nThe experts called for the delegates from nearly 180 nations gathering in Geneva to finally agree to a treaty after previous failed attempts.\n\nPhilip Landrigan, a doctor and researcher at Boston College in the United States, warned that vulnerable people, particularly children, are most affected by plastic pollution.\n\n\"It is incumbent on us to act in response,\" he said in a statement.\n\n\"To those meeting in Geneva: please take up the challenge and the opportunity of finding the common ground that will enable meaningful and effective international cooperation in response to this global crisis.\"\n\nThe researchers also warned about tiny pieces of plastic called microplastics, which have been found throughout nature – and throughout human bodies.\n\nThe full effect of microplastics on health are not yet fully known, but researchers have sounded the alarm about the potential impact of this ubiquitous plastic.\n\nThe amount of plastic produced by the world has risen from two million tonnes in 1950 to 475 million tonnes in 2022, the report said. The number is projected to triple by 2060.\n\nYet currently less than 10 percent of all plastic is recycled, it added.\n\nLandrigan said that the world's plastic \"crisis\" is connected to its climate crisis. Plastic is made from fossil fuels.\n\n\"There is no understating the magnitude of both the climate crisis and the plastic crisis,\" Landrigan said.\n\n\"They are both causing disease, death and disability today in tens of thousands of people, and these harms will become more severe in the years ahead as the planet continues to warm and plastic production continues to increase,\" he said.\n\nThe report also announced a new effort to track the impact plastic pollution has on health, the latest in a series called The Lancet Countdown.",
  "medium": "Article",
  "links": [
    "https://doi.org/10.1016/S0140-6736(25)01447-3",
    "https://www.sciencealert.com/study-reveals-the-shocking-amount-of-plastic-we-breathe-in-every-day",
    "https://www.eurekalert.org/news-releases/1093445"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Plastic pollution",
      "weight": 0.121397674
    },
    {
      "name": "plastic pollution",
      "weight": 0.121397674
    },
    {
      "name": "Plastic",
      "weight": 0.11102598
    },
    {
      "name": "Plastics",
      "weight": 0.11102598
    },
    {
      "name": "plastic",
      "weight": 0.11102598
    },
    {
      "name": "plastic production",
      "weight": 0.10963487
    },
    {
      "name": "leading health researchers",
      "weight": 0.09945553
    },
    {
      "name": "Health",
      "weight": 0.08820364
    },
    {
      "name": "health",
      "weight": 0.08820364
    },
    {
      "name": "air pollution",
      "weight": 0.070352405
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Science"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.93408203125
    },
    {
      "name": "/Health/Public Health/Other",
      "score": 0.5546875
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Waste Management",
      "score": 0.459716796875
    },
    {
      "name": "/Science/Ecology & Environment/Other",
      "score": 0.423095703125
    }
  ],
  "sentiment": {
    "positive": 0.06958008,
    "negative": 0.66552734,
    "neutral": 0.26489258
  },
  "summary": "Plastic pollution is a \"grave, growing and under-recognised danger\" to health, costing the world at least $1.5 trillion a year, according to a report by leading health researchers and doctors. The report compared plastic to air pollution and suggested that its impact on health could be mitigated by laws and policies. It also warned about tiny plastic pieces called microplastics, which have been found throughout nature and throughout human bodies. The amount of plastic produced by the world has risen from two million tonnes in 1950 to 475 million tonnes by 2022, with the number expected to triple by 2060. Currently, less than 10 percent of all plastic is recycled. The researchers also announced a new effort to track the impact of plastic pollution on health, The Lancet Countdown.",
  "shortSummary": "Experts warn that plastic pollution costs the world $1.5 trillion annually, urging international cooperation and addressing its growing health risks, including disease and death from under-recognized causes.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b7ad70d0bb7b42008572b408e6f85f2a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.eurekalert.org/news-releases/1093445",
      "text": "A new report published in The Lancet issues a fresh clarion call: plastic pollution is a grave and growing danger to human and planetary health. As Ministers and diplomats arrive in Geneva for the final round of talks to conclude a global plastics treaty, the report provides the most up-to-date assessment of the links between health and plastic pollution across the full life cycle of plastic.\nAn estimated 8 billion metric tons of plastic waste now pollute the planet. Micro- and nanoplastic particles and multiple plastic chemicals are found in the most remote reaches of the environment and in the bodies of marine and terrestrial species worldwide, including humans. Plastics harm human health at every stage of the plastic life cycle, and at every stage of human life. While we are all affected, vulnerable populations bear a disproportionate burden. This new report chronicles the impacts of plastics and plastic pollution for disease and death from infancy to old age, and highlights the significant health-related economic costs.\nWhile the impacts of plastic pollution on human health and the environment are growing, a worsening of plastics’ harms is not inevitable. UN Member States will gather in Geneva, Switzerland from 5 – 14 August 2025 for the expected final round of talks to conclude a global plastics treaty to end plastic pollution. The mandate for these negotiations, unanimously agreed at UNEA5.2 in 2022, is to develop an international legally binding instrument on plastic pollution, including in the marine environment, based on a comprehensive approach that addresses the full life cycle of plastic.\nProf Philip Landrigan, MD, a paediatrician and epidemiologist, Director of the Global Observatory on Planetary Health at Boston College - and the lead author of the new report - emphasised the imperative for the global plastics treaty to include measures that protect human health and the environment across the full life cycle of plastic: “We know a great deal about the range and severity of the health and environmental impacts of plastic pollution across the full life cycle of plastic. These impacts fall most heavily on vulnerable populations, especially infants and children. They result in huge economic costs to society. It is incumbent on us to act in response. To those meeting in Geneva: please take up the challenge and the opportunity of finding the common ground that will enable meaningful and effective international cooperation in response to this global crisis.”\nCoincident with the expected finalization of the global plastics treaty, the report also announces the launch of an independent, health-focused global monitoring system on plastics: The Lancet Countdown on Health and Plastics. The Countdown is inspired by the model and impact of the Lancet Countdown on Health and Climate Change (https://lancetcountdown.org). Prof Joacim Rocklöv, Heidelberg University, Co-Chair of the new Countdown and also Regional Co-Director, Europe, of the Lancet Countdown on Health and Climate Change said: “Through its publications, the Lancet Countdown on Health and Climate Change has moved consideration of climate change’s health impacts to the mainstream of the climate conversation, and played a key role in the decision to incorporate an explicit focus on human health into the annual climate negotiations, beginning with COP 28. This new Countdown will provide the data to ensure that health remains at the centre of the plastics pollution conversation.”\nThe new Countdown will identify and regularly report on a suite of scientifically meaningful and geographically and temporally representative indicators across all stages of the plastic life cycle, and track progress towards minimising exposures and mitigating human health impacts. In doing so, the Countdown will provide independent data that can continue to inform decision-making for the benefit of public health.\nMargaret Spring, one of the report’s co-authors and Co-Lead of one of the working groups within the new Lancet Countdown, said: “Decision-makers around the world will need access to the best available scientific evidence to guide the implementation and development of this important treaty in the months and years to come. The Countdown reports will offer a robust, independent, and accessible data source that can help to inform development of effective policies addressing plastic pollution at the international, regional, national, sub-national and local levels.”\nThe Countdown will develop and track indicators across four domains: Production and Emissions, Exposures, Health Impacts, and Interventions and Engagement. The first three domains follow a classic source-exposure-effects model, and provide a framework for tracking plastics’ impacts on human health across every stage of the plastic life cycle. The fourth domain will track interventions across the plastic life cycle that have the potential to affect exposures and human and planetary health, as well as activities that enable and support these interventions.\nProf Sarah Dunlop, Director, Plastics & Human Health at Minderoo Foundation, a philanthropic foundation which is the principal supporter of the new Countdown, said: “Our knowledge of the impacts of plastics on human health is growing all the time, and signal a need for immediate action. In 2023, the Minderoo Monaco Commission on Plastics and Human Health concluded that plastics endanger human health at every stage of their life cycle – in production, use, and on disposal. This report looks at the breadth of new information that has emerged in the short time since, which has included even more evidence of the range of harms associated with a number of toxic groups of chemicals that are commonly used in the plastic products we encounter every day.”\nDr Herve Raps, Research Delegate Physician, Centre Scientifique de Monaco, one of the report’s co-authors and Co-Lead of one of the working groups within the new Lancet Countdown, said: “Protection of human health and the environment should be our guiding star; to achieve this, we know that addressing the harms associated with plastics and plastic chemicals across the full life cycle of plastics is necessary.”\nJournal\nThe Lancet\nArticle Title\nThe Lancet Countdown on health and plastics\nArticle Publication Date\n3-Aug-2025"
    },
    {
      "url": "https://www.sciencealert.com/study-reveals-the-shocking-amount-of-plastic-we-breathe-in-every-day",
      "text": "According to a new study, humans can inhale more than 70,000 microplastic particles each day in an indoor environment – far more than previously thought. Worse still, most of them are small enough to penetrate deep into our lungs.\nPlastic is one of the defining environmental issues of our time, clogging up everything from our waterways to our bloodstreams. Tiny particles of the stuff enter our bodies not just through what we eat and drink but through the very air we breathe.\nRelated: You Inhale a Credit Card of Plastic Every Week. Here's Where It Goes.\nIn a new study, scientists from the Université de Toulouse in France quantified just how much plastic dust we may be inhaling every day. The team took 16 indoor air samples from their own apartments and cars, then analyzed them using a technique called Raman spectroscopy to measure the concentration of microplastics floating around in there.\nAnd, it turns out, it's a lot. The median concentration for apartment air samples were 528 microplastic particles per cubic meter, and a whopping 2,238 particles per cubic meter in cars. Of those particles, 94 percent were less than 10 micrometers wide, which is small enough to work their way deep into lung tissue when inhaled.\nFrom this and other research, the team estimated that adults inhale roughly 71,000 microplastic particles from these environments every single day, with 68,000 of them being sub-10 micrometers.\n\"The concentration we found is 100-fold higher than previous extrapolated estimates,\" the authors say.\n\"People spend an average of 90 percent of their time indoors, including homes, workplaces, shops, transportation, etc., and all the while they are exposed to microplastic pollution through inhalation without even thinking about it.\"\nExactly what those microplastics get up to once they're in our bodies remains uncertain, but scientists suspect it's nothing good. Recent studies suggest they could increase the risk of certain cancers, fertility issues, stroke, and a range of other health problems.\nMore research is desperately needed to investigate the biological effects of microplastics, as well as ways we might be able to reduce exposure.\nThe research was published in the journal PLOS One."
    }
  ],
  "argos_summary": "A new report highlights the severe health risks posed by plastic pollution, estimating it costs the global economy at least $1.5 trillion annually. Experts warn that plastics, including microplastics, harm human health throughout life and disproportionately affect vulnerable populations, particularly children. As negotiations for a global treaty on plastic pollution commence in Geneva, researchers emphasize the need for effective international cooperation to address this escalating crisis.",
  "argos_id": "3GD8NRF46"
}