{
  "url": "https://www.yahoo.com/news/articles/family-owned-insurance-company-springfield-010700614.html",
  "authorsByline": "Brooke Spurlock, Springfield News-Sun, Ohio",
  "articleId": "c7381915f29e4a7ca4eaab6f9394a53b",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-09T01:07:00+00:00",
  "addDate": "2025-08-09T01:41:16.216675+00:00",
  "refreshDate": "2025-08-09T01:41:16.216677+00:00",
  "score": 1.0,
  "title": "Family-owned insurance company in Springfield on its fourth generation owner",
  "description": "Aug. 8—A Springfield insurance company that has been in business for more than 90 years in the area is on its fourth generation of family owners. Tim Elliott III is the fourth generation owner of Elliott Insurance Agency, which has been serving the area since 1933. \"I feel incredibly fortunate to be part of a long-standing family business. It's a privilege to carry on the legacy built by the ...",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nAug. 8—A Springfield insurance company that has been in business for more than 90 years in the area is on its fourth generation of family owners.\n\nTim Elliott III is the fourth generation owner of Elliott Insurance Agency, which has been serving the area since 1933.\n\n\"I feel incredibly fortunate to be part of a long-standing family business. It's a privilege to carry on the legacy built by the generations before me,\" he said. \"Stepping into their shoes comes with its challenges — the standards they set were high — but I'm committed to upholding the same level of trust, service and integrity our clients have relied on for generations.\"\n\nElliot's great-grandfather, Burgess Elliott, founded the business in 1933 as Elliott Law & Will. In 1980, his grandfather, Tim Elliott, transitioned it into what became Elliot Insurance. His father, Todd Elliott, joined the agency in 1986 and \"remained an integral part\" of the business of decades.\n\nIn 2020, Elliott and his brother-in-law, Tim Sloan, took over ownership to \"continue the family legacy into its fourth generation.\"\n\n\"My grandfather and father remained actively involved for five years to ensure a smooth and thoughtful transition, and we're proud to carry forward the values and service that have defined our agency for over 90 years,\" Elliott said.\n\nElliott is committed to growing the agency, expanding its impact and building \"one of the strongest, most dedicated insurance teams in Ohio,\" he said.\n\nGrowing the agency starts with the staff, Elliott said, by focusing on developing talent, hiring people who make an impact, building strong relationships in the community and expanding its digital presence.\n\n\"My goal is to honor our family legacy by delivering the same exceptional customer service our clients have always known — and to raise the bar even higher,\" he said. \"Our goal is to be a trusted resource for individuals, families and businesses. I want our agency to be known not just for what we do, but for the trust and support we provide every step of the way.\"\n\nThe agency has two locations, one at 1317 E. High St. in Springfield and the other at 113 E. High St. in Piqua. For more information, visit www.elliottinsurance.com.",
  "medium": "Article",
  "links": [
    "http://www.elliottinsurance.com"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Tim Elliott",
      "weight": 0.09643579
    },
    {
      "name": "Tim Elliott III",
      "weight": 0.0933775
    },
    {
      "name": "Elliott Insurance Agency",
      "weight": 0.09171315
    },
    {
      "name": "Burgess Elliott",
      "weight": 0.09139669
    },
    {
      "name": "Elliott Law",
      "weight": 0.08963279
    },
    {
      "name": "Todd Elliott",
      "weight": 0.089215524
    },
    {
      "name": "Elliott",
      "weight": 0.088992134
    },
    {
      "name": "family owners",
      "weight": 0.082516275
    },
    {
      "name": "families",
      "weight": 0.072244816
    },
    {
      "name": "generations",
      "weight": 0.071227044
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.958984375
    },
    {
      "name": "/News/Local News",
      "score": 0.58935546875
    },
    {
      "name": "/News/Other",
      "score": 0.39404296875
    },
    {
      "name": "/Finance/Insurance/Other",
      "score": 0.3720703125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.3212890625
    }
  ],
  "sentiment": {
    "positive": 0.7290039,
    "negative": 0.062927246,
    "neutral": 0.20837402
  },
  "summary": "Family-owned insurance company in Springfield, Ohio, Elliott Insurance Agency, has been owned by Tim Elliott III, the fourth generation owner of the company. The company has been serving the area since 1933 and has been in business for over 90 years. Elliott's great-grandfather, Burgess Elliott, founded the business in 1933 and his grandfather, Tim Elliott, transitioned it into what became Elliot Insurance. His father, Todd Elliott, joined the company in 1980 and remained actively involved for five years to ensure a smooth transition. In 2020, Elliott and his brother-in-law, Tim Sloan, will take over ownership to continue the family legacy. Elliott aims to grow the agency, expand its impact and build \"one of the strongest, most dedicated insurance teams in Ohio.\"",
  "shortSummary": "Tim Elliott III, the fourth generation owner of Springfield's Elliott Insurance Agency, aims to uphold the family legacy through enhanced customer service and collaboration.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7abfee788856435b813bacc361e1690a",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Elliott Insurance Agency, a Springfield-based company founded in 1933, is now under the leadership of Tim Elliott III, marking its fourth generation of family ownership. Tim Elliott expresses pride in continuing the legacy established by his great-grandfather and emphasizes a commitment to maintaining high standards of trust and service. The agency aims to grow by developing talent, enhancing community relationships, and expanding its digital presence, while delivering exceptional customer service.",
  "argos_id": "4CBKQE6FX"
}