{
  "url": "https://www.foxnews.com/politics/illinois-gov-jb-pritzker-lambasted-new-disastrous-policy-requiring-mental-health-screenings-kids",
  "authorsByline": "Morgan Phillips",
  "articleId": "bc581c11fb464f04879cab96e9f4c542",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/08/931/523/pritzker-clasroom.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T11:25:02-04:00",
  "addDate": "2025-08-08T15:42:02.962198+00:00",
  "refreshDate": "2025-08-08T15:42:02.962201+00:00",
  "score": 1.0,
  "title": "Illinois gov JB Pritzker lambasted for new ‘disastrous policy’ requiring mental health screenings for kids",
  "description": "Gov. JB Pritzker signs controversial law mandating mental health screenings in Illinois schools for grades three through 12, sparking debate over state overreach.",
  "content": "A new Illinois law requiring annual mental health screenings for public school students is drawing backlash from parents, policy experts and lawmakers who warn the policy may overstep boundaries and wrongly label children.\n\nGov. J.B. Pritzker signed the measure on July 31, making Illinois the first state in the country to mandate mental health screenings for students in grades three through 12.\n\nThe law, set to take effect in the 2027–2028 school year, directs schools to provide self-conducted screenings each year using digital or paper forms. Parents will have the ability to opt their children out.\n\nSupporters say the initiative will help schools identify early signs of depression, anxiety or trauma — before they develop into crises. But critics argue the plan could create more problems than it solves.\n\n\"I want to be on-the-record and crystal clear. This is a disastrous policy that will do vastly more harm than good,\" Abigail Shrier, a fellow at the Manhattan Institute, wrote on X. \"Watch as tens of thousands of Illinois kids get shoved into the mental health funnel and convinced they are sick. Many or most of which will be false positives.\"\n\nKatherine Boyle, a partner at venture capital firm Andreessen Horowitz, also raised concerns about government overreach and what she called the \"mental health industrial complex.\"\n\n\"If a school nurse or a state-mandated mental health test tells you you’re sick, you’re going to believe them,\" Boyle wrote. \"This is why so many families are opting out of primary school completely — the overreach is astounding.\"\n\nIllinois education officials say the screenings will not be diagnostic and are designed to flag students who may benefit from further evaluation. The Illinois State Board of Education will develop the screening tools and guidelines by September 2026, and school districts will be responsible for implementing them.\n\n\"Mental health is essential to academic readiness and lifelong success,\" State Superintendent Tony Sanders said in a statement. \"Too often, we only recognize a student’s distress when it becomes a crisis. With universal screening, we shift from reaction to prevention.\"\n\nDana Weiner, chief officer of the governor’s Children’s Behavioral Health Transformation Initiative, said the screenings will be optional for families and conducted privately.\n\nState Sen. Laura Fine, a Democrat and lead sponsor of the bill, said the effort aims to normalize mental health care for children and teens. \"The screenings will be designed to catch the early signs of anxiety, depression or trauma before it becomes a crisis or, in some cases, sometimes too late,\" she said.\n\nRepublican lawmakers in the state have also voiced opposition. Rep. Steve Reick (R‑Woodstock) warned the law could have unintended consequences for families dealing with insurance companies.\n\n\"Universal mental health screenings are going to get us nothing except possibly finding things, finding reasons for denial of coverage of insurance,\" Reick said.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nRep. Adam Niemerg (R‑Dieterich) called the law \"a very dangerous piece of legislation that removes parental rights.\"\n\n\n\nFox News Digital reached out to Pritzker's office for comment and has not yet received a reply.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/category/person/jb-pritzker",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/video/6372628039112",
    "https://www.foxnews.com/category/health/mental-health",
    "https://www.foxnews.com/politics/dem-governor-expected-defend-states-controversial-sanctuary-policies-during-gop-led-hearing",
    "https://www.foxnews.com/category/us/us-regions/midwest/illinois",
    "https://www.foxnews.com/media/oklahoma-requires-america-first-certification-test-teachers-fleeing-blue-states"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "mental health screenings",
      "weight": 0.1174572
    },
    {
      "name": "Universal mental health screenings",
      "weight": 0.11115705
    },
    {
      "name": "annual mental health screenings",
      "weight": 0.11093635
    },
    {
      "name": "Mental health",
      "weight": 0.102740705
    },
    {
      "name": "mental health care",
      "weight": 0.09745223
    },
    {
      "name": "universal screening",
      "weight": 0.08127304
    },
    {
      "name": "public school students",
      "weight": 0.078709885
    },
    {
      "name": "primary school",
      "weight": 0.0710204
    },
    {
      "name": "school districts",
      "weight": 0.07026577
    },
    {
      "name": "Illinois gov JB Pritzker",
      "weight": 0.07022485
    }
  ],
  "topics": [
    {
      "name": "Social Issues"
    },
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Health"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.984375
    },
    {
      "name": "/Jobs & Education/Education/Primary & Secondary Schooling (K-12)",
      "score": 0.939453125
    },
    {
      "name": "/News/Local News",
      "score": 0.85498046875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.73291015625
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.5986328125
    },
    {
      "name": "/People & Society/Family & Relationships/Family/Other",
      "score": 0.5234375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.30615234375
    }
  ],
  "sentiment": {
    "positive": 0.06604004,
    "negative": 0.6425781,
    "neutral": 0.29174805
  },
  "summary": "A new Illinois law requires annual mental health screenings for public school students, making it the first state in the country to mandate such measures. The law, set to take effect in the 2027–2028 school year, requires schools to provide self-conducted screenings each year using digital or paper forms. Critics argue the policy could create more problems than it solves and may lead to false identification of children. Parents can opt their children out of the screenings. The screenings will not be diagnostic and are designed to flag students who may benefit from further evaluation. Critics have also raised concerns about government overreach and the potential unintended consequences for families dealing with insurance companies.",
  "shortSummary": "A new Illinois law mandates annual mental health screenings for public school students, sparking concerns from parents and policy experts about potential harm and confusion.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e7f9336d734043908e415c2d625df8c7",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/category/health/mental-health",
      "text": "VIDEO 9 hours ago Georgia AG commends state, federal response after Army base shooting Georgia Attorney General Chris Carr discusses lingering questions about the Fort Stewart Army base shooting on ‘America’s Newsroom.’\nHealth 14 hours ago Supplement sold at gas stations sparks health fears as people report addiction symptoms Users of Botanic Tonics' Feel Free tonic report severe addiction, spending up to $3,000 monthly on the kratom and kava supplement that is sold at gas stations.\nJoe Biden 2 days ago Biden's doctor thought cognitive tests were 'meaningless,' ex-aide Bruce Reed told investigators Former Biden aide Bruce Reed told Congress that the former president's doctor viewed cognitive tests as ‘meaningless’ and that the campaign expected debate questions on mental acuity.\nZohran Mamdani 2 days ago Replace cops with social workers, 'transit ambassadors' on some 911 calls: Mamdani Democratic mayoral candidate Zohran Mamdani defends public safety plan calling for mental health teams, other civilians to handle certain 911 calls as alternative to hiring more NYPD officers.\nHealth 2 days ago Deadly drug stronger than fentanyl spreads rapidly across the Americas, experts warn Little-known nitazenes synthetic opioids evade standard drug tests while causing overdose deaths, requiring specialized detection and multiple naloxone doses.\nVIDEO 4 days ago New survey reveals staggering toll of raising young children Child and adolescent family therapist Darby Fox discusses a new survey on the toll parents face while raising young children and gives advice for reducing stress on ‘Fox & Friends Weekend.’\nHealth 5 days ago Trick your brain into staying motivated with one simple psychology hack A new social media trend uses dopamine anchoring to transform dreaded tasks into rewarding activities by consistently pairing them with enjoyable stimuli.\nIndianapolis Colts 6 days ago Colts' Braden Smith says OCD battle nearly derailed NFL career, but faith journey helped reclaim football joy Indianapolis Colts offensive tackle Braden Smith found happiness in football again after he broke free from the strain obsessive-compulsive disorder placed on his life.\nHouse Of Representatives July 31 Longtime Biden aide testifies he stood to earn up to $8M had president won re-election Michael Donilon, an advisor to former President Joe Biden, sat down with House Oversight Committee investigators for roughly six hours Thursday.\nHealth July 31 Your daily sandwich could be making you sad and anxious, health experts warn Health professionals discuss whether gluten causes mood problems, emphasizing bread quality over elimination for better mental health and emotional resilience.\nHealth July 29 Deadly substance under scrutiny as kratom byproduct shows up in gas stations, smoke shops Health agencies are targeting 7-OH, a synthetic opioid more potent than morphine derived from kratom, amid rising medical events and addiction concerns across America.\nDrug and Substance Abuse July 29 Health officials warn of dangerous substance available in stores across the nation Health officials are attempting to get ahead of what could be another wave of addiction by issuing a scheduling recommendation for kratom byproduct 7-hydroxymitragynine (also known as 7-OH).\nOpinion July 28 DAVID MARCUS: I've seen enough human suffering in homeless encampments to know Trump's new policy is right Trump's executive order on homelessness gets it right. It distinguishes between financial homelessness and the deeper issues of addiction and mental illness requiring intervention.\nHealth July 25 Ozzy Osbourne's rare form of Parkinson's sparks questions about lifestyle factors Black Sabbath frontman Ozzy Osbourne died following his battle with a genetic form of Parkinson's disease, while a brain expert says the singer's lifestyle could have contributed.\nHealth July 23 Clint Eastwood's longtime secrets of good health and longevity revealed Clint Eastwood expert Shawn Levy reveals that the 95-year-old actor's health regimen includes Transcendental Meditation, which provides deep rest and dissolves stress.\nTravel July 22 Overdosing tourists in vacation hotspot are straining local health system Ibiza's ambulance services are overwhelmed, as a quarter of daily emergencies are linked to tourists experiencing drug and alcohol incidents at the island's popular nightclubs.\nHomicide July 21 'Go big or go home': Disturbing confession from husband who allegedly murdered wife and concealed her body A Texas man admitted to allegedly killing his wife and living with her decomposing body for a month, telling investigators he wanted to 'go big or go home' with his first offense.\nOpinion July 21 5 ways your political point of view may be damaging your mental health A clinical psychologist examines how the 'Five Ds' of political distancing may contribute to higher rates of anxiety and loneliness among liberals compared to conservatives\nVIDEO July 20 What are the health benefits, cheaper alternatives to eating caviar? Fox News contributor Dr. Nicole Saphier breaks down the health benefits of caviar, what good alternatives are and shares tips for managing 'time blindness.'\nVIDEO July 19 Domestic abuse survivors warn about Mamdani’s policies Domestic violence survivors Michelle Esquenazi and Jennifer Harrison share their stories of relying on the NYPD for help, as resurfaced comments from NYC mayoral candidate Zohran Mamdani show support for partially defunding the police.\nHealth July 18 Here's what marijuana really does to the developing brain, according to a psychiatrist Brain specialist Dr. Daniel Amen warns that marijuana use in teens and young adults is linked to higher rates of mental issues as research on cannabis' health impact develops.\nHealth July 18 Nicotine pouches pose alarming danger in US households, experts warn A recent study reveals nicotine pouch ingestions among children under 6 increased by 763% from 2020 to 2023, posing greater poisoning risks than other nicotine products.\nFox Nation July 18 Veterans cross border for forbidden psychedelic treatment that's changing lives after combat Veterans with PTSD find healing through ibogaine treatments in Mexico while Texas passes legislation to become a leader in researching the controversial psychedelic.\nVIDEO July 17 Greg Gutfeld: How do we give the Biden cover-up the justice it deserves? Fox News host Greg Gutfeld and guests discuss Hunter Biden bashing Democrats as the alleged cover-up of former President Joe Biden's decline continues on 'Gutfeld!'\nCrime July 17 California man arrested for brutal murder after being granted mental health diversion, having charges dropped A California case is highlighting tensions between mental health protections and public safety after suspect was charged with murder days after misdemeanor charges were dropped.\nHealth July 17 Prominent hospitals across America are halting gender surgeries and hormone treatments for minors Major hospitals including Rush Medical Center halt gender surgeries and hormone treatments for youth under age 18 following President Trump's executive order against procedures for minors.\nTech July 17 Spying camera vest deters attackers by recording them in action The new Urban Eyes safety vest features dual cameras, reflective panels and a wireless remote to deter harassers and provide peace of mind for outdoor workouts.\nVIDEO July 16 Jill Biden's 'work husband' pleads the Fifth in alleged White House scandal Fox News national correspondent Griff Jenkins has the latest on the House Oversight Committee's investigation into former President Joe Biden's alleged mental decline on 'Special Report.'\nTexas July 16 Texas psychiatrist reveals mental health challenges facing flood disaster survivors Mental health experts discuss the hidden toll of the Texas floods that victims will face long after emergency crews leave. Dr. Sabrina Browne shares warning signs with parents.\nHealth July 16 The key to living longer could be tied to a surprising substance, study suggests Psilocybin treatment, or magic mushrooms, showed cellular life extension in aged mice, according to Emory University researchers. The study co-author discusses the results."
    },
    {
      "url": "https://www.foxnews.com/category/person/jb-pritzker",
      "text": "Illinois 1 day ago Dem governor defies FBI: 'Unwelcome' to pursue Texas Democratic lawmakers Illinois Gov. JB Pritzker defends Texas lawmakers seeking sanctuary in Illinois from redistricting battle as Republicans push for FBI involvement.\nMedia 2 days ago Colbert confronts JB Pritzker with map showing Illinois gerrymandering Stephen Colbert showed Gov. JB Pritzker a map of Illinois on Tuesday that displayed gerrymandered districts during a discussion about the Texas GOP's efforts.\nDonald Trump 2 days ago Democrats' chair vows to fight 'tooth and nail' to stop Trump, Republicans, in redistricting battle Democratic Party leaders pledge aggressive response to Republican redistricting push ahead of 2026 midterms as both parties battle for House control.\nJ.B. Pritzker 3 days ago Texas Dems ripped for 'cartoonishly dumb' strategy to flee to blue state notorious for gerrymandering Texas Democratic lawmakers arrive in Illinois after fleeing their state to block a Republican redistricting vote that President Trump says could gain the GOP five new House seats\nOpinion July 21 I’m one of the voters Democrats need to win. 2028 is their only chance to regain our trust Young voters' satisfaction with Democrats declines as the party struggles with affordability issues, creating opportunity for authentic leadership in the 2028 presidential race\nMedia July 3 Illinois' population is aging 'faster' than the rest of the country, editorial warns Chicago Tribune editorial warns of Illinois' aging population, citing outmigration of young adults and declining birth rates as threats to the state's economic future.\nDonald Trump June 26 JB Pritzker takes aim at Trump in launching Democratic re-election bid for Illinois governor Gov. J.B. Pritzker seeks a third term as Illinois governor, emphasizing balanced budgets, minimum wage increases and abortion rights protection while becoming a vocal Democratic critic of President Donald Trump.\nIllinois June 25 Trump critic JB Pritzker expected to launch Democratic re-election bid for third term as Illinois governor Gov. J.B. Pritzker to seek third term in Illinois amid 2028 presidential speculation, continuing his role as a leading Democratic voice against Trump administration.\nImmigration June 12 Walz, Hochul, Pritzker face off with Congress as Newsom battles Trump Govs. Walz, Hochul and Pritzker will likely face questions surrounding the ongoing anti-ICE riots in Los Angeles.\nPolitics May 29 21 Democrats who may try to succeed Trump in the 2028 presidential election Here is a very early look at the Democratic Party politicians considered to be potential 2028 presidential contenders in the next race for the White House.\nDemocratic Party May 13 Less than 4 months into Trump's 2nd term, Dems are already eyeing the 2028 race Here is a very early look at the Democratic Party politicians considered to be potential 2028 presidential contenders in the next race for the White House.\nIllinois May 7 Protesters gather outside Pritzker mansion to disrupt Noem presser, only to find she was never actually there DHS told Fox that protesters mistakenly thought that Noem's presser would be at JB Pritzker's governor mansion, and wound up 'screaming' into the wind.\nImmigration May 7 Blue state governor in hot seat after parents harmed by sanctuary policies lash out: 'Gut punch' Jim Walden's family is among those who have lost loved ones to crimes committed by people in the country illegally, and he took aim at sanctuary policies in Illinois.\nPolitics May 7 Blue state governor vows 'resistance' as Trump admin targets sanctuary policies Gov. J.B. Pritzker, D-Ill., promised to meet President Donald Trump's administration with \"resistance\" on Wednesday.\nMedia May 3 JB Pritzker rips Trump as ‘authoritarian,’ responds to president calling out his weight Illinois Democratic Governor J.B. Pritzker slammed President Donald Trump during interview with late-night host Jimmy Kimmel on Thursday.\nPolitics April 29 Dem governor blasts Trump, Musk in new attack campaign as 2028 buzz grows Illinois Gov. JB Pritzker's campaign launched a new video series on President Donald Trump's 100th day in office amid speculation Pritzker will make a 2028 presidential run.\nPolitics April 29 Potential 2028 hopeful accused of 'inciting violence' after call for 'mass protests' against Trump Illinois Gov. J.B. Pritzker reignited speculation about his 2028 presidential ambitions this weekend, but his call for \"mass protests\" dominated headlines as Republicans accused him of \"inciting violence.\"\nJ.B. Pritzker April 28 Illinois gov calls for mass protests against Trump admin: GOP 'cannot know a moment of peace' Illinois Gov. JB Pritzker, a Democrat, lambasted President Donald Trump and his administration, calling for mass protests and declaring that Republican \"cannot know a moment of peace.\"\nPolitics April 26 2028 auditions for Democratic presidential nomination kick off as blue-state governor visits key early state Illinois Gov. JB Pritzker, a vocal critic of President Donald Trump, on Sunday becomes the first of the big-name potential 2028 Democratic White House hopefuls to visit a key primary state.\nJ.B. Pritzker April 24 Chicago residents blast a possible Pritzker presidential run: 'No chance to win' Chicago residents fumed over Democratic policies that have plagued Illinois when asked about Gov. J.B. Pritzker potentially running for president.\nHouse Of Representatives April 11 Sanctuary governors Walz, Pritzker, Hochul called to testify before Congress House Oversight Committee Chairman James Comer continues the investigation into sanctuary city policies by calling Govs. Walz, Hochul and Pritzker to testify at a May 15 hearing.\nPolitics March 23 Big-money WI high court race will have national effects, as redistricting, unions, trans issues at stake Liberal Judge Susan Crawford and conservative former Attorney General Brad Schimel are facing off in a high-stakes Wisconsin Supreme Court race April 1.\nPolitics March 19 Dem governor slams Trump's 'authoritarian rule' during 'better way forward' speech Gov. JB Pritzker, D-Ill., urged Democrats to fight and defend America's constitutional republic from the \"incompetence\" and “treachery\" of President Donald Trump.\nElections March 16 Heating up: Newsom, Pritzker, Buttigieg make early moves in 2028 presidential race Top Democrats, including Pete Buttigieg, Kamala Harris, JB Pritzker and Gavin Newsom, make early moves as speculation heats up for the 2028 White House race.\nPolitics March 13 Heating up: Pre-season moves in 2028 presidential race getting underway The early moves in the 2028 White House race, at least among the Democrats, are getting underway as potential presidential contenders grab plenty of attention\nPolitics March 10 Dem governor to headline major fundraiser in key presidential primary state stoking 2028 speculation Dem Gov. J.B. Pritzker of Illinois, a leading figure in the Trump opposition, sparks 2028 speculation with news that he will headline major party fundraiser in the key primary state of New Hampshire.\nImmigration February 28 Blue state governor's 'gross mismanagement' cost taxpayers $1.6B for illegal immigrant healthcare: audit An audit requested by GOP lawmakers shows Illinois Gov. Pritzker’s administration grossly underestimated the $1.6 billion price tag for state health programs for illegal immigrants.\nJ.B. Pritzker February 27 Illinois governor says Trump admin withholding $1.88B in approved taxpayer money, amid rift with president Illinois Gov. J.B. Pritzker pressed the White House to release $1.88 billion in approved federal funding that he says the Trump administration is withholding from the state.\nDonald Trump February 8 Pritzker trolls Trump by 'renaming' Lake Michigan as 'Lake Illinois,' joking he'd annex Green Bay Illinois Gov. J.B. Pritzker is renaming Lake Michigan to “Lake Illinois,\" poking fun at President Donald Trump’s recent executive order where he changed the Gulf of Mexico to Gulf of America.\nTrump's First 100 Days January 31 'Unfit to lead': Blue state governor lashes out at Trump for targeting DEI policies after DC plane crash Illinois Gov. JB Pritzker says President Donald Trump is failing to lead the country through the American Airlines crash because he suggested DEI programs put FAA policy over safety."
    },
    {
      "url": "https://www.foxnews.com/politics/dem-governor-expected-defend-states-controversial-sanctuary-policies-during-gop-led-hearing",
      "text": "Illinois Gov. JB Pritzker will be among several Democratic governors who are expected to face a grilling before GOP lawmakers during a Thursday hearing on their states’ controversial sanctuary status.\nAccording to prepared remarks obtained by Fox News Digital, Pritzker will defend his state’s policies, saying his administration was left to fill the void in the absence of help from the federal government in dealing with the border crisis.\nHe will accuse certain border state governors and mayors of having abandoned the nation’s highest ideals by having spent millions of taxpayer dollars treating immigrants as \"pawns\" rather than doing \"everything possible to make the promise of America the practice of America.\"\nHe will take aim at Republican Govs. Greg Abbott of Texas and Ron DeSantis of Florida for having bused illegal immigrants to predominantly liberal cities and states in the north – actions, he will argue, were political stunts that only exacerbated the problem.\nBLUE STATE GOVERNOR VOWS 'RESISTANCE' AS TRUMP ADMIN TARGETS SANCTUARY POLICIES\nPritzker will say that Illinois’ resources were strained because of a lack of federal support – from both Republicans and Democrats – during the crisis.\nThe Democratic governor is expected to highlight his state’s efforts to address the influx of immigrants into the \"Land of Lincoln\" by processing new arrivals, supporting temporary shelter and permanent housing, and enabling them to live independently and contribute to the economy.\nPritzker will note that even though state resources were strained during this period, it did not stop his administration from focusing on public safety by investing in state and local law enforcement, including the Illinois State Police (ISP) troopers. He will highlight statistics showing that violent crime has gone down under his stewardship.\nPritzker will reaffirm his intolerance for violent criminals – whether documented or undocumented – and note that Illinois law enables government employees to cooperate with federal immigration officers executing criminal warrants.\nHe is expected to say that federal officials are welcome to operate in Illinois but will make clear that Illinois will not divert limited resources when it is not in the best interest of the state. He will say that he wants residents to feel comfortable turning to local law enforcement for help.\nPritzker is also expected to invoke his own family’s history, having fled to the U.S. to escape the Russian massacre of Jews in Ukraine.\nHe is expected to implore Congress to fix the nation’s broken immigration system so that law-abiding immigrant families can have the same opportunity his family did. The governor will close his remarks by arguing that reforming the system does not have to come at the expense of securing the border.\nCLICK HERE TO GET THE FOX NEWS APP\nPritzker will be joined by fellow Democratic Govs. Tim Walz of Minnesota and Kathy Hochul of New York. \"A Hearing with Sanctuary State Governors\" begins will at 10 a.m. EST before the Committee on Oversight and Government Reform.\nFox News' Paul Steinheiser contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/category/us/us-regions/midwest/illinois",
      "text": "VIDEO 44 mins ago Katie Pavlich warns Mamdani could give the Left 'breath of life' Fox News contributor Katie Pavlich, Stagwell Inc. CEO Mark Penn and Hoover Institution senior fellow Victor Davis Hanson dissect the Democratic Party's 'radical' socialist movement on 'Hannity.'\nVIDEO 3 hours ago Beloved Fox News photographer sworn in as US citizen 'Special Report' highlights Fox News senior field photographer Svein Schwab's dream come true after he was sworn in as a U.S. citizen.\nIllinois 13 hours ago Dem governor defies FBI: 'Unwelcome' to pursue Texas Democratic lawmakers Illinois Gov. JB Pritzker defends Texas lawmakers seeking sanctuary in Illinois from redistricting battle as Republicans push for FBI involvement.\nVIDEO 1 day ago 'Seen and Unseen': Dems' 'ABSURD' sacrifice to flee Texas Fox News contributor Raymond Arroyo reveals the true identity of McDonald's Grimace and who is funding 'runaway' Democrats' flights to Illinois on 'The Ingraham Angle.'\nVIDEO 1 day ago Dana Perino: Illinois’ Dem governor ‘embarrasses himself’ on Stephen Colbert ‘The Five’ discusses Illinois Gov. JB Pritzker being confronted with the state’s ‘crazy’ map while on ‘The Late Show with Stephen Colbert.’\nVIDEO 2 days ago Texas Democrats have 'abandoned' this entire conversation, GOP lawmaker laments State Rep. Tom Oliverson, R-Texas, weighs in on how Texas' Democratic lawmakers could be penalized after some fled the state on 'The Will Cain Show.'\nDonald Trump 2 days ago Democrats' chair vows to fight 'tooth and nail' to stop Trump, Republicans, in redistricting battle Democratic Party leaders pledge aggressive response to Republican redistricting push ahead of 2026 midterms as both parties battle for House control.\nImmigration 2 days ago Bondi DOJ names and shames 35 sanctuary jurisdictions that ‘put American citizens at risk’ Department of Justice identifies nearly three dozen cities and states for allegedly protecting illegal immigrants, warns of legal action against jurisdictions\nVIDEO 3 days ago Democrats 'squeezed everything they can' out of this type of redistricting: Mollie Hemingway 'Special Report' panelists discuss the role of gerrymandering amid Texas Democrats' clash with the state and the latest development in the probe into the alleged Trump-Russia conspiracy.\nVIDEO 3 days ago Sean Hannity: Democrats are protesting what they have been doing forever Fox News host Sean Hannity calls out Democrats’ ‘big, meaningless political stunt’ in protesting gerrymandering on ‘Hannity.’\nJ.B. Pritzker 3 days ago Texas Dems ripped for 'cartoonishly dumb' strategy to flee to blue state notorious for gerrymandering Texas Democratic lawmakers arrive in Illinois after fleeing their state to block a Republican redistricting vote that President Trump says could gain the GOP five new House seats\nCrime 3 days ago Armed robbers target bar hoppers in ritzy blue city neighborhood: ‘Held the gun to my head’ People in Chicago's River North Neighborhood are targeting intoxicated individuals in the early morning hours and robbing them, police said\nVIDEO July 31 Chicago Mayor Brandon Johnson is 'in over his head' running the city, former governor lodges Former Illinois Gov. Rod Blagojevich rails against Chicago Mayor Brandon Johnson for refusing to work with I.C.E. on 'The Ingraham Angle.'\nChicago July 26 Federal judge tosses Trump DOJ lawsuit against sanctuary policies in Chicago A federal judge in Illinois has dismissed a Trump administration lawsuit that sought to disrupt limits Chicago imposes on cooperation between federal immigration agents and local police.\nIllinois July 22 McDonald's trash duty dispute escalates to manager allegedly shooting teen employee's mom in restaurant A dispute over trash duties at an Illinois McDonald's escalated when a manager allegedly shot an employee's mother who had come to confront her, resulting in felony charges for both women.\nVIDEO July 22 Murder victim's mother sounds off on Gov. Pritzker's no-cash bail: 'This is what he wanted' Fox News correspondent Garrett Tenney reports the latest on the case and why the governor is facing scrutiny for the state's no-cash bail policy.\nIllinois July 22 Illinois coroner releases new details about woman found dead on illegal immigrant's property An Illinois coroner has refuted claims that a woman found dead in a storage container at the home of an illegal immigrant was decapitated.\nCrime July 21 Trump demands end to cashless bail, says 'complete disaster' driving crime in cities, endangering police President Donald Trump calls for ending cashless bail, linking criminal justice reform to crime in U.S. cities and increased attacks on law enforcement.\nCrime July 21 Social media-fueled teen flash mobs prompt closures of businesses and public centers nationwide Large groups of unruly teenagers at an Illinois pool and California mall prompted early closures that resulted in arrests, highlighting what experts call a symptom of cultural breakdown.\nChicago July 19 ICE arrests illegal immigrant accused of decapitating Illinois woman after judge set him free ICE agents arrested Jose Luis Mendoza-Gonzalez in Chicago after he was released from custody despite being charged with concealing the decapitated body of missing woman Megan Bos.\nPolice and Law Enforcement July 10 Fatal skydiving accident in Illinois claims life of 40-year-old after divers collide midair One skydiver died and another was injured following a midair collision in Rochelle, Illinois that caused both parachute canopies to collapse despite reserve parachutes being deployed.\nBoating July 10 Father and son drown in Lake Michigan during weekend family boating trip tragedy Illinois residents David Meneou and his son Jameson drowned in Lake Michigan during a boating trip when their game of catch led to struggles in deep water.\nChicago July 10 Federal judge deems former Chicago alderman accused of bribery unfit for trial Former Chicago alderman Carrie Austin, indicted in 2021 for allegedly receiving home improvements from contractors seeking city assistance, deemed unfit for trial.\nChicago July 8 Chicago mayor vows city police 'will not ever cooperate with ICE' Mayor Johnson reaffirmed Chicago's status as a welcoming city, stating local police will not work with ICE despite concerns about increased assaults on immigration agents nationwide.\nCrime July 7 Chicago's bloody July Fourth weekend leaves 55 shot, 6 dead: report Chicago's Fourth of July weekend reportedly marred by violence with over 50 shootings, six fatalities, and multiple mass incidents across South Side, West Side and Lake View area.\nUS July 3 Chicago drive-by shooting leaves at least 4 dead, 14 wounded Four people were killed and 14 others hospitalized in Chicago after a drive-by shooting outside Artis Restaurant and Lounge, with suspects still at large.\nDonald Trump June 26 JB Pritzker takes aim at Trump in launching Democratic re-election bid for Illinois governor Gov. J.B. Pritzker seeks a third term as Illinois governor, emphasizing balanced budgets, minimum wage increases and abortion rights protection while becoming a vocal Democratic critic of President Donald Trump.\nVIDEO June 25 Perino: New York is following Chicago into 3rd world problems Fox News guest host Dana Perino and the 'Gutfeld!' panel discuss New York City choosing a Democratic socialist in its mayoral primary.\nIllinois June 25 Trump critic JB Pritzker expected to launch Democratic re-election bid for third term as Illinois governor Gov. J.B. Pritzker to seek third term in Illinois amid 2028 presidential speculation, continuing his role as a leading Democratic voice against Trump administration.\nCulture Trends June 24 Chicago Teachers Union president suggests children belong to the school system The Chicago Teachers Union president declared during a Monday speech that children belong to the city school system as it faces enrollment decline and rising costs."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/media/oklahoma-requires-america-first-certification-test-teachers-fleeing-blue-states",
      "text": "Oklahoma will be the first state to require teachers from liberal-leaning states to take a test to show they align with Oklahoma’s curriculum standards.\nThe state’s Superintendent, Ryan Walters, told Fox News Digital that next week he plans to release a new certification test for teachers moving into the state from blue states.\n\"We offered the largest signing bonuses for teachers in the country. If you're in the top 10 percent of teachers in the country, we give you $50,000 in Oklahoma. So we've seen teachers come from blue states, red states all over to come to Oklahoma. They especially are fleeing the teachers unions, the grip that they've had on them in these blue states,\" Walters said.\nWalters added that the state is working with conservative think tank PragerU on developing the test for teachers. The \"America First\" test will include basic questions about American history, civics, and \"common sense.\"\nOklahoma is thus far the only state that has worked with PragerU on this kind of project. Walters said that Oklahoma education officials have partnered with PragerU in the past, helping them develop standards for teaching history and putting an emphasis on American exceptionalism.\n\"We put the Bible back in our history standards,\" Walters said.\nThe superintendent mentioned Maine, California, and New York adopting standards and requirements that were antithetical to Oklahoma.\n\"One of the things that we wanted to do is, first of all, make sure that they're great teachers, right? And No. 2, make sure we're not getting these woke, indoctrinating social justice warriors in the classroom,\" Walters said.\nHe name-dropped California Gov. Gavin Newsom as one of the \"impetuses\" of the change, regarding the state's policy on gender ideology.\nThe California Department of Education requires instruction \"about gender, gender expression, gender identity and explore the harm of negative gender stereotypes.\" Schools must also \"teach about all sexual orientations and what being LGBTQ means.\"\n\"We're going to make sure that this isn't creeping into our schools. When we see Maine take the extraordinary steps to fight President Trump… Every county in Oklahoma voted for President Trump,\" Walters said.\nMaine has pushed back against President Donald Trump's executive orders requiring that schools teach that there are only two genders and that biological boys are prohibited from participating in female sports.\nEXCLUSIVE: RED STATE UPDATING EDUCATION STANDARDS TO ADDRESS RISE IN ANTISEMITISM IN SCHOOLS\n\"We have been closely following the implementation of teacher training and testing programs — such as the PRISM test imposed on educators in states like California — and we fully understand why superintendents of education, like Ryan Walters, feel compelled to protect their students from the extreme left-wing ideologies being promoted in schools through teachers who often do not even realize the damage caused,\" a spokesperson for PragerU told Fox News Digital.\n\"It is our honor to help reverse the damage caused by these trends by equipping educators with higher-quality resources and holding them accountable to do what is right for their students. While we do not mandate the use of any of our materials, we strongly encourage the adoption of our wholesome, patriotic content as a constructive alternative,\" the spokesperson added.\nWalters’ colleagues have previously challenged the legal merit of his idea. When Walters said the test would not need the board's approval, his colleague Ryan Deatherage asked for legal documentation to prove it.\nBoard member Chris Van Denhende asked whether the tests were necessary, citing teaching contracts requiring educators to teach to Oklahoma standards anyway.\nCLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE\n\"He's been a puppet for the teachers union,\" Walters told Fox News Digital, referring to Van Denhende.\nCLICK HERE TO GET THE FOX NEWS APP\n\"I've had to deal with people in our state that are just continuing to parrot the lies of the NEA [National Education Association]. And here's the reality. What do you mean? We're seeing it all over the place. We are seeing indoctrination on kids like never before,\" he added.\nFox News Digital reached out to Newsom and Van Denhende for comment."
    }
  ],
  "argos_summary": "A new Illinois law mandating annual mental health screenings for public school students has sparked significant opposition from parents, lawmakers, and policy experts who argue it may infringe on parental rights and lead to mislabeling children. Signed by Governor J.B. Pritzker, the law requires screenings for students in grades three through 12 starting in the 2027-2028 school year, with parents able to opt out. Supporters believe it will help identify mental health issues early, while critics warn it could create unnecessary stigma and complications for families.",
  "argos_id": "4MTA64SIZ"
}