{
  "url": "https://www.cnet.com/science/space/the-aurora-borealis-is-back-these-18-states-have-a-chance-to-see-it-tonight/#ftag=CADf328eec",
  "authorsByline": "Joe Hindy",
  "articleId": "e999399670414c03be005e15948edc9b",
  "source": {
    "domain": "cnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.cnet.com/a/img/resize/6d8725d88216157da0411ae6378cd6be9726b5e7/hub/2024/10/11/9a4c9284-9b8d-4670-973b-2d4560464650/richardpetersonaurora.jpg?auto=webp&fit=crop&height=614&width=1092",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T19:30:00+00:00",
  "addDate": "2025-08-08T19:44:27.326835+00:00",
  "refreshDate": "2025-08-08T19:44:27.326838+00:00",
  "score": 1.0,
  "title": "The Aurora Borealis Is Back: These 18 States Have a Chance to See It Tonight",
  "description": "Prepare to get away from city lights if you want to see the colorful sky show.",
  "content": "August has started heavy for skygazers. We are days away from August's sturgeon full moon and the peak of the Perseids meteor shower. Before those celestial events get underway, however, it seems that another sighting of the aurora borealis may be visible in up to 18 US states on Friday night.\n\nThose states can be broken up into three categories. The first are states that will almost certainly see an aurora -- if conditions allow -- and include Alaska, Washington, Montana, North Dakota, South Dakota, Minnesota and Wisconsin. Next are the states that should at least see something, which include the northern portions of Idaho, Oregon, Wyoming, Michigan and Maine.\n\nFinally, the states that may see something under the best possible conditions will be Iowa, northern Nebraska, Illinois, New York, Vermont and New Hampshire. The very northern reaches of Indiana and Ohio may see something, but it's unlikely.\n\nThis week's aurora comes to Earth courtesy of an M-class solar flare that the sun ejected on Tuesday. It was one of several solar flares observed in what has been a very active week for the sun, but this particular M-class flare was pointed right at Earth when it erupted. According to NOAA, the best times to see the aurora has passed, as it was Thursday night into Friday morning. But Friday night into Saturday morning will also be a good time for the states bordering Canada.\n\nThe standard space viewing tips apply. You'll want to get away from the city and suburbs to eliminate light pollution. The darker it is, the better. NOAA also recommends viewing between 10 p.m. and 2 a.m. local time, as that is generally when activity is at its zenith. Finally, if you can swing it, you'll want to get to an elevated position and look north for the best results.\n\nSince we are within a few days of a full moon, the moon's brightness may impact your ability to see things if you're at the southern reaches of this aurora. In addition, the strength of the aurora is a forecast, and just like weather forecasts, it may be stronger or weaker than predicted.",
  "medium": "Article",
  "links": [
    "https://www.swpc.noaa.gov/content/tips-viewing-aurora",
    "https://www.spaceweatherlive.com/en/news/view/584/20250805-m44-solar-flare-from-sunspot-region-4168.html",
    "https://x.com/NWSSWPC/status/1953168695347560745/photo/1",
    "https://www.spaceweatherlive.com/en/solar-activity/solar-flares.html",
    "https://www.cnet.com/science/space/before-the-next-planet-parade-dont-miss-this-weeks-full-sturgeon-moon/",
    "https://www.cnet.com/science/space/look-to-the-sky-bright-fireballs-appear-during-the-perseids-meteor-shower/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "states",
      "weight": 0.08273342
    },
    {
      "name": "several solar flares",
      "weight": 0.076068096
    },
    {
      "name": "local time",
      "weight": 0.07488797
    },
    {
      "name": "northern Nebraska",
      "weight": 0.07098058
    },
    {
      "name": "Friday night",
      "weight": 0.06461012
    },
    {
      "name": "North Dakota",
      "weight": 0.06409376
    },
    {
      "name": "weather forecasts",
      "weight": 0.06389082
    },
    {
      "name": "Friday morning",
      "weight": 0.06306232
    },
    {
      "name": "South Dakota",
      "weight": 0.06301399
    },
    {
      "name": "New York",
      "weight": 0.058759313
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Science"
    }
  ],
  "taxonomies": [
    {
      "name": "/Science/Astronomy",
      "score": 0.70458984375
    }
  ],
  "sentiment": {
    "positive": 0.15917969,
    "negative": 0.31152344,
    "neutral": 0.5292969
  },
  "summary": "The Aurora Borealis may be visible in up to 18 US states on Friday night, according to NOAA. These states can be divided into three categories: Alaska, Washington, Montana, North Dakota, South Dakota, Minnesota and Wisconsin. The northern portions of Idaho, Oregon, Wyoming, Michigan and Maine may also see something. Iowa, northern Nebraska, Illinois, New York, Vermont and New Hampshire are also likely to see something due to favorable conditions. This aurora was seen due to an M-class solar flare that the sun ejected on Tuesday, which was pointed right at Earth when it erupted. The best times to see the aurora have passed, but it is also a good time for states bordering Canada.",
  "shortSummary": "Up to 18 US states may see the aurora borealis, possibly due to a solar flare, with best viewing conditions in Alaska and Washington.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "51f7b2c92b3c4be1a02da466e91596dd",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnet.com/science/space/before-the-next-planet-parade-dont-miss-this-weeks-full-sturgeon-moon/",
      "text": "As long as you're looking at the night sky, August has a ton of cool stuff going on this year. Among those is the full moon, also known as the Sturgeon Moon. It's the last full moon of the summer, and it's coming on Aug. 9.\nAccording to The Old Farmer's Almanac, the full moon will reach its peak brightness at 3:55 a.m. ET on Aug. 9. Thus, if you want to see the moon at its brightest, you'll want to look up the evening of Aug. 8 and on into the next morning. It's not a big deal if you miss it, as the moon will be over 90% full from Aug. 6 through Aug. 11, so you'll have plenty of chances to look up and see it.\nA lot is going on during this full moon, so if you want to make a night of it, you have other things you can look for. Saturn, Venus, Mercury, Uranus and Neptune will all be in the south and eastern sky, lining up nicely in preparation for the planet parade coming in late August. Venus and Jupiter don't make an appearance until much later in the evening, but they'll be visible with the naked eye. The other three will require some sort of magnification.\nThe Perseids meteor shower is also active, so you may spy a shooting star or two, depending on how dark it is outside. The Perseids come from the Perseus constellation. On the morning of Aug. 9, it'll be in the eastern sky alongside Venus and Jupiter, so everything will be in the same general area.\nWhy is it called the Sturgeon Moon?\nThe Sturgeon Moon is named after the humble sturgeon fish. According to The Old Farmer's Almanac, sturgeon were a staple food for Native Americans in the Great Lakes region, and the fish used to be a lot more abundant during mid- to late summer. Of all the bony fish, the sturgeon is the most primitive, dating back to the Cretaceous period over 120 million years ago. Thus, scholars often refer to the fish as a living fossil. It's also a long-lived fish, with an average lifespan of 50 to 60 years. Females of the species can get as old as 150 years.\nOther names for August's full moon include the Corn Moon, Ricing Moon, Black Cherries Moon and Mountain Shadows Moon. It's also been called a Harvest Moon, splitting the name with September's full moon."
    },
    {
      "url": "https://www.swpc.noaa.gov/content/tips-viewing-aurora",
      "text": "Tips on Viewing Aurora:\nViewing the aurora depends on four important factors\n- Geomagnetic Activity: If the geomagnetic field is active, then the aurora will be brighter and further from the poles. Geomagnetic activity is driven by solar activity and solar coronal holes and thus it waxes and wanes with time. The level of geomagnetic activity is indicated by the planetary K index or Kp. The Kp index ranges from 0 to 9.\n- For Kp in the range 0 to 2, the aurora will be far north, quite dim in intensity, and not very active.\n- For Kp in the range of 3 to 5, the aurora will move further from the poles, it will become brighter and there will be more auroral activity (motion and formations). If you are in the right place, these aurora can be quite pleasing to look at.\n- For Kp in the range 6 to 7, the aurora will move even further from the poles and will become quite bright and active. At this geomagnetic activity level, it might be possible to see the aurora from the northern edge of the United States.\n- For Kp in the range 8 to 9, the aurora will move even further towards the equator and it will become very bright and very active. These are the events that create the best aurora and the extended auroral oval will be observable by the most people. At these levels, aurora may be seen directly overhead from the northern states of the USA.\nIt should be noted that the relationship between Kp and auroral latitude are approximate and represent averages. There will be times when these relationships do not hold up exactly.\nThere is an approximate relationship between Kp and the equatorward extent of the auroral oval. This relationship holds true in geomagnetic latitude, not geographic. At Kp = 0, the equator ward edge of the auroral oval is approximately 66 degrees. And it moves equatorward about 2 degrees for each level of Kp. So for Kp = 1, the aurora would move down to 64 degrees, for Kp=2, it would move to 62 degrees, etc… until reaching Kp of 9 at 48 degrees magnetic latitude.\n- Location: Go towards the magnetic poles. The north magnetic pole is currently about 400 km (250 miles) from the geographic pole and is located in the islands of north east Canada. Find a place where you can see to the north ( or south if you are in the southern hemisphere). Given the right vantage point, say for example on top of a hill in the northern hemisphere with an unobstructed view toward the north, a person can see aurora even when it is 1000 km (600 miles) further north. It should be noted that if you are in the right place under the aurora, you can see very nice auroral displays even with low geomagnetic activity (Kp = 3 or 4).\n- It must be dark: Go out at night. Get away from city lights. The full moon will also diminish the apparent brightness of the aurora (not the actual brightness). One caveat that people often neglect to think of is that the high latitudes where aurora occur are also latitudes where it doesn’t get dark in the summer. So combining a summer vacation to the arctic with aurora watching usually doesn’t work. The aurora may still be there but it is only visible when it is dark.\n- Timing: Best aurora is usually within an hour or two of midnight (between 10 PM and 2 AM local time). These hours of active aurora expand towards evening and morning as the level of geomagnetic activity increases. There may be aurora in the evening and morning but it is usually not as active and therefore, not as visually appealing.\nThe best Seasons for aurora watching are around the spring and fall equinoxes. Due to subtleties in the way the solar wind interacts with Earth’s magnetosphere, there is a tendency towards larger geomagnetic storms, and thus better auroras, to occur near the equinoxes. However, the number of hours of darkness decreases (increases) rapidly near the spring (fall) equinox so this caveat must be considered for those traveling to see the aurora.\nBelow are maps showing the most southern extent of where aurora might be observable for different levels of the geomagnetic Kp index (and the NOAA G scale). It should be noted that the aurora can often be observed hundreds of kilometers (miles) equatorward of the actual aurora so these figures do not indicate where the aurora may be but rather the point from which it may be observed.\nAdditional Resources:"
    },
    {
      "url": "https://www.cnet.com/science/space/look-to-the-sky-bright-fireballs-appear-during-the-perseids-meteor-shower/",
      "text": "Skygazers rejoice, the summer isn't finished with delivering dazzling meteor showers. The last week of July saw dueling meteor showers taking over the sky, but the most popular meteor shower of the year won't hit its peak until next week. The Perseids meteor shower is about to give you a real light show, provided you're far enough away from light pollution to see it.\nPerseids are known for their bright fireballs and plentiful meteors. The show started on July 17, and will run through Aug. 23.\nThe reason the Perseids meteor shower is so popular is twofold. First, it takes place in the summer, so going outside and watching it is less uncomfortable than other large meteor showers like Quadrantids, which takes place in wintery January.\nThe other reason is that it's one of the most active meteor showers of the year. During its peak, the meteor shower is known to rain down as many as 100 meteors per hour, according to the American Meteor Society. These not only include your typical shooting stars, but also a higher chance for fireballs, which are meteors that explode as they enter orbit. Per NASA, fireballs tend to last longer than standard shooting stars and can come in a variety of different colors.\nPerseids come to Earth courtesy of the 109P/Swift-Tuttle comet. Earth's orbit around the sun brings it through Swift-Tuttle's tail every year. The comet itself takes 133 years to orbit the sun. Its last perihelion -- the point at which it's the closest to the sun -- was in 1992. It won't be back until the year 2125. Until then, it leaves behind an excellent tail of dust and debris to feed us yearly meteor showers.\nHow to catch the Perseids meteor shower\nThe best time to view the Perseids is during its peak, which occurs on the evenings of Aug. 12 and 13. During this time, the shower will produce anywhere from 25 to 100 meteors per hour on average. However, since the shower officially lasts for over a month, you have a chance to see a shooting star on any given evening, provided that you're far enough away from light pollution.\nThus, if you're planning on watching this year's Perseids during their peak, you'll want to get out of the city and suburbs as far as possible. According to Bill Cooke, lead of NASA's Meteoroid Environments Office, folks in the city might see one or two meteors from the meteor shower per hour, which is pocket change compared to what those outside city limits might see.\nRegardless, once you've arrived at wherever you want to watch the meteors, you'll want to direct your attention to the radiant, or the point at which the meteors will appear to originate. Like all meteors, Perseids are named after the constellation from which they appear. In this case, it's Perseus.\nPer Stellarium's free sky map, Perseus will rise from the northeastern horizon across the continental US on the evenings of Aug. 12 and 13. It'll then rise into the eastern sky, where it'll remain until after sunrise. So, in short, point yourself due east and you should be OK. Binoculars may help, but we recommend against telescopes since they'll restrict your view of the sky to a very small portion, which may hinder your meteor-sighting efforts.\nThe American Meteor Society also notes that the moon may give viewers some difficulty. Perseids' peak occurs just three days after August's full moon, so the moon will still be mostly full. Thus, it is highly probable that light pollution from the moon may reduce the number of visible meteors by a hefty margin, depending on how things go."
    }
  ],
  "argos_summary": "August brings exciting celestial events for skygazers, including the sturgeon full moon on August 9 and the peak of the Perseids meteor shower around August 12-13. An aurora borealis sighting is also expected in up to 18 US states due to a recent M-class solar flare, with optimal viewing conditions suggested for the night of August 4-5. However, the brightness of the full moon may hinder visibility of both the aurora and the meteors, which are known for their bright fireballs and can produce up to 100 meteors per hour during peak activity.",
  "argos_id": "4PQV9CRZU"
}