{
  "url": "https://www.yahoo.com/entertainment/articles/outside-lands-founders-17-years-195233094.html?_guc_consent_skip=1754684692",
  "authorsByline": "Ethan Millman",
  "articleId": "75d36de075264e618025ce7b5c30e484",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/314b7278bbc0bb23476ff1a6c4a8d62517308da91889ce2041c5cbd2442f2fc4/ynews/resizefill_w1200/https://media.zenfs.com/en/the_hollywood_reporter_217/fb0ba7647cf6374e8671ea8cb068179e",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T19:52:33+00:00",
  "addDate": "2025-08-08T20:25:54.018202+00:00",
  "refreshDate": "2025-08-08T20:25:54.018204+00:00",
  "score": 1.0,
  "title": "Outside Lands Founders on 17 Years of Festivals: “This Is Like a Never-Ending Art Project for Us”",
  "description": "Ahead of this year's festival, which will feature Tyler, the Creator, Doja Cat and Hozier among others, co-founders Rick Farman and Allen Scott spoke with The Hollywood Reporter about staying indie, evolving the event and what festivals mean for artists in 2025.",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nIn an increasingly-saturated music festival market, there’s still no other festival quite like Outside Lands.\n\nSynonymous with San Francisco, for the last 17 years, Outside Lands has taken over the city’s Golden Gate Park and hosted iconic performances from the likes of Kendrick Lamar, The Strokes, Green Day and Chappell Roan, while injecting more Bay Area DNA into the event each year. In 2018, it became one of the first major music festivals to offer the sale of marijuana, while last year, Outside Lands added a “City Hall” where festivalgoers can get legally married, an homage to the 2004 “Winter of Love” where San Francisco offered the first same-sex marriage licenses in U.S. history.\n\nMore from The Hollywood Reporter\n• None How Republic Nabbed the Soundtrack of the Year With 'KPop Demon Hunters'\n• None Live Nation Posts Strong Second Quarter as Revenues Rise to $7 Billion\n\n“This is a like never ending art project for us is how we think about it,” Rick Farman, who co-founded the festival with Bay Area concert promoter Another Planet Entertainment through his promotion company Superfly. “It’s always constantly evolving. We’re always looking for opportunities that make sense with culture and with our mission, which is to make a festival for the Bay Area.”\n\nIn a festival landscape that faces a challenging global economy, consistent rising costs and industry consolidation, Outside Lands continues to weather the storm as one of the biggest independent music festivals in the country, a notable distinction given that most festivals of its size such as Coachella or Lollapalooza are owned and operated by corporate giants like Live Nation and AEG Presents.\n\nThe 17th edition of Outside Lands kicks off Friday, with a lineup that includes Doja Cat; Tyler, the Creator; Hozier; Gracie Abrams; John Summit; Doechii; Vampire Weekend and Beck among many others throughout the weekend. Ahead of the fest, Farman and fellow Outside Lands co-founder Allen Scott of Another Planet spoke with The Hollywood Reporter about keeping the festival new, staying independent and what a festival booking means for an artist in 2025.\n\nWhat has been the main driver in what’s kept outside lands to its indie roots over all this time?\n\nScott: We started in 2008. There were five festivals that came out that year; it was the beginning of the recession. Those other festivals didn’t make it past a few years; we were fortunate to come out of that class still standing 17 years later. We’re in San Francisco, one of the great live music markets in the world. We punch above our weight in terms of people going to concerts. And Golden Gate Park couldn’t be a better location for a festival, which adds to the draw. And a lot of festivals cater to the high school and college crowd, but we book a very multi-generational lineup, which I think helps people grow with the festival since there’s always going to be something for them here.\n\nFarman: We have a lot of industry muscle on our own too. Between Another Planet and Superfly, plus with my partner Coran Capshaw [the music manager behind Red Light management], the types of people that are working on this on a daily basis are always trying to think about how we can make this better, unique, not resting on our laurels. Every year’s a fresh and new festival, we don’t have any sacred cows.\n\nWe’re a year shy of 18 here, how has the festival changed?\n\nFarman: I think the big factor is that we’ve gone deeper and deeper into what our mission is, which is making a festival that’s reflective of Bay Area culture. That started with food and beverages, we’ve got 50 different types of wine from all over the region. And then we were early with cannabis; we’re still the only major music festival that has legal sales and consumption of cannabis. Then we launched the Dolores area a couple years ago, which expresses what’s special about the LGBTQ community and history in the Bay Area. Last year we launched “City Hall.” All of that helps make a really hyper-local feel.\n\nScott: I don’t think you can put Outside Lands anywhere else in the world because it’s so much about San Francisco and the Bay Area. That keeps it unique, we can’t do this anywhere else but here.\n\nHow would you describe the state of the festival business in 2025?\n\nFarman: I’d say it’s still going through phases of innovation and success and failure, but it’s getting more mature. This modern U.S. festival market has now been around for over 20 years and it shows. We’ve seen things with lasting power and others that have come and gone. You look at the landscape and there’s still new independent promoters trying to create new things. I think it’s large when you look from a macro perspective; it’s strong.\n\nScott: Certainly the costs. Since COVID, costs have gone up over 50 percent, and ticket prices have not been able to keep up with that. So we’ve had to be creative with sponsorships, more premium experiences so that we could keep the GA price down. And as we’ve gotten bigger, it’s also about keeping a unique lineup in the festival landscape. But cost is the biggest obstacle.\n\nHave your costs been more from production or the rising cost of booking talent?\n\nScott: It’s both. It’s more expensive for artists to tour, so their fees go up. Since we started, platinum tickets on tours are more common. When they use platinum tickets, they make more on their touring shows, and therefore they want more on the festival. But really the biggest bump has been the production costs, whether that’s security, fencing, bathrooms, it’s across the board.\n\nIf the top-tier artists that help draw audiences can get more from platinum tickets on a tour, what’s the value add for them at festivals now?\n\nScott: Let’s be clear, artists are still making more money at a festival than on routed dates. There’s a lot of costs they save for a festival date in addition to getting paid substantially more. That said, when we’re at that level, we’re at an interesting place in an artist’s career. They might be an arena artist, but they’re not quite a stadium artist. And the fact that they can go and play in front of 60,000 people is something that’s enticing to them.\n\nFarman: Beyond that, I think the value prop of playing a festival is the same, maybe even more so than it’s ever been, because of the ability to break through in some capacity with audiences. We saw that last year with some of these pop artists, these festival dates are important for building audiences for these young stars who are rising up.\n\nHow do you think Outside Lands will continue to evolve?\n\nFarman: I think you see every year that we’re always trying to find new things. “City Hall” was a huge success last year. We added a new stage this year, the Duboce Triangle, because we had an opportunity to put more programming into the festival. There are always new things that people are engaging with, especially in a dynamic city like San Francisco. And so it’s always going to give us an opportunity to speak to our audience in a way that’s current and progressive.\n\nScott: We’re doing it as much for ourselves as for the audience. We want to curate the most interesting and dynamic lineup that we could put together each year. We want to keep things fresh and not get complacent.\n\nBest of The Hollywood Reporter\n• None From 'Party in the U.S.A.' to 'Born in the U.S.A.': 20 of America's Most Patriotic (and Un-Patriotic) Musical Offerings\n• None Most Anticipated Concert Tours of 2025: Beyoncé, Billie Eilish, Kendrick Lamar & SZA, Sabrina Carpenter and More\n\nSign up for THR's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.",
  "medium": "Article",
  "links": [
    "https://www.hollywoodreporter.com/lifestyle/style/historic-first-cannabis-sales-consumption-approved-major-california-festival-1230643/",
    "https://cloud.email.hollywoodreporter.com/signup/",
    "http://bit.ly/2TkcoeG",
    "http://bit.ly/2TntOHq",
    "https://www.yahoo.com/entertainment/articles/republic-nabbed-soundtrack-kpop-demon-140003339.html",
    "https://www.hollywoodreporter.com/lists/fourth-july-playlist-songs-about-america-patriotic/?utm_source=yahoo-editorial&utm_medium=feeds&utm_campaign=best_of_brands",
    "https://www.hollywoodreporter.com/news/music-news/robert-schwartzman-wayne-newton-documentary-zombies-1236340476/",
    "http://bit.ly/31XsHSx",
    "https://www.hollywoodreporter.com/lists/2025-concerts-tours-guide/?utm_source=yahoo-editorial&utm_medium=feeds&utm_campaign=best_of_brands",
    "https://finance.yahoo.com/news/live-nation-posts-strong-second-202758372.html",
    "https://www.hollywoodreporter.com/news/general-news/lands-a-rock-festival-fit-224221/",
    "https://www.hollywoodreporter.com/lists/notable-deaths-2025-hollywood-entertainment/?utm_source=yahoo-editorial&utm_medium=feeds&utm_campaign=best_of_brands"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Festivals",
      "weight": 0.0897034
    },
    {
      "name": "festivals",
      "weight": 0.0897034
    },
    {
      "name": "most festivals",
      "weight": 0.08717887
    },
    {
      "name": "Last year",
      "weight": 0.0730515
    },
    {
      "name": "last year",
      "weight": 0.0730515
    },
    {
      "name": "Outside Lands",
      "weight": 0.068643846
    },
    {
      "name": "year",
      "weight": 0.06783613
    },
    {
      "name": "more Bay Area DNA",
      "weight": 0.06342459
    },
    {
      "name": "fellow Outside Lands co",
      "weight": 0.06278148
    },
    {
      "name": "Bay Area concert promoter Another Planet Entertainment",
      "weight": 0.057967342
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Events & Listings/Concerts & Music Festivals",
      "score": 0.9384765625
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Rock Music",
      "score": 0.54931640625
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.316162109375
    }
  ],
  "sentiment": {
    "positive": 0.45385742,
    "negative": 0.15893555,
    "neutral": 0.3869629
  },
  "summary": "The 17th edition of Outside Lands, a music festival in San Francisco, has been running for 17 years and hosted iconic performances from artists such as Kendrick Lamar, The Strokes, Green Day, and Chappell Roan. The festival, which became one of the first major music festivals to offer the sale of marijuana in 2018, has also added a \"City Hall\" where festivalgoers can legally marry in an homage to the 2004 \"Winter of Love\" where San Francisco offered the first same-sex marriage licenses in U.S. history. Outside Lands co-founder Rick Farman and co-founded the festival with Bay Area concert promoter Another Planet Entertainment through his promotion company Superfly. Despite a challenging global economy, rising costs, and industry consolidation, Outside Lands continues to be one of America's largest independent music festivals. The 17th event will be held in Golden Gate Park, with a lineup including Doja Cat, Tyler, the Creator, Gracie Abrams, John Summit, Vampire Weekend and Beck throughout the weekend.",
  "shortSummary": "Outside Lands, founded by Rick Farman and Allen Scott, reflects on its 17th anniversary as a continually evolving independent music festival, evolving its programming and culture to attract and grow audiences.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "52a8c3de087b40f7afa9786bc364db40",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.hollywoodreporter.com/news/general-news/lands-a-rock-festival-fit-224221/",
      "text": "Like many music festivals — Lollapalooza and Coachella among them — last weekend’s Outside Lands, held in San Francisco’s Golden Gate park, adopts the now standard three-day schedule: 100-plus established and up-and-coming bands (ranging from the Queen-lite rock of Muse to the ecstatic dance-happiness of Girl Talk), loads of outsider art, and a billowy cloud of familiar smelling smoke and sweat coming off a field full of youthful revelers which numbered in the tens of thousands.\nBut what sets Outside Lands apart is its food: not content with the typical festiness of do-it-yourself burritos and greasy pizza, the organizers bring a slew of the Bay Area’s best restaurants to serve up menu selections curated specifically for the music gathering, making Outside Lands not just a must-go destination for rockers, but gourmands and gluttons too. Of course, with the upswing in quality comes an urge for pretension (especially among an already snooty indie rock crowd), so we’ve paired some of Outside Lands’ best dishes with a few of the festival’s most notable performances.\nThe restaurant: Andalu, a Mission tapaseria voted best in its district by Citysearch and praised by the New York Times, San Francisco Magazine, and Bon Appetit.\nThe dish: A succulent, salty crispy mac & cheese, gooey like cheese sticks but dippable into a sweet sauce via their crunchy breaded exterior.\nBest paired with: John Fogerty, whose nostalgic song selection (including Creedence Clearwater Revival classics like “Born On The Bayou” and “Fortunate Son”) and hey-there-look-at-me cheese charmingly transported the polo field from the heart of San Francisco to somewhere in the middle of the Kansas state fair.\n|\nNamu’s Korean Tacos |\nThe restaurant: Namu, a family operated, Eastern-leaning wood-lined ode to California cuisine.\nThe dish: Korean tacos, wrapped not in tortillas but in crispy nori, and stuffed with a perfect combo of rice, a spicy, miso-tasting sauce, and your choice of chicken or short rib.\nBest paired with: Little Dragon; not only are the two options small and Asian, but both are capable of a big punch — the tacos via their salty, briny seaweed exterior and the band through singer Yukimi Nagano’s relentless onstage energy.\nNext: Corn and pequillo peppers\n|\nSalumeria’s corn and pequillo peppers |\nThe restaurant: Salumeria by Flour and Water, whose Italian specialties are revered for their perfect bread-and-pizza dough.\nThe dish: Corn and pequillo peppers — a simple-sounding, spot-hitting, alarmingly buttery midday snack.\nBest paired with: SF’s rootsy Vetiver, whose Sutro Stage set in the waning part of Saturday afternoon was both comfortable and zesty, although if you were to catch any part of frontman Andy Cabic’s excellent beard in your food, it wouldn’t seem quite so tasty.\n|\nAsqew Grill’s chicken skewer |\nThe restaurant: Asqew Grill, a four-location chain that couples skewers of meat with appropriate starches.\nThe dish: A doused-in-sauce BBQ chicken skewer, with what seemed to be a pound of garlic mashed potatoes.\nBest paired with: Surprisingly, the psychedelic rockers MGMT, who could have used a little pep in their step; though songs like “Electric Feel” sounded great, they seemed to be missing something — just like the too-dry chicken, which unfortunately didn’t come with the roasted corn it’s skewered with in-stores.\n|\n4505 Meats’ cheeseburger |\nThe restaurant: 4505 Meats, an insanely revered burger-and-dog stand in the San Francisco Ferry building that offers butcher classes and to-go fried chicharrones.\nThe dish: The cheeseburger, a thin, fatty patty between two nearly over-grilled buns, with creamy gruyere cheese and a Thousand Island-meets-tahini special sauce.\nBest paired with: Arcade Fire. It’s easy to be skeptical when everyone loves something. It’s nice to admit they’re all right.\nTHR Newsletters\nSign up for THR news straight to your inbox every day"
    },
    {
      "url": "https://www.hollywoodreporter.com/lists/fourth-july-playlist-songs-about-america-patriotic/?utm_source=yahoo-editorial&utm_medium=feeds&utm_campaign=best_of_brands",
      "text": "Throwing a big bash for the Fourth of July and need a themed playlist?\nThe Hollywood Reporter has rounded up a list of songs about the good ole U.S.A., from Woody Guthrie’s “This Land Is Your Land” to Lee Greenwood’s “God Bless the USA.”\nHowever, not all of them are exactly patriotic or positive in their view of America and its citizens. Bruce Springsteen’s “Born in the U.S.A.” is often misunderstood as a nationalistic anthem (it actually was intended to draw attention to the negative effects of the Vietnam War), while Green Day’s “American Idiot” is a criticism of the American media.\nRead on for more, and click here to see a list of Hollywood’s most patriotic movies.\nThis list was originally published in 2015.\n-\n‘God Bless the USA’\n“And I’m proud to be an American/ Where at least I know I’m free/ And I won’t forget the men who died/ Who gave that right to me/ And I gladly stand up/ Next to you and defend her still today/ ‘Cause there ain’t no doubt I love this land/ God bless the USA”\nPerhaps the most patriotic song on this list, “God Bless the USA” is a staple at fireworks shows on the Fourth of July. It also continues to be performed by Lee Greenwood himself on a national level at various events, including at the 2017 and 2025 presidential inaugurations of Donald Trump, the Republican National Convention and various Trump rallies.\nTrump and Greenwood also have become friends, with the two teaming up to sell the “God Bless the USA Bible” last year.\n-\n‘Back in the U.S.A.’\n“Where hamburgers sizzle on an open grill night and day/ Yeah, and a juke-box jumping with records like in the U.S.A.”\nThe song’s lyrics were reportedly based on Chuck Berry’s return to America following a trip to Australia, where he witnessed the poor living standards of Australian Aborigines.\n-\n‘Surfin U.S.A’\n“You’d see ’em wearing their baggies/ Huarachi sandals too/ A bushy bushy blonde hairdo/ Surfin‘ U. S. A.”\nThe summer song makes reference to multiple American surf spots, including Del Mar, Swami’s and Trestles. Interestingly, only one member of The Beach Boys, Dennis Wilson, actually surfed.\n-\n‘This Land Is Your Land’\n“From California, to the New York Island/ From the Redwood forest, to the Gulf Stream waters/ This land was made for you and me”\nWoody Guthrie wrote the song to combat what he believed to be an unrealistic and overly romanticized interpretation of the United States in Irving Berlin’s “God Bless America.”\n-\n‘America’\n“So we bought a pack of cigarettes and Mrs. Wagner pies/ And we walked off to look for America”\nSimon & Garfunkel’s song describes the cross-country trip of two hitchhikers, whose initial hope gives way to sadness as they attempt to find “themselves” as they discover the country. The “Kathy” referred to in the song was Kathy Chitty, Paul Simon’s onetime love-interest.\n-\n‘American Woman’\n“American woman, get away from me/ American woman, mama, let me be”\nThe Guess Who song was conceived from a live jam during a Kitchener, Ontario, concert with the studio recording featuring the original improvised lyrics in their entirety. Though the song often is thought of as anti-American and chauvinistic, Jim Kale, the group’s bassist, has said: “The popular misconception was that it was a chauvinistic tune, which was anything but the case. The fact was, we came from a very strait-laced, conservative, laid-back country, and all of a sudden, there we were in Chicago, Detroit, New York — all these horrendously large places with their big city problems. After that one particularly grinding tour, it was just a real treat to go home and see the girls we had grown up with. Also, the war was going on, and that was terribly unpopular. We didn’t have a draft system in Canada, and we were grateful for that. A lot of people called in anti-American, but it wasn’t really. We weren’t anti-anything. John Lennon once said that the meanings of all songs come after they are recorded. Someone else has to interpret them.”\nLenny Kravitz famously covered the song for the Mike Myers film Austin Powers: The Spy Who Shagged Me.\n-\n‘Born in the U.S.A.’\n“I was born in the U.S.A., born in the U.S.A./ Got in a little hometown jam/ So they put a rifle in my hand”\nThough it is often misunderstood as a nationalistic anthem, Bruce Springsteen intended the song to call attention to the negative effects of the Vietnam War and how veterans were treated after they returned home.\n“I don’t know if anybody could imagine what [Vietnam War veterans’] particular experience is like,” Springsteen told Rolling Stone in 1984. “I don’t think I could, you know? I think you had to live through it. But when you think about all the young men and women that died in Vietnam, and how many died since they’ve been back — surviving the war and coming back and not surviving — you have to think that, at the time, the country took advantage of their selflessness. There was a moment when they were just really generous with their lives.”\nThe song ranked 275th on the Rolling Stone’s “500 Greatest Songs of All Time.”\n-\n‘American Girl’\n“Well, she was an American girl/ Raised on promises/ She couldn’t help thinkin‘/ That there was a little more to life somewhere else”\nThe song was rumored to be written about a girl who died by suicide after jumping from a residence hall at the University of Florida in Gainesville, where Tom Petty grew up. The singer rebuffed those allegations.\n-\n‘American Pie’\n“We were singin‘ bye-bye, Miss American Pie/ Drove my Chevy to the levee, but the levee was dry.”\nThis song is best known for its cryptic lyrics that have led to much speculation and a slew of interpretations. It is believed to be about the late singer Buddy Holly, who died in a plane crash and to whom Don McLean dedicated his American Pie album.\n-\n‘Kids in America’\n“New York to East California. /There’s a new wave coming I warn you. /We’re the kids in America.”\nThough the song says different, Kim Wilde was not actually a kid in America. She grew up in west London, the daughter of rocker Marty Wilde, who wrote the song with son Ricky.\n“My dad’s head went into a fantasy, this idea of everything being better in America,” Kim once said of the meaning behind the tune. “Of course for his generation, that was very true. Everyone was going to drive in movies and drinking milkshakes and having hamburgers in America. We weren’t doing things like that in the U.K. I think a lot of that got caught up in the lyrics — all the kids in America are having a better, more interesting, more dangerous time than we were here.”\n-\n‘Fortunate Son’\n“Some folks are born made to wave the flag/ Ooh, they’re red, white and blue/ And when the band plays ‘Hail to the chief’/ Ooh, they point the cannon at you, Lord”\nCreedence Clearwater Revival lead singer John Fogerty told Rolling Stone that the song was inspired by David Eisenhower, grandson of President Eisenhower, and Julie Nixon, the daughter of President Nixon, saying, “you just had the feeling that none of these people were going to be involved with the [Vietnam] war.”\n-\n‘American Idiot’\n“Don’t wanna be an American idiot./ Don’t want a nation under the new media.”\nThe song title is a pretty good giveaway that this isn’t a rousing patriotic anthem. With its scathing criticism of the American media and national values, Green Day lead vocalist Billy Joe Armstrong never intended the song to be another “America the Beautiful.” Armstrong was inspired to write “American Idiot” after hearing the Lynyrd Skynyrd song “That’s How I Like It” on his car radio and strongly disagreeing with its pro-redneck sentimentalities.\n-\n‘Jack & Diane’\n“Little ditty about Jack and Diane/ Two American kids growin‘ up in the heartland”\nAccording to John Mellencamp (then performing as John Cougar), “Jack & Diane” was written about a relationship he had with a girl who lived near his hometown of Seymour, Indiana.\n-\n‘Courtesy of the Red, White and Blue’\n“Man, it’s gonna be hell/ When you hear Mother Freedom/ Start ringin’ her bell”\nToby Keith’s father’s death in a car accident and the tragedy of the 9/11 terrorist attacks prompted Keith to write a song about his father’s faith in the United States. Keith initially refused to record the song and only sang it live at his concerts for military personnel.\nKeith would go on to write another patriotic song about his father, 2011’s “Made in America.”\n-\n‘White America’\n“Country of ours, the stripes and the stars for the rights that men have died for to protect/ The women and men who have broke their necks for the freedom of speech the United States”\nEminem wrote the song to combat allegations from parents and politicians, including Second Ladies Lynne Cheney and Tipper Gore, that he had influenced criminal behavior in young white Americans.\n-\n‘Party in the U.S.A.’\n“So I put my hands up/ They’re playin‘ my song/ I know I’m gonna be OK/ Yeah, it’s a party in the U.S.A.”\nMiley Cyrus has stated that she feels that the song does not properly reflect her musical capabilities and background, citing that when the song was recorded, she had never actually listened to a Jay-Z song — an artist who is referenced in the lyrics. Still, it’s become a Fourth of July staple.\n-\n‘Made in America’\n“I pledge allegiance to my Grandma/ For that banana pudding, our piece of Americana/ Our apple pie was supplied through Arm and Hammer”\nOff of Jay-Z and Kanye West’s Watch the Throne album, the inspirational ballad deals with themes of family, childhood and the American Dream. R&B singer Frank Ocean wrote the vocals for the track.\n-\n‘Pink Houses’\n“Oh, but ain’t that America/ For you and me/ Ain’t that America/ Something to see, baby/ Ain’t that America /Home of the free, yeah/ Little pink houses/ For you and me.”\nJohn Mellencamp (then performing as John Cougar Mellencamp) has said the song is actually a critique on American life, not a celebration. The chorus (above) is meant to be sarcastic.\n“This one has been misconstrued over the years because of the chorus — it sounds very rah-rah. But it’s really an anti-American song,” Mellencamp has said. “The American Dream had pretty much proven itself as not working anymore. It was another way for me to sneak something in.”\n-\n‘Independence Day’\n“Let freedom ring, let the white dove sing/ Let the whole world know that today/ Is a day of reckoning/ Let the weak be strong, let the right be wrong/ Roll the stone away, let the guilty pay/ It’s Independence Day”\nIt sounds like a patriotic anthem, but it’s more of an empowering message of how an a woman escaped her abusive husband after setting her house on fire — thereby getting her own “independence day.” However, after it was released, many folks didn’t get the meaning of the song.\n“Some people just don’t understand what the song is about at all,” singer Martina McBride has said.\nHowever, the song has had an impact on victims of domestic violence. “I started getting all these letters — handwritten letters, back in the day — from women saying, ‘This is my song,’” McBride said. “I got a few letters that said, ’I heard this song on the radio, I’ve been battered for 10 years, and I left. This was the thing that made me realize that it’s not my fault, that I need to make a change.’”\n-\n‘The Star Spangled Banner’\n“And the rocket’s red glare, the bombs bursting in air/ Gave proof through the night that our flag was still there/ O say does that star-spangled banner yet wave/ O’er the land of the free and the home of the brave?”\nFrancis Scott Key’s tune is, for obvious reasons, as patriotic as you can get. America’s National Anthem has been sung by scores and scores and scores of famous faces at sporting events, military celebrations, graduations and much more.\nBut the most famous rendition might belong to Whitney Houston, who performed it in January 1991 — just days after the Persian Gulf War started — at Super Bowl XXV in Tampa, Florida. Due to public demand, Arista Records then released a single of her performance, with proceeds donated to the American Red Cross Gulf Crisis Fund.\nHouston said of her performance at the Super Bowl: “If you were there, you could feel the intensity. You know, we were in the Gulf War at the time. It was an intense time for a country. A lot of our daughters and sons were overseas fighting. I could see, in the stadium, I could see the fear, the hope, the intensity, the prayers going up, you know, and I just felt like this is the moment. And it was hope, we needed hope, you know, to bring our babies home and that’s what it was about for me, that what I felt when I sang that song, and the overwhelming love coming out of the stands was incredible.”\nAfter the September 11 attacks, Arista rereleased the song, with proceeds donated to firefighters and victims of the terrorist attacks.\nTHR Newsletters\nSign up for THR news straight to your inbox every day"
    },
    {
      "url": "https://cloud.email.hollywoodreporter.com/signup/",
      "text": "Your subscription preferences have been updated. Please allow up to 24 hours for changes to take effect.\nA daily brief about what matters and what's interesting in Hollywood.\nA weekly brief about what matters and what's interesting in Hollywood.\nA scoop-driven, insider view of Hollywood's genre and blockbuster movie landscape, led by Borys Kit and Aaron Couch.\nThe latest prognostications from our expert pundit, Scott Feinberg.\nTHR's weekly newsletter dedicated to helping you cut through the daunting clutter of the broadcast, cable, and streaming TV landscape.\nThe gowns, the goods and the gossip of Hollywood.\nUp-to-the-minute news as it happens.\nThe latest streaming ratings, box office grosses and the narratives behind the numbers.\nA deeper look into the wonderful world of animated films.\nBreaking Awards news as it happens.\nRoundup of awards news, recaps, and analysis.\nCareer-spanning conversations with top awards contenders hosted by Scott Feinberg.\nThemed articles offering a deeper look at category-specific contenders.\nTech and crafts stories.\nFeaturing box office updates for new releases.\nA deeper dive into different aspects of the documentary films and series in contention.\nShowcasing all of the stories and reviews coming out of film festivals, including but not limited to Cannes, Toronto, Venice, etc.\nWeekly showcase of stories focusing on international contenders.\nCovering all international news for TV-, film- and business-related topics.\nInternational news as it happens.\nConsumer TV news as it happens.\nThe most stylish online finds and coolest products seen on stars, as selected by Hollywood Reporter editors.\nMusic awards, albums and artists that Hollywood should know about.\nTHR's most read reviews from the week's premieres.\nScreenings and Q&As presented by THR.\nTHR's curated newsletter featuring the top trending TV stories of the week.\nOur daily update on current TV industry news.\nCountry or region-themed articles offering a deeper look into their entertainment industry.\nUpdates from THR Partners & Sponsors."
    },
    {
      "url": "https://www.hollywoodreporter.com/news/music-news/robert-schwartzman-wayne-newton-documentary-zombies-1236340476/",
      "text": "Robert Schwartzman, who found critical success with his recent documentary about the British Invasion band The Zombies, has begun work on another music doc, this one about Las Vegas legend Wayne Newton.\nThe director revealed that the “Danke Schoen” singer would be his next subject Thursday night during a Q&A session that followed a screening of Hung Up on a Dream: The Zombies Documentary (2023) at the Grammy Museum in Los Angeles.\nNewton, 83, was just a teenager when he began performing in Las Vegas with his older brother, Jerry, and the colorful live performer has logged tens of thousands of performances in the city — and he’s still going strong.\nRelated Stories\nBorn in Virginia and raised in Arizona, Newton was generously given “Danke Schoen” to record in the early 1960s by “Mack the Knife” singer Bobby Darin, and the song peaked at No. 13 on the Billboard Hot 100.\nHe also had another big hit with “Daddy Don’t You Walk So Fast,” which made it to No. 4 in 1972, and he has worked as an actor, with turns on Bonanza, License to Kill (1989) and The Adventures of Ford Fairlane (1990).\nSchwartzman said Newton is participating in the documentary.\nHung Up on a Dream premiered at SXSW in 2023, played the festival circuit and had a brief theatrical run. It just became available to stream on Apple TV+, Amazon and Altavod.\nThe Zombies — keyboardist Rod Argent, vocalist Colin Blunstone, guitarist Paul Atkinson, bassist Chris White and drummer Hugh Grundy — are known for such hits as “She’s Not There” and “Time of the Season.” They were inducted into the Rock and Roll Hall of Fame in 2019.\nOn Friday, it was announced that The Zombies will release a remastered mono version of 1967’s Odessey and Oracle, which regularly shows up on lists of the greatest rock albums of all time, on Sept. 26 via Beechwood Park Records.\nSchwartzman, a son of two-time Oscar-nominated actress Talia Shire as a member of the iconic Francis Ford Coppola family, recently directed The Good Half (2023), starring Nick Jonas, Brittany Snow, David Arquette, Matt Walsh and Elisabeth Shue. It was his fourth narrative feature.\nSchwartzman also has a music career as the lead vocalist of the rock/pop band Rooney.\nTHR Newsletters\nSign up for THR news straight to your inbox every day"
    },
    {
      "url": "https://www.hollywoodreporter.com/lists/notable-deaths-2025-hollywood-entertainment/?utm_source=yahoo-editorial&utm_medium=feeds&utm_campaign=best_of_brands",
      "text": "The entertainment industry is already mourning the loss of several actors, singers, performers, creatives, executives and all-around industry legends this year.\nThe Hollywood Reporter is highlighting some of the most well-known names who have died in 2025, including Val Kilmer, Gene Hackman, Michelle Trachtenberg, David Lynch, Irv Gotti and Jeff Baena.\nKilmer, who won praise for memorable roles as Iceman in Top Gun, Doc Holliday in Tombstone and Batman in Batman Forever, died at age 65 of pneumonia in Los Angeles, his daughter, actress Mercedes Kilmer announced.\nHackman, the much-admired two-time Oscar winner and his second wife, Betsy Hackman, 64, were found dead in February at their home in Santa Fe, New Mexico. The actor died of severe cardiovascular disease, with Alzheimer’s disease as a significant contributory factor, officials later announced.\nTrachtenberg, who started her career as a child performer before rising to fame for her roles on Buffy the Vampire Slayer and Gossip Girl, died in February at age 39.\nLynch, the writer-director known for his films and TV series including Blue Velvet, Mulholland Drive and Twin Peaks, died in January at age 78. Last year he revealed that he was suffering from emphysema after many years of smoking and couldn’t leave the house over fears of getting COVID-19.\nGotti, a record executive, music producer and entrepreneur who founded of Murder Inc. Records, died in February at age 54.\nBaena, an indie film director and writer who was married to actress Aubrey Plaza, died in January at age 47 by suicide, according to the Los Angeles County Coroner’s Office. “This is an unimaginable tragedy,” Plaza shared in a statement at the time. “We are deeply grateful to everyone who has offered support. Please respect our privacy during this time.”\nBelow are more of this year’s most notable deaths in Hollywood, and check out THR‘s obituaries page for other 2025 industry deaths, as well as last year’s entertainment deaths here.\n-\nJeff Baena\nJune 29, 1977 – Jan. 3, 2025\nJeff Baena, an indie film director and writer and Aubrey Plaza‘s husband, died on Jan. 3. He was 47. The filmmaker died by suicide on Friday in his Los Angeles home, according to the Los Angeles County Coroner’s Office. Read his full obituary here. -\nSam Moore\nOct. 12, 1935 – Jan. 10, 2025\nSam Moore, who with partner Dave Prater helped bring the sound of the church to pop music with a string of call-and-response hits as the high tenor in the famed Stax Records duo Sam & Dave, died on Jan. 10. He was 89. Full obituary here. -\nDavid Lynch\nJan. 20, 1946 – Jan. 16, 2025\nDavid Lynch, the writer-director whose films and TV series including Blue Velvet, Mulholland Drive and Twin Peaks portrayed a seemingly bucolic America, only to reveal it as teeming with the mysterious and macabre, died on Jan. 16. He was 78. Read his obituary. -\nJoan Plowright\nOct. 28, 1929 – Jan. 16, 2025\nJoan Plowright, the distinguished actress of the post-war British stage whose considerable skill as a performer was at times eclipsed by her fame as the third and last wife of Laurence Olivier, died on Jan. 16. She was 95. Full obituary here. -\nIrv Gotti\nJune 26, 1970 – Feb. 5, 2025\nIrv Gotti, a noted record executive, music producer and entrepreneur best known as the founder of Murder Inc. Records, has died, The Hollywood Reporter confirmed. He was 54. Full obituary. -\nMichelle Trachtenberg\nOct. 11, 1985 – Feb. 26, 2025\nMichelle Trachtenberg, the veteran actress who started as a child performer with high-profile roles like the title character in Harriet the Spy before finding success on Buffy the Vampire Slayer and Gossip Girl, died on Feb. 26. She was 39. Read her obituary here. -\nGene Hackman\nJan. 30, 1930 – February 2025\nGene Hackman, the versatile leading man renowned for his smoldering performance as hard-nosed New York City narc Jimmy “Popeye” Doyle in The French Connection, has died. He was 95. The much-admired two-time Oscar winner and his second wife, Betsy Arakawa, 64, were found dead Feb. 26 at their home in Santa Fe, New Mexico. Read full obituary here. -\nVal Kilmer\nDec. 31, 1959 – April 1, 2025\nVal Kilmer, the charisma-oozing leading man who lost himself portraying such tormented, self-loathing characters as Jim Morrison, gunslinger Doc Holliday and Batman during his all-too-brief career, died on April 1 of pneumonia. He was 65. Full obituary here. -\nDon Mischer\nMarch 5, 1940 – April 11, 2025\nDon Mischer, the Emmy-accumulating director-producer who called the shots on the biggest live entertainment events in the world, from Super Bowl halftime shows and Olympic opening ceremonies to the Oscars and the Emmys, died on April 11. He was 85. Full obituary here.\nTHR Newsletters\nSign up for THR news straight to your inbox every day"
    },
    {
      "url": "https://finance.yahoo.com/news/live-nation-posts-strong-second-202758372.html",
      "text": "Live Nation posted $7 billion in revenue for the second quarter of 2025, a 16 percent jump from a year ago and a significant bump from the company’s first quarter earnings back in May as the concert season is now in full swing.\nOperating income rose about 4 percent to $487 million, and global attendance for shows grew 14 percent to 44 million, Live Nation said. Concert revenue itself reached a record-high, Live Nation said, rising 19 percent to about $6 billion year over year, while ticketing revenue for Ticketmaster rose a much more modest 2 percent to $742 million. Sponsorship and advertising grew 9 percent to nearly $341 million.\nMore from The Hollywood Reporter\n-\n'The Runarounds' Trailer: Real Life Musicians-Turned-Actors Chase Love and Fame\n-\nKelly Clarkson Postpones Vegas Residency Dates, Revealing Ex-Husband \"Has Been Ill\"\n-\nWarner Music Group Swings to Net Loss, But Sees Revenue Growth In Third Quarter\nDuring the company’s first quarter earnings three months ago, where revenue had dropped 11 percent to $3.3 billion, the company had pointed to $5.4 billion in deferred revenue to suggest more activity in the months ahead. Live Nation reported another $5.1 billion in deferred revenue for concerts this time as well, a 25 percent increase from last year. The company has sold 130 million tickets for its concerts through July and says it’s on pace to beat its record from last year where Live Nation sold 151 million tickets.\n“Global expansion continues to drive touring growth, with fan attendance hitting new highs and ticket buying strong at every price point from VIP to the back row,” Live Nation CEO Michael Rapino said in a statement. “To meet this momentum, we’re expanding our global venue portfolio and investing in the artists who make it all possible. We’re continuing to deliver record revenue and concert ticket sales, and with investments focused on high‑growth markets and fan experiences, we’re positioned to grow operating income and adjusted operating income by double-digits this year and for years to come.”\nLive Nation’s earnings report comes just over a week after the company announced it has increased its ownership stake in Mexican concert promoter Ocesa, with Live Nation now owning 75 percent of the company.\nBeyond its strong earnings, Live Nation still faces an ongoing civil lawsuit from the Department of Justice over monopoly allegations, with the DOJ calling to break up the company. Live Nation has consistently denied the allegations.\nBest of The Hollywood Reporter\n-\nMeet the World Builders: Hollywood's Top Physical Production Executives of 2023\n-\nMen in Blazers, Hollywood’s Favorite Soccer Podcast, Aims for a Global Empire\nSign up for THR's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram."
    },
    {
      "url": "https://www.hollywoodreporter.com/lifestyle/style/historic-first-cannabis-sales-consumption-approved-major-california-festival-1230643/",
      "text": "Less than two years after recreational legalization in California, legal marijuana sales and consumption will be allowed at Outside Lands in San Francisco, a historic first for a major festival in the state.\nSome limited sales and consumption have happened at past California events, including the Emerald Cup, the first cannabis event to allow the sale of marijuana in the state. The annual event at the Sonoma County Fairgrounds last December generated more than $4.2 million in tax revenue for Sonoma County, supporting more than 200 jobs with $7.1 million in labor income.\nThe city of Santa Rosa had to pass a “cannabis ordinance as a way to ‘normalize’ the industry within our economy,” explained the city’s Mayor Tom Schwedhelm in a statement to Billboard provided by Emerald Cup organizers. In September 2018, Gov. Gavin Newsom signed legislation making it easier for counties to provide temporary permits for events with recreational use and in May, the Northern Nights festival became one of the first music fests to legally allow cannabis sales and consumption in its 21+ Tree Lounge area.\nBringing cannabis to Outside Lands, the highest-grossing festival in the U.S. reported to Billboard Boxscore in 2018, is a major milestone and was approved by regulators just two days before the opening of the event, which is being produced by Another Planet Entertainment.\nCannabis company Moxie will sell single-use cannabis dabs for sale for $10 at Grass Lands, Outside Lands’ fenced-off cannabis section, while KIVA will be offering enhanced chocolates, gummies and mints. In total, 28 cannabis companies will participate in Grass Lands, which will have its own curated stage for comedy, music and cooking. San Francisco’s new regulations governing temporary cannabis sales restrict consumption and sales outside of the Grass Lands area, which will be hidden from visibility from festgoers.\nThis article originally appeared on Billboard.com.\nTHR Newsletters\nSign up for THR news straight to your inbox every day"
    }
  ],
  "argos_summary": "Outside Lands, a unique music festival in San Francisco's Golden Gate Park, has been a staple for 17 years, showcasing a diverse lineup and incorporating local culture, including food and cannabis sales. Co-founders Rick Farman and Allen Scott emphasize the festival's evolution and commitment to maintaining its independent roots amidst rising costs and industry challenges. The festival continues to attract major artists and audiences, with its latest edition featuring performers like Doja Cat and Tyler, the Creator, while also introducing innovative elements like a legal marriage venue and a focus on local cuisine.",
  "argos_id": "4WMYYY5NY"
}