{
  "url": "https://www.usatoday.com/story/sports/nfl/2025/08/08/shedeur-sanders-stats-today-browns-panthers/85583973007/",
  "authorsByline": "Joe Rivera",
  "articleId": "abde69f5e9574d1c8ed8c3d265b32b18",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/08/USAT/85584097007-shedeur-sanders-browns-imagn-080825.jpg?crop=5398,3037,x0,y281&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T22:49:29+00:00",
  "addDate": "2025-08-08T22:54:03.167793+00:00",
  "refreshDate": "2025-08-08T22:54:03.167795+00:00",
  "score": 1.0,
  "title": "Shedeur Sanders stats vs. Panthers: How Browns QB played today",
  "description": "The 2025 NFL Draft fifth-round pick is getting his opportunity to shine vs. the Carolina Panthers. Here's his tally for the day.",
  "content": "Shedeur Sanders, arguably the most hyped fifth-round pick in NFL history, is set to take center stage Friday night.\n\nThe Cleveland Browns quarterback is getting the start vs. the Carolina Panthers in his first taste of NFL action when the two sides square off in their preseason debuts Aug. 8.\n\nWhile preseason isn't entirely \"real,\" Sanders will have an opportunity to make it very real and strengthen his case and standing in the Browns' QB battle on Friday night. With 2025 third-round pick Dillon Gabriel and former first-rounder Kenny Pickett both nursing hamstring injuries, it'll be the \"Shedeur Show.\"\n\nThat makes for appointment viewing. Here's how Sanders played vs. the Panthers:\n\nThis section will be updated.\n\nWhy did Shedeur Sanders fall in the draft?\n\nA combination of unique circumstances, starting with who Sanders is – the son of Hall of Fame player Deion Sanders, who was his college coach – ultimately \"clouded the projection,\" NFL draft analyst for The Athletic Dane Brugler said, for \"those of us on the outside\" of the NFL and those employed by a team.\n\n\"Teams thought he could have gone in the top 40 and that would have not been surprising at all,\" Brugler told USA TODAY Sports.\n\nInstead, the opposite occurred, leading to the same reaction: surprise.\n\n\"Around the league, people were shocked,\" ESPN draft analyst Matt Miller said. \"No one that I talked to expected it.\" – Chris Bumbaca\n\nThe Browns vs. Panthers game will kick off at 7 p.m. ET Friday. That will be NFL fans’ first chance to get an extended look at Shedeur Sanders, who is starting the game.",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/picture-gallery/sports/nfl/2025/08/07/nfl-preseason-week-1-photos/85568485007/",
    "https://sportsdata.usatoday.com/football/nfl/teams/carolina-panthers/364",
    "https://sportsdata.usatoday.com/football/nfl/players/shedeur-sanders/1272321",
    "https://www.usatoday.com/story/sports/nfl/2025/08/05/shedeur-sanders-playing-preseason-browns/85529894007/",
    "https://www.usatoday.com/story/sports/nfl/2025/08/08/browns-panthers-live-updates-shedeur-sanders-debut/85569070007/",
    "https://sportsdata.usatoday.com/football/nfl/scores",
    "https://sportsdata.usatoday.com/football/nfl/teams/cleveland-browns/329",
    "https://sportsdata.usatoday.com/football/nfl/players/kenny-pickett/976924",
    "https://sportsdata.usatoday.com/football/nfl/players/dillon-gabriel/1165333",
    "https://www.usatoday.com/story/sports/nfl/draft/2025/05/12/shedeur-sanders-nfl-draft-slide-explained-mock-draft/83535833007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Shedeur Sanders",
      "weight": 0.11556487
    },
    {
      "name": "Shedeur Sanders stats",
      "weight": 0.11152589
    },
    {
      "name": "Deion Sanders",
      "weight": 0.10146975
    },
    {
      "name": "Sanders",
      "weight": 0.09803845
    },
    {
      "name": "NFL action",
      "weight": 0.09010544
    },
    {
      "name": "NFL history",
      "weight": 0.089871384
    },
    {
      "name": "Browns QB",
      "weight": 0.087080054
    },
    {
      "name": "ESPN draft analyst Matt Miller",
      "weight": 0.08663566
    },
    {
      "name": "NFL",
      "weight": 0.08460447
    },
    {
      "name": "Cleveland Browns",
      "weight": 0.0750702
    }
  ],
  "topics": [
    {
      "name": "NFL"
    },
    {
      "name": "Cleveland Browns"
    },
    {
      "name": "Football"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.998046875
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.94482421875
    },
    {
      "name": "/Sports/Sport Scores & Statistics",
      "score": 0.83251953125
    }
  ],
  "sentiment": {
    "positive": 0.22692871,
    "negative": 0.2824707,
    "neutral": 0.4909668
  },
  "summary": "Shedeur Sanders, the Cleveland Browns quarterback, is set to start against the Carolina Panthers in his first NFL game. This will be his first opportunity to strengthen his standing in the Browns' QB battle, as Dillon Gabriel and former first-rounder Kenny Pickett are both nursing hamstring injuries. The game will be the first time NFL fans have seen Sanders, who is the son of Hall of Fame player Deion Sanders. The timing of the game and circumstances surrounding Sanders' draft selection were noted as a factor in his selection.",
  "shortSummary": "Shedeur Sanders, a highly anticipated fifth-round NFL pick, made a promising debut for the Cleveland Browns against the Carolina Panthers, highlighting his inconsistent performances.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "644c6675bfd7490d86a52f318da79c1d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/kenny-pickett/976924",
      "text": "Shedeur Sanders' first NFL preseason game will include his first touchdown pass in a Cleveland Browns jersey, as Kaden Davis catches it.\nThe Browns vs. Panthers preseason game got chippy Friday, and both Xavier Legette and Rayshawn Jenkins were ejected as a result.\nIt's the Browns vs. Panthers in Week 1 of the NFL preseason. How does Shedeur Sanders look in his NFL starting debut? Follow our live updates.\nShedeur Sanders is set to make his Browns debut Friday against the Panthers. USA TODAY Sports is tracking the rookie's performance.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/draft/2025/05/12/shedeur-sanders-nfl-draft-slide-explained-mock-draft/83535833007/",
      "text": "NFL draft experts explain Shedeur Sanders' draft fall: Shrunken pool, imperfect interviews\nNo one could have predicted Shedeur Sanders lasting until in the fifth round of the NFL draft. Not even the media’s draft experts who are devoted to the year-round process that defines a considerable portion of the league’s offseason schedule.\nSo how did the disconnect form between reality – Sanders was taken as the sixth quarterback of the class at No. 144 overall – and the forecast that he was a first- or second-round pick?\nA combination of unique circumstances, starting with who Sanders is – the son of Hall of Fame player Deion Sanders, who was his college coach – ultimately “clouded the projection,” NFL draft analyst for The Athletic Dane Brugler said, for “those of us on the outside” of the NFL and those employed by a team.\n“Teams thought he could have gone in the top 40 and that would have not been surprising at all,” Brugler told USA TODAY Sports.\nInstead, the opposite occurred, leading to the same reaction: surprise.\n“Around the league, people were shocked,” ESPN draft analyst Matt Miller said. “No one that I talked to expected it.”\n“No one foresaw or had a premonition of fifth round, but most people in the league thought it was very likely he wouldn’t be a first-round pick,” The Ringer draft expert Todd McShay said. “A lot of people in the league had second-round grades on him. Some people in the league I talked to had mid-late first-round grades on him. Typically, the demand is a lot higher than the supply, and it was again this year.”\nMiller has one theory behind the disconnect. Top-tier decision-makers, such as a general manager, head coach or owner had a different perspective than an area scout or college scouting director.\n“I think that’s where the difference in opinions really came from, was from those top-end decision-makers,” Miller said.\nMany teams assumed others had first-round grades on Sanders.\n“I just think every team thought someone else would do it,” Miller said.\nBut grades, Miller added, are based only upon what an analyst knows.\nHow did the NFL react to Shedeur Sanders’ fall?\nGoing back to December, Brugler had a feeling Sanders would be a top-40 to top-50 pick – not top five, like many in the online and social media discourse continued spouting.\n“I fought this battle all fall, because a lot of people were saying, ‘Oh he’s top five.’ And I was kind of saying, ‘The vibe I get from teams is late one, early two, top-40-type pick,'\" Brugler said.\nQuarterback desperation is real, however. The New York Giants could have taken a quarterback at No. 3 overall and nobody in the league would have batted an eye. But then the question became, if Sanders doesn’t go three or 21 to the Pittsburgh Steelers, is he going to fall out of the first round? In the days before the first round, that answer clearly became “yes.”\nStill, Miller had Sanders pegged to the Steelers in his final mock draft but didn’t feel good about it; he couldn’t find one team that had a first-round grade on Sanders.\nAs the draft played out and the Browns took Dillon Gabriel with the 94th overall pick in Round 3, both the media and those in the league played the same game of connect the dots, Brugler said. The Steelers were still the most logical fit.\n“There was a lot of intrigue both from a fan interest and from a 32-team interest of ‘Where’s he going to fall?’” Brugler said.\nA shrinking pool and imperfect interviews\nUnknowingly, Sanders fell into a shrinking pool of teams that it made sense for him to fall to, McShay said.\nFor one, not every team needs a quarterback. That at least halves the number of potential landing spots from the grand total of 32. Not every one of the remaining teams used the draft to address the quarterback position, shrinking the pool again. Then, the teams picking quarterbacks rated other quarterbacks higher. The number of teams available to Sanders, McShay said, went from “six to four to two to one.”\n“He shrunk the pool down to Cleveland, and he didn’t even know it at the time.” McShay said.\nAnd once there is a limited pool, Brugler said, different teams don’t jump in the water because they haven’t done the due diligence on a prospect such as Sanders, because he’s a quarterback. For example, the Philadelphia Eagles aren’t doing a lengthy combine interview or private workout with Sanders.\nThat’s why many in the league thought he’d end up with the Steelers, Brugler said, as his meeting with head coach Mike Tomlin had gone well, per multiple reports.\n“Once you got to day three, it was anybody’s guess,” Brugler said.\nMcShay tried sounding the alarm after he heard from multiple people at the scouting combine in Indianapolis in late February that Sanders had subpar interviews with teams.\n“It was conveyed to me, essentially, that they got the sense that Shedeur did not care an awful lot about what that organization thought of him,” McShay said. “Nothing was disrespectful. There wasn’t foul language. Nothing got confrontational. Just didn’t take it seriously.”\nThat’s a departure from the way a typical prospect might comport himself during interviews with teams. But Sanders was not a typical prospect.\n“It really stands out,” McShay said.\nMcShay understands his place in the draft media ecosystem and knows he isn’t the “breaking news guy,” he said. He figured that if he’d heard about Sanders’ interviews twice, from two teams in the top 10 in need of quarterbacks (at that point in the offseason there were six), a network insider would go report it.\n“It didn’t play to my sensibilities that anyone in any job interview situation wouldn’t put their best foot forward,” McShay said.\nAll he heard instead were largely glowing reviews, “all positive things,” McShay said.\n“The important stuff behind the scenes was not accurately being reflected,” he added.\nMcShay said he tried to work with his executive producer, Conor Nevins, about how to report it in his post-combine shows. He recognized the nugget would come with backlash.\n“At the end of the day, I was trying to warn everyone for months, dating back to the first week in March, so for two months,\" McShay said. \"I still wouldn’t believe that he would fall to the fifth round, I don’t think anyone saw that coming.”\nSpring matters – advice from agents might matter more\nIf anything, Miller said he hopes everything about the chasm between Sanders’ pre-draft coverage and the quarterback’s fall can inform fans of the process.\n“Fans expect us to have all the information when the season ends in December,” Miller said. “So much happens throughout the process. Teams aren’t even making decisions sometimes until the week of the draft.”\nMiller pitched fans on letting the offseason calendar play out because tentpole events like the combine matter and influence what happens on draft weekend.\nMiller, McShay, Brugler and other marquee draft analysts such as ESPN’s Mel Kiper Jr. and NFL Network’s Daniel Jeremiah, are only one person – “a one-man scouting department,” as Miller put it.\n“Opposed to NFL teams who have tons and tons of people to do that, to gather information and further break things down with the access to the player and medicals and things like that,” Miller said.\nThe antennas for Miller first went up when Sanders didn’t perform in workouts at the East-West Shrine Bowl in January, although he lacked an injury-related excuse.\n“I think that’s when teams started getting a little bit (annoyed),” Miller said, “it was like ‘OK, you’re circumnavigating the rules and the process that we’ve set up.’”\nDuring the combine, Miller said he caught heat after appearing on “NFL Live” and saying Sanders should be throwing in front of scouts and executives. Teams respect the process and want the same from the prospects.\n“I think where the Sanders family made a mistake was in assuming Shedeur would also be a top three pick,” Miller said. “Shedeur needed to prove himself and instead he sat out the process.”\nTo Brugler, only one quarterback actually had leverage in this year’s class: Cam Ward, the first overall pick to the Tennessee Titans.\n“It’s a job interview,” Brugler said of Sanders’ pre-draft interviews. “It’s not a recruiting trip. It’s a job interview. And it didn’t sound like he treated it as such.”\nAfter Gabriel was drafted before Sanders, Brugler wrote on social media about the importance of spring for quarterbacks in the draft.\n“What you do on tape, it matters, but above all, it’s an intangible position,” Brugler said. “If you don’t win over teams during the interview process, it’s going to be a long haul for you. Part of this, I don’t even blame Shedeur, I just don’t think he had good advice.”\nNot having an agent didn’t help Sanders either, both Miller and Brugler said.\n“I don’t want to sound like we’re just banging on Shedeur. Because I think a big part of it was not having the right advice around him,” Brugler said. “Agents don’t get enough credit for how they’re able to – it’s not just the training for the combine and stuff, it’s the media training, it’s the team interview training, it’s guiding and putting them on the right path.\n“It just didn’t seem like he had the right people around him to do that. So I don’t want to put it all on Shedeur as if it’s a hundred percent his fault he fell as far as he did.”\nAll the NFL news on and off the field. Sign up for USA TODAY's 4th and Monday newsletter."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/2025/08/05/shedeur-sanders-playing-preseason-browns/85529894007/",
      "text": "Is Shedeur Sanders playing preseason Week 1? Browns QB to start, per report\nAll eyes are going to be on Shedeur Sanders as he makes his NFL preseason debut and attempts to show the Cleveland Browns he can be a factor in the team's wide-open quarterback battle.\nIt wasn't immediately clear whether Sanders, a fifth-round rookie, would be able to play in Cleveland's preseason opener against the Carolina Panthers. He was dealing with arm soreness that threw into doubt his status for the Friday night battle.\nBut after returning to practice Monday, the Colorado product is going to get a chance to play in Cleveland's preseason opener.\nHere's what to know about Sanders' status for Cleveland's first preseason game.\nIs Shedeur Sanders playing preseason Week 1?\nThe Browns are expected to start Sanders in their Week 1 preseason opener, per Mary Kay Cabot of Cleveland.com.\nThe decision comes as the Browns deal with several quarterback injuries. Kenny Pickett and Dillon Gabriel are both dealing with hamstring issues, and it isn't clear whether they will suit up for the contest. Meanwhile, Cabot reports Cleveland would prefer not to play 40-year-old Joe Flacco, who is currently penciled in as the team's top quarterback, in the preseason opener.\nThat would leave Sanders and recently signed veteran Tyler Huntley as the candidates to receive the most playing time against the Panthers.\nIt's worth noting Sanders missed practice time ahead of Cleveland's first preseason game while dealing with arm soreness. However, he returned to practice Monday and downplayed the malady, saying he was back to 100% during that session.\nSanders initially acknowledged he wasn't exactly sure how the team would use him in his potential preseason debut.\n\"I haven't been told that yet,\" Sanders told reporters at Monday's practice.\nBut Sanders made it clear he is looking forward to getting as many reps as possible, knowing he may only get a few chances to prove himself as he attempts to climb Cleveland's wide-open quarterback depth chart.\n\"I think every rep I get in general is valuable,\" Sanders said. \"We definitely taking things up a notch, I would say, with everything. So, every rep – anytime I step on the field, I take it like it could be my last. Because you don't know. There's players that we was just practicing with last week that's not here no more.\"\nBrowns QB depth chart\nThe Browns listed four quarterbacks on their first unofficial depth chart of the preseason before signing Huntley amid their injury concerns. Below is a look at how their current quarterback depth chart shakes out:\n- Joe Flacco\n- Kenny Pickett\n- Dillon Gabriel\n- Shedeur Sanders\n- Tyler Huntley\nThe Browns also have Deshaun Watson on their 90-man roster, but the 29-year-old isn't expected to play in 2025 after tearing his Achilles twice in three months.\nAll the NFL news on and off the field. Sign up for USA TODAY's 4th and Monday newsletter."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/shedeur-sanders/1272321",
      "text": "Shedeur Sanders' first NFL preseason game will include his first touchdown pass in a Cleveland Browns jersey, as Kaden Davis catches it.\nThe Browns vs. Panthers preseason game got chippy Friday, and both Xavier Legette and Rayshawn Jenkins were ejected as a result.\nIt's the Browns vs. Panthers in Week 1 of the NFL preseason. How does Shedeur Sanders look in his NFL starting debut? Follow our live updates.\nShedeur Sanders is set to make his Browns debut Friday against the Panthers. USA TODAY Sports is tracking the rookie's performance.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/dillon-gabriel/1165333",
      "text": "Shedeur Sanders' first NFL preseason game will include his first touchdown pass in a Cleveland Browns jersey, as Kaden Davis catches it.\nThe Browns vs. Panthers preseason game got chippy Friday, and both Xavier Legette and Rayshawn Jenkins were ejected as a result.\nIt's the Browns vs. Panthers in Week 1 of the NFL preseason. How does Shedeur Sanders look in his NFL starting debut? Follow our live updates.\nShedeur Sanders is set to make his Browns debut Friday against the Panthers. USA TODAY Sports is tracking the rookie's performance.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/scores",
      "text": "Gannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/2025/08/08/browns-panthers-live-updates-shedeur-sanders-debut/85569070007/",
      "text": "Shedeur Sanders live updates: Browns vs. Panthers score, highlights\nShedeur Sanders is set to make his Cleveland Browns debut on Friday in what may be one of the most anticipated NFL preseason starts ever by a fourth-string quarterback.\nSanders is getting a chance to lead the Browns with Kenny Pickett and Dillon Gabriel out of action due to hamstring injuries. Meanwhile, Kevin Stefanski is simply giving 40-year-old veteran Joe Flacco the game off, leaving Tyler Huntley as the only other healthy quarterback for the game.\nThe Browns only signed Huntley a few days before their clash with the Panthers, so Sanders may have a long leash as he looks to stake a claim to a spot on Cleveland's QB depth chart.\nHere's what to know about Sanders' debut, including how to watch it and the highlights from it.\nShedeur Sanders throws first TD pass with Browns\nSanders got the Browns into the end-zone following the botched punt, and the score was a thing of beauty. The Colorado product bootlegged to the left after a play-action fake and saw he had a small window to fit the ball into Kaden Davis.\nSanders threaded the needle between two defenders to perfectly deliver it to Davis. The Browns converted the ensuing extra point to tie the game. Browns 7, Panthers 7.\nBrowns stall out, get second chance after botched punt\nA few Browns rush attempts, a little miscommunication and a muffed punt by Carolina's Trevor Etienne led to a second chance to put points on the board for Sanders and the Browns offense. They took over on the Panthers' 10-yard line\nBryce Young hits Jalen Coker for 5-yard touchdown\nThe Panthers got on the board first during Friday night's clash. Young found Coker open in the end-zone on a third-and-goal and feathered a pretty pass to the Holy Cross product.\nThe Panthers brought Matthew Wright on to attempt the extra point and he made it. That gives the Panthers an early lead and will put Sanders on the comeback trail. Panthers 7, Browns 0.\nXavier Legette, Rayshawn Jenkins ejected after brawl\nThe Browns vs. Panthers game got chippy early, as Legette threw a few punches at Jenkins, who ripped the helmet off the second-year wide-out as part of the melee.\nLegette and Jenkins were called for offsetting unsportsmanlike conduct penalties and were ejected from the game.\nShedeur Sanders throws ball away after being pressured on fourth-and-1\nKevin Stefanski gave Sanders and the Browns offense a chance to prove itself on a fourth-and-1. The rookie quarterback once again found himself under pressure and tried to escape it by running backward. He couldn't shake the defense, falling back near midfield before uncorking a throw toward the right sideline that harmlessly felt incomplete.\nSanders is now 3-for-7 passing for 30 yards during his Browns debut. He also has 10 yards on one scramble.\nShedeur Sanders uses legs to pick up first down\nSanders was pressured on a third-and-9 but managed to escape. He found a lane to the right side of the field and ran for 10 yards before sliding down to keep the chains moving.\nThe scramble put the Browns at the back end of potential field-goal range.\nShedeur Sanders completes pass to Kaden Davis, can't convert third down\nSanders is officially on the board with his first completion. He found Davis for a 4-yard gain, but the receiver was tackled inches shy of the line to gain.\nAs a result, the Browns decided to punt, meaning Sanders' first drive will end in a 3-and-out.\nShedeur Sanders' first pass incomplete to Diontae Johnson\nSanders' first throw as a member of the Browns was intended for veteran receiver Diontae Johnson. The rookie quarterback targeted the former Pittsburgh Steelers star on a slant over the middle but couldn't connect. The throw was a little high and bounced off Johnson's hands.\nBrowns vs. Panthers start time\n- Date: Friday, August 8, 2025\n- Time: 7 p.m. ET\nThe Browns vs. Panthers game will kick off at 7 p.m. ET Friday. That will be NFL fans’ first chance to get an extended look at Shedeur Sanders, who is starting the game.\nBrowns vs. Panthers TV channel\n- Cable TV: NFL Network\n- Local TV: News 5 (Cleveland) | WJZY (Carolina)\n- Streaming: NFL+ | Fubo\nNFL Network will broadcast Shedeur Sanders’ Browns debut against the Panthers. Those in the Cleveland market will be able to catch the game on News 5 while those in the Carolina area will be able to catch the game on WJZY.\nThose choosing to live stream the game can turn to Fubo, which carries a free trial.\nWatch NFL Network with Fubo (free trial)\nWhat number is Shedeur Sanders?\nSanders is wearing the No. 12 jersey during his rookie season with the Browns.\nSanders wore the No. 2 jersey during his college days at Colorado. That number belonged to receiver-slash-return specialist DeAndre Carter when Sanders joined the Browns.\nSanders has not commented on the significance of the No. 12 jersey. It's worth noting his college teammate Travis Hunter wore the No. 12 at Colorado. Tom Brady, who has been a mentor to Sanders, also wore the No. 12 throughout his professional career with the Patriots and Buccaneers.\nShedeur Sanders draft pick\nSanders was selected in the fifth round of the 2025 NFL Draft with the 144th overall selection. He was the sixth quarterback selected and the first taken on the draft's third day.\nBrowns QB depth chart\nThe Browns have six quarterbacks currently on their 90-man roster. Below is a look at the pecking order among the group.\n- Joe Flacco\n- Kenny Pickett\n- Dillon Gabriel\n- Shedeur Sanders\n- Tyler Huntley\n- Deshaun Watson\nWatson isn’t expected to play in 2025 after suffering multiple Achilles tears in a three-month span last season. Flacco, Pickett and Gabriel will not play in the preseason opener, as the latter two deal with hamstring injuries while Flacco, 40, will simply not be active.\nShedeur Sanders passing yards\nSanders has completed 3-of-7 passes for 30 yards through one offensive drive against the Panthers.\nBrowns vs. Panthers odds, moneyline, over/under\nThe Panthers are favorites to defeat the Browns, according to the BetMGM NFL odds. Looking to wager? Check out the best mobile sports betting apps offering NFL betting promos in 2025 including the ESPN BET app and Fanatics Sportsbook promo code.\n- Spread: Panthers (-6.5)\n- Moneyline: Panthers (-300); Browns (+240)\n- Over/under: 32.5\nNot interested in this game? Our guide to NFL betting odds, picks and spreads has you covered.\nNew to sports betting? USA TODAY readers can claim exclusive promos and bonus codes with the best online sportsbooks and sports betting sites."
    }
  ],
  "argos_summary": "Shedeur Sanders, a fifth-round pick and son of Hall of Famer Deion Sanders, is set to make his NFL debut as the starting quarterback for the Cleveland Browns against the Carolina Panthers in their preseason opener. With other quarterbacks on the roster sidelined due to injuries, Sanders has a unique opportunity to showcase his skills and potentially secure a spot in the team's quarterback competition. Analysts express surprise at his draft position, suggesting that a combination of factors, including interview performance and team needs, contributed to his fall to the fifth round.",
  "argos_id": "5CJ2Y1ONM"
}