{
  "url": "https://www.dailykos.com/stories/2025/8/8/2336530/-ADAPTIVE-INDOMITABLE-UKRAINE-The-Coming-Decisive-Battle-For-Donetsk-A-Picture-Speaks-Volumes",
  "authorsByline": "",
  "articleId": "0c739f4e327546e796638805b66eba3a",
  "source": {
    "domain": "dailykos.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Alameda County",
      "city": "Oakland",
      "coordinates": {
        "lat": 37.8044557,
        "lon": -122.2713563
      }
    }
  },
  "imageUrl": "https://cdn.prod.dailykos.com/images/1463613/story_image/TheBoss-CorpsCommanders.jpg?1754209606",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T09:20:57+00:00",
  "addDate": "2025-08-08T09:34:56.638012+00:00",
  "refreshDate": "2025-08-08T09:34:56.638015+00:00",
  "score": 1.0,
  "title": "ADAPTIVE INDOMITABLE UKRAINE: The Coming Decisive Battle For Donetsk .. A Picture Speaks Volumes",
  "description": "They say a picture is worth a thousand words. And this one, in the above caption picture, is no different. The Commander in Chief of Ukrainian forces in a rapt Council of War with some of his key corps commanders of the Donbas region of Ukraine. I...",
  "content": "They say a picture is worth a thousand words. And this one, in the above caption picture, is no different. The Commander in Chief of Ukrainian forces in a rapt Council of War with some of his key corps commanders of the Donbas region of Ukraine.\n\nI became an avid follower of the Facebook page Головнокомандувач ЗС України / CinC AF of Ukraine since the beginning of the Russo-Ukrainian war. It was General Valerii Zaluzhnyi’s official page back then. His former second in command and successor, General Oleksandr Syrskyi has kept the site intact and regularly updated in addition to the old postings of General Zaluzhnyi … a veritable online compendium of the doings and musings of Ukrainian high command since the beginning of the war.\n\nOn the Facebook page one can see a plethora of pictures showing the current and previous Ukrainian CinCs meeting, greeting and awarding their commanders and troops at various locations on the battle fields, even in the trenches. Syrskyi more so than Zaluzhnyi appears to make more of these trips into the field. And he is also more inclined to favor the casual garb of the men in the trenches compared to the buttoned-down spit and polish usually favored by high command. A plain army green T-shirt over camo pants and combat boots are just fine. Occasionally, a shirt with his 4 stars discreetly pinned on or the crossed bulava(mace) insignia of Army HQ will do.\n\nBut this caption picture is also different even as it speaks volumes. Not only because of the no-nonsense deportment and intense concentration shown by the commanders present but the place which their boss alluded to as the location of the meeting … a cramped fortified bunker at the Donetsk front. This picture is again different because of who was in attendance. It is the first picture of its kind which shows several of the key commanders of the recently formed Ukrainian corps now tasked with stopping the vaunted 110,000 plus Russian force threatening the Ukrainian “Fortress Belt” in Donetsk oblast … all relatively young men in their 30s and 40s with the fate of their nation placed squarely in their hands. At a trim and energetic 60 years, the commander in chief is the grey elder in the room.\n\nAmong the principals in the picture are two famous commanders who like Robert “Magyar” Brovdi(now overall commander of Ukraine’s unmanned systems forces) joined the battle to save their country as civilians, in their case, the famed Azov Battalion(of the famed battle for Azovstal and Mariupol). Denys Prokopenko(in white T-shirt looking at his note book), was an English teacher and soccer player whose call sign(“Redis”) was his soccer nick name. Freed from Russian captivity and a Ukrainian national hero, he now commands the implacable 1st Corps Azov of the National Guard of Ukraine. Toretsk and Terny are still Ukraine because of “Redis” and his fighters squaring off with the Russians along the Kreminna front.\n\nIn black T-shirt pointing to the map on the table is Andriy Biletsky, a former political activist and the original founder of the Azov Battalion. Now commander of the 3rd Army Corps of Ukraine, Biletsky’s excellence and stellar performance in command has been widely praised including this recent report:\n\nThe Third Army Corps, under the command of Andriy Biletsky, was one of the first to be deployed, and on June 4, in an extremely critical situation, it took responsibility for a 120-kilometer strip on the Oskil River line. This was reported by Yuriy Butusov, editor-in-chief of Censor.net, a serviceman of the \"Khartia\" brigade, UNN reports. The advance of the Russian army in the strip was significantly slowed down: from January 1 to June 4, 2025, the enemy captured 198 sq km, and from June 4 until today – 16 sq km. As a result of successful counterattacks, the Third Corps regained control over 8 sq km of territories. According to Butusov, our average monthly irreversible losses decreased by approximately half compared to the \"pre-corps\" period, despite the fact that the intensity of hostilities increased in June. Andriy Biletsky proved that a competent commander of a combat-ready brigade, if given the authority to independently organize work and at least minimal trust and support from the leadership, can significantly improve the results of combat operations on a large section of the front within two months.\n\nOther principals in the picture are Viktor Nikolyuk, commander of the 9th Army Corps responsible for the defense of Pokrovsk. Yevhen Lasiychuk, commander of the 7th Rapid Response Corps in support of all forces in the Pokrovsky direction. Also in the picture is Serhihy Sirchenko, commander of the 11th Corps tasked with the defense of Chasiv Yar and the Siversky direction.\n\nAlso present but not in the caption picture were Maksym Kituhin, commander of the 20th Army Corps defending the Donetsk/Dnipropetrovks line, Volodymyr Silenko, commander of the 17th Army Corps holding the Zaporizhia front and Oleksandr Bakulin commander of the 19th Army Corps recently deployed to stand behind Toretsk and support the defense of Kostyantinivka.\n\nIn the wee hours of July 2nd, 1863 General George Meade, only 6 days into his appointment as overall commander of the American Union’s main field formation, the Army of the Potomac, called his commanders to a Council of War in the cramped little farm house of Lydia Leister at Gettysburg, Pennsylvania. As Union cavalry general John Buford predicted upon seeing the advance elements of the confederate army on July 1st … “they will come booming”. Indeed. The confederate forces launched a massive, coordinated assault on both Union flanks pushing them out of their defensive positions in that cross roads town onto the outlying southern hills. Fierce fighting raged at places like Little Round Top, Devil's Den, the Wheatfield, the Peach Orchard, and Culp's Hill. The Union forces eventually rallied after the day’s heavy losses and held their lines up in the hills.\n\nPresent at that long ago Council of War were several young corps commanders like Winfield Scott Hancock, Oliver Howard, John Gibbon and David Birney among others. Young men faced with what would prove to be the most decisive battle in the history of their then still very young country. The council was to decide on three key questions but most importantly whether … to retreat or to stay and fight it out? The consensus vote of that Council of War, as reported by another young general present, Daniel Butterfield:\n\nThe rest as they say is History … HaPpY History. May it be the same for the brave and courageous young corps commanders and the good people of ADAPTIVE INDOMITABLE UKRAINE.",
  "medium": "Article",
  "links": [
    "https://npsgnmp.wordpress.com/2015/11/21/such-then-is-the-decision-general-meade-and-the-july-2nd-council-of-war/",
    "https://censor.net/ru/resonance/3565576/boyiova-robota-3-go-arm-yiskogo-korpusu",
    "https://unn.ua/en/news/first-results-of-biletskyis-corps-competent-leadership-significantly-reduces-military-losses"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "several young corps commanders",
      "weight": 0.08317755
    },
    {
      "name": "overall commander",
      "weight": 0.08110758
    },
    {
      "name": "commander",
      "weight": 0.08086472
    },
    {
      "name": "1st Corps Azov",
      "weight": 0.06410092
    },
    {
      "name": "Ukrainian forces",
      "weight": 0.064069316
    },
    {
      "name": "Ukrainian high command",
      "weight": 0.06135652
    },
    {
      "name": "pictures",
      "weight": 0.055145137
    },
    {
      "name": "Young men",
      "weight": 0.053420592
    },
    {
      "name": "Army HQ",
      "weight": 0.051517557
    },
    {
      "name": "Ukrainian",
      "weight": 0.050266284
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.96142578125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.78662109375
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.58154296875
    },
    {
      "name": "/News/World News",
      "score": 0.5498046875
    },
    {
      "name": "/News/Other",
      "score": 0.387939453125
    }
  ],
  "sentiment": {
    "positive": 0.15270996,
    "negative": 0.39526367,
    "neutral": 0.45239258
  },
  "summary": "The article discusses the impending Decisive Battle For Donetsk in Ukraine, where Ukrainian forces are preparing for a decisive battle against a strong Russian force threatening the Ukrainian Fortress Belt in Donetsk. The author points out that a picture shows the Commander in Chief of Ukrainian forces, General Valerii Zaluzhnyi, with key corps commanders of the Donbas region of Ukraine. The article also includes a picture showing a Council of War with key commanders from the recently formed Ukrainian corps tasked with stopping the threat of a strong 110,000-plus Russian force. This picture is different as it includes notable commanders such as Robert “Magyar” Brovdi, the overall commander of Ukraine’s unmanned systems forces, and Andriy Biletsky, the founder of the Azov Battalion. Despite increased hostilities, the intensity of hostilities has increased despite this intensity of combat operations in the past two months. The advance of the Russian army in the strip strip was significantly slowed down from January 1 to June 4, 2025, and from June 4 until today, the advance of enemy forces captured 198 sq km, and the Fourth Army Corps regained control over 8 sq km.",
  "shortSummary": "A picture of Ukrainian commander Andriy Biletsky and key commanders discussing the upcoming conflict in Donetsk highlights the intense focus and strategic awareness of the conflict.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "802a0cf8254e4055b6883580b5b981ba",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://unn.ua/en/news/first-results-of-biletskyis-corps-competent-leadership-significantly-reduces-military-losses",
      "text": "First results of Biletskyi's corps: competent leadership significantly reduces military losses\nKyiv • UNN\nThe Third Army Corps, under the command of Andriy Biletskyi, took responsibility for a 120-kilometer strip on the Oskil River, significantly slowing down the advance of the Russian army. Thanks to new tactics and improved interaction, the corps regained control over 8 square kilometers of territory, and average monthly irreversible losses decreased by half.\nThe Third Army Corps, under the command of Andriy Biletsky, was one of the first to be deployed, and on June 4, in an extremely critical situation, it took responsibility for a 120-kilometer strip on the Oskil River line. This was reported by Yuriy Butusov, editor-in-chief of Censor.net, a serviceman of the \"Khartia\" brigade, UNN reports.\nThe advance of the Russian army in the strip was significantly slowed down: from January 1 to June 4, 2025, the enemy captured 198 sq km, and from June 4 until today – 16 sq km. As a result of successful counterattacks, the Third Corps regained control over 8 sq km of territories. According to Butusov, our average monthly irreversible losses decreased by approximately half compared to the \"pre-corps\" period, despite the fact that the intensity of hostilities increased in June.\nAndriy Biletsky proved that a competent commander of a combat-ready brigade, if given the authority to independently organize work and at least minimal trust and support from the leadership, can significantly improve the results of combat operations on a large section of the front within two months.\nHe pointed out the main positive changes: new defense tactics, stopped counter-battles and continuous counterattacks, the chaos at the front line disappeared, units are introduced into battle in an orderly manner. Biletsky received broad powers to promote command personnel, which eliminated lies in reports and significantly improved interaction. Each brigade of the corps began to receive planned replenishment of personnel and ammunition, which previously might not have been available for months.\nIt suddenly turned out that if the corps command competently organizes defense, controls the front line, creates a system for UAVs, artillery, and all types of intelligence, then there is no need to plug holes in the front with masses of troops and grind down battalion after battalion in battles for scorched positions. And Russian assault groups are simply methodically ground down, with losses 7-10 times less than the enemy."
    },
    {
      "url": "https://npsgnmp.wordpress.com/2015/11/21/such-then-is-the-decision-general-meade-and-the-july-2nd-council-of-war/",
      "text": "We’re honored today to feature Dr. Jennifer Murray, Assistant Professor of History at the University of Virginia’s College at Wise, as a special guest contributor. Dr. Murray served as an Interpretive Ranger at Gettysburg for many years, and was recently awarded the prestigious Bachelder-Coddington Award for her book, On a Great Battlefield: The Making, Management, and Memory of Gettysburg National Military Park, 1933–2012.\nNear 3:00 on the morning of June 28, 1863, Colonel James Hardie, a staff officer to General in Chief Henry Halleck, arrived to the tent of Major General George Gordon Meade. The Army of the Potomac had been maneuvering and marching north for weeks. As General Robert E. Lee’s Army of Northern Virginia penetrated into Maryland and Pennsylvania, a clash with the Confederate forces seemed imminent. Meade, commanding the 5th Corps of the Army of the Potomac, had positioned his men slightly south of Frederick, Maryland. Surprised at Hardie’s untimely arrival, Meade presumed he had been relieved of command. Instead, Hardie presented the general with an order from President Abraham Lincoln. Meade was to assume command of the Army of the Potomac, effective immediately.[1] Three days later, in the morning hours of July 1, Union troops clashed with Confederates along the Chambersburg Pike, west of a small town in Adams County, Pennsylvania. The battle of Gettysburg had begun.\nAs the day continued, additional Union and Confederate units joined fighting, which now engulfed areas west and north of town. By dusk, Union troops had retreated through Gettysburg, regrouping on key terrain south of town, namely Cemetery Hill. Additional units arrived to the field and Union soldiers began to establish a defensive position along Cemetery Ridge. Meade reached the battlefield around midnight. Determined to press the initiative, Lee ordered a series of attacks along the Union flanks the following day. On July 2nd, Confederates captured ground along the southern end of the battlefield, at Devil’s Den and the Peach Orchard, and held positions along Culp’s Hill, the right flank of the Union defensive line. Still, after two days of fighting, and a mounting casualty toll, estimated at 16,500 combined casualties, neither side could claim decisive victory.[2]\nThat evening, at 8 PM, Meade telegrammed Halleck, informing him of the day’s fighting and the army’s current strategic situation. In the telegram, the commanding general declared his intention to remain in his present position, but indicated that the nature of operations would depend on consultation from his subordinates. “I shall remain in my present position to-morrow,” he offered, “but am not prepared to say, until better advised of the condition of the army, whether my operations will be of an offensive or defensive character.”[3] Meade called for his subordinates to gather at his headquarters, convening the campaign’s first Council of War.\nDuring the Gettysburg Campaign, Meade called three Councils of War, on July 2nd, 4th, and 12th. In modern military parlance, Meade utilized the Councils of War to understand his operational environment, defined as the conditions, circumstances, and influences that impact a commander’s decisions. By calling a meeting of his subordinates, Meade sought to gain a clearer picture of the physical environment, the nature of the area of operations, and the information environment, intelligence on the enemy and of his own army. The council, convening shortly after the day’s fighting had ended, proved critical for gathering and disseminating information. As Meade’s telegram indicated, the commanding general used the council to meet with his subordinate officers and to evaluate his operational environment and engage in strategic, conceptual planning. Fundamentally all operational planning is based on imperfect, incomplete knowledge. Military leaders identify problems and evaluate potential approaches. Councils of War, the gathering of subordinates to frame problems and develop approaches, functioned to provide a clearer, informed forecast to the nature of the operations.[4] Once the generals had defined an operational approach, Meade allowed his subordinates to vote on the army’s subsequent operations. In seeking consensus from his generals and then allowing them to vote on the ensuing course of action, Meade demonstrated a collaborative decision making process.\nNear 9 o’clock on the evening of July 2nd, eleven generals joined Meade at his headquarters, the Lydia Leister farmhouse. The small room, totaling no more than “ten or twelve feet square,” held a bed, table, and two chairs. Present at the meeting included Meade’s Chief of Staff, Major General Daniel Butterfield and the army’s engineer, Major General Gouverneur K. Warren. Major Generals Winfield Scott Hancock and Henry Slocum represented the army’s “wing commanders.” Additionally, each corps had a representative at the council. Major General John Newton represented the 1st Corps; Brigadier General John Gibbon the 2nd Corps and Major General David Birney the 3rd Corps. The army’s 5th, 6th, 11th, and 12th Corps were represented by Major General George Sykes, Major General John Sedgwick, Major General Oliver Otis Howard, and Brigadier General Alpheus Williams respectively.[5]\nAt first the discussion was “very informal” and conversational.[6] Engaged in two days of heavy fighting and calculating diminishing supplies, the generals evaluated their operational environment. Corps commanders speculated on their capabilities; Butterfield recorded the effective strength of the Army of the Potomac at 58,000. Warren, suffering from a shrapnel wound to the neck, slept through the bulk of the council. Meade reportedly contributed little to the conversation, but listened incisively. After several hours of conversation, Butterfield formulated three questions.[7] These questions guided the conceptual planning and framed the Army of the Potomac’s operational environment.\nButterfield’s first question considered the feasibility of the Army of the Potomac remaining in Gettysburg. “Under existing circumstances,” he queried, “is it advisable for this army to remain in its present position, or to retire to another, nearer its base of supplies?” The second question posed, “It being determined to remain in present position, shall the army attack or await the attack of the enemy?” And, finally, if retaining the defensive, the generals debated how long they could hold their current position.[8] Meade then exhibited deferential leadership, allowing the generals to vote on each of the questions. The council proceeded with the most junior officer, Gibbon, voting first. Gibbon favored retaining the army’s existing position, with a slight modification, believing the army was “in no condition to attack.” Other generals echoed this sentiment. Slocum, commanding the 12th Corps, declared, “stay and fight it out.” When the results of the council unanimously favored staying and fighting, Meade succinctly declared, “Such then is the decision.”[9]\nBy gathering his subordinates, Meade now had a clearer, defined understanding of the status of his army; in putting the questions to a vote, Meade found his subordinates in agreement with himself. With a consensus obtained, the Army of the Potomac prepared for the third, and ultimately final, day of battle. Optimistic about the condition of his army, Meade penned his wife the following morning, “All well and going on well with the Army,” declaring that “Army in fine spirits and every one determined to do or die.”[10] On July 3rd, Meade’s army proved resilient, repulsing the Confederate army along Culp’s Hill and steadfastly holding their position along Cemetery Ridge in the battle’s climatic assault of Pickett’s Charge. Union troops held their position through the following day, Independence Day, anticipating a Confederate assault that did not come. Battered and defeated, Lee’s Army of Northern Virginia began its retreat. Federal victory came at a high cost, however. The Union army suffered approximately 23,000 casualties.[11]\nIn the weeks and months following the campaign, Meade’s leadership at Gettysburg became a topic of frequent and vociferous criticism. In the spring of 1864, the Joint Committee on the Conduct of War (JCCW) investigated the Gettysburg Campaign and specifically Meade’s leadership. Meade testified before the Congressional committee on two occasions, March 5th and the 11th. Congress leveled several accusations against the commanding general, including the allegation that he did not want to fight at Gettysburg. Meade’s critics used the July 2nd Council of War as evidence that the commanding general did not want to fight at Gettysburg, but infact wanted to retreat. To be sure, minimal evidence suggests that Meade favored withdrawing from Gettysburg. Such allegations stem from several of Meade’s critics. Appearing before the Joint Committee on the Conduct of the War, Butterfield and Birney both testified that Meade wished to retreat. A March 12, 1864 article published in the New York Herald, leveled damning allegations against Meade’s leadership and his supposed reluctance to fighting at Gettysburg. Signed “Historicus,” it is popularly believed that Daniel Sickles, Meade’s most noted and vocal critic, wrote this article.[12]\nMeade worked feverishly to address these criticisms and to dispute accusations of dilatory leadership. In testifying to Congress on the July 2nd Council of War and his supposed desire to retreat, the general declared, “The opinion of the council was unanimous, which agreed fully with my own views.”[13] Too, Meade defended his use of Councils of War, stating, “they were probably more numerous and more constant in my case, from the fact that I had just assumed command of the army, and felt that it was due to myself to have the opinions of high officers before I took action on matters which involved such momentous issues.”[14]\nOn February 1, 1865, Congress ended its inquiry of the Battle of Gettysburg and Meade’s leadership. The Congressional investigation failed to yield decisive results and amounted to little more than political grandstanding. Meade remained in command of the Army of the Potomac through the duration of the war. Confederate surrender and Union victory, however, did not quell disputes over Meade’s leadership at Gettysburg. Union veterans writing postwar accounts continued to perpetuate the claim that Meade did not want to fight at Gettysburg. In writing his memoir, Gettysburg and Chancellorsville, published in 1882, Abner Doubleday portrays Meade as a commanding general reluctant to fight at Gettysburg. Regarding the Council of War on July 2nd, Doubleday notes that Meade “was displeased” with his subordinates’ unanimous decision to stay and fight, but “acquiesced in the decision.” While not even present at the evening’s council, Doubleday quoted Meade as stating, “Have it your way, gentlemen, but Gettysburg is no place to fight a battle in.” Leaving no doubt to his readers, Doubleday adds, “there is no question in my mind that, at the council referred to, General Meade did desire to retreat.”[15]\nIn 1879, James Edward Kelly, a New York City native and illustrator, met with a series of Union generals. He questioned them about the war and sketched their portraits and other images. Kelly’s sketch, “Council of War at Gettysburg,” offers a visual interpretation of the July 2nd meeting at the Leister House. Kelly depicts fourteen generals at the council. Two of the generals in the sketch, Alfred Pleasonton, commander of the cavalry corps, who is depicted leaning in the doorframe, and Rufus Ingalls, chief quartermaster, sitting on the chair with his back toward the viewer, were not present at the council.[16]\nWith the generous assistance of the staff at Gettysburg National Military Park, nearly 150 years after the July 2nd Council of War, a group of Gettysburg enthusiasts gathered in the Leister House in an effort to recapture the scene of the Union high command. Gathering fourteen people into the small room proved a logistical challenge in its own right. As the “generals” took their place, individuals quibbled over the posture, posing, and positioning of their commander. While our photographer, Will Dupuis, captured the scene, individually and collectively we reflected on the momentous events that occurred in that exact space in 1863. The damp March air contrasted starkly with the humid, sultry July evening. James Hessler, representing Daniel Butterfield, remarked on the practical difficulties in communicating with so many subordinates. This command structure was soon simplified; following the Gettysburg Campaign the Army of the Potomac was reorganized. As it had 152 years earlier, conversation and debate swirled around Meade’s leadership. Some applauded Meade’s initiative to gather his subordinates and exchange information in a controlled environment, something that General Lee chose not to do.\nIn putting Meade’s leadership to a vote, our “council” found the general’s conduct at Gettysburg capable, if not admirable. Others, however, have not been so kind. In the latest study of the Gettysburg Campaign, historian Allen Guelzo offers a critical interpretation of Meade’s generalship. Relative to the Council of War on July 2nd, Guelzo promotes the theory that Meade did not want to fight at Gettysburg, but the unanimous decision of his subordinates to say and fight “stripped away” Meade’s excuse to withdraw. Through the duration of the war, and ultimately his life, Meade shouldered the criticism of his conduct at Gettysburg. Writing to his wife shortly after Christmas 1863, he quipped of the accusations aimed toward his leadership, “before long it will be clearly proved that my presence on the field was rather an injury than otherwise.”[17]\nDr. Jennifer Murray\nAssistant Professor of History\nThe University of Virginia’s College at Wise\n[1] George Gordon Meade to Margaretta Meade, June 29, 1863, The Life and Letters of George Gordon Meade, II, edited by George Gordon Meade (New York: Charles Scribner’s Sons, 1913), 11-12 [all notes hereinafter cited as L&L, II with corresponding page].\n[2] Edwin B. Coddington, The Gettysburg Campaign: A Study in Command (New York: Simon & Schuster, 1968), 442.\n[3] United States War Department, The War of the Rebellion: A Compilation of the Official Records of the Union and Confederate Armies, 70 vols., in 128 parts (Washington, D.C.: Government Printing Office, 1880-1901) vol. 27, part I, 72 [all notes hereinafter from the Gettysburg volumes cited as OR with corresponding volume and page number].\n[4] “Planner’s Handbook for Operational Design,” Version 1.0, Joint Staff, J-7, Joint and Coalition Warfighting, October 7, 2011, IV-1.\n[5] John Gibbon, Personal Recollections of the Civil War (New York: Putnam’s Sons, 1928), 140.\n[6] Gibbon, Personal Recollections of the Civil War, 140.\n[7] Minutes of the Council, July 2, 1863, OR, I, 74; Gibbon, Personal Recollections of the Civil War, 140.\n[8] “Minutes of the Council, July 2, 1863,” OR, I, 73.\n[9] Gibbon, Personal Recollections of the Civil War, 142.\n[10] George Gordon Meade to Margaretta Meade, July 3, 1863, L&L, II, 103.\n[11] Coddington, The Gettysburg Campaign, 541.\n[12] Historicus, “The Battle of Gettysburg,” New York Herald, March 12, 1864. Available in OR, I, 128-136.\n[13] Meade, March 11, 1864, 126-127.\n[14] George Meade Testimony, Union Generals Speak: The Meade Hearings on the Battle of Gettysburg, edited by Bill Hyde (Baton Rouge: Louisiana State University Press, 2003), 128.\n[15] Abner Doubleday, Chancellorsville and Gettysburg (New York: Scribner’s, 1882), 184-185.\n[16] Generals in Bronze: Interviewing the Commanders of the Civil War, edited by William B. Styple (Kearny, N.J.: Belle Grove Publishing 2005).\n[17] Allen C. Guelzo, Gettysburg: The Last Invasion (New York: Vintage Civil War Library, 2013), 352-356; George Gordon Meade to Margaretta Meade, December 28, 1863, L&L, II, 163-164.\nWhat a great Historical snippet …Discovering that 150 plus years ago there were Congressional investigations into the conduct of the War and with Political ramifications. Run parallel to today’s political spectrum.. Nothing has changed, only we live in cyber society where news is flashed to the general public in mere seconds.\nDuring the Revolutionary War Gen George Washington called many Councils Of War and never was pick apart for it. Meade gets criticized way to much for his councils of war. Meade was a brilliant general , the problem was all the incompetent generals under him. Sickels, Butterfield, two self indulging ninnies, just to name a few\nOther than Chris Gwynn (and Dr. Murray), I recognize none of the other “Gettysburg enthusiasts in the recreated scene at Mrs. Leister’s. Can you please identify these individuals and the Council attendees they depict?"
    }
  ],
  "argos_summary": "The article discusses a significant meeting of Ukrainian military commanders, led by General Oleksandr Syrskyi, in a bunker at the Donetsk front, highlighting the leadership of younger commanders in the ongoing conflict against Russian forces. It emphasizes the effectiveness of the Third Army Corps, commanded by Andriy Biletsky, in slowing Russian advances and regaining territory through improved tactics and leadership. The piece draws parallels between this modern military council and historical councils of war, particularly referencing General George Meade's Council of War during the Battle of Gettysburg, illustrating the importance of strategic decision-making in critical moments of conflict.",
  "argos_id": "64ZMK0108"
}