{
  "url": "https://www.nytimes.com/athletic/6543139/2025/08/08/kyle-karros-rockies-no-3-prospect-set-to-make-his-mlb-debut/",
  "authorsByline": "Melissa Lockard and Keith Law",
  "articleId": "55f9e314db5f43a9a22dafe97aaf23b2",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/08174725/GettyImages-2202170697-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T22:02:26+00:00",
  "addDate": "2025-08-08T22:10:52.170807+00:00",
  "refreshDate": "2025-08-08T22:10:52.170808+00:00",
  "score": 1.0,
  "title": "Kyle Karros, Rockies’ No. 3 prospect, set to make his MLB debut",
  "description": "The son of former big leaguer Eric Karros is \"exactly the kind of guy the Rockies need,\" a high-contact hitter who fields his position well.",
  "content": "Kyle Karros, a leading candidate to be the Colorado Rockies’ everyday third baseman next season, has been promoted to the big leagues for his major-league debut. The son of former MLB first baseman Eric Karros, Kyle was the Rockies’ No. 3 prospect coming into the season.\n\nKarros, 23, has risen quickly through the Rockies’ minor-league system since going in the fifth round in the 2023 MLB Draft out of UCLA. Last season, Karros hit .311/.390/.485 in 123 games for High-A Spokane in the pitcher-friendly Northwest League. Despite missing time due to injury this season, he’s made quick work of the upper-levels of the Rockies’ system, hitting .294/.399/.462 in 55 games for Double-A Hartford and .306/.368/.500 in 16 games for Triple-A Albuquerque. In 234 career minor-league games, Karros is a .304 hitter with a .393 OBP. He’s also built a reputation as a strong defensive third baseman.\n\n“Maybe not the power you expect from third baseman, but Karros is a really solid hitter with a very advanced approach and an advanced defender who makes a ton of contact,” according to The Athletic’s Keith Law, who had Karros on his list of players who just missed Law’s preseason top-100 prospect list. “He is exactly the kind of guy the Rockies need.”\n\nIn his preseason scouting report, Law noted that Karros made a significant adjustment after turning pro.\n\n“Part of the change is that he started driving the ball the other way more often, going with the pitch rather than trying to pull pitches on the outer half or third,” Law wrote. “He also became more aggressive as a hitter, swinging more often, trading more whiffs for more extra-base hits.”\n\nKarros comes from a baseball family. His father played 14 seasons in the big leagues for the Los Angeles Dodgers, Chicago Cubs and Oakland A’s. His older brother, Jared, is a pitching prospect in the Dodgers’ chain who is currently at the Double-A level.\n\nThe addition of Karros to the roster was part of a slew of moves for the Rockies on Friday. They also selected the contract of right-hander Aaron Schunk, placed infielder Orlando Arcia on the 10-day injured list with right elbow inflammation and moved infielder Thairo Estrada to the 60-day IL and right-hander Angel Chivilli to the restricted list.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6087196/2025/01/29/mlb-prospects-top-100-just-missed-2025/",
    "https://www.nytimes.com/athletic/6121777/2025/02/10/rockies-2025-top-20-prospects-keith-law/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Kyle Karros",
      "weight": 0.09860918
    },
    {
      "name": "former MLB first baseman Eric Karros",
      "weight": 0.09842925
    },
    {
      "name": "Eric Karros",
      "weight": 0.09571615
    },
    {
      "name": "Karros",
      "weight": 0.09507001
    },
    {
      "name": "third baseman",
      "weight": 0.08500157
    },
    {
      "name": "Rockies",
      "weight": 0.08104425
    },
    {
      "name": "Keith Law",
      "weight": 0.06911633
    },
    {
      "name": "right elbow inflammation",
      "weight": 0.06835378
    },
    {
      "name": "Triple-A Albuquerque",
      "weight": 0.06808492
    },
    {
      "name": "Last season",
      "weight": 0.06800594
    }
  ],
  "topics": [
    {
      "name": "Baseball"
    },
    {
      "name": "MLB"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9873046875
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.9404296875
    }
  ],
  "sentiment": {
    "positive": 0.31323242,
    "negative": 0.19091797,
    "neutral": 0.49560547
  },
  "summary": "Kyle Karros, the Colorado Rockies' No. 3 prospect, is set to make his MLB debut as a regular third baseman for the team. Karros has risen rapidly through the Rockies' minor-league system since his age of 21 and is expected to be their everyday third baseman next season. Despite missing time due to injury this season due to injuries, Karros hit.311/.390/.485 in 123 games for High-A Spokane in the pitcher-friendly Northwest League last season. He has also built a reputation as a strong defensive third baseman. The Athletic's Keith Law noted that Karros made a significant adjustment after turning pro and became more aggressive as a hitter, trading more whiffs for more extra-base hits.",
  "shortSummary": "The Colorado Rockies’s top prospect Kyle Karros, the 23-year-old third baseman, has been promoted to Major League Baseball for his debut, following a rapid rise through the minor-league system.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e1812c4b5b9947548e2cb8790f8ab8cc",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6121777/2025/02/10/rockies-2025-top-20-prospects-keith-law/",
      "text": "The Rockies had a tough year on the farm in 2024, with major injuries to top prospects that date back to their infamous Triple Tommy John Day in 2023, when they announced that three of their top pitching prospects had all blown out their UCLs. They also had a number of underperformers, highlighted by Charlie Condon, the No. 3 pick in the 2024 draft and the Golden Spikes winner who struck out at an alarming rate in his pro debut. There’s still a good bit of upside in the system, with a lot of athletes running around (pun intended). This column will read a little differently, as I’m going to talk in more depth about a couple of players I got wrong in this system, mostly guys I thought would be a lot better who have hit a wall or just not developed as I expected.\n(Note: Tools are graded on a 20-80 scouting scale; ages as of July 1, 2025.)\nAdvertisement\n1. Charlie Condon, OF/3B (No. 34 on the top 100)\nHeight: 6-6 | Weight: 216 | Bats: R | Throws: R | Age: 22\nCondon was the No. 1 player on my pre-draft rankings last year and went to Colorado with the third pick, but his post-draft performance couldn’t have differed more from what he did in the spring for Georgia. Condon won the Golden Spikes Award with a .433/.556/1.009 line for the Dawgs, hitting 37 homers in 60 games, setting the school’s career home run record and the NCAA’s single-season record since they switched to BBCOR bats. In 109 PA for High-A Spokane, however, Condon hit .180/.248/.270, struck out 34 times (31.1 percent), and walked just four times. Pitchers saw a 6-6 hitter with long levers in the box and went after him hard in with fastballs and soft away with sliders and changeups. Condon is an impressive athlete who made extremely hard contact as an amateur, ranking among the leaders in Division I with a 90th percentile exit velo of 111.8 mph, and he did adjust in the spring when pitchers went after him with breaking stuff, forcing them to come back to the fastballs on which he feasted.\nHe’s played third base and all over the outfield, playing passably at the hot corner and in center, but the broad consensus is that he’s going to end up in right given his frame and likely eventual size. He did have a lingering hand injury when he first signed that may have affected him at the plate, but that can’t explain away all of the struggles. Perhaps he was pressing; perhaps he just hadn’t seen breaking stuff of that quality before; perhaps it’s just a tiny sample. I don’t think his ceiling has changed at all — he’s a 30-homer bat with the kind of contact quality that leads to high BABIPs and averages, and he should be a plus defender in an outfield corner — but there’s more uncertainty here than there was on draft day.\n2. Chase Dollander, RHP (No. 75 on the top 100)\nHeight: 6-2 | Weight: 200 | Bats: R | Throws: R | Age: 23\nDollander’s 2024 season was sort of a consolidation year for him, as he got some of his slider back but doesn’t have it as a consistent plus pitch as it was back in 2022. As a sophomore at Tennessee, he had a wipeout slider, easily a grade 70, and may have been the best college pitcher in the country that spring, but that offseason he went to some sort of self-styled expert and switched to a sweeper that was ineffective — although it helped the Rockies get him at the ninth pick in the 2023 draft. His changeup has improved significantly in the last two years to be a solid-average pitch, with a little wiggle at the end to help but mostly deceiving hitters from how he throws it. The slider is the key; when it’s on, it’s 85-87 with hard tilt and a big move away from right-handers. It can end up more cutter-like at 89-90, still effective but with a different shape that makes it look more like the fastball, and could even be his best approach to lefties rather than the changeup. The Rockies have already helped him get part of the way back to his 2022 form, and if they can get that slider to be more consistent, it’ll be a real out-pitch, and the weapon he’ll need given his just average command and control. He has a fourth starter floor, but more upside as the slider develops or recovers.\n3. Kyle Karros, 3B (Just missed)\nHeight: 6-5 | Weight: 220 | Bats: R | Throws: R | Age: 22\nKarros, the son of longtime Dodger Eric Karros, was the Rockies’ fifth-round pick in 2023 out of UCLA, and spent all of his first full season in High A, hitting .311/.390/.485 and earning praise all around for his defense at third. That is a better triple-slash line than he ever had at college, even though he got to use the pretend bats for the Bruins and faced much worse competition.\nAdvertisement\nHis average, OBP, and slugging for Spokane in 2024 were all better than any single-season result he had at UCLA. Part of the change is that he started driving the ball the other way more often, going with the pitch rather than trying to pull pitches on the outer half or third. He also became more aggressive as a hitter, swinging more often, trading more whiffs for more extra-base hits; he hit eight doubles in 44 games as a college junior, then hit 33 doubles in 123 games last year in Spokane.\nHe led the Northwest League in all three triple-slash stats, and could have gone to Double-A Hartford by midsummer, although the Rockies wanted him to stick with Spokane as they pushed for the league title. He’s a plus defender at third with great instincts on both sides of the ball. His OBP does mask some of his pitch recognition issues — he doesn’t chase a ton, but when he does, he almost never connects, especially with offspeed stuff, and getting him to understand what pitches he can and can’t reach with his long arms is going to be his main developmental challenge. He could be an above-average regular if he does, given the defense and the potential for 40-50 doubles with double-digit homers.\n4. Adael Amador, 2B\nHeight: 6-0 | Weight: 200 | Bats: S | Throws: R | Age: 22\nAmador had a bizarre year in 2024, to put it mildly. He started out absolutely awful, hitting nothing and not hitting it anywhere, and then suddenly in late May he went on a home-run bender, hitting six in an eight-game stretch. The Rockies had an urgent need at second base, so they called him up, even though his season line was still just .194/.337/.329. Shockingly, he struggled in the majors, going 6-for-35 and hitting .171/.194/.200, and they sent him back to Double A where he hit far better the rest of the way, going .269/.359/.431 with eight more homers.\nHe’s a below-average second baseman now, as he’s gotten stronger, which he needed to do, but it’s slowing him down and his instincts at the position still aren’t good. He does understand the strike zone; he doesn’t swing and miss much, he takes a lot of 0-0 pitches, and he doesn’t chase until he gets to two strikes. It’s doubles power with the occasional homer on a mistake pitch, probably 10-12 a year in a neutral park in the majors. He’s a 45 runner at best, which has been trending down as he’s gotten thicker. He could improve his defense with more time and instruction and maybe end up an average defender at second who gets to a .350 OBP and enough doubles power to be a solid regular, maybe even a 55. The glovework has to improve, though.\n5. Yanquiel Fernandez, OF\nHeight: 6-2 | Weight: 198 | Bats: L | Throws: L | Age: 22\nFernandez was on the top 100 a year ago but had a mediocre performance in Double-A Hartford, the only fairly neutral park in the Rockies’ system and thus an important indicator of how much of a hitter’s performance is “real.” The Cuban-born outfielder has two plus tools, 60 raw power and at least a 70 arm, and depending on how you see it you might argue for an average hit tool because he does make a ton of contact, striking out just 19.1 percent of the time in Double A before a late-season bump to Triple-A Albuquerque, which might as well be the surface of the moon for how the ball flies there. Anyway, Fernandez’s swing decisions still leave a lot to be desired, so he doesn’t square the ball up nearly as often as he should. He hit .283/.339/.439 for Hartford, with a ridiculous number of pop-ups and weak flyballs. He should be better than this, but in the most honest test we’re likely to get of his hitting skills, he got a C or a C-. There’s no physical projection, either, so it’s all going to be skills development from here if he’s going to get back on track to be a regular.\nAdvertisement\n6. Robert Calaz, OF\nHeight: 6-2 | Weight: 202 | Bats: R | Throws: R | Age: 19\nCalaz is a five-tool player who led the Arizona Complex League in batting average, OBP, and slugging, as well as homers and something called RBI, I don’t really know what that stands for or why we would care about it. Anyway, he’s incredibly talented physically but his baseball acumen lags behind his tools, as he didn’t come into pro ball with much experience, which shows up on things like reads in center or running the bases. He’s a physical kid with broad shoulders and is going to end up really strong, while he’s already showing power the other way and will at least take some pitches. He did steal 15 bases in 16 attempts last year in 62 games between the complex and Low A, but he runs closer to average than plus, with a lot of effort to the way he does it, a sign he’ll probably end up just a 50 runner. He is in center now and should stay there as long as he’s able; the 30-homer upside is too good to pass up.\n7. Sean Sullivan, LHP\nHeight: 6-4 | Weight: 190 | Bats: R | Throws: L | Age: 22\nSullivan was the Rockies’ second-round pick in 2023 (No. 46 selection) out of Wake Forest, where he was the Saturday starter behind Rhett Lowder and pitched almost as well as the Reds’ first-round pick. Sullivan comes from a lower slot and throws an invisiball, often just 90-93 but from such a low angle and with so much carry that hitters miss it — and they’ll chase it right out of the zone to an unusual extent. He turns over a 55 changeup despite the lower slot, while his slider is fringy, getting some boost because of the angle at which he releases it so it sweeps down and away from lefties. He threw 83 1/3 innings for High-A Spokane and walked eight; he was horribly wild in Double A, though, as in 32 innings there he walked … seven. Unacceptable, really. Double-A hitters did make more contact on his secondary stuff, which is one thing to watch. Another is his flyball rate, 44 percent in High A and then 51 percent in Double A, just because, you know, (whispers) Coors Field. I really like him, though, because he succeeds without huge velocity or some pitch cooked up in a lab from Sudafed, iodine crystals, and the bones of former Rockies pitchers.\n8. Cole Carrigg, OF/SS\nHeight: 6-2 | Weight: 200 | Bats: S | Throws: R | Age: 22\nThe Rockies took Carrigg in compensation round B in 2023 out of San Diego State, where he’d split time between catching, playing three infield spots (all but first), and playing center. Colorado ended the catching part and they’ve had him primarily in center, with a little time at short last year to keep that on the table. He’s a plus runner with a hose for an arm and is athletic enough to play just about anywhere, with center field clearly his best position. He’s aggressive at the plate and even last year, when he was a little experienced to spend the entire year in High A, he showed some cracks in his pitch recognition, chasing more than he had in college and having difficulty picking up spin. He plays hard, almost too hard, and he ends up incurring a lot of fines as a result, so he’s certainly not everyone’s cup of tea. His positional versatility makes him a no-doubt big leaguer, barring injury; his chance to be a regular depends mostly on whether he can hit better quality pitching, which is in doubt right now.\n9. Brody Brecht, RHP\nHeight: 6-4 | Weight: 235 | Bats: R | Throws: R | Age: 22\nBrecht was Colorado’s second pick in the 2024 draft (the No. 38 pick), a great selection given how good his pure stuff is, even if he’s still raw as a pitcher. Brecht played baseball and football at Iowa, only giving up the sport with the concussions after his sophomore year so he could concentrate on pitching, but he’s still a work in progress on the mound. He runs it up to 99-100 as a starter, sitting 97ish with ease, and his slider is plus. Of course, there’s a “but” coming — he doesn’t repeat his arm action and as a result he has always had high walk totals, including 14.2 percent in his draft year for the Hawkeyes. He did improve down the stretch in that area; in five of his last six starts, he went seven-plus innings and walked only two or three per start, which is big progress. He also needs to develop a third pitch, trying a split-change near the end of the season. He’s like a high school pitcher in a giant, 22-year-old body, and you can dream on a No. 2 starter outcome, a high-leverage reliever, or — well, this isn’t a good dream — a guy who never makes it because he can’t stop walking batters.\n10. Jared Thomas, OF\nHeight: 6-2 | Weight: 190 | Bats: L | Throws: L | Age: 21\nThe Rockies’ second-round pick last July, Thomas had a breakout year as a draft-eligible sophomore at Texas after he lowered his hands — just as Condon did — and started making much more solid contact, hitting .349/.435/.635 for the Longhorns with 18 steals in 18 attempts. He had a solid debut in Low A before a quad injury ended his season after just eight games. He’s an above-average or better runner with 55 power, more of a hard line-drive guy than a big power guy, although in Coors he could be a 20/20 player with good defense in center. His one weakness in college was a tendency to chase pitches outside of the zone, and if he cuts that down to a manageable level, he’s a future regular with a 55 ceiling.\n11. Drew Romo, C\nHeight: 6-1 | Weight: 205 | Bats: R | Throws: R | Age: 23\nRomo can still really catch and has a plus arm, but he’s had some real throwing issues the last two years, so whether he can help at the position is at least a question mark until that’s resolved. His value is mostly in his defense; he has 40 in-game power, so while he makes a lot of contact, it’s not going to amount to much beyond perhaps an adequate batting average. The safe bet here is that he’s a backup, although it’s possible he can get over the erratic throwing and make so much contact, even if it’s light, to be a soft regular.\n12. Sterlin Thompson, LF/1B\nHeight: 6-3 | Weight: 200 | Bats: L | Throws: R | Age: 23\nThompson was on my top 100 a year ago, and when I saw him last spring he looked just the same — a very advanced hitter with a great swing and a chance to get to above-average power. He might have had the most disappointing year, to me, of any prospect, as he hit .245/.319/.385 and looked worse than that; I saw him in June, waving at 90 mph in the zone like he never saw it. He was such a natural hitter before last year that I know I at least overrated his feel to hit, as in Double A he didn’t seem to have much of an approach or a plan for his at-bats. He still doesn’t expand the zone much, but when he did last year, he whiffed at an extraordinary rate, nearly 80 percent on non-fastballs out of the zone. He’s going to have to play a corner somewhere, so he has to hit. He did hit everywhere until he reached Double A, if you’re looking to hang on to something, but with over 650 PA at that level he’s overdue for a major adjustment.\n13. Zac Veen, OF\nHeight: 6-2 | Weight: 190 | Bats: L | Throws: R | Age: 23\nI was just wrong on Veen, ranking him as a top-10 prospect in the 2020 draft and putting him as high as No. 23 on my top 100, one of three times he appeared on the list. I thought he’d be a power-hitting outfielder with 55 speed and 55 or better defense, maybe even sticking in center. The power isn’t there, and at this point I’m not sure it’s coming. He topped out at 105.6 mph in Triple A last year, commensurate with his exit velocities at lower levels — he just doesn’t have that kind of juice, and unfortunately he doesn’t have another plus tool or skill to make up for it. His best skill is his baserunning; he’s a 55 runner but really aggressive, with high success rates since he reached High A. He’s at least average on defense and could be a 55 too. With moderately high chase rates, though, he’s not going to post league-average OBPs, and he doesn’t have the power to play every day in right. I haven’t even mentioned how often he’s been hurt, playing 111 games total the last two years. He’s an extra outfielder, valuable as a pinch runner, a pinch hitter who actually has always hit lefties fine, capable of defending in either corner — I’d like to see him get some reps in center this year, just to boost his value. I thought he’d be a star, though, so I was way off.\nAdvertisement\n14. Michael Prosecky, LHP\nHeight: 6-3 | Weight: 200 | Bats: L | Throws: L | Age: 24\nProsecky was my sleeper for the Rockies last year, but after he went to an outside lab to try to boost his velocity, he came down with elbow inflammation and never got on track, throwing 63 innings total between the regular season and Arizona Fall League, with terrible results in the fall and in High A. Even when he did pitch, he was 90-94, down from 92-95 the year earlier; he barely used his slider; and his command was way off. When healthy, he’s got a four-pitch mix, with the slider his best offering and a changeup that could flash plus but didn’t sit there. There’s deception in his delivery to help the fastball play up as well, as long as he’s locating it. Let’s hope a full offseason of rest gets him back to his 2023 form, when he looked like he might be a mid-rotation starter.\n15. Seth Halvorsen, RHP\nHeight: 6-2 | Weight: 225 | Bats: R | Throws: R | Age: 24\nHalvorsen reached the majors as a reliever last year and that appears to be his permanent role, although I thought when I saw him last spring that he had the stuff and delivery to try to start. He sits 99-100 with some arm-side run, with what might be a plus splitter and a pretty good slider. Colorado drafted him in the seventh round in 2023 out of Tennessee and he ripped through the minors in 13 months, striking out 28.6 percent of the batters he faced between Double A and Triple A last year with an 11.7 percent walk rate. He’s still developing his command and his feel for the secondaries, so he might be just a decent middle reliever now, with the upside of a high-leverage reliever in a year or two.\n16. Ryan Ritter, SS\nHeight: 6-1 | Weight: 200 | Bats: R | Throws: R | Age: 24\nRitter’s a quality big-league utility infielder, a smart and instinctive player whose only above-average tools are on defense and no projection from here. He hit .270/.370/.403 last year as a 23-year-old in Double A, with the OBP inflated by 16 HBP; his walk rate was just 9.4 percent. He’s got 45 power, maybe, and a 50 hit tool, enough to make contact at a high enough rate to stick on a major-league bench. He’s a 55 defender at short, again more on instincts and reads than athleticism, with plenty of arm to handle short and third.\n17. Carson Palmquist, LHP\nHeight: 6-3 | Weight: 185 | Bats: L | Throws: L | Age: 24\nThe Rockies have continued to start Palmquist up through Triple A, although he’s a sidearming lefty who already gives up more power to right-handed batters, something that isn’t going to get better in Denver. He’s 90-93 with a sweepy slider, a slower breaking ball that Statcast calls a sweeper but that looks like a curveball, and an occasional changeup. Until he reached Triple-A Albuquerque, his walk rates were at or just under 10 percent, and I’m not dinging any pitcher who struggles in that environment. It’s just such a reliever look that I can’t see him facing right-handed batters two or three times in a game as a starter.\n18. Jack Mahoney, RHP\nHeight: 6-3 | Weight: 205 | Bats: R | Throws: R | Age: 23\nMahoney went from pitching in the SEC in 2023 to Low A in 2024, a step back in the competition he’d face; he didn’t dominate there and then got hit around in six outings in High A at the end of the year, with a 5.33 ERA and a .517 SLG allowed. He’s 92-94 on the sinker with a 55 changeup and average slider, mixing in a cutter and curveball as well, giving up too much hard contact on the fastball because he throws it in the upper half of the zone too much. He should have had better results in High A with his present stuff, and could still end up a fourth or fifth starter if he improves his plan of attack even just with the pitches he currently has.\n19. Cole Messina, C\nHeight: 6-0 | Weight: 230 | Bats: R | Throws: R | Age: 22\nColorado’s third-round pick in 2024 has plus power and a big body already, so catching is going to require some body maintenance going forward. I don’t love the setup at the plate, as his hands are high and his bat is behind his body, so his path to the ball is longer and uses up too much time; he could benefit from dropping his hands the way Condon and Thomas did in their draft years. His defense behind the plate is already fringy, and if he gets any bigger he’ll have to move to first.\n20. Jace Kaminska, RHP\nHeight: 6-2 | Weight: 235 | Bats: R | Throws: R | Age: 23\nKaminska was the organization’s minor-league pitcher of the year, laying waste to Low A hitters as a college product who’d pitched at Wichita State and Nebraska, so he was really advanced for the level. It’s all fastball/curveball and he had a huge platoon split, allowing a .152/.178/.192 line to righties and a .308/.347/.481 line to lefties. He walked just 12 batters all year in 87 1/3 innings, barely over 3 percent of batters faced, so there’s some foundation here for a middle/long reliever, but to start he’s going to need a third pitch.\nOthers of note\nGabriel Hughes, Jackson Cox, and Jordy Vargas all had Tommy John around the same time — it was announced on the same day — in 2023, with Hughes the only one to return so far. He pitched in the AFL but it wasn’t great, as his command was way off and he gave up too many walks and hard contact. He’s fastball/slider and pitches with such energy that it might be a better fit for him to move to the bullpen if the command doesn’t improve with another offseason of rest. Cox and Vargas should both be back in games this spring. … Shortstop Ashly Andujar signed for a $1.7 million bonus last January for his potential as a switch-hitter with plus defense at a tough position. He hit .291/.376/.352 in the DSL with just a 14 percent strikeout rate, with solid swings that generate line drives and should eventually lead to doubles power. He could move quickly to Low A if this plate discipline is real. … Outfielder Benny Montgomery had shoulder surgery early in 2024 that took him out for the remainder of the season, although he did return in time to play for Ponce in the Puerto Rican Winter League. He’s still really athletic and has some raw power, but the hitch in his swing isn’t going away any time soon and I’m not sure he’s going to hit until it does. … Right-hander Bradley Blalock came from the Brewers in the Nick Mears trade, a fastball/slider/splitter guy with nothing plus and just fringy command; he’s a good depth starter option but probably not someone you want taking 20-25 turns. … Right-hander Yujanyer Herrera came over with Blalock in the Mears trade, showing some promise as a sinker/slider guy with a starter’s build, but had Tommy John after the season and won’t pitch again until 2026. … Right-hander McCade Brown returned last May after missing all of 2023 while recovering from Tommy John surgery, then missed about two months in the summer before coming back for the last few weeks of the regular season and to pitch in the AFL. He was 94-96 with a 55 curveball and a promising cutter in short bursts. … Right-hander Zach Agnos was a shortstop/closer at East Carolina and is now exclusively a reliever, working with a plus cutter that has late breaking action. He struck out 31 percent of hitters between High A and Double A last year, and more importantly, he only walked 5 percent. … Lefty reliever Luis Peralta is a fastball/curveball guy who had a reverse platoon split in the minors and majors last year, but typically is much better against left-handed batters and should have a career as the modern equivalent of the lefty specialist. … Right-hander Jaden Hill reached the majors last year, sitting 96-98 with a plus changeup and a sweeper that showed some promise as a third pitch. He’s never stayed healthy in any role, but relief gets him to the majors right now and maybe the limited workload will give him a chance to avoid the IL. How was he the first-ever big leaguer named Jaden? He won’t be the last, if my kids’ classmates are any indication. There’ll be Jadens and Jaydens and Jaydyns coming out of our ears soon enough.\nAdvertisement\n2025 impact\nHalvorsen, Peralta, and Hill should spend most of the year in the big-league bullpen, and Palmquist could join them at any point. Amador might get another shot at second base, as he’s not really blocked by anyone in the majors. Blalock is probably the sixth starter right now, depending on others’ health.\nThe fallen\nCuban shortstop Dyan Jorge took home a $2.8 million bonus when the Rockies signed him in 2022, but after some early promise he’s stalled out, with no power at all and defense that came in a little below what was advertised. He hit .267/.336/.319 in High A last year at age 21 with the highest strikeout rate of his career, 22.6 percent. He can run, and maybe ends up a utility infielder because he can play short.\nSleeper\nCalaz was sort of a consideration for the top 100 based on the data, only dropping down when the scouting reports came in. If he shows more feel for the game this year and holds much of the performance, he’ll be on the list next winter.\nAdditional top prospect coverage\nGO DEEPER\nTop 100 MLB prospects 2025: Keith Law’s rankings, with Roman Anthony at No. 1\nGO DEEPER\nMLB prospects who just missed Keith Law’s top 100 ranking: Caissie, Saggese and more\nGO DEEPER\nMLB 2025 farm system rankings: Keith Law ranks all 30 teams, Mariners are new No. 1\n(Top photo of Condon: Stew Milne / Associated Press)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6087196/2025/01/29/mlb-prospects-top-100-just-missed-2025/",
      "text": "Every year that I produce a top 100 MLB prospect ranking, I go through an iterative process where I start with more than 100 players, circulate the first cut to industry sources, move some guys around, take some names off the list and add other ones, circulate again, and so on. That process means there are always players who just missed the list — the decision to stop at 100 is rather arbitrary, a function of us having 10 fingers and a base-10 number system.\nThis year I’ve written up a few more of those players, all of whom are very good prospects who shouldn’t be overlooked just because they missed the main list. I write these comments in a way that I hope describes their abilities while also making it clear why I omitted them from the top 100.\nGO DEEPER\nTop 100 MLB prospects 2025: Keith Law’s rankings, with Roman Anthony at No. 1\nI always say no one ever reads the intro, but here it is anyway: These players are listed in alphabetical order. This isn’t a further ranking, although someone will inevitably claim that it is. The last cut from the top 100, if you’re interested, was Jansel Luis.\n(Ages as of July 1, 2025; tools rated on a 20-80 scouting scale)\nSean Burke, RHP, Chicago White Sox\nHeight: 6-6 | Weight: 230 | Bats: R | Throws: R | Age: 25\nYou’d be forgiven for wondering if I made Sean Burke up, as he’s thrown 252 total innings since he was drafted in July 2021 and spent time on the 60-day injured list in both 2023 and 2024. He did make his major-league debut in September, however, and despite all of his arm woes, the stuff was electric: He sat 94-96 with life up on the four-seamer, topping out at 99, and showed a plus curveball that could be a 70 with a ton of two-plane break. He also throws a mid-80s cutter/slider hybrid — Statcast calls it a slider, it looks more like a cutter, but that’s probably just semantics — and a changeup that’s a clear fourth pitch and that he will have to improve, as he already showed a modest platoon split in the minors last year.\nAdvertisement\nHis delivery is good enough for him to have at least average control, and he gets excellent extension over his front side. If he stays off the injured list, and just improves the changeup a little bit through repetitions, he’s a potential No. 3 starter. I worry that it’s either that or nothing, given his checkered health history.\nOwen Caissie, OF, Chicago Cubs\nHeight: 6-3 | Weight: 190 | Bats: L | Throws: R | Age: 22\nCaissie was a horrendous outfielder and fringy runner when he first signed with the Padres in 2020, but since his trade to the Cubs, he’s improved substantially to become a plus runner (although he still looks awkward doing it) and at least an average defender in a corner. He also hits the ball extremely hard, reaching 115 mph twice last year, with an EV50 of 101.9 mph — that is, he hits it hard when he hits it, as he still whiffs about a third of the time he swings.\nIn Triple A last year, he struck out in 27.6 percent of his PA against righties and 30.4 percent of his PA against lefties, both of which were improvements from 2023 in Double A. If those rates keep coming down, he could end up an above-average regular with his ability to make so much hard contact, which should translate into 25+ homers. If he can’t continue to make those adjustments, however, he’s going to end up an up-and-down player who can’t hold a major-league job.\nJonny Farmelo, OF, Seattle Mariners\nHeight: 6-2 | Weight: 205 | Bats: L | Throws: R | Age: 20\nFarmelo’s first full pro season was off to a great start — he hit .264/.398/.421 through 46 games in Low A — when he tore the ACL in his right knee while making a play in the outfield, ending his season in early June and possibly keeping him out for the start of the 2025 regular season. Before the injury, he was a 70 runner and plus defender in center with a strong eye at the plate and good feel for contact despite an arm bar that often leaves a hitter exposed on tough pitches inside.\nAdvertisement\nHe showed excellent command of the strike zone for his age, and had the usual challenges ahead like picking up better sliders and changeups. If his speed returns to full strength, he’s a top 50-60 prospect again, but there’s always uncertainty around an injury like this when the player depends on his speed for a hefty chunk of his value. He’s one of three Mariners in the next 25 names after the top 100, along with two of their 2024 draftees, switch-pitcher Jurrangelo Cijntje and right-hander Ryan Sloan.\nJackson Ferris, LHP, Los Angeles Dodgers\nHeight: 6-4 | Weight: 195 | Bats: L | Throws: L | Age: 21\nFerris came to Los Angeles along with top-100 prospect Zyhir Hope in the trade that sent Michael Busch to the Cubs, and it’s quite likely that the Dodgers will end up with two top-100 guys out of the deal before too much longer — if Ferris can get that long arm stroke under control enough to throw more and better strikes. He made 27 starts last year, 20 in High A and the last seven in Double A, and struck out 145 guys (27.5 percent) while walking 57 (10.8 percent). That latter figure was a big drop from 2023, when he walked 14 percent of batters, although it’s still on the high side and the command is still a half-grade behind his control.\nHe has a big four-seamer, sitting 94-96 and touching 99, with a plus slider that can be a real knee-buckler when he finishes it out front, a solid curveball he doesn’t use much, and a 45 changeup. His arm swing is very long and deep in the back, so he doesn’t get to a consistent release point out front, leading to erratic command and a lot of breaking balls that he casts a little too early. It’s very easy to look at Ferris and call him a reliever because of the delivery. That may be true in the end, but given his age and present stuff you have to give him a little more time to see if he can tighten up the arm action even slightly and prove he can’t develop the command to start.\nBrady House, 3B, Washington Nationals\nHeight: 6-4 | Weight: 208 | Bats: R | Throws: R | Age: 22\nI’ve been a Brady House believer since his pro debut, more or less, but his Triple-A debut last year was scary because it confirmed all of the concerns I’d had and heard about him before: in 236 PA at that level, he struck out 68 times and walked (Count von Count voice) one, two, three, four, five, six, seven times. That’s a walk rate under 3 percent, with a strikeout rate of almost 29 percent.\nHouse was young for the level at 21 and spent less than a full year in Double A — he only had 641 pro PA before 2024 — so there are reasons to dismiss or at least deprecate what he did in Triple A, but his propensity to chase pitches out of the zone was always there; he got away with it at lower levels because he’s so strong and his bat is so quick. House swung at fastballs out of the zone 50 percent of the time in Triple A, and his overall chase rate of 43 percent is just unsustainable. His exit velocities at the level were strong, but not elite, and he still played solid defense at third. He has to calm way the heck down at the plate to be the Nats’ third baseman of the future.\nAdvertisement\nXavier Isaac, 1B, Tampa Bay Rays\nHeight: 6-3 | Weight: 240 | Bats: L | Throws: L | Age: 21\nIsaac did lose about 15 pounds before the 2024 season and was marginally better in the field, although I’d still bet on the heavyset first baseman to end up at DH eventually. He still projects as a platoon player as he looks terrible against left-handed pitchers. Isaac does have plus power and is willing to take a walk, hitting .287/.381/.535 as a 20-year-old in High A last year before a late-summer promotion to Double A, where he hit .211/.346/.349, walking in 15.8 percent of his PA but striking out in 40.6 percent.\nHis time at the higher level was brief (31 games), but worrisome, as he got destroyed by better velocity and chased a ton of breaking stuff down-and-in or below the zone. He’s very upright from his setup through contact — or lack thereof — which may be hurting his ability to stay with pitches moving down. It’s not all bad news here, as Isaac was very young for Double A, still got on base, and killed right-handed pitching at High A before the promotion, so there’s a foundation for some kind of future big-league value. If he could play a position, or made more contact even against righties, I would be more bullish, but I see a platoon DH or at best a platoon first baseman.\nKyle Karros, 3B, Colorado Rockies\nHeight: 6-5 | Weight: 220 | Bats: R | Throws: R | Age: 22\nKarros, the son of longtime Dodger Eric Karros, was the Rockies’ fifth-round pick in 2023 out of UCLA, and spent all of his first full season in High A, hitting .311/.390/.485 and earning praise all around for his defense at third. That is a better triple-slash line than he ever had at college, even though he got to use the pretend bats for the Bruins and faced much worse competition.\nHis average, OBP, and slugging for Spokane in 2024 were all better than any single-season result he had at UCLA. Part of the change is that he started driving the ball the other way more often, going with the pitch rather than trying to pull pitches on the outer half or third. He also became more aggressive as a hitter, swinging more often, trading more whiffs for more extra-base hits; he hit eight doubles in 44 games as a college junior, then hit 33 doubles in 123 games last year in Spokane.\nHe led the Northwest League in all three triple-slash stats, and could have gone to Double-A Hartford by midsummer, although the Rockies wanted him to stick with Spokane as they pushed for the league title. He’s a plus defender at third with great instincts on both sides of the ball. His OBP does mask some of his pitch recognition issues — he doesn’t chase a ton, but when he does, he almost never connects, especially with offspeed stuff, and getting him to understand what pitches he can and can’t reach with his long arms is going to be his main developmental challenge. He could be an above-average regular if he does, given the defense and the potential for 40-50 doubles with double-digit homers.\nKellon Lindsey, SS, Los Angeles Dodgers\nHeight: 6-2 | Weight: 175 | Bats: R | Throws: R | Age: 19\nLindsey was a tough omission, because he clearly has the tools to be a top-100 guy, or even a top-50 guy, but the main question from before the draft on him remains unanswered: how is he going to fare against pro-quality breaking stuff? Lindsey is an 80 runner who looks a ton like Trea Turner at the same age, and he’s an above-average or better defender at shortstop who could easily slide to center field and probably be plus there on Day 1. He has a good swing for extra-base power with quick hands and wrists, with at least average power upside as he fills out.\nHe really did not pick up offspeed stuff in the spring, even playing against weak competition at a rural Florida high school, and MLB’s inane decision to move the complex leagues up in the calendar meant that he didn’t have anywhere official to play after he signed. If he shows he can pick up spin better in 2025 than he did before the draft, he’s going to be in the top 50 at midseason, because it’s tools all day and a good swing to produce quality contact.\nAdvertisement\nJansel Luis, SS/2B, Arizona Diamondbacks\nHeight: 6-0 | Weight: 170 | Bats: S | Throws: R | Age: 20\nLuis got off to a miserable start but played better after April, and generally improved his swing decisions as the season went on, but it didn’t show up in the results. He’s very toolsy and played in Low A at 19, probably belonging in the late, lamented short-season level, and his lack of zone awareness really killed him in the first half of the season. He did improve in a tangible way in the second half, with just 30 Ks and 20 walks in 170 PA, but it didn’t translate into better overall production.\nHe’s a shortstop now but much more likely to end up at second base, and then the question of whether his bat is good enough to make him a regular or better or just a utility player arises. He did lead the Cal League with 10 triples and finished second among all A-ball batters in extra-base hits with 46, if you’re looking for positives. I’m still a fan, and I’m hoping this year was a function of being young and physically immature for the level rather than a function of his hit tool.\nOrelvis Martinez, 3B, Toronto Blue Jays\nHeight: 5-11 | Weight: 200 | Bats: R | Throws: R | Age: 23\nMartinez was on the top 100 a year ago, had a great start to 2024 in Triple A, got to the majors for five minutes, and was suspended for the rest of the year for testing positive for a PED. He didn’t slide off the top 100 for the suspension, but for concern now that he might have to move off the dirt, and his value as a high-power, low-OBP corner outfielder may just not be good enough to be more than a solid regular. It is real power, though; he has hit 75 homers in 317 games in Double A and Triple A over the last three seasons.\nHe’s tightened up the approach enough to make it work against better pitching, chasing fewer pitches than he did when he was younger, although he still hunts fastballs and all offspeed pitches give him trouble. When he was a potentially above-average defensive third baseman as a 20-year-old, it was easier to see different scenarios where he could be a 4-win player in the majors. He still has major-league value, and could end up a regular in a corner, but those paths are a little narrower now.\nJefferson Rojas, SS, Chicago Cubs\nHeight: 5-11 | Weight: 150 | Bats: R | Throws: R | Age: 20\nThe Cubs were aggressive with Rojas, who signed for a $1 million bonus in 2022, by sending him right to High A to start 2024 after just 70 games at Low A the year prior. He hit .245/.310/.336 last season, with questionable enough defense at shortstop that it seems very likely he’s going to end up somewhere else, perhaps even a corner outfield spot. He made a ton of contact, with just a 20 percent whiff rate and 15.3 percent strikeout rate despite being very young for the level, and needs now to work on the swing decisions to make sure he’s attacking pitches where he can do real damage.\nHis exit velocities jumped significantly last year and he was very unlucky on balls in play, with just a .274 BABIP, pointing to some real upside at the plate. He’s erratic in the field now, with a lot of unforced mistakes and questions about his internal clock, and other teams seem to believe he’s just not a shortstop regardless of how his body develops. He’s still very young and likely spends this year in Double A at age 20, with a lot of untapped upside at the plate, especially if he cuts down on some of his out-of-zone swings to focus more on pitches he can drive. The ceiling is lower today than it was a year ago given the much lower probability that he stays at short.\nThomas Saggese, 2B, St. Louis Cardinals\nHeight: 5-11 | Weight: 185 | Bats: R | Throws: R | Age: 23\nSaggese went to the Cardinals in a 2023 deadline deal that sent Jordan Montgomery and Chris Stratton to Texas. He reached the majors last September for his debut — a great outcome for someone drafted 15 picks from the end of the shortened 2020 draft. He’s ready now to be someone’s regular at second base, probably hitting 18-20 homers with a fringy OBP if he plays every day this year, with more growth in his batting average over time. He did struggle with the strike zone in Triple A last year, chasing pitches out of the zone 37 percent of the time. He’s always been an aggressive hitter but this was a new issue for him, and it’s the sole reason he’s not in the top 100.\nAdvertisement\nThe Cardinals sent him to the Arizona Fall League to work on those swing decisions and he was one of the best hitters there, with a .391/.524/.594 line and more walks (16) than strikeouts (15), although that’s a hitter’s league and the pitching there is a far cry from what he’ll see in the majors. I’m still a fan and see an eventual solid-average regular at second base with 55 defense, but he has to swing at strikes and lay off stuff out of the zone, even if he thinks he can connect with it.\nEduardo Tait, C, Philadelphia Phillies\nHeight: 6-0 | Weight: 175 | Bats: L | Throws: R | Age: 18\nEveryone agrees that Tait can hit, and hit it hard, with power to come; he hit .321/.377/.500 in the Florida Complex League last year, then moved up to Low A and hit .269/.316/.462 in 28 games, all as a 17-year-old. He did have some platoon splits, mashing against righties, but only struck out six times in 58 PA against lefties, a better K-rate than he had with the platoon advantage.\nThe question is whether he’s going to stay behind the plate, where, aside from a plus arm, he’s a long way from making it work — and his body is already very thick for his age. His receiving and blocking are well below average as is, and it’s more likely he ends up at another position. The bat could still be special enough to make him an above-average regular or more even if he has to go to first base, so he’s very much a prospect. Just temper your enthusiasm until we get more clarity on his physical development and eventual position.\nJames Tibbs III, OF, San Francisco Giants\nHeight: 6-0 | Weight: 201 | Bats: L | Throws: L | Age: 22\nTibbs was the Giants’ 2024 first-round pick after he hit .363/.488/.777 for Florida State with 58 walks and 37 strikeouts in 66 games. He went to Low-A San Jose and hit well, going 17 for 41, but punched out 11 times with just one walk, and then went to High-A Eugene and hit poorly, going 9 for 67, with 25 strikeouts and seven walks. I don’t move my evaluations of players much based on pro debuts, given the tiny samples, the long layoff between their spring seasons and the draft, and the possibility that they’re just tired by August. I will admit Tibbs’s debut was one of two that spooked me this year, along with Charlie Condon’s, another apparently advanced hitter who struck out at an alarming rate in his first taste of pro ball.\nAs an amateur, Tibbs produced a lot of hard contact and made excellent swing decisions, starting with a wide base and a small stride until he got to two strikes, when he’d shorten up to prioritize contact over power. He showed the bat speed to get to good velocity and had no trouble with breaking stuff. Much like Condon, Tibbs suddenly developed a severe allergy to the slider once he got to pro ball; in limited data from Synergy Sports, he struck out 57 percent of the time he swung at sliders across the two stops, with a lot of late, ugly hacks, like he never picked the pitch up and was trying to recover late once he realized what it was. He might have been in the 91-100 range had he not had these contact issues after he signed, so he hasn’t moved much, but given that he’s a corner outfielder without much defensive value, he absolutely has to hit.\nJacob Wilson, SS, Athletics\nHeight: 6-2 | Weight: 190 | Bats: R | Throws: R | Age: 23\nWilson reached the majors last year, almost exactly a year after the Oakland A’s (they were still Oakland then, I’m not letting that go) took him with the No. 6 pick. He suffered a hamstring injury in his first game, but returned to hit .250/.314/.315 with a 9.7 percent strikeout rate — pretty much in line with expectations. He’s an extreme contact hitter with no power, with low average and peak exit velocities that back that up, averaging 85.8 mph in the majors and just 84.0 mph in Triple A. He had 186 balls in play between Triple A and the majors; only 24 of them were hard-hit (95 mph or harder), and only four were above 102 mph.\nThe one surprise in his MLB debut was that his defense was worse than advertised; scouting reports on him in college (including my own) had him as a plus defender at short, with excellent hands and at worst above-average range, but his range was just average in Triple A and below that in the big leagues, especially moving to his left or right. I had him as a soft or second-division regular in last year’s reports, and I’m sticking with that — I think he’s a little better than he showed in the majors, but I’m concerned that we all overrated the defense, and the bat isn’t going to make up for that.\n(Top photo illustration of Owen Caissie and Thomas Saggese: Matt Dirksen, Dilip Vishwanat / Getty Images)"
    }
  ],
  "argos_summary": "Kyle Karros, the Colorado Rockies' No. 3 prospect and son of former MLB player Eric Karros, has made his major league debut as a potential everyday third baseman. After a strong minor league performance, including a .311 batting average in High-A and impressive stats in Double-A and Triple-A, Karros is recognized for his solid hitting and defensive skills. The Rockies also made several roster moves, including placing Orlando Arcia on the injured list and promoting Aaron Schunk.",
  "argos_id": "66YQ8E27H"
}