{
  "url": "https://mashable.com/article/boys-go-to-jupiter-review?test_uuid=003aGE6xTMbhuvdzpnH5X4Q&test_variant=b",
  "authorsByline": "Belen Edwards",
  "articleId": "35dd367ec40c4aa4bee2b8b91e85ed39",
  "source": {
    "domain": "mashable.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://helios-i.mashable.com/imagery/articles/03JENw4nc64EfqTU9tDXCg9/hero-image.fill.size_1200x675.v1718054179.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T09:00:08+00:00",
  "addDate": "2025-08-08T09:40:27.659020+00:00",
  "refreshDate": "2025-08-08T09:40:27.659023+00:00",
  "score": 1.0,
  "title": "'Boys Go to Jupiter' review: An animated gem about oranges, aliens, and the gig economy",
  "description": "Also, it's a lo-fi musical.",
  "content": "Welcome to the weird world of Boys Go to Jupiter, where aliens hang out with delivery boys, juice factories house mutant fruits grown from moon rocks, and funky electronic songs lurk around every corner.\n\nThis world isn't some new planet or alternate dimension: It's just suburban Florida. Yet in the hands of director and 3D animator Julian Glander, Boys Go to Jupiter's Florida becomes a strange, magical place where the absurd and the mundane co-exist as nonchalant bedfellows. Bizarre, hilarious, and boasting refreshingly distinct animation, Boys Go to Jupiter is a wonderfully absurd experience.\n\nWhat's Boys Go to Jupiter about?\n\nBoys Go to Jupiter centers on high school dropout Billy 5000 (voiced by Jack Corbett), who's hustling his way to $5,000 by delivering food through the app Grubster. Along the way, he befriends Donut, a gelatinous, blue, donut-shaped alien who's being hunted by juice mogul Dr. Dolphin (voiced by Janeane Garofalo).\n\nThe pieces are in place for a boy-saves-alien film in the vein of E.T., but Boys Go to Jupiter take a more chill, meandering approach. Billy often stumbles into strange vignettes, including an unexpectedly philosophical encounter with a hot dog stand manager on the side of a highway, or a mini music video about the power of eggs. Glander holds on these vignettes for a while, painting Billy's world as a collage of oddities he'd rather avoid entirely in favor of getting back on his grind.\n\nOf course, that grind comes with its fair share of setbacks, as Boys Go to Jupiter takes a staunchly anti-capitalist tack. Small details like how Grubster workers are not allowed to engage with customers and must repeat \"grubby\" catchphrases paint Billy's job as a dull dystopia. Elsewhere, Glander gets less subtle, such as when Dr. Dolphin's daughter, aspiring radical Rozebud (voiced by singer Miya Folick), hands Billy a book all about capitalism which he promptly absorbs.\n\nBoys Go to Jupiter is strange, and proud of it.\n\nWhile Billy exists as a cog in the hustle culture machine, the movie he's in works to break out of any mold and establish its own individuality. Take the voice cast, which includes singular comedians like Sarah Sherman, Julio Torres, and Cole Escola. Then there's Glander's signature animation style, a series of neon CG renderings ranging from blobby to plasticky. Characters and locations come to resemble toys or video game settings. The intentional artifice is welcome, creating a sense of play that sets Boys Go to Jupiter apart from other more photo-realistic CG animated movies.\n\nGlander builds on the distinct look of his film with some lo-fi musical numbers, like an ode to side hustles or a catalog of an alien's favorite Florida delicacies. These add to the winding quality of the film, building out space for diversions that are often unexpected but never unwelcome. While you could fault Boys Go to Jupiter for a loss of focus as it nears its finish line, the journey to get there remains worth taking.\n\nBoys Go to Jupiter opens in theaters Aug. 8.\n\nUPDATE: Aug. 5, 2025, 9:31 a.m. Boys Go to Jupiter was reviewed out of its world premiere at the Tribeca Film Festival on June 11, 2024. This article has been updated to include the latest release information.",
  "medium": "Article",
  "links": [
    "https://mashable.com/article/problemista-tilda-swinton-julio-torres-interview",
    "https://mashable.com/article/presumed-innocent-review",
    "https://mashable.com/article/best-summer-movies-streaming",
    "https://linktr.ee/boysgotojupiterfilm",
    "https://www.ziffdavis.com/terms-of-use",
    "https://www.ziffdavis.com/ztg-privacy-policy",
    "https://mashable.com/video/fixed-trailer-netflix",
    "https://mashable.com/article/fantasmas-review",
    "https://mashable.com/category/film",
    "https://mashable.com/roundup/best-streaming-services",
    "https://mashable.com/article/problemista-julio-torres-tilda-swinton-trash",
    "https://mashable.com/article/robot-dreams-review",
    "https://mashable.com/article/best-anime-hulu"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Boys Go",
      "weight": 0.10450271
    },
    {
      "name": "Jupiter",
      "weight": 0.0858626
    },
    {
      "name": "Boys",
      "weight": 0.08132557
    },
    {
      "name": "Boys Go to Jupiter",
      "weight": 0.07166052
    },
    {
      "name": "Billy",
      "weight": 0.0624515
    },
    {
      "name": "juice mogul Dr. Dolphin",
      "weight": 0.06040941
    },
    {
      "name": "aliens",
      "weight": 0.059110355
    },
    {
      "name": "Boys Go to Jupiters Florida",
      "weight": 0.05635276
    },
    {
      "name": "side hustles",
      "weight": 0.054840077
    },
    {
      "name": "Julian Glander",
      "weight": 0.05451475
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Reviews"
    },
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.861328125
    },
    {
      "name": "/Arts & Entertainment/Movies/Science Fiction & Fantasy Films",
      "score": 0.32666015625
    },
    {
      "name": "/Arts & Entertainment/Movies/Animated Films",
      "score": 0.31640625
    }
  ],
  "sentiment": {
    "positive": 0.08508301,
    "negative": 0.5883789,
    "neutral": 0.3269043
  },
  "summary": "The animated film \"Boys Go to Jupiter\" is about a high school dropout boy named Billy 5000 who navigates the gig economy by delivering food via the app Grubster. The film, directed by Julian Glander, explores a world where aliens, aliens, and the gig-economy collide. Despite setbacks, the film is praised for its unique take on the subject and its distinct animation style. The voice cast includes comedians like Sarah Sherman, Julio Torres, and Cole Escola. Despite some minor issues with small scale scale issues, the movie remains worth taking. It is set to open in theaters on August 8.",
  "shortSummary": "Boys Go to Jupiter, a surreal yet anti-capitalist comedy set in suburban Florida, is a refreshingly distinct animation featuring distinct, immersive scenes and memorable moments, despite some minor setbacks.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d9402c6f808d44769e318f9e6eaa2156",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://mashable.com/article/fantasmas-review",
      "text": "'Fantasmas' review: Surreal Julio Torres comedy is like nothing else on TV\nMashable's entertainment team picks our Watch of the Week, TV shows and movies that you absolutely must add to your list.\nThere's nothing quite like seeing the world through Julio Torres' eyes.\nThe writer and director has a knack for crafting strange stories based on the world's most mundane details. In his beloved SNL sketch \"Papyrus,\" the font of the Avatar logo becomes the bane of Ryan Gosling's existence. In his comedy special My Favorite Shapes, Torres breathes life into everything from a red plastic square to a Hunchback of Notre Dame Happy Meal toy. Even his longer-form projects like Los Espookys or Problemista render the minutia of our everyday lives as absurd as possible, sometimes turning trash into treasure.\nWith his latest project, the HBO series Fantasmas, Torres brings his singular musings on the things we take for granted to new heights. What starts as an odyssey to find a lost earring quickly spirals into something stranger: a collection of vignettes boasting as much pathos as offbeat humor. Nowhere else will you see a melancholic riff on the order of the alphabet, or a psychosexual showdown between customer service representatives. Each of these small stories is a delight in itself, but when you bind them together, you get the surreal shock to the system that is Fantasmas.\nWhat is Fantasmas about?\nIn Fantasmas, Torres plays a fictionalized version of himself. Like his real-life counterpart, the show's Julio sees the world differently from others. He can sense the inner lives of objects and concepts, a point of view he's translated to consulting jobs for places like Crayola (he suggests they make clear crayons) and NASA (he's helping rebrand a constellation).\nJulio's fanciful life butts up against expectations of conformity, to the point that he refuses to get the so-called \"Proof of Existence\" needed to identify him. Proof of Existence is necessary for Julio's upcoming apartment hunt — his current building is being turned into a General Mills Café and Residencies, just one of many dystopian details that color Fantasmas' alternate version of New York. However, instead of taking the steps to get this new form of ID, Julio turns his attention to finding a golden oyster earring he lost at a club. His rambling quest serves as a framing story for Fantasmas, which flits in and out of vignettes at a moment's notice, calling to mind a madcap variety show.\nThese vignettes make up a sizable chunk of Fantasmas, and to say more about their actual storylines would be to spoil much of the show's fun. But there's a constant joy at the discovery of each new segment, which can take the form of anything from an advertisement to a dream sequence.\nMost of the time, we end up following a character Julio meets ever so briefly (played by a stacked bench of guest stars like Steve Buscemi and Julia Fox) into their daily lives. These changes in perspective shift us from the surface-level impressions of those initial encounters to rich character studies. Often, all these oddball characters want is meaningful connection in an increasingly impersonal world. Fantasmas shows us the lengths people are willing to go to to find that connection, that sense of being seen, all with Torres's characteristically dreamy flourishes.\nFantasmas presents a brilliantly surreal New York.\nIn addition to its freewheeling structure, one of Fantasmas' greatest pleasures is its world-building. Torres invites us into an absurdist fantasy New York, where clubbing hamsters and Smurf-like creatures rub shoulders with performance artists and aspiring actors. Production designer Tommaso Ortino adds to the fantasy with colorful sets straight out of a surreal theater show. Some rooms are often missing ceilings or walls, giving way to a black void. Others are twisting, turning mazes, calling to mind the set of My Favorite Shapes or the labyrinthine representation of the U.S. immigration process in Problemista.\nThe theatrical feel of the sets extends throughout Fantasmas, from elaborate puppetry to cartoonish sound effects to a repeating motif of a miniature proscenium. But instead of evoking artifice, these clearly handmade elements invite us into the crafting process, highlighting Fantasmas' characters' scrappy attempts to build something new. Performance artist Vanesja (Martine) — the \"j\" is silent — got too invested in a piece where she pretended to be Julio's agent, to the point that she is now really an agent. Driver Chester (Tomás Matos) has created a rideshare app just for their car — \"it's giving grassroots,\" they tell Julio. Even Julio's robot assistant Bibo (voiced by Joe Rumrill) dreams of becoming an actor.\nStill, reality rears its ugly head in the face of these dreams, as Torres' fantasy New York is not immune to the horrors of bureaucracy and late-stage capitalism. A visit to a doctor's office is juxtaposed with a ticking countdown, similar to Problemista's hourglass imagery tied to expiring work visas. Corporations take over apartment complexes. At one point, in an effort to get out of having Proof of Existence, Julio tries to sell a show to Zappos' new streaming service. That's just one of many moments in which Fantasmas skewers the entertainment industry, including a pointed superhero send-up that still manages to find new ground in a genre that's already been parodied to death.\nBut even with all these instances of outside forces mandating conformity, Fantasmas' kooky characters manage to forge their own paths. The same is true of Fantasmas itself, which breaks its own mold time and again to create something that is wholly unique, relevant, and unabashedly weird. There's nothing on TV quite like it, its shimmering strangeness making it just as precious as Julio's coveted golden oyster earring.\nFantasmas premieres June 7 at 11 p.m. ET on HBO and Max, with a new episode weekly.\nTopics HBO\nBelen Edwards is an Entertainment Reporter at Mashable. She covers movies and TV with a focus on fantasy and science fiction, adaptations, animation, and more nerdy goodness. She is a member of the Critics Choice Association and the Television Critics Association, as well as a Tomatometer-approved critic."
    },
    {
      "url": "https://mashable.com/video/fixed-trailer-netflix",
      "text": "Animation legend Genndy Tartakovsky has captivated audiences of all ages with projects like Dexter's Laboratory, Samurai Jack, the Hotel Transylvania series, and Primal. However, his upcoming film Fixed is decidedly for the older crowd.\nThat's because the entire movie hinges on dog Bull (voiced by Adam DeVine) realizing his owners are about to have him neutered, separating him from the balls he loves so much. And you'd better believe that Fixed animates Bull's testicles, along with other parts of his anatomy. Seriously, if you've ever yearned to see the famed \"butthole cut\" of 2019's Cats, then Fixed is the movie for you.\nPanicking over his upcoming castration, Bull sets out for one last big night on the town with his doggy friends Rocco (Idris Elba), Fetch (Fred Armisen), and Lucky (Bobby Moynihan). Squirrel-killing rampages and trips to dog strip clubs (yes, really) ensue. But amid all the R-rated carnage, will Bull be able to accomplish his true goal: telling neighboring dog Honey (Kathryn Hahn) that he's in love with her?\nBrazen in its crassness but still oddly sweet, Fixed was trapped in development hell for years. In 2024, it was shelved by Warner Bros. Discovery, a move the company pulled with other completed projects like Batgirl, Coyote vs. Acme, and Scoob! Holiday Haunt. That meant distribution for the project fell back on Sony Pictures Animation, which has collaborated with Netflix before on projects like The Mitchells vs. The Machines.\nFixed is now less than a month out from release after years of setbacks, and you can get a taste of its nasty madness in the trailer above."
    },
    {
      "url": "https://mashable.com/article/robot-dreams-review",
      "text": "'Robot Dreams' review: A stunning, dialogue-free ode to loneliness\nIn Pablo Berger's Robot Dreams, the real treasure is the mail-ordered friends we literally made along the way. With not an ounce of dialogue, the Spanish director simultaneously spins a tale of friendship and connection while making its abundantly clear how profound loneliness can be. Who knew a dog and robot BFF story could get so deep?\nBased on Sara Varon's graphic novel, this Oscar-nominated film takes place over the course of about one year, beginning with a fleeting but lasting connection between an unlikely pair, separated through absolutely avoidable circumstances. A simply beautiful use of animation, music, and sound to explore isolation and interconnectedness, Robot Dreams will be one of the more impactful, touching films you see this year — all without saying a word.\nRobot Dreams premiered at Cannes Film Festival last year, then hit the Toronto International Film Festival, all to critical acclaim. Now finally hitting U.S. theatres this summer, Robot Dreams is about to seize a whole new audience by the heart.\nWhat is Robot Dreams about?\nSet in '80s Manhattan, Robot Dreams introduces you to Dog, who lives by himself in the East Village. In an attempt to assuage his loneliness, Dog impulse-buys a build-it-yourself buddy off the TV, the Amica 2000. To us, the name's Robot. In this reality, there are robots for cleaning, security, tutoring, and sports, but Robot appears specifically designed for friendship (they exist).\nTechnology-assisted friendship with robots has fascinated writers and filmmakers for decades, from Steven Spielberg's A.I. Artificial Intelligence to Alex Garland's Ex Machina, among countless others. Hell, even Mary Shelley's Frankenstein counts. But in Robot Dreams, a giddy summer of love between canine and robot is unique in itself, and impactful enough to make their frantic hope for reunion the only thing you'll care about for two hours.\nContrary to what it looks like in the trailers, Robot and Dog actually spend the majority of the film apart. What?! Through a series of unfortunate, saltwater-related events, Robot is stuck rusting at the beach for months, using their imagination as a means to escape inanimate coastal peril and deal with the fact that they're being treated like literal junk. The film functions as a series of vignettes in Dog and Robot's lives after their summer together, moving toward the film's deeply emotional, Bridges of Madison County-level climax.\nRather than offering an overt high-five to friendship, Robot Dreams is essentially a story of deep (and deeply relatable) loneliness in a city of millions, of being lifted up and left behind.\nRobot Dreams is a portrait of loneliness like no other.\nAt its core, Robot Dreams is a poignant exploration of the highs of feeling seen and included, as well as the lows of feeling forgotten or discarded. Dog's reflection in the TV screen is a constant reminder of his solo life, as are the happy couples he can't avoid seeing, whether through a neighbour's apartment window, on a ski vacation, or just trying to take a damn walk in Central Park.\nAcross the city, on a deserted Coney Island beach, the bright orange towel Robot was left on has become a sort of prison; Robot has nothing to do but embrace falling snowflakes, make friends with the coastal wildlife, and dream away the months. Jealousy and betrayal plague Robot's dreams, as their feelings of abandonment become increasingly painful. Meanwhile, Dog seeks out new opportunities for making friends, which adds to our empathy for poor ol' Robot, but this actually reflects the film's most realistic element: Life goes on.\nBerger uses Robot's titular dreams to explore more surreal sequences the further away rescue seems, including a gorgeous ode to The Wizard of Oz involving an army of tap-dancing daisies around our Tin Man. These unreal moments bleed into Dog's experience too — a dream of a ten-pin bowling session with a Slurpee-drinking snowman doesn't exactly spell reality, but the humiliation in this scene is very real for Dog.\nDog and Robot individually find moments of connection with others over the months, but more than anything, this animated film paints a portrait of loneliness more real than many live-action attempts. And it has a huge amount to do with sound.\nWith no dialogue, Robot Dreams proves words are overrated.\nThe entirety of Robot Dreams is dialogue-free, making the film instantly universal in theme and approach despite its specifically New York setting. Alfonso de Vilallonga's jubilant, empathetic score, alongside superb foley effects, weaves the story's emotional highs and lows, making Robot Dreams function like a silent movie. It's the opposite kind of dialogue-free film as, say, A Quiet Place, where the need for silence is used to build terror, but it's as much of an experiment.\nAfter five minutes of Robot Dreams, you'll honestly forget the characters don't speak; the visuals are enough to indicate dynamics between characters, the passing of time, and a scene's sense of urgency. Characters laugh, sound concerned, and express anger, all through sound.\nIt's music that proves the most effective emotional compass over the course of the film. De Vilallonga moves the characters through an upbeat jazz score for hijinks, funk for a fateful repair montage, and sentimental piano for the deeper moments. Needle drops don't come more moving than the film's use of Earth Wind and Fire's iconic song \"September,\" which underscores much of Dog and Robot's friendship. The film also seamlessly weaves diegetic and non-diegetic sound, as the characters tune their radios or blast music from their cars. It all creates an intimate, specifically New York soundscape that contributes to the film's unsung supporting character: the city itself.\nRobot Dreams is a heartfelt ode to New York City.\nAn octopus bucket drummer busking in the First Avenue subway, a steel drum duet echoing through Central Park — the sounds of New York City form a welcome stage for the ins and outs of Robot Dreams. With cleverly detailed, bustling animations, New York City becomes a character itself.\nIt's the ultimate setting for a summer of friendship: rowing under Bow Bridge, inhaling hot dogs by Bethesda Fountain, using the binoculars on the Empire State Building, sitting beneath Williamsburg Bridge watching the city skyline. Robot's default optimism and overwhelming politeness clashes with the brashness of New York, pissing off punks of Alphabet City. Dog peruses the well-stocked shops of Chinatown, and Robot enjoys fireworks from a festooned Brooklyn rooftop. The sequences at Coney Island look good enough to eat. The tiny details tucked into each frame are dazzling — a baby penguin in an icebox at the beach made so much sense I squealed.\nBeing a Manhattan of the 1980s, the film's landscape notably includes the Twin Towers in the city skyline, which functions as an omnipresent nod to lost loved ones and the enduring power of connection. It's a sadly unexpected vision, one that recalls lost time as poignantly as any madeleine.\nA magnificent ode to the power of unlikely friendship and all-too-real feelings of loss and lonesomeness, Robot Dreams will leaving a lasting impact without so much as a spoken sentence. Crank up \"September,\" and get yourself to see this film now.\nRobot Dreams is now streaming on Hulu.\nShannon Connellan is Mashable's UK Editor based in London, formerly Mashable's Australia Editor, but emotionally, she lives in the Creel House. A Tomatometer-approved critic, Shannon writes about everything (but not anything) across entertainment, tech, social good, science, and culture. Especially Australian horror."
    },
    {
      "url": "https://mashable.com/article/best-anime-hulu",
      "text": "Animation overload: The 10 best anime series on Hulu\nLooking to get lost in a postapocalyptic world of oversexed teenage superheroes who wield emotions as heightened as their spiky hairdos? Sounds like you want to watch yourself some anime. The Japanese word for \"animation\" is really so broad in meaning that it covers multiple genres and styles — anime can be deeply somber, it can be utterly terrifying, or it can be total goofballs. Heck, sometimes it's all of these things in the span of a single scene. But as Supreme Court Justice Potter Stewart infamously said about pornography in 1964, we know it when we see it. And we know the best ones when we see them even more so.\nHere are the 10 best anime series currently streaming on Hulu.\n1. Cowboy Bebop\nThe legendary Cowboy Bebop ran for two seasons and 26 episodes back in 1998, and tells the story of the space cowboy Spike Spiegel and his merry band of bounty-hunter outlaws aboard the spaceship Bebop. The year is 2071 and Earth is uninhabitable — humanity now lives on moons and space-rocks where lawlessness pervades, which… well, if I had to live on a space-rock, I'd probably turn to a life of crime, too. Not a lot of lifestyle choices on a space-rock! The series follows Spike and his team as they hunt down different criminals each episode to earn their bounty, with the big bad of Spike's ex-bestie, Vicious, lurking about doing his own damage until their inevitable big showdown. One of the most beloved anime series ever made, Netflix live-actioned it in 2021 with John Cho in the lead, to little acclaim. Just watch the classic!\nHow to watch: Cowboy Bebop is now streaming on Hulu.\n2. One-Punch Man\nIt's the same problem that plagues Superman movies — if your superhero is too superpowered, finding somebody for them to fight that's an actual challenge becomes an issue. For Saitama, the lead hero of One-Punch Man, it's all right there in the title: He can obliterate anybody with a single punch. So where do you go from there? Smartly, the manga artist called ONE who created this series put this problem right at the center of it. Basically Saitama is just bored most of the time, and the series gets a lot of humor out of that. But it also leads Saitama to seek out bigger and bigger duels, needing that sweet real challenge high, until he's literally fighting \"God.\" Talk about an overachiever.\nHow to watch: One-Punch Man is now streaming on Hulu.\n3. Sonny Boy\nWritten and directed by Shingo Natsume (who also worked on One-Punch Man), Sonny Boy tells the story of a student named Nagara who finds himself and his entire school class suddenly and inexplicably transported to a different dimension. As the students try to figure out not just what happened to them but also the strange rules of this new world — where physics itself works differently — they discover they have all gained different superpowers as well. The fascinating thing about how Sonny Boy handles all of this, though, is that the focus remains on the young people's relationships. The big action happenings are usually skipped right over, and we watch how they deal with the aftermath instead. Naturally, they start forming cliques and rivalries in what reveals itself to be an excellent metaphor for everybody's isolating and strange high school experience.\nHow to watch: Sonny Boy is now streaming on Hulu.\n4. Yu-Gi-Oh!\nOne of the better-known stateside mangas thanks to its aughts-era Saturday morning airings and the tremendously successful card game that goes along with it, Yu-Gi-Oh! tells the story of young Yugi Moto. A picked-on nerd at series' start, Yugi solves an ancient Egyptian artifact called the \"Millenium Puzzle\" which has two immediate effects — it possesses him with the spirit of a gambler, and it unleashes the \"Shadow Games\" upon the world. Caught up in an endless tournament of \"Duel Monsters\" card battles with various foes (including his main nemesis, a corporate prick named Seto Kaiba), Yugi and his gang of good-natured pals travel around throwing their magical cards down at the bad guys, endlessly one-upping one another with bigger, badder creatures, over and over again. And again. It's basically the same thing every episode. And let someone who intimately knows via the experience of watching this on Saturday mornings during his early 20s tell you, this is exquisitely mindless hangover television. The epitome of veg-out TV.\nHow to watch: Yu-Gi-Oh! is now streaming on Hulu.\n5. Assassination Classroom\nI think most of us had that one substitute teacher in school who grabbed our attention and made us wonder who the heck this person was and what their story might be. Well, in Assassination Classroom, a 2015 series based off Yusei Matsui's manga, this fascinating homeroom substitute called Koro-sensei turns out to be, uhh, an enormous space octopus who's just eaten the moon and is currently threatening to destroy the world. But he somehow also finds the time to befriend the misfits of Class 3E in Kunugigaoka Junior High School, and it turns out that Koro-sensei is the best teacher they've ever had! So things get complicated when the government tasks the school kids with killing their teacher before he can gobble up Earth. Besides this series, the Assassination Classroom manga has been turned into a video game and two live-action films, but the 22 episodes of this wildly over-the-top anime are really where it's at.\nHow to watch: Assassination Classroom is now streaming on Hulu.\n6. Attack on Titan\nRunning for four seasons spread out across a decade, Attack on Titan was a massive success both in its native country and in the U.S., where Hulu actually premiered episodes during its last season at the same time they aired in Japan. It finished its run last year, so you can binge all 94 episodes of the series, which is set (where else) in a post-apocalyptic future. This specific post-apocalyptic future is due to the Titans, a race of evil giant humanoid creatures that have wreaked total destruction across the globe. That brings us to our lead character, Eren Jaeger, who watched his mother get gobbled up by one, only to later discover he has the ability to transform into a Titan himself. Which Eren then uses to get his revenge, one evil giant humanoid creature at a time.\nHow to watch: Attack on Titan is now streaming on Hulu.\n7. My Hero Academia\nIf you watched Buffy the Vampire Slayer, then you know that the big deal with the character of Xander (Nicholas Brendon) was that he was a powerless regular dude amid a bunch of super-slayers and witch-champions and immortal demons who fought the good fight anyway. His ordinariness was what made him special. My Hero Academia is basically that — Deku is a young boy born without powers in a world where nearly everybody has powers. But he manages to become a hero despite that, lifting himself up by his bootstraps and getting into the big academy for superheroes anyway, winning the more powerful people he meets along the way over through sheer force of can-do attitude. Which is a good thing, because a big League of Super Villains just formed, and it's comin' this way!\nHow to watch: My Hero Academia is now streaming on Hulu.\n8. Star Wars: Visions\nOne of the best received of the current Star Wars spin-off-mania programs we find ourselves buried beneath, Star Wars: Visions succeeds because of its willingness to be different. Different not just for telling stories unrelated to the 40-year Skywalker Saga we've all come to know so intimately, but wildly different in tone and execution from episode to episode. The show accomplishes this by having each episode of the anthology tell its own standalone story that's designed and delivered by an entirely different animation studio. One week you're watching the Sith-Jedi War get turned into a feudal-era revenge tale from the animators behind JoJo's Bizarre Adventure; the next, the folks behind the Scott Pilgrim anime are telling the story of a droid who dreams of becoming a Jedi. And at approximately 13 minutes each, none of these outstay their welcome — heck, you'll probably want spin-offs of their own for several.\nHow to watch: Star Wars: Visions is now streaming on Hulu.\n9. Undead Unluck\nWith shades of Pushing Daisies and X-Men's Rogue, Undead Unluck (based on Yoshifumi Tozuka's manga) tells the story of 18-year-old Fuuko Izumo, whose mere presence causes people to drop dead. After an accident leaves hundreds of people (including her own parents) exactly that, Fuuko goes into hiding for years. Ultimately she decides she can't continue living with this curse and is going to end it all… only to stumble upon her perfect foil, a dude named Andy who's immortal.\nThe two hit it right off and find in each other reason to keep going, but before they can celebrate too much, they find themselves being chased by a shadowy group called The Union that wants to use their powers for mysterious reasons. They propose teaming them up with the other \"Negators,\" a collection of people who \"negate\" the rules of the world — you know, little things like life and death. And on the other side of the battlefield? Oh, just God. These anime sure do love to make shit epic, huh?\nHow to watch: Undead Unluck is now streaming on Hulu.\n10. One Piece\nIf you'd like to set yourself a viewing challenge, tackling One Piece is your ticket — the show premiered in 1999 and now has nearly 1,200 episodes under its belt. That's 50 percent more episodes than The Simpsons! That said, you should prepare yourself going in that Hulu doesn't yet have all 20 seasons of the show streaming; they're up to season 11 at this point. But that's still hundreds of hours adapting Eiichiro Oda's manga, so by the time you make it through, they'll probably have added more. One Piece tells the story of treasure hunter Monkey D. Luffy and his team of Straw Hat Pirates, who're on the (long, long, long) hunt for the ultimate treasure of the title, which crowns the person that finds it Pirate King. Although at this point, one wonders if they're very good at their job, to be honest. It’s been 1,200 episodes and you're still looking. Come on, Monkey, get your act together.\nHow to watch: One Piece is now streaming on Hulu.\nTopics Watch Guides\nJason Adams is a freelance entertainment writer at Mashable. He lives in New York City and is a Rotten Tomatoes approved critic who also writes for Pajiba, The Film Experience, AwardsWatch, and his own personal site My New Plaid Pants. He's extensively covered several film festivals including Sundance, Toronto, New York, SXSW, Fantasia, and Tribeca. He's a member of the LGBTQ critics guild GALECA. He loves slasher movies and Fassbinder and you can follow him on Twitter at @JAMNPP."
    },
    {
      "url": "https://www.ziffdavis.com/terms-of-use",
      "text": "Effective May 2025 Note: The Ziff Davis Terms of Use have been updated. Please review the updated Terms of Use carefully before using the Ziff Davis Services. By using any of the Ziff Davis Services, you consent to the terms of the updated Terms of Use. PLEASE READ THESE TERMS OF USE (“TERMS”) CAREFULLY BECAUSE THEY DESCRIBE YOUR RIGHTS AND RESPONSIBILITIES AND, TOGETHER WITH ALL THE OTHER TERMS AND CONDITIONS REFERRED TO BELOW, FORM A LEGALLY BINDING AGREEMENT BETWEEN YOU AND (ZIFF DAVIS, LLC) REGARDING YOUR USE OF THE ZIFF DAVIS, LLC WEBSITE(S) AND OTHER SERVICES. THESE TERMS CONTAIN A BINDING ARBITRATION CLAUSE AND A CLASS ACTION WAIVER. SECTION 18 CONTAINS AN IMPORTANT NOTE TO NEW JERSEY CONSUMERS. IF FOR ANY REASON, YOU ARE UNABLE OR UNWILLING TO AGREE TO ALL OUR TERMS OF USE, PLEASE IMMEDIATELY STOP USING OR ATTEMPTING TO USE OUR WEBSITE AND OTHER SERVICES, BECAUSE IF YOU CONTINUE, YOU WILL BE AGREEING TO EVERYTHING IN OUR TERMS OF USE. 1. General These Terms govern your use of the interactive websites, mobile and connected applications, software, and all other online interactive features and services, including, but not limited to, emails, newsletters, forums, communities, sweepstakes and contests (collectively, the “Services”) operated by Ziff Davis, LLC and its subsidiaries (collectively “Ziff Davis” “we” “us” or “our”). Additional terms and conditions of use applicable to specific areas of the Services may also be posted in such areas and, together with these Terms, govern your use of those areas and are referred to collectively as the “Agreement.” These Terms cover the following Ziff Davis websites and mobile applications: Ziff Davis AskMen, AskMen Canada, AskMen UK, AskMen Australia PCMag, PCMag UK, PCMag Australia Lifehacker Geek ExtremeTech TechBargains Mashable Offers.com Credit Cards Explained CouponCodes.com Black Friday The Black Friday Deals of America Best Gifts Mashable Shop RetailMeNot IGN, IGN Canada, IGN UK, IGN Australia Spiceworks Spiceworks Community Spiceworks Ziff Davis (SWZD) Aberdeen Strategy & Research B2B Ideas IT ResearchOnline ReadITQuik TechHubBox Technology-Signals Ziff Davis Performance Marketing CNET ZDNET Applications: RetailMeNot IGN Core IGN Playlist TechBargains We reserve the right, in our discretion, to change or modify all or any part of the Agreement at any time, effective immediately upon notice published on this page. Your use of the Services constitutes your binding acceptance of these terms and conditions, including any changes or modifications made by Ziff Davis as permitted above. Please be sure to review the Agreement periodically to ensure familiarity with the most current version. If at any time the terms and conditions of the Agreement are no longer acceptable to you, you should immediately cease all use of the Services. It is your responsibility to refer to the Agreement upon accessing the Services. COPPA: The Services are directed to teenagers and adults and are not directed to children under the age of 13. You must be 13 years of age or older to use the Services outside of the European Union and European Economic Area, and 16 years of age or older in the European Union and European Economic Area. Ziff Davis complies with the Children’s Online Privacy Protection Act and does not permit registration by, and will not knowingly collect personally identifiable information from, anyone under 13. By registering for any Services, you represent and warrant that you are 13 years of age or older or, if you reside in the European Union or European Economic Area, 16 years of age or older. Additionally, you must provide true, accurate and complete registration information to become a member of the Services (“Member”). Creating a Member account if you are under the age of 13 outside of the European Union and European Economic Area or 16 in the European Union and European Economic Area, under automated means or under false or fraudulent pretenses constitutes unauthorized use of the Services, and such accounts will be deleted by Ziff Davis. As part of the registration process, you may be asked to select a username and password and you will be responsible for keeping your password secure and for all activities occurring under your username.. We may refuse to grant you a username that impersonates someone else, violates or infringes on the trademark or proprietary rights of a third party, or is vulgar, offensive, or otherwise inappropriate, as determined by us in our sole discretion. You agree that your username and password is personal to you and should not be used to provide access to the Services to any other person or entity. By using the Services, you agree to: (a) provide accurate and complete information about yourself as prompted by the registration form for a Service (“Registration Data”), (b) maintain and promptly update the Registration Data to keep it accurate and complete, and (c) maintain the security of your password. In the event you compose a profile upon registering for the Services (a “Member Profile”), such profile must describe you, an individual person. Examples of inappropriate profiles include, but are not limited to, profiles that purport to represent an animal, place, inanimate object, fictional character, or real individual who is not you. Access to the Site and Services: Ziff Davis strives to allow access to the Site 24 hours a day, 7 days a week, apart from necessary maintenance operations and possible breakdowns. Ziff Davis is only bound by an obligation to make every effort to provide access to the Site and the Services and cannot be held responsible, and declines all responsibility, for any and all inaccessibility of the Site, interruption or temporary stoppage of Services. This could occur and would not be a violation of its contractual obligations under these terms and Conditions or its legal obligations, in particular in terms of the security of personal data, and this, whatever their nature (including without limitation computer viruses, unlawful intrusion into an automated data processing system, temporary stoppage of the service, etc.). Ziff Davis cannot guarantee the continuity of the Site, its permanence, or its compatibility with your operating system or your browser. You acknowledge that you are solely responsible for the proper functioning of your equipment. For Shopping Services: Certain Ziff Davis sites allow you to purchase products (“Products”). Such Products and pricing on the sites may change at any time without prior notice to you. You agree that you will only purchase Products on the sites for your own use and enjoyment or as a gift for another person, that all information you submit through the sites is complete, accurate, current and true and that you are not barred from receiving Products under applicable law. Some Products you purchase may be used or contain used parts. Certain software or other materials that you purchase through the sites may be subjected to further export controls. You agree to comply with all applicable export and re-export restrictions, laws and regulations and will not encourage, assist, or authorize the transfer of such products to a prohibited country in violation of law, rule or regulation. Please be advised that an order confirmation to you does not signify acceptance of your order, nor does it constitute confirmation of an offer to sell. At any time after receipt, your order may be accepted, declined, or quantity restrictions or other limits may be placed on your order for any reason. If you are charged for an order that has been canceled, you may seek a refund for the full amount of the canceled portion of such order. While we strive to make all information on the sites as accurate as possible, we do not warrant that Product descriptions or other content is accurate, complete or error free. Promotions and availability of products are subject to change and we cannot confirm the availability or price of an item until you place your order. For more information please see our return policy. Please also be advised we do not operate a call center. Participation; Adding and Using Vouchers and Discount Codes: Members are encouraged to play an active role on the Site and have the possibility of posting Discount Coupons, Refund Offers on the Site as well as publishing Opinions concerning their online shopping experiences on merchant sites, subject to compliance with the conditions described in this Agreement. Coupons and discount codes may be added by Members of the Site. Their distribution is subject to validation. Members of the Site undertake to add coupons or discount codes with as much detail as possible and not to add personalized coupons or discount codes (i.e. a code for the single use of the person). Ziff Davis reserves the right to modify and delete the voucher at any time. The use of vouchers and discount codes implies that the user of the Site clicks on the buttons “Display the code and launch the site” or “display the site” or even on the graphic banner of the Site. These buttons/links cause the opening in a new browser window of the merchant site receiving the reduction voucher you have selected. After each use of a code or discount voucher, the Site invites you to indicate the correct or incorrect functioning using the interface provided for this purpose. We also invite you to leave a comment to provide additional information. These notices will allow us to remove invalid discount codes. Under no circumstances can Ziff Davis be held liable for comments made by the Member on the Site. The Member acknowledges under the terms of the terms and conditions to be solely responsible for the opinions left on the Site. The Member undertakes that said opinions shall not infringe the rights and legitimate interests of a third party. The Member therefore guarantees Ziff Davis against any recourse based on his remarks and to bear all the costs resulting from this recourse. These costs include in particular any damages owed by Ziff Davis in respect of said action as well as attorney’s fees and court costs. For RetailMeNot Cash Back Services: General. By participating in a RetailMeNot Online Cash Back Rewards Offer and/or In-Store Cash Back Rewards Offer (each, a “Promotion”), you agree to be bound by these Cash Back Rewards and Wallet Terms (these “Promotion Terms”) in addition to the rest of the Ziff Davis Terms of Use and privacy policies. In the event of a conﬂict between these Promotion Terms and the Ziff Davis Terms of Use, these Promotion Terms will control. All features may not be available and RetailMeNot reserves the right, in its sole and absolute discretion, to terminate, end or cancel any Promotion or other program at any time and without prior notice. Such termination shall not incur any obligations, consequences, or liabilities, including but not limited to compensation or payback, on the part of Ziff Davis. Definitions. “Activated Rewards Oﬀer” is defined as a Rewards Oﬀer for a Promotion that has been initiated by you but is not yet completed. In-Store Cash Back receipt scanning Rewards Oﬀers may activate when you submit a Receipt after a Qualifying Transaction during the Promotion Period. For other Rewards Oﬀers, activating such Rewards Oﬀer requires at a minimum clicking the Promotion Link or Link Cash Back Button, and may require additional steps as described on the Promotion Landing Page. “Approved Reward” is defined as a Reward oﬀered under an Activated Rewards Oﬀer for which RetailMeNot has determined that you: (1) met the eligibility requirements; (2) completed the required purchase(s); and (3) satisﬁed all other applicable conditions in order for the Reward to become eligible for redemption. “Bonus Reward” is defined as a bonus Reward oﬀered to certain RetailMeNot members who complete a qualifying activity or who meet certain criteria, as deﬁned in a Rewards Oﬀer Card or Promotion Landing Page, in addition to or in combination with oﬀers for Online Cash Back Rewards, or In-Store Cash Back Rewards. “Excluded Items” is defined as with regard to RetailMeNot services, any and all items that fall within categories, if any, speciﬁed on the Promotion Landing Page or in the Rewards Oﬀer Card (e.g., the “details” section) as being excluded from the Minimum Purchase Amount. The determination of whether particular purchases fall within an excluded category will be determined at RetailMeNot’s sole discretion. If you are unsure whether a desired item falls within an excluded category, check the details section of the applicable Rewards Oﬀer Card and direct any questions to our “Contact Us” form prior to making your online purchase. “In-Store Cash Back Rewards” is defined as Rewards that RetailMeNot provides after receiving a Receipt from Qualiﬁed Transaction, excluding amounts for returned or canceled purchases, and may sometimes be referred to as “In-Store Cash Back” or “In-Store Cash Back Rewards” on the RetailMeNot website or app, or on the Promotion Landing Page. “Link Cash Back Button” is defined as a virtual button provided on the Promotion Landing Page or Rewards Oﬀer Card that allows you to activate a Rewards Oﬀer. In some cases, clicking the Link Cash Back Button may also direct you to the Merchant’s website. “Merchant” is defined as the merchant that is speciﬁed on the Promotion Landing Page. “Minimum Purchase Amount” is defined as the amount speciﬁed on the Promotion Landing Page as the minimum purchase amount from the Merchant that is required to be eligible for the applicable Rewards Oﬀer. The Minimum Purchase Amount excludes discounts/promos, store points/rewards programs, tax, tip, fees, and any amount used to purchase Excluded Items. “Number of Rewards Oﬀers per Person” is defined as (a) for Online Cash Back Rewards, a limit of twenty (20) Rewards Oﬀers in the aggregate under all RetailMeNot Promotions in any calendar month and a limit of seven (7) Rewards per Merchant in any calendar month and (b) for In-Store Cash Back Rewards, a limit of ﬁfteen (15) Rewards Oﬀers in the aggregate under all RetailMeNot Promotions in any calendar month, unless otherwise speciﬁed in the Promotion Landing Page. “Online Cash Back Rewards” is defined as Rewards that RetailMeNot tracks through your Internet browser (e.g., tracking cookies), excluding amounts for returned or canceled purchases, and may sometimes be referred to as “Online Cash Back” on the RetailMeNot website or app, or on the Promotion Landing Page. “Promotion Landing Page” is defined as the website or app page that describes the Promotion and links to these Promotion Terms. “Promotion Link” is defined as the hyperlink provided on the Promotion Landing Page of an Online Cash Back Rewards Oﬀer that directs you to the Merchant’s website. “Promotion Period” is defined as the period beginning on the start date speciﬁed on the Promotion Landing Page and ending at the earlier of (1) the time that all of the Total Rewards Oﬀers available during Promotion have been claimed or (2) the end date speciﬁed on the Promotion Landing Page. The Promotion Period may be shortened or extended at RetailMeNot’s discretion. All start and end dates are based on Central Standard Time, unless otherwise indicated. “Qualifying Transaction” is defined as a purchase that is (a) in an amount greater than the Minimum Purchase Amount; (b) from a participating Merchant; (c) in connection with a Rewards Oﬀer; (d) made via an Online Cash Back Rewards Offer or submitted through a Receipt; and (e) in RetailMeNot’s sole discretion, satisﬁes all of the Promotion Terms. “Receipt” is defined as a proof of purchase from an in-store Qualifying Transaction with a Merchant during the Promotion Period. To be eligible for an In-Store Cash Back Reward, the Receipt must (i) be in US dollars and (ii) clearly display the date; Merchant name; receipt number or other identiﬁer speciﬁc to that Merchant, that Qualifying Transaction and on that applicate date; the item(s) purchased; the item price; and total amount spent on the item(s). The Receipt must clearly display all required information and meet any other speciﬁed terms to be eligible for an In-Store Cash Back Reward, including terms displayed on the Promotion Landing Page or Rewards Oﬀer Card. All decisions regarding whether to issue a Reward and/or accept a Receipt are in RetailMeNot’s sole discretion. “Redemption Process” is defined as the steps you must take, as speciﬁed by RetailMeNot in its sole discretion, in order to redeem Approved Rewards. A minimum approved balance of $5.01 is required for redemption (the “Minimum Redemption Amount”). The Redemption Process is further described below. “Reward” is defined as a reward given by RetailMeNot to you for fulﬁlling the requirements of the Promotion, as speciﬁed on a Promotion Landing Page and Rewards Oﬀer Card. “Rewards Oﬀer” is defined as an oﬀer for a Reward. “Rewards Oﬀer Card” is defined as the area of a website page or app that describes a Rewards Oﬀer and may include the Link Cash Back Button, a details section, and a link to a Promotion Landing Page. “Rewards Wallet” is defined as the user interface associated with your RetailMeNot account that will show Activated Rewards, Approved Rewards, and related information. “Third-party Service Providers” is deﬁned as any vendor, contractor or other entity (and their officers, employees, agents or subcontractors) engaged by Ziff Davis or its affiliates to perform services or functions on Ziff Davis’s behalf in connection with the Services including, without limitation, hosting and infrastructure, content-delivery networks, payment and billing, analytics and tracking, email and messaging platforms, customer-support operations, marketing and advertising, and other data-processing or technical services. Third-Party Service Providers may access, collect, transmit or store personal or non-personal data as reasonably necessary to provide such services. “Total Rewards available during Promotion” or “Total Rewards Oﬀer” is defined as the limited quantity of Rewards available under the Promotion, as speciﬁed on the Promotion Landing Page if the quantity is limited. Eligibility. Promotions are available to individual users of RetailMeNot who are residents of the United States and at least eighteen (18) years of age. Participation in any Promotion and the opportunity to earn Rewards from any Promotion are oﬀered at the sole discretion of RetailMeNot. Purchases for resale or commercial use are excluded from eligibility. Further, Reward earnings are subject to adjustment to reflect any returns or cancellations of Qualifying Transactions. In any calendar month, you are limited to the Number of Rewards Oﬀers per Person and the amount that may be earned, in the aggregate under all RetailMeNot Rewards Oﬀers, may be limited. How to Earn RetailMeNot Cash Back Rewards. Online Cash Back Rewards. To earn Rewards pursuant to a Rewards Oﬀer for Online Cash Back Rewards, you must: (1) during the Promotion Period, click on the Promotion Link right before making an online purchase via the Merchant’s website; (2) complete the online purchase in an amount equal or greater to the Minimum Purchase Amount; and (3) satisfy any and all other conditions speciﬁed on the Promotion Landing Page. Upon veriﬁcation that your purchase qualiﬁes and that you have satisﬁed applicable requirements, the Reward speciﬁed for the applicable Rewards Oﬀer will be considered an Approved Reward. YOU MUST CLICK ON THE PROMOTION LINK FOR THE REWARDS OFFER DURING THE SAME SHOPPING SESSION THAT YOU COMPLETE YOUR PURCHASE FROM THE MERCHANT. THE PURCHASE MUST BE MADE IN US DOLLARS. IF YOU VISIT OTHER SITES BEFORE COMPLETING YOUR PURCHASE, OR IF YOU USE COUPON CODES NOT PROVIDED BY RETAILMENOT, YOUR PURCHASE MAY BE ASSOCIATED WITH A SERVICE OTHER THAN RETAILMENOT AND YOU MAY NOT BE ELIGIBLE FOR THE REWARD(S). YOU MUST NOT ENABLE AN AD BLOCKER OR OTHERWISE DISABLE COOKIES ON YOUR COMPUTER, BECAUSE COOKIES ARE USED TO AUTHENTICATE YOUR PURCHASE. RetailMeNot In-Store Cash Back Rewards. To earn Rewards pursuant to a Rewards Oﬀer for In-Store Cash Back Rewards by submitting a Receipt, you must: (1) Activate the Rewards Oﬀer, if applicable; (2) complete the required purchase via a Qualiﬁed Transaction; (3) submit a valid, readable Receipt through the Promotion Landing Page in accordance with the stated terms; and (4) satisfy any and all other conditions speciﬁed on the Promotion Landing Page or Rewards Oﬀer Card. If you complete the obligations in Sections 4(b)(i) and 4(b)(ii) and the Reward Offer is still available, the Reward specified for the applicable Reward Offer will be considered an Approved Award. RetailMeNot Receipt Scanning. You agree to at all times provide accurate and complete information to RetailMeNot. You agree not to: submit a Receipt that is false, inaccurate, fabricated, counterfeited, incomplete, tampered with, adjusted, or otherwise inauthentic for the purpose of seeking to claim a Reward; redeem, or attempt to redeem, a Reward for products that have not actually been purchased, or for products that have been returned; submit or attempt to submit a Receipt that has already been submitted or used by you or another user; or submit Receipts outside of a Promotion Period, or for a purchase that took place prior to or after the launch date of a Rewards Oﬀer. RetailMeNot may, in its sole discretion, extend or shorten the redemption period for a Rewards Oﬀer. As between you and RetailMeNot, the determination as to what transactions are Qualifying Transactions shall be made by RetailMeNot in its sole discretion. Bonus Rewards. From time to time, RetailMeNot may oﬀer a Bonus Reward to certain RetailMeNot members who complete a qualifying activity or who meet certain criteria, as deﬁned in a Rewards Oﬀer Card or Promotion Landing Page, in addition to or in combination with oﬀers for Online Cash Back Rewards or In-Store Cash Back Rewards. For example, RetailMeNot may oﬀer certain Bonus Rewards to new members who earn an Online Cash Back Reward for the ﬁrst time or earn certain Online Cash Back Rewards for the ﬁrst time. In order to earn a Bonus Reward, you must satisfy all criteria set forth for earning the Bonus Reward as well as the requirements of these Promotion Terms during the promotion period for the Bonus Reward. RetailMeNot, in its sole discretion, may adjust the promotion period and/or the bonus amount for Bonus Reward, at any time, without notice. All decisions by RetailMeNot are ﬁnal and binding on you. Bonus Rewards are a limited time oﬀer and all criteria must be satisﬁed within the dates of the Promotion. Returns, Approvals, and No Ownership. For any Rewards Oﬀer, if you return or exchange the items purchased, complete your purchase before or after the Promotion Period, initiate a purchase that results in a chargeback, or fail to satisfy a Minimum Purchase Amount, or any other conditions speciﬁed on the Promotion Landing Page or Rewards Oﬀer Card, RetailMeNot reserves the right to invalidate or withdraw all or part of the Rewards Oﬀer, or reclaim Reward earnings. The determination of whether or not a purchase qualiﬁes for the Rewards Oﬀer and whether applicable conditions have been satisﬁed is at the sole discretion of RetailMeNot. In the event of a dispute, you may be required to provide your order conﬁrmation as proof of purchase. Order confirmations must be provided within six (6) months from the purchase date to qualify for this review. The timing of when RetailMeNot will issue an Approved Reward will vary based on a number of factors. These factors may include the type of Promotion pursuant to which a Reward is oﬀered and your account activity as a member of RetailMeNot. RetailMeNot reserves the right, in its sole discretion, to determine the order and timing in which to process its conﬁrmation of eligible purchases. Rewards may be limited where participation exceeds the Total Rewards Oﬀers available during Promotion or in other cases, as determined by RetailMeNot in its sole discretion. RetailMeNot also reserves the right, in its sole discretion, to reevaluate Approved Rewards, at any time, without notice, including, but not limited to, whether purchases qualify for the Promotion and whether applicable conditions have been satisﬁed, and RetailMeNot, in its sole discretion, may adjust or withdraw any Rewards Oﬀers or any Approved Rewards (or reclaim Reward earnings), at any time, without notice. All decisions by RetailMeNot are ﬁnal and binding on you. Participating in a Rewards Oﬀer does not give you ownership or any other legal claim to any Reward unless and until RetailMeNot, in its sole discretion, determines that you have met all eligibility criteria and fulﬁlled all requirements for the Promotion and you have completed the Redemption Process. Rewards Oﬀers are provided solely by RetailMeNot and are not underwritten or funded by any other third party. You may not make any claims for Rewards Oﬀers against Merchants or any other third party. Notwithstanding that Rewards Oﬀers may include oﬀers of cash, prior to redemption, Rewards Oﬀers and Approved Rewards have no monetary value and you may not obtain any money or any other thing of value for any Approved Reward or participation in any Rewards Oﬀer unless and until you complete the Redemption Process and a payment has been issued by RetailMeNot for Approved Rewards. Wallet and Redeeming Rewards. Approved Rewards will be shown in the RetailMeNot Rewards Wallet. You have no vested rights in Approved Rewards unless and until you complete the Redemption Process. If your RetailMeNot account is terminated by RetailMeNot, as provided in these Promotion Terms or the Terms of Use, or if you elect to close your RetailMeNot account, you will no longer be permitted to access the Rewards Wallet or redeem Approved Rewards shown therein. You may redeem Approved Rewards for cash using PayPal or Venmo. Redeeming for cash to Paypal or Venmo. In order to redeem Approved Rewards for cash via PayPal or Venmo, you must: (1) have or create a PayPal or Venmo Account that is linked to the phone number or email address, where applicable, that RetailMeNot has on ﬁle for you; (2) navigate to the “My Rewards” section of your account, click “Redeem Rewards”, and then click either “Paypal” or “Venmo”, as applicable; and (3) perform any actions speciﬁed in the RetailMeNot app or website, as modiﬁed from time to time in the sole discretion of RetailMeNot. For example, such actions may include, but are not limited to, authenticating your account by providing a US based cell phone number with SMS capabilities, re-entering a password, and clicking the appropriate link or button. Once you have completed the required steps to redeem Approved Rewards, RetailMeNot will issue a payment to the PayPal or Venmo Account, as applicable, that is linked to the email address, or phone number, as applicable, that you provided RetailMeNot at the time you created your account. An email or text message, where applicable, will be sent to that email address or phone number, where applicable, conﬁrming that the payment has been issued. Generally, redemption of an Approved Reward will result in the issuing of payment within minutes, but in some cases may require a longer time period. RetailMeNot is not responsible for lost or stolen payments or for delivery of payments to the wrong PayPal or Venmo account. If an account has not been credited with a Qualifying Transaction in the previous 12 months, it may be deemed an Inactive Cash Back Account. Accounts which meet this criteria will be debited a monthly maintenance fee in the amount of the lesser of $2.00 or the current account balance. Maintenance fees will not draw the account balance below $0.00. Maintenance fees will be assessed until the account balance reaches $0.00 or the account becomes an active cash back user again. Forced Redemptions. You are responsible for ensuring compliance with any limitations or requirements speciﬁed by RetailMeNot from time to time, including, but not limited to, requirements not to redeem Approved Rewards that exceed amounts speciﬁed by RetailMeNot. RetailMeNot reserves the right, in its sole discretion, from time to time, to cause the redemption of Approved Rewards, in whole or in part, and issue payments to the PayPal or Venmo account linked to the email address or phone number that you provided RetailMeNot at the time you created your account, but RetailMeNot undertakes no obligation to do so under any circumstances. You hereby authorize RetailMeNot to perform any such redemptions and issue any such payments to the PayPal or Venmo account linked to the email address or phone number that you provided RetailMeNot at the time you created your account, automatically and without further action by you. Abuse and Cancellations. RetailMeNot reserves the right to cancel, suspend and/or modify a user’s account, entire Promotion, or any part of it, or the payment of any Rewards amounts at any time without obligation or notice to you, including, without limitation, if any fraud, technical failures, limit of available Rewards, gaming, human error or any other factor impairs the integrity, availability or proper functioning of the Promotion, as determined by RetailMeNot in its sole discretion. Without limiting anything in these Promotion Terms or the Terms of Use, RetailMeNot reserves the right, in its sole discretion, to disqualify, terminate or suspend the participation in any Promotion, or otherwise prevent future participation, of any individual it ﬁnds, or reasonably suspects, to be tampering with the operation of a Promotion (including by submitting or attempting to submit fraudulent or ineligible Receipts) or to be acting in violation of the Promotion Terms or any promotion, or in behaving in an unethical, dishonest, deceptive or disruptive manner. Any attempt by any person to deliberately undermine the legitimate operation of the Promotion may be in violation of criminal and civil law, and, should such an attempt be made, RetailMeNot reserves the right to seek damages from any such person to the fullest extent permitted by law. RetailMeNot shall not be liable to you for any suspension, modiﬁcation or termination of a Rewards Oﬀer, Approved Rewards, or the Promotion program. Use of any automated means or more than one account is prohibited and will result in disqualiﬁcation. In the event of any dispute as to the qualiﬁcation of potential recipients of a Reward, the authorized account holder of the email address or phone number provided to RetailMeNot at the time the account was created will be deemed the qualiﬁed Reward recipient. The “authorized account holder” is the natural person assigned an email address by an Internet access provider, online service provider or other organization responsible for assigning email addresses for the domain associated with the submitted address. Each potential recipient of Rewards may be required to show proof of being an authorized account holder. If your account remains inactive for 24 months, RetailMeNot reserves the right to permanently close the Account at which time the cash back rewards will be considered expired and will no longer be eligible for redemption. Before closing the Account, RetailMeNot will attempt to alert you to the fact that your account may be shut down due to inactivity. Premium Services: Certain Services provided by Ziff Davis require registration and payment (such Services are referred to collectively as the “Premium Services”). You are responsible for paying any and all charges relating to your Premium Services account, including without limitation, periodic subscription fees (the initial fee and automatic renewals). You grant to Ziff Davis’ third party payment processor(s) permission to charge your credit card (or other approved payment mechanism) to pay for all such charges. The Premium Service subscription fee will be billed at the beginning of your subscription and on each annual, quarterly or monthly renewal thereafter, dependent on the original subscription term selected at registration, unless you cancel at least ten (10) days prior to the renewal date pursuant to the process set forth below. If Ziff Davis does not receive payment from the credit card issuer or its agent, you agree to pay all amounts due upon our demand. Your card issuer agreement governs your use of your designated card in connection with the Premium Services, and you must refer to that agreement and not this Agreement to determine your rights and liabilities as a cardholder. YOU, AND NOT ZIFF DAVIS, ARE RESPONSIBLE FOR PAYING ANY AMOUNTS BILLED TO YOUR CREDIT CARD BY A THIRD PARTY, EVEN IF THEY WERE NOT AUTHORIZED BY YOU. For CNET Cash Back and Rewards Services Acceptance of terms. By using the Services, you acknowledge that you have read and understood these terms and conditions, and that you agree to be legally bound by all of them. You also acknowledge that you have had an opportunity to review and agree to the terms of our Privacy Policy. If you do not agree to all of these terms and conditions, you may not participate in or use the Services. Eligibility. You represent and warrant that you are at least eighteen (18) years of age. If you are under age eighteen (18), you may not, under any circumstances or for any reason, use the Services. Rewards. The Services enable you to access and earn rewards, subject to the guidelines herein (“Services”). CNET offers users opportunities to earn cash back on their purchases from Merchants activated by the creation of trackable links (“Links”) for a Merchant as a way to incentivize the purchase and promotion of the Merchant’s products. Links are configured to track and attribute transactions to you so that you may earn a reward if you or someone to whom you send a Link completes a qualifying transaction with a Merchant. The CNET cashback program is an incentive and promotional program. Some transactions may not earn rewards or may earn at a rate different from the rate indicated by the Service. You are not guaranteed to earn a reward from a transaction for several reasons, without notice to you, including, without limitation: Merchants may alter terms, conditions, or commission rates. Merchants may discontinue their programs. Merchants may exclude certain products from Reward eligibility. Merchants may have technical failures which result in transactions failing to be tracked or attributed to you. Links may fail to function properly. Links may be disabled by web browsers or ad blockers. Merchants may reject transactions due to suspected policy violations. Other: charge-backs, product returns, accounting error, Merchant non-payment, fraudulent transactions, our inability to contact you to validate transactions, your inappropriate distribution of Links, or your failure to comply with Merchant policies. If the Merchant pays less than the expected amount or does not pay a commission for the transaction, we reserve the right, in our sole discretion, to adjust or cancel the reward. Furthermore, we reserve the right, in our sole discretion, to withhold, cancel or adjust the amount of any reward, for any reason at any time. By using the Services, you accept this condition. CNET may assign its rights and obligations hereunder to any person, including any affiliate, without your consent. Payout timing. We only provide a reward to you after a transaction is successfully tracked and completed, after we receive payment for that specific transaction from the Merchant, and after you accrue the Minimum Redemption Amount (as defined below). Merchants usually have holdback periods during which they hold a pending payment (for example, until the expiration of a return policy and/or until a service is consumed). Rewards remain in a pending state until we receive payment from the Merchant for the associated transaction. After we receive payment and you have accrued the Minimum Redemption Amount, you may request to redeem your rewards. Payout Threshold. A minimum approved balance of $10.00 is required for redemption (the “Minimum Redemption Amount”). This amount may change from time to time, in our sole discretion, without notice to you. If your balance is below the Minimum Redemption Amount, rewards will be stored in a record on your account and may be subject to a Dormant Account Fee (as defined below). Once you have accrued the Minimum Redemption Amount, rewards may be redeemed for third-party merchant gift cards. Use of a third-party merchant gift card at a selected merchant will be subject to such merchant’s and/or the gift card issuer’s own terms of service. Coupons. Some rewards may include coupons, discounts or promotions from Merchants (“Offers”). We do not guarantee that Merchants will honor Offers. Offer codes may be expired or invalid. Offers may not be eligible for your transaction, based upon exclusions, terms and conditions determined by Merchants. Offers are not redeemable for any value with CNET. Dormant accounts. If you have pending rewards and your account has no new activity (defined as the earning of a pending reward) for a period of one hundred and eighty (180) days, we reserve the right to assess a monthly Dormant Account Fee of up to $5.00 USD, until such time as your reward balance reaches $0.00, to recover the cost associated with maintenance of the account. Any Dormant Account Fee we apply may or may not be displayed in your user dashboard. If your account has no new activity for a period of twelve (12) months, we reserve the right to void any remaining balance of rewards in your account. Tax. You are solely responsible for independently assessing and complying with all relevant tax and legal requirements. We shall not provide you with tax or legal advice. Cookies. Some Merchants may place cookies (or other tracking beacons) on your device to recognize your device during a subsequent visit. If you, or those clicking on your shared Link, block or delete cookies, tracking and attribution may be inoperable, in which case no reward shall be earned. Third-Party Services. We do not endorse, warrant or guarantee the products, services or content of Merchants or other third parties. We are not an agent, broker or otherwise responsible for any Merchant’s activities, policies, products or services. For Spiceworks and Lead Generation Related Services: Except as otherwise set forth herein, the Service is made available to you for: (a) your personal use; (b) your internal business use; or (c) if you are a Managed Service Provider (“MSP“), or Value Added Reseller (“VAR”), use in connection with the commercial support of your customers, in compliance with all applicable laws, rules, and regulations. If you want to make any other commercial use of the Service, including but not limited to selling, distributing, or providing access to the Service for payment, you must enter into a separate written agreement with Spiceworks or obtain Spiceworks’ written permission in advance. Access to and use of portions of the Service may require you to open an account (including setting up a Spiceworks ID and password). To register, you must provide a valid email address as a Spiceworks ID. You are entirely responsible for maintaining and promptly updating your registration data to keep it accurate and complete. You are entirely responsible for maintaining the confidentiality of your account information, including your password, and for any and all activity that occurs under your account. You agree to notify Spiceworks immediately of any unauthorized use of your account or password, or any other breach of security. However, you will be responsible for losses incurred by Spiceworks or any other user of the Service due to someone else using your Spiceworks ID, password, or account. You, not Spiceworks, has sole responsibility for the accuracy, quality, integrity, legality, reliability, appropriateness, and intellectual property ownership or right to use of all your data, and Spiceworks is not responsible or liable for the deletion, correction, destruction, damage, loss, or failure to store any of this data. You will not knowingly send or store spam, unlawful, infringing, obscene, or libelous material, or viruses, worms, Trojan horses, and other harmful code. You may not use anyone else’s Spiceworks ID, password, or account at any time without the express permission and consent of the holder of that Spiceworks ID, password, or account. Spiceworks cannot and will not be liable for any loss or damage arising from your failure to comply with these obligations. By providing us with your email address, you agree to receive all required notices electronically, to that email address. You agree that any notices, agreements, disclosures, or other communications that we send to you electronically will satisfy any legal communication requirements, including that those communications be in writing. If you choose to complete a Spiceworks user profile, a project page, or a profile page, you agree to accurately represent yourself, your background and experience, your work history and company affiliation, your certifications and areas of expertise, and any other personal or company information you chose to share. You also agree not to impersonate any person, company, or entity, or falsely state or otherwise misrepresent yourself, your age, or your affiliation with any person, company, or entity. Please notify us immediately of any compromise or unauthorized use of your account by emailing security@spiceworks.com. We also have a Help and Support Center where security bulletins are posted. You are solely responsible for the photos, profiles, messages, notes, text, information, music, videos, plugins, source code, computer software, and other content that you upload, publish, submit, share, link to, or display (hereinafter, “post“) on or through the Service, or transmit to or share with other Members (collectively the “User Content“). You understand and agree that Spiceworks may, but is not obligated to, review and delete or remove (without notice) any User Content in its sole discretion, including without limitation User Content that in Spiceworks’ sole judgment violates the Agreement or which might be offensive, illegal, or that might violate the rights, harm, or threaten the safety of Members, users, or others. Spiceworks reserves the right to disclose any information or take any action necessary to satisfy any applicable law, regulation, legal process, or governmental request, or to protect the rights, property, or safety of Spiceworks, its users, and the public. You understand and agree that you may be exposed to such matters and that you waive your right to any damages (from any party) related to such exposure. When you post User Content, you shall be subject to any posted guidelines and/or rules applicable to the Spiceworks online community, including, but not limited to, the Spiceworks Community Rules & Guidelines, which may be updated from time to time. Spiceworks does not represent or endorse the accuracy or reliability of any User Content or other material posted on any interactive area or elsewhere on the Services and you acknowledge that any reliance upon such User Content or other material shall be at your sole risk. Any User Content or other material placed on any interactive area by users represents the views of the user posting the statement, and does not represent the views of Spiceworks. You also hereby grant each Member or user a non-exclusive license to access the User Content you post through the Service, and to use, reproduce, distribute, prepare derivative works of, display and perform that content as permitted through the functionality of the Service and the Site and under the Agreement. Notwithstanding the foregoing, to the extent your User Content consists of data inputted by you or your users into the Web-based Offering, the Desktop, or through use of a Tool for the purpose of facilitating your use of the applicable Web-based Offering, the Desktop, or the Tool, the licenses set forth in the preceding two paragraphs are limited to Spiceworks’ use of that data for your benefit (e.g., to make available or support your use of the Web-based Offering, Desktop, or Tool), in aggregated, anonymized, or de-identified form that does not identify you or your company individually and for other uses required by law. If you download, install, or access the Desktop or Tools, the following provisions apply to you. License. The Desktop and Tools are licensed, not sold, to you for use only under the terms of the Agreement. Subject to the terms and conditions of and your ongoing compliance with the Agreement, including without limitation payment of the applicable fees (if any), Spiceworks hereby grants you a personal, limited, revocable, non-exclusive, non-transferable license to download, install, and use the Desktop or Tools on equipment or compatible devices owned or controlled by you or your Consenting Users, and in each case solely for your personal, non-commercial use, or, if you are an entity rather than an individual, to allow your employees and contractors to use the Desktop for the sole benefit of you and your Consenting Users, if each of those employees or contractors has agreed to and is bound by the Agreement. “Consenting Users” means individuals who have authorized you to use the Desktop or Tools in connection with and install any related components on equipment or compatible devices that they own or control for the purposes of collecting Collected Data and who have agreed to be bound by the terms of the Agreement. The scope of the license granted under the preceding paragraph does not include the right to use the Desktop or Tools in connection with, in any manner, the following types of information: (a) payment card information or any information governed under the Payment Card Industry Data Security Standard; (b) “nonpublic personal information” as the term is defined in 15 U.S.C. § 6809 or other information subject to any applicable financial privacy law; (c) protected health information, as the term is defined in 45 C.F.R. 160.103; (d) Social Security numbers; or (e) with regard to the processing of personal data subject to Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, “sensitive” personal data. The foregoing data constitutes “Prohibited Data.” Automatic Updates. The Desktop or Tools may communicate with Spiceworks’ servers to check for available updates to the software, such as bug fixes, patches, enhanced functions, missing plugins and new versions. During this process, the Desktop or Tools may send Spiceworks a request for the latest version information. By installing the Desktop or Tools, you hereby agree to automatically request and receive updates from Spiceworks’ servers. Some personal firewall programs may be configured in such a way as to prevent the Desktop or Tools from receiving these updates. If the computer on which you install the Desktop or Tools is so configured, it may be necessary for you to make an exception entry in the configuration of the personal firewall program to allow the Desktop or Tools to successfully install and receive these updates.If you have comments on the Service or ideas on how to improve it, please send email to support@spiceworks.com. For IGN Services: When using IGN Services, you shall be subject to any posted guidelines or rules applicable to such Services, including but not limited to the Comment Culture and Moderation and Community How To’s and FAQ’s policies which can be found under IGN Community Central. All such guidelines or rules are hereby incorporated by reference into these Terms. Ziff Davis currently provides IGN users with access to a variety of Services, including but not limited to, community boards, user pages, wikis, and blogs. Unless explicitly stated otherwise, any new features or services shall be subject to the Agreement. In order to use certain Services, you will be required to register with IGN. Customer Service. For questions about IGN or the IGN Plus service, please visit the IGN FAQ or contact IGN Support. Payment Obligation and Credit Card Authorization. You are responsible for paying any and all charges relating to your Premium Services account, including without limitation, periodic subscription fees (the initial fee and automatic renewals). You grant to Ziff Davis’ third party payment processor(s) permission to charge your credit card (or other approved payment mechanism) to pay for all such charges. The Premium Service subscription fee will be billed at the beginning of your subscription and on each annual, quarterly or monthly renewal thereafter, dependent on the original subscription term selected at registration, unless you cancel at least ten (10) days prior to the renewal date pursuant to the process set forth below. For IGN Plus, payment must be made by Visa, MasterCard, American Express, PayPal or other options as listed on the relevant commerce platform. For the PC Mag Premium Service, payment must be made by Visa, MasterCard, American Express or Discover. If Ziff Davis does not receive payment from the credit card issuer or its agent, you agree to pay all amounts due upon our demand. Your card issuer agreement governs your use of your designated card in connection with the Premium Services, and you must refer to that agreement and not this Agreement to determine your rights and liabilities as a cardholder. YOU, AND NOT ZIFF DAVIS, ARE RESPONSIBLE FOR PAYING ANY AMOUNTS BILLED TO YOUR CREDIT CARD BY A THIRD PARTY, EVEN IF THEY WERE NOT AUTHORIZED BY YOU. Renewal and Cancellation of Your Subscription. You grant to Ziff Davis’ third party payment processor(s) permission to automatically renew your subscription and charge your account up to seven (7) days prior to the day on which your subscription is scheduled to end. You acknowledge and agree that the authorization to charge your credit card or other payment mechanism for the Premium Services shall automatically transfer to any successors or assigns of the Premium Services for substantially similar services at the same property. You may not assign or transfer your subscription to any other person or entity. You must be at least 18 years old (or have the permission of a credit card holder who is) to subscribe for Premium Services. Cancellation of IGN Plus. For the IGN Plus, you may “opt out” of this automatic renewal by visiting your Account Settings or the IGN Support. All fees, charges and sales are final. Once charged to your credit card, the payments are nonrefundable, except in cases of demonstrated fraud, which will be determined at Ziff Davis’ sole discretion. You acknowledge that canceling your subscription for any reason will not immediately terminate access to the IGN Plus and Ziff Davis will not refund the remaining portion of your subscription. Your subscription will remain open until the paid period expires. Trial Memberships. Ziff Davis may occasionally offer promotional trial memberships to IGN Plus at special discounted prices. If you sign up for a trial membership, you will be automatically renewed at the normal subscription rate for IGN Plus at the end of the trial period, unless you cancel at least twenty-four (24) hours before the end of the trial. You must cancel prior to the end of your trial to avoid charges to your credit card. We will continue to bill your credit card for the IGN Plus at the standard IGN Plus rate and renewal term thereafter, dependent on the original subscription term selected at registration, until you cancel. For information about canceling your IGN Plus subscription, visit the IGN Support Center. ZIFF DAVIS RESERVES THE RIGHT, AT ANY TIME, TO CHANGE ITS FEES AND/OR BILLING METHODS, INCLUDING THE ADDITION OF SUPPLEMENTAL FEES OR SEPARATE CHARGES FOR CONTENT, OR SERVICES PROVIDED BY ZIFF DAVIS, EFFECTIVE THIRTY (30) DAYS AFTER AN ONLINE POSTING ON THE APPLICABLE ZIFF DAVIS SERVICES. ZIFF DAVIS MAY ADDITIONALLY PROVIDE NOTICE OF BILLING CHANGES VIA EMAIL. YOUR CONTINUED USE OF THE PREMIUM SERVICES FOLLOWING THE EFFECTIVE DATE OF A CHANGE TO SUCH FEES AND BILLING METHODS SHALL CONSTITUTE YOUR ACCEPTANCE OF SUCH CHANGE. ZIFF DAVIS IS NOT RESPONSIBLE FOR ANY FAILURE TO CANCEL YOUR SUBSCRIPTION EITHER IN WRITING BY EMAIL OR LETTER OR THROUGH THE WEBSITE. YOU AGREE AND ACKNOWLEDGE THAT ZIFF DAVIS SHALL NOT BE RESPONSIBLE FOR ANY ADJUSTMENTS, REFUNDS OR ACCOUNT OVERSIGHTS THAT YOU HAVE NOT SUBMITTED TO US AS DESCRIBED IN THESE TERMS WITHIN 60 DAYS OF SUCH OCCURRENCE OR LACK THEREOF. Termination of Your Subscription. You acknowledge that Ziff Davis, in its sole discretion, may terminate your user ID, password, account (or any part thereof) or use of the Premium Services for a variety of reasons, including, without limitation, if Ziff Davis believes that you have violated or acted inconsistently with the letter or spirit of the Agreement. Ziff Davis may also, in its sole discretion, at any time discontinue providing the Premium Services, or any part thereof, with or without notice. You agree that any termination of your access to the Premium Services under any provision of the Agreement may be effected without prior notice, and acknowledge and agree that Ziff Davis may immediately deactivate or delete your account and/or bar any further access to the Premium Services. If your account is terminated by Ziff Davis, it will not be automatically renewed and access will be terminated, without refund. Further, you agree that Ziff Davis shall not be liable to you or any third-party for termination of your access to the Premium Services. YOU AGREE AND ACKNOWLEDGE THAT ZIFF DAVIS SHALL NOT BE RESPONSIBLE FOR ANY ADJUSTMENTS, REFUNDS OR ACCOUNT OVERSIGHTS PAST SIXTY (60) DAYS OF SUCH OCCURRENCE. Subscriber Information. You agree to provide and maintain true, accurate, current and complete information about yourself as prompted by the Premium Services registration process. You must promptly inform Ziff Davis of any of the following: changes in the expiration date of any credit card used in connection with the Premium Services; changes in home or billing address; and apparent breaches of security, such as loss, theft, or unauthorized disclosure or use of an ID or password. You agree to notify Ziff Davis immediately upon learning of any potential breach of your Premium Services account. Use Restrictions. The material and content on the Premium Services is for the private, non-commercial enjoyment of Premium Services Members only. Any other use is strictly prohibited. Ziff Davis spends a great deal of time and money to obtain the information appearing on our sites. You agree that you will not intentionally or unintentionally copy, publish, or in any way make available publicly any news, pictures, interviews, features, or any other information, content or materials from the Premium Services, without express written permission from Ziff Davis. You agree that if you do so, Ziff Davis reserves the right to cancel your subscription to the Premium Services immediately without refund. Additionally, reuse of copyrighted information (including but not limited to pictures, interviews, features, videos, audio, etc.) will be prosecuted to the fullest extent of the law. 2. Your Use of Content You acknowledge that the Services contain information, software, articles, reviews, content, photographs, audio and video clips, graphics, links, logos, trademarks, the “look and feel” of our websites, applications and software and other material (collectively, the “Content”) protected by copyright, trademark and/or other proprietary rights of Ziff Davis or third parties. All Content on the Services is protected by applicable copyright laws. You agree to comply with all copyright laws and any copyright notices, information, or restrictions contained in any Content available on or accessed through the Services. Users of the Services may use the Content only for their personal, noncommercial use. Businesses, organizations or other legal entities may not become Members, and are not permitted to use the Services for any purpose, including but not limited to collecting usernames and/or email addresses of Members by electronic or other means for the purpose of sending unsolicited email and unauthorized framing of, or linking to, the Services or users on the Services. Please refer to our Linking Policy for more information on linking and use of Content. Except as expressly permitted, you may not (i) modify, publish, transmit, reproduce, create derivative works from, distribute, perform, display, adapt, aggregate, sell, transfer or in any way exploit any of the Content, code or Material (defined below), in whole or in part, (ii) use any robot, spider, site search and/or retrieval application, or other device to crawl, scrape, database scrape, screen scrape, harvest, gather, extract, retrieve or index any portion of the Services, or (iii) use any text, code, image, audio, video, or other content from any portion of the Services (a) for data set creation, analysis, or manipulation (including activities sometimes called “data mining,” “text and data mining,” or “TDM”) and/or (b) in connection with the development or operation of any software program, including but not limited to any artificial intelligence or machine learning model, software, or process (such as training, fine-tuning, embedding, and the like), either directly or indirectly, including through a third party (including use of a third-party dataset created in any part by prohibited means). Content consisting of downloadable or web-based software may not be reverse engineered unless specifically authorized by the owner of the software’s patent and/or copyright. You also agree not to circumvent, disable or otherwise interfere with any security related features of the Services or the Content, including features that prevent or restrict use or copying, or that enforce limitations on use. You may not probe, scan, or test the vulnerability of the Service or any network connected to the Service, nor breach the security or authentication measures of the Service or any network connected to the Service. You may not reverse look-up, trace, or seek to trace any information on any other user of or visitor to the Service, or any other customer, including any account not owned by you, to its source, or exploit the Service or any service or information made available or offered by or through the Service, in any way where the purpose is to reveal any information, including but not limited to personal identification or information, other than your own information, as provided for by the Service. You agree not to use any device, software, or routine to interfere or attempt to interfere with the proper working of the Service or any transaction being conducted on the Service, or with any other person’s use of the Service. You may not forge headers or otherwise manipulate identifiers in order to disguise the origin of any message or transmittal you send to us on or through the Service or any service offered on or through the Service. You may not pretend that you are, or that you represent, someone else, or impersonate any other individual or entity. You may not use the Service or any Content for any purpose that is unlawful or prohibited by these Terms of Use, to solicit the performance of any illegal activity, or for other activity that infringes our rights or others. You may only post on the Services content owned by you (such as your original statements or video clips), content for which you have received express written permission from the owner and content in the public domain (collectively, the “Material”). You assume all risk and responsibility for determining whether any Material is in the public domain. You hereby grant, transfer and assign to Ziff Davis and its affiliates, successors, assigns and licensees (collectively, “Licensee”) a fully-paid, royalty-free, irrevocable, perpetual, worldwide right and license to publish, distribute, reproduce, transmit, use, translate, display, perform, modify, revise, create derivative works of and archive the Material, in any form or media now known or hereafter developed (including without limitation in print, magnetic or electronic form), including, but not limited to, as part of the Services or in support of the Services through advertising or marketing, on any number of occasions in any form, and to sublicense third parties (including other users of the Services) to do any of the foregoing with further right of sublicense (the “License”), without credit, payment or compensation to you and without seeking further permission from you. You represent and warrant that you are authorized to grant all rights set forth in the preceding sentence and that the exercise by Licensee of Licensee’s rights under the License shall not violate any laws, defame or libel any person, invade any person’s right of privacy or publicity or otherwise violate, misappropriate or infringe the rights of any person (including but not limited to any copyright or moral right). You agree that you are solely responsible for the Material that you post on the Services or transmit to others and agree that you will not hold Company responsible or liable for any materials or content you access or receive from other users of the Services. You may download, copy and make any personal, non-commercial use of the Content and use that is expressly permitted by the United States Copyright Act of 1976, as amended (“Copyright Act”) and not prohibited by any section of the Copyright Act or by any other applicable law, rule or regulation; provided, however, that you maintain all copyright and other notices contained in such Content; and provided further that you shall not store electronically any significant portion of any Content. To the extent that you provide us with any suggestions, feedback or other information relating to our business or the Services (including, but not limited to, suggested new products or services or improvements to existing products and services), such information is provided to us on a non-confidential and unrestricted basis, and you hereby grant to the Licensee (as defined above) a non-exclusive, worldwide, perpetual, royalty-free, fully transferrable and sublicensable right and license to reproduce, display, distribute, use and fully exploit such suggestions, feedback and information. For questions regarding use of Content please email Brand_Licensing@ziffdavis.com. 3. Rules of Conduct Ziff Davis has the right, but not the obligation, to investigate any illegal and/or unauthorized use of the Services and appropriate legal action may be taken, including without limitation, civil, and injunctive relief. While utilizing the Services, you may not: Use the Services for any commercial purpose, to distribute any advertising or solicitation of funds or goods and services, or to solicit users to join competitive online services; Post on the Services any links to any external Internet sites that are obscene or pornographic, or display pornographic or sexually explicit material of any kind as determined by Ziff Davis; Post or transmit through the Services any Material that violates or infringes another person’s intellectual property rights (including, but not limited to, third party music, videos, photos or other materials where you do not have written authority from the owner to post or transmit such materials); Post or transmit any Material that contains any advertising, promotional materials, “junk mail”, “spam”, “chain letters”, “pyramid schemes” or any other form of solicitation as determined by Ziff Davis; Reformat, frame or mirror any portion of any web page that is part of the Service; Post Material containing restricted or password only access pages, or hidden pages or images (those not linked to or from another accessible page); Submit any Material that impersonates a person or entity, falsely implies sponsorship or endorsement of that Material by the Services, Ziff Davis and/or any third party, falsify or delete any author attributions in any Material, or promote any information that you know is false or misleading; Transmit any viruses, worms, defects, Trojan horses or other items of a contaminating or destructive nature through the Services or otherwise attempt to interfere with the proper working of the Service or the use and enjoyment of the Services by other users; Promote an illegal or unauthorized copy of another person’s copyrighted work, such as providing pirated computer programs or videos or links to them, providing information to circumvent manufacture-installed copy-protect devices, or providing pirated music or links to pirated music files; Submit Material, or engage in any activity, that is libelous, defamatory, obscene, pornographic, abusive, harassing, threatening, unlawful, or violates the rights of any third party (including their rights of privacy or publicity) or that promotes or encourages illegal activity, racism, bigotry, hatred, physical harm or discrimination of any kind against any group or individual; or Harvest or collect email addresses or other contact information of other users by electronic or other means. The above is not a complete list of illegal and/or prohibited uses of the Service. Use of the Services is subject to existing laws and legal processes. Nothing contained in the Agreement shall limit our right to comply with governmental, court, and law-enforcement requests or requirements relating to your use of the Services. 4. Managing Content Despite our rights outlined herein, you shall remain solely responsible for all Material you post. Ziff Davis has no obligation to evaluate, pre-screen and/or monitor the Material you post, however Ziff Davis reserves the right to edit or remove any Content or Material on the Services, in whole or in part, and to disclose any information or take any action necessary to satisfy any applicable law, regulation, legal process or governmental request or to protect the rights, property or safety of Ziff Davis, its users and the public. You understand and agree that you may be exposed to such matters and that you further waive your right to any damages (from any party) related to such exposure. Ziff Davis has the right, but not the obligation, to take any of the following actions in our sole discretion at any time and for any reason without giving you any prior notice: Restrict, suspend, or terminate your access to all or any part of our Services; Change, suspend, or discontinue all or any part of our Services; Refuse, move, edit or remove any Material for any reason; Refuse, move, edit or remove any Content that is available on the Services; Deactivate or delete your account(s) and all related information and files in your account(s); Disclose your identity or other information about you to any third party who claims that Material posted by you violates their legal rights, including, but not limited to, their intellectual property rights or their rights of privacy or publicity; Disclose your identity or other information about you to law enforcement officials upon request if Ziff Davis determines in its sole discretion that such disclosure is in the interest of protecting its users or the public; Establish general practices and limits concerning use of our sites and Services. You agree that Ziff Davis will not be liable to you or any third party for taking any of these actions. You understand and agree that our Services may include communications such as advertisements, service announcements and administrative messages from us or from our partners, and that these are considered part of the Services. 5. Endorsement ZIFF DAVIS MAY RECEIVE A COMMISSION, FEE AND/OR OTHER COMPENSATION ON SOME CLICKS OR PURCHASES MADE ON, THROUGH OR LINKED FROM THE SERVICES. THIS MEANS ZIFF DAVIS MAY RECEIVE SOME FORM OF COMPENSATION THROUGH AN ARRANGEMENT IT HAS WITH A THIRD PARTY IF YOU (i) CLICK ON CERTAIN ADS OR LINKS ON OUR WEBSITES, EMAILS OR NEWSLETTERS, OR (ii) PURCHASE A PRODUCT OR SERVICE AFTER CLICKING A LINK. Ziff Davis does not represent or endorse the accuracy or reliability of any Content or other material posted on any interactive area or elsewhere on the Services and you acknowledge that any reliance upon such Content or other material shall be at your sole risk. Any Content or other material placed on any interactive area by users represents the views of the user posting the statement, and does not represent the views of Ziff Davis. The Services may contain links to sites on the Internet which are owned and operated by third parties (the “External Site(s)”). You acknowledge that Ziff Davis is not responsible for the availability of, or the content located on or through, any External Site, and that your use of such External Sites may be subject to a third party’s terms and conditions and/or privacy policy. Any third-party content or a link to a third-party site is not an endorsement of that content or third-party site. You should contact the site administrator or webmaster for those External Sites if you have any concerns regarding such links or the content located on such External Sites. Typically, we do not directly sell, resell, or license any of the products or the services that we review, list, or advertise on our sites, and we disclaim any responsibility for or liability related to them. Your correspondence or related activities with third parties, including payment transactions and goods-delivery transactions, are solely between you and that third party. All product and deal information such as discount, price and availability are believed to be accurate as of the time of publication and are subject to change. Please verify these details with the merchant site and check the merchant’s terms and conditions before you buy. You agree that we will not be responsible or liable for any loss or damage of any sort incurred as the result of any of your transactions with third parties. Any questions, complaints, or claims related to any product or service should be directed to the appropriate vendor. However, in the event we do sell, resell, or license products or services, any terms and conditions related to your purchase or license of such products and services from us or any affiliates will be accessible on the applicable site page. Please note that we may allow certain manufacturers to license, use and/or reprint a Ziff Davis trademark, logo, or a review in whole or in part, in its own marketing materials and advertisements in exchange for a license fee. 6. Indemnification You agree to indemnify, defend and hold Ziff Davis and its affiliates, and their respective officers, directors, owners, agents, information providers and licensors (collectively, the “Ziff Davis Parties”) harmless from and against any and all claims, liability, losses, damages, costs and expenses (including attorneys’ fees) incurred by any Ziff Davis Party in connection with: Your use of, or connection to, our Services; Any use or alleged use of your accounts or your passwords by any person, whether or not authorized by you; The content, the quality, or the performance of Material that you submit; Your violation of the Agreement or our privacy policies; Your violation of the rights of any other person or entity; or Your violation of any applicable laws, rules or regulations. Ziff Davis reserves the right, at its own expense, to assume the exclusive defense and control of any matter otherwise subject to indemnification by you, and in such case, you agree to cooperate with Ziff Davis’ defense of such claim. You may not settle any claim covered by this indemnification provision without our prior written approval. 7. Termination of Service Ziff Davis reserves the right, in its sole discretion, to restrict, suspend or terminate your access to all or any part of the Services, including the discussion areas, at any time for any reason without prior notice or liability. Conversely, you may terminate your access to the Services at any time by immediately ceasing use of the Services. If you would like to delete a particular account on the Services, please review the What Can I Do to Control My Information? section of the applicable business privacy policy and use the contact instructions for the particular property where you with to delete your account. Once your access terminates, you will have no right to use the Services. The terms of the Agreement shall survive any termination of your access. Ziff Davis may change, suspend or discontinue all or any aspect of the Services at any time, including the availability of any feature, database, or Content (including the discussion areas), without prior notice or liability. 8. Copyright Policy You may not post, distribute, perform, display, transmit or reproduce in any way any copyrighted material, trademarks, or other proprietary information without obtaining the prior written consent of the owner of such proprietary rights. Ziff Davis has registered a designated agent with the Copyright Office pursuant to 17 U.S.C. §512(c). If you believe that your work has been copied and posted on the Services in a way that constitutes copyright or trademark infringement, please notify the designated agent, Ziff Davis, LLC at 114 5th Avenue 15th Floor New York, New York 10011, Attn: Legal Department fax: (212) 503-5136, or by email: ZDLegal1@ziffdavis.com and insert “Terms of Use” in the subject line. A notification of claimed infringement must include the following: (a) an electronic or physical signature of the person authorized to act on behalf of the owner of the copyright or trademark interest; (b) a description of the copyrighted work(s) or trademark(s) that you claim has been infringed; (c) a description of where the material that you claim is infringing is located on the Services (including any additional identifying information such as URLs and post numbers to assist us in identifying the allegedly infringing material); (d) your address, telephone number, and email address; (e) a written statement by you that you have a good faith belief that the disputed use is not authorized by the copyright or trademark owner, its agent, or the law; and (f) a statement by you, made under penalty of perjury, that the above information in your notice is accurate and that you are the copyright or trademark owner or authorized to act on the copyright or trademark owner’s behalf. If materials you have posted on the Services have been removed due to alleged infringement of a third party’s intellectual property rights, Ziff Davis will notify you. If you believe your materials have been wrongly removed, you may file a counter-notification containing the following: (a) an electronic or physical signature of the person authorized to act on your behalf; (b) a description of the material that has been removed or to which access has been disabled and where the material was located online before it was removed or access to it was disabled; (c) a written statement by you that under penalty of perjury, that you have a good faith belief that the material was removed or disabled as a result of mistake or misidentification of the material to be removed or disabled; and (d) your address, telephone number, and email address; and (e) a statement that you consent to the jurisdiction of federal district court for the judicial district in which the address is located, or if your address is outside of the United States, for any judicial district in which the service provider may be found, and that you will accept service of process from the person who provided notification under DMCA 512 subsection (c)(1)(c) or an agent of such person. Upon Ziff Davis’ receipt of such counter-notice, Ziff Davis will provide the complainant with your contact information so that you have the ability to resolve the issue. Please note that when we forward the counter-notification, it includes your personal information. If you are concerned about protecting your anonymity, please consult with an attorney about other options. If the matter has been resolved or the complainant does not seek a court order within the statutory time period, we generally will re-post the material. Ziff Davis reserves the right to remove any materials or content alleged to be infringing without prior notice, at Ziff Davis’ sole discretion, and without liability to you. In appropriate circumstances, Ziff Davis will also terminate your account if you are determined to be a repeat infringer. Any person who knowingly misrepresents that material is infringing or that material was removed or disabled by mistake or misidentification may be subject to liability. 9. Disclaimer of Warranties; Limitation of Liability The Services and the Content are distributed on an “as is, as available” basis. None of Ziff Davis, third party vendors or content providers or their respective agents makes any warranties of any kind, either express or implied, including, without limitation, warranties of title or implied warranties of merchantability or fitness for a particular purpose, with respect to the Services, any Content or any products or services sold through the Services. Neither Ziff Davis nor any third party content provider warrants that any files available for downloading through the Services will be free of viruses or similar contamination or destructive features. Neither Ziff Davis nor any third party content provider warrants that any of the goods or services linked to or advertised in the Services comply with data protection or other relevant legislation and Ziff Davis accepts no liability whatsoever for any claim arising from such goods or services. You expressly agree that the entire risk as to the quality and performance of the Services and the accuracy or completeness of the Content is assumed solely by you and Ziff Davis cannot guarantee the continued availability of any particular component of the Services. You specifically acknowledge that Ziff Davis is not responsible or liable for any unauthorized access to or alteration of your materials, data or other transmissions entered into through the Services or for any threatening, defamatory, obscene, offensive or illegal Content or for conduct of any other party or for any infringement of another’s rights. ZIFF DAVIS SPECIFICALLY DISCLAIMS ANY LIABILITY, WHETHER BASED IN CONTRACT, TORT, STRICT LIABILITY OR OTHERWISE. ZIFF DAVIS, ANY THIRD PARTY CONTENT PROVIDER AND THEIR RESPECTIVE AGENTS SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OF OR INABILITY TO USE THE SERVICES, INCLUDING, WITHOUT LIMITATION, LOSS OR CORRUPTION OF INFORMATION OR DATA, LOSS OF BUSINESS OR LOST PROFITS, LOSS OF REPUTATION OR GOODWILL, ARISING OUT OF OR RELATED TO THIS AGREEMENT OR THE SERVICES, WHETHER IN CONTRACT, TORT OR UNDER ANY OTHER THEORY OF LIABILITY EVEN IF SUCH PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. IF, NOTWITHSTANDING THE OTHER PROVISIONS OF THIS AGREEMENT, ZIFF DAVIS IS FOUND TO BE LIABLE TO YOU FOR ANY DAMAGE OR LOSS WHICH ARISES OUT OF OR IS ANY WAY CONNECTED TO YOUR USE OF THE SERVICES, LIABILITY OF ZIFF DAVIS SHALL IN NO EVENT EXCEED THE GREATER OF (I) THE TOTAL OF ANY SUBSCRIPTION OR SIMILAR FEES WITH RESPECT TO ANY SERVICE OR FEATURE OF THE SERVICES PAID IN THE SIX MONTHS PRIOR TO THE DATE OF THE INITIAL CLAIM MADE AGAINST ZIFF DAVIS, OR (II) ONE HUNDRED U.S. DOLLARS ($100.00). IN THE EVENT THAT YOU HAVE A DISPUTE WITH ANOTHER USER RELATED TO, ARISING FROM, OR IN ANY WAY CONNECTED WITH YOUR USE OF THE SERVICES, YOU RELEASE ZIFF DAVIS FROM ANY CLAIMS, DEMANDS, AND DAMAGES OF EVERY KIND AND NATURE ARISING OUT OF OR IN ANY WAY CONNECTED WITH SUCH A DISPUTE, AND AGREE TO HOLD ZIFF DAVIS HARMLESS IN CONNECTION WITH ANY SUCH DISPUTE. Some jurisdictions do not allow exclusion of implied warranties or certain limitations of liability, including for incidental or consequential damages, punitive or exemplary damages, bodily or moral (reputational) damages, gross negligence, death or personal injury caused by negligence, personal injury or loss of or damage to property caused by defective products, fraud and/or fraudulent misrepresentation, or recklessness, so the above limitations or exclusions may not apply to you. In such jurisdictions, the liability of Ziff Davis, third party content providers and their respective agents shall be limited to the greatest extent permitted by applicable law. 10. SMS Text Messaging Terms SMS Messaging These terms govern your participation in SMS text messaging programs offered by certain Ziff Davis brands and supplement the general Terms of Use. SMS Messaging OverviewCertain Ziff Davis brands may offer SMS text messaging services to provide you with promotional offers, updates, or other content. By enrolling in any Ziff Davis SMS program, you agree to receive automated, recurring marketing text messages at the mobile number you provide. Consent to receive such messages is not a condition of purchase. Opt-In and ConsentBy opting in (via an on-site form), you confirm you are at least 16 years old and that you are the subscriber or authorized user of the mobile number provided. You consent to receive recurring text messages from the applicable Ziff Davis brand. Ziff Davis or its service providers may retain opt-in records, including the timestamp and method of consent, for compliance purposes. Message Types and FrequencyMessages are promotional and marketing in nature. While there is no fixed frequency, you may receive up to one message per day, depending on the brand’s program. ChargesStandard message and data rates may apply. Opt-Out and AssistanceYou may opt out at any time by replying STOP, CANCEL, QUIT, or UNSUBSCRIBE to any message. No confirmation message will be sent upon opt-out. To request assistance, reply HELP or contact the support email listed for the relevant brand. Brand-Specific NumbersEach Ziff Davis brand uses a dedicated toll-free number for SMS communications. Opt-outs are specific to the brand and number from which you received the message. Opting out of one brand’s SMS program does not unsubscribe you from others. Legal ComplianceZiff Davis ensures its SMS programs comply with applicable laws and industry standards, including the Telephone Consumer Protection Act (TCPA), the CAN-SPAM Act, and CTIA guidelines. 11. Member Disputes You are solely responsible for your interactions with other Members of the Services. Ziff Davis reserves the right, but has no obligation, to monitor disputes between you and other Members and to take action (e.g., account deletion or removal of content posted by a user) if Ziff Davis determines that there has been a violation of the Agreement or if such action is otherwise necessary or desirable, in its sole discretion. 12. International Use We make no claims that any Material, Services or any Content is appropriate or may be downloaded outside of the United States or outside the country where such Material, Services or any Content was produced. Access to the Material, Services or any Content may not be legal in certain countries or for certain persons. If you access any Material, Services or Content from outside of the United States, you do so at your own risk and are responsible for compliance with the laws of your jurisdiction. You agree to comply with: (i) all local rules regarding user conduct on the Internet and acceptable content; and (ii) all applicable laws regarding the downloading and/or transmission of technical data and other material from or to the United States and the country in which you are located. 13. No Submission of Unsolicited Ideas Ziff Davis does not accept unsolicited ideas of any kind, including ideas for: advertising; promotions; new products, technologies, processes, or materials; marketing plans; or product names. Please do not send us any such ideas or materials relating to such ideas. This is to avoid any potential misunderstanding or dispute should our products or marketing strategies seem similar to unsolicited ideas submitted to us. If, despite this request, you do send us any unsolicited ideas or materials, we make no assurances that such ideas or materials will be treated as confidential or proprietary. 14. Binding Arbitration In the unlikely event that you’re not satisfied with customer service’s solution, and you and Ziff Davis are unable to resolve a dispute through the Informal Dispute Resolution Procedures below, we each agree to resolve the dispute through binding arbitration or small claims court instead of in courts of general jurisdiction. Arbitration is more informal than a lawsuit in court. Arbitration uses a neutral arbitrator instead of a judge or jury, allows for more limited discovery than in court, and is subject to very limited review by courts. Unless expressly limited by this arbitration provision, arbitrators can award the same damages and relief that a court can award. Any arbitration under this Agreement will take place on an individual basis; class arbitrations and class actions are not permitted. In arbitration you may be entitled to recover attorneys’ fees from us to the same extent as you would be in court. ARBITRATION AGREEMENT (1) Claims Subject to Arbitration: To the fullest extent permitted by applicable law, Ziff Davis and you agree to arbitrate all disputes and claims between us, except for claims arising from bodily injury or that pertain to enforcing, protecting, or the validity of your or our intellectual property rights (or the intellectual property rights of any of our licensors, affiliates and partners). This Arbitration Agreement is intended to be broadly interpreted. It includes, but is not limited to: claims arising out of or relating to any aspect of the relationship between us, whether based in contract, tort, fraud, misrepresentation or any other statutory or common-law legal theory; claims that arose before this or any prior Agreement (including, but not limited to, claims relating to advertising); claims for mental or emotional distress or injury not arising out of physical bodily injury; claims that are currently the subject of purported class action litigation in which you are not a current member of a certified class; and claims that may arise after the termination of this Agreement. References to “Ziff Davis,” “you,” “we” and “us” in this Arbitration Agreement include our respective predecessors in interest, successors, and assigns, as well as our respective past, present, and future parents, subsidiaries and affiliates (including Ziff Davis, Inc., Ziff Davis, LLC, Everyday Health, Inc., Everyday Health Media, LLC, and their affiliates); those entities and our respective agents, employees, licensees, licensors, and providers of content as of the time your or our claim arises; and all authorized or unauthorized users or beneficiaries of Services under this or prior Agreements between us. Notwithstanding the foregoing, either party may elect to have claims heard in small claims court seeking only individualized relief, so long as the action is not removed or appealed to a court of general jurisdiction. This Arbitration Agreement does not preclude you from bringing issues to the attention of federal, state, or local agencies. You agree that, by entering into this Agreement, you and we are each waiving the right to participate in a class action and to a trial by jury to the fullest extent permitted by applicable law. This Agreement evidences a transaction in interstate commerce, and thus the Federal Arbitration Act (9 U.S.C. §§ 1-16) governs the interpretation and enforcement of this arbitration provision. This Arbitration Agreement shall survive termination of this Agreement. (2) Mandatory Pre-Arbitration Notice and Informal Dispute Resolution Procedures: You and we agree that good-faith, informal efforts to resolve disputes often can result in a prompt, cost-effective and mutually beneficial outcome. Therefore, a party who intends to initiate arbitration or file a claim in small claims court must first send to the other a written Notice of Dispute (“Notice”). A Notice from you to Ziff Davis must be emailed to dispute.notice@ziffdavis.com (“Notice Address”). Any Notice must include (i) the claimant’s name, address, and email address; (ii) a description of the nature and basis of the claim or dispute; (iii) if you are submitting the Notice, any relevant facts regarding your use of the Sites, including whether you have created an account with or receive any newsletters associated with any of the Sites; (iv) a description of the nature and basis of the specific relief sought, including the damages sought, if any, and a detailed calculation for them; and (v) a personally signed statement from the claimant (and not their counsel) verifying the accuracy of the contents of the Notice. The Notice must be individualized, meaning it can concern only your dispute and no other person’s dispute. After receipt of a completed Notice, the parties shall engage in a good faith effort to resolve the dispute for a period of 60 days (which can be extended by agreement). You and we agree that, after receipt of the completed Notice, the recipient may request an individualized video settlement conference (which can be held after the 60-day period) and both parties will personally attend (with counsel, if represented). If you are unable to participate in the settlement conference by video, you may attend telephonically upon showing of good cause or extraordinary circumstances warranting telephonic participation (e.g., inability to afford equipment or sufficient Wi-Fi due to indigent circumstances). You and we agree that the parties (and counsel, if represented) shall work cooperatively to schedule the conference at the earliest mutually convenient time and to seek to reach a resolution. If we and you do not reach an agreement to resolve the issues identified in the Notice within 60 days after the completed Notice is received (or a longer time if agreed to by the parties), you or we may commence an arbitration proceeding or a small claims court proceeding (if permitted by small claims court rules). Compliance with this Mandatory Pre-Arbitration Notice and Informal Dispute Resolution Procedures section is a condition precedent to initiating arbitration. Any applicable limitations period (including statute of limitations) and any filing fee deadlines shall be tolled while the parties engage in the informal dispute resolution procedures set forth in this Section 13(2). All of the Mandatory Pre-Arbitration Notice and Informal Dispute Resolution Procedures are essential so that you and Ziff Davis have a meaningful opportunity to resolve disputes informally. If any aspect of these requirements has not been met, a court of competent jurisdiction may enjoin the filing or prosecution of an arbitration. In addition, unless prohibited by law, the arbitration administrator may not accept, administer, assess, or demand fees in connection with an arbitration that has been initiated without completion of the Mandatory Pre-Arbitration Notice and Informal Dispute Resolution Procedures. If the arbitration is already pending, it shall be administratively closed. Nothing in this paragraph limits the right of a party to seek damages for non-compliance with these Procedures in arbitration. (3) Arbitration Procedure: The arbitration will be governed by applicable rules of National Arbitration & Mediation (“NAM”) (including the Comprehensive Dispute Resolution Rules and Procedures and/or the Supplemental Rules for Mass Arbitration Filings, as applicable) (“NAM Rules”), as modified by this Arbitration Agreement, and will be administered by NAM. (If NAM is unavailable or unwilling to do so, another arbitration provider shall be selected by the parties that will do so, or if the parties are unable to agree on an alternative administrator, by the court pursuant to 9 U.S.C. §5.) The NAM Rules are available online at www.namadr.com or by requesting them in writing at the Notice Address. You may obtain a form to initiate arbitration at: https://www.namadr.com/content/uploads/2020/09/Comprehensive-Demand-for-Arb-revised-9.18.19.pdf or by contacting NAM. We and you agree that the party initiating arbitration must submit a certification that they have complied with and completed the Mandatory Pre-Arbitration Notice and Informal Dispute Resolution Procedures requirements referenced in Section 13(2) and that they are a party to the Arbitration Agreement enclosed with or attached to the demand for arbitration. The demand for arbitration and certification must be personally signed by the party initiating arbitration (and their counsel, if represented). All issues are for the arbitrator to decide, except as otherwise expressly provided herein. The arbitrator may consider but shall not be bound by rulings in other arbitrations involving different customers. Unless we and you agree otherwise, or the applicable NAM Rules dictate otherwise, any arbitration hearings will take place in the county (or parish) of your billing address and you and a Ziff Davis representative will be required to attend in person. At the conclusion of the arbitration proceeding, the arbitrator shall issue a reasoned written decision sufficient to explain the essential findings and conclusions on which the award is based. The arbitrator’s decision is binding only between you and Ziff Davis and will not have any preclusive effect in another arbitration or proceeding that involves a different party. An arbitrator’s award that has been fully satisfied shall not be entered in any court. As in court, you and Ziff Davis agree that any counsel representing a party in arbitration certifies when initiating and proceeding in arbitration that they are complying with the requirements of Federal Rule of Civil Procedure 11(b), including certification that the claim or relief sought is neither frivolous nor brought for an improper purpose. The arbitrator is authorized to impose any sanctions under the NAM Rules, Federal Rule of Civil Procedure 11, or applicable federal or state law, against all appropriately represented parties and counsel. Except as expressly provided in the Arbitration Agreement, the arbitrator may grant any remedy, relief, or outcome that the parties could have received in court, including awards of attorneys’ fees and costs, in accordance with applicable law. Unless otherwise provided by applicable law, the parties shall bear their own attorneys’ fees and costs in arbitration unless the arbitrator awards sanctions or finds that either the substance of the claim, the defense, or the relief sought is frivolous or brought for an improper purpose (as measured by the standards set forth in Federal Rule of Civil Procedure 11 (b)). (4) Arbitration Fees: The payment of arbitration fees (the fees imposed by the arbitration administrator including filing, arbitrator, and hearing fees) will be governed by the applicable NAM Rules, unless you qualify for a fee waiver under applicable law. If after exhausting any potentially available fee waivers, the arbitrator finds that the arbitration fees will be prohibitive for you as compared to litigation, we will pay as much of your filing, arbitrator, and hearing fees in the arbitration as the arbitrator deems necessary to prevent the arbitration from being cost-prohibitive, regardless of the outcome of the arbitration, unless the arbitrator determines that your claim(s) were frivolous or brought for an improper purpose or asserted in bad faith. You and we agree that arbitration should be cost-effective for all parties and that any party may engage with NAM to address the reduction or deferral of fees. (5) Confidentiality: Upon either party’s request, the arbitrator will issue an order requiring that confidential information of either party disclosed during the arbitration (whether in documents or orally) may not be used or disclosed except in connection with the arbitration or a proceeding to enforce the arbitration award and that any permitted court filing of confidential information must be done under seal to the furthest extent permitted by law. (6) Offer of Settlement: In any arbitration between you and Ziff Davis, the defending party may, but is not obligated to, make a written settlement offer at any time before the evidentiary hearing or, if a dispositive motion is permitted, prior to the dispositive motion being granted. The amount or terms of any settlement offer may not be disclosed to the arbitrator until after the arbitrator issues an award on the claim. If the award is issued in the other party’s favor and is less than the defending party’s settlement offer or if the award is in the defending party’s favor, the other party must pay the defending party’s costs incurred after the offer was made, including any attorney’s fees. If any applicable statute or case law prohibits the shifting of costs incurred in the arbitration, then the offer in this provision shall serve to cease the accumulation of any costs to which the party bringing the claim may be entitled for the cause of action under which it is suing. (7) Requirement of Individualized Relief: The arbitrator may award declaratory or injunctive relief only in favor of the individual party seeking relief and only to the extent necessary to provide relief warranted by that party’s individual claim. TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, YOU AND WE AGREE THAT EACH PARTY MAY BRING CLAIMS AGAINST THE OTHER ONLY IN YOUR OR OUR INDIVIDUAL CAPACITY, AND NOT AS A PLAINTIFF OR CLASS MEMBER IN ANY PURPORTED CLASS, REPRESENTATIVE, OR PRIVATE ATTORNEY GENERAL PROCEEDING. Further, unless both you and we agree otherwise, the arbitrator may not consolidate more than one person’s claims and may not otherwise preside over any form of a representative, class, or private attorney general proceeding. If, after exhaustion of all appeals, any of these prohibitions on non-individualized declaratory or injunctive relief; class, representative, and private attorney general claims; and consolidation are found to be unenforceable with respect to a particular claim or with respect to a particular request for relief (such as a request for injunctive relief sought with respect to a particular claim), then the parties agree such a claim or request for relief shall be decided by a court of competent jurisdiction, after all other arbitrable claims and requests for relief are arbitrated. You agree that any arbitrations between you and Ziff Davis will be subject to this Section 13 and not to any prior arbitration agreement you had with Ziff Davis, and, notwithstanding any provision in this Agreement to the contrary, you agree that this Section 13 amends any prior arbitration agreement you had with Ziff Davis, including with respect to claims that arose before this or any prior arbitration agreement. (8) Opt Out of Future Changes: Notwithstanding any provision to the contrary, if Ziff Davis makes any future change to this Arbitration Agreement (other than a change to the Notice Address), you may reject any such change by sending Ziff Davis an email to dispute.notice@ziffdavis.com within 30 days of the posting of the amended arbitration agreement that provides: (i) your full legal name, (ii) your complete mailing address, (iii) your phone number, (iv) if applicable, the username or email address associated with any potential account or newsletter; (v) the relevant Site; and (vi) the approximate date of your initial use of the relevant Site. Such an opt-out email must be sent by you personally, and not by your agent, attorney, or anyone else purporting to act on your behalf. It must include a statement, personally signed by you, that you wish to reject the change to the Arbitration Agreement. This is not an opt out of arbitration altogether. (9) Mass Filing: If, at any time, 25 or more claimants (including you) submit Notices or seek to file demands for arbitration raising similar claims against the other party or related parties by the same or coordinated counsel or entities, consistent with the definition and criteria of Mass Filings (“Mass Filing”) set forth in NAM’s Mass Filing Supplemental Dispute Resolution Rules and Procedures (“NAM’s Mass Filing Rules,” available at https://www.namadr.com/resources/rules-fees-forms/), you and we agree that the additional procedures set forth below shall apply. The parties agree that throughout this process, their counsel shall meet and confer to discuss modifications to these procedures based on the particular needs of the Mass Filing. The parties acknowledge and agree that by electing to participate in a Mass Filing, the adjudication of their dispute might be delayed. Any applicable limitations period (including statute of limitations) and any filing fee deadlines shall be tolled beginning when the Mandatory Pre-Arbitration Notice and Informal Dispute Resolution Procedures are initiated, so long as the pre-arbitration Notice complies with the requirements in Section 13(2), until your claim is selected to proceed as part of a staged process or is settled, withdrawn, otherwise resolved, or opted out of arbitration. Stage One: Counsel for the claimants and counsel for Ziff Davis shall each select 25 claims per side (50 claims total) to be filed and to proceed in individual arbitrations as part of a staged process. Each of these individual arbitrations shall be assigned to a different, single arbitrator unless the parties agree otherwise in writing. Any remaining claims shall not be filed or be deemed filed in arbitration, nor shall any arbitration fees be assessed in connection with those claims unless and until they are selected to be filed in individual arbitration proceedings as part of a staged process. After this initial set of staged proceedings is completed, the parties shall promptly engage in a global mediation session of all remaining claims with a retired federal or state court judge and Ziff Davis shall pay the mediator’s fee. Stage Two: If the remaining claims are not resolved at this time, counsel for the claimants and counsel for Ziff Davis shall each select 50 claims per side (100 claims total) to be filed and to proceed in individual arbitrations as part of a second staged process, subject to any procedural changes the parties agreed to in writing. Each of these individual arbitrations shall be assigned to a different, single arbitrator unless the parties agree otherwise in writing. Any remaining claims shall not be filed or be deemed filed in arbitration, nor shall any arbitration fees be assessed in connection with those claims unless and until they are selected to be filed in individual arbitration proceedings as part of a staged process. After this second set of staged proceedings is completed, the parties shall promptly engage in a global mediation session of all remaining claims with a retired federal or state court judge and Ziff Davis shall pay the mediator’s fee. Stage Three: If the remaining claims are not resolved at this time, counsel for the claimants and counsel for Ziff Davis shall each select 100 claims per side (200 claims total) to be filed and to proceed in individual arbitrations as part of a third staged process, subject to any procedural changes the parties agreed to in writing. Any remaining claims shall not be filed or be deemed filed in arbitration, nor shall any arbitration fees be assessed in connection with those claims unless and until they are selected to be filed in individual arbitration proceedings as part of a staged process. Following this third set of staged proceedings, counsel for claimants may elect to have the parties participate in a global mediation session of all remaining claims with a retired federal or state court judge. Stage Four: If your claim is not resolved at this time, then you agree that your claim will be resolved as part of continuing, staged individual arbitration proceedings as set forth below. Assuming the number of remaining claims exceeds 100, then 100 claims shall be randomly selected (or selected through a process agreed to by counsel for the parties) to be filed and to proceed in individual arbitrations as part of a staged process. If the number of remaining claims is fewer than 100, then all of those claims shall be filed and proceed in individual arbitrations. Any remaining claims shall not be filed or be deemed filed in arbitration, nor shall any arbitration fees be assessed in connection with those claims unless and until they are selected to be filed in individual arbitration proceedings as part of a staged process. After each set of 100 claims are adjudicated, settled, withdrawn, or otherwise resolved, this process shall repeat consistent with these parameters. Counsel for the parties are encouraged to meet and confer, participate in mediation, and engage with each other and with NAM (including through a Procedural Arbitrator) to explore ways to streamline the adjudication of claims, increase the number of claims to proceed at any given time, promote efficiencies, conserve resources, and resolve the remaining claims. A court of competent jurisdiction shall have the authority to enforce these Mass Filing provisions and, if necessary, to enjoin the mass filing, prosecution, or administration of arbitrations and the assessment of arbitration fees. If these additional procedures apply to your claim, and a court of competent jurisdiction determines that they are not enforceable as to your claim, then your claim shall proceed in a court of competent jurisdiction consistent with this Agreement. You and Ziff Davis agree that we each value the integrity and efficiency of arbitration and wish to employ the process for the fair resolution of genuine and sincere disputes between us. You and Ziff Davis acknowledge and agree to act in good faith to ensure the processes set forth herein are followed. The parties further agree that application of these Mass Filing procedures have been reasonably designed to result in an efficient and fair adjudication of such cases.(10) Severability: If any portion of this Arbitration Agreement is found to be void, invalid, or otherwise unenforceable, then that portion shall be deemed to be severable and, if possible, superseded by a valid, enforceable provision, or portion thereof, that matches the intent of the original provision, or portion thereof, as closely as possible. The remainder of this Arbitration Agreement shall continue to be enforceable and valid according to the terms contained herein. 15. CLASS ACTION AND JURY TRIAL WAIVER You and Ziff Davis agree that, to the fullest extent permitted by law, each party may bring claims (whether in court or in arbitration) against the other only in an individual capacity, and not participate as a plaintiff, claimant, or class member in any class, collective, consolidated, private attorney general, or representative proceeding. This means that you and Ziff Davis may not bring a claim on behalf of a class or group and may not bring a claim on behalf of any other person unless doing so as a parent, guardian, or ward of a minor or in another similar capacity for an individual who cannot otherwise bring their own individual claim. This also means that you and Ziff Davis may not participate in any class, collective, consolidated, private attorney general, or representative proceeding brought by any third party. Notwithstanding the foregoing, you or Ziff Davis may participate in a class-wide settlement. To the fullest extent permitted by law, you and Ziff Davis waive any right to a jury trial. 16. Limitation Period for Claims You agree that regardless of any statute or law to the contrary, any claim or cause of action arising out of or related to use of our sites or the Agreement must be filed within one (1) year after such claim or cause of action arose or be forever barred. 17. Miscellaneous We may be required by international, state or federal law to notify you of certain events. You hereby acknowledge and consent that such notices will be effective upon our posting them on our sites or delivering them to you through e-mail. Subject to the arbitration provision above and for all purposes of this Agreement, this Agreement shall be construed in accordance with the laws of the State of New York, without reference to principles of choice of law. You and Ziff Davis each irrevocably consent to the personal jurisdiction of the federal or state courts located in New York, New York, the Borough of Manhattan (the “Courts”) with respect to any action, suit or proceeding arising out of or related to this Agreement or to the Services (including without limitation any Content) and waive any objection to venue in any of the Courts for such an action, suit or proceeding (whether based on forum non conveniens or otherwise); additionally, you agree that you will not bring any such action, suit or proceeding in any court other than the Courts. This Agreement constitutes the entire agreement between the parties with respect to the subject matter hereof, and supersedes all previous written or oral agreements between the parties with respect to such subject matter. If any inconsistency exists between the terms of this Agreement and any additional terms and conditions posted on the Services, such terms shall be interpreted as to eliminate any inconsistency, if possible, and otherwise, the additional terms and conditions shall control. If any provision of this Agreement is held invalid, illegal or unenforceable in any respect, (i) such provision shall be interpreted in such a manner as to preserve, to the maximum extent possible, the intent of the parties, (ii) the validity, legality and enforceability of the remaining provisions shall not in any way be affected or impaired thereby, and (iii) such decision shall not affect the validity, legality or enforceability of such provision under other circumstances. Ziff Davis’ failure to enforce any term of this Agreement shall not constitute a waiver of that provision. No waiver shall be binding unless in writing and signed by Ziff Davis, and such waiver shall not be construed as Ziff Davis’ waiver of any other or subsequent breach. 18. New Jersey Residents If, and to the extent that New Jersey law applies, with respect to residents of New Jersey, the terms in Sections 6 (insofar as any claims may arise from, or relate to, consumer protection or fraud and/or misrepresentation, or result in attorney’s fees), 9 and 14 do not limit any rights you may have as a consumer under New Jersey law and are intended to be only as broad and inclusive as permitted by the laws of the state of your residence. Subject to the foregoing, Ziff Davis, third party content providers, and their respective agents reserve all rights, defenses, and permissible limitations under New Jersey law. Nothing in this Section shall modify the binding arbitration clause and waiver for class action and jury trial in Section 13. 19. Australia Residents Nothing in these Terms (including in Sections 6, 9 and 15) limits, excludes or modifies any rights you may have under any law, including under the Australian Consumer Law (the “ACL”) and consumer guarantees under the ACL, which may not be limited, excluded or modified by agreement (including where such exclusion, restriction or modification would be illegal or void under such law). 20. Privacy Policy The applicable privacy policy will be made available on the property from which you accessed these Terms. Such privacy policy is incorporated by reference into these Terms. QUESTIONS?Please contact ZDLegal1@ziffdavis.com and insert “Terms of Use” in the subject line if you have any questions or comments about the Agreement, or to report user conduct violating the Agreement."
    },
    {
      "url": "https://www.ziffdavis.com/ztg-privacy-policy",
      "text": "Effective September 2024 – Version Française Ziff Davis, with its subsidiaries, affiliates and parent company, delivers trusted content and digital media. Ziff Davis values your privacy and is committed to protecting the privacy of your information. This Privacy Policy (or “policy”) describes how Ziff Davis uses the personal information you provide and the rights you have. We have created this Privacy Portal to help you exercise your rights. Privacy Policy Overview Information We Collect, Receive and Create About You Data Processing and Retention Sensitive Personal Information Direct Marketing Behavioral Advertising Cookies Information We Share With Third Parties International Transfers of Information Data Security and Breach Handling How to Control your Information Your Rights with Respect to Your Personal Information How to Change Your Preferences Contact Details Children California Consumer Rights Metrics How this Privacy Policy May Change 1. Privacy Policy Overview Ziff Davis owns and operates several interactive websites, mobile and connected applications, including their and other online interactive features and services (collectively “services” or “our services”). This policy covers information collected through the following websites and mobile applications. AskMen, AskMen Canada, AskMen UK, AskMen Australia Geek ExtremeTech Lifehacker Mashable PCMag, PCMag UK, PCMag Australia CNET ZDNET In part, the purpose of this policy is to notify users of Ziff Davis’s policies and practices with respect to their data. By using the services provided you have agreed to the Terms of Use (or ToU); and this policy is a part of the ToU. 2. Information We Collect, Receive and Create about You We may collect or obtain information about you when you sign up, when you create profiles, pages or contributions, when you use and interact with our services and when you make your personal information public. In some cases, we may also receive information about you from third parties. Data you provide when you sign up: This is, for example, username, password, subscription information, and basic information about any other accounts you choose to associate with your registration, like your Apple, Facebook, or Google account. Data you provide when you create profiles, pages or contributions: This is user generated contributions, such as the contents of profiles, including your profile name, contact details and any demographic information you choose to provide; as well as any comments and posts made in forums. We seek to provide users with an opportunity to be a part of an online community and communicate and share with others. This can include personal information that users choose to share. We encourage all of our users to make conscious choices about what they share online. Ziff Davis, including its affiliates, subsidiaries and parent company, is not responsible for the information you disclose to the public using our services. Inferences: We may infer data about you based on your interests, where you live, what language(s) you speak, and other data we have access to. Data we collect through your use of our services: We make and keep records when we provide you support or assistance on our services. We may also collect information about how you interact with our various services (or parts of our services) or third party content you see on our apps and sites. We also collect data on how you interact with the ads you see. Data we receive from third parties: In some cases, we may receive information about you from third parties, for example, social networking sites. Please note that this policy does not cover the practices of third parties, including those that may disclose information to us. 3. Data Processing and Retention We process your personal information in order to provide you the best experience of our services. We may also process your Information where the processing is necessary for the establishment, exercise or defense of legal rights. Below is a chart stating which categories of your personal information we process for which purposes specifically, and how long we retain that data. Our processing of your data is subject to your use of our service, your privacy preferences, and your account settings choices. Personal InformationWe may process the following categories of personal iInformation about you. Categories of personal information Purpose of processing __________ legal basis Retention Period Account Information (Personal Details): Information you provide to us such as, your name; postal address; telephone and/or mobile number; email address; employer; login details, including username and password; interests; public social media handles or profile(s); and photograph posted by you and other users. To provide use of our services as agreed in the ToU. __________ Legitimate Interest For the life of the account and a reasonable and legally compliant time thereafter. App Data. For more information about a particular App or Tool and the data it collects, please visit here. Please note,we may collect information from third-party apps such as TheSpiceWorld hosted on the CVent platform. Maintain and improve service standards___________ Legitimate Interest For the life of the account and a reasonable and legally compliant time thereafter. Consent Records: records of any consents you may have given, together with the date and time, means of consent and any related information (e.g., the subject matter of the consent). Comply with applicable laws and regulations and users’ choices. ___________ Legal Requirement For the life of the account and a reasonable and legally compliant time thereafter. Customer Records: electronic customer records containing personal information, such as name, signature, address, telephone number, or any financial information. We may also collect Personal Data information about you through your communications with our customer support team. NOTE: Please ensure that no sensitive personal data is submitted in connection with your requests for support (for example, health information, political or religious beliefs, information about minors, etc.). To maintain service standards and provide users with the ability to communicate efficiently and effectively with our company. ____________Legitimate Interest Customer records will be kept in accordance with applicable laws. Demographic Information: gender; age/date of birth; salutation; job title, company information, work experience and other professional information; language preferences. Enable customer expression, maintain and improve service standards, and marketing. ____________ Legitimate Interest For the life of the account and a reasonable and legally compliant time thereafter. Location Information: We collect your IP address from which we can derive imprecise location information, for example, at the city or zip code level, of a user’s computer or device. We may also have this type of location information if you provide it to us during sign up or in your profile, project page, or contributions. Maintain service standards, provide relevant content and marketing. ____________Legitimate Interest For the life of the account and a reasonable and legally compliant time thereafter. Precise Location Information: If your settings choices permit, we collect and process location data that describes the precise geographic location of your device. This may include your physical location and movements that allows us to periodically determine your geolocation. Marketing. ____________ Consent For the life of the account and a reasonable and legally compliant time thereafter. Profile Information and User Contributions: For certain Services, you may choose to create a public profile, a project page or a profile page, or create your own contributions.All contents of these pages and contributions are processed, including any views and opinions included by you. Enable customer expression, and provide use of our services as agreed in the ToU. ____________ Legitimate Interest For the life of the account and a reasonable and legally compliant time thereafter. Inferences: Inferences drawn from personal information reflecting your preferences, characteristics, predispositions, behavior, and attitudes. Marketing and to maintain and improve service standards. ____________ Legitimate Interest For the life of the account and a reasonable and legally compliant time thereafter. Transaction Information: information on how you interact with the Services, including records of products or services purchased, obtained or considered such as the coupons you view and redeem, the gift cards you purchase or sell via our Services, the cash back offers that you claim, including copies of receipts that you submit; financial information related to your transactions, information about you as needed to administer your participation in our rewards programs; payment information, including payment card number, expiration date, and CVN; other information about how you use our Services, email, or searches for and interactions with e-commerce opportunities, such as how you interact with our merchants, business partners, and service providers, including, in some cases and where your settings permit, the items you purchase from those merchants. Performance of a contract, marketing, providing full use of our services as agreed in the ToU. _____________ Performance of a Contract For the life of the account and a reasonable and legally compliant time thereafter. Device Information and Device ID: Device ID, which is a distinctive number associated with a smartphone or similar handheld device. As well as, device information, including Device type, operating system and software information, and settings. Maintain and improve the quality of services ____________ legitimate interest For the life of the account and a reasonable and legally compliant time thereafter. Advertising Identifiers: A user-resettable identification number for advertising associated with a device (e.g., iOS uses the Identifier for Advertising (IDFA) and Android uses Google Advertising ID). Marketing _________ Consent For the life of the account and a reasonable and legally compliant time thereafter. Connectivity Data: WiFi connection, service set identifier (“SSID”), International Mobile Subscriber Identity (“IMSI”) and International Mobile Equipment Identity (“IMEI”). Maintain and improve the quality of services ____________ legitimate interest For the life of the account and a reasonable and legally compliant time thereafter. Cookies: Information collected through the use of cookies, eTags, Javascript, pixel tags, device ID tracking, anonymous identifiers and other technologies, including information collected using such methods and technologies about (i) your visits to, and interaction and engagement with, the Services, Subject to your privacy choices and settings, content and ads on third party websites, applications, platforms and other media channels (“Channels”), and (ii) your interaction with emails including the content and ads therein (collectively, “Online Data”). Marketing _________ Consent In compliance with the Cookie Policy Engagement Data: Information about (i) your visits to, and interaction and engagement with the services, content and ads on third party websites, applications, platforms and other media channels (“Channels”), and (ii) your interaction with emails including the content and ads therein (collectively, “Online Data”), which are collected through the use of cookies and cookie like technologies. Marketing____________Consent In compliance with the Cookie Policy 4. Sensitive Personal Information We do not seek to collect or process sensitive personal information, such as, race or ethnicity, political opinions, religious or philosophical beliefs, trade union membership, physical or mental health, or sex life. Where users choose to disclose sensitive personal information within profiles, contributions or other free-text fields available through Ziff Davis, we do not use the sensitive information for any additional purpose without consent, unless required to comply with laws, or prevent crimes. 5. Direct Marketing We may use the contact details you provided us to reach out to you with information regarding services that may be of interest to you, for example, upcoming promotions. You may unsubscribe or opt out of SMS messages at any time at no cost. 6. Behavioral Advertising Ziff Davis and third parties, subject to your privacy choices and settings, may collect data about your behavior while using our services in order to provide you with more relevant interest-based advertising on other websites and applications, as well as our partners’ platforms and media channels. If you do not wish to receive this advertising, you can change your preferences by clicking here.The specific providers we use for behavioral advertising may change from time to time. 7. Cookies We may collect information about you through the use of cookies and similar technologies on our sites and apps, or your devices. In compliance with your privacy choices and settings, we also may permit our third-party service providers to perform various analytics functions and to provide you with more relevant or interest-based advertisements using cookies. Some third parties may choose to use their own cookies for the purposes of collecting information relating to the viewing of their advertising. To learn more about how we use cookies, and to manage your preferences, please see our Cookie Policy. This policy, and our Cookie Policy, are only intended to cover the use of cookies as they relate to Ziff Davis businesses. 8. Information We Share with Third Parties Ziff Davis Companies: Ziff Davis, LLC is owned by Ziff Davis Inc. We share your information with other businesses owned by Ziff Davis, Inc. (“Ziff Davis Companies”) to assist us in the operation of our services, improve them, and further develop them. We also share information with other Ziff Davis Companies for the purposes of targeted advertising. If you would like to opt out of the sale or sharing of your data with other Ziff Davis Companies, you can do so via our Privacy Portal. Other Third Parties: We may also share your personal information with the following: Relevant third party provider, where our services use third party advertising, plugins or content, subject to your privacy choices and settings, and our ToU. Merchants, business partners, or advertisers where you consented and chose to participate in offers, contests, or other activities. third party Processors (such as analytic providers; data centers; etc.), located anywhere in the world, subject to the requirements and limitations; legal and regulatory authorities, upon request, or for the purposes of reporting any actual or suspected breach of applicable law or regulation; Any party as directed by a law enforcement agency or court, to the extent necessary for the establishment, exercise or defense of legal rights; Law enforcement for the purposes of prevention, detection, or investigation of criminal offenses and any legal proceedings associated with them. In the case of a full or partial acquisition, relevant third parties. 9. International Transfers of Information We may transfer your information to recipients in other countries. Ziff Davis participates in the E.U.-U.S. Data Privacy Framework, the UK extension to the EU-U.S. DPF, the Swiss-U.S. Privacy Framework and the APEC Cross Border Privacy Rules System. Where we transfer information from the European Economic Area (“EEA”) to a recipient outside the EEA that is not in an adequate jurisdiction, we do so on the basis of standard contractual clauses. Because of the international nature of our business, we may need to transfer your information within the Ziff Davis group of companies, and to third parties as noted above, in connection with the purposes set out in this Policy. For this reason, we may transfer your information to other countries that may have different laws and data protection compliance requirements to those that apply in the country in which you are located. We remain liable under the DPF Principles if any third parties that we transfer your personal information to process it in a manner inconsistent with the DPF Principles, unless we prove that we are not responsible for the event giving rise to the damage. Ziff Davis and its associated affiliates and subsidiaries complies with the EU-U.S. Data Privacy Framework (EU-U.S. DPF) and the UK Extension to the EU-U.S. DPF, and the Swiss-U.S. Data Privacy Framework (Swiss-U.S. DPF) as set forth by the U.S. Department of Commerce. Ziff Davis has certified to the U.S. Department of Commerce that it adheres to the EU-U.S. Data Privacy Framework Principles (EU-U.S. DPF Principles) with regard to the processing of personal data received from the European Union and the United Kingdom in reliance on the EU-U.S. DPF and the UK Extension to the EU-U.S. DPF. Ziff Davis has certified to the U.S. Department of Commerce that it adheres to the Swiss-U.S. Data Privacy Framework Principles (Swiss-U.S. DPF Principles) with regard to the processing of personal data received from Switzerland in reliance on the Swiss-U.S. DPF. If there is any conflict between the terms in this privacy policy and the EU-U.S. DPF Principles and/or the Swiss-U.S. DPF Principles, the Principles shall govern. To learn more about the Data Privacy Framework (DPF) program, and to view our certification, please visit https://www.dataprivacyframework.gov. We are committed to staying current with developments related to the Data Privacy Framework and may update our transfer mechanisms and safeguards as necessary to remain compliant. Any updates will be reflected in this Privacy Policy. If you are a European individual with a privacy related complaint, concern or question about Ziff Davis’ privacy practices, please contact us through our privacy portal. Under certain conditions, more fully described on the Data Privacy Framework website, European individuals may invoke binding arbitration when other dispute resolution procedures have been exhausted. Where we transfer your personal information from the EEA to recipients located outside the EEA who are not in a jurisdiction that has been formally designated by the European Commission as providing an adequate level of protection for information, we do so on the basis of standard contractual clauses. You may request a copy of the relevant standard contractual clauses using our privacy portal. Please note that when you transfer any personal information directly to an entity established outside the EEA, we are not responsible for that transfer of your information. We will nevertheless process your information, from the point at which we receive the data, in accordance with the provisions of this policy. Enforcement Authority The Federal Trade Commission has jurisdiction over our compliance with the EU-U.S. Data Privacy Framework (EU-U.S. DPF) and the UK Extension to the EU-U.S. DPF, and the Swiss-U.S. Data Privacy Framework (Swiss-U.S. DPF). Complaints Mechanism In compliance with the EU-U.S. DPF and the UK Extension to the EU-U.S. DPF and the Swiss-U.S. DPF, Ziff Davis commits to resolve DPF Principles-related complaints about our collection and use of your personal information. EU and UK individuals and Swiss individuals with inquiries or complaints regarding our handling of personal data received in reliance on the EU-U.S. DPF and the UK Extension to the EU-U.S. DPF, and the Swiss-U.S. DPF should first contact Ziff Davis at privacy@ziffdavis.com. In compliance with the EU-U.S. DPF and the UK Extension to the EU-U.S. DPF and the Swiss-U.S. DPF, Ziff Davis commits to refer unresolved complaints concerning our handling of personal data received in reliance on the EU-U.S. DPF and the UK Extension to the EU-U.S. DPF and the Swiss-U.S. DPF to TrustArc, an alternative dispute resolution provider. The services of Trustarc are provided at no cost to you. For further information please visit https://trustarc.com/dispute-resolution/. Under certain conditions, a binding arbitration option may be available to you in order to address complaints not resolved by any other means. For further information, please see Annex I of the EU-U.S. Data Privacy Framework Principles at: https://www.dataprivacyframework.gov/framework-article/ANNEX-I-introduction. In compliance with the EU-U.S. DPF and the UK Extension to the EU-U.S. DPF and the Swiss-U.S. DPF, Ziff Davis commits to cooperate and comply respectively with the advice of the panel established by the EU data protection authorities (DPAs) and the UK Information Commissioner’s Office (ICO) and the Swiss Federal Data Protection and Information Commissioner (FDPIC) with regard to unresolved complaints concerning our handling of human resources data received in reliance on the EU-U.S. DPF and the UK Extension to the EU-U.S. DPF and the Swiss-U.S. DPF in the context of the employment relationship. For a list of our subsidiaries and affiliates who also adhere to the DPF Principles, please click here. Our privacy practices described in this Policy comply with the Asia-Pacific Economic Cooperation (“APEC”) Cross Border Privacy Rules System. To learn more about this program, please click here. 10. Data Security and Breach Handling We implement appropriate technical and organizational security measures to protect your personal information against unlawful destruction, loss alteration, misuse, or unauthorized access while in our possession. All parties we contract with must agree to provide reasonable data security measures for the customer information we share with them, in compliance with applicable laws and regulations. If we learn of a security breach that affects our users, we may send an email or other direct communication to you, or post a blog to notify the public on our Help and Support Security Center. If you have any reason to believe that your data with us has been compromised (for example, there has been unauthorized access to your account), please contact us at privacy@ziffdavis.com. 11. Data Retention We will retain your personal information for as long as is necessary in connection with the purposes set out in this policy, and in accordance with applicable laws. For more details on how long data is retained see the table in Section 3. 12. Your Rights With Respect to Your Personal Information Many privacy regulations afford consumers a number of specific rights. If you are a resident of the EU (under GDPR), UK (under the UK GDPR), Brazil (under the LGPD), several U.S. States, including California (CCPA), Virginia (under VCDPA), Colorado (under the CPA), and Connecticut (under the CTDPA), or another jurisdiction with similar privacy requirements, you have certain rights which may include those listed below. Your rights: Right to Withdraw Consent: Where you are requested to consent to the processing of your personal information, you have the right to withdraw your consent at any time. Right to Know: You have a right to know what personal information we collect, process, and share or sell. This policy is meant to provide transparency with regard to your data. If you have additional questions, you can email us at privacy@ziffdavis.com. Right of Access: You can request a copy of the personal information we have collected about you from us. Right to Delete/Erase: You can request us to delete all the information we have collected about you. It is important to note that by exercising your right to deletion you may lose access to your account and any purchases, points or features associated with it. If you wish to cancel your account or request that we no longer use some or all of your information to provide you services, contact us at privacy@ziffdavis.com. Right to Request Rectification: If you find that any of your information that we are processing is inaccurate, you can contact us to have your information corrected. In response, we will cancel or remove your information but may retain and use copies of your information as necessary to comply with our legal obligations, resolve disputes, and enforce our agreements. For certain requests, we may require additional information. Right to Opt-out of the Sale or Sharing for Targeted Ads: Under some circumstances we may sell or share the personal data you provide to us to provide ads to you that align with your interests. If you would prefer not to have your data sold or shared, you can opt-out of selling or sharing by submitting a request via Privacy Portal or by emailing privacy@ziffdavis.com. We may ask for additional information to verify your request. Right to Object to the Processing: You can object to our processing of your personal information via our Privacy Portal, under certain circumstances. By objecting to processing, you may not be able to access some or all of our services. This right is limited to personal data processed for commercial purposes. Right to Object to the Use of Sensitive Personal Information: You have the right to object to our use of your sensitive personal information. Sensitive personal information is information about your health, race, religion, sexual orientation, gender identity, political opinions or philosophical beliefs. You should always be mindful about the personal information you share online, especially when it is sensitive in nature. Right to Object to Automated Processing: You have a right to object to the processing of your data for the purposes of automated decision making about you. Right to not be Discriminated Against: You have a right to not be discriminated against for exercising your rights. Right to Complain (EU, UK, Switzerland): Should you wish to raise a complaint about the collection or use of your information, you have the right to do so without prejudice to any other rights you may have. You may lodge a complaint with your local data protection authority. Right to an Authorized Agent (CA): If you would like to make a request on behalf of a California consumer who is a current or former customer, please provide an email from the email address we have on file for the customer authorizing the request. You may also make a request under the California Consumer Privacy Act on behalf of a California consumer if you provide (1) a signed, written permission from the consumer to act on your behalf, and the consumer verifies their own identity directly with us; or (2) proof that the consumer has provided you with power of attorney pursuant to Probate Code sections 4000 to 4465. We may deny a request from an agent that does not submit proof that they have been authorized by the consumer to act on their behalf. In order to make privacy requests please visit our Privacy Portal and fill out the form. You can also email us at privacy@ziffdavis.com. Our contact information can be found in the “Contact Details” section below. You may be required to verify your identity before we can give effect to these rights. If you are making a request on behalf of a user, we require a signed authorization letter from the consumer. 13. How to Change Your Preferences You can change your preferences at any time. Below is a list of some of the actions you can take. Changing Your Own Information: Keeping your personal information current helps ensure that we offer you the best coupons available for merchants and business partners. You can do several things to help keep your personal information up-to-date. You can login to the Services via a desktop computer and click the “Profile” link to update or delete the information you provided us to use in your profile. We may retain and use copies of your information as necessary to comply with our legal obligations, resolve disputes, and enforce our agreements. Your Newsletter and Email Subscriptions. You can opt out or unsubscribe to a newsletter or other email list at any time by following the instructions at the end of the newsletters or emails you receive. Please allow five to ten business days for changes to take effect. On some Services, member service-related communications are an integral part of the service to which you subscribe and you may continue to receive emails as part of that particular portion of the services, even if you opt out of the newsletters or email list. In these cases, you cancel your account to cease communication. Also note that if you have provided more than one email address to us, you may continue to be contacted unless you request to unsubscribe each email address you have provided, or delete your accounts. Direct Mailings, Push Notifications, and Unsubscribing. Where you have consented to receive marketing communications from us, we will send you emails and/or push notifications (depending on what you have consented to). You may withdraw your consent for email marketing communications (i.e. unsubscribe) at any time by (i) clicking the “Unsubscribe” link in a marketing communication email we send you; or (ii) using the “Notifications” or “Settings” page in the account area. You may unsubscribe from web-related notifications at any time through your browser settings. You may also unsubscribe by emailing our support team(s) at the email addresses below. Please allow two working days for this instruction to take effect in all of our systems. Opting Out of Tracking. Currently, our Services do not recognize browser do-not-track signals. However, you may manage how your browser handles cookies and related technologies by adjusting its privacy and security settings. Browsers are different, so refer to instructions related to your browser to learn about cookie-related and other privacy and security settings that may be available. The Help portion of the toolbar on most browsers will tell you how to prevent your computer from accepting new cookies, how to have the browser notify you when you receive a new cookie, or how to disable cookies altogether. OBA. Ziff Davis is a member of the Digital Advertising Alliance (“DAA”) in the U.S., E.U. and Canada and uses third party assurance platforms to comply with the DAA principles. Ziff Davis strives to adhere to the self-regulatory organization principles for the DAA (US), the DAAC (Canada) and the EDAA (EU). Online ads on the Services using Online Data are delivered with the DAA Ad Marker Icon , which helps users understand how their data is being used and provides choices for users who want more control. This icon is also on each of our web pages and applications where Online Data is collected that will be used for OBA purposes. The DAA Ad Marker Icon provides information (and links to other information) on online behavioral ads, who is collecting and using your Online Data, how you can opt out and more. If you would prefer that we not collect Online Data that may be used to help determine which advertisements to serve you, opt out by clicking this icon , which can be found on most of our webpages and mobile applications. European Union and Switzerland residents should visit the European DAA by clicking here. Canadian residents should visit the DAA of Canada by clicking here. U.S. residents and residents of all other countries or territories not listed above can click here for the DAA site to learn more about the use of cookies, your opt-out choices, and more. Location Based Services. You may opt-out of having your Precise Location Data collected at any time by editing the appropriate setting on your mobile device (which is usually located in the Settings area of your device). California Residents. In accordance with the California Online Privacy Protection Act, we may collect Personal Information about your online activities when you use our services. California’s “Shine the Light” law permits our users who are California residents to request and obtain certain information about any Personal Information disclosed to third parties for direct marketing purposes. If you are a California resident and wish to make such a request or if you wish for us to refrain from gathering your Personal Information, please submit your request in writing to us using the contact details in Section 14. 14. Contact Details You can submit privacy related inquiries to our Privacy Portal. For any additional questions, you can contact us by emailing privacy@ziffdavis.com or at the following address: Ziff DavisAttention: Legal Department360 Park Avenue South, 17th FloorNew York, NY 10010 We have registered our DPO with the Irish Data Protection Commission. If you have any questions or concerns about our privacy practices, we encourage you to contact our DPO at the following email address dpo@ziffdavis.com or at the following address: Ziff DavisAttention: Legal DepartmentUnit. 3.1, Woodford Business ParkSantry,Dublin 17Ireland 15. Children These services are not intended for use by children, especially those under 18. We reserve the right to remove a user’s account at any time, when necessary, if we discover that a user is under the required age limit for the service. If you have reason to believe we have collected personal information from someone under 18, please report it to us so we can take appropriate steps to rectify this. 16. California Consumer Rights Metrics Pursuant to the California privacy regulations, our consumer rights metrics can be found on our Regulatory Information Site. 17. How this Privacy Policy May Change This policy may be amended or updated from time to time at our discretion. Any updates will be effective at the time of publication, unless specified otherwise. Your continued use of our services after the publication of a policy update constitutes your consent to the changes. We will notify you prior to making policy updates that materially change the way we treat your personal data, and will not use your data in a materially different manner without your consent."
    },
    {
      "url": "https://mashable.com/article/best-summer-movies-streaming",
      "text": "10 best summer movies now streaming\nThe heat is on! And if you're looking to enjoy the summer while staying cozy in an air-conditioned home, we've got you covered.\nEach week, our New to Streaming guide offers the best (and worst) titles new to streaming platforms like Hulu, Netflix, HBO Max, Peacock, Paramount+, Apple TV+, and more. Beyond that, we offer watch guides for all of the above streamers, broken down by genres like comedy, thriller, horror, documentary, and animation, among others. But if you're looking for something that just says \"SUMMER\" — we're here to help.\nLooking across platforms, here are 10 movies that revel in vacation vibes, getaway thrills, and even some steamy romance. All you've got to do is click through and hit play.\nRead on for the best summer movies now streaming, plus a wild card that's been heating up on social media.\n10. The Sandlot (1993)\nWant something family-friendly for a summer movie night in? The Sandlot is a home run.\nSet in the summer of 1962, this beloved kids' movie is a look back at a formative summer in which a new kid on the block found his crew in a scrappy team of backyard baseball lovers. In the San Fernando Valley, Scotty Smalls is awkward and far from athletic. But to make friends, he'll do just about anything — even venture into the backyard of local legend The Beast (meaning a big, mean dog that's definitely eaten people before).\nYet this Beast plotline is far from the only summer adventure The Sandlot offers. With a collection of quirky characters like Benny the Jet, Ham Porter, Yeah-Yeah, and Squints, this nostalgic romp is full of fun and funny moments. It's also a charming coming-of-age story that happened to give us a catchphrase that's proved only more useful as we grow up: \"You're killing me, Smalls!\"\nHow to watch: The Sandlot is now streaming on Hulu and Disney+.\n9. In the Heights (2021)\nCruelly, summer isn't all about vacations. But even if you're working hard, that doesn't mean love, friendship, and dreamy days of music and summer fun are off the playlist.\nAdapted from Hamilton's Lin-Manuel Miranda's other Tony Award–winning musical, In the Heights stars Anthony Ramos as Usnavi de la Vega, an immigrant from the Dominican Republic who's living and loving in the Washington Heights. Directed by Wicked helmer Jon M. Chu, the stage show becomes a cinematic tour across the lively New York City neighborhood, where an ensemble of colorful locals break into song and dance with captivating verve.\nWhether in a busy bodega, a popping beauty salon, on the bustling streets, or in a crowded public pool, In the Heights is a celebration of community and the immigrants who built it but are being forced out through gentrification. A story that's moving, timely, and crowd-pleasing, In the Heights will have you jumping out of your seat and singing along.\nStarring: Anthony Ramos, Corey Hawkins, Leslie Grace, Melissa Barrera, Olga Merediz, Daphne Rubin-Vega, Gregory Diaz IV, and Jimmy Smits\nHow to watch: In the Heights is available for rental or purchase on Prime Video.\n8. Dirty Dancing (1987)\n\"Iconic\" is a word that gets thrown around a lot these days. But this summer romance starring Jennifer Grey and a rugged Patrick Swayze is truly iconic. Written by Eleanor Bergstein and directed by Emile Ardolino, Dirty Dancing was dripping with nostalgia for the 1960s with its torrid tale of a teen girl's first love.\nGrey stars as Frances \"Baby\" Houseman, who is less-than-thrilled on vacation at a boring Catskills resort with her preppy family. Then she meets dance instructor Johnny Castle (Swayze), who inspires a fire inside her that makes her not just want to dance — but to dirty dance.\nA sizzling soundtrack and steamy scenes of seduction to a still sexy score make for a movie that's almost too hot to handle. But heads up, the movie's themes of class conflict and a woman's right to her own body are going to feel less dated, and more horridly timely.\nStarring: Patrick Swayze, Jennifer Grey, Jerry Orbach, and Cynthia Rhodes\nHow to watch: Dirty Dancing is now streaming on MovieSphere+.\n7. Girls Trip (2017)\nThere are several great comedies about girls' trips, from Bridesmaids to Rough Night, Romy and Michele's High School Reunion, and To Wong Foo, Thanks for Everything! Julie Newmar. But Malcolm D. Lee's Girls Trip is undoubtedly the best when it comes to capturing the unique fun, thrills, and mayhem of summer good times.\nWritten by Kenya Barris and Tracy Oliver, Girls Trip follows a group of Black friends (Regina Hall, Tiffany Haddish, Jada Pinkett Smith, and Queen Latifah) who head to New Orleans for the Essence Music Festival. Praying and partying together since college, their lives have pulled them down different paths, both personal and professional. But on this trip, they'll see a whole new side to one another, and discover things about themselves, be it on a zipline or an absinthe trip!\nA wild and warm film that powerfully celebrates Black joy, Girls Trip is side-splittingly funny, with sequences that'll have you cackling — and maybe inspire you to plan a girls' trip of your own.\nStarring: Regina Hall, Tiffany Haddish, Larenz Tate, Mike Colter, Kate Walsh, Jada Pinkett Smith, and Queen Latifah\nHow to watch: Girls Trip is now available for rent or purchase on Prime Video.\n6. A Perfect Getaway (2009)\nThis is one of those movies that just deserved better. Written and directed by David Twohy, A Perfect Getaway is the kind of summer thriller that's so twisted and sexy you're going to want to watch it again immediately. And yet when it came out, it fizzled at the box office and got mixed reviews from critics. But hear me out.\nSteve Zahn and Milla Jovovich star as newlyweds, flush with cash from their \"wedding haul\" and giddy to explore the natural wonders of Hawaii on a long hike into its tropical hiking trails. There's just one problem. News reports say there are a couple of killers on the loose on the island, and they seem to be targeting honeymooners. Several suspects pop up along the trail, like a hippie couple with a hostile edge (played by Chris Hemsworth and Marley Shelton), or the braggadocio veteran full of tall tales and his hillbilly girlfriend (Timothy Olyphant and Kiele Sanchez). Who's a threat and who's going to make it out alive?\nThere's only one way to find out. Watch and see.\nStarring: Steve Zahn, Milla Jovovich, Chris Hemsworth, Marley Shelton, Timothy Olyphant and Kiele Sanchez\nHow to watch: A Perfect Getaway is now streaming on HBO Max.\n5. Dìdi (2024)\nWant to feel like a kid again? Are you sure? One of our favorite films of 2024, Dìdi captures what it felt like to be coming of age in the 2000s, capturing the good, the bad, and the AIM messaging.\nSet in the summer of 2008, the directorial debut of writer/helmer Sean Wang follows a 13-year-old Taiwanese American boy (Izaac Wang) who goes by several names (Chris/Dìdi/Wang Wang), all the better to code-switch for his family, skater friends, school crush, and beyond. As he looks to make the most of his summer, this eager-to-impress hero lays down little white lies, flirts poorly, alienates friends with off-putting anecdotes, and screams at his devoted mom (Joan Chen). And those of us who've lived through such hot, hormonal, and socially awkward days may cringe in recognition every step of the way.\nThen, on top of all this, the emotionally intelligent filmmaker also captures the heartache and earnestness a generation first poured into MySpace and AIM Instant Messenger. Watching Dìdi is less like taking a vacation and more like time-traveling, because the director and his young cast so superbly recreate this era and its anxieties. It's not just a good summer movie, or a great coming-of-age movie, it's an excellent movie that's an absolute must-see.\nStarring: Izaac Wang, Joan Chen, Shirley Chen, Chang Li Hua, Mahaela Park, and Raul Dial\nHow to watch: Dìdi is now streaming on Prime Video.\n4. Independence Day (1996)\n'Tis the season to revisit co-writer/director Roland Emmerich's national treasure, Independence Day. This Hollywood blockbuster was not only a hit in its own time, but also stood out as the best of a flood of '90s disaster movies. And it didn't hurt that this one was flooded with famous faces.\nJeff Goldblum (making his first appearance on this list, but not the last!) stars as a scientist who realizes there's something sinister in the arrival of a fleet of UFOs around the world. Naturally, he reaches out to his ex-wife, who is White House communications director (Margaret Colin) to the president (Bill Pullman). After some heart-racing destruction, he and a hot-shot Marine pilot (Will Smith) are pulled into a Hail Mary mission to save all mankind from a ruthless alien invasion.\nIt's a true ensemble piece that transports audience from the Oval Office to the bustling streets of New York City to humble trailer parks and the mysterious Area 51, along the way introducing a varied array of characters and making the action come to life with a backdrop of ardent humanity. It's a movie about overcoming our differences to fight a greater threat that would rather see us die than coexist. Between Bill Pullman's rousing speech to the explosive finale, Independence Day is a ray of hope, there whenever you need it.\nStarring: Will Smith, Bill Pullman, Jeff Goldblum, Mary McDonnell, Judd Hirsch, Margaret Colin, Randy Quaid, Vivica A. Fox, Brent Spiner, Harry Connick, Jr., Robert Loggia, James Rebhorn, and Harvey Fierstein\nHow to watch: Independence Day is now streaming on Hulu.\n3. Jurassic Park (1993)\nSteven Spielberg would come to define summer movies with a series of epic offerings, two of which made this list. Based on the Michael Crichton novel, Jurassic Park dreamed up an absolutely epic amusement park, where families could come and ride rides, buy overpriced merch, and see actual living, breathing dinosaurs. But despite the \"spared no expense\" enthusiasm of Jurassic Park founder John Hammond (Richard Attenborough), life — uh — found a way. Basically, yeah, the ancient beasts broke loose of our puny modern containment units and turned would-be tourists into prey.\nAmong those on the run are a trio of experts that Hammond had hoped would endorse his venture. But grumbly paleontologist Alan Grant (Sam Neill), plucky paleobotanist Ellie Sattler (Laura Dern), and ruthlessly sexy mathematician Ian Malcolm (Jeff Goldblum) soon go from awed by these resurrected dinosaurs to running away from them. (\"Must go faster!\")\nSpielberg not only managed to make a movie that was so wildly entertaining that other filmmakers are still plagiarizing his sequences 30 years later — looking at you Colin Trevorrow! — but also brought together a cast that was as utterly captivating as his jaw-dropping dinosaurs. Neill, Dern, and Goldblum have a hot and chaotic tension that's launched countless crushes and ships. And while you can also stream this movie's many sequels, none will hit quite as hard as the first.\nStarring: Sam Neill, Laura Dern, Jeff Goldblum, Richard Attenborough, B.D. Wong, Ariana Richards, and Joseph Mazzello\nHow to watch: Jurassic Park is now streaming on Peacock.\n2. Barb and Star Go to Vista Del Mar (2021)\nYou might have missed this comedy gem, as the COVID-19 pandemic led to a serious Hollywood shake-up that pushed Barb and Star to a VOD release rather abruptly in Feb. 2021. But it was the summery friendship cocktail we craved in a dark time, and still do, over and over.\nWritten by and starring Bridesmaids' scribes Kristen Wiig and Annie Mumolo, Barb and Star Go to Vista Del Mar is a madcap buddy comedy that balances a tale of middle-age besties looking to get their groove back on a joint vacation to a bubbly beach town with an Austin Powers-worthy supervillain who's looking to annihilate the titular destination. Mumolo and Wiig headline as Barb and Star, roomies who are seeking tit-flapping fun in the sun — and maybe romance! And they find both when they meet a handsome hunk (Fifty Shades of Grey's Jamie Dornan), who is secretly doing the bidding of the wicked, villainous Sharon Fisherman (also Wiig).\nIf that plot sounds bonkers, oh baby, you don't even know. From Josh Greenbaum, the director of the funny friendship doc Will and Harper, Barb and Star offers the kind of deeply dumb humor that's weirdly brilliant. There's physical comedy, celebrity cameos, quotable lines, and a musical number that's as inexplicable as it is awesome.\nStarring: Kristen Wiig, Annie Mumolo, Jamie Dornan, Damon Wayans Jr., Andy Garcia, and Reba McEntire\nHow to watch: Barb and Star Go to Vista Del Mar is now streaming on Hulu.\n1. Jaws (1975)\nThe historical blockbuster is a summer tradition for good reason. When it came out 50 years ago, it scared a generation into being afraid of sharks and the ocean. Since then, it's spawned three sequels (also all streaming) and an array of imitators. Some were good (Deep Blue Sea, 47 Meters Down, The Shallows, Dangerous Animals) and some were very, very bad (Under Paris, Sharknado, Shark Night).\nThe original was helmed by Steven Spielberg, who feared his unreliable robot shark Bruce would be the end of his burgeoning career. Spoiler: It was not. Instead, Jaws launched Spielberg and became one of the most iconic movies of all time. Roy Scheider stars as Sheriff Martin Brody of Amity Island, a place that absolutely depends on tourists' dollars come summer. When a swimmer turns up chewed to bits on their picturesque beach, the money-hungry mayor (Murray Hamilton) demands the beach stay open on the 4th of July. More deaths will follow, pushing the thalassophobic Brody into the sea aboard the Orca, captained by the surly Quint (Robert Shaw) and aided by the smug shark expert Hooper (Richard Dreyfuss).\nSure, on the surface, this is a creature feature, rich with blood, scary attack sequences, and an epic final showdown. But beneath this splashy spectacle, Jaws is also a tale of greed, masculinity, and family. Fifty years later, it's still making a big splash.\nStarring: Roy Scheider, Robert Shaw, and Richard Dreyfuss\nHow to watch: Jaws 1-4 are now streaming on Peacock.\nWild Card: Copycat (1995)\nA solid box office success in 1995, this serial-killer thriller somehow flew under the radar pop culture-wise until recently. I say this as someone who's been low-key obsessed with Copycat since I first saw it back in 1995, when I was definitely too young to be watching this R-rated movie, which features graphic scenes of sexualized violence against women. But hey, parenting was a lot different before everyone had the internet on their phones.\nAnyhow, Copycat has hit Netflix, sparking new interest and audiences. And it's about time. Sure, some things about this '90s thriller feel a bit dated. But the core story is about true crime obsession and being maybe too online. So, it fits pretty well into our modern moment.\nSigourney Weaver stars as a criminal psychologist who has developed agoraphobia after being violently attacked by a stalker. Though he's been imprisoned, she's under threat once again when a new serial killer begins teasing cops by meticulously re-enacting the crimes of notorious serial killers like the Boston Strangler, the Hillside Strangler, and Jeffrey Dahmer. On the case is the unassuming inspector M.J. Monahan (Holly Hunter) and her flirtatious partner Reuben Goetz (Dermot Mulroney), who chase down every lead — including the captured stalker played by a Southern-fried, dirty-talking Harry Connick Jr.\nDeranged, sexy, and surprising, Copycat is a juicy watch, whether you've seen it before or not. Weaver is riveting as a devastatingly intelligent woman whose fear of the outside world has chased her to live chiefly online through chat rooms. (Oh, the '90s!) Hunter and Mulroney have a crackling will-they-won't-they chemistry, while Connick (and his secret cohort) offer a chilling portrayal of villainy. It's not strictly a summer movie, but it is hot, sticky, and exciting — kind of like a rollercoaster!\nStarring: Sigourney Weaver, Holly Hunter, Dermot Mulroney. William McNamara, Will Patton, John Rothman, J. E. Freeman, and Harry Connick Jr.\nHow to watch: Copycat is now streaming on Netflix.\nTopics Streaming Watch Guides\nKristy Puchko is the Entertainment Editor at Mashable. Based in New York City, she's an established film critic and entertainment reporter who has traveled the world on assignment, covered a variety of film festivals, co-hosted movie-focused podcasts, and interviewed a wide array of performers and filmmakers."
    },
    {
      "url": "https://linktr.ee/boysgotojupiterfilm",
      "text": "Boys Go to Jupiter 🍊 Official Trailer\nNew York Times Review\n8/8 NYC Q&A: Julian Glander, moderated by Delaney Rowe\n8/9 NYC Q&A: Julian Glander, moderated by Michael Cruz Kayne\n8/10 NYC Q&A: Julian Glander, moderated by Dean Fleischer Camp\n8/10 NYC Q&A (New Plaza Cinema): Julian Glander\n8/13 LA Q&A: Julian Glander, moderated by Sean Buckelew\n8/15 LA Q&A: Julian Glander, Jack Corbett & Demi Adejuyigbe\n8/16 LA Q&A: Julian Glander & Jack Corbett, moderated by Atsuko Okatsuka\n8/17 LA Q&A: Julian Glander & Jack Corbett, moderated by Mita Jouhari\n8/20 Santa Ana Q&A: Jack Corbett\n8/28 Rochester, NY Q&A: Julian Glander (virtual)\n9/5 Cleveland Q&A: Julian Glander\nNew York City (IFC Center) Tickets - 8/8\nNew York City (New Plaza Cinema) Tickets - 8/10\nLos Angeles Vidiots Sneak Peak! - 8/13\nCharlotte Tickets - 8/15\nColumbus Tickets - 8/15\nLos Angeles (Glendale) Tickets - 8/15\nNew Orleans Tickets - 8/15\nOttawa Tickets - 8/15\nSan Diego Tickets - 8/15\nSan Francisco Tickets - 8/15\nSeattle Tickets - 8/15\nToronto (TIFF Lightbox) Tickets - 8/15\nToronto (Fox Theatre) Tickets - 8/15\nEmmaus Tickets - 8/16\nPhiladelphia Tickets - 8/17\nTuscon Tickets - 8/19\nSanta Ana Tickets - 8/20\nBaltimore Tickets - 8/21\nChicago Tickets - 8/22\nLas Vegas Tickets - 8/22\nRochester, MN Tickets - 8/22\nAlbuquerque Tickets - 8/25\nEdmonton Tickets - 8/25\nRochester, NY Tickets - 8/28\nSioux Falls Tickets - 8/28\nSt Louis Tickets - 8/28\nPortland, ME Tickets - 8/29\nCleveland Tickets - 9/5\nBerkeley Tickets - 8/15\nHudson Tickets - 8/15\nSanta Fe Tickets - 8/15\nSebastopol Tickets - 8/15\nWilmington Tickets - 8/15\nKansas City Tickets - 8/16\nAkron Tickets - 8/23\nHalifax Tickets - 8/23\nWinchester Tickets - 9/3\nAtlanta Tickets - 9/5\nPittsburgh Tickets - 9/5\nTallahassee Tickets - 9/6\nSan Luis Obispo Tickets - 9/11\nBrooklyn Tickets - 9/24\nLetterboxd\nIMDB\nIndie Animator Julian Glander’s ‘Boys Go to Jupiter’ With Voices by Julio Torres and Cole Escola Picked Up for Distribution by Cartuna and Irony Point\nBoys Go to Jupiter | 2024 Tribeca Festival | Tribeca\nView on mobile"
    },
    {
      "url": "https://mashable.com/article/problemista-tilda-swinton-julio-torres-interview",
      "text": "Tilda Swinton and Julio Torres reveal 'Problemista's unexpected common ground\nIn Problemista, Tilda Swinton and Julio Torres costar in the latter's directorial debut as a pair of unlikely friends experiencing very different sides of New York's perilous power dynamic. As a long-established and feared art critic — and a rich white woman to boot — Elizabeth wields a great deal of status and privilege along with, as Swinton puts it, \"the mighty sword of complaint.\" But as a newcomer to New York who's struggling to secure an immigration visa, Salvadoran toy designer Alejandro sheepishly trots through an obstacle course of poverty, squalor, and easily bruised egos. Despite their differences, they have an undeniable connection.\nWhen Mashable sat down with Swinton and Torres over Zoom, we not only talked trash but also dug into the central bond between Elizabeth and Alejandro. The leading lady and the writer/director/actor offered insights into the backstories that bind them, as well as how RZA's eccentric painter Bobby fits into their dynamic.\nJulio Torres shares the secrets of Problemista's misfits.\nThis outstanding A24 comedy depicts New York City of a place made up of big dreams and crushing disappointments. Street corners are piled with trash and treasures, and every character can be both a savior and a literal beast. Yet within this, there's an optimism in how two misfits find each other.\nStriving to get a fellowship with Hasbro toys, Alejandro (Torres) is scraping by on survival jobs to maintain his work visa. While working at a shabby cryogenics lab, he meets the fiery wife (Swinton) of a frozen artist (RZA), who offers him a path to sponsorship. While Elizabeth jabbers endlessly and has unlimited demands, she dazzles Alejandro with the command she takes over every situation, from ordering a salad to dictating the layout of a gallery show for her frosty beloved. And in return she, in her own intense way, takes him under her wing.\nTorres spoke to their connection, saying, \"They are both outsiders in that sense. I think that this is a movie that is about 'the other.' And I think that Alejandro is an outsider. Elizabeth is an outsider. Bobby's an outsider. So it makes sense that Bobby and Elizabeth attracted each other.\" In the film, Alejandro is trying to break into the toy-making industry. Elizabeth has been ostracized from the art community, seemingly for her aggressiveness and single-minded devotion to Bobby's paintings, which focus solely on unhatched eggs. And in turn, Bobby felt so outside the art scene that he froze himself, hoping to find a future where his work would be better appreciated.\n\"They're just desperately trying to find a way in,\" Torres said of the trio. \"Alejandro is trying to very quietly and very politely make his way in. Elizabeth has resolved to bulldoze her way in. And they both really have a lot to learn from each other. And that is what's at the heart of the movie, is just this idea of sort of seeing another other and just sort of understanding each other, even though their experiences are so — on paper — so, so radically different.\"\nTorres explained, \"This is why the character of Bobby, he's sort of at the nucleus of the film. Because his whole thing is being in the fringes of the art world, right? Like, never being fully let in. He's literally living in a commune where they won't even show his paintings.\"\nDetailing the part Bobby has to play in his situation, Torres added, \"It's sort of circumstantial, but it's also a little voluntary, because he refuses to paint anything that isn't eggs. And he's an outsider, but he's proud of it. He wants to make his way in by virtue of being an outsider, by virtue of being different. And Alejandro was motivated by that. Elizabeth sees herself in that. So, in the movie, everyone is sort of like drowning and gasping for air. And in this movie, they sort of like see each other and sort of like gain empathy for each other.\"\nTilda Swinton on the background of her hydra.\nIn the shared interview, Swinton concurred with Torres, noting of Elizabeth and Alejandro and Bobby, \"They're in these similar predicaments. They have these dreams! And they're really fueled by their dreams. And I think the film is very compassionate about that. You know, we're not for one instant sneering at any of these people for having these dreams.\"\nShe went onto to detail how the trio handles being an outsider in different ways. \"Bobby is a victim. He's just decided to be a victim,\" Swinton explained. \"And Elizabeth wields the mighty sword of complaint. She just complains about everything, about everything. She's just on that setting. And the thing that's magical is that it looks like that's not working for her for the longest time.\"\nEasing into a discussion of the film's final act, in which Alejandro learns to take a cue from Elizabeth's approach to get what he really wants, Swinton continued, \"Then — not to spoil anything — we learn the value of that [complaining]. And I find that still very, very moving that that's not a position that she's taken lightly.\"\nExpanding on how Elizabeth becomes a mentor of sorts to Alejandro, Swinton continued, \"She teaches a little — both actively but also by osmosis — Alejandro, to adopt it and to work it, but to his advantage. And of the three of them, he prevails because he has his dreams, but his position is not to be a victim, not to wield the mighty sword of complaint, but to observe. And to just keep dreaming somehow, but to have this sort of slightly exterior position. Then there's a bit of mix and match.\"\nSwinton and Torres reveal Elizabeth's unspoken origins.\nBeyond being a pair of outsiders with big artistic dreams, Elizabeth and Alejandro have a similarity in their backstories that's not explicitly explored in Problemista. In discussing the film's costuming, Torres shared not only how Elizabeth's wardrobe hints at her dragon-like nature, but also to who she was before she met Bobby.\n\"[Her outfits] also allow you to imagine her younger,\" Torres said, \"[In creating the character,] Tilda and I were talking like, 'Oh, she feels like she was a groupie of some band at some point.' So, it is a lot of really tight black leather pants that she wears. It really gives her such a backstory because you imagine like, when did she get these pants?\"\nFor Swinton, who picked Elizabeth's precise English accent because it got a laugh out of Torres, the clothes helped shape an arc for her character outside of the film. \"All the leather and the sort of slight rock 'n' roll pose,\" Swinton noted before explaining, \"If you want some justification or some idea of a backstory, my idea was that she had been a girl at the Glastonbury Music Festival. And she was a groupie of some American band. And she sort of fallen in with some rock star, and [followed him] back to America, and then sort of broken up with him, and then sort of drifted into the art world.\"\nFrom there, Swinton drew influence from the New York art scene, pulling from the downtown fashions costumer Catherine George curated for Elizabeth, but also the \"the frostiness, the sort of slight patchouli dreamcatcher element\" that she found \"not far away from even the uptown New York art scene, actually. The dreamcatcher and the upscale art scene — they're not divided by much.\" Swinton would know, having famously taken part in a performance art installation at MOMA in which she slept on display in a glass box.\nYet Swinton connected with Elizabeth on another level, in her appreciation for Bobby's art. Asked if there was a bit of the costuming or production design she had taken from the set, Swinton said no. But she added, \"I did hint rather too gently that I had my eyes on [the painting] Blue Egg on Yellow Satin. Maybe one day [I'll get it.] There is a sort of gap on one of my walls that it would fit very nicely.\"\nProblemista is now in theaters nationwide.\nTopics Film\nKristy Puchko is the Entertainment Editor at Mashable. Based in New York City, she's an established film critic and entertainment reporter who has traveled the world on assignment, covered a variety of film festivals, co-hosted movie-focused podcasts, and interviewed a wide array of performers and filmmakers."
    },
    {
      "url": "https://mashable.com/article/problemista-julio-torres-tilda-swinton-trash",
      "text": "Talking trash with 'Problemista's Tilda Swinton and Julio Torres\nWelcome to Thanks, I Love It, our series highlighting something onscreen we're obsessed with this week.\nWith the critically heralded comedy Problemista, writer/helmer/star Julio Torres not only made his audacious directorial debut, but also placed his unique version of New York City onto the cinema landscape. Alongside a radiant and ruthless Tilda Swinton, Torres unfurls a tale of immigrants and outsiders who make the city their home, while acknowledging the iconic metropolis's heady blend of high art and heaping garbage.\nAs I wrote in my review of the film, \"From the moment I saw the trash piles in Problemista, I understood Torres's New York. Like Scorsese's of the '70s, it's a metropolis covered in mountains of trash, making the sidewalks an obstacle course for humans and an all-you-can-eat buffet for rats. However, in Problemista, these piles of garbage are peppered with whimsy. Beautiful paintings casually rest amid white trash bags. A glittering hula hoop or a rainbow umbrella, open and reaching high, protrudes from another pile. Unspoken but clearly presented is the New York City culture of trash-picking, where the haves will pitch their goods to curb, where the have-nots will gratefully carry items home (probably awkwardly on the subway), literally making another person's trash their treasure.\"\nWhen Mashable sat down with Torres and Swinton via Zoom to discuss Problemista, naturally, I asked about the trash. This led to a thoughtful exploration of the film's production and costume design, ranging from empty water bottles to tapestry and unexpected influences, both medieval and modern.\nJulio Torres on the trash in Problemista.\nProblemista stars Torres as Alejandro, an aspiring toy designer from El Salvador who not only struggles to break into that industry but also to stay in the States, where the American immigration process is depicted as a literal labyrinth of mind-snapping obstacles. While Torres's film takes flights of fantasy in laying out these difficulties — including hourglasses that make immigrants vanish when the sand runs out and a particularly explosive conversation with a Bank of America phone operator — he uses literal trash to defy the image of a glittering metropolis favored by so many studio movies about New York.\n\"I had been raised on a certain kind of New York movie,\" Torres explained, \"Which was always very, very skyscraper-forward, pristine, pretty idealized New York. Then when I first came here, I was just like, 'Oh, there's just garbage everywhere.' Then I just sort of like fell in love with the garbage, and started noticing all these like very natural still lives of garbage throughout the city.\"\nWhen choosing a production designer, Torres was determined to capture that mix of wonder and revulsion. So he was elated to work with Katie Byron, the production designer of Janicza Bravo's Zola, a willfully seedy comedy based on the famous Twitter thread. \"Something that I loved about her production design in Zola,\" Torres explained, \"Is that there's plastic bags in every room. There's just so many plastic bags everywhere. And I was like, 'Oh, yeah, that's what it's like to live there.' So I just really wanted to like celebrate that in the movie.\"\nTilda Swinton relishes the trashy aesthetic of Problemista.\nIn Problemista, Swinton plays Elizabeth, an art critic who can push anyone to do her bidding with — as Swinton puts it — \"the mighty sword of complaint.\" Crossing paths with Alejandro at a cryogenic facility, the pair form a tumultuous friendship as he helps her mount a gallery show for her frozen husband (RZA), and she holds the carrot of sponsoring his immigration. But there's more to her snarling New Yorker than meets the eye.\nFor Swinton, the details of the production design — down to the trash piles — connected to her own appreciation of the sour yet sensational city. \"I feel very similarly to Julio,\" the British actress began. \"Coming to New York for the first time. and coming from the countryside it felt like — you know, you're in the jungle. Literally, you're in a jungle. You're in a natural environment not just because of the trash but also because of the rats! You know, you are out there in the wilds when you're in New York, and I happen to love it for that reason.\"\nSwinton continued, \"I always get a little discomforted when I come back to New York and someone's tidied a corner up. And then you come back a few years later, and someone's like, messed it up again, you go, 'Phew! Got it back.' But the movie is about wild animals to a certain extent and being in the jungle. And I was playing a dragon. And it felt very comforting to be in what Katie and Julio made. That environment felt very sort of harmonious.\"\nTo this Torres added, \"Elizabeth also just carries trash with her at all times.\"\n\"Always,\" Swinton agreed, \"Why would you put it down? It's useful.\"\nHow trash and tapestry informed Problemista's Hydra.\nTorres's brand of clever whimsy shapes Problemista as a modern fairy tale in which Alejandro is a valiant knight on a noble quest to make oddball toys. And in this scenario, Elizabeth is a dragon, breathing metaphorical fire and — in some more fantastical sequences — literally transforming to look like her cruel nickname from the New York art scene: the Hydra.\nAs any dragon worth her scales, Elizabeth has a tendency to hold onto trash and treasures. So, she walks around constantly with an empty plastic water bottle in her claws and is fixated on her inventory of paintings (specifically inventoried in the nightmarish software FileMaker Pro). Swinton spoke of how she and Torres came up with some of Elizabeth's eccentricities. \"I remember the moment when we were talking about purses and, you know, it was a matter of no note between the two of us that she would be carrying always, at least two.\"\nTorres laughed in apparent agreement, as Swinton continued, \"We all know we all do [in New York]. It's only people who want to look like some strange, fictional kind of human who manage to walk around with one.\"\nTilda Swinton and Julio Torres discuss Elizabeth's distinctive aesthetic.\nWith hair dyed flaming red and outfits as outrageous as they are undeniably chic, Elizabeth manages to be fantastical and recognizably New York. But Torres does something more crafty with costuming, layering in dragon-like elements to hint to Elizabeth's most ferocious side.\n\"That was just a wonderful triangular collaboration between Tilda, myself, and Catherine George, our costume designer,\" Torres explained. \"We really wanted to imbue Elizabeth with this sort of hunched-over, like breathing dragon, silhouette. So everything that she wore hinted at [her dragon side]. And there was something sort of medieval tapestry about the way that she dresses. It's a lot of deep greens. It's a lot of maroons. It's like she has an armor in a way. It's almost like she's constantly protected by these scales. And yeah, there's something like very fairy-tale like about the way that she dresses.\"\nSwinton added, \"It's really it was a such a beautiful process with Catherine who is a dear friend of mine. I've worked with her many times before, particularly with Bong Joon-ho (Snowpiercer, Okja), Jim Jarmusch (The Dead Don't Die, Paterson), and Lynne Ramsay (We Need to Talk about Kevin). This challenge — we know we're going to end up with the Hydra. But we have to kind of lay down this trail of breadcrumbs throughout the film. And the thing that's so genius, I think about what Catherine and Julio did with this costume, is that it also is completely authentically downtown New York art world.\"\nTurning to Torres, she said, \"I mean, when you talk about medieval tapestry, yeah, but downtown New York art world, medieval tapestry. It's all kind of the same thing. It's the same vernacular language. Catherine was so up for that — as you say — triangulation. None of us ever walk past — let alone go into a downtown New York art scene party — [without seeing] Elizabeths everywhere. And that hunched, potbellied, kind-of-caught bent hand sort of thing? It's all the rage.\"\nProblemista is now in theaters nationwide.\nTopics Film\nKristy Puchko is the Entertainment Editor at Mashable. Based in New York City, she's an established film critic and entertainment reporter who has traveled the world on assignment, covered a variety of film festivals, co-hosted movie-focused podcasts, and interviewed a wide array of performers and filmmakers."
    },
    {
      "url": "https://mashable.com/article/presumed-innocent-review",
      "text": "'Presumed Innocent' review: Jake Gyllenhaal is the prime suspect in this tense, twisty thriller\nCourtroom thrillers about prosecutors landing in legal hot water are clearly a popular commodity over at Apple. One of the first big series to launch when the streaming platform did was Defending Jacob, the Chris Evans-fronted crime drama about an assistant DA's son being charged with murder.\nThat show proved popular with critics and audiences, so it's no big surprise that Apple is rolling out something similar in Presumed Innocent. It's a star-studded crime thriller about a top prosecutor who becomes the chief suspect in the killing of one of his colleagues.\nThis new mini-series is a fairly stock legal drama that's not necessarily all that new in terms of what it offers. It is, after all, based on Scott Turow's 1987 novel, which was turned into the 1990 Harrison Ford-fronted film — but the story itself feels contemporary, with its themes of sexual power dynamics and legal corruption. What it does, it does very well, with a fast-paced story, well-written script, and excellent performances across the board.\nWhat's Presumed Innocent about?\nPresumed Innocent follows top prosecutor Rusty Sabich (a perma-stressed Jake Gyllenhaal) as he investigates the murder of his colleague Carolyn (Renate Reinsve, The Worst Person in the World).\nThe problem? Rusty was having an affair with Carolyn before she died, and he's about as unreliable as a narrator can get. Soon, slimy rival prosecutors Nico (O-T Fagbenle) and Tommy (Peter Sarsgaard) are looking at him for the murder. Rusty's on a desperate quest to try and save his own life while struggling to keep his family together.\nNot only is Rusty unreliable, he's also fairly unpleasant. Even calling him an anti-hero would be a massive stretch. He’s constantly lying to everyone around him while flying off the handle at anyone who gets in his way, long-suffering loved ones included. Gyllenhaal — who has made a career out of playing conflicted characters — relishes this role, leaning into Rusty's unpleasant mixture of explosive anger, bleary-eyed self-loathing, and ever-present stress while constantly keeping Presumed Innocent's key mystery front and centre: Is he out to prove his innocence, or is he simply trying to hide his guilt?\nPresumed Innocent is TV at its highest quality.\nPresumed Innocent is proof that a TV show is only as strong as the people that put it together. There really are no weak links here. The series is exec produced by J.J. Abrams and Gyllenhaal himself, among others. The showrunner is Big Little Lies creator David E. Kelley, who, alongside Miki Johnson (Ozark) and Sharr White (Palm Royale), delivers a hard-hitting and fast-paced script. (Kelley, who has a J.D. himself, made his name writing and producing TV legal dramas like LA Law and The Practice, so this is his wheelhouse.) Seasoned directors Greg Yaitanes (House of the Dragon) and Anne Sewitsky (Black Mirror) bottle the energy of the story and let the actors shine.\nThe acting is one of the show's greatest strengths. In addition to Gyllenhaal's strong performance, Sarsgaard is perfectly believable as his sleazy rival, and Bill Camp is brilliantly cast as his struggling friend and ally Raymond Horgan. Chase Infiniti and Kingston Rumi Southwick shine as his deeply conflicted children, alternating between wanting to protect their dad and struggling with the very real possibility that he actually did commit this heinous crime. Oscar nominee Ruth Negga (Good Grief, Passing) practically steals the show as Rusty's wife Barbara, who is doing her best to hold down the anger, fear, and hurt bubbling just below the surface. Barbara is a challenging character, but Negga knocks it out of the park with her performance.\nAre there any negatives?\nOkay, yes: Presumed Innocent isn't exactly reinventing the wheel. The format is a formulaic one. All the expected twists and red herrings are there, as are the semi-believable case developments and courtroom drama. Coupled with this, there's the fact that a lot of the characters are pretty difficult to root for — or even like.\nDoes it matter though, at the end of the day? I would argue no. The formula is only a formula because it works; the central mystery hooks us in, and the twists keep us guessing. Presumed Innocent is undeniably compelling viewing.\nHow to watch: The first two episodes of Presumed Innocent premiere June 12 on Apple TV+. Episodes air weekly after that."
    },
    {
      "url": "https://mashable.com/roundup/best-streaming-services",
      "text": "Best streaming services: We compare Netflix, Hulu, Max, Disney+, and more\nOverview\nTable of Contents\nFor anyone out there who might be thinking that their cable provider isn’t that bad, let’s play a little game to put things into perspective. Would you rather date someone who's clingy, makes you spend a ton of money on them, and bosses you around? Or someone who's super chill, lets you do your own thing, and always makes sure you're happy?\nWe’re guessing you’d probably opt for the latter.\nWell, get this: The first relationship is the one you’re stuck in with your cable company right now. And the second relationship? That’s a cool collection of carefully curated streaming services, babe.\nIf you haven’t yet picked up what we’re putting down, we're talking about cord-cutting — a favorite term of the past few years that basically means breaking up with your cable company and only paying for the content you want without messing around with a cable box or satellite. After all, life is just too short to be tied down to an overpriced contract that doesn't even include all the stuff you actually want to watch.\nWhat to consider when choosing a streaming service\nWe're sure you already have Netflix for binge-watching movies and some TV shows, and it's an amazing service for that purpose, but that's obviously not a complete replacement for cable and live television. The reality is that you might have to get more than one service to cover all of your needs. Then again, having every single streaming service isn't doable for everyone. After cutting the cord, there's no sense in loading yourself up with streaming subscriptions that total up to more than your cable bill ever was. So, you'll want to be very deliberate about which ones you end up subscribing to.\nThe streaming service market has grown exponentially over the past few years with almost too many plans and channel options to pick from, and you're probably panicking and wondering which streaming service is right for you. As per usual, the answer to that is entirely dependent on what you're looking for in your streaming service, what your TV-watching habits are, and your content preferences.\nHere's what you'll want to take into account when browsing the vast buffet of streaming services you can choose from today:\nYour watching habits and tastes: It's a simple question. What do you like to watch, and how often? If you're into prestige television and film and nothing else, you'll want to look to services like Netflix and Max. More into sports and live events? Check out live TV streaming services like Sling or YouTube TV to stay in the loop. Our best advice is to incorporate a mix of the two so you get the best of both worlds, but that might not be sustainable for everyone.\nYour budget: How much are you able and willing to spend on entertainment? Once you arrive at your number, it's actually pretty easy to figure out which service (or services) you'll want to pick up. Fortunately, streaming services are way more upfront about pricing than cable companies have ever been, so you won't have to deal with hidden fees or anything like that.\nDevice compatibility: Not every streaming service works on every device or smart TV immediately after its launch. For example, when Max first dropped (then called HBO Max), there was a period where the streaming app wasn't available for Fire TV and Roku streaming devices, and the workarounds ranged from frustrating to downright impossible. Eventually, it all got sorted out, but you’ll still want to heed the warning and make sure any streaming app you might want is compatible with your streaming device before you pony up the cash.\nScreen and profile limits: How many people are going to be using your streaming service or services? Just yourself? A whole family? Some platforms have a limit on how many screens or profiles can be connected to one account at the same time, so check that before you go giving everyone your login info.\nCloud DVR options: Not all live TV streaming platforms have cloud DVR, but it's worth checking because having the ability to record and store live events and programming to watch later is a total game-changer in the cord-cutting landscape.\nWhat are the best TV streaming services?\nBecause it can be overwhelming to pick from all the options out there, we're breaking down the benefits of all the best TV streaming services right here. Whether you're looking for live TV streaming or the latest trending original series that's exclusive to a big-name streaming service, this quick-reference guide should steer you toward the best ones to help you cut the cord with your cable company for good.\nThe Good & The Bad\n- Same-day theatrical releases for select films\n- All current and legacy HBO films and series\n- An extensive collection of non-HBO content\n- UI needs a lot of work\n- Weird rebrand\nWhy We Like It\nMax (formerly known as HBO Max) includes an extensive catalog of must-see content, including legacy HBO programming and current TV shows — like The White Lotus, The Last of Us, and Succession — plus every DC superhero movie you could want, an array of Studio Ghibli films, and other hit blockbusters from yesterday and today. Not only does it house all of the content that you'd find with a traditional cable signup for this premium channel, but it also has a growing number of exclusive Max Originals you won't find anyplace else.\nMax is right up there with Netflix for exclusive content, so if you like to keep up with the series everyone will be talking about, you should definitely add it to your rotation. A subscription nets you up to four simultaneous streams (depending on the tier you choose), and the ultimate ad-free plan allows you to stream movies in 4K as well as download content to watch offline.\nDetails\nDisney+\nBest for Disney fanatics\nThe Good & The Bad\n- Access to Disney movies, shows, and originals\n- Content you won't find on any other streaming platform\n- Categorization and search features could be better\nWhy We Like It\nDisney+ is meant to be a one-stop shop for all things Disney, of course, but that goes far beyond just kids' movies and princesses. Alongside all the vault classics and Pixar films, the platform also features content from other Disney properties, including National Geographic and all of the Marvel and Star Wars films. Disney+ subscribers are treated to four concurrent streams at a time, and can download movies and series for offline viewing, too.\nDetails\nCuriosityStream\nBest for documentary lovers\nThe Good & The Bad\n- The basic plan is extremely affordable\n- Great for curious people and kids\n- Very niche\nWhy We Like It\nCuriosityStream — or as we’ve called it before, \"the Netflix of non-fiction\" — is a unique streaming service that helps viewers explore their universe through non-fiction documentaries that wouldn't be found via more popular channels.\nThe streamer offers over 1,500 science, history, and technology documentaries for your brain-boosting edu-tainment, with topics including famous assassinations, nature, evolution, and a whole lot of space stuff. It's like your own personal museum, but you don't have to blow all your money on a bunch of different tickets. Or, you know, even leave your couch, for that matter.\nDetails\nHulu\nBest for more than just live TV\nThe Good & The Bad\n- Over 40 channels including ESPN\n- Lots of original programming\n- Other services offer more channels\nWhy We Like It\nHulu is the one-and-only home to buzzed-about originals like Nine Perfect Strangers and the award-winning The Handmaid's Tale, and FX on Hulu exclusives including American Horror Stories and Mrs. America. Plus, they have all seasons of favorite series, such as Rick and Morty, and next-day streams of current hits like Grey's Anatomy.\nBut, if all of that epicness doesn't do it for you on its own, you can opt for the Hulu + Live TV package to also get access to 75+ live and on-demand channels — including local channels, CNN, ESPN, and more — where you can enjoy live sports, breaking news, and TV shows as they air. It'll also allow you to record up to 50 hours of live TV to watch later (and fast-forward through commercials), but you can increase your DVR storage with an add-on if that’s not enough.\nWhichever Hulu plan you choose, you'll be able to watch on two screens simultaneously and have the option to sign up for premium channels like HBO Max and Showtime, too. Or, opt for the Disney bundle to maximize your entertainment value.\nDetails\nYouTube TV\nBest for live TV streaming and recording\nThe Good & The Bad\n- Unlimited cloud DVR storage\n- Possibility of adding on new channels whenever you want\n- Great lineup of channels, including sports, news, and entertainment\n- Parental control options are very basic\nWhy We Like It\nYouTube TV is arguably the best premium live TV streaming service out there. They boast 85+ live channels — including your local broadcast networks and favorites like ESPN, AMC, and HGTV — plus the option to add on more as you see fit (for a fee, of course).\nFor the same price as Hulu + Live TV, YouTube TV nets you about ten more live channels (including AMC and MLB Network), though you don't get all the exclusive and on-demand content that you'd get with Hulu. So that's a choice for you to consider based on your viewing preferences.\nThat said, the service requires no annual contract, has zero hidden fees, can hold up to six accounts and three concurrent streams, and includes unlimited cloud DVR storage at no extra cost (unlike Hulu). So to us, YouTube TV is the closest thing to a good cable-like experience without the astronomical prices and ridiculous contracts. Plus, you can get it at a discounted rate for your first three months.\nDetails\nAmazon Prime Video\nBest for Prime perks\nThe Good & The Bad\n- Great for recent (and beyond) movie rentals\n- 4K and HDR streaming available\n- Fantastic exclusive movies and shows\n- Catalog is lacking compared to other platforms\nWhy We Like It\nIf your movie nights consist of renting the most recent releases that probably won't come to Netflix or Hulu for at least a few months, then you already know about Amazon Prime Video. But while you have to shell out a few bucks (at least) to rent the latest blockbusters, the price of a Prime Video subscription already includes plenty of movies at no extra cost. It's also home to every episode of a growing number of beloved television series — like Downton Abbey and How I Met Your Mother — as well as their own binge-worthy Amazon Originals, including The Marvelous Mrs. Maisel, Tom Clancy’s Jack Ryan, The Boys, and Fleabag.\nIt's more than enough content to keep you satisfied, but you can also add premium channels like Showtime and AMC+ for an additional price. Plus, you can stream content on as many as three devices at a time, and you'll get a 30-day free trial whether you choose to subscribe to just Prime Video or a full-fledged Amazon Prime membership with extra perks like fast, free shipping.\nDetails\nSling TV\nBest affordable live TV streaming service\nThe Good & The Bad\n- Great price\n- Affordable channel bundles\n- DirecTV has a slightly better deal on the full package\nWhy We Like It\nSlingTV has been a huge player in the cord cutting game as it boasts one of the more affordable monthly options out there for watching live sports, news, and loads of other entertainment that you used to only be able to access with a cable box and an expensive contract. But don’t be fooled — the low price range doesn't mean the channel lineup sucks. Even a basic Sling TV plan offers your favorite channels, including HGTV, Comedy Central, ESPN, CNN, Disney, and BBCAmerica (and the ability to record up to 50 hours of live TV for no additional fee).\nHowever, our favorite part about Sling is how you can tweak channel options. Aside from the main plans, Sling lets users pick and choose extra channels to add on for a nominal fee without having to upgrade to the next level. And, depending on your plan, you can stream on up to four devices at once.\nDetails\nParamount+\nBest for more than just CBS\nThe Good & The Bad\n- Great price\n- Offers classic shows, premium originals, and news\n- Lots of movie offerings from Paramount, Miramax, and MGM\n- Also has Comedy Central, BET, Vh1, Nickelodeon, and more\n- Not a lot to criticize\nWhy We Like It\nParamount+ (formerly CBS All Access) is a clutch streaming service to have if you really like current hits such as The Good Doctor and Criminal Minds since you can catch them streaming the next day. You can also watch live sports like NFL on CBS and Champions League soccer, and have access to 24/7 news on CBSN. But, let's be real, most people have been paying for this streamer specifically for its abundance of Star Trek movies and shows — both classic and new — like the Paramount exclusive series Star Trek: Discovery and Star Trek: Lower Decks.\nThat said, this service is no longer just about CBS, and gives subscribers access to shows from other ViacomCBS properties like Comedy Central, MTV, VH1, and Nickelodeon, and a wide selection of movies from Paramount, Miramax, and MGM. It boasts over 10,000 episodes of classic shows and binge-worthy Paramount Originals like Evil, The Good Fight, new seasons of RuPaul's Drag Race All Stars, and more.\nDetails\nNetflix\nBest for exclusive movies and shows\nThe Good & The Bad\n- Incredible catalog of exclusive shows and films\n- Intuitive browsing and list-building interface\n- Curated \"Watch Next\" offerings\n- No more password sharing\nWhy We Like It\nAt this point, Netflix is synonymous with the word \"streaming service.\" After all, it's the platform that made streaming services as popular as they are, and its ever-growing catalog of top acquisitions and their own originals is just as strong today as it's ever been. Their exclusive movies and shows have gone on to score nominations (and wins!) at the Emmys, Golden Globes, and Academy Awards.\nYou can catch hit scripted shows like Stranger Things, The Umbrella Academy, Ozark, Dead to Me, The Crown, Cobra Kai, Black Mirror, and You, plus endless true crime docuseries like Making a Murderer and Wild Wild Country. Basically, if everyone's talking about a binge-worthy series, it's probably on Netflix. And depending on your plan, it can all be watched on up to four different devices at a time.\nDetails\nPhilo\nBest deal on lifestyle channels\nThe Good & The Bad\n- An amazing deal on lifestyle channels\n- Not for news and sports fans\nWhy We Like It\nNeed we do more than point out that Philo provides 60+ channels and unlimited DVR storage for all subscribers? We've yet to find a streaming service that offers that much for such a low price.\nThe caveat is that the channel lineup isn’t news- or sports-oriented, so you'll want to look elsewhere if those are non-negotiables. But if you don't care about that content, the variety is pretty legit: AMC, MTV, BET, Comedy Central, Paramount, Discovery, Food Network, TLC, and loads more. Plus, you can stream content on as many as three devices at once, and you can choose to add EPIX or STARZ for additional fees. There's a seven-day free trial that you can give a spin, but there's no contract so you can cancel or restart your subscription at any time.\nDetails\nFubo TV\nBest for sports fanatics\nThe Good & The Bad\n- Offers tons of sports content\n- Includes channels like MSNBC and HGTV\n- Doesn't have much for kids\nWhy We Like It\nIf the usual ESPN isn't doing it for you, Fubo TV is your ticket to a constant drip-feed of live sports from around the world, even when you didn't know there was a game on. You'll get access to both popular and obscure sports channels that you don't see often, including The Big Ten Network, beIN Sports, the Olympics channel, and Fox Sports. Looking for European soccer? Sure. NBA? Yup. Motorcycle racing? You got it. There's no NHL channel, but the majority of hockey games are broadcast on NBC and NBCSN anyway, so you should still be covered there thanks to Fubo TV delivering your local channels as well.\nOverall, you'll be treated to a three-digit channel lineup that goes beyond just sports — including MSNBC, HGTV, The Hallmark Channel, SYFY, and National Geographic — so everyone in the house can find something to watch. And that's particularly great because Fubo TV allows for three concurrent streams and up to 250 hours of cloud DVR storage to record your favorites. You can pay to upgrade both of those, however, and opt for premium add-ons like Showtime and EPIX as well.\nDetails\nCrunchyroll\nBest for anime lovers\nThe Good & The Bad\n- Offers access to over 900 anime shows\n- Many shows are available immediately\n- Not compatible with every device\nWhy We Like It\nIn a nutshell, Crunchyroll is like Netflix for anime — and it's seriously awesome. With a premium account, you'll get access to over 900 anime shows! You’ll find old favorites like One Piece and new releases straight from Japan, as well as a wide selection of manga and even a number of live-action J-dramas. If you're an anime newbie, check out Mashable's full rundown on Crunchyroll and our resident anime expert's suggestions on the best shows to watch.\nDepending on your plan, you can stream on up to six devices at once and download your favorite anime to watch on-the-go, even when there’s no WiFi. Best of all, you can give it a spin with a two-week free trial.\nDetails\nPeacock\nBest for binge-watching 'The Office'\nThe Good & The Bad\n- Lots of movies and shows available for free\n- Peacock originals include reboots of classic shows\n- Peacock Premium comes with every live WWE pay-per-view event\n- Households must share one common account\nWhy We Like It\nNBCUniversal's streaming service became the exclusive home to everyone’s favorite workplace comedy, The Office, in 2021 — sorry, Netflix. That’s arguably Peacock’s biggest selling point, but on the off-chance that \"Dinner Party\" and \"Fun Run\" ever get old, your membership also includes tons of other NBC series (see: 30 Rock, Law & Order, and Dick Wolf’s full “One Chicago” lineup) along with late-night talk shows, live sports, news broadcasts, Peacock Originals, and the hit Kevin Costner drama Yellowstone. (It’s also home to a bunch of hit movies.)\n(Check out Mashable's official Peacock guide for more info.)\nDetails\nApple TV+\nBest for big stars\nThe Good & The Bad\n- Buzzworthy originals\n- 4K and HDR quality\n- Relatively low price\n- Lots of simultaneous streams\n- No ads\n- Small library of content\n- Not available on Android phones\nWhy We Like It\nWhile it may not have a ton of content to its name, Apple TV+ definitely makes up for it with undeniable star power. In a true show of quality over quantity, the streaming service is home to a growing list of exclusive Apple Originals, including (but definitely not limited to) Ted Lasso, The Morning Show, and Severance.\nIt certainly won't help you cut the cord with your cable company, but it's definitely a nice supplement, even if just for a month or so at a time. Plus, you get a seven-day free trial, and you can stream in stellar 4K quality on as many as six streaming devices at once.\nDetails\nDiscovery+\nBest for lifestyle on-demand\nThe Good & The Bad\n- Growing selection of original content\n- Good number of concurrent streams\n- No live channels\nWhy We Like It\nCombining all of your favorite content from the likes of HGTV, TLC, Food Network, Animal Planet, Lifetime, and more, Discovery+ is a great choice for the do-it-yourself lifestyle set. While you won't have access to live content on these channels (such as with Philo, for example), you will be treated to more than 55,000 on-demand episodes from top series like Property Brothers, 90-Day Fiance, and Chopped, as well as exclusive originals, including Magnolia Table and Fixer Upper: Welcome Home from Chip and Joanna Gaines' Magnolia Network.\nSubscribers can stream on up to four streaming devices at once, and benefit from a seven-day free trial to check things out before committing the cash.\nDetails\nAMC+\nBest for 'The Walking Dead' fans\nThe Good & The Bad\n- Combines content from multiple services\n- Great for horror fans\n- Limited selection of original content\nWhy We Like It\nWhy pay for a bunch of separate services when you could get them all rolled into one with AMC+? As the name implies, the streaming service is home to more than just AMC's new and old hit series, like Kevin Can F**k Himself, Mad Men, Breaking Bad, Better Call Saul, and the entire Walking Dead Universe. Beyond that, it also boasts all of the combined content that you'd get with separate subscriptions to Sundance Now, Shudder, and IFC Films Unlimited, plus top content from BBC America, too. This ups the entertainment ante with even more hit shows and docuseries like Creepshow, Channel Zero, A Discovery of Witches, and No One Saw a Thing.\nFor fans of horror, true crime, and edgy dramas, AMC+ is a clear winner, but you can still give it a spin first with a seven-day free trial.\nDetails\nTopics Streaming\nFrequently Asked Questions\nAllow us to go a little more in-depth about why we can definitively say that moving to literally any streaming service from cable is one of the best things you can do for yourself (Unless, of course, you have really bad internet service in your area, which may be the one and only case to be made for sticking with cable.)\nThe first thing that would probably deter you from cutting the cord right now is live events. You might think that you'll be missing out on a lot, like award shows, news events, sports, and more. But today, that's just not true at all. In fact, pretty much all of the big live events can be streamed and you can root for your favorite teams from anywhere — you just need to know where to look.\nAnother area of contention is that of choice. While many cable packages offer the mere illusion of choice with their advertised 100-plus channels and whatnot, you'll find that these choices aren't really ones you'd ever want to make. When cable, movie, and TV choices are random, and you basically have to schedule your TV consumption time around when they're being shown, lest you catch just the very end of that movie you’ve been meaning to check out. And that's assuming you can even find something you're in the mood to watch after scanning the vast list of \"meh\" content. And when it comes to network television, the bar is pretty much in Hell at this point anyway; all the good stuff is on streaming services.\nPlus, you can't really binge-watch stuff on cable like you can on streaming platforms, where an entire season is often released in one fell swoop. However, some streaming services have begun to employ more traditional weekly episode drops, just in case you find yourself missing those watercooler conversations about what happened on your favorite program that week. It should also not be overlooked that streaming services — even the ones that aren’t ad-free — subject us to fewer commercials.\nFinally — perhaps the most important aspect of all — the price. The bottom line is that the price-to-value ratio for sticking with cable is abysmal. It's way more expensive than any given streaming service, and can potentially reach into $100-plus-per-month territory faster than you can find something to watch.\nHere’s some food for thought: You can subscribe to Netflix, Max, Disney+, and Hulu at the same time and still pay less per month than most cable companies will charge you. Cable companies also tend to sneak in hidden fees that aren't included in the initial advertised price, including broadcast fees, DVR fees, and remote fees. (Yes, you have to pay monthly to use the remote.) You'll almost always pay more than the advertised price, and in many cases, that price increases after your first contract expires. Apparently, cable appreciates in value over time — who knew?\nWe've dropped the phrase on you a couple times now, but we want to make sure that you're clued into what it is exactly because it's actually quite different from the most popular streaming sites that first come to mind.\nWhile a streaming service like Netflix or Max allows you access to lots of great on-demand content, none of it is airing live. Like, you can't just flick open one of these streaming apps and start watching TV like you can with your traditional cable setup. (And you certainly can’t watch any live sports.) Instead, you have to consciously pick something to watch, find it in a list, and then hit \"play.\"\nLive TV streaming services, on the other hand, work a lot more like traditional cable — namely YouTube TV, Sling TV, Hulu + Live TV, and a few others. The available channel lineup will vary a little from one to the next, but they all allow you to watch live content at the very same moment as anyone else watching live TV.\nFor example, let's say your neighbor with a regular ol' cable setup wants to watch the latest episode of Grey's Anatomy as it airs. They'd turn on the TV when the show is ready to start, turn the channel to ABC, and watch it in real-time, right? Well, you can do the exact same thing with a live TV streaming service — as long as it offers ABC, of course. (And most, if not all, will include your local channels.) The only difference is that you'll open up your live TV streaming app of choice and select the channel from there, and instead of pointing your remote to an overpriced cable box, you'll point it toward your sleek little streaming device instead.\nBest of all, many live TV streaming services include cloud DVR storage as well. So even though you have the benefit of being able to watch TV live, you don't always have to watch TV live. You can record favorites for later, whether that's 20 minutes later so you can fast-forward through the live commercials, or a month later when you have a free afternoon for some binge-watching. The choice is yours.\nSo while services like Netflix are a great supplement to live TV, they can't completely replace your cable setup, at least not in the same way. It all depends on how important certain content or TV channels are to you, and if you care about watching stuff live.\nLeah Stodart is a Philadelphia-based Senior Shopping Reporter at Mashable where she covers and tests essential home tech like vacuums and TVs, plus eco-friendly hacks. Her ever-evolving experience in these categories comes in clutch when making recommendations on how to spend your money during shopping holidays like Black Friday, which Leah has been covering for Mashable since 2017."
    },
    {
      "url": "https://mashable.com/category/film",
      "text": "More Film\n'Together' review: Dave Franco and Alison Brie get grossly close in a body-horror nightmare\nDoes this Sundance hit live up to the hype?\n'The Conjuring: Last Rites' trailer reveals a demon returned\nPatrick Wilson and Vera Farmiga return as paranormal investigators Ed and Lorraine Warren.\nLiam Neeson takes the absurd comedy of 'The Naked Gun' very seriously\nNeeson, Pamela Anderson, and Paul Walter Hauser break down \"The Naked Gun\" reboot.\nBy Mark Stetson and Belen Edwards\n'Megadoc' teaser promises behind-the-scenes look at 'Megalopolis'\n\"No one I'm working with realizes how weird a movie this actually is.\"\n'The Threesome' trailer unveils a surprisingly sweet and sexy comedy\nZoey Deutch, Jonah Hauer-King, and Ruby Cruz hook up — but that's just the start!\n'American Sweatshop' trailer reveals a modern internet nightmare\nLili Reinhart stars in critically heralded thriller.\n'Twinless' trailer: Dylan O'Brien and James Sweeney forge a strange bromance in Sundance hit\nGet in on the ground floor of this buzzy dark comedy.\n‘The Naked Gun’ review: Liam Neeson is a comedy genius in this brilliantly stupid reboot\nPlus, Pamela Anderson, funny femme fatale!\n'Eternity' trailer: Miles Teller, Elizabeth Olsen, and Callum Turner are caught in a heavenly love triangle\nWho would you spend your afterlife with?\n'Avatar: Fire and Ash' trailer: James Cameron sets Pandora ablaze in stunning first look\nInject it into my eyeballs immediately.\nAdam Sandler and Julie Bowen on the motion-capture tech they used to make themselves younger in 'Happy Gilmore 2'\n\"It was a lot of special effects. More than I've ever done before in my life.\"\nBy Mark Stetson\n'Yellowjackets' star Liv Hewson shares their must-see movies and guilty TV pleasures\nHewson has a 'Real Housewives' catchphrase. Hear it here!\n'Oh, Hi!' review: Molly Gordon leads wildly funny sex comedy\nLogan Lerman, Geraldine Viswanathan, and John Reynolds co-star.\n‘The Fantastic Four: First Steps’ review: One of the best MCU films in years\nMarvel nails the First Family’s big-screen relaunch.\n'Predator: Badlands' trailer: Watch an android and a Predator team up and kick butt\nIt's another \"Alien\" and \"Predator\" crossover!\nDavid Dastmalchian reveals which Muppet he identifies with the most\n\"I probably think about ['The Muppet Movie'] every day.\"\nBy Belen Edwards and Warren Shaw\n'Eddington' review: Ari Aster misfires as Pedro Pascal and Joaquin Phoenix face off\nThis COVID-era comedy has a mean streak while it plays both sides.\n'I Know What You Did Last Summer' review: Still has a great hook\nJennifer Love Hewitt and Freddie Prinze Jr. make the latest slasher legacy sequel goofy and game.\nBy Jason Adams\n'Superman' ending explainer: What does this mean for potential sequels or spinoffs?\nWill Krypto and his super-powered owner return?\nHow A24's 'Warfare' got the sound of war right\nWhat happens when you remove the music and let the chaos speak for itself?\nBy Emmett Smith\n'Superman' review: Can James Gunn's reboot get DC back on track?\nThe latest attempt at Superman's story is immensely ambitious, with overt politics and eye-popping action.\n'She Rides Shotgun' trailer: Taron Egerton is on the run in this father-daughter crime thriller\nEgerton channels his inner Joel from \"The Last of Us.\"\nJonathan Bailey's 'slutty little glasses' are a cinematic staple, actually\n\"Jurassic World Rebirth\" is the latest in a thirsty tradition of film dreamboats.\nBy Meg Walters\n'Sinners' comes to streaming this week with Black American Sign Language option\nIn an industry first, Max is offering an alternate version of the film in the ASL dialect."
    }
  ],
  "argos_summary": "Boys Go to Jupiter, directed by Julian Glander, is an animated film set in a surreal suburban Florida where high school dropout Billy 5000, voiced by Jack Corbett, embarks on a quest to earn $5,000 through food deliveries. Along the way, he befriends a gelatinous alien named Donut while navigating bizarre encounters and a satirical commentary on capitalism, particularly through his job with the Grubster app. The film features a unique animation style and a whimsical narrative that blends the absurd with the mundane, making it a standout experience in contemporary animation.",
  "argos_id": "68VGVT0IE"
}