{
  "url": "https://www.bloomberg.com/professional/insights/markets/defensive-tilt-weighs-on-bmvp-in-fast-stock-market-rebound/",
  "authorsByline": "mvannucci2",
  "articleId": "f759e7dcc3e64f89a6af6d64f7f1209f",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bbhub.io/image/v1/convert?type=auto&url=https%3A%2F%2Fassets.bbhub.io%2Fprofessional%2Fsites%2F41%2F365376363-2.jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T22:54:51+00:00",
  "addDate": "2025-08-08T23:07:15.402673+00:00",
  "refreshDate": "2025-08-08T23:07:15.402675+00:00",
  "score": 1.0,
  "title": "Defensive tilt weighs on BMVP in fast stock market rebound",
  "description": "Bloomberg's large-cap BMVP portfolio delivered positive returns in 2Q but trailed its benchmarks, held back by its defensive tilt during one of the fastest market rebounds on record.",
  "content": "This article was written by Bloomberg Intelligence Quantitative Equity Strategist Christopher Cain and Director of Equity Strategy, Chief Equity Strategist Gina Martin Adams. It appeared first on the Bloomberg Terminal.\n\nBloomberg’s large-cap BMVP portfolio delivered positive returns in 2Q but trailed its benchmarks, held back by its defensive tilt during one of the fastest market rebounds on record. The primary drag came from its exposure to low-volatility stocks, which lagged as investors rotated into higher-risk names. Despite near-term underperformance, BMVP’s long-term record remains intact, with higher annualized returns and lower risk than both equal and market cap-weighted benchmarks — underscoring the value of a disciplined, multifactor approach.\n\nBloomberg’s large-cap BMVP portfolio underperformed its benchmarks in 2Q, weighed down by its defensive tilt — particularly the low-volatility component — during the fastest market rebound after a 15% drawdown on record. The BMVP portfolio returned 1.82% on the quarter, trailing the Bloomberg 500 equal-weight benchmark’s 5.46% gain. Low volatility was the weakest contributing factor, with the sector-neutralized Q1 cohort declining 58 bps on the quarter. Despite 2Q softness, the BMVP strategy maintains higher long-term returns (10.71% annualized) than both the equal-weight (7.87%) and market-cap-weight (8.82%) benchmarks, along with lower volatility and drawdowns.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Bloomberg Intelligence Quantitative Equity Strategist Christopher Cain",
      "weight": 0.111393005
    },
    {
      "name": "Low volatility",
      "weight": 0.11020628
    },
    {
      "name": "lower volatility",
      "weight": 0.11020628
    },
    {
      "name": "fast stock market rebound",
      "weight": 0.10829107
    },
    {
      "name": "Chief Equity Strategist",
      "weight": 0.1013713
    },
    {
      "name": "higher annualized returns",
      "weight": 0.10012629
    },
    {
      "name": "lower risk",
      "weight": 0.098019235
    },
    {
      "name": "BMVP",
      "weight": 0.09352109
    },
    {
      "name": "Bloomberg Intelligence",
      "weight": 0.09178378
    },
    {
      "name": "Equity Strategy",
      "weight": 0.08530755
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Stocks"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.99609375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.97607421875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.72802734375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.488525390625
    }
  ],
  "sentiment": {
    "positive": 0.17565918,
    "negative": 0.6508789,
    "neutral": 0.17321777
  },
  "summary": "Bloomberg's large-cap BMVP portfolio underperformed its benchmarks in 2Q, with its defensive tilt during one of the fastest market rebounds on record. The portfolio's exposure to low-volatility stocks was a primary drag, leading to a 1.82% return on the quarter, which was less than the Bloomberg 500 equal-weight benchmark's 5.46%. Despite this underperformance, BMVP's long-term record remains intact with higher annualized returns and lower risk than both equal and market cap-weighted benchmarks. Despite the softness of 2Q and low volatility, the BMVP strategy maintains higher annual returns (10.71%) and lower volatility and drawdowns.",
  "shortSummary": "Bloomberg's large-cap BMVP portfolio underperformed in 2Q due to its low-volatility exposure, maintaining long-term returns with a disciplined multifactor approach.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a7bb704c62e940bbb55b4d3e0f333fec",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Bloomberg's large-cap BMVP portfolio experienced positive returns in the second quarter but underperformed its benchmarks due to its defensive tilt, particularly in low-volatility stocks, during a rapid market rebound. The portfolio returned 1.82%, significantly trailing the Bloomberg 500 equal-weight benchmark's 5.46% gain. Despite this short-term underperformance, the BMVP strategy boasts higher long-term annualized returns of 10.71% compared to its benchmarks, along with lower risk.",
  "argos_id": "6O5129FTF"
}