{
  "url": "https://www.express.co.uk/news/uk/2092318/harvey-willgooses-family-demands-knife",
  "authorsByline": "Paul Jeeves",
  "articleId": "04c929bf650542f1b2e831c98914245c",
  "source": {
    "domain": "express.co.uk",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Stark County",
      "city": "Hartville",
      "coordinates": {
        "lat": 40.9636685,
        "lon": -81.3312195
      }
    }
  },
  "imageUrl": "https://cdn.images.express.co.uk/img/dynamic/1/1200x630/6345689.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-08T12:36:00+01:00",
  "addDate": "2025-08-08T12:07:24.050160+00:00",
  "refreshDate": "2025-08-08T12:07:24.050162+00:00",
  "score": 1.0,
  "title": "Murdered schoolboy's family demands knife arches in all UK schools",
  "description": "In the wake of a devastating loss, the Willgoose family is on a mission to transform UK schools into safe havens, free from the shadow of knife violence.",
  "content": "Tragic Harvey Willgoose's heartbroken family are demanding that knife arches are installed in all UK schools to prevent another child losing their life. Caroline Willgoose and her husband Mark have become prominent campaigners against knife violence since Harvey was stabbed to death at All Saints Catholic High School, in Sheffield, in February, having previously been oblivious to the dangers lurking in British classrooms. But they say the devastating tragedy that has struck their family must not be allowed to happen to another child inside school grounds. Harvey's murderer was found guilty today. Mrs Willgoose said: “It's all brand new to us. It always happens to someone else. You think of it being like gang culture, and Harvey was nothing to do with anything like that. \"He just loved football, he loved life, he loved socializing. But I now know it's a massive problem.\"\n\nMrs Willgoose said she and her family are now devoting themselves to their campaign for knife arches in school. She added: “Our lives are ruined because I know that I'm never, ever going to be happy again. \"His sister, his brother, we're never going to be happy again. And, that's a fact.\" The family began speaking out against knife violence soon after Harvey died in February and met with Home Secretary Yvette Cooper in March discuss their concerns. They have an online petition which currently has 52,000 signatories.\n\nMrs Willgoose said: “This can't happen again. We know after all this that there are knives in schools. “Harvey knew that, the children knew that, and they’re frightened. The one place that children should be safe is in school. “Once we get knife arches in, then we'll go into schools and educate children about the devastation of knives.",
  "medium": "Article",
  "links": [
    "https://www.express.co.uk/news/uk/543683/Leeds-masked-gang-of-four-car-jackers-threaten-commuters",
    "https://www.express.co.uk/news/uk/2092334/teen-killer-guilty-murdering-schoolboy?4545",
    "https://www.express.co.uk/news/uk/2075901/schoolboy-fatally-stabbed-online",
    "https://www.express.co.uk/news/uk/1913942/alfie-lewis-mum-meesage-schoolboy-killer",
    "https://www.express.co.uk/",
    "https://www.express.co.uk/privacy-notice"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "knife arches",
      "weight": 0.124023736
    },
    {
      "name": "knife violence",
      "weight": 0.11782105
    },
    {
      "name": "knives",
      "weight": 0.10742384
    },
    {
      "name": "Harvey",
      "weight": 0.09628367
    },
    {
      "name": "Mrs Willgoose",
      "weight": 0.09130215
    },
    {
      "name": "school grounds",
      "weight": 0.09037622
    },
    {
      "name": "school",
      "weight": 0.08913023
    },
    {
      "name": "schools",
      "weight": 0.08913023
    },
    {
      "name": "Home Secretary Yvette Cooper",
      "weight": 0.08369089
    },
    {
      "name": "Caroline Willgoose",
      "weight": 0.08320518
    }
  ],
  "topics": [
    {
      "name": "Crime"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.97607421875
    },
    {
      "name": "/Jobs & Education/Education/Primary & Secondary Schooling (K-12)",
      "score": 0.892578125
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.873046875
    },
    {
      "name": "/News/Other",
      "score": 0.82958984375
    },
    {
      "name": "/News/Local News",
      "score": 0.79248046875
    }
  ],
  "sentiment": {
    "positive": 0.03982544,
    "negative": 0.77246094,
    "neutral": 0.18798828
  },
  "summary": "Harvey Willgoose, a schoolboy from Sheffield, was stabbed to death at All Saints Catholic High School in February and his family are demanding that knife arches be installed in all UK schools to prevent another child from losing their life. The Willgooses, who have become prominent campaigners against knife violence, have previously been unaware of the dangers lurking in classrooms. They believe this tragedy must not happen to another child inside school grounds. An online petition with 52,000 signatories has been launched by the family. Harvey's murderer was found guilty today.",
  "shortSummary": "The family of murdered Sheffield schoolboy Harvey Willgoose, who was stabbed to death at All Saints Catholic High School, demand knife arches in all UK schools to prevent another child's death.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "889b4cd8c8fb4970bab213b68636b0a7",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.express.co.uk/news/uk/2075901/schoolboy-fatally-stabbed-online",
      "text": "Schoolboy, 15, fatally stabbed after online argument escalates into violence\nTeen victim told his father he didn't want to go to school \"where people had knives\" days before he was stabbed to death by a 13cm hunting blade.\nA 15-year-old schoolboy told his dad he “wasn’t going to school where people had knives” days before he was fatally stabbed in the heart following a social media spat with a fellow pupil, a jury heard. Harvey Willgoose collapsed and died after a simmering Snapchat argument erupted in violence during a lunch break at All Saints Catholic High School in Sheffield.\nA pupil, also 15, who admits stabbing Harvey but denies murder subsequently told the headteacher: “I’m not right in the head” after he had smuggled the deadly weapon into class. Sheffield Crown Court was shown “shocking” footage of the stabbing incident on February 3, which left Harvey dead and his classmates fleeing “in fear and panic”. The boy, who cannot be named, admits killing Harvey with the 13cm blade, but claims it was manslaughter not murder.\nDon't miss: 15-year-old schoolboy fatally stabbed in heart during lunch break\nDon't miss: Taylor Swift's Era's Tour boosts UK economy with £10bn from 23 million music ...\nDays before his death Harvey skipped class following a knife incident at the school involving other pupils, text messaging his dad to tell him: “Am not going in that school while people have knives”.\nIt is alleged the previous incident led to Harvey and the defendant falling out in a Snapchat group, with each siding with one of the boys involved in the initial dispute, who had been suspended.\nOpening the case Richard Thyne KC, prosecuting, told how after being disarmed the killer told All Saints’ head Sean Pender: “I’m not right in the head. My mum doesn’t look after me right. I’ve stabbed him.”\nThe prosecutor said the boy confirmed to Mr Pender he was referring to Harvey, and that he had stabbed him once or twice.\nMr Thyne said: “Whilst waiting for the emergency services to arrive, (the defendant) also told Mr Pender that he was carrying the knife for protection.”\nThe prosecutor revealed the altercation happened in a school courtyard just as the lunch break was starting.\nHe played the chilling CCTV footage to the jurors, telling them: “It is shocking, but it is necessary to play it.”\nDon't miss: Call centre con artists scammed vulnerable pensioner, 84, for £25,000 of savings\nDon't miss: Busker Jason Allen quits performing in major UK city after being slapped by g...\nMr Thyne said the prosecution case is that the CCTV shows Harvey appearing to put his left hand on the defendant’s right arm before the defendant “takes a knife out of his left pocket, passes it across into his right hand, and then stabs twice at Harvey’s torso”.\nHe said the defendant then advances towards Harvey, who backs away across the courtyard, before the boy “returns towards where the incident began, gesturing towards Harvey with his knife, and appearing to shout at Harvey”.\nThe video shows Harvey running towards the defendant, who then advances for a second time, “bouncing on his toes, still brandishing the knife”, the prosecutor said, adding that then “Harvey backs away”.\nMr Thyne said “other pupils fled in fear and panic” as the defendant went into the dining hall still gripping the knife.\nStaff members Carolyn Siddall and Rachel Hobkirk approached the boy as he “was dancing around on his toes and waving the knife around, although by this stage he seemed to be saying ‘I’m not going to hurt anyone'”, the prosecutor said.\nHe added: “They told him to put the knife down but he did not do so.”\nHe told the jury assistant head Morgan Davis arrived and “found the defendant still waving the knife around”.\nAs Mr Davis told him to hand over the knife, the defendant was saying to him: “You know I can’t control it,” which Mr Thyne said the teacher took to be a reference to his anger issues, given previous incidents of violent behaviour at school.\nThe prosecutor said: “Mr Davis held his hand out and took the knife from (the defendant).\n“At the same time the headteacher, Mr Pender, placed his arm around (the defendant)’s shoulder and took him along the corridor to his office.”\nMr Thyne earlier told the jury how Harvey was stabbed in the heart with a hunting knife which had a 13cm, serrated-edged blade.\nHe said the defendant “admits that he stabbed Harvey causing his death” and “also admits that the stabbing was not carried out in lawful self-defence.”\nThe teen sat in the glass-fronted dock, wearing a white shirt with no tie, as Mr Thyne outlined the case against him, flanked by a number of adults, including an intermediary.\nThe trial continues.\nComments Unavailable\nSorry, we are unable to accept comments about this article at the moment. However, you will find some great articles which you can comment on right now in our Comment section."
    },
    {
      "url": "https://www.express.co.uk/",
      "text": "EXCLUSIVE: Groups of drug addicts are abusing substances and sleeping rough in the super posh area.\nANALYSIS: The Prime Minister came to power with no idea how to stop the boats, and the...\nFurious Freddie Mercury fans have channelled their anger to author Lesley-Ann Jones,...\nHoliday lovers have dubbed the current scenes in Magaluf as 'very sad' as Brits are no...\nUS President Donald Trump was embarrassed on CNN as they put together a brutal montage...\nReports suggest an HMRC error could see thousands lose out.\nMore than 350,000 people have signed a petition calling for a general election\nOn the first day the Labour government's new migrant deal was put into place, the...\nKeir Starmer has described the Israeli Government's decision to further escalate its Gaza offensive as \"wrong\".\nNigel Farage has dealt yet more blows to the political establishment overnight.\nMajorcan restaurants are speaking of a \"hospitality crisis\" amid a sector downturn.\nRecreate Meghan Markle's £4,000 Valentino dress on the high street for a fraction of...\nDaily Express\nIsrael's government has approved plans to take control of Gaza City, a move that...\nManchester United's plans for a new £2bn super stadium has been given a major boost...\nArrivals and departures from the airport have been cancelled and delayed due to the...\nThe 15-year-old killer scoured the internet looking for sickening videos and...\nExpress Sport rounds up the latest Manchester United transfer news.\nDon't risk making a bland and gloopy potato salad by adding one ingredient you...\nOne of the BBC's huge detective series has been axed as a top actress has been dealt a...\nNational Crime Agency officers swoop after damning expose into how small boat gangs...\nThe Express lists the 10 government departures since Labour won the general election\nSky News has finally revealed which presenter will replace TV veteran Kay Burley after...\nAnd you should draw you curtains and blinds during the day as well, say experts, as...\nMeghan Markle could soon have another reason to think about returning to the UK.\nA new study has found that a shocking number of motorists are not adhering to the Highway Code's advice on how often to take a break from driving\nRebekah Baptiste, 10, was found unresponsive by police on a highway in Holbrook, north...\nCooking steak may seem simple, but it can come out of the pan tough, chewy or even...\nMarket leading Cash ISA account from Trading212 has announced an instant cut to rates.\nFast flowing air in the higher atmosphere has been confined to the north of the UK,...\nEXCLUSIVE: Bride Emily Weatherall was gutted when her almost 100 year-old granddad was...\nEXCLUSIVE: An expert explores one potential reason the Duchess of Sussex does not ship...\nLocals and visitors in Cornwall are spoilt for choice when it comes to breathtaking...\nDespite Prince William and Princess Kate allegedly 'washing their hands' of Harry, an insider claims he will cling onto his title.\nThe balloon was spotted flying too low before hitting the roof of a school\nThe eyebrow gel comes in a natural grey shade, as well as shades of blonde and brunette.\nA team of garden workers have said they've found that many people are unaware of the...\nAfter a life-altering event, Jo and Ron Buss discovered a hidden gem on the Isle of...\nFormer Tory MP, Jacob Rees-Mogg has challenged the author of the new controversial...\nSpain has been hit with severe wildfires amind a scorching heatwave that has seen...\nLloyds Bank has unveiled some stark figures.\nGB News came to an unexpected halt moments into the breakfast show with some worrying news\nCruises are a different style of holiday from your typical trip, so there are a few...\nRussia launched strikes on Ukraine on the eve of Donald Trump's deadline for Moscow to...\nHyacinth Blair, 63, withdrew tens of thousands of pounds from the South London and...\nGood Morning Britain was forced to deliver a warning before delving into one segment...\nEXCLUSIVE: A north-east market town is split after data revealed it had the biggest...\nExpress Sport keeps you up to date with the latest summer transfer news.\nVicky Pattison has revealed the secret to her thick and glossy hair, and she says a...\nAn immediate \"stop-drive\" recall was issued on June 20\nThe property in Cheshire's Golden Triangle is a hotbed for Premier League footballers...\nOfgem says anyone with a smart meter could get a £40 payout.\nThis often overlooked European city offers an easy escape into nature and is well...\nWith a rare 0 per cent critics approval rating and a dismal 16 per cent audience...\nLynsey Crombie, TV's 'Queen of Clean' has shared the must-do jobs everyone should...\nPrincess Lilibet is the Duke and Duchess of Sussex's youngest child.\nAnother heatwave is looming on the horizon and while it brings great discomfort to...\nDaily Express uses notifications to keep you updated"
    }
  ],
  "argos_summary": "The family of Harvey Willgoose, who was fatally stabbed at All Saints Catholic High School in Sheffield, is advocating for the installation of knife arches in all UK schools to prevent further tragedies. Following Harvey's death, his parents have become vocal campaigners against knife violence, emphasizing the need for safety in schools and raising awareness about the dangers of knives among students. The family has gathered over 52,000 signatures on an online petition and met with government officials to discuss their concerns.",
  "argos_id": "6V8O5UCTN"
}