{
  "url": "https://apnews.com/article/alaska-glacial-outburst-flooding-mendenall-adda278e6e9e1ec0f9bdcd778cf528d9",
  "authorsByline": "",
  "articleId": "9332e7e777564e20a962bcb28f556744",
  "source": {
    "domain": "apnews.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://dims.apnews.com/dims4/default/df099f2/2147483647/strip/true/crop/5184x2916+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2Fb1%2F580083856339b5393e7f85b3e9ad%2F57bba6537d2c4bd08b0bd6417c1db574",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T20:17:32+00:00",
  "addDate": "2025-08-08T20:25:34.025607+00:00",
  "refreshDate": "2025-08-08T20:25:34.025608+00:00",
  "score": 1.0,
  "title": "Residents in Alaska's capital city prepare for possible glacial flooding",
  "description": "Residents and officials in Juneau are preparing for the possibility of glacial flooding that in past years has swept away houses and eroded the river fed by the popular Mendenhall Glacier.",
  "content": "ANCHORAGE, Alaska (AP) — Residents and officials in Alaska’s capital city prepared Friday for the possibility of glacial flooding that in past years has swept away houses, swamped several hundred homes and eroded the river fed by the popular Mendenhall Glacier.\n\nThe state, federal, city and tribal officials who would run an incident command center during any flooding held a briefing to outline steps and to issue pleas to the public to be prepared.\n\nThe threat of so-called glacier outburst flooding has become an annual concern in parts of Juneau since 2011. The Mendenhall Glacier — a thinning, retreating glacier that is a major tourist attraction in southeast Alaska — acts as a dam for a basin that fills each spring and summer with rainwater and snowmelt. The basin itself was left behind when a smaller, nearby glacier retreated.\n\nWhen the water in the basin creates enough pressure, it forces its way under or around the ice dam created by the Mendenhall Glacier, entering Mendenhall Lake and eventually the Mendenhall River.\n\nThe water level in the basin as of Friday stood at 1,353 feet (412 meters) and continues to rise, said Nicole Ferrin with the National Weather Service. It’s just 15 feet (1.5 meters) from topping the ice dam.\n\nThe basin has been rising at an unpredictable rate, so there is no way to pinpoint when water would go over the top, she said.\n\n“Some days when there’s no rain, it only rises by a foot (0.30 meters),” she said. “Other days when there is heavy rain or a lot of sunshine, it rises by 4 feet (1.22 meters), so it’s a variable.”\n\nIn some years, there has been limited flooding of streets or properties near the lake or river. But 2023 and 2024 marked successive years of record flooding, with the river last August cresting at 15.99 feet (4.9 meters), about 1 foot (0.3 meters) over the prior record set a year earlier, and flooding extending farther into the Mendenhall Valley.\n\nLast year, nearly 300 residences were damaged in the flooding.\n\nCapital City Fire/Rescue Chief Rich Etheridge warned people to stay away during flood stages because logs and other debris in the river can put would-be rescuers “at extreme peril.”\n\nOnce the water tops the dam, the city will set up a hotline where people can get information.\n\nA large flood event can release up to 15 billion gallons of water, according to the University of Alaska Southeast and Alaska Climate Adaptation Science Center. That’s the equivalent of nearly 23,000 Olympic-size swimming pools. During last year’s flood, the flow rate in the rushing Mendenhall River was about half that of Niagara Falls, the researchers say.\n\nCity officials responded to concerns from property owners this year by working with state, federal and tribal entities to install a temporary levee along roughly 2.5 miles of riverbank in an attempt to guard against widespread flooding. The installation of about 10,000, four-foot (1.2-meter) tall barriers is intended to protect more than 460 properties from flood levels similar to last year, said Nate Rumsey, deputy director with the city’s engineering and public works department.\n\nThe U.S. Army Corps of Engineers is at the start of what’s expected to be a yearslong process of studying conditions in the region and examining options for a more permanent solution. The timeline has angered some residents, who say it’s unreasonable.\n\nOutburst floods are expected to continue as long as the Mendenhall Glacier acts as an ice dam to seal off the basin, which could span another 25 to 60 years, according to the university and science center researchers.",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/alaska-juneau-glacial-dam-flooding-781b1fad39fa1ce0f6800b1a47bfa3c1",
    "https://apnews.com/article/juneau-alaska-glacial-dam-flood-41113277d75767d9b3bae33b111e5683",
    "https://www.whatsapp.com/channel/0029Va7Tv2j59PwNEyqGCi1y",
    "https://apnews.com/article/kennedy-vaccines-mrna-pfizer-moderna-1fb5b9436f2957075064c18a6cbbe3c9",
    "https://apnews.com/article/native-alaskans-mining-oil-drilling-spiritual-religion-21072257687776250a247a00243e5db6",
    "https://apnews.com/article/juneau-alaska-flood-ice-dam-2216df650049dd41c2a1d17354ea187c",
    "https://apnews.com/article/juneau-tourism-mendenhall-glacier-recedes-281e736286abb62d7cee9c6bb6dc8dc9",
    "https://apnews.com/article/native-alaskans-mining-oil-drilling-religion-takeaways-12f40b4e48ab3a1a4bb46862674521bc",
    "https://apnews.com/article/alaska-glacier-dam-flooding-jokuhlaup-95f06f4e0d82445705d3126aac004f5a"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Last year",
      "weight": 0.08269174
    },
    {
      "name": "last year",
      "weight": 0.08269174
    },
    {
      "name": "record flooding",
      "weight": 0.08208767
    },
    {
      "name": "glacial flooding",
      "weight": 0.081308335
    },
    {
      "name": "possible glacial flooding",
      "weight": 0.078311
    },
    {
      "name": "flooding",
      "weight": 0.07814497
    },
    {
      "name": "widespread flooding",
      "weight": 0.07807031
    },
    {
      "name": "limited flooding",
      "weight": 0.07743555
    },
    {
      "name": "past years",
      "weight": 0.07561864
    },
    {
      "name": "successive years",
      "weight": 0.07421139
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.96240234375
    },
    {
      "name": "/News/Weather",
      "score": 0.9580078125
    },
    {
      "name": "/News/Local News",
      "score": 0.94189453125
    }
  ],
  "sentiment": {
    "positive": 0.0541687,
    "negative": 0.7026367,
    "neutral": 0.24291992
  },
  "summary": "Alaska's capital city, Juneau, is preparing for possible glacial flooding, a term known as \"glacial outburst flooding\" that has become an annual concern in parts of Juneau since 2011. The Mendenhall Glacier, a retreating glacier that acts as a dam for a basin filled with rainwater and snowmelt, is responsible for the rising water level in the basin. The state, federal, city, and tribal officials have established an incident command center to handle any flooding. The National Weather Service reports that the water level is rising at an unpredictable rate, with some days when there's no rain or sunshine causing the water to rise. Once the water levels exceed the dam, the city will set up a hotline for information once the dam is breached. The University of Alaska Southeast and Alaska Climate Adaptation Science Center estimates that a large flood event can release up to 15 billion gallons of water, the equivalent of nearly 23,000 Olympic-size swimming pools.",
  "shortSummary": "Residents and officials in Juneau prepared for potential glacial flooding, which has caused significant damage to homes and businesses, by monitoring the basin's rising water level.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "a41687aa78044b75be1336dcfc0cf94b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/alaska-glacier-dam-flooding-jokuhlaup-95f06f4e0d82445705d3126aac004f5a",
      "text": "Bursting ice dam in Alaska highlights risks of glacial flooding around the globe\nBursting ice dam in Alaska highlights risks of glacial flooding around the globe\nJUNEAU, Alaska (AP) — The gray, two-story home with white trim toppled and slid, crashing into the river below as rushing waters carried off a bobbing chunk of its roof. Next door, a condo building teetered on the edge of the bank, its foundation already having fallen away as erosion undercut it.\nThe destruction came over the weekend as a glacial dam burst in Alaska’s capital, swelling the levels of the Mendenhall River to an unprecedented degree. The bursting of such snow-and-ice dams is a phenomenon called a jökuhlaup, and while it’s relatively little-known in the U.S., researchers say such glacial floods could threaten about 15 million people around the world.\n“We sat down there and were just watching it, and all of a sudden trees started to fall in,” Amanda Arra, whose house continued hanging precariously over the river bank Monday, told the Juneau Empire. “And that’s when I started to get concerned. Tree after tree after tree.”\nThe flooding in Juneau came from a side basin of the awe-inspiring Mendenhall Glacier, which acts as a dam for the rain and melted snow that collect in the basin during the spring and summer. Eventually, the water gushed out from under the glacier and into Mendenhall Lake, from which it flowed down the Mendenhall River.\nWater released from the basin has caused sporadic flooding since 2011. But typically, the water releases more slowly, over a number of days, said Eran Hood, a University of Alaska Southeast professor of environmental science.\nSaturday’s event was astonishing because the water gushed so quickly, raising the river’s flows to about 1 1/2 times the highest previously recorded — so much that it washed away sensors that researchers had placed to study the glacial outburst phenomenon.\n“The flows were just way beyond what anything in the river could withstand,” Hood said.\nTwo homes were completely lost and a third partially so, Robert Barr, Juneau’s deputy city manager, said Monday. There were no reports of injuries or fatalities.\nEight buildings, including those that fell into the water, have been condemned, but some might be able to be salvaged by substantial repairs or bank stabilization, he said. Others suffered lesser damage.\nWhile climate change is melting the Mendenhall and other glaciers around the world, its relationship to such floods is complicated, scientists say.\nThe basin where the rain and meltwater collect was formerly covered by the Suicide Glacier, which used to flow into the Mendenhall Glacier, contributing ice to it. But the Suicide Glacier has retreated as the climate warms, leaving a lake in the basin dammed by the Mendenhall.\nWhile that part can be linked to climate change, the unpredictable ways that those waters can burst through the ice dams and create floods downstream is not, they said.\n“Climate change caused the phenomenon, but not the individual floods,” Hood said.\nThe variability in the timing and volume of such floods makes it hard to prepare for them, said Celeste Labedz, an environmental seismologist at the University of Calgary.\nMore than half of the people at risk from glacial outburst floods are in just four countries — India, Pakistan, Peru and China, according to a study published this year in Nature Communications.\nOne of the more devastating such events killed up to 6,000 people in Peru in 1941. A 2020 glacial lake outburst flood in British Columbia, Canada, caused a surge of water about 330 feet (100 meters) high, but no one was hurt.\nBecause the ground along the Mendenhall River is largely made up of loose glacial deposits, it’s especially susceptible to erosion, Hood said. The damage could have been much worse if the flood coincided with heavy rains, he said.\nChris and Bob Winter built their house about 50 feet (15.2 meters) off the Mendenhall River in 1981. It flooded for the first time in 2014, an event that prompted them to raise their house 3 feet. It flooded again on Saturday with about 3 inches of standing water, enough to soak the carpets, subflooring and drywall.\n“You just got to rip it all out,” Chris Winter said. “I just don’t know what’s going to happen, but we can’t live in our house right now.”\nShe said her biggest concern is that they are both in their mid-70s and will probably have to move south at some point.\n“We raised our family, and they’re gone and nobody’s in Juneau,” she said. “And I don’t know that we’ll be able to sell it.”\n___\nThiessen reported from Anchorage. Associated Press writer Gene Johnson in Seattle and researcher Jennifer Farrar in New York contributed to this report."
    },
    {
      "url": "https://apnews.com/article/juneau-tourism-mendenhall-glacier-recedes-281e736286abb62d7cee9c6bb6dc8dc9",
      "text": "Crammed with tourists, Alaska’s capital wonders what will happen as its magnificent glacier recedes\nCrammed with tourists, Alaska’s capital wonders what will happen as its magnificent glacier recedes\nJUNEAU, Alaska (AP) — Thousands of tourists spill onto a boardwalk in Alaska’s capital city every day from cruise ships towering over downtown. Vendors hawk shoreside trips and rows of buses stand ready to whisk visitors away, with many headed for the area’s crown jewel: the Mendenhall Glacier.\nA craggy expanse of gray, white and blue, the glacier gets swarmed by sightseeing helicopters and attracts visitors by kayak, canoe and foot. So many come to see the glacier and Juneau’s other wonders that the city’s immediate concern is how to manage them all as a record number are expected this year. Some residents flee to quieter places during the summer, and a deal between the city and cruise industry will limit how many ships arrive next year.\nBut climate change is melting the Mendenhall Glacier. It is receding so quickly that by 2050, it might no longer be visible from the visitor center it once loomed outside.\nThat’s prompted another question Juneau is only now starting to contemplate: What happens then?\n“We need to be thinking about our glaciers and the ability to view glaciers as they recede,” said Alexandra Pierce, the city’s tourism manager. There also needs to be a focus on reducing environmental impacts, she said. “People come to Alaska to see what they consider to be a pristine environment and it’s our responsibility to preserve that for residents and visitors.”\nThe glacier pours from rocky terrain between mountains into a lake dotted by stray icebergs. Its face retreated eight football fields between 2007 and 2021, according to estimates from University of Alaska Southeast researchers. Trail markers memorialize the glacier’s backward march, showing where the ice once stood. Thickets of vegetation have grown in its wake.\nWhile massive chunks have broken off, most ice loss has come from the thinning due to warming temperatures, said Eran Hood, a University of Alaska Southeast professor of environmental science. The Mendenhall has now largely receded from the lake that bears its name.\nScientists are trying to understand what the changes might mean for the ecosystem, including salmon habitat.\nThere are uncertainties for tourism, too.\nMost people enjoy the glacier from trails across Mendenhall Lake near the visitor center. Caves of dizzying blues that drew crowds several years ago have collapsed and pools of water now stand where one could once step from the rocks onto the ice.\nManoj Pillai, a cruise ship worker from India, took pictures from a popular overlook on a recent day off.\n“If the glacier is so beautiful now, how would it be, like, 10 or 20 years before? I just imagine that,” he said.\nOfficials with the Tongass National Forest, under which the Mendenhall Glacier Recreation Area falls, are bracing for more visitors over the next 30 years even as they contemplate a future when the glacier slips from casual view.\nThe agency is proposing new trails and parking areas, an additional visitor center and public use cabins at a lakeside campground. Researchers do not expect the glacier to disappear completely for at least a century.\n“We did talk about, ‘Is it worth the investment in the facilities if the glacier does go out of sight?’” said Tristan Fluharty, the forest’s Juneau district ranger. “Would we still get the same amount of visitation?”\nA thundering waterfall that is a popular place for selfies, salmon runs, black bears and trails could continue attracting tourists when the glacier is not visible from the visitor center, but “the glacier is the big draw,” he said.\nAround 700,000 people are expected to visit this year, with about 1 million projected by 2050.\nOther sites offer a cautionary tale. Annual visitation peaked in the 1990s at around 400,000 to the Begich, Boggs Visitor Center, southeast of Anchorage, with the Portage Glacier serving as a draw. But now, on clear days, a sliver of the glacier remains visible from the center, which was visited by about 30,000 people last year, said Brandon Raile, a spokesperson with the Chugach National Forest, which manages the site. Officials are discussing the center’s future, he said.\n“Where do we go with the Begich, Boggs Visitor Center?” Raile said. “How do we keep it relevant as we go forward when the original reason for it being put there is not really relevant anymore?”\nAt the Mendenhall, rangers talk to visitors about climate change. They aim to “inspire wonder and awe but also to inspire hope and action,” said Laura Buchheit, the forest’s Juneau deputy district ranger.\nAfter pandemic-stunted seasons, about 1.6 million cruise passengers are expected in Juneau this year, during a season stretching from April through October.\nThe city, nestled in a rainforest, is one stop on what are generally week-long cruises to Alaska beginning in Seattle or Vancouver, British Columbia. Tourists can leave the docks and move up the side of a mountain in minutes via a popular tram, see bald eagles perch on light posts and enjoy a vibrant Alaska Native arts community.\nOn the busiest days, about 20,000 people, equal to two-thirds of the city’s population, pour from the boats.\nCity leaders and major cruise lines agreed to a daily five-ship limit for next year. But critics worry that won’t ease congestion if the vessels keep getting bigger. Some residents would like one day a week without ships. As many as seven ships a day have arrived this year.\nJuneau Tours and Whale Watch is one of about two dozen companies with permits for services like transportation or guiding at the glacier. Serene Hutchinson, the company’s general manager, said demand has been so high that she neared her allotment halfway through the season. Shuttle service to the glacier had to be suspended, but her business still offers limited tours that include the glacier, she said.\nOther bus operators are reaching their limits, and tourism officials are encouraging visitors to see other sites or get to the glacier by different means.\nLimits on visitation can benefit tour companies by improving the experience rather than having tourists “shoehorned” at the glacier, said Hutchinson, who doesn’t worry about Juneau losing its luster as the glacier recedes.\n“Alaska does the work for us, right?” she said. “All we have to do is just kind of get out of the way and let people look around and smell and breathe.”\nPierce, Juneau’s tourism manager, said discussions are just beginning around what a sustainable southeast Alaska tourism industry should look like.\nIn Sitka, home to a slumbering volcano, the number of cruise passengers on a day earlier this summer exceeded the town’s population of 8,400, overwhelming businesses, dragging down internet speeds and prompting officials to question how much tourism is too much.\nJuneau plans to conduct a survey that could guide future growth, such as building trails for tourism companies.\nKerry Kirkpatrick, a Juneau resident of nearly 30 years, recalls when the Mendenhall’s face was “long across the water and high above our heads.” She called the glacier a national treasure for its accessibility and noted an irony in carbon-emitting helicopters and cruise ships chasing a melting glacier. She worries the current level of tourism isn’t sustainable.\nAs the Mendenhall recedes, plants and animals will need time to adjust, she said.\nSo will humans.\n“There’s too many people on the planet wanting to do the same things,” Kirkpatrick said. “You don’t want to be the person who closes the door and says, you know, ‘I’m the last one in and you can’t come in.’ But we do have to have the ability to say, ‘No, no more.’”"
    },
    {
      "url": "https://apnews.com/article/alaska-juneau-glacial-dam-flooding-781b1fad39fa1ce0f6800b1a47bfa3c1",
      "text": "Picturesque glacier releases water down a river in Alaska. More than 100 homes are damaged\nPicturesque glacier releases water down a river in Alaska. More than 100 homes are damaged\nJUNEAU, Alaska (AP) — An outburst of flooding from a lake dammed by Juneau’s Mendenhall Glacier damaged at least an estimated 100 homes in what has become a perennial hazard for nearby neighborhoods.\nThe lake formed in a basin that was left behind when a nearby glacier retreated. It fills with rainwater and snowmelt during the spring and summer and at a certain point builds enough pressure to force its way out through channels it carves beneath Mendenhall Glacier. Since 2011, the phenomenon has at times caused flooding of streets or homes near Mendenhall Lake and Mendenhall River.\nLast year, a two-story home was swept away by raging floodwaters that also undermined a condo building, prompting some residents to reinforce the riverbank near their properties. Monday night’s damage was less dramatic but more widespread: Local leaders adopted an emergency resolution saying hundreds of homes were affected, including some outside expected flood areas.\nDeputy City Manager Robert Barr said Tuesday that officials were still trying to get a handle on the extent of the damage.\n“I would say over a hundred homes right now,” he wrote in an email. “I’m less certain about multiple hundreds. Either still possible.”\nThe National Weather Service said the Mendenhall River crested early Tuesday at 15.99 feet (4.9 meters), higher than the 14.97-foot (4.6-meter) crest from last year’s ferocious flood, which devoured huge chunks of riverbank.\nThis year’s flooding reached farther into Mendenhall Valley. There was “a lot more water in the valley, on the streets, in people’s homes,” Barr said. Some streets at one point had 3 to 4 feet (0.9 to 1.2 meters) of water, possibly more, he said.\nHowever, there appeared to be less erosion than last year, he said.\nNo injuries were reported. Gov. Mike Dunleavy issued a disaster declaration to aid the response and recovery.\nThe river level dropped quickly Tuesday.\nThe weather service late last week said the water level in the basin had reached the top of the glacier and warned people to prepare for flooding.\nThe city also had urged residents to have an evacuation plan and to spend Monday night elsewhere. The city opened an emergency shelter, and about 40 people were there overnight, Barr said.\nHe credited increased monitoring by agencies and use of technology with helping provide more preparation time this year."
    },
    {
      "url": "https://apnews.com/article/juneau-alaska-glacial-dam-flood-41113277d75767d9b3bae33b111e5683",
      "text": "An estimated 290 residences damaged by flooding from lake dammed by Alaska glacier, officials say\nJUNEAU, Alaska (AP) — Roughly 290 residences in Alaska’s capital city were damaged last week by flooding from a lake dammed by the Mendenhall Glacier, officials said.\nIn addition to the homes and apartment and condo units, at least two businesses were damaged, Deputy City Manager Robert Barr said in an email Monday.\nThe threat of this kind of flooding has become a yearly concern in parts of Juneau, though the extent of last week’s flooding, which reached farther into the Mendenhall Valley, was unprecedented, officials have said.\nThe flooding occurs because a smaller glacier near Mendenhall Glacier retreated, leaving a basin that fills with rainwater and snowmelt each spring and summer. When the water creates enough pressure, it forces its way under or around the ice dam created by the Mendenhall Glacier, entering Mendenhall Lake and eventually the Mendenhall River.\nSince 2011, the phenomenon has sporadically flooded streets or homes near the lake and river, but the impacts of flooding this year and last were significant. The river crested early last Tuesday at 15.99 feet (4.9 meters), the National Weather Service said, beating the prior record set a year earlier by about 1 foot (0.3 meters).\nThe state has an assistance program that can help with costs to repair damaged homes, with a maximum for an individual or family of $21,250. Other programs including aid to replace essential items, like clothing, and temporary housing assistance for residents displaced by the flooding. Barr did not have an estimate of how many people will need such aid."
    },
    {
      "url": "https://apnews.com/article/native-alaskans-mining-oil-drilling-spiritual-religion-21072257687776250a247a00243e5db6",
      "text": "Trump’s push for drilling, mining sharpens debate for Alaska Natives about land they view as sacred\nTrump’s push for drilling, mining sharpens debate for Alaska Natives about land they view as sacred\nBETHEL, Alaska (AP) — Fish camps still dot the banks of the broad Kuskokwim River in southwestern Alaska. Wooden huts and tarped shelters stand beside drying racks draped with bright red strips of salmon, which Alaska Native families have harvested for generations and preserved for the bitter winters ahead.\nBut the once-abundant salmon populations have declined so sharply in recent years that authorities have severely restricted subsistence fishing on Alaska’s second-longest river. They’ve imposed even tighter restrictions on the longer Yukon River to the north.\nVarious factors are blamed for the salmon collapse, from climate change to commercial fishing practices. What’s clear is the impact is not just on food but on long-standing rituals — fish camps where elders transmit skills and stories to younger generations while bonding over a sacred connection to the land.\n“Our families are together for that single-minded purpose of providing for our survival,” said Gloria Simeon, a Yup’ik resident of Bethel. “It’s the college of fish camp.”\nSo when Alaska Natives debate proposals to drill, mine or otherwise develop the landscape of the nation’s largest state, it involves more than an environmental or economic question. It’s also a spiritual and cultural one.\n“We have a special spiritual, religious relationship to our river and our land,” said Simeon, standing outside her backyard smokehouse where she uses birch-bark kindling and cottonwood logs to preserve this year’s salmon catch. “Our people have been stewards of this land for millennia, and we’ve taken that relationship seriously.”\nTrump policies intensify the debates\nSuch debates are simmering across the state’s vast tundra, broad rivers, sprawling wetlands and towering mountain ranges. Put a pin just about anywhere on the map of Alaska, and you’re likely to hit an area debating a proposed mine, a new wilderness road, a logging site, an oil well, a natural gas pipeline.\nSuch debates have intensified during President Donald Trump’s second term. His administration and allies have pushed aggressively for drilling, mining and developing on Alaska’s public lands.\nMore than 1 in 5 Alaskans identify as Alaska Native or American Indian alone or in combination with another racial group, the highest ratio of any state, according to 2020 U.S. Census figures. Alaska Natives include Aleut, Athabascan, Iñupiat, Tlingit, Yup’ik and other groups. For all their diversity, they share a history in the region dating back thousands of years, as well as cultural and spiritual traditions, including those closely associated with subsistence hunting and gathering.\nNative leaders and activists are divided about extraction projects. Supporters say they bring jobs and pay for infrastructure. Opponents say they imperil the environment and their traditions.\nTribal members sometimes even find themselves on opposite sides of the same proposal. Native-run corporations — formed to benefit Alaska Native shareholders — are supporting a mine in southwestern Alaska that a regional tribal coalition opposes, a scenario similar to an oil exploration project underway in Interior Alaska.\nTrump singled out Alaska as a priority for extraction projects in an executive order signed on his first day in office.\n“Unlocking this bounty of natural wealth will raise the prosperity of our citizens while helping to enhance our Nation’s economic and national security,” the order said.\nIncreasingly, words are turning to action.\nCongress, in passing Trump’s budget bill in July, authorized an unprecedented four new sales of oil and gas leases in the coastal plain of the Arctic National Wildlife Refuge, and still more in other locations.\nTrump cabinet officials made a high-profile visit in June to Prudhoe Bay in Alaska’s far north — an aging oil field that is one of the largest in North America. They touted goals of doubling the oil coursing through Alaska’s existing pipeline system and building a massive natural gas pipeline as its “big, beautiful twin.”\nTrump’s policy shifts came even as he removed one of the most prominent Alaska Native names from the official map. He returned the federal name of “Mount McKinley” to the largest mountain in Alaska and North America. For all their disputes over extraction, Native and Alaska political leaders were largely united in wanting to keep its traditional Athabascan name of Denali, which translates to “the high one.”\n‘We need jobs … to stand on our own two feet’\nIt takes years for proposed extraction projects to unfold, if they ever do. The extent of oil reserves in the Arctic refuge remains uncertain. Limited infrastructure and harsh weather raise costs. No major oil company bid during the only two lease sales offered to date in the Arctic refuge.\nBut the measures pushed by the new administration and Congress amount to the latest pendulum swing between Republican and Democratic presidents, between policies prioritizing extraction and environmental protections.\nThe budget bill calls for additional lease sales in the National Petroleum Reserve-Alaska, west of the Arctic refuge, and opening more areas to potential leasing than authorized under recent Democratic administrations.\nAlaska’s political leaders generally have cheered on the push for more extraction, including its Republican congressional delegation and its governor, who has called his state “America’s natural resource warehouse.”\nSo have some Native leaders, who say their communities stand to benefit from jobs and revenues. They say such projects are critical to their economic prospects and self-determination, providing jobs and helping their communities pay for schools, streets and snow removal. They’ve accused the previous administration of President Joe Biden of ignoring their voices.\n“We need jobs. Our people need training, to stand on our own two feet. Our kids need a future,” said PJ Simon, first chief of the Allakaket Tribal Council. He said communities can maintain their traditions while benefiting from economic development — but that it’s crucial that public officials and businesses include them in the planning. “Native people want to be heard, not pushed aside,” Simon said.\nMayor Nathan Gordon Jr. of Kaktovik, the only community within the Arctic refuge, applauded the budget bill. It enables Kaktovik “to strengthen our community, preserve our cultural traditions, and ensure that we can remain in our homelands for years to come,” he said in a statement issued by Voice of the Arctic Iñupiat, a group advocating for oil exploration.\nA ‘lack of respect’ for Native subsistence traditions\nBut Native opponents of such projects say short-term economic gains come at the risk of long-term environmental impacts that will reverberate widely.\n“We’re kind of viewed as the last frontier, like we have unlimited resources,” said Sophie Swope, executive director of the environmental advocacy group Mother Kuskokwim Tribal Coalition.\nShe said Alaska’s most renewable resources — such as salmon, deer and other migratory wildlife — are threatened both by overly aggressive ocean fishing and by extractive industries.\n“There’s that lack of respect for our traditional subsistence lifestyles,” she said.\nOpponents of oil drilling in the Arctic refuge fear it will permanently disrupt the long-range migration of caribou, which Native people have hunted for millennia. The Tanana Chiefs Conference, a coalition representing dozens of tribes in Alaska’s interior south of the refuge, has long opposed the drilling.\nA massive caribou herd goes to the refuge’s coastal plain to calve in the spring before fanning out across a wider area, providing a crucial food source for Native hunters in Alaska and Canada.\nIf the herd’s migration is disrupted, opponents fear an impact similar to the salmon collapse — a loss not just of food but of a focal point of culture and spirituality.\nWhile the source of the salmon crisis is uncertain, researchers say possible causes include the impacts of commercial fishing, disease, warming waters, other environmental changes and competition between wild and hatchery-reared fish. In a June policy brief, Indigenous leaders, scientists and policy experts called for further study and for easing the disproportionate impact of the crisis on subsistence fishermen.\nBut if the salmon collapse’s cause isn’t clear, its impact is.\nIt has meant “no fish camps, no traditional knowledge that’s been passed down to our younger generation,” said Kristen Moreland, executive director of the Fairbanks-based advocacy group Gwich’in Steering Committee.\nMoreland said she regularly takes her children to her home village in the north to reconnect with traditional festivals and activities, including those centered around the caribou hunt: “They learn all our traditional knowledge that way. What if the caribou doesn’t migrate up there anymore?”\nThe yearslong battle over the refuge takes its toll, she said. “How long do we have to advocate for our land and our people?”\nChief Brian Ridley of the Tanana Chiefs Conference said he sympathizes with those tribal leaders supporting development, given the shortage of well-paying jobs in many villages.\nBut concern over potential long-term environmental damage has prompted the conference to oppose projects such as oil drilling in the Arctic refuge and the nearer Yukon Flats, as well as construction of the so-called Ambler Road, which could open access to mining in more remote areas.\nRidley said he recently attended a national conference with other tribal leaders who echoed a common theme — opposing “development projects on our land or near our land that come in and promise jobs and whatnot, and they come and go and then we get stuck with the long-term negative aspects of cleanup and restoration.”\nEmpty smokehouses, broken spirits\nIn southwestern Alaska, a proposed major mine, the Donlin Gold project, has long been debated.\nThe project, planned by private investors in cooperation with Native corporations owning the land and mineral rights, would require a massive dam to hold back millions of tons of mineral and chemical waste in a valley.\nProject proponents say the dam will involve state-of-the-art design, with its wide base anchored to bedrock and the surrounding mountain walls incorporated into containing the debris. Proponents tout benefits including jobs, shareholder payments and funds for such things as village services and education.\n“This kind of project, since it’s on our lands, is different than most other resource projects,” said Thomas Leonard, vice president of corporate affairs for Calista Corp., a regional Alaska Native corporation involved. “We literally have a seat at the table, have a voice in the project.”\nBut opponents, such as Mother Kuskokwim and some area tribes, aren’t convinced and say the risk of a failure on the Kuskokwim watershed is too great.\n“Protecting the river and the land and the Earth is part of the partnership and the relationship that we have as caregivers,” Simeon said.\nThat relationship isn’t abstract, Simeon said. She said the disruption of communal hunting and fishing activities leads to a spiritual rootlessness that she believes contributes to alarming rates of addictions and suicide among Alaska Native people.\n“What does it do to your heart and soul when you have to look at an empty smokehouse year after year after year, and you can’t provide for your family?” Simeon said.\n___\nAssociated Press journalists Becky Bohrer in Juneau, Alaska, and Mark Thiessen in Bethel contributed to this report.\n___\nAssociated Press religion coverage receives support through the AP’s collaboration with The Conversation US, with funding from Lilly Endowment Inc. The AP is solely responsible for this content."
    },
    {
      "url": "https://apnews.com/article/native-alaskans-mining-oil-drilling-religion-takeaways-12f40b4e48ab3a1a4bb46862674521bc",
      "text": "Takeaways from AP’s report on Alaska Natives’ response to oil and mining proposals\nTakeaways from AP’s report on Alaska Natives’ response to oil and mining proposals\nFAIRBANKS, Alaska (AP) — President Donald Trump’s administration and its allies have pushed aggressively for drilling, mining and logging in Alaska.\nThis has intensified long-standing debate over extraction projects in the nation’s largest state, particularly within Alaska Native communities.\nSome view such projects as key to jobs and economic development. Others see them posing environmental risks as they’ve already faced severe fishing restrictions on the state’s longest rivers due to a collapse in the salmon population.\nScientists are unsure of the causes of the salmon collapse — which possibly include warming waters and commercial fishing — but opponents of extraction say its possible impacts could be similar in terms of endangering subsistence traditions and food sources. They say this risks, in turn, damaging their sacred connections to the land and to cultural traditions tied to fishing and hunting.\nHow has the administration pushed for extraction projects?\nTrump signed an executive order on his first day in office in January seeking to “maximize the development and production of the natural resources” in the state.\nCongress, in its recent budget bill, authorized an unprecedented four new sales of oil and gas leases in the coastal plain of the Arctic National Wildlife Refuge in northeast Alaska. It also authorized more sales in the National Petroleum Reserve-Alaska in the northern part of the state.\nExtraction proposals take years to become reality, if ever. Previous lease sales have generated limited interest, and the extent of oil reserves in the Arctic refuge remains uncertain.\nMembers of Trump’s Cabinet visited Alaska in June. They called for doubling the amount of oil coursing through its vast pipeline system and building a massive natural gas pipeline as its “big, beautiful twin.”\nThe administration is also boosting the proposed Ambler Mining District Industrial Access Project, which would include construction of a 200-mile road in wilderness areas and open the way for more mines.\nPrivate corporations are pursuing projects, some in collaboration with Alaska Native corporations — which sometimes are in conflict with their Indigenous shareholders — and landowners. One is an oil exploration project in the Yukon Flats. Another is a proposed major gold mine in southwestern Alaska, which would require a massive dam to contain millions of tons of chemical and mineral waste. Project proponents say the dam will be safely built, incorporating the surrounding geology and state-of-the-art design.\nTrump’s policy shifts came even as he removed one of the most prominent Alaska Native names from the official map. He returned the federal name of “Mount McKinley” to the largest mountain in Alaska and North America. For all their disputes over extraction, Native and Alaska political leaders were largely united in wanting to keep its traditional Athabascan name of Denali, which translates to “the high one.”\nWhat are the views of Alaska Natives favoring such projects?\nThey say the projects can be done safely and bring much-needed jobs and economic development. They say this enables Native communities to fund services while retaining their subsistence hunting, fishing and other cultural traditions.\n“We find that balance,” said PJ Simon, first chief of the Allakaket Tribal Council. “We don’t want handouts by the federal government. We want to stand on our own two feet.”\nRegional and local Native-run corporations, with the mandate of pursuing economic development for the benefit of Native shareholders, are actively involved in extraction proposals. In some cases, they own land and mineral rights in areas eyed for drilling or mining.\nWhat about Alaska Natives opposing such projects?\nThey fear large-scale drilling and mining will overwhelm their ancient subsistence traditions. They say any short-term profits will precede a long-term legacy of environmental impacts to rivers, tundra and hunting grounds.\n“Our people have been stewards of this land for millennia, and we’ve taken that relationship seriously because we have to sustain our resources,” said Gloria Simeon of Bethel, a small regional hub in southwestern Alaska, and a member of the environmental advocacy group Mother Kuskokwim Tribal Coalition.\nAlready, tribes are struggling with severe fishing restrictions on their longest rivers, the Yukon and Kuskokwim, because of a collapse in salmon populations, which they have relied on for generations.\nThe salmon collapse has been blamed on such factors as commercial overfishing and climate change. But many fear that extractive industries will create similar and permanent damage to caribou, salmon and other traditional food sources.\n“We’re already dealing with salmon problems,” said Chief Brian Ridley of the Tanana Chiefs Conference, a Fairbanks-based coalition of Athabascan tribes across Interior Alaska that oppose proposed drilling projects and the Ambler road project. “The concern is if we start going down this path anywhere along the Yukon or any of the rivers and there’s a spill, would that completely eliminate all the salmon stocks?”\nHe said it’s not just theoretical. A mine disaster in Canada last year caused a massive release of cyanide-laced debris, which caused fears that contamination might spread.\nSuch a mining accident in the Yukon watershed could “really take all the gains that we’ve gotten of trying to get the fish stocks back and really put us back to zero,” Ridley said.\nWhy are subsistence hunting and fishing so important?\nAlaska Native people have relied for generations on hunting and fishing to survive the brutal winters — and in modern times, as a healthier alternative to expensive groceries.\nFish camps and caribou hunts are closely interwoven with cultural traditions, where elders transmit skills and stories to younger generations.\n“Protecting the river and the land and the Earth is part of the partnership and the relationship that we have as caregivers,” said Simeon.\nWho are Alaska Natives?\nAlaska Natives consist of diverse cultural and language groups in the state, among them the Aleut, Athabascan, Iñupiat, Tlingit and Yup’ik.\nThey widely share a history in the region dating back thousands of years. They also share cultural and spiritual traditions, including those closely associated with subsistence hunting, and a belief in a sacred connection to the land, water and wildlife. Specific practices vary, and many follow both traditional and Christian practices.\nMore than 1 in 5 Alaskans identify as Alaska Native or American Indian alone or in combination with another racial group, the highest ratio of any state, according to 2020 U.S. Census figures.\nThe 1971 Alaska Claims Settlement Act, which resolved long-standing land claims with the federal government, resulted in establishment of regional and local for-profit corporations run by Native leaders for the benefit of Native shareholders.\nIn some cases, such corporations are involved in extraction projects that tribal coalitions from the same area oppose.\n___\nAssociated Press journalists Becky Bohrer in Juneau, Alaska, and Mark Thiessen in Anchorage, Alaska, contributed to this report.\n___\nAssociated Press religion coverage receives support through the AP’s collaboration with The Conversation US, with funding from Lilly Endowment Inc. The AP is solely responsible for this content."
    },
    {
      "url": "https://apnews.com/article/juneau-alaska-flood-ice-dam-2216df650049dd41c2a1d17354ea187c",
      "text": "Residents in Alaska capital clean up swamped homes after an ice dam burst and unleashed a flood\nResidents in Alaska capital clean up swamped homes after an ice dam burst and unleashed a flood\nJUNEAU, Alaska (AP) — In her yard under the blazing sun Wednesday, Debbie Penrose Fischer leafed through a water-logged cookbook with sentimental value that she hoped to salvage but doubted she could. Nearby, friends helped carry boxes out of her family’s garage, which was inundated this week after a lake dammed by the Mendenhall Glacier let rip — sending floodwaters into neighborhoods like hers that never had to worry about that threat before.\n“We’re blessed,” she said. “Nobody was hurt. Lots of things I love are gone, and I don’t like that. But it’s just stuff, you know?”\nAbout 100 homes and some businesses were damaged by rapidly rising floodwaters that crested around 3:15 a.m. Tuesday, according to initial estimates. In some areas, cars floated as people scrambled to evacuate. Fischer’s daughter, Alyssa, who lives across the street, said the water in the road at one point reached her hips.\nThe waters began receding Tuesday, and water levels had returned to the normal range for this time of year by Wednesday afternoon, the National Weather Service said.\nThe flooding happens because a smaller glacier near Mendenhall Glacier had retreated — a casualty of the warming climate — and left a basin that fills with rainwater and snowmelt each spring and summer. When the water creates enough pressure, it forces its way under or around the ice dam created by the Mendenhall Glacier and enters Mendenhall Lake and eventually the Mendenhall River, as it did this week.\nSince 2011, the phenomenon has at times flooded streets or homes near the lake and river, and last year floodwaters devoured large chunks of the riverbank, inundated homes and sent at least one residence crashing into the raging river.\nBut the extent of this week’s flooding was unprecedented, officials said, and left residents shaken as they tried to dry out furniture, books and other belongings during a stretch of warm, sunny weather. On Wednesday, piles of garbage bags and other items — wood, boxes, sodden insulation and carpeting — dotted the curbs. A street sweeper was tackling the gray, silty grime the retreating waters had left behind.\nWhile the basin was created by glacial retreat, climate change plays almost no role in the the year-to-year variations in the volume of the flooding in Juneau, said Eran Hood, a professor of environmental science at the University of Alaska Southeast who has studied the Mendenhall Glacier for years.\n“It’s very clear that these floods will persist for some amount of time, again, on a sort of decadal timescale into the future,” he said. “But there are so many different competing factors that work to either increase the volume of the flood or decrease the volume of the flood that we need to be able to quantify that it’s difficult to say how large floods will be in the future without much more detailed modeling of the glacier dynamics.”\nAt some point, Mendenhall Glacier will retreat and thin enough that it can no longer act as a dam, Hood said.\nThe flooding is a reminder of the global risk from bursting snow-and-ice dams — a phenomenon called a jökulhlaup, which is little known in the U.S. but could threaten about 15 million people around the world.\nJuneau, a city of about 30,000 people in southeast Alaska, is reachable only by plane or boat. It’s the height of the tourist season, and the city is already struggling with a housing shortage that could limit temporary accommodations available for flood victims that might need them. Juneau also has limited rental car agencies for those whose vehicles were swamped.\nThe Mendenhall River crested at 15.99 feet (4.9 meters), a new record, topping the level during last year’s flood by about a foot, and the water reached farther into the Mendenhall Valley, officials said. The city said the water reached some homes outside expected flood areas. The valley is roughly a 15 to 20 minute drive from downtown Juneau.\nAlyssa Fischer said that when she went to sleep Monday night, she didn’t think she had to worry about flooding where she lives. Her dad woke her up hours later via FaceTime and alerted her to rising water outside. She helped him move his cars to higher ground, as well as her quails, before evacuating with her 4- and 8-year-old children and pets to a shelter at a local school. She said she noticed the license plate on her truck was bent from the water current.\nOn Wednesday she was relieved that damage to her property was mostly limited to a crawl space and the garage. She had boxes, rugs and other items in her yard and had a fan going to help dry out the garage.\nBut she worries about the future. When she bought the house earlier this year, it was a selling point for her that it was not on the river. After they returned home Tuesday, her 8-year-old daughter asked when the floodwaters would return.\n“I think next year around this time, I’ll be stressed out for sure,” she said. She said she would like to see community meetings about addressing future floods events."
    },
    {
      "url": "https://apnews.com/article/kennedy-vaccines-mrna-pfizer-moderna-1fb5b9436f2957075064c18a6cbbe3c9",
      "text": "RFK Jr. pulls $500 million in funding for vaccine development\nThe Department of Health and Human Services will cancel contracts and pull funding for some vaccines that are being developed to fight respiratory viruses like COVID-19 and the flu. Health and Human Services Secretary Robert F. Kennedy Jr. says safer and more effective vaccines are being developed.\n▶ Follow live updates on President Donald Trump and his administration\nWASHINGTON (AP) — The Department of Health and Human Services will cancel contracts and pull funding for some vaccines that are being developed to fight respiratory viruses like COVID-19 and the flu.\nRobert F. Kennedy Jr. announced in a statement Tuesday that 22 projects, totaling $500 million, to develop vaccines using mRNA technology will be halted.\nKennedy’s decision to terminate the projects is the latest in a string of decisions that have put the longtime vaccine critic’s doubts about shots into full effect at the nation’s health department. Kennedy has pulled back recommendations around the COVID-19 shots, fired the panel that makes vaccine recommendations, and refused to offer a vigorous endorsement of vaccinations as a measles outbreak worsened.\nThe health secretary criticized mRNA vaccines in a video on his social media accounts, explaining the decision to cancel projects being led by the nation’s leading pharmaceutical companies, including Pfizer and Moderna, that offer protection against viruses like the flu, COVID-19 and H5N1.\n“To replace the troubled mRNA programs, we’re prioritizing the development of safer, broader vaccine strategies, like whole-virus vaccines and novel platforms that don’t collapse when viruses mutate,” Kennedy said in the video.\nInfectious disease experts say the mRNA technology used in vaccines is safe, and they credit its development during the first Trump administration with slowing the 2020 coronavirus pandemic. Future pandemics, they warned, will be harder to stop without the help of mRNA.\n“I don’t think I’ve seen a more dangerous decision in public health in my 50 years in the business,” said Mike Osterholm, a University of Minnesota expert on infectious diseases and pandemic preparations.\nHe noted mRNA technology offers potential advantages of rapid production, crucial in the event of a new pandemic that requires a new vaccine.\nThe shelving of the mRNA projects is short-sighted as concerns about a bird flu pandemic continue to loom, said Dr. Paul Offit, a vaccine expert at Children’s Hospital of Philadelphia.\n“It’s certainly saved millions of lives,” Offit said of the existing mRNA vaccines.\nScientists are using mRNA for more than infectious disease vaccines, with researchers around the world exploring its use for cancer immunotherapies. At the White House earlier this year, billionaire tech entrepreneur Larry Ellison praised mRNA for its potential to treat cancer.\nTraditionally, vaccines have required growing pieces of viruses, often in chicken eggs or giant vats of cells, then purifying that material. The mRNA approach starts with a snippet of genetic code that carries instructions for making proteins. Scientists pick the protein to target, inject that blueprint and the body makes just enough to trigger immune protection — producing its own vaccine dose.\nIn a statement Tuesday, HHS said “other uses of mRNA technology within the department are not impacted by this announcement.”\nThe mRNA technology is used in approved COVID-19 and RSV shots, but has not yet been approved for a flu shot. Moderna, which was studying a combination COVID-19 and flu mRNA shot, had said it believed mRNA could speed up production of flu shots compared with traditional vaccines.\nThe abandoned mRNA projects signal a “shift in vaccine development priorities,” the health department said in its statement, adding that it will start “investing in better solutions.”\n“Let me be absolutely clear, HHS supports safe, effective vaccines for every American who wants them,” Kennedy said in the statement.\nSpeaking hours later Tuesday at a news conference in Anchorage, Alaska, alongside the state’s two Republican U.S. senators, Kennedy said work is underway on an alternative.\nHe said a “universal vaccine” that mimics “natural immunity” is the administration’s focus.\n“It could be effective — we believe it’s going to be effective -- against not only coronaviruses, but also flu,” he said.\n—\nAssociated Press writers Lauran Neergaard in Washington, Mike Stobbe in New York and Becky Bohrer in Juneau contributed."
    }
  ],
  "argos_summary": "Residents and officials in Juneau, Alaska, are preparing for potential glacial flooding from the Mendenhall Glacier, which has caused significant damage in previous years. The glacier acts as a dam for a basin that fills with rainwater and snowmelt, and with water levels nearing the dam's top, officials are urging the public to stay vigilant. Recent flooding has already damaged nearly 300 homes, prompting city leaders to implement protective measures and study long-term solutions, as such flooding events are expected to continue due to climate change.",
  "argos_id": "729WQPXFZ"
}