{
  "url": "https://www.gamesradar.com/entertainment/thriller-movies/transformers-director-michael-bay-may-return-to-helm-a-new-version-of-the-franchise-after-leaving-netflix-crime-thriller-fast-and-loose/",
  "authorsByline": "Will Salmon",
  "articleId": "b07788c00f5b4349989966a714bc20c9",
  "source": {
    "domain": "gamesradar.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/ZG7pTs7ByZ63X8YW7H5rok.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T11:16:45+00:00",
  "addDate": "2025-08-08T11:30:00.545490+00:00",
  "refreshDate": "2025-08-08T11:30:00.545493+00:00",
  "score": 1.0,
  "title": "Transformers director Michael Bay may return to helm a \"new version\" of the franchise after leaving Netflix crime thriller Fast and Loose",
  "description": "Will Smith-starring Netflix thriller Fast and Loose has lost its director",
  "content": "Director Michael Bay has stepped away from Fast and Loose, the Will Smith-starring crime thriller that he was set to helm for Netflix, according to Deadline. The film was due to start shooting this October.\n\nFast and Loose was intended to be a reunion between Bay and Smith, who first worked together on 1995's Bad Boys. The plot of the new film hinges on Smith's character, an amnesiac who learns that he has been living a split life as a criminal mastermind and as an undercover agent for the CIA. According to Deadline's report, Bay wanted to dial up the action in the film, while star Smith was keen to push the comedy further.\n\nNetflix's loss may well be Transformers fans' gain, however. Bay is currently in discussions with Paramount about returning to the giant robot franchise that he launched back in July 2007. In total Bay directed five movies in that series over 10 years, ending with Transformers: The Last Knight in 2017.\n\nRecent films in the franchise have been helmed by different directors, with Travis Knight handling 2018's well-received Bumblebee, which we described in our Bumblebee review as a \"fresh, breezy franchise reinvention.\" Steven Caple Jr. was behind the most recent entry, 2023's Transformers: Rise of the Beasts.\n\nBay is also potentially set to direct an in-development adaptation of racing game OutRun which will star Sydney Sweeney. According to Deadline, Netflix will attach a new director to Fast and Loose quickly, in order to hit the planned October start date.\n\nFor more, roll out into our guide on how to watch the Transformers movies in order. Then, discover what other movie release dates you have to look forward to in 2025.",
  "medium": "Article",
  "links": [
    "https://www.gamesradar.com/entertainment/action-movies/hope-you-like-transformers-because-a-new-report-says-there-are-5-films-on-the-way-including-a-new-michael-bay-movie-and-the-g-i-joe-crossover-but-no-transformers-one-sequel/",
    "https://deadline.com/2025/08/michael-bay-exits-will-smith-netflix-film-fast-and-loose-1236481182/",
    "https://www.gamesradar.com/how-to-watch-transformers-in-order/",
    "https://www.gamesradar.com/movie-release-dates/",
    "https://www.gamesradar.com/entertainment/action-movies/netflixs-gears-of-war-movie-is-reportedly-moving-ahead-with-the-fall-guy-director-and-dune-screenwriter/",
    "https://www.gamesradar.com/entertainment/dc-movies/before-james-gunn-took-over-warner-bros-reportedly-wanted-a-henry-cavill-superman-film-directed-by-michael-bay/",
    "https://www.gamesradar.com/bumblebee-review/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Transformers director Michael Bay",
      "weight": 0.118172005
    },
    {
      "name": "Michael Bay",
      "weight": 0.0985901
    },
    {
      "name": "Netflix crime thriller Fast",
      "weight": 0.09701181
    },
    {
      "name": "Director Michael Bay",
      "weight": 0.09481481
    },
    {
      "name": "Bay",
      "weight": 0.09191918
    },
    {
      "name": "star Smith",
      "weight": 0.08796461
    },
    {
      "name": "Will Smith",
      "weight": 0.08674044
    },
    {
      "name": "Recent films",
      "weight": 0.08557484
    },
    {
      "name": "Smith",
      "weight": 0.082042895
    },
    {
      "name": "Transformers",
      "weight": 0.081990294
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.97265625
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.87890625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.65771484375
    },
    {
      "name": "/Arts & Entertainment/Movies/Action & Adventure Films",
      "score": 0.62109375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.427978515625
    },
    {
      "name": "/Arts & Entertainment/Movies/Science Fiction & Fantasy Films",
      "score": 0.4189453125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.368896484375
    }
  ],
  "sentiment": {
    "positive": 0.095214844,
    "negative": 0.5029297,
    "neutral": 0.40185547
  },
  "summary": "Michael Bay, the Transformers director, has left his role in the Netflix crime thriller Fast and Loose, which he was set to helm for the company. The film was intended to be a reunion between Bay and Smith, who first worked together on 1995's Bad Boys. Bay reportedly wanted to increase the action in the film, while Smith was interested to explore the comedy further. However, this loss may be beneficial for Transformers fans as Bay is currently in discussions with Paramount about returning to the franchise. He directed five movies in the series over a decade, including Transformers: The Last Knight in 2017. He is also potentially directing an adaptation of racing game OutRun, which will star Sydney Sweeney.",
  "shortSummary": "Michael Bay has stepped down from Netflix's Fast and Loose to return to helm a \"new\" Transformers franchise, pending Paramount's approval.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ab22c9af11ba45d8b2f54e85e56627b2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.gamesradar.com/movie-release-dates/",
      "text": "Movie release dates 2025: every major film coming out in cinemas and on streaming services\nFrom Tron: Ares to Avatar 3, these are the major 2025 movie release dates to add to your watchlist\nAs summer blockbuster season starts to wind down, there's still no shortage of 2025 movie release dates on the calendar. The second half of the year brings plenty of exciting new movies and sequels, from comedy to horror to sci-fi.\nComing out the other side of Superman and The Fantastic Four: First Steps dominating the box office, the superhero fun isn't over yet with The Toxic Avenger just around the corner. There are also plenty of upcoming horror movies on the way, including the final installment in The Conjuring franchise and a follow-up to The Black Phone. And that's before we even get to major new releases like Avatar 3 and a new Tron film.\nTo make it all a bit easier to digest, we've compiled a comprehensive list of all the most important 2025 movie release dates that should be on your radar, as well as where you can watch these upcoming movies. So, without further ado, grab your popcorn, head to the multiplex, and happy watching.\nNEW MOVIES IN AUGUST\n- The Bad Guys 2 [Cinemas] – August 1\n- The Naked Gun [Cinemas] – August 1\n- Beneath the Storm [Cinemas] – August 1\n- My Oxford Year [Netflix] – August 1\n- Freakier Friday [Cinemas] – August 8\n- Weapons [Cinemas] – August 8\n- Fixed [Netflix] – August 13\n- Nobody 2 [Cinemas] – August 15\n- Splitsville [Cinemas] – August 22\n- The Thursday Murder Club [Netflix] – August 28\n- The Toxic Avenger [Cinemas] – August 29\n- Caught Stealing [Cinemas] – August 29\n- The Roses [Cinemas] – August 29\nNEW MOVIES IN SEPTEMBER\n- The Conjuring: Last Rites [Cinemas] – September 5\n- Downton Abbey 3 [Cinemas] – September 12\n- The Long Walk [Cinemas] – September 12\n- Demon Slayer: Kimetsu no Yaiba Infinity Castle [Cinemas] – September 12\n- Spinal Tap II: The End Continues [Cinemas] – September 12\n- Him [Cinemas] – September 19\n- Xeno [Cinemas] – September 19\n- A Big, Bold Beautiful Journey [Cinemas] - September 19\n- Gabby's Dollhouse: The Movie [Cinemas] – September 26\n- One Battle After Another [Cinemas] - September 26\n- The Strangers: Chapter 2 [Cinemas] - September 26\nNEW MOVIES IN OCTOBER\n- The Smashing Machine [Cinemas] – October 3\n- Roofman [Cinemas] – October 3\n- Avatar: The Way of Water (Re-release) [Cinemas] – October 3\n- TRON: Ares [Cinemas] – October 10\n- Kiss of the Spider Woman [Cinemas] – October 10\n- The Black Phone 2 [Cinemas] – October 17\n- Good Fortune [Cinemas] – October 17\n- After the Hunt [Cinemas] – October 17\n- Mortal Kombat 2 [Cinemas] – October 24\n- Regretting You [Cinemas] – October 24\n- Springsteen: Deliver Me From Nowhere [Cinemas] – October 24\n- Chainsaw Man - The Movie: Reze Arc [Cinemas] – October 29\n- Bugonia [Cinemas] – October 31\nNEW MOVIES IN NOVEMBER\n- Predator: Badlands [Cinemas] – November 7\n- The Running Man [Cinemas] – November 7\n- Nuremberg [Cinemas] – November 7\n- Now You See Me: Now You Don't [Cinemas] – November 14\n- Trap House [Cinemas] – November 14\n- Jay Kelly [Cinemas] – November 14\n- Keeper [Cinemas] – November 14\n- Wicked: For Good [Cinemas] – November 21\n- Sisu 2 [Cinemas] – November 21\n- Zootopia 2 [Cinemas] – November 26\nNEW MOVIES IN DECEMBER\n- Troll 2 [Netflix] – December 1\n- Five Nights at Freddy's 2 [Cinemas] – December 5\n- Ella McCay [Cinemas] – December 12\n- Silent Night, Deadly Night [Cinemas] – December 12\n- Hamnet [Cinemas] – December 12\n- Scarlet [Cinemas] – December 12\n- Knives Out: Wake Up Dead Man [Netflix] – December 12\n- Avatar: Fire and Ash [Cinemas] – December 19\n- The SpongeBob Movie: Search for SquarePants [Cinemas] – December 19\n- Anaconda [Cinemas] – December 25\n- The Housemaid [Cinemas] – December 25\n- Marty Supreme [Cinemas] – December 25\nNeed more to get excited about? Well then, be sure to keep up to date with all of the most exciting new TV shows coming our way, and read about all the new anime scheduled.\nI'm the Senior Entertainment Writer here at GamesRadar+, focusing on news, features, and interviews with some of the biggest names in film and TV. On-site, you'll find me marveling at Marvel and providing analysis and room temperature takes on the newest films, Star Wars and, of course, anime. Outside of GR, I love getting lost in a good 100-hour JRPG, Warzone, and kicking back on the (virtual) field with Football Manager. My work has also been featured in OPM, FourFourTwo, and Game Revolution.\n- Mireia MullorContributing Writer\n- Molly EdwardsDeputy Entertainment Editor\n- Anthony McGlynnContributing Writer\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/dc-movies/before-james-gunn-took-over-warner-bros-reportedly-wanted-a-henry-cavill-superman-film-directed-by-michael-bay/",
      "text": "Before James Gunn took over, Warner Bros reportedly wanted a Henry Cavill Superman film directed by Michael Bay\nIt seems Warner Bros. was already planning to take the otherwise dark films in a new direction\nA new report claims that Warner Bros. was hoping to tap Michael Bay as director for a potential Man of Steel sequel.\nPer The Wrap, Warner Bros. Pictures chiefs Mike De Luca and Pam Abdy briefly tried to get a \"standalone Henry Cavill-led Superman film going in 2022, with Michael Bay eyed to possibly direct.\" [UPDATE: A spokesperson for Warner Bros. denies this claim]. This was before James Gunn and Peter Safran were named as the two new co-heads of DC Studios.\nIt's worth noting that this report lends some credence to a 2022 story that claimed Warner Bros. was doing a complete overhaul that involved bringing classic DC heroes back and taking Superman into a different, lighter direction. Ben Affleck recently commented that movies like Justice League and Batman V Superman were far from kid-friendly.\nIt was announced in 2022 that Henry Cavill would be hanging up the cape, though he's signed on for multiple franchise deals since then, including a live-action Voltron movie, a live-action Warhammer series, and a live-action reboot of Highlander.\nBay has recently traded action movies for documentaries, with his first-ever doc, We Are Storror, premiering at the 2025 South by Southwest Film and TV festival. The pic follows the parkour group Storror, whose stunts have caused some mild controversy. His next project was thought to be a live-action movie based on the shocking YouTube series Skibidi Toilet, which personally scares me on a deep, existential level, though he recently denied reports he'll be directing Skibidi Toilet over on Instagram.\nJames Gunn's Superman hits theaters on July 11. For more, check out our list of all the upcoming DC movies and shows you need to know about.\nBringing all the latest movie news, features, and reviews to your inbox\nLauren Milici is a Senior Entertainment Writer for GamesRadar+ currently based in the Midwest. She previously reported on breaking news for The Independent's Indy100 and created TV and film listicles for Ranker. Her work has been published in Fandom, Nerdist, Paste Magazine, Vulture, PopSugar, Fangoria, and more.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/action-movies/hope-you-like-transformers-because-a-new-report-says-there-are-5-films-on-the-way-including-a-new-michael-bay-movie-and-the-g-i-joe-crossover-but-no-transformers-one-sequel/",
      "text": "Hope you like Transformers, because a new report says there are 5 films on the way, including a new Michael Bay movie and the G.I. Joe crossover, but no Transformers One sequel\nRobots in your eyes\nThe Transformers franchise sure is a tricky beast, and we're not just talking about Grimlock. Since its first live-action outing in 2007, there have been some box-office highs and lows, with the most recent being the critical hit but box office slip-up that was director Josh Cooley's surprisingly entertaining Transformers One. Even after that bump in the road, though, it has now been reported that Paramount is going full throttle with the robots in disguise in not one, but possibly five brand-new projects.\nWord from Puck News reveals that the longtime director of the live-action Transformers franchise and master of slow-motion disaster, Michael Bay, has pitched a brand-new idea to the studio and is willing to return to the director's chair to bring the story to life. Bay hasn't handled a Transformers film since 2017 with Transformers: The Last Knight, which stands as one of the least favored films during the director's time in tussling with Optimus Prime and Megatron.\nHe won't be alone, though, as Cooley also has plans to head back to Cyberton with his own film, this time with a live-action adventure that has been given the green light. There are no plot details on either project, but we're going to guess that at some point, a truck turns up and tells us how freedom is the right of all sentient beings after blowing something up.\nBut while those two mysterious movies are turning gears, there's also the G.I. Joe/Transformers crossover still rumored to be in development following the tease left at the end of Transformers: Rise of the Beasts. If that wasn't enough, it is also rumored that two other mystery titles are being played around with that are set in the world of these beloved rock'em sock'em robots, although no names are attached just yet.\nWhile it might all sound like a big gamble to have this many items on the transforming to-do list, it's also worth noting that this franchise has raked in over $5 billion at the worldwide box office. With that in mind, it's no wonder they're still willing to keep this movie monster going; the only question is which project is going to reach the finish line first?\nShould you need to be reminded of just what kind of vehicular warfare will be heading our way, here's our guide to watching the Transformers movies if you think your eardrums can handle it.\nBringing all the latest movie news, features, and reviews to your inbox\nNick is a freelancer whose work can be found at Screen Rant, The Digital Fix, and Looper. He loves movies, TV, DC, and Marvel. He also believes that the best Robin Hood is still a talking fox.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://deadline.com/2025/08/michael-bay-exits-will-smith-netflix-film-fast-and-loose-1236481182/",
      "text": "EXCLUSIVE: Netflix is back out looking for a director for Fast and Loose, after Michael Bay and Will Smith were unable to bridge creative differences and Bay shook loose of the film Wednesday.\nFast and Loose will star Smith as a man who wakes up in Tijuana with no memories. As he pieces together his past, he learns he’s been living two lives: one as a crime kingpin and the other as an undercover CIA agent. The script by Jon Hoeber, Erich Hoeber, Chris Bremner and Eric Pearson. The film has action as well as comic moments, but Deadline hears Bay wanted more emphasis on the former while Smith wanted to lean into the latter.\nThey are looking to shoot in October, and Netflix will lock in a new filmmaker to keep things on track. Bay has plenty else to do. He is discussing with Paramount a return to the Transformers fold with a new version of that tentpole, and he’s also percolating at Universal OutRun, an adaptation of the video game that is a star vehicle for Sydney Sweeney. Jayson Rothwell is scripting with Bay and Brad Fuller producing with Sweeney.\nWatch on Deadline\nA reunion between Bay and Smith was significant because their stars launched together with 1995’s Bad Boys. That film was Bay’s film directing debut, and it was the vehicle that provided first glimpse of how well Smith would fare as a charismatic action star.\nFast and Loose is being produced by Smith’s Westbrook Studios and Kelly McCormick and David Leitch for 87North.\nBummer, these two supersized egos deserve each other – but is there a dumber movie idea out there? How about Santa wakes up in a chimney and doesn’t remember that he used to Dracula? Does that sell with Michael Bay attached?\nToo bad. The two of them together, it could have been amazingly terrible. Now the movie will have to settle for being just plain terrible.\nBay would have been horrible anyways. Geeez\nBay doesn’t do humor well; I liked transforms (the first 4) but hated all the comedy (the sexual comedy, the goofy character comedy, etc.).\nBay should stick to action! Good call!\nAlso, Will isn’t funny anymore, I grew tired of his act after Fresh Prince but still put up with it because I thought he was a good person.\nall will be ok – it’s a Netflix movie- and will eventually fall dow the void like many others."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/action-movies/netflixs-gears-of-war-movie-is-reportedly-moving-ahead-with-the-fall-guy-director-and-dune-screenwriter/",
      "text": "Netflix's Gears of War movie is reportedly moving ahead with The Fall Guy director and Dune screenwriter\nA live-action adaptation was first announced back in 2016\nNetflix's Gears of War movie is reportedly moving forward - and with David Leitch as director.\nLeitch, who is perhaps best known for helming the stunt-filled Ryan Gosling action-comedy The Fall Guy, is set to direct from a screenplay penned by Jon Spaihts - who wrote Dune and Dune 2 (via The Hollywood Reporter).\nA live-action feature-length film based on Gears of War was first announced back in 2016, but it wasn't until 2022 that Netflix announced it would partner with game studio The Coalition to produce the film. In 2023, Spaihts was announced as writer. There hasn't been much news since then, other than Dave Bautista repeatedly spilling in interviews that he really wants to star in the movie (and has a character pitch all ready to go).\nThe main story of the game concerns a squad of troops who assist in completing an utterly desperate attempt to end a war against a genocidal subterranean enemy known as the Locust, in order to save the remaining human inhabitants on their home planet of Sera.\nAs for the film's plot, The Coalition’s Rod Fergusson said back in 2019 that the film would take place \"in an alternate reality\" rather than follow a direct narrative/plot from the games (which is basically what Prime Video's Fallout TV show did).\nGears of War does not yet have a release date. For more, check out our list of the most exciting upcoming movies in 2025 and beyond, or, check out our every-growing list of upcoming video game movies.\nBringing all the latest movie news, features, and reviews to your inbox\nLauren Milici is a Senior Entertainment Writer for GamesRadar+ currently based in the Midwest. She previously reported on breaking news for The Independent's Indy100 and created TV and film listicles for Ranker. Her work has been published in Fandom, Nerdist, Paste Magazine, Vulture, PopSugar, Fangoria, and more.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/bumblebee-review/",
      "text": "GamesRadar+ Verdict\nAfter her Spider-verse voice-work, Steinfeld leads another fresh, breezy franchise reinvention nicely. Knight takes the wheel with affectionate retro-care.\nWhy you can trust GamesRadar+\nWhen Hailee Steinfeld’s Charlie Watson finds Bumblebee in this Transformers prequel, the Autobot needs some loving care. Metaphor? You might as well spray it all over old yeller’s VW bonnet. After five nu-metal farragoes of decreasing appeal from Michael Bay, director Travis Knight and writer Christina Hodson (Unforgettable) face an uphill struggle: how do you repair a franchise write-off this rough?\nCharm and fun number among the solutions offered by Knight, the Laika animator who made a gorgeous, heartfelt directorial debut with Kubo and the Two Strings. Despite the odd awkward tonal gear shift, Knight’s origin story makes refreshingly light work of its uphill climb, fuelled by wit and warmth. And – crucially – with better songs on the retro-tape deck.\nTrue, the heart briefly sinks in sync with the camera as the prologue plunges to Cybertron. More metal-on-metal melees? Yikes. But, besides helping to make it clear which giant robot is lamping which, the boxy simplicity of Knight’s retro-engineered designs shows a genuine affection for the source cartoons. As for Bumblebee’s voice, Dylan O’Brien’s faintly dorky delivery suggests something equally helpful: Knight gets the ‘for kids’ thing without condescension.\nThe most anticipated upcoming movies of 2018 and beyond\nWhere Bay targeted nostalgic fans who should have outgrown maxed-up toy stories, Bumblebee streamlines and refreshes the nostalgia angle by rewinding to the Transformers’ formative years for a more tween-friendly telling. In California, 1987, Steinfeld’s 18-year-old Charlie grieves for her late dad as she bickers with her mum, endures her dim-bulb step-dad and tinkers with old cars. Yes, tinkers: appealingly klutzy but capable, Charlie spends more time under cars than draped over them. Her band T-shirts pinpoint musical upgrades too, with Bay’s sausage-metal ousted by well-chosen ’80s pleasures from the Smiths to Simple Minds.\nDespatched to earth by Optimus Prime, the sweetly curvy ’Bee suffers bruising scraps with Decepticons before taking cover among other broken-down vehicles, where Charlie finds him. Although Charlie later develops ties with goofball-next-door Memo (an endearing Jorge Lendeborg Jr), her mutually restorative ’Bee bond anchors the comedy and action with an uncomplicated focus that proves welcome after Bay’s strenuous ’bot-based myth-building. Knight’s plot lifts – E.T., The Iron Giant - are transparent, but at least he lifts from the best and makes warm work of the job.\nIf he can’t revive interest in the five-films-old Autobots-vs-Decepticons war so easily, he does manage to wring some fun from it. Decepticons Shatter (Angela Bassett) and Dropkick (Justin Theroux) arrive equipped with some triple-changing swagger and nifty sado-moves. True, their alliance with US forces is silly. But at least its idiocy doesn’t go unnoticed by Burns (John Cena), the kind of military man who barks “There’s a door in my way” when he wants something blowing up and banks almost enough mock-macho likeability to get away with his cheesier moments.\nAlthough some of the zingers could use a little sharpening, Hodson’s dashes of wit do bring levity to a series that didn’t previously ‘do’ humour in ways recognisable to human ears. Steinfeld’s equally grounded character adds heart and a can-do streak: where other writers might have ‘fixed’ her sorrows with manly assistance, Charlie takes charge of the fixing here. Whether she’s checking her armpits for BO or gently rebuffing Memo’s awkward advances, Charlie plays like a bid to call time on the hot-pants fetishism of Bay’s era. In that savvy fix and elsewhere, Knight and Hodson have salvaged something agreeable from an otherwise badly dented series.\nGet sneak previews, exclusive competitions and details of special events each month!\nBumblebee sounds brilliant but will it make it on to our list of the best movies of 2018 so far?\n- Release date: December 21, 2018 (US)/December 26, 2018 (UK)\n- Certificate: PG-13 (US)/12A (UK)\n- Running time: 113 mins\nKevin Harley is a freelance journalist with bylines at Total Film, Radio Times, The List, and others, specializing in film and music coverage. He can most commonly be found writing movie reviews and previews at GamesRadar+."
    },
    {
      "url": "https://www.gamesradar.com/how-to-watch-transformers-in-order/",
      "text": "How to watch the Transformers movies in order (release date and chronological)\nFrom 2007's Transformers to Rise of the Beasts and Transformers One, here's how to watch the franchise in order\nSince Michael Bay kicked off the live-action Transformers movies in 2007, the robots in disguise have been all over the big screen. Not only the Autobots and the Decepticons either, as 2023's Rise of the Beasts finally brought the Maximals into live-action.\nAfter a few years of regular sequels, the franchise took some turns, even dipping back into animation, making charting the Transformers movies in order slightly trickier. In 2024, Transformers One took us to Cybertron long before Optimus Prime and Megatron put wheels down on Earth, re-imagining what turned the two icons into mortal enemies in an unending battle for supremacy.\nWhether you're an '80s kid through and through or someone who just loves a bit of Bayhem, we've made the Transformers watch order as straightforward as possible, laying out the franchise in release date and chronological order. Once you're confident Bonecrusher and Starscream aren't anywhere to be seen, the only thing you'll need to worry about is what refreshments you'll want while watching.\nFor more watch guides, check out how to watch the Marvel movies in order and how to watch Pokemon in order. You can also read our Transformers One review here.\nHow to watch the Transformers movies in order – release date\nThere are currently seven live-action Transformers movies, with one animated movie releasing in September. The first, simply called Transformers, was released in 2007. A sequel, Revenge of the Fallen, landed in 2009 and was soon followed by Dark of the Moon in 2011.\nMichael Bay then directed his fourth Transformers movie, Age of Extinction, in 2014 before bringing The Last Knight into cinemas in 2017. A prequel, Bumblebee, was released in 2019 and, finally, Rise of the Beasts released in cinemas on June 9, 2023.\nThe latest addition, Transformers One, arrived in 2024. It's a prequel that could lead to a separate timeline all its own, but for now it sits here, alongside the others.\nBringing all the latest movie news, features, and reviews to your inbox\nOn paper, the Transformers release date order looks like this:\n- Transformers (2007)\n- Transformers: Revenge of the Fallen (2009)\n- Transformers: Dark of the Moon (2011)\n- Transformers: Age of Extinction (2014)\n- Transformers: The Last Knight (2017)\n- Bumblebee (2019)\n- Transformers: Rise of the Beasts (2023)\n- Transformers One (2024)\nHow to watch the Transformers movies in order – chronological order\nThe Transformers timeline officially begins with Bumblebee in 1987. Rise of the Beasts takes place seven years later, while the remaining Transformers movies take place in the early 21st Century. There are various prologues and flashbacks that take place throughout but, here, we're focusing on the main underlying story told in each movie's 'present day.'\nTransformers, Revenge of the Fallen, and Dark of the Moon form one trilogy, while Age of Extinction and The Last Night are set after and form another saga. Each is part of the same shared timeline, however, and features repeat appearances from the likes of Optimus Prime, Megatron, and multiple human characters.\nTransformers One is a prequel, set before any of the main film storylines. It's pretty removed from the live-action movies, but sits comfortably at the start in terms of chronology for now.\nThe Transformers movie chronology consists of:\n- Transformers One\n- Bumblebee (1987)\n- Transformers: Rise of the Beasts (1994)\n- Transformers\n- Transformers: Revenge of the Fallen\n- Transformers: Dark of the Moon\n- Transformers: Age of Extinction\n- Transformers: The Last Knight\nFor more on our watch guides, check out how to watch Demon Slayer in order, and how to watch Neon Genesis Evangelion in order.\nI'm the Senior Entertainment Writer here at GamesRadar+, focusing on news, features, and interviews with some of the biggest names in film and TV. On-site, you'll find me marveling at Marvel and providing analysis and room temperature takes on the newest films, Star Wars and, of course, anime. Outside of GR, I love getting lost in a good 100-hour JRPG, Warzone, and kicking back on the (virtual) field with Football Manager. My work has also been featured in OPM, FourFourTwo, and Game Revolution.\n- Anthony McGlynnContributing Writer\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    }
  ],
  "argos_summary": "Michael Bay has exited the Netflix film 'Fast and Loose,' which stars Will Smith as an amnesiac navigating a dual life as a criminal mastermind and CIA agent. The departure was due to creative differences, with Bay favoring more action while Smith preferred a comedic approach. Netflix plans to quickly find a new director to maintain the film's October shooting schedule, while Bay is in talks to return to the 'Transformers' franchise and is also developing a film adaptation of the racing game 'OutRun'.",
  "argos_id": "75OZZOWZP"
}