{
  "url": "https://www.sfchronicle.com/news/article/residents-in-alaska-s-capital-city-prepare-for-20809397.php",
  "authorsByline": "By MARK THIESSEN, Associated Press",
  "articleId": "e1950f2c83e745029244d794769391b4",
  "source": {
    "domain": "sfchronicle.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T20:17:32+00:00",
  "addDate": "2025-08-08T20:34:48.603258+00:00",
  "refreshDate": "2025-08-08T20:34:48.603260+00:00",
  "score": 1.0,
  "title": "Residents in Alaska's capital city prepare for possible glacial flooding",
  "description": "Residents and officials in Juneau are preparing for the possibility of glacial flooding that in past years has swept away houses and eroded the river fed by the popular Mendenhall Glacier. The water...",
  "content": "ANCHORAGE, Alaska (AP) — Residents and officials in Alaska's capital city prepared Friday for the possibility of glacial flooding that in past years has swept away houses, swamped several hundred homes and eroded the river fed by the popular Mendenhall Glacier.\n\nThe state, federal, city and tribal officials who would run an incident command center during any flooding held a briefing to outline steps and to issue pleas to the public to be prepared.\n\nThe threat of so-called glacier outburst flooding has become an annual concern in parts of Juneau since 2011. The Mendenhall Glacier — a thinning, retreating glacier that is a major tourist attraction in southeast Alaska — acts as a dam for a basin that fills each spring and summer with rainwater and snowmelt. The basin itself was left behind when a smaller, nearby glacier retreated.\n\nWhen the water in the basin creates enough pressure, it forces its way under or around the ice dam created by the Mendenhall Glacier, entering Mendenhall Lake and eventually the Mendenhall River.\n\nThe water level in the basin as of Friday stood at 1,353 feet (412 meters) and continues to rise, said Nicole Ferrin with the National Weather Service. It's just 15 feet (1.5 meters) from topping the ice dam.\n\nThe basin has been rising at an unpredictable rate, so there is no way to pinpoint when water would go over the top, she said.\n\n“Some days when there's no rain, it only rises by a foot (0.30 meters),” she said. “Other days when there is heavy rain or a lot of sunshine, it rises by 4 feet (1.22 meters), so it's a variable.”\n\nIn some years, there has been limited flooding of streets or properties near the lake or river. But 2023 and 2024 marked successive years of record flooding, with the river last August cresting at 15.99 feet (4.9 meters), about 1 foot (0.3 meters) over the prior record set a year earlier, and flooding extending farther into the Mendenhall Valley.\n\nA large flood event can release up to 15 billion gallons of water, according to the University of Alaska Southeast and Alaska Climate Adaptation Science Center. That’s the equivalent of nearly 23,000 Olympic-size swimming pools. During last year's flood, the flow rate in the rushing Mendenhall River was about half that of Niagara Falls, the researchers say.\n\nCity officials responded to concerns from property owners this year by working with state, federal and tribal entities to install a temporary levee along roughly 2.5 miles of riverbank in an attempt to guard against widespread flooding. The installation of about 10,000, four-foot (1.2-meter) tall barriers is intended to protect more than 460 properties from flood levels similar to last year, said Nate Rumsey, deputy director with the city's engineering and public works department.\n\nThe U.S. Army Corps of Engineers is at the start of what's expected to be a yearslong process of studying conditions in the region and examining options for a more permanent solution. The timeline has angered some residents, who say it's unreasonable.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "record flooding",
      "weight": 0.08434665
    },
    {
      "name": "glacial flooding",
      "weight": 0.08342115
    },
    {
      "name": "possible glacial flooding",
      "weight": 0.0807778
    },
    {
      "name": "last year",
      "weight": 0.08002631
    },
    {
      "name": "widespread flooding",
      "weight": 0.07960414
    },
    {
      "name": "limited flooding",
      "weight": 0.07891878
    },
    {
      "name": "past years",
      "weight": 0.07390414
    },
    {
      "name": "City officials",
      "weight": 0.07283881
    },
    {
      "name": "successive years",
      "weight": 0.0722249
    },
    {
      "name": "southeast Alaska",
      "weight": 0.07105165
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.96240234375
    },
    {
      "name": "/News/Weather",
      "score": 0.958984375
    },
    {
      "name": "/News/Local News",
      "score": 0.94140625
    }
  ],
  "sentiment": {
    "positive": 0.061431885,
    "negative": 0.65527344,
    "neutral": 0.2836914
  },
  "summary": "Alaska's capital city, Juneau, is preparing for possible glacial flooding, a term known as \"glacial outburst flooding\" which has become an annual concern since 2011. The state, federal, city and tribal officials have established an incident command center to handle any flooding. The Mendenhall Glacier, a retreating glacier, acts as a dam for a basin that fills with rainwater and snowmelt each spring and summer. The water level in the basin continues to rise, with the National Weather Service stating it is just 15 feet from topping the ice dam. A large flood event can release up to 15 billion gallons of water, the equivalent of nearly 23,000 Olympic-size swimming pools. City officials have installed a temporary levee along roughly 2.5 miles of riverbank to guard against widespread flooding.",
  "shortSummary": "Alaskan residents and officials prepared for potential glacial flooding, which has caused significant property losses and flooding in recent years, with ongoing concerns raised.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "a41687aa78044b75be1336dcfc0cf94b",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Residents and officials in Juneau, Alaska, are preparing for potential glacial flooding from the Mendenhall Glacier, which has historically caused significant damage since 2011. The glacier acts as a dam for a basin that fills with rainwater and snowmelt, and the water level is currently nearing the dam's limit. In response to recent record flooding, city officials have installed temporary levees to protect properties, while the U.S. Army Corps of Engineers begins a long-term study for a permanent solution.",
  "argos_id": "7MIQ703JY"
}