{
  "url": "https://nypost.com/2025/08/08/entertainment/brandon-blackstock-diagnosed-with-cancer-after-kelly-clarkson-divorce/",
  "authorsByline": "Amanda Rubio",
  "articleId": "a89ec3048c2c430989552671f0531ef8",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/109363640.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T18:49:37+00:00",
  "addDate": "2025-08-08T18:53:13.992640+00:00",
  "refreshDate": "2025-08-08T18:53:13.992641+00:00",
  "score": 1.0,
  "title": "Brandon Blackstock was diagnosed with cancer after Kelly Clarkson divorce",
  "description": "Kelly Clarkson’s ex-husband passed away on Thursday, August 7, at age 48.",
  "content": "Brandon Blackstock learned he had cancer following his divorce from Kelly Clarkson.\n\nThe late talent manager, who died on Aug. 7 at age 48, “was diagnosed after the divorce,” a source told People.\n\nBlackstock and Clarkson, 43, married in 2013 and shared two children: daughter River, 11, and son Remington, 9. He was also father to two other children, Savannah and Seth Blackstock, from his first marriage to Melissa Ashworth.\n\nSeven years into his and Clarkson’s marriage, the “Since U Been Gone” singer filed for divorce in 2020, citing irreconcilable differences. Their divorce was finalized in 2022, with Clarkson granted primary custody of the children.\n\nIn a statement obtained by The Post, Blackstock’s family announced his passing following a yearslong private battle with cancer.\n\n“It is with great sadness that we share the news that Brandon Blackstock has passed away,” the statement read. “Brandon bravely battled cancer for more than three years.\n\n“He passed away peacefully and was surrounded by family. We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time,” they concluded.\n\nSources told TMZ that Blackstock had been battling melanoma, a serious form of skin cancer, and passed away Thursday morning.\n\nThe day before Blackstock’s tragic death, Clarkson postponed the remaining August shows of her Las Vegas residency.\n\nShe explained that Blackstock was experiencing health issues and she needed to focus on caring for their children.\n\n“Unfortunately, I need to postpone the remainder of the August Studio Session dates in Las Vegas,” the “Stronger” hitmaker wrote on her Instagram on Aug. 6.\n\n“While I normally keep my personal life private, this past year, my children’s father has been ill, and at this moment, I need to be fully present for them,” she revealed.\n\nClarkson concluded, “I am sincerely sorry to everyone who bought tickets to the shows, and I so appreciate your grace, kindness and understanding.”\n\nIn the wake of Blackstock’s passing, another source told People that Clarkson had “been devastated” for their children ever since her ex-husband received his diagnosis.\n\n“When she found out that he was sick, she remained protective of him for their sake,” the insider told the outlet. “Kelly has always tried to keep things classy. It became clear earlier this year that Brandon was not doing well. She’s been devastated for the kids.”\n\nThough the ex-couple’s divorce was filled with drama, the source emphasized that the “American Idol” winner stayed focused on maintaining Blackstock’s relationship with their children.\n\nDescribing the split and ensuing legal battle as “messy, painful and something [Clarkson] felt terrible about,” the source added, “The divorce was incredibly difficult for her… But she always wanted her kids to have the best relationship possible with their dad. She never spoke poorly about Brandon to the kids.”\n\nSources would go on to confirm to Page Six that Blackstock had been secretly battling cancer, and that Clarkson had been juggling work while caring for her ex behind the scenes.\n\n“It’s been exhausting and so sad,” the source said. “Kelly has been working so hard, as well as looking after Brandon. Despite their difficult divorce, he’s still the man she loved and still her kids’ father.”",
  "medium": "Article",
  "links": [
    "https://people.com/kelly-clarkson-devastated-for-kids-ex-husband-death-source-11787280",
    "https://nypost.com/2025/08/08/entertainment/pete-davidson-slams-snl-50-star-studded-audience-terrible/",
    "https://pagesix.com/2025/08/07/celebrity-news/kelly-clarkson-has-caring-for-her-ex-during-serious-illness/?_gl=1*pue133*_ga*OTE0OTQ0NDIxLjE3NDQzMzY4Nzc.*_ga_0DZ7LHF5PZ*czE3NTQ2NzEyMDEkbzI1JGcxJHQxNzU0Njc1NzQ4JGo2MCRsMCRoMA..",
    "https://www.tmz.com/2025/08/07/kelly-clarkson-ex-husband-brandon-blackstock-dead/#continued",
    "https://nypost.com/2025/08/06/entertainment/kelly-clarkson-cancels-vegas-residency-as-she-reveals-ex-husbands-illness/",
    "https://nypost.com/2025/08/07/entertainment/kelly-clarksons-ex-husband-brandon-blackstock-dead-at-48/",
    "https://nypost.com/entertainment/kelly-clarkson-and-brandon-blackstock-relationship-timeline/",
    "https://nypost.com/2025/08/07/entertainment/kelly-clarkson-devastated-for-kids-after-brandon-blackstocks-death/",
    "https://nypost.com/2025/08/05/entertainment/jamie-lee-curtis-reacts-to-pamela-anderson-liam-neeson-romance/",
    "https://www.instagram.com/p/DNCSxWEpKEY/?utm_source=ig_web_copy_link",
    "https://nypost.com/2025/08/07/entertainment/katy-perry-called-giant-spoiled-brat-in-15m-mansion-war-against-veteran/",
    "https://people.com/brandon-blackstock-was-diagnosed-with-cancer-after-kelly-clarkson-divorce-source-11787478"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Kelly Clarkson divorce",
      "weight": 0.110541865
    },
    {
      "name": "Brandon Blackstock",
      "weight": 0.10770048
    },
    {
      "name": "Kelly Clarkson",
      "weight": 0.09820015
    },
    {
      "name": "Seth Blackstock",
      "weight": 0.094495475
    },
    {
      "name": "Blackstock",
      "weight": 0.0942316
    },
    {
      "name": "Clarkson",
      "weight": 0.08979709
    },
    {
      "name": "divorce",
      "weight": 0.07378343
    },
    {
      "name": "skin cancer",
      "weight": 0.07343637
    },
    {
      "name": "cancer",
      "weight": 0.0700091
    },
    {
      "name": "Sources",
      "weight": 0.06911111
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9970703125
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.921875
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.452392578125
    },
    {
      "name": "/Health/Health Conditions/Cancer",
      "score": 0.3056640625
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.304931640625
    }
  ],
  "sentiment": {
    "positive": 0.088256836,
    "negative": 0.6196289,
    "neutral": 0.29223633
  },
  "summary": "Brandon Blackstock, the late talent manager, passed away on August 7 at age 48 after learning he had cancer following his divorce from Kelly Clarkson. The couple, who married in 2013 and shared two children, Blackstock was also father to two other children from his first marriage. Their divorce was finalized in 2022, with Clarkson granted primary custody of the children. Blackstock had been battling melanoma, a serious form of skin cancer. The day before his death, Clarkson postponed the remaining August shows of her Las Vegas residency due to health issues. Despite their difficult divorce, Clarkson remained focused on maintaining Blackstock's relationship with their children.",
  "shortSummary": "Brandon Blackstock died of cancer after a divorce from Kelly Clarkson, who had primary custody of their children.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "99a98d75801e4cb48ccf7f6c28e50161",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/07/entertainment/kelly-clarkson-devastated-for-kids-after-brandon-blackstocks-death/",
      "text": "Kelly Clarkson ‘devastated’ for her children after ex-husband Brandon Blackstock’s death\nKelly Clarkson’s top priority is her kids after her ex-husband Brandon Blackstock’s death.\nThe “Since U Been Gone” singer, 43, has “been devastated” for her daughter, River, 11, and son Remington, 9, whom she shared with Blackstock, ever since their father was diagnosed with cancer over three years ago.\nThe talent manager died on Thursday, August 7, at age 48, following a yearslong private battle with melanoma, a serious form of skin cancer.\n“When she found out that he was sick, she remained protective of him for their sake,” a source told People after Blackstock’s passing.\n“Kelly has always tried to keep things classy. It became clear earlier this year that Brandon was not doing well. She’s been devastated for the kids,” they added.\nClarkson married Blackstock in 2013.\nThe Grammy winner filed for divorce in 2020 after seven years of marriage. Following a two-year battle, which had several ups and downs, Clarkson and Blackstock settled their divorce in 2022.\nWhile the insider acknowledged that their divorce “was incredibly difficult for her,” they stressed the significance of Clarkson wanting her children to remain close with their father.\nCalling the split and legal battle “messy, painful and something she felt terrible about,” the source added, “But she always wanted her kids to have the best relationship possible with their dad. She never spoke poorly about Brandon to the kids.”\nIn 2023, the singer-songwriter got candid about co-parenting, noting that her children’s happiness has always been her main concern.\n“I ask my kids every night when we’re snuggling and I put them to bed, ‘Are you happy? And if you’re not, what could make you happier?'” Clarkson said on Angie Martinez’s “IRL” podcast. “Especially the past two years … it kills me [but] I want them to be honest so I don’t ever say, ‘Oh God, don’t tell me that,’ but a lot of times it would be like, ‘I’m just really sad. I wish Mommy and Daddy were in the same house.’ They’re really honest about it. I’m raising that kind of individual.”\nThe “Breakaway” singer continued, “I just sit there and I’m like, ‘I get it. I’m from a divorced family as well. I get it. That sucks. But we’re going to work it out. And you are so loved by both of us.'”\nBlackstock’s loved ones announced his death on Thursday, just hours after Clarkson abruptly canceled the remaining August shows of her Las Vegas residency, Studio Sessions.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away. Brandon bravely battled cancer for more than three years,” his family said in a statement obtained by The Post.\n“He passed away peacefully and was surrounded by family. We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time,” they added.\nOn Wednesday, Clarkson postponed her shows for the second time since her residency started at Caesars Palace last month, citing Blackstock’s health issues and noting she needed to be there for their daughter and son.\n“Unfortunately, I need to postpone the remainder of the August Studio Session dates in Las Vegas,” Clarkson wrote on her Instagram, just two days before her Friday, Aug. 8 performance.\n“While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them,” the singer explained.\n“I am sincerely sorry to everyone who bought tickets to the shows and I so appreciate your grace, kindness and understanding.”\nClarkson has been noticeably absent from her duties this year, with speculation about her personal life swirling after she missed 10 episodes of her talk show, “The Kelly Clarkson Show,” in March.\nSources later confirmed to Page Six about Blackstock’s secret cancer battle, revealing that his ex had been pulling double duty behind the scenes, caring for him.\n“It’s been exhausting and so sad,” a source told Page Six. “Kelly has been working so hard, as well as looking after Brandon. Despite their difficult divorce, he’s still the man she loved and still her kids’ father.”\nThe “American Idol” winner met her ex while rehearsing for the Academy of Country Music Awards in May 2006, when Blackstock’s father, Narvel, was her manager.\nAt the time, Blackstock was married to Melissa Ashworth.\nHe reconnected with Clarkson in 2012, the same year his divorce was final, at the Super Bowl, where she was singing the national anthem.\nThe pair married in October 2013, before welcoming daughter River in June 2014 and son Remington in April 2016.\nClarkson and Blackstock’s divorce was contentious, with the former lovers fighting over money, custody and property.\nHowever, the battle came to an end in March 2022, when a judge granted Blackstock $115,000 per month in spousal support until January 2024. He was also awarded a monthly amount of $45,600 in child support.\nBesides the two children he shares with Clarkson, Blackstock leaves behind another daughter, Savannah, who’s in her 20s, and son Seth, 18, both from his first marriage."
    },
    {
      "url": "https://www.tmz.com/2025/08/07/kelly-clarkson-ex-husband-brandon-blackstock-dead/#continued",
      "text": "Kelly Clarkson's Ex-Husband Brandon Blackstock Dead at 48\nBrandon Blackstock Kelly Clarkson's Ex-Husband Dead at 48\nBrandon Blackstock -- Kelly Clarkson's ex-husband and former manager -- has died, TMZ has confirmed.\nThe statement reads, \"It is with great sadness that we share the news that Brandon Blackstock has passed away. Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family. We thank you for your thoughts and prayers and ask everyone to respect the family's privacy during this very difficult time.\"\nSources with direct knowledge tell TMZ ... Blackstock was fighting melanoma, a serious form of skin cancer. We're told Brandon passed away this morning, just a few hours ago, after battling the disease for three and a half years.\nIt was clear Blackstock was dealing with a major health issue ... because Clarkson announced she was postponing her Las Vegas residency because of her ex-husband's health issues -- explaining she needed to be with her children. People broke the news of his death.\nAs you know ... rumors have persisted over the last few months that she was going to leave \"The Kelly Clarkson Show\" because of her numerous absences -- though we've now confirmed these were all connected to Blackstock's illness.\nEveryone on the staff knew about the illness, we're told ... but, they kept it to themselves out of respect for Kelly and Brandon's privacy.\nBlackstock and Clarkson met at a rehearsal for the Academy of Country Music Awards back in 2006 ... though they didn't start dating until early 2012 after reconnecting at Super Bowl XLVI. They got engaged later that year and married in 2013.\nDuring their marriage, they welcomed two children together ... and, Clarkson said Blackstock even convinced her to get into hosting her own talk show. Kelly filed for divorce in 2020, and it was finalized in March 2022.\nBlackstock began his career with Starstruck Entertainment, his father's company ... and, he managed big acts like Blake Shelton and Rascal Flatts.\nBlackstock was 48.\nRIP"
    },
    {
      "url": "https://pagesix.com/2025/08/07/celebrity-news/kelly-clarkson-has-caring-for-her-ex-during-serious-illness/?_gl=1*pue133*_ga*OTE0OTQ0NDIxLjE3NDQzMzY4Nzc.*_ga_0DZ7LHF5PZ*czE3NTQ2NzEyMDEkbzI1JGcxJHQxNzU0Njc1NzQ4JGo2MCRsMCRoMA..",
      "text": "Kelly Clarkson helped care for ex Brandon Blackstock as he fought melanoma\nKelly Clarkson took a leave of absence earlier this year to help care for her sick ex-husband, Brandon Blackstock, who was battling melanoma, multiple sources told Page Six. Blackstock tragically died at age 48, his family announced Thursday.\nClarkson left fans in the dark when she suddenly took time off from NBC’s “The Kelly Clarkson Show” in February and March, leaving celeb pals to fill in for her.\nBehind the scenes, she was looking after Blackstock, the father of her daughter River, 10, and son Remington, 8. Their divorce was finalized in 2022.\n“It’s been exhausting and so sad… ” a source told Page Six. “Kelly has been working so hard, as well as looking after Brandon. Despite their difficult divorce, he’s still the man she loved and still her kids’ father.”\nClarkson, 43, announced Wednesday night that she was canceling the rest of the August dates of her “Studio Sessions” Las Vegas residency to be with Blackstock, 48, whom we were previously told had a “serious” illness.\n“While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them,” Clarkson shared.\nThe “Breakaway” singer has primary custody of River and Remington after her bitter split from talent agent Blackstock, who is the former stepson of country star Reba McEntire.\n“I am sincerely sorry to everyone who bought tickets to the shows and I so appreciate your grace, kindness and understanding,” the “American Idol” winner posted on her Instagram Wednesday.\nClarkson’s next round of performances is scheduled for November 2025, according to her website.\nThe singer-turned-talk-show-host of was off the air for almost two weeks in March, leaving stars including Andy Cohen, Simu Liu, Brooke Shields and Willie Geist to step in for her.\nShe returned to taping on March 18, but was then replaced by a guest host the following day, before returning for the March 20 episode.\nClarkson then axed the opening night of her “Studio Sessions” residency at the Colosseum at Caesars Palace just 90 minutes before showtime, devastating fans.\nShe could not risk causing “serious damage” to her voice, since, as one Vegas insider told us, “She belts out every single note. She’s an incredibly powerful singer, but it takes its toll on her vocal cords and she’s come incredibly close to needing surgery before.”\nTellingly, a second insider in the know added at the time: “Kelly’s personal life is so insanely complicated … Kelly is fighting some serious hidden battles that very few people are privy to … it’s a source of emotional and therefore physical distress for her.”\nClarkson has been candid about just how much the divorce — which came after seven years of marriage — and ensuing legal battle took out of her, telling Apple Music in 2023, “Just to be brutally honest, I did not handle [the divorce] well.”\nWe have reached out to reps for Clarkson.\nWhile all this has been going on, sources told us that Clarkson — who moved to New York City for the show — is keen to leave the program when her contract expires next year, to spend more time focused on her kids and music.\nWhen married, Clarkson and Blackstock shared homes in Nashville, Los Angeles and Montana."
    },
    {
      "url": "https://nypost.com/entertainment/kelly-clarkson-and-brandon-blackstock-relationship-timeline/",
      "text": "Kelly Clarkson and Brandon Blackstock’s relationship timeline: the ups and downs\nKelly Clarkson and Brandon Blackstock’s relationship was full of ups and downs.\nThe exes were married for almost 10 years before they finalized their divorce in 2022.\nClarkson, 43, and Blackstock, who passed away at age 48 on Thursday, Aug. 7, share kids River Rose, 11, and Remington “Remy” Alexander, 9.\nIn March, the “American Idol” winner opened up about co-parenting, stating that there is a double standard when it comes to working moms and working dads.\nClarkson joked she looks “like [an] a – – hole” when she can’t show up to her child’s function due to work, but when Blackstock can’t make it, he isn’t met with the same response.\n“And then [my daughter] is like, ‘Why weren’t you there? This person’s mommy was there,'” the Grammy winner explained on Kylie Kelce’s “Not Gonna Lie” podcast.\n“And I’m like, ‘Congratulations to her because she made different decisions that led to her being able to be there on a Thursday at 10 a.m.'”\nClarkson and Blackstock first split in 2020 after nearly seven years of marriage, and officially finalized their messy divorce two years later.\nKeep reading for a complete look back on Clarkson and Blackstock’s relationship.\nMay 2006: Clarkson and Blackstock meet\nThe former couple first crossed paths during a rehearsal for the Academy of Country Music Awards in May 2006.\n“My guitar player’s wife Ashley was my date for that night and we had just both been in crap relationships,” Clarkson shared in 2017. “Sometimes it sucks dating because it’s so many wrong ones until you get the right one.”\nShe continued, “And we were like, ‘OK, what we’ve been doing wrong here’ — because it was a country music event and we’re both southern girls — we were like, ‘We’ve been dating skinny jeans and we need Wranglers.'”\nThen, Clarkson spotted the former stepson of Reba McEntire.\n“Literally, I’m not joking, he walked past us at that time,” she detailed. “And he walked by, I was ready to take it all off. I just felt something.”\nAt the time of the award show, Blackstock was still married to his then-wife, Melissa Ashworth. The two, who share daughter Savannah, 23, and son Seth, 18, divorced in 2012.\nFebruary 2012: Clarkson and Blackstock reconnect\nDespite crossing paths years earlier, the former flames reconnected in 2012, while Blackstock’s father, Narvel, was Clarkson’s manager.\nThe artist was performing the national anthem at the Super Bowl. Next to her was Blake Shelton, who was managed by Blackstock, singing “America the Beautiful.”\n“I was so nervous because it wasn’t that I didn’t want to suck for the millions of people watching, I didn’t want to suck because I was trying to impress a guy,” Clarkson admitted to SiriusXM in 2017. “I wanted him to be like, ‘Damn.’ It had nothing to do with the Super Bowl!”\nClarkson and Blackstock had their first date on February 11, 2012. The day held major significance to Clarkson since it was also the day her idol, Whitney Houston, died.\n“This is the funniest/worst thing ever: One of my superhero idols is Whitney Houston, and the day she died was our first date,” Clarkson shared in 2013, per People. “I was like, ‘This is a bad omen.'”\nDecember 2012: Clarkson and Blackstock get engaged\n“I’ve only had three other boyfriends that I dated, and not really seriously,” Clarkson admitted to People in 2013. “This guy walks by, making everybody laugh. I said, ‘I’m gonna end up with him. I know it.'”\nAnd she was right.\nThe pair got engaged in December 2012, with Clarkson sharing the happy news on Twitter.\n“I’M ENGAGED!!!!!” the talk show host gushed. “I wanted y’all to know!! Happiest night of my life last night! I am so lucky and am with the greatest man ever.”\nBlackstock popped the question at their Nashville house.\nClarkson recalled to People about the proposal: “Out of nowhere I just said, ‘Thanks for being an awesome guy.’ I’ve never been loved properly by a man, and I was just like, ‘I thank you so much for that.'”\nBlackstock then got down on one knee.\n“Not a damn clue!” she continued to the outlet. “If I did, I would have worn something besides Uggs and a sweatshirt with no bra.”\nOctober 2013: Clarkson and Blackstock get married\nClarkson and Blackstock tied the knot on Oct. 20, 2013.\nAt the time, the musician tweeted, “I’m officially Mrs. Blackstock :) We got married yesterday at Blackberry Farms in TN, the most beautiful place ever!”\n“I was so emotional, and I didn’t realize I was going to be!” Clarkson dished to People in 2020.\n“During the ceremony, Seth looked up and was like, ‘What’s wrong with her?’” she recounted. “I was like, ‘I’m just so happy!’”\nClarkson also touched on becoming a blended family with Blackstock’s kids.\n“My best friend always say, ‘You just want to create the family you never had.’ I might be doing that,” Clarkson said. “In defense of my family, it happens. People fall out of love, and people go separate ways. People are human. I’ve accomplished a lot, but I guess the biggest success I want is that whenever I die people will say, ‘She was so successful as a mother and as a wife.’ That’s kind of a big goal.”\nJune 2014: River Rose Blackstock is born\nClarkson and Blackstock welcomed their first child together, daughter River Rose, months after tying the knot.\n“Our baby girl River Rose Blackstock arrived on June 12th!” the new mom posted on X at the time. “Thank you everyone for all of your well wishes! Brandon and I are on cloud 9!!”\nIn 2023, Clarkson had her daughter join her onstage at the Bakkt Theater at the Planet Hollywood Las Vegas Resort & Casino to perform a duet of “Heartbeat Song.”\nHer son also came on stage to showcase his dance moves.\n“Both of my kiddos backstage getting ready to join me on stage in Vegas,” Clarkson gushed on Instagram the next day. “Nothing will ever be as cool and amazing as these two little humans that will always have my whole heart.”\nApril 2016: Remington Alexander Blackstock is born\nClarkson announced she was pregnant with her second child in a very public way.\nDuring a performance in Los Angeles, she became emotional while introducing her song “Piece by Piece.”\n“I was not planning on announcing this, but … I’m totally pregnant. I’m having a really hard time,” she told the audience.\n“I’m gonna nail the s – – t out of this song. That was not how I wanted to announce that … I hate this song right now,” Clarkson teased. “My makeup artist is backstage hating me right now. I just don’t want you to think I’m on pills or drunk.”\nAfter finishing the song, she told the concertgoers, “I’d like to apologize to my husband. That was not planned. I just didn’t want you to think I was crazy or something. Honestly, I’m just so hormonal today… I haven’t vomited yet. That is a freakin’ win, y’all.”\nOn April 12, 2016, Clarkson and Blackstock welcomed their son, Remy.\nAt one point, Clarkson’s son suffered from hearing issues and delayed speech. The hearing issue set Remy back “almost nine months” in communicating.\n“The big milestone for us is Remy getting to really find out his own personality and his identity, because it’s been frustrating for him to not be able to really vocalize his emotion,” Clarkson told People in 2020. “The fact that he’s making full sentences now and full-on engaging with us is really a blessing.”\nJune 2020: Clarkson files for divorce\nAfter almost seven years of marriage, Clarkson filed for divorce on June 4, 2020, citing irreconcilable differences.\nNovember 2020: Clarkson wins temporary primary custody\nIn November 2020, Clarkson was awarded temporary primary physical custody of River and Remy.\nAccording to court documents, “the level of conflict between the parents [had] increased” and that they had “a difficult time co-parenting due to issues of trust between them.”\nThe documents also stated that Clarkson and Blackstock agreed that they “shall not speak in a derogatory manner about the other parent to the minor children. The custodial parent shall not allow the minor children to be in the presence of any third party who speaks about the other parent in a derogatory manner.”\nOne month after the court’s decision, Clarkson alleged that Blackstock acted fraudulently as her manager. He denied defrauding his estranged wife out of millions.\nAt the time, Clarkson also told Entertainment Tonight that the “thing that’s been kind of hard to navigate is I am an open book, but at some point I’m a mama bear more than I am a person in the public eye.”\n“So I care 100% more about my children than I do anything else on this planet.”\nMarch 2022: Clarkson and Blackstock’s divorce is finalized\nIn March 2022, a judge approved the exes’ divorce settlement, granting Blackstock $115,000 each month in spousal support until January 2024. The talent manager also received a monthly amount of $45,600 in child support.\nClarkson is also officially awarded primary custody of the kids.\nFall 2023: Clarkson relocated to New York City\n“The Kelly Clarkson Show” relocated to New York City, with the mom of two bringing her children with her.\n“The move to NYC was a fresh start for her that she has never regretted,” an insider told People in 2024. “She had not been happy in Los Angeles for a while but was still nervous about moving. It was the best decision for her though. They thrive as a family.”\nBlackstock, meanwhile, resided in Butte, Mont., after moving out of the family’s original Montana ranch.\nJanuary 2024: Clarkson opens up about the split\nClarkson told People at the time she poured a lot of her emotions from her divorce into her album, “Chemistry.”\n“I didn’t see it other than: This is my outlet,” she told the publication. “I’m a let-go person; I don’t hold grudges. So it was really delving into what happened in my life and why — and what am I going to do about it?”\nClarkson said releasing the album “[was] like, ‘I’m taking my power back.’”\n“I cannot express how appreciative I feel for having that kind of healthy outlet. Because the level of depression and things that come with divorce or grieving is extraordinarily hard,” she added. “You feel alone, and it’s just a blessing to be able to have that outlet for those emotions that are overwhelming.”\nAugust 2025: Blackstock dies of cancer\nOn Aug. 7, 2025, it was announced that Blackstock died at age 48 after a private cancer battle, with sources telling TMZ he had melanoma, a serious form of skin cancer.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away. Brandon bravely battled cancer for more than three years,” his family said in a statement obtained by The Post read.\n“He passed away peacefully and was surrounded by family. We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time,” they concluded.\nBlackstock’s passing comes just hours after Clarkson abruptly postponed the remaining August shows of her Las Vegas residency, Studio Sessions.\nShe previously canceled opening weekend in July."
    },
    {
      "url": "https://nypost.com/2025/08/07/entertainment/kelly-clarksons-ex-husband-brandon-blackstock-dead-at-48/",
      "text": "Kelly Clarkson’s ex-husband Brandon Blackstock dead at 48 after private melanoma battle\nKelly Clarkson is mourning the death of her ex-husband, Brandon Blackstock.\nThe talent manager — whose family was pivotal in her career — died at the age of 48 after a private cancer battle.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away. Brandon bravely battled cancer for more than three years,” his family said in a statement obtained by The Post on Thursday, Aug. 7.\n“He passed away peacefully and was surrounded by family. We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time,” they concluded.\nThe Post has reached out to Clarkson’s rep for comment.\nSources told TMZ that Blackstock had melanoma, a serious form of skin cancer, noting that he passed away this morning.\nBlackstock’s passing comes just hours after the “Since U Been Gone” singer abruptly postponed the remaining August shows of her Las Vegas residency, Studio Sessions.\nThe decision marked the second time she canceled dates in the series at Ceasars Palace since it started last month.\nClarkson married Blackstock in 2013, and they have two children: daughter River, 11, and son Remy, 9.\nThe Grammy winner filed for divorce in 2020. The exes went through a nasty legal battle, which included fighting over custody of the kids and their Montana ranch. They reached a settlement in 2022.\nBlackstock was the former stepson of Reba McEntire. The country superstar was married to his father, Narvel Blackstock, from 1989 to 2015.\nOn Wednesday, Clarkson shared a heartbreaking statement, revealing her ex-husband’s illness.\n“Unfortunately, I need to postpone the remainder of the August Studio Session dates in Las Vegas,” Clarkson wrote on her Instagram, just two days before she was set to take the stage.\n“While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them,” the singer added.\n“I am sincerely sorry to everyone who bought tickets to the shows and I so appreciate your grace, kindness and understanding.”\nClarkson also postponed the first two shows of her residency in July, announcing the news just 90 minutes before showtime and citing the need for vocal rest.\nSources told Page Six at the time that she had “hidden battles that very few people are privy to,” adding, “It’s a source of emotional and therefore physical distress for her.”\nThey added: “Kelly’s personal life is so insanely complicated.”\nThe singer-songwriter first sparked concern when she missed 10 episodes of her syndicated talk show, “The Kelly Clarkson Show,” in March, with her A-list friends stepping in to cover her hosting gig.\nWhile she later cited a personal matter, insiders shared that behind the scenes, her personal life was unraveling due to Blackstock’s ailing health.\n“It’s been exhausting and so sad,” a source told Page Six. “Kelly has been working so hard, as well as looking after Brandon. Despite their difficult divorce, he’s still the man she loved and still her kids’ father.”\nThey also noted that Clarkson took time off to help care for her ex-husband in his time of need.\nBefore Clarkson, Blackstock was married to Melissa Ashworth from 2001 to 2012. The pair had two kids: daughter Savannah, who’s in her 20s, and son Seth, 18.\nSavannah and her father appeared in several photos together on social media in March, taken during a family outing that included his brother Shelby Blackstock, 35; his mother, McEntire, 70; and her longtime partner, Rex Linn.\nBlackstock’s children with Clarkson also appeared in some of the pictures.\nClarkson and her ex met at a rehearsal for the Academy of Country Music Awards in May 2006 when his dad was her manager and he was married to Ashworth.\nThey reconnected years later at the Super Bowl.\nAfter their wedding, Brandon became Clarkson’s manager. He also managed her former “Voice” co-star Blake Shelton’s career until his divorce from the star.\n“I wouldn’t have hired Brandon to be my manager if I didn’t see first-hand how great he is at that and how much he cares about Blake,” Clarkson told Marie Claire in 2018. “And the way that [Blake’s] career has blown up, I would have hired Brandon regardless. He’s really talented at what he does and his mind really does work in a completely different way.”\nThe “Because of You” singer, who had primary custody of their two children, has opened up about the emotional toll she faced after their split.\n“I think the thing about divorce — especially having it publicized, and people thinking they know the whole thing — the hardest part of that is, like, it wasn’t an overnight decision,” she revealed in 2023, a year after the divorce was finalized. “I wanted to make [our marriage] beautiful. I wanted to make it awesome. I wanted to make it everything it possibly could be, and sometimes that just doesn’t happen.”\nClarkson also got brutally honest, telling Apple Music that same year, “I did not handle [the divorce] well.”\nBlackstock became a grandfather in 2022 when Savannah welcomed her son. She is reportedly expecting again.\nBrandon is also survived by sisters Shawna and Chassidy."
    },
    {
      "url": "https://people.com/kelly-clarkson-devastated-for-kids-ex-husband-death-source-11787280",
      "text": "Kelly Clarkson 'Devastated' for Her Kids After Ex-Husband's Death, 'Remained Protective of Him for Their Sake': Source Brandon Blackstock died on Aug. 7 after privately facing cancer for three years By Rachel DeSantis Rachel DeSantis Rachel DeSantis is a senior writer on the music team at PEOPLE. She has been working at PEOPLE since 2019, and her work has previously appeared in Entertainment Weekly and the New York Daily News. People Editorial Guidelines Updated on August 8, 2025 10:09AM EDT 125 Comments NEED TO KNOW Kelly Clarkson's ex-husband Brandon Blackstock died on Aug. 7 at age 48A source tells PEOPLE she has been \"devastated\" for the two children she and Blackstock share\"She always wanted her kids to have the best relationship possible with their dad,\" the source says of Clarkson Kelly Clarkson continues to prioritize her two children after the death of their father, Brandon Blackstock. A source tells PEOPLE that the singer-songwriter has “been devastated” for her kids River, 11, and Remington, 9, as their dad, who died on Thursday, Aug. 7 at age 48, faced cancer for three years privately. “When she found out that he was sick, she remained protective of him for their sake,” the source says. “Kelly has always tried to keep things classy. It became clear earlier this year that Brandon was not doing well. She’s been devastated for the kids.” Kelly Clarkson; Brandon Blackstock. Gilbert Carrasquillo/GC Images; Taylor Hill/Getty Clarkson, 43, filed for divorce from Blackstock, a talent manager, in 2020 after seven years of marriage, and their split was finalized two years later. Though their divorce was acrimonious, and the two were later involved in various legal proceedings, the source says that Clarkson knew the importance of her children’s relationship with their father. \"The divorce was incredibly difficult for her — messy, painful and something she felt terrible about,” the source says. “But she always wanted her kids to have the best relationship possible with their dad. She never spoke poorly about Brandon to the kids.” Brandon Blackstock and Kelly Clarkson attend the 25th Annual Critics' Choice Awards at Barker Hangar on January 12, 2020 in Santa Monica, California. Kevin Mazur/Getty In 2023, Clarkson opened up about co-parenting with Blackstock, and reiterated that her children and their feelings were her top priority. \"I ask my kids every night when we're snuggling and I put them to bed, 'Are you happy? And if you're not, what could make you happier?' \" Clarkson said on Angie Martinez's IRL podcast. \"Especially the past two years ... it kills me [but] I want them to be honest so I don't ever say, 'Oh God, don't tell me that,' but a lot of times it would be like, 'I'm just really sad. I wish Mommy and Daddy were in the same house.' They're really honest about it. I'm raising that kind of individual.\" She continued, \"I just sit there and I'm like, 'I get it. I'm from a divorced family as well. I get it. That sucks. But we're going to work it out. And you are so loved by both of us.' \" Related Stories Kelly Clarkson and Her Kids Receive Outpouring of Support After Ex Brandon Blackstock's Death Brandon Blackstock, Kelly Clarkson’s Ex-Husband and Talent Manager, Dies at 48 from Cancer In 2021, Clarkson said on her talk show that sharing parenting duties was \"tough,\" but there were things she and Blackstock agreed on. \"It's tough. ... I know with me and Brandon, it's just a difficult thing because we're in different places, and it's like, we both agree on the main things, but it's a hard thing when you're not together all the time, for me personally,\" she said, later adding, \"As long as you make sure it's about the children and their best interests, then we're both on board.\" A rep for the family announced Blackstock’s death on Aug. 7 in a statement that revealed he’d “bravely battled cancer for more than three years.” Kelly Clarkson performing. Weiss Eubanks/NBCUniversal via Getty \"It is with great sadness that we share the news that Brandon Blackstock has passed away,\" the statement read. \"Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family. We thank you for your thoughts and prayers and ask everyone to respect the family's privacy during this very difficult time.\" Blackstock had not publicly shared his diagnosis prior to his death, though Clarkson revealed that he was “ill” in a statement shared on Wednesday, Aug. 6. Clarkson wrote on Instagram at the time that she would be postponing her Las Vegas residency in order to be “fully present” for her kids. \"While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them,” she wrote in a statement. “I am sincerely sorry to everyone who bought tickets to the shows and I so appreciate your grace, kindness and understanding.\" The “Stronger” singer missed several episodes of her talk show, The Kelly Clarkson Show, earlier this year largely due to Blackstock’s illness, multiple sources told PEOPLE. Leave a Comment Read more: Celebrity Celebrity News Celebrity Tragedy"
    },
    {
      "url": "https://nypost.com/2025/08/08/entertainment/pete-davidson-slams-snl-50-star-studded-audience-terrible/",
      "text": "Pete Davidson doesn’t mince words about ‘SNL 50’ star-studded audience: ‘Terrible’\nTough crowd.\nPete Davidson revealed that the star-studded audience during the “Saturday Night Live” 50th anniversary special was, well, “terrible.”\nOn Wednesday’s episode of “Late Night With Seth Meyers,” Davidson, 31, said, “It’s a terrible audience. It’s just famous people, and famous people only like themselves.”\nDavidson, who was on “SNL” for eight seasons, from 2014 to 2022, added that he’s “guilty of this” too.\n“SNL50: The Anniversary” aired on Feb. 16, and commemorated a landmark half-century of the iconic New York sketch comedy show with a medley of musical performances and sketches from current and past stars — including Davidson, Andy Samberg, Eddie Murphy, Adam Sandler, Amy Poehler, Kate McKinnon, and Will Ferrell.\nAs Davidson pointed out, the audience was mostly made up of stars, including Robert De Niro, Kim Kardashian, Blake Lively, Ryan Reynolds, Jon Hamm, Alec Baldwin, Drew Barrymore, David Letterman, and Steve Martin.\nThe house was so packed that the production designer told The Post they had to add 200 extra chairs to accommodate all the guests.\nJack Nicholson, 88, was also on hand to introduce an Adam Sandler segment — even though he’s been spotted in public less frequently in recent years.\nDavidson, who revealed in July that he’s expecting his first child with girlfriend Elsie Hewitt, admitted not all of the guests were bad, though.\n“Meryl [Streep] rules,” he said of the 76-year-old Oscar winner.\n“I get to my seat and I just look and I’m like, ‘This can’t be right.’ And it was Meryl Streep and I just sat down and I was like, ‘I’m so sorry that I’m sitting next to you. You’re the best.’ And she was very nice.”\nDuring the special, Davidson appeared in a pre-taped sketch as his Chad character, along with Laraine Newman, 73, who was in the original cast when the show launched in 1975.\nFellow original cast member Dan Aykroyd, 73, recently said he skipped the special because he wanted to watch it from home. The most “emotional” moment for him was Newman’s sketch with Davidson, which he called “beautiful.”\n“It’s my one character that I got to do. In eight years of ‘SNL,’ I had one character,” Davidson said.\n“But it’s not a very flattering character. Everyone was so excited to see Laraine, and then I just have my shirt off.”"
    },
    {
      "url": "https://nypost.com/2025/08/07/entertainment/katy-perry-called-giant-spoiled-brat-in-15m-mansion-war-against-veteran/",
      "text": "Katy Perry labeled a ‘giant spoiled brat’ in $15M mansion war against 85-year-old ‘dying’ veteran\nKaty Perry is no teenage dream to the family of the 85-year-old disabled veteran she’s gearing up to fight in court.\nThe “Roar” singer, 40, will face off with Carl Westcott’s family for the second phase of their legal war after he sold Perry, via her business manager Bernie Gudvi, his $15 million mansion in 2020.\nDays later, Carl — who suffers from the neurological disorder Huntington’s disease — had a change of heart and attempted to back out of the deal. He blamed his mental capacity, claiming he was not in his right mind and under the influence of pain medication after undoing a recent surgery when he made the decision to sell.\nDespite his arguments, the judge ruled that Perry was the rightful owner of the Santa Barbara, Calif., mansion in December 2023. “Westcott presented no persuasive evidence that he lacked capacity to enter into a real estate contract between June 10, 2020, and June 18, 2020, the days during which he negotiated and signed the contract,” the judge said at the time.\nThe judge also stated the court found significant evidence to demonstrate the entrepreneur knowingly signed on the contract’s dotted line, ruling he seemed to be “coherent, engaged, lucid, and rational.”\nThe deed was later transferred to the singer’s LLC, DDoveB (a tribute to the daughter she shares with Bloom, Daisy Dove, 4), in May 2024.\nHowever, their battle isn’t over.\nThe “California Gurls” singer countersued Carl, claiming the veteran owes her $3.25 million in damages because she was unable to rent out the mansion during their legal fight from September 2020 to March 2024.\nPerry’s legal team later added an additional $2.29 million in repair damages, claiming it needed to be restored to the condition it was purchased in.\nPhase two of the mansion war is scheduled for Aug. 21.\nChart Westcott, Carl’s son, spoke exclusively to The Post after the judge ruled on Aug. 1 that Perry’s ex, Orlando Bloom, would not have to testify in the trial.\nCarl’s lawyers wanted to depose the actor to grill him about the alleged repairs and ask if he ever lived in the home with his now ex-fiancée.\nWhen asked if it was an injustice that Bloom won’t have to take the stand, Chart responded, “It absolutely is,” alleging the actor “told our property manager he was ‘in charge of repairs’ and in addition to that, he is on the LLC that owns the house as a manager.”\n“He should have to testify. It isn’t, you know, about us trying to drag him into it. He’s already in it. It’s ridiculous.”\nThe Post verified that Orlando is also listed on the LLC.\nChart said his understanding of the ruling is that “the door is not completely closed,” with the Westcott family’s reps sharing that their lawyers plan to fight with a potential new motion regarding Orlando’s testimony.\nUpon hearing the ruling, Chart shared, “I wasn’t surprised and I understand the judge’s desire to avoid a media circus but the reality is that everything these two people do, Katy and Orlando, is in the media and also like just because they have media attention doesn’t excuse them from the obligations that the court can put them under and it shouldn’t. That’s a two-tier celebrity privilege standard, and that’s not OK.”\nPerry’s team insisted the pop star was owed $2.2 million for the alleged repairs that were needed to restore the house to its purchased condition, citing structural defects and deferred maintenance.\nThey claimed experts examined the estate sometime last year and determined “that significant portions needed to be repaired, including nearly a million dollars in pervasive flood damage that occurred in early 2024 and substantial repairs that are needed due to a large tree falling on and cracking the foundation of one of the buildings on the Property, among many other defects throughout the Property.”\nPerry attorneys also argued that “Gudvi bargained for the condition of the Property in July 2020, and the $15 million purchase price was based on the Property as it existed at that time. Westcott should not be able to profit from his own deficient construction and lack of maintenance while this litigation was pending.”\nChart and his family, however, won’t go down without a fight.\n“Katy could’ve walked away at any time with grace and humanity. Instead, she has chosen to fight a dying man in court, all for money. OK, that’s who we’re dealing with here. He is bedridden. He has late-stage dementia and Huntington’s. His ability to speak kind of ebbs and flows. Some days are better than others,” Chart said of his father’s ailing health.\n“He’s stable, but it’s declined. I mean, we have thought he could die any day for several years now because of how much he’s just withering away,” he explained.\n“There’s no argument to justify what’s happening here from a moral perspective like this is the exploitation of a man whose mind and body are basically shutting down, and he’s being dragged into court.”\nChart said his dad is “literally bedridden and can barely speak,” adding, “that’s been the status for over a year.”\nCarl’s son slammed the “Firework” singer, noting, “He’s spending his days in a hospital bed and Katy Perry is spending her days trying to get his money.”\nTo Chart, he feels Perry’s public image is the opposite of what he’s seen during the nearly five-year legal fight.\n“Here’s what makes me so mad, though. Her public image, she tries to couch it as, you know, empathy and compassion, and all these you know bulls–t words that are not who she is,” he quipped.\n“I mean, her fake compassion, her fake empathy. It’s all bulls–t. You know, she’s a greedy bitch.”\nChart, who will be testifying at the trial, revealed his ideal outcome would be “for the judge to tell her she gets no damages, to pound sand, and she never should’ve done this in the first place.”\n“I just can’t believe she hasn’t even apologized. She hasn’t even said, ‘Sorry, we’re putting you through this,'” he continued. “It’s disgusting.”\nChart added: “Avoiding accountability for her immoral and wrong choices is basically a hallmark of her. She’s essentially a giant spoiled brat, you know, I mean it, like to boil it down.\n“She’s never had to grow up, and so she doesn’t realize, I’m not giving her, I’m not excusing her, but like I don’t think she fully understands the moral consequences of her actions, like she’s not fully developed from a moral perspective.”\nWestcott’s attorneys previously shot down Perry’s claims that the property was damaged between 2020 and 2024. They claimed Perry had to deposit $9 million of the $15 million sale price into an escrow account, which left “$6 million of the price she owes up to the decision of the court after the second phase of the trial,” reported Us Weekly.\n“Perry’s game is clear. During years of litigation, she asserted $3.25 million in loss of use damages. But immediately after the [decision], providing that she would pay $9 million of the $15 million price … was approved by the Court, she is trying to add $2.29 million in ‘new damages’ which brings her total damages claim up to $5.4 million, an amount close to the $6 million she still owes,” their filing reportedly read.\nFor Chart and his family, it’s not about the money.\n“I don’t need the money,” he insisted, claiming Perry’s “taking from” the things Carl wanted to give his fortune to. “Not an insubstantial portion of his money is going to charity, and instead it’s going to her. That’s bulls–t,” he said.\nThe Post reached out to Perry and Bloom’s lawyers and PR teams for comment.\nThe “Last Friday Night” singer’s ex hasn’t been the only celebrity dragged into the ongoing legal case.\nPerry is set to be grilled about allegedly renting the eight-bedroom mansion to Chris Pratt and his wife, Katherine Schwarzenegger, after a June report claimed the couple had recently moved into the 9,285-square-foot estate, according to court documents obtained by Us Weekly."
    },
    {
      "url": "https://nypost.com/2025/08/05/entertainment/jamie-lee-curtis-reacts-to-pamela-anderson-liam-neeson-romance/",
      "text": "Jamie Lee Curtis gives blunt response to Pamela Anderson and Liam Neeson’s romance\nJamie Lee Curtis is defending Pamela Anderson and Liam Neeson’s love story.\nThe “Freakier Friday” star, 66, shared a blunt message to the public about the “Naked Gun” actors’ rumored romance in a new interview with “VT.”\n“With all due respect to pop culture, if love has found its way into that relationship, God bless them both,” Curtis said, adding, “Leave them the f–k alone. And let them like each other.”\n“Both of them have had hardship, and they’re both beautiful human beings,” Curtis continued of the stars as she got choked up. “If they actually have found an intimate love with each other, we should all go to bed tonight feeling better.”\nCurtis also called Anderson, 58, “a beautiful person” and noted that the “Baywatch” alum “was fantastic” in their 2024 film “The Last Showgirl.”\n“And he also suffered an unimaginable loss so young, and has had a really hard go of it,” Curtis added of Neeson, 73, who became a widower in 2009 after his wife Natasha Richardson died in a ski accident.\n“So if, in fact, these people have hard launched, then wish them the best and leave them alone,” Curtis concluded.\nNeeson and Anderson struck up chemistry while filming “The Naked Gun” reboot.\n“It’s a budding romance in the early stages,” a source told People last week. “It’s sincere, and it’s clear they’re smitten with each other.”\nWhile Neeson and Anderson haven’t outright confirmed they’re dating, they have gushed over each other during the film’s press tour.\n“I think I have a friend forever in Liam. And we definitely have a connection that is very sincere, very loving and he’s a good guy,” Anderson told Entertainment Weekly earlier this month.\nNeeson told People in October that he was “madly in love” with Anderson.\n“I can’t compliment her enough, I’ll be honest with you,” the “Taken” actor said. “No huge ego. She just comes in to do the work. She’s funny and so easy to work with.”\nThe stars have also packed on the PDA in recent weeks.\nAnderson planted a kiss on Neeson’s cheek at the London premiere of “The Naked Gun” last month, and then they pretended to make out during an appearance on “Today” later in July.\nNeeson was previously married to Richardson from 1994 until her death in 2009. They welcomed two sons together, Micheál, 30, and Daniel, 28, the latter of whom showed approval of his dad’s new romance on a recent episode of “Watch What Happens Live with Andy Cohen.”\nAnderson, for her part, has had five marriages with four different men, including Mötley Crüe rocker Tommy Lee, who is the father of her sons Brandon Thomas Lee, 29, and Dylan Jagger Lee, 27."
    },
    {
      "url": "https://people.com/brandon-blackstock-was-diagnosed-with-cancer-after-kelly-clarkson-divorce-source-11787478",
      "text": "Brandon Blackstock Was Diagnosed with Cancer After Kelly Clarkson Divorce: Source The former music manager died on Thursday, Aug. 7 at 48 By Marina Watts Marina Watts Marina Watts is a Digital Writer, Music at PEOPLE. She has been working at PEOPLE since 2024. Her work has previously appeared on Bustle, The US Sun, Newsweek and OK! Magazine. People Editorial Guidelines and Sean Mandell Sean Mandell Sean Mandell is a Senior Reporter at PEOPLE. He joined PEOPLE in 2025. He previously worked for The New York Post, ET Canada and TMZ. People Editorial Guidelines Published on August 8, 2025 12:30PM EDT 1 Comment Brandon Blackstock; Kelly Clarkson. Credit : AP Photo/Pablo Martinez Monsivais; Chris Haston/NBC/NBCU Photo Bank via Getty NEED TO KNOW Brandon Blackstock was diagnosed with cancer following his divorce from Kelly ClarksonThe former music manager died on Thursday, Aug. 7. He was 48Clarkson and Blackstock were married from 2013 until 2020, when Clarkson filed for divorce, which was finalized two years later Brandon Blackstock learned of his cancer diagnosis following his divorce from Kelly Clarkson. A source tells PEOPLE that Blackstock, who died on Aug. 7 at age 48, that \"he was diagnosed after the divorce.\" Blackstock and Clarkson, 43, were married in 2013 and welcomed their daughter, River, now 11, and son, Remington, now 9. Seven years later, the singer-songwriter filed for divorce, citing irreconcilable differences. Their divorce was finalized two years later. A second source tells PEOPLE Blackstock moved back to Montana in 2022 following his diagnosis. A representative for Blackstock's family announced his death in a statement shared with PEOPLE. \"It is with great sadness that we share the news that Brandon Blackstock has passed away,\" the statement read. \"Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family. We thank you for your thoughts and prayers and ask everyone to respect the family's privacy during this very difficult time.\" Brandon Blackstock in Santa Monica in January 2020. Taylor Hill/Getty Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. The day before Blackstock died, Clarkson postponed the August shows of her Las Vegas residency, revealing that Blackstock had been \"ill\" and she needed to be present for her children. \"While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them,” she wrote in a statement. \"I am sincerely sorry to everyone who bought tickets to the shows and I so appreciate your grace, kindness and understanding.\" Related Stories Brandon Blackstock's 4 Children: All About Savannah, Seth, River and Remy Kelly Clarkson and Her Kids Receive Outpouring of Support After Ex Brandon Blackstock's Death A source told PEOPLE that Clarkson has \"been devastated\" for her children amid her ex-husband's private illness. “When she found out that he was sick, she remained protective of him for their sake,” the source said. “Kelly has always tried to keep things classy. It became clear earlier this year that Brandon was not doing well. She’s been devastated for the kids.\" Clarkson and Blackstock's divorce was acrimonious and involved several legal proceedings following the finalization. The American Idol winner knew how important the relationship her children, River and Remington, had with their father as, the source added. \"The divorce was incredibly difficult for her — messy, painful and something she felt terrible about,” the source said. \"But she always wanted her kids to have the best relationship possible with their dad. She never spoke poorly about Brandon to the kids.\" Kelly Clarkson. Weiss Eubanks/NBCUniversal via Getty Along with the children he shares with Clarkson, Blackstock was a father to son, Seth, and daughter, Savannah, from a previous marriage. Close Leave a Comment Read more: Lifestyle Health Celebrity Health"
    },
    {
      "url": "https://nypost.com/2025/08/06/entertainment/kelly-clarkson-cancels-vegas-residency-as-she-reveals-ex-husbands-illness/",
      "text": "Kelly Clarkson abruptly cancels Las Vegas residency shows as she reveals ex-husband’s health battle\nKelly Clarkson has postponed her Las Vegas residency again — but now, she’s giving fans answers.\nThe “Since U Been Gone” superstar, 43, has revealed that her ex-husband, Brandon Blackstock, is having health problems and she needs to care for their children.\n“Unfortunately, I need to postpone the remainder of the August Studio Session dates in Las Vegas,” Clarkson wrote on her Instagram Wednesday evening.\n“While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them,” Clarkson revealed.\nShe concluded, “I am sincerely sorry to everyone who bought tickets to the shows and I so appreciate your grace, kindness and understanding.”\nThe Post reached out to Blackstock’s rep for comment.\nClarkson and her ex, 48, have two children: River, 11, and Remy, 9.\nThe Grammy winner’s next performance at the Colosseum at Caesars Palace was set for Friday, Aug. 8.\nThis marks Clarkson’s second time canceling her “Kelly Clarkson: Studio Sessions — The Las Vegas Residency” at Caesars Palace since it started last month.\nThe day it was scheduled to kick off on Friday, July 4, the singer announced she was postponing her first two shows.\nAt the time, Clarkson blamed her vocal cords.\n“We have been working 24/7 to make Studio Sessions the most intimate and extraordinary experience with and for my incredible fans,” Clarkson wrote in a statement on Instagram. “I am beyond grateful that you always show up for me and I am devastated to have to postpone tonight and tomorrow’s opening at Caesars. The prep and rehearsals have taken a toll on my voice.”\nShe explained that she wanted “the shows to be perfect for y’all and I need to protect myself from doing serious damage so I am taking this weekend and next week to rest up so that we can deliver what you all deserve.”\nWhen Clarkson finally debuted her residency on Friday, July 11, she apologized to the crowd.\n“It took me a minute. I’m so sorry,” she said in a video posted to TikTok. “I know some of y’all had tickets for last weekend’s shows. I’m so sorry. We can’t help our bodies sometimes. You know, we get sick, and that happens.”\nWhile sources claimed Clarkson’s first residency postponement “blindsided” her crew, others told Page Six the singer-songwriter faced “hidden battles that very few people are privy to … it’s a source of emotional and therefore physical distress for her.”\nThey also revealed, “Kelly’s personal life is so insanely complicated.”\nHer disastrous residency comes on the heels of her mysterious absence from “The Kelly Clarkson Show” earlier this year.\nClarkson missed 10 episodes of the NBC talk show in March, filling her spot with guest hosts. The following month, Andy Cohen randomly stepped in to host.\nClarkson later cited personal matters as her reason for taking off both times.\nSources, however, claimed that Blackstock fell ill, which is why she was absent.\n“Her ex-husband is sick and she took the kids to see him,” a source told NewsNation at the time.\nClarkson wed the music manager (who also managed her career) in 2013. The pair were married for seven years before she filed for divorce in 2020.\nThe exes went through a contentious divorce battle, which was finalized in 2022.\nClarkson has addressed the emotional toll their legal battle took on her, telling Apple Music in 2023, “Just to be brutally honest, I did not handle [the divorce] well.”\nHer Las Vegas residency is scheduled to end on Nov. 15."
    }
  ],
  "argos_summary": "Brandon Blackstock, Kelly Clarkson's ex-husband, passed away at the age of 48 after a private battle with melanoma, a serious form of skin cancer, which he was diagnosed with following their divorce. Clarkson, who shares two children with Blackstock, had been caring for him during his illness and recently postponed her Las Vegas residency shows to focus on her family. Despite their contentious divorce, Clarkson remained committed to ensuring her children maintained a strong relationship with their father.",
  "argos_id": "7T8E0ECBL"
}