{
  "url": "https://www.benzinga.com/pressreleases/25/08/g47016003/star-equity-holdings-inc-declares-a-partial-cash-dividend-of-0-225-per-share-of-10-series-a-cumula",
  "authorsByline": "Globe Newswire",
  "articleId": "6485064e1caf4b06ad099b0aa6043396",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "http://benzinga.com/next-assets/images/schema-image-default.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T17:15:31-04:00",
  "addDate": "2025-08-08T21:25:41.029589+00:00",
  "refreshDate": "2025-08-08T21:25:41.029590+00:00",
  "score": 1.0,
  "title": "Star Equity Holdings, Inc. Declares a Partial Cash Dividend of $0.225 Per Share of 10% Series A Cumulative Perpetual Preferred Stock - Star Equity Hldgs (NASDAQ:STRR), Star Equity Hldgs (NASDAQ:STRRP)",
  "description": "OLD GREENWICH, Conn., Aug. 08, 2025 (GLOBE NEWSWIRE) -- Star Equity Holdings, Inc. (NASDAQ:STRR, STRRP)) (\"Star\" or the \"Company\"), a diversified holding company, announced today that its Board of Directors declared a",
  "content": "OLD GREENWICH, Conn., Aug. 08, 2025 (GLOBE NEWSWIRE) -- Star Equity Holdings, Inc. STRR STRRP)) (\"Star\" or the \"Company\"), a diversified holding company, announced today that its Board of Directors declared a partial cash dividend to holders of the Company's 10% Series A Cumulative Perpetual Preferred Stock (\"Star Preferred Stock\") of $0.225 per share. The record date for this dividend is August 21, 2025 and the payment date is September 10, 2025.\n\nAs previously disclosed, on May 21, 2025, Hudson Global, Inc., a Delaware corporation (\"Hudson\"), HSON Merger Sub, Inc., a Delaware corporation and a wholly owned subsidiary of Hudson (\"Merger Sub\"), and the Company, entered into an Agreement and Plan of Merger (the \"Merger Agreement\"), pursuant to which, among other matters, and subject to the satisfaction or waiver of the conditions set forth in the Merger Agreement, Merger Sub will merge with and into the Company, with the Company continuing as the surviving corporation of the merger (the \"Merger\"), and a wholly owned subsidiary of Hudson. In the Merger, Star stockholders will be entitled to receive 0.23 shares of Hudson common stock, par value $0.001 per share (\"Hudson Common Stock\"), in exchange for each share of Star common stock, par value $0.0001 per share (\"Star Common Stock\"), owned by them immediately prior to the Merger, and, one share of Hudson 10.0% Series A Cumulative Perpetual Preferred Stock, par value $0.001 per share (\"Hudson Preferred Stock\"), in exchange for each share of Star Preferred Stock, owned by them immediately prior to the Merger. Pursuant to the Merger Agreement, no fractional shares will be issued in the Merger. Instead, any holder of Star Common Stock that is otherwise entitled to receive a fractional share of Hudson Common Stock will be entitled to receive from the Exchange Agent under the Merger Agreement, in accordance with the provisions of the Merger Agreement, a cash payment in lieu of such fractional share, representing such holder's proportionate interest, if any, in the proceeds from the sale by the Exchange Agent (reduced by any fees of the Exchange Agent attributable to such sale) in one or more transactions of shares of Hudson Common Stock equal to the excess of (A) the aggregate number of shares of Hudson Common Stock to be delivered to the Exchange Agent by Hudson pursuant to the Merger Agreement over (B) the aggregate number of whole shares of Hudson Common Stock to be distributed to the holders of shares of Star Common Stock pursuant to the Merger Agreement.\n\nThe dividend will cover the period through August 21, 2025. For periods subsequent to that time, it is anticipated that either the Company will declare another dividend, or if the Merger closes and the Hudson Preferred Stock is issued, then dividends will be paid pursuant to the terms of the Hudson Preferred Stock.\n\n\n\nStar Equity Holdings, Inc. is a diversified holding company currently composed of three business divisions: Building Solutions, Energy Services, and Investments.\n\n\n\nOur Building Solutions division operates in three businesses: (i) modular building manufacturing; (ii) structural wall panel and wood foundation manufacturing, including building supply distribution operations; and (iii) glue-laminated timber (glulam) column, beam, and truss manufacturing.\n\n\n\nOur Energy Services division engages in the rental, sale, and repair of downhole tools used in the oil and gas, geothermal, mining, and water-well industries.\n\n\n\nOur Investments division manages and finances the Company's real estate assets as well as its investment positions in private and public companies.\n\nThis Current Report on Form 8-K and the exhibits filed or furnished herewith contain \"forward-looking statements\" within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995, including but not limited to, express or implied statements regarding the structure, timing and completion of the proposed Merger; the combined company's listing on Nasdaq after closing of the proposed Merger; expectations regarding the ownership structure of the combined company; the anticipated timing of Closing; the expected executive officers and directors of the combined company; the future operations of the combined company; the nature, strategy and focus of the combined company; the executive and board structure of the combined company; and other statements that are not historical fact. All statements other than statements of historical fact contained in this Current Report on Form 8-K are forward-looking statements. These forward-looking statements are made as of the date they were first issued, and were based on the then-current expectations, estimates, forecasts, and projections, as well as the beliefs and assumptions of management. There can be no assurance that future developments affecting Star, Hudson, or the proposed transaction will be those that have been anticipated.\n\nForward-looking statements are subject to a number of risks and uncertainties, many of which involve factors or circumstances that are beyond Star's control. Star's actual results could differ materially from those stated or implied in forward-looking statements due to a number of factors, including but not limited to (i) the risk that the conditions to the closing of the proposed Merger are not satisfied, including the failure to timely obtain stockholder approval for the transaction, if at all; (ii) uncertainties as to the timing of the consummation of the proposed Merger and the ability of each of Star and Hudson to consummate the proposed Merger; (iii) risks related to Star's ability to manage its operating expenses and its expenses associated with the proposed Merger pending closing; (iv) risks related to the failure or delay in obtaining required approvals from any governmental or quasi-governmental entity necessary to consummate the proposed Merger; (v) risks related to the market price of Star's common stock relative to the value suggested by the exchange ratio; (vi) unexpected costs, charges or expenses resulting from the transaction; (vii) potential adverse reactions or changes to business relationships resulting from the announcement or completion of the proposed Merger; (viii) risks related to the inability of the combined company to success operate as a combined business; and (ix) risks associated with the possible failure to realize certain anticipated benefits of the proposed Merger, including with respect to future financial and operating results, among others. Actual results and the timing of events could differ materially from those anticipated in such forward-looking statements as a result of these risks and uncertainties. These and other risks and uncertainties are more fully described in periodic filings with the SEC, including the factors described in the section titled \"Risk Factors\" in Star's Annual Report on Form 10-K for the year ended December 31, 2024 filed with the SEC, and in other filings that Star makes and will make with the SEC in connection with the proposed Merger, including the Proxy Statement/Prospectus. You should not place undue reliance on these forward-looking statements, which are made only as of the date hereof or as of the dates indicated in the forward-looking statements. Star expressly disclaims any obligation or undertaking to release publicly any updates or revisions to any forward-looking statements contained herein to reflect any change in its expectations with regard thereto or any change in events, conditions or circumstances on which any such statements are based. This Current Report on Form 8-K does not purport to summarize all of the conditions, risks and other attributes of an investment in Star or Hudson.\n\nStar, Hudson, and their respective directors and certain of their executive officers and employees may be considered participants in the solicitation of proxies from Star's stockholders with respect to the proposed merger transaction under the rules of the SEC. Information about the directors and executive officers of Hudson is set forth in its Annual Report on Form 10-K for the year ended December 31, 2024, which was filed with the SEC on March 14, 2025, and in subsequent documents filed with the SEC. Information about Star's directors and officers is available in Star's Annual Report on Form 10-K for the year ended December 31, 2024, filed with the SEC on March 21, 2025, and in subsequent documents filed with the SEC. Additional information has been made available to you regarding the persons who may be deemed participants in the proxy solicitations and their direct and indirect interests (by security holdings or otherwise) in the Merger in a registration statement on Form S-4 (the \"Registration Statement\") which was declared effective by the SEC on July 22, 2025, and the joint proxy statement/prospectus of Star and Hudson contained therein (the \"Proxy Statement/Prospectus\"), which was disseminated to stockholders beginning on or about July 23, 2025. Instructions on how to obtain free copies of this document and, the Registration Statement and Proxy Statement/Prospectus, are set forth below in the section headed \"Additional Information and Where to Find It\".\n\nThis Current Report on Form 8-K and the exhibits filed or furnished herewith relate to the proposed merger transaction involving Star and Hudson and may be deemed to be solicitation material in respect of the proposed merger transaction. This Current Report on Form 8-K is not a substitute for the Registration Statement, the Proxy Statement/Prospectus or for any other document that Star or Hudson may file with the SEC and or send to its stockholders in connection with the proposed merger transaction. BEFORE MAKING ANY VOTING DECISION, INVESTORS AND SECURITY HOLDERS OF STAR ARE URGED TO READ THE REGISTRATION STATEMENT, THE PROXY STATEMENT/PROSPECTUS AND OTHER DOCUMENTS FILED WITH THE SEC CAREFULLY AND IN THEIR ENTIRETY WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT STAR, THE PROPOSED MERGER TRANSACTION AND RELATED MATTERS.\n\nThis Current Report on Form 8-K does not constitute an offer to sell or the solicitation of an offer to buy any securities nor a solicitation of any vote or approval with respect to the proposed transaction or otherwise. No offering of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the U S. Securities Act of 1933, as amended, and otherwise in accordance with applicable law.\n\nAdditional Information and Where to Find It\n\nInvestors and security holders will be able to obtain free copies of the Registration Statement, the Proxy Statement/Prospectus and other documents filed by Star or Hudson with the SEC through the website maintained by the SEC at http://www.sec.gov. Copies of the documents filed by Star with the SEC will also be available free of charge on Star's website at https://www.starequity.com/. You may obtain free copies of this document as described above.",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/NewsRoom/AttachmentNg/3599cc5f-a13a-444e-a506-7126733e4a9a"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Star Common Stock",
      "weight": 0.08548427
    },
    {
      "name": "Star Preferred Stock",
      "weight": 0.08301068
    },
    {
      "name": "Hudson Common Stock",
      "weight": 0.08120739
    },
    {
      "name": "Hudson Preferred Stock",
      "weight": 0.07859932
    },
    {
      "name": "Star stockholders",
      "weight": 0.07822548
    },
    {
      "name": "Star",
      "weight": 0.07555003
    },
    {
      "name": "Star common stock",
      "weight": 0.074504524
    },
    {
      "name": "Star Equity Holdings",
      "weight": 0.07418793
    },
    {
      "name": "Star Equity Hldgs",
      "weight": 0.072840564
    },
    {
      "name": "Hudson common stock",
      "weight": 0.06955577
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Stocks"
    },
    {
      "name": "Startups"
    },
    {
      "name": "Series A"
    },
    {
      "name": "Venture Capital"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9892578125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.98291015625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.98193359375
    }
  ],
  "sentiment": {
    "positive": 0.13391113,
    "negative": 0.07989502,
    "neutral": 0.7866211
  },
  "summary": "Star Equity Holdings, Inc., a diversified holding company, has announced a partial cash dividend to holders of its 10% Series A Cumulative Perpetual Preferred Stock (Star Preferred Stock), of $0.225 per share. The record date for this dividend is August 21, 2025 and the payment date is September 10, 2025. The company's merger with Hudson Global, Inc. (Hudson), HSON Merger Sub, and the Company, entered into an Agreement and Plan of Merger (the Merger Agreement), which will merge with and into the Company. No fractional shares will be issued in the merger. Instead, any holder of Star Common Stock that is otherwise entitled to receive a fractional share of Hudson Common Stock will receive a cash payment in lieu of such fractional Share, representing their proportionate interest in the proceeds from the sale by the Exchange Agent.",
  "shortSummary": "Star Equity Holdings, Inc. Declares a partial cash dividend of $0.225 per share to holders of 10% Series A Cumulative Perpetual Stock, pending the completion of the Hudson merger.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "adfd8d0a92954a6f9dc9de69c6489ecf",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Star Equity Holdings, Inc. announced a partial cash dividend of $0.225 per share for its 10% Series A Cumulative Perpetual Preferred Stock, with a record date of August 21, 2025, and a payment date of September 10, 2025. The company is also in the process of merging with Hudson Global, Inc., where Star stockholders will receive shares of Hudson common stock and preferred stock in exchange for their shares. The merger is subject to various conditions and may affect future dividend declarations.",
  "argos_id": "7T9TXP0XC"
}