{
  "url": "https://www.yahoo.com/news/articles/jewish-leader-slams-germanys-suspension-144446026.html",
  "authorsByline": "DPA",
  "articleId": "28b067268a4746eb80e9c1ee56825209",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/dpa_international_526/ac45d734228e2562e54daca212f819e5",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T14:44:46+00:00",
  "addDate": "2025-08-08T15:26:37.481287+00:00",
  "refreshDate": "2025-08-08T15:26:37.481288+00:00",
  "score": 1.0,
  "title": "Jewish leader slams Germany's suspension of arms exports to Israel",
  "description": "Germany's Central Council of Jews has sharply criticized the government's decision to suspend exports of military equipment to Israel that could be used in the Gaza Strip, announced by Chancellor Friedrich Merz on Friday. \"This change of course runs counter to all the expressions of solidarity and promises made by the chancellor since he took office,\" said the council's president, Josef Schuster.",
  "content": "Germany's Central Council of Jews has sharply criticized the government's decision to suspend exports of military equipment to Israel that could be used in the Gaza Strip, announced by Chancellor Friedrich Merz on Friday.\n\n\"This change of course runs counter to all the expressions of solidarity and promises made by the chancellor since he took office,\" said the council's president, Josef Schuster.\n\nIsrael is attacked daily by enemies and bombarded with missiles, Schuster said.\n\n\"Depriving Israel of the ability to defend itself against such threats endangers its existence,\" he added.\n\nGermany should instead increase pressure on the Palestinian Islamist group Hamas, Schuster said. \"The federal government should correct its course as quickly as possible.\"\n\nMerz announced on Friday that the German government will not authorize any exports of military equipment that could be used in the Gaza Strip until further notice.\n\nThe move, a major step for one of Israel's strongest supporters, came in response to the Israeli government's decision to expand operations in the Gaza Strip with the aim of seizing Gaza City.\n\nMerz raised concerns about the impact of the planned offensive on the civilian population in Gaza and said the campaign will make it increasingly difficult for Israel to achieve its goals in the war.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Israel",
      "weight": 0.102210514
    },
    {
      "name": "Gaza City",
      "weight": 0.09102525
    },
    {
      "name": "Gaza",
      "weight": 0.08875277
    },
    {
      "name": "military equipment",
      "weight": 0.08327933
    },
    {
      "name": "arms exports",
      "weight": 0.08134042
    },
    {
      "name": "Chancellor Friedrich Merz",
      "weight": 0.08039611
    },
    {
      "name": "Friedrich Merz",
      "weight": 0.075239465
    },
    {
      "name": "Josef Schuster",
      "weight": 0.07418002
    },
    {
      "name": "such threats",
      "weight": 0.07299989
    },
    {
      "name": "exports",
      "weight": 0.072873265
    }
  ],
  "topics": [
    {
      "name": "Jewish"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.98828125
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.984375
    },
    {
      "name": "/News/World News",
      "score": 0.91162109375
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.85693359375
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.7568359375
    },
    {
      "name": "/News/Other",
      "score": 0.472412109375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.43310546875
    },
    {
      "name": "/People & Society/Other",
      "score": 0.379150390625
    }
  ],
  "sentiment": {
    "positive": 0.038391113,
    "negative": 0.7890625,
    "neutral": 0.17272949
  },
  "summary": "Germany's Central Council of Jews has criticised the German government's decision to suspend exports of military equipment to Israel that could be used in the Gaza Strip. The move was announced by Chancellor Friedrich Merz, who raised concerns about the impact of the planned offensive on the civilian population in Gaza. The council's president, Josef Schuster, suggested that Germany should increase pressure on Hamas, stating that Israel is regularly attacked by enemies and bombarded with missiles. The German government will not authorize military equipment exports until further notice. This move is seen as a major step for one of Israel's strongest supporters.",
  "shortSummary": "Germany's Central Council of Jews criticized Chancellor Friedrich Merz's suspension of military equipment exports to Israel, citing security concerns and urging action.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9e64f027a4004e718fd53046a3f9f6d8",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Germany's Central Council of Jews has condemned the government's decision to halt military equipment exports to Israel, stating it undermines previous expressions of solidarity from Chancellor Friedrich Merz. Council president Josef Schuster emphasized that this move endangers Israel's ability to defend itself against ongoing threats and called for increased pressure on Hamas instead. Merz's announcement was made in light of Israel's plans to expand military operations in Gaza, raising concerns about the impact on civilians.",
  "argos_id": "7XFDHIUPB"
}