{
  "url": "https://financialpost.com/pmn/business-pmn/irish-whiskey-makers-crumble-under-trumps-trade-tariffs",
  "authorsByline": "Bloomberg News",
  "articleId": "d8e136b36be04e339f42daf10b2eeabe",
  "source": {
    "domain": "financialpost.com",
    "paywall": true,
    "location": {
      "country": "ca",
      "city": "Toronto",
      "coordinates": {
        "lat": 43.6534817,
        "lon": -79.3839347
      }
    }
  },
  "imageUrl": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/08/irish-whiskey-downturn-as-us-tariffs-take-toll.jpg",
  "country": "ca",
  "language": "en",
  "pubDate": "2025-08-08T09:35:58+00:00",
  "addDate": "2025-08-08T09:45:53.603666+00:00",
  "refreshDate": "2025-08-08T09:45:53.603667+00:00",
  "score": 1.0,
  "title": "Irish Whiskey Makers Crumble Under Trump's Trade Tariffs",
  "description": "When the Killarney Brewing & Distilling Co. expanded in 2022, it boasted of being Ireland’s largest independently owned beer and whiskey producer, replete with visi…",
  "content": "Independent distillers have been particularly impacted by the downturn. A ten minute stroll from Roe & Co., the Dublin Liberties Distillery has been closed since May, a temporary measure the owners said, according to local media reports. About 100 miles to the south, the Waterford Whisky distillery and visitor center on the city’s quays also lies empty. The gates, topped by two whiskey barrels, are locked, after the operation closed last year. The distillery was put on the market in December, but the process was paused when the US announced its first round of tariffs, said Mark Degnan, a managing director at Interpath in Dublin. Now, two potential buyers are left, with Interpath hoping to conclude the sale by the end of the year. The spate of closures is a far cry from the recent boom experienced by the industry. Between 2010 and 2024, the number of distilleries in Ireland mushroomed to over 50 from just four in 2010, according to IWA. Demand surged, sparked by the renewed fashionability of spirits. The boom was given added impetus by the Covid-19 pandemic, which spurred more drinking at home. By 2022, exports of Irish whiskey to the US had risen to 48,000 tonnes, more than double the levels a decade earlier. “It was a phenomenal boom,” said Marie Byrne, who founded the Dublin Whiskey Company, which was sold and rebranded as the currently closed Dublin Liberties Distillery. “People had forgotten that this is a very cyclical industry,” said Byrne, who now lectures in distilling at Technological University Dublin. By the end of 2023, warning signs were emerging, with demand in the US starting to ebb. In 2024, exports to the US by volume were down a third from 2022 levels. The roots of the industry’s problems lay partly in the pandemic that had helped spurred its growth, according to Bloomberg Intelligence analyst Duncan Fox. “All spirits had the same problem in the US, wholesalers over ordered as they assumed the volume growth post pandemic would remain in place,” Fox said. “But when interest rates went up, the holding costs of that booze became very costly, just at the same time as free government money ran out. Orders fell because wholesalers couldn’t afford new stock.” At the same time, the costs of making whiskey have increased. Business electricity prices have essentially doubled in Ireland over the last four years, for example, even as producers pay out more for expenses like glass bottles, labeling and marketing. Fox estimates the Trump tariffs mean whiskey prices may have to rise by as much as 6%, though firms may well try to offset tariffs by cutting costs to avoid further damaging demand in the US. “When it comes to Irish whiskey, US is pretty much the only lens, bar Ireland,” said Fox.",
  "medium": "Article",
  "links": [
    "https://www.linkedin.com/sharing/share-offsite/?url=https%3A//financialpost.com/pmn/business-pmn/irish-whiskey-makers-crumble-under-trumps-trade-tariffs",
    "https://financialpost.com/transportation/airlines/air-canada-offers-32-per-cent-increase-flight-attendants?itm_source=trending",
    "https://financialpost.com/category/transportation/airlines/",
    "https://www.reddit.com/submit?kind=link&url=https%3A//financialpost.com/pmn/business-pmn/irish-whiskey-makers-crumble-under-trumps-trade-tariffs&title=Irish%20Whiskey%20Makers%20Crumble%20Under%20Trump%27s%20Trade%20Tariffs",
    "https://financialpost.com/category/fp-finance/banking/",
    "https://financialpost.com/personal-finance/taxes/cra-holt-renfrew-saleswoman-battle-wardrobe-deduction?itm_source=trending",
    "https://financialpost.com/category/commodities/energy/oil-gas/",
    "https://financialpost.com/commodities/energy/oil-gas/trans-mountain-pipeline-revenue-oilpatch-windfall-governments?itm_source=trending",
    "https://financialpost.com/pmn/business-pmn/irish-whiskey-makers-crumble-under-trumps-trade-tariffs",
    "https://www.tumblr.com/widgets/share/tool?canonicalUrl=https://financialpost.com/pmn/business-pmn/irish-whiskey-makers-crumble-under-trumps-trade-tariffs&title=Irish%20Whiskey%20Makers%20Crumble%20Under%20Trump%27s%20Trade%20Tariffs",
    "https://financialpost.com/subscribe",
    "https://twitter.com/intent/tweet?url=https%3A//financialpost.com/pmn/business-pmn/irish-whiskey-makers-crumble-under-trumps-trade-tariffs&text=Irish%20Whiskey%20Makers%20Crumble%20Under%20Trump%27s%20Trade%20Tariffs&via=",
    "https://www.reddit.com/submit?kind=link&url=https%3A//financialpost.com/pmn/business-pmn/irish-whiskey-makers-crumble-under-trumps-trade-tariffs&title=",
    "https://financialpost.com/category/personal-finance/taxes/",
    "https://financialpost.com/video-centre/",
    "https://financialpost.com/transportation/canada-eyes-arctic-ocean-port-to-ship-gas-commodities-to-europe?itm_source=trending",
    "https://financialpost.com/category/transportation/",
    "https://financialpost.com/fp-finance/banking/imf-risks-canada-financial-system-bank-resilience?itm_source=trending",
    "https://www.linkedin.com/sharing/share-offsite/?url=https://financialpost.com/pmn/business-pmn/irish-whiskey-makers-crumble-under-trumps-trade-tariffs",
    "https://pinterest.com/pin/create/button/?url=https://financialpost.com/pmn/business-pmn/irish-whiskey-makers-crumble-under-trumps-trade-tariffs&media=https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/08/irish-whiskey-downturn-as-us-tariffs-take-toll.jpg"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US",
      "weight": 0.07827309
    },
    {
      "name": "whiskey prices",
      "weight": 0.07723041
    },
    {
      "name": "Irish whiskey",
      "weight": 0.076695606
    },
    {
      "name": "Irish Whiskey Makers",
      "weight": 0.075532086
    },
    {
      "name": "Dublin Liberties Distillery",
      "weight": 0.072445124
    },
    {
      "name": "whiskey",
      "weight": 0.06870832
    },
    {
      "name": "Technological University Dublin",
      "weight": 0.06551727
    },
    {
      "name": "Dublin",
      "weight": 0.06165769
    },
    {
      "name": "Bloomberg Intelligence analyst Duncan Fox",
      "weight": 0.060196035
    },
    {
      "name": "last year",
      "weight": 0.059964977
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.748046875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.5947265625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.52294921875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.396240234375
    },
    {
      "name": "/Food & Drink/Beverages/Alcoholic Beverages",
      "score": 0.354248046875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.342041015625
    }
  ],
  "sentiment": {
    "positive": 0.033203125,
    "negative": 0.8413086,
    "neutral": 0.12512207
  },
  "summary": "Independent distillers have been particularly impacted by the downturn, with the Dublin Liberties Distillery and Waterford Whisky distillery both closing since May. The process of selling these distilleries was halted when the US announced its first round of tariffs. The industry experienced a boom in Ireland between 2010 and 2024, with over 50 Distilleries operating from four in 2010 to over 50. The boom was fueled by the Covid-19 pandemic, which spurred increased drinking at home. However, by 2022, exports of Irish whiskey to the US had risen to 48,000 tonnes, more than double the levels a decade earlier. The costs of making whiskey have increased, with business electricity prices doubling in Ireland over the past four years. The Trump tariffs mean whiskey prices may need to rise by up to 6%, but firms may try to offset tariffs by cutting costs to avoid further damaging demand in the US.",
  "shortSummary": "Irish whiskey distillers face significant closures and price rises due to the Trump trade tariffs, particularly in the US, amid declining US demand and rising electricity costs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "00bf88d6657149d7aec322d7b959f777",
  "places": [
    {
      "osmId": "228705574",
      "road": "Mill Street",
      "city": "Dublin",
      "county": "County Dublin",
      "postcode": "D08 V221",
      "country": "Ireland",
      "countryCode": "ie",
      "coordinates": {
        "lat": 53.337395900000004,
        "lon": -6.27632005348537
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://financialpost.com/fp-finance/banking/imf-risks-canada-financial-system-bank-resilience?itm_source=trending",
      "text": "IMF warns of rising risks in Canada's financial system despite bank resilience\nRising household debt, mortgage renewals and gaps in oversight could expose vulnerabilities in the years ahead, report says\nCanada’s financial system remains broadly resilient despite mounting economic uncertainty, the International Monetary Fund (IMF) said in its latest assessment — but warned that rising household debt, mortgage renewals and gaps in cyber and pension oversight could expose vulnerabilities in the years ahead.\nIn its 2025 Financial System Stability Assessment (FSSA), the IMF said Canada’s big banks, insurers and pension funds are well-capitalized and capable of withstanding major economic shocks.\nHowever, the report flagged growing risks tied to a wave of upcoming mortgage renewals, high household debt levels and a lack of coordination among financial regulators — including the Office of the Superintendent of Financial Institutions (OSFI), the Bank of Canada and provincial authorities — in responding to systemic threats such as cyberattacks, housing market shocks and climate-related disruptions.\nFor the banking and financial sector, the report said “total assets of financial institutions reached 756 per cent of GDP in 2024, increasing by 43.3 per cent since 2019.” Non-bank financial institutions (NBFIs) have become a dominant force in the sector, now accounting for 65 per cent of total assets.\nSince the last IMF review in 2019, the NBFI sector has expanded significantly, with investment fund assets growing from $2.6 trillion in 2020 to $3 trillion in 2023 — roughly 110 per cent of GDP. Canada’s insurance market ranked ninth globally in terms of written premiums, according to the report.\nPension funds continue to play an outsized role, holding $2.2 trillion in assets in 2023, or about 75 per cent of GDP — one of the largest pension sectors in the G7.\nThe IMF notes that while NBFIs remained resilient, data gaps and inconsistent oversight remain concerns, particularly for large pension plans. The sector has grown in size and importance since the 2019 assessment but regulatory coordination has not kept pace.\n- Cuts to Canada's growth 'stand out' in latest IMF economic outlook\n- Canada set to be fastest growing economy in G7 in 2025, IMF forecasts\n- Advertisement embed-more-topicStory continues below\nThe report said the banking sector’s Common Equity Tier 1 (CET1) ratio is 13 per cent. The CET1 ratio measures a bank’s core capital relative to its risk-weighted assets, indicating its ability to absorb losses. A higher ratio signals strong financial health and compliance with global regulatory standards.\nA 13 per cent CET1 ratio indicates that Canadian banks are well-capitalized — significantly above the international regulatory minimum of 4.5 per cent, and even above the commonly recommended levels of around 10–11 per cent. This gives them a strong buffer to absorb losses in times of economic stress.\nThe report raised concerns about the real estate market in Canada. “As of December 2024, approximately 60 per cent of mortgages will renew by 2026 at likely higher rates, which could increase payment burdens and delinquencies if economic conditions deteriorate,” it said.\nCanada has the highest household debt-to-GDP ratio among G7 countries, a key vulnerability flagged by the IMF. While it reflects strong credit access and homeownership, it also leaves households — and the broader economy — more exposed to rising interest rates, job losses or housing market downturns.\nOn the positive side, the report noted Canada’s mortgage delinquency rate stood at just 0.2 per cent in December 2024 — well below historical norms — suggesting most homeowners still managed to keep up with their payments despite rising rates in the last cycle.\nUnder the IMF’s 2025 adverse scenario, mortgage default rates are projected to rise to 0.9 per cent for uninsured loans and 1.4 per cent for insured loans, while corporate defaults could climb from 0.5 per cent to 1.3 per cent by 2027 — posing sharper risks than anticipated in 2019.\nThe report also warned that broader geoeconomic tensions — global conflict, shifting trade policies, reduced labour mobility and weak financial systems — posed a high risk to Canada’s economic outlook.\nOther emerging threats include cyber-attacks, climate change and a potential housing market correction. The IMF flags cyber risks as high, noting they could disrupt payment systems and undermine financial institutions’ ability to function.\nClimate-related disasters, such as wildfires and floods, carry medium-level risk, potentially triggering credit and liquidity stress. A sharp decline in home prices could drive up loan-to-value ratios, raise unemployment and curb household spending and investor confidence.\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
    },
    {
      "url": "https://financialpost.com/transportation/canada-eyes-arctic-ocean-port-to-ship-gas-commodities-to-europe?itm_source=trending",
      "text": "Canada eyes Arctic Ocean port to ship gas, commodities to Europe\nEnergy Minister sees 'tremendous potential' for turning the port of Churchill, Man., into a much larger export hub\nThe Canadian government is looking hard at developing a remote northern port on Hudson Bay as a conduit for exporting natural gas, potash, canola and other commodities as the country tries to reduce its economic dependence on the United States.\nEnergy Minister Tim Hodgson said he sees “tremendous potential” for turning the port of Churchill, Man., into a much larger export hub, opening new trade routes to Europe and other markets. The minister said he has seen multiple pitches for projects to move goods through the location, which is at almost the same latitude as Oslo, Norway.\n“I believe there is an opportunity to make Churchill a far more strategic port,” Hodgson said in an interview with Bloomberg News. “If you look at what the Russians are doing, they ship for most of the year from their Arctic ports.”\nThe idea of a northern port enjoys the enthusiastic backing of politicians from Canada’s resource-rich western region, including Alberta Premier Danielle Smith and Saskatchewan Premier Scott Moe, whose provinces are major exporters of oil, gas and agricultural commodities.\nSome observers are skeptical about Churchill as a viable shipping route. Turning it into a port capable of handling a wide variety of bulk goods would take years and cost billions of dollars, for a route that’s locked by ice much of the year.\nBut Hodgson is bullish on it. The government is in the midst of procuring a new fleet of icebreakers for the Canadian Coast Guard. With those ships, “you’re not talking about a four-month shipping season,” he said. “You could have a lane open for probably most of the year.”\nI believe there is an opportunity to make Churchill a far more strategic port\nTim Hodgson\nChurchill’s port was first used as an outlet for grain exports in the early 1930s, and is the continent’s only deepwater port with direct access to both the Arctic Ocean and a rail line connecting south. The port has always been constrained by winter ice, and grain shipments through it plummeted when the Canadian Wheat Board lost its sales monopoly in 2012.\nFor products from western Canada, Hudson Bay is the closest route to Europe, Hodgson said. “It provides an alternative for all of the potash, canola, grain. If you have roads and you have more port facilities and more usage, more investment in the rail, all of a sudden Churchill starts to become pretty viable.”\n- Canada’s Arctic: 3 surprising ways to cash in on the North\n- Defending the Arctic is good policy, good politics and good business\n- Advertisement embed-more-topicStory continues below\nPrime Minister Mark Carney’s government is preparing to accelerate approval of major infrastructure projects, largely as a response to the trade war started by U.S. President Donald Trump. About three-quarters of Canada’s goods exports went to the U.S. last year, and one of Carney’s top priorities is to bring that percentage down.\nThe government passed legislation in June to designate specific projects as being in the national interest, with the goal of approving them within two years. The projects will be prioritized based on criteria including whether they boost Canada’s economic security and advance the interests of Indigenous communities.\nIt’s the job of Hodgson, a former banker who worked with Carney at Goldman Sachs Group Inc. and the Bank of Canada, to help turn those proposals into real deals.\n“I have seen one where there’s a proponent on natural gas that would build an all-weather road beside the pipeline,” Hodgson said. He emphasized the effect this could have on the Indigenous communities in northern Manitoba, many of which are accessible only by plane.\n“If you have an all-weather road up from southern Manitoba to Churchill, you fundamentally change the economics of all the critical minerals throughout,” he said. “You also fundamentally change the cost of living of every community right along the line.”\nHe pointed to the support of Manitoba Premier Wab Kinew, who is himself Indigenous, as especially crucial for getting projects built to Churchill.\n“I have seen a level of co-ordination between the provincial government in Manitoba, the First Nations and Metis peoples in Manitoba and certain proponents that looks very promising. Probably more so than any other,” he said.\nSome are highly doubtful the economics will ever make sense for Churchill.\n“Are we forgetting that we’ve been trying this for a hundred years?” said Heather Exner-Pirot, a senior fellow at the Macdonald-Laurier Institute who specializes in northern and Indigenous resource development.\nShe said proposals for Churchill are almost always generated from governments or First Nations groups, and she’s skeptical there are private sector shippers serious about using the port. Insurers are unlikely to sign off on an extended shipping season any time soon, and year-round ice-breaking would probably run into trouble with Inuit land titles and environmental considerations, she said.\n“I just can’t believe that it’s easier to do it through the Arctic in the winter than to go over land,” Exner-Pirot said, arguing the return on investment would be much higher going to the west coast or using existing east coast ports.\nStill, there are new considerations at play as Carney’s government searches for fresh trade routes.\nHeather Exner-Pirot, Macdonald-Laurier Institute\nChurchill has seen a modest revival in the past decade. In 2018, the port and the connecting rail line were purchased by Arctic Gateway Group, which is owned by a partnership of 41 Indigenous groups and communities in the region. The rail line now has four weekly trips — two freight trains and two passenger trains — and the port has expanded its storage facilities for critical minerals.\nWith Trump’s tariff agenda, “what we offer becomes so much more important to help us with our national agenda, which is to diversify our trade away from the U.S. and help us become a global energy superpower,” said Chris Avery, chief executive officer of the Arctic Gateway Group.\nAvery said the port aims to ship 20,000 tons of zinc concentrate this year, and he expects some grain shipments before the ice returns. Ships taking supplies to the far north also use the facility.\nAvery said he hasn’t yet met with Hodgson, but agrees that year-round shipping from the port is feasible with icebreakers. The current shipping season is about four months, but he’s working with University of Manitoba researchers to try to convince insurers that it’s closer to six months now.\nAsked whether oil exports could ever be an option through the port, Avery said he’ll always listen to proposals from the private sector, but added that “nothing has come forward specifically around that.”\nThere are other proposals for shipping through Hudson Bay, including one group pitching a liquefied natural gas export facility further south on the coast. Avery said he could only speak to the opportunity represented by the existing assets in Churchill.\n“The rail line is in better condition than it has been for the past 30 years,” he said, noting the company is also modernizing the basic port facilities, such as the wharf decks.\n“This whole set of infrastructure is ready to serve the country,” he said. “We just really fully need to leverage it.”\n—With assistance from Mathieu Dion.\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
    },
    {
      "url": "https://financialpost.com/commodities/energy/oil-gas/trans-mountain-pipeline-revenue-oilpatch-windfall-governments?itm_source=trending",
      "text": "Trans Mountain pipeline delivers $12.6 billion in new revenue to oilpatch, windfall to governments: report\nBut any new export pipeline may not bring the same kinds of financial benefits\nThe Trans Mountain pipeline — finished years behind schedule and massively over-budget — has delivered an estimated $12.6 billion in new revenues to the Canadian oilpatch and padded government budgets, according to a new report.\nStill, the report by the financial group Alberta Central says any new export pipeline that might be built under Prime Minister Mark Carney‘s nation-building infrastructure agenda would not likely bring in a similar windfall.\nThe expanded Trans Mountain pipe that stretches from Alberta to the British Columbia coast, which came into service in May 2024, has significantly boosted market access for Canadian oil and raised prices for the country’s producers, the report suggests.\n“Whether these benefits justify the $34 billion in cost is likely to remain a source of debate for many years to come, (but) our analysis suggests that the benefits from TMX will outweigh the costs in the long run,” Charles St-Arnaud, Alberta Central’s chief economist, said in the report.\nThe federal government under Justin Trudeau bought the Trans Mountain pipeline for $4.5 billion in 2018, but the price tag for the expansion later ballooned to $34 billion. And while it was the first new pipeline to the west coast in 70 years, it was finished six years behind schedule.\nStill, economists like St-Arnaud and the University of Calgary’s Trevor Tombe have argued it was worth every penny.\nTrans Mountain has increased Canadian oil shipments to refineries in the United States and more than tripled the share of exports to countries abroad, including China. This expanded market access has allowed Canadian oil producers to fetch higher prices.\nThe country’s heavy oil trades at a discount partly because the costs of refining it are higher. In recent years, the discount against North American prices expanded even more because there weren’t enough pipelines, leading to an oversupply.\n- Ottawa may not want to get out of the pipeline business just yet: Trans Mountain CEO\n- 'Northern Leg' to Trans Mountain pipeline attracts interest amid brewing trade war\n- Advertisement embed-more-topicStory continues below\nThe Trans Mountain expansion, which nearly tripled the pipeline’s capacity, has helped to ease that pressure and shave the discount to levels that are well below historical norms. As a result, the Alberta Central report suggests the pipeline boosted overall oilpatch revenues by $12.6 billion, an estimate that does not account for increased production made possible by the expansion.\nThe lift in prices is also expected to boost tax and royalty windfalls for the federal and provincial governments. Alberta could bring in $5.4 billion in additional funds, which would account for almost seven per cent of the province’s revenues for the 2024-25 fiscal year, according to the report.\nWhile the Trudeau government approved the pipeline project, the Liberals had also ushered in a spate of new policies that expanded environmental regulations and were widely seen in Alberta and Saskatchewan as hostile to the energy sector.\nThe Carney government is promising a change in tone with an agenda that favours oil and gas development. The prime minister has said a new oil export pipeline is “highly likely” to make a list of so-called nation-building projects that would receive much faster approvals from the federal government.\nStill, any new pipe may not bring the same kinds of financial benefits as Trans Mountain. A theoretical project — no private-sector proponent has come forward with a proposal — would not likely lead to even higher prices, according to the Alberta Central report. Instead, it would prevent Canadian prices from falling as companies produce more oil.\nAlready, there are signs that the country’s pipeline capacity may not be keeping pace with a rise in crude production. The energy analytics firm RBN Energy said in a recent note that the oilpatch could face bottlenecks within the next three years.\n“Things only get harder from here, because we don’t have additional pipeline capacity coming on now, and the pipeline capacity that we do have, we’re only going to keep filling it,” said Rory Johnston, publisher of oil market research report Commodity Context.\n“We’re going to run into pricing pressure earlier than you’d think.”\n• Email: rsouthwick@postmedia.com\nWith files from Meghan Potkins\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
    },
    {
      "url": "https://financialpost.com/transportation/airlines/air-canada-offers-32-per-cent-increase-flight-attendants?itm_source=trending",
      "text": "Air Canada offers 32.5% increase for flight attendants in contract talks\nSource says airline also agreed to pay workers for some of the time they spend on the ground\nAir Canada offered its flight attendants an overall increase of more than 30 per cent over four years ahead of a potential strike, according to a person familiar with the negotiations.\nThe union representing the airline’s more than 10,000 flight attendants announced Tuesday that its members voted 99.7 per cent to strike, putting them in a legal position to walk off the job as soon as Aug. 16. Airlines usually begin winding down operations and canceling flights days before a potential labour disruption.\nAir Canada proposed to increase total compensation, including benefits and bonuses, by about 20 per cent in the first year of a contract and a total of 32.5 per cent over four years, said the person, speaking on condition they not be identified in order to speak about private talks.\nThe airline also agreed to pay workers for some of the time they spend on the ground — a request made by the union. Currently, Air Canada flight attendants are only paid when the aircraft is in motion, a common practice in the industry, but one which is increasingly being challenged.\n“The company has never presented this offer to the union,” Nathalie Garceau, a spokesperson for the Canadian Union of Public Employees, said by email. “If this indeed what the company plans to present when we resume negotiations on Friday, we look forward to discussing it then.”\nLast month, United Airlines Holdings Inc.’s flight attendants rejected a contract providing cumulative pay increases of as much as 45.6 per cent over five years — the agents would have been paid while passengers were boarding. Delta Air Lines Inc. became the first U.S. airline to pay them during this period.\nAir Canada and the union failed to reach an agreement during a two-month conciliation process that ended in July. The latest 10-year contract expired at the end of March.\n- Air Canada flight attendants vote in favour of strike mandate\n- Air Canada shares plunge as decline in travel to U.S. hits bottom line\n- Advertisement embed-more-topicStory continues below\nIn a document posted on its website, Air Canada says that half of its mainline flight attendants earned more than $54,000 in 2024, excluding incentive rewards, pensions, and health benefits. Workers at Air Canada Rouge, the company’s budget brand, earn less.\nThe union’s president, Wesley Lesosky, said in a statement Tuesday that Air Canada is “exploiting their own employees by severely underpaying flight attendants or refusing to pay them at all for safety-critical aspects of our jobs.”\nA spokesperson for the airline said: “Out of respect for the negotiation process, we do not comment on what each party may or may not have offered at the negotiation table.”\nLast year, Air Canada’s pilots got a compensation increase of 42 per cent over four years in a last-minute deal, averting a strike that would have grounded more than 1,000 daily flights worldwide. That agreement was reached after a wave of substantial pay increases for pilots across North America.\nThe airline paid $4.9 billion in wages, salaries and benefits last year, representing about 23 per cent of operating costs. It posted an operating income of $1.26 billion, or about 5.7 per cent of revenue.\n— With assistance from Mary Schlangenstein.\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
    }
  ],
  "argos_summary": "Independent distillers in Ireland are facing significant challenges, with closures like the Dublin Liberties Distillery and Waterford Whisky distillery highlighting a downturn in the industry following a boom from 2010 to 2022. Factors contributing to this decline include rising production costs, the impact of tariffs, and a decrease in demand in the U.S. market. Meanwhile, the IMF has warned of vulnerabilities in Canada's financial system, citing high household debt and upcoming mortgage renewals as potential risks, despite the resilience of major financial institutions.",
  "argos_id": "7Z3Z59NZH"
}