{
  "url": "https://lifehacker.com/tech/theres-a-better-way-to-watch-youtube-on-iphone-without-ads",
  "authorsByline": "Khamosh Pathak",
  "articleId": "088c02e8dc504c8a8340e617a80a4cb8",
  "source": {
    "domain": "lifehacker.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://lifehacker.com/imagery/articles/01K24WEAAJ3389FKW7ASZNEYVD/hero-image.fill.size_1200x675.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T14:30:00+00:00",
  "addDate": "2025-08-08T14:47:58.220845+00:00",
  "refreshDate": "2025-08-08T14:47:58.220846+00:00",
  "score": 1.0,
  "title": "There's a Better Way to Watch YouTube on iPhone (Without Ads, the Algorithm, or Shorts)",
  "description": "You can build your own YouTube queue and watch your videos in peace, with no ads, no algorithm, and no distractions.",
  "content": "YouTube is a bit of a mess right now. It’s nowhere near as bad as Instagram or TikTok on this front, but it’s still easy to lose hours scrolling through YouTube videos and Shorts on your recommendation feed. The algorithm will get you at some point, no matter how hard you try. But there’s an alternative. A saner way to watch YouTube videos that you actually really do want to watch, without getting sucked into the YouTube black hole of recommended content. Plus, it comes without ads.\n\nThe answer you've been looking for is a third-party Watch Later app like . Play isn’t a fully-featured YouTube client (Google made sure to nerf all of those), but that’s actually a good thing. You use the app to find and sort videos you actually want to watch, without getting bothered by the algorithm. What’s even better is that the videos play without ads or any other distractions. No comments, no feed, and yes, there’s an option to disable Shorts as well.\n\nGather all your YouTube videos using the Play app\n\nThe Play app can help you build your own watch later playlist that’s separate from YouTube itself. There’s no YouTube login here. You are free to save videos with multiple tags or folders. The point is to build a queue of interesting YouTube videos that you can watch at your leisure, and with intention.\n\nThe Play app is supported on Mac, iPhone, and iPad. And there’s an Apple TV app for viewing all your saved videos as well. The Play app comes with a built-in extension so you can add any YouTube video to the app easily. You can also just paste in a video’s link to add the video to the Play app.\n\nWhen adding a video to Play, you can also tag it so all your Taskmaster binge sessions stay organized (as they should).\n\nSaved videos will show up in the New folder. Tap on a video to open the detailed view, where you can see the description, transcription, and all other details. There’s an option to start video playback, too, so you don't need to rely on the YouTube app to watch your saved content (there’s also an option to directly start playing in Picture-in-Picture, another feature that’s exclusive to YouTube Premium).\n\nAnd yes, you can make videos full-screen as well. Because the app is using YouTube’s embedded player, there are also no ads to speak of. That said, YouTube has been that don’t show YouTube ads, so this that could change at any time. But I’ve been using the Play app for more than six months now without running into a single ad.\n\nAnd there it is. A simpler, calmer YouTube experience, devoid of ads, Shorts, and the algorithmic feed.\n\nThe base Play app is just $3, and can be a great way to find YouTube videos online, and then to save them to watch later (perhaps on the Apple TV). But the Play Premium subscription ($20/year) goes a step further, letting you subscribe to your favorite channels right in the app.\n\nThere’s a dedicated Channels Inbox where you can go through all the new videos from your subscribed channels. You can subscribe to channels by searching for them, or by importing your entire subscription feed using Google Takeout. There’s also an option to automatically add all videos from a channel to your Later list, although that can be a bit extreme for most channels out there—I wouldn't recommend it. Play Premium users can also enable an option to disable Shorts in the Channels Inbox.\n\nAlternatively, you can also check out , which is a free and open source YouTube watch later app. The app is much simpler, but the interface is quite chaotic. It’s not as polished or seamless as the Play app. Still, Unwatched also lets you subscribe to YouTube feeds, and lets you build your own queue of videos to consume outside of the YouTube app, all at no cost. And if you're on Android, check out the NewPipe app instead.",
  "medium": "Article",
  "links": [
    "https://arstechnica.com/gadgets/2024/04/youtube-will-start-blocking-third-party-clients-that-dont-show-ads/",
    "https://apps.apple.com/us/app/play-save-videos-watch-later/id1596506190",
    "https://apps.apple.com/in/app/unwatched-for-youtube/id6477287463",
    "https://lifehacker.com/how-to-watch-ad-free-youtube-videos-on-android-even-wi-1848649514",
    "https://lifehacker.com/tech/how-to-transfer-pictures-from-google-photos-to-icloud",
    "https://lifehacker.com/tech/newpipe-is-an-ad-free-privacy-respecting-youtube-app-for-android"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "YouTube videos",
      "weight": 0.14886078
    },
    {
      "name": "interesting YouTube videos",
      "weight": 0.13955283
    },
    {
      "name": "YouTube ads",
      "weight": 0.12422318
    },
    {
      "name": "YouTube feeds",
      "weight": 0.118943766
    },
    {
      "name": "Saved videos",
      "weight": 0.11554812
    },
    {
      "name": "YouTube Premium",
      "weight": 0.113389716
    },
    {
      "name": "YouTube",
      "weight": 0.11268835
    },
    {
      "name": "videos",
      "weight": 0.110593
    },
    {
      "name": "video playback",
      "weight": 0.10859638
    },
    {
      "name": "Play Premium",
      "weight": 0.08174754
    }
  ],
  "topics": [
    {
      "name": "Electronics"
    },
    {
      "name": "iPhone"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.818359375
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Apps & Add-Ons",
      "score": 0.435302734375
    },
    {
      "name": "/Online Communities/Social Networks",
      "score": 0.395751953125
    },
    {
      "name": "/News/Technology News",
      "score": 0.38916015625
    },
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.347412109375
    }
  ],
  "sentiment": {
    "positive": 0.14904785,
    "negative": 0.3166504,
    "neutral": 0.53466797
  },
  "summary": "The article discusses the need for a better way to watch YouTube videos on iPhone without ads and the algorithm. The Play app, which is not a fully-featured YouTube client, allows users to organize their own watch later playlist separate from YouTube. The app is supported on Mac, iPhone, and iPad, and there is an Apple TV app for viewing saved videos. The base Play app costs $3 and can be used to find videos online and save them for later viewing on the Apple TV. However, the Play Premium subscription ($20/year) allows subscribers to subscribe to their favorite channels directly in the app. The article also discusses the NewPipe app on Android.",
  "shortSummary": "The Play app offers a simpler, calmer YouTube experience without ads and Shorts, allowing you to watch videos and create a watch later playlist.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "429d3b6981994bbcad3c5058c7424001",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apps.apple.com/in/app/unwatched-for-youtube/id6477287463",
      "text": "Unwatched for YouTube 12+\nPlayer & Watch Later Queue\nPentland Firth Software GmbH\n-\n- Free\nScreenshots\nDescription\nFollow YouTube channels or add Videos to watch them later\nKEY FEATURES\n• The Queue\nNo autoplay, no algorithmic bottomless feed. Just the Videos queued up in the order you want to.\n• Follow Channels or Playlist\nAutomatically add new videos\n• Triage\nChoose where new videos of each channel should end up. Directly on top of the queue, or in your inbox to sort through them. Pick the best, leave the rest.\n• Sick of #shorts?\nHide them all if you want.\n• Custom Playback Speed Per Channel\nSet custom speeds for any channel. Want to watch trailers in 1x and podcasts in 2x? You can.\n• Chapter Support\nJump to any chapter or pick and choose a few to watch while skipping the rest.\nMORE\n• Drag and drop videos & channel urls\n• Shortcut support\n• Continuous play\n• Custom Themes\n• Directly Import YouTube Subscriptions\n• iCloud Sync\nWhat’s New\nVersion 1.6.8\n- “Hide shorts” setting also applies to in-App browser\n- “Undo” for queue\n- Always show time during portrait playback\n- Copy url for any chapter\n- Hide status bar for iPad fullscreen mode\n# Fixes\n- Fix: YouTube overlay not being hidden correctly\n- Fix: clear current video unreliable\n- Fix: startup crash\nRatings and Reviews\nThe Best for tracking channels and playlists.\nThis is an amazing app. An app I never knew I needed the most.\nWhy is this app free? Amazing.\nI was looking for something like this for months. Paid/free … anything.\nHas everything I wanted.\nBackground audio.\nIndividual speed settings for different channels.\nThank you\nAwesome YouTube app with much needed features. If you can provide filter to the inbox to show from only some subscriptions rather than all of them, it’ll be helpful.\nDeveloper Response ,\nHappy to hear you’re enjoying it :)\nYou can already change what videos show up in your inbox, go to Library and select a subscription. From there you can choose \"Placement\" → \"Do nothing\".\nIf you’re running into issues feel free to reach out: unwatched.app@gmail.com\nApp Privacy\nThe developer, Pentland Firth Software GmbH, indicated that the app’s privacy practices may include handling of data as described below. For more information, see the developer’s privacy policy.\nData Not Collected\nThe developer does not collect any data from this app.\nPrivacy practices may vary based on, for example, the features you use or your age. Learn More\nInformation\n- Provider\n- Pentland Firth Software GmbH\n- Size\n- 3.1 MB\n- Category\n- Entertainment\n- Compatibility\n-\n- iPhone\n- Requires iOS 17.0 or later.\n- iPad\n- Requires iPadOS 17.0 or later.\n- Mac\n- Requires macOS 15.0 or later.\n- Apple TV\n- Requires tvOS 17.6 or later.\n- Apple Vision\n- Requires visionOS 1.0 or later.\n- Languages\n-\nEnglish, French, German, Polish, Spanish\n- Age Rating\n- 12+ Infrequent/Mild Cartoon or Fantasy Violence Infrequent/Mild Medical/Treatment Information\n- Copyright\n- © 2024 Pentland Firth Software GmbH\n- Price\n- Free"
    },
    {
      "url": "https://lifehacker.com/tech/newpipe-is-an-ad-free-privacy-respecting-youtube-app-for-android",
      "text": "YouTube's Android app is cluttered, slow, and full of ads. Even worse: It tracks every video you watch. NewPipe is a free and open source Android alternative interface for YouTube that's fully private and doesn't show ads. We've talked about ways to watch ad-free YouTube videos, and NewPipe is arguably the best one for Android users.\nEven better: NewPipe plays the audio from videos in the background, making it perfect for multitasking. You can listen to music, podcasts, or video essays on YouTube while doing chores, all without the need to keep the screen on. It also offers picture-in-picture mode, so you can watch videos while using another app, and downloads videos so you can watch them offline. These are features you'd otherwise need a paid YouTube Premium subscription for to get in an app.\nThere are a few potential downsides. You can't sign into your Google account, meaning your subscriptions won't be in the application. There also isn't an algorithm. This is inevitable for any app built around privacy but is worth thinking about.\nThe good news is that you can add subscriptions inside the application, allowing you to build a steady stream of videos from creators you trust. There's also a bookmarking feature, allowing you to mark playlists or videos you'd like to watch later. In short, you're going to have the opportunity to be a little more proactive about which videos you want to watch. There is support for exporting and importing your subscriptions and playlists, which is useful when switching devices.\nAnother potential downside is that you can't get in Google Play—you'll need to either install the .apk file from the website, which is going to require that you allow your device to install software from \"unknown\" sources. An alternative, which would also make installing updates easier, is to install NewPipe using F-Droid, which is a dedicated app store for open source Android publications."
    },
    {
      "url": "https://lifehacker.com/how-to-watch-ad-free-youtube-videos-on-android-even-wi-1848649514",
      "text": "YouTube is great, except for the annoying, unskippable ads. And, after the introduction of YouTube Premium, it seems like the number of unskippable ads for free accounts keeps going up. If you don’t want to sit through three ads just so you can watch your video, it might be time to try a different approach.\nThere is still a universe of third-party YouTube apps and tools that will give you a great ad-free YouTube experience, and they’ll do it for free.\nYouTube Premium\nLet’s get the obvious one out of the way first. YouTube Premium is the best and only way to remove all ads from YouTube videos on all the platforms that you use (including smart TVs). No other tool will offer that.\nBut it does come at a cost, and that cost keeps rising. As of writing, you can snag a subscription for $13.99 per month or $119.99 per year. If your household would all benefit from a subscription, you could consider a YouTube Premium Family plan for $22.99 a month, which lets six users share the same ad-free experience. But, just like Netflix, YouTube Premium also deters password sharing, and it only works if all the members live at the same residential address as the account manager.\nYou can also try subscribing to YouTube Premium from a country where the rates are low. In countries like Argentina, India, and Turkey, YouTube Premium costs less than $2 per month. Install a VPN, change the location, and try your luck subscribing to the cheaper plans.\nNewPipe\nNewPipe is perhaps the best way to watch YouTube ad-free on Android. This is not a modded YouTube app. Instead, it’s a separate, free, and open-source player for YouTube. NewPipe is lightweight, but offers the features you care most about: background playback; picture-in-picture; and, of course, no ads.\nWhile the app isn’t available in the Play Store, you can directly download the APK installer from their website, or you can find the app on the F-Droid app store—an alternate to Google Play Store that hosts free and open-source apps.\nThe app has an option to import your subscriptions, but you can’t sign in using your YouTube account.\nSkyTube\nSkyTube is another free and open-source third-party YouTube app for Android, just like NewPipe. It also offers the basic features you’ll want, including ad-blocking and background payback.\nThe only downside is that SkyTube is a view-only app. You can’t sign into your YouTube account, so there’s no sync feature. The app does have its own feature for channel subscriptions and bookmarks. On the other hand, there’s a version of SkyTube called SkyTube Extra, which is also free, and supports the official YouTube player and casting features.\nLibreTube\nYou can think of LibreTube (also Android only) as a NewPipe app but with a modern interface. It has a bottom tab bar, updated icons, and an overall smooth operation. This level of fit and finish is something that’s usually lacking in other popular YouTube apps. It supports SponsorBlock, so sponsored sections can be skipped as well. Plus, it has extra features like chapter selection.\nThis, too, is a free and open-source client. That said, the app is still in beta testing. Though it’s fully functional, you might encounter some bugs here and there.\nFirefox Browser with uBlock Origin\nUnlike Chrome on Android, Firefox actually supports extensions, and a single extension can change your entire YouTube experience. If you don’t mind using YouTube on the web (you can’t access it offline), you can install the popular ad-blocker uBlock Origin to automatically block all ads on YouTube.\nDownload the uBlock Origin add-on, then go to Menu > Add-ons > and enable uBlock Origin.\nBrave Browser\nIf you don’t want to use an extension, you can use a browser that has a built-in ad-blocker. Now, you’ll find many browsers that do this on the Play Store and App Store, but it would be best to use a trusted browser here. Brave Browser is a highly regarded privacy browser that also comes with a great ad-block feature that works on Android, iPhone, and PC. As long as you have the Shields Up feature enabled for YouTube, you won’t see ads in your videos anymore.\nAdGuard for iPhone\nThanks to the way iOS is set up, there’s no easy way to install an unofficial YouTube app like you can on Android. (Although, if you’re the adventurous kind, you can try installing the modded uYouPlus YouTube app using the AltStore Xcode sideloading method. This works on non-jailbroken iPhones, but requires a lengthy setup using a Mac.)\nBut if you’re okay using YouTube in Safari, you can remove ads using Safari extensions. Here too, you’ll find multiple trusted apps that do the job. AdGuard is a good option, as they have a specific feature built-in for removing all YouTube ads. After the extension is set up, go to YouTube.com, tap the Share button, and choose the Block YouTube Ads (by AdGuard) option.\nSmartTube for Smart TVs\nAs we’ve covered before, long unskippable ads are coming to the YouTube app on TVs. Thankfully, there is a workaround here. If you have an Android-based smart TV or streaming box (including Amazon Fire TV), you can simply install the SmartTube app (previously called SmartTubeNext) to act as a YouTube replacement. You will have to manually sideload the app, but once that’s done, you can say goodbye to all the ads.\nSponsorBlock\nSponsorBlock is both a browser extension and a service embedded in a couple of YouTube replacement apps we’ve covered above (like LibreTube). It does one thing, and one thing only: crowdsources data for sponsor segments in videos, and lets you automatically skip through those sections. Chances are, if you’re watching a remotely popular channel, SposorBlock will recognize the sponsor segment. If you can’t stand watching another 45-second ad for Squarespace, this is the extension for you."
    },
    {
      "url": "https://arstechnica.com/gadgets/2024/04/youtube-will-start-blocking-third-party-clients-that-dont-show-ads/",
      "text": "YouTube is putting third-party ad-blocking apps on notice. An ominous post on the official YouTube Community Help forum titled \"Enforcement on Third Party Apps\" says the company is \"strengthening our enforcement on third-party apps that violate YouTube’s Terms of Service, specifically ad-blocking apps.\" Google would really like it if you all paid for YouTube Premium.\nYouTube has been coming down on third-party apps, which often enable YouTube ad blocking. The company shut down one of the most popular third-party apps, \"YouTube Vanced,\" in 2022. Vanced was open source, though, so new alternatives sprung up almost immediately. Vanced takes the official YouTube Android client and installs a duplicate, alternative version with a bunch of patches. It turns on all the YouTube Premium features like ad-blocking, background playback, and downloading without paying for the Premium sub. It also adds features the official app doesn't have, like additional themes and accessibility features, \"repeat\" and \"dislike\" buttons, and the ability to turn off addictive \"suggestions\" that appear all over the app.\nAnother popular option is \"NewPipe,\" a from-scratch YouTube player that follows the open source ethos and is available on the FOSS-only store F-Droid. NewPipe wants a lightweight client without the proprietary code and million permissions that YouTube needs, but it also blocks ads."
    },
    {
      "url": "https://lifehacker.com/tech/how-to-transfer-pictures-from-google-photos-to-icloud",
      "text": "Say goodbye to downloading your entire photo library: Google and Apple are working together to allow users to directly transfer photos from Google Photos to iCloud, following a similar move from Apple in 2021. It’s a rare move of collaboration from the companies, and is part of the wider Data Transfer Project, an open-source project backed by several big tech companies that works to make data more portable between platforms.\nBoth companies posted support articles to their site explaining the process, which isn’t available quite yet. Apple’s article goes into a bit more detail on restrictions, pointing out that the service will launch in 240 countries and regions but won’t work for child accounts or Managed Apple ID accounts. Enabling Advanced Data Protection will also keep you from accessing Google Photos transfers to iCloud.\nTo transfer photos from Google Photos to Apple iCloud once it becomes available, first go to the transfer photos view of Google Takeout, the company’s service for generating backups of everything from your Google Drive content to your Gmail contacts.\nUnder Choose the data you want to copy, you’ll see the Google Photos logo. Click All photo albums included under the logo to narrow down the photos to be transferred, or keep it as-is to transfer all of them. Click the blue Continue button in the lower-right corner. In the Move to: dropdown menu, select Apple - iCloud Photos and sign into your Apple ID in the webpage that pops up. Click on Allow in Apple’s interface, then on Google’s interface, and finish the process by clicking Agree and continue.\nIt’s a somewhat laborious process, but it’s a bit more convenient in the long run than fully syncing your iCloud and Google Photos accounts. Google Takeout is a one-time, one-way transfer, so using this method means you won’t have to worry about new iCloud photos accidentally copying over to Google Drive and clogging up your storage space.\nThere’s no word yet on when transfers will be live, but be sure to set aside some time once they are. Google Takeout can take anywhere from a few hours to a few days to send everything over, depending on how many photos you want to share."
    }
  ],
  "argos_summary": "YouTube's recommendation algorithm can lead to endless scrolling, but third-party apps like Play and NewPipe offer alternatives for a more intentional viewing experience without ads. The Play app allows users to create a personalized watch later playlist without needing a YouTube login, while NewPipe provides a lightweight, ad-free interface for Android users. Both apps enable users to manage their video consumption without the distractions of YouTube's algorithm or ads, making for a calmer viewing experience.",
  "argos_id": "821N3784I"
}