{
  "url": "https://www.chicagotribune.com/2025/08/08/waukegan-new-businesses/",
  "authorsByline": "Steve Sadin",
  "articleId": "403b8409714a49bebb96ab72d42a0b64",
  "source": {
    "domain": "chicagotribune.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://www.chicagotribune.com/wp-content/uploads/2025/08/lns-l-waukbiz4.jpg?w=1024&h=653",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T14:24:50+00:00",
  "addDate": "2025-08-08T15:21:17.386623+00:00",
  "refreshDate": "2025-08-08T15:21:17.386625+00:00",
  "score": 1.0,
  "title": "New businesses flocking to Waukegan; ‘We want that momentum to keep going’",
  "description": "I’ll Cut U! is one of 23 new businesses that have opened since March 29 throughout Waukegan.",
  "content": "A post-COVID trend of business growth — a net of 1,744 business licenses were issued or renewed by the city of Waukegan since the start of 2022 — continues in the city with the addition of 20 new enterprises in the second quarter of this year.\n\nThe new businesses include a gourmet restaurant with a Mexican flair whose owners seek a Michelin star, a smaller eatery where an individual pork taco costs $3.50 and a downtown barber shop where appointments are taken but not required.\n\nKenneth Crump, the owner of I’ll Cut U! barber shop on Genesee Street in downtown Waukegan and a city native, cut the ribbon for his new location on July 1. On a recent afternoon, he finished styling a head with intricate braids before giving a traditional military haircut.\n\nWith several people visiting while waiting for their turn, Crump said he wants a shop where the community can gather, whether they have an appointment or not. He has 15 years in the business with extensive schooling.\n\n“This is going to be an old-school barber shop where people don’t need an appointment,” Crump said. “They can come in, wait their turn and get a haircut — same day service.”\n\nI’ll Cut U! is one of 23 new businesses that have opened since March 29 throughout Waukegan, continuing a substantial business growth rate that rapidly accelerated in the past two years.\n\nThough the city does not track each business that opens and closes during the year, every business owner must renew their license and pay the applicable fee each Jan. 1 allowing a count of all companies doing business in Waukegan.\n\nAt the start of 2022 before the impact COVID was making it harder for businesses to survive, and there were 1,616 business licenses issued in Waukegan, according to city records. At the start of 2023, the number dropped to 1,408.\n\nAs more businesses opened in 2023, the number of licenses climbed to 2,768 at the start of 2024 and 3,360 to begin 2025, doubling the 2022 total. Mayor Sam Cunningham said in an email that the city is supporting business owners as much as it can, helping new ones to grow further this year.\n\n“Already this year, we’ve seen a surge in business license applicants, and we want that momentum to keep going,” Cunningham said. “To make it happen, we’re committed to making our services more efficient and responsive to everyone’s needs.”\n\nWaukegan Chamber of Commerce board Chair Dr. Michael J. Reed said Waukegan is a “good place to live, shop and play,” making it ripe for business growth,\n\n“The city is a hidden gem and its resources are showing,” Reed said. “There are more opportunities to come here as we rebuild the downtown.”\n\nLa Chuparosa, the gourmet restaurant with a Mexican flair, formally opened with a ribbon-cutting on June 5. Indra Garcia, one of the owners, said it is also a place where women are comfortable dining with friends or having a cocktail at the bar.\n\nPainted on the walls are large portraits of Frieda Kahlo, a Mexican artist, and Maria Felix, an actor from Mexico, who were friends. Garcia said both were trendsetters and independent women ahead of their time.\n\n“We want to cater to women who can be comfortable having a cocktail or dining with friends, their husband, a boyfriend or a date and not feel harassed,” Garcia said. “We want them to know this is a safe place.”\n\nWith a menu featuring a Mexican Wheel Shrimp Pasta for $33, Chili Crusted Salmon for $30, and a 36-ounce prime Tomahawk steak for $120, Garcia said their two Mexican-trained chefs are seeking a Michelin star. There are also happy-hour tacos for $8.\n\nGarcia has a three-word answer for opening a restaurant which would fit comfortably in the Oak Street neighborhood of Chicago in her hometown of Waukegan where she has lived since she was 11.\n\nA few miles from La Chuparosa, Adalberto Fuentes and a partner opened Chicken Miche on June 13 on Belvidere Road, just south of the city’s downtown, named for the best dish his partner cooks and the drink he crafts.\n\n“He makes the best chicken in Milwaukee,” Fuentes said, referring to the partners’ initial eatery. “I make the best michelada. It’s like a bloody mary with spices mixed with beer.”\n\nOther new businesses opened in Waukegan since June 5 include Antojitos El Alegre food truck on June 7, Adore Boutique on June 25, Liguez Brunch on June 27, Alani Banquets on July 9, and Premier Barber.\n\n Academy on July 21, Al Jarrito Café on July 22 and Tacos El Vale on June 25.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "New businesses",
      "weight": 0.09007535
    },
    {
      "name": "business owners",
      "weight": 0.08975441
    },
    {
      "name": "business license applicants",
      "weight": 0.08579939
    },
    {
      "name": "Other new businesses",
      "weight": 0.08450638
    },
    {
      "name": "business growth",
      "weight": 0.083884925
    },
    {
      "name": "more businesses",
      "weight": 0.079583585
    },
    {
      "name": "business",
      "weight": 0.07922224
    },
    {
      "name": "businesses",
      "weight": 0.07922224
    },
    {
      "name": "downtown Waukegan",
      "weight": 0.07268584
    },
    {
      "name": "Waukegan",
      "weight": 0.066636525
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.986328125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.97900390625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.86572265625
    },
    {
      "name": "/News/Other",
      "score": 0.705078125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.580078125
    }
  ],
  "sentiment": {
    "positive": 0.13635254,
    "negative": 0.5576172,
    "neutral": 0.30615234
  },
  "summary": "The city of Waukegan has experienced significant business growth since the start of 2022, with a net of 1,744 business licenses issued or renewed. In Q2, 20 new enterprises were added to the city, including a gourmet restaurant with a Mexican flair seeking a Michelin star, a smaller eatery where an individual pork taco costs $3.50. Kenneth Crump, the owner of I’ll Cut U! barber shop on Genesee Street, opened a new location where appointments are not required. This is part of a larger business growth rate that has rapidly accelerated in the past two years. Mayor Sam Cunningham stated that the city is supporting business owners as much as it can to further grow.",
  "shortSummary": "Waukegan's business growth continues, with 20 new enterprises, including a gourmet restaurant, barber shop, and women’s equality initiative.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "0bb54216f3ff4e3187c6885451e2d7e1",
  "places": [
    {
      "osmId": "865812308",
      "road": "North Genesee Street",
      "city": "Waukegan",
      "county": "Lake County",
      "state": "Illinois",
      "postcode": "60085",
      "country": "United States",
      "countryCode": "us",
      "amenity": "Genesee Theater",
      "coordinates": {
        "lat": 42.3627104,
        "lon": -87.8309217556511
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "Waukegan has seen significant business growth post-COVID, with 1,744 business licenses issued or renewed since early 2022, including 20 new enterprises in the second quarter of this year. Notable additions include La Chuparosa, a gourmet Mexican restaurant aiming for a Michelin star, and I’ll Cut U!, a community-focused barber shop. The city is committed to supporting new businesses, with the number of licenses expected to double by 2025, reflecting a positive trend in the local economy.",
  "argos_id": "8JCFVR2IV"
}