{
  "url": "https://www.cnn.com/2025/08/08/politics/epstein-maxwell-survivors-analysis",
  "authorsByline": "Stephen Collinson",
  "articleId": "6ebd28ca769e437d9ed141ac9255077e",
  "source": {
    "domain": "cnn.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://media.cnn.com/api/v1/images/stellar/prod/still-21850355-631797-999-still.jpg?c=original/w_800",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T04:00:42.042000+00:00",
  "addDate": "2025-08-08T04:16:40.758850+00:00",
  "refreshDate": "2025-08-08T04:16:40.758852+00:00",
  "score": 1.0,
  "title": "Analysis: Epstein victims are a growing political threat to Trump",
  "description": "The women whom Jeffrey Epstein abused demand to be heard.",
  "content": "The women whom Jeffrey Epstein abused demand to be heard.\n\nAnd their voices — long suppressed, but now emerging powerfully and with courage — could further fuel the maelstrom around President Donald Trump and aides who dig the scandal deeper each time they try to end it.\n\nThese are women who’ve been let down for years, at multiple levels, by a government that was supposed to keep them safe. Their families are victims, too, since abuse sows trauma through generations.\n\nAnd it’s happening again as the Trump administration refuses to release files about Epstein’s life, which several of its members had promised to make public. CNN has reported that Attorney General Pam Bondi briefed Trump in May that his name was mentioned in the files, among those of other high-profile figures.\n\nTrump has never been investigated or charged over anything to do with Epstein, whom he knew in the 1990s and early 2000s. The White House says Trump threw Epstein out of Mar-a-Lago because he was “a creep.”\n\nBut hardly anyone at the White House ever mentions the young women whom Epstein used and abused.\n\n“What they really need is for it to go away,” Sky Roberts, the brother of one of Epstein’s most prominent victims, Virginia Giuffre, told CNN’s Erin Burnett on Thursday.\n\n“There’s a lack of transparency here and what we are not hearing is … we are not hearing the survivors’ voices coming through,” Roberts said. “This is a human issue, and I think we need to bring that back because we are dehumanizing survivors by not bringing justice forward.” Giuffre took her own life in Australia, where she lived, earlier this year.\n\nIn a sign of the administration’s political priorities, there were no Epstein survivors represented at a Wednesday night White House meeting that addressed the crisis, CNN reported. Those in attendance included Vice President JD Vance, Attorney General Pam Bondi and FBI Director Kash Patel. The meeting was moved from the vice president’s residence amid a media storm.\n\nThe focus at those White House talks appears to have been about ending a political problem rather than alleviating any further agony for people whose live were blighted by Epstein and Maxwell.\n\nOne Epstein accuser, Annie Farmer, told CNN’s Kaitlan Collins on Thursday that she had reached out to Deputy Attorney General Todd Blanche — who spent two days interviewing Epstein’s jailed accomplice Maxwell last month — but had not heard back. Some victims and their families view the meeting as a political maneuver to find a way to refocus attention away from Trump.\n\n“I hate that it has been politicized the way it is because I think we lose sight of the bigger picture in that,” Farmer said on “The Source.”\n\n“I think this is really about people using their power to harm others, and that is not a political issue,” Farmer said, referring to Epstein’s past conduct. “I think people on both sides care about the safety of children and I really hope that Trump understands that a message is being sent beyond just the individuals involved in this case to the wider community about the seriousness of these types of crimes.”\n\nThe question now is whether survivors and their families can coalesce as a political force as they seek to influence the administration’s decision-making — even if they are seldom mentioned by MAGA media.\n\nCan they secure the recognition of which they were so often deprived by the justice system? Will their influence further complicate a controversy that the White House has downplayed and dismissed but that keeps growing? And could they add a new dimension of political exposure for a White House so far mostly concerned with extinguishing a scandal that is uniquely dangerous for Trump — because it opened a rift between him and his base? Could that increased attention even make it more difficult to for Trump to pardon Maxwell, if that is his intention?\n\nVictims have been ignored for years\n\nIt’s nothing new that the powerful are ignoring the victims.\n\nIt’s been running on repeat for years.\n\nAs young girls, these women were victimized by Epstein, a disgraced financier, in a sordid web of soliciting, abuse and underage sexual exploitation.\n\nThey were also victimized by Maxwell, his onetime paramour, who was sent to prison for 20 years for grooming Epstein’s young female victims — and abusing some herself.\n\nThey were victimized by a lenient Florida plea deal in 2008 that allowed Epstein, an accused sex trafficker, to escape federal charges and a possible long prison term. He used the time he got back to perpetrate more horrendous crimes.\n\nThey were the victims of justice denied when Epstein killed himself in prison rather than face trial.\n\nA modicum of recognition arrived when Maxwell was convicted. But that vindication is under threat because of politics.\n\nThe conspiracy theorists who made this an animating cause of the MAGA right profess to care about child sex trafficking, but the coverage in fringe right-wing media rarely mentions the plight of victims themselves.\n\nUsing the Department of Justice to protect Trump, not victims\n\nNow, top administration officials are using the power of the Department of Justice in a plan apparently designed to take the political heat off Trump over his past relationship with Epstein. The clue is in the name — the Department of Justice. It’s supposed to deliver justice to victims and to honor their suffering. Instead, it’s being used to protect a president.\n\nWhen Trump was asked about Giuffre, he said he recalled that Epstein “stole” her, as if she were chattel, from his employ at the spa at Mar-a-Lago. The inhumanity of Trump’s remark prompted Giuffre’s family to first speak up, in a move that appears to have encouraged other families to come forward. “She wasn’t stolen, she was preyed upon at his property, at President Trump’s property … ‘stolen’ seems very impersonal. It feels very much like an object, and the survivors are not objects; women are not objects,” Roberts told CNN’s Collins last month.\n\nHardly anyone at the White House has publicly voiced concern for those dragged into some of modern history’s most notorious sex crimes.\n\nThe opposite is true. Trump, increasingly agitated as the Epstein fallout drowns out his presidency, keeps blasting the entire Epstein drama as a “hoax” in remarks that only makes the anguish worse. He even called it B.S. on Wednesday.\n\n“It’s not a hoax,” Roberts told Burnett on Thursday, his voice breaking.\n\n“I think it’s pretty clear that these survivors are not a hoax. These are people. It hurts. They are still healing. They had something taken from them that they can never get back.”\n\nThe White House has tried other ruses to make the scandal go away.\n\nIt has asked a judge to release grand jury testimony about the Epstein case, apparently hoping to slake demands for transparency by MAGA influencers. But the material is only a fraction of what the Justice Department controls. Then Blanche, Trump’s former personal lawyer, interviewed Maxwell. Then, mysteriously, Maxwell was moved to a much more comfortable prison in a highly unusual show of leniency for a sex offender. This fueled warnings of a cover-up, since Maxwell has an incentive to help Trump politically: He has the power to pardon her or improve her conditions.\n\nThe contempt for the victims is “outrageous,” Jennifer Freeman, a lawyer for some of those abused by Maxwell, told CNN’s Collins on Wednesday. “When the voices are so strong from everyone else except for them. They’re not given any attention whatsoever.” Freeman lamented that those caught up in the Epstein political saga have been “ignoring the survivors over and over …. (in) one of the largest law enforcement failures in US history.”\n\nThe disrespect keeps on coming.\n\nIn an interview with Newsmax last week, Trump was asked why Blanche met with Maxwell. “We’d like to release everything, but we don’t want people to get hurt that shouldn’t be hurt, and I would assume that was why he was there,” Trump told Newsmax a week ago. His remark was ambiguous. But it seemed to prioritize people who came into contact with Epstein, including himself, rather than those who have already been hurt — the victims. CNN reported this week that audio tapes were made of the Maxwell interview and that officials are considering releasing a transcript.\n\nThere is no indication of wrongdoing by Trump in his dealings with Epstein, Maxwell or in any other area of the case. He has never been charged or investigated. But there is growing scrutiny over how often he’s mentioned in the Epstein files held by the Justice Department.\n\nSome victims want all of the Epstein files publicly released so any men who associated with the accused sex offender must account for what they knew about his activities.\n\nBut they fear what will happen with Maxwell and the pardon that Trump keeps saying he has the constitutional authority to grant.\n\nSuch an outcome would be another betrayal of those who have suffered so terribly already.",
  "medium": "Article",
  "links": [
    "https://www.cnn.com/2025/07/28/politics/pardon-ghislaine-maxwell-trump-epstein",
    "https://www.cnn.com/2025/08/06/politics/trump-epstein-scandal-maxwell-interviews-blanche-tapes-analysis",
    "https://www.cnn.com/2025/07/25/politics/epstein-files-justice-department",
    "https://www.cnn.com/2025/08/05/politics/trump-blanche-epstein-maxwell-vance-bondi-patel-meeting",
    "https://www.cnn.com/2019/07/09/politics/acosta-defends-epstein-deal",
    "https://www.cnn.com/2025/08/04/politics/maxwell-prison-transfer-trump-analysis",
    "https://www.cnn.com/2025/08/07/politics/epstein-meeting-vance-bondi-patel",
    "https://www.cnn.com/2025/08/06/politics/epstein-victims-trump-cover-up-analysis",
    "https://www.cnn.com/2025/07/23/politics/bondi-trump-epstein-list-files",
    "https://www.cnn.com/follow"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Epstein victims",
      "weight": 0.09815708
    },
    {
      "name": "Epstein",
      "weight": 0.08861585
    },
    {
      "name": "Jeffrey Epstein",
      "weight": 0.085209526
    },
    {
      "name": "Trump",
      "weight": 0.07832237
    },
    {
      "name": "Donald Trump",
      "weight": 0.07662225
    },
    {
      "name": "President Donald Trump",
      "weight": 0.076198116
    },
    {
      "name": "White House",
      "weight": 0.06350635
    },
    {
      "name": "Maxwell",
      "weight": 0.059969302
    },
    {
      "name": "Epstein’s young female victims",
      "weight": 0.056098193
    },
    {
      "name": "political exposure",
      "weight": 0.05585092
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.955078125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.90234375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.8798828125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.81591796875
    },
    {
      "name": "/News/Gossip & Tabloid News/Scandals & Investigations",
      "score": 0.6474609375
    }
  ],
  "sentiment": {
    "positive": 0.04574585,
    "negative": 0.7753906,
    "neutral": 0.17883301
  },
  "summary": "The women who were abused by Jeffrey Epstein are demanding their voices be heard and could further fuel the ongoing scandal surrounding President Donald Trump and his administration. The Trump administration has refused to release files about Epstein's life, which several members of the party had promised to make public. Despite this, no Epstein survivors were represented at a White House meeting discussing the crisis. The focus of the meeting appears to have been about ending a political issue rather than alleviating any further agony for those whose lives were blighted by Epstein and his accomplice, Maxwell. The question now is whether these women can form a political force to influence the administration's decision-making.",
  "shortSummary": "The Jeffrey Epstein abuse scandal is creating a political storm as victims demand greater prominence, highlighting the ongoing political controversy around President Donald Trump and his administration.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f897bbf161b84d66b5b83a2c551afc05",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnn.com/2025/08/06/politics/epstein-victims-trump-cover-up-analysis",
      "text": "For years, Republicans and MAGA influencers have been keen to rip the lid off a supposed government conspiracy to cover up information related to Jeffrey Epstein’s crimes and alleged associates. Many key figures who now serve in the Trump administration pledged to do exactly that.\nThe administration’s failures to live up to those promises and its bizarre handling of the situation now have it scrambling. On Wednesday night, that will take the form of top officials strategizing at Vice President JD Vance’s residence, CNN is now reporting.\nBut their task is only getting harder.\nAnd that’s in large part because a growing chorus of Epstein’s victims and their allies now suggest there could indeed be a cover-up afoot.\nOne forged by the same MAGA administration that built itself up as the antidote.\nTo be clear, President Donald Trump has not been accused of any crimes in relation to Epstein. But repeatedly in recent days and weeks, those victims and allies have stepped forward to raise serious questions about the Trump administration’s handling of the matter. They’ve complained about favorable treatment of convicted Epstein accomplice Ghislaine Maxwell. They’ve objected to the lack of disclosure. They’ve complained about the administration’s treatment of them.\nThey’ve invoked the phrase “cover-up” on at least three occasions. Others have more subtly pointed in that direction.\nVictims have raised concerns about the government’s handling of the matter for years – in particular focusing on a favorable non-prosecution agreement Epstein landed in 2007 and the years before he was later charged – but their complaints are now directed squarely at the Trump administration.\nAll of which makes it much more difficult for the administration to just move on, as the president would clearly prefer.\nLast week, family members of one of Epstein’s and Maxwell’s most prominent accusers, Virginia Giuffre, cited Trump’s recent admission that he had been aware that Epstein recruited Giuffre from Mar-a-Lago. They cited other evidence that Trump was aware of Epstein’s affinity for young girls and women and said, “It makes us ask if he was aware of Jeffrey Epstein and Ghislaine Maxwell’s criminal actions.”\n(Giuffre died by suicide earlier this year.)\nIn another letter, Giuffre family members and other accusers also cited the still-unexplained prison transfer of Maxwell to a lower-security prison camp that sex offenders like her don’t appear eligible for, without a waiver. That news came shortly after Maxwell, who’s serving a 20-year sentence, was interviewed by Deputy Attorney General Todd Blanche. And it comes as Trump has dangled the possibility of pardoning Maxwell, who’s appealing her conviction.\n“This move smacks of a cover up,” they wrote. “The victims deserve better.”\nThey’re not the only ones to raise concerns about the prison transfer.\nTwo attorneys who have represented Epstein accusers, Brad Edwards and Paul Cassell, said in a letter Tuesday that they were given no notice of Maxwell’s transfer or any chance to object.\nThey said the victims view the transfer “as extraordinarily insensitive and suggestive of ulterior purposes.”\nThat letter was one of several entered into the record as part of proceedings over whether to unseal grand jury testimony from the investigations into Maxwell and Epstein. And some of those letters have also raised concerns about a cover-up.\nOne unnamed victim in her letter appeared to cite a Bloomberg report that the FBI has redacted the names of Trump and other prominent public figures in the Epstein files – a report that CNN hasn’t confirmed.\nThe unnamed victim said, “I feel like the DOJ’s and FBI’s priority is protecting the ‘third-party’, the wealthy men by focusing on scrubbing their names off the files,” adding: “That is their focus? Wow!”\nAnother victim, Annie Farmer, offered similar thoughts. Her lawyer cited the Justice Department’s statement last month that it would not release “information related to third parties who neither have been charged or alleged to be involved” in Epstein’s and Maxwell’s crimes.\n“Any effort to redact third party names smacks of a cover up,” Farmer’s lawyer said.\nFarmer previously told The New York Times that she urged law enforcement and the FBI two decades ago to look more broadly into Epstein’s associates, including Trump, who was friendly with Epstein but has said they had a falling out. Farmer also described a troubling encounter with Trump and Epstein in Epstein’s office in the mid-1990s.\nThere is no evidence of Trump’s involvement in Epstein’s crimes, and Farmer said she had no evidence of criminal wrongdoing by Trump. The White House has denied the alleged encounter by saying, “The president was never in [Epstein’s] office.” But Farmer’s account reinforces how Trump’s name could appear in the Epstein files and how it might reflect poorly on him, even if there’s no accusation of wrongdoing.\nAlso suggesting a cover-up last month was Alicia Arden, who alleged that Epstein assaulted her in 1997.\nArden told NBC News that she supported Trump but believed “there’s a cover-up of some kind going on.”\nShe cited Attorney General Pam Bondi’s comments in February indicating she had Epstein’s client list on her desk – comments Bondi and the White House now claim referred to other Epstein-related documents. The DOJ now says there is no client list.\n“She doesn’t want something to come out, and I don’t understand why,” Arden said. “Maybe the list is more horrifying than we think.”\nAnother anonymous Epstein accuser told NBC: “I am not surprised Trump is now saying we should stop talking about Epstein,” adding, “These people are trying to protect themselves.”\nAnd David Boies, a prominent attorney who represented Giuffre, told NBC: “I think they ought to release the material after promising, and if they don’t, people will believe they are hiding something, and that cannot be tolerated.”\nBoies points to something important. While Epstein-related conspiracy theories have been mostly pushed by Republicans and right-wing influencers, polls suggest large swaths of Americans buy into them, at least to some degree.\nA CBS News-YouGov poll last month found Americans agreed 92-8% that the Epstein files “probably include damaging information about powerful or wealthy people.”\nA Reuters-Ipsos poll showed Americans agreed 69-6% that the federal government was “hiding information” about Epstein’s clients and 60-12% that it was covering up details of his death (with many doubting he died by suicide, as the administration affirmed he did).\nThe comments of Epstein’s victims and their allies would seem to bolster that pre-existing belief.\nAnd that makes it a lot harder to claim there’s nothing to see here – whether for Trump or the many people who have built followings by pushing these theories."
    },
    {
      "url": "https://www.cnn.com/2025/07/25/politics/epstein-files-justice-department",
      "text": "Federal prosecutors amassed millions of records during the sex trafficking investigation and prosecution of Jeffrey Epstein and his accomplice and former girlfriend Ghislaine Maxwell.\nThe question of what is actually in those pages — and whether the public will ever see them — has become central to a growing public relations crisis for President Donald Trump and his aides.\nHaving said it would release case documents, now the Justice Department is trying to staunch the public outcry from some of Trump’s ardent supporters along with some Republicans and Democrats on Capitol Hill who believe the administration has fallen short of its transparency pledge.\nIt’s unclear what new information, if any, is stuffed in the boxes of evidence within the Justice Department or what Maxwell would say publicly about Epstein and anyone else’s connections to him.\nFor months, Justice Department and FBI officials have wrestled with the fact much of the material they have requires redaction to protect the identities of victims and witnesses, and people who haven’t been charged with crimes, according to people briefed on the matter. That raised the prospect that releasing thousands of pages covered with black ink for the redactions would only inflame people who believe the government is hiding evidence of additional criminal activity.\nThe Epstein files are made of over 300 gigabytes of data, paper, video, photographs, and audio that live within the FBI’s main electronic case management system, “Sentinel.” These records would include investigative reports and records from the FBI Miami field division’s original Epstein investigation. The bulk of the records would come from the second investigation carried out by the FBI’s New York Office, including memorandums about the investigation and potential targets, locations to be searched, records to be subpoenaed, and hundreds of pages of “302s” which are the forms that FBI agents use to memorialize what witnesses, victims and suspects said in interviews by investigators.\nA large cache of records has already been made public through unsealing civil court cases, Maxwell’s criminal trial, and news reports. Politicians, including Trump, and celebrities have been publicly linked to Epstein for years — sometimes by appearing in flight logs or at events — and all have denied any wrongdoing.\nEpstein’s death by suicide before trial launched conspiracy theories and deprived many of his accusers a public airing of his conduct. Maxwell was convicted of sex trafficking minors following a four-week trial in 2021. She is appealing.\nThe Justice Department asked federal judges to unseal grand jury transcripts from the Epstein and Maxwell cases. Deputy Attorney General Todd Blanche met Thursday with Maxwell, who is serving a 20-year prison sentence, in Tallahassee, Fla.\n“If Ghislane Maxwell has information about anyone who has committed crimes against victims, the FBI and the DOJ will hear what she has to say,” Blanche said in a post on X.\nBlanche’s post stands in contrast with the July 8 memo that was intended to close the books on the Epstein matter. In that memo, the Justice Department and FBI declared that they had done an exhaustive review and had determined that “we did not uncover evidence that could predicate an investigation against uncharged third parties.”\nHere’s what we do and don’t know about the Epstein records:\nGrand jury\nThe Justice Department has asked two federal judges in New York to unseal grand jury transcripts from Epstein and Maxwell’s criminal cases. Former federal prosecutors say the transcripts likely contain a miniscule amount of evidence from the investigations.\nFederal prosecutors in New York generally call law enforcement agents to testify before the grand jury to present just enough evidence they need to support an indictment. Other witnesses, including accusers, are rarely called in to testify before federal grand juries in New York.\nThe judges overseeing the two cases in New York asked DOJ for more legal argument for why they should unseal grand jury material, which is rarely done, and set deadlines that extend to August 5.\nAlready one effort has failed. A federal judge in Florida denied DOJ’s request to unseal grand jury transcripts from its 2005 and 2007 investigations into Epstein, stating the department didn’t meet the legal hurdle to do so under the rules governing the circuit.\nThe DOJ request is narrow: It isn’t seeking to unseal all information that was derived from the grand jury proceedings, which if sought, could include information from financial institutions, emails or text messages, and returns from any other person or institution that was subpoenaed by the grand jury.\nSearch warrants\nFederal prosecutors and the FBI obtained a trove of information during the searches of Epstein’s homes in Florida, New York and Little Saint James, Epstein’s private Caribbean island. That information is under the control of DOJ and is not blocked from public release by secrecy rules.\nFBI officials recovered thousands of nude and seminude photographs of young females, including at least of one minor, in a search of his Manhattan mansion in the days following his arrest. Binders of CDs containing the photos were seized. Agents used a saw to open a safe that had more than $70,000 in cash, 48 loose diamond stones, one as large as 2.38 carats, and a large diamond ring.\nThey also collected documents from the New York home, including notes, messages with names and contact information for certain victims, and phone records.\nA search of Epstein’s private island was conducted days after he was found dead in a jail cell about one month after his arrest. By then the investigation had shifted its focus to any co-conspirators of Epstein.\nIn February the Justice Department provided an index of evidence it has. The index includes over two dozen computers, numerous hard drives, at least two cell phones, and four iPads. The index says there are boat trip logs potentially of who traveled to his private island — that information has not been made public.\nThe Justice Department does not release child pornography so those records would not be expected to be made public under any circumstance.\nFlorida DOJ case file\nFederal prosecutors in New York obtained the investigative record from the earlier investigations into Epstein conducted by their counterparts in Florida in 2007 and 2009. Any of those records that were not covered by grand jury secrecy rules could be released.\nCivil lawsuits\nMuch of the public record relating to Epstein has derived from civil lawsuits brought by accusers, some filed under their own names and others using Jane Doe pseudonyms. Judges have ordered the release of thousands of pages of documents, including depositions taken under oath.\nAmong the famous names referenced in those documents are Trump, former President Bill Clinton, Britain’s Prince Andrew, former New Mexico Governor Bill Richardson, French modeling scout Jean-Luc Brunel, American investor Glenn Dubin, and Leslie Wexner, the CEO of L Brands. Not all of them were accused of wrongdoing, and all of them have denied any wrongdoing.\nMaxwell trial\nMaxwell’s four-week criminal trial was a public airing of her close relationship to Epstein and her role recruiting, grooming and at times participating in the sexual abuse of minors with Epstein. Four women testified about being sexually assaulted when they were minors.\nEpstein’s former pilot testified and identified people he saw on Epstein’s plane, including Trump, Senators John Glenn and George Mitchell, Prince Andrew, actor Kevin Spacey, and violinist Itzhak Perlman. The pilot said he never saw any wrongdoing.\nGawker first published a copy in 2015 of Epstein’s so-called “black book” with names and phone numbers of his contacts. The Justice Department released a redacted version of it earlier this year as well as copies of the flight logs that were made public during Maxwell’s criminal trial.\nThe release was criticized by some of Trump’s supporters because the information was already public — and did nothing to answer lingering questions.\nCNN’s John Miller contributed to this report."
    },
    {
      "url": "https://www.cnn.com/2025/08/07/politics/epstein-meeting-vance-bondi-patel",
      "text": "A much-anticipated meeting between Attorney General Pam Bondi, FBI Director Kash Patel, Vice President JD Vance and others was moved from Vance’s residence to the White House Wednesday night after intense media coverage, a source familiar with the logistics told CNN.\nThey discussed a number of topics, including the Jeffrey Epstein case and potential next steps, the source said.\nThe meeting was originally planned to take place at Vance’s DC home and was also supposed to include White House chief of staff Susie Wiles and Deputy Attorney General Todd Blanche, CNN previously reported. The administration’s handling of the Epstein case, as well as the need to craft a unified response, was expected to be a main focus of the dinner.\nTrump administration officials are weighing whether to publish an audio recording and transcript of Blanche’s recent conversation with Epstein accomplice Ghislaine Maxwell, CNN previously reported.\nThe meeting was also seen as a potential chance for Bondi and Patel — who have clashed over the Epstein case strategy, including in a contentious meeting with Wiles and Deputy FBI Director Dan Bongino — to clear the air. Vance had tried to play peacemaker between Bondi, Patel and Bongino previously.\nVance and his office denied on Wednesday that a meeting on Epstein was taking place.\nThis story has been updated with additional background."
    },
    {
      "url": "https://www.cnn.com/2025/08/06/politics/trump-epstein-scandal-maxwell-interviews-blanche-tapes-analysis",
      "text": "Lordy, there are tapes.\nIn the latest turn of the immortal scandal over Jeffrey Epstein, CNN first reported Tuesday that Donald Trump’s administration has recorded conversations with Epstein’s convicted sex trafficker accomplice Ghislaine Maxwell and is working on a transcript, which it may even release.\nThe revelation about Deputy Attorney General Todd Blanche’s conversations with Maxwell last month is certain to renew demands for transparency from sectors of the president’s base that first whipped the Epstein storm into overdrive.\nAnd it comes as senior administration officials plan to meet at Vice President JD Vance’s residence for dinner Wednesday to discuss how to better handle the Epstein case, CNN’s team reported.\nTaking a step back, it’s an extraordinary use of an administration’s power for a top Justice Department official to spend two days talking to someone convicted of grooming, abusing and trafficking young girls for a figure as reviled as Epstein. The idea that officials would then consider releasing an account of the meeting to brazenly help a president escape a political scandal raises ethical, legal and political questions that reflect the unfathomable times in Trump’s second term.\nBut it’s hard to see how releasing a transcript of the interview with Maxwell could end up making people less interested in the intrigue — which would be the ostensible purpose of the exercise.\nMore likely, such a move would risk repeating the damaging cycle that has plunged the White House ever deeper into a political morass.\nEvery time the administration takes a step designed to quell the scandal, all it succeeds in doing is raising expectations and brewing new conspiracy theories among MAGA activists obsessed with the case while widening public exposure to an episode that has blotted out the president’s summer winning streak.\nThree senior administration officials told CNN that discussions are taking place about releasing the transcript of Maxwell’s interviews with Blanche in Florida two weeks ago. That was before she was moved, without explanation, to a less draconian prison in Texas — a step that itself launched new speculation and suggestions that Trump was misusing presidential power to advance his personal interests. A final decision on next steps on a transcript has not been made, one of the officials said.\nBut this news came on a day when the Epstein question broke the surface in Washington again — just when the White House hoped it was fading.\nNews came Tuesday that the House Oversight Committee had issued a dozen subpoenas to the Justice Department and high-profile Democratic and Republican figures for files and information related to Epstein.\nAnd in the latest step of a complex dance with the administration, Maxwell’s lawyers warned against the release of sealed grand jury transcripts about the Epstein case. They said the move — one way the DOJ is seeking to appease demands for transparency from the Trump base — would prejudice her due process interests as she petitions the Supreme Court to take up her appeal.\n“Jeffrey Epstein is dead. Ghislaine Maxwell is not,” Maxwell’s attorney, David Oscar Markus, wrote to the judge in a filing.\nThe aphorism is factual. But Epstein’s poisoned influence on politics has never been so alive, six years after he was found dead by suicide in his cell while awaiting trial on a catalogue of horrific charges of abusing young women and girls.\nMany of those victims on Tuesday questioned the motives of the Trump administration in its dealings with Maxwell and said that indications that she was being “legitimized” had traumatized them all over again. They told the judge in the grand jury documents case that survivors supported transparency but said the “safety, privacy and dignity” of victims must be protected.\nWhy a Maxwell transcript might make the scandal even worse\nThere’s been intense speculation about the past friendship between Epstein and Trump, both New York and Florida celebrities, in the 1990s and the early 2000s, before the future president threw the disgraced financier out of his Mar-a-Lago club. Epstein “stole” his employees, Trump told reporters last week.\nThere’s no evidence that Trump did anything legally wrong during his friendship with Epstein, and he has never been charged with any crimes related to their connection.\nThe president, however, keeps refocusing attention on Epstein’s case by refusing to rule out a pardon or commutation for Maxwell. Trump instead keeps noting that he has the power to ease the plight of someone who has a huge incentive to help him.\n“I’m allowed to do it, but nobody’s asked me to do it. I know nothing about it. I don’t know anything about the case, but I know I have the right to do it,” Trump said in an interview with Newsmax, a conservative outlet, last week.\nIt is unclear what Blanche and Maxwell spoke about. But the point of releasing a transcript might be to show Epstein knew multiple famous people and not just Trump. This might defuse concerns about the president’s past relationship with him.\nBut such a release might also be unfair to people who came across Epstein but who committed no crimes.\nThere would be issues with Maxwell’s credibility as a witness, given the nature of the conviction for which she is serving a 20-year prison sentence. People would ask what she got in return for her cooperation. Already, survivors of Epstein’s abuse and the family of Virginia Giuffre, one of his most well-know victims, who took her life this year, have warned there should be no leniency.\nTrump insisted, as he answered a question from CNN’s Kaitlan Collins on Tuesday, that he knew nothing about the contents of Blanche’s talks with Maxwell.\n“So, I know this. I didn’t discuss it with him, but anything he talked about with her, or the fact that he did that — not unusual, number one, and most importantly, is something that would be totally above board,” the president said.\nBut it is highly unusual for a deputy attorney general to meet with an imprisoned inmate convicted of child sex trafficking as a related scandal swirls around the president who appointed him. And Blanche is Trump’s former personal lawyer.\nAnd in any case, any notion that a transcript would end the Epstein drama feels far-fetched. The document would need to be heavily redacted to avoid revealing sensitive details like the names of victims. But this would surely fuel fringe intriguers who argue that the government is involved in a massive cover-up. It’s the nature of conspiracy theories that efforts to squelch them only spark new tributaries of unhinged speculation. This has already happened. Previous disclosures by Attorney General Pam Bondi of documents and details in the case only conjured claims of a deep state plot to hide the truth when the release fell far short of her promises to MAGA activists.\nHouse Oversight ensures this drama will run and run\nThe House Oversight Committee’s subpoena to the Justice Department calls for the provision to Congress of any Epstein files in its possession, with victims’ names redacted. The GOP-led panel also wants communications between former Biden administration officials and the Justice Department related to the case.\nDepartments of Justice often resist releasing sensitive documents to Congress: They often leak. But Democratic Rep. Ro Khanna, who serves on the House Oversight Committee, told CNN’s Jake Tapper on Tuesday the House would reinforce the demand for action in September, when Khanna is hoping for a vote on his bipartisan bill demanding the full release of information. “I think soon you are going to see many victims speaking out themselves about how this is important for them, in terms of disclosure in terms of transparency,” Khanna said.\nThe Republican-led panel additionally subpoenaed 10 individuals for closed-door depositions between August and mid-October. Those are: former Attorneys General Merrick Garland, William Barr, Jeff Sessions, Loretta Lynch, Eric Holder and Alberto Gonzales; former FBI Director James Comey; former special counsel and FBI Director Robert Mueller III; former Secretary of State and first lady Hillary Clinton; and former President Bill Clinton.\nBut there are huge omissions on the list of subpoenas that raise doubts about whether it’s really seeking full transparency. Like Trump, who was mentioned multiple times in the Epstein files, and his first-term Labor Secretary Alex Acosta, who handed Epstein a sweetheart plea deal in 2008. There are also no victims — people who have often been ignored in the current political uproar — on the subpoena list.\nRyan Goodman, a New York University law professor, said the omission of Trump from the subpoenas was “very glaring,” since a subpoena sent to former President Bill Clinton said Clinton could have information regarding Epstein that may be relevant to the investigation. The same is true of Trump. “It only stands to reason that if you are looking around for the people that would provide information for the investigation, he (Trump) would be pretty close to the top of that list,” Goodman told CNN’s Erin Burnett.\nThe subpoenas likely mean months of negotiations and legal battles about the timing and scope of testimony. So the Epstein saga is here to stay.\nThe inclusion of the names of high-profile Democrats and past Republican officials may be an attempt to spare Trump from being the only person tainted by association with Epstein.\nMaxwell’s legal conundrum\nThe warning by Maxwell’s lawyers that grand jury testimony should not be released potentially puts their client in opposition to the Justice Department at a time when she has strong incentives to help the administration.\nThe DOJ went to court to ask for the release of grand jury transcripts about Epstein and Maxwell, hoping to placate the MAGA base. The testimony, however, is thought to be only a fraction of investigative material the DOJ is holding. Some observers question whether officials really want grand jury documents released or whether they petitioned the judge only to create political cover.\nCNN Senior Legal Analyst Elie Honig explained that Maxwell’s lawyers are protecting her interests in the event that Supreme Court accepts her appeal. Her lawyer would “not want this grand jury material out there for the public,” he told CNN’s Kasie Hunt.\nTaken together, Tuesday’s developments mean Epstein drama will go on.\nAnd the history of tapes in American scandals — from Watergate onward — create evocative echoes. Audio and questions about its release, redaction and editing have been inseparable from lore about cover-ups and chicanery in Washington politics. That’s why — amid a previous scandal — Comey replied, when asked whether there were recordings of his conversations with Trump: “Lordy, I hope there are tapes.”"
    },
    {
      "url": "https://www.cnn.com/2019/07/09/politics/acosta-defends-epstein-deal",
      "text": "Labor Secretary Alex Acosta, who as US Attorney in Miami oversaw a 2008 plea deal with Jeffrey Epstein, defended on Tuesday his handling of the case and tweeted he is pleased “prosecutors are moving forward.”\n“The crimes committed by Epstein are horrific, and I am pleased that NY prosecutors are moving forward with a case based on new evidence,” Acosta wrote in a series of tweets on Tuesday. “With the evidence available more than a decade ago, federal prosecutors insisted that Epstein go to jail, register as a sex offender and put the world on notice that he was a sexual predator.”\nIn his latest tweet in the series, Acosta wrote, “Now that new evidence and additional testimony is available, the NY prosecution offers an important opportunity to more fully bring him to justice.”\nFederal prosecutors in New York unsealed a criminal indictment on Monday charging Epstein with having allegedly operated a sex trafficking ring in which he sexually abused dozens of underage girls. Acosta’s handling of the 2008 plea deal has come under intense scrutiny in recent months after a Miami Herald investigation. The non-prosecution deal with federal prosecutors allowed the hedge fund manager to plead guilty to two state prostitution charges and serve just 13 months in prison.\nThe Herald investigation said Acosta gave Epstein the “deal of a lifetime” despite a federal investigation identifying 36 underage victims. The agreement, the Herald said, “essentially shut down an ongoing FBI probe” and further granted immunity to “any potential co-conspirators” in the case.\nTop Democrats in Congress and on the campaign trail have in recent days called for Acosta to resign.\nCNN’s Devan Cole contributed to this report."
    },
    {
      "url": "https://www.cnn.com/2025/08/04/politics/maxwell-prison-transfer-trump-analysis",
      "text": "The Trump administration made interviewing Jeffrey Epstein’s accomplice, Ghislaine Maxwell, a key part of its efforts to climb out from beneath its Epstein files problems.\nOver a week later, we still don’t know what transpired during that meeting. But the Maxwell situation has only grown to epitomize a series of very curious maneuvers that call into question precisely what everyone in the administration is thinking and suggest the controversy is going nowhere fast.\nIndeed, it’s almost as if those involved are trying to make this look bad.\nWe learned Friday that Maxwell had been moved from a low-security federal prison in Florida to a minimum-security prison camp in Texas called Camp Bryan – a significant upgrade for an inmate serving a 20-year sentence.\nNeither the Justice Department, the Bureau of Prisons nor Maxwell’s lawyer has addressed precisely why the transfer was made. We don’t know who was involved. But it’s conspicuous for a host of reasons.\nTo wit:\n- News of the transfer broke after Maxwell met with Deputy Attorney General Todd Blanche, a political appointee and Trump’s former defense lawyer, in a meeting that remains shrouded in secrecy.\n- Maxwell doesn’t appear to have been eligible for such a transfer, unless someone granted her a waiver. Bureau of Prisons policy states that anyone who had “sexual contact with a minor,” as Maxwell did when she participated in the sexual abuse, “will be housed in at least a Low security level institution,” without such a waiver. (Maxwell was sentenced in 2022 for carrying out a years-long scheme with Epstein to groom and sexually abuse underage girls.)\n- Experts have said such a transfer is highly unusual. Prison consultant Holli Coulman on Friday told CNN’s Phil Mattingly that she had “never seen this in my life. Never seen it by women that I’ve either served time with, clients, never have seen this. This is unprecedented.”\n- Maxwell’s upgrade comes as Trump has repeatedly seemed to dangle a favor – specifically, a potential pardon – as she spoke with the Justice Department and entered into talks to testify to Congress. The White House told CNN last week that “no leniency is being given or discussed” for Maxwell, but then Trump again conspicuously noted that he had the power to pardon her.\n- A lower-security prison could certainly be construed as a form of “leniency.”\n- Trump has a history of suggesting favors for those whose actions could impact him. He dangled pardons over witnesses in the Russia investigation in ways that special counsel Robert Mueller said could have impacted their decisions on cooperating with the government. And more recently, Trump’s Justice Department seemed to tie the dismissal of New York Mayor Eric Adams’s criminal charges to him helping with Trump’s immigration crackdown.\n- The favorable prison transfer comes even as Maxwell’s lawyer has openly sought concessions for her.\nThere is plenty we don’t know about all of this, in large part because the key players aren’t talking. It’s theoretically possible this is all just a major coincidence.\nBut it certainly raises questions that the key officials involved would seem to have motivation to put to rest – and quickly. Maxwell’s testimony could bear on Trump personally, given continuing revelations about his ties to Epstein and his desire to put the entire Epstein files fiasco to rest. Now we learn she got a highly unusual perk.\nAnd it’s merely the latest in a series of very questionable developments.\nThe other concession the Trump administration made after failing to produce the Epstein documents that it had promised was moving to unseal grand jury testimony. But its own filing last week reinforced that information is likely to be quite limited, if it even sees the light of day.\nTrump has been very slow to acknowledge his own proximity to Epstein. Last week, after days of confusion, the president ultimately said he had been aware in real time that Epstein “stole” one of his Mar-a-Lago employees, a then-minor named Virginia Giuffre who became one of Epstein’s highest-profile accusers.\nGiven Giuffre’s age at the time and a paper trail that suggests Trump’s awareness of Epstein’s affinity for young women and girls, that raises valid questions about what Trump knew or might have suspected at the time. Family members of Giuffre’s have raised the possibility that Trump knows more than he has let on, but the president has balked at expanding on his statements about why this episode made him decide Epstein was a “creep.”\nTrump, who has not been accused of wrongdoing in connection with Epstein, claimed Thursday that “I don’t know really why” Epstein was taking his employees.\nBut he’s repeatedly made false and misleading claims about his past ties to Epstein. Most recently, he denied that Attorney General Pam Bondi had told him his name was in the Epstein files, which CNN later reported she had – back in May.\nWhat’s more, the timeline suggests the administration’s reversal on promising full disclosure coincided with Trump being told he was in the files.\nAnd then there is the Maxwell situation. Even before the news of her prison transfer, the administration took very little care to make its handling of her appear proper.\nIt sent Blanche, Trump’s former personal lawyer, to meet with her. Blanche has called Maxwell’s lawyer his “friend.” Maxwell’s lawyer has been solicitous of Trump. And, of course, Trump has repeatedly left open a pardon.\nTrump late last week said he didn’t know what would be produced from the Blanche meeting, saying, “I don’t know because I haven’t spoken about it.”\nBut he again suggested it might be limited by a desire not to create suspicion of people who haven’t been charged with crimes.\nThe confusion around all of this only seems to be growing, in large part because of Trump’s and the administration’s own actions and lack of transparency.\nAnd perhaps nothing looms larger right now than the unanswered questions about the prison transfer."
    },
    {
      "url": "https://www.cnn.com/2025/08/05/politics/trump-blanche-epstein-maxwell-vance-bondi-patel-meeting",
      "text": "Top Trump administration officials will gather at the vice president’s residence Wednesday evening as they continue to weigh whether to publish an audio recording and transcript of Deputy Attorney General Todd Blanche’s recent conversation with Jeffrey Epstein accomplice Ghislaine Maxwell.\nThe administration’s handling of the Epstein case, as well as the need to craft a unified response, is expected to be a main focus of the dinner, three sources familiar with the meeting told CNN. The meeting will include White House chief of staff Susie Wiles, Vice President JD Vance, Attorney General Pam Bondi, FBI Director Kash Patel and Blanche.\nWith the exception of Vance, the White House considers those officials the leaders of the administration’s ongoing strategy regarding the Epstein files, two of the sources said.\nThe meeting comes as Trump’s administration is considering releasing the contents of Blanche’s interview last month with Maxwell. Two officials told CNN that the materials could be made public as early as this week.\nThere have also been internal discussions about Blanche holding a press conference or doing a high-profile interview, possibly with popular podcaster Joe Rogan, according to three people familiar with the discussions, though those conversations are preliminary. Rogan, who endorsed Trump on the eve of last fall’s election, has been highly critical of the Trump administration’s handling of the Epstein case and previously called their refusal release more information about Epstein a “line in the sand.”\nWilliam Martin, Vance’s communications director, denied CNN’s reporting in a statement: “As we’ve said publicly, there was never a supposed meeting scheduled at the Vice President’s residence to discuss Epstein Strategy. Any reporting to the contrary is false.”\nThe Department of Justice did not respond to a request for comment for this story. The FBI declined to comment. Patel and Bondi have previously clashed over the administration’s Epstein strategy.\nMeanwhile, CNN previously reported that the Justice Department has been digitizing, transcribing and redacting the interview materials as they weigh if and when to publicly release the information from the Maxwell interview. There is over 10 hours of audio, a senior Trump administration official said. Portions of the transcript that could reveal sensitive details like victim names would also have to be redacted, one of the officials said.\nOne official told CNN that some of the conversation within the White House has focused on whether making the details from the interview public would bring the Epstein controversy back to the surface. Many officials close to Trump believe the story has largely died down.\nTrump on Tuesday defended Blanche’s recent sit-down with Maxwell, arguing that Blanche wanted to ensure that people who “aren’t involved are not hurt” by something “very unfair.”\nOn Wednesday morning, the family of Epstein victim Virginia Giuffre issued a statement asking why no survivors had been invited to the meeting at Vance’s home. They offered to attend in Giuffre’s stead, as she died by suicide earlier this year.\n“Missing from this group is, of course, any survivor of the vicious crimes of convicted perjurer and sex trafficker Ghislaine Maxwell and Jeffrey Epstein. Their voices must be heard, above all,” wrote Giuffre’s two brothers and sisters in law, Sky and Amanda Roberts and Danny and Lanette Wilson.\nAmid the clamor for more disclosures about the case, the House Oversight Committee on Tuesday issued nearly a dozen subpoenas to the Justice Department and high-profile Democratic and GOP figures for files and information related to Epstein — a significant show of defiance against Republican leaders.\nTwo of the administration officials said if they were to release the audio and transcript, it would likely be done sooner rather than later. One said the release could be several weeks from now, depending on what the most senior-level officials within the West Wing and Justice Department decide. It was not immediately clear whether the White House and DOJ were aligned on the issue.\n“This is nothing more than CNN trying desperately to create news out of old news. [Trump] already addressed this issue in an interview with Newsmax, a real news outlet that routinely gets better ratings than CNN,” White House Communications Director Steven Cheung told CNN, when asked about the possibility of releasing the transcript.\nA lawyer for Maxwell declined to comment.\nBlanche interviewed Maxwell at the US attorney’s office in Tallahassee, Florida, last month over a period of two days. Maxwell was sentenced in 2022 to 20 years in federal prison for carrying out a yearslong scheme with Epstein to groom and sexually abuse underage girls. She has continued to appeal her conviction, including with the Supreme Court.\nLast week, Maxwell was moved from a Florida federal prison to a lower-security federal prison camp in Texas, a relatively uncommon move as those convicted of sex offenses are almost always deemed too high of a risk to public safety.\nAs Trump has faced mounting pressure from his base for transparency, the White House has repeatedly said the DOJ should release all “credible evidence” in the Epstein files.\nAsked about Blanche’s meeting with Maxwell last week, Trump again said he’d like to see everything in the files released.\n“We’d like to release everything, but we don’t want people to get hurt that shouldn’t be hurt, and I would assume that was why he was there,” Trump told Newsmax on Friday.\nThe president said he hadn’t spoken to Blanche about his meetings with Maxwell and didn’t know when that information would be made public.\n“I haven’t spoken about it, but he’s a very talented guy, Todd Blanche, and a very straight shooter, and I think he probably wanted to know, you know, just to get a feeling of it,” Trump said.\nCNN previously reported that a senior Trump administration official stated that the president is not currently considering clemency for Maxwell, though he has repeatedly left the door open on the matter in recent weeks, saying he’s “allowed to do it.”\nCNN’s Mi Seon Lee, Holmes Lybrand and Annie Grayer contributed to this report.\nThis story and headline have been significantly updated with additional reporting."
    },
    {
      "url": "https://www.cnn.com/2025/07/28/politics/pardon-ghislaine-maxwell-trump-epstein",
      "text": "Plenty of Republicans are walking a tricky line right now on the Jeffrey Epstein files. But few have walked one as tricky as congressional leadership in recent days.\nAsked about President Donald Trump potentially pardoning Epstein’s convicted sex-trafficking accomplice, Ghislaine Maxwell – something Trump conspicuously left the door open to Friday and then again Monday – House Speaker Mike Johnson punted on Sunday.\n“Well, I mean, obviously that’s a decision of the president,” he told NBC’s “Meet the Press,” adding: “I won’t get in front of him. That’s not my lane.”\nWhen pressed, the Louisiana Republican relented a bit and said that the idea gave him “great pause” because of her “unspeakable crimes” – while again emphasizing that’s “not my decision.”\nSimilarly on Monday, Senate Majority Leader John Thune would not say if Trump should rule out a pardon for Maxwell.\n“Well, that’s up to him,” the South Dakota Republican told CNN’s Manu Raju. “But it looks to me like she’s going to spend a good long time in jail.”\nMaxwell, who’s serving 20 years, is a convicted sex trafficker. Of children. Leadership’s message to Trump seemed to be: Please don’t do it. But also, just in case you do pardon a sex trafficker of children, I need to cover myself and emphasize that you have the full right to do it.\nAnd they weren’t the only Republicans to curiously avoid rejecting such a pardon. “I don’t know enough about Maxwell or the conversation to even weigh in on that,” Sen. Markwayne Mullin of Oklahoma told CNN’s Jake Tapper on Sunday.\nSo why on earth are Republicans treating this seemingly unthinkable maneuver so gently?\nWould Trump actually do such a thing? And how on earth would that not blow up in his face?\nIt’s difficult to see how. And indeed, this prospect seems to work better as a carrot for Maxwell, who met last week with the deputy attorney general, than as a legitimate possibility. You could certainly be forgiven for thinking Trump wants Maxwell to believe she might get a pardon – or other help in her ongoing appeals – even if that’s not realistic.\nThe conventional wisdom among some on the left has been that Trump has indeed cued up a Maxwell pardon, ever since his administration made interviewing her its first big move to allay concerns about its handling of the Epstein files. The idea would be that Maxwell will say the things the Trump administration wants – such as clearing the president and/or implicating others – and he rewards her with a pardon.\nTrump certainly hasn’t shied away from controversial pardons before. He has gone to historic lengths to pardon allies. He has granted clemency to virtually all January 6, 2021, defendants – including hundreds who were convicted of assaulting police.\nBut even against that backdrop, pardoning a convicted sex trafficker is on another level.\nLet’s say Trump does it.\nThe idea would apparently be that Maxwell provides Trump and his team enough information that they can change the subject by focusing the conversation on other people she might implicate. (It’s worth noting that Trump has not been accused of any wrongdoing in connection with Epstein.)\nBut what happens then? Maxwell clearly has a credibility issues and reason to say what helps her in this moment. And that’s not just me saying it; it’s Trump’s own Justice Department, circa 2020, which called her a brazen liar. A pardon would only reinforce the idea that this was some kind of corrupt bargain.\nAbout the only way to combat that would be if she gave information that actually panned out. But justice takes a long time to be served. The Justice Department needs time to build cases, and those cases might or might not succeed. Are you really going to pardon her before any of that happens? What happens if the end result is that the only Epstein associate to actually be convicted walks free?\nIt also seems likely that a pardon would only add new fuel to a subject that Trump badly wants to move on from. If other people were implicated, that would create all kinds of threads to be pulled moving forward.\nThat would also inject new life into theories about a possible cover-up. The question would become whether these people were subjects in the various investigations, and whether those leads were followed up. It would also lead to questions about whether other people could be brought to justice, which would make withholding the Epstein files even more difficult for the Trump administration.\nAnd that’s a very big risk here. Polls show huge numbers of Americans already believe there is some form of a cover-up at play. A Reuters-Ipsos poll this month showed Americans agreed 60-12% that the federal government was “hiding information” about Epstein’s death, and 69-6% that it was hiding information about his clients.\nThat latter belief was overwhelmingly bipartisan, with 82% of Democrats and 62% of Republicans agreeing. These people would have their fears confirmed – and probably would want to know more.\nAnd then there is just the “yuck” factor.\nTrump’s January 6 pardons were highly unpopular; a February Washington Post-Ipsos poll showed Americans opposed the pardons of violent offenders 83-14%.\nAt the same time, the president doesn’t seem to have paid much of a price. Those pardons during his first week back in office quickly faded amid a barrage of early Trump maneuvers that competed for the attention of the media and news consumers.\nBut the attack on the US Capitol was also years in the past by that point. People were probably unfamiliar with the many hundreds of defendants, and many Trump supporters had been convinced over many months that these people were railroaded. It just wasn’t as much of a political hot potato, even as it was unseemly in most Americans’ eyes.\nIt’s difficult to see how a Maxwell pardon wouldn’t instantly be news for days and weeks, because of how people feel about her crimes and the entire Epstein saga, and because of questions about whether this was some kind of corrupt trade. It would also force GOP lawmakers into some very uncomfortable interviews. (A president indeed has the power to pardon whomever he wants to. That doesn’t mean every pardon is morally just.)\nFor all of the MAGA movement’s seeming willingness to go along with whatever Trump says, it’s hard to see how even much of the base would be okay with all that.\nThe question of whether Trump pardons Maxwell might not even be the right one. A better one might be whether Trump’s Justice Department could do something else to help her – such as in her ongoing appeals.\nMaxwell’s legal team has based its appeal around the idea that the 2008 non-prosecution agreement Epstein secured in Florida should have covered Maxwell. To this point, the Trump administration has rejected that argument, saying earlier this month that Maxwell was “not a party to the relevant agreement.” Perhaps it could change its tune?\nEven that seems pretty far-fetched, though. While this would be a more limited step, it would still look pretty bad and would lead to all kinds of questions about quid pro quos with a convicted sex trafficker.\nIn the end, this debate seems a whole lot more valuable to Trump in the abstract than in reality. Maxwell didn’t just talk to a top Trump appointee in the Justice Department last week, she could soon be testifying to Congress. What better way to guide what she says than to have her believe maybe the administration could do her a solid.\nOr perhaps this is just another example of Trump’s strange commentary about Maxwell – remember “I wish her well” – and never wanting to rule things out. He loves to keep his options open, even when one of those options seems to be ridiculous.\nBut at least for now, it’s apparently significant enough for Republicans to treat it as a real possibility. And that, in and of itself, is shocking."
    },
    {
      "url": "https://www.cnn.com/2025/07/23/politics/bondi-trump-epstein-list-files",
      "text": "When Attorney General Pam Bondi briefed President Donald Trump in May on the Justice Department’s review of the documents related to the Jeffrey Epstein case, she told him that his name appeared in the files, sources familiar with the discussion told CNN.\nThe conversation, which also included Deputy Attorney General Todd Blanche, was characterized by two White House officials as a “routine briefing” that covered the scope of the Justice Department’s findings. Trump’s name appearing in the files, they said, was not the sole focus of the discussions.\nBondi also raised in the meeting that several names of high-profile figures were also mentioned, and that investigators did not find evidence of a so-called client list or evidence refuting that Epstein died by suicide, the officials said.\nThe sources familiar with the department’s review said the files appeared to include several unsubstantiated claims that the Justice Department found not to be credible, including those relating to Trump.\nIt wasn’t clear in what context Trump’s name appeared in the files. Like many high-powered people in 1990s New York, Trump was an associate of Epstein’s, who worked to cultivate celebrities to burnish his business. The revelation that his name appears in the documents does little to advance previous knowledge about his ties to the late sex offender.\n“The White House is not surprised by this – Trump’s name was present in the binders that Bondi produced and handed out,” one of the White House officials said, adding that many of the materials already released by the Justice Department had included mention of the president’s name.\n“The White House does not view this as groundbreaking or new or surprising at all,” the official said, adding that there is no evidence that Trump was involved in any wrongdoing.\n“The fact is that the President kicked him out of his club for being a creep,” White House communications director Steven Cheung said in a statement to CNN, referring to Epstein. “This is nothing more than a continuation of the fake news stories concocted by the Democrats and the liberal media, just like the Obama Russiagate scandal, which President Trump was right about.”\nThe Wall Street Journal first reported that Bondi informed Trump in May about his name appearing in the documents.\nThe revelations about the meeting contradict Trump’s more recent denials that he was told he was in the files.\nPressed last week on whether Bondi had told him he was named in the documents, he said, “No, no. She’s given us just a very quick briefing.”\nTrump has struggled to tamp down weeks of backlash over the administration’s decision not to release more documents related to the Epstein investigation — a move that infuriated a vocal segment of the MAGA base and put the president at odds with some of his most ardent supporters.\nInside the White House, officials were outraged that Bondi did not redact Trump’s name from publicly available materials contained in Epstein binders distributed to influencers in February, sources said. Her failure to protect the president during the episode has been a longstanding point of contention between the DOJ and the White House.\n“The DOJ and FBI reviewed the Epstein Files and reached the conclusion set out in the July 6 memo,” Bondi and Blanche said in a statement on Wednesday. “Nothing in the files warranted further investigation or prosecution, and we have filed a motion in court to unseal the underlying grand jury transcripts. As part of our routine briefing, we made the President aware of the findings.”\nThe White House has dismissed the ongoing focus on the Epstein files, arguing that it’s distracting from the administration’s accomplishments and aiding Democrats’ efforts to damage the president.\nBut a growing and bipartisan chorus of lawmakers have since called for a full release of the documents, forcing Republican leaders on Capitol Hill to cut short their legislative session to avoid taking a series of votes on the matter. But before leaving town, a House Oversight subcommittee voted Wednesday to subpoena the Department of Justice to release files related to Epstein.\nA Wall Street Journal report last week – about a letter bearing Trump’s name and the outline of a naked woman that was included in an album given to Epstein for his 50th birthday in 2003 – has also ratcheted up the pressure on Trump.\nTrump denied writing the letter and has since sued the Wall Street Journal over its publication of that article.\nCNN’s Kevin Liptak, Paula Reid and Kit Maher contributed to this report."
    }
  ],
  "argos_summary": "Survivors of Jeffrey Epstein's abuse are demanding recognition and justice as the Trump administration faces scrutiny over its handling of Epstein-related documents. Despite promises of transparency, key figures in the administration have been accused of prioritizing political concerns over the voices of victims, with no survivors represented in recent high-level meetings. The ongoing controversy raises questions about potential cover-ups and the administration's treatment of Epstein's accomplice, Ghislaine Maxwell, amid fears that political maneuvers could further harm the victims and their families.",
  "argos_id": "8OJE80DYQ"
}