{
  "url": "https://www.pcmag.com/how-to/how-to-figure-out-if-your-phone-has-malware",
  "authorsByline": "Jason Cohen",
  "articleId": "44f08c9138964d97aa3cd797bc5bc741",
  "source": {
    "domain": "pcmag.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.pcmag.com/imagery/articles/07fHtW1cqn1s2i0qpWTunob-1.fit_lim.size_1200x630.v1637180647.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T15:37:48+00:00",
  "addDate": "2025-08-08T15:47:15.811954+00:00",
  "refreshDate": "2025-08-08T15:47:15.811956+00:00",
  "score": 1.0,
  "title": "Could Your Phone Have Malware? Here's What to Look For and How to Remove it",
  "description": "Has your phone been acting up? Here's how to check if malware is to blame, and what to do if you're infected.",
  "content": "Your smartphone is like a mini computer that fits in your pocket, so—just like your laptop—it's also vulnerable to malware . On your mobile device, this can often take the form of spyware , adware, or ransomware .\n\nUnfortunately, it can sometimes be difficult to determine if your device has been infected. This is by design, since those behind the malware don't want you to find their software and remove it. That means it's up to you to look out for signs of troubling activity.\n\nAndroid is an open ecosystem by design, which has its benefits but also makes the operating system more vulnerable to malicious apps than Apple's iOS. Google has made progress here; a report from 2021 noted that bad actors have had to get more creative in order to get their malware-laden apps onto Android devices. But Trojan Horse dropper apps used to steal people's banking details still netted over 300,000 downloads in the Play Store in just four months that year.\n\nIf you have an iPhone, you may be thinking that none of this applies to you. After all, the idea that Macs don't get viruses certainly extends to all other Apple devices, right? Wrong. It's true that iPhones are less likely to get malware than Android phones thanks to Apple's rigorous approval process, but it doesn't mean they are immune. A recent study found that iPhone users are more reckless online than their Android counterparts, putting them at increased risk.\n\nAt the end of 2024, Kaspersky spotted malware in the App Store that could steal information from screenshots. Before that, spyware was found on iPhones belonging to Kaspersky employees and an Israeli firm was discovered using iCloud calendar to infect iPhones . So regardless of what mobile operating system you're running, it's important to stay alert. You never know when a seemingly innocuous app holds a nefarious payload.\n\nSo how can you actually tell if your phone has been infected with malware? It's not always obvious, but here are some things to watch out for:\n\nIf you're suddenly seeing a lot of ads in a specific app—or even when no apps are open—you may be infected with adware. These annoying pop-ups can generate money from ad clicks, try to infect you with worse malware, or link to scam offers. In 2023, Bitdefender found 60,000 Android apps on the Google Play Store were loaded with adware, so it's a fairly common issue. Whatever you do, don't click!\n\nTake a look at your phone bill or credit card statements and make sure you can account for every charge. If not, there's a chance you may be the victim of a scam called cramming , where unwanted services are added to your phone and charged to your phone bill. In the past, wireless carriers have been accused of looking the other way in some cases in order to pocket a percentage of the monthly rate, so the onus is on you to be diligent and catch any bogus charges.\n\nWhile batteries do degrade naturally over time , you shouldn't see a sudden shift in battery life with normal wear and tear. Malware may be hijacking your phone's components in order to perform background tasks, or even secretly play videos , resulting in the battery needing a recharge faster than expected.\n\nUnder normal circumstances, your phone should never be hot to the touch, but certain malware can overwork the internal CPU or charging mechanism. For example, the Loapi malware is capable of overheating—and even melting —your phone. If your phone is overheating , we recommend unplugging it from any power sources and turning it off. Left unattended, a hot phone can cause fires and even explode .\n\nIf your device has been hijacked, the malware may be overworking the components inside your phone and causing simple tasks to take longer than they should. Over the years, we have seen prank videos , Indian character symbols , software vulnerabilities , wallpaper , text strings , and App Store search terms crash phones, but if yours is suffering from a sudden slowdown, and even crashing, malware could be the reason.\n\nAn outgoing connection to a foreign server can interfere with your phone's ability to maintain a stable Wi-Fi or cellular connection, resulting in poor connection quality and frequent dropped calls. If other devices on the same network are working properly, and no one else is experiencing dropped calls, malware may be the culprit. (Poor call quality and invasive sounds may also be a sign your phone has been tapped , which is a separate issue.)\n\nSometimes an app you download can be loaded with malware that installs additional programs. Take a look at your app list and make sure you recognize and want everything on the phone. If you find something unexpected, don't open the app.\n\nYou've examined your phone and found something suspicious, or you have one or more symptoms of malware. Now what? Here are some steps you can take:\n\nIf you're on an Android phone , try safe mode. The process may vary depending on your phone maker, but most new devices require you to hold down the Power button, and then long-press Power Off until you get the option to enter safe mode. Similar to Safe Mode in Windows , this disables third-party apps so you can safely inspect anything out of the ordinary, remove any apps you think may be infected, then return to normal mode to see if the problem has been fixed.\n\nTo do this on an iPhone, your phone needs to be jailbroken, so it won't be a workable solution for most users. However, Apple has a feature called Lockdown Mode , which limits the device's functionality if you are being targeted by malware or hackers.\n\nIf you can't find anything by yourself, it's time to enlist a good antivirus, especially if you're using an Android device. But don't download just any free app with \"antivirus\" in its description. Many either don't work or are secretly malware themselves. Go with a trusted name in the security space, such as Bitdefender, Norton, or Avast, all of which have their own antivirus apps . We recommend investing in one, scanning for viruses, and allowing the program to remove any malware it finds.\n\nIf no other solution can be found to free your device from malware, your only choice may be to initiate a factory reset and start from scratch. This will wipe your phone clean and hopefully remove any malware in the process. If you have a backup of your phone from before it went on the fritz (and you should), you can try restoring from that point.\n\nOn an iPhone, head to Settings > General > Reset and erase the device. If you have a viable iCloud backup, you can follow our directions . Android owners may need to find instructions specific to their phone's manufacturer. Open Settings > General Management > Reset  >  Factory Data Reset (Samsung) or Settings > System > Reset options > Erase all data (Google) to get the job done. You can restore from a backup on Google Drive if you follow these directions .\n\nMalware is no joke. Avoid falling victim to an attack by being cautious about what you download. For instance, before you install anything, read reviews of the app carefully to make sure people are getting what's advertised, though be on the lookout for suspiciously high marks and repetitive reviews on no-name apps. It could be a pay-for-play situation, or worse. If an app presents you with an offer you might not have been expecting, or asks for personal information, think twice before handing it over.\n\nYou should also pay attention to the permissions you grant to your apps. As a general rule, only grant access to features you expect the app to need. If it's a messaging app, for instance, and asking to make phone calls or access your camera, that could be a bad sign. Android and iPhone users can access a permissions manager under their respective privacy settings.",
  "medium": "Article",
  "links": [
    "https://www.forbes.com/sites/zakdoffman/2024/06/01/google-android-warning-shows-why-apples-iphone-is-impossible-to-beat/",
    "https://www.pcmag.com/news/want-some-cramming-settlement-cash-from-verizon-sprint-hurry-up",
    "https://www.malwarebytes.com/blog/news/2025/07/iphone-vs-android-iphone-users-more-reckless-less-protected-online",
    "https://www.pcmag.com/how-to/how-to-back-up-and-restore-your-android-phone-or-tablet",
    "https://www.pcmag.com/how-to/how-to-watch-every-star-trek-movie-and-tv-show-in-order",
    "https://twitter.com/Jason00Cohen",
    "https://cc.pcmag.com/v1/otc/01r1WRIAJykbQgN4oGQ8FSi?merchant=04s9YWwL4pGgzdyO0u6daOI&url=https%3A%2F%2Fwww.awin1.com%2Fcread.php%3Fawinmid%3D18275%26awinaffid%3D221667%26ued%3Dhttps%253A%252F%252Fwww.backmarket.com%252Fen-us%252Fp%252Fiphone-14-128-gb-midnight-fully-unlocked-gsm-cdma%252F76c5d05a-79cc-42ed-91e4-7d35c710a85b%2523l%253D12&template=article-page&module=injected-offers-group&element=offer-group-link&item=text-link&position=5&element_label=Apple+iPhone+14+128GB+%28Verified+Refurbished+by+Back+Market%29&u=https%3A%2F%2Fwww.pcmag.com%2Fhow-to%2Fhow-to-figure-out-if-your-phone-has-malware&object_type=article&object_uuid=07fHtW1cqn1s2i0qpWTunob&product_uuid=06L9UUZ468ejyRYjqkhuwnq",
    "https://www.pcmag.com/news/rare-screenshot-grabbing-malware-found-on-apple-app-store",
    "https://www.pcmag.com/how-to/why-phones-explode-and-how-to-prevent-it-from-happening-to-you",
    "https://www.pcmag.com/news/a-string-of-text-is-crashing-iphones-ipads-apple-watch",
    "https://www.pcmag.com/picks/the-best-android-phones",
    "https://www.pcmag.com/news/google-pulls-6-fake-antivirus-apps-from-play-store-that-delivered-malware",
    "https://www.pcmag.com/cdn-cgi/l/email-protection#6903081a0607360a06010c0729190a04080e470a0604",
    "https://www.pcmag.com/news/if-you-type-these-4-characters-into-your-iphone-it-will-briefly-crash",
    "https://www.pcmag.com/news/a-wallpaper-can-crash-some-android-10-phones",
    "https://www.pcmag.com/news/this-indian-character-symbol-can-crash-your-iphone",
    "https://www.pcmag.com/how-to/how-to-start-windows-10-in-safe-mode",
    "https://www.pcmag.com/news/spyware-infects-iphones-belonging-to-employees-at-kaspersky",
    "https://www.pcmag.com/news/over-60000-android-apps-found-loaded-with-adware",
    "https://www.pcmag.com/how-to/how-to-tell-if-your-phone-is-being-tapped-what-to-do",
    "https://cc.pcmag.com/v1/otc/01r1WRIAJykbQgN4oGQ8FSi?merchant=05kie42h3YvHwjr4G1w80Qq&url=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB0D1ZFS9GH&template=article-page&module=injected-offers-group&element=offer-group-link&item=text-link&position=3&element_label=Moto+G+Stylus+5G+256GB+Unlocked+Phone%282024+Model%2C...&u=https%3A%2F%2Fwww.pcmag.com%2Fhow-to%2Fhow-to-figure-out-if-your-phone-has-malware&object_type=article&object_uuid=07fHtW1cqn1s2i0qpWTunob&product_uuid=024D5SI7jrqIGws0w21qWkn",
    "https://cc.pcmag.com/v1/otc/01r1WRIAJykbQgN4oGQ8FSi?merchant=05kie42h3YvHwjr4G1w80Qq&url=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB0DXHPNPYX%2Fref%3Dox_sc_act_title_1%3Fsmid%3DATVPDKIKX0DER%26psc%3D1&template=article-page&module=injected-offers-group&element=offer-group-link&item=text-link&position=4&element_label=Samsung+Galaxy+A36+5G+128GB+Unlocked+Phone+%28Awesome+Black%29&u=https%3A%2F%2Fwww.pcmag.com%2Fhow-to%2Fhow-to-figure-out-if-your-phone-has-malware&object_type=article&object_uuid=07fHtW1cqn1s2i0qpWTunob&product_uuid=04y1O4SpY28lwT3qkSQQbtx",
    "https://www.pcmag.com/how-to/what-to-do-if-your-phone-is-overheating",
    "https://www.pcmag.com/news/iphones-are-crashing-after-playing-3-second-prank-video",
    "https://www.pcmag.com/explainers/nintendo-switch-2-game-cards-vs-game-key-cards-vs-downloads-whats-the-difference",
    "https://www.pcmag.com/picks/the-best-ransomware-protection",
    "https://www.pcmag.com/news/bug-opened-whatsapp-to-app-crashing-malicious-messages",
    "https://www.pcmag.com/terms",
    "https://www.pcmag.com/how-to/how-to-turn-off-apple-live-photos-iphone-save-storage-space",
    "https://www.pcmag.com/how-to/run-diagnostics-on-your-iphone-or-android-phone",
    "https://www.pcmag.com/privacy",
    "https://www.pcmag.com/comparisons/android-vs-ios-which-mobile-os-is-best",
    "https://www.pcmag.com/how-to/12-simple-things-you-can-do-to-be-more-secure-online",
    "https://www.pcmag.com/how-to/back-up-and-restore-your-iphone",
    "https://www.pcmag.com/news/israeli-firm-using-spyware-to-infect-iphones-via-calendar-invites",
    "https://www.pcmag.com/picks/the-best-android-antivirus-apps",
    "https://www.pcmag.com/explainers/which-nintendo-switch-1-accessories-are-compatible-with-switch-2",
    "https://www.pcmag.com/how-to/how-to-view-saved-wi-fi-passwords-windows-mac-iphone-android",
    "https://www.pcmag.com/authors/jason-cohen",
    "https://www.pcmag.com/how-to/7-signs-you-have-malware-and-how-to-get-rid-of-it",
    "https://www.pcmag.com/news/this-android-malware-can-overheat-and-warp-your-phone",
    "https://www.pcmag.com/how-to/how-to-tell-if-you-need-a-new-iphone-battery",
    "https://www.fcc.gov/consumers/guides/understanding-your-telephone-bill",
    "https://www.pcmag.com/how-to/factory-reset-iphone-ipad-android-device",
    "https://cc.pcmag.com/v1/otc/01r1WRIAJykbQgN4oGQ8FSi?merchant=05kie42h3YvHwjr4G1w80Qq&url=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB0DYVMMM8C&template=article-page&module=injected-offers-group&element=offer-group-link&item=text-link&position=2&element_label=Samsung+Galaxy+S25+Edge+256GB+Unlocked+AI+Phone+%28T...&u=https%3A%2F%2Fwww.pcmag.com%2Fhow-to%2Fhow-to-figure-out-if-your-phone-has-malware&object_type=article&object_uuid=07fHtW1cqn1s2i0qpWTunob&product_uuid=07HzNW3JQotF7YgTBMx38fS",
    "https://www.pcmag.com/how-to/how-to-secure-your-iphone-ipad-or-mac-with-lockdown-mode",
    "https://www.pcmag.com/news/video-ad-fraud-has-been-draining-phone-batteries",
    "https://www.pcmag.com/picks/the-best-spyware-protection-security-software",
    "https://www.pcmag.com/news/android-malware-apps-get-extra-crafty-and-net-over-300000-installs",
    "https://cc.pcmag.com/v1/otc/01r1WRIAJykbQgN4oGQ8FSi?merchant=05kie42h3YvHwjr4G1w80Qq&url=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB0DVHV7X53&template=article-page&module=injected-offers-group&element=offer-group-link&item=text-link&position=1&element_label=Google+Pixel+9a+128GB+Unlocked+Phone+With+Gemini&u=https%3A%2F%2Fwww.pcmag.com%2Fhow-to%2Fhow-to-figure-out-if-your-phone-has-malware&object_type=article&object_uuid=07fHtW1cqn1s2i0qpWTunob&product_uuid=06FFZ6yNFVNG8k4Q3mO9onK"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Android phones",
      "weight": 0.09268928
    },
    {
      "name": "phone calls",
      "weight": 0.087070875
    },
    {
      "name": "phones",
      "weight": 0.08534018
    },
    {
      "name": "worse malware",
      "weight": 0.08144365
    },
    {
      "name": "Malware",
      "weight": 0.077665105
    },
    {
      "name": "malware",
      "weight": 0.077665105
    },
    {
      "name": "certain malware",
      "weight": 0.07621912
    },
    {
      "name": "malicious apps",
      "weight": 0.07449253
    },
    {
      "name": "Android devices",
      "weight": 0.070192024
    },
    {
      "name": "Trojan Horse dropper apps",
      "weight": 0.066406995
    }
  ],
  "topics": [
    {
      "name": "Security"
    },
    {
      "name": "Malware"
    },
    {
      "name": "Cyber Crime"
    },
    {
      "name": "Security Breach"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Computer Security/Network Security",
      "score": 0.708984375
    },
    {
      "name": "/News/Technology News",
      "score": 0.681640625
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.669921875
    },
    {
      "name": "/Computers & Electronics/Computer Security/Hacking & Cracking",
      "score": 0.47802734375
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Apps & Add-Ons",
      "score": 0.39453125
    },
    {
      "name": "/Computers & Electronics/Computer Security/Other",
      "score": 0.320556640625
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.309814453125
    }
  ],
  "sentiment": {
    "positive": 0.056793213,
    "negative": 0.6640625,
    "neutral": 0.27929688
  },
  "summary": "Malware can often be difficult to identify if your smartphone has been infected, as it often takes the form of spyware, adware, or ransomware. This is due to the nature of the malware, which is often hidden behind a screengrabbing app or an attempt to infect users with malicious software. However, these malware can be detected through pop-ups that generate money from ad clicks, or link to scams. If an app is loaded with malware, it can also be found to have additional programs installed. Take a look at your phone bill or credit card statements for potentially fraudulent charges. If a battery is overheating, the malware can cause fires and even explode. An outgoing connection to a foreign server can interfere with the phone's ability to maintain a stable Wi-Fi or maintain frequent calls.",
  "shortSummary": "Malware can be easily detected on mobile devices, requiring diligent monitoring for unexpected battery shortfalls, and potentially scamware targeting individuals.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3baea4528fb849dcb71f856146ac9dce",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.forbes.com/sites/zakdoffman/2024/06/01/google-android-warning-shows-why-apples-iphone-is-impossible-to-beat/",
      "text": "May was something of a confusing month for Android users. It started well, with a raft of exciting new updates, but by the end of the month everything seemed to have slipped backwards again, with Apple’s iPhone moving even further ahead.\nFirst came that tidal wave of security update news from Google, much of which was presented at its I/O event. This included a first-of-its-kind mainstream warning for cellular intercept and IMSI grabbing, more advanced theft protection, and the introduction of a “private space” to safeguard sensitive information for when a user’s phone gets into the wrong hands—be that thieves or just the kids.\nBut the update that’s likely to make the most difference to most users is Google’s “live threat detection,” using AI to “analyze behavioral signals related to the use of sensitive permissions and interactions with other apps and services. If suspicious behavior is discovered, Google Play Protect can send the app to Google for additional review and then warn users or disable the app if malicious behavior is confirmed.”\nGoogle is battling the perception that iPhone is a more secure, safer, more private ecosystem; and when it comes to the premium end of the market—and large swathes of the US market, it’s that iPhone halo that continues to really frustrate.\nBest High-Yield Savings Accounts Of 2024\nBest 5% Interest Savings Accounts of 2024\nIn reality, Google has been erecting ever higher fences around Play Store for years, and has slowly, subtly started to steer users away from the third-party stores that made Android so different to iPhone towards Play Store and its Protect shield.\nWhether or not these new innovations could be the magic bullet for Android, and whether or not users could start to feel more secure, the darker side of Android was back again come the end of May, ensuring the month ended on a very different note.\n“Over the past few months,” the team at Zscaler warned, “we identified and analyzed more than 90 malicious applications uploaded to the Google Play store. These malware-infected applications have collectively garnered over 5.5 million installs.”\nWhile the team flagged various malware families as a threat to Play Store users—Joker, Adware, Facestealer and Coper, it was Anatsa that was the highlight of its report. “This sophisticated malware employs dropper applications that appear benign to users, deceiving them into unwittingly installing the malicious payload. Once installed, Anatsa exfiltrates sensitive banking credentials and financial information from global financial applications. It achieves this through the use of overlay and accessibility techniques, allowing it to intercept and collect data discreetly.”\nI have already warned about Anatsa this year—the threat is not new. But the optics as regards Google and Play Store were badly timed given May’s Android security focus.\nThe Anatsa threat has remained broadly consistent, albeit Zscaler notes its US focus as well as UK/Europe, and that it is also now infecting users in Asia. Anatsa targets phones by way of a seemingly clean app, but one which is in fact a dropper that connects to an external server and pulls malware onto the device. “This strategic approach enables the malware to be uploaded to the official Google Play Store and evade detection.” The clean apps are the typical trivia that we all seem addicted to pulling onto our devices—PDF and QR code readers, for example.\nOnce installed, the Anatsa malware scans for target baking apps on the infected device, and then seeks to intercept login credentials and one-time SMS passcodes. Its approach includes an overlaid, ghost login page into which users an are tricked into entering their username and password.\nAnatsa is now one of the prevalent malware families that continue to plague Android users, and report after report confirm the scale of the Android threat versus iPhone. “The recent campaigns conducted by threat actors deploying the Anatsa banking trojan highlight the risks faced by Android users, in multiple geographic regions, who downloaded these malicious applications from the Google Play store.”\nIn response to the Zscaler report, Google told Bleeping Computer that “all of the identified malicious apps have been removed from Google Play,” and that “Google Play Protect also protects users by automatically removing or disabling apps known to contain this malware on Android devices with Google Play Services.”\nBut the challenge for Google is that this perception seems exceptionally difficult to counteract anytime soon. Already this year we have seen multiple Android warnings, and while Google assures that once aware of a threat it’s included in Play Protect’s hit list, the risk is that malware is still finding its way onto Play Store at much great volumes than Apple’s App Store, and only later is it identified and mitigated.\nIn parallel with Android’s new security updates, we’ll see the on-device/off-device battle as Apple, Google and Samsung seek to reassure that the brave new world of AI isn’t a privacy nightmare in the making. And there again, the challenge for Google and Android and Samsung by association will be overcoming Apple’s security and privacy credentials, and it’s no nonsense commitment to a privacy-first approach.\nAnd so all eyes on Android 15 and the difference if any that Google’s new mitigations might make to this threat landscape and the Android vs iPhone security perception.\nIt still looks like something of an impossible task…"
    },
    {
      "url": "https://www.malwarebytes.com/blog/news/2025/07/iphone-vs-android-iphone-users-more-reckless-less-protected-online",
      "text": "The smartphone wars have a winner, and it’s Android.\nNo, this isn’t about which device has the best camera, the snappiest processor, or the flashiest AI features—this is about which device owners are safer online, and in many ways, it is Android users who take the crown. According to a new analysis from Malwarebytes, when compared to iPhone users, Android users share less of their personal information for promotional deals, more frequently use security tools, and more regularly create and manage unique passwords for their many online accounts.\nThey also, it turns out, fall victim to fewer scams.\nThis is the latest investigation into research conducted earlier this year by Malwarebytes that surveyed 1,300 people over the age of 18 in the US, the UK, Austria, Germany, and Switzerland. In the original report released in June, Malwarebytes revealed how mobile scams have become a part of everyday life for most everyone across the globe—and how far too many individuals have essentially given up on trying to fight back.\nNow, Malwarebytes can reveal how iPhone and Android users differ when scrolling, shopping, and sending messages online. This secondary analysis has controlled for age, meaning that, while iPhone users did tend skew younger in the original data set, the differences identified here are more directly attributed to device type.\nHere are some of the key takeaways:\n- Apple users are more likely to engage in risky behavior.\n- 47% of iPhone users purchased an item from an unknown source because it offered the best price, compared to 40% of Android users.\n- 41% of iPhone users sent a Direct Message (DM) on social media to a company or seller account to get a discount or discount code, compared to 33% of Android users.\n- Apple users take fewer precautions online.\n- 21% of iPhone users said they use security software on their mobile phones, compared to 29% of Android users.\n- 35% of iPhone users choose unique passwords for their online accounts, compared to 41% of Android users.\n- Apple users are more likely to be the victims of scams.\n- 53% of iPhone users have fallen victim to a scam compared to 48% of Android users.\nImportantly, the behavioral splits here are largely device agnostic.\nAndroid users are not scanning fewer QR codes and iPhone users are not failing to make unique passwords because their respective devices are somehow incapable. Instead, iPhone users are making worse decisions about buying things online and about staying safe from all types of cyberthreats—whether that includes phishing attempts, social engineering scams, or malware infections.\nThe reasons for this are complex and hard to identify, but Malwarebytes’ original research can provide a clue. Namely, iPhone users were slightly more likely than Android users (55% compared to 50%) to agree with the following statement:\n“I trust the security measures on my mobile/phone to keep me safe.”\nThat trust could have an adverse effect, in that iPhone users do not feel the need to change their behavior when making online purchases, and they have less interest in (or may simply not know about) using additional cybersecurity measures, like antivirus.\nWhatever the reasons, there is room for improvement. As explained by Mark Beare, general manager of consumer business for Malwarebytes, staying safe online today cannot rely on any single platform, device, or operating system.\n“Devices and operating systems are just gateways to apps and websites, and it’s often those online spaces that present cyber risks,” Beare said. “When those websites or apps serve malicious or deceptive content, it’s up to the user to decide what’s real, what’s a scam, and where they should or shouldn’t click.”\nHere is where iPhone users should most pay attention when using the internet.\nUnsafe shopping\nIt’s getting harder to shop safely online.\nFor years, the cybersecurity industry warned people about the most obvious red flags when making a purchase or offering a donation online: Don’t click on unknown links, don’t share personal information, don’t send messages directly to strangers, and don’t scan QR codes that can lead to unknown locations. Behind all of these could lie malware, data theft, and even the slow start of a social engineering scam.\nAnd yet, in the past few years, even legitimate businesses have asked everyday consumers to do these same, reckless things. Online stores ask that people send a Direct Message (DM) on social media for a discount code, or that they sign up their email or phone number for a promotional offer, or that they complete their payment by scanning a QR code, or that they track an upcoming delivery by clicking on a link sent via text.\nJust because established businesses are leaning into these tactics does not make the tactics inherently safe, and unfortunately, iPhone users are pushing back the least.\nAccording to Malwarebytes’ recent analysis, 63% of iPhone users signed up their phone number for text messages so they could get a coupon, discount, free trial, or other promotional offer, compared to the 55% of Android users who did the same. Similarly, 41% of iPhone users “sent a DM on social media to a company or seller account to get a discount or discount code,” compared to 33% of Android users.\nMalwarebytes also found that 47% of iPhone users “purchased an item from an unknown website or supplier because it offered the best price,” compared to 40% of Android users.\nIn looking at the data, however, it is important to recognize that some of the behavior from iPhone users has been thrust upon them.\nFor example, 70% of iPhone users have “scanned a QR code to begin or complete a purchase.” Beginning in 2020, scanning a QR code became commonplace as restaurants across the world implemented several strategies to limit the spread of COVID-19. This practice isn’t the fault of iPhone users (or the 63% of Android users who have done the same), and they shouldn’t be “blamed” for what the world asked of them.\nHowever, sharing a phone number, sending a DM to a stranger, and buying from unknown websites are decidedly not requirements today for making an online purchase.\nAs Malwarebytes discussed on the Lock and Code podcast earlier this year, “data deals” in which consumers are asked to give up some of their privacy for a one-time discount are rarely, if ever, worth the cost. Separately, the most common start to a romance scam, job scam, or investment scam is through a DM sent on social media.\nThough legitimate companies have co-opted these strategies to boost engagement and revenue, the public still have an opportunity to push back. If they do not, there is a real risk that these marketing tactics become so normalized that online scammers will find it easier to send malicious messages, disguise their intentions, and steal from innocent people.\nNot so pro(active)\nEver since a devastatingly effective commercial was unveiled to the public some 20 years ago, there’s been a persistent belief that Apple devices are somehow impervious to viruses, malware, and all other nasty cyber infections.\nThe marketing ploy was wrong back then and it is still wrong today—Macs get plenty of viruses—but the damage is already done, and the consequences might be most visible in how iPhone users feel about traditional cybersecurity tools: In short, they don’t use them.\nAccording to Malwarebytes’ new analysis, just 21% of iPhone users said they use security software on their mobile phone, compared to 29% of Android users. iPhone users were also less likely than Android users to use an ad blocker (19% of iPhone users compared to 27% of Android users).\nThe data gaps here are sometimes benign. The low use of “ad blockers,” in particular, should come as no surprise. These tools are mostly understood as add-ons for desktop and laptop versions of popular web browsers—such as Google Chrome, Microsoft Edge, and Mozilla Firefox. While many mobile browsers have ad blockers built in by default, this may not be known to the average user.\nAlso remember that, as smartphone ownership increases across the globe, so do the numbers on smartphone “dependency.” According to Pew Research Center, 15% of adults in the US only have a smartphone to connect to the internet, meaning, perhaps, that 15% of people simply cannot access the same security and privacy tools that are developed predominantly for computers.\nThat said, the justifications for iPhone users start to fade when looking at one last number.\nOnly 35% of iPhone users “choose unique and strong passwords for accounts,” compared to 41% of Android users. Creating strong, unique passwords for online accounts is foundational to staying safe online, and it has only been made easier and more accessible over time.\nFor users who cannot remember a unique password for every account (which is every person alive), password managers are available—some for free—to help create, store, and recall as many strong passwords as needed. For users who do not trust a third-party password manager (understandably so), Apple released its “Passwords” app on iOS 18 nearly one year ago, making password management easier by default. And for users who don’t trust password managers (of which there are many), the antiquated practice of physically writing usernames and passwords in a private journal isn’t that outlandish.\nIn short, there is little excuse for failing to create and use unique passwords for every online account, and that goes for Android users, too. The technology can be intimidating, but it’s worth the work.\nSecurity for all\nThe measurably unsafe behavior of some iPhone users online comes with unfortunate, measurable consequences. The poor password hygiene, risky buying behavior, and limited antivirus protection are all paired with a higher overall rate of victimization—53% of iPhone users have fallen victim to a scam compared to 48% of Android users.\nIn the worst circumstances, these disparate rates could invite blame, but it’s the wrong conclusion to make. As any scam victim knows, the statistical analysis of victimization means absolutely nothing when you are personally trying to recover your money, your reputation, your private photos, and your sense of trust in the world around you.\nEvery person, no matter their device, should create unique passwords for individual accounts, use security products (which can also detect malicious websites and phishing schemes), and rely on friends and family when something doesn’t feel right online. And for those who want 24/7 guidance on strange messages, phone numbers, and more, there is always Malwarebytes Scam Guard to lead the way. Try it today."
    }
  ],
  "argos_summary": "Smartphones, akin to mini computers, are susceptible to malware such as spyware, adware, and ransomware, with Android devices being particularly vulnerable due to their open ecosystem. Despite iPhones being less prone to malware, recent studies indicate that iPhone users often engage in riskier online behaviors, leading to higher rates of scams compared to Android users. Signs of malware infection include unexpected ads, unusual charges, overheating, and performance slowdowns. Users are advised to be cautious about app permissions, utilize antivirus software, and consider factory resets if malware is suspected.",
  "argos_id": "8S4CTJSYQ"
}