{
  "url": "https://finance.yahoo.com/video/week-numbers-chips-drugs-donald-083556172.html",
  "authorsByline": "Reuters Videos",
  "articleId": "0b9af67cc10545298400daae054be758",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/video.reutersnews.com/1cf1c2586be0c3c244a1ca558b3d15af",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T08:35:56+00:00",
  "addDate": "2025-08-08T09:10:53.269668+00:00",
  "refreshDate": "2025-08-08T09:10:53.269673+00:00",
  "score": 1.0,
  "title": "The Week in Numbers: chips, drugs and Donald Trump",
  "description": "STORY: From a Trump tariff with a big get-out clause, to Apple’s bid to win favor in the White House, this is the Week in Numbers.GRAPHIC 100%100% is set to be the U.S. tariff on imported computer chips.But President Donald Trump included a big caveat in the move - it won’t apply to firms manufacturing in the U.S., or with firm plans to do so.“If you're building, there will be no charge. So I just want everyone to know that.”That appears to exempt companies like Taiwan giant TSMC.Trump also flagged coming duties on drugs, saying they could ultimately hit 250%. GRAPHIC $100 billion$100 billion is the extra U.S. investment pledged by Apple.The move could help the firm sidestep tariffs on imported iPhones.But analysts noted that Apple boss Tim Cook didn’t make any firm promise to shift production of the handsets:“The whole thing is just the final assembly that you're focused on and that will be elsewhere for a while.”GRAPHIC 16%16% was the cut to a profit outlook at Toyota.The world’s largest automaker says it expects the hit from tariffs to be near $10 billion.But the impact isn’t so worrying for all of Japan’s big exporters.Sony raised its profit outlook, saying the new duties weren’t as bad as feared.GRAPHIC 0.25%A quarter of a percentage point was the rate cut announced by Bank of England Governor Andrew Bailey:“Domestic price and wage pressures have generally continued to abate in recent months.”But policymakers had a hard time deciding, with two votes required for the first time ever.Hawks fear it’s no time for a cut, with inflation sticking stubbornly above the bank’s 2% target.GRAPHIC 55%And over 55% was the surge in shares for U.S. space startup Firefly Aerospace when it debuted on the Nasdaq.Traders snapped up shares in the first private firm to do a successful lunar landing.Analysts say it’s another sign of investor enthusiasm for companies aiding the expansion of U.S. space and defense programs.",
  "content": "STORY: From a Trump tariff with a big get-out clause, to Apple’s bid to win favor in the White House, this is the Week in Numbers.\n\n100% is set to be the U.S. tariff on imported computer chips.\n\nBut President Donald Trump included a big caveat in the move - it won’t apply to firms manufacturing in the U.S., or with firm plans to do so.\n\n“If you're building, there will be no charge. So I just want everyone to know that.”\n\nThat appears to exempt companies like Taiwan giant TSMC.\n\nTrump also flagged coming duties on drugs, saying they could ultimately hit 250%.\n\n$100 billion is the extra U.S. investment pledged by Apple.\n\nThe move could help the firm sidestep tariffs on imported iPhones.\n\nBut analysts noted that Apple boss Tim Cook didn’t make any firm promise to shift production of the handsets:\n\n“The whole thing is just the final assembly that you're focused on and that will be elsewhere for a while.”\n\n16% was the cut to a profit outlook at Toyota.\n\nThe world’s largest automaker says it expects the hit from tariffs to be near $10 billion.\n\nBut the impact isn’t so worrying for all of Japan’s big exporters.\n\nSony raised its profit outlook, saying the new duties weren’t as bad as feared.\n\nA quarter of a percentage point was the rate cut announced by Bank of England Governor Andrew Bailey:\n\n“Domestic price and wage pressures have generally continued to abate in recent months.”\n\nBut policymakers had a hard time deciding, with two votes required for the first time ever.\n\nHawks fear it’s no time for a cut, with inflation sticking stubbornly above the bank’s 2% target.\n\nAnd over 55% was the surge in shares for U.S. space startup Firefly Aerospace when it debuted on the Nasdaq.\n\nTraders snapped up shares in the first private firm to do a successful lunar landing.\n\nAnalysts say it’s another sign of investor enthusiasm for companies aiding the expansion of U.S. space and defense programs.",
  "medium": "Video",
  "links": [
    "https://finance.yahoo.com/video/under-armour-earnings-fed-gov-230000702.html",
    "https://finance.yahoo.com/video/tech-rally-apple-breakout-crypto-220000144.html",
    "https://finance.yahoo.com/video/modi-weighs-options-us-ties-003123191.html",
    "https://finance.yahoo.com/video/kalyan-jewellers-ed-business-expansion-045445625.html"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. space startup Firefly Aerospace",
      "weight": 0.08978643
    },
    {
      "name": "U.S.",
      "weight": 0.080541745
    },
    {
      "name": "Apple boss Tim Cook",
      "weight": 0.07329939
    },
    {
      "name": "President Donald Trump",
      "weight": 0.07255141
    },
    {
      "name": "Donald Trump",
      "weight": 0.070395514
    },
    {
      "name": "imported computer chips",
      "weight": 0.07029751
    },
    {
      "name": "tariffs",
      "weight": 0.064878955
    },
    {
      "name": "firms",
      "weight": 0.06364307
    },
    {
      "name": "firm plans",
      "weight": 0.06350729
    },
    {
      "name": "imported iPhones",
      "weight": 0.06108827
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9267578125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.89599609375
    },
    {
      "name": "/News/Technology News",
      "score": 0.8525390625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.81396484375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.7099609375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.44140625
    }
  ],
  "sentiment": {
    "positive": 0.14807129,
    "negative": 0.58935547,
    "neutral": 0.26245117
  },
  "summary": "The US President Donald Trump has issued a warning that a 100% tariff on imported computer chips will not apply to firms manufacturing in the U.S. or planning to do so, but this clause appears to exempt companies like Taiwan's TSMC. The additional $100 billion pledged by Apple could help the firm avoid tariffs on imported iPhones. However, Apple CEO Tim Cook did not promise to shift production of the handsets. The Bank of England announced a rate cut despite domestic price and wage pressures abating in recent months. The first private firm to perform a successful lunar landing, Firefly Aerospace, saw a surge in shares following its debut on the Nasdaq.",
  "shortSummary": "The week in Numbers features tariffs on imported computer chips, Apple's investment pledge, and a significant rise in shares of SpaceX and other notable companies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "039d82c6b1cd4aca86dbaef559a307c2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://finance.yahoo.com/video/under-armour-earnings-fed-gov-230000702.html",
      "text": "In This Article:\nYahoo Finance Markets Reporter Josh Schafer takes a look at the top stories for investors to watch on Friday, Aug. 8.\nIn the morning, Under Armour (UA), TeraWulf (WULF), Wendy's (WEN), and FuboTV (FUBO) will report quarterly earnings results.\nFriday is Federal Reserve Governor Adriana Kugler's last day after she announced her sudden resignation. Council of Economic Advisers chairman Dr. Stephen Miran will take Kugler's place as Fed governor.\nTo watch more expert insights and analysis on the latest market action, check out more Asking for a Trend.\nTime now for what to watch Friday, August 8th. Starting off on the earnings front. We'll be getting some more reporting from companies including Under Armour, TerraWolf, and Wendy's. Under Armour announcing results for the first quarter before the market opens. Analysts expecting the apparel company's overall sales to fall by a few percentage points. North America is expected to be weak due to fewer wholesale orders, cautious consumers, and continuing trade tensions. Moving over to Wendy's, the fast food restaurant chain reporting second quarter earnings before the opening bell. Analysts anticipating Wendy's global same-store sales to decline again as it did in the first quarter. Taking a look at the Federal Reserve, Fed Governor Adriana Kugler is finishing her final day as Fed governor on Friday. President Trump posting on Truth Social and nominating Stephen Miran, Council of Economic Advisors Chairman to serve in Kugler's seat as a Federal Reserve governor."
    },
    {
      "url": "https://finance.yahoo.com/video/tech-rally-apple-breakout-crypto-220000144.html",
      "text": "In This Article:\nYahoo Finance Markets and Data Editor Jared Blikre goes over the top takeaways from the trading day: the tech sector rally, Apple's (AAPL) key technical breakout, and what a potential Trump executive order could mean for crypto and private equity access in 401(k)s.\nTo watch more expert insights and analysis on the latest market action, check out more Asking for a Trend.\nStocks closing mixed as the Nasdaq jumps to a new closing high as tariffs kick in. For more on the trading day takeaways, let's get over to Yahoo Finance's Jared Blikre, who's here with me. Jared, takeaway one, what do we got?\nTech records, and let's take a look at that. So we got one from the NASDAQ 100 and the NASDAQ composite. It wasn't a big gain today, 35 basis points or about 1/3 of 1%, but as you can see from this year to date chart, looking good, up 10% off much more off of these lows here. And what was powering it? Guess what? The Mag 7 index itself and uh MAGS that ETF I think it's roundhill, but MAGS that got a record high. And you can thank Nvidia too, up 75 basis points. Nvidia got a nice little carve out at least traders think from the latest round of tariffs, and we can see right there, wasn't an intraday high, I don't think, but we did get that record closing high. So again, gets back to the AI trade. What has been working since October of 2022 is still working now. Not all the Mag 7 because you're going to see some red here. Microsoft took a backseat. Uh Berkshire Hathaway is not Mag 7 and that has just taken a dive since uh Warren Buffett announced his impending retirement. But even Apple here, and we'll get to that in a second. So it's been an impressive day from a limited standpoint.\nApple's been an interesting one, Jared, right? Because of how much it has lagged throughout the year, so to see it start to come back a little bit has sort of stuck out.\nYou bet, and guess what, there's a golden breakout here. And so we have uh I'm going to show you the 200 day moving average. That's one of my favorites. I'll move over to this board here, and I'm going to plug in that 200 day. We also have the 50 day, but the 200 day is the interesting one. Let me put um you can see it's just kissing it right here. I'm going to put a line so you can see this better at home. And we are right in the price territory. I'm a big believer in price moment uh price momentum and also price memory, and right here we're seeing price memory. All these people who jumped in over here, guess what? When they when liberation day and that fallout hit, they were left with big losses there. And so when price comes back up to that point, some of those people are going to get out at break even. A lot of people have that mentality. I don't recommend it, but that is nevertheless what happens. So right here against that 200 day moving average and with this price memory, we got a little bit of a pause and it'll be interesting to see if we can climb back into the green for the year, still down 12% there, Josh.\nAll right, Jared, looking for the breakout when it comes to Apple, I like that. Takeaway number three, what do we have?\nAll right, we got to talk about crypto in your 401k, and we could add private equity to that too. It looks like President Trump is set to do a signing order that's going to give the ability for 401Ks to admit, not only Bitcoin ETFs because we can only do already do that, but spot Bitcoin, spot crypto, and also private equity, and it looks like it's probably going to take six to 12 months for this to roll out. So it's not going to hit tomorrow, but I did think it was interesting. I had some I have some stocks in here. These are private equity stocks and also some uh crypto tickers. The crypto tickers got a nice little bump up on that. In fact, we saw them up earlier in the day, arguably was it due to this, hard to say, but I think uh you can see that in the Bitcoin price which we're going to talk talk see in a second.\nLet's get into the the the coin part share too because I think that's interesting, right? I know you were you were mentioning, uh sorry, the crypto coins themselves. You had mentioned Ethereum I think earlier, saw a pretty good pop today, right?\nYeah, so Bitcoin up 2%, Ethereum up 5%, and we're looking for 4,000. That's a really big level. I'm going to show you a six-year chart here so we can see. All right, it's just breaking out of this multi-year consolidation. That's very important technically. 4,000 probably leads us to 4,500, maybe beyond, but Ethereum we're going to be watching in the near future.\nEthereum breakouts been something here. Appreciate you joining us.\nYou bet."
    }
  ],
  "argos_summary": "The U.S. is implementing a 100% tariff on imported computer chips, exempting companies manufacturing in the U.S., which may benefit firms like TSMC. Apple has pledged $100 billion in U.S. investment to potentially avoid tariffs on iPhones, while Toyota has cut its profit outlook by 16% due to tariff impacts. The Bank of England announced a quarter-point rate cut amid ongoing inflation concerns, and shares of Firefly Aerospace surged over 55% following its successful lunar landing.",
  "argos_id": "8TI69QTSI"
}