{
  "url": "https://nypost.com/2025/08/08/sports/former-all-star-world-series-champ-alex-wood-retires-from-mlb/",
  "authorsByline": "Camden Markel",
  "articleId": "2ecec1ef638347edb123ff7a874fd845",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/57-san-francisco-giants-reacts-18816286.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T23:01:08+00:00",
  "addDate": "2025-08-08T23:02:46.875854+00:00",
  "refreshDate": "2025-08-08T23:02:46.875855+00:00",
  "score": 1.0,
  "title": "Former All-Star, World Series champ Alex Wood retires after 12 MLB seasons",
  "description": "The 34-year-old lefty played 12 seasons in the big leagues.",
  "content": "The 34-year-old lefty played 12 seasons in the big leagues, made one All-Star appearance and won one World Series.\n\nWood made his retirement official in a heartfelt Instagram post.\n\n“For over half my life, every decision I’ve made has centered around how it would impact my baseball career,” Wood wrote. “I’ve given every ounce of myself in pursuit of my lifelong dream of becoming a big leaguer. Playing 12 years in the show, reaching 7 postseasons, winning a World Series, and earning an All-Star selection — I never could’ve imagined it would turn out this way.”\n\nAfter a collegiate career at Georgia, Wood stayed local after being drafted by the Braves in the second round in 2012. He then made his debut for Atlanta in 2013 at 22 years old.\n\nWood posted a superb 3.10 ERA across 86 games with the Braves before being traded to Los Angeles, where he’d spend the next four seasons (2015-18) with the Dodgers.\n\nIn 2017, he made 25 starts for Los Angeles, posted a career-best 2.72 ERA and got his only All-Star nod of his career.\n\nWood spent 2019 with the Reds before returning to the Dodgers in 2020 and winning the World Series, pitching four innings in the Fall Classic and allowing no runs.\n\nHe joined the Giants at 30 years old and spent three solid seasons there before finishing his career with the Athletics in 2024.\n\n“To the Braves, Dodgers, Reds, Giants and Athletics — and your incredible fans — THANK YOU,” Wood wrote. “Playing for five iconic franchises and becoming part of those communities is something my family and I will always cherish.”\n\nWood also penned his emotional gratitude for his teammates, coaches, wife, parents, sons and his agency.\n\n“Baseball was my first love. Outside of God and my family, nothing else has shaped me the way this game has,” he added. “Even writing this, I can’t help but smile thinking about how much I still love the game after all this time.\n\n“To everyone who helped make this dream a reality that I couldn’t begin to list — if you think this is about you — IT IS. I love you and thank you. Cheers to what’s next. See you at the park!”",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/08/sports/new-video-shows-terrell-suggs-brandishing-gun-before-arrest/",
    "https://www.instagram.com/reel/DNGq8s8PRgB/?utm_source=ig_web_copy_link",
    "https://nypost.com/2025/08/08/sports/rob-gronkowski-replacing-jimmy-johnson-on-fox-nfl-sunday/",
    "https://nypost.com/2025/08/08/sports/roger-clemens-weighs-in-on-famous-mike-piazza-world-series-broken-bat-drama/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "World Series",
      "weight": 0.09266272
    },
    {
      "name": "Alex Wood",
      "weight": 0.092597954
    },
    {
      "name": "World Series champ",
      "weight": 0.09146934
    },
    {
      "name": "Wood",
      "weight": 0.08997659
    },
    {
      "name": "Former All-",
      "weight": 0.07686142
    },
    {
      "name": "Los Angeles",
      "weight": 0.069655076
    },
    {
      "name": "Star",
      "weight": 0.06863737
    },
    {
      "name": "Braves",
      "weight": 0.063569784
    },
    {
      "name": "his only All-Star nod",
      "weight": 0.06020022
    },
    {
      "name": "Dodgers",
      "weight": 0.053537264
    }
  ],
  "topics": [
    {
      "name": "MLB"
    },
    {
      "name": "Baseball"
    },
    {
      "name": "World Series"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9658203125
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.96240234375
    }
  ],
  "sentiment": {
    "positive": 0.55615234,
    "negative": 0.19384766,
    "neutral": 0.25048828
  },
  "summary": "Alex Wood, a 34-year-old lefty who played for 12 seasons in Major League Baseball, has announced his retirement from the sport in a heartfelt Instagram post. Wood played for five major league teams, including the Braves, Dodgers, Reds, Giants, and Athletics. He had one All-Star appearance and won one World Series. Wood was drafted by the Braves in 2012 and made his debut for Atlanta in 2013 at 22 years old. He posted a 3.10 ERA across 86 games with the Braves before being traded to Los Angeles, where he spent the next four seasons with the Dodgers. Wood also expressed his gratitude for his teammates, coaches, wife, parents, sons and agency.",
  "shortSummary": "Alex Wood retires from Major League Baseball after 12 seasons, including All-Star appearances, and winning the World Series.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "03ccf90f22d54754bb74c0fe5ac903f9",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/08/sports/roger-clemens-weighs-in-on-famous-mike-piazza-world-series-broken-bat-drama/",
      "text": "Two and a half decades later, Roger Clemens’ broken bat throw at Mike Piazza is still a defining moment of the Subway Series rivalry.\nWhile many were outraged and confused when Clemens took a chunk of Piazza’s broken bat and fired it into the ground right back at him, Clemens has set the record straight numerous times over the years and did so once again on the latest episode of Jack Curry’s “Yankees News & Views” podcast.\n“TV made it look like it was five feet from him,” Clemens said. “I didn’t think it was that close to the guy, and I definitely wasn’t throwing it at him. I tease people now … if I wanted to hit him with it, I could have hit him with it.”\nClemens detailed that the reason he fielded the bat in the first place was because his initial instinct was that the baseball was coming back at him.\n“So, I broke down into my wonderful fielding position, and wouldn’t ya know, that bat took two hops, came right up into my freaking lap, and I just grabbed it and whistled it on down to the on-deck circle,” he said.\nOf course, this led to mayhem as the benches cleared.\nWhile the broken bat and the ensuing chaos weren’t part of the plan, the fastball that shattered Piazza’s bat was.\n“Mike got in the box and I think my first three pitches were like 98, 98, 98. And I shattered his bat,” Clemens said. “The scouting report with [Yankees pitching coach] Mel Stottlemyre was great, too. We were in the trainer’s room going through the lineup, and when we got to Piazza, we said, ‘We’re gonna pitch him in. And we’re gonna pitch him in. And we’re gonna pitch him in.’”\nThe Yankees pitcher went on to retire Piazza with a ground ball out, and the Pinstripes took down the Mets 6-5 en route to their 4-1 2000 World Series win."
    },
    {
      "url": "https://nypost.com/2025/08/08/sports/new-video-shows-terrell-suggs-brandishing-gun-before-arrest/",
      "text": "A new video shows ex-NFL star Terrell Suggs brandishing a gun before he was arrested in April 2024 following an incident at a Starbucks in Arizona the month prior.\nThe video, published Friday by TMZ, shows the full altercation between Suggs and a man at the Starbucks drive-through, ending with Suggs dangling a gun out of his car’s window before driving away.\nThe incident began when the man alleged that Suggs backed his car up and hit his vehicle in an effort to get closer to the Starbucks intercom.\n“You just backed into me, man,” the man said, with Suggs responding: “Back the f–k up.”\nAfter some more back-and-forth, the man got out of his car and walked over to Suggs’ vehicle, with the former Ravens star stepping outside to confront him.\nSuggs went on to insist that he did not hit the man’s car before the two men got back into their respective vehicles.\nSuggs then picked up his order from the drive-through window and flipped the bird at the man through his car window as he started driving away.\nAfter some more jawing between the two men from their respective cars, Suggs asked, “Do you want to go?” multiple times before adding, “I’ll kill your b–ch ass.”\nThen, as he began driving out of the drive-through line, Suggs held the gun out of his window, staring back at the man.\nAfter an investigation, Maricopa County Police arrested Suggs and the 42-year-old was charged with one count of threatening or intimidating and one count of disorderly conduct.\nSuggs pleaded guilty to the disorderly conduct charge in February and was sentenced to 18 months of supervised probation.\nA rep for Suggs issued a statement to TMZ in the wake of the footage being released.\n“There was an incident at a Starbucks drive-through in which Terrell attempted to safely back out of the lane when the individual behind him became hostile and falsely accused Terrell of making contact with his vehicle, which did not occur,” Denise White told TMZ.\n“The situation escalated when the individual exited his car and approached Terrell in a confrontational manner. Notably, the individual had not placed an order in the Starbucks line, which led Terrell to believe he might continue to follow him, causing Terrell to feel threatened.”\nWhite added that “at no point” did her client “point a firearm at the individual, but that Suggs “made it clear that he was prepared to protect himself if necessary. Arizona is an open carry state, and Terrell is aware of the responsibilities that come with firearm ownership. He recognizes that he should not have displayed his weapon, but his actions were solely in response to feeling threatened and were not intended to escalate the situation further.”\nSuggs, who was an outside linebacker, is widely considered one of the best Ravens of all time.\nHe spent 16 of his 17 NFL seasons in Baltimore, earning seven Pro-Bowl selections and one All-Pro nod.\nThe Arizona State product also won the Super Bowl with Baltimore in 2012 and captured a second ring with the Chiefs in 2019."
    },
    {
      "url": "https://nypost.com/2025/08/08/sports/rob-gronkowski-replacing-jimmy-johnson-on-fox-nfl-sunday/",
      "text": "A familiar face is set to join the “Fox NFL Sunday” crew in a full-time capacity.\nFormer star tight end Rob Gronkowski will be replacing longtime analyst and former Cowboys coach Jimmy Johnson on the pregame show, the network announced Friday.\nJohnson, 82, announced he was retiring from the show in March after 31 years with the program.\nGronkowski has made guest appearances on “Fox NFL Sunday” in the past, but never in a full-time capacity.\nThe longtime Patriots star will join host Curt Menefee and Hall of Famers Terry Bradshaw, Howie Long and Michael Strahan on the show, along with NFL insider Jay Glazer.\nBradshaw and Long have been with the show since its inception in 1993.\nGronkowski, widely considered one of the greatest tight ends of all time, won four Super Bowls with Tom Brady — three with the Patriots and one with the Buccaneers.\nHe’s also a five-time Pro-Bowler and a four-time All-Pro selection.\nThe 36-year-old first got involved with Fox after his initial retirement in 2018, making his on-air debut on “Fox NFL Thursday” and appearing on Fox programming throughout the 2019 season.\nHe then un-retired and played two more seasons with Brady in Tampa Bay.\nHe got back into the media space after his official retirement, co-hosting the 2022 Kids’ Choice Awards with Miranda Cosgrove and co-hosting Fox’s New Year’s Eve show with Steve Harvey in 2024.\nGronkowski also made occasional appearances on Fox’s NFL programming.\nIn his new role, Gronkowski will also be able to call Brady a colleague once again, since the legendary quarterback is a game analyst with Fox’s NFL coverage.\nBrady, as part of Fox’s top broadcasting team with play-by-play announcer Kevin Burkhardt and sideline reporters Erin Andrews and Tom Rinaldi, will have the call for the Week 1 clash between the Commanders and Giants on Sept. 7, Fox Sports’ press release Friday also revealed."
    }
  ],
  "argos_summary": "Former MLB pitcher Alex Wood announced his retirement after a 12-season career, highlighted by an All-Star appearance and a World Series win with the Dodgers. Wood expressed gratitude to the teams he played for and the people who supported him throughout his journey. In other news, Terrell Suggs faced legal issues after a confrontation at a Starbucks, while Rob Gronkowski is set to join the 'Fox NFL Sunday' crew, replacing Jimmy Johnson.",
  "argos_id": "AA3TCQWYZ"
}