{
  "url": "https://www.techtimes.com/articles/311567/20250807/gta-6-take-two-ceo-strauss-zelnick-shares-his-thoughts-rumored-pricing.htm",
  "authorsByline": "Bella Javier Liamzon",
  "articleId": "77636d7987c04261a9e09c6f39827933",
  "source": {
    "domain": "techtimes.com",
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://d.techtimes.com/en/full/458748/jason-duval.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T22:36:21-04:00",
  "addDate": "2025-08-08T02:56:58.430271+00:00",
  "refreshDate": "2025-08-08T02:56:58.430272+00:00",
  "score": 1.0,
  "title": "'GTA 6': Take-Two CEO Strauss Zelnick Shares His Thoughts on Rumored Pricing",
  "description": "Take-Two Interactive CEO Strauss Zelnick has given his thoughts regarding rumors that Grand Theft Auto 6 will be priced at $100.",
  "content": "As gamers all around the world continue to wait for the 2026 arrival of \"Grand Theft Auto 6,\" rumors have continuously persisted regarding its pricing.\n\nSpecifically, it has been long rumored that the much-anticipated game will be priced at a whopping $100.\n\nIn a new development, Take-Two Interactive CEO Strauss Zelnick has shared his opinion regarding the rumored pricing, and it may make fans breathe a sigh of relief.\n\nSpeaking during Take-Two's August 7 investor call, Zelnick said that he thinks that their \"approach may be a little bit different\" when asked about pricing the game at $80.\n\n\"We believe that any consumer experience is the intersection of the thing itself and what you paid for the thing. So our goal is to vastly exceed expectations,\" Zelnick said, according to a report by GameSpot. \"We want to put out the best entertainment on Earth, and we want to deliver more value than what we charge for it. We think we've generally speaking, gotten that right.\"\n\n\"You know, most Frontline releases will go out at a higher price, sometimes with special editions, and then over time usually the price is discounted to optimize for the largest possible market,\" he added. \"And I don't think that's going to change anytime soon.\"\n\nWhat We Know About 'GTA 6'\n\nWhile the gaming world continues to speculate about the pricing of 'GTA 6,' what is definitely confirmed is its release date.\n\nThe eighth main \"Grand Theft Auto\" game was initially anticipated for this year, but Rockstar Games (whose parent company is Take-Two Interactive) moved the release date to May 26, 2026.\n\nThe game will follow the story of Jason Duval and Lucia Caminos and will be set in the fictional state of Leonida.\n\n\"GTA 6\" will be an open-world game, which will let players explore the state of Leonida, which is heavily based on Florida.",
  "medium": "Article",
  "links": [
    "https://www.player.one/gta-6-take-two-ceo-strauss-zelnick-shares-his-thoughts-rumored-pricing-161173",
    "https://www.player.one/gta-vi-update-rockstars-hiring-hints-no-more-delays-games-may-2026-release-161017",
    "https://www.gamespot.com/articles/take-two-boss-addresses-rumored-price-hike-for-grand-theft-auto-6/1100-6533788/?ftag=CAD-01-10abi2f"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Strauss Zelnick",
      "weight": 0.090159655
    },
    {
      "name": "Grand Theft Auto",
      "weight": 0.085943274
    },
    {
      "name": "Rumored Pricing",
      "weight": 0.085423194
    },
    {
      "name": "Zelnick",
      "weight": 0.07887111
    },
    {
      "name": "Take-Two Interactive CEO Strauss Zelnick",
      "weight": 0.07873781
    },
    {
      "name": "Take-Two CEO Strauss Zelnick",
      "weight": 0.07516754
    },
    {
      "name": "most Frontline releases",
      "weight": 0.07363337
    },
    {
      "name": "GTA",
      "weight": 0.06332219
    },
    {
      "name": "Lucia Caminos",
      "weight": 0.061620884
    },
    {
      "name": "Jason Duval",
      "weight": 0.06144594
    }
  ],
  "topics": [
    {
      "name": "Business Leaders"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.95361328125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.8017578125
    },
    {
      "name": "/Games/Computer & Video Games/Action & Platform Games",
      "score": 0.658203125
    },
    {
      "name": "/Games/Computer & Video Games/Adventure Games",
      "score": 0.56787109375
    },
    {
      "name": "/Games/Computer & Video Games/Video Game Development",
      "score": 0.417236328125
    },
    {
      "name": "/Games/Roleplaying Games",
      "score": 0.40185546875
    }
  ],
  "sentiment": {
    "positive": 0.36621094,
    "negative": 0.10888672,
    "neutral": 0.52490234
  },
  "summary": "Take-Two Interactive CEO Strauss Zelnick has commented on rumors that \"Grand Theft Auto 6\" will be priced at $100. Speaking during an investor call, Zelnick suggested that Take-Two's approach may be different from that of pricing the game at $80. He stated that the company's goal is to exceed expectations and deliver more value than what they charge for. Zelnick also noted that most Frontline releases will initially go out at a higher price, sometimes with special editions, and then usually discounted to optimize for the largest possible market. The release date for \"GTA 6\" has been confirmed, with the game set in the fictional state of Leonida.",
  "shortSummary": "Take-Two Interactive CEO Strauss Zelnick discusses the likely $100 pricing of \"Grand Theft Auto 6,\" emphasizing the game's aim of delivering better value and exceed expectations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "c1ed753876be4fc1b0d0dec99d6c01f8",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.player.one/gta-vi-update-rockstars-hiring-hints-no-more-delays-games-may-2026-release-161017",
      "text": "New reports suggest that there is no more stopping \"Grand Theft Auto VI\" from releasing in May 2026, the latest schedule that the company confirmed for the highly anticipated game's arrival.\nThere was a recent update discovered from Rockstar Games, and according to reports, this shared hints that the game is set for its latest release date timeline.\nIt took a long time for Rockstar Games to develop its next-generation game that takes users back to Vice City. Unfortunately, the company delayed the game's release date.\n'GTA VI' Update Hints No More Delays for Release\nComicBook Gaming shared a new report that spotted a recent post by Rockstar Games on its careers website that shows that the company is looking to fill global marketing positions for the upcoming \"Grand Theft Auto VI\" game.\nThe hint comes in the form of 12-month contracts being offered to potential applicants. This means that Rockstar Games only needs these marketing staffers to work for the company until next summer, suggesting that the short-term employment is only meant to focus on promoting its upcoming sequel.\nThe game is still set for a May 26, 2026, release date, and based on the job listings, Rockstar Games would only market the around the time that it will be globally available and several months after that. The position's contract timeline suggests that the studio is committed to the May 2026 timeline, and it is not changing anytime soon.\nRockstar Games: 'GTA VI' for May 2026\nThere is still no official word from Rockstar Games or any aggressive marketing on their end regarding the anticipated sequel, so it means that the game is following its planned release schedule.\n\"Grand Theft Auto VI\" has been delayed because of its development and the need to finalize more elements of the game as it was initially set for a Fall 2025 release. This already caused different developers and game makers to either go ahead or postpone their releases to make way for a title as large as \"GTA VI,\" but they had the rug pulled under them when Rockstar announced its delay.\nThe world already awaits \"GTA VI\" and its promised May 2026 release date, giving players the new story featuring the star-crossed lovers and all that Vice City has to offer."
    },
    {
      "url": "https://www.gamespot.com/articles/take-two-boss-addresses-rumored-price-hike-for-grand-theft-auto-6/1100-6533788/?ftag=CAD-01-10abi2f",
      "text": "Take-Two Boss Addresses Rumored Price Hike For Grand Theft Auto 6\nCEO Strauss Zelnick was noncommittal about the rumored $80 price tag for GTA 6 during Take-Two's recent earnings call.\nThere's been a lot of speculation about the cost of Grand Theft Auto 6, with some companies hoping that it will debut at $100 to open the door for more games to drop at that price. The current ceiling for gaming prices appears to be $80, but Strauss Zelnick--the CEO of Rockstar Games' parent company, Take-Two Interactive--doesn't seem to be very enthusiastic about raising the price for GTA 6.\n\"I think our approach may be a little bit different,\" replied Zelnick when asked about pricing GTA 6 at $80 during Take-Two's August 7 investor call. \"We believe that any consumer experience is the intersection of the thing itself and what you paid for the thing. So our goal is to vastly exceed expectations. We want to put out the best entertainment on Earth, and we want to deliver more value than what we charge for it. We think we've generally speaking, gotten that right.\"\n\"Variable pricing has been the nature of this industry forever,\" added Zelnick. \"You know, most Frontline releases will go out at a higher price, sometimes with special editions, and then over time usually the price is discounted to optimize for the largest possible market. And I don't think that's going to change anytime soon ... The rubric that informs us is really that of delivering more value than what we charge.\"\nEarlier this week, Alinea Analytics' Rhys Elliott laid out a similar argument about why it's a bad idea to launch GTA 6 at $100. Elliot suggests that GTA Online is the real cash cow for the franchise, and Rockstar can't risk alienating the players who have stayed with the game for well over a decade now. He also noted that a higher price point raises the risk of players sticking with GTA 5 over its much-anticipated sequel.\nIn other GTA news, former Rockstar employee--and longtime in-game DJ--Lazlow Jones recently revealed he's unlikely to return for GTA 6. However, real-world musicians may still have a few radio stations of their own in the upcoming sequel.\nGrand Theft Auto 6 will hit PlayStation 5 and Xbox Series X|S on May 26, 2026.\nGot a news tip or want to contact us directly? Email news@gamespot.com\nJoin the conversation"
    },
    {
      "url": "https://www.player.one/gta-6-take-two-ceo-strauss-zelnick-shares-his-thoughts-rumored-pricing-161173",
      "text": "As gamers all around the world continue to wait for the 2026 arrival of \"Grand Theft Auto 6,\" rumors have continuously persisted regarding its pricing.\nSpecifically, it has been long rumored that the much-anticipated game will be priced at a whopping $100.\nIn a new development, Take-Two Interactive CEO Strauss Zelnick has shared his opinion regarding the rumored pricing, and it may make fans breathe a sigh of relief.\nZelnick on Rumors Regarding 'GTA 6' Pricing\nSpeaking during Take-Two's August 7 investor call, Zelnick said that he thinks that their \"approach may be a little bit different\" when asked about pricing the game at $80.\n\"We believe that any consumer experience is the intersection of the thing itself and what you paid for the thing. So our goal is to vastly exceed expectations,\" Zelnick said, according to a report by GameSpot. \"We want to put out the best entertainment on Earth, and we want to deliver more value than what we charge for it. We think we've generally speaking, gotten that right.\"\n\"You know, most Frontline releases will go out at a higher price, sometimes with special editions, and then over time usually the price is discounted to optimize for the largest possible market,\" he added. \"And I don't think that's going to change anytime soon.\"\nWhat We Know About 'GTA 6'\nWhile the gaming world continues to speculate about the pricing of 'GTA 6,' what is definitely confirmed is its release date.\nThe eighth main \"Grand Theft Auto\" game was initially anticipated for this year, but Rockstar Games (whose parent company is Take-Two Interactive) moved the release date to May 26, 2026.\nThe game will follow the story of Jason Duval and Lucia Caminos and will be set in the fictional state of Leonida.\n\"GTA 6\" will be an open-world game, which will let players explore the state of Leonida, which is heavily based on Florida."
    }
  ],
  "argos_summary": "As anticipation builds for the release of \"Grand Theft Auto 6\" on May 26, 2026, speculation about its pricing continues, with rumors suggesting a potential price of $100. Take-Two Interactive CEO Strauss Zelnick addressed these rumors during an investor call, indicating that their pricing strategy may differ and emphasizing their goal to exceed consumer expectations. The game will feature a storyline centered around characters Jason Duval and Lucia Caminos, set in the fictional state of Leonida, inspired by Florida.",
  "argos_id": "ABOZ0X43F"
}