{
  "url": "https://www.yahoo.com/lifestyle/articles/tried-5-free-apps-learn-210000615.html",
  "authorsByline": "Jennifer Prince",
  "articleId": "11cd37ac210344cb8ba2796d3b8418ac",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/1e79ce409657cd17ebeb2c44ccbd291e8d6fe29bbbb2f8dcd31d64ef7a1f3cc8/ynews/resizefill_w1200/https://media.zenfs.com/en/apartment_therapy_269/9118f5e87e65fd5aafec484f5b7749fd",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T16:45:20+00:00",
  "addDate": "2025-08-08T17:14:52.399559+00:00",
  "refreshDate": "2025-08-08T17:14:52.399561+00:00",
  "score": 1.0,
  "title": "I Tried 5 Free Apps to Learn Spanish — Here’s the One I Actually Use Every Day",
  "description": "It just takes a few minutes a day.",
  "content": "This article may contain affiliate links that Yahoo and/or the publisher may receive a commission from if you buy a product or service through those links.\n\nAfter taking two years of Spanish in high school, I’ve often regretted not delving further into the language. Sure, I’ve been able to ask for directions and order specialty coffees while traveling in Mexico and Spain, but every time I travel to a Spanish-speaking country, I wish I knew more. But learning a language seemed like such a lofty task — until I added the best app to learn Spanish to my phone.\n\nWith a smartphone in hand, you can download free apps to sharpen your skills and learn how to converse in another language in just a few minutes a day. Over four days, I put several language apps to the test. Most of my recommendations also have paid versions, but if you don’t want to spend a dime, here’s what I liked (and didn’t like) about the five best free language learning apps. I’ve ranked them all, with my pick for the best app to learn Spanish in first place.\n\nBack in 2017, I tried Duolingo and quickly deleted it — the daily reminders made me feel guilty. However, after giving it a second chance, I love it. (I nixed the daily reminders this time around.)\n• None It includes over 40 languages, such as Spanish, Chinese, Hebrew, Hindi, Latin, and Russian.\n• None Duolingo teaches languages through reading, listening, and speaking in the target language.\n• None Daily reminders are helpful for consistency’s sake, but you can turn them off if you find them annoying.\n• None Duolingo takes a fun, gamelike approach, so you’re learning without feeling like you’re back in grade school.\n\nIt’s a fun and interactive way to learn with a well-rounded approach. For example, cute characters like a bear wearing a blue scarf or a man in ’80s-style workout gear clap and dance when you answer correctly, making it a visually pleasing way to practice. You earn points for correct answers, lesson completion, and consistent practice. The points don’t turn into physical rewards, but they are extra motivation to tap in every day. I was able to learn quickly and retain words and phrases easily.\n\nPros: Rewards keep you motivated, and they also give you access to paid-only features. You get opportunities to review missed lessons to help correct wrong answers. There’s also an end-of-year review that recaps all your progress.\n\n\n\nCons: The speaking section isn’t spot-on. For example, the first time I was asked to speak, I said, “I have no idea what I’m doing,” which the app then oddly counted as the correct pronunciation of the Spanish phrase I was asked to repeat. But the app seemed to be more accurate from then on.\n\nThere is a 100% chance that I’ll keep using this app. I believe it’s one of the best free language-learning apps out there. In fact, I personally found it to be the best app to learn Spanish.\n\nWhat impressed me when I registered for Drops was that it asked me questions, such as my age and interests, so that it could tailor content to words I’d likely use. My lessons featured pets and travel, both of which I listed as interests.\n• None If you’re interested in reading and writing, the app also highlights proper spelling by encouraging users to drag and drop parts of words to form the whole.\n• None Serious learners can purchase a lifetime plan for $159.99 to learn multiple languages or become an expert in a single language.\n• None It features bite-size lessons with spaced learning, meaning that words learned early on will periodically reappear for reinforcement.\n\nThe lessons focus on memorizing words through reinforcement, which is perfect for beginners like me. I found the colors and drag-and-drop word associations to be helpful to solidify meanings in my mind.\n\n\n\nPros: My word retention was high due to the multiple ways they were presented, such as completing word chains and placing word parts in their correct order. I also found this app to be one of the least frustrating — it introduces words, instead of phrases, to beginners.\n\n\n\nCons: If you want to learn a language quickly, know that the free version of this app only lets you practice for five minutes a day. You can upgrade for $69.99 per year (or $12.99 a month) if you’d like to use Drops for an extended period.\n\nI loved Drops, so I’m pressing forward with my complementary lessons without upgrading to the free version. Five minutes a day is just enough to keep me consistent.\n\nIf you’re constantly bumping up against your phone’s storage limit like I am, you can still use your smartphone to learn via Readlang, which is a website that teaches language by translating content written in your native language to the language you are trying to learn.\n\nChoose fiction or nonfiction stories, songs, YouTube videos, or inspirational talks as you listen to and read the words in your selected language. Any terms that you choose to translate are automatically added to a list and put on a flash card for further practice. Not only is the premise creative, but it’s easy to reinforce what you’ve learned.\n• None You can import books, articles, and more to read pieces in the language you’re trying to learn.\n• None Users can easily translate web pages to test their skills.\n• None The app also includes a mode for speaking and a video player for those who prefer audio-related learning.\n\nAs a beginner, I waded through the practice part of Readlang, which focuses on words and short phrases, providing detailed descriptions of how to use each word and what it exactly means.\n\n\n\nPros: A variety of works are available within each genre, meaning you can choose topics that interest you.\n\n\n\nCons: I feel this is more suitable for advanced learners or those who can easily absorb information by listening to many words rather than completing drills and learning just a few words at a time. The free version comes with unlimited text uploads and word translations, though some of the features are locked behind the premium version.\n\nBecause I’m a beginner, I will put Readlang aside for now, but I may revisit it later. I really love the concept of this app, but it’s way too advanced for me for now. However, if you already know a bit of the language, this could be the best app to learn Spanish for mid-level speakers and beyond.\n\nIf learning through videos and real-life scenarios is helpful for you, then Memrise is worth considering. Featuring filmed conversations, entertaining (and sometimes corny) situational videos, and word identification exercises, this app is a hands-on way to immerse yourself in a language and prepare for travel.\n• None Memrise currently has 23 languages, including Spanish, Danish, Korean, Mongolian, Portuguese, and Swedish.\n• None If you’re already familiar with particular words and phrases, you can indicate that you know certain vocabulary and move on quickly.\n• None Instead of a bot, Memrise has real people speaking words, so you can practice proper pronunciation and inflection.\n• None The app features flash card-style learning, paired with videos and audio examples to cater to diverse learning styles.\n\nMemrise has users practice recalling words presented in the video until they can get a word or phrase correct, which I initially found frustrating but eventually appreciated, as it ultimately helped me retain the information.\n\n\n\nPros: Different actors appear in the videos, making the nuances of language, such as cadence and pitch, helpful for really solidifying memorization in realistic circumstances.\n\n\n\nCons: There are several prompts to upgrade to the pro version, which was distracting and caused me to lose focus between lessons.\n\nI didn’t keep Memrise because the videos didn’t help me learn as much as other app styles, but they could be right for you. I also think it could be better for non-beginners who are looking to form sentences and have conversations, or those who really like using flash cards to build their vocabulary.\n\nBusuu features videos with real people speaking words and phrases to help prepare users for hearing various vocal inflections. This app is part language learning and part social networking, and the community feature connects you with native speakers to help hone your accent or get feedback.\n• None The app uses AI to help personalize lessons according to your pace and performance.\n• None Busuu’s global community helps users interact with native speakers, who will also offer feedback on speaking and writing.\n• None If you’re on the go or without WiFi, you can use the app offline or download lessons to use when off the grid.\n\nEach lesson is just a few minutes long and focuses on perfecting a phrase by listening, reading, and speaking it. I only used the free trial (which lasts 30 days), which was enough for my purposes, and I didn’t explore upgrading.\n\n\n\nPros: The videos are short and sweet, and phrases are presented in memorizable chunks to not overwhelm new learners.\n\n\n\nCons: The free version is annoying, since you have to watch an ad (usually a gaming video) to progress through the lessons, which wastes time that could be spent learning.\n\nUnfortunately, I promptly deleted Busuu, although I feel guilty because I did connect to the community, which can enhance the experience. For me, the best app to learn Spanish just doesn’t need a social networking aspect — I want something I can consistently spend a handful of minutes of time on each day.\n\nNote: I tested but ultimately didn’t recommend free versions of apps that required upgrading after a short trial. I also tried HelloTalk, which is free and has paid ad-free versions, but I found the networking intimidating, especially as I was inundated with hello “waves” from others (mostly members of the opposite sex) immediately upon joining. However, users rave about the personal connection aspect.\n\nWe Used Our New “Room Plan” Tool to Give This Living Room 3 Distinct Styles — See How, Then Try It Yourself\n\nThe Design Changemakers to Know in 2025\n\nCreate Your Own 3D Room Plan with Our New Tool\n\nSign up for Apartment Therapy's Daily email newsletter to receive our favorite posts, tours, products, and shopping guides in your inbox.",
  "medium": "Article",
  "links": [
    "https://www.apartmenttherapy.com/room-plan?utm_source=yahoosyndication&utm_medium=referral-distro",
    "https://www.memrise.com/",
    "https://readlang.com/pricing",
    "https://www.apartmenttherapy.com/we-used-our-new-room-plan-tool-to-give-this-living-room-3-distinct-styles-see-how-then-try-it-yourself-37483818?utm_source=yahoosyndication&utm_medium=referral-distro",
    "https://www.hellotalk.com/?lang=en",
    "https://www.duolingo.com/",
    "https://www.apartmenttherapy.com/email/at-daily-yahoo",
    "https://shopping.yahoo.com/rdlw?merchantId=f95db840-bd07-4abd-abb7-44fc6b69d102&siteId=us-y4p&pageId=1p-autolink&contentUuid=24c481cf-e752-35bc-ae31-57f816d53bf7&featureId=text-link&merchantName=Busuu&linkText=Busuu&custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5idXN1dS5jb20vZW4tdXMiLCJjb250ZW50VXVpZCI6IjI0YzQ4MWNmLWU3NTItMzViYy1hZTMxLTU3ZjgxNmQ1M2JmNyIsIm9yaWdpbmFsVXJsIjoiaHR0cHM6Ly93d3cuYnVzdXUuY29tL2VuLXVzIn0&signature=AQAAAZbYsSHMg0RBTAktvA67O_xwv3344wb0ZSSTPdW3Rc7O&gcReferrer=https%3A%2F%2Fwww.busuu.com%2Fen-us&source=commerce-vampire-v3-desktop&bucketId=vamp_v3_test&affiliateRoutingRule=vampireV3",
    "https://www.apartmenttherapy.com/hard-words-to-spell-37330452?utm_source=yahoosyndication&utm_medium=referral-distro",
    "https://www.apartmenttherapy.com/souvenir-bring-home-travel-37234886?utm_source=yahoosyndication&utm_medium=referral-distro",
    "https://languagedrops.com/",
    "https://www.apartmenttherapy.com/features/design-changemakers-2025?utm_source=yahoosyndication&utm_medium=referral-distro",
    "https://readlang.com/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "several language apps",
      "weight": 0.083577156
    },
    {
      "name": "free apps",
      "weight": 0.08058077
    },
    {
      "name": "word parts",
      "weight": 0.073587
    },
    {
      "name": "words",
      "weight": 0.070378505
    },
    {
      "name": "other app styles",
      "weight": 0.070151344
    },
    {
      "name": "part language learning",
      "weight": 0.069735825
    },
    {
      "name": "apps",
      "weight": 0.06940174
    },
    {
      "name": "word translations",
      "weight": 0.068980195
    },
    {
      "name": "many words",
      "weight": 0.068789266
    },
    {
      "name": "particular words",
      "weight": 0.068702176
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Lifestyle"
    }
  ],
  "taxonomies": [
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.57421875
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Apps & Add-Ons",
      "score": 0.451416015625
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.3798828125
    }
  ],
  "sentiment": {
    "positive": 0.22546387,
    "negative": 0.3527832,
    "neutral": 0.42138672
  },
  "summary": "Yahoo and the publisher may receive a commission from Yahoo and/or the publisher if you buy a product or service through these links. The author tested five free language learning apps, including Duolingo, which includes over 40 languages and teaches languages through reading, listening, and speaking in the target language. Despite initially disliking the daily reminders, Duoingo has since become an effective tool for Spanish learning. The app rewards students with points for correct answers, lesson completion, and consistent practice, while rewards keep you motivated and give you access to paid-only features. However, the speaking section of the speaking sections was criticized for being lacking. The cost of the paid version of Drops was $69.99 per year or $12.99 if you use an extended period of practice for five minutes a day.",
  "shortSummary": "Despite its features, free Spanish learning apps like Duolingo and Drops are essential for learning quickly, engaging, and rewarding, despite some features that may deter some users.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4af7c152912a453fb9094c6972a5d4b7",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://languagedrops.com/",
      "text": "Our language learning activities are fast, fun, and highly effective. Build your skills and learn words for conversations in just five minutes a day!\nWith over 5,000 words and phrases to learn, you’ll improve your vocabulary and feel ready to practice conversations and tackle everyday topics.\nEnjoy flexible learning that lets you build your language skills at your own pace. Plus, helpful reminders and streaks keep you on track as you progress.\nBoost your pronunciation and listening skills so you feel confident communicating effectively in any situation.\n\"Love my fun language learning and practice with daily Drops sessions, and monthly Challenges to participate in, and quiz mode to test contextual learning - brilliant! So much thought, consideration and inclusivity has gone into the design and function of this app, I can't praise it highly enough.\"\n\"Great little learning app! I've learned at least 5-10 new words in Spanish in my first 5 minutes. Easy to pick up and thorough.\"\n\"Great language learning app! It helps you get daily words done in a short amount of time. I would highly recommend using drops to learn whatever language you want to learn.\"\n\"What an amazing app! I’ve tried several apps for language learning and I cannot recommend Drops enough. I don’t know how a short Drops session can teach me as much as 1 hour+ of focused use of other apps, it’s like magic.\"\n\"Amazing language learning tool. Excellent app for increasing vocabulary in your foreign language of choice. Useful for beginner, intermediate, and advanced learners. The repetition of the words makes them much easier to remember, and without the hassle of making your own flash cards. I have used Drops for two years now and have seen great results.\"\n\"Very engaging way of learning Yoruba in a stimulating way. Will be using to learn myself and to teach my child!\"\n\"Less than a week in but using this alone with the popular one babbel working on German. When using just one app I got bored, babbel is not as fun. So using both at once actually let's my adhd do its thing but I still focused since I can switch easily between both apps and work in different areas. Also I like the quick little sessions makes me feel like I actually did something.\"\n\"So engaging. I speak Spanish well, but often forget words in conversation that I know I should know. This game is fun and quickly brings back vocabulary I may have put in the back of my brain after not using it for awhile. Case in point: I spent 11 years in construction, then went back to teaching in English and/or Spanish depending on the teacher/student\"\n\"Amazing app\"\n\"I have been desperate to find an app that really helps me learn Japanese and this is the best by far\"\n\"I like that you can switch between different subjects and topics constantly and it’s really easy to learn a lot of vocabulary very quickly! This works perfect for me because I can learn a lot of words but then practice sentence structure with my grandmother whose from Croatia\"\n\"Fantastic app great opportunity to learn languages on your spare time. Drops makes it easy to learn and retain words to formulate sentences.\"\n\"Best of the best. Awesome app in every sense\"\n\"This app us the best and how I am doing Learning Ukraine is Helping me alot tnx\"\n\"Definitely recommend! I'm using this to learn mandarin 10/10\"\n\"Fun and interactive. Great for repetition!\"\n\"Very engaging way of learning Yoruba in a stimulating way. Will be using to learn myself and to teach my child!\"\n\"Amazing language learning tool. Excellent app for increasing vocabulary in your foreign language of choice. Useful for beginner, intermediate, and advanced learners. The repetition of the words makes them much easier to remember, and without the hassle of making your own flash cards. I have used Drops for two years now and have seen great results.\"\n\"Great little learning app! I've learned at least 5-10 new words in Spanish in my first 5 minutes. Easy to pick up and thorough.\"\n\"I have been desperate to find an app that really helps me learn Japanese and this is the best by far\"\n\"I like that you can switch between different subjects and topics constantly and it’s really easy to learn a lot of vocabulary very quickly! This works perfect for me because I can learn a lot of words but then practice sentence structure with my grandmother whose from Croatia\"\n\"Fantastic app great opportunity to learn languages on your spare time. Drops makes it easy to learn and retain words to formulate sentences.\"\n\"What an amazing app! I’ve tried several apps for language learning and I cannot recommend Drops enough. I don’t know how a short Drops session can teach me as much as 1 hour+ of focused use of other apps, it’s like magic.\"\n\"Love my fun language learning and practice with daily Drops sessions, and monthly Challenges to participate in, and quiz mode to test contextual learning - brilliant! So much thought, consideration and inclusivity has gone into the design and function of this app, I can't praise it highly enough.\"\n\"Definitely recommend! I'm using this to learn mandarin 10/10\"\n\"This app us the best and how I am doing Learning Ukraine is Helping me alot tnx\"\nLearners progress 2x faster on average with Drops Premium, your ticket to mastering new languages. Enjoy unlimited learning time, all game modes, and much more."
    },
    {
      "url": "https://www.memrise.com/",
      "text": "You don’t just want directions. You want connection.\nMemrise gets you confidently ordering street food, swapping jokes, and getting the vibe wherever you land.\nNew city. New job. New language.\nWe’ve got your back with tools that help you speak naturally, fast, so you sound like you belong and build your own tribe fast.\nMaybe their parents don’t speak English.\nMaybe you just want to whisper sweet nothings in French. Either way, we’ll help you show up, speak up, and connect deeper.\nLearning your language isn't just about skill or utility. It’s about remembering who you are.\nMemrise helps you reconnect with your roots and your family.\nYou’ve done the streaks and the repetition. You’ve tried the books.\nNow it’s time for something real: native voices, meaningful progress, and a way to keep your brain buzzing.\nThree steps. One goal: real-world confidence.\nLearn what you’ll actually use. Smart spaced repetition makes key vocab and phrases stick, so you’re ready when it counts.\nBite-size videos from native speakers train your ear for accent, tone, and nuance. You won't just learn the words, you feel how they’re said.\nPractice in private with your AI coach until everything clicks. No pressure, no judgment. Just natural, fluent conversation on your terms.\nLearn what you’ll actually use. Smart spaced repetition makes key vocab and phrases stick, so you’re ready when it counts.\nBite-size videos from native speakers train your ear for accent, tone, and nuance. You won't just learn the words, you feel how they’re said.\nPractice in private with your AI coach until everything clicks. No pressure, no judgment. Just natural, fluent conversation on your terms.\nHere's a little timeline of what your learning experience could look like.\nWe've built the features to help you learn a new language in a way that sticks.\nLearn the language real people speak.\nNo slow, robotic sentences. Memrise uses authentic video clips so you hear how locals actually talk.\nPractice writing and speaking. Get instant feedback.\nNo pressure, no awkwardness. Our AI listens, corrects, and helps you sound more local – at your own pace.\nSpeak out loud in private with instant, helpful feedback\nImprove pronunciation without the pressure of a live tutor\nBuild fluency and confidence, one low-stakes session at a time\nSee your progress. Stay on track.\nTrack progress, celebrate milestones, and watch your confidence grow. Memrise keeps you motivated with results you can see.\nStay on track with a learning rhythm that works for you\nSee real progress as your vocabulary and confidence grow\nCelebrate milestones that actually mean something (not just points)\nWondering how Memrise compares to other language learning tools and resources? This might give you an idea.\n| PROs | CONs | |\nMemrise |\nLearn the words and phrases you need for own your goals Real‑life people and accents in videos and audio AI coach that doesn’t judge |\nMight trigger spontaneous friendships |\nGamified owl app |\nAddictive streaks Fun cartoon characters School-like learning path |\nTongue‑tied when spoken to No relevant words learned when you need them |\n| Patchwork of tutors and YouTube |\nLive correction Lots of content |\nExpensive Dependent on tutor schedule Maybe too much content – You have to find the right content for you |\nAll without paying a thing.\nWith PRO, you can use every feature whenever you want, as much as you want – no limits, no waiting.\nWhat makes Memrise different from other language apps?\nMemrise teaches you how people actually speak. Real native video. Smart review. Private AI practice. We help you sound natural, not textbook.\nDo I need to know anything before I start?\nNot at all. You can jump in as a total beginner, or pick up where other apps left off. Memrise adapts to you.\nWill I really start speaking in the first week?\nYes. You’ll learn useful phrases fast, hear them from native speakers, and practice with AI until it clicks. That first real-world conversation? Closer than you think.\nHow much does it cost?\nYou can start learning for free. Our paid plan unlocks extra features, but building confidence doesn’t have to cost a thing. You can see a breakdown of what our plans cover here.\nHow long does it take to get fluent?\nMemrise is designed to get you speaking fast and sticking with it. The more you show up, the more fluent you’ll feel.\nHere's what we've seen though: learners who spend 15 minutes a day continuing their learning, can confidently have a basic conversation in 2 months.\nIs Memrise good for travel, work, or relationships?\nYes to all three. Whether you’re ordering ramen in Tokyo or chatting with your partner’s family, Memrise helps you connect, not just translate.\nWhat if I already use other tools and resources to learn my new language?\nThat's not a problem! Memrise works great as part of your language-learning stack. Use us for vocab that sticks, speech that sounds real, and progress you can feel."
    }
  ],
  "argos_summary": "The article reviews several free language learning apps, focusing on their features, pros, and cons, particularly for learning Spanish. Duolingo is highlighted as the best app due to its engaging, gamified approach, while Drops is praised for its tailored content and effective word retention techniques. Other apps like Readlang, Memrise, and Busuu are also discussed, each offering unique methods for language acquisition, though some may be more suitable for advanced learners. Overall, the author emphasizes the importance of consistency and enjoyment in language learning.",
  "argos_id": "AIOXYMKTQ"
}