{
  "url": "https://www.techradar.com/televisions/home-theater/i-thought-i-knew-home-theater-bass-until-i-experienced-an-11-13-8-channel-demo-with-an-infrasonic-32-inch-subwoofer",
  "authorsByline": "Al Griffin",
  "articleId": "4dbe0441cd3043a1b0f571f946c5f37a",
  "source": {
    "domain": "techradar.com",
    "paywall": false,
    "location": {
      "country": "in",
      "city": "New Delhi",
      "coordinates": {
        "lat": 28.6138954,
        "lon": 77.2090057
      }
    }
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/mYNhDRpNSaZeQQpbVfHekS.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T19:30:00+00:00",
  "addDate": "2025-08-08T19:37:12.863160+00:00",
  "refreshDate": "2025-08-08T19:37:12.863163+00:00",
  "score": 1.0,
  "title": "I experienced an 11.13.8-channel home theater with WaveForming and ‘infrasonic’ bass that I could feel as much as hear",
  "description": "Bass that can be felt as well as heard",
  "content": "German speaker maker Ascendo and France’s Trinnov are known for putting on breathtaking home theater demos, and the one they teamed up for at the recent Audio Advice Live 25 consumer show in Raleigh, North Carolina, which ran from August 1-3, was perhaps the best one yet.\n\nFor sheer immersive audio horsepower, the joint demo utilized Trinnov’s flagship Altitude 32-channel audio processor and a pair of Amplitude 16-channel amplifiers. That electronics stack was used to power an 11.13.8-channel Ascendo speaker system consisting of three The12 Passive On-Wall point source speakers up front as LCRs, a surround array consisting of The10 Passive On-Wall and The10 Passive Wedge 30 speakers, and eight The6 Passive Wedge 30 speakers used for height channels.\n\nI haven’t even mentioned the subwoofers yet! Six The16 Sub Active Sealed subwoofers were positioned at the front of the room, and six more at the rear to enable Trinnov’s WaveForming, a sophisticated type of processing that can cancel out bass peaks caused by room modes while simultaneously filling in bass frequency dips for smoother and more evenly distributed bass throughout the listening environment.\n\nAlong with its 12-pack of 16-inch subwoofers, Ascendo also brought along a secret weapon: its The32 Pro Passive Sealed subwoofer, a model that uses an enormous 32-inch woofer to deliver ‘infrasonic’ bass that’s meant more to be felt than heard. In fact, The32 Pro is specified for 109 dB output @ 10 Hz.\n\nOther components of the demo included a JVC DLA-NZ900 projector, that company’s top 8K-capable model, paired with a madVR Envy video processor and a Kaleidscape movie player as a source.\n\nWe Will Rock You\n\nOne of the most popular home theater demo clips at Audio Advice Live 25 was Queen’s We Will Rock You from the movie Bohemian Rhapsody. The song’s boom-boom-clap rhythm makes it a good demo track for bass, and the movie soundtrack supplements it with the sound of a live audience stomping heavily on stadium floorboards.\n\nI’ve watched this clip many times, but never have I heard such a precise separation between the kick drum and the sound of stomping feet as in the Trinnov/Ascendo demo. The low bass was powerful, yet detailed, and there was a physical quality to it that I’ve mostly only heard in IMAX theaters.\n\nSpider-Man: Far from Home showed off the JVC 8K projector’s exceptional detail, contrast, and color definition, but it was also a showcase for the system’s immersive audio prowess. And the same could be said for Top Gun: Maverick, another hugely popular demo source at Audio Advice Live, and one that I have regularly used in my testing of the best soundbars and speakers.\n\nThe demo clip that most left my jaw on the floor, however, was one from 13 Hours: The Secret Soldiers of Benghazi. The intense firefighting in this Michael Bay-directed depiction of an American compound in Libya under attack was vividly rendered on the 11.13.8-channel system, with the sound of bullets flying coming from all around. The low bass was again very powerful, yet controlled, and I could certainly feel as well as hear it.\n\nNeedless to say, this demo involved a money-no-object system – the Trinnov Amplitude 32 processor alone costs around $40,000! But I’m glad I had the chance to experience it, and if you attend a future Audio Advice Live, you may get to do the same.\n\nYou might also like\n• You think your home theater’s powerful? Seeing this 100-inch subwoofer will correct you of that foolish notion\n• I listened to spatial audio on a 7.4.4-channel Focal speaker system, and now I need to up my Dolby Atmos music game",
  "medium": "Article",
  "links": [
    "https://www.techradar.com/audio/i-listened-to-a-usd3-million-stereo-system-and-i-dont-know-if-i-could-hear-every-penny-but-i-definitely-heard-the-dollars",
    "https://www.techradar.com/televisions/home-theater/5-incredible-home-theater-demos-at-cedia-expo-2024",
    "https://www.techradar.com/televisions/home-theater/kaleidescape-strato-v-movie-player-review",
    "https://www.techradar.com/televisions/home-theater/you-think-your-home-theaters-powerful-seeing-this-100-inch-subwoofer-will-correct-you-of-that-foolish-notion",
    "https://www.techradar.com/televisions/home-theater/how-room-correction-upgrades-your-home-theater-sound",
    "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "https://www.techradar.com/televisions/home-theater/i-listened-to-spatial-audio-on-a-7-4-4-channel-focal-speaker-system-and-now-i-need-to-up-my-dolby-atmos-music-game",
    "https://www.techradar.com/tag/8k",
    "https://www.techradar.com/televisions/harman-kardons-new-dolby-atmos-soundbar-is-like-a-sonos-arc-ultra-but-with-all-the-features-sonos-left-out",
    "https://www.techradar.com/televisions/soundbars/i-hooked-up-marshalls-five-star-soundbar-to-a-mega-external-sub-and-the-combo-was-so-powerful-i-felt-the-room-shake"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "breathtaking home theater demos",
      "weight": 0.08566254
    },
    {
      "name": "Audio Advice Live",
      "weight": 0.078483164
    },
    {
      "name": "bass peaks",
      "weight": 0.07105665
    },
    {
      "name": "bass frequency dips",
      "weight": 0.07008595
    },
    {
      "name": "Audio Advice",
      "weight": 0.06952548
    },
    {
      "name": "bass",
      "weight": 0.06922692
    },
    {
      "name": "German speaker maker Ascendo",
      "weight": 0.06822104
    },
    {
      "name": "height channels",
      "weight": 0.061517462
    },
    {
      "name": "speakers",
      "weight": 0.05950332
    },
    {
      "name": "sheer immersive audio horsepower",
      "weight": 0.057892796
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.81982421875
    }
  ],
  "sentiment": {
    "positive": 0.3779297,
    "negative": 0.11834717,
    "neutral": 0.50390625
  },
  "summary": "German speaker maker Ascendo and French company Trinnov have collaborated to create a home theater demo at the Audio Advice Live 25 consumer show in Raleigh, North Carolina. The demo featured a unique home theater experience, featuring an 11.13.8-channel home theater powered by Trinov’s Altitude 32-channel audio processor and Amplitude 16-channel amplifiers. The system also included a subwoofer named The32 Pro Passive Sealed, which uses an enormous 32-inch woofer to deliver 'infrasonic' bass. Other components of the demo included a JVC DLA-NZ900 projector and a Kaleidscape movie player as a source. Despite the high cost of the system, the demo was praised for its immersive audio capabilities.",
  "shortSummary": "Asco and Trinnov's immersive home theater demos showcased powerful, immersive bass and sound systems, with features like The32 Pro and JVC DLA-NZ900.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f61163944c4849f0b0e1f8eb53f59685",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.techradar.com/televisions/soundbars/i-hooked-up-marshalls-five-star-soundbar-to-a-mega-external-sub-and-the-combo-was-so-powerful-i-felt-the-room-shake",
      "text": "I hooked up Marshall’s five-star soundbar to a mega external sub and the combo was so powerful I felt the room shake\nHear the rumble, feel the rumble\nIt’s extremely rare for me to hand out a five-star review to any product, but the Marshall Heston 120 managed to break the mold. I was astonished by its awesome Dolby Atmos performance, stunning looks, and above all mesmerizing musicality. That’s not to mention its room-filling bass output, which helps it to stand among the very best Dolby Atmos soundbars money can buy.\nBut I was curious. Sure, the Heston 120’s bass output was fantastic given its stature as a standalone, one-box soundbar. But, interestingly, it comes with an RCA port, which enables you to hook up an external wired subwoofer from any brand, and really take low-frequency output to another level.\nI decided there was only one thing I could do… bring in a giant sub and hear how it sounds for myself.\nI went for the Q Acoustics Q Sub120 – a 600W, 50lbs (22.7kg), 12-inch (30.5cm) beast of a subwoofer that promises to deliver an “infra-bass low frequency effect you can feel as well as hear”. But is that a true reflection of what I experienced? Oh, you betcha.\nAn earth-shaking combination\nSo, after connecting the Q Sub120 to the Heston 120 via an included RCA cable, I was ready to go. I threw on Studio Ghibli’s The Boy and the Heron – one of my absolute go-to movies when soundbar testing. And to say I was blown away would be an understatement.\nDuring one scene, the protagonist, Mahito, is conversing with the heron, before a horde of frogs enter the fray exclaiming “JOIN US” in Japanese. A truly thunderous bass rumble accompanies the frogs collectively roaring this phrase over and over again, and with the Q Sub120 in use, I was shaking in my seat. No, I wasn’t (that) scared; it was just a result of the woofer’s huge power.\nAs the frogs continued their chants, I felt the room start to tremble, with the sub’s boom consuming all around me. Some colleagues downstairs feared the floor may give in… I apologized profusely. Others were drawn in by the boom of the Q Sub120, with one claiming she could still feel the bass shake after leaving the room – that’s the level of impact we’re talking.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nYou can adjust the Q Sub120’s level between 0 and 10 – and at 10, it truly is cinematic. I watched The Boy and the Heron in theaters, and with this tech, I almost felt transported back in time to my reclining seat. With a frequency response that dips down to 28Hz and a max SPL at one meter of 114dB, you’re going to hear bass notes swallow your room whole.\nAn awesome experience that still won’t suit all\nI have to admit, as breathtaking as this experience was, I don’t think I’ll be able to experience the Q Sub120’s raw power back at home. You see, my living room is in the small-to-medium-sized region, meaning that Q Acoustics’ woofer would just be overkill. Similarly, if you have a living space that’s on the smaller side of things, I’m not sure this would be the best fit for you.\nThere are smaller options in the Q Sub line that might fit your setup – namely the 8-inch Q Sub80 and 10-inch Q Sub100. These will also set you back a lot less, coming in at $899 / £599 (around AU$1,200) and $1,049 / £699 (about AU$1,400) respectively. The Q Sub120, for reference, is priced at $1,199 / £799 (around AU$1,600).\nAnd yes, I considered a 16-inch sub for writing this feature, but we're getting beyond anything that's a reasonable fit for a soundbar at that size. At least 12 inches gives me something bigger than the you get from basically any soundbar's included sub.\nIf you do have the space, the Q Sub120 can take your Marshall Heston 120, or any compatible sound system, to new heights. Even when listening to music, the increased low-end immersion was enchanting.\nI tried tuning into HOME MEETING by Sadao Watanabe via Tidal Connect, and the funky bassline had phenomenal clarity, almost creating a live music feel. At the same time, the soundbar’s sensational handling of leading sax, high-pitched percussion and jazzy keys maintained its place in the limelight, never sounding overshadowed by the sub (well, unless its power level was set too high).\nAs I say, my apartment’s limited space means that the Q Sub120 probably won’t be gracing my living room anytime soon. But that’s fine. The Heston 120 is a top-class soundbar in its own right, and it can produce pumping, almost daunting bass all on its own. But if you’ve got space aplenty and indeed enough cash, the Q Acoustics Q Sub120 will enable you to really feel the rumble, and it's great that the Marshall Heston 120 is one of the few soundbars that allows it.\nBefore I disappear, it’s worth noting for the true Marshall lovers that you won’t have to wait too long before the rockin’ and rollin’ audio manufacturer brings its own sub to market.\nThe Heston Sub 200 is set to launch later this year – and you can expect it to really ramp up the Heston’s already imposing low-end output… but it probably won't match what I tried here. We’ll keep you updated with all the details there as they come.\nYou might also like\n- Want to learn more about the Marshall Heston 120’s development? I interviewed the audio engineers who tuned Marshall’s first ever soundbar\n- Or want to check out the Heston 120’s competition? Head over to our guide to the best soundbars that money can buy\nHarry is a Reviews Staff Writer for TechRadar. He reviews everything from party speakers to wall chargers and has a particular interest in the worlds of audio and gaming. Harry has a background in business tech journalism, particularly around the telecoms industry.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
      "text": "The best soundbars for all budgets, all tested by us\nWe've tested everything from elite Dolby Atmos soundbars to cheap and simple TV sound upgrades, and these are the best.\n- Quick list\n- Best overall\n- Best budget\n- Best all-in-one soundbar\n- Best for Dolby Atmos\n- Best budget Atmos surround\n- Best super-cheap surround sound\n- Best super-cheap\n- Best premium for LG TVs\n- Best compact Atmos\n- Best for flexibility\n- Best for expandability\n- Best for wall-mounting\n- Comparison chart\n- How to choose\n- Also consider\n- New soundbars for 2025\n- How we test\n- Latest updates\nOne of the best soundbars is essential if you’ve invested in a big TV and its speakers aren’t living up to its visuals. With one of the top soundbars, you get bigger, forward-facing speakers that deliver better speech clarity and immersion in movies. The best bit is they’re sleek and slim, often fitting below your TV on a cabinet, or mounted on the wall.\nSome TVs may not need a soundbar, but plenty of the best TVs you can buy today benefit hugely from an external soundbar for better audio – especially cheaper ones. The best soundbars tend to come in three styles: all-in-one units with just a single soundbar, soundbars with subwoofers, and soundbars with subwoofers and rear speakers for surround sound. The first is ideal for people who want a minimal setup, the second is great for big sound on a budget, and the third is perfect if you want a real home theater audio experience.\nWe’ve tested a huge number of soundbars and speaker systems over the years, ranging from elite units with Dolby Atmos 3D sound, through to bargain soundbars that boost speech and add depth for very little cash. We're looking for natural sound in all cases that doesn't come across as overblown, and where individual effects can stand out from the overall mix. We want to see ease of use too, no matter how many different speakers are included and in the case of higher-end soundbars we're looking for extra features such as wireless support and HDMI passthrough (including at 4K 120Hz) to justify the pricing.\nSome soundbars include extra features when used with a particular TV, so we'll highlight those where appropriate, and we do test them – but they don't make or break our recommendations. We test soundbars as if you're buying them as a neutral, so you can get a great upgrade no matter what TV brand you have.\nThe quick list\nIn a hurry but need to find the best soundbar for you? Take a look at our quick list below which covers a soundbar that will suit every budget and situation. You can still check out more detailed reviews of each soundbar below.\nBest overall\nThe best soundbar for most people\nThe Samsung HW-Q800D offers great cinematic sound, Dolby Atmos and DTS:X support at a strong price, for a great range of screen sizes, with HDMI passthrough. A great all-rounder.\nBest budget\nThe best budget soundbar\nIf you're looking to get immersive Dolby Atmos support on a budget, the Sony HT-S2000 is a no-brainer – a high-quality soundbar for a low price. It's also compact, and doesn't need space for a separate subwoofer.\nBest all-in-one soundbar\nThe best one-box soundbar\nThis offers amazingly cinematic sound without a big separate subwoofer and has superb Dolby Atmos effects. If you want a high-quality sound from a well-priced all-in-one, this is the best.\nBest Atmos surround\nThe best soundbar for Dolby Atmos surround\nThe Samsung HW-Q990F delivers real power and immersion and is the best soundbar for the full Atmos experience, with rear speakers and hefty bass from its newly designed, compact subwoofer.\nBest budget Atmos surround\nThe best budget soundbar for Dolby Atmos surround\nHisense’s system packs a pair of wireless surrounds and a subwoofer, and it delivers real Dolby Atmos using up-firing speakers – all for a stunningly low price. Try fantastic value for a budget home theater.\nBest super-cheap surround\nThe best super-cheap surround sound\nIf you're looking to get surround sound for as low a price as possible, the Ultimea Poseidon D50 is our top-choice, providing decent quality sound in a no-frills system that's also super-compact.\nLoad more products\nBest super-cheap\nThe best super-cheap soundbar\nAnyone looking to upgrade their TV’s sound without spending much money will be pleased with Amazon’s soundbar. The sound quality is decent, and with limited features, it’s easy to set up and use.\nBest premium for LG TVs\nThe best premium soundbar for LG TVs\nIf you have an LG TV and want the best soundbar for it, then this is the best choice. With full, immersive spatial audio and exceptional power, we found it a real treat to listen to.\nBest compact Atmos\nThe best soundbar for compact Dolby Atmos\nIf you're looking to get Atmos sound but are tight on space, this Bose is a soundbar that packs powerful sound into a small package.\nBest for flexibility\nThe best soundbar for sheer flexibility\nWith four HDMI ports to connect other sources and rechargeable, wireless surround speakers, the JBL 1300X really adapts to what you need.\nBest for expandability\nThe best soundbar for expandability\nThe Arc Ultra provides great sound for an all-in-one soundbar, and it can be easily expanded with other Sonos speakers to add surrounds channels and subwoofers.\nBest for wall-mounting\nThe best soundbar for wall-mounting\nThis Samsung soundbar automatically optimizes its speaker setup based on whether it’s placed horizontally or vertically. In vertical mode, it has a flatter profile – perfect for pairing with a wall-mounted TV.\nMatt is TechRadar's Managing Editor for Entertainment, and has over 15 years of experience in tech publishing. He has been writing about the latest soundbars and TV audio since 2017, and has very strong opinions about the correct ratio of HDMI ports to price.\nAugust 6, 2025\nReplaced the Samsung HW-Q990D with the Samsung HW-Q990F as 'best for Dolby Atmos'. Removed the Sony HT-A7000 and 'best for gaming' category. Added in a table with scores for each soundbar on this list labelled 'Comparison Chart'. Updated 'Other soundbars to consider' and 'New for 2025' sections.\nThe best soundbars you can buy\nWhy you can trust TechRadar\nThe best soundbar overall\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want the best-value soundbar: The Q800D delivers a dynamic and punchy sound with impressive Dolby Atmos positional effect for a very good price.\n✅ You want a powerful sound: The Q800D is imposing, powerful and immersive, despite being limited to a soundbar and subwoofer in-the-box.\n❌ You're after 4K 120Hz passthrough: If you have a next-gen console such as a PS5, you'll have to look at other soundbars for 4K 120Hz passthrough.\n❌ You own the Samsung HW-Q800C: The Q800D doesn't offer much in the way of upgrades over its predecessor, the Samsung HW-Q800C, so if you own the latter, there's no point in upgrading.\nWhat you need to know: The Samsung HW-Q800D is the mid-range soundbar in Samsung's 2024 soundbar lineup, but it delivers a premium performance for the price. It delivers 5.1.2 channels, totaling 360W of power for a sound that's dynamic, engaging and downright impressive. It supports Dolby Atmos and DTS:X surround formats as well as Samsung-centric features such as Q-Symphony, which uses the speakers of compatible Samsung TVs for extra immersion. It also supports Wi-Fi and Bluetooth for audio streaming. It also has gaming features, but does unfortunately lack 4K 120Hz passthrough to make the most out of consoles. But this is one of the very few downsides to a fantastic soundbar, and it won't matter to everyone, anyway.\nAudio performance: When we heard the Q800D in action, we were blown away by just how sonically impressive it is. A rich, expansive and powerful sound comes through the Q800D, whether its movies or video games. Dolby Atmos and DTS:X surround is immersive, engaging and fully-fledged, which is impressive for a soundbar comprised of two units (a soundbar and subwoofer). Its wide soundstage also means it handles music well, which is no guarantee with soundbars.\nDesign: In terms of looks, the HW-Q800D isn't very visually appealing, with a chunky design and angular look that some find dull. But, it does have a solid build quality and a metal mesh grille that make it feel more premium. While you can get better-looking soundbars, the Q800D is still a perfectly fine looking soundbar.\nValue: The Q800D is exceptional value and while it's not going to beat the likes of the more premium Samsung HW-Q990D in terms of sheer power, #4 on this list, or the Sonos Arc Ultra for looks, #3 on this list, it delivers a level of quality and performance way above its price range. So, it's no wonder that it's easily the best soundbar on the market for most people.\nRead our full Samsung HW-Q800D review\nThe best budget soundbar\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want an affordable soundbar: The Sony HT-S2000 launched with a higher price than the next cheapest offering at #7 in this list but is now regularly reduced for less.\n✅ You want immersive sound: The HT-S2000 offers 3.1 channels of surprisingly powerful sound, with support for virtual Dolby Atmos, for a reasonable price.\n❌ You own a next-gen console like a PS5: Without 4K 120Hz passthrough, the HT-S2000 isn't the best for gamers. Instead look at #5 in this list.\n❌ You want a home audio system: The HT-S2000 does not have Wi-Fi so you won't be able to link it up to a multi-room wireless speaker system.\nWhat you need to know: When it comes to sound quality and features vs price, we think the Sony HT-S2000 is the best budget choice around. Although it's a little basic in terms of connectivity, the sound you get from this soundbar is impressive for the money and is certainly a good choice for those looking for an upgrade to their TV sound without breaking the bank.\nAudio performance: While the Sony HT-S2000's sound isn't the biggest, the sound you do get for your money is impressive. Clear dialogue levels and a spacious, virtual surround sound are two of the HT-S2000's highlights. Bass levels are also punchy enough, but it's the Sony HT-S2000's ability to reproduce Dolby Atmos effects that's surprising. It's not going to beat a soundbar with height channels, but for a 3.1 soundbar, it offers plenty.\nDesign: Design wise, the Sony HT-S2000 feels and looks more expensive than it is, with a solid, mesh metal grill on the front and a sturdy black plastic casing housing the speakers. The soundbar also produces visual feedback to remote control commands, something rare on budget soundbars.\nValue: Yes, the HT-S2000 isn't going to set the world alight with its sound and certainly isn't the best soundbar for sound on this list, but when you're paying roughly $349 / £299 / AU$695 for a soundbar with this good a sound quality, it's hard to argue against.\nRead our full Sony HT-S2000 review\nThe best all-in-one soundbar\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want expansive sound from an all-in-one: The Heston 120’s 5.1.2-channel speaker array delivers surprisingly immersive audio and deep bass for an all-in-one unit\n✅ You want a unique design: With its guitar-amp-like looks, the Heston 120’s design is certainly unique, making it stand out from the sea of boring, black soundbars.\n❌ You want the best surround-sound experience: One-box offerings like the Heston 120 can only simulate a true surround experience. You’ll need actual surround speakers to get the real deal.\n❌ You’re on a tight budget: There are more budget-friendly options that can provide a satisfactory Dolby Atmos experience for less money.\nWhat you need to know: The Marshall Heston 120 is the best all-in-one soundbar you can buy for its asking price. The other soundbars in this list feature additional surround speakers and a subwoofer to deliver a cinematic sound experience, or they skimp out on immersion and bass by opting for a limited speaker array and compact design. The Heston 120, in contrast, features a 5.1.2-channel speaker array with dual active woofers and four passive radiators. With support for both Dolby Atmos and DTS:X soundtracks, the presentation is impressively wide and tall for an all-in-one, and there’s no shortage of deep, powerful bass.\nAudio performance: The Heston 120’s booming bass filled our TV testing facility when we reviewed it, and even managed to convey deep sub-bass in Atmos movie soundtracks. Height and surround effects are conveyed with spatial precision, which lends a true sense of realism to the proceedings, and we even got a sense of sound moving past our shoulder when we tested it. The same qualities that make the Heston 120 great for movies also work for Atmos and stereo music playback. Stereo music in particular sounds smooth and has clear channel separation – a rare feat for an all-in-one soundbar.\nDesign: Marshall’s design for the Heston 120 unsurprisingly mimics that of its famous guitar amps, with big, golden-hued metallic control knobs, and a white Marshall logo plastered across the front. It’s surely making a statement in the otherwise bland, black world of soundbar design, and those extra elements can be visually distracting when watching movies in dimmed lighting. Bottom line: you’ll either love the design or you won’t. At over a meter in width, the Heston 120 is also on the large side for a soundbar, and there’s no remote control option outside of Marshall’s app, which provides everything you need to get this soundbar up and running.\nValue: At $999 / £899 / AU$1,799, the Heston 120 is undoubtedly pricey, and you’ll pay the same price for the also impressive Sonos Arc Ultra, our choice as the best option for expandability in this guide. But the Heston 120’s build quality, performance, and features make it a solid, if not exceptional, value, especially if you’re interested in an all-in-one bar that doesn’t make any sonic compromises.\nRead our full Marshall Heston 120 review\nThe best soundbar for Dolby Atmos\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want immersive surround sound: The Q990F delivers a fully immersive, powerful, and tightly controlled sound that not many other soundbar systems can compete with.\n✅ You want a compact subwoofer that doesn't compromise: The Q990F's newly designed compact subwoofer is easier to hide, but doesn't skimp on sheer power and control.\n❌ You're on a budget: The Q990F is a premium soundbar system that unavoidably costs more than budget Dolby Atmos soundbars like #4 in this list.\n❌ You own the Samsung HW-Q990D: While the Q990F's new subwoofer is great, elsewhere the Q990F is only a slight upgrade over its predecessor, the Q990D.\nWhat you need to know: Samsung’s Q990F is a complete surround sound system in a soundbar package. It has 23 drivers spread across 11.1.4 channels and comprises four units: a soundbar, a subwoofer, and two rear speakers. It delivers engaging, expansive and punchy sound, as well as 4K 120Hz pass-through support for gaming consoles.\nAudio performance: Dolby Atmos soundtracks are reproduced with superb precision and pinpoint accuracy, putting you right into the heart of the action. Speech is clean and clear, and its newly designed, smaller subwoofer doesn't skip out on bass, delivering plenty of hefty rumble while still maintaining control and nuance. Q-Symphony is a bonus for Samsung TV owners, adding even more speakers to the action.\nDesign: The headline here is the newly designed, compact subwoofer, which is sleeker, sharper and much more versatile in terms of space. The Q990F has a similar matte gray/navy finish to its predecessors for a minimalist look, but uses a grille design that isn't as appealing as its predecessors. Still, it has a premium look and feel with a reassuring heft. Its front display continues to be difficult to read, however\nValue: A soundbar system that's this powerful and complete necessarily comes with a high price tag. And while we think that the Q990F's performance justifies the price, you can save some money by picking up its predecessor, the Q990D. Or if you're looking for a budget alternative, check out the Hisense AX5125H at #5 in this list for a cheaper Atmos alternative.\nRead our full Samsung HW-Q990F review\nThe best budget soundbar for Dolby Atmos surround\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want 'real' Atmos sound\nWith 5.1.2 channels, including two surround and two up-firing Atmos speakers, you're getting actual immersive sound rather than virtual processing.\n✅ You want to save money\nAt around $350 / £350 / AU$449, you’re getting a full surround sound speaker package with a subwoofer for the price of many standalone soundbars.\n❌ You want high-quality music playback\nHisense’s budget bar uses Bluetooth exclusively for music streaming, and that’s a lower-quality option than the Wi-Fi tech used by other soundbars like the Sonos Beam.\n❌ You want to experiment with EQ\nWhile the Hisense has preset sound modes plus bass and treble controls, its sound adjustments are very basic compared to other soundbars that offer extensive EQ settings and room correction using apps.\nWhat you need to know: The Hisense AX5125H is a 5.1.2-channel Dolby Atmos soundbar system with a wireless subwoofer and surround speakers that sells for under $350 / £350 / AU$450. What you’re getting here kit-wise for the money is pretty much unbeatable considering the system’s punchy sound and “real” as opposed to virtual, Dolby Atmos effects delivery.\nAudio performance: Hisense’s budget soundbar system punches well above its price class when it comes to sound quality, with clear dialogue, accurate effects placement and good surround immersion. Even music sounds good, though, streaming is limited to Bluetooth quality. The one complaint we have about its sound is that the compact rear speakers can occasionally get overwhelmed by aggressive surround sound mixes.\nDesign: The AX5125H’s build quality falls short of premium – something to be expected at this price – though its metal mesh speaker grilles give it a somewhat upscale look. Importantly, the soundbar has a front panel alphanumeric LED display, which provides clear visual feedback when making volume or EQ adjustments with the system’s remote control.\nValue: Given its low price for a 5.1.2-channel soundbar system, the Hisense AX5125H’s value is almost over the top. You’ll pay more than four times as much for the Best soundbar for Dolby Atmos choice on our list, the Samsung HW-Q990D, and while that 11.1.4-channel system will undoubtedly provide a greater sense of sound immersion, many people will be satisfied with the Hisense’s sound for the money.\nRead our full Hisense AX5125H review\nThe best super-cheap soundbar for surround sound\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want surround sound for cheap: The Poseidon D50 offers 5.1 channels of clear, punchy sound for cheaper than most soundbars.\n✅ You want a straightforward soundbar: The Poseidon D50 opts for a no-nonsense, plug-in-and-play approach over apps and features.\n❌ You want the best quality sound: The Poseidon D50's sound can be tinny at times, and rear speakers can get lost in the mix.\n❌ You want the best looking soundbar: Unsurprisingly, the Poseidon D50 has a plain, plasticky look due to its super-cheap price.\nThe Ultimea Poseidon D50 is the best way to get surround sound for your living room for a low price. Its sound may not be the most dynamic and it's light on features, but at such a low price for a full 5.1 system, it's hard to argue against what it does deliver: clear, punchy and occasionally spacious audio.\nIn our review of the Ultimea Poseidon D50, we enjoyed its clarity of speech and relatively punchy, powerful surround sound. While watching Top Gun: Maverick, we were \"impressed at the three-dimensional sound of soaring aircraft\", especially considering the lack of Dolby Atmos. While the Poseidon D50 doesn't deliver the most cinematic of experiences, with audio sometimes veering on tinny and the rear speakers sometimes struggling to keep up, we said \"for the price you pay, the surround sound certainly surpassed expectations\" and that's all we ask for from this cheap soundbar.\nLight on features due to its budget price, including a lack of Dolby Atmos and DTS:X support (check out the Hisense AX5125H further up the list for a budget Atmos surround soundbar), the Poseidon D50 does still support Bluetooth streaming for music and come with HDMI ARC, optical and 3.5mm ports for connections. There are also three distinct sound modes – Movie, Dialog and Music – to cater to what you're watching.\nUltimately, you get what you pay for, and the Ultimea Poseidon D50 delivers solid (but not mind-blowing) surround sound for under $150 / £150 (we've seen it as low as $119 / £139). At that price, it's difficult to be disappointed in the Poseidon D50. If you want surround sound for cheap, the Poseidon D50 should be on your list.\nRead our full Ultimea Poseidon D50 review\nThe best super-cheap soundbar\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want a cheap, but good soundbar: A 2.0-channel soundbar like this is an easy way to upgrade your TV’s sound without incurring a high cost.\n✅ You want easy setup: The limited features of Amazon’s soundbar are a benefit if you’re looking for a super-easy model to connect, set up, and use.\n❌ You want Dolby Atmos support: Dolby Atmos support generally isn’t available on low-cost soundbars like Amazon’s. To get that feature, you’ll need to step up to the Sony HT-S2000, the best budget model on our list.\n❌ You want bass: The Amazon’s compact design doesn’t permit much in the way of bass, so if that’s important, look for a different model with a separate subwoofer.\nWhat you need to know: Amazon’s first and only soundbar is a basic, compact model that delivers decent sound quality for the price. A 2.0-channel design, it keeps things simple by limiting wired connections to a single HDMI input for a hookup to a TV’s HDMI eARC/ARC port, along with an optical digital connection. Bluetooth is additionally supported for wireless music streaming from a phone or tablet.\nAlthough Amazon’s soundbar lacks Dolby Atmos support, it has Movie, Music and dialogue-boosting EQ modes as well as DTS Virtual:X processing to add a spacious quality to surround-encoded soundtracks. There’s no front-panel alphanumeric display to provide visual feedback – something you wouldn’t expect to see in a soundbar at this price – but ergonomics are otherwise good, and with limited connections and features, setup of Amazon’s soundbar is incredibly easy.\nThe Amazon Fire TV soundbar’s main selling point is its price. Amazon lists it for $119.99 / £199.99 on its site, but regularly lets it go for under $100 in the US. If you’re looking for a basic, super-cheap bar that does a decent job and is easy to set up, Amazon’s soundbar is the one we’d recommend.\nAudio performance: While you can’t expect a 2-channel soundbar like this to work magic with movie soundtracks, Amazon’s bar will provide an instant upgrade over your TV’s built-in speakers, boosting dialogue clarity and adding heft to sound effects. In our review, we found it provided the best sound balance with the Bass setting at Medium, which made voices sound natural and not overly heavy. DTS Virtual:X processing was effective at amping up movie soundtracks and did so without any negative effect to other elements in the mix.\nDesign: At 24 inches wide by 2.5 inches high and 3.5 inches deep, Amazon’s compact soundbar is a good match for smaller TVs. A row of control buttons is provided on top and a remote control is also included. The main design limitation is the LED indicator lights instead of an alphanumeric display for visual feedback, which is common at this price point.\nValue: Given the sound quality, effortless usability, and sturdy design of Amazon’s Fire TV soundbar, it’s a great value and easy recommendation. You’ll have to spend several hundred more to get better performance and features, and many people will be perfectly satisfied with Amazon’s low-budget bar.\nRead our full Amazon Fire TV soundbar review\nThe best premium soundbar for LG TVs\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want immersive, home theater sound: With 9.1.5 channels here along with AI room calibration, you're in for a surround sound treat.\n✅ You have an LG TV: It works well whatever you pair it with, but you get access to better features with certain models of LG TVs.\n❌ You don't have much space: This soundbar system is large, so if you don't have room to spare opt for a smaller alternative like #5 in this list.\n❌ You're saving money: This isn't a budget buy. You'll have to make sacrifices, but you can find a similar soundbar for less. Check out #2 in this list.\nWhat you need to know: The LG S95TR brings you the convenience and straightforward setup of a soundbar system but with the immersive power and performance of a home theater speaker setup. It works well with everything, but LG TV owners can unlock the best features. The only thing that lets it down a little is its high price. If you're on a budget but still want Atmos and surround sound, take a look at our cheap soundbar pick, the Hisense AX5125H at #4 in this list. But if you can afford it, the features, performance and design of the LG S95TR make it worth every penny.\nAudio performance: With this soundbar's 9.1.5 channels, along with some very impressive AI room calibration, you'll experience a great home theater setup with surround sound and spatial audio (Dolby Atmos and DTS:X). In our review, we described the sound on offer here as \"immersive, engrossing, and engaging\" and with 810 watts of power, the LG S95TR can reach great volumes.\nDesign: This soundbar looks very basic with a subwoofer and two wedge-shaped rear speakers. Unfortunately, there's no LED display, just LED indicator lights, which is disappointing considering how many features are on offer here. You'll need to open LG's control app to find what you need, which is a little annoying. This is also a big system. So if you want to put it in a small room, it might not be the best choice for you.\nValue: The LG S95TR’s $1,499 / AU$1,699 (about £1,200) price feels expensive, but when you compare it with the competition, the fact you're getting a 9.1.5-channel system and the performance on offer here, it's still good value. If you want real surround sound, check out #3 in this list, the Samsung HW-Q990D.\nRead our full LG S95TR review\nThe best compact Atmos soundbar\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want great sound from a standalone soundbar: The Smart Soundbar delivers the Bose audio quality one expects. The bass and soundstage width are a bit light, but clarity and dynamics are good.\n✅ You want real Dolby Atmos: The soundbar’s two upward-firing speakers let it deliver a real spatial audio experience. Also, a TrueSpace feature can upscale non-Dolby Atmos tracks for spatial audio.\n❌ You want full surround sound: Adding Bose Ultra Open Earbuds can give a great surround sound experience, but just for one person. If you want full surround sound for around the same price, other options are available.\n❌ You’re on a tight budget: The Smart Soundbar has a premium price for a single soundbar. You can find similar compact soundbars for less, but you will compromise on both sound quality and features.\nWhat you need to know: The Bose Smart Soundbar is a compact model with real upfiring speakers to properly deliver Dolby Atmos soundtracks. It has built-in Wi-Fi for streaming music, AirPlay 2 and Chromecast support, and can be paired with optional Bose wireless surround sound speakers and a subwoofer if you one day get an urge to upgrade your system. Alternatively, the Smart Soundbar’s Personal Surround Sound feature, which requires Bose’s Ultra Open Earbuds, can give you surround sound without having to muck with extra speakers.\nAudio performance: When we reviewed the Bost Smart Soundbar, we noted that it “sounds about as good as a soundbar can.” Dialogue is “consistently intelligible,” and there are level and EQ controls in Bose’s app that let you boost it on an as-needed basis. Because of its compact form factor, both bass and soundstage width are limited, but the Smart Soundbar’s upfiring Atmos speakers, which can also be engaged for non-Atmos movies and music using the TrueSpace feature, help quite a bit to expand the soundfield.\nDesign: At 27 inches wide by 2 inches high and 4 inches deep, it’s a fairly sleek and compact design for an all-in-one unit and a perfect choice for smaller homes or screens. While it only has a single HDMI port, it makes up for this by packaging everything into an attractive all-in-one form.\nValue: This soundbar impressed us in several ways during our testing, and we also appreciated its Personal Surround Sound and TrueSpace features The Bose is also a good value – as one of the few soundbars that sell for under $500 / £500 / AU$700, it offers a lot more features than the Sony HT-S2000 at #2 in this list and Amazon Fire TV Soundbar at #8 in this list.\nTo save money on Bose products, check out our Bose discount codes.\nRead our full Bose Smart Soundbar review\nThe best soundbar for flexibility\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You need multiple HDMI ports: The JBL Bar 1300X comes with four HDMI ports so multiple devices can be connected.\n✅ You want rear speakers with no wires: Supplied with wireless rechargeable speakers, there's no wires to keep things neat and tidy.\n❌ You want to keep the rear speakers charged: The JBL Bar 1300X's rear speakers need regular recharging, unlike a more traditional setup like the HW-Q800D at #1 in this list.\n❌ You want the cheapest soundbar: The JBL Bar 1300X is not budget-friendly, even compared to other soundbars in its price range.\nWhat you need to know: The JBL Bar 1300X provides a fantastic level of flexibility. With Dolby Atmos and DTS:X support and a big, beefy sound aided by its larger than average subwoofer, its the connections and features packed into this soundbar that make it so versatile compared to other soundbars on the market. The one downside? This soundbar isn't going to suit serious gamers. While there are multiple HDMI ports here, none of them have 4K 120Hz pass-through to support that resolution and frame rate when playing games on PS5 or Xbox Series X, a feature you can find on our choice on the best soundbar for gaming, the Sony HT-A7000 at #5 in this list.\nAudio performance: We think the JBL Bar 1300X would suit anyone looking for a powerful and immersive soundbar option, but particularly those who are after the visceral excitement that the best home theater systems effortlessly deliver, while also being relatively easy to setup and not becoming a burden on your living room.\nDesign: Although the JBL Bar 1300X doesn't take up too much space, it is designed to fill larger rooms with sound so we wouldn't recommend it in smaller homes. There are also multiple HDMI inputs here, meaning you can connect a stack of extra sources without worry, and the system’s rechargeable rear speakers can also be used as portable Bluetooth speakers. That might be a \"so what?\" feature for some people, but to us it's a design flex that heightens the Bar 1300X's overall value.\nValue: Priced in line with the likes of the Sonos Arc Ultra at #3 in this list, the JBL Bar 1300X is not cheap but does deliver a lot flexibility to make up for it. From the rechargeable rear speakers that can also be used as bluetooth speakers and number of HDMI ports to the easy setup and immersive sound, this is one of the most flexible soundbars we've found. (Note: in some countries, you get the JBL Bar 1300 – without the X – which has a smaller 10-inch subwoofer driver instead of the 12-inch in the X version. This is a relatively small difference, and doesn't alter our overall opinion.)\nRead our full JBL Bar 1300X review\nThe best soundbar for expandability\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want big and cinematic sound: The Arc Ultra's special bass driver sounds excellent, and its sound balance is excellent, especially the dialogue.\n✅ You want an expandable soundbar: You get great Dolby Atmos effects from a single box here , and it can be easily expanded with Sonos surround speakers and subs.\n❌ You want high-end DTS:X support: Fans of Blu-rays or streaming IMAX Enhanced movies may be annoyed by this – you won't get the full power.\n❌ You struggle to have enough HDMI ports on your TV: There's no HDMI passthrough here, so you simply lose the use of whichever port it's connected to.\nWhat you need to know: The Sonos Arc Ultra is the best soundbar for expandability. It sounds great on its own, but the flexible nature of the Sonos ecosystem lets you easily add surround speakers and a subwoofer as your needs and budget change. Other soundbars here deliver more immersion by filling your room with multiple boxes, but if you want deep, expansive, expertly balanced movie audio from one slender bar, with the option to add to it later, this is the way to go.\nAudio performance: The Sonos Arc Ultra is a very impressive piece of audio design, thanks partly to its 'Sound Motion' bass driver, which is a very small speaker that produces decent bass without a separate subwoofer. It helps the overall sound balance of the Arc Ultra to be absolutely superb, with great impact, very clear yet natural dialogue, and effects that jump right out of the mix. The Dolby Atmos 3D sound is excellent for a single-box soundbar as well, really adding motion and layers to individual sounds. A massive upgrade over any TV's built-in sound.\nDesign: This is small for a powerful one-box soundbar – but that's relative! It's pretty wide, though will work for TVs of 55 inches and up, but it's not too tall or deep (though may be too tall for some very low-slung TVs). It feels really well made, and the simple, hard-shell black or white design disappears nicely into your decor. The connections are in a recess in the back – as is the Bluetooth pairing button, annoyingly (but you can use the Sonos app to pair too). It's wall-mountable, too.\nValue: This is strong value, simply because it sounds so good for under $1000 / £1000. It's also great that it works as part of the Sonos ecosystem, and can be expanded with Sonos' wireless speakers as rear speakers, or with a dedicated, more powerful subwoofer. However, its lack of DTS-HD/DTS:X support and not having an HDMI passthrough port when all of its key rivals do mean it's less-than-perfect on value – but if you don't care about those things, then they're not a problem!\nRead our full Sonos Arc Ultra review\nThe best soundbar for wall-mounting\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want a versatile design: It’s our top choice for wall-mounting, but it’s just as happy on a tabletop. If you want flexibility for both, you’ll find it here.\n✅ You want more powerful sound than a standard TV can muster: You’d be forgiven for thinking the low profile of this soundbar means it doesn’t pack a punch, but no built-in TV sound is anywhere near this good.\n❌ You’d prefer a full surround sound experience: You’ll get a pleasingly large soundstage here, but with no rear speakers, it won’t wrap sound around you like the best systems can.\n❌ Wall-mounting is only a “nice to have”: Pretty sure you won’t wall-mount it? Look elsewhere. It’s still a great choice, but if it’ll always sit on your TV table, its versatility won’t matter.\nWhat you need to know: The Samsung HW-QS700F soundbar blends the performance of Samsung’s Q series with the sleek, lifestyle-friendly design of its S series. Its standout feature is the ability to automatically optimize its 3.1.2-channel speaker setup depending on whether it’s mounted horizontally or vertically. In vertical mode, its flatter profile pairs neatly with a slim, wall-mounted TV. Sound quality is solid for the price, with support for Dolby Atmos, DTS and Bluetooth. It comes with a Samsung wireless subwoofer and can also be paired with surround speakers – but it’s the wall-mounting versatility that really sets this model apart.\nAudio Performance: Despite its affordable price, this soundbar’s 3.1.2-channel configuration delivers an impressive level of power, detail, and staging. Most of that top-performing sound holds up regardless of its orientation, though there are some minor niggles depending on how you use it. Then again, as we noted in our review, it still outperforms the vast majority of rivals. You’ll also get to enjoy Dolby Atmos playback, DTS:X support and compatibility with a broad range of file formats.\nDesign: The design is where the HW-QS700F truly shines. It features gyro sensors that automatically adjust the speaker configuration for optimal performance whether it’s placed on a table or wall-mounted. The long, angular bar and its compact, cubic wireless sub are surprisingly space-efficient for such a powerful system. It’s slender enough to slide beneath most TV screens or can easily be mounted on the wall underneath one, yet long and deep enough to promise potent sound and a premium finish.\nValue: Considering its blend of performance and features, the Samsung HW-QS700F is a compelling choice. While many soundbars can either be wall-mounted or tabletop-set, few adjust their speaker configuration to optimize performance for both setups. It’s a great option in its own right, but it’s our top pick for wall-mounting – ideal if you want to take full advantage of that versatility or simply love the option to move it around.\nRead our full Samsung HW-QS700F review\nBest soundbars: comparison chart\nBelow, you'll find a chart showing the scores of every soundbar featured on this list, based on the criteria on which we review them: Features, Performance, Design, Setup & usability and Value. You can sort each column by clicking on its header.\nHow to choose the best soundbar\nThere are several things to consider when you’re looking for the best soundbar.\nThe first is the size. You’ll want to make sure that your soundbar fits under—or next to, depending on your set-up—your TV. For example, the long Sonos Arc soundbar is designed specifically for large screens, so won’t look right with a smaller 50-inch TV. You’ll need to know the size of your current TV and the size of the space you have to fit it and compare those figures to the dimensions listed alongside the soundbar you want to buy.\nYou’ll also want to consider whether you need a Dolby Atmos speaker or not. Dolby Atmos is surround sound technology, placing sounds and voices all around you so that whatever you’re watching or listening to is more immersive. The thing is, Dolby Atmos-enabled soundbars tend to be more expensive. You’ll need to weigh up whether Dolby Atmos sound is worth it for you. Otherwise, consider a capable but cheaper option, like the Sony HT-S2000, our choice for best budget soundbar.\nAnother thing you’ll want to watch out for is the kind of connection you need. You’ll find most modern soundbars have HDMI connectivity, but there's also optical connectivity—so what's the difference? These are two ways that audio is passed from your TV to your soundbar, but HDMI passes high-resolution audio, including Dolby Atmos.\nIf you want a premium, immersive listening experience you’ll want to be sure you have an HDMI connection to use from your soundbar and an HDMI ARC (that's audio return channel) or eARC (enhanced audio return channel, a higher-resolution connection) port on your TV for it to connect to.\nBut this means one of your TV's HDMI ports is used up by the soundbar, so some bars come with HDMI 'passthrough' ports, meaning you can connect a console/set-top box/etc to the soundbar, and it passes the visuals back to your TV. If your TV has few HDMI ports, you'll want a soundbar with this feature.\nThere’s more to think about, but getting the size, audio features and connectivity nailed down early on should make finding the best soundbar for you much easier.\nWhat connection do I need for a soundbar?\nThe best way to connect a soundbar to your TV is with an HDMI cable. You'll need to make sure you have an HDMI port on your soundbar and an HDMI ARC or eARC port on your TV. This allows you to use a cable to connect them.\nAn HDMI port means that the highest quality audio can pass from your TV to your soundbar, like Dolby Atmos.\nIf your TV or soundbar doesn't have HDMI ports, the second best option is an optical. This can still transfer digital sounds, but not the high-resolution ones you'd get with HDMI.\nHowever, you will still get quality audio and an optical connection does work with soundbars and surround sound systems.\nWhat size soundbar should I get?\nYou need to get a soundbar that fits in the space you have available. Some people have their TV mounted and a soundbar could happily be mounted underneath. Others have their TV on a stand and the soundbar can sit in front of it.\nConsider the space you have free but also the size of your TV. A compact soundbar might look silly with a massive screen and vice versa. There are many different-sized soundbars available to suit your TV, so make sure you check the dimensions and match them up.\nCan soundbars do surround sound?\nTrue surround sound means speakers are positioned around you. Some soundbars on this list, like the Samsung Q990D and Hisense AX5125H, also come with a subwoofer and two smaller rear channel speakers, meaning you can place them around your room.\nHowever, other devices with only one soundbar claim to offer surround sound. What this means is they deliver a stereo effect, which seems more like sound is coming from different directions, but isn't.\nMany of the high-end soundbars in this list also have Dolby Atmos built-in. Again, this isn't technically surround sound, but the audio tech is advanced and creates the illusion of immersive sound by bouncing sounds off the walls and ceiling around you.\nAre Dolby Atmos soundbars really worth it?\nAlthough not all the soundbars on this list capture Dolby Atmos as well as a home theatre system, more and more soundbars are supporting Dolby Atmos, making it available to people with all budgets.\nYes, the level of detail you get from a full home theater system compared to soundbars with 'virtual' Atmos or surround soundbars isn't quite as high, Dolby Atmos soundbars are becoming more sophisticated and provide an extra level of immersion to your cinema experience.\nAre soundbars worth it?\nAbsolutely. Even if you don't consider yourself a hardcore cinephile, the best soundbars make a world of difference to your TV watching experience—even the built-in speakers that come with the best TVs just don't do your favorite films, TV shows, and games justice.\nHow much should I spend on a soundbar?\nIt depends on what you're looking for. If you want the very best soundbar technology has to offer, you might be looking at prices of $800 / £800 / AU$1,000 and upwards.\nHowever, there are lots of fantastic budget soundbars on the market, with some costing less than $100 / £100 / AU$150. Just bear in mind that you generally get what you pay for, and these budget models probably won't come with premium features like Dolby Atmos, included rear speakers, and hi-res audio support.\nBut, the mid-range market is getting more competitive and it really is easy to get a lot of bang for your buck, with soundbars (on our list above) providing Dolby Atmos and a subwoofer for under $400/£400/AU$650 becoming more and more common.\nWhere should I put a soundbar?\nYou generally have two options when it comes to soundbar placement: wall-mounting it, or placing in below your TV on your TV cabinet. If your soundbar is quite tall, wall-mounting may be the best option, as it could obscure the IR receiver on your TV, rendering your remote control useless.\nDoes my soundbar brand need to match my TV?\nQuick answer: No, any soundbar can be used with any TV. That’s because all TVs made over the past decade feature HDMI (ARC or eARC) and optical digital connections that output audio signals, and virtually every soundbar will feature both HDMI and optical digital inputs to accept that output. And even if you’re mixing brands, a TV’s HDMI-CEC feature will conveniently let you control the soundbar's volume level using the TV remote control.\nHaving said that, there are instances where combining soundbar and TV brands will yield benefits. Many Samsung soundbars, such as our best overall pick, the Samsung HW-Q800D, for example, support a feature called Q-Symphony that lets you combine the sound output of the TV’s built-in speakers with the soundbar’s output for an enhanced, more spacious audio presentation. And LG soundbars support a similar feature called Wow Orchestra that automatically integrates the soundbar and TV speakers when connected to a compatible LG TV. In both cases, you will experience more powerful, immersive soundstage than you would from just the soundbar working alone.\nAnother benefit to using the same-brand soundbars and TVs is the ability to make a lossless wireless audio connection between the two – no HDMI cables required. Once again, this feature is supported by select TVs and soundbars from Samsung, which simply calls it Wireless Dolby Atmos, and LG, which calls its version WowCast.\nWhat is Eclipsa Audio, and does my soundbar need it?\nAt the recent CES 2025 trade show, Samsung announced a new immersive audio format meant to compete with Dolby Atmos. Eclipsa Audio was jointly developed by Samsung and Google, and it will be supported by new Samsung TVs and soundbars coming out in 2025. Other TV and soundbar brands didn’t announce any new products with Eclipsa Audio support at CES, but since Google is involved, the format will certainly be supported on future TVs that run the Google TV smart TV platform (Hisense, Sony, TCL, among others).\nEclipsa Audio differs from Dolby Atmos in that it’s a channel-based format. Dolby Atmos soundtracks are “object-based” mixes comprised of audio “objects” positioned in 3D space that are scaled to a specific speaker configuration (e.g., 7.1.4 Atmos, 5.1-channel surround, 2-channel stereo). Eclipsa Audio, in contrast, supports up to 28 input channels, which Samsung and Google say is sufficient to provide an immersive 3D audio experience on systems ranging from headphones to multichannel home theaters.\nWhile its license-free status should make it appealing to hardware manufacturers (Dolby, in contrast, charges licensing fees for Dolby Atmos), a key challenge that Eclipsa Audio faces is streaming services support. Dolby Atmos is firmly entrenched in the streaming ecosystem, while Eclipsa Audio is currently only supported by Google-owned YouTube. Given that situation, it’s safe to say that Eclipsa Audio support on soundbars is a non-issue for now, though it’s something to keep an eye on for the future.\nOther soundbars to consider\nWe’ve reviewed several soundbars recently that didn’t make this guide for various reasons, though they are also worth considering.\nBose Smart Ultra Soundbar: An all-in-one competitor to the Sonos Arc, but with a slight lack of heft to its sound and a limited sense of height, this soundbar isn't great enough value to make it into the list. You can read our full Bose Smart Ultra Soundbar review to learn more.\nSennheiser Ambeo Soundbar Plus: This soundbar really earns its keep with superior delivery of Atmos effects and extended bass. It's well worth consideration if you're looking for something that's a single-unit and if price isn't a worry, but it's expensive, and that's why it hasn't made our list here. Give our full Sennheiser Ambeo Soundbar Plus review a read if you want big sound without multiple boxes.\nSennheiser Ambeo Mini: If the price of the Sennheiser Ambeo Soundbar Plus is too much for your budget, this is a more compact and lower-cost model that provides a “big” sound, but doesn’t match the Plus when it comes to bass extension and Atmos height effects. It's a similar size to the Sonos Beam Gen 2. We'd choose that model over this one for overall audio quality, but you can read our Sennheiser Ambeo Mini review to learn more.\nSony Bravia Theater Bar 6: Sony's entry-level bar in its Theater lineup for 2025 delivers a powerful performance with awesome bass and full, clear and precise sound. It's also great value for money, but cheaper alternatives keep the Theater 6 off our list: for now. Read our Sony Bravia Theater 6 review for more info.\nNew soundbars arriving in 2025\nBelow are soundbars that we're either in the middle of testing or anticipate testing as 2025 rolls on. Some of these may even make it onto our list!\nFirst up, the Creative Stage Pro 2.1 is a budget-friendly, 2-channel soundbar that has a premium-looking design for cheap. This review is currently in progress.\nThe KEF XIO was recently announced and shown at Audio Advice Live 2025 and delivers a 5.1.2-channel configuration with a sleek, premium design. From what we heard, we were impressed. The KEF XIO joins a competitive all-in-one soundbar market with Marshall and Sonos, but it could be a real winner.\nFrom JBL, we have two entries: the JBL Bar 1000 MK2 and the JBL Bar 1300 MK2, the latter of which is the successor to the JBL Bar 1300X on our list. Two Dolby Atmos packages with rear speakers and wireless subwoofer included, JBL's standout feature is the detachable rear speakers, which can also be attached to the soundbar for easy movement and sound customization. We look forward to testing these out after having raved about the JBL Bar 1300X.\nHow we test the best soundbars\n☑️ More than 2,600 TV and home theater reviews\n☑️ 16 years of product testing\n☑️ Over 16,000 products reviewed in total\n☑️ Nearly 200,000 hours testing tech\nWhen we test the best soundbars, we look at categories such as audio performance, design, setup and usability, value for money and features - the same criteria we use for our reviews of soundbars.\nSources: After connecting the soundbar to a TV, we play not only streaming and 4K Blu-ray sources through the TV into the soundbar using the TV’s HDMI eARC connection (as 4K Blu-ray provides better audio quality than streaming), but also music over a Bluetooth wireless connection.\nAudio overview: For audio performance, there are several factors we look at when testing. Soundbars are often used to upgrade a TV's built-in sound, so dialogue clarity and volume are key, as that’s where built-in TV speakers usually struggle the most. We also test bass, mids and trebles by listening to how each range sits within a mix, and also whether the soundstage is wide or narrow.\nSpatial audio: Dolby Atmos spatial audio and surround sound (both virtually and physically through extra speakers) have become common features on soundbars, so we will test the effectiveness and spaciousness of the surround sound, as some people will want a room-filling home theater feel without all the boxes needed for a full AV setup.\nHDMI passthrough: When it comes to higher-end soundbars, we expect 4K 120Hz passthrough on HDMI ports and will test that feature if available. Gamers specifically look for this feature as some TVs don’t have the four HDMI 2.1 ports needed to cover both games consoles and a soundbar.\nMusic: Bluetooth streaming is more commonly being featured on soundbars as manufacturers look to offer an ‘all-in-one’ solution for movies and music. So, if a soundbar offers that feature, we’ll be sure to test its performance with streamed music. On more premium soundbars, we expect to see Wi-Fi streaming, although this is not always the case.\nSetup and ease-of-use: This is another area we test, as some soundbars carry a plug-in-and-play philosophy whilst others require more in-depth calibration. More soundbars are featuring auto-calibration features to adjust the sound for the room they’re installed in, and this can make a big difference in sound quality. As part of our tests, we’ll listen to a soundbar before and after this calibration to see just how much of a difference it makes.\nConsistency: While we strive to maintain consistency in testing conditions, some of our writers have different setups they’ll be listening in. However, the tests carried out and the testing criteria are the same for all our reviews.\nLatest updates\nAugust 6, 2025\nReplaced the Samsung HW-Q990D with the Samsung HW-Q990F as 'best for Dolby Atmos'. Removed the Sony HT-A7000 and the 'best for gaming' category. Added in a table with scores for each soundbar on this list labelled 'Comparison Chart'. Updated 'Other soundbars to consider' and 'New for 2025' sections.\nJuly 6, 2025\nAdded the Samsung HW-QS-700F as a new entry in the number 13 position as our ‘Best for wall-mounting’ choice.\nJune 6, 2025\nReplaced Sonos Arc Ultra with Marshall Heston 120 as 'Best all-in-one' option; added Sonos Arc Ultra as 'Best for expandability' option.\nRead more updates…\nMay 7, 2025\nAdded info on new Sony soundbars to 'New soundbars for 2025' section.\nApril 10, 2025\nAdded image galleries for all soundbars; added section 'Does my soundbar brand need to match my TV?' to the 'How to choose' FAQ.\nMarch 13, 2025\nReplaced Bose Smart Soundbar 600 with Bose Smart Soundbar, an upgraded version of the 600, as 'Best compact Atmos' option.\nFebruary 14, 2025\nAdded section 'What is Eclipsa Audio, and does my soundbar need it?' to the 'How to choose' FAQ.\nJanuary 16, 2025\nAdded section 'New soundbars for 2025' detailing models announced at the recent CES 2025 tradeshow.\nDecember 23, 2024\nReplaced the Samsung HW-Q800C with the Samsung HW-Q800D as best soundbar for most people due to the Q800C's waning stock levels.\nNovember 27, 2024\nSwapped the Sonos Arc for the Sonos Arc Ultra based on our testing, and re-ordered the list to make it easier to find specific types of soundbar.\nOctober 29,2024\nIntroduced the Ultimea Poseidon D50 as 'best super-cheap surround sound'. Removed the 'what soundbars were announced at CES 2024' section.\nSeptember 30, 2024\nAdded more information about how we judge soundbars to our intro. Added information about the Sonos Arc Ultra to the Sonos Arc entry. Updated some information about recently tested soundbars, and how we test.\nAugust 27, 2024\nAdded the LG S95TR as the 'best premium soundbar for LG TVs' option.\nJuly 30, 2024\nAdded the Amazon Fire TV soundbar as 'best super-cheap' option.\nJuly 1, 2024\nAdded the Hisense AX5125H as 'best budget Atmos surround' option.\nJune 6, 2024\nAdded the LG S95TR into the 'Also consider' section - as an alternative for LG owners to the Samsung Q990D.\nMay 6, 2024\nReplaced the Samsung HW-Q990C with the new Samsung HW-Q990D as 'best for Dolby Atmos' selection.\nMarch 28, 2024\nAdded 'Other soundbars to consider' section with details on recently reviewed models not listed in the guide.\nFebruary 28, 2024\nAdded in a 'How we Test' section, explaining what tests we carry out on the soundbars that we add to this guide.\nJanuary 22, 2024\nUpdated product write-ups to summarise the key points of each review and added in more internal linking to related products to help you choose the right soundbar for you. December 22, 2023 Added in 'buy it if' boxouts with quick pros and cons for each entry on the list.\nDecember 22, 2023\nAdded in 'buy it if' boxouts with quick pros and cons for each entry on the list.\nNovember 14, 2023\nReplaced the Samsung HW-Q700B with the Samsung HW-Q800C as 'best overall' due to stock levels. Replaced Sony HT-G700 with Sony HT-S2000 for 'best budget'. Deleted 'best mid-range Atmos' category.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nMatt is TechRadar's Managing Editor for Entertainment, meaning he's in charge of persuading our team of writers and reviewers to watch the latest TV shows and movies on gorgeous TVs and listen to fantastic speakers and headphones. It's a tough task, as you can imagine. Matt has over a decade of experience in tech publishing, and previously ran the TV & audio coverage for our colleagues at T3.com, and before that he edited T3 magazine. During his career, he's also contributed to places as varied as Creative Bloq, PC Gamer, PetsRadar, MacLife, and Edge. TV and movie nerdism is his speciality, and he goes to the cinema three times a week. He's always happy to explain the virtues of Dolby Vision over a drink, but he might need to use props, like he's explaining the offside rule.\n- James DavidsonTV Hardware Staff Writer, Home Entertainment"
    },
    {
      "url": "https://www.techradar.com/televisions/home-theater/i-listened-to-spatial-audio-on-a-7-4-4-channel-focal-speaker-system-and-now-i-need-to-up-my-dolby-atmos-music-game",
      "text": "I listened to spatial audio on a 7.4.4-channel Focal speaker system, and now I need to up my Dolby Atmos music game\nMusic to the immersive max\nFrench speaker manufacturer Focal is demonstrating a range of speaker setups and headphones at the Audio Advice Live show in Raleigh, NC, but the demo I was most excited to catch was its Utopia Cinema system.\nFocal’s 7.4.4-channel home theater setup consists of five Cinema LCR and two Focal 1000 IWLCR speakers, four Cinema Sub subwoofers, two IWSUB in-wall subwoofers, and four ICLCR5 in-ceiling Atmos speakers, all driven by a Focal Astral 16 audio processor and multiple Naim CI-NAP amps.\nThe system costs around $150,000 alone, with the Sony VPL-GTZ30 projector, 200-inch Stewart Filmscreen screen, and Kaleidescape movie player that Focal also used for its demo adding another 100K or so to the bill of sale.\nFocal screened several movie clips, including one of my reference go-tos for TV testing, the 2021 James Bond film No Time to Die, and the image from the 10,000-lumen Sony professional projector looked fantastically bright even on the enormous screen.\nThe sound was equally impressive, with the explosion when Bond makes an ill-advised visit to former flame Vesper Lynd’s gravesite conveyed with a level of impact and low-end rumble that one would expect to hear from six huge subs with dual 13-inch woofers.\nThe sweet sounds of Dolby Atmos music\nAs good as the Bond clip looked and sounded (and I have screened it innumerable times, so I know what to expect), what really grabbed my attention in Focal’s demo was the Dolby Atmos music selections.\nTwo songs were played, with the first being Elton John’s Rocket Man, from the 1972 album Honky Château. John’s piano had a solid yet wonderfully wide presentation that remained locked up front, while the soaring lead guitar and backing vocals spread above and around me in a manner that I found warm and engaging instead of gimmicky.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nThe next clip was a spatial audio remix of the electronic track On My Knees by Rüfüs Du Sol (those umlauts!) done by Techno Dad, a well-known YouTuber and friend of Focal. This was Atmos music to the max, with the trajectory of the bass-heavy, spatially adventurous mix graphically depicted in an onscreen display. Once again, I found myself utterly engaged, as well as curious to hear more demo-worthy Atmos music mixes, and on the best possible system.\nAfter a year or so settling for the best soundbars for music listening, it looks like I’m going to have to reinstall my big AV rig when I get home. Sadly, I’ll be limited to only one subwoofer, not six, but I’ll manage to make do.\nYou might also like\nAl Griffin has been writing about and reviewing A/V tech since the days LaserDiscs roamed the earth, and was previously the editor of Sound & Vision magazine.\nWhen not reviewing the latest and greatest gear or watching movies at home, he can usually be found out and about on a bike.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/tag/8k",
      "text": "8K\nLatest about 8K\nBest 5K and 8K monitors of 2025\nBy Steve Clark last updated\nBuying Guide Looking for ultra-high resolutions and ultra-sharp picture quality? We reviewed the top 5K monitors and 8K monitors for professionals.\nThis is the first 8K 120Hz monitor ever produced - but I don't think the tech market will ever be ready for it\nBy Wayne Williams published\nNew 8K monitor by BOE supports 120Hz at full resolution but real-world usability is still in doubt.\nDOOM: The Dark Ages looks stunning at 8K with new lighting effects – but it almost humbled my Nvidia RTX 5090\nBy Matt Hanson published\nGaming @ 8K DOOM: The Dark Ages at 8K isn’t just about reliving the past – it’s also showing the future of PC gaming.\nOblivion Remastered in 8K with the Nvidia RTX 5090 looks to the past to show gaming's future – both the good and the bad\nBy Matt Hanson published\nGaming @ 8K Bethesda's iconic game Elder Scrolls IV: Oblivion just got a surprise remaster – so how does it run at 8K?\nHorizon Forbidden West at 8K 120Hz was just shown on a Samsung 8K TV in world-first demo – but a few caveats might spoil your excitement\nBy Carrie Marshall published\nIt was a customized TV… but why, when the new Samsung TVs should support this tech?\nPlaying Assassin's Creed Shadows at 8K with the Nvidia RTX 5090 was a nightmare - until I turned on Multi Frame Gen\nBy Matt Hanson published\nGaming @ 8K We've got a brand-new 8K test PC packing the mighty Nvidia RTX 5090 - and we're taking it for a spin with Assassin's Creed Shadows.\n'Revolutionary' Wi-Fi router which can send data up to 10 miles away goes on sale for less than $100 - just make sure you're happy with the 32Mbps speed\nBy Efosa Udinmwen published\nMorse Micro’s MM-HL1-EXT router delivers 10-mile Wi-Fi HaLow connectivity with low power consumption for IoT and industrial applications.\nThe best 8K TVs: super-detailed displays from Samsung and LG\nBy Al Griffin last updated\nBuying Guide The best 8K TVs are for when 4K just doesn't quite cut it, and can even be found for less than you'd expect.\nNvidia RTX 5090 8K performance has blown me away already - and it's mainly thanks to Multi-Frame Generation\nBy Matt Hanson published\nGaming @ 8K With the Nvidia RTX 5090 FE installed in our 8K test system, I was hoping to be impressed - but I wasn't prepared for just how impressed I was going to be...\nSign up for breaking news, reviews, opinion, top tech deals, and more."
    },
    {
      "url": "https://www.techradar.com/televisions/harman-kardons-new-dolby-atmos-soundbar-is-like-a-sonos-arc-ultra-but-with-all-the-features-sonos-left-out",
      "text": "Harman Kardon’s new Dolby Atmos soundbar is like a Sonos Arc Ultra, but with all the features Sonos left out\nHello DTS:X and HDMI pass-through\nThe big Harman booth at Audio Advice Live 2025, which took place in Raleigh, North Carolina, from August 1-3, was packed with displays from the company’s many brands, including JBL, JBL Synthesis, Arcam, and, yes, Harman Kardon.\nAmong the products being demonstrated was the new Harmon Kardon Enchant 1100, a flagship 11-driver, 5.1.2-channel Dolby Atmos soundbar that, at $999 (around £750 / AU$1,500), is priced comparably to the Sonos Arc Ultra, one of the best soundbars, and a model designed to be the centerpiece of a multi-room home theater and music system.\nLike the Arc Ultra, the Enchant 1100 can be expanded upon by adding an Enchant Sub wireless subwoofer ($449, around £340 / AU$700) and Enchant Speaker wireless surround speakers ($349, around £260 / AU$540 each).\nWith an upfiring Dolby Atmos driver embedded in the top surface of each Enchant speaker, adding a pair to the Enchant 1100 bumps things up to a 7.1.4-channel Dolby Atmos configuration, for even greater home theater immersion.\nThe Enchant 1100 can be linked with Enchant Speakers situated around the home as part of an app-controlled multi-room music system – another area where it crosses over with the Sonos Arc Ultra. In that scenario, the Harman Kardon One app can be used to stream music over Wi-Fi from apps including Spotify and Tidal to the system’s various speakers. Four total zones are supported by the Harman Kardon One app, along with eight total devices.\nIn addition to the 1100, Harman Kardon is offering the Enchant 900 soundbar ($549, around $410 / AU$850), a smaller, 9-driver model with similar features to its big brother that can also be used in a 5.1.2-channel Atmos theater setup.\nAll Enchant models are scheduled to ship in October of 2025.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nThe DTS:X factor\nOne way the new Harman Kardon Enchant 1100 beats the Sonos Arc Ultra is by including support for the DTS:X immersive audio format along with Dolby Atmos. Not having DTS:X was a major complaint we had in our review of the Arc Ultra, and Harman Kardon was savvy enough not to go down the same dark path.\nAnother issue we had with the Arc Ultra in our review was its connectivity, which is limited to a single HDMI eARC port. The Enchant 1100 features both an HDMI eARC port and an HDMI pass-through input with Dolby Vision support, along with an optical digital input – another feature the Arc Ultra lacks.\nI didn’t get a chance to check out the Harman Kardon One app at the demo, but I’m expecting that the app, which lets you make sound adjustments and perform automatic sound calibration, along with setting up and controlling the system, will be easier to use than the Sonos app, which has been buggy to the point of scandal in recent years.\nThere was too much crosstalk from the various clashing demos in Harman’s Audio Advice Live booth to get a true sense of the Enchant system’s capabilities, but in the few moments where I did get a listen, its sound was loud and punchy enough to bring action movies to vivid life.\nI look forward to hearing how the Enchant Speaker compares to the Sonos Era 300, another compact Dolby Atmos-capable wireless speaker with upfiring drivers that can be used either as a surround sound speaker in an Atmos home theater system, or as a stereo speaker (standalone or paired). At $349, the Enchant is priced significantly lower than the $449 Era 300, making it a solid option for both types of setups.\nYou might also like\nAl Griffin has been writing about and reviewing A/V tech since the days LaserDiscs roamed the earth, and was previously the editor of Sound & Vision magazine.\nWhen not reviewing the latest and greatest gear or watching movies at home, he can usually be found out and about on a bike.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/televisions/home-theater/kaleidescape-strato-v-movie-player-review",
      "text": "TechRadar Verdict\nThe Kaleidescape Strato V is an outstanding player that addresses two of the main criticisms aimed at the brand’s products – high cost and a lack of Dolby Vision support. By combining player and server into one sleek and beautifully made unit, you can enjoy all the benefits of Kaleidescape’s unique business model without breaking the bank.\nPros\n- +\nExceptional video and audio performance\n- +\nIntuitive and responsive interface\n- +\nSupports Dolby Vision\nCons\n- -\nCheaper but still not cheap\n- -\nLimited onboard storage\n- -\nNo backlight on the remote\nWhy you can trust TechRadar\nKALEIDESCAPE STRATO V: One-minute review\nThe Kaleidescape Strato V is the latest Movie Player from Kaleidescape, and it represents a definite shift for the company. Kaleidescape is synonymous with a premium movie experience at home, offering a proprietary ecosystem based around its own hardware and servers. While no one questions the quality of Kaleidescape’s products, the price of admission has been steep and the lack of Dolby Vision support has been a glaring omission given the brand’s pursuit of high-end video and audio performance.\nThe new Kaleidescape Strato V addresses both of these issues by offering Dolby Vision support and lowering the cost of entry. To achieve this, the Strato V integrates a 960GB solid-state hard drive, and while that means it can only store around ten 4K movies downloaded from the company’s Movie Store at any one time, at least it combines the movie player and movie server into a single, more affordable device that's an excellent alternative to the best 4k Blu-ray players.\nWith Kaleidescape, you can immediately access a huge library of films, TV shows, and concert videos, with new titles often available months before any disc release. The picture and sound quality are exceptional, with stunning 4K HDR10 and Dolby Vision images and full lossless audio that includes Dolby Atmos and DTS:X – something you don’t get from the best streaming services, which only provide compressed soundtracks. The result is a performance that’s at least equal to a disc but without taking up all your shelf space. So if you want convenience without any compromise look no further than the Strato V.\nKALEIDESCAPE STRATO V review: Price & release\n- Price: $3,995 / £5,379\n- Release date: September 2024\nThe Kaleidescape Strato V is available now through registered dealers and online sellers like Best Buy in the US and retails for $3,995 / £5,379. While this certainly isn’t cheap it’s definitely more affordable than the alternative of buying the Kaleidescape Strato C Movie Player. The latter costs about the same but doesn’t support Dolby Vision and requires you to buy one of Kaleidescape’s Terra Prime servers, which are very pricey. Of course, if you want to expand the storage of the Strato V you can add a Terra Prime server, although the extra cost does rather defeat the whole point of buying one.\nKALEIDESCAPE STRATO V review: Specs\n| Built-in storage | 960GB SSD | Row 0 - Cell 2 |\n| Resolutions | Up to 4K (3840 x 2160) 60p | Row 1 - Cell 2 |\n| Bit rate | Up to 100Mbps | Row 2 - Cell 2 |\n| Audio support | Dolby TrueHD, Dolby Atmos, DTS-HD Master Audio, DTS-X | Row 3 - Cell 2 |\n| HDR support | HDR10 and Dolby Vision | Row 4 - Cell 2 |\n| Aspect ratios | 1.78:1 and 2.35:1 (automatic or user interface selectable) | Row 5 - Cell 2 |\n| Connectivity | HDMI 2.1, coaxial and optical digital audio | Row 6 - Cell 2 |\n| Dimensions | 20 x 3.9 x 25cm (WxHxD) | Row 7 - Cell 2 |\n| Weight | 1.91kg | Row 8 - Cell 2 |\nKALEIDESCAPE STRATO V review: Design\n- Great build quality\n- Kaleidescape remote app\n- Control over Ethernet\nThe Kaleidescape Strato V certainly looks like a premium product with a sleek, stylish and very well-made cabinet that uses a combination of a 3mm-thick black anodised aluminium chassis combined with a 3mm-thick black glass front with an illuminated Kaleidescape logo. The unit is silent in operation and includes a 960GB solid-state drive, along with a powerful system-on-chip (SoC).\nThe unit is only 20cm wide, which might disappoint those who like their AV equipment full width, but there’s an optional faceplate for mounting in an equipment rack. There’s also a dual faceplate for use with a compact Terra Prime server, along with a wall bracket for mounting behind a TV.\nThe connectivity is at the rear, with a gold-plated HDMI 2.1 output, a coaxial digital audio output using a gold-plated RCA phono connector, and an optical digital output. There’s also a gigabit Ethernet port, a USB 3.0 port, an IR input, a service port, and a 12V input for the included power adapter brick. There is no Wi-Fi connectivity, so you will need a wired Ethernet connection for downloading movies, accessing the web interface, updating firmware and using the control app.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nThe included remote is small and simple but gets the job done. There’s no backlight, which can be annoying in a pitch-black home cinema, but given Kaleidescape’s target market, chances are you’ll be using a third-party control system over Ethernet like Crestron, AMX, Savant or Control4. There’s also the Kaleidescape app (iOS or Android) which makes an effective controller, providing an alternative to the remote with its handy swipe function and access to the Kaleidescape Movie Store.\n- Design score: 5/5\nKALEIDESCAPE STRATO V review: Features\n- Scalable storage options\n- Highest quality video\n- Fully lossless audio\nThe Kaleidescape Strato V’s primary function is as a high-end movie player that offers the best video and audio compared to any device on the market. To achieve this it supports every resolution up to 4K (3840 x 2160), and frame rates up to 60p. It also supports HDR10 and Dolby Vision high dynamic range, plus lossless audio up to and including Dolby Atmos and DTS:X.\nCrucially, it isn’t limited to certain file sizes as with a 4K disc, nor is it restricted to lower bit rates like streaming services – supporting file sizes of over 100GB and speeds up to 100Mbps. As a result, when you buy or rent movies, TV shows or concerts from the Kaleidescape Movie Store you’re guaranteed the best picture and sound possible from a home entertainment product.\nThe Strato V is primarily designed to operate as a standalone unit, which is why it has a built-in solid-state hard drive. The downside is that the number of movies you can store at any one time is limited to around 10, and if you want to watch something else you have to download it. Once you purchase a title from the Kaleidescape Movie Store it remains accessible in your collection for download, even if it isn’t stored locally on the Strato V.\nIf you would rather store your entire collection on a drive for instant access you can connect to one of Kaleidescape’s Terra Prime servers. While doing so is obviously more expensive, and the built-in SSD is no longer available, the process is simple and won’t affect the Strato V’s performance in any way. It’s great to have the option to scale up the storage, even if you never actually need to.\n- Features score: 5/5\nKALEIDESCAPE STRATO V review: Setup\n- Web-based interface\n- Selectable aspect ratios\n- Cataloging your discs\nThe Kaleidescape Strato V is incredibly easy to set up, and all you need to do is plug in the power brick, attach an Ethernet cable and connect to your display, or in my case an AV processor. Kaleidescape even includes a THX Certified HDMI cable, which is a nice touch. Once powered up, just follow the onscreen instructions and you’ll be up and running in no time.\nThe initial options allow you to set up the Strato V as a standalone player, configure it as a new system with a Terra movie server, or add it as a new zone to an existing Kaleidescape system. When set up as a standalone player it operates independently, only playing movies stored locally on its internal drive, and can’t be grouped with other Strato V units for additional storage.\nAfter I selected standalone mode, the activation page appeared. You then either enter your email address if you already have a Kaleidescape account or create a new one. Once you’ve entered your email address you’ll receive a confirmation email to activate the player. You’ll obviously need to add your credit card details as well for making purchases from the Kaleidescape Movie Store.\nThe web-based interface offers access to all of the Strato V’s setup options and is my preferred choice for the initial installation, although once completed the remote is fine for accessing your movies on the player (Ready to Play), and navigating the Kaleidescape Movie Store and general settings.\nIn terms of the initial settings you can leave most at their defaults because the Strato V will read the EDID from your display, receiver or processor and optimise accordingly. The one area you may need to adjust manually is the aspect ratio, especially if like me you use a 2.35:1 projector screen. This feature works brilliantly, not only formatting the screens and menus for the wider aspect ratio, but also automatically rescaling 1.85:1 content within the ‘Scope ratio screen.\nThe main reason for buying a Strato V is access to the Kaleidescape Movie Store, and here your experience will really depend on on where you live. In the US the choice is huge and new films are added months before they’re released on disc, whereas elsewhere the choice isn’t as impressive, and films take longer to be added. I appreciate that studio agreements will differ from territory to territory, but given the store is the main feature it’s a bit frustrating if you live outside the States.\nOne final feature that Kaleidescape offers is the option to catalog your physical Blu-ray and DVD collections into a digital format. You’ll need to connect an external disc drive via USB, but once connected, the Strato V enters Recognition Mode. Insert a disc into the drive, and the Strato begins cataloging it. The process only takes a few seconds, and you can then see the title in the Store under Digital Offers – sometimes with a discount for the digital version.\nKALEIDESCAPE STRATO V review: Performance\n- Well-designed and intuitive interface\n- Exceptional picture and sound quality\n- Excellent upscaling of lower resolutions\nThe Kaleidescape Strato V is a rock-solid media player thanks to its intuitive user interface, and is also very responsive in operation. The Ready to Play page has titles from the Store along the top, a second layer showing the unwatched titles currently on the internal drive, followed by a layer of paused movies, then the played movies, and finally any movies you’ve marked as favourites.\nUnlike the Strato C, the Strato V doesn’t show you all the films you’ve bought on the home page, only those on the internal drive. If you want to see the complete collection you’ll need to go to your account on the Movie Store, but this keeps things neat and tidy. The system automatically deletes the oldest played content to free up space, unless you mark a title as a favourite.\nWhen you click on a title you get information about it, along with options to play, pause or choose a specific scene. When something is playing you can also press the up button on the remote and see additional information such as audio options and subtitles. The entire process is completely seamless, and I never had any issues with playing, pausing or stopping movies. It’s also worth pointing out that the Strato V runs completely silent and cool in operation.\nThe process of buying titles from the Movie Store couldn’t be easier, and you can access it via the Kaleidescape website, through the player’s interface or even using the app. There are thousands of titles available for purchase or rental, many of which haven’t even been released on 4K disc yet.\nI found deleting existing films off the internal drive and downloading new ones onto it to be straightforward. If you decide to rent rather than purchase a title, it will remain on your system for 30 days, and once you begin watching it there’s a 48-hour window. If you like the film and decide to buy it within the 30-day rental period, half the rental price is credited towards the purchase.\nThe speed of download will depend on your internet connection – if you’re lucky enough to have gigabit speeds you can download movies in around 10 to 15 minutes. Unfortunately, I live in the countryside and only have speeds of 50Mbps, so it took about two hours to download a movie.\nWhen you buy a title it might offer 4K Dolby Vision and 4K HDR10 versions, but even if your display doesn’t support Dolby Vision you still download the former. The Strato V will automatically output whatever your display is capable of handling, while the 4K HDR10 version is only intended for the Strato C because that player doesn’t support Dolby Vision at all.\nKaleidescape’s use of larger file sizes and higher bit rates results in stunning images that are at least as good as the equivalent 4K Ultra HD disc, if not better. I watched a number titles, including Top Gun: Maverick, Dune Part 2, and Furiosa, and the picture quality is simply stunning. The 4K images are sharp and detailed, the HDR10 or Dolby Vision is delivered precisely, and the overall presentation is free of any compression artefacts or other issues.\nWhile you can obviously watch movies on streamers, or via VOD services like iTunes and Prime Video, Kaleidescape offers a quantum leap in quality. In fact, the larger file sizes mean it can even surpass 4K Blu-rays at times. A good example is Once Upon a Time in the West, which is a three-hour movie that gets crammed onto a 66GB 4K Blu-ray disc. Kaleidescape’s file is significantly larger, providing more space and a higher bit rate, which results in a better-defined image when directly comparing this film on both formats.\nThe audio is equally impressive, with full lossless support for Dolby Atmos and DTS:X. While streaming services may offer Atmos, it is usually delivered via lossy Dolby Digital Plus, but with Kaleidescape you’re enjoying the same full lossless experience you get with Blu-rays. Hans Zimmer Live in Prague sounds amazing in Atmos, while Harry Potter and the Prisoner of Azkaban benefits from a DTS:X soundtrack that really brings the wizarding world to life. The scene where the dementors search the Hogwarts Express is doubly scary thanks to the genuine scale and really deep bass.\nWhile I expected the 4K images to look superb, I was equally impressed by the quality of the Strato V’s upscaling. When watching lower-resolution content the picture is clean and well-defined, with no obvious scaling artefacts. The same is true when the player automatically re-scales 1.85:1 content within the 2.35:1 aspect ratio – the process is seamless and the results are free of any scaling artefacts.\n- Performance score: 5/5\nKALEIDESCAPE STRATO V review: Value\n- It’s a significant investment\n- There’s no direct competitor\nThe idea of value for money is always relative, and there’s no denying the Kaleidescape Strato V represents a significant investment. However, once purchased the ability to buy new movies months before they arrive on 4K disc in quality that’s at least as good, if not better, and without taking up shelf space is very appealing. This is especially true if you live in the United States, where the Movie Store library is genuinely impressive.\nIf on the other hand you’re the kind of person who prefers owning physical media, just to be on the safe side, and you don’t mind waiting for the disc to come out, then you could simply buy a media player and storage, rip your own discs and create a custom server for significantly less. The beauty of Kaleidescape’s unique ecosystem is that they do everything for you, so all you have to do is sit back and enjoy your favourite movies.\n- Value score: 5/5\n| Attributes | Notes | Rating |\n|---|---|---|\n| Design and features | Elegant but minimalist styling combined with excellent build quality; Intuitive user interface and scalable storage | 5/5 |\n| Picture quality | Large file sizes and massive bit rates result in superb 4K and HDR10/Dolby Vision picture quality; lossless soundtrack support delivers impressive object-based audio with Dolby Atmos and DTS:X | 5/5 |\n| Value | Significant value for money; no direct competition | 5/5 |\nKALEIDESCAPE STRATO V review: Should I buy it?\nBuy it if…\nYou want the best video and audio quality:\nThe larger file sizes offered by Kaleidescape, along with bit rates up to 100Mbps, ensure that 4K and HDR10/Dolby Vision performance is the best of any device on the market.\nYou want a slick and intuitive user interface: The Strato V’s intuitive user interface and high-powered processing ensure that downloading and watching content is a seamless, responsive and enjoyable experience.\nYou want early access to the latest movies: In the US in particular the Movie Store offers films months before they are released on UHD disc, and there are even 4K titles available that aren’t currently on physical media.\nDon't buy it if…\nYou want to collect physical media: Kaleidescape’s system is based on a download model with titles accessed from an online account and stored on built-in drives. If you prefer physically owning content, discs are still your best bet.\nYou want to rip your disc collection: The cataloguing feature aside, the Strato V is designed to access Kaleidescape’s Movie Store and download content. if you want to rip discs you’re better off buying a media player and storage.\nYou want a streaming service: This is not a subscription streaming service like Netflix. Instead, you buy titles as very large files that, depending on your internet, can take a long time to download, but the picture and sound quality is significantly better.\nHow I tested the KALEIDESCAPE STRATO V\n- Reviewed in a dedicated home cinema\n- Video evaluated using 4K, HDR10 and Dolby Vision\n- Audio evaluated using Dolby Atmos and DTS:X\nI tested the Kaleidescape Strato V in my reference home cinema where the video is handled by a JVC DLA-NZ900 projector, and the audio is configured in a 9.4.6-channel configuration using a Trinnov Altitude16 AV processor and 16-channel power amplifier.\nI extensively tested 4K and HDR10 video, along with Dolby Atmos and DTS:X lossless spatial audio in the home cinema, although for completeness I also used an LG G4 OLED TV in my living room to test the Kaleidescape Strato V’s Dolby Vision capabilities.\nKaleidescape was kind enough to include a number of films pre-loaded, as well as more in the account, along with a credit for additional purchases and rentals. This provided me with an opportunity to test every aspect of the store and overall ecosystem.\n- First reviewed: December 2024\n- Read TechRadar's reviews guarantee\nStephen is a freelance reviewer with over ten years experience writing for all the major tech publications. As a lifelong film fan he’s embraced the evolution of home entertainment over the decades, and as a professional audio and video calibrator he’s able to keep abreast of the latest developments and innovations. When not reviewing the latest products, Stephen can be found obsessing over how to cram a bigger screen and more speakers into his own home cinema."
    },
    {
      "url": "https://www.techradar.com/televisions/home-theater/how-room-correction-upgrades-your-home-theater-sound",
      "text": "How room correction upgrades your home theater sound\nYour AV receiver's most important feature\nWe have an important question for TechRadar's Home Theater Week: What’s your AV receiver’s most valuable feature? Dolby Atmos surround? HDMI flexibility? Lotsa of watts from lotsa channels?\nThe answer is none of the above: it is the “room correction” system embedded in its setup routines. “Room correction” is a broad term that encompasses two major functions. First, the sensing, and measurement of the room acoustics in which the system finds itself and of the loudspeakers it employs; second, the calculation and implementation of “corrective” filters – equalization – to optimize the speakers and to mitigate, to at least some degree, room effects.\nFirst, alas, a bit of acoustics. Any room will have what is termed “modes,” which are areas of lower and higher pressures, and thus sound intensities, dictated by the dimensions of length, breadth, and height. (Non-rectangular spaces make things much more complicated, but just considering shoebox-shaped rooms is plenty for our purposes.)\nAs an analogy, the same thing happens in a calm swimming pool when you toss in a coin: as the ripples reflect from the walls in all four directions, areas of steeper ripples and flatter, calmer water will evolve, as the waves bounce back and forth, some “in phase” creating the ripple-ier areas, and some “out-of-phase” yielding flat water. Back in our listening room, because low frequencies – bass – are, for reasons we needn’t go into here, effectively omnidirectional, these suffer the strongest, and most troublesome impacts of room modes: areas of stronger, sometimes very much stronger bass, and areas where bass is weak or even almost nonexistent.\nYou can demonstrate this to yourself by playing a music track with strong, regular bass and moving around the room. Stick your head in a corner near floor level, and you will always hear powerful, pounding bass, while at some places out closer to the center of the room, the bass will sound weak or even altogether absent.\nRoom correction technologies: what they do\nEnter room correction: technology that can make real loudspeakers interacting with real rooms perform better. Room correction systems are found in nearly all AV receivers (AVR) and preamp/processors these days, and in some stereo, powered-loudspeaker, and preamplifier components, too. There are myriad “brands,” the most widespread being Audyssey and Dirac, but several major manufacturers have proprietary systems as do a few less widely known high-end and specialty makers. In every case, in terms of what they actually do, these all tackle substantially the same tasks: identify the number and “size” (low-frequency capabilities) of the system’s speakers and each one’s relative loudness; determine each speaker’s distance from the listening position and set delays such that each one’s output arrives there simultaneously; and lastly, create and implement filters to tame the worst of the room modes’ unwanted emphases.\nIn the most common scenario, when you enter an AVR’s “setup menu” routine you are encouraged to initiate an auto-correction routine, which begins with plugging in a small measurement microphone included with the receiver (a few high-end exceptions require you to supply your own, higher-performing mic), and place it at your main listening position at head height. You then press the “go” button on the on-screen menu, which begins a series of test signals, which may be clicks, chirps, or swoops, that sequence through all the speakers connected in your system: usually, left, center, right, left/right-surround, and subwoofer, plus any rear, side and overhead or “height” surround channels that are present. As each click, chirp, or swoop is “heard” by the microphone, the not-so-small computer inside the receiver, preamp, or whatever analyzes two things: the precise arrival time of each frequency contained in the test signal, and the amplitude (loudness) of each of these as well.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nThe system now has a precise “map,” in both the time- and amplitude domains, of the performance of each speaker. It knows how far away it is, to within a millimeter or so, and how loudly or softly it is reproducing each important band of frequencies: deep bass, mid-bass, midrange, treble, and so on. It can thus set important parameters for each speaker: “distance” (time-delay) so that all sounds reach the ears perfectly aligned in time; “size,” selecting a crossover point that frees each speaker from trying to reproduce deeper bass than it is capable of and directing this to the subwoofer; and equalization, a “turning up” or “turning down” of precise, narrow-band virtual “tone controls” that compensate for – “correct” – the impact of the room modes on each speaker, in each location.\nAn important note: while room correction can be quite effective at reducing the frequency response peaks induced by room modes, they can do little to mitigate the attendant dips: pouring gallons of water into an unplugged sink still doesn’t fill it up. So setting up a listening room’s speaker and listener locations to avoid the worst of these nulls remains important.\nNow, this map only applies to one microphone position, and because room modes are so spatially fickle (and because all speakers are less than perfectly omnidirectional above bass frequencies), as soon as you slide over on the sofa, these corrections are now less correct – sometimes a lot less. Thus, since none of us listen or watch with our head in a vise, and most of us do so in company, most room correction systems repeat the process using additional microphone positions: typically, a few feet to either side and forward and back. Importantly, after the MLP (main listening position) the exact location of subsequent mic locations is not terribly important; it’s the difference in responses from one placement to the next that allows the system to analyze the room, and to then calculate an averaged correction map that will mitigate the worst errors for everyone on the couch (or in a few rows of a big home theater), more or less equally.\nRoom correction technologies: how they do it\nAll room-correction systems rely on DSP – digital signal processing – to perform the necessary audio manipulations. Consequently, sounds received by the setup mic are first transformed into digital audio signals that can be analyzed and massaged by the DSP hardware (effectively, a dedicated digital audio computer) within the AVR or other component, as will be all music or movies played back using room correction. There are a few different technical types of digital filters the different systems employ, for which pencil-protector partisans will argue various virtues and drawbacks, but all of this is relatively unimportant to us here.\nWhat is important is that regardless of type, digital filters can transform very narrow bands of sound without modifying adjacent bands, and without seriously impacting overall sound quality, something impossible for earlier-era analog filters.\nWhat’s the Upside?\nThe most obvious benefit of room correction is smoother, more accurate bass. Typical room modes often boost relatively narrow bands of bass (an octave or so) by vast amounts (10 dB is not unusual), and diminish adjacent ones by similar degrees. As a result, some bass notes will boom while others all but disappear – not good. Just as egregiously, all this “bass build-up” reflects around the room, muddying our perception of the midrange octaves so critical to timbral naturalness, detail, and spatial cues. So while more accurate bass may seem the tallest trophy, to many ears the clarifying and “focusing” of vocal and instrumental elements, and the revealing of a recording’s acoustical-space signature yielded by effective room correction are at least as valuable.\nWhat about the treble? This is a thornier subject. Many experts feel that room correction above the lower midrange is not warranted, because room modes don’t hold sway (unless you’re in a really tiny closet) below a few hundred Herz. However, if the speakers in use have substantial response errors in the mid and high-frequency octaves, room-correction systems can measure these, and equalize accordingly. Many systems let the user set an upper limit to the correction process.\nAnother important feature offered by most room-correction systems is a “target curve.” Research has long shown that listeners find an overall response that slopes very gradually downward from the bass frequencies to the highest treble sounds more convincingly lifelike. So most correction systems include the ability to select one or more such curves, integrating all the speakers to conform to it. A few have such a curve baked right in, though most offer user selection of one or two such choices.\nWhere it came from\nAcoustical scientists have been studying the behavior of sound in rooms since at least the 19th century, but only in the past few decades have we become able to do much about it other than moving around our speakers and our heads to find the most acoustically advantageous locations. (And Murphy’s Law being what it is, these are almost never where other, less audio-afflicted residents want the speakers and the sofa. Many a divorce lawyer’s boat has been purchased with the proceeds.) This is because, for deeply technical reasons, analog equalization such as that employed in old-fashioned graphic equalizers or bass and treble controls was not very effective at taming modes. But with the advent of digital audio came the ability to shape digital equalization algorithms that can modify very narrow frequency bands, and manipulate time-domain behaviors with great precision.\nThis sort of research was ongoing throughout the latter fourth of the 20th century, but its first commercial manifestation came from an academic project at the University of Southern California under the aegis of Film School professor Tom Holman, he of THX fame, and engineering school professor Chris Kyriakis. From this study grew Audyssey Laboratories, which licensed its initial commercialized solution, Audyssey MultEQ, to a handful of AV receiver makers. By the mid-2000s, Denon, Marantz, Onkyo, and numerous other makers were incorporating Audyssey room correction in their AVRs, while several others developed their own proprietary systems by 2010 or so.\nMeanwhile, at around the same time in Sweden and France, similar research projects spawned two more “corrective” firms. Dirac Research AB, a Swedish company, today offers its Dirac Live range of audio correction technologies for home, car, studio, and other sound environments. Dirac does much the same things as Audyssey, though its technical underpinnings are a bit different.\nThe French project, which evolved from studies of spatial audio recording and reproduction at Paris’ famous IRCAM music and acoustics research center, yielded Trinnov Audio. Trinnov began by providing acoustical and spatial hardware and software in the pro-audio space, but in the past decade has branched out into becoming a hardware manufacturer as well with its Altitude range of 16-, 24-, and even 48-channel (!) home-theatre preamp/processors. These incorporate sophisticated acoustic-correction technologies dubbed the Trinnov Optimizer.\nAudyssey MultEQ\nAudyssey was the first to bring room correction to market. Its latest version, called MultEQ-XT32, is found in most Denon and Marantz AVRs (and in McIntosh’s AV processors). XT32 runs on the hardware within the AV receiver or preamp to implement the actual filters (corrections), controlled through its on-screen display. A bit less powerful, MultEQ (no “XT32”) may be included on some lower-end models, and numerous older, discontinued ones, including some from Onkyo/Integra among others. Notably, the XT32-flavor Audyssey can integrate up to four individual subwoofers, effectively creating a single, coherent bass system tuned to the room. Audyssey also offers the MultEQ Editor iOS/Android app ($20, around £15 / AU$30), which displays response curves, enables more detailed correction options, and delivers user-modification abilities not available otherwise.\nThe firm’s rather confusingly named MultEQ-X is a Windows-only PC application, available only at the Microsoft store, that does all these things and a lot more. Using the outboard computer’s horsepower, MultEQ-X delivers more detailed correction and user-tailoring options and displays. The Windows application itself is free, but you must buy an individual license ($200, around £150/ AU$300) for your specific AVR model. (There is, alas, as yet no MacOS version.) Any AVR compatible with the MultEQ Editor (most Audyssey-enabled hardware from the last two or three years) can use MultEQ-X.\nDirac Live\nDirac Live is also encountered on many current AV receiver models, including most of the same Denon and Marantz models featuring Audyssey MultEQ/XT-32, plus some from Arcam, Emotiva, Integra, NAD, Pioneer, and a few other, less commonly seen brands. Unlike Audyssey, Dirac requires external hardware: an iOS or Android smartphone or tablet, or a Mac or Windows computer. The corresponding softwares are all free, but you must purchase a license for your hardware, and several licensing tiers enable features beyond the basic room correction. Licenses start at $259 (around £200 / AU$380) for Dirac Live Limited Bandwidth, which cuts off correction at 500 Hz – plenty for the majority of room-correction benefits. The Full Bandwidth (up to 20 kHz) version is $100 more. Dirac Live Bass Control Single Subwoofer, which delivers enhanced integration and accuracy to a single sub, is a $349 (around £265 / AU$515) add-on, while a multi-subwoofer version is $499 (around £380 / AU$740). Upgrades from one version to another are available at no penalty, and a couple of bundles save a few bucks, but anyway you slice it Dirac Live is not an inexpensive feature.\nTrinnov Optimizer\nFrance’s Trinnov’s Optimizer is arguably the most powerful room-correction system, but it’s also the least widely found: Trinnov is only applicable to the firm’s own line of AV processors, which start at an eye-watering $18,500 (around £14,1000 / AU$27,325). There’s also a JBL surround processor derived from a Trinnov model.\nTrinnov components are bundled with a unique, multi-point microphone that the firm claims collects much more precise room data, including time-domain and phase info, which the Optimizer can use to time-align loudspeakers so that sound from individual drivers arrive simultaneously. (The importance of such phase issues is much debated, since midrange and treble sounds inevitably reflect from multiple room surfaces multiple times, creating far more complex time-domain “errors,” and in fact swamping the direct sound reaching the ears first.) Trinnov’s Optimizer also incorporates a speaker “re-mapping” feature to acoustically shift speakers that are forced by room layout to be less than optimally located.\nThe Next Wave\nRecently, both Dirac and Trinnov have previewed a new wave of room-correction technologies: active low-frequency correction. Dubbed “Active Room Treatment” by Dirac, and “WaveForming” by Trinnov, in their broad outlines these seem generally similar. Both require fairly elaborate arrays of multiple subwoofers, some or all of which are employed in part to generate what I think of as “anti-bass” – much the way noise-canceling headphones synthesize anti-noise to cancel out unwanted sounds. These technologies can direct bass into the listening space in a way that avoids room modes, at least to some extent. And they can not only cancel out the bass peaks induced by room modes (which filter-based, EQ correction systems already do quite effectively) and quash the attendant bass build-up that thus occludes mid- and high-frequency sounds, they can also “fill-in” the adjacent bass dips – again, to some extent. And this is something that EQ alone, even the digital EQ used in room correction systems, cannot do.\nAs best we can tell, the only products available so far that feature Dirac’s Active Room Treatment technology are StormAudio’s line of AV receivers and processors, which start at $14,000. WaveForming is currently available on all Trinnov processors.\nMost of the Rest\nAs mentioned, there are plenty of additional room-correction technologies out there. Anthem Room Correction (ARC) is found on the Canadian firm’s AVRs, and is generally well-reviewed. Other proprietary systems, each with its own acronym, from Onkyo (AccuEQ), Pioneer (MCACC), Sony (DCAC), and Yamaha (YPAO) have garnered varying levels of praise.\nNext come subwoofers: selected woofs from Elac, MartinLogan, SVS, and many others incorporate bottom-octaves-only correction. Many of these use a smartphone/tablet’s onboard microphone for the measurement process with surprisingly good results. Critically, of course, subwoofer correction can’t do anything about room-mode problems above the subwoofer’s crossover – usually below 120Hz or so – and many if not most of the severest modes in typical rooms will fall right around that point.\nNumerous two-channel room-correction systems exist, both built into products and free-running on outboard computer or tablet hardware. Among the former, IK Multimedia’s ARC (confusingly, no relation to Anthem’s ARC – and how the lawyers permitted this we don’t know!), found in its iLoud powered mini-monitors, and at the higher-priced end, Neumann’s MA-1 automatic monitor alignment have been well received.\nAmong the free-standers, the Mac/Windows software program Room EQ Wizard (REW) is something of a de facto standard for the geekier audio-afflicted. This is a lot more technical, detailed and hands-on than any auto-running correction system, and requires a lot more user interaction and understanding. It also requires external DSP hardware to load and run the resultant equalization-data files. (Dirac also has a standalone version to run on a computer or other external hardware.)\nFinally, let’s not forget the best wireless speakers: Amazon’s Echo Studio, Apple’s HomePod, and Sonos’ TruePlay as found in several models, all incorporate routines that analyze room acoustics (though from the speaker itself, not the listening position) and compensate accordingly, which is indisputably room correction of a sort.\nWhich is Best?\nUmm…yes! Audiophiles and home-theater fanatics will argue endlessly about the merits of Audyssey vs. Dirac vs. Trinnov; finite-impulse-response filters vs. infinite-impulse ones; correction bandwidths, target curves, and a dozen other technical issues.\nNot me. While under their hoods there are important technical differences both in the ways they approach correction overall and in the digital audio gears and levers that do the heavy lifting, most of these remain unimportant to most end users. I have achieved truly excellent (and very similar) audible results from numerous iterations of both Audyssey and Dirac systems on my own system, and on many test systems, in my own, acoustically less-than-perfect studio. And I’ve heard very impressive off-site demos of Trinnov.\nHowever achieved, taming a room’s principal modal peaks remains room correction’s first and biggest benefit. All of these three technologies (and many of the others) do this effectively – I’ve demonstrated this to my own satisfaction multiple times. And when you get the bottom four octaves right, everything sounds better.\nAs to which is best for you, hopefully, you’re now a bit better equipped to determine this. If you want the most hands-off correction solution, the basic Audyssey MultEQ/XT32 is likely the easiest effective option. If you want to dig deeper, either Audyssey plus its Editor app or MultEQ-X program, or Dirac Live running on a tablet or computer, will deliver more precise corrections, far more informative displays, and a lot more user involvement and customizability.\nIf you really want to give your slide rule a workout, the free Room EQ Wizard computer program is unsurpassed in its data-gathering and display, and detailed-correction options – but remember the outboard-DSP-hardware requirements (though these are mostly relevant only to two-channel systems). Finally, if you have the budget, Trinnov’s Optimizer is probably the gold standard, especially if installed and tweaked by a pro as I suspect nearly all Trinnov systems are.\nYou might also like...\nDaniel Kumin has written about video, audio, and music technologies for more than three decades, for numerous major magazines and web destinations, and consults in the AV and other industries. He was originally trained as a composer, in case anyone wants to commission a string quartet."
    },
    {
      "url": "https://www.techradar.com/audio/i-listened-to-a-usd3-million-stereo-system-and-i-dont-know-if-i-could-hear-every-penny-but-i-definitely-heard-the-dollars",
      "text": "I listened to the most mind-blowing stereo music system in the world – and the price is terrifying\n7-foot speakers and 7,200 watts of amp power\nWorking in tech journalism has its perks. True, sometimes you spend a whole day staring at the battery level of earbuds with a stopwatch in-hand while they run down, but sometimes you get sent the chance to try something special.\nWhen I saw the invitation to book in for a listening session with a $3 million hi-fi system, I took it. I mean, who wouldn't?\nMore specifically, the price of the system as shown was a little over €3.4 million – most of the components are from European manufacturers and are priced to order, so if you were putting this system together in the US (as I'm sure you were just about to), the exact price would vary.\nThat includes some of the most impressive speakers in the world, a literal metric ton of amplification power, and a speaker cable invoice that will leave you double-checking you're reading this article correctly. (You are.)\nHere's the full list of the equipment in the setup:\nManufacturer | Product | List price |\n|---|---|---|\nWilson Audio | WAMM Master Chronosonic Loudspeaker (pair) | €1,000,000 |\nWilson Audio | WAMM Master Subsonic Subwoofer (pair) | €100,000 |\nDan D'Agostino | Relentless Epic 1600 | €250,000 |\nDan D'Agostino | Relentless Epic 1600 | €250,000 |\nDan D'Agostino | Relentless Epic 1600 | €250,000 |\nDan D'Agostino | Relentless Epic 1600 | €250,000 |\nDan D'Agostino | Relentless Preamplifier | €230,000 |\nDan D'Agostino | MxV Momentum Phonostage Preamp | €44,000 |\ndCS | Vivaldi APEX Digital to Analogue Converter* | €45,500 |\ndCS | Vivaldi || CD/SACD Upsampling Transport | €49,000 |\ndCS | Vivaldi Master Clock | €24,500 |\ndCS | Vivaldi Upsampler Plus / Network Streamer | €32,500 |\nVPI Industries | THE VANQUISH | €130,000 |\nNordost | ODIN2 Cables (multiple) | €600,000 |\nNordost | QBase 10 Reference 2pcs | €43,000 |\nNordost | Accessories (multiple) | €4,000 |\nBassocontinuo | Revolution X Line - Maxi Argo | €30,000 |\nBassocontinuo | Ultimate Line - Golia | €14,500 |\nBassocontinuo | B by Bassocontinuo - Power Amp Stands for D'Agostino Relentless | €17,000 |\nStromtank | S6000 Alpha | €84,000 |\n| Row 20 - Cell 0 | Total | €3,448,000 |\nBut as much as those prices somehow make my jaw hurt, having heard the thing in action I have to say that it produced something really special.\nThe two Wilson Audio WAMM Master Chronosonic loudspeakers obviously dominate the stage, despite being tucked away at the edges. Well, as much as you can tuck away two seven-foot speakers that weight 900 lbs (400kg) each.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nEach of the main speakers includes two low-end woofer drivers, two lower-midrange drivers, two upper-midrange drivers, a forward firing tweeter and rear-facing tweeter.\nThese speakers are designed so that you can make physical micro-adjustments to the positioning of each driver, moving them slightly forward or backwards to perfect the timing for your particular listening space – no 'automatic room-tuning audio processing' here, they need manual calibration to perfect their output.\nNow, you might think that with one 10.5-inch bass driver and one 12.5-inch bass driver – i.e. the sizes of pretty serious subwoofers for home theater use – these speakers can handle their own bass.\nAh, what a fool you would be. Obviously you need a separate subwoofer behind each of these speakers, each of which is over five feet tall itself, and has three 12-inch drivers.\nPowering these four speakers are four monoblock amplifiers, each of which is capable of outputting 1,600 watts at 8 ohms, and weighs 570 lbs (258kg). Bear in mind that for the affordable home options among the best stereo speakers, 80-150 watts per channel is generally more than sufficient.\nYou won't be wondering where all that effort goes, though. There was a scale to the sound produced here that just can’t be matched any other way than by throwing this much power and air movement at it.\nThere's so much dynamic range in each portion of the dynamic range, it feels closer to an orchestra than a set of speakers – it's as live as a recording can hope to sound.\nThe piercing sound sound of a woman’s wail on a track unsettled my brain in a way other speakers can’t. When bassy drums hit, they come so low, so dispersed and so resonant that they don’t feel like part of the same soundstage as the vocals, but in a good way. They sound like a different thing, as if they’re not tied together by being part of the same audio waveform. Every element is utterly its own thing, recreated wholly.\nThe system's ability to produce lower mids you can feel in your diaphragm was unparalleled compared to anything I’ve heard outside of an IMAX theater, and I’ve been to a lot of fancy speaker demos. It gave acoustic instruments a rawness, again lending itself to that feeling of being in front of a colossal live performance.\nSimilarly, I don’t know that I’ve ever heard such detail within bass before, maintaining such a delicate touch over fluctuations within the lowest frequencies – and yet at the same time as being such a thoughtful touch on bass, you could feel the bass when the track wants you to.\nIt has so many more gears than lesser speakers; so many different levels it can move through, to deliver just the right amount of punch – the right tools for the right job.\nSitting in that room, you knew you were listening to something special – but it did also make me think of diminishing returns, perhaps inevitably.\nOnce you get to a certain point in the world of hi-fi (or TVs, or anything techy really) you start having to spend a lot more just to get a 10% improvement.\nWould I have been similarly impressed by a setup with Wilson Audio's own Alexxa V speakers (around $150,000 per pair), which use tech from the Chronosonic range? I suspect the difference wouldn't have been vast in most people's ears, in the right setup – but I still think you'd hear the difference.\nI'm glad I got to hear one of the most elaborate, powerful and – yes – expensive hi-fi setups in the world. By hearing what's possible when you go all-out, I have an even better understanding of just how good a home setup for a tiny fraction of the price is when it comes to sound-per-pound.\nIt simultaneously slightly ruined my home listening experience, while also enhancing my appreciation for it. And what is a $3 million hi-fi system for if it's not for giving you mixed feelings about the whole affair?\nYou might also like…\nMatt is TechRadar's Managing Editor for Entertainment, meaning he's in charge of persuading our team of writers and reviewers to watch the latest TV shows and movies on gorgeous TVs and listen to fantastic speakers and headphones. It's a tough task, as you can imagine. Matt has over a decade of experience in tech publishing, and previously ran the TV & audio coverage for our colleagues at T3.com, and before that he edited T3 magazine. During his career, he's also contributed to places as varied as Creative Bloq, PC Gamer, PetsRadar, MacLife, and Edge. TV and movie nerdism is his speciality, and he goes to the cinema three times a week. He's always happy to explain the virtues of Dolby Vision over a drink, but he might need to use props, like he's explaining the offside rule.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/televisions/home-theater/you-think-your-home-theaters-powerful-seeing-this-100-inch-subwoofer-will-correct-you-of-that-foolish-notion",
      "text": "You think your home theater’s powerful? Seeing this 100-inch subwoofer will correct you of that foolish notion\nThat's not a subwoofer. THIS is a subwoofer\n- Ascendo Immersive Audio launches new 64-inch and 100-inch subs\n- \"The largest subwoofers in the world for home cinema\"\n- Expect a six-figure price tag\nIf, like me, you think your hi-fi or home theater system's subwoofer is pretty hot stuff, prepare to feel very small indeed. The new subwoofer from German audio firm Ascendo Immersive Audio is probably 10 times bigger than yours, and 12 times bigger than mine.\nMy idea of a big subwoofer is 15 inches, like the biggest KEF Kube: my own Cambridge Audio sub is a perfectly decent eight inches, and that delivers more than enough boom to fill my room. But Ascendo's new sub is so big that it'll fill any room before you turn it on. It's a whopping 100 inches in diameter, making it over 7,800 square inches of surface area.\nWho's going to buy a 100-inch sub?\nThe new 100 Sub is designed for a very particular kind of customer: the kind who looked at the prior model, the 80 Sub (yes. that was 80 inches), and thought \"oh, that's far too small and quiet\". The driver alone weighs over 570lbs (260kg).\nThe 100 Sub moves as much air as 40 normal 18-inch subwoofers, the firm says, and there's a slightly smaller 64-inch model too. \"These two new subwoofers are the largest in the world for home cinema, and are incredibly powerful, efficient and fast,\" Ascendo's Geoffrey Heinzel says.\nDespite the ridiculous power, these aren't designed to be total brutes. There's a shallower curve than the previous 80-inch model for improved performance, optimized quad suspension for greater movement, and \"advanced\" materials for noise-free operation. The cabinets have been redesigned too, with a reported boost to the low-end frequency response and improved damping to reduce resonance.\nThe price is firmly in the \"if you have to ask, you can't afford it\" territory and hasn't been officially announced, but the 80 Sub was well into six figures.\nYou might also like\n- McIntosh's giant new subwoofer is 1000W of body-blasting bass\n- Dali's mega-powerful 16-inch ported subwoofer wants to shake your home theater to bits\n- Why your dream home theater isn't complete without multiple subwoofers\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nContributor\nWriter, broadcaster, musician and kitchen gadget obsessive Carrie Marshall has been writing about tech since 1998, contributing sage advice and odd opinions to all kinds of magazines and websites as well as writing more than twenty books. Her latest, a love letter to music titled Small Town Joy, is on sale now. She is the singer in spectacularly obscure Glaswegian rock band Unquiet Mind.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/televisions/home-theater/5-incredible-home-theater-demos-at-cedia-expo-2024",
      "text": "5 incredible home theater demos at CEDIA Expo 2024\nDemos to die for\nCEDIA Expo provides a unique opportunity for custom installation industry professionals to experience cutting-edge technology via ongoing home theater demonstrations. Attendees line up outside the pre-fabricated booths where these demos take place, eager to sink into the plush home theater seating – another popular product category at the show – and take in carefully curated movie and music clips.\nFor me, these demos are CEDIA Expo’s highlight, because, unless you’ve got the cash to pay for a truly awesome home theater installation, you’ll never get to experience movies looking and sounding this good outside of an IMAX or Dolby Vision theater. In a word, it’s showtime, and manufacturers painstakingly fuss over the presentation quality in their booths. I was amazed to hear that one demo at CEDIA, booth, gear, and all, had been initially set up and fully calibrated in Italy, and then shipped overseas and re-assembled with its audio and video calibration almost perfectly intact for the show.\nTo tie a bow on TechRadar’s Home Theater Week coverage, I’ve compiled a list of 5 demos that left a strong impression on me at CEDIA Expo 2024. Since these demos took place in fully darkened rooms, my accompanying images only hint at the high-tech happenings going on inside, but a look at the equipment listed for each should give you an idea of the hardware horsepower behind the scenes. Wish you were there!\nBarco / madVR / Seymour-Screen Excellence / Kaleidescape / Trinnov / Perlisten / Officina Acustica\nThis was the first home theater demo I caught and it set the standard for what was to come at CEDIA Expo 2024. The system used a Barco Nethus RGB laser projector with 32,000 lumens brightness paired with a madVR Envy Extreme MK2 video processor and a Kaleidescape Strato C Movie Player and Terra Prime server. An 189.3-inch Cinemascope aspect ratio Seymour-Screen Excellence Enlightor Neo screen was used for the screen.\nA Trinnov Amplitude audio processor (check out our How room correction upgrades your home theater sound feature for more information on Trinnov and the unique Waveforming tech used for this demo) fronting a Perlisten speaker system with 19 speakers and 14 subwoofers – yes, fourteen subwoofers, eight in front and six in back – provided the system’s audio. All of this was installed in a custom-built Officina Acustica home theater room, the same one shipped from Italy mentioned above.\nThe demo started with music, specifically, Eric Clapton playing an acoustic version of Layla, followed by Ashes to Ashes from Sting: Live at the Olympia Paris. Both tracks had exceptional vocal clarity and impeccably clean and deep bass. Next up was the final transformation scene from the film Lucy, and the white background of the opening image was so bright that I literally winced. A typical home theater projector can’t touch the pro-level Barco Nethus when it comes to brightness, and this one even had its light calibrated down to a more standard-for-home-theater 300 nits.\nChristie / Lumagen / Seymour-Screen Excellence / StormAudio / Ascendo / Moovia\nThis stunning demo used a Christie Griffyn 4K35-RGB laser projector capable of 36,500 lumens and 98% coverage of the Rec. 2020 color space. The projector was paired with a Lumagen Radiance Pro 5244 video processor, with a Kaleidescape movie player and server system – a standard component in CEDIA demos – serving as a source. A 13.5-foot wide Seymour-Screen Excellence Enlightor-PRO (0.9 gain) acoustically transparent screen surface mated to the company’s 4-way Adjustable Ratio Theater (ART) Masking System was used for the screen.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nOn the audio front, a StormAudio ISP Elite 32 Digital AoIP MK3 processor was paired with an Ascendo Black Swan hybrid AoIP 13.12.10 system, with the system’s AoIP network-enabled amplifiers digitally connecting to the Black Swan speakers and subs via Cat6 cable. Last but not least, the theater featured three rows of super-comfortable Moovia Marbella seating.\nIf you caught Dune 2 in an IMAX theater, you will have some idea of how powerful this demo looked and sounded. A clip where the Fremen do battle with the Sardaukar started with the roar of a giant sandworm, and the effect of that roar and ensuing fighting was the very definition of immersive sound. Another demo clip, from Ford Vs Ferrari, had Matt Damon’s character recklessly piloting an airplane with a group of terrified auto executives onboard, and when that plane zipped above a crowd of people, the accompanying sound effect traversed the theater’s ceiling with pinpoint precision.\nDigital Projection / Kaleidescape / Screen Innovations / JBL Synthesis\nJBL is an old hand when it comes to explosive CEDIA home theater demos, and the Synthesis system they were showing off total system cost: $156,666) continued that tradition. I didn’t get details on the video portion other than they were using a Digital Projection projector and 222-inch Screen Innovations perforated screen, but the audio part consisted of 15 SCL-series speakers and 4 SSW series subwoofers, all of it powered by a JBL SDP-58 16-channel processor and 6,800 total watts of class-D amplification.\nThis system was calibrated using the Harman default target and employed Dirac Live room correction and Sound Field Management processing to correct bass for seat-to-seat variation in the large room. Whatever was going on, Lady Gaga’s vocals when singing Always Remember Us This Way in the movie A Star is Born sounded remarkably lifelike. And when JBL played that insane train escape scene from Mission Impossible: Dead Reckoning Part One, the sound of sliding furniture in the various train compartments as they collapsed around Ethan and Grace was frighteningly visceral.\nSony / Kaleidescape / Focal\nThis demo in the Sony booth had a relatively modest video component compared to others at the show – the new Bravia Projector 9 projector, a winner of a TechRadar Best of CEDIA Expo award, only costs $32,000 – but the premium 9.2.4-channel Focal Utopia in-wall speaker system more than made up for it when it came to home theater bling.\nThe Bravia Projector 9’s picture had stunning contrast despite its modest 3.400 lumens light output compared to other projectors at the show, and its new XR Processor for Projector with features like dynamic frame-by-frame HDR tone mapping provided a standard-setting level of shadow detail for a projector. This could easily be seen in a dark clip from the movie Zero Dark Thirty, while another from the new Bad Boys: Ride or Die demonstrated the projector’s rich color reproduction.\nSony / Kaleidescape / Wisdom Audio\nMicro-LED video walls remain an option only for the very well-heeled home theater fanatic, but Sony’s demo room utilizing its Crystal LED CH-Series 137-inch video wall gave the rest of us a peek into a luxury micro-LED-based home theater.\nAlong with that massive video wall, the system consisted of a Kaledescape Strato S Movie Player and 6TB server. A Sony STR-AZ7000ES 13.2-channel AV receiver was used as a preamp for a 9.4.4-channel Wisdom Audio sound system, which consisted of Wisdom Audio Sage Cinema Line 2 Source (front LR and surround sides and rear), Sage Cinema Series HLS (center), and four SRS RTL subwoofers.\nSony and Wisdom Audio also used Always Remember Us This Way from A Star is Born for its demo (it’s a popular home theater demo clip) and Lady Gaga’s voice sounded as full, clear, and lifelike as it had in the JBL Synthesis room. But he real star of this demo was a pursuit scene from Mad Max: Fury Road, which looked and sounded so over-the-top intense that I was gripping the arms of my plush theater seat.\nYou might also like...\nAl Griffin has been writing about and reviewing A/V tech since the days LaserDiscs roamed the earth, and was previously the editor of Sound & Vision magazine.\nWhen not reviewing the latest and greatest gear or watching movies at home, he can usually be found out and about on a bike."
    }
  ],
  "argos_summary": "At the recent Audio Advice Live 25 show in Raleigh, North Carolina, German speaker maker Ascendo and France's Trinnov showcased an impressive home theater demo featuring Trinnov's flagship audio processor and a sophisticated Ascendo speaker system. The setup included an 11.13.8-channel configuration with multiple subwoofers and advanced processing technology to deliver immersive audio experiences, highlighted by demo clips from popular films like 'Bohemian Rhapsody' and '13 Hours: The Secret Soldiers of Benghazi.' Attendees were treated to powerful bass and precise sound separation, making it one of the standout demonstrations of the event.",
  "argos_id": "B948GH6WE"
}