{
  "url": "https://nypost.com/2025/08/08/lifestyle/worst-amazon-driver-angers-shoppers-after-shockingly-careless-home-delivery-is-caught-on-camera/",
  "authorsByline": "Adriana Diaz",
  "articleId": "ef6266e93efa4510bf83162c6f133232",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/109361205.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T18:48:21+00:00",
  "addDate": "2025-08-08T18:50:49.458682+00:00",
  "refreshDate": "2025-08-08T18:50:49.458683+00:00",
  "score": 1.0,
  "title": "‘Worst’ Amazon driver angers shoppers — after shockingly careless home delivery is caught on camera",
  "description": "What a tosser.",
  "content": "A North Carolina family was shocked when footage from their home security system captured what’s being dubbed one of the worst Amazon delivery performances in recent memory.\n\nThe now-viral doorbell camera video, filmed in Cabarrus County, shows the driver delivering packages with an alarming lack of care.\n\nInstead of walking up to the porch and placing the items neatly by the door, the unidentified driver casually drops multiple boxes from a distance, letting them crash onto the steps and scatter across the entryway.\n\nOne of the packages appears unstable, prompting the driver to roughly shove it back up the steps instead of placing it with care.\n\nHe then lingers briefly at the porch, scanning a smaller package in his hand before walking away —seemingly unfazed by the mess he just made.\n\nThe commotion startled the family, who were home at the time and heard a loud bang outside. When they stepped out to investigate, they discovered their packages strewn across the porch, some left precariously perched on the edge of the stairs.\n\nDisturbed by the incident, the family — who have chosen to remain anonymous — decided to release the footage to raise awareness about what they consider unacceptable delivery behavior.\n\nThe video has since sparked outrage online, with many viewers calling it one of the worst displays of delivery etiquette they’ve ever seen.\n\nYet, this isn’t the worst-behaved Amazon delivery driver the world has seen.\n\nA mischievous employee was axed earlier this year after she was caught on home surveillance video relieving herself on two front porches while dropping off packages in Los Angeles.\n\nThe gross stunt took place in the city’s Woodland Hills area, with the unnamed driver caught literally with her pants down, according to KTLA-TV News.\n\n“We’re deeply disturbed by the unacceptable behavior of this delivery driver and apologize to the customers involved,” Amazon officials said in a statement to the outlet. “We immediately identified the driver and they are no longer delivering on behalf of Amazon.”\n\nWhile that Amazon driver left an unwanted package, others have been caught taking them.\n\nA man captured the moment an Amazon delivery driver appeared to steal the package he’d just delivered. Matthew Perry, 29, ordered a Bluetooth device for his car and a workout bench from Amazon, which cost $15 in total.\n\nIn the video, the delivery driver puts the package down and walks around the corner. But 30 seconds later, he returns to retrieve the items before running down the garden path.\n\nPerry was at work while his package was delivered and said he was shocked that someone would jeopardize their job for a $15 package.",
  "medium": "Article",
  "links": [
    "https://ktla.com/news/local-news/amazon-driver-purportedly-poops-on-front-porch-of-los-angeles-home/",
    "https://nypost.com/2025/08/08/lifestyle/dear-abby-my-mother-in-law-wont-stop-taking-my-baby-on-joyrides-am-i-wrong-to-put-my-foot-down/",
    "https://nypost.com/2025/03/19/us-news/moment-amazon-delivery-driver-steals-package-he-delivered/",
    "https://nypost.com/2025/08/07/lifestyle/albany-ny-and-harrisburg-pa-named-the-fastest-growing-cities-near-nyc/",
    "https://nypost.com/2025/08/08/lifestyle/move-over-starbucks-and-dunkin-this-chain-shockingly-has-the-cheapest-coffee-in-america/",
    "https://nypost.com/2025/05/12/us-news/amazon-driver-caught-with-her-pants-down-in-surveillance-footage-after-families-find-stomach-turning-deliveries-on-porch/",
    "https://nypost.com/2025/07/31/lifestyle/gen-xer-blames-ageism-for-poor-job-prospects/",
    "https://nypost.com/2025/03/19/us-news/moment-amazon-delivery-driver-steals-package-he-delivered/#",
    "https://myfox8.com/watch-video/video-north-carolina-amazon-delivery-driver-haphazardly-tosses-packages-onto-front-porch-of-home/amp/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "packages",
      "weight": 0.09413999
    },
    {
      "name": "delivery etiquette",
      "weight": 0.08640643
    },
    {
      "name": "Amazon officials",
      "weight": 0.08261799
    },
    {
      "name": "Amazon",
      "weight": 0.07986185
    },
    {
      "name": "an Amazon delivery driver",
      "weight": 0.07947738
    },
    {
      "name": "home surveillance video",
      "weight": 0.07915334
    },
    {
      "name": "the worst Amazon delivery performances",
      "weight": 0.068362996
    },
    {
      "name": "the delivery driver",
      "weight": 0.06671399
    },
    {
      "name": "this delivery driver",
      "weight": 0.06671399
    },
    {
      "name": "that Amazon driver",
      "weight": 0.06465835
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Lifestyle"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.85546875
    },
    {
      "name": "/News/Local News",
      "score": 0.75634765625
    },
    {
      "name": "/Arts & Entertainment/Offbeat/Other",
      "score": 0.6787109375
    },
    {
      "name": "/News/Other",
      "score": 0.4736328125
    }
  ],
  "sentiment": {
    "positive": 0.04510498,
    "negative": 0.78125,
    "neutral": 0.17358398
  },
  "summary": "A North Carolina family's home security system has captured a video of a careless home delivery by an Amazon delivery driver. The video, which has been dubbed one of the worst in recent memory, shows the driver delivering packages with a lack of care. Instead of placing them neatly by the door, he casually drops multiple boxes off the porch, leading them to fall onto the steps and scatter across the entryway. The family, who have chosen to remain anonymous, released the footage to raise awareness about unacceptable delivery behavior. Amazon officials identified the driver and they are no longer delivering on behalf of Amazon. This incident is not the first time the company has been caught misbehaving, with a previous employee being caught on home surveillance video relieving herself on two front porches while dropping off packages in Los Angeles.",
  "shortSummary": "A North Carolina family confronted an unprofessional Amazon delivery driver who casually dropped multiple packages on their porch, sparking outrage from shoppers.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "69291a9c6a6448c586dfcd3ca4abe913",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/07/lifestyle/albany-ny-and-harrisburg-pa-named-the-fastest-growing-cities-near-nyc/",
      "text": "Underrated town 3 hours outside of NYC has been tapped as a ‘city on the rise’ for its job openings and desirable salaries\nMove over, Manhattan — the hottest job markets may be just a train ride (or tank of gas) away.\nA new LinkedIn study has crowned America’s “Cities on the Rise” for jobs and talent — and some of the winners are closer to Times Square than Times Square is to affordable rent.\nWhile Grand Rapids, Michigan, took the top spot thanks to its growing tech scene and insurance boom, the real eyebrow-raiser for New Yorkers is Albany — the Empire State’s own capital — landing at No. 4.\nYes, Albany. Once better known for politics and potholes than paychecks, the upstate hub — just a little under a 3-hour drive from NYC — is now a rising star in high-tech jobs and semiconductor research.\nThe University at Albany pumps more than $1 billion into the local economy, with top employers like Regeneron, a biotechnology company, and Albany Medical Center drawing talent — and paychecks averaging nearly $72,000.\nMedian home listings hover around $604,000, making it pricier than many upstate peers but still a bargain compared to NYC.\nBut here’s the kicker: Albany didn’t even nab the highest-ranking spot for a nearby market. That honor goes to Harrisburg, Pennsylvania, which somehow beat it at No. 3.\nPennsylvania’s capital — about three hours from Midtown — scored high thanks to low cost of living, health care expansion and a tourism boost.\nWith median home home listings around $431,000 and an average income of $64,000, Harrisburg is attracting retirees and young professionals alike.\nBoise, Idaho, claimed No. 2 for its booming tech industry and mountain-town lifestyle, while Milwaukee, Wisconsin, rounded out the top five, buoyed by tech jobs and a surging tourism scene.\nLinkedIn said the ranking was based on hiring trends, job postings and talent migration — essentially, where Americans are packing up and moving for better career prospects without needing to sell a kidney for rent.\nThe full top 25 list shows that the action is increasingly in mid-sized metro areas — from semiconductor-fueled Sacramento, California, to biotech-booming Raleigh-Durham, North Carolina — not just in coastal megacities.\nLinkedIn’s top 25 cities on the rise:\n- Grand Rapids, MI\n- Boise, ID\n- Harrisburg, PA\n- Albany, NY\n- Milwaukee, WI\n- Portland, ME\n- Myrtle Beach, SC\n- Hartford, CT\n- Nashville, TN\n- Omaha, NE\n- Kansas City, MO\n- Wilmington, NC\n- Richmond, VA\n- Indianapolis, IN\n- Colorado Springs, CO\n- Sacramento, CA\n- Greenville-Spartanburg-Anderson, SC\n- Austin, TX\n- Raleigh-Durham-Chapel Hill, NC\n- Portland, OR\n- Fayetteville, AR\n- Reno, NV\n- San Antonio, TX\n- Fort Wayne, IN\n- Pensacola, FL\nSo if you’re over subway delays and $20 cocktails, Albany might be calling. Just don’t tell Harrisburg — they’re still enjoying their victory lap.\nAnd if neither capital city strikes your fancy, there’s always Long Island, where another community just nabbed bragging rights of its own.\nAs previously reported by The Post, New York’s Massapequa Park was crowned the Empire State’s best place to live in the latest U.S. News & World Report rankings — though it only came in at No. 140 nationwide.\nThe close-knit South Shore village scored points for its strong public schools, quick commute to NYC and nearby beach access, with homes selling for a median $746,500 — more than double the statewide median (excluding the city).\nLooks like the road to the good life might just run through the capital — or a Long Island cul-de-sac."
    },
    {
      "url": "https://nypost.com/2025/03/19/us-news/moment-amazon-delivery-driver-steals-package-he-delivered/#",
      "text": "Surprising video shows Amazon driver steal package — that he delivered 30 seconds earlier\nA man captured the moment an Amazon delivery driver appeared to steal the package he’d just delivered.\nMatthew Perry, 29, ordered a Bluetooth device for his car and a workout bench from Amazon — which cost $15 in total.\nIn the video — filmed at noon March 16 — the delivery driver puts the package down and walks around the corner.\nBut 30 seconds later, the delivery driver runs back to get the package before running down the garden path.\nPerry was at work while his package was delivered and said he was shocked that someone would jeopardize their job for a $15 package.\nOn March 18, 2024, after Perry complained to Amazon, the delivery driver returned the package he had taken from the doorstep.\nPerry, a chef from Wesley Chapel, Florida, said: “I was sat at work, I could not believe what I saw. I was more mad at myself for not being home.”\n“I was laughing at first, he just jeopardized his whole job over $15.”\n“It is more the principle of what he is making Amazon look like.”\n“I still can’t believe what happened.”\nA spokesperson for Amazon said: “We reached out to the customer to apologize and let them know we’re looking into this and will take appropriate action.”"
    },
    {
      "url": "https://nypost.com/2025/08/08/lifestyle/dear-abby-my-mother-in-law-wont-stop-taking-my-baby-on-joyrides-am-i-wrong-to-put-my-foot-down/",
      "text": "Dear Abby: My mother-in-law won’t stop taking my baby on joyrides — am I wrong to put my foot down?\nDEAR ABBY: My husband and I are blessed with a 6-month-old son, “Tyler.” I’m now back at work three days a week. My mother and my mother-in-law offered to watch him one day a week, which we were grateful for. (I found a baby-sitter for the third day.)\nI give my mom and my MIL gift cards to their favorite restaurants because each is giving up a day per week for us. My mom is very active and quite a bit younger than my MIL. Mom stays home with Tyler on the day she watches him (no errands, etc.).\nI asked my MIL if, on the day she watches Tyler, she can also stay home and not drive around to the library, grocery store and retail stores. I explained it interrupts the baby’s nap schedule, and, because she isn’t as physically in shape as my mom, it worries me how she’s wrangling the car seat, stroller, etc. She promised she’d just stay home and care for him and play with him.\nWell, Abby, she completely ignored me. I came to pick him up, and she was not even home. I was furious because this isn’t the only time I have caught her running all over town with my infant. My husband also has asked her to stay put for one day out of the week.\nThe last time I picked up Tyler, I said, “If you can’t stay home, we need to change this arrangement.” Now my husband’s side of the family is upset with me and thinks I was too harsh. What do you think? — NEW MOM IN MISSOURI\nDEAR MOM: I think that because your mother-in-law ignores your instructions about not taking your baby with her while running errands, you need to find someone else to take care of him on the days she used to do it. This is not being “too harsh,” it is protecting your little one. (No one said motherhood is easy.)\n** ** **\nDEAR ABBY: I have a friend who is an accomplished cook. I am not. She’s very generous and shares her efforts often, but anytime I have given her some of my better efforts, she has given me feedback like, “Adding some onion would really help this” or “Wow, you didn’t skimp on the chili powder!”\nI finally decided to reciprocate by inviting her to lunches out. Now it’s, “This sauce tastes like it came out of a bottle, mine is much better,” or “I tweaked my sister’s recipe for this dish; I should give it to the chef.” Frankly, I’m tired of her estimation of her talents. I never killed anybody with my cooking, and her remarks when we’re at a restaurant diminish my enjoyment. Any nice way to get her to simmer down? — OUTDONE IN TEXAS\nDEAR OUTDONE: I wonder if your friend’s culinary talents are her only claim to fame. When she is critical of the food at the restaurants to which you take her, smile and say quietly, “Picky, aren’t we, today? I think this is delicious!” It would be better than saying nothing and having a bad taste in your mouth.\n** ** **\nDear Abby is written by Abigail Van Buren, also known as Jeanne Phillips, and was founded by her mother, Pauline Phillips. Contact Dear Abby at www.DearAbby.com or P.O. Box 69440, Los Angeles, CA 90069."
    },
    {
      "url": "https://nypost.com/2025/08/08/lifestyle/move-over-starbucks-and-dunkin-this-chain-shockingly-has-the-cheapest-coffee-in-america/",
      "text": "Move over, Starbucks and Dunkin’ — this chain surprisingly has the cheapest coffee in America\nAn iced coffee can cost a latte these days, which can hurt the wallets of java junkies.\nTo not overspend on a coffee-a-day habit — or some might call it an addiction — a reporter at Delish looked at nine different fast-food and fast-casual menus to find the cheapest iced coffee in America.\nThe outlet discovered that Burger King reigns supreme when it comes to having the cheapest coffee in America. You can’t beat a $1.99 coffee in this economy.\nWendy’s came in at No. 2 with their offering of a $2.49 cold brew. Even if you want something more indulgent, a caramel cold foam is under $3.50.\nMany people probably thought it was safe to assume that McDonald’s was the cheapest coffee option. Not exactly, but it did come in at third place on the list.\nTheir coffee is so beloved because the blend is made specifically for McDonald’s — and with a price tag of $2.79, it’s hard to beat.\nPeople tend to gravitate toward Taco Bell for some late-night munchies, but don’t negate them when it comes to their breakfast. How could you pass up a $3.04 coffee?\nStop at Sonic for a sweet treat and a little caffeine boost. The chain doesn’t technically serve regular iced coffee — but they do offer a delicious cold brew with sweet cream on the menu for #3.59.\nIt’s common to assume Starbucks is on the pricier side, especially considering that the more customizations you get, the more expensive the drink is.\nDespite the complicated orders and secret menu items, a regular tall (small) classic iced coffee is just $4.25, which is pretty reasonable — especially in comparison to other Starbucks drinks.\nPeople rave about Chick-fil-A’s iced coffee taste — and it’s a pretty good deal, too. Talk about a win-win.\nNo matter what customizations you make to it, the iced coffee will always cost only $4.99, according to Delish. Make that a large triple-iced mocha espresso, please.\nThe size of Panera’s iced coffee is a huge appeal, but it comes out to one of the pricier options.\nA regular iced coffee will cost you a whopping $5.19, which is definitely pricey for a fast-casual restaurant.\nAmerica does not run on Dunkin’. The beloved chain actually came in as the most expensive option on the list.\nDepending on where you live, a small iced coffee of the original blend will set you back an average of around $5.31 — no matter if you get it black or with cream and sugar, the outlet found."
    },
    {
      "url": "https://nypost.com/2025/07/31/lifestyle/gen-xer-blames-ageism-for-poor-job-prospects/",
      "text": "Gen Xer is qualified but can’t land a job — he thinks this is the bizarre reason why: ‘I may never ever get hired again’\nHe’s too old for this.\nA Gen Xer sparked a fiery conversation about ageism in the workplace — and many agreed with his sentiment.\n“I may never ever get hired again,” Bradley Richardson, a 58-year-old who now peddles ‘adulting’ courses online, said in an Instagram video.\nHe claimed that despite having skills and experience, he believes his age now disqualifies him from traditional employment.\n“I will make money, but I may never be an employee or get a job ever again because of my age,” he said. His post quickly gained traction with nearly 30,000 likes and over 4,000 comments.\nRichardson’s concerns resonated with many Gen Xers and Boomers, who echoed his sentiment that ageism is a real barrier in today’s job market.\nSome pointed to the added challenges faced by older workers from marginalized communities, where their race, gender and sexuality further worsen the discrimination.\nA survey conducted by resume-building site Resume Now proved all of their worries to be true. It pointed out that, sadly, 90% of workers over the age of 40 have experienced ageism in the workplace, and almost half of the respondents witnessed their employer hiring predominantly young workers.\nMany people empathized with the Gen Xer in the comment section of his viral video.\n“I’m 46 and I’m already feeling it in my industry.”\n“I’m 42 and I feel this hard.”\nOthers insisted their skills remain valuable and said they continue to find work with companies that prioritize experience and reliability.\n“I was thinking the very same at the age of 58 I needed to find work. Took a few months but it happened. Best company ever. I’m old enough to be everyone’s father but they love me and I love them.”\n“I just hired a 60 and 63 yo because they were amazing candidates. Age doesn’t matter.”\n“I got a job at 62. I just turned 65, told the company I think I want to retire. They told me “you can’t leave us” and handed me an 8% raise. Good people can always get a job at any age!”\nIf you think you are experiencing ageism where you work — maybe you got laid off due to your age or passed up for a promotion by a younger colleague — Midtown East attorney Albert Rizzo suggests speaking to an employment attorney.\n“An attorney will want to understand what actions the employer has taken and whether those actions were based on the employee’s age,” said Rizzo.\n“Any adverse action may create a viable claim. These actions can include failure to promote, denial of privileges given to other employees, exclusion from meetings and projects.”"
    },
    {
      "url": "https://nypost.com/2025/05/12/us-news/amazon-driver-caught-with-her-pants-down-in-surveillance-footage-after-families-find-stomach-turning-deliveries-on-porch/",
      "text": "Amazon driver caught with her pants down in Ring footage after families find stomach-turning ‘deliveries’ on porch\nShe was pulling double duty.\nA mischievous Amazon delivery driver got the axe after she was caught on home surveillance video relieving herself on two front porches while dropping off packages in Los Angeles.\nThe gross stunt took place Sunday in the city’s Woodland Hills home, with the unnamed driver caught literally with her pants down, according to KTLA-TV News.\n“We’re deeply disturbed by the unacceptable behavior of this delivery driver and apologize to the customers involved,” Amazon officials said in a statement to the outlet. “We immediately identified the driver and they are no longer delivering on behalf of Amazon.”\nThe disgusting display played out shortly after 6 a.m. on Mother’s Day.\nThe driver is first seen on the home security camera walking away from one home seemingly pulling her pants up — with the sickening bowel movement left behind on the bottom of a set of outdoor stairs.\nAs if that wasn’t enough, a neighbor decided to check their security footage and caught the same delivery driver allegedly urinating inside a wooden gate at their home, and even appears to be staring right at the camera.\nThe driver was not identified, but won’t be making more deliveries anytime soon."
    },
    {
      "url": "https://nypost.com/2025/03/19/us-news/moment-amazon-delivery-driver-steals-package-he-delivered/",
      "text": "Surprising video shows Amazon driver steal package — that he delivered 30 seconds earlier\nA man captured the moment an Amazon delivery driver appeared to steal the package he’d just delivered.\nMatthew Perry, 29, ordered a Bluetooth device for his car and a workout bench from Amazon — which cost $15 in total.\nIn the video — filmed at noon March 16 — the delivery driver puts the package down and walks around the corner.\nBut 30 seconds later, the delivery driver runs back to get the package before running down the garden path.\nPerry was at work while his package was delivered and said he was shocked that someone would jeopardize their job for a $15 package.\nOn March 18, 2024, after Perry complained to Amazon, the delivery driver returned the package he had taken from the doorstep.\nPerry, a chef from Wesley Chapel, Florida, said: “I was sat at work, I could not believe what I saw. I was more mad at myself for not being home.”\n“I was laughing at first, he just jeopardized his whole job over $15.”\n“It is more the principle of what he is making Amazon look like.”\n“I still can’t believe what happened.”\nA spokesperson for Amazon said: “We reached out to the customer to apologize and let them know we’re looking into this and will take appropriate action.”"
    }
  ],
  "argos_summary": "A North Carolina family's doorbell camera captured an Amazon delivery driver carelessly tossing packages onto their porch, prompting outrage online. The driver was seen dropping boxes from a distance and shoving one back up the steps, leaving the family disturbed by the incident. This incident follows other troubling reports involving Amazon drivers, including one who was fired for relieving herself on porches and another who was caught stealing a package he had just delivered.",
  "argos_id": "BVY1OQW06"
}