{
  "url": "https://www.benzinga.com/pressreleases/25/08/g47017339/q-gold-provides-corporate-update",
  "authorsByline": "Globe Newswire",
  "articleId": "e0322be106df420eb39b487d7d3e873f",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "http://benzinga.com/next-assets/images/schema-image-default.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T20:00:00-04:00",
  "addDate": "2025-08-09T00:17:44.640966+00:00",
  "refreshDate": "2025-08-09T00:17:44.640969+00:00",
  "score": 1.0,
  "title": "Q-Gold Provides Corporate Update - Q-Gold Resources (OTC:QGLDF)",
  "description": "TORONTO, Aug. 08, 2025 (GLOBE NEWSWIRE) -- Q-Gold Resources Ltd. (TSXV:QGR) (\"Q-Gold\" or the \"Company\") is pleased to provide the following corporate update on its recent and upcoming activities, including as they",
  "content": "TORONTO, Aug. 08, 2025 (GLOBE NEWSWIRE) -- Q-Gold Resources Ltd. QGR (\"Q-Gold\" or the \"Company\") is pleased to provide the following corporate update on its recent and upcoming activities, including as they relate to the later stage mineral exploration project located in south-central Oregon (the \"Quartz Mountain Project\") that the Company intends to acquire from Alamos Gold Inc. (\"Alamos\") pursuant to a share exchange agreement dated March 31, 2025 (the \"Acquisition\"). For more information about the Acquisition and the Quartz Mountain Project, please see the Company's press release dated April 3, 2025, a copy of which is available under the Company's SEDAR+ profile at www.sedarplus.ca.\n\nThe Company is pleased to announce that, in addition to being appointed as the Company's chief executive officer and president (see the Company's press release dated July 17, 2025), Peter Tagliamonte has joined the Company's board of directors, effective immediately.\n\nFurther, next week, Q-Gold representatives intend to visit the Quartz Mountain Project site for the first time. The delegation will include Dr. Andreas Rompel, Chief Operating Officer and Vice President Exploration, and Fred Brown, who is currently working on preparing a new mineral resource estimate for the Company in respect of the Quartz Mountain Project (see the Company's press release dated July 21, 2025). The anticipated updated mineral resource estimate, which is being prepared for Q-Gold, is intended by the Company to replace all previous historical mineral resource estimates on the project. Fred Brown has also agreed to assume the role of \"Qualified Person\" (as such term is defined in National Instrument 43-101 – Standards of Disclosure for Mineral Projects) for certain of the Company's purposes in respect of the Quartz Mountain Project.\n\nAs part of the visit, the team expects to:\n• verify the current status of all claims at the Quartz Mountain Project (which is comprised of Quartz Mountain and Angel's Camp).\n\nThe site tour will be facilitated by Wolf Schleiss, a former employee of Alamos, who participated in the company's diamond drilling campaign in 2014-2015.\n\nThe two-day trip is expected to include (among other things) the site visit, a tour of the core yard, and an introduction to the Lakeview, Oregon Town Council - the nearest community to the project.\n\nFinally, the Company has entered into an investor relations agreement with bullVestor Medien GmbH (\"bullVestor\") dated August 8, 2025, for assistance with its investor awareness marketing campaign.\n\nbullVestor provides marketing and investor relations services. The company will assist Q-Gold in enhancing its visibility with potential investors by providing, among other services, content creation management, keyword optimization, ad groups and display ads, project management, and media distribution for a total cost of euro 315,000 for a 6-month period commencing on or about the date on which the TSX Venture Exchange (\"TSXV\") approves the engagement (the \"TSXV Approval\"). Pursuant to the agreement respecting the engagement, euro 125,000 is payable within seven days following the date of the TSXV Approval, with the remaining euro 190,000 being payable within 90 days following the date of the TSXV Approval. bullVestor is an arm's length party from the Company and principally operates out of Austria. As of the date of this press release, to the knowledge of the Company, neither bullVestor nor any of its directors and officers own any interest, directly or indirectly, in the securities of the Company. bullVestor's engagement is subject to approval of the TSXV.\n\nThe Quartz Mountain Project is an advanced-stage exploration project located in south-central Oregon. Over the years, approximately 100,000 metres of drilling has been conducted, with the majority of work focused on the Crone Hill and Quartz Butte deposits, which host a measured, indicated and inferred mineral resource. Combined with the Angel's Camp property (which, for certainty, comprises a portion of the Quartz Mountain Project), the project covers a large land package which the Company believes offers significant exploration potential (for more information about the Quartz Mountain Project, please see the Company's press release dated April 3, 2025).\n\nQ-Gold Resources QGRQGLDF is a publicly traded Canadian-based mineral exploration company targeting high-grade gold and silver discoveries in multiple jurisdictions. Q-Gold is currently exploring for gold at the past-producing Foley Gold Mine in Mine Centre, Ontario.\n\nFor further information, contact:\n\nDr. Andreas Rompel\n\nChief Operating Officer and VP Exploration\n\nandy.rompel@qgoldresources.com\n\nCell: +1 778 987 9114\n\nThe content and grades of any mineral deposits at the Company's properties are conceptual in nature. There has been insufficient exploration to define a mineral resource on its properties and it is uncertain if further exploration will result in any target being delineated as a mineral resource.\n\nThis press release contains \"forward-looking information\" within the meaning of applicable Canadian securities legislation. Forward-looking information includes, but is not limited to, statements with respect to the Company's anticipated visit to the Quartz Mountain Project, the preparation of an updated mineral resource estimate to replace previous historical mineral resource estimates, and the Company's engagement of bullVestor to build awareness of the Company with potential investors. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\". Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company, as the case may be, to be materially different from those expressed or implied by such forward-looking information, including but not limited to: receipt of necessary approvals; successful completion of a financing and the satisfaction of the other closing conditions necessary to complete the Acquisition; general business, economic, competitive, political and social uncertainties; future mineral prices and market demand; accidents, labour disputes and shortages and other risks of the mining industry. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information. The Company does not undertake to update any forward-looking information, except in accordance with applicable securities laws.\n\nNEITHER THE TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE.",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/Tracker?data=hn-5UJJNuYh_HCPkvr4E5n_wfOBj9XbNxq0Zm4Z2jttk9bYRYt0gEVn5EHmEZGWAfID3AVR4Vlw2mVy0z0vn3AR_DrnglPX5vgJUbPpCk-AjV_WZBT3cR97tjgSAKSOG",
    "https://www.globenewswire.com/NewsRoom/AttachmentNg/2e635bd2-b62e-4bbb-b0b5-a37cb250e85c",
    "http://www.sedarplus.ca"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Company",
      "weight": 0.08400578
    },
    {
      "name": "Quartz Mountain Project",
      "weight": 0.07308443
    },
    {
      "name": "previous historical mineral resource estimates",
      "weight": 0.07285907
    },
    {
      "name": "such information",
      "weight": 0.06921295
    },
    {
      "name": "Quartz Mountain",
      "weight": 0.06612409
    },
    {
      "name": "future mineral prices",
      "weight": 0.06325128
    },
    {
      "name": "Alamos Gold Inc.",
      "weight": 0.061579358
    },
    {
      "name": "Foley Gold Mine",
      "weight": 0.06066447
    },
    {
      "name": "further information",
      "weight": 0.058662377
    },
    {
      "name": "more information",
      "weight": 0.058518507
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.96875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.9677734375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.84326171875
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.77001953125
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Precious Metals",
      "score": 0.71337890625
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.5048828125
    }
  ],
  "sentiment": {
    "positive": 0.26245117,
    "negative": 0.074157715,
    "neutral": 0.6635742
  },
  "summary": "Q-Gold Resources Ltd. (OTC:QGLDF) has provided a corporate update regarding its activities, including the acquisition of the Quartz Mountain Project from Alamos Gold Inc. (Alamos) and the potential development of the project in south-central Oregon. Peter Tagliamonte has been appointed as the Company's chief executive officer and president, effective immediately, and Fred Brown has agreed to assume the role of \"Qualified Person\" for certain purposes in relation to the project. The company has entered into an investor relations agreement with bullVestor Medien GmbH for assistance with its investor awareness marketing campaign. The agreement is subject to approval from the TSXV.",
  "shortSummary": "Q-Gold Resources Ltd. provides a corporate update on its upcoming activities, including the Quartz Mountain Project acquisition and an investor relations agreement with bullVestor.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "238df0b3bcb24de0a0c65789d1485cf5",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Q-Gold Resources Ltd. has provided an update on its activities related to the Quartz Mountain Project in Oregon, which it plans to acquire from Alamos Gold Inc. The company will visit the project site next week to verify claims and prepare a new mineral resource estimate. Additionally, Q-Gold has engaged bullVestor Medien GmbH for investor relations services to enhance visibility with potential investors.",
  "argos_id": "CUKX635BZ"
}