{
  "url": "https://finance.yahoo.com/news/under-armour-crashes-over-21-000145037.html",
  "authorsByline": "Khac Phu Nguyen",
  "articleId": "72d2893fefa3471da10ab900f608115b",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/us.finance.gurufocus/b06690693e9ed11457c641cde91762dd",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-09T00:01:45+00:00",
  "addDate": "2025-08-09T00:06:57.501141+00:00",
  "refreshDate": "2025-08-09T00:06:57.501143+00:00",
  "score": 1.0,
  "title": "Under Armour Crashes Over 21% After Brutal Forecast -- Turnaround Hopes Take Major Hit",
  "description": "Tariffs, weak sales, and a stunning profit miss spark investor panic as turnaround plan stalls.",
  "content": "Under Armour (NYSE:UAA) just got hammeredagain. Shares tanked as much as 21.5% at 11.43am after the company slashed its second-quarter forecast, signaling its turnaround is still stuck in neutral. Revenue is now expected to fall between 6% and 7%, more than double what analysts had penciled in. The real gut punch? Adjusted EPS could come in as low as 2 centsa far cry from Wall Street's 26-cent estimate. That's not just a missit's a wake-up call.\n\nManagement pointed to multiple headwinds piling on at once: softer consumer demand, pressure from U.S. tariffs, and a restructuring plan that's proving costlier than anticipated. The company expects tariffs alone to add around $100 million in expenses this year. Gross margins are set to shrink, and full-year profits could be slashed by half. CEO Kevin Plank, who returned last year, didn't sugarcoat it: None of this is ideal. We don't like this. He emphasized that the company is taking mitigation stepslike tighter product selection and selective price hikesbut the runway to recovery is looking bumpy.\n\nThe fundamentals aren't offering much comfort either. Revenue in Q1 held steady at $1.1 billion, in line with estimatesbut it marked the ninth straight quarter of declines. EPS landed at 2 cents, missing by a penny. Meanwhile, restructuring charges have already reached $110 million, with total costs expected to land somewhere between $140 million and $160 million. For investors, the turnaround story just got a lot harder to believe.\n\nThis article first appeared on GuruFocus.",
  "medium": "Article",
  "links": [
    "https://finance.yahoo.com/quote/UAA",
    "https://www.bloomberg.com/news/articles/2025-08-08/under-armour-s-turnaround-takes-hit-after-weak-sales-outlook",
    "https://www.gurufocus.com/term/gf-score/UAA",
    "https://www.gurufocus.com/news/3050151/under-armour-crashes-over-21-after-brutal-forecast--turnaround-hopes-take-major-hit?r=caf6fe0e0db70d936033da5461e60141"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "last year",
      "weight": 0.0804108
    },
    {
      "name": "Turnaround Hopes",
      "weight": 0.077490866
    },
    {
      "name": "Brutal Forecast",
      "weight": 0.070311464
    },
    {
      "name": "U.S. tariffs",
      "weight": 0.07002977
    },
    {
      "name": "selective price hikesbut",
      "weight": 0.069914386
    },
    {
      "name": "softer consumer demand",
      "weight": 0.06903931
    },
    {
      "name": "tighter product selection",
      "weight": 0.068142824
    },
    {
      "name": "Under Armour",
      "weight": 0.064051054
    },
    {
      "name": "restructuring charges",
      "weight": 0.06331311
    },
    {
      "name": "much comfort",
      "weight": 0.06230637
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9892578125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.98193359375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.96240234375
    }
  ],
  "sentiment": {
    "positive": 0.023727417,
    "negative": 0.8833008,
    "neutral": 0.09313965
  },
  "summary": "Under Armour (NYSE:UAA) shares fell by 21.5% after the company announced a cut in its second-quarter forecast. The company's revenue is expected to fall between 6% and 7%, more than double what analysts had predicted. However, adjusted EPS could come in as low as 2 cents, a far cry from Wall Street's 26-cent estimate. Management cited multiple headwinds including softer consumer demand, pressure from U.S. tariffs, and a restructuring plan that is costlier than anticipated. The firm expects tariffs to add around $100 million in expenses this year. Full-year profits could be slashed by half. Despite these setbacks, CEO Kevin Plank emphasized that the company is taking mitigation steps like tighter product selection and selective price hikes.",
  "shortSummary": "Under Armour shares plummeted 21.5% after slashing its second-quarter forecast due to multiple headwinds, including higher costs and lower consumer demand, with full-year profits expected to drop by half.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "87bb37efd7394080a6097b9bc3d0c4dd",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://finance.yahoo.com/quote/UAA",
      "text": "Under Armour, Inc. (UAA)\n- Previous Close\n6.64 - Open\n5.28 - Bid 5.44 x 6500\n- Ask 5.42 x 21700\n- Day's Range\n5.12 - 5.64 - 52 Week Range\n4.78 - 11.89 - Volume\n60,522,811 - Avg. Volume\n11,270,116 - Market Cap (intraday)\n2.257B - Beta (5Y Monthly) 1.61\n- PE Ratio (TTM)\n-- - EPS (TTM)\n-0.47 - Earnings Date Aug 8, 2025\n- Forward Dividend & Yield --\n- Ex-Dividend Date --\n- 1y Target Est\n7.27\nUnder Armour, Inc., together with its subsidiaries, engages developing, marketing, and distributing performance apparel, footwear, and accessories for men, women, and youth. The company provides its apparel in compression, fitted, and loose fit types. It also offers footwear products for running, training, basketball, cleated sports, recovery, and outdoor applications, as well as for casual use. In addition, the company provides accessories, which include gloves, bags, headwear, and socks; and engages in brand licensing, digital subscription, advertising, and other digital business activities. It primarily offers its products under the UNDER ARMOUR, ARMOUR, HEATGEAR, COLDGEAR, HOVR, UA, PROTECT THIS HOUSE, I WILL, ARMOUR FLEECE, and ARMOUR BRA brands. The company sells its products through wholesale channels, including national and regional sporting goods chains, independent and specialty retailers, department store chains, mono-branded Under Armour retail stores, institutional athletic departments, and leagues and teams, as well as independent distributors; and directly to consumers through Brand and Factory House stores and e-commerce websites. It operates in the United States, Canada, Europe, the Middle East, Africa, the Asia-Pacific, and Latin America. The company was incorporated in 1996 and is headquartered in Baltimore, Maryland.\nwww.underarmour.com6,500\nFull Time Employees\nMarch 31\nFiscal Year Ends\nSector\nIndustry\nRecent News: UAA\nView MoreRelated Videos: UAA\nPerformance Overview: UAA\nTrailing total returns as of 8/8/2025, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) .\nYTD Return\n1-Year Return\n3-Year Return\n5-Year Return\nCompare To: UAA\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\nStatistics: UAA\nView MoreValuation Measures\nMarket Cap\n2.75B\nEnterprise Value\n3.55B\nTrailing P/E\n--\nForward P/E\n22.12\nPEG Ratio (5yr expected)\n--\nPrice/Sales (ttm)\n0.56\nPrice/Book (mrq)\n1.50\nEnterprise Value/Revenue\n0.69\nEnterprise Value/EBITDA\n415.15\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n-3.90%\nReturn on Assets (ttm)\n2.79%\nReturn on Equity (ttm)\n-9.96%\nRevenue (ttm)\n5.16B\nNet Income Avi to Common (ttm)\n-201.27M\nDiluted EPS (ttm)\n-0.47\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n501.36M\nTotal Debt/Equity (mrq)\n68.74%\nLevered Free Cash Flow (ttm)\n354.98M\nResearch Analysis: UAA\nView MoreResearch Reports: UAA\nView MoreUnder Armour Earnings: In-Line Results Overshadowed by Dismal Near-Term Guidance; Shares Inexpensive\nUnder Armour develops, markets, and distributes athletic apparel, footwear, and accessories in North America, Asia-Pacific, Europe, and elsewhere. Consumers of its performance-based clothing and shoes include professional and amateur athletes, sponsored college and professional teams, and people with active lifestyles. The company sells merchandise through direct-to-consumer, including e-commerce and more than 400 combined factory house and brand house stores, and wholesale channels. The Baltimore-based company was founded in 1996 and is led by controlling shareholder Kevin Plank.\nRatingPrice TargetRevenue decline across almost all segments, channels, and regions\nUnder Armour manufactures and distributes performance apparel, footwear, and accessories for men, women and children. Its products have become popular with competitive athletes and consumers with active lifestyles and are sold in more than 25,000 retail outlets in more than 100 countries worldwide. Headquartered in Baltimore, MD, the company has about 6,500 employees.\nRatingPrice TargetStocks are up at midday on Wednesday. Wall Street is waiting on the Fed's rate\nStocks are up at midday on Wednesday. Wall Street is waiting on the Fed's rate announcement at 2pm ET, followed by Chairman Powell's press conference at 2:30pm. Additional information will come in the form of the Fed's 'dot plot,' which lays out the collective vision from Fed officials about where they see interest rates down the road.\nUnder Armour Lacks Competitive Advantage, but Association With Global Athletics Provides a Base\nUnder Armour develops, markets, and distributes athletic apparel, footwear, and accessories in North America, Asia-Pacific, Europe, and elsewhere. Consumers of its performance-based clothing and shoes include professional and amateur athletes, sponsored college and professional teams, and people with active lifestyles. The company sells merchandise through direct-to-consumer, including e-commerce and more than 400 combined factory house and brand house stores, and wholesale channels. The Baltimore-based company was founded in 1996 and is led by controlling shareholder Kevin Plank.\nRatingPrice Target"
    }
  ],
  "argos_summary": "Under Armour's shares plummeted by up to 21.5% after the company revised its second-quarter forecast, expecting a revenue decline of 6-7%, significantly worse than analysts' predictions. Adjusted earnings per share (EPS) are projected to be as low as 2 cents, compared to the expected 26 cents, highlighting ongoing challenges such as decreased consumer demand, rising tariffs, and costly restructuring efforts. CEO Kevin Plank acknowledged the difficulties and indicated that while the company is taking steps to mitigate these issues, the path to recovery remains uncertain.",
  "argos_id": "D75XTI587"
}