{
  "url": "https://www.extremetech.com/mobile/apple-tags-samsung-over-sony-for-iphone-18-camera-sensor",
  "authorsByline": "Devesh Beri",
  "articleId": "37743da34ac5436bbb144f4710f0e23d",
  "source": {
    "domain": "extremetech.com",
    "location": null
  },
  "imageUrl": "https://i.extremetech.com/imagery/content-types/04aY34HtRVarjDh618FN4ot/hero-image.fill.size_1200x675.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T19:30:51+00:00",
  "addDate": "2025-08-08T19:36:09.477656+00:00",
  "refreshDate": "2025-08-08T19:36:09.477658+00:00",
  "score": 1.0,
  "title": "Apple Tags Samsung Over Sony for iPhone 18 Camera Sensor",
  "description": "President  Trump recently announced a 100% tariff on imported chips, but companies with US-based manufacturing, could avoid the hikes.",
  "content": "Samsung will manufacture digital camera sensors for next year's iPhone 18 as part of a new agreement that adds the South Korean company to Apple's supplier list. The sensors will be produced at Samsung's semiconductor plant in Austin, Texas, using a three-layer stacked design that has not yet been used commercially. This new setup is meant to improve the iPhone's power efficiency and performance.\n\nThe partnership comes at a time of rising pressure on chip imports into the United States. On Friday, President Donald Trump announced that he's mulling a 100% tariff on imported chips, but companies with US-based manufacturing, like Samsung and Apple, could avoid the hikes. Apple has also committed to increasing its investment in the US by $100 billion. The partnership with Samsung is part of those efforts, as reported by the Financial Times.\n\nSouth Korea's trade ministry said that Samsung and SK Hynix, another major chipmaker, would not face tariffs as part of a new trade agreement. Industry experts say Samsung likely won the deal because of these probable tariffs, as Sony, which had previously been the sole supplier of image sensors for iPhones, does not manufacture chips in the US. (Its sensors are made in Japan.)\n\nSamsung's agreement with Apple comes after the company announced its first 2nm process chipset, Exynos 2600. Even the highly anticipated Snapdragon 8 Elite 2, due for release in September, will utilize 3nm process chips.",
  "medium": "Article",
  "links": [
    "https://www.ft.com/content/aff9b9ce-956d-4716-99da-8fc25f4b878b",
    "https://apnews.com/article/apple-trump-computer-tariff-c01b5ce0265b0d294dd10b8966be4436",
    "https://www.extremetech.com/mobile/samsung-beats-qualcomm-announces-exynos-2600-as-worlds-first-2nm-smartphone",
    "https://www.extremetech.com/mobile/qualcomm-could-announce-snapdragon-8-elite-2-in-late-september-earlier"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Samsung",
      "weight": 0.10849034
    },
    {
      "name": "digital camera sensors",
      "weight": 0.09135095
    },
    {
      "name": "imported chips",
      "weight": 0.08679979
    },
    {
      "name": "chip imports",
      "weight": 0.08661958
    },
    {
      "name": "image sensors",
      "weight": 0.0852949
    },
    {
      "name": "chips",
      "weight": 0.079668306
    },
    {
      "name": "Apple",
      "weight": 0.07856144
    },
    {
      "name": "tariffs",
      "weight": 0.07525192
    },
    {
      "name": "part",
      "weight": 0.0736307
    },
    {
      "name": "companies",
      "weight": 0.073181905
    }
  ],
  "topics": [
    {
      "name": "Electronics"
    },
    {
      "name": "iPhone"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.97314453125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.74267578125
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.73681640625
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.509765625
    },
    {
      "name": "/Computers & Electronics/Computer Hardware/Computer Components",
      "score": 0.319091796875
    }
  ],
  "sentiment": {
    "positive": 0.60546875,
    "negative": 0.051086426,
    "neutral": 0.34350586
  },
  "summary": "Samsung will manufacture digital camera sensors for the iPhone 18, replacing Sony as the sole supplier of image sensors for iPhones. The agreement adds Samsung to Apple's supplier list and comes amid increasing pressure on chip imports into the US, with President Donald Trump reportedly considering a 100% tariff on imported chips. Companies with US-based manufacturing, like Samsung and Apple, could avoid the tariff increases due to their companies' US manufacturing. South Korea's trade ministry has stated that Samsung and SK Hynix will not face tariffs as part of a new trade agreement. The deal likely won the deal due to these tariffs as Sony does not manufacture chips in the US. This partnership comes after Samsung announced its first 2nm process chipset, Exynos 2600, and the upcoming Snapdragon 8 Elite 2 will use 3nm process chips.",
  "shortSummary": "Samsung will supply Apple's next-generation iPhone 18 with digital camera sensors at Samsung's Austin, Texas plant, benefiting from rising US chip imports amid tariff concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f222bedb81f44d45a2dc1d372335ecaf",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/apple-trump-computer-tariff-c01b5ce0265b0d294dd10b8966be4436",
      "text": "Trump plans 100% tariff on computer chips, unless companies build in US\nTrump plans 100% tariff on computer chips, unless companies build in US\n▶ Follow live updates on President Donald Trump and his administration\nWASHINGTON (AP) — President Donald Trump said Wednesday that he will impose a 100% tariff on computer chips, raising the specter of higher prices for electronics, autos, household appliances and other essential products dependent on the processors powering the digital age.\n“We’ll be putting a tariff of approximately 100% on chips and semiconductors,” Trump said in the Oval Office while meeting with Apple CEO Tim Cook. “But if you’re building in the United States of America, there’s no charge.”\nThe announcement came more than three months after Trump temporarily exempted most electronics from his administration’s most onerous tariffs.\nThe Republican president said companies that make computer chips in the U.S. would be spared the import tax. During the COVID-19 pandemic, a shortage of computer chips increased the price of autos and contributed to higher inflation.\nInvestors seemed to interpret the potential tariff exemptions as a positive for Apple and other major tech companies that have been making huge financial commitments to manufacture more chips and other components in the U.S..\nBig Tech already has made collective commitments to invest about $1.5 trillion in the U.S. since Trump moved back into the White House in January. That figure includes a $600 billion promise from Apple after the iPhone maker boosted its commitment by tacking another $100 billion on to a previous commitment made in February.\nNow the question is whether the deal brokered between Cook and Trump will be enough to insulate the millions of iPhones made in China and India from the tariffs that the administration has already imposed and reduce the pressure on the company to raise prices on the new models expected to be unveiled next month.\nWall Street certainly seems to think so. After Apple’s stock price gained 5% in Wednesday regular trading sessions, the shares rose by another 3% in extended trading after Trump announced some tech companies won’t be hit with the latest tariffs while Cook stood alongside him.\nThe shares of AI chipmaker Nvidia, which also has recently made big commitments to the U.S., rose slightly in extended trading to add to the $1 trillion gain in market value the Silicon Valley company has made since the start of Trump’s second administration.\nThe stock price of computer chip pioneer Intel, which has fallen on hard times, also climbed in extended trading.\nInquiries sent to chip makers Nvidia and Intel were not immediately answered. The chip industry’s main trade group, the Semiconductor Industry Association, declined to comment on Trump’s latest tariffs.\nDemand for computer chips has been climbing worldwide, with sales increasing 19.6% in the year-ended in June, according to the World Semiconductor Trade Statistics organization.\nTrump’s tariff threats mark a significant break from existing plans to revive computer chip production in the U.S. that were drawn up during the administration of President Joe Biden.\nSince taking over from Biden, Trump has been deploying tariffs to incentivize more domestic production. Essentially, the president is betting that the threat of dramatically higher chip costs would force most companies to open factories domestically, despite the risk that tariffs could squeeze corporate profits and push up prices for mobile phones, TVs and refrigerators.\nBy contrast, the bipartisan CHIPS and Science Act that Biden signed into law in 2022 provided more than $50 billion to support new computer chip plants, fund research and train workers for the industry. The mix of funding support, tax credits and other financial incentives were meant to draw in private investment, a strategy that Trump has vocally opposed.\n—\nLiedtke reported from San Ramon, California."
    }
  ],
  "argos_summary": "Samsung has secured a deal to manufacture digital camera sensors for Apple's upcoming iPhone 18, utilizing a new three-layer stacked design aimed at enhancing power efficiency and performance. This agreement comes amid rising pressure on chip imports into the U.S., with President Trump proposing a 100% tariff on imported chips, which could be avoided by companies manufacturing domestically, like Samsung. The partnership reflects Apple's commitment to increasing its U.S. investments and is seen as a strategic move to mitigate potential tariff impacts, especially as Sony, the previous sole supplier, does not produce chips in the U.S.",
  "argos_id": "D7HWVW8DC"
}