{
  "url": "https://gizmodo.com/solar-powered-device-turns-moon-dirt-into-bricks-a-potential-breakthrough-in-lunar-construction-2000640313",
  "authorsByline": "Ellyn Lapointe",
  "articleId": "aa932306c8eb455d8fa182d90c47f426",
  "source": {
    "domain": "gizmodo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://gizmodo.com/app/uploads/2025/08/Lunar-base-illustration-1200x675.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T10:00:25+00:00",
  "addDate": "2025-08-08T10:08:13.861622+00:00",
  "refreshDate": "2025-08-08T10:08:13.861623+00:00",
  "score": 1.0,
  "title": "Solar-Powered Device Turns Moon Dirt Into Bricks, a Potential Breakthrough in Lunar Construction",
  "description": "A new invention could make a sustained presence on the Moon more feasible.",
  "content": "Both the U.S. and China have set their sights on the Moon, aiming to break ground on permanent lunar bases within the next decade. Though there’s no legal basis for claiming territory in space, whichever country gets there first will gain a coveted first-mover advantage, allowing it to set certain ground rules about who can do what, where.\n\nBut getting there first is only half the battle. Actually establishing a sustained lunar presence presents significant logistical and engineering challenges. One of the biggest hurdles is figuring out how to efficiently and affordably transport building materials from Earth to construct a Moon base, but a team of scientists at China’s Deep Space Exploration Laboratory (DSEL) in Hefei, Anhui Province, may have already solved that problem.\n\nIn July, the researchers published test results for a prototype of a lunar regolith forming system in the journal Acta Astronautica. This 3D printer-like device makes strong construction bricks out of moondust, a.k.a. lunar regolith. Being able to produce building materials with resources readily available on the Moon would reduce the need for Earth-sourced materials, Yang Hoglun, a co-author and senior engineer at DSEL, told the Chinese state media agency Xinhua.\n\n“This printing breakthrough has validated the feasibility of using lunar soil as the sole raw building material, enabling true in-situ resource utilization and eliminating the need to transport any additional materials from Earth,” Yang said.\n\nThe system uses a parabolic mirror—a reflective dish—to gather solar radiation, focus it into a single point, then funnel it through bundles of fiber optic cables. At the focus point, light intensity exceeds 3,000 times the standard intensity of sunlight at Earth’s surface, reaching temperatures over 2,300 degrees Fahrenheit (1,300 degrees Celsius), according to Moon Daily. This is generally hot enough to melt moondust.\n\nIn a series of lab tests using artificial lunar regolith made from basalt and a xenon lamp to simulate sunlight, the prototype successfully melted the regolith and formed solid shapes, including lines, surfaces, bodies, and complex structures. Yang claims the prototype could manufacture materials to support construction of lunar roads, equipment platforms, and buildings to enable large-scale, sustainable lunar exploration and resource use.\n\nThe success of this preliminary test marks a major step toward in-situ manufacturing of lunar construction materials, but there are limitations. Yang told Moon Daily that lunar soil bricks cannot sustain pressure in the Moon’s vacuum and low-gravity environment. They could, however, act as protective layers over pressure-retaining habitat modules made of rigid and inflatable structures, Moon Daily reports.\n\nChina was already making strides in this area before the DSEL researchers tested their lunar regolith forming system. In November 2024, the nation sent a cargo rocket carrying brick prototypes made from lunar regolith simulant to its Tiangong space station for testing in space conditions. The bricks will remain outside the space station for three years to test their durability in this harsh environment, according to Space.com.\n\nOther countries, including the U.S., are also developing methods to use lunar regolith for construction, but China’s progress within the last few years has been particularly significant. Indeed, the Chinese Lunar Exploration Program has kept pace with—and even exceeded—certain aspects of NASA’s Artemis program over the past several years. The U.S. is certainly feeling the pressure.",
  "medium": "Article",
  "links": [
    "https://www.moondaily.com/reports/Lunar_soil_machine_developed_to_build_bricks_using_sunlight_999.html",
    "https://english.cas.cn/newsroom/cas_media/202507/t20250702_1046654.shtml",
    "https://www.sciencedirect.com/science/article/abs/pii/S0094576525001870",
    "https://www.space.com/space-exploration/human-spaceflight/china-to-3d-print-bricks-on-the-moon-using-lunar-dirt-in-2028-to-pave-way-for-future-base-video",
    "https://phys.org/news/2024-11-china-moon-base-lunar-soil.html",
    "https://spj.science.org/doi/10.34133/research.0486",
    "https://www.nasa.gov/directorates/stmd/nasa-enables-construction-technology-for-moon-and-mars-exploration/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "lunar construction materials",
      "weight": 0.10676684
    },
    {
      "name": "lunar regolith",
      "weight": 0.103849314
    },
    {
      "name": "artificial lunar regolith",
      "weight": 0.09847166
    },
    {
      "name": "lunar regolith simulant",
      "weight": 0.09840344
    },
    {
      "name": "Lunar Construction",
      "weight": 0.09788344
    },
    {
      "name": "lunar soil bricks",
      "weight": 0.09600687
    },
    {
      "name": "lunar soil",
      "weight": 0.09184769
    },
    {
      "name": "lunar roads",
      "weight": 0.08870747
    },
    {
      "name": "permanent lunar bases",
      "weight": 0.088070326
    },
    {
      "name": "building materials",
      "weight": 0.07950899
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Science"
    }
  ],
  "taxonomies": [
    {
      "name": "/Science/Astronomy",
      "score": 0.79736328125
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Space Technology",
      "score": 0.564453125
    }
  ],
  "sentiment": {
    "positive": 0.35375977,
    "negative": 0.105529785,
    "neutral": 0.54052734
  },
  "summary": "A team of scientists from China's Deep Space Exploration Laboratory (DSEL) in Hefei, Anhui Province, has developed a prototype of a lunar regolith forming system that turns lunar soil into strong construction bricks. The system uses a parabolic mirror to gather solar radiation, focus it into a single point, then funnel it through bundles of fiber optic cables. This could potentially eliminate the need for Earth-sourced materials for building materials on the Moon. However, logistical and engineering challenges remain, including transport of building materials from Earth to a Moon base. The prototype could be used for construction of lunar roads, equipment platforms, and buildings, enabling large-scale, sustainable lunar exploration and resource use. Despite limitations, lunar soil bricks cannot sustain pressure in the Moon’s vacuum and low-gravity environment.",
  "shortSummary": "China's DSEL has developed a solar-powered lunar regolith forming system, promising a significant step towards in-situ manufacturing of lunar construction materials without using Earth-sourced materials.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5cd845b1d2db4831aafa36e16eb54375",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://english.cas.cn/newsroom/cas_media/202507/t20250702_1046654.shtml",
      "text": "This undated file photo shows a researcher demonstrating the lunar 3D printing process at the Deep Space Exploration Laboratory in Hefei, east China's Anhui Province. (Xinhua)\nA groundbreaking 3D printing system developed by Chinese scientists has explored using only on-site-sourced lunar soil to build habitats, paving the way for the large-scale, on-site construction of lunar research stations.\nThe Deep Space Exploration Laboratory in Hefei, Anhui Province, has successfully prototyped a lunar regolith 3D printer that eliminates the need for Earth-sourced construction materials, according to Yang Honglun, a senior engineer at the lab.\nHe revealed that the system uses a high-precision reflective concentrator and flexible fiber-optic energy transmission to achieve temperatures hot enough to fuse lunar regolith.\n\"This printing breakthrough has validated the feasibility of using lunar soil as the sole raw building material, enabling true in-situ resource utilization and eliminating the need to transport any additional materials from Earth,\" he said.\nAlso among the printing system's key innovations is flexible manufacturing, which enables brick production and the customized molding of complex structures.\nA preliminary test of the prototype's lunar regolith forming process has been completed on the ground surface. Tests of its ability to melt and form lines, surfaces, bodies and complex structures have also been completed, and tests of the technical feasibility of the prototype's solar concentrating technology, optical fiber bundle energy transmission and lunar regolith melting system have been systematically completed.\nIn the early stages of the research team's work, the core challenge was achieving reliable solar energy concentration and regolith shaping under the extreme conditions of the lunar environment.\nAfter extensive testing, the multidisciplinary team -- spanning the fields of planetary science, materials science, mechanical engineering, energy dynamics, thermal physics and optics -- solved critical problems in energy capture, transmission and molding.\nAs for future applications, Yang said the prototype could manufacture lunar regolith structures, supporting the construction of lunar roads, equipment platforms and buildings, and enabling large-scale, sustainable lunar exploration and resource utilization.\nIt also validates key technologies for lunar energy capture and material extraction, laying the technical foundations for the construction of lunar energy systems.\nThe lab -- also known as Tiandu, named after one of the three main peaks of the province's Yellow Mountain -- is a national-level scientific research platform built by the China National Space Administration, the Anhui provincial government, and the University of Science and Technology of China.\nIt is a new model for China's deep-space research and operates with corporate-like autonomy in research direction, fund usage, talent and salary management, according to Li Hang, head of the lab's board office.\nSince its official launch in June 2022, Tiandu has provided robust support for the successful implementation of major projects such as the Queqiao-2 relay satellite and the Chang'e-6 lunar mission, which returned humanity's first-ever sample from the far side of the moon.\nLooking ahead, the lab is developing the world's first Mars sample research facility and is inviting collaboration. \"We welcome scientists from home and abroad to conduct research in Hefei,\" Li said. (Xinhua)\n86-10-68597521 (day)\n86-10-68597289 (night)\n52 Sanlihe Rd., Xicheng District,\nBeijing, China (100864)"
    },
    {
      "url": "https://www.space.com/space-exploration/human-spaceflight/china-to-3d-print-bricks-on-the-moon-using-lunar-dirt-in-2028-to-pave-way-for-future-base-video",
      "text": "China to 3D-print bricks on the moon using lunar dirt in 2028 to pave way for future base (video)\n\"This approach allows us to utilize resources found on the moon, free from transporting water and other materials from the Earth.\"\nChina is getting ready to 3D-print bricks on the moon using lunar soil, in what could be a huge step toward building a base on the lunar surface.\nThe Chang'e 8 spacecraft is currently scheduled to launch around 2028. The mission is planned as a stepping stone to China's International Lunar Research Station (ILRS) and could, potentially, mark a big breakthrough for moon exploration and habitation.\nAs sending anything to the moon is extremely expensive, using materials already present on the lunar surface, known as in-situ resource utilization, has the potential to hugely cut costs and expand possibilities. That's where Chang'e 8 will look to change the game for lunar exploration with 3D printing technology.\n\"Now we have developed the world's first device that produces bricks made of lunar soil. This system harnesses sunlight, collects solar energy, and transmits it to the moon using fiber optics,\" Wu Weiren, chief designer of the Chinese Lunar Exploration Program, told China Central Television (CCTV).\n\"By concentrating the sunlight, we can achieve temperatures between 1400 to 1500 degrees Celsius [2,552 to 2732 degrees Fahrenheit], which is sufficient to melt lunar soil. Our device then utilizes 3D printing technology to shape the molten material into bricks of various specifications. This approach allows us to utilize resources found on the moon, free from transporting water and other materials from the Earth,\" Wu said.\nA successful test would go a long way toward allowing China to plan and carry out more ambitious construction endeavors on the moon.\nRelated: Building blocks: How China plans to make bricks on the moon for lunar habitats\nBreaking space news, the latest updates on rocket launches, skywatching events and more!\nThis is also not the first step that China has made in this area. China has already sent a sample of bricks made from different compositions of lunar soil simulant, meant to mimic real moon regolith, to its Tiangong space station. These will remain outside Tiangong for three years to test their durability in the harsh thermal, radiation and vacuum conditions of outer space and help assess their suitability for building lunar habitats.\nBefore Chang'e 8, China will launch Chang'e 7 in 2026 to explore the environment and resources at the south pole of the moon with a particular focus on the search for water. The detection of water ice could mean there is a source of drinking water, oxygen and rocket fuel production capabilities already waiting on the moon. The mission will employ a hopping robot to explore permanently shadowed craters and look for evidence of water ice.\n\"That's why we say we will be looking for water. Is there water in the craters? If so, that would be a huge discovery and a monumental achievement,\" Wu said.\nThe plans follow on from a series of successful orbiter, lander and rover and sample return missions carried out by China across the past two decades, most recently with the Chang'e 6 far side sample return last year.\nThe country is also aiming to land its astronauts on the moon for the first time before 2030.\nJoin our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: community@space.com.\nAndrew is a freelance space journalist with a focus on reporting on China's rapidly growing space sector. He began writing for Space.com in 2019 and writes for SpaceNews, IEEE Spectrum, National Geographic, Sky & Telescope, New Scientist and others. Andrew first caught the space bug when, as a youngster, he saw Voyager images of other worlds in our solar system for the first time. Away from space, Andrew enjoys trail running in the forests of Finland. You can follow him on Twitter @AJ_FI.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.moondaily.com/reports/Lunar_soil_machine_developed_to_build_bricks_using_sunlight_999.html",
      "text": "Developed by the Deep Space Exploration Laboratory (DSEL) in Hefei, Anhui province, the system functions as a 3D printing device powered by concentrated solar heat. It employs a parabolic reflector to gather solar radiation, which is then funneled through fiber optic bundles. At the focus point, light intensity exceeds 3,000 times the standard level, reaching temperatures over 1,300 C to melt lunar regolith.\nAccording to senior engineer Yang Honglun, the machine uses no additives - relying entirely on lunar soil. The bricks produced are dense and robust, suitable not only for shelter construction but also for roads and platforms on the lunar surface.\nThe project spanned two years of research and development. Key challenges included transporting and melting variable lunar soil compositions and achieving efficient solar energy transmission. To address this, the team created multiple types of simulated lunar soil for extensive trials.\nWhile the technology is a milestone, Yang emphasized that lunar soil bricks alone cannot sustain pressure in the moon's vacuum and low-gravity environment. Instead, the bricks will act as protective layers over pressure-retaining habitat modules made of rigid and inflatable structures.\nHe outlined a broader vision for lunar construction involving brick manufacturing, modular component integration, and structural validation under true lunar surface conditions. These efforts aim to enable full-scale surface construction supported by automated robots and the brick-making device.\nThis development aligns with China's plans for the International Lunar Research Station (ILRS), a joint venture with 17 countries and over 50 research bodies. Scheduled in two phases, ILRS will establish a base in the lunar south pole region by 2035, with expansions in the 2040s.\nIn preparation, Chinese astronauts aboard the nation's space station will expose simulated lunar bricks - delivered by the Tianzhou 8 cargo spacecraft in November 2024 - to space conditions. These experiments will assess thermal durability, mechanical integrity, and radiation shielding to inform future lunar base construction.\nRelated Links\nDeep Space Exploration Laboratory\nMars News and Information at MarsDaily.com\nLunar Dreams and more\n| Subscribe Free To Our Daily Newsletters |\n| Subscribe Free To Our Daily Newsletters |"
    },
    {
      "url": "https://www.nasa.gov/directorates/stmd/nasa-enables-construction-technology-for-moon-and-mars-exploration/",
      "text": "One of the keys to a sustainable human presence on distant worlds is using local, or in-situ, resources which includes building materials for infrastructure such as habitats, radiation shielding, roads, and rocket launch and landing pads. NASA’s Space Technology Mission Directorate is leveraging its portfolio of programs and industry opportunities to develop in-situ, resource capabilities to help future Moon and Mars explorers build what they need. These technologies have made exciting progress for space applications as well as some impacts right here on Earth.\nThe Moon to Mars Planetary Autonomous Construction Technology (MMPACT) project, funded by NASA’s Game Changing Development program and managed at the agency’s Marshall Space Flight Center in Huntsville, Alabama, is exploring applications of large-scale, robotic 3D printing technology for construction on other planets. It sounds like the stuff of science fiction, but demonstrations using simulated lunar and Martian surface material, known as regolith, show the concept could become reality.\nWith its partners in industry and academic institutions, MMPACT is developing processing technologies for lunar and Martian construction materials. The binders for these materials, including water, could be extracted from the local regolith to reduce launch mass. The regolith itself is used as the aggregate, or granular material, for these concretes. NASA has evaluated these materials for decades, initially working with large-scale 3D printing pioneer, Dr. Behrokh Khoshnevis, a professor of civil, environmental and astronautical engineering at the University of Southern California in Los Angeles.\nKhoshnevis developed techniques for large-scale extraterrestrial 3D printing under the NASA Innovative Advanced Concepts (NIAC) program. One of these processes is Contour Crafting, in which molten regolith and a binding agent are extruded from a nozzle to create infrastructure layer by layer. The process can be used to autonomously build monolithic structures like radiation shielding and rocket landing pads.\nContinuing to work with the NIAC program, Khoshnevis also developed a 3D printing method called selective separation sintering, in which heat and pressure are applied to layers of powder to produce metallic, ceramic, or composite objects which could produce small-scale, more-precise hardware. This energy-efficient technique can be used on planetary surfaces as well as in microgravity environments like space stations to produce items including interlocking tiles and replacement parts.\nWhile NASA’s efforts are ultimately aimed at developing technologies capable of building a sustainable human presence on other worlds, Khoshnevis is also setting his sights closer to home. He has created a company called Contour Crafting Corporation that will use 3D printing techniques advanced with NIAC funding to fabricate housing and other infrastructure here on Earth.\nAnother one of NASA’s partners in additive manufacturing, ICON of Austin, Texas, is doing the same, using 3D printing techniques for home construction on Earth, with robotics, software, and advanced material.\nThe ICON company was among the participants in NASA’s 3D-Printed Habitat Challenge, which aimed to advance the technology needed to build housing in extraterrestrial environments. In 2021, ICON used its large-scale 3D printing system to build a 1,700 square-foot simulated Martian habitat that includes crew quarters, workstations and common lounge and food preparation areas. This habitat prototype, called Mars Dune Alpha, is part of NASA’s ongoing Crew Health and Performance Exploration Analog, a series of Mars surface mission simulations scheduled through 2026 at NASA’s Johnson Space Center in Houston.\nWith support from NASA’s Small Business Innovation Research program, ICON is also developing an Olympus construction system, which is designed to use local resources on the Moon and Mars as building materials.\nThe ICON company uses a robotic 3D printing technique called Laser Vitreous Multi-material Transformation, in which high-powered lasers melt local surface materials, or regolith, that then solidify to form strong, ceramic-like structures. Regolith can similarly be transformed to create infrastructure capable of withstanding environmental hazards like corrosive lunar dust, as well as radiation and temperature extremes.\nThe company is also characterizing the gravity-dependent properties of simulated lunar regolith in an experiment called Duneflow, which flew aboard a Blue Origin reusable suborbital rocket system through NASA’s Flight Opportunities program in February 2025. During that flight test, the vehicle simulated lunar gravity for approximately two minutes, enabling ICON and researchers from NASA to compare the behavior of simulant against real regolith obtained from the Moon during an Apollo mission.\nLearn more: https://www.nasa.gov/space-technology-mission-directorate/"
    }
  ],
  "argos_summary": "Both the U.S. and China are racing to establish permanent lunar bases, with China making significant advancements in lunar construction technology. Researchers at China's Deep Space Exploration Laboratory have developed a 3D printing system that uses lunar regolith to create building materials, potentially eliminating the need to transport materials from Earth. This innovation, which utilizes concentrated solar energy to melt moondust into bricks, could support the construction of lunar habitats and infrastructure, marking a crucial step toward sustainable lunar exploration.",
  "argos_id": "DDKRFV5S6"
}