{
  "url": "https://finance.yahoo.com/news/arada-awards-contract-intermass-anantara-113619008.html",
  "authorsByline": "GlobalData",
  "articleId": "2d0bac8834504224942a2327f7339d4d",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/506nPrmc63DyJ.ZHu7AFrA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02OTE-/https://media.zenfs.com/en/world_construction_network_914/1a5ecd7318fd389b5b4653cf6605a698",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T11:36:19+00:00",
  "addDate": "2025-08-08T12:09:36.999765+00:00",
  "refreshDate": "2025-08-08T12:09:36.999766+00:00",
  "score": 1.0,
  "title": "Arada awards contract to Intermass for Anantara Sharjah project",
  "description": "Shared amenities at the complex will include a beachfront infinity pool, five signature restaurants, the Anantara Spa, and more.",
  "content": "Arada has awarded a construction contract worth Dh618m ($168m) to Intermass Engineering & Contracting for the Anantara Sharjah Resort and Anantara Sharjah Residences project.\n\nIntermass will execute the works on the project located on Al Heera Beach in Sharjah, United Arab Emirates, over a period of 24 months. Preliminary enabling and foundation works have already concluded.\n\nThe luxury seafront destination Anantara Sharjah Residences and Anantara Sharjah Resort, owned by Arada and operated by Minor Hotels, will showcase architecture, including a gateway that is designed to reflect the sun path.\n\nThe complex is situated on the north-eastern edge of the Al Heerah Beach tourist destination, featuring 3.5km of beachfront, cycling and jogging tracks, and diverse options for dining.\n\nArada group CEO Ahmed Alkhoshaibi said: “This contract will bring one of Sharjah’s most distinctive luxury destinations to life on the coast of the Arabian Gulf.\n\n“With its exceptional architecture and beachfront setting, the Anantara Sharjah complex will elevate the emirate’s appeal to international travellers and discerning homeowners.”\n\nAdditionally, the development will include a luxury hotel and 128 Anantara-branded residences, ranging from one- to four-bedroom units.\n\nThese include duplex penthouses with private balconies and rooftop pools. Each unit will offer quality flooring, spacious living areas, and floor-to-ceiling windows leading to balconies, among others.\n\nShared amenities at the complex will include a beachfront infinity pool, five signature restaurants, the Anantara Spa, a club for kids, an events hall, meeting rooms, and male and female gyms.\n\nThe project marks the debut of the Anantara brand in Sharjah.\n\nLast month, Arada awarded a construction contract worth Dh60m to Intermass for Masaar Central, a retail and lifestyle hub in Sharjah.\n\n\"Arada awards contract to Intermass for Anantara Sharjah project\" was originally created and published by World Construction Network, a GlobalData owned brand.\n\n\n\n The information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.",
  "medium": "Article",
  "links": [
    "https://www.worldconstructionnetwork.com/news/arada-awards-contract-masaar-central-sharjah/",
    "https://www.worldconstructionnetwork.com/news/arada-contract-anantara-sharjah-project/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Anantara Sharjah project",
      "weight": 0.11363106
    },
    {
      "name": "Anantara Sharjah",
      "weight": 0.11178489
    },
    {
      "name": "Anantara Sharjah Resort",
      "weight": 0.107855774
    },
    {
      "name": "Anantara Sharjah Residences",
      "weight": 0.106194824
    },
    {
      "name": "Anantara",
      "weight": 0.08422373
    },
    {
      "name": "Sharjah",
      "weight": 0.08345182
    },
    {
      "name": "the Anantara Sharjah Resort and Anantara Sharjah Residences project",
      "weight": 0.07116986
    },
    {
      "name": "Arada group CEO Ahmed Alkhoshaibi",
      "weight": 0.07116202
    },
    {
      "name": "Intermass Engineering",
      "weight": 0.06831624
    },
    {
      "name": "Al Heerah Beach",
      "weight": 0.06676871
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Construction & Maintenance/Other",
      "score": 0.83544921875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.77685546875
    },
    {
      "name": "/Real Estate/Property Development",
      "score": 0.70849609375
    },
    {
      "name": "/Travel & Transportation/Hotels & Accommodations/Other",
      "score": 0.50732421875
    },
    {
      "name": "/Arts & Entertainment/Visual Art & Design/Architecture",
      "score": 0.30029296875
    }
  ],
  "sentiment": {
    "positive": 0.58154297,
    "negative": 0.026779175,
    "neutral": 0.39160156
  },
  "summary": "Arada has awarded a construction contract worth Dh618m ($168m) to Intermass Engineering & Contracting for the Anantara Sharjah Resort and Anantar Sharjah Residences project in Sharjah, the United Arab Emirates. The project will be executed over a 24-month period and will include a luxury hotel and 128 Anantaran-branded residences. The complex will showcase architecture including a gateway designed to reflect the sun path and will also include five signature restaurants, a club for kids, an events hall, meeting rooms, and male and female gyms. This contract marks the debut of the Anantsara brand in Sharja.",
  "shortSummary": "Arada awarded Intermass a Dh618m contract to develop the Anantara Sharjah Resort and Residences, featuring a luxury hotel and extensive amenities.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9847ae44881745b0a8b3852322c8a075",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Arada has awarded a Dh618m ($168m) construction contract to Intermass Engineering & Contracting for the Anantara Sharjah Resort and Residences project on Al Heera Beach in Sharjah, UAE, set to be completed in 24 months. The luxury complex will feature a hotel and 128 branded residences, along with amenities such as an infinity pool, restaurants, and a spa. This development marks the introduction of the Anantara brand in Sharjah, enhancing the emirate's appeal to international travelers and homeowners.",
  "argos_id": "F154I24N1"
}