{
  "url": "https://www.thesun.co.uk/travel/36204770/airline-travel-ban-emirates-power-bank/",
  "authorsByline": "Cyann Fielding",
  "articleId": "3f532c64c881414dac9962b34bbc5899",
  "source": {
    "domain": "thesun.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "county": "West Yorkshire",
      "city": "Leeds",
      "coordinates": {
        "lat": 53.7440745,
        "lon": -1.5988598
      }
    }
  },
  "imageUrl": "https://www.thesun.co.uk/wp-content/uploads/2025/08/NINTCHDBPICT001005638717.jpg?strip=all&quality=100&w=1920&h=1080&crop=1",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-08T10:20:48+01:00",
  "addDate": "2025-08-08T09:32:45.557463+00:00",
  "refreshDate": "2025-08-08T09:32:45.557465+00:00",
  "score": 1.0,
  "title": "One of the world’s biggest airlines adds strict item ban for all passengers",
  "description": "A MAJOR airline has become the latest to ban a popular travel item. Emirates – one of the world’s biggest airlines – has banned the use of portable power banks on all its flights.…",
  "content": "Plus, the other airlines to ban the same item\n\nHOL NO One of the world’s biggest airlines introduces strict new travel item ban for all passengers\n\nA MAJOR airline has become the latest to ban a popular travel item.\n\nEmirates - one of the world's biggest airlines - has banned the use of portable power banks on all its flights.\n\nWin one of 8 incredible holidays to the Caribbean, Mexico and Greece by voting in The Sun's Travel Awards - enter to win here\n\nThe new ban comes after fears that the devices could possibly explode whilst in the air.\n\nThe airline's ban on power banks is the latest in a string of airlines to restrict the use of power banks on flights.\n\nYet, Emirates' new rule goes a step further.\n\nThe ban will be introduced on October 1 and from this date any passenger travelling with Emirates will be unable to use a power bank onboard the flight.\n\nThis will include charging their devices or using an in-seat power supply to charge a portable charging bank.\n\nAdditionally, each passenger will only be allowed one power bank.\n\nThey then must be kept in the seat pocket, or in a bag that is under the seat in front of the passenger.\n\nPassengers will not be able to store them in the overhead bins, nor can the power banks exceed 100 Watt Hours.\n\nThe airline has shared that the new rule to ban all passengers from using power banks comes after a \"comprehensive safety review\".\n\nRecently, a power bank caught fire on an Airbus A321, in South Korea.\n\nThe portable bank overheated in the overhead locker as passengers were still boarding the plane.\n\nFlight staff were then unable to put out the fire and had to conduct an emergency evacuation of the aircraft.\n\nThe reason why so many airlines are adding restrictions on power banks is because they use lithium-ion batteries, which can be prone to overheating.\n\nWhen they do overheat, they can create a fire which is difficult to extinguish.\n\nThe airline said in a statement: \"Emirates’ new regulations will significantly reduce risks associated with power banks by prohibiting their use while onboard the aircraft.\n\n\"Storing power banks in accessible locations within the cabin ensures that in the rare event of a fire, trained cabin crew can quickly respond and extinguish the fire.\"\n\nOther airlines that already have power bank restrictions in place include Lufthansa.\n\nLufthansa's restrictions mean that passengers cannot charge a power bank using the in-seat power supply.\n\nThe airline insists that power banks must also be kept within easy reach and sight, if being used to charge another device.\n\nJust last week, Turkish Airlines also became the latest to enforce a ban on smart luggage with non-removable lithium batteries in the hold.\n\nOn its website, the policy on smart bags now states: \"Smart luggage with non-removable lithium batteries cannot be transported as cabin baggage or checked baggage.\n\n\"The lithium battery has to be detached from the smart baggage, carried as cabin baggage and cannot be reinserted until the destination is reached.\n\n\"To protect the detached lithium battery from short-circuiting, the battery should be placed in its original packaging, or its terminals should be insulated, or the battery should be placed in secure plastic bags.\"\n\nAnd back in July, Japan's transport ministry also enforced rules that passengers need to keep power banks in sight at all times whilst travelling.\n\nBrits also face being banned from their flights when the new Europe visa launches due to confusing new rules.\n\nPlus, the full list of banned food and drinks passengers cannot bring onboard on TUI, easyJet, Ryanair and Jet2 flights.",
  "medium": "Article",
  "links": [
    "https://www.thesun.co.uk/travel/36192468/uk-beer-festival-flights/",
    "https://www.thesun.co.uk/travel/36107876/major-airline-luggage-ban-smart-battery/",
    "https://www.thesun.co.uk/topic/japan/",
    "https://www.thesun.co.uk/travel/24606196/flight-attendant-uk-holiday-staycation-destinations-blog/",
    "https://www.thesun.co.uk/travel/35520852/banned-flight-food-drinks/",
    "https://www.thesun.co.uk/travel/34682660/travel-item-ban-caa-hold-luggage-uk-flights-rules/",
    "https://www.thesun.co.uk/sport/football/team/5759409/south-korea/",
    "https://www.thesun.co.uk/travel/35886053/emirates-budget",
    "https://www.thesun.co.uk/travel/36162971/airline-first-ever-uk-flights-beautiful-city/",
    "https://www.thesun.co.uk/travel/36173106/entry-exit-eu-rules-visa/",
    "https://www.thesun.co.uk/travel/19522296/flight-holiday-baggage-rules-smart-suitcase/",
    "https://www.thesun.co.uk/travel/35343753/i-travel-spain-local-spots-cheaper-less-crowded/",
    "https://www.thesun.co.uk/travel/36193694/train-relaunch-first-class-seat-carriage-new/",
    "https://www.thesun.co.uk/travel/36187471/abandoned-pier-transformed-20-m-renovation/",
    "https://www.thesun.co.uk/travel/36188160/birmingham-airport-holiday-chaos-continues/",
    "https://www.thesun.co.uk/competitions/35859864/the-sun-travel-awards-2025/",
    "https://www.thesun.co.uk/travel/35568427/flight-attendants-complete-guide-free-upgrade/",
    "https://www.thesun.co.uk/news/36187137/plane-emergency-landing-birmingham-airport/",
    "https://www.thesun.co.uk/travel/36179650/wetherspoons-beach-rooftop-beer-garden/",
    "https://www.thesun.co.uk/travel/36155913/airline-best-world-uk-flights/",
    "https://www.thesun.co.uk/travel/24856990/boarding-plane-last-first-best-opinion/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "power banks",
      "weight": 0.1192623
    },
    {
      "name": "power bank restrictions",
      "weight": 0.11568386
    },
    {
      "name": "portable power banks",
      "weight": 0.11545444
    },
    {
      "name": "strict new travel item ban",
      "weight": 0.08704534
    },
    {
      "name": "non-removable lithium batteries",
      "weight": 0.085778095
    },
    {
      "name": "Other airlines",
      "weight": 0.08201487
    },
    {
      "name": "Passengers",
      "weight": 0.08163371
    },
    {
      "name": "passengers",
      "weight": 0.08163371
    },
    {
      "name": "confusing new rules",
      "weight": 0.07985071
    },
    {
      "name": "airlines",
      "weight": 0.07897908
    }
  ],
  "topics": [
    {
      "name": "Aviation"
    },
    {
      "name": "Airlines"
    }
  ],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/Travel & Transportation/Transportation/Air Travel",
      "score": 0.96435546875
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Aviation Industry",
      "score": 0.59619140625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.40576171875
    },
    {
      "name": "/News/Other",
      "score": 0.34228515625
    }
  ],
  "sentiment": {
    "positive": 0.04510498,
    "negative": 0.6425781,
    "neutral": 0.31225586
  },
  "summary": "Emirates, one of the world's largest airlines, has introduced a new travel item ban for all passengers, banning the use of portable power banks on all its flights from October 1. The move comes amid concerns that the devices could potentially explode while in the air. The ban will be implemented from this date, with passengers unable to use a power bank onboard for charging their devices or using an in-seat power supply to charge a portable charging bank. Each passenger will only be allowed one power bank, and they must be kept in the seat pocket or under the seat under the passenger's seat. The airline has stated that the new rule comes after a \"comprehensive safety review\". Other airlines that already have power bank restrictions in place include Lufthansa and Turkish Airlines.",
  "shortSummary": "Emirates, one of the world's largest airlines, has banned power banks on all its flights, effective October 1, amid safety concerns over overheating devices in the air.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4e46fe0d708a44e2b62e88940c37bcfb",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Emirates Airlines has announced a ban on the use of portable power banks on its flights, effective October 1, due to safety concerns over potential fire hazards associated with lithium-ion batteries. Passengers will be allowed to carry only one power bank, which must be stored in the seat pocket or under the seat, and cannot exceed 100 Watt Hours. This decision follows similar restrictions by other airlines, including Lufthansa and Turkish Airlines, aimed at mitigating risks related to overheating and fires.",
  "argos_id": "FSP0GUV69"
}