{
  "url": "https://www.usatoday.com/story/life/2025/08/08/august-sturgeon-moon-oregon/85542552007/",
  "authorsByline": "Ginnie Sandoval, Doyle Rice",
  "articleId": "19aac38f8d2c430ba0a76b32f66d410b",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/05/USAT/85529789007-20230801-t-000000-z-2129581403-rc-29-f-2-aij-5-ow-rtrmadp-3-supermoonspain.JPG?crop=4607,2592,x0,y306&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-09T01:39:16+00:00",
  "addDate": "2025-08-09T01:49:08.732988+00:00",
  "refreshDate": "2025-08-09T01:49:08.732991+00:00",
  "score": 1.0,
  "title": "Can you see the sturgeon moon in Oregon tonight? What to know about August's full moon",
  "description": "August's sturgeon moon will reach peak illumination on Aug. 9. Here's what to know.",
  "content": "August's full moon is known as the sturgeon moon thanks to the giant fish that were once plentiful this time of the year in the waters of the northeastern United States.\n\nThe full moon will be visible just before the popular Perseid meteor shower reaches its peak around Aug. 12 to 13.\n\nHere's what to know about August's sturgeon moon.\n\nWhen is the August full moon?\n\nAugust's sturgeon moon will reach peak illumination at 12:55 a.m. on Aug. 9. The full moon should be visible as it rises in the sky on the evening of Aug. 8, weather permitting.\n\nWhy is it called the sturgeon moon?\n\nFull moon names are traditionally rooted in Native American culture or have colonial American influences, according to the Farmer's Almanac.\n\nAccording to the almanac, the name sturgeon moon comes from the giant lake sturgeon of the Great Lakes and Lake Champlain; this native freshwater fish was readily caught during this part of summer and an important food staple for Native Americans who lived in the region.\n\n\"At one time, the lake sturgeon was quite abundant in late summer, though they are rarer today,\" the Almanac said.\n\nAs for the fish themselves, these prehistoric-looking fish have been traced back to around 136 million years ago, and many people call them “living fossils.”\n\nWhat are some other names for August's full moon?\n\nAlternative names for the August full moon refer to seasonal crops and more. Some of these names include:\n\nWill it be cloudy in Oregon during August's full moon?\n\nOregon will see mostly clear skies throughout the state on Aug. 8, according to the National Weather Service.\n\nThere will be a 8-24% chance of cloud cover in the Willamette Valley and southern Oregon, and parts of eastern Oregon will see up to a 28% chance of cloud cover. The Oregon Coast will also be mostly clear but will see the most clouds with a 18-41% chance of cloud cover.\n\nGinnie Sandoval is the Oregon Connect reporter for the Statesman Journal. Sandoval can be reached at GSandoval@gannett.com or on X at@GinnieSandoval.",
  "medium": "Article",
  "links": [
    "https://www.almanac.com/content/full-moon-august",
    "https://puzzles.usatoday.com/",
    "https://x.com/GinnieSandoval",
    "https://www.usatoday.com/story/life/2025/07/17/best-places-to-see-perseids-meteor-shower-oregon/85243567007/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Full moon names",
      "weight": 0.1271915
    },
    {
      "name": "sturgeon moon",
      "weight": 0.12424835
    },
    {
      "name": "Oregon Connect",
      "weight": 0.093217105
    },
    {
      "name": "southern Oregon",
      "weight": 0.09070517
    },
    {
      "name": "eastern Oregon",
      "weight": 0.089278586
    },
    {
      "name": "Oregon",
      "weight": 0.08629874
    },
    {
      "name": "August",
      "weight": 0.0792587
    },
    {
      "name": "Augusts sturgeon moon",
      "weight": 0.078598835
    },
    {
      "name": "Native American culture",
      "weight": 0.077694274
    },
    {
      "name": "Augusts full moon",
      "weight": 0.07697111
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Lifestyle"
    }
  ],
  "taxonomies": [
    {
      "name": "/Science/Astronomy",
      "score": 0.5771484375
    }
  ],
  "sentiment": {
    "positive": 0.16455078,
    "negative": 0.22167969,
    "neutral": 0.61376953
  },
  "summary": "August's full moon, known as the sturgeon moon, will be visible in Oregon on August 8 before the Perseid meteor shower peaks around Aug. 12 to 13. The full moon is named after the giant lake sturfish, which once were plentiful in the waters of the northeastern United States. Full moon names are traditionally influenced by Native American culture or colonial American influences. Oregon will see mostly clear skies throughout the state on Aug. 8, with an 8-24% chance of cloud cover in the Willamette Valley and southern Oregon, and parts of eastern Oregon with up to a 28% chance. Other names for the August full moon include seasonal crops and more.",
  "shortSummary": "The August full moon, known as the sturgeon moon, will be visible in Oregon on Aug. 8, with clear skies and possible cloud cover.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "27923be04a9a44669bfc2e705b18ee28",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.almanac.com/content/full-moon-august",
      "text": "For daily wit & wisdom, sign up for the Almanac newsletter.\nBody\nAugust’s Full Sturgeon Moon will peak on Saturday, August 9. Why do we call is the Sturgeon Moon? Is it full of fish? We’ll explain what makes the August Moon special and how to view this gorgeous summer sight best.\nWhen to See the Full Moon in August 2025\nAugust’s full Moon will crest on Saturday, August 9, reaching peak illumination at 3:55 A.M. Eastern Time. Look up on the evening of Friday, August 8, to catch a spectacular view of the full summer Moon.\nWhy Is It Called the Sturgeon Moon?\nThe full Moon of August is traditionally called the “Sturgeon Moon.”\nThe full Moon names used by The Old Farmer’s Almanac have different origins, including Native American, Colonial American, and European sources. Traditionally, each full Moon name was applied to the entire lunar month in which it occurred, not solely to the full Moon.\nThe Sturgeon Moon\nThe name Sturgeon Moon comes from the giant lake sturgeon of the Great Lakes and Lake Champlain; this native freshwater fish was readily caught during this part of summer and an important food staple for Native Americans who lived in the region. At one time, the lake sturgeon was quite abundant in late summer, though they are rarer today.\nWhat Is a Sturgeon?\nThese prehistoric-looking fish have been traced back to around 136 million years ago, and many people call them “living fossils.”\nFemales require around 20 years to start reproducing, and they can reproduce only every 4 years. However, they can live up to 150 years!\nToday, there are about 29 species worldwide, including the lake sturgeon found in the Great Lakes. They have evolved in size from the size of a bass to a monster sturgeon as big as a Volkswagen.\nThe lake sturgeon is quite rare today, due to intense overfishing in the 19th century, pollution, and damage to their habitat.\nAlternative August Moon Names\nFlying Up Moon is a Cree term describing the time when young birds are finally ready to take the leap and learn to fly.\nCorn Moon (Algonquin, Ojibwe), Harvest Moon (Dakota), and Ricing Moon (Anishinaabe) signify that this is the time to gather maturing crops. Along the same vein, the Assiniboine people named this period Black Cherries Moon, referring to when chokecherries become ripe.\nThe Tlingit people of the Pacific Northwest traditionally called this time of the season the Mountain Shadows Moon.\nEach month, we will explain the traditional names of the Full Moon along with some fascinating facts. In this video, learn about the Full Sturgeon Moon. Click below to watch the video.\nBest Days in August 2025\nBelow are the best days for activities, according to the Moon’s sign and phase in August.\n<span>Captain Brian …</span>Wed, 08/21/2024 - 08:26\nAlthough the sturgeon are rare in some areas of the world, the Lake Sturgeon is doing very well in Minnesota and Wisconsin.\nWell enough in WI to have a regulated spearing season and in MN to have a angling season for 30 days in the fall.\nCaptain Brian\nRetired Sturgeon and Catfish Guide\nThe article says it peaked at 2:26 PM. Is that correct or should it have said 2:26 AM? Someone please clarify.\nReply to comment\n<span>Kt Pie</span>Fri, 08/16/2024 - 00:49\nIn the Moon Folklore section, it says \"If you glimpse the new Moon over your right shoulder, you will have good luck.\" But what does this mean? The new moon isn't visible to the naked eye. How would that have ever been possible?\nReply to comment\n<a title=\"View user profile.\" href=\"/author/editors\">The Editors</a>Fri, 08/16/2024 - 12:18\nYou are absolutely right! We think that it would be especially rare, and lucky, to see a new Moon over one's right shoulder--since it is practically impossible to do so! The new Moon rises around the time of the Sun, and travels the sky in daytime; the sunlight prevents us from seeing it with just our eyes. One might, with special eye protection, be able to see a new Moon during a solar eclipse, though.\nWe're not sure how this folklore came about, but it might actually refer to the thinnest crescent just past the new Moon phase; this is sometimes referred to as the \"new Moon\" even though the actual moment of the phase (when the Moon is totally dark from our view) has passed.\nReply to comment\n<span>Sherry</span>Wed, 08/30/2023 - 22:41\nIt's a beautiful thing I've ever seen ever I hope I'm still here in 2037 NASA good job with your comments and your logic thank you\nReply to comment\n<span>Betty</span>Wed, 08/30/2023 - 14:18\nWhy do you charge so much for shipping\nReply to comment\n<a title=\"View user profile.\" href=\"/author/editors\">The Editors</a>Wed, 08/30/2023 - 16:44\nOkay so the moon is not 225,000 or whatever miles away!! It is absolutely impossible because the earth is FLAT and we live in a closed system!!!! There's no such thing as planets. The sun and the moon are COSMIC PLASMA!! I hope that anyone who reads this comment doesn't take my word for it and does their own research!! It's not hard to do. All you have to do is look a little harder at things in our world and ALWAYS QUESTION THE NARRATIVE!!\nReply to comment\n<span>Allen</span>Mon, 08/19/2024 - 09:48\nI can't tell if this is satire or if the author is, ahem, suffering from a bout of full-moon-induced lunacy\nComments"
    },
    {
      "url": "https://www.usatoday.com/story/life/2025/07/17/best-places-to-see-perseids-meteor-shower-oregon/85243567007/",
      "text": "When and best places to see Perseids meteor shower in Oregon\nOregon's summer is about to get much more celestial as a popular meteor shower is set to begin July 17, overlapping with two other meteor showers.\nFollowing a nearly two-month \"shooting stars\" drought, three meteor showers are set to become active concurrently in July. The celestial activity will then hit a crescendo in August with the peak of what is widely considered the best meteor shower of the year: the Perseids.\nWith its whizzing meteors and blazing fireballs, the Perseid meteor shower reliably puts on a spectacle every year for stargazers around Oregon.\nSpectators who step outside at just the right time could be treated to up to 100 Perseid meteors per hour streaking across the night sky, leaving long wakes of light and color behind them.\nHere's everything to know about the summer's upcoming meteor showers, headlined by the spectacular Perseids.\nWhen is the Perseid meteor shower?\nThe 2025 Perseid meteor shower is expected to become active July 17 and remain so until Aug. 23, according to the American Meteor Society.\nThe Perseids are expected to peak Aug. 12-13.\nWhere can the Perseid meteor show be seen around the world?\nThe Perseids are best viewed in the Northern Hemisphere.\nOnce the sun sets and the moon is below the horizon, spectators should only have to contend with local light pollution and clouds that could interfere with the number of meteors they can see.\nWhen is the best time to watch the Perseids meteor shower?\nThe Perseids are best viewed during the dark hours between midnight and dawn. However, it is possible under the right conditions to view Perseid meteors as early as 7 p.m., according to NASA.\nWhere are the best places to watch the Perseid meteor shower in Oregon?\nOregon's growing list of dark sky places makes it one of the most ideal states for stargazers. Oregon has seven dark sky places open to visitors including:\n- Oregon Outback, eastern Lake County - International Dark Sky Sanctuary\n- Sisters - International Dark Sky Community\n- Antelope - International Dark Sky Community\n- Prineville Reservoir State Park - International Dark Sky Park\n- Cottonwood Canyon State Park - International Dark Sky Park\n- Oregon Caves National Monument and Preserve: International Dark Sky Park\n- Sunriver - International Dark Sky Development of Distinction\nCrater Lake is also an Oregon location known for its dark skies and was named the best national park in the U.S. for stargazing in 2025.\nWhen is the next meteor shower?\nThe Perseids aren't the only meteor shower lighting up the night sky this summer.\nBoth the Southern delta Aquarids and the alpha Capricornids are due to peak at the same time between July 29 and July 30, according to the American Meteor Society.\nThe Capricornids began their activity July 12 and will be followed by the Southern delta Aquarids (also spelled \"Aquariids\") July 18. Both meteor showers will remain active until Aug. 12.\nEric Lagatta covers rocket launches and cosmic discoveries for the USA TODAY Network's Connect team.\nGinnie Sandoval is the Oregon Connect reporter for the Statesman Journal. Sandoval can be reached at GSandoval@gannett.com or on X at @GinnieSandoval."
    }
  ],
  "argos_summary": "August's full moon, known as the Sturgeon Moon, will peak at 12:55 a.m. on August 9, 2025, and can be seen rising on the evening of August 8. The name originates from the giant lake sturgeon, a fish that was historically abundant in the Great Lakes and an important food source for Native Americans. The article also discusses alternative names for the moon and provides weather forecasts for viewing conditions in Oregon.",
  "argos_id": "HORX4QVHU"
}