{
  "url": "https://www.yahoo.com/entertainment/articles/travis-kelce-girlfriend-taylor-swift-103640382.html",
  "authorsByline": "Evolve Editors",
  "articleId": "a40ac38ec65e4c54ab7a62f1dd7abc92",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/43453d901439f53bf8ffbf3174aac9639ced54c63563e4fbe0e88185371fc38e/ynews/resizefill_w1200/https://media.zenfs.com/en/reality_tea_694/cd7333ab93e80a81fcb5b78fdeee9ded",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T10:36:40+00:00",
  "addDate": "2025-08-08T10:48:02.161032+00:00",
  "refreshDate": "2025-08-08T10:48:02.161034+00:00",
  "score": 1.0,
  "title": "Travis Kelce & Girlfriend Taylor Swift Spotted House-Hunting",
  "description": "A new report has emerged suggesting that Travis Kelce and Taylor Swift were house-hunting in Ohio, marking a huge step in their widely publicized relationship. The pair was also spotted enjoying lunch together. The pop icon already reportedly owns eight properties within the United States. In the past few months, Kelce and Swift have been […] The post Travis Kelce & Girlfriend Taylor Swift Spotted House-Hunting appeared first on Reality Tea.",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nA new report has emerged suggesting that Travis Kelce and Taylor Swift were house-hunting in Ohio, marking a huge step in their widely publicized relationship. The pair was also spotted enjoying lunch together.\n\nThe pop icon already reportedly owns eight properties within the United States. In the past few months, Kelce and Swift have been seen on various outings. Recently, Kelce was reported to be gearing up for another Super Bowl run. Meanwhile, Swift appears to be taking a break from her professional life.\n\nAccording to a new report from The New York Post, Travis Kelce and Taylor Swift were spotted on a house hunt at Hunting Valley, Ohio. The location is known for its palatial residences and 5-acre minimum. Moreover, the outlet reported that the couple had lunch at a French bistro in Chagrin Falls, situated near Kelce’s hometown, Cleveland Heights.\n\nMoreover, Cleveland Scene alleged via its sources that the pair visited “two opulent homes currently for sale in Northeast Ohio’s tony eastside suburbs.”\n\nSwift and Kelce were earlier spotted in Ohio on July 1, 2025. The pair enjoyed a lunch date at JoJo’s Bar in Chagrin Falls. Restaurant manager John Ponyicky told PEOPLE, “They had a great lunch, enjoyed our food, and were really impressed with the team.”\n\nPreviously, PEOPLE reported that Kelce and Swift had discussed a lot about their future. The outlet noted that they were “both all in.” Around this time, the Happy Gilmore 2 actor performed a major yet sweet gesture that served as a turning point in his relationship with Taylor Swift. He posted a picture of the songstress for the first time on his Instagram.\n\nA source told PEOPLE that Kelce posting a picture of the singer on his social media feed “wasn’t random” but “intentional.” The insider added, “They’ve been private in their own way, but this was his way of showing how serious things have become.”\n\nAnother source shared, “There’s no pressure between them, but they’re very aligned on where things are going.” They noted how Kelce made Swift “feel safe and supported,” while she brought “so much joy in his life.” The source added, “They’re really happy.”\n\nThe post Travis Kelce & Girlfriend Taylor Swift Spotted House-Hunting appeared first on Reality Tea.",
  "medium": "Article",
  "links": [
    "https://www.clevescene.com/news/taylor-swift-and-travis-kelce-were-house-shopping-in-cleveland-47128897",
    "https://nypost.com/2025/08/07/real-estate/are-taylor-swift-and-travis-kelce-house-hunting-in-ohio/",
    "https://www.mandatory.com/news/1651972-travis-kelce-taylor-swift-house-hunting",
    "https://people.com/taylor-swift-travis-kelce-have-wonderful-time-during-lunch-date-near-his-hometown-exclusive-11765054",
    "https://www.realitytea.com/2025/08/08/travis-kelce-taylor-swift-house-hunting/",
    "https://www.instagram.com/p/DMgXbQ0yWqW/?hl=en&img_index=1",
    "https://people.com/taylor-swift-travis-kelce-talked-about-the-future-both-all-in-exclusive-11780202",
    "https://www.realitytea.com"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Taylor Swift",
      "weight": 0.10400767
    },
    {
      "name": "Girlfriend Taylor Swift",
      "weight": 0.102626435
    },
    {
      "name": "Travis Kelce",
      "weight": 0.1017984
    },
    {
      "name": "Kelce",
      "weight": 0.09178952
    },
    {
      "name": "Swift",
      "weight": 0.08745472
    },
    {
      "name": "Ohio",
      "weight": 0.061056104
    },
    {
      "name": "Chagrin Falls",
      "weight": 0.05825478
    },
    {
      "name": "lunch",
      "weight": 0.058173534
    },
    {
      "name": "Restaurant manager John Ponyicky",
      "weight": 0.054542735
    },
    {
      "name": "PEOPLE",
      "weight": 0.051672317
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.998046875
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.9462890625
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.7216796875
    }
  ],
  "sentiment": {
    "positive": 0.25390625,
    "negative": 0.29003906,
    "neutral": 0.45629883
  },
  "summary": "Travis Kelce and Taylor Swift were reportedly house-hunting in Ohio, marking a significant step in their relationship. The couple was also spotted enjoying lunch together at a French bistro in Chagrin Falls. The pop icon already reportedly owns eight properties in the US. This makes this information may not always match what's in the article. Yahoo is using AI to generate takeaways from this article, which may help improve the user experience.",
  "shortSummary": "Travis Kelce and Taylor Swift were spotted house-hunting in Ohio, signaling a significant step in their relationship despite recent public appearances.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "0ad8d1c8d048499cbcaf4945ec296eb0",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://people.com/taylor-swift-travis-kelce-have-wonderful-time-during-lunch-date-near-his-hometown-exclusive-11765054",
      "text": "Taylor Swift and Travis Kelce Have 'Wonderful Time' During Lunch Date Near His Hometown (Exclusive) The couple were spotted in a cozy Ohio restaurant Tuesday, July 1 By Madison E. Goldberg Madison E. Goldberg Madison E. Goldberg received her B.S. in Journalism and double minors in publishing and photography from Emerson College in 2022, Cum Laude. She first joined PEOPLE in 2025 as a Night Digital News Writer. People Editorial Guidelines and Sarah Jones Sarah Jones Sarah Jones joined PEOPLE as a Senior Reporter in 2025. She previously covered news as a field producer for Entertainment Tonight in both New York and Los Angeles, and worked as a reporter at Us Weekly, Daily Mail, and Page Six. People Editorial Guidelines Published on July 1, 2025 08:43PM EDT 42 Comments Taylor Swift and Travis Kelce are seen at the Men's Final between Fritz and Sinner at the 2024. Credit : Gotham/GC NEED TO KNOW Taylor Swift and Travis Kelce had lunch at JoJo's Bar in Ohio near his hometownA manager at JoJo's exclusively told PEOPLE that they were \"both really pleasant\"The outing comes amid the couple spending their off-season time together before Kelce returns to the field for the NFL season Taylor Swift and Travis Kelce are feeling so high school. The Grammy winner and Kansas City Chiefs tight end were spotted on a lunch date at JoJo's Bar in Chagrin Falls, Ohio, near Kelce's hometown, on Tuesday, July 1. Kelce, 35, wore a horizontal striped blue shirt, while Swift, 35, wore a white dress shirt paired with a pleated skirt, her signature blond hair swept back into a ponytail. John Ponyicky, a manager at JoJo's, tells PEOPLE exclusively, \"Taylor and Travis came in and had a wonderful time. They had a great lunch, enjoyed our food, and were really impressed with the team. Travis grew up in Cleveland Heights, so he decided to visit somewhere he was familiar with. He and Taylor were both really pleasant. They sat at the bar for a bit, but also had a private lunch in a private room.\" Related Stories Travis Kelce Gives Coy Response When Asked If This Is His Last NFL Season Taylor Swift and Travis Kelce Hold Hands During Date Night — as Their N.Y.C. Summer Continues Ahead of Upcoming NFL Season The outing comes after a source told PEOPLE exclusively that the couple's downtime amid the off-season for Kelce and the end of Swift's Eras Tour has been \"a turning point for their relationship in a lot of ways.\" The source elaborated, \"They’re incredibly happy and in sync. There’s a calmness and ease to their relationship right now that’s been really grounding for Taylor and Travis.\" XNY/Star Max/GC Images \"Taylor and Travis are soaking up every minute of this slower season together,\" the source continued. \"They've been splitting their time between New York, Nashville, and a few quiet getaways, just enjoying each other’s company without all the usual chaos. This kind of downtime is rare for both of them, and it’s really allowed their bond to deepen.\" Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human interest stories. The high profile pair made their red carpet debut in Nashville at the Tight End University welcome event on June 23. That evening, the couple were seen romantically slow dancing to a remix of the 14-time Grammy winner's 2014 track \"Shake It Off.\" The following evening, on June 24, Swift popped up to perform a surprise acoustic rendition of \"Shake It Off\" for the audience of the Tight Ends and Friends concert at Brooklyn Bowl in Nashville. Close Leave a Comment Read more: Celebrity Celebrity Relationships"
    },
    {
      "url": "https://nypost.com/2025/08/07/real-estate/are-taylor-swift-and-travis-kelce-house-hunting-in-ohio/",
      "text": "Taylor Swift and Travis Kelce reportedly spotted house-hunting in Ohio — here are the ritziest areas even an A-lister could love\nLovebirds Taylor Swift and Travis Kelce have reportedly toured at least two homes in Cleveland’s Eastside suburbs in June.\nThe pop icon and football star were seen having lunch at a cute French bistro in Chagrin Falls, an idyllic village near Kelce’s hometown in Cleveland Heights.\nSources told The Post that local consensus puts the pair in Hunting Valley, Ohio for their house hunt. The village in the Chagrin River Valley is known for its palatial properties and a 5 acre minimum.\nWhile the median sale price in Cleveland is just $131,675, prices skyrocket in these outer suburbs. Trust funds and lacrosse scholarships abound in areas like historic Shaker Heights, bucolic Waite Hill, ritzy Hunting Valley and affluent Bratenahl — all of which potentially boast the perfect home for a post-NFL retirement and another feather in Swift’s $80 million real estate cap.\nDavid Ayers of The Agency compared the idyllic Eastside villages under the couple’s potential consideration to the Hudson Valley in New York, for one sixteenth of the price.\n“It’s a very stealth wealth, old money, and it’s really an amazingly kept secret that no one knows about,” Ayers told The Post.\nHoward Hanna broker Adam Kaufman sells some of the area’s most expensive properties. Kaufman was skeptical of the pair’s prospective purchase, despite their dining adventure in Chagrin Falls.\n“I think that rumor got going, and it really just escalated,” Kaufman said.\nBut Cleveland and its suburbs would, hypothetically, have a lot to offer the jet-setting couple, he added. The city offers a thriving arts scene, with enviable theatrical and orchestral offerings.\n“It is an amazing place, and it’s really starting to get the recognition it deserves,” he said, pointing to a strong seller’s market in the area.\nBut should the pair consider an Ohio home, there are more than a few solid contenders.\nA stately manor in Hunting Valley\nThis sprawling estate in Hunting Valley comes with a private tennis court, a swimming pool and more than 7.5 acres of lush green land. Originally built in 1924, the $3.45 million property evokes “grandeur of a bygone era,” according to The Agency listing.\nA Hamptons-style estate in Chagrin Falls\nThe village of Chagrin Falls, the site of Swift and Kelce’s buzzy lunch date, hosts this custom-built “Hamptons style” home on 2 riverside acres. The $6.5 million Howard Hanna listing features tasteful interiors across a roomy 13,600 square feet, including a two-island kitchen, four bedroom suites, a wine cellar and a guest house.\nA modern mansion in Moreland Hills\nThis contemporary home located half an hour from Cleveland comes with 2.44 acres of land and more than 16,000 square feet of living space. The $6.25 million listing, held by The Agency, dubs the property a “contemporary masterpiece,” with open-concept living spaces, soaring ceilings and an impressive pool.\nA classic English tudor\nAnother possibility in Chagrin Falls comes with old English charm. The circa-1917 manor, listed by Howard Hanna for $3.39 million, comes with 24 acres of river frontage and a striking Tudor facade. The roughly 8,000-square-foot home features beamed vaulted ceilings, stately fireplaces and a billiards room.\nA Lake Eerie oasis\nThis Gilded Age “grande dame” for $5.99 million is filled with modern upgrades and old world craftsmanship. The 3.5-acre, eight-bedroom property on the coast of Lake Erie boasts intricately carved millwork, cut glass leaded windows and marble flooring throughout its grand public rooms. The luxe Bratenahl property, listed by The Agency, also comes with a restored guest cottage and a massive pool patio."
    },
    {
      "url": "https://www.realitytea.com/2025/08/08/travis-kelce-taylor-swift-house-hunting/",
      "text": "A new report has emerged suggesting that Travis Kelce and Taylor Swift were house-hunting in Ohio, marking a huge step in their widely publicized relationship. The pair was also spotted enjoying lunch together.\nThe pop icon already reportedly owns eight properties within the United States. In the past few months, Kelce and Swift have been seen on various outings. Recently, Kelce was reported to be gearing up for another Super Bowl run. Meanwhile, Swift appears to be taking a break from her professional life.\nTravis Kelce is house-hunting with girlfriend Taylor Swift\nAccording to a new report from The New York Post, Travis Kelce and Taylor Swift were spotted on a house hunt at Hunting Valley, Ohio. The location is known for its palatial residences and 5-acre minimum. Moreover, the outlet reported that the couple had lunch at a French bistro in Chagrin Falls, situated near Kelce’s hometown, Cleveland Heights.\nMoreover, Cleveland Scene alleged via its sources that the pair visited “two opulent homes currently for sale in Northeast Ohio’s tony eastside suburbs.”\nSwift and Kelce were earlier spotted in Ohio on July 1, 2025. The pair enjoyed a lunch date at JoJo’s Bar in Chagrin Falls. Restaurant manager John Ponyicky told PEOPLE, “They had a great lunch, enjoyed our food, and were really impressed with the team.”\nPreviously, PEOPLE reported that Kelce and Swift had discussed a lot about their future. The outlet noted that they were “both all in.” Around this time, the Happy Gilmore 2 actor performed a major yet sweet gesture that served as a turning point in his relationship with Taylor Swift. He posted a picture of the songstress for the first time on his Instagram.\nA source told PEOPLE that Kelce posting a picture of the singer on his social media feed “wasn’t random” but “intentional.” The insider added, “They’ve been private in their own way, but this was his way of showing how serious things have become.”\nAnother source shared, “There’s no pressure between them, but they’re very aligned on where things are going.” They noted how Kelce made Swift “feel safe and supported,” while she brought “so much joy in his life.” The source added, “They’re really happy.”\nOriginally reported by Abdul Azim Naushad on Mandatory."
    },
    {
      "url": "https://www.clevescene.com/news/taylor-swift-and-travis-kelce-were-house-shopping-in-cleveland-47128897",
      "text": "[ { \"name\": \"Real 1 Player (r2) - Inline\", \"component\": \"38482494\", \"insertPoint\": \"2/3\", \"requiredCountToDisplay\": \"9\" } ]\nA hot dispatch for the SEO and social media machines from the Scene Action Gossip Team, the kind of material AI can't manufacture, delivered hot and fresh just for you. No puns. Just straight information.\nRemember when Taylor Swift and Travis Kelce were spotted at Jojo's in Chagrin Falls? Other outlets were content with that celebrity sighting. News that these two humans actually do exist. Or the breaking news that they eat food -- subsisting on calories, like the rest of us sacks of \"muscle\" and fat, to fuel metabolism and get through their day. Or that they would choose to consume those calories in Chagrin Falls.\nNot us. Not here at Scene. We dug deeper. Because the two not only eat, but they also live places. With roofs. Pools. Beds. High-end appliances. Lead-free pipes. And Cleveland has at least three places that qualify in that regard.\nSo, we channeled our inner Ed Gallek and we learned more: Multiple sources have confirmed to Scene that Swift and Kelce visited at least two opulent homes currently for sale in Northeast Ohio's tony eastside suburbs on that visit. The kind of places where wealth is abundant and babies are born with fully funded 529 accounts just in case they don't get a lacrosse scholarship or decide to forego higher education altogether to pursue dressage full time.\nWould the romantic pair be prepared to plunk down a sliver of their combined wealth on a house in Cleveland? (In case you hadn't heard, Travis Kelce is from Cleveland Heights?)\nOr, is mansion shopping for the uber wealthly something akin to scrolling Instagram for the rest of us?\nSwift owns multiple properties. What's one more?\nAnd why not Brook Park? They could buy close to the proposed Browns dome and enjoy seasonal patio cocktails at a Haslam-owned sports bar beneath a landing 737, the noise of which would preclude paparazzi from eavesdropping on their conversations. (But which wouldn't prevent lip readers from clueing in on their chats and figuring out that Travis is self conscious about his haircuts.)\nSwift, having finished her Eras Tour, doesn't have to work for the forseeable future. (We're guessing at least six or seven months.) And Kelce is a season away from retirement and a quiet exit into private life, if you ignore the podcast, endless commercials and probable future in sports commentary.\nCould a Northeast Ohio sabbatical be in the offing?\nLet the rampant speculation begin. Because this isn't Bill Cowher in Strongsville. These are cold, hard facts from your friends at Scene.\nSubscribe to Cleveland Scene newsletters.\nFollow us: Apple News | Google News | NewsBreak | Reddit | Instagram | Facebook | Twitter | Or sign up for our RSS Feed"
    },
    {
      "url": "https://www.mandatory.com/news/1651972-travis-kelce-taylor-swift-house-hunting",
      "text": "A new report has emerged suggesting that Travis Kelce and Taylor Swift were house-hunting in Ohio, marking a huge step in their widely publicized relationship. The pair was also spotted enjoying lunch together.\nThe pop icon already reportedly owns eight properties within the United States. In the past few months, Kelce and Swift have been seen on various outings. Recently, Kelce was reported to be gearing up for another Super Bowl run. Meanwhile, Swift appears to be taking a break from her professional life.\nTravis Kelce is house-hunting with girlfriend Taylor Swift\nAccording to a new report from The New York Post, Travis Kelce and Taylor Swift were spotted on a house hunt at Hunting Valley, Ohio. The location is known for its palatial residences and 5-acre minimum. Moreover, the outlet reported that the couple had lunch at a French bistro in Chagrin Falls, situated near Kelce’s hometown, Cleveland Heights.\nMoreover, Cleveland Scene alleged via its sources that the pair visited “two opulent homes currently for sale in Northeast Ohio’s tony eastside suburbs.”\nSwift and Kelce were earlier spotted in Ohio on July 1, 2025. The pair enjoyed a lunch date at JoJo’s Bar in Chagrin Falls. Restaurant manager John Ponyicky told PEOPLE, “They had a great lunch, enjoyed our food, and were really impressed with the team.”\nPreviously, PEOPLE reported that Kelce and Swift had discussed a lot about their future. The outlet noted that they were “both all in.” Around this time, the Happy Gilmore 2 actor performed a major yet sweet gesture that served as a turning point in his relationship with Taylor Swift. He posted a picture of the songstress for the first time on his Instagram.\nA source told PEOPLE that Kelce posting a picture of the singer on his social media feed “wasn’t random” but “intentional.” The insider added, “They’ve been private in their own way, but this was his way of showing how serious things have become.”\nAnother source shared, “There’s no pressure between them, but they’re very aligned on where things are going.” They noted how Kelce made Swift “feel safe and supported,” while she brought “so much joy in his life.” The source added, “They’re really happy.”"
    },
    {
      "url": "https://www.realitytea.com",
      "text": "Tamra was here.\nThe bar is officially set.\nTeddi urged Tamra to return to filming.\nTravis is fighting the fight.\nRachel is furious Denise stole her spotlight.\nBuckle up when RHOC ladies hit The Big Easy.\nFEATURES\nWhat doesn’t kill her makes her stronger.\nNothing lasts forever, ladies.\nFrom a shared yacht to a lifetime (hopefully).\nAre you not entertained? (We are)\nA pause for peace.\nThe most OMG moments of the first six episodes.\nWithout Bravo’s cameras, will Jax worsen?\nJax needs to get a grip.\nLATEST NEWS\nWondering what Gina Carano‘s net worth is in 2025? Find out how much money she makes and what her earnings…\nTimTheTatman‘s net worth in 2025 has recently become a noteworthy topic of interest among netizens. He is a prominent figure…\nJason Kelce remains unconvinced that he belongs in the Hall of Fame. The former Eagles star dropped this unexpected admission…\nPusha T and Kanye West will likely never work together again. Despite once sharing a creative partnership, Pusha T has…\nHuda Kattan‘s net worth in 2025 has recently become an important topic of interest for netizens. Over the years, she…\nWondering why Sydney Sweeney’s Baskin-Robbins ad is suddenly everywhere? As backlash mounts over her American Eagle campaign, fans have resurfaced…\nPete Davidson is getting ready for fatherhood, and while many have offered him advice, his The Pickup co-star Eddie Murphy…\nThe Harry Potter actor, Rupert Grint, has reunited with the Grammy-winning singer, Ed Sheeran, after more than a decade, sparking…\nCurious about the news surrounding Brandon Blackstock’s death? The longtime talent manager and former husband of Kelly Clarkson died at…\nLexi created a meaningful and inclusive line.\nTim Cook‘s net worth in 2025 has become an important topic of discussion among netizens. He is a prominent figure…\nGary Dell’Abate is well-known in the radio show business. As the producer of one of the most popular shows, the…\nCELEBRITY NEWS\nNicole Kidman‘s daughter, Sunday Rose Kidman-Urban, recently landed her first fashion magazine cover, and a new report claims that her…\nKansas City Chiefs head coach Andy Reid has added fuel to ongoing speculation about Travis Kelce and Taylor Swift’s wedding.…\nLindsay Lohan‘s big comeback in Hollywood may reportedly not be smooth amid the release of the highly anticipated film “Freakier…\nA new report has emerged suggesting that Travis Kelce and Taylor Swift were house-hunting in Ohio, marking a huge step…\nMachine Gun Kelly (MGK) is giving all the credit to Megan Fox for their four-month-old daughter, Saga Blade Fox-Baker’s parenting.…\nJustin Baldoni’s lawyer has dismissed the claims made by Blake Lively about his team leaking details about her deposition. The…"
    },
    {
      "url": "https://people.com/taylor-swift-travis-kelce-talked-about-the-future-both-all-in-exclusive-11780202",
      "text": "Taylor Swift and Travis Kelce Have ‘Talked About the Future a Lot,’ Source Says: ‘They’re Both All In’ (Exclusive) The Kansas City Chiefs tight end posted the Grammy winner on his Instagram for the very first time on Thursday, July 24 By Sarah Jones Sarah Jones Sarah Jones joined PEOPLE as a Senior Reporter in 2025. She previously covered news as a field producer for Entertainment Tonight in both New York and Los Angeles, and worked as a reporter at Us Weekly, Daily Mail, and Page Six. People Editorial Guidelines Published on July 28, 2025 01:15PM EDT 26 Comments Travis Kelce and Taylor Swiift. Credit : Travis Kelce/instagram NEED TO KNOW Taylor Swift and Travis Kelce \"have talked about the future a lot,\" a source tells PEOPLEThe couple — who first started dating in September 2023 — are \"both all in,\" the source addsKelce posted Swift on his Instagram for the very first time on Thursday, July 24 Taylor Swift and Travis Kelce are entering a new era together. The Grammy winner and the Kansas City Chiefs tight end, both 35, \"have talked about the future a lot,\" a source tells PEOPLE exclusively. \"They’re in a really solid place and more in sync than ever,\" the insider says of the couple, who first started dating in September 2023. \"They’re both all in.\" On Thursday, July 24, fans noticed a meaningful shift in the couple's dynamic when the Super Bowl champion posted the pop superstar on his Instagram for the very first time. The photo dump included 13 images of Kelce posing with loved ones — and seven of them featured an appearance from Swift. Travis Kelce and Taylor Swift. Travis Kelce/Instagram \"Travis posting Taylor on his Instagram for the first time wasn’t random, it was intentional,\" says the source. \"They’ve been private in their own way, but this was his way of showing how serious things have become.\" The post was celebrated by Swifties who viewed it as a sweet and significant move, especially for a couple that has kept most of their relationship offline. \"There’s no pressure between them, but they’re very aligned on where things are going,\" the source adds. \"He makes her feel safe and supported and she brings so much joy into his life. They’re really happy.\" Travis Kelce and Taylor Swift. Travis Kelce/Instagram When Kelce posted the photos, he captioned the carousel: \"Had some adventures this offseason, kept it 💯\" The first photo shows the couple with their arms around each other on a boat, tipping matching hats. Kelce's hat said \"Captain,\" while Swift's said \"First Mate.\" The second shot featuring Swift shows the couple looking sleek in matching black outfits at a restaurant, but the most exciting reveal is Kelce's phone screen in the corner, which shows the NFL star has a photo of him and his girlfriend as his wallpaper. Everything Travis Kelce Has Said About Taylor Swift The 10 Most Romantic Things Travis Kelce Has Said About Taylor Swift After a whirlwind year filled with record-breaking concerts, Super Bowl games and global headlines, Swift and Kelce are finally slowing down and it’s been transformative for their relationship. The \"Cruel Summer\" singer concluded her Eras Tour in December 2024 ,and the Kansas City Chiefs tight end wrapped up his NFL season in February, when his team faced off in the Super Bowl against the Philadelphia Eagles. According to the source, \"With Taylor wrapping her tour and Travis heading into the season, they wanted to mark this new chapter in a fun, personal way.\" Close Leave a Comment Read more: Celebrity Celebrity Relationships"
    }
  ],
  "argos_summary": "Travis Kelce and Taylor Swift were recently spotted house-hunting in Hunting Valley, Ohio, a significant development in their relationship. The couple also enjoyed lunch at a French bistro in Chagrin Falls, near Kelce's hometown. Sources indicate that they are both committed to their future together, with Kelce recently posting a picture of Swift on his Instagram, marking a new level of public acknowledgment of their relationship.",
  "argos_id": "HQFU5VHUR"
}