{
  "url": "https://finance.yahoo.com/news/nano-one-reinforces-strategic-role-070500276.html",
  "authorsByline": "Nano One Materials Corp.",
  "articleId": "d2dc65786dd14c11b30b8006cd8c7e2e",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/accesswire.ca/fadc2ed214dd3831a197b6375e980fef",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T07:05:00+00:00",
  "addDate": "2025-08-08T07:20:00.150497+00:00",
  "refreshDate": "2025-08-08T07:20:00.150500+00:00",
  "score": 1.0,
  "title": "Nano One Reinforces its Strategic Role in US Battery Supply Chain through Arkansas Lithium Technology Accelerator (ALTA)",
  "description": "Highlights Nano One, via Arkansas Lithium Technology Accelerator (ALTA), expands and catalyzes its network across Arkansas with stakeholders in government, industry, academia, defence, and the investment community. Sparks broader exposure to world-class ...",
  "content": "Participation in ALTA enabled Nano One to engage with key stakeholders in government, industry, academia, and the investment community. The Company toured Standard Lithium's demonstration facilities, gaining valuable perspective on Arkansas' lithium resources and the state's commitment to innovation. Arkansas' pro-business environment, strong ties to defence, and legacy in natural resource development make it an ideal partner in the localization of lithium supply chains. This includes extraction, refining and value-added processing into LFP cathode materials for battery energy storage systems (BESS)-a cornerstone of future-ready grid infrastructure-AI data centers, military and automotive applications.\n\n\" Nano One's participation was critical to the success of ALTA's first cohort, and the feedback from Arkansas' community, industry, and state government leaders has been overwhelmingly positive, \" said Arthur Orduña, Executive Director of The Venture Center. \" We believe Nano One's strategy, leadership, and technology will be key to developing a localized US battery supply chain. Their cathode manufacturing process targets the most critical gap in our nation's supply chain, the midstream, with a disruptive innovation that leapfrogs and significantly improves on current processes so we can accelerate breaking our dependence on overseas manufacturing. This aligns with Governor Sanders' and Commerce Secretary Hugh McDonald's vision of leveraging Arkansas' world-class lithium reserves to attract the best upstream and midstream technology providers, maximize statewide economic benefits, and reduce reliance on adversarial supply chains. The strength of ALTA's first cohort, featuring Nano One and supported by industry leaders like founding partner Standard Lithium, is a good first step toward turning that vision into a true lithium economy .\"\n\nVANCOUVER, BC / ACCESS Newswire / August 8, 2025 / (TSX:NANO)(OTCQB:NNOMF)(Frankfurt:LBMB) Nano One® Materials Corp . (\"Nano One\" or the \"Company\"), a process technology company specializing in lithium-ion battery cathode active materials, is pleased to provide an update on its participation in the Arkansas Lithium Technology Accelerator (ALTA), the first US-based accelerator aimed at catalyzing a domestic, durable, and resilient lithium-ion battery supply chain. Through ALTA, Nano One has added to its strategic insights, broadened its US presence and industrial relationships, and further validated the critical advantages of its One-Pot™ process for localizing lithium iron phosphate (LFP) cathode production in North America.\n\nThe program culminated in Demo Day, showcasing the collective strength of ALTA's inaugural cohort. Nano One was one of only three companies selected to participate, alongside leaders in lithium processing and geothermal technology. Backed by Standard Lithium, the Walton Family Foundation, and a network of Arkansas-based producers, government agencies, and institutions, ALTA is fostering next-generation collaboration between emerging innovators and established players.\n\nNano One is the only OBBB-ready solution for LFP that can directly link upstream mineral extraction to downstream cell manufacturing. The Company's One-Pot™ process vertically integrates precursor preparation with processing to drive down cost and it also eliminates foreign-controlled inputs, wastewater byproducts, and permitting barriers that challenge traditional cathode supply chains. It enables cost-effective, modular deployment of localized CAM production across North America.\n\n\"ALTA broadened our exposure to US energy growth, its security mandate and localization efforts in Arkansas' ecosystem,\" said Dan Blondal, CEO of Nano One. \"Our technology is purpose-built for North American scale-up, and the interest we received confirms that our strategy is accurately focused on a large opportunity in Arkansas that is real and growing. We look forward to working with ALTA to nurture and deepen our presence, collaborations and partnerships across the region.\"\n\nAbout Nano One®\n\nNano One® Materials Corp. (Nano One) is a technology company changing how the world makes cathode active materials for lithium-ion batteries. Applications include stationary energy storage systems (ESS), portable electronics, and electric vehicles (EVs). The Company's patented One-Pot process reduces costs, is easier-to permit, lowers energy intensity, environmental footprint, and reliance on problematic supply chains. The Company is helping to drive energy security, supply chain resilience, industrial competitiveness and increased performance through process innovation. Scalability is proven and being demonstrated at Nano One's LFP (lithium-iron-phosphate) pilot production plant in Québec-leveraging the only facility and expertise of its kind outside of Asia. Strategic collaborations and partnerships with international companies like Sumitomo Metal Mining, Rio Tinto, and Worley are supporting a design-one-build-many licensing growth strategy-delivering cost-competitive, easier-to-permit and faster-to-market battery materials production solutions world-wide. Nano One has received funding from the Government of Canada, the Government of the United States, the Government of Québec, and the Government of British Columbia. For more information, please visit www.nanoone.ca\n\nCompany Contact:\n\nPaul Guedes\n\ninfo@nanoone.ca\n\n+1 (604) 420-2041\n\n\n\nAbout ALTA\n\nThe Arkansas Lithium Technology Accelerator (ALTA) is a groundbreaking new program from The Venture Center designed to position Arkansas - and the U.S. - as a global leader in lithium technology and battery supply chain innovation. ALTA brings together Arkansas' top lithium producers, including Standard Lithium, Albemarle, Lanxess, and Tetra, with a hand-picked cohort of technology companies solving real-world problems in energy, materials, and critical mineral processing. This one-of-a-kind, business-driven accelerator provides companies with direct access to customers, investors, and state resources - helping them scale faster and build a presence in Arkansas.\n\nCautionary Notes and Forward-Looking Statements\n\nCertain information contained herein may constitute \"forward-looking information\" and \"forward-looking statements\" within the meaning of applicable securities legislation. All statements, other than statements of historical fact, are forward-looking statements. Forward-looking information includes but is not limited to: LFP production, joint ventures, contracted projects, revenue generation, operational growth, licensing, government funding, the development of technology, supply chains, and plans for construction and operation of cathode production facilities; the Company's current and future business and strategies; estimated future working capital, funds available, and uses of funds, future capital expenditures and other expenses for commercial operations; industry demand; incurrence of costs; competitive conditions; general economic conditions; the intention to grow the business, operations and potential activities of the Company; the functions and intended benefits of Nano One's technology and products; the development and optimization of the Company's technology and products; prospective partnerships and the anticipated benefits of both the Company's current and prospective partnerships; the ability to attract and retain key talent; the Company's licensing and, the scalability of developed technology to meet expanded capacity; and the execution of the Company's stated plans - which are contingent on access to capital and grants. Generally, forward-looking information can be identified by the use of terminology such as 'believe', 'expect', 'anticipate', 'plan', 'intend', 'continue', 'estimate', 'may', 'will', 'should', 'ongoing', ‘target', ‘goal', ‘potential' or variations of such words and phrases or statements that certain actions, events or results \"will\" occur.\n\nForward-looking statements are based on the current opinions and estimates of management as of the date such statements are made are not, and cannot be, a guarantee of future results or events. Forward-looking statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking statements or forward-looking information, including but not limited to: general and global economic and regulatory changes; next steps and timely execution of the Company's business plans; the development of technology, supply chains, and plans for construction and operation of cathode production facilities; successful current or future collaborations that may happen with OEM's, miners or others; the execution of the Company's plans which are contingent on capital sources; the Company's ability to achieve its stated goals; the commercialization of the Company's technology and patents via license, joint venture and independent production; anticipated global demand and projected growth for LFP batteries; and other risk factors as identified in Nano One's MD&A and its Annual Information Form dated March 25, 2025, both for the year ended December 31, 2024, and in recent securities filings for the Company which are available at www.sedarplus.ca. Although management of the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. The Company does not undertake any obligation to update any forward-looking statements or forward-looking information that is incorporated by reference herein, except as required by applicable securities laws. Investors should not place undue reliance on forward-looking statements.",
  "medium": "Article",
  "links": [
    "https://pr.report/d390",
    "https://pr.report/d38z",
    "https://pr.report/d38y",
    "https://pr.report/d391",
    "https://www.accessnewswire.com/newsroom/en/metals-and-mining/nano-one-reinforces-its-strategic-role-in-us-battery-supply-chain-through-arkansa-1058272"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "lithium supply chains",
      "weight": 0.072427616
    },
    {
      "name": "lithium technology",
      "weight": 0.07111674
    },
    {
      "name": "US Battery Supply Chain",
      "weight": 0.068527184
    },
    {
      "name": "battery supply chain innovation",
      "weight": 0.06576598
    },
    {
      "name": "technology companies",
      "weight": 0.06544625
    },
    {
      "name": "Nano One",
      "weight": 0.06440719
    },
    {
      "name": "traditional cathode supply chains",
      "weight": 0.06357751
    },
    {
      "name": "Arkansas Lithium Technology Accelerator",
      "weight": 0.06245609
    },
    {
      "name": "supply chains",
      "weight": 0.061484136
    },
    {
      "name": "Company",
      "weight": 0.0608453
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98095703125
    },
    {
      "name": "/News/Technology News",
      "score": 0.814453125
    },
    {
      "name": "/Business & Industrial/Manufacturing/Other",
      "score": 0.61962890625
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Renewable & Alternative Energy",
      "score": 0.39208984375
    },
    {
      "name": "/Computers & Electronics/Electronics & Electrical/Electronic Components",
      "score": 0.359130859375
    },
    {
      "name": "/Science/Engineering & Technology/Other",
      "score": 0.35205078125
    }
  ],
  "sentiment": {
    "positive": 0.8774414,
    "negative": 0.016357422,
    "neutral": 0.10644531
  },
  "summary": "Nano One Materials Corp. has joined the Arkansas Lithium Technology Accelerator (ALTA), the first US-based accelerator aimed at catalyzing a domestic, durable, and resilient lithium-ion battery supply chain. Nano One engaged with key stakeholders in government, industry, academia, and the investment community, gaining valuable perspective on Arkansas's lithium resources and commitment to innovation. The company's participation in ALTA was critical to the success of ALTA's first cohort and aligns with Governor Sanders' and Commerce Secretary Hugh McDonald's vision of leveraging Arkansas' world-class lithium reserves to attract the best upstream and midstream technology providers. Through ALTA, Nano One has added to its strategic insights, broadened its US presence and industrial relationships, and validated its One-Pot™ process for localizing lithium iron phosphate (LFP) cathode production in North America. The Company's patented process reduces costs, is easier to permit and increases industrial competitiveness and increased industrial competitiveness.",
  "shortSummary": "Nano One's participation in the Arkansas Lithium Technology Accelerator enhances its strategic exposure to US battery supply chains, enhancing production capabilities and security.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "c1441aa9471540fcb857488d96b72ab8",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Nano One participated in the Arkansas Lithium Technology Accelerator (ALTA), enhancing its engagement with stakeholders in the lithium supply chain. The company showcased its One-Pot™ process, which aims to localize lithium iron phosphate (LFP) cathode production in North America, addressing critical supply chain gaps. ALTA, supported by key industry players, aims to position Arkansas as a leader in lithium technology and battery supply chain innovation, fostering collaboration between emerging and established companies.",
  "argos_id": "HWQ160ARU"
}