{
  "url": "https://www.forbes.com/sites/christopherrim/2025/08/08/the-common-app-is-open-heres-how-to-craft-an-ivy-league-worthy-essay/",
  "authorsByline": "Christopher Rim",
  "articleId": "4f8d1b33258e4f559008d31353c5941e",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/65144803f97edb77ca625edb/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T17:01:48+00:00",
  "addDate": "2025-08-08T17:09:24.829978+00:00",
  "refreshDate": "2025-08-08T17:09:24.829981+00:00",
  "score": 1.0,
  "title": "The Common App Is Open—Here’s How To Craft An Ivy League-Worthy Essay",
  "description": "The Common App is the hub for students’ applications—including their activities lists, letters of recommendation, and supplemental essays.",
  "content": "The opened on August 1st, marking the official start of the 2025–26 admissions season. The Common App is the hub for students’ applications—including their activities lists, letters of recommendation, and supplemental essays. One of the most consequential—and daunting—elements of the Common App is the personal statement. While a student’s grades and test scores lay the foundation for their candidacy, what truly differentiates them is the story they tell about who they are on their application. This application narrative should be cohesively developed and presented throughout all of a student’s application materials, and the personal statement offers a particularly crucial opportunity to convey that narrative in their own words. It therefore shapes and guides how admissions officers view other elements of their application.\n\nWhat are the Common App prompts?\n\nThe Common App provides students with seven prompts to choose from as they write their essay. For the 2025–26 application cycle, students may select one of the following:\n• Some students have a background, identity, interest, or talent that is so meaningful they believe their application would be incomplete without it. If this sounds like you, then please share your story.\n• The lessons we take from obstacles we encounter can be fundamental to later success. Recount a time when you faced a challenge, setback, or failure. How did it affect you, and what did you learn from the experience?\n• Reflect on a time when you questioned or challenged a belief or idea. What prompted your thinking? What was the outcome?\n• Reflect on something that someone has done for you that has made you happy or thankful in a surprising way. How has this gratitude affected or motivated you?\n• Discuss an accomplishment, event, or realization that sparked a period of personal growth and a new understanding of yourself or others.\n• Describe a topic, idea, or concept you find so engaging that it makes you lose all track of time. Why does it captivate you? What or who do you turn to when you want to learn more?\n• Share an essay on any topic of your choice. It can be one you’ve already written, one that responds to a different prompt, or one of your own design\n\nStudents who are intimidated by the challenge of selecting a topic or narrowing their ideas might find inspiration in the first six prompts, while the seventh prompt provides students with the open-ended opportunity to write about whatever they would like. This option ensures that students won’t be pigeonholed in trying to answer any particular question and can allow their creativity to flourish.\n\nHow can students make their personal essay stand out to Ivy League admissions officers?\n\nDaunted by the challenge of telling a compelling story in only 650 words, many students resort to cliches, write a half-baked essay, or outsource their writing to uninspired AI-generated prose. An Ivy-League worthy essay, on the other hand, requires forethought, strategy, and a clear understanding of the unique type of writing characteristic of a compelling personal statement. Here are three steps students should take to write an essay admissions officers won’t forget:\n\nIt is impossible to share your entire autobiography in 650 words—and you should not try. Admissions officers are not looking to read your entire life story. Instead, they want a snapshot of who you are—your values, core qualities, goals, personality, and unique voice—through an emblematic story or anecdote. Rather than telling a sweeping story or narrating years of your life, focusing on a particular moment, object, facet of your identity, or impactful experience will allow you to provide greater detail, a critical component of a standout essay. Narrowing in on a specific story that might seem mundane or unnoticeable to others can allow you to showcase your creativity and individual outlook. Keep in mind that admissions officers read thousands of essays every admissions cycle; differentiating your essay from others’ will require you to articulate what specifically distinguishes you.\n\nDon’t write that you’re “passionate about helping others.” Instead, illustrate for admissions officers the exact moment your passion began. Don’t just claim you’re “curious about the world.” Draw your readers into a moment in which your curiosity led you to challenge yourself or change your mind. Don’t write that you’ve “overcome challenges.” Choose one defining hurdle you have overcome and articulate how it uniquely shaped you. While you don’t have to respond directly to a Common App prompt in your response, answering a particular question may help you choose your essay topic if you find yourself struggling.\n\n2. Ditch the AI buzzwords and think outside of the (chat)box.\n\nWith the ubiquity of AI language, students have to be all the more intentional about getting creative and avoiding cliche, ChatGPT terms and phrases. Even where students have not used AI, cliché language and other common can lead admissions officers to doubt the authenticity of students’ writing. While AI can be helpful in brainstorming, students should keep in mind that even the ideas an AI bot generates may be generic, overused, or shallow, and brainstorming should never end with AI.\n\nInstead of relying on artificial intelligence, students should embrace their creativity and strive to share their unique voice and perspective in their essays. If you’re the class clown, don’t be afraid to weave in your sense of humor. If you write poetry in your spare time, embrace rich, descriptive language (but don’t whip out the thesaurus and select words you wouldn’t normally use!). One of the best ways to determine whether your distinct voice is reflected in your essay is to enlist the editorial support of a friend or family member who knows you well. You might read the essay aloud to them or allow them to read it independently and then ask whether they would be able to identify you as the writer if they had read the essay blind.\n\nOne of the most important qualities that admissions officers look for in the personal essay is self-awareness. Your essay should not cast you as the unproblematic hero of every story. Admissions officers know that you aren’t perfect, nor do you know everything—instead, they want to see that you are aware of your own shortcomings, teachable and open-minded, and mature enough to identify your own blind spots and take action to learn and grow. As you choose a story and begin drafting, consider not only the skills you possess, but also the experiences that have caused you to rethink your perspectives, learn something new about yourself, identify a weakness, or overcome a struggle (whether internal or circumstantial).\n\nAt the same time, keep in mind that your essay is a professional piece of writing. While some students fall into the trap of writing a hero narrative, others assume that they can garner sympathy from admissions officers by sharing tragic or highly personal stories. You should be honest and introspective, but avoid trauma dumping or overly intimate disclosures.\n\nIn addition to the above, one of the most important steps students can take toward crafting an Ivy League-worthy personal statement is starting early. A great essay is not written on the first try. Developing a story, conveying your voice, and connecting your experiences to a deeper insight about who you will be on campus all require significant effort and will occur through the process of trial and error. The sooner a student starts refining their ideas, the more polished and compelling their essay will be.",
  "medium": "Article",
  "links": [
    "https://www.commonapp.org/",
    "https://www.grammarly.com/blog/ai/common-ai-words/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Students",
      "weight": 0.08013457
    },
    {
      "name": "students",
      "weight": 0.08013457
    },
    {
      "name": "Admissions officers",
      "weight": 0.07875481
    },
    {
      "name": "admissions officers",
      "weight": 0.07875481
    },
    {
      "name": "many students",
      "weight": 0.07851369
    },
    {
      "name": "Ivy League admissions officers",
      "weight": 0.07652275
    },
    {
      "name": "essays",
      "weight": 0.07577439
    },
    {
      "name": "supplemental essays",
      "weight": 0.0740177
    },
    {
      "name": "personal growth",
      "weight": 0.053979147
    },
    {
      "name": "unique voice",
      "weight": 0.05270804
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Jobs & Education/Education/Colleges & Universities",
      "score": 0.9072265625
    },
    {
      "name": "/Jobs & Education/Education/Standardized & Admissions Tests",
      "score": 0.55224609375
    }
  ],
  "sentiment": {
    "positive": 0.26293945,
    "negative": 0.20336914,
    "neutral": 0.5332031
  },
  "summary": "The Common App, the official start of the 2025–26 admissions season, has opened. The personal statement is a crucial component of a student's application, which shapes and guides how admissions officers view other elements of their application. The Common App provides students with seven prompts for their essay. Students can select one of these personal statements: a background, identity, interest, or talent that is meaningful enough to make their application incomplete without it. The seventh prompt allows students to write about whatever they wish. Students should also consider an open-ended essay, which allows for creativity and flexibility. The author recommends three steps for students to create an Ivy League-worthy essay.",
  "shortSummary": "The Common App is open, urging students to create a compelling personal essay that appeals to Ivy League admissions officers, emphasizing personal identity and motivation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "88a40359f6434a2091ab0ec38aa27716",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.grammarly.com/blog/ai/common-ai-words/",
      "text": "Key takeaways:\n- AI-generated text often follows predictable patterns, such as a steady tone, repetitive phrasing, and structured transitions.\n- Certain phrases, such as “delve into” and “at its core,” are common telltale signs and can make AI writing sound polished but stiff.\n- Using AI responsibly means including human oversight in the workflows, adding transparency to the work, and properly citing sources and AI involvement.\nEver been invited to delve into a topic? Have you noticed pivotal decisions being underscored in recent blog articles? If so, you’ve probably read content that was developed with the support of AI. AI-generated text has come a long way—it’s fluent, structured, and often impressive. But it also tends to sound repetitive and robotic.\nAI works best when you know how to guide and refine its output and use it in a responsible way. In this article, we’ll break down the most common signs of AI writing, highlight frequently used words and phrases, and explore how to use AI effectively while making sure human oversight plays a critical role.\nTable of contents\nCharacteristics of AI-generated text\nCommonly used words in AI-generated content\nEthical and responsible AI usage\nWhat is AI-generated content?\nAI-generated content refers to any text, image, video, audio, or other media created by artificial intelligence rather than a human.\nFor written content, AI-powered tools like Grammarly, ChatGPT, and Gemini generate text by analyzing vast datasets and responding to user prompts. These tools can produce fluent, well-structured copy that mimics human writing with impressive accuracy.\nAI excels at organizing ideas, enhancing readability, and streamlining content creation, but it often lacks personality and creativity—things that make human writing feel, well, human.\nCharacteristics of AI-generated text\nAI writing tends to follow distinct patterns, unlike human writing, which has more variation. Here’s what to look for to spot AI text in the wild:\n- A formal, robotic tone – AI writing often sounds robotic because it tends to repeat the same sentence structure and often lacks emotion or nuance.\n- Repetitive phrasing – Since AI generates words based on the patterns in its training data, it leans on familiar phrases, clichés, and even outdated language and information.\n- A lack of personal touch – AI-generated content can make generalizations and quickly synthesize information, but it lacks personal stories, emotions, or unique perspectives.\n- Predictable formatting – AI is great at structuring content—think title-case headings, neatly formatted bullet points, and polished phrasing.\nCommonly used words in AI-generated content\nLarge language models (LLMs), such as GPT, generate text by predicting the most likely next word based on patterns learned from vast amounts of training data. Because of this predictive process, certain words and phrases tend to appear frequently in AI-generated content and can offer clues that the content was generated, rather than written by a person.\nHigh-frequency AI words\nAI-generated content sounds smart but feels generic because it relies on often-repeated formal words and phrases. Below are some of the most commonly used words in AI-generated writing—along with their meanings and simpler, more straightforward alternatives.\nDelve into – To investigate or explore something deeply.\n- Example: “Let’s delve into the history of AI.”\n- Alternative: Explore\nUnderscore – To emphasize or highlight the importance of something.\n- Example: “This study underscores the significance of ethical AI development.”\n- Alternative: Highlight\nPivotal – Extremely important or crucial to the success of something.\n- Example: “Machine learning plays a pivotal role in modern automation.”\n- Alternative: Important\nRealm – A field, domain, or area of interest or activity.\n- Example: “This concept belongs to the realm of computational linguistics.”\n- Alternative: Area\nHarness – To make use of something effectively, especially a resource or power.\n- Example: “Businesses harness AI to improve customer service.”\n- Alternative: Use\nIlluminate – To explain, clarify, or make something easier to understand.\n- Example: “This guide aims to illuminate the complexities of neural networks.”\n- Alternative: Explain\nTransitions and structured phrases\nAI is great at organizing content and it often relies on a few transitional phrases to help readers follow along. While these phrases sometimes help with clarity, they’re often needlessly wordy and can signal the use of AI.\nBelow are some of the transition phrases AI tends to use—along with more concise or colloquial alternatives.\nThat being said… – A phrase used to introduce a contrasting point or qualification after making a statement.\n- Example: “AI tools can significantly improve efficiency. That being said, they should be used responsibly to avoid ethical concerns.”\n- Alternative: However…/Even so…\nAt its core… – A phrase used to summarize the fundamental essence of something.\n- Example: “At its core, machine learning is about recognizing patterns in data to make informed predictions.”\n- Alternative: Fundamentally…/Essentially…\nTo put it simply… – A phrase used to break down a complex concept into a more digestible explanation.\n- Example: “To put it simply, deep learning mimics the way the human brain processes information.”\n- Alternative: In simpler terms…/Simply put…\nThis underscores the importance of… – A phrase used to emphasize a significant takeaway or conclusion.\n- Example: “AI’s ability to process vast amounts of data in seconds underscores the importance of integrating it into business strategies.”\n- Alternative: This highlights the need for…/This reinforces the value of…\nA key takeaway is… – A phrase used to summarize an essential point or conclusion.\n- Example: “A key takeaway is that AI should complement human intelligence rather than replace it.”\n- Alternative: The main point is…/One important lesson is…\nFrom a broader perspective… – A phrase used to introduce a more high-level or holistic viewpoint.\n- Example: “From a broader perspective, AI is reshaping industries beyond technology, influencing healthcare, finance, and education.”\n- Alternative: When you zoom out…/On a larger scale…\nQualifiers and softening words\nAI-generated writing often plays it safe by using hedging phrases—words that soften statements to avoid sounding too absolute. While this can help maintain neutrality and prevent overgeneralization, it can also convey a hesitant or cautious tone.\nBelow are some of the most common hedging phrases AI tends to use—along with their meanings, examples, and more confident alternatives. In many of the following cases, simply removing the qualifying phrase altogether or trading it for a more specific claim or quote can make the writing feel more authoritative.\nGenerally speaking – Used to introduce a statement that is true in most cases but may have exceptions.\n- Example: “Generally speaking, machine learning models perform better with larger datasets.”\n- Alternative: In most cases…/As a rule…\nTypically – Indicates that something is common or expected in most situations.\n- Example: “Neural networks typically require large amounts of labeled data to train effectively.”\n- Alternative: Usually…/Most often…\nTends to – Suggests a recurring pattern or behavior without making an absolute statement.\n- Example: “AI-generated content tends to be more structured and uniform than to human writing.”\n- Alternative: Is often…/Has a tendency to…\nArguably – Signals that a statement is open to interpretation or debate.\n- Example: “AI is arguably one of the most transformative technologies of the 21st century.”\n- Alternative: Some may say…/Technologists agree…\nTo some extent – A phrase that limits the scope of a claim, indicating partial truth.\n- Example: “To some extent, AI can replicate human creativity, but it still lacks genuine originality.”\n- Alternative: To a certain degree…/Partially…\nBroadly speaking – Used to introduce a generalization while acknowledging that details may vary.\n- Example: “Broadly speaking, AI improves efficiency across industries, but its impact depends on the specific application.”\n- Alternative: In a general sense…/Overall…\nAnalytical and academic words\nAI-generated writing often leans on analytical and academic language to sound more sophisticated, which can also make it sound overly formal or impersonal. Look out for the following academic words AI tends to favor and consider more natural alternatives.\nShed light on – To clarify or provide a deeper understanding of a topic.\n- Example: “The study sheds light on the long-term effects of AI in education.”\n- Alternative: Explain/Clarify\nFacilitate – To make a process easier, smoother, or more efficient.\n- Example: “AI-powered chatbots facilitate customer service by handling routine inquiries automatically.”\n- Alternative: Help/Enable\nRefine – To make gradual improvements by making small adjustments.\n- Example: “Developers continually refine language models to improve their accuracy and relevance.”\n- Alternative: Improve/Enhance\nBolster – To strengthen, support, or reinforce something.\n- Example: “Real-time analytics bolster business decision-making by providing data-driven insights.”\n- Alternative: Support/Reinforce\nDifferentiate – To identify or establish distinctions between two or more things.\n- Example: “Advanced AI models can differentiate between writing styles and patterns, identifying characteristics commonly associated with AI-generated and human-written text…”\n- Alternative: Distinguish/Tell apart\nStreamline – To make a process simpler, more efficient, or less complicated.\n- Example: “Automation streamlines workflow management, reducing manual tasks and increasing productivity.”\n- Alternative: Simplify/Optimize\nOverused AI buzzwords\nAI-generated content often leans on flashy buzzwords or clichés to sound more impressive. While these words are meant to add energy, they’ve become so overused that they risk losing meaning and may make claims sound exaggerated.\nConsider trading the following common AI buzzwords for more specific language—or editing them out completely to make the writing more incisive and impactful. Often, adjectives such as “innovative” or “cutting-edge” serve as filler words and lack meaning. Instead of simply describing something as innovative, consider including specifics that convey that more vividly. Read on to discover other clichés AI tends to use along with less-used alternatives.\nRevolutionize – To completely change or disrupt an industry, process, or way of doing things.\n- Example: “AI-powered automation is set to revolutionize the way businesses handle customer service.”\n- Alternative: Transform/Change significantly\nInnovative – Describing something as new, creative, or unique in its approach.\n- Example: “This innovative machine learning model enhances speech recognition accuracy.”\n- Alternative: New/Creative/or cut entirely\nCutting-edge – At the forefront of technology, representing the latest advancements.\n- Example: “Cutting-edge AI algorithms enable real-time data analysis with unparalleled efficiency.”\n- Alternative: Advanced/State-of-the-art/or cut entirely\nGame-changing – Having a major impact that alters how something functions or operates.\n- Example: “AI-driven cybersecurity solutions are a game-changing development in threat detection.”\n- Alternative: Significant/Groundbreaking/or cut entirely\nTransformative – Causing a major shift or improvement in a field or industry.\n- Example: “Deep learning has had a transformative effect on natural language processing.”\n- Alternative: Impactful/dramatically changed\nSeamless integration – The smooth incorporation of a system, tool, or feature without disruptions.\n- Example: “The platform offers seamless integration with existing enterprise software.”\n- Alternative: Smooth compatibility/Works effortlessly with…\nScalable solution – A product or system that can easily grow to handle increased demand.\n- Example: “Cloud-based AI provides a scalable solution for businesses of all sizes.”\n- Alternative: Expandable system/Easily adjustable\nTips for ethical and responsible AI use\nAI tools offer valuable writing assistance, but they require a thoughtful, collaborative approach to get the best results. Rather than simply generating text, learn how to co-create with AI so that your creativity and originality remain at the core of your work—and don’t forget to cite when you use AI just as you would any other source. Read on for more ways to integrate AI effectively while keeping your writing authentic and trustworthy.\nTrack your writing process\nRather than relying on AI detection tools that only estimate AI involvement, Grammarly Authorship allows you to track your writing process proactively. Simply turn on Authorship before you start working in a Google Doc, and it will automatically track and categorize your writing—whether it’s fully self-authored, created with AI assistance, or pasted from another source. By tracking how you work with AI, you can remove ambiguity and demonstrate integrity in your content creation.\nBe transparent about AI’s role\nTransparency builds trust with your audience and helps set clear expectations. Grammarly’s AI citation generator in APA, MLA, and Chicago formats makes it easy to cite your use of AI.\nKeep human oversight at the center\nAI is a powerful tool, but it’s not a substitute for human judgment. Always review and refine AI-generated text to ensure it aligns with your intent, maintains your voice, and meets your quality standards. Thoughtful editing transforms AI’s structured but sometimes stiff output into something polished and uniquely yours.\nUse AI to enhance, not replace, creativity\nWhile AI can help organize ideas and streamline writing, relying on it too much can make content sound generic. Instead of letting AI dictate your message, use it as a starting point. Add your own insights, experiences, and personal style to make your writing feel more natural and engaging. AI should help you work more efficiently—not take over the creative process.\nFollow industry and institutional guidelines\nDifferent fields have different standards for AI use. If you’re writing for work, school, or publication, make sure you understand the expectations around AI-assisted writing. When required, properly cite AI-generated content just as you would any other source. Responsible AI use isn’t just about following the rules—it’s about ensuring your writing is both transparent and credible.\nConclusion\nAI tools make writing more efficient, but they often produce text that feels robotic. Recognizing AI’s patterns—like repetitive phrasing and predictable transitions—can help you refine its output and keep your writing natural. Using AI responsibly means maintaining transparency, ensuring human oversight, and following ethical guidelines.\nGrammarly helps you reap the benefits of AI while maintaining your creativity, unique voice, and integrity. With features like Grammarly Authorship, you can track AI’s role in your writing, while AI-powered suggestions enhance clarity, tone, and structure. By combining AI’s efficiency with human creativity, you can create high-quality, authentic writing that feels both polished and personal.\nCommon AI words list FAQs\nHow can you tell if text was generated by AI?\nAI-generated writing tends to follow predictable patterns—a formal or robotic tone, repetitive phrasing, and structured transitions. It also leans on certain words, like delve into, underscore, and pivotal. Tools like Grammarly’s AI Detector can analyze content for AI-generated patterns and help you spot text that may require editing.\nAre AI detection tools reliable?\nAI detection tools can estimate the likelihood that a piece of text was AI-generated, but they’re not 100% foolproof. Accuracy depends on many factors such as how advanced the AI model is and how the text was edited or refined.\nWhy does AI writing sound overly formal or structured?\nAI models are trained on massive datasets, which helps them mimic text. While the output is often clear and well-structured, it usually lacks the nuance of human expression, making it sound formal, predictable, or formulaic. If you’re looking for an easy way to make your AI-generated writing more engaging, try our AI humanizer tool, which improves flow and phrasing so your content sounds more natural and is easier to read.\nCan AI-generated content be refined to sound more human?\nYes! Human oversight can make AI-generated text more natural and engaging. Try the following strategies when editing AI content:\n- Add personal insights or anecdotes.\n- Adjust the tone and style.\n- Trade formulaic structures for something more surprising or original.\nHow can writers use AI responsibly?\nResponsible AI use means keeping human creativity and judgment at the center. To do this, review and refine AI-generated content to ensure it aligns with your voice and intent. Be transparent about AI’s role in your writing, just as you would cite other sources. And use tools like Grammarly Authorship to track AI’s contributions, providing clarity and credibility in content creation."
    }
  ],
  "argos_summary": "The 2025–26 admissions season for the Common App began on August 1st, offering students seven personal statement prompts to help them convey their unique narratives. A standout essay requires a focused story that highlights personal growth and self-awareness, avoiding clichés and generic language often associated with AI-generated content. Students are encouraged to start early, embrace their creativity, and ensure their writing reflects their authentic voice while maintaining professionalism.",
  "argos_id": "I2DT5W5PK"
}