{
  "url": "https://www.pymnts.com/meta/2025/metas-new-tbd-lab-to-lead-development-of-next-llama/",
  "authorsByline": "PYMNTS",
  "articleId": "d3cae6529641410fa196b144d3f2285d",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2025/06/Meta-AGI.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T15:42:11+00:00",
  "addDate": "2025-08-08T15:50:04.002964+00:00",
  "refreshDate": "2025-08-08T15:50:04.002966+00:00",
  "score": 1.0,
  "title": "Meta’s New TBD Lab to Lead Development of Next Llama",
  "description": "Many of the artificial intelligence (AI) researchers who joined Meta as part of that company’s high-profile recruiting efforts are reportedly working in a",
  "content": "Many of the artificial intelligence (AI) researchers who joined Meta as part of that company’s high-profile recruiting efforts are reportedly working in a new team called TBD Lab and leading the development of the next version of the large language model (LLM) Llama.\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\nTBD Lab will work alongside other AI teams in Meta’s recently formed Superintelligence Labs group, helping with new model releases and AI agents, the Wall Street Journal (WSJ) reported Thursday (Aug. 7), citing unnamed sources and an internal company memo.\n\nMeta did not immediately reply to PYMNTS’ request for comment.\n\nTBD Lab is overseen by Meta Chief AI Officer Alexandr Wang, who joined the company when it bought a $14 billion stake in his former startup, Scale AI, according to the report.\n\nWang wrote in a memo to employees, per the report: “Already in the past month, I’ve seen meaningful progress in each of these collaborations. This enables us to be more technically ambitious, parallelize across several separate efforts and ultimately achieve frontier results more quickly.”\n\nThe new team includes at least 18 AI researchers poached from OpenAI, a number from Google, and nine Meta employees transferred to TBD Lab from the company’s internal infrastructure teams, according to the report.\n\nMeta has been pursuing an AI-focused hiring spree since at least early June, when it was reported that Meta CEO Mark Zuckerberg was taking a hands-on approach to expanding the company’s artificial general intelligence (AGI) team and was recruiting from a pool of AI researchers and engineers who met with him at his homes in Lake Tahoe and Palo Alto, California.\n\nIt was reported Aug. 1 that industrywide competition for AI talent had led to unprecedented paychecks that in some cases exceeded those of NBA superstars.\n\nThese massive salaries reflect the stakes for tech giants like Meta that aim to be the first to develop AGI.\n\nOn June 30, it was reported that Zuckerberg announced in an internal memo that he was creating the Superintelligence Labs group that would be led by some of the company’s most recent hires and would include teams working on Meta’s foundation models, product, Fundamental AI Research (FAIR) and the next generation of its models.",
  "medium": "Article",
  "links": [
    "https://www.meta.com/media-gallery/executives/mark-zuckerberg/?srsltid=AfmBOoo2p5y49VAkxUvT4N2waIacbNIK-UGuWMa27IJ8oXz_wtQlbyr4",
    "https://www.pymnts.com/meta/2025/zuckerberg-personally-recruiting-experts-for-metas-agi-effort/",
    "https://www.pymnts.com/artificial-intelligence-2/2025/ai-salaries-surpass-those-of-nba-stars-and-a-bomb-maker/",
    "https://www.wsj.com/tech/ai/meta-ai-superintelligence-team-6415a4f4",
    "https://scale.com/",
    "https://www.linkedin.com/in/alexandrwang",
    "https://www.pymnts.com/artificial-intelligence-2/2025/metas-recent-ai-hires-to-lead-new-superintelligence-labs-unit/",
    "https://about.google/",
    "https://openai.com/about/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Meta Chief AI Officer Alexandr Wang",
      "weight": 0.100072816
    },
    {
      "name": "other AI teams",
      "weight": 0.09861264
    },
    {
      "name": "AI researchers",
      "weight": 0.09687755
    },
    {
      "name": "AI agents",
      "weight": 0.08853767
    },
    {
      "name": "AI talent",
      "weight": 0.08852351
    },
    {
      "name": "Scale AI",
      "weight": 0.08828531
    },
    {
      "name": "Meta",
      "weight": 0.087932065
    },
    {
      "name": "Meta CEO Mark Zuckerberg",
      "weight": 0.087080926
    },
    {
      "name": "Fundamental AI Research",
      "weight": 0.08622128
    },
    {
      "name": "TBD Lab",
      "weight": 0.07534482
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.94482421875
    },
    {
      "name": "/News/Technology News",
      "score": 0.89892578125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.8603515625
    },
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.48388671875
    }
  ],
  "sentiment": {
    "positive": 0.5239258,
    "negative": 0.08569336,
    "neutral": 0.39013672
  },
  "summary": "Many of the AI researchers who joined Meta as part of its high-profile recruiting efforts are reportedly leading the development of the next version of the large language model (LLM) Llama. The new TBD Lab team includes at least 18 AI researchers from OpenAI, a number from Google, and nine Meta employees transferred from internal infrastructure teams. It will work alongside other AI teams in Meta’s recently formed Superintelligence Labs group to help with new model releases and AI agents. The team is overseen by Meta Chief AI Officer Alexandr Wang, who joined the company when it bought a $14 billion stake in his former startup, Scale AI. The company has been on an AI-focused hiring spree since early June, with CEO Mark Zuckerberg reportedly taking a hands-on approach to expanding the company's artificial general intelligence team.",
  "shortSummary": "Meta's new TBD Lab, led by top AI researchers recruited from OpenAI and Google, will develop the next generation of Llama models alongside other teams in Superintelligence Labs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1b87108b07cf431baafad1e5ee52a1f1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.pymnts.com/artificial-intelligence-2/2025/metas-recent-ai-hires-to-lead-new-superintelligence-labs-unit/",
      "text": "Those leaders include former Scale AI CEO Alexandr Wang and former GitHub CEO Nat Friedman, CNBC reported, citing an internal memo. Zuckerberg also said Meta had hired 11 other people in the last few weeks to join the team.\nThe new unit will include teams working on Meta’s foundation models, product, Fundamental AI Research (FAIR) and the next generation of its models, according to the report.\n“I’ve spent the past few months meeting top folks across Meta, other AI labs, and promising startups to put together the founding group for this small talent-dense effort,” Zuckerberg said in the memo, per the report. “We’re still forming this group and we’ll ask several people across the AI org to join this lab as well.”\nMeta did not immediately reply to PYMNTS’ request for comment.\nIt was reported June 10 that Zuckerberg was personally recruiting experts for Meta’s artificial general intelligence (AGI) team, recruiting from a pool of AI researchers and engineers who had met with him at his homes in Lake Tahoe and Palo Alto, California.\nZuckerberg had been clear about making AI a priority for Meta, but had recently gone into “founder mode,” with a hands-on approach to management, the June 10 report said.\nIt was reported June 18 that OpenAI CEO Sam Altman said Meta was offering $100 million signing bonuses to poach his workers as it tried to catch up in the AI race.\nScale AI, which is a data-labeling startup, announced June 12 that it had received a “significant investment” from Meta and that Wang would join Meta while also continuing to serve as a director on Scale’s board of directors.\nIt was reported June 18 that Meta was in talks to hire Friedman and Daniel Gross, who are AI investors, and partially buy out their venture capital fund, NFDG, which has invested in AI startups like Perplexity, The Bot Company and Safe Superintelligence.\nAccording to Monday’s CNBC report, Meta hired both Friedman and Gross."
    },
    {
      "url": "https://www.pymnts.com/artificial-intelligence-2/2025/ai-salaries-surpass-those-of-nba-stars-and-a-bomb-maker/",
      "text": "That’s according to a report Friday (Aug. 1) by Ars Technica, which cites the example of Matt Deitke, an artificial intelligence (AI) researcher offered $250 million — over four years — to bring his expertise to Meta.\nSuch a figure, the report said, “shattered every historical precedent” for scientific and technical compensation the publication was able to find, including the salaries of the people involved in the space race and developing the atomic bomb.\nFor example, J. Robert Oppenheimer, head of the Manhattan Project, made $10,000 per year in 1943, or $190,865 adjusted for inflation. Many professional athletes aren’t in the same neighborhood in terms of compensation. For example, the four-year contract signed by NBA superstar Steph Curry was $35 million less than Deitke’s deal.\nThe report argues these massive salaries reflect the stakes for tech giants like Meta and Google: who will be the first to develop artificial general intelligence (AGI) or superintelligence — or AI capable of performing intellectual tasks at or beyond the human level.\nMeta CEO Mark Zuckerberg told investors recently that the company would continue to invest heavily in AI recruitment “because we have conviction that superintelligence is going to improve every aspect of what we do.”\nThe report also cites a recent open letter from Zuckerberg in which he described superintelligence as technology that would “begin an exciting new era of individual empowerment,” while declining to detail what superintelligence actually is.\nApple, meanwhile, is planning to “significantly” step up its AI investments and dedicate more workers toward building its Apple Intelligence features, CEO Tim Cook said last week.\nDuring the company’s earnings call, Cook said that Apple is making “good progress” on infusing more AI capabilities with its voice assistant Siri, which are set to come next year.\nThe aim is to develop a “more personalized” Siri and for AI features in iOS to be “deeply personal, private and seamlessly integrated,” Cook said. Offerings like live translation and “workout buddies” are coming soon.\nIn other AI news, PYMNTS wrote last week about research showing that while most chief financial officers (CFOs) say they grasp the concept of agentic artificial intelligence — systems that can plan, reason and take actions with minimal or no human input — few are ready to implement it.\nResearch by PYMNTS Intelligence shows that almost all CFOs polled were aware of agentic AI, but only 15% showed interest in using it within their companies.\n“A lot of companies are excited about what agentic AI can do, but not enough are thinking about what it takes to use it safely,” James Prolizo, chief information security officer at Sovos, told PYMNTS. “These tools are starting to make real decisions, not just automate tasks, and that changes the game.”"
    },
    {
      "url": "https://www.linkedin.com/in/alexandrwang",
      "text": "About\nArticles by Alexandr\nActivity\n-\nI don’t post often—but the past month lit a fire. When I first walked into Scale's office, the energy was frenetic and unrelenting. Leading part of…\nI don’t post often—but the past month lit a fire. When I first walked into Scale's office, the energy was frenetic and unrelenting. Leading part of…\nLiked by Alexandr Wang\n-\nI’ve loved reading the posts from Scaliens this week. Team Flow for the win! I started at Scale when Covid hit in 2020. I’d just moved to San…\nI’ve loved reading the posts from Scaliens this week. Team Flow for the win! I started at Scale when Covid hit in 2020. I’d just moved to San…\nLiked by Alexandr Wang\nExperience & Education\nHonors & Awards\n-\nUSA Physics Team\n-\nSelected as one of the top 20 physics students in the nation through competition in the USA Physics Olympiad and competed for a spot on the national International Physics Olympiad (IPhO) team.\n-\nMathematical Olympiad Summer Program (MOP)\n-\nInvited to prestigious and selective mathematical olympiad training and team selection program by scoring among the top 30 in the nation on the USA Mathematical Olympiad\n-\nUSA Mathematical Talent Search (5th place nationally)\n-\nNational proof-based competition generally intended to simulate math research, funded by the NSA; Bronze Medalist (2011), Gold medal and 5th place nationally (2012)\n-\nUSA Computing Olympiad (USACO) Finalist\n-\nNational Finalist and Camp Invitee (2012 - 2013), 10th place in IOI team selection (2013)\nLanguages\n-\nChinese\n-\n-\nFrench\n-\nMore activity by Alexandr\n-\nWhat a roller-coaster week it’s been at Scale—definitely not what I expected when I made the leap to boomerang back and step out of my comfort zone…\nWhat a roller-coaster week it’s been at Scale—definitely not what I expected when I made the leap to boomerang back and step out of my comfort zone…\nLiked by Alexandr Wang\n-\nWe did a thing 🚀 So proud of Alexandr Wang for the company he built; the talented Legal Team at Scale for their grit and tenacity (with special…\nWe did a thing 🚀 So proud of Alexandr Wang for the company he built; the talented Legal Team at Scale for their grit and tenacity (with special…\nLiked by Alexandr Wang\n-\nGood discussion on AI leadership with President Trump and my colleagues from across the AI industry 🤝 Thanks to our Saudi hosts as well!\nGood discussion on AI leadership with President Trump and my colleagues from across the AI industry 🤝 Thanks to our Saudi hosts as well!\nShared by Alexandr Wang\n-\nTo ensure our Nation’s prosperity and security, we must unleash scientific breakthroughs and ensure America's technological dominance. Now we have…\nTo ensure our Nation’s prosperity and security, we must unleash scientific breakthroughs and ensure America's technological dominance. Now we have…\nLiked by Alexandr Wang\n-\nThis is a brilliant example of using AI not as a gimmick, but rather a reimagining of a product experience. Kudos to Mark Howard, Jessica Sibley and…\nThis is a brilliant example of using AI not as a gimmick, but rather a reimagining of a product experience. Kudos to Mark Howard, Jessica Sibley and…\nLiked by Alexandr Wang\n-\nOne of the youngest and brightest minds in the industry, Scale AI founder and CEO Alexandr Wang has quickly risen through the ranks by pioneering…\nOne of the youngest and brightest minds in the industry, Scale AI founder and CEO Alexandr Wang has quickly risen through the ranks by pioneering…\nLiked by Alexandr Wang\nOther similar profiles\nExplore top content on LinkedIn\nFind curated posts and insights for relevant topics all in one place.\nView top contentOthers named Alexandr Wang\n2 others named Alexandr Wang are on LinkedIn\nSee others named Alexandr Wang"
    },
    {
      "url": "https://www.pymnts.com/meta/2025/zuckerberg-personally-recruiting-experts-for-metas-agi-effort/",
      "text": "This effort is born out of Zuckerberg’s frustration with the tech giant’s limitations in artificial intelligence (AI), Bloomberg News reported Tuesday (June 10), citing sources familiar with the matter.\nAccording to the report, the CEO is recruiting from a pool of AI researchers and engineers who have met with him at his homes in Lake Tahoe and Palo Alto in recent weeks, with the aim of forming what Meta calls a “superintelligence” group.\nThe sources told Bloomberg that Zuckerberg’s goal is to turn Meta into a leader in the field of artificial general intelligence (AGI), or machines that can perform tasks at the same level as humans. Once Meta reaches that point, it could incorporate AGI into everything from its social media platforms to products like its AI-powered Ray-Ban glasses, the report said.\nPYMNTS has contacted Meta for comment but has not yet gotten a reply.\nZuckerberg plans to hire around 50 people for the new team, including a new head of AI research, the report added. While Zuckerberg has been clear about making AI a priority for Meta, sources say he has recently gone into “founder mode,” with an increasingly hands-on approach to management.\nThe effort is happening as the company is also — per an earlier Bloomberg report — planning a multi-billion dollar investment in Scale AI, which provides data labeling services to help businesses train machine learning models.\nWriting about AGI earlier this year, PYMNTS noted that the realization of that goal would have major implications for business.\nFor instance, one AI system can analyze market trends while at the same time redesigning the supply chain to respond to those changes, that report argued.\nThe technology could handle customer service while also using those interactions to inform product development. It could manage operations while coming up with innovative solutions to efficiency issues. It can make strategic decisions by synthesizing information from multiple industries and domains, something that requires advanced general reasoning.\n“However, the challenges are significant as well,” the report added. “The development of AGI would necessitate major economic and social changes. Industries could be transformed overnight. Jobs would be created and eliminated at unprecedented rates. Companies would need to completely rethink their organizational structures and business models.”"
    }
  ],
  "argos_summary": "Meta has established a new team called TBD Lab, led by Chief AI Officer Alexandr Wang, to develop the next version of its large language model, Llama. This initiative is part of Meta's broader strategy to enhance its artificial intelligence capabilities, particularly in artificial general intelligence (AGI), as CEO Mark Zuckerberg actively recruits top talent from competitors like OpenAI and Google. The hiring spree reflects the intense competition in the tech industry for AI expertise, with salaries for AI researchers reaching unprecedented levels.",
  "argos_id": "IO6CRU35Q"
}