{
  "url": "https://www.washingtonpost.com/world/2025/08/08/gaza-hunger-starvation-famine-treatment/",
  "authorsByline": "Victoria Bisset",
  "articleId": "d1c3591646c0487bb5c286f6d945a92c",
  "source": {
    "domain": "washingtonpost.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ZOGZPZP2F4KBJH7BFPTXRS5RUM_size-normalized.jpg&w=1440",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T08:19:08.297000+00:00",
  "addDate": "2025-08-08T08:25:27.786759+00:00",
  "refreshDate": "2025-08-08T08:25:27.786760+00:00",
  "score": 1.0,
  "title": "Starvation is spreading in Gaza — and treating it won’t be easy",
  "description": "Experts warn that famine is unfolding in Gaza — and that treating severe acute malnutrition will take more than just increasing food aid to the enclave.",
  "content": "In late July, the world’s leading hunger monitor declared what many had already feared: Famine is unfolding across Gaza, it said, with “a rise in hunger-related deaths” driven by “widespread starvation, malnutrition, and disease.” Nearly 200 people have died of starvation in the enclave, according to the Gaza Health Ministry — a number experts believe is an undercount, both because malnutrition leaves patients more vulnerable to other infections and conditions that are listed as the cause of death, as well as the difficulty of recording deaths that take place outside hospitals.\n\nThe wave of starvation sweeping across Gaza is making an already desperate situation worse. Even if Israel allows a surge in aid deliveries — as rights groups and its allies have urged — a boost in food supplies alone may not be enough to save severely malnourished patients, particularly children, who are more vulnerable to the worst effects and may need specialized treatment and intensive care.\n\n“Just sending food into a crisis situation doesn’t really solve the problem of severe acute malnutrition,” Robert Akparibo, an associate professor in global health and nutrition at the University of Sheffield, said in an interview. “It may contribute to address food insecurity, but the availability of food alone is not enough,” he added, stressing the need to ensure that malnourished patients receive the right nutrients and are assessed by professionals.\n\nIn the first week or two of treatment, malnourished patients are at a greater risk of refeeding syndrome, in which electrolyte and fluid shifts can lead to serious complications such as seizures, respiratory failure and cardiac arrest, Pooja Yerramilli, an assistant professor and hospitalist at Johns Hopkins University, wrote last year.\n\nThe sickest patients, including children with health complications and those who cannot keep down food, may be given specialized high-energy milks or intravenous rehydration, according to Francesco Checchi, a professor of epidemiology and international health at the London School of Hygiene and Tropical Medicine. Severely malnourished children who have a severe infection or other conditions will normally need inpatient treatment, in which they may be given antibiotics, deworming treatment or other treatments to stabilize their condition, he added.\n\nWhile children with health complications will usually be a minority — perhaps one-fifth of all children with severe acute malnutrition — those without immediate complications will also need to be given RUTF on an outpatient basis, Checchi said. Treatment for adults “will almost invariably” involve RUTF or the use of the specialized milks where needed, he said.\n\nAlthough the approved treatment methods for severe acute malnutrition are considered highly effective, ensuring those in need can access such treatment is particularly challenging in Gaza, where Israel’s 22-month war has caused mass displacement and destruction and has damaged or destroyed at least 94 percent of all hospitals, according to the World Health Organization.\n\nWith food supplies running low across Gaza, there is insufficient nutritious food that children recovering from malnutrition can use to supplement their diet with. “In these kinds of situations where there is basically chronic unresolved food insecurity at the household level, what we tend to see is that these nutritional programs have high cure rates,” according to Checchi — “but the rates of relapse are really high as well.”\n\n“So it’s likely that the child will recover weight and will at least temporarily recover from severe or moderate malnutrition, but then you’re left with the same situation that led the child down that track in the first instance,” he added.\n\nAs of July 31, more than 1,300 people had been killed while seeking aid in and around GHF sites, according to the U.N. human rights office, which said that “most of these killings were committed by the Israeli military.” The Israeli military says it has only fired warning shots and disputes the toll.\n\n“Food aid shipments have been highly inadequate, and our analysis of the food packages supplied by the GHF shows that their distribution plan would lead to mass starvation, even if it was able to function without the appalling levels of violence that have been reported,” the Famine Review Committee — an independent body that reviews the findings of the U.N.-linked hunger monitor — said in late July.",
  "medium": "Article",
  "links": [
    "https://medicalguidelines.msf.org/en/viewport/CG/english/severe-acute-malnutrition-16689141.html",
    "https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003280",
    "https://www.washingtonpost.com/world/2025/07/25/palestinian-state-france-uk-germany-gaza-macron/946f1458-6957-11f0-ac4f-195fdb8ee9a8_story.html",
    "https://www.washingtonpost.com/world/2025/07/31/gaza-airdrop-aid-trucks-food-humanitarian/",
    "https://reliefweb.int/report/occupied-palestinian-territory/killings-palestinians-seeking-food-gaza-continue-starvation-deepens-enar",
    "https://www.rescue.org/uk/article/why-do-most-children-affected-acute-malnutrition-go-untreated#:~:text=Evidence%20proves%20that%20simplified%20approaches,product%20than%20the%20traditional%20protocol.",
    "https://www.washingtonpost.com/world/interactive/2025/gaza-war-destruction-aerial-airdrop/",
    "https://www.washingtonpost.com/world/2025/05/24/gaza-humanitarian-foundation-ghf-aid/",
    "https://www.washingtonpost.com/world/2025/08/04/israel-palestinians-hamas-war-hostages-gaza-08-04-2025/5f44c290-714b-11f0-84e0-485bb531abeb_story.html",
    "https://www.washingtonpost.com/world/2025/07/24/gaza-starvation-israel-restrictions/",
    "https://www.washingtonpost.com/world/2025/07/29/gaza-famine-ipc-israel-palestinians/",
    "https://www.ipcinfo.org/fileadmin/user_upload/ipcinfo/docs/IPC_GazaStrip_Alert_July2025.pdf",
    "https://my.clevelandclinic.org/health/diseases/23228-refeeding-syndrome",
    "https://www.washingtonpost.com/politics/2025/07/28/trump-starvation-gaza-israel-aid/",
    "https://www.washingtonpost.com/world/2025/05/29/gaza-humanitarian-foundation-aid-united-states/",
    "https://www.washingtonpost.com/world/interactive/2025/gaza-hunger-starvation-children-body/",
    "https://www.doctorswithoutborders.org/latest/msf-staff-and-patients-are-wasting-away-mass-starvation-spreads-across-gaza"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "severe acute malnutrition",
      "weight": 0.082056485
    },
    {
      "name": "Food aid shipments",
      "weight": 0.074726954
    },
    {
      "name": "food insecurity",
      "weight": 0.07401315
    },
    {
      "name": "food supplies",
      "weight": 0.073289916
    },
    {
      "name": "chronic unresolved food insecurity",
      "weight": 0.070283644
    },
    {
      "name": "food",
      "weight": 0.06991117
    },
    {
      "name": "specialized treatment",
      "weight": 0.06934316
    },
    {
      "name": "insufficient nutritious food",
      "weight": 0.06904389
    },
    {
      "name": "other treatments",
      "weight": 0.068113156
    },
    {
      "name": "malnourished patients",
      "weight": 0.067653485
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.7197265625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Charity & Philanthropy",
      "score": 0.71826171875
    },
    {
      "name": "/News/World News",
      "score": 0.465576171875
    },
    {
      "name": "/News/Other",
      "score": 0.44091796875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.335693359375
    }
  ],
  "sentiment": {
    "positive": 0.072265625,
    "negative": 0.70996094,
    "neutral": 0.2175293
  },
  "summary": "The world's leading hunger monitor, the Gaza Health Ministry, has reported a rise in hunger-related deaths due to widespread starvation, malnutrition, and disease. Nearly 200 people have died of starvation, according to the ministry, a number experts believe is an undercount due to malnutrition leaving patients more vulnerable to other infections and conditions listed as the cause of death. However, even if Israel allows a surge in aid deliveries, experts warn that it will not be enough to save severely malnourished patients, particularly children. The sickest patients, including children with health complications and those who cannot keep down food, may be given specialized high-energy milks or intravenous rehydration. Despite approved treatment methods, accessing such treatment is particularly challenging in Gaza, where Israel's 22-month war has caused mass displacement and destruction.",
  "shortSummary": "The Gaza Strip faces severe starvation and malnutrition, with inadequate food supplies and inadequate treatment, highlighting the need for urgent intervention.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c3b6b765512c471783259fac5750e089",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://my.clevelandclinic.org/health/diseases/23228-refeeding-syndrome",
      "text": "Refeeding syndrome can happen when someone who has been malnourished begins feeding again. If food is introduced too quickly, it can cause serious complications. This happens because of the ways our bodies change when they are deprived of nutrients. When we begin refeeding, they have to change back, but they may not have the resources they need.\nAdvertisement\nCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy\nRefeeding syndrome can happen when somebody who is malnourished begins feeding again. Malnourished means your body is deprived of nutrients. When your body tries to metabolize nutrients again, severe shifts — related to electrolyte deficiencies — can occur in your body’s chemistry. They can cause dangerous complications, affecting your muscles, lungs, heart and brain.\nAdvertisement\nCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy\nRefeeding syndrome can affect anyone who has begun refeeding after they have been malnourished. If you haven’t been eating enough, you could be malnourished. Certain medical conditions can also cause malnutrition. They can affect your appetite or your ability to absorb nutrients from your food. Some risk factors for malnutrition and refeeding syndrome include:\nWhen your body is starved for nutrients, it makes certain changes to adapt. It changes its metabolism — the way it converts food into energy. Instead of carbohydrates from food, your body metabolizes its own fat and muscle. Metabolism also slows down. Your resting metabolic rate — how much energy you spend while at rest — reduces by as much as 20%.\nThis type of metabolism takes fewer resources. It doesn't use micronutrients — vitamins, minerals and electrolytes — the way normal metabolism does. But when refeeding begins, so does normal carbohydrate metabolism. Your body reaches deep into its pockets for the micronutrients it needs to get the job done. If your stores are too low, now is when you will feel the effects.\nAdvertisement\nIt’s caused by low stores of certain micronutrients in your body. Your stores are low when you have been malnourished. The most common nutrients involved are phosphorus, potassium and magnesium. When you begin refeeding, your cells demand these electrolytes to metabolize the food. This causes a severe shift in your body chemistry.\nThe electrolytes you have move rapidly from your blood into your cells. But because you don’t have enough, this shift leaves low levels of them in your blood. Low electrolyte levels in your blood are called “deficiencies”. They throw off your body’s chemistry. Electrolyte deficiencies cause the many various complications that can appear in refeeding syndrome.\nRefeeding syndrome can manifest in a variety of ways. The most common form is acute phosphate deficiency. But other deficiencies and imbalances may also contribute.\nPhosphorus deficiency (hypophosphatemia) is the most common feature of refeeding syndrome. Phosphate deficiency affects cellular processes throughout your body. It may cause:\nIf you have severe symptoms, phosphate deficiency can cause organ failure, which can be fatal.\nMagnesium is an important factor in metabolism. Magnesium deficiency (hypomagnesemia) affects every organ in your body. It may look like:\nMild potassium deficiency (hypokalemia) may not cause symptoms. But more severe deficiency may result in:\nThiamine deficiency is particularly triggered by refeeding with carbohydrates. It can result in severe neurological symptoms, including:\nMetabolic changes can affect the balance of sodium and water in your body. In refeeding, this can lead to either fluid overload or dehydration. This can cause:\nReintroducing glucose during refeeding can lead to hyperglycemia (high blood sugar). This can result in:\nAdvertisement\nDuring refeeding, your healthcare team will check your vital signs. If any abnormalities or symptoms appear, they will investigate by giving you a blood test. This will help them identify the specific imbalances you have and how severe they are.\nBefore beginning refeeding, your healthcare providers will give you a blood test. They'll measure your electrolyte levels to identify any deficiencies. Then they’ll build the missing micronutrients into your nutritional formula. The idea is to replace your missing micronutrients first. Then, your body will be better prepared to metabolize carbohydrates.\nBut, electrolyte deficiencies won't always show up in the initial blood test. Because refeeding hasn’t begin yet, your body doesn’t know yet that it will need those electrolytes. The great shift of electrolytes from your blood into your cells hasn’t happened yet. For this reason, sometimes deficiencies don’t show up until after refeeding has begun.\nYour healthcare team will continue to watch you for symptoms. They’ll also measure your electrolyte levels daily. Refeeding syndrome usually occurs within the first five days of refeeding. If symptoms appear, your healthcare team will slow down your refeeding. They’ll reduce the carbohydrates in your formula. They may replace your missing nutrients through an IV into your bloodstream.\nAdvertisement\nWhen your healthcare provider recognizes refeeding syndrome, they can correct it immediately. But the refeeding process takes longer. It may take several weeks to treat the original micronutrient deficiencies.\nComplications from refeeding syndrome can lead to death, but usually, they’re less severe. Once your healthcare team corrects the imbalances involved, most symptoms are reversible.\nIt’s not always possible to avoid the need for refeeding, but you can take certain precautions.\nRefeeding syndrome is a complication of treatment for malnourishment. This is already a stressful condition for your body to endure. It may seem counterintuitive, but too much cure too quickly can be harmful. Refeeding is a delicate and complex process. Ideally, it should be medically supervised. During medical refeeding, your healthcare team will monitor you closely. They’ll work to prevent refeeding syndrome and will be prepared to manage it if needed.\nAdvertisement\nLast reviewed on 06/06/2022.\nLearn more about the Health Library and our editorial process."
    },
    {
      "url": "https://www.rescue.org/uk/article/why-do-most-children-affected-acute-malnutrition-go-untreated#:~:text=Evidence%20proves%20that%20simplified%20approaches,product%20than%20the%20traditional%20protocol.",
      "text": "Around the world, an estimated 45 million children under the age of five experience acute malnutrition at any given time. Up to two million of these children die as a result annually.\nThe surging global hunger crisis is dire, especially for vulnerable children who are at heightened risk. However, there is a promising solution: treatment with a high protein peanut paste known as ready-to-use therapeutic food (RUTF). This innovative intervention has demonstrated remarkable effectiveness in combating malnutrition, providing essential nutrients that help children recover and thrive. By ensuring access to RUTF, we can make significant strides in addressing the devastating impact of hunger and improving the lives of countless young individuals around the world.\nMore than 90 percent of malnourished children treated with RUTF recover within weeks. But this simple, effective and scalable solution is still out of reach for too many children. Historically, more than four of every five children with acute malnutrition do not receive this lifesaving treatment they need due to unnecessary, life-threatening bureaucracy and lack of sustained funding.\nThe International Rescue Committee (IRC) treats children experiencing acute malnutrition in 21 countries. Scaling up our approach and delivering these simplified, proven solutions will save lives.\nMany complex global problems don’t have a simple solution, but this one does. Read on to learn more about acute malnutrition, why children aren’t receiving the treatment they need, and how we can build a world where no child dies of hunger.\nWhat is acute malnutrition?\nChildren experiencing acute malnutrition are too thin for their height and as their bodies weaken from a lack of nutrition, they become more vulnerable to other diseases. They are 11 times more likely to die than healthy children.\nEven if a child survives acute malnutrition, they often face long-lasting harmful effects from it. Acute malnutrition can negatively impact physical and mental development, especially in children under the age of five who are in a critical period of growth.\n“This is a grim reality. The world cannot afford to stand back and watch,” says Elijah Okeyo, the IRC’s Uganda country director\nWhat factors contribute to acute malnutrition?\nIn 2023, nearly 282 million people in 59 countries faced high levels of acute food insecurity, requiring urgent food and livelihood assistance.\nMany countries with high rates of children experiencing acute malnutrition suffer disproportionately from the effects of climate change, which has increased the severity of droughts and floods, destroying food supplies and livelihoods. The growing global hunger and malnutrition crisis is directly linked to climate change. Climate shocks damage critical infrastructure, limiting access to clean water and sanitation. In such cases, diseases can spread rapidly – often among populations of children whose immune systems are already weakened by malnutrition.\nCountries like Somalia, which endured three consecutive years of severe drought followed by flash flooding, are feeling the impacts firsthand. This continues to affect 4.3 million people who are facing crisis levels of food insecurity. The drought also decimated people’s livelihoods, especially those in the agro-pastoral sector, with over 3.5 million livestock having perished.\nConflict is also a driver of hunger and malnutrition because of the ways it disrupts agricultural production and displaces people, leaving them without regular access to food, shelter or water. Food is sometimes weaponised during conflicts, leading to blockades or destruction of food supplies, which causes malnutrition to spike among civilians.\nThis can be seen in Sudan, where more than half of the population are now facing crisis or worse levels of food insecurity, forcing families to make impossible decisions to feed their children.\n“The conflict in Sudan has decimated agricultural production, restricted the transportation of food, collapsed the banking sector, undermined local markets, and created large-scale displacement, all of which are limiting people’s ability to feed themselves,” said Eatizaz Yousif, the IRC’s Country Director for Sudan. “At the same time, restrictions on humanitarian access have severely limited humanitarian actors’ ability to reach populations in need.”\nIn Gaza, the escalation of hostilities in late 2023 created an unprecedented food crisis with the entire population of 2.2 million people facing high levels of acute food insecurity—the highest share ever classified for any area or country.\nWhy are children in need not receiving treatment?\nEven though treatment for acute malnutrition is readily available, historically fewer than 1 in 5 children have received this life-saving care. The status quo approach to delivering care to malnourished children is complex, overly-bureaucratic and hobbled by a lack of sustained funding.\n“With climate change and conflict exacerbating the global hunger crisis, it is more important than ever that we scale up simplified approaches to tackle acute malnutrition,” said Mesfin Teklu Tessema, Senior Director of Health at the IRC.\nMalnourished children who need life-saving treatment are artificially divided into two groups: moderately and severely malnourished. Each is treated with different products, at different delivery points, supported by two different UN agencies — limiting the number of children that can be reached with finite resources.\nThe lack of sufficient, coordinated and accountable funding also impedes plans to prevent and treat acute malnutrition. Addressing acute malnutrition is an issue with broad political support from different factions and ideologies, as demonstrated by politicians working across party lines in the United States Congress to pass the Global Malnutrition Prevention and Treatment Act in October 2022. Although the passage of this law was a welcome development, much more remains to be done to fully fund and simplify the global approach to meeting this hunger crisis.\nHow does the IRC address acute malnutrition?\nThe IRC has been researching simplified approaches for treatment of acute malnutrition for a decade and the body of research is now significant. The evidence is consistent that simplified approaches are more cost-effective ways to treat acute malnutrition. The solution is a simplified treatment to reach every child.\nThe Movement against Malnutrition advocates for and champions all radically simpler, scalable and cost-efficient treatment approaches for acute malnutrition - and implements them in affected countries worldwide.\nHow does the IRC deliver treatment for malnutrition?\nThe IRC is leading innovation on simplified approaches to treating acute malnutrition, and ensuring more children receive life-saving treatment with the same resources, including treating all forms of acute malnutrition with a single food product at a single point of care, leveraging community health workers already embedded in local communities, and using simplified diagnosis and dosing.\n“We are trying to reach mothers and children who are facing malnutrition so that we can provide them with health services and educational trainings,” says Agha, an IRC community health care worker in Afghanistan. “We want to raise awareness and guide them to care for their own health and prevent malnutrition in the future.\nHow effective is the IRC's approach?\nThe IRC has seen firsthand the impact simplified approaches can have in ensuring no child dies of hunger.\nEvidence proves that simplified approaches are reliably and consistently effective. An IRC study in 2022, conducted in partnership with the Mali Ministry of Health, looked at more than 27,000 children treated for acute malnutrition with a simplified approach. 92 percent recovered in just weeks. The simplified approach also costs 20% less per child treated and uses 25% less product than the traditional protocol.\nHow can we treat more children experiencing acute malnutrition?\nOur mission is to ensure no child dies of acute malnutrition. We plan to unify groundbreaking innovation, research, program delivery and advocacy to end this unconscionable global tragedy once and for all.\nThe Movement against Malnutrition advocates for and champions all radically simpler, scalable and cost-efficient treatment approaches for acute malnutrition - and implements them in affected countries worldwide.\n“There are many horrific problems in the world for which we don’t have proven and scalable solutions, but treatment of acute malnutrition is not one of them,” said Amit Paley, the Executive Director of the IRC’s Movement Against Malnutrition. “The global community must take urgent action to save the lives of millions of children who need this simple, life-saving treatment now.”\nHow can I help stop acute malnutrition?\nAlthough a proven treatment for malnutrition is available, simplified approaches and funding to sustain them at scale are needed to treat the estimated 45 million children experiencing acute malnutrition around the world.\nDonate to the IRC to help us address this and other crises around the world.\n*Some last names excluded for privacy."
    },
    {
      "url": "https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003280",
      "text": "Citation: Yerramilli P (2024) Refeeding in crisis settings: Implications on health care needs in Gaza. PLOS Glob Public Health 4(5): e0003280. https://doi.org/10.1371/journal.pgph.0003280\nEditor: Julia Robinson, PLOS: Public Library of Science, UNITED STATES\nPublished: May 24, 2024\nCopyright: © 2024 Pooja Yerramilli. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.\nFunding: The authors received no specific funding for this work.\nCompeting interests: The authors have declared that no competing interests exist.\nFor months, humanitarian organizations and international agencies have sounded alarms over the imminent famine in Gaza. The Integrated Food Security Phase Classification (IPC) Report in March 2024 projected that, in the absence of cessation of hostilities and sustained access to essential aid and services including food, 1.1 million people–amounting to half the population in Gaza–will experience catastrophic food insecurity between mid-March and mid-July. Indeed, particularly in Northern Gaza, starvation has significantly increased, with rates of acute malnutrition rising from between 1% and 6.8% in January 2024 to between 12.5% and 16.5% the next month [1].\nThe rise of widespread malnutrition raises significant concerns regarding the associated short, medium and long-term health consequences that will arise in the context of a collapsing health system in Gaza. As a direct consequence of severe acute malnutrition, children can experience wasting and death in the immediate term—from, for example, hypoglycemia, hypothermia, infection, dehydration, and anemia—and stunting over time [2]. Malnourished children and adults are more vulnerable to severe illness of all causes [3]; in Gaza, this is exacerbated by the lack of access to water, sanitation and hygiene which has facilitated the spread of infectious disease such as Hepatitis A [1]. Beyond these health impacts, evidence suggests that the consequences of malnutrition among children are life-long; lasting systemic inflammation may increase risks of cardiovascular and metabolic diseases in adulthood [4].\nWhat has been less well-described, however, is the monitoring that is required when malnourished individuals are re-fed, and the medical support that will be needed alongside attempts to restore food access in Gaza. Depending on the level of acute malnutrition a young child experiences, they require consistent community-based treatment at the least–including delivery of nutritional supplements, specialized nutritious foods specifically formulated to treat malnutrition, and possibly oral antibiotics–and hospital-based treatment for severe cases that require medical stabilization and more intensive care including IV medications [2]. But even in older children and adults, healthcare needs to treat malnutrition can be significant. Namely, in the first one to two weeks that malnourished patients are fed, they are at heightened risk of electrolyte and fluid shifts that can result in severe medical complications including seizures, respiratory failure, cardiac arrest and death–otherwise known as refeeding syndrome [5].\nIn countries such as the United States, individuals at high risk of re-feeding syndrome are typically observed carefully in medical facilities. These include patients who weigh less than 70% of ideal body weight or who have rapidly lost large amounts of weight due to conditions such as anorexia nervosa, alcohol use disorder, cancer, and other critical illnesses. Refeeding syndrome can be avoided, particularly for patients at highest risk, through daily observation of clinical status and biomedical testing, alongside methodical titration of electrolyte repletion and nutritional intake to prevent complications [5].\nWhile more is known about treatment of malnutrition in young children, little has been published explicitly about the incidence of complications like refeeding syndrome among older children and adults in crisis settings; however our historical understanding of and current clinical guidelines for treatment of malnutrition across all ages suggest that access to food—including specialized nutritious foods, which have their own complex supply chain considerations [6]—must be matched by commensurate access to health services in these contexts. Anecdotal accounts of refeeding syndrome trace back to World War II, including among released prisoners of war [7]. In recent months, news reports have suggested that some of the released Israeli hostages were medically monitored in hospitals for, among other conditions, refeeding syndrome, given concerns and uncertainty regarding their access to food while in captivity [8].\nThese insights and practices suggest that the impacts of malnutrition in Gaza will not be easily or quickly undone with a focus on food aid alone. Based on the rising rates of acute malnutrition in Gaza, a high percentage of the population is likely at risk for immediate health consequences that food consumption cannot solve in the absence of the health systems needed to monitor and protect against complications. Between October 2023 and end of January 2024, 84% of health facilities in Gaza were destroyed or damaged, with the remaining facilities challenged by lack of electricity and water [9]. As of March 2024, there were four hospitals and two clinics remaining in Gaza Governorate and two hospitals and two clinics remaining in North Gaza, reported to be functioning at low levels [1].\nThe health sector needs in the context and aftermath of the protracted crisis in Gaza are tremendous. Recent projections suggest that in the absence of ceasefire, excess mortality between February and August 2024 will exceed 58,000; but even in a ceasefire scenario, excess mortality is projected to reach over 6,500 over this same period–from a combination of, for example, trauma related injuries, infectious disease, non-communicable diseases, and maternal and neonatal conditions, all of which are exacerbated by malnutrition [3]. It is clear that what remains of the health system in Gaza will be unable to cope with these rising disease burdens.\nThat there remain uncertainties regarding the incidence, monitoring, and treatment of the health consequences of mass malnutrition in conflict zones, including the risk of refeeding syndrome, suggests that more attention and knowledge sharing is needed on this subject. But in the immediate term, clinical evidence and protocols on malnutrition argue that the current crisis cannot be mitigated through ad hoc provisions of food aid [2, 5, 10]. Efforts to restore access to food must be met with immediate, coordinated, and commensurate attention on access to health services to both monitor and treat people with malnutrition, its health complications, and other causes of illness; but, of course, this will remain infeasible in the context of ongoing and escalating attacks, blockade, destruction of health infrastructure, and restricted and unprotected movement of health and humanitarian workers in Gaza.\nReferences\n- 1. Integrated Food Security Phase Classification. IPC Global Initiative—Special Brief [Internet]. 2924 Mar. Available from: https://www.ipcinfo.org/ipc-country-analysis/details-map/en/c/1156872/.\n- 2. Trehan I, Manary MJ. Management of complicated severe acute malnutrition in children in resource-limited settings. In: UpToDate [Internet]. 2024. Available from: https://www.uptodate.com/contents/management-of-complicated-severe-acute-malnutrition-in-children-in-resource-limited-settings?search=child%20malnutrition&source=search_result&selectedTitle=3%7E150&usage_type=default&display_rank=3.\n- 3.\nJamaluddine Z, Chen Z, Abukmail H, Aly S, Elnakib S, Barnsley G, et al. Crisis in Gaza: Scenario-based Health Impact Projections—Report One: 7th of February to 6th of August 2024 [Internet]. London, Baltimore: London School of Hygiene and Tropical Medicine; Johns Hopkins University; 2024 Feb. Report No.: 1. Available from: https://gaza-projections.org/gaza_projections_report.pdf.\n- 4. Ruggeri A. How starvation causes lasting damage to the body. Scientific American [Internet]. 2024 Mar 7; Available from: https://www.scientificamerican.com/article/how-starvation-causes-lasting-damage-to-the-body/.\n- 5. Mehler P. Anorexia nervosa in adults and adolescents: The refeeding syndrome. In: UpToDate [Internet]. Waltham, MA; 2023. Available from: https://www.uptodate.com/contents/anorexia-nervosa-in-adults-and-adolescents-the-refeeding-syndrome.\n- 6.\nManaging the Supply Chain of Specialized Nutritious Foods [Internet]. Rome: World Food Programme; 2019. Available from: https://docs.wfp.org/api/documents/WFP-0000110136/download/?_ga=2.219753561.136377393.1714496554-1491422343.1714151211.\n- 7. Dullaart R, Haymann J, Santing C. Refeeding syndrome in historical perspective: Its first description by Rodulfus Glaber (1033). Am J Biomed Sci Res. 2021 Jan 7;11(4).\n- 8. Ghert-Zand R. Kids released from Gaza being closely watched for renourishment issues. The Times of Israel [Internet]. 2023 Nov 28; Available from: https://www.timesofisrael.com/liveblog_entry/kids-released-from-gaza-being-closely-watched-for-renourishment-issues/.\n- 9.\nWorld Bank, the European Union, the United Nations. Gaza Strip Interim Damage Assessment: Summary Note (March 29, 2024) [Internet]. Washington DC: World Bank, EU, UN; 2024 Mar. Available from: https://thedocs.worldbank.org/en/doc/14e309cd34e04e40b90eb19afa7b5d15-0280012024/original/Gaza-Interim-Damage-Assessment-032924-Final.pdf.\n- 10. Al Jawaldeh A, Alshour Y, El Bilbeisi AH, Abuzerr S. The Silent Crisis: Effect of Malnutrition and Dehydration on Children in Gaza During the War. Front Nutr. 2024 Apr 3;11. pmid:38721032"
    },
    {
      "url": "https://reliefweb.int/report/occupied-palestinian-territory/killings-palestinians-seeking-food-gaza-continue-starvation-deepens-enar",
      "text": "Amman (31 July 2025) — Shooting and shelling of Palestinians by the Israeli military have continued along the routes of food convoys and in the vicinity of the Gaza Humanitarian Foundation (GHF) sites, despite the Israeli army’s announcement on 27 July that it would pause military actions in western areas from Gaza City to Al Mawasi during certain hours “to improve humanitarian responses”.\nBetween 30 and 31 July, 105 Palestinians were reportedly killed. At least 680 were injured along the convoy routes in the Zikim area, in North Gaza, and the Morage area in southern Khan Younis, as well as in the vicinity of the GHF sites in Middle Gaza and Rafah.\nIn total, since 27 May, at least 1,373 Palestinians have been killed while seeking food; 859 in the vicinity of the GHF sites and 514 along the routes of food convoys. Most of these killings were committed by the Israeli military. While we are aware of the presence of other armed elements in the same areas, we do not have information indicating their involvement in these killings.\nThese victims, the majority of whom appear to be young men and boys, are not just numbers. The UN Human Rights Office in the occupied Palestinian territory has no information that these Palestinians were directly participating in hostilities or posed any threat fo Israeli security forces or other individuals. Each person killed or injured had been desperately struggling for survival, not only for themselves, but also for their families and dependents. Meanwhile, increasing numbers of Palestinians are dying from malnutrition and starvation, including children, older people, people with disabilities and the sick or injured.\nThey offen have little or no support and cannot access the locations where extremely limited aid may be available.This humanitarian catastrophe is human-made. It is a direct result of policies imposed by Israel that have severely reduced the amount of life-saving assistance in the Gaza Strip.\nIntentionally directing attacks against civilians not taking direct part in hostilities and intentionally using starvation of civilians as a method of warfare by depriving them of objects indispensable to their survival, including wilfully impeding relief supplies, are war crimes. If part of a systematic or widespread attack on the civilian population, these may also constitute crimes against humanity. The cumulative impact of these incidents, humanitarian access restrictions and Israel’s military conduct in Gaza suggest that Israel is inflicting on Palestinians in the strip conditions of life increasingly incompatible with their continued existence as a group.\nEach of these killings must be promptly and independently investigated, and those responsible held to account. Urgent measures must be put in place to prevent recurrence.\nAs the occupying power, Israel must ensure the provision of all lifesaving assistance for Palestinians in Gaza and facilitate conditions that allow humanitarian agencies to move freely and safely to distribute aid.\nStates must use all available means to stop these violations of international law and fo fulfil their legal and moral obligations to avert further killings of civilians.\nENDS\nFor more information and media requests, please contact:\nohchr-opt-media@un.org\nTag and share\nTwitter @ OHCHR_ Palestine\nFacebook UN Human Rights Palestine"
    },
    {
      "url": "https://www.ipcinfo.org/fileadmin/user_upload/ipcinfo/docs/IPC_GazaStrip_Alert_July2025.pdf",
      "text": "%PDF-1.7 %���� 173 0 obj <> endobj xref 173 82 0000000016 00000 n 0000002536 00000 n 0000002667 00000 n 0000004297 00000 n 0000004688 00000 n 0000005425 00000 n 0000006178 00000 n 0000007082 00000 n 0000007455 00000 n 0000007567 00000 n 0000007681 00000 n 0000007728 00000 n 0000007765 00000 n 0000009385 00000 n 0000010980 00000 n 0000011442 00000 n 0000011975 00000 n 0000012395 00000 n 0000012881 00000 n 0000012966 00000 n 0000013054 00000 n 0000013518 00000 n 0000014064 00000 n 0000015779 00000 n 0000017541 00000 n 0000018027 00000 n 0000018622 00000 n 0000018847 00000 n 0000019240 00000 n 0000019420 00000 n 0000019907 00000 n 0000019992 00000 n 0000020350 00000 n 0000021899 00000 n 0000023406 00000 n 0000023732 00000 n 0000024072 00000 n 0000025643 00000 n 0000027274 00000 n 0000028797 00000 n 0000036382 00000 n 0000040994 00000 n 0000045152 00000 n 0000050229 00000 n 0000052878 00000 n 0000055694 00000 n 0000056035 00000 n 0000056125 00000 n 0000056627 00000 n 0000056930 00000 n 0000057116 00000 n 0000058898 00000 n 0000059218 00000 n 0000059601 00000 n 0000061418 00000 n 0000061759 00000 n 0000062152 00000 n 0000063607 00000 n 0000063919 00000 n 0000064291 00000 n 0000064635 00000 n 0000064941 00000 n 0000065280 00000 n 0000065592 00000 n 0000066003 00000 n 0000066411 00000 n 0000066755 00000 n 0000067060 00000 n 0000067363 00000 n 0000067548 00000 n 0000099806 00000 n 0000099845 00000 n 0000106232 00000 n 0000107155 00000 n 0001076928 00000 n 0001077849 00000 n 0001943870 00000 n 0001944696 00000 n 0001945522 00000 n 0001951731 00000 n 0001953436 00000 n 0000001936 00000 n trailer <<6AF2DDF1616B48A0B2A80CC3D9B3B815>]/Prev 4740937>> startxref 0 %%EOF 254 0 obj <>stream h�b``g`�f`g`��de@ Q6�(G�ʄǫ�ܘ������`�-B���O����x�����;�\\���SB�=�-�[�5�n���;��N5oi�q���|����䢣�fX�3m隴&j�S��K;���R��)��Cj��-��rmժ��[��D�:��-�d��������[F�����ށ AA pA�Ӏ�I�O���ܫ���?'�ի2�0$O`Lb�>�t��̀1��e�/��d�61� ��?0d`f`0f�����!��^&=��)e�X�1 0�3�?`�b�y [�(�A@�њ�˄a�F� Ƌ�2� 0J3�.`�� � 4%b�0��Fc��z��e� �F.N�ڻ ����p0���`0`el<�������� {A�"
    },
    {
      "url": "https://medicalguidelines.msf.org/en/viewport/CG/english/severe-acute-malnutrition-16689141.html",
      "text": "Last updated: February 2024\nSevere acute malnutrition (SAM) results from insufficient energy (kilocalories), fat, protein and/or other nutrients (vitamins and minerals, etc.) to cover individual needs.\nSAM is frequently associated with medical complications due to metabolic disturbances and compromised immunity. It is a major cause of morbidity and mortality in children globally.\nThe protocols below are focused on the diagnosis and management of SAM in children 6 to 59 months only. For further details regarding this age group, and guidance for other age groups, refer to national recommendations and/or specialised protocols.\nClinical assessment\nCharacteristic physical signs\n- In marasmus: skeletal appearance resulting from significant loss of muscle mass and subcutaneous fat.\n- In kwashiorkor:\n- Bilateral oedema of the lower limbs sometimes extending to other parts of the body (e.g. arms and hands, face).\n- Discoloured, brittle hair; shiny skin which may crack, weep, and become infected.\nDiagnostic and admission criteria\nDiagnostic criteria for SAM are both anthropometric and clinical:\n- Mid-upper arm circumference (MUAC) aCitation a.MUAC is measured at the mid-point of the left upper arm. The arm should be relaxed. The measuring tape should be in contact with the skin all around the arm, without exerting pressure. measures the degree of muscle wasting. MUAC < 115 mm indicates SAM and significant mortality risk.\n- Weight-for-height z-score (WHZ) indicates the degree of weight loss by comparing the weight of the child with the median weight of non-malnourished children of the same height and sex. SAM is defined as WHZ < –3 with reference to the WHO Child Growth Standards\nbCitation b.For WHZ, see WHO simplified field tables in z-scores for girls and for boys:\nhttps://www.who.int/tools/child-growth-standards/standards/weight-for-length-height . - The presence of bilateral pitting oedema of the lower limbs (when other causes of oedema have been ruled out) indicates SAM, regardless of MUAC and WHZ.\nAdmission criteria for SAM treatment programmes vary with context. Refer to national recommendations.\nMedical complications\n- Children with any of the following severe medical conditions should receive hospital-based medical management:\n- Pitting oedema extending from the lower limbs up to the face;\n- Anorexia (observed during appetite test);\n- Other severe complications: persistent vomiting, shock, altered mental status, seizures, severe anaemia (clinically suspected or confirmed), persistent hypoglycaemia, eye lesions due to vitamin A deficiency, frequent or abundant diarrhoea, dysentery, dehydration, severe malaria, pneumonia, meningitis, sepsis, severe cutaneous infection, fever of unknown origin, etc.\n- In the absence of these conditions, children should be treated as outpatients with regular follow-up.\nNutritional treatment\n- All children with SAM should receive nutritional treatment.\n- Nutritional treatment is based on the use of specialised nutritious foods enriched with vitamins and minerals: F-75 and F-100 therapeutic milks, and ready-to-use therapeutic food (RUTF).\n- Nutritional treatment is organised into phases:\n- Phase 1 (inpatient) intends to restore metabolic functions and treat or stabilize medical complications. Children receive F-75 therapeutic milk. This phase may last 1 to 7 days, after which children usually enter transition phase. Children with medical complications generally begin with phase 1.\n- Transition phase (inpatient) intends to ensure tolerance of increased food intake and continued improvement of clinical condition. Children receive F-100 therapeutic milk and/or RUTF. This phase usually lasts 1 to 3 days, after which children enter phase 2.\n- Phase 2 (outpatient or inpatient) intends to promote rapid weight gain and catch-up growth. Children receive RUTF. This phase usually lasts 1 to 3 days when inpatient, after which children are discharged for outpatient care. Children without medical complications enter directly into this phase as outpatients. The outpatient component usually lasts several weeks.\n- Breastfeeding should be continued in breastfed children.\n- Drinking water should be given in addition to meals, especially if the ambient temperature is high, or the child has a fever or is receiving RUTF.\nRoutine medical management\nThe following should be provided to all inpatients and outpatients with SAM:\n| Antibiotic treatment |\nFrom D1, unless specific signs of infection are present: amoxicillin PO: 50 mg/kg (max. 1 g) 2 times daily for 5 to 7 days |\n| Malaria |\nOn D1, rapid diagnostic test in endemic areas and treatment for malaria according to results or if testing is not available (see Malaria, Chapter 6). |\n|\nIntestinal parasites |\nIn transition phase or upon outpatient admission, albendazole PO: Children 12 to 23 months: 200 mg single dose |\n| Vaccination |\nChildren vaccinated between 6 and 8 months should be re-vaccinated as above (i.e. with 2 doses) once they reach 9 months of age, provided that an interval of 4 weeks from the first dose is respected.\n|\n| Tuberculosis (TB) |\nAt D1 then regularly during treatment, screen for TB. For a child screening positive, perform complete diagnostic evaluation. For more information, refer to the guide Tuberculosis, MSF. |\n|\nHIV infection |\nPerform HIV counselling and testing (unless the mother explicitly declines testing).\n|\nManagement of complications\nInfections\n- Respiratory, cutaneous and urinary infections are common. However, classic signs of infection, such as fever, may be absent\n[1]Citation 1.Jones KDJ, Berkley JA. Severe acute malnutrition and infection. Paediatrics and International Child Health 2014; 34(sup1): S1-S29.\nhttps://www.tandfonline.com/doi/full/10.1179/2046904714Z.000000000218 [Accessed 24 August 2022] . - Severe infection or sepsis should be suspected in children that are lethargic or apathetic or suffering from an acute complication such as hypothermia, hypoglycaemia, seizures, difficulty breathing, or shock. Immediately administer ampicillin IV 50 mg/kg every 8 hours + gentamicin IV 7.5 mg/kg once daily. Continue this treatment unless the source of infection is identified and different antibiotic treatment is required.\n- If circulatory impairment or shock, immediately administer ceftriaxone IV, one dose of 80 mg/kg, then assess the source of infection to determine further antibiotic treatment. See also Shock, Chapter 1. Transfuse urgently as for severe anaemia (see below) if haemoglobin (Hb) is < 6 g/dl.\n- In less severe infections, assess the source of infection (see Fever, Chapter 1) and treat accordingly.\n- If fever is present and causes discomfort, undress the child. If insufficient, administer paracetamol PO in low dose: 10 mg/kg, up to 3 times maximum per 24 hours. Encourage oral fluids (including breast milk).\n- If hypothermia is present, place the child skin-to-skin against the mother's body and cover with a warm blanket. Treat for infection as above. Check blood glucose level and treat for hypoglycaemia if necessary (see Hypoglycaemia, Chapter 1).\n- In children with kwashiorkor, infection of cutaneous lesions is common and may progress to soft tissue or systemic infection. If cutaneous infection is present, stop amoxicillin and start amoxicillin/clavulanic acid PO. Use formulations in a ratio of 8:1 or 7:1. The dose is expressed in amoxicillin: 50 mg/kg 2 times daily for 7 days.\nSevere anaemia\n- Children with Hb < 4 or < 6 with signs of decompensation (such as respiratory distress) or ongoing blood loss require transfusion within the first 24 hours. See Anaemia (Chapter 1) for volume to be transfused and patient monitoring during and after transfusion.\n- Preferably use packed red blood cells (PRBC), if available. Monitor closely for signs of fluid overload (see box below).\nDiarrhoea and dehydration\n- Diarrhoea is common. Therapeutic foods facilitate the recovery of physiological function of the gastrointestinal tract. Amoxicillin administered as part of routine treatment reduces intestinal bacterial overgrowth. Diarrhoea generally resolves without additional treatment. If an aetiological treatment is necessary, see Acute diarrhoea, Chapter 3.\n- Zinc supplementation is not needed if children consume recommended amounts of therapeutic foods.\n- The diagnosis of dehydration is based on history and clinical features.\n- Clinical assessment is difficult in children with SAM as delayed skin pinch test and sunken eyes are often present even in the absence of dehydration.\n- For classification of degree of dehydration adapted for children with SAM, see table below:\nClinical features\n(2 or more of the following signs)\nNo\ndehydration\nSome\ndehydration\nSevere\ndehydration\nMental status\nNormal\nRestless, irritability\nLethargic or unconscious\nThirst\nNo thirst, drinks normally\nThirsty, drinks eagerly\nUnable to drink or drinks poorly\nUrine output\nNormal\nReduced\nAbsent for\nseveral hours\nRecent frequent watery diarrhoea and/or vomiting\nYes\nYes\nYes\nRecent obvious rapid weight loss\nNo\nYes\nYes\nAcute diarrhoea with no dehydration (Plan A SAM)\n- Stools are neither frequent nor abundant (outpatient): oral rehydration solution (ORS) PO: 5 ml/kg after each loose stool to prevent dehydration.\n- Stools are frequent and/or abundant (inpatient): ReSoMal cCitation c.ReSoMal is a specific oral rehydration solution for malnourished children, containing less sodium and more potassium than standard ORS. It should be administered under medical supervision to avoid overdosing and hyponatremia. PO or by nasogastric tube (NGT): 5 ml/kg after each loose stool to prevent dehydration.\n- In all cases, continue feeding and breastfeeding, encourage oral fluids.\nAcute diarrhoea with some dehydration (Plan B SAM)\n-\nDetermine the target weight (weight before the onset of diarrhoea) before starting rehydration. If not feasible (e.g. new admission), estimate target weight as current weight x 1.06.\n- ReSoMal cCitation c.ReSoMal is a specific oral rehydration solution for malnourished children, containing less sodium and more potassium than standard ORS. It should be administered under medical supervision to avoid overdosing and hyponatremia. PO or by NGT: 20 ml/kg/hour for 2 hours. In addition, administer 5 ml/kg of ReSoMal after each loose stool if tolerated.\n- Assess after 2 hours (clinical evaluation and weight):\n- If improvement (diarrhoea and signs of dehydration regress):\n- Reduce ReSoMal to 10 ml/kg/hour until the signs of dehydration and/or weight loss (known or estimated) have been corrected.\n- Assess every 2 hours.\n- Once there are no signs of dehydration and/or the target weight is reached, change to Plan A SAM to prevent dehydration.\n- If no improvement after 2 to 4 hours or if oral rehydration cannot compensate for losses: change to Plan C SAM \"with circulatory impairment\".\n- If improvement (diarrhoea and signs of dehydration regress):\n- Continue feeding including breastfeeding.\n- Monitor for signs of fluid overload (see box below). Regardless of the target weight, stop rehydration if signs of fluid overload appear.\nAcute diarrhoea with severe dehydration (Plan C SAM)\n- In all patients:\n- Assess for circulatory impairment (see Shock, Chapter 1).\n- Estimate target weight as current weight x 1.1.\n- Measure blood glucose level and treat hypoglycaemia (Chapter 1) if necessary.\n- Monitor vital signs and signs of dehydration every 15 to 30 minutes.\n- Monitor urine output.\n- Monitor for signs of fluid overload (see box below).\n- If there is no circulatory impairment:\n- ReSoMal PO or by NGT: 20 ml/kg over 1 hour\n- If the child is alert, continue feeding including breastfeeding.\n- Assess after 1 hour:\n- If improvement: change to Plan B SAM, but keep the same target weight.\n- If rehydration PO/NGT not tolerated (e. g. vomiting):\n- Stop ReSoMal. Administer glucose 5%-Ringer lactate (G5%-RL) dCitation d.Remove 50 ml of Ringer lactate (RL) from a 500 ml RL bottle or bag, then add 50 ml of 50% glucose to the remaining 450 ml of RL to obtain 500 ml of 5% glucose-RL solution. IV infusion: 10 ml/kg/hour for 2 hours.\n- Assess after 2 hours of IV fluids:\n- If improvement and/or not vomiting, stop G5%-RL IV infusion and change to Plan B SAM.\n- If no improvement or still vomiting, continue G5%-RL IV infusion: 10 ml/kg/hour for 2 hours.\n- If deterioration with circulatory impairment: see below.\n- If there is circulatory impairment:\n- Administer ceftriaxone IV, one dose of 80 mg/kg. Subsequent antibiotic treatment depends on assessment of underlying cause.\n- Administer G5%-RL IV infusion: 10 ml/kg/hour for 2 hours. Stop ReSoMal if the child was taking it.\n- Assess after 1 hour of IV fluids:\n- If improvement and no vomiting: stop IV fluid and change to Plan B SAM, but keep the same target weight.\n- If no improvement:\n- Continue G5%-RL IV infusion: 10 ml/kg/hour.\n- Prepare for blood transfusion.\n- Assess after 2 hours of IV fluids:\n- If improvement: change to Plan B SAM, but keep the same target weight.\n- If no improvement or deterioration:\n- Check Hb as baseline and administer blood transfusion using a separate IV line. See Anaemia (Chapter 1) for volume to be transfused and patient monitoring during and after transfusion.\n- While transfusing, continue G5%-RL IV infusion 10 ml/kg/hour for another 2 hours.\nSigns of fluid overload include:\n- RR ≥ 10 breaths/minute compared to initial RR, or\n- HR ≥ 20 beats/minute compared to initial HR\nPlus any one of the following:\n- New or worsening hypoxia (decrease in SpO2 by > 5%)\n- New onset of rales and/or fine crackles in lung fields\n- New galloping heart rhythm\n- Increased liver size (must have marked liver border with pen before rehydration)\n- New peripheral or eyelid oedema\nOther complications\nFor other complications (to be treated as inpatient), see:\n- Hypoglycaemia, seizures, Chapter 1.\n- Acute pneumonia, Chapter 2.\n- Stomatitis, Chapter 3.\n- Xerophthalmia (vitamin A deficiency), Chapter 5.\nDischarge criteria\nIn general:\n- Children can be discharged from hospital and be treated as outpatients if the following criteria are met:\n- clinically well;\n- medical complications controlled;\n- able to eat RUTF (observed during appetite test);\n- reduction or absence of oedema;\n- caregiver feels able to provide care as outpatient;\n- vaccinations up to date or referral to vaccination service organised.\n- Children can be discharged from nutritional treatment if the following criteria are met:\n-\nco-existing medical conditions stable and outpatient treatment organised if necessary (e.g. dressing changes, follow-up for chronic diseases);\n- vaccinations up to date or referral to vaccination service organised;\n- absence of oedema and WHZ > –2 or MUAC > 125 mm for at least 2 weeks.\n-\nDischarge criteria vary with context. Refer to national recommendations.\n- (a)MUAC is measured at the mid-point of the left upper arm. The arm should be relaxed. The measuring tape should be in contact with the skin all around the arm, without exerting pressure.\n- (b)For WHZ, see WHO simplified field tables in z-scores for girls and for boys:\nhttps://www.who.int/tools/child-growth-standards/standards/weight-for-length-height - (c)ReSoMal is a specific oral rehydration solution for malnourished children, containing less sodium and more potassium than standard ORS. It should be administered under medical supervision to avoid overdosing and hyponatremia.\n- (d)Remove 50 ml of Ringer lactate (RL) from a 500 ml RL bottle or bag, then add 50 ml of 50% glucose to the remaining 450 ml of RL to obtain 500 ml of 5% glucose-RL solution.\n- 1.Jones KDJ, Berkley JA. Severe acute malnutrition and infection. Paediatrics and International Child Health 2014; 34(sup1): S1-S29.\nhttps://www.tandfonline.com/doi/full/10.1179/2046904714Z.000000000218 [Accessed 24 August 2022]"
    }
  ],
  "argos_summary": "A famine is currently unfolding in Gaza, with nearly 200 starvation-related deaths reported, although experts believe this number is an undercount. The situation is exacerbated by a lack of access to nutritious food and healthcare, particularly for malnourished children who are at risk of severe complications like refeeding syndrome when food aid is introduced. Humanitarian organizations warn that without coordinated access to both food and medical services, the health crisis will worsen, leading to high mortality rates and long-term health consequences.",
  "argos_id": "IW7YO73FZ"
}