{
  "url": "https://www.washingtonpost.com/sports/mlb/2025/08/08/angels-tigers-score/0a4f2524-74c4-11f0-84e0-485bb531abeb_story.html",
  "authorsByline": "Dave Hogg | AP",
  "articleId": "9a3be64fb4f64a4580d0a71f367f77c5",
  "source": {
    "domain": "washingtonpost.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BA6NBCDUYQI7BBHAJBN3KMNL5M.jpg&w=1440",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-09T01:56:18+00:00",
  "addDate": "2025-08-09T02:02:01.715021+00:00",
  "refreshDate": "2025-08-09T02:02:01.715023+00:00",
  "score": 1.0,
  "title": "Vierling's first homer of the season leads Tigers to 6-5 comeback win over Angels",
  "description": "Matt Vierling’s three-run homer in the eighth inning led the Detroit Tigers to a 6-5 win over the Los Angeles Angels on Friday night",
  "content": "DETROIT — Matt Vierling hit a three-run homer in the eighth inning and the Detroit Tigers beat the Los Angeles Angels 6-5 on Friday night. With the Angels leading 5-3, reliever Reid Detmers (3-3) walked pinch-hitter Jahmai Jones and Gleyber Torres to start the inning. Vierling batted for Kerry Carpenter and hit his first homer of the season over the Detroit bullpen in left.\n\nThe Tigers avoided their third straight loss on a night when Tarik Skubal gave up back-to-back homers for the first time this season.\n\nWith one out in the fifth inning and the Tigers leading 3-1, Gustavo Campero hit a two-run homer to left. Two pitches later, Los Angeles took the lead on Zach Neto’s second homer against Skubal this season.\n\nSkubal struck out Nolan Schanuel, but Mike Trout ended Skubal’s shortest start of the season with an infield single.\n\nTroy Melton (2-1) picked up the win with 2 1/3 innings of relief. New Tigers closer Kyle Finnegan pitched the ninth for his 23rd save.\n\nLogan O’Hoppe gave the Angels a 1-0 lead with an RBI double in the second, but Detroit scored three times in the bottom of the inning.\n\nSpencer Torkelson led off with his 25th homer, Riley Greene singled and took third on Zach McKinstry’s double. Javier Báez followed with a two-run bloop single to left.\n\nThe game was delayed briefly in the third inning when Angels centerfielder Bryce Teodosio stumbled catching a fly ball and hit his head on the fence. He stayed in the game but was replaced by Campero for the fourth inning.\n\nWith one out and a runner on first in the seventh, Neto hit a 106.7-mph line drive to left, but Greene made a diving catch to help Troy Melton escape the inning.\n\nSkubal hadn’t allowed back-to-back homers since Salvador Perez and Jorge Soler did it in the first inning of a 6-1 win for the Kansas City Royals on July 25, 2021.\n\nThe teams face each other again on Saturday evening, with Detroit RHP Charlie Morton (7-9, 5.20) making his second Tigers start against LHP Yusei Kikuchi (5-7, 3.22).",
  "medium": "Article",
  "links": [
    "https://apnews.com/hub/MLB"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "New Tigers closer Kyle Finnegan",
      "weight": 0.081861526
    },
    {
      "name": "New Tigers",
      "weight": 0.079107076
    },
    {
      "name": "Tigers",
      "weight": 0.07810811
    },
    {
      "name": "Angels centerfielder Bryce Teodosio",
      "weight": 0.076185964
    },
    {
      "name": "Detroit RHP Charlie Morton",
      "weight": 0.075306386
    },
    {
      "name": "Tarik Skubal",
      "weight": 0.070796065
    },
    {
      "name": "Angels",
      "weight": 0.06843676
    },
    {
      "name": "Detroit",
      "weight": 0.06796789
    },
    {
      "name": "first",
      "weight": 0.06621363
    },
    {
      "name": "Skubal",
      "weight": 0.065606445
    }
  ],
  "topics": [
    {
      "name": "MLB"
    },
    {
      "name": "Baseball"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.984375
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.94970703125
    }
  ],
  "sentiment": {
    "positive": 0.21728516,
    "negative": 0.34814453,
    "neutral": 0.4345703
  },
  "summary": "The Detroit Tigers beat the Los Angeles Angels 6-5 in a game that ended in a victory. Matt Vierling's three-run homer in the eighth inning led the Tigers to avoid their third consecutive loss. The Angels were leading 5-3, but Vierled's homer led to a comeback, scoring three runs. The Tigers' Tarik Skubal gave up back-to-back homers for the first time this season, allowing Troy Melton to secure the win with 2 1/3 innings of relief. The game was briefly delayed when Angels centerfielder Bryce Teodosio hit his head on the fence during the third inning. The teams will face each other again on Saturday evening.",
  "shortSummary": "Matt Vierling's three-run homer led the Detroit Tigers to a 6-5 comeback win over the Los Angeles Angels, despite two back-to-back homers.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "0b200412dd55498cbe62d257895795d2",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Matt Vierling's three-run homer in the eighth inning led the Detroit Tigers to a 6-5 victory over the Los Angeles Angels. The Tigers overcame a 5-3 deficit, with Tarik Skubal struggling on the mound, allowing back-to-back homers for the first time this season. Troy Melton earned the win in relief, and Kyle Finnegan secured his 23rd save, as the teams prepare for a rematch on Saturday.",
  "argos_id": "J0HNOLW5H"
}