{
  "url": "https://www.howtogeek.com/how-the-modern-web-became-so-broken/",
  "authorsByline": "Sydney Butler",
  "articleId": "802eb36887344cb3ab3f8bb5b238e91f",
  "source": {
    "domain": "howtogeek.com",
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McNair",
      "coordinates": {
        "lat": 38.9695316,
        "lon": -77.3859479
      }
    }
  },
  "imageUrl": "https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/04/top-down-view-of-a-person-using-a-laptop-with-app-icons-around-and-a-website-icon-in-the-background.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T22:00:23+00:00",
  "addDate": "2025-08-08T22:04:58.923253+00:00",
  "refreshDate": "2025-08-08T22:04:58.923255+00:00",
  "score": 1.0,
  "title": "How the Modern Web Became So Broken",
  "description": "From cookie consent nightmares to the rise of paywalls, the modern web is a far cry from its humble beginnings.",
  "content": "I still remember my first time connecting to the internet in the late 90s. It felt very weird that I could just connect to some distant computer and call up any information in seconds. Up to that point, I'd just used the public and school libraries, like everyone else.\n\nFor years after that, the web always felt like a raw, but extremely powerful, place to be. But, just like the relatively short existence of the real Wild West, the early glory days of the Web and all its possibilities would soon be sanded down to what we have today. In some ways, that's better, but from my point of view, the web is broken in some fundamental ways.\n\nI realize that, as someone who writes words on the internet for a living, bringing up advertising as a modern bane of the internet can come across as somewhat hypocritical. However, most reasonable adults understand that it costs money to set up a publication like the one you're reading right now, and offering 100s of articles every month likewise isn't free.\n\nMany websites have experimented with small subscription fees, or charging per-article, but audiences seem, on average, pretty against the idea of paying for content directly. Just look at how people seem to avoid YouTube Premium on principle, despite the massive improvement in user experience. That leaves us with advertising as the main way to keep the content you love to read flowing.\n\nIt's not just content you read or watch. There are sites that offer useful web apps, or host free software for you to download. They face exactly the same issue of offering something for \"free\" but still having massive bills to pay.\n\nThe problem isn't that advertising exists. After all, this was true on TV and in magazines long before the Web existed. No, the issue is the insane arms race that's driving advertising online to unbearable levels.\n\nMost website hosts honestly try to strike the best balance between reader experience and the advertising that keeps the lights on, but on the web as a whole, publishers and other web content providers are locked in an arms race to wring every cent out of your visit—popups, sticky ads, full-screen interstitials, video players that autoplay at max volume, and trackers that follow you across the web are just a few examples of the methods that have developed over the years. Funnily enough, a lot of this advertising wouldn't be possible without broadband, which means you're paying for faster internet so that you can experience more intrusive ads on the web.\n\nThe irony of this is that as more people use technologies to circumvent advertising, it puts more financial pressure on the sites in question, which forces them to increase the advertising push. No one wins in this situation!\n\nIn theory, GDPR is meant to give EU citizens more control over their own private data. Even if you live outside the EU, you still \"benefit\" from GDPR since most websites just implement a single privacy policy that covers all bases, if at all possible.\n\nUnfortunately, in practice, GDPR-compliant sites now just have several extra layers of friction with all the cookie-consent popups and legal agreements you have to read on practically every website every time you visit it. It seems only sites where you log in don't have to ask more than once.\n\nIn the end, most of these cookie popups are designed to nudge you into \"accepting all\" rather than actually making informed choices. Opting out often involves navigating multistep interfaces that feel intentionally confusing and designed using dark patterns to waste your time.\n\nThe Rise of Paywalls, Softwalls, and “Sign In to Read”\n\nYou’ve clicked a promising headline, only to be greeted with a demand: Sign in to continue. Or worse, Subscribe for $1 a week, just to read a single article. Again, we all understand why this ends up being necessary, but there's no denying that this has made the web a worse place to be. I don't mind subscribing to a few places I visit daily, but having to face a paywall every time someone posts a link on social media is quite vexing.\n\n\"Soft\" walls that take a few seconds of your time but don't actually block access aren't too bad, but the hard type of content block is never pleasant.\n\nComplex, Bloated Sites That Break or Take Forever to Load\n\nI don't want to go back to the simple static HTML sites of the 90s, or anything like that. However, a lot of modern websites are over-complicated, bloated messes filled with web technologies they don't need to get the job done. The Wikipedia home page is about as simple as web design gets these days, but according to my browser it takes up 173MB of memory. X, formerly Twitter, is eating twice that!\n\nDo sites like these really need to take up that much resources on your computer? Even with just a few tabs open, your browser is usually the biggest resource hog on your computer, and that doesn't seem right to me.\n\nMobile-First Broke Desktop (and Sometimes Mobile Too)\n\nAs someone who still does most of their web browsing on a desktop system, I'm probably in a shrinking minority, but it still bothers me that a mobile-first approach to web design has left us with desktop websites that are basically just stretched out versions of the smartphone page. Some sites do it better than others, but it's almost pointless to have a large, high-res screen in some cases.\n\nFunnily enough, even the mobile versions of many sites are just awful to experience. Too cramped, fonts too large for modern high-res phone screens, and it's all so samey because it has to be squeezed into a narrow vertical tube. I actually still find myself browsing the web in landscape mode on my phone just to get a little room to breathe.\n\nHow SEO and AI Are Ruining Search\n\nAs I write this, SEO or Search Engine Optimization is dying a quick death, which sounds like good news at first glance. SEO is the reason you've had to read so many keyword-stuffed articles and dull, formulaic articles over the years. All thanks to the advice of SEO consultants who think they've figured out \"the algorithm\" and doing a very specific list of things will ensure your website appears on sites like Google and Bing in the search results.\n\nThe truth is that SEO, more often than not, amounted to little more than pigeon superstition and led to an obvious decline in the quality of website content. Today, thanks to the rise of AI in search, I think SEO is becoming pretty much irrelevant, and human-made content like the words you're reading right now is becoming less formulaic, if for no other reason than setting itself apart from chatbot writing.\n\nSEO obsession hurt the web for sure, but now we're facing a bigger issue—AI in search. It's not just that services like ChatGPT will search the web for you and present the information to you, it's that search engines like Google itself are doing the same thing. Its AI search summaries read content created by folks like me, and then serve it to people on the Google site without ever generating a website visit to the original content creator.\n\nThat may be convenient for people doing internet searches, but this is very much the snake eating its own tail. If search engines don't direct people to websites, those websites have to shut down eventually. If there are no websites generating original content, then the AI search bots have nothing to summarize!\n\nThat's before we get into the issue of AI hallucinations and how these summaries are flat-out wrong, often enough, that they effectively can't be trusted, and should never have been rolled out for public use.\n\n“Open in App” and the Death of the Open Web\n\nThe web, and the internet as a whole, has slowly consolidated into massive islands, where single companies have massive amounts of control. For a lot of people, services like Facebook, Instagram, and X are almost their entire online experience. Online platform holders are strongly incentivized to lure you into these walled gardens and keep you there, and having your own mobile app is a key part of getting your claws into users and their data.\n\nWhich is why, to my great annoyance, every time I click on a Reddit, Pinterest, or some other similar site link I'm hit with a prompt to take me away from my browser and to an app. Come to think of it, this might be a key factor why I prefer to browse the web using a desktop browser, because that doesn't happen on a device that has no mobile apps.\n\nCan the Web Be Fixed, or Is This Just What It Is Now?\n\nIt's easy to romanticize the early days of the web and how free and wild it felt, but the fact is that times have changed. Back then, websites were an afterthought for businesses that were a marketing expense, not a source of revenue. Websites meant to entertain or inform you were usually run by regular people, and the \"server\" might have been nothing more than an old desktop PC hooked up to a phone line.\n\nWhile the web was exciting, it didn't yet make the world go round. If the internet went out, it didn't affect much, but today it's bedrock infrastructure and if the internet went dark for just a day or two, it would mean global chaos.\n\nOffering content directly to your web browser is expensive, complex, and happens in a world of strict regulation and heavy competition. So, in short, there's no going back to the \"good\" old days. The Wild West of the Web is history, even if some of us dream of saddling up and riding into the sunset like we used to. However, I sincerely hope that the web of today can transform into something more sustainable, because whether it's due to a dead internet or simply an economic collapse in its business mode, the web of today isn't sustainable.",
  "medium": "Article",
  "links": [
    "https://www.shutterstock.com/image-photo/user-use-laptop-computer-download-update-2385095469",
    "https://www.shutterstock.com/image-vector/gdpr-general-data-protection-regulation-eu-746456278",
    "https://www.howtogeek.com/what-is-the-dead-internet-theory/",
    "https://www.howtogeek.com/353717/what-is-gdpr-and-what-does-it-mean-for-you/",
    "https://www.shutterstock.com/image-photo/businessman-working-laptop-office-popup-blocker-412993870]",
    "https://www.howtogeek.com/363484/dark-patterns-when-companies-use-design-to-manipulate-you/",
    "https://www.all-about-psychology.com/superstition-in-the-pigeon.html",
    "https://www.howtogeek.com/youtube-is-in-an-arms-race-with-ad-blockers-and-ad-blockers-might-lose/",
    "https://www.howtogeek.com/youtube-is-the-most-valuable-streaming-servicesso-why-dont-people-want-to-pay-for-it/",
    "https://www.howtogeek.com/i-hate-paywalls-too-but-its-the-only-way-for-a-quality-web-experience/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other web content providers",
      "weight": 0.08087842
    },
    {
      "name": "web technologies",
      "weight": 0.07865618
    },
    {
      "name": "web design",
      "weight": 0.07861399
    },
    {
      "name": "useful web apps",
      "weight": 0.07676905
    },
    {
      "name": "website content",
      "weight": 0.07322831
    },
    {
      "name": "desktop websites",
      "weight": 0.066068456
    },
    {
      "name": "modern websites",
      "weight": 0.06369697
    },
    {
      "name": "most websites",
      "weight": 0.06315756
    },
    {
      "name": "internet searches",
      "weight": 0.06296542
    },
    {
      "name": "Many websites",
      "weight": 0.061623797
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [],
  "sentiment": {
    "positive": 0.07556152,
    "negative": 0.6074219,
    "neutral": 0.3173828
  },
  "summary": "The article discusses the breakdown of the modern web, with the author suggesting that it is broken in fundamental ways. The author points out that advertising is the main way to keep content flowing, despite sites offering useful web apps or hosting free software for download. Publishers and content providers are locked in an arms race to capture every cent out of your visit through advertising methods such as popups, sticky ads, full-screen interstitials, video players that autoplay at max volume, and trackers that follow you across the web. The article also discusses the rise of Paywalls, Softwalls and “Sign In to Read”, which demand payment or subscription fees. However, in practice, these sites now face multiple layers of friction due to the cookie-consent popups and legal agreements read on nearly every website. Despite this, the author acknowledges that the complexity of web design and the need to make informed choices.",
  "shortSummary": "The modern web is broken by pervasive advertising and pervasive user confusion, driven by aggressive advertising and persistent content competition, despite advancements in user experience and privacy protections.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1872ce6a1b9b4b42b44df4d203086c3b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.all-about-psychology.com/superstition-in-the-pigeon.html",
      "text": "This learning theory classic by B.F. Skinner demonstrates how accidental connections between a ritual and favorable consequences can establish and maintain superstitious behavior.\nTo say that a reinforcement is contingent upon a response may mean nothing more than that it follows the response. It may follow because of some mechanical connection or because of the mediation of another organism; but conditioning takes place presumably because of the temporal relation only, expressed in terms of the order and proximity of response and reinforcement. Whenever we present a state of affairs which is known to be reinforcing at a given drive, we must suppose that conditioning takes place, even though we have paid no attention to the behavior of the organism in making the presentation. A simple experiment demonstrates this to be the case.\nA pigeon is brought to a stable state of hunger by reducing it to 75 percent of its weight when well fed. It is put into an experimental cage for a few minutes each day. A food hopper attached to the cage may be swung into place so that the pigeon can eat from it. A solenoid and a timing relay hold the hopper in place for five sec. at each reinforcement.\nIf a clock is now arranged to present the food hopper at regular intervals with no reference whatsoever to the bird's behavior, operant conditioning usually takes place. In six out of eight cases the resulting responses were so clearly defined that two observers could agree perfectly in counting instances. One bird was conditioned to turn counter-clockwise about the cage, making two or three turns between reinforcements. Another repeatedly thrust its head into one of the upper corners of the cage. A third developed a 'tossing' response, as if placing its head beneath an invisible bar and lifting it repeatedly. Two birds developed a pendulum motion of the head and body, in which the head was extended forward and swung from right to left with a sharp movement followed by a somewhat slower return. The body generally followed the movement and a few steps might be taken when it was extensive. Another bird was conditioned to make incomplete pecking or brushing movements directed toward but not touching the floor. None of these responses appeared in any noticeable strength during adaptation to the cage or until the food hopper was periodically presented. In the remaining two cases, conditioned responses were not clearly marked.\nThe conditioning process is usually obvious. The bird happens to be executing some response as the hopper appears; as a result it tends to repeat this response. If the interval before the next presentation is not so great that extinction takes place, a second 'contingency' is probable. This strengthens the response still further and subsequent reinforcement becomes more probable. It is true that some responses go unreinforced and some reinforcements appear when the response has not just been made, but the net result is the development of a considerable state of strength.\nWith the exception of the counter-clockwise turn, each response was almost always repeated in the same part of the cage, and it generally involved an orientation toward some feature of the cage. The effect of the reinforcement was to condition the bird to respond to some aspect of the environment rather than merely to execute a series of movements. All responses came to be repeated rapidly between reinforcements - typically five or six times in 15 sec.\nThe effect appears to depend upon the rate of reinforcement. In general, we should expect that the shorter the intervening interval, the speedier and more marked the conditioning. One reason is that the pigeon's behavior becomes more diverse as time passes after reinforcement. A hundred photographs, each taken two sec. after withdrawal of the hopper, would show fairly uniform behavior. The bird would be in the same part of the cage, near the hopper, and probably oriented toward the wall where the hopper has disappeared or turning to one side or the other. A hundred photographs taken after 10 sec., on the other hand, would find the bird in various parts of the cage responding to many different aspects of the environment. The sooner a second reinforcement appears, therefore, the more likely it is that the second reinforced response will be similar to the first, and also that they will both have one of a few standard forms. In the limiting case of a very brief interval the behavior to be expected would be holding the head toward the opening through which the magazine has disappeared.\nAnother reason for the greater effectiveness of short intervals is that the longer the interval, the greater the number of intervening responses emitted without reinforcement. The resulting extinction cancels the effect of an occasional reinforcement.\nAccording to this interpretation the effective interval will depend upon the rate of conditioning and the rate of extinction, and will therefore vary with the drive and also presumably between species. Fifteen sec. is a very effective interval at the drive level indicated above. One min. is much less so. When a response has once been set up, however, the interval can be lengthened. In one case it was extended to two min., and a high rate of responding was maintained with no sign of weakening. In another case, many hours of responding were observed with an interval of one min. between reinforcements.\nIn the latter case, the response showed a noticeable drift in topography. It began as a sharp movement of the head from the middle position to the left. This movement became more energetic, and eventually the whole body of the bird turned in the same direction, and a step or two would be taken. After many hours, the stepping response became the predominant feature. The bird made a well defined hopping step from the right to the left foot, meanwhile turning its head and body to the left as before.\nWhen the stepping response became strong, it was possible to obtain a mechanical record by putting the bird on a large tambour directly connected with a small tambour which made a delicate electric contact each time stepping took place. By watching the bird and listening to the sound of the recorder it was possible to confirm the fact that a fairly authentic record was being made. It was possible for the bird to hear the recorder at each step, but this was, of course, in no way correlated with feeding. The record obtained when the magazine was presented once every min. resembles in every respect the characteristic curve for the pigeon under periodic reinforcement of a standard selected response. A well marked temporal discrimination develops. The bird does not respond immediately after eating, but when 10 or 15 or even 20 sec. have elapsed it begins to respond rapidly and continues until the reinforcement is received.\nFig. 1. 'Reconditioning' of a superstitious response after extinction. The response of hopping from right to left had been thoroughly extinguished just before the record was taken. The arrows indicate the automatic presentation of food at one-min. intervals without reference to the pigeon's behavior.\nIn this case it was possible to record the 'extinction' of the response when the clock was turned off and the magazine was no longer presented at any time. The bird continued to respond with its characteristic side to side hop. More than l0,000 responses were recorded before 'extinction' had reached the point at which few if any responses were made during a 10 or 15 min interval. When the clock was again started, the periodic presentation of the magazine (still without any connection whatsoever with the bird's behavior) brought out a typical curve for reconditioning after periodic reinforcement, shown in Fig. 1. The record had been essentially horizontal for 20 min. prior to the beginning of this curve. The first reinforcement had some slight effect and the second a greater effect. There is a smooth positive acceleration in rate as the bird returns to the rate of responding which prevailed when it was reinforced every min.\nWhen the response was again extinguished and the periodic presentation of food then resumed, a different response was picked up. This consisted of a progressive walking response in which the bird moved about the cage. The response of hopping from side to side never reappeared and could not, of course, be obtained deliberately without making the reinforcement contingent upon the behavior.\nThe experiment might be said to demonstrate a sort of superstition. The bird behaves as if there were a causal relation between its behavior and the presentation of food, although such a relation is lacking. There are many analogies in human behavior. Rituals for changing one's luck at cards are good examples. A few accidental connections between a ritual and favorable consequences suffice to set up and maintain the behavior in spite of many unreinforced instances. The bowler who has released a ball down the alley but continues to behave as if he were controlling it by twisting and turning his arm and shoulder is another case in point. These behaviors have, of course, no real effect upon one's luck or upon a ball half way down an alley, just as in the present case the food would appear as often if the pigeon did nothing -- or, more strictly speaking, did something else.\nIt is perhaps not quite correct to say that conditioned behavior has been set up without any previously determined contingency whatsoever. We have appealed to a uniform sequence of responses in the behavior of the pigeon to obtain an over-all net contingency. When we arrange a clock to present food every 15 sec., we are in effect basing our reinforcement upon a limited set of responses which frequently occur 15 sec. after reinforcement. When a response has been strengthened (and this may result from one reinforcement), the setting of the clock implies an even more restricted contingency. Something of the same sort is true of the bowler. It is not quite correct to say that there is no connection between his twisting and turning and the course taken by the ball at the far end of the alley. The connection was established before the ball left the bowler's hand, but since both the path of the ball and the behavior of the bowler are determined, some relation survives. The subsequent behavior of the bowler may have no effect upon the ball, but the behavior of the ball has an effect upon the bowler. The contingency, though not perfect, is enough to maintain the behavior in strength. The particular form of the behavior adopted by the bowler is due to induction from responses in which there is actual contact with the ball. It is clearly a movement appropriate to changing the ball's direction. But this does not invalidate the comparison, since we are not concerned with what response is selected but with why it persists in strength. In rituals for changing luck the inductive strengthening of a particular form of behavior is generally absent. The behavior of the pigeon in this experiment is of the latter sort, as the variety of responses obtained from different pigeons indicates. Whether there is any unconditioned behavior in the pigeon appropriate to a given effect upon the environment is under investigation.\nThe results throws some light on incidental behavior observed in experiments in which a discriminative stimulus is frequently presented. Such a stimulus has reinforcing value and can set up superstitious behavior. A pigeon will often develop some response such as turning, twisting, pecking near the locus of the discriminative stimulus, flapping its wings, etc. In much of the work to date in this field the interval between presentations of the discriminative stimulus has been one min. and many of these superstitious responses are short-lived. Their appearance as the result of accidental correlations with the presentation of the stimulus is unmistakable.\nThis Psychology Symbol - Vintage Retro Striped Sunset T-Shirt is available from Amazon (prime eligible) in a range of colors for women and men. Sales help support this website, which has been providing free and comprehensive information and resources for psychology students and educators since 2008.\nAug 07, 25 06:12 AM\nAug 07, 25 06:10 AM\nAug 02, 25 12:44 PM\nPlease help support this website by visiting the All About Psychology Amazon Store to check out an awesome collection of psychology books, gifts and T-shirts.\nGo To The Classic Psychology Journal Articles Page\nNew! Comments\nHave your say about what you just read! Leave me a comment in the box below."
    },
    {
      "url": "https://www.howtogeek.com/what-is-the-dead-internet-theory/",
      "text": "The Dead Internet Theory started life as an online conspiracy theory that does the rounds from time to time. It suggests that most of what's on the internet isn't made by humans, but is that possible, and does it even matter?\nThe Dead Internet Theory in a Nutshell\nThe internet is a busy place, with billions of interactions, millions of content pieces, and staggering numbers of social media accounts and data about people.\nThe Dead Internet Theory (it's really a hypothesis if we're being honest) is the idea that most, but not all, of the content and interactions you see on the internet are not human. It's all generated by algorithms and AI software, so much that the internet isn't really a human place. Instead, humans are a minority on the net, without even realizing it.\nWhy would that even matter? Well, consider the impact that the internet has on modern society. It's the primary way that people get information. It's how misleading information about medical or political issues is spread with little or no oversight. With the internet being such an influential and central technology to modern human society, it stands to reason that having most of it be fake would be a huge point of concern!\nIs This Even Possible?\nIrrespective of whether you think the theory holds any truth, is it even possible? If we went back just a few years, the answer would have been a confident \"no,\" but in this day and age, it seems completely plausible. The technology to create virtually anything whole cloth is commonplace, which is why you should be skeptical of anything you see on the internet.\nAI technologies can conjure any image, human faces that don't exist are trivial to make, and AI systems can converse naturally with humans in a way that could fool many people. So, even if it's not true that most of the internet is governed and created by non-living entities, certainly some parts of it are, and as these technologies advance it's feasible that the percentage of machine-made content on the net will continue to grow.\nWhat if It’s True?\nIf, for the sake of argument, it turns out the theory is actually true, what would that mean in a practical sense? We've already seen how \"bots\" on platforms like X (formerly Twitter) and Facebook can do anything from manipulating public opinion, to perpetuating scams and misinformation. One study by cybersecurity company Cheq estimates that as many as 12% of the users on X could be bots. In 2019, Facebook took down a staggering 3 billion fake accounts, which would undoubtedly have included a significant number of bots.\nThere's no doubt that algorithms, AI, and numerous other variations of autonomous software can have real and serious consequences for the lives of humans on this planet. Whether it's people being radicalized on social media, algorithms creating echo chambers, or people who don't exist having an influence on real people, a total takeover could conceivably send human society down a different path of history.\nBots Are Part of the Web’s Future\nThe dead internet theory is one of those conspiracy theories that stick around because it speaks to a very particular fear or concern. The thing is, it is completely reasonable to be wary of anything you see and hear on the web when it comes to human authorship. You have no way of really knowing that a human wrote this or that I exist. Which is, of course, nothing new in philosophical circles, but now it's a real practical issue!\nThe fact is that on the world-wide internet, highly-intelligent, autonomous artificial agents will have a home. Whether it's an unshackled AI running on servers in the middle of international waters by seasteading enthusiasts, or a marketing AI run by your favorite fast-food company, there's no putting this genie back in the lamp. The dead internet theory in its original form may or may not be bunk. There's no compelling evidence one way or another. However, we may be witnessing the birth of a version of it that everyone will have to live with."
    },
    {
      "url": "https://www.howtogeek.com/353717/what-is-gdpr-and-what-does-it-mean-for-you/",
      "text": "Quick Links\nThe General Data Protection Regulation (GDPR) is a new European Union law that takes effect today, and it's the reason you've been receiving non-stop emails and notices about privacy policy updates. So how does this affect you? Here's what you need to know.\nThe new GDPR law takes effect today, May 25th, 2018, and it covers data protection and privacy for EU citizens, but it also applies to a lot of other countries in various ways, and since all the tech giants are huge multi-national corporations, it affects a lot of the stuff that you use on a daily basis.\nThe Problem GDPR is Trying to Solve: Companies Are Collecting and Abusing Your Personal Info\nSince the dawn of the internet, companies have been gathering as much data as possible on anyone they can. It’s simple to collect that information, so there’s no reason for them not to hoard it.\nThe problem is that over the last few years, lots of companies have been caught failing to protect—or outright abusing—your personal information. The Cambridge Analytica scandal, where a researcher used a Facebook quiz to gather huge amounts of data on millions of Facebook users and then sold it to a consulting firm, is only the most recent example. The Equifax hack last year was particularly bad because the information leaked could be used to open credit cards. And those are just the big scandals. Lots of companies have been misusing your data in smaller ways, like selling it on to third party advertising companies.\nThe EU has taken a dim view of the situation and is using the GDPR to try and rectify it. Under the new laws, companies that don’t adequately protect consumer data or misuse it in any way face huge fines.\nWhat is Considered Personal Data?\nThe GDPR protects “personal data,” which here means “any information relating to an identified or identifiable natural person”---and that's a pretty broad definition. In reality, personal data is generally going to include things like:\n- Biographical data such as your name, address, phone number, social security number, and so on.\n- Data relating to your physical appearance and behaviour such as hair color, race, and height.\n- Information about your education and work history such as your salary, college degree, GPA, tax ID, and so on.\n- Any medical or genetic data.\n- Things like your call history, private messages, or geo-location data.\nThis is far from a complete list. The key is that any data that makes you identifiable counts. In certain circumstances, your hair color may be enough. In others, even your full name—if it’s something common like Robert Smith—might not make you identifiable.\nWhat Does the GDPR Do?\nThe GDPR gives EU residents who are having their personal data collected—called “data subjects” in the law—eight rights. They are:\n- The right to be informed: If a company is collecting data, they need to tell data subjects what’s being collected, why it’s being collected, what it’s being used for, how long it’s going to be kept, and if it’s going to be shared with third parties. This information can’t be buried deep in a terms of service no one reads; it has to be concise and in plain language.\n- The right to access: If they request it, any organization that has personal data regarding a data subject must provide it to them within a month.\n- The right to rectification: If a data subject finds out that a company has data on them that’s incorrect, they can request that it gets updated. Companies have one month to comply.\n- The right to erasure: A data subject can request that a company deletes any data that is held on them in certain circumstances. For example, if the data is no longer needed or they are withdrawing their consent for it to be used.\n- The right to restrict processing: If an organization cannot delete a data subjects’ data—for example, because they need it for legal case—then they can request that the company limit how it’s used.\n- The right to data portability: Data subjects have the right to take their personal data from one service and use it with another.\n- The right to object: If data is collected without consent but for legitimate business interests, for the public good, or by an official authority, the data subject can object. The organization must then stop processing the data until they can prove they have legitimate reasons to do so.\n- Rights related to automated decision making including profiling: The GDPR puts into place safeguards so that individuals can object to or get an explanation about automated decisions that affect them and their data.\nAnother big part of the regulations is that companies must have a lawful reason for collecting or processing any data. One of the lawful reasons is that they’ve obtained consent to use it for a specific purpose, but there are others like they need it to comply with legal obligations or that collecting it is in the public interest.\nAs you can see, the rights given to EU residents under the law are pretty broad and are forcing companies who collect data from them to really think about what they’re collecting and why. The old days of just collecting everything they can and hoping they find a use for it later are gone—at least in Europe. This is why pretty much every service you’ve ever given your email address to is contacting you.\nWhat’s got a lot of companies in a fuss is that the sanctions for not being GDPR compliant are pretty harsh. An organization can be fined up to €20 million or 4% of their worldwide annual turnover (whichever is greater) under the laws. For the likes of Amazon or Google, this amounts to billions of dollars in potential fines if they mishandle EU residents’ data.\nWhat Does the GDPR Mean for Americans?\nThroughout this article, we’ve been focusing on what rights GDPR gives to EU residents for the simple reason that it’s an EU law. It actually doesn’t apply to American citizens, unless they’re also resident in the EU. The reason you’re getting all the emails is that most companies have no way of telling who’s an EU resident and who isn’t.\nThis, however, doesn’t mean that the GDPR won’t affect you. It’s caused a lot of companies to reevaluate how they’re handling consumer data and some of them have started talking about rolling the GDPR rights out to non-EU residents. And it's also simpler for companies to enforce a single set of rules for all customers in many cases.\nFor example, Apple has launched a new privacy portal where people can download all their personal data or delete their account, in other words providing people with the rights of access and erasure. For the time being, only EU based accounts can use it but Apple plans to roll it out worldwide over the next few months. Similarly, Facebook is muttering about giving the same GDPR protections to some users outside the EU."
    },
    {
      "url": "https://www.howtogeek.com/363484/dark-patterns-when-companies-use-design-to-manipulate-you/",
      "text": "Quick Links\nEver feel like you're being prompted into going along with something you don't want because better options aren't clearly being presented? You probably just found a dark pattern.\"Dark patterns\" are designs that deliberately trick you into doing what a company wants. This can take all kinds of forms, from MoviePass not canceling people's accounts to installers putting crapware on your machine by assuming you'll click \"Next\" without thinking too much about it.Evan Puschak outlined the idea nicely on YouTube earlier this year, and his video is well worth a watch.\nBeing a geek is all about tweaking things to work the way you want, as opposed to going along with the defaults. Dark patterns deliberately make this harder, so it's worth understanding how they work. Let's look at a few examples and try to learn what this all means.\nConfirm Shaming: Implying You're Bad or Stupid\nConfirm shaming is a recent trend, but a very annoying one. Website designers who want you to do something like subscribe to a newsletter write copy for buttons that make you feel like a terrible person for choosing the option you want. Like this:\nThat's right: to unsubscribe, you have to click a link that implies you don't care about your cat. It's scummy. Note also that the opt-out is hard to see--small gray text on a white background.\nThis is all intentional. The manipulative popup like this makes it more likely that you'll give out your email address, even if you feel gross about it. And the practice is all too common: the confirm shaming Tumblr has a lot more examples if you want to see more (but you'll run into plenty just by browsing the web).\nBait and Switch\nSometimes you click a button intending to do one thing, only to discover you've done the opposite. This is the classic bait and switch.\nMicrosoft employed this trick back when it was pushing Windows 10 hard. At one point they offered two buttons: upgrade now or upgrade tonight.\nSay you don't want to install Windows 10; which button do you press? A lot of people ended up accidentally installing Windows 10 after this one.\nThat's scummy enough, but it got worse: at one point even closing the Window offering the update would prompt the installation. A lot of people ended up accidentally installing Windows 10 because of this one, which makes sense: it was almost impossible to tell how to opt out.\nMoviePass not canceling people's accounts is a more recent example of this sort of dark pattern at work. People thought they'd deleted their account, only to find later they'd accidentally opted in again.\nAssuming People Won't Read\nThere are other types of dark patterns, but many have one thing in common: they assume that people won't read and will act on instinct instead. At some point, you've likely justÂ clicked the most prominent button available to get on with whatever it is that you're doing. Companies count on that.\nFor example: back in April Facebook used dark patterns to undermine EU privacy rules. Take a look:\nNote the buttons on the left. The button that closes the popup without reviewing your settings is blue, so it stands out. The button that lets you check your settings is white so that it blends in. The \"Manage Data Setting\" label also makes that label sound a bit daunting to the non-geeks among us.\nFacebook knows the vast majority of people will tap the blue button without reading anything just to make the popup disappear. But by getting users to tap \"Agree,\" the company has collected the consent to gather data legally required by the GDRP.\nNothing about this is illegal. Sure, Facebook isn't neutrally presenting the decision, but they are asking you for consent, whether you register that consciously or not.\nAnd the above example isn't even that nefarious, compared to what companies have pulled over the years. For example, there's the scam of bundled crapware. You know, things like this in installers:\nWindows users know all about this, and Mac users haven't been spared either. The idea here is that you'll click \"Next\" without looking at what's on the screen, giving consent to install software that no reasonable person would want. At best you have a few unwanted applications; at worst you just installed some privacy violating spyware.\nThis practice dates back to the 1990s. Raymond Chen, writing for Microsoft's The Old New Thing blog, pointed out one installer that hid checked opt-ins below unchecked ones, so you'd have to scroll even to notice they were enabled. Sneaky.\nWe Could Go On\nThere are other kinds of dark patterns, but I think you get the idea at this point. Any design that tries to subtly prompt you to do something you don't necessarily want (or that makes being aware of your options more difficult) is employing a dark pattern.\nWhy is it worth knowing this? Because now that you know what a dark pattern is you're equipped to spot them. This makes it less likely that you'll fall for them and you can share that information with friends and family. Keep your eyes peeled.\nPhoto credit: chanchai howharn/Shutterstock.com"
    },
    {
      "url": "https://www.howtogeek.com/youtube-is-in-an-arms-race-with-ad-blockers-and-ad-blockers-might-lose/",
      "text": "Quick Links\nI’m sure you’ve heard that YouTube is no longer allowing content blockers on its platform. Developers of these content blockers and YouTube have been trying to one-up each other for years. This minor arms race is coming to a head now.\nHow this Game of Cat and Mouse Started\nAds on YouTube are worse than ever—in quantity and quality. I recently sat through two unskippable ads before a thirty-second clip. Then a mid-roll ad every five minutes on a long tutorial video. YouTube is either serving ads for Grammarly or ads for fake mobile video games, pyramid schemes, and crypto scams. You can block some of those, by the way.\nThe Ads Keep Getting More Intrusive\nYouTube is always concocting new kinds of ads. Think pre-roll ads, mid-roll ads, unskippable ads, banner ads, overlay ads, vertical ads, bumper ads, shopping ads, ad breaks during live streams, and hidden sponsorship ads. Now that YouTube is even trying to push ads on pause screens, it’s hard to imagine there was a time when YouTube didn’t have any ads whatsoever. The whole focus was just giving people a platform to “broadcast” themselves.\nBut all good things must come to an end. And for YouTube, that end came in the shape of Google, which acquired the platform in 2006 and introduced ads.\nThe early ad formats were pretty benign. YouTube called them “Participatory Video Ads” or PVA, which interested viewers could click to watch exclusive content from brands like music albums and TV show clips. There were also minimalist text-based banner ads, and promos spread across the page, occasionally accompanied by graphics. They mostly stayed out of your way.\nEventually, YouTube turned its attention to the video player itself and started overlaying those banner ads directly onto the videos. Around 2010, pre-roll ads (the video ads that play before a video starts) started popping up before some videos. It wasn’t as frequent, though. Longer but skippable ads also rose around that time.\nWe don’t see them as often now, but banner ads on YouTube’s homepage also became common back then. With unskippable ads, vertical video ads on mobile, and now pause screen ads, YouTube has shoved ads almost everywhere it can.\nThe point I’m trying to make is this: ads on YouTube have progressively become insufferable. And they’re only going to get worse (more on that in a bit).\nYouTube Is Going After Ad Blockers Now\nIt’s no wonder that people use ad blockers on YouTube. It’s hard to estimate what percentage of YouTube visitors have ad blockers enabled, but only 30% of people worldwide have ad blockers installed on their computers (not counting mobile users). So, it’s safe to say it wasn’t an overwhelming number. But Google decided it’s affecting the bottom line enough to bring the hammer down on Adblock users.\nPeople with ad-block enabled started seeing a wall inside the video player with warnings that ad-blocking isn’t allowed on the platform. It forces them to disable the ad-blocker if they want to watch the video. YouTube also added an artificial 5-second lag for ad-block users across all browsers.\nThis crackdown on content blockers is a part of YouTube’s strategy to push the premium subscription. The subscription service is mostly built around withholding basic core features (many of which used to be free). Background listening, downloading high-quality videos on mobile, high-quality streams, and even queuing up videos on mobile are now locked behind a paywall.\nYouTube creates the problem and sells you the solution. From YouTube’s perspective, pushing more ads and banning ad blockers either means more revenue from ads or more premium subscriptions. It sounds like a win-win. But I think this strategy is going to backfire.\nYou Wouldn’t Steal A Car\nWhen YouTube first introduced its anti-ad-block wall, ad-block developers updated their software to circumvent the wall. That’s how we got anti-anti-adblock scripts. So it’s clear that ad-blockers are fighting back, and YouTube hasn’t won (yet, anyway).\nSecondly, and more importantly, YouTube’s strategy to discourage people from using ad-blockers is going to have the opposite effect. Let me tell you why.\nBack in the day, there was a huge public campaign against digital piracy that opened with “You Wouldn’t Steal a Car!” It equated illegally downloading a movie with stealing an actual car, handbag, or TV and shoplifting, which the internet (understandably) turned into a meme.\nCuriously enough, it also led to a dramatic rise in online piracy. In the early years of the internet, not everyone knew you could just download music and movies from the internet for free. So, ironically, it made people more likely to pirate. Researchers even did a study on the phenomenon.\nThat's the same path YouTube is heading down with its aggressive anti-Adblock campaign. I explored Google Trends for searches related to blocking ads on YouTube, and they’re pretty steady over the years except for some huge spikes around September and October 2023 when YouTube widely rolled out the anti-adblock wall.\nI tried multiple keywords and found the same results.\nAllAboutCookies noticed a 336% jump in traffic on their YouTube ad-blocker pages. They also conducted a survey and found that 22% of ad block users were more likely to install advanced ad blockers after finding out about YouTube’s anti-adblock wall, and 52% refused to pay YouTube anything.\nThat’s why YouTube’s plan for kicking ad blockers off the platform is going to backfire. A lot more people are finding out about ad-blocker software, and it’s only making the software more sophisticated. Besides, people who use ad blockers are much less likely to click on an ad in the first place.\nSo far, it seems like ad-block companies and developers are staying one step ahead of YouTube, but the tech giant might have a kill move up its sleeve.\nYouTube Is Working On A Kill Move\nYouTube recently started experimenting with an entirely new kind of ad format called server-side ad injection. Instead of serving an ad ahead of or in the middle of a video, YouTube has started injecting ads directly into the stream. It makes the ad a part of the YouTube video, rendering ad-blockers totally useless since they can’t tell the video content apart from the ad.\nPeople have already reported seeing ads despite active ad-blockers. Server-side injection might finally manage to hamstring content blockers on YouTube.\nThat’s not to say that YouTube has definitely won. Developers are working on outsmarting server-side injection. One solution could be detecting ad content using AI and automatically fast-forwarding to the video content.\nIt’s unclear how far this escalation will go, but it is clear that ads on YouTube are only going to get more annoying to deal with unless you cough up 14 bucks a month."
    },
    {
      "url": "https://www.howtogeek.com/youtube-is-the-most-valuable-streaming-servicesso-why-dont-people-want-to-pay-for-it/",
      "text": "YouTube is one of the most interesting things to come out of the whole internet thing. It's basically like community TV, but with a global reach. Anyone can upload content to YouTube, and it changes the whole balance of power when it comes to video content.\nEven better, once YouTube allowed for monetization, talented content creators could make a living, or at least support their passion projects while offering us content that would never exist under traditional models. Yet, there seems to be a sentiment that no one should pay for YouTube, and that ads should not be on YouTube. Only one of these can be true at once without making YouTube unsustainable.\nWhy do people have this reaction? Do you feel YouTube should be free in all ways?\nI Think YouTube Is the Most Important Streaming Service of Them All\nIf you told me that I could only keep one streaming service and had to drop the rest, YouTube would be the one I choose to keep every time. Not only is YouTube a streaming video pioneer, it's the only place you can find the ultra-specific niche content that you care about. It's one of the most important sources of information on the internet, and it's a phenomenal learning tool. It's as transformative as Wikipedia.\nWhen I want to learn how to do something, YouTube is often the first place I turn. In the age of AI content, it's especially important to know that you're seeing the real-world experience of a real person. Of course, you need to evaluate the expertise of whoever puts themselves forward as an expert. However, you can't deny that having access to people with skills and knowledge all over the world is a genuinely new and important thing platforms like YouTube bring to the table.\nThat's before we even get to entertainment, which, again, YouTube offers in a way that no one else really does. The creativity on display is endless, and new show formulas or ideas are constantly emerging. By its very nature, YouTube always feels fresh and creative compared to what a room full of TV executives would greenlight. Sometimes a little raw and unfltered,but far more authentic because of it.\nThe Best Content Creators on YouTube Need Financial Support\nThe thing is, making even very basic content for YouTube is expensive. When I started out making tech videos we had to invest in lights, a good camera with a decent lens, microphones, a teleprompter, and more. I had to dedicate a room in the house I rented for recording, and then there's the labor of actually editing the video together and putting it out there, and the price of the software.\nUltimately, that channel let us make our money back, but without monetization it simply wouldn't have been sustainable. Your favorite Youtuber probably has even more expensive costs in order to create better quality content. As the standard for YouTube content goes up, so does the cost of making that content.\nIf you want a given content creator that you love to keep making that content, they need some way to cover their costs. That money has to come from somewhere.\nYouTube Is Expensive to Run\nIt's not just the content creators that need financial support to make the content, the platform provider has enormous expenditure as well. YouTube doesn't run on magic; it consists of thousands of servers inside data centers that have to perform video conversions, and, of course, the actual streaming of content using massive amounts of bandwidth.\nObviously, YouTube is intended to be a for-profit business, but if no money comes in because of ad-blockers or a disinterest in paying for YouTube Premium, the service would fold virtually overnight. That's not some fancy business analysis; it's common sense.\nPeople Seem to Object to Paying for YouTube in Principle\nWhich is why I'm so surprised to see a consistent attitude online that YouTube should be free, but that it should also have no advertising. My question is how that's supposed to work? It's almost as if people think of YouTube as a public service, but it's not funded using taxpayer money.\nA primary complaint is that the level of advertising on YouTube has reached unwatchable levels. I don't disagree with that at all, but you have to ask why YouTube needs to push so many ads. It's easy to assume that it's just corporate greed at work, but if you think about it, heavy advertising is more an act of desperation than necessity.\nMaking your customer experience worse is just as liable to decreasing your profits as people go elsewhere, but YouTube seems compelled to test our tolerance for ads, and that tells me they have no other choice. There's probably a spiral of people circumventing advertising, leading to YouTube increasing ads, leading to more ad-blocking, etcetera, etcetera.\nWhenever someone mentions paying for YouTube Premium to be rid of ads, there's a litany of replies vowing never to pay for YouTube. Even the cheaper YouTube Premium \"Lite\" with reduced ads for some money doesn't seem to be swaying public opinion.\nIf You Want YouTube to Stay, You Need to Pay\nMy question then is that, if you enjoy YouTube content or find it valuable in any way, wouldn't you want it to stick around? The money to make it all work has to come from somewhere. That means advertising or subscription money. These days, many YouTube creators are forced to take sponsorships because ad revenue just isn't good enough anymore. Something I see as a negative in some cases, because it has the potential to make them less independent and impartial. So it's in your best interest to keep your content free from commercial influence.\nIf you want to keep enjoying YouTube content, you need to pay for it. If you feel it isn't worth anything, then you have no reason to consume it. You can pay with your time (i.e. watching an advert) or you can pay in cash. These days, you can even give cash to a specific YouTube channel without pushing that money into the general pool shared among all monetized channels.\nThere's this strange situation where the same people who will happily pay to have an ad-free experience on services like Netflix or Hulu, won't do the same thing on YouTube, even though most of their streaming time is spent watching YouTube content. What worries me is that if things keep going the way they are, there won't be any YouTube content to watch."
    }
  ],
  "argos_summary": "The article reflects on the evolution of the internet from its early days to the present, highlighting how advertising has become a dominant force that negatively impacts user experience. It discusses the challenges of monetizing content through subscriptions versus ads, the rise of intrusive advertising methods, and the complications introduced by regulations like GDPR. Additionally, it critiques the current state of web design, SEO practices, and the influence of AI on content creation and search engines, ultimately questioning the sustainability of the modern web and the potential for a future dominated by non-human generated content.",
  "argos_id": "JFK4JEQOQ"
}