{
  "url": "https://www.androidauthority.com/oneplus-13-ai-perfect-shot-3585577/",
  "authorsByline": "Ryan McNeal",
  "articleId": "4e704752537541aaba2f54ebacc3cb27",
  "source": {
    "domain": "androidauthority.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "",
      "county": "",
      "city": "",
      "coordinates": {
        "lat": 0.0,
        "lon": 0.0
      }
    }
  },
  "imageUrl": "https://www.androidauthority.com/wp-content/uploads/2025/07/oneplus-13-back-blue-leather-hero-feature-scaled.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T21:23:17+00:00",
  "addDate": "2025-08-08T21:35:23.530674+00:00",
  "refreshDate": "2025-08-08T21:35:23.530675+00:00",
  "score": 1.0,
  "title": "OnePlus 13 gets its own version of Google's Best Take",
  "description": "Say goodbye to poorly-timed blinks and turned heads.",
  "content": "Earlier this year, OnePlus announced that a bevy of new AI tools would soon be available on its phones. This included two photo-centric features: AI Reframe and AI Perfect Shot. It looks like the latter is now starting to roll out to the OnePlus 13.\n\nA new software update has arrived for OnePlus 13 owners. The changelog for the update mentions various add-ons and improvements, including the rollout of AI Perfect Shot. Similar to Google’s Best Take tool, AI Perfect Shot can recognize faces in a photo and replace unwanted facial expressions with more desirable expressions. This way you can always get the best photo. For example, if you blink as the picture is taken, you can use this feature to make it look like you were looking at the camera the entire time.\n\nIn addition to AI Perfect Shot, this update introduces a soft light filter to the Portrait and Photo modes. Users can now export videos as live photos, or export videos and live photos in high resolution. The changelog also mentions that 120FPS video will stay 120FPS even after being edited. And you can now hide content of specific albums from your photo list.\n\nSeeing as OnePlus said AI Perfect Shot was scheduled to roll out later this summer, it looks like the feature has arrived right on time. Have you received the update on your OnePlus 13 yet? Let us know in the comments section below.",
  "medium": "Article",
  "links": [
    "https://www.androidauthority.com/tag/oneplus-13/",
    "https://www.androidauthority.com/tag/oneplus/",
    "https://www.androidauthority.com/news/",
    "https://www.androidauthority.com/tag/smartphones/",
    "https://www.androidauthority.com/best-pixel-features-explained-3217987/",
    "https://www.androidauthority.com/android-authority-comment-policy/",
    "https://www.androidauthority.com/oneplus-ai-suite-announcement-3561441/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "AI Perfect Shot",
      "weight": 0.13760655
    },
    {
      "name": "live photos",
      "weight": 0.10438743
    },
    {
      "name": "AI Reframe",
      "weight": 0.100833766
    },
    {
      "name": "new AI tools",
      "weight": 0.08823231
    },
    {
      "name": "OnePlus",
      "weight": 0.08636946
    },
    {
      "name": "120FPS video",
      "weight": 0.080535315
    },
    {
      "name": "unwanted facial expressions",
      "weight": 0.079198025
    },
    {
      "name": "Best Take",
      "weight": 0.077242054
    },
    {
      "name": "specific albums",
      "weight": 0.069084644
    },
    {
      "name": "videos",
      "weight": 0.06694921
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.91162109375
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.90234375
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.77587890625
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.50439453125
    }
  ],
  "sentiment": {
    "positive": 0.29467773,
    "negative": 0.12609863,
    "neutral": 0.57958984
  },
  "summary": "A new software update for the OnePlus 13 has arrived, with the launch of AI Perfect Shot, a version of Google's Best Take tool that can replace unwanted facial expressions with more desirable expressions. The update also includes a soft light filter to the Portrait and Photo modes, and users can now export videos as live photos or export high resolution. The changelog also mentions that 120FPS video will remain even after being edited and that specific albums can be hidden from photo lists.",
  "shortSummary": "Oneofson 13 users are receiving the latest update featuring AI Perfect Shot, AI Reframe, and other features, including a soft light filter and 120FPS video playback.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d6dcfdbf3647409796b69c79f6ecbcd0",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.androidauthority.com/android-authority-comment-policy/",
      "text": "Android Authority is a community of technology enthusiasts. We’re brought together by our interest in all things tech, regardless of brand, platform, and price point. Our writers care deeply about the topics they cover, and so do our readers.\nBecause we’re all passionate, it’s easy for discussions around certain topics to become heated, but that’s not an excuse for discussions to degenerate.\nHere are the general rules that cover commenting on Android Authority platforms, including on-site comment sections, YouTube, and various social media channels.\nDo’s\n- Always be civil.\n- Read the content before commenting.\n- Post thoughtful comments that meaningfully contribute to the discussion.\n- Give constructive criticism in response to posts and other comments.\n- Ignore the trolls, they crave attention.\n- Downvote low-quality comments. Flag spam and abusive comments.\nDon’ts\n- Attack commenters, Android Authority staff, or other individuals.\n- Post off-topic comments.\n- Post abusive, insulting, threatening, harassing, sexist, racist, misogynist, homophobic comments.\n- Reveal personal information of any individuals.\n- Spam, self-promote, impersonate.\n- Post low-effort comments that don’t add anything to the discussion.\n- Post porn, gore, or other NSFW content.\n- Post or link to pirated content of any type.\n- Post slanderous or defamatory comments.\nHouse rules\n- Comments are solely the opinions of the individuals leaving them. In no way does Android Authority endorse or condone them.\n- Failure to comply with the guidelines above may result in your comments being deleted or moderated.\n- Repeat and serious offenders will be banned.\n- We reserve the right to delete or moderate comments at any time and at our sole discretion.\n- This policy may be changed at any time and at our sole discretion."
    },
    {
      "url": "https://www.androidauthority.com/best-pixel-features-explained-3217987/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nThe best Pixel-only features explained: There's more to Pixels than you think!\nFebruary 14, 2025\nGoogle Pixel devices are known for their simplicity and clean UI, but this doesn’t mean Google isn’t throwing some neat Pixel features into its Android handsets. In fact, there is a pretty long list of features you’ll only find on Pixel handsets. In this post, we’ll go over the best Pixel features and tell you all about them. Let’s dig right in.\nEditor’s note: While many of these Pixel features can only be found on Pixel devices, manufacturers sometimes have similar or equivalent versions. You can also find some similar features in third-party apps.\nCalling Pixel features\nCall Screen\nCall Screen has become one of the most helpful features for evading unwanted calls from scammers, spammers, and robocalls. It uses Google Assistant to answer calls from unknown contacts. The system will ask callers who they are and the reason for the call. After seeing the answers’ transcript, you can decide whether to hang up, answer, or respond with a suggested message.\nAutomatic Call Screen works on all Pixel phones in the US. You’ll need to be in a supported country to use it manually. These include Australia, Canada, France, Germany, Ireland, Italy, Japan, Spain, the UK, and the US. Manual call screening also extends to a select handful of other Android devices in the US and Canada.\nWith the Pixel 8 series, Call Screen received filtering improvements.\nHold For Me\nDon’t you hate staying on hold when calling businesses? I know I do, which is why I’m especially fond of the Pixel-only Hold For Me feature. It does precisely what the name entails. Google Assistant will stay on hold for you while you go mind your business. You’ll be notified when the representative is ready to speak to you.\nThe option will appear whenever you’re on a call using a supported device. Hold For Me is currently available for Pixel 3 and newer Pixels in the US, Australia, Canada, Japan, and the UK. It’s also only available in English and Japanese.\nDirect My Call\nAutomated systems can be even more annoying than waiting on hold. Google is trying to simplify things with Direct My Call on its Pixel devices. Direct My Call will visualize what the automated system is saying, as well as the menu options presented. You can then use touch options to navigate the automated system without listening to annoying recorded voices. People can also opt to share their call data with Google to help the system improve the experience for other users in the future.\nDirect My Call is available for Pixel 3a and newer Pixel phones. It requires the latest version of the Phone app. It’s also available only in the US and in the UK, in English.\nWait Times\nWait Times is a much simpler tool that does nothing but estimate the time you’re put on hold when making a call. This will help other users get an estimation of the time they’ll have to be waiting around.\nThe feature requires a Pixel 3a device or newer, and the latest version of the Phone app. It’s also only available in the US, in English.\nVoice message transcriptions\nGoogle Voice has been able to transcribe voicemails for years now, but the feature didn’t make it to the official Messages app until the Pixel 7 series. If you have a supported phone, Messages will automatically transcribe any voicemail you get. You can also use it on a select list of a few other phones. These first ones were the Pixel 6 series, the Galaxy S22 and S23 phones, and the Galaxy Z Fold 5 and 5. We can assume newer versions have it, too.\nSatellite SOS\nWe’ve seen other competitors implement this feature, but it is new for Google devices, and the Pixel 9 series is the first to enjoy it. Satellite SOS allows you to contact emergency services and share your location with them, all via satellite. It works even when you have no cellular coverage at all, and it works regardless of your carrier. However, it’s only available on Pixel 9 devices right now and only in the US.\nCamera and photo Pixel features\nAstrophotography photos and time-lapses\nAstrophotography is available on the Pixel 3 or newer, and it’s pretty much a super-enhanced version of HDR. The camera will shoot multiple images for about 15 seconds, then stick them together and use computational photography to show you a starry night sky that seemed impossible to shoot on a smartphone.\nThis feature is on by default, and it will activate whenever the phone detects a night sky, on Night Sight mode, and the device is completely still. The Pixel camera will also save a timelapse while shooting in Astrophotography mode.\nMotion mode\nMost phones try to shoot images in which the image is as frozen as possible. We usually avoid motion blur and other movement elements, but they’re not always a bad thing. In fact, some motion blur can be good, as it showcases movement, action, and can often create very interesting effects. We’ve all seen cars’ cool light trails on a dark road.\nMotion mode can accomplish action blur or long exposure effects. The mode is right on the camera app’s scrolling section, so find it and pick between Action Pan and Long Exposure. You’ll need a Pixel 6 series or newer device to access this feature. The Pixel 6a is excluded, by the way. Also, the Pixel 7a, Pixel 8a, Pixel Fold, and Pixel 9 Pro Fold can’t take advantage of Action Pan.\nTop Shot\nTop Shot has existed since the Pixel 3 series, but it hasn’t entirely made it outside the Pixel lineup. This feature shoots and analyzes up to 90 images before and after you press the shutter button. If you don’t have the fastest finger in the west and miss the right moment, Google will recommend better images. Top Shot is available for Pixel 3 or newer devices.\nFace Unblur and Photo Unblur\nThings are getting much smarter with the most recent Pixel devices, especially since the introduction of Google’s Tensor chipsets. These are made to improve artificial intelligence and computational photography, and they’ve proven to work amazingly.\nFace Unblur will improve sharpness, detail, and noise on detected faces. The camera will determine when motion blur is likely present, usually in darker or fast-moving environments. Similar to HDR, the camera will shoot multiple images, stitch them together, and use machine learning to improve image quality in faces.\nFace Unblur was introduced with the Pixel 6 series, but the Pixel 7 and 7 Pro took things to the next level. The newer handsets can now use Photo Unblur to improve the whole image, not just faces. The feature now also works on the Pixel Tablet. Furthermore, Pixel 7 series or newer phones can improve any image through Google Photos. Even ones shot with non-Pixel phones!\nMagic Eraser\nMagic Eraser takes advantage of Google’s Tensor technology to remove unwanted objects from images. You can easily access it while editing an image on Google Photos. Just go to Tools > Magic Eraser. You can draw a circle around objects to select them, and the system will remove selected objects and do its best to replace them based on the surroundings.\nMagic Eraser used to work on Pixel 6 or newer Google devices, and it needed the Google Photos app. Since it’s technically a Google Photos feature, though, Google has given the option to all Google One subscribers using Android or iOS.\nNotably, with the Pixel 8 series, Google also introduced Audio Magic Eraser, which lets you remove unwanted audio from videos.\nVideo Boost\nA feature unique to the Pixel 8 Pro and Pixel 9 Pro variants, Video Boost makes full use of the phone’s Tensor chipset and the powers of computational photography.\nThe feature employs cloud computing power to improve the quality of your videos. Clips are uploaded and processed; once it’s ready, you can download the clip again. Unlike most other photography Pixel features, Video Boost requires an internet connection, so be aware that it could put a serious dent in your data plan.\nBest Take\nHere’s a great feature that’ll make group shots a little easier. Best Take snaps multiple photographs of a group and combines those into one in which everyone looks their best.\nThis feature should negate the need to retake shots, especially if one person has their eyes closed or another is blurry. The Pixel 8 or newer phone looks through the images and merges them into one in which each person looks great.\nUse your Pixel as a webcam for your PC\nHave you seen iPhone owners using their smartphones as webcams? This feature is now available for Android users, too! You can use your Pixel phone as a webcam if you connect it to your computer via a data-supported USB cable. All you have to do is connect your Pixel phone to the computer, and then select the webcam option on your device USB connection options.\nThis can make your video quality much better, as computer webcams are known for being pretty bad. It’s available on Pixel devices running Android 14 or later.\nAdd Me\nWith the Pixel 9 series, Google introduced a really cool feature called Add Me. Have you ever had to ask a stranger to take a group picture so you can come out on it? Add Me fixes this by allowing you to combine two images, one taken by you and another taken by another person in your group. Your Pixel phone will put them together to have everyone in the frame!\nFor now, Add Me is only available on Pixel 9 devices.\nLauncher Pixel features\nCinematic and Emoji wallpapers\nCinematic and Emoji wallpapers came to the latest Pixel devices in the June 2023 feature drop update. These can make your home screen much more fun and interactive, allowing you to customize your wallpapers at a more personal level. You can learn how to use cinematic wallpapers and how to create Emoji wallpapers in our dedicated guides.\nCinematic wallpapers are available for Pixel 6 or newer devices. As for Emoji wallpapers, you’ll need a Pixel 4a or newer.\nSelect images and text from the Overview screen\nThis feature often goes unnoticed, but it becomes beneficial once you realize it’s there. If your phone runs Android 11 or newer, you can use Smart Selection to highlight and interact with text and images within the Overview interface (app switcher). You can copy, download, search, and share content. Simply open the Overview interface and long-press on any image or text to start interacting.\nThis feature is actually supposed to work on non-Pixel phones too, but such isn’t always the case. It’s more of a hit-or-miss situation. This is why we still consider it primarily a Pixel feature.\nAt A Glance\nWhile not a Pixel-specific feature, these Google devices work best with the At A Glance widget. This is because At A Glance is baked right into the Pixel Launcher, and improvements often come to Pixel phones first.\nAt A Glance is an interactive widget that can intelligently change based on the information that’s important. It will usually display the weather, but it can also showcase music, calendar smart home, fitness, and other information.\nUniversal search\nGoogle’s Pixel Launcher got a very neat upgrade with Android 12. The search bar is now universal, which means you can use it to search everything the device has access to. This includes apps, contacts, settings, content, and the web, among other things.\nApp Suggestions\nHaving a set of apps organized in the UI offers consistency, but life is more complex than that. Some apps you use during certain times, at certain locations, and under specific circumstances. This is why the Pixel Launcher introduced App Suggestions. These can be displayed on the bottom row of the home screen, or the top row of the app list. Apps displayed in these sections will alternate and change intelligently.\nQuick Tap\nThis is likely one of the coolest Pixel features we’ve seen come to Google devices in recent years. Quick Tap gives functionality to the back of a Pixel phone. You can customize actions to take whenever you tap on the back of a Pixel phone twice. You can make it take a screenshot, access your digital assistant, play/pause media, show notifications, see recent apps, or open an app.\nYou will need a Pixel 4a with 5G or newer Pixel to use this feature.\nOther Pixel features\nPixel Screenshots app\nThe Pixel Screenshots app is exclusive to the Pixel 9 series and is an excellent tool for screenshot-takers. The app collects all your screenshots and organizes them in an easy-to-navigate UI. It is powered by AI, so you can search for screenshots by topic. For example, you could search for “screenshots of food,” and get all related content.\nGoogle Recorder speaker labels\nThe Google Recorder app is excellent for those who want to record audio and get transcripts of conversations, but the app still has a long way to go. The latest improvements are a step in the right direction. It’s available for Pixel 6 series and newer Pixels, including the Fold. It also only supports the English language.\nWhen recording conversations, Google Recorder can recognize different speakers and label them.\nGoogle Assistant Quick Phrases\nDo you get tired of saying, “Hey, Google,” whenever you want to use Google Assistant? I know I do. This is why we love the Quick Phrases feature available on Pixel 6 series smartphones or newer. Nest Hub Max users can also take advantage of it, as well as those with Pixel Buds Pro earbuds. It’s also only available in English, French, German, Italian, Japanese, and Spanish.\nQuick Phrases make it possible to say commonly used commands to Google Assistant without using the hot word. You can access the settings by going to Google app > Avatar > Settings > Google Assistant > Quick phrases.\nThe feature only works in a couple of situations, though. You can use it to stop or snooze an active alarm, or to answer, decline, or silence incoming calls.\nGoogle Assistant voice typing\nThis Pixel-only feature is available for anyone with a Pixel 6 or newer, running at least Android 12. Users with supported Pixel phones can now say, “Hey, Google. Type.” You can now start dictating what you want the Assistant to type.\nAdditionally, the feature offers a much smarter voice typing experience than your typical voice-to-text services. You can make requests such as “delete the last work,” “clear all,” or “Next” to move to the next text field. With the Pixel 8 series, Assistant offers better proofreading when dictating through Gboard.\nExtreme Battery Saver\nExtreme Battery Saver mode has been available on all Pixel phones since the Pixel 3. Google showed off its capabilities with the Pixel 7, mentioning it can extend battery life to 72 hours.\nWhat happens when Extreme Battery Saver is turned on? A series of things get modified within the phone. For starters, most apps will pause. The CPU will also slow down, the hotspot will turn off, the screen timeout will drop to 30 seconds, and Wi-Fi/Bluetooth scanning will shut off.\nPersonal Safety app\nThe Personal Safety app helps keep users safe. You can store emergency contact info in it. The app can detect crashes and contact emergency services when necessary. You can also turn on SOS mode to record video, alert contacts, and contact authorities. It’s available for Pixel 4a or newer Pixel phones.\nLive Translate\nLive Translate makes it possible to easily decipher chat, calls, media, real-world text, and in-person conversations. It doesn’t require you typing, copying, or anything else. Additionally, it is available on non-Pixel devices, too, but on Pixel 6 and newer devices, it is made to take advantage of the Tensor chipset to do most of the processing locally. Other devices will depend on an internet connection to let Google do all the work server-side.\nCircle to Search\nThis was actually a Samsung Galaxy S24 feature, but Google introduced it with the Pixel 8 series, too. Currently, it is available to Pixel 6 and newer devices. Circle to Search allows you to long-press the home button or on the navigation bar. After this, you can circle, highlight, tap, or scribble over the content on your screen. The info will be sent to Google Search.\nGoogle actively adds Pixel features every time it issues a Pixel Drop, so expect this list to expand in the future. If you consider yourself a true Pixel enthusiast, you may be interested in joining the Pixel Superfans program, too.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/news/",
      "text": "News\nAudioComputingGamingGeneral technologyMobileSmart homeStreaming and entertainmentWearables and health\nOne of Microsoft’s best-rated mobile apps is bowing out soon\nThe Microsoft Lens PDF scanner app for Android and iOS is on borrowed time.\nMatt Horne\nOnePlus 13 gets its own version of Google's Best Take\nRyan McNeal1 hour ago\n0\nGoogle wants you charting your meme coins right on its Finance page\nMatt Horne2 hours ago\n0\nGame over: Chrome OS pulls the plug on Steam gaming\nStephen Schenck2 hours ago\n0\nMassive Pixel leak spoils everything ahead of Google launch event\nGoogle may have nothing left to reveal after this Pixel hardware leak.\nRyan McNeal\nBig Galaxy S26 changes, even bigger Android changes | Authority Insights Podcast #001\nMishaal Rahman4 hours ago\n0\nIs Google Messages crashing for you? You're not alone. (Update: Fixed!)\nHadlee Simons4 hours ago\n0\nWear OS users are spotting a new kind of Google Wallet pass (Update: More confirmation)\nMatt Horne4 hours ago\n0\nOur latest\nThis app lets Mac users take full advantage of Android's Quick Share with new QR code support\nRyan McNeal5 hours ago\n0\nGalaxy S26 Ultra leak hints at a serious upgrade for power users\nMatt Horne5 hours ago\n0\nYou can apparently buy Google's official Pixel Tablet stylus that never launched\nStephen Schenck5 hours ago\n0\nVisible is finally rolling out a family plan feature, well sort of\nAndrew Grush6 hours ago\n0\nSay goodbye to tab overload with Samsung's latest Browser feature\nRyan McNeal7 hours ago\n0\nGoogle says a fix for Gemini's shame spiral is on its way\nMegan Ellis8 hours ago\n0\nThe end is near for flagships with a meagre 128GB storage\nAamir Siddiqui9 hours ago\n0\nPixel 10 Pro lineup smiles for the camera in new video leak, alongside Pixel Watch 4\nTushar Mehta9 hours ago\n0\nAndroid 17 codename: Our survey reveals your top dessert choice\nAamir Siddiqui11 hours ago\n0\nSamsung bashes Chinese watches, says it's already working on Galaxy Watch 9, 10\nTushar Mehta12 hours ago\n0\nSurvey reveals more of you need to shop around for carriers, you're missing out\nHadlee Simons13 hours ago\n0\nVerizon wants to win back your loyalty with damage control discounts\nAamir Siddiqui13 hours ago\n0"
    },
    {
      "url": "https://www.androidauthority.com/oneplus-ai-suite-announcement-3561441/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nOnePlus phones are getting AI tools that are bound to make Galaxy and Pixel fans jealous\nMay 27, 2025\n- OnePlus has announced a new set of AI-powered tools that will soon be available on its devices.\n- These include a consolidated text, voice, camera-based, and screen translation tool, as well as an advanced search feature.\n- The OnePlus AI suite also includes localized tools to help users record, summarize, and translate calls and offer real-time call translations.\nEarlier this year, OnePlus confirmed plans to replace the alert slider with a customizable button on future phones. At the time, the company’s CEO, Pete Lau, said this new button would allow users to switch sound profiles without waking up the device and offer a few additional features. OnePlus has now revealed that the customizable button, the Plus Key, will debut on the upcoming OnePlus 13s and let users switch sound profiles, launch the camera, initiate translation, start recordings, or activate the new AI Plus Mind feature.\nAlong with details about the Plus Key, OnePlus shared that its stock apps will soon offer Gemini integrations and announced a new suite of AI-powered tools for its devices. The OnePlus AI suite includes a few familiar features we’ve already seen on devices from Google and Samsung, like text, voice, camera-based, and screen translations, but all consolidated into one tool, and advanced search capabilities with support for natural language queries. In addition, it brings a couple of unique features tailored to regional audiences that should help set it apart.\nOnePlus’ AI VoiceScribe feature, for instance, will let users record, summarize, and translate calls and meetings directly within popular messaging, video, and online meeting applications. On the other hand, its AI Call Assistant feature will allow users to get automatic call summaries or real-time call translations in the OnePlus Dialer app. Unfortunately, these features will only be available in India, and OnePlus hasn’t shared plans for a broader release.\nThe OnePlus AI suite will also offer an AI Reframe feature to help users capture better photos. The company claims this feature will intelligently analyze the scene, identify the subject, and adjust the composition, giving users multiple framing options for a better shot. Later this summer, OnePlus will also add an AI Best Face 2.0 feature to the suite, which will enhance group photos by automatically correcting closed eyes or weird expressions.\nAlthough OnePlus’ AI tools aren’t drastically different from the ones found on Google and Samsung phones, the consolidated translations feature and region-specific tools could give its devices a slight edge. We can’t wait to try these features and share our thoughts on whether OnePlus’ approach is a hit or a miss.\nThank you for being part of our community. Read our Comment Policy before posting."
    }
  ],
  "argos_summary": "OnePlus has begun rolling out a software update for the OnePlus 13, introducing the AI Perfect Shot feature, which allows users to replace undesirable facial expressions in photos with more favorable ones, similar to Google's Best Take tool. The update also includes enhancements such as a soft light filter for portrait modes, high-resolution video exports, and the ability to hide specific album contents. This rollout aligns with OnePlus's earlier announcement of new AI tools for its devices, aimed at improving photography and user experience.",
  "argos_id": "JWHQU6XD4"
}