{
  "url": "https://techcrunch.com/2025/08/08/softbank-reportedly-bought-foxconns-ohio-factory-for-the-stargate-ai-project/",
  "authorsByline": "Sean O'Kane",
  "articleId": "81b788945c9249528e29b12d7255b48d",
  "source": {
    "domain": "techcrunch.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://techcrunch.com/wp-content/uploads/2019/05/GettyImages-956434664.jpg?resize=1200,836",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T16:00:51+00:00",
  "addDate": "2025-08-08T16:15:29.148039+00:00",
  "refreshDate": "2025-08-08T16:15:29.148041+00:00",
  "score": 1.0,
  "title": "SoftBank reportedly bought Foxconn's Ohio factory for the Stargate AI project",
  "description": "Foxconn spent years promising electric vehicles would be built at the former Chevy Cruze factory. Now it will make AI servers.",
  "content": "The mystery buyer of the former General Motors factory owned by Foxconn in Lordstown, Ohio is apparently SoftBank, according to Bloomberg News. SoftBank wants to use the factory to build AI servers as part of the Stargate data center project being spearheaded by the Japanese conglomerate, OpenAI, and Oracle.\n\nThe report comes just a few days after Foxconn announced it had sold the factory, along with electric vehicle manufacturing equipment that was inside of it, to a buyer it only referred to as “Crescent Dune LLC” — an entity that was created in Delaware in late July. Neither company immediately responded to requests for comment.\n\nIt’s unclear what this means for Monarch Tractor, a California-based startup that develops electric and autonomous farm equipment. Monarch was the lone customer of Foxconn’s contract manufacturing operation at the Ohio factory, after the other three of the Taiwanese tech giant’s prospective customers went bankrupt. Monarch CEO Praveen Penmesta has not responded to emailed requests for comment.\n\nSoftBank, OpenAI, and Oracle announced the Stargate project one day after Donald Trump’s inauguration. The effort currently involves a large data center that is being built in Texas, but the companies involved have said they want to build infrastructure in other states and countries. In May, Bloomberg reported that SoftBank was struggling to line up funding for the project, and that it was already being hampered by Trump’s myriad trade wars.\n\nFoxconn bought the factory in late 2021 from electric vehicle startup Lordstown Motors. At the time, Foxconn chairman Young Liu said his company wanted to develop the site into the “most important electric vehicle manufacturing and R&D hub in North America.”\n\nThe sale closed in 2022 and, one year later, Lordstown Motors filed for bankruptcy. Prospective customers like Fisker Inc. and California startup IndiEV also went out of business.",
  "medium": "Article",
  "links": [
    "https://techcrunch.com/2025/08/04/foxconn-sells-former-gm-factory-to-mystery-buyer-after-failing-to-make-evs/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "electric vehicle startup Lordstown Motors",
      "weight": 0.10939704
    },
    {
      "name": "electric vehicle manufacturing equipment",
      "weight": 0.097157165
    },
    {
      "name": "Foxconn chairman Young Liu",
      "weight": 0.08344563
    },
    {
      "name": "Lordstown Motors",
      "weight": 0.083117686
    },
    {
      "name": "California startup IndiEV",
      "weight": 0.08123222
    },
    {
      "name": "Foxconn",
      "weight": 0.077654004
    },
    {
      "name": "Prospective customers",
      "weight": 0.073840335
    },
    {
      "name": "Monarch CEO Praveen Penmesta",
      "weight": 0.07322524
    },
    {
      "name": "General Motors",
      "weight": 0.06927332
    },
    {
      "name": "Monarch Tractor",
      "weight": 0.06858959
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Business"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9970703125
    },
    {
      "name": "/News/Technology News",
      "score": 0.921875
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.79443359375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.4970703125
    }
  ],
  "sentiment": {
    "positive": 0.062194824,
    "negative": 0.5605469,
    "neutral": 0.37695312
  },
  "summary": "SoftBank is reportedly the mystery buyer of Foxconn's former General Motors factory in Lordstown, Ohio. The Japanese conglomerate plans to use the factory to build AI servers as part of the Stargate data center project, led by OpenAI, and Oracle. This comes after Foxconn announced it had sold the factory, along with electric vehicle manufacturing equipment, to a buyer it only referred to as “Crescent Dune LLC” in Delaware. It is unclear what this means for California-based startup Monarch Tractor, which was the sole customer of the contract manufacturing operation at the Ohio factory. The Stargate project involves a large data center currently being built in Texas, but the companies plan to build infrastructure elsewhere.",
  "shortSummary": "SoftBank has reportedly bought Foxconn’s Ohio factory to build AI servers for the Stargate data center project, amid ongoing financial struggles and potential bankrupts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "423888a268714e2fbcdf031c21b306fc",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://techcrunch.com/2025/08/04/foxconn-sells-former-gm-factory-to-mystery-buyer-after-failing-to-make-evs/",
      "text": "Foxconn has sold the former GM factory it has owned for three years after failing to stand up any meaningful, large-scale electric vehicle production there.\nThe pivot marks the second major failure of Foxconn to deliver on its promises to help revive U.S. manufacturing. The iPhone-maker once promised to build a giant LCD factory in Wisconsin — a project that Donald Trump called the “eighth wonder of the world” during his first term — and wound up underdelivering to an extreme degree.\nFoxconn says the buyer is an “existing business partner” named “Crescent Dune LLC,” an entity that was created in Delaware just 12 days ago, according to records filed with the state. Matt Dewine, a spokesperson for Foxconn, declined to say more about the buyer.\nFoxconn sold the factory and land for around $88 million and machinery and equipment from its EV subsidiaries for around $287 million, Taiwan stock exchange filings show.\nA Foxconn representative told Automotive News the company will remain “involved in the manufacturing of products for customers at the Lordstown facility” and claimed it is “committed to customers and suppliers” in the automotive industry. But The Wall Street Journal reported Monday that Foxconn now plans to build AI servers at the factory. Dewine did not immediately respond to a request for comment on the report.\nFoxconn announced the deal to buy the former GM plant in 2021 for $230 million, when it was still owned by EV startup Lordstown Motors. At the time, Foxconn Chairman Young Liu said it was going to be the “most important electric vehicle manufacturing and R&D hub in North America.”\nWhile Foxconn was developing EVs of its own in Asia, it was also focused on contract manufacturing in the United States. And, in short order, three of the electric vehicle companies Foxconn hoped would occupy the factory went bankrupt.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.\nFoxconn actually built a few EVs at the factory for the now-defunct Lordstown Motors. But the Taiwanese electronics giant wound up in a bitter fight with that troubled EV startup. Lordstown Motors filed for bankruptcy in June 2023, and accused Foxconn — which had become an investor in the startup — of “starving it of cash,” and said it “maliciously and in bad faith destroyed that business.”\nFoxconn also took a flier on a small EV startup called IndiEV, claiming it would build its electric SUV at the Ohio factory. IndiEV filed for bankruptcy in October 2023 with less than $3 million in the bank. Foxconn was supposed to build EVs for Fisker Inc. as well. Fisker filed for bankruptcy in June 2024.\nA fourth company, Monarch Tractor, has not had much of an impact, with Foxconn making no more than a few hundred electric tractors. Monarch’s CEO, Praveen Penmetsa, did not respond to an emailed request for comment about whether its tractors will continue to be built in Ohio."
    }
  ],
  "argos_summary": "SoftBank is reportedly the mystery buyer of the former General Motors factory in Lordstown, Ohio, previously owned by Foxconn, intending to use it for AI server production as part of the Stargate data center project. Foxconn sold the factory after failing to establish significant electric vehicle production, with its previous customers, including Lordstown Motors and IndiEV, going bankrupt. The sale included the factory for approximately $88 million and EV manufacturing equipment for around $287 million, raising questions about the future of Monarch Tractor, the last remaining customer of Foxconn's operations at the site.",
  "argos_id": "JYMFGMCWB"
}