{
  "url": "https://www.forbes.com/sites/johnwerner/2025/08/08/getting-closer-to-ai-internet-protocols/",
  "authorsByline": "John Werner",
  "articleId": "2c11849cc93c4c249a8ce540b8ff3057",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/68969cf3f96fd6d804d981f6/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-09T00:58:45+00:00",
  "addDate": "2025-08-09T01:07:16.025559+00:00",
  "refreshDate": "2025-08-09T01:07:16.025561+00:00",
  "score": 1.0,
  "title": "Getting Closer To AI Internet Protocols",
  "description": "As agentic AI keeps evolving, it’s key to imagine a decentralized Internet with agent protocol",
  "content": "It’s an important time for connectivity with artificial intelligence.\n\nYou might say that 2024 was the year of finding out about AI’s agentic capabilities – although you could maybe argue that most execution has been within the last six months, 2024 was a blizzard of recognizing benchmarks – wait, AI can do that? And then: it can do that too?\n\nNow that we know all of this, as agents are getting more deployable and more frequently deployed, it’s more relevant to look at how they will work, how they will connect to each other.\n\nI’ve written before about how people at MIT are pioneering the NANDA (Networked Agents and Decentralized AI) protocol for connecting online AI agents, but to be honest, now seems like a better time to be scrutinizing these kinds of plans. Sure, the work on NANDA takes place in the context of other protocols like A2A and, famously, MCP, but since those other projects are tied to leading AI companies, why not involve academia in something so central to future interface design?\n\nMIT is also assisted by many partners in setting up the idea of NANDA to handle future intelligence Internet traffic. Here’s what Dr. Harrick Vin at Tata Consultancy Services has to say:\n\nWe are rapidly entering a world where AI systems will be built using a decentralized network of AI agents, potentially traversing organizational boundaries. The design of such systems demands open protocols to discover, build trust, integrate, orchestrate, and exchange value among a network of intelligent agents. TCS is excited to support and contribute to MIT's decentralized AI program NANDA aimed at realizing this vision.\n\nOther businesses, like Mitsubishi Electric, are also involved.\n\nI saw an interesting kind of comparison from Abhishek Singh, someone close to this project, at a lightning talk presentation at Imagination in Action’s event in April.\n\nSingh talked about how humans are a “social animal” and how that helped them to stand out from other primates. (Not that monkeys aren’t social, but…) What I thought was interesting was a chart, comparing inputs and components of the success of the species, to the development of the Internet, and then to AI…\n\nNote how the AI part just has ? ? ?\n\nEventually, Singh populates this part of the chart with things like MCP, Coupon Protocol, and registry design, showing how we might be able to evolve our technology to accommodate all of those intelligent agents that will be running around on the web, doing so many things on our behalf.\n\nAs for coupons, here’s how Singh breaks down this concept:\n\n“In the Internet stack, we have the website, (and) we have hyperlinks that allow us to go from one page, one web page, to another web page, and so on,” he says. “That hyperlink creates the web out of fragmented websites. Now we can index the web. We can search on the web. We can build reputation engines, we can build Google search, and so on.”\n\nThen he discusses the similarity to coupons:\n\n“What does it mean to build a hyperlink for the agents? We have a proposed protocol for this, this notion of our concept of coupons … these coupons are verifiable. We'll go into the details of privacy and authenticity later. But these interaction coupons are allowing you to capture the faces of how the knowledge is spreading across these areas. And as I said, you can use these coupons, then, to build services on top, which are replication, search, context, and so on.”\n\nMidway through explaining all of this, he spoke to some of the enduring obstacles of getting all of this together:\n\n“There are some practical challenges in the world of agents that you have to acknowledge,” he said, “and we have to understand that genius won't solve them.”\n\nAt the same time, Singh suggested, progress has been made.\n\n“We are just getting started,” he said. “I would say we have made two contributions. One is (the) protocol and architecture layer, and the other contribution is actual application to demonstrate the potential. So the applications are very opinionated, when the protocols are very lightweight and flexible.”\n\nOther lightning talks on the subject included Andrea Ridi talking about his years of work on startups, and the need to equip agents with what they need to function. My colleague Ramesh Raskar weighed in, too, as he’s been very involved in NANDA, and a researcher named Cameron Dennis went over the work of some colleagues on a company called NEAR that is working on NANDA-related concepts.\n\nLooking at all of this, you start to get a picture of how this is going to work. Early speculative notions of web3, the semantic web, were often limited to a protocol like JSON for code porting, but now we have AI agents actually doing things online. How could that not be a game-changer for a previously established worldwide global network that runs so much of our societies across the board?\n\nStay tuned as a new Internet continues to develop.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "AI Internet Protocols",
      "weight": 0.08836363
    },
    {
      "name": "AI agents",
      "weight": 0.085500844
    },
    {
      "name": "other protocols",
      "weight": 0.0823868
    },
    {
      "name": "online AI agents",
      "weight": 0.08119698
    },
    {
      "name": "intelligent agents",
      "weight": 0.0730871
    },
    {
      "name": "agents",
      "weight": 0.069243826
    },
    {
      "name": "Other lightning talks",
      "weight": 0.06754641
    },
    {
      "name": "open protocols",
      "weight": 0.06698606
    },
    {
      "name": "leading AI companies",
      "weight": 0.06395459
    },
    {
      "name": "AI systems",
      "weight": 0.06376787
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.9482421875
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.93115234375
    }
  ],
  "sentiment": {
    "positive": 0.37719727,
    "negative": 0.14587402,
    "neutral": 0.47705078
  },
  "summary": "The article discusses the progress made towards connectivity with artificial intelligence (AI) using the NANDA (Networked Agents and Decentralized AI) protocol. MIT is pioneering this protocol and is assisted by many partners including Tata Consultancy Services, Mitsubishi Electric, and Andrea Ridi. The concept of these protocols is likened to coupons, which allow users to use information from the web to create services on top. The article also discusses the potential applications for these protocols, which are lightweight and flexible.",
  "shortSummary": "The next generation of AI agents will be distributed distributed networks of intelligent agents, driven by advancements in AI-related technology, though challenges remain unsolved despite advancements.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e2bb7779083941a48912eca2f0d7c6d3",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "2024 marks a pivotal year for artificial intelligence, particularly in recognizing its agentic capabilities and the need for connectivity among AI agents. MIT is leading the development of the NANDA protocol, which aims to facilitate decentralized networks of AI agents, supported by companies like Tata Consultancy Services and Mitsubishi Electric. The concept of 'interaction coupons' is proposed to enable AI agents to communicate and function effectively, drawing parallels to hyperlinks in the early Internet. As these technologies evolve, they promise to transform how AI interacts within the global network.",
  "argos_id": "KCX63F9QK"
}