{
  "url": "https://www.cnet.com/home/cant-stand-cicada-season-heres-how-im-going-to-handle-the-cicada-ruckus-this-year/",
  "authorsByline": "Jen Karner",
  "articleId": "571b9b270c754eecbc37575c2a833c78",
  "source": {
    "domain": "cnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.cnet.com/a/img/resize/9c6c18c7e319ff991ff47c9543d911099fcf9783/hub/2024/01/22/3bcfcc2b-f6f5-418c-8ff6-ec7884b42896/gettyimages-1288861959.jpg?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T09:02:00+00:00",
  "addDate": "2025-08-08T09:13:11.244759+00:00",
  "refreshDate": "2025-08-08T09:13:11.244760+00:00",
  "score": 1.0,
  "title": "Can’t Stand Cicada Season? Here’s How I’m Going to Handle the Cicada Ruckus This Year",
  "description": "Cicadas are persistent pests and make a lot of noise. Here's what you need to know about where they're emerging this year, and how you can deal with the noise without losing your mind.",
  "content": "Cicadas have been annoying for as long as I can remember. The first time I remember them showing up in Maryland was when I was a teenager. Big, noisy bugs with red eyes, and they were absolutely everywhere. I remember cicadas invading everything with that incessant noise -- everywhere from my grandparents' pool, to the inside of my best friend's truck, flying into windows and doors. However, the fact that they take over the trees isn't the biggest problem with cicadas. The bigger issue is the skull-throbbing noise they make, which just doesn't seem to stop. Their constant shrill buzz can be as loud as a chainsaw. As someone who can't deal with a lot of noise and gets overstimulated, I find a quality pair of noise-cancelling headphones to be a lifesaver to help me drown out the cacophonous racket.\n\nWe're just past the thick of cicada season brood XIV (14) now -- which ran from May through June, but these noisy bugs are still around. Every few years, they tend to climb up from the ground and swarm in several eastern states before they mate, die off, and disappear again. Brood XIV won't appear again after this year, until 2037.\n\nWe usually expect cicadas to be the reason for noise complaints throughout the beginning and middle of summer, but 2025 is going to see even more of those. This year, we're seeing The Greater Eastern Brood, which is gigantic, with billions of these flying bugs emerging. Billions! It's the oldest brood in the US, and it has hit 13 states, including Tennessee and Georgia, where they're currently being spotted -- or heard.\n\nDon't bug spray cicadas. Do this instead (sorry)\n\nYour immediate reaction to cicadas might be to try and eliminate them from your yard. We don't recommend it. Cicadas are a temporary pest and after a few weeks they'll disappear back underground. They aren't a threat to humans at all and they aren't able to chew their way into the house like termites.\n\nAdditionally, pesticides don't work well on cicadas. Trying to spray them down won't do any good and could instead damage your yard or local pollinators. The best thing to do is to try to ignore them until they finish their life cycle.\n\nThe bigger problem for some people is the constant noise that cicadas make while they are above ground. It's a relentless buzz and, once the cicadas arrive, it won't stop until they die off again. If the never-ending noise drives you bonkers, grabbing a quality pair of noise-cancelling headphones can make a major difference to your quality of life -- or at least to mine. Really.\n\nWhy are cicadas so loud?\n\nHere's what's happening: Male cicadas make noise to attract females they can mate with -- the more cicadas in an area, the louder it will be. Noise levels have reached more than 100 decibels in some areas, which means if you plan to spend time in the garden, it's a good idea to snag some earplugs to protect your hearing.\n\nWait, what are cicadas again?\n\nCicadas are flying bugs that emerge from the ground periodically to mate and then disappear again. They measure 1 to 1.5 inches long, with wings that stretch twice that length. Their bodies are black, with red-brown eyes and orange veined membranous wings.\n\nThere are 15 broods of cicadas and each has its own life cycle, generally either 13 or 17 years. Brood XIV, the cicada brood emerging in 2025, is a 17-year brood. That means the last time we saw this particular band of insects was in 2008.\n\nHow many cicadas are expected in 2025?\n\nThe 2025 brood is also called the Greater Eastern Brood and it's the second-largest brood of periodic cicadas. They're outdone only by Brood XIX, aka the Great Southern Brood, which emerged in 2024. While there aren't exact numbers on how many cicadas we can expect this year, we do know that Brood XIV is massive.\n\nIt's also one of the oldest broods in the US. This particular brood was first spotted in Plymouth, Massachusetts, in the 1600s, and it's the brood that spawned all the other 17-year broods. With that in mind, we can estimate that at least several million in certain areas, and possibly over a trillion total cicadas will emerge in 2025.\n\nWhich states will be affected by cicadas in 2025?\n\nEach cicada brood has its own geographical location, which means they don't all appear in the same place. In 2025, there are 13 states that will be affected; Georgia, Indiana, Kentucky, Maryland, Massachusetts, New Jersey, New York, North Carolina, Ohio, Pennsylvania, Tennessee, Virginia and West Virginia.\n\nDo I need to protect my trees from cicadas?\n\nWhile cicadas aren't harmful to people, that same doesn't go for trees. Female cicadas like to lay their eggs on trees where new leaves are located, which can damage branches and cause withering and snapping. While mature trees should be able to withstand this damage without problems, younger trees can be vulnerable and should be protected.\n\nIf you're worried about cicada damage, you have a few options. You can wrap tree trunks and areas where twigs meet branches with cheesecloth, tape and even use landscaping nets around smaller trees. A CNET guide from 2021 explains more about how you can protect trees from cicada damage.\n\nWhen do cicadas appear, and how long do they stick around?\n\nWhile cicadas are a serious pest when they arrive, they don't last long. They'll mostly emerge in May and then stick around for 5 to 6 weeks before they die off. By mid-summer, just in time for the Fourth of July, the cicadas should be gone or at least on their way back underground for another 17 years.\n\nCicadas emerge when the soil 8 inches below ground reaches 64 degrees Fahrenheit. Above-ground temperatures will need to reach the 70- to 80-degree range before the soil will warm up enough, although a warm rain can warm the ground faster. There already have been sightings in Tennessee this year but most of the brood probably won't arrive for a few more weeks.\n\nThe simple answer is, yes. Cicadas can be eaten and people have been doing it for centuries.\n\nNative American populations, like the Onondaga Nation, have long viewed the flying insect as a valuable food source. However, eating cicadas does come with risks. Cicadas are related to shrimp and lobster, which means eating them is not recommended if you have a seafood allergy.\n\nCicadas aren't dangerous to pets either, which means if your dog snacks on cicadas it should be fine.\n\nFor centuries, cicadas have slept underground, emerging only once every 13 to 17 years to mate before disappearing again. While plenty of research has been done on these flying insects, cicadas react to the temperature around them and emerge on a schedule that is triggered by the warmth of the ground.\n\nAs the planet continues to heat up, the timing of cicadas has started to change. We may soon see a significant change in the life cycle of cicadas. As the temperatures rise, 17-year cicadas could become 13-year cicadas, changing the timeline on when we will see them.\n\nWhile cicadas might be inclined to move further north, it's not an easy process. They can only migrate during their above-ground cycle of life. Because they only emerge for a few weeks at a time and aren't prone to flying long distances, any shift in their geographical locations would occur slowly during their emergences.\n\nHow you can help cicada researchers\n\nResearchers spend time with each brood when it emerges to study its life cycle and track when and where they emerge. However, scientists don't have the time or resources to be everywhere that cicadas appear.\n\nThat's where regular folks come in.\n\nCicada Safari is a free app for Android and iOS that lets you take photos of cicadas and upload them to the app. Using geolocation on those uploaded images, scientists can track a larger number of cicadas. Your photos of these flying bugs in your backyard can help scientists to understand them better, filling in holes in their research.",
  "medium": "Article",
  "links": [
    "https://www.cnet.com/home/kitchen-and-household/what-you-need-to-know-if-your-dog-snacks-on-cicadas/",
    "https://www.cnet.com/health/medical/best-earplugs-to-prevent-hearing-loss/",
    "https://www.cnet.com/tech/mobile/best-noise-canceling-headphones/",
    "https://www.cnet.com/culture/internet/you-can-eat-cicadas-but-be-careful-if-you-have-seafood-allergies-fda-warns/",
    "https://play.google.com/store/apps/details?id=edu.msj.cicadaSafari&hl=en_US&gl=US",
    "https://www.cnet.com/home/yard-and-outdoors/the-cicadas-are-coming-how-to-prep-your-lawn-trees-and-yard-for-brood-x/",
    "https://apps.apple.com/us/app/cicada-safari/id1446471492"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "cicada season brood",
      "weight": 0.1126724
    },
    {
      "name": "Cicadas",
      "weight": 0.112397544
    },
    {
      "name": "cicadas",
      "weight": 0.112397544
    },
    {
      "name": "cicada damage",
      "weight": 0.110202305
    },
    {
      "name": "cicada researchers",
      "weight": 0.10921817
    },
    {
      "name": "Male cicadas",
      "weight": 0.10768064
    },
    {
      "name": "periodic cicadas",
      "weight": 0.10753537
    },
    {
      "name": "Female cicadas",
      "weight": 0.10744167
    },
    {
      "name": "flying bugs",
      "weight": 0.06377544
    },
    {
      "name": "Each cicada brood",
      "weight": 0.06365883
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Pets & Animals/Wildlife",
      "score": 0.59765625
    },
    {
      "name": "/Science/Biological Sciences/Other",
      "score": 0.4482421875
    }
  ],
  "sentiment": {
    "positive": 0.039978027,
    "negative": 0.72509766,
    "neutral": 0.23461914
  },
  "summary": "Cicadas are noisy flying bugs that emerge from the ground periodically to mate and then disappear again, often causing significant disruption to everyday life. The Greater Eastern Brood, which is the oldest brood in the US, has hit 13 states, including Tennessee and Georgia, causing noise levels over 100 decibels in some areas. The author recommends ignoring cicadas from your yard and instead focusing on their life cycle, ignoring them until they finish their life. Cicadas are not a threat to humans and are not likely to chew their way into the house like termites. The article also discusses the potential impact of the Great Southern Broodod, or Brood XIV, emerging in 2025.",
  "shortSummary": "Cicadas are notorious for their incessant noise, prompting concerns about potential pesticide use, and advice from experts like myself to manage their nuisance.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "90eafb1a395b4f4c9fb330c56a883032",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnet.com/home/yard-and-outdoors/the-cicadas-are-coming-how-to-prep-your-lawn-trees-and-yard-for-brood-x/",
      "text": "It's time for the buzzing insects to emerge. Cicadas -- specifically a group known as Brood X -- are arriving by the trillions in parts of the Eastern US for the first time in 17 years. These insects emerge from underground for six-week lifespans, sometimes landing inside your home, and have the potential to wreak havoc on your smaller, young trees. You may also decide you don't like the look of the rising dirt mounds in your yard and beneath your plants that signal the brood's arrival.\nWhile cicadas do present some benefits, if insects give you the creeps, or if you've got new, expensive trees you've just planted, you may be wondering how to keep the critters away. While you've got limited time left before Brood X arrives, there are several preventative measures you can take to keep them off your young trees. And if they're already there, we've got ways to get rid of them.\nKeep reading to find out what you need to do to keep the periodical cicadas out of your trees this spring. We'll also tell you which chemicals or oils not to use -- and why you might even relent and let Brood X stick around. (Plus, here's what happens if your pet eats a cicada.)\nAdvantages of letting Brood X cicadas nest in your mature trees\nWhile Brood X cicadas are large (one or two inches long) and may be an annoyance, there are some ecological benefits to letting them do their thing uninterrupted, according to entomologists we spoke with. Once cicadas die, they decompose into the ground, which can benefit your trees and surrounding plants the following year by enriching the soil, Gene Kritsky, dean of the School of Behavioral and Natural Sciences at Mount St. Joseph University, told CNET.\nIn addition, the holes newly hatched cicadas burrow into the ground can help water the trees at a deeper level, as it's equivalent to aerating your yard, Kritsky added.\nWhen the adults reemerge in great quantities, they provide an additional food source to animals, such as birds, opossums, raccoons and even household pets.\nWrap your trees that are small and younger\nWhen female cicadas emerge, they'll look for areas to lay their eggs -- typically towards the edge where new leaves are located. They'll then puncture the branches and lay their eggs inside. They'll lay between 10 and 20 eggs every quarter of an inch -- they lay around 500 total, Kritsky said, which can cause leaves to wither and turn brown, and even snap.\nIf you've got trees that you don't want to see get damaged, loosely wrap them as a preventative measure. You can use cheese cloths, foil tape, barrier tape or sticky tape. You'll need to wrap around the tree trunk and where the twigs meet the branch, said Frank Meek, an entomologist and manager of technical services at pest controller Orkin. This will help prevent the female cicadas from laying eggs in your trees.\nYou can also use landscaping nets around smaller trees to prevent the cicadas from landing on the branches. You may want to hold off planting trees until they're gone, which could be June 20 or even later.\nWill cicadas hurt larger trees?\nCicadas can't cause much damage to your larger, mature trees. In fact, the older the tree is, the less amount of damage can be done, Meek said. Instead, it's more like the cicadas are pruning your trees, which can stimulate tree growth.\nWhat if cicadas are already nesting in your trees?\nIf cicadas have already emerged in your yard, there are several ways to get rid of them.\n- Spray them off your trees and plants with a water hose.\n- Use your hands to remove them (I know, it sounds gross).\n- Place sticky traps on your trees -- this will prevent them from moving any farther.\nWhat not to use to get rid of Brood X cicadas\nIf you're trying to get rid of cicadas, avoid using these items.\n- Pesticides: This isn't recommended or necessary, according to both Kritsky and Meek, because pesticides have no effect on migrating populations, such as the cicadas.\n- Essential oils: It would take loads of essential oils and a lot of maintenance in order to ward off cicadas.\n- Bleach: Bleach can slow plant growth, kill plants and leach into the soil, causing longer-term damage.\nHow to prevent cicadas from coming back\nWhen the eggs hatch in the trees, the baby cicadas -- known as nymphs -- fall from the trees and burrow themselves into the soil until it's their time to rise. Meek says keeping your yard well-manicured with no dirt spots can help prevent them from burrowing. You can fill in the bare spots with sod, seed or hay to protect and cover the ground to reduce the likelihood of the cicadas going back into the soil.\nFor more information, here's what to know about Brood X cicadas and pet safety. Also, there's a wearable insect pod that protects you from cicadas, if you're worried about them landing on your head."
    },
    {
      "url": "https://www.cnet.com/home/kitchen-and-household/what-you-need-to-know-if-your-dog-snacks-on-cicadas/",
      "text": "As a pet owner, I know the panic that sets in when your dog eats something it shouldn't, and each pet has its guilty pleasures. For my dog, that's cicadas. She digs them up and feasts on the small bugs before unceremoniously throwing them back up in the living room. Due to this addiction of hers, we have to strictly supervise her outdoor time during cicada season. When this started, I thought that my dog just had a strange proclivity for eating bugs. However, over the last few years, as we've seen major emergences of cicadas, I've realized this isn't actually a strange behavior. Dogs all over the country snack on these flying insects, and it's pretty common.\nI know firsthand how scary it can be the first time your dog eats a cicada, and if your pet happens to have a taste for an emerging brood, you may be worried about what could happen if they consume too many. That's why I spoke to two experts about everything to know about dogs eating cicadas. Read on to find out what you need to know about keeping your pet healthy this summer.\nFor more, here are 13 essentials for new dog owners.\nWhere will cicadas hatch in 2025?\nWhile 2025 isn't expecting the massive influx of cicadas that appeared last year when two broods emerged at the same time, it is still a major cicada emergence. This year Brood XIV will emerge, also known as The Greater Eastern Brood. It's the oldest brood of cicadas, first being noted in the 1600s in Plymouth, Massachusetts.\nThe Greater Eastern Brood shows up every 17 years, and will begin to emerge in May and last until mid-June. They will be most obvious in Tennessee and Kentucky, but they'll also be making an appearance in Georgia, Indiana, Maryland, Massachusetts, North Carolina, New Jersey, New York, Ohio, Pennsylvania, Virginia and West Virginia.\nSo… are cicadas dangerous for dogs to eat?\nNo, cicadas are not venomous or poisonous, nor do they bite or sting. These seasonal pests are simply loud and annoying. There's nothing you really need to worry about when it comes to you or your pets' safety.\nHowever, that doesn't mean that you should let your dogs go wild eating cicadas each summer. According to American Kennel Club veterinarian Jerry Klein, you really need to fret only if your pet begins acting strange. \"The shells can cause, potentially, some gastroenteritis\" and, \"in a worst-case scenario … could potentially be a blockage.\"\nGregory Lawson, from NC State's College of Veterinary Medicine, recommends considering a vet trip \"if the dog seems depressed, like is unusually quiet, less responsive than normal\" or if the dog is salivating at an extreme level.\nIn my experience, I have never had to take my dog to the vet, even after she's eaten multiple cicadas. She has typically thrown up and had a bit of a sensitive stomach for a couple of days after she's really gone to town on cicadas, but she has never exhibited any of the symptoms that Klein and Lawson mentioned.\nKlein recommends observing your pet for any abnormal behavior, particularly if your pet is repeatedly vomiting and is unable to hold any water down, and recommends calling your veterinarian if you have any questions or concerns.\nFor more, here are the best dog toys (according to dogs) and our picks for the best robot vacuums."
    },
    {
      "url": "https://www.cnet.com/health/medical/best-earplugs-to-prevent-hearing-loss/",
      "text": "Hearing loss is more common than you think, and it’s not just from concerts or loud jobs -- blasting music through your headphones or even frequent ear infections can take a toll. Thankfully, there are multiple ways to prevent this, and the easiest is by using a pair of good-quality earplugs. A good pair of earplugs can cut down noise, keep your hearing sharp and even save you money in the long run, especially if you opt for reusable, environmentally friendly options. From sleeping and flying to swimming, working or just dealing with noisy neighbors, there’s an earplug that’s got you covered. Our CNET experts compiled a list of the best reusable earplugs for all lifestyles and situations. And if you’re worried about your hearing, consider taking a hearing test to catch any issues early. Your ears will appreciate it.\nOur Picks\nWhat causes hearing loss?\nAccording to the Centers for Disease Control and Prevention, exposure to extremely loud sounds (anything over 85 decibels) for a prolonged period of time can cause hearing loss, even if it's a one-time thing. The CDC also says that the damage to the inner ear or auditory neural system is generally permanent. What that means is that you could potentially face some hearing loss from just one loud concert or football game. But it's not just those intensely loud sounds that harm our ear health. Even the noise pollution we interact with daily can harm your hearing. Pretty scary, right?\nIn fact, it's a common concern that comes up online from Redditors heading to a concert, and even practicing musicians trying to safeguard their hearing from the cacophony of rehearsals.\nRead more: Hearing Loss Is More Common Than You Think: 5 Signs You Should Get Tested\nI thoroughly tested each earplug during my daily routine, and I even took them to karaoke night to assess their performance in a loud environment.\nBest overall earplugs to protect your hearing in every setting\nFor loud concerts, noisy restaurants or deep work, I found the Minuendo Adjustable Lossless Earplugs, the most expensive on this list, to be the ideal earplug for all sorts of hearing protection. With the adjustable node on the side of each plug that reduces sound by from 7 decibels to 25 decibels, you can customize the level of sound protection to serve you in moderately loud to critically harmful-to-your-hearing environments.\nEditor's note: We gave the Loop Switch 2 an Editor's Choice Award over our best overall choice (Minuendo) as we found Loop to be suitable for most people and also worth the extra money over the other choices on this list. While it may not offer all the bells and whistles our best overall pick has, the Loop Switch 2 is a personal favorite.\nBest earplugs for hearing loss prevention\nPros\n- Variety of earplug tips\n- Easy to insert\nCons\n- Expensive\nThese are the everything earplugs, with a customizable node that you can adjust for your desired level of noise reduction and they come with 11 sets of ear tips and a carrying case. They are also conveniently magnetic, which is a thoughtful touch that makes them easier to keep track of.\nThe Minuendos were the most entertaining and environmentally versatile to use. You adjust the noise reduction node, which can reduce sound by 7 to 25 decibels, and hear the differences in sound reduction. While doing karaoke, these muffled the sound the best of all the earplugs I tried.\nNot everyone wants or needs earplugs costing over $150. Avid concert-goers, musicians or anyone looking to invest in hearing protection would reap the benefits of the Minuendos, absolutely -- and that's who these plugs were designed for. But someone who wants an earplug they can wear in any situation, from loud restaurants and social gatherings to concerts and noisy transit would enjoy these plugs as well. And that's not even considering how great they were at reducing the background noise of my office and apartment -- the AC unit became inaudible once I put these on and turned them to the highest noise-reduction setting.\nPros\n- Adjustable noise reduction for different environments (20 dB, 23 dB and 26 dB)\n- Sleek and lightweight design\n- Comes with multiple ear tip sizes for customized fit\nCons\n- Doesn't have a wide range of noise reduction\nThe Loop Switch 2 earplugs are a game-changer for anyone who needs adaptable hearing protection without sacrificing comfort and style. I like the adjustable noise-reduction feature, it has three levels: Quiet (26 dB), Experience (23dB) and Engage (20dB), which let you adjust how much sound you want to block out. Whether I'm in a noisy coffee shop trying to focus (I'd use the Engage level), at a concert (Experience level), or seeking protection from the loud New York City trains (Quiet level), I appreciate being able to control the levels without switching earplugs.\nBesides the practicality of these earplugs, the modern design is sleek and comfortable enough to wear for long periods. Unlike bulkier earplugs, these feel almost weightless, and the silicone tips create a snug but breathable seal. I also love that Loop offers a variety of colors (emerald, black, gold and silver -- my favorite is the emerald) and silicone tip sizes.\nPros\n- Easiest to insert and remove\n- Lightweight\n- Secure fit\n- Inexpensive\nCons\n- Less sound protection than other earplugs\nThis is one unfussy earplug. It was the easiest to use and insert into my ear, and it properly dampened the sounds of the busy New York streets where I was walking and muffled the blaring sounds of karaoke songs.\nThe Hi-Fidelity earplugs come with a carrying case and three different plug sizes. Of the four earplugs I tried, the Hi-Fidelity earplugs, which reduce sound by up to 15 decibels, reduce noise the least amount, but they are still an effective and affordable choice for attending loud events.\nThese earplugs, according to Vibes' website, are primarily for listening to live music. Wearing these during karaoke, I thought that they reduced the harsh noise well without making everything difficult to hear or understand. Some earplugs, like the Minuendos, are so good at reducing noise it is hard to interpret the world around you, but the Hi-Fidelity Earplugs balance both ends of that spectrum. With their 15-decibel sound reduction, you could also use them in other moderately loud environments, like parties or restaurants.\nThe Hi-Fidelity earplugs function as an inexpensive option for the occasional attendee of live events. Plus, they are simple to use and insert.\nPros\n- Remoldable thermoplastic custom molds, in case you mess up molding to your ear the first time\n- High sound protection\n- Variety of tips with triple flange and foam\n- Inexpensive\nCons\n- Molding hot plastic to the shape of your ear can be uncomfortable\n- If not molded correctly, you don't get the benefits of enhanced sound protection\nYou are going to have to put in some work to have the Decibullz Custom-Molded Earplugs work for you, but once they are fit to your ear, they reduce sound by up to 31 decibels, the highest level of sound reduction on this list.\nWhat made these difficult to install was their finicky nature as you are heating them in boiling hot water and then molding them to your ear shape. You have to remove earrings and piercings before putting the hot mold in your ear, because there is a risk the mold will stick to them. My mold wasn't hot enough the first time I tried to fit it to my ear; the second time that I heated the product, I had to exercise caution in fitting the hot plastic to my ear.\nAfter the mold is fitted to your ear, you are instructed to wait five minutes with it in. Putting a hot product that comes with multiple warnings near a sensitive part of your face can be distressing, especially considering there are other earplug options that will protect your hearing without the customizing fuss.\nThe earplugs come with three sets of triple flange tips and one set of foam tips, a carrying pouch and thermoplastic custom molds, which you heat in boiling water and then mold to your ear for a tight fit. It can be a bit daunting to fit the product to your ear, but fortunately, if you don't get it right the first time you can remold it. It can be uncomfortable to put something that has been sitting in boiling water into your ear, then press on it to shape it properly. I ran into some trouble with that.\nWhile some of the other earplugs I reviewed were designed for concerts or moderately loud events, these are designed for the next level of loud environments, like shooting guns or construction work. For $30 you are getting stellar sound protection and a tailored-to-you earplug. But that's only if the product is properly molded to your ear. What I found when I was using these during karaoke was that they didn't work any better than the other earplugs I tried, even though they promised higher sound protection.\nPros\n- Secure fit while sleeping and working\n- Variety of colors and styles\n- Inexpensive\n- Sleek design\nCons\n- Not intended for extremely loud environments\nAs someone who lives on a busy New York street, it can be hard to focus deeply in my apartment without the constant interruptions of sirens or beeping cars or the occasional shouting passerby.\nThe Loop Quiet earplugs are an affordable option that muffle sound and allow for deep, uninterrupted work or sleep to take place. The Loop Quiet earplugs reduce sound by up to 27 decibels while working, sleeping, traveling or attending events. While they aren't designated to serve super-noisy environments, the level of decibel protection surely provides a sound barrier that comes in handy in louder spaces, too. Alongside the Quiets, Loop also offers a colorful selection of affordable earplugs for concert-going, motorcycling, productivity, social gathering and parenting that screaming child of yours.\nThe Loop Quiet earplugs were easy to install and fit snugly in my ears. I slept with the Quiets in and found it much easier to fall asleep when the sound of my loud AC unit was reduced by the plugs. While working in my busy office, the Quiets made surrounding conversation nearly difficult to understand, which allowed me to further focus on my work. It wasn't until I had tried these on that I realized how distracted I was by moderately audible office conversations around me.\nFor their price, style and sound-muffling qualities, these are a top pick for getting work done, sleeping and subduing everyday noise, but they could also be used in louder settings if need be.\nHow we tested the best earplugs for preventing hearing loss\nTo test the earplugs, I wore them as I worked, slept and socialized throughout one week and considered the price, fit, comfort, quality of noise reduction and usability of each. I switched between the earplugs during my office work and while I was out at bars, walking around or on the subway. For earplugs that were designated to serve noisy environments, the Decibullz and the Vibes, I brought them to louder places, like karaoke and wore them on walks around my bustling block. For the Loop Quiet earplugs that were meant for reducing background noise, I worked and slept with them. For earplugs that could serve both environments, like the Minuendos, I wore them as often as I could. For more on how CNET tests the products and services it reviews, here is a full explanation.\n- Fit and comfort: I wore these earplugs as I slept, worked, hung out and walked throughout the week to test their comfort.\n- Noise reduction: To test how well these earplugs reduced noise, I would switch between different earplugs in the same environment to compare their noise reduction properties to one another.\n- Usability: I considered the styles and accessories such as carrying cases and variety of tips that the earplugs came with, and how likely I would be to use them in my everyday life.\nFactors to consider when choosing earplugs for hearing loss prevention\nWhen purchasing an earplug for hearing loss prevention, consider the level of decibel protection it will provide. A higher number of decibel protection can take the dangers of loud arenas down a couple of notches. The earplugs I tried offered anywhere from 15 to 31 decibels of protection. Another essential factor to consider is the question, \"will you actually wear these?\" That all comes down to the style and fit of the earplug. Consider how comfortable it is to have the earplug in your ear, would you be fine wearing it for an hour? Three hours?\nAs I spent time with these earplugs, I began to recognize the various purposes for which someone would use this product. I don't go to concerts as often as I do work in a noisy apartment, so an earplug that muffles the noise in my apartment suits me better than one that reduces the level of sound by 30 decibels. But a musician or someone who attends a live music event every week will demand more sound protection.\nRead more: What Musicians Can Teach Us About Noise and Hearing Loss\nThe importance of protecting your hearing\nWe live in an incredibly noisy world and it can be nearly impossible to avoid the cacophony and protect our ears. Luckily, you don't have to. That's where earplugs come in.\nWearing earplugs in loud spaces like at concerts (being in the front row at a rock concert produces 140 decibels of noise, according to University of Iowa Health Care's website), at noisy restaurants (around 60 to 80 decibels), while using heavy machinery (around 110 decibels) or riding the subway (around 90 decibels) can not only prevent hearing loss but also tinnitus.\nI should add that, before I wrote this article I was not an avid earplug user. But as I worked, walked around and traveled with these earplugs in, I quickly became converted to an earplugs-for-everything advocate. They helped me focus more on my work with less distractions. They made the commute on the subway nearly silent.\nWe've compiled a list of earplugs that will dampen the noisiest concerts and loudest subway rides, but also provide clarity as you work and move, because you shouldn't only care about your hearing health in particularly blaring situations.\nFor more on hearing tips, here are 10 tips to lower your risk of hearing loss and five ways to take care of your hearing aids."
    },
    {
      "url": "https://play.google.com/store/apps/details?id=edu.msj.cicadaSafari&hl=en_US&gl=US",
      "text": "Katie D\nI was pretty excited to see sightings popping up in my area so I went out looking. Read all the instructions about how to take photos and videos. The directions weren't super clear, but I figured it out. Rather than use my cell data to take photos in the app I took pics and then planned to upload them at home. Sadly, nothing will upload because it says there is no geotag. This was not in the instructions and there is definitely a geotag attached. So...big bummer for me.\n26 people found this review helpful\nLesley Sackville\nJust installed tonight so the jury is still out but I'm confused already. I thought a good place to start was with my profile. I selected edit, and tried to add a pix, like a profile pix, it let me choose it but won't upload it. Not a good start! Hopefully the functionality of the app will improve tomorrow when I'm out running errands and perhaps finding opportunities to add pictures of the little guys! Stars will be added when things improve!\n4 people found this review helpful\nNicholas Gimbrone (Nick)\n- Flag inappropriate\n- Show review history\nCrowd sourced research for science matters, making this a great app... that said, as an app it is less then sterling. The most glaring \"missing\" or \"broken\" aspects are: (1) that the notifications are useless, no ability to click one to see which image it is talking about and that the number of them seems unrelated to reality (I get hundreds more than I have pictures taken); (2) an \"delay uploads of reports until next connected to wifi\"; (3) that videos seem to never be accepted or rejected; (4) that jpg files are stored in DCIM rather than a subfolder; (5) I so far have not figured out where videos are stored, seems like with Camera they should be in the same location as the jpg files.\n32 people found this review helpful"
    },
    {
      "url": "https://apps.apple.com/us/app/cicada-safari/id1446471492",
      "text": "Cicada Safari 4+\nAn Exciting Scientific Safari\nMount St. Joseph University\n-\n- Free\nScreenshots\nDescription\nPeople have been recording periodical cicada emergences for nearly four centuries. These maps have been critical in verifying the cicadas’ long life cycles and the relationships of the broods to each other.\nHelp us map the 2021 emergence with Cicada Safari! Your submitted photos will be used to determine the range of Brood X across several states.\nWhat’s New\nVersion 1.8.4\n- Optimized location data retrieval\nRatings and Reviews\nAwesome App! Love Cicadas!\nThis app is interesting and has fun interactive tools! I can’t wait until my first Cicada citing so I can upload a picture to help track this unusual insect and it’s emergence where I live. Thank you to the creators behind this amazing app!😊\nPlease explain why photos are rejected\nThis app has a lot of potential. However, it would be nice to know why photos are accepted, then days later rejected. No explanation. Resubmitted. As a professional entomologist, I know what a Magicicada looks like as adult or nymph. Please provide better communication with users if you reject a photo. If one is doing something wrong with the photo, there should be feedback so one can improve.\nWrong location\nI hope the developers see this, I submitted a photo and when it was approved it was in the wrong location. I was in the location I took the picture when I submitted it but I was somewhere else when they approved it and that’s where it’s showing up on the map. Hope this can be fixed!\nApp Privacy\nThe developer, Mount St. Joseph University, indicated that the app’s privacy practices may include handling of data as described below. For more information, see the developer’s privacy policy.\nData Linked to You\nThe following data may be collected and linked to your identity:\n- Location\n- Contact Info\n- User Content\nPrivacy practices may vary, for example, based on the features you use or your age. Learn More\nInformation\n- Seller\n- Chad Montag\n- Size\n- 21.1 MB\n- Category\n- Education\n- Compatibility\n-\n- iPhone\n- Requires iOS 15.6 or later.\n- iPad\n- Requires iPadOS 15.6 or later.\n- iPod touch\n- Requires iOS 15.6 or later.\n- Apple Vision\n- Requires visionOS 1.0 or later.\n- Languages\n-\nEnglish\n- Age Rating\n- 4+\n- Copyright\n- © Mount St. Joseph University\n- Price\n- Free"
    },
    {
      "url": "https://www.cnet.com/tech/mobile/best-noise-canceling-headphones/",
      "text": "I’ve been testing noise-canceling headphones for 15 years (or noise-cancelling, as it's sometimes spelled, and have put together this list of top noise-canceling models at a variety of prices. Most selections are full-size over-ear headphones, but I’ve included some true wireless earbuds for those who prefer them. If you're looking for budget-friendly options, take a look at our list of the best noise-canceling headphones under $100. We also have a list of best noise-canceling true wireless earbuds and best budget earbuds for those looking for the top cheap noise-canceling buds.\nOur Picks\nHEADPHONE DEALS OF THE WEEK\n- $250 (save $101)\n- $295 (save $154)\n- $278 (save $70)\n- $280 (save $170)\nWhat are the best noise-canceling headphones overall?\nThough the recently released Sony WH-1000XM6 list for $450 -- or $50 more than the highly rated XM5 -- they're arguably the best noise-canceling headphones right now and have earned a CNET Editors' Choice award. Other high-end over-ear contenders include the Bose QuietComfort Ultra Headphones, Apple AirPods Max and Sonos Ace, while the Bose QuietComfort Ultra Earbuds (2nd gen), Sony WF-1000XM5 and Apple AirPods Pro 2 stand out from the pack as great options for the best noise-canceling earbuds. I've also included some budget picks, like the QCY H3 Pro and Earfun Wave Pro, for people looking for much more affordable noise-canceling headphones that deliver good bang for the buck.\nWhat We Updated: August 2025\nWe added the Skullcandy Aviator 900 ANC and removed the Bose QuietComfort Ultra Earbuds because Bose has released the upgraded QuietComfort Ultra Earbuds 2, which are due to hit stores in the U.S. sometime in August.\nBest noise-canceling headphones of 2025\nPros\n- Upgraded design with more comfortable fit\n- Improved noise canceling and sound quality\n- New QN3 chip is seven times as powerful as QN1 chip in XM5\n- Excellent voice-calling performance with more mics\n- Improved transparency mode\n- Spatial audio with head tracking\nCons\n- $50 more than previous model\n- No USB-C audio\n- It's not so clear how you access spatial audio\nOver the last several years, Sony has made some of the best noise-canceling headphones on the market, so it's a big deal when the company comes out with a new flagship model, like the WH-1000XM6, which arrives three years after the release of the WH-1000XM5. Though the XM5 was -- and still is -- one of the top over-ear Bluetooth headphones, there's always room for improvement. With the XM6, Sony has fixed the small design flaws of its predecessor while bumping up the overall performance. The result is a headphone that's arguably edged just ahead of the competition and is now at the top of its class. Read my WH-1000XM6 review.\nReasons to buy\nThe WH-1000XM6 are excellent for frequent travelers, remote workers and commuters who demand top-tier sound quality, noise canceling and call quality in a very comfortable headphone. If you can afford the high price, you'll appreciate what Sony has achieved here.\nReasons to skip/keep looking\nIf you're budget-conscious or already own Sony's WH-1000XM5 headphones, you should hold off until they go on sale. They offer some significant improvements over the XM5s, but not enough to justify rushing to upgrade at full price.\nPros\n- Eye-catching, premium design is made out of premium material and is slightly slimmer and lighter\n- Upgraded ear pads for more comfortable fit\n- Upgraded biocellulose drive units powered by discrete amplifier improves the sound quality\n- Improved noise canceling and voice-calling performance with 8 microphones\n- USB-C audio for lossless wired connection\nCons\n- Premium price ($50 more expensive than PX7 S2)\n- Noise canceling isn't quite up to the level of Sony's and Bose's\n- Headphones fold flat but not up (no dual-hinge)\n- At default setting, treble may be a touch too aggressive (forward) for some folks\nWhy I like them\nBowers & Wilkins PX7 S3 technically aren't the company's flagship headphones (the PX8 are), but they're arguably better than the more expensive PX8s, offering improved sound quality and superior noise canceling in an upgraded slimmer design (300 grams) that fit my head more comfortably. The drivers aren't the same as the PX8's carbon cone drivers, but the redesigned 40mm biocellulose drive units have an improved chassis, voice coil, suspension and magnet that, according to B&W, and deliver \"lower coloration and distortion, improved resolution and superior dynamics.\" Additionally, for the first time in a B&W headphone, the drive units are powered by a dedicated, discrete headphone amplifier that provides more \"scale and energy to the sound.\" I did think their sound was more revealing and open (wider soundstage) compared to the earlier S2e's and are more exciting and fun to listen to. At the default setting, the treble may be a touch aggressive for some folks (a tad too much sizzle), which can lead to some listening fatigue. But you can play around with the 5-band equalizer in the companion app for iOS and Android to smooth things out and give the headphones a slightly warmer sound.\nWhile these are pricey headphones, at least they look like premium headphones and are made with premium materials. In my tests in the noisy streets of New York, I found that the noise canceling is significantly improved (it's better than PX8's), though it's not quite up to the level of what you get with Sony's and Bose's flagship noise canceling headphones. I also thought the voice-calling performance has been upgraded (the headphones have 8 microphones total, 4 in each ear cup).\nWhile callers said that the background noise reduction wasn't quite as good as what they heard when I was talking to them on Sony's WH-1000XM6 headphones, they said they could hear my voice well with minimal background noise.\nIt's also worth noting that these headphones have USB-C audio for a lossless wired connection (and they also come with a 3.5mm analog cable that stows away nicely in a compartment inside the headphone's hard case). Android users should note that they have support for Qualcomm's aptX Adaptive and aptX Lossless audio codecs that can help improve sound quality when listening wirelessly over Bluetooth to high-resolution tracks from music streaming services like Tidal, Amazon and Qobuz. However, very few mainstream Android smartphones support aptX Adaptive or Lossless (more support Sony's LDAC audio codec).\nReasons to buy\nThe sleekly designed, swanky Bowers & Wilkins PX7 S3 are excellent noise-canceling headphones that are a clear improvement over their predecessor. That said, the biggest reason to buy these over Sony's WH-1000XM6 headphones, which carry the same list price, is that you like their look better. They also feature USB-C audio while the XM6 doesn't.\nReason to skip/keep looking\nFrom an aesthetic standpoint, I prefer the design of the PX7 S3 to the Sony WH-1000XM6's. But I can't say the PX7 S3 is any more comfortable or sounds better (I slightly preferred the sound of the Sony, in fact). And the Sony offers slightly better noise canceling and voice-calling performance, along with some extra features such as Speak-to-Chat and Quick Attention mode. If you already own the earlier PX7 S2e, it's probably not worth shelling out full price for PX7 S3. The same is true if you own Bowers & Wilkins flagship PX8, which could get the S2 treatment in 2025. The PX7 S3 sounds more exciting than the PX8, but it's debatable whether it sounds better. I would give the slight nod to the PX8 but that's just my personal taste.\nPros\n- Design is an upgrade\n- Lightweight and very comfortable\n- Excellent sound and great noise canceling\n- Voice-calling performance is top-notch\n- Immersive Audio mode offers some sound-quality enhancements\nCons\n- Higher price than the previous model\n- No USB-C audio\n- Immersive Audio mode hurts battery life\nWhy I like them\nBose's flagship QuietComfort Ultra Headphones feature a more premium design than their predecessor, along with Bose's Immersive Audio feature, which delivers some sound-quality enhancements. Along with excellent sound and great noise canceling, the QC Ultra Headphones are also great for making calls, with top-notch background noise reduction. Released in late 2023, I called these \"a worthy adversary to Sony's highly rated WH-1000XM5 and Apple's AirPods Max headphones.\" Sony's new WH-1000XM6 headphones have edged slightly ahead of the QC Ultras, but they remain one of the top noise-canceling headphones on the market. Read my Bose QuietComfort Ultra Headphones review.\nReasons to buy\nThey're a good choice for frequent travelers, commuters and professionals who want comfortable, well-designed headphones with impressive overall performance, including excellent noise-muffling capabilities.\nReasons to skip/keep looking\nThose who are on a tighter budget should obviously look toward more midrange and budget headphones options. Also, Sony's new WH-1000XM6 headphones are arguably slightly better for around the same price. That said, since the QuietComfort Ultra Headphones came out in late 2023, they do end up going on sale fairly regularly.\nPros\n- Well-designed and comfortable headband that cups head for a good acoustic seal\n- Excellent sound and noise-canceling to reduce ambient noise by about 85%-95%\n- Strong voice-calling performance\n- Spatial audio with head-tracking\n- USB-C audio for digital lossless wired connection\n- TV Audio Swap feature for Sonos users\nCons\n- Pricey\n- Not Wi-Fi headphones, despite expectations\n- TV Audio Swap feature only works with Sonos' Arc sound bar at launch (and can be glitchy)\nWhy I like them\nA lot of people expected Sonos' first headphones to be able to stream lossless audio over Wi-Fi in your home and then use Bluetooth outside your Sonos home network. However, Sonos reps told me that listening to music over Wi-Fi would greatly reduce the headphone's battery life and the company opted to leave that feature off. So even though they're equipped with a Wi-Fi chip so you can tap into a Sonos sound bar at home for private late-night viewing (Sonos refers to this as the TV Audio Swap feature), they're not really Wi-Fi headphones and are first and foremost noise-canceling Bluetooth headphones -- and I was mostly quite impressed by them. Read my Sonos Ace review.\nSleekly designed, at 312 grams, they're not as light as the 254-gram Sony WH-1000XM6s or the 253-gram Bose QuietComfort Ultras, but they're considerably lighter than the 385-gram AirPods Max and I found them quite comfortable to wear, with a relatively small gap between the headband and my head (they hugged my head nicely with just the right amount of clamping). I also appreciated tat their chrome metal yoke allows the headphones to swivel in multiple directions -- the hinge is hidden - and the ear cups adhere magnetically like they do on the AirPods Max and are replaceable, which is good.\nAll in all, the Sonos Ace headphones perform very well across the board with strong noise canceling, excellent sound quality and very good voice-calling performance. Well balanced, they're clean sounding with nice detail and sparkle in the treble along with punchy, powerful bass that doesn't get boomy. Vocals sounded natural and the headphones have a relatively wide soundstage. It's also good to see that the headphones have USB-C audio support (wired listening with a USB-C cable) and spatial audio with head-tracking.\nReasons to buy\nThe Sonos Ace are one of the top noise-canceling headphones on the market, rivaling flagship models from Sony, Apple and Bose. Now that they've been out for more than a year, we're seeing some good discounts on them, which makes them a better value, and a potential alternative to Sony's new WH-1000XM6 headphones. While you don't have to be an owner of Sonos speakers to buy them, Sonos soundbar owners can leverage the TV Audio Swap feature for private late-night viewing (the Ace delivers virtual surround sound in this mode).\nReasons to skip/keep looking\nYou can make the argument that Sony's new WH-1000XM6 are slightly better overall for around the same price (I'm talking list price -- and yes, they're too pricey for some folks). But with the Ace selling for as low as $330, they're an easier sell.\nPros\n- Sound quite good for their relatively low price\n- Lightweight and relatively comfortable\n- Decent noise canceling and voice-calling performance for a budget headphone\n- USB-C audio (and wired mode with included cable)\n- Support for LDAC audio codec\nCons\n- ANC cuts off in wired mode\n- No carry case or pouch included\nWhy I Like Them\nQCY is another Chinese brand like Tribit, Earfun and plenty of others that make budget-priced headphones that sound better than you'd think they would for their relatively low price (the company says the Q stands for quality, C stands for creative and Y stands for youth). Its new-for-2024 H3 Pro headphones are similar to models in this price range from 1More, Tribit and Edifier, but they arguably sound a touch better and I found them relatively comfortable to wear, as they feature a lightweight design and memory foam ear pads.\nThe sound quality on these budget models tends to vary a bit from track to track. While I encountered some occasional distortion on badly recorded material and the treble just can't produce the clarity and detail that you get with more premium headphones, all in all, the sound quality was quite respectable. The noise canceling also is fairly decent -- there are a few different modes to choose from in QCY's companion app for iOS and Android, which has a low-frills-looking interface but is robust enough under the hood -- and callers said the voice-calling performance was also good, especially given the price of these headphones.\nYou do get multipoint Bluetooth pairing that allows you to connect two devices simultaneously (you have to activate it in the app), but features like wear sensors that pause your music when you take the headphones off are missing. Also, you can set the headphones to automatically turn off after not being in use for a certain amount of time (I set it for 15 minutes), but the headphones turned off in the middle of a long call I was making, not seeming to realize that I was using the headphones. The H3 Pro are decent value for the cost, particularly when their price dips closer to $50.\nReasons to buy\nLike the handful of other budget headphones I recommend, the QCY H3 Pro are better than you'd think they'd be for their modest price in terms of both design and performance.\nReasons to skip/ keep looking\nIf you're a critical listener, these probably aren't for you as these headphones occasionally distort audio and lack the treble clarity found in higher-end models. Also, it's too bad they don't come with any sort of carrying pouch and noise cancelling isn't available when using the cable for wired listening (you'd kind of want noise canceling if you watching a movie on a plane plugged into your seat's inflight entertainment system).\nPros\n- Relatively lightweight and comfortable\n- Not only fold flat but fold up into a nicely designed crossbody travel bag\n- Very good sound after tweaking EQ settings\n- Well-designed physical controls\n- Good noise-canceling and voice-calling performance\n- THX spatial audio with head tracking\n- Strong battery life (up to 50 hours with ANC on)\nCons\n- No USB-C audio\n- Fairly pricey\n- No support for LDAC and AptX audio codecs (AAC and SBC only)\nWhy I like them\nWe reviewed Skullcandy's wired Aviator Roc Nation headphones all the way back in 2011. Now Skullcandy's brought the Aviator design back in a wireless noise-canceling model called the Aviator 900 ANC headphones. They kind of surprised me because Skullcandy is better known for its Crusher headphones, which deliver bone-rattling bass but not so-called premium-sounding headphones. However, the Aviator 900, developed in partnership with THX, deliver surprisingly impressive sound. They're not so great out of the box, but after you make some tweaks to the EQ in the app and turn on the THX spatial audio, the sound improves dramatically and is arguably more exciting than the new Nothing Headphone (1)'s sound and more fun to listen to.\nLike the Nothing Headphones (1), the Aviator 900 ANC also list for $300 and have a translucent theme. However, the Aviator 900 is lighter (289 grams) and more comfortable to wear. Plus, it not only folds flat but folds up into a well-designed crossbody travel bag (you can remove the strap) and has some nifty physical control buttons (I also liked the integrated mini LED display, though it's value is dubious because you can't see it while you have the headphones on). It, too, features good noise-canceling and voice-calling performance, though the Nothing Headphone (1) may have a slight edge in those departments. Even so, I slightly preferred Skullcandy headphones for their fit and sound, especially after a firmware upgrade fixed an early issue that some people experienced with the sound distorting at higher volumes.\nReasons to buy\nThe Aviator 900 ANC headphones offer a comfortable fit and strong overall performance in a unique, eye-catching design.\nReasons to skip/keep looking\nThe headphones are fairly pricey, so you may want to wait for them to go on sale. They've dipped to as low as $200 during Amazon Prime Day, and I suspect we'll see them sporadically discounted to near $200 as we head into the holiday buying season.\nPros\n- Surprisingly comfortable for their weight\n- Impressive sound and build-quality\n- Adaptive noise canceling is top-notch and so is transparency mode\n- Good headset performance for calls\n- Spatial audio virtual surround for iPhones and iPads is a sweet bonus feature\n- Automatic switching between iOS devices on your iCloud account (multipoint Bluetooth)\nCons\n- Expensive, heavy and the smart case may be too smart for its own good\n- No cable included for wired use\n- Android users lose a couple of key features\n- People around you can hear what you're listening to if you have the volume up (they leak some sound)\n- Equipped with Apple's H1 chip, not the newer H2\nWhy I like them\nIn late 2024, Apple updated the AirPods Max with USB-C charging -- instead of Lightning -- and added new color options but didn't upgrade the headphones in any other ways that we're aware of. Yes, they're expensive, but the AirPods Max deliver impressive sound quality, excellent noise canceling, very good voice-calling performance, as well as high-end build quality (aluminum ear cups and stainless steel telescoping arms) and Apple's virtual surround spatial audio feature with head tracking. While they're heavy, they manage to be surprisingly comfortable, though I did have to adjust the mesh canopy headband to sit a little more forward on my head to get a comfortable secure fit when I was out walking with them. It's also worth noting that Apple enabled USB-C audio for the AirPods Max in March of 2024. Read my review of the original Lightning-enabled AirPods Max.\nWhat that means is that you can use the included USB-C charging cable to connect the headphones to your USB-C-equipped PC, phone or tablet to get lossless audio (the sound quality is slightly improved with wired listening, especially if you're listening to lossless audio files). While Apple doesn't include a USB-C-to-3.5mm cable -- yes, such a cable should be included with headphones that cost this much -- it will sell you one for $39.\nReasons to buy\nYes, they're pricey, but the AirPods Max remain top-notch noise-canceling headphones that are right there with Sony's and Bose's flagship models. Like other AirPods, they have some Apple-only only features, including spacial audio with head-tracking and automatic switching between Apple devices, that Apple users will appreciate.\nReasons to skip/keep looking\nWhile the AirPods Max were updated with USB-C connectivity, which has some advantages, they haven't been substantially upgraded since their release in 2020. I'd like to see them at least updated with Apple's more powerful H2 chip (they're equipped with the H1 chip) that delivers some additional features and is available in the AirPods Pro 2. Could we get an AirPods Max 2 in 2026? Maybe.\nWhy I like them\nSony has released its new-for-2025 WH-1000XM6 headphones, but its former flagship model, the XM5 is still an excellent headphone that's often on sale for closer to $300. Their noise-canceling, voice-calling and sound isn't quite as good as what the XM6 offers (the XM6 sounds a little more detailed with improved bass performance) and the XM6 has a dual-hinge design that allows them to fold up, not just fold flat. As a result, the XM6's case is a little smaller. Additionally, the XM6 is powered by a new QN3 chip that Sony says delivers 7 times the performance of the QN1 chip found in the XM5s. All that said, while the jump in performance from the XM5 to the XM6 is certainly noticeable, it isn't huge; the XM5 still offers very good sound, noise-canceling and voice-calling performance that should satisfy most people. Read my Sony WH-1000XM5 review.\nReasons to buy\nThe biggest reason to buy the XM5 is if you can't afford the XM6 and find the XM5 substantially discounted. It's still quite competitive with the Bose's QuietComfort Ultra Headphones, the Sonos Ace and Apple's AirPods Max.\nReasons to skip/keep looking\nIt's always a little hard to buy a previous-generation headphone that was released three years ago (2022) when you know a newer, better model (the XM6) exists and will eventually go on sale.\nPros\n- Upgraded design\n- Very comfortable\n- Improved noise-canceling and sound quality\n- Robust feature set\n- Good voice-calling performance\n- Smart Tx audio transmitter included\nCons\n- Pricey\n- Some people may find Smart Tx audio transmitter not that useful\nJBL's new flagship noise-canceling headphones, the Tour One M3 Smart Tx, are a nice step up from the company's earlier Tour One M3. Not only are the more comfortable (they weigh 278 grams and have an upgraded ear cup design), but they feature better noise-canceling, slightly improved sound quality and good voice-calling performance. The headphones also come with an accessory that isn't included with competing premium noise-canceling models: the JBL Smart Tx audio transmitter, which enables you to wirelessly deliver audio to the Tour One M3 from any USB-C or analog audio source such as an inflight entertainment system, PC, tablet or television. It has a touchscreen LCD that allows you to control the Tour One M3's features, including music playback, call management and EQ Settings JBL says the Smart Tx -- it's rated for up to 18 hours of battery life -- also has the ability to broadcast any audio source to an unlimited amount of Auracast-enabled devices.\nJBL's previous two Tour One models fell a little short of Sony's and Bose's premium noise canceling offerings. But its upgraded and more refined third-generation Tour One M3 headphones are more viable alternative to those models, though they would be more enticing if they were priced closer to $300. Equipped with newly designed 40mm Mica Dome drivers, the sound is well-balanced and dynamic, with well-defined bass and some sparkle in the treble. The mids, where vocals live, could sound a tad more natural and clear, you can make some tweaks to those aforementioned EQ settings to dial in a sound profile that's optimized for your hearing and specific musical tastes. In the end, the Tour One M3 are very good noise-canceling headphones, with a robust feature set, including JBL Spatial Sound with head tracking, 8 mics (4 on and in each ear cup) and support for the LDAC audio codec for Android devices. Their only issue is that their sound and noise canceling doesn't rise above the competition in this price range. So, as I said, they probably need to cost a $50-$100 less for someone to choose them over Sony, Apple or Bose.\nWhen Sony's WF-1000XM4 earbuds came out in 2021, we awarded them a CNET Editors' Choice. And while they're excellent, we had some quibbles -- they're on the large side and aren't a good match for certain ears. Clearly, Sony took those gripes to heart when it set out to design its next-generation WF-1000XM5 flagship noise-canceling earbuds. Not only are the XM5s smaller, but they also offer improved performance pretty much across the board, with better noise canceling, sound and voice calling. Are the XM5s perfect? Not quite. And at $300 -- $20 more than their predecessor -- they're costly too. But overall they're really impressive -- easily among the very top earbuds on the market.\nPros\n- Sturdy, eye-catching design with translucent elements\n- Clean, clear sound with well-defined bass that's enjoyable to listen to\n- Strong noise-canceling and voice-calling performance\n- Excellent controls that are intuitive to use\n- USB-C audio\n- Nice carrying case (although some find the zipper problematic)\nCons\n- Headphones are a ltitle heavy and not quite as comfortable as some competing models\n- They fold flat but don't fold up\n- Sound quality is good but not a wow\n- The ear pads are not easily removable and it's unclear whether they're replaceable\nThe Nothing Headphone (1) ended up being more impressive than I thought it would be. Nothing has always been a good marketing company that usually does a bang-up job hyping its products. Its first earbuds were a little more style over substance (the performance has improved with more recent models), but this headphone's sturdy, eye-catching design is backed by strong performance. While I have some quibbles with the headphone being a little heavy and slightly prefer the sound quality of some competing models, this is one of the best new headphones of 2025. It will be interesting to see if its price can come down a bit to make it an even more compelling premium noise-canceling headphone option. Read Nothing Headphone (1) review.\nPros\n- Lightweight design, now with USB-C charging and dust-resistance\n- Excellent sound and noise canceling with improved acoustic architecture\n- Powered by Apple's H2 chip\n- Charging case has U1 chip and built-in speaker for Find My\n- Strong voice-calling performance\n- Support for 20-bit/48 kHz Lossless Audio with Apple's Vision Pro headset\n- User-friendly controls on stem for audio control\nCons\n- No support for high-resolution audio with other Apple devices (except headset)\n- No XL eartips included\nApple not only swapped in USB-C for Lightning connectivity in its iPhone 15 models, but it made the switch with the AirPods Pro (2nd gen). The new AirPods Pro 2 with MagSafe (USB-C) are nearly identical to their Lightning predecessor, delivering the same excellent sound, noise canceling and voice-calling performance. That said, they offer some other small upgrades, including additional dust resistance and a new acoustic architecture that allows for Lossless Audio with the Vision Pro.\nNevertheless, the AirPods Pro 2 (USB-C) are easy to recommend to Apple users despite their high price. Pro tip: Don't pay more than $190 for these, which is the online sale price at which they're now frequently available.\nPros\n- Lightweight and comfortable\n- Good sound with very good noise canceling and ambient sound mode\n- Good voice-calling performance\n- 35 hours of battery life\n- Multipoint Bluetooth\n- Robust EQ settings\nCons\n- No carrying case\n- No ear-detection sensors\n- No LDAC audio codec support\nSony's improved entry-level noise canceling headphones, the CH-720Ns, have a bit of a plasticky budget vibe, but they're lightweight and very comfortable. Part of me was expecting them to sound pretty mediocre, but I was pleasantly surprised. No, they don't sound as good as the WH-1000XM5s. But they sound more premium than they look (and feel), and their overall performance is a step up from their predecessor, the CH-710Ns. Are they worth $150? Maybe -- or maybe not. But the good news is that, like the CH-710N and WH-XB910 before them, these should see significant discounts in the not-so-distant future, which is what you may want to wait for.\nPros\n- Improved sound quality, noise canceling and ear pad design\n- Very good voice-calling performance\n- Spatial audio with head tracking for Apple users\n- USB-C audio\nCons\n- No Apple H2 chip\n- No ear-detection sensors\n- No major design changes except for case\nLove 'em or hate 'em, Beats Studio headphones are among the most popular headphones of all time, launching as a wired headphone back in 2008. This is the fourth generation of them, and they carry the same list price as their predecessor and look very similar on the outside but have some big changes on the inside that make them significantly better headphones. I'm tempted to describe them as more affordable plastic versions of the AirPods Max. However, that's not quite accurate due to a choice in chipsets and one notable missing feature. But read our full review to find out what makes this a very good headphone with some caveats.\nPros\n- Affordable\n- Lightweight and comfortable\n- Good sound quality and ANC for the price\n- Strong battery life\n- USB-C audio\nCons\n- No carrying case\n- No 3.5mm jack for wired listening\nWhy I Like Them\nThe Edifier W830NB looks slightly more premium than its predecessor, W820NB Plus, and like that earlier popular budget model, is fairly lightweight (265 grams) and comfortable, with cushy memory foam ear pads. They also sound very good for their price, offering decent clarity and fairly well-defined bass with an amply wide sound stage (they lack the refinement and depth of higher-end headphones, but you can't expect the world from sub-$80 headphones). You can tweak the sound profile in Edifier's companion app for iOS and Android.\nThe W830NBs do have a few additional improvements over the W820NB Plus. First, you get Bluetooth 5.4 (instead of 5.2). Also, along with the LDAC and SBC audio codecs, the W830NB supports the AAC audio codec. The noise canceling is a tad better (it's decent but not up to the level of what you get with Bose and Sony headphones) and battery life is rated for up to an impressive 54 hours with noise canceling on, up from 49 hours. A couple of things are still missing. There's no official carrying case or headphone jack, although you can connect them to your computer with a USB-C cable for a wired connection.\nReasons to buy\nThe Edifier W830NB headphones are one of the few budget noise-canceling headphones I recommend to folks who don't want to spend too much on a headphone but want something decent that doesn't look and feel too cheap, is comfortable to wear and delivers respectable sound and noise-canceling.\nReasons to skip/keep looking\nYou can only expect so much from these headphones. They're better than you'd expect given their price, but more premium models that cost significantly more do offer better performance and built quality. Also, although these have USB-C audio, they're missing a 3.5mm headphone cable to plug into the headphone jack of an inflight entertainment systems. And no carrying case is included.\nPros\n- Comfortable fit for long wear\n- Good sound with punchy bass for their low price\n- Decent noise-canceling and voice-calling performance with two levels of ANC\n- Support LDAC audio codec for compatible devices\n- Included cable for wired listening\nCons\n- ANC disabled when in wired mode\n- Lacking a bit of sound clarity\nEarfun has made some very solid budget earbuds, and now it's entered the full-size ANC headphone space with its new-for-2024 Wave Pro headphones. They list for $80, but click the $20-off instant coupon on their product page and add the code EWPROCNET at checkout for some sweet discount. While they may not sound as good as premium noise-canceling headphones from Bose or Sony, they're comfortable to wear, feature decent sound with punchy bass (they're a bit lacking in clarity and bass definition compared to more expensive models), and they offer respectable noise canceling (you can toggle between two levels of ANC) and voice-calling performance. I found them to be a step up from the Soundpeats Space headphones, which sometimes cost a little less.\nThey're rated for up to 80 hours of battery life with noise-canceling off and 55 hours with it on and support multipoint Bluetooth pairing as well as Sony's LDAC audio codec for Android smartphone and other compatible devices. I also like that they come with a hard case and a cable connection for wired listening (though noise-canceling is disabled when you go wired, which is a bit of a bummer).\nPros\n- Well-designed and comfortable to wear\n- Good sound quality and noise-canceling performance\n- Strong feature set\n- Strong battery life\nCons\n- Voice-calling suffers in windy environments\n- Carrying pouch leaves headphones vulnerable to damage\nThe well-designed and comfortable JBL Live 770NC offers some modest improvements over its predecessor, including better battery life (up to 65 hours with ANC off and 50 hours with ANC on) and Bluetooth 5.3 with LE Audio (via a future firmware upgrade). Equipped with 40mm drivers, you get bold, nicely defined sound with powerful bass that's relatively tight. JBL's Ambient Aware and TalkThru features are on board along with multipoint Bluetooth pairing (the one feature that's missing is ear-detection sensors that pause your music when you take the headphones off). I thought the headphones' noise muffling capabilities were good and callers said they could hear me well even in noisier environments except when the wind picked up around me. The headphones fold up and a simple carrying pouch (no hard case) is included along with a cable for wired listening.\nPros\n- Excellent sound\n- Improved noise canceling and voice-calling performance\n- Impressive battery life\n- Good sound personalization features\nCons\n- Ho-hum design\n- Noise-canceling isn't as good as Sony's or Bose's\nWhy I like them\nSennheiser's previous-generation Momentum Wireless headphones have always had a pretty distinct look that was part retro, part modern and stood out for the exposed metal on their headband. For better or worse, that's all gone now, and the new Momentum 4 Wireless, Sennheiser's flagship noise-canceling headphones, look a bit more subdued and also a bit more like some of their competitors.\nThe Momentum 4 Wireless offers superior performance over the Momentum 3 Wireless in every regard, although the biggest gains are with noise canceling and voice-calling performance as well as battery life, which is outstanding -- up to 60 hours at moderate volume levels. There's also a transparency mode that allows ambient sound in, and they have the ability to create a custom sound profile in the Smart Control app for iOS and Android using the built-in EQ, sound modes and a new Sound Personalization feature that \"assesses the user's listening preferences and adjusts the listening experience according to their taste.\"\nEquipped with 42mm drivers, Sennheiser says the Momentum 4 Wireless offers \"best-in-class\" sound, which is debatable. I'd say the Momentum 4's sound quality is right there with other models in this price range -- they sound excellent, with the requisite well-defined, punchy bass, relatively wide soundstage (they sound pretty open) and smooth treble that brings out some of the finer details in well-recorded tracks. They're a pleasure to listen to.\nReasons to buy\nThe Momentum 4 Wireless costs less than flagship models from Sony, Bose and Apple and offer excellent sound and good build quality.\nReasons to skip/keep looking\nWhile I'm fan of the Momentum 4 Wireless and like their sound a lot, they're noise canceling and comfort level isn't as good as what you get from the Bose QuietComfort Ultra or Sony WH-1000XM5 or WH-1000XM6.\nPros\n- Very good sound quality with good clarity and well-defined bass\n- Good noise canceling and voice-calling performance\n- USB-C audio for lossless wired listening\n- Impressive features like touch controls, adaptive noise canceling, and AptX Adaptive Audio codec support\nCons\n- Headphones initially fit a little too tightly\n- Uninspired design\nWhy I Like Them\nIf you can't afford Sennheiser's flagship Momentum 4 Wireless and other premium models from Bose, Sony and Apple, the Sennheiser Accentum Plus is a good midrange alternative that doesn't quite offer the same performance as those higher-end models but offers better build quality and sound than most budget noise canceling headphones. In essence, these are a slightly stripped down version of the Momentum 4 Wireless and share a similar aesthetic and the same touch controls but feature different drivers (the Momentum Wireless 4 have larger 42mm drivers and offer richer, more detailed sound with slightly better bass performance). Still, these sound good for the money, offer respectable noise canceling and support USB-C audio wired listening and the AptX Adaptive audio codec that's compatible with some Android devices.\nReasons to buy\nThey cost about half the price of premium models in the $350-$400 range and deliver 75-80% of their performance while featuring good build quality.\nReasons to skip/keep looking\nThe Accentum Plus has a little more clamping force than some headphones so not everybody finds it incredibly comfortable (it helps to stretch the headband and break it in a bit so to speak). While it sound quite good for the money, its noise canceling performance isn't as good as what you get from premium models from Bose and Sony.uild quality\nPros\n- Lightweight and comfortable\n- Very good sound and noise canceling with new Wind Block feature\n- Good voice-calling performance with integrated cable microphone and six on-ear mics\n- USB-C audio for lossless wired listening\nCons\n- Mostly the same as previous model but costs $50 more\nWhen Bose released its new flagship QuietComfort Ultra Headphones, it also replaced the QuietComfort 45s with a new, slightly updated model simply called the QuietComfort Headphones. Like the QC 45s, this model carries on the very comfortable tried-and-true legacy QuietComfort design that's been around for a few generations that a lot of people continue to love. The QC Ultra Headphones add Bose's new Immersive Audio feature and have a more refined design with some metal parts (they also have Bluetooth 5.3 instead of Bluetooth 5.1). But the QuietComfort Headphones still feature very good sound (the Ultras offer a small step up in sound quality), excellent noise canceling and strong voice-calling performance.\nAs for differences between these and the QC45s, Bose says it adjusted some of the electronics to improve battery life (now 24 hours vs. 22 hours) and adjusted the logos to make the products \"visually distinguishable and more in line with its latest design language.\" It also added an inline microphone to the auxiliary cable to \"help with some users who may prefer a plug-and-play solution rather than Bluetooth pairing.\" There's also a Wind Block feature and some additional small performance improvements due to software upgrades. Finally, the headphones come in new color options, including green and a light blue version that's only available at bose.com.\nWhile the QuietComfort Headphones carry a $350 list price that's $50 higher than that of the QC 45s, we expect them to be regularly discounted to $250 and possibly less than that in 2024 -- so look to buy them when they're on sale. You can read our review of the QuietComfort 45 to get a good take on the QuietComfort Headphones.\nPros\n- Lightweight and comfortable\n- Improved sound quality and noise-canceling performance\n- Upgraded microphones\n- Quick attention mode returns\nCons\n- Bass can get a little boomy, especially with ULT button engaged\n- Headphones look a little big\n- No USB-C audio\nThe ULT Wear (WH-ULT900N) is the successor to Sony's popular extra bass model, the WH-XB910N, and features upgraded drivers (better sound) along with improved noise canceling and voice-calling performance. Both Sony's flagship WH-1000XM5 and entry-level CH-720N offer more balanced sound, but the ULT Wear deliver on their promise of delivering dynamic, powerful sound with deep bass. The only downside is that bass can get sometimes get a little too boomy, especially when you engage the bass boost mode with the ULT button.\nPros\n- Relatively comfortable for an on-ear headphone\n- Good sound quality\n- Decent noise canceling and voice-calling performance\n- Excellent battery life\nCons\n- No carrying case\nThe JBL Tune 670NC is one of a relatively small number of on-ear headphones to offer active noise canceling. It's something of a value model -- no carrying case is included -- but it does have memory foam ear pads that get you a comfortable fit for an on-ear headphone. Deliver clear sound with punch bass, it has 32mm drivers and improves on its predecessor's battery life, offering up to a whopping 70 hours (or 44 hours with ANC on), and an extra three hours of battery with just five minutes of charge. This model includes the latest Bluetooth 5.3 (with LE Audio) and multipoint Bluetooth pairing. It also has JBL's Ambient Aware (transparency mode) and TalkThru features. It's available in black, white and blue and comes with a cord for wired listening.\nCompare noise-canceling headphones\nCompare battery life, noise-canceling ability, water-resistance, price and other features for each pair of noise-canceling headphones on this list in our side-by-side comparison.\n| Product | Battery life | Noise canceling | Bluetooth multipoint | Headphone type | Water-resistant | Price |\n|---|---|---|---|---|---|---|\n| Bose QuietComfort Ultra Headphones | Up to 24 hours | Yes (ANC) | Yes | Over-ear wireless headphones | No | $$$ |\n| Sony WH-1000XM5 | Up to 32 hours | Yes (ANC) | Yes | Over-ear wireless headphones | No | $$$ |\n| Sonos Ace | Up to 30 hours | Yes (ANC) | Yes | Over-ear wireless headphones | No | $$$$ |\n| QCY H3 Pro | Up to 40 hours | Yes (ANC) | Yes | Over-ear wireless headphones | No | $ |\n| Bose QuietComfort Ultra Earbuds | Up to 6 hours | Yes (ANC) | No | In-ear true wireless earbuds | Yes (IPX4 splash-proof) | $$$ |\n| Sony WF-1000XM5 | Up to 8 hours | Yes (ANC) | Yes | In-ear true wireless earbuds | Yes (IPX4 splash-proof) | $$$$ |\n| Apple AirPods Pro 2 (USB-C) | Up to 6 hours | Yes (ANC) | Yes (for Apple users only) | In-ear true wireless earbuds | Yes (IP54 splash-proof and dust-resistant) | $$ |\n| Sony CH-720N | Up to 35 hours | Yes (ANC) | Yes | Over-ear wireless headphones | No | $ |\n| Edifier W830NB | Up to 54 hours | Yes (ANC) | Yes | Over-ear wireless headphones | No | $ |\n| Earfun Wave Pro | Up to 55 hours | Yes (ANC) | Yes | Over-ear wireless headphones | No | $ |\n| JBL Live 770NC | Up to 65 hours | Yes (ANC) | Yes | Over-ear wireless headphones | No | $$ |\n| Beats Studio Pro | Up to 40 hours | Yes (ANC) | No | Over-ear wireless headphones | No | $$$ |\n| Apple AirPods Max | Up to 20 hours | Yes (ANC) | Yes (for Apple users only) | Over-ear wireless headphones | No | $$$$ |\n| Sennheiser Momentum 4 Wireless | Up to 60 hours | Yes (ANC) | Yes | Over-ear wireless headphones | No | $$ |\n| Sennheiser Accentum Plus | Up to 50 hours | Yes (ANC) | Yes | Over-ear wireless headphones | No | $$ |\n| Bose QuietComfort Headphones | Up to 24 hours | Yes (ANC) | Yes | Over-ear wireless headphones | No | $$ |\n| Sony ULT Wear | Up to 50 hours | Yes (ANC) | Yes | Over-ear wireless headphones | No | $$ |\n| Bowers & Wilkins PX7 S2e | Up to 30 hours | Yes (ANC) | Yes | Over-ear wireless headphones | No | $$$ |\n| JBL Tune 670BNC | Up to 70 hours | Yes (ANC) | Yes | On-ear wireless headphones | No | $ |\n| 1More SonoFlow | Up to 70 hours | Yes (ANC) | No | Over-ear wireless headphones | No | $ |\nFactors to consider when choosing noise-canceling headphones\nBudget\nBefore anything else, you'll want to figure out how much you're willing to spend on new ANC headphones. The quality of value-priced noise canceling headphones continues to improve, so you can find good affordable headphones for less than $100. But the premium models, which offer better build quality and performance, tend to cost $200 or more -- sometimes much more.\nFit (comfort)\nIt's key that the headphones you buy fit your head well. They should offer a comfortable fit that's snug yet not too snug. Ideally, you want headphones you can wear over the course of a day with minimal breaks.\nDurability\nYou want headphones that hold up well over time, so look for models that we note have sturdy build quality.\nMaximize performance and features for your budget\nYou want the best-sounding headphones with the best noise-canceling, call quality, and features for whatever you're able to spend.\nReturn policy\nIt's critical to buy your headphones at a retailer that has a good return policy, in case you have buyer's remorse. Some people who are having trouble deciding between two models sometimes buy both, try them out for a few days, and then return one.\nHow we test noise-canceling headphones and earbuds\nWe test noise-canceling headphones and earbuds based on six key criteria. These criteria include design, sound quality, noise-canceling performance, voice-calling performance, features and value.\nDesign\nEvaluating design, we first assess how comfortable the headphones and earbuds fit (their ergonomics), typically testing each model for several hours across multiple days. For over-ear headphones, we check for adequate ear cup padding, headband pressure and heat buildup. With earbuds, we test all included ear tip sizes and evaluate their stability during movement or other physical activity. Build quality assessment includes stress testing hinges and folding mechanisms, examining material durability and verifying IP (dust- and water-resistance) ratings when applicable.\nSound quality\nWe evaluate sound quality by listening to a set playlist of music tracks and comparing the earbuds to top competing products in their price range. Some of my test tracks include Spoon's Knock Knock Knock, Athletes of God's Don't Wanna Be Normal, The Doors Touch Me - Take 3, Orbital's Dirty Rat, Taylor Swift's Vigilante Shit, Jvke's Golden Hour and Drake's Passionfruit. Tested sonic traits include:\n- Frequency response\n- Tonal balance\n- Soundstage width and depth\n- Detail retrieval and instrument separation\n- Bass response and control\n- Midrange clarity and vocal reproduction\n- High-frequency extension without harshness\nNoise-canceling performance\nWe evaluate noise-canceling performance by wearing the headphones in the same spot indoors near a noisy HVAC unit to see how well they do at muffling lower frequencies. Then we head out to the streets of New York to test the headphones in a real-world environment where test their ability in:\n- Public transit environments (buses, trains and subway platforms)\n- Busy street intersections for traffic and construction noise\n- Areas with ambient chatter and voices\nEach environment is tested several times.\nExtra features\nSome great-sounding noise-canceling headphones and earbuds aren't loaded with features, but we do take into account what extra features are on board. These include everything from quick-access awareness to transparency modes (your music pauses and the headphones open up to the outside world so you can have a conversation) to special sound modes like EQ customization to ear-detection sensors that automatically pause your music when you take the headphones off your ears. Models with Bluetooth multipoint, or the ability to connect to several devices at once, are also noted within the \"additional details\" section of each product. We also take a look at the companion app for the headphones if there is one and how user friendly it is as well as battery life claims.\nVoice calling\nWhen we test voice-calling performance, we make calls in the noisy streets of New York and evaluate how well the headphones or earbuds reduce background noise and how clearly callers can hear our voice. We assess their reaction to traffic noise and windy conditions for microphone performance. We also move between quiet and noisy environments to test their response. We collect feedback from call recipients about voice clarity and background noise reduction.\nValue\nWe determine value after evaluating the strength of the headphones and earbuds against all these criteria and what they're able to deliver compared to other models in their price class.\nOther noise-canceling headphones we tested\nBowers & Wilkins PX7 S2: Bowers & Wilkins released the PX7 S2 headphones in 2022 with some significant improvements over the first-generation version.That was followed by a slightly upgraded version, the PX7 S2e ($400), with the \"e\" standing for evolved. The audio quality has been slightly upgraded thanks to improved digital processing (the headphones have been retuned), which we assume involves an upgraded chip. You may see this model nicely discounted because Bowers & Wilkins has released the PX7 S3 ($450) in 2025 with both design and performance upgrades.\n1More SonoFlow: The design of 1More's SonoFlow headphones reminds me a little of some earlier Sony headphones and also the newer Sennheiser Momentum Wireless 4. They're a bit generic looking, but they're sleek enough, and more importantly, they're comfortable to wear. They also feature very respectable sound quality. Though it doesn't quite measure up to the sound quality of what you'll get with more premium models like the Momentum Wireless 4, it isn't that far off. The SonoFlow headphones deliver smooth sound with good clarity and relatively well-defined bass (they're just not quite as rich or dynamic sounding as those premium models I mentioned). They also have support for the LDAC audio codec.\nGoogle Pixel Buds Pro: The Pixel Buds Pro are Google's first earbuds to feature active noise canceling. While it's nice that they finally have a feature that a lot of true-wireless earbuds have had for a while, what ultimately sets the Pixel Buds Pro apart and makes them worth considering -- particularly for Android users -- is their distinct design and winning fit. That helps enhance their performance on both the sound quality and noise-canceling fronts. While not quite elite for voice-calling, they also performed well as a headset for making calls. Read our Google Pixel Buds Pro review.\nSoundcore by Anker Space One: Available in three color options, the Soundcore Space One are Anker's latest noise-canceling headphones and a good value for around $100, offering a strong feature set along with good sound quality and performance. They can't quite compete sound-wise with many of the premium noise-canceling models, but you don't feel like you're giving up that much on the sound front to save a good deal of money. They lack a bit of that natural, refined quality you look for in a great set of cans, but the Space Ones sound respectable, with decent clarity and bass definition and measure up well to the more expensive Soundcore Space 45. Noise-canceling and voice-calling performance are also good for headphones in this price range, though the transparency mode is only OK. Anker has developed a version of Sony's Speak-to-Chat feature -- Anker calls it Easy Chat -- that automatically pauses your music and enters a transparency mode when you walk up to someone and start a conversation. The headphones are equipped with wear-detection sensors, a feature not usually found at this price, and include a carrying pouch. LDAC audio codec support is available for Android users.\nShure Aonic 50: A lot of us liked Shure's original Aonic 50 headphones, but they had pretty middling noise cancellation. Well, the 2nd-gen version addresses that issue -- the noise canceling is much improved -- and Shure has more than doubled the the battery life to around 45 hours (they now have a quick-charge feature) and also shrunk the headphone's carry case a bit, though it's still not that compact. Those upgrades make the Aonic 50 Gen 2 a top noise-canceling headphone. While the Aonic 50 Gen 2s are pretty heavy at 334 grams, they're built sturdily and are also comfortable to wear, with nicely padded ear cups. They feature excellent sound quality with very good clarity and well-defined bass. Shure call them a \"studio headphone,\" so the sound profile is fairly neutral, but you can add more bass in the EQ settings in Shure's companion app for iOS and Android (engaging the Spatializer setting in the app expands the soundstage slightly but doesn't make a big difference).\nMark Levinson No. 5909: The No. 5909 are premium audio brand Mark Levinson's first headphones and, yes, they're really expensive at $999. But they're also really good. They have a sturdy design without managing to feel hefty on your head (read: they're substantial but not too heavy) and they're comfortable to wear over long periods thanks to their nicely padded (and replaceable) leather-covered earcups and headband. Read our Mark Levinson No. 5909 hands-on.\nFocal Bathys: French audio company Focal is known for its high-end speaker systems and headphones. You might call it the Bowers & Wilkins of France. And now it's finally done what a lot of high-end audio companies have had to do in this age of on-the-go wireless music listening: make active noise-canceling Bluetooth headphones. These $699 cans sound fantastic and are great overall but their noise-canceling is fairly light, so don't buy them for their ANC. Learn more about the premium model in our full Focal Bathys hands-on.\nMaster & Dynamic MW09: Master & Dynamic headphones and earbuds have always featured unique, eye-catching designs that include premium materials like aluminum, sapphire glass and Kevlar. Its latest MW09 flagship earbuds look pretty similar to its earlier MW08 buds, but have some upgrades on the inside that deliver better performance, particularly when it comes to battery life and noise canceling (it's now very close to what Bose and Sony offer, though not quite at their level for ANC).\nSamsung Galaxy Buds 2 Pro: The Galaxy Buds 2 Pro offer improved noise canceling along with very good sound and voice-calling performance, plus support for high-resolution wireless audio streaming if you're a Galaxy device owner with the right setup. That said, their biggest upgrade may be their new design and smaller size, which make them a better fit for more ears. Aside from their somewhat high price tag, their only drawback is that some of their key features only work with Samsung Galaxy devices. So if you're a Galaxy user or otherwise interested in the model, you can read more in my full Samsung Galaxy Buds 2 Pro review.\nBeats Studio Buds Plus: Alas, for those of you who bought the original Beats Studio Buds, which remain on the market for now, I'm sorry to report that these new Plus buds are significantly improved, with better sound, noise canceling and battery life. Additionally, they now deliver top-notch voice-calling performance. If you're interested in making the upgrade, check out my full Beats Studio Buds Plus review.\nBeats Fit Pro: While the Beats Fit Pro technically aren't AirPods, they're built on the same tech platform as the AirPods Pro (yes, Apple owns Beats). Unlike Beats' earlier and less expensive Studio Buds and 2023 Studio Buds Plus, the Beats Fit Pro include Apple's H1 chip and have most of the AirPods Pro's features, including active noise canceling, spatial audio and Adaptive EQ. I'd venture to call them the sports AirPods you've always wanted. Read more about the model in my full Beats Fit Pro review.\nTechnics EAH-A800: There's a bit of an old-school vibe to the Technics EAH-A800 -- and it's not just the Technics brand, which Panasonic resurrected in the last few years. Their design is something of a throwback but the headphones are comfortable and both fold up and fold flat. They feature a big, energetic sound with powerful bass and good detail (however, they take a day or two to break in).\nTechnics EAH-AZ80: Panasonic has done a nice job of creating an all-around top-performing set of buds that offer an improved fit with terrific sound, good noise canceling and a robust feature set."
    },
    {
      "url": "https://www.cnet.com/culture/internet/you-can-eat-cicadas-but-be-careful-if-you-have-seafood-allergies-fda-warns/",
      "text": "In case you missed it, trillions of Brood X cicadas are emerging in the eastern US for the first time in 17 years after spending most of their lives underground. Some are turning to pest control, but there's another more natural way to manage this insect inundation. Cook 'em up and eat 'em.\nWhy would you do that if there are so many other (arguably less creepy) things to eat? Well, many people are looking for alternative ways to consume protein to offset the environmental impact of raising cattle, for instance, which requires lots of space, water and other resources. Insects, on the other hand, emit fewer greenhouse gasses and can boast more protein than meat.\nThe US Food and Drug Administration does, however urge caution for those allergic to seafood \"as these insects share a family relation to shrimp and lobsters.\"\nFor the rest of us, \"there is the yuck factor,\" Johns Hopkins University sustainable food expert Jessica Fanzo acknowledged in a statement, \"but people who are looking for alternative sources of animal protein shouldn't rule out cicadas. Once you get over the look of them, they're quite tasty.\"\nOddly enough, a Google search for \"cicada recipes\" pulls up several ways to cook various species of these insects, from topping your pizza with them to squeezing them between some bread for a crunchy, extra meaty sandwich. Twitter has also been buzzing with conversations about these offbeat meal ideas, and chef Joseph Yoon has been sharing different ways to eat cicadas through his Instagram and Twitter account Brooklyn Bugs.\nExperts say it's best to eat cicadas just after the nymphs have climbed out of their skin, when they're nice and soft. Just go outside with a paper bag and scoop them up. Cook them right away, or save them in the fridge or freezer for later.\nHere are some recipes to try if you're looking to spice up your summer menu.\nCicada nymph spring salad\nLet's start with a nice appetizer. Yoon has cooked up various ways to consume Brood X nymphs, including throwing them into a salad with asparagus, peas, red onions, chili, garlic, butter, lemon and mint. Looks extra crispy.\nCicada nymph chili guacamole\nIf you're looking for a little more crunch, consider pairing some chips with a nice cicada guacamole, also by Yoon. Start by combining mashed avocado with salt and pepper, squeeze some lemon on top, and sauté red onions, jalapeños, chili peppers and garlic. Throw in some blanched cicada nymphs and you're all set.\nCicada kimchi\nNow on to the main course. Yoon also cooks up a cicada kimchi with kennip, brown rice, cucumber and mint. It's all very artfully plated, and if you're uneasy about those little red eyes staring you down while you eat, you'll be happy to know you can't even spot the crushed-up critters in this dish. There's also a dash of extra protein, as the kimchi paste is mixed with cricket powder before the blanched cicada nymphs are tossed in.\nCicada nymph chocolate with 24k gold\nIf you're treating yourself to something as rare as these cicadas, it's only appropriate to go all out by topping them with chocolate and gold foil. Delectable. (Here's another recipe for chocolate-covered cicadas without the gold, if you're looking to scale back a bit.)\nCicada ramen\nIf you want to keep your meal prep simple, throw some fried cicadas into a pan of noodles and veggies and call it a day.\nCicada pizza\nAnchovies are so mainstream. Try adding cicadas to your pie instead. Here's a recipe that includes kalamata olives, shiitake mushrooms, fresh basil and, of course, blanched cicadas.\nOther recipes\n- To finish off that pizza, opt for some chocolately cicada \"Emergence cookies.\"\n- Try grilling cicadas with some summer vegetables like squash and cherry tomatoes.\n- Make this cicada and saffron risotto if you're looking for some bold flavor.\n- This recipe book has everything from banana cicada bread to cicada stir fry.\n- Shake up Taco Tuesdays with these \"El chirper tacos.\"\n- Another dessert option: cicada rhubarb pie.\n- And here are the various ways to cook up cicadas: dry roast, deep fry or sauté them."
    }
  ],
  "argos_summary": "Cicadas, particularly Brood XIV, are emerging in large numbers across the eastern U.S. after 17 years underground, causing noise and potential damage to young trees. While they can be a nuisance, they are not harmful to humans and can be managed by ignoring them or using protective measures for trees. Interestingly, cicadas can also be consumed, offering a sustainable protein source, with various recipes available for those willing to try them.",
  "argos_id": "LBCY7S5RP"
}