{
  "url": "https://finance.yahoo.com/news/airbnb-inc-just-beat-eps-113618968.html",
  "authorsByline": "Simply Wall St",
  "articleId": "cb80153168ff4d0bbd52bdc4bd1e3f55",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/simply_wall_st__316/cb90bae557d50c77576d28ff3b1c0eed",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T11:36:18+00:00",
  "addDate": "2025-08-08T11:50:55.982943+00:00",
  "refreshDate": "2025-08-08T11:50:55.982944+00:00",
  "score": 1.0,
  "title": "Airbnb, Inc. Just Beat EPS By 9.5%: Here's What Analysts Think Will Happen Next",
  "description": "NasdaqGS:ABNB 1 Year Share Price vs Fair Value Explore Airbnb's Fair Values from the Community and select yours Airbnb...",
  "content": "Explore Airbnb's Fair Values from the Community and select yours\n\n\n\nAirbnb, Inc. (NASDAQ:ABNB) just released its second-quarter report and things are looking bullish. The company beat expectations with revenues of US$3.1b arriving 2.2% ahead of forecasts. Statutory earnings per share (EPS) were US$1.03, 9.5% ahead of estimates. The analysts typically update their forecasts at each earnings report, and we can judge from their estimates whether their view of the company has changed or if there are any new concerns to be aware of. So we gathered the latest post-earnings forecasts to see what estimates suggest is in store for next year.\n\nThis technology could replace computers: discover the 20 stocks are working to make quantum computing a reality.\n\nAfter the latest results, the 40 analysts covering Airbnb are now predicting revenues of US$12.1b in 2025. If met, this would reflect a credible 4.5% improvement in revenue compared to the last 12 months. Statutory per share are forecast to be US$4.26, approximately in line with the last 12 months. Before this earnings report, the analysts had been forecasting revenues of US$12.1b and earnings per share (EPS) of US$4.24 in 2025. So it's pretty clear that, although the analysts have updated their estimates, there's been no major change in expectations for the business following the latest results.\n\nCheck out our latest analysis for Airbnb\n\nIt will come as no surprise then, to learn that the consensus price target is largely unchanged at US$140. It could also be instructive to look at the range of analyst estimates, to evaluate how different the outlier opinions are from the mean. The most optimistic Airbnb analyst has a price target of US$200 per share, while the most pessimistic values it at US$96.00. This is a fairly broad spread of estimates, suggesting that analysts are forecasting a wide range of possible outcomes for the business.\n\nOf course, another way to look at these forecasts is to place them into context against the industry itself. It's pretty clear that there is an expectation that Airbnb's revenue growth will slow down substantially, with revenues to the end of 2025 expected to display 9.2% growth on an annualised basis. This is compared to a historical growth rate of 23% over the past five years. Juxtapose this against the other companies in the industry with analyst coverage, which are forecast to grow their revenues (in aggregate) 9.7% annually. So it's pretty clear that, while Airbnb's revenue growth is expected to slow, it's expected to grow roughly in line with the industry.",
  "medium": "Article",
  "links": [
    "https://au.finance.yahoo.com/quote/ABNB",
    "https://simplywall.st/markets/us/consumer-discretionary/hospitality?blueprint=3972342&utm_medium=finance_user&utm_campaign=industry&utm_source=yahoo",
    "https://simplywall.st/discover/investing-ideas/282/quantum-computing-stocks/global?blueprint=3972342&utm_medium=finance_user&utm_campaign=investing-ideas&utm_source=yahoo&utm_content=quantum-computing",
    "https://simplywall.st/stock/nasdaqgs/abnb?blueprint=3972342&utm_medium=finance_user&utm_campaign=narratives-news-header&utm_source=yahoo&utm_content=narrative-header-stocks-page",
    "https://simplywall.st/company/id/D970339B-47D3-43EB-BC35-F071A608FF9B?blueprint=3972342&utm_medium=finance_user&utm_campaign=cta&utm_source=yahoo",
    "https://simplywall.st/company/id/D970339B-47D3-43EB-BC35-F071A608FF9B/future?blueprint=3972342&amp;utm_medium=finance_user&amp;utm_campaign=infographic&amp;utm_source=yahoo"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "analyst estimates",
      "weight": 0.11736484
    },
    {
      "name": "analyst coverage",
      "weight": 0.09471263
    },
    {
      "name": "Analysts",
      "weight": 0.092988685
    },
    {
      "name": "analysts",
      "weight": 0.092988685
    },
    {
      "name": "Airbnb",
      "weight": 0.09071607
    },
    {
      "name": "revenue",
      "weight": 0.08756602
    },
    {
      "name": "revenues",
      "weight": 0.08756602
    },
    {
      "name": "estimates",
      "weight": 0.08276124
    },
    {
      "name": "Airbnbs revenue growth",
      "weight": 0.07219383
    },
    {
      "name": "forecasts",
      "weight": 0.06653056
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98388671875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97509765625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9697265625
    }
  ],
  "sentiment": {
    "positive": 0.061828613,
    "negative": 0.67529297,
    "neutral": 0.2626953
  },
  "summary": "Airbnb, Inc. (NASDAQ:ABNB) recently reported a 9.5% increase in Q2 earnings, with revenues of US$3.1b arriving 2.2% ahead of forecasts. The company's statutory earnings per share (EPS) were also 9.05% higher than expected. Following the results, 40 analysts covering Airbnb are now predicting revenues of €12.1bn in 2025, reflecting a 4.5 increase in revenue compared to the last 12 months. The consensus price target for the company remains largely unchanged at US$140. However, there is an expectation that Airbnb's revenue growth will slow significantly, with annualised revenues expected to show 9.2%, compared to a historical growth rate of 23% over the past five years.",
  "shortSummary": "Airbnb's second-quarter earnings beat expectations by 9.5%, with forecasts for US$12.1b in revenues still unchanged, indicating a potential slowdown in growth.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "502775020ef94d16bea558727252e91a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://simplywall.st/company/id/D970339B-47D3-43EB-BC35-F071A608FF9B/future?blueprint=3972342&amp;utm_medium=finance_user&amp;utm_campaign=infographic&amp;utm_source=yahoo",
      "text": "Airbnb Future Growth\nFuture criteria checks 3/6\nAirbnb is forecast to grow earnings and revenue by 12.1% and 9.4% per annum respectively. EPS is expected to grow by 11.4% per annum. Return on equity is forecast to be 22.6% in 3 years.\nKey information\n12.1%\nEarnings growth rate\n11.35%\nEPS growth rate\n| Hospitality earnings growth | 21.1% |\n| Revenue growth rate | 9.4% |\n| Future return on equity | 22.57% |\n| Analyst coverage | Good |\n| Last updated | 07 Aug 2025 |\nRecent future growth updates\nAirbnb, Inc. (NASDAQ:ABNB) Analysts Are Pretty Bullish On The Stock After Recent Results\nFeb 15Airbnb, Inc. (NASDAQ:ABNB) Just Released Its Third-Quarter Earnings: Here's What Analysts Think\nNov 09Recent updates\nThis Is Why Airbnb Can't Outperform The Market Right Now (Earnings Review)\nAug 07When Should You Buy Airbnb, Inc. (NASDAQ:ABNB)?\nJul 21Investors Shouldn't Overlook Airbnb's (NASDAQ:ABNB) Impressive Returns On Capital\nJul 07These 4 Measures Indicate That Airbnb (NASDAQ:ABNB) Is Using Debt Safely\nJun 23Airbnb Earnings: Mixed Outlook And Some Short-Term Tailwinds\nApr 28Airbnb: Expect Weak Trends Through H1 2025\nApr 16535 Upgrades And Co-Host Network Will Transform Guest Experience\nAirbnb's feature upgrades and product optimizations are driving higher conversion rates, poised to significantly boost revenue in the future.Airbnb, Inc.'s (NASDAQ:ABNB) Share Price Is Still Matching Investor Opinion Despite 25% Slump\nApr 05When Should You Buy Airbnb, Inc. (NASDAQ:ABNB)?\nMar 26AirBnb: An Outstanding Business Now At A Reasonable Price\nMar 15Airbnb, Inc. (NASDAQ:ABNB) Analysts Are Pretty Bullish On The Stock After Recent Results\nFeb 15Airbnb Q4 Earnings: Inflection Point Is Here\nFeb 14Airbnb Is Beaten Down, Buy Before Experiences Brings It Back\nFeb 07Airbnb, Inc. (NASDAQ:ABNB) Not Lagging Market On Growth Or Pricing\nJan 19Airbnb: Excited For An Expanding Market In 2025\nJan 19Airbnb: A Messy Transition Into A More Mature Business Model\nJan 10Is There An Opportunity With Airbnb, Inc.'s (NASDAQ:ABNB) 40% Undervaluation?\nJan 05Airbnb: Tough Road Ahead As Hotel Competitors Close In With Strong Bookings\nDec 09At US$137, Is It Time To Put Airbnb, Inc. (NASDAQ:ABNB) On Your Watch List?\nDec 04Why Airbnb Q3 Earnings Signal Potential Growth Slowdown In 2025\nNov 14Airbnb, Inc. (NASDAQ:ABNB) Just Released Its Third-Quarter Earnings: Here's What Analysts Think\nNov 09Airbnb Earnings: Still Growing, But This Stock Is Too Expensive\nNov 08Is There An Opportunity With Airbnb, Inc.'s (NASDAQ:ABNB) 40% Undervaluation?\nOct 07Airbnb: Losing Patience As Travel Bookings Lose Steam (Rating Downgrade)\nOct 03Airbnb: Profitable Growth At A Reasonable Price\nSep 26These 4 Measures Indicate That Airbnb (NASDAQ:ABNB) Is Using Debt Reasonably Well\nSep 25Airbnb Stock: A Free Cash Flow Machine In The Bargain Bin\nSep 18Airbnb: An Attractive Play\nAug 31Lacklustre Performance Is Driving Airbnb, Inc.'s (NASDAQ:ABNB) Low P/E\nAug 27Airbnb Could Be A Strong Buy Soon\nAug 25Airbnb: Shorter Bookings Trend Implies A Weak Consumer Spending (Rating Downgrade)\nAug 11Should You Investigate Airbnb, Inc. (NASDAQ:ABNB) At US$115?\nAug 09The Opportunity Of Airbnb's Q2 Earnings\nAug 04Airbnb: Promising Prospects With Manageable Challenges\nJul 11Airbnb: A High-Quality Business At A Reasonable Price\nJun 25Airbnb: Growth Potential Despite Potential Overvaluation, Cautious Buy\nJun 09ABNB: Short-Term Rentals With Long-Term Gains\nJun 02Airbnb: A Global Sensation\nMay 27Airbnb: Laying The Groundwork To Go 'Multi-Vertical'\nMay 17Airbnb: Don't Rush To Buy The Dip\nMay 10Airbnb: Growing With Global Travel Market Recovery\nApr 15Airbnb Is Differentiated In Online Travel\nApr 06Earnings and Revenue Growth Forecasts\n| Date | Revenue | Earnings | Free Cash Flow | Cash from Op | Avg. No. Analysts |\n|---|---|---|---|---|---|\n| 12/31/2027 | 14,623 | 3,400 | 5,112 | 5,508 | 21 |\n| 12/31/2026 | 13,236 | 2,971 | 4,826 | 4,921 | 40 |\n| 12/31/2025 | 12,101 | 2,684 | 4,203 | 4,411 | 37 |\n| 6/30/2025 | 11,580 | 2,625 | 4,308 | 4,308 | N/A |\n| 3/31/2025 | 11,232 | 2,538 | 4,384 | 4,384 | N/A |\n| 12/31/2024 | 11,102 | 2,648 | 4,518 | 4,518 | N/A |\n| 9/30/2024 | 10,840 | 1,838 | 4,115 | 4,115 | N/A |\n| 6/30/2024 | 10,505 | 4,844 | 4,362 | 4,362 | N/A |\n| 3/31/2024 | 10,241 | 4,939 | 4,220 | 4,220 | N/A |\n| 12/31/2023 | 9,917 | 4,792 | 3,884 | 3,884 | N/A |\n| 9/30/2023 | 9,601 | 5,460 | 4,301 | 4,284 | N/A |\n| 6/30/2023 | 9,088 | 2,300 | 3,934 | 3,923 | N/A |\n| 3/31/2023 | 8,708 | 2,029 | 3,821 | 3,815 | N/A |\n| 12/31/2022 | 8,399 | 1,893 | 3,430 | 3,430 | N/A |\n| 9/30/2022 | 8,029 | 1,629 | 3,328 | 3,349 | N/A |\n| 6/30/2022 | 7,383 | 1,248 | 2,899 | 2,920 | N/A |\n| 3/31/2022 | 6,614 | 801 | 2,885 | 2,909 | N/A |\n| 12/31/2021 | 5,992 | -352 | 2,313 | 2,313 | N/A |\n| 9/30/2021 | 5,319 | -4,294 | 1,763 | 1,792 | N/A |\n| 6/30/2021 | 4,424 | -4,909 | 1,562 | 1,593 | N/A |\n| 3/31/2021 | 3,423 | -5,416 | 517 | 546 | N/A |\n| 12/31/2020 | 3,378 | -4,585 | -777 | -740 | N/A |\n| 9/30/2020 | 3,626 | -1,048 | -743 | -687 | N/A |\n| 12/31/2019 | 4,805 | -674 | 97 | 223 | N/A |\n| 12/31/2018 | 3,652 | -17 | N/A | 596 | N/A |\n| 12/31/2017 | 2,562 | -70 | N/A | 251 | N/A |\nAnalyst Future Growth Forecasts\nEarnings vs Savings Rate: ABNB's forecast earnings growth (12.1% per year) is above the savings rate (3.1%).\nEarnings vs Market: ABNB's earnings (12.1% per year) are forecast to grow slower than the US market (14.8% per year).\nHigh Growth Earnings: ABNB's earnings are forecast to grow, but not significantly.\nRevenue vs Market: ABNB's revenue (9.4% per year) is forecast to grow faster than the US market (9.3% per year).\nHigh Growth Revenue: ABNB's revenue (9.4% per year) is forecast to grow slower than 20% per year.\nEarnings per Share Growth Forecasts\nFuture Return on Equity\nFuture ROE: ABNB's Return on Equity is forecast to be high in 3 years time (22.6%)\nDiscover growth companies\nCompany Analysis and Financial Data Status\n| Data | Last Updated (UTC time) |\n|---|---|\n| Company Analysis | 2025/08/07 10:35 |\n| End of Day Share Price | 2025/08/07 00:00 |\n| Earnings | 2025/06/30 |\n| Annual Earnings | 2024/12/31 |\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n| Package | Data | Timeframe | Example US Source * |\n|---|---|---|---|\n| Company Financials | 10 years |\n| |\n| Analyst Consensus Estimates | +3 years |\n|\n|\n| Market Prices | 30 years |\n| |\n| Ownership | 10 years |\n| |\n| Management | 10 years |\n| |\n| Key Developments | 10 years |\n|\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nAirbnb, Inc. is covered by 56 analysts. 40 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day.\n| Analyst | Institution |\n|---|---|\n| Colin Sebastian | Baird |\n| Ishan Majumdar | Baptista Research |\n| Trevor Young | Barclays |"
    },
    {
      "url": "https://simplywall.st/discover/investing-ideas/282/quantum-computing-stocks/global?blueprint=3972342&utm_medium=finance_user&utm_campaign=investing-ideas&utm_source=yahoo&utm_content=quantum-computing",
      "text": "Results\n27\nExplore top quantum computing companies leading the revolution in next-gen technology, from pioneering hardware manufacturers to innovative software developers. These industry leaders are shaping the future with breakthroughs in quantum algorithms, superconducting qubits, and cutting-edge research.\n27 companies\nQuantumCTek\nMarket Cap: CN¥27.9b\nManufactures and sells quantum information technology enabled information and communication technology security products and services in China.\n688027\nCN¥267.64\n7D\n-0.5%\n1Y\n76.2%\nOptowide Technologies\nMarket Cap: CN¥5.9b\nEngages in the research, development, production, and sale of precision optics and fiber components in China and internationally.\n688195\nCN¥44.12\n7D\n-5.6%\n1Y\n103.1%\nIntellect Design Arena\nMarket Cap: ₹131.7b\nEngages in the development, marketing, and sale of integrated banking software systems in India and internationally.\nINTELLECT\n₹936.10\n7D\n-4.7%\n1Y\n-0.2%\nQuanta Computer\nMarket Cap: NT$1.1t\nManufactures, processes, and sells laptop computers and telecommunication products in the United States, Mainland China, the Netherlands, Japan, and internationally.\n2382\nNT$290.50\n7D\n1.9%\n1Y\n16.2%\nWonik IPS\nMarket Cap: ₩1.5t\nResearches and develops, manufactures, and sells semiconductor, display, and solar cell systems in South Korea.\nA240810\n₩35,850.00\n7D\n17.0%\n1Y\n3.6%\nNagarro\nMarket Cap: €698.2m\nProvides digital product engineering and technology solutions in Germany, the United States of America, and internationally.\nNA9\n€55.25\n7D\n-0.8%\n1Y\n-27.1%\nOxford Instruments\nMarket Cap: UK£1.0b\nOxford Instruments plc provide scientific technology products and services for academic and commercial organizations in the United Kingdom and internationally.\nOXIG\nUK£18.10\n7D\n-0.3%\n1Y\n-21.0%\nFormFactor\nMarket Cap: US$2.1b\nDesigns, manufactures, and sells probe cards, analytical probes, probe stations, thermal systems, cryogenic systems, and related services in the United States and internationally.\nFORM\nUS$27.98\n7D\n-1.5%\n1Y\n-37.2%\nViavi Solutions\nMarket Cap: US$2.2b\nProvides network test, monitoring, and assurance solutions for communications service providers, hyperscalers, network equipment manufacturers, original equipment manufacturers, government, and avionics customers in the Americas, the Asia-Pacific, Europe, the Middle East, and Africa.\nVIAV\nUS$10.16\n7D\n1.1%\n1Y\n29.3%\nOracle Corporation Japan\nMarket Cap: JP¥2.2t\nEngages in the development and sale of software and hardware products and solutions in Japan.\n4716\nJP¥16,485.00\n7D\n0.5%\n1Y\n34.8%\nNovanta\nMarket Cap: US$4.1b\nProvides precision medicine, precision manufacturing, medical solutions, robotics and automation solutions, and advanced surgery solutions in the United States and internationally.\nNOVT\nUS$113.73\n7D\n-7.6%\n1Y\n-34.7%\nMicrosoft\nMarket Cap: US$3.9t\nDevelops and supports software, services, devices, and solutions worldwide.\nMSFT\nUS$520.84\n7D\n-2.4%\n1Y\n29.3%\nAlphabet\nMarket Cap: US$2.4t\nOffers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America.\nGOOGL\nUS$196.52\n7D\n2.4%\n1Y\n21.3%\nInternational Business Machines\nMarket Cap: US$235.0b\nProvides integrated solutions and services in the Americas, Europe, the Middle East, Africa, and the Asia Pacific.\nIBM\nUS$250.16\n7D\n-1.2%\n1Y\n29.9%\nClearwater Analytics Holdings\nMarket Cap: US$6.1b\nDevelops and provides a Software-as-a-Service (SaaS) solution for automated investment data aggregation, reconciliation, accounting, and reporting services to insurers, investment managers, corporations, institutional investors, and government entities in the United States and internationally.\nCWAN\nUS$18.79\n7D\n-7.3%\n1Y\n-18.2%\nTencent Holdings\nMarket Cap: HK$5.1t\nAn investment holding company, provides value-added services, marketing services, fintech, and business services in Mainland China and internationally.\n700\nHK$561.00\n7D\n4.9%\n1Y\n51.6%\nOpen Text\nMarket Cap: US$7.4b\nEngages in the provision of information management products and services.\nOTEX\nUS$28.14\n7D\n-4.4%\n1Y\n-6.3%\nBTQ Technologies\nMarket Cap: CA$871.9m\nEngages in the development of computer-based technology related to post-quantum cryptography for applications in blockchain and related technologies.\nBTQ\nCA$6.34\n7D\n1.8%\n1Y\n1,568.4%\nIonQ\nMarket Cap: US$11.7b\nDevelops quantum computers and networks in the United States.\nIONQ\nUS$40.49\n7D\n1.6%\n1Y\n469.5%\nD-Wave Quantum\nMarket Cap: US$5.6b\nDevelops and delivers quantum computing systems, software, and services worldwide.\nQBTS\nUS$17.17\n7D\n-0.1%\n1Y\n2,046.2%\nRigetti Computing\nMarket Cap: US$5.2b\nThrough its subsidiaries, builds quantum computers and the superconducting quantum processors the United States, the United Kingdom, rest of Europe, Asia, and internationally.\nRGTI\nUS$15.66\n7D\n8.0%\n1Y\n1,785.6%\nQuantum Computing\nMarket Cap: US$2.5b\nAn integrated photonics company, provides quantum machines to commercial and government markets in the United States.\nQUBT\nUS$15.76\n7D\n6.2%\n1Y\n2,513.6%\nCheck Point Software Technologies\nMarket Cap: US$20.2b\nDevelops, markets, and supports a range of products and services for IT security worldwide.\nCHKP\nUS$185.03\n7D\n-0.6%\n1Y\n3.1%\nSystena\nMarket Cap: JP¥178.4b\nEngages in the solution and framework design, IT service, business solution, and cloud businesses in Japan.\n2317\nJP¥509.00\n7D\n6.9%\n1Y\n44.6%\nHengtong Optic-Electric\nMarket Cap: CN¥39.3b\nOperates in the fiber optic communications industry in China, Europe, Latin America, Southeast Asia, the Middle East, and North Africa.\n600487\nCN¥16.97\n7D\n7.5%\n1Y\n20.1%\nShenzhen Infinova\nMarket Cap: CN¥3.6b\nProvides electronic security products and solutions China and internationally.\n002528\nCN¥2.94\n7D\n2.4%\n1Y\n31.3%\nQuanta Storage\nMarket Cap: NT$25.5b\nResearches, develops, produces, manufactures, and sells data storage and processing equipment, electronic components, optical instruments, and industrial robots in Mainland China, Thailand, the United States, Korea, Netherlands, Japan, and internationally.\n6188\nNT$91.60\n7D\n3.0%\n1Y\n-2.7%"
    },
    {
      "url": "https://simplywall.st/markets/us/consumer-discretionary/hospitality?blueprint=3972342&utm_medium=finance_user&utm_campaign=industry&utm_source=yahoo",
      "text": "Over the last 7 days, the Hospitality industry has remained flat, although notably DoorDash gained 8.3%. As for the the longer term, the industry is up 32% over the past 12 months. As for the next few years, earnings are expected to grow by 21% per annum.\nHas the U.S. Hospitality Industry valuation changed over the past few years?\n| Date | Market Cap | Revenue | Earnings | PE | Absolute PE | PS |\n|---|---|---|---|---|---|---|\n| Fri, 08 Aug 2025 | US$854.6b | US$328.2b | US$25.6b | 22.2x | 33.4x | 2.6x |\n| Sun, 06 Jul 2025 | US$887.6b | US$324.4b | US$24.9b | 24.4x | 35.7x | 2.7x |\n| Tue, 03 Jun 2025 | US$804.1b | US$325.3b | US$24.5b | 22.4x | 32.9x | 2.5x |\n| Thu, 01 May 2025 | US$749.1b | US$318.8b | US$24.5b | 22.5x | 30.5x | 2.3x |\n| Sat, 29 Mar 2025 | US$774.6b | US$318.2b | US$24.0b | 23x | 32.3x | 2.4x |\n| Mon, 24 Feb 2025 | US$818.1b | US$309.2b | US$21.7b | 24.5x | 37.6x | 2.6x |\n| Wed, 22 Jan 2025 | US$794.3b | US$303.7b | US$20.1b | 23x | 39.5x | 2.6x |\n| Fri, 20 Dec 2024 | US$789.3b | US$303.7b | US$19.7b | 23.5x | 40x | 2.6x |\n| Sun, 17 Nov 2024 | US$790.3b | US$303.5b | US$19.5b | 24.4x | 40.6x | 2.6x |\n| Tue, 15 Oct 2024 | US$756.2b | US$301.9b | US$20.3b | 23.8x | 37.2x | 2.5x |\n| Thu, 12 Sep 2024 | US$673.1b | US$301.2b | US$19.7b | 19.3x | 34.1x | 2.2x |\n| Sat, 10 Aug 2024 | US$639.9b | US$299.3b | US$19.1b | 18.5x | 33.6x | 2.1x |\n| Mon, 08 Jul 2024 | US$692.9b | US$296.5b | US$19.8b | 19.2x | 35x | 2.3x |\n| Wed, 05 Jun 2024 | US$653.9b | US$283.2b | US$20.6b | 18.9x | 31.7x | 2.3x |\n| Fri, 03 May 2024 | US$658.5b | US$282.3b | US$19.7b | 20.2x | 33.5x | 2.3x |\n| Sun, 31 Mar 2024 | US$697.7b | US$278.9b | US$20.2b | 20.7x | 34.5x | 2.5x |\n| Tue, 27 Feb 2024 | US$654.4b | US$276.5b | US$19.4b | 19.8x | 33.7x | 2.4x |\n| Thu, 25 Jan 2024 | US$621.8b | US$269.1b | US$18.0b | 19.8x | 34.5x | 2.3x |\n| Sat, 23 Dec 2023 | US$626.9b | US$269.1b | US$18.0b | 20.4x | 34.8x | 2.3x |\n| Mon, 20 Nov 2023 | US$590.1b | US$265.9b | US$15.6b | 21.6x | 37.8x | 2.2x |\n| Wed, 18 Oct 2023 | US$548.7b | US$258.1b | US$10.2b | 20.1x | 53.7x | 2.1x |\n| Fri, 15 Sep 2023 | US$590.0b | US$255.2b | US$8.4b | 19.1x | 70.4x | 2.3x |\n| Sun, 13 Aug 2023 | US$607.0b | US$254.2b | US$8.0b | 20.1x | 76.1x | 2.4x |\n| Tue, 11 Jul 2023 | US$614.6b | US$244.8b | US$5.2b | 20.1x | 118.4x | 2.5x |\n| Thu, 08 Jun 2023 | US$586.3b | US$241.0b | US$3.1b | 20.1x | 186.5x | 2.4x |\n| Sat, 06 May 2023 | US$569.2b | US$239.7b | US$2.6b | 19.5x | 219.7x | 2.4x |\n| Mon, 03 Apr 2023 | US$663.4b | US$248.1b | US$1.8b | 19.9x | 358.6x | 2.7x |\n| Wed, 01 Mar 2023 | US$629.2b | US$236.8b | US$1.1b | 19.2x | 576.7x | 2.7x |\n| Fri, 27 Jan 2023 | US$685.9b | US$235.2b | US$1.3b | 19.2x | 529.5x | 2.9x |\n| Sun, 25 Dec 2022 | US$579.7b | US$234.8b | US$1.3b | 17.6x | 444.9x | 2.5x |\n| Tue, 22 Nov 2022 | US$596.0b | US$230.5b | US$315.2m | 18.5x | 1891.1x | 2.6x |\n| Thu, 20 Oct 2022 | US$562.1b | US$218.8b | -US$2,681,055,691.00 | 18x | -209.7x | 2.6x |\n| Sat, 17 Sep 2022 | US$596.6b | US$215.3b | -US$4,875,890,725.00 | 17x | -122.4x | 2.8x |\n| Mon, 15 Aug 2022 | US$633.4b | US$215.2b | -US$5,284,437,537.00 | 18.4x | -119.9x | 2.9x |\n-119.9x\nWhich industries have driven the changes within the U.S. Consumer Discretionary industry?\n| US Market | 0.20% | |\n| Consumer Discretionary | 2.53% | |\n| Hospitality | -0.82% | |\n| Restaurants | 2.30% | |\n| Casinos and Gaming | -1.68% | |\n| Hotels, Resorts and Cruise Lines | -3.13% | |\n| Leisure Facilities | -4.30% |\nWhich companies have driven the market over the last 7 days?\n| Company | Last Price | 7D | 1Y | Valuation | |\n|---|---|---|---|---|---|\n| DASH DoorDash | US$270.99 | 8.3% +US$8.8b | 117.2% | PE147x | |\n| MCD McDonald's | US$307.91 | 2.6% +US$5.2b | 13.5% | PE26.2x | |\n| SBUX Starbucks | US$91.02 | 4.8% +US$4.7b | 21.2% | PE39.3x | |\n| BROS Dutch Bros | US$70.27 | 18.6% +US$1.4b | 132.5% | PE155.8x | |\n| EXPE Expedia Group | US$187.61 | 4.1% +US$939.4m | 59.0% | PE20.4x |"
    },
    {
      "url": "https://simplywall.st/company/id/D970339B-47D3-43EB-BC35-F071A608FF9B?blueprint=3972342&utm_medium=finance_user&utm_campaign=cta&utm_source=yahoo",
      "text": "Airbnb (ABNB) Stock Overview\nOperates a platform that enables hosts to offer stays and experiences to guests worldwide. More details\n| Snowflake Score | |\n|---|---|\n| Valuation | 4/6 |\n| Future Growth | 3/6 |\n| Past Performance | 3/6 |\n| Financial Health | 6/6 |\n| Dividends | 0/6 |\nABNB Community Fair Values\nSee what 307 others think this stock is worth. Follow their fair value or set your own to get alerts.\nCore Improvements And Global Expansion Will Secure A Bright Future\nAirbnb, Inc. Competitors\nPrice History & Performance\n| Historical stock prices | |\n|---|---|\n| Current Share Price | US$120.03 |\n| 52 Week High | US$163.93 |\n| 52 Week Low | US$99.88 |\n| Beta | 1.13 |\n| 1 Month Change | -12.38% |\n| 3 Month Change | -5.52% |\n| 1 Year Change | 4.70% |\n| 3 Year Change | -1.21% |\n| 5 Year Change | n/a |\n| Change since IPO | -17.05% |\nRecent News & Updates\nThis Is Why Airbnb Can't Outperform The Market Right Now (Earnings Review)\nAug 07When Should You Buy Airbnb, Inc. (NASDAQ:ABNB)?\nJul 21Recent updates\nThis Is Why Airbnb Can't Outperform The Market Right Now (Earnings Review)\nAug 07When Should You Buy Airbnb, Inc. (NASDAQ:ABNB)?\nJul 21Investors Shouldn't Overlook Airbnb's (NASDAQ:ABNB) Impressive Returns On Capital\nJul 07These 4 Measures Indicate That Airbnb (NASDAQ:ABNB) Is Using Debt Safely\nJun 23Airbnb Earnings: Mixed Outlook And Some Short-Term Tailwinds\nApr 28Airbnb: Expect Weak Trends Through H1 2025\nApr 16535 Upgrades And Co-Host Network Will Transform Guest Experience\nAirbnb's feature upgrades and product optimizations are driving higher conversion rates, poised to significantly boost revenue in the future.Airbnb, Inc.'s (NASDAQ:ABNB) Share Price Is Still Matching Investor Opinion Despite 25% Slump\nApr 05When Should You Buy Airbnb, Inc. (NASDAQ:ABNB)?\nMar 26AirBnb: An Outstanding Business Now At A Reasonable Price\nMar 15Airbnb, Inc. (NASDAQ:ABNB) Analysts Are Pretty Bullish On The Stock After Recent Results\nFeb 15Airbnb Q4 Earnings: Inflection Point Is Here\nFeb 14Airbnb Is Beaten Down, Buy Before Experiences Brings It Back\nFeb 07Airbnb, Inc. (NASDAQ:ABNB) Not Lagging Market On Growth Or Pricing\nJan 19Airbnb: Excited For An Expanding Market In 2025\nJan 19Airbnb: A Messy Transition Into A More Mature Business Model\nJan 10Is There An Opportunity With Airbnb, Inc.'s (NASDAQ:ABNB) 40% Undervaluation?\nJan 05Airbnb: Tough Road Ahead As Hotel Competitors Close In With Strong Bookings\nDec 09At US$137, Is It Time To Put Airbnb, Inc. (NASDAQ:ABNB) On Your Watch List?\nDec 04Why Airbnb Q3 Earnings Signal Potential Growth Slowdown In 2025\nNov 14Airbnb, Inc. (NASDAQ:ABNB) Just Released Its Third-Quarter Earnings: Here's What Analysts Think\nNov 09Airbnb Earnings: Still Growing, But This Stock Is Too Expensive\nNov 08Is There An Opportunity With Airbnb, Inc.'s (NASDAQ:ABNB) 40% Undervaluation?\nOct 07Airbnb: Losing Patience As Travel Bookings Lose Steam (Rating Downgrade)\nOct 03Airbnb: Profitable Growth At A Reasonable Price\nSep 26These 4 Measures Indicate That Airbnb (NASDAQ:ABNB) Is Using Debt Reasonably Well\nSep 25Airbnb Stock: A Free Cash Flow Machine In The Bargain Bin\nSep 18Airbnb: An Attractive Play\nAug 31Lacklustre Performance Is Driving Airbnb, Inc.'s (NASDAQ:ABNB) Low P/E\nAug 27Airbnb Could Be A Strong Buy Soon\nAug 25Airbnb: Shorter Bookings Trend Implies A Weak Consumer Spending (Rating Downgrade)\nAug 11Should You Investigate Airbnb, Inc. (NASDAQ:ABNB) At US$115?\nAug 09The Opportunity Of Airbnb's Q2 Earnings\nAug 04Airbnb: Promising Prospects With Manageable Challenges\nJul 11Airbnb: A High-Quality Business At A Reasonable Price\nJun 25Airbnb: Growth Potential Despite Potential Overvaluation, Cautious Buy\nJun 09ABNB: Short-Term Rentals With Long-Term Gains\nJun 02Airbnb: A Global Sensation\nMay 27Airbnb: Laying The Groundwork To Go 'Multi-Vertical'\nMay 17Airbnb: Don't Rush To Buy The Dip\nMay 10Airbnb: Growing With Global Travel Market Recovery\nApr 15Airbnb Is Differentiated In Online Travel\nApr 06Shareholder Returns\n| ABNB | US Hospitality | US Market | |\n|---|---|---|---|\n| 7D | -9.3% | -0.8% | 0.2% |\n| 1Y | 4.7% | 31.6% | 19.9% |\nReturn vs Industry: ABNB underperformed the US Hospitality industry which returned 31.6% over the past year.\nReturn vs Market: ABNB underperformed the US Market which returned 19.9% over the past year.\nPrice Volatility\n| ABNB volatility | |\n|---|---|\n| ABNB Average Weekly Movement | 4.6% |\n| Hospitality Industry Average Movement | 6.2% |\n| Market Average Movement | 6.5% |\n| 10% most volatile stocks in US Market | 17.6% |\n| 10% least volatile stocks in US Market | 3.1% |\nStable Share Price: ABNB has not had significant price volatility in the past 3 months compared to the US market.\nVolatility Over Time: ABNB's weekly volatility (5%) has been stable over the past year.\nAbout the Company\n| Founded | Employees | CEO | Website |\n|---|---|---|---|\n| 2007 | 7,300 | Brian Chesky | www.airbnb.com |\nAirbnb, Inc., together with its subsidiaries, operates a platform that enables hosts to offer stays and experiences to guests worldwide. Its marketplace connects hosts and guests online or through mobile devices to book spaces and experiences. It also offers gift cards.\nAirbnb, Inc. Fundamentals Summary\n| ABNB fundamental statistics | |\n|---|---|\n| Market cap | US$80.55b |\n| Earnings (TTM) | US$2.63b |\n| Revenue (TTM) | US$11.58b |\nIs ABNB overvalued?\nSee Fair Value and valuation analysisEarnings & Revenue\n| ABNB income statement (TTM) | |\n|---|---|\n| Revenue | US$11.58b |\n| Cost of Revenue | US$1.94b |\n| Gross Profit | US$9.64b |\n| Other Expenses | US$7.01b |\n| Earnings | US$2.63b |\nLast Reported Earnings\nJun 30, 2025\nNext Earnings Date\nn/a\n| Earnings per share (EPS) | 4.25 |\n| Gross Margin | 83.23% |\n| Net Profit Margin | 22.67% |\n| Debt/Equity Ratio | 25.7% |\nHow did ABNB perform over the long term?\nSee historical performance and comparisonCompany Analysis and Financial Data Status\n| Data | Last Updated (UTC time) |\n|---|---|\n| Company Analysis | 2025/08/07 10:35 |\n| End of Day Share Price | 2025/08/07 00:00 |\n| Earnings | 2025/06/30 |\n| Annual Earnings | 2024/12/31 |\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n| Package | Data | Timeframe | Example US Source * |\n|---|---|---|---|\n| Company Financials | 10 years |\n| |\n| Analyst Consensus Estimates | +3 years |\n|\n|\n| Market Prices | 30 years |\n| |\n| Ownership | 10 years |\n| |\n| Management | 10 years |\n| |\n| Key Developments | 10 years |\n|\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nAirbnb, Inc. is covered by 56 analysts. 40 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day.\n| Analyst | Institution |\n|---|---|\n| Colin Sebastian | Baird |\n| Ishan Majumdar | Baptista Research |\n| Trevor Young | Barclays |"
    }
  ],
  "argos_summary": "Airbnb, Inc. reported strong second-quarter results, exceeding revenue expectations with $3.1 billion, and earnings per share of $1.03, both surpassing analyst forecasts. Analysts predict a revenue growth of 4.5% for 2025, maintaining a consensus price target of $140 per share, with estimates ranging from $96 to $200. Despite a forecasted slowdown in revenue growth compared to historical rates, Airbnb's performance is expected to align closely with industry averages.",
  "argos_id": "LLPPW3S9V"
}