{
  "url": "https://www.forbes.com/sites/alisondurkee/2025/08/08/trump-owes-500-million-for-his-new-york-fraud-case---now-his-doj-is-investigating-the-attorney-general/",
  "authorsByline": "Alison Durkee",
  "articleId": "ac07f67865e440ed83830c934b366256",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://specials-images.forbesimg.com/imageserve/68965e1eebb639682de9ef97/Letitia-James-at-Trump-civil-fraud-trial/960x0.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T20:34:08+00:00",
  "addDate": "2025-08-08T20:48:58.626565+00:00",
  "refreshDate": "2025-08-08T20:48:58.626569+00:00",
  "score": 1.0,
  "title": "Trump Administration Subpoena Letitia James As $500 Million Civil Fraud Case Still Ongoing",
  "description": "Trump now owes approximately $513 million with interest after James sued him for fraud.",
  "content": "The Justice Department issued a subpoena to James’ office for documents related to the civil fraud case, multiple outlets reported Friday, which The New York Times reports is part of an investigation into whether the case violated Trump’s civil rights. James sued Trump, the Trump Organization and his business associates for fraud based on allegations that the president and his associates repeatedly misstated the value of their assets on financial statements for personal gain, with Judge Arthur Engoron agreeing with James and holding Trump and his co-defendants liable for fraud. Trump has long denied the allegations in the case and insisted there was no wrongdoing in how assets were calculated, and has repeatedly attacked James, claiming she brought the lawsuit because she’s politically biased against him and describing her as a “crook.” The civil fraud case is still ongoing, as a state appeals court heard Trump’s appeal in the case last September and has not yet issued a ruling over whether or not Engoron’s ruling should stand. Engoron ordered Trump to pay $454.2 million in the case, an amount that keeps going up as the case drags out, as approximately $111,984 in interest is added each day—now ballooning the total amount Trump owes to approximately $513 million. James has strongly opposed the Trump administration’s reported investigation into her, with her personal attorney Abbe Lowell saying in a statement Friday, “Investigating the fraud case Attorney General James won against President Trump and his businesses has to be the most blatant and desperate example of this administration carrying out the president’s political retribution campaign.”\n\nWhat To Watch For\n\nHow the Trump administration’s investigation into James will play out. There is no indication of any wrongdoing by James in her litigation against Trump, though it’s unclear what conclusions the Trump DOJ’s investigation will reach and how long the probe could take to play out. The Justice Department also reportedly issued a separate subpoena into documents regarding a lawsuit James’ office successfully brought against the National Rifle Association, and the Justice Department has reportedly separately been investigating James’ personal real estate transactions.\n\nWill Trump Have To Pay In The Civil Fraud Case?\n\nIt still remains to be seen how the appeals court will rule on Trump’s appeal of the civil fraud case. The five-judge panel appeared somewhat sympathetic to the president when they heard arguments last year and suggested they could be inclined to lower the eye-popping sum he’s been ordered to pay, which one judge referred to as “troubling.” It’s unclear when the court’s ruling will come out. Interest on the amount Trump has to pay will keep accruing until the appeals process is fully over, and he will only have to pay if the courts still find him liable for fraud after the case has been fully appealed. He has already posted a $175 million bond in the case, after successfully persuading a court to lower the amount he immediately had to pay.\n\nForbes estimates Trump’s net worth at $5.1 billion as of Friday afternoon. The president’s cash pile has significantly increased since the civil fraud ruling first came out, making him fully capable of paying the nine-figure civil fraud fine. Trump now has approximately $770 million in liquid assets, up from approximately $413 million after Engoron’s fraud ruling, with the bump largely thanks to the president’s cryptocurrency holdings.\n\nJames sued Trump and his company in 2022 for alleged fraud, claiming the president and his allies repeatedly inflated the size and value of assets in order to obtain more favorable business deals. The allegations included false valuations for such Trump properties as Mar-a-Lago and Trump Tower, where the Trump Organization exaggerated the size of Trump’s penthouse even after Forbes reported the square footage the company had been using was false. Engoron first found Trump and his allies liable for fraud even before the case went to trial, and then ruled in February 2024, after the trial had concluded, that the fraud was committed knowingly, finding there was “overwhelming evidence” suggesting Trump and his allies knew the numbers they were using were false. Trump himself “was aware of many of the key facts underpinning various material fraudulent misstatements,” Engoron wrote. James is one of a number of prosecutors that Trump attacked as legal cases piled up against him between his two presidential terms, and the president has long suggested he wants to get revenge on his enemies while in the White House. In addition to the New York attorney general, the Trump administration has also opened an investigation into Jack Smith, the former special counsel who led the federal government’s two criminal cases against Trump.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/2025/04/16/nyregion/trump-letitia-james-mortgage-fraud.html",
    "https://www.politico.com/news/2025/08/02/jack-smith-hatch-act-probe-00490405",
    "https://docs.google.com/spreadsheets/d/1t0aaiBjLw8eeQkfY61er8OrjFUqxPkvQltEyNVgwx1U/edit?pli=1&gid=2046816337#gid=2046816337",
    "https://www.forbes.com/sites/zacheverson/2024/04/01/trump-posts-175-million-bond-new-york-civil-fraud-lawsuit/",
    "https://www.forbes.com/sites/kylemullins/2024/03/02/heres-how-much-cash-donald-trump-has/",
    "https://www.forbes.com/sites/chasewithorn/2022/09/21/how-forbes-exposed-trumps-lies-about-the-size-of-his-penthouse/",
    "https://www.politico.com/news/2025/08/08/u-s-attorneys-office-subpoenas-new-york-ag-letitia-james-00500033",
    "https://www.forbes.com/sites/alisondurkee/2023/12/14/trump-fraud-trial-heres-what-we-learned-from-months-of-testimony-as-case-nears-end/?sh=5852d08f4666",
    "https://www.forbes.com/sites/alisondurkee/2024/02/16/trump-ordered-to-pay-364-million-in-civil-fraud-case-as-judge-finds-ex-president-knowingly-committed-fraud/",
    "https://www.forbes.com/sites/danalexander/article/the-definitive-networth-of-donaldtrump/",
    "https://www.forbes.com/sites/alisondurkee/2024/09/26/appeals-court-questions-trumps-troubling-450-million-fine-in-civil-fraud-case/",
    "https://www.forbes.com/sites/alisondurkee/2024/09/25/trump-already-owes-24-million-more-in-fraud-case-as-its-heard-on-appeal/",
    "https://www.cnn.com/2025/08/08/politics/letitia-james-trump-justice-department-investigation",
    "https://www.nytimes.com/2025/08/08/nyregion/letitia-james-subpoena-trump-doj.html",
    "https://www.forbes.com/profile/donald-trump/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Trump",
      "weight": 0.11124534
    },
    {
      "name": "President Trump",
      "weight": 0.10795368
    },
    {
      "name": "Trump Tower",
      "weight": 0.1078926
    },
    {
      "name": "Trump Administration",
      "weight": 0.10710372
    },
    {
      "name": "such Trump properties",
      "weight": 0.10281271
    },
    {
      "name": "fraud",
      "weight": 0.08535418
    },
    {
      "name": "alleged fraud",
      "weight": 0.084372446
    },
    {
      "name": "legal cases",
      "weight": 0.08258871
    },
    {
      "name": "Letitia James",
      "weight": 0.07330955
    },
    {
      "name": "James",
      "weight": 0.07304468
    }
  ],
  "topics": [
    {
      "name": "Fraud"
    },
    {
      "name": "Corruption"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97509765625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.9013671875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.8974609375
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.89501953125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.861328125
    },
    {
      "name": "/News/Gossip & Tabloid News/Scandals & Investigations",
      "score": 0.421142578125
    }
  ],
  "sentiment": {
    "positive": 0.05429077,
    "negative": 0.7392578,
    "neutral": 0.20654297
  },
  "summary": "The Justice Department has issued a subpoena to Letitia James' office for documents related to the civil fraud case, part of an investigation into whether the case violated Trump's civil rights. James had sued Trump, the Trump Organization, and his business associates for fraud based on allegations that they misstated the value of their assets on financial statements for personal gain. The case is still ongoing, with a state appeals court hearing Trump's appeal in the case last September and has yet to rule on whether or not the ruling should stand. The Justice Department also reportedly issued a separate subpoena into documents regarding a lawsuit James’ office successfully brought against the National Rifle Association. There is no indication of any wrongdoing by James in her litigation against Trump, though it is unclear what conclusions the Trump DOJ’s investigation will reach.",
  "shortSummary": "The Justice Department has subpoenas Letitia James for documents regarding the civil fraud case against Donald Trump, ongoing despite his claims of innocence.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e700a92ca9794118bfae7a238751e9a3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.forbes.com/sites/alisondurkee/2024/09/26/appeals-court-questions-trumps-troubling-450-million-fine-in-civil-fraud-case/",
      "text": "Topline\nNew York appeals court judges signaled Thursday they may be willing to limit the nine-figure judgment against former President Donald Trump and his business associates, questioning the New York attorney general’s office during a hearing and suggesting concerns that the litigation over whether Trump fraudulently misstated the value of his assets may have gone beyond what the state can legally do.\nKey Facts\nA five-judge panel heard oral arguments in the civil fraud case Thursday, after New York State Judge Arthur Engoron in February found Trump and his associates liable for fraudulently misstating the value of assets on financial documents in order to obtain more favorable business deals and reflect a higher net worth for Trump, ordering them to pay more than $464 million, including $454.2 million plus interest by Trump personally.\nTrump’s lawyers argued in part that the ruling should be overturned because no one was harmed by any values being misstated—though the defendants maintain their numbers were accurate—given that Trump’s company paid all the companies it did business with in full and no one lost money.\nNew York Attorney General Letitia James’ office argued that doesn’t matter because the statute Trump was sued under doesn’t require showing evidence that anyone was harmed, but judges said the state may still have gone too far, saying there have to be some “guardrails” in place that stop the state from going after any private business.\n“There has to be some limitation on what the attorney general can do,” Justice Peter Moulton told Deputy Solicitor General Judith Vale, who argued the case for the attorney general’s office, after the court previously questioned bringing a case to “upset a private business transaction” between “equally sophisticated partners” in which the supposed victim had the power to conduct its own “due diligence” and “never complained.”\nThe judges also questioned the nine-figure judgment against Trump and his associates, saying “the immense penalty of this case is troubling” given the businesses Trump worked with “left these transactions happy,” and asking whether the fine should have been calculated differently, which would have resulted in a lower amount.\nVale defended the state’s case, saying the massive fine was justified given the “enormously favorable” terms Trump and his associates got on business deals using the inflated valuations and the repeated nature of the fraud, also pointing out that companies did complain and stop doing business with Trump after finding out numbers were misstated.\nContra\nThe appeals court judges also questioned Trump attorney Dean John Sauer during arguments Thursday, pointing out that some of Sauer’s arguments conflicted with previous rulings the appeals court has issued in the case. Judges asked why, if Trump is claiming someone had to be harmed to be found liable of fraud, the statute in question doesn’t say that explicitly. Sauer was also asked about how the Trump Organization valued his Mar-a-Lago estate in Florida—claiming it was a private residence despite restrictions on its deed prohibiting that—with the Trump attorney responding that its label is proper because Trump “has been using it as a private residence since 1995.”\nWhat To Watch For\nIt’s unclear how long it will take the appeals court to rule on the case. If they uphold Engoron’s ruling, Trump and his associates—including sons Eric and Donald Trump Jr.—face a range of punishments on top of the millions in fines, including being temporarily barred from running New York businesses. Trump can also still appeal his case to New York’s highest court if he loses in this appeals court, though interest will keep accruing on his judgment while he does.\nBig Number\n$478.3 million. That’s how much Trump now owes in the civil fraud case, including interest, which accrues at a rate of 9% per year, increasing the amount Trump has to pay by $111,984 per day, $3.4 million per month and $40.9 million per year. More than $24 million has accrued since Trump was first ordered to pay $454.2 million in February. The interest keeps accumulating while the appeals process plays out, and won’t stop until the appeals process ends and Trump is ordered to pay. It would be dropped entirely if Trump were to win on appeal. The ex-president has already posted a $175 million bond in the case, after a court agreed to let him lower the amount he had to pay immediately, but he will still have to pay the full amount should he lose his appeal.\nForbes Valuation\nForbes estimates Trump’s net worth at $3.7 billion as of Thursday morning, ranking him the 937th richest person in the world. Most of his wealth comes from his stake in Truth Social owner Trump Media and Technology Group, followed by his real estate holdings. Forbes estimates he only has approximately $413 million in cash and liquid assets, which is what would be used to pay the full judgment in the civil fraud case if his appeal fails. It’s unclear how Trump will pay the full judgment if needed, given it exceeds his cash pile. Trump would most likely have to sell shares of his social media company—even as the ex-president has claimed he has no intention to do so.\nTangent\nIn addition to the civil proceedings against Trump and his associates, the fraud case also led to criminal charges against former Trump Organization CFO Allen Weisselberg, who pleaded guilty to two counts of perjury based on testimony he gave in the case. He was sentenced to five months in prison, but was released on good behavior in July after serving only 100 days. Weisselberg was charged after downplaying his knowledge that Trump vastly inflated the square footage of his Trump Tower penthouse, which Forbes reported in 2017 is actually 10,996 square feet, far smaller than the more than 30,000 feet Trump claimed on financial documents. Forbes’ reporting showed Weisselberg was far more interested in the penthouse’s square footage than he claimed during the civil fraud trial and in a 2020 deposition, and he was charged after Forbes reported Weisselberg lied under oath. While Weisselberg was charged based on his comments in both the deposition and at the fraud trial, he only pleaded guilty to charges based on the 2020 deposition. Weisselberg testified he wasn’t aware of the size discrepancy before Forbes’ piece and was not present while Trump exaggerated the penthouse’s size—but was actually present during a meeting with Trump and Forbes reporters in which Trump lied about the square footage, and internal emails and emails from Forbes show Weisselberg was aware of the discrepancy before Forbes’ 2017 piece was published.\nKey Background\nJames sued Trump, his associates and his businesses in 2022, alleging the ex-president and his business had misstated the value of assets more than 200 times in a 10-year span, including his Florida Mar-a-Lago estate and his Trump Tower penthouse. The misstated valuations were used to get loans on more favorable terms, the state argued, also claiming Trump used the figures to reflect a higher net worth for himself. Trump has strongly denied the accusations, with his lawyers arguing in court that the valuations are based on Trump’s real estate expertise and blaming any issues on its financial documents on the Trump Organization’s accountants, rather than Trump himself or his sons. The case went to trial last fall, with Engoron ruling even before it began that Trump and his associates had fraudulently misstated the value of assets. He then ruled again in February against Trump, deciding after the monthslong trial that Trump and his associates had knowingly misstated the assets’ value for personal gain. While Trump and his lawyers tried to distance himself from any wrongdoing in the case, the judge ruled there was “overwhelming evidence” suggesting Trump and his sons signed off on the false financial documents, and Trump “was aware of many of the key facts underpinning various material fraudulent misstatements” in the financial statements and “severely compromised his credibility” when testifying in the case.\nFurther Reading"
    },
    {
      "url": "https://docs.google.com/spreadsheets/d/1t0aaiBjLw8eeQkfY61er8OrjFUqxPkvQltEyNVgwx1U/edit?pli=1&gid=2046816337#gid=2046816337",
      "text": "| A | B | C | D | E | F | G | H | I | J | K | L | M | N | O | P | Q | R | S | T | U | V | W | X | Y | Z | AA | |\n|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|\n1 | DONALD TRUMP | ||||||||||||||||||||||||||\n2 | PENALTIES | DISGORGEMENT | PRE-JUDGMENT INTEREST ($87,502 per day, ended 2/23/2024) | JUDGMENT | POST-JUDGMENT INTEREST ($111,984 per day, starting 2/23/2024) | TOTALS | |||||||||||||||||||||\n3 | Reason | Amount | Start date | End date | Rate | Years accrued | Pre-judgment interest | Total judgment | Start date | Current date | Rate | Years accrued | Post-judgment interest | Penalties + Interest | |||||||||||||\n4 | Loan savings | $168,040,168 | 3/4/2019 | 2/23/2024 | 9% | 4.9781 | $75,286,599 | $243,326,767 | 2/23/2024 | 8/8/2025 | 9% | 1.4575 | $31,919,139 | $275,245,906 | |||||||||||||\n5 | Old Post Office sale | $126,828,600 | 5/11/2022 | 2/23/2024 | 9% | 1.7890 | $20,421,142 | $147,249,742 | 2/23/2024 | 8/8/2025 | 9% | 1.4575 | $19,315,939 | $166,565,681 | |||||||||||||\n6 | Ferry Point sale | $60,000,000 | 6/26/2023 | 2/23/2024 | 9% | 0.6630 | $3,580,274 | $63,580,274 | 2/23/2024 | 8/8/2025 | 9% | 1.4575 | $8,340,338 | $71,920,612 | |||||||||||||\n7 | TOTAL | $354,868,768 | $99,288,015 | $454,156,783 | $59,575,416 | $513,732,199 | |||||||||||||||||||||\n8 | |||||||||||||||||||||||||||\n9 | ERIC TRUMP | ||||||||||||||||||||||||||\n10 | PENALTIES | DISGORGEMENT | PRE-JUDGMENT INTEREST ($990 per day, ended 2/23/2024) | JUDGMENT | POST-JUDGMENT INTEREST ($1,149 per day, starting 2/23/2024) | TOTALS | |||||||||||||||||||||\n11 | Reason | Amount | Start date | End date | Rate | Years accrued | Pre-judgment interest | Total judgment | Start date | Current date | Rate | Years accrued | Post-judgment interest | Penalties + Interest | |||||||||||||\n12 | Old Post Office sale | $4,013,024 | 5/11/2022 | 2/23/2024 | 9% | 1.7890 | $646,152 | $4,659,176 | 2/23/2024 | 8/8/2025 | 9% | 1.4575 | $611,182 | $5,270,358 | |||||||||||||\n13 | TOTAL | $4,013,024 | $646,152 | $4,659,176 | $611,182 | $5,270,358 | |||||||||||||||||||||\n14 | |||||||||||||||||||||||||||\n15 | DONALD TRUMP JR. | ||||||||||||||||||||||||||\n16 | PENALTIES | DISGORGEMENT | PRE-JUDGMENT INTEREST ($990 per day, ended 2/23/2024) | JUDGMENT | POST-JUDGMENT INTEREST ($1,149 per day, starting 2/23/2024) | TOTALS | |||||||||||||||||||||\n17 | Reason | Amount | Start date | End date | Rate | Years accrued | Pre-judgment interest | Total judgment | Start date | Current date | Rate | Years accrued | Post-judgment interest | Penalties + Interest | |||||||||||||\n18 | Old Post Office sale | $4,013,024 | 5/11/2022 | 2/23/2024 | 9% | 1.7890 | $646,152 | $4,659,176 | 2/23/2024 | 8/8/2025 | 9% | 1.4575 | $611,182 | $5,270,358 | |||||||||||||\n19 | TOTAL | $4,013,024 | $646,152 | $4,659,176 | $611,182 | $5,270,358 | |||||||||||||||||||||\n20 | |||||||||||||||||||||||||||\n21 | ALLEN WEISSELBERG | ||||||||||||||||||||||||||\n22 | PENALTIES | DISGORGEMENT | PRE-JUDGMENT INTEREST ($247 per day, ended 2/23/2024) | JUDGMENT | POST-JUDGMENT INTEREST ($272 per day, starting 2/23/2024) | TOTALS | |||||||||||||||||||||\n23 | Reason | Amount | Start date | End date | Rate | Years accrued | Pre-judgment interest | Total judgment | Start date | Current date | Rate | Years accrued | Post-judgment interest | Penalties + Interest | |||||||||||||\n24 | Severance payments | $1,000,000 | 1/9/2023 | 2/23/2024 | 9% | 1.1233 | $101,096 | $1,101,096 | 2/23/2024 | 8/8/2025 | 9% | 1.4575 | $144,440 | $1,245,536 | |||||||||||||\n25 | TOTAL | $1,000,000 | $101,096 | $1,101,096 | $144,440 | $1,245,536 | |||||||||||||||||||||\n26 | |||||||||||||||||||||||||||\n27 | ALL DEFENDANTS (GRAND TOTAL) | ||||||||||||||||||||||||||\n28 | PENALTIES | Disgorgement | Pre-judgment interest | Judgment | Post-judgment interest | GRAND TOTAL | |||||||||||||||||||||\n29 | TOTAL | $363,894,816 | $100,681,415 | $464,576,231 | $60,942,219 | $525,518,450 | |||||||||||||||||||||\n30 | |||||||||||||||||||||||||||\n31 | DAILY RATE OF INCREASE | ||||||||||||||||||||||||||\n32 | Pre-judgment | Post-judgment | |||||||||||||||||||||||||\n33 | Before 2/23/2024 | After 2/23/2024 | |||||||||||||||||||||||||\n34 | Donald Trump | $87,502 | $111,984 | ||||||||||||||||||||||||\n35 | Eric Trump | $990 | $1,149 | ||||||||||||||||||||||||\n36 | Donald Trump Jr. | $990 | $1,149 | ||||||||||||||||||||||||\n37 | Allen Weisselberg | $247 | $272 | ||||||||||||||||||||||||\n38 | Total (all-defendants) | $89,729 | $114,554 | ||||||||||||||||||||||||\n39 | |||||||||||||||||||||||||||\n40 | *Note: Interest is calculated as \"simple interest\" from a date assigned by the judge; it accrues until it is paid | ||||||||||||||||||||||||||\n41 | https://www.nysenate.gov/legislation/laws/CVP/A50 | ||||||||||||||||||||||||||\n42 | |||||||||||||||||||||||||||\n43 | This spreadsheet was updated on 2/23/2024 to reflect that pre-judgment interest is calcuated on the underlying penalty while post-judgment interest is calculated on the total judgment (penalty + pre-judgment interest) | ||||||||||||||||||||||||||\n44 | |||||||||||||||||||||||||||\n45 | |||||||||||||||||||||||||||\n46 | |||||||||||||||||||||||||||\n47 | |||||||||||||||||||||||||||\n48 | |||||||||||||||||||||||||||\n49 | |||||||||||||||||||||||||||\n50 | |||||||||||||||||||||||||||\n51 | |||||||||||||||||||||||||||\n52 | |||||||||||||||||||||||||||\n53 | |||||||||||||||||||||||||||\n54 | |||||||||||||||||||||||||||\n55 | |||||||||||||||||||||||||||\n56 | |||||||||||||||||||||||||||\n57 | |||||||||||||||||||||||||||\n58 | |||||||||||||||||||||||||||\n59 | |||||||||||||||||||||||||||\n60 | |||||||||||||||||||||||||||\n61 | |||||||||||||||||||||||||||\n62 | |||||||||||||||||||||||||||\n63 | |||||||||||||||||||||||||||\n64 | |||||||||||||||||||||||||||\n65 | |||||||||||||||||||||||||||\n66 | |||||||||||||||||||||||||||\n67 | |||||||||||||||||||||||||||\n68 | |||||||||||||||||||||||||||\n69 | |||||||||||||||||||||||||||\n70 | |||||||||||||||||||||||||||\n71 | |||||||||||||||||||||||||||\n72 | |||||||||||||||||||||||||||\n73 | |||||||||||||||||||||||||||\n74 | |||||||||||||||||||||||||||\n75 | |||||||||||||||||||||||||||\n76 | |||||||||||||||||||||||||||\n77 | |||||||||||||||||||||||||||\n78 | |||||||||||||||||||||||||||\n79 | |||||||||||||||||||||||||||\n80 | |||||||||||||||||||||||||||\n81 | |||||||||||||||||||||||||||\n82 | |||||||||||||||||||||||||||\n83 | |||||||||||||||||||||||||||\n84 | |||||||||||||||||||||||||||\n85 | |||||||||||||||||||||||||||\n86 | |||||||||||||||||||||||||||\n87 | |||||||||||||||||||||||||||\n88 | |||||||||||||||||||||||||||\n89 | |||||||||||||||||||||||||||\n90 | |||||||||||||||||||||||||||\n91 | |||||||||||||||||||||||||||\n92 | |||||||||||||||||||||||||||\n93 | |||||||||||||||||||||||||||\n94 | |||||||||||||||||||||||||||\n95 | |||||||||||||||||||||||||||\n96 | |||||||||||||||||||||||||||\n97 | |||||||||||||||||||||||||||\n98 | |||||||||||||||||||||||||||\n99 | |||||||||||||||||||||||||||\n100 |"
    },
    {
      "url": "https://www.forbes.com/sites/chasewithorn/2022/09/21/how-forbes-exposed-trumps-lies-about-the-size-of-his-penthouse/",
      "text": "Editor’s Note\nFormer Trump Organization CFO Allen Weisselberg pleaded guilty to perjury on Monday. The charge stems from testimony he gave about the size of Trump’s apartment during a July 2020 deposition and at the civil fraud trial in October. Under oath, Weisselberg said he had “never even thought about the apartment” when asked why he signed off on financial statements attesting the apartment was larger than it actually is.\nForbes was the first to uncover Trump’s lies about the size of his triplex back in 2017. It also was the first to offer evidence, citing emails and notes, proving that Weisselberg not only knew Trump had lied but that he had helped his former boss tell those lies. He now faces up to five months in jail. He already served nearly 100 days at Rikers Island. Here’s a 2022 story that takes readers through these penthouse apartment lies.\nIt’s September 21, 2015 and Donald Trump is wheeling around his Trump Tower penthouse like a realtor at a showing. “35-foot ceilings!” he exclaims in the living room. “We have a fireplace,” he points out in the two-story dining room. “Can’t even get ‘em anymore.” He shows me the window where he claims he watched the second plane hit the World Trade Center. He directs me to a knockout view of Central Park. But more important to Trump than any one feature is the apartment’s size: 33,000 square feet–the entire top three floors of the skyscraper. He’s mentioned it at least 10 times over the past two hours as part of a marathon meeting stretching from his 26th-floor office to the Trump Tower gym and, finally, his gilded palace in the sky, which he says is much bigger and much more valuable than we’re estimating for our Forbes 400 list of the richest Americans.\nExcept none of it was true. I dug through property records, which showed Trump’s apartment was 10,996 square feet and only took up part of the floors. I spent hours sifting through every photo or video shot inside the penthouse, looking for extra rooms. I visited a grungy Manhattan records office, where I was told the apartment’s blueprints should be, but they were missing–perhaps taken by the Secret Service, I thought. I even had our stellar research librarian unearth a copy of Architectural Digest from the 1980s that featured an earlier version of Trump’s place, hoping to find evidence of the missing 22,004 square feet. No dice.\nThe records were clear: Donald Trump owned a 10,996-square-foot pad–more than 6 times the size of the median U.S. home, but nowhere near what Trump claimed–so I wrote a story, published in May 2017: Donald Trump Has Been Lying About The Size Of His Penthouse.\nLast year, I was subpoenaed by the Manhattan district attorney’s office to testify about this article to a grand jury mulling criminal charges for Trump. Now, seven years to the day after then-candidate Trump insisted to me that his penthouse was 33,000 square feet, he’s being sued for $250 million by the New York attorney general, in part for lying about its size. The former president has allegedly been overvaluing the place on the financial statements he gives to his financial institutions, as part of an alleged scheme “to induce banks to lend money to the Trump Organization on more favorable terms than would otherwise have been available to the company, to satisfy continuing loan covenants, to induce insurers to provide insurance coverage for higher limits and at lower premiums, and to gain tax benefits, among other things.” (Trump has criticized the investigation as a partisan witch hunt.)\nHere’s the original Forbes story, now cited in the civil lawsuit against Trump, on how Trump faked the size of his penthouse, republished in full:\nDuring the presidential race, Donald Trump left the campaign trail to give Forbes a guided tour of his three-story Trump Tower penthouse—part of his decades-long crusade for a higher spot on our billionaire rankings. Gliding through his gilded home, he bragged that people have called his Manhattan aerie the \"best apartment ever built\" and emphasized its immense size (33,000 square feet) and value (at least $200 million). \"I own the top three floors—the whole floor, times three!\" He admitted to having once had a neighbor, pointing to a door on the 66th floor. \"I leased that little section to Michael Jackson. I knew him better than anybody.\"\nThose comments were typical Trump: boastful and inaccurate. We recently dug up New York City records showing that he still shares those floors with a neighbor and has been exaggerating the size of his own place by a factor of three.\nRecords show Trump acquiring a 6,096-square-foot triplex apartment, occupying sections of floors 66 through 68, around the time Trump Tower opened in 1983. A decade later he expanded his penthouse, merging parts of two neighboring apartments into his home, according to the filings. The end result is 10,996 square feet of prime Manhattan real estate—a massive residence, no doubt, but much smaller than what Trump claims to own. No records filed with the city indicate that he has added or shed square footage in the years since.\nAs for that neighbor, it’s Joel R. Anderson, an Alabama businessman who has owned a 3,368-square-foot apartment on two of the floors since 1996. Anderson has been identified in the past as a member of the Trump Tower condo board and he reportedly raised more than $400,000 for a library foundation in his hometown of Florence, Ala. by hosting an event called the 2005 Donald Trump Library Benefit Dinner. (Anderson could not be reached for comment.)\nTogether, Trump’s and Anderson’s penthouses combine for about 14,000 square feet. So where does Trump’s 33,000 square feet figure come from? It’s hard to tell. No one else lives on those floors, according to city records. Instead “common elements”—things like hallways and elevators—and mechanical space appear to take up the rest of the area Trump claims to live in. The residents of Trump Tower likely own these areas through their condo association, their stakes divvied up based on the size of their apartments.\nThat includes Michael Jackson’s supposed penthouse: Records indicate the area Trump pointed to during the tour has never been a residence either. It appears to be mechanical space. (Jackson reportedly lived elsewhere—on floor 63.)\nNo Trump spokesperson would comment on any of this, so using the correct square footage, we estimate the president's pad is worth $64 million, less than a third of his number."
    },
    {
      "url": "https://www.forbes.com/sites/alisondurkee/2024/02/16/trump-ordered-to-pay-364-million-in-civil-fraud-case-as-judge-finds-ex-president-knowingly-committed-fraud/",
      "text": "Topline\nFormer President Donald Trump and his co-defendants will have to pay $364 million for fraudulently misstating the value of his and his company’s assets on financial statements, a New York judge ruled Friday, levying significant punishments against the ex-president and his business that could hurt him financially and affect his business’ operations.\nKey Facts\nNew York Attorney General Letitia James sued Trump, his associates—including his sons—and the Trump Organization for allegedly fraudulently misstating the value of assets on financial documents in order to obtain more favorable business deals and reflect a higher net worth for Trump.\nJudge Arthur Engoron had already found the defendants liable for fraud by misstating the value of their assets, but held a monthslong trial to determine whether the Trump defendants committed the fraud knowingly and violated laws on falsifying business records, insurance fraud and issuing false financial statements.\nThe judge ruled there was “overwhelming evidence” showing Trump and his co-defendants intentionally conspired to commit fraud and knowingly submitted false financial statements, shutting down arguments by the defendants that they relied on outside accountants to verify numbers were correct and finding “that the buck for being truthful in the supporting data valuations stopped with the Trump Organization, not the accountants.”\nEngoron said Trump was liable in that scheme, ruling the ex-president “was aware of many of the key facts underpinning various material fraudulent misstatements” in the financial statements and “severely compromised his credibility” when testifying, noting Trump “rarely responded to the questions asked, and he frequently interjected long, irrelevant speeches on issues far beyond the scope of the trial.”\nEngoron ordered Trump and companies he controls to pay approximately $354.9 million, while sons Eric and Donald Trump Jr. are each ordered to pay approximately $4 million, and former CFO Allen Weisselberg must pay $1 million—totaling more than $450 million when interest is included, James’ office noted in a statement Friday.\nThe judge also leveled other penalties, including barring Trump from leading any New York businesses for three years, while his sons are each barred for two, continuing an Independent Monitor’s oversight over the business and appointing a new Independent Director of Compliance to oversee the company’s activities—ruling the Trump Organization “does not have the ability to operate with a functional financial reporting structure that would protect against fraud in the future.”\nCrucial Quote\nEngoron’s ruling accuses Trump and his co-defendants of “den[ying] reality,” taking issue with their refusal to admit their valuations were wrong even after the judge found them liable for fraud. “Their complete lack of contrition and remorse borders on pathological,” Engoron wrote, adding the defendants’ “refusal to admit error ... constrains this Court to conclude that they will engage in it going forward unless judicially restrained.”\nChief Critics\nTrump decried the ruling Friday as a “Complete and Total SHAM,” claiming the judge’s decision was “based on nothing other than having built a GREAT COMPANY.” “Racist, Corrupt A.G. Tish James has been obsessed with ‘Getting Trump’ for years, and used Crooked New York State Judge Engoron to get an illegal, unAmerican judgment against me, my family, and my tremendous business,” Trump said in a statement. The ex-president’s attorney Alina Habba decried Engoron’s ruling Friday as a “a manifest injustice” and “the culmination of a multi-year, politically fueled witch hunt,” while Eric Trump told ABC the ruling was a “total joke” and “insane” and vowed the defendants would immediately appeal the ruling.\nWhat To Watch For\nTrump and his co-defendants are expected to appeal Engoron’s ruling and it remains to be seen how long that could take to play out. Despite the appeal, Trump will still be required to either pay cash into a court-controlled account or secure an appeals bond within 30 days of the judgment. Trump has already separately appealed Engoron’s ruling finding him liable for fraud, which also ordered for his business certificates to be canceled. That part of the order has been paused during the appeal, and Engoron clarified in his order Friday that it will now be up to the Independent Monitor and Director of Compliance to determine which certificates get canceled, rather than canceling them en masse.\nForbes Valuation\nForbes estimates Trump’s net worth at approximately $2.6 billion as of October, with an estimated $426 million in liquid assets. From 2011 to 2021, the years covered by James’ initial lawsuit, estimates for Trump’s net worth ranged between $2.5 billion (in 2020 and 2021) and $4.5 billion (in 2015). Ex-Trump attorney Michael Cohen alleged in testimony that Trump inflated the value of his assets in part to achieve a higher spot on Forbes’ wealth ranking.\nSurprising Fact\nIt’s possible the fraud trial could lead to other legal consequences, as recent reports suggest Weisselberg is now in plea negotiations with the Manhattan district attorney’s office for perjury charges. Weisselberg was pulled off the stand during the fraud trial after Forbes accused him of lying under oath, as the ex-CFO testified he “never focused” on the size of Trump’s Manhattan penthouse—while notes and emails from Weisselberg’s discussions with Forbes show otherwise. Weisselberg has not yet made any admission of perjury and no charges have been brought against him, but Engoron asked the state and defense counsel about the reports in a letter Feb. 6, suggesting that if Weisselberg perjured himself, his “testimony on other topics could also be called into question,” and the judge could disregard it altogether.\nKey Background\nJames first sued Trump and his co-defendants in September 2022, accusing the ex-president and his associates of misstating valuations on financial statements more than 200 times between 2011 and 2021. The case moved forward to trial in October—though Ivanka Trump was dismissed from the case in June—and wrapped up with closing arguments on Jan. 11. While Engoron had already found Trump and his co-defendants liable for fraud by misstating valuations, the state argued at trial that the fraud was committed intentionally, claiming the Trump Organization was “burning through cash” between 2014 and 2017 and needed favorable business deals with lower interest rates in order to stay afloat and keep up Trump’s spending. Cohen also claimed in court that Trump directed him and Weisselberg to intentionally inflate the value of assets in order to reach Trump’s desired net worth, which Trump and his attorneys refuted, painting Cohen as a “liar.” Trump’s attorneys used the trial to distance the ex-president and his sons from the alleged fraud scheme, repeatedly claiming they didn’t play a role in preparing the statements at issue, even as the Trumps signed off on them. Trump and his sons cast responsibility for any alleged issues on the company’s accountants, claiming they relied on their expertise to ensure valuations were correct. The ex-president’s attorneys also claimed any mistakes the company did make were victimless, because the financial institutions the company did business with were happy with Trump and did not lose money.\nTangent\nThe verdict comes after Trump was already ordered to make another high-dollar payment in his civil defamation case brought by writer E. Jean Carroll, as a jury ordered him on Jan. 26 to pay Carroll $83.3 million for defaming her. Trump has vowed to appeal that ruling, but it’s likely he’ll also still have to put the money into a court-controlled account while he does so, as he already did in Carroll’s first trial against him, which resulted in a separate $5 million damages verdict, or secure an appeals bond.\nFurther Reading\nTrump Fraud Trial Ends—Here Are The Punishments He Could Soon Face (Forbes)\nTrump Fraud Trial: Here’s What We Learned From Months Of Testimony As Case Nears End (Forbes)\nHere’s How Much Donald Trump Is Worth (Forbes)\nTrump’s Longtime CFO Lied, Under Oath, About Trump Tower Penthouse (Forbes)\nHow Trump Fooled Deutsche Bank (Forbes)\nTrump Thought His D.C. Hotel Would Bring In Twice As Much Money As It Did (Forbes)\nBad Accounting Or Fraud? Trump’s Profit Numbers Don’t Add Up (Forbes)\nHow Trump, Master Of Avoiding Paper Trails, Finally Got Caught With One (Forbes)\nCORRECTION (2/16): This story’s headline has been updated to clarify how much former President Donald Trump was ordered to pay."
    },
    {
      "url": "https://www.cnn.com/2025/08/08/politics/letitia-james-trump-justice-department-investigation",
      "text": "The Justice Department has subpoenaed New York Attorney General Letitia James’ office as part of a criminal investigation into President Donald Trump’s longtime adversary, according to multiple sources, in the latest example of the Trump administration taking on the president’s perceived enemies.\nThe US attorney’s office for the Northern District of New York issued two subpoenas seeking information about James’ investigations into the Trump Organization and National Rifle Association, the sources said.\nA grand jury investigation into James has also convened in Albany, New York, according to a source familiar. The grand jury probe into James is said to be looking into deprivation of rights, which means violating someone’s constitutional rights, against Trump.\nThe Justice Department declined to comment on the subpoenas and grand jury investigation.\nAbbe Lowell, an attorney for James, said, “Investigating the fraud case Attorney General James won against President Trump and his businesses has to be the most blatant and desperate example of this administration’s carrying out the president’s political retribution campaign.”\nLowell added: “Weaponizing the Department of Justice to try to punish an elected official for doing her job is an attack on the rule of law and a dangerous escalation by this administration. If prosecutors carry out this improper tactic and are genuinely interested in the truth, we are ready and waiting with the facts and law.”\nCNN has asked the White House for comment on the investigation.\nJames is among of a long list of Trump’s perceived political enemies who are now facing scrutiny from his administration. The Justice Department has opened investigations into former FBI Director James Comey and former CIA Director John Brennan, the Obama administration’s handling of Russia’ 2016 election interference, former DHS official and “Anonymous” author Miles Taylor and former CISA head Chris Krebs, who was fired for saying the 2020 election was not rigged. The office of special counsel earlier this month launched a Hatch Act investigation into former special counsel Jack Smith, who indicted Trump twice in 2023.\nIn May, FBI Director Kash Patel confirmed there was an investigation into James based in the Eastern District of Virginia over whether she committed fraud on a mortgage application. Lowell said that probe is focused on “baseless and long-discredited allegations.”\nTrump civil fraud case\nIn September 2022, the New York attorney general’s office filed a sweeping civil lawsuit against Trump, his adult sons and the Trump Organization, alleging they inflated the value of its properties to mislead lenders and insurers.\nA judge found Trump liable for fraud and ordered him to pay more than $450 million. Trump has appealed to have the judgment thrown out, which is still pending.\nTrump posted a $175 million bond while he appealed.\nTrump’s hostility with James was evident during the 11-week trial, which took place in 2023 and 2024 ahead of his New York criminal trial. Trump railed against James from the witness stand and in the hallways of the courtroom.\n“This is a political witch hunt and I think she should be ashamed of herself,” Trump said of James during a day’s worth of combative testimony.\n“You believe this political hack back there and that’s unfortunate,” he said in reference to James, who frequently attended the trial sitting behind her attorneys.\nJames countered by making her own statement outside of the courthouse in lower Manhattan and through social media videos.\nIncluded on Trump’s defense team in the civil fraud case was Alina Habba, who is now an acting US Attorney in New Jersey and one of several personal Trump attorneys who were appointed to positions in his Justice Department.\nHabba also frequently criticized the New York attorney general during the trial. In her closing statement, Habba went after James personally, saying: “I looked back and saw her shoes were off this morning, and she had a Starbucks coffee.”\nThe judge stopped her, responding that closing arguments had to stick to the facts of the case.\nNRA litigation\nThe attorney general’s office also took on the National Rifle Association and won judgments forcing the organization to reform its structure.\nJames filed a lawsuit in 2020 to dissolve the NRA over allegations the organization violated laws for non-profit groups, committed tax fraud and took millions for personal use.\nA jury in February 2024 found that the NRA mismanaged charitable funds when it failed to stop top executives from diverting millions of dollars for lavish personal trips, no-show contracts and other questionable expenditures. The jury found that the group’s longtime leader Wayne LaPierre, who had resigned the month earlier, should pay the gun rights group $4.3 million in damages for mismanagement and misspending charitable funds.\nCNN has asked the NRA for comment on the DOJ investigation.\n“Any weaponization of the justice system should disturb every American,” a spokesman for James’ office said. “We stand strongly behind our successful litigation against the Trump Organization and the National Rifle Association, and we will continue to stand up for New Yorkers’ rights.”\nThis story has been updated with additional developments."
    },
    {
      "url": "https://www.forbes.com/sites/zacheverson/2024/04/01/trump-posts-175-million-bond-new-york-civil-fraud-lawsuit/",
      "text": "Donald Trump posted a $175 million bond on Monday in his New York State civil trial. The news comes just one week after an appeals court ruled that the former president would not have to immediately post a bond for more than $454 million in the civil fraud case against him and his company. According to the ruling, Trump could delay payment of the full bond while he appeals the ruling as long as he posted a $175 million bond within 10 days.\nThe bond was provided by California-based company Knight Specialty Insurance Company. Trump’s collateral to secure the loans was a combination of cash and investment-grade bonds, according to Don Hankey, the chairman of Knight Insurance.\nHankey told Forbes that his company had initiated the deal, reaching out to Trump just a few days before an appeals court lowered the amount Trump would have to pay while his appeal was heard. “This is what we do at Knight insurance,” said Hankey, who confirmed he had supported Trump’s political campaigns in the past. “I’d never met Donald Trump. I’d never talked to him on the phone. I heard that he needed a loan or a bond, and this is what we do. So, we reached out, and he responded.” The deal, Hankey said, came together in just a few days.\nHankey, a billionaire who presides over an auto-services empire, may never have met Trump, but he was the largest individual owner of Axos Financial, the lender that bailed out Trump by refinancing his mortgages at Trump Tower and his Miami resort in 2022. Axos also previously had done business with the family of Jared Kushner, Trump’s son-in-law.\nSpokespeople for Trump did not respond to requests for comment.\nThe fact that Trump has come up with the money means that he’ll be able to protect his assets from New York’s attorney general Letitia James, who had warned that she would start seizing properties as early as late March.\nIn February, Judge Arthur Engoron had ruled that Trump had fraudulently misstated the value of his and his company’s assets on financial statements and ordered him to pay $354.9 million as part of the civil fraud case plus a nine percent interest rate that Engoron ruled started accruing on the fines in March 2019.\nDan Alexander and Kyle Mullins contributed reporting."
    },
    {
      "url": "https://www.forbes.com/sites/danalexander/article/the-definitive-networth-of-donaldtrump/",
      "text": "W\nhat’s Donald Trump really worth?\nEveryone has an opinion, but Forbes has the answer: $5.1 billion, according to our most recent tally, updated in March. It’s quite a comeback for the former president, who more than doubled his net worth in a year, taking advantage of his diehard following. First, Trump sold shares of his money-losing social-media platform, leaving him with a stake worth about as much of all his real estate combined. Then, he pushed his crypto offerings, which added hundreds of millions in liquidity. It pays to be king.\nBy Dan Alexander, Forbes Staff\nHow Rich Is Donald Trump: $5.1 billion\nFORBES ESTIMATE AS OF MARCH 2025\n📱🌟\nTruth Social’s Parent Company: $2.6 billion\nFORBES ESTIMATE AS OF MARCH 7, 2025\nTrump Media and Technology Group\nNet Value: $2.6B\nFrom a financial standpoint, Trump’s social-media venture is one of the most absurd businesses in America, generating sales of just $3.6 million in 2024 and recording a net loss of $401 million. Revenues dropped 12 percent in a year, even while Trump dominated most news cycles. Yet Trump-loving traders still bid up shares to head-scratching prices. Shares have lost more than half of their value, but that still leaves the president with a multibillion-dollar position.\n🌭 🏢🗽\nTrump’s Real Estate Investments: $1.1 billion\nFORBES ESTIMATE AS OF MARCH 2025\n1290 Avenue of the Americas\nTotal Value: $1.8B\nDebt: $950M\nNet value: $252M\nWhat Trump owns: 30% stake in office and retail\nThe former president has a stake in the Manhattan skyscraper that is five blocks south and one block west of Trump Tower, but he has no control over the building. It is overseen by Steven Roth, CEO of Vornado Realty Trust, who served on the economic advisory council of Trump’s 2016 campaign.\n6 East 57th Street\nTotal value: $148M\nDebt: $0\nNet value: $148M\nWhat Trump owns: Two leaseholds on retail lasting until 2079 and 2094\nOnline shopping wounded buildings like this, a glitzy, 65,000-square-foot space just off Fifth Avenue, in the middle of what was once one of the world’s busiest retail locations. High-priced sales coming out of the pandemic injected a dose of optimism, however.\n555 California Street\nTotal value: $1.6B\nDebt: $1.2B\nNet value: $120M\nWhat Trump owns: 30% of three-building complex\nTrump and his partner, Vornado Realty Trust, refinanced their San Francisco tower shortly after his first term, more than doubling their debt load. Vornado hedged the variable interest rate on the new loan, while Trump initially let his portion float, costing him millions of dollars.\nTrump Tower\nTotal value: $200M\nDebt: $100M\nNet value: $100M\nWhat Trump owns: Office and retail\nA Forbes analysis of records suggests that Trump lied about the size of Trump Tower, claiming it included 246,000 square feet of retail and office space. Property records list 235,000 square feet, 53,000 of which cover less-valuable common elements like elevators, public restrooms and mechanical spaces.\nTrump Park Avenue\nTotal value: $93M\nDebt: $0\nNet value: $93M\nWhat Trump owns: 17 condos, portion of retail\nOne month after entering the Oval Office in 2017, Trump sold a penthouse apartment in Trump Park Avenue for $15.9 million. The buyer: Angela Chen, who apparently helmed a business called Global Alliance Associates, which boasted on its website that it could leverage its network with “the highest levels of government officials.”\nFour Florida homes\nTotal value: $98M\nDebt: $10M\nNet value: $88M\nLocation: Palm Beach, Fla.\nTrump is only known to have bought one piece of real estate during his first term—a mansion across the street from Mar-a-Lago, which his sister sold to him for about $19 million in 2018. That seemed like plenty of money at the time, but today it looks like a bargain.\nTrump International Hotel & Tower Chicago\nTotal value: $78M\nDebt: $0\nNet value: $78M\nWhat Trump owns: Retail, portion of residential and parking\nThe former president paid off $45 million of Deutsche Bank debt in October 2023, then terminated a mysterious second loan two months later, unburdening a property that had struggled with debt issues since its construction.\nTrump International Hotel Las Vegas\nTotal value: $140M\nDebt: $0\nNet value: $70M\nWhat Trump owns: 50% of hotel and condos\nAlong with his billionaire partner Phil Ruffin, Trump sold dozens of units inside the golden tower from 2017 to 2020.\nTrump Tower penthouse\nTotal value: $50M\nDebt: $0\nNet value: $50M\nWhat Trump owns: 11,000-square-foot residence in New York City\nThe former president lied about the size of his home atop Trump Tower for years, claiming it was 33,000 square feet. City records indicate it’s really 10,996 square feet.\nResidential lots\nTotal value: $45M\nDebt: $0\nNet value: $45M\nLocation: Rancho Palos Verdes, Calif.\nTrump Winery\nTotal value: $44M\nDebt: $0\nNet value: $44M\nLocation: Charlottesville, Va.\nTrump Parc / Trump Parc East\nTotal value: $29M\nDebt: $0\nNet value: $29M\nWhat Trump owns: Residential condos, garage, portion of retail.\nThe president offloaded three condos in Trump Parc East for a total of $7.5 million during his first term. In all three cases, the buyers were anonymous shell companies.\nSeven Springs\nTotal value: $30M\nDebt: $5M\nNet value: $25M\nLocation: Bedford, N.Y.\nTrump World Tower\nTotal value: $20M\nDebt: $0\nNet value: $20M\nWhat Trump owns: Commercial, garage, portion of residential\nTrump Plaza\nTotal value: $19M\nDebt: $0\nNet value: $19M\nWhat Trump owns: Two co-op units and a leasehold on retail, garage and portion of residential\nHome in St. Martin\nTotal value: $12M\nDebt: $0\nNet value: $12M\nTrump purchased the property in 2013 from an Indiana businessman with whom he was friends. The price was never disclosed. He listed it for sale in May 2017 for $28 million, only to slash the price a few months later. It still has not sold.\nTrump International Hotel & Tower (New York)\nTotal value: $10M\nDebt: $6M\nNet value: $5M\nWhat Trump owns: Retail, garage, portion of residential\nBriarcliff, New York land\nTotal value: $5M\nDebt: $0\nNet value: $5M\nWhat Trump owns: Vacant land\nTwo Virginia homes\nTotal value: $2M\nDebt: $0\nNet value: $2M\nWhat Trump owns: Two homes next to one of his golf clubs\nTrump Palace\nTotal value: $500K\nDebt: $0\nNet value: $500K\nWhat Trump owns: Storage units\n40 Wall Street\nTotal value: $84M\nDebt: $117M\nNet value: -$33M\nWhat Trump owns: Leasehold through 2059\nTrump’s tower in Lower Manhattan has struggled to generate enough cash to cover its debt expenses, according to an analysis of SEC documents. That’s bad news for Trump, who has more than $100 million of debt against the building set to mature in 2025.\n🌴🏌️♂️\nTrump’s Golf Clubs And Resorts: $1.1 billion\nFORBES ESTIMATE AS OF MARCH 2025\nMar-a-Lago\nTotal value: $400M\nLiabilities: Est. $32M\nNet value: $368M\nWhat Trump owns: Private club in Palm Beach, Fla.\nThe private club has benefited from politics more than any other property, something Trump foreshadowed in a 2016 deposition. “The manager told me recently, he said, ‘Boy, it is actually the best year we’ve ever had at Mar-a-Lago.’ And I was looking at the numbers. I said, ‘What do you attribute this to?’ He said, ‘The campaign.’” Since then, business has only gotten stronger, with initiation fees soaring and estimated profits tripling.\nU.S. golf clubs\nTotal value: $426M\nLiabilities: Est. $89M\nNet value: $338M\nWhat Trump owns: 10 courses in 6 states\nTrump’s golf game took off after he left the White House the first time. Estimated operating profits at his clubs jumped from $19 million in 2020 to $48 million in 2023.\nTrump National Doral Miami\nTotal value: $383M\nLiabilities: Est. $135M\nNet value: $248M\nWhat Trump owns: Resort\nThe indebted Florida golf resort lost much of its northeastern clientele after Trump got into politics, nearly putting it underwater. But plenty of new customers have in the aftermath of the Covid-19 pandemic, pushing estimated profits to $25 million, double their best year during Trump’s first term.\nThree European golf properties\nTotal value: $100M\nDebt: $0\nNet value: $100M\nWhat Trump owns: Two golf resorts in Scotland, one in Ireland\nThe Trump Organization declared losses of more than $100 million at its European golf resorts, according to an analysis of records from Ireland and the United Kingdom. But business seems to be picking up recently.\n💵 💼\nTrump’s Liquid Assets: $770 million\nFORBES ESTIMATE AS OF MARCH 2025\nLiquid assets\nNet value: $774M\nThe president is flush with cash, having collected hundreds of millions from cryptocurrency sales just before returning to the White House. Those earnings piled on top of a stockpile he had already been accumulating by selling his Washington, D.C. hotel and refinancing a San Francisco office complex.\n🛩 🏡\nTrump’s Other Assets: $120 million\nFORBES ESTIMATE AS OF MARCH 2025\nTrump’s licensing and management business\nTotal value: $104M\nDebt: $0\nNet value: $104M\nTrump’s branding business looked like it was in trouble after the Jan. 6 Capitol riot. “He has done permanent damage to the Trump name and image,” said real estate analyst Kevin Brown. Maybe not. After Trump won the presidential election in 2024, multiple analysts suggested removing discounts they had previously applied to Trump’s licensing and management empire.\nTrump’s Aircraft\nTotal value: $12M\nDebt: $0\nNet value: $12M\nWhat Trump owns: One helicopter, one airplane\nTrump’s loans to children\nTotal value: $5M\nTrump’s tax returns revealed sweetheart loans for his three eldest children, Don Jr., Ivanka and Eric. Altogether, the younger Trumps paid their father about $50,000 a year in annual interest in connection with the agreements from 2015 to 2020.\nTrump’s Pensions\nNet value: $2M\n⚖️ 💼\nTrump’s Legal Liabilities: -$590 million\nFORBES ESTIMATE AS OF MARCH 2025\nLegal liabilities\nNet value: -$590M\nTrump is on the hook for nearly $600 million in legal judgements from two court battles in New York state. With the president fighting in court, in could be months, or years, before a final resolution. In the meantime, interest will continue to accrue.\n“Money was never a big motivation for me, except as a way to keep score. The real excitement is playing the game.”"
    },
    {
      "url": "https://www.forbes.com/profile/donald-trump/",
      "text": "Donald Trump has presided over the most lucrative post-presidency in American history, selling his supporters NFTs, coffee-table books and, most importantly, shares of a money-losing social-media venture.\nMuch of Trump's fortune remains in real estate, which has struggled in recent years as interest rates increased, shoppers moved online and office workers headed home.\nHe also owns golf courses, mansions, a winery and a 1991 Boeing 757 nicknamed Trump Force One.\nA New York judge has ordered Trump to pay $454 million after the attorney general accused him of lying about his net worth for years to make himself look more creditworthy.\nTrump got his start working for his father, Fred, who developed low-cost housing in Brooklyn and Queens.\nFordham University; Bachelor of Arts/Science, University of Pennsylvania\nDid you know\nTrump played basketball, football, soccer and baseball while attending the New York Military Academy in Cornwall-on-Hudson, New York.\nDonald Trump appeared alongside his father Fred on the first ever Forbes 400 list in 1982, with a combined net worth estimated at $200 million.\nIn Their Own Words\nI took a lot of finance courses at Wharton. First they taught you all the rules and regulations. Then they taught you that those rules and regulations are really meant to be broken.\nPrivate asset managers have been tantalized for years about the $29 trillion in Americans’ retirement accounts. Donald Trump just made it easier for them to get a slice.\nWhite House and Kremlin aides have stated that U.S. President Donald Trump and Russian President Vladimir Putin will meet to discuss an end to the war with Ukraine.\nU.S. President Donald Trump took one look at the report and fired former Commissioner of Labor Statistics Erika McEntarfer. But that doesn't change reality on the ground.\n“Donald Trump’s trying to steal five seats from the people of the country, not just the people of Texas,\" said Illinois Gov. JB Pritzker on CBS' 'The Late Show'\nThe White House called “South Park” a “fourth-rate” show “desperate” for attention after it skewered President Donald Trump in its season 27 premiere episode.\nU.S. President Donald Trump is leveraging tariffs and sanctions to discourage China and India from purchasing Russian oil, all in an effort to end the war in Ukraine.\nThe \"South Park\" Season 27 premiere episode — where creators Trey Parker and Matt Stone take on President Donald Trump — has media outlets buzzing. Read some of the takes on the controversial episode.\nJapanese bond yields are rising and give rise to the sense that Japan is either in the ante chamber of a full recovery, or on the precipice of something nastier\nAlso in the Forbes CMO newsletter: The Most Influential CMOs, copyrighted material can be used to train AI, Fox News keeps winning ratings, Meta brings ads to WhatsApp."
    },
    {
      "url": "https://www.forbes.com/sites/alisondurkee/2024/09/25/trump-already-owes-24-million-more-in-fraud-case-as-its-heard-on-appeal/",
      "text": "Topline\nA New York appeals court will hear the civil fraud case against Donald Trump and his business associates Thursday, as the former president appeals the nine-figure judgment he’s been ordered to pay for fraudulently misstating the value of assets—an amount that has risen by $24 million while he waited for the court to take up the case.\nKey Facts\nJudge Arthur Engoron ordered Trump and companies he controls to pay $454.2 million plus interest in the civil fraud case, in which he and his associates were found liable for fraudulently inflating the value of assets on financial statements for personal gain.\nThat $454.2 million total—which includes pre-judgment interest—goes up by $111,984 per day, $3.4 million per month and $40.9 million per year, based on a 9% annual interest rate.\nThat means Trump owes approximately $478.2 million as of Wednesday, as calculated using a penalty calculator created by Associated Press journalist Mike Sislak—meaning his total has already increased by $24 million in the seven months since the judgment was posted on Feb. 23.\nThe interest will continue to accrue until Trump pays the full judgment, even as he appeals the ruling and the appeals court deliberates on the case.\nTrump has already posted a $175 million bond in the case—as a court agreed to lower the amount after Trump’s lawyers argued he couldn’t pay the full bond—but he will still be on the hook for the entire amount he owes, including interest, once the appeals process concludes, if Engoron’s ruling isn’t overturned.\nWhat To Watch For\nA panel of appeals court judges will hear the civil fraud case on Thursday at 12 p.m. Eastern time, with a ruling likely to come out a few months later. If the court rules against him, Trump could then appeal the case to New York’s highest court and ask it to reconsider Engoron’s ruling. Interest will continue to accrue for that entire period.\nForbes Valuation\nForbes estimates Trump’s net worth at $3.6 billion as of Wednesday morning, ranking him the 966th richest person in the world. Most of the ex-president’s wealth comes from his stake in Truth Social parent company Trump Media and Technology Group, however, followed by his real estate holdings. Only approximately $413 million is made up of cash and liquid assets, which would be used to pay the judgment against him, should he lose on appeal.\nBig Number\nMore than $540 million. That’s how much Trump owes in total legal judgments against him since the start of 2023. While the fraud case makes up the bulk of that, a jury also ordered Trump to pay $83.3 million in writer E. Jean Carroll’s defamation case against him, and he has posted an appeals bond for $91.6 million in that case (enough to cover the judgment plus interest). He was also ordered to pay $5 million in a separate lawsuit Carroll brought against him, as well as smaller amounts in cases including Trump’s failed lawsuits against Christopher Steele who authored the controversial dossier ahead of the 2016 election; The New York Times and Hillary Clinton.\nWhat We Don’t Know\nHow Trump will pay the judgment if he loses on appeal. While Trump doesn’t have enough cash himself, he could try to obtain a loan, seek help from wealthy friends or borrow against his real estate properties to make up the amount. The ex-president’s attorneys previously suggested Trump could be forced to sell some of his real estate, which Forbes values at approximately $1.1 billion in total. That was before Trump’s social media company went public, however, which now makes up the bulk of Trump’s wealth. Trump has said he does not intend to sell his stock in the company after a block on him doing so lifted, though that could change in the future should he have to pay the full fraud judgment.\nKey Background\nJames sued Trump, his business associates—including his sons—and the Trump Organization in 2022 for allegedly fraudulently misstating the value of their assets on financial statements, which she alleged was done in order to obtain more favorable business deals and reflect a higher net worth for Trump. Judge Arthur Engoron agreed, finding Trump and his co-defendants liable for fraud even before the trial in the case began—it moved forward on other allegations—and then ruling again in February there was “overwhelming evidence” suggesting Trump and his sons signed off on financial statements knowing they were false. Trump’s lawyers argued in court the valuations were correct, subjective figures based on Trump’s real estate expertise, and tried to distance the former president from the alleged fraud, downplaying the statements at issue and arguing any mistakes with the numbers should be blamed on the company’s accountants. Engoron did not buy those arguments, however, writing in his final ruling that Trump “was aware of many of the key facts underpinning various material fraudulent misstatements” in the financial statements and “severely compromised his credibility” when testifying in the case.\nFurther Reading"
    },
    {
      "url": "https://www.forbes.com/sites/alisondurkee/2023/12/14/trump-fraud-trial-heres-what-we-learned-from-months-of-testimony-as-case-nears-end/?sh=5852d08f4666",
      "text": "Topline\nThe New York attorney general’s office and attorneys for former President Donald Trump finished making their cases this week in the ex-president and his company’s civil fraud trial, ahead of closing arguments next month, bringing months of often-explosive testimony to an end as Judge Arthur Engoron weighs whether the Trump Organization intentionally misstated the value of its assets.\nKey Facts\nAttorney General Letitia James sued Trump, his business associates—including his sons—and the Trump Organization for allegedly fraudulently misstating the value of assets on filings to financial institutions, which James argues was done in order to obtain more favorable business deals and reflect a higher net worth for Trump.\nWhat Trump Knew: The trial questioned Trump’s involvement in any alleged fraud scheme, with Trump testifying he would review the statements and has asked for changes to them, while ex-attorney and “fixer” Michael Cohen alleged Trump told him and then-Trump Organization CFO Allen Weisselberg to inflate the value of assets in order to reach whatever arbitrary net worth Trump wanted for himself.\nTrump, for his part, downplayed the statements of financial condition when he took the stand, claiming banks didn’t pay “much attention” to them and a clause in the documents absolved him of any responsibility if the numbers were wrong—which is false.\nHis Children’s Role: Trump’s children Eric, Ivanka and Donald Trump Jr. distanced themselves from the financial statements when they testified, repeatedly claiming they had no role in preparing the documents even when they were presented with evidence suggesting they had a larger role then they claimed under oath.\nWho Gets The Blame: Trump, his children and other Trump Organization defendants blamed the company’s outside accountants for any issues with the statements of financial condition, while accountants who testified said they were reliant on the Trump Organization to give them information and were not responsible for verifying the numbers’ accuracy.\nWhat The Banks Think: Trump’s defense relied on the argument that banks who did business with the Trump Organization weren’t harmed by any false numbers in the statements and were happy to do business with him, and a managing director at Deutsche Bank testified the bank did its own valuation of Trump’s net worth and wasn’t concerned that it was much smaller than the ex-president claimed.\nPotential Perjury: Weisselberg and Trump both distanced themselves from the Trump Organization falsely listing the square footage of Trump’s Manhattan penthouse as being three times its actual size—making claims on the stand that are undercut by notes, emails and audio recordings of comments both men made to Forbes—with the state abruptly halting Weisselberg’s testimony after a Forbes article said he lied under oath.\nContra\nThe judge has already found Trump and his co-defendants liable for fraud by misstating the value of their assets, but he still has to weigh in on other allegations, such as insurance fraud, falsification of business records and whether the fraud was committed intentionally.\nTangent\nIn addition to substantive testimony about the alleged fraud, the trial was also dominated by theatrics and controversy over witnesses and court staff, as Trump frequently attended the trial and accused the state, judge and court staff of being biased against him. Engoron imposed a gag order in the trial’s opening days that barred parties from speaking about court staff after Trump went after the judge’s clerk, going on to levy $15,000 in fines against the ex-president for two violations of the order. The judge then expanded the order to include Trump’s attorneys after lawyer Christopher Kise claimed the clerk was exerting improper influence over the judge. Trump’s attorneys also asked the judge at least five times to issue a “directed verdict” that would end the trial and rule in their favor—which Engoron repeatedly refused. Among those times was because of a tussle in which Cohen appeared to admit to lying under oath, saying he had falsely testified to Congress that Trump hadn’t directed him to inflate valuations. He then walked back that claim, however, saying that Trump hadn’t told him directly to change the numbers but rather “speaks like a mob boss.” Trump’s lawyers asked Engoron to issue a directed verdict because Cohen’s flip-flopping on his claims to Congress undercut his explosive testimony about Trump—and when Engoron refused, the ex-president stormed out of the courtroom.\nWhat To Watch For\nClosing arguments in the trial will take place Jan. 11. Once they’re over, Engoron will issue a verdict in the case, as the trial is a bench trial—meaning there’s no jury and only the judge decides the outcome. Engoron has said he hopes to rule by the end of January. Engoron will likely levy punishments against Trump and his co-defendants if he rules in favor of the state, with James asking him to impose a $250 million fine, bar Trump and his children from running New York businesses and prohibit Trump from making commercial real estate acquisitions for five years. Trump has already appealed Engoron’s ruling finding the defendants liable for fraud, which remains pending, though the court has put on hold a part of the ruling that ordered Trump’s business certificates to be canceled. The ex-president is expected to similarly appeal any verdict Engoron may issue against him.\nForbes Valuation\n$2.6 billion. That’s Trump’s estimated net worth as of December, ranking him 1215th on Forbes’ real-time tracker of the world’s richest people. Cohen testified in a deposition screened during the trial’s opening arguments that Trump wanted him and Weisselberg to increase the value of his assets in part so he could achieve a higher spot on Forbes’ wealth ranking. Between 2011 and 2021, the years covered by James’ initial lawsuit, Forbes independently valued Trump’s net worth as ranging between $2.5 billion (in 2020 and 2021) and $4.5 billion (in 2015). The attorney general’s office alleges Trump used fraudulent valuations to boost his net worth by between $1.9 billion and $3.6 billion per year on the company’s financial statements, which are separate from Forbes’ valuations.\nBig Number\nMore than $168 million. That’s approximately how much money the state claims the Trump Organization saved by using false valuations on its financial statements, according to an analysis performed by Michael McCarty, a banking expert who served as a witness for the attorney general’s office. McCarty’s analysis was based on the difference Trump paid in interest on loans that he secured using the allegedly fraudulent valuations and the higher interest rates Trump would have paid if he had commercial real estate loans, which would have likely been the case had his valuations been lower. The Trump Organization saved between $17.4 million and $73 million in interest on Trump’s Mar-A-Lago resort, hotel in Washington D.C., the Trump National Doral Golf Club and the company’s New York City property at 40 Wall Street, according to McCarty.\nSurprising Fact\nThe trial also included evidence showing how the Trump Organization was impacted by Trump’s presidency, even as Trump stepped down from running his company before he took office. Trump Organization executive Patrick Birney testified the company floated adding a “presidential premium” of 15% and above to the valuations of Trump’s personal homes while he was president—including Mar-A-Lago, his Trump Tower penthouse and Trump National Golf Club in Bedminster, New Jersey—though the premium was ultimately not included in the final statement the company prepared for financial institutions. Documents entered into evidence during the trial also showed Deutsche Bank had reservations about doing business with the Trump Organization once Trump became a presidential candidate, with the company ultimately declining to expand its loan to the company during the 2016 election. Emails showed bankers were wary of approving an unsecured loan for the company at the time, writing the bank’s decision against extending the loan was “a global corporate decision to maintain neutrality to any political situation and not lend money to a highly politically exposed person.”\nKey Background\nJames sued Trump and his co-defendants for fraud in September 2022, accusing the ex-president and his associates of misstating valuations more than 200 times on financial documents between 2011 and 2021. The lawsuit—which also initially named Ivanka Trump as a defendant before she was later dismissed—concerns valuations at many of Trump’s most high-profile properties, including Mar-A-Lago and the Manhattan penthouse. James brought the litigation following a yearslong investigation into the Trump Organization’s finances, which began in March 2019, when ex-Trump attorney Cohen testified to Congress that Trump had fraudulently inflated or deflated the value of his assets on financial statements for personal gain. Engoron found Trump and his co-defendants liable for fraud shortly before the trial began, ruling in September that the company’s valuations were false and Trump’s legal arguments defending them were out of a “fantasy world, not the real world.” The civil fraud trial also comes after the Trump Organization and Weisselberg were separately found guilty on criminal tax fraud charges brought by the Manhattan District Attorney’s office, which were based on unrelated allegations that the company evaded taxes by paying executives through gifts and off-the-books compensation.\nFurther Reading\nWhat Role Did Trump Play In Alleged Fraud Scheme? Here’s What Trial Has Revealed So Far. (Forbes)\nTrump Keeps Attacking This Statute In N.Y. Fraud Case—Here’s Why His Claims Lack Merit (Forbes)\nTrump Keeps Claiming He Won Fraud Case Before Trial—Here’s Why That’s Wrong (Forbes)\nTape Of Trump Lying About Penthouse Undercuts His Court Testimony (Forbes)\nTrump’s Longtime CFO Lied, Under Oath, About Trump Tower Penthouse (Forbes)\nHow Trump Fooled Deutsche Bank (Forbes)\nBad Accounting Or Fraud? Trump’s Profit Numbers Don’t Add Up (Forbes)\nHow Trump, Master Of Avoiding Paper Trails, Finally Got Caught With One (Forbes)"
    },
    {
      "url": "https://www.forbes.com/sites/kylemullins/2024/03/02/heres-how-much-cash-donald-trump-has/",
      "text": "Update, March 22, 2024: Since Forbes published this article on March 2, Trump’s cash situation has changed—as have his claims about it. Forbes estimated in early March that Trump had $413 million in cash. On March 8, Trump posted a $91.6 million bond he owed after losing two defamation and sexual abuse cases brought by E. Jean Carroll; Trump has appealed those verdicts. By Monday, March 25, Trump is required to pay a judgment of $454 million (plus interest) after losing a civil fraud case brought by New York Attorney General Letitia James. Earlier this week, the ex-president’s lawyers submitted a filing saying that securing a bond for the full amount Trump owes in the civil fraud case is a “practical impossibility.” Then on Friday morning, March 22, Trump claimed on Truth Social, in apparent contradiction to his lawyers’ statement, that he has “nearly $500 million in cash” and that he plans to use most of it for his campaign.\nCash, as the old saying goes, is king, but how much of it does Donald Trump really have? That’s the $540 million question. Staring down at least that sum in legal penalties, mostly stemming from a fraud case brought by the New York attorney general’s office, the former president is facing a cash crunch.\nIt would be “impossible” for him to write a check covering the full amount, Trump’s lawyers argued this week, in a failed attempt to lower Trump’s bond in the case. Trump, the lawyers say, may be forced to instead sell properties “under exigent circumstances”—in other words, at fire sale prices, with “no way to recover any property sold following a successful appeal and no means to recover the resulting financial losses from the Attorney General.”\nIn a separate case, Trump requested a stay on an $83 million fine owed to E. Jean Carroll, a writer who successfully sued Trump for defamation and sexual abuse. Carroll and her lawyers opposed the request in a filing Thursday, writing that they have “very serious concerns” about his ability to pay up: “The reasoning Trump offers in seeking this extraordinary relief boils down to nothing more than ‘trust me.’” The money is due March 9.\nTrump himself testified in April 2023 that he had “substantially in excess of $400 million in cash.” That’s pretty close to Forbes’ current estimate: roughly $413 million, good for about 15% of Trump’s $2.6 billion in net worth.\nHere’s how we arrived at that figure. We begin with an exact number: $293,834,128.42, which was Trump and his companies’ cash balance as of June 30, 2021, per documents filed in the New York attorney general’s case in October 2022. Our estimate in the fall of 2021, before the documents were released: $296 million, up from $110 million the previous year thanks to the refinancing of 555 California, the San Francisco tower he owns with Vornado Realty Trust, and also due to proceeds from selling condo units.\nNotably, Trump’s 2021 balance sheet included some $90 million tied up in entities controlled by Vornado, his business partner on office buildings in New York and San Francisco. At the time, Trump couldn’t access that money unless Vornado decided to disburse it to him, limiting the former president’s ability to actually use the funds. It’s not clear how much of Trump’s cash remains under Vornado’s control today. Vornado declined to comment.\nRegardless, from there, we can count up the major sources of cash coming in and going out by combing through documents revealed in the fraud case, Trump’s public financial disclosures and other public records. We have not subtracted anything for income taxes. That’s because Trump’s tax returns, released by the House Ways and Means Committee in 2022, show that he doesn’t pay much of anything to Uncle Sam. We also have not deducted contributions to his campaign (he hasn’t made any) or his legal bills (he’s largely paying those with donor funds).\nThe big takeaway: Trump is likely sitting on a huge pile of cash—but not enough to pay off his legal creditors with a simple wire transfer. And with several more cases in his future and the New York attorney general looking over his shoulder, he’ll need to find a financial lifeline. Fast.\nForbes’ cash calculations are outlined below.\nSTARTING POINT\nCash as of June 2021: $293,834,128.42\nSmaller property sales: +$6 million\nSince June 2021, Trump and his fellow billionaire partner Phil Ruffin have sold off 25 condos in their Trump International Hotel Las Vegas tower for more than $10 million in all. Trump, who owns a 50% stake in the building, pocketed about $5 million. In Chicago, he sold a dozen parking spots at his skyscraper there for another $1 million.\nIncome from books, speeches and NFTs: +$21 million\nIn 2021, Trump released a book called “Our Journey Together” that consisted of public domain photos from his time in office, all captioned by the former president. His financial disclosures show that he made an estimated $5.75 million from the book. He also gave several high-dollar speeches in 2021 and 2022, earning him roughly $12 million, and he issued several batches of NFTs in 2022 and 2023 for some $2.1 million in cash (plus some additional cryptocurrency). Finally, “Letters to Trump,” a book reproducing his correspondences with various celebrities that he released in April 2023, adds another $1 million.\nD.C. hotel sale and related expenses: +$112 million\nThis is Trump’s biggest payday: the 2022 sale of his money-losing Washington, D.C. hotel for an eye-popping $375 million, a figure that surprised independent analysts. After paying off the debt on the place, Trump’s share of the sale came to roughly $127 million, per documents from his fraud trial. Subtract estimated expenses he faced keeping the place afloat before he sold it—totaling $14.6 million—and a $750,000 settlement with the D.C. attorney general related to his use of the hotel for his 2017 inauguration, and we’re left with some $112 million from the hotel sale.\nTrump Links contract sale: +$60 million\nIn September 2023, Trump sold his contract with the city of New York to operate a public golf course in the Bronx for $60 million, according to testimony and documents made available in the fraud case.\nLoan payoffs: -$67 million\nTrump has paid off four loans on various properties since the 2021 report laying out his cash balances. Three were small: loans against Trump Park Avenue ($8.9 million), his golf course in Colts Neck, New Jersey ($8 million) and his golf course in northern Virginia ($5 million). The last loan—his final remaining deal with Deutsche Bank—was for $45 million lent against Trump International Hotel and Tower in Chicago, which testimony in his fraud case revealed he had paid off in October or November 2023.\nAircraft expenses: -$13 million\nCourt documents from 2021 showed Trump planned to spend roughly $13 million on aircraft maintenance and upgrades, including an overhaul of his “Trump Force One” 757.\nFINAL TOTAL\nRoughly $413 million.\nWith additional reporting by Dan Alexander."
    }
  ],
  "argos_summary": "The Justice Department has issued subpoenas to New York Attorney General Letitia James' office as part of an investigation into whether her civil fraud case against Donald Trump violated his civil rights. James accused Trump and his associates of inflating asset values to secure favorable business deals, leading to a judge's ruling that found Trump liable for fraud and ordered him to pay over $454 million, a sum that continues to grow due to accruing interest. Trump has denied wrongdoing and is appealing the ruling, while also facing scrutiny from the DOJ, which has been criticized as politically motivated by James' attorney.",
  "argos_id": "M299ZZ3UB"
}