{
  "url": "https://www.dailymail.co.uk/media/article-14983039/jon-stewart-daily-cancelled-paramount-skydance.html",
  "authorsByline": "Alex Hammer",
  "articleId": "a589ce1786134c9385326752d2ed30db",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/08/15/101041039-0-image-m-31_1754662066565.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-08T15:24:50+01:00",
  "addDate": "2025-08-08T14:33:26.549609+00:00",
  "refreshDate": "2025-08-08T14:33:26.549611+00:00",
  "score": 1.0,
  "title": "Fears grow for Jon Stewart's show after telling remark from CBS boss",
  "description": "The insight stems from an encounter between Status's Oliver Darcy and Paramount Skydance Co-CEO George Cheeks that occurred Thursday at the company's first press conference.",
  "content": "Jon Stewart's show could be coming to an end, after the star spoke out about his parent company Paramount's decision to settle Donald Trump's $20billion lawsuit.\n\nThe insight stems from an encounter between Status's Oliver Darcy and Paramount Skydance Co-CEO George Cheeks that occurred Thursday at the company's first press conference since being bought out by Skydance Media for $8billion.\n\nDarcy asked Cheeks asked about Stewart, who three weeks ago revealed he wasn't sure whether Paramount Skydance - the company now run by 42-year-old David Ellison - would cancel his show when his contract runs out in December.\n\nCheeks reportedly responded by asserting it was 'day one' of the new company, suggesting no decision had been made. Darcy, a former CNN reporter, pointed out renewals are usually negotiated months in advance.\n\nCheeks' answer did not change - hinting at potential career trouble for Stewart, according to Darcy.\n\nMoments before, Darcy asked Cheeks about Stephen Colbert, who has continued to cast doubt on CBS and Paramount's statement that his show was canceled purely for financial reasons.\n\nCheeks - the exec who pulled the plug on the program - reportedly said he 'didn't really know' where his relationship stood with Colbert, at this point. According to Darcy, that 'said plenty.'\n\nStewart's Daily Show just recorded its highest quarterly ratings in a decade, months after Stewart's return to hosting Mondays after stepping away in 2015.\n\nSince then, Stewart has flamed his parent company and CBS for pandering to the president, using both his 'Weekly Show' podcast and Comedy Central show as platforms. Comedy Central is owned by Paramount Skydance.\n\n'They haven't called me and said like, \"Don't get too comfortable in that office, Stewart,\"' he joked last month on his podcast.\n\n'But let me tell you something, I've been kicked out of sh*ttier establishments than that. We'll land on our feet. No, I honestly don't know.'\n\nThe assertion came on the heels of a separate report from Status that also suggested Skydance could let him go - or even cancel his show altogether as Cheeks did to Colbert's.\n\nThe move was made just prior to the merger, furthering the idea CBS reached a $16 million settlement in a suit filed by Trump just to secure FCC approval for the sale, which was in limbo in months.\n\nStewart, 62, said on his July 8 show that the payment reeked of 'fealty' and 'sound[ed] illegal.'\n\n'No one can ever kiss his a*s enough,' he said of Trump, complaining news networks like CBS were 'being held to a standard that will never be satisfactory to [him].'\n\nCBS revealed Colbert was being canned just days later, after nearly a decade of him being a thorn in Trump's side.\n\nStewart quickly took to his show again to make clear he did not buy CBS's claim the cancellation was 'purely for financial reasons’ and again accused execs like Cheeks of capitulating to Trump to secure the sale.\n\n'I believe CBS lost the benefit of the doubt two weeks prior when they sold out their flagship news program to pay an extortion fee to said president,' he said on-air on July 21, adding, 'Andy Rooney must have been rolling over in his bed.'\n\nHe continued: 'I understand the corporate fear. I understand the fear that you and your advertisers have with $8 billion at stake. But understand this.\n\n'Truly, the shows that you now seek to cancel, censor, and control? A not-insignificant portion of that $8 billion value came from those f**king shows.\n\n'That’s what made you that money. Shows that say something. Shows that take a stand.'\n\nHe told execs: 'If you believe you can make yourselves so innocuous, that you can serve a gruel so flavorless, that you will never again be on the boy king’s radar... Why will anyone watch you?'\n\nEllison, the son of MAGA supporting billionaire, Larry Ellison, has said he and Skydance had nothing to do with the decision to cancel Colbert, which also has high ratings.\n\nOthers, like David Letterman, have said Cheeks and others at Paramount pulled the plug via a backdoor deal at the behest of Skydance, to stay on the president's good side.\n\nDaily Mail has reached out to Paramount Skydance for comment.",
  "medium": "Article",
  "links": [
    "https://www.status.news/p/skydance-colbert-stewart-ellison",
    "https://www.dailymail.co.uk/news/donald_trump/index.html",
    "https://www.dailymail.co.uk/media/article-14919635/stephen-colbert-cancellation-reason-financial-ad-revenue.html",
    "https://www.dailymail.co.uk/media/article-14928799/jon-stewart-tribute-stephen-colbert-fired-show.html",
    "https://www.dailymail.co.uk/media/article-14941501/south-park-trump-episode-paramount-executives-puck.html",
    "https://www.dailymail.co.uk/media/article-14872035/dan-cbs-news-60-minutes-settlement-paramount-trump.html",
    "https://www.dailymail.co.uk/news/cnn/index.html",
    "https://www.dailymail.co.uk/media/article-14932683/jon-stewart-la-times-owner-patrick-soon-shiong-interview.html",
    "https://www.status.news/p/david-ellison-paramount-trump-side-deal-60-minutes",
    "https://www.dailymail.co.uk/media/article-14947433/jimmy-fallon-seth-meyers-late-night-ratings-cancelled-next.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Paramount Skydance",
      "weight": 0.09123997
    },
    {
      "name": "Paramount Skydance Co",
      "weight": 0.08750903
    },
    {
      "name": "Paramount Skydance Co-CEO George Cheeks",
      "weight": 0.08725225
    },
    {
      "name": "Comedy Central show",
      "weight": 0.07814587
    },
    {
      "name": "Shows",
      "weight": 0.07560122
    },
    {
      "name": "Stewart",
      "weight": 0.07506726
    },
    {
      "name": "CBS",
      "weight": 0.07061241
    },
    {
      "name": "Skydance",
      "weight": 0.0702432
    },
    {
      "name": "CBS boss",
      "weight": 0.07000193
    },
    {
      "name": "George Cheeks",
      "weight": 0.06988702
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.98291015625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.9384765625
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.65283203125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.5048828125
    }
  ],
  "sentiment": {
    "positive": 0.039886475,
    "negative": 0.75390625,
    "neutral": 0.20617676
  },
  "summary": "Fears are growing for Jon Stewart's show on his show after he criticizes Paramount Skydance, his parent company, for its decision to settle Donald Trump's $20billion lawsuit. The revelation came during a meeting between Status's Oliver Darcy and Co-CEO George Cheeks, who were speaking at Paramount's first press conference since being bought out by Skydances Media for $8bn. Darcy asked Cheeks about Stewart's future with Paramount SkyDance, which is now run by David Ellison, about whether Paramount Sky'dance, would cancel his show when his contract runs out in December. Cheeks reportedly responded by stating that it was 'day one' of the new company, suggesting no decision had been made yet. This comes after Stewart had previously stated that he was uncertain about whether the company would renew his show. Since then, Stewart has criticized CBS and Paramount for pandering to the president and their parent company for their decisions to cancel his shows, arguing that the payment reeksed of 'fealty' and'sound[ed] illegal'.",
  "shortSummary": "Jon Stewart's show faces potential cancellation due to Paramount's $20billion settlement with Donald Trump, despite ongoing negotiations and past controversies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "82c0915f58764f7dbb3166a7a5bc803f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dailymail.co.uk/news/donald_trump/index.html",
      "text": "Advertisement\nDonald Trump\nDonald Trump is an American politician, businessman, and media personality who is the current President of the United States, having also served as the 45th President from 2017 to 2021. Born in New York City, Trump made his name as a real estate developer before moving into entertainment as the host of 'The Apprentice.' He entered politics in 2015, eventually winning the 2016 and 2024 elections.\nRELATED TOPICS FOR Donald Trump\nDonald Trump: Latest news, breaking stories and updates\nPage\nTrump tears into 'total loser' ex-Republican who defected to Democrats in crucial swing state\n08/08/25 15:20\nThe former Georgia politician penned an op-ed in the Atlanta Journal-Constitution on Tuesday announcing he would join the Democratic Party....read\nExperts: Why Trump's second term is the most consequential in decades\n08/08/25 09:10When President Donald Trump entered the White House he faced a struggling economy, an immigration disaster, and brewing trouble in Europe and the Middle East.Trump's first 200 days make him 'most important president' in a century. In the next 100 he faces a reckoning even he can't stop\n08/08/25 04:00When President Donald Trump entered the White House he faced a struggling economy, an immigration disaster, and brewing trouble in Europe and the Middle East.Trump's Alligator Alcatraz hit with major setback as Obama-appointed judge moves to HALT construction\n07/08/25 21:19President Donald Trump's beloved Alligator Alcatraz immigration detention center in Florida may be in trouble.Rep. Jasmine Crockett accused of screaming at staff\n07/08/25 20:36Rising Democratic star Jasmine Crockett has been accused of screaming at staff, making some cry, opting to work from home rather than in Congress and being 'rude.'Trump-hating Jasmine Crockett 'a work-shy nightmare who screams at staff and dreams of going viral': 'All diva'\n07/08/25 20:21Rising Democratic star Jasmine Crockett has been accused of screaming at staff, making some cry, opting to work from home rather than in Congress and being 'rude.'Trump orders new census that excludes illegal immigrants\n07/08/25 17:35The president's announcement was released to Trump's followers on Truth Social on Thursday, leading to a fierce reaction from the left and right.Report: Trump admin fires top FBI officials\n07/08/25 17:02The Trump administration has reportedly dismissed multiple top FBI officials, according to several sources.Giant bust of infamous billionaire stops stunned hikers in their tracks at Yellowstone National Park\n07/08/25 16:55Creators of the bold art display are trolling Elon Musk and his 'arrogant smirk' over his work at DOGE.Trump demands immediate new census vowing illegal immigrants 'not be COUNTED' after henchman Stephen Miller claims Democrats rigged past surveys\n07/08/25 16:49The president's announcement was released to Trump's followers on Truth Social on Thursday, leading to a fierce reaction from the left and right.Trump starts firing purge of top FBI agents opposed to his administration as they decry 'retribution'\n07/08/25 16:01The Trump administration has reportedly dismissed multiple top FBI officials, according to several sources.Ilhan Omar gets brutal pushback on X after calling JD Vance a 'pedophile' protector amid Epstein files scandal\n07/08/25 15:12An AI agent has accused progressive 'Squad' member Rep. Ilhan Omar of 'opportunism' for being silent on Jeffrey Epstein's crimes until just now.Report: Possible GOP 2028 presidential contenders\n07/08/25 13:22The prospect of a 2028 run-off between Vance and Rubio, starting in Iowa, is a rumor that refuses to go away. Insiders now say a third contender could enter the fray.Mystery female presidential contender tipped for MAGA throne: 'She's got the perfect resume'\n07/08/25 12:04The prospect of a 2028 run-off between Vance and Rubio, starting in Iowa, is a rumor that refuses to go away. Insiders now say a third contender could enter the fray.Tom Homan slams Dem Delia Ramirez over 'proud Guatemalan' remark\n07/08/25 07:00Donald Trump's Border Czar Tom Homan piled onto the slew of attacks being launched at controversial Democrat Delia Ramirez.Lizzo takes aim at Sydney Sweeney in new song lyrics amid American Eagle 'good jeans' campaign backlash\n07/08/25 02:24It marked the 37-year-old Grammy winner's third parody in a week mocking the 27-year-old Euphoria stunner's controversial denim campaignReport: Ex-Trump investigator Robert Mueller allegedly in memory-care unit\n07/08/25 00:21Former FBI Director Robert Mueller, the man who led the Russia investigation into President Donald Trump, has reportedly lived in a memory-care facility for years.Ex-Trump investigator Robert Mueller discovered in memory-care facility as Republicans demand his Epstein testimony\n06/08/25 22:19Former FBI Director Robert Mueller, the man who led the Russia investigation into President Donald Trump, has reportedly lived in a memory-care facility for years.Trump border chief piles on Democrat for 'disgusting' foreign allegiance as she remains silent\n06/08/25 21:36Donald Trump's Border Czar Tom Homan piled onto the slew of attacks being launched at controversial Democrat Delia Ramirez.Trump hikes tariffs on India over Russian oil purchases\n06/08/25 19:30Starting August 27th, India will face an additional 25 percent tariff if it continues to buy oil from Russia , making the total tariff rate a crushing 50 percent.Trump's Golden Dome to undergo crucial test\n06/08/25 19:12The Golden Dome is part of President Trump's plan to create a missile defense system to protect the U.S. homeland from incoming threats.Trump drops the hammer on India with crushing 50% tariffs in massive trade war punishment\n06/08/25 18:54Starting August 27th, India will face an additional 25 percent tariff if it continues to buy oil from Russia , making the total tariff rate a crushing 50 percent.Tim Scott smacks down CBS anchor over Trump question\n06/08/25 18:43A top Republican in the U.S. Senate stepped up to defend his Christian faith and relationship with President Trump during an interview on CBS Tuesday.Trump's Golden Dome to undergo crucial test as he expands missile defense dream\n06/08/25 18:34The Golden Dome is part of President Trump's plan to create a missile defense system to protect the U.S. homeland from incoming threats.Tim Scott smacks down CBS anchor when pressed about his faith and relationship with Trump\n06/08/25 18:29A top Republican in the U.S. Senate stepped up to defend his Christian faith and relationship with President Trump during an interview on CBS Tuesday.Trump ally accused of threatening to detonate revenge porn after he was dumped by much-younger girlfriend\n06/08/25 16:11A Florida beauty pageant winner claims her relationship with Republican Cory Mills went awry and that he has since intimidated her and threatened to release her nude videos.MTG urges Trump to pardon George Santos\n06/08/25 13:20Marjorie Taylor Greene penned a letter urging Trump to pardon disgraced George Santos following the release of his emotional letter from behind bars demanding clemency.Fire-breathing Nancy Mace gets ICY reception in campaign for South Carolina's top job\n06/08/25 13:13It's early on, but South Carolinians who spoke to the Daily Mail the day Nancy Mace announced a run for governor were mostly unenthused with the hometown Republican maverick.Republican lawmaker's call to denaturalize and deport Democrat\n06/08/25 10:20A recent remark from a Democratic member of the U.S. House of Representatives has caught fire prompting shocking comments from some of her congressional colleagues.Democratic rep. Al Green pushes for third Trump impeachment\n06/08/25 10:15Texas Democrat Rep. Al Green has, once again, promised to impeach President Donald Trump, likely making him the most-impeach happy U.S. lawmaker to ever live.America's most likeable politician revealed in new poll that shows the Pope and Zelensky at the top\n06/08/25 00:14New polling released by Gallup Tuesday revealed the politician Americans feel most favorably towards.Calls for Democratic lawmaker to be denaturalized and deported catch fire after controversial remark in Mexico\n05/08/25 22:02A recent remark from a Democratic member of the U.S. House of Representatives has caught fire prompting shocking comments from some of her congressional colleagues.Marjorie Taylor Greene begs Trump to pardon disgraced fabulist George Santos after dramatic letter from prison\n05/08/25 21:26Marjorie Taylor Greene penned a letter urging Trump to pardon disgraced George Santos following the release of his emotional letter from behind bars demanding clemency.Trump threatened with THIRD impeachment by widely mocked liberal as his colleagues roll their eyes\n05/08/25 21:20Texas Democrat Rep. Al Green has, once again, promised to impeach President Donald Trump, likely making him the most-impeach happy U.S. lawmaker to ever live.Ghislaine Maxwell doesn't want grand jury materials in her case unsealed\n05/08/25 19:29Longtime Jeffrey Epstein accomplice Ghislaine Maxwell does not want the grand jury testimony from her case unsealed.Ghislaine Maxwell makes blistering rebuttal after Trump demands release of secret Epstein grand jury transcripts\n05/08/25 18:44Longtime Jeffrey Epstein accomplice Ghislaine Maxwell does not want the grand jury testimony from her case unsealed.Justice Department debates release of Ghislaine Maxwell interview\n05/08/25 16:41Attorney General Pam Bondi is weighing whether to release an audio recording of the interviews her deputy conducted with Ghislaine Maxwell last month.Trump claims he had nothing to do with Bondi's grand jury order\n05/08/25 16:10Donald Trump celebrated his Justice Department convening a grand jury in cases against officials from Barack Obama's administration.House committee issues subpoenas for Epstein files\n05/08/25 15:43Several of America's former top political leaders have been issued subpoenas to testify about 'horrific crimes' perpetrated by former financier and convicted pedophile Jeffrey Epstein.Fast-rising Republican star is accused of bloody dog attack and making menacing Dick Cheney 'joke'... before 'bursting out laughing'\n05/08/25 15:32Republican candidate for the Senate Blake Miguez has been accused by a woman of the bloodthirsty attack on the ranch in Louisiana.Trump shares who he is considering for Fed Chair if he ousts Powell\n05/08/25 15:31President Donald Trump revealed who he is considering to chair the Federal Reserve if he should oust Jerome Powell.Trump claims he had nothing to do with Pam Bondi's grand jury order targeting Obama officials on 'Russia hoax'\n05/08/25 15:23Donald Trump celebrated his Justice Department convening a grand jury in cases against officials from Barack Obama's administration.Bill and Hillary Clinton and ex-Trump DOJ officials subpoenaed by Republicans to provide bombshell testimony on Epstein\n05/08/25 14:35Several of America's former top political leaders have been issued subpoenas to testify about 'horrific crimes' perpetrated by former financier and convicted pedophile Jeffrey Epstein.Ghislaine Maxwell says she never saw Trump do anything that would have 'caused concern' during secret interview\n05/08/25 14:30Jeffrey Epstein's former lover Ghislaine Maxwell said she never saw Donald Trump do anything that would have 'caused concern' during a secret interview with DOJ attorneys.Trump teases final four contenders for Fed Chair and the big name he's already ruled out\n05/08/25 12:43President Donald Trump revealed who he is considering to chair the Federal Reserve if he should oust Jerome Powell.John Fetterman's take on Trump's Epstein files\n05/08/25 12:39Democrat John Fetterman is striking a different position on the release of the Jeffrey Epstein files from the rest of his party.John Fetterman offers surprising take on Trump's Epstein files debacle as he breaks with his party\n05/08/25 10:50Democrat John Fetterman is striking a different position on the release of the Jeffrey Epstein files from the rest of his party.Jasmine Crockett unleashes tirade on Trump\n04/08/25 18:56Democrat Texas Congresswoman Jasmine Crockett shared some choice words for President Donald Trump during her latest rabble-rousing stunt.Jasmine Crockett unleashes foul four-letter tirade on Trump as backlash brews against GOP midterm plans\n04/08/25 18:46Democrat Texas Congresswoman Jasmine Crockett shared some choice words for President Donald Trump during her latest rabble-rousing stunt.Trump slammed by Republicans after firing Labor Statistics chief\n04/08/25 18:41Donald Trump's Republican allies and foes say the president was wrong to fire Labor Statistics commissioner over a lackluster July jobs report.Texas Dem lawmakers flee state to protest GOP's redistricting plan\n04/08/25 18:15Over 50 Democratic state lawmakers fled the state over the weekend to avoid voting on a controversial Donald Trump-backed piece of legislation that could help Republicans get more power.AOC busted for bending rules with fiancé Riley Roberts as he scores thousands worth of perks and freebies for spouses only\n04/08/25 18:01The House Committee on Ethics has rebuked Progressive 'Squad' Rep. Alexandria Ocasio-Cortez for claiming in government filings that her fiancé both is and is not her 'spouse.'Trump knifed by fellow Republicans over recent firing as he plans revenge on 'rigged' jobs data\n04/08/25 16:41Donald Trump's Republican allies and foes say the president was wrong to fire Labor Statistics commissioner over a lackluster July jobs report.Inside GOP's effort to stop Trump from pardoning Ghislaine Maxwell\n04/08/25 15:40Donald Trump is facing warnings from Republicans concerned he is considering a pardon for Jeffrey Epstein's associate Ghislaine Maxwell.Texas Democrat lawmakers FLEE the state on private jet in abhorrent stunt to seize power\n04/08/25 14:59Over 50 Democratic state lawmakers fled the state over the weekend to avoid voting on a controversial Donald Trump-backed piece of legislation that could help Republicans get more power.Nancy Mace launches South Carolina governor bid\n04/08/25 14:39Republican firebrand Nancy Mace has launched a bid to become South Carolina's next governor on a platform reminiscent of President Donald Trump's.Inside the furious Republican-led effort to STOP Trump from pardoning Ghislaine Maxwell\n04/08/25 13:39Donald Trump is facing warnings from Republicans concerned he is considering a pardon for Jeffrey Epstein's associate Ghislaine Maxwell.Controversial GOP firebrand Nancy Mace vows more 'under their skin' antics as she launches South Carolina governor bid\n04/08/25 12:24Republican firebrand Nancy Mace has launched a bid to become South Carolina's next governor on a platform reminiscent of President Donald Trump's.Texas GOP's new map moves Jasmine Crockett's home out of her district\n04/08/25 10:20Firebrand Democrat Jasmine Crockett faces being booted from Congress after Republicans proposed a heavily gerrymandered redistricting mapTexas GOP jabs at Jasmine Crockett with their proposed new map... as she calls spiteful move a 'red flag'\n03/08/25 22:10Firebrand Democrat Jasmine Crockett faces being booted from Congress after Republicans proposed a heavily gerrymandered redistricting mapDem Gov Jared Polis's VERY awkward reaction when questioned about Kamala running in 2028\n03/08/25 17:44As Kamala Harris reemerges into the political spotlight, other members of her party are signaling that she shouldn't be treated as their presumptive 2028 presidential nominee.Ex-Fox News host Jeanine Pirro - ridiculed on SNL - is new Attorney for the District of Columbia\n03/08/25 15:23Another former longtime staple presence of the Fox News Channel has officially joined the Trump administration.Jennifer Garner sports ring on THAT finger amid John Miller romance and move-in rumors\n03/08/25 02:13The 13 Going on 30 star first began dating the CaliGroup CEO in 2018, three years after her separation from her ex-husband Ben Affleck , with whom she shares three children.White House Cabinet room looks unrecognizable after Trump's obsessive redecorating\n02/08/25 13:58A detailed review of the items included in Donald Trump's redesigned Cabinet Room includes 18th Century English silver, Chinese porcelain from the 1700s, and portraits he selected.Marjorie Taylor Greene threatens dramatic breakup with Trump over a core base frustration that could upend entire Republican Party\n02/08/25 13:57Marjorie Taylor Greene has about had it with the Republican party.Donald Trump says US nuclear attack submarines are now 'closer to Russia' after he re-deployed them over Kremlin's 'foolish and inflammatory' taunts\n02/08/25 08:35US President Donald Trump originally did not say where the submarines were deployed but tensions notched up another level as he admitted they were getting closer to Russia.Ghislaine Maxwell's bombshell televised testimony on Epstein's crimes indefinitely postponed\n01/08/25 21:12Ghislaine Maxwell's testimony before Congress has been postponed pending her Supreme Court case, a top Republican has announced.Trump breaks silence on 'burn bags' claim\n01/08/25 18:12The president seized on new classified information released by his Republican allies about the 2016 election, calling it the 'crime of the century' and ones again trying to focus on Dem rivals.Trump deploys two nuclear submarines near Russia\n01/08/25 18:07Trump announced that he had ordered the deployment of a pair of U.S. nuclear submarines angry exchanges with a top Russian official over his deadline to end Russia's war in Ukraine.Cringe social media mistake by Trump's top allies promoting his signature win sparks viral reaction: 'So close!'\n01/08/25 17:17The official X account of the Republican Party is getting roasted for making a basic marketing mistake.Trump deploys two nuclear submarines near Russia after 'foolish and inflammatory' taunts in major escalation\n01/08/25 17:14Trump announced that he had ordered the deployment of a pair of U.S. nuclear submarines angry exchanges with a top Russian official over his deadline to end Russia's war in Ukraine.Trump breaks silence on shocking 'burn bags' claim, fuming his favorite old foe must pay for crimes yet to be proven\n01/08/25 16:57The president seized on new classified information released by his Republican allies about the 2016 election, calling it the 'crime of the century' and ones again trying to focus on Dem rivals.Barron Trump has not been seen with his dad Donald in months\n01/08/25 10:15The 19-year-old NYU student was last seen by his dad's side at his inauguration.Report: GOP Rep. Massie broke Trump truce\n31/07/25 20:29President Donald Trump's top Republican nemesis in Congress reportedly broke a truce that the two had struck after vicious infighting.Embarrassing moment as Elizabeth Warren takes nasty tumble in front of the entire Senate\n31/07/25 20:24Democratic Senator Elizabeth Warren took an accidental tumble while on the Senate floor, new video shows.Inside anti-Trump Republican's bizarre and potentially career-ending Epstein plot to take down the president\n31/07/25 18:58President Donald Trump's top Republican nemesis in Congress reportedly broke a truce that the two had struck after vicious infighting.Pelosi clashes with CNN's Jake Tapper over 'insider trading' claims\n31/07/25 18:46One late-night TV host wasn't afraid to put a top Democrat on the spot during an appearance on his Wednesday night TV program.Nancy Pelosi clashes with CNN's Jake Tapper live on air over Trump's 'insider trading' allegations\n31/07/25 18:30One late-night TV host wasn't afraid to put a top Democrat on the spot during an appearance on his Wednesday night TV program.Ex-Biden aide testifies Joe was 'fully capable'\n31/07/25 17:27Another top long-time aide to former President Joe Biden was called to testify before the Oversight Committee in the House of Representatives Wednesday.Barron Trump has not been by dad Donald's side in MONTHS sparking speculation about his whereabouts\n31/07/25 17:01The 19-year-old NYU student was last seen by his dad's side at his inauguration.\nPage\nDON'T MISS\n-\nAndi Oliver reveals her fury at Chris Moyles over vile comments he made about her daughter Miquita and compares him to a 'drunk racist'\n-\nEXCLUSIVE\nYou wouldn't see that on the catwalk! Kate Moss, 51, gets the giggles as she's surrounded by naked sunbathers on nudist beach - before nearly baring all herself\n-\nCoronation Street and Mrs Brown's Boys star Frank Grimes dead aged 78 following a short illness\n-\nEXCLUSIVE\nInside Nicola and Brooklyn's secret SECOND wedding that's ultimate snub to the Beckhams. Feud turns truly toxic after 'do-over' ceremony - as insiders tell of Victoria's fury with 'viper' Nicola\n-\nThe moment a 'feud' between Loose Women's Myleene Klass and Frankie Bridge spilled onto live TV as sources claim ITV have been forced to step in\n-\nFancy a party in paradise? Two tickets for Centreforce's Tenerife Weekender 2025 are up for grabs\nAd Feature\n-\nDenise Welch backtracks on infamous Taylor Swift interview days after sobbing to son Matty Healy\n-\nEXCLUSIVE\nThe vile porn videos that mean Taylor Swift could have 'wreaked havoc' on her ex Matty Healy: 'Everyone in the room was disgusted'\n-\nLila Moss, 22, looks incredible in a white bikini as she enjoys a swim with boyfriend Yoni Helbitz, 23, during trip to nudist beach with her mother Kate in Ibiza\n-\nSmart moves: The 10 must-know education brands helping the UK learn better and faster\nAd Feature\n-\nAmy Childs and Lauren Goodger put on leggy displays as they reunite with TOWIE co-stars at ITV launch\n-\nWayne Lineker's daughter Tia, 26, arrives in Mallorca ahead of her wedding to football manager partner Harry Agombar, 32\n-\nPrincess and Junior Andre reveal the lesson they've learned from their famous parents in first solo TV interview - after mum Katie Price slammed their new show\n-\nCarefree Frankie Bridge shows off her peachy bottom in a tiny green bikini as she larks around in the Maldives amid 'feud' with Myleene Klass\n-\nEXCLUSIVE\nThe Yorkshire Vet's Matt Jackson-Smith reveals how to care for your dog as they grow u, and his dog Harry's VERY unusual traits\nAd Feature\n-\nRomeo Beckham flexes his luxury lifestyle in a £1K Balenciaga jersey and Rolex watch as he steps into his pricey £100K Porsche with a pal on night out\n-\n80s music icon issues surprise health update after cancelling ALL upcoming tour dates\n-\nShirtless Cruz Beckham, 20, relaxes on dad David's £16M yacht before sharing a steamy smooch with girlfriend Jackie Apostel, 30, on loved-up holiday\n-\nKate Gosselin, 50, is unrecognizable in new video... 15 years after flaunting her bikini body during Jon & Kate Plus 8 era\n-\nThe stars of the much-loved Wittering Whitehalls podcast on how a hearing check has changed their relationship\nAd Feature\n-\nKenny Logan reveals his sex life struggles with wife Gabby (and what he keeps private) after he had his prostate removed following cancer battle\n-\nAnt McPartlin and leggy wife Anne-Marie Corbett enjoy a romantic lunch date as they celebrate their fourth wedding anniversary amid Portuguese getaway\n-\nWedding venue loved by Taylor Swift files for bankruptcy... with only $57 left and $63 MILLION due to creditors\n-\nEXCLUSIVE\nSheridan Smith says she would 'love' to return for Two Pints Of Lager And A Packet Of Crisps reboot as she joins co-star Will Mellor's calls to revive the iconic BBC comedy\n-\nEating for bump, and beyond! Pregnancy nutritionist reveals her top diet advice for those trying to conceive, pregnant, breastfeeding and baby nutrition\nAd Feature\n-\nJessie J reveals she needs to have more surgery after being rushed back to hospital following mastectomy and breast cancer battle\n-\nPrincess Andre and her brother Junior join glam stars at the launch of ITV's reality entertainment schedule - after mum Katie Price blasted their new show\n-\nHow Kelly Clarkson's TV shows could be impacted after her ex's shock death\n-\nEmma Thompson poses alongside daughter Gaia Wise at The Dead Of Winter photocall at the Locarno Film Festival in Switzerland\n-\nSip smarter this summer: Discover the 'Magic of Moderate Drinking' with these simple tips\nAd Feature\n-\nEXCLUSIVE\nKelly Clarkson hit by unimaginable double tragedy after ex-husband Brandon Blackstock's shock cancer death: Fears as star 'feels lost'\n-\nMacaulay Culkin finally clarifies Home Alone rumours that have left fans guessing for YEARS\n-\n90s pop icon looks unrecognisable 26 years on from hit record\n-\nNepo baby of music icon walks Fashion Week runway... after claiming nepotism 'doesn't help' her career\n-\nGet set for a totally WICKET summer: The Hundred is rolling into cities across the UK - this is how YOU and your family can join the fun\nAd Feature\n-\nEXCLUSIVE\nOlivia Bowen breaks down in tears as she shares fears of losing unborn baby in 'most real and raw' show tracking highs and lows of parenthood\n-\nAndy Cohen sparks feud with tennis star Martina Navratilova as he calls her comments on surrogacy 'dumb'\n-\nCara Delevingne drives home after celebrating her 33rd birthday sober after celebrating with fellow celebrity pals in Los Angeles\n-\nDanica Patrick sets pulses racing as she shows off stunning physique latest European vacation\n-\nFrom spending when you're abroad to absolutely smashing the preparation and packing, we reveal how to holiday like a pro\nAd Feature\n-\nWhat's got The Saturdays All Fired Up? Fans convinced Rochelle Humes and Frankie Bridge have fallen out after 'Wimbledon snub' and cryptic post\n-\nEXCLUSIVE\nTom Holland and fiancée Zendaya are spotted filming together for the first time on set of Spider-Man: Brand New Day in Surrey\n-\n'Surprisingly poor' John Cleese, 85, is set to buy a house in Bath with his fourth wife - after giving her his £1.5m Chelsea flat\n-\nRochelle Humes steps out with sister Sophie Piper after she raised eyebrows by posting Myleene Klass' ex Graham Quinn - as fans speculate she's fallen out with Frankie Bridge\n-\nFrom Icelandic waterfalls to Japanese tea ceremonies: The new cruise collection that promises adventure as well as ultra-luxury\nAd Feature\n-\nIconic Netflix actress looks unrecognisable as she shares throwback snap - but can YOU guess who it is?\n-\nAmanda Holden shows off her sizzling figure in a skimpy white bikini as she twins with lookalike glam daughter Lexi Hughes in Greece\n-\nBig Brother star Hardeep Singh Kohli 'groped woman's buttocks at BBC studios, indecently assaulted another at hotel and tried to put his tongue in third victim's mouth'\n-\nBig budget ITV game show AXED as gutted presenter admits 'I don't know what I did wrong'\n-\nAbbey Clancy looks sensational in a tiny cream bikini as she enjoys a yacht trip with shirtless husband Peter Crouch in the south of France\n-\nLove Island's Harry and Shakira reveal how things have REALLY been left with Helena in first TV interview - but swerve question about if they're exclusive\n-\nBBC Breakfast fans gasp 'my head hurts!' as show pulled off air after string of technical blunders so bad they 'thought their TVs were broken'\n-\nNetflix star goes on 180-hour journey to tiny Greek island to eat his favourite ice cream\n-\nMariah Carey reveals the unlikely requests she has for King Charles when she performs for him at Sandringham\n- After FOUR years of menopause struggles I took a chance on this supplement - now I'm sleeping better and finally feeling more like myself SHOPPING\n-\nKanye West's wife Bianca Censori covers up for stepmom duty as she takes rapper's kids out in LA\n-\nPrincess Beatrice appears in promo for UAE bank's new Mayfair branch - as explosive new claims about Prince Andrew's business dealings emerge\n-\nGina Carano rejoices over win for free speech as Disney forced to settle Mandalorian firing with groveling statement\n-\nFurious Sha'Carri Richardson pummels boyfriend in shocking security footage from arrest\n-\nScarlett Johansson is blasted by fans for her 'awful' English accent in new movie My Mother's Wedding\n- The 'liquid gold' facial tanner that fights ageing and has beauty fans obsessed: 'Best tanning drops EVER!' (now 20% off, but not for long) SHOPPING\n-\nPrincess Beatrice's original name was rejected by the late Queen for being too 'yuppie'\n- Kelly Clarkson's ex-husband Brandon Blackstock dead at 48 after cancer battle Sad news\n-\nPrincess Andre makes a solo red carpet appearance at beauty event after mum Katie Price condemned her upcoming documentary\n- Pet owners love this dog food subscription service for better fur, skin and health - and it costs just 89p a DAY (plus it's 40% off right now) SHOPPING\n-\nWhite Lotus actor calls out 'old movie stars' who get plastic surgery to play 'young roles'\n-\nCheffin' it up! Brooklyn Beckham gets back in the kitchen as he hosts Cloud 23 summer party - after renewing his vows with wife Nicola Peltz amid family feud\n-\nLauren Sanchez shows off extravagant £227k watch she was gifted as a wedding present by billionaire husband Jeff Bezos\n-\nEXCLUSIVE\nLove Island's Dejon Noel-Williams defiantly hits back at being branded a 'narcissist' - revealing he wanted to QUIT\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n-\nEXCLUSIVE\nThe man who discovered Elvis... and then destroyed him: How the King spiralled into addiction and death at the hands of his high-rolling manager\n-\nThe nepo-baby so well-connected she's King Charles's 'official DJ' and parties with Naomi Campbell - but you've probably never heard of her\n-\nUS actor Jeremy Piven drops C-bomb in trainwreck interview on Aussie radio\n-\nFrankie Bridge raises eyebrows with cryptic post saying 'you're dead to me' - so who IS she talking about?\n-\nAudiences are left shocked by Margot Robbie and Jacob Elordi's 'aggressively provocative' Wuthering Heights movie with 'BDSM sex scene'\n- MasterChef loses nearly 1MILLION viewers as new series airs after both presenters were sacked On the slide\n-\nFreddie Mercury fans turn their ire on author who revealed star's love child in bombshell book - but she's sticking to her guns\n-\nWhat's inside Keith Urban's bag? Nicole Kidman's husband reveals the one item he ALWAYS flies with as he touches down with $12,000 worth of luggage\n-\nThe Royal Family's connection to acting and Princess Beatrice's surprising Hollywood film debut alongside Emily Blunt\n-\nWill Carrie Bradshaw end up alone? And Just Like That... hints at iconic character's final storyline as 'woke' reboot is cancelled\n-\nOzzy Osbourne leans on wife Sharon in one of their last photos together as part of first glimpse at moving new documentary\n-\nInside Max Parker and Kris Mochrie's lavish wedding: Emmerdale stars who played brothers on hit soap tie the knot\n-\nStranger Things star gets engaged to longtime partner\n-\nPregnant Rihanna shows off her bump as she shops at pricey baby boutique in Beverly Hills\n-\nEXCLUSIVE\nMax Verstappen and girlfriend Kelly Piquet purchase plot of land at luxury development Pinheirinho Comporta in Portugal\n-\nThe surprising royal who became the first - and only - member of the Royal Family to complete the London Marathon\n-\nJennifer Lopez, 56, refused entry into Chanel store after security 'failed to recognise her'\n-\nBrooklyn Beckham is back in the kitchen as he whips up a carbonara in latest cooking video - after renewing his vows with wife Nicola Peltz amid family feud\n-\nEXCLUSIVE\nWhy Andrew is 'toast': The man who revealed 'highly sexed' Prince Andrew's multiple affairs tells all to Palace Confidential\n-\nMachine Gun Kelly reveals the parenting comment that left Megan Fox 'fuming'\n-\nDuchess Sophie's stunning floral dress sold out immediately - we've found high street versions that look equally stylish\n-\nJodie Kidd makes rare public appearance with her lookalike son Indio, 13, as they attend the Space NK London launch party\n-\nMeghan does not deserve to be called 'Duchess Difficult'. Shame on the royals - This week have shown how wrong they are: BRYONY GORDON\n-\nQueen Mary's daughter Princess Isabella is caught in an X-rated shirt at a wild Danish music festival - and royal watchers are fuming\n- Brandon Blackstock's daughter announced her pregnancy weeks before his death His death was confirmed on Thursday\n-\nDiddy's ex Cassie Ventura returns to social media for first time since giving birth... after her painful testimony against the rapper\n-\nJAN MOIR: Andrew is utterly irredeemable but Fergie is so much worse. Her late-night emails to me say it all\n-\nPink's daughter Willow, 14, is her TWIN as singer poses for rare photo with her children\n-\nEDEN CONFIDENTIAL: Will Harry consider what he might have achieved in tandem with his brother after Sentebale row?\n-\nDark secret every influencer knows... but will never admit: Insiders tell me shame of trick so many stars exploit: MOLLY CLAYTON\n- Inside Kelly Clarkson and Brandon Blackstock's love story that ended in tragedy Died at 48 following a cancer battle\n-\nJaime King ordered to court after ex-husband's divorce lawyers claim she failed to pay over $100K in fees\n- ITV pulls the plug on legendary presenter's big TV comeback by AXING show after just one series All over\n-\nYungblud strips down to a British flag kilt for killer impromptu performance at his London store launch party\n-\nPrince Andrew lost his virginity at the age of 11 and had scores of sexual experiences before he turned 13, royal biographer claims\n- How the Royal Albert Hall was saved by the rave: KATIE HIND The Grade I-listed stages more than 390 shows a year\n- Katie Holmes' mini-me Suri, 19, beams on NYC movie set... before heading back to college in Pennsylvania Getting involved\n-\nFreakier Friday review: Twice as many body swaps, but this ropy sequel's only half the fun, writes BRIAN VINER\n-\nZoe Ball admits she was reduced to tears after falling victim to a random street crime after appearance on The One Show\n- King Charles to commemorate the 80th anniversary of VJ Day with an address to the nation Special day\n- Liam Neeson fans savage reporter for asking him about 'cringe' topic during 'nonsense' interview Not happy\n- Jack Nicholson's grandson Sean arrested on felony domestic violence charge He's the eldest of the 88-year-old's grandchildren\n-\nWednesday star Percy Hynes White has very ordinary new job after sex assault allegations got him cancelled\n- Cheryl Burke raves about having 'great' sex with HERSELF... three years after Matthew Lawrence divorce Surprising\n-\nDo you REALLY, REALLY wanna body to match Spice Girl Mel C? Well, here are my top tips on how you can get it...\n-\nHeartbreaking last picture of Oasis fan before he plunged to his death at Wembley gig\nLandscape gardener Lee Claydon died at show\n-\nKatie Price condemns daughter Princess Andre's documentary in explosive new interview as she sets record straight\n-\nAmal Clooney, 47, cuts an elegant figure in a pink thigh-split dress as she and her dapper husband George, 64, head out for dinner\n-\nChris Hughes reveals the old-fashioned way he told JoJo Siwa how he really felt about her and recalls the moment when feelings changed\n-\nI'm A Celeb star is cruelly dad-shamed by online trolls for sharing picture of his four-year-old son drinking milk from a bottle\n-\nEXCLUSIVE\nREVEALED: The comments that confirm Rebekah Vardy won't fulfil her dream of moving to Beckham's precious Miami\n- Singer Caity Baser reveals she was sexually assaulted by a family friend when she was just eight years old Harrowing\n-\nDavid Beckham rocks tiny trunks with Victoria and son Cruz on yacht... while Brooklyn and wife Nicola Peltz are seen for first time since vow renewal amid 'feud'\n- The Walking Dead star Kelley Mack 'suddenly relapsed' after cancer treatment before death aged 33 Very sad\n-\nCHRISTOPHER STEVENS reviews The Fortune Hotel: 'A witless game show set in paradise, but as boring as hell'\n-\nEXCLUSIVE\nUnearthed photos show Brad Pitt's treasured memories of his late mum, who was cut off from her grandkids by Angelina\n- Jack Lowden's wedding photos finally appear, but it is not his wife Saoirse that's in them Unexpected\n- Jason Kelce opens up on music career... and the chances of a collaboration with Taylor Swift Big plans\n- Nepo baby lands gig working alongside his actor dad - can you guess his famous father? Following his footsteps\n-\nMacaulay Culkin regrets missing '90s comedy after not even reading the script during teenage retirement\n-\nMy sister disappeared on a cruise ship 27 years ago - what I think REALLY happened is the stuff of nightmares\n-\nMariah Carey accused of shading Katy Perry as she gives 'savage' response when asked about singer's space trip\n- New twist in Conor Maynard and Charlotte Chilton paternity row as explosive new allegation is 'revealed' Latest development\n- Richard Gere jets back to US as furious daughter of music icon curses him over sale of her childhood home Outraged\n- Jacob Elordi and Olivia Jade Giannulli SPLIT after four years together The couple have called time on their romance\n- Katy Perry reveals nasty injuries after THAT harrowing viral stage collapse Took to her Instagram on Wednesday\n-\nEXCLUSIVE\n'This is the Oasis effect': Woke TV comedian blames the Gallaghers after nobody turned up to watch her Edinburgh shows\n-\nKylie Jenner flashes cleavage and drinks wine with pals as it's been ONE MONTH since she's been seen with Timothee Chalamet\n-\nStacey Solomon shares adorable photos of her daughters, Rose, three, and Belle, two, as she gives an insight into their family holiday\n-\nDenise Richards accused of 'abandoning' sick dog by ex Aaron Phypers... days after she's seen with black eye\n-\nEXCLUSIVE\nKim Kardashian's ex-pal Larsa Pippen, 50, displays a puffier face as a surgeon weighs in on what she may have done\n-\nEastEnders confirms return of TWO Walford legends as devastating death sends shockwaves through Albert Square\n-\nAna de Armas exudes glamour as she takes part in a sake barrel ceremony amid claims her love affair with Tom Cruise is 'doomed'\n-\nChannel 4 bombarded with Ofcom complaints over 'disgusting' sex scenes in Bonnie Blue documentary about romp with 1000 men\n-\nEXCLUSIVE\nAnd Just Like That viral star spills show secrets... and why he thought SJP's BFF might have REPLACED him\n-\nDenise Welch leaves Loose Women open-mouthed with OUTRAGEOUS bedroom confession during sex debate\n- Scottie Scheffler revives Happy Gilmore 2 cameo role at FedEx Cup One of the biggest events on the PGA's calendar\n-\nSharon Osbourne reveals husband Ozzy's final words about his fans in interview that took place five days before his death\n-\nAll the signs that a huge noughties rock band are making a massive comeback after not releasing any music for three years\n-\nGregg Wallace and wife Anna stand united as they celebrate their nine year wedding anniversary amid the star's sexual misconduct probe\n-\nSafiyya Vorajee reflects on struggle to find someone worthy of her love following heartbreaking split from Ashley Cain\n- Mario Lopez SCREAMS at cheerleader suing him for defamation during fiery court appearance Furious\n- Sad details of country legend's funeral revealed after Dolly Parton dubbed star as her 'dearest friend' Tragic\n-\nClarkson's Farm breakout star Harriet Cowan makes emotional plea as she leads farming campaign after leaving the show\n-\nHulk Hogan's body still waiting to be cremated as daughter makes blistering intervention amid 'foul play' claims\n-\nKelly Clarkson fans all saying the same thing as her ex-husband's illness forces Vegas residency cancellation\n- Kate Ritchie makes surprise return to her Nova radio show after taking time off to focus on her mental health Welcome return\n- Revealed: Travis Kelce's incredible act for Chiefs teammates makes them think 2025 is his final season Is it all over?\n-\nHarry Potter star Michelle Gomez insists she 'supports trans rights without hesitation' and is 'taking accountability' after backlash over casting\n- Hulk Hogan's daughter Brooke 'promises' legal action against members of her late father's inner circle Not happy\n-\nDenise Richards' daughter Sami Sheen models VERY skimpy lingerie... after sharing she was 'almost sex trafficked'\n-\nLydia Bright discusses her nan's worsening dementia as she recalls heartbreaking moment she forgot who she was\n-\nModern Family child star makes surprising career move... see her now\n-\n'Skint' Josie Gibson resorts to 'moving back into a caravan' after This Morning star's home renovation leaves her 'sleepless and with stress through the roof'\n-\nLatin music trailblazer who won EIGHT Grammys dies at 88\n-\nMeet the nepo baby from an acting DYNASTY who is following in her family's footsteps\n-\nBikini-clad Abbey Clancy is every inch the style icon in £430 Gucci bucket hat as she enjoys holiday in the south of France with shirtless husband Peter Crouch\n-\nRomeo Beckham adds another fashion campaign to his portfolio with Champion shoot - after taking another swipe at Brooklyn\n- Myleene Klass hints at more revelations as she issues cryptic warning to those that 'have reason to' be afraid after her explosive claims her ex-husband cheated on her\n-\nBrooklyn Beckham and his wife Nicola Peltz are seen for the first time since renewing their vows as they enjoy a PDA-filled late night stroll in New York\n-\nCountry music star reveals devastating health scare that has put her shows in jeopardy\n-\nJohn Cena reveals cosmetic procedure he had done that 'completely changed the course' of his life\n-\nSarah Ferguson sends her critics a message with her footwear after bombshell book that Royals tried to ban accused both her and Andrew of cheating\n-\nSelena Gomez reveals she became best friends with Taylor Swift as they 'bonded' over Jonas Brothers break-up\n-\nSydney Sweeney's brother Trent mocks the backlash over his sister's American Eagle campaign after it was branded 'Nazi propaganda'\n-\nI made £550k flipping a crumbling property despite a string of warnings from experts - I'm laughing all the way to the bank even after going £100k over budget\n-\nEXCLUSIVE\nJoe Manganiello's girlfriend Caitlin O'Connor reveals she stays slim thanks to a diet based on 'blood work'\n-\n80s music icon cancels all upcoming tour dates over 'urgent' health issue\n-\nHeartbroken Kelsey Parker appears in first TV interview since death of her baby Phoenix - three years after losing her husband to cancer\n-\nPamela Anderson receives a kiss from new beau Liam Neeson before he feeds her popcorn as romance heats up\n-\nRebel Wilson faces lawsuit from the lead star of her own film over 'false' sex allegations\n-\nChristian Horner shares a swimsuit snap of wife Geri as he wishes her a happy birthday - amid her £1M debts, his Red Bull sacking and ongoing Spice Girls feud\n-\nBBC Breakfast star Charlie Stayt's behaviour is now also 'under review' as his co-host Naga Munchetty faces probe into 'bullying' claims\n-\nFrom Kim Kardashian's nasty sunburn and Kate Moss' VERY overpriced beach bag, the wardrobe gaffes that plague celebrity vacation-goers\n-\nArmie Hammer reveals he would smoke up to 20 joints a DAY, 'loved' drugging people and was banned from spending time with co-star Johnny Depp\n-\nJennifer Lopez, Jennifer Garner, Katie Holmes and Cameron Diaz all have look-alike sisters... see the comparisons\n-\nRichard Osman reveals how game shows STOP contestants from winning big money jackpots as broadcasters battle to balance the books\n-\nMaura Higgins, 34, poses for a mirror selfie in a red hospital gown before an MRI as her mystery injury is revealed\n-\nThylane Blondeau looks effortlessly chic in a sheer crochet maxi dress as she joins boyfriend Benjamin Attal on a dinner date in Saint-Tropez\n-\nZara McDermott and Louis Tomlinson's fans go wild as couple confirm they're in LOVE after taking their relationship to the next level with PDA post\n-\nKelly Clarkson reveals heartbreaking family news about ex-husband Brandon Blackstock as she's forced to CANCEL Las Vegas residency\n-\nSwimsuit-clad Vogue Williams looks more loved-up than ever with husband Spencer Matthews as she marks his birthday with a series of sweet snaps\n-\nLewis Hamilton and Leonardo DiCaprio-backed synthetic meat restaurant chain falls into liquidation"
    },
    {
      "url": "https://www.dailymail.co.uk/media/article-14941501/south-park-trump-episode-paramount-executives-puck.html",
      "text": "Secrets of South Park Trump-Epstein episode that will further anger the White House\nTop brass at the entertainment conglomerate that airs South Park signed off on a controversial episode of the series that viciously mocked President Donald Trump while linking him to Jeffrey Epstein.\nComedy Central owner Paramount Global's three co-CEOs all the watched the show's no-holds-barred season 27 premiere, which featured Trump in bed with Satan and a deepfake of the president wandering nude in the desert, Puck News reported.\nChris McCarthy, George Cheeks, and Brian Robbins were leaning toward airing it before running by their boss, Paramount heiress Shari Redstone.\nRedstone reportedly didn't watch the episode but 'trusted [the executives'] judgment and would support their decision,' Puck News reported.\nThe trio concluded it was OK, despite the episode taking on Paramount's $16 million settlement with Trump over a 60 Minutes interview with Kamala Harris and CBS canceling the Late Show with Stephen Colbert.\nThe episode scandalously showed Trump in bed with Satan and later featured a deepfake of the president stripping down and bearing his 'teeny-tiny' penis.\nSouth Park creators Matt Stone and Trey Parker ultimately agreed to edit the scene, which showed an AI-generated depiction of a sweaty and nude Trump in the desert.\nOn Thursday, the creators revealed how they battled with the network over the decision to show Trump's penis in the scene.\nComedy Central owner Paramount Global's three co-CEOs all the watched the show's no-holds-barred season 27 premiere, which featured Trump in bed with Satan\nOn Thursday, the creators revealed how they battled with the network over the decision to show Trump's penis in the scene\n'Trump: His penis is teeny-tiny, but his love for us is large,' flashes a line on screen.\nParker explained how executives reacted.\n'They’re like, \"OK, but we’re gonna blur the penis,\"' Parker recalled.\n'I’m like, \"No, you’re not gonna blur the penis.\"'\nStone added, '[So] we put eyes on the penis.'\n'If we put eyes on the penis, we won’t blur it. And then that was a whole conversation for about four f**king days,' Parker explained.\n'It's a character.'\nThe White House issued a scathing statement in response.\nChris McCarthy, George Cheeks, and Brian Robbins were leaning toward airing it before running by their boss, Paramount heiress Shari Redstone\n'This show hasn’t been relevant for over 20 years and is hanging on by a thread with uninspired ideas in a desperate attempt for attention,' a portion read.\nThe episode saw the president threaten the town South Park with an endless array of lawsuits.\nThe threats were a clear reference to Trump's recent suits against ABC, The Wall Street Journal, and even Paramount, which some have criticized as baseless.\nParamount found itself on Parker and Stone's bad side earlier this year, after it blocked a $1 billion deal Stone and Parker previously had with Paramount and HBO Max that would have allowed both platforms to air their series.\nStone and Parker - known for standing up to networks and censors - said no, claiming Skydance boss David Ellison was trying to lower the market value of their show.\nThe creators then secured a $1.5-billion exclusive streaming deal with Paramount this week. The deal also confirms 50 new episodes that will air on Comedy Central and stream exclusively on Paramount Plus over five years.\nThe new season was originally slated to start July 9, but was delayed two weeks due to complications from the then ongoing merger."
    },
    {
      "url": "https://www.dailymail.co.uk/media/article-14919635/stephen-colbert-cancellation-reason-financial-ad-revenue.html",
      "text": "Embarrassing REAL reason Stephen Colbert's show was canceled after bosses hatched plot while star vacationed\nCBS canceled The Late Show with Stephen Colbert because it was losing $40 million a year, according to a new report.\nPuck journalist Matthew Belloni revealed Colbert's astonishing lack of profitability Friday, hours after CNN first broke the news that the show was canceled because it was in the red.\nBelloni outlined how The Late Show - whose cancelation was announced Thursday - costs $100m a year to produce, with Colbert, 61, getting paid between $15 million and $20 million a year to host.\nColbert beats ABC and NBC rivals Jimmy Kimmel and Jimmy Fallon in the ratings, but that still wasn't enough to save him.\nLate night shows have slumped in profitability in recent years as viewers shun the format in favor of streaming services or watching content on their phones.\nAdvertiser revenue has slumped sharply even in the last three years, Puck reported, making it harder to pull Colbert's show out of the red.\nColbert was reported to be 'not angry, actually' about his cancelation and was chatting with his staff in a 'matter-of-fact' way before Thursday's show, Puck reported.\nColbert, who will broadcast his final show in May 2026, was first informed his show was on the chopping block around July 4, it is claimed. Paramount Co-CEO George Cheeks made the decision, Puck reported.\nCBS pulled the plug on 'The Late Show with Stephen Colbert ' solely for financial reasons, insiders at the network have said. Pictured, the veteran host telling viewers his show will be off the air by this time next year on Thursday\nCBS execs weighed the pros and cons of canceling the increasingly unprofitable show during its hosts usual summer vacation this month, sources told CNN Friday. They said the move was financially driven even while speaking anonymously, as did insiders who spoke to Puck\nHe the went on vacation, giving bosses at CBS time to plot behind his back, CNN reported.\nColbert had news of his cancelation confirmed Thursday.\nHe moved to share it as quickly as possible so that his staff would not learn of their impending unemployment via leaks to the press.\nAll three major late night hosts - Colbert, Kimmel and Fallon - have become notorious for their regular rants about President Trump, which many viewers have complained are boring and off-putting.\nBut Belloni said he didn't believe the famously anti-MAGA Colbert was axed to appease Donald Trump, who recently won a $15 million payout from CBS after suing them over a 60 Minutes interview with Kamala Harris he said was deceptively edited.\nThe axing of Colbert has delighted Trump, who posted about it on his TruthSocial network earlier today.\nColbert's ouster could also make it easier for CBS parent company Paramount's efforts to merge with media company Skydance in a deal that must be approved by Trump's Federal Communications Commission.\nParamount Co-CEO George Cheeks made the decision to do away with the show after years of conversations about whether it was worth airing, sources told Puck and CNN\nThe news comes as David Ellison's (right) company, Skydance, comes closer to purchasing Paramount (Pictured: David with his multi-billionaire father and GOP backer Larry Ellison).The two had no involvement in the decision, according to those familiar\nEarlier this week, Colbert bashed his bossed for settling with Trump, branding the deal a 'big fat bribe.' He still rakes in an average of 2.417 million viewers a year\nColbert's axing came just days after he sniped at CBS bosses for settling with Trump, branding the deal a 'big fat bribe.'\nThe Late Show launched in 1993 under David Letterman to compete with longtime late night juggernaut The Tonight Show.\nColbert took over from Letterman in 2015 after his retirement.\nMore than three decades later, CBS's entry into the late night sphere sits at the top, with second-best Jimmy Kimmel Live! raking in an average of 1.772 million viewers.\nColbert, by comparison, collects an average of 2.417 million.\nColbert - who once played a conservative character on Comedy Central's satirical late night program The Colbert Report - often aired jokes at the conservative's expense.\nTrump celebrated the news of the show's cancellation as a result.\n'I absolutely love that Colbert' got fired. His talent was even less than his ratings,' he wrote in a Friday Truth Social post.\n'I hear Jimmy Kimmel is next. Has even less talent than Colbert,' he added, before talking up right-wing Fox New star Greg Gutfeld.\n'[He's] better than all of them combined, including the Moron on NBC who ruined the once great Tonight Show,' Trump added, referring to Jimmy Fallon.\nTrump previously worked for NBC during his days on 'The Apprentice.'"
    },
    {
      "url": "https://www.dailymail.co.uk/media/article-14932683/jon-stewart-la-times-owner-patrick-soon-shiong-interview.html",
      "text": "Daily Show host Jon Stewart has been branded a hypocrite for failing to press the billionaire owner of the Los Angeles Times moments after ripping mainstream media for bending the knee to Donald Trump.\nStewart's sit-down with Patrick Soon-Shiong came after a monologue in which the host slammed media companies who water down their content to avoid backlash from the Trump administration.\nBefore the interview, Stewart took repeated shots at CBS parent company Paramount Global, accusing executives there of operating out of fear in regard to late-night host Stephen Colbert's firing.\nOutraged Times staffers told Status that Stewart's softball interview completely ignored Soon-Shiong's track record at the paper, including a reported request from the billionaire that the paper's editorial board 'take a break' from criticizing Trump.\nThe Times has seen several rounds of layoffs and other alleged attempts by Soon-Shiong to curry favor with the president.\nNone of those issues were raised by Stewart, angering Times staff already frustrated by what they see as pandering from an owner who pulled the paper's planned endorsement of Kamala Harris.\n'Everyone is pissed,' one staffer told Status. 'The consensus is that Jon Stewart's interview was awful. It seemed like he hadn't read up on the guy.'\nAnother called Stewart's approach 'totally bizarre,' given his reputation for needling guests.\nJon Stewart's sit-down with billionaire Los Angeles Times owner Patrick Soon-Shiong came after a monologue in which the host slammed media companies who water down their content to avoid backlash from the Trump administration\nSoon-Shiong, the owner of the Times since 2018, is one of several media magnates who have been accused of bending the knee to Donald Trump\n'No questions about [Soon-Shiong] destroying LAT's reputation? Nothing about his sucking up to Trump/RFK?' the insider said.\n'Especially coming right after Stewart ripped Paramount, just baffling.'\nStewart didn't broach the subject of Soon-Shiong's false claim that his paper does not cover his pharmaceutical business, Status pointed out, noting that an undisclosed advertisement for his business was featured on one of the Times' audio shows in March.\nStatus reported on speculation that Soon-Shiong - the inventor of a popular cancer drug - is looking for a clear path for future approval of more drugs.\nDuring the conversation, Soon-Shiong also announced plans to take the Times public - a revelation that one angry staffer told Breaker Media served as an example 'of the fly-by-night nature of how this paper is being run.'\n'This is indicative of everything with him,' another reporter told Politico.\n'He doesn't talk to us. He doesn't have newsroom meetings. We only get a sense of what he's feeling via Twitter rant or when he randomly decides to save some pocket change and fire 12 people.'\nImmediately after the presidential election, a longtime Times columnist claimed that a piece for the editorial page's opinion section that was critical of Trump had been spiked by Soon-Shiong.\nSoon-Shiong was one of about a dozen wealthy executives, including Open AI's Sam Altman and former First Buddy Elon Musk, who has lunch with Trump in Riyadh in May\nSoon-Shiong acquired the Times in 2018, as part of a $500million deal. The past three years have been plagued by layoffs, the most recent of which saw at least 115 staffers in the newsroom let go in January\n'The consensus is that Jon Stewart's interview was awful,' one Times staffer said. 'It seemed like he hadn't read up on the guy'\nThe columnist and several others quit in protest.\nOthers accused Soon-Shiong of pulling the Harris endorsement because he 'wanted to hedge his bets' in case Trump won.\nIn February, Status reported on pushback against Soon-Shiong following an appearance on Dr. Drew Pinsky's YouTube show, in which he offered repeated praise for Trump and was briefly challenged by the host over his paper's coverage of him.\nOther moves that have been met with pushback include Soon-Shiong hosting Robert F. Kennedy Jr.'s wife, Cheryl Hines, to the paper's offices in February, for talks about a proposed right-leaning version of The View featuring far-right personalities like Candace Owens and Rob Schneider.\nThat same month, Soon-Shiong brought conservative CNN commentator Scott Jennings onto his paper's editorial board.\nSoon-Shiong acquired the Times in 2018, as part of a $500million deal. The past three years have been plagued by layoffs, the most recent of which saw at least 115 staffers in the newsroom let go in January.\nThe Daily Mail has reached out to Stewart's people for comment concerning his oversights."
    },
    {
      "url": "https://www.status.news/p/david-ellison-paramount-trump-side-deal-60-minutes",
      "text": "Paramount executives Jeff Shell, Gerry Cardinale, David Ellison, George Cheeks, and Andy Gordon. (Courtesy of Paramount)\nOn Thursday afternoon, just hours after Skydance’s deal to officially take over Paramount closed, David Ellison strode onto a stage at the company’s global headquarters in Times Square for his first press conference as the new boss. Flanked by senior lieutenants Jeff Shell, Gerry Cardinale, and Andy Gordon, Ellison fielded questions from a room full of reporters.\nNaturally, the assembled group of journalists didn’t ignore the elephant in the room, and the first was about Donald Trump. Specifically, whether Ellison, the Silicon Valley tech scion, had cut a secret side deal to air upwards of $20 million worth of public service announcements for causes Trump supports. Ellison responded by distancing himself from Paramount’s widely-criticized $16 million settlement over a “60 Minutes” segment, noting it had been handled by a mediator under previous leadership. The company has complied with all laws, including anti-bribery statutes, he added.\nOf course, that non-answer didn’t satisfy the press corps. A reporter flatly followed up by asking: “Do you have a deal with Donald Trump to give him free...advertising air time? Is that true?\" It was a yes or no type question, but Ellison did not answer it in such a manner. The Oracle heir instead insisted he wouldn’t “politicize” anything, saying he wanted Paramount to appeal to “everyone,” and that he’d already been “clear” on the matter—though he obviously hadn’t.\nStill, he deserves credit for facing unscreened questions for roughly 45 minutes. But on Trump and politics, his answers danced around specifics. When I had the chance to ask a question, I first pressed Ellison and his team to go on the record…\nThe remainder of this newsletter is for paid subscribers only.\nScoop-driven reporting and sharp-edged analysis. See why thousands of industry professionals rely on Status.\nAlready a subscriber? Sign in.\nA subscription gets you full access to our nightly newsletter, which includes:\n✅ Essential reporting on and analysis of the Fourth Estate, Silicon Valley, Hollywood, the Information Wars, and more.\n✅ Hand-curated links to the most consequential stories moving the needle in the key corridors of the industry.\n✅ Unlimited access to our online archive where you can read previous editions of the newsletter."
    },
    {
      "url": "https://www.status.news/p/skydance-colbert-stewart-ellison",
      "text": "Jon Stewart hosts \"The Daily Show.\" (Screen grab via Comedy Central)\nJon Stewart opened Monday’s episode of \"The Daily Show\" not mincing words, calling Paramount’s settlement with Donald Trump “shameful.” Just as he was digging in, a fake Arby’s ad suddenly appeared on screen, as if to cut him off mid-rant for criticizing Comedy Central's parent company. “Did they? Son of a bitch!” Stewart exclaimed, playing along with the bit—yet nodding to a deeper fear that his commentary might soon be silenced amid all the corporate upheaval.\nLater in the episode, Stewart continued to needle Paramount, sitting down with former \"60 Minutes\" correspondent Steve Kroft for a candid and unsparing conversation. Kroft described the settlement in clear terms: “It was a shakedown.” Inside “The Daily Show,” I’m told staffers have taken pride that Stewart showed once again he is willing to stand up to powerful interests, even if it potentially risks his future employment. And while they may not yet know it, inside certain power circles, there is an open question: How much longer will Stewart have this platform?\nIndeed, the reality is that the ground under not only Stewart, but also Stephen Colbert, is shifting fast. Skydance, led by Larry and David Ellison, now believes its merger with Paramount will close in the next several weeks, I'm told. Much of the attention has focused on how the Ellisons will reshape \"60 Minutes\" and CBS News. We first reported that David Ellison met with Bari Weiss about a possible role at CBS News, and it is clear the Ellisons want to rid the network of what they see as a liberal taint. But little has been said about the futures of Colbert and Stewart…\nThe remainder of this newsletter is for paid subscribers only.\nScoop-driven reporting and sharp-edged analysis. See why The Wall Street Journal declared Status a “must-read.”.\nAlready a subscriber? Sign in.\nA subscription gets you full access to our nightly newsletter, which includes:\n✅ Essential reporting on and analysis of the Fourth Estate, Silicon Valley, Hollywood, the Information Wars, and more.\n✅ Hand-curated links to the most consequential stories moving the needle in the key corridors of the industry.\n✅ Unlimited access to our online archive where you can read previous editions of the newsletter.\n🚨 Big news: We’re launching a podcast.\nIt’s called Power Lines, and we’re thrilled to partner with In The Arena Studios, the new production outlet from audio veteran Chris Corcoran, to bring it to life. Variety’s Brian Steinberg has the full story here.\nHosted by me and Executive Editor Jon Passantino, Power Lines will focus on how the information economy is shaped—by the Fourth Estate, by Silicon Valley, by Hollywood, and by the powerful players spending time in Sun Valley this week.\nNew episodes drop every Friday morning, starting this week. You can check out the trailer here."
    },
    {
      "url": "https://www.dailymail.co.uk/media/article-14947433/jimmy-fallon-seth-meyers-late-night-ratings-cancelled-next.html",
      "text": "The next TWO late-night hosts who face ax after Stephen Colbert cancellation: Insiders reveal fear and loathing behind scenes\nTwo late-night mainstays could find themselves on the chopping block after helping NBC lose an eye-watering $100 million-plus per year.\nThe shows of longtime hosts Jimmy Fallon and Seth Meyers, combined with the network's iconic sketch comedy series SNL, have created the nine-figure shortfall, it was reported this week.\nNBC officially declined to comment on the reported losses. But an insider told the Daily Mail that the three shows are actually losing closer to half that amount when taking into account revenue generated through sources like streaming and digital - though conceded they're still in the red.\nThe news come days after CBS announced the cancellation of The Late Show with Stephen Colbert, amid reports his program was losing $40 million per year.\nMany, including Colbert - a longtime critic of President Donald Trump - cited political motivations in the decision to pull the plug.\nBut as the speculation swirls over CBS's decision, industry experts told the Daily Mail that NBC's silence on its own hosts' futures speaks volumes.\n'They're letting the narrative take hold that Colbert was canceled purely for political reasons - and that works in their favor. It distracts from the financial bloodbath happening across the late-night industry,' said Rob Shuter, a veteran media columnist and author of Naughty But Nice.\n'NBC isn't denying the $100 million [loss] because if everyone's talking about politics, they're not talking about whether these shows are even sustainable anymore.'\nNBC late-night mainstays Jimmy Fallon and Seth Meyers could find themselves on the chopping block after helping the network lose an eye-watering $100 million-plus per year\nThe longtime hosts' shows, along with iconic NBC sketch comedy series SNL, have created the massive shortfall\nRobert Thompson, founding director of the Bleier Center for Television and Popular Culture at Syracuse University, agreed.\n'NBC would want people to think that CBS canceled Colbert for political reasons, not viewership,' he said.\nAfter news of Colbert's cancellation emerged, the host called himself a 'martyr' and told Trump to 'Go f**k yourself' as the president gloated publicly over the decision.\nColbert had previously ripped the decision by CBS' parent company, Paramount Global, to pay Trump $16 million to settle a lawsuit he filed over a 60 Minutes interview with Kamala Harris.\nThe settlement was seen by many as a necessary move by the company to earn the Trump administration's approval of its $8 million merger with Skydance. Colbert more bluntly called it 'a big, fat bribe.'\nColbert's Late Show has drawn hundreds of thousands more viewers than his closest late-night competitor, ABC's Jimmy Kimmel, whose show has remained profitable when non-traditional TV advertising revenue is taken into account, a source told CNBC.\nAnd while Kimmel and Meyers have been more aggressive in taking on Trump, Fallon has avoided the pile-on.\n'If you're really making these deals Paramount are making, Colbert, Kimmel, and Meyers come off as a one-trick pony,' Thompson said.\nCBS announced the cancellation of The Late Show with Stephen Colbert , amid reports the program could be losing anywhere from $40 million to $100 million a year\nThe cancelation came shortly after Colbert criticized CBS parent company Paramount Global for paying $16 million to settle a lawsuit Trump filed over a 60 Minutes interview with Kamala Harris\nABC late-night host Jimmy Kimmel 's show remains profitable when non-traditional TV advertising revenue is taken into account\n'Fallon was the only one who didn't completely alter their brand to make fun of the president.'\nShuter said Fallon's style could ultimately end up saving his skin - but not forever.\n'Fallon didn't pivot hard into anti-Trump satire, and that may have bought him time. But let's be clear - this isn't about politics anymore. It's about money,' he said.\n'The moment a format stops printing cash, the ideology behind it becomes a footnote.'"
    },
    {
      "url": "https://www.dailymail.co.uk/media/article-14928799/jon-stewart-tribute-stephen-colbert-fired-show.html",
      "text": "Jon Stewart has spoken out on CBS’s cancellation of Stephen Colbert’s late-night show for the first time on-air, after Colbert on Thursday shared his program would not return beyond May 2026.\n'We were two pretty good-sized fish in a reasonably small basic cable pond. Both of our shows reached an inflection point in 2015,' Stewart said Monday of the pair's shared success during their days on Comedy Central.\n'Stephen chose to challenge himself by seeing if he could succeed the legendary David Letterman in, quite frankly, a much bigger pond than the one he and I had been swimming in,' Stewart said. 'And I quit. And I quit.\n'Stephen challenged himself. I passed away. Stephen challenged his abilities and the biggest field you could. And I literally went to a farm upstate.'\nThe spiel came during a highly reflective segment on Stewart's Daily Show, which originally aired alongside Colbert's since-cancelled 'Colbert Report' in the 2000s.\nStewart said Colbert went on to 'exceed all expectations' upon leaving Comedy Central for late-night, before acknowledging the fading format as a whole.\n'Now, I acknowledge, losing money, late-night TV is a struggling financial model,' he said. 'We are all basically operating a Blockbuster kiosk inside of a Tower Records.'\n'But when your industry is faced with changes, you don’t just call it a day,' Stewart then joked. 'When CDs stopped selling, they didn’t just go, \"Oh, well, music, it’s been a good run!\".'\nJon Stewart addressed CBS’s cancellation of Stephen Colbert’s late-night show for the first time on-air Monday, after Colbert on Thursday shared his program would not return beyond May 2026\n'We were two pretty good-sized fish in a reasonably small basic cable pond. Both of our shows reached an inflection point in 2015,' Stewart said during a reflective segment on the Daily Show, referring to his and Colbert's day on Comedy Central before the latter took on late night\nAs to whether his show could soon follow Colbert's into cancellation, Stewart said, \"I’m not going anywhere - I think.'\nEarlier, Stewart addressed the elephant in the room - controversy surrounding Colbert's employer, CBS, amid claims its decision to cancel Colbert's show was rooted in politics.\nStewart made clear he does not buy CBS's claim Colbert was canceled for ‘purely financial reasons,’ and instead subscribes to the theory the network reached a $16 million settlement in a suit filed by the president earlier this month as means to secure FCC approval for a still pending merger with Skydance Media.\nHe addressed executives at Paramount - CBS's parent company - directly, accusing them of capitulating to Trump to secure the sale.\nHe said: 'I believe CBS lost the benefit of the doubt two weeks prior, when they sold out their flagship news program to pay an extortion fee to said president.'\n'At that time, poor Andy Rooney must have been rolling over in his bed,' he joked of the late legendary news writer. 'That's right. He is alive. Andy Rooney is alive.'\n'I understand the corporate fear. I understand the fear that you and your advertisers have with $8 billion at stake. But understand this,' Stewart added.\n'Truly, the shows that you now seek to cancel, censor, and control? A not-insignificant portion of that $8 billion value came from those f**king shows,' he added.\nStewart's Daily Show, which originally aired alongside Colbert's since-cancelled 'Colbert Report' in the 2000s. Stewart said Colbert went on to 'exceed all expectations' upon leaving Comedy Central for late-night, before acknowledging the fading format as a whole\n'That’s what made you that money. Shows that say something. Shows that take a stand.'\nHe further asserted CBS and Paramount would be fools to cut Colbert loose, regardless of how much Trump may be pulling their proverbial strings.\nHe told worried executives, 'If you believe you can make yourselves so innocuous, that you can serve a gruel so flavorless, that you will never again be on the boy king’s radar... Why will anyone watch you?”\n'And you are f**king wrong,' he said of CBS reaching a settlement in the suit that had accused Paramount, CBS, and its flagship show 60 Minutes of deceptively editing an interview with Kamala Harris weeks before the election.\n'Do you want to know how impossible it is to stay on Lord Farquaad’s good side?' Stewart joked.\nHe then pointed to Trump’s $10illion lawsuit against Rupert Murdoch, owner of Fox News, following a Wall Street Journal report that linked Trump to Jeffrey Epstein as proof of how quickly the conservative's alliances can grow cold.\n'Fox spends 24 hours a day blowing Trump, and it’s not enough,' he said.\nColbert, 61, is one the most prominent of critics of the conservative and called himself a 'martyr' on Monday after the president gloated over The Late Show’s cancellation in a pointed post to Truth Social over the weekend.\nAfter reflecting on their glory days, Stewart addressed the elephant in the room - controversy surrounding Colbert's employer, CBS. Colbert recently took a swipe at his bosses on-air - for accepting what he presented as a 'big fat bribe' from the president by reaching a settlement\nThe parties reached the $16 million settlement in a suit surrunding an Octobert 60 Minutes interview with Kamala Harris earlier this month. That is only slightly more than the $15 million Colbert is said to earn annually for his show\nThe suit had accused Paramount, CBS, and its flagship show 60 Minutes of deceptively editing an interview with Harris weeks before the election . The decision to make a deal was widely seen as necessary to receiving FCC approval\nThe comedian revealed last week his decade-long run as the host of CBS' late night flagship will end next May.\n'Insiders' immediately maintained to publications like Puck and Variety the top-rated show was canceled due to being a money pit what was losing $40million a year.\nDays before being canned, he took a swipe at his Paramount bosses on-air - fueling speculation the show's cancellation was not due to finances.\nStill, the $16million sum secured in the settlement is only slightly more than the $15 million Colbert is said to earn annually for his show."
    },
    {
      "url": "https://www.dailymail.co.uk/news/cnn/index.html",
      "text": "Advertisement\nCNN: Latest news, breaking stories and comment\nPage\nJon Stewart's show could be coming to an end\n08/08/25 14:49\nThe insight stems from an encounter between Status's Oliver Darcy and Paramount Skydance Co-CEO George Cheeks that occurred Thursday at the company's first press conference....read\nRep. Jasmine Crockett accused of screaming at staff\n07/08/25 20:36Rising Democratic star Jasmine Crockett has been accused of screaming at staff, making some cry, opting to work from home rather than in Congress and being 'rude.'Trump-hating Jasmine Crockett 'a work-shy nightmare who screams at staff and dreams of going viral': 'All diva'\n07/08/25 20:21Rising Democratic star Jasmine Crockett has been accused of screaming at staff, making some cry, opting to work from home rather than in Congress and being 'rude.'Chilling new clue interstellar object is of intelligent design... as scientists warn 'it could save or destroy us'\n07/08/25 18:08A new clue that the interstellar object is not natural has emerged in images taken by a NASA telescope.JD Vance denies CNN report of Jeffrey Epstein-related meeting\n07/08/25 10:15Vice President JD Vance denied Wednesday that he would host a meeting to discuss the administration's response to the Jeffrey Epstein files, ridiculing a CNN report.JD Vance ridicules CNN 'fake news' on secret Jeffrey Epstein strategy meeting and says they need 'better sources'\n06/08/25 22:35Vice President JD Vance denied Wednesday that he would host a meeting to discuss the administration's response to the Jeffrey Epstein files, ridiculing a CNN report.Report: Vance to host Epstein files meeting\n06/08/25 16:39Vice President JD Vance will host a meeting Wednesday evening with administration officials to explore the way forward on the Jeffrey Epstein files.Inside Trump's inner circle's top secret Epstein crisis talks as his henchmen struggle to contain negative press\n06/08/25 16:10Vice President JD Vance will host a meeting Wednesday evening with administration officials to explore the way forward on the Jeffrey Epstein files.Progressive writer slammed for Sydney Sweeney comments\n06/08/25 14:47Rachel Bitecofer was met with anger and opprobrium after targeting Euphoria actress Sweeney's looks.Diddy's lawyers approach Trump admin seeking a presidential pardon\n06/08/25 14:44The disgraced music mogul's lawyer Nicole Westmoreland revealed on Tuesday that discussions were underway about a potential pardon.Diddy's lawyers in talks with Trump over potential pardon as disgraced mogul awaits sentencing in prison\n05/08/25 22:09The disgraced music mogul's lawyer Nicole Westmoreland revealed on Tuesday that discussions were underway about a potential pardon.Justice Department debates release of Ghislaine Maxwell interview\n05/08/25 16:41Attorney General Pam Bondi is weighing whether to release an audio recording of the interviews her deputy conducted with Ghislaine Maxwell last month.CNN expert praises president Trump's use of tariffs\n05/08/25 11:20Enten - who often breaks down polling issues for the left-leaning network - said that Trump is 'remaking' America in a way George W. Bush, Barack Obama and Joe Biden didn't.The View's co-host slams Kamala Harris, citing out-of-touch interview\n05/08/25 10:15The former Trump administration official who crossed party lines to vote for Harris in 2024, didn't hold back as she dismantled the Vice President's comeback strategy.Former CNN star slammed for 'interviewing' AI Parkland shooting victim\n05/08/25 10:00Acosta was pushed out at CNN, only to see the liberal anti-Trumper make more money with a presence on Substack where he published the derided interview.Former CNN star Jim Acosta called 'psychotic freak' for 'interviewing' deceased Parkland shooting victim\n05/08/25 05:48Acosta was pushed out at CNN, only to see the liberal anti-Trumper make more money with a presence on Substack where he published the derided interview.The View co-host blasts Kamala Harris as 'microcosm of everything that's wrong' with Democratic Party\n05/08/25 01:00The former Trump administration official who crossed party lines to vote for Harris in 2024, didn't hold back as she dismantled the Vice President's comeback strategy.CNN expert pays Trump the ultimate compliment while discussing tariffs\n04/08/25 23:32Enten - who often breaks down polling issues for the left-leaning network - said that Trump is 'remaking' America in a way George W. Bush, Barack Obama and Joe Biden didn't.Trump slammed by Republicans after firing Labor Statistics chief\n04/08/25 18:41Donald Trump's Republican allies and foes say the president was wrong to fire Labor Statistics commissioner over a lackluster July jobs report.Trump knifed by fellow Republicans over recent firing as he plans revenge on 'rigged' jobs data\n04/08/25 16:41Donald Trump's Republican allies and foes say the president was wrong to fire Labor Statistics commissioner over a lackluster July jobs report.Conditions Bryan Kohberger faces in prison\n04/08/25 16:24The quadruple killer, 30, was moved to long-term isolation in a notoriously restrictive block of the Idaho prison where he will spend the rest of his life.Grim photo shows nightmarish conditions Bryan Kohberger faces after being moved to notorious J-Block alongside death row killers\n04/08/25 16:00The quadruple killer, 30, was moved to long-term isolation in a notoriously restrictive block of the Idaho prison where he will spend the rest of his life.Marco Rubio seen as dark horse rival to JD Vance as Trump's natural heir\n04/08/25 13:53JD Vance is facing a 'surprising' rival in the early race for the 2028 Republican presidential nomination.Another Trump insider gains momentum, overtaking JD Vance for 2028 bid\n04/08/25 09:45While Vance has been positioned as President Donald Trump 's understudy, there is a groundswell of support for another Republican figure among party activists and voters.'Surprising' rival to JD Vance as next presidential candidate emerges with Republicans preparing for 2028\n04/08/25 03:15While Vance has been positioned as President Donald Trump 's understudy, there is a groundswell of support for another Republican figure among party activists and voters.Dem Gov Jared Polis's VERY awkward reaction when questioned about Kamala running in 2028\n03/08/25 17:44As Kamala Harris reemerges into the political spotlight, other members of her party are signaling that she shouldn't be treated as their presumptive 2028 presidential nominee.Report: Biden aide would have made $4M if Trump lost\n01/08/25 20:29Former top Biden political aide Mike Donilon told lawmakers that he was paid $4 million to reelect the former Democratic president and would have received an additional $4 million bonus if Biden won.Giuffre's family say her final wish of releasing Epstein's FBI files\n01/08/25 10:20Jeffrey Epstein victim Virginia Giuffre 's family broke down in tears in an interview with CNN's Kaitlan Collins on Thursday night.Family of Virginia Giuffre break down in tears and reveal Epstein victim wanted his FBI files released\n01/08/25 03:19Jeffrey Epstein victim Virginia Giuffre 's family broke down in tears in an interview with CNN's Kaitlan Collins on Thursday night.Trump brings back Presidential Fitness Test Obama killed\n31/07/25 18:55President Donald Trump will announce his plan to reestablish the Presidential Fitness Test for American children to promote young people to stay active and strong.Pelosi clashes with CNN's Jake Tapper over 'insider trading' claims\n31/07/25 18:46One late-night TV host wasn't afraid to put a top Democrat on the spot during an appearance on his Wednesday night TV program.Trump brings back Presidential Fitness Test in public schools that Obama killed with event featuring top sports stars\n31/07/25 18:36President Donald Trump will announce his plan to reestablish the Presidential Fitness Test for American children to promote young people to stay active and strong.Trump rips into Fox News host after NYC shooting comments\n30/07/25 15:17President Donald Trump insulted Fox News host Jessica Tarlov on Wednesday after she reacted to the Midtown Manhattan shooting and called for more gun control.Trump rips into 'real loser' Fox News host after NYC shooting comments\n30/07/25 14:48President Donald Trump insulted Fox News host Jessica Tarlov on Wednesday after she reacted to the Midtown Manhattan shooting and called for more gun control.LAPD officer's son identified as Manhattan shooter\n30/07/25 10:30Shane Tamura, who killed four people in Manhattan last night, was the son of an LAPD officer and held a private investigator license that didn't allow him to carry a weapon on the job.NYC shooter Shane Tamura's eerie note to parents revealed\n30/07/25 10:15NYC shooter Shane Tamura left his parents an eerie note before he drove from his Las Vegas apartment to the Big Apple in a rampage against the National Football League.Eerie note NYC shooter Shane Tamura left for his parents before driving to Big Apple to murder four\n29/07/25 22:34NYC shooter Shane Tamura left his parents an eerie note before he drove from his Las Vegas apartment to the Big Apple in a rampage against the National Football League.Piers Morgan mocks Stephen Colbert after show is axed\n29/07/25 21:57Morgan took aim at Colbert during an appearance on Fox News on Tuesday, saying the now-cancelled The Late Show was boring.Piers Morgan asks why Steven Colbert needed 200 staff for show filled with same old Trump bashing every night\n29/07/25 21:06Morgan took aim at Colbert during an appearance on Fox News on Tuesday, saying the now-cancelled The Late Show was boring.Manhattan shooter Shane Tamura was the son of an LAPD cop and held jobs as a security guard and private investigator despite his mental health struggles\n29/07/25 20:35Shane Tamura, who killed four people in Manhattan last night, was the son of an LAPD officer and held a private investigator license that didn't allow him to carry a weapon on the job.What is CTE? Doctors explain brain disorder New York shooter Shane Tamura claimed to have\n29/07/25 18:44The suspected New York City shooter Shane Tamura believed he was suffering from CTE, a degenerative brain injury that can manifest as aggression and violence, doctors told DailyMail.com.Myleene Klass recalls the horrifying moment Harvey Weinstein offered her a sex contract to make her famous and reveals her fear of being unable to escape his advances\n29/07/25 17:49Myleene Klass has recalled the horrifying moment Harvey Weinstein offered her a sex contract in a bid to make her famous.Who is Terry Long? The football player mentioned in NYC shooter Shane Tamura's final note\n29/07/25 13:12Shane Tamura died by suicide on Monday evening after opening fire on a NYC skyscraper and killing four people. In his suicide note, he mentioned former NFL player Terry Long.CNN anchor slammed for calling NYC shooter 'possibly white'\n29/07/25 12:18CNN anchor Erin Burnett is facing scrutiny after describing the gunman who killed four people in Midtown Manhattan overnight as 'possibly white' despite footage showing he was not.CNN anchor Erin Burnett blasted for describing NYC shooter as 'possibly white'\n29/07/25 11:32CNN anchor Erin Burnett is facing scrutiny after describing the gunman who killed four people in Midtown Manhattan overnight as 'possibly white' despite footage showing he was not.CNN fact-checks Trump's Beyoncé $11 million payment claim\n29/07/25 11:30A CNN fact check poured cold water on President Donald Trump's claim that Kamala Harris ' campaign paid megastar Beyoncé $11 million for an endorsement.Blackstone staff barricade themselves against gunman in New York\n29/07/25 11:10This is the moment terrified Blackstone staff desperately scrambled to build make-shift barricades as their Manhattan offices were attacked by a vicious gunman who killed four peopleManhattan shooter identified as Las Vegas man, Shane Tamura, 27\n29/07/25 10:00Shane Tamura, a 27-year-old private investigator from Las Vegas, has been identified as the gunman behind Monday's Midtown Manhattan shooting.Twisted revenge plot against NFL by deranged gunman uncovered\n29/07/25 09:45Shane Tamura, 27, who shot up a Midtown Manhattan skyscraper on Monday night may have sought to target the National Football League.Meryl Streep and Anne Hathaway film sequel just blocks from NYC massacre\n29/07/25 09:20Meryl Streep and Anne Hathaway filmed scenes for a new film just blocks away from a deadly shooting rampage at a Manhattan office building.Moment terrified Blackstone hedge fund staff desperately build make-shift barricades to stop NYC gunman breaking in as he killed four in Manhattan skyscraper massacre\n29/07/25 08:19This is the moment terrified Blackstone staff desperately scrambled to build make-shift barricades as their Manhattan offices were attacked by a vicious gunman who killed four peopleDeranged gunman's twisted revenge plot on the NFL revealed as four are killed in NYC shooting rampage\n29/07/25 06:17Shane Tamura, 27, who shot up a Midtown Manhattan skyscraper on Monday night may have sought to target the National Football League.Meryl Streep and Anne Hathaway film Devil Wears Prada sequel just blocks away from NYC mass shooting that killed four\n29/07/25 05:29Meryl Streep and Anne Hathaway filmed the Devil Wears Prada sequel in New York City on Monday, just blocks away from a mass shooting that killed four.Manhattan shooter identified as Shane Tamura, 27, of Las Vegas: What we know about the gunman\n29/07/25 01:22Shane Tamura, a 27-year-old private investigator from Las Vegas, has been identified as the gunman behind Monday's Midtown Manhattan shooting.CNN 'fact checks' Trump's hyperbolic claim that Beyoncé was paid $11 million for campaign endorsement\n28/07/25 21:45A CNN fact check poured cold water on President Donald Trump's claim that Kamala Harris ' campaign paid megastar Beyoncé $11 million for an endorsement.Elon Musk joins outrage over man and woman being beaten to a pulp after Cincinnati jazz festival\n28/07/25 15:38Elon Musk joined the outpouring of outrage after a man and woman were beaten to a pulp by an unruly mob after an Ohio jazz festival.WWE fans set for final glimpse into Hulk Hogan's life as Netflix revelation emerges after legend's death\n27/07/25 13:30The WWE icon died at the age of 71 on Thursday after suffering fatal cardiac arrest at his home in Clearwater, Florida. But wrestling fans may be gifted one last glimpse of Hogan.Look away, Kaitlan Collins! News anchors and political pundits ranked in the DailyMail+ Power List\n25/07/25 13:50Our Power List measures likeability, trustworthiness, bias and knowledge. It reveals who Americans really trust to deliver the news... and who they loathe.Texas sheriff's admission about response to floods\n24/07/25 17:04A Kerr County sheriff has made a shocking admission about who is to blame for the lives lost in the deadly flooding that ripped through Texas earlier this month.Texas sheriff makes shocking admission about response to floods that killed 136 people\n24/07/25 15:51A Kerr County sheriff has made a shocking admission about who is to blame for the lives lost in the deadly flooding that ripped through Texas earlier this month.CNN guest's attempt at backflip goes disastrously wrong live on air\n24/07/25 14:11During a segment on Thursday morning, cameras cut to a Savannah Bananas baseball player as he attempted to pull off the stunt.Trump lashes out at CNN over newly uncovered Epstein photos\n23/07/25 14:39Donald Trump was enraged when CNN confronted him with newly unearthed decades-old images of him and his young kids with convicted [sexual] offender Jeffrey Epstein.Trump explodes at CNN as Jeffrey Epstein seen beside 12-year-old Ivanka and at president's wedding in never-before-seen photos\n23/07/25 13:37Donald Trump was enraged when CNN confronted him with newly unearthed decades-old images of him and his young kids with convicted sex offender Jeffrey Epstein.Eva Longoria, 50, goes bra-free in a nude tank top and micro shorts during a power walk in Spain\n22/07/25 18:37TV star Eva Longoria looked sensational in a nude crop top and micro shorts as she went out in Spain on Monday. She power walked and shopped.DOJ staffer fired after husband's Anti-ICE app is uncovered\n22/07/25 10:00The ICEBlock app sets out warning signals to users when ICE agents are within a five-mile radius of their location, allowing targets to flee.DOJ staffer is fired after feds discover she's married to radical behind anti-ICE app\n22/07/25 05:53Carolyn Feinstein said she was unfairly removed from her post in 'retribution' against her partner's work.Woke Squad member grilled by CNN about why she only became interested in Epstein files after Trump was re-elected\n21/07/25 16:29'If you see such a need to investigate this, why didn't you raise it during the Biden administration?' the anchor asked. 'We couldn't find that you made any public comments... in previous administrations.'Experts reveal how to tell if your designer bag is actually a counterfeit: 'This should alert you'\n21/07/25 13:27Over the past few years, it seems like fake designer bags are being produced at an all-time high - so how can you know what's real?CNN guest's interview interrupted by his son in hilarious moment\n21/07/25 10:50A CNN analyst was deep into a serious segment on the 'many legs' of the Jeffrey Epstein saga when his five-year-old son stole the spotlight with an on-camera cameo.Hilarious moment CNN media analyst Brian Stelter's five-year-old son gatecrashes dad's live TV interview\n21/07/25 04:04A CNN analyst was deep into a serious segment on the 'many legs' of the Jeffrey Epstein saga when his five-year-old son stole the spotlight with an on-camera cameo.'Is this CNN?!' Michael Smerconish goes viral as he rejects WSJ's Trump-Epstein letter\n20/07/25 21:48A CNN contributor is siding with President Donald Trump over the latest development in the Epstein saga.CNN panel ends in chaos after liberal guest makes shock claim about Trump\n20/07/25 02:11Touré stunned his co-panelists with the comment that prompted gasps and immediate demands for an on-air correction during a segment about the president's health.CNN panel devolves in chaos after liberal guest makes shock claim about Trump assassination attempt\n19/07/25 03:54Touré stunned his co-panelists with the comment that prompted gasps and immediate demands for an on-air correction during a segment about the president's health.CBS reportedly lost $40M on Colbert's Late Show a year\n18/07/25 20:35Colbert's surprise cancelation comes amid claims he got the boot for taking a noble stand against Donald Trump.Embarrassing REAL reason Stephen Colbert's show was canceled after bosses hatched plot while star vacationed\n18/07/25 19:58Colbert's surprise cancelation comes amid claims he got the boot for taking a noble stand against Donald Trump.Mount Rainier rocked by 800 earthquakes in 30 days\n18/07/25 18:28Scientists are holding their breath as hundreds of earthquakes rattle one of America's most dangerous volcanoes, which loom over more than three million people across multiple states.Earthquake swarm at Mount Rainier continues as more than 800 tremors rattle the catastrophic volcano\n18/07/25 17:29Scientists are holding their breath as hundreds of earthquakes rattle one of America's most dangerous volcanoes, which loom over more than three million people across multiple states.Dana Bash declines to read Trump's quote during network attack\n18/07/25 11:00CNN host Dana Bash was floored when she read a recent Truth Social post from Donald Trump that slammed the network.CNN host Dana Bash refuses to read Trump's insulting quote live on air as he launches fresh attack on network\n17/07/25 21:17CNN host Dana Bash was floored when she read a recent Truth Social post from Donald Trump that slammed the network.Trump secures $9 billion in spending cuts targeting NPR and PBS\n17/07/25 10:15Donald Trump scored another big victory in Congress , this time getting through $9.4 billion in spending cuts on the heels of his 'big, beautiful bill' success.\nPage\nDON'T MISS\n-\nAndi Oliver reveals her fury at Chris Moyles over vile comments he made about her daughter Miquita and compares him to a 'drunk racist'\n-\nEXCLUSIVE\nYou wouldn't see that on the catwalk! Kate Moss, 51, gets the giggles as she's surrounded by naked sunbathers on nudist beach - before nearly baring all herself\n-\nCoronation Street and Mrs Brown's Boys star Frank Grimes dead aged 78 following a short illness\n-\nEXCLUSIVE\nInside Nicola and Brooklyn's secret SECOND wedding that's ultimate snub to the Beckhams. Feud turns truly toxic after 'do-over' ceremony - as insiders tell of Victoria's fury with 'viper' Nicola\n-\nThe moment a 'feud' between Loose Women's Myleene Klass and Frankie Bridge spilled onto live TV as sources claim ITV have been forced to step in\n-\nFancy a party in paradise? Two tickets for Centreforce's Tenerife Weekender 2025 are up for grabs\nAd Feature\n-\nDenise Welch backtracks on infamous Taylor Swift interview days after sobbing to son Matty Healy\n-\nEXCLUSIVE\nThe vile porn videos that mean Taylor Swift could have 'wreaked havoc' on her ex Matty Healy: 'Everyone in the room was disgusted'\n-\nLila Moss, 22, looks incredible in a white bikini as she enjoys a swim with boyfriend Yoni Helbitz, 23, during trip to nudist beach with her mother Kate in Ibiza\n-\nSmart moves: The 10 must-know education brands helping the UK learn better and faster\nAd Feature\n-\nAmy Childs and Lauren Goodger put on leggy displays as they reunite with TOWIE co-stars at ITV launch\n-\nWayne Lineker's daughter Tia, 26, arrives in Mallorca ahead of her wedding to football manager partner Harry Agombar, 32\n-\nPrincess and Junior Andre reveal the lesson they've learned from their famous parents in first solo TV interview - after mum Katie Price slammed their new show\n-\nCarefree Frankie Bridge shows off her peachy bottom in a tiny green bikini as she larks around in the Maldives amid 'feud' with Myleene Klass\n-\nEXCLUSIVE\nThe Yorkshire Vet's Matt Jackson-Smith reveals how to care for your dog as they grow u, and his dog Harry's VERY unusual traits\nAd Feature\n-\nRomeo Beckham flexes his luxury lifestyle in a £1K Balenciaga jersey and Rolex watch as he steps into his pricey £100K Porsche with a pal on night out\n-\n80s music icon issues surprise health update after cancelling ALL upcoming tour dates\n-\nShirtless Cruz Beckham, 20, relaxes on dad David's £16M yacht before sharing a steamy smooch with girlfriend Jackie Apostel, 30, on loved-up holiday\n-\nKate Gosselin, 50, is unrecognizable in new video... 15 years after flaunting her bikini body during Jon & Kate Plus 8 era\n-\nThe stars of the much-loved Wittering Whitehalls podcast on how a hearing check has changed their relationship\nAd Feature\n-\nKenny Logan reveals his sex life struggles with wife Gabby (and what he keeps private) after he had his prostate removed following cancer battle\n-\nAnt McPartlin and leggy wife Anne-Marie Corbett enjoy a romantic lunch date as they celebrate their fourth wedding anniversary amid Portuguese getaway\n-\nWedding venue loved by Taylor Swift files for bankruptcy... with only $57 left and $63 MILLION due to creditors\n-\nEXCLUSIVE\nSheridan Smith says she would 'love' to return for Two Pints Of Lager And A Packet Of Crisps reboot as she joins co-star Will Mellor's calls to revive the iconic BBC comedy\n-\nEating for bump, and beyond! Pregnancy nutritionist reveals her top diet advice for those trying to conceive, pregnant, breastfeeding and baby nutrition\nAd Feature\n-\nJessie J reveals she needs to have more surgery after being rushed back to hospital following mastectomy and breast cancer battle\n-\nPrincess Andre and her brother Junior join glam stars at the launch of ITV's reality entertainment schedule - after mum Katie Price blasted their new show\n-\nHow Kelly Clarkson's TV shows could be impacted after her ex's shock death\n-\nEmma Thompson poses alongside daughter Gaia Wise at The Dead Of Winter photocall at the Locarno Film Festival in Switzerland\n-\nSip smarter this summer: Discover the 'Magic of Moderate Drinking' with these simple tips\nAd Feature\n-\nEXCLUSIVE\nKelly Clarkson hit by unimaginable double tragedy after ex-husband Brandon Blackstock's shock cancer death: Fears as star 'feels lost'\n-\nMacaulay Culkin finally clarifies Home Alone rumours that have left fans guessing for YEARS\n-\n90s pop icon looks unrecognisable 26 years on from hit record\n-\nNepo baby of music icon walks Fashion Week runway... after claiming nepotism 'doesn't help' her career\n-\nGet set for a totally WICKET summer: The Hundred is rolling into cities across the UK - this is how YOU and your family can join the fun\nAd Feature\n-\nEXCLUSIVE\nOlivia Bowen breaks down in tears as she shares fears of losing unborn baby in 'most real and raw' show tracking highs and lows of parenthood\n-\nAndy Cohen sparks feud with tennis star Martina Navratilova as he calls her comments on surrogacy 'dumb'\n-\nCara Delevingne drives home after celebrating her 33rd birthday sober after celebrating with fellow celebrity pals in Los Angeles\n-\nDanica Patrick sets pulses racing as she shows off stunning physique latest European vacation\n-\nFrom spending when you're abroad to absolutely smashing the preparation and packing, we reveal how to holiday like a pro\nAd Feature\n-\nWhat's got The Saturdays All Fired Up? Fans convinced Rochelle Humes and Frankie Bridge have fallen out after 'Wimbledon snub' and cryptic post\n-\nEXCLUSIVE\nTom Holland and fiancée Zendaya are spotted filming together for the first time on set of Spider-Man: Brand New Day in Surrey\n-\n'Surprisingly poor' John Cleese, 85, is set to buy a house in Bath with his fourth wife - after giving her his £1.5m Chelsea flat\n-\nRochelle Humes steps out with sister Sophie Piper after she raised eyebrows by posting Myleene Klass' ex Graham Quinn - as fans speculate she's fallen out with Frankie Bridge\n-\nFrom Icelandic waterfalls to Japanese tea ceremonies: The new cruise collection that promises adventure as well as ultra-luxury\nAd Feature\n-\nIconic Netflix actress looks unrecognisable as she shares throwback snap - but can YOU guess who it is?\n-\nAmanda Holden shows off her sizzling figure in a skimpy white bikini as she twins with lookalike glam daughter Lexi Hughes in Greece\n-\nBig Brother star Hardeep Singh Kohli 'groped woman's buttocks at BBC studios, indecently assaulted another at hotel and tried to put his tongue in third victim's mouth'\n-\nBig budget ITV game show AXED as gutted presenter admits 'I don't know what I did wrong'\n-\nAbbey Clancy looks sensational in a tiny cream bikini as she enjoys a yacht trip with shirtless husband Peter Crouch in the south of France\n-\nLove Island's Harry and Shakira reveal how things have REALLY been left with Helena in first TV interview - but swerve question about if they're exclusive\n-\nBBC Breakfast fans gasp 'my head hurts!' as show pulled off air after string of technical blunders so bad they 'thought their TVs were broken'\n-\nNetflix star goes on 180-hour journey to tiny Greek island to eat his favourite ice cream\n-\nMariah Carey reveals the unlikely requests she has for King Charles when she performs for him at Sandringham\n- After FOUR years of menopause struggles I took a chance on this supplement - now I'm sleeping better and finally feeling more like myself SHOPPING\n-\nKanye West's wife Bianca Censori covers up for stepmom duty as she takes rapper's kids out in LA\n-\nPrincess Beatrice appears in promo for UAE bank's new Mayfair branch - as explosive new claims about Prince Andrew's business dealings emerge\n-\nGina Carano rejoices over win for free speech as Disney forced to settle Mandalorian firing with groveling statement\n-\nFurious Sha'Carri Richardson pummels boyfriend in shocking security footage from arrest\n-\nScarlett Johansson is blasted by fans for her 'awful' English accent in new movie My Mother's Wedding\n- The 'liquid gold' facial tanner that fights ageing and has beauty fans obsessed: 'Best tanning drops EVER!' (now 20% off, but not for long) SHOPPING\n-\nPrincess Beatrice's original name was rejected by the late Queen for being too 'yuppie'\n- Kelly Clarkson's ex-husband Brandon Blackstock dead at 48 after cancer battle Sad news\n-\nPrincess Andre makes a solo red carpet appearance at beauty event after mum Katie Price condemned her upcoming documentary\n- Pet owners love this dog food subscription service for better fur, skin and health - and it costs just 89p a DAY (plus it's 40% off right now) SHOPPING\n-\nWhite Lotus actor calls out 'old movie stars' who get plastic surgery to play 'young roles'\n-\nCheffin' it up! Brooklyn Beckham gets back in the kitchen as he hosts Cloud 23 summer party - after renewing his vows with wife Nicola Peltz amid family feud\n-\nLauren Sanchez shows off extravagant £227k watch she was gifted as a wedding present by billionaire husband Jeff Bezos\n-\nEXCLUSIVE\nLove Island's Dejon Noel-Williams defiantly hits back at being branded a 'narcissist' - revealing he wanted to QUIT\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n-\nEXCLUSIVE\nThe man who discovered Elvis... and then destroyed him: How the King spiralled into addiction and death at the hands of his high-rolling manager\n-\nThe nepo-baby so well-connected she's King Charles's 'official DJ' and parties with Naomi Campbell - but you've probably never heard of her\n-\nUS actor Jeremy Piven drops C-bomb in trainwreck interview on Aussie radio\n-\nFrankie Bridge raises eyebrows with cryptic post saying 'you're dead to me' - so who IS she talking about?\n-\nAudiences are left shocked by Margot Robbie and Jacob Elordi's 'aggressively provocative' Wuthering Heights movie with 'BDSM sex scene'\n- MasterChef loses nearly 1MILLION viewers as new series airs after both presenters were sacked On the slide\n-\nFreddie Mercury fans turn their ire on author who revealed star's love child in bombshell book - but she's sticking to her guns\n-\nWhat's inside Keith Urban's bag? Nicole Kidman's husband reveals the one item he ALWAYS flies with as he touches down with $12,000 worth of luggage\n-\nThe Royal Family's connection to acting and Princess Beatrice's surprising Hollywood film debut alongside Emily Blunt\n-\nWill Carrie Bradshaw end up alone? And Just Like That... hints at iconic character's final storyline as 'woke' reboot is cancelled\n-\nOzzy Osbourne leans on wife Sharon in one of their last photos together as part of first glimpse at moving new documentary\n-\nInside Max Parker and Kris Mochrie's lavish wedding: Emmerdale stars who played brothers on hit soap tie the knot\n-\nStranger Things star gets engaged to longtime partner\n-\nPregnant Rihanna shows off her bump as she shops at pricey baby boutique in Beverly Hills\n-\nEXCLUSIVE\nMax Verstappen and girlfriend Kelly Piquet purchase plot of land at luxury development Pinheirinho Comporta in Portugal\n-\nThe surprising royal who became the first - and only - member of the Royal Family to complete the London Marathon\n-\nJennifer Lopez, 56, refused entry into Chanel store after security 'failed to recognise her'\n-\nBrooklyn Beckham is back in the kitchen as he whips up a carbonara in latest cooking video - after renewing his vows with wife Nicola Peltz amid family feud\n-\nEXCLUSIVE\nWhy Andrew is 'toast': The man who revealed 'highly sexed' Prince Andrew's multiple affairs tells all to Palace Confidential\n-\nMachine Gun Kelly reveals the parenting comment that left Megan Fox 'fuming'\n-\nDuchess Sophie's stunning floral dress sold out immediately - we've found high street versions that look equally stylish\n-\nJodie Kidd makes rare public appearance with her lookalike son Indio, 13, as they attend the Space NK London launch party\n-\nMeghan does not deserve to be called 'Duchess Difficult'. Shame on the royals - This week have shown how wrong they are: BRYONY GORDON\n-\nQueen Mary's daughter Princess Isabella is caught in an X-rated shirt at a wild Danish music festival - and royal watchers are fuming\n- Brandon Blackstock's daughter announced her pregnancy weeks before his death His death was confirmed on Thursday\n-\nDiddy's ex Cassie Ventura returns to social media for first time since giving birth... after her painful testimony against the rapper\n-\nJAN MOIR: Andrew is utterly irredeemable but Fergie is so much worse. Her late-night emails to me say it all\n-\nPink's daughter Willow, 14, is her TWIN as singer poses for rare photo with her children\n-\nEDEN CONFIDENTIAL: Will Harry consider what he might have achieved in tandem with his brother after Sentebale row?\n-\nDark secret every influencer knows... but will never admit: Insiders tell me shame of trick so many stars exploit: MOLLY CLAYTON\n- Inside Kelly Clarkson and Brandon Blackstock's love story that ended in tragedy Died at 48 following a cancer battle\n-\nJaime King ordered to court after ex-husband's divorce lawyers claim she failed to pay over $100K in fees\n- ITV pulls the plug on legendary presenter's big TV comeback by AXING show after just one series All over\n-\nYungblud strips down to a British flag kilt for killer impromptu performance at his London store launch party\n-\nPrince Andrew lost his virginity at the age of 11 and had scores of sexual experiences before he turned 13, royal biographer claims\n- How the Royal Albert Hall was saved by the rave: KATIE HIND The Grade I-listed stages more than 390 shows a year\n- Katie Holmes' mini-me Suri, 19, beams on NYC movie set... before heading back to college in Pennsylvania Getting involved\n-\nFreakier Friday review: Twice as many body swaps, but this ropy sequel's only half the fun, writes BRIAN VINER\n-\nZoe Ball admits she was reduced to tears after falling victim to a random street crime after appearance on The One Show\n- King Charles to commemorate the 80th anniversary of VJ Day with an address to the nation Special day\n- Liam Neeson fans savage reporter for asking him about 'cringe' topic during 'nonsense' interview Not happy\n- Jack Nicholson's grandson Sean arrested on felony domestic violence charge He's the eldest of the 88-year-old's grandchildren\n-\nWednesday star Percy Hynes White has very ordinary new job after sex assault allegations got him cancelled\n- Cheryl Burke raves about having 'great' sex with HERSELF... three years after Matthew Lawrence divorce Surprising\n-\nDo you REALLY, REALLY wanna body to match Spice Girl Mel C? Well, here are my top tips on how you can get it...\n-\nHeartbreaking last picture of Oasis fan before he plunged to his death at Wembley gig\nLandscape gardener Lee Claydon died at show\n-\nKatie Price condemns daughter Princess Andre's documentary in explosive new interview as she sets record straight\n-\nAmal Clooney, 47, cuts an elegant figure in a pink thigh-split dress as she and her dapper husband George, 64, head out for dinner\n-\nChris Hughes reveals the old-fashioned way he told JoJo Siwa how he really felt about her and recalls the moment when feelings changed\n-\nI'm A Celeb star is cruelly dad-shamed by online trolls for sharing picture of his four-year-old son drinking milk from a bottle\n-\nEXCLUSIVE\nREVEALED: The comments that confirm Rebekah Vardy won't fulfil her dream of moving to Beckham's precious Miami\n- Singer Caity Baser reveals she was sexually assaulted by a family friend when she was just eight years old Harrowing\n-\nDavid Beckham rocks tiny trunks with Victoria and son Cruz on yacht... while Brooklyn and wife Nicola Peltz are seen for first time since vow renewal amid 'feud'\n- The Walking Dead star Kelley Mack 'suddenly relapsed' after cancer treatment before death aged 33 Very sad\n-\nCHRISTOPHER STEVENS reviews The Fortune Hotel: 'A witless game show set in paradise, but as boring as hell'\n-\nEXCLUSIVE\nUnearthed photos show Brad Pitt's treasured memories of his late mum, who was cut off from her grandkids by Angelina\n- Jack Lowden's wedding photos finally appear, but it is not his wife Saoirse that's in them Unexpected\n- Jason Kelce opens up on music career... and the chances of a collaboration with Taylor Swift Big plans\n- Nepo baby lands gig working alongside his actor dad - can you guess his famous father? Following his footsteps\n-\nMacaulay Culkin regrets missing '90s comedy after not even reading the script during teenage retirement\n-\nMy sister disappeared on a cruise ship 27 years ago - what I think REALLY happened is the stuff of nightmares\n-\nMariah Carey accused of shading Katy Perry as she gives 'savage' response when asked about singer's space trip\n- New twist in Conor Maynard and Charlotte Chilton paternity row as explosive new allegation is 'revealed' Latest development\n- Richard Gere jets back to US as furious daughter of music icon curses him over sale of her childhood home Outraged\n- Jacob Elordi and Olivia Jade Giannulli SPLIT after four years together The couple have called time on their romance\n- Katy Perry reveals nasty injuries after THAT harrowing viral stage collapse Took to her Instagram on Wednesday\n-\nEXCLUSIVE\n'This is the Oasis effect': Woke TV comedian blames the Gallaghers after nobody turned up to watch her Edinburgh shows\n-\nKylie Jenner flashes cleavage and drinks wine with pals as it's been ONE MONTH since she's been seen with Timothee Chalamet\n-\nStacey Solomon shares adorable photos of her daughters, Rose, three, and Belle, two, as she gives an insight into their family holiday\n-\nDenise Richards accused of 'abandoning' sick dog by ex Aaron Phypers... days after she's seen with black eye\n-\nEXCLUSIVE\nKim Kardashian's ex-pal Larsa Pippen, 50, displays a puffier face as a surgeon weighs in on what she may have done\n-\nEastEnders confirms return of TWO Walford legends as devastating death sends shockwaves through Albert Square\n-\nAna de Armas exudes glamour as she takes part in a sake barrel ceremony amid claims her love affair with Tom Cruise is 'doomed'\n-\nChannel 4 bombarded with Ofcom complaints over 'disgusting' sex scenes in Bonnie Blue documentary about romp with 1000 men\n-\nEXCLUSIVE\nAnd Just Like That viral star spills show secrets... and why he thought SJP's BFF might have REPLACED him\n-\nDenise Welch leaves Loose Women open-mouthed with OUTRAGEOUS bedroom confession during sex debate\n- Scottie Scheffler revives Happy Gilmore 2 cameo role at FedEx Cup One of the biggest events on the PGA's calendar\n-\nSharon Osbourne reveals husband Ozzy's final words about his fans in interview that took place five days before his death\n-\nAll the signs that a huge noughties rock band are making a massive comeback after not releasing any music for three years\n-\nGregg Wallace and wife Anna stand united as they celebrate their nine year wedding anniversary amid the star's sexual misconduct probe\n-\nSafiyya Vorajee reflects on struggle to find someone worthy of her love following heartbreaking split from Ashley Cain\n- Mario Lopez SCREAMS at cheerleader suing him for defamation during fiery court appearance Furious\n- Sad details of country legend's funeral revealed after Dolly Parton dubbed star as her 'dearest friend' Tragic\n-\nClarkson's Farm breakout star Harriet Cowan makes emotional plea as she leads farming campaign after leaving the show\n-\nHulk Hogan's body still waiting to be cremated as daughter makes blistering intervention amid 'foul play' claims\n-\nKelly Clarkson fans all saying the same thing as her ex-husband's illness forces Vegas residency cancellation\n- Kate Ritchie makes surprise return to her Nova radio show after taking time off to focus on her mental health Welcome return\n- Revealed: Travis Kelce's incredible act for Chiefs teammates makes them think 2025 is his final season Is it all over?\n-\nHarry Potter star Michelle Gomez insists she 'supports trans rights without hesitation' and is 'taking accountability' after backlash over casting\n- Hulk Hogan's daughter Brooke 'promises' legal action against members of her late father's inner circle Not happy\n-\nDenise Richards' daughter Sami Sheen models VERY skimpy lingerie... after sharing she was 'almost sex trafficked'\n-\nLydia Bright discusses her nan's worsening dementia as she recalls heartbreaking moment she forgot who she was\n-\nModern Family child star makes surprising career move... see her now\n-\n'Skint' Josie Gibson resorts to 'moving back into a caravan' after This Morning star's home renovation leaves her 'sleepless and with stress through the roof'\n-\nLatin music trailblazer who won EIGHT Grammys dies at 88\n-\nMeet the nepo baby from an acting DYNASTY who is following in her family's footsteps\n-\nBikini-clad Abbey Clancy is every inch the style icon in £430 Gucci bucket hat as she enjoys holiday in the south of France with shirtless husband Peter Crouch\n-\nRomeo Beckham adds another fashion campaign to his portfolio with Champion shoot - after taking another swipe at Brooklyn\n- Myleene Klass hints at more revelations as she issues cryptic warning to those that 'have reason to' be afraid after her explosive claims her ex-husband cheated on her\n-\nBrooklyn Beckham and his wife Nicola Peltz are seen for the first time since renewing their vows as they enjoy a PDA-filled late night stroll in New York\n-\nCountry music star reveals devastating health scare that has put her shows in jeopardy\n-\nJohn Cena reveals cosmetic procedure he had done that 'completely changed the course' of his life\n-\nSarah Ferguson sends her critics a message with her footwear after bombshell book that Royals tried to ban accused both her and Andrew of cheating\n-\nSelena Gomez reveals she became best friends with Taylor Swift as they 'bonded' over Jonas Brothers break-up\n-\nSydney Sweeney's brother Trent mocks the backlash over his sister's American Eagle campaign after it was branded 'Nazi propaganda'\n-\nI made £550k flipping a crumbling property despite a string of warnings from experts - I'm laughing all the way to the bank even after going £100k over budget\n-\nEXCLUSIVE\nJoe Manganiello's girlfriend Caitlin O'Connor reveals she stays slim thanks to a diet based on 'blood work'\n-\n80s music icon cancels all upcoming tour dates over 'urgent' health issue\n-\nHeartbroken Kelsey Parker appears in first TV interview since death of her baby Phoenix - three years after losing her husband to cancer\n-\nPamela Anderson receives a kiss from new beau Liam Neeson before he feeds her popcorn as romance heats up\n-\nRebel Wilson faces lawsuit from the lead star of her own film over 'false' sex allegations\n-\nChristian Horner shares a swimsuit snap of wife Geri as he wishes her a happy birthday - amid her £1M debts, his Red Bull sacking and ongoing Spice Girls feud\n-\nBBC Breakfast star Charlie Stayt's behaviour is now also 'under review' as his co-host Naga Munchetty faces probe into 'bullying' claims\n-\nFrom Kim Kardashian's nasty sunburn and Kate Moss' VERY overpriced beach bag, the wardrobe gaffes that plague celebrity vacation-goers\n-\nArmie Hammer reveals he would smoke up to 20 joints a DAY, 'loved' drugging people and was banned from spending time with co-star Johnny Depp\n-\nJennifer Lopez, Jennifer Garner, Katie Holmes and Cameron Diaz all have look-alike sisters... see the comparisons\n-\nRichard Osman reveals how game shows STOP contestants from winning big money jackpots as broadcasters battle to balance the books\n-\nMaura Higgins, 34, poses for a mirror selfie in a red hospital gown before an MRI as her mystery injury is revealed\n-\nThylane Blondeau looks effortlessly chic in a sheer crochet maxi dress as she joins boyfriend Benjamin Attal on a dinner date in Saint-Tropez\n-\nZara McDermott and Louis Tomlinson's fans go wild as couple confirm they're in LOVE after taking their relationship to the next level with PDA post\n-\nKelly Clarkson reveals heartbreaking family news about ex-husband Brandon Blackstock as she's forced to CANCEL Las Vegas residency\n-\nSwimsuit-clad Vogue Williams looks more loved-up than ever with husband Spencer Matthews as she marks his birthday with a series of sweet snaps\n-\nLewis Hamilton and Leonardo DiCaprio-backed synthetic meat restaurant chain falls into liquidation"
    },
    {
      "url": "https://www.dailymail.co.uk/media/article-14872035/dan-cbs-news-60-minutes-settlement-paramount-trump.html",
      "text": "Journalism icon Dan Rather's blistering attack on CBS after network settled Trump lawsuit for $16m\nCBS News icon Dan Rather delivered a withering verdict on parent company Paramount's $16million settlement with Donald Trump over a contentious 60 Minutes interview, labeling the payout 'a sell-out to extortion by the president.'\n'It's a sad day for journalism,' the 93-year-old former CBS evening news anchor told Variety Wednesday while slamming Trump as a threat to the free press.\n'It's a sad day for 60 Minutes and CBS News... It was distortion by the president and a kneeling down and saying, \"yes, sir,\" by billionaire corporate owners.'\nRather argued that the settlement was not only unnecessary, but an example of censorship by Trump. He also warned of a greater threat to American democracy.\n'You settle a lawsuit when you've done something wrong,' Rather said. '60 Minutes did nothing wrong.'\nHe said that Trump strong-armed Paramount because Skydance's $8 billion acquisition of the company was at stake. The decision to make a deal was widely seen as necessary to receiving approval from the Trump administration.\n'Big billionaire business people make decisions about money,' he said.\n'We could always hope that they will make an exception when it comes to freedom of the press. But it wasn't to be.\nRetired CBS Evening News anchor Dan Rather - seen here during his return to the network last year after 18 yeas - has branded Paramount's settlement with Trump 'a sell-out to extortion by the president'\nRather argued the payout was not only unnecessary, but an example of censorship by the president and a threat to American democracy\n'Trump knew if he put the pressure on and threatened and just held that they would fold, because there's too much money on the table.'\nRather mentioned how most legal experts said the suit - which had demanded $20billion - was not a strong one.\nHe said 60 Minutes 'followed accepted journalistic practices. Lawyers almost unanimously said the case wouldn’t stand up in court.'\nRather - who was fired by CBS in 2006 after presenting unauthenticated documents in a news report on President George W. Bush's Vietnam War-era service in the National Guard - said he stood by his former colleagues still working at CBS News.\n'I do really think they fought a good fight on this, and they'll continue to fight.\n'The people on 60 Minutes and at CBS News didn’t just take it lying down. They did their best to stop it.'\nHe added that 'Trump is now forcing a whole news organization to pay millions of dollars for doing something protected by the Constitution - which is, of course, free and independent reporting.'\n'Now, you take today's sell-out,' he continued. 'And that's what it was: It was a sell-out to extortion by the President. Who can now say where all this ends?'\n'The people on 60 Minutes and at CBS News didn’t just take it lying down. They did their best to stop it,' Rather said\nRather worked at CBS News for 42 years, 24 of them behind the Evening News desk\nRather was fired by CBS in 2006 after presenting unauthenticated documents in a news report on George W. Bush's Vietnam War-era service in the National Guard\n'If major news organizations continue to kneel before power and stop trying to hold the powerful accountable, then we all lose,' he added, noting that the president has done the same with large law firms and major universities.\nRather - who returned to the CBS News airwaves in April 2024 for the first time since his exit 18 years ago to promote a Netflix documentary about his life - said he expects staff at the network 'to fully double down now on whatever great reporting they're allowed to do.'\nHe concluded by saying that in his more than 60 years as a journalist, he's never seen such a hostile climate.\n'And I know the people at CBS News, and particularly those at 60 Minutes, they'll do their dead level best under these circumstances,' he said.\n'But the question is what this development and the message it sends to us. And that's what I'm trying to concentrate on.'\nRather worked at CBS News for 42 years, 24 of them behind the Evening News desk.\nHe unsuccessfully sued CBS News and its then-parent company, Viacom, in 2007, accusing the network and its ownership of making him a 'scapegoat' in the documents controversy.\nAn appeals court dismissed the lawsuit in 2009, and the New York Court of Appeals refused to reinstate it the following year.\nHe now authors a Substack, which he's written for since 2021."
    }
  ],
  "argos_summary": "Jon Stewart's future on 'The Daily Show' is uncertain following Paramount's $16 million settlement with Donald Trump, which Stewart criticized as a capitulation to corporate interests. During a recent press conference, Paramount's co-CEO George Cheeks hinted that no decisions about renewing Stewart's contract, which expires in December, have been made. This comes amid speculation that the company may be restructuring its late-night programming, especially after the cancellation of Stephen Colbert's show, which was reportedly losing $40 million annually. Stewart has openly condemned the settlement, suggesting it undermines journalistic integrity and reflects a broader trend of corporate fear in the media.",
  "argos_id": "N0DMEK0VL"
}