{
  "url": "https://www.startribune.com/vance-uk-foreign-secretary-will-meet-before-us-vice-presidents-vacation-in-the-english-countryside/601451753",
  "authorsByline": "DANICA KIRKA",
  "articleId": "d37ae1d6ddf24ce7b639ee381eb9326a",
  "source": {
    "domain": "startribune.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MN",
      "county": "Hennepin County",
      "city": "Minneapolis",
      "coordinates": {
        "lat": 44.9772995,
        "lon": -93.2654692
      }
    }
  },
  "imageUrl": "https://www.startribune.com/200.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T07:05:00.515000+00:00",
  "addDate": "2025-08-08T07:32:32.888207+00:00",
  "refreshDate": "2025-08-08T07:32:32.888210+00:00",
  "score": 1.0,
  "title": "Vance, UK foreign secretary will meet before US vice president's vacation in the English countryside",
  "description": "U.S. Vice President JD Vance is expected to meet with U.K. Foreign Secretary David Lammy on Friday at a stately home south of London before heading off on a family vacation in the the Cotswolds, a trendy retreat in the English countryside.",
  "content": "LONDON — U.S. Vice President JD Vance is expected to meet with U.K. Foreign Secretary David Lammy on Friday at a stately home south of London before heading off on a family vacation in the the Cotswolds, a trendy retreat in the English countryside.\n\nVance and Lammy, who come from opposite ends of the political spectrum but have made a personal connection through their hardscrabble childhoods and Christian faith, will hold talks at the foreign secretary's official country residence, known as Chevening.\n\nThe meeting comes as the United Kingdom tries to come to favorable terms for steel and aluminum exports to the U.S. as the two sides work out details of a broader trade deal announced at the end of June. Russia's invasion of Ukraine and the Israel-Hamas war in Gaza are also likely to be on the agenda amid debates between Washington and London about the best way to end those conflicts.\n\nRussian President Vladimir Putin said Thursday that he hoped to meet with U.S. President Donald Trump next week. Those comments came a day before Trump's deadline for Moscow to show progress in ending the nearly 3½-year war in Ukraine.\n\nWhile Trump has focused on bilateral talks with Putin, U.K. Prime Minister Keir Starmer and other European leaders have stressed that Ukraine must be part of any negotiations on ending the war.\n\nThe U.S. and Britain, which have historically close ties known as ''the special relationship,'' have also disagreed on their approach to ending the war in Gaza.\n\nStarmer said last week that the U.K. would recognize a Palestinian state in September unless Israel takes steps to end the humanitarian crisis in Gaza and commits to a ''long-term sustainable peace.'' The U.S. has said that such recognition would be counterproductive because it rewards Hamas militants for the attack on southern Israel on Oct. 7, 2023.\n\nLammy and Vance will meet at Chevening, an almost 400-year-old mansion surrounded by 3,000 acres (about 1,200 hectares) of gardens, lawns and woodland in the county of Kent, southeast of London. The estate was given to the nation by the 7th Earl Stanhope in 1967 and is now the official country residence of the U.K. foreign secretary.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. President Donald Trump",
      "weight": 0.08556606
    },
    {
      "name": "U.S. Vice President JD Vance",
      "weight": 0.08264885
    },
    {
      "name": "U.K. Foreign Secretary David Lammy",
      "weight": 0.077094495
    },
    {
      "name": "U.K. Prime Minister Keir Starmer",
      "weight": 0.07547597
    },
    {
      "name": "Russian President Vladimir Putin",
      "weight": 0.06861336
    },
    {
      "name": "UK foreign secretary",
      "weight": 0.06770652
    },
    {
      "name": "U.K.",
      "weight": 0.06573626
    },
    {
      "name": "U.S.",
      "weight": 0.06522436
    },
    {
      "name": "southern Israel",
      "weight": 0.06419806
    },
    {
      "name": "Donald Trump",
      "weight": 0.061252367
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.994140625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9384765625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.93359375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.6640625
    },
    {
      "name": "/News/World News",
      "score": 0.331298828125
    }
  ],
  "sentiment": {
    "positive": 0.08270264,
    "negative": 0.5761719,
    "neutral": 0.34106445
  },
  "summary": "U.S. Vice President JD Vance is set to meet with UK Foreign Secretary David Lammy before heading off on a family vacation in the the Cotswolds. The two men, who come from opposite backgrounds, will discuss at the foreign secretary's official country residence, Chevening. The meeting comes as the UK seeks favorable terms for steel and aluminum exports to the U.S., while the two countries work on a broader trade deal. The topics of the meeting include Russia's invasion of Ukraine and the Israel-Hamas war in Gaza, as well as disagreements over the best way to end these conflicts. The U.K. and U.N. have also disagreed on their approach to ending the Gaza war.",
  "shortSummary": "US Vice President JD Vance and UK Foreign Secretary David Lammy will discuss trade, Ukraine, Gaza, and the Gaza war before heading on a family vacation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "86ca25d1dc594d9782fb58a884e29184",
  "places": [
    {
      "osmId": "199049783",
      "town": "Sevenoaks",
      "county": "Kent",
      "state": "England",
      "postcode": "TN13 2SA",
      "country": "United Kingdom",
      "countryCode": "gb",
      "coordinates": {
        "lat": 51.2972452,
        "lon": 0.1346404
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "U.S. Vice President JD Vance is set to meet U.K. Foreign Secretary David Lammy at Chevening, the foreign secretary's official residence, to discuss trade, particularly steel and aluminum exports, as well as ongoing conflicts in Ukraine and Gaza. Despite their differing political views, Vance and Lammy share a personal connection rooted in their backgrounds and faith. The meeting occurs amid tensions regarding the U.K.'s potential recognition of a Palestinian state and differing approaches to the Israel-Hamas conflict.",
  "argos_id": "NUGU4QV32"
}