{
  "url": "https://www.bloomberg.com/news/videos/2025-08-08/classic-cars-take-center-stage-at-pebble-beach-video?srnd=phx-industries",
  "authorsByline": "bn",
  "articleId": "fcd879a3301347979662dbf12d66545e",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iNLLPVXrh6gA/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T21:45:59.476000+00:00",
  "addDate": "2025-08-08T22:03:38.242204+00:00",
  "refreshDate": "2025-08-08T22:03:38.242206+00:00",
  "score": 1.0,
  "title": "Classic Cars Take Center Stage at 74th Pebble Beach Concours d’Elegance",
  "description": "Sandra Button, Chairman of the Pebble Beach Concours d'Elegance on the annual automotive event, which marks the finale of Monterey Car Week and this year celebrates car collectors and the 75th anniversary of F1. (Source: Bloomberg)",
  "content": "Well, the collector car market is really celebrated on this one day a year at Pebble Beach, when it's sort of like the Olympics of cars. And it's a whole symphony of different kinds of cars from, you know, cars from the late 1880s, all the way to Formula One, cars that were, you know, just raced this last season. So we really rate all things cars and everything in between. And of course, you mentioned the beautiful cars from the thirties and the swoopy lines. Well, it's all going to be here very soon. So how does a car get invited to the show? Because is it that the car gets invited? Not necessarily the owners. It's all about the cars. And, you know, because we have about two we have about 250 cars on the field. And if you own a car, that's really important. And let's say it's it's a part of our celebration this year. We're celebrating 100 years of Chrysler. We have in Victor's Moretti's, believe it or not, 100 years of the Rolls-Royce Phantom, just that one mark of car. So if you own one of those cars and it's critical that we have it, that it's important to celebrate that that's one way to get invited. Hey, I want to ask a little bit more, too, about, you know, judging and how it all works. But I want to take a step back, Sandra, because this is something that has been around for a long time, started back in 1950. And I'm just curious why and how it came to be one of the most important and prestigious car shows really in the world. Something that I think is really cool about the Pebble Beach Concours. There were actually very dynamically organic. The event started in 1950 and to be honest, the Pebble Beach Concorde was just a sideshow. The Pebble Beach road races that started in 1950, they were the star event. And after the after the road races finished, then it was kind of time to kick the tires and take a look at cars. And in the very beginning at Pebble Beach, the cars were brand new. They were they were sports cars, you know, from the fifties. And that kind of changed in 1955 when Phil Hill won with the Pierce Arrow with with an actual antique car and not a brand new car. But but Pebble Beach is all about celebrating everything, automotive, racing, the style, even fashion. So I'm glad you got to see it once. It was amazing. I have to say, the whole event, you're just you're just driving around the area and there's parades through the streets and it's just all kinds of cars. It was really, really, really beautiful and really amazing. Sandra, I'm curious how in general has the collectors market been right now? Because typically it's been pretty volatile. Well, I think you've mentioned it's been volatile. It's kind of like any art market. Of course, it has ups and downs. And I would say we're seeing some generational shift that a lot of the people that collected the cars from the twenties, thirties and forties are aging out of the hobby. And we're getting newer collectors who are maybe looking for things that that are more relevant to their lifestyle or cars that they've seen on the road. So yeah, there is that generational shift. There's also the challenge of getting these cars restored. Many of the people that have worked on the cars, they're aging out as well and there aren't as many people joining the ranks of restorers. You know, Hanna wrote a great article today about how a car gets ready for Pebble Beach. And you can see that, you know, there's not as many people joining that profession that are leaving. So it's it's a great it's a great job to look for right now. Yeah, I agree with you. It's in our weekend edition for Bloomberg. And she says, you know, she right. She says that jobs and she talks about one individual in particular are the most tedious in the classic car business, which by its very nature tends to attract a select few maniacally devoted artisans. But I see that we see that in general, like we talk about that it's just not something we see and certainly happening here in the United States. I love that you talked about, though, a younger generation. And it's another thing that we talk about, you know, who's going to be collecting in the future. What does a younger generation of collectors, etc., mean for the winners of the Concours? Could it could a 19 or nineties car weigh in? Like how do how does that evolve and impact? Well, you're right. Younger cars that aren't as old can be winning and we have runners up to best of show. So you know we have 200 cars on the field. There's maybe 28 classes. So you have to win your class to be eligible for best of show. And of those 28 cars, usually oils down to three or four that are all really in contention for best of show. So we bring up those those runner up the nominees for best of show. And in the last few years, we've had postwar cars. We've had last year we had a preservation car that hadn't been restored. That actually became our winner. But you're right, the the breadth of the years of those cars is widening. And I think it is because of the younger collectors that have so much passion. I mean, they really want perfection in their cars. They persevere through the restoration project process, which can take years. And they really want I think they're great stewards because they want the cars to be right for the future. So they dig into the history and they make sure that when they restore the car that they're that they do right by it, that they show the way that it was really built in the day. We're talking with Sandra Button, chairman of the Pebble Beach Concorde Day Elegance, joining us from Pebble Beach today. I am curious to about the theme this year. My understanding is that you guys are marking 75 years of Formula One racing. So talk to us about this theme, how you're going to be celebrating it and and why you chose to pick that theme. Well, I think 75 years is a pretty good base. You know, it's about the same age as the Pebble Beach Concours, D'elegance. But if you can think about what we're going to be able to see on Sunday, the entire history of Formula One unfold before us. And and we're also having a class of Grand Prix race cars that pre-dated Formula One. So you're really going to be able to see the entire history of racing along the water at Pebble Beach a week from Sunday. Is Brad Pitt going to be there? And that's what we we've. Oh, yes. Now for The Secret Passion. I'm just kidding. I'm just kidding.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "car",
      "weight": 0.122867234
    },
    {
      "name": "cars",
      "weight": 0.122867234
    },
    {
      "name": "Younger cars",
      "weight": 0.121925764
    },
    {
      "name": "Classic Cars",
      "weight": 0.120242715
    },
    {
      "name": "postwar cars",
      "weight": 0.118103765
    },
    {
      "name": "sports cars",
      "weight": 0.117754206
    },
    {
      "name": "Grand Prix race cars",
      "weight": 0.10877715
    },
    {
      "name": "Pebble Beach",
      "weight": 0.10172305
    },
    {
      "name": "Pebble Beach Concours d’Elegance",
      "weight": 0.09339027
    },
    {
      "name": "74th Pebble Beach Concours d’Elegance",
      "weight": 0.08946026
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    },
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/Autos & Vehicles/Vehicle Shopping/Vehicle Specs, Reviews & Comparisons",
      "score": 0.5771484375
    },
    {
      "name": "/Autos & Vehicles/Custom & Performance Vehicles",
      "score": 0.439453125
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Sports Cars",
      "score": 0.435791015625
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Luxury Vehicles",
      "score": 0.353515625
    }
  ],
  "sentiment": {
    "positive": 0.14379883,
    "negative": 0.47070312,
    "neutral": 0.38500977
  },
  "summary": "The 74th Pebble Beach Concours d’Elegance, a day a year at Pebble Beach, is celebrated as the Olympics of cars. The event, which started in 1950, features cars from the late 1880s to Formula One, from cars that were just raced last season. The highlight of the event is celebrating 100 years of Chrysler, and the Rolls-Royce Phantom, highlighting the importance of celebrating these cars with their unique marks. The author also notes a generational shift in the collector car market, with older collectors aging out of the hobby and newer collectors seeking more relevant cars. She also notes that the challenge of restoring these cars is also increasing due to the aging of restorers and fewer people joining the ranks of restoreors.",
  "shortSummary": "The 74th Pebble Beach Concours d’Elegance celebrates a wide variety of classic cars, reflecting a generational shift and evolving collectors market.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ce286ada5b9b47dab3c2bd24a0821140",
  "places": [
    {
      "osmId": "189820674",
      "road": "Pebble Beach",
      "city": "Mission Viejo",
      "county": "Orange County",
      "state": "California",
      "postcode": "92692",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 33.6232949,
        "lon": -117.645971
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "The Pebble Beach Concours d'Elegance, celebrated annually, showcases a diverse range of cars from the late 1880s to modern Formula One vehicles. This year's event marks significant anniversaries, including 100 years of Chrysler and the Rolls-Royce Phantom, as well as 75 years of Formula One racing. The collector car market is experiencing a generational shift, with younger collectors emerging and influencing the types of cars being celebrated, including postwar vehicles. The event highlights the importance of car restoration and the dedication of collectors to preserve automotive history.",
  "argos_id": "O0MSH9DXO"
}