{
  "url": "https://arstechnica.com/space/2025/08/astronaut-james-lovell-famed-apollo-13-commander-dies-at-97/",
  "authorsByline": "Robert Pearlman",
  "articleId": "5d42667b24374bc8bdb8b0a06a34156c",
  "source": {
    "domain": "arstechnica.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/news-080825a-lg-1152x648.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-09T01:28:04+00:00",
  "addDate": "2025-08-09T01:32:01.541581+00:00",
  "refreshDate": "2025-08-09T01:32:01.541584+00:00",
  "score": 1.0,
  "title": "Astronaut James Lovell, famed Apollo 13 commander, dies at 97",
  "description": "James Lovell, a member of humanity’s first trip to the moon and commander of NASA’s ill-fated Apollo 13 mission, has died at the age of 97.",
  "content": "James Lovell, a member of humanity's first trip to the moon and commander of NASA's ill-fated Apollo 13 mission, has died at the age of 97. Lovell's death on Thursday was announced by the space agency. \"NASA sends its condolences to the family of Capt. Jim Lovell, whose life and work inspired millions of people across the decades,\" said acting NASA Administrator Sean Duffy in a statement on Friday. \"Jim's character and steadfast courage helped our nation reach the moon and turned a potential tragedy into a success from which we learned an enormous amount. We mourn his passing even as we celebrate his achievements.\" A four-time Gemini and Apollo astronaut, Lovell was famously portrayed in the 1995 feature film \"Apollo 13.\" The movie dramatized his role as the leader of what was originally planned as NASA's third moon landing, but instead became a mission of survival after an explosion tore through his spacecraft's service module. \"I know today when I came out many of you were expecting Tom Hanks, but you're going to have to settle for little old me,\" Lovell often said at his public appearances after the movie was released. Astronaut Jim Lovell (right) addressing Tom Hanks at the premiere of \"Apollo 13: The IMAX Experience\" at the Kennedy Space Center Visitor Complex in November 2002. Selected with NASA's second group of astronauts in 1962, Lovell first launched aboard Gemini 7, the first mission to include a rendezvous with another crewed spacecraft (Gemini 6). Lifting off on a Titan II rocket on Dec. 4, 1965, Lovell and the mission's commander, Frank Borman's primary goal was to spend two weeks in Earth orbit in preparation for the later Apollo missions to the moon. \"It was very exciting to me,\" said Lovell in a 1999 NASA oral history interview. \"I mean, it was tedious work, you know, two weeks. We did have a break when [Wally] Schirra and [Tom] Stafford came up [on Gemini 6] and rendezvoused with us. And then they were up, I think, 24 hours and they went back down again. And we stayed up there for the full time. But it was quite rewarding.\"\n\nAt 13 days, 18 hours, 35 minutes and one second, Gemini 7 was the longest space flight until a Russian Soyuz mission surpassed it in 1970. Lovell and Borman continued to hold the U.S. record until the first crewed mission to Skylab, the nation's first space station, in 1973. Lovell the commanded Gemini 12, the final flight of the program, which launched on Nov. 11, 1966. Only four days long, the mission stood out for demonstrating all of the skills needed to send astronauts to the moon, including rendezvousing and docking with an Agena target and the first successful spacewalks conducted by crewmate Buzz Aldrin. \"Buzz completed three spacewalks of about 5.5 hours and everything was fine,\" said Lovell. \"[We did] everything we were supposed to do, and [had] no problem at all. So, it was a major turning point in the ability to work outside a spacecraft.\" First and fifth Lovell's made his first trip to the moon as a member of the first-ever crew to fly to another celestial body. Reunited with Borman and joined by William \"Bill\" Anders, Lovell launched on Apollo 8 on Dec. 21, 1968. The mission was also the first crewed flight of the Saturn V, the massive rocket designed to send astronauts from Earth to the moon. \"You had to pinch yourself,\" Lovell said of the journey out. \"Hey, we're really going to the moon!\" I mean, \"You know, this is it!\" A still from a 16mm motion picture film shows Jim Lovell during the Apollo 8 mission, the first flight by humans to the moon. Lovell and his Apollo 8 crewmates were the first to see the far side of the moon with their own eyes and the first to witness \"Earthrise\" — the sight of our home planet rising above the lunar horizon — their photographs of such later credited with inspiring the environmental movement. \"We were so curious, so excited about being at the moon that we were like three school kids looking into a candy store window, watching those ancient old craters go by from — only 60 miles [97 kilometers] above the surface,\" said Lovell.\n\nSplashing down on Dec. 27, 1968, the Apollo 8 mission brought to close a year that had otherwise been troubled with riots, assassinations and an ongoing war. A telegram sent to the crew after they were home said, \"You saved 1968.\" \"I was part of a thing that finally gave an uplift to the American people about doing something positive, which was really — that's why I say Apollo 8 was really the high point of my space career,\" said Lovell. Even before launching on Apollo 13 on April 11, 1970, Lovell had decided it was going to be his last. At 42, he was the first of person to launch four times into space. Had the flight gone to plan, he would have become the fifth person to walk on the moon and the first to wear red commander stripes while do so. Jim Lovell, commander of the Apollo 13 mission, poses for a photo with his Saturn V rocket on the launch pad in April 1970. Instead, there was a \"problem.\" \"I don't know why I did this, but I looked out the right window and that's when I saw that at a high rate of speed, gas was escaping from the spacecraft. You could see a little plume of it,\" said Lovell in an April 2000 interview with collectSPACE. \"I then glanced at the oxygen gauges and one read zero and another was in the process of going down.\" \"That is when I really felt we were in a very dangerous situation,\" he said. Lovell and his Apollo 13 crewmates Fred Haise and John \"Jack\" Swigert splashed down safely on April 17, 1970. In total, Lovell logged 29 days, 19 hours and three minutes on his four spaceflights. Lovell was the 22nd person to enter orbit and the 28th to fly into space, according to the Association of Space Explorers' Registry of Space Travelers.\n\nAfter the Apollo 13 mission, Lovell was named the deputy director of science and applications at NASA's Manned Spacecraft Center (today, Johnson Space Center) before retiring from both the space agency and Navy on March 1, 1973. Lovell became chief executive officer of Bay-Houston Towing Company in 1975 and then president of Fisk Telephone Systems in 1977. On Jan. 1, 1981, Lovell joined Centel Corporation as group vice president for business communications systems and, 10 years later, retired as executive vice president and a member of the company's board of directors. For 11 years from 1967 to 1978, Lovell served as a consultant and then chairman of the Physical Fitness Council (today, the President's Council on Sports, Fitness and Nutrition). He was a member of the board for several organizations, including Federal Signal Corporation in Chicago from 1984 to 2003 and the Astronautics Corporation of America in Milwaukee from 1990 to 1999. He was also chairman of the Astronaut Scholarship Foundation from 1997 to 2005. From 1999 to 2006, Lovell helped run \"Lovell's of Lake Forest,\" a restaurant that he and his and his family opened in Illinois. (The restaurant was then sold to Jay, Lovell's son, but ultimately closed in 2015.) In 1994, Lovell worked with Jeffrey Kluger to publish \"Lost Moon: The Perilous Voyage of Apollo 13,\" which was later retitled \"Apollo 13\" after serving as the basis for the Ron Howard movie. In addition to being played by Hanks and having a cameo in \"Apollo 13,\" Lovell was also portrayed by Tim Daly in the 1998 HBO miniseries \"From the Earth to the Moon\" and Pablo Schreiber in the 2018 Neil Armstrong biopic \"First Man.\" Lovell also made a cameo appearance in the 1976 movie \"The Man Who Fell to Earth.\" Jim Lovell, Apollo 13 commander, shakes hands with President Richard Nixon after being presented with the Presidential Medal of Freedom at Hickham Air Force Base, Hawaii in 1970. For his service to the U.S. space program, Lovell was awarded the NASA Distinguished Service and Exceptional Service medals; the Congressional Space Medal of Honor and Presidential Medal of Freedom. As a member of the Gemini 7, Gemini 12 and Apollo 8 crews, Lovell was bestowed the Harmon International Trophy three times and, with his Apollo 8 crewmates, the Robert J. Collier and Dr. Robert H. Goddard Memorial trophies and was named Time Magazine's Man of the Year for 1968.\n\nLovell was inducted into the International Space Hall of Fame in 1982, the U.S. Astronaut Hall of Fame in 1993 and National Aviation Hall of Fame in 1998. A crater on the far side of the moon was named for Lovell in 1970. In 2009, he was awarded a piece of the moon as part of NASA's Ambassador of Exploration Award, which Lovell placed on display at the Patuxent River Naval Air Museum in Lexington Park, Maryland. A statue of Lovell with his two Apollo 13 crewmates stands inside the Saturn V building at Johnson Space Center's George W.S. Abbey Rocket Park in Houston. In 2005, Lovell donated his personal collection of NASA memorabilia to the Adler Planetarium in Chicago, where it is on display in the \"Mission Moon\" exhibition. With Lovell's death, only five out of the 24 people who flew to the moon during the Apollo program remain living (Buzz Aldrin, 95; Fred Haise, 91; David Scott, 93; Charlie Duke, 89; and Harrison Schmitt, 90). Lovell is survived by his children, Barbara Harrison, James Lovell III, Susan Lovell, and Jeffrey Lovell; 11 grandchildren; and nine great grandchildren. Lovell was preceded in death by his wife Marilyn Lovell and parents James Lovell, Sr, and Blanche Lovell (Masek). \"We are enormously proud of his amazing life and career accomplishments, highlighted by his legendary leadership in pioneering human space flight,\" said Lovell's family in a statement. \"But, to all of us, he was dad, granddad and the leader of our family. Most importantly, he was our hero. We will miss his unshakeable optimism, his sense of humor and the way he made each of us feel we could do the impossible. He was truly one of a kind.\" A memorial service and burial will be held at the Naval Academy in Annapolis on a date still to be announced. Robert Pearlman is a space historian, journalist and the founder and editor of collectSPACE, a daily news publication and online community focused on where space exploration intersects with pop culture. He is also a contributing writer for Space.com and co-author of \"Space Stations: The Art, Science, and Reality of Working in Space” published by Smithsonian Books in 2018. He is on the leadership board for For All Moonkind and is a member of the American Astronautical Society's history committee.",
  "medium": "Article",
  "links": [
    "http://www.collectspace.com/news/news-071404a-nasa-ambassador-exploration-award.html",
    "http://www.collectspace.com/news/news-041320a-apollo13-50th-lovell-haise-interview.html",
    "http://www.collectspace.com/news/news-122013a-apollo-8-earthrise-recreated-40-years-later.html",
    "https://cdn.arstechnica.net/wp-content/uploads/2025/08/news-080825a-lg.jpg",
    "https://arstechnica.com/author/robertpearlman/",
    "http://www.collectspace.com/news/news-040407a-astronaut-lovell-medal-freedom-recovered.html",
    "http://www.collectspace.com/news/news-080825a-james-lovell-gemini-apollo-13-astronaut-obituary.html",
    "https://arstechnica.com/store/product/subscriptions/",
    "http://www.collectspace.com/news/news-072425a-apollo-13-30th-anniversary-imax-re-release.html",
    "https://historycollection.jsc.nasa.gov/JSCHistoryPortal/history/oral_histories/LovellJA/lovellja.htm",
    "http://www.collectspace.com/news/news-041821a-apollo-13-statue-lovell-haise-space-center-houston.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Jim Lovell",
      "weight": 0.09507936
    },
    {
      "name": "Lovell",
      "weight": 0.094721206
    },
    {
      "name": "James Lovell",
      "weight": 0.09327701
    },
    {
      "name": "Astronaut Jim Lovell",
      "weight": 0.09265017
    },
    {
      "name": "Jeffrey Lovell",
      "weight": 0.09191935
    },
    {
      "name": "Marilyn Lovell",
      "weight": 0.091121085
    },
    {
      "name": "Astronaut James Lovell",
      "weight": 0.09109123
    },
    {
      "name": "Blanche Lovell",
      "weight": 0.09068258
    },
    {
      "name": "Susan Lovell",
      "weight": 0.090597
    },
    {
      "name": "James Lovell III",
      "weight": 0.08705422
    }
  ],
  "topics": [
    {
      "name": "In Memoriam"
    },
    {
      "name": "Space"
    }
  ],
  "categories": [
    {
      "name": "Science"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.7314453125
    },
    {
      "name": "/News/Other",
      "score": 0.57568359375
    },
    {
      "name": "/Science/Astronomy",
      "score": 0.3974609375
    }
  ],
  "sentiment": {
    "positive": 0.19763184,
    "negative": 0.40966797,
    "neutral": 0.39282227
  },
  "summary": "James Lovell, a member of humanity's first trip to the moon and the commander of NASA's Apollo 13 mission, has died at the age of 97. Lovell was a four-time Gemini and Apollo astronaut, whose life and work inspired millions of people across the decades. His death was announced by the space agency. The 1995 feature film \"Apollo 13\" depicted Lovell's role as the leader of what was originally planned as NASA's third moon landing, but instead became a mission of survival after an explosion ripped through his spacecraft's service module. He was portrayed in the movie \"Ap Apollo 13.\" Lovell first launched aboard Gemini 7 in 1962 and launched on Apollo 8 on Dec. 21, 1968, the first-ever crew to fly to another celestial body. He also commanded Gemini 12 on the final flight of the program in 1966.",
  "shortSummary": "James Lovell, an iconic astronaut who led the Apollo 13 mission, has died at 97, inspiring millions across the globe.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "b127ad3cf4c7499ca07ba910766ac93e",
  "places": [],
  "scraped_sources": [
    {
      "url": "http://www.collectspace.com/news/news-080825a-james-lovell-gemini-apollo-13-astronaut-obituary.html",
      "text": "advertisements\n|\n|\nAstronaut James Lovell, famed Apollo 13 commander, dies at 97\nAugust 8, 2025 — James Lovell, a member of humanity's first trip to the moon and commander of NASA's ill-fated Apollo 13 mission, has died at the age of 97.\nLovell's death on Thursday (Aug. 7) was announced by the space agency.\n\"NASA sends its condolences to the family of Capt. Jim Lovell, whose life and work inspired millions of people across the decades,\" said acting NASA Administrator Sean Duffy in a statement on Friday. \"Jim's character and steadfast courage helped our nation reach the moon and turned a potential tragedy into a success from which we learned an enormous amount. We mourn his passing even as we celebrate his achievements.\"\nA four-time Gemini and Apollo astronaut, Lovell was famously portrayed in the 1995 feature film \"Apollo 13.\" The movie dramatized his role as the leader of what was originally planned as NASA's third moon landing, but instead became a mission of survival after an explosion tore through his spacecraft's service module.\n\"I know today when I came out many of you were expecting Tom Hanks, but you're going to have to settle for little old me,\" Lovell often said at his public appearances after the movie was released.\nPracticing for the moon\nSelected with NASA's second group of astronauts in 1962, Lovell first launched aboard Gemini 7, the first mission to include a rendezvous with another crewed spacecraft (Gemini 6). Lifting off on a Titan II rocket on Dec. 4, 1965, Lovell and the mission's commander, Frank Borman's primary goal was to spend two weeks in Earth orbit in preparation for the later Apollo missions to the moon.\n\"it was very exciting to me,\" said Lovell in a 1999 NASA oral history interview. \"I mean, it was tedious work, you know, two weeks. We did have a break when [Wally] Schirra and [Tom] Stafford came up [on Gemini 6] and rendezvoused with us. And then they were up, I think, 24 hours and they went back down again. And we stayed up there for the full time. But it was quite rewarding.\"\nAt 13 days, 18 hours, 35 minutes and one second, Gemini 7 was the longest space flight until a Russian Soyuz mission surpassed it in 1970. Lovell and Borman continued to hold the U.S. record until the first crewed mission to Skylab, the nation's first space station, in 1973.\nLovell the commanded Gemini 12, the final flight of the program, which launched on Nov. 11, 1966. Only four days long, the mission stood out for demonstrating all of the skills needed to send astronauts to the moon, including rendezvousing and docking with an Agena target and the first successful spacewalks conducted by crewmate Buzz Aldrin.\n\"Buzz completed three spacewalks of about 5.5 hours and everything was fine,\" said Lovell. \"[We did] everything we were supposed to do, and [had] no problem at all. So, it was a major turning point in the ability to work outside a spacecraft.\"\nFirst and fifth\nLovell's made his first trip to the moon as a member of the first-ever crew to fly to another celestial body. Reunited with Borman and joined by William \"Bill\" Anders, Lovell launched on Apollo 8 on Dec. 21, 1968. The mission was also the first crewed flight of the Saturn V, the massive rocket designed to send astronauts from Earth to the moon.\n\"You had to pinch yourself,\" Lovell said of the journey out. \"Hey, we're really going to the moon!\" I mean, \"You know, this is it!\"\nLovell and his Apollo 8 crewmates were the first to see the far side of the moon with their own eyes and the first to witness \"Earthrise\" — the sight of our home planet rising above the lunar horizon — their photographs of such later credited with inspiring the environmental movement.\n\"We were so curious, so excited about being at the moon that we were like three school kids looking into a candy store window, watching those ancient old craters go by from — only 60 miles [97 kilometers] above the surface,\" said Lovell.\nSplashing down on Dec. 27, 1968, the Apollo 8 mission brought to close a year that had otherwise been troubled with riots, assassinations and an on-going war. A telegram sent to the crew after they were home said, \"You saved 1968.\"\n\"I was part of a thing that finally gave an uplift to the American people about doing something positive, which was really — that's why I say Apollo 8 was really the high point of my space career,\" said Lovell.\nEven before launching on Apollo 13 on April 11, 1970, Lovell had decided it was going to be his last. At 42, he was the first of person to launch four times into space. Had the flight gone to plan, he would have become the fifth person to walk on the moon and the first to wear red commander stripes while do so.\nInstead, there was a \"problem.\"\n\"I don't know why I did this, but I looked out the right window and that's when I saw that at a high rate of speed, gas was escaping from the spacecraft. You could see a little plume of it,\" said Lovell in an April 2000 interview with collectSPACE. \"I then glanced at the oxygen gauges and one read zero and another was in the process of going down.\"\n\"That is when I really felt we were in a very dangerous situation,\" he said.\nLovell and his Apollo 13 crewmates Fred Haise and John \"Jack\" Swigert splashed down safely on April 17, 1970. In total, Lovell logged 29 days, 19 hours and three minutes on his four spaceflights.\nLovell was the 22nd person to enter orbit and the 28th to fly into space, according to the Association of Space Explorers' Registry of Space Travelers.\nFrom the cockpit to the board\nBorn on March 25, 1928 in Cleveland, Ohio, Lovell achieved Eagle Scout as a member of the Boy Scouts and studied engineering as part of the U.S. Navy's \"Flying Midshipman\" program at the University of Wisconsin in Madison from 1946 to 1948. Four years later, he was commissioned as an ensign and graduated with a Bachelor of Science degree from the Naval Academy in Annapolis, Maryland.\nLovell reported for flight training at Naval Air Station Pensacola in October 1952 and he was designated a naval aviator on Feb. 1, 1954. He served at Moffett Field in northern California and logged 107 deck landings during a deployment aboard the aircraft carrier USS Shangri-La.\nIn July 1958, Lovell graduated at the top of the class at the Naval Air Test Center (today, the U.S. Naval Test Pilot School) at Naval Air Station Patuxent River in Maryland. He was one of 110 candidates to be considered for NASA's original Mercury 7 astronauts, but was turned away due to a temporary medical concern. Instead, Lovell became the program manager for the McDonnell Douglas F-4 Phantom II supersonic jet.\nIn 1962, Lovell was serving as a flight instructor and safety engineering officer at Naval Air Station Oceana in Virginia Beach when he was chosen for the second class of NASA astronauts, the \"Next Nine.\"\nIn addition to his prime crew assignments, Lovell also served on the backup crews for the Gemini 4, Gemini 9 and Apollo 11 missions, the latter supporting Neil Armstrong as backup commander. He also served on a panel studying what could be done in case of an in-flight fire after a fire on the launch pad claimed the lives of the Apollo 1 crew in 1967.\nAfter the Apollo 13 mission, Lovell was named the deputy director of science and applications at NASA's Manned Spacecraft Center (today, Johnson Space Center) before retiring from both the space agency and Navy on March 1, 1973. Lovell became chief executive officer of Bay-Houston Towing Company in 1975 and then president of Fisk Telephone Systems in 1977.\nOn Jan. 1, 1981, Lovell joined Centel Corporation as group vice president for business communications systems and, 10 years later, retired as executive vice president and a member of the company's board of directors.\nFor 11 years from 1967 to 1978, Lovell served as a consultant and then chairman of the Physical Fitness Council (today, the President's Council on Sports, Fitness and Nutrition). He was a member of the board for several organizations, including Federal Signal Corporation in Chicago from 1984 to 2003 and the Astronautics Corporation of America in Milwaukee from 1990 to 1999. He was also chairman of the Astronaut Scholarship Foundation from 1997 to 2005.\nAppearances and awards\nFrom 1999 to 2006, Lovell helped run \"Lovell's of Lake Forest,\" a restaurant that he and his and his family opened in Illinois. (The restaurant was then sold to Jay, Lovell's son, but ultimately closed in 2015.)\nIn 1994, Lovell worked with Jeffrey Kluger to publish \"Lost Moon: The Perilous Voyage of Apollo 13,\" which was later retitled \"Apollo 13\" after serving as the basis for the Ron Howard movie.\nIn addition to being played by Hanks and having a cameo in \"Apollo 13,\" Lovell was also portrayed by Tim Daly in the 1998 HBO miniseries \"From the Earth to the Moon\" and Pablo Schreiber in the 2018 Neil Armstrong biopic \"First Man.\" Lovell also made a cameo appearance in the 1976 movie \"The Man Who Fell to Earth.\"\nFor his service to the U.S. space program, Lovell was awarded the NASA Distinguished Service and Exceptional Service medals; the Congressional Space Medal of Honor and Presidential Medal of Freedom. As a member of the Gemini 7, Gemini 12 and Apollo 8 crews, Lovell was bestowed the Harmon International Trophy three times and, with his Apollo 8 crewmates, the Robert J. Collier and Dr. Robert H. Goddard Memorial trophies and was named Time Magazine's Man of the Year for 1968.\nLovell was inducted into the International Space Hall of Fame in 1982, the U.S. Astronaut Hall of Fame in 1993 and National Aviation Hall of Fame in 1998.\nA crater on the far side of the moon was named for Lovell in 1970. In 2009, he was awarded a piece of the moon as part of NASA's Ambassador of Exploration Award, which Lovell placed on display at the Patuxent River Naval Air Museum in Lexington Park, Maryland.\nA statue of Lovell with his two Apollo 13 crewmates stands inside the Saturn V building at Johnson Space Center's George W.S. Abbey Rocket Park in Houston.\nLovell's legacy\nIn 2005, Lovell donated his personal collection of NASA memorabilia to the Adler Planetarium in Chicago, where it is on display in the \"Mission Moon\" exhibition.\nWith Lovell's death, only five out of the 24 people who flew to the moon during the Apollo program remain living (Buzz Aldrin, 95; Fred Haise, 91; David Scott, 93; Charlie Duke, 89; and Harrison Schmitt, 90).\nLovell is survived by his children, Barbara Harrison, James Lovell III, Susan Lovell, and Jeffrey Lovell; 11 grandchildren; and nine great grandchildren. Lovell was preceded in death by his wife Marilyn Lovell and parents James Lovell, Sr, and Blanche Lovell (Masek).\n\"We are enormously proud of his amazing life and career accomplishments, highlighted by his legendary leadership in pioneering human space flight,\" said Lovell's family in a statement. \"But, to all of us, he was dad, granddad and the leader of our family. Most importantly, he was our hero. We will miss his unshakeable optimism, his sense of humor and the way he made each of us feel we could do the impossible. He was truly one of a kind.\"\nA memorial service and burial will be held at the Naval Academy in Annapolis on a date still to be announced. |\n|\nAstronaut Jim Lovell takes a self-portrait aboard NASA's Gemini 12 spacecraft during the final mission of the program in 1966. (NASA)\nAstronaut Jim Lovell (right) addressing Tom Hanks at the premiere of \"Apollo 13: The IMAX Experience\" at the Kennedy Space Center Visitor Complex in November 2002. (collectSPACE)\nA still from a 16mm motion picture film shows Jim Lovell during the Apollo 8 mission, the first flight by humans to the moon. (NASA)\nOfficial portrait of Apollo 13 commander James Lovell. (NASA)\nJim Lovell, commander of the Apollo 13 mission, poses for a photo with his Saturn V rocket on the launch pad in April 1970. (NASA)\nApollo 13 commander Jim Lovell, on board the primary recovery ship USS Iwo Jima, reads an account of his and his crewmates' safe recovery after the \"problem\"-plagued moon mission. (NASA)\nJim Lovell, Apollo 13 commander, shakes hands with President Richard Nixon after being presented with the Presidential Medal of Freedom at Hickham Air Force Base, Hawaii in 1970. (NASA) |\n|\n© 1999-2025 collectSPACE. All rights reserved.\n|\n|\n|\n|"
    },
    {
      "url": "http://www.collectspace.com/news/news-040407a-astronaut-lovell-medal-freedom-recovered.html",
      "text": "April 4, 2007 — A Presidential Medal of Freedom that was prepared for award to Apollo 13 commander James Lovell and which was missing since 1970, has been recovered after the medal was offered for sale on eBay, the Federal Bureau of Investigation (FBI) announced on Tuesday.\nA slight defect in the medal resulted in its replacement being manufactured and presented in its place to Lovell. The damaged medal was intended to be destroyed but instead it found its way out of the White House and into the hands of a private collector in Pennsylvania.\nIn January, that same collector listed the medal for sale on the website eBay. Originally advertised under the title \"Presidential Medal of Freedom James A. Lovell Apollo 13\", the auction was ended by the seller several times to make adjustments to its description. In the process, she removed all mention of Lovell's name.\nAt the time, the seller explained to potential bidders that the omission was to comply with eBay policies.\nThe description posted on the auction site touted that the medal was the \"original\" version meant for Lovell, calling it \"the ultimate collector's item.\" The seller wrote that \"this original medal was destined for the trash but lucky for us it was saved 37 years ago.\"\nAccording to the FBI, Lovell learned that the medal was being offered for sale and became concerned about the propriety of the auction, the negative effect it might have on the medal as well as on other recipients of the award.\nAs a result, Lovell contacted the FBI.\n\"He was upset by the fact that it might diminish the medal itself,\" Special Agent Brian Brusokas, who works in the Cyber Crimes Unit in the Chicago office and opened the investigation, said.\nBrusokas' investigation identified the seller and led, late last month, to the recovery of the medal and its wooden storage box that bears the presidential seal. The medal's authenticity was verified by the White House.\nSince control the medal was never released by the White House, the collector's possession of it amounts to theft of government property.\nThe sale of a Presidential Medal of Freedom is not illegal or unprecedented. In 2000, actor James Cagney's medal was legally auctioned for $51,000. The difference between that sale and the Lovell award is that the Pennsylvania dealer didn't own the medal.\n\"It's legal,\" Brusokas said, \"only if you have good title to it.\"\nTo date, no arrests have been made nor have charges been filed in connection with the recovery of the medal, although the FBI's investigation is still ongoing.\nThe medal presented to Lovell is still in his possession. He and his Apollo 13 crew members, Fred Haise and Jack Swigert received the honor, the nation's highest civilian award, on April 18, 1970 by President Richard M. Nixon at Hickam Air Force Base in Honolulu, Hawaii.\nThe crew had just returned safely to Earth the day earlier, having survived an in-flight explosion before reaching the Moon.\nLovell's role in the mission was dramatized by Tom Hanks in the 1995 movie Apollo 13.\n\"I am grateful to the FBI for their quick response,\" Lovell said, \"and proud to be a recipient of our nation's highest civilian award.\" |\n|\nDue to an imperfection in the medal above, a replacement was manufactured and presented to Apollo 13 commander Capt. Jim Lovell. The imperfect medal was supposed to be destroyed but ended up in the hands of a private collector. (FBI)\nPresident Richard Nixon and astronaut James Lovell, Apollo 13 commander, shake hands at special ceremonies at Hickham Air Force Base, Hawaii. Nixon presented Lovell and his Apollo 13 crewmates with the Presidential Medal of Freedom. (NASA) |"
    },
    {
      "url": "http://www.collectspace.com/news/news-041320a-apollo13-50th-lovell-haise-interview.html",
      "text": "April 13, 2020 — It was not a scenario for which they had trained.\nAs the astronauts set to be the fifth and sixth people to walk on the moon, Jim Lovell and Fred Haise had undergone months of extensive preparation to carry out every aspect of NASA's Apollo 13 mission — including what to do if something went wrong.\nBut two days after their successful launch on April 11, 1970, mission commander Lovell, lunar module pilot Haise and command module pilot Jack Swigert were thrown into an emergency for which there was no plan. Fifty years ago today (April 13), the Apollo 13 crew \"had a problem.\"\n\"Problem solving with the system we had was suited to what we had to get done, as every mission had problems to deal with,\" Haise said in an interview with collectSPACE. \"But we never considered an explosion, in the sense of being able to work around that.\"\n\"Normally, that would manifest in a loss of the vehicle and crew,\" he said.\nAnd yet, that was exactly what Haise, Lovell and Swigert, as well as the teams of engineers in Mission Control, had to deal with. An oxygen tank, which had been unknowingly damaged during a pre-flight test, exploded, tearing apart the service module that provided the critical power and life support systems for the Apollo 13 command module.\nNot only did the explosion rule out any chance of achieving a moon landing, it threatened to strand the astronauts in deep space. That they made it home safely, was as much due to the ingenuity of the teams that worked the problem on the ground as it was a matter of fortunate timing.\n\"The explosion occurred on April 13, at just the right time to allow a return,\" said Lovell. \"If the explosion occurred when we had lit our engine to go to the moon, in the beginning, we would have never had enough consumables in the lunar module to go all the way around the moon and come back home again. If the explosion occurred after we got into lunar orbit, or, heaven forbid, when we were on the lunar surface, Mission Control would have had to figure out why they left three guys at the moon.\"\nLovell and Haise spoke to collectSPACE about the 50th anniversary of the Apollo 13 mission (Swigert died of cancer in 1982). The two participated in separate interviews; their replies are presented together to comprise a single conversation.\ncollectSPACE (cS): After the explosion itself, was there a point where you felt that your chances of returning to Earth were not looking good?\nJames Lovell: When I noticed the red warning light saying that two out of our three fuel cells had just died, that was kind of a shock to me because that is where we got our electrical power for the whole flight. We would have to rely on battery power, which in the command module we didn't think would be sufficient.\nIt was a feeling of, \"Holy cow! We have something really wrong here.\"\nAnd I don't know why I did this, but I looked out the right window and that's when I saw that at a high rate of speed gas was escaping from the spacecraft. You could see a little plume of it. I then glanced at the oxygen gauges and one read zero and another was in the process of going down. That is when I really felt we were in a very dangerous situation.\nFred Haise: Before you go on one of these missions, you assume necessarily you're not going to get back.\nI had no idea about the percentage [or] what odds there were. It was a matter of working through it with a number of the challenges and [hoping] that someone on the ground working at Mission Control would find the answers.\ncS: Was there a point where you felt more confident about your survival?\nHaise: I think the first time I thought we really had a chance to surely make it back was right after the first use of the lunar module's descent engine. We were then on a free return to get around the moon.\nJim Lovell asked me to compute the consumables, which I did, and I figured we would make it with power. I assumed the power we'd go down to was 18 amps — after that, we'd have to apply a lot more brain power if we got down even lower. But even at that level and even if we had a much longer return, we still made it on six batteries in the lunar module.\n[I calculated] we'd run short of water about five hours before entry interface, but I knew from Apollo 11 data, where we deliberately had Neil [Armstrong] and Buzz [Aldrin] turn off the water before they left their lunar module in orbit and watched the systems die, that the first system to die was at about eight hours. So we were probably okay with water.\nThe one I did not figure, which actually turned out to be the most critical, was the lithium hydroxide [LiOH] cartridges. It didn't even occur to me.\n[cS: The LiOH canisters scrubbed carbon dioxide from the cabin air. The solution, which called for using the command module's incompatible canisters in the lunar module, famously involved jerry-rigging a way to fit a literal square peg in a round hole using nothing but the spare parts they had aboard the spacecraft.]\ncS: What if Apollo 13 never had a problem. Had you given any thought as to what were going to be your first words stepping onto the moon?\nHaise: No, I wasn't planning any first words on the moon. I don't know if Jim was, he would have been the first out.\nLovell: No, this was 13, not Apollo 11.\nHaise: Really I felt by that time, we were kind of past the historic things you might do. I was just really eager to get down the ladder and start to work.\ncS: Okay, history aside, what about personal touches? Charlie Duke famously left a photo of his family on Apollo 16 and Gene Cernan wrote his daughter's initials in the lunar soil on Apollo 17, things like that.\nLovell: I really did not think about leaving something personal on the moon. I guess maybe I should have.\ncS: What about the Navy anchor decal that decorated the front of your LEVA (Lunar Extravehicular Visor Assembly) that was part of the helmet you wore on the moon? No other astronaut decorated theirs.\nLovell: I didn't realize that. Someone very nicely did that for me, whoever got our suits ready. It wasn't until we started training with it that I saw that it was there.\ncS: Fred, did you have any personal activities planned?\nHaise: No, but I probably would have. In the days following the explosion, when I went to get some food, I found in the lunar module some family pictures that had been placed there. If I found those during the landing, I probably would have taken them out and put them on the moon.\ncS: As history played out, the closest that you came to the moon was from above, as you looped around the far side before heading back to Earth. Jim had been there before on Apollo 8, but for you, Fred, this was your first look at the moon from up close. Was the sight out the window a momentary relief from the situation you were in?\nHaise: Looking down at the moon, we could view Fra Mauro, our site where we planned to land. It wasn't an overwhelming kind of emotion at that point; it was just a continuation of the feeling of disappointment that we were not going to be able to do as we trained and set out to do.\ncS: The explosion occurred because of an electrical short in one of the oxygen tanks, but that belies a longer chain of events that trace back before you launched. Did you have any indication at that time that anything was wrong, such that you or someone else could have, but didn't catch it before it became a problem?\nLovell: In hindsight, if you really analyze the construction and work that was done prior to the flight, you could have seen where there would be a possible problem.\nThings that happened on Apollo 13 that should not have happened started a year or more before the flight, when the oxygen tank was dropped at the factory. It had originally been intended to fly on Apollo 10 and, of course, it was rechecked for its ability to feed liquid oxygen to the fuel cells and checked out perfectly.\nBut the thing they did not check was the ability to remove liquid oxygen from the tank. There was piping and other associated equipment at the back of the tank that would allow the ground crew to remove the liquid oxygen after a routine test, prior to securing the spacecraft. And that had been damaged.\nConsequently, removing the liquid oxygen was not possible after our countdown demonstration test two weeks before the flight. So the ground crew took the available power that was at the Cape, which was 65 volt power — the spacecraft used 28 volt power — and used it to power heaters in the tank to boil off the liquid oxygen.\nThat worked perfectly, except for what was not known: the higher voltage exceeded the design of the tank's thermostats, which resulted in the temperature in the tank being allowed to get higher and higher. The tank didn't blow, like you think it would, and so it went undetected and the heat damaged all of the wiring inside the tank, leaving it bare.\nA day before the launch, we filled the tank back up with liquid oxygen again. At that point, it was a bomb waiting to go off... It's an amazing story.\ncS: So with all that occurred, now in hindsight or at the time of the flight, do you or did you subscribe to triskaidekaphobia, the fear of the number 13?\nLovell: If you look back, what is the number of our mission? 13. And what time did we take off from the planet? It was 13:13 Central Standard Time. And when did the explosion occur? April 13. So it is just the continuation of the bad news of 13.\nHaise: I've never been superstitious, but I did get some letters reflecting on 13 being the mission number as being unlucky. I also got letters from Italy where they pointed out that in the other sense, 13 was lucky in Italy.\nI had no sense at all, nor do I relate to the launch time all the other thirteens that people have tried to tie to things as being connected with the flight. I never thought of it in a superstitious sense that we would have a problem on 13. |\n|\nApollo 13 astronauts James Lovell (at left) and Fred Haise, as seen in a composite of 16mm images from the 1970 mission. (NASA, as processed by Andy Saunders/Stephen Slater)\nApollo 13's damaged service module as photographed by the crew after its separation from the command module near the end of the April 1970 moon mission. (NASA, as processed by Andy Saunders)\nApollo 13 astronauts Jim Lovell (at left) and Jack Swigert work with water hoses aboard the lunar module. A jerry-rigged carbon dioxide scrubber (or LiOH canister) is attached to the wall besides Swigert. (NASA/ASU, composite by Andy Saunders)\nApollo 13 astronauts Jim Lovell (at left) and Fred Haise pose at the base of a lunar module simulator in January 1970. (NASA)\nJim Lovell's Apollo 13 LEVA (Lunar Extravehicular Visor Assembly) with Navy anchor decal. (Retro Space Images/J.L. Pickering)\nEarth out the window from aboard Apollo 13. (NASA, as processed by Andy Saunders)\n|"
    },
    {
      "url": "http://www.collectspace.com/news/news-071404a-nasa-ambassador-exploration-award.html",
      "text": "July 14, 2004 — In recognition of the sacrifices and dedication of the Mercury, Gemini and Apollo crew members, each astronaut will be presented a moon rock-embedded award as part of a special ceremony honoring the 35th anniversary of Apollo 11 at the National Air and Space Museum in Washington, D.C. on Tuesday (July 13).\nThe moon rocks being awarded will be samples returned by one of the six Apollo moon landing missions. Each will be encased in acrylic and attached to a base with an inscribed plaque.\nThe lunar samples will remain the property of NASA, but the astronauts and their surviving families, in coordination with NASA, will select a museum or other educational institution where their awards will be publicly displayed in their name to help inspire a new generation of explorers.\nThe award celebrates the \"realization of a vision\" for exploration first articulated by President John F. Kennedy in May 1961, when NASA's fledgling human space flight program had little more than 15 minutes of space flight experience. In addition to the moon rocks, each of the 34 astronauts (nine now deceased) will be named by NASA as \"Ambassadors of Exploration.\"\nAmong the honorees, in addition to the astronauts, will also be veteran journalist Walter Cronkite. Millions experienced the early years of space exploration through Cronkite's news reports. During the Apollo 11 mission, Cronkite was on the air for 27 of the 30 hours it took for Neil Armstrong and Buzz Aldrin to complete their work on the lunar surface.\nAs Ambassadors of Exploration, the recipients will help NASA communicate the benefits and excitement of space exploration and \"why the continuing investment in our future is vital to the security and vitality of America.\"\nAmbassadors of Exploration Photo Gallery\n|\n|\n|\nGene CernanMay 12, 2005 Pensacola, Florida |\nThomas StaffordJuly 12, 2005 Weatherford, Oklahoma |\nJohn YoungJuly 20, 2005 Houston, Texas |\n|\n|\n|\nWalt CunninghamOctober 7, 2005 Dallas, Texas |\nWally SchirraNovember 16, 2005 San Diego, California |\nRichard GordonNovember 19, 2005 Seattle, Washington |\n|\n|\n|\nVance BrandJanuary 21, 2006 Longmont, Colorado |\nEd MitchellFebruary 5, 2006 West Palm Beach, Florida |\nStuart RoosaFebruary 9, 2006 Titusville, Florida |\n|\n|\n|\nMichael CollinsFebruary 9, 2006 Garden City, New York |\nJohn GlennFebruary 20, 2006 Columbus, Ohio |\nDeke SlaytonFebruary 22, 2006 Sparta, Wisconsin |\n|\n|\n|\nWalter CronkiteFebruary 28, 2006 Austin, Texas |\nBuzz AldrinMarch 25, 2006 Los Angeles, California |\n|\n|\n|\n|\nCharlie DukeMay 8, 2006 St. Petersburg, Florida |\nFrank BormanMay 8, 2006 Tucson, Arizona |\nChristopher KraftSeptember 30, 2006 Blacksburg, Virginia |\n|\n|\n|\nJames McDivittOctober 6, 2006 Ann Arbor, Michigan |\nVirgil \"Gus\" GrissomSeptember 28, 2007 Orlando, Florida |\nRoger ChaffeeOctober 6, 2007 West Lafayette, Indiana |\n|\n|\n|\nDonn EiseleOctober 23, 2007 Fort Lauderdale, Florida |\nJack SwigertMay 23, 2008 Denver, Colorado |\nThomas MattinglyMarch 26, 2009 Auburn, Alabama |\n|\n|\n|\nJames LovellApril 3, 2009 Lexington Park, Maryland |\nJohn F. KennedyJuly 20, 2009 Washington, DC |\nAl WordenJuly 30, 2009 Kennedy Space Center, Florida |\n|\n|\n|\nFred HaiseDecember 2, 2009 Biloxi, Mississippi |\nAlan ShepardApril 28, 2011 Annapolis, Maryland |\nEdward WhiteJune 3, 2015 West Point, New York |\n|\n|\nNASA's Ambassador of Exploration awardees will be presented a moon rock to be displayed at a museum or educational institution of their choosing. (NASA)\nQuick Look\nWhere NASA's Ambassador of Exploration awards are on display\n|\n|\nU.S. Naval Academy MuseumAnnapolis, MD (4.28.11) |\n|\n|\nThe Space Museum and Grissom CenterBonne Terre, MO (4.2.2022)\nPreviously: Disney World Resort: Epcot Orlando, FL (9.28.07) |\n|\n|\nJohn Glenn Institute of Public Service and Public PolicyColumbus, OH (2.20.06) |\n|\n|\nDenver Museum of Nature and Science Denver, CO (11.10.07) |\n|\n|\nSan Diego Aerospace MuseumSan Diego, CA (11.16.05) |\n|\n|\n|\n|\n|\nMuseum of Natural ScienceHouston, TX (7.20.05) |\n|\n|\nUniversity of Michigan College of EngineeringAnn Arbor, MI (10.06.06) |\n|\n|\nWest Point Museum, United States Military AcademyWest Point, NY (6.03.15) |\n|\n|\nThe Museum of FlightSeattle, WA (11.18.06) |\n|\n|\nPima Air and Space MuseumTucson, AZ (5.08.06) |\n|\n|\nPatuxent River Naval Air MuseumLexington Park, MD (4.03.09) |\n|\n|\nStafford Air and Space MuseumWeatherford, OK (7.12.05) |\n|\n|\nCincinnati Museum CenterCincinnati, OH (4.18.06) |\n|\n|\nScience MuseumLondon, England (TBA) |\n|\n|\nNational Museum of Naval AviationPensacola, FL (5.12.05) |\n|\n|\nCradle of Aviation MuseumGarden City, NY (2.09.06) |\n|\n|\nThe Museum of FlightSeattle, WA (11.19.05) |\n|\n|\nCalifornia Science CenterLos Angeles, CA (3.25.06) |\n|\n|\nNeil Armstrong Hall of Engineering, Purdue UniversityWest Lafayette, IN (10.06.07) |\n|\n|\nBroward Public LibraryFt. Lauderdale, FL (10.23.07) |\n|\n|\nFrontiers of Flight MuseumDallas, TX (10.7.05) |\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\nGorenflo Elementary SchoolBiloxi, MS (12.02.09) |\n|\n|\nWings Over the Rockies Air & Space MuseumDenver, CO (5.23.08) |\n|\n|\nU.S. Astronaut Hall of FameTitusville, FL (2.09.06) |\n|\n|\nSouth Florida Science MuseumWest Palm Beach, FL (2.05.06) |\n|\n|\nThe Bishop Museum of Science and NatureBradenton, FL (8.04.21) |\n|\n|\nApollo/Saturn V CenterKennedy Space Center, FL (7.30.09) |\n|\n|\nAuburn UniversityAuburn, AL (3.26.09) |\n|\n|\nAdmiral Farragut AcademySt. Petersburg, FL (5.08.06) |\n|\n|\n|\n|\n|\n|\n|\n|\nDeke Slayton Memorial Space & Bike MuseumSparta, WI (2.22.06) |\n|\n|\nMuseum & Cultural CenterLongmont, CO (1.21.06) |\n|\n|\nCenter for American HistoryAustin, TX (2.28.06) |\n|\n|\nVirginia Tech University College of EngineeringBlacksburg, VA (9.30.06) |\n|\n|\nCentral Catholic High SchoolToledo, OH (12.6.07) |\n|\n|\nFondren Library, Rice UniversityHouston, TX (7.20.09) |\n|"
    },
    {
      "url": "http://www.collectspace.com/news/news-072425a-apollo-13-30th-anniversary-imax-re-release.html",
      "text": "Space Newsspace history and artifacts articlesMessagesspace history discussion forumsSightingsworldwide astronaut appearancesResourcesselected space history documents\nadvertisements\n'Apollo 13' re-launching into IMAX theaters for 30th anniversary\nJuly 24, 2025\n— Houston, we have a 30th anniversary re-release.\n\"Apollo 13,\" Universal Pictures' 1995 movie about NASA's \"problem\"-ridden 1970 mission to the moon, will be returning exclusively to IMAX theaters in September. The full-length film is being presented in giant-screen format for the first time.\nFirst released on June 30, 1995, \"Apollo 13\" follows the events of the historic mission, which after departing Earth orbit for the moon, suffered an explosion in the spacecraft's service module, leaking oxygen into space and placing the astronauts' return to Earth at risk. Apollo 13 \"lost the moon\" and became an engineering challenge for Mission Control to bring the crew safely home. Failure was not an option.\n\"Apollo 13 is a testament to human resilience, ingenuity and teamwork in the face of impossible odds,\" said Ron Howard, the movie's director, in a statement released by Universal Pictures on Thursday (July 24). \"As we celebrate the film's 30th anniversary, I'm reminded of how relevant those themes remain today.\"\n\"This re-release is not only a celebration of that incredible mission and the people behind it, but also a proud milestone for all of us at Imagine,\" said Howard, referring to his and Brian Grazer's production company. \"It was a defining moment in our journey as storytellers and we're thrilled that Universal and IMAX have made it possible to share it with a new generation.\"\nTom Hanks, the late Bill Paxton and Kevin Bacon starred as the crew of the third U.S. lunar landing attempt, Jim Lovell, Fred Haise and Jack Swigert, respectively. Kathleen Quinlan portrayed Lovell's wife Marilyn, Gary Sinese played astronaut Ken Mattingly and Ed Harris was flight director Gene Kranz, the head of Mission Control.\n\"Apollo 13\" was the first and only major motion picture to be set in space and film in reduced gravity. The actors, film crew and set pieces were loaded onto a NASA astronaut training aircraft, which flew parabolas in the sky to produce 30 seconds of weightlessness at a time.\n\"Apollo 13\" was also a technological achievement for IMAX, the Canadian large-format film company. The movie was the first live-action production to be digitally remastered using IMAX's DMR process. Released in 2002 as \"Apollo 13: The IMAX Experience,\" it was the first picture to open in commercial and institutional IMAX venues around the world.\nThirteen minutes were cut from the theatrical version of the movie to physically fit it onto the large platters used to project IMAX films. The 30th anniversary release of \"Apollo 13\" will present the entire movie in IMAX for the first time.\n\"We're thrilled to bring it back to theaters in IMAX, where its full emotional impact and visual scope can be experienced like never before,\" said Jim Orr, president of domestic theatrical distribution at Universal Pictures. \"It's a film that continues to inspire audiences with its portrayal of human resilience and problem-solving under unimaginable circumstances.\"\n\"'Apollo 13' is a towering accomplishment in filmmaking and storytelling,\" said Orr."
    },
    {
      "url": "http://www.collectspace.com/news/news-122013a-apollo-8-earthrise-recreated-40-years-later.html",
      "text": "Space Newsspace history and artifacts articlesMessagesspace history discussion forumsSightingsworldwide astronaut appearancesResourcesselected space history documents\nadvertisements\nNASA recreates Apollo 8 'Earthrise' 45 years later using orbiter data\nDecember 20, 2013\n— It is one of the most famous photos ever taken — the Earth rising over the moon's horizon as seen firsthand by the 1968 Apollo 8 crew. And yet, more than four decades later, details about how the photo was captured are still being uncovered.\nFour days shy of the photo's 45th anniversary, NASA on Friday (Dec. 20) released a new simulation of the events that led to the creation of the image known as \"Earthrise.\" The new video was created using topographic data from the space agency's Lunar Reconnaissance Orbiter (LRO), which has been circling the moon since 2009.\n\"This new simulation allows anyone to virtually ride with the astronauts and experience the awe they felt at the vista in front of them,\" NASA said in a release teasing the video.\nIt was Christmas Eve 1968, and the first lunar voyagers in all of history — Apollo 8 astronauts Frank Borman, James Lovell and William Anders — were emerging from behind the moon for the fourth time. It was then that Anders first spotted it, the Earth, peeking over the horizon.\n\"Oh my God! Look at that picture over there!\" exclaimed Anders. \"There's the Earth comin' up. Wow, is that pretty!\"\nWhat followed was an impromptu photo opportunity, first in black and white (building on the first \"Earthrise\" captured by NASA's Lunar Orbiter probe two years earlier) and then after quickly locating the proper film cartridge, in stunning full color.\n\"In lunar orbit, it occurred to me that, here we are, all the way up there at the moon, and we're studying this thing, and it's really the Earth as seen from the moon that's the most interesting aspect of this flight,\" Anders told author Andrew Chaikin for the 2009 book \"Voices from the Moon\" (Viking Studio).\nAnders' color photo of the gibbous Earth hanging over the lunar surface was declared one of the \"great images of the 20th century\" and among \"100 photographs that changed the world\" as selected by the editors of TIME and LIFE magazines. Five months after the Apollo 8 crew returned to Earth, the U.S. Postal Service issued a postage stamp depicting Anders' \"Earthrise.\"\nBut as well known as the photograph became, the details regarding its creation were limited for four decades to the astronauts' anecdotes. Then Ernie Wright, the project lead with the Scientific Visualization Studio at NASA's Goddard Space Flight Center in Maryland began reassembling the Apollo 8 crew's experience using data returned by LRO.\nFor Earth Day in 2012, Wright debuted his first take on the \"Earthrise\" visualization. The flight time was compressed and the simulated Earth did not exactly duplicate what the Apollo 8 astronauts saw.\nFriday's video release addressed those issues and more.\n\"The Earthrise visualization that we released for Earth Day last year really only scratched the surface,\" Wright said in a NASA interview. \"The new visualization tells us not only what time the photos were taken, but also exactly which way the [Apollo 8] spacecraft was pointing and therefore which window each photo was taken from.\"\n\"This [is] also the first time we've released a video that's synchronized with the audio recording of the astronauts,\" he added.\nWright credits both the precise modern data from LRO and archival photos from the 1968 mission for making the new simulation possible.\n\"The key to the new work is a set of vertical stereo photos taken by Apollo 8,\" Wright said. \"A camera was mounted in the rendezvous window that pointed straight down onto the lunar surface [and] it took a picture every 20 seconds. When the spacecraft rotated, so did the images.\"\n\"By registering each photo to a model of the terrain from LRO data, we can nail down the timing of the spacecraft's rotation,\" he said.\nTo make the new simulation as faithful as possible, Wright also used the Apollo 8 flight plan, the onboard recording of the astronauts voices, data on the optical properties and mounting of the Hasselblad cameras, and the dimensions and angles of the command module windows.\nA Dec. 24, 1968 map of the Earth from the Environmental Science Services Administration 7 satellite helped Wright recreate the planet's cloud patterns to match the images taken from the moon that day.\nFor Chaikin, who narrates the new simulation and who has studied and written extensively about the Apollo missions, the details revealed by the video are amazing.\n\"It never occurred to me that the spacecraft was nose-down when the Earthrise happened, or that it was actually still rotating as part of Borman's roll maneuver,\" Chaikin told collectSPACE. \"But that explains why Anders was the first one to see it — the timing was just perfect for the Earth to appear in his right-hand window just as it was first peeking above the moon's horizon.\"\n\"It just proves what I have long realized,\" Chaikin added, \"there's always more to discover about Apollo!\""
    },
    {
      "url": "http://www.collectspace.com/news/news-041821a-apollo-13-statue-lovell-haise-space-center-houston.html",
      "text": "advertisements\n|\n|\nApollo 13 astronauts raise a toast to their recovery with new statue\nApril 18, 2021 — Fifty-one years to the day after they survived an explosion on the way to the moon, astronauts Jim Lovell and Fred Haise came face-to-face with their post-splashdown selves in Houston.\nThe two Apollo 13 crewmates celebrated the 51st anniversary of their safe return to Earth by toasting the installation of a life-size sculpture capturing the moment they stepped off a Navy helicopter onto an aircraft carrier, marking their successful recovery on April 17, 1970. The painted bronze statue first debuted at Space Center Houston in February, but Saturday (April 17) marked its formal dedication.\nLooking up at their sculpted selves, Lovell and Haise reflected on the day when their ill-fated moon landing mission came to an end.\n\"I think the greatest feeling was when we hit the water and water splashed over the window, and I looked at Fred and said, 'Hey, I think we made it,'\" Lovell said with a laugh, recalling their splashdown aboard the Apollo 13 command module \"Odyssey.\"\n\"Specifically to me, that day was nice to be in a South Pacific environment,\" said Haise. \"When the diver opened the hatch, it was amazing that the capsule, after all of that, through the re-entry, was still cold. Frosty air poured out of the capsule when they opened the hatch.\"\n\"I was not feeling very well, despite my smiling face,\" Haise recalled, referencing the happy expression on his statue. \"I had a urinary tract infection. I had chills and a fever. And I missed the big party on the ship. They had a cake and ice cream with the crew on the hangar deck and I went to sick bay. I was happy to have that successful landing after a lot of challenges to getting us back.\"\nThe splashdown concluded the six-day Apollo 13 mission, which famously \"had a problem.\" An oxygen tank in the spacecraft's service module exploded, changing the mission from one of landing on the moon to getting commander Lovell, lunar module pilot Haise and command module pilot Jack Swigert safely home. (Swigert died of cancer in 1982 at age 51.)\nThat job fell to the teams of flight controllers in Mission Control at NASA's Manned Spacecraft Center (today Johnson Space Center) in Houston.\n\"In some aspects, it was a better ending with regards to what we learned and the ability of NASA to complete or save missions,\" said Lovell. \"And that's what that statue stands for. If people look at that statue, it is really the recovery of Apollo 13 by a group of people on the ship and in Mission Control.\"\nJoining Lovell and Haise at Space Center Houston for the anniversary were three of the four flight directors who led Mission Control during Apollo 13: Milt Windler, Gerry Griffin and Gene Kranz. (The fourth, Glynn Lunney, died a month earlier on March 19.)\n\"We never thought about not getting them back. In fact, we never discussed it. We were going to get them back,\" said Griffin. \"So when we finally got them back down on the [aircraft] carrier, that's when you saw a lot of celebration going on and a bunch of tired guys.\"\nFor Kranz, all of the lessons that were learned through flying the Mercury and Gemini missions, as well as the early Apollo flights, led up to what they were faced with 51 years ago.\n\"Thirteen was really where it came together,\" Kranz said. \"We knew we were a team that was very capable of stepping up to managing and responding to any crisis we might find ourselves in. It was a marvelous example of the teamwork between the support teams and Mission Control to find the solutions to bring them home.\"\nThe statue was created by Colorado-based sculptors and brothers George and Mark Lundeen, working with fellow artist Joey Bainer. Funded by The Grainger Foundation of Lake Forest, Illinois, the project was presented to Space Center Houston by documentary filmmaker Steven Barber. The photo-realistic mural of the Sea King helicopter was created by Houston graphic designer Blake Dumesnil for Space Center Houston.\n\"I think it's a great replica,\" said Haise of the display. \"I am not the artist-type, so it is amazing to me that they can do it that well, even including the helicopter and the platform we walked off of. That was very well done.\"\nLovell agreed that the statue was \"really fantastic.\"\n\"It has a story for the future people coming in here, especially the astronauts we do not know yet, those who will come in the years ahead,\" he said. \"I think it tells the story of the cooperation between the various aspects of NASA and the space industry to do the missions they were designed to do and how they work together to complete them.\" |\n|\nApollo 13 astronauts Jim Lovell and Fred Haise are joined by family members and flight directors Gerry Griffin, Milt Windler and Gene Kranz in a toast to the 51st anniversary of their splashdown and the installation fo a statue celebrating of their recovery at Space Center Houston on Saturday, April 17, 2021. (collectSPACE)\nApollo 13 crewmates Jim Lovell and Fred Haise strike the poses of their new statues at Space Center Houston. (collectSPACE)\nFrom left to right: Apollo 13 flight director Gerry Griffin, commander Jim Lovell, flight director Gene Kranz, flight director Milt Windler and lunar module pilot Fred Haise at Space Center Houston, April 17, 2021, 51 years after the Apollo 13 splashdown. (collectSPACE) |\nApollo 13 astronauts Jim Lovell (at left) and Fred Haise pose with the statues at Space Center Houston on Saturday, April 17, 2021. (collectSPACE) |\n|\n© 1999-2025 collectSPACE. All rights reserved.\n|\n|\n|\n|"
    }
  ],
  "argos_summary": "James Lovell, the commander of NASA's Apollo 13 mission and a key figure in the first moon landing, passed away at the age of 97. Lovell's career included four spaceflights, notably Apollo 8, which was the first crewed mission to orbit the moon, and Apollo 13, which became a harrowing survival story after an in-flight explosion. He was celebrated for his leadership and contributions to space exploration, receiving numerous awards and honors throughout his life, including the Presidential Medal of Freedom.",
  "argos_id": "OD4H7F875"
}