{
  "url": "https://www.pcmag.com/news/uber-received-400000-sexual-assault-complaints-between-2017-and-2022",
  "authorsByline": "Jibin Joseph",
  "articleId": "ceb5f5453f2d48db8f3fc901d542817e",
  "source": {
    "domain": "pcmag.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.pcmag.com/imagery/articles/06Y8gyfQy6Tt1m7eS13d13c-1.fit_lim.size_1200x630.v1754640393.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T10:06:07+00:00",
  "addDate": "2025-08-08T10:16:46.994784+00:00",
  "refreshDate": "2025-08-08T10:16:46.994786+00:00",
  "score": 1.0,
  "title": "Uber Received 400,000 Sexual Assault Complaints Between 2017 and 2022",
  "description": "That's one every eight minutes.",
  "content": "Ride-hailing service Uber received 400,181 reports of sexual misconduct between 2017 and 2022, according to sealed court documents viewed by The New York Times .\n\nThese documents are part of a mass class-action lawsuit filed against Uber. Per , over 1,600 cases were merged into one earlier this year, and hundreds of customers accused Uber of improper driver background checks, failure to report incidents to the police, and letting sex offenders stay on the platform.\n\nIn its biennial safety reports between 2017 and 2022, Uber has only disclosed 12,522 of these incidents. Clarifying the discrepancy, the company's US safety head Hannah Niles said that a vast majority of the reported 400,000+ cases are unaudited and don't necessarily qualify as sexual assault. Many of the actions reported are less serious and non-physical in nature, \"such as comments about someone's appearance, flirting, staring, or inappropriate language.\"\n\nOver the years, Uber has released a wide range of features to improve safety for both riders and drivers (image below). Most recently, it began testing a \" women preferences \" feature in Los Angeles, San Francisco, and Detroit. It lets female riders match with female drivers, and vice-versa.\n\nHowever, the extent of safety provided by these features is unclear.\n\nNiles cited a study claiming over half of women in the US have experienced sexual violence in their lifetimes, and stated that the company \"is not immune to this deeply ingrained and troubling problem.\"\n\nNiles also mentioned that 6.3 billion trips were completed in the US between 2017 and 2022, and the reported cases only account for 0.006% of those. However, \"there is no 'tolerable' level of sexual assault,\" she tells the NYT .\n\nUber has already settled many of these sexual assault cases individually, but as reported by the NYT , its first trial for a sexual assault case is set to begin in September this year.",
  "medium": "Article",
  "links": [
    "https://www.pcmag.com/terms",
    "https://www.pcmag.com/news/uber-tests-matching-female-riders-with-female-drivers-for-added-safety",
    "https://www.pcmag.com/news/uber-aims-to-simplify-ride-hailing-for-older-riders-with-senior-accounts",
    "https://www.pcmag.com/news/nhtsa-closes-14-month-investigation-into-waymo-collisions",
    "https://www.uber.com/newsroom/ubers-safety-record/",
    "https://www.pcmag.com/news/1-year-of-google-ai-pro-is-now-free-for-college-students-heres-how-to-get",
    "https://www.pcmag.com/authors/jibin-joseph",
    "https://www.latimes.com/california/story/2025-03-12/9th-circuit-uber-sex-assault-lawsuits",
    "http://www.apple.com",
    "https://www.pcmag.com/news/sports-streaming-services-from-espn-and-fox-go-head-to-head-on-the-same",
    "https://www.linkedin.com/in/jibin-joseph-b9587a47",
    "https://www.pcmag.com/news/ftc-sues-uber-one-subscription-sign-up-tricks-difficult-cancellation-process",
    "https://www.pcmag.com/privacy",
    "https://www.pcmag.com/news/no-apple-doesnt-own-apple-cinemas-which-just-got-sued-for-brand-dilution",
    "https://www.pcmag.com/news/uber-thousands-of-users-have-reported-sexual-assaults-on-rides",
    "https://www.cdc.gov/sexual-violence/about/index.html",
    "https://twitter.com/4ibin",
    "https://www.pcmag.com/news/sonos-confirms-tariff-driven-price-hikes-are-coming-later-this-year",
    "https://www.nytimes.com/2025/08/06/business/uber-sexual-assault.html",
    "https://www.pcmag.com/news/trumps-truth-social-tests-ai-search-engine-powered-by-perplexity"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "sexual assault",
      "weight": 0.113368295
    },
    {
      "name": "sexual misconduct",
      "weight": 0.09656287
    },
    {
      "name": "sexual violence",
      "weight": 0.096232
    },
    {
      "name": "Uber",
      "weight": 0.08614925
    },
    {
      "name": "improper driver background checks",
      "weight": 0.07756606
    },
    {
      "name": "female drivers",
      "weight": 0.07540695
    },
    {
      "name": "a sexual assault case",
      "weight": 0.07245495
    },
    {
      "name": "these sexual assault cases",
      "weight": 0.07245495
    },
    {
      "name": "safety",
      "weight": 0.072096854
    },
    {
      "name": "sealed court documents",
      "weight": 0.07151431
    }
  ],
  "topics": [
    {
      "name": "Crime"
    },
    {
      "name": "Violence"
    },
    {
      "name": "Ridesharing"
    }
  ],
  "categories": [
    {
      "name": "General"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97900390625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.86865234375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.65966796875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.546875
    },
    {
      "name": "/News/Other",
      "score": 0.33642578125
    },
    {
      "name": "/News/Technology News",
      "score": 0.31787109375
    }
  ],
  "sentiment": {
    "positive": 0.084106445,
    "negative": 0.59814453,
    "neutral": 0.31811523
  },
  "summary": "Uber, a ride-hailing service, received 400,181 reports of sexual misconduct between 2017 and 2022, according to sealed court documents. These reports are part of a mass class-action lawsuit filed against Uber, which accuses the company of improper driver background checks, failure to report incidents to the police, and allowing sex offenders to stay on the platform. However, Uber's US safety head, Hannah Niles, clarified that many of the cases are unaudited and do not necessarily qualify as sexual assault. Many of these actions are non-physical in nature, such as comments about someone's appearance, flirting, staring, or inappropriate language. The company has already settled many of these cases individually, but its first trial for a sexual assault case is set to begin in September.",
  "shortSummary": "Uber received 400,181 reports of sexual misconduct between 2017 and 2022, though many categories are unaudited and may not constitute sexual assault.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "96a600a7409c461fb67324a3159e156f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/california/story/2025-03-12/9th-circuit-uber-sex-assault-lawsuits",
      "text": "More than 1,600 sexual assault cases against Uber merged in far-reaching court ruling\n- Share via\n- Uber said the fine print of its user agreement blocked the government from consolidating riders’ civil suits.\n- The 9th Circuit Court of Appeals disagreed, allowing the more than 1,600 cases to continue in San Francisco before a single judge.\n- The precedent-setting case limits how apps indemnify themselves against lawsuits.\nThe U.S. 9th Circuit Court of Appeals has ruled that more than 1,600 sexual assault cases against Uber will be allowed to continue before a single San Francisco judge, a move with far-reaching implications for the ride-hailing app and its cohort in Silicon Valley.\nThe decision issued Monday upholds an earlier ruling by a council of federal judges appointed to centralize civil suits from across the country.\nExperts said the litigation is being followed closely by home-sharing platforms, dog-walking services and other “independent-contractor” apps, which have also been hit with stacks of sexual assault liability claims, along with Uber’s main competitor, Lyft.\nUber argued that a four-year-old clause in the fine print of its user agreement barred riders from joining any mass lawsuit against the platform.\nConservative Justice Samuel A. Alito Jr. lambasted the 9th Circuit Court over its decision upholding a judgment for the family of a man killed by police.\nHundreds of rape survivors claim the tech giant skimped on driver background checks, failed to report sexual violence to police and allowed sex offenders to drive for the company — all while banking millions in “rider safety fees.”\nThe appellate court said federal law trumps Uber’s terms of use agreement, which U.S. District Judge Charles Breyer of California’s Northern District had previously deemed “unenforceable.”\nJudge Lucy Haeran Koh wrote in the higher court’s decision that 50 years of precedent stood against the type of reversal sought by the ride-sharing app, with not “a single instance” on the record to justify blocking what’s known as “centralization.”\n“Uber has not convinced us that we should be the first,” the judge wrote.\nExperts said the ruling marks a legal line in the sand for agreements that app users must accept before ordering takeout, posting a thirst trap, borrowing an ebook or viewing their lab results. The lengthy waivers are unavoidable, and have become ever-more-indemnifying, experts said.\n“Most people don’t even read those terms of use,” said Lindsay Nako, executive director of Impact Fund, a social justice litigation group — yet the click-to-agree contracts tightly control what happens if they’re injured.\nUber did not respond to requests for comment, but in its appeal to the 9th Circuit, the platform’s attorneys argued that a “non-consolidation clause” in its terms of use was actually better for plaintiffs because it ensured each case would be heard on its own merits rather than in one clearinghouse proceeding.\nAppellate court says Grindr is immune in teen-versus-tech child sex trafficking lawsuit, citing Section 230 rules\n“The terms of use allow plaintiffs to have their day in court,” Uber’s lawyers wrote. “Plaintiffs simply agreed to do that individually.”\nBut Nako and others tracking the case said that if Uber could easily unwind cases the government binds together, other big companies would write identical provisions into their own terms of use, tangling federal civil courts in endless duplicative lawsuits — making it much harder for victims to collect damages.\nBy blocking the clause, the experts said, the court preserved rights most users never realize they’ve been asked to give away.\n“It’s a great win for consumers and a bad day for tech companies,” said Kathryn Kosmides, an advocate at Helping Survivors, a partnership between victims’ advocates and personal injury lawyers. “This latest ruling sets precedent around app safety. A lot of companies are very nervous about what happens [next] in this case.”\nIn one sense, the ruling is simple: By siding with survivors and the judge panel, the 9th Circuit affirmed the court’s right to manage its own business. Combining alike cases saves taxpayers money, helps ease court backlogs and avoids precedent-setting decisions that may be in conflict, Koh wrote in her decision.\nIt also is common. About 70% of federal civil action is currently adjudicated as part of a multidistrict case, Breyer estimated.\n“It’s a mind-bogglingly huge number,” Nako said of the multidistrict caseload.\nAdvocates say arguing a single case in a single courthouse is easier and cheaper than arguing hundreds in courtrooms across the country. It’s also good for plaintiffs, who largely seek the same sets of documents from the companies they sue.\nConsolidated litigation can make it easier for plaintiffs to prove the wrongdoings they allege are systemic, experts said. Companies that lose or settle such cases are more likely to have to change how they operate, rather than simply paying out.\nJohnson & Johnson stopped using talc in its baby powder in 2023, after a multidistrict case that unearthed records showing the company knew its ingredient tested positive for asbestos, a carcinogen, for half a century. The company says its baby powder has always been safe and doesn’t cause cancer.\nThe 9th Circuit is no longer the venue of choice for challenges to Donald Trump’s agenda — in large part due to his first-term efforts to remake a court he called ‘disgraceful.’\nA consolidated suit against Oxycontin-maker Purdue, widely considered the engine of the opioid crisis, resulted in the largest award for damages in American history.\nIn Uber’s case, a loss could mean having to beef up background checks, tighten rules around who can contract to pick up passengers, drop drivers reported for misconduct, and install cameras to record every ride, among other changes.\nSuch changes would be expensive and potentially unpopular. But they aren’t the only outcome the ride-hailing app is trying to avoid.\nCentralized cases can unearth huge troves of evidence that would never otherwise be part of the public record. Uber has been fighting for months to avoid discovery in California’s Northern District while the appellate court weighed whether the case could stay there.\n“Does Uber want this data they had about sexual assaults becoming public? Hell no!” Kosmides said.\nNow that the 9th Circuit has rejected its appeal, “there is no incentive to take this through discovery and to a courtroom with a jury, because ultimately in civil litigation, discovery becomes public,” she said.\n“I think we will see more of those being pursued,” Kosmides said."
    },
    {
      "url": "https://www.cdc.gov/sexual-violence/about/index.html",
      "text": "Key points\n- Sexual violence is a significant problem in the United States.\n- Sexual violence has a profound impact on lifelong health, opportunity, and well-being.\nWhat is sexual violence?\nSexual violence is sexual activity when consent is not obtained or freely given. It impacts every community and affects both sexes and people of all sexual orientations and ages. Anyone can experience or perpetrate sexual violence.\nThe perpetrator of sexual violence is usually someone the survivor knows. This can include a friend, current or former intimate partner, coworker, neighbor, or family member. Sexual violence can occur in person, online, or through technology. This includes posting or sharing sexual pictures of someone without their consent, or non-consensual sexting.\nQuick facts and stats\nResearchers know the numbers underestimate this problem because many cases are unreported. Survivors may be ashamed, embarrassed, or afraid to tell the police, friends, or family about the violence. Victims may also keep quiet because they have been threatened or do not think anyone will help them.\nSexual violence is common:\n- Over half of women and almost one in three men have experienced sexual violence involving physical contact during their lifetimes. 1\n- One in four women and about one in 26 men have experienced completed or attempted rape.1\n- About one in nine men were made to penetrate someone during his lifetime. 1\n- One in three women and about one in nine men experienced sexual harassment in a public place.1\nSexual violence starts early:\n- More than four in five female rape survivors reported that they were first raped before age 25 and almost half were first raped as a minor (i.e., before age 18). 1\n- Nearly eight in 10 male rape survivors reported they were made to penetrate someone before age 25 and about four in 10 were first made to penetrate as a minor.1\nSome groups are affected more than others. Women and racial and ethnic minority groups experience a higher burden of sexual violence.12345 For example, more than two in five non-Hispanic American Indian or Alaska Native and non-Hispanic multiracial women were raped in their lifetime.1\nSexual violence is also costly. Recent estimates put the lifetime cost of rape at $122,461 per survivor, including medical care, lost productivity from work, and criminal justice costs.6\nOutcomes\nSome consequences are physical, like bruising and genital injuries, sexually transmitted infections, and pregnancy (for women). Some consequences are psychological, such as depression, anxiety, and suicidal thoughts.7\nThe consequences may be chronic. Survivors may suffer from post-traumatic stress disorder and experience recurring reproductive, gastrointestinal, cardiovascular, and sexual health problems.7\nSexual violence is also linked to negative health behaviors. Sexual violence survivors are more likely to smoke, abuse alcohol, use drugs, and engage in risky sexual activity.8\nThe trauma from sexual violence may impact a survivor's employment. This refers to time off from work, diminished performance, job loss, or inability to work. These issues disrupt earning power and have a long-term effect on the economic well-being of survivors and their families. Coping and completing everyday tasks after victimization can be challenging. Survivors may have difficulty maintaining personal relationships, returning to work or school, and regaining a sense of normalcy.7\nSexual violence is also connected to other forms of violence. For example, girls who have been sexually abused are more likely to experience additional sexual violence. They are also more likely to become victims of intimate partner violence in adulthood. Bullying perpetration in early middle school is linked to sexual harassment perpetration in high school.9\nPrevention\nSexual violence can be prevented. Certain factors my increase or decrease the risk of perpetrating or experiencing sexual violence.\nPreventing sexual violence requires understanding and addressing the factors that put people at risk for or protect them from violence. We must also understand how historical trauma and structural inequalities impact health.1\nChanging social norms, teaching skills, empowering girls and women, and creating protective environments can help prevent and reduce sexual violence. We all have a role to play in prevention.\n- Basile KC, Smith SG, Kresnow M, Khatiwada S, & Leemis RW. (2022). The National Intimate Partner and Sexual Violence Survey: 2016/2017 Report on Sexual Violence. Atlanta, GA: National Center for Injury Prevention and Control, Centers for Disease Control and Prevention.\n- Basile KC, Breiding MJ, Smith SG. (2016). Disability and risk of recent sexual violence in the United States. American journal of public health, 106(5):928-33\n- Thurston, A. M., Stöckl, H., & Ranganathan, M. (2021). Natural hazards, disasters and violence against women and girls: A global mixed-methods systematic review. BMJ Global Health, 6(4), e004377. https://www.doi.org/10.1136/bmjgh-2020-004377\n- National Sexual Violence Resource Center. (2021) Sexual Violence in Disasters. https://www.nsvrc.org/sites/default/files/2021-11/sexual_violence_in_disasters_final508_0.pdf\n- Deering, K. N., Amin, A., Shoveller, J., Nesbitt, A., Garcia-Moreno, C., Duff, P., ... & Shannon, K. (2014). A systematic review of the correlates of violence against sex workers. American journal of public health, 104(5), e42-e54.\n- Peterson C, DeGue S, Florence C, Lokey C. (2017). Lifetime Economic Burden of Rape in the United States. American Journal of Preventive Medicine 52(6): 691-701.\n- Basile KC and Smith SG. (2011). Sexual Violence Victimization of Women: Prevalence, Characteristics, and the Role of Public Health and Prevention. American Journal of Lifestyle Medicine (5): 407-417.\n- Basile KC, Clayton HB, Rostad WL, & Leemis RW. (2020). Sexual violence victimization of youth and health risk behaviors. American Journal of Preventive Medicine, 58(4), 570-579.\n- Espelage DL, Basile KC, Hamburger ME. (2012). Bullying perpetration and subsequent sexual violence perpetration among middle school students. Journal of Adolescent Health 50(1): 60-65."
    },
    {
      "url": "https://www.uber.com/newsroom/ubers-safety-record/",
      "text": "Uber’s record on safety is clear\nWritten byA recent article has made startling claims suggesting that Uber has turned a blind eye to the safety of passengers and drivers. Nothing could be further from the truth. Safety is a core value at Uber, and we have invested billions of dollars and countless hours to reduce safety incidents during trips, particularly when it comes to sexual misconduct and assault.\nThe challenge is enormous, but I believe Uber has done more than any other company to confront it. More than half of women in the US have experienced sexual violence in their lifetimes. Uber is not immune to this deeply ingrained and troubling problem—it persists across all parts of life and modes of transportation—but that hasn’t stopped us from continually strengthening our technology, policies, and procedures to improve safety.\nOur approach is making a difference: reports of serious sexual assault on Uber have fallen by 44%.* We were the first—and, unfortunately, still one of the only—companies to publish this kind of data publicly, because we believe in transparency and want to be held accountable for progress.\nSome have asked why we haven’t been able to stop more bad things from occurring. With more than a billion Uber trips happening every month, safety incidents will happen too, even if they are exceptionally rare. But rare doesn’t mean acceptable. That’s why we’re constantly working to make every trip safer.\nWe believe Uber is one of the safest ways to get from A to B, with more than 99.9% of trips ending without any issue. But you won’t hear us say our work on safety is done, or that we get it right every time. That’s why we’ll continue to listen to feedback, push harder, and innovate more to make every trip better, every single day.\nUber has led the way on safety, innovating and improving across a range of areas:\nIs it true that Uber hid data on 400,000 sexual assaults on its platform?\nNo. As part of an ongoing lawsuit, Uber provided data on the total number of trips with reports of sexual assault or misconduct submitted by riders, drivers and third parties over the course of 6 years from 2017 to 2022.\nFirst and foremost, the vast majority of the reports cited were less serious and non-physical in nature and did not fall into the category of sexual assault—such as comments about someone’s appearance, flirting, staring, or inappropriate language.\nFurthermore, most of the approximately 400,000 reports are unaudited, meaning they haven’t gone through the same rigorous vetting process as the data included in our Safety Reports. That process accounts for incorrect and mistakenly categorized reports, as well as false reports submitted with the goal of getting a refund (which unfortunately does happen).\nFinally, these reports were exceptionally rare: during that same time period, 6.3 billion Uber trips took place in the United States, meaning all of the reports amounted to just 0.006% of total trips. The most serious reports were even rarer, at 0.00002%, or 1 in 5 million, of all trips.\n.\nIt’s not an exaggeration to say that Uber has been more transparent on the issue of sexual assault than any other corporation. We have always felt the first step to addressing the problem is by talking openly about it and bringing data to bear. That’s why we put out a first-of-its-kind Safety Report in 2019, and have since published two more.\nWhen we set out to publish our first report, we found there was no common way to categorize reports from drivers and riders about these types of incidents. So we worked with experts to create one, which includes 21 categories.\nWe publicly report on the 5 most serious categories of sexual assault reports. That’s because those categories are the least subjective, meaning we can have a high degree of confidence in the data. Less serious reports—like flirting, staring, or making inappropriate comments—are more subjective, often less detailed, and harder to consistently categorize.\nIt’s important to say that just because we don’t publicly disclose a certain type of report doesn’t mean we don’t do anything with them. On the contrary, we track feedback closely and if, for example, we receive multiple safety reports, even if they are less serious, we will take swift action to ban that driver or rider from Uber.\nWhat is S-RAD and why don’t you use it to predict and prevent high-risk trips on your platform?\nFor the past several years, we have used data to inform our trip matching algorithm in an attempt to make better matches between drivers and riders. This technology is internally called Safety Risk Assessed Dispatch, or S-RAD.\nHere’s an example of how this technology works: if a brand-new rider requests a late-night trip in an area known for nightlife, our matching algorithm may prioritize more experienced drivers with a strong record of late-night trips and positive rider feedback.\nWhile S-RAD (and indeed anyone) cannot reliably predict crimes before they happen, we’ve found prioritizing better matches can help avoid interpersonal conflicts. In fact, this technology has helped to reduce sexual assault and misconduct report rate by 10% since it launched, part of the overall drop of 44% from 2017-2022.\nWhile S-RAD is an important tool in our toolkit, it’s not a silver bullet. It can only go so far because the overall rate of serious incidents is so low (1 in 5,000,000 for the most serious) and human behavior is inherently unpredictable. So while it can reduce incidents in the aggregate, it cannot reliably predict whether an individual pairing or trip will result in an incident or not.\nS-RAD does not flag “high risk” drivers but rather works to improve the trip pairing to reduce the chances of interpersonal conflict between the driver and rider. S-RAD evaluates trip pairings at a detailed level, because these are extraordinarily rare incidents that we are trying to make even rarer. The fact we are evaluating risk at such a granular level is a testament to the broad suite of technology and policies we have in place.\nUnilaterally blocking certain types of trips that the technology may consider more risky, like all requests from bars late at night, would leave many people stranded on the street, encouraging them to drive drunk or walk home unsafely. Instead, we seek to prioritize better matches to reduce overall risk.\nUber claims to be on the side of survivors, so why are you fighting them in court?\nIt’s important to emphasize the difference between the litigation process, which is adversarial by design, and Uber’s internal process when a sexual assault is reported to us. Our internal processes were developed with input from safety experts and are designed to be survivor-centric. We rely heavily on the survivor’s statement of experience, which we take at face value. Unlike the court system, we do not require proof of the incident in order to take action or provide support. And we have a dedicated hotline and resources fund for sexual assault survivors, in partnership with experts at RAINN.\nThe court cases we are currently engaged in (one of which gave rise to this article) are the result of Uber having been one of the first companies to waive mandatory arbitration for individual claims of sexual misconduct. We understood at the time that taking such a step could open the door to mass lawsuits. We still feel strongly it was the right thing to do, because we wanted to give survivors control over how they pursue their claims—whether privately in mediation or arbitration, or publicly in open court. All of the plaintiffs in this case chose open court. Just as plaintiffs have a right to make their case, the defense has a right to investigate and respond to those claims.\nDon’t comments from Uber’s own employees indicate the company doesn’t take safety seriously?\nNo. A handful of internal messages from several years ago, taken completely out of context, are simply not representative of how seriously we take the issue of safety. We have invested billions of dollars over the years in this area, and have thousands of people who work on safety, day in and day out.\n*From 2017 through 2022. See our latest Safety Report."
    }
  ],
  "argos_summary": "Uber faced scrutiny after sealed court documents revealed over 400,000 reports of sexual misconduct from 2017 to 2022, part of a class-action lawsuit involving more than 1,600 cases. The company disclosed only 12,522 incidents in its safety reports, with most reports being non-physical in nature. Despite Uber's claims of improving safety through various features, the upcoming trial and the court's decision to allow the consolidation of cases could lead to significant changes in its operational practices.",
  "argos_id": "OKQ7ZSDQ9"
}