{
  "url": "https://www.latimes.com/world-nation/story/2025-08-08/there-wont-be-an-invasion-sheinbaum-confident-washington-wont-strike-cartels-in-mexico",
  "authorsByline": "Patrick J. McDonnell",
  "articleId": "7e8f248c1c414f888ece2e7abf58243f",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/7943ef2/2147483647/strip/true/crop/1400x735+0+83/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F76%2F25%2F9d13d5414037bc41e5e94374f5f7%2F2-pack-mex-usa.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T21:07:14.363000+00:00",
  "addDate": "2025-08-08T21:10:56.328152+00:00",
  "refreshDate": "2025-08-08T21:10:56.328154+00:00",
  "score": 1.0,
  "title": "'There will be no invasion.' Sheinbaum confident Washington won't strike cartels in Mexico",
  "description": "Says new Trump directive won't result in U.S. strike on Mexico",
  "content": "President Trump has authorized U.S. military action against drug cartels. Mexican President Claudia Sheinbaum said Friday that Mexico would not accept U.S. troops on Mexican soil\n\nU.S. military forces will not strike Mexico, President Claudia Sheinbaum vowed Friday in response to reports that President Trump has secretly directed the Pentagon to take action against Latin American drug cartels.\n\n“There will be no invasion: That is rejected, absolutely rejected,” an emphatic Sheinbaum told reporters at her regular morning news conference. “The United States is not going to come to Mexico with troops.”\n\nThe media accounts, originating in the New York Times, revived nationalist fears in a nation that has suffered historic U.S. invasions and land grabs —though none in more than a century.\n\nPresident Sheinbaum said that Mexico had been informed that Trump was issuing such an order, but that “it has nothing to do with Mexican territory.”\n\nThe Mexican leader repeated her oft-stated mantra that Mexico “cooperates and collaborates” with its northern neighbor on drug-trafficking and other bilateral issues, but rejects any U.S. military presence or strikes on Mexican soil.\n\nIn May, Sheinbaum said she had rebuffed Trump’s offer—made in one of many telephone calls between the two leaders — of direct U.S. military assistance.\n\n“We can share information, but we will never accept the presence of the United States Army on our territory,” Sheinbaum said she informed Trump in May. “Our territory is inalienable, sovereignty is inalienable.”\n\nIt’s unclear what countries might be a target for a U.S. operation, but in an interview Thursday with on the Eternal Word Television Network, Secretary of State Marco Rubio noted that, aside from Mexico, there are cartels in Venezuela, Guatemala and Ecuador.\n\nRubio said cartels were no longer just a law enforcement issue, but a national security issue. “We cannot continue to just treat these guys as local street gangs,” he said. “They have weaponry that looks like what terrorists, in some cases armies, have.”\n\nIn Mexico, fears that U.S. forces may strike Mexican territory have been growing since the Trump administration formally labeled six Mexican cartels as foreign terrorist organizations. Many in Mexico view the designation as a prelude to unilateral Pentagon attacks on purported cartel targets.\n\nTrump has been complimentary of Sheinbaum, but has denounced what he labels an “intolerable alliance” between Mexico’s government and organized crime.\n\nSheinbaum has rejected U.S. allegations that organized crime permeates Mexico’s government and controls vast swaths of Mexican territory.\n\nTrump has already imposed 25% tariffs on many imports from Mexico — Washington’s leading trading partner — in a bid to force authorities here to do more to curb the trafficking of fentanyl, the synthetic opioid blamed for tens of thousands of deaths in the United States.\n\nThe Trump administration has also ramped up U.S. surveillance flights over and near Mexican territory and has massed U.S. troops on the Southwest border in an effort to crack down on drug smuggling and unauthorized immigration.\n\nBut Mexico is not the only nation where the Pentagon might consider striking drug cartels. Venezuela could also find itself in U.S. military cross-hairs as Washington amps up its saber-rattling against the South American nation.\n\nOn Thursday the Trump administratation said it was doubling its existing reward—to $50 million—for information leading to the arrest and/or conviction of Venezuelan President Nicolás Maduro, a long-time adversary who faces drug-trafficking charges in the United States.\n\nThe State Department calls Maduro a “leader” of the Venezuelan-based Cartel de los Soles, which the Trump administration has labeled a terrorist group.\n\nWashington also accused Maduro of links to Mexico’s Sinaloa cartel, which is among the crime syndicates that the Trump administration has labeled a foreign terrorist organization.\n\nOn Friday, Sheinbaum told reporters that Mexican authorities had seen no evidence connecting Maduro to the Sinaloa mob.\n\nVenezuelan authorities dismissed the U.S. charges against Maduro as “political propaganda.”\n\nMaduro returned to office in January after declaring victory in a 2024 election that critics called rigged and was widely rejected by the international community. Washington does not recognize Maduro as Venezuela’s president.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/world-nation/story/2025-04-25/the-united-states-is-the-villain-of-our-story-nationalism-surges-in-mexico-amid-trump-threats",
    "https://www.latimes.com/world-nation/story/2025-07-31/tariffs-on-mexico-delayed-90-days",
    "https://www.latimes.com/world-nation/story/2025-05-03/trump-wants-to-send-u-s-troops-into-mexico-to-fight-drug-cartels-sheinbaum-says",
    "https://www.state.gov/releases/office-of-the-spokesperson/2025/08/secretary-of-state-marco-rubio-with-raymond-arroyo-of-ewtns-the-world-over",
    "https://www.latimes.com/world-nation/story/2025-07-16/case-of-el-chapo-son-cooperating-with-u-s-prosecutors-roils-mexico",
    "https://www.latimes.com/world-nation",
    "https://www.latimes.com/world-nation/story/2025-06-26/mexico-disputes-u-s-money-laundering-charges-against-mexican-banks-allegedly-linked-to-fentanyl-trafficking",
    "https://www.latimes.com/world-nation/story/2025-06-16/immigrant-protests-violence-reverberate-in-mexico"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. military action",
      "weight": 0.08991762
    },
    {
      "name": "U.S. military forces",
      "weight": 0.089579664
    },
    {
      "name": "Mexican President Claudia Sheinbaum",
      "weight": 0.089052446
    },
    {
      "name": "U.S. military cross",
      "weight": 0.08803416
    },
    {
      "name": "U.S. troops",
      "weight": 0.085718855
    },
    {
      "name": "President Trump",
      "weight": 0.08450123
    },
    {
      "name": "U.S. forces",
      "weight": 0.084175944
    },
    {
      "name": "direct U.S. military assistance",
      "weight": 0.08308643
    },
    {
      "name": "U.S.",
      "weight": 0.082775146
    },
    {
      "name": "U.S. allegations",
      "weight": 0.08192751
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.990234375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.92822265625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.90380859375
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.82177734375
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.78466796875
    },
    {
      "name": "/News/World News",
      "score": 0.65966796875
    }
  ],
  "sentiment": {
    "positive": 0.06237793,
    "negative": 0.71484375,
    "neutral": 0.22253418
  },
  "summary": "Mexican President Claudia Sheinbaum has stated that Mexico will not accept U.S. troops on Mexican soil, despite reports that President Trump has ordered military action against Latin American drug cartels. This has raised nationalist fears in Mexico, where has seen historic US invasions and land grabs. The Mexican leader denied that Mexico had been informed of the order, stating it has nothing to do with Mexican territory. Sheinba also refuted allegations that organized crime controls vast swaths of Mexican territory and denied any U.K. military assistance. The Trump administration has labelled six Mexican cartels as foreign terrorist organizations and has imposed 25% tariffs on many imports from Mexico in a bid to force authorities to do more to curb the trafficking of fentanyl.",
  "shortSummary": "Mexican President Claudia Sheinbaum rejects any U.S. military intervention in Mexico, rejecting President Trump’s orders targeting drug cartels, despite Washington's recent actions against Venezuela.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8255df31057c4e1f92944eb15593fd0a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/world-nation/story/2025-07-31/tariffs-on-mexico-delayed-90-days",
      "text": "New Trump tariffs on Mexico delayed 90 days as trade talks continue\n- Share via\n- President Trump and Mexican President Claudia Sheinbaum said their two nations would continue negotiations on the contentious levies.\n- The postponement comes as nations across the globe scramble to make deals with the Trump administration.\n- Trump had said new tariffs would take effect Friday and that there would be no exceptions.\nMEXICO CITY — The presidents of Mexico and the United States said Thursday that punishing new tariffs on Mexican exports would be put off for 90 days as the two nations continue negotiations on the contentious levies.\nWord of the reprieve came a day after South Korea announced a trade pact with the U.S. and as countries worldwide scrambled to hammer out trade deals by Friday, the day President Trump said new tariffs would take effect.\nIt was the sole exception to a deadline that Trump said would bring hefty rate hikes to other, major U.S. trading partners, including Brazil, Canada and India, among dozens of nations that have thus far declined to enter framework trade agreements on strict terms set by the president.\nThis week, Trump wrote on social media: “THE AUGUST FIRST DEADLINE IS THE AUGUST FIRST DEADLINE — IT STANDS STRONG, AND WILL NOT BE EXTENDED.”\nU.S. Commerce Secretary Howard Lutnick told Fox News the same on Sunday: “No extensions, no more grace periods. Aug. 1, the tariffs are set, they’ll go into place.”\nBut that didn’t happen, at least not in Mexico. The long-awaited announcement of a delay came after Trump and Mexican President Claudia Sheinbaum had a morning conversation, the latest in a series of phone calls in which the Mexican leader has urged her U.S. counterpart to not impose more tariffs on her nation — the United States’ largest trading partner.\nTrump called the phone conversation “very successful” in a post on his social media platform, adding: “More and more, we are getting to know and understand each other.” The two North American leaders have yet to meet in person.\nUnder the deal, South Korea will invest $350 billion in key U.S. industries and purchase $100 billion worth of its liquified natural gas.\nIn her morning news conference, a clearly relieved Sheinbaum cast the postponement as a major victory for Mexico. “We have 90 days to keep on talking with President Trump,” declared a smiling Sheinbaum. “It was a very good agreement. We remain where we are.”\nIn his comments, Trump said that many imports from Mexico would continue to face a 25% tariff that he has said is needed to force the neighboring nation to cut down on the smuggling of fentanyl, the synthetic opioid linked to tens of thousands of deaths in the United States.\nAlthough Trump held off on a planned 30% tariff on some Mexican products, he declined to revise his existing tariff regimen, which Mexican officials view as egregious and harmful to the economy. Trump was firm that Washington would continue to charge the levies that he had already imposed — including the 25% “fentanyl tariff.” Mexican officials say their enforcement actions have resulted in a drastic drop in fentanyl trafficking.\nAlso to be retained, Trump said, would be a 25% tariff on auto imports and a 50% tax on imports from Mexico of steel, aluminum and copper. Mexico, Trump said, had agreed to “immediately terminate” its nontariff trade barriers. It was not immediately clear what policies he was referring to.\nMembers of the 11-judge panel of the U.S. Court of Appeals for the Federal Circuit in Washington appeared unconvinced by the Trump administration’s insistence that the president could impose tariffs without congressional approval.\nMexican officials are seeking to reduce or eliminate Trump tariffs on a wide array of goods. Those include a 17% tariff imposed in mid-July on about $3 billion in annual tomato exports to the United States.\nSheinbaum said that her country’s “coolheaded” approach to negotiating with the U.S. had succeeded in holding off more crippling tariffs while also defending “our principles with firmness.”\nMexico had managed to negotiate a privileged position in the “new global commercial order” launched by the Trump administration and her U.S. counterpart’s protectionist trade dictates, she said.\n“We have the best possible agreement, including when compared to other nations,” Sheinbaum said.\nThis week Trump has continued to make tariffs a centerpiece of his foreign policy, using them to express his displeasure with allies as well as adversaries. On Wednesday, he said the U.S. would impose 25% tariffs on goods from India. That same day he signed an executive order to place 50% tariffs on Brazil, starting next week.\nWhen President Trump rocked the economy with an unprecedented attack on global trade in April, the plan was dismissed as swaggering, capricious and unsustainable.\nOn Thursday, Trump said that Canada’s decision to recognize a Palestinian state would make it harder to reach a deal with America’s northern neighbor.\n“Wow! Canada has just announced that it is backing statehood for Palestine,” Trump wrote on his social media site. “That will make it very hard for us to make a Trade Deal with them. Oh’ Canada!!!”\nThe Trump administration and Canadian government have remained at loggerheads over Trump’s threats of new tariffs.\nThis year’s protracted U.S.-Mexico trade drama has seen the on-again, off-again tariff threats from Trump sounding recurrent alarms of a Mexican economic collapse. Throughout, Sheinbaum has stressed the value of negotiation over confrontation, refusing to strike back rhetorically at Trump’s verbal provocations.\n“President Trump has his own way of communicating,” Sheinbaum has said on several occasions.\nOn Thursday, Sheinbaum emphasized that Mexico had managed to preserve, for now, the 2020 North American free-trade deal — the United States-Mexico-Canada Agreement — signed into law by Trump during his first term. The pact allows duty-free entry of most Mexican goods into the United States and Canada.\nThe agreement is a linchpin of the Mexican economy. Mexico has become an export-dependent nation in recent decades, and the United States accounts for more than 80% of the country’s exports. U.S. total goods traded with Mexico topped $839 billion in 2024, according to U.S. figures.\n“T-MEC has been safeguarded,” Sheinbaum said, using the Spanish acronym for the trade accord, known as USMCA in English. “That is very important.”\nMcDonnell reported from Mexico City and Padilla from Los Angeles. Special correspondent Cecilia Sánchez Vidal contributed to this report."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-06-26/mexico-disputes-u-s-money-laundering-charges-against-mexican-banks-allegedly-linked-to-fentanyl-trafficking",
      "text": "Mexico disputes U.S. money-laundering charges against banks allegedly linked to fentanyl trafficking\n- Share via\nMEXICO CITY — President Trump’s vow to “wage war” on drug cartels has resulted in bombshell accusations of money laundering against three Mexican financial institutions — allegations that produced a defiant pushback from Mexican President Claudia Sheinbaum.\n“There’s no proof, just words,” a clearly agitated Sheinbaum told reporters on Thursday. “There has to be proof to know if there was money laundering or not. Therefore, we don’t deny it or accept it.”\nA day earlier, the U.S. Department of the Treasury issued what it called “historic” sanctions against CiBanco, Intercam Banco and Vector Casa de Bolsa. The department accused the three of laundering millions of dollars in narco-cash to facilitate the trafficking of fentanyl and other synthetic opioids into the United States.\nThe orders “affirm Treasury’s commitment to using all tools at our disposal to counter the threat posed by criminal and terrorist organizations,” Treasury Secretary Scott Bessent said in a news release.\nThe Treasury Department move would largely prohibit U.S. financial institutions from dealing with the three sanctioned entities, in effect shutting them out from access to the world’s largest market.\nThe Treasury accused the three firms of laundering funds for various Mexican drug cartels and “facilitating payments for the procurement of precursor chemicals needed to produce fentanyl.”\nU.S. authorities say Mexican cartels use chemicals imported from China to produce fentanyl in clandestine laboratories and then smuggle the potent opioid into the United States. Black-market fentanyl has led to tens of thousands of overdose deaths in the United States, officials say.\nSheinbaum has been widely lauded for her non-confrontational, “cool-headed” approach with the Trump administration, despite many disagreements — including on Trump’s imposition of 25% tariffs on some Mexican imports, a levy meant to prompt Mexico to crack down further on fentanyl smuggling.\nBut Sheinbaum signaled her clear displeasure with Treasury’s punitive actions.\n“We aren’t anyone’s piñata,” Sheinbaum said, adding, “We coordinate, collaborate — we have said this many times — but we will not subordinate ourselves.”\nThe Trump administration has imposed economic sanctions on three Mexican nationals involved in a drug trafficking and fuel theft network linked to the Jalisco New Generation Cartel.\nIn Mexico, some analysts have called the Treasury moves a broadside against Mexico’s economic well-being. U.S. authorities have frequently sanctioned Mexican companies and individuals for alleged links to drug smuggling, but experts say the targeting of banks is much less frequent.\n“The accusation is the gravest news for the Mexican financial system in decades and represents a point of no return for these three firms,” wrote columnist Carlos Mota of the El Heraldo de México newspaper. “The entire Mexican financial system entered into shock.”\nBut the Treasury said that “any burden and disruption should be relatively minimal,” since none of the three firms is a dominant player in Mexico.\nAll institutions — two banks and a brokerage house, all medium-sized firms — denied any wrongdoing.\nVector Casa de Bolsa said it “categorically rejected any imputation that compromises its institutional integrity.” Vector manages about $11 billion in total assets, according to U.S. officials.\nThe case against Vector has drawn special scrutiny in Mexico because of the firm’s ties to Alfonso Romo, a businessman who served for two years as chief of staff for former President Andrés Manuel López Obrador, Sheinbaum’s predecessor, mentor and the founder of Mexico’s dominant Morena political bloc.\nNews coverage of the immigration raids and protests in Southern California has transfixed Mexico, where reports have heavily sided with the immigrants against U.S. efforts to detain and deport them.\nAfter leaving the chief of staff position, Romo remained a top economic advisor to López Obrador.\nMexican media accounts have described Romo as the honorary president and co-founder of Vector. Romo has not commented publicly. According to Mexican media reports, Mexico’s current finance minister, Edgar Amador, is a former analyst with Vector.\nAmong other allegations against Vector, the Treasury said that from 2013 to 2016 “a suspected Sinaloa cartel money mule” transferred more than $1.5 million to the brokerage firm. Vector was also accused of links to millions of dollars in Sinaloa cartel payouts to Genaro García Luna, Mexico’s former top federal security official.\nGarcía Luna was convicted in 2023 in U.S. district court of colluding with the Sinaloa mob and receiving millions of dollars in graft. He is serving a 38-year prison sentence.\nThe U.S. order against the three Mexican financial institutions is to take effect in 21 days. It is a civil action and does not involve criminal charges.\nSpecial correspondent Cecilia Sánchez Vidal contributed to this report."
    },
    {
      "url": "https://www.state.gov/releases/office-of-the-spokesperson/2025/08/secretary-of-state-marco-rubio-with-raymond-arroyo-of-ewtns-the-world-over",
      "text": "HomeOffice of the SpokespersonPress Releases…Secretary of State Marco Rubio with Raymond Arroyo of EWTN’s The World Over hide Secretary of State Marco Rubio with Raymond Arroyo of EWTN’s The World Over Interview Marco Rubio, Secretary of State State Department Mezzanine Washington, D.C. August 7, 2025 QUESTION: This is your 200th day, by the way, of the administration. SECRETARY RUBIO: Yeah. QUESTION: Which we’ll talk about more. SECRETARY RUBIO: But my first interview on this mezzanine; I’ve never done it before. I’ve — QUESTION: You’ve never done it — SECRETARY RUBIO: No. I’ve seen people do media reports for years from here, with the background. QUESTION: Yes. But you – SECRETARY RUBIO: And now I get to do one myself. QUESTION: You’ve never done an interview here? SECRETARY RUBIO: No. Not in this place. QUESTION: Wow. I love that – well, it’s the perfect backdrop, and fitting for a day of celebration. Mr. Secretary, you are the Secretary of State, the acting secretary of USAID, the acting secretary of the Archives, and you’re the National Security Advisor. My first question is: (a) How do you balance all that? And secondly, have you seen your wife in person in six months? SECRETARY RUBIO: I have. I saw her in person today, actually. QUESTION: Oh, you see that? SECRETARY RUBIO: So not bad at all, yeah. Well, USAID is largely folded now – the foreign aid part of it is under the State Department now. So, it assumes that responsibility. That really is where it always should have been. The National Security Advisor and the Secretary of State roles are very intertwined. In many cases, it’s the same issue. Of course, it’s always funny to read a memo from the Secretary of State to the National Security Advisor – and so consider him informed. QUESTION: (Laughter.) That’s right. You have an insight into — SECRETARY RUBIO: Yeah, exactly. QUESTION: In a deep, personal way. SECRETARY RUBIO: And then on the Archives, of the ones, it probably takes the least amount of time. But the good news is we haven’t lost any historic documents, so – they’re all in place. They’re all there. (Laughter.) QUESTION: This is always a good thing. Well, the other piece of this is – describe to people very briefly – the national security advisor, in times past, that individual and the secretary of state often were at loggerheads. And it become a drag at times on the policy being advanced. SECRETARY RUBIO: Yeah, sure. QUESTION: Was that part of the thinking here, let’s consolidate this to — SECRETARY RUBIO: Well, I’m not sure that was the thinking per se. The President had made a decision about making a change, and he wanted the National Security Council restructured and tasked me to do it, and then that’s what we’ve done. And so, what – look, the way to think about it is our agencies, our cabinet – Senate-confirmed cabinet members in Treasury, at the Department of Defense, at State, et cetera – that’s our orchestra. And the job of the National Security Advisor is to be the conductor of the orchestra, to make sure that everyone – the President picks the music, the instruments play off the same sheet, and it’s the job of the conductor to make sure everyone’s playing – that every instrument’s playing correctly and playing together. So, it’s sort of a coordinating role. QUESTION: Big news this week: Steve Witkoff, your ambassador, goes – special envoy – met with Vladimir Putin. There’s now going to be a meeting between the President and Vladimir Putin. What do you expect from that meeting? What are you hearing, and what’s been your contact with Zelenskyy? SECRETARY RUBIO: Well, yeah. So hopefully there’s a meeting. And I think the President’s willing to have one; I think Putin indicated a willingness to have one. Obviously, the meeting has to be about something. We’re going to have to make some progress here before a meeting like that would be fruitful and worth doing. And so, for the first — QUESTION: Did Putin offer anything to Witkoff? SECRETARY RUBIO: Well, let me just say that, obviously, I’m not going to get into the details of everything that was discussed there. But for the first time in this process there’s at least some understanding of what the Russians would need in order to settle, to stop this war, from a diplomatic standpoint. Now, I’m not claiming that what the Russians would need and what Ukraine would need are the same. QUESTION: Right. SECRETARY RUBIO: There’s a difference, and there’s a gap there. And the question for us now is can – and we’ll be working on that even today, like, as soon as I leave here – can we bridge the gap between the Ukrainian side and the Russian side on this close enough so the President can come in as part of any sort of meeting and maybe be the closer on this deal. QUESTION: Has any – I mean, did they talk about a ceasefire? Is that in the — SECRETARY RUBIO: Well, I don’t think they’re specific about – obviously, the goal here is to end the war completely. Now, you could talk about the notion that it’s very difficult to negotiate details of a peace if you’re still shooting at each other. You – we’ve always found, like, for example, very recently now with Thailand and Cambodia, the talks in Malaysia were about a ceasefire so they could then negotiate sort of a more permanent deal. But as long as you’re shooting at each other, it’s hard to negotiate peace permanently. QUESTION: So that’s going to have to be a precursor to any — SECRETARY RUBIO: We’ve always felt it is. QUESTION: Yeah. SECRETARY RUBIO: Like, look, if we can arrive at a final deal and it’s over completely, that would be great. We’d prefer that – a permanent ceasefire. QUESTION: Yeah. SECRETARY RUBIO: But sometimes you need an interim ceasefire simply to get everybody to the table and to talk. Because I’ve seen in the past you have talks going on, something blows up somewhere, and people just walk away from the table. QUESTION: Yeah, yeah. Let’s hope that doesn’t happen this time. The president of Switzerland was here yesterday. She flies in, emergency meeting, to meet with you, trying to head off these 39 percent tariffs that are coming her way. It looks like she didn’t get a reprieve from those. SECRETARY RUBIO: Well, I certainly don’t do the trade negotiations, although I’ve been in many of them, but I’m not the person in charge of that. That’s our team of Howard Lutnick and Jamieson Greer and Scott Bessent that have been doing that, and ultimately the President. QUESTION: Yeah. SECRETARY RUBIO: So, they came in to make a counteroffer, or a new offer, to our trade negotiators. And as part of that, they’re in town, we definitely want to talk about – they’re a very – they’re a good ally. They’re a good partner to the United States. QUESTION: Yeah. SECRETARY RUBIO: From a bilateral, diplomatic, geopolitical standpoint. But obviously, the issue of trade came up, and I encouraged them to make the best offer possible. In the end, every successful trade deal so far has been the President coming in to close it. So, you can get a deal close enough, but then you’ve got to sit in front of him – whether it’s their president, their prime minister, or their chief trade negotiator – and close it out with the President. QUESTION: There was something you did early on, in February, I think. Your State Department designated six cartels — SECRETARY RUBIO: Yeah. QUESTION: — in Latin America as terrorist organizations. How did that change the way, the interaction between these cartels and the United States, and who made that decision? How did the President come to that? SECRETARY RUBIO: Well, the President makes the decision – yeah – on our recommendation. Here’s the thing: We cannot continue to just treat these guys as local street gangs. They have weaponry that looks like what terrorists, in some cases armies, have. They control territory in many cases. Those cartels extend from the Maduro regime in Venezuela – which is not a legitimate government; we don’t recognize the Maduro regime as legitimate. QUESTION: Right. SECRETARY RUBIO: It is a criminal enterprise – all the way to the various different cartels that operate in Mexico, and in between. You find them in Ecuador. You find them in Guatemala. You find TDA – what people would call street gangs, but actually are operating as criminal enterprises, but very well-organized ones. So what it changes is it gives us legal authorities to target them in ways you can’t do if they’re just a bunch of criminals. It’s no longer a law enforcement issue. It becomes a national security issue. QUESTION: Has it changed their behavior at all? SECRETARY RUBIO: Well, I don’t know if it’s changed their behavior yet, but their behavior is going to have to change one way or another. But it allows us to now target what they’re operating and to use other elements of American power, intelligence agencies, the Department of Defense, whatever — QUESTION: Yeah. SECRETARY RUBIO: — to target these groups if we have an opportunity to do it. We have to start treating them as armed terrorist organizations, not simply drug dealing organizations. Drug dealing is the kind of terrorism they’re doing, and it’s not the only. QUESTION: Yeah. SECRETARY RUBIO: They’re also into human trafficking. They smuggle anything. And there’s been nascent cooperation between them and some international terrorist organizations in the past which pose an ongoing danger to the United States. QUESTION: Let’s talk for a moment about the Israeli-Gaza-Hamas conflict. SECRETARY RUBIO: Yeah. QUESTION: It looks like Benjamin Netanyahu is – wants to occupy Gaza, and Hamas is saying there’ll be no ceasefire – we need a ceasefire, and we’re not giving you these hostages until our terms are met. Where is the United States on this? Is occupation of Gaza the right way to go right now? And what about the humanitarian crisis? SECRETARY RUBIO: Well, let me say ultimately what Israel needs to do for Israel’s security will be determined by Israel. I can tell you the way to break this out is there are three problems there at the same time. Number one is the one that’s getting almost all the media coverage, and this is the humanitarian problems that we’re seeing there. And there – no one wants to see that, and the United States stands prepared to contribute toward any real effort that will actually get food and medicine and life-sustaining aid to people on the ground in Gaza. That’s number one. The second is that there are 20 innocent people being held hostage and starved inside of tunnels. Unfortunately, there aren’t daily cameras down there covering that, and so you don’t see the mainstream media covering it – but there are 20 people that have nothing wrong that are being held as hostage, and we saw the conditions that they’re living in the other day. And the third is that as long as Hamas exists – as long as Hamas exists, particularly exists as an armed organization – there will never be peace in Gaza. Because that – Hamas is not going to suddenly change and go into another line of work. Their line of work, their reason for existing, is they want to destroy Israel. They want to drive every Jew out of the Middle East. That’s their goal. And as long as a group like that has weapons and the ability to fight, they’re a threat to peace. So, we have to deal with all three of those elements, not just the humanitarian. That’s important, but the other two have to be dealt with as well. Not enough time is being – not enough attention is being paid to those two. And it’s not easy, because Hamas thinks they’re winning the global PR war. They’re not willing to make any concessions. QUESTION: Well, clearly they’re winning something. Your allies – Canada, France, the UK — SECRETARY RUBIO: Right. QUESTION: — are prepared to recognize the Palestinian state there. SECRETARY RUBIO: Well, if you noticed, the talks with Hamas fell apart on the day Macron made the unilateral decision that he’s going to recognize the Palestinian state. And then you have other people come forward, other countries say, well, if there’s not a ceasefire by September, we’re going to recognize a Palestinian state. Well, if I’m Hamas, I’ve basically concluded let’s not do a ceasefire. QUESTION: Right. SECRETARY RUBIO: Because we can be rewarded and we can claim it as a victory. So those messages, while largely symbolic in their minds, actually have made it harder to get peace and harder to achieve a deal with Hamas. They feel emboldened. QUESTION: Well, the Arab League isn’t in favor of this. I mean, clearly the Arab League says you’ve got to get Hamas out of there. They need to drop arms and move on. SECRETARY RUBIO: Correct. QUESTION: But do you agree with Netanyahu that this would be a reward for Hamas? SECRETARY RUBIO: Statehood? QUESTION: By giving them statehood? SECRETARY RUBIO: Recognition – absolutely. Look, statehood is a – it’s not a real – what these people talk about isn’t real. They can’t define the borders or who’s going to run it. I mean, you can’t have a state or even an autonomous region unless you can identify who’s going to run it. And if it’s going to be run by Hamas, you’re going to be right back into war. QUESTION: Yeah. SECRETARY RUBIO: So, I think what’s important to remember here is that – by the way, they had opportunities to do this. Israel turned over Gaza, turned it over completely with greenhouses and all kinds of things. And they elected Hamas. Hamas destroyed it, destroyed it all, took it, built tunnels instead of hospitals. That’s what they do. So, at the end of the day my problem with it is that I believe that these unilateral steps that have been taken by these governments, I believe – I know – has emboldened Hamas and made it harder to achieve peace. QUESTION: Your department recently made headlines. You are instituting a pilot plan where people who are coming to the country to visit – when they file for their visa, they have to leave a bond of $10,000, $5,000 for children. Why are you instituting this? And is this going to help people actually go back to their country? I know that’s — SECRETARY RUBIO: Yeah, a couple – it’s not for every country. It’s for countries that have high rates of visa overstays. What generally happens is people will get a visa, they come to the U.S., it expires in six months, and they don’t leave. Now they’re here illegally. Very common; it happened a lot. In fact, I would say at one point – I don’t know what the latest numbers are – but more than half the people in this country illegally were visa overstays. So, for countries that have high rates of visa overstay, you post a bond, and the bond gets collected against. And obviously the – and so obviously now some third party is going to try to verify whether this person is truly going to come back or not. But it – I’m not saying it solves all the problem, but it’s an innovative way to sort of cut down on visa overstays. QUESTION: There’s been a huge challenge in the issuance of visas to foreign-born Catholic priests and religious. SECRETARY RUBIO: Correct, yeah. QUESTION: I know it’s bollocksed up in fraud in unaccompanied minor visas. Now, I don’t know how those two became conflated. I think the Biden administration attached them or threw them into the same category. What can be done? SECRETARY RUBIO: Well, first is to separate the one from the other. And in many cases, what you were finding is you had X number of people you were going to allow a year. You prioritized people that were coming here from a different migration and it came at the price of some of these others. QUESTION: I see. SECRETARY RUBIO: So, we’re trying to separate the two from it and create its own standalone process. And I’ve been in touch, for example, with a number of our cardinals here in the United States and bishops about that as well. QUESTION: I’ll bet. SECRETARY RUBIO: And it’s not only the Catholic Church. I mean, there are other places that are being impacted by – but we’re trying to streamline that process. We clearly view that entry point as very different than some of these others. And – but when you basically say there’s a hundred available – I’m just using that number. QUESTION: Yeah. SECRETARY RUBIO: And you’re – the pot is that big, someone’s going to lose out. I mean, you start losing slots, and that includes religious. QUESTION: Would you be in favor of extending those special visas that some of the religious and priests have now? SECRETARY RUBIO: Potentially. I mean, we’re going to look at it. We’re looking at every option. Look, we don’t want to read headlines that some Catholic church had to close because — QUESTION: Yeah. SECRETARY RUBIO: — it couldn’t get their priests here or they couldn’t get – some order closed because some nun couldn’t get here. So we’re not interested in that. QUESTION: Yeah. SECRETARY RUBIO: And that’s really not the aim here. It’s more caught up in the structure of it. We’ll have a plan to fix it. We’re working on it. We know it’s an issue, and we’re committed to fixing it. QUESTION: The Immigration and Nationality Act allows you as Secretary of State to revoke student visas if they’re engaged in – I’m going to quote – speech that “compromises a compelling foreign policy interest,” and you can revoke a visa from a student for any reason. SECRETARY RUBIO: Correct. And we have. QUESTION: And you can because of the antisemitism being expressed and other toxic speech that undermines foreign policy objectives of the United States. Now you’re being sued by Stanford newspaper and a free speech activist group. Where do you stand on this now? SECRETARY RUBIO: They’re wrong. I mean, anybody can sue. QUESTION: They say it’s a First Amendment violation. SECRETARY RUBIO: Well, it has nothing to do with what their opinion is. It has to do what the impact of it has on the United States. Let’s remember again – student visas, okay, are not a right. There is no constitutional right to a student visa. A student visa is something we decide to give you. And by the way, visas of every kind are denied every day all over the world. As I speak to you now, someone’s visa application to the U.S. is being denied. So, if I would have denied you a visa had I known something about you, and I find out afterwards that I gave you a visa and I found this out about you, why wouldn’t I be able to revoke your visa? If I wouldn’t have let you in had I known this – like if this guy, Khalil – whatever his last name is. QUESTION: Yeah. SECRETARY RUBIO: If that guy had been saying and doing abroad what he’s now doing in the United States, we never would have given him a visa. He was on TV, I think it was yesterday or the day before — QUESTION: Yeah. SECRETARY RUBIO: — arguing that October 7th had to happen – that it had happen – that it was a necessary evil that – he didn’t call it an evil. QUESTION: Yeah. SECRETARY RUBIO: He said it’s a necessary thing; it had to happen. Why is a guy like that allowed into the United States on a visa? He’s not entitled to a visa. So, it has nothing to do with what they’re saying. It has to do with what they’re doing and its implications on the U.S. Student visas are a privilege. They are not a right. QUESTION: I want to talk about this day. We – as we sit here, it’s the 200th day of the administration. Major and, for the most part, unrecognized peace deals that you all have worked out in the — SECRETARY RUBIO: Yeah. QUESTION: I mean, the Cambodia deal, the Congo deal. I want you to talk briefly about those. Forty-nine Christians were killed by Islamic extremists. More Christians are killed in Nigeria than anyplace on Earth. SECRETARY RUBIO: Correct. QUESTION: What else can we and should we be doing to stop that? SECRETARY RUBIO: Well, unfortunately in those places, you have these Islamist jihadist elements operating inside the country that deliberately target Christian communities and others, but they target Christians, especially in Nigeria, as you pointed out. And so, I think what we want to do is work closely with Nigerian authorities to prevent that. They have to make it a priority to prevent it. QUESTION: Yeah. SECRETARY RUBIO: On the broader issue of peace, the President is committed to peace and committed to being the President of peace. And so, we saw when India and Pakistan went to war, we got involved directly, and the President was able to deliver on that peace. Cambodia and Thailand more recently; Azerbaijan and Armenia, hopefully – we’re taping this here today, but on Friday of this week, we’ll be here to sign an agreement and the beginning of a peace deal there. DRC-Rwanda – a 30-year war, 7 million people killed – we were able to bring them here to sign it. Obviously, work needs to – peace is not permanent. It always has to be worked and maintained. QUESTION: Yeah. SECRETARY RUBIO: But we’re very proud of those initiatives, and we’re looking for more – obviously, the big one being in Ukraine and Russia. QUESTION: Yeah. SECRETARY RUBIO: We want to see that as well. But we dedicate a significant amount of time to stopping and ending wars. QUESTION: And what’s the difference between what you all are doing – what you’re doing at this State Department and the President’s leadership – as opposed to these conflicts that dragged on during the last administration (inaudible)? SECRETARY RUBIO: Well, I think the biggest is the President’s direct involvement. One thing is – we get involved. We help with the technical aspects of it, the mechanics, and we do a lot. I mean, it’s a team effort. The Vice President has been involved in some – Steve Witkoff, obviously. It’s another when the President is calling directly and saying in some cases to countries: we have this trade thing we’re working on with you, but we can’t do it if you guys are going to be fighting a war with each other. So that personal engagement by the President that I’ve witnessed, particularly just very recently with Cambodia and Thailand — QUESTION: Yeah. SECRETARY RUBIO: — that, I think, made all the difference in the world – certainly expedited. Understand that – from the time he made the first call to the time they stopped firing at each other was about 36 hours. Usually, these things take six weeks – not with President Trump. QUESTION: Give me a sense. You were there in the room when he was launching those attacks on Iran. You were there, I imagine. Describe to me how the President walks through these moment-by-moment decisions when the national security and the national prestige is on the line. SECRETARY RUBIO: Well, I think you make a determination that we have a target identified. The first thing to understand about that operation it was very – it was very defined. In essence — QUESTION: Targeted. Yeah. SECRETARY RUBIO: It was targeted. It wasn’t about starting a broader war. It was actually an effort to escalate in order to de-escalate. It had a very clear objective. He established the objective. His military planners offered him a timeline, and then there were checkpoints along that timeline where we had to go back and check with the President: Are you okay? Are you okay? QUESTION: Yeah. SECRETARY RUBIO: All of those thresholds were crossed. It happened very calmly. Now, he was President before, so he’s been through this in the past. QUESTION: Yeah. SECRETARY RUBIO: But it was executed on, and then we were done. He wasn’t tempted to say let’s go back and do it again or let’s do more or let’s find some other place. QUESTION: Yeah. SECRETARY RUBIO: He had a very clear objective in mind, and he achieved it. And we immediately pivoted now to our goal was: okay, we achieved this objective, now how do we end this war — QUESTION: Yeah. SECRETARY RUBIO: — on the 12th day and not let it become a regional war after 21? QUESTION: Yeah. You were in Rome during the Pope’s installation – the new Pope – Pope Leo’s installation. Give me a sense of how now, as Secretary of State, what’s – has the relationship at all changed or shifted from Pope Francis’s reign to that of Pope Leo? What did you see in person from the man himself? SECRETARY RUBIO: Well – well, it was – when I interact with leaders in the Catholic Church, they’re almost invariably from some other country, especially at that level. So, it was almost surreal to sort of interact with an American that’s sitting across the table, because you’re not used to that when it comes to – at that level, obviously. QUESTION: Right. And they get the nuance and the speech and the things — SECRETARY RUBIO: Yeah, and they understand our history, our politics, our culture, what’s going on here, things of this nature. They know – in many cases maybe they don’t know too much about you. When it’s an American, I think they know a lot more about you because they follow it (inaudible). QUESTION: Right. SECRETARY RUBIO: So, all that was unique, obviously. But I would say that right now, the – it’s been new, and the papacy has only been there for less than a hundred days. QUESTION: Yeah. Yeah. SECRETARY RUBIO: So, I think that’s still establishing itself, and he’ll have to make decisions about – so right now I don’t – I think it’s good and we have good communication. We’ve talked to the church, for example, extensively about Gaza. When a church was attacked there, we were able to facilitate visits there. There’s a cardinal now that’s in Gaza at that church permanently, I think – and kind of – I wouldn’t say trapped, but he’s certainly there. QUESTION: Yeah. SECRETARY RUBIO: We’ve been in communication with them on that. So, it’s a good relationship, but it’s new. It’s a new papacy. It’s a new direction. And I think – again, I’m speculating, because I’m not in the conclave, but I think one of the things that the cardinals probably chose is someone that sort of could provide a period of stability and consistency as the church faces a myriad of challenges around the world and – can both reach out to areas where the church is growing, but also sort of reinvigorate the church in some places where perhaps it’s struggling. QUESTION: I remember in 2019 you gave a speech at CUA, just up the street here, Catholic University of America. And it was on the first – the last Pope Leo and — SECRETARY RUBIO: Leo – yeah. Common-good capitalism. QUESTION: Common-good capitalism. SECRETARY RUBIO: Yeah. QUESTION: This seems to really resonate with this new Pope. SECRETARY RUBIO: I think so. We didn’t get into depth on it, obviously, but — QUESTION: Did you talk about it all? SECRETARY RUBIO: Well, I mentioned it and I made sure they had a copy of it, because the speech was back in 2019. But I do think that Catholic social doctrine, which is highly intellectual, has a lot to offer even non-Catholics in terms of forming – at the core of it, right, is the belief that – is the market the tool or the purpose? I don’t think the market is the purpose. I think the market is a tool. The purpose is providing people meaningful work, an economy that grows but grows by creating jobs. We have an expectation that people work, but we also should have an expectation that the economy is creating good work. And from work, flows everything. We are made to work, and from work flows everything – stability in families, stability in communities. So, I think the simplest way to describe it is we are – we believe in capitalism, a capitalism that generates economic growth, an economic growth that creates wealth but doesn’t only create wealth. It also creates opportunity. It also creates jobs, it also benefits the common good. QUESTION: Now – well, you have a unique – there are articles; I’m not the first to say this. But I thought when you became Secretary of State, you have a unique opportunity to interface with the Vatican on a level that, frankly, other secretaries have not had in the past because of that experience. SECRETARY RUBIO: Yeah, look, I think the Vatican could play a very key role in many parts of the world. They’re actually very skilled diplomatic – diplomatically. In the end, their number one goal has to be that – I wouldn’t want to call it the national interest of the Vatican, but the church and its presence in different places. I know they’re deeply concerned, for example, that the church is being heavily persecuted in Nicaragua, as an example. So, they’re always concerned about the church in China, which has been a point of friction with the U.S. Government in the past. But I mean, they’re important, and they’ve offered to get involved in any way they can on bringing about peace as a forum or as a facilitator. So, these are things maybe we’ll be able to work on. QUESTION: Yeah. Very quickly, a couple of cultural things. Howard Stern looks like he’s losing his show. Stephen Colbert has lost his show. What’s happening culturally, and how is this President a part of it? SECRETARY RUBIO: I don’t know if it’s just culturally. I think ultimately these are businesses, and the landscape, the media landscape, the way people are getting news, information, and entertainment is rapidly changing across the board. It’s rapidly changing. And so, I think we are living in an era in which sort of what we describe or consider traditional media is going to erode in favor of some – I think everyone’s trying to reinvent themselves. We saw newspapers go through this, we saw other media formats go through this; and I think it’s now finally reaching broadcasters. And I think that both on radio and television, it’s just a rapidly changing landscape. The overwhelming – increasingly – majority of people are not getting their news sitting live in front of a program. They’re getting a clip on social media or they’re getting it from an alternative site that’s providing news and information. The good news is we have more providers than ever of news and information and entertainment. The bad news is we have more sources and they’re all over the place. (Laughter.) So, I think as much as anything else, the bottom line is that Colbert and Stern – I don’t know the details of it – are being fired because they don’t – their audiences don’t like what they’re offering, and they don’t have a long-term future. QUESTION: Final question. You saw Cynthia Erivo, the Wicked actress, played Jesus in Jesus Christ Superstar at the Hollywood Bowl just this past weekend. You are an ex officio member of the Kennedy Center. My question is: Would you ever put that show with Cynthia Erivo at the Kennedy Center? SECRETARY RUBIO: Yeah, I didn’t know it – I’m so busy I don’t follow any of this stuff. (Laughter.) But just how you’ve described it to me, no. I mean, obviously, look, that stuff’s done to be provocative and to – but I think for people of faith, none of this should be new. QUESTION: Yeah. SECRETARY RUBIO: It’s been true from the beginning of Christianity. It’s been – Christianity has been mocked. Christianity has been attacked from its very inception. In fact, the church has traditionally been at its strongest when it’s the persecuted church. QUESTION: Yes, it is. SECRETARY RUBIO: It’s been at its weakest when it sort of gets consumed by the culture and – so by definition, Christianity has always been countercultural. It was from its earliest days, and it’s been at its strongest and most vibrant. Now, that doesn’t mean we seek persecution or that we don’t take it on, it – but I think we should understand that in Christ’s own command he – in Christ’s own words he tells us: They’re going to hate you because of me. They hated me before they hate you. And — QUESTION: What will you do when you leave this interview? What does the rest of your day look like? SECRETARY RUBIO: I’m going over to the White House. We have meetings with the President this morning. We have a visitor from overseas coming into the White House as well to meet with me, not with the President. We have to get ready for the peace signing tomorrow, and I’m sure they have other surprises awaiting. QUESTION: Oh, I’ll bet. SECRETARY RUBIO: And I’m – I actually have to finish here first. I’ve got to go through some documents here, then run over there, and then I think may have to come back this afternoon again. So — QUESTION: Wow. Well, I hope you see your family very soon. SECRETARY RUBIO: (Laughter.) I’ll see them, yeah. QUESTION: Thank you so much. Tags Bilateral Relations and Engagement Bureau of East Asian and Pacific Affairs Bureau of European and Eurasian Affairs Bureau of Near Eastern Affairs Cambodia Israel Office of the Spokesperson Palestinian Territories Russia The Secretary of State Thailand Ukraine"
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-05-03/trump-wants-to-send-u-s-troops-into-mexico-to-fight-drug-cartels-sheinbaum-says",
      "text": "Mexican president rejects Trump’s proposal to send U.S. troops to fight drug cartels\n- Share via\n- Mexican President Claudia Sheinbaum says she told Trump that “our territory is inalienable, sovereignty is inalienable.”\n- Trump has charged that Mexico is “essentially run by the cartels” and that the United States should “wage war” against them.\n- A U.S. unilateral attack, some observers fear, could return Mexican politics to the gringo-bashing tendency that was once prevalent among Mexican politicians.\nMEXICO CITY — Mexico’s leader said Saturday that she rejected an offer by President Trump to send U.S. troops into her country to fight drug cartels.\nSpeaking at a public event, President Claudia Sheinbaum confirmed a report published Friday in the Wall Street Journal that said that Trump had pressured Mexico to allow more U.S. military involvement in the drug war.\n“It’s true,” Sheinbaum said. She said that on some private calls with the American leader in recent months, Trump said: “How can we help you fight drug trafficking? I propose that the United States Army enter to help you.”\nSheinbaum said she rebuffed his proposal, saying: “No, President Trump, our territory is inalienable, sovereignty is inalienable. ... We can collaborate, we can work together, but with you in your territory and us in ours. We can share information, but we will never accept the presence of the United States Army on our territory.”\nThis remains an extremely sensitive topic for Mexicans, given previous military occupations by the U.S. and the strong sense of nationalism that resulted\n— Gustavo A. Flores-Macías, Cornell University professor\nA statement released by the White House on Saturday said that Sheinbaum and Trump had worked closely “to achieve the most secure southwest border in history,” but it did not directly address her comments on U.S. forces in Mexico.\n“The President has been crystal clear that Mexico must do more do combat these gangs and cartels and the United States stands ready to assist and expand the already close cooperation between our two countries,” the statement said.\nSince Trump returned to the White House in January, his administration has ramped up CIA surveillance drone flights over Mexico, formally designated drug cartels as “foreign terrorist” groups and has repeatedly floated the possibility of deploying troops there to fight organized crime. He has massed U.S. troops on the northern side of the U.S. border with Mexico to crack down on unauthorized immigration and drug smuggling.\nMexico is “essentially run by the cartels,” Trump said earlier this year, insisting that the United States should “wage war” against them.\nSheinbaum has rejected Trump’s characterization that Mexico is under cartel domination, and has vowed to defend her nation’s sovereignty against violations “by land, sea or air.”\nThe Trump administration wants to use the military to fight Mexican drug cartels.\nBut the Mexican president’s latest comments confirm that Mexico remains under intense pressure from Washington to accept greater U.S. involvement in the anti-drug fight, noted Gustavo A. Flores-Macías, professor of government at Cornell University.\n“This remains an extremely sensitive topic for Mexicans, given previous military occupations by the U.S. and the strong sense of nationalism that resulted,” Flores-Macías wrote via email.\nThat gives Sheinbaum “little room to maneuver” as Trump continues to insist on dispatching U.S. troops south of the border. “The Mexican government would be wise to take the threat of unilateral U.S. strikes against the cartels very seriously, while making it clear to the White House that the costs in terms of the economy, security and migration would be steep,” Flores-Macias wrote.\nUnilateral U.S. strikes, experts say, could result in Mexico being obliged to take retaliatory measures, such as cutting back on bilateral cooperation on key issues such as security and immigration. U.S. attacks that result in civilian casualties could even force Mexico to cut diplomatic ties with its major trading partner.\nSince Trump took office in January, hurling insults and threatening devastating tariffs and U.S. drone strikes, Mexico has been seized by a nationalistic fervor.\nNo administration in modern times has taken such a militaristic approach to Mexico, a U.S. ally that Trump blames for producing the fentanyl that has killed hundreds of thousands of Americans.\nTrump’s stance upends recent U.S. policy, which emphasized beefing up the rule of law in Mexico, and stands at odds with Mexico’s security strategy, which has veered away from the sort of fierce cartel confrontations that drove record levels of bloodshed.\nTrump’s fixation on organized crime in Mexico has put Sheinbaum in a difficult position. She has tried to appease him to try to avert the potentially catastrophic tariffs that he has threatened unless Mexico cracks down on fentanyl trafficking. She sent thousands of National Guard troops to fortify the northern border and is transferring dozens of suspected cartel members to the U.S.\nBut she has also had to show fellow Mexicans that she is defending national sovereignty. Since Trump took office in January, nationalism has surged here.\nOn TikTok, users have demanded a boycott of American products, filming themselves pouring Coca Cola down the drain. Companies have embraced the red, green and white of the Mexican flag in ad campaigns.\nA U.S. unilateral attack, some fear, could return Mexican politics to the gringo-bashing tendency that was once prevalent among Mexican politicians. But official dumping on the United States has generally diminished in recent years as economic, cultural and other U.S.-Mexico ties have strengthened and millions of Mexicans have emigrated to the United States.\nRemittances to Mexico from people of Mexican ancestry in the United States now top more than $60 billion annually, comprising a key pillar of the Mexican economy.\nCecilia Sánchez Vidal in Mexico City and Michael Wilner in Washington contributed to this report."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-06-16/immigrant-protests-violence-reverberate-in-mexico",
      "text": "Immigrant protests, unrest in L.A. reverberate in Mexico\n- Share via\n- Mexican President Claudia Sheinbaum has defended the right of immigrants to protest, but has denounced violence and called on Mexicans in Los Angeles to act peacefully.\n- Sheinbaum is expected to meet President Trump for the first time this week. She plans to raise the recent treatment of Mexicans in the U.S.\nMEXICO CITY — The action may be on the streets of Los Angeles, but fallout from the immigrant protests is roiling politics in Mexico at a delicate moment — days before Mexican President Claudia Sheinbaum is expected to meet President Trump in their much-anticipated inaugural face-to-face encounter.\nSheinbaum has been on the defensive since Homeland Security Secretary Kristi Noem — at an Oval Office event in Trump’s presence — accused the Mexican president on Tuesday of “encouraging violent protests.”\nWhile Sheinbaum has assailed the U.S. immigration raids and backed immigrants’ rights to protest, there is no public record of her ever having backed violence. A day before Noem’s accusation, she said the exact opposite and called on Mexicans in Southern California to act peacefully.\nHomeland Security Secretary Kristi Noem said Mexican President Claudia Sheinbaum encouraged violent protests in Los Angeles. Sheinbaum called the accusation “absolutely false.”\nNonetheless, Mexican opposition figures have embraced Noem’s charges and enthusiastically sought to amplify them. Critics also have seized upon Sheinbaum’s comments last month — weeks before the L.A. protests — calling on Mexicans in the United States to “mobilize” against a planned U.S. tax on cash transfers to Mexico.\nAn opposition senator, Lily Téllez, posted a video on X last week accusing Sheinbaum of emboldening compatriots in the U.S. to “violate the law without consequences, as if it were Mexico,” an assertion echoed by other critics.\nThe barrage of accusations has put Sheinbaum in a delicate position: She is obliged to defend immigrants in the United States, as Mexican leaders have always done, but cannot be seen as inflaming bilateral tensions. Still, she has lashed out at her domestic critics as “anti-patriotic.”\n“How is it that Mexicans dare to say I promoted violence in the United States? With what objective?” the president asked Friday. “So that there’s not a good relationship between Mexico and the United States? Or, worse, that the United States does something to Mexico? They are willing to have something bad happen to the country just to indulge their hypocrisy or hate.”\nNews coverage of the protests has transfixed Mexico, where reports have heavily sided with the immigrants against U.S. efforts to detain and deport them. Commentators have largely condemned the Trump administration actions, while the airwaves and social media are filled with mostly sympathetic accounts and video from immigrants and advocates on the ground in Southern California.\nSheinbaum, elected to a six-year term a year ago in a landslide vote, has a 70% public approval rating, polls indicated. Her ruling Morena bloc dominates state legislatures and the Mexican Congress. She has little to fear politically from the ire of reeling opposition parties.\nBut, in the era of social media, the Sheinbaum-as-agitator narrative has gained traction among some U.S. conservative commentators. They have depicted her as a kind of master manipulator scheming violent resistance from her perch in Mexico City.\n“This woman, the president of Mexico, is talking about leading an uprising in the interior of America,” Charlie Kirk, a far-right talk-show host, declared June 9 in a video posted on X, where he has more than 5 million followers. “And she has a lot to work with because she has a lot of sleeper cells here.”\nIn comments last week, Sheinbaum has embraced nonviolence as a daily mantra, citing the legacies of Mahatma Gandhi, the Rev. Martin Luther King Jr., Nelson Mandela and Cesar Chavez.\n“Any demonstration has to be peaceful,” she told reporters Friday. “We are always seeking, diplomatically, the defense of Mexicans outside the country.”\nThe Supreme Court tossed Mexico’s $10-billion lawsuit against U.S. gun makers, but the case forced U.S. officials to acknowledge that thousands of guns are smuggled into Mexico from the United States.\nAnd, while Sheinbaum is a regular on X — where she has 4.3 million followers — she urged people not to “make politics” on the social media forum, where much of the polemics about her purported role in the immigrant protests has played out.\nHelping to fuel the controversy are the proliferation of Mexican flags at the Los Angeles protests. Sheinbaum has neither endorsed nor criticized the flag-waving, but she has expressed dismay at one widely distributed image — of a shirtless L.A. protester brandishing a Mexican flag as he stands atop a burned-out car. She has called the photo a “provocation,” hinting of dark motives, but has failed to clarify her suspicions.\nThe image, Sheinbaum said Friday, “doesn’t fit with the millions of Mexicans who contribute to the economy of the United States and are the best of people.”\nIn their broadsides against Sheinbaum, her opponents also have cited the president’s animated calls for Mexicans in the United States to “mobilize” against a completely separate issue — the Trump administration’s plans to impose a 3.5% tax on foreign remittances, part of the massive White House spending bill pending in Congress.\nThat proposed levy has met universal condemnation in Mexico, where the cash transfers support tens of thousands of poor families and are a $64-billion-a-year economic linchpin.\nIn an address last month in the northeastern state of San Luis Potosí, Sheinbaum called on U.S. residents of Mexican ancestry — both immigrants and those born in the United States — to send letters, emails and social media messages to Congress urging lawmakers to vote against the remittance tax.\n“If necessary, we are going to mobilize,” declared an animated Sheinbaum, raising her right fist, the image recalling her youthful days as a left-wing student demonstrator.\nSheinbaum never called for street protests, much less violence. But she also never clarified whether “mobilize” referred to organizing rallies, bolstering diplomatic pressure or some other strategy to help thwart the remittance tax.\nThe clip of Sheinbaum urging people to “mobilize” has bounded across the internet. It’s Exhibit A for those accusing her of fomenting violent protests. Some online versions have been dubbed so that Sheinbaum speaks in a heavily accented English.\nColombian mercenaries are being lured to Mexico to fight for powerful drug trafficking groups such as the Jalisco New Generation cartel.\nSince Trump took office, Sheinbaum has won wide acclaim for deftly handling sensitive bilateral issues such as tariffs and drug trafficking. As the immigrant protests spread across the United States, the Mexican president will be again walking a fine line with her U.S. counterpart in their first meeting at the Group of Seven summit, which started Sunday in Canada.\nSheinbaum confirmed Saturday that she planned to meet with Trump in coming days and would raise the recent treatment of Mexicans in the U.S.\n“We are going to defend Mexicans with dignity,” she told a crowd outside Mexico City.\nThe Mexican leader has made it clear that she disputes the administration’s view of immigrants as “invaders” and of L.A. demonstrators as insurrectionists.\n“We don’t agree with the treatment of honest Mexicans who work every day for the good of the United States and pay their taxes,” Sheinbaum said on Friday. “Eighty percent of their earnings remain in the United States, in consumption, in taxes. And they are people who are integrated into life there.”\nAnd Sheinbaum, who did doctoral studies for four years at Lawrence Berkeley National Laboratory, added: “California would not be what it is without Mexicans.”\nTimes staff writer Kate Linthicum and special correspondent Cecilia Sánchez Vidal contributed to this report."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-04-25/the-united-states-is-the-villain-of-our-story-nationalism-surges-in-mexico-amid-trump-threats",
      "text": "- Share via\n- Americans barely remember the Mexican-American War, but in Mexico memories of the war and other military quarrels with the United States remain deeply felt.\n- Mexico lost half its territory, including California, in the war that broke out this week in 1846.\n- President Claudia Sheinbaum, who often speaks of Mexico’s sovereignty, said, “We are neither a protectorate nor a colony of any foreign nation.”\nMEXICO CITY — At the entrance to Mexico City’s largest park lies a towering marble monument to six young military cadets killed in battle.\nThe Niños Héroes — “boy heroes” — died while defending Mexico’s capital during the Mexican-American War, which broke out 179 years ago this week.\nThat conflict may not loom large in the minds of most Americans. But in Mexico, which in defeat was forced to cede more than half of its territory to the U.S., memories of the war and other military quarrels with the nation’s powerful northern neighbor remain deeply felt.\nAs Mexicans, we have to unite for this new battle — which is a trade war\n— Felix de la Rosa, chemical engineer\nToday, Mexico is once again locked in battle with the United States, this time facing an American president who is hurling insults, tariffs and threatening U.S. drone strikes here. Many see it as just the latest chapter in an age-old tale of U.S. aggression.\n“In Mexico there’s a perception that the United States is the villain of our story,” said historian Alejandro Rosas. “That’s the narrative you grow up with, it’s what they teach you in school. We’ve been victims of the United States forever.”\nThe Niños Héroes are often viewed as the embodiment of courage, teenagers who fought like men against a northern invader. Their faces have appeared on currency, Streets bear their names, children learn about them in school.\nAt the white marble monument in Chapultepec Park, which this week was crowded with families enjoying spring break, many stopped to take pictures in front of the monument where the remains of the Niños Heroes are entombed.\n“It’s unfair,” said Monserrat Martínez Hernández, 20, a college student who snapped selfies alongside her mother, sister and two cousins.\n“They already took away half our territory,” she said of the United States. “Now they want to abuse their power again, this time from an economic perspective.”\nSince Trump took office in January, Mexico has been seized by a wave of nationalistic zeal.\nOn TikTok, users have demanded a boycott of American products, filming themselves pouring Coca Cola down the drain. Companies have embraced the red, green and white of the Mexican flag in ad campaigns.\nAfter the government announced a relaunch of the “Hecho en Mexico,” or “Made in Mexico,” seal on locally produced products, Grupo Modelo said it would print the slogan on its beer bottle caps.\nLeading the way is Mexican President Claudia Sheinbaum, who has both stoked — and benefited from — the surge in national pride.\nIn the face of Trump’s repeated attacks, Sheinbaum has had to walk a thin line, appeasing him enough to try to avert potentially catastrophic tariffs while also showing fellow Mexicans that she is defending national sovereignty.\nShe has cooperated with Trump on several key measures, sending thousands of National Guard troops to fortify the northern border and transferring dozens of suspected cartel members wanted by the U.S.\nMexico’s president said her government asked TV stations to pull a Trump administration advertisement warning against undocumented migration to the U.S.\nBut she has pushed back when possible, suggesting Mexico would retaliate if the Trump administration carried out drone strikes in its territory, pushing a constitutional measure that effectively bans the planting of U.S. GMO corn and recently asking television stations to pull what she called “discriminatory” ads produced by the Trump administration warning against undocumented migration. Her approval ratings — which hover around 80% — are among the highest in the world for a head of state.\nShe seems to work the word for sovereignty — soberano — into almost every speech.\nTellingly, she has often invoked history in her effort to rally support.\nThis month she marked the anniversary of the sixth-month long U.S. occupation of the port city of Veracruz in 1914.\n“Mexico is and always will be a great country,” Sheinbaum told a stadium filled with smartly dressed naval officers. “We are neither a protectorate nor a colony of any foreign nation.”\nRecently, Sheinbaum used the word “traitor” to describe an opposition party member who voiced support for a U.S. effort to designate drug cartels as “terrorist” groups. She compared him with the conservative Mexicans who, in the 1850s, invited the French to help overthrow the liberal government of President Benito Juarez. The French ended up occupying Mexico for several years, briefly installing Ferdinand Maximilian Joseph, an Austrian duke, as emperor.\nBut it is the history of U.S. antagonism, with its roots in manifest destiny and President Polk’s obsession with territorial expansion, that Mexicans best remember. In 1845, the U.S. annexed Texas, a move Mexico rejected. After Mexican troops attacked U.S. soldiers in Texas on April 25, 1846, the U.S. formally declared war. The 1847 battle over Mexico City is recalled on the U.S. side in the opening line of the Marines’ Hymn: “From the Halls of Montezuma ...”\nThe U.S. and Mexico share a 2,000-mile long border and deep cultural, economic and family ties. Americans are largely welcomed with open arms and warm hospitality when they visit Mexico’s vibrant cities, archaeological ruins and vast beaches.\nBut if an undercurrent of hostility is at times detectable, Rosas says it is related to how Mexicans are educated about their history. While neighboring countries often have territorial disputes, he said Mexican governments, particularly those associated with the Institutional Revolutionary Party, made the U.S. the boogeyman in order to drum up domestic support, he said.\n“They needed a shared enemy,” Rosas said. “So they embraced very defensive, nationalistic and anti-interventionist politics.” It’s no mistake, he said, that the war between the U.S. and Mexico is often referred to as “the United States intervention.”\nAt the Niños Héroes monument, Mexicans reflected on that past and possible conflicts — economic ones — looming in the future.\nFelix de la Rosa, 64, a chemical engineer from the state of Coahuila, which borders Texas, says he visits the monument every time he’s in Mexico City.\n“As Mexicans, we have to unite for this new battle — which is a trade war,” he said. “But we shouldn’t bow our heads without fighting. I think the boy heroes are a great example, and that is how we should act, with great courage and dignity in the face of this new battle.”\nBut for some, the lesson of history is that Mexico may again suffer the fate of being neighbor to one of the most powerful countries in the world.\n“The truth is, our country doesn’t have the economic strength they have,” said Gerardo Santos, a 33-year-old businessman. “Our country is weaker, and President Trump knows this and takes advantage of it.”\n“In the end, the gringos will win again,” he said. “There’s nothing we can do about a man like Trump. The guy is crazy.”"
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-07-16/case-of-el-chapo-son-cooperating-with-u-s-prosecutors-roils-mexico",
      "text": "Case of ‘El Chapo’ son cooperating with U.S. prosecutors roils Mexico\n- Share via\nMEXICO CITY — A bitter public dispute between Mexican President Claudia Sheinbaum and the New York lawyer representing a son of drug kingpin Joaquín “El Chapo” Guzmán has raised speculation here that the deal-seeking scion of the onetime Sinaloa cartel leader may expose corrupt Mexican officials.\nOn Tuesday, Sheinbaum said she had filed a defamation complaint in Mexico against Jeffrey Lichtman, the high-profile attorney representing Ovidio Guzmán López, who last week pleaded guilty in federal court in Chicago to fentanyl trafficking and other crimes. He has agreed to cooperate with U.S. prosecutors in a bid to reduce a potential life sentence.\nIn comments after the court hearing, Lichtman labeled as “absurd” Sheinbaum’s repeated contentions that Washington should coordinate with Mexico on the case — especially if, as is widely expected, Guzmán López spills the beans on alleged ties between Mexican officials and cartels.\nIn an incendiary post on X, Litchman assailed the Mexican leader’s “corrupt office and government” and charged that Sheinbaum “acts more as the public relations arm of a drug trafficking organization than as the honest leader that the Mexican people deserve.”\nBy his own admission, Edgar Veytia ordered killings and torture and facilitated drug smuggling while he was governor of a Mexican state.\nThat sparked a flurry of denunciations from allies in Sheinbaum’s ruling Morena bloc, which dominates Mexican politics.\nErnestina Godoy Ramos, Sheinbaum’s official counsel, labeled Lichtman’s comments “grotesque and unforgivable, breaking the ethical and legal limits of the profession.”\nDeclared Sheinbaum: “I’m not going to establish a dialogue with a lawyer for [a] narco-trafficker.”\nLichtman also represented El Chapo — now serving a life sentence in a U.S. prison in Colorado — and is the attorney for Joaquín Guzmán López, another son of the drug lord. Like his brother, he is in U.S. custody and faces drug smuggling and other charges.\nMexico’s transfer of 29 cartel figures — including Rafael Caro Quintero and accused Zeta members — has led to jockeying by attorneys willing to defend them.\nEl Chapo’s sons, known as Los Chapitos, or the “Little Chapos,” assumed responsibility for cartel dealings after their father’s arrest in 2016, prosecutors say. Guzmán López was extradited to the United States in 2023 after being nabbed following a shootout outside Culiacán, the Sinaloa state capital, that left almost two dozen people dead, including 10 Mexican soldiers. Two other sons of El Chapo remain in Mexico directing cartel operations, according to U.S. officials.\nBehind the nasty contretemps between the New York barrister and la presidenta is a widespread sense here that Guzmán López is poised to dish a mound of dirt about Mexican politicians on the payroll of the Sinaloa cartel. He may have already done so.\nWhat else, political observers ask, could explain the special treatment that members of El Chapo’s family received in the spring?\nIn May, U.S. authorities escorted 17 members of El Chapo’s extended family — including his ex-wife, the mother of Ovidio and Joaquín — into San Diego from Tijuana. Although the U.S. Justice Department declined to comment, Mexico’s top law enforcement official said the move was probably part of a cooperation deal between Guzmán López and Washington.\n“He [Ovidio] must be singing,” said Guillermo Valdés Castellanos, a former intelligence chief in the administration of former President Felipe Calderón, a political adversary of Sheinbaum. “I think it’s part of a very clear strategy by the government of Donald Trump to pressure Mexico … to take action against the profound links between organized crime and and Mexican politics.”\nWhile frequently praising Sheinbaum, Trump has denounced the “intolerable alliance” between Mexico’s government and organized crime. Trump has imposed punishing tariffs on Mexico in what he calls an effort to shut down fentanyl trafficking.\nThough critics have called Trump’s characterizations overblown, the narco-government collaboration in Mexico goes back decades.\nCalderón’s top security official, Genaro García Luna, was convicted of taking millions of dollars in bribes from Sinaloa cartel traffickers and is serving a 38-year U.S. prison sentence.\nSheinbaum and her political mentor, former President Andrés Manuel López Obrador, hailed the U.S. prosecution of García Luna — a case that exposed deep corruption among their political rivals. But the tables may now be turning.\nThere have been no public disclosures about what Guzmán López may be secretly revealing to U.S. prosecutors. But speculation in Mexico has focused on the suspected crookedness of so-called narco-governors serving under the banner of Sheinbaum’s dominant Morena political bloc. None have been charged.\nMexican news reports suggest the U.S. recently orchestrated the secret, cross-border move of at least 17 relatives of Joaquín “El Chapo” Guzmán to California.\nBut even more explosive, experts say, would be any fresh allegations against López Obrador, Sheinbaum’s predecessor and the founder of Morena. During his six-year term, López Obrador repeatedly denied unconfirmed reports of having received political donations from people tied to organized crime.\nBy all accounts, any public airing of new accusations against López Obrador from U.S. authorities could trigger a political earthquake in Mexico.\n“There is total uncertainty and fear in the presidency,” said José Luis Montenegro, a Mexican journalist who wrote a book on Los Chapitos. “The politicians of Morena must be trembling.”\nSheinbaum has won widespread acclaim for her “coolheaded” approach to Trump provocations on issues such as tariffs, immigration and drug smuggling. But the Mexican president has sharply rebuked U.S. prosecutors’ apparent deal-making intentions with El Chapo’s son. She has accused U.S. authorities of hypocrisy — seeking cooperation from Guzmán López at a time when the Trump administration has designated the Sinaloa cartel and other Mexican crime groups as terrorist organizations.\n“So where is their position of ‘not to negotiate with terrorist groups’?” Sheinbaum asked this month.\nMexican leaders are still outraged about what they call the U.S.-orchestrated kidnapping almost a year ago of Ismael “El Mayo” Zambada — co-founder of El Chapo’s Sinaloa cartel — who is now also in custody in the United States.\nMexican officials suspect that U.S. authorities recruited Joaquín Guzmán López to abduct El Mayo, bundle him into a private plane and fly him to an airfield outside El Paso, where U.S. agents arrested both El Mayo and Joaquín Guzmán López.\nWashington has never clarified its role in the sensational case. The apparent betrayal of El Mayo set off a civil war in the cartel — pitting El Mayo loyalists against Los Chapitos — that has cost hundreds of lives in Sinaloa state.\nNow, three top accused Sinaloa cartel capos sit in U.S. custody, and at least one, Guzmán López, appears keen to make a deal that could expose a web of official corruption, roiling Mexican politics.\nSpecial correspodent Cecilia Sánchez Vidal contributed to this report."
    }
  ],
  "argos_summary": "President Trump has authorized U.S. military action against drug cartels, but Mexican President Claudia Sheinbaum firmly rejected the idea of U.S. troops on Mexican soil, emphasizing Mexico's sovereignty. Sheinbaum stated that while Mexico cooperates with the U.S. on drug trafficking issues, it will not accept military presence or strikes. The situation has heightened nationalist sentiments in Mexico, with fears that U.S. actions could lead to a return of historical grievances against American intervention. Additionally, the U.S. has imposed sanctions on Mexican banks linked to drug trafficking, further straining relations.",
  "argos_id": "ONHSR16IR"
}