{
  "url": "https://www.bbc.com/news/articles/c24z9m7rmv3o",
  "authorsByline": "Bill Edgar",
  "articleId": "1a031a0c2b0e4ef19b161dee44fd6bca",
  "source": {
    "domain": "bbc.com",
    "paywall": false,
    "location": {
      "country": "gb",
      "state": "",
      "county": "",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/7c5c/live/af26eec0-742d-11f0-876e-092c0a90f4e0.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T08:20:23.072000+00:00",
  "addDate": "2025-08-08T08:31:05.339349+00:00",
  "refreshDate": "2025-08-08T08:31:05.339351+00:00",
  "score": 1.0,
  "title": "Reform UK win Durham County Council Easington and Shotton by-election",
  "description": "Louise Penders vows to put the County Durham villages within her ward \"back on the map\".",
  "content": "Reform UK has won a by-election triggered by the resignation of a councillor due to ill health. Louise Penders was elected on to Durham County Council as representative for Easington and Shotton on Thursday, increasing the party's majority. The by-election had been called when former Reform councillor John Bailey stepped down in June. Reflecting on her win, the new councillor, who has lived in Easington since 2018, said: \"A huge thank you to everyone who has supported me with the campaign over the past few weeks.\"\n\nThe latest win is another boost for Reform after the party took control of Durham County Council for the first time in May. Penders secured 1,208 votes, with Angela Surtees of the Labour Party second on 523 and Independent Chris Hood third with 520 votes. The new Reform councillor vowed to put the villages within the ward \"back on the map in a positive light for all to see\", the Local Democracy Reporting Service said. Penders said: \"Next week cannot come quick enough, and we can start getting things done for Easington and Shotton. \"One of my biggest priorities is getting youth groups set up for kids and teenagers. At the moment, there is nothing for them to do.\"",
  "medium": "Article",
  "links": [
    "https://www.bbc.com/news/topics/crr7mlg0vqet",
    "https://www.facebook.com/bbcnortheast",
    "https://www.durham.gov.uk/",
    "https://www.bbc.com/news/topics/cp07jzgm24jt",
    "https://www.bbc.com/news/topics/cwdnmkzrz15t",
    "https://www.bbc.com/lnp/ldrs",
    "https://bbc.in/3yyMYUI",
    "https://www.instagram.com/bbcneandcumbria/",
    "https://x.com/BBCNEandCumbria",
    "https://www.bbc.co.uk/news/articles/cx2qz4vdnqgo"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Durham County Council",
      "weight": 0.11704675
    },
    {
      "name": "former Reform councillor John Bailey",
      "weight": 0.11255833
    },
    {
      "name": "Reform UK",
      "weight": 0.09527396
    },
    {
      "name": "Easington",
      "weight": 0.08731972
    },
    {
      "name": "Reform",
      "weight": 0.085854575
    },
    {
      "name": "Durham County Council Easington and Shotton by-election",
      "weight": 0.07736115
    },
    {
      "name": "youth groups",
      "weight": 0.076140426
    },
    {
      "name": "Next week",
      "weight": 0.07574629
    },
    {
      "name": "Independent Chris Hood",
      "weight": 0.07571946
    },
    {
      "name": "Angela Surtees",
      "weight": 0.07189674
    }
  ],
  "topics": [
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.984375
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.947265625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.88720703125
    },
    {
      "name": "/News/Local News",
      "score": 0.79150390625
    }
  ],
  "sentiment": {
    "positive": 0.40307617,
    "negative": 0.18933105,
    "neutral": 0.40771484
  },
  "summary": "Reform UK has won a by-election to Durham County Council, where Louise Penders was elected as representative for Easington and Shotton. The election was triggered by the resignation of former Reform councillor John Bailey due to ill health. Penders secured 1,208 votes, with Angela Surtees of the Labour Party second on 523 and Independent Chris Hood third with 520 votes. The win further strengthens Reform's control of Durham County council after they took control in May. Pender plans to set up youth groups and revitalise villages within the ward.",
  "shortSummary": "Reform UK won the Easington and Shotton by-election, increasing its majority to 35%, following its recent control of Durham County Council.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e881b5f40f9749099e9d2f3a54f43d0c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.bbc.com/news/topics/cp07jzgm24jt",
      "text": "Reform UK1 hr agoReform retake ward in council by-election winLouise Penders vows to put the County Durham villages within her ward \"back on the map\".1 hr ago31 Jul 2025Reform government would have to do unpopular things, says policy guruJames Orr, a friend of JD Vance and the man behind a new pro-Reform think tank, speaks to the BBC. 31 Jul 202530 Jul 2025Reform declares war on county's net-zero projectsMP Richard Tice and Lincolnshire mayor Andrea Jenkyns say they will fight green energy plans.30 Jul 202529 Jul 2025Reform look to cut spending on diversity trainingDawn Husemann says the party believes diversity, equity and inclusion training is \"discriminatory\"29 Jul 202529 Jul 2025Minister must apologise over Savile claim, says FarageMinister Peter Kyle claims that by opposing online safety laws the Reform UK leader is siding with sex offenders.29 Jul 202528 Jul 2025Reform-led council scraps diversity trainingDurham County Council removes equality, diversity, inclusion and climate change training modules.28 Jul 202524 Jul 2025Locals' views split on 19-year-old council leaderPeople in Warwick are split on the appointment of a 19-year-old Reform councillor to run the county council.24 Jul 202523 Jul 2025I don't care about my age, 19-year-old Reform council leader tells BBCGeorge Finch, the UK's youngest council leader at 19, had thought he would become a history teacher.23 Jul 202523 Jul 2025Council calls for Cornwall to be 'fifth UK nation'Cornwall Council wants the county to be officially on par with Scotland, Wales and Northern Ireland.23 Jul 2025..."
    },
    {
      "url": "https://www.bbc.com/news/topics/cwdnmkzrz15t",
      "text": "Easington1 hr agoReform retake ward in council by-election winLouise Penders vows to put the County Durham villages within her ward \"back on the map\".1 hr ago30 Jun 2025Portable devices 'life-changing' for patientsEast End Cancer Relief charity has donated hospital equipment worth almost £10,000.30 Jun 20259 Jun 2025Hundreds join search for missing 89-year-old manHumberside Police and volunteers look for Malcolm, who was last seen in Easington on Wednesday.9 Jun 20252 Jun 2025Benefit cap punishing poor children, study saysResearches claim child poverty rates are \"directly and strongly correlated\" to benefit caps. 2 Jun 202520 May 2025Coastal communities invited to discuss erosion The events are funded by the government as part of the £200m Flood and Coastal Innovation Programme.20 May 20254 May 2025Teesside stories you may have missed this weekStories from Teesside include attempts to incubate eggs after the death of the mother duck.4 May 20252 May 2025Ex-mining town worst hit by Pip cuts, study claimsResearchers look at the possible effects of disability benefit cuts across English constituencies.2 May 20251 Apr 2025Nature haven in woman's memory to 'change lives'Dr Sue Robson says she has a \"passion\" to help women affected by trauma and addiction. 1 Apr 20253 Mar 2025'Largest' beach angling contest to cast offThe fishing competition is held on the East Yorkshire coast between Bridlington and Spurn Point.3 Mar 2025..."
    },
    {
      "url": "https://www.bbc.com/lnp/ldrs",
      "text": "The journalists are funded by the BBC as part of its latest Charter commitment, but are employed by regional news organisations.\nA total of 165 reporters are allocated to news organisations in England, Scotland, Wales and Northern Ireland.\nThese organisations range from television and radio stations to online media companies and established regional newspaper groups.\nLocal Democracy Reporters cover top-tier local authorities, second-tier local authorities and other public service organisations.\nPrinciples of operation: Questions and answers\nStories written by the democracy reporters are shared with more than 1,100 media titles and outlets that have signed up to be part of the Local News Partnerships scheme.\nTo be awarded the democracy reporter contracts, the successful news organisations had to pass stringent criteria which included financial standing and a strong track record of relevant journalism in the area they were applying to cover.\nThe award decisions were made by senior editorial BBC figures.\nThe full list of organisations that were awarded contracts can be viewed here.\nLocal Democracy Reporter content can be downloaded via an online portal, accessed via a log-in code supplied to all qualifying news organisations.\nThe Local Democracy Reporting Service (LDRS) is a public service news agency: funded by the BBC, provided by the local news sector, and used by qualifying partners. It’s like a franchise: different companies with different approaches, but using common editorial standards and all publishing into the same system.\n- The core purpose of the LDRS is to provide impartial coverage of the regular business and workings of local authorities in the UK, and other relevant democratic institutions such as mayoralties, combined authority areas, P&CCs, quangos, etc.\n- The Local Democracy Reporters' (LDRs) brief is to report on the decision-making process: what decisions are made in the public's name and how they are arrived at, what evidence is presented to the council, etc.\n- The expectation is that LDRs shall endeavour to attend all meetings in person.\n- In two-tier council areas the LDRs should cover district council affairs sufficiently to ensure that significant decisions (eg planning) are reported.\n- LDRs may provide other stories which are focused on local democracy and which are in the public interest so long as that does not detract from the core purpose of the service.\n- All their work must be available to all qualifying partners.\n- National politics is out of scope, but election campaigns and constituency work of MPs, AMs, MSPs and MLAs that specifically relates to relevant local audiences may be covered so long as it does not detract from the core purpose of the LDRS.\nLDRs report to the contract holder, not to the BBC or any other partner.\nWith the guidance and support of the contract holder, LDRs work to the brief covering the stories of greatest public interest and they should not undertake commissions for any partner.\nDirect questions and clarifications relating to content are acceptable, but any suggestions or comments relating to the service should go through a LDR's manager.\nThe only difference between the BBC and others is that it has a right to request interviews or 2-ways for BBC Local Radio. Depending on workload and commitments it is up to each LDR to decide whether or not to agree.\nNo. While meeting the highest standards of accuracy and impartiality, written content may conform to an employer's normal style. BBC training will help create a common standard for media content production.\n- All content must be created for all qualifying partners.\n- Content should be published as soon as possible after a meeting or event.\n- All content must be published using the LDRS Authoring Tool so all partners see it simultaneously.\n- All content must be titled COUNCIL NAME: Story Name.\n- It must be tagged with at least one top-tier local authority, but can have as many tags as are relevant.\n- Images and media must have a descriptive label.\n- Images and media must be rights-free (LDRs should not use their employer’s picture library, or images supplied by agencies or freelance contributors).\n- LDRs should, where possible, assign a \"Feature Image\" to a story.\n- LDRs must provide an Advisory note in the publishing system before the end of every week indicating their diary for the next seven days (or longer).\n- LDRs should source their content. An explanatory Note to Editors at the end of a story regarding the source will reduce queries from partners, especially around whether qualified privilege applies to all or part of a story.\n- LDRs should not file a story based on a press release already in the public domain unless it has been significantly developed with new quotes or information.\n- Embargoed content must explain why publication should be delayed.\n- Posts should be via LDRs' personal accounts rather than contractors' branded accounts.\n- LDRs are encouraged to post an Advisory in the LDRS Authoring Tool to let partners know if they intend live-Tweeting from a meeting, for example.\n- Tagging #LDReporter will help the partnership collate relevant tweets.\n- LDRs should be credited as \"First Name, Last Name, Local Democracy Reporter\".\n- By-lines or references within copy are acceptable.\n- Broadcasters should acknowledge LDRs when they appear on air or when the format allows.\n- Shared credit with other reporters is acceptable if LDRs' content is copied, edited or incorporated into new pieces of work.\n- The LDRS logo can also be used in print, online or on TV, but is not compulsory.\n- LDRs should refer to themselves as \"Local Democracy Reporters\", not \"BBC Local Democracy Reporters\" in all forms of communication, including social media profiles.\n- Corrections and clarifications relating to previously published stories must be clearly highlighted and issued immediately.\n- The headline style should be as follows: 'COUNCIL NAME: Story Name - CORRECTION'.\n- The first paragraph of the body copy should be as follows: 'CORRECTION: An earlier version of this story incorrectly stated that…'."
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/cx2qz4vdnqgo",
      "text": "Reform UK council to hold second by-election\n- Published\nA second by-election is to be held at a newly led Reform UK council, just a month after the party swept to power.\nReform secured a landslide victory in May, winning 65 seats across County Durham to take control of the county council.\nEasington and Shotton councillor John Bailey has announced his resignation due to ill health.\nIt comes after former Benfieldside member Andrew Kilburn was forced to resign for failing to declare he was employed by the local authority. A by-election will be held there on 3 July.\nNational legislation means council employees are disqualified from standing as councillors simultaneously.\nConfirmation of Bailey's resignation was delivered on Monday, as his councillor profile page was removed from Durham County Council's website.\nReform won all three of the available seats within the East Durham ward during May's ballot. Bailey came top with 1,849 votes ahead of party colleagues Howard Brown and Louise Taylor.\nA party spokesman said: \"We are deeply saddened to learn of Mr Bailey's resignation as a result of a serious health issue.\n\"We are immensely grateful for him stepping forward to make a difference in his community.\n\"We wish John and his family the very best during this difficult time.\"\nBailey previously represented the Liberal Democrats but resigned from the party in 2009 due to \"irreconcilable differences\" and later represented the former Crook North ward as an Independent.\nA by-election is expected to be held for the vacancy later this summer, the Local Democracy Reporting Service understands.\nFollow BBC North East on X, external, Facebook, external, Nextdoor and Instagram, external\nGet in touch\nDo you have a story suggestion for BBC Wear?\nRelated topics\n- Published30 May"
    },
    {
      "url": "https://www.bbc.com/news/topics/crr7mlg0vqet",
      "text": "Durham County Council1 hr agoReform retake ward in council by-election winLouise Penders vows to put the County Durham villages within her ward \"back on the map\".1 hr ago2 days agoSchool that had one pupil to be turned into housesThe restoration and redevelopment works will create two homes of four and five bedrooms.2 days ago3 days agoAnti-social behaviour order powers extendedFour public space protection orders in County Durham, including Durham City, are extended to 2028.3 days ago3 days agoVillagers celebrate pub conversion plan refusalProposals to turn a Whorlton pub into a house are refused by Durham County Council.3 days ago3 days ago'Relief' after outdoor gym plans scrappedThe former bowling green is being used as a community garden.3 days ago4 days agoCare home to close over 'serious concerns'All residents at Howlish Hall move out following an inspection by the Care Quality Commission.4 days ago5 days agoDestruction of historic kiln causes mixed emotionsDurham County Council says its planning enforcement team is investigating the demolition.5 days ago7 days agoLack of church repairs lands 'highest ever' fineDurham County Council takes the owners of St Aidan's Church, in Blackhill, to court a second time.7 days ago28 Jul 2025Reform-led council scraps diversity trainingDurham County Council removes equality, diversity, inclusion and climate change training modules.28 Jul 2025..."
    },
    {
      "url": "https://bbc.in/3yyMYUI",
      "text": "Now in its fifth year, last week's performances drew audiences of 8,500 people - an increase of about 1,000 on the previous record-breaking year.\nDirector and co-founder Stephen Cronin said the organising team and more than 100 volunteers were \"exhausted\" as they wrapped up the event but were \"doing great\". https://bbc.in/3IM3q8R\nProposals to turn the former BT business centre at One Harton Quay in South Shields into a 125-bed student residence were approved by South Tyneside Council, with work on the four-storey, glass-fronted building expected to begin in September. https://bbc.in/41j57ka\nEdie Smart, from Monkseaton, North Tyneside, died in hospital on Monday, four days after being pulled from the water at Whitley Bay beach.\nWhitley Bay FC, where the youngster played, said it was \"devastated\" and planned to hold a minute's silence in her memory. https://bbc.in/4fdtmpT\nTeesside company BioConstruct NewEnergy said the facility, at Bishop Middleham, near Sedgefield, would process food waste and farmyard manure, producing methane gas which will be purified for the National Grid. https://bbc.in/4lPgRTR\nThe equality, diversity, inclusion and climate change modules were removed from the Member Induction and Development Programme on 13 June following a request from the leader of the council, Durham County Council said.\nLeader Andrew Husband told a full council meeting earlier this month that there was \"no requirement in law for councillors to complete equality, diversity and inclusion training\". https://bbc.in/40H18he\nThe Wear Rivers Trust said evidence of the mammals living on the River Deerness in County Durham showed the area was home to a diverse range of wildlife.\nA local resident spotted otters 38 times on his trail camera last year, while environmental groups regularly find otter droppings - known as spraints - in the area. https://bbc.in/44Sc1iO"
    }
  ],
  "argos_summary": "Reform UK has secured a by-election victory in Durham County Council, with Louise Penders elected as the new councillor for Easington and Shotton, increasing the party's majority. Penders received 1,208 votes, significantly ahead of her Labour and Independent opponents. She aims to enhance community services, particularly for youth, and her election follows Reform UK's recent control of the council.",
  "argos_id": "OYMZEBI6Z"
}