{
  "url": "https://gizmodo.com/this-seagate-expansion-card-for-xbox-is-back-at-its-record-low-price-possibly-amazons-quiet-clearance-2000640038",
  "authorsByline": "Jason Coles",
  "articleId": "204426bc727a430bbdfd48452072b03c",
  "source": {
    "domain": "gizmodo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://gizmodo.com/app/uploads/2025/08/seagate-deal-1200x675.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T21:15:55+00:00",
  "addDate": "2025-08-08T21:27:02.306263+00:00",
  "refreshDate": "2025-08-08T21:27:02.306264+00:00",
  "score": 1.0,
  "title": "This Seagate Expansion Card for Xbox Is Back at Its Record Low Price, Possibly Amazon’s Quiet Clearance",
  "description": "Download all of the games you want with no issues and $140 off.",
  "content": "Gaming these days is absolutely great. Not only do games run better than ever, and are generally more inventive, but they’re also far easier to access. Heck, even if you only play free games, you can explore a huge range of genres and styles with no issues. It does come with one big drawback though, and that’s having to deal with storage issues.\n\nWell, if you’re an Xbox Series X or S owner, you can fix that today by getting this Seagate 2TB Storage Expansion Card for just $220. That’s an absolutely massive $140 off the normal price, and this is one of the best storage options you can get for the Microsoft console. This deal isn’t likely to stick around for long though.\n\nMore Games All The Time\n\nA single game can end up being hundreds of gigabytes in size, especially if you’re someone who likes to play the latest triple-A titles. It means that even a large amount of space can end up gone in moments, and it’s one of the reasons so many people end up grabbing extra storage space when they can. However, finding the right one for your situation can be tough. It’s not tough at all here though, because this expansion card was quite literally made for the Xbox Series X and S.\n\nThis SSD expansion card works as soon as you plug it into your console. There’s no messy installation required, and because it’s not a PC, you barely have to do anything to open up your storage options. That’s a big win if you’re buying this for someone who isn’t as comfortable with tech stuff.\n\nIt boasts incredible speeds and has a data transfer rate of up to 5000 megabytes per second, and read speeds of 1200 megabytes per second. This basically means that any games you store on it will run smoothly, and to still get the same amazing gameplay experience you’d expect from your Xbox console. It even comes with a three-year warranty, just in case you’re someone who worries about these kinds of things, or has kids or pets who may or may not cause chaos around you at all times.\n\nIt’s easy to see why this massive storage device would normally cost you $360, so you shouldn’t miss out on this chance to get it for $220 instead. We’re not expecting it to stay at this price for very long, after all.",
  "medium": "Article",
  "links": [
    "https://shop.gizmodo.com/go/843/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "extra storage space",
      "weight": 0.08909138
    },
    {
      "name": "storage issues",
      "weight": 0.087126054
    },
    {
      "name": "Xbox Series X",
      "weight": 0.086195
    },
    {
      "name": "free games",
      "weight": 0.07545537
    },
    {
      "name": "More Games",
      "weight": 0.07303832
    },
    {
      "name": "games",
      "weight": 0.07121346
    },
    {
      "name": "Series X",
      "weight": 0.06910508
    },
    {
      "name": "Xbox",
      "weight": 0.06733241
    },
    {
      "name": "read speeds",
      "weight": 0.05903919
    },
    {
      "name": "incredible speeds",
      "weight": 0.05882195
    }
  ],
  "topics": [
    {
      "name": "Xbox"
    },
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.70263671875
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.57421875
    },
    {
      "name": "/Computers & Electronics/Consumer Electronics/Game Systems & Consoles",
      "score": 0.501953125
    },
    {
      "name": "/Games/Computer & Video Games/Other",
      "score": 0.3642578125
    },
    {
      "name": "/News/Technology News",
      "score": 0.325927734375
    }
  ],
  "sentiment": {
    "positive": 0.21398926,
    "negative": 0.29589844,
    "neutral": 0.48999023
  },
  "summary": "Seagate 2TB Storage Expansion Card for the Xbox Series X or S is available for $220, a significant $140 discount from its normal price. This is one of the best storage options available for the Microsoft console. The expansion card was designed for the Series X and S and comes with a data transfer rate of up to 5000 megabytes per second, and read speeds of 1200 megabytes each second. It is also designed to provide a smooth gameplay experience and is not a PC, so there is no messy installation required. The price is expected to fluctuate due to Amazon's Quiet Clearance.",
  "shortSummary": "Seagate's 2TB Storage Expansion Card for Xbox Series X and S is a record low, offering excellent gaming and high storage speeds, with a three-year warranty.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ec0ba50d72854c8aa65f19dd6e9430d7",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The article highlights the benefits of gaming today, emphasizing improved performance and accessibility, while also addressing storage challenges faced by gamers. It promotes the Seagate 2TB Storage Expansion Card for Xbox Series X and S, currently available for $220, a significant discount from its usual price of $360. The expansion card offers easy installation, high data transfer speeds, and a three-year warranty, making it an ideal solution for gamers needing extra storage.",
  "argos_id": "P42MH37FD"
}