{
  "url": "https://www.nytimes.com/2025/08/08/opinion/democrats-gaza-klobuchar-booker.html",
  "authorsByline": "Lydia Polgreen",
  "articleId": "ccbfb8ff4b5146fd8806c1483c5cc1dd",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/images/2025/08/07/opinion/00polgreen/00polgreen-facebookJumbo.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T05:00:08.129000+00:00",
  "addDate": "2025-08-08T05:08:48.546996+00:00",
  "refreshDate": "2025-08-08T05:08:48.546998+00:00",
  "score": 1.0,
  "title": "Democrats Are Finally, Slowly, Changing Their Minds on Israel",
  "description": "Amy Klobuchar has taken a crucial step toward the view of the party’s base.",
  "content": "Amy Klobuchar, the senior senator from Minnesota, appeared last month in a photograph with Benjamin Netanyahu. Wearing a tight-lipped smile alongside a bipartisan group of senators, she hardly seemed thrilled to be there. But there she was, posing with a man who is wanted for war crimes by the International Criminal Court and has been credibly accused of committing genocide in Gaza. The picture, snapped as alarm was growing over looming famine in Gaza and Israel pursued its pitiless military assault on the enclave, struck me as a maddening but apt illustration of the yawning gulf between the steadfast pro-Israel stance of leading Democratic politicians and their voters. It was, sadly, par for the grisly course. Then last week Klobuchar did something that genuinely surprised me: She voted in favor of a pair of resolutions put forward by Senator Bernie Sanders of Vermont, a leading critic of Israel’s prosecution of the war, that would block the transfer of key offensive weapons to Israel, including 1,000-pound bombs and automatic assault rifles. She was joined in one of the votes by 24 other Democrats and two independents, a majority of the Democratic caucus. Many were seeking to block weapons for Israel for the first time. And not just any Democrats. The ranking members of crucial committees — Foreign Relations, Appropriations and Armed Services — voted to block the transfers as well. A number of notable moderates joined the vote, including one of the most vulnerable in the 2026 midterms, Georgia’s Jon Ossoff.\n\nPredictably, like all the other measures to limit Israel’s warmaking with American weapons Sanders has tried to bring to the floor of the Senate, the resolutions failed. The entire Republican caucus, joined by the rest of the voting Democrats, voted them down. It may sound strange to find hope in a failed vote, especially given the dire situation in Gaza. And yet I do. Klobuchar’s vote in particular seemed a meaningful change from a powerful and canny operator who is among the most ambitious of her generation of Democratic politicians. It was a signal, belated but significant, that the Democrats are finally shifting their position on Israel.\n\n“I attended so I could make the case for more humanitarian aid and to stop the displacement of Palestinians,” she said in a statement. “I did that but I did not get a good answer. I’ve supported military assistance to Israel in the past, and I have made it clear that I believe Israel has a right to defend itself. But I believe at this moment in time it’s crucial that the Israeli government must do more to alleviate the urgent humanitarian crisis.” That is not exactly a rousing condemnation of Israel’s conduct in the war. But her vote was nonetheless a crucial step by a Democratic leader toward the views of the party’s base, which is deeply frustrated by the feckless response to the Trump administration and angry at the failure to stop the slaughter in Gaza. A Gallup poll published last week found that just 8 percent of Democrats support Israel’s military action in Gaza, a new low. Democrats’ sympathy with Israel has been falling for about a decade. But in the past year, despite the broad outpouring of support in 2023 after the Hamas attack on Israel on Oct. 7, it has plummeted. It is not hard to see why. The United States has sent billions of dollars’ worth of weapons to Israel, which have been used to wage a relentless war of total destruction, killing more than 60,000 people, including at least 18,000 children, according to Gazan health officials. American weapons, paid for with American tax dollars, have helped Israel transform much of Gaza — its homes, hospitals and schools — into rubble. With Israel limiting aid to Gaza, its two million people now face starvation. Watching this horror unfold, many Americans have turned away from Israel. Their leaders seem to be in denial about this. Klobuchar was not the only prominent Democrat in that photo with Netanyahu; six others joined her, including Schumer, who declared earlier this year that he sees it as his job “to keep the left pro-Israel.” The rest were, like Klobuchar and Schumer, almost entirely from reliably blue states — Delaware, New Jersey, Washington and California.\n\nThe only real challenges to those Democrats’ power would come from primary candidates to their left. Among them, just Jacky Rosen of Nevada represents a swing state, though she won’t face voters again until 2030. You would have thought it would be safe for them to at least show some awareness of the depth of voters’ feelings about the situation in Gaza. And yet Klobuchar was the only Democratic member of that delegation to vote against arms for Israel. Perhaps the most baffling among the senators who met with Netanyahu last month is Cory Booker of New Jersey, who has styled himself as a happy warrior against Donald Trump. Back in March, he delivered the longest speech in the history of the Senate, holding the floor for more than 25 hours to excoriate the Trump administration’s gutting of government agencies, lawless deportation regime, plans to slash benefits for the poor and more. These are all important issues to Democratic voters, to be sure. But over those many hours, though Booker made only three glancing references to Gaza — one of them to note that as a young man he had done humanitarian work there — there was not a whisper of condemnation of Netanyahu’s conduct of the war. Nor did he condemn Trump’s bizarre plan, announced just weeks earlier, to ethnically cleanse Palestinians from Gaza and build an American-owned “riviera” on their land. Two days after his record-breaking speech, Booker voted against one of Sanders’s many efforts to limit arms sales to Israel. Booker shares many of Klobuchar’s ambitions. He sits one notch below her in the Senate’s byzantine hierarchy, and like her, he is often mentioned as a possible contender to replace Schumer. Booker, too, ran for his party’s presidential nomination in 2020 and is likely to run in 2028. At one time, his staunch support of Israel might have been a boon to those ambitions. These days, it may well have the opposite effect.\n\nStarvation is a lagging indicator, a catastrophic result of disastrous decisions made long before the first hints of hunger. In war, it is at best a result of heedless indifference. At worst, it is evidence of the gravest of crimes. Raphael Lemkin, the Polish lawyer who coined the term “genocide,” was preoccupied with the use of deliberate starvation as a weapon of war, in one early essay quoting a Nazi field marshal who described it as “better than machine guns.” Most of all, starvation is almost never a surprise. In Gaza, where plenty of food, water, fuel and medicine sits just beyond its borders, scores have died of hunger, a slow, gruesome process endured by people living in the most desperate circumstances imaginable. A “worst-case scenario of famine is currently playing out,” the I.P.C., a global group that tracks hunger, said in its latest assessment. Some 20,000 children have been admitted to health centers for acute malnourishment. But these conditions were created. From the earliest days of the war, it has seemed impossible to overstate its chaos and violence and the brutal toll it has taken on civilians. Almost all of Gaza’s two million people have had to flee their homes at least once since the war began. The crisis continues to deepen: According to the United Nations, 762,500 people have been displaced since the end of the cease-fire in March. Gaza’s people have been packed into narrow slivers of the tiny territory. Even if they are eventually allowed to leave those areas, few will find their homes intact: Since March, Israel has been demolishing thousands of buildings across Gaza, according to a visual investigation by the BBC. After Israel ended the cease-fire, it blocked humanitarian aid to Gaza for two and a half months. Since late May, it has allowed aid distribution almost entirely through the opaque Gaza Humanitarian Foundation, operated by security contractors, requiring hungry people to walk miles through an active war zone to get food. More than 1,000 people have been killed in these violent, chaotic distributions, according to the U.N. A report by the aid group Doctors Without Borders published on Thursday called it “a system of institutionalized starvation and dehumanization.” In recent days, Israel has allowed drops by air, but they are inefficient and dangerous.\n\nOn Wednesday, Cindy McCain, the head of the United Nations World Food Program, posted a plea for Israel to allow more aid by land. “We can’t airdrop our way out of an unfolding famine,” she wrote. “Gaza is out of food and out of time.” As these decisions build upon one another, it has become harder to wave aside the gathering evidence, often presented by Israeli experts, that Israel is engaged in a historic crime. In a report emblazoned with the headline “Our Genocide,” one of Israel’s leading human rights organizations, B’Tselem, called Israel’s campaign in Gaza “a clear and explicit attempt to destroy Palestinian society in Gaza and create catastrophic living conditions that prevent the continued existence of this society in Gaza.” Another major group, Physicians for Human Rights Israel, declared that Israel is engaged in “a deliberate, cumulative dismantling of Gaza’s health system, and with it, its people’s ability to survive.” Both agreed Israel’s actions amounted to genocide. Netanyahu seems utterly unbowed by such conclusions: On Thursday, he announced that Israel planned to expand its military occupation to include all of Gaza. Starvation has a peculiar hold on the human conscience. Every person knows, in some small way, what it is to feel hunger with no means to satisfy it. It requires little imagination to extend that sensation, to imagine it afflicting the people you love. It compels you ask how that hunger came to be, what steps were required and who took them — and what might be needed to stop it. Votes by Klobuchar and other moderates in favor of a doomed effort to block a fraction of the billions of taxpayer dollars that finance weapons for Israel, after years of supporting its increasingly ethnonationalist government, are unlikely to rate as senatorial profiles in courage. But they are a sign that at least some American leaders are beginning to ask these questions. Elite opinion, too, is a lagging indicator, often trailing behind conscience and political necessity by months or even years. Sometimes, though, it can catch up.",
  "medium": "Article",
  "links": [
    "https://www.whatsapp.com/channel/0029VaN8tdZ5vKAGNwXaED0M",
    "https://www.booker.senate.gov/senator-bookers-marathon-speech",
    "https://www.tiktok.com/@nytopinion",
    "https://www.ipcinfo.org/ipcinfo-website/countries-in-focus-archive/issue-133/en/",
    "https://www.msf.org/not-aid-orchestrated-killing",
    "http://www.preventgenocide.org/lemkin/freeworld1945.htm",
    "https://www.facebook.com/nytopinion",
    "https://www.btselem.org/publications/202507_our_genocide",
    "https://www.nytimes.com/2025/08/07/world/middleeast/israel-gaza-military-offensive.html",
    "https://bsky.app/profile/nytopinion.nytimes.com",
    "https://www.nytimes.com/2019/01/31/opinion/letters/letters-to-editor-new-york-times-women.html",
    "https://www.instagram.com/nytopinion/",
    "https://www.phr.org.il/en/genocide-in-gaza-eng/",
    "https://news.gallup.com/poll/657404/less-half-sympathetic-toward-israelis.aspx",
    "https://x.com/WFPChief/status/1953200085036405009",
    "https://watson.brown.edu/costsofwar/papers/2024/USspendingIsrael",
    "https://help.nytimes.com/hc/en-us/articles/115014925288-How-to-submit-a-letter-to-the-editor",
    "https://www.nytimes.com/2025/03/18/opinion/schumer-trump-antisemitism.html",
    "https://www.bbc.co.uk/news/resources/idt-33fccfbe-abcc-4af1-bdd2-632b2787cf59",
    "https://news.gallup.com/poll/692948/u.s.-back-israel-military-action-gaza-new-low.aspx",
    "https://www.threads.net/@nytopinion"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Israel",
      "weight": 0.08176829
    },
    {
      "name": "Human Rights Israel",
      "weight": 0.074404836
    },
    {
      "name": "Gaza",
      "weight": 0.068378575
    },
    {
      "name": "Gaza Humanitarian Foundation",
      "weight": 0.06355586
    },
    {
      "name": "more humanitarian aid",
      "weight": 0.054626036
    },
    {
      "name": "more aid",
      "weight": 0.051180575
    },
    {
      "name": "war crimes",
      "weight": 0.050573867
    },
    {
      "name": "hungry people",
      "weight": 0.05037442
    },
    {
      "name": "people",
      "weight": 0.049966797
    },
    {
      "name": "war",
      "weight": 0.04757325
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.994140625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.89892578125
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.7998046875
    }
  ],
  "sentiment": {
    "positive": 0.1274414,
    "negative": 0.6113281,
    "neutral": 0.26123047
  },
  "summary": "Amy Klobuchar, the senior senator from Minnesota, has been seen as a significant change in her party's stance on Israel, despite previously supporting a pro-Israel stance. She recently voted in favor of two resolutions by Senator Bernie Sanders, a leading critic of Israel's prosecution of the war, to block the transfer of key offensive weapons to Israel, including 1,000-pound bombs and automatic assault rifles. The resolution was supported by 24 other Democrats and two independents, a majority of the Democratic caucus, many of whom were seeking to block weapons for Israel for the first time. However, these measures failed, with the entire Republican caucus voting down. A Gallup poll found that only 8 percent of Democrats support Israel's military action in Gaza, a new low for Democrats' sympathy with Israel. Democrats’ sympathy with the country has been falling for a decade, with support for the Hamas attack on Israel plummeting in the past year. The only real challenges would come from non-partisan states, Delaware, Washington and California, and California.",
  "shortSummary": "Despite a photo with Benjamin Netanyahu, Democrats are slowly changing their stance on Israel, voting against multiple resolutions to block Israeli weapons transfers amid Gaza's conflict.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2c5c02f53cb64bb4a16cce2a98f303a6",
  "places": [],
  "scraped_sources": [
    {
      "url": "http://www.preventgenocide.org/lemkin/freeworld1945.htm",
      "text": "|\nGenocide - A Modern\nCrime\nBy Raphael Lemkin , April 1945\n|\nIntroduction\nPOLITICALInternational Implications\n|\nGenocide - A Modern Crime \"ONE of the great mistakes of 1918 was to spare the civil life of the enemy countries, for it is necessary for us Germans to be always at least double the numbers of the peoples of the contiguous countries. We are therefore obliged to destroy at least a third of their inhabitants. The only means is organized underfeeding which in this case is better than machine guns.\" The speaker was Marshal von Rundstedt addressing the Reich War Academy in Berlin in 1943. He was only aping the Fuhrer who had said, \"Natural instincts bid all living human beings not merely conquer their enemies but also destroy them. In former days it was the victor's prerogative to destroy tribes, entire peoples.\" Hitler was right. The crime of the Reich in wantonly and deliberately wiping out whole peoples is not utterly new in the world. It is only new in the civilized world as we have come to think of it. It is so new in the traditions of civilized man that he has no name for it. It is for this reason that I took the liberty of inventing the word, \"genocide.\" The term is from the Greek word genes meaning tribe or race and the Latin cide meaning killing. Genocide tragically enough must take its place in the dictionary of the future beside other tragic words like homicide and infanticide. As Von Rundstedt has suggested the term does not necessarily signify mass killings although it may mean that. More often it refers to a coordinated plan aimed at destruction of the essential foundations of the life of national groups so that these groups wither and die like plants that have suffered a blight. The end may be accomplished by the forced disintegration of political and social institutions, of the culture of the people, of their language, their national feelings and their religion. It may be accomplished by wiping out all basis of personal security, liberty, health and dignity. When these means fail the machine gun can always be utilized as a last resort. Genocide is directed against a national group as an entity and the attack on individuals is only secondary to the annihilation of the national group to which they belong. Such terms as \"denationalization\" or \"Germanization\" which have been\nused till now do not adequately convey the full force of the new phenomenon\nof genocide. They signify only the substitution of the national pattern\nof the oppressor for the original national pattern but not the destruction\nof the biological and physical structure of the oppressed group.\nPhilosophy of Genocide GERMANY has transformed an ancient barbarity into a principle of government by dignifying genocide as a sacred purpose of the German people. National Socialism is the doctrine of the biological superiority of the German people. Long before the war nazi leaders were unblushinghly announcing to the world and propagandizing to the Germans themselves the program of genocide they had elaborated. Like Hitler and Von Rundstedt, the official nazi philosopher Alfred Rosenberg declared \"History and the mission of the future no longer mean the struggle of class against class, the struggle of church dogma against dogma, but the clash between blood and blood, race and race, people and people.\" As the German war machine placed more and more defeated nations under the full control of nazi authorities, their civilian populations found themselves exposed to the bloodthirsty and methodical application of the German program of genocide. A hierarchy of racial values determined the ultimate fate of the many\npeoples that fell under German domination. Jews were to be completely\nannihilated. The Poles, the Slovenes, the Czechs, the Russians, and all\nother inferior Slav peoples were to be kept on the lowest social levels.\nThose felt to be related by blood, the Dutch, the Norwegian, the Alsatians,\netc., were to have the alternatives of entering the German community by\nespousing \"Germanism\" or of sharing the fate of the inferior peoples. Techniques of Genocide All aspects of nationhood were exposed to the attacks of the genocidal\npolicy. The political cohesion of the conquered countries was intended to be weakened by dividing them into more or less self-contained and hermetically enclosed zones, as in the four zones of France, the ten zones of Yugoslavia, the five zones of Greece; by partitioning their territories to create puppet states, like Croatia and Slovakia; by detaching territory for incorporation in the Greater Reich, as was done with western Poland, Alsace-Lorraine, Luxembourg, Slovenia. Artificial boundaries were created to prevent communication and mutual assistance by the national groups involved. In the incorporated areas of western land, Luxembourg, Alsace-Lorraine, Eupen, Malmedy, Moresnet, local administrations were replaced by German administrative organization. The legal system was recast on the German model. Special Commissioners for the strengthening of Germanism, attached to each administration, coordinated the activities designed to foster and promote Germanism. They were assisted by local inhabitants of German origin. These, duly registered and accredited, served as a nucleus of Germanism and enjoyed special privileges in respect to food rations, employment and position. National allegiances were impaired by creating puppet governments, as\nin Greece, Norway and France, and by supporting national Nazi parties.\nWhere the people, such as the Poles, could not achieve the dignity of\nembracing Germanism, they were expelled from the area and their territory\n(western Poland) was to be Germanized by colonization. The social structure of a nation is vital to its national development.\nTherefore the German occupant endeavored to bring about changes that weakened\nnational spiritual resources. The focal point of this attack has been\nthe intelligentsia, because this group largely provides leadership. In\nPoland and Slovenia the intellectuals and the clergy were to a large extent\neither murdered or removed for forced labor in Germany. Intellectuals\nand resistants of all occupied countries were marked for execution. Even\namong the blood-related Dutch some 23,000 were killed, the greater number\nof them being leading members of their communities. In Poland, although Poles could receive vocational training, they were\ndenied any liberal arts training since that might stimulate independent\nnational thinking. To prohibit artistic expression of a national culture,\nrigid controls were established. Not only were the radio, the press, and\nthe cities closely supervised, but every painter, musician, architect,\nsculptor, writer, actor and theatrical producer required a license to\ncontinue his artistic activities. Wherever religion represented a vital influence in the national life,\nthe spiritual power of the Church was undermined by various means. In\nLuxembourg children over 14 were protected by law against criticism if\nthey should renounce their religious affiliations for membership in nazi\nyouth organizations. In the puppet state of Croatia an independent, but\nGerman-dominated Orthodox Church was created for Serbs, in order to destroy\nforever the spiritual ties with the Patriarch at Belgrade. With the special\nviolence and thoroughness reserved for Poles and Jews, Polish church property\nwas pillaged and despoiled and the clergy subjected to constant persecution.\nHand in hand with the undermining of religious influence went devices\nfor the moral debasement of national groups. Pornographic publications\nand movies were foisted upon the Poles. Alcohol was kept cheap although\nfood became increasingly dear, and peasants were legally bound to accept\nspirits for agricultural produce. Although under Polish law gambling houses\nhad been prohibited, German authorities not only permitted them to come\ninto existence, but relaxed the otherwise severe curfew law. The genocidal purpose of destroying or degrading the economic foundations\nof national groups was to lower the standards of living and to sharpen\nthe struggle for existence, that no energies might remain for a cultural\nor national life. Jews were immediately deprived of the elemental means\nof existence by expropriation and by forbidding them the right to work.\nPolish property in western incorporated Poland was confiscated and Poles\ndenied licenses to practice trades or handicrafts, thus reserving trade\nto the Germans. The Post Office Savings Bank in western Poland taken over\nby the occupying authorities, assured the financial superiority of Germans\nby repaying deposits only to certificated Germans. In Slovenia the financial\ncooperatives and agricultural associations were liquidated. Among the\nblood-related peoples (Luxembourgers, Alsatians) the acceptance of Germanism\nwas the criterion by which participation in the economic life was determined.\nThe genocidal policy was far-sighted as well as immediate in its objectives.\nOn the one hand an increase in the birth rate, legitimate or illegitimate,\nwas encouraged within Germany and among Volksdeutsche in the occupied\ncountries. Subsidies were offered for children begotten by German military\nmen by women of related blood such as Dutch and Norwegian. On the other\nhand, every means to decrease the birth rate among \"racial inferiors\"\nwas used. Millions of war prisoners and forced laborers from all the conquered\ncountries of Europe were kept from contact with their wives. Poles in\nincorporated Poland met obstacles in trying to marry among themselves.\nChronic undernourishment, deliberately created by the occupant, tended\nnot only to discourage the birth rate but also to an increase in infant\nmortality. Coming generations in Europe were thus planned to be predominantly\nof German blood, capable of overwhelming all other races by sheer numbers.\nThe most direct and drastic of the techniques of genocide is simply murder. It may be the slow and scientific murder by mass starvation or the swift but no less scientific murder by mass extermination in gas chambers, wholesale executions or exposure to disease and exhaustion. Food rations of all territory under German domination were established on racial principles, ranging in 1943 from 93 per cent of its pre-war diet for the German inhabitants to 20 per cent of its pre-war diet for the Jewish population. A carefully graduated scale allowed protein rations of 97 per cent to Germans, 95 per cent to the Dutch, 71 per cent to the French, 38 per cent to the Greeks and 20 per cent to the Jews. For fats, where there was the greatest shortage, the rations were 77 per cent to the Germans, 65 per cent to the Dutch, 40 per cent to the French and 0.32 per cent to the Jews. Specific vitamin deficiencies were created on a scientific basis. The rise in the death rate among the various groups reflects this feeding program. The death rate in the Netherlands was 10 per thousand; Belgium 14 per thousand; Bohemia and Moravia 13.4 per thousand. The mortality in Warsaw was 2.160 Aryans in September 1941 as compared to 800 in September 1938, and for the Jews in Warsaw 7,000 in September 1941 as against 306 in Septeniber1938. Such elementary necessities of life as warm clothing, blankets and firewood in winter were either withheld or requisitioned from Poles and Jews. Beginning with the winter of 1940-1941 the Jews in the Warsaw Ghetto received no fuel at all. Even God's clean air was denied - the Jews in the overcrowded ghettos were forbidden the use of public parks. The authoritative report of the War Refugee Board published in November 1944, and the overwhelming new evidence that appears daily of the brutal mass killings that have taken place in such notorious \"death camps\" as Maidanek and Oswiecim are sufficient indication of the scope of the German program. In Birkenau alone between April 1942 and April 1944 approximately 1,765,000\nJews were gassed. Some 5,600,000 Jews and around 2,000,000 Poles have\nbeen murdered or died as a result of the extermination policies. Whole\ncommunities have been exterminated. It is estimated, for instance, that\nof the 140,000 Dutch Jews who lived in the Netherlands before occupation,\nonly some 7,000 now survive, the rest being transferred to Poland for\nslaughter. International Implications WHY should genocide be recognized as an international problem? Why not treat it as an internal problem of every country, if committed in time of peace, or as a problem between belligerents, if committed in time of war? The practices of genocide anywhere affect the vital interests of all civilized people. Its consequences can neither be isolated nor localized. Tolerating genocide is an admission of the principle that one national group has the right to attack another because of its supposed racial superiority. This principle invites an expansion of such practices beyond the borders of the offending state, and that means wars of aggression. The disease of criminality if left unchecked is contagious. Minorities of one sort or another exist in all countries, protected by the constitutional order of the state. If persecution of any minority by any country is tolerated anywhere, the very moral and legal foundations of constitutional government may be shaken. International trade depends on the confidence in the ability of individuals participating in the interchange of goods to fulfill their obligations. Arbitrary and wholesale confiscations of the properties and economic rights of whole groups of citizens of one state deprives them of the possibilities of discharging their obligations to citizens of other states, who thereby are penalized. A source of international friction is created by unilateral withdrawal of citizen rights and even by expulsion of whole minority groups to other countries. The expulsion of law-abiding residents from Germany before this war has created friction with the neighboring countries to which these people were expelled. Moreover mass persecutions force mass flight. Thus the normal migration between countries assumes pathological dimensions. Our whole cultural heritage is a product of the contributions of all\npeoples. We can best understand this if we realize how impoverished our\nculture would be if the so-called inferior peoples doomed by Germany,\nsuch as the Jews, had not been permitted to create the Bible or to give\nbirth to an Einstein, a Spinosa; if the Poles had not had the opportunity\nto give to the world a Copernicus, a Chopin, a Curie, the Czechs a Huss,\nand a Dvorak; the Greeks a Plato and a Socrates; the Russians, a Tolstoy\nand a Shostakovich. Safeguards and Remedies THE significance of a policy of genocide to the world order and to human culture is so great as to make it imperative that a system of safeguards be devised. The principle of the international protection of minorities was proclaimed by post-Versailles minority treaties. These treaties, however, were inadequate because they were limited to a few newly created countries. They were established mainly with the aim of protecting political and civil rights, rather than the biological structure of the groups involved; the machinery of enforcement of such political rights was as incomplete as that of the League of Nations. Under such conditions the genocide policy begun by Germany on its own Jewish citizens in 1933 was considered as an internal problem which the German state, as a sovereign power, should handle without interference by other states. Although the Hague Regulations were concerned with the protection of civilians under control of military occupants, they did not foresee all the ingenious and scientific methods developed by Germany in this war. Genocide is too disastrous a phenomenon to be left to fragmentary regulation. There must be an adequate mechanism for international cooperation in the punishment of the offenders. The crime of genocide includes the following elements:\n_________ RAPHAEL LEMKIN is Polish but his viewpoint is international and his understanding of the nazi menace is of more than recent date. This former League of Nations specialist was a member of the International Bureau for Unification of Criminal Law. At the Madrid Conference of 1933 he introduced the first proposal ever made to outlaw nazism by declaring it a crime. His idea was that any Nazi who put his foot abroad should be punished by the government of the country he entered. Dr. LEMKIN, now teaching at Duke University, has served as a consultant to the United States on economic warfare and on military government. His article in this issue coins a new word for the English dictionary to fit nazi organized brutality. He calls it genocide. Previous\ntext in the Series:\nAxis Rule in Occupied Europe (1944)\n|\n|\n|\n|\n|\n|\n|\n||\n|\n|\n|\n|\n|\n|\n|"
    },
    {
      "url": "https://watson.brown.edu/costsofwar/papers/2024/USspendingIsrael",
      "text": "U.S. spending on Israel’s military operations and related U.S operations in the region total at least $22.76 billion and counting. This estimate is conservative; while it includes approved security assistance funding since October 7, 2023, supplemental funding for regional operations, and an estimated additional cost of operations, it does not include any other economic costs.\nThis figure includes the $17.9 billion the U.S. government has approved in security assistance for Israeli military operations in Gaza and elsewhere since October 7 – substantially more than in any other year since the U.S. began granting military aid to Israel in 1959. Yet the report describes how this is only a partial amount of the U.S. financial support provided during this war.\nRelated U.S. military operations in the broader region since October 7 are part of the fuller picture. In particular, the U.S. Navy has significantly scaled up its defensive and offensive operations against Houthi militants in Yemen, which the Houthis claim is related to Israel’s war in Gaza. Hostilities have escalated to become the most sustained military campaign by U.S. forces since the 2016-2019 air war against ISIS in Iraq and Syria. U.S. operations in the region, including in Yemen, have already cost the U.S. government $4.86 billion (included in the overall figure, above, of $22.76 billion).\nThis Houthi-related conflict has also cost the maritime trade an additional $2.1 billion, because shippers have been forced to divert vessels or pay exorbitant insurance fees. U.S. consumers may experience paying higher prices for goods as a result.\nThis report touches on the relationship between U.S. weapons manufacturers and the Israeli government, which have maintained longstanding commercial relations. The U.S. government has cited these commercial ties as one of the reasons why the U.S. should continue to supply foreign militaries, including the Israeli military, with weapons and equipment.\nRead the related paper, The Human Toll: Indirect Deaths from War in Gaza and the West Bank, October 7, 2023 Forward >"
    },
    {
      "url": "https://news.gallup.com/poll/692948/u.s.-back-israel-military-action-gaza-new-low.aspx",
      "text": "WASHINGTON, D.C. — Americans’ approval of Israel’s military action in Gaza has fallen 10 percentage points since the prior measurement in September, and it is now at 32%, the lowest reading since Gallup first asked the question in November 2023. Disapproval of the military action has now reached 60%.\nThese findings are from a July 7-21, 2025, Gallup poll, as Israel’s campaign against Hamas stretched into its 21st month. Americans supported Israel’s actions in Gaza in its initial reading in 2023, taken several weeks after the Oct. 7 Hamas attack. Since then, disapproval has outpaced approval in each survey, peaking at 55% in March 2024 before dipping to 48% in two readings later in the year.\nAmericans Sharply Divided by Party Over Israel’s Actions\nThe decline in approval is driven by 16-point drops among both Democrats and independents. As has been the case since the start of the conflict, independents (25%) express higher approval than Democrats (8%), but both groups currently register their lowest readings to date. In contrast, 71% of Republicans say they approve of Israel’s action in Gaza, up from 66% in September.\nApproval of Israel’s Military Action in Iran Slightly Higher Than in Gaza\nThe July survey also asked about support for Israel’s military action targeting suspected nuclear enrichment and military sites in Iran. Currently, 38% of Americans express approval of this military action; 54% disapprove. Seventy-eight percent of Republicans, 31% of independents and 12% of Democrats approve.\nWhile estimates differ on how much the attack set back Iran’s ability to develop a nuclear weapon, concerns that the action, which included a military assist from the U.S., could spark a wider war have not materialized.\nNetanyahu Rated Unfavorably by Majority of Americans for First Time\nFifty-two percent of Americans now view Benjamin Netanyahu unfavorably, his highest unfavorable rating since 1997. His favorable rating stands at 29%, while 19% of U.S. adults have no opinion of him.\nUntil December 2023, Americans viewed Netanyahu more positively than negatively, except in 1997, when he was less well known. In the December 2023 poll, Netanyahu’s unfavorable rating far outpaced his 33% favorable rating, with the current poll showing a continued deterioration in his image.\nNetanyahu’s unfavorable rating has roughly doubled since 2019, the last reading before the start of the current conflict. The increase in unfavorability has been accompanied by roughly equal decreases in his favorable rating (down 11 points) and the percentage with no opinion of the Israeli leader (down 14 points).\nDuring the poll’s field period, Netanyahu visited the U.S. to meet with President Donald Trump and other political leaders. Although the Trump administration continued its efforts to broker a ceasefire between Israel and Hamas, Netanyahu left Washington without such a deal.\nRepublicans continue to have a broadly positive opinion of the conservative Israeli prime minister. Two-thirds of Republicans, 67%, now have a favorable opinion of Netanyahu, compared with 19% of independents and 9% of Democrats. While Republicans have held a consistently more favorable opinion of Netanyahu than Democrats and independents throughout the trend, the current 58-point party gap is the largest.\nRepublicans’ opinions of Netanyahu are similar to their views in 2019, which was Gallup’s last reading prior to the Oct. 7 attacks, while Democrats’ and independents’ ratings of him are sharply worse.\nDemographic Differences in Views of Netanyahu, Israel’s Military Action\nPartisans’ differences in support for Netanyahu and Israel’s military action in both Gaza and Iran are reflected in significant differences by gender, age, race and ethnicity. Men, White adults, and those aged 55 and older are more likely than their counterparts to view Netanyahu favorably and approve of Israel’s military action in Gaza and Iran.\nBottom Line\nAmericans’ support for Israel’s military operation in Gaza and their positive views of Netanyahu have both reached new lows, reflecting sharp declines in Democrats’ and independents’ support. At the same time, Republicans’ backing of Israel’s military action and its prime minister is holding firm, resulting in record partisan gaps on both. The increasingly skeptical and divided American public poses a challenge for Israeli leadership and U.S. policymakers who are seeking to navigate the conflict.\nStay up to date with the latest insights by following @Gallup on X and on Instagram.\nLearn more about how the Gallup Poll Social Series works."
    },
    {
      "url": "https://www.bbc.co.uk/news/resources/idt-33fccfbe-abcc-4af1-bdd2-632b2787cf59",
      "text": "Israel levelling thousands of Gaza civilian buildings in controlled demolitions\nIsrael has demolished thousands of buildings across Gaza since it withdrew from a ceasefire with Hamas in March, with entire towns and suburbs - once home to tens of thousands of people - levelled in the past few weeks.\nSatellite images show massive amounts of destruction in several areas which Israel's military command claims to have under \"operational control\".\nLarge swathes of it have been caused by planned demolitions, both to already damaged buildings and ones that appeared largely intact.\nVerified footage shows large explosions unleashing plumes of dust and debris, as Israeli forces carry out controlled demolitions on tower blocks, schools and other infrastructure.\nMultiple legal experts told BBC Verify that Israel may have committed war crimes under the Geneva Convention, which largely prohibits the destruction of infrastructure by an occupying power.\nAn Israel Defense Forces (IDF) spokesperson said it operated in accordance with international law; that Hamas concealed \"military assets\" in civilian areas, and that the \"destruction of property is only performed when an imperative military necessity is demanded\".\nIn July, Israel's Defence Minister Israel Katz outlined plans to establish what he called a \"humanitarian city\" over the ruins of Rafah, with an initial 600,000 Palestinians being confined there.\nThe plan has been widely condemned. Former Israeli Prime Minister Ehud Olmert told the BBC that the proposal would be \"interpreted as being akin to a concentration camp\".\nTel al-Sultan was one of Rafah city's most vibrant neighbourhoods. Its densely packed streets were home to Rafah's only specialised maternity hospital and a centre caring for orphaned and abandoned children.\nSatellite images showed that much of the area had already been heavily damaged by Israeli bombing and artillery fire, but dozens of buildings had withstood the barrage.\nBut by 13 July the destruction had escalated, with even the shells of damaged buildings swept away and entire blocks torn to the ground. The hospital is one of a handful of buildings left standing.\nSimilarly, demolitions are now under way in the adjacent Saudi neighbourhood - once home to the city's largest mosque and several schools.\nOne verified clip showed a tank moving along a street in Rafah while a digger works by the side of the road.\nIsraeli demolitions are also visible in other parts of the strip which appear to have avoided heavy damage during earlier bombardments.\nThe farming town of Khuza'a is located about 1.5km (0.9 miles) from the Israeli border.\nBefore the war the town had a population of 11,000 people and was known for its fertile farmlands and crops such as tomatoes, wheat and olives.\nThe IDF says it demolished 1,200 buildings in Khuza'a, which it alleged were part of \"terror infrastructures\" run by Hamas.\nA similar story emerges in the nearby town of Abasan al-Kabira, where about 27,000 people lived before the war. Photos taken on 31 May and 8 July indicate that an extensive area was swept away in just 38 days.\nIsrael has created extensive \"security zones\" and corridors separating parts of Gaza, and has destroyed large numbers of buildings along and near these routes. Its latest corridor separates western from eastern Khan Younis, including Khuza'a and Abasan al-Kabira.\nAlso since early in the war analysts have suggested that Israel has been attempting to create deep \"buffer zones\" by destroying buildings near to the border, but some of the areas flattened recently are deep into Gaza.\nIn Qizan Abu Rashwan - an agricultural settlement about 7km from the Israeli border - virtually every structure left standing has been demolished since 17 May. One video we verified showed a controlled explosion levelling a cluster of tower blocks.\nBBC Verify presented the IDF with a list of places in which we documented demolitions and asked it to provide specific military justifications. It did not do so.\n\"As has been widely documented, Hamas and other terrorist organizations conceal military assets in densely populated civilian areas,\" an IDF spokesperson said. \"The IDF identifies and destroys terrorist infrastructure located, among other places, within buildings in these areas.\"\nSeveral human rights lawyers who spoke to BBC Verify suggested the campaign could amount to war crimes.\nEitan Diamond - a senior legal expert at the Diakonia International Humanitarian Law Centre in Jerusalem - said there was little justification under the Fourth Geneva Convention, the document which generally covers the protection of civilians in wartime.\n\"International humanitarian law prohibits such controlled destruction of civilian property during armed conflict, except under narrow conditions of absolute military operational necessity,\" Mr Diamond said.\n\"Destruction of property because of concerns or speculations about its possible future use (for example, that it will be used to launch attacks in the future) falls well outside this exception.\"\nProfessor Janina Dill, co-director of Oxford Institute for Ethics, Law & Armed Conflict, said an occupying power must administer a region for the benefit of the population - which she said was \"incompatible with a military approach that simply makes the territory uninhabitable and leaves nothing standing\".\nBut some analysts have sought to defend the IDF’s campaign.\nMany of the buildings the IDF has demolished had already been left in ruins by shelling and air strikes, said Prof Eitan Shamir, director of the BESA Center For Strategic Studies in Israel and an ex-official with the Ministry of Strategic Affairs. He told BBC Verify they posed a safety risk for returning civilians, especially \"during winter rains when they are more likely to collapse\".\nProf Shamir also alluded to tactical concerns.\n\"The area is a combat zone,\" he said. \"Even when a building has been entered and cleared by the IDF, once the Israelis exit it, the terrorists often return to plant bombs or hide inside to shoot at them.\"\nThere is no sign of a let-up in the pace of the demolitions. Israeli media reported last week that the IDF had received dozens of D9 bulldozers from the US, which had been suspended under the Biden administration.\nAnd BBC Verify identified dozens of adverts posted to Israeli Facebook groups which were offering work in Gaza to demolition contractors. The majority of the posts have been shared by recruiters since May.\nMany of the ads specify areas of Gaza where the work will occur, such as \"the Philadelphi Corridor\" and \"the Morag Axis\" - both areas controlled by the IDF.\nWhen approached for comment by BBC Verify, one contractor replied: \"Go [expletive] yourself, you and Gaza.\"\nOne analyst - Adil Haque of Rutgers Law School - suggested that the IDF’s demolitions could be seeking to create a \"security zone\" that it could \"permanently control\".\nOther analysts say the demolitions could be clearing the ground to develop the proposed \"humanitarian city\" in Rafah. Efraim Inbar - President of the Jerusalem Institute for Strategy and Security - suggested they could be seeking to encourage Palestinians to leave the strip entirely by increasing \"the strong desire to emigrate\".\nIsraeli Prime Minister Benjamin Netanyahu previously told a group of MPs in a closed-door meeting widely reported in Israeli media that the IDF was \"destroying more and more homes\" leaving Palestinians with \"nowhere to return to\".\nFor Gazans, the devastation has been intense.\nMoataz Yousef Ahmed Al-Absi from Tel al-Sultan said his home had been swept away.\n\"I had just moved into my home a year before the war started, and I was incredibly happy with it, holding high hopes for my future. Now, it's been completely destroyed,\" he said.\n\"After losing everything, I no longer have a home or a shelter.\"\nVideo credits\n@YinonMagal/X, @Philipp27960841/X and Abu Ali Express/Telegram\nAdditional reporting\nMohamed Shalaby"
    },
    {
      "url": "https://www.phr.org.il/en/genocide-in-gaza-eng/",
      "text": "On October 13, 2023, the Israeli military ordered the evacuation of 22 hospitals in Gaza City and the northern Gaza Strip. That day marked the start of an unprecedented assault on Gaza’s health system. Over the past 22 months, Israel has systematically targeted medical infrastructure across the Gaza Strip, attacking 33 of 36 of Gaza’s hospitals and clinics depriving them of fuel and water. More than 1800 of Gaza’s medical staff have been killed or detained.\nToday, PHRI is releasing a position paper that documents this assault for what it is: a deliberate, cumulative dismantling of Gaza’s health system, and with it, its people’s ability to survive. This amounts to genocide. Israel’s bombing of hospitals, destruction of medical equipment, and depletion of medications have made medical care – both immediate and long-term – virtually impossible. The system has collapsed under the weight of relentless attacks and blockade.\nEach day, dozens die of malnutrition. Ninety-two percent of infants aged six months to two years don’t get enough to eat. At least 85 children have already starved to death. Israel has displaced 9 in 10 Gazans, destroyed or damaged 92% of homes, and left over half a million children without schools or stability. It has wiped out essential health services – including dialysis, maternal care, cancer treatment, and diabetes management.\nThis is not a temporary crisis. It is a strategy to eliminate the conditions needed for life. Even if Israel stops the offensive today, the destruction it has inflicted guarantees that preventable deaths – from starvation, infection, and chronic illness – will continue for years. This is not collateral damage. This is not a side effect of war. It is the systematic creation of unlivable conditions. It is the denial of survivability. It is a genocide.\nGovernments and international bodies must act now:\n• Compel Israel to cease its fire.\n• Protect and restore Gaza’s health systems.\n• Re-instate UN, international, and Palestinian mechanisms of support.\n• Allow the free movement of aid.\n• Ensure the safety of healthcare workers.\nThese actions are critical – and must be taken immediately – to prevent further loss of life. The health system’s minimal capacity today depends entirely on the efforts of Gaza’s medical professionals, to whom this report is dedicated."
    },
    {
      "url": "https://www.ipcinfo.org/ipcinfo-website/countries-in-focus-archive/issue-133/en/",
      "text": "The worst-case scenario of Famine is currently playing out in the Gaza Strip. Conflict and displacement have intensified, and access to food and other essential items and services has plummeted to unprecedented levels.\nMounting evidence shows that widespread starvation, malnutrition, and disease are driving a rise in hunger-related deaths. Latest data indicates that Famine thresholds have been reached for food consumption in most of the Gaza Strip and for acute malnutrition in Gaza City.\nMalnutrition has been rising rapidly in the first half of July. Over 20,000 children have been admitted for treatment for acute malnutrition between April and mid-July, with more than 3,000 severely malnourished. Hospitals have reported a rapid increase in hunger-related deaths of children under five years of age, with at least 16 reported deaths since 17 July.\nImmediate action must be taken to end the hostilities and allow for unimpeded, large-scale, life-saving humanitarian response. This is the only path to stopping further deaths and catastrophic human suffering.\nThe Integrated Food Security Phase Classification (IPC) defines Famine as an extreme deprivation of food. Starvation, death, destitution and extremely critical levels of acute malnutrition are or will likely be evident.\nThe IPC plays a critical role in identifying Famine conditions, and informing the response needed to save millions of lives. The IPC is now the primary mechanism the international community uses to analyse data and arrive at a conclusion whether Famine is happening or likely happening in a country. Analyses are based on evidence gathered by a wide range of partners and multistakeholder technical consensus.\nJoin our mailing list"
    },
    {
      "url": "https://news.gallup.com/poll/657404/less-half-sympathetic-toward-israelis.aspx",
      "text": "WASHINGTON, D.C. -- Although Americans remain more likely to say their sympathies in the Middle East situation are with the Israelis rather than the Palestinians, the 46% expressing support for Israel is the lowest in 25 years of Gallup’s annual tracking of this measure on its World Affairs survey. The previous 51% low point in this trend of Americans’ sympathy for Israelis was recorded both last year and in 2001.\nAt the same time, the 33% of U.S. adults who now say they sympathize with the Palestinians is up six percentage points from last year and the highest reading by two points.\nThe latest reading is from a Gallup poll conducted Feb. 3-16, during which the temporary ceasefire and hostage exchange between Israel and Hamas that started in mid-January continued. The poll began one day before Israeli Prime Minister Benjamin Netanyahu’s White House visit that included a joint press conference with President Donald Trump. During that press event on Feb. 4, Trump expressed his intent for the U.S. to own and redevelop the Gaza Strip.\nThe February poll also finds that 40% of U.S adults approve of Trump’s handling of the situation between the Israelis and Palestinians, which trails his overall job approval rating of 45%. Partisans are sharply divided in their job ratings of Trump, and they also hold different views of Israel and the Palestinian Territories. Republicans are much more likely than Democrats to view Israel favorably (83% vs. 33%, respectively), while Democrats view the Palestinian Territories more favorably than Republicans do (45% vs. 18%).\nRepublicans More Sympathetic to Israelis, Democrats to Palestinians\nPartisans’ sympathies in the Middle East situation follow a pattern similar to their favorable ratings of the two countries. That is, Republicans broadly sympathize with the Israelis (75%) over the Palestinians (10%), while Democrats sympathize with the Palestinians over the Israelis by a nearly 3-to-1 ratio (59% vs. 21%). Independents’ sympathies are similar to the national averages.\nRepublicans and independents have consistently backed the Israelis since 2001, though independents’ support for the Israelis is now at its lowest in World Affairs surveys by one point. Democrats also sided with the Israelis until 2022, when roughly equal shares said they sympathized with each side. Since then, Democrats have supported the Palestinians.\nInitially, Democrats’ declining sympathy for the Israelis was seemingly the result of disapproval of the nation’s right-leaning political leadership under Netanyahu. However, it has fallen further in the past two years. In February 2023, Democrats’ sympathies for the Israelis dipped to 38%, while the reading for Palestinians jumped 11 points to 49%, marking the first time Palestinian sympathies prevailed among this group.\nEight months later, on Oct. 7, 2023, Hamas militants attacked Israel, killing over 1,000 Israelis and taking nearly 250 as hostages. Democrats’ sympathy for the Palestinian people had dipped six points by the following February. One year later, as a humanitarian crisis persists in Gaza, Democrats’ sympathy for the Palestinians is up 16 points, marking the first time it has reached the majority level.\nAmericans Continue to Support a Two-State Solution in the Middle East\nFor years, a core tenet of Middle East peace proposals has been the so-called “two-state solution,” which would entail the creation of a Palestinian state. Gallup has measured Americans’ views on this since 1999. Since then, more Americans have supported than opposed the establishment of an independent Palestinian state in the West Bank and the Gaza Strip, and that continues today. Currently, 55% are in favor and 31% opposed, while 14% do not have an opinion.\nThe latest 55% of U.S. adults who favor establishing a Palestinian state is in line with readings since 2020, which have ranged from 52% to 55%. Before that, Americans were still more in favor of an independent Palestinian state than opposed, but support was mostly below the majority level. Support and opposition were most similar to each other in 2015 and 2017.\nMajorities of Democrats, Independents Support Independent Palestinian State\nGiven their majority-level sympathy for the Palestinians, it follows that Democrats are also broadly supportive of an independent Palestinian state. About three-quarters of Democrats, 76%, are in favor of such a state, compared with 53% of independents. While 41% of Republicans support a Palestinian state, 49% are opposed.\nDemocrats’ support for a Palestinian state has been trending upward since 2021, whereas independents’ has been relatively steady over the same period. Republicans’ support is up 15 points after dropping sharply last year.\nBottom Line\nAmericans’ sympathies with the Israelis continue to decline, largely because of Democrats’ dwindling support for the Israelis in the long-standing conflict with the Palestinians. Republicans remain overwhelmingly sympathetic toward the Israelis.\nMeanwhile, the establishment of an independent Palestinian state is still supported by a majority of Americans, though by far more Democrats than Republicans. Discussion of a two-state approach for achieving peace in the region is largely on hold following the Oct. 7, 2023, attack, as world leaders wrestle with how Israel’s safety will be secured after the war, what role Hamas will play in Gaza and how the West Bank will be governed.\nTo stay up to date with the latest Gallup News insights and updates, follow us on X @Gallup.\nLearn more about how the Gallup Poll Social Series works.\nView complete question responses and trends (PDF download)."
    }
  ],
  "argos_summary": "Senator Amy Klobuchar's recent vote against arms transfers to Israel, alongside a majority of her Democratic colleagues, signals a potential shift in the party's stance on Israel amidst growing public discontent over the humanitarian crisis in Gaza. Despite the resolutions failing, Klobuchar's actions reflect a significant change in response to the Democratic base's frustration with the party's traditional pro-Israel position, especially as support for Israel's military actions has plummeted among Democrats. The ongoing conflict has led to catastrophic conditions in Gaza, with widespread starvation and destruction, prompting calls for immediate humanitarian aid and a reevaluation of U.S. military support.",
  "argos_id": "PFK06NSKM"
}