{
  "url": "https://www.morningstar.com/funds/investors-are-seeking-safety-gold-etfs-is-it-working-2",
  "authorsByline": "CFA, Ivanna Hampton, Bryan Armour",
  "articleId": "3c36c18f81074df1856be7675e42e881",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://morningstar-morningstar-prod.web.arc-cdn.net/resizer/jucpShEN2xcih9R39MZqJA7Ixvg=/2000x1125/d10o6nnig0wrdw.cloudfront.net/08-06-2025/t_0bca6f3132bb4d93982745195db53381_name_file_960x540_1600_v4_.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T15:00:00+00:00",
  "addDate": "2025-08-08T15:10:56.304826+00:00",
  "refreshDate": "2025-08-08T15:10:56.304827+00:00",
  "score": 1.0,
  "title": "Investors Are Seeking Safety in Gold ETFs. Is It Working?",
  "description": "Also, four top ETFs and how this speculative asset is faring against another popular hedge.",
  "content": "Investors are piling into global gold ETFs for a safe haven from uncertainty.\n\nWhy it matters: Demand surged in the first half of 2025, according to a new report from the World Gold Council. The industry trade group points to geopolitical turmoil, global trade policies, and higher gold prices for driving interest in these ETFs. The lure of investing in gold ETFs can vary from wanting to diversify a portfolio, hedge against inflation risks, or simply bet on rising prices. Bryan Armour explains what you should know about this speculative asset. He’s the director of ETF and passive strategies research for North America at Morningstar Research Services.\n• What are gold ETFs, how many types are there, and how do they work?\n• The World Gold Council says there was strong demand for global gold ETFs in the first half of 2025. How much money has flowed in and out of these ETFs, and what’s your take on that?\n• How have gold ETFs held up against market volatility in 2025? How does it compare with other periods of uncertainty?\n• Let’s talk about your recent article about how to choose the right gold ETFs. You pointed out that a two-month launch difference helped create a big gap in assets between the two largest gold ETFs. Can you talk about the rivalry between SPDR Gold Shares GLD and iShares Gold Trust IAU?\n• You listed those two ETFs and several others as top gold ETFs in your article. What makes one of these ETFs different from the other?\n• What should investors zoom in on to find the right ETF for them?\n• How do trading costs affect buy-and-hold investors and day traders differently?\n• The IRS applies a different tax treatment to gold than stocks or bonds. What should investors know?\n• What are the best gold ETFs, and why?\n• Let’s quickly pivot to another speculative asset. People sometimes refer to bitcoin as digital gold. Is that a fair comparison? How has it performed so far this year?\n• Would you say gold ETFs or bitcoin has served as a better hedge?\n\nGold is uncorrelated to stocks and bonds, and so what that means is sometimes it works really well and sometimes it does drop the same amount as stocks and bonds. And uncorrelated does not mean negatively correlated. So this year was a good year to own gold. I think it’s up about 25% over the first half, while stocks are up 8. But in the throes of April, at one point, stocks were down 15% and gold was up 15. So it worked as a great, as a diversifier, as intended, this year, but there are also times where it won’t.\n\nThe Takeaway: Investors have flocked to gold as a safe-haven asset during market volatility. Twenty-six billion dollars flowed into gold ETFs this year, according to Morningstar data. Holding gold is the same regardless of what ETF you choose, and investors will find better deals in ETFs with higher liquidity and lower fees, according to Armour. Despite cryptocurrencies like bitcoin being compared with gold as a diversifier, crypto will usually fall further than stocks when markets are taking a downturn, even though, like gold, the asset isn’t directly correlated with stocks and bonds. Armour says investors are better off investing in gold if they are looking for a hedge against market conditions.\n\nMore From Morningstar on Gold ETFs\n\nAs one of the few investments older than Warren Buffett, gold doesn’t act like traditional assets. It holds its value in its scarcity. Whether investors are looking for diversification, or a hedge against market conditions, Armour outlines the best way for investors to choose the right gold ETF for their portfolio, and which gold ETF reigns as king when it comes to this ancient element.\n\nTrading costs are key to finding the right gold ETFs. Here are 5 tips for trading ETFs from Armour. If you’re wondering how use gold in your portfolio, Amy Arnott breaks it down in this iteration of her Portfolio Basics series. Gold has become a top choice as hedge against inflation. But are commodities a better inflation hedge? Arnott breaks down the winner, and why. If you’re looking for more ETFs to diversify your portfolio, Armour shares 3 ETFs investors can use to diversify their portfolios amid market uncertainty.\n\nJess Bebel, an associate multimedia editor at Morningstar, contributed to this article.",
  "medium": "Article",
  "links": [
    "https://www.morningstar.com/etfs/arcx/gld/quote",
    "https://www.morningstar.com/funds/digging-gold-with-etfs",
    "https://www.morningstar.com/markets/what-lies-ahead-trumps-trade-war-after-week-market-turmoil-2",
    "https://www.morningstar.com/portfolios/market-volatility-which-investments-will-protect-your-portfolio-recession",
    "https://www.morningstar.com/people/amy-c-arnott",
    "https://www.morningstar.com/markets/4-key-market-factors-track-q3-2025-2",
    "https://www.morningstar.com/funds/3-etfs-diversify-your-portfolio-2",
    "https://www.morningstar.com/markets/stock-strategies-that-are-paying-off-2025",
    "https://www.morningstar.com/portfolios/how-use-gold-your-portfolio",
    "https://www.morningstar.com/etfs/arcx/gldm/quote",
    "https://www.morningstar.com/etfs/arcx/iau/quote",
    "https://www.morningstar.com/etfs/arcx/iaum/quote",
    "https://www.morningstar.com/people/bryan-armour",
    "https://www.morningstar.com/portfolios/commodities-vs-gold-which-is-better-inflation-hedge",
    "https://www.morningstar.com/markets/is-your-investment-portfolio-ready-us-eu-trade-deal-2",
    "https://www.morningstar.com/markets/trade-deals-that-could-calm-wall-street-2",
    "https://www.morningstar.com/portfolios/portfolio-diversification-is-winning-2025",
    "https://www.morningstar.com/funds/5-tips-trading-etfs-6",
    "https://www.morningstar.com/markets/market-volatility-what-watch-q2-after-big-swings-q1-2"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Gold ETFs",
      "weight": 0.14391318
    },
    {
      "name": "gold ETFs",
      "weight": 0.14391318
    },
    {
      "name": "global gold ETFs",
      "weight": 0.13854823
    },
    {
      "name": "top gold ETFs",
      "weight": 0.13588773
    },
    {
      "name": "Gold",
      "weight": 0.109463565
    },
    {
      "name": "gold",
      "weight": 0.109463565
    },
    {
      "name": "digital gold",
      "weight": 0.106395096
    },
    {
      "name": "ETFs",
      "weight": 0.10638423
    },
    {
      "name": "higher gold prices",
      "weight": 0.10617963
    },
    {
      "name": "more ETFs",
      "weight": 0.103003114
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.98291015625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.75927734375
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.53759765625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.5283203125
    },
    {
      "name": "/Finance/Investing/Funds",
      "score": 0.3212890625
    }
  ],
  "sentiment": {
    "positive": 0.30908203,
    "negative": 0.15100098,
    "neutral": 0.54003906
  },
  "summary": "Investors are investing in global gold ETFs as a safe haven from uncertainty, according to a report from the World Gold Council. The trade group attributes this surge to geopolitical turmoil, global trade policies, and higher gold prices. Investors are seeking to diversify a portfolio, hedge against inflation risks, or simply bet on rising prices. Bryan Armour, director of ETF and passive strategies research for North America at Morningstar Research Services, discusses the importance of finding the right gold ETF for investors. He explains that holding gold is the same regardless of what type of ETF chosen and that investors will find better deals in ETFs with higher liquidity and lower fees. Despite cryptocurrencies like bitcoin being compared with gold as a diversifier, they usually fall further than stocks when markets are down, even though the asset isn't directly correlated with stocks and bonds.",
  "shortSummary": "Gold ETFs, driven by geopolitical turmoil, rising gold prices, and rising inflation, are attracting significant investor interest, with potential for diversification and market volatility.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "25fd6ba3e0334e1388c6a6fd9cb040ae",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.morningstar.com/portfolios/how-use-gold-your-portfolio",
      "text": "How to Use Gold in Your Portfolio\nWhat you need to know about the advantages and risks of investing in gold.\nGold is one of the oldest forms of money; gold coins were first used in the Kingdom of Lydia (now part of Turkey) in about 550 B.C. Gold has also long been used as a store of value as well as an investment asset.\nIn this series on portfolio basics, I’ll explain some of the fundamentals of putting together sound portfolios. I’ll start with some of the most widely used types of investments and walk through what you need to know to use them effectively in a portfolio.\nWhat Is Gold?\nThere are two primary ways to invest in gold: buying the commodity directly (gold bullion) or buying shares in companies that mine and sell gold (gold equity). Because gold stocks have both financial and operating leverage, their results tend to magnify the impact of changes in the price of gold. They’re also significantly more volatile than bullion, which only depends on the underlying commodity price. In this article, I’ll mainly focus on gold bullion, which is a better fit for investors seeking a hedge against market-related risk.\nAs the graph above illustrates, gold has been a so-so long-term performer. Before the collapse of the Bretton Woods system in 1971, the price of gold was fixed at $35 per troy ounce. Since then, the price has risen significantly. However, gold’s long-term returns have lagged both US stocks and a diversified portfolio combining 60% in stocks and 40% in bonds.\nGold aficionados often point to gold’s ability to hold its value over time. As a guideline, it’s often said that one ounce of gold should roughly translate into the price of a high-quality men’s suit. I’m not an expert on men’s apparel, but gold’s current price of about $3,000 per ounce seems high enough to cover the cost of an acceptable suit.\nWhat Are the Advantages and Risks of Investing in Gold?\nIn terms of return generation, gold has been a decent performer over the past 20 years. But as shown in the scatterplot below, volatility has been relatively high, as well.\nGold has also been subject to a fair amount of downside risk, although its downside risk profile is more moderate than that of other commodities.\nHow to Invest in Gold\nIf you’ve been watching late-night TV or visited your local Costco, you’ve probably seen advertisements for gold bars or coins. Owning gold in physical form often appeals to people trying to prepare for worst-case scenarios, such as the need to flee during a war. And in fact, having gold coins stored in the basement or attic has been a lifesaver for some families at times, such as during World War II.\nBut owning physical gold has some disadvantages: namely, storage costs and the risk of theft. During ordinary times, investors are usually better off owning gold through a mutual fund or ETF.\nThe table below shows a subset of gold funds with relatively low expense ratios. (Note: Morningstar does not currently provide Morningstar Medalist Ratings on gold funds and other funds in the commodities-focused category.)\nWhen Does Gold Perform Best?\nDespite its short-term volatility, gold has a long history as a safe haven. The price of gold is largely independent of other asset classes, and it has also traditionally been used as a refuge against weakness in the dollar. It can also serve as a hedge against inflation and market volatility.\nThe table below shows annualized returns for gold during some of its strongest periods.\nHow Long Should I Hold My Investments in Gold?\nMorningstar’s Role in Portfolio framework recommends holding gold for at least 10 years. We came up with this guideline partly by looking at the historical frequency of losses over various rolling time periods ranging from one year to 10 years. We also considered the maximum time to recovery, or how long it usually takes to recover after a drawdown.\nHow Much of My Portfolio Should Be in Gold?\nAs with other specialized fund categories, Morningstar’s Role in Portfolio framework recommends that individual investors keep their gold exposure limited (which Morningstar defines as 15% of assets or less).\nOn balance, gold has a pretty reliable record as a safe haven in times of market turmoil. It can also provide significant diversification benefits, as its correlation with both stocks and bonds is typically very low. However, it’s better viewed as an insurance policy than as a core holding given its lackluster long-term returns.\nEditor’s Note: A version of this article appeared on Feb. 27, 2024.\nThe author or authors do not own shares in any securities mentioned in this article. Find out about Morningstar’s editorial policies."
    },
    {
      "url": "https://www.morningstar.com/markets/is-your-investment-portfolio-ready-us-eu-trade-deal-2",
      "text": "Is Your Investment Portfolio Ready for a US-EU Trade Deal?\nPlus, 3 European stock picks that are undervalued today.\nHigh-stakes negotiations between the US and the European Union could affect your portfolio.\nWhy it matters: Negotiators are closing in on a preliminary trade deal. The clock is ticking down to President Donald Trump’s Aug. 1 deadline. The EU represents more than two dozen countries and many sectors whose products flow into and out of the US. Michael Field, a European market strategist for Morningstar Holland, explains what’s at stake.\n9 Questions on How the US-EU Trade Deal Could Affect Investment Portfolios\n- President Trump pushed his tariff deadline from July to August. How are global markets reacting to the uncertainty during this tariff watch?\n- The EU is one of America’s largest trading partners. How important is it for these two sides to strike a deal?\n- And what’s at stake if they don’t before the deadline?\n- More than a dozen countries make up the EU. The bloc is seeking lower tariffs for a variety of sectors like aircraft, car parts, and spirits. Talk about that.\n- So, what sectors do you think could be hit the hardest, and which ones could be spared?\n- The EU has presented a united front. However, some countries want a trade deal sooner than later. Can you talk about the debate you’re witnessing in Europe?\n- Trade deals typically take years to be implemented, so any announcement would be a preliminary agreement. If a US investor has European companies in their portfolio, what would this framework mean for them in the long term?\n- Let’s shift to this year’s market performance of European stocks. What’s been winning?\n- Which European stocks do Morningstar analysts consider undervalued, and why?\nKey Quote on Market Performance of European Stocks in Investment Portfolios\n“Europe, as a whole, has been winning is the answer. If you look over the last quarter or even year to date, Europe has been the real star performer in terms of global markets, ahead of the US, ahead of the global market index as an average. So, that’s good news for European stocks and investors as a whole.”\n—Michael Field, European market strategist for Morningstar Holland\nWhat’s Undervalued: A few sectors in Europe remain undervalued despite the rally, says Field. The list includes healthcare and consumer discretionary. Renault RNO, the French-listed automaker, is heavily exposed to Europe with 80% of its sales in that country. Kering KER is a luxury goods conglomerate that’s ripe for a turnaround when the sector bounces back. In healthcare, GSK GSK PLC, the UK-listed global pharmaceutical company, has a wide product portfolio with good cash flow.\nMorningstar’s Top 3 European Stock Recommendations\nRead More: Field shares Morningstar’s outlook for Europe for the second half of 2025, including AI expectations and infrastructure spending. Amy Arnott, portfolio strategist for Morningstar Inc., explains why it’s not too late for investors to increase their international exposure. Here are a couple of reasons: attractive international stock prices and the benefits of a globally diversified portfolio.\nThe author or authors own shares in one or more securities mentioned in this article. Find out about Morningstar’s editorial policies."
    },
    {
      "url": "https://www.morningstar.com/portfolios/portfolio-diversification-is-winning-2025",
      "text": "Portfolio Diversification Is Winning in 2025\nPlus, which asset classes are holding up best and struggling most this year.\nIvanna Hampton: Welcome to Investing Insights. I’m your host, Ivanna Hampton.\nInvesting Insights is helping investors navigate market volatility in a new series. Morningstar strategists and authors will deliver timely insights, trends, and tips, and these episodes will regularly pop into your podcast feed.\nThis week’s episode focuses on how portfolio diversification is proving its worth in 2025. We have seen significant market turmoil this year. A team of Morningstar researchers have investigated the benefits of creating a diversified portfolio. A tried and true version has helped shield many investors. Morningstar Inc. portfolio strategist Amy Arnott is one of the co-authors of the 2025 Diversification Landscape Report. Thanks for being here, Amy.\nAmy Arnott: Thanks, great to be here.\nHow Diversification Has Held Up Against Market Volatility in 2025\nHampton: Before we get into the new report, can you talk about the trends that you’ve seen in 2025?\nArnott: Yeah, so obviously we’ve had a lot of volatility in the market, a lot of uncertainty and changes around tariff policy. So because of that, we had—US stocks were actually down 20% from their peak at one point in April, but have now bounced back and are actually in positive territory for the year to date. But as you mentioned in the intro, kind of big picture, we have seen more benefits from portfolio diversification this year. That has definitely been a net positive from a portfolio perspective.\nWhich Asset Classes Have Been Strong Diversifiers in 2025?\nHampton: And which asset classes have held up so far this year?\nArnott: Yeah, there are a few different things. So gold has definitely done extremely well. It’s up about 30% so far this year through the beginning of June. That’s been driven by a lot of central bank buying, central banks trying to diversify their reserves beyond the US dollar, as well as other investors looking for more of a safe haven asset. Other commodities have also done relatively well overall. Stocks outside of the US have done much better than those in the US. Then investment-grade bonds overall have been a net positive. Although if you’re talking about longer-duration bonds, there has been a lot of volatility there and it’s been a tougher environment.\nWhich Asset Classes Have Struggled as Diversifiers?\nHampton: And which ones have struggled?\nArnott: Yeah, so US stocks, as I mentioned, have experienced a lot of turmoil so far this year, growth stocks in particular, and then long-term Treasuries. We’ve actually, even though they are usually very good at diversifying a portfolio, we’ve actually seen a few days when stocks were down, but Treasury bond prices were down at the same time, which is relatively unusual.\nHow Have US vs. Non-US Stocks Performed in 2025?\nHampton: There’s a growing consensus that US investors should look overseas for opportunities. Talk about what you found when you compared US stocks to non-US stocks this year.\nArnott: There’s been a pretty big performance gap, and non-US stocks have actually performed much better. So looking at the year to date through the beginning of June, non-US stocks have gained about 12% versus a 2% gain for US stocks. That has actually been a pretty major reversal from the trends that we saw over the past 10 or 15 years through the end of 2024 when US stocks were in the lead by a pretty wide margin for most of that period. So the outperformance for international stocks this year has partly been driven by currency trends where we’ve seen the US dollar has lost about 8% of its value, which has been a positive if you’re a US-based investor investing in international stocks, you get a benefit when you translate those returns back into US dollars. And then the other positive factor is international stocks headed into 2025 with much lower valuations, which was also a positive.\nCan Investors Still Turn to Fixed Income During Market Volatility?\nHampton: Now, bonds partially shielded investors against some losses this year, but US Treasury yields also spiked. How should investors think about fixed income?\nArnott: Yeah, so I think, there’s been some chatter about whether US Treasuries should still be considered a safe asset and are they going to be able to fulfill their traditional role as buffers against volatility in the equity market. So we’ve seen a few bobbles here and there and some questions about the high level of spending in the US and the large deficit, whether spending levels are sustainable and what that means for the stability of US Treasuries. I think overall, if you’re investing in investment-grade bonds, they can still function pretty well as ways to reduce your portfolio’s volatility. I think the main thing to be aware of is duration risk and if you are investing in 30-year Treasuries, there’s definitely a much higher level of volatility that’s going to come along with that. For the average investor, for your bond exposure, I think you want to be sticking with intermediate-term or even short-term bonds, depending on your time horizon.\nHow Correlations Between Asset Classes Is Key to Diversification\nHampton: Let’s shift to the new diversification report. It focuses on data through the end of 2024. What did you and your team set out to discover?\nArnott: We wanted to take a really broad view of performance across different asset classes, and a lot of the report focuses on looking at correlations between asset classes and how those correlation patterns have shifted over time. We also looked into what that means for building a diversified portfolio. I think it’s a way for investors and advisors to really think about which assets are best or worst from a diversification standpoint and what types of assets they might want to include in a portfolio.\n60/40 Portfolio vs. Diversified Portfolio\nHampton: The 60/40 strategy is one of two main portfolios studied in the report. Can you describe the other portfolio and how you chose the asset mix of it?\nArnott: So for the 60/40, we used a very basic mix of US stocks and investment-grade bonds, and what we call the “diversified” portfolio includes a much broader range of asset classes, so 11 different assets in total. And the idea was to provide kind of a point of comparison for that basic mix of stocks and bonds. So for the diversified version, we also include a lot of other assets that could be used in a portfolio. So things like international stocks, commodities, real estate, gold, high-yield bonds, etc.\nWhy the 60/40 Portfolio Outperformed in the Long Term\nHampton: And you’ve written that the plain-vanilla portfolio that you just mentioned, 60% stocks, 40% investment-grade bonds, paid off. How so? Because it was over a longer-term periods, correct?\nArnott: Right. So we looked at performance over different 10-year periods going back to 1976 and found that if you look at risk-adjusted returns, the 60/40 portfolio actually performed better than a 100% stock portfolio about 80% of the time in those 10-year periods between 1976 and 2024.\nThe Best Ways to Diversify Your Portfolio During Market Volatility\nHampton: And you looked at portfolio diversification from many other angles, and I’m going to look at my notes because I want to list them off correctly. The list includes US versus international, sector, investment style, and factors. Are there any areas that stand out as being particularly good when it comes from a portfolio diversification standpoint?\nArnott: Yeah, I think one asset that really stands out is cash. And cash obviously is not the best way to invest for long-term growth, but it does actually have a low correlation with stocks and obviously tends to hold up much better when stocks are down or during periods of equity market volatility. As I mentioned earlier, investment-grade bonds also usually are fairly strong diversifiers against equity market risk, and a couple of other areas I would point to would be commodities, which have historically had very low correlations with US stocks and other major asset classes, gold, and then international stocks have also been fairly good diversifiers, although we have seen correlations trend up.\nWhat Hasn’t Held Up as Portfolio Diversifiers?\nHampton: On the flip side, are there any areas that you think are overrated as portfolio diversifiers?\nArnott: Yeah, I think one area I would point to would be high-yield bonds, or junk bonds. And because they are so subject to credit risk and the fortunes of the individual company that they’re issued by, they actually tend to move more in line with stocks than people might expect. Real estate and real estate investment trusts, I think, is another area that a lot of people often tout for diversification, but we’ve also seen a pretty large increase in correlations between real estate and other types of stocks over time.\nA couple of other areas would be private equity and private credit. They can show different performance patterns, mainly because they’re much less liquid than public equity and public debt. But at the end of the day, you’re still getting equity and credit exposure. It’s just in a different format. So the overall risk profile may not be that different over time. And then I would also point to cryptocurrency, which has historically had very low correlation with other asset classes, but we have seen correlations increase over time, and the volatility of bitcoin, ethereum, and other cryptocurrencies has been so high that that almost overshadows the diversification benefits.\nHow Tough Macro Environments Affect Diversification Patterns\nHampton: And how do diversification trends typically change during different macro environments like times of high inflation, rising interest rates, or lower economic growth?\nArnott: Yeah, that’s a great question. And we do have a section of the paper that looks at diversification patterns during those different types of macro environments. So if you look at periods of rising interest rates or periods of high inflation, what we see is, typically what happens is the correlation between stocks and bonds increases, and that’s the pattern we’ve seen over the past few years when previously the stock/bond correlation was negative, and we saw that correlation coefficient flip into positive territory. If you’re in an environment where interest rates are rising or inflation is higher than average, typically you get less of a diversification benefit from bonds. In periods of weaker economic growth, on the other hand, bonds have historically performed very well as portfolio diversifiers.\nKey Takeaways\nHampton: Are there any other important takeaways for us to remember, Amy?\nArnott: From a big picture perspective, I think one key takeaway from the report is diversification is a good thing, which might seem like an obvious point, but I think it often gets lost, especially during very strong market environments where there’s often a tendency to want to maximize your exposure to whatever asset class is performing best. Second takeaway is that regimes are important. So, as we just talked about, if you’re in a period when interest rates are rising or inflation is above average, you’re typically not going to get as much of a diversification benefit from bonds.\nThen finally, I think another important takeaway is diversification doesn’t have to be complicated. I think a lot of people, when they hear about diversification, they assume more is always better. But as we have seen by the strong performance of the 60/40 portfolio over time, you don’t necessarily need to add every single asset class. Even if you have a fairly simple approach of just building a portfolio focused on US stocks, international stocks, and investment-grade bonds, that can take you pretty far from a diversification standpoint.\nHampton: Amy, thank you for sharing this important research with us and for coming to the table today.\nArnott: Thanks. Great to be here.\nHampton: That wraps up this week’s episode. Before we sign off, we have a correction to make concerning last week’s episode. A section about companies included on a DividendInvestor’s DividendGrowers list and a follow-up question about companies that weren’t included was inadvertently cut during production. Last week’s episode has been updated to restore this information, so please check it out.\nThanks for watching and making this show part of your day. Subscribe to Morningstar’s YouTube channel to see new videos about investment ideas, market trends, and analyst insights. Thanks to senior video producer Jake VanKersen and associate multimedia editor Jessica Bebel. I’m Ivanna Hampton, lead multimedia editor at Morningstar. Take care.\nThe author or authors do not own shares in any securities mentioned in this article. Find out about Morningstar’s editorial policies."
    },
    {
      "url": "https://www.morningstar.com/portfolios/commodities-vs-gold-which-is-better-inflation-hedge",
      "text": "Commodities vs. Gold: Which Is the Better Inflation Hedge?\nBoth have some merit, but one is better than the other.\nGold has a well-burnished reputation as an inflation hedge, and gold aficionados often point to gold’s ability to hold its value over time. In a well-worn piece of investment folklore, it’s often said that one ounce of gold should roughly translate into the price of a high-quality men’s suit, for example.\nGold’s popularity as an inflation hedge is one of the reasons behind its recent surge. (Others include massive levels of buying by central banks looking to diversify their reserves beyond the US dollar, as well as investors seeking a safe haven amid heightened geopolitical and macroeconomic uncertainty).\nBut are investors making the right move by heading into gold as an inflation hedge? Here, I’ll look at how gold has historically fared during periods of higher inflation, as opposed to commodities. Spoiler alert: Gold has a mixed record as an inflation hedge, but commodities are more reliable.\nLessons From History\nCommodities are typically defined as raw materials or basic agricultural products that are interchangeable with other products of the same type. Some of the most common types of commodities include energy (such as crude oil, natural gas, and gasoline), and agricultural goods (such as corn, wheat, soybeans, and coffee). But commodities also encompass metals such as gold, silver, copper, and platinum. Both gold and other commodities can be both traded and used as investment assets, either through direct ownership, futures contracts, or commodity-focused funds.\nAs shown in the table below, commodities were more consistent as an inflation hedge. They outpaced inflation in all five of the periods shown, while gold fell behind in two of the five periods. Gold did excel during the two separate inflationary periods in the early and late 1970s, when surging oil prices, tight labor markets, and a rapidly expanding monetary supply pushed inflation to historically high levels in the United States. It also posted strong gains during the more muted inflationary environment from September 2007 through July 2008, when consumer prices rose more than 5% thanks to broad-based price increases in oil and food prices and rising demand from emerging markets.\nHowever, it fell behind in the late 1980s, when the consumer price increase rose by about 20% from February 1987 through November 1990. During the most recent inflationary spike from mid-2021 through March 2023, gold prices rose, but cumulative returns lagged the broader commodity index by about 13 percentage points.\nOne reason for commodities’ more reliable record as an inflation hedge is simple: Commodities such as oil and natural gas are some of the components that make up the Consumer Price Index, so it makes sense that their prices tend to rise when inflation is increasing. More broadly, commodity prices are driven by supply and demand, and demand for commodities tends to increase during periods of robust economic growth. Strong economic growth—especially when accompanied by a tight labor market—is also one factor that can lead to periods of higher inflation.\nGold is less tethered to inflation for a few different reasons. Gold prices often reflect a variety of idiosyncratic factors, such as geopolitical uncertainty, expectations for interest rates, central bank reserve policies, and changes in supply from shifts in mining production or recycling. In the late 1980s, for example, gold prices stagnated partly because the higher inflation-adjusted yields available on bonds increased the opportunity cost of holding non-income-producing assets such as gold.\nOther Issues to Consider\nAnother issue to consider is potential overlap between broad-based commodity funds and gold-focused offerings. The Bloomberg Commodity Index, a popular benchmark for commodity funds, carves out about 14% of its assets for futures contracts on physical gold. In other words, if you already own a broad-based commodity fund, you’re likely getting some exposure to gold as part of the mix.\nMoreover, both gold and commodities have lagged stocks by a wide margin over longer periods. Both asset classes have gone through multiyear cycles where performance tends to wax and wane. For investors buying gold or commodity ETFs that invest in futures contracts, roll yield can be a significant influence on returns. If future-dated contracts have higher prices than current-dated contracts (a common pattern known as contango), the return impact is negative, as investors effectively sell low as contracts expire and buy at a higher price.\nFinally, both gold and commodities have been subject to a fair amount of volatility and drawdown risk. On a risk-adjusted basis, neither asset has been particularly compelling over longer periods.\nAs a result, most long-term investors will probably want to limit their allocations (if any) to a small percentage of the portfolio. But for investors specifically seeking a hedge against inflation risk, commodities look like the better bet as opposed to gold.\nThe author or authors do not own shares in any securities mentioned in this article. Find out about Morningstar’s editorial policies."
    }
  ],
  "argos_summary": "Investors are increasingly turning to global gold ETFs as a safe haven amid geopolitical turmoil and market volatility, with $26 billion flowing into these funds in the first half of 2025. The World Gold Council reports that gold has risen approximately 25% this year, outperforming stocks, and serves as a diversifier in uncertain times. Experts suggest that while gold can hedge against inflation and market risks, commodities may offer a more reliable inflation hedge compared to gold.",
  "argos_id": "PN99XE35K"
}