{
  "url": "https://www.oregonlive.com/crime/2025/08/portland-homicides-drop-51-in-2025-steepest-decline-among-major-us-cities-report-finds.html",
  "authorsByline": "Zaeem Shaikh",
  "articleId": "624622cb351e4d6681e0d8471e85f175",
  "source": {
    "domain": "oregonlive.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "OR",
      "county": "Multnomah County",
      "city": "Portland",
      "coordinates": {
        "lat": 45.5202471,
        "lon": -122.674194
      }
    }
  },
  "imageUrl": "https://www.oregonlive.com/resizer/v2/6PFGSASTLJADNJEUW3WAOPBK6E.jpg?auth=de34ea8c03abe84676b3854fe72dd6bc6bbd015e9e91aea0a0c88d9f1ff9f555&width=1280&quality=90",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T23:53:15.367000+00:00",
  "addDate": "2025-08-09T00:05:18.840690+00:00",
  "refreshDate": "2025-08-09T00:05:18.840692+00:00",
  "score": 1.0,
  "title": "Portland homicides drop 51% in 2025, steepest decline among major US cities, report finds",
  "description": "The survey counted 17 homicides in Portland through June, compared with 35 the year before.",
  "content": "A Portland police car at the scene of a homicide on Tuesday, March 4, 2025. Portland has seen the steepest decline in killings among major U.S. cities in the first half of the year, per a violent crimes survey. Zaeem Shaikh/The Oregonian\n\nPortland has recorded the steepest drop in homicides this year among the 68 U.S. cities represented in the Major Cities Chiefs Association, according to data released from the organization.\n\nHomicides in Portland decreased by 51% in the first half of 2025, compared to the same period last year, according to a violent crimes survey released last week from the association of police executives.\n\nThe survey counted 17 homicides in Portland through June, compared with 35 the year before. The city also saw slights decreases in reported rapes, robberies and aggravated assaults.\n\nNationwide, violent crime has declined for the last three years. The survey notes homicides are down about 19% nationwide compared to last year.\n\nIn particular, so far this year, Portland has had two months with no homicides, a respite not seen since 2023. Shootings have also declined by 31% in the city in the first six months of this year, according to police data.\n\nOf course, there’s no guarantee that the downward trend will continue for the rest of the year. Six people were killed in homicides in July, including a man who was gunned down in broad daylight outside the Multnomah County Central Library in downtown Portland. But city leaders and public-safety officials attributed the declines to continuing police strategies and policy choices, and partnerships with intervention programs and community organizations.\n\nPortland Mayor Keith Wilson said the achievement belongs to “every family, community leader, neighborhood group and faith organization that has stepped up to look out for one another.”\n\n“At the same time, we know more work remains, and we’ll continue investing in proven programs, strengthening partnerships and using clear data to guide our next steps,” Wilson said in a statement.\n\nPolice Chief Bob Day said the drop in violent crime in the city is “a promising sign that our collective efforts are having a real impact.”\n\nOne of those collective efforts comes from the violence-intervention program known as Ceasefire, which identifies people or groups involved in shootings and most at risk of being involved in shootings. The program sends outreach workers to talk to people about available services, such as job placement, mental-health treatment and relocation help.\n\n“We’re so focused on each person’s individual needs to help them get out of the cycle of violence,” said Sierra Ellis, the director of the Ceasefire program.\n\nWhat has been different this year has been increased buy-in from others involved in the public-safety system since Ceasefire launched in June 2023, Ellis said. Twice a week, she meets with law enforcement, prosecutors, parole and probation staff and juvenile court counselors. That level of daily connection is new and makes a difference, she said.\n\nOther American cities comparable to Portland have not seen as large a decline in homicides as Portland, per the survey. San Francisco and Seattle both saw declines by about a third, from 17 to 11 and 27 to 18, respectively.\n\nMeanwhile Boston saw an increase from 7 to 17 homicides in the first six months this year compared to 2024. The city ended last year with 24 killings, the lowest count in roughly seven decades.\n\n—Zaeem Shaikh covers the Portland Police Bureau and criminal justice issues for The Oregonian/OregonLive. Reach him at 503-221-4323, zshaikh@oregonian.com or on X@zaeemshake.",
  "medium": "Article",
  "links": [
    "https://oregonlive.com/portland",
    "https://www.oregonlive.com/politics/2025/08/shooting-near-downtown-portland-library-prompts-security-overhaul-possible-metal-detectors.html",
    "https://www.cbsnews.com/boston/news/boston-homicide-numbers-crime-rate-2024/",
    "https://majorcitieschiefs.com/wp-content/uploads/2025/08/MCCA-Violent-Crime-Report-2025-and-2024-Midyear-2.pdf",
    "https://www.oregonlive.com/crime/2025/08/jesse-lee-calhoun-now-accused-of-killing-4th-woman-who-disappeared-in-portland-area.html",
    "https://www.oregonlive.com/crime/2025/07/man-accused-in-se-portland-fatal-stabbing-is-older-brother-of-teen-shot-to-death-by-vancouver-police-in-2019.html",
    "https://www.oregonlive.com/crime/2025/07/police-seek-doorbell-security-camera-footage-in-north-portland-homicide.html",
    "https://www.oregonlive.com/crime/2025/06/portland-once-again-goes-a-month-without-a-homicide-2nd-time-this-year.html",
    "https://www.oregonlive.com/crime/2025/08/vape-shop-owner-guilty-of-killing-two-business-rivals-in-sw-portland-jury-finds.html",
    "https://www.oregonlive.com/crime/2025/07/woman-accused-in-deadly-shooting-outside-ne-portland-safeway-claims-she-shot-man-stealing-her-van.html",
    "https://www.oregonlive.com/crime/2025/07/police-arrest-alleged-gunman-after-daylight-shooting-in-downtown-portland.html",
    "https://www.oregonlive.com/crime/2023/06/national-institute-for-criminal-justice-reform-tapped-to-help-portland-curb-gun-violence.html",
    "https://www.oregonlive.com/homicides/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Portland homicides",
      "weight": 0.098066084
    },
    {
      "name": "last year",
      "weight": 0.08525719
    },
    {
      "name": "major U.S. cities",
      "weight": 0.07669154
    },
    {
      "name": "downtown Portland",
      "weight": 0.07570047
    },
    {
      "name": "Portland",
      "weight": 0.075393654
    },
    {
      "name": "Portland Mayor Keith Wilson",
      "weight": 0.075366594
    },
    {
      "name": "city leaders",
      "weight": 0.07502753
    },
    {
      "name": "major US cities",
      "weight": 0.07385881
    },
    {
      "name": "Homicides",
      "weight": 0.07165804
    },
    {
      "name": "homicides",
      "weight": 0.07165804
    }
  ],
  "topics": [
    {
      "name": "Data"
    },
    {
      "name": "Crime"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.998046875
    },
    {
      "name": "/News/Other",
      "score": 0.98193359375
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.9375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.8984375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.65576171875
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.640625
    }
  ],
  "sentiment": {
    "positive": 0.022247314,
    "negative": 0.9165039,
    "neutral": 0.06060791
  },
  "summary": "Portland, Oregon, saw the highest decline in homicides among major U.S. cities in the first half of 2025, according to a violent crimes survey from the Major Cities Chiefs Association. The survey counted 17 homicides in Portland through June, compared with 35 the previous year. The city also saw decreases in reported rapes, robberies, and aggravated assaults. So far this year, Portland has had two months with no homicides, a respite not seen since 2023. The declines attributed to continued police strategies and policy choices, partnerships with intervention programs and community organizations. However, there is no guarantee that the downward trend will continue for the rest of the year.",
  "shortSummary": "Portland experienced the steepest decline in homicides among major US cities in the first half of 2025, driven by police strategies and community engagement, according to a violent crimes survey.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "54a6074e8b454ecc972e19f77ea66962",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.oregonlive.com/crime/2025/06/portland-once-again-goes-a-month-without-a-homicide-2nd-time-this-year.html",
      "text": "Portland has not recorded a homicide in a month, the second time this year, as the city recovers from years of record violence.\nThe last homicide that took place in the city was May 11, when Portland police officers responded to an isolated side street near the Steel Bridge and Northwest Naito Parkway and found a 49-year-old man shot dead.\nBut between May 12 and Thursday as well as between March 21 and April 21, Portland didn’t record a single homicide. Portland has recorded 14 homicides so far this year, compared with 34 at this point last year and 39 in 2023.\n“I am proud that, for the second time this year, Portland has experienced a month without a homicide,” Mayor Keith Wilson said in a statement. “Every family, community leader, and individual who works to keep our neighborhoods safe has played a part in this progress.”\nThe gaps in these two months come after a particularly deadly March, when the city saw seven homicides. Portland Police Chief Bob Day then stood in front of reporters and called the violence unacceptable.\nIt’s not clear what to expect in the coming months, and police are cautious as violence tends to rise in the summer months. But police spokesperson Mike Benner said in a statement the period of no homicides was “a meaningful reflection of the ongoing efforts by PPB members and the dedication of our community partners.”\nShootings in Portland have also declined, by about 34% compared with last year, according to police data. The city has recorded 263 shootings from the beginning of the year through Wednesday – including 50 that resulted in injuries – compared with 396 in the same period last year. The numbers still remain higher than pre-pandemic levels when Portland saw 199 shootings in the first six months of 2019.\nFor Roy Moore, the numbers are an indication of the work being done by violence prevention organizations. The co-director of the community care team at Portland Opportunities Industrialization Center, Moore said the longtime nonprofit helps about 60 people who are at high risk of being involved in future shootings.\n“We’re addressing high-risk individuals, and we know that they’re going to have an impact on gun violence,” Moore said. “I think we’ve done a good job of really targeting that population.”\nFor the summer months, POIC is preparing for an uptick in violence, with hospital visits already increasing, Moore said. But he’s encouraged that with increases to their staff, POIC can continue to build on the work done in recent months.\nPortland’s Interim Deputy City Administrator Bob Cozzie credited the partnership between the city’s violence intervention program Ceasefire, the Office of Violence Prevention, law enforcement and community organizations.\n“There is still a great deal of work to be done and it takes all of us working together to save lives,” Cozzie said. “I am eager to maintain the positive momentum we have gained and keep pushing us forward as a city.”\nIn some shootings this year, young people were among the victims. Last week, a 15-year-old was shot and wounded in Northeast Portland. And at the start of spring break this year, a Roosevelt High School student was wounded in a shooting in North Portland.\nAnd in at least three of this year’s homicides, either the suspect or the victim was unhoused.\n“We still have ground to make up in communities where gun violence remains endemic, especially among our unsheltered,” Wilson said.\n—Zaeem Shaikh covers the Portland Police Bureau and criminal justice issues for The Oregonian/OregonLive. Reach him at 503-221-4323,zshaikh@oregonian.comor on X@zaeemshake.\nPortland area homicides\n- Portland homicides drop 51% in 2025, steepest decline among major US cities, report finds\n- Vape shop owner guilty of killing two business rivals in SW Portland, jury finds\n- Jesse Lee Calhoun now accused of killing 4th woman who disappeared in Portland area\n- Man accused in SE Portland fatal stabbing is older brother of teen shot to death by Vancouver police in 2019\n- Police seek doorbell, security-camera footage in North Portland homicide"
    },
    {
      "url": "https://www.oregonlive.com/crime/2025/07/man-accused-in-se-portland-fatal-stabbing-is-older-brother-of-teen-shot-to-death-by-vancouver-police-in-2019.html",
      "text": "The 28-year-old man accused of a fatal stabbing in a Southeast Portland home earlier this month is the older brother of a teen who was shot to death by Vancouver police six years ago.\nS. Mate Joseph was 22 when his brother, 16-year-old Clayton Joseph, was shot and killed in February 2019 outside of a Vancouver apartment complex. Then-Police Cpl. Roger Evans, who retired from the department last year, shot Clayton Joseph once. The officer said Clayton Joseph had a knife in his hand and was threatening him.\nClark County Prosecuting Attorney Anthony Golik found the shooting justified.\nAccording to Golik’s August 2019 report, the shooting unfolded after police responded to a disturbance involving S. Mate Joseph and his girlfriend. Golik wrote that S. Mate Joseph was “engaged in a loud verbal and physical altercation with his girlfriend,” identified in the report as Neilyen. Witnesses said S. Mate Joseph was intoxicated and angry, according to Golik’s report.\nVancouver police and officials from the prosecuting attorney’s office confirmed that the S. Mate Joseph, referenced in the 2019 report, is the same man accused of first-degree burglary and second-degree murder in the July 19, 2025, incident in Southeast Portland.\nIt also appears that the girlfriend mentioned in the six-year-old Vancouver police-shooting report is the same woman killed in the July 19 stabbing near Southeast 143rd Court in Portland. Portland police identified the victim as 24-year-old Neilyann Ysam, and a Vancouver police spokesperson and an official from the Clark County Prosecuting Attorney’s Office said they share the same date of birth.\nIn the police shooting case, Golik wrote that Clayton Joseph became involved in the fight, brandished a knife and threatened to stab witnesses. Several people called 911, with Golik describing the scene as “hectic.”\nEvans was the fourth officer to arrive on the scene that day. The three other officers were attempting to get S. Mate Joseph, on the ground, but the officers later said he did not comply, Golik wrote. S. Mate Joseph was described as “intoxicated and very agitated.”\nAs Evans drove up, he saw Clayton Joseph exit an apartment complex gate and walk toward the officers who were beside his brother, Evans told investigators. Evans got out of his patrol car and told the teen to stop and show his hands.\nAt this point, Evans said they were 12 to 15 feet apart, and he saw a knife in Clayton Joseph’s right hand. The officer ordered him to drop the knife at least once and said the teen did not comply and moved towards him with the weapon raised. He fired a single round at Clayton Joseph, who fell to the ground.\nEvans told investigators he felt he had no reasonable option other than to fire his weapon, believing he would have been stabbed. When asked about the possibility of using a taser, he said he did not do so because he was alone and was trained not to use it unless he had another officer with him.\nClayton Joseph was a student at Evergreen High School in Vancouver. Golik’s report mentioned that Clayton and his family had moved to Washington a year prior to the shooting from Micronesia.\nThe older Joseph brother, S. Mate, was arrested in Vancouver on July 19, a little more than three hours after police responded to the stabbing at the Southeast Portland residence, where officers found Ysam dead.\nOfficers also found five children inside the home. Police said the children were not injured.\n“I’m comfortable saying (the children) would have been exposed to the violent crime, which is terrible and tragic,” Sgt. Kevin Allen, a police spokesperson, told reporters that day.\nS. Mate Joseph is also accused of driving under the influence of intoxicants, violating a protective order and fourth-degree assault. He made an initial appearance in Clark County Superior Court last week and is being held without bail.\nMultnomah County officials are working to bring him to Oregon.\n—Zaeem Shaikh covers the Portland Police Bureau and criminal justice issues for The Oregonian/OregonLive. Reach him at 503-221-4323, zshaikh@oregonian.comor on X@zaeemshake.\nStories by Zaeem Shaikh\n- Portland homicides drop 51% in 2025, steepest decline among major US cities, report finds\n- Portland councilors grill police chief while approving $3.75M settlement in fatal shooting of unarmed man\n- Former Vancouver cop sues police department, says commander has ‘animus towards white male officers’\n- Portland police find suspect in swastika vandalism in jail on a separate bias crime allegation\n- Vancouver residents asked again to approve property-tax increase to fund more police"
    },
    {
      "url": "https://www.cbsnews.com/boston/news/boston-homicide-numbers-crime-rate-2024/",
      "text": "Boston sees lowest homicide numbers since the 1950s, though shoplifting is up\nBOSTON - Boston is a such a safe city that law enforcement is now seeing homicide numbers that haven't been a reality since the 1950s.\nOnly 24 homicides in 2024\n\"In the entire time that I've been a police officer, going back since I came on, the city has never been safer, period,\" declared Boston Police Commissioner Michael Cox during a press conference on Friday.\nIncidents of gunfire are down 14%, and 37% over the last five years. It's the lowest it's been since 2011 when they started tracking it consistently. To date, Boston has only seen 24 homicides on the year.\n\"I would think it would be higher than that,\" says Beth Cafarella, a Massachusetts resident, \"We feel safe. We love the Common. It's a lot of people from all over the world who come here because of the attractions and the schools.\"\nThe biggest upward trend in crime is shoplifting. Cox said it is up 30% and the main catalyst to a 6% increase in commercial burglaries. If the shoplifting numbers were removed, he said commercial burglaries would actually be down 17%.\nWhy is violent crime so low?\nMayor Michelle Wu credits some of the city's success to transparency. She said that detailed crime data is regularly shared during public meetings, which allows informed residents to pitch ideas to law enforcement that they can then implement.\n\"We also see that a focus on delivering results, especially in the areas of violent crime leads to resources that can then be deployed to address quality of life issues,\" added Wu.\nHer comment means that the lower the violent crime, the more time officers have to tackle shoplifting problems and other issues."
    },
    {
      "url": "https://www.oregonlive.com/crime/2025/07/police-seek-doorbell-security-camera-footage-in-north-portland-homicide.html",
      "text": "The Police Bureau is asking residents who live near the area of a recent fatal shooting in North Portland to send security- and doorbell-camera footage to help detectives identify a suspect.\nPolice believe private security cameras and doorbell footage may have captured what happened before and after the shooting on Sunday. Detectives are focused on the New Columbia area of the Portsmouth neighborhood. This includes North Columbia Boulevard to Houghton Street, North Portsmouth Avenue and North Chautauqua Boulevard.\nPolice are asking area residents to upload all video saved on their systems the day of the shooting – July 20 – between 10:30 a.m. and 11:15 a.m.\nThe Police Bureau has created a web page where people can upload video directly to the Detective Division.\nOfficers responded to the shooting in the 9300 block of North Newman Avenue, near McCoy Park, just after 11 a.m. on Sunday. When they arrived, officers found 21-year-old Jalen Hudson with a gunshot wound, police said. Hudson died at the scene.\nPolice ask anyone with information about the incident to contact Detective Ryan Foote at ryan.foote@police.portlandoregon.gov or Detective Matt Brown at matthew.brown@police.portlandoregon.gov and reference case No. 25-193861.\n—Zaeem Shaikh covers the Portland Police Bureau and criminal justice issues for The Oregonian/OregonLive. Reach him at 503-221-4323, zshaikh@oregonian.comor on X@zaeemshake.\nPortland area homicides\n- Portland homicides drop 51% in 2025, steepest decline among major US cities, report finds\n- Vape shop owner guilty of killing two business rivals in SW Portland, jury finds\n- Jesse Lee Calhoun now accused of killing 4th woman who disappeared in Portland area\n- Man accused in SE Portland fatal stabbing is older brother of teen shot to death by Vancouver police in 2019\n- Woman accused in deadly shooting outside NE Portland Safeway claims she shot man stealing her van"
    },
    {
      "url": "https://www.oregonlive.com/crime/2025/07/police-arrest-alleged-gunman-after-daylight-shooting-in-downtown-portland.html",
      "text": "A fatal shooting Tuesday afternoon in downtown Portland prompted police to scramble across eight city blocks in order to arrest the alleged gunman.\nThe shooting happened around 3:30 p.m. at Southwest 10th Avenue and Yamhill Street, near the Central Library, and involved two people, police said. One person died, and the alleged gunman fled on foot.\nBut officers caught up to the gunman on Southwest 4th Avenue and Alder Street, piled on top of him and arrested him, witnesses said.\nPolice spokesperson Terri Wallo Strauss said the area around Southwest 10th and Yamhill, including TriMet stops and stations, was closed while police investigated. A spokesperson for the Multnomah County Library said the shooting was not associated with the central branch.\nDevan Pascale, the assistant manager at Grand Gesture Books, said she and other employees saw two men fighting outside the Southwest 10th Avenue shop when suddenly two shots rang out.\nThe wounded man seemed confused or incoherent as he lay on the ground, according to Pascale, while the suspected shooter ran off.\n“He wouldn’t let anyone touch him,” she said of the injured man.\nBystanders eventually approached and tried to staunch the bleeding from an apparent chest wound with blue painter’s tape, she said. Another witness said the man was also shot in the hand and bystanders applied pressure there, too.\nParamedics eventually took the man to a hospital, where he was pronounced dead.\nPascale, 36, said she’s become accustomed to signs of distress from those in the area, which hosts the Central Library as well as trendy bars and a parking garage. The shop carries anti-overdose drugs to help in emergencies, but the outburst of violence was altogether unexpected.\n“This was something that was totally out of our realm of possibility,” said Pascale. “It’s hard not to let it shake you up a bit.”\nThe person’s death Tuesday marks the city’s 18th homicide so far this year, compared with 37 at this point last year.\n“I’m saddened and angry the conversation is once again about the loss of life,” Portland Police Chief Bob Day said at a press conference around 5 p.m.\nPolice were gathering information to determine whether the suspect and victim knew each other.\n—Zaeem Shaikh covers the Portland Police Bureau and criminal justice issues for The Oregonian/OregonLive. Reach him at 503-221-4323,zshaikh@oregonian.com or on X@zaeemshake.\nPortland area homicides\n- Portland homicides drop 51% in 2025, steepest decline among major US cities, report finds\n- Vape shop owner guilty of killing two business rivals in SW Portland, jury finds\n- Jesse Lee Calhoun now accused of killing 4th woman who disappeared in Portland area\n- Man accused in SE Portland fatal stabbing is older brother of teen shot to death by Vancouver police in 2019\n- Police seek doorbell, security-camera footage in North Portland homicide"
    },
    {
      "url": "https://www.oregonlive.com/crime/2023/06/national-institute-for-criminal-justice-reform-tapped-to-help-portland-curb-gun-violence.html",
      "text": "The city of Portland has signed a contract with the National Institute of Criminal Justice Reform to help develop a “Portland Ceasefire” plan to reduce gun violence and has dropped pursuit of gunshot detection technology.\nUnder the $437,600 one-year contract, the nonprofit consulting and research institute will provide training to help police strengthen reviews of weekly shootings.\nThe idea is to identify people or groups involved in shootings or at the highest risk of being involved in future shootings so community outreach workers and police can intervene to prevent retaliatory violence.\nThe strategy, also known as focused deterrence, would include face-to-face “call-in” meetings with the individuals or groups to offer support and spell out the consequences of any continued involvement in crime.\nThe institute’s executive director, David Muhammad, and Reygan Cunningham, co-director of the California Partnership for Safe Communities, and others will work with city officials, community organizers and police to improve services to at-risk residents and guide gang and street-level outreach workers, according to the contract.\nMuhammad told The Oregonian/OregonLive that the strategy is two-fold: identification of those highest at risk of becoming shooters or victims and immediate and long-term intervention.\nWhile Portland police and community groups may be involved in some aspects of this now, “there is a current lack of specificity and lack of intensity,” he said.\nIntensive intervention entails having an outreach worker talking every day to a person who has been identified as having the potential to retaliate for a prior shooting, seeing them in person three to four times every week to develop a trusting relationship that is consistent over time to help steer the person towards better choices, he said.\nInformation that police obtain about people plotting retaliatory shootings on social media should be shared immediately with a community outreach team, and outreach workers must engage in what he called a “relentless pursuit” to connect with people at risk, he said.\n“That level of intensity is not happening right now,” in Portland, according to Muhammad.\nHis team started providing training in Portland last week. The National Institute for Criminal Justice Reform is working on similar strategies in Oakland, Stockton and San Francisco in California, Indianapolis, Memphis, Austin, Philadelphia, Baltimore and Washington, D.C.\nSierra Ellis, who has served as interim director of Portland’s Office of Violence Prevention since November, will manage the Portland Ceasefire project.\n“Gun violence remains at historic levels, and it’s important that we work with experts to be innovative and most of all work together to make an impact,” said Mayor Ted Wheeler, who serves as police commissioner.\nSo far this year, 37 people have died in homicides in Portland. At this time last year, when Portland recorded a record 101 killings, 39 people had died in homicides. There have been a total of 438 shootings so far this year, according to police. Police recorded 1,308 shootings throughout the city last year.\nWheeler said he and Police Chief Chuck Lovell decided to pursue a focused deterrence model and strengthen street-level community outreach and not spend money at this time on a controversial new gunshot detection technology.\n“It really came down to resources - time, money, bandwidth and personnel,” the mayor said.\nThe Community Oversight Group for the Police Bureau’s gun violence enforcement team, the Focused Intervention Team, had recommended the city adopt a focused deterrence strategy and a gunshot detection technology to try to curb shootings in the city.\nBut the gunshot detection technology faced significant criticism in the city. Many questioned the accuracy of the audio surveillance and raised concerns about privacy from the surveillance and how it could increase police workload in an agency already hampered by vacancies by sending officers to incidents where no evidence of a shooting is found.\nThe city had obtained proposals for a pilot program from two companies, SoundThinking, the new name for ShotSpotter that acoustically tracks and alerts officers and dispatchers to gunshots, and Eagl Technology, which detects gunshots through energy sensors. In April, representatives from both companies answered community questions during a virtual forum.\n“We’ve decided that this is not the time to implement a gunshot detection pilot in Portland,” Wheeler said. “The strategies that I’ve just outlined are the best ones for right now that we believe can make the biggest impact in reducing gun violence in the near term.”\nThe mayor said he wants to get the Police Bureau’s vacancies filled and then reevaluate whether the gunshot detection technology is warranted. At the end of May, the bureau had 77 vacancies out of an authorized strength of 882 sworn members.\nThe American Civil Liberties Union of Oregon applauded the mayor’s decision to drop consideration of gunshot detection technology. “Thanks to incredible community advocacy and organizing efforts, the city will not invest in this costly system that would have only led to perpetuating overcriminalization in communities of color!” the ACLU wrote in a statement posted on social media.\nThe continued pace of homicides this year “underscores the importance” of the “scaled-up” intervention and focused response the city is seeking to adopt with help from national experts, Wheeler said.\nHaving a program manager in the city dedicated to leading separate efforts already underway, such as police shooting reviews and street-level outreach, will make a substantial difference, said Portland police Lt. Ken Duilio, who oversees the Police Bureau’s Focused Intervention Team. The team of officers responds to shootings.\n“There will be better coordination,” he said. “I think it will be more effective and more efficient.”\nSeparately, the city’s Office of Violence Prevention is working to collaborate with Portland community-based organizations to add more street level outreach for those at highest risk of becoming either victims of a shooting or perpetrators of violence in three areas of the city: a north zone with focus around Roosevelt High and Jefferson High Schools; a Northeast zone focused around Parkrose and McDaniel High Schools and a Southeast zone with a focus around David Douglas High School.\nThe office expects to spend $4.5 million for the Cure Violence efforts over the next two years, according to the mayor.\nThe city already has issued a $780,000 Cure Violence grant to Portland Opportunities Industrialization Center, better known as POIC, to handle the north zone, and has put out a request for proposals for the Northeast and Southeast areas. The city hopes to award those contracts within the next few weeks, said Stephanie Howard, the mayor’s community safety manager.\nSamuel Thompson, a program manager in the city’s Office of Violence Prevention, said the biggest change will be greater coordination and collaboration to make the most impact.\n“We have a lot of organizations who are doing great work,” he said, “but everybody is doing great work in their own individual silos.”\nThere are about 11 to 15 street-level outreach workers funded by the city now who are dedicated to helping those impacted by gun violence. The goal with Cure Violence is to add another 26 outreach workers, according to Thompson and Andrew Culberson, of the Office of Violence Prevention.\nThe Cure Violence model takes a public health approach to reducing shootings. Community workers are expected to identify offenders, the causes that are responsible for a disproportionate share of violence in different parts of the city and work to deter violence from continuing by mediating conflicts and connecting high-risk people to social and economic services, job training and counseling.\nThe National Institute for Criminal Justice Reform will have at least three people providing guidance, with on-site help in Portland at least two days a month for the next year, according to the contract, which runs through next April. It will continue to work closely with the California Partnership for Safe Communities.\nThe California Partnership released a study last year that found more than half of the shootings in Portland from January 2019 through June 2021 involved gang or group members as either victims or suspects.\nAt that time, California Partnership recommended that the city’s violence intervention strategy focus on people most involved in shootings -- gang or group members – and urged the city to work with probation and parole officers on risk assessments for them.\nThe study found that those most involved in the violence are men ages 18 to 34 who had prior and often extensive criminal justice system involvement, who are on probation, are involved in a gang or who have been shot or connected to a recent shooting or homicide victim.\nThe “focused deterrence” strategy is one that police and members of the community group monitoring the Police Bureau’s gun violence team recommended last year after visits to Oakland and Tampa to learn how those cities target gun violence. It was developed in Boston in the late 1990s.\nThe call-in meetings involve police, prosecutors and probation officers telling people suspected of participating in shootings or found with illegal guns about the benefits of eschewing violence, including offers of educational support, jobs and social services. The people are then expected to share the message with others who look up to them.\n-- Maxine Bernstein\nEmail mbernstein@oregonian.com; 503-221-8212\nFollow on Twitter @maxoregonian\nOur journalism needs your support. Please become a subscriber today at OregonLive.com/subscribe"
    },
    {
      "url": "https://www.oregonlive.com/politics/2025/08/shooting-near-downtown-portland-library-prompts-security-overhaul-possible-metal-detectors.html",
      "text": "It’s been one month since a violent exchange outside the downtown Portland Central Library left a man dead, and its impact could bring lasting changes to Multnomah County’s flagship branch.\nThe county’s Director of Libraries Annie Lewis told the Board of Commissioners Thursday that the downtown branch is weighing major changes to security in and around the building, potentially including metal detectors and bag searches. Lewis said it would be a difficult choice to make.\n“Weapons detection in a public library is a really significant measure to take,” Lewis told the board, “and it comes with a lot of risks and implications that would need to be considered.”\nThe shooting that spurred renewed concerns over safety took place July 1 at Southwest 10th Avenue and Yamhill Street. Police responded to reports of a shooting and arrived to find a man, later identified as 50-year-old Douglas Ivers, with gunshot wounds. Officers eventually tracked down the suspect, identified as 26-year-old Hassan Muse, six blocks from the scene and arrested him.\nIvers was transported to the hospital, where he was pronounced dead.\nMuse and Ivers were seen on library surveillance video inside the library shortly before the deadly confrontation, according to court records and police. Detectives suspect both men were armed while in the library, with Muse possessing a firearm and Ivers carrying bear spray, police said.\nIn the wake of the shooting, officials from the county and city butted heads over who should shoulder the blame and whose responsibility it was to improve security around the library. The two governments have put those differences aside and convened a group of city, county and police bureau leaders to address the crisis playing out around the building, Lewis said. That team includes police Chief Bob Day’s Chief of Staff Robert King, the city’s Director of Community Safety Stephanie Howard, Lewis and the county’s Workplace Security Director Dorothy Elmore, among others.\nThe county has already heightened security at the branch since the shooting, adding more security officers, limiting Wi-Fi access after hours and adding 24-hour security camera monitoring outside the building, Lewis said.\nPolice have also upped bike squad patrols in the area, King said. He told commissioners that the police bureau is working to reduce crime in the blocks surrounding the building, which fall under the city’s purview.\n“We’re just continuing to look for ways innovatively and collaboratively to address all these issues,” he said.\nCounty officials are now considering the cost and consequences of adding metal detectors. Rough estimates show a weapons detection system and staff to man it could cost upwards of $750,000 per year, Lewis said. Installing metal detectors would require a vote from the board and new policies to comply with state law on authorized administrative searches, according to Lewis.\nIt could also create a barrier for homeless individuals, who often bring their belongings with them into the library, Lewis said.\n“We would likely need to limit the number and size of bags that come into the Central Library, which has very significant implications for our unhoused community — many of whom use our public library every day very successfully and peacefully,” Lewis said.\nThe library could also temporarily remove the benches at the front of the building, install vapor sensors in restrooms to detect smoking of illicit drugs and bolster access to on-site behavioral health resources, according to Lewis.\nLewis will come back before the board in September to share more details on what enhanced security at the Central Library could look like.\n— Austin De Dios covers county politics, programs and more. Reach him at 503-319-9744, adedios@oregonian.com or @AustinDeDios"
    }
  ],
  "argos_summary": "Portland has experienced a significant 51% decrease in homicides in the first half of 2025, the largest drop among major U.S. cities, according to a recent survey. The city recorded 17 homicides compared to 35 during the same period last year, alongside reductions in other violent crimes such as rapes and robberies. City officials attribute this decline to ongoing police strategies, community partnerships, and intervention programs like Ceasefire, which focuses on at-risk individuals to prevent violence. Despite the positive trend, concerns remain about potential increases in violence during the summer months.",
  "argos_id": "PPEZWQCPJ"
}