{
  "url": "https://www.engadget.com/gaming/nintendo/nintendo-designed-a-playdate-like-crank-for-the-switch-2-211420947.html",
  "authorsByline": "Ian Carlos Campbell",
  "articleId": "7db310d6bbae4b4b8c70d63172192304",
  "source": {
    "domain": "engadget.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-08%2F747c3200-7499-11f0-b7ab-c58d0b74c0ef&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=97d02f5f23e560496cecd2fcea951886f438db8f",
  "country": "jp",
  "language": "en",
  "pubDate": "2025-08-08T21:14:21+00:00",
  "addDate": "2025-08-08T21:25:10.180569+00:00",
  "refreshDate": "2025-08-08T21:25:10.180570+00:00",
  "score": 1.0,
  "title": "Nintendo designed a Playdate-like crank for the Switch 2",
  "description": "A recent Nintendo patent suggests the company might make a crank accessory for the Joy-Con 2 controllers.",
  "content": "Nintendo has eyed adding a Playdate-style crank to the Switch 2, according to a recently spotted patent from Nintendo Patents Watch. The hypothetical accessory would add tracking rotational movement to an existing bag of Joy-Con 2 controller tricks that includes motion and mouse controls.\n\nBased on the patent application, the crank accessory attaches to the side of a Joy-Con 2 magnetically, not unlike the controllers' wrist straps. Whichever game supports the accessory can use the Joy-Con 2's mouse sensor to track the rotations of the crank as an input. Fishing games or games with dedicated fishing mini-games, like Animal Crossing: New Horizons, seem like the obvious contenders for an accessory like this, but knowing Nintendo there are weirder possibilities, too.\n\nAnother patent imagines a similar setup being used for a clickable wheel. The patent illustrations looks like a lighter, but the accessory could just as easily be used while dragging a Joy-Con 2 along a surface. It might even add extra resistance or friction to the Switch 2's mouse controls.\n\nGiven that these are patent applications, there's no guarantee Nintendo plans on turning either of them into real products. Still, they're a glimpse at the Switch 2's untapped potential for supporting goofy accessories, something that defined a good portion of the Wii's lifespan.\n\nThe wildest Nintendo got with the original Switch was Nintendo Labo, cardboard accessories that turned the console into everything from a VR headset to a simple fishing rod. A crank might be the first of several adventurous accessories for Nintendo's new console.",
  "medium": "Article",
  "links": [
    "https://www.engadget.com/2018-02-01-nintendo-labo-hands-on.html",
    "https://www.engadget.com/gaming/nintendo/the-switch-2s-joy-cons-can-double-as-mouse-like-controllers-133355339.html",
    "https://www.engadget.com/gaming/playdate/",
    "https://www.engadget.com/2019-05-02-nintendo-labo-vr-review-cardboard.html",
    "https://www.engadget.com/gaming/nintendo/nintendo-switch-2-review-more-of-what-you-love-120048430.html",
    "https://bsky.app/profile/ninpatentswatch.bsky.social/post/3lvtbv7atlk2l",
    "https://www.engadget.com/2020-03-16-animal-crossing-new-horizons-review-switch.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "goofy accessories",
      "weight": 0.11563492
    },
    {
      "name": "cardboard accessories",
      "weight": 0.1149113
    },
    {
      "name": "several adventurous accessories",
      "weight": 0.111869395
    },
    {
      "name": "Nintendo Labo",
      "weight": 0.10334728
    },
    {
      "name": "Nintendo",
      "weight": 0.09975184
    },
    {
      "name": "Nintendo Patents Watch",
      "weight": 0.09779445
    },
    {
      "name": "patent applications",
      "weight": 0.094830245
    },
    {
      "name": "Switch",
      "weight": 0.08431309
    },
    {
      "name": "Fishing games",
      "weight": 0.082457855
    },
    {
      "name": "tracking rotational movement",
      "weight": 0.076652616
    }
  ],
  "topics": [
    {
      "name": "Nintendo"
    },
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.81201171875
    },
    {
      "name": "/News/Technology News",
      "score": 0.69775390625
    },
    {
      "name": "/Computers & Electronics/Consumer Electronics/Game Systems & Consoles",
      "score": 0.54443359375
    },
    {
      "name": "/Games/Computer & Video Games/Other",
      "score": 0.453125
    }
  ],
  "sentiment": {
    "positive": 0.2319336,
    "negative": 0.21240234,
    "neutral": 0.5551758
  },
  "summary": "Nintendo is reportedly planning to add a Playdate-style crank to the Switch 2, according to a patent from Nintendo Patents Watch. The hypothetical accessory would add rotational movement to its Joy-Con 2 controller tricks, which already include motion and mouse controls. It attaches to the side of the Joy-C 2 magnetically, similar to the controllers' wrist straps. Depending on the game's support, the crank can be used as an input for games such as fishing or dedicated fishing mini-games. Another patent imagines a similar setup being used for a clickable wheel. While these patent applications are not expected to be implemented, they show the potential for Nintendo's new console to support more quirky accessories.",
  "shortSummary": "Nintendo has patented a Playdate-style crank accessory for the Switch 2, adding rotational movement to Joy-Con 2 controller functions, with potential for gaming and other bizarre accessories.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "584cc929cdd547a8973d72c561096e4f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.engadget.com/2019-05-02-nintendo-labo-vr-review-cardboard.html",
      "text": "Nintendo Labo VR review: Cute, cardboard and kinda boring\nIt's better than other Labo kits, but it's not going to take on PlayStation VR.\nVirtual reality devotees scoffed at the introduction of Google Cardboard five years ago: Why would anyone settle for such a limited, feeble-looking piece of paper when \"real\" headsets were on the horizon? But Cardboard was never about competing with Oculus Rift or HTC Vive. Instead, it was a way to give non-early adopters a low-cost taste of immersive technology. Years later Cardboard has faded into the background as the VR scene has taken off, but Nintendo never forgot about the promise of low-tech VR. Labo VR builds on both the initial ideas of Cardboard and the inaugural Labo sets to create a unique, endearing and most important, playful experience. The Labo VR kit gives you a headset to construct, sure. It's admittedly more weighty and chunky than Google's offerings, because it has a lot more work to do. It has to hold an undocked Switch console and both its Joy-Cons. Then there's a series of attachable accessories included in the kit that you must also assemble yourself. The one thing not included is a head strap. While the headset isn't heavy, holding it up to your face can get tedious. If you own any of the three previous Labo kits, you know what to expect when you load the game cartridge up. And if you don't, that's fine. That was my first experience too, and I had no problem following the directions for each project and completing all of them fairly quickly. I ended up fast-forwarding through the directions often, sometimes screaming at the console to \"get on with it!\" as it felt the need to demonstrate each fold one by one. But that's me -- an impatient adult. The clarity of these directions is absolutely perfect for kids, who are the target audience for Labo. I appreciated the ability to rotate the diagrams and replay the animations. As someone who has put together a lot of STEM kits designed for kids, I am constantly frustrated by bad or unclear directions. Aside from the headset, there are five major projects included in the deluxe package: a camera, an elephant, a bird, a wind petal and a blaster. The elephant and the bird had a lot of fiddly bits and I didn't enjoy putting them together as much, but the camera and the wind pedal were a lot of fun to assemble. These happen to be the sturdiest of the projects; what attracted me the most about these two was all the thought that went into making them so solid. The wind pedal is especially fun with all of its inner crossbars, which are necessary given that you tap this thing with your foot repeatedly. When you do that, it sends a huge blast of air toward your face. It's surprisingly effective as a fan. The blaster is the most complex project, and I ended up both loving and hating it. But the final product is definitely cool. You have to cock it every time you want to fire, and the snap as you pull the trigger is incredibly satisfying. But let's be honest, you're not here to hear how fun the individual projects are to put together; you want to know how good the VR is. And... it's as good as you're going to get with a 720p display and two plastic lenses. Which isn't bad: Everything is clear, though decidedly artificial. The headset is comfortable and even fits over my glasses. There is one big problem with this particular cardboard construction though: It gets dust all over the lenses. The game asks you to keep the lenses as clean as possible, but the headset's accessories constantly shed little cardboard granules. Maybe the amount of debris that they shed will fade over weeks and months of use, but when I used it, the eyepiece got absolutely filthy and I was constantly cleaning it. Also, if you're sensitive to the scent of cardboard, remember that you're putting this thing right next to your face. It's not an awful swell, but after playing with the headset for a while I got tired of having that all up in my nasal cavity. I don't know how long you'd actually play with it though. Right now each project has its associated mini game, but none of them are that good. The VR Plaza is chock-full of brief amusements that are good for a few minutes each. The Toy-Con VR Garage, where users can design their own games has promise, but unless you're big on DIY, you'll be waiting a while for a home brew scene to take off. And the VR updates added last week for two of the Switch's best titles aren't good. There's no killer app for Labo VR yet. The wind-pedal game involves trying to jump over balls that float toward you. It's ugly as hell and not all that engaging. The bird game makes better use of the pedal and also uses the bird you built in a sort of flying game that reminds me of Pilotwings a bit. It's fun, but I quickly got tired from having to pump the bird's wings and the wind pedal. It isn't something you play to relax, as it requires quite a bit of physical exertion. The painting activity, which uses the elephant accessory, was great in concept. Drawing in VR is a lot of fun once you get the hang of it. You can create 360-degree drawings with depth just by moving your arm in and out. However, handling the cardboard trunk doesn't feel that good. You're limited to one hand, the whole thing is held together by rubber bands that create a lot of resistance and the cardboard grip is a bit scratchy. The blaster game is mostly fun because the blaster is such a joy to handle. It's a rail shooter where you fire at alien blobs that are kind of bobbing along in a city, minding their own business. It's weird from a plot standpoint (they aren't actually attacking you), and it's not all that challenging. But I liked it anyway. My favorite game ended up being the Ocean Camera, which reminded me of Pokémon Snap in how it asked for specific creatures or settings. It's the one accessory and related game that plays into the visual capabilities of virtual reality. The camera itself is also super twee, with a small gear inside that clicks when you turn the lens as if you're handling a real shooter. And yeah, it actually zooms the camera for better shots. I would play a whole line of games that used this accessory. I could also see making it compatible with future games like Animal Crossing for Switch or heck, Pokémon Sword and Shield, given that previous games in both series have had in-game cameras. What you do have right now is VR compatibility with two of the Switch's biggest and best titles: Super Mario Odyssey and Legend of Zelda: Breath of the Wild. These are free updates you can download, and the two take decidedly different approaches to dumping VR on top of games that were pretty much perfect to begin with. And yeah, I mean dump: In both games, the VR mode is decidedly worse than playing the game normally. They're not Virtual Boy bad, but they're still kind of bad. Breath of the Wild's VR mode is just that, an option. It's just the regular game, but now you get to hold the Labo VR headset up to your face with the Joy-Cons attached. It looks good, but it's uncomfortable. Also, VR sickness, ahoy! Breath of the Wild is a game where you'll be looking around a lot and sometimes quickly, and the graphics the Switch delivers are worse than those on the high-end headsets. Mind you, those companies have been trying for years and still haven't completely solved the nausea problem. So you're going to have to take a lot of breaks to avoid getting sick. Super Mario Odyssey actually went so far as to craft new missions that can be experienced in VR. You can play them normally, but I don't see why you'd want to. You're put in a stationary position, directing Mario with the controls but not actually following him around the levels. To look around you must turn in the real world, even if you're not using the headset. It's tricky and frustrating, and forgets that part of the fun of Mario is exploration. Instead of immersing me deeper into Mario's adventure, I felt further removed, since I could only watch him from my fixed location in the center of the board. The games did look good, but given Nintendo's reputation for valuing solid play experiences over graphics, it's disappointing. Labo VR isn't going to compete with the likes of PlayStation VR, and not because the Switch is less powerful than the PS4. It doesn't compete because it's presenting a different type of play experience, where the construction of the headset and its accessories are part of the package. If it were a pre-built headset with a bunch of accessories, I couldn't recommend it at all, at least not at its current price of $80 for the complete set. If you're curious about Switch as a conduit for VR, I'd say opt for the $40 starter package, which includes the headset and the blaster (which is the best project anyway). You'll miss out on the wind pedal and the camera, but those are available through the two expansion sets, which cost $20 each. So you're not spending more money by choosing to purchase the projects separately. If you've enjoyed the previous Labo kits or want to dip your toe into the ecosystem for the first time, go for it. This is a good experience on its own, and Nintendo seems to have learned from the mistakes of the last batch of Labo. There's also a lot of potential in it as a vehicle for VR in other games -- games that can be built from scratch with Labo in mind. But with nothing announced at this time, I wouldn't hold my breath waiting."
    },
    {
      "url": "https://www.engadget.com/2018-02-01-nintendo-labo-hands-on.html",
      "text": "Nintendo Labo hands-on: Cardboard has never been this fun\nNintendo's crazy Switch accessories aren't so crazy after all.\nLeave it up to Nintendo to get us excited over cardboard. Labo, its DIY Switch-powered cardboard accessory line, seemed like the purist encapsulation of Nintendo's philosophy: \"Play\" is far more important than having the best graphics. At first glance, Labo seems like a unique mixture of digital and analog gaming that kids will likely love. And based on my brief time with a few Labo kits today, it's something adults will likely have a blast with as well.\nEntering the Labo demo area gave me flashbacks to elementary school. A name card pointed me to my assigned table, which I shared with another reporter. All of the desks were arranged around the edges of the room, which gave Nintendo's representatives, decked out in bright pink sport coats, plenty of room to show off the accessories. On the side of my desk lay a tray filled with markers, crayons and snacks, all of which really made me question my adulthood.\nWe started out by building the RC Car Toy-con, which looks more like a vibrating bug than any sort of vehicle. My partner and I punched out the required parts from the sheets of cardboard, then followed along with the Switch's instructions for constructing the toy. The interface was a bit confusing at first -- for some reason, you have to hold down the touchscreen buttons to move the tutorial forwards and backwards, instead of just tapping them. Once we figured that out, though, it was mostly smooth sailing.\nThe Labo app clearly lays out what you need to be working on, and how exactly you need to fold specific creases to construct each accessory. You can also use the Switch's touchscreen to move the on-screen diagram, letting you see different angles in case you're having trouble. My deskmate and I had our RC Cars constructed within 15 minutes, and we finished them off by sliding on our Joy-cons. I was honestly surprised by just how well they fit into a few cardboard slots.\nAfter that, we attached a cardboard antenna to the Switch tablet (no, the antenna doesn't actually do anything), and used the Labo app to buzz our RC Cars around the table. It's not exactly a complex toy -- it relies on the Joy-con's HD rumble feature to move, and the app lets you control the intensity and direction of its vibrations. Still, it's a quick and helpful introduction to Nintendo's vision for Labo.\nCompleting the RC Car was also useful morale booster before we were confronted with a more daunting project: the Labo Fishing Rod. It's significantly more complex, since it involves moving parts. All of its components are spread across six cardboard sheets, and they number in the dozens. My partner and I split up the work of punching out the required pieces, and we took turns putting it all together.\nFirst up, we had to construct the three extending portions of the rod, adorably named \"Papa bear,\" \"Mama bear,\" and \"baby bear.\" Furious cardboard creasing and folding ensued, and we had to pay extra attention to the instructions on the Switch. Some components were very large, and we had to make sure the folds and notches were all in the right place. At one point, we ended up building the \"baby bear\" part instead of \"mama bear\" (they look very similar, okay?!). We were still able to finish the piece properly, without precise instructions from the app, since we started to understand Nintendo's folding logic.\nUnfortunately, we weren't able to finish the Rods in the 50 minutes Nintendo gave us. I was looking forward to seeing how the reeling mechanism gets assembled, but I guess I'll have to wait for the Labo's launch. Nintendo took pity on us, though, and let us play with some finished Fishing Rods. They didn't exactly feel sturdy -- cardboard can only do so much -- but I was impressed by how natural the reeling felt.\nAfter we failed at construction, Nintendo moved us along to a room filled with completed Labo Toy-cons. I hopped on a child-sized bike -- feeling even more ridiculous as kids plopped down alongside me -- and picked up the Motorbike accessory. It's basically just a pair of handlebars, with space for a Joy-con in each, and a nook for the Switch tablet in the middle. It also has a long base, which rests against your thigh or stomach to balance the entire contraption as your playing.\nFor the most part, I was impressed by how tactile the Motorbike accessory felt in its accompanying Switch game (which comes with the $70 Labo variety pack). I started the engine by hitting a cardboard trigger right under my thumb, and revved up by twisting the right handlebar, as you would an actual motorcycle. It took me a few minutes to get a hang of the motion controls, but it wasn't too long before I was drifting and passing by my opponents. (My kingdom for a Switch Excitebike game that took advantage of this.)\nThe Labo House was a bit of a curiosity. It basically looks like a dollhouse for your Switch, which interacts with a variety of cardboard accessories. Each of those has a different function: One just rotates, one serves as a large button and another is a switch with two modes. There are slots on the sides and bottom of the house for inserting the blocks, each of which changes the environment for the unfortunate inhabitant inside the virtual house. Popping in two of the blocks unlocks a minigame -- the rotating crank and button, for example, unlocked a conveyor belt that charges up and gets releases when you slap the button. The crank and switch, meanwhile, let me microwave a bunch of ingredients to create a virtual cupcake.\nI had more fun with the Piano Toy-con, which turns the Switch into a portable synthesizer for kids. Each of its keys were surprisingly responsive, and it had no problem registering multiple notes when I was jamming down with all ten fingers. You can also alter the notes by inserting blocks at the top of the piano, which turn the keys into things like cat cries and operatic voices. A lever on the left side lets you alter the pitch of the keys, and you can also kick off some pre-recorded songs by hitting the play button. It's the sort of toy that could inspire kids to take music more seriously, even if its own feature set is fairly limited.\nI finished off my demos with the Fishing Rod Toy-con and its accompanying game. It's certainly a unique experience, as it's the first title I've seen to use the Switch in its vertical orientation. The console sits in a tray, which also houses the string that connects to the fishing rod. The Joy-cons, meanwhile, are in the base and rotating crank portions of the rod. When you're sitting in front of the Switch, it's as if your physical fishing line is connected directly to its virtual counterpart. It reacts fluidly as you move the rod around, and thanks to the Joy-con's HD rumble feature, the feedback from fish biting and fighting against my line felt almost like the real thing.\nUnfortunately, I didn't have a chance to try out the complex Toy-con Robot suit, due to limited timing during our demos. It certainly looks like fun, at least based on the reactions from kids at the session. I can't imagine how long that would take to put together, especially since I couldn't get the fishing rod together in an hour. I'd imagine most Switch owners would start with the $70 Toy-con variety pack, though. It includes the RC Car, Fishing Road, House and Motorbike Toy-cons. You'd have to shell out another $80 for the Robot kit alone.\nWhen it comes to durability, several Nintendo reps at the event assured us that the Labo accessories could easily withstand abuse from overzealous children. Still, at the event it was pretty clear that some components were already suffering from too much playtime. The cranking parts for the Fishing Rod and House felt a bit worn down. I also had to readjust the keys on the Piano a few times, after they became misaligned. I wouldn't be surprised if the Toy-cons could last for a few months, but I seriously doubt they'd survive much longer than that. And I can't imagine parents will be too happy when they see how quickly $70 toys can be destroyed.\nAfter spending a few hours with Nintendo's Labo accessories, I'm even more excited about their potential. The kids at the event were never bored, even as they struggled with complex instructions. Personally, I'm looking forward to gifting Labo kits to kids in my family, and helping them build each accessory. I'd bet it'd make them even more appreciative of their playtime, once they know how their toys are built."
    },
    {
      "url": "https://www.engadget.com/gaming/nintendo/the-switch-2s-joy-cons-can-double-as-mouse-like-controllers-133355339.html",
      "text": "Engadget has been testing and reviewing consumer tech since 2004. Our stories may include affiliate links; if you buy something through a link, we may earn a commission. Read more about how we evaluate products.\nThe Switch 2’s Joy-Cons can double as mouse-like controllers\nWii and PC ports might be a go.\nNintendo just dropped a boatload of Switch 2 news. We got the release date, which is June 5, and plenty of details. The company also pulled the lid off a mysterious Joy-Con feature. The rumors were right. They can double as mouse-like controllers.\nOne Joy-Con can be used as a traditional controller, held vertically, while the other slides along the table as a mouse. This could allow for near-perfect ports of Wii and Wii U games that relied on motion control, in addition to ports of PC titles. A Joy-Con will also combine with the gyroscope for unique gameplay experiences. Incidentally, this functionally will even work on pants.\nThe good use case here should be first-person shooters. Computer mouse controllers offer a level of precision that consoles have typically struggled to match, but this looks like an attempt to address this particular issue. It could even make the Switch 2 a powerhouse for franchises like Civilization. As a matter of fact, the company announced a port of Civilization VII.\nThe company revealed that a Switch 2 version of Metroid Prime 4 will use this feature. Nintendo might also release games that make special use of this functionality down the line. It also pulled the lid off a game called Drag x Drive that's controlled via mouse Joy-Con.\nThe company even showed off nifty-looking demos, but these look mostly like mini-games. I, for one, would very much like a new Mario Paint.\nThe company also revealed another tool for the Switch 2. This is the mysterious \"C\" button. The button calls up voice chat. Finally, a Nintendo console with easy voice chat."
    },
    {
      "url": "https://www.engadget.com/gaming/nintendo/nintendo-switch-2-review-more-of-what-you-love-120048430.html",
      "text": "Engadget has been testing and reviewing consumer tech since 2004. Our stories may include affiliate links; if you buy something through a link, we may earn a commission. Read more about how we evaluate products.\nNintendo Switch 2 review: More of what you love\nIt really is the Super Switch that we've been waiting for (aside from its battery life).\nBack in 2017, it felt like handhelds were dying. The PlayStation Vita was suffering from a lack of support and the 3DS was already on its way out. But then the Nintendo Switch arrived and became the hybrid console that launched 1,000 portable rivals. It proved you could make a device that was powerful enough to play games on your TV but also small enough to take with you anywhere. And by the time everything is all said and done, there's a good chance it will be the highest-selling console of all time.\nBut making a proper follow-up can be difficult. So for the Switch 2, instead of changing everything up again, Nintendo took the best features from the original, upgraded them and gave us more of what we love. And even though this is just the start, it feels like I've been enchanted all over again.\nWith the Switch 2, Nintendo improved everything we liked about the original while retaining its sleek and portable design.\n- Larger 7.9-inch LCD screen with HDR\n- More polished design\n- Magnetic Joy-Con\n- Improved base storage\n- Significantly better performance\n- Battery life could be better\n- Dock needs more USB-C ports\n- Increased price\n- No VRR when connected to a TV\nDesign\nThe Switch 2's design is the most obvious example of Nintendo not straying too far from the original's template. That said, nearly every component has been tweaked or upgraded in some way. The console's slightly larger dimensions (10.7 x 4.5 x 0.55 inches and 1.2-pound chassis with Joy-Con) help make way for a bigger 7.9-inch display. In fact, almost everything has been embiggened, including the face buttons, analog sticks and rear kickstand, the latter of which opens even wider than before.\nHowever, the Switch 2's biggest upgrade is its new Joy-Con. There's a familiar matte finish with more subtle red and blue accents, but instead of sliding them on and off like before, Nintendo gave them a new magnetic attachment system that comes with a very satisfying thunk. Meanwhile, detaching them is dead simple thanks to a handy button next to each trigger. So not only do the Joy-Con feel more secure, they are a pleasure to clip on and off as the need arises.\nNintendo didn't stop there though, because hidden in the edge of each Joy-Con is a sensor that allows them to function as mice. I will admit that I thought this feature was a gimmick at first. But in games like Civilization 7 that are traditionally best enjoyed with a mouse, they serve as a very welcome alternative to classic gamepad controls. They also work surprisingly well on the arm of a sofa or even your leg. This is handy because if you're playing games on your TV, you might not have a table or some other flat surface within reach.\nDisplay\nThe Switch 2's 7.9-inch LCD is a significant upgrade over the panel on its predecessor. Not only is it larger (up from 6.2 inches), it's also higher res (1080p vs. 720p) while boasting a 120Hz refresh rate and support for HDR. With its auto-brightness setting turned off, the screen tops out at around 400 nits, though in titles with HDR, I've found that number can hit 450 nits or more. The downside is that the Switch 2's LCD screen's black levels aren't quite as good compared to an OLED Switch. This can make dark backgrounds look closer to gray, especially when viewed in a low-light environment.\nWhen docked, the Switch 2's visual prowess expands to 4K at 60 fps or 1440p at 120 fps, though it's important to remember that those settings may not be available for every game. Sadly, the console supports VRR (variable refresh rates), but that only applies to its onboard display. On the bright side, the Switch 2 does seem to have support for auto low latency mode (ALLM), which is good for anyone who plays fast-twitch games like shooters.\nPerformance\nJudging the performance of a brand-new console is difficult because it often takes developers months or years to figure out how to truly optimize their games for a new platform. The Switch 2 features a chip from NVIDIA with a custom GPU that the company claims offers ten times more graphics power than what we got from the previous model, alongside support for features including DLSS and ray tracing. The console also comes with 12GB of RAM and 256GB of onboard storage, which can be expanded further using microSD Express cards.\nFirst-party titles like Mario Kart World run beautifully, though we've sort of come to expect that from major tentpole releases from Nintendo. The only hint of stuttering I've seen is when I played four-player local co-op with Game Chat turned on and multiple video streams going at the same time. And even then, it's hard to tell unless you're really looking for evidence of slowdown.\nWhat might be the biggest indicator of the Switch 2's improved performance is the sheer number of AAA third-party ports available at launch. Cyberpunk 2077 looks excellent and without a direct side-by-side comparison with something like the PC version, it's difficult to spot where any graphical corners have been cut. And while Street Fighter 6 isn't quite as impressive since some of the flashier effects don't pop as much as they do on other consoles, it's still a very enjoyable experience. As someone who often criticized the performance of the original Switch as one of its weak points, I'm thoroughly encouraged by the increased power I've seen from the Switch 2 thus far.\nBackwards compatibility\nOne of the best things about the Switch 2 is that it supports wide backward compatibility with original Switch titles. The vast majority of games work as you'd expect, though there are some outliers, including titles like Ring Fit Adventure, as the Switch 2's larger Joy-Con don't fit inside the existing controller straps. Many of the NS1's accessories are also backwards compatible, so you can still play games like Ring Fit by pairing one of the original Switch's Joy-Con. The other current high-profile bug is an issue in Super Smash Bros. Ultimate that can cause the game to crash when someone chooses a Mii Fighter. Thankfully, Nintendo is aware and working on a fix.\nThe real treat is that many older games look and run better on the Switch 2 than they did before. Super Mario Odyssey plays even smoother, while games like Legend of Zelda: Breath of the Wild are more beautiful than you remember thanks to an $10 upgrade pack (or free with Nintendo Switch Online Expansion Pack) that adds support for HDR, better graphics and more. However, the games that may have gotten the biggest boost are Pokémon Scarlet and Violet. Due to a free upgrade on the NS2, the game features a higher framerate, higher monster density, a longer draw distance and more. In some ways, it feels like a brand new game, and if it had launched like this back in 2022, Nintendo could have completely avoided one of the biggest knocks against it.\nGame Chat\nAnother major addition to the Switch 2 is the arrival of a built-in chat feature, including a new dedicated button on the console's controller. Setup requires a handful of identity checks, but once you've sorted that out, it's incredibly easy to use. You can invite people from your friends list to impromptu lobbies or create/join more permanent hangouts. Once you're in a chat, adjusting your settings is as easy as hitting the C button. From there, you can choose from a handful of screen layouts and background options, along with the ability to share your video, do voice-only or activate speech-to-text (or text-to-speech). And if you have a camera attached, you can put your face in chat too.\nNintendo has generally done a great job of making it easy to jump in and out of chats. With support for up to four video feeds and a total of 12 people per lobby, there's plenty of room for everyone in your family, no matter if they're in the next room or on the other side of the planet. The small demerits to Game Chat are that its frame rate and video resolution are relatively low (same goes for camera footage if you have one attached). The option to delete your background (aka green screen) often looks rather pixelated and if you watch closely, you may see video windows stutter unless you pin a specific view to your main feed.\nThat said, because Game Chat is more about enjoying the company of others instead of producing clips for social media, I'm not that bothered. You don't even need to be playing the same game (or any game at all, for that matter) to be in a lobby with others. It's easy to use and the vibes are good, which is what's really important. However, you will need to pay for Nintendo Switch Online, which costs $20 a year.\nThe Dock\nLike the console itself, Nintendo didn't stray too far from the design of the original Switch's dock for its successor. You still get a plastic shell with more rounded corners and a slot that the Switch 2 can fit inside. There area handful of ports in the back (covered by a removable plate) for power (via the included USB-C cable and adapter), HDMI and wired internet. The big upgrade is that now there's a fan inside to help keep the console cool and provide better sustained performance. Thankfully, it's relatively quiet, so you won't have to deal with an annoying hum distracting you from your games.\nThe awkward thing about the Switch 2's dock is that it has one less USB port than before. Aside from the single USB-C connection in back for power, there are only two USB-A jacks on the side. This means if you want to connect accessories like the camera, which only comes with an included USB-C cable, you'll either have to get an adapter or plug it directly into the Switch 2 via its exposed port on top. Unfortunately, that will force you to disconnect the camera every time you undock the console, which is just kind of clunky. I wish Nintendo had made every USB port a Type-C connection, or at the very least included more than one.\nBattery Life\nThe Switch 2 features a 5,220 mAh battery, which according to Nintendo should provide between 2 and 6.5 hours of runtime on a single charge. However, the console's longevity also greatly depends on the game you're playing along with other factors such as screen brightness and background downloads.\nTo help provide a slightly better picture of the Switch 2's power efficiency, I played a handful of titles starting at 100 percent battery and kept going until the console was dead with the screen set to max brightness (around 400 nits) and auto-brightness disabled. These settings are meant to provide a consistent but also conservative look at the console's runtime, as it's very possible to increase longevity by doing things like lowering brightness.\nIn Mario Kart World, the Switch 2 lasted two hours and 23 minutes, which is on the lower end of Nintendo's official estimate. Meanwhile, in the NS2 edition of Legend of Zelda: Breath of the Wild, the console fared a bit better with a time of 2:56. That said, the game with the best battery life I've tested so far is Puyo Puyo Tetris 2S at four hours and 15 minutes, which shouldn't be a big surprise as it's a port of a decade-old 2D title.\nFor some folks, these numbers might be disappointing. I certainly would love an extra 30 to 60 minutes of battery life, but these stats are generally in line or slightly better than what we get from rivals like the Steam Deck and ROG Ally X. And remember, when compared to practically all of its PC-based competition, the Switch 2 remains a much sleeker device.\nAnother helpful battery-related improvement is the addition of a charging limit, which allows the Switch 2 to automatically stop at a certain percentage to help maintain the power pack's longevity. But my favorite little detail is now the Switch 2 will display a small battery icon when you drop it in the dock because the screen peeks out a bit, so you always know for sure when it's charging.\nCost considerations\nAt $450 for the console alone or $500 for the bundle with Mario Kart World, the Switch 2 is priced significantly higher than the original, which cost $300 at launch (though that increase is closer to $50 when adjusted for inflation). However, when you include the price of accessories and games, the total adoption cost for a Switch 2 can be substantially higher. I purchased a standalone console along with physical versions of Mario Kart World and Legend of Zelda: Breath of the Wild (NS2 Edition) and one Pro Controller for $745.75. But after you tack on another $50 for one year of Nintendo Switch Online + Expansion, my grand total was just shy of $800.\nEveryone has different opinions on what they consider disposable income, but that's still a lot of money to spend on a new console and two games. Here's hoping this breakdown helps people think about how the Switch 2 will impact their budget.\nImportant notes\nThe Switch 2 requires a day one patch in order to go online or even play some games. You'll normally get this automatically by following the setup guide when you first turn on the system. However, if you skip the section where it asks you to connect to Wi-Fi, you may need to manually download the patch later by hitting the check for updates button in system settings the next time you connect to the internet.\nThe Switch 2 only supports microSD Express cards, which are not interchangeable with standard microSD or microSD XC cards. When buying a microSD Express card, you'll want to make sure it has an EX or EXPRESS label printed on the card itself.\nIn addition to Joy-Con, a Joy-Con Grip, two Joy-Con straps and the console itself, the Switch 2 comes with an HDMI cable and a 60-watt power adapter with a detachable USB-C cord.\nSome units may suffer from an inaccurate charging indicator, which can be addressed with these instructions from Nintendo.\nParents can monitor and approve the people your kids can talk to when using Game Chat via Nintendo's Parental Controls app.\nNintendo says the Switch 2's Joy-Con use an all-new module for its analog sticks. As they aren't Hall effect modules, it's too early to tell how well they will resist drifting.\nOnly the Switch 2's bottom USB-C port supports video out.\nWrap-up\nThe old adage goes ‘if it ain't broke, don't fix it.’ But for the Switch 2, Nintendo did something even smarter. It maintained the console's hybrid design and just made everything better. Its screen is bigger and brighter. Buttons are larger and the magnetic Joy-Con are so much easier to snap on and off. Even features such as the kickstand and expandable storage feel like they've gotten substantial upgrades thanks to a wider range of motion and support for faster microSD Express cards. I also really appreciate the addition of a second USB-C port.\nThe Switch 2 has everything that made the original so great, but now there's more of it to enjoy. Granted, Nintendo's latest console commands a higher price, but as the successor to the iconic system that revived handheld gaming, this thing is worth it."
    },
    {
      "url": "https://www.engadget.com/2020-03-16-animal-crossing-new-horizons-review-switch.html",
      "text": "‘Animal Crossing: New Horizons’ is the island escape we all need today\nWhat better way to cancel the apocalypse?\nHow do you review something like Animal Crossing: New Horizons? It's not like most games: There's no plot, no leveling up and no bosses. You can never beat Animal Crossing -- and, conversely, you can't lose. Instead, you play a bit every day, shaping your adorable house and village into the most idyllic environment possible. That's a template the series has honed since its Nintendo 64 debut, and with New Horizons on the Switch, which lands on March 20th, it's evolved into a truly meditative and relaxing escape from reality. And honestly, that's just what we need today, as our society reshapes itself around the specter of a global pandemic.\nFor the uninitiated, every Animal Crossing game starts the same way: You play as a human who moves to a small town filled with anthropomorphic animals. An entrepreneurial raccoon named Tom Nook helps you find a home, while also burdening you with a hefty mortgage. And then you're off to do whatever you want: fish, catch bugs, chat with your neighbors. New Horizons changes things up a bit by offering a lot more customization from the beginning.\nInstead of being placed right into a village, you start off at a ticket counter, where the adorable Timmy and Tommy Nook start planning your upcoming getaway to a deserted island. You can choose between a spot in the northern or southern hemispheres, which determines the weather, as well as four different island layouts. (I stuck with a northern island to sync up the weather with New York City.) And, this being an international trip, you'll need to show your passport photo, which doubles as a character generator. You can shape your hair and face to your liking, but best of all, you can finally customize your character's skin tone. Previously, you had to go through an annoying tanning process for a darker complexion.\nThat extra bit of representation goes a long way. I was immediately more connected with my brown-skinned character (sporting blazing white anime hair, because that's how I really see myself), than I was with the simple models from Animal Crossing: New Leaf on the 3DS. As I picked the ideal spot for my tent -- with a river to the north and the ocean to my west -- I visualized the sort of area I'd love to escape to in real life, away from anxiety-inducing headlines and reminders of the fragility of modern society.\nA quick walk around my new home island \"Lostia\" (I never said I was very original) made it instantly clear how much of an upgrade New Horizons is. Every new entry in the series is typically an evolutionary leap, thanks to hardware advances. But this time around, it's even more charming than I expected: the jagged edges and simple textures from the 3DS have been replaced with smooth 3D models and luscious colors. Every area on the island -- from forests rustling in the wind to wave-lapped shores -- is painstakingly detailed and alive, responding to the weather and time of day. Playing New Horizons is like jumping into an interactive storybook.\nAnd given this is a game where you're mainly exploring the world and interacting with other villagers, Nintendo has paid close attention to every character model. Tom Nook and his raccoon kin have never looked cuter and more expressive; the sea-faring seagull Gulliver's shiny beak glistens in the sun every time he washes ashore. Every character is unique and expressive, which makes it particularly thrilling whenever you run into visitors and new community members. That level of detail carries over to your character -- your hair styles and outfits are endlessly creative, and you'll never tire of finding hip new accessories.\nNew Horizons is more than just a graphical upgrade too: Every sound element is crafted to be as chill as possible. The game's main theme, a gentle tune led by a soft trumpet and ukulele melody, captures the mood perfectly. It evokes nostalgia while hinting at wonder and adventure ahead. It's like something you'd find in a slice of life anime series, where there's often very little plot, just characters going about their lives.\nBeyond the music, the game's sound design deftly bottles the experience of living on a remote island to ASMR levels of brain-tingling joy. I found myself reveling in the moments where I could put on a pair of great headphones and listen to the wind blowing through the trees, or the sounds of insects on a quiet chilly night. I'll probably never live by the seashore, but I'll always be able to fish by the calm seaside in New Horizons. It's as if the developers tried to bottle up every sound of nature that relaxes humans -- just in time for us to be locked in our homes as we self-quarantine against coronavirus.\nOnce your camp is set up, you'll get a \"Nook Phone\" from Tom Nook that serves as your main progress hub. (Of course he's a tech CEO now too.) It'll help you keep track of DIY crafting recipes, which you can use at workbenches to build new items; earn Nook Miles, a currency based entirely on things you do; design custom items; and even get rescued if you manage to get stuck somewhere on the island. There's also a camera mode for capturing the perfect in-game selfie.\nNook, the capitalist monster that he is, doesn't waste time burdening you with a bill. But unlike other Animal Crossing games, you can pay off the cost of your trip through Nook Miles, which you earn quickly early on by doing things like collecting weeds, chatting with your neighbors, and in general being a solid member of the community. You can also use those miles later on to buy specialty equipment and more crafting skills. It didn't take me long to pay off Nook, but then he dangled another carrot in front of my world-weary millennial face. A home of my very own! How could I say no?\nAnd so began my frenemy relationship with Nook, someone you always end up owing in Animal Crossing. He means well, but you'll quickly notice you end up doing most of his grunt work. Compared to the real world, though, he's an angel. Nook may charge you an eye-popping amount of bells to upgrade your flimsy tent into a genuine home with a roof, but there's no interest on your debt, and no forced payment schedule. You just need to explore your town, earn some cash, and pay it off whenever you can. That's infinitely better than dealing with college loans in your thirties and fighting with banks and our insane credit system to own a home.\nDIY crafting, which debuted in the Animal Crossing: Pocket Camp mobile game, also changes up the flow of the series for the better. Instead of just earning money to buy furniture, clothes and other accessories, you can build them on your own, assuming you have the proper materials. That makes chopping wood, mining for stone and metal and collecting cherries far more rewarding than previous titles.\nUnfortunately, I haven't been able to try the local or online multiplayer portions of the game, but I'm definitely looking forward to sharing my island experience with friends down the line. And if you share your Switch, you better get used to living on a single island with everyone else in your household. That seems like a particularly draconian move by Nintendo -- the only way to get multiple islands is to buy more copies of the game, or share a single copy across multiple consoles. I also didn't get to test the New Horizons features in the Switch Online App for smartphones. It's your gateway to voice chatting with friends, and you'll also be able to scan QR codes for unique items from older Animal Crossing games.\nAfter diving into New Horizons for about 12 hours, my island utopia has finally started to take shape. There's an impressively large museum to display the fossils and animals I've collected. I helped construct a thriving store run by the Nook kids. And my house is shaping up into quite the bachelor pad, with an expensive stereo, a grown-up reclaimed wood bed and a microphone for my dreams of in-game podcasting. More so than any Animal Crossing before it, New Horizons has become a calming ritual for me. I look forward to checking on my island every morning, greeting newcomers, and taking another look every night to sell items before the shop closes.\nIt may seem a bit frivolous, but all of the time I spent in the game was time spent avoiding political fights on Twitter, news about how we're ill-equipped to fight the coronavirus, and fretting about the fate of our civilization. Every moment spent in New Horizons is a moment I can breathe a bit easier, which feels like a miracle today.\nIf you buy something through a link in this article, we may earn commission."
    }
  ],
  "argos_summary": "Nintendo has filed patents for new accessories for the Switch 2, including a Playdate-style crank and a clickable wheel, which could enhance gameplay by adding rotational movement tracking. These accessories aim to expand the Joy-Con 2's capabilities, potentially benefiting games like fishing simulations. While these patents do not guarantee production, they suggest Nintendo's interest in innovative and quirky accessories reminiscent of the Wii era. The Switch 2 itself features improved hardware, including a larger screen and enhanced performance, while maintaining backward compatibility with original Switch titles.",
  "argos_id": "Q4CZFU527"
}