{
  "url": "https://www.pymnts.com/cryptocurrency/2025/this-week-in-stablecoins-replacing-financial-plumbing-not-dollars/",
  "authorsByline": "PYMNTS",
  "articleId": "e4f8b9e019104ca9b9f0fbaed32933b0",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2022/06/stablecoins-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T20:40:32+00:00",
  "addDate": "2025-08-08T20:49:43.019162+00:00",
  "refreshDate": "2025-08-08T20:49:43.019165+00:00",
  "score": 1.0,
  "title": "This Week in Stablecoins: Replacing Financial Plumbing, Not Dollars",
  "description": "Stablecoins would rather that the traditional financial sector forgot about the last decade of crypto. While the industry’s Wild West growth pains during",
  "content": "Stablecoins would rather that the traditional financial sector forgot about the last decade of crypto.\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\nWhile the industry’s Wild West growth pains during its first dozen years of existence were defined by volatility, scams and regulatory standoffs, stablecoin proponents are eyeing a future where the next chapter of blockchain-based finance may be characterized by digital assets embedded invisibly into payment flows, settling trades, paying suppliers, moving remittances, all without end users needing to know or care about the underlying technology.\n\nStill, the bullish case for stablecoins is tempered by unresolved challenges. Cybersecurity risks are inherent in blockchain systems. Regulatory arbitrage where issuers shop for the most lenient jurisdiction could create uneven playing fields. Liquidity crises could emerge if stablecoin redemptions spike during market stress.\n\nThere is also the question of interoperability. Today’s stablecoin ecosystem is fragmented across multiple blockchains, with varying technical standards and levels of security. For global adoption, some level of harmonization will be needed, whether through technical protocols, industry standards or regulatory mandates.\n\nYet the sector’s momentum, measured across this week’s headlines alone, suggests that stablecoins are not just waiting around to become a core component of global transaction flows. Instead, they’re partnering, building and plugging themselves into traditional finance, with the goal of reshaping not just how money moves but the store of value itself.\n\nRead more: The Ether Machine Makes Billion-Dollar Bet on – Guess What – Ethereum\n\nRecent stablecoin marketplace moves aren’t about replacing the dollar or euro, but replacing the slow, costly plumbing behind them, particularly for cross-border and B2B flows.\n\nOn Thursday (Aug. 7), Corpay, a stalwart in corporate payment services, announced that it had teamed with Circle to expand global stablecoin usage. Their agreement will integrate Circle’s USDC and EURC directly into Corpay’s cross-border payments system, which serves more than 80 countries. Businesses using Corpay’s commercial cards — fleet, purchasing and travel — will be able to fund accounts with stablecoins and settle transactions in local currencies without going through traditional bank intermediaries.\n\nCorpay says it will offer built-in digital wallets, programmable APIs for treasury operations and instant settlement outside of banking hours. For Circle, which has spent years courting institutional adoption, the deal is validation of its enterprise-first approach. USDC’s market share has been under pressure from competitors, but Circle has leaned into transparency, regulated reserves and partnerships with companies like Visa, Stripe and now Corpay.\n\nWhile Corpay and Circle are building B2B connections, Ripple is buying global scale. Its recent $200 million acquisition of Rail, expected to close in the fourth quarter, gives Ripple a direct foothold in one of the fastest-growing segments of the payments industry. Rail’s platform already handles roughly 10% of global B2B stablecoin flows, offering corporate clients virtual accounts, automated reconciliation, and integration with enterprise resource planning software.\n\nFor Ripple, the move is partly about diversification. Once known mainly for its XRP token and its protracted legal battle with the SEC, the company has repositioned as a cross-border payments network that can work with multiple digital assets. Rail’s infrastructure gives it reach into a customer base already transacting in stablecoins daily, and owning a platform like Rail lets Ripple compete not just on currency issuance or liquidity provision, but on the full stack of enterprise payment services.\n\nRead more: This Week in Stablecoins: Building Next-Gen Rails for Enterprise Finance\n\nOver the past two years, stablecoins have grown from a $140 billion to a $220 billion asset class, with USDC, Tether’s USDT and PayPal USD dominating issuance. But adoption has been slowed by regulatory uncertainty — especially in the U.S.\n\nBut all that is changing, with the U.S. Securities and Exchange Commission (SEC) penning an opinion that USD-pegged stablecoins meeting strict standards such as 1:1 fiat reserves, clear redemption rights, and no investment-return features would be treated as cash equivalents rather than securities.\n\nThat means such stablecoins could be held on balance sheets like cash, used in corporate payments without securities compliance overhead, and integrated into traditional financial infrastructure with fewer legal uncertainties. For banks, payment processors and FinTech firms, the decision opened a door long feared to be bolted shut.\n\nAnd if there were doubts about whether large incumbents are ready to embrace stablecoins, the latest corporate earnings season offered a clear answer. Visa, PayPal, SoFi, Coinbase and Robinhood all highlighted blockchain-settled currencies, particularly for cross-border and B2B use, as a key growth vector.\n\nStill, not all recent stablecoin news has been celebratory. Also on Aug. 7, Paxos announced it had reached a $48.5 million settlement with the New York Department of Financial Services over anti-money-laundering and due-diligence deficiencies tied to its relationship with Binance.\n\nThe agreement includes a $26.5 million fine and $22 million earmarked for compliance improvements. The settlement is a reminder that while regulators may be warming to stablecoins, they expect robust oversight and controls from issuers.",
  "medium": "Article",
  "links": [
    "https://www.pymnts.com/cryptocurrency/2025/sec-guidance-marks-turning-point-everyday-stablecoin-usage/",
    "https://www.pymnts.com/acquisitions/2025/ripple-pay-200-million-dollars-stablecoin-payment-platform-rail/",
    "https://www.pymnts.com/cryptocurrency/2025/the-ether-machine-makes-billion-dollar-bet-on-guess-what-ethereum/",
    "https://www.pymnts.com/cryptocurrency/2025/this-week-stablecoins-building-next-generation-rails-enterprise-finance/",
    "https://www.corpay.com/",
    "https://www.pymnts.com/cryptocurrency/2025/paxos-reaches-48-million-dollar-settlement-with-new-york-over-compliance-failings/",
    "https://www.pymnts.com/news/b2b-payments/2025/corpay-teams-with-circle-to-expand-stablecoin-payments/",
    "https://www.pymnts.com/cryptocurrency/2025/q2-earnings-show-focus-cross-border-stablecoin-opportunity/",
    "https://circle.so/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "global B2B stablecoin flows",
      "weight": 0.08401319
    },
    {
      "name": "stablecoin redemptions",
      "weight": 0.0821402
    },
    {
      "name": "such stablecoins",
      "weight": 0.08100248
    },
    {
      "name": "stablecoins",
      "weight": 0.08068102
    },
    {
      "name": "global stablecoin usage",
      "weight": 0.08065721
    },
    {
      "name": "Recent stablecoin marketplace moves",
      "weight": 0.07514185
    },
    {
      "name": "corporate payments",
      "weight": 0.06561137
    },
    {
      "name": "payment flows",
      "weight": 0.065489545
    },
    {
      "name": "enterprise payment services",
      "weight": 0.06518322
    },
    {
      "name": "corporate payment services",
      "weight": 0.064609185
    }
  ],
  "topics": [
    {
      "name": "Cryptocurrency"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.97705078125
    }
  ],
  "sentiment": {
    "positive": 0.29956055,
    "negative": 0.18603516,
    "neutral": 0.51416016
  },
  "summary": "Stablecoins are being hailed as a future where digital assets are embedded into payment flows without end users needing to know about the underlying technology. However, there are challenges in the industry, including cyber security risks and potential liquidity crises if liquidity spikes during market stress. Companies like Corpay and Circle are partnering to expand global stablecoin usage, integrating Circle's USDC and EURC directly into Corpay’s cross-border payments system, which serves over 80 countries. Meanwhile, Ripple is acquiring global scale through its $200 million acquisition of Rail, which gives it a foothold in the rapidly growing segment of the payments industry. The move is partly about diversification and aims to make it a cross-broad payments network that can work with multiple digital assets.",
  "shortSummary": "Stablecoins are poised to replace traditional financial plumbing with blockchain-based currencies by integrating features like RBS and Rail into traditional finance, despite challenges of security and interoperability issues.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "17ae899035f44519ae294cd453a7c796",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.pymnts.com/cryptocurrency/2025/the-ether-machine-makes-billion-dollar-bet-on-guess-what-ethereum/",
      "text": "Cryptocurrency has always been about finance and programmability, a concept that traditional players are now beginning to grasp.\nAnd as the financial world inches closer to embracing digital assets, longtime crypto market mainstays like bitcoin (BTC) and Ethereum (ETH) are now finding themselves as the nominal digital assets positioned at the confluence of innovation, scale and legitimacy across regulated capital markets.\nBut while exchange-traded funds (ETFs) can offer a foot in the door to market participants and investors, certain stakeholders are betting instead that the best way to gain exposure is through an actively managed, publicly listed company designed not just to hold these assets, but to grow them.\n“Ethereum isn’t a static asset. It’s programmable infrastructure. Passive ETFs can’t unlock its full potential,” Dave Merin, co-founder and CEO of The Ether Machine, told PYMNTS.\nIn the past week alone, his firm has spent nearly $100 million acquiring more ETH, with plans to deploy a war chest potentially north of $1.5 billion.\n“Everything we’re doing is built to be institutional grade from day one,” Merin said. “No legacy liabilities, no operating distractions — just exposure to the most important digital asset since bitcoin, but done in a way that’s dynamic, thoughtful, and structurally superior.”\nLongtime industry observers may have seen this story before — just in a different asset class. When MicroStrategy’s Michael Saylor turned a publicly traded software company into a bitcoin holding vehicle in 2020, he helped ignite an institutional wave of BTC accumulation. Saylor issued debt, sold equity, and used the proceeds to buy bitcoin, leveraging the capital markets to amplify crypto exposure.\nThe Ether Machine team believes that Ethereum has the potential to be leveraged more actively than bitcoin when managed in a publicly traded treasury structure, resulting in a wide array of financial opportunities through the generation of ETH-denominated yield.\nEthereum Ecosystem Stewardship Through Capital Markets\nThe rise of crypto ETFs in the wake of the SEC’s long-anticipated approval of spot bitcoin ETFs has created an assumption that similar products are inevitable for Ethereum. Merin, however, views the ETF model as ill-suited for ETH, particularly due to the asset’s unique technical and economic mechanics.\n“Most ETFs can’t stake more than 50% of their ETH,” he said. “And in a crisis, that number might need to be even lower. That risk isn’t insurable — it’s structural.”\nEthereum’s proof-of-stake model allows ETH holders to earn yield by staking their tokens to secure the network. But staking comes with constraints. Unstaking ETH is subject to unpredictable delays — sometimes stretching for weeks or months — making liquidity management a challenge. That’s a major problem for ETFs, for example, which need to ensure daily redemptions and rebalancing capabilities.\nIn contrast, The Ether Machine is designed for active yield optimization. It stakes ETH, restakes it through protocols like EigenLayer, and participates in decentralized finance (DeFi) to amplify returns. These strategies, while potentially riskier, offer yields well above what passive ETFs can deliver.\n“We think we can generate 2x the yield of an ETF, conservatively,” Merin said. “And when you layer on things like restaking or engaging in DeFi, we think we can deliver a vastly superior product. Our team knows these protocols intimately. We’re not guessing, we’re building the infrastructure that others will later follow.”\nThe Ethereum Infrastructure Play as Financial Architecture\nThe grander vision here isn’t just about buying and staking ETH. It’s about building the base layer of a new internet. Unlike bitcoin, which serves as digital gold, Ethereum is infrastructure. It’s programmable money, a settlement layer, and a platform for applications. That makes ETH more than a token — it’s the “pristine collateral” of a new financial and computing architecture.\n“We’re underwriting Ethereum’s core infrastructure and using that to drive long-term value,” Merin said. “Even though stablecoins are great for usability, there will always be a special place for ETH in the ecosystem because of its purity — its lack of external dependencies.”\n“Ethereum is the largest proof-of-stake network by a wide margin,” he said. “That scale means more yield opportunities, a broader security moat, and a stronger economic flywheel.”\nThrough its listing (currently trading under ticker DYNX and slated to become EM upon completion of its de-SPAC process), the company offers retail and institutional investors alike exposure to actively managed ETH strategies — without needing to self-custody tokens or navigate DeFi themselves.\n“We’re working with convertible arbitrage funds to create a positive-sum trade,” Merin said. “They monetize volatility, we get capital, and shareholders get more ETH exposure. Everyone wins.”"
    },
    {
      "url": "https://www.pymnts.com/cryptocurrency/2025/this-week-stablecoins-building-next-generation-rails-enterprise-finance/",
      "text": "A growing cohort of financial leaders, from Fortune 500 treasury desks to FinTech integrators, is moving stablecoins from theory to operational pipelines. The shift is less about speculative upside and more about plumbing — digitizing conventional rails with programmable, fiat-pegged settlements that reduce cost, increase speed and build transparency across borders.\nThis transition is being pushed forward at the highest federal level in the United States.\nAs this week’s PYMNTS coverage underscores, what was once dismissed in the early days as a blockchain gimmick is being reconsidered by chief financial officers, integrated by banks, and redefined by regulators.\nRead also: This Week in Stablecoins: Wall Street Eyes Federally Approved Blockchain Rails\nThe Great Stablecoin Shift From Curiosity to Critical Infrastructure\nConsumer uptake of stablecoins remains modest, with point-of-sale usage sitting at barely a rounding error as few shoppers request Tether or USDC at checkout. However, the enterprise side tells a different story.\nStablecoins are gaining momentum in B2B workflows, like cross-border payroll, supplier payments, multicurrency settlement and internal fund movement. These are not speculative flows; they’re operational cash movements traditionally routed through banks, clearinghouses and SWIFT.\nThis isn’t necessarily a disruption narrative anymore, but the rise of stablecoins is being viewed by institutional finance teams as an element of their digitization story. Stablecoins are poised to one day potentially do to payments what cloud computing did to IT infrastructure, if you listen to the sector’s proponents.\nThis institutional thaw comes at a time of unprecedented regulatory clarity.\nA Wednesday (July 30) White House report, titled “Strengthening American Leadership in Digital Financial Technology,” placed stablecoins squarely in the national strategy for maintaining the dollar’s global dominance in the age of tokenized finance. Framed not as crypto but as digital extensions of sovereign currency, stablecoins are being cast as vital for cross-border capital mobility and economic diplomacy.\nAt the same time, Securities and Exchange Commission Chairman Paul S. Atkins announced Thursday (July 31) the launch of “Project Crypto,” an SEC-wide initiative to modernize securities rules and regulations to enable U.S. financial markets to move on-chain.\nIn this context, the policy stance isn’t about permissiveness. It’s about infrastructure. If stablecoins are backed, compliant and transparent, they’re not a crypto problem; they’re a payments solution.\nSee also: 4 Questions CFOs Need to Ask as Wall Street Embraces Stablecoins\nThe Tools Finally Exist for Enterprise Adoption\nWith policy clarity comes platform readiness. Startups and FinTechs are racing to meet enterprise demands, moving beyond wallet apps to ERP integrations and treasury-grade controls.\nVisa announced Thursday it is now integrating stablecoin support across multiple layers of its network. The message is that tokens and traditional card rails can coexist.\nMeanwhile, JPMorgan, in collaboration with Coinbase, said Wednesday that it is offering bank-grade infrastructure for retail and institutional crypto use, eliminating reliance on decentralized exchanges and reducing compliance risk. The move aligns with JPMorgan’s long-term investment in blockchain via its Onyx division, which also handles tokenized deposits.\nCircle, issuer of USDC, said Monday (July 28) that it inked deals with FIS and multiple custodial banks to onboard more corporate and institutional clients, particularly for high-volume use cases like foreign exchange (FX) hedging, global payroll and liquidity pooling.\nStable said Thursday that it closed a $28 million seed funding round to build tools specifically aimed at commercial stablecoin payments. Early partners include multinational firms in logistics, B2B SaaS, and pharmaceuticals — all industries where speed and FX transparency are mission-critical.\nStable Sea CEO Tanner Taddeo told PYMNTS in an interview published Thursday that stablecoins in enterprise finance promise near-instant settlement, lower costs and global reach.\nAgainst this backdrop, PYMNTS has tracked key trends that suggest an uptick in corporate appetite for cryptocurrency as CFOs and treasury teams eye stablecoins and crypto investments as a part of a digital strategy for their organizations.\n“Treasury has always been the last to modernize,” Trovata CEO Brett Turner told PYMNTS in an interview published Thursday. “Everything around it is digital — supply chains, CRMs, ERP systems — but cash management is stuck in the past. Stablecoins are kind of where the puck is going … but it’s still very early days.”\nStablecoins also caught the attention of executives during earnings season, with Coinbase, Visa, and more C-suite leadership touting their benefits."
    },
    {
      "url": "https://www.pymnts.com/news/b2b-payments/2025/corpay-teams-with-circle-to-expand-stablecoin-payments/",
      "text": "The collaboration involves Corpay working with a Circle subsidiary to embed Circle’s USDC stablecoin into Corpay’s cross-border pay-in and pay-out rails, the companies announced in a Thursday (Aug. 7) news release.\nThis will let companies “access blockchain’s 24/7 settlement and programmability,” the release added, while also offering integrated access to USDC through Corpay’s platform.\nBusinesses can also fund transactions in USDC (and where available, EURC) around the clock, with payouts in local currencies across more than 80 countries. And Corpay is working to allow its commercial card products — including fleet, purchasing and travel cards — to draw directly from USDC balances, the companies added.\n“By working with Circle and adding USDC to our funding and disbursement capabilities, we’re giving our clients a new real-time option that complements the payment networks they already trust,” Mark Frey, group president at Corpay Cross-Border Solutions, said in the release.\n“This collaboration will unlock programmable controls and 24/7 liquidity without changing the way they transact today.”\nKash Razzaghi, Circle’s chief business officer, added that the partnership, in embedding USDC into Corpay’s network, is “delivering enterprise-grade stablecoin utility across card payments and cross-border FX, all while upholding the compliance and reliability standards that global businesses demand.”\nThe partnership is happening at a time when, as noted here earlier this week, stablecoins are “reshaping cross-border payments,” a trend illustrated in earnings call commentary from companies as diverse as SoFi, Coinbase, Visa, PayPal and Robinhood.\nFor the better part of the last decade, that report added, cryptocurrency and traditional finance operated in parallel.\nStablecoins, which are blockchain-based tokens pegged to fiat currencies like the dollar, emerged in the cryptocurrency market as tools for liquidity and arbitrage. At the same time, banks and payment networks kept spending to modernize their legacy payment rails, with not much overlap between the two spheres.\n“That separation is now collapsing,” PYMNTS wrote. “Cross-border payments represent a sprawling and inefficient market, with most transactions consisting of B2B flows. The inefficiencies in this system include multi-day settlement times, high fees, limited transparency and heavy reliance on intermediaries.”\nThe report added that the digital currencies provide a technical alternative that can alleviate these pain points, thanks to “instantly settled transactions, lower costs, programmable transfers and global accessibility.”\nFor all PYMNTS B2B coverage, subscribe to the daily B2B Newsletter."
    },
    {
      "url": "https://www.pymnts.com/acquisitions/2025/ripple-pay-200-million-dollars-stablecoin-payment-platform-rail/",
      "text": "The deal is designed to strengthen Ripple’s standing in digital asset payments infrastructure, according to a Thursday (Aug. 7) news release.\n“Stablecoins are quickly becoming a cornerstone of modern finance, and with Rail, we are uniquely positioned to drive the next phase of innovation and adoption of stablecoins and blockchain in global payments,” Ripple President Monica Long said in the release. “Ripple has one of the most widely used digital asset payment networks in the world, and this acquisition underscores our commitment to helping our global customer base to move money wherever and whenever they need.”\nRipple’s Ripple Payments offers “a broad payout network,” digital asset liquidity, and more than 60 licenses to manage customers’ payment flows, the release said. Rail will add to these capabilities with virtual accounts and automated back-office infrastructure.\n“Over the last four years, Rail built the fastest way to settle business payments internationally using stablecoins, and in 2025, Rail is forecasted to process over 10% of the $36 billion global B2B stablecoin payments,” Rail CEO Bhani Kohli said in the release. “Ripple shares our vision, and together, we’re excited to bring our innovation to the millions of businesses that move money internationally.”\nRipple has invested more than $3 billion to date in “acquisitions and strategic opportunities,” and is committed to expanding via mergers and acquisitions (M&A), according to the release. The Rail deal is expected to close in the fourth quarter of this year.\nStablecoins are evolving “from cryptocurrency novelty to enterprise-grade payment infrastructure,” PYMNTS wrote last week.\n“The shift is less about speculative upside and more about plumbing — digitizing conventional rails with programmable, fiat-pegged settlements that reduce cost, increase speed and build transparency across borders,” the report said.\nThe change is being championed at the federal level in the United States, with the Securities and Exchange Commission releasing new guidance on how dollar-pegged stablecoins can function as regulated, fiat-linked payment tools, so long as they meet strict criteria."
    },
    {
      "url": "https://www.pymnts.com/cryptocurrency/2025/paxos-reaches-48-million-dollar-settlement-with-new-york-over-compliance-failings/",
      "text": "The settlement is related to the digital currency company’s failure to conduct proper due diligence into cryptocurrency exchange Binance, its former partner, according to a Thursday (Aug. 7) press release.\nNYDFS also found “systemic failures” in Paxos’ anti-money laundering (AML) program, the release said. In addition to a $26.5 million penalty due to those deficiencies, Paxos will invest $22 million into its compliance program.\n“Regulated entities must maintain appropriate risk management frameworks that correspond to their business risks, which includes relationships with business partners and third-party vendors,” NYDFS Superintendent Adrienne A. Harris said in the release. “The department continues taking significant steps to ensure accountability, in turn protecting consumers and safeguarding the integrity of the financial system.”\nPaxos did not reply to PYMNTS’ request for comment.\nPaxos had an arrangement with Binance to market and distribute Binance’s dollar-pegged stablecoin, according to the release. An agreement with NYDFS required Paxos to conduct regular due diligence of its partner. However, a NYDFS investigation found the company “did not have appropriate controls in place to effectively monitor for significant illicit activity occurring at or through Binance…”\n“Notably, Binance’s lax geofencing restrictions enabled U.S. users to access an unregulated exchange,” the release said.\nThe investigation found that, between 2017 and 2022, $1.6 billion in transactions flowed to or from the Binance platform involving fraudsters, per the release. Binance processed transactions to and from entities already sanctioned by the United States.\nDefects in the Paxos transaction monitoring system kept the company from spotting money laundering, the release said. The company also lacked proper guidelines for handling investigations following a law enforcement request, further keeping it from identifying fraudsters on its platform.\nNYDFS was the first regulator in the world to call into question Binance’s safety and soundness in 2023, according to the release. Binance was later fined $4.3 billion by federal regulators, part of a larger crypto crackdown that has since been scaled back.\nUnder President Donald Trump, the government’s approach to crypto enforcement has changed and narrowed, with the Department of Justice now focusing on crypto cases tied to terrorism, drug trafficking and organized crime."
    },
    {
      "url": "https://www.pymnts.com/cryptocurrency/2025/q2-earnings-show-focus-cross-border-stablecoin-opportunity/",
      "text": "For much of the past decade, cryptocurrency and traditional finance operated in parallel. Stablecoins, blockchain-based tokens pegged to fiat currencies, emerged in the cryptocurrency market as tools for liquidity and arbitrage. At the same time, banks and payment networks continued investing in modernizing legacy rails, with limited overlap between the two spheres.\nThat separation is now collapsing.\nCross-border payments represent a sprawling and inefficient market, with most transactions consisting of B2B flows. The inefficiencies in this system include multi-day settlement times, high fees, limited transparency and heavy reliance on intermediaries. Stablecoins offer a technical alternative capable of addressing these pain points — instantly settled transactions, lower costs, programmable transfers and global accessibility.\nAs executive commentary from the second quarter reveals, stablecoins are being embedded into the existing financial system not as substitutes for fiat money, but as digital settlement layers that can operate across borders more efficiently than traditional networks.\nThe distinction matters. This isn’t a wholesale replacement of global finance; it’s a technological competition around the means of settlement, with stablecoins offering a leaner architecture for moving money internationally.\nRead more: Are Closed-Loop Financial Instruments the Future of Institutional Stablecoins?\nHow Stablecoins Are Redrawing Industry Lines\nTaken at face value, the convergence of clear regulatory policy in the United States, improving tech stacks and shifting market incentives is triggering a network effect when it comes to the apparent stablecoin opportunity.\nThe new competitive dynamic is forming along three primary vectors, per earnings commentary. First, incumbent payment networks (e.g., Visa and Mastercard) are expanding their infrastructure to include stablecoin capabilities. Second, FinTech platforms (e.g., PayPal, SoFi and Robinhood) are creating stablecoin-native products or issuing their own tokens.\n“We are not just a bank, and not just a tech company — we’re a little bit of both,” SoFi CEO Anthony Noto said during the firm’s earnings call Tuesday (July 29), teasing plans including stablecoin issuance.\nWith a federal bank license in hand and new regulations under the GENIUS Act opening the door, SoFi said it has a structural advantage over pure-play crypto platforms. Think Western Union meets decentralized finance (DeFi), executives stressed.\nThird, crypto-native firms, as well as traditional banks, are meeting the moment by investing in the infrastructure layer — custody, liquidity and compliance — that others will rely on.\n“We see payments as the next big use case in crypto and believe that the majority of all payments in the economy will eventually run on stablecoin rails,” Coinbase CEO and co-founder Brian Armstrong said Thursday (July 31).\n“One of the biggest areas we are focused on is B2B payments,” he added. “We think cross-border stablecoin payments is a $40 trillion opportunity, and B2B is 75% of that. It’s better if the sender and recipient both want to use the same stablecoin and actually the same underlying payment rail.”\nSee more: White House Report Says Stablecoins Will Keep Dollar Dominant\nCapturing the Cross-Border Stablecoin Market\nDespite stablecoins representing less than 1% of global cross-border payment volume, infrastructure is improving, regulatory clarity is expanding, and institutional interest is accelerating.\nThe market is already being divvied up.\nVisa announced Thursday that it is now integrating stablecoin support across multiple layers of its network. The message is that tokens and traditional card rails can coexist.\n“We are also enabling cross-border money movement capabilities for P2P and B2B in certain emerging markets, and we are piloting and partnering with stablecoin payments companies who specialize in these markets as we build out our stablecoin treasury stack for settlement and money movement flows,” Visa CEO Ryan McInerney said during his firm’s earnings call Tuesday.\n“Additionally, we are also helping banks issue their own stablecoins and realize the benefits of programmable money…,” he added.\nVisa has been testing a series of corridors and putting stablecoins to work directly versus fiat currency money movement options, McInerney said during the call. The company has a “good sense on which corridors we can provide faster money movement, cheaper money movement.”\nPayPal CEO Alex Chriss framed his company’s dollar-backed stablecoin, PYUSD, as a tool to cut cross-border fees and delays.\n“Traditional payment methods can be prohibitively expensive and time-consuming,” he said Tuesday. “PYUSD delivers a stable, reliable and cost-effective alternative.”\nPayPal added yield rewards for holding the coin, expanded issuance to the Stellar and Arbitrum blockchains and said PYUSD would power PayPal World transactions that settle in local currency on the back end.\nStable Sea CEO Tanner Taddeo and Trovata CEO Brett Turner told PYMNTS in an interview published Thursday that stablecoins have an appeal within corporate finance functions, offering the promise of near-instant settlement, reduced costs and worldwide reach.\n“Moving $10 [million] to $30 million across borders into exotic corridors typically takes three to five business days,” Taddeo said. “With stablecoins, it can settle in four to eight hours.”\nStill, not everyone is convinced.\nRobinhood Chairman and CEO Vlad Tenev said during the company’s earnings call Wednesday (July 30) that “stablecoins among retail have been largely an ex-U.S. phenomenon. And of course, they’re coming into the U.S., but the U.S. already has the benefit of pretty robust payment and banking systems. I think the real opportunity in the U.S. would be tokenizing assets that were previously inaccessible.”\nFor all PYMNTS B2B coverage, subscribe to the daily B2B Newsletter."
    },
    {
      "url": "https://www.pymnts.com/cryptocurrency/2025/sec-guidance-marks-turning-point-everyday-stablecoin-usage/",
      "text": "All the innovation in the world may ultimately prove useless if it can’t scale.\nFor digital asset like stablecoins, regulatory clarity is key to scalability. The industry knows this, and, increasingly, the U.S. government knows this.\nThat’s why the financial services and payments landscape is being primed for an on-chain change.\nFresh off of the White House’s crypto sector report, “Strengthening American Leadership in Digital Financial Technology,” the U.S. Securities and Exchange Commission (SEC) is now issuing guidance and forming advisory groups to streamline the integration of crypto products into traditional financial ecosystems.\nThe agency’s latest push is the launch of “Project Crypto,” an SEC-wide initiative to modernize securities rules and regulations, as part of which the SEC has issued interim guidelines suggesting that USD-pegged stablecoins could be classified as cash equivalents, contingent on having guaranteed redemption mechanisms.\nBy delineating a narrow set of compliance criteria for “Covered Stablecoins,” the SEC has effectively opened the door for these digital assets to function as regulated, fiat-linked payment instruments. The path forward may conditional and constrained — but for the first time in U.S. commerce, it is potentially navigable.\nRead more: Stablecoin Retail Use Still a Rounding Error as Attention Swings to B2B\nWhat the Guidance Means for Payments Infrastructure\nStablecoins, digital tokens pegged to national currencies like the U.S. dollar, have evolved rapidly since their early use in crypto trading. They now represent a sizable global market and have become, in some regions, essential to cross-border remittances and B2B payments. However, domestic retail adoption has remained limited, particularly across retail use cases.\n“The crypto market cap is $3 trillion, and the stablecoin market cap is $250 billion, meaning it’s less than 10%. If you want to build a payments network, you need to solve the divide so shoppers can walk in and pay with their assets, while merchants receive the payment as stablecoin,” Mesh CEO and Co-founder Bam Azizi told PYMNTS earlier this summer.\nThe SEC guidance, while just the agency’s view and not a true legal policy, has concluded that certain dollar-backed stablecoins, when structured and operated within defined parameters, would likely not be considered securities under the Howey, Reves, or Gary Plastic tests — the primary legal frameworks for evaluating investment contracts and notes.\nThe SEC staff statement defines “Covered Stablecoins” by reference to four key characteristics: purpose, redemption rights, reserve composition and reserve parity.\nFirst, the stablecoin in question must be designed and marketed solely for use in payments, value transmission or as a store of value — not for speculative investment or yield generation. The issuer must also provide holders with enforceable rights to redeem the stablecoin on demand at par (1:1 with USD). These rights must be contractually guaranteed and not subject to issuer discretion.\nThird, the stablecoin must be backed exclusively by U.S. dollar cash and cash equivalents, specifically, insured bank deposits, U.S. Treasury bills or government money market funds. Riskier collateral (e.g., commercial paper, crypto assets, equities) is excluded. And finally, the value of the reserves must meet or exceed the outstanding stablecoin liabilities at all times. Reserves must be held in segregated accounts and subject to regular attestation by a registered public accounting firm.\nThe guidance provides a clear compliance pathway for U.S. payment service providers (PSPs) to adopt stablecoin rails without triggering securities liability.\nSee more: Why Stablecoins Are Stuck at the Acceptance Hurdle\nA Critical Inflection Point for Stablecoin Payments\nIt is important to emphasize that the SEC’s staff statement is non-binding guidance, not a safe harbor or final rule. It represents the views of the Division of Corporation Finance and does not carry the force of law. Still, in practice, such guidance serves as a de facto greenlight for firms that operate within its parameters.\nIt also comes at a time when bank executives “overwhelmingly worry” that large corporations like Amazon and Walmart will bypass new prohibitions on interest-paying stablecoins under the recently enacted GENIUS Act.\nTo support “Covered Stablecoins,” PSPs and merchants may need to make significant investments in back-office infrastructure and legal contracting.\nThe retail sector, from eCommerce platforms to grocery chains, must also adapt. Integrating stablecoins into point-of-sale terminals, accounting software and treasury operations will require middleware or API solutions that can reconcile blockchain-based tokens with existing ERP systems."
    }
  ],
  "argos_summary": "Stablecoins are transitioning from a speculative asset class to critical infrastructure for modern finance, particularly in B2B and cross-border payments. Recent partnerships, such as Corpay's integration of Circle's USDC, highlight their growing role in streamlining payment processes and reducing costs. Regulatory clarity from the SEC is paving the way for stablecoins to be treated as cash equivalents, facilitating their adoption in traditional financial systems. However, challenges like cybersecurity risks, regulatory compliance, and interoperability remain as the sector evolves.",
  "argos_id": "Q5AD9ABG0"
}