{
  "url": "https://thehill.com/newsletters/health-care/5444079-pharma-industry-loses-on-medicare-price-negotiations/",
  "authorsByline": "Alejandra O'Connell-Domenech, Nathaniel Weixel, Joseph Choi",
  "articleId": "f4d4bc8ef772429a823fe2b3398e43ef",
  "source": {
    "domain": "thehill.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://thehill.com/wp-content/uploads/sites/2/2025/06/AP24163002558981-e1750109683189.jpg?w=1280",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T22:05:10+00:00",
  "addDate": "2025-08-08T22:18:34.257617+00:00",
  "refreshDate": "2025-08-08T22:18:34.257621+00:00",
  "score": 1.0,
  "title": "Pharma industry loses on Medicare price negotiations",
  "description": "Click in for more news from The Hill{beacon} Health Care Health Care   The Big Story  Pharma industry loses on Medicare price negotiations   The pharmaceutical industry suffered a s…",
  "content": "Three separate federal courts ruled against the pharmaceutical industry this week, with some cases having previously been dismissed.\n\nA federal judge dismissed the U.S. Chamber of Commerce’s lawsuit challenging Medicare negotiations a year ago, and this ruling was upheld Wednesday by the Sixth Circuit Court of Appeals.\n\nThe suit was dismissed on the basis that some of the plaintiffs — the Dayton Area Chamber of Commerce, the Ohio Chamber of Commerce, and the Michigan Chamber of Commerce — lacked standing to sue.\n\nWhile the appeals court clarified that local and state organizations can sue over federal laws that impact them, it still found that the case was improperly filed. The court agreed that the U.S. Chamber of Commerce had standing to sue, but it would need to file a new lawsuit in a separate venue.\n\nOn Thursday, Medicare negotiation lawsuits challenging the constitutionality of the program were both ruled against.\n\nPhRMA, another trade group, saw its lawsuit dismissed by a Texas federal judge who found that the organization had failed to demonstrate irreparable harm or constitutional violations stemming from Medicare negotiations.\n\nIn Connecticut, the U.S. 2nd Circuit Court of Appeals upheld a decision from last year against the pharmaceutical company Boehringer Ingelheim. Three of the company’s products have been selected for Medicare negotiation.\n\nAs has been the case in other rulings, such as the one in Texas, the court relied on the fact that participation in Medicare is entirely voluntary, meaning companies are not being deprived of certain rights because of the negotiation program.\n\nWhen reached for comment by The Hill, PhRMA spokesperson Sarah Ryan said, “We disagree with the district court’s legal assessment. We continue to believe the IRA’s price-setting provisions are unconstitutional.”\n\nWith compounding losses in appellate courts, the pharmaceutical industry may be gearing up to take Medicare negotiations before the Supreme Court.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Medicare negotiation lawsuits",
      "weight": 0.124305576
    },
    {
      "name": "Medicare price negotiations",
      "weight": 0.11868924
    },
    {
      "name": "Medicare negotiation",
      "weight": 0.11639333
    },
    {
      "name": "Medicare negotiations",
      "weight": 0.11639333
    },
    {
      "name": "appellate courts",
      "weight": 0.0930299
    },
    {
      "name": "Medicare",
      "weight": 0.09077345
    },
    {
      "name": "PhRMA spokesperson Sarah Ryan",
      "weight": 0.079492584
    },
    {
      "name": "federal laws",
      "weight": 0.07443639
    },
    {
      "name": "Commerce",
      "weight": 0.07127817
    },
    {
      "name": "Pharma industry",
      "weight": 0.06835892
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Health/Public Health/Health Policy",
      "score": 0.869140625
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.86328125
    },
    {
      "name": "/Finance/Insurance/Health Insurance",
      "score": 0.84326171875
    },
    {
      "name": "/Health/Medical Facilities & Services/Other",
      "score": 0.650390625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.56884765625
    },
    {
      "name": "/Law & Government/Legal/Legal Services",
      "score": 0.423828125
    },
    {
      "name": "/Law & Government/Legal/Business & Corporate Law",
      "score": 0.393798828125
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.3056640625
    }
  ],
  "sentiment": {
    "positive": 0.06976318,
    "negative": 0.67089844,
    "neutral": 0.2590332
  },
  "summary": "Three federal courts have ruled out the pharmaceutical industry over Medicare price negotiations, with some cases previously dismissed. The U.S. Chamber of Commerce's lawsuit challenging Medicare negotiations was dismissed by the Sixth Circuit Court of Appeals, stating that some plaintiffs lacked standing to sue. However, the appeals court found that the case was improperly filed. PhRMA's lawsuit against the Texas federal judge was dismissed, claiming it failed to demonstrate irreparable harm or constitutional violations related to Medicare negotiations. The 2nd Circuit Court in Connecticut upheld a previous decision against the pharmaceutical company Boehringer Ingelheim, which has been selected for Medicare negotiation. The pharmaceutical industry may be preparing to take Medicare negotiations before the Supreme Court due to these losses.",
  "shortSummary": "Three federal courts ruled against the pharmaceutical industry over Medicare negotiations, citing lack of legal contention and unconstitutional provisions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "aee8b90ad1c24701a9c08f68dbc38818",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "This week, three federal courts ruled against the pharmaceutical industry regarding Medicare negotiations, with a Sixth Circuit Court of Appeals upholding a dismissal of a lawsuit by the U.S. Chamber of Commerce due to lack of standing. Additionally, a Texas federal judge dismissed a lawsuit from PhRMA, citing failure to demonstrate irreparable harm, while the U.S. 2nd Circuit upheld a decision against Boehringer Ingelheim regarding Medicare negotiations. The rulings emphasize that participation in Medicare is voluntary, and the pharmaceutical industry may consider appealing to the Supreme Court.",
  "argos_id": "Q5ZB8DMB6"
}