{
  "url": "https://www.yahoo.com/news/articles/opinion-freakier-friday-ultimate-millennial-195301023.html",
  "authorsByline": "Hannah Holland",
  "articleId": "49ea66eb6fa64b038722b57a0086d0fc",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/75ebfe8b9ee46601b93d6de3b6e7018fbc6a27077149ef48839db013f31349a6/ynews/resizefill_w1200/https://media.zenfs.com/en/msnbc_articles_593/55270228b496e3cb17f24b5f88b47c95",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T19:53:01+00:00",
  "addDate": "2025-08-08T20:08:48.565059+00:00",
  "refreshDate": "2025-08-08T20:08:48.565062+00:00",
  "score": 1.0,
  "title": "'Freakier Friday' is the ultimate millennial retreat",
  "description": "\"Freakier Friday\" brings back Lindsay Lohan, Jamie Lee Curtis and the entire original cast of the 2003 cult classic \"Freaky Friday.\"",
  "content": "Did you grow up with a family movie? That is, a movie you watched again and again as a child, the one choice that all of your siblings would readily agree on, and the one you can extensively quote even now. If you’re a millennial, you likely bought the VHS or accidentally absconded with it from the local video store.\n\nThere are very few qualifications for the family movie: some camp, a little emotional resonance, easy viewing, a nice message, and — this is imperative — absolutely no sex scenes. I grew up with a few. While sharing all of our Holland family movies feels like leaking a state secret, I’ll give you one title: seminal early 2000s box-office success “Freaky Friday,” starring Lindsay Lohan and Jamie Lee Curtis.\n\nOn Friday, the much-anticipated sequel to “Freaky Friday,” called “Freakier Friday,” debuts in theaters across the country. (And yes, it is much anticipated by me, my siblings and my millennial cohort.) Lohan’s comedic timing, her magnetic chemistry with Curtis and the fact that everyone from the original cast has returned have all garnered buzz.\n\nBut frankly, whether “Freakier Friday” is any good by a movie critic’s yardstick is entirely irrelevant. Those who are going to buy a ticket or stream the film are most likely doing so purely based on the power of nostalgic reverence. And that is OK.\n\nFor those somehow unfamiliar, the 2003 “Freaky Friday” centers on successful single mother and therapist Tess Coleman, played by Curtis, and her rebellious rock-'n'-roll-aspiring teenage daughter Anna, played by Lohan. From band practice to Tess’ new fiancé, the two are not understanding one another. After they receive mysterious fortune cookies from a Chinese food restaurant, Anna and Tess wake up the next day to discover they have switched bodies. Then comes an iconic shopping montage, Chad Michael Murray’s Ducati and a vengeful English teacher.\n\n“Freakier Friday” picks up more than two decades later. Anna, alongside very involved Grandmother Tess, is squaring off with an angry teen daughter of her own named Harper. When Anna falls in love with the father of Harper’s nemesis at school, named Lily, it is now three generations that are not seeing eye to eye. This time it is a palm reader that initiates the body swap. And the rest, as they say, is history.\n\nWhile both movies explore the intergenerational push-pull between parent and child and the emotionally complex realities of family, the message behind the body-swapping hijinks is one of empathy. These movies are heartwarming interpretations of the “walk a mile in their shoes” adage.\n\nIt’s very easy to condemn Hollywood’s recent preoccupation with remakes, full franchise reboots and sequels. Relying upon viewer loyalty or, at the very least, brand recognition is a risk-averse and, frankly, lazy way to get a movie made. It also makes an already competitive and shrinking industry even smaller for up-and-coming filmmakers with original ideas. Sometimes, it is ineffectual. Increasingly, the reboot or the sequel fails to carry its audience for another year and another movie and another similar plot. There is fatigue and there is frustration.\n\nThen there is the nostalgia component. Even outside of the silver screen, nostalgia has permeated so much of 2025 culture. It is easy to understand why: We’re wrestling with a deeply fractured American identity, plagued by the remnants of cancel culture and a seemingly universal anxiety. Gen Z is vocal in their longing for the perceived simplicity, stability and comfort of the early 2000s that they never experienced. Millennials, battered by the remnants of hustle culture, embrace nostalgic media as an escape and as a comfort.\n\n“Freakier Friday,” I would argue, exists in the gray because the franchise was rooted in nostalgia from the start. My beloved 2003 “Freaky Friday” is, in fact, the fifth movie adaptation of a 1972 novel of the same name written by Mary Rodgers. The first was a 1976 Golden Globe-nominated version starring Jodie Foster and Barbara Harris. In this way, the “Freaky Friday” franchise does not just exist in early 2000s internet-rooted nostalgia — rather, it’s something shared between five decades and multiple generations.\n\nMoving my own childhood connection to the franchise aside, there is a palpable difference between a sequel that is conceived out of love and appreciation for a loyal audience and one that is a cheap cash grab. I am not so naïvely suggesting that “Freakier Friday” was, you know, made for charity, but what I am pointing to is its deft understanding of why viewers loved the first one so much. This sequel honors the original cast — the humor, the tone and the storyline — while still managing to feel fresh and relevant. In this way, “Freakier Friday” feels like genuine continuation, not exploitation.\n\n“Freakier Friday” may not be pushing cinematic boundaries or mending our broken retrospective culture. But I know this much: It makes for a really great family movie.\n\nThis article was originally published on MSNBC.com",
  "medium": "Article",
  "links": [
    "https://www.goodreads.com/book/show/104711.Freaky_Friday",
    "https://www.glamour.com/story/enough-with-the-sequels?utm_source=chatgpt.com",
    "https://www.latimes.com/entertainment-arts/movies/story/2025-08-07/freakier-friday-review-jamie-lee-curtis-lindsay-lohan-julia-butters-chad-michael-murray",
    "https://www.nytimes.com/2024/01/31/arts/television/gilmore-girls-netflix-rewatch.html",
    "https://www.nbcnews.com/pop-culture/lifestyle/gen-z-nostalgia-millennial-cringe-charm-rcna196957",
    "https://www.theguardian.com/commentisfree/2025/aug/03/nostalgia-is-eating-us-alive-instead-of-building-a-new-world-were-regurgitating-a-past-that-never-existed",
    "https://www.msnbc.com/opinion/msnbc-opinion/freakier-friday-movie-lindsay-lohan-nostalgia-review-rcna223849",
    "https://www.theguardian.com/film/2025/apr/26/los-angeles-film-and-tv-production?utm_source=chatgpt.com",
    "https://www.theaustralian.com.au/life/why-hollywood-film-studios-are-stuck-in-a-creativity-drought/news-story/04b6e12d14ec748c80b86b3f810232d2",
    "https://www.forbes.com/sites/andrewfennell/2025/08/08/burned-out-but-still-broke-why-millennials-are-ditching-hustle-culture-in-2025/"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Freaky Friday",
      "weight": 0.079973504
    },
    {
      "name": "Freakier Friday",
      "weight": 0.07907811
    },
    {
      "name": "Friday",
      "weight": 0.072404824
    },
    {
      "name": "Tess Coleman",
      "weight": 0.053973544
    },
    {
      "name": "full franchise reboots",
      "weight": 0.052777696
    },
    {
      "name": "early 2000s",
      "weight": 0.0509984
    },
    {
      "name": "Tess",
      "weight": 0.050730202
    },
    {
      "name": "cancel culture",
      "weight": 0.05002111
    },
    {
      "name": "hustle culture",
      "weight": 0.0499221
    },
    {
      "name": "family",
      "weight": 0.049381815
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.9677734375
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.53271484375
    }
  ],
  "sentiment": {
    "positive": 0.13122559,
    "negative": 0.4753418,
    "neutral": 0.3930664
  },
  "summary": "The sequel to \"Freaky Friday,\" starring Lindsay Lohan and Jamie Lee Curtis, is set to debut in theaters across the country. The 2003 box-office hit was critically acclaimed, with Lohan playing alongside Curtis and all the original cast returning. However, critics argue that whether the film is good or good is irrelevant. Instead, it is a nostalgic experience that appeals to nostalgic viewers. The franchise was rooted in nostalgia from its start and is not just a cheap grab for a loyal audience. The author argues that while Hollywood's focus on remakes, full franchise reboots and sequels is often criticized as a lazy way to get a movie made, it makes it harder for up-and-coming filmmakers to create original ideas.",
  "shortSummary": "The sequel to 2003’s “Freakier Friday” debuts in theaters, driven by nostalgia and set-tone moments, offering an unlikely escape from societal stresses.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "4be7b39da3474a36bd68d4366fa4fbfb",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.forbes.com/sites/andrewfennell/2025/08/08/burned-out-but-still-broke-why-millennials-are-ditching-hustle-culture-in-2025/",
      "text": "For more than a decade, the message to millennials was clear: work harder, build your side hustle, and you’ll get ahead. But in 2025, that narrative is shifting. Even as the cost of living remains high and wages struggle to keep pace with inflation, many millennials are stepping back from the “always on” hustle culture that defined much of their 20s and early 30s.\nInstead of chasing multiple income streams at the expense of rest, they’re focusing on financial stability and reclaiming their personal time. It’s a quiet rebellion against burnout, and it’s being shaped by both economic reality and changing values.\nThe burnout backlash\nMillennials entered the workforce during or just after the 2008 financial crisis, then navigated a pandemic, housing affordability challenges, and now, a workplace transformed by AI and hybrid models. Side hustles became a lifeline for many, but also a second job on top of already long working hours.\nDeloitte’s 2025 Gen Z and Millennial Survey found that fewer than six in 10 millennials rate their mental well‑being as good or very good, and over a third say they feel stressed or anxious all or most of the time, with many citing their job as a major source of stress. As Forbes notes, the rise of “quiet quitting” and career downshifting reflects a broader backlash to hustle culture, especially among millennials and Gen Z, who are pushing back against burnout in search of balance. Social media, once the place where hustle culture was glamorised, is now filled with posts about “quiet quitting” and career downshifting.\nWhy the hustle isn’t paying off\nWhile some side hustles lead to thriving businesses, many don’t generate meaningful income. In fact, UK data shows that the average side hustler earns around £780/month before costs, and many are working around 10 hours a week, making it difficult to justify the return if you're sacrificing evenings and weekends. When you factor in the extra hours worked - often late at night or on weekends - the return on investment can be low.\nThat reality is prompting some millennials to question whether the financial benefits outweigh the personal cost. Constant work leaves little time for health, relationships, or simply enjoying life, and it’s increasingly clear that burnout can damage long‑term earning potential by forcing career breaks or reducing productivity.\nThe shift to intentional work\nInstead of juggling multiple low‑paying gigs, more millennials are focusing on optimising their main source of income. That can mean negotiating a better salary, moving to a higher‑paying employer, or upskilling to qualify for in‑demand roles.\nThe rise of remote and hybrid work has also created opportunities to seek better‑paid jobs without relocating. According to LinkedIn data from July 2024, roughly 38% of UK job postings were hybrid and about 10% were fully remote, meaning nearly half of opportunities now offer location flexibility, giving candidates more leverage to negotiate pay without relocating.\nRedefining success\nThis cultural shift isn’t about abandoning ambition, it’s about redefining what success looks like. For some, that’s a job that pays enough to cover living costs comfortably without requiring 60‑hour weeks. Forbes’ recent analysis on the “soft life” trend highlights how many are choosing self‑care, flexibility, and job roles that align with their values over relentless ambition. For others, it’s a role that offers flexibility to travel, pursue hobbies, or spend more time with family.\nThe conversation is also being shaped by Gen Z colleagues, who are often more vocal about boundaries and wellbeing at work. Millennials, now in their 30s and 40s, are finding that adopting some of these attitudes can make for a more sustainable career.\nHow millennials are replacing hustle culture\nRather than taking on endless extra work, many millennials are now prioritising pay rises over additional hours. They’re focusing on negotiation skills, market research, and internal promotions to improve earnings without increasing workload. Upskilling has become more strategic, with targeted courses in areas like data analysis, project management, and AI tools offering a better return on investment than generic training.\nSetting clear boundaries is another key shift. More professionals are ring‑fencing time for rest and non‑work activities, ensuring work doesn’t dominate every waking hour. Collaboration is replacing competition, with networks built on sharing opportunities rather than guarding them. Flexible work models are also gaining traction, from four‑day weeks to job shares and compressed hours, enabling workers to maintain their income while reclaiming personal time.\nPractical steps for those ready to step back from hustle culture\nFor those feeling burned out but still wanting to improve their financial situation, the focus is shifting from sheer volume of work to efficiency. Auditing income streams can reveal which activities are profitable and which are draining time without enough return. Concentrating on one or two skills that can significantly boost earning potential in a primary role often delivers better results than spreading efforts too thin.\nNegotiating strategically is another powerful tool, using salary benchmarking data and industry insights to make a compelling case for higher pay or a better‑paid position. Building a support network of peers who value balance provides both accountability and opportunities, while protecting downtime by scheduling rest with the same priority as work commitments helps prevent slipping back into overwork.\nThe bottom line\nMillennials aren’t lazy, they’re making a calculated choice to trade constant busyness for balance. In 2025’s high‑pressure economy, that might be the smartest financial move they can make. By focusing on their main career, upskilling in valuable areas, and protecting their wellbeing, they’re not just avoiding burnout - they’re building careers that can sustain them for decades."
    },
    {
      "url": "https://www.nbcnews.com/pop-culture/lifestyle/gen-z-nostalgia-millennial-cringe-charm-rcna196957",
      "text": "Not too long ago, if you asked Derek Deng, 22, to describe millennials, the Gen Z term “cheugy” — outdated or uncool — may have come to mind.\nBut in recent months, the Brooklyn resident said he’s been overcome by a different emotion when thinking about the generation that came before him: nostalgia.\n“That millennial era of like, BuzzFeed quizzes and … mustaches, nerdcore and … hipsters, is very much, like, delightfully cringe, but in a very wholesome way,” said Deng, whose video about his love of millennial culture on TikTok was viewed thousands of times on TikTok.\nMany Gen Zers — typically defined as those ages 12-27 — have expressed similar feelings of longing for the era they never got to experience as adults. Across TikTok, hundreds of people have posted videos celebrating things that are typically associated with millennial culture, including Tumblr, skinny jeans, upbeat music, Barack Obama and, maybe most prominently, HBO’s TV series “Girls.”\nOf course, Gen Zers are not the first generation — nor will they be the last — to romanticize the lifestyle of a different era. But Pamela Aronson, a professor of sociology at University of Michigan-Dearborn, said this recent surge of nostalgia from Gen Zers has likely been fueled by the uncertainty and volatility of the current climate.\nToday’s young adults are entering adulthood with unique challenges, Aronson said. While millennials came of age during a recession, the professor said she worries about the implications of Gen Z stepping into their adult years amid a pandemic that stifled natural interactions and led into an era of more turbulent social and political discourse.\nIn taking comfort in millennial culture, Gen Zers are “sort of looking back at a time when, you know, it’s perceived that things were more stable,” Aronson said.\nChristian Guarin, 22, described the 2010s as a more “hopeful time,” which he partially attributed to the country electing and re-electing its first Black president.\nIt feels like “at the turn of every decade, there’s, like, a renewed sense of optimism towards what this new decade could be and what it could hold,” said Guarin, who works as a barista in Orange County, California.\n“There was kind of the sense that we’re really moving towards progress,” he added.\nEven music during the 2010s felt like more of a pick-me-up, according to Guarin, who said he enjoys listening to artists like Katy Perry and Walk the Moon, acts whose peak albums topped charts between 2012 and 2014.\nResurfacing popular jams from that time has almost become its own trend online, part of the larger “millennial-coded” content genre. In February, comedian and internet personality Kyle Gordon released a parody song on TikTok titled “We Will Never Die,” which is reminiscent of catchy songs from the mid-2010s like Fun’s “We Are Young.” Gordon’s audio has since been used in videos by thousands of millennials who have also posted nostalgic throwback videos.\nStill, a general sense of happiness has dwindled among Gen Zers, especially after the pandemic upended a critical time in their young adulthood.\n“About three quarters (73%) of Gen Z describe themselves as very happy or somewhat happy,” according to a 2024 report published by Gallup and the Walton Family Foundation. “However, this percentage declines significantly as Gen Z reaches adulthood, alongside many of the factors that coincide with happiness.”\nOf those surveyed by Gallup and the Walton Family Foundation, “overall nearly half of Gen Z report often (30%) or always (17%) feeling anxious, and about one in four report they are often (15%) or always (7%) depressed,” according to their report. “These mental health challenges are especially pronounced among Gen Z adults.”\nMany Zoomers also have lamented the lack of clubbing culture, noting that they feel like they aren’t socializing enough or taking advantage of being in their 20s.\n“I think we all just share a collective frustration with everything that’s going on, like, socially and politically right now,” said Deng, who works as a beauty editor. “And I think that this nostalgia has been such a cool way to share experiences and frustrations with the past and the present.”\nThe harsh realities of adulthood have also been exacerbated by the pressure to be extremely online.\nDuring the peak of millennial culture “technology was like the perfect mixture of what you want technology to be,” said Serena Carpenter, 26, a program coordinator in Weehawken, New Jersey.\n“We have everything that we need access to,” she added. “I can very easily look something up if I want to, but it wasn’t so prevalent at that time, right?”\nTo be cringe is to be free.\n-Christian Guarin, 22\nPlatforms like Tumblr, which were among the websites that thrived in the 2010s, feel more authentic to some Gen Zers, who say there is more pressure to curate their personal lives on apps like Instagram, TikTok and Snapchat.\n“When I was on Tumblr, it’s like people didn’t really have too much of a place to make all these hate comments,” said 27-year-old Steph Peralta, who works as an associate at a nonprofit in New York City. “Now it’s every little aspect is captured, and you don’t want to have an outfit that seems too crazy, and then is captured in public, and then people are like, ‘What is she wearing?’”\nMany online have also resurfaced clips from the Lena Dunham-run HBO show “Girls,” which aired from 2012 to 2017 and followed a group of women in their 20s in New York City. It has become associated with peak millennial culture, as each of the characters embodied a different stereotype.\n“Hannah Horvath, I am always like, ‘I am her,’” Peralta said of Dunham’s protagonist. “I think it’s her messy nature and kind of like her selfishness, which in a way I think is horrible to see, but it’s also comforting to see other people’s flaws.”\nThe show’s resurgence in popularity coincides with the shift in Gen Z’s perception of millennials. No longer does Gen Z feel burdened by the label “cringe,” according to Guarin.\nOr, as he put it, “to be cringe is to be free.”"
    },
    {
      "url": "https://www.msnbc.com/opinion/msnbc-opinion/freakier-friday-movie-lindsay-lohan-nostalgia-review-rcna223849",
      "text": "Did you grow up with a family movie? That is, a movie you watched again and again as a child, the one choice that all of your siblings would readily agree on, and the one you can extensively quote even now. If you’re a millennial, you likely bought the VHS or accidentally absconded with it from the local video store.\nThere are very few qualifications for the family movie: some camp, a little emotional resonance, easy viewing, a nice message, and — this is imperative — absolutely no sex scenes. I grew up with a few. While sharing all of our Holland family movies feels like leaking a state secret, I’ll give you one title: seminal early 2000s box-office success “Freaky Friday,” starring Lindsay Lohan and Jamie Lee Curtis.\nFrankly, whether “Freakier Friday” is any good by a movie critic’s yardstick is entirely irrelevant.\nOn Friday, the much-anticipated sequel to “Freaky Friday,” called “Freakier Friday,” debuts in theaters across the country. (And yes, it is much anticipated by me, my siblings and my millennial cohort.) Lohan’s comedic timing, her magnetic chemistry with Curtis and the fact that everyone from the original cast has returned have all garnered buzz.\nBut frankly, whether “Freakier Friday” is any good by a movie critic’s yardstick is entirely irrelevant. Those who are going to buy a ticket or stream the film are most likely doing so purely based on the power of nostalgic reverence. And that is OK.\nFor those somehow unfamiliar, the 2003 “Freaky Friday” centers on successful single mother and therapist Tess Coleman, played by Curtis, and her rebellious rock-'n'-roll-aspiring teenage daughter Anna, played by Lohan. From band practice to Tess’ new fiancé, the two are not understanding one another. After they receive mysterious fortune cookies from a Chinese food restaurant, Anna and Tess wake up the next day to discover they have switched bodies. Then comes an iconic shopping montage, Chad Michael Murray’s Ducati and a vengeful English teacher.\n“Freakier Friday” picks up more than two decades later. Anna, alongside very involved Grandmother Tess, is squaring off with an angry teen daughter of her own named Harper. When Anna falls in love with the father of Harper’s nemesis at school, named Lily, it is now three generations that are not seeing eye to eye. This time it is a palm reader that initiates the body swap. And the rest, as they say, is history.\nWhile both movies explore the intergenerational push-pull between parent and child and the emotionally complex realities of family, the message behind the body-swapping hijinks is one of empathy. These movies are heartwarming interpretations of the “walk a mile in their shoes” adage.\nIt’s very easy to condemn Hollywood’s recent preoccupation with remakes, full franchise reboots and sequels. Relying upon viewer loyalty or, at the very least, brand recognition is a risk-averse and, frankly, lazy way to get a movie made. It also makes an already competitive and shrinking industry even smaller for up-and-coming filmmakers with original ideas. Sometimes, it is ineffectual. Increasingly, the reboot or the sequel fails to carry its audience for another year and another movie and another similar plot. There is fatigue and there is frustration.\nThen there is the nostalgia component. Even outside of the silver screen, nostalgia has permeated so much of 2025 culture. It is easy to understand why: We’re wrestling with a deeply fractured American identity, plagued by the remnants of cancel culture and a seemingly universal anxiety. Gen Z is vocal in their longing for the perceived simplicity, stability and comfort of the early 2000s that they never experienced. Millennials, battered by the remnants of hustle culture, embrace nostalgic media as an escape and as a comfort.\n“Freakier Friday,” I would argue, exists in the gray because the franchise was rooted in nostalgia from the start. My beloved 2003 “Freaky Friday” is, in fact, the fifth movie adaptation of a 1972 novel of the same name written by Mary Rodgers. The first was a 1976 Golden Globe-nominated version starring Jodie Foster and Barbara Harris. In this way, the “Freaky Friday” franchise does not just exist in early 2000s internet-rooted nostalgia — rather, it’s something shared between five decades and multiple generations.\nMoving my own childhood connection to the franchise aside, there is a palpable difference between a sequel that is conceived out of love and appreciation for a loyal audience and one that is a cheap cash grab. I am not so naïvely suggesting that “Freakier Friday” was, you know, made for charity, but what I am pointing to is its deft understanding of why viewers loved the first one so much. This sequel honors the original cast — the humor, the tone and the storyline — while still managing to feel fresh and relevant. In this way, “Freakier Friday” feels like genuine continuation, not exploitation.\n“Freakier Friday” may not be pushing cinematic boundaries or mending our broken retrospective culture. But I know this much: It makes for a really great family movie."
    },
    {
      "url": "https://www.latimes.com/entertainment-arts/movies/story/2025-08-07/freakier-friday-review-jamie-lee-curtis-lindsay-lohan-julia-butters-chad-michael-murray",
      "text": "- Share via\n“Freakier Friday” proves that time is its own magical device. Generations of fans of the body-swap series — from the original 1972 novel by Mary Rodgers and the 1976 Jodie Foster-starring Disney adaptation to this 21st century update — have had decades to learn firsthand that everyone becomes their parents, no cursed fortune cookie required.\nIn the justly beloved 2003 remake, emo teenager Anna (Lindsay Lohan) was horrified to wake up as her uptight mother Tess (Jamie Lee Curtis) — and vice versa — on the eve of Tess’ wedding. Now, Anna is the strict single mother who can’t get her grouchy high schooler, Harper (Julia Butters), to approve of her own fiancé, Eric (Manny Jacinto), a doting British widower who comes with his bratty girl, Lily (Sophia Hammons). Meanwhile, Tess beams with satisfaction that age alone has made Anna a dork and her the cool grandma. “You’re so lame,” she teases her daughter.\nBefore you can say “Beware that psychic” (played by a hilarious Vanessa Bayer), all four females switch physiques: Harper with Anna and Lily with Tess. You know that Mark Twain quote, “History doesn’t repeat itself but it often rhymes”? Here, it’s an echoey reverb with all the panicked gals shouting at once.\nThe goal of the first Lohan and Curtis movie was to get the relatable pair to experience life in each other’s sneakers and heels. Both ultimately understood that the other’s priorities deserved respect, be it Anna’s rock band practice or Tess’ root canal. The goal of Nisha Ganatra’s serviceable sequel is to get audiences who love those characters to buy a ticket and hang out with them again. (Everyone — yes, everyone — is back.) There’s not that much emotional insight to glean from forcing Lily to become her potential step-grandmother, a stranger she barely knows. There’s simply hijinks.\nThe season looks strong, loaded with the kind of big Hollywood swings, smart indie alternatives and a fair amount of delicious-looking dumb, necessary in every summer diet.\nThe kids, who hate each other, use their adult-shaped opportunity to try to split up their mom and dad so they don’t have to be siblings, like the screenplay itself is its own swapped inversion of Lohan’s other childhood remake, “The Parent Trap.” They also land good zingers about what Gen Z considers passé. Lily sneers that Facebook is “a database of old people.” Meanwhile Anna and Tess, who’ve been through this before, don’t have much motivation beyond using their lithe young bodies to ride scooters and scarf cheeseburgers. Editor Eleanor Infante entrusts the movie’s energy to montages: fashion shoots, photo booths, feeding frenzies. The storyboards could have been a cheery Instagram slideshow.\nAnna and Harper’s central mother-daughter plot line is so hastily sketched that it barely registers. “Freakier Friday” is in such a rush to get on with things that we don’t get much of a sense of either of their personalities. Anna, who’s grown up to manage a needy pop singer named Ella (Maitreyi Ramakrishnan), is your standard earnest mother. Harper, uh, likes to surf. It’s no fault of the actors that you have to squint very, very hard to see the girl inside the woman and the woman inside the girl — Lohan is grounded and likable in her big comeback, holding the screen with assurance. But it is a shame that the promising Butters doesn’t get the same showcase of her own preternaturally mature talent, other than one scene where she yells and another one where she cries.\nTess and Lily are easier to parse. Tess, a therapist, is so certain her opinions are important that she steps on everyone’s sentences. Lily is vain and snippy and about as convincingly English as if the only research into her character was a season of “The Great British Bake Off.” As evidence, there’s a bake sale where her treat is accused of having the dreaded “soggy bottom,” triggering an epically well-staged food fight.\nJordan Weiss’ script is so tangential to the movie’s charms that things would feel pretty much the same if Harper and Lily had traded places, or honestly, if no one swapped at all. People just want to see Curtis and Lohan palling around in a comedy that frames their reunion like it’s the Hope Diamond. With both actors confidently cutting loose, their chemistry pulls so much focus that it’s a continual struggle to remember the basic conceit. My brain refused to absorb that it was watching Harper as Anna played by Lohan. It just lit up at how nice it was to see Lohan strap on a guitar and sing a couple of songs. Adorably, the numbers Anna wrote in high school for her all-girl band, Pink Slip, went on to become minor hits — when Pink Slip reunites onstage at the Wiltern Theater, the crowd knows their lyrics.\nWe’ve mapped out 27 of the best movie theaters in L.A., from the TCL Chinese and the New Beverly to the Alamo Drafthouse and which AMC reigns in Burbank.\nHalf of Tess’ lines are just variations on vain Lily’s fear of wrinkles, dentures and suit jackets stuffed with used tissues. “I’m bloody decomposing!” she wails. The gags are more cruel than clever. But Curtis hurls herself into this schtick with gusto — say, demanding a ring light and lip plumper for her passport photo — and gets you laughing anyway. (As a reward, the costumer Natalie O’Brien highlights Curtis’ eternally spectacular curves.) Curtis is having such a blast channeling her inner fashionista that I’d have been content with just a Tess and Lily swap with an ordinary Anna and Harper covering for their chaos before any of the exceedingly patient men in their lives find out.\nThere’s so much, and yet so little, happening that the key image of the movie turns out to be an early throwaway joke: Tess driving her granddaughter to school and getting flummoxed by the logjam at a four-way stop. None of these characters has the narrative right of way. When the four women reconvene at a wedding rehearsal dinner, the staging of the restaurant scene is just as frustrating, with the audience staring at everyone’s faces, wondering who, if anyone, will take charge.\nGanatra is mildly interested in cramming bodies inside another and majorly invested in squeezing as many funny female comics as possible into the running time, with fantastic cameos for Chloe Fineman as a dance instructor, X Mayo as a school principal, June Diane Raphael as a ferocious pickleball competitor and Santina Muha as a lovelorn immigration agent. Bayer is terrific as Madame Jen, the cause of this film’s corporal confusion, a flam-flam artist who side-hustles as a barista.\nThe film is safely, studiously PG. When the underage child-women chug glasses of wine, a cutaway assures us its merely grape juice. Anna’s former high school boyfriend Jake (Chad Michael Murray) gets roped into the action and I’d bet my own soul that there was once a version where he was Harper’s conspicuously unnamed dad. Someone decided it would be too weird that the girl uses her mom’s skin suit to flirt with him in the hope he’ll disrupt the wedding.\nThe old crank in me wished that I laughed harder than I did. “Freakier Friday” won’t trade places with the original in audience’s hearts. But this disposable delight will at least allow fans who’ve grown up alongside Lohan to take their own offspring to the theater and bond about what the series means to them — to let their children picture them young — and then pinkie-swear, “Let’s never let that happen to us.”\n'Freakier Friday'\nRated: PG for thematic elements, rude humor, language and some suggestive references\nRunning time: 1 hour, 51 minutes\nPlaying: In wide release Friday, Aug. 8"
    },
    {
      "url": "https://www.theguardian.com/commentisfree/2025/aug/03/nostalgia-is-eating-us-alive-instead-of-building-a-new-world-were-regurgitating-a-past-that-never-existed",
      "text": "There has been much talk about our hunger for a “return to optimism”. Our world has been too real for too long, and we all just want a bit of shelter from the storm.\nWe look back in patronising nostalgia at Obama’s Hope poster in the same way we insist music hasn’t been real music since about 1986 (or since 1966, or since the Great American Songbook, or since Mozart, depending who you talk to).\nMovie theatres are propped up by two monolith tent poles: DC’s umpteenth Superman and Marvel’s Fantastic Four reboot, both attempting a full factory reset of their flagship properties.\nIt offers a return to the originals – AKA, the “good old days”. But this isn’t so much a yearning for a new optimism as it is a resuscitation of an old one. The Fantastic Four is even set in a 1960s Jetsons-style alternate reality (the first comic was published in 1961).\nRemember this? This is Things As They Should Be™.\nThe great irony in this regurgitation of old aesthetics is that, they themselves looked forward. The joy and optimism of the space age showcased the marvellous and fantastic possibilities of technology and science, before we knew that those same industries would slowly start choking our own atmosphere.\nWe want to go back to that time, when we could feel good about driving our big shiny bubble cars and tease our hair up guilt-free – without thinking about the ozone or whatever.\nThis perceived collective optimism was never real, of course. But now, after decades of doom storytelling and hope erosion, we want the dream back.\nWhat’s happening in the culture is more than the good honest fun of theme park recreations, 1950s diners and old west camera filters. This is an earnest but somehow deeply sad defibrillation of dead worlds, built around a hollow craving that can never ever be filled.\nWe are birds constantly regurgitating and eating our own upchuck. Same flavour but different colour, different flavour but same chunks.\nIts passion looks inspirational, but its sniff is grief. It works, but not quite — as fresh as microwaved leftovers.\nIt’s the cultural equivalent of Maga – the lie that there was some glorious past where things were flourishing and wholesome and if we can just get back there we’ll be on track again. But there never was that past. It’s a distortion of immature childhood memories and historical rewriting by big corporations.\nThis is the multiverse made real by an increasingly small cabal of conglomerates leveraging their various assets, stuffing each storytelling turducken full of old money-makers to reduce the risk in anything new. It’s not so much the multiverse as the IP-verse. Every brand everywhere all at once.\nOver time this starts to feel like a photocopy of a photocopy. The AI boom is quite literally sampling and recycling things that already exist.\nWhen I see a brand-new building proudly inspired by the art deco movement of 100 years ago, I wonder if the great deco designers knew way back then that they were on the blind precipice of the future, or were they recreating their own nostalgic past? I wonder, as typography and graphic design trends cycle through recreations of past “vintage” ideas, what the concept of “vintage” meant to people back when it was, to them, modern?\nHaving lost hope for the future, we have always looked back for comfort. We have to be cautious of the reasons why.\nWhy did Nazi aesthetics have such a fetish for ancient Rome? Why did Soviet culture idolise modern industrial style? Even in The Handmaid’s Tale’s Gilead, they revere the natural and organic by insisting on non-GM and high-fat foods. The world around us tells us a lot about our beliefs.\nWe are all potential victims of this ideological myth-making. It’s invisible but everywhere, and it’s difficult to tell if people in power aim to manufacture a world that matches their values or if it’s some kind of naturally developing, laissez-faire attraction.\nWe’re all dreaming of a better time from the past, since there is no future. We’ve stopped dreaming about building – now we dream of recreating.\nIt’s not recreating the actual thing that we want, it’s the yearning to recreate the feeling we had back then.\nIn my local city centre, I drive past heritage-protected sandstone buildings with the names of the original shopfronts still carved at the top. The mason etching that date in the rock was doing it for the future, so as time stretched on his mark would stay there, even for me now as I whip past the exact same building in a space shuttle machine he could never even dream of.\nImagine a shop front named something like, “Nolan and Sons Merchants, est. 1861.” And on the shop front awning below it, computer-printed on laminate in an deliberately old-timey font, “Buzz’d Cafe, est. 2025.”\nTake a sledgehammer to the wall of this cafe. Pierce the membrane of lino wallpaper printed to look like rustic bricks and find sterile chalk-white plasterboard from the previous shop, which was itself once added to modernise and cover the rustic brick walls beneath.\nYou can find these rings of a tree in everything: generations on top of generations of us each trying to make our own existence matter and either cover or recover the ones before us.\nSo, do we seek comfort in the baby blanket of our past myths – or do we try to create our own new ones?\nComments (…)\nSign in or create your Guardian account to join the discussion"
    },
    {
      "url": "https://www.glamour.com/story/enough-with-the-sequels?utm_source=chatgpt.com",
      "text": "Hollywood’s obsession with sequels has reached a fever pitch, and it has to be said: It’s enough. No more sequels.\nThe Devil Wears Prada 2, Bend It Like Beckham 2, Freakier Friday, 28 Years Later, Jurassic World Rebirth, Bridget Jones: Mad About the Boy, Happy Gilmore 2, Karate Kid: Legends, Top Gun: Maverick, Beetlejuice Beetlejuice, the possibility of My Best Friend’s Wedding 2—this is an abbreviated list of the many sequels that have either been released or greenlit during the past few years. Some of these have fared better than others—both in terms of box-office performance and critical reviews. But it doesn’t matter to me whether the sequel is good or if it’s bad or if it’s mediocre. It’s the principle of the thing that irks me most. Why must we continue to revisit the past, resurrecting often-beloved but long-dead titles from the ’80s, ’90s, or 2000s, rather than forging ahead? Surely the studio executives responsible for making these decisions don’t believe we’ve run out of stories to tell. Right?\nI’m hardly the first person to bemoan the sequel obsession—this is an argument that’s been ongoing for well over a decade, and even inspired a sitcom about a sitcom that gets rebooted, called Reboot. (It was canceled after one season, but hey, there’s always a chance it might get a…don’t make me say it.) However, in August 2025, as images from the set of The Devil Wears Prada 2 fill my social feeds, Happy Gilmore 2 dominates Netflix, and Freakier Friday opens in theaters, the conversation about sequels feels particularly urgent. And I’m not alone in thinking this way.\nCome dissect all possible interpretations of these new photos with us.\nWhen Variety reported last week that a sequel to My Best Friend’s Wedding—a perfectly good 1997 film starring Julia Roberts and Dermot Mulroney—was in development, there was a rousing cry of “Who asked for this?” across social media. What could possibly be gained from revisiting Michael (Mulroney), his bride (Cameron Diaz), and his problematic and possessive BFF Julianne (Roberts) in the modern era?\n“NOT everything needs a sequel or a remake!” wrote one of many exhausted fans on X. “This era we’re living through is overflowing with emotion, chaos, and beauty MORE THAN ENOUGH to inspire something truly NEWWW.”\nIt’s hard not to feel like corporate greed and general laziness are responsible for this onslaught of sequels. We’ve heard again and again that viewership isn’t what it used to be, especially in theaters, and that studios are struggling to compete for our shrinking attention spans. Superhero films used to be a sure bet, attracting Hollywood’s A-list with the promise of a blockbuster success. However, as their relevance fades, it seems like studios are rolling out sequels to fill the void. But they’re not the solution, either.\nIf the problem facing the industry is shrinking audiences, what good can come from revisiting a story that appeals to a finite number of people who watched the original? What if we draw inspiration from the classics, and the elements that made them truly great, rather than iterating on them again and again?\nI can’t help but think of the success of The Pitt, HBO’s hit medical drama that stars ER alum Noah Wyle as Dr. Robby, a handsome emergency-room doctor with shades of Dr. John Carter, Wyle’s ER character. If ER had been rebooted, as was initially reported by the rumor mill, would the final product have been as successful as The Pitt, one of HBO’s ratings juggernauts? I, for one, wouldn’t have watched it. Why would I have, when there’s a barrier to entry? When the audience is required to come preprogrammed with details from the original film or TV show, you’ve already lost out on forging a bond with a new audience.\nSome of these shows may not stay canceled.\nThen there’s the viewer’s sacred and often fragile relationship with great movies and TV shows. The best intentions are no match for the nostalgia we have for films of a place and time, films that shaped us or marked a specific period of our lives. Everything I’ve learned about And Just Like That…, for example, I’ve learned against my will. And somehow, knowing these women’s future storylines has tainted the original Sex and the City for me. Just because we remember a project fondly doesn’t mean we should know exactly what happened in the end.\nThe most satisfying and impactful endings are the slightly ambiguous ones. I’m not talking about cliffhangers, but one in which a protagonist emerges changed—for better or worse—and the audience is left to imagine what happens next. Can you imagine a sequel to the Sopranos, where the audience finds out what really, definitively happened in the final scene? Trust me, Hollywood, your sequel will never be as interesting as my imagination. Please, let’s all move on."
    },
    {
      "url": "https://www.theguardian.com/film/2025/apr/26/los-angeles-film-and-tv-production?utm_source=chatgpt.com",
      "text": "When screenwriter David Scarpa visits the great Hollywood studios these days, he is struck by what is missing. “It used to be you’d walk around those back lots and you’d see many people and they were very busy,” Scarpa muses. “They were like small cities. Now often you’ll walk around and have nobody else there. It feels empty. You definitely feel the absence of life on those lots.”\nLike the once proud industrial factories of the midwest, the dream factories of southern California are in decline. Last year was the worst for on-location filming in Los Angeles since tracking began 30 years ago apart from pandemic-hit 2020. Of all the TV shows and feature films that North American audiences watch, only one-fifth are now made in California.\nThis is because Hollywood is facing intense competition for film production from domestic rivals such as Atlanta and New York, and international challengers such as Australia, Britain and Canada, all offering more aggressive financial incentives. California’s politicians stand accused of resting on their laurels too long.\nDonald Trump has a plan but, critics say, it will be no more effective for Hollywood than his notorious tariffs for the rust belt. The US president’s appointment of the actors Mel Gibson, Sylvester Stallone and Jon Voight (combined age 233) as “special ambassadors” to rescue the local industry met with widespread scepticism. Instead campaigners are focused on the hard graft of legislating new tax incentives in California’s state government.\nScarpa, whose recent credits include Gladiator II and Napoleon, adds: “The state and the city are both struggling with big fiscal issues and in a way it becomes an arms race: is LA going to be able to compete with eastern Europe? We have the best people in the world here but often producers find themselves shopping for the best price. If LA wants to remain a hub of production, they’re going to have to have some form of tax incentives to compete with them.”\nHollywood has been synonymous with film for more than a century. Southern California’s sunny weather allowed year-round outdoor filming while land and labour were cheaper than in eastern cities. Film-makers such as Cecil B DeMille and companies such as Paramount and Universal set up studios that ensured a creative ecosystem of actors, directors, musicians, writers and technicians. Hollywood burnished its self-mythology through films such as Sunset Boulevard, Singin’ in the Rain, The Player, Mulholland Drive and La La Land.\nCalifornia continues to boom. According to IMF data released this week, the state’s nominal GDP reached $4.1tn, surpassing Japan’s $4.02tn and placing California behind only the US, China and Germany as the fourth biggest economy in the world.\nYet while the tech giants of Silicon Valley continue to thrive, Hollywood is facing an existential crisis. The first quarter of the year saw downturns in every category of production compared with the same period in 2024, according to FilmLA, a non-profit that handles film permits for the city and county.\nShoot days declined 22% over that period and just 13 TV pilots were made, the lowest tally ever observed by FilmLA. Meanwhile average occupancy rates for the majority of stages were 63% last year, down from 69% in 2023. And according to the Hollywood Reporter, the number of recording days booked for music scoring stages dropped from 127 in 2022 to just 11 so far this year.\nThe malaise threatens “below-the-line” crew members such as grips, electricians, carpenters, set decorators, sound engineers, costume designers and makeup artists who came to Hollywood because that was where the work was. If that allure fades they could take their talents elsewhere, sending the ecosystem into a death spiral.\nThe warning signs are everywhere. Los Angeles is now merely one of 120 jurisdictions around the world that offer some form of incentive for film-making. In February, the streaming giant Netflix announced a $1bn investment to produce 20 films and TV series in Mexico annually over the next four years. Last week Texas passed a bill that would more than double the money spent to lure film and TV production to the Lone Star state.\nThe flight from Hollywood has even prompted comparisons with Detroit, the “motor city” that, with the struggles of the car manufacturing industry, went from one of America’s most prosperous cities to one of its most troubled. Factories shut down, thousands of jobs were lost, the population collapsed and the city ultimately declared bankruptcy.\nPhilip Sokoloski, vice-president of integrated communications for Film LA, says: “I don’t think we’re past the point of rescue, but Detroit offers an example of what happens when everything is in your hands and you fail to work to keep it. For California, for greater Los Angeles, we’ve maintained leadership in this industry for a century.\n“Generations of people have invested their time, their sweat and their dreams into building this business and it’s been ours to lose. California has underestimated the staying power of its competitors when it comes to their desire to have a slice of Hollywood for themselves.”\nCalifornia remains the production leader, Sokoloski notes, but its share of the cake is down to an all-time low of just 20%. “That’s not what most people would think of when they think of Hollywood as a dominant presence in the industry. It’s very small, the smallest we’ve ever seen it, and as a result what happens to a region when the thing you’re best known for four out of five times is done somewhere else?”\nLast October, Film LA made the case that California needs a vast expansion of its film and TV tax credit to maintain its competitiveness. Stay in LA, a grassroots campaign, is pushing for action. The state governor, Gavin Newsom, has proposed more than doubling the money allocated annually to California’s film and TV tax credit programme from $330m to $750m.\nTwo bills are now working their way through committee in the state legislature. Some politicians warn that the tax incentives will represent a corporate giveaway to wealthy studio bosses; others argue that more importantly they are about keeping jobs in California and offering workers a wage to match the high cost of living.\nMary Flynn, an actor who has noticed a drop in her auditions and work opportunities, reflects: “This is how bleak it is: we’re at a point where poor and working-class people are advocating to our government to provide tax incentives for big film studios to keep the work in California so that we can keep working because we can’t compete with Atlanta, where the minimum wage and things like that are lower. They’re taking advantage of tax opportunities but also how much they have to pay into labour.”\nThe drive comes after a punishing few years that have included the end of the streaming boom, pandemic, strikes and wildfires. Flynn adds: “We have exhausted so many resources and even in the midst of all this at Sag-Aftra [Screen Actors Guild–American Federation of Television and Radio Artists] we have video game actors still on strike.\n“We are very much still hurting so it’s now up to the leadership at large to do what they ran on, which is to protect work and advocate for working-class people. Every single politician that sits at the state level in California advocated on that promise so now they’ve just got to deliver.”\nSoon before his return to the White House, Trump described Hollywood as “a great but very troubled place” and declared that Gibson, Stallone and Voight would be his “eyes and ears”, helping to bring it back “bigger, better, and stronger than ever before!”\nBut Flynn for one is not pinning her hopes on the trio, noting that Voight has adopted “financial core” status with the Sag-Aftra, making him a fee-paying non-member who is allowed to work on both union and non-union projects. She adds: “He’s not only abandoned his fellow union brethren but any work in this town that is worth a cent is union-made; George Clooney and Tom Cruise are in Sag-Aftra, they are not fi-core.\n“I don’t know what someone like Jon Voight is going to do to save all of our industry when he hasn’t really been in it seriously in a minute. I highly doubt that they would be able to be our knights in shining armour. It’s not a basket I’m putting my eggs in.”\nIndeed, there is little sign of the promised rescue mission, with industry insiders reportedly saying it has been mostly “crickets”. The ghost of past failing metropolises persists. Last year Scott Galloway, a business school professor and podcaster, told Matthew Belloni of Puck that “LA is a much-better-weather version of Detroit right now.”\nBelloni comments: “There are certainly differences from what happened in Detroit where the entire manufacturing industry left, and with it, the entire business is now a shell of itself. The entertainment industry will always have some root and connection to Los Angeles because of the infrastructure that is here and by that I mean the studios and the talent agencies are not talking about upping their headquarters and moving to Nashville or London.\n“But he’s not wrong in the sense that the core rank-and-file middle class of the entertainment industry is being hollowed out, much like it was in Michigan. It’s never been more expensive to live here and, for many of these artists, it’s never been more difficult to find a job.”"
    }
  ],
  "argos_summary": "The article discusses the nostalgia surrounding family movies, particularly the upcoming sequel \"Freakier Friday,\" which taps into the emotional connections millennials have with the original film. It highlights how nostalgia influences audience engagement, especially among millennials and Gen Z, who seek comfort in familiar narratives amidst a chaotic cultural landscape. The piece also critiques Hollywood's reliance on sequels and remakes, suggesting that while they may provide temporary satisfaction, they often lack originality and depth, reflecting a broader cultural yearning for simpler times.",
  "argos_id": "QIZEVVMVR"
}