{
  "url": "https://www.bloomberg.com/news/videos/2025-08-08/horizons-middle-east-africa-8-8-2025-video?srnd=phx-markets",
  "authorsByline": "bn",
  "articleId": "d1d2ae2a1c3d43dcb962866ef68c1380",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iLzWhS.XEZcQ/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T08:36:27.526000+00:00",
  "addDate": "2025-08-08T08:55:47.767123+00:00",
  "refreshDate": "2025-08-08T08:55:47.767127+00:00",
  "score": 1.0,
  "title": "Horizons Middle East & Africa 8/8/2025",
  "description": "Horizons Middle East & Africa is your daily spotlight on one of the world's fastest-growing regions. Live from Dubai, we bring you the latest global markets and analysis, plus news-making interviews, with a special focus on MEA. All that and more, as you head to the office in the Gulf, pause for lunch in Hong Kong, or start your day in London or Johannesburg.  (Source: Bloomberg)",
  "content": "Good morning. This is Horizon's Middle East and Africa. Our top stories this morning, Israel's security cabinet approves Prime Minister Benjamin Netanyahu's plans to take full control of Gaza City. President Trump nominated Steven Miron to temporarily fill Adriana Kugler seat on the Fed board. Meanwhile, Christopher Waller is the leading choice amongst Trump's advisors as the next chair. Plus, Japan's top trade negotiator says the US has confirmed it will end stacking of universal tariffs on Tokyo and cut car levies as promised. It's just gone. I'm across the Emirates. I just want a Versace in Dubai. Well, rounding up what has been quite an eventful week in terms of data, in terms of big announcements out of the Fed and, of course, earnings. Two, yesterday we saw Wall Street dip a little bit. Ending the day slightly in the red. So running out of steam. And of course, we speak to the 30% recovery that we've seen in the S & P since the lows in April. So perhaps reaching some stalling levels here. Futures today pointing to another positive session, up 2/10 of a percent, ten year yields sitting around 4.25. But lots of announcements overnight. And we're going to dig in to the potential announcements of Steven Miron filling in that Adriana Kugler vacancy on the Fed and what that might mean. The clear trend here is to replace some of the departing or future departing members of the Fed with more dovish members. So that's going to be a big driver for yields. But yesterday we did have very weak ten year auction, 30 year auction, which has meant that at these levels of of yields of interest rates, there's been less interest from the international community to buy. Brent also sitting at $66. It's actually been a negative week on the whole for the Brent complex. It's fallen about 4%, four or 5% on the week. This as the market there thinks ahead, looks ahead to perhaps a glut later on in the year. And also the impact that these tariffs are going to have on the global growth and the bonds outlook. And then gold also in focus. And here you can see we're up 1%. But the big news overnight and this was according to F.T. reporting, is the government is now look, the US government is not looking to place tariffs on imports of one kilogram gold bars that have been or that are originating from Switzerland. So this is part and parcel of the discussions taking place between the US and Switzerland. A big chunk of the Swiss exports that go to the US are the form of refined gold. And so now the US are going one step further and applying a tariff on those one kilogram bars. So something to think about there. Okay, let's check in on how markets in Asia are faring. April Hong is in our Singapore studio. And April, we've been talking about more tariff talks, but a potential concession for Japan here. Yeah, because Japan has sort of said that the US is confirming that they won't be stacking these tariffs. And that is of course something that's caused some consternation in the market. So sign a sign relief. And apart from that, it's not just the trade picture I think about as well how earnings have been delivering. So why you're seeing the Japanese market outperforming today, in fact, from SoftBank. That's really what's been driving the rally to the highest, I think on record and is following on from its earnings rise, showing that profit is recovering and that's helping its vision fund turnaround as well. Now, aside from Japan, we also have this undercurrent of Fed rate cut bets have been supporting markets in the region, but highlighting as well the outlier today. That's really Chinese tech names. Don't forget, we have data out of the Asian giant this weekend, CPI API numbers, but going into next week is going to be about tech earnings. The likes of Tencent, JD dot com, these are companies that are seen as more tariff vulnerable. So we're seeing some of the Chinese tech giants dragging the benchmark today. Jomana. April thank you so much. April Hong and Singapore. Now on to the top story here in the region. Israel's security cabinet has approved Prime Minister Benjamin Netanyahu's plans to take full control of Gaza City. The move is seen as a final push to topple Hamas and 22 months of fighting in Gaza. Netanyahu told Fox News Channel he intends to hand over Gaza's governance to Arab forces. Well, we don't want to keep it. We want to have a security perimeter. We don't want to govern it. We don't want to be there as a governing body. We want to hand it over to our forces that will govern it properly without threatening us and giving Gazans a good life. That's not possible with Hamas. Let's go to Jerusalem now and speak to Bloomberg's Don Williams. So the Israeli prime minister is describing this as a military operation, not an occupation. And yet Israel still effectively controls around 70% of the Gaza Strip. Why this latest push into Gaza City than to hear the Israelis tell it it's the end, or at least the beginning of the end of this war. Israel's the longest of Hamas, at least in terms of Hamas being an armed governing group in the Gaza Strip. It's worth noting that this war really has been a strain on Israel's conscript military, on its economy. It's plunged Palestinians in Gaza into unprecedented humanitarian distress, and it's tested the patience even of Israel's best friends abroad in the region, in Western Europe and the United States. So it would appear now that the two choices were either for Israel to capitulate in terms of giving up on its core war goals, of retrieving the 50 hostages while eliminating Hamas, or to press ahead into this lost patch of Gaza land in order to crush Hamas militarily. Now, there was a ten hour cabinet meeting that took place, which tells you that the meeting itself was pretty frauds. But I want to ask you about broader Israeli public opinion. It was notable this week that the Israeli, a former Israeli military chief, actually cautioned against pushing further militarily into the Gaza Strip. You had the leader of the opposition, Yair Lapid, yesterday saying most of the nation is in behind you. The people of Israel don't want this war. We will bear heavy costs for it. How is this likely to go down amongst the Israeli public? Not well. For at least six months now, polls have shown that a majority of Israelis want the war ended with a negotiated deal to return this lost hostages, even if that means leaving Hamas standing. That's in stark opposition to what Netanyahu and his religious nationalist government have been pursuing here. The prime minister has written off those poll findings saying they're either inaccurate or that Israelis don't understand the implications, the ramifications of leaving Hamas around. This is an organization which is deemed a terrorist group by much of the West. It began this war with an attack on Israel that was Israel's worst, in fact, the worst the bloodiest day for Jews since World War Two. There's a matter here not just of national security, but also of national honor in terms of finishing the war where it began. Netanyahu can claim to have seriously set back Hamas allies in Lebanon, Iran, Syria, but we're now back to Gaza to square one, and he seems determined to be able to declare victory there. Yeah, despite a lot of pressure from the international community, something that we've been talking about on this show the last few weeks, the real push out of many European states and other countries around the world to move towards the recognition of a Palestinian state at that U.N. General Assembly come September. But the big one is the US. And the question here is, does Netanyahu have the explicit or even the implicit support of the United States for this operation? I know you spoke to the US ambassador to Israel earlier this week. Indeed, I would say it's explicit. Trump himself has said he's fed up with Hamas. He's expressed horror at the treatment of the hostages as 50 hostages, or at least the 20, he believes, still are still alive in Hamas captivity. And indeed, the Americans appear to have built up a kind of tag team relationship with Israel, whereby Israel does the fighting and the United States does the feeding. What I mean by that is there is this new substitute humanitarian aid system in Gaza known as the F. It had a tricky rollout. There have been issues with safety for aid seekers and now it appears the Americans want to quadruple its output in concert with the Israeli moves into the remaining 25% of the Gaza Strip. So we can expect to see civilians that are evacuated or dislocated from Gaza, from Gaza City being invited to new Jewish centers to be tended to, at least when it comes to staple foods and the like, something the allies hope will allow will smooth over what's bound to be a very, very rough patch of this war. Bloomberg's Ted Williams in Jerusalem, bringing us up to speed on this very important development in the region. Thank you. Now over to the Fed. Now. President Trump says he has chosen Council of Economic Advisors Chairman Steven Miron to serve as a Federal Reserve governor. Miron will only serve the remaining term of Adriano Kugler, which ends in January before a permanent replacement is found. So let's talk to Bloomberg's. But as friends. So first of all, let's talk about this appointment. It's set to be a temporary appointment in nature. So Steven Miron isn't likely to stay on. But what do we know about how Trump is thinking about potential replacements for future spots as they open up? That's right, Jim. And it certainly stands out that the president made it clear that Steven Brown is a temporary replacement. So it looks unlikely that he thinks of him as a potential replacement for Jay Powell, although things might obviously change and things do change in Washington. It is really interesting that the president is sort of rating his own Council of Economic Advisors and is tapping around who's been a key architect of his policies, particularly tariff policies. Immigration has also been a very vocal critic of the Fed. He's been calling for rate cuts. Just yesterday, he came on Bloomberg TV to tell us that he doesn't see a risk of sustained inflationary pressure from Trump's tariffs. If there's any effect near and thinks it will be a temporary one, which puts him immediately at odds with Jay Powell, who's been worried about a persistent inflationary effect from trade policy. So what that tells us is Myron is going to be another dovish voice on the Fed, adding to the already existing small faction of people who are pushing for rate cuts. Whether that will be enough to actually move Fed policy to a different direction, that remains to be seen. Yeah, I mean, quite notable that you've got such an outspoken Fed critic now being positions on the Fed's policymaking committee. So that in itself is notable. But let's talk about the Fed chair, Jerome Powell himself. His term is set to come to an end in May. And now it looks like Christopher Waller is emerging as one of the preferred candidates to fill that seat, one of the more dovish members of the committee. Indeed, our sources tell us that Waller has impressed the president's staff. He has not met with the president himself for the job, and it seems like the process is far from over. There are other contenders Kevin Warsh, Kevin Hassett remain in the running, but Waller checks a lot of boxes. He's a former Trump nominee who's been through Senate confirmation process. He's he knows the Fed inside and out, is very familiar with the processes. And what our sources tell us is that he's impressed the president's staff with his ability to lean on his policy decisions, his policy preferences. He's been leaning on his forecasts rather than current data and is especially impressed them with his predictions on the labor market, which has been particularly a point of contention recently. He Waller has been able to call a softer labor market to argue for for lower Fed rates, which does seem to impress the president's staff. Yeah, yeah, yeah. Flats flatter. Whatever you want to call it. Bloomberg Surveillance pounds. Thank you so much. Well, President Trump says he is willing to meet with Vladimir Putin even if the Russian leader has not yet agreed to also sit down with Ukraine's president. Putin says he does not mind meeting Vladimir Zelensky in general. But conditions have not been yet met. And also says the UAE is one of the countries that could host the meeting. Meanwhile, Trump told reporters he was very disappointed with Putin's behavior and left open the possibility of additional penalties over the war in Ukraine as soon as Friday. Speaking of UAE, I also just want to flag the UAE president met with Putin and Russia yesterday and coming up, but not yet. Is your deadline still standing for Vladimir Putin to agree to a cease fire tomorrow or is that fluid now? It's going to be up to him and we're going to we're going to see what he has to say. It's going to be up to him very disappointed. So still lots of questions about whether that meeting is going to take place. All right. Coming up, we'll see a rally that drove stocks to the brink of record runs out of the road amid concerns over overheating. Neuberger Berman shares their market strategy next. This is Bloomberg. Welcome back to Horizon's Middle East and Africa. I'm Joanna Versace in Dubai. Former Treasury Secretary Larry Summers says President Trump's policies risk putting the US on a similar path to that of post-war Argentina. We are alienating the rest of the world. There hasn't been a moment when around the world China was more popular than we were, and that's got to affect the demand for American brands, the demand for American products when we are so discrediting ourselves. Let's get more markets with repetition. Our senior portfolio manager and head of trading London at Neuberger Berman. Good to have you with us. Maybe that's just pick up on those Larry Summers comment saying that the US is risking alienating the rest of the world. And I wonder whether within that framework, whether markets are being too short termist and actually are being way too complacent about some of the long term effects of this global rewiring of trades that President Trump is trying to achieve by imposing these unilateral tariffs. Yeah, I mean, there's there's pluses and minuses to that comment. However, what I note, though, is that, you know, the tariffs, while high, are high relative to recent history. Right. If we go back 20, 30, 40 years, you know, it was the numbers were a bit more in line. So, again, there are some changes. But but in terms of alienating the rest of the world, look, we still see people buying U.S. assets. That's still the deepest source of capital. In addition, a lot of the companies in the U.S., you know, are where, where, where worldwide investors may may want to be. So, again, it's difficult to really you know, I hate to argue with Larry Summers, but but it's it's difficult to say that the U.S. will become an international pariah. Yeah. Yeah. Okay. Fair point there. Let's talk about the near term prospects for the US economy. We had that shock labor market prints a week ago and even jobless claims yesterday rising to their highest level since 2021. There's clearly weakness in the labor market. What do you think the Fed do from here? Yeah, look, our view is that the Fed is going to start cutting rates, right? That was our view before the Labor report. It was our view after the Labor report. And if we think about what could happen in connection with Stephen Miron and other people in the Fed, next week's CPI report becomes very important as well as then Jackson Hole right after that. And so do we see signs of the tariffs impacting inflation or not? And how does the Fed then tee up a series of rate cuts potentially starting as soon as September, when we get when we get a new set of economic projections? And again, if we think about the labor market, though, the revised numbers sort of go in line with what we were hearing from corporates at the time. If we think about what corporates were doing at the time, they were saying May and June was a bit uncertain due to the tariffs but sequentially improved in July and that's what the labour market showed. Now obviously we got the claims data yesterday and so there's still some question marks around that. But on the whole, you know, does sort of fit more in line with what we were hearing from companies during during during the latter part of the second quarter. Yeah. Are you expecting these tariffs to be inflationary for the US economy in coming months? Yeah, temporarily on the good side. However, there will be offsets on the services side. So we do expect shelter inflation to be coming back down. So. So the goods is just one part of the equation. And in terms of how that happens, there might be a small tick up in the some of the goods inflations. But but by the time we get to 2026, we're back down towards that 2%. And that's inclusive of assuming four rate cuts between between later this year and early next year. So you if there is a blip in inflation, it does look to be, you know, not necessarily transitory, but but it does appear appear to recover shortly thereafter. And again, we have to think about that services side of the equation moving lower. You know, a couple of months ago, around April May, people started to look outside the US for opportunities and certainly there was a valuation up in European markets. But again, some of that trade has begun to lose steam as people sort of look again for the opportunities back in the US that the US exceptionalism theme is coming back again. What do you think of the outlook for European equities from here? Yeah, well European equities a bit out of my deck, but what we do see though is you know how to how are people looking at that asset allocation change in terms of as we move into year end, how do people think about what is my allocation to the U.S. assets to to European assets and to global assets generally? Obviously, you talked to a little bit earlier about the rally in Japanese equities today. So how are people thinking about that asset allocation moving into 2016 and 2027 moving forward? Yeah. Makes sense. It's all going to be about this asset allocation, especially with the changes at the top of the Fed. Robert Disher, thank you so much for joining us. Senior portfolio manager and head of Trading London at Neuberger Berman. Well, still ahead. Zimbabwe and the UK are rekindling diplomatic ties after almost three decades of tension. The details later this hour. This is Bloomberg. Welcome back to. The Middle East and Africa. I'm Jomana Versace in Dubai. Now for a look at some of the other stories we're following today. South African President Cyril Ramaphosa and U.S. President Trump spoke by phone on the eve of the introduction of Washington's punitive new tariff regime. The call signals an effort by Pretoria to invigorate negotiations on a new trade deal with its biggest partner after China. The two nations have failed to make progress on an accord since their leaders met at the White House in May. Tensions between France and Algeria have intensified after French President Emmanuel Macron canceled visa exemptions for Algerian officials, citing a lack of cooperation. Algeria's government responded by saying France was to blame for the poor relations and announced it would enact reciprocal measures. The move further strains a relationship already fraught with disputes over migration, security and territory. And a look at equity markets as we round up the week. Lots of announcements overnight vis a vis the Fed and the replacement for Adriano Caglar, a temporary replacement by Stephen Miron. So dovish substitute there. And then later next here, Christopher Waller is emerging as the lead candidate to replace the Fed chair himself, Jerome Powell. That's driving some of the sentiment today. You can see S & P futures NASDAQ markets both up 2/10 of a percent. European markets also leading towards the green and a slightly better handover from asia, though, the Nikkei really the outperformer, that index up 2.2%. The Japanese managed to get more instructions from the US on the trade deal front by the US agreeing to no tariffs stocking also strong earnings from SoftBank driving some of the performance there as well. But coming up, we're going to be talking more about markets with Ozanne, Oscar, all the founder and managing partner at Toronto Capital Partners. That's next. This is Bloomberg. Good morning. This is Horizon, the Middle East and Africa. Our top stories this morning. Israel's security cabinet approves Prime Minister Benjamin Netanyahu's plans to take full control of Gaza City. President Trump nominated Steven Miron to temporarily fill Adriana Kugler seats on the Fed board. Meanwhile, Christopher Waller is the leading choice amongst Trump's advisors at the next chair. Plus, Japan's top trade negotiator says the U.S. has confirmed it will end stacking of universal tariffs on Tokyo and cut car levies as promised. It has just gone. 8:30 a.m.. Across the emirates. You want to Versace in Dubai at the end of the week? We saw Wall Street dipping over towards the close yesterday, today. S & P futures leaning towards a green, up 2/10 of a percent for the week. As a whole, though, the S & P is basically flat. So that tells you that huge rally we've seen since April up north of 30% perhaps is losing a bit of steam here, a bit of momentum running out. We've got ten year yields also in focus, a weak 30 year auction yesterday. So it was two back to back auctions and the yields and fixed income space that have disappointed are come on the weak side and tells you again perhaps about valuations and how how much we've moved lower over the course of the past week especially since that jobs figure came through exactly a week ago on Friday burn sitting at $66, another week week for the energy complex, with energy down around 4% over the course of the last few days. Concerns there about the demand outlook and also the potential for a supply glut as we head into the fourth quarter. And then gold also in focus. COMEX gold futures spiked after this report emerged suggesting that the Trump administration are thinking of applying tariffs on gold exported from Switzerland's one kilogram bars. So that again, it's quite significant for the gold COMEX futures markets. It's something we're keeping a track on an eye on this morning. All right. But in Japan, there's been some developments that Tokyo's top trade negotiator, Rio Kurzawa, says the US will end stocking of universal tariffs on Japan and cut car levies as promised. For more, let's bring in our news editor Jill says Jill. Well, tariffs were supposed to have gone into effect yesterday and technically they did, but the negotiations are still going on. So there's still countries around the world extracting concessions from the US, the latest being Japan overnight. So what do we know about what was agreed to with the US? Yes. Shimano Well, I'd say that this points perfectly to that adage of you really want to get things in writing for it to be official here. I mean, I think the confusion over what's happened with Japan stems from this idea that the trade agreement that, you know, we were all familiar with when Japan supposedly reached this, you know, sort of deal with the United States ahead of that deadline, was that their tariffs, they would have a 15% tariff. And Japan was certainly under the impression that that would apply to all of their goods. And then it would also apply to autos companies, which is is an auto exports, which is huge because, you know, that stands in contrast to this other sectorial tariff that the Trump administration has applied on. Our exports are hitting 25%. So it looks like when the tariff deadline finally rolled over and, you know, we hit this point where they were supposed to have the 15%. Japan woke up and with this very rude awakening, which is that, you know, not only were they dealing with particularly high auto sector tariffs, but then they also had tariffs of not just 15%, but these tariffs that had actually stacked on some pre-existing levies. And so it does seem like there was, you know, a miscommunication here. So the trade negotiator for Japan was our he says he spoke to the US and that, you know, they've agreed to lower those tariffs. I think the timeline is still a bit fuzzy there. But again, I think what this really does point to, Jomana, is that for a lot of these trade agreements that a lot of nations have reached with the United States. So a lot of this has been said verbally. Maybe we've gotten a statement from Trump or, you know, from the country itself. Maybe we've got, you know, different, you know, bits and pieces from various officials here. But a lot of this stuff still hasn't kind of been contained in this, you know, like a white paper or some kind of official document like that. And I think, you know, the last thing I'll say is that it really just kind of the complexity of a lot of these trade deals. I mean, a lot of this takes years to develop. We're trying to get all of this done in a matter of months. And I think it does, you know, kind of you see how this leads to some confusion like this. Yeah. Yeah. I mean, at the end of the day, a lot of these are just verbal agreements as opposed to being fully signed, sealed, signed, sealed and delivered. So that takes months that Bloomberg still says, thank you so much. Now, President Trump says he has chosen Council of Economic Advisors Chairman Steven Miron to serve as a Federal Reserve governor. Meanwhile, Bloomberg has learned that Fed Governor Christopher Waller is emerging as a top candidate to succeed Jay Powell as the central bank's chair. Joining us now is also an Oscar managing partner of of Capital Partners. Good to chat. Well, I don't think it's a surprise that President Trump is moving to put in these more dovish voices on the Fed, either for the replacement for Adriano Kugler on a temporary basis or the eventual replacement or successor to the Fed chair, Jerome Powell. But I think what may be alarming to investors is in the case of Steven Miron, he's he was one of the main architects of Trump's tariff policy. He was one of the minds behind the Mar a Lago accords calling for a systematically weaker USD. What knock on effects is this going to have for investors looking at the US market? Good morning, Jim. I think it's fair to start with a broader comment saying that we are in a moment of profound recalibration around the markets. The traditional playbook that we used to play with, it's no longer applies. This is very much a world of multi-speed economies and multidimensional risks, including risks of monetary and fiscal policy within the US. So investors, I think, are getting used to the notion that the old playbook is out and the new one is in. Well, of course, this could mean for the message is that we're going to witness a Fed acting in a more, I guess, pronounced manner. But that's not really a shock. I think what we really will understand or wait to understand is when the markets are going to really focus or start focusing on the real risks behind all of this, which really is not within the financial markets, to be honest with you, because the financial markets seem to have become more or less comfortable in pricing in the volatility coming from the Trump administration. But corporate boards, especially for manufacturers looking to invest, the delaying of the investments that laying off the CapEx is going to be the one area that I think we're going to have to discuss much more often and in detail going forward. Yeah. Do you think they're going to be questions about institutional governance perhaps in the US and the fact that a week ago we had this week jobs report, Trump then moved to fire the BLS commissioner. What implications does that have really on the sanctity of the data collection that's taking place in the US? I think that's a great question and I think we'll have to wait a little longer to understand whether this was just a one off or whether this signals a more profound shift towards a different way of the sanctity of data management. You know, obviously, the headline doesn't look so great, but one thing doesn't really make a systematic change. Ultimately, we are still talking about the US markets where the systems and checks and balances, relatively speaking, are still one of the world's top kind of systems, if you will. So I wouldn't really read too much into it at the moment, but of course we have to watch the spotlight. I want to bring it back to something you said about CapEx spending. This has been a really interesting earnings season for some of the big tech companies because they've come out with these huge numbers of CapEx funds to help build out their infrastructure business. And I wonder whether at some point investors are going to start questioning when the point of monetization is actually going to arrive because the numbers are huge. And even this morning you have the likes of Matsepe bringing on Blue Owl and PIMCO to help fund some of those aspirations. Is that something you're watching out for as well in the coming year? I mean, look, I am watching out for this, although I am this worried about the gap expanding because the reality is that our life is changing so fast and Asia is going to become and is already a fundamental part of how we are going to live, how we're going to conduct our businesses, our lives. So it's not as if this CapEx spending is being done for a project that may become credible in the future is very much feel and this would very much dictate the future humanity. But I have to say this, in looking at the markets overall, the next 12 months won't really be defined by forecasts as much as they'll be defined by adaptability. And for investors and for policymakers, for firms alike. Looking at resilience doesn't necessarily have to come from conviction per se, but from agility. So I think we're going to have to look at much more closely at what all of this change really means for the feasibility of the business models across sectors. In this Brave new Worlds model. Well, then. Thank you so much. Oh, that was Carol. Managing partner of Tons of Capital Partners. Thank you for getting up early for us as well. Oh, Zimbabwe and the UK are rekindling diplomatic ties after almost three decades of tensions. And at the heart of the reset is the race for critical minerals. For more, we're joined by Bloomberg's Randal OVO and pull away in Zimbabwe. Ray, just talk to us about why you can't. Zimbabwe are seeking to end a nearly three decades old rift. Good morning, Jomana. Yes, So surprise, surprise. Zimbabwe and the U.K. are working on the relationship, particularly the main driver is trade and critical minerals. That's really at the heart of this new found rapport between the two countries. For almost 30 years, there's been this diplomatic rift that has been there. But as we saw earlier this year, in June, a visit by the minister of Africa from the U.K., Lord Ray Collins met with President Emmerson Mnangagwa, the Zimbabwean president, and really working to try and, as he put it, come up with a win win solution for the two countries. So that really signaled this thaw that we're seeing in relations between the two countries and critical minerals, which Zimbabwe has is really quite at the center of front and center of this new friendship that is being rebuilt. And how is Zimbabwe attempting to reset relations and also somehow benefit from this shift in the global world order? We were just speaking about it with our prior guests, these new geopolitical alignments. Yes. So Zimbabwe is definitely seeking to tap this new global shift that's taking place, particularly because it's a mineral rich country and it is, you know, a country that has to be on the radar of global powers that are seeking to access critical minerals and is seeking to make sure that they have uninterrupted supply. So particularly Zimbabwe, for example, is Africa's biggest lithium producer. So they are, you know, pushing themselves and saying, look, we've got the resources and we can offer you these resources that you need. And it's really it's sort of like the conversation where they're saying, we can offer you this and the next change we would like, you know, to be brought back into the international community because we've been isolated for so many years and they are looking to come back into that family of nations and come back into the global order. So they're leveraging on that and critical minerals as part of their strategy. And we saw at the end of last month the launch of what they call an economic diplomacy policy, where basically, you know, the resources, the natural resources are going to be, you know, the select and going to be primed in foreign relations. And that's something that certainly seems to be the strategy going forward for Zimbabwe. And they will be, you know, positioning their minerals and offering them to different global power, looking for resources. Yep. At Bloomberg's rate and level. Thank you so much for the report there and sticking to the continent. So coming up, Ivory Coast leadership celebrate the 65th anniversary of the nation's independence, but there are underlying political tensions. Details next. This is Bloomberg. Welcome back to Horizon's Middle East and Africa on June one, two Versace in Dubai. Well, I want to bring you up to speed on a corporate story that we've been following closely the last 12 hours or so. Remember? Yesterday, Trump wrote on his social post that the CEO of Intel is highly conflicted and must resign immediately. This is after some concerns were raised by the Republican Senator Tom Cotton, questioning the Intel's CEO about the ties to China, including investments in the country's semiconductor companies. Well, we've just got a statement from the Intel CEO himself and he's saying there has been misinformation circulating about past roles. I want to be absolutely clear. Over 40 years plus in the industry, I've built relationships around the world and across our diverse ecosystem. And I have always operated within the highest legal and ethical standards. My reputation has been built on trust and doing what I say I'll do and doing it the right way. This is the same way I'm leading Intel. This is a statement that he has just put out. He then goes on to say that they are engaging with the administration to address some of the matters raised, and the board is fully supportive of the work we are doing. So this is in reaction to the president taking direct aim at a CEO of a blue chip American company, the CEO. Now, just a few minutes ago, responding to it and putting out this statement and just reiterating that there has been misinformation circulating about his past roles. Now, the Ivory Coast has marked the country's 65th independence anniversary with a military parade through the central city of BOAC. The celebration was largely off limits to the public as tensions simmer in the West African nation ahead of presidential elections due in October. Our chief Africa correspondent general joins us now. John, just get us up to speed and give us some context behind the latest round of of civil unrest in Ivory Coast. Jomana, we have been watching quite closely at the Ivory Coast because they do have elections later this year. And what's really come to a head over the past few days is we did hear from President Alassane Ouattara suggesting or telling the public that he does plan to seek a fourth term. Now, under Ivorian law, presidents are technically only supposed to be in office for two terms. And so you can imagine why there is now tension. But it's not just that. We've also seen a number of those who had wanted to at least run for office, including former Credit Suisse executive Tidjane Thiam, actually being barred from the voter role and so many voters within the Ivory Coast. And investors alike are watching this country and wondering what this all means for stability in this economy. That is the second biggest economy in West Africa. It's been an example of stability within the region. It's the second biggest cocoa or it's the biggest cocoa producer in the world. And really what this means for tensions moving in to the election. It also evokes a bit of concern for people who have seen previous elections that have become or turned a bit violent in the past. People don't want to see a repeat of that. So you were just showing in the intro there the Independence Day celebrations yesterday. And some of the opposition groups, including Tidjane Thiam Party, had planned initially to have a protest earlier this week to express their opinion and their frustration with being barred from the voter roll. The government actually banned them from this protest, but this weekend we are expecting some of these political parties to come out and continue to express their frustration in what they see as an unfair situation leading up to the election later in the year. Yet you mentioned the relative stability of the Ivory Coast economy and the fact that it is the world's largest coca exporter, which, by the way, leads us nicely to our next segment That's coming up. But how could all of this political backdrop impact the country economically? It's very much a concern. I mean, if you take a look at some of the stats from the World Bank, which we did, it has been the fastest growing economy across the African continent. If you just take a look at the growth rate over the past ten or so years, we've seen the economy growing at an average of 8.2%. That is significant if you compare it to some of the other economies across the continent. And of course, there's cocoa prices. Right now, we're taking a look at some of the cocoa farming. We've seen prices really fluctuate over the past few months and years. This is expected to be a relatively stable and potentially beneficial season for cocoa growers. But if we do see instability, what does that then mean for this country that has for for years relied on on this export and not just that many people are wondering what. Does this mean for investment? As I mentioned many times, I was in the Ivory Coast earlier this year. There is quite a bit of development going on. There's been a lot of investment that has gone into this country. So many people are wondering, could this potentially concern people about putting investment into the country if we don't see stability? And not just that. Finally, Jomana, it is this idea of regional stability. If you take a look at some of the neighboring countries, there has been quite a bit of instability. Ivory Coast has been an example of that. So many eyes are watching what happens and how this develops over the next few months. Jen, thank you so much. Jennifer Sabotage, our chief Africa correspondent in Johannesburg. And for more stories like this from the continent, be sure to subscribe to the next Africa newsletter on the terminal and our website. You can also get these in audio formats on our weekly podcast available on Apple, Spotify, and wherever you get your podcasts. And for a deeper dive, catch our TV show next. Africa airing on TV on the last Friday of every month. You can still watch our previous episodes in full on your terminal, our website and on YouTube. And coming up, a bitter reality for Nutella and chocolate lovers. Your favorite treat might have fewer hazelnuts. The details next. This is Bloomberg. Well, it's a bit of reality, everybody. The world's biggest hazelnut crop is set to slump, spelling more bad news for chocolate lovers. The harvest in Turkey is projected to fall by more than a third after the worst spring frost in years. Let's go out to Bloomberg's Patrick Sykes in Istanbul. Patrick, what has gone wrong with Turkey's harvest for hazelnuts if it's not an export? It is well known for a goat, but it is indeed the world's biggest producer of hazelnuts. Most of that, of course, gets exported, put into chocolates that we all know and love. But a spring frost back in April, just as the plants were expecting warmer weather has meant a lot of them died or suffered damage. And just yesterday, the state grain board came out with this latest projection for the harvest this year, saying it's going to be one third down on last year. And it's also going to be increasing the price it pays to farmers by about 50%. So supplies going down and prices going up in the world's biggest marketplace. And hazelnuts. What does this mean for some of the biggest chocolatiers in the world as well as and I count myself amongst one of these Nutella fans, are we going to have to deal with slightly higher prices or is there going to be, you know, some impact on the amount of supply of this Nutella that will be available to us? Yes, it's bad timing for them, in short, but they're already dealing with a similar problem, whether induced supply problems in cocoa and multiyear high prices in that market. We're just hearing about the Ivory Coast. In your previous segment, we spoke to one confectionery company here that said as a result of the higher hazelnut prices, it's been cutting down the amount that it puts into its bars, sometimes cutting it out altogether. We've seen as well just the cocoa. You know, some companies like Hershey's that we all know passing those costs onto consumers. And the bad news is it could yet get worse. The grain board, when it released those latest projections yesterday, it also said, look, we're at the very start of the harvest now. This is an optimistic projection that harvest is going to continue usually until around the end of September. So that's good for that supply problem to get even worse still. Okay. It's not looking good in the hazelnut world that Bloomberg's Patrick Sykes in Istanbul, thank you so much for that report. Again, as you say, not something you would typically associate with Turkey, but to round up the week and the segment on that. No. All right. Let's talk about how equity markets are faring. Final day of the week, S & P trading sideways for the week. But here we are. It is a sea of green out there. S & P futures up 2/10 of a percent. Europe markets up a similar amount. And that just on an admin note. I'll be out the next couple of weeks, but my colleague Lizzie Borden will be filling in for me next week. That is it for her swing, at least in Africa.",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Roundup"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Africa"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.82177734375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.685546875
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.63037109375
    },
    {
      "name": "/News/World News",
      "score": 0.49609375
    },
    {
      "name": "/People & Society/Other",
      "score": 0.414794921875
    }
  ],
  "sentiment": {
    "positive": 0.05734253,
    "negative": 0.7470703,
    "neutral": 0.19604492
  },
  "summary": "Israel's security cabinet approves Prime Minister Benjamin Netanyahu's plans to take full control of Gaza City. The move is seen as a final push to topple Hamas and govern the region properly. President Trump has nominated Steven Miron to temporarily fill Adriana Kugler's seat on the Fed board, while Christopher Waller is considered the leading choice for the next chair. Japan's top trade negotiator, meanwhile, reports that the US has confirmed it will end stacking of universal tariffs on Tokyo and cut car levies as promised. Meanwhile, the US government is not looking to place tariffs on imports of one kilogram gold bars from Switzerland. The impact of these tariffs on global growth and the bonds outlook is also on the bond market. However, a weak ten year auction, 30 year auction has led to less interest from the international community to buy Brent.",
  "shortSummary": "Despite a mixed week in Middle East and Africa, key economic announcements from the US, Japan, and China, and a potential Fed rate cut, boosting investor sentiment.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "a48ffeb6dc604fa5ac82f5f728863e06",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Israel's security cabinet has approved Prime Minister Netanyahu's plan for full control of Gaza City, aiming to eliminate Hamas amid ongoing conflict. In U.S. economic news, President Trump has nominated Steven Miron as a temporary Federal Reserve governor, while Christopher Waller is favored to succeed Jerome Powell as chair. Additionally, Japan has secured a concession from the U.S. regarding tariffs, which is expected to positively impact its markets.",
  "argos_id": "QSFMYYBW7"
}