{
  "url": "https://www.forbes.com/sites/danschlossberg/2025/08/08/with-revenue-up-but-spending-down-braves-fans-wonder-why/",
  "authorsByline": "Dan Schlossberg",
  "articleId": "92b7bec8fb634d5697405b2c4734be98",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/683771b9147688fe7e05419c/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T21:11:43+00:00",
  "addDate": "2025-08-08T21:14:32.167311+00:00",
  "refreshDate": "2025-08-08T21:14:32.167313+00:00",
  "score": 1.0,
  "title": "With Revenue Up But Spending Down, Braves Fans Wonder Why",
  "description": "Revenue is up but spending is down, aggravating Atlanta fans whose team won't reach the playoffs this year.",
  "content": "Even with revenue on the rise, spending is down – leaving the Atlanta Braves mired in a malaise that will keep them out of the playoffs for the first time in eight years.\n\nInjuries, illness, and ineptitude hit early and often in 2025, plunging the Braves south of .500 months ago and creating the prospect of a 100-loss season and cellar finish in the National League East.\n\nFor a team that started spring training with World Series hopes, the reality has a perfect example of Murphy’s Law: when something can go wrong, it will.\n\nAll five members of the original starting rotation have spent significant time on the injured list, former MVP Ronald Acuna, Jr. has missed chunks of the season after Achilles and calf injuries, and former All-Stars Matt Olson, Ozzie Albies, Austin Riley, Marcell Ozuna, and Jurickson Profar are caught in the fog of a team-wide hitting slump. Profar’s 80-game suspension for violating baseball’s ban on performance-enhancing substances (PEDs) didn’t help either.\n\nThe once-dependable bullpen has made a habit of blowing leads, including a 10-4, ninth-inning advantage against Arizona and an 11-3 margin over Cincinnati. The Braves often play just well enough to lose, piling up more one-run losses (28) than any team in the majors. That’s twice as many defeats as victories in games decided by a single run.\n\nYet fans keep buying tickets to games at suburban Truist Park, which is sold out for the rest of the season, and products at The Battery, a mixed-use recreational and entertainment complex adjacent to the eight-year-old ballpark. And revenue that resulted from the city’s third All-Star Game will be reported after the World Series.\n\nIt’s a pretty picture for the Braves financially but not artistically.\n\nBraves president and CEO Derek Schiller said that premium and regular season tickets are sold out for the rest of the year, as are most of the single-game hospitality spaces, which represent a significant portion of ticket revenues.\n\nThe team’s adjusted OIBDA (operating income before depreciation and amortization) for the second quarter — a key measure of a company’s profitability — had reached $65.7 million, up from $45.8 million in 2024.\n\nAccording to the Atlanta Journal-Constitution, sales of tickets, concessions, and sponsorships in the second quarter of 2025 rose 8% over the same stretch of the previous year ($287 million vs. $266 million), with a broadcast revenue rising to $81 million from $71 million in the wake of the team’s new rights agreement with the FanDuel Sports Network, which includes streaming rights.\n\nThe team also reached an over-the-air simulcast deal with Gray Network. The two broadcast deals yielded a 14% hike in broadcast revenue, which jumped from $70.95 million to $81 million.\n\nIncome from the team-owned Battery was also up, rising 49 per cent from April through June of this year, according to a quarterly filing from the publicly-owned team. Spurred by the addition of Pennant Park, a six-building office complex, the Battery produced $25.1 million, including an $8 million hike in rental revenue.\n\nThe team spent $93.7 million to acquire real estate assets during the second quarter, reported Mike Plant, president and CEO of Braves Development, and is actively looking for more.\n\nBut acquiring players – both new talent that could improve the roster and replacements for injured incumbents – has not helped curtail the free-fall that began when the team lost all seven games of its season-opening road trip to San Diego and Los Angeles.\n\nWary of baseball’s payroll tax, baseball operations chief Alex Anthopoulos signed only one free agent – Profar – last winter (three years at $142 million) and failed to pull the trigger on any major deals before the July 31 trade deadline.\n\nAs a result, the Braves opened this weekend fourth in the National League East with a 48-66 record that left them 17 games out of first place, 8 out of third, and only 2 ahead of last-place Washington.\n\nFor a team that ranks ninth in payroll at $213 million, according to Roster Resource, that is a poor return on investment.\n\nAccording to Spotrac, it was $206 million, 10th among the 30 teams, in 2023. After that year’s team hit 307 home runs to tie a major-league record, the payroll rose to $238 million, placing sixth. But it fell to $214 million, rated ninth, this year – marking the first time the payroll dropped in an uninterrupted season since 2016.\n\nThe loss of three Braves icons through free agency hasn’t helped. First baseman Freddie Freeman fled during 2021 spring training, shortstop Dansby Swanson departed a year later, and pitcher Max Fried took his valuable left arm to the Yankees last winter. Only Olson, who hit a club-record 54 home runs in 2023, has been a solid replacement.\n\nThis fall, free agency could claim the slugging Ozuna, whose performance was impacted by a slow-healing hip injury, and closer Raisel Iglesias, whose first half was marked by a tendency to throw too many pitches that disappeared over distant fences.\n\nBut the team looks forward to November, when the financial impact of All-Star Week will be announced. Terry McGuirk, president & CEO of Braves Holdings, noted that some 250,000 people visited businesses in The Battery while more than 137,000 tickets were sold for various events at Truist Park, including The Futures Game, Home Run Derby, and a celebrity softball game.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Braves Fans",
      "weight": 0.062719174
    },
    {
      "name": "Braves Holdings",
      "weight": 0.062252093
    },
    {
      "name": "Braves Development",
      "weight": 0.06203977
    },
    {
      "name": "ticket revenues",
      "weight": 0.061812
    },
    {
      "name": "year",
      "weight": 0.061712828
    },
    {
      "name": "Braves",
      "weight": 0.061351053
    },
    {
      "name": "games",
      "weight": 0.05484246
    },
    {
      "name": "All-Star Game",
      "weight": 0.053121775
    },
    {
      "name": "broadcast revenue",
      "weight": 0.052776713
    },
    {
      "name": "first place",
      "weight": 0.04944388
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9677734375
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.9404296875
    }
  ],
  "sentiment": {
    "positive": 0.055603027,
    "negative": 0.82666016,
    "neutral": 0.11791992
  },
  "summary": "The Atlanta Braves are facing a season that will see them out of the playoffs for the first time in eight years. Injuries, illness, and ineptitude have plagued the team, leading to a potential 100-loss season and a cellar finish in the National League East. The team's revenue has increased despite decreased spending, with a new rights agreement with FanDuel Sports Network and an over-the-air simulcast deal with Gray Network resulting in a 14% increase in broadcast revenue. Despite this, fans continue to buy tickets to games at Truist Park and The Battery, which are sold out for the rest of the season. Despite a decrease in player spending, the team's payroll has dropped to $214 million, making it 10th among the 30 teams in the league.",
  "shortSummary": "The Atlanta Braves face a season of injuries, financial struggles, and a potential 100-loss finish in the National League East, despite rising revenue and investments.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "adef2f955b0a48f09a2e4395493933d6",
  "places": [
    {
      "osmId": "9051237",
      "road": "Battery Avenue Southeast",
      "county": "Cobb County",
      "state": "Georgia",
      "postcode": "30339",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "The Battery Atlanta",
      "coordinates": {
        "lat": 33.89070855,
        "lon": -84.46853422885837
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "The Atlanta Braves are experiencing a disappointing 2025 season, currently sitting below .500 and facing the possibility of a 100-loss season, despite rising revenues. Key players have been plagued by injuries and a team-wide hitting slump, contributing to their struggles, including a record number of one-run losses. Financially, the team is thriving with increased ticket sales and broadcast revenue, but their performance on the field has not matched their financial success, leading to concerns about their future roster and management decisions.",
  "argos_id": "QSO14BV5Q"
}