{
  "url": "https://seekingalpha.com/article/4811503-tucows-inc-tcx-q2-2025-earnings-call-transcript",
  "authorsByline": "SA Transcripts",
  "articleId": "9c4974dbf76e4950ad3c4ebb377b7519",
  "source": {
    "domain": "seekingalpha.com",
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T21:50:40+00:00",
  "addDate": "2025-08-08T21:53:43.850807+00:00",
  "refreshDate": "2025-08-08T21:53:43.850809+00:00",
  "score": 1.0,
  "title": "Tucows Inc. (TCX) Q2 2025 Earnings Call Transcript",
  "description": "Tucows Inc. (NASDAQ:TCX) Q2 2025 Earnings Conference Call August 7, 2025 5:05 PM ETCompany ParticipantsDavid Woroch - Chief Executive Officer of Tucows...",
  "content": "Welcome to Tucows Second Quarter 2025 Management Commentary. We have prerecorded prepared remarks regarding the quarter and outlook for the company. A Tucows generated transcript of these remarks with relevant links is also available on the company's website.\n\nWe will begin with opening marks from Elliott Noss, President and CEO of Tucows Inc., followed by business remarks from David Woroch, CEO of Tucows Inc.; Justin Reilly, CEO of Wavelo; Elliot Noss on Ting; Ivan Ivanov, Tucows' CFO, who will discuss our financial results in detail, and we will finish with closing remarks from Elliot Noss.\n\nIn lieu of a live question-and-answer period following these remarks, shareholders, analysts and prospective investors are invited to submit questions to Tucows management. Please send the questions by e-mail to ir@tucows.com until Thursday, August 14, management will either address your questions directly or provide a recorded audio response and transcript that will be posted to the Tucows website on Tuesday, August 26, at approximately 5:00 p.m. Eastern Time. We would also like to advise that the updated investor presentation and the Tucows quarterly KPI summary, which provides key metrics for all of our businesses for the last 6 quarters as well as for full year 2023, 2024 and 2025 year-to-date, and also includes historical financial results is available in the Investors section of the website.\n\nYou'll notice that we are no longer adding new owned serviceable addresses and instead, partner serviceable addresses are seeing large additions. As we monetize owned fiber network assets in certain markets, you will see some",
  "medium": "Article",
  "links": [
    "https://seekingalpha.com/symbol/TCX"
  ],
  "labels": [
    {
      "name": "Non-news"
    },
    {
      "name": "Opinion"
    },
    {
      "name": "Roundup"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Tucows Inc.",
      "weight": 0.11714035
    },
    {
      "name": "Tucows management",
      "weight": 0.11633364
    },
    {
      "name": "Tucows",
      "weight": 0.10769047
    },
    {
      "name": "business remarks",
      "weight": 0.09998985
    },
    {
      "name": "closing remarks",
      "weight": 0.093077175
    },
    {
      "name": "prerecorded prepared remarks",
      "weight": 0.09155351
    },
    {
      "name": "new owned serviceable addresses",
      "weight": 0.08960018
    },
    {
      "name": "owned fiber network assets",
      "weight": 0.08464184
    },
    {
      "name": "historical financial results",
      "weight": 0.08068654
    },
    {
      "name": "Elliot Noss",
      "weight": 0.078206934
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Earnings Calls"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.99609375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9658203125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.95703125
    }
  ],
  "sentiment": {
    "positive": 0.26513672,
    "negative": 0.057800293,
    "neutral": 0.6772461
  },
  "summary": "Tucows Inc. (TCX) is set to hold its second Q2 2025 Management Commentary, with prerecorded remarks and a transcript of these remarks available on the company's website. Elliott Noss, President and CEO of Tucows Inc., David Woroch, Justin Reilly, CEO of Wavelo, Elliot Noss on Ting, Ivan Ivanov on the CFO, and closing remarks will be made by Elliot NOSS. In lieu of a live question-and-answer period, shareholders, analysts, and prospective investors are invited to submit their questions to management via email or recorded audio response and transcript. The updated investor presentation and the quarterly KPI summary are also available in the Investors section of the website.",
  "shortSummary": "Tucows Inc. Q2 2025 management commentary includes remarks by Elliott Noss, David Woroch, and Ivan Ivanov, with relevant links available on the company's website.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2cf211c79b824f21a1b8e0fea928ff4b",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Tucows' Second Quarter 2025 Management Commentary includes remarks from key executives, detailing the company's performance and future outlook. The session features insights from CEO Elliott Noss and other leaders, with a focus on financial results and business strategies. Shareholders and analysts are encouraged to submit questions via email, with responses to be provided later. Additionally, updated investor presentations and key performance indicators are available on the Tucows website.",
  "argos_id": "QZR6TOQ23"
}