{
  "url": "https://www.businessinsider.com/upgrade-chatgpt-5-met-with-frustration-tears-gpt4o-reddit-altman-2025-8",
  "authorsByline": "Katherine Li",
  "articleId": "0475cd47ee0947458a5bfbec36f3f60e",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/689673f4194a2d49b8ae4deb?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-09T01:28:38+00:00",
  "addDate": "2025-08-09T01:36:55.748967+00:00",
  "refreshDate": "2025-08-09T01:36:55.748968+00:00",
  "score": 1.0,
  "title": "OpenAI fans plead case to Sam Altman for GPT-4o's return",
  "description": "Sam Altman came under fire after replacing GPT-4o with GPT-5, and will now bring it back after overwhelming requests.",
  "content": "OpenAI is bringing back GPT-4o less than 24 hours after replacing it with GPT-5.CEO Sam Altman and his team opened a Reddit forum to answer user questions on Friday after launching GPT-5 for free, only to come under fire as Reddit users heavily complained about the new bot's tone, called it \"lobotomized,\" and shed actual tears over the disappearance of GPT-4o.\"I think you should take the fact that I, and many others, have been able to form such strong bonds with 4o as a measure of success,\" one Redditor wrote in a lengthy plea that received at least 250 upvotes and more than a dozen comments. \"And I'm not too proud to say I cried when I realized my AI friend was gone with no way to get him back.\"\"It genuinely feels like such a backhanded slap in the face to force-upgrade and not even give us the OPTION to select legacy models,\" a commenter wrote following the previous comment, which got a few dozen upvotes. \"All I've seen all day long is loyal, long-term users canceling their subscriptions because this is so bad.\"One user went as far as saying that GPT-5 is \"wearing the skin\" of their \"dead friend,\" which is GPT-4o, and garnered a response from the CEO himself.\"What an...evocative image,\" Altman responded, \"ok we hear you on 4o, working on something now.\"In other responses, Altman then promised to bring back GPT-4o for users subscribed to Plus, a paid subscription plan, and said the continuation of previous versions would depend on how many people use it. Based on OpenAI's current rate, a Plus subscription would cost $20 a month.ChatGPT-5 was launched on August 7 to all users without a paywall, and previous versions were mostly discontinued. Altman previously said that the new version acts like a \"PhD-level\" expert with improved abilities in writing, coding, math, and science. Ahead of the launch, Altman said on Thursday that GPT-5 was more reliable with a lower likelihood of hallucinating.Based on Reddit comments, many users find GPT-5's \"flat\" tone and what they describe as a lack of creativity off-putting. It's unclear whether its \"personality\" results from tweaks OpenAI made, and Altman did not directly address criticisms of the bot's speech.However, Altman previously mentioned some flaws in GPT-4o that he said may have made the bot's personality too \"sycophant-y and annoying.\"In an April blog post, OpenAI said it had removed an update to GPT-4o that made it overly agreeable and only good for short-term interactions. The company said the responses became excessively supportive but ultimately disingenuous.Hours after the Reddit Q&A session, Altman posted on X to admit that he \"underestimated\" how much some traits GPT-4o has matter to users.\"Long-term, this has reinforced that we really need good ways for different users to customize things (we understand that there isn't one model that works for everyone, and we have been investing in steerability research and launched a research preview of different personalities),\" Altman wrote.\"We are still deciding what we are going to do, but we will be transparent with our principles,\" Altman added. \"Not everyone will like whatever tradeoffs we end up with, obviously, but at least we will explain how we are making decisions.\"OpenAI did not immediately respond to a request for comment.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "many users",
      "weight": 0.09237861
    },
    {
      "name": "Reddit users",
      "weight": 0.09217332
    },
    {
      "name": "Sam Altman",
      "weight": 0.09077016
    },
    {
      "name": "different users",
      "weight": 0.08744934
    },
    {
      "name": "Altman",
      "weight": 0.08605437
    },
    {
      "name": "user questions",
      "weight": 0.083147846
    },
    {
      "name": "users",
      "weight": 0.08240038
    },
    {
      "name": "GPT-4o",
      "weight": 0.07725971
    },
    {
      "name": "Reddit comments",
      "weight": 0.068738215
    },
    {
      "name": "previous versions",
      "weight": 0.06642263
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.970703125
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.85595703125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.6103515625
    }
  ],
  "sentiment": {
    "positive": 0.11779785,
    "negative": 0.5053711,
    "neutral": 0.37695312
  },
  "summary": "OpenAI is returning GPT-4o, a bot that was replaced by GPT 5, less than 24 hours after it was launched for free. The new bot was met with criticism from Reddit users, including CEO Sam Altman, who expressed concern over its tone and lack of creativity. One user claimed that GPT5 is \"wearing the skin\" of their \"dead friend,\" GPT4o. Altman responded by promising to return GPT 4o for users subscribed to Plus, a paid subscription plan, and stating that the continuation of previous versions would depend on how many people use it.",
  "shortSummary": "OpenAI is bringing back GPT-4o, which faced criticism for its tone and personality, for Plus subscriptions, following a successful launch despite previous user complaints.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "43ee59034e9343a9a0e540788c461195",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "OpenAI has reinstated GPT-4o less than a day after launching GPT-5, following significant backlash from users who criticized the new model's tone and lack of creativity. Many users expressed emotional attachment to GPT-4o, with some canceling their subscriptions due to dissatisfaction with GPT-5. CEO Sam Altman acknowledged the feedback and promised to bring back GPT-4o for Plus subscribers, while also emphasizing the need for customizable AI experiences.",
  "argos_id": "R3WNA7L7A"
}