{
  "url": "https://www.forbes.com/sites/timlammers/2025/08/08/weapons-poised-to-upset-freakier-friday-at-weekend-box-office/",
  "authorsByline": "Tim Lammers",
  "articleId": "37a866423eb64a5d89448939c49bbcab",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/6896a7b630e8efe436c5bf71/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-09T01:56:56+00:00",
  "addDate": "2025-08-09T02:04:07.669322+00:00",
  "refreshDate": "2025-08-09T02:04:07.669324+00:00",
  "score": 1.0,
  "title": "‘Weapons’ Poised To Upset ‘Freakier Friday’ At Weekend Box Office",
  "description": "Julia Garner and Josh Brolin’s horror thriller “Weapons” is projected to upset Jamie Lee Curtis and Lindsay Lohan’s comedy “Freakier Friday” at the domestic box office this weekend.",
  "content": "Julia Garner and Josh Brolin’s horror thriller Weapons is projected to upset Jamie Lee Curtis and Lindsay Lohan’s comedy “Freakier Friday” at the domestic box office this weekend.\n\nBoth films are new in theaters this weekend and are delivering a one-two punch to The Fantastic Four: First Steps to knock the Disney-Marvel Studios film out of the No. 1 spot after two weeks.\n\nDirected by Barbarian filmmaker Zach Cregger, Weapons is projected by Deadline to make $38 million from 3,202 North American theaters though Sunday, with an estimated $17 million of that total coming from Friday’s box office — which includes $5.7 million in Thursday previews.\n\nMeanwhile, Freakier Friday — the long-awaited Disney sequel to the 2003 body switch comedy starring Curtis and Lohan as mother and daughter— is projected by Deadline to gross $30 million from 3,975 North American theaters.\n\nReleased by Warner Bros. subsidiary New Line Cinema, Weapons’ projected gross is surprising, especially since it's an R-rated film, which limits its potential audience.\n\nOn top of that, Weapons was projected to finish behind the PG-rated Freakier Friday by most top industry publications in its opening weekend.\n\nWhile Deadline had the films neck-and-neck with projections for each to open with $30 million in domestic ticket sales, The Hollywood Reporter forecast a $28 million opening for Freakier Friday and $25 million opening for Weapons.\n\nBox Office Pro, meanwhile, pegged a $35 million to $45 million opening frame for Freakier Friday and had Weapons coming in second with a projected take of $25 million to $30 million domestically.\n\nDeadline said Freakier Friday made $12 million on its opening day on Friday, including Thursday previews.\n\n‘The Fantastic Four: First Steps’ Slides To No. 3\n\nFollowing a disastrous 67% drop in business from its opening weekend to its second frame last week, Disney and Marvel Studios’ The Fantastic Four: First Steps is stumbling to the No. 3 spot on the domestic chart his weekend.\n\nAfter a $5 million Friday from 3,600 North American venues, Deadline is projecting a $16 million to $18 million third weekend for The Fantastic Four.\n\nIf the projection holds, it will up the film’s running domestic tally to $231 million to $233 million for the weekend.\n\nUniversal Studios and DreamWorks Animation’s animated adventure The Bad Guys 2 is projected by Deadline to earn $10.5 million from 3,860 North American theaters this weekend. If the forecast holds, it will bring the film’s running tally to $43.5 million.\n\nParamount Pictures’ reboot/sequel of the comedy film series The Naked Gun is projected by Deadline to earn $8.1 million in its second weekend from 3,363 locations.\n\nIf the projection holds, it will boost the Liam Neeson and Pamela Anderson action comedy’s running domestic tally to $32.4 million since the film’s Aug. 1 opening.\n\nNote: This box office report will be updated throughout the weekend with the most recent numbers as they become available. The final numbers for this weekend’s box office will be released on Monday.",
  "medium": "Article",
  "links": [
    "https://deadline.com/2025/08/weapons-freakier-friday-box-office-1236479522/#comments",
    "https://forbes.com/sites/timlammers/2025/08/08/freakier-friday-rotten-tomatoes-reviews-does-lightning-strike-twice/",
    "https://www.boxofficepro.com/weekend-preview-freakier-friday-looking-to-win-the-weekend/",
    "https://www.forbes.com/sites/timlammers/2025/08/06/why-is-wednesday-season-2-split-into-two-parts-the-creators-explain/",
    "https://www.forbes.com/sites/timlammers/2025/08/01/when-is-liam-neesons-the-naked-gun-coming-to-streaming/",
    "https://www.forbes.com/sites/timlammers/2025/08/06/projections-freakier-friday-to-flush-fantastic-four-at-weekend-box-office/",
    "https://www.forbes.com/sites/timlammers/2025/08/08/thunderbolts-ends-theatrical-run-how-much-money-did-it-lose/",
    "https://www.forbes.com/sites/timlammers/2025/08/06/wednesday-season-2-stars-on-working-with-tim-burton-and-jenna-ortega/",
    "https://www.hollywoodreporter.com/movies/movie-news/box-office-freakier-friday-and-weapons-1236338519/",
    "https://www.forbes.com/sites/timlammers/2025/08/08/when-is-horror-thriller-weapons-coming-to-streaming/",
    "https://www.forbes.com/sites/timlammers/2025/08/04/fantastic-four-final-weekend-box-office-worse-than-first-estimated/",
    "https://www.forbes.com/sites/timlammers/2025/08/04/why-does-anna-from-netflixs-my-oxford-year-look-so-familiar/",
    "https://deadline.com/2025/08/box-office-weapons-freakier-friday-1236482095/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Freakier Friday",
      "weight": 0.10496895
    },
    {
      "name": "Weekend Box Office",
      "weight": 0.102291115
    },
    {
      "name": "Friday",
      "weight": 0.08472405
    },
    {
      "name": "third weekend",
      "weight": 0.08440428
    },
    {
      "name": "weekend",
      "weight": 0.08355261
    },
    {
      "name": "Weapons",
      "weight": 0.073163174
    },
    {
      "name": "Freakier",
      "weight": 0.07223314
    },
    {
      "name": "domestic ticket sales",
      "weight": 0.070141286
    },
    {
      "name": "North American",
      "weight": 0.0670717
    },
    {
      "name": "Deadline",
      "weight": 0.06632175
    }
  ],
  "topics": [
    {
      "name": "Movies"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.97705078125
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.76806640625
    },
    {
      "name": "/Arts & Entertainment/Movies/Action & Adventure Films",
      "score": 0.6806640625
    },
    {
      "name": "/Arts & Entertainment/Movies/Science Fiction & Fantasy Films",
      "score": 0.462158203125
    }
  ],
  "sentiment": {
    "positive": 0.26953125,
    "negative": 0.3684082,
    "neutral": 0.3618164
  },
  "summary": "Julia Garner and Josh Brolin's horror thriller \"Weapons\" is predicted to upset \"Freakier Friday\" at the domestic box office this weekend. The film, directed by Zach Cregger, is projected to gross $38 million from 3,202 North American theaters, with an estimated $17 million from Friday's box office including $5.7 million in Thursday previews. Meanwhile, \"Freakedier Friday,\" the Disney sequel to the 2003 body switch comedy starring Curtis and Lohan, is predicted by Deadline to gross €30 million from theaters. Despite being an R-rated film, Weapons's projected gross is surprising due to its limited audience. Disney and Marvel Studios' \"The Fantastic Four: First Steps\" is expected to reach the No. 3 spot on the domestic chart after a 67% drop in business from its opening weekend to its second frame last week.",
  "shortSummary": "Julia Garner and Josh Brolin's horror thriller Weapons is projected to debut better than Freakier Friday at the domestic box office, boosting The Fantastic Four's run.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d7c865e6d21147ef9457432b70aaf501",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.forbes.com/sites/timlammers/2025/08/01/when-is-liam-neesons-the-naked-gun-coming-to-streaming/",
      "text": "The Naked Gun — Liam Neeson and Pamela Anderson’s reboot of Leslie Nielsen and Priscilla Presley's comedy classic — is new in theaters. How soon will it be before it comes to streaming?\nThe Naked Gun opens in theaters nationwide on Friday. The official logline for the film reads, “Only one man has the particular set of skills ... to lead Police Squad and save the world! Lt. Frank Drebin Jr. (Neeson) follows in his father's footsteps in The Naked Gun.\"\nThe film is directed by Akiva Schaffer (Saturday Night Live) and produced by Seth MacFarlane (Ted, Family Guy). The Naked Gun also stars Paul Walter Hauser, CCH Pounder, Kevin Durand, Cody Rhodes, Liza Koshy, Eddie Yu and Danny Huston.”\nIn the film, Frank Jr. thwarts a bank robbery that he learns is tied to a much larger conspiracy involving the mysterious death of a tech genius and is tied to the nefarious plans of tech billionaire Richard Cane (Huston). Anderson stars as Beth Davenport, the sister of the techie who suspects Caine is responsible for it. As such, Frank and Beth need to bust Cane before he can exact his evil plan and plunge the world into chaos.\nCurrently, the only way you can see The Naked Gun is in theaters, so check your local listings for showtimes.\nThe first stop for The Naked Gun in the home entertainment marketplace will be on digital streaming via premium video on demand. Typically, Paramount Pictures — which is the studio behind The Naked Gun — releases its films on PVOD about a month after they open in theaters.\nFor example, Gladiator II was released in theaters on Nov. 22, 2024, and made its PVOD debut about a month later on Dec. 24. In addition, Paramount’s Sonic the Hedgehog 3 debuted on PVOD on Jan. 21, about a month after its Dec. 20, 2024, theatrical release.\nMore recently, the action-comedy Novocaine arrived on PVOD on April 8, about three and a half weeks after it opened in theaters on March 14.\nSometimes, however, Paramount makes exceptions to its standard one-month theater to PVOD release window, specifically when it comes to its films starring Tom Cruise. As such, it will be a three-month theatrical to PVOD release for Mission: Impossible — The Final Reckoning, which is scheduled to make its digital debut on Aug. 19 after opening in theaters on May 23.\nIn all likelihood, The Naked Gun will follow Paramount Pictures’ one-month theatrical to PVOD release pattern, which means viewers can expect to buy or rent the film on digital on around Sept. 2, since most new releases on PVOD are on Tuesdays.\nWhich Streaming Service Will Get ‘The Naked Gun’ First?\nSince The Naked Gun is a Paramount Pictures release, the film will make its streaming video on demand debut on Paramount+.\nTypically, it takes about two months from the time Paramount’s films open in theaters before they arrive on Paramount+. For example, Gladiator II, which opened in theaters on Nov. 20, 2024, arrived on Paramount+ just over two months later, on Jan. 21.\nIn addition, Sonic the Hedgehog 3, which opened in theaters on Dec. 20, debuted on Paramount+ just under two months later, on Feb. 18.\nIf The Naked Gun follows the same two-month release pattern, it should arrive on Paramount+ on Sept. 30, since new Paramount Pictures releases tend to debut on the streaming platform on Tuesdays.\nRated PG-13, The Naked Gun opens in theaters nationwide on Friday."
    },
    {
      "url": "https://www.forbes.com/sites/timlammers/2025/08/08/when-is-horror-thriller-weapons-coming-to-streaming/",
      "text": "Weapons — a horror thriller starring Julia Garner and Josh Brolin — is new in theaters. When will the film be available to watch at home?\nWritten and directed by Zach Cregger (Barbarians), Weapons opens in theaters nationwide on Friday. The official logline for the movie reads, “When all but one child from the same class mysteriously vanish on the same night at exactly the same time, a community is left questioning who or what is behind their disappearance.”\nIn addition to Garner and Brolin, Weapons stars Alden Ehrenreich, Austin Abrams, Cary Christopher, Benedict Wong and Amy Madigan.\nThe only way currently that you can see Weapons is in theaters, so check your local listings for showtimes.\nThe first place Weapons will be available in the home entertainment marketplace will be digital streaming via premium video on demand. Warner Bros./New Line Cinema, which is the studio that produced Weapons, typically releases their new titles on PVOD a month to six weeks after they debut in theaters.\nFor example, Warner Bros./New Line’s horror hit Final Destination Bloodlines arrived on PVOD on June 17, just over a month after it opened in theaters on May 16.\nHowever, two other recent Warner Bros. releases took a bit longer to debut on PVOD. A Minecraft Movie arrived on PVOD on May 13, about six weeks after it opened in theaters on April 4. In addition, Sinners, which made its PVOD debut on June 3, opened in theaters about six weeks earlier on April 18.\nIf Weapons follows the same pattern as the titles listed above, then it should be available for purchase or rent on PVOD sometime between Sept. 9 and Sept. 23, since new movies on digital typically are released on Tuesdays.\nWhich Streaming Service Will Get ‘Weapons’ First?\nSince Weapons is a Warner Bros./New Line Cinema release, the first place the film will be available on streaming video on demand will be Warner Bros. Discovery’s HBO Max streaming platform.\nRecently re-branded to its original name, HBO Max from Max, the streaming platform has an ad-based option for $9.99 per month, an ad-free option for $16.99 per month and an ad-free option with 4K Ultra HD Programming for $20.99 per month.\nWhile it took Warner Bros.’ blockbuster Beetlejuice Beetlejuice about three months to arrive on HBO Max after its release in theaters, more recently, the studio is releasing its films on SVOD on the streaming platform a bit quicker.\nFor example, A Minecraft Movie arrived on the streaming service on June 20, about 2 1/2 months after release in theaters on April 4; while Sinners debuted on HBO Max on July 4, about 2 1/2 months after its April 18 release.\nMost recently, Final Destination Bloodlines arrived on HBO Max on Aug. 1, about 2 1/2 months after its premiere in theaters.\nIf Weapons follows the same release pattern, then viewers can expect the film to arrive on HBO about Nov. 21, since new films typically arrive on SVOD on the platform on Fridays.\nRated R, Weapons opens Friday in theaters nationwide."
    },
    {
      "url": "https://www.forbes.com/sites/timlammers/2025/08/04/fantastic-four-final-weekend-box-office-worse-than-first-estimated/",
      "text": "The Fantastic Four: First Steps’ final box office numbers for its second frame ended up being even lower than its already disastrous projected take.\nOn Sunday, the likes of Deadline, Variety and The Hollywood Reporter all projected that the film would earn $40 million domestically in its second Friday to Sunday frame, a 66% drop from its first weekend of $115.6 million in business from July 25-27.\nAs it turns out, even those estimates were a bit too generous. Box office trackers The Numbers and Box Office Mojo both reported the final weekend numbers on Monday for The Fantastic Four: First Steps, and the film ended up earning $38.6 million from Aug. 1-3, which is a 67% drop in business.\nTo date, The Numbers and Box Office Mojo reported, The Fantastic Four: First Steps has earned $197.1 million domestically and $170.2 million internationally for a worldwide tally of $367.4 million.\nDirected by Matt Shakman and starring Pedro Pascal, Vanessa Kirby, Joseph Quinn and Ebon Moss-Bachrach, The Fantastic Four: First Steps had a production budget of $200 million-plus, according to Variety, but its marketing spend has not been divulged.\n‘Superman’ Appears To Be On Its Way To Winning The 2025 Superhero Box Office Crown\nGiven The Fantastic Four’s significant drop in business in its second weekend, it appears that Warner Bros.’ Superman from director James Gunn is well on its way to being the top superhero movie of 2025.\nThe first release from Warner Bros.’ DC Studios — where Gunn and Peter Safran serve as its co-CEOs — Superman earned $125 million domestically in its opening weekend from July 11-13.\nLuckily for Gunn and Safran, Superman’s business only dropped by 53% in the film’s second weekend in theaters as it pulled in a healthy $58.4 million from July 18-21. Per Variety, Superman had a production budget of $225 million and $100 million was spent on marketing.\nAs of Monday, per The Numbers and Box Office Mojo, Superman has earned $316 million domestically and nearly $235 million internationally for a worldwide box office tally of $551 million.\nStarring David Corenswet in the title role, Superman’s box office gross to date far exceeds the global grosses of the first and second superhero movies released in 2025.\nBoth released by Disney Marvel, Captain America: Brave New World finished with a global tally of $413.6 million ($200.5 million domestically and $213.1 million internationally).\nThunderbolts*, meanwhile, has earned $382.4 million globally ($190.2 million domestically and $192.1 million internationally) to date. The film is close to being done with its theatrical run, however, having only played in 20 venues over the weekend."
    },
    {
      "url": "https://deadline.com/2025/08/weapons-freakier-friday-box-office-1236479522/#comments",
      "text": "In what’s one of the last big showdowns at the summer box office, New Line’s Weapons, which is strong across the board, and Disney’s femme-skewing, much millennial-loved Freakier Friday are about to face off, with the tracking reports indicating a too-close-to-call race for No. 1 with $30 million-plus expected for both.\nHowever, there is immense buzz from distribution sources that the Weapons, the enigmatic horror movie directed, written and produced by Zach Cregger about a class of school children who fled their homes mysteriously in the night, has the edge with a mid-$30M and possible $40M take. We’re hearing that AMC is seeing presales for Weapons ahead of 28 Days Later; that Danny Boyle zombie title opened to $30M.\nDisney’s Freakier Friday, which reteams Lindsay Lohan and Oscar winner Jamie Lee Curtis from the 2003 film, is also hoping for $30M.\nWatch on Deadline\nThe advantage for R-rated Weapons is that it has all the Imax auditoriums and night-time PLFs (Freakier Friday will have the PLFs for day showtimes). Also, definite interest on tracking for the horror pic starring Julia Garner, Josh Brolin, Benedict Wong and Alden Ehrenreich is over 40 across all demos (by the way, that doesn’t mean people over 40: those figures are tracking numbers for men and women over and under the age of 25). That’s a streak of definite interest figures that any studio can envy. Freakier Friday‘s 40+ figures in definite interest are among females only.\nAlso, Weapons is currently 100% with critics on Rotten Tomatoes compared with Freakier Friday‘s 79% fresh. The original Freaky Friday was 88% certified fresh with critics with an A- CinemaScore.\nThe upside for Freakier Friday is that it’s bound to rule the middle of the country, which savors PG-rated movies. Currently, we hear that presales for the Nisha Ganatra-directed movie stand at $3M. The sweet spot for Freakier Friday is women 17-34 and teens.\nThe 2003 movie opened during the first frame of August to $22.2M over three days and $33.1M over five days. Freaky Friday ranked No. 2 at the weekend B.O. back then, behind Sony’s big-screen rendition of the TV show S.W.A.T. ($37M). Freaky Friday was a remake of the 1976 Disney classic starring Jodie Foster, Barbara Harris and John Astin about a mom and a daughter whose personalities are switched on a strange Friday. In Freakier Friday the souls of a grandmother, mother, daughter and step-daughter are swapped among one other (you’ll have to see the movie to find out who switches with who).\nWeapons is booked at 3,200 locations. There are 7 p.m. Alamo Drafthouse shows on Wednesday, with previews starting at 2:17 p.m. on Thursday (that first showtime is a reference to the time when the kiddies ran out of their homes in the film, even though it was 2:17 a.m.).\nFreakier Friday is holding its first preview Wednesday at 7 p.m., 22 years to the day the original movie bowed. Thursday shows start at 2 p.m. The pic is booked in 3,975 theatres including 850 PLFs and 150+ DBOX/Motion screens.\nNew Line won Weapons in an auction for close to $38M, with the price tag including the budget and Cregger getting $5 million to direct, and $10 million total when that sum was added to his fees for scripting and producing alongside Vertigo’s Roy Lee and Miri Yoon, and J.D. Lifshitz and Raphael Margules. Warners beat out Universal, which bid $7M less than its rival down the road. Jordan Peele and his Monkeypaw were going to produce Weapons had Uni landed it.\nWarner Bros originally had Weapons opening in cinemas on MLK weekend 2026 before they moved the horror film into this year thanks to great test scores.\ni am super psyched about Weapons and rooting for it at the box office\nFreakier Friday was terrible. I’m convinced the script was written by AI.\nWeapons looks great! I’m the demographic for Freakier Friday, but will be passing. Jamie Lee Curtis is too out of touch. I’ve never “protested” a movie, but will not support anything she is in. I’m sure the movie will do fine without me.\nShe seems genuinely nice and down to earth. What happened?\nShe’s pretty intolerant with her politics, which is never nice or a good look, but I for one separate the art from the artist. Political don’t matter when it comes to the work.\nI’m guessing that’s OP’s issue with her because I get what they mean, but don’t personally care much.\nI think Freakier Friday will win out. Never underestimate the family demo.\nI couldn’t agree more. Freakier Friday appeals to women, too.\nWomen are still showing for the theater experience. Even Bridget Jones has a better multiplier than most Marvel and DC movies. No superhero movie of late has the multiplier of Barbie, Inside Out, Wicked, Materialists, The lost City (Thunderbolts and Captain America BN wish they had Sandra Bullock’s film multiplier)Moana 2. Gunn and Feige would kill to have their lastest films reach the multiplier of It ends with us and Anyone but you.\nStudios threw all their cards on male oriented films, and streaming superheroes but single gen-zers prefer to watch movies at home or their cellphones, or streaming in the background while playing videogames. Then the major studios executives nd the box office aficionados get surprised those immature males aren’t showing up like they used to prepandemic.\nMeanwhile families pay to see dinosaurs and Disney fare, and women take their friends to the movies.\nRemember that when, disregarding of how much Freakier Friday makes, or if it opens below Weapons (doubtful )the multiplier is bigger than F4 and Superman. Women and families rule the box office.\nFunny that there were many male oriented blockbusters this summer and the only billion dollar grosser of the season was the one female orientated blockbuster Lilo and Stitch. Here in Britain, Bridget Jones movies are massive, not so much elsewhere though.\n5Mskiiissss?? This may be movie of the year."
    },
    {
      "url": "https://www.forbes.com/sites/timlammers/2025/08/06/projections-freakier-friday-to-flush-fantastic-four-at-weekend-box-office/",
      "text": "Jamie Lee Curtis and Lindsay Lohan’s Freakier Friday is looking to end The Fantastic Four: First Steps’ reign at the domestic box office this weekend.\nDisney and Marvel Studios’ superhero tale debuted at No. 1 in its opening weekend with $115.6 million in North American ticket sales from July 25-27 and hung on to the top spot Aug. 1-3 despite a disastrous second weekend.\nThanks to an anemic take of $38.6 million in its second frame, The Fantastic Four dropped a staggering 67% in business from its opening weekend. Now, this coming weekend, it appears that another Disney film, the family-friendly comedy Freakier Friday, will deliver the First Family of Superheroes a knockout punch.\nFreakier Friday is projected by Deadline to earn $30 million in its opening weekend domestically, while The Hollywood Reporter projects the film will open with about $28 million in ticket sales.\nCasting a much wider net, however, is Box Office Pro, which is projecting Freakier Friday will make $35 million to $45 million in its opening weekend.\n‘Weapons’ Is Also Taking Aim At ‘The Fantastic Four’\nFreakier Friday — the sequel to the 2003 hit Freaky Friday also starring Jamie Lee Curtis and Lindsay Lohan — isn’t the only newcomer to the domestic box office this weekend.\nWarner Bros. horror thriller Weapons, starring Julia Garner and Josh Brolin, is projected by Box Office Pro to earn $25 million to $35 million domestically, which is more in line with Deadline and THR’s projections for the film at $30 million and $25 million, respectively.\nSo, where does that leave The Fantastic Four First Steps? Box Office Pro is projecting a $15 million to $20 million third-weekend take for the film, and clearly, their projections for its competitors are loftier than Deadline and THR. The latter two, in fact, didn't even mention The Fantastic Four in its conversation as to where it will end up financially in its third frame.\nNo matter where The Fantastic Four ends up by Sunday, exectives at Disney and Marvel will no doubt be doing some soul searching — if they haven’t already been — about how the film that was so adored by critics and big with audiences in its opening weekend fell so far so fast.\nOne thing’s for certain: Marvel Studios will be navigating some shaky ground in the coming year and a half trying to figure out how to get the Marvel Cinematic Universe back on course after its third box office disappointment of 2025.\nAfter all, Fantastic Four is the film meant to set up the return of Robert Downey Jr. to the MCU with Avengers: Doomsday, which is currently scheduled for a Dec. 18, 2026, release."
    },
    {
      "url": "https://forbes.com/sites/timlammers/2025/08/08/freakier-friday-rotten-tomatoes-reviews-does-lightning-strike-twice/",
      "text": "Jamie Lee Curtis and Lindsay Lohan’s Freakier Friday — a sequel to their 2003 hit body switch comedy Freaky Friday — is new in theaters. Do Rotten Tomatoes critics think the sequel is as good as the original?\nOpening in theaters nationwide on Friday, the summary for Freakier Friday reads, “The film picks up years after Tess (Curtis) and Anna Coleman (Lohan) endured an identity crisis. Anna now has a daughter of her own and a soon-to-be stepdaughter.\n“As they navigate the myriad challenges that come when two families merge, Tess and Anna discover that lightning might indeed strike twice.”\nDirected by Nisha Ganatra, Freakier Friday also stars Mark Harmon, Chad Michael Murray, Christina Vidal Mitchell, Haley Hudson, Lucille Soong, Stephen Tobolowsky, Rosalind Chao, Julia Butters, Sophia Hammons, Manny Jacinto and Maitreyi Ramakrishnan.”\nAs of Thursday, Freakier Friday has earned a 73% “fresh” rating based on Rotten Tomatoes based on 127 reviews.\nThe RT Critics Consensus for the film reads, “Freakier Friday doesn't reinvent the original's story so much as it swaps the formula around for a frothy good time, with Jamie Lee Curtis and Lindsay Lohan easily slipping back into roles that fit them like mixed-and-matched gloves.”\nThe RT Popcornmeter score based on verified user ratings is still pending.\nWhat Are Individual Critics Saying About ‘Freakier Friday’?\nAlissa Wilkinson of The New York Times is among the top critics on RT who gives Freakier Friday a “fresh” rating, writing in her review summary, “Freakier Friday works best if you’re there for the memories. Especially if you’ve learned a lesson or two of your own in the last 22 years.”\nWilliam Bibbiani of The Wrap is also a fan of Freakier Friday, writing in his “fresh” review summary on RT, “It’s still sweet, it’s still funny, it’s still freaky, and it’s still Friday. Thank God.”\nJocelyn Noveck of The Associated Press also gives Freakier Friday a “fresh” review on RT, albeit with some reservations, writing, “The problem is that sometimes, it’s actually hard to keep track of who’s inhabiting whom, and therefore why they’re doing what. Not to say that Freakier Friday, directed with gusto by Nisha Ganatra, doesn’t have moments of comic glee.\nDavid Rooney of The Hollywood Reporter is among the top critics on RT who gives Freakier Friday a “rotten” review, writing, “I think I would have preferred a shot-for-shot remake to this painfully stretched cash-grab.”\nMichael Phillips of the Chicago Tribune isn’t a fan of Freakier Friday either, writing in his “rotten” review summary on RT, “There is a strain to it all. Doubling the bodies swapped ends up feeling like six times the chaos, not two.”\nAlso unimpressed by Freakier Friday is Clarisse Loughrey of the UK’s Independent, who writes in her “rotten” review on RT, “The talent of tomorrow has to play second fiddle to a generation’s inability to let go of the past. And that’s something a quick body swap can’t solve.”\nRated PG, Freakier Friday is new in theaters nationwide on Friday."
    },
    {
      "url": "https://www.forbes.com/sites/timlammers/2025/08/06/wednesday-season-2-stars-on-working-with-tim-burton-and-jenna-ortega/",
      "text": "For Steve Buscemi, Fred Armisen and Luis Guzmán, it was only appropriate that The Addams Family-inspired series Wednesday Season 2 felt like a family reunion, given that all the stars were reuniting with director and executive producer Tim Burton.\nSince Guzmán brought Gomez Addams to life and Armisen gave spark to Uncle Fester in Wednesday Season 1 in 2022, the wait to reunite with the iconic director wasn’t long for Season 2, at least by Buscemi’s standards.\nAfter all, it’s been more than two decades since Buscemi first collaborated with Burton on Big Fish in his memorable turn as Norther Winslow, one of the fantasical people in the seemingly tall tales told from the memories of Edward Bloom (Albert Finney).\n“That was just one of the many draws of me wanting to be a part of this season of Wednesday,” Buscemi, sitting alongside Armisen and Luis Guzmán, said in a recent Zoom conversation. “Then when you have The Adams Family, an amazing ensemble cast and then throw in Tim Burton, it's just incredible.”\nGuzmán said he loves the way Burton collaborates with his performers and is always up for suggestions.\n“For me, it’s a total collaboration. I like to stick to the page and to the map that’s been laid out, but once in a while, if I have an idea or suggestion, it’s welcomed,” Guzmán said of acclaimed filmmaker. “As an artist, if you can collaborate with these other artists like that and really feel a part of generating these ideas and these moments, it makes me feel great to be a part of it.”\nArmisen said he was happy to bring more of what he did as Uncle Fester from Wednesday Season 1, since the role of the wacky Addams Family member has expanded in Season 2.\n“I think a lot of [what I needed for the character] was already there in Season 1 just because Fester's mannerisms and everything are already set,” Armisen said. “So, this time going in, Tim was just like, ‘Let's just do more of this.’ There were more scenes, so I got to do, but basically I stuck to that character the way he was in Season 1.”\nCreated by Alfred Gough and Miles Millar, Wednesday Season 2 introduces Buscemi’s Barry Dort, the new principal at Nevermore Academy.\nUnlike Gomez Addams and Uncle Fester, Dort is a new character joining The Addams Family lore, so he said there are advantages in molding the Nevermore principal yet creative challenges to ensure the academy’s alumni-turned-principal didn’t feel out of place.\n\"It was a challenge and also fun because I'm a completely new character. But his position is not new since he's coming in as [Nevermore’s] new principal,” Buscemi recalled. “The challenge was to come up with a unique character that fit into this world.\n“So, Tim and I put our heads together and discovered that Dort is enamored with Edgar Allan Poe,” Buscemi added. \"[We thought], 'Let's model his look on that. Once we figured that out, then we were off to the races.”\n‘Wednesday’ Season 2 Also Reunited The Stars With Jenna Ortega\nSteve Buscemi, Fred Armisen and Luis Guzmán’s work in Wednesday Season 2 didn’t mark the only reunion on set.\nIn addition to Guzmán and Armisen reuniting with Jenna Ortega after Season 1, Buscemi got the opportunity to work with Ortega before, when they co-starred in director Taika Waititi’s upcoming sci-fi drama Klara and the Sun, which is expected to come out later this year.\n“For me, my character is so enamored with Wednesday, and I feel that way about Jenna, so it was nice to put you know my feelings about how I admire Jenna as an actor to put that into Dort,” Buscemi observed. “He wants Wednesday to like him and respect him, and she pushes against him. I think that he likes that even more, that he’s getting the full Wednesday treatment.”\nGuzmán said he admires Ortega’s focus on the character and can’t say enough about the way she brings Wednesday Addams to life.\n“Oh, my God, she's a prodigy. She’s so well-focused and carries herself very well. She's a pro,” Guzmán enthused. “I have done quite a few scenes and just standing up to her, I’m literally like, ‘Wow.’ She’s so focused that she plays Wednesday exceedingly, incredibly well and beautifully. It’s just awesome to watch her and be in the same space with her.\nArmisen further illustrated Ortega’s focus by revealing one of her processes on set.\n“She goes through every one of her lines and really thinks of the logic of every line all the way through,” Armisen said. “So, I think when she’s doing that, it makes everyone else kind of go, 'Oh yeah, let me rethink what I'm doing.'”\nWednesday Season 2, Part 1 also stars Catherine Zeta-Jones, Emma Myers, Joy Sunday, Hunter Doohan, Billie Piper, Isaac Ordonez, Victor Dorobantu, Georgie Farmer, Moosa Mostafa, Evie Templeton, Owen Painter, Noah B. Taylor and Luyanda Unati Lewis-Nyawo.\nSeason 2, Part 1’s guest stars include Joanna Lumley, Thandiwe Newton, Jamie McShane, Haley Joel Osment, Heather Matarazzo, Joonas Suotamo and Christopher Lloyd.\nThe first four episodes of Wednesday Season 2, Part 1 are new on Netflix, while Part 2, featuring Episodes 5-8, will premiere on the streaming platform on Wednesday, Sept. 3."
    },
    {
      "url": "https://www.forbes.com/sites/timlammers/2025/08/08/thunderbolts-ends-theatrical-run-how-much-money-did-it-lose/",
      "text": "The Disney and Marvel Studios comic book movie Thunderbolts*, starring Florence Pugh, Sebastian Stan and David Harbour, is done playing in theaters. Where did the film end up financially?\nDirected by Jake Schreier, Thunderbolts* kicked off the summer moviegoing season on May 2. The official summary for the latest film in the Marvel Cinematic Universe reads, “Marvel Studios assembles an unconventional team of antiheroes — Yelena Belova (Pugh), Bucky Barnes (Stan), Red Guardian (Harbour), Ghost (Hannah John-Kamen), Taskmaster (Olga Kurylenko) and John Walker (Wyatt Russell).\n“After finding themselves ensnared in a death trap set by Valentina Allegra de Fontaine (Julia Louis-Dreyfuss), these disillusioned castoffs must embark on a dangerous mission that will force them to confront the darkest corners of their pasts. Will this dysfunctional group tear themselves apart, or find redemption and unite as something much more before it’s too late?”\nThunderbolts* opened at No. 1 at the domestic box office with $74.3 million from 4,330 North American theaters in its opening weekend, May 2-4 and held onto the top slot for another weekend before Final Destination Bloodlines took the box office crown away from the film the weekend of May 16-18.\nAlso known as The New Avengers, Thunderbolts* last day in theaters was Thursday, as indicated by The Numbers’ weekly streaming count list. According to The Numbers, Thunderbolts* earned $6,454 from 20 North American theaters to bring its final domestic box office take to $190,274,328.\nCombined with the film’s international ticket sales of $192,162,037, the worldwide box office tally for Thunderbolts* ended up at $382,436,365.\nHowever, the $382.4 million Thunderbolts* earned in ticket sales at the worldwide box office is the amount the film grossed in theaters and is not representative of the final net.\nHow Much Did ‘Thunderbolts* Need To Make To Break Even”\nAccording to a June 12 report in Variety, Thunderbolts* cost $180 million to produce and $100 million more to market. The expenses, however, don’t end there. Generally speaking, 50% of what a film makes at the box office goes to theater owners, plus there are other residual and miscellaneous expenses that films incur.\nAs such, Variety reported in June, Thunderbolts* needed to earn $425 million worldwide just to break even, so the final theatrical gross of $382.4 million means the film lost tens of millions of dollars. There are ways, however, that Disney can defray that deficit.\nAmong them, Variety noted, was how the “company can recoup some costs through Disney+ and other home entertainment markets, to say nothing of the massive revenue streams from merchandising, theme parks and cruises.”\nWhether those additional revenue streams will make the Thunderbolts* whole, however, is yet to be determined.\nFor viewers who missed Thunderbolts* in theaters or want to see it again, the film is available on digital streaming but is not yet available on Disney+."
    },
    {
      "url": "https://www.boxofficepro.com/weekend-preview-freakier-friday-looking-to-win-the-weekend/",
      "text": "The Boxoffice Podium\nForecasting the Top 3 Movies at the Domestic Box Office | August 8 – 10, 2025\nWeek 32 | August 8 – 10, 2025\n1. Freakier Friday\nWalt Disney Pictures | NEW\nOpening Weekend Range: $35M – $45M\nShowtime Marketshare: 16%\nPros\n- This coming frame sees Disney putting all their chips on a different Fantastic Four. The legacy sequel to the 2003 remake Freaky Friday, Freakier Friday is looking to take first place this weekend, with our forecasting panel leaning toward a bow in the high $30M’s with a chance to reach low-$40M’s if it breaks through. Since relaunching the Halloween franchise in 2018, star Jamie Lee Curtis has experienced a renaissance including hits like Knives Out and her Oscar-winning supporting turn in Everything Everywhere All at Once. After a career downturn in the mid-2000’s, co-star Lindsay Lohan has of late been making a comeback starring in popular Netflix rom-coms like Our Little Secret. Both actresses are in a prime position to mine nostalgia for their first Freaky, which minted $110.2M domestic and $160.8M globally, currently ranking high on Disney+ streaming.\nCons\n- Last weekend saw legacy comedy The Naked Gun underperform to expectations ($16.8M), with 2025 already being a mixed year for long-gap sequels in the Karate Kid and I Know What You Did Last Summer franchises. Comedy itself is under fire these days in the theatrical space, considering it’s now the lowest-earning genre among fiction films. Unadjusted, the original Freaky Friday opened to $22.2M over two decades ago when it was sold off the back of teen icon Lohan, but Freakier Friday will be relying a lot more on parental nostalgia than any current youth cache the two stars have (if any). Rotten Tomatoes critical is currently tallying 80%, which is good but not spectacular enough to win over those on the fence.\n2. Weapons\nWarner Bros. | NEW\nOpening Weekend Range: $25M – $35M\nShowtime Marketshare: 13%\nPros\n- Freakier Friday has the name recognition, aughties member berries, and the Disney brand seal of approval… but Warner Bros.’ original horror title Weapons is stoking the fires of curiosity with a Mystery Box ad campaign that could provide a strong opening weekend. It is the brainchild of Zach Cregger, who—like Jordan Peele before him—is a former sketch comedian who made a splash in the horror world with his debut film, the low-budget Barbarian ($40.8M domestic). Like its body-swapping competition, Weapons should have a performance in the high-$20M’s, and perhaps the low $30M’s should those IMAX showtimes fill up in the coming days.\nCons\n- With enough of a groundswell, there is a world where Weapons could feasibly open a notch ahead of Freakier Friday. There is also a chance all the mystique surrounding the plot about missing children might not be enough to woo general audiences to a non-IP genre movie. It could also be a case, as with the “C+” on last week’s well-reviewed Together, that audiences reject what the critical community has embraced. Cregger might be a fast-rising talent currently putting together the Resident Evil reboot, but having him as a producer on the highly-praised Companion couldn’t keep that January 2025 release from disappointing ($20.8M domestic).\n3. The Fantastic Four: First Steps\nDisney/Marvel Studios | Wk 3\nWeekend Range: $15M – $20M\nShowtime Marketshare: 12%\nPros\n- Marvel Studios’ The Fantastic Four: First Steps seemingly already won the most important battle in the court of public opinion, since it had good feedback from audiences and critics on top of a solid opening at the box office. Should Marvel’s First Family continue to find favor in next year’s Avengers: Doomsday, they may see a boost when/if the studio decides to make an FF sequel, which is what happened with second entries in their Spider-Man, Thor, Doctor Strange, Captain America, Ant-Man, and Guardians of the Galaxy movies. Even if there is no eventual standalone sequel, Kevin Feige can sleep at night knowing the new movie ($201.66M domestic/$371.95M WW) already lapped the 2005 film ($154.69M domestic/$333.1M WW).\nCons\n- Not only was last week’s sophomore drop worse than Sunday estimates ($38.69M for a -67% drop), Fantastic Four is now poised to lose a good number of its PLF screens this weekend following that disappointment. The fact that the movie took place in a different corner of the Marvel Cinematic Universe was initially seen as an advantage for continuity-exhausted audiences, but the lack of breadcrumbs/connections with future movies may be a reason fans aren’t going back for seconds. Despite weak competition, our panel is predicting another steep -50%+ drop in Frame 3, and while FF has already bested Captain America: Brave New World and Thunderbolts* domestically, it was a pricier film than those two, with bigger expectations it shall not meet. Among a franchise that has seen over 20 films gross above the $300M mark stateside, First Steps is not destined to be among them. Globally, it may be looking at a performance in the ballpark of Ant-Man and the Wasp: Quantumania ($476M), which on a similar $200M budget back in 2023 was considered catastrophic for Marvel Studios.\nShare this post"
    },
    {
      "url": "https://www.forbes.com/sites/timlammers/2025/08/04/why-does-anna-from-netflixs-my-oxford-year-look-so-familiar/",
      "text": "Netflix’s new romantic comedy drama My Oxford Year stars Sofia Carson as Anna De La Vega. What else has Carson starred in?\nDirected by Iain Morris, My Oxford Year debuted on Netflix on Friday. The summary for the movie reads, “When Anna (Carson), an ambitious young American woman, sets out for the UK and the University of Oxford to fulfill a childhood dream, she’s got her life completely on track. That is, until she meets a charming and clever local, Jamie (Corey Mylchreest), who profoundly alters both of their lives.”\nBorn Sofía Daccarett Char in Fort Lauderdale, Fla., on April 10, 1993, Char, who uses her mother’s maiden name Carson as her professional name, made her screen debut in a guest role in a 2014 episode of the Disney Channel series Austin & Ally. Carson’s next guest role came in 2015 in the MTV series Faking It, which was followed by a role in the same year that helped launch her career.\nHere’s a look at some of the other TV series and films that Carson has appeared in and why she looks so familiar as Anna in My Oxford Year.\n‘Descendants’ (2015)\nSofia Carson’s first big screen role came in the Disney TV movie Descendants, where she plays Evie, the daughter of the Evil Queen from Snow White in Disney lore.\nCarson reprised the role of Evie in the TV movies Descendants 2 in 2017 and Descendents 3 in 2019, as well as the TV special Descendants: The Royal Wedding in 2021.\nIn additon, Carson voiced the role of Evie in the animated Disney series Descendants: Wicked World from 2017-2019.\n'Adventures In Babysitting (2016)\nSofia Carson and Sabrina Carpenter starred as Lola Perez and Jenny Carpenter in the TV movie Adventures in Babysitting, which aired on the Disney Channel.\nAdventures in Babysitting is a remake of the 1987 comedy hit of the same name that starred Elisabeth Shue and was directed by Chris Columbus.\n‘Pretty Little Liars: The Perfectionists’ (2019)\nSofia Carson starred as fashion trendsetter Ava Jalali in Pretty Little Liars: The Perfectionists, the third series in the Pretty Little Liars TV franchise. The crime mystery series ran on Freeform for one season and consisted of 10 episodes.\n‘Feel The Beat’ (2020)\nSofia Carson’s first film on Netflix came with the dance comedy drama Feel the Beat. Carson stars as April, an aspiring Broadway dancer who after a tough break during an audition, moves back to her home town in Wisconsin and coaches a group of young dancers.\n‘Purple Hearts’ (2022)\nSofia Carson starred opposite Nicholas Galitzine in Netflix’s Purple Hearts, about an aspiring musician, Cassie, who struggles to buy insulin as a Type 1 diabetic.\nCassie and a Marine, Luke (Galitzine), however, find a solution with a marriage of convenience. Cassie can get health benefits as a military spouse and Luke can get an increase in pay — but then both of their lives become very complicated.\n‘Carry-On’ (2024)\nSofia Carson starred in a supporting role opposite Taron Edgerton in Carry-On, a Netflix original movie that was released on December 2024.\nEdgerton plays Ethan, a TSA officer in Los Angeles who is blackmailed by a mysterious man called The Traveler (Jason Bateman) to allow a bomb carrying a lethal chemical agent aboard a flight. When Ethan tries to stop The Traveler’s plans, it puts his and his girlfriend Nora’s (Carson) life — as well as the life of their unborn child — in danger.\n‘The Life List’ (2025)\nReleased in March, Netflix’s romantic drama The Life List stars Sofia Carson as Alex, a woman who seeks to attain unrealized goals from childhood after her mother dies. The Life List also stars Connie Britton and Kyle Allen.\n‘Netflix TUDUM’ (2025)\nSofia Carson has become such of a fixture on Netflix that she hosted the streaming platform’s annual TUDUM event in May.\nThe live presentation gave a preview of the Netflix’s upcoming programming including Wednesday Season 2, Stranger Things Season 5 and Guillermo del Toro’s Frankenstein.\nMy Oxford Year, starring Sofia Carson, is new on Netflix."
    },
    {
      "url": "https://www.hollywoodreporter.com/movies/movie-news/box-office-freakier-friday-and-weapons-1236338519/",
      "text": "Disney’s highly anticipated Freakier Friday and Warner Bros.’ and New Line’s critical darling Weapons are headed for a lively late-summer showdown at the box office in what could be a boost for two genres that have struggled on the big screen — comedies and horror.\nMany are predicting that the duo will take the top two spots on the Aug. 8-10 chart, with Marvel Studios holdover The Fantastic Four: The First Steps coming in an unlucky third after dropping an alarming 67 percent to $38.6 million in its second outing over the Aug. 1-3 weekend. Marvel and parent company Disney are still hopeful that Fantastic Four will rebound, but there are no assurances.\nRelated Stories\nThanks to a dearth of product this summer targeting females, combined with the nostalgia factor, Freakier Friday — reuniting Lindsay Lohan and Jamie Lee Curtis 23 years after Freaky Friday opened — has a slight edge over Weapons in tracking, which pegs it at opening in the $28 million range domestically. That would be a stellar start for a pic costing a modest $42 million before marketing.\nDirected by Nisha Ganatra, the movie picks up after the events of the first film, when Lohan’s character, Tess, swapped bodies with her mother, played by Curtis. This time out, in a multigenerational twist, they find themselves swapping places, respectively, with the daughter and soon-to-be stepdaughter of Tess. Julia Butters, Sophia Hammons, Manny Jacinto, Maitreyi Ramakrishnan, Rosalind Chao, Chad Michael Murray, Vanessa Bayer, and Mark Harmon also star.\nThe Freaky Friday franchise, which also includes a 1976 film, is based on the book by Mary Rodgers. Disney has enjoyed great success in tapping into nostalgia and luring moviegoers in their 20s and 30s who grew up on previous movies in its library. For example, it’s live-action tentpole Lilo & Stitch, based on the 2002 animated film, is the only Hollywood pic of 2025 so far to clear the $1 billion milestone after attracting both families and non-parents.\nAdditionally, Freakier Friday is the first event film since Lilo & Stitch to target females after a summer marquee rife with male-skewing tentpoles. Another fun tidbit: after all this time, the 2003 film has popped up on the top 10 list of most watched films on Disney+ in the last week or so.\nFilm studios execs across Hollywood lament how comedies have become an endangered species in the streaming age. Last weekend, Paramount’s Naked Gun reboot bucked this trend in opening to nearly $17 million domestically. While that film is considered more of a straight-up comedy, versus a family comedy such as Freakier Friday, it will be good news for all if they both work.\nHorror could also use a win after such box office bombs as Blumhouse and Atomic Monsters’ M3GAN 2.0, which opened to only $10 million in June on its way to topping at $40 million worldwide, compared to $180 million for the first film.\nZach Cregger’s Weapons — which currently boasts a perfect 100 percent critics’ score on Rotten Tomatoes — is tracking for a $25 million debut, but could easily come in higher. The package for the R-rated title was the subject of a heated bidding battle, with New Line and Warner Bros. prevailing in winning the $38 million budgeted film, which including a $10 million payday for Cregger, who made waves with his debut feature film, 2022’s Barbarian, which he both wrote and directed.\nAlso an original story, Weapons stars Julia Garner as a teacher who learns that 17 of the 18 children in her classroom simultaneously got out of bed and ran off into the night the exact same time, 2:17 a.m. Josh Brolin plays a grieving father who is intent on finding his missing child, and is suspicious that the young teacher had something to do with it.\nAden Ehrenreich, Austin Abrams and Amy Madigan also star in Weapons, which will be playing on coveted Imax Screens (Imax is also rereleasing summer hit 51: The Movie on select screens this weekend before offering more showings the following week.)\nFreakier Friday will have advantage of playing in hundreds of other premium large format screens, including Dolby Cinema auditoriums.\nTHR Newsletters\nSign up for THR news straight to your inbox every day"
    },
    {
      "url": "https://www.forbes.com/sites/timlammers/2025/08/06/why-is-wednesday-season-2-split-into-two-parts-the-creators-explain/",
      "text": "Wednesday Season 2 — starring Jenna Ortega and directed by Tim Burton — returns to Netflix after nearly three years, but fans will have to wait a bit longer for Part 2.\nCreated by Alfred Gough and Miles Millar, the second season surrounding Ortega’s title character, Wednesday Addams of The Addams Family fame, premiered with episodes one through four.\nFans will have to wait until Wednesday, Sept. 3, for Wednesday Season 2, Part 2 – which will conclude with episodes four through eight.\nThe decision to split Wednesday Season 2 into two parts was not made by the show’s creators, Gough said in a Zoom conversation last week. Gough noted that the idea to drop two four-episode chunks in August and September instead of all eight episodes at once was “something that came from Netflix.”\nFrom a storytelling standpoint, though, Gough and Millar were completely on board with the decision, especially considering the way the duo structures their episodic television work. As such, the duo, like Season 1 of Wednesday, already had a cliffhanger in mind for Episode 4 of Season 2 — so the idea of creating a break after the episode seemed like a natural fit.\n“When we look at these seasons because they’re eight episodes, we always want Episode 4 to have something big and impactful,” Gough explained. “In Season 1, it was the dance, and then Eugene [Moosa Mostafa] was attacked by the Hyde, and you weren't sure if he lived or died.”\nAnd while Season 2 Episode 4 also has a major cliffhanger, the notion of breaking the season into two parts also inspired Gough and Millar to take a different approach to the story.\n“I think what it allowed us to do — which is something we wanted to do anyway — was change up the storytelling mystery,” Gough said. “We didn’t want to want a cards down, 'You can't find out till the end of the eighth episode' whodunnit. We wanted it to feel complete in the first four. So, you have that and then it leads into something bigger. As you’ll see in the end, all the cats are out of the bag.”\nIn other words, while there’s a big reveal in store for Wednesday watchers with Part 1, fans will ultimately get that surprise wrapped within another surprise when Season 2, Part 2 wraps up with Episode 8 in September.\n“Hopefully, the fact that the whodunnit is revealed in Episode 4 is a surprise in itself,” Millar added. “So, [our challenge as creators is], ‘How do you mix things up and not get repetitive?’ I think that’s always a challenge of any season of TV. You don’t want to repeat yourself. You want to have the essence of the show that people love, but also change it up and make sure that it always feels surprising.”\nThe Split Of ‘Wednesday’ Season 2 Continues A Trend For Netflix’s Biggest Shows\nThe move to split Wednesday into two parts isn’t completely unusual for Netflix, even though most original series produced by the streaming giant premiere all at the same time. There are occasions, however, when the platform spaces out its programming to prolong the rush binge viewers get watching several episodes in one fell swoop.\nFor example, Netflix released Cobra Kai Season 6 into three parts over a prolonged period, where five episodes were released in July of 2024, followed by five more in November of 2024 and the final five in February 2025.\nStranger Things is also stretching out its fifth and final season, but the wait won’t be as long, since Season 5 will debut with four episodes on Nov. 27, followed by three more on Dec. 25 and a single-episode series finale on Dec. 31.\nThe official summary for Wednesday Season 2 reads, “Wednesday Addams (Jenna Ortega) returns to prowl the Gothic halls of Nevermore Academy, where fresh foes and woes await. This season, Wednesday must navigate family, friends and old adversaries, propelling her into another year of delightfully dark and kooky mayhem.\n“Armed with her signature razor-sharp wit and deadpan charm, Wednesday is also plunged into a new bone-chilling supernatural mystery.”\nIn additon to Ortega, Wednesday Season 2 stars Steve Buscemi, Catherine Zeta-Jones, Emma Myers, Joy Sunday, Luis Guzmán, Hunter Doohan, Billie Piper, Isaac Ordonez, Victor Dorobantu, Georgie Farmer, Moosa Mostafa, Evie Templeton, Owen Painter, Noah B. Taylor and Luyanda Unati Lewis-Nyawo.\nWednesday Season 2, Part 1’s guest stars include Joanna Lumley, Thandiwe Newton, Jamie McShane, Haley Joel Osment, Heather Matarazzo, Joonas Suotamo, Fred Armisen and Christopher Lloyd.\nCreated by Alfred Gough and Miles Millar and directed and executive produced by Tim Burton, Wednesday Season 2, Part 1 debuts on Wednesday on Netflix with Episodes 1-4. Wednesday Season 2 wraps up with Part 2 with the release of Episodes 5-8 on Wednesday, Sept. 3."
    },
    {
      "url": "https://deadline.com/2025/08/box-office-weapons-freakier-friday-1236482095/",
      "text": "FRIDAY MIDDAY: Weapons is heading for at least a $38M+ 3-day at 3,202 theaters with a current Friday of $17M+, which includes those $5.7M previews. This will rep the 11th time that Warner Bros. has notched No. 1 this year with a movie (opening title or holdover).\nMeanwhile, Disney’s $45M-budgeted Freakier Friday is heading toward a great $12M Friday, including previews, and $30M opening at 3,975 sites. The original movie back in 2003 opened on a Wednesday with a 5-day of $33.1M and 3-day of $22.2M.\nRelishMix says that the social media reach for Weapons has been 32% ahead of other horror pics across TikTok, Facebook, X, YouTube and Instagram combined. With close to 239M followers, Weapons is slightly ahead of Sinners (222.5M followers) and just under It‘s pre-Covid reach of 250M. RelishMix says star Josh Brolin and Julia Graner are “well activated on Instagram” with at 3.4M and 1.5M fans, respectively.\nWatch on Deadline\nSays the social stats company: “Convo on Warner Bros.’ Weapons is strong with many who anticipate another thrilling spectacle after Cregger’s 2022 smash-hit saying, ‘Barbarian was insaaaaane! in the best possible ways! I have full trust in this new movie!’ The creepiness of the trailer sparked some to draw comparisons to other classics, ‘Reminds me of The Children (1980) on steroids,’ and ‘Getting Children of the Corn vibes from the marketing here.’ Some are immediately excited to see Garner in a horror film, ‘Julia Garner = instant watch!’ Comments include: ‘Cregger’s films are like the most elevated form of creepy pasta and I love it,’ ‘This looks fascinatingly twisted’ and ‘This looks like a great script and a pretty great movie. I’m not into horror, but I’ll watch this.'”\nWeapons was snapped up by New Line for $38M, including Cregger’s directing and writing fees. The movie’s production cost came in higher due to the Hollywood strikes and the re-casting of the lead role, which Pedro Pascal was attached.\nSocial reach on Freakier Friday is huge at 460M, per RelishMix, 3.2 times above comedy genre norms across TikTok, Facebook, X, YouTube and Instagram combined with Instagram views alone north of 250M. Freakier Friday cast members are fully social and fully activated with Lindsay Lohan at 32.1M, Jamie Lee Curtis at 11.3M, Chad Michael Murray at 2.8M, Manny Jacinto at 762K and Julia Bitter at 413K.\n“Convo for Freakier Friday has longtime fans of the original 2003 film awaiting this comedy sequel, while others are excited to see Lindsay Lohan return,” reports RelishMix.\nIn third is Disney/Marvel Studios’ The Fantastic Four: First Steps with a Friday of $5M at 3,600 theaters, and third sesh of $16M-$18M, -56%, which will get the movie to $231M-$233M by EOD Sunday.\nFourth is Universal/DreamWorks Animation’s The Bad Guys 2 at 3,860 with a second Friday of $3M, second weekend of $10.5M, -52%, for a 10-day of $43.5M. Bad Guys back in 2022 eased by 32% in its second weekend in what was a very crowded family/spring break field with Sonic the Hedgehog 2 in its fourth weekend and Fantastic Beasts 3 in its third.\nFifth is Paramount’s second weekend of The Naked Gun at 3,363 locations with $2.3M today, and a Friday-Sunday of $8.15M, -52% for a 10-day take by Sunday of $32.7M. That running cume will be ahead of No Hard Feelings‘ 10-day take of $29.7M by 10%, that R-rated 2023 Jennifer Lawrence movie ending its domestic run at $50.4M.\nFRIDAY AM UPDATE: Official studio numbers are in, with New Line’s Zach Cregger horror pic Weapons armed with $5.7M and Disney’s Lindsay Lohan-Jamie Lee Curtis sequel Freakier Friday counting $3.1M.\nFor Weapons, that’s higher than the preview take of New Line’s Final Destination Bloodlines ($5.5M in May), as well as Warner Bros’ Sinners ($4.7M in April). Muy bien. Don’t get excited and call the movie at $50M+. yet Let’s just let this beauty of a scare play, and we’ll see how it legs out.\nThursday audiences in Comscore/Screen Engine PostTrak exits for Weapons show a very good 65% definite recommend and four stars. Guys over 25 bought 37% of the tickets, women over 25 and guys under 25 but were 23%, and women under 25 were 17%; overall the pic saw a male-skewing turnout at 60%.\nRELATED: ‘Weapons’ Director Reveals Why Pedro Pascal Was Not Cast In Josh Brolin’s Role\nFreakier Friday had an 86% general audience, 9% parents, and 6% kids under 12 audience. Definite recommend is a good 61% with 4 1/2 stars from general audiences and 5 stars from kids and parents. Huge female turnout at 71% with 47% over 25, and 23% under 25.\nFreakier Friday is booked at 3,975 theatres with 850 PLF screens and 150+ Dbox/motion screens (Huh?There’s no roller coaster in the movie). Freakier Friday will have daytime showtimes on the PLFs, while Weapons takes the evenings. Imax auditoriums belong to Cregger.\nOne femme millennial fave comp for Freakier Friday is Paramount’s musical reboot of Mean Girls which did $3.3M in previews before a $28.6M opening.\nWeapons played in 3,000 locations last night and rises to 3,200 this AM.\nThe rest of the week was as follows:\n1.) The Fantastic Four: First Steps (Dis) 4,125 theaters, Thu $2.89M (-25% from Wednesday), Week $56.3M (-64%), Total $214.8M/Wk 2\n2.) The Bad Guys 2 (Uni) 3,852 theaters, Thu $2M (-20%) Wk $33M/Wk 1\n3.) The Naked Gun (Par) 3,344 theaters, Thu $1.46M (-16%), Wk $24.6M/Wk 1\n4.) Superman (WB) 3,537 theaters, Thu $1.43M (-16%), Wk $21M (-44%), Total $323.4M/Wk 4\n5.) Jurassic World Rebirth (Uni) 3,240 theaters, Thu $798K (-21%), Wk $13.1M (-35%), Total $322.1M/Wk 5\n6.) Together (Neon) 2,302 theaters, Thu $581K (-35%), Week $10.5M, Total $14.5M/Wk 1\n7.) Sketch (Angel) 2006 theaters, Thu $498K (-75%), Week $2.45M/Wk 1\nRELATED: The Movies That Have Made More Than $1 Billion At The Global Box Office\nEXCLUSIVE: New Line’s Zach Cregger R-rated horror movie Weapons is currently seeing a preview figure in the neighborhood of the label’s earlier summer spooky movie, Final Destination Bloodlines, with $5M+. Walk-up business could drive it higher by the time we get the official number Friday morning.\nMeanwhile, Disney’s sequel to 2003’s Freaky Friday, Freakier Friday, is around $3M in previews, sources tell us. Tracking pegged both movies’ openings at $30M+ earlier in the weekend, but we’ve heard in recent days that Weapons is pulling ahead with at least a low- to mid-$30M take or even more.\nFandango reported that Weapons ranked as the second-best horror ticket pre-seller of the year, behind Sinners at the same point in its sales cycle and ahead of Final Destination Bloodlines. It boasts excellent reviews at 97% certified fresh with an audience score of 90%.\nWhether Weapons goes higher depends on whether this movie breaks beyond its core fan audience, who is showing up tonight and Friday. Horror movies, as we know, tend to be frontloaded. How do we know if Weapons isn’t frontloaded? It needs an ease by 12%-14% in its Friday/previews to Saturday. That was the Friday-to-Saturday dip for such movies as Us, Final Destination Bloodlines and Sinners.\nWarners ran a very clever campaign, creating mystery as to why kids from a single a classroom fled their respective bedrooms in the middle of the night in a small town.\nWeapons‘ preview cash is ahead of Sinners‘ $4.7M and might approach or pass Final Destination Bloodlines‘ $5.5M. Sinners‘ previews repped 24% of its $19.2M Friday, which translated into a $48M opening. Bloodlines’ previews were 26% of its $20.9M Friday, which turned into a $51.6M opening. Among original horror movies, not based on any pre-existing IP, Jordan Peele’s Us is tops in previews with $7.4M. That movie went on to do $28.9M first Friday and a 3-day of $71.1M.\nNote both pics’ preview figures included Thursday showtimes plus Wednesday previews. Weapons had a showtime with Alamo Drafthouse Cinemas on Wednesday night, with previews starting Thursday at 2:17 p.m. — an odd time in reference to a specific time in the movie. Freakier Friday held Wednesday previews at 7 p.m., 22 years to the day after the original movie bowed, with showtimes kicking off at 2 p.m. today.\nFreakier Friday‘s preview figure isn’t far from other PG-rated fare of late, Disney’s Mufasa: The Lion King‘s $3.3M ($35.4M opening) and Warner Bros’ Wonka‘s $3.5M ($39M opening). No audience score yet on the Lindsay Lohan-Jamie Lee Curtis movie, but RT reviews are at 73% certified fresh.\nWhen people say Hollywood doesn’t make movies like they used to, we can only assume they haven’t seen WEAPONS yet.\nI liked the last Freaky Friday, but I have no interest in this “frequel” where they give LiLo an annoying teen daughter and an annoying British stepdaughter. They also added some new love interest none of the nostalgic fans care about. Disney once again ruining their classics. It could do less than $30 million.\nWeapons will need to make all its money quickly. WOM won’t be great. I keep hearing reviewers say it’s a bait and switch. I think $35 million weekend is more accurate.\nFantastic Four always comes in lower than predictions. My guess is $14 million. A more famous cast was sorely needed here. If F4 were supposed to play a major role in Doomsday it’s time for rewrites. Barely anyone has watched BNW, Thunderbolts, or F4. Time to call Reynolds, Evans, Jackman, Pratt,Johannson, Holland, and any other movie stars up. The MCU has had a horrible year of expensive flops.\nSuperman did well enough but won’t outgross Man of Steel. The next projects with lesser known characters need to be very cheap or moved to streaming.\nDumbest analysis I’ve ever seen in the Deadline comments, and that’s saying something. Freakier Friday picks up the story 22 years after the original but it should not have introduced new family members or relationships into the characters lives? Weapons is going to get terrible word of mouth, even though the word of mouth is already out there and has been overwhelmingly positive? WB should send DC movies straight to streaming?\nBrilliant. Simply brilliant.\nWatch F4 come in at the lower end of that estimate.\nWill stay under $500 million.\nIt will surpass 500 million, who knows about 600 million.\nOne Battle after another-Movie of the year\nWeapons = Movie of the year. Fantastic storytelling."
    }
  ],
  "argos_summary": "This weekend, Julia Garner and Josh Brolin's horror thriller 'Weapons' is projected to outperform Disney's 'Freakier Friday' at the domestic box office, with estimates suggesting it could earn over $38 million compared to 'Freakier Friday's' $30 million. Both films are new releases, with 'Weapons' benefiting from strong critical acclaim and a unique premise involving the mysterious disappearance of children. Meanwhile, 'The Fantastic Four: First Steps' is expected to drop to third place after a significant decline in its box office performance.",
  "argos_id": "R7RH38953"
}