{
  "url": "https://finance.yahoo.com/news/best-houses-ones-really-dated-000137493.html?.tsrc=rss",
  "authorsByline": "Marc Guberti",
  "articleId": "6b3f89270b084b2b861493079ba23af5",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/cv/apiv2/cv/apiv2/social/images/yahoo-finance-default-logo.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-09T00:01:37+00:00",
  "addDate": "2025-08-09T00:15:13.903899+00:00",
  "refreshDate": "2025-08-09T00:15:13.903903+00:00",
  "score": 1.0,
  "title": "'The Best Houses Are The Ones That Are Really Dated' — Graham Stephan's Surprising Wealth-Building Strategy",
  "description": "Location isn't the only factor that determines if a house is a good investment. There's a lot that goes into finding a great deal, but real estate investor Graham Stephan recently identified the top factor investors should look for in a home. \"The best houses are the ones that are really dated,\" Stephan said in a recent clip. Buying a new home limits your profit potential, and investing in a nightmare home can result in a lot of sunk costs and very little to show for it. However, if you focus on",
  "content": "Location isn't the only factor that determines if a house is a good investment. There's a lot that goes into finding a great deal, but real estate investor Graham Stephan recently identified the top factor investors should look for in a home.\n\n\"The best houses are the ones that are really dated,\" Stephan said in a recent clip.\n\nBuying a new home limits your profit potential, and investing in a nightmare home can result in a lot of sunk costs and very little to show for it. However, if you focus on dated homes, the profits can be promising. Stephan expanded on this point and shared a valuable lesson for real estate investors.\n• The same firms that backed Uber, Venmo and eBay are investing in this pre-IPO company disrupting a $1.8T market — and you can too at just $2.90/share.\n• ‘Scrolling To UBI' — Deloitte's #1 fastest-growing software company allows users to earn money on their phones. You can invest today for just $0.30/share.\n\nBuy Undervalued Properties That You Can Fix Up\n\nStephan emphasizes buying undervalued properties that you can fix up. Some sellers won't want to waste their time renovating a home and prefer to sell it at a discount. These types of opportunities allow investors to step in with sweat equity and boost the property's value.\n\nThe issue with buying a new property is that an investor doesn't have as many ways to enhance that property and boost its value. If the kitchen is state-of-the-art, you have fewer options to improve it than a kitchen that hasn't been changed in more than 40 years.\n\nHowever, not every fixer-upper is a great deal. Stephan encourages investors to focus on properties that need cosmetic upgrades. These properties should be structurally sound. It's best to avoid properties that have issues with the roof or foundation.\n\nTrending: Accredited Investors: Grab Pre-IPO Shares of the AI Company Powering Hasbro, Sephora & MGM—Secure $0.63 Shares Before 8/14\n\nCompare The Listing To Other Properties\n\nBefore you buy a property that needs some fixing, you should compare its market price with a similar property in the area that doesn't need any fixing. For instance, if a fixer-upper costs $500,000, and a similar, up-to-date property costs $600,000, there is a $100,000 gap.\n\nIf it only costs $70,000 to get the property in good condition, your $500,000 property will become a $600,000 property.. However, if it costs $150,000 to update the same $500,000 property, you're under $50,000.\n\nAnticipating the total costs of bringing the home up to date and calculating the gap between the current price and how much the home can be worth with some upgrades can help you make better investment decisions. Keeping these numbers in mind can help you distinguish the difference between profitable fixer-uppers and homes with no shot at profitability.",
  "medium": "Article",
  "links": [
    "https://secure.money.com/pr/o6b65fc0921a?s1=POM&s2=Vertical",
    "https://secure.money.com/pr/gcc371fcbd39?s1=POM&s2=Vertical",
    "https://www.benzinga.com/money/pacaso?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47017349",
    "https://www.benzinga.com/money/rad-intel?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47017349",
    "https://www.tiktok.com/@grahamstephan/video/7532673054422568222?lang=en",
    "https://www.benzinga.com/money/mode-mobile-2?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47017349",
    "https://secure.money.com/pr/s9a5a78207a8?s1=POM&s2=Vertical"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Undervalued Properties",
      "weight": 0.099730566
    },
    {
      "name": "undervalued properties",
      "weight": 0.099730566
    },
    {
      "name": "properties",
      "weight": 0.09876268
    },
    {
      "name": "Other Properties",
      "weight": 0.09719021
    },
    {
      "name": "real estate investor Graham Stephan",
      "weight": 0.09697455
    },
    {
      "name": "dated homes",
      "weight": 0.092143804
    },
    {
      "name": "homes",
      "weight": 0.08753216
    },
    {
      "name": "real estate investors",
      "weight": 0.085546166
    },
    {
      "name": "Graham Stephan",
      "weight": 0.07983197
    },
    {
      "name": "Pre-IPO Shares",
      "weight": 0.0788181
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Real Estate/Other",
      "score": 0.86767578125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.81005859375
    },
    {
      "name": "/Real Estate/Real Estate Listings/Residential Sales",
      "score": 0.640625
    },
    {
      "name": "/Real Estate/Real Estate Services/Real Estate Agencies",
      "score": 0.46044921875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.34033203125
    }
  ],
  "sentiment": {
    "positive": 0.27148438,
    "negative": 0.21850586,
    "neutral": 0.5097656
  },
  "summary": "Real estate investor Graham Stephan has revealed that the best houses are ones that are really dated, rather than new ones. Instead of investing in a new home, focusing on dated homes can yield significant profits. He recommends buying undervalued properties that can be fixed up, which are often easier for sellers to sell at a discount. Stephan also shared a valuable investment strategy involving Deloitte's 'Scrolling To UBI', a pre-IPO company that allows users to earn money on their phones. He also highlighted the importance of avoiding properties with issues with the roof or foundation. He advised investors to compare the market price with other properties in the area that don't need any fixing.",
  "shortSummary": "Real estate investor Graham Stephan recommends focusing on dated properties that can be upgraded, emphasizing potential profit potential compared to new properties.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7f0dca3abbc5484a8ec6d7006c0ddbc8",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.benzinga.com/money/pacaso?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47017349",
      "text": "Benzinga Money is a reader-supported publication. We may earn a commission from the advertisers associated with this article. Read our Advertiser Discloser.\nThree of the same VC firms that backed Uber, Venmo, and eBay, respectively, are all investing in another private company: Pacaso.\nVenture backing in companies like Pacaso is nothing new. After all, early-stage companies often have the potential to deliver the most outsized returns.\nBut, recent regulatory updates have opened the door for individual investors to invest alongside these venture capitalists. Normally, everyday investors have to wait for a company to go public before they can invest, missing out on that early gain potential. Now, some companies are opening up investment opportunities to the public.\nThis type of investing has already seen some great success stories. For example, in 2016, 433 people invested an average of $2,730 in a private startup named Revolut. Fast-forward to today, those $2,730 stakes are worth over $1 million, up 89,900%.\nToday, thousands of investors have joined big-name VCs in taking a chance on Pacaso. It's no surprise, considering Pacaso's resumé:\n- The company has made $110M in gross profits to date\n- Pacaso's co-founder sold his last company to Zillow for $120M\n- They operate in over 40 vacation destinations across the US, Mexico, UK, and France\n- The company reserved the Nasdaq ticker PCSO\nBut the growth potential is where the excitement is. Below we'll reveal more about how Pacaso has ramped up and built a competitive moat so quickly, and how you can share in their growth.\nNext-Generation Co-Ownership\nAfter his $120M exit and subsequent role as a Zillow executive, Austin Allison created Pacaso’s game-changing co-ownership model. Powered by proprietary tech and an innovative structure that eliminates the headaches of traditional vacation home ownership, it’s already leaving a mark. Here’s how:\n- Seamless Transactions: Clients easily buy, finance, and resell, shares of luxury homes through Pacaso’s intuitive platform\n- Turnkey Ownership: Pacaso handles maintenance, scheduling, and furnishing; owners simply enjoy their vacation homes\n- Maximized Value: Homes that once sat empty up to 90% of the year now stay occupied nearly year-round, benefiting owners and local economies\nThe demand for their services and expertise is real. In top destinations, co-ownership is growing 21% annually in the US, and Pacaso homes have appreciated nearly 10% since 2021 – roughly double the growth of the broader luxury market.\nScaling Into 10 New International Destinations\nPacaso is already leading the charge in the $1.3 trillion US vacation home market, combining real estate innovation with tech-driven efficiency to generate multiple revenue streams. These include transaction service fees on every sale, recurring property management fees, and exclusive financing options tailored to co-owners.\nNow, the platform’s global reach is growing quickly, and they’re already seeing strong returns in the $500B global market. In 2024, they set records in Paris and London. Meanwhile, Cabo (Mexico) is the #3-most-searched destination on their platform. No surprise Europe and Mexico have accounted for 22% of their revenue over the past two years.\nNow, they’re taking international expansion to an entirely new level. They recently announced 10 new international destinations will be added to their platform, spread across Italy, the Caribbean, and Mexico. That means Pacaso’s unique model is poised to dominate a combined $1.8T in vacation home markets.\nWhy Investors Are Paying Attention\nThere are many reasons why firms managing a combined $180B+ in assets, and 10,000+ individual investors have already backed Pacaso, including:\n- Proven Leadership: Allison is joined by executives with decades of real-estate and startup experience.\n- Strong Growth Metrics: Full-year 2024 financials showed a 21% YoY increase in gross real estate volume and a 24% improvement in adjusted EBITDA.\n- Surging Demand: 40% of Americans want to buy a vacation home in the next year (Coldwell Banker)\nAfter impressive full-year earnings showed gross profit grew 41%, and with continued growth and expansion ahead, Pacaso is really hitting their stride.\nPacaso is offering securities through the use of an Offering Statement that has been qualified by the Securities and Exchange Commission under Tier II of Regulation A. A copy of the Final Offering Circular that forms a part of the Offering Statement may be obtained from: invest.pacaso.com. Reserving the ticker symbol is not a guarantee that the company will go public. Listing on the Nasdaq is subject to approvals.\nDon’t Miss Your Chance to Become an Early Investor in Pacaso:\nDisclaimers\nPlease be advised that alternative investments carry a risk of monetary loss. Neither Benzinga nor its staff recommends that you buy, sell, or hold any security. We do not offer investment advice, personalized or otherwise. All information contained on this website is provided as general commentary for informative and entertainment purposes and does not constitute investment advice.\nBenzinga will not accept liability for any loss or damage, including without limitation to, any loss of profit, which may arise directly or indirectly from use of or reliance on this information, whether specifically stated in the above Terms of Service or otherwise. Benzinga recommends that you conduct your own due diligence and consult a certified financial professional for personalized advice about your financial situation."
    },
    {
      "url": "https://www.benzinga.com/money/rad-intel?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47017349",
      "text": "Benzinga Money is a reader-supported publication. We may earn a commission from the advertisers associated with this article. Read our Advertiser Discloser.\nWhile many companies tout and claim AI capabilities, only one has developed a technology that’s delivering triple-digit returns on investment for some of the largest Fortune 1000 companies.\nTake Hasbro for example. When the iconic toy company wanted to relaunch HeroQuest—a beloved 1980s board game—they faced a familiar marketing challenge—how to reach both nostalgic fans and new audiences in a fragmented digital landscape.\nTheir solution came from a company most people have never heard of, despite its growing influence with major brands. Using RAD Intel's AI-powered platform, Hasbro achieved over 120% improved paid performance, nearly 90% higher engagement rates, and doubled content effectiveness – impressive results in today’s highly competitive, noisy gaming market.\nNamed a “groundbreaking step for the creator economy” by Fast Company, Rad Intel has already attracted the interest of more than 9,000 investors, including insiders from Adobe, Fidelity Ventures, Google, Meta, Amazon, and YouTube, and raised more than $41 million.\nHaving seen its valuation grow 1,600% in just four years, RAD Intel is now offering accredited investors an early opportunity to join a company that other investors have called their “best seed investment ever.”\nWhat’s more, RAD Intel has secured its official NASDAQ ticker—RADI. It’s locked in and marks a significant step toward the public markets, backed by real traction and accelerating scale.\nFrom A Fortune 1000 Secret to an $85M Valuation\nFounded by serial entrepreneur Jeremy Barnett and tech veteran Bradley Silver, RAD Intel has quietly built a strong client roster and boasts activations across the likes of Fortune 1000 brands, including Hasbro, Skechers, Home Depot, Sephora, Fenty, Sweetgreen, MGM, Omnicom, Since Tomorrow, Glossier, Athelta, and The North Face.\nThe company's rise hasn't gone completely unnoticed by institutional investors, either. RAD Intel has secured over $49 million in funding from venture capitalists, Fortune 1000 companies and tech industry insiders—including Adobe, and insiders from Google, Amazon, YouTube, and Meta.\nThat traction is opening doors fast—embedding Rad Intel in every critical moment where brands battle for consumer attention and measurable growth. Investors have seen the company’s valuation grow from $5 million to $85 million in just four years, in large part due to being a leader in AI.\nAccording to Boston Consulting Group, companies that are already scaling AI—like Rad Intel— expect a 60% higher revenue growth over the next three years than their peers. Additionally, AI leaders achieved 1.5 times higher revenue growth, 1.6 times greater shareholder returns, and 1.4 times higher ROIs.\nAI That Actually Works: 12+ Years of Research Behind the Tech\nAI is everywhere these days, but RAD Intel's technology stands apart. Built on more than a decade of research and development — and years of real-world client success.\n\"We've created an artificial intelligence that understands the language of the internet,\" CEO Jeremy Barnett told Forbes last year. The proprietary AI analyzes datasets from Reddit, Google, and social platforms to gauge real-time sentiments and trends, helping brands make data-driven decisions rather than relying on outdated assumptions or personal bias.\nThe platform's capabilities solve three marketing challenges:\n1. The Audience Problem\nRAD Intel's persona generator reveals exactly who a brand's customers are—their topics, interests, and the triggers that drive them to action. It eliminates guesswork in customer targeting.\n2. The Influencer Problem\nThe platform's AI identifies the perfect personalities to deliver a brand's message for maximum ROI, ranking influencers based on expertise, audience demographics, and authentic engagement.\n3. The Content Problem\nBefore content creation begins, RAD Intel's technology reveals what customers care about, who's best to deliver the message, and the key ingredients for content that resonates—and often goes viral.\nThe capabilities have delivered impressive results across industries:\n- For Sweetgreen: nearly 200% improved ad performance and 25%+ improved cost per acquisition\n- For The Black Tux: 40% cost savings and over 90% campaign lift\n- For Ro Health: nearly 4x ROI and 5x engagements\n- For MGM Resorts: nearly 3.3x ROI and 482,000 engagements\nGrowth Strategy: Doubling Down on Success\nRAD Intel isn't just adding clients—it's deepening relationships with existing ones. Contracts for 2025 have already doubled from 2024, with expanded agreements from top clients like Hasbro and Omnicom added to the fold.\nThe company is also implementing a novel growth strategy called \"Artificial Intelligence Buyouts\" (AIBOs), which refers to acquiring small and medium-sized marketing agencies and integrating RAD Intel's AI technology to boost their capabilities and profitability.\nAccording to its website, the company “aims to acquire legacy marketing agencies and integrate RAD Intel's technology to deliver material revenue synergies and operational efficiencies.\" They're targeting agencies with $5 million to $30 million in revenue that are EBITDA positive with strong recurring client bases, established sales forces and experienced client success teams.\nThis strategy will allow RAD Intel to scale rapidly through acquisition while bringing AI capabilities to traditional agencies—creating value for both the acquired businesses and RAD Intel investors.\nExpanding the AI Edge\nRad Intel recently raised $12 million through its Reg A funding round, which it will use to fuel several growth initiatives:\n- Further development of RAD Intel's technology to improve paid advertising across Google, TikTok, and Meta\n- Innovation of enterprise solutions with API partners like TikTok to enhance content insights\n- Recruitment of top-tier talent across AI, product development, operations, and sales\n- Implementation of additional self-serve features for enterprise clients\n- Continuous improvement of client success rates through AI-informed performance analytics\nEntrepreneur magazine recognized RAD Intel as \"positioned to influence the market\" in the AI revolution, noting that \"the true winners in the AI revolution will be those who can effectively leverage it to solve real-world problems.\"\nLimited-Time Investment Opportunity\nInterested accredited investors have an opportunity to join before it's too late. This pre-IPO high-growth startup is currently offering equity shares at $0.63 each, with a minimum investment of $4,999.68.\nAs Fast Company said, \"It's only a matter of time before RAD's platform is a household name.\" For accredited investors looking to participate in the AI transformation of marketing, this offering represents an opportunity to join over 9,000 others who have already recognized RAD Intel's potential to reshape how brands connect with consumers in the digital age.\nDisclaimers\nPlease be advised that alternative investments carry a risk of monetary loss. Neither Benzinga nor its staff recommends that you buy, sell, or hold any security. We do not offer investment advice, personalized or otherwise. All information contained on this website is provided as general commentary for informative and entertainment purposes and does not constitute investment advice.\nBenzinga will not accept liability for any loss or damage, including without limitation to, any loss of profit, which may arise directly or indirectly from use of or reliance on this information, whether specifically stated in the above Terms of Service or otherwise. Benzinga recommends that you conduct your own due diligence and consult a certified financial professional for personalized advice about your financial situation.\nAbout Caroline Lubinsky\nCaroline is a professional writer and editor from Charlotte, North Carolina. She is currently the Senior Editor for the Mortgages and Real Estate Investing verticals at Benzinga. Extremely detail-oriented, Caroline prioritizes publishing factually accurate content that maintains journalistic integrity. Besides her work at Benzinga, Caroline currently writes freelance commerce articles for Everyday Health, Forbes, Men’s Health, and Taste of Home."
    },
    {
      "url": "https://www.benzinga.com/money/mode-mobile-2?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47017349",
      "text": "Benzinga Money is a reader-supported publication. We may earn a commission from the advertisers associated with this article. Read our Advertiser Discloser.\nYou see a shocking number of ads daily – researchers estimate between 6,000 and 10,000 and 375 to 625 per waking hour. In the modern age, most of them come from social media apps whose entire business model revolves around constantly showing you ads and keeping 100% of the revenue. But what if users got a share? That company might just grow its revenue by 32,481% in three years, help users earn and save $325 million and be named Deloitte's fastest-growing software company in North America. That’s what Mode Mobile did. You can still get in for just $0.30 per share.\nReaching Financial Stability One Tap at a Time\nMost Americans can’t afford a $1,000 emergency bill. That means many are one car breakdown or ER visit away from serious financial trouble. There's no quick fix to such a big financial challenge that over 50% of Americans face. However, it's safe to bet that the masses will flock to any good solutions. Mode Mobile created one such solution years ago by allowing people to earn money doing what they already spend a third of their waking hours on – tapping, scrolling and looking at their smartphone screens.\nMode Mobile developed a smartphone called EarnPhone, which allows users to earn and save money by playing video games, listening to music and reading the news. With the phone priced at an affordable $99, the barriers to adoption are low. However, users can earn income on their existing devices as well. This extreme competitiveness has allowed Mode Mobile to attract over 50 million registered beta users. Launching the finalized version could bring in millions more, helping the company reach its goal of $150 million in annual revenue within three years.\n6,955,000,000 Users to Go\nCurrently, seven billion smartphones worldwide provide functionality or entertainment but take all the profits. Mode Mobile’s disruption offers the same benefits but allows users to earn money at a time when the prices of goods are skyrocketing. Just like Airbnb lets users earn extra cash by renting out their bedrooms and Uber allows users to make money on their rides back home from work, Mode Mobile wants to enable its users to make money from their phones. However, its total addressable market is much larger than Airbnb’s and Uber’s – currently at over $1 trillion.\nYou can invest in Mode Mobile at $0.30 per share with a minimum investment of $4,950. Plus, the company is offering the chance to earn up to 120% in bonus shares, if you invest more. All funding rounds open to non-accredited investors, including Mode Mobile’s, are limited in time. So, if you’d like to be part of the future it's building, consider acting soon.\nDisclaimer:\nAN OFFERING STATEMENT REGARDING THIS OFFERING HAS BEEN FILED WITH THE SEC. THE SEC HAS QUALIFIED THAT OFFERING STATEMENT, WHICH ONLY MEANS THAT THE COMPANY MAY MAKE SALES OF THE SECURITIES DESCRIBED BY THE OFFERING STATEMENT. THE OFFERING CIRCULAR THAT IS PART OF THAT OFFERING STATEMENT IS AVAILABLE HERE.\nMode Mobile recently received their ticker reservation with Nasdaq ($MODE), indicating an intent to IPO in the next 24 months. An intent to IPO is no guarantee that an actual IPO will occur.\nThe Deloitte rankings are based on submitted applications and public company database research, with winners selected based on their fiscal-year revenue growth percentage over a three-year period.\nDisclaimer: Please be advised that alternative investments carry a risk of monetary loss. Neither Benzinga nor its staff recommends that you buy, sell, or hold any security. We do not offer investment advice, personalized or otherwise. All information contained on this website is provided as general commentary for informative and entertainment purposes and does not constitute investment advice. Benzinga will not accept liability for any loss or damage, including without limitation to, any loss of profit, which may arise directly or indirectly from use of or reliance on this information, whether specifically stated in the above Terms of Service or otherwise. Benzinga recommends that you conduct your own due diligence and consult a certified financial professional for personalized advice about your financial situation."
    }
  ],
  "argos_summary": "Real estate investor Graham Stephan advises that the best investment properties are often dated homes that can be renovated, as they offer greater profit potential compared to new homes. He emphasizes the importance of buying undervalued properties that require cosmetic upgrades while ensuring they are structurally sound. Additionally, comparing the costs of fixing up a property to similar, updated homes can help investors make informed decisions about profitability.",
  "argos_id": "RDW75YA5F"
}