{
  "url": "https://www.pymnts.com/artificial-intelligence-2/2025/stanford-ai-agents-lab-finds-promising-covid-19-drug-leads-in-days/",
  "authorsByline": "PYMNTS",
  "articleId": "09be3f56b2b44917b87728a92bef2d65",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2025/08/COVID-AI-Healthcare.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T22:30:48+00:00",
  "addDate": "2025-08-08T22:39:31.313932+00:00",
  "refreshDate": "2025-08-08T22:39:31.313934+00:00",
  "score": 1.0,
  "title": "Stanford AI Agents’ Lab Finds Promising COVID-19 Drug Leads in Days",
  "description": "Like any busy scientist, Stanford University professor James Zou would like to explore hundreds of research ideas but only has time for two or three. So",
  "content": "The human researcher only did 1% of the work in this project, with the rest done by the AI agents.\n\nThe AI agents created 92 novel candidates in days; two showed strong binding to strains that evade existing antibody therapies.\n\nLike any busy scientist, Stanford University professor James Zou would like to explore hundreds of research ideas but only has time for two or three. So he thought of a novel approach: Create artificial intelligence (AI) agents modeled after his lab and let them tackle experiments he doesn’t have time to do.\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\nThe result was the discovery — in a few days — of two novel COVID-19 vaccines that are more effective at tackling the latest variants and also does a better job of protecting against the original strain.\n\n“At the time of this project, there were actually no good, known binders” or molecules that attach to target viruses, Zou said in an interview with PYMNTS. “This is a very challenging, open-research problem, but also a very important and impactful problem from a public health perspective.”\n\nThe two candidates to treat SARS-CoV-2, the virus that causes COVID-19, were culled from 92 candidates put forward by the AI agents. These 92 were narrowed down from trillions of choices and combinations that the AI agents had to sort through and review.\n\nWhat’s novel is that the AI agents used nanobodies instead of antibodies, which are more commonly used by scientists. Nanobodies are tiny, rare cousins of antibodies typically found in animals like camels.\n\n“If we asked most human researchers to design binders, I think many of them would probably have said, ‘Oh, let’s try to design antibodies,’” Zou said. “Nanobodies are much less common … so it’s kind of an interesting and maybe perhaps a surprising decision by the virtual lab of AI agents.”\n\nThe agents explained their reasoning: Nanobodies are smaller, easier to model computationally, and potentially more stable. The resulting 92 nanobodies they designed did bind to the latest strains of the coronavirus in physical experiments, whereas existing human-designed antibodies did not.\n\n“These novel nanobodies created by the virtual lab does show binding, and we also tested them against other COVID strains, and they also show binding,” Zou said. “I’m quite impressed by the output of the results.”\n\nZou, an associate professor of biomedical data science at Stanford, said the virtual lab was greeted with “a lot of excitement and good feedback” from other researchers, who are now using it to tackle problems like looking for biomarkers for Alzheimer’s disease.\n\nNotably, the virtual lab is flexible and can applied to tackle challenges in other domains. It is also fully open source, Zou said. That means it can be downloaded, modified and distributed freely as long as it is appropriately accredited. The lab can be accessed on GitHub.\n\nZou’s findings are detailed in a paper published in the journal Nature. Zou, who led the study, has as his co-authors John Pak — a scientist at the Chan Zuckerberg Biohub — and Kyle Swanson, a Stanford computer science graduate.\n\nThe use of AI is gaining traction in healthcare, in areas such as drug discovery.\n\nIn January, Google DeepMind CEO Demis Hassabis said he expects to see AI-designed drugs come to clinical trials by the end of the year.\n\nSee also: Healthcare Executives See Rising Risk From Outdated Payment Systems\n\nPowered by GPT-4o from OpenAI, the virtual lab has two lead AI agents: the principal investigator (PI) and the scientific critic (SC). The PI creates other AI agents and manages them. The SC scrutinizes the agents’ solutions and pushes them to improve. A human researcher would oversee the project at a high level.\n\nIn the experiment, the PI created the following agents for its team: an immunologist, a computational biologist and a machine learning specialist. All the agents collaborated in meetings, whether team or individual.\n\nIn a team meeting, the PI agent sets the agenda — for example, whether to design nanobodies or antibodies. It offers initial thoughts and poses more specific questions to the agents to answer. Each agent contributes to the discussion based on their expertise. The SC points out flaws, asks questions and suggests improvements.\n\nThe lab also ran five parallel meetings with the same agenda to get more robust, overall agent responses, Zou said. The PI agent summarizes the meetings, draws conclusions and makes a decision or decides on next steps. It presents the summary for the human researcher to review.\n\nThere are separate individual meetings as well, when a specific task is at hand that suits one of the agents. That agent gets individual instructions.\n\nAll of this was done in a matter of days.\n\n“If we want to implement and design these pipelines and create these pipelines ourselves, it could easily take multiple months to do that,” Zou said.\n\nThe human researcher only gave 1% of the work and the rest was done by the agents, according to Zou. Out of 122,462 words written in the project, the human researcher contributed 1,596.\n\nTo minimize hallucinations, the scientific critic would challenge other agents’ conclusions. The team also ran multiple meetings in parallel and synthesized responses for better consensus. “The consensus is more robust and less prone to hallucinations,” Zou said.\n\nZou views the platform as a collaborative tool — not a replacement for human scientists.\n\n“Collaboration between AI and human is certainly much more effective than either the human alone or the AI alone,” Zou said. “In problems like medicine and diseases, there’s actually no shortage of problems to solve.”",
  "medium": "Article",
  "links": [
    "https://www.pymnts.com/healthcare/2025/healthcare-executives-rising-risk-outdated-payment-systems/",
    "https://www.pymnts.com/artificial-intelligence-2/2025/google-deepmind-ceo-ai-designed-drugs-coming-to-clinical-trials-in-2025/",
    "https://openai.com/",
    "https://www.pymnts.com/healthcare/2025/white-house-and-tech-firms-teaming-on-health-data-sharing/",
    "https://www.pymnts.com/healthcare/2025/white-house-says-60-firms-commit-to-build-digital-health-ecosystem/",
    "https://www.linkedin.com/in/demishassabis/?original_referer=https%3A%2F%2Fwww%2Egoogle%2Ecom%2F&originalSubdomain=uk",
    "https://www.linkedin.com/in/johnedwardpak/",
    "https://www.czbiohub.org/",
    "https://www.linkedin.com/in/kyle-swanson-564ab787/",
    "https://www.nature.com/articles/s41586-025-09442-9",
    "https://www.pymnts.com/healthcare/2025/ambience-healthcare-gains-unicorn-status-with-243-million-funding-round/",
    "https://github.com/zou-group/virtual-lab"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "AI agents",
      "weight": 0.09663711
    },
    {
      "name": "other AI agents",
      "weight": 0.08662849
    },
    {
      "name": "Stanford University professor James Zou",
      "weight": 0.067903176
    },
    {
      "name": "James Zou",
      "weight": 0.066940166
    },
    {
      "name": "Zou",
      "weight": 0.06663281
    },
    {
      "name": "most human researchers",
      "weight": 0.06348775
    },
    {
      "name": "other researchers",
      "weight": 0.06347872
    },
    {
      "name": "AI",
      "weight": 0.06044185
    },
    {
      "name": "human scientists",
      "weight": 0.058118306
    },
    {
      "name": "other COVID strains",
      "weight": 0.05571383
    }
  ],
  "topics": [
    {
      "name": "AI"
    },
    {
      "name": "Coronavirus"
    },
    {
      "name": "Academia"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Health/Health Foundations & Medical Research",
      "score": 0.833984375
    },
    {
      "name": "/News/Health News",
      "score": 0.76806640625
    },
    {
      "name": "/Health/Medical Literature & Resources/Other",
      "score": 0.63037109375
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.57763671875
    },
    {
      "name": "/News/Technology News",
      "score": 0.541015625
    },
    {
      "name": "/Jobs & Education/Education/Academic Conferences & Publications",
      "score": 0.489990234375
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.449462890625
    }
  ],
  "sentiment": {
    "positive": 0.25952148,
    "negative": 0.19641113,
    "neutral": 0.5439453
  },
  "summary": "Stanford University professor James Zou used artificial intelligence (AI) agents to create new drug leads in a matter of days. The AI agents created 92 new candidates for the COVID-19 vaccine, with two showing strong binding to strains that evade existing antibody therapies. The team used nanobodies instead of antibodies, which are more commonly used by scientists. Nanobodies are smaller, easier to model computationally, and potentially more stable. The two new vaccines were found to be more effective at tackling the latest variants of the virus and protecting against the original strain. The virtual lab was praised for its flexibility and ability to tackle challenges in other domains.",
  "shortSummary": "Stanford University’s virtual lab discovered promising COVID-19 vaccine candidates using nanobodies, using AI to design and test existing antibodies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3e935b62b33d44a39e38caa283bff7be",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.pymnts.com/healthcare/2025/white-house-and-tech-firms-teaming-on-health-data-sharing/",
      "text": "Health and Human Services Secretary Robert F. Kennedy Jr. and Centers for Medicare and Medicaid Services (CMS) Administrator Mehmet Oz were expected to host tech executives at a White House event this week, Bloomberg News reported Sunday (July 27), citing sources familiar with the matter.\nAccording to the report, the plan was put together in coordination with the White House, following a May effort by CMS to get public input on barriers to sharing patient data.\n“This initiative aims to build a smarter, more secure, and more personalized health care system — one that improves patient outcomes, reduces provider burden, and drives greater value through private-sector innovation and aligned federal leadership,” CMS spokesperson Catherine Howden said in a written statement to Bloomberg.\nThe sources did not identify which tech companies had been invited, but said those firms would take a voluntary pledge around interoperability, or how health technology systems connect with each other and share information.\nThe pledges will involve principles involving patient and provider access to health information, and data sharing standards, the report said. Howden said CMS will share more information next week about the timeline for the plan.\nBloomberg noted that both Democratic and Republican administrations have sought to improve data flow throughout the U.S. healthcare system to bolster quality and prevent waste.\nIn other healthcare news, the recent PYMNTS Intelligence report “Clicks, Care & Copays — How Each Generation Navigates Digital Healthcare” finds that, despite being digital natives, younger Americans are technologically struggling when it comes to making basic healthcare payments.\n“And this, after all, is a generational cohort for whom roughly 1 in 3 reported that their most recent healthcare experience was a virtual or digital one,” PYMNTS wrote earlier this month.\n“But between opaque pricing, fragmented systems, and clunky user experiences, the financial side of healthcare is often a labyrinth of inefficiency. The result can be frequently missed payments, frustrated patients and untold sums in potentially uncollected revenue.”\nThe research also found that a wave of innovation is transforming the sector’s long-time bottlenecks around revenue cycle management, while impacting the ways patients pay for care and develop financial relationships with their provider networks and systems.\n“FinTech startups and healthcare platforms are turning to embedded finance, particularly payment orchestration, in-app billing, and intelligent reminders; to reimagine how patients pay for care,” the report said."
    },
    {
      "url": "https://www.linkedin.com/in/johnedwardpak/",
      "text": "About\nI am a protein engineer, biochemist and structural…\nExperience & Education\nVolunteer Experience\n-\nProfessional Mentor\nTechWomen\n- 2 months\nEducation\nTechWomen is an initiative of the U.S. Department of State’s Bureau of Educational and Cultural Affairs. TechWomen empowers, connects and supports the next generation of women leaders in science, technology, engineering and mathematics (STEM) from Africa, Central and South Asia, and the Middle East by providing them the access and opportunity needed to advance their careers, pursue their dreams, and inspire women and girls in their communities.\n-\nAssistant Instructor\nCity College of San Francisco\n- 4 months\nEducation\nBTEC 120 (Molecular and Cellular Biotechnology) is an evening class which focuses on teaching molecular and cellular biology laboratory skills to students. I helped demonstrate various lab techniques to the students.\nPublications\nHonors & Awards\n-\nPostdoctoral Teaching Fellowship\nUniversity of California, San Francisco\nThe UCSF Postdoctoral Teaching Fellowship program provides training in the practice of\nsmall group teaching, hands-on experience in facilitating small-group discussions, and an\nopportunity to be a part of an integrated medical school curriculum. Teaching fellows are also exposed to innovative teaching modules. Each fellow receives an honorarium, structured mentoring, and formal evaluations. -\nOntario Graduate Scholarship\nGovernment of Ontario\nThe Ontario Graduate Scholarship (OGS) program offers 3,000 annual scholarships to eligible students who will pursue graduate studies in order to complete a Master's degree, PhD or Doctorate at a university in Ontario, Canada. The student must satisfy eligibility criteria and maintain a minimum academic standard of an \"A-\" or 80% average over the preceding two years of study in order to qualify for the scholarship. Final decisions on the candidacy of each individual is made by the Ministry of…\nThe Ontario Graduate Scholarship (OGS) program offers 3,000 annual scholarships to eligible students who will pursue graduate studies in order to complete a Master's degree, PhD or Doctorate at a university in Ontario, Canada. The student must satisfy eligibility criteria and maintain a minimum academic standard of an \"A-\" or 80% average over the preceding two years of study in order to qualify for the scholarship. Final decisions on the candidacy of each individual is made by the Ministry of Training, Colleges and Universities, which has agreements with some universities that use a Pass or Fail system, such as York University does for some of its non-graded courses in the Faculty of Environmental Studies. Selections are based on reports to the ministry by an advisory agency known as the Selection Board (Ontario Graduate Scholarship), which consists of a chairperson and eight members representing five broad disciplines of study. The board meets twice a year to evaluate candidate applications for the OGS.\n-\nNational Book Award\nUniversity of Toronto\nThe University of Toronto National Book Award Program is intended to recognize and reward the very best Canadian secondary school students, regardless of which university those students choose to attend. These are students who demonstrate superior academic performance, original and creative thought, and exceptional achievement in a broad context. They excel in academic pursuits, demonstrate enthusiasm for intellectual exploration and have a strong involvement in the lives of their schools and…\nThe University of Toronto National Book Award Program is intended to recognize and reward the very best Canadian secondary school students, regardless of which university those students choose to attend. These are students who demonstrate superior academic performance, original and creative thought, and exceptional achievement in a broad context. They excel in academic pursuits, demonstrate enthusiasm for intellectual exploration and have a strong involvement in the lives of their schools and communities.\nLanguages\n-\nEnglish\nNative or bilingual proficiency\n-\nFrench\nLimited working proficiency\nOther similar profiles\n-\nNeeraj Kapoor (PhD)\nDirector, Scientific Lead, Group A Strep vaccine program at Vaxcyte I Rockefeller Univ & IITK Alumni\nConnect -\nXuhai Jonathan Lu\nConnect -\nMark Wilson\nConnect -\nBen Haley\nConnect -\nShenshen Hu, PhD, MBA\nConnect -\nDaniel Leventhal, MS, PhD\nConnect -\nGain Robinson, MPH\nAssociate Principal Scientist at Merck\nConnect -\nOmar Barnaby, Ph.D.\nConnect -\nKefeng Sun\nConnect -\nTing Song\nConnect\nExplore top content on LinkedIn\nFind curated posts and insights for relevant topics all in one place.\nView top content"
    },
    {
      "url": "https://www.pymnts.com/healthcare/2025/ambience-healthcare-gains-unicorn-status-with-243-million-funding-round/",
      "text": "The company announced Tuesday (July 29) that it had raised $243 million in a new funding round. Ambience says the funding will help it expand its artificial intelligence (AI) platform, which helps streamline administrative tasks in the healthcare field.\n“Documentation has long been a source of friction,” CEO Michael Ng said in a news release. “Ambience is turning it into a source of strength — transforming how clinicians deliver care, how administrators run operations, and how patients experience the system.”\nAccording to the release, Ambience’s technology helps clinicians by automating documentation with “ambient listening,” helping reduce “cognitive burden” and documentation time, giving clinicians more time to focus on best patient care.\nWhile the company did not provide a new valuation, the $1 billion figure was included in a Bloomberg News report on the new round.\nPYMNTS looked at the role AI plays in the healthcare sector earlier this month in a conversation with Autonomize AI CEO Ganesh Padmanabhan.\n“We are in a unique time in history,” he told PYMNTS CEO Karen Webster. “Until large language models specifically came about, it was impossible to distill information out of complex medical clinical documentation and contextualize it for different workflows. Now it’s possible.”\nBut as Webster noted, agentic AI has become the latest talking point no matter its real-world results in crucial areas.\n“It used to be generative AI, now it’s agentic AI,” she said. “But this is still an emerging technology. Why is now the time for it to be applied in healthcare, given that a lot of the industry is still trying to get its arms around basic automation?”\n“Healthcare is one of those industries with a lot of knowledge work,” Padmanabhan replied. “Data is often created by humans for other humans to consume, which makes automation innately harder.”\nAt the core of the problem is a healthcare industry drowning in administrative burdens. The U.S. spends an estimated $1.5 trillion on healthcare administration each year, a cost that leads to delayed care, clinician burnout and poor patient experience.\nMeanwhile, research by PYMNTS Intelligence shows the pitfalls of relying too much on manual solutions in healthcare in an age of automation.\nThe research shows that 67% of executives and decision-makers in healthcare payer organizations say their companies’ manual payment platforms are actively reducing efficiency. And 74% of these professionals said these platforms increased their organizations’ exposure to risks of regulatory fines and penalties."
    },
    {
      "url": "https://www.nature.com/articles/s41586-025-09442-9",
      "text": "Abstract\nScience frequently benefits from teams of interdisciplinary researchers1–3, but many scientists do not have easy access to experts from multiple fields4,5. While large language models (LLMs) have shown an impressive ability to aid researchers across diverse domains, their uses have been largely limited to answering specific scientific questions rather than performing open-ended research6–11. Here, we expand the capabilities of LLMs for science by introducing the Virtual Lab, an AI-human research collaboration to perform sophisticated, interdisciplinary science research. The Virtual Lab consists of an LLM principal investigator agent guiding a team of LLM scientist agents through a series of research meetings, with a human researcher providing high-level feedback. We apply the Virtual Lab to design nanobody binders to recent variants of SARS-CoV-2. The Virtual Lab creates a novel computational nanobody design pipeline that incorporates ESM, AlphaFold-Multimer, and Rosetta and designs 92 new nanobodies. Experimental validation reveals a range of functional nanobodies with promising binding profiles across SARS-CoV-2 variants. In particular, two new nanobodies exhibit improved binding to the recent JN.1 or KP.3 variants12,13 while maintaining strong binding to the ancestral viral spike protein, suggesting exciting candidates for further investigation. This demonstrates how the Virtual Lab can rapidly make an impactful, real-world scientific discovery.\nThis is a preview of subscription content, access via your institution\nAccess options\nAccess Nature and 54 other Nature Portfolio journals\nGet Nature+, our best-value online-access subscription\n27,99 € / 30 days\ncancel any time\nSubscribe to this journal\nReceive 51 print issues and online access\n199,00 € per year\nonly 3,90 € per issue\nRent or buy this article\nPrices vary by article type\nfrom$1.95\nto$39.95\nPrices may be subject to local taxes which are calculated during checkout\nSimilar content being viewed by others\nAuthor information\nAuthors and Affiliations\nCorresponding authors\nSupplementary information\nSupplementary Information\nThis file contains Supplementary Notes 1-6, Supplementary Figures 1-3, Supplementary Table 1, Supplementary Boxes 1-3, and Supplementary References.\nRights and permissions\nAbout this article\nCite this article\nSwanson, K., Wu, W., Bulaong, N.L. et al. The Virtual Lab of AI agents designs new SARS-CoV-2 nanobodies. Nature (2025). https://doi.org/10.1038/s41586-025-09442-9\nReceived:\nAccepted:\nPublished:\nDOI: https://doi.org/10.1038/s41586-025-09442-9"
    },
    {
      "url": "https://www.linkedin.com/in/demishassabis/?original_referer=https%3A%2F%2Fwww%2Egoogle%2Ecom%2F&originalSubdomain=uk",
      "text": "Co-Founder & CEO, Google DeepMind\nGreater London, England, United Kingdom\n137K followers\n500+ connections\nAbout\nCo-Founder & CEO of Google DeepMind - working on AGI, responsible for AI breakthroughs such as AlphaGo, the first program to beat the world champion at the game of Go; and AlphaFold, which cracked the 50-year grand challenge of protein structure prediction and was recognised with the 2024 Nobel Prize in Chemistry. Revolutionising drug discovery at Isomorphic Labs. Ultimately trying to understand the fundamental nature of reality.\nActivity\n-\nI am deeply grateful to Sir Demis Hassabis—a truly brilliant Cambridge alumnus and an extraordinarily impactful, pioneering researcher—for his…\nI am deeply grateful to Sir Demis Hassabis—a truly brilliant Cambridge alumnus and an extraordinarily impactful, pioneering researcher—for his…\nLiked by Demis Hassabis\n-\nI’m thrilled to welcome Ben to Isomorphic Labs as our Chief Medical Officer. His arrival marks our next chapter as we progress towards the clinic…\nI’m thrilled to welcome Ben to Isomorphic Labs as our Chief Medical Officer. His arrival marks our next chapter as we progress towards the clinic…\nShared by Demis Hassabis\n-\nAmazing opportunity for startups to access Google DeepMind models & expertise !\nAmazing opportunity for startups to access Google DeepMind models & expertise !\nShared by Demis Hassabis\nExperience\nEducation\nMore activity by Demis\n-\nAn insightful day at our London office yesterday! We were thrilled to host Prof Sir Mene Pangalos, a distinguished member of our Scientific Advisory…\nAn insightful day at our London office yesterday! We were thrilled to host Prof Sir Mene Pangalos, a distinguished member of our Scientific Advisory…\nLiked by Demis Hassabis\nOther similar profiles\nExplore top content on LinkedIn\nFind curated posts and insights for relevant topics all in one place.\nView top content"
    },
    {
      "url": "https://www.pymnts.com/artificial-intelligence-2/2025/google-deepmind-ceo-ai-designed-drugs-coming-to-clinical-trials-in-2025/",
      "text": "During a fireside chat at the World Economic Forum in Davos, Switzerland, Hassabis said these drugs are being developed at Isomorphic Labs, a for-profit venture created by Google parent firm Alphabet in 2021 that was tasked to reinvent the entire drug discovery process based on first principles and led by AI.\n“That’s the plan,” Hassabis said.\nWhile large language models have taken the spotlight, Hassabis said that the field of AI as it applies to science is “a lot richer than just the language models and things like AlphaFold.” AlphaFold2, for which he and colleague John Jumper won the Nobel Prize in Chemistry in 2024, is an AI model that predicts the 3D structure of proteins, solving a half-century biology challenge.\nArdem Patapoutian, a professor of neuroscience at Scripps Research and a 2021 Nobel laureate in Physiology or Medicine who joined Hassabis at the panel, described AlphaFold as “one of the most amazing, quick advancements in science I’ve ever experienced.” He said 25 years ago, it took a Ph.D. student five years to find out the structure of a protein. With AlphaFold, “just type in the sequence and it tells you the structure,” he said.\nHassabis said AlphaFold has now predicted the structures of 200 million proteins known to science — work that would have taken an estimated billion years using traditional methods. The latest version, AlphaFold3, has expanded capabilities to analyze protein interactions with other proteins, ligands and DNA/RNA.\nAI Comes Full Circle\nPatapoutian also highlighted AI’s potential to unlock the mysteries of brain function, particularly in understanding complex neural patterns and their relationship to behavior. He noted that while current technology can predict behavior in simple organisms, understanding more complex brains remains a significant challenge that AI could help solve.\n“Overall, neuroscience is very excited about AI,” Patapoutian said. It could help scientists make headway in understanding the brain because “despite decades of research, we still really don’t understand how the brain works.”\nEven after looking at the pattern of neurons firing in a brain, it remains difficult to predict what behavior is going to come next. Perhaps for a simple creature like the C. elegans worm that only has 300 neurons, it is possible, Patapoutian said. But for anything more complex, “we have absolutely no idea, and that has been one of the Holy Grails of neuroscience, not just to predict behavior, but (also) more complex thoughts, intelligence, consciousness.”\nHassabis said in this sense AI has come full circle. The structure of the brain inspired AI’s neural networks, and now AI can help scientists understand how the brain works.\nHassabis said the next frontier for AlphaFold3 is to determine how mutations can cause changes in the structure and function of the protein. AlphaFold2 solved the problem of a static protein, but he pointed out that proteins are not static. Eventually, he sees the advent of personalized medicine, where a drug is optimized for each individual’s own metabolism.\nVirtual Cells and AGI\nLooking ahead, Hassabis outlined his vision for a “virtual cell” simulation that could revolutionize biological research. Patapoutian said traditionally, the way one finds a protein structure is to pull it out of a cell. But then you don’t know its natural position in the cell. Seeing the cell as a whole and where proteins are located would be more informative, Patapoutian added.\nFor example, being able to view a protein in a cell could let you see that it is, say, localized at the tip of the neuron where specific activity is going on, Patapoutian said. “That’s going to give you a very different understanding than just levels of expression, for example.”\nPatapoutian also wondered where Hassabis procured the data to train his AI models. Hassabis said beyond the public datasets, there are companies you can hire to generate specialized data to fill in the gaps. His team also uses synthetic data they generate themselves. On the flip side, they could also develop algorithms that need less data to train on. This is to mimic human beings, who can generalize based on a few examples.\nAsked when artificial general intelligence (AGI) will arrive, Hassabis said people who say it will arrive in months might have an ulterior motive of needing to raise funding. “AI is over-hyped in the near term, but I think it’s still under-appreciated in the medium- to long-term.” He believes AGI could come in five to 10 years, but a couple of major breakthroughs need to arrive first.\nThese breakthroughs are a fully reasoning and planning skillset, and the ability to truly be creative, not just mimic artistic styles or novel ideas it has been trained on, Hassabis said. “Could you come up with general relativity like Einstein did based on the knowledge that he had at the time in the 1900s? I don’t think any of our systems could do anywhere close to that.”"
    },
    {
      "url": "https://www.pymnts.com/healthcare/2025/healthcare-executives-rising-risk-outdated-payment-systems/",
      "text": "While many sectors have embraced the swift currents of digital innovation, a significant portion of the U.S. healthcare industry remains anchored in outdated payment practices, creating inefficiencies and straining financial health.\nA recent report, “Healthcare Payments Need Modernization to Drive Financial Health,” illuminates how manual payment systems are significantly hindering the efficiency and revenue generation of healthcare providers across the United States. The analysis reveals that despite other industries rapidly adopting digital tools, healthcare’s lag in this area underscores an urgent need for transformation. Digital payments are presented as a pivotal solution, poised to revolutionize the sector by not only improving crucial cash flow and reducing financial risk but also enhancing overall patient satisfaction. While major industry players are increasingly integrating modernized systems, the report points out that significant adoption gaps persist, indicating substantial opportunities for further innovation and growth.\nKey data points from the report include:\n- Sixty-seven percent of executives and decision-makers in healthcare payer organizations report that their firms’ manual payment platforms are reducing efficiency. This highlights a pervasive bottleneck within the industry’s administrative operations.\n- Nearly three-quarters (74%) of these executives also stated that manual payment platforms leave their organizations more exposed to risks of regulatory fines and penalties. This underscores a significant compliance and financial vulnerability tied to outdated systems.\n- The repercussions extend to the consumer experience, with 33% of surveyed U.S. healthcare consumers expressing frustration when modern payment solutions, such as digital wallets or mobile payments, are not offered. Notably, 24% of these consumers would consider switching providers if their preferred payment method was unavailable, emphasizing the crucial link between payment convenience and patient retention.\nBeyond these core findings, the report delves into the broader implications and strategic pathways for modernization. As highlighted by Saurabh Joshi, president of CSG Forte, interviewed for the report, the benefits of digital transformation extend well beyond mere payment speed. He emphasizes that a modernized payment system also offers enhanced security and compliance, better integration with electronic health record systems and improved patient satisfaction. Non-digitized methods, such as cash or paper checks, introduce a cascade of operational complexities, including manual processing errors, delayed reconciliations, and elevated security and fraud risks, all of which ultimately escalate costs and impede cash flow for providers.\nThe industry’s hesitancy to adopt these innovations often stems from perceived risks, upfront costs and the daunting task of system maintenance. However, the report strongly advises healthcare providers to engage trusted payment partners who offer industry-specific solutions. Such partners can navigate the unique complexities of healthcare payments, provide counsel on optimal processes, and ensure systems remain compliant and equipped with the latest technology, even offering backward compatibility with legacy platforms.\nUltimately, the shift to modern payment technologies is presented not merely as an option but as a strategic imperative for sustainable success, enabling providers to future-proof their operations, reduce inefficiencies, and strengthen invaluable patient relationships. Alexander Paull, vice president of Global Merchant Services at American Express, reinforces this perspective, noting that modern payment solutions are pivotal in helping providers improve operational efficiency, reduce risk and align with evolving patient preferences."
    },
    {
      "url": "https://github.com/zou-group/virtual-lab",
      "text": "The Virtual Lab is an AI-human collaboration for science research. In the Virtual Lab, a human researcher works with a team of large language model (LLM) agents to perform scientific research. Interaction between the human researcher and the LLM agents occurs via a series of team meetings, where all the LLM agents discuss a scientific agenda posed by the human researcher, and individual meetings, where the human researcher interacts with a single LLM agent to solve a particular scientific task.\nPlease see our paper The Virtual Lab of AI agents designs new SARS-CoV-2 nanobodies for more details on the Virtual Lab and an application to nanobody design for SARS-CoV-2.\nIf you use the Virtual Lab, please cite our work as follows:\nSwanson, K., Wu, W., Bulaong, N.L. et al. The Virtual Lab of AI agents designs new SARS-CoV-2 nanobodies. Nature (2025). https://doi.org/10.1038/s41586-025-09442-9\nAs a real-world demonstration, we applied the Virtual Lab to design nanobodies for one of the latest variants of SARS-CoV-2 (see nanobody_design). The Virtual Lab built a computational pipeline consisting of ESM, AlphaFold-Multimer, and Rosetta and used it to design 92 nanobodies that were experimentally validated.\nPlease see the notebook nanobody_design/run_nanobody_design.ipynb for an example of how to use the Virtual Lab to create agents and run team and individual meetings.\nThe Virtual Lab can be installed using pip or by cloning the repo and installing the required packages. Installation should only take a couple of minutes.\nOptionally, first create a conda environment.\nconda create -y -n virtual_lab python=3.12\nconda activate virtual_lab\nThe Virtual Lab can be installed via pip.\npip install virtual-lab\nTo install a local version of the Virtual Lab, clone the repo and then install the package.\ngit clone https://github.com/zou-group/virtual_lab.git\ncd virtual_lab\npip install -e .\nThe Virtual Lab currently uses GPT-4o from OpenAI. Save your OpenAI API key as the environment variable OPENAI_API_KEY\n. For example, add export OPENAI_API_KEY=<your_key>\nto your .bashrc\nor .bash_profile\n."
    },
    {
      "url": "https://www.pymnts.com/healthcare/2025/white-house-says-60-firms-commit-to-build-digital-health-ecosystem/",
      "text": "The White House said Wednesday (July 30) that several healthcare and tech companies pledged to begin building a “next-generation digital health ecosystem.”\nThis initiative will begin by working to make it easier to share information between patients and providers and to increase the availability of tools like apps that will provide patients with information and resources, the Centers for Medicare & Medicaid Services (CMS) said in a Wednesday press release.\nThe information-sharing between patients and providers will be facilitated by a new CMS Interoperability Framework, while the tools for patients will include apps that help with diabetes and obesity management, conversational artificial intelligence assistants that help with health-related tasks, and tools to “kill the clipboard” by replacing paper intake forms with digital check-in methods, according to the release.\nAmong the 60-plus firms that have committed to this project are Amazon, Anthropic, Apple, Google and OpenAI, per the release.\nIn total, a list of early adopters provided with the release includes 21 data networks, 11 health systems and providers, 18 patient-facing apps (conversational AI assistants), eight patient-facing apps (diabetes and obesity), 12 patient-facing apps (“Kill the Clipboard”) and five payers.\nHealth and Human Services (HHS) Secretary Robert F. Kennedy, Jr., said in the release that health data and other resources have long been blocked by “bureaucrats and entrenched interests.”\n“That ends today,” Kennedy said. “We’re tearing down digital walls, returning power to patients, and rebuilding a health system that serves the people.”\nCMS Administrator Dr. Mehmet Oz said in the release that this initiative aims to bring to the healthcare system the sort of innovations that have transformed other sectors of the economy.\n“With the commitments made by these entrepreneurial companies today, we stand ready for a paradigm shift in the U.S. healthcare system for the benefit of patients and providers,” Oz said.\nOne of the tech companies that committed to participate, artificial intelligence (AI) startup Anthropic, said in a Wednesday press release that this initiative will enable patients and their doctors to access health information when and where they need it.\n“Healthcare silos have persisted for far too long, and we believe Anthropic’s AI technology can play a transformative role in eliminating these silos to improve the delivery of care for millions of Americans,” Anthropic Chief Product Officer Mike Krieger said in the release.\nThe PYMNTS Intelligence and AI-ID collaboration “Generative AI Can Elevate Health and Revolutionize Healthcare” found that the generative AI market for healthcare is projected to reach $22 billion by 2032 as stakeholders in healthcare, technology and investment sectors recognize the technology’s potentially transformative impact on the sector."
    }
  ],
  "argos_summary": "Stanford professor James Zou's project utilized AI agents to design novel COVID-19 nanobodies, resulting in the identification of two candidates that effectively bind to recent virus variants. The AI agents, which performed 99% of the work, generated 92 candidates from trillions of possibilities, showcasing the potential of AI in drug discovery. This collaborative approach between human researchers and AI is seen as a promising model for future scientific research, with applications extending beyond COVID-19 to other health challenges.",
  "argos_id": "RW8OHJDBX"
}