{
  "url": "https://www.dailymail.co.uk/news/article-14984555/cop-sent-texts-watched-tiktok-suspect-died-coos-bay.html",
  "authorsByline": "Sophie Gable",
  "articleId": "ef9adcdd701f4196bdae015a01e7ddc9",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/09/02/101058517-0-image-m-16_1754703189864.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-09T03:04:01+01:00",
  "addDate": "2025-08-09T02:08:43.688330+00:00",
  "refreshDate": "2025-08-09T02:08:43.688332+00:00",
  "score": 1.0,
  "title": "Cop sent intimate texts while suspect died in back of his car",
  "description": "A new lawsuit claims that police officers were negligent while a man lay dying in back of the patrol car.",
  "content": "A police officer is accused of sending intimate texts and watching TikTok videos while a man suffering from a mental health crisis overdosed in the backseat of his police cruiser.\n\nNathan Bradford Smith, 33, died last July after he was arrested by the Coos Bay Police Department in Oregon for disorderly conduct while appearing to be high on methamphetamine, according to a lawsuit filed on behalf of his family.\n\nOfficers interacted with Smith twice that day before they discovered him lying on the sidewalk in front of a Motel 6.\n\nThe first time was around 11 am when they took Smith's meth pipe, and the second was around 3 pm when they responded to a report that he was screaming outside of a business and scaring customers.\n\nOfficers Benjamin Martin, Tristan Smith, and Wesley O’Connor came in contact with the man a third time when he was lying on a sidewalk in front of the motel around 5 pm.\n\nAttorneys representing Smith's family argue that body camera footage shows that responding officers treated him 'aggressively' even though he didn't resist arrest.\n\nO'Connor is heard over the radio stating, 'Get your hand away from me you weirdo,' during the arrest.\n\nO'Connor was also seen putting his weight on Smith's left shoulder and grabbing his left wrist during the arrest.\n\nThe lawsuit accuses the officers of neglecting Smith's mental state and arresting him instead.\n\nSmith struggled to move his body, and his breath was rapid and exaggerated when he entered the police vehicle, according to the lawsuit.\n\nThe officers are accused of not providing medical care to Smith while he was gasping for air with his eyes closed in the backseat.\n\nDash camera footage showed Smith slumping in the backseat of the car. When Martin arrived at the police department, he allegedly sprayed his vehicle with air freshener and abandoned Smith in the car with the windows closed.\n\n'While in CBPD headquarters, Defendant [Martin] scrolled on his phone, reviewed and responded to intimate text messages, and looked at TikTok for several minutes,' the lawsuit states.\n\nAs the officer allegedly scrolled on his phone inside the department, Smith was 'shaking uncontrollably and gasping for breath' in the vehicle.\n\nOfficer Martin scrolled through TikTok and responded to a text message that read, 'I’m so ready for snuggles I feel like i haven’t seen you in a week,' Oregon Live reported, citing a police report.\n\nMartin then checked on Smith in the vehicle and found him unconscious. He then allegedly performed 'sternal rubs' and administered Narcan.\n\nAbout 20 minutes after Smith was first placed in the vehicle, ambulances arrived and treated him on the scene before departing for a local hospital.\n\nLess than 45 minutes later, Smith died after a cardiac arrest. His cause of death was listed as hyperthermia due to meth intoxication and wearing multiple layers of heavy clothing.\n\nThe hospital where Smith died was under two miles from where he was arrested, but the police officers decided to take him in the opposite direction to the department.\n\nThe lawsuit alleges that police officers delayed getting Smith medical care for over 40 minutes, which was a crucial lapse in time that ultimately led to his death.\n\nSmith's family argues that officers could've saved his life had they taken him straight to the hospital instead of leaving him in the backseat alone in a police vehicle.\n\n'In his final moments in Defendant Martin’s vehicle, gasping for air while Defendant Martin scrolled TikTok, Mr. Smith was clearly suffering physically, mentally, and emotionally. His death from hyperthermia likely caused him great physical pain and distress,' the lawsuit states.\n\nThe three officers are facing claims of negligence and the abuse of a vulnerable person.\n\nDaily Mail reached out to the Coos Bay Department Chief of Police for comment on the lawsuit and additional information on the officers' current employment.\n\nSmith's father, Kurt, told Oregon Live that police came to his work to notify him of his son's death.\n\nHe added that police didn't share the circumstances of how his son died but instead he was forced to learn about the cause of death from the funeral home.\n\nIn an investigative report, Martin claimed that there were 'no officers available to monitor Nathan' while he was inside the station, and he left him in the vehicle to call another officer during a shift change.\n\n'This lawsuit shines a light on the police's inappropriate responses to people in health emergencies,' Hannah Bland, a staff attorney with the Civil Rights Project, who is representing Smith's family, told Daily Mail.\n\n'These officers are first responders and yet they neglected their duty to get Mr. Smith—a person in their custody—to the hospital when he was exhibiting clear signs of medical distress.\n\n'Instead of calling for an ambulance, Officer Martin spent this crucial time scrolling TikTok while Mr. Smith was overheating and gasping for air in the back of his police car.'",
  "medium": "Article",
  "links": [
    "https://www.oregonlive.com/crime/2025/08/oregon-cop-texted-scrolled-tiktok-while-man-gasped-for-air-collapsed-in-back-of-patrol-car-suit-says.html",
    "https://www.dailymail.co.uk/news/oregon/index.html",
    "https://www.dailymail.co.uk/news/tiktok/index.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mr. Smith",
      "weight": 0.10471125
    },
    {
      "name": "Smith",
      "weight": 0.10370576
    },
    {
      "name": "police officers",
      "weight": 0.10204893
    },
    {
      "name": "Tristan Smith",
      "weight": 0.10089078
    },
    {
      "name": "Nathan Bradford Smith",
      "weight": 0.09740049
    },
    {
      "name": "Officers Benjamin Martin",
      "weight": 0.08798854
    },
    {
      "name": "responding officers",
      "weight": 0.08555258
    },
    {
      "name": "Officers",
      "weight": 0.076794334
    },
    {
      "name": "officers",
      "weight": 0.076794334
    },
    {
      "name": "police",
      "weight": 0.07627819
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.9658203125
    },
    {
      "name": "/News/Local News",
      "score": 0.9482421875
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.9453125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.921875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.91748046875
    },
    {
      "name": "/News/Other",
      "score": 0.52392578125
    },
    {
      "name": "/Sensitive Subjects/Recreational Drugs",
      "score": 0.4453125
    }
  ],
  "sentiment": {
    "positive": 0.05203247,
    "negative": 0.7182617,
    "neutral": 0.23022461
  },
  "summary": "A police officer in Coos Bay, Oregon, is accused of sending intimate texts and watching TikTok videos while Nathan Bradford Smith, a man suffering from a mental health crisis, overdosed in the backseat of his police cruiser. Smith was arrested for disorderly conduct and appeared to be high on methamphetamine. The officers, Benjamin Martin, Tristan Smith, and Wesley O’Connor, allegedly failed to provide medical care to Smith while he was gasping for air in the car. The lawsuit alleges that the officers ignored Smith's mental state and instead arrested him. The three officers are facing claims of negligence and the abuse of a vulnerable person.",
  "shortSummary": "A lawsuit accuses police of negligence and abuse after a mentally ill man overdosed in their car, causing multiple medical failures and his death from hyperthermia.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "43c3775b53bd43d19dd557673f0c7801",
  "places": [
    {
      "osmId": "6590101532",
      "road": "North Bayshore Drive",
      "town": "Coos Bay",
      "county": "Coos County",
      "state": "Oregon",
      "postcode": "97420",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 43.378688,
        "lon": -124.217635
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.dailymail.co.uk/news/oregon/index.html",
      "text": "Advertisement\nRELATED TOPICS FOR Oregon\nOregon - News and Updates on the US State\nPage\nCop sent intimate texts and watched TikToks while suspect died in back of his cruiser, lawsuit alleges\n09/08/25 02:04\nA new lawsuit claims that police officers were negligent while the man lay dying in back of the patrol car. One officer is even accused of scrolling TikTok and sending an intimate message while the suspect gasped for air in the backseat of a police cruiser....read\nFDA upgrades recall alert for sweetener\n07/08/25 20:08The FDA has upgraded a recall alert for sugar substitutes produced in Oregon that it warned could cause 'temporary or medically reversible adverse health consequences.'FDA issues warning for popular sweetener over potentially FATAL health risk\n07/08/25 19:45The FDA has upgraded a recall alert for sugar substitutes produced in Oregon that it warned could cause 'temporary or medically reversible adverse health consequences.'Portland 'serial killer' charged with fourth murder... after woke ex-governor freed him from prison EARLY\n07/08/25 14:35Jesse Calhoun was indicted on one count of second-degree murder and one count of abuse of a corpse in the murder of Kristin Smith, whose partial remains were found in February 2023.Fast food lover details his quest to visit all 13,544 McDonald's in US\n07/08/25 13:28Donny Boys kicked off the endeavor in July 2024, and has been to around 350 locations in the last year in states like Wisconsin, Illinois, California, Oregon, and Washington.I'm eating at every McDonald's in America - I'm 350 in and here is what it's done to my body\n07/08/25 12:35Donny Boys kicked off the endeavor in July 2024, and has been to around 350 locations in the last year in states like Wisconsin, Illinois, California, Oregon, and Washington.Portland removes all speed cameras for newer models\n05/08/25 19:30A progressive city has removed all of its speed cameras - but plans for them to be replaced with upgraded models.Progressive city removes ALL its speed cameras...but they'll soon be back in far greater numbers\n05/08/25 16:22A progressive city has removed all of its speed cameras - but plans for them to be replaced with upgraded models.Sha'Carri Richardson's boyfriend Christian Coleman defends sprinter after domestic violence arrest\n04/08/25 02:18Last week, Richardson was arrested on a fourth-degree domestic violence offense for allegedly assaulting Coleman at the Seattle-Tacoma International Airport.Noah Lyles shoved by Kenny Bednarek with US sprinters coming to blows as tense rivalry erupts\n04/08/25 00:54It was Lyles who landed the day's biggest blow on the track, passing Bednarek for the win and then looking his way to talk some trash.California mountain road hides a 'portal in time' to Jurassic era\n03/08/25 12:30Beneath the redwoods of Northern California lies one of the world's rarest geologic sites - a place where the Earth's mantle breaks the surface and ancient ocean floor lines the road.The California mountain road hiding a 'portal in time' to Jurassic era\n01/08/25 18:25Beneath the redwoods of Northern California lies one of the world's rarest geologic sites - a place where the Earth's mantle breaks the surface and ancient ocean floor lines the road.9/11 mastermind could be freed in days despite confession\n01/08/25 10:15Haroon Aswat, 50, is set to be freed from prison within days despite confessing to his role in 9/11 and the July 7 bombings, a newly-released court document has revealed.Terrorist who confessed to masterminding 7/7 London bombings AND 9/11 'could be walking the streets of Britain in days'\n01/08/25 00:23Haroon Aswat, 50, is set to be freed from prison within days despite confessing to his role in 9/11 and the July 7 bombings, a newly-released court document has revealed.Cleveland Browns analyst in furious Shedeur Sanders meltdown on claims quarterback is being 'sabotaged'\n31/07/25 13:20With the Browns' QB race set to be incredibly competitive, one radio host pushed back hard on the idea that the team may be actively trying to hurt the chances of one of those hopeful starters.Americans evacuate to higher ground as tsunami alarm sounds\n30/07/25 12:24Evacuation orders were issued for low-lying areas of Hawaii overnight, with sirens blaring across parts of Oahu and residents seen scrambling to pack bags and flee inland.Panicking Americans head for higher ground sparking huge traffic jams after tsunami alarm rings out in Hawaii... while others go surfing and cheer from skyscrapers\n30/07/25 09:10Evacuation orders were issued for low-lying areas of Hawaii overnight, with sirens blaring across parts of Oahu and residents seen scrambling to pack bags and flee inland.Largest earthquake swarm ever recorded at Mount Rainier\n28/07/25 18:24The US Geological Survey has said that one of the most feared volcanos in the US has been shaking for three weeks and they don't know why it hasn't stopped.Largest earthquake swarm ever recorded at massive US volcano\n28/07/25 17:57The US Geological Survey has said that one of the most feared volcanos in the US has been shaking for three weeks and they don't know why it hasn't stopped.$1,000 bonus among efforts by schools to counter chronic absenteeism\n28/07/25 14:06Schools are paying students $1,000 bonuses to attend class as absenteeism continues to stalk American campuses five years after the pandemic.Disturbing trend that has been growing among children since the pandemic\n27/07/25 18:20The Department of Education has called on states and school districts nationwide to address the factors driving the shocking trend.Map reveals where it will cost you $40,000 to give BIRTH... as natural-born population risks going 'extinct'\n25/07/25 19:39Americans living in 10 states may have to fork over nearly $30,000 just to give birth, shocking new figures published by health insurance claims analyst FAIR Health have revealed.Trader Joe's continues its expansion with 30 new stores\n25/07/25 18:48A popular supermarket chain is adding stores in 18 states including Arizona, California, Florida, Georgia, Texas, Utah, and Virginia.Little People, Big World star Matt Roloff CALLS OFF engagement to longtime girlfriend Caryn Chandler\n23/07/25 00:46The couple got engaged in April 2023 after six years together and had planned to tie the knot in 2024, when he first gave her the ring, but a wedding never materialized.Warning as underwater volcano off US West Coast is rocked by 300 earthquakes: 'It could erupt any day'\n19/07/25 12:39A massive volcano has shown critical signs that an eruption could be coming soon, but experts have said that there may be no way of telling when it'll blow.Thousands flee to higher ground after 7.3 earthquake hits Alaska coast\n16/07/25 22:08Thousands of Americans are bracing for a tsunami after a major 7.3 magnitude earthquake hit off the US coast.Experts on high alert as multiple volcanoes in 'Pacific Ring of Fire' suddenly come to life\n15/07/25 15:54Volcanoes across several US states have recently become active, while no immediate danger is reported, experts remain watchful as seismic activity continues.Thousands at risk of chronic disease as faulty tests fuel silent epidemic sweeping the US\n11/07/25 14:45Scientists in Oregon have revealed that many people suffering from long-term symptoms caused by a type of bite do not seek ongoing help from their doctor.Scientists warn 'doomsday tsunami' likely to strike US\n10/07/25 16:54A doomsday tsunami is likely to strike the US in the near future, but scientists say it's better if it hits sooner rather than later.Scientists issue urgent warning over 'doomsday tsunami' set to hit parts of the US... is your hometown at risk?\n10/07/25 16:18A doomsday tsunami is likely to strike the US in the near future, but scientists say it's better if it hits sooner rather than later.Former NBA star Ben McLemore learns fate after being found guilty over shock rape and assault charges\n09/07/25 19:59A former NBA first-round pick has been sentenced to more than eight years in an Oregon state prison after being found guilty of rape and sexual assault - stemming from an incident in 2021.Catastrophic US volcano 'is still active' as scientists reveal source behind hundreds of earthquakes in 12 hours\n09/07/25 18:51More than 400 earthquakes rattled Washington's Mount Rainier over just 12 hours on Tuesday, sparking fears that the catastrophic volcano could soon erupt.One person injured after protesters cling to the hood of an ICE van\n09/07/25 16:05Shocking video captured the moment protests erupted into chaos when a group of people attempting to stop deportations flung themselves onto the hood of an ICE van.Hundreds of small earthquakes rattle Washington's Mount Rainier\n09/07/25 10:20Hundreds of small earthquakes rattled one of the most dangerous volcanos in the US Tuesday, setting off fears it could be waking up.Hundreds of earthquakes rattle catastrophic volcano sparking fears of an eruption\n08/07/25 22:17Hundreds of small earthquakes rattled one of the most dangerous volcanos in the US Tuesday, setting off fears it could be waking up.Bindi Irwin reveals her daughter Grace's incredible talent - as the four-year-old takes after uncle Robert\n06/07/25 12:32Bindi Irwin has revealed that her daughter Grace is already exhibiting incredible artistic skills.Carnage breaks out at Portland ICE detention center as woke crowd tries to storm holding cells\n05/07/25 15:47Tear gas, flares and mass arrests rocked Portland, Oregon as protesters stormed an ICE detention center just hours after Trump signed his sweeping immigration bill into law.Another warning issued for beaches across the US\n04/07/25 16:12Officials are warning beachgoers to take care amid the July 4 celebrations, over fears that their beaches could be contaminated with deadly bacteria.Officials expand beach closures on July 4 due to hidden deadly bacteria\n04/07/25 15:10Officials are warning beachgoers to take care amid the July 4 celebrations, over fears that their beaches could be contaminated with deadly bacteria.Map exposes deadly arsenic in drinking water across US\n02/07/25 16:52Scientists found millions of Americans may be regularly exposed to dangerous levels of arsenic, and they may not even know it.Alarming map exposes deadly arsenic in drinking water across US states... is your hometown poisoning you?\n02/07/25 16:40Scientists found millions of Americans may be regularly exposed to dangerous levels of arsenic, and they may not even know it.Concerned NFL fans react to reports scandalized Deshaun Watson is mentoring Browns rookie Shedeur Sanders\n30/06/25 18:44After reports indicated that Cleveland's scandalized starting QB is mentoring young stars on the team, sports fans worried that his troublesome characteristics may rub off on them.Owners of home made famous in Twilight movies rake in $140K a year by renting property to obsessed fans\n30/06/25 03:59A modest house in Oregon has turned into a cash machine for the owners as superfans hungry to relive a famous love story and eager to stay at the property.The three states where it's illegal to set off fireworks on July 4\n29/06/25 14:35Fireworks are the star of the show on July 4 for Americans across the country - but in a handful of states lighting up the sky is actually illegal.Damning NTSB report reveals reason door blew off Alaska Airlines 737 Max mid-flight after Boeing issued bizarre excuse\n24/06/25 22:59The National Transportation Safety Board has been investigating what went so catastrophically wrong just six minutes into the January 2024 flight from Oregon to California.Ritzy Oregon island rocked after beautiful girl, 17, is killed during boozy party at local bigwig's $1.8m home\n24/06/25 16:01High school senior Ava Crews died on May 18 in Sauvie Island close to the ritzy town of Scappoose, just north of Portland, Oregon. Criminal charges have been leveled against her friend, Ayden Heard.Kobe Bryant's nephew Jett Washington commits to Oregon football team\n20/06/25 19:26The 17-year-old is considered one of the top prospects in the class of 2026. He also visited the likes of Alabama and USC, while Georgia, Michigan and Texas made offers for him.I ignored all the signs... then doctors found an aggressive cancer. Here is what I wish I knew\n20/06/25 18:14When an Oregon engineer and ultramarathon runner realized he could no longer keep up with his workouts, he assumed it was just work stress. It was actually deadly cancer.Map reveals states polluted with toxin that may cause autism... do you live in one?\n20/06/25 15:40A map revealed in a new study from researchers at Washington University in St Louis shows the areas most polluted with a chemical that has been linked to a higher risk of autism.Portland Anti-ICE protests escalate with tear gas and rubber bullets\n20/06/25 10:40Hundreds of masked protestors descended on the streets of Portland , Oregon and marched on the local ICE facility, railing against the government's deportation agenda.Anti-ICE protests explode in Portland as cops use tear gas and rubber bullets to control crowds\n19/06/25 23:10Hundreds of masked protestors descended on the streets of Portland , Oregon and marched on the local ICE facility, railing against the government's deportation agenda.All episodes of sitcom dubbed 'the funniest show on TV' are finally free to stream on BBC iPlayer\n19/06/25 12:12The American mockumentary sitcom, created by Superstore creators Eric Ledgin and Justin Spitzer, hit our screens on American broadcasting channel NBC in November 2024.How a tech genius immigrant turned Nvidia into a $2TN business\n17/06/25 15:09Nvidia CEO Jensen Huang is now the 20th richest man in the world after catapulting the firm to a $2 trillion value.New study reveals the four states where psychopaths are most likely to live\n17/06/25 14:37Scientists have uncovered the U.S. states where people are more likely to have 'dark' traits.Report: How far 100K salary goes in major US cities\n17/06/25 14:07A six-figure salary was once considered the benchmark of a comfortable lifestyle but new research suggests it depends exactly where you live.The four US states where psychopaths are most likely to live... are YOU living near one?\n17/06/25 06:22Scientists have uncovered US states where people are more likely to have 'dark' traits, including narcissism, Machiavellianism, psychopathy and sadism.The famously woke state where lawmakers keep CRYING while revealing personal stories in legislature chambers\n16/06/25 20:50The legislative chambers in a woke state has turned into a very vulnerable place for many lawmakers who have continuously been seen crying over personal stories and experiences.9 California towns where you can still snap up a home for $150K\n16/06/25 13:21Amid California's housing affordability crisis, there are still nine towns where homes can be snatched up for just $150,000 - a fraction of the statewide average.Woke rocker causes outrage at first concert of biggest US tour since MAGA member was forced out\n12/06/25 18:27Marcus Mumford upset fans as he abruptly stopped his concert and launched into a foul-mouthed tirade last week - which was captured in a shock video.Ready-to-eat shrimp recalled due to bacteria\n12/06/25 16:54The Food and Drug Administration has warned consumers to not eat Bornstein Seafoods of Bellingham, Washington's Cooked & Peeled, Ready-To-Eat Coldwater Shrimp.Iconic coffee chain to move its headquarters out of Oregon\n12/06/25 15:42Oregon is losing a chain that generated more than $11 billion in revenue last year to a red state - and local Republicans say Democrat failures are to blame.Huge blow for Oregon as woke state's second biggest company moves HQ to ARIZONA, with GOP blaming Dems\n12/06/25 15:01Oregon is losing a chain that generated more than $11 billion in revenue last year to a red state - and local Republicans say Democrat failures are to blame.Scorching 'heat dome' descends over usually mild states as NWS warns of record temperatures\n10/06/25 21:35The National Weather Service said the mercury would soar into the high 90s and the low 100s, with extreme heat warnings already in place throughout Tuesday.Bindi Irwin shares sweet family photo with husband Chandler Powell and daughter Grace - following her shock health emergency: 'Very grateful'\n09/06/25 01:52Bindi Irwin has shared a heartwarming family picture after she visited Disney World with her husband Chandler Powell and her daughter Grace.Fury as Oregon school holds 'Drag Day' where kids are told to turn up as their favorite Pride hero\n06/06/25 18:45Children attending the Arts and Technology Academy, in Eugene, were told they could dress up for a four-day long celebration of Pride.Top 10 most loathed highways in US revealed with California dominating\n06/06/25 15:21Three highways in California ranked among the worst-regarded roads in the country, according to a new survey.High school athlete details 'traumatic' incident with trans rival that left her feeling 'violated'\n05/06/25 15:19'The shock that came was the mistrust and the lying, I felt very betrayed, I felt betrayed by the adults and the coaches on the other team that let it happen without my consent and my knowledge,' she said.Fans spot glaring detail in Terri and Steve Irwin's wedding photo as they mark huge marriage milestone\n04/06/25 01:02Terri Irwin has shared a heartfelt tribute to her late husband Steve to mark what would have been their 33rd wedding anniversary - and fans are all saying the same thing.Oregon high school star reveals shocking message from officials after protesting trans athletes\n03/06/25 23:41Rather than taking their spots on the podium, footage showed the girls turning their backs to the crowd before being ushered away from the ceremony by an official.Huge 50ft beast from the depths of the ocean washes up on Oregon coast\n03/06/25 20:03A towering, 50-foot giant from the depths of the Pacific Ocean washed up on the Oregon coast Thursday.8 states planning to ban the sale of gas-powered cars\n03/06/25 19:20At least eight states are planning to ban the sale of new gas-powered cars in the next decade - and others are considering joining them.11 people wounded in mass stabbing attack at Oregon church\n02/06/25 12:21A violent rampage erupted Sunday evening at a homeless shelter in Salem, Oregon, leaving 11 people stabbed just across the street from the city's police headquarters, according to authorities.Mass stabbing in downtown Salem as at least 11 people are rushed to hospital\n02/06/25 03:55Salem Police said they responded to a call about a stabbing incident involving multiple victims at the Union Gospel Mission of Salem at around 7.15pm..Musk's X suffers outage again\n30/05/25 20:41Elon Musk has suffered another blow as his $44 billion prized possession has crashed.Shedeur Sanders makes shock admission about Browns teammates... after claim he could be cut amid QB battle\n29/05/25 23:23Shedeur Sanders has made a shock admission about his Cleveland Browns teammates after a claim came forward that he could be a candidate to be cut and not make the 53-man roster.Biden gave loan relief only to minority farmers, whistleblower says\n28/05/25 19:53The Biden Administration secretly discriminated against white farmers when it came to loan forgiveness, a whistleblower said.Bindi Irwin holds onto her mother Terri as she lands in LA after her emergency surgery as her husband Chandler enjoys father-daughter time with four-year-old Grace\n27/05/25 21:55Bindi Irwin appears to be on the mend after stepping out for the first time following an emergency health crisis that saw her land in hospital in New York.New Jersey mom chooses controversial legal suicide over 'undignified' death from painful disease\n26/05/25 19:22On the morning of Barbara Goodfriend's death, friends and family gathered at her house, laughing at old stories and sharing tears.Cops arrest woman who used latino dating app to lure man in before robbing and shooting him\n25/05/25 20:35Two 20-year-old women in Oregon allegedly used a Latino dating app to lure a man into a robbery that ended in gunfire. Now, both are behind bars-and authorities say this may not be their only crime.Oregon pet shop owner learns his fate after sexually abusing little girl, 12, who volunteered in his store\n24/05/25 20:41Daniel Stuebgen, 54, of Lincoln City, was found guilty of sexually abusing the preteen five separate times in 2023 in an Oregon court.\nPage\nDON'T MISS\n-\nThe One Show's Alex Jones fights back tears as husband Charlie Thomson makes surprise appearance live on air\n-\nEXCLUSIVE\nPrincess Andre hits back at feud claims after her mum Katie Price said she was 'upset' not to appear in her new ITV series and insists: 'This is MY show'\n-\nKelly Brook topples over and ends up in a 'neck brace' after TikTok trend appears to go very wrong\n-\nEXCLUSIVE\nFreddie Mercury's 'secret' daughter speaks out for the first time ahead of publication of bombshell book, saying: 'I didn't want to share my Dad with the whole world'\n-\nEmily Ratajkowski wows in very cheeky bikini as she dines on fries and beer on boat trip\n-\nFancy a party in paradise? Two tickets for Centreforce's Tenerife Weekender 2025 are up for grabs\nAd Feature\n-\nDavid Beckham appears to offer tentative olive branch as he likes son Brooklyn's latest social media post as family feud rumbles on\n-\nEXCLUSIVE\nInside Nicola and Brooklyn's secret SECOND wedding that's ultimate snub to the Beckhams. Feud turns truly toxic after 'do-over' ceremony - as insiders tell of Victoria's fury with 'viper' Nicola\n-\nPrincess and Junior Andre hit back at 'nepo baby' label as they launch new ITV2 reality show: 'This is our own career'\n-\nSmart moves: The 10 must-know education brands helping the UK learn better and faster\nAd Feature\n-\nBrooklyn Beckham slammed by celebrity chef Aldo Zilli for 'burning bacon' in his spaghetti carbonara\n-\nEXCLUSIVE\nThe vile porn videos that mean Taylor Swift could have 'wreaked havoc' on her ex Matty Healy: 'Everyone in the room was disgusted'\n-\nBBC sitcom slapped with trigger warning for 'discriminatory language' in ANOTHER woke crackdown\n-\nKelly Clarkson's talk show future is revealed amid her ex-husband Brandon Blackstock's tragic death\n-\nEXCLUSIVE\nThe Yorkshire Vet's Matt Jackson-Smith reveals how to care for your dog as they grow u, and his dog Harry's VERY unusual traits\nAd Feature\n-\nEmmerdale star looks completely unrecognisable 18 months after quitting the soap - but can YOU guess who it is?\n-\nLeigh-Anne Pinnock sizzles in racy bikini top and hot pants as she storms the stage at Boardmasters Festival\n-\nKim Kardashian flew to Mexico to get unusual treatment not approved in the US as she shares scary photos from the operating room\n-\nSir Elton John shuts down rumours of ABBA-style hologram show with X-rated joke\n-\nThe stars of the much-loved Wittering Whitehalls podcast on how a hearing check has changed their relationship\nAd Feature\n-\nAmelia Gray Hamlin sparks fan concerns over her EXTREMELY thin frame in topless beach photos\n-\nGladiator star Steel reveals risky procedure contributed to premature son's death as doctors fought to save his life after being born at 23 weeks\n-\nMel C sports Spice Girls football shirt as she joins Kate Lawler in leading the stars at Flackstock festival in honour of late Love Island host Caroline Flack\n-\nEXCLUSIVE\nSir Cliff Richard, 84, shows off his sweet angelic side for his 2026 calendar as he offers up biscuits and poses with wings for his highly anticipated annual photoshoot\n-\nEating for bump, and beyond! Pregnancy nutritionist reveals her top diet advice for those trying to conceive, pregnant, breastfeeding and baby nutrition\nAd Feature\n-\nShrinking Lizzo flaunts her newly svelte figure in activewear... after poking fun at Sydney Sweeney controversy\n-\nEDEN CONFIDENTIAL: So what's the deal with birthday girl Beatrice's new business venture?\n-\nEmmerdale actress pregnant: Actress reveals she is expecting third child in heartwarming update\n-\nNepo baby, 22, stuns in a white dress as she storms the catwalk during Copenhagen Fashion Week - but can YOU guess who her famous parent is?\n-\nSip smarter this summer: Discover the 'Magic of Moderate Drinking' with these simple tips\nAd Feature\n-\nMargot Robbie looks like Britney Spears from her ...Baby One More Time video with cute schoolgirl braids\n-\nEXCLUSIVE\nSarah Michelle Gellar looks forever young in Buffy reboot... but her iconic character gets drastic makeover that will divide fans\n-\nKerry Katona, 44, moves in with her toyboy boyfriend Paolo Magaglione, 33, two months after meeting on Celebs Go Dating\n-\nCoco Austin poses in an impossibly high-cut sheer swimsuit that does nothing to hide her butt\n-\nGet set for a totally WICKET summer: The Hundred is rolling into cities across the UK - this is how YOU and your family can join the fun\nAd Feature\n-\nMachine Gun Kelly admits he pushed himself into a 'delirious state' doing a water fast for FOUR DAYS\n-\nEXCLUSIVE\nYou wouldn't see that on the catwalk! Kate Moss, 51, gets the giggles as she's surrounded by naked sunbathers on nudist beach - before nearly baring all herself\n-\nEXCLUSIVE\nJennifer Aniston and Jim Curtis 'bonded over their rescue dogs' as he debuts his senior pooch Odie in NYC\n-\nSydney Sweeney is caught arriving to the Devil Wears Prada 2 set suggesting she has a role... after her 'good jeans' controversy\n-\nFrom spending when you're abroad to absolutely smashing the preparation and packing, we reveal how to holiday like a pro\nAd Feature\n-\nLucy Spraggan reveals she suffered gruesome intimate injury while filming Celebrity SAS as she faces reconstructive surgery\n-\nAndi Oliver reveals her fury at Chris Moyles over vile comments he made about her daughter Miquita and compares him to a 'drunk racist'\n-\nSharon Osbourne reveals the 'biggest mistake' she made with husband Ozzy in a candid interview before his death\n-\nOti Mabuse shows off her sexy dance moves in a striped bikini and black mini skirt on holiday with husband Marius\n-\nFrom Icelandic waterfalls to Japanese tea ceremonies: The new cruise collection that promises adventure as well as ultra-luxury\nAd Feature\n-\nKelly Clarkson's ex Brandon Blackstock seen WEEKS before death with daughter Savannah in heartbreaking photo\n-\nHollyoaks star Jennifer Metcalfe flaunts her toned physique in stylish navy blue activewear after hitting the gym in Liverpool\n-\nCoronation Street and Mrs Brown's Boys star Frank Grimes dead aged 78 following a short illness\n-\nKym Marsh left heartbroken as she mourns family tragedy following death of onscreen father Frank Grimes\n-\nKate Gosselin, 50, is unrecognizable in new video... 15 years after flaunting her bikini body during Jon & Kate Plus 8 era\n-\nMachine Gun Kelly finally breaks silence on Megan Fox split and reveals secret rehab stint: 'I broke this home'\n-\nHuge BBC detective series AXED despite cliffhanger ending in bitter blow to fans\n-\nPhil Collins fans outraged as 'sick' AI photos of star, 74, appearing frail in hospital bed while being visited by Paul McCartney, 83, go viral\n-\nEXCLUSIVE\nLove Island winner Toni Laites reveals if she will be relocating to the UK as Harry Cooksley declares he 'loves being the villain'\n- After FOUR years of menopause struggles I took a chance on this supplement - now I'm sleeping better and finally feeling more like myself SHOPPING\n-\nLila Moss, 22, looks incredible in a white bikini as she enjoys a swim with boyfriend Yoni Helbitz, 23, during trip to nudist beach with her mother Kate in Ibiza\n-\nThe Chase star Mark Labbett says he 'couldn't wait to leave' a recent date because he didn't find the mystery woman 'attractive'\n-\nKatie Holmes lights up around ex Joshua Jackson as fans think she is 'still in love with him'\n-\nThe moment a 'feud' between Loose Women's Myleene Klass and Frankie Bridge spilled onto live TV as sources claim ITV have been forced to step in\n-\nAmy Childs and Lauren Goodger put on leggy displays as they reunite with TOWIE co-stars at ITV launch\n- The 'liquid gold' facial tanner that fights ageing and has beauty fans obsessed: 'Best tanning drops EVER!' (now 20% off, but not for long) SHOPPING\n-\nDenise Welch backtracks on infamous Taylor Swift interview days after sobbing to son Matty Healy\n-\nWayne Lineker's daughter Tia, 26, arrives in Mallorca ahead of her wedding to football manager partner Harry Agombar, 32\n-\nPrincess and Junior Andre reveal the lesson they've learned from their famous parents in first solo TV interview - after mum Katie Price slammed their new show\n- Pet owners love this dog food subscription service for better fur, skin and health - and it costs just 89p a DAY (plus it's 40% off right now) SHOPPING\n-\nCarefree Frankie Bridge shows off her peachy bottom in a tiny green bikini as she larks around in the Maldives amid 'feud' with Myleene Klass\n-\nRomeo Beckham flexes his luxury lifestyle in a £1K Balenciaga jersey and Rolex watch as he steps into his pricey £100K Porsche with a pal on night out\n-\n80s music icon issues surprise health update after cancelling ALL upcoming tour dates\n-\nShirtless Cruz Beckham, 20, relaxes on dad David's £16M yacht before sharing a steamy smooch with girlfriend Jackie Apostel, 30, on loved-up holiday\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n-\nKenny Logan reveals his sex life struggles with wife Gabby (and what he keeps private) after he had his prostate removed following cancer battle\n-\nAnt McPartlin and leggy wife Anne-Marie Corbett enjoy a romantic lunch date as they celebrate their fourth wedding anniversary amid Portuguese getaway\n-\nWedding venue loved by Taylor Swift files for bankruptcy... with only $57 left and $63 MILLION due to creditors\n-\nEXCLUSIVE\nSheridan Smith says she would 'love' to return for Two Pints Of Lager And A Packet Of Crisps reboot as she joins co-star Will Mellor's calls to revive the iconic BBC comedy\n-\nJessie J reveals she needs to have more surgery after being rushed back to hospital following mastectomy and breast cancer battle\n-\nPrincess Andre and her brother Junior join glam stars at the launch of ITV's reality entertainment schedule - after mum Katie Price blasted their new show\n-\nHow Kelly Clarkson's TV shows could be impacted after her ex's shock death\n-\nEmma Thompson poses alongside daughter Gaia Wise at The Dead Of Winter photocall at the Locarno Film Festival in Switzerland\n-\nEXCLUSIVE\nKelly Clarkson hit by unimaginable double tragedy after ex-husband Brandon Blackstock's shock cancer death: Fears as star 'feels lost'\n-\nMacaulay Culkin finally clarifies Home Alone rumours that have left fans guessing for YEARS\n-\n90s pop icon looks unrecognisable 26 years on from hit record\n-\nNepo baby of music icon walks Fashion Week runway... after claiming nepotism 'doesn't help' her career\n-\nEXCLUSIVE\nOlivia Bowen breaks down in tears as she shares fears of losing unborn baby in 'most real and raw' show tracking highs and lows of parenthood\n-\nAndy Cohen sparks feud with tennis star Martina Navratilova as he calls her comments on surrogacy 'dumb'\n-\nCara Delevingne drives home after celebrating her 33rd birthday sober after celebrating with fellow celebrity pals in Los Angeles\n-\nDanica Patrick sets pulses racing as she shows off stunning physique latest European vacation\n-\nWhat's got The Saturdays All Fired Up? Fans convinced Rochelle Humes and Frankie Bridge have fallen out after 'Wimbledon snub' and cryptic post\n-\nEXCLUSIVE\nTom Holland is supported by fiancée Zendaya as he films on set of Spider-Man: Brand New Day at Brookwood Cemetery in Surrey\n-\n'Surprisingly poor' John Cleese, 85, is set to buy a house in Bath with his fourth wife - after giving her his £1.5m Chelsea flat\n-\nRochelle Humes steps out with sister Sophie Piper after she raised eyebrows by posting Myleene Klass' ex Graham Quinn - as fans speculate she's fallen out with Frankie Bridge\n-\nIconic Netflix actress looks unrecognisable as she shares throwback snap - but can YOU guess who it is?\n-\nAmanda Holden shows off her sizzling figure in a skimpy white bikini as she twins with lookalike glam daughter Lexi Hughes in Greece\n-\nBig Brother star Hardeep Singh Kohli 'groped woman's buttocks at BBC studios, indecently assaulted another at hotel and tried to put his tongue in third victim's mouth'\n-\nBig budget ITV game show AXED as gutted presenter admits 'I don't know what I did wrong'\n-\nAbbey Clancy looks sensational in a tiny cream bikini as she enjoys a yacht trip with shirtless husband Peter Crouch in the south of France\n-\nLove Island's Harry and Shakira reveal how things have REALLY been left with Helena in first TV interview - but swerve question about if they're exclusive\n-\nBBC Breakfast fans gasp 'my head hurts!' as show pulled off air after string of technical blunders so bad they 'thought their TVs were broken'\n-\nNetflix star goes on 180-hour journey to tiny Greek island to eat his favourite ice cream\n-\nMariah Carey reveals the unlikely requests she has for King Charles when she performs for him at Sandringham\n-\nKanye West's wife Bianca Censori covers up for stepmom duty as she takes rapper's kids out in LA\n-\nPrincess Beatrice appears in promo for UAE bank's new Mayfair branch - as explosive new claims about Prince Andrew's business dealings emerge\n-\nGina Carano rejoices over win for free speech as Disney forced to settle Mandalorian firing with groveling statement\n-\nFurious Sha'Carri Richardson pummels boyfriend in shocking security footage from arrest\n-\nScarlett Johansson is blasted by fans for her 'awful' English accent in new movie My Mother's Wedding\n-\nPrincess Beatrice's original name was rejected by the late Queen for being too 'yuppie'\n- Kelly Clarkson's ex-husband Brandon Blackstock dead at 48 after cancer battle Sad news\n-\nPrincess Andre makes a solo red carpet appearance at beauty event after mum Katie Price condemned her upcoming documentary\n-\nWhite Lotus actor calls out 'old movie stars' who get plastic surgery to play 'young roles'\n-\nCheffin' it up! Brooklyn Beckham gets back in the kitchen as he hosts Cloud 23 summer party - after renewing his vows with wife Nicola Peltz amid family feud\n-\nLauren Sanchez shows off extravagant £227k watch she was gifted as a wedding present by billionaire husband Jeff Bezos\n-\nEXCLUSIVE\nLove Island's Dejon Noel-Williams defiantly hits back at being branded a 'narcissist' - revealing he wanted to QUIT\n-\nEXCLUSIVE\nThe man who discovered Elvis... and then destroyed him: How the King spiralled into addiction and death at the hands of his high-rolling manager\n-\nThe nepo-baby so well-connected she's King Charles's 'official DJ' and parties with Naomi Campbell - but you've probably never heard of her\n-\nUS actor Jeremy Piven drops C-bomb in trainwreck interview on Aussie radio\n-\nFrankie Bridge raises eyebrows with cryptic post saying 'you're dead to me' - so who IS she talking about?\n-\nAudiences are left shocked by Margot Robbie and Jacob Elordi's 'aggressively provocative' Wuthering Heights movie with 'BDSM sex scene'\n- MasterChef loses nearly 1MILLION viewers as new series airs after both presenters were sacked On the slide\n-\nFreddie Mercury fans turn their ire on author who revealed star's love child in bombshell book - but she's sticking to her guns\n-\nWhat's inside Keith Urban's bag? Nicole Kidman's husband reveals the one item he ALWAYS flies with as he touches down with $12,000 worth of luggage\n-\nThe Royal Family's connection to acting and Princess Beatrice's surprising Hollywood film debut alongside Emily Blunt\n-\nWill Carrie Bradshaw end up alone? And Just Like That... hints at iconic character's final storyline as 'woke' reboot is cancelled\n-\nOzzy Osbourne leans on wife Sharon in one of their last photos together as part of first glimpse at moving new documentary\n-\nInside Max Parker and Kris Mochrie's lavish wedding: Emmerdale stars who played brothers on hit soap tie the knot\n-\nStranger Things star gets engaged to longtime partner\n-\nPregnant Rihanna shows off her bump as she shops at pricey baby boutique in Beverly Hills\n-\nEXCLUSIVE\nMax Verstappen and girlfriend Kelly Piquet purchase plot of land at luxury development Pinheirinho Comporta in Portugal\n-\nThe surprising royal who became the first - and only - member of the Royal Family to complete the London Marathon\n-\nJennifer Lopez, 56, refused entry into Chanel store after security 'failed to recognise her'\n-\nBrooklyn Beckham is back in the kitchen as he whips up a carbonara in latest cooking video - after renewing his vows with wife Nicola Peltz amid family feud\n-\nEXCLUSIVE\nWhy Andrew is 'toast': The man who revealed 'highly sexed' Prince Andrew's multiple affairs tells all to Palace Confidential\n-\nMachine Gun Kelly reveals the parenting comment that left Megan Fox 'fuming'\n-\nDuchess Sophie's stunning floral dress sold out immediately - we've found high street versions that look equally stylish\n-\nJodie Kidd makes rare public appearance with her lookalike son Indio, 13, as they attend the Space NK London launch party\n-\nMeghan does not deserve to be called 'Duchess Difficult'. Shame on the royals - This week have shown how wrong they are: BRYONY GORDON\n-\nQueen Mary's daughter Princess Isabella is caught in an X-rated shirt at a wild Danish music festival - and royal watchers are fuming\n- Brandon Blackstock's daughter announced her pregnancy weeks before his death His death was confirmed on Thursday\n-\nDiddy's ex Cassie Ventura returns to social media for first time since giving birth... after her painful testimony against the rapper\n-\nJAN MOIR: Andrew is utterly irredeemable but Fergie is so much worse. Her late-night emails to me say it all\n-\nPink's daughter Willow, 14, is her TWIN as singer poses for rare photo with her children\n-\nEDEN CONFIDENTIAL: Will Harry consider what he might have achieved in tandem with his brother after Sentebale row?\n-\nDark secret every influencer knows... but will never admit: Insiders tell me shame of trick so many stars exploit: MOLLY CLAYTON\n- Inside Kelly Clarkson and Brandon Blackstock's love story that ended in tragedy Died at 48 following a cancer battle\n-\nJaime King ordered to court after ex-husband's divorce lawyers claim she failed to pay over $100K in fees\n- ITV pulls the plug on legendary presenter's big TV comeback by AXING show after just one series All over\n-\nYungblud strips down to a British flag kilt for killer impromptu performance at his London store launch party\n-\nPrince Andrew lost his virginity at the age of 11 and had scores of sexual experiences before he turned 13, royal biographer claims\n- How the Royal Albert Hall was saved by the rave: KATIE HIND The Grade I-listed stages more than 390 shows a year\n- Katie Holmes' mini-me Suri, 19, beams on NYC movie set... before heading back to college in Pennsylvania Getting involved\n-\nFreakier Friday review: Twice as many body swaps, but this ropy sequel's only half the fun, writes BRIAN VINER\n-\nZoe Ball admits she was reduced to tears after falling victim to a random street crime after appearance on The One Show\n- King Charles to commemorate the 80th anniversary of VJ Day with an address to the nation Special day\n- Liam Neeson fans savage reporter for asking him about 'cringe' topic during 'nonsense' interview Not happy\n- Jack Nicholson's grandson Sean arrested on felony domestic violence charge He's the eldest of the 88-year-old's grandchildren\n-\nWednesday star Percy Hynes White has very ordinary new job after sex assault allegations got him cancelled\n- Cheryl Burke raves about having 'great' sex with HERSELF... three years after Matthew Lawrence divorce Surprising\n-\nDo you REALLY, REALLY wanna body to match Spice Girl Mel C? Well, here are my top tips on how you can get it...\n-\nHeartbreaking last picture of Oasis fan before he plunged to his death at Wembley gig\nLandscape gardener Lee Claydon died at show\n-\nKatie Price condemns daughter Princess Andre's documentary in explosive new interview as she sets record straight\n-\nAmal Clooney, 47, cuts an elegant figure in a pink thigh-split dress as she and her dapper husband George, 64, head out for dinner\n-\nChris Hughes reveals the old-fashioned way he told JoJo Siwa how he really felt about her and recalls the moment when feelings changed\n-\nI'm A Celeb star is cruelly dad-shamed by online trolls for sharing picture of his four-year-old son drinking milk from a bottle\n-\nEXCLUSIVE\nREVEALED: The comments that confirm Rebekah Vardy won't fulfil her dream of moving to Beckham's precious Miami\n- Singer Caity Baser reveals she was sexually assaulted by a family friend when she was just eight years old Harrowing\n-\nDavid Beckham rocks tiny trunks with Victoria and son Cruz on yacht... while Brooklyn and wife Nicola Peltz are seen for first time since vow renewal amid 'feud'\n- The Walking Dead star Kelley Mack 'suddenly relapsed' after cancer treatment before death aged 33 Very sad\n-\nCHRISTOPHER STEVENS reviews The Fortune Hotel: 'A witless game show set in paradise, but as boring as hell'\n-\nEXCLUSIVE\nUnearthed photos show Brad Pitt's treasured memories of his late mum, who was cut off from her grandkids by Angelina\n- Jack Lowden's wedding photos finally appear, but it is not his wife Saoirse that's in them Unexpected\n- Jason Kelce opens up on music career... and the chances of a collaboration with Taylor Swift Big plans\n- Nepo baby lands gig working alongside his actor dad - can you guess his famous father? Following his footsteps\n-\nMacaulay Culkin regrets missing '90s comedy after not even reading the script during teenage retirement\n-\nMy sister disappeared on a cruise ship 27 years ago - what I think REALLY happened is the stuff of nightmares\n-\nMariah Carey accused of shading Katy Perry as she gives 'savage' response when asked about singer's space trip\n- New twist in Conor Maynard and Charlotte Chilton paternity row as explosive new allegation is 'revealed' Latest development\n- Richard Gere jets back to US as furious daughter of music icon curses him over sale of her childhood home Outraged\n- Jacob Elordi and Olivia Jade Giannulli SPLIT after four years together The couple have called time on their romance\n- Katy Perry reveals nasty injuries after THAT harrowing viral stage collapse Took to her Instagram on Wednesday\n-\nEXCLUSIVE\n'This is the Oasis effect': Woke TV comedian blames the Gallaghers after nobody turned up to watch her Edinburgh shows\n-\nKylie Jenner flashes cleavage and drinks wine with pals as it's been ONE MONTH since she's been seen with Timothee Chalamet\n-\nStacey Solomon shares adorable photos of her daughters, Rose, three, and Belle, two, as she gives an insight into their family holiday\n-\nDenise Richards accused of 'abandoning' sick dog by ex Aaron Phypers... days after she's seen with black eye"
    },
    {
      "url": "https://www.dailymail.co.uk/news/tiktok/index.html",
      "text": "Advertisement\nTikTok\nTikTok is a social media platform that allows users to create, share, and discover short-form videos, typically set to music. Launched in 2016 by the Chinese company ByteDance, it has rapidly gained global popularity, especially among younger audiences.\nTikTok: Latest News and Updates\nPage\nCop sent intimate texts and watched TikToks while suspect died in back of his cruiser, lawsuit alleges\n09/08/25 02:04\nA new lawsuit claims that police officers were negligent while the man lay dying in back of the patrol car. One officer is even accused of scrolling TikTok and sending an intimate message while the suspect gasped for air in the backseat of a police cruiser....read\nHow a loneliness epidemic is sweeping Australia's biggest city - hitting Gen Z, travellers and expats the hardest... and causing 'vascular ageing': 'The proof is everywhere'\n09/08/25 01:44Far from the stereotype of Gen Z as a carefree, party-loving cohort, thousands are quietly battling deep feelings of isolationLeigh-Anne Pinnock sizzles in racy bikini top and hot pants as she storms the stage at Boardmasters Festival\n09/08/25 01:07Leigh-Anne Pinnock sent temperatures soaring as she delivered a show-stopping performance at Boardmasters Festival on Friday.Princess Andre hits back at feud claims after her mum Katie Price said she was 'upset' not to appear in her new ITV series and insists: 'This is MY show'\n09/08/25 01:00Princess Andre has hit back at claims she's embroiled in a family feud with her famous mother Katie Price.Western Bulldogs star Jamarra Ugle-Hagan opens up on how he is conquering his mental health battles\n08/08/25 23:33There is renewed hope that Jamarra Ugle-Hagan could return to the AFL in the near future after the Western Bulldogs star opened up on his mental health demons - and how he is battling themRosie O'Donnell fears 'ABC is preparing to cancel The View'\n08/08/25 20:42Rosie O'Donnell made the remarks in a pointed post to TikTok Wednesday where she said ABC was 'reviewing the [show's] liberal bias'.Furious Rosie O'Donnell says ABC is preparing to cancel her old show The View\n08/08/25 20:27Rosie O'Donnell made the remarks in a pointed post to TikTok Wednesday where she said ABC was 'reviewing the [show's] liberal bias'.Kelly Brook topples over and ends up in a 'neck brace' after TikTok trend appears to go very wrong\n08/08/25 19:15Kelly Brook has left fans in stitches after attempting a viral online challenge that sees participants balancing in high heels, only to spectacularly topple over.Influencer Emilie Kiser wins battle to keep gory details of her three-year-old son's drowning from the public\n08/08/25 18:53Emilie Kiser fought to get two pages of a police report detailing how her son Trigg, three, drowned in her family's pool redacted - and a judge agreed with her on Friday.Emily Ratajkowski wows in very cheeky bikini as she dines on fries and beer on boat trip\n08/08/25 17:29Emily Ratajkowski showed off her supermodel figure in a swimsuit as she indulged at the beach in Positano, Italy this week.Teen 'sexting' scandal rocks Trump world as MAGA siren warns: 'I'll destroy your life'\n08/08/25 17:18In an exclusive interview, Republican belle Raquel Debono spills the tea about her former boss John McEntee and claims she's doing better than ever - without him.How sinister conspiracy theories are running rife about the sudden deaths of four Aussies on the Gold Coast - forcing cops to issue an extraordinary message addressed to an entire state\n08/08/25 16:49The Gold Coast has been rocked by a string of mysterious deaths in recent weeks, sparking amateur sleuths to go into overdrive on the internet.Popular adult star Lina Bina found dead aged just 24\n08/08/25 16:32The adult industry has suffered another devastating loss following a string of recent deaths.Secret Lives of Mormon Wives star accused of 'endangering' three-week-old baby after holding newborn while blindfolded for outrageous Nicki Minaj social media challenge\n08/08/25 16:28Mikayla Matthews, who lives in Utah, US, has been accused of 'endangering' her baby after involving the newborn in a risky internet challenge inspired by Nicki Minaj 's music video.Popular singer claims she has no idea who Joe Rogan is\n08/08/25 16:17A major star casually humiliated Joe Rogan after admitting she had no idea who the popular podcaster was on a recent episode of Alex Cooper's Call Her Daddy.Singer sparks outrage after claiming she has NO IDEA who Joe Rogan is... as fans quickly turn the tables\n08/08/25 15:18A major star casually humiliated Joe Rogan after admitting she had no idea who the popular podcaster was on a recent episode of Alex Cooper's Call Her Daddy.Polka dot skirt channelling the Princess of Wales's signature style hits the high street\n08/08/25 14:31Shoppers will be left seeing spots as one of the Princess of Wales's favourite patterns is about to take over the high street.Woman ordered to go straight to hospital after terrifying discovery of creature in her bathroom\n08/08/25 12:04A woman from Montréal in Canada was told to rush to hospital for a rabies shots after finding a bat in her toilet.90s pop icon looks unrecognisable 26 years on from release of hit record\n08/08/25 12:02The British singer and dancer, 48, is well-remembered for bangers as the 1999 single Viva La Radio as part of her First Album, releasing chart-topping hits as Mickey and Big Boys Don't Cry.Revealed: The key sign your partner is a NARCISSIST\n08/08/25 11:52If you really want to know the secrets of someone's psychology, scientists say there is one surprising sign you should look for.People left outraged after American tries British staple drinks for the first time\n08/08/25 11:50American TikTok creator, @redbusruss, who sampled three soft drinks popular in the UK, has left Brits outraged after claiming they 'taste the same.'Mum trades her busy UK life to live in luxury in huge villa in Spain with a pool and private gym - and saved £100k in the process\n08/08/25 11:28British mother Bridie has wowed thousands after giving a virtual tour of her huge new home in Spain. The lavish villa cost £100,000 less than her Essex home.Tourist horror as rotting cows washed up on packed Spanish beaches\n08/08/25 09:36Beachgoers in Spain have been left 'horrified' after discovering the decomposed bodies of cows washing up on popular shores.Rochelle Humes steps out with sister Sophie Piper after she raised eyebrows by posting a picture of Myleene Klass' ex Graham Quinn in Ibiza - as fans speculate she's fallen out with her former bandmate Frankie Bridge\n08/08/25 09:11Rochelle Humes was spotted out with her sister Sophie Piper on Thursday evening at the launch of Space NK's new Oxford Street store in London.Frankie Bridge raises eyebrows with cryptic post saying 'you're dead to me' - so who IS she talking about?\n08/08/25 07:27The Saturdays singer hinted that she was holding a grudge as she uploaded a new TikTok sipping on a glass of wine.Virginia youth pastor sent disgusting texts to young girls while posing as a teen\n08/08/25 02:43Jacob Ryan Barnett, a Virginia youth pastor, has been charged with attempting to coerce and entice minors after allegedly posing as a teenage boy to solicit explicit images from girls.I'm a doctor and there's an act women should never do - and it will make sense why 20 years from now\n08/08/25 01:22A dermatologist has shared a simple daily act - that doesn't cost a thing - which could potentially have a huge anti-ageing affect on your appearance in years to come.G Flip 'freaks out' Americans with Australian school tradition that no other country has: 'This has to be a lie'\n08/08/25 01:04G Flip has set the internet alight once again, with the singer dropping a 'bizarre' school tradition from Australia on unsuspecting Americans.He'll earn a bob or two! The staggering amount 'Ibiza Final Boss' is set to earn after viral video - as he signs up to top celeb talent agent who made Joey Essex a millionaire\n08/08/25 00:06Brand and culture expert Nick Ede told the Daily Mail today that the 'Final Boss' of Spanish party islands stands to earn a huge sum in the next 12 months alone.Revealed: The common item that should never be left in the security trays - and the disturbing reason why\n07/08/25 23:36Airport security can often feel like a chaotic rush, with liquids and electronics needing to be quickly organised. But there's one item that travellers are being urged to be particularly careful with.Speech therapist details the names she would NEVER give her baby\n07/08/25 20:24Chloe Conrad, the founder of Spunky Speech Therapy in San Diego, recently took to TikTok to delve into the names she wouldn't give her own child.Costco shoppers rush to stores for fan-favorite snack\n07/08/25 18:38Costco shoppers have not stopped raving about treats that have sold out in several stores.The haircut that inspired Ibiza final boss before he went viral - and barbers say their phones are now ringing off the hook\n07/08/25 15:53'The Ibiza final boss' went viral after he was filmed 'cutting shapes' on the party island with a gold chain, sunglasses and a baby pink cup in his hand.Dark secret every influencer knows goes on... but will never admit: Insiders have told me hidden shame of trick so many stars exploit. It's truly damaging: MOLLY CLAYTON\n07/08/25 15:50Regular social media users will be all too aware that it's impossible to scroll through TikTok or Instagram without being bombarded with videos about food.Clarkson's Farm breakout star Harriet Cowan makes emotional plea as she leads farming campaign after leaving the show\n07/08/25 15:49The glam farmhand, 24, stole the show in series four as she arrived on screens to assist at Diddly Squat Farm while Jeremy Clarkson's usual helper, Kaleb Cooper, was away.British chicken shop blasted for 'distasteful and disrespectful' menu item as people say it's 'turning sexual abuse into merch'\n07/08/25 15:32A British chicken vendor has been accused of 'turning sexual abuse into merch' after seemingly naming a hot sauce after the highly-publicised P Diddy trial.Men 'who filmed themselves targeting Orthodox Jews with water pistols' are arrested on suspicion of racist hate crime\n07/08/25 15:17The men, aged 26 and 36, were taken into custody for questioning on suspicion of racially aggravated common assault on Thursday.Denise Richards' daughter Sami Sheen models VERY skimpy lingerie... after sharing she was 'almost sex trafficked'\n07/08/25 15:05The 21-year-old OnlyFans content creator modeled the little bra and underwear while sitting on her bed that had white sheets at her home in Los Angeles.Brits left gobsmacked by lavish student accommodation that comes with room service, private club memberships and a cinema - but it costs a steep fee!\n07/08/25 14:42Fifty One, located in South Kensington, goes beyond a typical home and offers its lucky residents referrals to some of the most sought-after private members' clubs, including Annabel's.Fast food lover details his quest to visit all 13,544 McDonald's in US\n07/08/25 13:28Donny Boys kicked off the endeavor in July 2024, and has been to around 350 locations in the last year in states like Wisconsin, Illinois, California, Oregon, and Washington.I'm eating at every McDonald's in America - I'm 350 in and here is what it's done to my body\n07/08/25 12:35Donny Boys kicked off the endeavor in July 2024, and has been to around 350 locations in the last year in states like Wisconsin, Illinois, California, Oregon, and Washington.The 'Ibiza Final Boss' effect! Holiday firm's hilarious advert after raver's iconic hairdo goes viral\n07/08/25 11:17Jack Kay, 26, went viral on TikTok earlier this week when he was filmed cutting shapes on the party island, donning a gold chain and a pair of sunglasses, gripping a baby pink cup in his hand.Revealed: What 'Ibiza Final Boss' is hiding behind his elaborate barnet as he becomes a global internet star and brands cash in on his viral fame\n07/08/25 11:02Fans believe they have spotted a flaw in the impossibly razor-sharp barnet - but it's not visible when taking in his awe-inspiring fringe from the front.I just found the best straight jeans on the high street - they're only £35 and perfect for autumn\n07/08/25 09:46They're a classic, five-pocket style with a mid-rise waist, and are available in three washes (light, mid and indigo blue) and three lengths (29inch, 31inch and 33inch).Danielle Lloyd hits out at 'dangerous and false' sunscreen information amid skin cancer battle - after Sam Faiers wrongly claimed many SPF brands are 'harmful'\n07/08/25 09:13The mother-of-five was diagnosed with melanoma in February and went under the knife to remove a mole above her collarbone earlier this year.Influencer breaks spine doing outrageous Nicki Minaj social media challenge\n07/08/25 09:13Mariana Barutkina, from Yekaterinburg in central Russia, was trying to film her first piece of content as an influencer when she suffered the painful injury.Channel 4 announces return of legendary daytime TV series 20 years on from first ever episode in huge win for fans\n07/08/25 09:03In addition to the regular series returning, bosses have also revealed a special spin-off of the format is on the way.Fans pay tribute after MasterChef star Yanin Campos, 38, killed in car crash\n07/08/25 08:56A popular MasterChef star and TikTok influencer has been killed in a car crash in her native Mexico.Why Mounjaro users' hair is falling out - a top doctor reveals the surprising cause...\n07/08/25 07:45The jabber communities on Instagram and TikTok have been posting in their droves about their decreased libidos, a reduced interest in alcohol , and most upsettingly for some, extreme hair loss.Tesco birthday cake sandwich is branded 'too sweet' as unimpressed shoppers call for it to be 'banned from shelves'\n07/08/25 07:31Tesco caused quite a stir when it launched its limited edition birthday cake sandwich this week but customers are less than impressed by the novelty treat.Moment Orthodox Jews are attacked with water pistols in 'cowardly' social media 'pranks'\n07/08/25 07:26Two young men were seen in a video driving around Manchester and laughing as they sprayed adults and children wearing orthodox clothing who were walking down the street.Shopper in tears over Bunnings employee's unexpected act: 'Are you joking?'\n07/08/25 05:57An Australian shopper has been brought to tears by a Bunnings worker's random act during a recent store visit.I paid $450 for my passport and I'm not just angry at the state of it... but also at how it arrived in the mail: 'Are you kidding me?'\n07/08/25 01:03An Aussie was shocked when her passport arrived in the mail, accusing the government of 'cutting costs' on the document.How I knocked a DECADE off my age with the anti-ageing make-up tricks experts swear by, from the jowl-busting trick to what really hides lines - and no you HAVEN'T heard of these before\n07/08/25 00:56For most of my life, my make-up routine has been a reliable, go-to formula: bold, black eyeliner, lashings of black mascara, well-lined lips and lots of blusher and concealer.Woman issues airport security warning after priceless item left 'destroyed' by X-ray scanner\n07/08/25 00:55Many people take cameras with them on their travels to capture the memories and amazing sights - but one woman has issued a warning after a priceless item was 'destroyed' by an X-ray scanner.Caitlin Clark scolds Indiana Fever teammates as they beg for swimsuit endorsement deal\n06/08/25 21:44Caitlin Clark didn't have much patience for her sunbathing Indiana Fever teammates before Tuesday's loss in Los Angeles, but that didn't stop her from getting some laughs at their expense.Denise Richards' daughter Sami Sheen shares chilling claim she 'almost got sex trafficked'\n06/08/25 20:38Denise Richards ' daughter Sami Sheen has claimed she had a close call with a suspected sex trafficker.MasterChef star dead at 38\n06/08/25 19:33MasterChef alum and popular TikTok influencer Yanin Campos has died following a devastating car accident in Mexico.HGTV fans accuse show of 'turning into TLC' over couple with 30-year age gap on House Hunters\n06/08/25 16:31Sara, 52, and Jack, 22, needed help in their search for a new home in Sacramento, California, and appeared on the show at the end of July.MasterChef star Yanin Campos killed in horror car crash in Mexico at 38\n06/08/25 15:54MasterChef alum and popular TikTok influencer Yanin Campos has died following a devastating car accident in Mexico.Mariah Carey's daughter Monroe, 14, is her mother's spitting image as they film a fun GRWM TikTok video together\n06/08/25 14:49Mariah Carey's daughter, Monroe, was her mother's spitting image as they filmed a fun GRWM on TikTok on Tuesday.Instagram users are horrified by new feature that allows your friends to see which posts you've liked - thankfully there's a simple way to opt out\n06/08/25 14:44You might want to start being more careful about what you like on Instagram. The social app is introducing a new feature that may reveal your most embarrassing thoughts and desires.Flight attendant reveals the seat you should book to get a free upgrade on your next flight\n06/08/25 14:17A flight attendant has revealed the seat passengers should book to get a free upgrade.Private jet and helicopter-filled life of fashion designer, 33, found dead on Hamptons yacht\n06/08/25 13:36Martha Nolan-O'Slatarra, 33, lived a jet-setting life of luxury with her glamorous pals.Fire chief suspended after he was filmed shouting 'Shut the f**k up!' at girl, 10, being stretchered into ambulance\n06/08/25 13:28The Long Island fire chief hurled obscenities at a 10-year-old girl after the child's family called emergency services to help calm her down because she had become emotionally overwhelmed.Aussie salon boss accused of 'outing' UK rockstar Yungblud in now-viral video: 'He hated every second of that'\n06/08/25 13:04A salon owner has been slammed online for 'outing' British rockstar Yungblud.I got a FREE 5-star stay at the Hilton Hotel - but what the company did next baffled me\n06/08/25 12:14Luke Colson, known as @luke.is.alive_, shared his hotel experience on TikTok, which led to an unexpected hotel stay - but what happened next left him shocked.Fashion designer found dead on yacht in the Hamptons\n06/08/25 12:04Martha Nolan-O'Slatarra, 33, the founder of fashion label East x East, was found unconscious onboard a boat docked at the Montauk Yacht Club at around midnight.Tammy Hembrow gives an update on her relationship status as she cuts a very casual figure in loose tracksuit at Sydney airport\n06/08/25 11:07Tammy Hembrow has revealed whether or not she's seeing anyone after her marriage with Matthew Zukowski broke down after just seven months.Tammy Hembrow almost spills out of ridiculously low-cut dress as she reveals mysterious spots on her chest at Sydney premiere of Freakier Friday\n06/08/25 06:20Tammy Hembrow showcased her incredible figure and slender curves on Tuesday night as she stepped out for the Sydney premiere of Disney's Freakier Friday.Fashion designer, 33, celebrated launch of chic lifestyle brand at ritzy Hamptons resort before being found dead on boat at yacht club\n06/08/25 05:35Martha Nolan-O'Slatarra, 33, the founder of fashion label East x East, was found unconscious onboard a boat docked at the Montauk Yacht Club at around midnight.Canadian bloke's divisive comment about Australia's obsession with beauty stuns fans: 'Seriously?'\n06/08/25 03:52A Canadian man has made a 'poetic' observation about life in Australia - but not everyone agrees with him.Kylie Jenner risks MAJOR wardrobe malfunction in tiny tube top after boob job confession\n06/08/25 02:20In June she shocked fans when she spilled the specifics of the breast implants she got when she was 19-years-old.The unlikely $5 item from Kmart that's saving Aussies a fortune on beauty: 'These changed my life'\n06/08/25 01:50One Aussie shopper has found the ultimate budget beauty hack that will save you thousands of dollars per year on your manicure.Footy star gets punished by NRL for giving fans the 'Arabic middle finger' - as a shock photo shows why fans think the league has got it wrong\n06/08/25 01:28Several Wests Tigers players made the gesture during their win over the Bulldogs on Sunday - but new images show there's another side to the story.Suki Waterhouse puts on a VERY leggy display in skimpy pink jogging shorts as she steps out in California - after shunning VIP tickets at Oasis show\n06/08/25 01:02Suki Waterhouse put on a very leggy display as she stepped out at Beehive Studios in Van Nuys, California, on Tuesday.I've visited 26 European cities - I didn't like Birmingham but this rundown and dirty Italian city was the worst\n06/08/25 00:18From Birmingham to Seville, US-born Charlie Seville has explored a range of cities around Europe. She's shared her thoughts on what was the worst to visit, and the best.Fans left sobbing and devastated after shock act at Australian premiere of Freakier Friday\n05/08/25 23:51Fans lined up for hours to get autographs and selfies with Lindsay Lohan and Jamie Lee Curtis at the Australian premiere of Freakier Friday on Tuesday night.British Grammy winner reveals teenage drug battle left her with speech problems and a driving ban\n05/08/25 21:18Clean Bandit released their new single Believe last month.Dave Portnoy says reading Kamala Harris' new book is a worse punishment than death\n05/08/25 20:16Last week, the former Vice President announced a book deal for her memoir about the 2024 election titled '107 Days.'\nPage\nDON'T MISS\n-\nThe One Show's Alex Jones fights back tears as husband Charlie Thomson makes surprise appearance live on air\n-\nEXCLUSIVE\nPrincess Andre hits back at feud claims after her mum Katie Price said she was 'upset' not to appear in her new ITV series and insists: 'This is MY show'\n-\nKelly Brook topples over and ends up in a 'neck brace' after TikTok trend appears to go very wrong\n-\nEXCLUSIVE\nFreddie Mercury's 'secret' daughter speaks out for the first time ahead of publication of bombshell book, saying: 'I didn't want to share my Dad with the whole world'\n-\nEmily Ratajkowski wows in very cheeky bikini as she dines on fries and beer on boat trip\n-\nFancy a party in paradise? Two tickets for Centreforce's Tenerife Weekender 2025 are up for grabs\nAd Feature\n-\nDavid Beckham appears to offer tentative olive branch as he likes son Brooklyn's latest social media post as family feud rumbles on\n-\nEXCLUSIVE\nInside Nicola and Brooklyn's secret SECOND wedding that's ultimate snub to the Beckhams. Feud turns truly toxic after 'do-over' ceremony - as insiders tell of Victoria's fury with 'viper' Nicola\n-\nPrincess and Junior Andre hit back at 'nepo baby' label as they launch new ITV2 reality show: 'This is our own career'\n-\nSmart moves: The 10 must-know education brands helping the UK learn better and faster\nAd Feature\n-\nBrooklyn Beckham slammed by celebrity chef Aldo Zilli for 'burning bacon' in his spaghetti carbonara\n-\nEXCLUSIVE\nThe vile porn videos that mean Taylor Swift could have 'wreaked havoc' on her ex Matty Healy: 'Everyone in the room was disgusted'\n-\nBBC sitcom slapped with trigger warning for 'discriminatory language' in ANOTHER woke crackdown\n-\nKelly Clarkson's talk show future is revealed amid her ex-husband Brandon Blackstock's tragic death\n-\nEXCLUSIVE\nThe Yorkshire Vet's Matt Jackson-Smith reveals how to care for your dog as they grow u, and his dog Harry's VERY unusual traits\nAd Feature\n-\nEmmerdale star looks completely unrecognisable 18 months after quitting the soap - but can YOU guess who it is?\n-\nLeigh-Anne Pinnock sizzles in racy bikini top and hot pants as she storms the stage at Boardmasters Festival\n-\nKim Kardashian flew to Mexico to get unusual treatment not approved in the US as she shares scary photos from the operating room\n-\nSir Elton John shuts down rumours of ABBA-style hologram show with X-rated joke\n-\nThe stars of the much-loved Wittering Whitehalls podcast on how a hearing check has changed their relationship\nAd Feature\n-\nAmelia Gray Hamlin sparks fan concerns over her EXTREMELY thin frame in topless beach photos\n-\nGladiator star Steel reveals risky procedure contributed to premature son's death as doctors fought to save his life after being born at 23 weeks\n-\nMel C sports Spice Girls football shirt as she joins Kate Lawler in leading the stars at Flackstock festival in honour of late Love Island host Caroline Flack\n-\nEXCLUSIVE\nSir Cliff Richard, 84, shows off his sweet angelic side for his 2026 calendar as he offers up biscuits and poses with wings for his highly anticipated annual photoshoot\n-\nEating for bump, and beyond! Pregnancy nutritionist reveals her top diet advice for those trying to conceive, pregnant, breastfeeding and baby nutrition\nAd Feature\n-\nShrinking Lizzo flaunts her newly svelte figure in activewear... after poking fun at Sydney Sweeney controversy\n-\nEDEN CONFIDENTIAL: So what's the deal with birthday girl Beatrice's new business venture?\n-\nEmmerdale actress pregnant: Actress reveals she is expecting third child in heartwarming update\n-\nNepo baby, 22, stuns in a white dress as she storms the catwalk during Copenhagen Fashion Week - but can YOU guess who her famous parent is?\n-\nSip smarter this summer: Discover the 'Magic of Moderate Drinking' with these simple tips\nAd Feature\n-\nMargot Robbie looks like Britney Spears from her ...Baby One More Time video with cute schoolgirl braids\n-\nEXCLUSIVE\nSarah Michelle Gellar looks forever young in Buffy reboot... but her iconic character gets drastic makeover that will divide fans\n-\nKerry Katona, 44, moves in with her toyboy boyfriend Paolo Magaglione, 33, two months after meeting on Celebs Go Dating\n-\nCoco Austin poses in an impossibly high-cut sheer swimsuit that does nothing to hide her butt\n-\nGet set for a totally WICKET summer: The Hundred is rolling into cities across the UK - this is how YOU and your family can join the fun\nAd Feature\n-\nMachine Gun Kelly admits he pushed himself into a 'delirious state' doing a water fast for FOUR DAYS\n-\nEXCLUSIVE\nYou wouldn't see that on the catwalk! Kate Moss, 51, gets the giggles as she's surrounded by naked sunbathers on nudist beach - before nearly baring all herself\n-\nEXCLUSIVE\nJennifer Aniston and Jim Curtis 'bonded over their rescue dogs' as he debuts his senior pooch Odie in NYC\n-\nSydney Sweeney is caught arriving to the Devil Wears Prada 2 set suggesting she has a role... after her 'good jeans' controversy\n-\nFrom spending when you're abroad to absolutely smashing the preparation and packing, we reveal how to holiday like a pro\nAd Feature\n-\nLucy Spraggan reveals she suffered gruesome intimate injury while filming Celebrity SAS as she faces reconstructive surgery\n-\nAndi Oliver reveals her fury at Chris Moyles over vile comments he made about her daughter Miquita and compares him to a 'drunk racist'\n-\nSharon Osbourne reveals the 'biggest mistake' she made with husband Ozzy in a candid interview before his death\n-\nOti Mabuse shows off her sexy dance moves in a striped bikini and black mini skirt on holiday with husband Marius\n-\nFrom Icelandic waterfalls to Japanese tea ceremonies: The new cruise collection that promises adventure as well as ultra-luxury\nAd Feature\n-\nKelly Clarkson's ex Brandon Blackstock seen WEEKS before death with daughter Savannah in heartbreaking photo\n-\nHollyoaks star Jennifer Metcalfe flaunts her toned physique in stylish navy blue activewear after hitting the gym in Liverpool\n-\nCoronation Street and Mrs Brown's Boys star Frank Grimes dead aged 78 following a short illness\n-\nKym Marsh left heartbroken as she mourns family tragedy following death of onscreen father Frank Grimes\n-\nKate Gosselin, 50, is unrecognizable in new video... 15 years after flaunting her bikini body during Jon & Kate Plus 8 era\n-\nMachine Gun Kelly finally breaks silence on Megan Fox split and reveals secret rehab stint: 'I broke this home'\n-\nHuge BBC detective series AXED despite cliffhanger ending in bitter blow to fans\n-\nPhil Collins fans outraged as 'sick' AI photos of star, 74, appearing frail in hospital bed while being visited by Paul McCartney, 83, go viral\n-\nEXCLUSIVE\nLove Island winner Toni Laites reveals if she will be relocating to the UK as Harry Cooksley declares he 'loves being the villain'\n- After FOUR years of menopause struggles I took a chance on this supplement - now I'm sleeping better and finally feeling more like myself SHOPPING\n-\nLila Moss, 22, looks incredible in a white bikini as she enjoys a swim with boyfriend Yoni Helbitz, 23, during trip to nudist beach with her mother Kate in Ibiza\n-\nThe Chase star Mark Labbett says he 'couldn't wait to leave' a recent date because he didn't find the mystery woman 'attractive'\n-\nKatie Holmes lights up around ex Joshua Jackson as fans think she is 'still in love with him'\n-\nThe moment a 'feud' between Loose Women's Myleene Klass and Frankie Bridge spilled onto live TV as sources claim ITV have been forced to step in\n-\nAmy Childs and Lauren Goodger put on leggy displays as they reunite with TOWIE co-stars at ITV launch\n- The 'liquid gold' facial tanner that fights ageing and has beauty fans obsessed: 'Best tanning drops EVER!' (now 20% off, but not for long) SHOPPING\n-\nDenise Welch backtracks on infamous Taylor Swift interview days after sobbing to son Matty Healy\n-\nWayne Lineker's daughter Tia, 26, arrives in Mallorca ahead of her wedding to football manager partner Harry Agombar, 32\n-\nPrincess and Junior Andre reveal the lesson they've learned from their famous parents in first solo TV interview - after mum Katie Price slammed their new show\n- Pet owners love this dog food subscription service for better fur, skin and health - and it costs just 89p a DAY (plus it's 40% off right now) SHOPPING\n-\nCarefree Frankie Bridge shows off her peachy bottom in a tiny green bikini as she larks around in the Maldives amid 'feud' with Myleene Klass\n-\nRomeo Beckham flexes his luxury lifestyle in a £1K Balenciaga jersey and Rolex watch as he steps into his pricey £100K Porsche with a pal on night out\n-\n80s music icon issues surprise health update after cancelling ALL upcoming tour dates\n-\nShirtless Cruz Beckham, 20, relaxes on dad David's £16M yacht before sharing a steamy smooch with girlfriend Jackie Apostel, 30, on loved-up holiday\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n-\nKenny Logan reveals his sex life struggles with wife Gabby (and what he keeps private) after he had his prostate removed following cancer battle\n-\nAnt McPartlin and leggy wife Anne-Marie Corbett enjoy a romantic lunch date as they celebrate their fourth wedding anniversary amid Portuguese getaway\n-\nWedding venue loved by Taylor Swift files for bankruptcy... with only $57 left and $63 MILLION due to creditors\n-\nEXCLUSIVE\nSheridan Smith says she would 'love' to return for Two Pints Of Lager And A Packet Of Crisps reboot as she joins co-star Will Mellor's calls to revive the iconic BBC comedy\n-\nJessie J reveals she needs to have more surgery after being rushed back to hospital following mastectomy and breast cancer battle\n-\nPrincess Andre and her brother Junior join glam stars at the launch of ITV's reality entertainment schedule - after mum Katie Price blasted their new show\n-\nHow Kelly Clarkson's TV shows could be impacted after her ex's shock death\n-\nEmma Thompson poses alongside daughter Gaia Wise at The Dead Of Winter photocall at the Locarno Film Festival in Switzerland\n-\nEXCLUSIVE\nKelly Clarkson hit by unimaginable double tragedy after ex-husband Brandon Blackstock's shock cancer death: Fears as star 'feels lost'\n-\nMacaulay Culkin finally clarifies Home Alone rumours that have left fans guessing for YEARS\n-\n90s pop icon looks unrecognisable 26 years on from hit record\n-\nNepo baby of music icon walks Fashion Week runway... after claiming nepotism 'doesn't help' her career\n-\nEXCLUSIVE\nOlivia Bowen breaks down in tears as she shares fears of losing unborn baby in 'most real and raw' show tracking highs and lows of parenthood\n-\nAndy Cohen sparks feud with tennis star Martina Navratilova as he calls her comments on surrogacy 'dumb'\n-\nCara Delevingne drives home after celebrating her 33rd birthday sober after celebrating with fellow celebrity pals in Los Angeles\n-\nDanica Patrick sets pulses racing as she shows off stunning physique latest European vacation\n-\nWhat's got The Saturdays All Fired Up? Fans convinced Rochelle Humes and Frankie Bridge have fallen out after 'Wimbledon snub' and cryptic post\n-\nEXCLUSIVE\nTom Holland is supported by fiancée Zendaya as he films on set of Spider-Man: Brand New Day at Brookwood Cemetery in Surrey\n-\n'Surprisingly poor' John Cleese, 85, is set to buy a house in Bath with his fourth wife - after giving her his £1.5m Chelsea flat\n-\nRochelle Humes steps out with sister Sophie Piper after she raised eyebrows by posting Myleene Klass' ex Graham Quinn - as fans speculate she's fallen out with Frankie Bridge\n-\nIconic Netflix actress looks unrecognisable as she shares throwback snap - but can YOU guess who it is?\n-\nAmanda Holden shows off her sizzling figure in a skimpy white bikini as she twins with lookalike glam daughter Lexi Hughes in Greece\n-\nBig Brother star Hardeep Singh Kohli 'groped woman's buttocks at BBC studios, indecently assaulted another at hotel and tried to put his tongue in third victim's mouth'\n-\nBig budget ITV game show AXED as gutted presenter admits 'I don't know what I did wrong'\n-\nAbbey Clancy looks sensational in a tiny cream bikini as she enjoys a yacht trip with shirtless husband Peter Crouch in the south of France\n-\nLove Island's Harry and Shakira reveal how things have REALLY been left with Helena in first TV interview - but swerve question about if they're exclusive\n-\nBBC Breakfast fans gasp 'my head hurts!' as show pulled off air after string of technical blunders so bad they 'thought their TVs were broken'\n-\nNetflix star goes on 180-hour journey to tiny Greek island to eat his favourite ice cream\n-\nMariah Carey reveals the unlikely requests she has for King Charles when she performs for him at Sandringham\n-\nKanye West's wife Bianca Censori covers up for stepmom duty as she takes rapper's kids out in LA\n-\nPrincess Beatrice appears in promo for UAE bank's new Mayfair branch - as explosive new claims about Prince Andrew's business dealings emerge\n-\nGina Carano rejoices over win for free speech as Disney forced to settle Mandalorian firing with groveling statement\n-\nFurious Sha'Carri Richardson pummels boyfriend in shocking security footage from arrest\n-\nScarlett Johansson is blasted by fans for her 'awful' English accent in new movie My Mother's Wedding\n-\nPrincess Beatrice's original name was rejected by the late Queen for being too 'yuppie'\n- Kelly Clarkson's ex-husband Brandon Blackstock dead at 48 after cancer battle Sad news\n-\nPrincess Andre makes a solo red carpet appearance at beauty event after mum Katie Price condemned her upcoming documentary\n-\nWhite Lotus actor calls out 'old movie stars' who get plastic surgery to play 'young roles'\n-\nCheffin' it up! Brooklyn Beckham gets back in the kitchen as he hosts Cloud 23 summer party - after renewing his vows with wife Nicola Peltz amid family feud\n-\nLauren Sanchez shows off extravagant £227k watch she was gifted as a wedding present by billionaire husband Jeff Bezos\n-\nEXCLUSIVE\nLove Island's Dejon Noel-Williams defiantly hits back at being branded a 'narcissist' - revealing he wanted to QUIT\n-\nEXCLUSIVE\nThe man who discovered Elvis... and then destroyed him: How the King spiralled into addiction and death at the hands of his high-rolling manager\n-\nThe nepo-baby so well-connected she's King Charles's 'official DJ' and parties with Naomi Campbell - but you've probably never heard of her\n-\nUS actor Jeremy Piven drops C-bomb in trainwreck interview on Aussie radio\n-\nFrankie Bridge raises eyebrows with cryptic post saying 'you're dead to me' - so who IS she talking about?\n-\nAudiences are left shocked by Margot Robbie and Jacob Elordi's 'aggressively provocative' Wuthering Heights movie with 'BDSM sex scene'\n- MasterChef loses nearly 1MILLION viewers as new series airs after both presenters were sacked On the slide\n-\nFreddie Mercury fans turn their ire on author who revealed star's love child in bombshell book - but she's sticking to her guns\n-\nWhat's inside Keith Urban's bag? Nicole Kidman's husband reveals the one item he ALWAYS flies with as he touches down with $12,000 worth of luggage\n-\nThe Royal Family's connection to acting and Princess Beatrice's surprising Hollywood film debut alongside Emily Blunt\n-\nWill Carrie Bradshaw end up alone? And Just Like That... hints at iconic character's final storyline as 'woke' reboot is cancelled\n-\nOzzy Osbourne leans on wife Sharon in one of their last photos together as part of first glimpse at moving new documentary\n-\nInside Max Parker and Kris Mochrie's lavish wedding: Emmerdale stars who played brothers on hit soap tie the knot\n-\nStranger Things star gets engaged to longtime partner\n-\nPregnant Rihanna shows off her bump as she shops at pricey baby boutique in Beverly Hills\n-\nEXCLUSIVE\nMax Verstappen and girlfriend Kelly Piquet purchase plot of land at luxury development Pinheirinho Comporta in Portugal\n-\nThe surprising royal who became the first - and only - member of the Royal Family to complete the London Marathon\n-\nJennifer Lopez, 56, refused entry into Chanel store after security 'failed to recognise her'\n-\nBrooklyn Beckham is back in the kitchen as he whips up a carbonara in latest cooking video - after renewing his vows with wife Nicola Peltz amid family feud\n-\nEXCLUSIVE\nWhy Andrew is 'toast': The man who revealed 'highly sexed' Prince Andrew's multiple affairs tells all to Palace Confidential\n-\nMachine Gun Kelly reveals the parenting comment that left Megan Fox 'fuming'\n-\nDuchess Sophie's stunning floral dress sold out immediately - we've found high street versions that look equally stylish\n-\nJodie Kidd makes rare public appearance with her lookalike son Indio, 13, as they attend the Space NK London launch party\n-\nMeghan does not deserve to be called 'Duchess Difficult'. Shame on the royals - This week have shown how wrong they are: BRYONY GORDON\n-\nQueen Mary's daughter Princess Isabella is caught in an X-rated shirt at a wild Danish music festival - and royal watchers are fuming\n- Brandon Blackstock's daughter announced her pregnancy weeks before his death His death was confirmed on Thursday\n-\nDiddy's ex Cassie Ventura returns to social media for first time since giving birth... after her painful testimony against the rapper\n-\nJAN MOIR: Andrew is utterly irredeemable but Fergie is so much worse. Her late-night emails to me say it all\n-\nPink's daughter Willow, 14, is her TWIN as singer poses for rare photo with her children\n-\nEDEN CONFIDENTIAL: Will Harry consider what he might have achieved in tandem with his brother after Sentebale row?\n-\nDark secret every influencer knows... but will never admit: Insiders tell me shame of trick so many stars exploit: MOLLY CLAYTON\n- Inside Kelly Clarkson and Brandon Blackstock's love story that ended in tragedy Died at 48 following a cancer battle\n-\nJaime King ordered to court after ex-husband's divorce lawyers claim she failed to pay over $100K in fees\n- ITV pulls the plug on legendary presenter's big TV comeback by AXING show after just one series All over\n-\nYungblud strips down to a British flag kilt for killer impromptu performance at his London store launch party\n-\nPrince Andrew lost his virginity at the age of 11 and had scores of sexual experiences before he turned 13, royal biographer claims\n- How the Royal Albert Hall was saved by the rave: KATIE HIND The Grade I-listed stages more than 390 shows a year\n- Katie Holmes' mini-me Suri, 19, beams on NYC movie set... before heading back to college in Pennsylvania Getting involved\n-\nFreakier Friday review: Twice as many body swaps, but this ropy sequel's only half the fun, writes BRIAN VINER\n-\nZoe Ball admits she was reduced to tears after falling victim to a random street crime after appearance on The One Show\n- King Charles to commemorate the 80th anniversary of VJ Day with an address to the nation Special day\n- Liam Neeson fans savage reporter for asking him about 'cringe' topic during 'nonsense' interview Not happy\n- Jack Nicholson's grandson Sean arrested on felony domestic violence charge He's the eldest of the 88-year-old's grandchildren\n-\nWednesday star Percy Hynes White has very ordinary new job after sex assault allegations got him cancelled\n- Cheryl Burke raves about having 'great' sex with HERSELF... three years after Matthew Lawrence divorce Surprising\n-\nDo you REALLY, REALLY wanna body to match Spice Girl Mel C? Well, here are my top tips on how you can get it...\n-\nHeartbreaking last picture of Oasis fan before he plunged to his death at Wembley gig\nLandscape gardener Lee Claydon died at show\n-\nKatie Price condemns daughter Princess Andre's documentary in explosive new interview as she sets record straight\n-\nAmal Clooney, 47, cuts an elegant figure in a pink thigh-split dress as she and her dapper husband George, 64, head out for dinner\n-\nChris Hughes reveals the old-fashioned way he told JoJo Siwa how he really felt about her and recalls the moment when feelings changed\n-\nI'm A Celeb star is cruelly dad-shamed by online trolls for sharing picture of his four-year-old son drinking milk from a bottle\n-\nEXCLUSIVE\nREVEALED: The comments that confirm Rebekah Vardy won't fulfil her dream of moving to Beckham's precious Miami\n- Singer Caity Baser reveals she was sexually assaulted by a family friend when she was just eight years old Harrowing\n-\nDavid Beckham rocks tiny trunks with Victoria and son Cruz on yacht... while Brooklyn and wife Nicola Peltz are seen for first time since vow renewal amid 'feud'\n- The Walking Dead star Kelley Mack 'suddenly relapsed' after cancer treatment before death aged 33 Very sad\n-\nCHRISTOPHER STEVENS reviews The Fortune Hotel: 'A witless game show set in paradise, but as boring as hell'\n-\nEXCLUSIVE\nUnearthed photos show Brad Pitt's treasured memories of his late mum, who was cut off from her grandkids by Angelina\n- Jack Lowden's wedding photos finally appear, but it is not his wife Saoirse that's in them Unexpected\n- Jason Kelce opens up on music career... and the chances of a collaboration with Taylor Swift Big plans\n- Nepo baby lands gig working alongside his actor dad - can you guess his famous father? Following his footsteps\n-\nMacaulay Culkin regrets missing '90s comedy after not even reading the script during teenage retirement\n-\nMy sister disappeared on a cruise ship 27 years ago - what I think REALLY happened is the stuff of nightmares\n-\nMariah Carey accused of shading Katy Perry as she gives 'savage' response when asked about singer's space trip\n- New twist in Conor Maynard and Charlotte Chilton paternity row as explosive new allegation is 'revealed' Latest development\n- Richard Gere jets back to US as furious daughter of music icon curses him over sale of her childhood home Outraged\n- Jacob Elordi and Olivia Jade Giannulli SPLIT after four years together The couple have called time on their romance\n- Katy Perry reveals nasty injuries after THAT harrowing viral stage collapse Took to her Instagram on Wednesday\n-\nEXCLUSIVE\n'This is the Oasis effect': Woke TV comedian blames the Gallaghers after nobody turned up to watch her Edinburgh shows\n-\nKylie Jenner flashes cleavage and drinks wine with pals as it's been ONE MONTH since she's been seen with Timothee Chalamet\n-\nStacey Solomon shares adorable photos of her daughters, Rose, three, and Belle, two, as she gives an insight into their family holiday\n-\nDenise Richards accused of 'abandoning' sick dog by ex Aaron Phypers... days after she's seen with black eye"
    }
  ],
  "argos_summary": "A lawsuit has been filed against three Coos Bay police officers after Nathan Bradford Smith died in their custody during a mental health crisis. The officers allegedly neglected Smith's medical needs while one officer, Benjamin Martin, is accused of scrolling through TikTok and sending intimate texts instead of providing assistance. Smith was left gasping for air in the back of a police cruiser for over 40 minutes before receiving medical attention, which his family claims contributed to his death from hyperthermia.",
  "argos_id": "S067YHVTV"
}