{
  "url": "https://www.nytimes.com/athletic/6540468/2025/08/08/copa-america-femenina-wafcon-womens-soccer-euros/",
  "authorsByline": "Tamerra Griffin and Melanie Anzidei",
  "articleId": "c0ecbe358b5148b18f242c28f45276c1",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/07123122/GettyImages-2227571174-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T11:00:45+00:00",
  "addDate": "2025-08-08T11:12:09.083314+00:00",
  "refreshDate": "2025-08-08T11:12:09.083316+00:00",
  "score": 1.0,
  "title": "Copa América Femenina, WAFCON showcase their potential – and a need for more support",
  "description": "Some of the brightest stars in women’s soccer hail from South America and Africa. Their continental tournaments deserve more respect.",
  "content": "The numbers are staggering. Thirty-one days. Three continents. Thirty-eight teams representing populations as vast as 237 million (Nigeria) and as quaint as 398,000 (Iceland). Eighty-five matches, 10 of which were decided by stomach-churning penalties. Two of those nail-biters were finals. And each of the 2025 continental champions – England at the Euros, Nigeria at the Women’s Africa Cup of Nations (WAFCON) and Brazil at Copa América Femenina — successfully clawed its way back from deficits.\n\nThis is the kind of summer that compels you to commit every detail to memory so they crystallize into legendary tales for future generations: Ann-Katrin Berger’s heroic save to keep Germany in the quarterfinals; Esther Okoronkwo’s cool-calm-collected penalty despite Moroccan fans flashing lasers in her face to turn the tide back toward Nigeria’s Mission X; the timeless Marta’s last-second goal in the Copa final that revived Brazil’s hopes of a ninth title.\n\nEurope and the U.S. are home to some of the finest, most storied women’s football teams and players in the world, but increasingly, at the club level, stars boast roots in Africa and South America. Yet each time there’s an opportunity to follow these superstars back home to their competitions outside the Global North, the efforts fall short of doing them justice.\n\nToo often, matches are inaccessible to a global viewership or broadcasters pour limited resources into their programming. And the competitions are routinely marred by controversy, be that related to organizers’ poor planning or limited investment by team’s federations. With Brazil hosting South America’s first Women’s World Cup in 2027, it’s past time to pay respect to women’s football being played outside the glitz of Europe and the U.S..\n\nDespite the concern over whether a small country like Switzerland could host the 2025 Euros, the hosts punched above their weight. Fans accessed each of Switzerland’s stadiums with relative ease, filling venues and setting a new tournament attendance record of 657,291. Combined attendance for the quarter finals was 112,535, the highest in the history of the tournament.\n\nThat enthusiasm was reflected in broadcast viewership numbers as well. The group matches and the final on Fox were the tournament’s most watched ever in English in the U.S., with an average viewership of 306,000 in the group stage and a final peak of 1.92 million viewers.\n\nEngland’s storybook ending to a second straight European Championship was a fitting one, but the same could be said of WAFCON and Copa América Femenina. The gaping disparities between the three tournaments, from the media coverage and accessibility to dedicated resources and logistical strategy, expose a lack of attention to African and South American women’s football, though, even as the global game expands and competition between teams grows tighter.\n\nThere’s no denying that women’s football in South America and Africa is being held back by circumstances beyond players’ control. Nevertheless, the product is arguably the healthiest and most entertaining it’s ever been.\n\nFor a continental tournament that almost didn’t happen, WAFCON crackled with stars who compete in NWSL. Zambian forwards Barbra Banda and Racheal Kundananji of the Orlando Pride and Bay FC, respectively, scored all six of the Copper Queens’ goals in the tournament. Bay FC’s Asisat Oshoala opened the account for the Super Falcons’ historic run, taking just four minutes to find the back of the net against Tunisia. Gotham FC teenager Stella Nyamekye is still working her way into her club’s playing roster, but the 19-year-old left a lasting impression for Ghana, who placed third.\n\nBut the tournament’s shine didn’t only focus on NWSL players, nor those who play in top divisions or outside the continent. Botswana narrowly missed advancing out of their group yet shone at their second WAFCON, particularly 27-year-old goalkeeper Sedilame Maitumelo Bosija, who plays for Mamelodi Sundowns in South Africa.\n\nBeneath the surface of the vibrant matchday outfits and irresistible playlists for which African tournaments are known, however, discontent simmered. Ten-time champions Nigeria are still battling their federation over unpaid wages. Before their first match, Super Falcons captain Rasheedat Ajibade called out the Confederation of African Football (CAF) for the quality of hotel rooms the team was given, writing, “Two professional women’s players in this kitchen-sized room at a prestigious tournament” on an Instagram story, adding that the confederation “can do better.”\n\nIn South America, the tone for Copa América was set one week before the tournament began. Uruguayan players took to social media in a collective push to protest their working conditions.\n\n“This measure is not against our passion, but rather for a fair right,” players’ viral statements read. “We want to represent Uruguay in the Copa América, but we also deserve dignified treatment for our effort and dedication.”\n\nThis story came to a positive conclusion, with players flying to Quito, Ecuador, just a few days later, after Uruguay’s federation agreed to meet players’ demands. What were those demands? Use of the national team training center, better training conditions and clothing, reclassification from a “development team” to full national team status and improved daily allowances for national and international duty. The team would go on to open the tournament against hosts Ecuador, with No. 10 Belén Aquino scoring a banger in the 11th minute. The moment felt like Uruguay once more raising its collective fist in the air.\n\nThe media ecosystem surrounding the WAFCON and Copa América Femenina also pales in comparison to resources companies poured into Euros coverage this year. From a broadcast perspective, U.S. viewers tuning in for Copa América Femenina for English-language coverage were often presented with Euros coverage during halftime of matches. Some games were manned by a single broadcaster, who juggled analyst and play-by-play duties. Yet, this did little to stifle the growing appetite for South American women’s football in the U.S., which was evident by the dramatic spike in viewership from the 2022 competition.\n\nSaturday’s historic final between Brazil and Colombia was the most watched Copa América Femenina telecast on Fox Sports networks ever. The network on Tuesday revealed it saw a 273 percent jump in viewership, with 302,000 tuning in on Saturday compared to 81,000 viewers in 2022 for the same matchup.\n\nIt’s worth noting the final was booted from its expected channel come gametime, leaving viewers confused after Fox unexpectedly moved coverage to FS2 due to a baseball game running over on FS1, which was slated to show the game. The match eventually returned to FS1 mid-game. The snafu is symbolic of the cards women’s sports viewers are often dealt, even as the sector’s popularity skyrockets. It’s unclear whether the switch had any impact on Fox’s final viewership numbers. Overall, Fox reported the 2025 tournament saw a 114 percent spike in viewership across FS1 and FS2 compared to 2022 (79,000 vs. 37,000 viewers).\n\nAnd while BeIN Sports carried WAFCON as it did in 2022, the platform remains challenging and expensive to access in the U.S., which could be done via Fubo, or on YouTube TV along with a Sports Plus add-on package. BeIN Sports did not respond to multiple requests for comment from The Athletic about viewership numbers or how the company prioritizes the tournament.\n\nThroughout Copa, the theme of inequity remained a persistent thorn in the sides of organizers, with some pre-tournament decisions, like limiting player access to pitches before fixtures, resulting in fierce backlash from fans and players in the tournament. After Brazil’s game against Bolivia, images began circulating of these teams warming up in crammed indoor spaces at the stadium, and also side by side. CONMEBOL reasoned this was structured to maintain the integrity of the pitch when back-to-back games were held in one stadium. The governing body reversed the rule following pushback, allowing players access to pitches 15 minutes before matches.\n\nBrazil may have boasted the loudest voice to push back, with Marta describing how she felt dismayed by the tournament’s organization.\n\n“It’s been a long time since I played in a tournament here in South America, and we’re saddened by these situations,” Marta told the Brazilian outlet Globo Esporte. “(CONMEBOL) demand performance from the athletes and a high level of work, but we also demand a high level of organization. We have the right to demand organization.\n\n“This situation is really disruptive. There wasn’t enough space for both teams, but both wanted to be there to prepare. I really don’t understand why we can’t warm up on the field. This is still a problem for us because it’s very hot here, with the altitude.”\n\nIt wasn’t long before players began comparing their Copa América to the men’s massive version that unraveled across the U.S. last year. Argentina, winners of the men’s Copa America, went home with a whopping $16 million. By comparison, Brazil’s women only took home $1.5 million.\n\nMorocco hosted its second WAFCON in a row in July, and has already claimed the next host duty for the following tournament kicking off next year in CAF’s effort to realign the schedule after COVID-19 and Olympics interruptions. Questions must be asked about the benefits and costs of serial hosting, especially because the 2025 iteration of the tournament saw a downgrade in facility use due to the fact that Morocco is also hosting the men’s AFCON from December to January 2026.\n\nIn order to prepare for the men’s tournament, the Royal Moroccan Football Federation planned renovations of the three major stadiums used in the 2022 WAFCON — but they were unavailable to the women’s teams this time and moved to smaller venues further outside the city centers of Rabat and Casablanca.\n\nMarketing around Copa América was a huge talking point, too, with critics suggesting if federations or organizers had done a better job pitching the event to the world, then there’d have been more interest. The players are already marketable. Marta, for instance, has 2.8 million followers on Instagram. An unfortunate footnote for women’s football is that players have in the past had to fight for visibility on social platforms — something that Uruguayan players had to demand of their domestic clubs in 2023.\n\nAcross the three tournaments, Nigeria and Brazil are by far the biggest; the latter has an estimated population of more than 212 million which notably contains the largest number of people of African descent outside of Africa, specifically Nigeria. These are massive missed opportunities to spotlight star players with engaged supporters. Oshoala, a six-time African Women’s Footballer of the Year, has 1.2 million Instagram followers, for instance. For its part, Spotify did collaborate with the Houston Dash’s Michelle Alozie to celebrate Nigeria’s newest trophy.\n\nThese tournaments were a success on the pitch, with players delivering entertaining football and historic matchups that have fans begging for more. But players can’t grow the game alone. It’s imperative stakeholders across women’s football in South America and Africa do their part. Too often players in women’s football are expected to win championships before they can demand for what they deserve — but this fails to consider that their demands would help win those championships.\n\nWhen asked to assess the quality and promise of African women’s football, especially after beating a technically strong team like Morocco, Nigeria interim manager Justine Madugu was emphatic in his opening response after the match.\n\n“Internally, we have to look at development from the angle of facility development, player management, and good welfare support and package for them, and try as much as possible to expose the women’s league to win or attract more sponsors that will put more money into the game,” he said.\n\n“Even us as coaches, we need better education, too. We also need to improve ourselves because you can’t just remain at the level you are. The game is dynamic. There are new ideas coming up every time.”\n\nMadugu also stressed the importance of building developmental programs within all African federations, a strategy Morocco has been bullish about in recent years.\n\nBrazil coach Arthur Elias reflected how the tournament, and final, could have been improved. One example, he said, would have been better-quality pitch.\n\n“Why is what we have in FIFA so different and what we have in CONMEBOL so different? This is just a reflection, I’m not here to massacre and judge anyone, neither the referees nor the organizers,” Elias said. “Women’s football only deserves respect and equal conditions.”\n\nThere will be two more opportunities for federations, media outlets and businesses looking to capitalize on the explosion of global women’s soccer to get things right in South America and Africa. July 2026 will see another edition of WAFCON, and there is no doubt the teams will build on the momentum generated.\n\nSouth America’s teams resume competitive play with the inaugural CONMEBOL Nations League in October, the new pathway for teams to qualify for the Women’s World Cup. Until now, Copa América was the region’s lone qualifying pathway. It’s a welcome change that provides teams with more competitive matches, which, for some nations, remain a rarity. It also sets the stage for drama and the potential for upsets.\n\nThe Women’s World Cup has the potential to bring a seismic shift to women’s football in South America. It’s an unprecedented opportunity that could ignite the sport’s growth on the continent and showcase the possibilities outside of North America and Europe — so long as everyone is prepared. The players certainly are.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6504124/2025/07/19/ann-katrin-berger-germany-euros-save/",
    "https://www.nytimes.com/athletic/6482204/2025/07/09/uruguay-player-protest-copa-america-femenina/",
    "https://www.aljazeera.com/sports/2025/8/5/nigeria-sportswomen-dominate-again-but-pay-remains-an-issue",
    "https://www.nytimes.com/athletic/6503214/2025/07/18/copa-america-femenina-practice-rule-changes-brazil/",
    "https://www.nytimes.com/athletic/6533009/2025/08/04/copa-america-femenina-2025/",
    "https://www.nytimes.com/athletic/6532662/2025/08/02/copa-america-femenina-brazil-colombia-penalty-shootout-results/",
    "https://www.nytimes.com/athletic/6472415/2025/07/04/wafcon-2024-tournament-preview/",
    "https://www.nytimes.com/athletic/6512624/2025/07/24/nigeria-mission-x-wafcon-final/",
    "https://www.nytimes.com/athletic/6517600/2025/07/27/morocco-wafcon-finals-nigeria-host/",
    "https://www.instagram.com/p/DLpyr2DNLQY/?hl=en&img_index=2",
    "https://open.spotify.com/playlist/37i9dQZF1DX8SaiEt4OVJw?si=c146af359c83434c&nd=1&dlsi=bda0d1993cd84681"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "African tournaments",
      "weight": 0.0650795
    },
    {
      "name": "Copa América Femenina",
      "weight": 0.0627829
    },
    {
      "name": "Copa América",
      "weight": 0.06128609
    },
    {
      "name": "Copa America",
      "weight": 0.05916573
    },
    {
      "name": "star players",
      "weight": 0.059108842
    },
    {
      "name": "player access",
      "weight": 0.057807505
    },
    {
      "name": "players",
      "weight": 0.057178766
    },
    {
      "name": "NWSL players",
      "weight": 0.056956157
    },
    {
      "name": "Uruguayan players",
      "weight": 0.056469757
    },
    {
      "name": "player management",
      "weight": 0.056084402
    }
  ],
  "topics": [
    {
      "name": "Soccer"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9931640625
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.97705078125
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.77587890625
    }
  ],
  "sentiment": {
    "positive": 0.21374512,
    "negative": 0.4428711,
    "neutral": 0.34350586
  },
  "summary": "The recent Copa América Femenina and Women's Africa Cup of Nations (WAFCON) highlighted the potential of African and South American women's football, with each team successfully coming back from deficits. Despite concerns about Switzerland's ability to host the 2025 Euros, fans filled venues and set a new tournament attendance record of 657,291, the highest in the history of the tournament. The WAFCON was also the most watched ever in English in the U.S., with an average viewership of 306,000 in the group stage and a final peak of 1.92 million viewers. However, there is a lack of attention given to African, South American and African women’s football, despite the healthiest and most entertaining tournament ever.",
  "shortSummary": "The upcoming Women’s World Cup in Brazil will showcase the potential and the challenges of global football, highlighting the need for more support.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "030a99d3e513459691568d50928a75b0",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6503214/2025/07/18/copa-america-femenina-practice-rule-changes-brazil/",
      "text": "CONMEBOL, South American football’s governing body, has advised teams competing in Copa América Femenina that all players will now have access to pitches for pre-game warmups, according to a memo reviewed by The Athletic.\nThe message went out to teams Thursday night, following widespread criticism the previous day from Brazilian players, including Marta, the six-time FIFA Player of the Year, over tournament regulations requiring players to warm up in a small, indoor area alongside their opponents.\nAdvertisement\n“From now on, in addition to the goalkeepers who already had a warm-up period on the field for 15 minutes, the possibility will be enabled so that the field players can also warm up on the field of play during the same period of time,” the memo said. “After an extensive evaluation of the state of the playing fields of the competition stadiums so far and also considering the feedback received from some participating teams, CONMEBOL has decided to implement an adjustment in the pre-match operations.”\nThe mid-tournament change comes after players publicly criticized the confederation and organizers in Ecuador over warm-up conditions at the tournament, which is considered the premier event in South American women’s football.\nImages have circulated on social media, with a video posted by Dibradoras, a Brazilian media company that covers women’s sports, showing Brazilian and Bolivian players warming up together in a confined space ahead of their Wednesday night match.\nPode isso, Conmebol?\nTivemos acesso a imagens do espaço onde a @SelecaoFeminina aqueceu antes de entrar em campo para o jogo contra a Bolívia na Copa América.\nDividindo um “puxadinho” com as adversárias, as jogadoras ficaram espremidas fazendo as atividades + pic.twitter.com/QzkfNDTTOy\n— Dibradoras (@dibradoras) July 16, 2025\nThe tournament implemented the original system to prevent damage to the pitch at Gonzalo Pozo Ripalda Stadium, which hosted back-to-back games on Wednesday.\n“It’s been a long time since I played in a tournament here in South America, and we’re saddened by these situations,” Marta, 39, told the Brazilian outlet Globo Esporte. “(CONMEBOL) demand performance from the athletes and a high level of work, but we also demand a high level of organization. We have the right to demand organization.\n“This situation is really disruptive. There wasn’t enough space for both teams, but both wanted to be there to prepare. I really don’t understand why we can’t warm up on the field. This is still a problem for us because it’s very hot here, with the altitude. We hope CONMEBOL reverses some of the issues and improves things.”\nAdvertisement\nBrazil’s head coach, Arthur Elias, previously indicated that this setup limited his ability to evaluate players before deciding on his starting 11. This was partly why 25-year-old Kerolin was absent from Brazil’s lineup in their opening game against Venezuela. The Manchester City forward, who was the NWSL’s Most Valuable Player in 2023, went on to score a hat-trick in Brazil’s 6-0 win over Bolivia.\n“Unfortunately, we are in a competition where the teams don’t warm up on the field,” Elias said of Kerolin’s initial absence. “That is, they don’t warm up football, they warm up other movements. … It’s more or less the size of this room. We can only warm up the starters. We can’t even warm up the reserves.\n“These are not gestures that are part of the game. There’s not much exchange of passes, there’s no intensity that you can achieve because the space is small, so they don’t warm up as the football player has to warm up to practice.”\nBrazilian midfielder Ary Borges, who plays for the NWSL’s Racing Louisville FC, echoed similar criticism following Brazil’s win against Bolivia, directly calling on CONMEBOL president Alejandro Domínguez for improvements. Borges shared her grievances, including the lack of a video assistant referee (VAR) system in the group stage, with commentator and former player Francielle Alberto.\n“We are playing in a competition that counts for a place in the Olympics … and we don’t have VAR in the games, we can’t step onto the pitch in a game against Venezuela without knowing what the pitch (is) like,” Borges said, “Worst of all, (we are) warming up on a synthetic pitch, (over) cement, within a space of 10, 15 meters, stinking of paint, because it looks like they painted the stadium there two days, one day before.\n“So, it’s very difficult, because last year we had a men’s Copa América at good times, in good stadiums and we see … this disregard for women’s football and it’s a shame.”\nAdvertisement\nIn speaking to Globo Esporte, Borges added, “Ask (Domínguez) if he could warm up in a 5 to 10 meter space that smells of paint. I think we had the example of the Men’s Copa América, with a huge structure. Why is the women’s tournament having this kind of thing?”\nBrazil is the defending champion of the Copa América Femenina title and is an 8-time winner of the competition. This summer’s spectacle is of increased significance with the 2027 women’s World Cup coming to South America for the first time, with Brazil serving as tournament hosts.\n(Photo of Marta: Franklin Jacome / Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6482204/2025/07/09/uruguay-player-protest-copa-america-femenina/",
      "text": "After refusing to train in protest one week before the start of Copa América Femenina, the Uruguayan women’s national team has resumed training and is on its way to Ecuador to compete in South America’s premier soccer competition, The Athletic has learned.\nThe national team’s players union, Mutual Uruguaya De Futbolistas Profesionales (MUFP), told The Athletic on Tuesday that the national team’s protest was a result of “some differences in negotiations.”\nAdvertisement\nThe dispute began after several days of unsuccessful exchanges between the team and the Uruguayan Football Association (AUF) over resources for the team. By Saturday, players shared statements across social media declaring they would refuse to train “because we still have no favorable response to the improvement of our conditions.”\n“This measure is not against our passion, but rather for a fair right,” their statement said. “We want to represent Uruguay in the Copa América, but we also deserve dignified treatment for our effort and dedication.”\nThe union spent “all day” Monday working on a proposal, reaching a resolution with AUF by Tuesday.\n“It ended positively,” MUFP General Secretary Mitchell Duarte told The Athletic.\nThe players’ demands included use of the national team training centre; better training conditions and clothing; reclassification from a “development team” to full national team status, and improved daily allowances for national and international duty. All demands were accepted by AUF, according to the MUFP.\nMUFP issued an official statement late Tuesday night on their social media as players started circulating the message on their accounts. Some players also started sharing images from the airport.\n“After intense negotiations, we reached an agreement with the authorities of the Uruguayan Football Association,” MUFP’s statement read. “We will continue working with the commitment to improve conditions and continue promoting our sports development.”\nAccording to Duarte, smaller negotiations remain ongoing regarding transfers, meals and “a lot of other things.”\nWith the team traveling to Ecuador on Tuesday, they now have a limited window to prepare and acclimate to local conditions. Uruguay opens the tournament Friday night against host nation Ecuador at IDV Stadium in Quito, Ecuador’s capital. The city is estimated to be 9,350 feet above sea level. For comparison, Denver’s elevation is about 5,280 feet.\nAdvertisement\nUruguayan players have publicly fought for better working conditions in the past. Almost exactly two years ago, about 300 players demonstrated at the headquarters of MUFP in Montevideo, Uruguay, signing a proclamation that demanded “equal opportunities and access to adequate facilities, resources and financial support,” according to a release FIFPRO issued at that time.\nPlayers said they refused to train in “deplorable conditions, or in public squares or gardens” and refused to use dressing rooms “without minimum infrastructure and hygiene conditions.” They said clubs provided players with clothing discarded by men’s teams, and that players were forced to pay for their transport and, in some cases, their managers or clothing. Some clubs did not cover medical expenses in case of injury. The players also called for added visibility of the Uruguayan league in the media and clubs’ social networks.\nUruguay is the smallest nation competing in Copa América this summer, both geographically and in terms of population. The team recently had a promising showing against Mexico in a pair of friendlies, drawing 2-2 on May 30 and losing 1-0 on June 3. They are tied with Venezuela for having the least appearances in the tournament, with 6 wins, 3 draws and 20 losses across 29 games.\n(Photo of Belén Aquino by Yuri Cortez / AFP via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6533009/2025/08/04/copa-america-femenina-2025/",
      "text": "Copa América Femenina has come to its glorious and chaotic conclusion, with Brazil and Colombia delivering a championship that was like cinema on the pitch.\nThe game had it all: a lethal Colombian pairing of Linda Caicedo and Mayra Ramirez slowly dismantling Brazil with every brilliant connection, only to be stopped by 39-year-old Marta and her late-game heroics, a reminder that she unretired for this.\nAdvertisement\nThrough 120 minutes and seven rounds of penalty kicks, the Copa América crown was painfully within reach for Las Cafeteras. But Brazil refused to let go.\nThe 23,798 ticketed fans inside La Casa Blanca in Quito, Ecuador, witnessed an iconic display – a highlight reel of what these players are capable of, despite the limited resources they’re often provided with, even on the continent’s biggest stage.\nThe tournament’s fairytale ending, however, stands in stark contrast to its low points over the last four weeks, which were riddled with low attendance and organizers’ questionable decisions. Players have been outspoken, successfully demanding better conditions, and questioning why their competition is so far behind its wildly successful counterpart in Europe.\nThe question is a valid one, especially as Brazil prepares to host the continent’s first women’s World Cup in 2027. If this Copa América is any indication, there is still plenty for those in charge of South American women’s soccer to do.\nBrazil earned its ninth crown after defeating Colombia 5-4 on penalties, following a 4-4 tie after extra time. The team has never missed a Copa final since the tournament began in 1991. That’s a testament to Brazil’s dominance and a reminder of the disparities between soccer nations in the region. The only nation to ever top Brazil was Argentina in 2006.\nMarta wrote another chapter in her storied career with a late brace. She came on in the 82nd minute, with the teams tied 2-2. Fourteen minutes later, she saved Brazil from defeat with a deadly strike from outside the box in the last second of stoppage time, sending the match into extra time.\nShe did it again, scoring late in the first half of extra time, putting Brazil ahead for the first time in the match.\nMarta knew when she changed her mind about international retirement that she would be returning to Brazil to show up in these moments. Selected as the best player of the tournament, she still has so much left to give. But Marta’s willingness to speak out for better conditions off the pitch on South America’s biggest stage could be her lasting legacy.\nThe Copa América was off to a rocky start before it even began, with the Uruguayan national team refusing to train in protest one week before the first scheduled game.\nThe team’s players union was at odds with their federation over resources available to its players. The players soon began sharing statements across social media declaring they would refuse to train “because we still have no favorable response to the improvement of our conditions.” Their statement continued, “This measure is not against our passion, but rather for a fair right. We want to represent Uruguay in the Copa América, but we also deserve dignified treatment for our effort and dedication.”\nAdvertisement\nThree days before Uruguay was set to open the tournament against hosts Ecuador, their union spent the day negotiating with the federation until their demands were met. They consisted of basic needs: use of the national-team training center; better training conditions and clothing; reclassification from a “development team” to full national-team status and improved daily allowances for national and international duty.\nSomehow, Uruguay put aside its grievances with its own federation, and 23-year-old Belen Aquino opened the scoring in Copa América with a banger from outside the box. The No. 10 set the pace for Uruguay, which finished in fourth place. It was their second-best Copa showing, after finishing third in 2006.\nThe controversies resumed with a bombshell revelation by the Brazilian national team five days later.\nFollowing their second group-stage fixture against Bolivia, Brazilian players aired their grievances to reporters in Ecuador, revealing that players were expected to warm up in confined indoor spaces. Images soon began circulating on social media, with a video posted by Dibradoras, a Brazilian media company that covers women’s sports, showing Brazilian and Bolivian players warming up next to one another in crowded space.\nThe defending champions, most notably Marta, did not hold back.\n“It’s been a long time since I played in a tournament here in South America, and we’re saddened by these situations,” Marta told the Brazilian outlet Globo Esporte. “(CONMEBOL) demand performance from the athletes and a high level of work, but we also demand a high level of organization. We have the right to demand organization.\n“This situation is really disruptive. There wasn’t enough space for both teams, but both wanted to be there to prepare. I really don’t understand why we can’t warm up on the field. This is still a problem for us because it’s very hot here, with the altitude. We hope CONMEBOL reverses some of the issues and improves things.”\nAdvertisement\nBrazilian midfielder Ary Borges echoed Marta’s sentiments and openly criticized the lack of a video assistant referee (VAR) system in the group stage. The absence of VAR was painfully obvious throughout the tournament, with mistakes visible to viewers because of broadcast replays.\n“We are playing in a competition that counts for a place in the Olympics… and we don’t have VAR in the games,” Borges said. “We can’t step onto the pitch in a game against Venezuela without knowing what the pitch (is) like. Worst of all, (we are) warming up on a synthetic pitch, (over) cement, within a space of 10, 15 meters, stinking of paint, because it looks like they painted the stadium there two days, one day before.\n“So, it’s very difficult, because last year we had a men’s Copa América at good times, in good stadiums and we see… this disregard for women’s football, and it’s a shame.”\nCONMEBOL, soccer’s governing body in South America, said it implemented this system to prevent damage to the pitch at Gonzalo Pozo Ripalda Stadium, which hosted back-to-back games that evening. Following public statements by Brazilian players, the confederation reneged, allowing players access to the pitch before each game.\nKerolin, who plays for Manchester City in the Women’s Super League, compared her experiences in Ecuador with what the world was seeing unravel at Euro 2025 in Switzerland — the best-attended and most-watched edition of the tournament.\n“I’m watching the Euro today… and man… The difference in structure, audience, investment is surreal…” Kerolin wrote on X. “It’s downright discouraging, I didn’t want to come here to talk about this, but structure would be the bare minimum for us.\n“There’s no way the whole world can evolve and here it’s not even a priority. At least that’s the experience I’m having. I hope they review and improve, it’s a competition between NATIONAL TEAMS!!”\nAdvertisement\nYet, despite what they called “discouraging” actions by those in charge — whether CONMEBOL or a team’s own federation — South American teams thrived on the pitch.\nParaguay’s Claudia Martinez, 17, became the youngest goal scorer in a Copa América Femenina with a hat-trick against Bolivia, and also scored against Brazil. The teen was a bright spot for fifth-placed Paraguay, which, like Argentina and Uruguay, qualified for the 2027 Pan American Games.\nThe final was a rematch of 2022 and featured the largest turnout of the tournament, by far. Colombia were fancied by many to possibly dethrone Brazil. Las Cafeteras came very, very close, too.\nBrazil’s ninth title seemed inevitable last week after the two sides met in the group stage. Colombia could not break through against the defending champions, who were down to 10 players after goalkeeper Lorena was sent off in the 24th minute. Colombia did not capitalize and the 0-0 draw cast doubt on their title credentials.\nIn the final, Colombia soon put paid to that by doing what very few South America teams can – scoring first against Brazil, putting them in an unfavorable and unfamiliar position. There were brilliant combinations from Caicedo and Ramirez, with Washington Spirit’s Leicy Santos scoring off a set piece in the 115th minute, to make it 4-4.\nAnd the result could have been different had Colombia’s Jorelyn Carabali not head-butted Brazilian forward Gio Garbelini inside the box, gifting Brazil a penalty, with Angelina making it 1-1 just before half time.\nWhile second place was not the objective for Colombia, this championship will serve as a “before and after” moment. Their runners-up spot earned their spot at the 2028 LA Olympics, but they must continue their growth and upward trajectory, shifting their focus to World Cup qualification.\nWith hosts Brazil already qualified, three further places are up for grabs through the inaugural CONMEBOL Women’s Nations League, which starts at the end of October. All nine teams play each other home and away with the top two qualifying and the third- and fourth-placed sides entering a playoff.\nThe new format has the potential for some major upsets, a key ingredient for more cinema on the pitch.\n(Top photo: Franklin Jacome/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6512624/2025/07/24/nigeria-mission-x-wafcon-final/",
      "text": "After 96 minutes in the unforgiving Moroccan sun, two penalties and one horrible injury to Gabriela Salgado, Nigeria found a way to keep their “Mission X” — to win a 10th Women’s Africa Cup of Nations (WAFCON) — alive.\nDefender Michelle Alozie’s surprising stoppage time cross-turned-goal proved to be the difference as Nigeria beat South Africa 2-1 in the semifinals on Tuesday. With the win, Nigeria secured their place at a WAFCON final for the first time in seven years.\nAdvertisement\nIt wasn’t until Alozie exited the pitch that she even realized the goal had been hers. From a distance, it could have easily belonged to the box-crashing efforts of substitutes Deborah Abiodun or Chinwendu Ihezuo, who obstructed South African goalkeeper Andile Dlamini just enough to allow the ball to squeak past the end line without fouling her.\n“When I went into the locker room, I was like, ‘Wait, what? This is my face on the post!’” Alozie told The Athletic after the game.\nView this post on Instagram\nNigeria’s journey in this tournament has been neither linear nor expected; their moments of excellence have been acknowledged only with an unapologetic raising of the bar. The nine-time continental champions’ group stage performances included a 3-0 victory over Tunisia and a scoreless draw with Algeria so tepid that it prompted an apology from their head coach.\n“We want to apologize to our dear countrymen and women for not winning the game because I know the expectation is that we must always win,” interim head coach Justin Madugu told the Super Falcon Show in the mixed zone after the match. “We will make sure that we work harder to make them happier in the subsequent games that we have to play.”\nA highly anticipated but ultimately anticlimactic quarterfinal meeting with Zambia followed. Despite Zambia’s dynamic duo of Barbra Banda and Racheal Kundananji, Nigeria put on a showcase, silencing the Copper Queens with a 5-0 victory with five different goalscorers. After their tense win over South Africa, the Nigeria are now one match away from their 10th WAFCON title and re-establishing their dominance on the continent.\nWith a population estimated just shy of 230 million people, and a diaspora of about 17 million, there are Nigerian eyes, ears and mouths everywhere. And right now, there is one mantra, one cry that can be heard from Lagos to Casablanca: Mission X.\nHowever, it is not simply about the perfect, round satisfaction of the number 10. It is about reasserting their place atop women’s soccer in Africa. But the arc has been more of a roller coaster, and Saturday’s clash with hosts Morocco will determine whether Nigeria are, in fact, turning up or backsliding.\nAdvertisement\nAfter leaving defeated from the 2022 WAFCON, where Nigeria were knocked out of the semifinals by Morocco, this team has been on a journey of redemption.\nIt began at the 2023 World Cup, where Nigeria held then-reigning Olympic gold medalists Canada to a scoreless draw (which included Nigerian goalkeeper Chiamaka Nnadozie saving a penalty taken by the legendary Christine Sinclair), beat hosts Australia and pushed European champions England to penalties. That knockout-round appearance — along with those of their continental colleagues South Africa and Morocco — drew more attention to the continued rise of women’s football in Africa.\nBut the roller coaster dipped again a year later at the Summer Olympics in France when Nigeria failed to advance out of their group with losses to Spain, Brazil, and Japan. Critics called for a refresh that championed youth talent. They questioned the selections of veteran players who hadn’t proven their worth for their clubs, and they were unable to understand how a team with Asisat Oshoala, Rasheedat Ajibade, Jennifer Echegini, Uchenna Kanu, Chinwendu Ihezuo and Ifeoma Onumonu on its roster wasn’t spraying goals all over the place as they’d seen this team do for decades prior.\nNigeria has long been a vanguard of women’s football in Africa. The local scene was already thriving in 1989, with more than a dozen clubs playing in Lagos when the Nigeria Football Federation officially recognized women’s clubs. And a year later, they were invited to participate in the qualifiers for the inaugural FIFA Women’s World Cup. The newly formed national team went on to become the only African team at the 1991 tournament in China.\n“By the time other African countries embraced the game, Nigeria had gotten ahead,” former Super Falcons player and coach Florence Omagbemi tells The Athletic. “We set up a strong foundation and legacy for the team, which is winning.”\nAdvertisement\nDuring the inaugural WAFCON in 1998, on home soil, the Nigerian faithful were treated to a masterclass. Their country scored 30 goals without reply across five games as they romped to the title. By that time, no other African nation had played in an official tournament. Nigeria had two World Cups under their belt and were headed to a pivotal third.\nThe world remembers the 1999 Women’s World Cup as women’s soccer’s debut on the global stage, with Brandi Chastain’s sports-bra-bearing celebration becoming one of the most iconic photos in tournament history. In Nigeria, the memories are similarly sweet for different reasons.\n“I think the biggest shock was the 1999 World Cup when we came to the U.S.,” remembers Omagbemi, who won four WAFCONs as a player and one as a coach.\nNigeria was drawn into a group with North Korea, Denmark and the United States. After handling North Korea in the first match 2-1, Nkiru Okosieme scored 73 seconds into the game against the U.S. at Soldier Field in Chicago. The goal was fraught in the moment as the USWNT went on to win 7-1. However, it was a wake-up call for Nigeria, who went on to beat Denmark to qualify for the quarterfinals.\n“That was the one that opened the door for most of the team because that was the first African team to get to the quarterfinal stage,” says Omagbemi, who, along with many of her teammates, signed with clubs in the U.S. and around the world off the back of the tournament.\nNigeria lost 4-3 to Brazil on a golden goal in extra time of the knockout match, but making that first quarterfinal was enough to accelerate their momentum with a ripple effect across the continent.\nWhen it came to club football, Nigeria had gone global, but it took some time for their cosmopolitanism to show up on the national team. Players born in Nigeria were getting recruited to play abroad, but the post-independence spread of the diaspora meant thousands, then hundreds of thousands, and now millions more living outside the country, creating arguably one of the widest wells of footballing talent in the world.\nAdvertisement\nIn October 2020, the Nigerian Football Federation named the Texas-born Randy Waldrum head coach. The following year, he met Alozie and Esther Okoronkwo through a contact, simply because they were Nigerian and training with the Houston Dash in the NWSL at the time. Waldrum was in town and short on players; he needed eligible last-minute volunteers for a scrimmage and recruited them.\nWaldrum, who also served as the head coach of the University of Pittsburgh’s women’s soccer program (where he recruited Abiodun), has spoken at length about the importance of searching beneath the radar and recruiting across the diaspora. Alozie grew up in Southern California. Okoronkwo is just outside of Houston.\nThe landscape of African football has drastically changed since 1991, when Nigeria appeared at the inaugural FIFA Women’s World Cup. South African football has steadily developed over the decades. Zambia have transformed from a backwater to a soccer talent factory that has a direct pipeline into the NWSL.\nMorocco has gone even further, investing millions into women’s football at grassroots, club and international level, and hosting three WAFCONs from 2022-2026. When the Atlas Lionesses first played Nigeria in 1998, they were humbled 6-0, but the student became the teacher in 2022 when they knocked out Super Falcons in a fiery semifinal.\nStill, Nigeria’s historic success grants the team a platform few other countries have. That also comes with the heavy burden that accompanies every successful team. Anything less than continued success is seen as failure, not only for the individual team or country, but possibly the continent.\nAnd off the field, winning has not kept conflict with the federation at bay.\nIn 2022, the team boycotted training ahead of their WAFCON bronze medal match after not being paid their bonuses. After the 2023 World Cup, the players had to seek help from the international players’ union FIFPRO to claim bonuses dating back to 2021. Ahead of the competition, Waldrum said that he had not been paid for over a year.\n“It’s been nothing but a constant issue. Up until about three weeks ago, I had been owed up to 14 months’ salary,” he said while speaking to the On The Whistle Podcast. “The two and a half years before that, it was the same thing. I would go five or six months without anything, and then they would pay you a bit of it.”\nAdvertisement\nSince Waldrum’s exit after the Paris Olympics, Nigeria have not replaced him. Instead, the team is being led by Waldrum’s former assistant Madugu, who has only been appointed on an interim basis. Regardless of his status as a temporary coach and the challenges within the federation, the pressure remains the same — and Madugu knows it.\nAfter the team’s slow start to the tournament, Nigerians were anything but quiet about their concerns, flooding comments sections and lobbing questions at Madugu, who apologized. Still, players know what a 10th title could do to push the roller coaster back up the track. And they have plenty of talent to do so.\nNigeria still produces talent at a rate that none of the other teams can, and are subsequently able to leave NWSL players like Kanu, who competed in the 2022 WAFCON campaign and scored a goal, and Gift Monday out of the WAFCON squad.\nMission X is a quest not just for the current squad, everyone who surrounds this team.\n“It would mean a lot for the team to win the 10th title,” Kanu said. “The whole country is looking up to the team to make that happen.”\n(Top photo: The Confederation of African Football)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6472415/2025/07/04/wafcon-2024-tournament-preview/",
      "text": "Three years ago, the world welcomed African women’s football with a roar. Close to 60,000 Moroccans squeezed into the 53,000-seater Stade Moulay Abdellah in Rabat to watch the women’s national team play in their first Women’s Africa Cup of Nations (WAFCON) final.\nMorocco lost 2-1 on the night to South Africa after a double from Hildah Magaia, but the genie was out of the bottle. African women’s football was here to stay.\nAdvertisement\nOn Saturday, WAFCON returns to Morocco, with the hosts kicking off the 12-team tournament against Zambia. But the footballing landscape is almost unrecognisable from that tournament three years ago.\nSince that final in 2022, football on the continent has gone from strength to strength. Morocco and South Africa thrilled at the World Cup in 2023, getting out of the group stage ahead of Germany and Italy respectively. Meanwhile, Zambia’s duo of NWSL stars Barbra Banda and Racheal Kundananji both scored as Zambia won their first points at the World Cup.\nAll three sides were outshone, though, as the Super Falcons of Nigeria — reeling from a first WAFCON without medalling — beat hosts Australia before taking England to penalties in the round of 16.\nIn the time since the last WAFCON, Banda, Kundananji and Nigeria’s Asisat Oshoala have joined NWSL, others have populated Europe’s top leagues and clubs, such as ASFAR Rabat and Mamelodi Sundowns, have pushed the boundaries of club football in the CAF Women’s Champions League.\nHowever, despite the strides, this tournament has been anything but a smooth ride. Taking place a year after it was originally scheduled, and officially called WAFCON 2024, it nearly didn’t happen at all. Here’s what you need to know about this summer’s tournament…\nWhy is the 2024 WAFCON happening in 2025?\nA month after the last edition of WAFCON, Morocco was announced as hosts for the 2024 edition. It was a win-win situation.\nMorocco, in their bid to become the home of football in Africa, would have the world’s eyes on it as well as giving its women’s national team, the Atlas Lionesses, another shot at winning the tournament on home soil. For the Confederation of African Football (CAF), Africa’s governing body, it was a no-brainer as Morocco was also willing to take on the financial burden of a tournament that has traditionally struggled to find a home.\nAdvertisement\nAfter cancelling the 2020 edition due to Covid-19, CAF had awarded the 2022 competition to Morocco and decided to move the tournament from its traditional slot in November-December to June-July to try to align with the European summer, as it had with the men’s AFCON.\nChanging the tournament to the summer has caused a raft of scheduling issues. With both Zambia and Nigeria qualifying for the Paris Olympics, CAF decided that it couldn’t host the WAFCON in the same summer.\nAs 2024 rolled on without any news from CAF, fears that the tournament would be cancelled entirely began to emerge.\nFinally, on June 21, 2024, just a couple of weeks before the tournament was initially meant to start, CAF announced that it would happen this July.\nIt has been disruptive to preparations. Nora Hauptle, the Swiss coach who masterminded Ghana’s return to the continental stage for the first time in six years, was meant to take charge of the Black Queens at the WAFCON. But with her contract expiring at the end of 2024, she left Ghana before taking over the Copper Queens of Zambia before the tournament.\nThe contract of defending champions Banyana Banyana’s head coach, Desiree Ellis, similarly ran out last year and has not yet been renewed. She begins the defence of the title against Ghana without a contract with the South African Football Association.\nThe insecurity hasn’t been easy on players either.\n“I actually didn’t know they would do it this summer,” Super Falcons defender Ashleigh Plumptre, a former England youth international, told The Athletic before the tournament.\n“I was just a bit more curious, ‘When are they going to fit in?’. Because obviously there is going to be another WAFCON next year.”\nWhile the men’s edition of the tournament, which starts in December in the same country, had its full schedule and stadiums published in January, fans of the women’s game had to wait until May 29 to find out where and when their teams would play, just five weeks before the opening match.\nAdvertisement\n“It’s a shame that the promotion around the Euros is huge (compared to WAFCON),” says Plumptre.\n“It’s been months and months in advance, and for us, build-up is now pretty much just around the corner from WAFCON.”\nAdditionally, with all three of the stadiums used in the 2022 WAFCON being renovated for the men’s tournament, instead of playing in Morocco’s biggest stadiums in Casablanca and Rabat, WAFCON is being hosted in three smaller grounds in the two cities as well as in Mohammedia, Berkane and Oujda, the latter two cities are just a few kilometres away from the Algerian border on the east of the country.\nWhen Morocco kick off the tournament this weekend, instead of recreating the raucous atmosphere they saw in the final that was attended by nearly 60,000 fans, spectators will have to fit into the newly built 21,000-capacity Olympic Stadium just 100 metres down the road in the same complex.\nBut if the organisation and promotion in the build-up to the tournament from CAF have been scattered, the tournament itself still promises to be just as thrilling on the pitch.\nWhat’s changed for hosts Morocco since the last tournament?\nMorocco find themselves among the favourites for the competition for the first time in their history — and for good reason.\nThanks to record investment in the women’s game, in the space of five years, Morocco has gone from a women’s footballing backwater to the World Cup knockouts and is one of only a handful of countries to have two tiers of professional leagues.\nPart of the nation’s drive to improve gender equality while improving its global image, in 2020, the Moroccan Federation initiated the “Marshall Plan” to develop women’s football, funded by the state.\n“Morocco has always had a balance between conservatism and secularism,” Moroccan football journalist Amine El Amri explains to The Athletic. “Lately, there was a huge step in women’s rights.\nAdvertisement\n“It’s a broad direction that Morocco has been stepping towards in the last decade. There are still a lot of issues and obstacles, but if you claim that you are a country developing women’s football, you have to show that you are tackling those issues.\n“By hosting the WAFCON, it is a huge step in showing all the people of Morocco and more broadly in North African society that it is possible to develop women’s football in our context.”\nIn a footballing context, Morocco certainly has put its money where its mouth is.\nForty-two clubs (14 in the first division and 28 in the second division) are now subsidised to the tune of up to $120,000 a year as well as being provided with training facilities, team buses, equipment, clothes and staff for every single team.\nOver the next month, the national team will be based at the Mohamed VI Football Complex, once described by former England youth international and full Moroccan international Rosella Ayane as “St George’s Park, but with palm trees”.\nThe complex has four five-star hotels, eight pristine pitches, one of them indoor and climate-controlled, futsal and beach soccer pitches, an Olympic-size swimming pool and a sports hospital on site.\nThe money and infrastructure have also allowed the kingdom to bring in top coaching talent. At the last WAFCON, Morocco were coached by Reynald Pedros, who managed Lyon to Champions League titles in 2019 and 2020. Their new coach, Jorge Vilda, led Spain to a 2023 World Cup win before being sacked amid the scandal of Spanish federation president Luis Rubiales nonconsensually kissing Jenni Hermoso.\nThe core of the team plays their football locally and is led by captain Ghizlane Chebbak, the daughter of former men’s international Larbi Chebbak. She is the face of women’s football in Morocco and is already considered a legend of the game. Chebbak is backed up by talented wingers Fatima Tagnaout and Sakina Ouzraoui Diki as well as the Saudi Women’s Premier League’s top-scorer, Ibtissam Jraidi.\nAdvertisement\nWho are the top contenders?\nThe standard has never been higher in Africa, and with the continent’s new “big four” all hitting new heights the tournament is set to be peak competition.\nSouth Africa begin their defence against Ghana’s Black Queens and retain the core of players who lifted the trophy in Rabat three years ago. But the team does not come into the tournament in the best shape.\nThe African champions are missing their star, Thembi Kgatlana, who pulled out of the tournament due to personal reasons, and the players boycotted training last weekend over unpaid bonuses.\nBut in the Mexico-based duo of Magaia and Jermaine Seoposenwe, they still have the firepower to be feared. Ellis is arguably the best African women’s coach around. Since taking over from Dutch coach Vera Pauw in 2016, she has led Banyana Banyana to their first two World Cup appearances and two WAFCON finals.\nNigeria will come into the tournament hungry for revenge, having been knocked out in the semi-finals last time out by Morocco, the first time they hadn’t won the tournament in a decade.\nOshoala, potentially Nigeria’s greatest talent, is still the star of the show, but she is surrounded by seasoned internationals. Brighton & Hove Albion’s new goalkeeper Chiamaka Nnadozie shone in the World Cup and for Paris FC when they knocked out Arsenal in last season’s UEFA Champions League. Like South Africa, the Super Falcons have had their own problems with being paid by the federation, even boycotting training themselves at the last WAFCON.\nWho is the emerging team?\nWhile Nigeria still retain the largest depth of talent, the new face of emerging African football is Zambia.\nBanda scored the winner in the NWSL final last year as Orlando Pride won their first title and was named in the team of the season. Oshoala’s Bay City team-mate Kundananji lines up along Banda up front for Zambia, but this isn’t a two-player team.\nAdvertisement\nLed by Pride forward Grace Chanda, the Copper Queens came third at the last WAFCON without Banda or Kundananji. They defeated the 11-time champions Nigeria in the third-place match, and this time they’re ready for more.\nMorocco and Zambia are joined in Group A by Senegal and the Democratic Republic of the Congo, making their return to the continental stage after 13 years away. Nine-time champions Nigeria lead Group B and will be joined by North African sides Tunisia and Algeria, as well as Botswana, who made the quarter-finals in their first appearance in the competition three years ago.\nMeanwhile, champions South Africa are joined in Group C by Mali and Tanzania.\nWe’ve been made to wait a long time for it, but this WAFCON promises to be the most exciting one yet.\n(Top photo: Fadel Senna / Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6532662/2025/08/02/copa-america-femenina-brazil-colombia-penalty-shootout-results/",
      "text": "Brazil’s ninth Copa América Femenina title couldn’t possibly have been scripted better.\nEven if the 2025 championship faceoff with Colombia, which ended 4-4 in regulation and 5-4 in penalties, had been dreamed up in a writers’ room, the draft would have been sent back to the drawing board for its indulgent lack of believability.\nAdvertisement\nIt was, by significant distance, the most thrilling of the three continental tournament finals that took place in the last two months: eight total goals, which included a headbutt and subsequent penalty kick, an own goal and a last-gasp Marta banger sent the game into extra time.\nThe 39-year-old legend scored a second goal in the first of the two 15-minute periods to bring Brazil closer to victory at 4-3, but that, too, was answered with a sublime free kick by Colombian midfielder Leicy Santos to level it again.\nEvery penalty kick from the 2025 Copa America Femenina Final 🇨🇴🇧🇷🎥 pic.twitter.com/qqElkI7sFY\n— FOX Soccer (@FOXSoccer) August 3, 2025\nThe penalties offered an entirely new framework for drama as each side’s keeper saved the spot kicks of two of the goal scorers during the match, Santos and Marta. It took seven rounds of penalties to decide Brazil’s fate, with goalkeeper Lorena’s save closing the curtain on the most thrilling match in the tournament’s history.\nAfter a campaign that saw scant crowds in the stands across Ecuador, the cinematic final drew the biggest attendance of the tournament by far with 23,798 tickets sold, though a tournament spokesperson added the total attendance was likely closer to 24,000 with the distribution of complimentary tickets.\nSpectators leaned heavily in favor of Colombia, and their heartbreak, it must be said, was earned: Colombia led on three separate occasions throughout the crunching matchup, with stunning goals by star strikers Linda Caicedo and Mayra Ramírez, who put on two of the strongest performances of the game. Their efforts sandwiched a perplexing own goal by Brazilian defender Tarciane, setting the stage for Marta’s thrilling equalizer in the last second of stoppage time.\nCaicedo and Ramirez’s brilliance\nColombia’s relentless pressure in their attacking third paid off when 20-year-old Linda Caicedo opened the scoring in the 25th minute, setting the chaotic tone. Up until this moment, Brazil had managed to contain Caicedo and 26-year-old Mayra Ramirez, consistently beating them to the ball and keeping them from making any meaningful connections. The lethal pair managed to break through twice when Colombia needed it most.\nAdvertisement\nCaicedo, a dangerous threat due to her tactical prowess and critical awareness on the pitch, is capable of dribbling through a sea of defenders, but, for Colombia’s first goal, all she needed was patience and some Ramirez magic. Ramirez managed to find the loose ball in a crowded box, pulling Brazil’s defenders towards her. Her strength was on full display.\nNow dangerously alone, Caicedo waited. All Ramirez needed to do was tap the ball to Caicedo, who calmly placed the ball in Brazil’s net.\nThe pair connected again in the 88th minute; this time, it was Ramirez who was alone in front of the goal. A backheel from Ramirez to Caicedo ignited the play, with Caicedo then carrying the ball confidently back towards Brazil’s defensive end once again. Caicedo only needed a quick tap to Ramirez, who shot the ball across the net and past Lorena, Brazil’s goalkeeper. Chaos erupted as Colombia went up 3-2.\nThe Chelsea forward in this moment only looked for Caicedo, who she quickly embraced. This deadly pairing carried Colombia through this historic match and will carry this national team through its inevitable bright future. Though Colombia did not win the Copa América title it so bravely fought for, Las Cafeteras gave Brazil, long considered the best team in South American women’s football, a challenge that no one on the continent will soon forget.\nMarta's PK is saved 😱\n🇧🇷: ✅❌✅✅❌\n🇨🇴: ✅✅❌❌ pic.twitter.com/zNYwdilpTz— FOX Soccer (@FOXSoccer) August 2, 2025\nPhysicality rankled the flow of the game\nEven in the friendliest of circumstances, a meeting between Brazil and Colombia is guaranteed to be gritty and personal. As proud South American teams, each is known to bear their fangs when provoked, but against each other, those fangs were part of their starting XIs.\nIn this way, the opening minutes of the first half were standard procedure, full of hefty shoulder-to-shoulder “greetings” and sneaky moments of psychological warfare outside the center official Dione Rissios’ watch. But when Colombia assumed the front foot early on and scored in the 25th minute, Brazil found themselves in a deeply unfamiliar position: trailing for the first time not only in their 2025 Copa América Femenina campaign, but since 2014 in this tournament.\nAdvertisement\nFrom that moment, the mutual physicality in the game curdled into something more pointed with animosity. Between the 32nd and 40th minutes, two Colombian players (Lorena Bedoya Durango and Carolina Arias) and one Brazilian (Tarciane) earned yellow cards, prompting Brazilian manager Artur Elias to institute a rare, three-way, first-half substitution, ostensibly to calm the game down.\nDuring the third minute of first-half stoppage time, Colombian goalkeeper Tapia was also shown a yellow, all of which felt like foreshadowing for defender Jorelyn Carabalí, who headbutted Brazilian forward Gio Garbelini inside the penalty box. After a lengthy VAR check, Carabalí was shown a merciful and surprising yellow, and Brazil earned a penalty kick.\nAngelina went top bins with confident ease to draw the eight-time Copa champions level just before halftime.\nMarta magic\nIt did not matter that Marta entered this championship game in the 82nd minute. The 39-year-old striker was the ammo that Brazil kept in its back pocket, knowing she’d deliver when the team needed her the most — and that’s exactly what she did.\nThe tournament appeared to be over, with Colombia on its way to winning its first Copa América. Then Marta, somehow, in the 96th minute, in the final possible second of stoppage time, scored what will go down as one of the most iconic goals of her storied career.\nShe found a loose ball outside the goalie’s box and drilled it past Colombia’s goalkeeper in a stunning display of Marta magic. The forward was quickly dogpiled on by her teammates, as the stadium erupted. She later scored again in the 105th minute, somehow finding a touch on the ball after it missed her head.\nThis gave Brazil its first lead of the game.\nIt did not matter that Marta would go on to miss a penalty. She came back from retirement to be on this stage because she knows she still has so much left to give Brazil and the beautiful game.\nAdvertisement\nThere’s no denying how much this still means for Marta, who was in tears after the final whistle. Brazil just won its ninth Copa América title, and one of the first things she did was console Colombian players on this pitch. A moment of pure class by one of the greatest players of all time, and a moment no one on this pitch will likely forget.\n(Photo: Franklin Jacome / Getty Images)"
    },
    {
      "url": "https://www.aljazeera.com/sports/2025/8/5/nigeria-sportswomen-dominate-again-but-pay-remains-an-issue",
      "text": "Nigeria sportswomen dominate again but pay remains an issue\nNigeria’s women lifted the AfroBasket and Africa Cup of Nations titles this summer, but pay remains a dirty word.\nAs Nigerian women dominate sport on the continent, they’re facing off not just against top talent abroad but a domestic atmosphere of mismanagement and pay disparities – and even the risk of repression for speaking out.\nNigeria is fresh off a win at the finals of Women’s AfroBasket, their fifth-consecutive championship at the continent’s top hardwood basketball tournament, while last month the Super Falcons clinched their 10th Women’s Africa Cup of Nations (WAFCON) football title.\nRecommended Stories\nlist of 4 itemsFernandes labels Man Utd ‘lazy’ and calls for more signings\nEnhanced Games signs first female athlete for 2026 debut\nInfantino says ‘important step’ taken for Afghan women’s football\nThe football team’s successes, however, have come despite pay disparities compared with their male counterparts – when they are paid at all.\nThe women receive a training camp allowance, but the bulk of their pay comes from per-match bonuses, which vary depending on the team’s results.\nBoth the women’s basketball and football teams have been plagued by late or unpaid match bonuses for years, despite their records as arguably the best teams on the continent.\nBut when the Super Falcons landed in Abuja after their 3-2 WAFCON victory over hosts Morocco last month, none of the players answered questions shouted by an AFP reporter in the press scrum about whether they would ask the president, who was welcoming them at his villa, about being paid the same as the men’s team.\nNigerian journalists on the scene said the question was useless: it was far too politically charged.\n“If you speak up against what’s going on, you completely lose the possibility of getting what you’re entitled to, you could actually be blacklisted,” Solace Chukwu, senior editor at Afrik-Foot Nigeria, later told the AFP.\nNot that there are no clashes: In 2021, basketballers called out the authorities when they topped Africa, protesting against unpaid match bonuses.\nThe Nigeria Basketball Federation at the time denied any wrongdoing, blaming the issue on clerical errors.\nLike the basketball team, the women’s football team has found remarkable success, stemming in part from the country’s population of more than 200 million, the largest on the continent, complemented by a widespread diaspora.\nThey also benefitted from early investments in women’s football at a time when other African countries focused on men’s teams, Chukwu said, helping the Super Falcons win the first seven editions of the WAFCON, from 1991 to 2006.\nYet they only played a handful of test matches before they landed in Morocco for this year’s competition, cobbled together at the last second.\nThe Super Falcons have not been completely silent in the face of mismanagement and disinterest from authorities.\nBut rocking the boat too much appears to come with a cost.\n“Players who lead or dare to protest… always risk not being invited or sidelined outrightly,” said Harrison Jalla, a players’ union official.\nAfter Super Falcons captain Desire Oparanozie – now a commentator – led protests over unpaid wages at the 2019 Women’s World Cup, she was stripped of her captaincy and not called up for the 2022 tournament.\nFormer men’s coach Sunday Oliseh – who himself was let go from the national squad amid protests over backpay in the early 2000s – called the situation a case of “criminal” retaliation.\nThe Nigerian Football Federation (NFF) at the time denied that it dropped Oparanozie over the protests.\nThe NFF and the Super Falcons did not respond to an AFP request for comment on the allegations that players are afraid to speak out.\nPlayers still have hopes for women’s sports to expand.\n“I think the sky is the limit,” Nigerian point guard Promise Amukamara told AFP in Abuja, fresh off her AfroBasket win.\n“Obviously, more facilities should be built around Nigeria. I feel like, maybe one year, we should host the AfroBasket.”\nAisha Falode, an NFF official, meanwhile, called on the government to “invest in the facilities, invest in the leagues and the players, because the women’s game can no longer be taken lightly”.\nDespite the challenges, women’s sport is still finding a foothold among younger fans.\nJustina Oche, 16, a player at a football academy in Abuja, told the AFP that the exploits of the team inspired her to pursue a career in the sport.\n“They say what a man can do, a woman can do even better,” said the youngster, whose role model is six-time African Footballer of the Year Asisat Oshoala.\n“The Super Falcons have again proved this.”"
    },
    {
      "url": "https://www.nytimes.com/athletic/6504124/2025/07/19/ann-katrin-berger-germany-euros-save/",
      "text": "Ann-Katrin Berger is backpedaling and already going down. Gravity is working against the 34-year-old German goalkeeper. So are basic physics, the general understanding of human limitations, logic.\nBut there is her left arm, extended into another dimension, clawing out a rogue header from German defender Janina Minge millimetres from her goal line in the 105th minute of Germany’s Euro 2025 quarter-final victory over France like some exquisitely German-engineered time machine.\nAdvertisement\nHalf an hour later, the former Chelsea shot-stopper is dropping to her knees, those same dimension-entering arms outstretched, Christ the Redeemer-style, embracing her stampeding teammates after saving two penalties and converting another.\nGermany — down a player from the 13th minute of this maelstrom of a quarter-final, after Kathrin Henrich’s inane red card for pulling Griedge Mbock’s hair in the penalty area — are through to the semi-finals after beating France 6-5 on penalties.\nThat is largely because of Berger.\nThe Gotham FC goalkeeper doesn’t so much live for these moments as the moments live for her. In March 2023, Berger denied U.S. women’s national team midfielder Lindsey Heaps in Chelsea’s Champions League quarter-final penalty shootout against Lyon to advance to the semi-finals.\nIn last summer’s Olympic Games, Berger saved two shots from Ashley Lawrence and Adriana Leon in the quarter-final penalty shootout against Canada, before scoring the decisive penalty. She later deflected Alexia Putellas’ ninth-minute penalty in Germany’s bronze medal match against Spain, defeating the world champions 1-0.\nOn Saturday night, Berger was the perfect analog for a dogged, resilient German performance. She was confident in the air, composed on the ball, quick off her line, racing out to smother any French threat within 25 feet of her area. She plastered her Gatorade bottles with opposition players’ preferred penalty angles, wrapped around the plastic exterior like some sort of secret marine expedition. She duly denied France’s Amel Majri and Alice Sombath.\nBerger was defiant in the face of everything: of a red card to one of her team-mates and of the 18 shots France thrashed at her goal. France registered nine shots on target before the penalty shootout. Berger made nine saves. Five were in the box. Another five were what the BBC qualifies as “diving saves”, an absurdly under-qualified description for the goalkeeping Berger produced in the 105th minute.\nAdvertisement\n“For me, the most impressive element of it was the fact that she had to reorganise her body,” Karen Bardsley, former England and Manchester City No 1, tells The Athletic.\n“She had to readjust her balance to go from right to left really quickly to generate the power to push off her left foot and dive in a really powerful way.\n“To produce that sort of power is impressive in that quick instant,” Bardsley continued. “She was really low, generated a lot of it from probably her glutes and her quads, but the full extension was massive. Then to claw it out of the way at full extension while you’re falling onto your shoulder? That is all out AKB, isn’t it?”\nBerger is not always the subject of praise when it comes to her gonzo-style goalkeeping. Her tendency to rush out of her area, to foray to the halfway line and dribble against onrushing strikers has earned her skeptics, including Germany coach Christian Wuck, who, after the opening Euro 2025 match against Poland (which Germany won 2-0), spoke about his goalkeeper’s risk-taking in juxtaposition to her match-winning reflexes. Some German reporters and pundits asked whether such a style might be more sabotage than bravery.\nWhen asked about these doubts in a pre-match press conference this week, Berger did not mince her words. “Why should criticism from people who have never even stood in a goal affect me?”\nFor all her obvious abilities between the sticks, there is also the conviction to step up and take a penalty herself. (England goalkeeper Hannah Hampton said after the Lionesses’ dramatic penalty shoot-out victory against Sweden that she could not fathom doing so due to the mental expenditure required just to make saves.)\nSuch an unflappable creed is not synthesised with time or practice.\n“I’m not really an emotional person,” Berger said in her post-match press conference Saturday, having been named UEFA’s Player of the Match. “I wasn’t happy that we had to go to a penalty shootout because I would’ve liked to have it done in 90 minutes. But I did my part in the game because the team in the 120 minutes worked incredibly hard. All the credit should go to the team and not me. Maybe it’s the decisive moment, but everyone here should talk about the performance of the team because that was amazing.”\nAdvertisement\nThe exchange is quintessential Berger. In the minutes before kick-off, Berger walked calmly to her goal in front of the German fans. She raised her arms, gearing them up, her face as expressionless as granite. As she walked to take her place in front of the France fans for the shoot-out, she wore the same expression.\nBut that Berger has this moment is special for myriad reasons. Perhaps none more than because during the previous Euros in England, Berger (then Germany’s No 2) discovered that her thyroid cancer, first diagnosed in 2017 when she was playing for Birmingham City, had returned. She underwent therapy again. From there, Berger began curating her legend: Berger as a goalkeeping transcendence beyond 2022. A year later, there was Lyon. A year after that, Canada. Three months later, she was voted the National Women’s Soccer League’s Goalkeeper of the Year with Gotham FC.\nAnd now, there is Basel, 2025.\n“For me, I look forward,” she said. “I live my best life, and I’m in a semi-final.”\n(Top photo: Jose Breton / NurPhoto via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6517600/2025/07/27/morocco-wafcon-finals-nigeria-host/",
      "text": "The 2025 Women’s Africa Cup of Nations (WAFCON) final between Nigeria and Morocco in Rabat on Saturday was a clash between a nine-time winner, whose federation has been more of an opponent than a supporter, and a two-time finalist, who has essentially found a 12th player in its federation.\nNigeria Super Falcons claimed their tenth title, known as Mission X, in thrilling style, fingernailing their way back from a 2-0 deficit in the second half with goals from Esther Okoronkwo, Florence Ijamilusi and Jennifer Echegini. It also meant that Morocco’s Atlas Lionesses suffered back-to-back WAFCON losses as hosts, a first in the history of the continental tournament.\nAdvertisement\nMorocco is coached by former Spanish manager Jorge Vilda, who was fired from the Spain job after their 2023 World Cup win amid the investigation into former Spanish federation president Luis Rubiales and the non-consensual kiss he gave to forward Jennifer Hermoso during the award ceremony. Despite that history, Vilda’s hiring was seen as part of Morocco’s significant investment at the club and national team levels. The nation is also hosting the men’s African Cup of Nations in December and January, a third consecutive WAFCON in 2026 and the 2030 men’s World Cup alongside Spain and Portugal.\nNo African federation is investing in its women’s team more than Morocco, and it could be proof of why Morocco should continue to host these tournaments. However, there is also an argument to be made for hosting duties to go to the countries that need a boost in exposure, similar to how Tatjana Haenni, a former Switzerland national team player, led the Swiss bid to host the 2025 women’s Euros.\nBut as Morocco nurses its wounds from a second straight WAFCON home loss in a final while also preparing to host its third in a row next year, there will, and should, be questions about which philosophy sits at the head of the table for women’s football in Africa.\nThe Confederation of African Football (CAF), for its part, has made investment strides of its own this WAFCON, doubling the prize money for the winning team to $1 million and increasing the remaining pot prize by 45 percent; Morocco will receive $500,000 as finalists, Ghana $350,000 for coming in third place.\n🤩🤩🤩 Congratulations to @NGSuper_Falcons. The Champions of TotalEnergies CAF Women’s Africa Cup of Nations Morocco 2024. 🙌\nThey staged an extraordinary second-half comeback to defeat hosts Morocco 3-2 to lift their 10th WAFCON title at the Stade Olympique in Rabat on Saturday… pic.twitter.com/P7aeRWiXbB\n— CAF Media (@CAF_Media) July 26, 2025\n“We are very proud of the investments we’ve made over the last few years,” CAF president Patrice Motsepe said ahead of the final. “They are being entrenched and the future of African women’s football is enormously bright, and we will continue to make more financial resources available for the competitions.”\nAdvertisement\nMotsepe added his wish that “a significant amount of that money go into the pockets of the women players and the technical team, and also to make sure that in every country in Africa, the partnerships with government, the partnerships with the private sector are very important because our focus is to make women’s football world class.”\nMorocco has done their part to back teams financially. In 2019, Moroccan King Mohammed VI established an eponymous football facility in Rabat, the new $65 million home to the entire national team, juniors and seniors, women and men. The following year, the Royal Moroccan Football Federation professionalized the preexisting National Women’s League, now D1 Féminin, beginning with the 2021 season. At the time, Morocco had only competed in two WAFCON tournaments in 1998 and 2000; between the two campaigns, it won one game and lost five, scoring five goals and conceding 22. In this way, Morocco has undeniably improved despite the consecutive final losses.\nHalf of the players named to Morocco’s 24-player roster compete domestically. Moroccan striker and WAFCON Golden Boot winner Ghizlane Chebbak has won 10 titles with Moroccan club giant ASFAR, as well as a 2022 Confederation of African Football (CAF) Champions League.\nBut the Moroccan federation’s investments and ambitions have not been exclusively focused on the women’s side; it’s been bullish on the men’s, too. And why wouldn’t it be after the men’s national team made history as the first African team to reach a World Cup semifinal?\nSandwiched between the 2024 and 2026 WAFCONs will be the men’s version of the tournament held between December and January, and the preparations for that affected this WAFCON. Due to the renovations of larger stadiums in Rabat and Casablanca, used during the 2022 WAFCON, this year’s matches were held at smaller venues in those cities, in addition to Mohammedia (situated between Rabat and Casablanca along the coast), and Berkane and Oujda in the far east of the country near the border with Algeria.\nAttendance at those remote games was visibly poor, although the federation did provide discounted transportation and free tickets to Moroccan nationals for some of the host’s matches. All of the Atlas Lionesses’ matches took place in Rabat and were bursting with home crowd energy.\nMorocco’s opponent, Nigeria, is, by other metrics, in a prime position to embody Africa’s best as a football nation and therefore be primed to host. However, despite their ten wins, they continue to battle their federation for pay, a long-term coach and productive international windows. The federation did not schedule any friendlies for the Super Falcons between November and June, a month before WAFCON kicked off.\nAdvertisement\nWhere Nigeria and other West, East and Southern African federations serving as WAFCON hosts could edge Morocco is in attendance. Each of those regions belongs to a bloc — the Economic Community of West African States (ECOWAS), Southern African Development Community (SADC) and the East African Community (EAC) — that encourages nationals to travel to other member states with either relaxed or visa-free entry. For reference, the tourist visa fee for a Nigerian citizen to travel to Morocco is $159.\nEither way, Morocco will host again next year. And the schedule realignment after the COVID-19 delay means that the next tournament will only be a year away, narrowing the window between this historic occasion and the next to allow for momentum to build.\nWith the men’s AFCON over by then, the larger stadiums WAFCON enjoyed in 2022 will once again be available. But the pressure on the three-time hosts and two-time finalists will be greater than ever to take home a continental title. Otherwise, Morocco risks establishing itself as a team unable to return on its investment when it matters most.\n(Top photo: Abdel Majid Bzioat/AFP via Getty Images)"
    }
  ],
  "argos_summary": "The 2025 Women’s Africa Cup of Nations (WAFCON) showcased thrilling matches, with Nigeria claiming their tenth title after a dramatic comeback against Morocco in the final. Despite their success, Nigerian players continue to face issues with unpaid wages and inadequate support from their federation. Meanwhile, Morocco's significant investments in women's football have not yet translated into championship success, as they suffered back-to-back losses in WAFCON finals. The disparities in resources and media coverage between tournaments highlight ongoing challenges for women's football in Africa.",
  "argos_id": "S2UF238VU"
}