{
  "url": "https://www.nytimes.com/athletic/6525864/2025/08/08/jair-cunha-nottingham-forest/",
  "authorsByline": "Jack Lang",
  "articleId": "04809ab593fc4c66a8913e60e402c075",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/02105148/GettyImages-2227173078-e1754147792635.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T04:03:45+00:00",
  "addDate": "2025-08-08T04:10:33.229086+00:00",
  "refreshDate": "2025-08-08T04:10:33.229089+00:00",
  "score": 1.0,
  "title": "Jair Cunha: Nottingham Forest’s new giant has more to offer than sheer size",
  "description": "With only has 46 senior games to his name, the 6ft 6in Cunha is far from the finished product - but the 20-year-old's potential is... huge",
  "content": "Brazilians have a word for players such as Jair Cunha, Nottingham Forest’s latest defensive recruit.\n\nHe is a classic example of a Xerifao — ‘big sheriff’ — the kind of centre-back whose very physique screams authority and ruggedness.\n\nCunha is just shy of two metres tall (6ft 6in). He also only turned 20 in March — he is already a big slab of rock but is probably still filling out. One glance at him and you immediately worry for any forward hoping to match him for strength. Anyone hoping to beat him in the air should probably source some crampons, because they’re going to need to climb him first.\n\nThere is more to Cunha’s game than the brute dimensions of his skeleton, however. He is confident on the ball, smart with his positioning and loves to compete. There is no getting around it, though, like there is no getting around him: it is that frame that has propelled him from relative obscurity in Brazil to the Premier League in the space of a year.\n\nIf you were feeling corny, you’d call it a tall tale.\n\nFor Cunha, it began in Orlandia, a little rural town in the state of Sao Paulo and on the outskirts of nowhere. His early passion was athletics: Cunha, taller than average from day dot, dominated the 50-metre dash and long jump in local competitions.\n\nWhen he played football, it was as a forward. His father, a striker at amateur level, had designs on not-so-little Jair following in his footsteps. Even his name was part of the plan: Cunha was named after Jairzinho, the attacking hurricane of Brazil’s 1970 World Cup win.\n\nCunha played for his local team until the age of 11, when he came onto the radar of Juary, a former Santos player now known as a crack talent-spotter. “He was already tall and strong,” Juary told Brazilian sports news outlet GloboEsporte last year. “He read the game and anticipated well. He had a good pass on him and was good in the air. I thought he would make a great centre-back.”\n\nJuary signed him up. Cunha moved to Santos, based in the city of that name, an hour’s drive south of Sao Paulo, living with family friends until his mother could join him. It was a big change for a kid not yet in his teens, but he settled well and progressed serenely through the ranks at Santos, eventually signing his first professional contract in June 2021, aged 16. The inclusion of a €70million (£61m;$82m) buyout clause laid bare the esteem in which the club held him.\n\nAt the start of 2022, Cunha did well in the Copinha, Brazilian football’s big under-20s competition (and scouting bonanza), despite being four years younger than some of his opponents. By the end of that season, he was training with the Santos first team and earning rave reviews — along with comparisons with a former captain of Brazil.\n\n“He’s 17 and has a lot of quality,” Santos’ then-head coach Lisca said in August 2022. “He reminds me of Lucio when he came through: a bit rough around the edges, but strong and committed. Jair has enormous potential. He’s tall and fast. I’m desperate to throw him into the team, but there’s a right time for everything.”\n\nCunha’s favourite player during his adolescence was Real Madrid and Spain centre-back Sergio Ramos. The youngster is relatively two-footed and tidy on the ball, but we’re not really talking about a guy who is going to ping 30-yard passes around. Lucio — leggy, brave, sturdy in the challenge — is probably more appropriate as a reference point.\n\nIn January 2023, Cunha suffered a major setback. Back with the under-20s for another Copinha, he collapsed to the ground during a game and left the pitch screaming. Scans revealed a ruptured anterior cruciate ligament and damaged meniscus in his right knee.\n\nHe didn’t play again for 10 months. He did, though, keep growing: when he returned, he was 2cm taller than he was before the injury.\n\nCunha made his senior debut at the end of 2023. Then, when Santos lost regular centre-back Joaquim to injury in July last year, he broke into the starting XI and stayed there, putting in a string of assured performances as the seasiders won the Brazilian second division title in November. By the end of the season, Santos were fielding — and turning down — offers for him from Porto of Portugal and Italy’s Atalanta.\n\nWhen he did leave Santos in February, it wasn’t for Europe but for fellow Brazilians Botafogo. It struck some as a sideways move. A risky one, too, given that the Rio de Janeiro side had a high-class centre-back pairing in Alexander Barboza and Bastos. An injury to the latter, though, gifted Cunha his chance and he surfed a wave of momentum into the Club World Cup.\n\nIt was in the U.S. this summer that the secret really got out. Cunha was magnificent in a shock 1-0 win against UEFA Champions League winners Paris Saint-Germain, holding Goncalo Ramos at arm’s length throughout and coolly playing through the French press. He also scored his first senior goal in the group-stage victory against Seattle Sounders, powering home a brilliant header.\n\nIn other circumstances, those displays would have had scouting departments across Europe scrambling for their phones. Forest, though, had already set up the deal that brought both Cunha and team-mate Igor Jesus, a striker, to Nottingham. The Club World Cup just served to make that double swoop look like less of a gamble than it otherwise might have.\n\nCunha is still young. He only has 46 senior appearances to his name. He is far from the finished product.\n\nThe potential, however, is clear.\n\nLiving up to it will be a tall order, but tall shouldn’t be too much of a problem for the City Ground’s new giant.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6454650/2025/06/27/igor-jesus-botafogo-club-world-cup/",
    "https://www.nytimes.com/athletic/1556463/2020/01/24/bizarre-brazilian-names/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Jair Cunha",
      "weight": 0.07958335
    },
    {
      "name": "Cunha",
      "weight": 0.07610174
    },
    {
      "name": "Santos",
      "weight": 0.05967767
    },
    {
      "name": "July last year",
      "weight": 0.04791833
    },
    {
      "name": "big sheriff",
      "weight": 0.047574464
    },
    {
      "name": "Brazilian sports news outlet GloboEsporte",
      "weight": 0.04704974
    },
    {
      "name": "last year",
      "weight": 0.046973027
    },
    {
      "name": "Sao Paulo",
      "weight": 0.045177393
    },
    {
      "name": "Cunha’s favourite player",
      "weight": 0.04472388
    },
    {
      "name": "World Cup",
      "weight": 0.04375661
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9921875
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.98095703125
    }
  ],
  "sentiment": {
    "positive": 0.27807617,
    "negative": 0.23120117,
    "neutral": 0.49047852
  },
  "summary": "Brazilian footballer Jair Cunha has been signed by Nottingham Forest as a defensive player. Despite being just shy of two metres tall (6ft 6in), he is confident on the ball, smart with his positioning and loves to compete. His physical frame has propelled him from relative obscurity in Brazil to the Premier League within a year. CUnha was named after Jairzinho, the attacking hurricane of Brazil's 1970 World Cup win. He started playing football at Santos aged 11 and progressed through the ranks before signing his first professional contract in June 2021, with a €70m buyout clause. Despite a setback in January 2023, he made his senior debut at the age of 2023.",
  "shortSummary": "Jair Cunha, a towering Brazilian defender, has evolved from obscurity to potential Premier League star, showcasing his physicality, naturalism, and sheer talent.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "806551dcbbcc4490a16acc4fe16d2886",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6454650/2025/06/27/igor-jesus-botafogo-club-world-cup/",
      "text": "Igor Jesus, one of the breakout stars of the Club World Cup, celebrates his goals by imitating a character from a Japanese cartoon. Team-mates at youth level called him Sapinho — Little Frog — because he used to leap around when playing in goal. As a kid, he spent his weekends at a market stall in his hometown, helping his grandfather clean fish.\nAdvertisement\nThese are all fun facts. Together, they tell you a bit about the Botafogo striker and where he comes from. But the most interesting thing about Igor Jesus is something else entirely. It is this: just over a year ago, barely anyone had even heard of him.\nIn 2023 and the first months of 2024, his name cropped up in a lot of excitable articles in the Rio de Janeiro press. His name, but not him: the buzz was about Flamengo midfielder Igor Jesus, a former Brazil Under-23 midfielder who now plays for Los Angeles FC. His namesake — our Igor Jesus — was about as relevant to the local football scene as you or I.\nHe was playing for Shabab Al Ahli in the United Arab Emirates. He had been there since October 2020. Even fans of Coritiba, the Brazilian club at which Igor Jesus first made his breakthrough, had all but forgotten he existed.\nIt is not unusual for Brazilian footballers to move to the Middle East. The money can be incredibly good: a few years there might provide financial security for years, sometimes even generations. Countless players have gone to the UAE, to Qatar, to Saudi Arabia. Coaches, too. Many of them return for second, third, fourth stints.\nThat option normally comes at a cost, however. When you move to Dubai at 19, as Igor Jesus did, people will — rightly or wrongly — infer certain things about your ability, your priorities, how you see your career. Stay until you are 23 and those thoughts are amplified. These are the runway years of any career. It is incredibly rare for a player to spend them out of the spotlight and still have enough momentum for lift-off.\nIgor Jesus has laughed in the face of that convention.\nHe arrived at Botafogo in July 2024, ostensibly as a backup to first-choice striker Tiquinho Soares. That didn’t stop him from stating his intention to break into the Brazil team. Three months and 19 Botafogo appearances later, he did just that, scoring on debut against Chile. By January, he was turning down offers from Europe.\nNow he is starring on the global stage, with a move to Premier League side Nottingham Forest already agreed. Not a bad year’s work for a nobody.\nIgor Jesus owes a lot to Alessandro Brito, Botafogo’s sporting director, the man behind the transfer that brought the forward back to Brazil.\nAs a scout for Athletico Paranaense, Brito had watched Igor Jesus a lot at youth level and rated him highly. When he arrived at Botafogo in 2022, he knew who to place at the top of his wish list.\nAdvertisement\nAt that point, Igor Jesus was rebuilding fitness and confidence after a long-term injury. His form as the 2023-24 season progressed — he would end it with 17 goals in all competitions — strengthened the case for signing him. Botafogo tried to get him in January 2024 but settled for a pre-contract agreement ahead of a free transfer in the summer. An offer of €10million (£8.5m; $11.7m) from another Emirati club came in before Igor Jesus had even travelled for his medical in Rio.\nBotafogo turned it down. It proved to be a smart decision. Igor Jesus adapted quickly, clambering past Soares in the pecking order and registering six goals and an assist in his first seven starts. There was also a tonal shift beyond the numbers. His movement pushed opposition defences back. He drifted wide, inviting Thiago Almada and Luiz Henrique infield. Those three, plus Venezuelan playmaker Jefferson Savarino, looked like they had been playing together since they were kids.\nHis coach, Artur Jorge, could not hide his delight. “He’s the best forward in the country, there’s no doubt about it,” he said in October.\nDorival Junior, Brazil’s coach at the time, agreed. He threw Igor Jesus straight into his starting XI and reaped the benefits, the striker capping a fine display against Chile with a goal. “Igor gave us that presence in the area,” Dorival said. “He can act as a pivot in certain moments, but still looks to get in behind.”\nBy the end of the season, he had helped Botafogo to the Brazilian championship and the Copa Libertadores. That could easily have been that. Forest bid around €30m in January, enough for Botafogo. The player, though, wanted to stay, at least until after the Club World Cup.\nThe start of 2025 was turbulent. Botafogo parted company with Artur Jorge and went off the boil. Igor Jesus paid the price with his Brazil place. Only with the arrival of Renato Paiva — another Portuguese coach — did things begin to pick up again.\nAdvertisement\nPaiva has used Igor Jesus in a slightly different way. He plays with three fairly defensive midfielders, tasking the wide players with creative duties. There is less position-swapping, less room for improvisation.\n“Under Artur, I had a lot of freedom to move around and create space for the wingers,” Igor Jesus told GloboEsporte in March. “We were always swapping positions and that made it hard for teams to mark us. Today, with Paiva, I play more as a No 9. He asks me to stay in the penalty area more, to be there to finish from rebounds and loose balls.”\nIf there was any ambivalence there, it has evaporated over the past fortnight. Paiva may have him playing a more conventional game, but he has done it to perfection, holding the ball up brilliantly, bringing team-mates into play, occupying defenders with his strength, darting in behind. His two goals so far — that brilliant breakaway strike against PSG, a towering header against Seattle Sounders — were the least he has deserved.\nThe farewell tour kicked off at the start of June when Igor Jesus played his final match at Botafogo’s Estadio Nilton Santos. It was an emotional night: fans unveiled a huge banner in his honour and clapped him off the pitch at the end of a 3-2 win over Ceara. “This has been a marvellous journey,” the 24-year-old said. “Botafogo made me believe in my potential again.”\nHe returned to that theme before the start of the Club World Cup, reflecting on the decisions that have led him to this point. His atypical path to the big time is not just a quirk of his story, a curious little footnote. It is the story. The way he sees it, it was the making of him.\n“If I had left Brazil at 19 or 20, I think I would be nervous about playing in a competition like the Premier League,” he told GloboEsporte. “Today, I feel prepared. I’m leaving here a more experienced footballer. I’ve matured a lot. I’m sure that will help me in Europe.”\nBefore that, of course, there is one big job left to do. On Saturday, Botafogo face Palmeiras. Win that and the Club World Cup bracket may start to open up. The team that stunned everyone to win the Libertadores may yet have another surprise or two up its sleeve.\n“I didn’t leave at the start of the year because I wanted to play in this tournament,” Igor Jesus said at the start of the month. “I’ll do my best to help this club and my team-mates. I feel that obligation.”\n(Photo: YURI CORTEZ/AFP via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/1556463/2020/01/24/bizarre-brazilian-names/",
      "text": "The Copa Sao Paulo de Futebol Junior, Brazil’s annual under-20 tournament, is a big deal for two main reasons.\nFirst and foremost, it is a proving ground for emerging talent. The Copinha (as it is known colloquially) has long been viewed as an important stepping stone for the best young players, not least because it is attended by scouts from around the world. Robinho, Neymar, Lucas Moura and Oscar all shone at the competition before breaking out at senior level; Vinicius Junior and Gabriel Martinelli have starred in more recent editions before landing big-money moves to Europe.\nAdvertisement\nThe Copinha also serves as a showcase for a different strand of the country’s sporting culture: it is the unofficial home of the ridiculous footballer’s name.\nEvery year, we are treated to a fresh batch of zingers — a Bacteria here, a Jhonkaermeson there — that bravely go to war with good taste and linguistic convention. It is a weird and wonderful tradition. It is also, in its way, a rite of passage: you cannot claim to truly appreciate the Brazilian game until you have celebrated a goal by a teenage kid called Avatar or Oliver Gulliver.\nThis being a deeply serious column on global football, it seems clear which of these we must focus on as the 2020 edition reaches its climax. Let’s check out some of those names.\nWe start with references to other footballers. This year, the player register includes a Lukaku, a Maradona and an Etoo, although those are all just overambitious nicknames. More fun are the great icons of the past baked into Brazilian family names. Klinsmann Oliveira da Silva is a good one. Even better is Fortaleza forward Clayvert Simeone Gomes Silva, who gets extra credit for having two former players in there, as well as bonus sympathy points because of the alternative spelling of “Kluivert”.\nThe real sensation of the 2020 Copinha was the sheer number of players named after one man. Vasco da Gama had a Riquelme. Atletico Goianiense had a Riquelme. Fortaleza had a Riquelme. RB Brazil had Adrian Riquelme da Cruz de Rezende. Nova Iguacu had Riquelme Gomes Ramalho. A football team literally called Train had a player called Aimar Riquelme.\nThere was also a Riquelmo, a Rikelmi, a Rickelme and two Riquelmys. Is that enough to a construct a full Riquelme variation XI? I would count, friend, but my brain raised the white flag a couple of sentences ago. We’re running on fumes now.\nAdvertisement\nNext up: historical figures. Brazilians love naming children after former American presidents (Washington, Lincoln, Nixon, Jefferson, Martin Van Buren; one of those is a joke) and Fluminense’s John Kennedy Batista de Souza takes the baton as we head into the new decade. Science and music were also represented by Einstein Dias Santos and John Lenno Araujo dos Santos respectively. He can borrow another N from someone later in his life. Don’t worry about it.\nWe haven’t reached peak inexplicability yet. Welcome, belatedly, to Nickname City. Meet your tour guides, Alexandre Pirouette, Misael Truck-Driver and Vinicius Yakult. They will be ably assisted by Road Runner, Fury, Chocolate, Naruto, Favourite, One Leg, Incredible and Little Mute. Oh, and some guy who goes by — yes — LP Aromatic. At least L and P are actually his initials. There is another player here who wants to be known simply as L. His name is Wesley Ramos de Moura.\nPerhaps he could learn something from our two overall winners. Both are acronym fans but they have had the sense to point their enthusiasm at existing things in the world. A big round of applause, then, for Huendensen de Souza Madeira and Pedro Henrique da Silva Rodrigues.\nOr, to use their chosen monikers, HD and GTA.\n(Photo: Buda Mendes/Getty Images)"
    }
  ],
  "argos_summary": "Jair Cunha, a towering 6ft 6in centre-back, has made a rapid ascent from obscurity in Brazil to joining Nottingham Forest in the Premier League. Initially a forward, he transitioned to defense under the guidance of a talent scout and rose through the ranks at Santos, showcasing his potential despite a significant knee injury. Meanwhile, Igor Jesus, another Brazilian talent, has emerged from a lesser-known background to become a key player for Botafogo and is set to join Forest as well, highlighting the dynamic nature of Brazilian football talent.",
  "argos_id": "SR7QP2XPV"
}