{
  "url": "https://www.fool.com/investing/2025/08/08/consumer-stocks-spotlight-etsy-roblox-and-reddit/",
  "authorsByline": "Alicia Alfiere, CFA, Thomas King, Tim Beyers, Motley Fool Staff",
  "articleId": "6276f11356834f72ae30ac63ac452d9f",
  "source": {
    "domain": "fool.com",
    "location": {
      "country": "us",
      "state": "VA",
      "city": "Alexandria",
      "coordinates": {
        "lat": 38.8051095,
        "lon": -77.0470229
      }
    }
  },
  "imageUrl": "https://g.foolcdn.com/editorial/images/828193/consumer-stocks-spotlight-etsy-roblox-and-reddit.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T20:48:00+00:00",
  "addDate": "2025-08-08T20:52:00.385836+00:00",
  "refreshDate": "2025-08-08T20:52:00.385838+00:00",
  "score": 1.0,
  "title": "Consumer Stocks Spotlight: Etsy, Roblox, and Reddit",
  "description": "Does a mixed bag of economic data forecast a good future for businesses that depend on consumer spending?",
  "content": "Does a mixed bag of economic data forecast a good future for businesses that depend on consumer spending?\n\nIn this podcast, Motley Fool analysts Tim Beyers, Alicia Alfiere, and Tom King discuss:\n• Quarterly results from Etsy and Roblox.\n• Whether Reddit is shaping up to be a Rule Breaker.\n• A bit of business history as the big grocers prepare to report earnings.\n\nTo catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. When you're ready to invest, check out this top 10 list of stocks to buy.\n\nThis podcast was recorded on August 04, 2025.\n\nTim Beyers: What do e-commerce earnings say about the economy? You're listening, Motley Fool Money. Good morning, fools. I'm your host, Tim Beyers, with me, two of my Rule breakers teammates, Alicia Alfiere and Tom King. Alicia, Tom, how are you feeling? Are you suitably caffeinated?\n\nTom King: Very good. Thank you. Good to be here.\n\nTim Beyers: Mostly caffeinated. Well, you have a young baby, so you need more caffeine than most. We're going to hit e-commerce earning spotlight today. Last week Fed Chairman Jerome Powell decided to hold back on lowering interest rates, citing mildly concerning inflation data and yet US economic activity appears to be good with GDP up a reported 3%. Shouldn't that be a boon for companies driven by consumer spending? We're going to tackle two, and to me, it looks like a mixed bag. I'm going to start us off with Etsy. Tom, I'm going to come to you in a second here. But I show Etsy reporting a 4% increase in revenue year over year. EPS, though, earnings per share, fell 39%, and gross merchandise sales dropped 5%. That doesn't sound that great. Seems to be that Etsy's ability to raise prices on sellers via higher take rates is really the only thing that's fueling growth here. Am I reading that wrong? Is that true and if I am reading it right, is that sustainable? Where are you on Etsy?\n\nTom King: Yeah, so there were two drivers of Etsy's revenue in the second quarter of 2025. That was pretty much a flat revenue from the commission it takes on each sale on the platform, but about 15% increase in advertising revenue and gross merchandise sales, the value of things sold on the platform was a roundabout flat. Basically what the data is saying to me is, Sellers on Etsy spent a lot more money on advertising, which drove revenue for Etsy, but it didn't drive an increase in sales on the platform.\n\nTim Beyers: That feels like sellers have to benefit here. This has to be a mutually beneficial network. Then is it fair to say if I've heard you correctly at the moment, it's not as mutually beneficial as it should be in an ideal situation.\n\nTom King: No, that's a very accurate statement. GMS is flat. It's pretty much been declined pretty I had a boom it boomed in 2020 and 2021, as did many businesses, and it's been pretty much flat declining in flat since about 20:22 onwards. Over that time frame, Etsy has been steadily increasing its commission rate, its take rate, what it charges for each sale. At the same time that sales have been going down for sellers. It is not a sustainable situation, and I'm not sure how it ends, but right now it can't carry on the way it's going.\n\nTim Beyers: Well, watch this with caution Fools because it's it's not a doom loop, but it may be cresting into a roller coaster ride that we don't like all that much. But let's talk about one that is not, maybe a little bit more interesting. Maybe a more fun roller coaster ride. Alicia, I don't know. But Roblox's earnings, once again, seeing that the business design means that realized revenue and profits doesn't reflect the actual strength of the platform. That's certainly what it looks like and there were some strong numbers underlying the initial what looked like weakness on the top line, just quickly on this. Revenue growth and adjusted earnings per share came up short of expectations, but these numbers were really jarring to me, Alicia. Bookings jumped by more than 50%, so this is business that's done in Roblox, monthly paying users up 42%. Hours of engagement improved 58%. Is Roblox's popularity peaking, streaking? Where is it here?\n\nAlicia Alfiere: Well, I think Roblox's popularity is continuing to grow. As you said, revenues and profits don't tell the whole story. We need things like engagement metrics. The numbers you touched on number of users, hours spent on the platform and bookings data. That really speaks to the value of the network and the health of the platform. The latest quarter showed Roblox growing its relevance across the world. Bookings, hours spent, daily average users, all of these metrics were up across all world regions. But we do have to be careful here. There were five very popular viral experiences that Roblox has that has over 10 million daily active users and four of those are pretty new.\n\nAlicia Alfiere: They've launched just within the last 12 months. But Roblox is more than those games. Excluding those top experiences, hours of engagement still grew 47% year over year, and over half of the growth in spending and Roblox experiences came from the games or experiences that weren't in that top ten. Again, that growth should continue, but we have to be careful not to expect the growth from those viral heads to continue since interest tends to wane over time with things that are viral.\n\nTim Beyers: Well, don't tell the acquirers that because one of those top games, what is it? A kid that made a Roblox game in, like, three months and then sold it for something like three million to, I don't remember if it was private equity or just a VC fair, whatever it was, but it was quite a deal here. It does look like the top of the top of the funnel is generating pretty massive interest.\n\nAlicia Alfiere: Yeah and I'm glad you brought that up. Viral games can really help to attract new users and also important new developers to the platform. If those users are sticky, if those developers create games that resonate, it'll help to continue to grow Roblox's relevance and its network value over time.\n\nTim Beyers: We would like to think so. Up next, Is Reddit a rule breaker in the making? We're going to debate it. You're listening to Motley Fool Money.\n\nMALE_1: Wish you could lock in rates without locking out liquidity? Meet LDDR, a LIFEX Treasury bond ladder ETF built to simplify your cash flow plan for the next 10 years. With LDDR, you can lock in today's interest rates for a decade. It's built to deliver predictable monthly cash flow that boosts interest income by including tax free return of principle. That means the potential for higher, more stable cash flow without worrying about rate cuts, reinvestment risk or market swings. LDDR, take the guesswork out of your cash flow plan. Learn more at lifexfunds.com. The LIFEX ETFs return principal over the life of an ETF and therefore expected to have little or no assets remaining to distribute at the time of liquidation. Individual bonds carry an obligation to fully return the principal to shareholders at maturity. However, ETFs have no such obligation. The net asset value of the ETFs will decline over time as income payments are made to shareholders. Tax discussion herein is general in nature. Investors should consult with their tax advisor about the effect that an investment in LIFEEX ETFs could have on their tax situation. Investors should consider the investment objectives, risks and charges and expenses of LGDR carefully before investing. The prospectus contains this and other information about the investment company and can be obtained by visiting www.lfxfunds.com or by calling 1-888-331-5558. The prospectus should be read carefully before investing. Investing in the LIFEX ETFs involve risk. Principal laws is possible. The LIFEX income ETFs are distributed by Foresight Financial Services, LLC.\n\nTim Beyers: Now that we're back here, let's talk about consumers who don an alter ego and take on social news and discussion platform Reddit, which recently reported earnings. We're going to talk about whether or not this is a rule breaker in the making, and we're each going to give a take on this. But before we do, let me tee this up with some data. Revenue grew 78% year over year in the most recent quarter. The company reported its biggest ever earnings beat as a public company, Reddit answers, which is something that they provide as a way to draw from the expertise of the community to answer significant questions. That was up 6X in weekly users and daily active users reached 110.4 million. That was up 21%. I'll start us here. There is some amount of evidence that Reddit is scaling and getting more out of the network as it grows. I found this fascinating. Reddit is a cash generator on a simple FCF basis, free cash flow, that means and it's produced 3.7 million in free cash flow, even after you subtract out all the stock based compensation. Now, there isn't enough cash there on an organic basis to cover their acquisitions, and Reddit does make acquisitions. But still, this is impressive. They are scaling they look like they are scaling inevitably toward consistent free cash generation. But Alicia, tell me, am I wrong? Is this a rule breaker in the making?\n\nAlicia Alfiere: I don't think that you're wrong, but I do have a question.\n\nTim Beyers: But you think I might be misguided?\n\nAlicia Alfiere: No, I would never I would never say that, Tim. I do have a question I've been noodling on, and perhaps we could all noodle on it together. I'm a big fan of Reddit, especially as a new parent. There is a wealth of human experience that you could find there, and there are different channels. Mom, Dad, all kinds of subreddits. I do think that in order to grow over the next five years, Reddit needs to hold on to this key competitive advantage of its trove of human experience data. Now, in their earnings call, Reddit talked about how AI can answer many questions, but some questions require a human answer and a range of human answers. But it also talked about human experience data being incredibly useful to another of the users of its platform, which are LLMs. I wonder, will selling access to its human experience data essentially give its competitive advantage away to LLMs, and if not, can AI and LLMs become a weak point in Reddit's network if their net contribution is negative for Reddit, since they're benefiting from the human experience data, seeking to replace Reddit in some ways by getting that data and using it in their own learning and if they ever post anything to Reddit, it would likely diminish the value of the human experience data that is so important for Reddit.\n\nTim Beyers: Maybe, but as somebody who's worked on some code that is trying to hit the Reddit API, can I just tell you how expensive it is to get the Reddit data through the API? I would say Reddit is not undervaluing that data, and if LLMs want to play and people who are using those LLMs want to play, they're going to pay, and it's not going to be cheap. It's an interesting question, though, but Tom, where do you land on this?\n\nTom King: Would be very wary of Reddit.\n\nTom King: It makes almost all of its money from advertising. That means that when people go onto Reddit.com, they see a banner ad on the side or a highlighted link, sponsored link or something, that's where Reddit makes all its money. There is a very big question right now about how much people are going to be visiting individual websites when they can get their answers from an LLM. That is a big unknown for me right now. If Reddit is not getting as much traffic to its website as it did historically, that is going to hurt Reddit badly and add to this fact that it is trading at 20 times revenue, and these are the kind of multiples we haven't seen since 2020, 2021, and that did not end well. I would be very cautious of Reddit.\n\nTim Beyers: Yeah, I'm glad you brought up the valuation. The valuation is arguably extreme and the hurdles that it has to get past. In order for Reddit to really blossom and deliver returns for investors, if you're a rule breaker investor and you're really looking at this one, you have to be looking out ten years and seeing an extraordinary expansion of that free cash flow margin, and you have to hold steady not only in that advertising business, but you're probably going to have to come up with new ways to generate revenue. That API that's feeding the LLMs, that's going to have to be profitable and persistently so and you may even need a third revenue stream that we can't even see yet, so yeah, this is speculative. I think we can agree. Is it a rule breaker? I think the consensus here is like, yeah, maybe. We'll take a look at it, but I don't think it's as cut and dried as it might be. I'm not sure it has all six traits. Alright, Fools, up next, a little bit of business history. A new segment. Please stay tuned. You're listening to Motley Fool Money.\n\nIn the spirit of education on these podcasts and something we used to do on a show you may have seen on Fool Live called This Week in Tech, we are bringing you now. This Week in Business history. For each of you, I know you've seen the notes, so you don't have to act surprised here, but I wonder if you are surprised by when this was. Today is August 4. If we go back to August 4, 1930, that is the opening of the first King Cullen supermarket in Queens, New York. Quick side note, I remember as a kid before we left New York, I remember going like, with my mom on shopping trips to the King Cullen supermarket. I know this name. I remember it from, like, the early 1970s. Here's my question for each of you, and I'll kick it off to you first, Tom. Are you surprised that supermarkets have been around now going on 100 years?\n\nTom King: You'd asked me, I would have thought it began later, so yes, I am surprised it began as early as 1930.\n\nTim Beyers: Alicia, what do you think?\n\nAlicia Alfiere: I'm not terribly surprised, but I do wonder how they were different, how their footprint was different than they are today. I'm sure they were much smaller and carried out much less variety of goods.\n\nTim Beyers: Well, so it's interesting you mentioned this because this is the Smithsonian Institution says, It's America's first supermarket, and it was revolutionary at the time. It introduced the concept of a self service grocery store. Up till this point, you would go to a grocer, and the grocer would take your list of what you want and then go get everything out of the backroom, out of the stock room, and bring it to you. Yeah, Alicia, go ahead.\n\nAlicia Alfiere: I feel like that should come back. I love the convenience of that, isn't that almost like Instacart?\n\nTim Beyers: It is. That's right. Like, this is the thing. The rule breakers lesson here is that it is very often that an existing industry that used to have rules that were broken end up getting rules broken again, and sometimes we go back to a variation of the old rules. This is exactly right. Instacart is like this. Interestingly, also, this idea of small format, lots of things pre designed, designed really to break really the price barrier and this is what's interesting very low prices was what King Cullen was known for. This sounds like another recent rule breaker, Tom, which I would say is BBB Foods. Not necessarily a big warehouse. Reasonable form factor really small designed for really low prices, and you get in and you get your stuff fast and you get it and you get out, so this is interesting to me. Here's my question for you, Tom, and then I'll kick it back to you, Alicia. This does seem ripe for yet another paradigm shift. Have I made you more interested, less interested, or you are as interested as you always were about looking at rule breakers in this industry?\n\nTom King: It certainly is a very big industry, close to a trillion dollars in sales in 2024. It is an industry that hasn't changed very much for quite a long time. As you said, the first supermarket introduced in 1930 now, that is how we mostly get our groceries from Walmart is, for example, one of the biggest grocers in the United States. I suppose somebody could figure out a way to do it better, but it is a difficult industry to enter because, the margins are very thin. They're very big, well prepared competitors Costco, Walmart, I'm thinking of in particular. It's a hard thing to shop for groceries. Sometimes the thing you want is not there or you like your bananas a certain ripeness. Other people think there should be a different ripeness. All those factors make it pretty hard to get this right and disrupt. But I'm certainly interested to hear ideas from people that try to do it differently. I think Amazon Fresh was quite an interesting idea in the whole grocery space and that I don't think has been particularly successful.\n\nTim Beyers: No, it wasn't that good an idea.\n\nTom King: Why do you say that, Tim? Because I think they tried to automate far too much of it and stripped all of the humanity out of it, and I think that just didn't work. But let's end on this. It's a $1 trillion, as of 2024, it's a $1 trillion market and we're going to get a better read on how this is doing when Walmart reports earnings on August 15, so stay tuned for that. Kroger will report in September. Will there be disruption here? We're going to have to look at the numbers in the coming month. Let's end with a prediction because we have Walmart earnings coming up on August 15, then we have Kroger earnings coming next month in September. Here's my question. Quick one, yes or no, which one or actually, which is the bigger outperformer? Walmart or Kroger over the next 10 years. Give me a rough estimate of what you think and I'll start us off here. I won't just leave you on the hook. I'll go with you first after I give my prediction here. I'm going to say Walmart, and I'm going to say at least 10% annualized over the next 10 years. I think Kroger's going to struggle to get over 7%. Alicia, what do you think?\n\nAlicia Alfiere: Tim, you came in and stole my answer right out of my head.\n\nTim Beyers: No. You didn't copy my answer. There's no rules here.\n\nAlicia Alfiere: I would copy your answer, but I would also say that as Tom was talking, I was thinking about this idea of disruptors in this space, and I thought, there are some cases in which a player that has been in the market for a while can disrupt the market and disrupt itself. I think if any company has the likelihood of doing it, it would be Walmart, so I agree.\n\nTom King: I always try to take a diff different answer to what my co hosts have given, but honestly, that's exactly what I was going to say Tim. Walmart.\n\nTim Beyers: There you go.\n\nTom King: Yeah, so that's my answer.\n\nTim Beyers: I like it. Consensus. We got it. We're going to leave it there. Fools, as always, people on the program may have interest in the stocks they talk about, and the Motley Fool may have formal recommendations for or against, so don't buy or sell stocks based solely on what you hear. All personal finance content follows Motley Fool editorial standards, and it's not approved by advertisers, advertisements are sponsored content and provide for informational purposes only, to see our full advertising disclosure, please check out our show notes. Fools, thank you for tuning in to Motley Fool Money. For my guest, Alicia Alfiere, Tom King, for our engineer Dan Boyd, I'm Tim Beyers. Thanks for tuning in. Fool on, everyone.",
  "medium": "Article",
  "links": [
    "https://www.fool.com/investing/top-stocks-to-buy-and-hold/",
    "https://www.fool.com/podcasts/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Reddit",
      "weight": 0.058503393
    },
    {
      "name": "human experience data",
      "weight": 0.058241144
    },
    {
      "name": "free cash flow",
      "weight": 0.054909803
    },
    {
      "name": "Roblox experiences",
      "weight": 0.05300002
    },
    {
      "name": "Motley Fool analysts Tim Beyers",
      "weight": 0.052241754
    },
    {
      "name": "Walmart earnings",
      "weight": 0.04960501
    },
    {
      "name": "human experience",
      "weight": 0.048690956
    },
    {
      "name": "Motley Fool",
      "weight": 0.0483463
    },
    {
      "name": "rule breakers",
      "weight": 0.04821046
    },
    {
      "name": "predictable monthly cash flow",
      "weight": 0.047927577
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97705078125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.87451171875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.837890625
    }
  ],
  "sentiment": {
    "positive": 0.14453125,
    "negative": 0.57177734,
    "neutral": 0.2836914
  },
  "summary": "Motley Fool analysts Tim Beyers, Alicia Alfiere, and Tom King discuss the quarterly results from Etsy and Roblox. They also discuss whether Reddit is emerging as a Rule Breaker. Despite the recent Federal Reserve decision to hold back on lowering interest rates, these analysts believe that this could be a good future for businesses that depend on consumer spending. Etsy reported a 4% increase in revenue year over year but its earnings per share fell 39%, and gross merchandise sales dropped 5%. Despite this, they believe that Etsy's ability to raise prices on sellers via higher take rates is the only growth spurning this growth. However, these shares fell 39% and GMS is flat. Robloxy's popularity is also increasing, with monthly users paying up 42% and its engagement improving by 58%.",
  "shortSummary": "The Motley Fool's podcast discusses mixed economic data, with mixed results from Etsy, Roblox, and Reddit highlighting potential future growth prospects for consumer spending and advertising.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5f5cde25fc2744b3817f6041dbe083ed",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/investing/top-stocks-to-buy-and-hold/",
      "text": "There are thousands of publicly traded companies you can invest in, not to mention the many exchange-traded funds (ETFs) and mutual funds you can buy. So, it's not surprising that many investors don't know where to begin. Even with a market that reached record highs in mid-2025, plenty of stocks remain extremely attractive for long-term investors to consider buying.\nBut what are the best stocks to buy in August 2025? Although I can't consult a crystal ball that tells me what stocks will deliver the best returns, I've tried to do the next best thing. In this article, I'll discuss 10 stocks that I think could be great buys for long-term investors looking to put their money to work.\nWhy these 10?\nWhy these 10?\nBefore we get to the stocks, let's acknowledge three caveats:\n- Choosing the best stocks to buy today depends on your personal financial situation. To get a feel for where you stand, read our guide on how to invest in stocks. It walks you through topics such as establishing an emergency fund, allocating assets, and choosing the right stocks for you.\n- I like these stocks as long-term investments, even if a market crash or bear market arrives. I have absolutely no idea what they'll do over the next few weeks or months. In fact, if inflation unexpectedly spikes higher, trade tensions escalate, or the U.S. falls into a deep recession, it's entirely possible that most or all of them could soon decline.\n- Although I ensured some variety, the list below isn't meant to be a fully diversified portfolio. Instead, these are my highest-conviction long-term stocks to invest in now. The best one-step way to diversify your holdings is to build the core of your portfolio around something like the Vanguard Total World Stock Index Fund ETF (VT 0.59%) or the Vanguard S&P 500 ETF (VOO 0.75%).\nNow, let's get to my list of the 10 best stocks to buy and hold for the long term -- listed from smallest market cap to largest as of July 2025 -- followed by the summarized buy thesis for each.\nPublicly Traded Company\n| Name and ticker | Current price | Market cap | Industry |\n|---|---|---|---|\n| PayPal (NASDAQ:PYPL) | $67.65 | $65 billion | Diversified Financial Services |\n| Airbnb (NASDAQ:ABNB) | $120.96 | $74 billion | Hotels, Restaurants and Leisure |\n| MercadoLibre (NASDAQ:MELI) | $2,358.22 | $118 billion | Multiline Retail |\n| CrowdStrike (NASDAQ:CRWD) | $424.14 | $106 billion | Software |\n| Shopify (NASDAQ:SHOP) | $149.48 | $196 billion | IT Services |\n| Intuitive Surgical (NASDAQ:ISRG) | $470.15 | $168 billion | Healthcare Equipment and Supplies |\n| Walt Disney (NYSE:DIS) | $112.37 | $203 billion | Entertainment |\n| Berkshire Hathaway (NYSE:BRK.B) | $465.31 | $996 billion | Diversified Financial Services |\n| Alphabet (NASDAQ:GOOGL) | $201.39 | $2.4 trillion | Interactive Media and Services |\n| Amazon (NASDAQ:AMZN) | $222.61 | $2.4 trillion | Multiline Retail |\nStock pitches\nPitches for each stock\nNow that you've seen my top 10 best stocks to buy now, you may be wondering why I picked each company. Here's a quick rundown of why I'm such a fan of each as a long-term stock to invest in.\nCompanies 1-3\n1. PayPal\nPayPal is an absolute cash machine that has been beaten down by more than 75% from its highs. If you aren't familiar with the recent history, PayPal completely overhauled its management team in late 2023. Every member of its C-suite is new to the business, and it is an impressive group.\nThe new leaders are already making some big moves, including rolling out an industry-leading cash-back debit card product and launching an advertising platform. Since the new leadership took over, efficiency has improved dramatically, and earnings per share (EPS) is significantly higher.\nThis could be just a starting point. Management has recently presented investors with a growth roadmap and believes it can achieve sustainable 20% annual earnings growth in the not-too-distant future.\nCurrently, the company has 436 million active users across PayPal and Venmo, and it processes about $1.7 trillion in annualized payment volume. The company produces about $6 billion in free cash flow annually and has been using it to aggressively buy back its own stock, a sign that management thinks it's cheap.\nIt's not hard to see why PayPal's management is choosing to use its capital this way. As of June 2025, the stock traded at a historically low price-to-sales ratio and for just 15 times forward earnings.\n2. Airbnb\nFew companies have been as successful in disrupting an entire industry as Airbnb. The company started in 2007 as a few air mattresses on the floor of the co-founders' apartments (that's where the company gets its name) and has evolved to the point where it has changed the way millions of people look at travel accommodations.\nAirbnb has more than 5 million hosts who list more than 8 million properties and experiences on its platform. In the most recent quarter alone, more than 143 million nights and experiences were booked on Airbnb's platform, with a total booking value of almost $25 billion, which represents 9% year-over-year growth.\nAirbnb is not only massive and growing quickly but also highly profitable. It generated $4.4 billion in free cash flow (FCF) and has a 39% FCF margin over the past four quarters.\nLooking forward, Airbnb has $11.5 billion in cash and short-term investments on its balance sheet. And it still has a massive growth opportunity.\nIts overall market opportunity is estimated to be trillions of dollars when including short-term stays, long-term stays, and experiences. Plus, management clearly believes the stock's valuation doesn't accurately reflect the long-term opportunity, given that the company has been buying back shares rather aggressively.\n3. CrowdStrike\nIt seems like every week, there's another high-profile security breach. The need for cybersecurity solutions certainly isn't getting any smaller. And that's especially true when it comes to cloud-based security.\nCrowdStrike is leading the charge to keep data secure in the cloud. This is a best-in-breed cybersecurity company with a highly effective platform.\nCrowdStrike collects security data from each of its many users, analyzes it, and uses it to automate security throughout its entire network. This makes the platform highly effective at detecting the newest threats.\nAnd the more users adopt CrowdStrike's solutions (known as its Falcon platform), the more effective it becomes. The use of crowdsourced threat data, combined with its leading market share, gives it a competitive advantage over peers.\nWith $4.4 billion in annual recurring revenue and an 80% subscription gross margin, CrowdStrike's growth has been impressive, but this could be just the beginning. The company sees its current addressable market at $100 billion in potential revenue and expects that the opportunity could more than double to $225 billion by 2028.\nCompanies 4-6\n4. MercadoLibre\nOne of my favorite long-term stock investments in the market, MercadoLibre, is often referred to as the Amazon of Latin America, and for good reason. The company operates an e-commerce marketplace with a dominant presence in some of the region's most populous nations, including Brazil and Argentina.\nHowever, there's a lot more to MercadoLibre. It operates a fast-growing payments platform called Mercado Pago, a logistics service known as Mercado Envios, a business lending platform, and more.\nThe marketplace saw $13.3 billion in merchandise volume in the first quarter of 2025, representing a 17% increase over the same quarter in 2024. Mercado Pago processes more than $230 billion in annualized payment volume, with three-quarters of this volume coming from outside the company's e-commerce platform.\nE-commerce\nBoth main parts of the business are growing rapidly. And don't overlook Mercado Crédito, the company's young but fast-growing (and highly profitable) lending business. Mercado Crédito has $7.8 billion in outstanding loan balances.\nMercadoLibre isn't just the Amazon of Latin America -- it's the Amazon, PayPal, Block (XYZ -4.45%) (owner of Square and Cash App), Shopify, and more, all rolled into one. And it's in a much earlier stage of growth. As the e-commerce and fintech landscapes in Latin America evolve over the coming years, MercadoLibre could be a major long-term beneficiary.\n5. Shopify\nShopify operates a platform designed to enable businesses of all sizes to sell their products online, with a particular focus on empowering smaller businesses and growing with them by establishing long-term relationships.\nShopify offers a subscription plan starting at $39 per month for businesses (even less for one-person merchants). It also provides many adjacent services that help businesses operate smoothly, such as payment processing solutions and logistics.\nShopify's one-stop shop approach to enabling e-commerce has turned it into a powerhouse. It now has more e-commerce sales flowing through its ecosystem than any company besides Amazon. However, Shopify could be just getting started.\nThe platform has generated $9.4 billion in revenue over the past four quarters. However, this is just a fraction of its estimated $153 billion (and growing) market opportunity as more retailers shift their focus to online sales.\nE-commerce is still in the relatively early stages, making up slightly more than 16% of retail sales in the United States. Shopify's platform has the No. 2 share of e-commerce by total payment volume (second only to Amazon), giving it a powerful ecosystem with network effect advantages over competitors.\nThe stock price remains well below its highs in the recent market downturn due to fears about recession and signs of a slowdown in consumer spending. And Shopify appears to be a great long-term opportunity.\n6. Intuitive Surgical\nRobot-assisted surgery beats shaky human hands. That general thesis hasn't changed much from when I first noticed Intuitive Surgical stock in 2005. The da Vinci Surgical System is the clear market leader, and its \"razor and blades\" model helps Intuitive generate a recurring stream of revenue.\nIntuitive Surgical is dominant in its space, with a global market share of about 80%. It has lots of room to grow as the adoption of its surgical systems and the number of supported procedures increase over time. This is particularly true in many international markets, where the implementation of robot-assisted surgery could be a long-tailed growth catalyst for this excellent business for decades to come.\nCompanies 7-10\n7. Walt Disney\nThe House of Mouse is like the all-weather tires of a portfolio. The pandemic hurt its theme park and movie businesses but helped the Disney+ streaming service, which has grown into a powerhouse years earlier than Disney expected.\nIn fact, barely five years after launching, Disney+ Core now has 126 million paid subscribers, while Hulu adds tens of millions more. In addition, the market is absorbing price increases with minimal impact on subscriber count, and Disney's streaming business has recently become profitable for the first time ever.\nWhile consumers are clearly feeling the pressure of inflation, demand for Disney's theme parks, movies, and cruise line has been strong. In fact, per-guest revenue in Disney's parks is far greater than in comparable pre-COVID-19 pandemic times, thanks to initiatives that have driven higher in-park spending. Plus, the company is investing $60 billion over a decade in its theme parks and cruise line to ensure they remain full for the foreseeable future.\nWith Disney also laser-focused on the profitability of Disney+ and its other streaming platforms, Hulu and ESPN+, this could be a powerful combination of profitable, all-weather revenue streams. In a nutshell, Disney might be the ultimate combination of an in-person experiential stock and a tech-focused growth business.\nDisney's amazing stable of intellectual properties (the Marvel Cinematic Universe, Star Wars, ESPN, Pixar, etc.) and its cash-machine theme park business give it a margin of safety that makes it perhaps the safest stock on this list. And it still maintains tremendous profit growth potential as newer areas of its business evolve.\n8. Berkshire Hathaway\nAlthough most of this list is made up of growth stocks, or at least stocks that have some exciting growth drivers, this is the relatively boring value pick of the bunch (but in the best possible way). Berkshire Hathaway owns a collection of about 60 subsidiary businesses, including household names such as GEICO, Duracell, and Dairy Queen, to name just a few.\nBerkshire also owns a portfolio of common stocks -- worth about $296 billion as of July 2025 -- that includes massive stakes in Apple (AAPL 4.24%), Bank of America (BAC 2.45%), Chevron (CVX 1.21%), American Express (AXP 0.89%), and Coca-Cola (KO -0.13%), as well as positions in dozens of other companies. Many were particularly savvy investments, such as the Bank of America stake, which resulted from a preferred stock deal made in the wake of the financial crisis.\nIn addition to its businesses and stock portfolio, Berkshire also had around $348 billion in cash and short-term investments as of March 31, 2025, giving it incredible financial flexibility to take advantage of opportunities as they arise.\nBerkshire continues to produce market-beating returns in most years despite its massive size. And while Berkshire certainly won't produce the roughly 5,550,000% return (not a typo) it has produced from the time Buffett took the helm in 1964 through the end of 2024, there's no reason to believe it won't continue to outpace the S&P 500 (SNPINDEX:^GSPC) index for the foreseeable future.\nIn fact, the company recently reached an impressive milestone by becoming the first non-technology company to reach a trillion-dollar market cap. Legendary investor Warren Buffett recently announced his plans to step down as CEO at the end of 2025, but the company is in good hands. Berkshire's winning culture is likely to live on for decades, even in its post-Buffett era.\n9. Alphabet\nAlphabet isn't exactly a household name, but its main subsidiary, Google, certainly is. And there's a lot more to the business and its potential than the massive internet search operation that has a dominant market share.\nGoogle is divided into two main segments: Google Services and Google Cloud. Google services include YouTube, Google Play, Gmail, Android, Chrome, and the Nest smart-home products. This part of the business makes most of its money from advertising, but there's also significant revenue from hardware (Nest) and in-app purchases (Google Play).\nGoogle Cloud is the company's cloud services division, holding the No. 3 market share behind Amazon Web Services (AWS) and Microsoft's (MSFT 0.22%) Azure. It has been growing its market share in recent years, and the cloud infrastructure market itself is forecast to quadruple by 2030. So, while this makes up about 10% of the company's revenue today, it could be the biggest growth driver for years to come.\nIn addition, Alphabet has a segment called \"other bets,\" which owns several promising early-stage businesses. The self-driving vehicle technology company Waymo is perhaps the most notable and has a clear market lead in the young robotaxi industry. While none of the \"other bets\" companies produce any significant revenue yet, there's a lot of long-term potential.\nNot only is there tons of growth potential, but Alphabet is extremely profitable and has lots of cash. In fact, this has recently prompted Alphabet to start paying a dividend for the first time ever.\n10. Amazon\nAmazon doesn't really need much of an elevator pitch for most people. The company holds a dominant lead in the U.S. e-commerce market. And its Amazon Web Services cloud platform is also a market leader, with a significant lead over the other two large players in the space, Microsoft and Alphabet.\nHowever, more growth potential exists than you might think. We're still a long way from maximizing e-commerce adoption, as it accounts for only a little more than 16% of all U.S. retail sales.\nThe cloud industry is relatively young and expected to roughly quadruple in size to a $2.3 trillion market by 2032. Amazon also has a ton of potential in other areas, including healthcare, grocery stores, neighborhood markets, and more.\nRelated investing topics\nUsing this list\nHow to use this stock list\nIf you're just starting out on your investing journey (or want a sanity check), please read through our guide on how to invest in stocks (mentioned at the top of this article). It goes through all the basics, from getting started to determining your personal investing strategy and how much of your money to invest in stocks.\nAlthough I'm bullish on each of these stocks and think they are good investments to buy right now, they might not all be the best choices for investors without established and diversified portfolios. Even the most stable companies on this list aren't immune to volatility in their stock prices, especially over short periods.\nFor this reason, if you're just getting started, you'll also want to see our list of the five top tips for investing in stocks for beginners. To be sure, I think the 10 stocks discussed here are some of the best long-term stock investments you can buy now. But it's wise to start with the stocks that speak to you and feel free to ignore the ones that don't.\nFAQ\nTop stocks to buy: FAQ\nWhat are the top 10 stocks to buy?\nThe top 10 stocks to buy depend on many factors, such as current stock market conditions, your personal investment goals and risk tolerance, and much more. Generally speaking, the best stocks to buy are leaders in their industries with lots of room to grow and durable competitive advantages.\nWhat's one of the best stocks to invest in right now?\nSome of the top stocks to invest in right now are Amazon, Alphabet (the parent company of Google), Disney, and Berkshire Hathaway. However, the best stocks for you depend on your personal investment objectives.\nWhich stock will boom in 2025?\nUnfortunately, nobody has a crystal ball that can predict which stock will be the best performer, and we are no exception. But if you buy strong businesses with durable competitive advantages, you'll set yourself up for long-term success.\nWhat kind of stocks go up the most?\nThe best-performing stocks tend to be those whose management teams consistently innovate and execute on their growth strategies, handily outperforming expectations in the process."
    }
  ],
  "argos_summary": "In a recent podcast, Motley Fool analysts discussed mixed economic data affecting consumer-driven businesses, focusing on quarterly results from Etsy and Roblox. Etsy reported a 4% revenue increase but a significant drop in earnings per share and gross merchandise sales, raising concerns about its sustainability. In contrast, Roblox showed strong engagement metrics despite missing revenue expectations, indicating continued popularity. The analysts also touched on Reddit's impressive revenue growth and user engagement, debating its potential as a 'rule breaker' in the market.",
  "argos_id": "SWK4MSCPR"
}