{
  "url": "https://www.techradar.com/computing/windows/microsoft-reveals-a-surprising-catch-to-extended-support-for-windows-10-thats-going-to-seriously-annoy-some-people",
  "authorsByline": "Darren Allan",
  "articleId": "75b2cf31dc3b48c794260fac7bd9c1de",
  "source": {
    "domain": "techradar.com",
    "paywall": false,
    "location": {
      "country": "in",
      "city": "New Delhi",
      "coordinates": {
        "lat": 28.6138954,
        "lon": 77.2090057
      }
    }
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/FW3tr6LdvKmYiNeRxPhVUo.jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T14:30:00+00:00",
  "addDate": "2025-08-08T14:34:19.095588+00:00",
  "refreshDate": "2025-08-08T14:34:19.095590+00:00",
  "score": 1.0,
  "title": "It turns out that even if you pay for it, extended support for Windows 10 is 'tied to your Microsoft account' - and I hardly think that's fair",
  "description": "Even if you pay $30 for extended support for Windows 10, you'll need a Microsoft account",
  "content": "• Even if you pay $30 for the program, you'll need to have a Microsoft account\n• The good news is that up to 10 devices are supported with one license\n\nWe've had a surprise late revelation that Windows 10's extended update scheme will require you to have a Microsoft account, even if you pay for those updates (and don't take up the free offer).\n\nWindows Central uncovered a Microsoft support document carrying this info, which has left more than a few people unhappy.\n\nWhen Microsoft revealed its Extended Security Updates (ESU) program, the company made it clear that the cost would be $30 for an extra year of support, through to October 2026 (normal support ends this October). Then later, Microsoft relented and offered a free option, allowing Windows 10 users to instead choose to sync their PC settings to its cloud service - which, of course, is going to require a Microsoft account (to be signed into OneDrive, where the data is synced).\n\nFolks assumed that if they went the paying route, spending $30 would be the only requirement - but it turns out that you'll also need a Microsoft account to avail yourself of the ESU in this way, meaning a local account on your PC won't suffice.\n\nMicrosoft tells us: \"All enrollment options provide extended security updates through October 13, 2026. You will need to sign into your Microsoft account in order to enroll in ESU.\"\n\nElsewhere in the support document, Microsoft notes: \"The ESU license is tied to your Microsoft account, so you may be prompted to sign in if you typically sign into Windows with a local account.\"\n\nThere is some good news here, though, which is that Microsoft also clarifies that this extended support program can be used on up to 10 devices. So, as long as those Windows 10 PCs are all signed in to the Microsoft account that has picked up the ESU offer, they're good to go.\n\nRegardless of how you access the ESU scheme, the license you get must be tied to a Microsoft account. If you've forgotten those options, you can pay $30, sync your PC settings to OneDrive, as mentioned, or alternatively, use 1,000 Microsoft Rewards points (if you have them).\n\nThe reason for the Microsoft account requirement is doubtless so the software giant can police the 10-device limit, but as noted, this is going to cause some degree of bad feeling. Given that Microsoft has been pushing against being able to have a local account at all when setting up Windows 11 - and notably closing loopholes that are present to fudge your way around having to tie an installation to a Microsoft account - people are only going to be suspicious that this is just another way to shove them into getting a Microsoft account.\n\nIf you're paying $30 for the privilege of an extra year of support, shouldn't forking out that cash be enough? I think so, and Microsoft could always just warn you that if you don't use a Microsoft account, you'll only get support on a single device (the one you're signing up with). Then users could decide to proceed, or not, with linking to an account based on their preference in that regard.\n\nIf you do have multiple Windows 10 PCs, mind, it's no doubt good to know that you can cover them all with just a single sign-up for the ESU (even using the free offer).\n\nYou might also like\n• Microsoft finally fixes one frustrating Windows 11 pop-up – just as a more irritating one arrives to take its place\n• Microsoft promises to crack one of the biggest problems with Windows 11: slow performance\n• Microsoft has all but given up on Windows 11 SE – and it looks like the war against Chromebooks has been lost",
  "medium": "Article",
  "links": [
    "https://www.techradar.com/tag/windows-11",
    "https://www.techradar.com/computing/windows/microsoft-looks-to-be-making-a-big-change-to-how-you-install-and-log-in-to-windows-11-and-im-not-happy-about-it-at-all",
    "https://www.windowscentral.com/microsoft/windows-10/microsoft-just-made-windows-10s-usd30-extended-support-program-an-even-better-deal-but-you-now-need-a-microsoft-account-to-pay-for-it",
    "https://www.techradar.com/computing/windows/windows-10-users-who-dont-want-to-upgrade-to-windows-11-get-new-lifeline-from-microsoft",
    "https://www.techradar.com/tag/microsoft",
    "https://www.techradar.com/computing/windows/microsoft-promises-to-crack-one-of-the-biggest-problems-with-windows-11-sluggish-performance",
    "https://www.techradar.com/computing/windows/microsoft-finally-fixes-one-frustrating-windows-11-pop-up-just-as-a-more-irritating-one-arrives-to-take-its-place",
    "https://www.techradar.com/computing/windows/microsoft-has-all-but-given-up-on-windows-11-se-and-it-looks-like-the-war-against-chromebooks-has-been-lost",
    "https://www.techradar.com/computing/windows/it-only-took-four-years-but-windows-11-is-now-the-most-popular-desktop-os-and-time-is-running-out-for-windows-10",
    "https://www.techradar.com/computing/windows/its-obvious-that-users-are-frustrated-consumer-rights-group-accuses-microsoft-of-not-providing-a-viable-solution-for-windows-10-users-who-cant-upgrade-to-windows-11",
    "https://www.techradar.com/tag/windows-10",
    "https://www.techradar.com/computing/windows/want-to-install-windows-11-without-linking-it-to-a-microsoft-account-it-just-got-harder-to-do-this-sadly-but-its-still-possible",
    "https://www.techradar.com/computing/windows/hate-windows-11-and-dont-want-to-upgrade-you-can-now-extend-the-life-of-windows-10-until-october-2026-heres-how",
    "https://www.techradar.com/computing/windows/microsoft-offers-security-extension-on-windows-10-after-october-2025-but-itll-cost-you",
    "https://www.techradar.com/pro/windows-10-eol-heres-what-you-need-to-know-ahead-of-microsofts-end-of-support-deadline",
    "https://support.microsoft.com/en-us/windows/windows-10-consumer-extended-security-updates-esu-program-33e17de9-36b3-43bb-874d-6c53d2e4bf42#cw"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Microsoft",
      "weight": 0.11651319
    },
    {
      "name": "Microsoft Rewards",
      "weight": 0.11358545
    },
    {
      "name": "extended support",
      "weight": 0.09091862
    },
    {
      "name": "Windows",
      "weight": 0.08723345
    },
    {
      "name": "Windows Central",
      "weight": 0.08644403
    },
    {
      "name": "the Microsoft account requirement",
      "weight": 0.08405932
    },
    {
      "name": "a Microsoft account",
      "weight": 0.079228595
    },
    {
      "name": "the Microsoft account",
      "weight": 0.079228595
    },
    {
      "name": "your Microsoft account",
      "weight": 0.079228595
    },
    {
      "name": "normal support",
      "weight": 0.07817314
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.87158203125
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.82568359375
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.46044921875
    }
  ],
  "sentiment": {
    "positive": 0.14733887,
    "negative": 0.3173828,
    "neutral": 0.53515625
  },
  "summary": "Microsoft's extended update scheme for Windows 10 will require a Microsoft account, even if you pay for the updates, according to a Microsoft support document. The cost of the program, which includes $30 for an extra year of support, through to October 2026, was initially $30. However, Microsoft later offered a free option allowing users to sync their PC settings to its cloud service, which requires a Microsoft Account. This has caused some confusion among users, as long as Windows 10 PCs are all signed in to the Microsoft account that receives the ESU, they're good to go. The ESU license can be used on up to 10 devices, provided that as many as one license.",
  "shortSummary": "Microsoft's extended security update scheme for Windows 10 requires a Microsoft account for extended support, despite the $30 fee option, affecting some users who pay free.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2b76d39cdd314b45a9ee42f7efa246f4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.techradar.com/tag/windows-10",
      "text": "Windows 10\nLatest about Windows 10\nMicrosoft reveals a surprising catch to extended support for Windows 10 that's going to seriously annoy some people\nBy Darren Allan published\nMicrosoft has been cracking down on local accounts with Windows, and this could be seen as another push in that direction.\nReport suggests Windows 10's Game Bar is crashing with some high-end AMD Ryzen CPUs - and I hope Microsoft will investigate soon\nBy Darren Allan published\nThe Game Bar has a crucial feature for some Ryzen X3D CPUs - and it's now broken, which is seriously bad news.\nConfused about why you can't upgrade to Windows 11? Microsoft has some new advice that might help... including a trick I wasn't aware of\nBy Darren Allan published\nPreparing for your upgrade to Windows 11? Microsoft has some new advice that could be very handy.\nNvidia throws Windows 10 gamers a lifeline with driver support - but time's up for the popular GTX 1060 GPU, as support runs out in October 2025\nBy Darren Allan published\nDriver support for Pascal GPUs like the GTX 1060 ends in October 2025, and Windows 10 users have until October 2026.\nMicrosoft's trying to force OneDrive on us yet again - this time for moving from a Windows 10 PC to a Windows 11 one\nBy Darren Allan published\nIt's easy to transfer from Windows 10 to a Windows 11 PC, Microsoft boasts - if you fork out for OneDrive (but there are free alternatives).\nSome Windows 10 PCs are reportedly being offered a Windows 11 upgrade even though they don't support the OS – here's what to do if this happens to you\nBy Darren Allan published\nThere are scattered reports of a Windows 11 upgrade popping up on Windows 10 PCs that aren't eligible for the OS, and it looks like a bug.\nWindows 10 is ten years old and it had some of the best and worst ideas ever\nBy Lance Ulanoff published\nWindows 10 turns ten years old - too bad Microsoft's birthday present is a death sentence.\nMicrosoft makes a nifty tweak to the Windows 11 taskbar – but it's probably not the change you were hoping for\nBy Darren Allan published\nIf you're a member of the multiple monitor club, you're going to love this small but highly convenient tweak.\nSign up for breaking news, reviews, opinion, top tech deals, and more."
    },
    {
      "url": "https://support.microsoft.com/en-us/windows/windows-10-consumer-extended-security-updates-esu-program-33e17de9-36b3-43bb-874d-6c53d2e4bf42#cw",
      "text": "The Extended Security Updates (ESU) program for Windows 10 provides customers with a more secure option to continue using their Windows 10 PCs without updating to Windows 11, mitigating the risk of malware and cybersecurity attacks. ESU program enrollment provides access to critical and important security updates as defined by the Microsoft Security Response Center (MSRC) for devices running Windows 10, version 22H2. ESU enrollment does not provide other types of fixes, feature improvements, or product enhancements. It also does not come with technical support.\nThe last day of support for Windows 10 is October 14, 2025. If you need more time to move to Windows 11, we recommend you enroll your Windows 10 device in ESU. You can enroll in ESU any time until the program ends on October 13, 2026.\nPrerequisites\nTo enroll in the consumer ESU program, make sure your device meets the following requirements:\n-\nDevices need to be running Windows 10, version 22H2 Home, Professional, Pro Education, or Workstation edition\n-\nDevices need to have the latest update installed\n-\nThe Microsoft account used to sign in to the device must be an administrator account\n-\nThe ESU license is tied to your Microsoft account, so you may be prompted to sign in if you typically sign into Windows with a local account\n-\nThe Microsoft Account can’t be a child account\n-\n-\nDevices in kiosk mode\n-\nDevices joined to an Active Directory domain or that are Microsoft Entra joined\n-\nHowever, devices that are Microsoft Entra registered can use the Consumer ESU program\n-\n-\nDevices enrolled in a Mobile Device Management (MDM) solution\n-\nDevices that already have an ESU license\nIf you're an IT professional and need to enable ESU for your organization, see Enable Extended Security Updates (ESU).\nConsumer ESU program cost\nYou can enroll in ESU by one of the following three ways:\n-\nAt no additional cost if you are syncing your PC Settings\n-\nRedeem 1,000 Microsoft Rewards points\n-\nOne-time purchase of $30 USD or local currency equivalent plus applicable tax\nenroll in the ESU program. You can use your existing ESU license on up to 10 devices.\nAll enrollment options provide extended security updates through October 13, 2026. You will need to sign into your Microsoft account in order to enroll in ESU. You’ll be given these options to choose from when youEnroll in ESU\nESU is rolling out to all Windows 10 devices that are running Windows 10, version 22H2 starting with Windows Insiders.\nTo enroll your device in ESU:\n-\nGo to Settings > Update & Security >Windows Update. If your device meets the prerequisites, you’ll see a link to enroll in ESU.\n-\nOnce you select Enroll now you’ll start the ESU enrollment. If you are signed into Windows with a local account, you will be prompted to sign into your Microsoft account. If you are already backing up your PC Settings, you will see a prompt to enroll your device.\n-\nIf you aren’t backing up your Windows settings, you can choose if you want to begin backing up your settings, redeem Rewards, or make a one-time purchase to enroll in ESU.\n-\nYou can use your existing ESU license on up to 10 devices once you enroll in ESU. Just go to Settings > Update & Security >Windows Update and select Enroll now.\n-\nFrequently asked questions\nIf you need more time to move to Windows 11, and plan on using your Windows 10 PC after October 14, 2025, enrolling in ESU can give you peace of mind by helping protect your Windows 10 device until the program ends on October 13, 2026.\nYou can enroll in ESU any time until the program ends on October 13, 2026. If you enroll after the ESU program launches, you will receive any previous updates as well as any future updates.\nThe ESU program delivers critical and important security updates for enrolled Windows 10 PCs after the last day of support for Windows 10. These security updates will be delivered through Windows Update as they're made available.\nYes! Enrolling in ESU does not prevent you from upgrading your PC to Windows 11 if it meets the hardware eligibility requirements.\nIf you enrolled in ESU by completing a one time purchase, you can cancel your order anytime before October 14, 2025. To learn more about how to cancel an order or pre-order, see Cancel an order or pre-order from Microsoft Store.\nIf you cancel a pre-order after it's billed but before it's released, we'll process it as a refund. To find out about the status of your refund, see Get the status of your return and refund from Microsoft Store.\nIf you use money in your Microsoft account, we'll charge you right away. If you use any other payment option, including payment backup, we may charge you up to 10 days before the release date.\nAfter October 14, 2025, any refunds would follow our policy for digital purchases for your country. For complete details on how to return eligible products, see our Returns and Refunds page.\nIf you enrolled in ESU at no additional cost by backing up your PC settings, you were not charged for ESU, so there would not be any refunds. If you enrolled in ESU by redeeming Microsoft Rewards points, Rewards orders are final and are not eligible for return or exchange.\nNo – once any user on a Windows 10 PC enrolls in ESU, any additional users on that PC will also be protected. However, if any users have other Windows 10 PCs they will need to enroll those devices in ESU.\nYou can use your ESU license on up to 10 devices once you enroll in ESU. Any additional Windows 10 PC you wish to enroll in ESU must meet the eligibility requirements. To enroll a different PC, navigate to Settings > Update & Security >Windows Update. Select Enroll now, then follow the prompts to add the device the ESU.\nIf your child’s device shows a message saying it can’t be enrolled in ESU, it likely means they don’t have the necessary permissions. In that case, you’ll need to enroll the device for them. To do that, you must be set up as a user on that PC. If you aren’t already, your child will need to add you as a user before you can complete the enrollment. Follow these steps to enroll your child's device:\n-\nSwitch to your user account on your child's device by selecting Start and select the account name icon (or picture) of your account.\n-\nIf you are not a user on their device, your child will need to add you as a user your Microsoft account as a user and configure it as an administrator following the steps here: Manage User Accounts in Windows.\n-\nOnce you are signed into your user account, follow the steps to enroll in ESU.\nTo ensure you have the most modern and secure computing experience, your first step is to check if your device can upgrade to Windows 11. If your device is unable to upgrade, we encourage customers to explore Windows 11 and Copilot+ PCs. This way, you’ll continue receiving the latest security updates, features, and innovations from Microsoft. Together with our partners, we offer a range of Windows 11 PCs to support how you live, work and create. Find a PC that is right for you here.\nYou can check your enrollment status anytime by navigating to Settings > Update & Security >Windows Update. If you purchased ESU, you will also be able to see your order in your Order History.\nRelated article\n-\nIf you're an IT professional and need to enable ESU for your organization, see Enable Extended Security Updates (ESU)"
    },
    {
      "url": "https://www.techradar.com/computing/windows/microsoft-finally-fixes-one-frustrating-windows-11-pop-up-just-as-a-more-irritating-one-arrives-to-take-its-place",
      "text": "Microsoft finally fixes one frustrating Windows 11 pop-up – just as a more irritating one arrives to take its place\nGiving with one hand, taking with the other…\n- Windows 11 users are seeing a positive change, but also a less-welcome one\n- The good news is the 'second-chance out-of-box experience' nag has been streamlined considerably\n- The bad news is there's a new nag pop-up in the Start menu that pushes you towards taking out a OneDrive subscription\nMicrosoft has tidied up one annoyance with Windows 11, but sadly appears to have introduced another - and more vexing – irritation in its place.\nLet's start with the good news here, which Neowin flagged up and involves the 'second-chance out-of-box experience' (SCOOBE for short). That's fancy-talk for a nag screen that appears after booting to the desktop, trying to get you to configure elements of Windows 11 that you didn't bother with when setting up your PC originally.\nSetting up your Windows PC is known as the out-of-box experience (OOBE), as in you just got the device out of the box and turned it on – so this panel is essentially pushing this stuff on you again, in the hopes you might use the Windows Backup app, for instance (or switch to Edge).\nNow, as it exists currently, this SCOOBE nagging is a multi-panel affair that you have to click through (there are three panels, if my memory serves correctly).\nHowever, in a recent preview release in the Dev channel for Windows 11 (build 26200.5722), Microsoft has changed the SCOOBE so it's just a single panel, and you can dismiss it with one click.\nAt least now when it appears – and if you leave parts of Windows 11 setup unfinished it'll keep popping up every few months or so – it'll be more painless to swat aside.\nSo, that's something (vaguely) positive – but unfortunately Microsoft appears to have introduced a new nag in its place.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nWindows Latest noticed the new, more annoying, addition that has arrived in the Start menu of Windows 11 and consists of a pop-up that states: 'Action advised – back up your PC'.\nUnderneath that is some spiel about backing up your files, settings and so forth in the cloud, and if you click on the 'Continue' prompt Microsoft provides you'll be whisked off to Windows Backup. (And that backup app is facilitated by OneDrive – and with the low amount of free space included with Microsoft's cloud storage service, you'll almost certainly need a subscription, which is the crux of this prompt in terms of selling you something).\nAnalysis: SCOOBE Dooby don't\nSo, while this Start menu addition is a warning on the face of it, really it's just a way of trying to get you to take out a subscription with Microsoft. And while this could be a useful prompt to remind some people they need to back up their files, the problem is that others may well have already sorted out a backup via another app (or gone elsewhere in the cloud) – but if they've not used Microsoft's official channel, then they're going to get nagged to do so.\nAs Windows Latest makes clear, these prompts will likely keep appearing periodically – like the SCOOBE – and there's no way you can turn them off. That's because Microsoft has flagged this Windows Backup nag as a 'required' prompt, so it can't be avoided, unlike the SCOOBE, which you can actually switch off. (You can do so in Settings > System > Notifications > Additional Settings).\nIn my book, there should be no such thing as compulsory nags, and if you want to use Windows 11 without being pestered by a single pop-up along these lines, you should be able to tick a box to that effect. Interestingly, Windows Latest observes that with a test Windows 11 installation using an EU region, this alert didn't appear in the Start menu – so this change may not happen in Europe due to its data regulations (which are proving quite a boon in some ways).\nYou might also like...\n- Microsoft promises to crack one of the biggest problems with Windows 11: slow performance\n- Microsoft finally plays its trump AI card, Recall, in Windows 11 – but for me, it’s completely overshadowed by another new ability for Copilot+ PCs\n- Microsoft has all but given up on Windows 11 SE – and it looks like the war against Chromebooks has been lost\nDarren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013).\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/tag/windows-11",
      "text": "Windows 11\nLatest about Windows 11\nMicrosoft reveals a surprising catch to extended support for Windows 10 that's going to seriously annoy some people\nBy Darren Allan published\nMicrosoft has been cracking down on local accounts with Windows, and this could be seen as another push in that direction.\nMicrosoft's Gaming Copilot AI is now in Windows 11's Game Bar - and I can't decide whether this is a good or bad thing\nBy Darren Allan published\nMicrosoft's Gaming Copilot is now in Windows 11's Game Bar - and it looks nifty, but I'm worried about the AI on handhelds.\nMicrosoft finally fixes one frustrating Windows 11 pop-up – just as a more irritating one arrives to take its place\nBy Darren Allan published\nMicrosoft just minimized the annoyance with one Windows 11 nag – then put in a much worse one.\nMicrosoft teases the future of Windows: 'The computer will be able to see what we see, hear what we hear, and we can talk to it'\nBy Darren Allan published\nWindows in 2030 will be about sophisticated AI and voice commands according to a Microsoft executive's prediction.\nConfused about why you can't upgrade to Windows 11? Microsoft has some new advice that might help... including a trick I wasn't aware of\nBy Darren Allan published\nPreparing for your upgrade to Windows 11? Microsoft has some new advice that could be very handy.\nWindows 11's taskbar could be next for an AI overhaul – but I just don't see the point\nBy Darren Allan published\nWindows 11's taskbar could be infused with AI – but do we really need more AI agents in the OS?\nDon't trust Windows 11's Recall feature? A new report will only harden your resolve to never use the AI-powered search\nBy Darren Allan published\nRecall is under fire again as a report points out security slips that are distinctly worrying.\nValve's SteamOS is slowly but surely replacing Windows 11 for gaming, as more users make the big shift\nBy Isaiah Williams published\nSteamOS is growing in popularity for gamers, especially those using handhelds, and the new Steam Hardware & Software survey is indicative of that.\nSign up for breaking news, reviews, opinion, top tech deals, and more."
    },
    {
      "url": "https://www.techradar.com/tag/microsoft",
      "text": "Microsoft\nLatest about Microsoft\nNo, the ROG Xbox Ally won't launch during Gamescom – a new leak suggests its actual launch date is further away than we thought\nBy Isaiah Williams published\nA new leak has given a better insight into the ROG Xbox Ally's launch date, after a previous report revealed an August 20 pre-order date.\nMicrosoft urges users to be on alert following high-severity flaw in hybrid Exchange deployments\nBy Sead Fadilpašić published\nA bug allows crooks to move from on-prem to the cloud and wreak havoc.\nBest file manager of 2025\nBy Daryl Baxter last updated\nUpdated We list the best file managers, to make it simple and easy to organize your documents and folders and oversee batch file transfers.\nMicrosoft's new AI security tool can spot malware early - and even reverse engineer it to crack the code\nBy Benedict Collins published\nMicrosoft reveals super-smart AI tool to detect malicious files autonomously at scale.\nWindows XP Crocs are so real, we just can't stand it – but we love the Clippy Jibbitz\nBy Jacob Krol last updated\nYep, the Windows XP Crocs are real – dubbed the Microsoft 50th Exclusive Crocs, these take the iconic wallpaper as the main design, come with six Jibbitz, and a matching carrying tote.\nBest Linux distro of 2025\nBy Mayank Sharma last updated\nUpdated We list the best Linux distros, to make it simple and easy to choose which Linux OS is most suitable for users of varying expertise and for the range of functions required.\nThe Best Antivirus Software 2025\nBy Benedict Collins last updated\nUpdated We've tested and reviewed all the best antivirus available today, and ranked them here for your convenience.\nBest Firewall Software of 2025\nBy Benedict Collins last updated\nUpdated We've tested all the best firewall software, to help defend your computer or IT systems against unauthorized intrusions.\nSign up for breaking news, reviews, opinion, top tech deals, and more."
    },
    {
      "url": "https://www.techradar.com/computing/windows/microsoft-promises-to-crack-one-of-the-biggest-problems-with-windows-11-sluggish-performance",
      "text": "Microsoft promises to crack one of the biggest problems with Windows 11: slow performance\nFingers crossed for a suitably honed File Explorer experience\n- Microsoft is collecting more data on performance issues with Windows 11\n- This is happening via feedback from testers using preview builds\n- Hoovering up a whole lot more logs relating to performance hitches will hopefully help Microsoft stamp out sluggishness on the desktop\nMicrosoft has promised to improve Windows 11's overall performance levels, ensuring the operating system runs more nippily all round, and it'll use data from the PCs of testers to do this.\nWindows Latest spotted that in a new preview build in the Dev channel, Microsoft announced the scheme, which urges testers to report incidents of system sluggishness.\nMicrosoft informs us: \"As part of our commitment to improving Windows performance, logs are now collected when your PC has experienced any slow or sluggish performance. Windows Insiders are encouraged to provide feedback when experiencing PC issues related to slow or sluggish performance, allowing Feedback Hub to automatically collect these logs, which will help us root cause issues faster.\"\nEssentially, Microsoft is attempting to expand the quantity and scope of logs relating to performance issues that it's receiving, in order to better deal with speed-related niggles in Windows 11.\nThe logs pertaining to performance issues are stored in a temporary folder on the system drive, and Microsoft says they're only sent across to the company when the user submits feedback (via the Feedback Hub, where there's a new section for reports of 'system sluggishness').\nAnalysis: exploring new avenues of improvement\nThere have been a good few complaints about performance hiccups – or indeed more serious failings – with Windows 11, so it's good to see Microsoft launch a fresh initiative to help combat these issues (with any luck – the results, of course, remain to be seen).\nSluggish search functionality and wonkiness with File Explorer performing sub-optimally have been a couple of obvious problems that Windows 11 has caused for some users. Granted, not everyone has suffered from these kinds of woes, although I've certainly experienced File Explorer sluggishness on my Windows 11 laptop (but not on my desktop PC).\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nThese are frustrating issues to be faced with, given that they're key pieces of the interface which really shouldn't be going awry, and hopefully testers will get behind this effort, as it would be good for all concerned if Microsoft can get a better handle on improving the performance of Windows 11 for those who find it lacking (especially on older PCs – like my notebook, which is a venerable Surface model – where any shortcomings are more likely to be noticeable).\nFinally, it's worth making clear that data on incidents of sluggish performance is only being collected through preview builds of Windows 11, so those logs are just kept on the PCs of testers, not normal users of the release version of the OS.\nAnd, as noted, logs from testers are only sent to Microsoft voluntarily, so even if the data itself is collected automatically, it doesn't leave your drive until and unless you submit a feedback post.\nYou might also like...\n- Windows 11's handheld mode spotted in testing, and I'm seriously excited for Microsoft's big bet on small-screen gaming\n- No, Windows 11 PCs aren't 'up to 2.3x faster' than Windows 10 devices, as Microsoft suggests – here's why that's an outlandish claim\n- macOS Tahoe 26: here's everything you need to know about all the new features\nDarren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013).\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.windowscentral.com/microsoft/windows-10/microsoft-just-made-windows-10s-usd30-extended-support-program-an-even-better-deal-but-you-now-need-a-microsoft-account-to-pay-for-it",
      "text": "Microsoft Just Made Windows 10's $30 Extended Support Program an Even Better Deal — But You Need a Microsoft Account to Pay For It\nMicrosoft has confirmed that enrolling a Windows 10 PC into the Extended Security Updates program by paying $30 still requires a Microsoft Account, but that one ESU license covers up to 10 devices.\nMicrosoft has confirmed that paying $30 to enroll a Windows 10 PC into the Extended Security Updates (ESU) program will also require a Microsoft Account to complete the transaction. The good news is that one ESU license will cover up to 10 devices signed into the same account, meaning you don't need to pay $30 per device like originally thought. Strangely, this was not made clear in Microsoft's original announcement.\nThis is both good and bad news. It's good news as it means the $30 license is now much more reasonable, but bad news as it means you will still need to register a Microsoft Account to receive continued security updates beyond Windows 10's end of support date of October 14, 2025.\nOriginally, it sounded like the Microsoft Account requirement only applied to the free enrollment option when signing up for the ESU program. This method involves syncing your PC settings with OneDrive in exchange for free access to updates. Users thought they might be able to avoid registering a Microsoft Account by paying the $30 fee.\nBut now, the company has confirmed that all enrollment options require a Microsoft Account, regardless of if you're paying $30 or not. A Microsoft support document makes it abundantly clear:\n\"All enrollment options provide extended security updates through October 13, 2026. You will need to sign into your Microsoft account in order to enroll in ESU. You’ll be given these options to choose from when you enroll in the ESU program. You can use your existing ESU license on up to 10 devices.\"\nThe enrollment options the above mentions are as follows:\n- One-time purchase of $30 USD\n- 1,000 Microsoft Reward points\n- Free if you sync your PC settings to OneDrive\nThis news is likely going to upset many Windows 10 users who have avoided registering a Microsoft Account up until now. At the same time, this should appease those who are already using a Microsoft Account and have more than one device they need to protect.\nAll the latest news, reviews, and guides for Windows and Xbox diehards.\nIt appears that reason for this requirement is that it allows Microsoft to bind the ESU license to your Microsoft Account, enabling the ability for said license to be applicable on up to 10 devices. Whatever Windows 10 devices you sign into, the first 10 will be covered by that one $30 ESU license.\nMost consumers likely don't have 10 devices lying around that they need protecting with security updates, but it's nice to have the option for those that do. You will still need to manually enroll each PC into the ESU program, but you won't need to pay $30 each time.\nYou can enroll your Windows 10 PC from today\nThe window for enrolling Windows 10 PCs into the ESU program opened in July, and it's now slowly rolling out to all users on Windows 10 that are running the latest updates. You can enroll your PC into the ESU program by heading to Windows Update and clicking the \"Enroll now\" button that will appear there.\nIf you don't see the button just yet, don't worry. The enrollment process is rolling out in waves and so it might not have reached you just yet.\nHere are the steps to enroll your PC:\n- Go to Settings > Update & Security >Windows Update. If your device meets the prerequisites, you’ll see a link to enroll in ESU.\n- Once you select Enroll now you’ll start the ESU enrollment. If you are signed into Windows with a local account, you will be prompted to sign into your Microsoft account. If you are already backing up your PC Settings, you will see a prompt to enroll your device.\n- If you aren’t backing up your Windows settings, you can choose if you want to begin backing up your settings, redeem Rewards, or make a one-time purchase to enroll in ESU.\nWhat are your thoughts on Windows 10's ESU program? Let us know in the comments.\nThanks for the tip, Robert!\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/computing/windows/hate-windows-11-and-dont-want-to-upgrade-you-can-now-extend-the-life-of-windows-10-until-october-2026-heres-how",
      "text": "Hate Windows 11 and don't want to upgrade? You can now extend the life of Windows 10 until October 2026 – here's how\nFree updates for another year with Microsoft's ESU scheme\n- Windows 10's scheme for extended updates is now open\n- You can sign up using your Microsoft account and get free updates (if you sync your PC settings to OneDrive)\n- The enrollment wizard to access the scheme seems to still be rolling out, but you should see it very soon\nWindows 10 users can now sign up for extended updates, meaning security patches that are delivered past the end-of-support deadline to keep the PC safe.\nAs you're doubtless aware, it isn't long before Windows 10's End of Life arrives, when Microsoft officially stops supplying security updates (or feature updates for that matter). This happens on October 14, 2025, and after that date a PC without updates will potentially be open to exploits.\nThe Extended Security Updates (ESU) program allows for Windows 10 users to sign up for another year of updates, all the way through to October 2026, and enrollment for that scheme has now opened to consumers.\nIn a blog post (mostly pertaining to the most recent update for Windows 11, and the heap of new AI features therein), Microsoft explains that: \"Starting today, individuals will begin to see an enrollment wizard through notifications and in Settings, making it simple to select the best option for you and enroll in ESU directly from your personal Windows 10 PC.\"\nHow to enroll for the Extended Security Updates program\nAt this point you might be scratching your head and asking: so where is this enrollment wizard?\nAs Microsoft observes above, you may see a notification pop up in Windows 10 offering a link to sign up for the ESU scheme – and obviously you can use that if you see it. Otherwise, you can head to Windows Update (in Settings), where you should find a link to the same end, though you may have to bide your time.\nIn the Windows Update panel, you may see a link to 'enroll now' for Extended Security Updates either under where you check for updates (at the top), or with the links over on the right-hand side. I can't see this on my Windows 10 PC yet, but this YouTube video (from ThioJoe) shows where the links should be visible.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nThe reason why I can't see this is presumably because the rollout hasn't fully kicked off yet. As Microsoft says in the blog post, consumers will \"begin to see\" the enrollment wizard, meaning the rollout hasn't reached everyone yet. You may not see it either, and it's just a case of being patient – nobody should have long to wait at this point.\nWhatever the case, when you click to enroll, if you're not signed in to a Microsoft account, you must do so. This is because you'll need to register for the scheme, and also if you want to get the year of extra updates for free you'll need to be signed in to verify that you have synced your PC settings using the Windows Backup app.\nThat's the alternative way to enroll for the ESU, as opposed to paying a $30 fee (or using Microsoft Rewards points, which is a third option). Note that you don't have to use Windows Backup to actually make a full backup of your system to get free updates, you just need to sync your PC settings to OneDrive using this app, which seems a relatively small price to pay (compared to $30, certainly).\nThose who've already synced settings in this way will be able to click straight through and get the ESU offer for free with no fuss.\nAccording to YouTuber ThioJoe, it is possible to sign in to a Microsoft account to get the ESU on your PC, then switch away to a local account afterwards – and you'll still receive the additional updates throughout 2026 on that computer. Just in case you were curious about that tactic, it works – or so we're told, anyway.\nYou might also like...\n- Microsoft promises to crack one of the biggest problems with Windows 11: slow performance\n- Windows 11's handheld mode spotted in testing, and I'm seriously excited for Microsoft's big bet on small-screen gaming\n- No, Windows 11 PCs aren't 'up to 2.3x faster' than Windows 10 devices, as Microsoft suggests – here's why that's an outlandish claim\nDarren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013).\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/computing/windows/microsoft-offers-security-extension-on-windows-10-after-october-2025-but-itll-cost-you",
      "text": "Windows 10 diehards can keep their beloved OS secure for a little while longer (for a fee) as Microsoft pleas with them to be reasonable\nFor an extra $30, you'll be able to keep Windows 10 secure until October 2026\nWindows 10 is one of the most popular operating systems out there, and Microsoft is extending an olive branch of sorts to Windows 10 diehards who continue to resist the call to upgrade by offering Windows 10 users an additional year of security support, but it won't be free.\nIn a new blog post about the benefits of upgrading to Windows 11, of which there are several to be sure, Microsoft discloses that a new Extended Security Updates (ESU) program will be available for all users, not just enterprise or education users, unwilling or unable to upgrade to Windows 11 after support ends for the venerable OS on October 14, 2025.\nFor an additional $30, you'll be able to get security updates for Windows 10, but not any new features. Users will be able to enroll in the new ESU program later next year near the October 2025 end-of-support deadline.\nThe announcement of the new ESU program comes at the very end of the blog post, most of which is pretty much a hard sell on the benefits of switching to Windows 11, something that Microsoft has struggled to convince people to do.\nEveryday users will have an extended security option normally reserved for enterprise users\nEvery user's experience with Windows 11 will be different, but for many, the added hardware requirements and bad publicity around Windows 11 updates breaking some popular features of the OS have definitely played a part in customers' resistance to upgrading from Windows 10. The creation of the ESU program for all Windows 10 users, then, is both a recognition of that fact and a welcome development as far as customer service goes.\nNormally, extended security updates are reserved for organizations and enterprise customers who have a lot of interconnected systems that rely on a common OS to operate and so are very resistant to upgrading.\nPeople are typically shocked when they find out how many businesses, government agencies, and organizations are still using operating systems like Windows XP and Windows 7, but large companies and organizations build entire workflows, trainings, and bespoke software around these operating systems, and switching to a new operating system might have unforseeable consequences that can be very costly.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nAs such, Microsoft, Apple, and others typically offer these big customers long-term support programs where security updates are pushed out even if new features are not for a few years after general end-of-life support stops for more mainstream users.\nThis is the first time though that something similar is being offered to anyone willing to pay the $30 to keep Windows 10 secure for just a little while longer. Hopefully, this can be the start of a trend going forward for popular operating systems like Windows 10, as I'm sure many Windows 10 fans will gladly pay a small fee to keep using their preferred OS without risking their PC's security.\nYou might also like...\nJohn (He/Him) is the Components Editor here at TechRadar and he is also a programmer, gamer, activist, and Brooklyn College alum currently living in Brooklyn, NY.\nNamed by the CTA as a CES 2020 Media Trailblazer for his science and technology reporting, John specializes in all areas of computer science, including industry news, hardware reviews, PC gaming, as well as general science writing and the social impact of the tech industry.\nYou can find him online on Bluesky @johnloeffler.bsky.social"
    },
    {
      "url": "https://www.techradar.com/pro/windows-10-eol-heres-what-you-need-to-know-ahead-of-microsofts-end-of-support-deadline",
      "text": "Windows 10 EOL: Here's what you need to know ahead of Microsoft's end of support deadline\nHow to prepare for Microsoft’s end-of-support for Windows 10\nMicrosoft has announced that it will cease to provide support services for Windows 10 on October 14, 2025. Windows 10 was released in 2015 and quickly dominated the market. It is even more popular than the Windows 11 operating system released in 2021.\nUsers must prepare to upgrade or adjust as the Windows 10 end-of-support date nears. The end of support implies that Microsoft will stop providing security updates, technical assistance, and bug fixes for this operating system. Running Windows 10 afterward carries significant security and performance risks.\nThese editions will keep receiving Windows 10 updates until the end of the support date:\n- Windows 10 Home\n- Windows 10 Pro\n- Windows 10 Enterprise\n- Windows 10 Education\nAfter October 2025, only businesses using the Windows 10 LTSC (Long-Term Servicing Channel) version will continue receiving updates because of the extended lifecycle they paid higher prices for.\nLet’s dive deeper into understanding Windows 10 and what the imminent end of support means for this system.\nReader offer: Get a free trial on NinjaOne\nNinjaOne is an IT management platform where you can monitor, modernize, and streamline your operations with detailed analytics and a single dashboard. Professionally designed templates are available for document creation. You can discover assets connected to your IT network and monitor their usage in real-time.\nWhen was Windows 10 released?\nMicrosoft formally released Windows 10 on July 29, 2015. It was the direct successor to Windows 8.1, which Microsoft released two years earlier.\nWindows 10 dominated the PC market soon after its release. By March 2020, over one billion devices had it installed, making it the most popular Windows version worldwide. Windows 10’s PC market share peaked at over 80% in 2021, when Microsoft introduced the subsequent Windows 11. Despite the newer version, Windows 10 still retains a nearly 70% market share in 2024, while Windows 11 sits at 28%.\nSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!\nWindows 10 release cycle\nMicrosoft has added many updates since Windows 10’s initial release in 2015. The company began with semi-annual updates before transitioning to annual updates.\n- Version 1507 (Initial release) - July 29, 2015.\n- Version 1511\n- Version 1607\n- Version 1703\n- Version 1709\n- Version 1803\n- Version 1809\n- Version 1903\n- Version 1909\n- Version 2004\n- Version 21 H2.\n- Version 22 H2.\nEach version has a specific lifespan – Microsoft announces the end of support date with each release.\n| Version | End of support date |\n|---|---|\n| 1507 | May 9, 2017 |\n| 1511 | October 10, 2017 |\n| 1607 | April 10, 2018 |\n| 1703 | October 9, 2018 |\n| 1709 | April 9, 2019 |\n| 1803 | November 12, 2019 |\n| 1809 | May 12, 2020 |\n| 1903 | December 8, 2020 |\n| 1909 | May 11, 2021 |\n| 2004 | December 14, 2021 |\n| 21 H2 | June 13, 2023 |\n| 22 H2 | October 14, 2025 |\nMicrosoft released the final Windows 10 version (22 H2) in October 2022 and announced the OS's end-of-support date to be October 2025. After this date, most users have no choice but to upgrade to a higher version or choose another operating system like Linux or Chromebook.\nTransitioning from Windows 10\nAs the Windows 10 end-of-support date nears, the logical step is upgrading to Windows 11 if you want to stay plugged into the Microsoft ecosystem. Windows 11 is easy to use and understand. You’ll have no problems navigating it because it shares many similarities with its predecessor. However, you’ll notice that Windows 11 has better performance and some advanced features not available on Windows 10.\nUpgrading to the Windows 11 OS\nYou need these system requirements to install and use Windows 11:\n- Processors/CPUs: 1 GHz or faster with 2 or more cores.\n- RAM: At least 4 GB.\n- Storage: 64 GB or higher.\n- System Firmware: UEFI (Unified Extensible Firmware Interface) and Secure Boot capable.\n- Graphics Card: Compatible with DirectX 12 or later with WDDM 2.0 driver.\n- TPM: Trusted Platform Module (TPM) version 2.0.\n- Internet Connectivity and Microsoft Accounts: The initial setup requires internet connectivity and a Microsoft Account.\n- Display: High-definition (720p) display greater than 9 inches diagonally, 8 bits per color channel. A lesser screen size means you might not see the whole user interface.\nYour device must run Windows 10, version 2004 or later, to upgrade directly to Windows 11. Microsoft offers free updates if you meet this requirement. You can use the built-in PC Health Check app to see if your current PC qualifies for a direct Windows 11 upgrade.\nMigrating to other operating systems\nIf your hardware is not compatible with Windows 11, or you just prefer migrating to another operating system, you have several options:\n- Linux\n- macOS\n- ChromeOS\nLinux\nLinux is the most popular open-source desktop operating system. You can download it from the official website and install it on your PC. The main advantage is that it is very customizable, as the source code is available for users to modify. You can customize your PC’s look and interface much more than you can on a Windows OS.\nLinux is also very secure because of its architecture. It’s much more difficult for viruses to gain system-level access on Linux than on other operating systems. Even if a virus does gain this access, it’s easy to eliminate it.\nLinux's main drawback is its complexity. This OS is difficult to set up, especially for non-technical users. There’s no single organization responsible for support and updates, making it challenging to get technical help. Unlike Windows, where you can quickly contact the support team to get solutions, maintaining your Linux OS is mainly your responsibility.\nmacOS\nmacOS is the operating system for Mac laptops and desktops. This OS offers a stellar interface you can easily navigate. It’s easy to set up, and you enjoy frequent guidance and support from Apple’s team, similar to what Microsoft offers.\nThe drawback is that you need to buy a Mac laptop or desktop to use this operating system. Mac PCs are famously expensive, unlike Windows PCs, which have many budget-friendly options.\nChromeOS\nChromeOS is a Linux-based operating system created by Google for its Chromebook brand of laptops. This OS is unique because it uses the Google Chrome web browser as its principal user interface.\nChromeOS is an ideal choice if you mainly use web-based applications requiring little processing power. However, it doesn’t support heavy applications because of limited storage space and processing power—for example, you can’t run the full version of Microsoft Word, PowerPoint, and other Office tools with ChromeOS. Because of the limited storage space, almost everything is stored on the cloud, which puts ChromeOS at a competitive disadvantage compared to Windows and Linux.\nWindows 10 Edition differences\nWindows 10 comes in various editions, mainly:\n- Home\n- Pro\n- Enterprise\n- Education\nHome and Pro\nWindows 10 Home is the basic version designed for a general audience. Most people use it on their PCs, giving them access to relevant features like Cortana, Microsoft Edge, and Microsoft Office tools.\nWindows 10 Pro is an advanced version of the Home edition. It’s designed for businesses rather than individuals and has better security features. Windows 10 Pro comes with BitLocker device encryption, which lets users encrypt their disk drives to prevent theft or unauthorized access. It also has remote desktop functionality, allowing users to control another Windows PC remotely.\nLikewise, Windows 10 Pro allows users to join a domain or Azure Active Directory. The Professional edition is designed for business use, while the Home edition is intended for individual use.\nEnterprise\nThe Windows 10 Enterprise edition caters to the needs of midsize or large organizations. It has advanced security features to protect users against sophisticated malware. Companies get flexible deployment, support, and update options with Enterprise.\nWindows 10 Enterprise has everything you’ll find in the Pro version, plus the following:\n- Device Guard to prevent malicious code from running on a PC.\n- Applocker for companies to control the apps employees can access on their work PCs. IT administrators can block unknown or potentially harmful apps across all corporate PCs.\n- Credential Guard to isolate user credentials, like passwords, from the rest of the operating system. This feature helps prevent hackers from stealing sensitive credentials and breaking into a company’s network.\n- Windows Analytics to give companies valuable insights about the PCs connected to their network.\n- Virtualization tools that let users run virtual machines.\nEducation\nWindows 10 Education is tailored for schools and educational institutions. It includes the features in the Enterprise edition plus custom management controls that schools often request. For example, Windows 10 Education doesn't have Cortana, and school administrators can control what apps users can install on their PCs.\nWindows 10 security updates\nNo operating system is released completely free from security bugs. People discover new bugs regularly, and Microsoft releases security updates to fix such issues. The company has clarified that Windows 10 will receive security updates and patches until 14 October 2025.\nUpdates are the periodic fixes Microsoft releases to defend users against new threats and improve their PC's reliability.\nIn contrast, patches focus on specific bugs that people have identified. Microsoft releases patches to fix those flaws, often identified by third parties, and protect users from malicious threats.\nTo check if your Windows 10 OS needs an update, click Start > Settings > Update & Security > Windows Update and select Check for updates. If you see an update available, install it. You're using the latest version if you don’t see any available updates.\nAfter October 2025, most Windows 10 users will stop receiving security updates and new features. Only businesses on the long-term servicing channel (LTSC) plan will continue getting Extended Security Updates as they transition from Windows 10. They won’t get any new features or design changes, only security patches to protect them against cyber threats.\nWindows 10 end of support: impact on individuals & businesses\nThe end-of-life support for Windows 10 will significantly impact individual and business users.\nIndividual PCs running Windows 10 will continue working. However, the lack of ongoing security updates increases the risk profile of using such PCs. Demand for PCs without ongoing security updates will be low, so it’ll be more challenging to sell or swap devices incapable of upgrading to Windows 11. According to Canalys Research, Windows 10’s end of support could cause 240 million PCs to be disposed of.\nBusinesses must plan for hardware and software upgrades. If their current devices lack the hardware requirements for upgrading to Windows 11, companies have no choice but to buy more advanced PCs. They must also evaluate the benefits of Windows 11’s features against their needs.\nTechnical support for Windows 10 users will be limited after the end of support. Microsoft will stop providing official assistance for Windows 10 issues, except for helping users upgrade to Windows 11 or later versions. Hence, you should mark your calendar and start preparing to upgrade or migrate to another OS.\nPreparing for end-of-support\n- Regular updates: Ensure your PC gets all the available updates leading up to October 2025. This action keeps your PC as secure as possible as you work to upgrade or migrate.\n- Data backup: Back up your files frequently to avoid data loss when upgrading or migrating to another operating system.\n- Explore your options: Start shopping around for alternatives. If your device is compatible, we advise upgrading to Windows 11 to continue enjoying the features you're used to and get full updates and technical support.\n- Evaluate compatibility: The PC Health Check app can assess whether your device is eligible for a Windows 11 upgrade. If so, you can upgrade to Windows 11 for free. The average download size is 20 to 27 GB, but Microsoft requires at least 64 GB of free space for a successful upgrade.\nSupport resources for Windows 10 users post end-of-support\nMicrosoft will stop providing official assistance for Windows 10 issues post-October 2025, but users can still access some support resources to resolve their issues.\nThe Microsoft Support page contains extensive tutorials, user guides, and manuals concerning all Windows 10 features. These resources can help solve your issues when you can’t get official assistance.\nThe Microsoft Community forum has millions of daily users exchanging solutions to each other’s problems. You can ask questions on this forum and get good answers.\nThird-party websites like XDA Developers, WinBuzzer, and BleepingComputer keep you informed about Microsoft's changes and provide tutorials to solve many issues.\nStefan has always been a lover of tech. He graduated with an MSc in geological engineering but soon discovered he had a knack for writing instead. So he decided to combine his newfound and life-long passions to become a technology writer. As a freelance content writer, Stefan can break down complex technological topics, making them easily digestible for the lay audience."
    },
    {
      "url": "https://www.techradar.com/computing/windows/its-obvious-that-users-are-frustrated-consumer-rights-group-accuses-microsoft-of-not-providing-a-viable-solution-for-windows-10-users-who-cant-upgrade-to-windows-11",
      "text": "'It's obvious that users are frustrated': consumer rights group accuses Microsoft of not providing a 'viable solution' for Windows 10 users who can't upgrade to Windows 11\nPIRG believes Microsoft still isn't doing enough to help those stuck on Windows 10\n- Microsoft recently threw a lifeline to consumers, offering alternatives to paying $30 for extended support for Windows 10\n- PIRG thinks this doesn't go far enough in terms of avoiding an impending e-waste calamity\n- The organization suggests Microsoft considers providing longer-term support for Windows 10, or relaxes the spec requirements for Windows 11\nMicrosoft's recent lifeline to help those stuck on Windows 10 – due to not meeting the stricter hardware requirements for a Windows 11 upgrade – simply isn't enough, according to a consumer rights group.\nThe Register reports that it has spoken to Lucas Rockett Gutterman, who leads the Designed to Last campaign for the Public Interest Research Group (PIRG) in the US.\nAs you may be aware, PIRG has a mission to combat obsolescence and e-waste. The organization has previously levelled accusations at Microsoft of its Windows 11 requirements effectively shoving hundreds of millions of otherwise perfectly serviceable PCs into landfill, come the end of Windows 10 in October 2025. (The organization isn't alone in that, either.)\nYou may have seen that last week, Microsoft made a concession on this front. We've long known that one option for consumers will be to pay $30 for an additional year of security updates (something that's never been offered before), but now Microsoft just introduced some other choices too.\nInstead of forking out cash, you can elect to use the Windows Backup app to sync all your settings to the cloud (OneDrive). Alternatively, you can redeem 1,000 Microsoft Rewards points.\nHowever, Gutterman remains distinctly unimpressed with the new choices, telling The Register that: \"Microsoft's new options don't go far enough and likely won't make a dent in the up to 400 million Windows 10 PCs that can't upgrade to Windows 11.\"\nGutterman adds that: \"What [Microsoft hasn't] done is commit to automatically providing longer support for Windows 10 or loosening the hardware requirements for Windows 11.\"\nSign up for breaking news, reviews, opinion, top tech deals, and more.\n\"It's obvious that users are frustrated,\" Gutterman concludes. \"They feel yanked around and don't think this [latest] announcement provides a viable solution.\"\nAnalysis: thinking beyond a one-year extension\nTo be fair to Microsoft, I think that giving Windows 10 users a couple of new options to avoid paying $30 to keep security updates going for an extra year (through to October 2026) is actually a very positive move – especially because simply using the Backup app isn't a particularly hefty imposition.\nI can see where Gutterman is coming from with the points he makes, but the suggestion that Microsoft might consider loosening the system requirements for Windows 11 is, I feel, rather a waste of breath. That isn't going to happen at this point, and I think the software giant has been pretty clear on that.\nFor me, the key point raised is providing Windows 10 support beyond an extra year for consumers, and this is something I've been harping on for some time. While businesses can get a three-year program of extended security updates (if they want that much), so far Microsoft is only offering consumers a single year.\nPerhaps the software giant feels that this is enough, but it really isn't – not when it comes to keeping all those olds PCs off the scrapheap. Why isn't Microsoft looking at extending support for multiple years for consumers too, from an eco-friendly angle?\nJust a second additional year of support would be some welcome extra breathing room, even if Microsoft charged for it rather than offering any kind of alternative angle like using the Backup app. Of course, a non-paying option would be better. I'd even suggest making Windows 10 ad-supported to keep those security updates coming for two or three years.\nWhat do you mean that's already happened and ads are all over the place? Ahem – in all seriousness, I think allowing Microsoft to push more ad notifications (in a still limited fashion) within Windows 10 would be a compromise many would take, rather than paying extra to keep their non-Windows 11 compatible PC alive through to 2027 or 2028. At least suffering the adverts would have a plus side to it in this scenario, and if you can't stand the idea of yet more ads, you can stump up the $30.\nWhatever the case, I fully agree with PIRG that a one-year extension for consumers isn't good enough in terms of Microsoft's responsibilities towards preventing excessive e-waste – and hopefully the company will see the sense in further extended updates for consumers, too, not just businesses.\nYou might also like...\n- No, Windows 11 PCs aren't 'up to 2.3x faster' than Windows 10 devices, as Microsoft suggests – here's why that's an outlandish claim\n- Windows 11's hidden PC migration feature proves Microsoft isn't messing around when it comes to killing off Windows 10\n- Can’t upgrade to Windows 11? This Linux project wants to save your old PC from the scrapheap when Windows 10 support ends\nDarren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013).\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/computing/windows/windows-10-users-who-dont-want-to-upgrade-to-windows-11-get-new-lifeline-from-microsoft",
      "text": "Windows 10 users who don’t want to upgrade to Windows 11 get new lifeline from Microsoft\nWindows 10 won’t last forever\n- Microsoft has launched a wizard to help Windows 10 devices stay secure\n- It’s only intended as a temporary solution, though\n- Windows 10 support ends later this year\nWindows 10 has been around for almost a decade now, but official support is due to end on October 14 this year. Yet that doesn’t have to be the end of the road, as Microsoft has just announced a new process for anyone who needs a little more time to switch to Windows 11.\nThe updates are part of Microsoft’s Extended Security Updates (ESU) program, which brings monthly critical and important security patches to Windows 10 users for one year after official support ends. Microsoft says this is only meant to be a short-term solution, as it doesn’t include non-security updates or new features.\nWith today’s change, there are now a few new ways to get started. For individuals, there’s a new enrollment wizard that will give you three options: use Windows Backup to sync all your settings to the cloud; redeem 1,000 Microsoft Rewards points to get started; or pay a one-off fee of $30.\nAfter you’ve picked an option and followed the instructions, your Windows 10 PC will be enrolled. ESU coverage for personal computers lasts from October 15, 2025 until October 13, 2026. The enrollment wizard is currently available in the Windows Insider Program, made available to regular Windows 10 users in July, and will roll out on a wider basis in mid-August.\nTime to upgrade\nThe ESU changes aren’t just coming to individual Windows 10 users. Commercial organizations can pay $61 per device to subscribe to the ESU program for a year. This can be renewed annually for up to three years, although Microsoft warns that the cost will increase each year. Businesses can sign up today via the Microsoft Volume Licensing Program, while Cloud Service Providers will begin offering enrollment starting September 1.\nAs for Windows 10 devices that are accessing Windows 11 Cloud PCs via Windows 365 and virtual machines, these will be granted access to ESU free of charge and will receive security updates automatically, with no extra actions required.\nIn a way, Microsoft’s announcement highlights the struggles the company has had with getting people to upgrade to Windows 11. Microsoft first announced that it would kill off Windows 10 way back in June 2021, and yet there are still people and organizations that have not made the switch, despite many years of prompts and warnings.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nFor some people – especially those with mission-critical devices or large fleets of computers – upgrading to Windows 11 might be a herculean task. But if you’re able to make the switch, you really should do so to ensure you keep getting all the latest updates. We’ve even got a guide on upgrading to Windows 11 to help you through the process.\nYou might also like\n- Windows 10 diehards can keep their beloved OS secure for a little while longer (for a fee) as Microsoft pleas with them to be reasonable\n- Windows 10 has a year left to live – but are users prepared to upgrade to Windows 11?\n- Windows 10 goes dark in 6 months, yet shockingly, many businesses haven't even got a plan to upgrade\nAlex Blake has been fooling around with computers since the early 1990s, and since that time he's learned a thing or two about tech. No more than two things, though. That's all his brain can hold. As well as TechRadar, Alex writes for iMore, Digital Trends and Creative Bloq, among others. He was previously commissioning editor at MacFormat magazine. That means he mostly covers the world of Apple and its latest products, but also Windows, computer peripherals, mobile apps, and much more beyond. When not writing, you can find him hiking the English countryside and gaming on his PC.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/computing/windows/it-only-took-four-years-but-windows-11-is-now-the-most-popular-desktop-os-and-time-is-running-out-for-windows-10",
      "text": "It only took four years, but Windows 11 is now the most popular desktop OS - and time is running out for Windows 10\nThe support deadline for Windows 10 is close now - but there isn't the same sense of urgency to upgrade that there once was\n- Windows 11 has finally overtaken Windows 10 for market share\n- 52% of those using Microsoft's desktop operating systems are now on Windows 11\n- That's a hefty swing of almost 10% away from Windows 10\nAt long last, Windows 11 is present on more PCs globally than Windows 10, at least according to one set of figures from an analytics firm.\nStatCounter provided fresh statistics for July which show that Windows 11 has accelerated to account for 52% of all Windows versions worldwide, leaving Windows 10 in its wake on 44.59%.\nThat's quite a shift from the previous month where Windows 10 remained just in the lead on 48.76% with Windows 11 on 47.98%. So, Windows 11 was not far off a full percentage point behind in June, but is now in the lead by 7.4%, a swing of near 10%.\nCould this be the start of a mass exodus of Windows 10 stalwarts fleeing for the shores of Windows 11? Well, that can't be ruled out, and it's clear that time is running short when it comes to the looming deadline for the end of support for Windows 10, which is October 2025 - which is only three months away now.\nHowever, I'm not convinced that there will be a stampede of migrators, because while I've argued in the past that you should be making the upgrade to Windows 11 early - assuming you can (due to your PC's spec) - there's no longer quite the same sense of urgency in this matter.\nWhy not? Let's go over that next.\nAnalysis: Support and scrapheaps\nSomething changed with Windows 10's extended support program for consumers recently, and it's worth recapping in case you missed it. Microsoft decided to offer an alternative to the $30 fee that was previously required to get an extra year of security updates for Windows 10 (through to October 2026).\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nSo, instead of stumping up that cash, you can now elect to have the Windows Backup app sync all your PC's settings to the cloud. If you allow that to happen - via signing in with a Microsoft Account - then you can get the extra year of all-important security updates at no cost. This gives you a lot more breathing space to work out what you might want to do next, which is great for those who can't upgrade to Windows 11 due to its loftier system requirements (or those who simply refuse).\nOf course, 'free' is not usually completely free, and the cost here, as it were, is allowing your settings to be synced. Due to this, some online commenters have accused Microsoft of almost a kind of 'blackmail' in terms of getting access to your data. However, I should note that the wording of Microsoft's offer is important here, and you're not syncing all your personal data to OneDrive or anything - all you have to sync are your Windows settings.\nAnd having those settings synced should help in the future, too, if you want to make the transition to Windows 11 (or the following version of Windows) at a later date on a new PC. Microsoft's hope, it seems, is this will make that transition easier, and so folks are therefore more likely to tread that path.\nI don't think there's any underlying motive from Microsoft here to get its claws into your personal data as some are suggesting, so in my book, this all seems fair enough. If you're not convinced, however, that's equally fair - you don't have to take Microsoft up on this option. You can pay instead (or redeem 1,000 Microsoft Rewards points, if you have them, which is another alternative), or just go ahead and switch from Windows 10 come its End of Life in October 2025.\nWhatever you do, don't stay on Windows 10 without security updates - never mind worrying about Microsoft's nose potentially being in your data, a hacker could really make your life a misery by compromising your PC due to an unpatched vulnerability because your system doesn't have security updates.\nTaking a broader perspective, I've half-convinced myself that Microsoft may even offer more than a year of additional support to consumers (in the same way it treats businesses).\nMainly because this new Windows Backup-related offer has come in at the last minute, largely I suspect to assuage some of the fears of the 'towering scrapheap of Windows 10 PCs' activists who are (rightly) concerned about the environmental impact of Microsoft's Windows 11 system requirements. (Those that prevent a lot of would-be upgraders from moving to the newer OS, due to having an older CPU, or the lack of a specific security feature, TPM 2.0).\nAnd so I don't think it's unimaginable that Microsoft might offer a second year of extended support for consumers, and I very firmly believe the company should do so. We shall see, but for now, with an extra year of support on the table for free (effectively), there's no need to rush to abandon Windows 10 for many folks. Not unless your trust in Microsoft is particularly low, or you don't have a Microsoft account and don't want to sign up for one (to sync your settings).\nThere are, of course, other options aside from Windows - the main one being a switch to Linux. Of course, in that case, you need to be prepared to leave Microsoft's ecosystem and put up with some of the limitations that one of the best Linux distros will come with (mainly around compatible software, particularly PC games).\nMeanwhile, we can expect further spikes in adoption for Windows 11 in the near future, although perhaps not to the same extent that some people might expect, given those extra choices Microsoft has just introduced.\nYou might also like...\n- No, Windows 11 PCs aren't 'up to 2.3x faster' than Windows 10 devices, as Microsoft suggests – here's why that's an outlandish claim\n- macOS Tahoe 26: here's everything you need to know about all the new features\n- Can’t upgrade to Windows 11? This Linux project wants to save your old PC from the scrapheap when Windows 10 support ends\nDarren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013).\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/computing/windows/microsoft-has-all-but-given-up-on-windows-11-se-and-it-looks-like-the-war-against-chromebooks-has-been-lost",
      "text": "Microsoft has all but given up on Windows 11 SE – and it looks like the war against Chromebooks has been lost\nSurface Laptop SE owners may well be confused here, too - with good reason\n- Microsoft has said Windows 11 SE will run out of support in October 2026\n- This brings an end to this alternative spin on Windows 11\n- However, Surface Laptop SE owners were previously promised a longer timeframe of support for their devices\nMicrosoft has announced that it's dropping support for Windows 11 SE in just over a year's time, leaving buyers of low-cost laptops running this spin on its OS in the lurch - and admitting defeat with this most recent initiative to take on Google's Chromebooks.\nIf you're unfamiliar with Windows 11 SE, it was designed as a (kind of) lightweight version of the desktop operating system. It was preinstalled on affordable laptops that were priced to do well in the education sector, trying to take a piece of the pie that Chromebooks dominate (SE seemingly stood for Student or School Edition).\nWindows Central reports that Microsoft announced via its Learn portal that Windows 11 SE support is being shuttered in October 2026.\nThe company said: \"Microsoft will not release a feature update after Windows 11 SE, version 24H2. Support for Windows 11 SE - including software updates, technical assistance, and security fixes - will end in October 2026. While your device will continue to work, we recommend transitioning to a device that supports another edition of Windows 11 to ensure continued support and security.\"\nSo, you won't be provided with Windows 11 25H2 later this year on your SE device, if you own one - version 24H2 is as far down the line as you'll get, and all updates will cease full-stop in just over a year.\nAnalysis: Silly Ending for a Student Edition?\nMicrosoft has been trying to take on Google's Chromebooks for a long time now, including efforts such as Windows 10X - which badly misfired and ended up being canned before it even arrived. Windows 11 SE was the most recent effort, emerging late in 2021, and it was showcased by Microsoft in its Surface Laptop SE. However, as we observed in our review of that machine, there was a problem here - the performance level of the notebook was rather poor.\nThe simple truth about Windows 11 SE is that while it was supposed to be a streamlined operating system for low-cost devices, this variant of the desktop OS was still too unwieldy. There just wasn't enough emphasis on trimming down Windows 11 so it performed better.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nIndeed, much of the thrust of Windows 11 SE was about simplifying the computing experience for students - the interface, and locking the system to only admin-approved apps, plus cloud services - rather than actually streamlining the operating system so it ran well on lesser hardware. And let's be honest, the latter was the whole point, really, at least in terms of making affordable laptops to rival cheap Chromebooks (which run very slickly indeed, despite their low cost).\nSo, all in all, it's not surprising to see Microsoft shutter this effort in this manner. What is surprising, though, is how owners of Windows 11 SE machines, like the Surface Laptop SE, have now been left in the lurch by this announcement that support is being killed in a year.\nAs Neowin, which also picked up on this move, points out, the Surface Laptop SE has an end-of-service date (for firmware and drivers) of January 11, 2028. But with Microsoft now having revealed that Windows 11 SE won't be going on beyond October 2026, that's cutting this support window (pun not intended) short by over a year.\nThose who own a Surface Laptop SE, who thought they were good for another couple of years, have effectively now been told they're going to be a year shorter on support. If Microsoft promised support for this showcase laptop through to 2028, then why not extend support for the dedicated OS it runs to that date, too? Strong-arming folks into moving early hardly seems fair here.\nIt seems an odd decision to make, and one that won't endear Microsoft to some people. Indeed, when it comes to Microsoft's next big shot at taking on Chromebooks - if there is one - those in the education sector might remember what's happened here, and be less trusting of new ideas from the software giant.\nFor those who do have a laptop running Windows 11 SE, and now need to plan on switching away sooner from that OS, maybe to a different flavor of Windows 11, this is possible, albeit somewhat problematic in some reported cases. Going by this Reddit thread, if you're running into trouble in this endeavor, you may want to try turning off Secure Boot in the laptop's BIOS to get a working installation of Windows 11 Home or Pro on an SE machine (you can switch the feature back on afterwards, apparently).\nYou might also like...\n- Fed up with your mouse cursor supersizing itself randomly in Windows 11? Thankfully this frustrating bug should now be fixed\n- Microsoft promises to crack one of the biggest problems with Windows 11: slow performance\n- No, Windows 11 PCs aren't 'up to 2.3x faster' than Windows 10 devices, as Microsoft suggests – here's why that's an outlandish claim\nDarren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013).\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    }
  ],
  "argos_summary": "Microsoft has announced that to enroll in the Extended Security Updates (ESU) program for Windows 10, users must have a Microsoft account, even if they opt to pay the $30 fee for an additional year of security updates. This requirement has frustrated many users who prefer local accounts, as it ties the ESU license to the Microsoft account, allowing coverage for up to 10 devices. Despite the backlash, the ESU program offers a way for Windows 10 users to continue receiving critical security updates until October 2026.",
  "argos_id": "SYY2HI8AB"
}