{
  "url": "https://www.usmagazine.com/celebrity-news/news/tom-hanks-pays-tribute-to-jim-lovell-after-apollo-13-astronauts-death/",
  "authorsByline": "Erin Doyle",
  "articleId": "69c36a9e5ff54eddaefac708a6b557da",
  "source": {
    "domain": "usmagazine.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.usmagazine.com/wp-content/uploads/2025/08/Tom-Hanks-Pays-Tribute-to-Apollo-13-Astronaut-Jim-Lovell-After-Death.jpg?crop=49px%2C0px%2C1885px%2C988px&resize=1200%2C630&quality=86&strip=all",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T21:07:49-04:00",
  "addDate": "2025-08-09T01:11:42.867735+00:00",
  "refreshDate": "2025-08-09T01:11:42.867737+00:00",
  "score": 1.0,
  "title": "Tom Hanks Pays Tribute to Jim Lovell After Apollo 13 Astronaut’s Death",
  "description": "Tom Hanks honored late Apollo 13 astronaut Jim Lovell in an emotional post reflecting on his achievements and inspiring space missions",
  "content": "Tom Hanks paid tribute to Apollo 13 astronaut Jim Lovell in a touching Instagram post following the space explorer’s death at age 97.\n\nThe astronaut, who Hanks portrayed in the 1996 film, Apollo 13, died on Thursday, August 7. The actor reflected on Lovell’s achievements via the social media post.\n\n“There are people who dare, who dream, and who lead others to the places we would not go on our own. Jim Lovell, who for a long while had gone farther into space and for longer than any other person of our planet, was that kind of guy,” Hanks, 69, wrote.\n\nHe added, “His many voyages around Earth and on to so-very-close to the moon were not made for riches or celebrity, but because such challenges as those are what fuels the course of being alive – and who better than Jim Lovell to make those voyages. On this night of a full Moon, he passes on – to the heavens, to the cosmos, to the stars.”\n\nHanks concluded the post, “God speed you, on this next voyage, Jim Lovell.”\n\nLovell was famous for being the commander in the Apollo 13 space mission, which almost turned fatal during an attempt to land on the moon in 1970. After an oxygen tank exploded en route, Lovell and his crewmates, Fred Haise, and Jack Swigert, were forced to abandon their moon mission and focus their efforts on the difficult task of returning to earth safely.\n\nTheir harrowing journey became the inspiration behind the Ron Howard-directed movie which starred Hanks as well as Kevin Bacon and Bill Paxton.\n\nLovell’s family confirmed via a statement on Friday that the astronaut died in Illinois earlier this week.\n\nTom Hanks and Rita Wilson have proven for decades that Hollywood romances can stand the test of time. According to Hanks, it was love at first sight when it came to his eventual wife — even if he didn’t meet her until years after he first saw her. Wilson made her TV debut on the […]\n\n“We are saddened to announce the passing of our beloved father, USN Captain James A. ‘Jim’ Lovell, a Navy pilot and officer, astronaut, leader, and space explorer,” Lovell’s family said in the statement shared with multiple outlets. “We are enormously proud of his amazing life and career accomplishments, highlighted by his legendary leadership in pioneering human space flight.”\n\nThe statement continued, “But, to all of us, he was dad, granddad, and the leader of our family. Most importantly, he was our hero. We will miss his unshakeable optimism, his sense of humor, and the way he made each of us feel we could do the impossible. He was truly one of a kind.”",
  "medium": "Article",
  "links": [
    "https://www.usmagazine.com/celebrity-moms/pictures/kelly-clarksons-ex-brandon-blackstocks-family-guide-photos/",
    "https://www.usmagazine.com/celebrities/tom-hanks/",
    "https://lvnta.com/lv_m3tq9XCZYRxUZbugjc",
    "https://www.usmagazine.com/celebrity-news/news/brandon-blackstocks-daughter-revealed-pregnancy-before-dads-death/",
    "https://www.instagram.com/p/DNHC2-OyXXG/?utm_source=ig_embed&utm_campaign=loading",
    "https://news.google.com/publications/CAAqBwgKMM7UwQEwjJAU?hl=en-US&gl=US&ceid=US%3Aen",
    "https://apple.news/TdBoH5or6Q0afHo2MxaGA6A",
    "https://www.usmagazine.com/celebrity-news/news/kelly-clarkson-protected-ex-brandon-blackstock-before-death/",
    "https://www.usmagazine.com/celebrity-news/pictures/tom-hanks-and-rita-wilsons-relationship-timeline-photos/",
    "https://www.usmagazine.com/celebrity-news/news/only-a-few-in-kelly-clarksons-circle-knew-of-brandon-blackstocks-cancer/",
    "https://www.instagram.com/p/DNHC2-OyXXG/",
    "https://www.usmagazine.com/celebrity-news/news/kelly-clarksons-ex-husband-brandon-blackstock-dead-at-48/",
    "https://www.usmagazine.com/celebrity-news/pictures/tom-hanks-through-the-years-his-life-in-photos/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Jim Lovell",
      "weight": 0.10696244
    },
    {
      "name": "Lovell",
      "weight": 0.09096225
    },
    {
      "name": "Tom Hanks",
      "weight": 0.08612934
    },
    {
      "name": "Hanks",
      "weight": 0.079310924
    },
    {
      "name": "space explorer",
      "weight": 0.077310376
    },
    {
      "name": "Apollo 13 astronaut Jim Lovell",
      "weight": 0.072117046
    },
    {
      "name": "human space flight",
      "weight": 0.07116771
    },
    {
      "name": "space",
      "weight": 0.0691769
    },
    {
      "name": "astronaut",
      "weight": 0.0611803
    },
    {
      "name": "Apollo",
      "weight": 0.05794151
    }
  ],
  "topics": [
    {
      "name": "Space"
    }
  ],
  "categories": [
    {
      "name": "Science"
    },
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.8935546875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.837890625
    },
    {
      "name": "/Arts & Entertainment/Online Media/Online Image Galleries",
      "score": 0.358154296875
    }
  ],
  "sentiment": {
    "positive": 0.29760742,
    "negative": 0.30151367,
    "neutral": 0.40063477
  },
  "summary": "Tom Hanks has paid tribute to Apollo 13 astronaut, Jim Lovell, who died at age 97 following his death. Hanks praised Lovell's achievements in a touching Instagram post following his passing. Lovell was the commander in the Apollo 13 space mission, which almost ended in an accident during an attempt to land on the moon in 1970. The astronauts' journey was the inspiration behind the Ron Howard-directed movie, Apollo 13. Lovello's family confirmed their loss in a statement on Friday.",
  "shortSummary": "Tom Hanks praised astronaut Jim Lovell’s pioneering achievements in space, including Apollo 13 and his iconic role in the film, in a tribute on Instagram.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "b02e6a9bff204c7694dd523b66565c1f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/brandon-blackstocks-daughter-revealed-pregnancy-before-dads-death/",
      "text": "Savannah Blackstock Lee, daughter of Brandon Blackstock, announced she was pregnant with her second baby just one month before Blackstock’s death at age 48.\n“We’ve been keeping a couple sweet surprises,” Lee, 23, wrote in July via her Instagram account, which has since gone private. “One little girl will be making her arrival at the beginning of January and another beautiful girl named Julianna who has already been one of the greatest blessings to our family.”\nShe continued, “The Lord has been so faithful. He’s written a story we never could’ve imagined, and His kindness in this season has left us in awe. He’s answered prayers we never even knew how to pray. This journey has been so special full of peace, excitement, and so much grace. We’re growing again, and our hearts are so full. Thank you, Jesus. 🤍”\nSavannah and husband Quentin Lee are also parents of son Lake, 3. She is the daughter of Blackstock and Melissa Ashworth, who were married from 2001 to 2012. The pair also share son Seth, 19.\nBlackstock, the ex-husband of singer Kelly Clarkson, died on Thursday, August 7, after a three-year battle with cancer.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away. Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family,” a rep for the family told Us Weekly in a statement. “We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time.”\nNews of his death came one day after Clarkson, 43, announced her decision to pause her Las Vegas residency, saying Blackstock was sick, though she did not provide further details.\n“Unfortunately, I need to postpone the remainder of the August Studio Session dates in Las Vegas,” she said in a statement shared via Instagram on Wednesday, August 6. “While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them. I am sincerely sorry to everyone who bought tickets to the shows and I so appreciate your grace, kindness and understanding.”\nClarkson and Blackstock began dating in 2012, tying the knot in October 2013. They later welcomed daughter River in June 2014 and son Remington in April 2016. Clarkson filed for divorce in 2020, and their split was finalized in 2022 as Clarkson was granted primary custody of River and Remington.\nBlackstock had not been seen in public since the divorce, last appearing with Clarkson on the red carpet at the Critics’ Choice Awards in January 2020. Amid their separation, Blackstock relocated to Montana where he founded the local Valley View Rodeo."
    },
    {
      "url": "https://news.google.com/publications/CAAqBwgKMM7UwQEwjJAU?hl=en-US&gl=US&ceid=US%3Aen",
      "text": "- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nBefore you continue to Google\nWe use cookies and data to\n- Deliver and maintain Google services\n- Track outages and protect against spam, fraud, and abuse\n- Measure audience engagement and site statistics to understand how our services are used and enhance the quality of those services\nIf you choose to “Accept all,” we will also use cookies and data to\n- Develop and improve new services\n- Deliver and measure the effectiveness of ads\n- Show personalized content, depending on your settings\n- Show personalized ads, depending on your settings\nIf you choose to “Reject all,” we will not use cookies for these additional purposes.\nNon-personalized content is influenced by things like the content you’re currently viewing, activity in your active Search session, and your location. Non-personalized ads are influenced by the content you’re currently viewing and your general location. Personalized content and ads can also include more relevant results, recommendations, and tailored ads based on past activity from this browser, like previous Google searches. We also use cookies and data to tailor the experience to be age-appropriate, if relevant.\nSelect “More options” to see additional information, including details about managing your privacy settings. You can also visit g.co/privacytools at any time."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/pictures/tom-hanks-and-rita-wilsons-relationship-timeline-photos/",
      "text": "Tom Hanks and Rita Wilson have proven for decades that Hollywood romances can stand the test of time.\nAccording to Hanks, it was love at first sight when it came to his eventual wife — even if he didn’t meet her until years after he first saw her. Wilson made her TV debut on the Brady Bunch in 1972, as Pat Conway, which is when the actor first fell for her.\n“Oh, every now and again I just pull it up in YouTube. All of the stuff that she was in,” Hanks told The Knot and other reporters in 2016. “I was actually at a friend of mine’s house when that aired and remember thinking, ‘That girl is cute.’”\nAfter meeting on the set of Bosom Buddies in 1981, sparks between the two could instantly be seen. At the time, Hanks was married to his college school sweetheart, Samantha Lewes. When the pair reunited to film Volunteers in 1984, their chemistry was undeniable and a relationship between the two followed — after the Splash actor’s marriage broke apart a few years later.\nAlthough his divorce wasn’t finalized until 1987, Hanks and Wilson took their relationship public in 1986. On April 30, 1988, the pair tied the knot,\nScroll below to see how Hanks and Wilson’s relationship has evolved over the years."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/kelly-clarksons-ex-husband-brandon-blackstock-dead-at-48/",
      "text": "Kelly Clarkson’s ex-husband, Brandon Blackstock, died on Thursday, August 7. He was 48.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away. Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family,” a rep for the family said in a statement to Us Weekly. “We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time.”\nOne day earlier, while explaining her decision to halt her Las Vegas residency, Clarkson revealed that Blackstock was suffering from an illness, though she did not specify the exact condition at the time.\n“Unfortunately, I need to postpone the remainder of the August Studio Session dates in Las Vegas,” she said in a statement shared via Instagram on Wednesday, August 6. “While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them. I am sincerely sorry to everyone who bought tickets to the shows and I so appreciate your grace, kindness and understanding.”\nPrior to his relationship with Clarkson, Blackstock was married to Melissa Ashworth from 2001 to 2012. The pair welcomed daughter Savannah in June 2002 and son Seth in November 2006. (Blackstock later became a grandfather in January 2022 when Savannah gave birth to her first baby, son Lake, with Quentin Lee. She announced in July 2025 that she is pregnant with the couple’s second baby.)\nClarkson and Brandon — whose father was her former manager Narvel Blackstock — began dating in February 2012 and tied the knot one year later in October 2013. The pair welcomed daughter River in June 2014 and son Remington in April 2016. During their marriage, Brandon served as Clarkson’s manager.\nIn June 2020, Clarkson filed for divorce from Brandon after nearly seven years of marriage. The exes finalized the proceedings in March 2022, and Clarkson was granted primary custody of their two children. (The twosome had a messy battle in court over property and finances.)\nIn January 2024, Clarkson reflected on her divorce from Brandon, revealing that their marriage was not her idea.\n“I never wanted to get married the first time,” she told People. “[Brandon] had children, a religious background, and it was important, I think, for him. But I’ve never been that person.”\nClarkson explained that her hesitancy stemmed from what she’d seen her loved ones deal with, adding, “Because I’ve been through a couple divorces in my family, I just don’t like to put any weight on it.”\nIn March, Clarkson shared a rare glimpse into her coparenting dynamic with Brandon during an appearance on Kylie Kelce’s “Not Gonna Lie” podcast.\nWhile discussing kids’ double standards for their mothers and fathers, she sarcastically confessed, “There’s a lot that I keep in … because coparenting is fun.”\nBlackstock is survived by River and Remington and his two older children, Savannah and Seth."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/only-a-few-in-kelly-clarksons-circle-knew-of-brandon-blackstocks-cancer/",
      "text": "Kelly Clarkson has put her family first amid ex-husband Brandon Blackstock’s private cancer battle, with a source shedding light into how she’s been coping.\n“Kelly’s work schedule has been difficult over the last few months as she needed to take care of her kids,” a source exclusively tells Us Weekly. “She needed the time off as her kids come first. It’s terrible and sad.”\nClarkson, 43, and Blackstock shared daughter River Rose, 10, and son Remington, 8.\n“Kelly is a great mom and has needed to be there for her kids,” the insider adds, noting that “only a few people in Kelly’s circle” and “a handful of her show’s team” were aware of “what was going on behind the scenes” with Blackstock.\nUs confirmed on Thursday, August 7, that Blackstock died at the age of 48.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away,” a family spokesperson said in a statement. “Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family.”\nThe statement concluded, “We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time.”\nIn addition to River Rose and Remington, Brandon is survived by father Narvel Blackstock, eldest children Savannah and Seth from his first marriage, and his grandchildren. (Savannah announced last month that she is expecting her second baby with husband Quentin Lee.)\nClarkson postponed the remainder of her August concert dates in light of Brandon’s death.\n“Unfortunately, I need to postpone the remainder of the August Studio Session dates in Las Vegas,” Clarkson wrote in a Wednesday, August 6, statement shared via social media. “While I normally keep my personal life private, this past year, my children’s father has been ill and, at this moment, I need to be fully present for them. I am sincerely sorry to everyone who bought tickets to the shows, and I so appreciate your grace, kindness and understanding.”\nClarkson, who started her Studio Sessions residency in Las Vegas in July, was married to Brandon from 2013 to 2020. They settled their divorce two years later in 2022 with plans to amicably raise River and Remington.\n“She has a great coparenting relationship with Brendan, but things haven’t always been easy in terms of their personal relationship,” a second source told Us in 2023. “They’ve come a long way and are handling things with their kids really well.”"
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/kelly-clarkson-protected-ex-brandon-blackstock-before-death/",
      "text": "Kelly Clarkson kept her children front of mind while navigating her late ex-husband Brandon Blackstock‘s secret cancer battle, a source exclusively tells Us Weekly.\n“Even though they went through an acrimonious divorce, Kelly made a conscious decision to protect Brandon’s privacy until the very end for the sake of their family,” the source explains.\n“He’d been sick for a while, but his health really took a turn for the worse earlier this year. That’s why she was MIA from her talk show,” the source continues, referencing Clarkson’s unexplained two-week absence from The Kelly Clarkson Show in late February and early March. “Out of respect, Kelly chose not to say anything publicly until it became clear this week that Brandon wasn’t going to make it.”\nUs Weekly has reached out to Clarkson’s rep for comment.\nBlackstock died on Thursday, August 7, just hours after Clarkson, 43, revealed in a social media post that he had been sick. He was 48.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away,” a rep for the Blackstock family said in a statement to Us. “Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family. We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time.”\nThe night before, Clarkson announced she had to postpone the next four dates of her Las Vegas residency, Studio Sessions, due to Blackstock’s health issues, though she did not disclose what kind of illness he had.\n“While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them,” she wrote, referencing the former couple’s 11-year old daughter, River Rose, and 9-year-old son, Remington “Remy” Alexander.\n“I am sincerely sorry to everyone who bought tickets to the shows,” the American Idol alum continued, “and I so appreciate your grace, kindness and understanding.”\nClarkson and Blackstock married in October 2013. They welcomed River and Remy in June 2014 and April 2016, respectively. (The former talent manager also shared 23-year-old daughter Savannah and 18-year-old son Seth with his ex-wife Melissa Ashworth.)\nAfter nearly seven years of marriage, Clarkson filed for divorce from Blackstock in June 2020. She was awarded primary physical custody of their kids that November while the exes continued to battle in court over other issues, including child and spousal support as well as ownership of their Montana ranch. They ultimately finalized their divorce in March 2022.\nBy that May, Clarkson swore off remarrying, saying on her talk show, “I will never get married again. Not because I don’t believe in love. I think love is beautiful. I just … that didn’t suit me.”"
    }
  ],
  "argos_summary": "Tom Hanks honored Apollo 13 astronaut Jim Lovell, who passed away at 97, in an emotional Instagram tribute, reflecting on Lovell's significant contributions to space exploration. Lovell, known for his leadership during the near-fatal Apollo 13 mission, was remembered by his family as a beloved father and hero. In a separate report, Kelly Clarkson's ex-husband Brandon Blackstock died at 48 after a battle with cancer, prompting Clarkson to postpone her Las Vegas residency to focus on her children during this difficult time.",
  "argos_id": "T0K0MYGNU"
}