{
  "url": "https://www.nytimes.com/athletic/6543348/2025/08/08/chargers-trey-pipkins-rashawn-slater-injury/",
  "authorsByline": "Daniel Popper",
  "articleId": "f6ff44480d324c7990dab70d7709b54a",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/08204133/AP25214277497869-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-09T00:52:24+00:00",
  "addDate": "2025-08-09T00:57:05.396797+00:00",
  "refreshDate": "2025-08-09T00:57:05.396800+00:00",
  "score": 1.0,
  "title": "After Rashawn Slater’s injury, Trey Pipkins is now a fulcrum in Chargers season",
  "description": "Pipkins has experience at right tackle and Chargers coach Jim Harbaugh says he has \"all the confidence in the world\" in him.",
  "content": "EL SEGUNDO, Calif. — As a rookie last year, Los Angeles Chargers right tackle Joe Alt leaned on left tackle Rashawn Slater. Alt was finding his way in the NFL. Slater was already an established star. After training camp practices last summer at The Bolt, as other players trickled into the facility, Alt and Slater would remain on the field. Alt asking questions, Slater answering and demonstrating the minute details of his technique.\n\n“He put me under his wing,” Alt said.\n\nOn Thursday, the Chargers suffered what coach Jim Harbaugh called a “gut punch right to the solar plexus.” Slater tore the patellar tendon in his left knee during practice. He is out for the season. The Chargers returned to the field Friday, and Alt was forced to find a new post-practice training partner. Alt spent 15 minutes after practice working on pass-protection sets with Trey Pipkins, who will move into the starting lineup. Alt will move from right tackle to left tackle, replacing Slater. Pipkins will play right tackle. When Alt was setting during the extra-work session, Pipkins was serving as the edge rusher. The two then swapped spots. Alt was setting from a left tackle stance, and Pipkins from a right tackle stance.\n\n“Trey’s a vet,” Alt said of Pipkins, who has played nearly 3,000 snaps at right tackle in his career. “He’s been playing right tackle for a long time. … I get to go pick his brain. He’s played a lot more football than I have in the NFL. He’s had a lot more experiences. So being able to work with him and just get a different opinion on how he sees the game helps me a ton.”\n\nThe Chargers settled into a new reality Friday, one without their franchise left tackle. Slater was back in the building Friday. Pipkins said Slater’s spirits were “as good as they can be.”\n\nSo much of this Chargers season will now rest on the reconfigured offensive line. Alt is moving back to his natural position at left tackle, where he started 33 games at Notre Dame. Pipkins will move back to his natural position at right tackle. The Chargers tried to move Pipkins to right guard last season. Pipkins had never played guard before. He started 15 games, and there were some understandable ups and downs.\n\nIn the offseason, the Chargers moved Pipkins back to tackle. They signed Mekhi Becton to be their starting right guard. Pipkins entered training camp as the Chargers’ swing tackle and sixth offensive lineman. That, of course, changed when Slater went down.\n\n“His best position is tackle,” Harbaugh said.\n\n“I’ve played the most snaps here,” Pipkins said. “So I think that’s obviously a good thing.”\n\nAlt will give the Chargers All-Pro-level play at left tackle. The more pressing question: What can Pipkins offer at right tackle? He has played good football at this position for the organization. He showed enough as a starter in 2022 to re-sign with the Chargers on a three-year deal. He played more than 1,100 snaps at right tackle in 2023, and he played his best three games of the season down the stretch. From Week 16 to 18, Pipkins only allowed one pressure in 119 pass-blocking snaps, according to Pro Football Focus. Pipkins is in the final year of his extension.\n\n“I have a ton of confidence, all the confidence in the world, in Trey,” Harbaugh said.\n\nSo the starting offensive line projects as such: LT Alt, LG Zion Johnson, C Bradley Bozeman, RG Becton, RT Pipkins. Bozeman has not practiced the past two days. Andre James has been at center with the starting offense in those practices. Becton has not practiced since July 28. Jamaree Salyer has been working at right guard with the starting offense in place of Becton.\n\nWhen asked if he has any concern about Becton missing the start of the regular season, Harbaugh said, “I don’t have that concern.” He added that Becton sitting out is “more out of an abundance of caution.”\n\nWith Pipkins moving from the bench to the starting lineup, the Chargers have a vacated spot at swing tackle. Harbaugh said the Chargers plan to work out offensive linemen on Saturday. They face the New Orleans Saints on Sunday at SoFi Stadium in their second preseason game.\n\nSalyer started at left tackle for the Chargers in 2022 when Slater missed most of the season with a torn biceps. Harbaugh said Salyer will start at left tackle Sunday. Salyer has not played right tackle in the NFL, but he did start two games there in college at Georgia.\n\nHarbaugh made sure to point out that “nothing is set in stone” on the offensive line.\n\nPipkins will get the first shot, though. And after the Chargers lost Slater, Pipkins is now a fulcrum in this season.\n\n“Honor him in how we play,” Pipkins said of Slater. “That’s what he would want. That’s what’s going to make him proud.”\n• The Chargers were looking for a lift Friday after the Slater news, and quarterback Justin Herbert provided it. Herbert had one of his best practices of camp so far.\n\nThe opening team period came in the red zone. Herbert completed all five of his passes, including three that went for touchdowns, while facing the starting defense. Herbert hit tight end Tyler Conklin on a slant route for a 20-yard touchdown. Conklin beat safety Derwin James Jr. on the play. Next, Herbert connected with rookie receiver Tre’ Harris on a comeback route for a conversion on third-and-1 from the 15-yard line. Then on a second-and-goal from the 10-yard line, Herbert found receiver Quentin Johnston on a crossing route in the back right corner of the end zone.\n\nOn the next series, the offense faced a second-and-9 from the 15-yard line. Receiver Keenan Allen ran down the seam from the slot. Herbert fired a missile between two defenders — cornerback Tarheeb Still and safety Elijah Molden — for the touchdown. Herbert and Allen seem to be picking up where they left off in 2023.\n\nHerbert then completed all seven of his passes in seven-on-seven drills against the starting defense. He hit Johnston on a slant. He completed two underneath routes to receiver Ladd McConkey, who was back in practice for the first time since July 28. He also had two completions to Allen. The best throw of the period: Conklin cut inside on a dig route, and Herbert planted a throw on the tight end’s hands between James and linebacker Daiyan Henley. Conklin was covered. Herbert completed the pass anyway. Conklin made a fantastic contested catch, and he has started to surge over the past few practices.\n• Harris had two third-down drops in Friday’s practice. The rookie now has four drops in the past three practices. On the first drop, Harris ran a dig route on a third-and-10 in seven-on-seven. He was working with the second-team offense and quarterback Taylor Heinicke. Heinicke threw to Harris. The ball went off his hands, and safety RJ Mickens caught the tipped pass for an interception. Later in practice, Harris won on a go route past cornerback Deane Leonard. Herbert threw a perfect deep ball. Harris dropped it. Harris had 15 drops in college at Ole Miss, including five in eight games as a senior.\n\nHarris did have a touchdown while working with the third-team offense in seven-on-seven. He beat rookie cornerback Eric Rogers down the right sideline, and rookie DJ Uiagalelei made a great throw on the play. Harris did well to raise his hands late in the route to prevent Rogers from reacting and breaking up the pass.\n• Heinicke will start Sunday’s preseason game, according to Harbaugh. The plan is for Heinicke to play at least two drives. Trey Lance will then take over and play a “majority” of the snaps, Harbaugh said. Uiagalelei will take over for Lance for the remainder of the game. Lance and Heinicke continue to split reps with the second team.\n• Chargers who did not practice Friday: Becton, cornerback Cam Hart, edge rusher Khalil Mack, receiver Derius Davis, running back Jaret Patterson, receiver JaQuae Jackson, cornerback Nikko Reed, edge rusher Kyle Kennard, offensive lineman Branson Taylor, Bozeman, receiver Dez Fitzpatrick and receiver Jalen Reagor. Edge rusher Bud Dupree did not participate in team drills.\n• With Hart out, Benjamin St-Juste got first-team reps at outside corner. With Mack, Dupree and Kennard out of team drills, Caleb Murphy got first-team reps at edge rusher. Linebacker Junior Colson was back in team drills. He tipped a Lance pass during seven-on-seven that was intercepted by rookie cornerback Trikweze Bridges.\n• Rookie receiver Dalevon Campbell had a go-ball touchdown from Lance in seven-on-seven. Campbell beat rookie cornerback Jordan Oladokun.\n• Rookie edge rusher Kylan Guidry had a sack in 11-on-11 off the left side on a third down.\n• Cornerback Ja’Sir Taylor had a tackle for loss on a third-down bubble screen to Johnston.",
  "medium": "Article",
  "links": [
    "https://twitter.com/chargers/status/1953945213837488174?ref_src=twsrc%5Etfw",
    "https://t.co/pGLq736cC2",
    "https://twitter.com/chargers/status/1953922715620192734?ref_src=twsrc%5Etfw",
    "https://www.nytimes.com/athletic/6541689/2025/08/08/chargers-rashawn-slater-injury-recovery/",
    "https://www.nytimes.com/athletic/6540761/2025/08/07/rashawn-slater-chargers-injury-nfl-training-camp/",
    "https://t.co/fjQIGo5MWH"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Los Angeles Chargers right tackle Joe Alt",
      "weight": 0.081002966
    },
    {
      "name": "left tackle Rashawn Slater",
      "weight": 0.07815355
    },
    {
      "name": "right tackle",
      "weight": 0.07705569
    },
    {
      "name": "left tackle",
      "weight": 0.07257642
    },
    {
      "name": "Chargers season",
      "weight": 0.07060673
    },
    {
      "name": "Trey Pipkins",
      "weight": 0.06983148
    },
    {
      "name": "Pipkins",
      "weight": 0.06477239
    },
    {
      "name": "rookie receiver Tre’ Harris",
      "weight": 0.06459524
    },
    {
      "name": "RT Pipkins",
      "weight": 0.06335346
    },
    {
      "name": "Chargers",
      "weight": 0.063049324
    }
  ],
  "topics": [
    {
      "name": "Football"
    },
    {
      "name": "NFL"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97412109375
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.96142578125
    }
  ],
  "sentiment": {
    "positive": 0.13366699,
    "negative": 0.4621582,
    "neutral": 0.40454102
  },
  "summary": "Los Angeles Chargers' right tackle, Rashawn Slater, tore his patellar tendon during practice and is out for the season. The Chargers returned to the field on Friday and Alt had to find a new partner, Trey Pipkins, who will replace Slater. Alt will move from right tackle to left tackle, Pipkins will play right tackle. Much of the team's success will depend on Pipkins' ability to play in the right tackle position. The starting offensive line will include Alt, LG Zion Johnson, C Bradley Bozeman, and RT Pipkins. The team is set to play against the Saints on Saturday at SoFi Stadium.",
  "shortSummary": "The Chargers' season will be defined by the absence of key player Rashawn Slater, with Trey Pipkins moving to replace him at right tackle.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e69dd748a327482ba176899c77b24990",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6540761/2025/08/07/rashawn-slater-chargers-injury-nfl-training-camp/",
      "text": "EL SEGUNDO, Calif. — Los Angeles Chargers star left tackle Rashawn Slater will miss the 2025 season after tearing a patellar tendon during practice, the team announced Thursday.\nRashawn Slater sustained a torn patellar tendon in today’s practice and will undergo surgery to repair the injury.\nHe will miss the 2025 season and be placed on Injured Reserve.\n— Los Angeles Chargers (@chargers) August 7, 2025\nSlater, who became he highest-paid offensive linemen in NFL history on July 27 when he signed a four-year, $114 million contract extension, was aligned at left tackle on the play. It was a modified team-drill period, with only three offensive linemen and two defensive linemen on the field.\nAndre James was at center. Zion Johnson was at left guard. Teair Tart was on the defensive interior, and Tuli Tuipulotu was at edge rusher across from Slater.\nAdvertisement\nQuarterback Justin Herbert took the snap. Slater dropped into a pass protection stance. Tuipulotu bull-rushed Slater. As Slater tried to absorb Tuipulotu’s initial strike, he planted his left foot. Slater’s left leg gave out and he fell backward onto the turf, immediately grabbing his left knee.\nTrainers rushed out to Slater. Moments later, he was helped onto a cart as several teammates crowded around, hugging their left tackle and consoling him with handshakes.\n“That’s just something you don’t want to see,” Tuipulotu said.\nAs the cart reached the sideline and turned left toward the entrance to the facility, Slater threw his helmet onto the turf. The cart came to a stop. Slater smashed his hand onto the cart, the sound reverberating around the practice fields. The crowd was hushed as practice continued. Slater buried his head in his hands and a trainer draped a towel over his head. Then two trainers helped Slater off the cart and into the facility. He could not put any weight on his left leg.\n“I didn’t really see nothing,” Tuipulotu said of the play after practice. “I kind of just turned around, and then, boom. We’re praying for him. We hope he’s doing well, and, man, everybody’s behind his back, everybody’s got him. Wishing for the best.”\nFor the remainder of practice, right tackle Joe Alt moved to left tackle with the starting offense, and Trey Pipkins III entered at right tackle. That will likely be how the Chargers configure their offensive line moving forward this season.\nAlt and Slater represented one of the true strengths of this Chargers roster. As offensive coordinator Greg Roman said earlier this training camp, “A lot of people would probably say we have the best tackle combo in the league.” It was hard to argue with that sentiment.\nSlater had already proven himself as one of the game’s best tackles, as evidenced by his contract. And Alt had an outstanding rookie season.\nAdvertisement\n“Watch what he does this year,” Roman said of Alt. “He’s on his way to being a special, special player.”\nNow the complexion of the offensive line — and the offense as a whole — changes dramatically.\nIf there is good news, it’s that Alt has considerable experience at left tackle. Few, if any, teams have the luxury of replacing an All-Pro with a future All-Pro at this most pivotal position.\nAlt started 33 games at left tackle in college at Notre Dame, not to mention a game last season in Week 18 against the Las Vegas Raiders. Slater felt some knee discomfort during warmups of that game. Alt found out he was switching to left tackle about 90 minutes before opening kickoff. He still had one of his best games of the season and did not allow a pressure in 41 pass-blocking snaps, according to Pro Football Focus.\nAlt continued to work at left tackle during this year’s training camp. Slater participated in the first two practices of camp but sat out eight consecutive practices from July 19-26 while in the middle of contract negotiations. He was also dealing with a blister on his foot that had first appeared during his offseason workouts in Dallas. Slater received treatment on that blister when he reported for camp with the Chargers on July 16. He initially tried to practice through it, but ultimately sat out to let the wound heal.\nWhen Slater was out, Alt worked at left tackle, and Pipkins worked at right tackle.\n“I look at that as an opportunity to get Joe reps on the left side,” Roman said of Alt at left tackle on July 19. “We definitely want to keep him frosty there on the left side. Keep him working intermittently just so he gets reps and muscle memory and whatnot, communication, all that stuff.”\nThose left tackle reps will now be even more valuable.\nPipkins, too, has experience at his new projected starting position. A third-round pick in 2019, Pipkins has played nearly 3,000 regular-season snaps at right tackle.\nAdvertisement\nPipkins signed a three-year extension in the 2023 offseason to return as the Chargers’ starting right tackle. After that 2023 season, the Chargers cleaned house and hired coach Jim Harbaugh and GM Joe Hortiz. The Chargers drafted Alt at No. 5 overall, and they moved Pipkins to guard. Pipkins had never played inside before, but he started 15 games at right guard in 2024. Ahead of this season, the Chargers signed Mekhi Becton in free agency to be their starting right guard. Pipkins, who is due $6.75 million in base salary this season, fit into the offensive line room as the Chargers’ swing tackle.\nPipkins did not have any guaranteed money left on his deal. The Chargers could have cut him to save cap space. But they kept him on the roster for depth and experience. That is looking like a very smart decision after Slater’s injury.\nHarbaugh announced earlier this week that the Chargers expect Johnson to start at left guard and Bradley Bozeman to start at center. Those are the same starters as last season, when the Chargers’ interior struggled. The Chargers had experimented with Johnson at center, but that attempt failed. The thought process for improvement on the offensive line came down to this: The best tackle duo in the league creates a floor while Becton raises the interior.\nBecton has not practiced since July 28, and the Chargers have not provided any firm update on what Becton is managing. Harbaugh said the issue is in the “not-severe category.” When asked if Becton was injured in practice, Harbaugh replied, “It’s something he’s working through.” Bozeman also did not practice on Thursday.\nAfter Thursday’s practice ended, all the key Chargers decision-makers huddled together on the practice fields: Harbaugh, Hortiz, president of football operations John Spanos, assistant general manager Chad Alexander, vice president of football administration/player finance Ed McGuire and director of player health, wellness and performance Marco Zucconi.\nTheir facial expressions and the general mood could be described in one word: somber.\n“We definitely have the ingredients,” Roman said in July. “Full transparency, we got to stay healthy, like every other team in the NFL.”\nIt is Aug. 7, and that goal has disappeared already.\n(Photo: Maddie Meyer / Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6541689/2025/08/08/chargers-rashawn-slater-injury-recovery/",
      "text": "EL SEGUNDO, Calif. — Rashawn Slater’s path to the very top of his position was rooted in and fueled by the work.\nIt never stopped.\nNot when he was waking up at 6 a.m. on Saturdays as a sophomore in high school to train in the Houston heat.\nNot when his family went on a cruise after his freshman year at Northwestern, and Slater was doing pass protection sets on the deck while other cruise-goers looked on in disbelief.\nAdvertisement\nNot when he was drafted with the No. 13 pick in 2021. Not when he earned second-team All-Pro as a rookie. Not when he tore his bicep in 2022 and missed 14 games, including the Chargers’ first playoff appearance in four years.\nNot when he became the highest-paid offensive lineman in NFL history.\nAnd it won’t stop now. That can be guaranteed. Slater finds comfort in the work. Always has. Always will. Even as he faces this overwhelming challenge.\nThe unthinkable happened Thursday morning on the practice fields at The Bolt, the Los Angeles Chargers’ practice facility. Less than two weeks after signing a $114 million contract extension while surrounded by family, Slater tore his patellar tendon. He dropped into pass protection, a movement he has repeated thousands and thousands of times over his football life. He took a shove from edge rusher Tuli Tuipulotu. He planted his left foot. His leg gave out.\nSlater will undergo surgery and be placed on injured reserve. He will miss the 2025 season. What awaits is a recovery time of 10 to 12 months, according to Dr. Carlos Uquillas, an orthopedic surgeon at Cedars-Sinai Medical Center and a team physician for the Los Angeles Angels.\n“A lot of people do return from this injury,” Uquillas said. “Sometimes not at the same level.”\nThe Chargers are familiar with this injury. Cornerback J.C. Jackson tore his patellar tendon in Week 7 of 2022, eight months after he signed an $82.5 million free-agent contract with the team. Jackson suffered the injury in November. He was back for Week 1 of the 2023 season. Jackson played two games before he was traded to the New England Patriots. He has been out of the league since the end of the 2023 season.\nAccording to Uquillas, though, the recovery for “speed players” like receivers, running backs and defensive backs tends to be “a little harder” compared to linemen.\nAdvertisement\n“For linemen,” Uquillas said, “I think it’s potentially a little bit easier.”\nCleveland Browns tackle Jack Conklin, for instance, tore his patellar tendon in late November 2021. He returned in Week 3 of 2022 and played more than 900 snaps over 14 starts.\nSo there is some hope for 2026.\nIn this coming season, the Chargers will have to find a way forward without a franchise cornerstone.\nWhat coach Jim Harbaugh has brought, more than anything, is hope. Hope that organizational demons will be vanquished once and for all. Hope for competence and sustained success and, yes, finally, a Chargers Super Bowl victory.\nThis feels gut-wrenchingly familiar for a team that has an incomprehensible injury history. One could practically see and hear the hope dissipating into the California sunshine Thursday morning. How Harbaugh navigates this will reveal what he is truly building, or not building, with the team.\nThe positive: The Chargers have a rising star in Joe Alt who can take over for Slater at left tackle.\nAnother positive: The situation could have been worse for Slater. He could have gotten hurt before he signed his deal.\nAfter skipping organized team activities, Slater participated fully in three minicamp practices from June 10 to 12. He still had not signed his contract. Slater reported for camp on July 16. He participated in the first two training camp practices on July 17 and 18.\nSlater avoided the worst-case scenario in these five practices. He now has the financial security that he deserved and earned. It is an important example of why players — especially elite players — should exercise all their leverage in contract negotiations. Such players can be labeled in negative ways. But NFL owners are doing everything they can, all the time, to maximize their profits. Players should be doing the same. Their bodies are their businesses. Protecting that business does not make a player a bad teammate. It is necessary.\nAdvertisement\nAccording to Over the Cap, Slater was fully guaranteed $56 million at signing — his $29 million signing bonus plus his $27 million in base salary and roster bonuses over the next two seasons. If he is on the roster on March 15, 2026, his $26 million in 2027 base salary will become guaranteed.\nSlater has set himself and his family up for life. He toiled in the work to make that happen.\n“It doesn’t change anything,” Slater said a day after signing the deal. “I still got to wake up and give it my all every day.”\nSlater will have to dig more deeply than he ever has in the months ahead. The patellar tendon attaches the knee to the shin and, thus, the quad muscle to the shin. Without the tendon, Uquillas said, “you have no ability to extend your knee.”\nAtrophy will occur without movement.\n“It takes just a really long time to build the bulk and that strength back up,” Uquillas said. “Left tackles, their quads are massive. So to get back to that level takes a ton of time and effort.”\nSlater has drawn from a seemingly limitless pool of effort to make it here.\nHe has a ton. And quite a bit more.\n“I’ve been an underdog all my life,” Slater said the day he was drafted in 2021. “I’ve always had that chip on my shoulder, trained with that chip on my shoulder and played with that chip on my shoulder. It’s not leaving because that’s just part of who I am now.”\n(Top photo: Eric Thayer / Associated Press)"
    }
  ],
  "argos_summary": "Los Angeles Chargers left tackle Rashawn Slater will miss the entire 2025 season after tearing his patellar tendon during practice, prompting a significant reshuffle in the team's offensive line. Rookie Joe Alt will move from right tackle to left tackle to fill Slater's position, while Trey Pipkins will take over at right tackle. Coach Jim Harbaugh expressed confidence in the new lineup, emphasizing the importance of adapting to Slater's absence as the team prepares for the upcoming season.",
  "argos_id": "T2J21M3TU"
}