{
  "url": "https://www.nasdaq.com/articles/asian-markets-mixed-amid-tariff-caution",
  "authorsByline": "RTTNews",
  "articleId": "852ea212b99a4413a52f430fdbb2800e",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "http://nasdaq.com/sites/acquia.prod/files/rttnews_article/asiamixed6-09232024_07aug25-m.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T03:16:00+00:00",
  "addDate": "2025-08-08T03:31:11.531639+00:00",
  "refreshDate": "2025-08-08T03:31:11.531641+00:00",
  "score": 1.0,
  "title": "Asian Markets Mixed Amid Tariff Caution",
  "description": "(RTTNews) - Asian stock markets are trading mixed on Friday, following the mixed cues from Wall Street overnight, as uncertainty continues over US reciprocal tariffs despite the tariff's kicking in on Thursday. Market uncertainty is created by the pressure tactics exerted by the",
  "content": "(RTTNews) - Asian stock markets are trading mixed on Friday, following the mixed cues from Wall Street overnight, as uncertainty continues over US reciprocal tariffs despite the tariff's kicking in on Thursday. Market uncertainty is created by the pressure tactics exerted by the US by constantly altering tariffs. Asian markets ended mostly higher on Thursday.\n\nUS President Donald Trump announced a 100 percent tariff on imports of semiconductors and chips but said companies that are building in the U.S. would be exempted. Trump also threatened pharmaceutical imports with up to 250 percent tariff.\n\nBased on last week's weak economic data and dismal job numbers in the US, traders expect a interest rate cut by the US Fed in September that could impact the global stock markets in the coming weeks.\n\nThe Australian stock market is trading slightly lower on Friday, extending the slight losses in the previous session, following the mixed cues from Wall Street overnight. The benchmark S&P/ASX 200 is staying below the 8,850 level, with weakness in financial and technology stocks partially offset by gains in mining stocks.\n\nThe benchmark S&P/ASX 200 Index is losing 6.50 points or 0.07 percent to 8,824.90, after hitting a low of 8,790.30 earlier. The broader All Ordinaries Index is down 11.60 points or 0.13 percent to 9,090.40. Australian stocks closed slightly lower on Thursday.\n\nAmong major miners, BHP Group, Fortescue and Mineral Resources are gaining almost 1 percent each, while Rio Tinto is edging up 0.2 percent.\n\nOil stocks are mixed. Santos and Woodside Energy are edging down 0.1 to 0.3 percent each, while Beach energy is gaining almost 1 percent and Origin Energy is edging up 0.3 percent\n\nAmong tech stocks, Zip is declining almost 3 percent, WiseTech Global is losing almost 2 percent and Xero is down almost 1 percent. Afterpay-owner Block is surging 7.5 percent on upbeat second-quarter results. Appen is flat.\n\nAmong the big four banks, Commonwealth Bank, National Australia Bank and Westpac are edging down 0.1 to 0.3 percent each, while ANZ Banking is edging up 0.3 percent.\n\nGold miners are mostly higher. Evolution Mining and Resolute Mining are gaining 1.5 percent each, while Northern Star Resources is advancing almost 4 percent, Gold Road Resources is edging up 0.2 percent and Newmont is adding more than 2 percent.\n\nIn other news, shares in Nick Scali are surging almost 9 percent after the furniture retailer's Australia and New Zealand business saw second-half sales orders rise with a 65 percent gross margin.\n\nShares in Iress are soaring almost 12 percent after its board confirmed the company considered a takeover approach from New York-based private equity giant Blackstone.\n\nMeanwhile, shares in GQG Partners are tumbling more than 14 percent after US$1.4 billion exited its funds in July, with US$1 billion of that tied to a single institutional client.\n\nIn the currency market, the Aussie dollar is trading at $0.652 on Friday.\n\nExtending the gains in the previous three sessions, the Japanese market is sharply higher on Friday, following the mixed cues from Wall Street overnight. The Nikkei 225 is jumping more than 2 percent to above the 41,950 level, with gains across all sectors led by index heavyweights, exporters and technology stocks.\n\nThe benchmark Nikkei 225 Index closed the morning session at 41,968.68, up 909.53 points or 2.22 percent, after touching a high of 41,862.00 earlier. Japanese shares ended notably higher on Thursday.\n\nMarket heavyweight SoftBank Group is soaring almost 11 percent after reporting better-than-expected first-quarter profit, and Uniqlo operator Fast Retailing is gaining almost 3 percent. Among automakers, Toyota is gaining more than 2 percent and Honda is adding more than 3 percent.\n\nIn the tech space, Advantest and Tokyo Electron are gaining more than 2 percent each, while Screen Holdings is adding almost 4 percent.\n\nIn the banking sector, Sumitomo Mitsui Financial and Mitsubishi UFJ Financial are gaining almost 1 percent each, while Mizuho Financial is adding almost 2 percent.\n\nAmong the major exporters, Sony is surging more than 6 percent after lifting its full-year operating profit forecast, Canon is gaining more than 1 percent, Mitsubishi Electric is adding almost 1 percent and Panasonic is advancing almost 2 percent.\n\nAmong other major gainers, Terumo is jumping almost 10 percent, Nitori Holdings is soaring more than 8 percent, Orix is surging almost 6 percent and Nintendo is rising almost 5 percent, while Subaru, FUJIFILM and Mazda Motor are gaining almost 4 percent each. Tokyu and Mitsui Fudosan are adding more than 3 percent each, while Konica Minolta and Ebara are up almost 3 percent each.\n\nConversely, Chugai Pharmaceutical is plummeting more than 18 percent, while Trend Micro and DeNA are tumbling more than 6 percent each. Furukawa Electric is declining almost 6 percent, Nikon is losing more than 4 percent and Taiheiyo Cement is slipping almost 3 percent.\n\nIn economic news, the average of household spending in Japan was down a seasonally adjusted 5.2 percent on month in June, the Ministry of Internal Affairs and Communications aid on Friday - coming in at 316,085 yen. That missed forecasts for a decline of 3.0 percent following the 4.6 percent gain in May. On a yearly basis, household spending rose 1.3 percent - again shy of expectations for 2.8 percent and down from 4.7 percent in the previous month. The average of monthly income per household stood at 522,318 yen, up 0.4 percent from the previous year.\n\nJapan posted a current account surplus of 1.348 trillion yen in June, the Ministry of Finance said on Friday - down 23.6 percent from a year earlier. That missed forecasts for a surplus of 1.480 trillion yen and was down from 3.436 trillion yen in the previous month. Exports were down 2.4 percent on year at 8.962 trillion yen and imports fell 1.3 percent to 8.493 trillion yen for a trade surplus of 469.6 billion yen. The capital account showed a deficit of 53.8 billion yen, while the financial account saw a surplus of 1.141 trillion yen.\n\nIn the currency market, the U.S. dollar is trading in the lower 147 yen-range on Friday.\n\nElsewhere in Asia, New Zealand, Malaysia, Indonesia and Taiwan are higher by between 0.1 and 0.9 percent, while Hong Kong, Singapore and South Korea and are lower by between 0.2 and 0.5 percent. China is relatively flat.\n\nOn Wall Street, stocks moved mostly higher early in the session but gave back ground over the course of the trading day on Thursday. The major averages pulled back well off their highs of the session before eventually ending the day mixed.\n\nWhile tech-heavy Nasdaq added to Wednesday's strong gain, climbing 73.27 points or 0.4 percent to 21,242.70, the S&P 500 edged down 5.06 points or 0.1 percent to 6,340.00 and the Dow fell 224.48 points or 0.5 percent to 43,968.64.\n\nThe major European markets also turned in a mixed performance on the day. While the U.K.'s FTSE 100 Index slid by 0.7 percent, the French CAC 40 Index jumped by 1.0 percent and the German DAX Index shot up by 1.1 percent.\n\nCrude oil prices fell Thursday on inconsistency in the U.S. stance on Russia and its invasion on Ukraine. West Texas Intermediate crude for September delivery was down $0.49 or 0.76 percent at $63.86 per barrel.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Asian stock markets",
      "weight": 0.07065321
    },
    {
      "name": "Market uncertainty",
      "weight": 0.059824087
    },
    {
      "name": "0.07 percent",
      "weight": 0.059441626
    },
    {
      "name": "0.1 percent",
      "weight": 0.059441626
    },
    {
      "name": "0.13 percent",
      "weight": 0.059441626
    },
    {
      "name": "0.2 percent",
      "weight": 0.059441626
    },
    {
      "name": "0.3 percent",
      "weight": 0.059441626
    },
    {
      "name": "0.4 percent",
      "weight": 0.059441626
    },
    {
      "name": "0.5 percent",
      "weight": 0.059441626
    },
    {
      "name": "0.7 percent",
      "weight": 0.059441626
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Asian"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9951171875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9453125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.79296875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.68701171875
    }
  ],
  "sentiment": {
    "positive": 0.044433594,
    "negative": 0.8354492,
    "neutral": 0.12030029
  },
  "summary": "Asian stock markets are mixed following mixed cues from Wall Street, with uncertainty over US reciprocal tariffs. The US President Donald Trump has announced a 100 percent tariff on imports of semiconductors and chips, while companies that are building in the US will be exempt. The Australian stock market is trading slightly lower on Friday, with financial and technology stocks partially offset by mining stocks. The benchmark S&P/ASX 200 index is losing 6.50 points or 0.07 percent to 8,824.90, after hitting a low of 8,790.30 earlier. The Japanese market is also sharply higher, with the Nikkei 225 index jumping more than 2 percent to above the 41,950 level. Shares in Iress are soaring almost 12% after its board confirmed the company considered a takeover approach from Blackstone. Shares of GQG Partners are falling more than 14% after US$1.4 billion exited its funds in July, with US$10 billion tied to a single institutional client.",
  "shortSummary": "Asian stock markets are mixed as uncertainty over US tariffs and potential interest rate cuts continue to impact investor sentiment.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b984d72a102d4d058790c43b3279bbfb",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Asian stock markets are mixed as they react to the uncertainty surrounding US tariffs, with President Trump's announcement of a 100% tariff on semiconductors and potential 250% tariffs on pharmaceuticals causing concern. The Australian market is slightly lower, influenced by losses in financial and technology stocks, while Japan's Nikkei 225 index is up over 2% due to gains in major exporters and technology firms. Economic data from Japan shows a decline in household spending, missing forecasts, and a current account surplus that also fell short of expectations.",
  "argos_id": "T7TO4QBON"
}