{
  "url": "https://www.dailymail.co.uk/sport/football/article-14984637/Marc-Andre-Ter-Stegen-Barcelona-captain-medical-saga.html",
  "authorsByline": "Yaseen Zaman",
  "articleId": "8827612055e047d4bd8a8ef1f1fd381f",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/08/23/101056567-0-image-m-56_1754693525123.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-09T00:12:58+01:00",
  "addDate": "2025-08-08T23:18:55.073458+00:00",
  "refreshDate": "2025-08-08T23:18:55.073460+00:00",
  "score": 1.0,
  "title": "Ter Stegen REINSTATED as Barca captain just a day after being stripped",
  "description": "The dispute began when he refused to authorise Barca's medical services to submit his post-surgical report to LaLiga, prompting the club to strip him of the armband and open disciplinary action.",
  "content": "Marc-Andre Ter Stegen has been reinstated as Barcelona's first-team captain after a brief disciplinary saga, the club confirmed on Friday.\n\nThe dispute began when the goalkeeper refused to authorise Barcelona's medical services to submit his post-surgical report to LaLiga, prompting the club to strip him of the armband and open disciplinary proceedings.\n\nBy withholding the medical report, Barca risked not being able to register new signings due to LaLiga's strict financial fair play rules.\n\nIf Ter Stegen's recovery lasted more than four months, 80 per cent of his wages could have been allocated for new players like Joan Garcia.\n\nSoon after, Ter Stegen issued a conciliatory public statement, stressing his commitment to the club and explaining that all signings had been concluded before his operation, debunking claims that his absence paved the way for new transfers.\n\nIt read: 'These past few months have been particularly difficult for me, both physically and personally. Like any player, after suffering an injury, my sole priority has always been to return to the pitch as soon as possible, motivated only by the desire to help the team and do what i love most: compete.\n\n'In recent weeks, many things have been said about me - some of them entirely un-founded. Therefore, I feel it is necessary to express my version of events respectfully, yet clearly.\n\n'The decision to undergo surgery was made after consultation with medical professionals and fully approved by the Club, and always with the intention of prioritising my health and long-term sporting career which of course are fully aligned with those of FCB to have myself available on the pitch as soon as possible to keep winning trophies.\n\n'Moreover, I announced publicly the minimum recovery timing that I shall need after that, which had been communicated to me by most reputed experts and always in coordination with the Club.\n\n'I would also like to clarify - in light of certain speculation - that all of the Club's signings and contract renewals were completed prior to my surgery, and therefore, at no point could I consider that my unfortunate circumstances with the new surgery I had to undergo would be necessary for the registration of other colleagues whom greatly respect and look forward to share locker room with for many seasons. Any alternative interpretation seems both unfair and inaccurate to me.\n\n'Throughout my career, I have always tried to conduct myself with professionalism, respect, and commitment towards the Badges I have represented. I have a deep affection for FC Barcelona, this city, and its supporters, who have stood by me for so many years. My commitment to these colours remains absolute.\n\n'I understand that difficult moments can generate tension, but I trust that, through dialogue and responsibility, we can resolve this situation constructively. I am fully willing to collaborate with the Club's management to resolve this matter and to provide the requested authorisation.\n\n'A lot may have changed, but one thing never will: I love you, Culers!'\n\nFollowing his gesture, Barcelona confirmed that disciplinary proceedings were closed and that Ter Stegen would resume his role as captain with immediate effect.\n\nThe statement read: 'FC Barcelona report that Marc-Andre Ter Stegen has signed the authorisation for the club's Medical Services to process the mandatory medical report in La Liga following his surgery.\n\n'The disciplinary file is closed and the player recovers the captaincy of the first team with immediate effect.'\n\nTer Stegen has been a Barcelona stalwart since his move from Borussia Monchengladbach in 2014.\n\nIn the time he has made 422 appearances, grabbing six LaLiga titles, a Champions League, and multiple domestic cups in the process.",
  "medium": "Article",
  "links": [
    "https://t.co/62OpfDqJeQ",
    "https://www.dailymail.co.uk/sport/la-liga/index.html",
    "https://twitter.com/FCBarcelona?ref_src=twsrc%5Etfw",
    "https://twitter.com/mterstegen1/status/1953863149993558405?ref_src=twsrc%5Etfw",
    "https://www.dailymail.co.uk/sport/fc-barcelona/index.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ter Stegen",
      "weight": 0.079698175
    },
    {
      "name": "FC Barcelona",
      "weight": 0.07124717
    },
    {
      "name": "new signings",
      "weight": 0.07115146
    },
    {
      "name": "new players",
      "weight": 0.06745923
    },
    {
      "name": "Barcelona",
      "weight": 0.06481214
    },
    {
      "name": "many things",
      "weight": 0.059761316
    },
    {
      "name": "medical professionals",
      "weight": 0.059760142
    },
    {
      "name": "disciplinary proceedings",
      "weight": 0.058649004
    },
    {
      "name": "new transfers",
      "weight": 0.057403002
    },
    {
      "name": "Club",
      "weight": 0.055414665
    }
  ],
  "topics": [
    {
      "name": "Football"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98291015625
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.97607421875
    }
  ],
  "sentiment": {
    "positive": 0.057647705,
    "negative": 0.6699219,
    "neutral": 0.27197266
  },
  "summary": "Barcelona goalkeeper Marc-Andre Ter Stegen has been reinstated as the first-team captain following a disciplinary dispute involving him refusing to authorise Barcelona's medical services to submit his post-surgical report to LaLiga. This decision led to the club stripping him of the armband and opening disciplinary proceedings. If Teregen's recovery lasted more than four months, 80 per cent of his wages could have been allocated for new players like Joan Garcia. However, he issued a public statement expressing his commitment to the team and refuted claims that his absence had paved the way for new transfers. Following his statement, Barcelona confirmed that disciplinary proceedings were closed and that Ter StEGen would resume his role as captain.",
  "shortSummary": "Marc-Andre Ter Stegen was reinstated as Barcelona's captain after a disciplinary dispute involving his refusal to submit his post-surgical medical report.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "12246cdca7e945f694fa712b397af655",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dailymail.co.uk/sport/la-liga/index.html",
      "text": "Advertisement\nRELATED TOPICS FOR La liga\nLaLiga News, Fixtures and Results\nPage\nMarc-Andre Ter Stegen is REINSTATED as Barcelona captain just a day after being stripped of the armband - with goalkeeper reaching an agreement with Catalan club over his medical saga\n08/08/25 23:12\nMarc-Andre Ter Stegen has been reinstated as Barcelona's first-team captain after a brief disciplinary saga, the club confirmed on Friday. The dispute began when the goalkeeper refused to authorise Barcelona's medical services to submit his post-surgical report to LaLiga, prompting the club to strip him of the armband and open disciplinary proceedings. By withholding the medical report, Barca risked not being able to register new signings due to LaLiga's strict financial fair play rules....read\nFormer Arsenal star Thomas Partey completes move to Villarreal amid ongoing five-count rape case - with Spanish club releasing a statement explaining the move after controversial signing sparked fan protest\n07/08/25 17:37Partey, who was charged four days after the expiration of his Arsenal contract in June, appeared at Westminster Magistrates' Court on Tuesday.Barcelona give update on registration of six players - with Marcus Rashford among stars sweating on being available for start of LaLiga season\n05/08/25 22:26The reigning LaLiga champions, however, have faced difficulties in registering players with the league due to their ongoing financial situation and open the new season on August 16.Thomas Partey 'set to join LaLiga side' as free agent - despite ex-Arsenal star facing rape charges\n03/08/25 14:24Last month, former Arsenal midfielder Thomas Partey, 32, was charged with five counts of rape and one count of sexual assault. He is accused of attacking three women between 2021 and 2022.Man United 'are willing to meet £61m asking price' for Barcelona star - but 'will wait for Benjamin Sesko's decision' before launching summer move\n02/08/25 19:25The Catalan giants are open to offers for a number of their players this summer as they try to generate funds in order to register their new signings.Liverpool owners 'in talks over takeover of £100m-valued LaLiga club' - with FSG pushing to strike deal after backing the Reds big-spending summer\n30/07/25 06:28Liverpool's owners FSG are now reportedly set to press ahead with another significant outlay, amid reports they are in talks over a £100million takeover of a Spanish top-flight side.Arsenal star William Saliba provides major update on whether or not he will sign a new contract amid interest from Spain\n27/07/25 16:37Spanish giants Real Madrid have long-courted Saliba, with multiple reports this year suggesting that the France international is their No 1 target at centre back.Barcelona chief offers MAJOR update in transfer race for Liverpool star - after Catalan giants added Man United outcast Marcus Rashford\n25/07/25 09:19Barcelona have been in hot pursuit of the Liverpool star this summer, but the Premier League champions have insisted they have no intention of selling him.Aston Villa are set to offer new deal to key man - as Unai Emery fights off interest from Champions League giants\n24/07/25 18:38The 32-year-old's current deal expires at the end of the season but boss Unai Emery remains a huge fan and is convinced Digne can remain a key player for Villa in the seasons ahead.Barcelona cancel pre-season friendly against Vissel Kobe in Japan due to 'contractual breaches' - with their fixtures in South Korea also in jeopardy\n24/07/25 10:16Barcelona's pre-season preparations have taken a major blow after they cancelled their first fixture ahead of the new campaign.Marcus Rashford looks like a man reborn after leaving Man United for Barcelona... this opening chapter to his new life in Spain could scarcely have gone better, writes NATHAN SALT\n23/07/25 21:30NATHAN SALT IN BARCELONA: As the Mercedes carrying Marcus Rashford turned the corner towards the offices at the Camp Nou, a crowd of giddy youngsters suddenly sprung into life.Marcus Rashford delivers Man United farewell message at Barcelona unveiling - as exiled star looks forward to 'next chapter' with Spanish giants\n23/07/25 17:57Rashford has joined the Spanish giants on a season-long loan move, with Barcelona having the option to make the deal permanent for around £30m next summer.Marcus Rashford COMPLETES loan move to Barcelona from Man United as Red Devils outcast bids for career kickstart after being frozen out by Ruben Amorim\n23/07/25 16:52Marcus Rashford has said it will be a 'joy' to play for Barcelona and feels like he is 'at home' after completing a season long loan move to the Spanish giants from Manchester United.Marcus Rashford pictured arriving in Barcelona as it emerges Man United exile is taking a pay cut to complete dream move\n20/07/25 21:03PETER JENSON: The Spanish champions made the Man United outcast - who was seen arriving in Barcelona on Sunday - their top target despite flirtations with Luis Diaz and Nico Williams.Revealed: Jude Bellingham's worrying return date as Real Madrid star 'prepares to undergo shoulder surgery this week'\n15/07/25 15:43In May, it was confirmed that the Bellingham had planned to undergo the procedure after the conclusion of the Club World Cup, which ended on Sunday with Chelsea 's 3-0 victory over PSG.Revealed: Barcelona's special 'Lionel Messi plans' for Nou Camp's reopening in 2026 after £1.3b renovation\n12/07/25 10:21Last season Hansi Flick led the club to their first league title since their exile began and preparations for how they will mark their long-awaited return are reportedly well underway.Former Premier League star is the 'main obstacle' to Marcus Rashford joining Barcelona from Man United\n12/07/25 09:57Rashford is known to be keen on a move to Barcelona this summer but there is reportedly one major issue holding back a potential deal. Rashford is still under contract with Man United until 2028.Vinicius Jr's Real Madrid future 'in limbo' as contract negotiations stall amid poor form - as the Brazilian remains a top target for Saudi Arabia\n12/07/25 09:01A renewed contract is said to have been drawn up several months ago with plans for it to have been finalised later in the summer ahead of the coming campaign.Luis Diaz 'sets Barcelona compensation demand' as Spanish giants rival Bayern Munich for £60m-rated Liverpool winger\n10/07/25 08:53Barcelona's financial situation has reportedly been discussed in talks with Liverpool's Luis Diaz, with the club having faced difficulties in registering Dani Olmo and Pau Victor last season.Carlo Ancelotti sentenced to one year in PRISON after failing to pay tax on his image rights during his first spell as Real Madrid manager - but new Brazil coach will AVOID jail time\n09/07/25 14:49The Italian stood accused of deliberately misinforming the tax office during his first spell in charge of Madrid between 2014 and 2015 to avoid paying more than €1m (£833,000) in income tax.La Liga chief accused of sabotaging Barcelona's move for Nico Williams by disclosing secret information to Athletic Bilbao - before Spanish winger signed shock new deal\n08/07/25 16:07LaLiga president Javier Tebas has been accused of sabotaging Barcelona's summer move for Nico Williams by disclosing secret financial information to Athletic Bilbao.Arsenal 'reach agreement with LaLiga star' as Mikel Arteta closes in on another summer target\n29/06/25 16:29Gabriel suffered a hamstring injury in April, and adding another high-calibre centre back to their ranks would give the Gunners the chance to occasionally rotate both of the defenders.Nico Williams makes last-minute demand ahead of £50m Barcelona switch - and the Spanish giants will have to sell to make it happen\n28/06/25 16:25Williams, 22, has pushed for a move away from Bilbao this summer with Bayern Munich and Arsenal also reported to have been interested in signing the winger.Arsenal's surprise bid for Valencia star Christian Mosquera REJECTED - as Spanish giants reveal price the Gunners must pay for defender\n28/06/25 14:44The Gunners have entered talks for Mosquera, 20, as they look to find suitable cover for first-choice options William Saliba and Gabriel. Arsenal appear intent on strengthening their back-line depth.Liverpool chief breaks silence on Trent Alexander-Arnold's departure to Real Madrid and reveals his disappointment behind the decision\n27/06/25 22:38Alexander-Arnold caused uproar among fans when he revealed he would be leaving Liverpool for Spain, with it initially looking like he would be departing for free after a 20-year stay at the club.Nottingham Forest midfielder Danilo wanted on loan by LaLiga club as his £20m move to Lyon is stalled by the French club's relegation\n27/06/25 18:11The 24-year-old Brazilian midfielder has been set for a £20million switch to Lyon before the French club were demoted to the second tier for financial offences.Cristiano Ronaldo's former Man United team-mate pokes fun at his staggering new '£492MILLION Al-Nassr deal' with hilarious four-word message\n27/06/25 17:31Football's all-time leading goalscorer put pen to paper on a two-year deal, which is reportedly the most lucrative in sporting history, worth a basic £492million over its duration.Barcelona sporting director Deco issues update on futures of three stars - including Frankie De Jong as Dutchman enters last year of his deal\n22/06/25 14:19Barcelona sporting director Deco has given an update on the futures of three of the club's stars. The three players have been linked with potential moves away from the club during the transfer window.Premier League legend completes fairytale story as he scores in play-off final to lead hometown club back to LaLiga after 24-year absence\n22/06/25 10:54Things got off to a disastrous start on Saturday in the second leg as they went 1-0 behind, but the star gave his side hope when he converted a penalty late in the first half.LaLiga president launches extraordinary attack on Club World Cup piling further pressure on FIFA amid embarassment over empty seats\n17/06/25 16:07FIFA president Gianni Infantino promised there would be 'full stadiums in America' and that he had no concerns about ticket sales but the tournament has so failed to capture fans imagination.Liverpool owners FSG 'identify ideal LaLiga side to buy' - as Premier League champions look to develop multi-club model\n17/06/25 16:04The Premier League champions have had their eye on acquiring a second football team, with the pursuit among the reasons Michael Edwards returned as FSG's chief executive of football.A child killed at 15, years of silence, teenagers fighting 37-year-olds and no medics to save young lives: Inside the Wild West of child combat sports - and why every parent should protect their kids from this unregulated scandal\n17/06/25 16:00IAN HERBERT: Alex Eastwood had completed nearly three rounds of a bout at a Wigan gym when he became disorientated and collapsed with a bleed on the brain. He died in hospital two days later.Vinicius Junior abuse: Four found guilty and sentenced after hate crimes and threats targeting Real Madrid forward - including hanging effigy\n16/06/25 18:24The group were found guilty of hanging an inflatable effigy of Vinicius in a replica shirt over a bridge near Real Madrid's training ground in 2023.Aston Villa transfer news: What's really going on with Marcus Rashford, Morgan Rogers and Jack Grealish, the latest on Boubacar Kamara's contract and the two ways Villa can get creative with PSR\n12/06/25 10:58TRANSFER Q&A SPECIAL: Are Marcus Rashford, Marco Asensio or Jack Grealish really heading back to Villa Park? And can Villa ever escape the constraints of PSR?Trent Alexander-Arnold speaks PERFECT Spanish as he's joined by his glamorous girlfriend at Real Madrid unveiling\n12/06/25 09:47The England star beamed as he shook hands with club president Florentino Perez, embarking on a six-year deal with the European giants after leaving Liverpool a month early for £10million.Former Premier League icon, 40, scores stunning free-kick to send boyhood club to LaLiga play-offs\n12/06/25 09:42Real Oviedo faced Almeria for a chance to play for a spot in the LaLiga play-off finals on Wednesday night, having won the first leg on the road 2-1, but were down a goal early on.Rodrygo sends clear message to Real Madrid in crunch talks with Xabi Alonso after multiple Premier League clubs including Arsenal approach the Brazilian\n11/06/25 07:55The 24-year-old has been eyed by major clubs across Europe including Arsenal after he reportedly told Madrid he never wanted to play for them again having refused to feature against Barcelona.Rodrygo 'approached by multiple Premier League clubs including Arsenal'... as Brazilian's future at Real Madrid will hinge on TWO demands\n10/06/25 13:12The Brazilian winger has fast become one of the biggest transfer sagas of the summer so far after reportedly telling Real Madrid that he wished never to play for the club again last month.Revealed: What's really going on with Real Madrid and Martin Zubimendi after Arsenal thought they had sealed the deal for Spanish midfielder\n10/06/25 07:58Arsenal have long been viewed as the clear frontrunners for the midfielder, but Reports from Spain claimed Real Madrid were considering hijacking the Gunners' deal.Thomas Tuchel reveals why he thinks Trent Alexander-Arnold is a good fit for Real Madrid - as England boss makes request to fans over Liverpool departee's controversial move\n07/06/25 14:50The defender caused uproar among Liverpool fans when he revealed he would be leaving the club for Spain, with it initially looking like he would be departing for free after a 20-year stay.How Jobe is morphing into Jude: Bellingham brothers are following same path thanks to plan mapped out by their police sergeant father and doting mother with younger sibling turning his back on Premier League\n07/06/25 11:42At just 21 years old, Bellingham has now completed his second domestic season with Real Madrid, playing alongside the likes of Kylian Mbappe and Vinicius Jr.Revealed: How Man United 'helped Liverpool establish huge market price for Luis Diaz' - as Premier League champions 'REJECT' Barcelona approach\n05/06/25 11:16Diaz arrived on Merseyside from Porto midway through the 2021-22 season, and has enjoyed a successful three-and-a-half years at the club, winning five honours in his time so far.Liverpool transfers Q&A: YOUR questions answered on Florian Wirtz, Milos Kerkez, Nico Williams, Luis Diaz, Darwin Nunez and more\n04/06/25 11:00Liverpool are Premier League champions but, as Steven Gerrard said last week, it is best to fix the roof while the sun is shining.Revealed: Luka Modric and Swansea City, the full story - Real Madrid legend's role in transfers, how club convinced him to invest ...and will he be joining their midfield?\n03/06/25 16:00EXCLUSIVE BY WILL PICKWORTH IN SWANSEA: A Ballon d'Or winner, Real Madrid 's most decorated star and a veteran of 186 Croatia caps, joining Swansea as an investor and co-owner.Kylian Mbappe and Neymar break their silence after former club PSG finally win the Champions League with rout of Inter Milan\n31/05/25 22:14The Ligue 1 champions humiliated their opponents to win 5-0 at the Allianz Arena and seal their first title. In doing so, they also secured a first ever treble in club history.Marcus Rashford 'dealt major blow as Barcelona make transfer stance clear' with the Catalan giants 'preferring another Premier League winger' over the Man United outcast\n31/05/25 16:02The 2024-25 La Liga champions have made their interest in Rashford no secret, with the club's sporting director Deco revealing he 'likes' the England international earlier this month.Revealed: The incredible final streak brought to an end as Chelsea surge to Conference League victory\n28/05/25 22:33Chelsea were able to break a sensational record by beating Real Betis 4-1 in Conference League final on Wednesday night. The Blues put in a ruthless second-half display to see off their opponents.Chaos in Wroclaw: Chelsea fan is set upon by Betis supporters as Conference League build up turns violent with 10s of thousands descending on the city - and 28 arrested\n28/05/25 16:12KIERAN GILL: Shocking pictures have emerged showing the supporter being attacked by a group of Spanish football fans who surround and kick him in the middle of the street.Thierry Henry reveals why he left Arsenal for Barcelona in 2007 - as he opens up on 'difficult' situation and family life at the time\n28/05/25 07:31The striker left London for Barcelona for £16million that summer, suddenly calling time on a prolific eight-season spell which saw him bang in 226 goals.Revealed: How Antony can earn Man United 'huge sum' in Europa Conference League final - as Real Betis aim to upset Chelsea\n28/05/25 05:44Antony will look to inspire the Spanish side against Chelsea on Wednesday night as they seek to win a first European trophy. The winger has been in dazzling form since joining on loan in January.Lamine Yamal signs new bumper SIX-YEAR Barcelona deal, keeping him at the club until he's 23 - with a 'significant' pay rise for superstar, 17\n27/05/25 22:02Lamine Yamal has signed a new contract at Barcelona which will keep him at the club until 2031. His previous deal was set to expire next summer.Real Madrid confirm Xabi Alonso as their new head coach on a three-year deal after Carlo Ancelotti's exit to Brazil... with ex-Man United boss Erik ten Hag the frontrunner to replace him at Bayer Leverkusen\n25/05/25 10:14The Spanish giants announced that he would sign a three-year deal, beginning on June 1 and running to June 30, 2028. He will lead the side at the Club World Cup this summer.Pepe Reina, 42, endures NIGHTMARE end to his career - as Liverpool legend and World Cup winner is sent off in final game before retirement\n24/05/25 07:54The Liverpool legend, who made 394 appearances for the Reds, was playing his 13th game of the season for Como after joining the Serie A outfit last summer.Barcelona sporting director Deco admits they ARE interested in signing Man United outcast Marcus Rashford - but there is another Premier League winger on their shortlist too\n22/05/25 17:33Rashford, 27, has been in mixed form for Aston Villa since joining them on loan for the second half of the season from Manchester United during the January transfer window.Lamine Yamal 'set to take Lionel Messi's iconic No 10 shirt at Barcelona after signing new deal with €1BILLION release clause' this summer\n20/05/25 08:25Lamine Yamal will reportedly inherit Lionel Messi's iconic No 10 shirt at Barcelona after signing a new contract with the club this summer.Barcelona star Gavi and his stunning girlfriend go viral as they pack on the PDA at the club's LaLiga title party\n19/05/25 06:55Barcelona star Gavi and his girlfriend Ana Pelayo turned on the charm at the club's LaLiga title party on Sunday night. The duo were seen cuddling and walking around on the pitch together.Lamine Yamal stunner delivers LaLiga title for Barcelona at the home of their rivals... who turn on the sprinklers to dampen celebrations as Hansi Flick FUMES at his players\n15/05/25 21:28The Catalan giants needed just three points from their final three games to regain the Spanish top flight title after they beat Real Madrid 4-3 in an enthralling El Clasico on Sunday.Shocking moment a car ploughs into huge crowd of football fans near stadium before Barcelona derby clash\n15/05/25 20:56Shocking footage shows the moment a driver mows into supporters who had gathered near the RCDE Stadium, located on the outskirts of Barcelona.The making of Adam Wharton - and why Real Madrid, Barcelona and Liverpool all adore £60m Crystal Palace superstar\n15/05/25 16:00Everything comes easy to a lucky few and here waddled a two-year-old Adam Wharton. The youngster wriggling out of his buggy at football club Wilpshire Wanderers.Barcelona 'confirm the date for return to Nou Camp' - after £1.25bn project was hit with repeated delays\n15/05/25 15:57The Catalan giants started work on their world-famous stadium to increase its capacity to a staggering 105,000, after winning LaLiga back in June 2023.Rodrygo sends a message to his critics with pointed social media post after Real Madrid star was linked with a move away from the Spanish giants\n14/05/25 13:57The Brazil international is enduring a rare dip in form that has seen him sidelined by outgoing head coach Carlo Ancelotti , with Turkish midfielder Arda Guler increasingly preferred in midfield.Real Madrid 'consider letting Vinicius Jnr move on amid tense contract discussions' - with Brazil star demanding nearly DOUBLE Kylian Mbappe's salary and using a multi-million-pound Saudi deal 'which doesn't exist' as leverage\n14/05/25 09:38Vinicius is currently contracted through until 2027 and is one of the highest earners at the club, but the finer points of a new deal are still yet to be confirmed.Inside Real Madrid's struggles: Stars blasted as 'too individual', Rodrygo's rift with Jude Bellingham and how Kylian Mbappe's arrival unbalanced Carlo Ancelotti's star-studded side\n13/05/25 21:01Just under a year ago, Carlo Ancelotti was being tossed into the air at Wembley as Real Madrid players toasted clinching a record-extending 15th European Cup in the club's history.Carlo Ancelotti appointed Brazil manager after disappointing Real Madrid campaign - with Xabi Alonso expected to take over at the Bernabeu\n12/05/25 13:20The 65-year-old had one year left on his contract at the Bernabeu but a deal has been brokered by businessman Diego Fernandes, on behalf of the Brazil Football Confederation.Barcelona 4-3 Real Madrid: Catalans all but seal LaLiga title despite Kylian Mbappe hat-trick in thrilling El Clasico\n11/05/25 16:28AADAM PATEL AT THE ESTADI OLIMPIC LLUIS COMPANYS: At the start of this season, the Barcelona hierarchy had marked this fixture for a grand homecoming to the Nou Camp.Barcelona 4-3 Real Madrid RECAP: Kylian Mbappe hat-trick not enough as Lamine Yamal and Co edge breathless Clasico to close in on La Liga title\n11/05/25 13:01Follow Mail Sport's live blog for the latest score, team news and updates as Barcelona welcome Real Madrid to the Estadi Olimpic Lluis Companys for El Clasico in La Liga.Carlo Ancelotti gives his verdict on Xabi Alonso amid rumours former Liverpool midfielder is poised to replace him as Real Madrid manager\n10/05/25 18:28Alonso, who played for both Real Madrid and Liverpool during a glittering career that included Champions League triumphs with each club, is leaving Leverkusen this summer.Hilarious moment Lamine Yamal gives FAKE name to woman who asked Barcelona star to take photo - before realising it was the teenage sensation\n10/05/25 11:31Despite word of the youngster's extraordinary abilities with a ball at his feet extending around the world, Yamal was somehow not recognised straight away in his home city by a group of women.Arsenal 'agree deal' to sign Martin Zubimendi from Real Sociedad - with Gunners 'set to trigger' £51m release clause ahead of summer move\n10/05/25 08:33Mail Sport revealed in January that the defensive midfielder has been courted by Mikel Arteta for over a year, with the deal having been effectively sealed since the winter transfer window.Xabi Alonso 'WILL replace Carlo Ancelotti at Real Madrid' - with announcement date 'revealed'\n09/05/25 09:00Carlo Ancelotti, 65, has faced pressure this season despite being one of the most decorated managers ever, and bringing immense success to the Santiago Bernabeu.Arne Slot breaks his silence on Trent Alexander-Arnold's Liverpool exit - as he makes Conor Bradley promise\n09/05/25 08:18LEWIS STEELE: Arne Slot says he is disappointed that Trent Alexander-Arnold is leaving Liverpool - but the boss is confident that they can live without him and other players will step up.Premier League clubs put on transfer alert after Real Madrid 'opens the door for one of their top stars to leave this summer'\n08/05/25 16:41The arrival of superstar Kylian Mbappe has failed to have an immediate impact, with the club as yet without silverware this term, and four points behind the Blaugrana in the league standings.Trent Alexander-Arnold shouldn't have to be apologetic in his Liverpool farewell video: He is a Premier League great and moving to the perfect club, writes IAN LADYMAN\n05/05/25 12:08IAN LADYMAN: Trent Alexander-Arnold used to get angry as a young player at Liverpool's academy. It's fair to say he got over all of that and proved those age group coaches wrong.Kylian Mbappe and Arda Guler both score STUNNERS for Real Madrid as Carlo Ancelotti's side edge out five-goal thriller against Celta Vigo to keep LaLiga title race alive\n04/05/25 16:45Defending champions Real's fourth win in a row kept their title dream alive with four matches to go in the Spanish top flight thanks to stunning goals from Mbappe and Guler.Inside 'Antony Fever' at Real Betis: How Man United's £86m flop turned his career around - 'I'll pay to kidnap him so he stays this summer'\n02/05/25 11:00Many anticipated an arrogance, an ego that he was too good for the club and the level he was perceived to be dropping too. The reality, multiple sources stressed, was so far from that.Real Madrid TV launch fresh attack on referees ahead of LaLiga clash - after throwing Copa del Rey final into chaos with critical video targeting official\n01/05/25 18:22Real Madrid's in-house television channel have previously been outspoken about officials, and even last week aired a highly critical video on Thursday targeting referee Ricardo de Burgos Bengoetxea.The issues at Real Madrid - and the scenes at Anfield - which COULD have Trent Alexander-Arnold reconsidering his Liverpool future, writes LEWIS STEELE\n28/04/25 16:00LEWIS STEELE: These are the days, my friends. Those were the words of one gentleman who was standing ambitiously on top of a bus stop with a red flare in his right hand and a can of lager in the other.Copa del Rey final thrown into chaos as Real Madrid withdraw from pre-match activities and match official breaks down CRYING in response to critical video shared by Los Blancos' in-house TV channel\n25/04/25 23:08Preparations for the Copa del Rey final were thrown into turmoil on Friday when Real Madrid accused the match referees of having 'animosity and hostility' towards them.Carlo Ancelotti blasts young Real Madrid star after his failed chip led to him being substituted by furious boss\n24/04/25 08:23Ancelotti was furious when the 18-year-old, on his first La Liga start, tried to chip Getafe's goalkeeper after being played through by Vinicius Jr. He was immediately replaced by Jude Bellingham.Vinicius Jnr 'makes decision on Real Madrid future amid £830m five-year deal on offer from Saudi Arabia'\n23/04/25 08:40Vinicius has developed into one of the best players in the world during his time at the Bernabeu and he has won 14 trophies with the Spanish giants, including two Champions League titles.\nPage\nStars of sport\n-\nFans spot Liam Delap's telling reaction and say the same thing after Chelsea striker watched Joao Pedro's goal in win over Bayer Leverkusen\n-\nTer Stegen is REINSTATED as Barca captain just a day after being stripped of it - as he reaches an agreement with club over medical saga\n-\nHowe says there is currently NO chance of Isak playing in Newcastle's opening game of the Premier League season as he lifts lid on private talks\n-\nShocking moment football thug tries to FIGHT opposition players during ugly brawl on opening game of the season - before flatlined by security\n- Riyad Mahrez makes surprise return to Man City training as Rodri compares former star to new club signing Fan favourite got a warm reception back at the club\nmore stars of sport\n-\nSky Sports presenter and WAG of Championship manager returns to work after cancer battle and a brain infection which left her in a coma\n-\nFoden criticised after City star IGNORES fans asking for his autograph in footage - but TikTok users point out one key reason why he was RIGHT\n-\nHannah Hampton reveals she launched rival keeper's cheat sheet into the CROWD during Euros final shootout in bid to help Lionesses team-mates\n-\nFormer Man United man appeals for help after being burgled during house move as thieves steal car full of valuables in overnight raid\n-\nCristiano Ronaldo marks 'landmark anniversary' with stunning hat-trick in thumping Al-Nassr win - as £26m signing Joao Felix dazzles\n-\nUFC legend Michael Bisping appeals for information on serial killer after claiming man broke into his house and attempted to attack him with a hammer\n-\nHarry Kane SKIES his penalty against Tottenham after scoring the opener in Bayern Munich's pre-season clash against his former club\n-\nMan United fan sets up GoFundMe page to try and raise money for Red Devils to sign Carlos Baleba after they 'made contact with Brighton to enquire about move'\n-\nFormer Man City and European Championship-winning goalkeeper 'sentenced to TWO YEARS in prison for more than 100 cases of fraud'\n-\nCesc Fabregas' Como players involved in mass brawl with Real Betis stars in pre-season clash- with ex-Premier League hero appearing to PUNCH opponent\n- Son Heung-min says goodbye to Tottenham as club legend reads emotional letter to fans after completing record-breaking move to LAFC End of a special era\n-\nRevealed: Record-breaking amount Emma Raducanu will bank if she regains her US Open title - with prize money having more than doubled since 2021 win\n-\nFurious Villarreal fans sign petition in last-ditch attempt to STOP Spanish club signing Thomas Partey after UK court opened door to move amid rape case\n-\nJose Mourinho fights back tears during tribute to his Champions League winning Porto captain Jorge Costa following shock death at 53\n-\nBarcelona give update on registration of six players - with Marcus Rashford among stars sweating on being available for start of LaLiga season\n-\nEx-Arsenal star reveals he squared up to Henry and used to get BLACK EYES from his team-mates as he lifts the lid on fighting culture under Wenger\n- Fans are convinced they know who Jamie Vardy's next club will be after his wife Rebekah's latest social media post The internet has been set ablaze with playful post\n-\nWelcome to Chelsea, finally! Estevao arrives ONE YEAR on from signing for the Blues - and after scoring against them at Club World Cup\n-\nEx-UFC star Michael Bisping claims to have been target of hammer-wielding arsonist serial killer who terrorised north England for more than a decade\n- Liverpool fans declare 16-year-old wonderkid is ready NOW after stunning solo goal just two minutes into his Anfield bow Sensational effort\n- UFC legend drops YouTube fighter with BRUTAL head kick after becoming enraged by opponent taunting him Mighty Mouse lost his cool during video\n-\nWatch the moment furious Roberto De Zerbi is pulled apart from a Marseille player in training - as the furious Italian tells star to 'call your agent'\n-\nTom Brady accused of showing 'ZERO class' after NFL legend's scathing opinion of Wayne Rooney's 'work ethic' made the final cut of new documentary\n- Lamine Yamal mural is vandalised with brutal dwarf slur after Barcelona star's controversial 18th birthday party antics Star made headlines\n- Chris Woakes put into bat for England with ONE ARM as injured hero wears sling for dramatic final stand against India But it was all in vain\n-\nEXCLUSIVE\nJude Bellingham reveals nasty-looking shoulder scar after England star went under the knife following TWO-YEAR ordeal with secret issue\n- Lewis Hamilton refuses to back down from his explosive 'change the driver' comment as he gives cryptic interview\n- Thomas Partey 'set to join LaLiga side' as free agent - despite ex-Arsenal star facing rape charges\n- EXCLUSIVE Rebecca Loos says it was 'unjust that her life became hell' after David Beckham scandal as she returns to the spotlight for Celebrity SAS\n- Rebecca Loos says it was 'unjust that her life became hell' after David Beckham scandal as she returns to the spotlight for Celebrity SAS\n-\n7ft 2in South Korean MMA star BICEP CURLS Tottenham star Son Heung-min - as the Spurs captain prepares to bow out in front of his home country\n- Sir Chris Hoy explains why he feels 'lucky' after cancer diagnosis granted him 'the time to really appreciate life' He gave three reasons\n- Cristiano Ronaldo defended from 'immense injustice' over his absence from Diogo Jota's funeral The Portuguese FA chief has issued a statement\n-\nRed Bull's Max Verstappen discovers his punishment for bizarre towel-throwing incident during Hungarian Grand Prix practice session\n-\nSon Heung-min bids tearful farewell to Tottenham after telling the club he wants to LEAVE - as he the decision 'one of the hardest of my career'\n-\nHow long Real Madrid defender Raul Asencio could face in prison as prosecutors seek sentence - after he allegedly shared explicit video involving a minor\n-\nChinese schoolgirl becomes the youngest-ever World Swimming Championships medallist after picking up relay bronze aged 12 years and 9 months\n- Anthony Joshua drops hint over new venture with Eddie Hearn after praising his promoter's family for 'conquering' sport A new sport?\n-\nMoment South Korean Tottenham fan bursts into tears after meeting James Maddison - as he and team-mates receive rapturous welcome\n- Olympic champion Laura Dahlmeier's body 'to be left on the mountain' following tragic accident in Pakistan As per her request\n-\nEngland pay emotional tribute to legendary batsman Graham Thorpe at the Oval - as hosts mark 56th birthday almost a year on from his death\n-\nDon't look back in anger, Christian! Sacked Red Bull boss Horner enjoys Oasis gig at Wembley while wife Geri rubs shoulders with Lioness heroes\n-\nEngland hero Toone reveals hidden family heartbreak she suffered just hours before the Lionesses won the Euro 2025 final as she pens emotional message\n-\nJadon Sancho 'tells Dortmund he will chop his staggering Man United salary in HALF' - as £73m exile looks to escape bomb squad with summer move\n-\nJoao Felix's £26m Al-Nassr move makes him the fourth-most expensive star of all-time in combined transfer fees - but who tops the list?\n- Tiger Woods' son Charlie, 16, explodes into form with stunning round that echoes his legendary dad Put in an impressive performance\n- Former Premier League star found guilty after bombarding his ex-girlfriend with calls, emails and LinkedIn requests - as well as going to her home\n-\nEXCLUSIVE\nBurnley to show first ever football match in VIRTUAL REALITY: Fans offered chance to watch Lazio friendly from own home with live commentary\n- Forgotten Liverpool player stars in professional footgolf tournament... as he shares footage of stunning putt Reds cult hero\n-\nLuis Diaz completes £65.5m transfer from Liverpool to Bayern Munich - as forward pens lucrative four-year deal with the German giants\n-\nClattenburg accuses ex-Chelsea star Mikel of 'swinging PUNCHES' at him in new revelations about clash - and claims Blues wanted 'payback' for Terry race row\n- Why former Arsenal star Thomas Partey will still feature on Premier League trading cards this season despite facing rape charges Raising eyebrows\n-\nEXCLUSIVE\nPremier League could come under pressure to SCRAP Summer Series amid club anger - as major reason for frustration is revealed\n-\nInside the Lionesses' jubilant Euro 2025 victory parade: How Wiegman let her mask slip, Kelly's iconic f-bomb, and Williamson's touching message\n-\nMan City complete signing of Trafford in British record deal for goalkeeper as Pep Guardiola becomes first manager in history to spend €2bn\n-\nLionesses arrive at No 10 to meet with Angela Rayner after touching down in the UK to heroes' welcome after their history-making second Euros victory\n-\nMary Earps and Millie Bright break their silence on England's Euro 2025 triumph - after dropping out of selection pre-tournament\n-\nLuke Littler celebrates making darts history on stage with his girlfriend... after confirming relationship with subtle gesture on live TV\n-\nVictorious Lionesses land back in the UK as fans flock to see their Euros heroes ahead of trip to Downing Street - despite being told to STAY AWAY\n- Pep Guardiola compared by fans to Ted Lasso as Man City boss debuts surprise new look ahead of pre-season return Strong facial hair\n-\nInside the Lionesses' all-night party after winning the Women's Euros: Players down wine and sing Sweet Caroline as they celebrate until 4.10am\n- Marcus Rashford, 27, 'is BACK with ex-fiancee' Lucia, 26, two years after split - as she 'joins him in Barcelona to help him settle' after Man United exit\n- UFC fighter left completely disfigured by gruesome injuries as fans call for referee to be fired over brutal bout Ugly scenes inside the Octagon\n-\nThe Lionesses are on the brink of glory at the Euros... and so is their market value! How women's team are entering their 'influencer' era\n-\nLoris Karius bares all on his relationship with TV presenter wife Diletta Leotta - as he reveals her honest thoughts on living apart in Germany and Italy\n-\nMan United 'scout 6ft 5in centre back compared to Rodri as Harry Maguire's long-term successor' - but Red Devils 'face competition'\n- Lewis Hamilton gives BLUNT verdict on Christian Horner sacking - as Red Bull prepare for first race since dismissing Geri Halliwell's husband\n- EXCLUSIVE Wrexham make shock move to sign Christian Eriksen, weeks after he left Man United: Agent confirms talks over shock transfer\n- Man United are trialing high-tech cooldown jackets used in cycling and F1 - as Ruben Amorim's men battle soaring temperatures\n- England's opponents STILL desperate to escape World Cup kiss-gate drama: 'Stained' Spain want to win Euros final to relive moment stolen from them\n- Benjamin Mendy released by Swiss club after just EIGHT games after partying antics left club bosses furious\n- Dana White opens up on Hulk Hogan's love for Donald Trump in emotional tribute to the late wrestler\n- Former Man United star Javier Hernandez breaks silence after he was fined following sexist comments\n- The humble son of Eritrean refugees who could smash the British transfer record: How Newcastle star Isak rose to the top amid Liverpool interest\n-\nThe Rock pays emotional tribute following WWE legend's Hulk Hogan's passing as he recalls incredible first encounter with his hero aged just 12\n- Rashford trades supercars for modest £25,000 company car as Man Utd outcast checks in for Barcelona training - having sold his £450,000 Lamborghini\n-\nWSL 2025-26 fixtures RELEASED: Chelsea face Man City in blockbuster opener, Arsenal's Emirates homecoming and a tasty start for Liverpool\n- EXCLUSIVE Sport's biggest bullies exposed by JONATHAN McEVOY: I've had enough and I'm naming ALL the names Sport is a selfish business\n- Erling Haaland treats girlfriend Isabel Haugseng to a £330,000 Hermes Himalaya Birkin handbag on their lavish summer holiday Flaunted on Instagram\n-\nThe lonely tour life of Emma Raducanu: Brit tennis star opens up on why she doesn't have friends in her sport - and what she finds 'very difficult' on tour\n-\n'Annoying, arrogant and promoting prison culture': Lamine Yamal, 18, is given brutal x-rated dressing down over his behaviour by a World Cup winner\n-\nAlejandro Garnacho sends two-word message to Marcus Rashford after Barcelona move - as star becomes first Man United 'bomb squad' member to depart\n- Chelsea striker Liam Delap's influencer girlfriend confirms split from the Blues' new £30m star amid Club World Cup celebrations Clearing the air\n-\nIt really is his dream move! Grinning Marcus Rashford has fans spotting his remarkable glow-up at Barcelona unveiling compared to 'rough' Villa photos\n- Diogo Jota's Liverpool team-mate reveals heartbreaking new tribute tattoo to 'a true legend' two weeks on from star's tragic death Permanent tribute\n- Ex-Arsenal star sentenced last month for part in £600k drug smuggling plot signs for new team after being released on parole Back on the pitch\n-\nBarcelona LEAK Marcus Rashford transfer announcement before hastily deleting video - with on-loan Man United forward 'set to be handed iconic shirt No\n-\nAlexander Isak appears to train alone at Newcastle, as 'huge wage demands are revealed' to sign new contract amid interest from Liverpool\n- Watch the hilarious moment Sir Alex Ferguson gatecrashes Rio Ferdinand's podcast - and delivers a firm dressing down\n- Inside the 'insane' mansion party that 'disrupted' reclusive Daniel Dubois' £10m world title fight: Boxer's hands-on dad invited 70 'strangers'\n- Pumped-up Gerwyn Price involved in angry on-stage clash with Daryl Gurney after sarcastic celebration at World Matchplay Darts\n-\nColdplay couple who were caught on infamous kiss cam are hilariously mocked by darts fans in Blackpool at World Matchplay tournament\n-\nEXCLUSIVE\nLionesses' main character bringing calm to the chaos: Why Chloe Kelly, with her wedding photos on her shinpads, is ready to inspire England in Italy semi"
    },
    {
      "url": "https://www.dailymail.co.uk/sport/fc-barcelona/index.html",
      "text": "Advertisement\nBarcelona\nFC Barcelona is one of the world's most iconic football clubs, founded in 1899. Based in Barcelona, Spain, the club is renowned for its rich history, exceptional talent, and distinctive playing style. The club's home stadium is Camp Nou, Europe's largest stadium. Its famed youth academy, La Masia, has produced stars like Lionel Messi and Xavi.\nNews, match reports, previews, pictures, fixtures and team gossip for Barcelona Football Club\nPage\nMarc-Andre Ter Stegen is REINSTATED as Barcelona captain just a day after being stripped of the armband - with goalkeeper reaching an agreement with Catalan club over his medical saga\n08/08/25 23:12\nMarc-Andre Ter Stegen has been reinstated as Barcelona's first-team captain after a brief disciplinary saga, the club confirmed on Friday. The dispute began when the goalkeeper refused to authorise Barcelona's medical services to submit his post-surgical report to LaLiga, prompting the club to strip him of the armband and open disciplinary proceedings. By withholding the medical report, Barca risked not being able to register new signings due to LaLiga's strict financial fair play rules....read\nLaLiga legend calls out Marc-Andre ter Stegen after goalkeeper was stripped of Barcelona captaincy as he says 'his behaviour has left a lot to be desired'\n08/08/25 07:03The Catalan outfit announced that they have removed the armband from the German and opened disciplinary proceedings following a stunning medical dispute.Barcelona give update on registration of six players - with Marcus Rashford among stars sweating on being available for start of LaLiga season\n05/08/25 22:26The reigning LaLiga champions, however, have faced difficulties in registering players with the league due to their ongoing financial situation and open the new season on August 16.One of Europe's best strikers killed and ATE a pigeon at Barcelona's iconic training ground, leaving staff and players stunned, claims former teammate\n05/08/25 12:11Sergi Gomez, who spent eight years at Barcelona after joining aged 14, made the sensational allegation during an appearance on a Spanish podcast.Lamine Yamal 'embroiled in ANOTHER love triangle' with Barcelona golden boy 'spotted kissing Argentine model, 24, after controversial 18th birthday party' having 'stopped following' Cuban singer\n05/08/25 08:22Just weeks after spending time with OnlyFans sensation Fati Vazquez in Italy, Yamal has been accused of moving on to another model.Marcus Rashford scores his first goal for Barcelona with cool finish as Spanish side thrash Daegu 5-0\n04/08/25 13:28Marcus Rashford has got off the mark for Barcelona, scoring in Monday's 5-0 friendly win over South Korean side Daegu.Lamine Yamal mural is vandalised with brutal dwarf slur after Barcelona star's controversial 18th birthday party antics with scantily-clad models\n04/08/25 13:00A mural of Barcelona star Lamine Yamal has been vandalised, with references made to dwarfism. The mural, which was designed by Plaza Joanic, was unveiled last month.Man United 'are willing to meet £61m asking price' for Barcelona star - but 'will wait for Benjamin Sesko's decision' before launching summer move\n02/08/25 19:25The Catalan giants are open to offers for a number of their players this summer as they try to generate funds in order to register their new signings.Chelsea 'edge closer' to £60m deal for Xavi Simons as star 'REMOVES mention of RB Leipzig from his social media profile'\n01/08/25 18:26The Blues are looking to strengthen their frontline with Simons and the United outcast ahead of their return to the Champions League this season.Pierre-Emerick Aubameyang opens up on why he linked up with Mason Greenwood at Marseille - as he reveals the one word former team-mate used to describe the former Man United man\n01/08/25 17:09The Gabon international, now 36, will be lining up alongside Greenwood at Marseille next season after making his return to the French club this week.Former Barcelona player hospitalised in Greece after being bitten on his genitals while walking his dog\n31/07/25 18:04The winger, now on loan at Aris Thessaloniki from Celta Vigo, was reportedly trying to break up a fight between his own dog and another when the painful incident occurred.Jadon Sancho 'tells Borussia Dortmund he will chop his staggering Man United salary in HALF' - as £73m exile looks to escape Ruben Amorim's bomb squad with summer move\n31/07/25 14:46Jadon Sancho is scrambling to find his next club and willing to 'cut his Manchester United salary in half' to rejoin Borussia Dortmund. He is desperate to leave Old Trafford this summer.Jose Mourinho closes in on signing Premier League defender - with ex-Barcelona player arriving in Turkey ahead of Fenerbahce medical\n30/07/25 23:45The Turkish outfit announced on Wednesday that the player has 'arrived in Istanbul to further his transfer negotiations with our club and undergo a medical examination.'Barcelona 'could be forced to push back Spotify Nou Camp return for a FIFTH time' - as Blaugrana sweat over £1.3bn project's key requirement\n30/07/25 06:41Barcelona fans have been hit with news that their Nou Camp return is set to be delayed yet again, with the club drawing up plans for options for the of the season.Lionel Messi spotted wearing '$2m' watch on Inter Miami sidelines... and there's only 10 of them in the world!\n29/07/25 22:01The former Barcelona and PSG star Miami's clash against FC Cincinatti from the sidelines after being handed a one-match ban for missing the MLS All-Star game.Pep Guardiola opens up on wanting to retire 'to watch COWS' when he leaves role as Man City manager\n29/07/25 07:43Pep Guardiola has opened up on his future as Man City manager with a strange analogy. He dropped the bombshell that his plans for when he leaves are 'decided'.Chloe Kelly is the perfect antidote to the colossal egos of men's football - Marcus Rashford and Co could learn so much from her class, grace and strength in adversity: IAN HERBERT\n28/07/25 16:00There was something sublime about 10 minutes in Chloe Kelly's company. Something that took you a very long way from the moody, miserable self-absorption of the men's game.Marcus Rashford makes first Barcelona appearance in short-lived cameo - as he is subbed on and off during pre-season friendly after completing loan move from Man United\n27/07/25 13:08Rashford, 27, pulled on the famous blue and red stripes of his new club for the first time in a 3-1 friendly win over Japanese side Vissel Kobe.Indian FA reveals job applications from Pep Guardiola and former Barcelona manager Xavi were a HOAX, after team director was tricked by fake emails\n26/07/25 17:14The AIFF's national team director had told the Times of India that Xavi's name had appeared among the applicants - with a technical committee member claiming he was considered too expensive.Chelsea in 'advanced talks for £60m Bundesliga star' as Blues 'look to bolster attacking options' after Liam Delap, Joao Pedro and Jamie Gittens arrivals\n26/07/25 12:09The 22-year-old attacking midfielder, who was once a wonderkid at Barcelona , is expected to leave the Bundesliga club this summer after they failed to secure Champions League football last season.Alan Shearer gives verdict on Marcus Rashford's loan to Barcelona - as the Newcastle legend names the key factor he will need to be a success in LaLiga\n26/07/25 10:21Barcelona have long been linked with a move for Rashford, and a deal finally came to fruition this week as he completed a season-long loan move to the Catalan club.Lionel Messi left 'extremely upset' after picking up bizarre MLS ban - as Inter Miami star and team-mate Jordi Alba hit with 'draconian' suspension\n26/07/25 09:29The former Barcelona stars have been left bemused over the strange decision, dubbed 'draconian', after they missed Wednesday's MLS All-Star game in Texas on Wednesday.Marcus Rashford, 27, 'is BACK with ex-fiancee' Lucia, 26, two years after split - as she 'joins him in Barcelona to help him settle' after Man United exit\n25/07/25 22:40The former Manchester United forward completed a season-long loan move to Barcelona this week, joining the Catalan club after breathing new life into his career on loan at Aston Villa.Ruben Amorim reveals he WILL welcome 'Bomb Squad' players back into the Man United fold if they are not sold after leaving them at home amid US pre-season tour\n25/07/25 17:50CHRIS WHEELER IN CHICAGO: Alejandro Garnacho , Jadon Sancho , Antony and Tyrell Malacia have been left to train at Carrington while United are on tour in the US this summer.Revealed: Secret 'texts' between Marcus Rashford and Lamine Yamal - and how his signing has been received in the Barcelona dressing room\n25/07/25 14:26The 27-year-old English forward was officially unveiled as the latest additional to Hansi Flick's star-studded squad on Wednesday following weeks of speculation.Marcus Rashford trades supercars for modest £25,000 company car as Man United outcast checks in for Barcelona training - having sold his £450,000 Lamborghini after driving ban\n25/07/25 09:55The loanee looked focused as he coasted past a gaggle of fans filming his arrival in a CUPRA, which every member of the squad receives.Barcelona chief offers MAJOR update in transfer race for Liverpool star - after Catalan giants added Man United outcast Marcus Rashford\n25/07/25 09:19Barcelona have been in hot pursuit of the Liverpool star this summer, but the Premier League champions have insisted they have no intention of selling him.Meet the Lionesses' greatest threat to Euros glory: Just THREE WEEKS after being hospitalised with rare illness, Spain's Aitana Bonmati is set to terrorise England in the final\n24/07/25 18:03TARA ANSON-WALSH: When reports surfaced that Bonmati was battling viral meningitis on the eve of the competition, the news sent shockwaves through the footballing community.Inside Marcus Rashford's five-star welcome to Barcelona: Man United exile given VIP treatment at £156-per-head restaurant visited by Barack Obama and Steven Spielberg\n24/07/25 14:54Marcus Rashford celebrated his loan move to Barcelona by dining out with the club's president Joan Laporta and other members of the board at one of the city's most exclusive restaurants.Barcelona cancel pre-season friendly against Vissel Kobe in Japan due to 'contractual breaches' - with their fixtures in South Korea also in jeopardy\n24/07/25 10:16Barcelona's pre-season preparations have taken a major blow after they cancelled their first fixture ahead of the new campaign.'Annoying, arrogant and promoting prison culture': Lamine Yamal, 18, is given brutal x-rated dressing down over his behaviour by a World Cup winner\n24/07/25 07:22Lamine Yamal has been rebuked for being arrogant and having a 'prison culture' attitude by a former World Cup winner.Alejandro Garnacho sends two-word message to Marcus Rashford after Barcelona move - as star becomes first Man United 'bomb squad' member to depart\n23/07/25 23:51Rashford had been one of five players placed in Man United's 'bomb squad' this summer, with Amorim determining them to have no future at the club, with fellow member Garnacho toasting his move.Grinning Marcus Rashford has fans spotting his remarkable glow-up at Barcelona unveiling compared to 'rough' Aston Villa photos\n23/07/25 23:04Marcus Rashford was seen beaming when he was unveiled as a Barcelona player on Wednesday having completed a season-long loan move from Manchester United.Marcus Rashford looks like a man reborn after leaving Man United for Barcelona... this opening chapter to his new life in Spain could scarcely have gone better, writes NATHAN SALT\n23/07/25 21:30NATHAN SALT IN BARCELONA: As the Mercedes carrying Marcus Rashford turned the corner towards the offices at the Camp Nou, a crowd of giddy youngsters suddenly sprung into life.Marcus Rashford delivers Man United farewell message at Barcelona unveiling - as exiled star looks forward to 'next chapter' with Spanish giants\n23/07/25 17:57Rashford has joined the Spanish giants on a season-long loan move, with Barcelona having the option to make the deal permanent for around £30m next summer.Marcus Rashford COMPLETES loan move to Barcelona from Man United as Red Devils outcast bids for career kickstart after being frozen out by Ruben Amorim\n23/07/25 16:52Marcus Rashford has said it will be a 'joy' to play for Barcelona and feels like he is 'at home' after completing a season long loan move to the Spanish giants from Manchester United.Marcus Rashford transfer RECAP: Manchester United star completes loan move to Barcelona with Nou Camp unveiling\n23/07/25 16:00Re-live Mail Sport's live blog after Marcus Rashford was announced as a Barcelona player having completed his loan move from Manchester United.Barcelona LEAK Marcus Rashford transfer announcement before hastily deleting video - with on-loan Man United forward 'set to be handed iconic shirt No at the Spanish giants'\n23/07/25 15:24Barcelona have jumped the gun by leaking their transfer announcement of Marcus Rashford, before hastily deleting the video. They are poised for the official unveiling.Marcus Rashford can excel away from 'rotten' Man United like recent players, believes Gary Lineker - as he backs 'unbelievable' forward to be a 'great signing' at Barcelona ahead of loan\n23/07/25 11:34The Manchester United star is on the verge of completing a dream loan move to the Spanish giants. Barca will pay all of his £315,000-per-week wages.Marcus Rashford is 'spotted' filming with classic British red phone box on pitch, as Barcelona pull out all the stops ahead of official unveiling of Man United exile\n22/07/25 16:43Rashford, 27, is in line for a loan move to the LaLiga giants in what would be a much needed fresh start for him after a tumultuous period at Old Trafford in recent seasons.Inside Marcus Rashford's move to Barcelona: The key figure at the club who always wanted the Man United man ahead of Nico Williams - and the reasons why\n21/07/25 01:00PETE JENSON: Rashford rest easy after leaving behind his life as a United cast-off to become Barcelona's headline summer signing and their first Englishman since Gary Lineker left in 1989.Marcus Rashford pictured arriving in Barcelona as it emerges Man United exile is taking a pay cut to complete dream move\n20/07/25 21:03PETER JENSON: The Spanish champions made the Man United outcast - who was seen arriving in Barcelona on Sunday - their top target despite flirtations with Luis Diaz and Nico Williams.Revealed: Marcus Rashford 'to pick from TWO iconic Barcelona numbers' as Man United forward nears loan move to Spanish giants\n20/07/25 18:54Rashford will fly to Barcelona to undergo a medical before signing the relevant paperwork and being officially unveiled with a number.Footballers and their extravagant parties: Dwarf-tossing, dressing up as a Klansman and FIVE-DAY benders… how Lamine Yamal isn't the first star to land himself in trouble for wild celebrations\n20/07/25 12:55Lamine Yamal is the latest star to throw a bash that has landed him in trouble. The Barcelona and Spain star has been widely criticised for an 18th birthday celebratory bash.Revealed: How much of Marcus Rashford's wages Barcelona will pay - as Man United outcast closes in on Old Trafford exit\n20/07/25 09:07Barcelona 's contribution to Marcus Rashford's huge Manchester United salary has been revealed. There is an agreement in principle for Rashford to join Barcelona on a season-long loan move.It wasn't meant to end like this for Marcus Rashford at Man United but Barcelona move could relight the fire, writes CHRIS WHEELER\n19/07/25 21:35CHRIS WHEELER: It has been a rather ridiculous situation at Carrington over the last two weeks. No sooner has Amorim driven out of Man United's training ground than Rashford has pulled in.Marcus Rashford on the brink of Man United exit as Barcelona enter final stages of loan-to-buy agreement - with Red Devils exile approved by manager Hansi Flick\n19/07/25 12:58It's understood there is an agreement in principle for the deal to go through which would see Barcelona pay all of Rashford's £315,000-a-week wages and include an option to buy.Revealed: The message Barcelona sent Nico Williams that 'collapsed the £50m deal' and triggered his stunning U-turn\n19/07/25 11:03The 22-year-old was one of Europe's hottest targets at the beginning of the summer transfer window and was coveted by Arsenal, Bayern Munich and Chelsea as well as the LaLiga champions.Man United, Liverpool and Man City are STRIPPED of their status as past world champions: FIFA change their roll of honour after Chelsea's Club World Cup triumph\n19/07/25 07:51The Blues beat Champions League winners, and favourites, Paris Saint-Germain on Sunday night after a Cole Palmer masterclass, having scored two and assisted another.Marcus Rashford 'targeted by European giants' who hope to rival Barcelona as he moves closer to Man United exit door\n16/07/25 22:21The European giants are said to be exploring the possibility of a move for the wantaway Manchester United forward.Barcelona hand Lamine Yamal iconic shirt number as club look to allay fears of 'bad influence' in wake of 'dwarves and escorts' 18th birthday party\n16/07/25 19:32It comes with the forward caught in a storm after his controversial 18th birthday party, with the Spanish government demanding an investigation. It is claimed that 'dwarves were exploited'.Barcelona set to postpone Spotify Nou Camp's return date AGAIN ahead of new season - as reason for yet another delay of £1.25bn project is revealed\n16/07/25 15:56Barcelona 99,000-seater Nou Camp stadium has been closed since renovations began in 2023 and was supposed to be reopened last November, before being pushed back to next month.Man United legend Teddy Sheringham makes 'soul-destroying' admission over Marcus Rashford's fallout at Old Trafford... and weighs in on Barcelona's interest in the 'bomb squad' exile\n16/07/25 13:34CHRIS WHEELER: The Catalan giants are favourites to sign Rashford on loan this season after holding talks with his representative and older brother Dwaine Maynard.The 'bad influence idol' Barcelona fear will lead Lamine Yamal astray: Why trip with party-loving Neymar before his 'dwarves and escorts' birthday and OnlyFans star holiday is raising alarm\n16/07/25 12:36One chapter of Yamal's exuberant summer surprisingly came when he visited former Barcelona star Neymar in Brazil, who has himself been criticised for partying during his career.Barcelona are 'very worried' about teen superstar Lamine Yamal, 18, after his 'dwarf and escort' party drama and holiday with an OnlyFans star 12 years his senior amid fears of bad influence\n16/07/25 07:51Yamal has been criticised for the celebratory bash which allegedly 'exploited dwarves' and featured women with 'specific breast measurements' who were claimed to have been paid to attend'.Jennifer Lopez, 55, flaunts her age-defying figure in a dazzling diamond bodysuit on stage during Up All Night tour in Spain\n16/07/25 00:55Jennifer Lopez set pulses racing in a skimpy, diamond-embellished bodysuit as she lit up the stage at Palau Sant Jordi in Barcelona on Tuesday.Pictured: Dwarves, scantily-clad women and football superstars arrive at Lamine Yamal's 'exploitative' 18th birthday party - New images emerge as Spain's government demand investigation\n15/07/25 14:45New images of the people with Dwarfism and scantily-clad women paid to attend Yamal's 18th birthday have surfaced as the Spanish government demands an investigation.Barcelona complete signing of Roony Bardghji as teenager dubbed the 'Swedish Messi' signs long-term deal after bursting onto the scene with winner against Man United\n15/07/25 09:12The winger will take part in Hansi Flick's pre-season tour of Asia later this month, before a decision is made on whether he will stick with the first team, go out on loan, or join Barcelona's youth sides.Jose Mourinho 'eyes stunning swoop' for Marcus Rashford as Man United striker continues to train away from Ruben Amorim and team-mates\n15/07/25 07:56Marcus Rashford is thought to be available for around £40million and is eyeing a move away from Old Trafford this summer. Spanish giants Barcelona are reportedly the 27-year-old's preferred destination.'Party dwarf' speaks out on Barcelona star Lamine Yamal - and reveals what he was paid for at his 18th birthday - as Spain's government plot investigation into bash where dwarves and blonde escorts 'were hired'\n15/07/25 07:40The Barcelona super-starlet celebrated the milestone with a lavish 'mafia-themed' event at a private estate, alongside team-mates including Alejandro Balde and Gavi, friends, and family.Spain's government demand investigation into Barcelona wonderboy Lamine Yamal's 18th birthday party after 'dwarves were exploited' and women with 'specific breast dimensions were paid to attend'\n14/07/25 15:23The Spanish government has demanded an investigation into Lamie Yamal's controversial 18th birthday party, during which 'dwarves were exploited'.Inside Lamine Yamal's 18th birthday celebrations: Private concert attended by Barcelona team-mates, a superhero mural and a £300,000 diamond necklace\n13/07/25 08:52After continuing to deliver on his potential at the highest levels of the game, Yamal has enjoyed some downtime ahead of the coming campaign.Louis van Gaal, 73, announces he is free from prostate cancer as former Man United manager reveals he is getting 'fitter and fitter'\n12/07/25 14:36The 73-year-old was diagnosed in late 2020, but kept the news private until April 2022, when he went public during his third spell as head coach of the Netherlands.Revealed: Barcelona's special 'Lionel Messi plans' for Nou Camp's reopening in 2026 after £1.3b renovation\n12/07/25 10:21Last season Hansi Flick led the club to their first league title since their exile began and preparations for how they will mark their long-awaited return are reportedly well underway.Former Premier League star is the 'main obstacle' to Marcus Rashford joining Barcelona from Man United\n12/07/25 09:57Rashford is known to be keen on a move to Barcelona this summer but there is reportedly one major issue holding back a potential deal. Rashford is still under contract with Man United until 2028.Juventus 'make Marcus Rashford their TOP summer target' - as Italian giants 'accelerate plans to sign Man United exile' amid interest from Barcelona and Bayern Munich\n11/07/25 22:50The Italian giants are reportedly 'accelerating' plans to sign the Manchester United exile, who spent the second half of last season on loan at Aston Villa .Marcus Rashford 'given the greenlight by Barcelona head coach Hansi Flick' as Man United outcast moves closer to Old Trafford exit\n11/07/25 10:20Rashford, Jadon Sancho , Alejandro Garnacho , Tyrell Malacia, and Antony are all thought to no longer have a future at Old Trafford, as Ruben Amorim looks to move on from the struggles of last season.Luis Diaz 'sets Barcelona compensation demand' as Spanish giants rival Bayern Munich for £60m-rated Liverpool winger\n10/07/25 08:53Barcelona's financial situation has reportedly been discussed in talks with Liverpool's Luis Diaz, with the club having faced difficulties in registering Dani Olmo and Pau Victor last season.La Liga chief accused of sabotaging Barcelona's move for Nico Williams by disclosing secret information to Athletic Bilbao - before Spanish winger signed shock new deal\n08/07/25 16:07LaLiga president Javier Tebas has been accused of sabotaging Barcelona's summer move for Nico Williams by disclosing secret financial information to Athletic Bilbao.TRANSFER CONFIDENTIAL: Tottenham set for improved Mohammed Kudus bid, what's going on with Ethan Nwaneri's Arsenal contract, Nottingham Forest's Anthony Elanga replacements and the latest on Jack Grealish's future\n08/07/25 16:00TRANSFER CONFIDENTIAL: Our transfer expert Simon Jones reveals everything you need to know on the biggest transfer moves involving your club.Nico Williams signs SHOCK new Athletic Bilbao deal - in major blow to Barcelona - with new release clause revealed\n04/07/25 09:09Nico Williams has signed a new contract with Athletic Bilbao despite having been heavily linked with Barcelona. The winger's new deal will run until 2035.WOMEN'S EUROS ULTIMATE GUIDE: The favourites, key players, and off-pitch controversies at the tournament as the Lionesses go for glory again\n03/07/25 19:41Sarina Wiegman's side are hoping to add another trophy to the cabinet after beating Germany in the final of the Euros three years ago. The build-up was marred by chaos for England.Real Madrid 'are open to selling Arsenal target Rodrygo' this summer after forward 'fell out of favour' under new manager Xabi Alonso\n03/07/25 18:59Rodrygo's future has been a major talking point during the Club World Cup, amid reports his performances would help dictate whether he remains at the club this summer.Raphinha SLAMS 'unacceptable' Club World Cup as he becomes the latest to attack FIFA over player welfare crisis\n03/07/25 17:14Barcelona superstar Raphinha has spoken out against FIFA and this year's Club World Cup tournament, brandishing the lack of time off for those involved as 'unacceptable'.Barcelona 'are dealt major hurdles' in bid to sign Nico Williams - with European giants 'waiting in the wings' to sign him from under LaLiga champions' noses\n02/07/25 18:19Williams, 22, has pushed for a move away from Athletic Bilbao this summer with Bayern Munich and Arsenal also reported to have been interested in signing the winger.Former Arsenal and Barcelona legend joins Liverpool as Arne Slot's assistant manager in major coaching shake up ahead of the Premier League season\n02/07/25 15:56Despite romping to the Premier League title in April, Slot has overseen a major reshuffle behind the scenes at Anfield this summer as he looks to refresh his side ahead of next season.TRANSFER CONFIDENTIAL: Newcastle's three new targets as they rival Spurs for Premier League star, Eberechi Eze's favoured club emerges and Man City battle Liverpool for EFL wonderkid\n01/07/25 16:04TRANSFER CONFIDENTIAL: Our transfer expert Simon Jones takes you inside the biggest deals going on in football.Zlatan Ibrahimovic calls Lionel Messi a 'GHOST' as he hits out at Inter Miami 'circus' after Club World Cup exit\n01/07/25 15:31Former PSG, Barcelona and AC Milan striker Zlatan Ibrahimovic has slammed Inter Miami as a 'circus' full of 'statues' that even Lionel Messi cannot hope to carry to glory.Leicester City Q&A: What's going on with Sean Dyche and Danny Rohl, the latest on points deduction and owners' attempts to sell stake, and which star is heading for the exit\n01/07/25 11:00It is not all doom and gloom. A strong core of players remains, and Leicester did brilliantly to tie down Jeremy Monga. Here Mail Sport answers your questions on the big issues at the club.Lionel Messi is consoled by Ousmane Dembele and other former team-mates after Inter Miami crash out of the Club World Cup in PSG thrashing\n29/06/25 22:58Lionel Messi was consoled by former team-mate Ousmane Dembele and a host of other familiar faces after his Inter Miami side were thrashed 4-0 by Paris Saint-Germain at the FIFA Club World Cup.\nPage\nStars of sport\n-\nFans spot Liam Delap's telling reaction and say the same thing after Chelsea striker watched Joao Pedro's goal in win over Bayer Leverkusen\n-\nTer Stegen is REINSTATED as Barca captain just a day after being stripped of it - as he reaches an agreement with club over medical saga\n-\nHowe says there is currently NO chance of Isak playing in Newcastle's opening game of the Premier League season as he lifts lid on private talks\n-\nShocking moment football thug tries to FIGHT opposition players during ugly brawl on opening game of the season - before flatlined by security\n- Riyad Mahrez makes surprise return to Man City training as Rodri compares former star to new club signing Fan favourite got a warm reception back at the club\nmore stars of sport\n-\nSky Sports presenter and WAG of Championship manager returns to work after cancer battle and a brain infection which left her in a coma\n-\nFoden criticised after City star IGNORES fans asking for his autograph in footage - but TikTok users point out one key reason why he was RIGHT\n-\nHannah Hampton reveals she launched rival keeper's cheat sheet into the CROWD during Euros final shootout in bid to help Lionesses team-mates\n-\nFormer Man United man appeals for help after being burgled during house move as thieves steal car full of valuables in overnight raid\n-\nCristiano Ronaldo marks 'landmark anniversary' with stunning hat-trick in thumping Al-Nassr win - as £26m signing Joao Felix dazzles\n-\nUFC legend Michael Bisping appeals for information on serial killer after claiming man broke into his house and attempted to attack him with a hammer\n-\nHarry Kane SKIES his penalty against Tottenham after scoring the opener in Bayern Munich's pre-season clash against his former club\n-\nMan United fan sets up GoFundMe page to try and raise money for Red Devils to sign Carlos Baleba after they 'made contact with Brighton to enquire about move'\n-\nFormer Man City and European Championship-winning goalkeeper 'sentenced to TWO YEARS in prison for more than 100 cases of fraud'\n-\nCesc Fabregas' Como players involved in mass brawl with Real Betis stars in pre-season clash- with ex-Premier League hero appearing to PUNCH opponent\n- Son Heung-min says goodbye to Tottenham as club legend reads emotional letter to fans after completing record-breaking move to LAFC End of a special era\n-\nRevealed: Record-breaking amount Emma Raducanu will bank if she regains her US Open title - with prize money having more than doubled since 2021 win\n-\nFurious Villarreal fans sign petition in last-ditch attempt to STOP Spanish club signing Thomas Partey after UK court opened door to move amid rape case\n-\nJose Mourinho fights back tears during tribute to his Champions League winning Porto captain Jorge Costa following shock death at 53\n-\nBarcelona give update on registration of six players - with Marcus Rashford among stars sweating on being available for start of LaLiga season\n-\nEx-Arsenal star reveals he squared up to Henry and used to get BLACK EYES from his team-mates as he lifts the lid on fighting culture under Wenger\n- Fans are convinced they know who Jamie Vardy's next club will be after his wife Rebekah's latest social media post The internet has been set ablaze with playful post\n-\nWelcome to Chelsea, finally! Estevao arrives ONE YEAR on from signing for the Blues - and after scoring against them at Club World Cup\n-\nEx-UFC star Michael Bisping claims to have been target of hammer-wielding arsonist serial killer who terrorised north England for more than a decade\n- Liverpool fans declare 16-year-old wonderkid is ready NOW after stunning solo goal just two minutes into his Anfield bow Sensational effort\n- UFC legend drops YouTube fighter with BRUTAL head kick after becoming enraged by opponent taunting him Mighty Mouse lost his cool during video\n-\nWatch the moment furious Roberto De Zerbi is pulled apart from a Marseille player in training - as the furious Italian tells star to 'call your agent'\n-\nTom Brady accused of showing 'ZERO class' after NFL legend's scathing opinion of Wayne Rooney's 'work ethic' made the final cut of new documentary\n- Lamine Yamal mural is vandalised with brutal dwarf slur after Barcelona star's controversial 18th birthday party antics Star made headlines\n- Chris Woakes put into bat for England with ONE ARM as injured hero wears sling for dramatic final stand against India But it was all in vain\n-\nEXCLUSIVE\nJude Bellingham reveals nasty-looking shoulder scar after England star went under the knife following TWO-YEAR ordeal with secret issue\n- Lewis Hamilton refuses to back down from his explosive 'change the driver' comment as he gives cryptic interview\n- Thomas Partey 'set to join LaLiga side' as free agent - despite ex-Arsenal star facing rape charges\n- EXCLUSIVE Rebecca Loos says it was 'unjust that her life became hell' after David Beckham scandal as she returns to the spotlight for Celebrity SAS\n- Rebecca Loos says it was 'unjust that her life became hell' after David Beckham scandal as she returns to the spotlight for Celebrity SAS\n-\n7ft 2in South Korean MMA star BICEP CURLS Tottenham star Son Heung-min - as the Spurs captain prepares to bow out in front of his home country\n- Sir Chris Hoy explains why he feels 'lucky' after cancer diagnosis granted him 'the time to really appreciate life' He gave three reasons\n- Cristiano Ronaldo defended from 'immense injustice' over his absence from Diogo Jota's funeral The Portuguese FA chief has issued a statement\n-\nRed Bull's Max Verstappen discovers his punishment for bizarre towel-throwing incident during Hungarian Grand Prix practice session\n-\nSon Heung-min bids tearful farewell to Tottenham after telling the club he wants to LEAVE - as he the decision 'one of the hardest of my career'\n-\nHow long Real Madrid defender Raul Asencio could face in prison as prosecutors seek sentence - after he allegedly shared explicit video involving a minor\n-\nChinese schoolgirl becomes the youngest-ever World Swimming Championships medallist after picking up relay bronze aged 12 years and 9 months\n- Anthony Joshua drops hint over new venture with Eddie Hearn after praising his promoter's family for 'conquering' sport A new sport?\n-\nMoment South Korean Tottenham fan bursts into tears after meeting James Maddison - as he and team-mates receive rapturous welcome\n- Olympic champion Laura Dahlmeier's body 'to be left on the mountain' following tragic accident in Pakistan As per her request\n-\nEngland pay emotional tribute to legendary batsman Graham Thorpe at the Oval - as hosts mark 56th birthday almost a year on from his death\n-\nDon't look back in anger, Christian! Sacked Red Bull boss Horner enjoys Oasis gig at Wembley while wife Geri rubs shoulders with Lioness heroes\n-\nEngland hero Toone reveals hidden family heartbreak she suffered just hours before the Lionesses won the Euro 2025 final as she pens emotional message\n-\nJadon Sancho 'tells Dortmund he will chop his staggering Man United salary in HALF' - as £73m exile looks to escape bomb squad with summer move\n-\nJoao Felix's £26m Al-Nassr move makes him the fourth-most expensive star of all-time in combined transfer fees - but who tops the list?\n- Tiger Woods' son Charlie, 16, explodes into form with stunning round that echoes his legendary dad Put in an impressive performance\n- Former Premier League star found guilty after bombarding his ex-girlfriend with calls, emails and LinkedIn requests - as well as going to her home\n-\nEXCLUSIVE\nBurnley to show first ever football match in VIRTUAL REALITY: Fans offered chance to watch Lazio friendly from own home with live commentary\n- Forgotten Liverpool player stars in professional footgolf tournament... as he shares footage of stunning putt Reds cult hero\n-\nLuis Diaz completes £65.5m transfer from Liverpool to Bayern Munich - as forward pens lucrative four-year deal with the German giants\n-\nClattenburg accuses ex-Chelsea star Mikel of 'swinging PUNCHES' at him in new revelations about clash - and claims Blues wanted 'payback' for Terry race row\n- Why former Arsenal star Thomas Partey will still feature on Premier League trading cards this season despite facing rape charges Raising eyebrows\n-\nEXCLUSIVE\nPremier League could come under pressure to SCRAP Summer Series amid club anger - as major reason for frustration is revealed\n-\nInside the Lionesses' jubilant Euro 2025 victory parade: How Wiegman let her mask slip, Kelly's iconic f-bomb, and Williamson's touching message\n-\nMan City complete signing of Trafford in British record deal for goalkeeper as Pep Guardiola becomes first manager in history to spend €2bn\n-\nLionesses arrive at No 10 to meet with Angela Rayner after touching down in the UK to heroes' welcome after their history-making second Euros victory\n-\nMary Earps and Millie Bright break their silence on England's Euro 2025 triumph - after dropping out of selection pre-tournament\n-\nLuke Littler celebrates making darts history on stage with his girlfriend... after confirming relationship with subtle gesture on live TV\n-\nVictorious Lionesses land back in the UK as fans flock to see their Euros heroes ahead of trip to Downing Street - despite being told to STAY AWAY\n- Pep Guardiola compared by fans to Ted Lasso as Man City boss debuts surprise new look ahead of pre-season return Strong facial hair\n-\nInside the Lionesses' all-night party after winning the Women's Euros: Players down wine and sing Sweet Caroline as they celebrate until 4.10am\n- Marcus Rashford, 27, 'is BACK with ex-fiancee' Lucia, 26, two years after split - as she 'joins him in Barcelona to help him settle' after Man United exit\n- UFC fighter left completely disfigured by gruesome injuries as fans call for referee to be fired over brutal bout Ugly scenes inside the Octagon\n-\nThe Lionesses are on the brink of glory at the Euros... and so is their market value! How women's team are entering their 'influencer' era\n-\nLoris Karius bares all on his relationship with TV presenter wife Diletta Leotta - as he reveals her honest thoughts on living apart in Germany and Italy\n-\nMan United 'scout 6ft 5in centre back compared to Rodri as Harry Maguire's long-term successor' - but Red Devils 'face competition'\n- Lewis Hamilton gives BLUNT verdict on Christian Horner sacking - as Red Bull prepare for first race since dismissing Geri Halliwell's husband\n- EXCLUSIVE Wrexham make shock move to sign Christian Eriksen, weeks after he left Man United: Agent confirms talks over shock transfer\n- Man United are trialing high-tech cooldown jackets used in cycling and F1 - as Ruben Amorim's men battle soaring temperatures\n- England's opponents STILL desperate to escape World Cup kiss-gate drama: 'Stained' Spain want to win Euros final to relive moment stolen from them\n- Benjamin Mendy released by Swiss club after just EIGHT games after partying antics left club bosses furious\n- Dana White opens up on Hulk Hogan's love for Donald Trump in emotional tribute to the late wrestler\n- Former Man United star Javier Hernandez breaks silence after he was fined following sexist comments\n- The humble son of Eritrean refugees who could smash the British transfer record: How Newcastle star Isak rose to the top amid Liverpool interest\n-\nThe Rock pays emotional tribute following WWE legend's Hulk Hogan's passing as he recalls incredible first encounter with his hero aged just 12\n- Rashford trades supercars for modest £25,000 company car as Man Utd outcast checks in for Barcelona training - having sold his £450,000 Lamborghini\n-\nWSL 2025-26 fixtures RELEASED: Chelsea face Man City in blockbuster opener, Arsenal's Emirates homecoming and a tasty start for Liverpool\n- EXCLUSIVE Sport's biggest bullies exposed by JONATHAN McEVOY: I've had enough and I'm naming ALL the names Sport is a selfish business\n- Erling Haaland treats girlfriend Isabel Haugseng to a £330,000 Hermes Himalaya Birkin handbag on their lavish summer holiday Flaunted on Instagram\n-\nThe lonely tour life of Emma Raducanu: Brit tennis star opens up on why she doesn't have friends in her sport - and what she finds 'very difficult' on tour\n-\n'Annoying, arrogant and promoting prison culture': Lamine Yamal, 18, is given brutal x-rated dressing down over his behaviour by a World Cup winner\n-\nAlejandro Garnacho sends two-word message to Marcus Rashford after Barcelona move - as star becomes first Man United 'bomb squad' member to depart\n- Chelsea striker Liam Delap's influencer girlfriend confirms split from the Blues' new £30m star amid Club World Cup celebrations Clearing the air\n-\nIt really is his dream move! Grinning Marcus Rashford has fans spotting his remarkable glow-up at Barcelona unveiling compared to 'rough' Villa photos\n- Diogo Jota's Liverpool team-mate reveals heartbreaking new tribute tattoo to 'a true legend' two weeks on from star's tragic death Permanent tribute\n- Ex-Arsenal star sentenced last month for part in £600k drug smuggling plot signs for new team after being released on parole Back on the pitch\n-\nBarcelona LEAK Marcus Rashford transfer announcement before hastily deleting video - with on-loan Man United forward 'set to be handed iconic shirt No\n-\nAlexander Isak appears to train alone at Newcastle, as 'huge wage demands are revealed' to sign new contract amid interest from Liverpool\n- Watch the hilarious moment Sir Alex Ferguson gatecrashes Rio Ferdinand's podcast - and delivers a firm dressing down\n- Inside the 'insane' mansion party that 'disrupted' reclusive Daniel Dubois' £10m world title fight: Boxer's hands-on dad invited 70 'strangers'\n- Pumped-up Gerwyn Price involved in angry on-stage clash with Daryl Gurney after sarcastic celebration at World Matchplay Darts\n-\nColdplay couple who were caught on infamous kiss cam are hilariously mocked by darts fans in Blackpool at World Matchplay tournament\n-\nEXCLUSIVE\nLionesses' main character bringing calm to the chaos: Why Chloe Kelly, with her wedding photos on her shinpads, is ready to inspire England in Italy semi"
    }
  ],
  "argos_summary": "Marc-Andre Ter Stegen has been reinstated as Barcelona's first-team captain after resolving a disciplinary issue related to his refusal to authorize the submission of his post-surgical medical report to LaLiga. This situation had put the club at risk of not being able to register new signings due to financial fair play regulations. Following a public statement from Ter Stegen expressing his commitment to the club and clarifying that all signings were completed prior to his surgery, Barcelona confirmed the closure of the disciplinary proceedings and his return to captaincy.",
  "argos_id": "TA7OHSII5"
}