{
  "url": "https://www.express.co.uk/entertainment/films/2093027/forgotten-war-film-michael-caine",
  "authorsByline": "Maria Leticia Gomes",
  "articleId": "190a3f84fd0b4c4b9e873d754d532b08",
  "source": {
    "domain": "express.co.uk",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Stark County",
      "city": "Hartville",
      "coordinates": {
        "lat": 40.9636685,
        "lon": -81.3312195
      }
    }
  },
  "imageUrl": "https://cdn.images.express.co.uk/img/dynamic/36/1200x630/6349277.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-08T17:45:00+01:00",
  "addDate": "2025-08-08T16:54:09.368223+00:00",
  "refreshDate": "2025-08-08T16:54:09.368225+00:00",
  "score": 1.0,
  "title": "Forgotten World War 2 film with Michael Caine 'is one of the best ever'",
  "description": "Rediscover a Richard Attenborough epic war film, now streaming on Prime Video and Apple TV.",
  "content": "Nearly five decades after its release, one of the most ambitious war films ever made is finally being rediscovered - and found its place on streaming in the UK. Richard Attenborough’s 1977 epic A Bridge Too Far, long considered a landmark in World War II cinema, blends historical accuracy, emotional depth, and one of the most legendary casts ever assembled - including Sir Michael Caine, Sir Sean Connery, Anthony Hopkins, Gene Hackman, and James Caan. The film retells Operation Market Garden, the ill-fated Allied operation in September 1944 that aimed to bring the war to a swift close by seizing several key bridges in the Netherlands. While the operation was a failure in military terms, Attenborough’s film treats the story with both reverence and realism, showcasing not just the bravery of the soldiers involved, but also the logistical flaws and political pressures that shaped the mission’s outcome.\n\nMichael Caine plays Colonel Vandeleur, a British tank commander, in one of his most commanding early roles, and is joined by Hopkins, Connery and Hackman, who all deliver powerful performances. The film was shot on location in the Netherlands, with painstaking attention to historical accuracy. More than 100 authentic military vehicles - including Sherman tanks, Dakota planes, and WWII-era fighter aircraft - were sourced from museums and private collections to ensure realism on screen. Yet not all locals were comfortable with the production. Filming in Deventer, a Dutch city that stood in for Arnhem, caused tension when extras dressed in Nazi uniforms walked the streets. As author Simon Lewis recalled in an interview: “I think the younger residents lapped it up – particularly the younger women. But the older generation struggled with seeing German uniforms on their streets.” When it debuted in 1977, A Bridge Too Far received mixed reviews, with some critics arguing it was overly long or emotionally distant. But time has been kind to the film, and in retrospect, many see it as an unmatched depiction of mid-century warfare - both in scope and detail.\n\n\n\nIt received eight BAFTA nominations, winning four, including Best Supporting Actor for Edward Fox. In recent years, viewer reviews have been consistently glowing, with many pointing out the same thing: that this film deserves a place among the greatest war movies ever made. A look at Rotten Tomatoes user reviews if prrof of the consistent sentiment: “One of the greatest war films ever put to screen. With an all-star cast, the complaints about it being too long are unwarranted… an all-time great!” “Brilliant! Such a well made film about the doomed ‘Market Garden’ mission… A proper WW2 classic\", wrote a fan, while anothr gushed: “One of the best war films over the years. I enjoyed it in 1977 and now watching it for my 20th time.” A fourth one wrote: “Nothing much to say… historical accuracy, practical effects and incredibly high quality for its age, a gold standard of historical war movies.” A Bridge Too Far is now available to stream on Amazon Prime Video and Apple TV.",
  "medium": "Article",
  "links": [
    "https://www.express.co.uk/",
    "https://www.express.co.uk/privacy-notice",
    "https://www.express.co.uk/entertainment/films/2092981/michael-caine-hated-filming-war-movie",
    "https://www.express.co.uk/latest/sean-connery",
    "https://www.express.co.uk/entertainment/films/2092856/masterpiece-british-film-netflix-perfect",
    "https://www.express.co.uk/entertainment/films/2092828/happy-gilmore-2-director-next-film-netflix-eddie-murphy",
    "https://www.express.co.uk/showbiz/tv-radio/2092441/outlander-prequel-blood-of-my-blood-full-cast",
    "https://www.express.co.uk/showbiz/tv-radio/2023465/a-bridge-too-far-forgotten-world-war-ii-film-amazon-prime-video",
    "https://www.express.co.uk/news/uk/2091760/veterans-Second-World-War-Auschwitz-Arnhem"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "historical war movies",
      "weight": 0.08009005
    },
    {
      "name": "historical accuracy",
      "weight": 0.06813534
    },
    {
      "name": "Sir Michael Caine",
      "weight": 0.06168868
    },
    {
      "name": "Rotten Tomatoes user reviews",
      "weight": 0.060527463
    },
    {
      "name": "mixed reviews",
      "weight": 0.05883525
    },
    {
      "name": "viewer reviews",
      "weight": 0.05760682
    },
    {
      "name": "Michael Caine",
      "weight": 0.05741518
    },
    {
      "name": "the greatest war films",
      "weight": 0.057104778
    },
    {
      "name": "World War II cinema",
      "weight": 0.056585416
    },
    {
      "name": "the best war films",
      "weight": 0.056266252
    }
  ],
  "topics": [
    {
      "name": "World War II"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.86572265625
    },
    {
      "name": "/Reference/Humanities/History",
      "score": 0.42919921875
    },
    {
      "name": "/Arts & Entertainment/Movies/Drama Films",
      "score": 0.37353515625
    }
  ],
  "sentiment": {
    "positive": 0.30859375,
    "negative": 0.38623047,
    "neutral": 0.30541992
  },
  "summary": "Richard Attenborough's 1977 World War II film, A Bridge Too Far, is being rediscovered and is now available on streaming in the UK. The film, starring Michael Caine, Sir Sean Connery, Anthony Hopkins, Gene Hackman, and James Caan, blends historical accuracy, emotional depth, and cast members. It retells Operation Market Garden, the failed Allied operation in 1944 that resulted in the loss of several bridges in the Netherlands. The cast was assembled with painstaking attention to historical accuracy and over 100 authentic military vehicles sourced from museums and private collections. Despite mixed reviews, many see it as an unmatched depiction of mid-century warfare. It received eight BAFTA nominations, including Best Supporting Actor for Edward Fox.",
  "shortSummary": "Richard Attenborough’s 1977 World War II film \"A Bridge Too Far,\" featuring Michael Caine and Sir Sean Connery, is now available on streaming in the UK.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "0c403255f3da488f9e167943b5efd0df",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.express.co.uk/",
      "text": "Martin Tarling also sought \"comfort\" by climbing inside clinical waste bins to the horror of parents and staff.\nDrivers are being warned of 5 miles of congestion.\nThe GB News team was at Aldershot's migrant hotel protest, and resident Erica says...\nEXCLUSIVE: Groups of drug addicts are abusing substances and sleeping rough in the...\nA Coronation Street legend has died following a 'short illness' as emotional tributes...\nThe LYMA Laser is loved by celebrities like Miranda Kerr, Rosie Huntington-Whiteley...\nOn the first day the Labour government's new migrant deal was put into place, the...\nFind out if you're the big winner in tonight's Euromillions and Thunderball draw.\nShoppers are loving this bedding deal that includes a winter-ready duvet and two pillows, now up to 50% off.\nIsrael's government has approved plans to take control of Gaza City, a move that...\nBroken Britain's citizens are fed-up and Nigel Farage understands this.\nIn the wake of a devastating loss, the Willgoose family is on a mission to transform...\nDaily Express\nA passenger was left with injuries after a cruise ship slide malfunctioned.\nThe Prime Minister has rejected calls by the families of those killed in the Chinook...\nJury rejects boys claims he stabbed Harvey through the heart in fear after being...\nAustralian hitmaker John Blanchfield has died at the age of 79. His family announced...\nTensions were high during a match, leaving one player with a freak injury.\nBrothers Liam and Noel Gallagher are continuing their reunion tour in the Scottish...\nFrom oafish remarks to swinging into full bully-mode, yet another damning book...\nCoronation Street star Kym Marsh has been left heartbroken over the death of her cousin\nRediscover a Richard Attenborough epic war film, now streaming on Prime Video and...\nResidents in this world-famous city are worried the place they call home may soon be...\nGet Express Showbiz breaking news sent directly to your mobile\nThe taxpayer is once again being taken for a ride.\nJournalist Mike Graham was left raging as he clashed with John Rentoul after he said illegal migrants are being detained \"somewhere\"\nReports suggest an HMRC error could see thousands lose out.\nIn a career spanning seven decades, Sir Michael Caine has seen it all. Yet, one film...\nKatie Price needs to have a serious think about what she's doing.\nLewis Hamilton caught the F1 world's attention with an interview in Hungary.\nOwner of a Three Michelin Star restaurant has shared his top tips for getting the...\nGardeners are being encouraged to try a simple homemade mixture of coffee and oats to...\nLeaked airport CCTV footage shows sprinter and Olympic gold medallist Sha'Carri...\nKeir Starmer has described the Israeli Government's decision to further escalate its Gaza offensive as \"wrong\".\nRussia's federal budget deficit is continuing to grow rapidly, already surpassing this...\nRecreate Meghan Markle's £4,000 Valentino dress on the high street for a fraction of...\nAn interior designer from Harford House has shared six items she urges you to remove...\nA BBC Good Food pasta recipe has sparked fury in Italy.\nThe warship the USS Gerald R Ford, the world's largest aircraft carrier, has made a...\nThroughout her 18 years in the industry, professional cleaner Melissa Browning has...\nDespite slamming free speech and immigration levels in Britain, JD Vance is due to...\nThis item will keep rats out of your garden and it's an affordable solution.\nExpress Sport rounds up the latest Manchester United transfer news.\nA beloved clay duo returns in a new adventure that's already being hailed as a...\nAir fryers have become a staple in many households, but cleaning experts have warned...\nThe latest Ofcom stats are out and here are the best and worst broadband, TV and phone...\nWith just three simple gardening tricks, you can protect your Japanese maples from...\nCustomers of various energy firms including EDF, British Gas, E.On, Octopus Energy and...\nTwo men have been arrested by Greater Manchester Police for filming 'drive-by' attacks...\nDonald Trump reportedly started shouting at Benjamin Netanyahu on the phone when he tried to say reports of children starving in Gaza were fake.\nThe star has opened up about being booted off the programme by the broadcaster\nBBC viewers have issued desperate pleas to the broadcaster after being unexpectedly...\nSky News has finally revealed which presenter will replace TV veteran Kay Burley after...\nAnd you should draw you curtains and blinds during the day as well, say experts, as...\nTaxpayers who miss crucial deadlines will be hit with fines after introducing new tax...\nCameron Brockman, 20, assaulted a teenager at a pub in Solihull before an FA Cup match...\nShe did not join in with the antics of her fellow hotel guests, instead videoing what...\nDaily Express uses notifications to keep you updated"
    }
  ],
  "argos_summary": "Richard Attenborough's 1977 war film A Bridge Too Far, now streaming in the UK, is being rediscovered as a landmark depiction of World War II, focusing on the failed Operation Market Garden. The film features an all-star cast, including Michael Caine and Sean Connery, and is praised for its historical accuracy and emotional depth, despite initial mixed reviews. Over time, it has gained recognition as one of the greatest war films, with viewers highlighting its realism and powerful performances.",
  "argos_id": "TMVFYGVIJ"
}