{
  "url": "https://www.wsj.com/articles/ad-tech-company-trade-desk-downgraded-as-amazon-ai-reshape-digital-market-e65b020b",
  "authorsByline": "Patrick Coffee, 9233:Patrick Coffee, patrick coffee",
  "articleId": "02eafab1483c4e0c9fda140d7f96e3f2",
  "source": {
    "domain": "wsj.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://images.wsj.net/im-01313066/social",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T23:43:00+00:00",
  "addDate": "2025-08-08T23:49:18.881290+00:00",
  "refreshDate": "2025-08-08T23:49:18.881292+00:00",
  "score": 1.0,
  "title": "Ad Tech Company Trade Desk Downgraded as Amazon, AI Reshape Digital Market",
  "description": "The company reported revenue growth for the second quarter but saw its stock price drop.",
  "content": "Shares of Trade Desk plunged more than 38% Friday, a selloff that suggests investors are reassessing some of their predictions about online advertising and its major players.\n\nTrade Desk runs a demand-side platform where marketers can buy digital ad inventory around the web. It has enjoyed rapid growth and a stock price that trades at a relatively high multiple to earnings. Its second-quarter earnings report after the stock market closed on Thursday was its first as a member of the S&P 500. The company reported 19% year-over-year revenue growth, hitting $694 million, which slightly exceeded analysts’ expectations and outpaced industrywide growth in digital ad sales.\n\nBut Trade Desk is facing longer-term challenges, including competition from Amazon’s expanding ad-sales business and changes in web traffic driven by the rise of artificial intelligence, analysts said.\n\nTrade Desk can’t realistically maintain its current rate of revenue growth for the long term, said Brian Wieser, founder of ad industry consulting firm Madison and Wall.\n\nTrade Desk’s growth, while consistent, remains too modest to justify its outsize valuation, analysts with MoffettNathanson and Bank of America said in separate notes downgrading the stock to sell and underperform, respectively.\n\nMoffettNathanson cut its price target for Trade Desk’s stock to $45 from $75, and Bank of America’s target dropped to $55 from $130. The stock closed at $54.23 on Friday.\n\nTrade Desk’s narrow focus as a demand-side platform selling digital ad inventory to brands and agencies explains both its continued success with marketers and the skepticism of analysts, Madison and Wall’s Wieser said.\n\n“At the end of the day, this is a single-product company in a niche part of the industry,” said Wieser. “The company is doing great. I think that one has to separate the valuation of the company from the company itself.”\n\nAmazon poses a growing challenge particularly in ad sales for commercials on connected TV, Trade Desk’s biggest source of growth, the MoffettNathanson analysts said. Amazon plans to start selling ad inventory from the streaming TV platform Roku and has been expanding its presence in live sports, including through a new deal with the National Basketball Association, the analysts said.\n\nAmazon’s ad sales revenue grew 23% year-over-year in the second quarter to reach $15.69 billion, thanks partly to its decision to make ad-supported video the default setting for Amazon Prime.\n\nTrade Desk Chief Executive Jeff Green said during the company’s earnings call that it doesn’t compete directly with Amazon and could even end up selling Prime inventory if Amazon decides to make it available.\n\n“I think Amazon is more of a potential partner, honestly, than it is a long-term competitor,” Green said.\n\nA subset of Trade Desk’s clients that already advertise with Amazon might move more of their business to that platform, however, especially because Amazon’s ad sales fees of about 1% are significantly lower than Trade Desk’s, which range from 12% to 15%, said Laura Martin, senior analyst at investment bank Needham & Co. Even if these companies don’t want to buy through Amazon, they can use its fees as leverage to get better rates out of Trade Desk, she said.\n\nTrade Desk’s guidance also indicates lower growth rates in the near future, said Martin. The company forecast third-quarter revenue of “at least $717 million,” implying 14% year-over-year growth, a slowdown from the second quarter’s 19% year-over-year growth, which was itself slower than the 25% growth reported for the first quarter, year-over year.\n\nMeanwhile, Trade Desk’s business offering ad inventory from the open web could be hurt by AI search, which is already significantly reducing traffic to news sites such as Business Insider, damaging their ad sales and leading to layoffs.\n\nA Trade Desk spokesperson said a survey released last year showed people were spending more time on sites on the open web in comparison to apps from tech properties like Facebook or YouTube.\n\nSurvey-based measures of media are unreliable, however, particularly when they ask people to gauge the amount of time they spend on different types of platforms, according to Wieser.",
  "medium": "Article",
  "links": [
    "https://www.wsj.com/tech/ai/google-ai-news-publishers-7e687141?mod=article_inline",
    "https://www.wsj.com/market-data/quotes/AMZN",
    "https://www.wsj.com/market-data/quotes/ROKU",
    "https://www.wsj.com/market-data/quotes/BAC",
    "https://www.wsj.com/market-data/quotes/META"
  ],
  "labels": [
    {
      "name": "Roundup"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Trade Desk",
      "weight": 0.10623761
    },
    {
      "name": "digital ad sales",
      "weight": 0.09392123
    },
    {
      "name": "Ad Tech Company",
      "weight": 0.09386178
    },
    {
      "name": "digital ad inventory",
      "weight": 0.093552
    },
    {
      "name": "ad sales",
      "weight": 0.09265611
    },
    {
      "name": "ad inventory",
      "weight": 0.09221234
    },
    {
      "name": "Trade Desk Chief Executive Jeff Green",
      "weight": 0.08829699
    },
    {
      "name": "revenue growth",
      "weight": 0.07967834
    },
    {
      "name": "lower growth rates",
      "weight": 0.07688226
    },
    {
      "name": "ad industry consulting firm Madison",
      "weight": 0.07651851
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98095703125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9453125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.84765625
    },
    {
      "name": "/Business & Industrial/Advertising & Marketing/Marketing",
      "score": 0.7001953125
    },
    {
      "name": "/News/Technology News",
      "score": 0.35693359375
    }
  ],
  "sentiment": {
    "positive": 0.5361328,
    "negative": 0.21166992,
    "neutral": 0.25219727
  },
  "summary": "Shares of Trade Desk fell more than 38% in the second quarter, indicating that investors are reassessing their predictions about online advertising. The company, which provides a demand-side platform for digital ad inventory, reported 19% year-over-year revenue growth and outpaced industrywide growth in digital ad sales. However, Trade Desk is facing competition from Amazon's expanding ad-sales business and changes in web traffic driven by the rise of artificial intelligence. Analysts with MoffettNathanson and Bank of America have downgraded the stock to sell and underperform. Trade Desk's stock price trades at a relatively high multiple to earnings and its growth, while consistent, remains too modest to justify its valuation, analysts said. The firm's guidance indicates lower growth rates in the near future.",
  "shortSummary": "Trade Desk's shares dropped over 38% amid concerns over long-term growth and competition from Amazon and AI, despite strong growth and increased ad spending by marketers.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1fa90d092c8f4b42970b9047d45a93c1",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Shares of Trade Desk fell over 38% following its second-quarter earnings report, which showed 19% year-over-year revenue growth but raised concerns about its long-term growth potential amid increasing competition from Amazon and shifts in digital advertising. Analysts downgraded the stock, citing its high valuation relative to modest growth and the challenges posed by Amazon's expanding ad sales, particularly in connected TV. Trade Desk's forecast for future revenue growth also indicates a slowdown, further contributing to investor skepticism.",
  "argos_id": "TXVQW9DBL"
}