{
  "url": "https://finance.yahoo.com/news/consumer-stocks-spotlight-etsy-roblox-204800066.html",
  "authorsByline": "Motley Fool Staff, Tim Beyers, Thomas King, CFA, and Alicia Alfiere, The Motley Fool",
  "articleId": "d8aabfa7c34e41a7b5f0be44e9d1fb0b",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/41OBjsqCbUOeqydws36Otw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/motleyfool.com/7cc7aea48484d4c278872fbe1e15bbb8",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T20:48:00+00:00",
  "addDate": "2025-08-08T21:19:16.270438+00:00",
  "refreshDate": "2025-08-08T21:19:16.270441+00:00",
  "score": 1.0,
  "title": "Consumer Stocks Spotlight: Etsy, Roblox, and Reddit",
  "description": "Does a mixed bag of economic data forecast a good future for businesses that depend on consumer spending?",
  "content": "Tim Beyers: Mostly caffeinated. Well, you have a young baby, so you need more caffeine than most. We're going to hit e-commerce earning spotlight today. Last week Fed Chairman Jerome Powell decided to hold back on lowering interest rates, citing mildly concerning inflation data and yet US economic activity appears to be good with GDP up a reported 3%. Shouldn't that be a boon for companies driven by consumer spending? We're going to tackle two, and to me, it looks like a mixed bag. I'm going to start us off with Etsy. Tom, I'm going to come to you in a second here. But I show Etsy reporting a 4% increase in revenue year over year. EPS, though, earnings per share, fell 39%, and gross merchandise sales dropped 5%. That doesn't sound that great. Seems to be that Etsy's ability to raise prices on sellers via higher take rates is really the only thing that's fueling growth here. Am I reading that wrong? Is that true and if I am reading it right, is that sustainable? Where are you on Etsy?\n\nTim Beyers: What do e-commerce earnings say about the economy? You're listening, Motley Fool Money. Good morning, fools. I'm your host, Tim Beyers, with me, two of my Rule breakers teammates, Alicia Alfiere and Tom King. Alicia, Tom, how are you feeling? Are you suitably caffeinated?\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $636,563 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,108,033 !*\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Etsy wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nTom King: Yeah, so there were two drivers of Etsy's revenue in the second quarter of 2025. That was pretty much a flat revenue from the commission it takes on each sale on the platform, but about 15% increase in advertising revenue and gross merchandise sales, the value of things sold on the platform was a roundabout flat. Basically what the data is saying to me is, Sellers on Etsy spent a lot more money on advertising, which drove revenue for Etsy, but it didn't drive an increase in sales on the platform.\n\nTim Beyers: That feels like sellers have to benefit here. This has to be a mutually beneficial network. Then is it fair to say if I've heard you correctly at the moment, it's not as mutually beneficial as it should be in an ideal situation.\n\nTom King: No, that's a very accurate statement. GMS is flat. It's pretty much been declined pretty I had a boom it boomed in 2020 and 2021, as did many businesses, and it's been pretty much flat declining in flat since about 20:22 onwards. Over that time frame, Etsy has been steadily increasing its commission rate, its take rate, what it charges for each sale. At the same time that sales have been going down for sellers. It is not a sustainable situation, and I'm not sure how it ends, but right now it can't carry on the way it's going.\n\nTim Beyers: Well, watch this with caution Fools because it's it's not a doom loop, but it may be cresting into a roller coaster ride that we don't like all that much. But let's talk about one that is not, maybe a little bit more interesting. Maybe a more fun roller coaster ride. Alicia, I don't know. But Roblox's earnings, once again, seeing that the business design means that realized revenue and profits doesn't reflect the actual strength of the platform. That's certainly what it looks like and there were some strong numbers underlying the initial what looked like weakness on the top line, just quickly on this. Revenue growth and adjusted earnings per share came up short of expectations, but these numbers were really jarring to me, Alicia. Bookings jumped by more than 50%, so this is business that's done in Roblox, monthly paying users up 42%. Hours of engagement improved 58%. Is Roblox's popularity peaking, streaking? Where is it here?\n\nAlicia Alfiere: Well, I think Roblox's popularity is continuing to grow. As you said, revenues and profits don't tell the whole story. We need things like engagement metrics. The numbers you touched on number of users, hours spent on the platform and bookings data. That really speaks to the value of the network and the health of the platform. The latest quarter showed Roblox growing its relevance across the world. Bookings, hours spent, daily average users, all of these metrics were up across all world regions. But we do have to be careful here. There were five very popular viral experiences that Roblox has that has over 10 million daily active users and four of those are pretty new.\n\nAlicia Alfiere: They've launched just within the last 12 months. But Roblox is more than those games. Excluding those top experiences, hours of engagement still grew 47% year over year, and over half of the growth in spending and Roblox experiences came from the games or experiences that weren't in that top ten. Again, that growth should continue, but we have to be careful not to expect the growth from those viral heads to continue since interest tends to wane over time with things that are viral.\n\nTim Beyers: Well, don't tell the acquirers that because one of those top games, what is it? A kid that made a Roblox game in, like, three months and then sold it for something like three million to, I don't remember if it was private equity or just a VC fair, whatever it was, but it was quite a deal here. It does look like the top of the top of the funnel is generating pretty massive interest.\n\nAlicia Alfiere: Yeah and I'm glad you brought that up. Viral games can really help to attract new users and also important new developers to the platform. If those users are sticky, if those developers create games that resonate, it'll help to continue to grow Roblox's relevance and its network value over time.\n\nTim Beyers: We would like to think so. Up next, Is Reddit a rule breaker in the making? We're going to debate it. You're listening to Motley Fool Money.\n\nMALE_1: Wish you could lock in rates without locking out liquidity? Meet LDDR, a LIFEX Treasury bond ladder ETF built to simplify your cash flow plan for the next 10 years. With LDDR, you can lock in today's interest rates for a decade. It's built to deliver predictable monthly cash flow that boosts interest income by including tax free return of principle. That means the potential for higher, more stable cash flow without worrying about rate cuts, reinvestment risk or market swings. LDDR, take the guesswork out of your cash flow plan. Learn more at lifexfunds.com. The LIFEX ETFs return principal over the life of an ETF and therefore expected to have little or no assets remaining to distribute at the time of liquidation. Individual bonds carry an obligation to fully return the principal to shareholders at maturity. However, ETFs have no such obligation. The net asset value of the ETFs will decline over time as income payments are made to shareholders. Tax discussion herein is general in nature. Investors should consult with their tax advisor about the effect that an investment in LIFEEX ETFs could have on their tax situation. Investors should consider the investment objectives, risks and charges and expenses of LGDR carefully before investing. The prospectus contains this and other information about the investment company and can be obtained by visiting www.lfxfunds.com or by calling 1-888-331-5558. The prospectus should be read carefully before investing. Investing in the LIFEX ETFs involve risk. Principal laws is possible. The LIFEX income ETFs are distributed by Foresight Financial Services, LLC.\n\nTim Beyers: Now that we're back here, let's talk about consumers who don an alter ego and take on social news and discussion platform Reddit, which recently reported earnings. We're going to talk about whether or not this is a rule breaker in the making, and we're each going to give a take on this. But before we do, let me tee this up with some data. Revenue grew 78% year over year in the most recent quarter. The company reported its biggest ever earnings beat as a public company, Reddit answers, which is something that they provide as a way to draw from the expertise of the community to answer significant questions. That was up 6X in weekly users and daily active users reached 110.4 million. That was up 21%. I'll start us here. There is some amount of evidence that Reddit is scaling and getting more out of the network as it grows. I found this fascinating. Reddit is a cash generator on a simple FCF basis, free cash flow, that means and it's produced 3.7 million in free cash flow, even after you subtract out all the stock based compensation. Now, there isn't enough cash there on an organic basis to cover their acquisitions, and Reddit does make acquisitions. But still, this is impressive. They are scaling they look like they are scaling inevitably toward consistent free cash generation. But Alicia, tell me, am I wrong? Is this a rule breaker in the making?\n\nAlicia Alfiere: I don't think that you're wrong, but I do have a question.\n\nTim Beyers: But you think I might be misguided?\n\nAlicia Alfiere: No, I would never I would never say that, Tim. I do have a question I've been noodling on, and perhaps we could all noodle on it together. I'm a big fan of Reddit, especially as a new parent. There is a wealth of human experience that you could find there, and there are different channels. Mom, Dad, all kinds of subreddits. I do think that in order to grow over the next five years, Reddit needs to hold on to this key competitive advantage of its trove of human experience data. Now, in their earnings call, Reddit talked about how AI can answer many questions, but some questions require a human answer and a range of human answers. But it also talked about human experience data being incredibly useful to another of the users of its platform, which are LLMs. I wonder, will selling access to its human experience data essentially give its competitive advantage away to LLMs, and if not, can AI and LLMs become a weak point in Reddit's network if their net contribution is negative for Reddit, since they're benefiting from the human experience data, seeking to replace Reddit in some ways by getting that data and using it in their own learning and if they ever post anything to Reddit, it would likely diminish the value of the human experience data that is so important for Reddit.\n\nTim Beyers: Maybe, but as somebody who's worked on some code that is trying to hit the Reddit API, can I just tell you how expensive it is to get the Reddit data through the API? I would say Reddit is not undervaluing that data, and if LLMs want to play and people who are using those LLMs want to play, they're going to pay, and it's not going to be cheap. It's an interesting question, though, but Tom, where do you land on this?\n\nTom King: Would be very wary of Reddit.\n\nTom King: It makes almost all of its money from advertising. That means that when people go onto Reddit.com, they see a banner ad on the side or a highlighted link, sponsored link or something, that's where Reddit makes all its money. There is a very big question right now about how much people are going to be visiting individual websites when they can get their answers from an LLM. That is a big unknown for me right now. If Reddit is not getting as much traffic to its website as it did historically, that is going to hurt Reddit badly and add to this fact that it is trading at 20 times revenue, and these are the kind of multiples we haven't seen since 2020, 2021, and that did not end well. I would be very cautious of Reddit.\n\nTim Beyers: Yeah, I'm glad you brought up the valuation. The valuation is arguably extreme and the hurdles that it has to get past. In order for Reddit to really blossom and deliver returns for investors, if you're a rule breaker investor and you're really looking at this one, you have to be looking out ten years and seeing an extraordinary expansion of that free cash flow margin, and you have to hold steady not only in that advertising business, but you're probably going to have to come up with new ways to generate revenue. That API that's feeding the LLMs, that's going to have to be profitable and persistently so and you may even need a third revenue stream that we can't even see yet, so yeah, this is speculative. I think we can agree. Is it a rule breaker? I think the consensus here is like, yeah, maybe. We'll take a look at it, but I don't think it's as cut and dried as it might be. I'm not sure it has all six traits. Alright, Fools, up next, a little bit of business history. A new segment. Please stay tuned. You're listening to Motley Fool Money.\n\nIn the spirit of education on these podcasts and something we used to do on a show you may have seen on Fool Live called This Week in Tech, we are bringing you now. This Week in Business history. For each of you, I know you've seen the notes, so you don't have to act surprised here, but I wonder if you are surprised by when this was. Today is August 4. If we go back to August 4, 1930, that is the opening of the first King Cullen supermarket in Queens, New York. Quick side note, I remember as a kid before we left New York, I remember going like, with my mom on shopping trips to the King Cullen supermarket. I know this name. I remember it from, like, the early 1970s. Here's my question for each of you, and I'll kick it off to you first, Tom. Are you surprised that supermarkets have been around now going on 100 years?\n\nTom King: You'd asked me, I would have thought it began later, so yes, I am surprised it began as early as 1930.\n\nTim Beyers: Alicia, what do you think?\n\nAlicia Alfiere: I'm not terribly surprised, but I do wonder how they were different, how their footprint was different than they are today. I'm sure they were much smaller and carried out much less variety of goods.\n\nTim Beyers: Well, so it's interesting you mentioned this because this is the Smithsonian Institution says, It's America's first supermarket, and it was revolutionary at the time. It introduced the concept of a self service grocery store. Up till this point, you would go to a grocer, and the grocer would take your list of what you want and then go get everything out of the backroom, out of the stock room, and bring it to you. Yeah, Alicia, go ahead.\n\nAlicia Alfiere: I feel like that should come back. I love the convenience of that, isn't that almost like Instacart?\n\nTim Beyers: It is. That's right. Like, this is the thing. The rule breakers lesson here is that it is very often that an existing industry that used to have rules that were broken end up getting rules broken again, and sometimes we go back to a variation of the old rules. This is exactly right. Instacart is like this. Interestingly, also, this idea of small format, lots of things pre designed, designed really to break really the price barrier and this is what's interesting very low prices was what King Cullen was known for. This sounds like another recent rule breaker, Tom, which I would say is BBB Foods. Not necessarily a big warehouse. Reasonable form factor really small designed for really low prices, and you get in and you get your stuff fast and you get it and you get out, so this is interesting to me. Here's my question for you, Tom, and then I'll kick it back to you, Alicia. This does seem ripe for yet another paradigm shift. Have I made you more interested, less interested, or you are as interested as you always were about looking at rule breakers in this industry?\n\nTom King: It certainly is a very big industry, close to a trillion dollars in sales in 2024. It is an industry that hasn't changed very much for quite a long time. As you said, the first supermarket introduced in 1930 now, that is how we mostly get our groceries from Walmart is, for example, one of the biggest grocers in the United States. I suppose somebody could figure out a way to do it better, but it is a difficult industry to enter because, the margins are very thin. They're very big, well prepared competitors Costco, Walmart, I'm thinking of in particular. It's a hard thing to shop for groceries. Sometimes the thing you want is not there or you like your bananas a certain ripeness. Other people think there should be a different ripeness. All those factors make it pretty hard to get this right and disrupt. But I'm certainly interested to hear ideas from people that try to do it differently. I think Amazon Fresh was quite an interesting idea in the whole grocery space and that I don't think has been particularly successful.\n\nTim Beyers: No, it wasn't that good an idea.\n\nTom King: Why do you say that, Tim? Because I think they tried to automate far too much of it and stripped all of the humanity out of it, and I think that just didn't work. But let's end on this. It's a $1 trillion, as of 2024, it's a $1 trillion market and we're going to get a better read on how this is doing when Walmart reports earnings on August 15, so stay tuned for that. Kroger will report in September. Will there be disruption here? We're going to have to look at the numbers in the coming month. Let's end with a prediction because we have Walmart earnings coming up on August 15, then we have Kroger earnings coming next month in September. Here's my question. Quick one, yes or no, which one or actually, which is the bigger outperformer? Walmart or Kroger over the next 10 years. Give me a rough estimate of what you think and I'll start us off here. I won't just leave you on the hook. I'll go with you first after I give my prediction here. I'm going to say Walmart, and I'm going to say at least 10% annualized over the next 10 years. I think Kroger's going to struggle to get over 7%. Alicia, what do you think?\n\nAlicia Alfiere: Tim, you came in and stole my answer right out of my head.\n\nTim Beyers: No. You didn't copy my answer. There's no rules here.\n\nAlicia Alfiere: I would copy your answer, but I would also say that as Tom was talking, I was thinking about this idea of disruptors in this space, and I thought, there are some cases in which a player that has been in the market for a while can disrupt the market and disrupt itself. I think if any company has the likelihood of doing it, it would be Walmart, so I agree.\n\nTom King: I always try to take a diff different answer to what my co hosts have given, but honestly, that's exactly what I was going to say Tim. Walmart.\n\nTim Beyers: There you go.\n\nTom King: Yeah, so that's my answer.\n\nTim Beyers: I like it. Consensus. We got it. We're going to leave it there. Fools, as always, people on the program may have interest in the stocks they talk about, and the Motley Fool may have formal recommendations for or against, so don't buy or sell stocks based solely on what you hear. All personal finance content follows Motley Fool editorial standards, and it's not approved by advertisers, advertisements are sponsored content and provide for informational purposes only, to see our full advertising disclosure, please check out our show notes. Fools, thank you for tuning in to Motley Fool Money. For my guest, Alicia Alfiere, Tom King, for our engineer Dan Boyd, I'm Tim Beyers. Thanks for tuning in. Fool on, everyone.\n\nAlicia Alfiere has positions in Costco Wholesale. Thomas King, CFA has positions in Etsy and Roblox. Tim Beyers has positions in Instacart. The Motley Fool has positions in and recommends Bbb Foods, Costco Wholesale, Etsy, Roblox, and Walmart. The Motley Fool recommends Instacart and Kroger. The Motley Fool has a disclosure policy.\n\nConsumer Stocks Spotlight: Etsy, Roblox, and Reddit was originally published by The Motley Fool",
  "medium": "Article",
  "links": [
    "https://www.fool.com/author/20361/",
    "https://www.fool.com/author/1286/",
    "https://www.fool.com/investing/2025/08/08/consumer-stocks-spotlight-etsy-roblox-and-reddit/",
    "https://www.fool.com/legal/fool-disclosure-policy/",
    "https://www.fool.com/author/20085/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Reddit answers",
      "weight": 0.062606245
    },
    {
      "name": "Reddit",
      "weight": 0.058359493
    },
    {
      "name": "human experience data",
      "weight": 0.056368683
    },
    {
      "name": "free cash flow",
      "weight": 0.052867856
    },
    {
      "name": "Motley Fool",
      "weight": 0.05265764
    },
    {
      "name": "Motley Fool Money",
      "weight": 0.05156874
    },
    {
      "name": "Walmart earnings",
      "weight": 0.049184255
    },
    {
      "name": "Motley Fool editorial standards",
      "weight": 0.04852425
    },
    {
      "name": "Motley Fool Stock Advisor",
      "weight": 0.048284948
    },
    {
      "name": "human experience",
      "weight": 0.048077468
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97314453125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.95166015625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.896484375
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.330322265625
    }
  ],
  "sentiment": {
    "positive": 0.15722656,
    "negative": 0.5541992,
    "neutral": 0.28833008
  },
  "summary": "E-commerce companies such as Etsy, Roblox, and Reddit have been highlighted in the latest e-commerce earnings spotlight. Despite Fed Chairman Jerome Powell delaying further interest rates due to inflation data, the US economy appears to be in good shape. Etsy reported a 4% increase in revenue year over year, but its earnings per share fell 39%, and gross merchandise sales dropped 5%. This suggests that Etsy's ability to raise prices on sellers via higher take rates is only the only growth spuring this growth. However, the company's overall value and profits are not yet sustainable. Robloxy's growth continues to grow, despite its business design suggesting that its growth doesn't reflect the strength of the platform.",
  "shortSummary": "Etsy's revenue growth is a mixed bag due to increased take rates and declining sales, despite strong consumer spending, raising investor concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "5f5cde25fc2744b3817f6041dbe083ed",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/investing/2025/08/08/consumer-stocks-spotlight-etsy-roblox-and-reddit/",
      "text": "In this podcast, Motley Fool analysts Tim Beyers, Alicia Alfiere, and Tom King discuss:\n- Quarterly results from Etsy and Roblox.\n- Whether Reddit is shaping up to be a Rule Breaker.\n- A bit of business history as the big grocers prepare to report earnings.\nTo catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. When you're ready to invest, check out this top 10 list of stocks to buy.\nA full transcript is below.\nThis podcast was recorded on August 04, 2025.\nTim Beyers: What do e-commerce earnings say about the economy? You're listening, Motley Fool Money. Good morning, fools. I'm your host, Tim Beyers, with me, two of my Rule breakers teammates, Alicia Alfiere and Tom King. Alicia, Tom, how are you feeling? Are you suitably caffeinated?\nTom King: Very good. Thank you. Good to be here.\nAlicia Alfiere: Mostly caffeinated.\nTim Beyers: Mostly caffeinated. Well, you have a young baby, so you need more caffeine than most. We're going to hit e-commerce earning spotlight today. Last week Fed Chairman Jerome Powell decided to hold back on lowering interest rates, citing mildly concerning inflation data and yet US economic activity appears to be good with GDP up a reported 3%. Shouldn't that be a boon for companies driven by consumer spending? We're going to tackle two, and to me, it looks like a mixed bag. I'm going to start us off with Etsy. Tom, I'm going to come to you in a second here. But I show Etsy reporting a 4% increase in revenue year over year. EPS, though, earnings per share, fell 39%, and gross merchandise sales dropped 5%. That doesn't sound that great. Seems to be that Etsy's ability to raise prices on sellers via higher take rates is really the only thing that's fueling growth here. Am I reading that wrong? Is that true and if I am reading it right, is that sustainable? Where are you on Etsy?\nTom King: Yeah, so there were two drivers of Etsy's revenue in the second quarter of 2025. That was pretty much a flat revenue from the commission it takes on each sale on the platform, but about 15% increase in advertising revenue and gross merchandise sales, the value of things sold on the platform was a roundabout flat. Basically what the data is saying to me is, Sellers on Etsy spent a lot more money on advertising, which drove revenue for Etsy, but it didn't drive an increase in sales on the platform.\nTim Beyers: That feels like sellers have to benefit here. This has to be a mutually beneficial network. Then is it fair to say if I've heard you correctly at the moment, it's not as mutually beneficial as it should be in an ideal situation.\nTom King: No, that's a very accurate statement. GMS is flat. It's pretty much been declined pretty I had a boom it boomed in 2020 and 2021, as did many businesses, and it's been pretty much flat declining in flat since about 20:22 onwards. Over that time frame, Etsy has been steadily increasing its commission rate, its take rate, what it charges for each sale. At the same time that sales have been going down for sellers. It is not a sustainable situation, and I'm not sure how it ends, but right now it can't carry on the way it's going.\nTim Beyers: Well, watch this with caution Fools because it's it's not a doom loop, but it may be cresting into a roller coaster ride that we don't like all that much. But let's talk about one that is not, maybe a little bit more interesting. Maybe a more fun roller coaster ride. Alicia, I don't know. But Roblox's earnings, once again, seeing that the business design means that realized revenue and profits doesn't reflect the actual strength of the platform. That's certainly what it looks like and there were some strong numbers underlying the initial what looked like weakness on the top line, just quickly on this. Revenue growth and adjusted earnings per share came up short of expectations, but these numbers were really jarring to me, Alicia. Bookings jumped by more than 50%, so this is business that's done in Roblox, monthly paying users up 42%. Hours of engagement improved 58%. Is Roblox's popularity peaking, streaking? Where is it here?\nAlicia Alfiere: Well, I think Roblox's popularity is continuing to grow. As you said, revenues and profits don't tell the whole story. We need things like engagement metrics. The numbers you touched on number of users, hours spent on the platform and bookings data. That really speaks to the value of the network and the health of the platform. The latest quarter showed Roblox growing its relevance across the world. Bookings, hours spent, daily average users, all of these metrics were up across all world regions. But we do have to be careful here. There were five very popular viral experiences that Roblox has that has over 10 million daily active users and four of those are pretty new.\nAlicia Alfiere: They've launched just within the last 12 months. But Roblox is more than those games. Excluding those top experiences, hours of engagement still grew 47% year over year, and over half of the growth in spending and Roblox experiences came from the games or experiences that weren't in that top ten. Again, that growth should continue, but we have to be careful not to expect the growth from those viral heads to continue since interest tends to wane over time with things that are viral.\nTim Beyers: Well, don't tell the acquirers that because one of those top games, what is it? A kid that made a Roblox game in, like, three months and then sold it for something like three million to, I don't remember if it was private equity or just a VC fair, whatever it was, but it was quite a deal here. It does look like the top of the top of the funnel is generating pretty massive interest.\nAlicia Alfiere: Yeah and I'm glad you brought that up. Viral games can really help to attract new users and also important new developers to the platform. If those users are sticky, if those developers create games that resonate, it'll help to continue to grow Roblox's relevance and its network value over time.\nTim Beyers: We would like to think so. Up next, Is Reddit a rule breaker in the making? We're going to debate it. You're listening to Motley Fool Money.\nMALE_1: Wish you could lock in rates without locking out liquidity? Meet LDDR, a LIFEX Treasury bond ladder ETF built to simplify your cash flow plan for the next 10 years. With LDDR, you can lock in today's interest rates for a decade. It's built to deliver predictable monthly cash flow that boosts interest income by including tax free return of principle. That means the potential for higher, more stable cash flow without worrying about rate cuts, reinvestment risk or market swings. LDDR, take the guesswork out of your cash flow plan. Learn more at lifexfunds.com. The LIFEX ETFs return principal over the life of an ETF and therefore expected to have little or no assets remaining to distribute at the time of liquidation. Individual bonds carry an obligation to fully return the principal to shareholders at maturity. However, ETFs have no such obligation. The net asset value of the ETFs will decline over time as income payments are made to shareholders. Tax discussion herein is general in nature. Investors should consult with their tax advisor about the effect that an investment in LIFEEX ETFs could have on their tax situation. Investors should consider the investment objectives, risks and charges and expenses of LGDR carefully before investing. The prospectus contains this and other information about the investment company and can be obtained by visiting www.lfxfunds.com or by calling 1-888-331-5558. The prospectus should be read carefully before investing. Investing in the LIFEX ETFs involve risk. Principal laws is possible. The LIFEX income ETFs are distributed by Foresight Financial Services, LLC.\nTim Beyers: Now that we're back here, let's talk about consumers who don an alter ego and take on social news and discussion platform Reddit, which recently reported earnings. We're going to talk about whether or not this is a rule breaker in the making, and we're each going to give a take on this. But before we do, let me tee this up with some data. Revenue grew 78% year over year in the most recent quarter. The company reported its biggest ever earnings beat as a public company, Reddit answers, which is something that they provide as a way to draw from the expertise of the community to answer significant questions. That was up 6X in weekly users and daily active users reached 110.4 million. That was up 21%. I'll start us here. There is some amount of evidence that Reddit is scaling and getting more out of the network as it grows. I found this fascinating. Reddit is a cash generator on a simple FCF basis, free cash flow, that means and it's produced 3.7 million in free cash flow, even after you subtract out all the stock based compensation. Now, there isn't enough cash there on an organic basis to cover their acquisitions, and Reddit does make acquisitions. But still, this is impressive. They are scaling they look like they are scaling inevitably toward consistent free cash generation. But Alicia, tell me, am I wrong? Is this a rule breaker in the making?\nAlicia Alfiere: I don't think that you're wrong, but I do have a question.\nTim Beyers: But you think I might be misguided?\nAlicia Alfiere: No, I would never I would never say that, Tim. I do have a question I've been noodling on, and perhaps we could all noodle on it together. I'm a big fan of Reddit, especially as a new parent. There is a wealth of human experience that you could find there, and there are different channels. Mom, Dad, all kinds of subreddits. I do think that in order to grow over the next five years, Reddit needs to hold on to this key competitive advantage of its trove of human experience data. Now, in their earnings call, Reddit talked about how AI can answer many questions, but some questions require a human answer and a range of human answers. But it also talked about human experience data being incredibly useful to another of the users of its platform, which are LLMs. I wonder, will selling access to its human experience data essentially give its competitive advantage away to LLMs, and if not, can AI and LLMs become a weak point in Reddit's network if their net contribution is negative for Reddit, since they're benefiting from the human experience data, seeking to replace Reddit in some ways by getting that data and using it in their own learning and if they ever post anything to Reddit, it would likely diminish the value of the human experience data that is so important for Reddit.\nTim Beyers: Maybe, but as somebody who's worked on some code that is trying to hit the Reddit API, can I just tell you how expensive it is to get the Reddit data through the API? I would say Reddit is not undervaluing that data, and if LLMs want to play and people who are using those LLMs want to play, they're going to pay, and it's not going to be cheap. It's an interesting question, though, but Tom, where do you land on this?\nTom King: Would be very wary of Reddit.\nTim Beyers: Say more.\nTom King: It makes almost all of its money from advertising. That means that when people go onto Reddit.com, they see a banner ad on the side or a highlighted link, sponsored link or something, that's where Reddit makes all its money. There is a very big question right now about how much people are going to be visiting individual websites when they can get their answers from an LLM. That is a big unknown for me right now. If Reddit is not getting as much traffic to its website as it did historically, that is going to hurt Reddit badly and add to this fact that it is trading at 20 times revenue, and these are the kind of multiples we haven't seen since 2020, 2021, and that did not end well. I would be very cautious of Reddit.\nTim Beyers: Yeah, I'm glad you brought up the valuation. The valuation is arguably extreme and the hurdles that it has to get past. In order for Reddit to really blossom and deliver returns for investors, if you're a rule breaker investor and you're really looking at this one, you have to be looking out ten years and seeing an extraordinary expansion of that free cash flow margin, and you have to hold steady not only in that advertising business, but you're probably going to have to come up with new ways to generate revenue. That API that's feeding the LLMs, that's going to have to be profitable and persistently so and you may even need a third revenue stream that we can't even see yet, so yeah, this is speculative. I think we can agree. Is it a rule breaker? I think the consensus here is like, yeah, maybe. We'll take a look at it, but I don't think it's as cut and dried as it might be. I'm not sure it has all six traits. Alright, Fools, up next, a little bit of business history. A new segment. Please stay tuned. You're listening to Motley Fool Money.\nIn the spirit of education on these podcasts and something we used to do on a show you may have seen on Fool Live called This Week in Tech, we are bringing you now. This Week in Business history. For each of you, I know you've seen the notes, so you don't have to act surprised here, but I wonder if you are surprised by when this was. Today is August 4. If we go back to August 4, 1930, that is the opening of the first King Cullen supermarket in Queens, New York. Quick side note, I remember as a kid before we left New York, I remember going like, with my mom on shopping trips to the King Cullen supermarket. I know this name. I remember it from, like, the early 1970s. Here's my question for each of you, and I'll kick it off to you first, Tom. Are you surprised that supermarkets have been around now going on 100 years?\nTom King: You'd asked me, I would have thought it began later, so yes, I am surprised it began as early as 1930.\nTim Beyers: Alicia, what do you think?\nAlicia Alfiere: I'm not terribly surprised, but I do wonder how they were different, how their footprint was different than they are today. I'm sure they were much smaller and carried out much less variety of goods.\nTim Beyers: Well, so it's interesting you mentioned this because this is the Smithsonian Institution says, It's America's first supermarket, and it was revolutionary at the time. It introduced the concept of a self service grocery store. Up till this point, you would go to a grocer, and the grocer would take your list of what you want and then go get everything out of the backroom, out of the stock room, and bring it to you. Yeah, Alicia, go ahead.\nAlicia Alfiere: I feel like that should come back. I love the convenience of that, isn't that almost like Instacart?\nTim Beyers: It is. That's right. Like, this is the thing. The rule breakers lesson here is that it is very often that an existing industry that used to have rules that were broken end up getting rules broken again, and sometimes we go back to a variation of the old rules. This is exactly right. Instacart is like this. Interestingly, also, this idea of small format, lots of things pre designed, designed really to break really the price barrier and this is what's interesting very low prices was what King Cullen was known for. This sounds like another recent rule breaker, Tom, which I would say is BBB Foods. Not necessarily a big warehouse. Reasonable form factor really small designed for really low prices, and you get in and you get your stuff fast and you get it and you get out, so this is interesting to me. Here's my question for you, Tom, and then I'll kick it back to you, Alicia. This does seem ripe for yet another paradigm shift. Have I made you more interested, less interested, or you are as interested as you always were about looking at rule breakers in this industry?\nTom King: It certainly is a very big industry, close to a trillion dollars in sales in 2024. It is an industry that hasn't changed very much for quite a long time. As you said, the first supermarket introduced in 1930 now, that is how we mostly get our groceries from Walmart is, for example, one of the biggest grocers in the United States. I suppose somebody could figure out a way to do it better, but it is a difficult industry to enter because, the margins are very thin. They're very big, well prepared competitors Costco, Walmart, I'm thinking of in particular. It's a hard thing to shop for groceries. Sometimes the thing you want is not there or you like your bananas a certain ripeness. Other people think there should be a different ripeness. All those factors make it pretty hard to get this right and disrupt. But I'm certainly interested to hear ideas from people that try to do it differently. I think Amazon Fresh was quite an interesting idea in the whole grocery space and that I don't think has been particularly successful.\nTim Beyers: No, it wasn't that good an idea.\nTom King: Why do you say that, Tim? Because I think they tried to automate far too much of it and stripped all of the humanity out of it, and I think that just didn't work. But let's end on this. It's a $1 trillion, as of 2024, it's a $1 trillion market and we're going to get a better read on how this is doing when Walmart reports earnings on August 15, so stay tuned for that. Kroger will report in September. Will there be disruption here? We're going to have to look at the numbers in the coming month. Let's end with a prediction because we have Walmart earnings coming up on August 15, then we have Kroger earnings coming next month in September. Here's my question. Quick one, yes or no, which one or actually, which is the bigger outperformer? Walmart or Kroger over the next 10 years. Give me a rough estimate of what you think and I'll start us off here. I won't just leave you on the hook. I'll go with you first after I give my prediction here. I'm going to say Walmart, and I'm going to say at least 10% annualized over the next 10 years. I think Kroger's going to struggle to get over 7%. Alicia, what do you think?\nAlicia Alfiere: Tim, you came in and stole my answer right out of my head.\nTim Beyers: No. You didn't copy my answer. There's no rules here.\nAlicia Alfiere: I would copy your answer, but I would also say that as Tom was talking, I was thinking about this idea of disruptors in this space, and I thought, there are some cases in which a player that has been in the market for a while can disrupt the market and disrupt itself. I think if any company has the likelihood of doing it, it would be Walmart, so I agree.\nTim Beyers: Walmart disrupting itself.\nAlicia Alfiere: Yes.\nTim Beyers: I like it, Tom.\nTom King: I always try to take a diff different answer to what my co hosts have given, but honestly, that's exactly what I was going to say Tim. Walmart.\nTim Beyers: There you go.\nTom King: Around about 10%.\nTim Beyers: Consensus.\nTom King: Yeah, so that's my answer.\nTim Beyers: I like it. Consensus. We got it. We're going to leave it there. Fools, as always, people on the program may have interest in the stocks they talk about, and the Motley Fool may have formal recommendations for or against, so don't buy or sell stocks based solely on what you hear. All personal finance content follows Motley Fool editorial standards, and it's not approved by advertisers, advertisements are sponsored content and provide for informational purposes only, to see our full advertising disclosure, please check out our show notes. Fools, thank you for tuning in to Motley Fool Money. For my guest, Alicia Alfiere, Tom King, for our engineer Dan Boyd, I'm Tim Beyers. Thanks for tuning in. Fool on, everyone."
    },
    {
      "url": "https://www.fool.com/legal/fool-disclosure-policy/",
      "text": "Here at The Motley Fool, when it comes to matters of money, we believe in transparency and accountability. Day in and day out, we dedicate ourselves to delivering responsible investing ideas and sound financial education. That's why, when it comes to talking about stocks, we think it's important that you know exactly where we're coming from. With this in mind, we have developed a company-wide disclosure policy to guide our business and communications. We call it Fool Disclosure. We invite you to take some time to read through it, and hope it helps inform your experience here in Fooldom.\nInvestors Communicating With Investors\nThe Motley Fool is a company that represents investors teaching and learning from other investors. Many financial publications do not permit their writers and editors to own stocks. The Motley Fool not only permits, but also encourages its staff to invest in common stock. Why? Two reasons.\nFirst, we strongly believe the most effective way to create wealth is through the long-term ownership of stocks. The stock market has compounded 10% average annual returns over the last century. We believe in using the stock market as a savings bank, and we strongly encourage treating money management as a lifelong endeavor. Therefore, we think it'd be downright mean of us to close that avenue of investment to our employees.\nSecond, and more important, we don't consider our employees to be journalists, but rather communicators and teachers of financial matters. It's a subtle but critical difference that affects our entire service -- from our online site at Fool.com, to our investment books, to our nationally syndicated newspaper column, to our newsletters and portfolio services. As a company, we utilize every available medium to teach people of all ages, all income levels, all backgrounds, and all genetic codes about money and its applications in modern life. Therefore, we believe our staff's involvement in managing their own money is critical to their learning more about the subject and their succeeding in their own lives. And who better to write about investing than those who do it themselves?\nThe Motley Fool writes about stocks in both free and paid content. We make stock recommendations in our various premium newsletter services and actually hold some of these shares in our portfolio services. We will disclose our recommendation or ownership until we cease to recommend the stock, or we sell our entire position. Of course, in both free and paid content we will continue to disclose whether the author has an interest in the stocks mentioned.\nInternally, the Fool has always strived to operate with the highest levels of integrity and transparency. As such, here are the key components of The Motley Fool's disclosure policy:\nDisclosure\n- When a writer writes about a stock that he or she has a position or beneficial interest in, that fact is disclosed at the end of the article.\n- If The Motley Fool recommends or holds a position in a stock, that fact is also disclosed at the end of the article.\n- All Fool employees and contractors -- that's anyone with a TMF prefix on their screen names -- are required to disclose their current positions, including stocks, mutual funds, and cryptocurrencies. We aggregate and display these positions for the entire company here. (We do not disclose the individual stocks that might be in a Fool's mutual funds.)\n- Affiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no knowledge of any affiliates' holdings and/or specific recommendations, and the affiliates' personnel have no knowledge of any editorial content before it is published. Our affiliate companies may also have their own disclosure policies, which they may make available on their respective sites.\nTrading Restrictions\nIn addition to the above disclosure requirements, Fool employees work under additional trading restrictions and guidelines. These restrictions require that they:\n- Must hold any stock they own for at least 10 days. (No day trading allowed -- as if we'd want to!)\n- Cannot write about a stock in the period of 2 market days before to 2 market days after purchasing or selling the stock.\n- Must clear trades with our compliance department prior to any transaction.\n- Must notify our compliance department every time they buy or sell a stock, regardless of whether they have written about it.\nInvestors in The Motley Fool\nThe Motley Fool is grateful to the people that have invested in us. The Fool's founders and some family members have invested in the company, and full-time employees receive stock options and/or stock in the company.\nBusiness and Technology Partners\nWe have business relationships with an ever-changing assortment of companies, including technology vendors, leasing companies, data providers, banks, distribution channels, advertisers, landlords, accountants, and the restaurants up the street from Fool HQ. Many of these companies are public companies operating in industries that we follow. There may be instances in which one of our newsletters recommends a company with whom we have a business relationship, or we may write an article about such a company on Fool.com. These occurrences are unintentional and coincidental, as the business end of The Motley Fool has no input or influence on the editorial side of things.\nIt would take too much space to list all the companies that we do business with, and we'd probably forget some anyway, but below are some of our major partners. (This list is most subject to change. We'll update it periodically, but we will not be able to keep pace with the rate of change.)\nInvesting Advertisers\nAs a general rule, if you see ads from a company on our site and emails, that company is paying us for such placement. Some of the major ones include E*Trade, Fidelity, Scottrade, OptionsHouse, and ShareBuilder. Additionally, companies pay us for inclusion in specific areas of our site (e.g., Registration Page, Broker Center).\nMotley Fool Money\nA portion of our site, branded as Motley Fool Money, writes reviews of personal finance products, including credit cards, mortgage offers, and brokerage accounts. We may receive compensation for offers that appear on Motley Fool Money, including compensation related to placement.\nWe may issue recommendations for preferred partners that we believe in and/or use ourselves. But keep in mind, this site may not include all available offers from our partners. For example, there are thousands of credit cards available. We’ll highlight a fraction of them. All picks are made at the editorial discretion of Motley Fool Money editorial team.\nFor a list of major advertisers on Motley Fool Money, click here.\nDistribution Partners\nSome of our major distribution partners include Yahoo! Finance, MSN Money, USA Today, AOL, Nasdaq, and CNN Money.\nNews, Quotes, Data, and Content Providers\nOur major providers include Xignite SIX Financial.\nMajor Service Providers or Other Partners\nSilicon Valley Bank, Slack, Namely, Charles Schwab, Interactive Brokers, Worldpay/Vantiv, and Jones Lang LaSalle.\nIn Conclusion\nWe have designed our disclosure and trading guidelines to serve our community, our customers, and our employees fairly. As always, though, you should remember to consider every piece of investment information you receive, here at the Fool or elsewhere, not as a de facto recommendation, but as an idea for further consideration. Even the strongest disclosure policy in the world does not excuse individuals from taking responsibility for their own decisions. Due diligence, critical thought, and use of the most extraordinary device in the world (the human brain) are crucial to your financial success.\nLast updated November 11th, 2024."
    }
  ],
  "argos_summary": "In a recent podcast, Motley Fool analysts discussed the mixed earnings reports of Etsy and Roblox, highlighting Etsy's 4% revenue growth but a significant drop in earnings per share and gross merchandise sales. Analysts expressed concerns about Etsy's sustainability due to rising commission rates amidst declining sales for sellers. In contrast, Roblox showed strong engagement metrics despite falling short on revenue expectations, indicating ongoing popularity. The discussion also touched on Reddit's impressive revenue growth and user engagement, but analysts cautioned about its reliance on advertising and potential challenges from AI and LLMs.",
  "argos_id": "US6OWK86I"
}