{
  "url": "https://www.usatoday.com/story/money/2025/08/08/buy-nothing-free-community-groups-save-money-environment/85259588007/",
  "authorsByline": "Betty Lin-Fisher",
  "articleId": "3a72205d0b9e4f61a0a39dc12460ba42",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/07/18/USAT/85279156007-no-buy-4.jpg?crop=1438,810,x0,y111&width=1438&height=810&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T20:35:42+00:00",
  "addDate": "2025-08-08T20:39:16.968682+00:00",
  "refreshDate": "2025-08-08T20:39:16.968684+00:00",
  "score": 1.0,
  "title": "'Buy Nothing' or free groups help neighbors give (and receive) items at no cost",
  "description": "Want to declutter or stock your kitchen? You can find groups on Facebook where people are gifting things to each other for free.",
  "content": "Michelle Wolf got three spin bikes — two for a teacher friend's classroom and one for herself.\n\nJoni Holderman got a gently used rug that retails for $1,000.\n\nThey're part of a growing trend of consumers giving and getting things — for free — via local community groups that are often titled \"No Buy,\" \"Buy Nothing,\" or tagged with the words \"Free in\" and a community name, on Facebook or other web platforms.\n\nThese groups provide a connection among community members and neighbors who want to give things away for free or people who are looking for items. It also helps the environment by keeping unwanted belongings out of the trash or landfill.\n\nIt is a super-local gifting economy, said Naomi Serviss of North Kingstown, Rhode Island. She has received and given away countless items in Buy Nothing groups both in her current hometown and New York City.\n\nServiss is a long-time thrifter. But getting something for free is even better.\n\nWhen Serviss lived on Manhattan's Upper West Side, she scored what she calls free \"eclectic treasures.\"\n\nAmong them were African masks, soft sculpture art, decorative sofa pillows and even a runner rug that fit her hallway, she said.\n\n\"I happily gave away brand-name raincoats, sporty hats and a wedding guest formal gown worn once to my nephew's Albany wedding eight years ago,\" she told USA TODAY.\n\nOne of her favorite \"gets\" was a \"stunning\" red embroidered kimono, Serviss said. She mounted it on the wall of her one-bedroom apartment.\n\n\"It was a thing of beauty and when it was time to relinquish it, I joyfully passed it on to an interested neighbor,\" she said.\n\nWhen Serviss and her husband moved to Rhode Island, she found a new local Buy Nothing group.\n\nServiss gifted a new set of turquoise Ikea stoneware to a person who had posted an \"ISO\" or \"in search of\" message for kitchen supplies for her grandson's new apartment.\n\n\"Coincidentally, that same member was offering a striking antique African doll,\" said Serviss. \"When she responded to my interest, she mentioned how much her grandson loves the dishes and wanted me to have the doll!\"\n\nHow does a Buy Nothing or No Buy group work?\n\nThe largest network of Buy Nothing groups on Facebook and via a web portal is through the Buy Nothing Project, which was founded in 2013 by two friends, Liesl Clark and Rebecca Rockefeller, in the Pacific Northwest when they saw a beach full of washed-up plastics of every shape, color and size.\n\nThere were three reasons the ladies started the first group, Clark told USA TODAY in an interview: to help save the environment, to create a gifting economy to share items, and to help people connect socially with each other.\n\n\"We all need each other and we can create a circular economy within our community and keep sharing our stuff, especially kids stuff and clothes,\" she said.\n\nThe women had met on Freecycle, a longstanding web platform where people can post things they are giving away.\n\nThe friends launched their own concept on Facebook, creating their first Buy Nothing Group in Bainbridge Island, Washington.\n\nWithin hours, it went from the two ladies to hundreds of people.\n\nThe idea has now become a worldwide social movement, with 12.85 million users in groups on Facebook and 1.5 million people participating in the BuyNothing App, which also can be accessed online at https://buynothingproject.org. People from 44 nations have registered Buy Nothing groups on Facebook and downloads of the app come from about 193 countries, Clark said.\n\n\"We never intended to grow a social movement,\" she said. \"We intended to just solve a problem in our own community, which was the amount of plastics washing ashore.\"\n\nHow to participate in a Buy Nothing group\n\nIt costs nothing for people to participate in a Buy Nothing group. If someone wants to create a new Buy Nothing group on Facebook, it costs $10 for a license. The project then sets up the group and loads the general rules to get the group started, Clark said.\n\nClark said there are groups on Facebook that use the Buy Nothing name and don't register, which is a violation of the trademark, but her group is not big enough to \"police\" it. There are also groups formed on Facebook that have similar concepts of offering free items within a community, or people who give things away on Facebook Marketplace and are not affiliated, she said.\n\nThe Buy Nothing Project has also developed a mobile app and website, https://buynothingproject.org, which is available for people who don't want to be on Facebook. People can find local groups or participate in a global group online or on the app, paying a minimal shipping fee for their free item. That helps open up the concept to people in communities that might be too small for their own group, Clark said.\n\nWhat are the rules of a Buy Nothing or free group?\n\nThe Buy Nothing groups all agree to some general rules, including that money can't be involved and no illegal activity is allowed. But then, each group has its own rules.\n\nMichelle Wolf's group near Pleasantville, New York, asks the gifter to wait six hours before they pick a \"winner.\" Wolf said when she's gifting something, sometimes she picks someone based on their \"story\" and sometimes she uses an app to pick someone randomly.\n\nWolf \"won\" a spin bike when she explained that her friend, a teacher for students with disabilities, had a classroom spin bike that broke.\n\nThe kids in the classroom were thrilled, and so was the gifter, Wolf said. She also got a second bike for the friend's classroom and then one for herself.\n\nHolderman said she loves the Buy Nothing group because \"it transforms our mindset from one of scarcity and struggle to one of abundance and sharing.\"\n\nThe best thing Joni Holderman of Myrtle Beach, South Carolina has received in her group was an 8-by-10-feet rug from West Elm that, when she looked up the retail value, turned out to be worth $1,000.\n\n\"I know it was lightly used, but it's wonderful,\" she said.\n\nHolderman has given away a large beach-themed dresser and a sofa, among other things. While she still donates to charities, for something like a sofa, she'd have to haul it there. Instead, someone came and got it.\n\nHolderman said she'd also rather give things away to someone grateful instead of getting some money for selling it on Facebook Marketplace. \"There's that whole haggling over the price. It's almost an adversarial relationship.\"\n\nFree groups help people struggling in this economy\n\nThe Buy Nothing community and similar groups are especially helpful in today's economy, Clark said.\n\n\"Everyday people are struggling and our economy is kind of questionable where it's going to go and we want to be that safety net,\" said Clark.\n\nThe groups connect people to each other.\n\n\"They come for the stuff,\" Clark said, \"and they stay for the community.\"\n\nBetty Lin-Fisher is a consumer reporter for USA TODAY. Reach her at blinfisher@USATODAY.com or follow her on X, Facebook or Instagram @blinfisher and @blinfisher.bsky.social on Bluesky. Sign up for our free The Daily Money newsletter, which will include consumer news on Fridays, here.",
  "medium": "Article",
  "links": [
    "https://puzzles.usatoday.com/",
    "https://profile.usatoday.com/newsletters/the-daily-money/?for-guid=ad4a9a18-a205-4c95-b25b-7511a2fe34ae&utm_source=usatoday-TheDailyMoney&utm_medium=email&utm_campaign=baseline_greeting&utm_term=newsletter_greeting&utm_content=USAT-8872UT-E-NLETTER04",
    "https://buynothingproject.org",
    "https://buynothingproject.org/",
    "https://www.usatoday.com/story/money/2025/07/19/what-is-no-buy-july-save-money/85258393007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Buy Nothing groups",
      "weight": 0.10780618
    },
    {
      "name": "Free groups",
      "weight": 0.102528
    },
    {
      "name": "free group",
      "weight": 0.102528
    },
    {
      "name": "local community groups",
      "weight": 0.09788901
    },
    {
      "name": "local groups",
      "weight": 0.093386754
    },
    {
      "name": "group",
      "weight": 0.090780266
    },
    {
      "name": "groups",
      "weight": 0.090780266
    },
    {
      "name": "similar groups",
      "weight": 0.089749455
    },
    {
      "name": "Buy Nothing",
      "weight": 0.080305934
    },
    {
      "name": "free items",
      "weight": 0.06887527
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Charity & Philanthropy",
      "score": 0.861328125
    },
    {
      "name": "/News/Local News",
      "score": 0.67919921875
    },
    {
      "name": "/Hobbies & Leisure/Special Occasions/Holidays & Seasonal Events",
      "score": 0.4169921875
    }
  ],
  "sentiment": {
    "positive": 0.4230957,
    "negative": 0.10858154,
    "neutral": 0.46850586
  },
  "summary": "Free groups, often titled \"No Buy,\" \"Buy Nothing,\" or tagged with the words \"Free in\" and a community name, are helping neighbors and neighbors give and receive items at no cost. These groups connect among community members and neighbors who want to give away free items. The concept is part of a trend of consumers giving and receiving items for free via local community groups. The largest network of Buy Nothing groups is through the Buy Nothing Project, which was founded in 2013 by two friends in the Pacific Northwest. The idea has now become a worldwide social movement with 12.85 million users in groups on Facebook and 1.5 million participants in the BuyNothing App. It costs nothing to participate in a Buy Nothing group, with the cost of setting up the group loads the general rules to get started.",
  "shortSummary": "A growing trend of \"Buy Nothing\" groups, allowing individuals to give or receive free items, helps the environment, and foster community engagement.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "eae802771d674bc9919cf0fa36e0c7cf",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/money/2025/07/19/what-is-no-buy-july-save-money/85258393007/",
      "text": "What is No Buy July? We explain the trend that can save you money.\nRecently, some friends invited Maggie Miller to bring her kids to a trampoline park for a play date. Another friend invited her and her husband out for dinner.\nMiller wanted to go to both events, but said no. She's trying to save money.\nHer family is participating in No Buy July, a growing trend on social media that encourages consumers to only buy the necessities and refrain from buying what is not needed.\nThose who are participating say it is a good challenge and a way to save. Financial experts say the exercise of purposefully controlling your spending is a good one with several benefits.\nWhat is No Buy July?\nNo Buy July may have varying rules based on who is doing it, but essentially the challenge allows you to continue to spend on the items you need: food, gas, bills that need to be paid, home and unexpected medical expenses. But the discretionary items or trips to the store, or extra online shopping are off-limits, as are spending money on eating out.\nOr at least that's the goal. Some people say they have been successful at not buying extras and others say they've had \"slip ups.\"\nNo Buy July offers a pause on purchases\nMiller, who lives in Gilbert, Arizona with her husband and two young kids, has done no-spend weeks before. But No Buy July came at the right time, she said.\n\"I was like 'Oh, that's catchy. I like it. And we had just a really spendy June,\" said Miller, explaining that her husband had been invited on a once-in-a-lifetime, last-minute trip and she had a baby shower that required travel. Their daughter's birthday – and birthday party – was also in June.\nParticipating in No Buy July is a way to \"force yourself to just press pause on purchases and ask 'Do we really need this?'\" Miller told USA TODAY. \"It really helps at the end of the month to look back or as you're going through the month to see 'Where are my spending habits? Where am I triggered to spend?' \"\nMiller has been sharing her No Buy July experience on her Instagram account, MoneySavingMotherhood. She started the account about a year ago and said as a working mom with a family, she shares real-life tips for budgeting and saving money.\nFrugal mom has wins and losses\nMiller said because she is frugal and is not \"constantly spending all the time,\" the No Buy July experience has not been too painful. But there have been moments, like when her girlfriend texted to ask if Miller and the kids wanted to go to a trampoline park, that it got a bit difficult. It was 115 degrees in Arizona and Miller said the thought of a fun activity in air conditioning was tempting. It was also hard to turn down a dinner invitation, she said.\n\"It's hard to say no, but I think it's a good exercise to practice,\" she said.\nOn her Instagram post for her second week of the challenge, Miller outlined her expenses:\n- Regular bills: $291.88 (That also included $21.65 for subscriptions like streaming services, which Miller said doesn't make sense to cancel for a month and restart).\n- Unexpected expenses: $696.74 (their garage door broke and cost $500 and they needed their palm trees trimmed and new sprinklers for $96.74).\n- Miscellaneous household expenses: $72.46 (This included buying household staples like laundry detergent and sunscreen to get good deals during Amazon Prime Days. But she refrained from extra purchases, Miller said).\n- Unnecessary: $60.14 (Miller said this is where she theoretically \"messed up\" by going to a thrift store and buying a few dresses. \"It was completely unnecessary,\" she said. \"I'm going to Hawaii for my 10-year anniversary in September and they were so cute.\"\nBe kind to yourself; \"mess ups\" are OK\nMiller said though she considers the thrift trip and purchase a \"mess up,\" she won't give up on No Buy July, and encourages others to do the same if they encounter a setback.\nMiller said it should still be OK to forgive yourself and continue on.\nEven though she has an Instagram page about frugal living and budgeting, \"I'm just as susceptible to treating myself to something,\" she said, adding that she tells herself, \" 'Yeah, it was unnecessary but I did it and we're going to move on.' \" Miller is vowing not to tempt herself by going near any thrift stores for the remainder of the challenge.\n\"I know that's my pitfall,\" she said.\nFinancial planners like No Buy July concept\nKelly Renner, a certified financial planner in Augusta, Georgia, had not heard of No Buy July, but loves the concept and has encouraged clients to do similar exercises once in a while.\n\"When you pay attention to your spending, you spend less. Even those who followed a budget and maybe just fell off, it is a good reset to do a challenge,\" Renner told USA TODAY. She'll also have spouses challenge each other to see who can save the most during a challenge.\nThe con of a spending challenge, she said, \"is if they have a life event happen out of their control, it can be more defeating mentally. But as long as they can overcome and try again it is still more of a win than a fail.\"\nBill Shafransky, a certified financial planner in New Canaan, Connecticut, challenges people \"to take this concept a step further and make this a permanent trend. You'd be surprised at how much extra money you'll have leftover at the end of the month.\"\nAnd Shafransky told USA TODAY that if people are going to follow a No Buy July concept, \"you'll need to keep disciplined when August hits and you feel the urge to go buy everything you held off on. It's kind of like going on a super strict food diet. The cravings get so bad that when the diet is over, you indulge yet again. Don't let that happen.\"\nEncouraging others to do No Buy July\nNaomi Serviss of North Kingstown, Rhode Island already considers herself frugal. So she said she fully embraced No Buy July when she heard about it.\n\"I hate shopping in stores and I just try to rein everything back and not buy things online,\" Serviss said. \"It's a really great concept and I hope more people adopt it.\"\nServiss regularly uses a local No Buy Facebook group to give away and get items. She's gotten such items as a bookshelf and a guitar holder.\nIn July, Serviss is going to skip her once a month thrift store trip, timed for the 50% off discount \"for a certain age group. I even put off looking for my mother-of-the bride's dress because I have time,\" she said, of her daughter's wedding in October.\nServiss said she's been telling her friends and family to participate in No Buy July and they have been.\nRetailers are hit with consumer wariness\nConsumers are increasingly holding back on spending as they worry about inflation and tariffs and retailers are taking a hit, said Craig Rowley, senior client partner retail at Korn Ferry, a global human resources consulting firm.\nRowley, who leads the firm's consulting retail practice for the U.S., said as he talks to retail executives, they don't know how to plan for business right now with so many uncertainties. Retailers are also completing their buying for the spring 2026 season and don't know how this Christmas season will go with tariff and inflation pressures, he said.\n\"Retail is very much a function of consumer confidence. When people are happy and doing well, they're going to spend money. They're going to get their credit card out,\" Rowley told USA TODAY. \"They're going to buy not only the things they need, but they're going to buy the things they want. When they're nervous and uncomfortable, then they're going to watch and see what happens. They're going to sit on their wallet.\"\nRowley said there are other similar concepts to No Buy July like Frugal February, when consumers tighten their budgets after holiday spending. Any social movement, including shoppers who have been boycotting certain retailers for their rollbacks of diversity, equity and inclusion efforts, hurt retail sales, Rowley said.\nHe hasn't heard his clients talk specifically about No Buy July, but \"they're all more worried about the fact that it's been a slow year.\"\nRowley thinks July will be a tough month for retailers since consumers are spending less and struggling financially, but retailers are expecting August to pick up with Back to School sales and purchases.\nBetty Lin-Fisher is a consumer reporter for USA TODAY. Reach her at blinfisher@USATODAY.com or follow her on X, Facebook or Instagram @blinfisher and @blinfisher.bsky.social on Bluesky. Sign up for our free The Daily Money newsletter, which will include consumer news on Fridays, here."
    }
  ],
  "argos_summary": "The article discusses the rise of community groups like 'Buy Nothing' and 'No Buy' on social media, where members give and receive items for free, fostering a local gifting economy and reducing waste. The Buy Nothing Project, founded in 2013, has grown into a global movement with millions of participants, emphasizing community connection and environmental sustainability. Additionally, the 'No Buy July' trend encourages individuals to limit discretionary spending, promoting financial mindfulness and community support during challenging economic times.",
  "argos_id": "VHMJF8H8T"
}