{
  "url": "https://finance.yahoo.com/news/why-peloton-stock-surged-today-233916344.html",
  "authorsByline": "Keith Noonan, The Motley Fool",
  "articleId": "75f7b74a130f430697ead36bc40e4adc",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/QvtG7rwljf.N07hZ.lPZ5Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTY7Y2Y9d2VicA--/https://media.zenfs.com/en/motleyfool.com/cdc433399fc2fe1150da7e286a6730b3",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T23:39:16+00:00",
  "addDate": "2025-08-09T00:08:10.570671+00:00",
  "refreshDate": "2025-08-09T00:08:10.570673+00:00",
  "score": 1.0,
  "title": "Why Peloton Stock Surged Today",
  "description": "Investors and analysts have gotten more bullish on Peloton stock following the company's recent quarterly report.",
  "content": "• Goldman Sachs published new coverage on Peloton stock after the exercise-tech company published its quarterly results yesterday.\n• Goldman raised its rating on Peloton from neutral to buy and increased its one-year price target on the stock from $7 per share to $11.50 per share.\n• Peloton's margins have recently improved significantly thanks to cost-cutting moves, and the company is making moves to help stabilize sales.\n• 10 stocks we like better than Peloton Interactive ›\n\nPelton (NASDAQ: PTON) stock closed out Friday's trading session with big gains. The company's share price gained 10.3% on the day's trading and had been up as much as 11.5% earlier in the session.\n\nPeloton's valuation bounded higher today thanks to bullish coverage on the stock published by Goldman Sachs. The positive analyst coverage came on the heels of better-than-expected quarterly results released by the company -- and the new analyst note helped extend the exercise-machine specialist's rally.\n\nYesterday evening, Goldman Sachs published new coverage on Peloton -- and the note had a big impact on the stock in today's trading. With its new coverage, Goldman raised its rating on Peloton stock from neutral to buy. The investment firm also increased its one-year price target on Peloton stock from $7 per share to $11.50 per share. Even after a big gain for Peloton's valuation today, Goldman's new price target on the stock still suggests additional upside of roughly 47%.\n\nPeloton recently published results for the fourth quarter of its last fiscal year, which ended June 30, and the company's cost-cutting initiatives pushed the business to an unexpected profit in the period. While the company's sales still declined by roughly 6% year over year in the quarter, cost-discipline led to margins that were significantly better than anticipated.\n\nWall Street had expected the business to record a loss of $0.05 per share in fiscal Q4, but Peloton actually recorded a profit of $0.05 per share in the period -- and its margin improvement appears to be sustainable in the near term. Management also anticipates that the business's sales decline will slow in the current fiscal year. There are some indications that efforts to grow sales among enterprise customers are bearing fruit.\n\nDo the experts think Peloton Interactive is a buy right now?\n\nThe Motley Fool’s expert analyst team, drawing on years of investing experience and deep analysis of thousands of stocks, leverages our proprietary Moneyball AI investing database to uncover top opportunities. They’ve just revealed their 10 best stocks to buy now — did Peloton Interactive make the list?",
  "medium": "Article",
  "links": [
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=d599a463-1cec-4526-b46b-5c54b9f56b13&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001139%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_yahoo%26ftm_pit%3D18007&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=12cd1458-5447-46b9-8125-92a471207047",
    "https://www.fool.com/terms/p/price-target/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=12cd1458-5447-46b9-8125-92a471207047",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=e22d3daf-60e6-482f-b70f-a5c4019b23e0&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000053%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_yahoo%26ftm_pit%3D17670"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Peloton Stock",
      "weight": 0.12966582
    },
    {
      "name": "Peloton stock",
      "weight": 0.12966582
    },
    {
      "name": "Peloton Interactive",
      "weight": 0.10375473
    },
    {
      "name": "Peloton Interactive ›",
      "weight": 0.100429915
    },
    {
      "name": "stocks",
      "weight": 0.09832327
    },
    {
      "name": "Peloton",
      "weight": 0.096163474
    },
    {
      "name": "new coverage",
      "weight": 0.08421412
    },
    {
      "name": "year",
      "weight": 0.08117786
    },
    {
      "name": "years",
      "weight": 0.08117786
    },
    {
      "name": "bullish coverage",
      "weight": 0.06882985
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Fitness"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9716796875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.970703125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.958984375
    }
  ],
  "sentiment": {
    "positive": 0.796875,
    "negative": 0.12756348,
    "neutral": 0.0758667
  },
  "summary": "Peloton (NASDAQ: PTON) stock closed out Friday's trading session with significant gains, with the company's share price gaining 10.3% and up 11.5% following Goldman Sachs's new coverage of Peloton. The firm increased its rating on Peloton from neutral to buy and increased its one-year price target on the stock from $7 per share to $11.50 per share. Despite this significant gain, Goldman's new price target suggests additional upside of roughly 47%. Peloton's margins have improved significantly due to cost-cutting moves and the company is making moves to stabilize sales. The company recently published results for the fourth quarter of its last fiscal year, showing an unexpected profit in the period. Management anticipates that the business's sales decline will slow in the current fiscal year.",
  "shortSummary": "Peloton stock surged 10.3% after Goldman Sachs upgraded its buyout rating to reflect better-than-expected quarterly results, with potential for further gains.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "0399bf4dddf045eaaa958eb9fd374d8c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/terms/p/price-target/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=12cd1458-5447-46b9-8125-92a471207047",
      "text": "If you're trying to figure out if a particular stock is worth buying, you might consider using the price target as a metric. It isn't a very precise method of evaluating stock values, but it can help you see how other analysts feel about the future of your favorite companies.\nDefinition\nWhat is a price target?\nA price target represents an analyst's estimate of the future price of a stock or other security. For stock analysts, the timeline is generally 12 to 18 months, but technical traders also use price targets.\nFor stock analysts, the purpose is to help advise investors as to where their stocks might be headed and to highlight stocks that could be very good values (or very bad ones) in the future. These analysts often work for large firms that may also give buying guidance.\nTechnical traders, on the other hand, may calculate price targets for any reason. Many times, they calculate price targets for buying and for selling, configuring their trading bots to buy at certain points and sell at others based on short-term pricing models that could be measured in as little as hours or days.\nWhat they tell you\nWhat do price targets tell you?\nPrice targets, like weather forecasts, are influenced by a lot of factors outside of anyone's control. So, if you're worried that a price target for a favored stock is lower than you expect, you may really be stressed for no reason.\nPrice targets are an attempt to predict future prices based on current information. That information is often incomplete since companies tend to keep anything they're not required to disclose close to their chests until it's time to show investors how well they're doing. And rightfully so -- the daily drama of the balance sheets might get to be too much if we had to hear about it more than once every few months.\nUltimately, the goal of price targets is to predict the future, but it's often through a foggy crystal ball. A 2006 study showed that share prices met or exceeded the price target at some point over the following year for just 53% of observations and only met or exceeded the price target in 30% of cases at the end of those same 12 months.\nHow to calculate\nHow do you calculate price targets?\nThere are many different ways to calculate a price target, but a common method involves using price-to-earnings ratios. If you divide the current P/E by the forward P/E and then multiply by the current price, you should have a reasonable prediction for the price target a year from now.\nThe current P/E gives you the earnings for the last 12 months as a ratio of the current market price to the average earnings of the prior 12 months. The forward P/E does the same but is calculated by dividing the market price by the average estimated earnings for the next 12 months. Using both balances the equation so that it's (theoretically) not relying too much on either ratio (although the forward P/E is calculated based on past performance to some extent).\nThe formula looks like this:\nCurrent Market Price x (Current P/E / Forward P/E) = Price Target\nRemember that this is only an estimate, and there are a lot of other factors that should be taken into consideration when you're trying to decide whether to buy, sell, or continue to hold any financial instrument in your portfolio.\nRelated investing topics\nWhy they matter\nWhy are price targets important to investors?\nNeither investors nor analysts are always at the forefront of everything all the time. That's why there are thousands of analysts who crunch piles of data to create price targets for companies. Even though price targets aren't always accurate, that doesn't mean they have zero value.\nA price target is good for telling you where analysts think that companies' stocks are going to be in a year or so. You'll always see a range of prices from them since analysts are hardly a hive mind. That should give you some idea of how to plan for the future, assuming nothing serious changes between now and the point where you plan to rebalance.\nIt's just one of many metrics you should be watching as a DIY investor, and if you have the time, calculating for yourself, if only to better understand how it really works."
    }
  ],
  "argos_summary": "Goldman Sachs upgraded Peloton's stock rating from neutral to buy and raised its one-year price target from $7 to $11.50 following the company's better-than-expected quarterly results. Peloton reported a profit of $0.05 per share, attributed to improved margins from cost-cutting measures, despite a 6% decline in sales year-over-year. The positive analyst coverage contributed to a 10.3% increase in Peloton's stock price, indicating potential for further growth.",
  "argos_id": "VIJQ0B395"
}