{
  "url": "https://www.foxnews.com/politics/doj-opens-grand-jury-investigation-letitia-james-tied-trump-civil-case",
  "authorsByline": "Jake Gibson, Ashley Oliver, David Spunt",
  "articleId": "774bb92535374674bcd6271d7d6c4e04",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/05/letitia-james-donald-trump.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T10:44:50-04:00",
  "addDate": "2025-08-08T14:51:28.931967+00:00",
  "refreshDate": "2025-08-08T14:51:28.931970+00:00",
  "score": 1.0,
  "title": "DOJ opens grand jury investigation into Letitia James tied to Trump civil case",
  "description": "The DOJ opened a grand jury investigation in New York into state Attorney General Letitia James tied to her lawsuit against President Donald Trump.",
  "content": "The Department of Justice convened a grand jury to investigate New York Attorney General Letitia James, marking an escalation in President Donald Trump's fight with New York's top prosecutor.\n\nThe investigation is being run out of Albany, New York, and focused on possible deprivation of rights allegations, two well-placed sources familiar with the probe told Fox News Digital.\n\nThe investigation is in an early stage, but Fox News Digital has learned that James's office received subpoenas for documents this week, including for information related to her civil fraud lawsuit against Trump.\n\nJames, a Democrat who was elected attorney general in 2018, has long been a target of Trump. James successfully brought civil charges against him for business fraud in 2022 and has had an instrumental role in challenging his current administration's executive actions in court.\n\nJames's office did not respond to requests for comment about the investigation.\n\nNY AG'S OFFICE HIRES ATTORNEY THAT REPPED HUNTER BIDEN TO DEFEND LETITIA JAMES AGAINST FRAUD ACCUSATIONS\n\nJames began investigating the Trump Organization soon after she took office, eventually securing a $454 million judgment against the then-former president and some of Trump's company's executives, including two of his sons.\n\nA New York judge found Trump and his business partners grossly overstated Trump's wealth to obtain favorable loans and other financial benefits. James said at the time that financial fraud was not a \"victimless crime.\"\n\n\"If average New Yorkers went into a bank and submitted false documents, the government would throw the book at them, and the same should be true for former presidents,\" James said.\n\n‘DANGEROUS AND ILLEGAL’: DEMOCRAT AGS SUE TRUMP OVER EFFORT TO USE SNAP TO LOCATE MIGRANTS\n\nJames also has been a leading figure in bringing litigation challenging the second Trump administration's executive actions. James and other Democratic attorneys general have sued to fight spending freezes on federally funded social programs, mass firings of federal employees and restrictions on transgender care for minors, among other matters.\n\nNews of a grand jury investigation comes as tensions have continued to build between Trump and James.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nIn April, the Trump Federal Housing Finance Agency asked Attorney General Pam Bondi to investigate James over mortgage fraud, and the DOJ opened a separate investigation into that matter. James received grand jury subpoenas in the inquiry, the Washington Post reported.\n\nAt the same time, Trump called her a \"wacky crook\" on Truth Social.\n\n\"Letitia James, a totally corrupt politician, should resign from her position as New York State Attorney General, IMMEDIATELY,\" Trump wrote.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/category/politics/justice-department",
    "https://www.foxnews.com/category/us/us-regions/northeast/new-york",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/politics/department-justice-opens-criminal-investigation-ny-ag-letitia-james",
    "https://www.foxnews.com/video/6349665329112",
    "https://www.foxnews.com/politics/dangerous-illegal-democrat-ags-sue-trump-over-effort-use-snap-locate-migrants",
    "https://www.foxnews.com/politics/ny-ags-office-hires-attorney-repped-hunter-biden-defend-letitia-james-against-fraud-accusations"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "New York Attorney General Letitia James",
      "weight": 0.10931163
    },
    {
      "name": "Letitia James",
      "weight": 0.099245235
    },
    {
      "name": "Trump",
      "weight": 0.09499493
    },
    {
      "name": "James",
      "weight": 0.094650485
    },
    {
      "name": "Donald Trump",
      "weight": 0.09443991
    },
    {
      "name": "Trump civil case",
      "weight": 0.09386414
    },
    {
      "name": "New York State Attorney General",
      "weight": 0.08900518
    },
    {
      "name": "grand jury investigation",
      "weight": 0.087135226
    },
    {
      "name": "New York",
      "weight": 0.08634678
    },
    {
      "name": "New York State",
      "weight": 0.08366036
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9912109375
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.94384765625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.91748046875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.90283203125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.89892578125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.65625
    },
    {
      "name": "/News/Gossip & Tabloid News/Scandals & Investigations",
      "score": 0.458740234375
    }
  ],
  "sentiment": {
    "positive": 0.049987793,
    "negative": 0.76708984,
    "neutral": 0.18322754
  },
  "summary": "The Department of Justice (DOJ) has initiated a grand jury investigation into New York Attorney General Letitia James, marking an escalation in President Donald Trump's feud with James. The investigation is being run out of Albany, New York, and focuses on possible deprivation of rights allegations. James, a Democrat who was elected as attorney general in 2018, has been a target of Trump and has successfully brought civil charges against him for business fraud and has been instrumental in challenging his administration's executive actions in court. The probe is in an early stage, but James's office has received subpoenas for documents related to her civil fraud lawsuit against Trump.",
  "shortSummary": "The Department of Justice has launched a grand jury investigation into New York Attorney General Letitia James, linked to her civil fraud lawsuit against President Donald Trump.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "96f3ab5a561c430fb3e50e3a1ce2fd79",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/politics/ny-ags-office-hires-attorney-repped-hunter-biden-defend-letitia-james-against-fraud-accusations",
      "text": "The New York Attorney General's Office has hired high-powered attorney Abbe Lowell to defend Attorney General Letitia James against fraud accusations being levied against her.\nThe office confirmed it hired Lowell, who has represented high-profile political figures on both sides of the aisle, including Hunter Biden, Jared Kushner, Ivanka Trump, former Sen. Bob Mendez and Bill Clinton.\nIt is unclear whether taxpayer dollars are going towards James' defense, as the attorney general's office stopped answering questions once Fox News Digital began asking about how Lowell would be compensated.\nLowell will represent James as a private citizen, not as part of Winston & Strawn LLP, where he had been a partner. A spokesperson for Winston & Strawn said Lowell \"left to form his own firm, allowing him to better balance his legal work, teaching, writing and charitable work\" but would not say when Lowell and the firm parted ways.\nHUNTER BIDEN HIRES ALEX MURDAUGH'S LAWYER IN LATEST COURT CASE; ABBE LOWELL OUT\nU.S. Federal Housing Director William Pulte is requesting the Department of Justice investigate James and consider prosecuting her for allegedly falsifying bank documents and records in order to garner more favorable loans. Lowell, who hung up on Fox News Digital when reached by phone, sent a letter to the DOJ Thursday urging them to reject Pulte's request for prosecution.\nLocal reporting from the Times Union said the attorney general's office indicated the decision to hire Lowell to defend James was, in part, based on their allegation that the Trump administration is pushing a politically motivated criminal referral in response to James bringing a civil case against Donald Trump last year for allegedly inflating asset values to obtain favorable loans.\nLowell, in his letter to the DOJ that was directed to U.S. Attorney General Pam Bondi, referred to Pulte's criminal referral as \"the latest act of improper political retribution\" from Trump.\nNEW YORK ATTORNEY GENERAL CLAIMS DOJ'S MORTGAGE FRAUD ACCUSATIONS ARE ‘BASELESS’\n\"The stunning hypocrisy of President Trump’s complaint that the Justice Department had been ‘politicized’ and ‘weaponized’ against him is laid bare as he and others in his administration are now asking you to undertake the very same practice,\" Mr. Lowell wrote.\nIn his letter, Lowell points to instances where Trump has called for revenge, and instances where the president has personally attacked James.\nLowell also went after the allegations, including that James listed a home in Virginia as her primary residence while serving as a state official in New York. According to Lowell, James had no intention of using the property as a primary residence and her indication of this in a power-of-attorney letter was a mistake. Lowell pointed out there were other documents where James indicated to her lender that the Virginia home would not be her primary residence.\nCLICK HERE TO GET THE FOX NEWS APP\nA second accusation of fraud against James accuses her of inflating the number of livable units in a multifamily Brooklyn residence to receive better interest rates. Lowell accuses Pulte of disregarding updated documentation listing the residence as a four-unit multifamily residence, and instead pointing to a certificate of occupancy from 2001."
    },
    {
      "url": "https://www.foxnews.com/politics/dangerous-illegal-democrat-ags-sue-trump-over-effort-use-snap-locate-migrants",
      "text": "New York Attorney General Letitia James on Monday said she is helping lead a group of 20 Democratic attorneys general in suing the Trump administration over its demands that they turn over information about food stamp recipients and applicants in their state—an effort she excoriated as a \"dangerous and illegal overreach\" by the administration to unlawfully locate and track down illegal immigrants.\nThe lawsuit, led by James, California Attorney General Rob Bonta, and Michigan Attorney General Dana Nessel, comes after the Trump administration demanded states turn over detailed personal information related to recipients and applicants of the Supplemental Nutrition Assistance Program, or SNAP, before July 30.\nThe Trump administration has threatened to withhold SNAP funding from states who fail to comply with the July 30 deadline—teeing up a high-stakes, eleventh-hour court clash between Trump officials and leaders from 20 Democratic-led states.\nSpeaking to reporters on a press call Monday, James and other attorneys general took umbrage with the new SNAP data-sharing requirement, describing it as an \"illegal data grab\" designed to intimidate vulnerable communities and help track down migrants who might be subject to deportation.\n\"This administration is attempting to use this program as a tool in their cruel and chaotic targeting of immigrants,\" James said.\nTRUMP FOE LETITIA JAMES LEADING CHARGE ON NEW MULTISTATE LAWSUIT OVER HHS CUTS\nThe lawsuit is not the first time James, a longtime Trump foe, has sparred with Trump in court since the start of his second presidential term.\nTo date, she's joined Democratic attorneys general in more than a dozen other lawsuits challenging his early actions.\nBonta, for his part, described the USDA's new demands as a cruel bait-and-switch from the Trump administration.\nHe noted that the data the administration is allegedly attempting to mine comes from a decades-old aid program designed to help ensure that low-income families have access to food.\n\"SNAP recipients provided this information to get help to feed their families—not to be entered into a government surveillance database, or be used as targets for the president's inhumane immigration agenda,\" Bonta said on Tuesday.\n\"This kind of targeting doesn't make America safer. It threatens kids' access to school meals, it jeopardizes wildfire survivors' access to relief,\" he added.\n\"And it sends a chilling message: if you reach out for help, you may be punished for it.\"\n100 DAYS OF INJUNCTIONS, TRIALS AND 'TEFLON DON': TRUMP SECOND TERM MEETS ITS BIGGEST TESTS IN COURT\nThe trio also rejected the assertion that USDA's request for the additional SNAP data, first announced in March, was made under the guise of helping eliminate \"waste and fraud\" within the federal government—noting that the SNAP program historically has \"very low rates of fraud.\"\nRather, the Democratic attorneys general described the demand for information as a \"flat-out illegal\" attempt by the Trump administration to unlawfully obtain personal information about immigrants living in their states.\nThey noted that, in addition to threatening to withhold SNAP funds, Trump officials have expanded the amount of data that states are required to submit about the individuals in the program.\nThe new USDA demands, released last week, require states to provide a list of individuals who have applied or are currently receiving SNAP benefits, in addition to other information such as a list of their immigration statuses in the U.S., and information including their marital statuses, their residential and mailing addresses, and education and employment history, among other things.\nEach of the attorneys general said Monday that the program would require them to share the personal information of millions of residents in their states, dating back to 2020, and bypassing federal laws that dictate how such information can be used.\n\"This is not for research,\" James said. \"They are basically trying to weaponize the SNAP program against immigrant communities, in violation of the law.\"\nCalifornia Attorney General Rob Bonta, for his part, described the push by the administration as an attempt to \"hunt down\" and obtain personal information for millions of residents in their states.\n\"They're bypassing legal procedures, ignoring privacy protections, and demanding data that federal law explicitly says can only be used for administering the SNAP program,\" Bonta said, noting that they \"ignored hundreds of public comments pointing out major flaws in the government's plans.\"\nFEDERAL JUDGES IN NEW YORK AND TEXAS BLOCK TRUMP DEPORTATIONS AFTER SCOTUS RULING\nThe lawsuit comes as James and other Democratic-led states have taken aim at Trump's sweeping policy goals and executive orders in court, which they describe as excessive and unconstitutional.\nSince his inauguration in January, Bonta noted, Democrat-led states have filed 35 lawsuits against the Trump administration.\nBonta said Monday that the USDA requirement is a \"clear violation\" of the \"Spending Clause, federal privacy statutes, and the USDA's own authority,\" prompting them to file suit.\nCLICK HERE TO GET THE FOX NEWS APP\n\"President Trump made promises to the American people and now he's breaking them,\" the group said Monday.\n\"He's rewriting the rules, targeting the most vulnerable and expecting states to fall in line.\""
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/category/us/us-regions/northeast/new-york",
      "text": "VIDEO 31 mins ago Newt Gingrich: Democrats are either 'rabid socialists' or 'totally negative' Former House Speaker Newt Gingrich analyzes how Democrats are 'going off the deep end' as so-called defenders of democracy on 'The Ingraham Angle.'\nVIDEO 50 mins ago NYC mayoral candidates trade barbs as Trump reportedly weighs involvement Fox News' national correspondent Bryan Llenas reports on the latest on the New York mayoral race and President Donald Trump reportedly mulling involvement.\nVIDEO 3 hours ago Mamdani's 'policies would take New York in the wrong direction,' says Lara Trump Fox News host Lara Trump weighs in on whether or not President Donald Trump will endorse any of the mayoral candidates for New York City on 'The Story.'\nTrue Crime 3 hours ago Glam Hamptons shaken as bikini mogul dies on boat in latest Montauk mystery Violent crimes have occasionally shattered the tranquil Hamptons and Montauk, from Ted Ammon's 2001 murder to recent mysterious deaths at luxury marinas.\nNew York 3 hours ago Cops sweep yacht after Irish bikini mogul dies in glamorous Hamptons harbor The family of Martha Nolan-O'Slatarra expressed shock after the bikini designer was found dead on a Montauk yacht that crime investigators were examining.\nNew York 5 hours ago Anti-Israel activist confronts former IDF soldier on New York beach, gets questioned in return Viral video shows anti-Israel activist shouting at former Israeli soldier and friends on New York beach while they respond with composure and respect\nImmigration 7 hours ago Lawmakers under fire for sharing ICE raid info, warning locals of immigration enforcement operations Democratic lawmakers including Alexandria Ocasio-Cortez face criticism for advising constituents on avoiding ICE operations as Trump administration ramps up immigration enforcement\nMedia 16 hours ago Sen. Slotkin says Dem Socialist NYC candidate Mamdani represents 'new generation' of leaders young voters want Michigan Sen. Elissa Slotkin explained how cost of living issues and the desire for younger leadership drove Mamdani's surprising New York primary election victory.\nVIDEO 23 hours ago Sean Hannity: 'Marxist' Mamdani is the 'heart and soul' of the Democratic Party Fox News host Sean Hannity sounds the alarm on Democrats' 'extremism' using their own words on 'Hannity.'\nHomicide 1 day ago Irish beauty who sold bikinis found dead on boat at yacht club, no foul play suspected Fashion entrepreneur Martha Nolan-O'Slatarra found dead on boat at Montauk Yacht Club as Suffolk County homicide detectives investigate the mysterious death.\nVIDEO 1 day ago Retired NYPD official reveals what 'says a lot' about Georgia's Fort Stewart military base Retired NYPD lieutenant Joe Cardinale commends the response of Fort Stewart's officials to an active shooter incident on 'America Reports.'\nImmigration 1 day ago Democrats attempting to visit Brooklyn ICE facility reportedly ‘trapped’ after being rebuffed by agents Reps. Espaillat, Velazquez and Goldman were refused access to Brooklyn MDC facility in the latest incident of lawmakers being rebuffed at federal detention centers\nCrime 1 day ago NYC gunman Shane Tamura seen angering police officers in bodycam video during 2023 arrest Las Vegas police release bodycam footage and 911 calls from Manhattan mass shooter Shane Tamura showing mental health episodes and arrests before the deadly shooting\nNew York 2 days ago Exclusive waterfront enclave rocked after body found near yacht club Woman found dead on boat docked at Montauk Yacht Club on Long Island in New York as Suffolk County police homicide detectives investigate the incident.\nLuigi Mangione 2 days ago Federal judge grants Mangione access to laptop in jail ahead of murder trial Luigi Mangione has received court-approved laptop access at a Brooklyn detention center to prepare his defense in the UnitedHealthcare CEO Brian Thompson murder case.\nVIDEO 3 days ago The Democratic Party will not come to grips with the fact that their policies are rejected by many Americans, says WSJ columnist Former Clinton advisor and pollster Mark Penn and WSJ opinion columnist Kim Strassel discuss the state of the Democratic Party and Zohran Mamdani's mayoral candidacy on 'The Story.'\nZohran Mamdani 3 days ago Mamdani studies 'America's Worst Mayor' Brandon Johnson to avoid his political pitfalls: report Democratic socialist Zohran Mamdani hopes to emulate Boston's Michelle Wu rather than Chicago's struggling Brandon Johnson in his New York mayoral campaign.\nTexas 3 days ago Hochul vows to 'fight fire with fire' on redistricting while hosting Texas Democrats who fled state Texas Democrats arrived in New York and Chicago on Monday to prevent a redistricting vote while Gov. Kathy Hochul promises to pursue similar tactics.\nVIDEO 3 days ago Hochul vows redistricting in New York as she condemns 'insurrection' in Texas New York Gov. Kathy Hochul vowed to “fight fire with fire” amid Republican efforts to enact redistricting in Texas on Monday, condemning the move as a “legal insurrection” even while promising to pursue it herself.\nNew York City 3 days ago NFL employee shot in lobby by gunman warned colleagues upstairs before calling 911 Four victims died in a Midtown Manhattan office shooting as an NFL employee called colleagues to warn about the gunman targeting the Blackstone building.\nBill Maher 5 days ago Bill Maher on possibility of Mamdani as New York City mayor: 'We’ve never had someone this radical' Comedian Bill Maher defends criticism of New York mayoral candidate Zohran Mamdani's \"Marxist\" views during debate with Democratic congressman on \"Real Time.\"\nNew York City 6 days ago NYC shooting victim's daughter delivers tearful eulogy at funeral: 'Never imagined this happening' Family and friends gathered at Central Synagogue to mourn Wesley LePatner, one of four victims killed in Manhattan office building shooting this week.\nNew York 6 days ago Anti-Israel protesters arrested after storming Schumer, Gillibrand's NYC office building NYPD arrested Anti-Israel protesters on Friday after they stormed the lobby of senators Chuck Schumer and Kirsten Gillibrand's New York City offices.\nCrime 6 days ago Alleged bitcoin torturer walks free on $1M bond after two-month Rikers Island detention Bitcoin torture suspect John Woeltz was freed on $1 million bond after two months in custody for allegedly kidnapping and torturing an Italian crypto trader.\nVIDEO July 31 Chicago Mayor Brandon Johnson is 'in over his head' running the city, former governor lodges Former Illinois Gov. Rod Blagojevich rails against Chicago Mayor Brandon Johnson for refusing to work with I.C.E. on 'The Ingraham Angle.'\nNew York July 31 Viral video shows allegedly drunk man take airport golf cart on walkway joy ride Kevin Sinning faces multiple charges including grand larceny after viral video shows him driving stolen cart on airport moving walkway in Buffalo.\nVIDEO July 31 Zohran Mamdani is changing his mind on ‘fundamental,’ ‘pivotal’ things: Jesse Watters ‘The Five’ discusses Democratic socialist candidate Zohran Mamdani walking back a past call to ‘defund’ the police.\nVIDEO July 31 Mamdani tries to walk back his prior calls to defund the NYPD after recent NYC shooter attack Fox News national correspondent Bryan Llenas reports on NYC mayoral candidate Zohran Mamdani's public attempt to explain his past social media posts calling for the NYPD to be defunded on 'America's Newsroom.'\nPolice and Law Enforcement July 31 NYPD officers line streets to honor colleague killed in Park Ave shooting New York police honor fallen officer Didarul Islam with funeral services after he was killed by a gunman in a Midtown office building on Monday evening.\nVIDEO July 30 Zohran Mamdani facing his 'first test' after NYC shooting Fox News national correspondent Bryan Llenas reports on the scrutiny Zohran Mamdani is facing after the mass shooting incident in Midtown Manhattan on 'America's Newsroom.'"
    },
    {
      "url": "https://www.foxnews.com/politics/department-justice-opens-criminal-investigation-ny-ag-letitia-james",
      "text": "The Department of Justice has opened a criminal investigation into New York Attorney General Letitia James, Fox News has learned.\nSeparately, the Washington Post reported that a grand jury in the Eastern District of Virginia sent out subpoenas related to accusations that James misrepresented a single-family home in Virginia as her primary residence to obtain more favorable loan terms.\nThe DOJ and FBI declined to comment on the matter.\nNews of the federal probe follows a criminal referral from the Trump administration's Federal Housing Finance Agency Director William Pulte, who requested the DOJ investigate James over that matter and another incident in which she allegedly misrepresented the number of livable units in a multifamily Brooklyn house to once again obtain better loan terms.\nTAXPAYERS COULD BE FORCED TO FUND TRUMP FOE LETITIA JAMES' LEGAL DEFENSE IF DEM BUDGET ITEM PASSES\n\"These baseless and long-discredited allegations, put to rest by my April 24 letter to the Department of Justice, are suddenly back in the news just days after President Trump publicly attacked Attorney General James,\" James' attorney, Abbe Lowell, said Thursday.\n\"This appears to be the political retribution President Trump threatened to exact that AG Bondi assured the Senate would not occur on her watch. If prosecutors are genuinely interested in the truth, we are prepared to meet false claims with facts.\"\nAfter Pulte's criminal referral was sent to the Justice Department, specifically U.S. Attorney General Pam Bondi, Lowell followed up with his own letter to Bondi and the Justice Department, accusing the president of seeking \"political retribution.\"\nJames has been part of a group of Democratic attorneys general who have sued to halt many of Trump's orders during his first few months in the Oval Office.\nAdditionally, James was the lead prosecutor in a case she brought against Trump and the Trump Organization that alleged the president, while he was a candidate, falsified business records to obtain more favorable loan terms. He was ultimately ordered by a judge to pay hundreds of millions, but is still appealing the ruling.\n\"The stunning hypocrisy of President Trump’s complaint that the Justice Department had been ‘politicized’ and ‘weaponized’ against him is laid bare as he and others in his administration are now asking you to undertake the very same practice,\" Lowell wrote in his letter to Bondi.\nLowell, in his letter, pointed to instances when Trump has called for revenge and instances when the president has personally attacked James.\nLowell also responded to the allegations, including the claim James listed a home in Virginia as her primary residence while serving as a state official in New York. According to Lowell, James had no intention of using the property as a primary residence, and her indication of this in a power-of-attorney letter was a mistake. Lowell pointed out there were other documents in which James indicated to her lender that the Virginia home would not be her primary residence.\nCLICK HERE TO GET THE FOX NEWS APP\nJames is also accused of fraud for allegedly misrepresenting the number of livable units in a multifamily Brooklyn home to receive better interest rates. Lowell accuses Pulte of disregarding updated documentation listing the residence as a four-unit multifamily residence and instead pointing to a certificate of occupancy from 2001.\nEDITOR'S NOTE: This story was updated to clarify that The Washington Post reported the issuing of subpoenas by the Eastern District of Virginia.\nFox News' David Spunt contributed to this report."
    }
  ],
  "argos_summary": "The Department of Justice has initiated a grand jury investigation into New York Attorney General Letitia James, focusing on allegations of misrepresentation related to her primary residence and the number of livable units in a Brooklyn property for loan benefits. This investigation follows a criminal referral from the Trump administration's Federal Housing Finance Agency, which accused James of fraud. James's attorney, Abbe Lowell, has characterized the allegations as politically motivated retribution from Trump, who has long been a target of James's legal actions.",
  "argos_id": "VQITZTSPP"
}