{
  "url": "https://nypost.com/2025/08/08/real-estate/foreign-investor-has-spent-65m-for-destroyed-malibu-properties/",
  "authorsByline": "Mary K. Jacob",
  "articleId": "fb22db989ce649c58e7df7e940712ac5",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-rm5y4k5z9-1754670521857.jpg?quality=75&strip=all&1754656151&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T17:08:33+00:00",
  "addDate": "2025-08-08T17:11:34.438370+00:00",
  "refreshDate": "2025-08-08T17:11:34.438372+00:00",
  "score": 1.0,
  "title": "A foreign investor has quietly spent $65M for Malibu real estate charred by January’s wildfires",
  "description": "In the destroyed aftermath of Malibu’s January wildfires, one buyer has moved in silence — betting that wealthy buyers will one day return.",
  "content": "In the charred aftermath of Malibu’s January wildfires, one buyer has been moving in silence.\n\nWhile much of La Costa Beach remains a barren stretch of sand, a foreign investor has quietly acquired nine oceanfront lots — spending more than $65 million to secure some of the most coveted parcels along the Pacific Coast Highway, according to Realtor.com.\n\nWorking through luxury agents Weston Littlefield and Alex Howe of the Weston James Group, the buyer is targeting properties with at least 40 feet of frontage, betting that once the coastline is rebuilt, demand from wealthy buyers will return in force.\n\n“He started building a team on his end of expediters, architects and kind of figured out what the best size lots and frontage would be to build on to eventually resell,” Littlefield told Realtor.com.\n\nMany of the most desirable sites weren’t listed publicly, forcing the team to track down owners.\n\n“I’d say probably about 50% had sentimental value to their properties just based on memories, or their parents passed it down to them,” he said. “But a lot of them, ultimately, just didn’t want to go through the rebuilding process because of how long they knew it was going to take to really come back.”\n\nThe scale of destruction was severe: The fire razed 720 structures in Malibu, burning miles of beachfront homes to their foundations.\n\n“Malibu was such a charming beach town, and all the homes that were on La Costa Beach had so much character… and for it all to just be gone and wiped out, down to the sand, is heartbreaking,” Littlefield said.\n\nRebuilding is a long and costly process. The city estimates permit approvals can take 12 to 24 months, and coastal construction carries steeper requirements than inland projects.\n\nFees start at $11,579 for planning alone, before additional costs for site reviews or variances. Homes must generally match the original footprint, though up to 10% more square footage is allowed.\n\nDevelopers must also meet FEMA floodplain standards, replace noncompliant seawalls and install Advanced Onsite Wastewater Treatment Systems instead of septic tanks.\n\nTimber piles are banned, and narrow La Costa Beach parcels are subject to strict view protections. The city has set up a Malibu Rebuild Center to help owners navigate the process, both online and in person.\n\nFor Littlefield, the investment is a calculated bet with a long horizon.\n\n“Once this beach is built back and it’s all brand-new construction, I think it’s going to be a very desirable spot for a lot of wealthy people to try to buy a beach house,” he said.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/07/real-estate/are-taylor-swift-and-travis-kelce-house-hunting-in-ohio/",
    "https://www.realtor.com/news/trends/malibu-california-mystery-buyer-burned-lots/",
    "https://nypost.com/2025/08/08/real-estate/styxs-chuck-panozzo-asks-1-75m-for-his-florida-home/",
    "https://nypost.com/2025/08/07/real-estate/megan-ellison-asks-3-65m-for-her-domed-nyc-penthouse/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "narrow La Costa Beach parcels",
      "weight": 0.082749926
    },
    {
      "name": "La Costa Beach",
      "weight": 0.08032969
    },
    {
      "name": "Malibu real estate",
      "weight": 0.07131868
    },
    {
      "name": "wealthy buyers",
      "weight": 0.06936543
    },
    {
      "name": "Weston Littlefield",
      "weight": 0.06840405
    },
    {
      "name": "Malibu",
      "weight": 0.06632294
    },
    {
      "name": "Advanced Onsite Wastewater Treatment Systems",
      "weight": 0.06607944
    },
    {
      "name": "FEMA floodplain standards",
      "weight": 0.059377253
    },
    {
      "name": "coastal construction",
      "weight": 0.05784072
    },
    {
      "name": "Littlefield",
      "weight": 0.057621706
    }
  ],
  "topics": [
    {
      "name": "Real Estate"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Real Estate/Other",
      "score": 0.90283203125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.88818359375
    },
    {
      "name": "/News/Local News",
      "score": 0.8603515625
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.66064453125
    },
    {
      "name": "/Real Estate/Property Development",
      "score": 0.406982421875
    },
    {
      "name": "/Real Estate/Real Estate Listings/Residential Sales",
      "score": 0.36328125
    }
  ],
  "sentiment": {
    "positive": 0.09173584,
    "negative": 0.50683594,
    "neutral": 0.40185547
  },
  "summary": "A foreign investor has quietly acquired nine oceanfront lots in Malibu, spending over $65 million on some of the most coveted parcels along the Pacific Coast Highway. The buyer, who worked with luxury agents Weston Littlefield and Alex Howe, targeted properties with at least 40 feet of frontage and hopes that once the coastline is rebuilt, wealthy buyers will return. The most desirable sites were not listed publicly, forcing the team to track down owners. The investment is seen as a calculated bet with a long-term outlook for wealthy buyers once the beach is built back. The cost of reconstruction can start at $11,579 for planning alone, with additional costs for site reviews or variances.",
  "shortSummary": "A foreign investor has quietly acquired nine La Costa Beach lots for $65 million, betting that once the coastline is rebuilt, following the January wildfires.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3640b47313004b1ebb773350b71d1645",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/08/real-estate/styxs-chuck-panozzo-asks-1-75m-for-his-florida-home/",
      "text": "Come “sell” away with Styx co-founder and bassist Charles “Chuck” Panozzo, 76, who is listing his magical oasis near Fort Lauderdale, Florida for $1.75 million.\nThe mid-century sanctuary — think Southeast Asia meets South Florida — is at 2020 NE 3rd Terrace in Wilton Manors, which is a suburb of Fort Lauderdale and known as a buzzy destination for the LGBT+ community. Panozzo, who is gay and has been open about living with HIV, bought the property for $305,000 in 2007.\nThe ’70s rock band, known for hit songs like “Come Sail Away” and “Renegade,” is currently on tour. Panozzo co-founded the band with his fraternal twin brother, drummer John Panozzo, who died in 1996, and singer/keyboardist Dennis DeYoung.\nThe two-bedroom, three-bath home was built in 1952 and sits on just under a quarter of an acre. At 1,608 square feet, it features two bedrooms, a home office/convertible bedroom — plus a landscaped garden and a pool. And as an added bonus, it comes furnished.\n“This house is special to me because of the magic it has,” Panozzo told Gimme Shelter by email.\n“When I open the door and cross the koi pond and look around, I know I am safe and at home. It was a blank canvas on the perfect lot in the neighborhood, so I sold my Miami condo and I moved here. Every area became an environment that you can explore depending on your mood — whether I need to relax, reflect or turn up the volume after touring,” he wrote.\nThe home, “by the energy of Wilton Drive,” was designed as a “personal sanctuary.”\nDesign details include wood finishes, and an indoor/outdoor flow.\nThe landscaped backyard also boasts fountains and coral-lined walkways, along with teak sculptures, bonsai and Ashoka trees, and animal-shaped hedges. Most of the sculptures and art are included in the sale, said listing brokers Juan Zapata and Susan Rindley of ONE Sotheby’s International Realty.\nPanozzo loves the property but, he told Gimme, it’s time for him to return to high-rise living.\n“I am moving because after living in high-rises in Chicago and Miami, I realize that it’s best for me to return to the sky,” Panozzo said.\n“I still actively tour with my band and while I have lived here for [more than] 15 years and made my home into my creative space, I am ready for a new challenge and a downtown balcony with a view.”\nPanozzo will be staying in Fort Lauderdale. He is planning to move to a new luxury building in the downtown area.\nFort Lauderdale, Panozzo said, “has this beautiful mix of natural beauty and cultural energy. There’s great food, a growing arts and tech scene, and a rhythm to the city that feels both grounded and forward-thinking.”\n“As someone who came up during a time when rock was pushing every boundary, I feel that same sense of possibility here now,” he added."
    },
    {
      "url": "https://nypost.com/2025/08/07/real-estate/megan-ellison-asks-3-65m-for-her-domed-nyc-penthouse/",
      "text": "Megan Ellison has re-listed her NYC home for $3.65M — a week after her father was named the world’s second richest person\nDialing New York City history lovers!\nOscar-nominated producer Megan Ellison, 39 — the heiress daughter of billionaire Larry Ellison, who in July was named the world’s second richest person by Bloomberg — has re-listed her domed pied-à-terre in the former radio room of New York City’s Police Building, Gimme Shelter has learned.\nThe striking-looking one-bedroom, one-bath aerie is asking $3.65 million — down slightly from its $3.7 million ask in 2023.\nEllison bought the 2,000-square-foot penthouse in her full name — Margaret Elizabeth Ellison — for $2.8 million in 2013, according to property records.\nA talented, risk-taking filmmaker, Ellison won four Oscar nominations — two in the same year — for producing hits including “Zero Dark Thirty” and “American Hustle.”\nLocated at 240 Centre St., the listing is in a Belle-Epoque building that dates to 1905. It was originally designed by Hoppin & Koen, and served as Manhattan’s police headquarters until 1973. It was converted to co-ops in 1988 by Ehrenkranz Group & Eckstut.\nIn the ’90s, the building was the “it” residence for top models including Cindy Crawford and Linda Evangelista — and it was also home to top fashion designer Calvin Klein.\nHer dwelling features ceilings that rise to 17 feet with skylight views of the building’s Baroque spire and motifs.\nA renovation by James Ramsey/RAAD Studio revealed the original ironwork and masonry that helps make the unit so visually stunning.\nDetails also include wide-plank oak floors, lacquer built-ins, large skylights, central air and heating — plus an oversize chef’s kitchen with two banquettes and a concrete island with bar seating for six.\nIn addition, there’s a sound system, a projector and a drop-down screen for films, while the spa-like bath has radiant-heat floors.\nThe listing broker is Nick Gavin, of Compass, who declined to comment."
    },
    {
      "url": "https://nypost.com/2025/08/07/real-estate/are-taylor-swift-and-travis-kelce-house-hunting-in-ohio/",
      "text": "Taylor Swift and Travis Kelce reportedly spotted house-hunting in Ohio — here are the ritziest areas even an A-lister could love\nLovebirds Taylor Swift and Travis Kelce have reportedly toured at least two homes in Cleveland’s Eastside suburbs in June.\nThe pop icon and football star were seen having lunch at a cute French bistro in Chagrin Falls, an idyllic village near Kelce’s hometown in Cleveland Heights.\nSources told The Post that local consensus puts the pair in Hunting Valley, Ohio for their house hunt. The village in the Chagrin River Valley is known for its palatial properties and a 5 acre minimum.\nWhile the median sale price in Cleveland is just $131,675, prices skyrocket in these outer suburbs. Trust funds and lacrosse scholarships abound in areas like historic Shaker Heights, bucolic Waite Hill, ritzy Hunting Valley and affluent Bratenahl — all of which potentially boast the perfect home for a post-NFL retirement and another feather in Swift’s $80 million real estate cap.\nFollow Taylor Swift live updates from Page Six for the latest news, photos, fan theories and more\nDavid Ayers of The Agency compared the idyllic Eastside villages under the couple’s potential consideration to the Hudson Valley in New York, for one sixteenth of the price.\n“It’s a very stealth wealth, old money, and it’s really an amazingly kept secret that no one knows about,” Ayers told The Post.\nHoward Hanna broker Adam Kaufman sells some of the area’s most expensive properties. Kaufman was skeptical of the pair’s prospective purchase, despite their dining adventure in Chagrin Falls.\n“I think that rumor got going, and it really just escalated,” Kaufman said.\nBut Cleveland and its suburbs would, hypothetically, have a lot to offer the jet-setting couple, he added. The city offers a thriving arts scene, with enviable theatrical and orchestral offerings.\n“It is an amazing place, and it’s really starting to get the recognition it deserves,” he said, pointing to a strong seller’s market in the area.\nBut should the pair consider an Ohio home, there are more than a few solid contenders.\nA stately manor in Hunting Valley\nThis sprawling estate in Hunting Valley comes with a private tennis court, a swimming pool and more than 7.5 acres of lush green land. Originally built in 1924, the $3.45 million property evokes “grandeur of a bygone era,” according to The Agency listing.\nA Hamptons-style estate in Chagrin Falls\nThe village of Chagrin Falls, the site of Swift and Kelce’s buzzy lunch date, hosts this custom-built “Hamptons style” home on 2 riverside acres. The $6.5 million Howard Hanna listing features tasteful interiors across a roomy 13,600 square feet, including a two-island kitchen, four bedroom suites, a wine cellar and a guest house.\nA modern mansion in Moreland Hills\nThis contemporary home located half an hour from Cleveland comes with 2.44 acres of land and more than 16,000 square feet of living space. The $6.25 million listing, held by The Agency, dubs the property a “contemporary masterpiece,” with open-concept living spaces, soaring ceilings and an impressive pool.\nA classic English tudor\nAnother possibility in Chagrin Falls comes with old English charm. The circa-1917 manor, listed by Howard Hanna for $3.39 million, comes with 24 acres of river frontage and a striking Tudor facade. The roughly 8,000-square-foot home features beamed vaulted ceilings, stately fireplaces and a billiards room.\nA Lake Eerie oasis\nThis Gilded Age “grande dame” for $5.99 million is filled with modern upgrades and old world craftsmanship. The 3.5-acre, eight-bedroom property on the coast of Lake Erie boasts intricately carved millwork, cut glass leaded windows and marble flooring throughout its grand public rooms. The luxe Bratenahl property, listed by The Agency, also comes with a restored guest cottage and a massive pool patio."
    }
  ],
  "argos_summary": "In the wake of Malibu's January wildfires, a foreign investor has quietly purchased nine oceanfront lots for over $65 million, anticipating a resurgence in demand for luxury properties once the coastline is rebuilt. The buyer, working with luxury agents, is focusing on lots with significant beachfront frontage, despite the lengthy and costly rebuilding process that follows the destruction of 720 structures in the area. Meanwhile, other notable real estate news includes Styx co-founder Charles Panozzo listing his Fort Lauderdale home for $1.75 million, and Megan Ellison re-listing her NYC penthouse for $3.65 million.",
  "argos_id": "VWPLA4UCM"
}