{
  "url": "https://9to5mac.com/2025/08/08/apples-chip-deal-with-samsung-is-great-news-for-future-iphones/",
  "authorsByline": "Ben Lovejoy",
  "articleId": "d2e150c9ca454afd9206e14b65bfe2dc",
  "source": {
    "domain": "9to5mac.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/08/Apples-chip-deal-with-Samsung-is-great-news-for-future-iPhones.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T16:00:00+00:00",
  "addDate": "2025-08-08T16:10:49.689042+00:00",
  "refreshDate": "2025-08-08T16:10:49.689045+00:00",
  "score": 1.0,
  "title": "Apple's chip deal with Samsung is great news for future iPhones",
  "description": "One of the bullet points in Apple’s announcement of its increased US manufacturing spend made a big, but very non-specific,...",
  "content": "One of the bullet points in Apple’s announcement of its increased US manufacturing spend made a big, but very non-specific, claim. Apple said that it was working with Samsung on an “innovative new technology which has never been used before anywhere in the world.”\n\nAlthough the company was being mysterious, we likely know what that means – and it’s great news not just for the iPhone 18, but also for future iPhones beyond it …\n\nThe full statement – all two sentences of it – was as vague as it was bold:\n\nApple is also working with Samsung at its fab in Austin, Texas, to launch an innovative new technology for making chips, which has never been used before anywhere in the world. By bringing this technology to the U.S. first, this facility will supply chips that optimize power and performance of Apple products, including iPhone devices shipped all over the world.\n\nA new camera sensor for the iPhone 18\n\nWhile Apple didn’t reveal anything more, analysts seem fairly confident that this refers to image sensors for iPhone 18 cameras.\n\nSpecifically, there have been multiple reports that Samsung is working on a triple-layer stacked image sensor for the iPhone 18.\n\nA stacked sensor is where the processing electronics are mounted to the back of the sensor in order to handle light capture and image processing on separate layers of the same chip. This results in a faster response time as well as higher image quality.\n\nCurrent sensors use dual-layer stacking, but the next stage in this evolution is triple layer sensors, as seen in the above slide from a Sony presentation.\n• Photodiode, to capture the light and convert it to an electrical signal\n\nThis would further enhance the benefits of a layered sensor with even faster performance and better processing for reduced noise. This is consistent with Apple’s description of chips that optimize both power and performance, and both Sony and Samsung are known to be developing this technology.\n\nA Financial Times report claims to confirm this is indeed the deal Apple references.\n\nGood news for the iPhone 18 and beyond\n\nIf the iPhone 18 is indeed confirmed to be getting a triple-layer sensor, that’s obviously good news for next year.\n\nBut the fact that Apple is turning to Samsung after many years of relying exclusively on Sony for its camera sensors is also excellent news for future iPhones. It means that the two companies which hold a joint lead in advanced sensor technology for smartphones will be competing head-to-head for Apple’s future business.\n\nBoth companies will be fully incentivized to innovate as rapidly as possible, seeking to outdo each other in terms of image quality and performance. Apple and iPhone owners will be the joint winners of this battle.",
  "medium": "Article",
  "links": [
    "https://9to5mac.com/guides/aapl/",
    "https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US&gl=US&ceid=US:en",
    "https://9to5mac.com/2025/08/06/apples-american-manufacturing-program-includes-a-new-chip-deal-with-samsung/",
    "https://9to5mac.com/2024/07/24/new-camera-sensor-iphone-18/",
    "https://www.ft.com/content/aff9b9ce-956d-4716-99da-8fc25f4b878b",
    "https://www.sony.com/en/SonyInfo/IR/library/presen/business_segment_meeting/pdf/2025/ISS_E.pdf",
    "https://9to5mac.com/2025/08/06/apple-launches-the-american-manufacturing-program-with-a-new-100b-commitment-to-the-us/",
    "https://koreajoongangdaily.joins.com/news/2025-08-07/business/industry/Samsung-to-produce-Apples-nextgeneration-chips-at-US-foundry/2370501",
    "https://9to5mac.com/2025/01/10/samsung-reportedly-working-on-a-3-layer-stacked-camera-sensor-for-iphone/",
    "https://9to5mac.com/guides/samsung/",
    "https://www.apple.com/newsroom/2025/08/apple-increases-us-commitment-to-600-billion-usd-announces-ambitious-program/"
  ],
  "labels": [
    {
      "name": "Paid News"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "triple layer sensors",
      "weight": 0.109774664
    },
    {
      "name": "image sensors",
      "weight": 0.10971731
    },
    {
      "name": "advanced sensor technology",
      "weight": 0.104031324
    },
    {
      "name": "Apple products",
      "weight": 0.09502457
    },
    {
      "name": "Apple",
      "weight": 0.09427997
    },
    {
      "name": "Current sensors",
      "weight": 0.09161076
    },
    {
      "name": "image processing",
      "weight": 0.08588822
    },
    {
      "name": "iPhone devices",
      "weight": 0.080829926
    },
    {
      "name": "iPhone",
      "weight": 0.07872152
    },
    {
      "name": "good news",
      "weight": 0.07679659
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.9716796875
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.76171875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.72314453125
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.53564453125
    }
  ],
  "sentiment": {
    "positive": 0.6513672,
    "negative": 0.054107666,
    "neutral": 0.2944336
  },
  "summary": "Apple's chip deal with Samsung is significant news for future iPhones and beyond. The company announced that it is working with Samsung on an innovative new technology for making chips, which has never been used before anywhere in the world. This technology will be brought to the US first, where it will enable chips that optimize power and performance of Apple products. While Apple did not specify what this means, analysts are confident that this refers to image sensors for iPhone 18 cameras. There have been multiple reports that Samsung is working on a triple-layer stacked image sensor for the iPhone 18. This move is good news for Apple after relying on Sony for its camera sensors for years. It means that both companies will be competing head-to-head in advanced sensor technology for smartphones.",
  "shortSummary": "Apple's recent announcement revealed a new chip technology collaboration with Samsung, enhancing performance and image quality for future iPhones like the iPhone 18.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "917a2ec601bd498ea4a55380750415ee",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://9to5mac.com/2024/07/24/new-camera-sensor-iphone-18/",
      "text": "A new report suggests that the iPhone 18 will be getting at least one new sensor, and that it will be made by Samsung rather than Sony.\nIf correct, it would represent an end to Sony’s exclusivity on the contract for iPhone sensors …\nMing-Chi Kuo’s report doesn’t offer much detail.\nSamsung is expected to begin shipping 1/2.6-inch 48MP ultra-wide CMOS image sensors (CIS) to Apple for iPhones as early as 2026, breaking Sony’s years-long monopoly on supplying CIS to Apple. To this end, Samsung has established a dedicated team to serve Apple.\nThere’s no word on the main and telephoto sensors, suggesting that these may continue to be made by Sony, and no indication on the reasons for the change.\nThe most mundane explanation would be that Apple likes to use multiple suppliers for components wherever possible, and that Samsung’s model is just a like-for-like replacement. This provides resilience against production issues, and also puts the company in a stronger negotiating position when it comes to pricing, playing off one supplier against another. This may just be a first step to splitting all camera orders between the two companies.\nBut the more exciting implication here is that Sony and Samsung won’t just be competing on price, but also on tech. It means both companies are incentivized to find ways to improve both performance and feature set.\nA report yesterday indicated that Apple is already planning a variable aperture lens for the iPhone 17, and likely has further improvements in mind. Having two companies competing for its camera business will almost certainly increase the pace of development here.\nImage: Apple\nFTC: We use income earning auto affiliate links. More.\nComments"
    },
    {
      "url": "https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US&gl=US&ceid=US:en",
      "text": "- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nBefore you continue to Google\nWe use cookies and data to\n- Deliver and maintain Google services\n- Track outages and protect against spam, fraud, and abuse\n- Measure audience engagement and site statistics to understand how our services are used and enhance the quality of those services\nIf you choose to “Accept all,” we will also use cookies and data to\n- Develop and improve new services\n- Deliver and measure the effectiveness of ads\n- Show personalized content, depending on your settings\n- Show personalized ads, depending on your settings\nIf you choose to “Reject all,” we will not use cookies for these additional purposes.\nNon-personalized content is influenced by things like the content you’re currently viewing, activity in your active Search session, and your location. Non-personalized ads are influenced by the content you’re currently viewing and your general location. Personalized content and ads can also include more relevant results, recommendations, and tailored ads based on past activity from this browser, like previous Google searches. We also use cookies and data to tailor the experience to be age-appropriate, if relevant.\nSelect “More options” to see additional information, including details about managing your privacy settings. You can also visit g.co/privacytools at any time."
    },
    {
      "url": "https://9to5mac.com/guides/aapl/",
      "text": "AAPL Company\nBreaking news from Cupertino. We’ll give you the latest from Apple headquarters and decipher fact from fiction from the rumor mill.\nAAPL is a California-based computer company that became the most successful smartphone company in the world.\nTable of contents\nAAPL defined by Apple\nHere’s how Apple defines itself:\nApple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch, and Apple TV. Apple’s five software platforms — iOS, iPadOS, macOS, watchOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it.\nKey AAPL history\nFrom Apple I to iMac\nApple was founded in 1976 by Steve Jobs (Steve), Steve Wozniak (Woz), and (briefly) Ronald Wayne as a business partnership: Apple Computer Company. The following year it became Apple Computer, Inc. The company’s first product was the Apple I, a personal computer hand-built by Woz and sold in part-completed kit form. The Apple II and Apple III followed.\nThe modern Apple as we know it today began in 1983, with the launch of the first personal computer with a graphical user interface, the Lisa. Way too expensive to succeed, it was replaced by the Macintosh in 1984, launched with the single showing of a Ridley Scott commercial during the Super Bowl. The Macintosh transformed the world’s understanding of what a computer was, and would eventually lead to Microsoft adopting the GUI approach.\nSteve Jobs and then Apple-CEO John Scully fell out in 1985, when Steve wanted to focus on the Macintosh while Scully wanted to put more attention on the Apple II, which was still selling well. That led to Steve being forced out of the company and going off to form NeXT.\nApple focused on selling Macintosh models at the highest possible margins, but would eventually fall foul of a mix of unsustainable pricing in the face of competition from Windows machines, and an overly complex product lineup. By 1996, the company was in trouble, and in 1997 Steve was brought back, along with the NeXT operating system, which would eventually form the basis of Mac OS X.\nSteve simplified the Mac lineup and had industrial designer Jony Ive work on a whole new look for a consumer desktop Mac, the colorful iMac. The iMac, like the original Macintosh, again changed the world’s understanding of what a computer was, and who should want one.\nFrom Apple Computer, Inc. to Apple, Inc.\nIn 2001, Apple launched the iPod. Although this wasn’t the first mp3 player, it was massively better than anything on the market at the time, and succeeded in turning a geeky piece of technology into a consumer electronics product with mass-market appeal.\nThe success of the iPod paved the way into other mobile devices. Apple was working on what would eventually become the iPad, when Steve realized that this was the basis of a smartphone. He diverted the team’s work into this, to launch the iPhone in 2007. The iPad launched later, in 2010.\nThe iPhone was yet another transformational product. While most other smartphones of the time were clunky devices with a keyboard and stylus, the iPhone was a sleek-looking device operated with a finger, and so simple that no user guide was needed. It was with the launch of the iPhone that Apple Computer, Inc. was renamed to Apple, Inc.\nFrom Intel to Apple Silicon\nWhile the iPhone, iPad, Apple Watch, and more are made with Apple-designed processors, the Mac lineup has historically relied on third-party companies for its CPUs. Over the years, Macs progressed from Motorola 680000 series chips through PowerPC to Intel.\nIn 2020, Apple began a two-year transition to the final stage in that journey, with Macs too finally getting Apple-designed chips. The first such is the M1 chip, used in the latest Mac mini, MacBook Air, and 13-inch MacBook Pro. Other Apple Silicon Macs followed.\nAAPL today\nApple is one of the largest companies in the world. It was the first publicly traded company to hit a trillion-dollar valuation in 2018, $2 trillion in 2020, and $3T in 2022.\nThe company’s product lineup includes five different Mac families (MacBook Air, MacBook Pro, iMac, Mac Pro, and Mac mini); four iPad ranges (iPad mini, iPad, iPad Air, iPad Pro); four iPhone 12 models (12, 12 mini, 12 Pro, 12 Pro Max); three main Apple Watch models (SE, Series 3, Series 6); as well as other products, including Apple TV, AirPods, and HomePod mini.\nIn addition to hardware sales, Apple derives a growing proportion of its income from Services, including the App Store, iCloud, Apple Music, and Apple Pay."
    },
    {
      "url": "https://9to5mac.com/2025/08/06/apples-american-manufacturing-program-includes-a-new-chip-deal-with-samsung/",
      "text": "Here’s an interesting tidbit from today’s flurry of announcements tied to Apple’s new $100 billion American Manufacturing Program: the company is entering a new chip manufacturing partnership with Samsung. Here are the details.\nNew tech for new chips\nAccording to Apple, they are working with Samsung’s Austin, Texas facility, to bring to the U.S. “an innovative new technology for making chips, which has never been used before anywhere in the world”.\nIn the press release, Apple doesn’t specify what this new technology is, but says that the Austin facility “will supply chips that optimize power and performance of Apple products, including iPhone devices shipped all over the world.”\nHere’s Apple’s full statement:\nApple is also working with Samsung at its fab in Austin, Texas, to launch an innovative new technology for making chips, which has never been used before anywhere in the world. By bringing this technology to the U.S. first, this facility will supply chips that optimize power and performance of Apple products, including iPhone devices shipped all over the world.\nWhile that’s not much to go on, there is speculation suggesting that Samsung (rather than Sony) will supply Apple with next-generation ISOCELL camera sensors, built at the same Austin facility.\nAnd while camera sensors aren’t typically described as components that “optimize power and performance,” this is ultimately a carefully worded press release made to appease and make the current U.S. administration look good, so a bit of creative framing could be on the table.\nBe it as it may (and, again, without knowing the specifics), it is interesting to see Apple turn to Samsung, rather than TSMC, its primary chip partner, or even Intel, which has been lobbying hard for foundry business and government incentives, to pilot what it calls a “never been used before anywhere in the world” chipmaking technology on U.S. soil.\nTSMC, for its part, has also recently announced plans to expand its total investment in the U.S. to $165 billion, including “three new fabs, two advanced packaging facilities and an R&D center” per the company’s own press release.\nWhat do you think this new chip could be? Let us know in the comments.\nAccessory deals on Amazon\n- Anker 25,000mAh power bank, 100W, USB-C: $109.99 (was $134.99)\n- Anker Foldable 3-in-1 wireless charger, 15W, Qi2: $62.99 (was $89.99)\n- AirPods Pro 2: $169 (was $249)\n- AirTag, 4 Pack: $79.98 (was $99)\nFTC: We use income earning auto affiliate links. More.\nComments"
    },
    {
      "url": "https://9to5mac.com/2025/01/10/samsung-reportedly-working-on-a-3-layer-stacked-camera-sensor-for-iphone/",
      "text": "Sony has had the exclusive manufacturing contract for iPhone camera sensors for more than a decade, but Apple analyst Ming-Chi Kuo last year suggested this would be changing with the iPhone 18. This has now been backed by two further reports, one of which provides a little more detail.\nSamsung is said to be working on a 3-layer stacked camera sensor for Apple, which should improve the performance of future iPhone cameras. Update: Digitimes now backs the report …\nSony’s iPhone camera sensors\nSony has for years made the most advanced smartphone camera sensors, and it’s been no secret that they have long made all of the sensors used in iPhones.\nIf teardowns revealing known Sony model numbers weren’t sufficient evidence, Apple CEO Tim Cook made it clear a couple of years ago, tweeting about a visit he made to Sony’s camera sensor facility in Kumamoto.\nWe’ve been partnering with Sony for over a decade to create the world’s leading camera sensors for iPhone. Thanks to Ken and everyone on the team for showing me around the cutting-edge facility in Kumamoto today.\nBut Samsung may make one for the iPhone 18\nHowever, Kuo said last summer that Samsung was expected to make at least one of the sensors for the iPhone 18 in 2026.\nSamsung is expected to begin shipping 1/2.6-inch 48MP ultra-wide CMOS image sensors (CIS) to Apple for iPhones as early as 2026, breaking Sony’s years-long monopoly on supplying CIS to Apple. To this end, Samsung has established a dedicated team to serve Apple.\nLeaker Jukanlosreve, who mostly posts Samsung content, echoes this view, and claims to have some specifics about the sensor.\nExclusive: Samsung is currently developing a “3-layer stacked” image sensor in a PD-TR-Logic configuration for Apple. This sensor is more advanced than Sony’s existing Exmor RS, and I believe it cannot be ruled out as a potential candidate for the main sensor.\nA stacked sensor is where the processing electronics are mounted directly to the back of the sensor, and a three-layer version would have more of the circuitry attached to the sensor, which should result in increased signal processing speeds. This would improve the responsiveness of the camera.\nStacked sensors also have the potential to eliminate some sources of noise, boosting image quality.\nSeparately, Jukanlosreve says Samsung is working on a 500MP sensor for its own smartphones. While this sounds ridiculous, it is consistent with the company chasing impressive-sounding megapixel numbers even if the end result is far noisier images.\n9to5Mac’s Take\nA pair of reports is still relatively slim evidence for what would be a pretty significant change to Apple’s supply chain, but there is no doubt that Samsung has been working hard to try to win the iPhone maker’s business.\nAdditionally, Apple prefers to have more than one supplier for major components, both for contingency planning and to improve its negotiating strength. So even if Apple continues to use Sony sensors, it’s perfectly credible that it would seek to source some from Samsung too.\nWhile the report suggests the new sensor might be for the main camera, it seems more likely Apple would test the waters with a secondary sensor at first.\nPhoto of iPhone 16 Pro Max camera module: iFixit\nFTC: We use income earning auto affiliate links. More.\nComments"
    },
    {
      "url": "https://9to5mac.com/2025/08/06/apple-launches-the-american-manufacturing-program-with-a-new-100b-commitment-to-the-us/",
      "text": "Apple just announced a new “$100 billion commitment to America”, which includes plans to move the manufacturing of all of the cover glass for iPhone and Apple Watch to the U.S. Here are the details.\nApple’s investment in the U.S. to reach $600 billion over the next four years\nAs Apple investors certainly noticed today, the company’s stock spent most of the day riding on a +5% bump on the news that CEO Tim Cook would join President Donald Trump in the Oval Office to announce a new investment in U.S. manufacturing.\nThe announcement just happened, with Apple confirming that it will invest an additional $100 billion over the next four years (on top of the previously announced $500 billion), and the unveiling of the American Manufacturing Program (AMP), “dedicated to bringing even more of Apple’s supply chain and advanced manufacturing to the U.S.”\nApple to move all iPhone and Apple Watch cover glass production to the U.S.\nFrom Apple’s announcement:\n“The American Manufacturing Program will help fund a major expansion of Apple’s long-standing partnership with Corning, bringing the world’s largest and most advanced smartphone glass production line to a factory in Harrodsburg, Kentucky. The expansion means that soon, every iPhone and Apple Watch sold around the world will be built with Kentucky-made cover glass. The two companies will also open a new Apple-Corning Innovation Center in Kentucky.\nTop comment by Hazen\nI’m reminded of Apple’s years-long failure at bringing sapphire display production to the US only to abandon plans (file for bankruptcy and terminate staff) and keep manufacturing overseas.\nAs part of the AMP, Apple also announced:\n- An expansion of its silicon supply chain across every step of chip production;\n- An expanded agreement with Coherent, which manufactures VSCEL lasers used in Face ID and other iPhone and iPad features;\n- A 250,000-square-foot server facility in Houston, which will power Apple Intelligence and Private Cloud Compute;\n- New hiring plans for up to 20,000 direct jobs focused on AI, silicon engineering, and software development;\n- Expansion of its Maiden, NC data center, and ongoing construction at facilities in Nevada, Iowa, and Oregon;\n- An Apple Manufacturing Academy opening in Detroit later this month to support small and midsize U.S. manufacturers;\nApple might be back on Trump’s good graces\nToday’s new commitments come after weeks of tension between the Trump administration and Tim Cook, and signals a renewed accord between Apple and the U.S. government. Many of Trump’s acolytes had taken to openly criticizing Apple in interviews, calling for iPhone manufacturing to be brought to the U.S, which many analysts have deemed impossible.\nWhile today’s commitment doesn’t specifically involve manufacturing iPhones in the U.S., it does involve sourcing domestic materials and investing in domestic labour enough to apparently secure a truce and get Apple back on Trump’s good side.\nWhat are your thoughts about the announcement? Let us know in the comments.\nAccessory deals on Amazon\n- Anker 25,000mAh power bank, 100W, USB-C: $109.99 (was $134.99)\n- Anker Foldable 3-in-1 wireless charger, 15W, Qi2: $62.99 (was $89.99)\n- AirPods Pro 2: $169 (was $249)\n- AirTag, 4 Pack: $79.98 (was $99)\nFTC: We use income earning auto affiliate links. More.\nComments"
    },
    {
      "url": "https://koreajoongangdaily.joins.com/news/2025-08-07/business/industry/Samsung-to-produce-Apples-nextgeneration-chips-at-US-foundry/2370501",
      "text": "Samsung to produce Apple's next-generation chips at U.S. foundry\nPublished: 07 Aug. 2025, 09:05\nSamsung Electronics will produce Apple’s next-generation chips at its U.S. foundry in Texas, the two companies confirmed Thursday.\nApple said it is “working with Samsung at its fab in Austin, Texas, to launch an innovative new technology for making chips, which has never been used before anywhere in the world,” in a press release issued Thursday.\n“By bringing this technology to the U.S. first, this facility will supply chips that optimize power and performance of Apple products, including iPhone devices shipped all over the world,” the company added.\nIndustry analysts say the chips in question are likely image sensors for next-generation iPhones.\n“Mass production of image sensors for the iPhone 18 next year, along with new clients such as Tesla, is expected to reduce losses in Samsung’s semiconductor division,” wrote Kiwoom Securities analyst Park Yu-ak in a report last month.\nSamsung’s image sensor brand Isocell is designed by its System LSI division. The company’s foundry is reportedly set to manufacture the new chips using cutting-edge technology at the Austin facility. Samsung currently supplies Isocell sensors to its own Galaxy smartphones as well as to Chinese brands such as Xiaomi and Vivo and Motorola.\nAnalysts suggest Apple selected Samsung to localize production and diversify its supply chain. Until now, Apple has relied entirely on Japan’s Sony for the image sensors used in iPhones. As of last year, Sony held over 50 percent of the global image sensor market, while Samsung ranked second with a 15.4 percent share.\n“We cannot confirm details about clients or specific projects,” a Samsung spokesperson said regarding the deal.\nTranslated from the JoongAng Ilbo using generative AI and edited by Korea JoongAng Daily staff.\nBY KIM JI-HYE [[email protected]]\nwith the Korea JoongAng Daily\nTo write comments, please log in to one of the accounts.\nStandards Board Policy (0/250자)"
    },
    {
      "url": "https://www.apple.com/newsroom/2025/08/apple-increases-us-commitment-to-600-billion-usd-announces-ambitious-program/",
      "text": "PRESS RELEASE\nAugust 6, 2025\nApple increases U.S. commitment to $600 billion, announces American Manufacturing Program\nApple supports more than 450,000 jobs with thousands of suppliers and partners across all 50 states — including significant expansions in Arizona, California, Iowa, Kentucky, Nevada, New York, North Carolina, Oregon, Texas, and Utah\nCUPERTINO, CALIFORNIA Apple today announced a new $100 billion commitment to America, a significant acceleration of its U.S. investment that now totals $600 billion over the next four years. Today’s announcement includes the ambitious new American Manufacturing Program (AMP), dedicated to bringing even more of Apple’s supply chain and advanced manufacturing to the U.S. Through AMP, Apple will increase its investment across America and incentivize global companies to manufacture even more critical components in the United States.\n“Today, we’re proud to increase our investments across the United States to $600 billion over four years and launch our new American Manufacturing Program,” said Tim Cook, Apple’s CEO. “This includes new and expanded work with 10 companies across America. They produce components that are used in Apple products sold all over the world, and we’re grateful to the President for his support.”\nApple parts and components manufactured in the U.S. ship to customers around the world; in fact, roughly two-thirds of the components made in the U.S. are exported to customers outside the U.S.\nToday, Apple partners with thousands of suppliers across all 50 states, supporting more than 450,000 supplier and partner jobs. In the next four years, Apple plans to directly hire 20,000 people in the U.S. — the vast majority focused on R&D, silicon engineering, software development, and AI and machine learning.\nApple American Manufacturing Program\nApple is working with its suppliers to accelerate manufacturing in the U.S. through the new American Manufacturing Program. The first AMP partners include Corning, Coherent, GlobalWafers America (GWA), Applied Materials, Texas Instruments (TI), Samsung, GlobalFoundries, Amkor, and Broadcom. This builds on Apple’s July commitment to buy American-made rare earth magnets from MP Materials.\nThe American Manufacturing Program will help fund a major expansion of Apple’s long-standing partnership with Corning, bringing the world’s largest and most advanced smartphone glass production line to a factory in Harrodsburg, Kentucky. The expansion means that soon, every iPhone and Apple Watch sold around the world will be built with Kentucky-made cover glass. The two companies will also open a new Apple-Corning Innovation Center in Kentucky.\nApple has also entered into a new multiyear agreement with Coherent, a long-standing partner that produces the VCSEL lasers that enable multiple features — including Face ID — on iPhone and iPad devices shipped around the world. This work takes place at Coherent’s Sherman, Texas, facility.\nIn July, Apple also committed to buying American-made rare earth magnets developed by MP Materials — the only fully integrated rare earth producer in the United States — significantly expanding their flagship Independence facility in Fort Worth, Texas. These magnets will become part of Apple devices shipped around the world. The two companies will also establish a cutting-edge rare earth recycling line in Mountain Pass, California.\nApple Expands End-to-End American Silicon Supply Chain\nWith these new partnerships, Apple is leading the creation of an end-to-end silicon supply chain in the United States, with partners in every key aspect of silicon production.\nThis U.S. silicon supply chain is on track to produce more than 19 billion chips for Apple products in 2025. That includes TSMC in Arizona, which is producing tens of millions of chips for Apple using one of the most advanced process technologies in America. Apple is this factory’s first and largest customer.\n“Apple engineers work closely with suppliers across the United States to create silicon chips that are on the leading edge of innovation,” said Sabih Khan, Apple’s chief operating officer. “We’re committed to supporting U.S. suppliers involved in every key stage of the chip-making process — from the earliest stages of research and development, to final fabrication and packaging. We want America to lead in this critical industry, and we’re expanding our efforts to grow a silicon manufacturing ecosystem that will benefit innovators across America.”\n- Wafers are the building block of any silicon chip, and Apple is partnering with GlobalWafers America in Sherman, Texas, to produce advanced wafers for use in U.S.-based semiconductor fabs for the first time. American chip fabs like TSMC in Phoenix, Arizona, and Texas Instruments in Sherman, Texas, will use GWA’s 300mm wafers to produce chips for iPhone and iPad devices sold in the U.S. and around the world. GWA uses silicon from U.S. sources, including from Corning’s Hemlock Semiconductor, to produce the world’s most advanced silicon wafers.\n- Apple is also partnering directly with Applied Materials to boost the production of semiconductor manufacturing equipment in the U.S. The Applied site in Austin, Texas, is a pivotal hub for manufacturing cutting-edge chip equipment.\n- Fabs take bare wafers and turn them into chips. Apple and Texas Instruments are expanding their partnership to increase future product collaboration and critical U.S. capacity for this work. Apple is making a new commitment with TI, which will support additional tool installations at its facility in Lehi, Utah, and a new facility in Sherman, Texas. These facilities are home to TI’s most advanced process technologies and use American-made chip manufacturing equipment from Applied Materials’ factory in Austin, as well as advanced silicon wafers from GlobalWafers America. These facilities will manufacture critical foundational semiconductors used for Apple products, including iPhone devices shipped in the U.S. and around the world.\n- Apple is also working with Samsung at its fab in Austin, Texas, to launch an innovative new technology for making chips, which has never been used before anywhere in the world. By bringing this technology to the U.S. first, this facility will supply chips that optimize power and performance of Apple products, including iPhone devices shipped all over the world.\n- GlobalFoundries and Apple have also entered an agreement to bring more semiconductor manufacturing to the United States, focused on manufacturing cutting-edge wireless technologies and advanced power management — critical technologies that enable longer battery life and enhanced connectivity in Apple devices. The partnership will bring new capabilities, jobs, and technology to the GlobalFoundries semiconductor facility in Malta, New York.\n- Packaging is the final critical step in manufacturing silicon chips. Apple is investing in Amkor’s new advanced chip packaging and test facility in Arizona, and will be its first and largest customer. This will accelerate the development of packaging capabilities in America, meaningfully strengthening the semiconductor supply chain in the U.S. This facility will package and test Apple silicon manufactured at the nearby TSMC fab, and create chips used in iPhone devices shipped around the world.\nApple is also working with Broadcom and GlobalFoundries to develop and manufacture additional cellular semiconductor components in the U.S. These components are crucial for 5G communications in Apple products.\nNew and Expanded Facilities Across the U.S.\nEarlier this year, construction began in Houston on the new factory supporting production of advanced Apple servers, and in July, the facility produced its first test unit. The 250,000-square-foot server manufacturing facility is slated to begin mass production in 2026.\nPreviously manufactured outside the U.S., the servers from Houston will play a key role in powering Apple Intelligence, and are the foundation of Private Cloud Compute, which combines powerful AI processing with the most advanced security architecture ever deployed at scale for AI cloud computing. The servers bring together years of R&D by Apple engineers, and deliver the industry-leading security and performance of Apple silicon to the data center.\nIn Detroit, registration is now open for the new Apple Manufacturing Academy, which was announced in February and is set to open on August 19. The academy will offer consultations and courses to small and medium-sized business on how they can implement advanced manufacturing and AI into their manufacturing programs.\nConstruction is also underway in Maiden, North Carolina, where Apple is expanding the capacity of its data center with a significant investment in its state-of-the-art facility that supports North American users of Apple services. The expansion builds on more than $5 billion that Apple has already invested in Catawba County.\nApple’s Maiden facility supports Apple’s services such as iCloud, the App Store, Apple Music, iMessage, Apple TV+, Apple Sports, and more. The expanded capacity will also help support the growth of Apple Intelligence. As with all of Apple’s facilities, the data center is powered by 100 percent renewable energy sourced from Apple-created projects in the region.\nApple is also expanding data center capacity in states across the country, with construction underway in Iowa, Nevada, and Oregon.\nMeanwhile, construction continues on Apple’s second campus in Austin. Apple has more than 13,000 team members across Texas, including thousands already working from the three completed office buildings, which exceed 1 million square feet. The three buildings currently under construction include an expansive new R&D lab space for Apple’s Hardware Engineering, Hardware Technology, and Software Engineering teams.\nThis press release contains forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include without limitation those about Apple’s plans for future investments and expansion. These statements involve risks and uncertainties, and actual results may differ materially from any future results expressed or implied by the forward-looking statements. More information regarding potential risks and other factors that could affect the company are included in Apple’s filings with the SEC, including in the “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” sections of Apple’s most recently filed periodic reports on Form 10-K and Form 10-Q and subsequent filings. Apple assumes no obligation to update any forward-looking statements or information, which speak only as of the date they are made.\nMedia\n-\nText of this article\n-\nImages in this article"
    }
  ],
  "argos_summary": "Apple has announced a significant increase in its U.S. manufacturing investment, totaling $600 billion over the next four years, which includes a partnership with Samsung to develop innovative chip-making technology at its Austin facility. This collaboration is expected to produce next-generation image sensors for the iPhone 18, marking a shift from Apple's long-standing reliance on Sony for camera sensors. Analysts suggest that this move will foster competition between Samsung and Sony, potentially enhancing the quality and performance of future iPhone cameras.",
  "argos_id": "W8J8LJW8N"
}