{
  "url": "https://www.slashgear.com/1931023/does-nissan-build-honda-trucks-united-states-partnership/",
  "authorsByline": "Mike Garrett",
  "articleId": "d1895343d19b4ce39f8647f423c5e15d",
  "source": {
    "domain": "slashgear.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://www.slashgear.com/img/gallery/is-nissan-going-to-build-hondas-trucks-in-the-us-heres-what-we-know/l-intro-1754344274.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T16:15:00+00:00",
  "addDate": "2025-08-08T16:22:13.801949+00:00",
  "refreshDate": "2025-08-08T16:22:13.801951+00:00",
  "score": 1.0,
  "title": "Is Nissan Going To Build Honda's Trucks In The US? Here's What We Know",
  "description": "Nissan and Honda's merger talks were killed off earlier this year, but according to a new report, the two Japanese companies aren't done trying to make a deal.",
  "content": "Is Nissan Going To Build Honda's Trucks In The US? Here's What We Know\n\nThough Honda has long been one of the most popular Japanese automakers in America, one of the big things that's always separated Honda from its rivals Nissan and Toyota is its lack of a \"real\" pickup truck, which, of course, is a big market in the truck-crazed America. Yes, Honda has sold the Ridgeline pickup for over 20 years now, but the Ridgeline is not a conventional truck. With its unibody platform shared with the Honda Odyssey minivan and Honda Pilot SUV, the Ridgeline does a lot of things well, but it's not going to have the same towing capacity or the off-road capability you get with a dedicated, body-on-frame pickup truck. But if recent, well-sourced industry rumors are true, there may soon be a body-on-frame truck on sale at Honda dealers. No, Honda isn't planning on developing its own, brand-new pickup to take on the likes of the Toyota Tacoma and Chevy Colorado. Instead, Honda is considering a partnership with Nissan, where Nissan would use excess production capacity in America to build pickup trucks for Honda as both companies work to navigate the tariff situation and Nissan tries to regain its financial footing.\n\nIf you've followed auto industry news in the last year, this likely won't be the first time you've heard about Nissan and Honda working together. In 2024, the two car companies announced plans to merge, forming what would have been the world's third-largest automaker by volume, but the merger plan fell apart in early 2025 after a number of obstacles, including the fact that, despite its ongoing financial troubles, Nissan did not want to become a subsidiary of Honda. While the big merger talks were called off, the two companies remained committed to strategic partnerships where both could benefit, and according to reporting by Nikkei, one of those partnerships could result in Nissan building trucks for Honda at its factory in Canton, Mississippi. With the ongoing U.S. tariff policy causing auto companies to re-strategize their production plans, this partnership would allow Honda to enter the heavier-duty pickup segment while boosting its share of domestically produced vehicles. On the other side, it would give Nissan a financial boost by using excess production capacity to build trucks for Honda.\n\nSo what would a Honda truck built by Nissan look like? Almost certainly, it would be a rebadged version of the Nissan Frontier mid-sized truck currently made in Canton, MS, as Nissan no longer offers the full-size Titan. We don't know when exactly this Honda truck would begin production, what it would be called, or if it would differ from the Frontier in any way besides its badging. It's also unclear how popular a Honda-badged Nissan Frontier would even be in today's market. Though improved in its current generation, we've still found the Frontier to be a few steps behind the competition in the highly competitive mid-size pickup segment. A Honda badge isn't likely to change that. But this also wouldn't be the first time that Honda sold a body-on-frame vehicle in America that was built by another company. The original Honda Passport of the 1990s was simply a rebadged Isuzu Rodeo, with Honda bringing back the nameplate in 2019 to use on its own ruggedized crossover SUV. Neither Nissan nor Honda has officially confirmed or even hinted at these pickup truck plans, but Nikkei is not your typical internet rumor site, and its reporting is usually well-sourced. Still, seeing as how the Honda-Nissan merger itself ended up falling through, this plan may never reach fruition either. Especially given how volatile the auto industry is right now as it works through ever-shifting tariffs and environmental regulations across different regions.",
  "medium": "Article",
  "links": [
    "https://usa.nissannews.com/en-US/channels/facilities-canton?selectedTabId=facilities-canton-photos",
    "https://www.slashgear.com/1788742/nissan-honda-merger-called-off-results/",
    "https://www.slashgear.com/1572973/3-ways-new-honda-ridgeline-better-other-trucks-2-ways-worse/",
    "https://www.slashgear.com/1801568/2025-nissan-frontier-pro-4x-review-specs-price-problems/",
    "https://asia.nikkei.com/business/automobiles/nissan-mulls-making-trucks-for-honda-at-underused-us-plant"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Honda",
      "weight": 0.10986264
    },
    {
      "name": "Honda dealers",
      "weight": 0.105941996
    },
    {
      "name": "pickup trucks",
      "weight": 0.10367153
    },
    {
      "name": "Honda Pilot SUV",
      "weight": 0.10290919
    },
    {
      "name": "Nissan",
      "weight": 0.09715269
    },
    {
      "name": "trucks",
      "weight": 0.082329266
    },
    {
      "name": "the Nissan Frontier mid-sized truck",
      "weight": 0.07678895
    },
    {
      "name": "excess production capacity",
      "weight": 0.07185754
    },
    {
      "name": "auto companies",
      "weight": 0.07119846
    },
    {
      "name": "Hondas Trucks",
      "weight": 0.06864384
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/Autos & Vehicles/Vehicle Shopping/Vehicle Specs, Reviews & Comparisons",
      "score": 0.83740234375
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Trucks, Vans & SUVs",
      "score": 0.46630859375
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.41162109375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.410888671875
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Hybrid & Alternative Vehicles",
      "score": 0.345703125
    }
  ],
  "sentiment": {
    "positive": 0.39868164,
    "negative": 0.10168457,
    "neutral": 0.49951172
  },
  "summary": "Is Nissan is reportedly planning to build Honda's Trucks in the US, replacing them with a body-on-frame pickup truck. This move comes as Honda is considering a partnership with Nissan, where Nissan would use excess production capacity in America to build pickup trucks for Honda as both companies navigate the tariff situation and recover from financial issues. The potential partnership would allow Honda to enter the heavier-duty pickup segment while boosting its share of domestically produced vehicles. The Honda-Nissan merger between the two car companies in 2024, however, ended in early 2025 due to financial issues and a lack of desire to become a subsidiary of Honda. A Honda-badged Nissan Frontier could be built by Nissan, a rebadged version of the Nissan Frontier mid-sized truck currently made in Canton, Mississippi. However, it is unclear how popular a Honda-branded Nissan Frontier would be in today's market.",
  "shortSummary": "Nissan is considering building Honda's pickup trucks in the US, potentially benefiting both companies by leveraging Nissan's excess production capacity and boosting Honda's domestic market appeal.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f2c452d4f8464b1eb1f5b2cff33e7ede",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.slashgear.com/1572973/3-ways-new-honda-ridgeline-better-other-trucks-2-ways-worse/",
      "text": "3 Ways The New Honda Ridgeline Is Better Than Other Trucks (And 2 Ways It Isn't)\nWhen it comes to trucks, the 2024 Honda Ridgeline stands out among not only the midsize competition, but in the truck market overall. Like the Ford Maverick and Hyundai Santa Cruz compact trucks, the Ridgeline is a crossover-based unibody pickup; it shares its underlying foundation with the Honda Pilot and Acura MDX. It has a transverse-mounted 3.5-liter V6 linked to a nine-speed automatic whose 280 horses find their way to the road and trail through all corners (though until 2021, they also could have gone exclusively to the front on certain trim levels).\nWhile its crossover bloodline means the Ridgeline is limited in some ways compared to the likes of the Ford Ranger, Chevrolet Colorado, and Toyota Tacoma, Honda's truck offering can also do some things better than traditional body-on-frame pickups. Let us count the ways the 2024 Honda Ridgeline does the job better than the competition, plus a couple of things best left to the old guard.\nWhere the 2024 Honda Ridgeline shines\nFirst of all, there is no other truck on the market today that has what the 2024 Honda Ridgeline has: an in-bed trunk. Turns out sharing the same bones as the Pilot comes with benefits, like a lockable in-bed trunk with drainage. Thus, you can keep your catch from the river or your brews for the tailgate good and cold by filling the trunk with ice, then drain, wash-out, and dry for the grocery run. Not to mention the truck's spare is spared from the elements by residing in the same trunk cubby.\nWhile a few full-size trucks — like the 2025 Ram lineup, Ford F-150, and GMC Sierra — utilize various ways of dropping down or otherwise opening the tailgate aside from the traditional drop-down method, no midsize truck can do what the Ridgeline does with its tailgate. In addition to the aforementioned traditional method, a latch tucked away on the right side of the tailgate allows anyone to open it out and away for better access to the in-bed trunk and whatever items are on the bed.\nFinally, few trucks of any size can do what the 2024 Honda Ridgeline can when it comes to hauling cargo. Its \"lay-flat\" truck bed maximizes space by minimizing intrusion of the rear wheelwells. Thus, loading anything and everything from big sheets of plywood to a load of donations and recycling is a cinch with every inch available to take on the tasks at hand, even if rivals might boast bigger beds on paper.\nWhere other trucks surpass the 2024 Ridgeline\nFor all the versatility the 2024 Honda Ridgeline offers in both the midsize and overall truck markets, there are a couple of things this unique pickup will need to leave things to traditional body-on-frame rigs. One of those happens to be towing. It's no slouch with its ability to tow 5,000 pounds; however, this towing capacity is only on par with the compact Hyundai Santa Cruz. Meanwhile, the Ford Ranger can tow between 5,510 to 7,500 pounds, while the GMC Canyon can tow 6,000 pounds, and the upcoming 2025 Toyota Tundra pulls up to 6,800 pounds. Thus, if you're looking to move some really heavy gear around, the Ridgeline might not be up to the task.\nThen, there's total customization. For example, the beds on traditional midsize pickups can be swapped out for specialized units like those for full-size rigs. Not so on the Ridgeline, whose bed is a part of the truck, even it doesn't look like it on first glance due to its more traditional truck styling. While there is an aftermarket for this unique truck to turn up the uniqueness to 11, there are bigger ones for the rest of the midsize field due to the ease of buildability of body-on-frame machines; popularity of certain platforms, like the Ranger and Tacoma, also help."
    },
    {
      "url": "https://www.slashgear.com/1801568/2025-nissan-frontier-pro-4x-review-specs-price-problems/",
      "text": "2025 Nissan Frontier Pro-4X Review: Pickup Problems\nThe Nissan Frontier has been around for a long time, despite essentially only two generations of truck. There's the early-2000s variant that showed that Nissan was capable of designing a great looking truck with utilitarian flair. The second generation, continuing on for almost two decades, was the epitome of \"if it ain't broke, don't fix it.\" The current latest and greatest Nissan Frontier is Nissan's attempt at reviving a comparatively ancient truck for the modern age. I'm not sure Nissan succeeded.\nThe 2025 Nissan Frontier attempts to cover a wide swathe of the market, ranging from bargain basement contractor-spec, to something you would expect to see bouncing up and down across the dunes at a rally halfway across the world. The specific example on my driveway fit firmly into the latter category, a 2025 Nissan Frontier Pro-4X. If the \"Afterburn Orange\" paint didn't clue you in that it was meant to be a goofy off-road truck, the decals and huge \"FRONTIER\" script on the dashboard will.\nAn aesthetic treat\nThe 2025 Frontier Pro-4X is a deeply confusing vehicle. On paper, everything about it sounds excellent. It has plenty of power: 310 horsepower from a 3.8-liter V6. It has an electronic locking rear differential, for when you need some extra granularity when rock crawling. It has a two-speed transfer case like any 4x4 should have. It even has Bilstein shocks, and tow hooks and tie-downs everywhere. It sounds and looks great. Nissan has always nailed how to make a paint scheme look fantastic.\nBut words and looks can be deceiving, because when put all together, the Frontier is a bit of a mess.\nLet's start with the positives. Nissan made a good looking truck, mean and ready to tackle whatever off-road oriented task you have for it. The interior is also well appointed, like a lot of other current Nissans. There are leather accents, a heated steering wheel, a 10-speaker sound system furnished by Fender, and even a sunroof. I can't recall the last time I saw a proper sunroof on a mid-size truck. It also has all of the safety and assist gadgets you would expect, like rear cross traffic alerts, a 360 degree camera system, and adaptive cruise control. It's not a Cadillac or Mercedes by any stretch of the imagination, but it's not a hateful place to be (if you can get over the road noise and the 18 miles per gallon thirst).\nIt starts to fall apart\nActually driving the Frontier is where it all starts to fall apart. Having driven a lot of agricultural equipment, I feel qualified to say it drives more like a tractor than a truck. It's very torque-y on the low end of the gearing range, but it never feels like it progresses beyond that, despite the howling protests of the engine. The 9-speed automatic transmission really isn't doing it any favors in the acceleration department. I did an unintentional burnout at nearly every stop light with everything beyond even the slightest touch of the pedal, only for it to take relative ages to reach the speed limit.\nI genuinely thought I had accidentally locked the rear differential causing it to drive in a wonky matter. You might be thinking \"well, at least it should be able to tow a lot, and I'm sure the torque numbers are great.\" You will then be disappointed upon learning that the Pro-4X 4x4 can only tow up to 6,310 pounds (a Ford Ranger 4x4 can tow 7,500 pounds).\nThe engine only makes 281 lb-ft of torque, which really isn't much. It's all bark and no bite. The extra-aggressive looking off-road tires let refinement down in the daily-driver department, too.\nTallying up the cost\nAs with any review, there are some caveats. I didn't test the Frontier in the sand. I was mostly confined to the icy parking lots and roadways of southern Pennsylvania. I didn't do any real off-roading other that what pictures show, and I didn't hop any dunes. I just drove it around like any other car. If I went off-roading with it, I may have a more nuanced view of its rock-crawling chops. As a normal daily-driver, though, I found it lacking.\nAll that said, how much does the 2025 Nissan Frontier Pro-4X intimidate you bank account? The Pro-4X model, which gets you off-road goodies like skid plates and meaty tires, starts at $41,770 (as opposed to the $33,540 base model Frontier). The Frontier you see here was equipped with the $2,190 Pro Convenience Package which includes a spray-on bedliner, 120-volt outlets in the bed and interior, heated mirrors, steering wheel, and seats, LED bed lighting, remote start, and a wireless charger.\nThe additional $3,080 Pro Premium Package includes the aforementioned Fender sound system, sunroof, and leather seats all around. The Afterburn Orange paint color adds $425. Pro-4X-branded floor mats and door protectors will set you back $280. Lastly $990 for the–admittedly excellently-styled–wheels and a $1,510 destination fee get you to the final price of $50,245.\n2025 Nissan Frontier Pro-4X Verdict\nCompared to six-figure luxo-trucks, that's not bad. Plus, it's right in line with the Trail Boss variant of the Chevy Colorado, and much less than a TRD Pro Toyota Tacoma. However, it pales in comparison to trucks like the Ford Ranger I reviewed late last year, and it's not even in the same contest as the full-size Ram 1500 Warlock when it comes to livability and capability. The Nissan will give you a better interior than the Ford, but is it worth the sacrifice for a truck that's worse in most other departments? I don't think so.\nThe 2025 Nissan Frontier Pro-4X 4x4 in all of its hyphenated off-road glory is not a terrible truck. Yet, it falls short of greatness by a significant margin. Excellent looks and a (mostly) well-populated options list do not translate to pickup truck stardom in the same way as something like a Tacoma or Ranger. The Frontier just doesn't have what it takes where it really counts."
    },
    {
      "url": "https://www.slashgear.com/1788742/nissan-honda-merger-called-off-results/",
      "text": "Nissan And Honda Merger Collapses, Exposing Who Needed It Most\nThe Honda and Nissan merger that has been speculated on and reported for months is not going to happen after all, according to a press release from Nissan. There are a number of reasons the merger failed. Nissan cited the ever encroaching electric car future with \"an increasingly volatile market environment.\" The chief cause of talks dissolving, however, could be blamed on Nissan's pride and need for independence. The press release says that Honda wanted to pick its own leadership for Nissan, more than likely clearing the executive suite. Additionally, Nissan would be made a subsidiary of Honda. Nissan, apparently, couldn't abide by that.\nAfter the dust settles, Honda will continue on, doing business as usual. But Nissan will still be left in the lurch, looking for a buyer or a partner. The company still needs something to help itself out of the financial hole it has gotten in, and now Honda has been crossed off the list.\nNissan's uncertain future\nThe press release stated \"it would be most appropriate to cease discussions,\" meaning that Honda and Nissan likely aren't going to come back to the negotiating table anytime soon and try to rehash out an agreement. Nissan is likely too far past the point where it could build a game changer EV and expect all of its problems to be solved. Its current EV offerings, which consist of the Nissan Ariya and Nissan Leaf for the North American market, aren't bad cars at all, but it will take a lot more than two cars to rescue an entire company from financial doom.\nHonda and Nissan will, however, continue with what Nissan is calling a \"strategic partnership\" that will attempt to tackle electrified and perhaps autonomous cars in the future. That's not as drastic as a full on acquisition like Honda has probably hoped for. The clock is still ticking for Nissan and the future is uncertain."
    },
    {
      "url": "https://usa.nissannews.com/en-US/channels/facilities-canton?selectedTabId=facilities-canton-photos",
      "text": "USA\nNewsroom\nModels\nOpen Models\nAll Models\nElectric Vehicles\nOpen Electric Vehicles\nAriya\nLEAF\nCrossovers and SUVs\nOpen Crossovers and SUVs\nArmada\nKicks\nMurano\nPathfinder\nRogue\nCars\nOpen Cars\nAltima\nMaxima\nSentra\nVersa\nSports Cars\nOpen Sports Cars\nZ\nGT-R\nTrucks\nOpen Trucks\nFrontier\nTITAN\nConcepts\nPress Kit Archive\nNews\nOpen News\nAll News Releases\nNissan Stories\nMotorsports\nOpen Motorsports\nFormula E\nNissan Z GT4\nU.S. Sales Reports\nGlobal Financial Results\nTechnology & Safety News\nAwards & Accolades\nGalleries\nOpen Galleries\nCurrent Models\nCompany Logos\nEmployees\nPhilanthropy\nPhotos\nVideos\nB-Roll\nCorporate\nOpen Corporate\nLeadership\nOpen Leadership\nExecutive Biographies\nManagement Announcements\nFacilities\nPhilanthropy\nHeritage\nTechnology Library\nSpeaker Request Form\nManufacturing\nOpen Manufacturing\nPlant Tours\nNissanManufacturing.com\nEvents\nWhat's New\nNissan Stories\nManufacturing\nEmail Alerts\nRegions\nContacts\nNo Saved Items\nSaved Item\nSaved Items\nEmail Alerts\nRegions\nContacts\nModels\nAll Models\nElectric Vehicles\nAriya\nLEAF\nCrossovers and SUVs\nArmada\nKicks\nMurano\nPathfinder\nRogue\nCars\nAltima\nMaxima\nSentra\nVersa\nSports Cars\nZ\nGT-R\nTrucks\nFrontier\nTITAN\nConcepts\nPress Kit Archive\nJune 24, 2025\n2026 Nissan Armada debuts exciting new NISMO version\nJune 17, 2025\nThe iconic EV reimagined: Nissan unveils all-new third-generation LEAF\nNews\nAll News Releases\nNissan Stories\nMotorsports\nFormula E\nNissan Z GT4\nU.S. Sales Reports\nGlobal Financial Results\nTechnology & Safety News\nAwards & Accolades\nJune 26, 2025\nNissan ranks highest among Mass-Market brands in J.D. Power 2025 U.S. Initial Quality Study; Nissan Sentra and Altima top of their respective segments\nJune 24, 2025\nNissan celebrates 700,000 Murano crossovers assembled in the U.S.\nGalleries\nCurrent Models\nCompany Logos\nEmployees\nPhilanthropy\nPhotos\nVideos\nB-Roll\n2026 Nissan Armada NISMO – Exterior\n2026 Nissan LEAF – Exterior\nCorporate\nLeadership\nExecutive Biographies\nManagement Announcements\nFacilities\nPhilanthropy\nHeritage\nTechnology Library\nSpeaker Request Form\nManufacturing\nPlant Tours\nNissanManufacturing.com\nChristian Meunier - Chairman, Nissan Americas\nMay 13, 2025\nNissan sets the stage for change with the bold Re:Nissan plan\nEvents\nWhat's New\nNissan Stories\nManufacturing\nNissan News Alerts\nName\nEmail\nCompany/Affiliation\nSelect the category below that best describes your affiliation with Nissan:\nSelect...\nMedia\nNissan Vehicle Owner\nDealer Associate\nAnalyst/Investor\nEmployee\nIndustry Peer\nOther\nThis form is for news and media updates from The US Nissan Newsroom. You may opt into additional updates from the US Nissan Stories site below.\nUS Stories Site updates\nSubscribe\nTop Searches\nRe:Nissan\nMurano\nAccolades\nArmada\nKicks\nZ\nLEAF\nAriya\nHeritage\nCanton Vehicle Assembly Plant\nHome\n/\nAll Time\nNewest\nNewest\nOldest\nPhotos\n5 Million Vehicles - Frontier driving off line 2\nHigh-Resolution\nLow-Resolution\n5 Million Vehicles Group Shot\nHigh-Resolution\nLow-Resolution\n5 Million Vehicles - Frontier Driving off Line\nHigh-Resolution\nLow-Resolution\nWalker Parish places 5 Million Badge\nHigh-Resolution\nLow-Resolution\nNissan Canton Vehicle Assembly Plant\nHigh-Resolution\nLow-Resolution\nNissan Canton Vehicle Assembly Plant\nHigh-Resolution\nLow-Resolution\nNissan Canton Vehicle Assembly Plant\nHigh-Resolution\nLow-Resolution\nNissan Canton Vehicle Assembly Plant\nHigh-Resolution\nLow-Resolution\nNissan Canton Vehicle Assembly Plant\nHigh-Resolution\nLow-Resolution\nNissan Canton Vehicle Assembly Plant\nHigh-Resolution\nLow-Resolution\nNissan Canton Vehicle Assembly Plant\nHigh-Resolution\nLow-Resolution\nNissan Canton Vehicle Assembly Plant\nHigh-Resolution\nLow-Resolution\nNissan Canton Vehicle Assembly Plant\nHigh-Resolution\nLow-Resolution\nNissan Canton Vehicle Assembly Plant\nHigh-Resolution\nLow-Resolution\nNissan Canton Vehicle Assembly Plant\nHigh-Resolution\nLow-Resolution\nNissan Canton Vehicle Assembly Plant\nHigh-Resolution\nLow-Resolution\nVideos\nTop"
    }
  ],
  "argos_summary": "Honda is reportedly considering a partnership with Nissan to produce body-on-frame pickup trucks in the U.S., leveraging Nissan's excess production capacity. This collaboration aims to help Honda enter the heavier-duty truck market while providing Nissan with a financial boost amidst ongoing tariff challenges. Although the specifics of the truck, likely a rebadged Nissan Frontier, remain unclear, both companies are committed to strategic partnerships following the collapse of their merger talks.",
  "argos_id": "WSDX899TL"
}