{
  "url": "https://www.usmagazine.com/entertainment/news/julie-chen-moonves-calls-ashleys-big-brother-vote-change-too-late/",
  "authorsByline": "Russell Steinberg",
  "articleId": "13bdec172796440a976937b165b57504",
  "source": {
    "domain": "usmagazine.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.usmagazine.com/wp-content/uploads/2025/08/Feature-Big-Brother-Host-Julie-Chen-Moonves-Reacts-to-Ashley-Hollis-Historic-Eviction-Night-Vote-Switch-Attempt.jpg?crop=0px%2C0px%2C2000px%2C1051px&resize=1200%2C630&quality=86&strip=all",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T14:15:51-04:00",
  "addDate": "2025-08-08T18:23:18.988063+00:00",
  "refreshDate": "2025-08-08T18:23:18.988064+00:00",
  "score": 1.0,
  "title": "Julie Chen Moonves Calls Ashley’s Big Brother Vote Change ‘Too Late’",
  "description": "Julie Chen Moonves addresses Ashley Hollis’ attempt to switch her eviction vote during an unprecedented live moment on 'Big Brother'",
  "content": "Big Brother fans were treated to an all-time moment in the show’s 27-season history on Thursday, August 7, during a live eviction episode when houseguest Ashley Hollis cast her vote, then re-entered the diary room to try and change it.\n\n“Too late,” host Julie Chen Moonves told Entertainment Weekly in a story published Friday, August 8. “We didn’t count her change of heart.”\n\nBig Brother 13 winner and current houseguest Rachel Reilly seemed to spark the moment. She cast her vote to evict Kelley Jorgensen, then passed Ashley, 25, in the hallway, where Rachel, 40, appeared to stop and plead for her to vote the same way.\n\nThe conversation, inaudible to TV viewers, lasted far longer than it typically takes between votes, before Ashley finally entered the diary room. When Chen Moonves asked for her vote to evict, Ashley appeared to struggle for several seconds before voting to evict Kelley, 29, over Jimmy Heagerty.\n\nOn the way out, she passed Will Williams, who was about to cast his vote. The two spoke briefly in another unheard conversation before Ashley pivoted and returned to the diary room to change her vote — a Big Brother first.\n\nChen Moonves, stationed outside the house during live episodes, was unable to do anything in the moment but say “no, no, no” into her microphone. It is unclear if Ashley was able to hear her.\n\n“I think Ashley may be one of these people who responds to whoever is the last one to have her ear,” Chen Moonves said Friday. “Ashley’s conversation in the hall with Will after she already voted to evict Kelley influenced her decision and then she tried to change it.”\n\nAs much as Ashley struggled with her decision, Chen Moonves didn’t seem to have much sympathy for her. She said Ashley had the chance for strategic discussions once the nominations were set. The houseguests have several minutes after the weekly Block Buster competition, in which Riley Jeffries removed himself from the chopping block this week, to discuss what to do.\n\n“Everyone must play their own game,” she said. “She could have discussed what to do with her housemates in the house after I announced who remained on the block. That is what that time is for when I lay out and let them be, not when we begin calling people to the diary room.”\n\nAshley’s vote — which Chen Moonves confirmed to viewers was for Kelley’s eviction — ultimately didn’t matter. Jimmy, 25, was ultimately evicted by a 9-2 vote.\n\nBig Brother airs on CBS on Wednesdays, Thursdays and Sundays at 8 p.m. ET. Fans can watch live feeds from the house anytime on Paramount+.",
  "medium": "Article",
  "links": [
    "https://www.usmagazine.com/entertainment/news/big-brother-27-amy-bingham-reveals-why-she-stuck-close-to-rachel-excl/",
    "https://www.usmagazine.com/celebrity-news/news/kelly-clarkson-protected-ex-brandon-blackstock-before-death/",
    "https://www.usmagazine.com/celebrities/julie-chen/",
    "https://news.google.com/publications/CAAqBwgKMM7UwQEwjJAU?hl=en-US&gl=US&ceid=US%3Aen",
    "https://www.usmagazine.com/entertainment/news/the-craziest-big-brother-blindsides-of-all-time-marcellas-and-more/",
    "https://www.usmagazine.com/celebrity-news/news/kelly-clarksons-ex-husband-brandon-blackstock-dead-at-48/",
    "https://ew.com/julie-chen-moonves-reacts-big-brother-player-trying-to-change-vote-exclusive-11787413",
    "https://www.usmagazine.com/entertainment/news/big-brother-27-cast-stuns-in-swimsuit-photo-shoot-excl/",
    "https://www.usmagazine.com/celebrity-moms/pictures/kelly-clarksons-ex-brandon-blackstocks-family-guide-photos/",
    "https://www.usmagazine.com/entertainment/news/julie-chen-moonves-calls-kelley-a-dark-horse-on-big-brother-27/",
    "https://www.usmagazine.com/entertainment/pictures/meet-the-special-forces-worlds-toughest-test-season-4-cast/",
    "https://www.usmagazine.com/entertainment/pictures/big-brother-celebrity-big-brother-winners-through-the-years/",
    "https://apple.news/TdBoH5or6Q0afHo2MxaGA6A",
    "https://lvnta.com/lv_m3tq9XCZYRxUZbugjc",
    "https://www.usmagazine.com/celebrity-news/news/only-a-few-in-kelly-clarksons-circle-knew-of-brandon-blackstocks-cancer/",
    "https://www.usmagazine.com/shows/big-brother/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Chen Moonves",
      "weight": 0.10254808
    },
    {
      "name": "houseguest Ashley Hollis",
      "weight": 0.10185793
    },
    {
      "name": "Julie Chen Moonves",
      "weight": 0.10002319
    },
    {
      "name": "Ashley Hollis",
      "weight": 0.0979228
    },
    {
      "name": "Ashley",
      "weight": 0.097435914
    },
    {
      "name": "host Julie Chen Moonves",
      "weight": 0.09506106
    },
    {
      "name": "Big Brother fans",
      "weight": 0.08743716
    },
    {
      "name": "Big Brother",
      "weight": 0.08604029
    },
    {
      "name": "Ashley’s Big Brother Vote Change",
      "weight": 0.081177205
    },
    {
      "name": "votes",
      "weight": 0.0793375
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.97802734375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.970703125
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.54345703125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.475830078125
    }
  ],
  "sentiment": {
    "positive": 0.072143555,
    "negative": 0.6064453,
    "neutral": 0.32177734
  },
  "summary": "Big Brother host Julie Chen Moonves called Ashley Hollis' change of heart during a live eviction episode, \"Too late,\" referring to her vote to evict Kelley Jorgensen over Jimmy Heagerty. Ashley initially cast her vote for Kelley, but re-entered the diary room to try and change it, a first for a Big Brother first. Rachel Reilly, Big Brother 13 winner and current houseguest, urged Ashley to vote the same way. Despite Chen Moonoves' efforts, Ashley's vote ultimately didn't matter.",
  "shortSummary": "Host Julie Chen Moonves criticized Ashley Hollis for changing her Big Brother vote twice, citing it as \"too late,\" while viewers watched on.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "bf1d59265c67459b80f842198f075363",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usmagazine.com/entertainment/pictures/big-brother-celebrity-big-brother-winners-through-the-years/",
      "text": "Since the U.S. edition of Big Brother premiered in July 2000, the CBS reality game show has become a pop culture phenomenon.\nEach season, viewers dedicate themselves to watching the houseguests’ every move, thanks to not only the TV episodes but also the 24/7 live feeds online as well as countless Twitter accounts and Reddit threads that follow the series day in and day out.\nJulie Chen Moonves has served as the host of Big Brother and all of its editions since day one — even after her husband, Les Moonves, was ousted from his role as CEO of the network in September 2018 over sexual misconduct allegations. (He has denied having any nonconsensual encounters.)\nBig Brother has had multiple iterations since its premiere, including all-stars seasons in 2006 and 2020, a streaming-only version titled Over the Top in 2016 and two celebrity editions so far.\n“I had no idea if it was going to last past season 1,” Chen told CBS Local in July 2018. “And if we did get through season 1, I thought I was going to get fired — the critics didn’t like me, they didn’t like the show. We went through some major changes between season 1 and season 2, and first and foremost we have fans who were extremely loyal ever since season 1.”\nShe added, “We have a lot of fun changing the game so that each year we have our loyal fans coming back, new fans check it out, and here we are! I really don’t see any signs of us slowing down. It’s like an addiction at this point; it’s a guilty pleasure.”\nAnd 20 years in, the show has continued to make history. In February 2019, Tamar Braxton became the first-ever Black winner in the U.S. franchise’s run. Making her victory even sweeter, the R&B singer received a unanimous vote from her former housemates to take home the $250,000 grand prize over former NFL running back Ricky Williams.\nFrom Eddie McGee to Jackson Michie, scroll down to take a look back at every Big Brother, Celebrity Big Brother and Big Brother: Over the Top winner from 2000 to 2022!"
    },
    {
      "url": "https://www.usmagazine.com/entertainment/news/the-craziest-big-brother-blindsides-of-all-time-marcellas-and-more/",
      "text": "The Big Brother motto is “Expect the Unexpected,” and the CBS reality series has served up some satisfying blindsides over the years.\nLiving together in a house cut off from the rest of the world often means that houseguests sniff out exactly who their fellow houseguests plan to vote for on eviction nights. However, contestants sometimes manage to conceal their plans until it’s time to deliver the fatal blow and send someone packing.\nKeep scrolling for a look back at the craziest blindsides in Big Brother history:\nMarcellas — Season 3\nThe Power of Veto may have been a new development in season 3, but that hasn’t stopped Marcellas Reynolds’ use of it — or lack thereof — from going down as one of the worst moves in Big Brother history.\nDuring week 9 of the 2002 season, Marcellas was nominated for eviction alongside Amy Crews. He then won the Power of Veto, giving him the opportunity to take himself off the block. However, he decided not to use the power, feeling certain that Amy would be evicted over him.\nMarcellas’ ally Danielle Reyes then voted to evict him and Head of Household Jason Guy cast the tie-breaking vote sealing his fate. Marcellas was so unprepared to leave the house that he quickly grabbed some of his clothes from a dresser before he walked out.\nEven Big Brother host Julie Chen Moonves couldn’t resist reproaching Marcellas for the foolish move; she playfully hit him on the head during his exit interview.\nDr. Will — Season 7\nDr. Will Kirby is widely regarded as one of the best Big Brother players of all time, but even he can be surprised. During the show’s first all-stars season in 2006, Will formed an alliance with Janelle Pierzina based largely on flirting.\nAt final four, Janelle and Erika Landin realized that Will and Mike “Boogie” Malin were using them to further their own games and had no real loyalties to anyone but each other. When Janelle won the final Veto competition of the season, she cast the sole vote to evict Will, taking both him and Mike by surprise.\nKeesha — Season 10\nKeesha Smith fully trusted in her final three deal with Dan Gheesling and Memphis Garrett during the 2008 season. What she didn’t know was that Dan and Memphis had formed the Renegades alliance early in the game and intended to bring each other to the finals.\nAt final four, Memphis won the last Power of Veto competition, allowing him to cast the sole eviction vote. He and Dan decided to keep Jerry MacDonald over Keesha, feeling that Jerry was less of a physical threat.\nKeesha was shocked and hurt when she learned about the plan. “Whoever the f–k sends me out of here better not think that they’re getting my vote, that’s for damn sure!” she yelled.\nShane — Season 14\nAfter winning season 10, Dan returned as a coach in 2012. During week 3 of the season, the coaches were given an opportunity to play as individuals, and Dan, Mike, Janelle and Brittany Haynes then entered the game.\nDan went on to play even more ruthlessly than he had the first time around. At final four, he pulled off the biggest blindside of the season by convincing his No. 1 ally Danielle Murphree to leave her showmance partner, Shane Meany, on the block after she won both Head of Household and the Power of Veto. Dan told Danielle that he would use his sole vote to evict Ian Terry, but he voted against Shane instead, leaving both Shane and Danielle in shock.\nAustin — Season 17\nAustin Matelson joined the ranks of Big Brother players betrayed by those closest to him during the 2015 season. He and Vanessa Rousso made a final two deal during week one, but that didn’t stop Vanessa from casting the sole vote to evict Austin at final five.\nAustin was so sure that Vanessa would keep him safe that he didn’t wear shoes to the eviction ceremony. He walked out of the house barefoot after telling Vanessa that she didn’t have the jury votes to win the game.\nPooch — Season 24\nJoe “Pooch” Pucciarelli felt so confident about his position in the house that he volunteered to go on the block next to Taylor Hale — who went on to win the season — when Jasmine Davis was Head of Household in July 2022.\nAlthough Pooch was initially a pawn, Jasmine and her Girls Girls alliance decided to shift the target onto him after learning that Pooch was aligned with several of the men in the house, including Daniel Durston and Kyle Capener.\nDespite thinking he was safe, Pooch was unanimously evicted by a 12-0 vote on eviction night, and the term “getting pooched” became a running gag for the rest of the season.\n“For it to be 12-0 is shocking. I thought I would have heard from one person, but obviously, they were all on the same page,” Pooch told Chen Moonves after his elimination. “When I heard 12-0 I genuinely felt, ‘Oh cool, I’m straight.’”\nHisam — Season 25\nHisam Goueli thought his third week in the Big Brother house would be smooth sailing when his Professors alliance member Felicia Cannon became Head of Household in August 2023. He had no idea that Felicia was planning to backdoor him, meaning nominate him for eviction after the Veto Competition was played so he didn’t even have a chance to compete for his safety.\nTo make matters worse, Hisam told his alliance members that he didn’t want any of them to pick him to play for the Veto since he had already won too many competitions.\nHisam was stunned when Felicia named him as the replacement nominee after Jag Bains won the Power of Veto and took himself off the block. After Hisam was unanimously evicted days later, he exclusively told Us Weekly it was “hard not to feel betrayed” by his alliance members.\n“I’m devastated. Of course I’m hurt,” he said. “You go back to the conversations you [had] and you’re realizing people are telling you things that are not true and you believe them because you trust them.”"
    },
    {
      "url": "https://www.usmagazine.com/entertainment/news/big-brother-27-cast-stuns-in-swimsuit-photo-shoot-excl/",
      "text": "The Big Brother 27 cast took to the backyard for the legendary swimsuit photoshoot.\nAll 17 houseguests soaked up the sun as they posed in their swimwear in Us Weekly’s exclusive first look. The women dazzled in a variety of beach-ready styles, from bikinis to one-pieces. The guys rocked board shorts, with some opting to cover up while others went shirtless.\nBig Brother icon Rachel Reilly brought the fire as she stunned in a red ruffled one-piece. She completed the look with a pair of shades. While Reilly, 40, is a Have Not during the first week, she was granted safety from eviction. Cliffton “Will” Williams, Zach Cornell and Ava Pearl were also named Have Nots but also received immunity.\nWill, 50, kept it laid back as he opted for a black polo and shades. Zach, 27, was all smiles in his salmon shorts and sunglasses. Ava, 24, brought the good vibes as she stunned in a red long-sleeved one-piece with cutouts. The aura painter completed the look with a floppy sun hat with a sunflower in its brim.\nHead of Household (HOH) Vince Panaro wore striped shorts and a brown beanie. He went sans shirt to show off his tatted arm. Vince’s nominees — Amy Bingham, Ashley Hollis and Isaiah “Zae” Frederich — were in good spirits as they were all smiles for the camera.\nAmy, who successfully entered the game after being undetected as The Mastermind’s accomplice, wore a red halter swimsuit top paired with a black sarong. Zae, 23, donned blue swim shorts, sunglasses and slides. (The salesperson made headlines earlier this week after he used a slur on the live feeds but immediately backtracked his comment.)\nWhile Ashley, 25, has been under fire all week after taking a two-hour-long shower in the HOH room, she brought the heat with her swimwear photo. The attorney wore a magenta bikini and a multicolor sarong. She gave a sweet smile as she posed on a lounge chair.\nKatherine Woodman, Kelley Jorgensen, Mickey Lee, Lauren Domingue and Morgan Pope showed off their toned physique in their bikinis. Adrian Rocha and Rylie Jeffries opted to go shirtless. Keanu Soto and Jimmy Heagerty kept it cool with a tank and shorts combo.\nBig Brother 27 kicked off on Thursday, July 10. As the players have settled into the Big Brother house, they’re gearing up to vote out the first person of the season. The nominees not only have the Power of Veto in play but also the BB Blockbuster, this season’s version of the AI Arena from last year. On eviction night, the three nominees will compete in a live competition to be removed from the block.\nBig Brother continues on CBS tonight with a 90-minute episode starting at 8 p.m. ET. Fans can watch live feeds from the house anytime on Paramount+."
    },
    {
      "url": "https://www.usmagazine.com/entertainment/news/big-brother-27-amy-bingham-reveals-why-she-stuck-close-to-rachel-excl/",
      "text": "Amy Bingham walked into the Big Brother house as the Mastermind’s accomplice — but she left as a member of the “Mom Squad” alongside Rachel Reilly.\n“I love Rachel. I think she’s a sweet person. I was grateful she was in the house,” Amy, 43, exclusively told Us Weekly on Friday, July 25, following her eviction. “Just having someone closer in age and a mother just made me feel better being in the house because nobody really understands like missing your kids.”\nAmy added that it was “nice to have” Rachel, 40, by her side in the house for those hard moments. However, their fast friendship put a target on Amy’s back right away.\n“I was happy to have her there until it was bad for my game,” she said.\nAmy acknowledged that she knew from a “strategic” perspective, she “should have distanced herself” from Rachel. However, both she and her son had a feeling before going into the Big Brother house that the friendships she would make would be her downfall.\n“I was like, ‘Oh my gosh, I’m gonna be a target because of the friends I make in the house.’ And my son even told me, ‘Ma, I’m so afraid you’re gonna make friends with the wrong people in the house. That’s gonna be your downfall,” she told Us. “And he called it, he knew it, but I can’t help it. I’m a loyal friend in real life. I’m a loyal friend in the game. I don’t know how to be anything else. It’s just who I am.”\nEven trying to hide a close connection is a struggle for Amy.\n“I don’t even know how to do that. I don’t know how to keep things under wraps,” the insurance agent quipped.\nAmy was voted out of the game on Thursday, July 24, in a unanimous vote. While Amy was “surprised” Rachel and fellow ally Ashley Hollis didn’t throw her a vote to keep her, she understands why they ultimately went with the house.\n“They didn’t tell me that they weren’t gonna vote for me. I thought they would vote for me, but it didn’t matter,” she said. “I don’t care about stuff like that. Save your game. I’m already out. I don’t need a vote or two. It really doesn’t matter to me.”\nWhen Amy walked out the door, she candidly called Jimmy Heagerty — the Head of Household who put her on the block — a “snake.” Amy explained she decided to take that moment to share her true thoughts about Jimmy and the “lies” he’s spread.\n“I wanted to call him out so much throughout the show … It was hard to watch him lie and listen to his lies. Like, I really was struggling,” she told Us. “He is charismatic and funny. I’ll give him that and he is so fun to be around. So he has that going for him.”\nBig Brother airs on CBS on Wednesdays, Thursdays and Sundays at 8 p.m. ET. Fans can watch live feeds from the house anytime on Paramount+."
    },
    {
      "url": "https://news.google.com/publications/CAAqBwgKMM7UwQEwjJAU?hl=en-US&gl=US&ceid=US%3Aen",
      "text": "- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nBefore you continue to Google\nWe use cookies and data to\n- Deliver and maintain Google services\n- Track outages and protect against spam, fraud, and abuse\n- Measure audience engagement and site statistics to understand how our services are used and enhance the quality of those services\nIf you choose to “Accept all,” we will also use cookies and data to\n- Develop and improve new services\n- Deliver and measure the effectiveness of ads\n- Show personalized content, depending on your settings\n- Show personalized ads, depending on your settings\nIf you choose to “Reject all,” we will not use cookies for these additional purposes.\nNon-personalized content is influenced by things like the content you’re currently viewing, activity in your active Search session, and your location. Non-personalized ads are influenced by the content you’re currently viewing and your general location. Personalized content and ads can also include more relevant results, recommendations, and tailored ads based on past activity from this browser, like previous Google searches. We also use cookies and data to tailor the experience to be age-appropriate, if relevant.\nSelect “More options” to see additional information, including details about managing your privacy settings. You can also visit g.co/privacytools at any time."
    },
    {
      "url": "https://www.usmagazine.com/entertainment/news/julie-chen-moonves-calls-kelley-a-dark-horse-on-big-brother-27/",
      "text": "Big Brother host Julie Chen Moonves has an opinion on the state of the Big Brother 27 house — and it’s probably not what fans are expecting.\n“I think Kelley [Jorgensen] has become the dark horse,” Chen Moonves, 55, told Entertainment Weekly in an interview published Friday, August 1. “As long as the BB Block Buster exists, she can keep this going. She is good at comps and focused.”\nKelley, 29, has caught the ire of Big Brother fans for volunteering to be nominated for eviction each week of the game so far. In weeks 1 and 3, she won the BB Block Buster competition on eviction night to earn her safety, and in Week 2, was able to win an individual power of veto competition to save her game.\nIn the Week 3 eviction, which aired Thursday night, July 31, Kelley’s win resulted in Adrian Rocha being evicted in an emotional 8-4 vote. Adrian, 23, is a Big Brother superfan, and on his way out the door, accused his fellow houseguests of playing scared in the game’s early weeks.\nChen Moonves agreed, with one notable exception.\n“I think he had the assessment right,” she said. “I do agree that no one but Kelley is taking risks and playing hard.”\nCompare that to some of the criticism Kelley has faced from former Big Brother houseguests.\n“Im sick I wanted Kelley Gone #bb27,” Big Brother 19 winner Josh Martinez wrote via X after Kelley saved her game on Thursday.\n“I think that dummy Kelley will go home tonight,” Big Brother 8 winner Dick Donato added. “And that’s what she gets for volunteering to be on the block. And even dumber thinking volunteering to be on the block would ‘help her resume.’”\n“This bish has Happy Gilmore level luck,” wrote Big Brother 20’s Angela “Rockstar” Lantry.\nWhile Chen Moonves defended Kelley, she still had sympathy for Adrian, who told fans before the season about the extensive training he put himself through to prepare for the Big Brother house. That included sleeping on the floor to simulate being a “Have Not,” and building his own version of common competitions in his backyard.\nWhile in the house, he often spoke about how he was playing the game for his family, hoping to win the $750,000 grand prize to help them.\n“Everyone knows Adrian is a good kid who loves the game, came to the house for his family and has no enemies,” Chen Moonves said. “They were gutted knowing he was going to get evicted. They didn’t want to hurt him, but it’s the nature of the game.”"
    },
    {
      "url": "https://www.usmagazine.com/shows/big-brother/",
      "text": "Big Brother\nBig Brother, hosted by Julie Chen Moonves, premiered on CBS in July 2000 and features a group of contestants competing against one another in strategic and physical challenges for the grand prize of $750,000.\nThe contestants — also known as houseguests — have no contact with the outside world after moving into the Big Brother house, which is equipped with 94 cameras and 113 microphones monitoring their every move for 100 days. Each week, Big Brother challenges its stars with new tasks and twists as they compete to be named Head of Household or secure the Power of Veto, determining who will be evicted from the house. A group of eliminated houseguests form the Jury, which ultimately chooses the winner when two contestants remain. Viewers are also able to vote for America’s Favorite Houseguest, which was introduced in 2007 and awards $25,000 to the fan-favorite player.\nThe Big Brother franchise originated in Europe in the ‘90s. As of summer 2023, the show airs in 63 countries around the world. The U.S. edition is the longest-running in the franchise to date. Notable winners through the years include season 1’s Eddie McGee, season 10’s Dan Gheesling, season 13’s Rachel Reilly, season 18’s Nicole Franzel and more."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/kelly-clarksons-ex-husband-brandon-blackstock-dead-at-48/",
      "text": "Kelly Clarkson’s ex-husband, Brandon Blackstock, died on Thursday, August 7. He was 48.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away. Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family,” a rep for the family said in a statement to Us Weekly. “We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time.”\nOne day earlier, while explaining her decision to halt her Las Vegas residency, Clarkson revealed that Blackstock was suffering from an illness, though she did not specify the exact condition at the time.\n“Unfortunately, I need to postpone the remainder of the August Studio Session dates in Las Vegas,” she said in a statement shared via Instagram on Wednesday, August 6. “While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them. I am sincerely sorry to everyone who bought tickets to the shows and I so appreciate your grace, kindness and understanding.”\nPrior to his relationship with Clarkson, Blackstock was married to Melissa Ashworth from 2001 to 2012. The pair welcomed daughter Savannah in June 2002 and son Seth in November 2006. (Blackstock later became a grandfather in January 2022 when Savannah gave birth to her first baby, son Lake, with Quentin Lee. She announced in July 2025 that she is pregnant with the couple’s second baby.)\nClarkson and Brandon — whose father was her former manager Narvel Blackstock — began dating in February 2012 and tied the knot one year later in October 2013. The pair welcomed daughter River in June 2014 and son Remington in April 2016. During their marriage, Brandon served as Clarkson’s manager.\nIn June 2020, Clarkson filed for divorce from Brandon after nearly seven years of marriage. The exes finalized the proceedings in March 2022, and Clarkson was granted primary custody of their two children. (The twosome had a messy battle in court over property and finances.)\nIn January 2024, Clarkson reflected on her divorce from Brandon, revealing that their marriage was not her idea.\n“I never wanted to get married the first time,” she told People. “[Brandon] had children, a religious background, and it was important, I think, for him. But I’ve never been that person.”\nClarkson explained that her hesitancy stemmed from what she’d seen her loved ones deal with, adding, “Because I’ve been through a couple divorces in my family, I just don’t like to put any weight on it.”\nIn March, Clarkson shared a rare glimpse into her coparenting dynamic with Brandon during an appearance on Kylie Kelce’s “Not Gonna Lie” podcast.\nWhile discussing kids’ double standards for their mothers and fathers, she sarcastically confessed, “There’s a lot that I keep in … because coparenting is fun.”\nBlackstock is survived by River and Remington and his two older children, Savannah and Seth."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/only-a-few-in-kelly-clarksons-circle-knew-of-brandon-blackstocks-cancer/",
      "text": "Kelly Clarkson has put her family first amid ex-husband Brandon Blackstock’s private cancer battle, with a source shedding light into how she’s been coping.\n“Kelly’s work schedule has been difficult over the last few months as she needed to take care of her kids,” a source exclusively tells Us Weekly. “She needed the time off as her kids come first. It’s terrible and sad.”\nClarkson, 43, and Blackstock shared daughter River Rose, 10, and son Remington, 8.\n“Kelly is a great mom and has needed to be there for her kids,” the insider adds, noting that “only a few people in Kelly’s circle” and “a handful of her show’s team” were aware of “what was going on behind the scenes” with Blackstock.\nUs confirmed on Thursday, August 7, that Blackstock died at the age of 48.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away,” a family spokesperson said in a statement. “Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family.”\nThe statement concluded, “We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time.”\nIn addition to River Rose and Remington, Brandon is survived by father Narvel Blackstock, eldest children Savannah and Seth from his first marriage, and his grandchildren. (Savannah announced last month that she is expecting her second baby with husband Quentin Lee.)\nClarkson postponed the remainder of her August concert dates in light of Brandon’s death.\n“Unfortunately, I need to postpone the remainder of the August Studio Session dates in Las Vegas,” Clarkson wrote in a Wednesday, August 6, statement shared via social media. “While I normally keep my personal life private, this past year, my children’s father has been ill and, at this moment, I need to be fully present for them. I am sincerely sorry to everyone who bought tickets to the shows, and I so appreciate your grace, kindness and understanding.”\nClarkson, who started her Studio Sessions residency in Las Vegas in July, was married to Brandon from 2013 to 2020. They settled their divorce two years later in 2022 with plans to amicably raise River and Remington.\n“She has a great coparenting relationship with Brendan, but things haven’t always been easy in terms of their personal relationship,” a second source told Us in 2023. “They’ve come a long way and are handling things with their kids really well.”"
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/kelly-clarkson-protected-ex-brandon-blackstock-before-death/",
      "text": "Kelly Clarkson kept her children front of mind while navigating her late ex-husband Brandon Blackstock‘s secret cancer battle, a source exclusively tells Us Weekly.\n“Even though they went through an acrimonious divorce, Kelly made a conscious decision to protect Brandon’s privacy until the very end for the sake of their family,” the source explains.\n“He’d been sick for a while, but his health really took a turn for the worse earlier this year. That’s why she was MIA from her talk show,” the source continues, referencing Clarkson’s unexplained two-week absence from The Kelly Clarkson Show in late February and early March. “Out of respect, Kelly chose not to say anything publicly until it became clear this week that Brandon wasn’t going to make it.”\nUs Weekly has reached out to Clarkson’s rep for comment.\nBlackstock died on Thursday, August 7, just hours after Clarkson, 43, revealed in a social media post that he had been sick. He was 48.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away,” a rep for the Blackstock family said in a statement to Us. “Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family. We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time.”\nThe night before, Clarkson announced she had to postpone the next four dates of her Las Vegas residency, Studio Sessions, due to Blackstock’s health issues, though she did not disclose what kind of illness he had.\n“While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them,” she wrote, referencing the former couple’s 11-year old daughter, River Rose, and 9-year-old son, Remington “Remy” Alexander.\n“I am sincerely sorry to everyone who bought tickets to the shows,” the American Idol alum continued, “and I so appreciate your grace, kindness and understanding.”\nClarkson and Blackstock married in October 2013. They welcomed River and Remy in June 2014 and April 2016, respectively. (The former talent manager also shared 23-year-old daughter Savannah and 18-year-old son Seth with his ex-wife Melissa Ashworth.)\nAfter nearly seven years of marriage, Clarkson filed for divorce from Blackstock in June 2020. She was awarded primary physical custody of their kids that November while the exes continued to battle in court over other issues, including child and spousal support as well as ownership of their Montana ranch. They ultimately finalized their divorce in March 2022.\nBy that May, Clarkson swore off remarrying, saying on her talk show, “I will never get married again. Not because I don’t believe in love. I think love is beautiful. I just … that didn’t suit me.”"
    },
    {
      "url": "https://ew.com/julie-chen-moonves-reacts-big-brother-player-trying-to-change-vote-exclusive-11787413",
      "text": "Julie Chen Moonves reacts to Big Brother player trying to change eviction vote (exclusive) Nice try, Ashley. By Dalton Ross Dalton Ross California Dreams was better than Saved by the Bell. There, I said it. EW's editorial guidelines Published on August 8, 2025 07:44AM EDT 1 Comment Julie Chen Moonves and Ashley Hollis on 'Big Brother' season 27. Credit: cbs Each week, Big Brother host Julie Chen Moonves will weigh in on the latest events inside the house exclusively with Entertainment Weekly. This week, she reacts to Mickey taking out an ally, Ashley hilariously trying to change her vote, Jimmy leaving the house, and the full-blown showmance between Rylie and Katherine. Julie Chen Moonves on 'Big Brother' season 27. Matthew Taplinger/CBS ENTERTAINMENT WEEKLY: Mickey just sent one of her biggest allies out of the house instead of nominating Vince, who Morgan even told her was \"my number one guy\" — which would seem to be even more of a reason to get rid of him. Make it make sense for me! JULIE CHEN MOONVES: What you may or may not be able to make out by watching the show is how universally liked Vince is in the house. He has done an excellent job of making himself seem loyal to so many of his housemates and he doesn't come across as threatening. He seems like a harmless, likable loyal housemate. I think with Mickey nominating Jimmy it was the disloyalty she felt like he personally betrayed her (and Morgan). She found out he was playing with others as if he was aligned with them and only them. On top of that, when he was HOH. he didn't consult Mickey (or Morgan) about his nominations or moves and he spent an awful lot of time laughing and bonding in the HOH room with Katherine and Lauren. This was a woman scorned move. It became personal. Mickey Lee on 'Big Brother' season 27. cbs Oh, the drama, Julie! We have to talk about Rachel convincing Ashley to vote out Kelley, and Ashley then leaving the Diary Room, talking to Will, and running back in attempting to change her vote to Jimmy. Tell me about the decision to let those conversations in the hallway play out, and then not allowing Ashley to change her already cast vote. I think Ashley may be one of these people who responds to whoever is the last one to have her ear. Ashley's conversation in the hall with Will after she already voted to evict Kelley influenced her decision and then she tried to change it. Too late. We didn't count her change of heart. Everyone must play their own game. She could have discussed what to do with her housemates in the house after I announced who remained on the block. That is what that time is for when I lay out and let them be, not when we begin calling people to the diary room. Ashley Hollis on 'Big Brother' season 27. cbs 'Big Brother' star Adrian Rocha is shocked to learn actual eviction votes The Mastermind from 'Big Brother' speaks in exclusive interview Now that he is out of the house, what's your take on Jimmy's overall game this season and why he was out there talking to you this week? Jimmy is not the first person to play more than one side of the house. This season alone we see so many people doing that… Morgan, Vince, Zach to name a few. He, unfortunately, got busted by Mickey while she had all the power and he was never given the chance to explain himself or apologize or work out some kind of deal to save his game. It was the perfect storm that did him in more than his overall gameplay. Jimmy Heagerty on 'Big Brother' season 27. cbs Finally, we have our first big showmance of the season. What do you make of Rylie and Katherine's connection inside the house? I think it's adorable. I like that they got to know each other first as friends and got to show each other that their feelings for one another are more important than the game. Rylie was ready to sacrifice his game for Katherine. Be sure to watch BB Unlocked Friday night when you will get to see never before seen video of these two taking their relationship to a new level! Katherine Woodman and Rylie Jeffries on 'Big Brother' season 27. CBS Sign up for Entertainment Weekly's free daily newsletter to get breaking news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more. Close View comments Read more: TV"
    }
  ],
  "argos_summary": "During a live eviction episode of Big Brother 27, houseguest Ashley Hollis attempted to change her vote after initially deciding to evict Kelley Jorgensen, marking a first in the show's history. Host Julie Chen Moonves confirmed that Ashley's change of heart was not counted, emphasizing that players must make their decisions during the designated time. Ultimately, Jimmy Heagerty was evicted by a 9-2 vote, despite Ashley's efforts to influence the outcome.",
  "argos_id": "X1DGNPAE9"
}