{
  "url": "https://www.usatoday.com/picture-gallery/sports/2025/08/08/historic-firsts-for-women-in-sports/85574441007/",
  "authorsByline": "David Baratz",
  "articleId": "7d0c08b25bbf4c938f8aed813107d6d5",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/08/USAT/85575363007-2024-caitlin-clark.jpg?crop=1001,563,x1347,y562&width=1001&height=563&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T18:35:11+00:00",
  "addDate": "2025-08-08T18:46:02.180644+00:00",
  "refreshDate": "2025-08-08T18:46:02.180646+00:00",
  "score": 1.0,
  "title": "Game changers: Celebrate historic firsts for women in sports",
  "description": "Celebrate women who broke barriers in sports to change the game.",
  "content": "2025: Jen Pawol becomes the first woman to be an umpire in a regular-season MLB game. Rich Storry, Getty Images\n\n2024: Jessica Campbell becomes the first woman to coach in the NHL as an assistant coach for the Seattle Kraken. Steph Chambers, Getty Images\n\n2021: Kim Ng joins becomes the first female MLB general manager in MLB history, overseeing the Miami Marlins. Michael Reaves, Getty Images\n\n2020: Alyssa Nakken becomes the first full-time female coach in MLB history when she was promoted to the Giants’ major league coaching staff. Jayne Kamin-Oncea, Getty Images\n\n2015: Sarah Thomas becomes the first full-time female official in NFL history. Scott Halleran, Getty Images\n\n2015: Jen Welter becomes the first female to coach in the NFL when she served as a coaching intern for the Arizona Cardinals. Christian Petersen, Getty Images\n\n2013: Becky Hammon becomes the first full-time female NBA assistant coach when she joined the San Antonio Spurs. Soobum Im, Imagn Images\n\n2012: The London Olympic Games were the first Olympics where every participating country included female athletes. Kirill Kudryavtsev, AFP Via Getty Images\n\n2009: Basketball legend Pat Summittbecomes the first NCAA coach (men or women) to reach 1,000 wins. Saul Young, The Knoxville News Sentinel Via USA TODAY Network\n\n2008: Danica Patrick becomes the first woman to win an IndyCar race. Jonathan Ferrey, Getty Images\n\n2003: Annika Sörenstam is the first woman in 58 years to compete in a PGA Tour event, playing at the Colonial Invitational. Andy Lyons, Getty Images\n\n1997: The WNBA (Women's National Basketball Association) inaugural season begins June 21, 1997 with the New York Liberty facing off against the Los Angeles Sparks. Brian Bahr, Getty Images\n\n1992: Manon Rheaume plays in for the Tampa Bay Lightning in an NHL preseason game against the St. Louis Blues B Bennett, Getty Images\n\n1991: The firstFIFA Women’s World Cup is held in China. Team USA won the inaugural tournament. Tommy Cheng, AFP Via Getty Images\n\n1977: Janet Guthrie becomes the first woman to qualify and compete in the Indianapolis 500 and Daytona 500. George Tilford, IndyStar\n\n1976: Women's basketball was introduced to the Olympic program for the first time. ABC Photo Archives, Disney General Entertainment Content Via Getty Images\n\n1967: Kathrine Switzer becomes the first woman to officially run the Boston Marathon (despite attempts to remove her while she was running in the race). Paul Connell, Boston Globe Via Getty Images",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/sports/",
    "https://www.usatoday.com/staff/2648011001/david-baratz/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Getty Images",
      "weight": 0.12615164
    },
    {
      "name": "first",
      "weight": 0.10981743
    },
    {
      "name": "Imagn Images",
      "weight": 0.09310472
    },
    {
      "name": "women",
      "weight": 0.08643557
    },
    {
      "name": "the first female MLB general manager",
      "weight": 0.07258518
    },
    {
      "name": "Andy Lyons, Getty Images",
      "weight": 0.071024455
    },
    {
      "name": "Brian Bahr, Getty Images",
      "weight": 0.071024455
    },
    {
      "name": "Christian Petersen, Getty Images",
      "weight": 0.071024455
    },
    {
      "name": "Rich Storry, Getty Images",
      "weight": 0.071024455
    },
    {
      "name": "Steph Chambers, Getty Images",
      "weight": 0.071024455
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9970703125
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.9404296875
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.323486328125
    }
  ],
  "sentiment": {
    "positive": 0.20581055,
    "negative": 0.22436523,
    "neutral": 0.5698242
  },
  "summary": "The first women's rights have been celebrated in sports, with notable achievements such as Jen Pawol becoming the first woman to be an umpire in a regular-season MLB game in 25 years. Jessica Campbell became the first female to coach in the NHL as an assistant coach for the Seattle Kraken. Kim Ng becomes the first full-time female MLB general manager in MLB history, overseeing the Miami Marlins. Alyssa Nakken became the highest-profile female coach in MLB in 2020. In 2015, Sarah Thomas became the only full-term female official in NFL history, following Jen Welter as an NFL coaching intern for the Arizona Cardinals. Other notable achievements include the first NCAA coach (men or women) to reach 1,000 wins, and Danica Patrick becoming the only woman to win an IndyCar race in 2008.",
  "shortSummary": "A historic firsts in sports, including Jen Pawol becoming the first woman to umpire in a regular-season MLB game, Jessica Campbell, and Sarah Thomas in NFL history.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1a69ea9f9648417381e39d528ce908fc",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The article highlights significant milestones for women in sports, showcasing their groundbreaking achievements over the years. Notable events include Jen Pawol becoming the first female umpire in MLB history in 2025, Jessica Campbell as the first woman to coach in the NHL in 2024, and Kim Ng as the first female MLB general manager in 2021. Other milestones include the first full-time female officials and coaches in various sports, as well as the inclusion of female athletes in the Olympics.",
  "argos_id": "XJJSB6BOD"
}