{
  "url": "https://www.dailymail.co.uk/galleries/article-14984379/US-envoys-fury-Starmer-Gaza.html",
  "authorsByline": "Mark Nicol",
  "articleId": "50c07fbe4f61466b89b5b9c135f86b48",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/08/20/100928215-0-The_United_Nations_said_that_further_occupation_in_Gaza_is_deepl-a-30_1754682197726.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-08T21:17:24+01:00",
  "addDate": "2025-08-08T20:20:09.160446+00:00",
  "refreshDate": "2025-08-08T20:20:09.160448+00:00",
  "score": 1.0,
  "title": "US envoy's fury at Starmer over Gaza",
  "description": "After the Prime Minister warned Israel's latest escalation would 'only bring more bloodshed', Mike Huckabee likened the country's situation to Britain in World War Two.",
  "content": "Sir Keir Starmer has come under fire from the US's ambassador to Israel after criticizing plans that will leave one million Gazans displaced. After the Prime Minister warned Israel's latest escalation would 'only bring more bloodshed', Mike Huckabee likened the country's situation to Britain in World War Two. The extraordinary attack coincided with US Vice President JD Vance 's visit to Britain and highlighted the rift between America and the UK on the Middle East crisis. It also came after Sir Keir announced last month how the UK will recognize a Palestinian state unless Israel takes steps to alleviate the humanitarian crisis and end the conflict in Gaza .\n\nAmbassador Huckabee said on X: 'So Israel is expected to surrender to Hamas and feed them even though Israeli hostages are being starved? 'Did the UK surrender to Nazis and drop food to them? Ever heard of Dresden, PM Starmer? That wasn't food you dropped. If you had been PM then UK would be speaking German!' Huckabee's remarks appeared to challenge Israel's obligation to provide food and humanitarian relief to Palestinians who are suffering from malnutrition. According to the World Health Organization around 12,000 children in Gaza under the age of five were acutely malnourished at the end of July, the highest number on record.\n\nThe number of Palestinians believed to have starved to death since the beginning of Israel's siege has also risen to 197 people, including 96 children. Even US President Donald Trump, a strong supporter of Israel, has been moved to comment disapprovingly on pictures of starving children that have recently been published. Ambassador Huckabee, who was appointed by President Trump, reacted to a post on X by Sir Keir describing the Israeli government's proposals as 'wrong'. The Prime Minister wrote: 'We urge it [Israel] to reconsider immediately. Every day the humanitarian crisis in Gaza worsens and hostages taken by Hamas are being held in appalling and inhumane conditions. We need a ceasefire now.'\n\nSir Keir's remark about the escalation likely leading to 'more bloodshed' was included in an official statement released by Downing Street earlier today. Ambassador Huckabee referenced Britain's bombing of the German city of Dresden in February 1945 which caused as many as 25,000 civilian deaths. This was a joint operation by the RAF's Bomber Command and the US's Army Air Forces. More than 3,900 tons of high explosive ordnance were dropped causing sickening devastation to civilian areas. The details of Israel's latest offensive emerged today, including giving more than one million people in Gaza city and the surrounding area until October 7th to leave or face military action.\n\nThe deadline for their forcible relocation will mark the second anniversary of the Hamas terrorist atrocities of October 7th 2023. The UK was joined by international partners in condemning the plans, including Germany, one of Israel's biggest benefactors in recent years, which suspended arms sales. Senior Israeli military figures have also criticized the plan, proposed by Prime Minister Benjamin Netanyahu, to occupy the remaining quarter of the Gaza Strip. Israeli generals have described the move as a 'trap', while families of the 20 hostages remaining in Hamas custody have highlighted the increased threat to their safety. Some relatives of hostages support the plan.\n\nAid agencies, Arab countries, the United Nations and Prime Minister Netanyahu's political opponents inside Israel have also raised concerns. Among regional and Western powers, only the United States has desisted from criticizing the plan. Earlier this week, President Trump said it was 'pretty much up to Israel' whether to fully occupy Gaza. In a bid to stave off further international outcry, Prime Minister Netanyahu posted: 'We are not going to occupy Gaza. We are going to free Gaza from Hamas.\n\n'Gaza will be demilitarized and a peaceful civilian administration will be established, one that is not the Palestinian Authority, not Hamas, and not any other terrorist organization. 'This will help free our hostages and ensure Gaza does not pose a threat to Israel in the future.' The UK provides financial and technical support to the Palestinian Authority, including £129 million in development assistance in this financial year. It comes as António Guterres, the UN secretary general, described the Israeli plans as a 'dangerous escalation' as several countries reportedly requested a Security Council meeting to discuss the situation.\n\nJD Vance, the US vice-president, said Washington has 'some disagreement' with Mr Netanyahu over the strategy, but that the administration shared Israel's objectives. Meanwhile, Germany has said it will stop arms sales to Israel until further notice. IDF military chief Eyal Zamir had voiced opposition to reoccupying Gaza. A source in the Prime Minister's Office told The Jerusalem Post that Zamir was passed a message that read: 'If this does not suit you, then you should resign.' Israeli officials described a meeting this week with the head of the military as tense, saying Zamir had pushed back on expanding Israel's campaign.\n\nTwo government sources said any resolution by the security cabinet would need to be approved by the full cabinet, which may not meet until Sunday. Among the scenarios considered ahead of the security meeting was a phased takeover of areas in Gaza not yet under military control, one of the sources said, speaking on condition of anonymity. Evacuation warnings could be issued to Palestinians in specific areas of Gaza, potentially giving them several weeks before the military moves in, the source added. Total control of the territory would reverse a 2005 decision by Israel by which it withdrew Israeli citizens and soldiers from Gaza, while retaining control over its borders, airspace, and utilities.\n\nRight-wing parties blame that withdrawal decision for the militant Palestinian group Hamas gaining power there in a 2006 election. It was unclear whether Netanyahu was foreseeing a prolonged takeover or a short-term operation. Hamas said in a statement that Netanyahu's comments were 'a blatant coup' against the negotiation process. 'Netanyahu's plans to expand the aggression confirm beyond any doubt that he seeks to get rid of his captives and sacrifice them,' the statement said.\n\nArab countries would 'only support what Palestinians agree and decide on,' a Jordanian official source told Reuters, adding that security in Gaza should be handled through 'legitimate Palestinian institutions.' Hamas official Osama Hamdan told Al Jazeera the group would treat any force formed to govern Gaza as an 'occupying' force linked to Israel. The White House had no immediate comment. President Donald Trump has declined to say whether he supported or opposed a potential complete military takeover of Gaza by Israel. The U.N. has called reports about a possible expansion of Israel's military operations in Gaza 'deeply alarming' if true.\n\nThe idea, pushed by far-right ministers in Netanyahu's coalition, of Israeli forces moving into areas they do not already hold in the enclave has also generated alarm in Israel. Outside the prime minister's office in Jerusalem on Thursday evening, hundreds of demonstrators protested against an expanded war, demanding an immediate end to the military campaign in return for the release of all the hostages. There are 50 hostages still held in Gaza, of whom Israeli officials believe 20 are alive. Most of those freed so far emerged as a result of diplomatic negotiations. Talks toward a ceasefire that could have seen more hostages released collapsed in July.\n\nRecent images of starving children from Gaza have also shocked the world and fueled international criticism of Israel over the sharply worsening conditions in the enclave. The Israeli military says it controls about 75% of Gaza. Most of Gaza's population of about 2 million has been displaced multiple times over the past 22 months, and aid groups are warning that residents are on the verge of famine. It´s unclear how many people reside in the city, which was Gaza´s largest before the war.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Israel",
      "weight": 0.07862542
    },
    {
      "name": "Gaza city",
      "weight": 0.07808163
    },
    {
      "name": "Gaza",
      "weight": 0.07598078
    },
    {
      "name": "Prime Minister Netanyahu",
      "weight": 0.066711
    },
    {
      "name": "Israeli hostages",
      "weight": 0.063725665
    },
    {
      "name": "Prime Minister Benjamin Netanyahu",
      "weight": 0.063664734
    },
    {
      "name": "Senior Israeli military figures",
      "weight": 0.05997285
    },
    {
      "name": "military control",
      "weight": 0.056072026
    },
    {
      "name": "Israeli forces",
      "weight": 0.055187766
    },
    {
      "name": "more hostages",
      "weight": 0.05515549
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9931640625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.94482421875
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.91015625
    },
    {
      "name": "/News/World News",
      "score": 0.873046875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.78955078125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.423828125
    }
  ],
  "sentiment": {
    "positive": 0.040496826,
    "negative": 0.8027344,
    "neutral": 0.15698242
  },
  "summary": "US ambassador to Israel, Mike Huckabee, has criticised Israeli Prime Minister Sir Keir Starmer for criticising plans that will leave one million Gazans displaced and potentially lead to more bloodshed. The criticism came after Starmer warned that Israel's latest escalation would 'only bring more bloodshed' and likened the situation to Britain's in World War Two. The attack coincided with US Vice President JD Vance's visit to Britain and highlighted a rift between the US and UK on the Middle East crisis. Ambassador Huckabee challenged Israel's obligation to provide food and humanitarian relief to Palestinians suffering from malnutrition, which has led to the highest number of acutely malnourished children in Gaza under five at the end of July. The World Health Organization reported that around 12,000 children under five under the age of five under five were acutely malformed at the time of July, marking the lowest number on record. The deadline for their removal from Gaza city and surrounding area is October 7th 2023. Israel has given over one million people in Gaza city, surrounding area, and has given them until October 7 to leave or face military action. Germany has suspended arms sales, including senior Israeli military figures, and Israel's refusal to fully occupy the remaining quarter of the Gaza Strip.",
  "shortSummary": "US ambassador Mike Huckabee criticized Israel's plans to force Palestinians from Gaza, sparking international condemnation and UK support for the conflict.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5ab67bde305e4e24a876d71fe636c98a",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Sir Keir Starmer faced criticism from US Ambassador to Israel Mike Huckabee after condemning Israel's plans that could displace one million Gazans, highlighting a growing rift between the US and UK regarding the Middle East crisis. Huckabee's remarks drew parallels between Israel's situation and Britain's WWII experience, while Starmer emphasized the worsening humanitarian crisis in Gaza and called for a ceasefire. The situation escalates as Israel's military actions lead to increased international concern, with aid agencies warning of famine and rising malnutrition among Gazans.",
  "argos_id": "XOSPVMBMW"
}