{
  "url": "https://www.benzinga.com/crypto/cryptocurrency/25/08/46988774/bitcoin-ethereum-dogecoin-surge-as-trump-opens-401ks-to-crypto-analyst-says-end-game-is-abo",
  "authorsByline": "Kaustubh Bagalkote",
  "articleId": "7772a367b0ad4c27a7035102caac71d9",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "https://cdn.benzinga.com/files/images/story/2025/08/07/Bitcoin-Souvenir-Coins--Cryptocurrency-G_0.jpeg?width=1200&height=800&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T23:49:41-04:00",
  "addDate": "2025-08-08T03:55:42.494929+00:00",
  "refreshDate": "2025-08-08T03:55:42.494931+00:00",
  "score": 1.0,
  "title": "Bitcoin, Ethereum, Dogecoin Surge As Trump Opens 401(k)s To Crypto — Analyst Says 'End Game Is About To Begin' For This Bull Cycle - Grayscale Bitcoin Mini Trust (BTC) Common units of fractional undivided beneficial interest (ARCA:BTC)",
  "description": "Major cryptocurrencies rallied on Thursday evening as President Donald Trump signed executive orders integrating digital assets into the U.S. financial system. The crypto market capitalization jumped 3.27% to $3.87 trillion following the landmark policy shift.",
  "content": "Major cryptocurrencies rallied on Thursday evening as President Donald Trump signed executive orders integrating digital assets into the U.S. financial system. The crypto market capitalization jumped 3.27% to $3.87 trillion following the landmark policy shift.\n\nTrump’s first executive order directs the Department of Labor to reassess guidance that currently restricts alternative asset exposure in employer-sponsored retirement plans. The directive specifically targets regulations that limit cryptocurrency inclusion in 401(k) portfolios, potentially opening trillions in retirement funds to digital asset investments.\n\nDespite the rally, liquidations remained elevated with 114,295 traders liquidated in the past 24 hours, totaling $389.89 million according to Coinglass data. The largest single liquidation occurred on HTX’s ETH-USDT pair, valued at $34.28 million.\n\nThe CMC Crypto Fear and Greed Index registered 59, indicating neutral market sentiment. The index has maintained neutral territory recently, trading between 50-57 over the past month.\n\nTraditional markets showed mixed results Thursday. The S&P 500 declined 0.08% to 6,340, while the Nasdaq-100 gained 0.32% to 23,389. The Dow Jones Industrial Average fell 0.51% to 43,968.64.\n\nFutures markets indicated positive sentiment for Friday’s session. S&P 500 futures climbed 0.32%, Nasdaq-100 futures advanced 0.34%, and Dow futures gained 0.28%.\n\nGold retreated to $3,380 per ounce on Thursday evening as investors took profits, though the metal remains positioned for a second consecutive weekly gain. Meanwhile, the Dollar Index traded at 98.11 on Thursday.\n\nSee Also: US Dollar Down 10% Since Trump Took Office — Paul Graham Warns ‘You’ve Become Poorer’ Without 11% Net Worth Gain\n\nTrump’s sweeping tariffs of 10% to 50% took effect, targeting dozens of countries, alongside a separate 100% tariff on imported semiconductors.\n\nCryptocurrency analyst Michaël van de Poppe remains bullish on altcoins, stating he expects “200-500% to be made in the next 2-4 months.” Van de Poppe noted many altcoins haven’t returned to early 2025 levels, viewing Ethereum’s recent move as signaling increased risk appetite.\n\nAnalyst Jelle highlighted historical Bitcoin cycle patterns, noting previous bull cycles lasted 1,064 days each. “If that pattern plays out again, the end game is about to begin,” Jelle wrote on X, suggesting an “October cycle top” approximately 10 weeks away.\n\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.",
  "medium": "Article",
  "links": [
    "https://www.benzinga.com/crypto/cryptocurrency/25/08/46950380/ethereum-treasury-strategy-fuels-cosmos-healths-300-million-financing-deal-stock-surges-31",
    "https://www.benzinga.com/etfs/sector-etfs/25/08/46976358/trump-drops-100-tariff-shocker-on-semiconductors-these-etfs-are-dodging-it",
    "https://www.benzinga.com/markets/economic-data/25/08/46956295/us-dollar-down-10-since-trump-took-office-paul-graham-warns-youve-become-poorer-without-11-net-worth-gain",
    "https://www.benzinga.com/crypto/cryptocurrency/25/08/46984531/trump-opens-401k-plans-to-crypto-cracks-down-on-crypto-banking-discrimination"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "historical Bitcoin cycle patterns",
      "weight": 0.06981781
    },
    {
      "name": "Thursday evening",
      "weight": 0.06766062
    },
    {
      "name": "President Donald Trump",
      "weight": 0.06686508
    },
    {
      "name": "Donald Trump",
      "weight": 0.066024296
    },
    {
      "name": "neutral market sentiment",
      "weight": 0.06595761
    },
    {
      "name": "previous bull cycles",
      "weight": 0.06568899
    },
    {
      "name": "Cryptocurrency analyst Michaël van de Poppe",
      "weight": 0.06525093
    },
    {
      "name": "digital assets",
      "weight": 0.063749865
    },
    {
      "name": "digital asset investments",
      "weight": 0.062411506
    },
    {
      "name": "Trump",
      "weight": 0.06226013
    }
  ],
  "topics": [
    {
      "name": "Altcoins"
    },
    {
      "name": "Cryptocurrency"
    },
    {
      "name": "Ethereum"
    },
    {
      "name": "Dogecoin"
    },
    {
      "name": "Bitcoin"
    },
    {
      "name": "Blockchain"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.9453125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.64990234375
    }
  ],
  "sentiment": {
    "positive": 0.109069824,
    "negative": 0.7319336,
    "neutral": 0.15893555
  },
  "summary": "Crypto markets surged as President Donald Trump signed executive orders integrating digital assets into the U.S. financial system, leading to a 3.27% increase in the crypto market capitalization of $3.87 trillion. The executive order instructs the Department of Labor to review guidance limiting cryptocurrency inclusion in 401(k) portfolios, potentially opening trillions in retirement funds to digital asset investments. Despite the rally, liquidations remained high, with 114,295 traders liquidating in the past 24 hours totalling $389.89 million. The largest single liquidation occurred on HTX’s ETH-USDT pair, valued at $34.28 million. Futures markets showed mixed results, with the S&P 500 declining 0.08% to 6,340, while the Nasdaq-100 gaining 0.32% to 23,389. The Dow Jones Industrial Average fell 0.51% to 43,968.",
  "shortSummary": "As President Donald Trump's executive orders integrate digital assets into 401(k)s, Bitcoin, Ethereum, and Dogecoin surged, despite high liquidation and mixed markets.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3268354e51124775bb53aaf375d1cb58",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.benzinga.com/markets/economic-data/25/08/46956295/us-dollar-down-10-since-trump-took-office-paul-graham-warns-youve-become-poorer-without-11-net-worth-gain",
      "text": "Y Combinator co-founder Paul Graham warned on Thursday that Americans need an 11% increase in net worth just to maintain purchasing power following the dollar’s significant decline since President Donald Trump‘s inauguration.\nDollar Index Shows Sharp Decline From Inauguration\nThe U.S. Dollar Index has fallen from 109.29 on Trump’s January 20 inauguration to 98.07 as of Thursday—a 10.26% decrease.\nGraham wrote on X: “Unless your dollar-denominated net worth has increased by at least 11% this year, you’ve become poorer. The dollar has decreased about 10% in value since Trump took office.”\nDollar-focused ETFs reflect this decline. Invesco DB US Dollar Index Bullish Fund UUP dropped 6.61% from $29.34 to $27.40, while WisdomTree Bloomberg U.S. Dollar Bullish Fund USDU fell 4.86% from $27.57 to $26.23 since the inauguration.\nBillionaire Wealth Gains Offset Currency Devaluation\nDespite dollar weakness, tech billionaires have posted substantial gains. According to the Bloomberg Billionaires Index, Larry Ellison leads with over $115 billion year-to-date, while Mark Zuckerberg gained $63.5 billion. Elon Musk, despite losing $68.1 billion, maintains the top position at $364 billion in net worth.\nGraham noted sarcastically that Trump could claim creating “unprecedented billionaires” when measuring in “Trump dollars, which are only worth .9 [Former President Joe] Biden dollars.”\nExperts Warn of Structural Dollar Pressures\nRay Dalio previously warned that currency devaluation cycles historically lead to gold-backed systems when trust in fiat currencies erodes. The billionaire investor cited patterns where governments print money to service debt, eventually triggering confidence crises.\nFidelity’s Jurrien Timmer warned the dollar could lose its “supremacy premium” if the Federal Reserve intervenes in bond markets to suppress rates amid rising debt burdens.\nCorporate Impact and Forward Outlook\nMcDonald’s Corp. MCD CEO Chris Kemczynski attributed consumer anxiety partly to tariff impacts, noting “real incomes are down with the low-income consumer” and visits declining “double digits versus the prior year.”\nRead Next:\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\nPhoto courtesy: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/crypto/cryptocurrency/25/08/46950380/ethereum-treasury-strategy-fuels-cosmos-healths-300-million-financing-deal-stock-surges-31",
      "text": "Cosmos Health Inc. COSM shares surged 30.98% to $1.15 after announcing a $300 million financing facility to launch an Ethereum ETH/USD treasury strategy, joining a growing trend of corporations adopting digital asset reserves.\n$300 Million Facility Targets ETH Accumulation\nThe healthcare group secured the senior secured convertible notes facility from a U.S. institutional investor. Under the agreement, 72.5% of net proceeds must go toward building Ethereum reserves, with remaining funds supporting working capital and growth initiatives.\nBitGo Trust Company will custody and stake the ETH assets through institutional infrastructure. CEO Greg Siokas called the move “a strategic milestone” providing shareholders direct ETH exposure.\nCorporate Treasury Trend Accelerates\nThe financing follows explosive growth in corporate Ethereum adoption. BitMine Immersion Technologies Inc. BMNR now holds 833,133 ETH tokens worth $3 billion, making it the world’s largest Ethereum treasury holder, according to Fundstrat data.\nStandard Chartered research shows Ethereum treasury companies have matched ETF buying since June 1, each acquiring approximately 1.6% of total ETH circulation.\nWall Street Adoption Drives Momentum\nFundstrat’s Tom Lee positions Ethereum treasury strategies as among the “biggest macro trends for the next 10-15 years.” Lee sees ETH experiencing its “2017 Bitcoin BTC/USD moment” with institutional adoption accelerating.\nMajor Wall Street institutions like JPMorgan Chase & Co. JPM built stablecoins on Ethereum, while Robinhood Markets Inc. HOOD develops tokenization infrastructure on the platform.\nStrategic Manufacturing Expansion Planned\nCosmos Health plans to use the remaining facility proceeds for U.S. manufacturing expansion, R&D innovation, and commercial initiatives. The company operates through subsidiaries manufacturing pharmaceuticals and nutraceuticals across Europe, Greece, and the UK.\nThe diversified healthcare group owns proprietary brands, including Sky Premium Life and Mediterranation, with recent telehealth expansion through the ZipDoctor acquisition.\nRead Next:\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\nPhoto Courtesy: Zakharchuk on Shutterstock.com\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/crypto/cryptocurrency/25/08/46984531/trump-opens-401k-plans-to-crypto-cracks-down-on-crypto-banking-discrimination",
      "text": "- Lawmakers like French Hill and Cynthia Lummis praised the orders as steps toward restoring fairness and financial innovation.\n- The actions follow Trump’s broader crypto policy push, including national reserves and efforts to boost institutional crypto access.\n- The market’s back, and these 3 income stocks are thriving. See them here→\nPresident Donald Trump signed two executive orders on Thursday advancing the role of digital assets in the U.S. financial system. One order allows 401(k) retirement plans to include cryptocurrencies, while the other targets what the administration calls discriminatory banking practices against crypto firms.\nThe first order directs the Department of Labor to reassess its guidance, which currently restricts alternative asset exposure in employer-sponsored retirement plans.\nThe move, aimed at revising regulatory interpretations under the Employee Retirement Income Security Act (ERISA), also instructs the Securities and Exchange Commission and Treasury Department to consider regulatory updates that could expand retail access to digital assets through accredited investor pathways.\nThis directive builds on Trump's earlier crypto-related actions, including a strategic digital asset reserve and a national initiative to promote U.S. crypto leadership.\nHashdex's Gerry O'Shea described the latest order as an opportunity for retirement plan sponsors to engage digital asset experts on safe and structured inclusion of crypto in long-term portfolios.\nIn a second executive order, Trump moved to prohibit federal regulators from using “reputational risk” as a reason to block or discourage banks from servicing crypto companies.\nThis language, used by agencies like the Federal Reserve, has come under scrutiny by lawmakers and the crypto industry, who argue it has been misused to justify account closures and restrict banking access.\nAlso Read: ProShares Introduces Leveraged ETF Targeting Circle’s 2x Daily Stock Returns\nCritics have long argued that such actions amount to a form of \"Operation Choke Point 2.0,\" a reference to a 2013 initiative that limited financial services for industries seen as risky.\nTrump's new order seeks to eliminate that discretion, aligning with prior pledges by the Federal Reserve, OCC, and FDIC to stop using reputational risk as a supervisory standard.\nRepublican lawmakers praised the order.\nHouse Financial Services Chair French Hill (R-AR) called it \"an important step\" toward protecting Americans from politically motivated financial discrimination.\nSenator Cynthia Lummis (R-NY) added that it brings \"transparency and accountability\" to what she characterized as an overreach under the Biden administration.\nBoth orders underscore a broader policy pivot under Trump aimed at normalizing crypto as part of mainstream financial systems.\nWhile the Biden-era Labor Department had cautioned against speculative risks in retirement crypto allocations, Trump's administration is instead positioning digital assets as central to innovation and investor choice.\nRead Next:\nPhoto: Shutterstock\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/etfs/sector-etfs/25/08/46976358/trump-drops-100-tariff-shocker-on-semiconductors-these-etfs-are-dodging-it",
      "text": "- TSMC, Apple, and U.S.-based fabs are tariff-proof, positioning select ETFs for gains.\n- Reshoring and U.S.-chip-heavy ETF plays are back in focus.\n- The market’s back, and these 3 income stocks are thriving. See them here→\nIn a step that shook tech supply chains and the semiconductor industry, President Donald Trump stated that his administration would slap a 100% tariff on all foreign-made semiconductors, unless companies pledge to construct fabs in the U.S.\nThe news was made at a press conference in the Oval Office with Apple Inc AAPL CEO Tim Cook, who vowed an extra $100 billion of domestic research and manufacturing spending.\nApple is in focus today. Check its prices live.\nMarkets welcomed the pro-U.S. sentiment. Apple shares bounced about 3% on Thursday, and Taiwan Semiconductor Manufacturing Co. TSM, which is exempt from tariffs due to its Arizona expansion, rose to an all-time high.\nBut behind the headline noise is an underlying investing question that comes up: Which ETFs will benefit or suffer as tariffs reshape the global chip landscape?\nWinners\nThe biggest beneficiaries of the tariff theatrics are semiconductor ETFs packed with firms already manufacturing in the U.S. or exempted from the tariffs.\nVanEck Semiconductor ETF SMH: TSM is a heavy holding here, and its exemption is a big win. The ETF increased more than 2% on Thursday, mostly on the coattails of TSM’s 5%+ gain.\niShares Semiconductor ETF SOXX: SOXX has a more diversified basket of U.S. semiconductor titans such as Intel Corp INTC, Broadcom Inc AVGO, and Texas Instruments Inc TXN, all of which have domestic manufacturing. Intel’s tie-up with Taiwan’s United Microelectronics Corp. may also be a tariff deflector.\nInvesco PHLX Semiconductor ETF SOXQ: Comparable to SOXX in makeup, but weighted differently, SOXQ could appeal to investors seeking a more U.S.-leaning semiconductor play without overpaying for TSMC exposure.\nWhile the chip company names are in the spotlight, reshoring-focused ETFs could become dark horse champions without notice.\nPacer U.S. Cash Cows 100 ETF COWZ: Investors are looking at this as a means to bet on robust U.S. earnings through industrial growth.\nFirst Trust Nasdaq Clean Edge Smart Grid Infrastructure ETF GRID: Constructing fabs is energy-intensive, and this fund follows companies constructing and modernizing U.S. electrical infrastructure as a backdoor bet on the fab boom.\nThe Apple Of Trump’s Eye\nApple’s $100 billion U.S. investment saved it from both the semiconductor and India tariff threats. That puts ETFs with significant Apple exposure in a pretty good place.\nTechnology Select Sector SPDR Fund XLK: With Apple constituting around 12% of the fund, and Microsoft Corp MSFT, with more than 14% of the portfolio, being a co-AI behemoth with U.S. manufacturing origins, XLK is likely to keep enjoying tariff-protected tech prowess.\nLosers\nWhile countries like Taiwan and South Korea are negotiating for exemptions, here are some ETFs that still stand at the crossroads.\niShares MSCI All Country Asia ex Japan ETF AAXJ: Broad exposure to Asia’s tech supply chain, such as India, Malaysia and other Southeast Asian chip exporters, means this is a risk zone. The Malaysian government is yet to negotiate clarity on U.S. tariff exposure.\nFranklin FTSE South Korea ETF FLKR: While some insulation is provided by Samsung’s U.S. fabs, South Korea is not proof against general tariff shocks. Any redefinition or escalation of “domestic” production could land these ETFs in the middle.\nFinal Take\nAfter the 100% semiconductor tariff news, market reaction has been more precise, aiming at who’s exempt, who’s widening, and who’s still exposed. Reshoring, infrastructure and U.S.-fab-heavy ETFs are likely to draw new money in the days and weeks to come.\nRead Next:\nPhoto: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    }
  ],
  "argos_summary": "Major cryptocurrencies surged after President Donald Trump signed executive orders integrating digital assets into the U.S. financial system, allowing 401(k) plans to include cryptocurrencies and prohibiting banks from discriminating against crypto firms. The crypto market capitalization increased by 3.27% to $3.87 trillion, although liquidations remained high. Meanwhile, traditional markets showed mixed results, and analysts expressed optimism about altcoin growth and potential Bitcoin cycle patterns.",
  "argos_id": "XQC8IRVOV"
}