{
  "url": "https://www.forbes.com/sites/jamiehailstone/2025/08/08/how-businesses-can-meet-the-climate-risk-and-adaptation-finance-gap/",
  "authorsByline": "Jamie Hailstone",
  "articleId": "0a6e918a69d14f81957c0af45495891f",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://specials-images.forbesimg.com/imageserve/6895b75c714f2818f683a69b/TOPSHOT-CHINA-WEATHER-FLOOD/960x0.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T08:41:59+00:00",
  "addDate": "2025-08-08T08:45:43.597451+00:00",
  "refreshDate": "2025-08-08T08:45:43.597452+00:00",
  "score": 1.0,
  "title": "How Businesses Can Meet The Climate Risk And Adaptation Finance Gap",
  "description": "The issue has been highlighted in a recent report, which looks at how businesses can mitigate environmental risks, and possible avenues for finance.",
  "content": "Many businesses are now having to grapple with climate-related risks, like heatwaves and heavy rainfall, and perhaps more importantly how to finance mitigation measures.\n\nThe issue has been highlighted in a recent report by the Imperial Business School’s Centre for Climate Finance and Investment, which looks at how businesses can mitigate environmental risks, and possible avenues for finance.\n\nThe report comes as separate that businesses could be underestimating investor losses from physical climate risks by as much as 70% rising to 82% when extreme risks such as cyclones and floods are also taken into account.\n\nThe Imperial analysis argues without substantial investments in adaptation, urban areas, their economies, infrastructure, and inhabitants face significant vulnerability to climate-induced extreme events, resulting in substantial costs.\n\nAnd as climate change does not impact the population in the same way, it is critical to identify those who are most exposed and vulnerable to climate hazards.\n\nBut the study also claims London lags behind other cities, such as Singapore and Copenhagen, in its adaptation financing efforts.\n\nProfessor Michael Wilkins, from the Imperial Business School, said there is a large gap between estimated climate adaptation needs based on future projections and what is being financed at the moment, in an interview.\n\nProfessor Wilkins globally around $70 billion of financing is being allocated to climate adaptation work, but it needs to be in the region of $300 billion per year.\n\nIn the case of the U.K, he told me the cost of adapting infrastructure to make it resilient to future climate impacts is estimated to be between £5 billion and £10 billion per year, but less than £1 billion is currently being spent.\n\nProfessor Wilkins said ageing infrastructure, particularly in the water sector, also makes it harder to estimate the full cost of climate adaption in the U.K.\n\n“The UK still, to a very large extent, underestimates the adaptation issues it faces in the future,” he said.\n\nHe said many of the costs have been assessed in a fragmented manner and there has also a lack of recognition of “locked-in” costs, which are the costs of caused by how the climate is set to change over the next two decades.\n\n“We've got to a stage now where even if we spend lots of money building new climate mitigation projects, they are not going to reduce the impact of climate change in the short-term, because of the existing amount of carbon in the atmosphere causing these changes,” he added.\n\nProfessor Wilkins said other countries have addressed financing climate adaption in a more standardised and unified way, as well as considering the social and economic impact of severe climate impacts\n\nHe cited the example of Singapore, which has put together a number of framework plans for addressing sea water surges due to tropical cyclones, which has led to more resilient infrastructure being built.\n\n“If you look at climate resilience financing as a public good in the same way as you think about health and education as a public good, then you can actually add it to the country's tax base,” he told me.\n\n“If health and education is paid by the taxpayer, then why shouldn’t protecting yourself against climate also be paid for by the taxpayer, given that it's actually providing a public benefit.”\n\nLorenzo Saa, chief sustainability officer at Clarity AI, said there is a growing sense among corporations and investors that climate mitigation on its own is not enough any longer, in an interview.\n\nSaa added businesses need to focus on adaptation, because climate risks are being felt today, but he said there are several factors involved in bridging the funding gap for such measures.\n\nHe also highlighted the growing role asset management can play in identifying resilience solutions, and the importance of corporate data to understand climate impacts.\n\n“Blended finance is clearly a big part of the conversation, because it has so many instruments, like guarantees or concessional capital to help de-risk investments for private investors, and I think it will be a critical component of this year’s COP30 talks in Brazil,” he told me.\n\n“But there's also going to be a point where you need to actually bring in the private markets, because the numbers involved are so huge.”",
  "medium": "Article",
  "links": [
    "https://www.imperial.ac.uk/business-school/faculty-research/research-centres/centre-climate-finance-investment/research/financing-adaptation-and-resilience-london-and-the-uk-moving-aspiration-reality/",
    "https://www.nature.com/articles/s41467-024-48820-1"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "climate risks",
      "weight": 0.11466261
    },
    {
      "name": "climate impacts",
      "weight": 0.1100495
    },
    {
      "name": "climate adaptation work",
      "weight": 0.108077206
    },
    {
      "name": "physical climate risks",
      "weight": 0.10802298
    },
    {
      "name": "climate change",
      "weight": 0.107293375
    },
    {
      "name": "climate mitigation",
      "weight": 0.10726584
    },
    {
      "name": "future climate impacts",
      "weight": 0.10613089
    },
    {
      "name": "estimated climate adaptation needs",
      "weight": 0.1054585
    },
    {
      "name": "climate",
      "weight": 0.10528507
    },
    {
      "name": "climate adaption",
      "weight": 0.10527106
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.93603515625
    },
    {
      "name": "/Science/Ecology & Environment/Climate Change & Global Warming",
      "score": 0.66259765625
    },
    {
      "name": "/Finance/Investing/Socially Responsible Investing",
      "score": 0.4794921875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.475830078125
    },
    {
      "name": "/Science/Ecology & Environment/Other",
      "score": 0.40185546875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.396240234375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.3720703125
    },
    {
      "name": "/News/Weather",
      "score": 0.36474609375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.361572265625
    },
    {
      "name": "/Business & Industrial/Business Operations/Management",
      "score": 0.3271484375
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Renewable & Alternative Energy",
      "score": 0.311279296875
    }
  ],
  "sentiment": {
    "positive": 0.10076904,
    "negative": 0.51708984,
    "neutral": 0.38183594
  },
  "summary": "A recent report by the Imperial Business School’s Centre for Climate Finance and Investment suggests that businesses may be underestimating investor losses from physical climate risks by up to 82%, or as much as 70%, when extreme risks such as cyclones and floods are also taken into account. The study also found that London lags behind other cities such as Singapore and Copenhagen in its adaptation financing efforts. Professor Michael Wilkins from the Imperial business School said there is a large gap between estimated climate adaptation needs and current funding methods. He suggested that around $70 billion of financing is currently being allocated to climate adaptation work, which needs to be in the region of $300 billion per year. The cost of adapting infrastructure to make it resilient to future climate impacts is estimated to be between £5 billion and £10 billion per annual, but less than £1 billion is currently spent.",
  "shortSummary": "Despite significant climate change risks, many businesses face challenges in funding adaptation and mitigation measures due to a funding gap, highlighting the need for multidisciplinary approaches.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "aaf30d75870e4683bdf916629993c542",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nature.com/articles/s41467-024-48820-1",
      "text": "Abstract\nClimate physical risk assessment is crucial to inform adaptation policies and finance. However, science-based and transparent solutions to assess climate physical risks are limited, compounding the adaptation gap. This is a main limitation to fill the adaptation gap. We provide a methodology that quantifies physical risks on geolocalized productive assets, considering their exposure to chronic and acute impacts (hurricanes) across the scenarios of the Intergovernmental Panel on Climate Change. Then, we translate asset-level shocks into economic and financial losses. We apply the methodology to Mexico, a country highly exposed to physical risks, recipient of adaptation finance and foreign investments. We show that investor losses are underestimated up to 70% when neglecting asset-level information, and up to 82% when neglecting tail acute risks. Therefore, neglecting the asset-level and acute dimensions of physical risks leads to large errors in the identification of adaptation policy responses, investments and finance tools aimed to build resilience to climate change.\nSimilar content being viewed by others\nIntroduction\nThe analysis of climate physical risks, meant as both acute risks stemming from climate-related hazards and chronic risks from long-run climate impacts1, plays a key role to inform decision-makers2 and build resilience to climate change3. However, methodological and conceptual challenges remain open for assessing the impact of climate physical risks4, in particular on business and finance5,6. Addressing these challenges is crucial to identify policy responses7, financing needs8 and the financial instruments9 to fill the adaptation investment gap. In particular, the underestimation of climate physical risks leads to underinvesting in adaptation and mitigation10, which in turn leads to delayed climate action, larger socio-economic losses and higher risks. Indeed, while adaptation finance has increased from 30 billion (annual) USD to 46 billion in the period 2017–20208, it still falls short of needs, estimated to amount to 250 billion USD per year for low-income and emerging countries alone by 203011. At the same time, the adaptation finance needs for other countries and regions, including the European Union’s member states, have still to be clearly identified.\nMost often, the assessment of climate physical risks relies on commercial methodologies. Nevertheless, these methodologies are proprietary (and thus not easily accessible), not fully transparent, not fully replicable, and often lead to diverging results12. Moreover, commercial methodologies provide climate risk scores with different levels of aggregation (e.g., by firm or hazard, depending on the provider). While scores could be useful for some types of analyses (e.g., investigating the market premium for physical risk), they cannot be used as a proxy for the asset-level damages, which in turn are needed to inform climate financial valuation models and climate financial risk pricing.\nTo address these limitations, here we develop a methodology for asset-level climate physical risk assessment that translates the impact of both acute and chronic risk on the financial value of firms with productive assets exposed to climate impacts, and on financial securities (equity) associated with those firms. We apply the methodology to a sample of 177 listed firms, owning 1820 physical assets located in Mexico, a country that is highly exposed to physical risks and is a main beneficiary of adaptation finance3. In the absence of granular data on industrial plants and their ownership, previous works on risk assessment have resorted to approximating the location of economic activities of each firm with its headquarter location. Still, the magnitude of the resulting misestimation of losses using such proxy data has been unknown so far. Here, we show that, in our sample, the approximation leads to an underestimation of climate-related losses of up to 70%, in terms of relative difference on Value at Risk (VaR), compared to the computation based on granular asset-level data. Further, current analyses of physical risks rely either on scenarios of chronic risks (e.g., sea-level rise or water scarcity), or, separately, of acute risks (e.g., cyclones13 or floods). Focusing on either acute or chronic risks alone can lead to an underestimation of losses, but the magnitude of such underestimation is poorly understood6. Here, we show that neglecting the component of acute risk can lead to underestimations of financial losses for investors up to about 82% in terms of relative difference on VaR. By quantifying these potential underestimations, our methodology enables investors and corporations to better integrate climate physical risks in their internal risk assessment and risk management processes. Finally, the literature has mainly focused on the impact of past climate hazards on current prices of financial assets and risk premia14,15,16, while the information on future climate scenarios is not integrated. In contrast, our model provides a scenario-contingent financial valuation of firms that accounts both for historical information (embedded in current prices) as well as future climate scenarios. In particular, we examine climate acute and chronic risk depending on the type and location of the firm’s production plants.\nResults\nMethodological framework\nWe introduce a methodology to perform the assessment of climate physical risks at the asset level for individual firms and investors’ portfolios. We define “assets” as the facilities such as mines, power plants, cement factories, etc., which are operated by a firm. “Asset-level data” represent a set of information collected on such plants, which include location, capacity, value, prices, residual life, etc. A firm has “available asset-level data” if information about plants that are relevant for its business is available. Data on production plants’ type, geolocation, and capacity are often either missing or fragmented, despite recent progress in spatial finance (https://www.cgfi.ac.uk/spatial-finance-initiative/)17. Furthermore, plants’ owners identity is not standardised, limiting researchers’ ability to reconstruct the ownership chains from plants to firms and investors, due to the complexity of the global ownership network18,19. Here, we provide a procedure that leverages existing plant data and cross-matches owners’ identity in the main existing datasets.\nWith respect to climate risks, we consider both the chronic and acute components individually and combined, conditional to the Intergovernmental Panel on Climate Change (IPCC) climate scenarios, identified as combinations of Representative Concentration Pathways (RCP) and Shared Socioeconomic Pathways (SSP). For chronic risk, we use point estimates of losses from a macroeconomic model (see “Methods”). For acute risk, we consider both the average loss and the tail of the loss distribution (extreme events). Following the terminology of the relevant literature, the average yearly loss is referred to as Expected Annual Impact (EAI) while tail risk is referred to in terms of return period. For instance, a 100-year return period (RP100) indicates a value of losses that on average is exceeded only every 100 years. Equivalently, RP100 is a loss that is exceeded with a probability of 1% (or, in statistical terms, a 0.99-quantile). Return periods are a measure of losses (not a measure of time) and are equivalent to quantiles of the loss distribution, under the condition that both are computed on the same sample. Consistently with the risk management literature, this notion of tail risk corresponds to the Value at Risk (VaR) at a given confidence level. For instance, the 0.99-quantile corresponds to a 99% VaR.\nThe methodology is articulated in five steps, which are represented in Fig. 1. The first block is the database model for asset-level and business lines data, ownership chain, and financial information (see “Methods” for a full description). The second block represents the probabilistic climate acute risk assessment at the asset level that is performed using the CLIMADA model20,21 to assess hurricane damages. The third block connects the acute impacts with the sector-level chronic impacts on firms’ business lines, which are computed with a macroeconomic model (i.e., the Intertemporal Computable Equilibrium System (ICES) model)22,23,24. The fourth block connects asset-level impacts with the performance of the firm owning the asset, and translates them into an adjustment of the financial valuation of the securities (equity) issued by the firm by developing a Climate Dividend Discount Model (CDDM), that builds on standard equity valuation theory25,26,27,28,29. The adjustment is calculated with respect to a baseline in which only present acute and chronic risks are accounted for. Finally, in the fifth block, climate physical risks are translated into financial risk metrics for the investor who holds the firm’s securities.\nAcute risks at the asset level\nWe use CLIMADA to perform a probabilistic risk assessment of tropical cyclones’ damages to physical assets in Mexico. Firms’ assets are heterogeneously distributed in the country, as shown in Fig. 2a. Assets are also heterogeneous in terms of sector and productive capacity. In our sample, mines and power plants are the most represented assets, and are particularly concentrated on the western coast of the country and in the central region. Relatively few assets are present on the eastern coast, especially in the south. Direct damages from tropical cyclones lead to economic losses that are measured as a percentage of assets’ values. Expected Annual Impacts (EAI) for year 2050 conditioned to scenario RCP2.6 are low in the whole country, as shown in Fig. 2b. As a first comparison, tail risk losses, i.e., RP100 (Fig. 2c), are at least ten times larger than EAI for 37% of assets (in number), conditioned to the same mild scenario RCP2.6. However, losses from tropical cyclones are concentrated in certain areas of the country, such as the Jalisco region, as indicated by the yellow, orange, and red colours in Fig. 2c, d. Indeed, other areas, such as the central region, are not exposed to tropical cyclones as indicated by the grey colour. Finally, we look at more extreme tail risk, i.e., a higher return period (RP250), in a more severe climate scenario (RCP4.5): Fig. 2d shows that, in this case, more numerous assets suffer larger losses. We find that for about 73% of assets (in number) RP250 losses are at least ten times larger than EAI. Moreover, for 13% of assets, RP250 losses are five times larger than RP100. Note that the ratio of RP250 losses RP100 losses cannot be computed for a subset of 631 assets in the sample with zero RP100 but non-zero RP250. Differences in losses across scenarios are limited due to the short time horizon considered, but become more pronounced toward the end of the century. Thus, it is crucial to take into account both the RCP scenario and higher return periods to properly quantify tail acute risks at the asset level.\nAcute vs chronic risks at the firm level\nThe equity value of the firm is a function of chronic and acute losses (which are modelled as random variables, see Methods). In line with the finance literature, this function is referred to as equity valuation. We first compute the equity value considering future chronic and acute risks (conditioned to climate scenarios). Then, we compare this first value with the result of the computation where only current levels of chronic and acute risks are accounted for, i.e., a value that only reflects the current distribution of losses on assets and business lines. Finally, the equity shock is computed as the relative difference between the two values. Hence, the equity shock represents the adjustment in equity valuation when considering the impact of climate scenarios on physical assets and business lines. In Fig. 3, we show the impact of acute and chronic shocks on the equity value in a sample of 86 firms with asset-level data, conditioned to climate scenario SSP3-RCP4.5. Acute shocks represent the RP250 losses on the assets of the firm while chronic shocks represent the point estimate of losses from the macroeconomic model. The colour code represents the 99.6% VaR of the equity shock. Four main results emerge. First, chronic and acute shocks both contribute to higher equity shocks (see e.g., firm 1, mainly active in the fossil fuels sector). Second, firms in the same sector can have similar chronic shocks but very different acute shocks because their assets are in different locations (see e.g., firm 2 vs firm 3, active in the renewables sector). Third, firms may be affected by a similar acute shock but by different chronic shocks (see e.g., firm 3 and 4, active in the renewables and mining sectors, respectively). Fourth, firms can have large acute shocks even if operating in different sectors (see e.g., again firms 3 and 4).\nTail acute risks lead to large economic losses for firms\nFigure 4 illustrates the relation between impacts on firms’ equity in terms of tail risk (RP250) and average losses (EAI), with negative (positive) values representing losses (gains). As RP250 losses are always more negative or equal to EAI losses, dots in the scatter plot are below the black line, representing points where EAI losses equal RP250 losses.\nNote that for 35% of firms in the sample RP250 is at least three times larger than EAI. This result is robust to changes in value of key parameters in the model such as discount rate r and long-term dividend growth rate gL (see Supplementary Section 7).\nSubstantial underestimation of investors’ losses from neglecting tail acute risks\nWe now look at how firm-level losses translate into portfolio losses. To this aim, we consider an investor owning an equally weighted portfolio invested in the stocks issued by the firms in our sample. So far, by means of the valuation model described in “Methods”, for each firm we have computed firm-level equity losses, both in terms of EAI and RP250. We now compute portfolio losses for the investor as the equally weighted average of all firm-level equity losses. In particular, the equally weighted average of firm-level EAI and RP250 are interpreted as the average portfolio loss and the 99.6% VaR on the investor’s portfolio, respectively. Table 1A shows the point estimates and the confidence intervals of portfolio losses for five different combinations of loss metric and type of physical risk. These include chronic risk only, acute risk only computed using EAI, acute risk only computed using RP250, the combination of chronic and acute risk computed using EAI, and the combination of chronic and acute risk computed using RP250. We compare cases that consider tail risk (RP250) with cases that do not consider tail risk (EAI). The confidence intervals are computed using the bias-corrected and accelerated percentile method (see e.g., ref. 30) on 15,000 samples. In the absence of precise rules to set the number of samples for the bootstrap, we determined it iteratively. We started from a small number of samples and computed the confidence intervals. Subsequently, we increased the number of samples until we reached a point where the additional increase in the precision of the estimates was negligible. The bootstrapped distributions of sample means are shown in Supplementary Fig. 6. We highlight the importance of tail risk by comparing the magnitude of the VaR with the magnitude of the mean in Table 1A. In fact, the VaR is between 5 and 38 times the mean (comparing rows 3 and 5 (VaR) with rows 2 and 4 (mean), respectively). In Table 1B, we quantify the underestimation of portfolio risk stemming from neglecting tail risk. Risk underestimation is substantial. In fact, using chronic risk only instead of tail acute risk leads to an underestimation of losses up to 82.2% (row 2, column 3). At the same time, neglecting the tail of acute risks leads to an underestimation of losses up to 97.7% (row 3, column 3).\nNeglecting asset-level information leads to a relevant underestimation of losses for investors\nIn the absence of granular asset-level data, a possible approximation, which we refer to as using “proxy data\", consists of replacing the set of locations where the firm operates by only one location, generally the country, city or postal code of its headquarter (see e.g., ref. 31). However, the impact of such approximation on the loss estimates is still unknown and deserves investigation. Hence, here we compare the portfolio losses computed using the two approaches: asset-level data vs proxy data. More in detail, for the same set of firms, we perform the equity valuation adjustments using asset-level data, and then using only the firms’ headquarters as proxy for the location of its operations. By comparing the results, we determine the underestimation of losses resulting from neglecting asset-level data. We show that this loss of information has important implications for climate financial risk analysis. We illustrate this result in Table 2A, B. We first compare the losses on equity computed using the asset-level data to the losses computed using proxy data. We show that the magnitude of the VaR is 3 to 5.5 times larger when computed using asset-level data (Panel A, rows 2 and 6, third column) with respect to using proxy data (Panel A, rows 4 and 8, third column). As shown in Table 2B, neglecting asset-level data leads to an underestimation of the portfolio VaR between 67.4% and 92.3% when not considering chronic risks (Panel B, row 1, last column). The underestimation is lower when considering also chronic risks, but still in the range from 58.0 to 70.8% (Panel B, row 2, last column).\nDiscussion\nLosses from climate physical risks are expected to increase in the future due to growing climate change impacts, compounding of climate physical risks32,33,34, and insufficient countries’ mitigation efforts. Our methodology provides an assessment of financial losses from climate physical risks more robust than those previously available, by considering firms’ asset-level information and business lines, and by combining acute and chronic physical risks scenarios. In turn, a better assessment of firms’ exposure to physical risk can support advances in academic research in adaptation, as well as the design of policies and financial instruments aimed to build resilience to climate change and fill the adaptation gap.\nThe magnitude of financial shocks from climate physical risks can crucially depend on the geolocation of firms’ assets and on their business lines. For instance, firms that operate in the same economic sector may have a different exposure to physical risk, and thus a different risk profile, due to their asset-level (climate and non-climate) characteristics. These factors drive the two main results of our paper. First, neglecting tail acute risks leads to a large understimation of portfolio losses, up to 82.2%, in our sample. Second, importantly, using proxy data instead of asset-level information, leads to a relative underestimation of the VaR of the investor up to 70.8%. Thus, asset-level information is key for climate physical risk assessment.\nOur results are conditioned to the following limitations, some of which, however, apply more in general to the field of climate physical risk assessment. We acknowledge that our analysis does not take into account all the potential sources of uncertainty. Thus our results provide a quantification of losses conditional to the following specifications. First, we rely on point estimates of the characteristics of assets (e.g., residual life, monetary value, capacity) because confidence intervals on those estimates are not available. Second, we take the point estimate for RP and EAI of tropical cyclones impacts from the CLIMADA model under the standard setting13. Indeed, there is not yet an established way to calibrate the set-up that could yield uncertainty on the estimates of RP and EAI35. In addition, the data needed to properly calibrate assumptions about uncertainty is not available. Third, in order to quantify the impact of tropical cyclones, we relied on traditional approaches in the literature (e.g., refs. 21 and 35) that interpolate between current (2001–2020) and future (2081–2100) climate scenarios but they do not take into account the uncertainty on the evolution of the impacts. Fourth, we use the same damage function across all types of assets since data on damages by asset type are not available. In this regard, publicly available datasets, such as EM-DAT37 only provide damages per event, at the country or (more rarely) at the subnational level. Finally, we do not consider firms’ adaptation efforts (such as assets’ relocation, implementation of physical barriers, etc.) because this information is currently not available38. Further limitations are discussed in “Methods”. We provide an estimate of how uncertainty and adaptation efforts could affect our results in Supplementary Sections 10 and 11.\nOur methodology can be applied beyond the Mexico case presented in this study. In fact, the presented steps can be tailored to assess physical risks for different countries (e.g., the US), hazards (e.g., floods) and securities (e.g., bonds, after tailoring the financial model). The main limitation to further applicability is represented by data availability. Our analysis has important implications for several types of decision-makers in climate finance. On the one hand, it contributes to inform policymakers in the design and implementation of adaptation policies, in particular in the current context of public budget constraints and rising public debt, both in high and low-income countries. For example, in the EU, the European Climate Adaptation Strategy called for smarter adaptation and highlighted the need to translate large volumes of climate information into customized and user-friendly tools39. In this regard, our methodological framework sets a blueprint for the use of geolocalized climate data for climate finance analysis, and supports the Strategy’s objectives, such as closing the adaptation gap, integrating climate risks and resilience into fiscal frameworks, and scaling up finance for climate resilience. In addition, our framework contributes to inform financial regulators and supervisory authorities to better assess the impact of climate physical risks for sovereigns, considering the composition of each country’s economy (e.g., contribution of firms and sectors to Gross Value Added and fiscal revenues), the impact on sovereign risk (e.g., via bonds’ yields and spreads) and the potential financial and regulatory response (e.g., monetary and prudential policies40).\nOn the other hand, our methodology supports financial institutions in avoiding underestimations of exposure to physical risks. In fact, while some financial actors such as insurers and reinsurers are relatively well-prepared in catastrophe risk management, others are less sophisticated41. This is for instance the case of banks’ lending to firms (which represents on average 40% of EU banks’ total assets, https://www.eba.europa.eu/risk-analysis-and-data/risk-dashboard) and of institutional investors (e.g., asset managers, pension funds and investment funds). Importantly, even a well-diversified portfolio would bear high physical risks as extreme events are predicted to increase globally2. Thus, geographic and sectoral diversification have limited benefits for portfolio climate risk reduction. In contrast, our methodology enables investors to better identify physical risks at the asset and firm level, considering assets’ location. With this information, investment strategies, which may include a conditionality on adaptation investments from borrowing or invested firms, can be implemented, improving banks’ and investors’ resilience to physical risks. Finally, our analysis shows how firms could improve their climate risk management and facilitate physical risk disclosures under the Corporate Sustainability Reporting Directive42. This is of key importance in light of the blind spots that still exist in firms’ assessment of climate risks and in their adaptation strategies38.\nFurthermore, proper climate physical risk assessment matters for central banks and financial regulators with a financial stability mandate, to allow for the identification of policies and regulations aimed to mitigate systemic financial risk in their jurisdictions.\nFinally, further investments in climate physical risk models are necessary to meet the needs of the financial sector5. At the same time, closer collaboration between climate modellers and economists is necessary to improve climate physical risk assessment at the asset, firm, and portfolio levels, ultimately enabling better investment and policy decisions. However, the quest for better models is no justification to delay action by investors and financial supervisors in assessing physical risks and climate change adaptation on the basis of available models.\nMethods\nDatabase model\nWe develop a database model to collect and logically connect extra financial, climate and financial information of individual physical assets and firms. The database model provides a granular and comprehensive overview of the characteristics of firms by collecting information on their productive assets, their business lines’ composition and performance, and their financial and climate characteristic. We disaggregate firm-level information by asset and geography, considering the firm as a portfolio of business lines and geographically distributed assets43. This enables us to downscale climate risk assessment to the fundamental business units of the firm, considering their potentially different exposure to climate-related hazards, due to the geographical location of their productive assets.\nFirst, we collect data on firms’ revenues by business line. We leverage information on business units, product types, and their respective sales quantities and prices. Second, we retrieve, clean and consolidate a database of physical asset exposures from different data providers, for instance, Refinitiv Eikon (https://eikon.thomsonreuters.com/index.html), and S&P (https://www.spglobal.com/en/). As different databases provide different information on assets (e.g., some databases provide a monetary value, or a location, and some do not) as well as on owners (e.g., databases using different identifiers, or no identifiers but just firms’ names), we set up a preprocessing pipeline to overcome these data fragmentation and comparability problems. Our process attaches to each asset a location, production capacity, monetary value, useful residual life, technology, operating status and ownership. We focus on energy-related or energy-intensive assets such as power plants, liquified natural gas (LNG) facilities, and mines, given the relevance of physical risk for the energy sector (see ref. 44 for a comprehensive review) and its consideration as “sin stocks\"45. Finally, we connect assets to business lines and thus firms’ equity valuation.\nOur combined databases return 123,340 physical assets globally. In total, 3493 are located in Mexico and we reconstruct their chain of ownership. In fact, asset-level datasets generally have information on direct owners, but not necessarily on the listed owners who issue financial contracts. To solve this issue, it is necessary to match owners’ names and identifiers across multiple databases. By doing so, it is possible to reconstruct the chain of ownership from the asset to its listed owners and the issued financial contracts. See also Supplementary Section 1 for a list of used databases.\nUltimately, we link 1820 physical assets to 177 firms, both Mexican and internationally owned, that own the assets and are invested in by European financial actors. To these firms, we link 17,147 individual equity holdings of 1014 European investors consolidated via 199 different equity instruments. The total exposure value of European investors amounts to 290.11 billion USD (as of June 30, 2020).\nClimate physical risk assessment\nAssessing physical risk on corporate securities differs from assessing physical risk for sovereign ratings or debt, especially in terms of data availability. In fact, country-level information on past disasters is available from publicly available databases (e.g., EM-DAT37), but historical firm-level information is missing. Thus, we rely on a probabilistic risk assessment approach to assess asset-level and firm-level losses. In addition, our methodology includes a dedicated treatment of the transmission channels and implications of climate physical risks on firms’ business lines, on economic sectors and macroeconomic variables, the latter being captured with the use of a dedicated macroeconomic model (ICES).\nAsset-level assessment\nWe use the CLIMate ADApt (CLIMADA) model (https://wcr.ethz.ch/research/climada.html)13,20,21,35,46 to perform a probabilistic assessment of damages from tropical cyclones at each asset location, for different Representative Concentration Pathways (RCP) scenarios (2.6, 4.5, 6.0) at different years (2035, 2040, 2045, 2050). Supplementary Fig. 3 illustrates the workflow’s schematic.\nWe consider historical data on tropical cyclones between 1950 and 2021 provided by the International Best Track Archive for Climate Stewardship (IBTrACS) (https://www.ncei.noaa.gov/products/international-best-track-archive), for the North Atlantic and Eastern North Pacific basins. Of 1555 historical events originated from either basin, 336 crossed Mexico. A map of these events is included in Supplementary Fig. 4. We standardize events’ tracks by interpolating wind speeds at half-hour time steps. Building on Aznar-Siguan and Bresch13, we simulate 50 synthetic tracks for each historical event, including track decay after landfall, for the probabilistic assessment. We remove duplicate hazards in the set to obtain a final dataset of 16,728 cyclones. Hazards can be duplicated in the first place as we are using two different basins as reference points, and tracks can cross from one another.\nTracks are then mapped to centroids in Mexico, i.e., geographical points where we define a wind speed from the track. The grid is set at 0.2 degrees of latitude/longitude, for a total of 14,076 centroids matched to hazards. We also tested the effect of using a finer grid on asset-level damages for the year 2040, see Supplementary Section 4 Asset-level damages with a finer grid. The comparison shows that using a finer grid could lead to slightly higher asset-level damages. We use CLIMADA to perturb the tracks for future climate change impacts for a given RCP scenario and year. The procedure followed in the model is based on the results obtained in ref. 47 for RCP4.5. Changes in tropical cyclones’ frequencies and intensities are then obtained by linear interpolation for different RCPs and years. In this study, we use RCP2.6, 4.5 and 6.0, and years 2035, 2040, 2045 and 2050. The choice of RCPs and years is made to match the set-up of the ICES and CDDM models. For limitations of this procedure, see CLIMADA’s documentation and references therein (https://climada-python.readthedocs.io/en/stable/tutorial/climada_hazard_TropCyclone.html).\nBy combining the wind speed at the centroid closest to a given asset and a damage function, we obtain asset-level impacts. The damage function describes the relation between the wind speed and the damages to a given asset. The formulation used is shown in Eq. (1)48.\nwhere\nEquation (1) enables the translation of wind speed (Wspd) into direct damages to assets described by the fraction of damaged property Findex via a cubic power. It also considers a lower bound Wthresh of no damage occurrence and a value Whalf where half the damage occurs. We follow the calibration provided in ref. 33 for Mexico and select Wthresh to be 65 km/h and Whalf to be 253 km/h. Other calibrations exist in the literature, for example, ref. 49, which sets Wthresh = 92.52 km/h and calibrates Whalf with two different approaches to either 214.56 km/h or 238.68 km/h. In comparison, the calibration in ref. 33 may overestimate the damages from low-category hurricanes and underestimate the damages from high-category hurricanes. Both the calibrations by Dunz et al.33 and Eberenz et al.49 are based on the shape of the damage function proposed by Emanuel48. However, the former calibration is performed on disaster damage data from Mexico only, while the latter is performed on disaster damage data from Mexico and the Caribbean (for Whalf), and on disaster damage data from the US (for Wthresh, consistently with ref. 48). We use the calibration by Dunz et al.33 for this study, as it is specific to Mexico only. The damage function in Eq. (1) considers only wind speed. This is a common assumption in the literature13,33,48. Nevertheless, considering only wind speed limits the extent of the assessment of those hurricanes where rainfall and storm surges can account for high damage, despite the storm being less windy13. Importantly, we keep the damage function constant across asset types. Calibration of asset-level damage functions is left for further research.\nWe use two measures of damages at each scenario-time combination: Expected Annual Impacts (EAI) and 250 years Return Period (RP250). These combine the damage functions and the hazards to obtain measures of average (EAI) or tail (RP250) risks on assets. EAI is computed as:\nwhere xij is the realization of the random variable X representing the impact, index j denotes a physical asset, Ei is an event, F its annual frequency and Nev is the number of (independent) events considered.\nFor cyclones, return periods are defined as “the frequency at which a certain intensity of a hurricane can be expected within a given distance of a given location\" (https://www.nhc.noaa.gov/climo). For example, a return period of 20 years for a hurricane means that on average during the previous 100 years, a hurricane of a certain category or greater passed within 50 nautical miles (58 miles) of a given location about five times. Importantly, a 1-in-100-year event will not necessarily occur once in a century but may also occur more often, or not occur.\nFor more details on the estimation of return periods, see ref. 50. For the implementation in CLIMADA, the reader is referred to refs. 13 and 20 and the model documentation (https://climada-python.readthedocs.io/en/stable/index.html).\nMacroeconomic assessment\nWe use the ICES model (https://www.icesmodel.org/) to quantify macroeconomic impacts of chronic risks23,24, as applied within the COACCH project (https://www.coacch.eu/)22. We source gross domestic product (GDP) and sectoral output trajectories under different combinations of scenarios (Shared Socioeconomic Pathways (SSPs) and RCPs), assumptions on capital mobility, and level of climate change impact. Trajectories are provided as “baselines”, i.e., without climate change, and as “impact scenarios”, i.e., including climate change. Thus the output change from a baseline to an impact scenario is dependent on climate change only. We use the following SSP-RCP combinations for our study, at the time horizons 2035, 2040, 2045, 2050: SSP2-RCP6.0, SSP3-RCP2.6, SSP3-RCP4.5, SSP5-RCP4.5. For the purpose of this study, we use the assumptions of high climate change impacts and high capital mobility in ICES. The ICES model as used in COACCH is resolved in 5-year steps until 2070, though for this study, we use a 2050 horizon. Further description of ICES’ sectors and the scenario choice are provided in Supplementary Sections 2 and 5.\nClimate financial valuation: the Climate Dividend Discount Model\nWe quantify climate physical risk adjustments on equity valuation by developing a Climate Dividend Discount Model (CDDM). It extends the traditional Dividend Discount Model (DDM) framework25,26 in its three stages formulation28 to account for acute and chronic risks on firms’ long-term growth. The former depends on assets and extreme events, the latter on business lines and their economic trajectories. To estimate the market value of equity, DDMs discount the future dividends using a discount rate to determine their present value. The discount rate represents the rate of return required by investors. Alternative formulations of this discounting concept exist, for example, based on Discounted Cash Flow (DCF). Importantly, our methodology can be applied to DCFs too. We assume the following:\n-\nDividends can be estimated by combining Earnings Per Share (EPS), their growth, payout ratios, and their respective long-run trends.\n-\nLong-term climate physical risks are not accounted for in the current valuation51. Thus, the long-run growth rate used for equity valuation is not consistent with future climate risks. We assume this growth rate without climate impacts is constant across all firms.\n-\nPhysical risks are going to impact mostly the long-run part of the valuation.\n-\nDiscount rate is constant for all firms in all periods.\nThe equity value at time 0 (V0) is computed as:\nwhere Dt represents the dividend at time t, r the discount rate, and \\({V}_{{t}_{2}}\\) the terminal value once the explicit estimation of dividends ends. t1 and t2 are the boundaries of the first and second stages. The following relation connects the dividends to Earnings Per Share (EPS):\nwhere EPSt represents the earnings per share at time t, and bt the earnings retention rate making (1 − bt) the payout ratio. We obtain EPS and Dividends Per Share (DPS) from S&P. Data are available for a generally limited number of years. Thus, to complete the dividend series until t2, we first estimate EPS as:\nwhere gEPS,t,t−1 represents the EPS growth rate between t − 1 and t, and it holds \\({g}_{EPS,{t}_{2}}={g}_{L}\\), where gL represents the long-run growth rate of dividends. Importantly, this relation implies a linear decline of EPS growth towards gL. Thus, Eq. (6) enables the estimation of missing EPS, and hence dividends from Eq. (5). Then, the three stages in Eq. (4) can be distinguished as follows. First, a stage where dividends are explicitly estimated by a data provider (for this study, S&P). Second, a stage where dividends are modelled with linear decline. Third, the estimation of a terminal value.\nWe can rewrite Eq. (4) for each firm as:\nwhere gL represents the long-term growth rate of dividends, i.e., the rate at which the firm reaches an equilibrium where investment opportunities, on average, earn their opportunity cost of capital. The index j represents the jth firm. Differently from Eq. (4), we now make the dependence on j explicit, a necessary step for practical applications. In fact, dividend data are generally sourced from a provider whose analysts will perform the in-depth analysis necessary for dividends’ estimation. Depending on the firm, analysts will use different assumptions while modelling dividends. The usage of firm-specific assumptions for the estimation is reflected in the formula by the j subscript, which shows how dividends are going to differ from firm to firm (denoted \\({D}_{t}^{\\,\\,j}\\)) and how the boundaries of the stages are not fixed a priori but depend on the firm (denoted by tj,1 and tj,2). Note that dividends are explicitly modelled in the first stage, up to tj,1 and subsequently reverted to long-run growth rates. This explicit step is necessary to link the theory of equity valuation to its practical implementation. For a discussion of the sensitivities of the model to r and gL, please see Supplementary Section 7. For this study, we set r = 0.09 and gL = 0.06.\nDue to climate change, we cannot keep the long-run growth constant across firms as in e.g., Refinitiv’s StarMine model (https://www.lseg.com/en/data-analytics/financial-data/analytics/quantitative-analytics/starmine-intrinsic-valuation-model), as firms will be heterogeneously impacted. The growth rate of a firm will ultimately depend on: the output trajectories of its business lines as impacted by chronic risks, and the location and characteristics of its assets as impacted by acute risks. Importantly, our results shall be considered conservative due to the complexity of asset-level data, the compensation coming from positive macroeconomic shocks, and the considerations of only tropical cyclones.\nWe can now define the long-run growth rate as adjusted by physical risk considerations, \\({\\tilde{g}}_{L}\\) as:\nwhere I denotes a climate change impact scenario, Oi,B and Oi,I the output trajectories for sector i under scenarios I, impacted by climate change, and B, without climate change. We define as chronic shock the ratio \\(\\frac{{O}_{i,I}}{{O}_{i,B}}-1\\), meaning for instance that a loss on output, relative to the baseline, of 5% corresponds to a shock of −0.05. Note that, when entering Eq. (7), \\({\\tilde{g}}_{L}\\) is always discounted by \\({(1+r)}^{{t}_{2}}\\), regardless of the considered damage measure for δj,I,i. This implies that, when considering the RP250 scenario, the discounting for changes in gL is still \\({(1+r)}^{{t}_{2}}\\) and not (1 + r)250. The parameter δj,I,i depends on the firm- and business line-specific loss due to acute risk conditioned to scenario I for sector (business line) i; si is the applicable revenue share for business line i, and Kj represents the total number of business lines for firm j. We design δj,i as a firm- and business line-specific variable computed as an average of all δa,j,i, i.e., the impact for all physical assets a owned by firm j contributing to business line i. In our application, δa,j,i depends on three main parameters for the asset: its monetary value, its residual useful life, and the impact from tropical cyclones computed in CLIMADA.\nwhere Ra is the residual life of asset a, f(Ra) a coefficient proportional to the residual life (for the purpose of this application, \\(f({R}_{a})=\\frac{1}{\\tau }{R}_{a}\\), where τ equals 1 year), Va is the value of asset a, La is the impact on asset a. Thus, ηa represents an estimate of the relative impact (i.e., fraction of the asset value) on assets from tropical cyclones, taking into account the residual life of the asset. Importantly, δj is floored to 1 and capped to 2, i.e., we assume that firms do not benefit from having physical assets less exposed to climate physical risk, hence simply follow the general sectoral trajectories of their business lines. This assumption is made for simplicity, since assessing the existence of positive effects stemming from asset location requires an analysis which is beyond the scope of the paper. Note that the estimate of δj,I,i is computed on available assets but applied to the full business line.\nCombining Eqs. (7) and (8) we obtain the CDDM formulation for the adjusted equity value (\\({\\tilde{V}}_{0,I,j}\\)):\nWhere \\({\\tilde{g}}_{L,I,j}\\) is the adjusted growth rate as per Eq. (8) and \\({\\tilde{V}}_{0,I,j}\\) is the adjusted equity valuation conditioned to a given impact scenario I. Thus the combined equity shock, stemming from the revaluation of shares considering chronic and acute physical risks, is given by:\nTo interpret the equity shock we proceed as follows. The asset-level impact from tropical cyclones is a random variable Ia. Characterizations of its distribution in terms of EAI and RP are provided by CLIMADA. Since Ia is a random variable, then \\({\\tilde{g}}_{L}\\), \\({\\tilde{V}}_{0,j,I}\\) and \\( {\\psi }_{j}\\), being functions of Ia are also random variables and the distributions of their values could be generated from the distribution of the values of Ia.\nHowever, this is a computationally expensive procedure. For the purpose of this paper, we extract selected moments and quantiles of the distribution of Ia, and compute \\({\\tilde{g}}_{L}\\), \\({\\tilde{V}}_{0,j,I}\\) and \\( {\\psi }_{j}\\) only for those moments and quantiles. Specifically, we select the first moment, i.e., the expected annual impact (EAI) and the 99.6th quantile (RP250). Note that with regard to the estimation of Value at Risk, since the loss on equity valuation is an increasing function of the economic loss, the quantiles of the adjusted equity valuation (\\({\\tilde{V}}_{0,j,I}\\)) are equivalent to the adjusted valuation computed on the quantiles. In contrast, regarding the estimation of expected annual impact, we approximate the average of the adjusted equity valuation (\\({\\tilde{V}}_{0,j,I}\\)) with the adjusted valuation computed on the average of the impact (Ia). Hence, we assume that using EAI for the equity valuation leads to computing the average adjusted valuation. Similarly, we assume that using RP250 for the equity valuation leads to computing the Value at Risk (VaR) of a firm’s adjusted valuation. As such, for firms, the equity value computed using EAI represents an average equity value from the distribution of possible values considering physical risks. Similarly, the equity value computed using RP250 represents a percentile, or a VaR, of the distribution of possible equity values considering physical risks. Thus, the interpretation of the adjusted equity value is as follows. The firm has multiple possible growth paths in the long run. The equity value computed using RP250 corresponds to a future where the firm suffers damages from tropical cyclones that are comparable in magnitude to the ones emerging from an RP250 hurricane conditioned to a given climate scenario. Similarly, the equity value computed using EAI corresponds to a future where the firm suffers damages from tropical cyclones that are comparable in magnitude to the yearly expected damages. Importantly, also Oi,I is a realization of a random variable and we can interpret it to be an average chronic risk impact. Analysing the relation between the two random variables is out of the scope of this paper. As such, we treat the realization Oi,j as an average of chronic risks. We assume the equity valuation computed with the product of Oi,j and average acute risks (EAI) approximates the average equity valuation considering physical risks. Similarly, we treat the combination of the realization of Oi,I and RP250 as a (tail) percentile. The interpretation is the same also in the presence of chronic risks: firms are supposed to be exposed to effects corresponding to a given hurricane and to chronic effects as described by Oi,I, conditioned to a given climate scenario. Also, the adjusted equity value computed combining chronic risk and EAI still represents an average value, and the adjusted equity value computed combining chronic and RP250 still represents a VaR.\nImportantly, in Eq. (8), δj,I,i is computed using the relative damages to assets as calculated by the CLIMADA model. Thus, in our model the impact of acute shocks on the firm is captured in a reduced form as adjustment in the growth rate of the firm. In this treatment, the ratio of asset damages (as computed in Eq. (1) using the damage function) links acute risks to the growth rate. Hence, it is not necessary to model the growth of assets explicitly. This approach is also consistent with the one followed in the macroeconomic model ICES. In fact, ICES represents the impacts of climate change either as changes in productivity or as losses on physical capital and land. Thus, the focus on relative losses to assets is consistent with the treatment of physical capital in the macroeconomic model.\nThe CDDM is computed conditioned to the following scenario combinations: SSP2-RCP6.0, SSP3-RCP2.6, SSP3-RCP4.5, SSP5-RCP4.5. In our model, the computation of the value of the firm takes into account the year span from 2022 to 2050. We assume firms are subject to climate impacts from 2035 onward, the period which captures the long run in the current treatment of the model. To proxy these impacts, we use a reference year for both the ICES model and tropical cyclones, namely 2040 (climate models’ estimates at years 2035, 2040, 2045, 2050 are not distinguishable anyway in statistical sense47). In particular, the estimate of tropical cyclones' impacts at 2040 is obtained following a common approach in the literature based on a linear approach interpolation of the impacts between 2020 and 2100 (see e.g., refs. 21 and 36). Thus, for the valuation conditioned to e.g., scenario SSP2-RPC6.0, year 2040, ICES data are considered for SSP2-RCP6.0, year 2040, and tropical cyclones impacts are considered for RCP6.0, year 2040. Other years are not considered. Finally using a certain year to compute gL does not imply extending the dividend stream until that year, but only computing Eq. (8) with values for Oj,I and δj,I,i for that year.\nThe full CDDM is applied to all firms with at least two datapoints available for EPS. For non-dividend paying stocks or stocks with missing data, we compute the equity shock as follows:\n-\nFor stocks paying no dividend, or with no dividend data, we revert to direct shocks, i.e., \\({\\psi }_{j}={\\tilde{g}}_{L,I,j}-{g}_{L}\\).\n-\nFor stocks with data available only for the first period, we compute a one period version of the CDDM following \\({\\tilde{V}}_{0,j}=\\frac{{D}_{0}}{r-{\\tilde{g}}_{L,I,j}}\\).\nAnalysis using proxy data\nWe compare the portfolio-level results for losses computed using proxy data vs asset-level data. The purpose of this analysis is to quantify the relevance of the underestimation of physical risk that stems from neglecting asset-level data. To compute the results with proxy data, we replace asset-level data with one location per firm and use information on physical risk at this location to proxy physical risks for the firm. Thus, the CDDM model is computed for the same firms both using asset-level data and using only one location (i.e., proxy data). Business lines are used for comparability, i.e., the valuation is applied only to those business lines that are adjusted in the asset-level analysis. The single location is either the headquarter (for Mexican firms), the address of the Mexican subsidiary with highest ownership (for non-Mexican firms with Mexican subsidiaries) or Mexico City (for non-Mexican firms without Mexican subsidiaries). All addresses are geolocalised using Opencage API (https://opencagedata.com/) and checked manually.\nFor the one location, the value exposed to acute physical risks is given either by the firm’s Property, plant and equipment (PPE) (Variable “property plant & equipment—net total”, sourced from Refinitiv Eikon) (if larger than 1 million USD) or by its Total assets (TA) (Variable “total assets\", sourced from Refinitiv Eikon). Using the methodology described in Subsection Asset-level assessment, we assess impacts from CLIMADA on PPE or TA at the single location. We combine the losses from tropical cyclones with chronic risks computed from ICES and plug them in the CDDM. For comparability purposes, we use δ only on those business lines which can be impacted at the asset level. Otherwise, applying δ to business lines that cannot be impacted would impair the comparability of the counterfactual analysis. Subsequent statistics (e.g., VaR) are computed as in the version of the model using all asset information.\nLimitations\nThe following remarks complement the limitations acknowledged in the Discussion. First, we account for uncertainties on financial portfolio loss (VaR, mean) estimating the confidence intervals (CI) using bootstrapping (see e.g., ref. 30). Including the sources of uncertainties mentioned in the Discussion would likely lead to larger CI. Second, the reader should be aware that there is considerable uncertainty regarding the effects of climate change on the frequency and intensity of tropical cyclones for the middle of the century especially at less-than continental scale. The methodology we applied here to quantify damages around the middle of the century builds on relevant literature in the field and relies on interpolation (e.g., refs. 21 and 36). Third, we do not consider firms’ adaptation measures (such as sea barriers or mangroves) due to lack of data on firms’ adaptation strategies38. Adaptation may vary across firms, and different firms may follow different schedules to implement adaptation measures. Moreover, many adaptation measures generally considered in the literature (e.g., mangroves for coastal protection, as in ref. 36) are not relevant for the types of assets that we analyse here. Similarly, relocation is not feasible for most of the assets we consider (e.g., mines or power plants must be located where natural resources are located). Existing calibrations of adaptation measures are either based on assumptions (e.g., ref. 36 in the case of the effect of mangroves on tropical cyclones’ winds) or specific to individual countries and thus not applicable to Mexico (e.g., ref. 21). Furthermore, Mexico invests very little in adaptation52,53. Fourth, information on assets’ location, ownership, value and residual life is often missing and has to be estimated. Moreover, some non-core firms’ assets (e.g., deposits, warehouses) may be unknown even for firms where asset-level data are available. Furthermore, for some assets it is not possible to reconstruct ownership chains, or the unlisted nature of some of the owners makes the link to equity financial portfolios not possible. Fifth, in our assessment, we consider only one country (Mexico), one hazard (tropical cyclones), a selection of asset types (mostly energy-related), and one financial asset class (equities). Thus, our results in terms of financial risk for investors are conservative. Sixth, short-term risks are generally downplayed both in the macroeconomic model framework used (see ref. 23 for a discussion), and in the CDDM. Finally, we consider only direct impacts of tropical cyclones, and not their indirect ones such as supply chain disruptions, damage to infrastructure other than the assets in the sample, or loss of lives.\nData availability\nThe data that support the findings of this study are available from S&P and Refinitiv Eikon, but restrictions apply to the shareability of these data, which were used under license for the current study, and so are not publicly available. Data are however available from the authors upon justified request subject to licensing agreements with S&P and Refinitiv Eikon.\nCode availability\nThe codes that support the findings of this study can be made available upon request for the purpose of academic research.\nReferences\nIPCC. Summary forpolicymakers. In Climate Change 2021: the physical science basis. Contribution of Working Group I to the Sixth Assessment Report of the Intergovernmental Panel on Climate Change (eds Masson-Delmotte, V. et al.) 3–32 (Cambridge University Press, Cambridge, United Kingdom and New York, 2021).\nIPCC. Summary for policymakers. In Climate change 2022: impacts, adaptation and vulnerability. Contribution of Working Group II to the Sixth Assessment Report of the Intergovernmental Panel on Climate Change (eds Portner, H.-O. et al.) 3–33 (Cambridge University Press, Cambridge, United Kingdom and New York, 2022).\nUNEP. United Nations Environment Programme. Adaptation Gap Report 2021: the Gathering Storm - Adapting to Climate Change in a Post-pandemic World. Tech. Rep., Nairobi (UNEP, 2021), https://www.unep.org/resources/adaptation-gap-report-2021.\nSimpson, N. P. et al. A framework for complex climate change risk assessment. One Earth 4, 489–501 (2021).\nFiedler, T. et al. Business risk and the emergence of climate analytics. Nat. Clim. Change 11, 87–94 (2021).\nRanger, N., Mahul, O. & Monasterolo, I. Assessing financial risks from physical climate shocks: a framework for scenario generation. Equitable Growth, Finance & Institutions Insight; Other Financial Sector Studies https://openknowledge.worldbank.org/handle/10986/37041 (2022).\nHallegatte, S., Rentschler, J. & Rozenberg, J. Adaptation Principles: A Guide for Designing Strategies for Climate Change Adaptation and Resilience. Tech. Rep. 154414 (2020), https://documents.worldbank.org/en/publication/documents-reports/documentdetail/546611605298449211/the-adaptation-principles-a-guide-for-designing-strategies-for-climate-change-adaptation-and-resilience.\nGCA. Global Center on Adaptation. Adaptation Finance in the Context of Covid-19. The Role of Development Finance in Promoting a Resilient Recovery. Tech. Rep., Rotterdam (GCA, 2021), https://gca.org/reports/adaptation-finance-in-the-context-of-covid-19/.\nMullan, M. & Ranger, N. Climate-resilient finance and investment. OECD Environment Working Papers https://www.oecd-ilibrary.org/content/paper/223ad3b9-en (2022).\nKreibiehl, S. et al. Investment and finance. In Climate change 2022: mitigation of climate change. Contribution of Working Group III to the Sixth Assessment Report of the Intergovernmental Panel on Climate Change (eds Shukla, P. et al.) (Cambridge University Press, Cambridge, United Kingdom and New York, 2022).\nChapagain, D., Baarsch, F., Schaeffer, M. & D’haen, S. Climate change adaptation costs in developing countries: insights from existing estimates. Clim. Dev. 12, 934–942 (2020).\nHain, L. I., Kölbel, J. F. & Leippold, M. Let’s get physical: comparing metrics of physical climate risk. Financ. Res. Lett. 46, 102406 (2022).\nAznar-Siguan, G. & Bresch, D. N. CLIMADA v1: a global weather and climate risk assessment platform. Geosci. Model Dev. 12, 3085–3097 (2019).\nGiglio, S., Maggiori, M., Rao, K., Stroebel, J. & Weber, A. Climate change and long-run discount rates: evidence from real estate. Rev. Financ. Stud. 34, 3527–3571 (2021).\nNguyen, D. D., Ongena, S., Qi, S. & Sila, V. Climate change risk and the cost of mortgage credit. Rev. Financ. 26, 1509–1549 (2022).\nNguyen, Q. et al. Price recovery after the flood: risk to residential property values from climate change-related flooding. Aust. J. Agric. Resour. Econ. 66, 532–560 (2022).\nEberenz, S., Stocker, D., Röösli, T. & Bresch, D. N. Asset exposure data for global physical risk assessment. Earth Syst. Sci. Data 12, 817–833 (2020).\nVitali, S., Glattfelder, J. B. & Battiston, S. The network of global corporate control. PLoS ONE 6, e25995 (2011).\nGarcia-Bernardo, J., Fichtner, J., Takes, F. W. & Heemskerk, E. M. Uncovering offshore financial centers: conduits and sinks in the global corporate ownership network. Sci. Rep. 7, 1–10 (2017).\nAznar-Siguan, G. et al. Climada-project/climada_python: v3.2.0 https://doi.org/10.5281/zenodo.6807463 (2022).\nBresch, D. N. & Aznar-Siguan, G. Climada v1. 4.1: towards a globally consistent adaptation options appraisal tool. Geosci. Model Dev. 14, 351–363 (2021).\nParrado, R., Bosello, F. & Standardi, G. Macroeconomic assessment of Climate Change Impacts (Version 1) [Data set]. Zenodo. https://doi.org/10.5281/zenodo.5546248 (2021).\nEboli, F., Parrado, R. & Roson, R. Climate-change feedback on economic growth: explorations with a dynamic general equilibrium model. Environ. Dev. Econ. 15, 515–533 (2010).\nParrado, R. & De Cian, E. Technology spillovers embodied in international trade: intertemporal, regional and sectoral effects in a global CGE framework. Energy Econ. 41, 76–89 (2014).\nGordon, M. J. & Shapiro, E. Capital equipment analysis: the required rate of profit. Manag. Sci. 3, 102–110 (1956).\nGordon, M. J. Dividends, earnings, and stock prices. Rev. Econ. Stat. 41, 99–105 (1959).\nGordon, M. J. The Investment, Financing, and Valuation of the Corporation (R.D. Irwin, Homewood, Ill., 1962).\nSharpe, W. F., Alexander, G. J. & Bailey, J. V. Investments, 6th edn. (Prentice-Hall, Englewood Cliffs, 1999).\nWilliams, J. B. The Theory of Investment Value (Harvard University Press, Cambridge, 1938).\nDiCiccio, T. J. & Efron, B. Bootstrap confidence intervals. Stat. Sci. 11, 189 – 228 (1996).\nHong, H., Li, F. W. & Xu, J. Climate risks and market efficiency. J. Econ. 208, 265–281 (2019).\nAligishiev, Z., Massetti, E. & Bellon, M. Macro-fiscal implications of adaptation to climate change. In IMF Climate Notes, Staff Climate Note No 2022/002 (International Monetary Fund, 2022), https://www.imf.org/en/Publications/staff-climate-notes/Issues/2022/03/16/Macro-Fiscal-Implications-of-Adaptation-to-Climate-Change-512769.\nDunz, N., Hrast Essenfelder, A., Mazzocchetti, A., Monasterolo, I. & Raberto, M. Compounding COVID-19 and climate risks: the interplay of banks’ lending and government’s policy in the shock recovery. J. Bank. Finance https://www.sciencedirect.com/science/article/pii/S0378426621002582 (2021).\nKruczkiewicz, A. et al. Multiform flood risk in a rapidly changing world: what we do not do, what we should and why it matters. Environ. Res. Lett. 17, 081001 (2022).\nKropf, C. M. et al. Uncertainty and sensitivity analysis for probabilistic weather and climate-risk modelling: an implementation in CLIMADA v.3.1.0. Geosci. Model Dev. 15, 7177–7201 (2022).\nRana, A., Zhu, Q., Detken, A., Whalley, K. & Castet, C. Strengthening climate-resilient development and transformation in Viet Nam. Clim. Change 170, 4 (2022).\nUCLouvain, C. /. EM-DAT: the CRED/OFDA international disaster database. www.emdat.be (2009).\nGoldstein, A., Turner, W. R., Gladstone, J. & Hole, D. G. The private sector’s climate change risk and adaptation blind spots. Nat. Clim. Change 9, 18–25 (2019).\nEuropean Commission (EC). Communication from the Commission COM(2021) 82 final. Forging a climate-resilient Europe—the new EU strategy on adaptation to climate change https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=CELEX:52021DC0082 (2021).\nECB/ESRB. The Macroprudential Challenge of Climate Change. Tech. Rep. (ECB/ESRB Project Team on Climate Risk Monitoring, 2022), https://www.esrb.europa.eu/pub/pdf/reports/esrb.ecb.climate_report202207~622b791878.en.pdf.\nWestcott, M. et al. Be prepared: exploring future climate-related risk for residential and commercial real estate portfolios. J. Alternative Invest. 23, 24–34 (2020).\nEuropean Parliament and Council of the European Union. Directive (EU) 2022/2464 of the European Parliament and of the Council of 14 December 2022 https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=CELEX:32022L2464 (2022).\nPidun, U. Corporate Portfolio Analysis, 55–93 (Springer Fachmedien Wiesbaden, Wiesbaden, 2019).\nSchaeffer, R. et al. Energy sector vulnerability to climate change: a review. Energy 38, 1–12 (2012).\nHong, H., Karolyi, G. A. & Scheinkman, J. A. Climate finance. Rev. Financ. Stud. 33, 1011–1023 (2020).\nGeiger, T., Gütschow, J., Bresch, D. N., Emanuel, K. & Frieler, K. Double benefit of limiting global warming for tropical cyclone exposure. Nat. Clim. Change 11, 861–866 (2021).\nKnutson, T. R. et al. Global projections of intense tropical cyclone activity for the late twenty-first century from dynamical downscaling of cmip5/rcp4.5 scenarios. J. Clim. 28, 7203–7224 (2015).\nEmanuel, K. Global warming effects on U.S. hurricane damage. Weather Clim. Soc. 3, 261–268 (2011).\nEberenz, S., Lüthi, S. & Bresch, D. N. Regional tropical cyclone impact functions for globally consistent risk assessments. Nat. Hazards Earth Syst. Sci. 21, 393–415 (2021).\nEmanuel, K. & Jagger, T. On estimating hurricane return periods. J. Appl. Meteorol. Climatol. 49, 837–844 (2010).\nGiglio, S., Kelly, B. & Stroebel, J. Climate finance. Annu. Rev. Financ. Econ. 13, 15–36 (2021).\nClimate Action Tracker. Country summary: Mexico. https://climateactiontracker.org/countries/mexico/ (2022).\nEscudero, M. & Mendoza, E. Community perception and adaptation to climate change in coastal areas of Mexico. Water 13, 2483 (2021).\nAcknowledgements\nG.B., A.Đ., and I.M. acknowledge the financial support of the European Commission H2020-funded CASCADES (CAScading Climate risks: towards ADaptive and Resilient European Societies) project, number 821010. All authors are very grateful to Adrian von Jagow (WU Wien) for support with initial data work; Chahan Kropf (ETH Zurich) for discussion about the implementation of CLIMADA; Nepomuk Dunz (the World Bank), Marie Briere (Amundi) and Stefano Ramelli (St Gallen University), the participants of the 15th International Financial Risk Forum 2022 and of the GRASFI conference 2022 for their useful comments on the initial draft. All authors are particularly grateful to Francesco Bosello, Elisa Delpiazzo and Ramiro Parrado (Euro - Mediterranean Centre on Climate Change (CMCC), and Ca’ Foscari University of Venice) for their comments and support in implementing the results of the ICES macroeconomic model and COACCH project’s results into the analysis. The usual disclaimer applies.\nAuthor information\nAuthors and Affiliations\nContributions\nThe authors contributed equally to the conceptualization of the manuscript. I.M., S.B., and G.B. led the writing of the manuscript. A.Đ. developed the database model. G.B. wrote the computer code.\nCorresponding authors\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\nPeer review\nPeer review information\nNature Communications thanks David Bresch and the other, anonymous, reviewer(s) for their contribution to the peer review of this work. A peer review file is available.\nAdditional information\nPublisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\nSupplementary information\nRights and permissions\nOpen Access This article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article’s Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article’s Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit http://creativecommons.org/licenses/by/4.0/.\nAbout this article\nCite this article\nBressan, G., Đuranović, A., Monasterolo, I. et al. Asset-level assessment of climate physical risk matters for adaptation finance. Nat Commun 15, 5371 (2024). https://doi.org/10.1038/s41467-024-48820-1\nReceived:\nAccepted:\nPublished:\nDOI: https://doi.org/10.1038/s41467-024-48820-1\nThis article is cited by\n-\nMapping global financial risks under climate change\nNature Climate Change (2025)\n-\nExample dependent cost sensitive learning based selective deep ensemble model for customer credit scoring\nScientific Reports (2025)\n-\nClimate Risk and Corporate Rescues\nEuropean Business Organization Law Review (2025)"
    },
    {
      "url": "https://www.imperial.ac.uk/business-school/faculty-research/research-centres/centre-climate-finance-investment/research/financing-adaptation-and-resilience-london-and-the-uk-moving-aspiration-reality/",
      "text": "This research project, published by the Singapore Green Finance Centre (a joint initiative of Singapore Management University (SMU) and Imperial College London), divided into three separate papers, takes a practical approach by focusing on the real estate and water sectors in London and the UK.\nBased on industry insights, this three-part research is part of the “Financing Adaptation and Resilience in London and the UK” project. The project identifies and discusses drivers and challenges for investing in adaptation and resilience and necessary changes for developing capital market solutions in London and the UK. This research has been conducted by the Centre for Climate Finance & Investment (CCFI) at Imperial Business School and the Singapore Green Finance Centre, following papers focusing on adaptation and nature financing (Buhr, B. (2022; Holtedahl, P., Köberle, A. & Koci I. (2023); Whittaker, S. & Nguyen, T. (2023)).\nFinancing Adaptation and Resilience in London and the UK: Moving from Aspiration to Reality – Part I – Case Studies Analysis\nJune 2024 | Authors: Stella Whittaker, Raffaele Della Croce, Claudia Hlavackova\nPart I: Case Studies Analysis of the research project highlights various adaptation and resilience investment and financing models, with eight case studies in London and the UK. The analysis responds to the following three questions: What is the investment proposition and the role of the private sector in adaptation and resilience? What are the main investment models and financing instruments for private investors in these areas? What are the major investment drivers for institutional investors such as pension funds and insurers?\nFinancing Adaptation and Resilience in London and the UK: Moving from Aspiration to Reality – Part II – Urban Adaptation Financing\nAugust 2024 | Authors: Stella Whittaker, Raffaele Della Croce, Claudia Hlavackova, Phuong Nguyen\nPart II: Urban Adaptation Financing delves into the current state of adaptation finance in London, making a comparison with Copenhagen and Singapore. This comparison is particularly significant as it allows us to draw lessons from cities with different approaches and experiences, enriching our understanding of urban adaptation financing. The research primarily focuses on private investment and aims to learn about the experience of London (covering the greater London area) in the delivery of climate finance and financing for urban climate change adaptation and understand the potential barriers and opportunities to mobilising finance. The research question ‘To what extent can cities and investors build for innovation in climate adaptation in cities?’ aims to inform and promote a better understanding of financing for climate change adaptation actions.\nFinancing Adaptation and Resilience in London and the UK: Moving from Aspiration to Reality – Part III – Policy Recommendations\nNovember 2024 | Authors: Raffaele Della Croce, Stella Whittaker, Claudia Hlavackova\nPart III: Policy Recommendations develops policy recommendations, taking into consideration the current policy context. Drawing on insights from the case studies analysis and the London urban adaptation finance research (Part I and II), this paper develops several recommendations; addressing policymakers, regulators, and the financial industry — primarily banks, asset managers,exchanges, and marketplaces. Several recommendations need to be addressed simultaneously to enable private investment into adaptation in London and the UK and these activities need to be embraced byall actors: investors, regulators, Government, Ofwat, The Bank of England, standard setting agencies,corporations, and development companies.\nKey takeaways:\nCities are highly vulnerable to climate change, and London faces increasing risks from extreme rainfall, flooding, storm surges, and droughts. Without substantial investments in adaptation, urban areas, their economies, infrastructure, and inhabitants face significant vulnerability to climate-induced extreme events, resulting in substantial costs. At the urban level, climate change intersects with health, social, and economic inequalities. As climate change does not impact the population in the same way, it is critical to identify those who are most exposed and vulnerable to climate hazards.\nLondon lags behind other cities, such as Singapore and Copenhagen, in its adaptation financing efforts. As reported by the London Climate Resilient Review, published last July, a lack of financial and human resources is a major challenge to the implementation of adaptation measures at the local level. Despite its reputation as a green finance centre, London relies heavily on public funds, highlighting the need for greater involvement of private capital. The policy and financing ecosystem in Greater London is fragmented, with multiple layers of policies and funding sources not aggregated. While planning and strategic initiatives have been present longer, financing initiatives have only started to emerge more recently.\nInvesting in nature-positive city infrastructure remains crucial to addressing biodiversity loss and climate change impacts. Urban vegetation, including street trees, green roofs, and green walls in urban green spaces and green buildings, can be a crucial adaptation measure for heat and air pollution risks while enhancing biodiversity. Bioswales, rain gardens, and retention ponds can improve flood management and soil quality. To fully appreciate the wide range of ecosystem benefits generated by natural capital and nature-based solutions in cities, economic valuation has gained a significant role.\nInvestors are undertaking climate-proofing measures for infrastructure and property driven by new regulations such as the Biodiversity Net Gain and TNFD Guidance. Measures include retrofitting office buildings with energy-efficient systems, installing flood barriers, and diversifying their investment portfolios to include more climate-resilient assets.\nThe London housing crisis is an opportunity to rethink urban planning and better incorporate social and environmental sustainability. London is currently facing a severe housing crisis with a shortfall of over 60,000 homes, affecting the most vulnerable members of the population. To improve urban adaptation and preserve biodiversity, we need changes in human behaviour driven by holistic urban planning, sustainable transportation, and incentives highlighting sector interconnections.\nThere are opportunities at the local level to innovate in climate finance, such as mobilising community and cooperative forms of finance, crowdfunding, or extending the Green Gilts and Bonds offered by the government and National Savings and Investment (N&SI) to allow investors and retail savers to contribute to the supply of capital for adaptation.\nThe UK Infrastructure Bank has a significant role in supporting local capability in addition to financing. It can contribute with dedicated lending offerings for climate projects or borrow from markets through Green and Sustainable Bonds. Developing a local municipal bond market in the UK requires setting local adaptation plans and targets.\nSingapore offers best practices for Greentech and new instruments for insurers to cover the protection gap. Global reinsurers are developing digitalisation, data analytics, and sustainability solutions for bespoke disaster risk financing, carbon credits, and renewable energy infrastructure. Given the sizeable protection gaps in Asia, Singapore is also focusing on better data for climate and alternative risk transfer instruments to expand capacity and become a hub for the region. The Monetary Authority of Singapore has a leading role and is focusing in particular on three alternative risk transfer initiatives: insurance-linked securities, captive insurance, and sovereign catastrophe risk pools.\nArtificial intelligence technology and ‘big data’ can help financial actors manage hazard risks more effectively while offering investment opportunities. Technologies such as digital twins, remote sensing, and smart sensors can be leveraged to provide regularly updated and automated information processes, thus enabling regular monitoring of the status of infrastructure systems and their resilience. However, while synergies between FinTech and sustainable finance are promising, the broader trend towards digitalisation in economic and financial realms necessitates careful consideration of associated trade-offs, such as the increased energy use of data centres."
    }
  ],
  "argos_summary": "Businesses are increasingly facing climate-related risks, such as extreme weather events, and are struggling to finance necessary adaptation measures. A report from the Imperial Business School highlights that UK businesses may underestimate potential investor losses from these risks by up to 82%. The report emphasizes the urgent need for substantial investments in climate adaptation, estimating that the UK requires between £5 billion and £10 billion annually, while currently spending less than £1 billion. Additionally, it notes that London is lagging behind cities like Singapore and Copenhagen in adaptation financing efforts.",
  "argos_id": "XRGPOD2DK"
}