{
  "url": "https://www.pcmag.com/news/patch-now-new-winrar-flaw-used-to-deliver-malware",
  "authorsByline": "Michael Kan",
  "articleId": "6e0576bc5a1b4cf9aaa223f2ab66f6ee",
  "source": {
    "domain": "pcmag.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.pcmag.com/imagery/articles/07d3pplUnWwOsD5WOSoLU3S-1.fit_lim.size_1200x630.v1754689821.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T22:19:20+00:00",
  "addDate": "2025-08-08T22:32:37.065722+00:00",
  "refreshDate": "2025-08-08T22:32:37.065724+00:00",
  "score": 1.0,
  "title": "Patch Now: New WinRAR Flaw Used to Deliver Malware",
  "description": "ESET discovers a Russian hacking group exploiting the vulnerability to deliver malware through phishing emails. WinRAR patched it, but it's up to users to install version 7.13.",
  "content": "Security researchers have discovered a new flaw in WinRAR that was recently exploited to spread malware through phishing emails.\n\nThe flaw, CVE-2025-8088, can be harnessed through maliciously crafted archive files, according to BleepingComputer, which first reported on the vulnerability.\n\nNormally, WinRAR is supposed to extract files from an archive to the user's specified path. But through the flaw, it looks like a booby-trapped file can extract the data to a hacker-selected path, creating a way to execute rogue computer code on a victim’s machine, including Windows PCs running WinRAR.\n\nThree researchers at antivirus provider ESET discovered the vulnerability. Although details are thin, the company told PCMag it’s “observed spearphishing emails with attachments containing RAR files. These archives exploited the CVE-2025-8088 to deliver RomCom backdoors. RomCom is a Russia-aligned group.” Past versions of RomCom malware can steal sensitive data and install other malicious payloads.\n\nThe good news is that WinRAR patched the vulnerability last week with version 7.13 Final . Unfortunately, the popular file-archiving tool doesn’t feature an auto-update mechanism. So it’ll be up to users to manually download and install the new version to receive protection, otherwise they’ll remain at risk.\n\nIn the release notes, WinRAR said the problem affects “previous versions of WinRAR, Windows versions of RAR, UnRAR, portable UnRAR source code and UnRAR.dll.” However, Unix versions of RAR, UnRAR, portable UnRAR source code and UnRAR library, and RAR for Android, are not affected.\n\nAs a free archive utility, WinRAR has attracted over 500 million users. In June, WinRAR also patched a separate flaw that could be exploited through booby-trapped archive files as well.",
  "medium": "Article",
  "links": [
    "https://www.win-rar.com/singlenewsview.html?&L=0&tx_ttnews%5Btt_news%5D=283&cHash=a64b4a8f662d3639dec8d65f47bc93c5",
    "https://nvd.nist.gov/vuln/detail/CVE-2025-8088",
    "https://www.pcmag.com/terms",
    "https://twitter.com/Michael_Kan",
    "https://www.pcmag.com/news/winrar-fixes-flaw-involving-booby-trapped-archive-files-that-install-malware",
    "https://www.pcmag.com/news/with-gpt-5-openai-promises-access-to-phd-level-ai-expertise",
    "https://www.pcmag.com/how-to/how-to-figure-out-if-your-phone-has-malware",
    "https://www.pcmag.com/cdn-cgi/l/email-protection#c4a9ada7aca5a1a89bafa5aa84b4a7a9a5a3eaa7aba9",
    "https://www.bleepingcomputer.com/news/security/winrar-zero-day-flaw-exploited-by-romcom-hackers-in-phishing-attacks/",
    "https://www.pcmag.com/news/openai-faces-backlash-for-retiring-older-models-with-gpt-5-launch",
    "https://www.linkedin.com/in/michael-kan-29603514",
    "https://www.pcmag.com/news/starlink-nabs-federal-broadband-funds-but-fiber-is-still-the-big-winner",
    "https://twitter.com/CVEnew/status/1953781653509484674",
    "https://www.pcmag.com/authors/michael-kan",
    "https://malpedia.caad.fkie.fraunhofer.de/actor/romcom",
    "https://www.pcmag.com/news/ham-radio-users-explain-why-theyre-worried-about-ast-spacemobiles-satellite",
    "https://www.pcmag.com/news/tsmc-samsung-might-be-spared-from-trumps-100-chip-tariff",
    "https://www.pcmag.com/news/black-hat-2025-hackers-take-over-security-cameras-easier-than-you-think",
    "https://www.pcmag.com/news/this-chatgpt-flaw-could-have-let-hackers-steal-your-google-drive-data",
    "https://www.pcmag.com/privacy",
    "https://www.rarlab.com/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "New WinRAR Flaw",
      "weight": 0.1225417
    },
    {
      "name": "RAR files",
      "weight": 0.10194236
    },
    {
      "name": "WinRAR",
      "weight": 0.1003467
    },
    {
      "name": "Windows versions",
      "weight": 0.09720244
    },
    {
      "name": "previous versions",
      "weight": 0.0920385
    },
    {
      "name": "portable UnRAR source code",
      "weight": 0.09184084
    },
    {
      "name": "Past versions",
      "weight": 0.08811567
    },
    {
      "name": "Unix versions",
      "weight": 0.08785264
    },
    {
      "name": "version",
      "weight": 0.08730015
    },
    {
      "name": "files",
      "weight": 0.08486742
    }
  ],
  "topics": [
    {
      "name": "Security Breach"
    },
    {
      "name": "Malware"
    },
    {
      "name": "Security"
    },
    {
      "name": "Cyber Crime"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Computer Security/Network Security",
      "score": 0.90380859375
    },
    {
      "name": "/News/Technology News",
      "score": 0.8701171875
    },
    {
      "name": "/Computers & Electronics/Computer Security/Hacking & Cracking",
      "score": 0.7080078125
    },
    {
      "name": "/Computers & Electronics/Computer Security/Other",
      "score": 0.47802734375
    }
  ],
  "sentiment": {
    "positive": 0.05517578,
    "negative": 0.6425781,
    "neutral": 0.3022461
  },
  "summary": "Security researchers have discovered a new flaw in WinRAR that can be exploited to spread malware through phishing emails. The flaw, CVE-2025-8088, can be harnessed through maliciously crafted archive files. This flaw allows a booby-trapped file to extract data from an archive to a hacker-selected path, creating a way to execute rogue computer code on a victim’s machine, including Windows PCs running WinRar. The vulnerability was discovered by researchers from antivirus provider ESET. Despite patching the flaw last week, users will need to manually download and install the new version.",
  "shortSummary": "Security researchers discovered a WinRAR vulnerability that can be exploited to distribute malware via phishing emails, requiring automatic software updates.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "71b449adeb4b4ba396d60a5a97c0293e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.win-rar.com/singlenewsview.html?&L=0&tx_ttnews%5Btt_news%5D=283&cHash=a64b4a8f662d3639dec8d65f47bc93c5",
      "text": "< WinRAR 7.13 Beta 1 released\n30.07.2025 13:30 Age: 9 days\nWinRAR 7.13 Final released\nRelease date: 30.07.2025\n-\nAnother directory traversal vulnerability, differing from that\nin WinRAR 7.12, has been fixed.\nWhen extracting a file, previous versions of WinRAR, Windows versions of RAR, UnRAR, portable UnRAR source code and UnRAR.dll can be tricked into using a path, defined in a specially crafted archive, instead of user specified path.\nUnix versions of RAR, UnRAR, portable UnRAR source code and UnRAR library, also as RAR for Android, are not affected.\nWe are thankful to Anton Cherepanov, Peter Kosinar, and Peter Strycek from ESET for letting us know about this security issue.\n-\nBugs fixed:\n-\nWinRAR 7.12 \"Import settings from file\" command failed to restore\nsettings, saved by WinRAR versions preceding 7.12;\n-\nWinRAR 7.12 set a larger than specified recovery size for compression\nprofiles, created by WinRAR 5.21 and older.\n-\nWinRAR 7.12 \"Import settings from file\" command failed to restore\nsettings, saved by WinRAR versions preceding 7.12;\nAbout win.rar GmbH:\nwin.rar GmbH has been the official distributor of WinRAR and RARLAB products since February 2002 and handles all support, marketing and sales related to WinRAR & rarlab.com. win.rar GmbH is registered in Germany and is represented worldwide by local partners in more than 40 countries on six continents. win.rar's declared objective is to provide first-class quality support and to optimize its software to meet customer's requirements in accordance with their valued feedback. For more information about WinRAR and win.rar GmbH please visit our website: www.win-rar.com\nThe beta download links are being expired after the final release!"
    },
    {
      "url": "https://www.linkedin.com/in/michael-kan-29603514",
      "text": "“Michael was a tremendous asset to IDG News Service in his time covering China's technology industry for us. He developed good sources and did plenty of in-person \"shoe leather\" reporting to keep ahead of developments with major players such as Alibaba, and Xiaomi when it first started to break out. He travelled to manufacturing centers to do first-hand reporting on labor issues in the electronics supply chain, and proved to have a talent for both photography and video. Michael is also an unfailingly nice guy to work with, responsive to suggestions and feedback, and helpful to his colleagues as a collaborator. He offers any news organization seeking excellent coverage from China the triple qualifications of being a native English writer with excellent Mandarin skills and a good understanding of key technology topics.”\nAbout\nActivity\n-\n🎉 Today I’m not only celebrating my 1-𝐲𝐞𝐚𝐫 𝐎𝐝𝐨𝐨𝐯𝐞𝐫𝐬𝐚𝐫𝐲 — I’m also thrilled to announce that I’ve been 𝐩𝐫𝐨𝐦𝐨𝐭𝐞𝐝 𝐭𝐨…\n🎉 Today I’m not only celebrating my 1-𝐲𝐞𝐚𝐫 𝐎𝐝𝐨𝐨𝐯𝐞𝐫𝐬𝐚𝐫𝐲 — I’m also thrilled to announce that I’ve been 𝐩𝐫𝐨𝐦𝐨𝐭𝐞𝐝 𝐭𝐨…\nLiked by Michael Kan\n-\nThis week I reached my 10-year anniversary with ICR and to mark the occasion, I've updated my professional headshots for my work-related social media…\nThis week I reached my 10-year anniversary with ICR and to mark the occasion, I've updated my professional headshots for my work-related social media…\nLiked by Michael Kan\n-\nI can't believe VIDEO GAME OF THE YEAR has been out for two whole years. Writing this book and seeing the reception to it changed my life. It let me…\nI can't believe VIDEO GAME OF THE YEAR has been out for two whole years. Writing this book and seeing the reception to it changed my life. It let me…\nLiked by Michael Kan\nExperience & Education\nRecommendations received\n1 person has recommended Michael\nJoin now to viewMore activity by Michael\n-\nPersonal news! I’m happy to announce that I’m starting a new job as Lead Industry Analyst at Ookla. I’ll be working with smart people like Kerry…\nPersonal news! I’m happy to announce that I’m starting a new job as Lead Industry Analyst at Ookla. I’ll be working with smart people like Kerry…\nLiked by Michael Kan\n-\n💥 𝗛𝗮𝗿𝗱 𝘄𝗼𝗿𝗸 𝗽𝗮𝘆𝘀 𝗼𝗳𝗳 𝘄𝗵𝗲𝗻 𝘆𝗼𝘂 𝗴𝗶𝘃𝗲 𝗶𝘁 𝘆𝗼𝘂𝗿 𝗮𝗹𝗹. I’m incredibly proud to share that I’ve been recognized with the…\n💥 𝗛𝗮𝗿𝗱 𝘄𝗼𝗿𝗸 𝗽𝗮𝘆𝘀 𝗼𝗳𝗳 𝘄𝗵𝗲𝗻 𝘆𝗼𝘂 𝗴𝗶𝘃𝗲 𝗶𝘁 𝘆𝗼𝘂𝗿 𝗮𝗹𝗹. I’m incredibly proud to share that I’ve been recognized with the…\nLiked by Michael Kan\n-\nI was honored to receive the Media Excellence prize at the Black in Gaming Awards earlier this year, and the trophy just arrived. Loving this tribute…\nI was honored to receive the Media Excellence prize at the Black in Gaming Awards earlier this year, and the trophy just arrived. Loving this tribute…\nLiked by Michael Kan\n-\nI get to work with some of the best f💣ing people. Three months ago I took what felt like one of the wildest phone calls. Would the City of Belton…\nI get to work with some of the best f💣ing people. Three months ago I took what felt like one of the wildest phone calls. Would the City of Belton…\nLiked by Michael Kan\n-\nJust back from the Micro Center grand opening in Santa Clara, and sharing some of the media coverage from last week, like this great article from…\nJust back from the Micro Center grand opening in Santa Clara, and sharing some of the media coverage from last week, like this great article from…\nLiked by Michael Kan\n-\n🧑💼: “The Chair recognizes the orange cat from the Belton Educational Foundation.” 😺: “Meow.” Me: “I second” 🧑💼: “It has been moved and…\n🧑💼: “The Chair recognizes the orange cat from the Belton Educational Foundation.” 😺: “Meow.” Me: “I second” 🧑💼: “It has been moved and…\nLiked by Michael Kan\n-\n✨ Feeling grateful and proud to be part of Odoo! This month, I received the April Acknowledgment for my work on forecast planning, partner…\n✨ Feeling grateful and proud to be part of Odoo! This month, I received the April Acknowledgment for my work on forecast planning, partner…\nLiked by Michael Kan\n-\n#LocalGov Action Figures are cool and all, but do you have your own GovLife LEGO set? #ChatGPT\n#LocalGov Action Figures are cool and all, but do you have your own GovLife LEGO set? #ChatGPT\nLiked by Michael Kan\n-\nHi, all. I am looking for a full-time, preferably remote writing or editing position. For the past 14 years, I was Senior Features Writer at PCMag…\nHi, all. I am looking for a full-time, preferably remote writing or editing position. For the past 14 years, I was Senior Features Writer at PCMag…\nLiked by Michael Kan\nOther similar profiles\nExplore top content on LinkedIn\nFind curated posts and insights for relevant topics all in one place.\nView top contentOthers named Michael Kan in United States\n-\nMichael Kan\nSenior Executive | Vice President of Global Sales and Marketing | Driving extraordinary business growth for Fortune 500s and privately held companies.\n-\nMichael Kan\nAI Systems & GPU Architecture Leader | From Embedded Graphics to Scalable Deep Learning\n-\nMichael Kan\n-\nMichael Kan\nInspector | Compliance & Regulatory Affairs | Ops & Program Management | Continuous Improvement | Quality Management | Health Physicist | Chicago Booth MBA Candidate | Veteran\n-\nMichael Kan\nDesign Intern, Founder of Paper with Pen\n36 others named Michael Kan in United States are on LinkedIn\nSee others named Michael Kan"
    },
    {
      "url": "https://www.bleepingcomputer.com/news/security/winrar-zero-day-flaw-exploited-by-romcom-hackers-in-phishing-attacks/",
      "text": "A recently fixed WinRAR vulnerability tracked as CVE-2025-8088 was exploited as a zero-day in phishing attacks to install the RomCom malware.\nThe flaw is a directory traversal vulnerability that was fixed in WinRAR 7.13, which allows specially crafted archives to extract files into a file path selected by the attacker.\n\"When extracting a file, previous versions of WinRAR, Windows versions of RAR, UnRAR, portable UnRAR source code and UnRAR.dll can be tricked into using a path, defined in a specially crafted archive, instead of user specified path,\" reads the WinRAR 7.13 changelog.\n\"Unix versions of RAR, UnRAR, portable UnRAR source code and UnRAR library, also as RAR for Android, are not affected.\"\nUsing this vulnerability, attackers can create archives that extract executables into autorun paths, such as the Windows Startup folder located at:\n%APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup (Local to user)\n%ProgramData%\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp (Machine-wide)\nThe next time a user logs in, the executable will automatically run, allowing the attacker to achieve remote code execution.\nAs WinRAR does not include an auto-update feature, it is strongly advised that all users manually download and install the latest version from win-rar.com so they are protected from this vulnerability.\nExploited as a zero-day in attacks\nThe flaw was discovered by Anton Cherepanov, Peter Košinár, and Peter Strýček from ESET, with Strýček telling BleepingComputer that it was actively exploited in phishing attacks to install malware.\n\"ESET has observed spearphishing emails with attachments containing RAR files,\" Strýček told BleepingComputer.\nThese archives exploited the CVE-2025-8088 to deliver RomCom backdoors. RomCom is a Russia-aligned group.\"\nRomCom (also tracked as Storm-0978, Tropical Scorpius, or UNC2596) is a Russian hacking group linked to ransomware and data-theft extortion attacks, along with campaigns focused on stealing credentials.\nThe group is known for its use of zero-day vulnerabilities in attacks and the use of custom malware for use in data-theft attacks, persistence, and to act as backdoors.\nRomCom has previously been linked to numerous ransomware operations, including Cuba and Industrial Spy.\nESET is working on a report regarding the exploitation, which will be published at a later date.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nPost a Comment Community Rules\nYou need to login in order to post a comment\nNot a member yet? Register Now"
    },
    {
      "url": "https://nvd.nist.gov/vuln/detail/CVE-2025-8088",
      "text": "CVE-2025-8088 Detail\nAwaiting Analysis\nThis CVE record has been marked for NVD enrichment efforts. DescriptionA path traversal vulnerability affecting the Windows version of WinRAR allows the attackers to execute arbitrary code by crafting malicious archive files. This vulnerability was exploited in the wild and was discovered by Anton Cherepanov, Peter Košinár, and Peter Strýček from ESET. Metrics\nNVD enrichment efforts reference publicly available information to associate\nvector strings. CVSS information contributed by other sources is also\ndisplayed.\nReferences to Advisories, Solutions, and ToolsBy selecting these links, you will be leaving NIST webspace. We have provided these links to other web sites because they may have information that would be of interest to you. No inferences should be drawn on account of other sites being referenced, or not, from this page. There may be other web sites that are more appropriate for your purpose. NIST does not necessarily endorse the views expressed, or concur with the facts presented on these sites. Further, NIST does not endorse any commercial products that may be mentioned on these sites. Please address comments about this page to [email protected].\nWeakness Enumeration\nQuick InfoCVE Dictionary Entry:CVE-2025-8088 NVD Published Date: 08/08/2025 NVD Last Modified: 08/08/2025 Source: ESET |"
    }
  ],
  "argos_summary": "A newly discovered vulnerability in WinRAR, tracked as CVE-2025-8088, has been exploited in phishing attacks to deliver the RomCom malware. This flaw allows attackers to craft malicious archive files that can extract data to a path of their choosing, enabling remote code execution on affected systems. WinRAR has released a patch in version 7.13, but users must manually update their software to mitigate the risk, as the tool lacks an auto-update feature.",
  "argos_id": "YDL96MCOR"
}