{
  "url": "https://www.businessinsider.com/sweetgreen-bigger-portions-change-taste-cheaper-dishes-earnings-2025-8",
  "authorsByline": "Shubhangi Goel",
  "articleId": "7494907d31444121b9b36fc1b75ccd51",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/6895a835f748d8c055f72197?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T09:03:53+00:00",
  "addDate": "2025-08-08T09:11:51.598793+00:00",
  "refreshDate": "2025-08-08T09:11:51.598794+00:00",
  "score": 1.0,
  "title": "Sweetgreen is betting on bigger portions and better taste to get customers back in the door",
  "description": "\"It's pretty obvious that the consumer is not in a great place overall,\" said CEO Jonathan Neman on Thursday's call.",
  "content": "Sweetgreen is having a tougher time selling $15 salads.On Thursday, the Los Angeles-based salad chain cut sales guidance after reporting disappointing earnings for the second straight quarter. Its turnaround plans include 25% bigger portions of chicken and tofu, recipe upgrades for chicken and salmon, and $13 salads for members.\"It's pretty obvious that the consumer is not in a great place overall,\" said CEO Jonathan Neman on Thursday's call. He said consumers started to be more cautious in April and that several large urban markets have been \"subdued.\" But he said the changes have already helped in the third quarter.Neman also said Sweetgreen would discontinue its ripple fries — think healthier french fries made in an air fryer — after five months because they were too complex for the restaurants to make.He added that the company will keep working on new products, including homemade drinks that are in test markets.\"Sweetgreen's second quarter results reflected a convergence of several headwinds, including macroeconomic pressures, a challenging comparison to last year's strong Q2, and the transition of our loyalty program,\" Neman said in the earnings release. \"While we're not satisfied with today's results, we're confident in our ability to improve in the back half of 2025.\"Sweetgreen's stock fell 23% after hours following the earnings report. The stock is down over 60% this year.The company reported a net loss of $23.3 million in the second quarter, compared to a loss of $14.5 million last year. Same-store sales dropped 7.6% year-over-year.Sweetgreen's competitors including Chipotle have also cited economic uncertainty for weak results. Other chains, from Starbucks to McDonald's, have launched value meals to bring back price-sensitive customers.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "second quarter",
      "weight": 0.08278061
    },
    {
      "name": "last year",
      "weight": 0.077530324
    },
    {
      "name": "several large urban markets",
      "weight": 0.075947106
    },
    {
      "name": "bigger portions",
      "weight": 0.074561834
    },
    {
      "name": "CEO Jonathan Neman",
      "weight": 0.07306128
    },
    {
      "name": "weak results",
      "weight": 0.06906425
    },
    {
      "name": "disappointing earnings",
      "weight": 0.06894475
    },
    {
      "name": "Jonathan Neman",
      "weight": 0.06875728
    },
    {
      "name": "several headwinds",
      "weight": 0.06673116
    },
    {
      "name": "healthier french fries",
      "weight": 0.06651891
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9248046875
    },
    {
      "name": "/Food & Drink/Restaurants/Other",
      "score": 0.515625
    }
  ],
  "sentiment": {
    "positive": 0.019256592,
    "negative": 0.9135742,
    "neutral": 0.06732178
  },
  "summary": "Los Angeles-based salad chain, Sweetgreen, is struggling to sell $15 salads and has cut sales guidance after disappointing earnings for the second consecutive quarter. The company's CEO, Jonathan Neman, announced plans to offer 25% larger portions of chicken and tofu, recipe upgrades for chicken and salmon, and $13 salads for members. He also announced that the company will discontinue its ripple fries after five months due to their complexity. Despite these changes, Neman noted that the changes have already helped in Q3. Sweetgreen reported a net loss of $23.3 million in Q2, compared to a loss of €14.5 million the previous year, and same-store sales dropped 7.6% year-over-year. The chain's stock fell 23% after hours following the earnings report, and its shares have fallen over 60% this year.",
  "shortSummary": "Sweetgreen is focusing on bigger portions and better taste with improved execution strategies to attract customers, despite reporting disappointing earnings and economic challenges, prompting a sales drop.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ce7ea74269024cc2a178c3937dc4fa6f",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Sweetgreen has lowered its sales guidance after reporting disappointing earnings for the second consecutive quarter, with a net loss of $23.3 million and a 7.6% drop in same-store sales. CEO Jonathan Neman noted that consumer caution has increased, particularly in urban markets, prompting the company to implement changes such as larger portion sizes and lower-priced salads for members. Despite these challenges, Neman expressed confidence in improving results in the latter half of 2025, although Sweetgreen's stock has fallen significantly this year.",
  "argos_id": "YLHDBGR1L"
}