{
  "url": "https://seekingalpha.com/article/4811578-fiera-capital-corporation-frrpf-q2-2025-earnings-call-transcript",
  "authorsByline": "SA Transcripts",
  "articleId": "1ad933fefab44acc89119f46e5a51ee0",
  "source": {
    "domain": "seekingalpha.com",
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-09T00:43:47+00:00",
  "addDate": "2025-08-09T00:45:49.748102+00:00",
  "refreshDate": "2025-08-09T00:45:49.748104+00:00",
  "score": 1.0,
  "title": "Fiera Capital Corporation (FRRPF) Q2 2025 Earnings Call Transcript",
  "description": "Fiera Capital Corporation (OTCPK:FRRPF) Q2 2025 Earnings Conference Call August 8, 2025 10:00 AM ETCompany ParticipantsLucas Emilio Pontillo - Head of...",
  "content": "Etienne Ricard - BMO Capital Markets Equity Research\n\n Gary Ho - Desjardins Securities Inc., Research Division\n\n Graham Ryding - Unidentified Company\n\n Jaeme Gloyn - National Bank Financial, Inc., Research Division\n\nGood morning, and welcome to Fiera Capital's earnings call to discuss financial results for the second quarter of 2025. I will now turn the conference over to Natalie Medac, Director, Investor Relations. You may begin your conference.\n\nThank you, and good morning, everyone. Welcome to the Fiera Capital conference call to discuss our financial results for the second quarter of 2025.\n\nA copy of today's presentation can be found in the Investor Relations section of our website. Comments made on today's call, including replies to certain questions, may deal with forward-looking statements, which are subject to risks and uncertainties that may cause actual results to differ from expectations.\n\nPlease refer to the forward-looking statements on Page 2 of the presentation. Our speakers today are Maxime Menard, Global President and CEO, and Lucas Pontillo, Executive Director, Global CFO and Head of Corporate Strategy.\n\nAlso available to answer questions will be John Valentini, President and CEO, Private Markets. With that, I will now turn the call over to Maxime.\n\nGood morning, everyone. Thank you for joining us today as we report our results for the second quarter of 2025.\n\nThe second quarter began with a challenging macro environment and a sharp decline in global equity markets. While markets quickly rebounded, ending the quarter higher, a weaker U.S. dollar tempered returns for non-U.S. investors.",
  "medium": "Article",
  "links": [
    "https://seekingalpha.com/symbol/FRRPF"
  ],
  "labels": [
    {
      "name": "Roundup"
    },
    {
      "name": "Opinion"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "BMO Capital Markets Equity Research",
      "weight": 0.09609289
    },
    {
      "name": "Fiera Capital",
      "weight": 0.08862364
    },
    {
      "name": "Fiera Capital Corporation",
      "weight": 0.088125505
    },
    {
      "name": "financial results",
      "weight": 0.08658945
    },
    {
      "name": "Research Division",
      "weight": 0.084685996
    },
    {
      "name": "actual results",
      "weight": 0.08151159
    },
    {
      "name": "Global President",
      "weight": 0.08144168
    },
    {
      "name": "today",
      "weight": 0.073188
    },
    {
      "name": "Investor Relations",
      "weight": 0.07304813
    },
    {
      "name": "Global CFO",
      "weight": 0.07293211
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Earnings Calls"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9931640625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9921875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.97509765625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.939453125
    }
  ],
  "sentiment": {
    "positive": 0.43310547,
    "negative": 0.088012695,
    "neutral": 0.4790039
  },
  "summary": "Fiera Capital Corporation (FRRPF) is holding a conference call to discuss its financial results for the second quarter of 2025. The company's speakers include Maxime Menard, Global President and CEO, Lucas Pontillo, Executive Director, Global CFO and Head of Corporate Strategy. The second quarter was marked by a challenging macro environment and a decline in global equity markets, but ended the quarter higher due to a weaker U.S. dollar. Additionally, comments regarding forward-looking statements may be subject to risks and uncertainties that could cause actual results to differ from expectations.",
  "shortSummary": "Fiera Capital's Q2 earnings call, featuring CEO Maxime Menard and CFO Lucas Pontillo, contains forward-looking statements about financial performance and market conditions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "9df49abe6a4e4549aea8f3b8c5dda27c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Fiera Capital held its earnings call to discuss financial results for the second quarter of 2025, led by CEO Maxime Menard and CFO Lucas Pontillo. The quarter faced a challenging macro environment with a significant decline in global equity markets, although a rebound occurred towards the end of the quarter. The weaker U.S. dollar impacted returns for non-U.S. investors.",
  "argos_id": "YQY8YHZ4H"
}