{
  "url": "https://www.pymnts.com/travel-payments/2025/booking-ceo-glenn-fogel-says-airport-infrastructure-can-reverse-tourism-decline/",
  "authorsByline": "PYMNTS",
  "articleId": "9b3a4311bc1d42e2ac55cd8a560dd6e0",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2025/08/US-tourism-airport-infrastructure.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T23:19:03+00:00",
  "addDate": "2025-08-08T23:21:04.839501+00:00",
  "refreshDate": "2025-08-08T23:21:04.839503+00:00",
  "score": 1.0,
  "title": "Booking CEO Glenn Fogel Says Airport Infrastructure Can Reverse Tourism Decline",
  "description": "Booking Holdings CEO Glenn Fogel reportedly said that the United States needs to invest in passport and immigration booths at airports to help reverse a",
  "content": "Booking Holdings CEO Glenn Fogel reportedly said that the United States needs to invest in passport and immigration booths at airports to help reverse a decline in foreign tourists.\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\n“It can be very aggravating to come to the U.S. because the first thing you see is a long queue,” Fogel told the Financial Times (FT) in a report published Friday (Aug. 8).\n\nFogel added that the country’s airports “need to be in shape” before the upcoming 2026 Fifa World Cup and 2028 Summer Olympics events that are to be held in the U.S., according to the report.\n\nThe number of foreign travelers arriving in U.S. airports was 3.8% lower in the first seven months of the year, compared to the same period in 2024, the report said, citing figures from the National Travel and Tourism Office.\n\nThe decline seen in the first six months of the year was the first since the pandemic, per the report.\n\nIt was reported in June that a decline in overseas tourists visiting the U.S. was driven in part by some of these travelers canceling trips to the U.S. in favor of visits to Europe or vacations closer to home.\n\nSome said this was because of the White House’s immigration crackdown and reports of foreign visitors to the U.S. being detained or deported, while others said they wanted to show their frustration with the administration’s policies.\n\nIt was reported in April that the number of travelers from western Europe who spent at least one night in the U.S. dropped by 17% year over year in March, while the total number of overseas visitors to the country fell by 12%. The decline in overseas visitors was the greatest seen since March 2021.\n\nThat report said some of the reluctance was being fueled by U.S. immigration policy amid a rash of incidents in which overseas travelers were detained at the border.\n\nThe PYMNTS Intelligence and The Clearing House collaboration “Check-In Time: Hospitality Welcomes Real-Time Payments” found that travelers are willing to invest more in the quality of their experiences rather than the price.\n\nSeventy-seven percent of travelers prioritize experience over cost, according to the report.",
  "medium": "Article",
  "links": [
    "https://www.ft.com/content/91d355c9-2ab4-43bf-bc11-cf49f0de4c88",
    "https://www.pymnts.com/tracker_posts/check-in-time-hospitality-welcomes-real-time-payments/",
    "https://www.theclearinghouse.org/",
    "https://www.pymnts.com/economy/2025/report-trump-policies-hurting-tourism-as-europeans-stay-home/",
    "https://www.pymnts.com/economy/2025/overseas-visitors-avoid-us-to-protest-white-house-policies/",
    "https://www.pymnts.com/travel-payments/2025/77percent-travelers-prioritize-experience-over-cost/",
    "https://www.trade.gov/national-travel-and-tourism-office"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. airports",
      "weight": 0.10229274
    },
    {
      "name": "U.S. immigration policy",
      "weight": 0.09760657
    },
    {
      "name": "overseas travelers",
      "weight": 0.09270821
    },
    {
      "name": "foreign travelers",
      "weight": 0.08735508
    },
    {
      "name": "U.S.",
      "weight": 0.087057896
    },
    {
      "name": "overseas visitors",
      "weight": 0.07775281
    },
    {
      "name": "reports",
      "weight": 0.07691487
    },
    {
      "name": "travelers",
      "weight": 0.07622375
    },
    {
      "name": "Booking CEO Glenn Fogel",
      "weight": 0.07543817
    },
    {
      "name": "Booking Holdings CEO Glenn Fogel",
      "weight": 0.07378598
    }
  ],
  "topics": [
    {
      "name": "Business Leaders"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/Travel & Transportation/Transportation/Air Travel",
      "score": 0.91357421875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.84619140625
    },
    {
      "name": "/News/Other",
      "score": 0.5654296875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.56494140625
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Aviation Industry",
      "score": 0.481201171875
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.4482421875
    },
    {
      "name": "/Travel & Transportation/Other",
      "score": 0.39990234375
    },
    {
      "name": "/Travel & Transportation/Travel Agencies & Services/Other",
      "score": 0.3291015625
    }
  ],
  "sentiment": {
    "positive": 0.0206604,
    "negative": 0.91015625,
    "neutral": 0.068725586
  },
  "summary": "Booking Holdings CEO, Glenn Fogel, has stated that the United States needs to invest in passport and immigration booths at airports to reverse a decline in foreign tourists. This comes as the number of foreign travelers arriving in U.S. airports was 3.8% lower in the first seven months of the year compared to the same period in 2024, according to the National Travel and Tourism Office. Fogel also emphasized the need for airports to be in shape before the upcoming 2026 Fifa World Cup and 2028 Summer Olympics events. The decline in overseas tourists visiting the U., attributed to some of these travelers canceling trips to the U.C. in favor of visits to Europe or vacations closer to home.",
  "shortSummary": "Booking Holdings CEO Glenn Fogel suggests investing in airport infrastructure to reverse a decline in foreign tourists, citing high queueing and economic challenges.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3a2057c09c3b49419d1269ceb3e0f783",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.pymnts.com/economy/2025/report-trump-policies-hurting-tourism-as-europeans-stay-home/",
      "text": "The number of travelers from western Europe who spent at least one night in the U.S. dropped by 17% year over year in March, the Financial Times (FT) reported Friday (April 11), citing data from the International Trade Administration (ITA).\nFrom some countries — Ireland, Germany and Norway among them — travel declined by more than 20%, the ITA data showed.\nThis trend, the FT noted, threatens America’s tourism industry, which makes up 2.5% of the country’s gross domestic product. Some airline and hotel companies have warned of cooling demand for transatlantic travel and a “bad buzz” about visiting the U.S.\nThe number of overseas visitors to the U.S. fell by 12% year over year in March, the sharpest decline since March 2021, the middle of the COVID pandemic.\n“In just two months [Trump] has destroyed the reputation of the U.S., shown one way by diminished travel from the EU to the U.S.,” said Paul English, co-founder of travel website Kayak. “This is not only one more terrible blow to the U.S. economy, it also represents reputation damage that could take generations to repair.”\nThe report said some of the reluctance is being fueled by U.S. immigration policy amid a rash of incidents in which overseas travelers were detained at the border.\nReports of those incidents led Gloria Sync, an artist and author in Nottingham, England, to call off a visit to San Francisco planned for next month.\n“The borders seem unsafe,” Sync, who is transgender and said she was concerned about the “unwanted attention” her identity could bring at the border, told the FT. “I don’t know if I’ll ever go back, to be honest.”\nThe decline in EU to U.S. tourism comes as Americans are spending less on travel, with airline fares down 5.3% according to the latest Consumer Price Index figures.\nMeanwhile, Delta Airlines warned last week of widespread uncertainty as it released its quarterly earnings.\n“Consistent with our update last month, February and March reflected a much more challenging macro environment than anyone initially planned for,” Delta CEO Ed Bastian said during an earnings call. “Coming into 2025, we were positioned for another year of strong growth. However, given broad economic uncertainty around global trade, growth has largely stalled.”"
    },
    {
      "url": "https://www.pymnts.com/economy/2025/overseas-visitors-avoid-us-to-protest-white-house-policies/",
      "text": "“There used to be thousands of people from Canada. They would give me Canadian dollars and I would change it at the bank,” Omar Tallat, 35, who runs a corn dog stand near Times Square, told The Wall Street Journal in a report Sunday (June 1).\n“This year,” Tallat added, “business is very bad.”\nThe report, citing U.S. Customs and Border Protection data, said that a little under 2 million foreigners arrived at the U.S.’s main airports in the last four weeks, down 6% from the same period in 2024.\nMeanwhile, flight bookings to the U.S. from Europe have declined about 12% through August, WSJ said, citing an analysis of online travel-agency booking data from Cirium.\nAccording to the report, travelers from overseas say they are canceling trips to the U.S. in favor of visits to Europe or vacations closer to home. Some say this is because of the White House’s immigration crackdown and reports of foreign visitors to the U.S. being detained or deported.\nOthers want to show their frustration with the administration’s policies, similar to the consumers in Canada who have shunned American-made products, or the Europeans who have boycotted Teslas due to the company’s CEO, Trump-aligned Elon Musk.\n“There’s not a lot politically I can do, but what I can do is not spend my money in the U.S.,” said Marc Toews, a Canadian long-haul truck driver who has canceled a road trip to places like Chicago and New York City.\nThe report noted that travel and tourism account for roughly 3% of American gross domestic product, and overseas visitors only contribute a tiny portion of that, meaning that a pullback would have just a slight impact on broader economic activity.\nHowever, some areas could be hit hard, like towns along the Canadian border or in Maine, as well as the beach towns of the Jersey Shore and other Atlantic coast areas.\nAnd the tourism sector is dominated by smaller businesses, which have a tougher time weathering swings in demand, said Aran Ryan, director of industry studies at Tourism Economics.\nThis is at a time when 20% of small to medium-sized businesses (SMBs) worry they will not survive the next five years because of U.S. tariffs, according to PYMNTS Intelligence research.\n“For SMBs, tariffs aren’t just a line item; they’re an existential threat,” PYMNTS wrote in April. “Prices for goods and services climbed to their steepest rate in over a year this month, with tariffs fueling an especially sharp increase in prices of manufactured goods. SMBs account for around one-third of total imports to the United States.”"
    },
    {
      "url": "https://www.pymnts.com/travel-payments/2025/77percent-travelers-prioritize-experience-over-cost/",
      "text": "To capitalize on the growth, hospitality businesses must adapt to the expectations of tech-savvy travelers.\nAccording to the PYMNTS Intelligence report “Check-In Time: Hospitality Welcomes Real-Time Payments,” a key strategy is the adoption of real-time payments, which can streamline operations, improve customer satisfaction and increase profitability.\nTravelers’ Expectations for Seamless Payments\nTravelers expect the same seamless payment experiences they enjoy in their daily lives. As a result, real-time payments have come to the fore. Travelers are prioritizing ease of use and security when making payments, with 73% reporting instances of payment declines or issues, per the report. Real-time payment systems, such as digital wallets, address these concerns by providing secure, instant transactions, reducing fraud risks, and ensuring smoother experiences.\nAdditionally, most travelers are willing to invest more in the quality of their experiences rather than price. According to the report, 77% of travelers prioritize experience over cost. This presents an opportunity for hospitality businesses to invest in real-time payments, which elevate service quality and customer loyalty, leading to potential financial returns.\nThe Need to Upgrade Hospitality Payment Systems\nDespite the increasing demand for advanced payment methods, the hospitality sector continues to rely on outdated, complex payment systems. These systems, designed to oversee international transactions, can hinder efficiency and profitability. According to the report, 66% of travel finance executives said their existing payment infrastructure limits their growth. To keep pace with customer expectations and streamline operations, upgrading these payment systems has become a priority.\nReal-time payment systems are becoming more popular, with 47% of hospitality firms with revenues exceeding $1 million annually adopting instant payment solutions. Moreover, 79% of firms that have sent real-time payments and 81% of those that have received them plan to increase their usage. An example is the introduction of the Elavon Cloud Payments Interface, which allows for seamless integration of payment capabilities throughout the customer journey. By simplifying payment processes, this system enables hospitality businesses to meet customer demands while enhancing operational efficiency.\nReal-Time Payments Strengthen Hospitality Profitability\nBeyond benefiting travelers, real-time payments impact the financial health of hospitality businesses. According to the report, 82% of small- to medium-sized businesses (SMBs) in the hospitality sector that primarily use real-time payments reported healthy balance sheets, compared to 66% of those relying on non-instant payment methods.\nThe benefits of real-time payments extend to improved cash flow management, reduced risk and enhanced convenience. These systems ensure that money is immediately available, decreasing the time between providing services and receiving payments. As a result, hospitality businesses can monitor operating expenses more effectively, invest in growth and manage unexpected costs.\nReal-time payment solutions provide a dual benefit for the hospitality industry by addressing customer demands and enhancing financial efficiency. As travelers and businesses gain from these systems, adopting real-time payment infrastructure is becoming crucial for hospitality firms seeking long-term success."
    },
    {
      "url": "https://www.pymnts.com/tracker_posts/check-in-time-hospitality-welcomes-real-time-payments/",
      "text": "After the devastating downturn brought on by the pandemic, the global travel, tourism and hospitality industries are poised for remarkable growth this year. In fact, international arrivals are projected to surge by more than 15% in 2024 from 2023, finally surpassing pre-pandemic levels. By 2028, travelers are expected to embark on 1.4 billion cross-border trips, marking a 17% increase from the record highs of 2019. This expansion opens a world of opportunities for travel and hospitality businesses eager to capture a larger share of the bustling market of tech-savvy customers demanding seamless and efficient digital services everywhere they go.\nPromising as these developments are, the travel and hospitality sectors are not without their challenges. Many firms continue to struggle with outdated and complex payment systems that hinder efficiency and profitability. A recent survey revealed that a significant number of travel finance executives (66%) believe their payment processes are holding them back. To thrive in this rapidly evolving environment, travel firms must modernize their payment systems. By adopting innovations like real-time payment solutions, they can enhance cash flow, streamline operations and meet the high expectations of today’s travelers, positioning themselves for success in the booming market.\nTravelers’ Growing Demands for Real-Time Payments\nTravelers expect the same seamless payment experience while traveling that they enjoy in other aspects of their daily lives. With so many payment options available, these consumers are increasingly gravitating toward the easiest and fastest method: real-time payments.\nTravelers’ top payments priorities include ease of use and security.\nAccording to a recent survey, travelers prioritize ease of use and security when it comes to payments. They also tend to avoid relying on credit or financing options like buy now, pay later (BNPL), largely due to concerns about payment reliability. In fact, 73% of travelers report having experienced payment acceptance issues or declines at some point. These preferences underscore the need for more dependable payment solutions, which is why digital wallets leveraging real-time payment rails are gaining traction. By employing advanced technologies such as card tokenization and enhanced customer authentication protocols, these wallets offer security features that enable banks and card issuers to verify user identities with greater confidence, significantly reducing the risk of fraudulent transactions and, consequently, the likelihood of payment declines.\nTravelers care more about the experience than the cost.\nA recent study revealed that 77% of travelers value having the right travel experience over the cost of their trip. This insight presents a compelling opportunity for hospitality firms considering the adoption of real-time payment systems. While implementing these new systems may involve initial costs, the data suggests that consumers are willing to pay extra for the experiences they truly want. This should reassure hospitality businesses that investing in advanced payment technology could yield positive returns through increased customer satisfaction and loyalty.\nUpgrading Hospitality Payments Systems\nThe hospitality sector’s existing payments stack is highly complex, designed to handle payments from across the globe. Upgrading these systems to improve efficiency is crucial, particularly for businesses striving to meet evolving customer payment expectations.\nUpgrading payment systems is an imperative for travel companies.\n47%\nof hospitality firms earning more than $1 million annually utilize instant payments.\nIn a 2024 study of payment trends in travel, 90% of global travel firm executives surveyed said upgrading their payment systems and financial operations technology will be a top priority this year. To this end, roughly 5 in 6 of these executives reported increasing their investments in payment technology upgrades.\nReal-time payments could play a key role in these renovations. Currently, just 47% of hospitality firms earning more than $1 million annually leverage instant payments, along with 38% of firms in the $250,000 to $1 million revenue range and 37% of those earning less than $250,000. Among the firms that used real-time payments in the last year, 79% of those that sent them and 81% of those that received them indicated they plan to increase their usage in the next year.\nElavon introduces a hospitality payments solution designed for easy integration.\nThe Elavon Cloud Payments Interface provides an embedded solution for hotels and hospitality businesses and their guests via an application programming interface (API). According to a press release, the new offering enhances guest experiences by integrating payment capabilities seamlessly throughout the entire journey, from booking to checkout, with real-time data synchronization across systems. The solution’s API streamlines the development of cloud-based payment tools. This enables easy integration with third-party payment providers, scalable device management and robust fraud protection, while ensuring compliance through automatic software updates. For hospitality firms hesitant to update their payment systems, the Cloud Payment Offering eliminates the need for major technology overhauls, simplifying the integration process into existing technology stacks.\nHow Real-Time Payments Help Hospitality Balance Sheets\nInstant payments benefit not only travelers but also the hospitality firms adopting them. For these businesses, real-time payment systems improve back-end efficiencies and cash flow management, leading to healthier balance sheets and potentially higher profit margins.\nHospitality firms utilizing instant payments report improved financial health.\nAccording to a recent PYMNTS Intelligence study, 82% of small to mid-sized businesses (SMBs) in the hospitality sector that utilize real-time payments as their primary method for sending payments report very or extremely healthy balance sheets. In comparison, only 66% of those relying on non-instant methods show similar levels of financial strength. While 71% of SMBs using push-to-debit as their main payment method also report strong balance sheet health, this is still slightly lower than those utilizing real-time payments, with push-to-credit users trailing further at 65%.\n82%\nof hospitality SMBs that primarily use real-time rails to send payments have very or extremely healthy balance sheets.\nExploring the data reveals other key benefits for hospitality SMBs utilizing real-time rails. Reduced risk emerged as the primary advantage, cited by 57% of respondents, closely followed by convenience (55%) and speed (52%). In addition, 44% of respondents highlighted better cash flow management as a distinct benefit of instant payments, with 15% ranking it as the most important benefit. Collectively, these factors contribute to significantly improved balance sheet health for travel SMBs.\nDeploying Real-Time Rails to Improve Hospitality Payments\nReal-time payments are revolutionizing the travel and hospitality industries, addressing evolving customer demands while simultaneously bolstering the financial health of businesses. As travelers increasingly expect seamless and instantaneous experiences, the adoption of real-time payment systems has become crucial for hotels, restaurants and other hospitality businesses.\nFrom the customer perspective, real-time payments offer unparalleled convenience and flexibility. Guests can now settle their bills instantly, eliminating the need for lengthy checkout processes or carrying large amounts of cash. This swift transaction capability extends to various services within the hospitality ecosystem, from room service to spa treatments, enhancing the overall guest experience. The ability to process payments immediately also allows for more dynamic pricing strategies, enabling businesses to offer last-minute deals or adjust rates in real time based on demand.\nFor hospitality businesses, the benefits of real-time payments encompass much more than customer satisfaction. These systems significantly improve cash flow management, a critical factor in maintaining healthy balance sheets. With instant payment processing, funds become immediately available. This reduces the lag time between service provision and revenue realization. Consequently, the improved liquidity allows hospitality firms to better manage their operating expenses, invest in improvements and handle unexpected costs more effectively."
    },
    {
      "url": "https://www.trade.gov/national-travel-and-tourism-office",
      "text": "National Travel and Tourism Office\nNational Travel and Tourism Office\nThe National Travel and Tourism Office (NTTO) in ITA’s Industry and Analysis unit works to enhance the international competitiveness of the U.S. travel and tourism industry and increase its exports, thereby creating U.S. employment and economic growth, through:\n- Travel and Tourism Research: The management of the travel and tourism research and statistical program system for assessing the economic contribution of the travel and tourism industry and providing the official source for data on international travel to and from the United States.\n- Travel and Tourism Policy: The development and implementation of travel and tourism policy, strategy, and advocacy initiatives through collaboration with domestic and international public and private sector stakeholders.\n- Travel and Tourism Export Promotion: The organization and administration of travel and tourism export expansion activities.\nFind out who is visiting the United States, what cities they are visiting, and why. Our Country Profile Monitor shows the demographic visitor profiles for more than 70 countries.\nThe United States Travel and Tourism Advisory Board (TTAB) is a federal advisory committee and advises the Secretary of Commerce on government policies and programs that affect the U.S. travel and tourism industry, offers counsel on current and emerging issues, and provides a forum for discussing and proposing solutions to industry-related problem.\nOur Travel and Tourism industry experts are available to assist you with business counseling, market intelligence, and matchmaking services. They focus on and construct programs that enhance the industry’s competitiveness and promote travel exports.\nMeet Our Team\nEach member of the NTTO team brings unique skills and a commitment to excellence. From creative thinkers to strategic planners, we work together to deliver exceptional results. Discover the people behind our success and what makes our team extraordinary!\nWe are aware of an individual fraudulently claiming to represent ITA to solicit personal information. Individuals have reported receiving emails and phone calls “regarding a possible recent scam involving your vacation property.”\nIf you believe that you have been a target of such a scam, please notify the Department of Commerce, Office of Inspector General, immediately and file a report.\nDo you have a question or need assistance?\nUse the contact form to connect with our team for prompt assistance. Whether you have inquiries, suggestions, or require assistance, our amazing team is here to address your needs."
    }
  ],
  "argos_summary": "Booking Holdings CEO Glenn Fogel emphasized the need for the U.S. to improve airport passport and immigration processes to attract foreign tourists, as arrivals have declined by 3.8% in the first seven months of the year compared to 2024. This drop is attributed to factors such as U.S. immigration policies and travelers opting for destinations in Europe instead. The tourism sector, which contributes significantly to the U.S. economy, is facing challenges, with reports indicating a 12% decrease in overseas visitors, the largest decline since the pandemic.",
  "argos_id": "YVEXQ4FAD"
}