{
  "url": "https://www.washingtontimes.com/news/2025/aug/8/donald-trump-host-armenia-azerbaijan-white-house-peace-summit/",
  "authorsByline": "Seung Min Kim, The Washington Times https://www.washingtontimes.com",
  "articleId": "5b62cd52333b44ddbeb70a425da94513",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2025/08/08/Trump_82754_c0-222-5327-3329_s1200x700.jpg?083b13ca186c4bb870ee1ec7623d558014dd3ffb",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-08T18:33:47+00:00",
  "addDate": "2025-08-08T18:39:42.525462+00:00",
  "refreshDate": "2025-08-08T18:39:42.525464+00:00",
  "score": 1.0,
  "title": "Trump will host Armenia and Azerbaijan for a White House peace summit",
  "description": "President Donald Trump will convene a peace summit at the White House on Friday with the leaders of Armenia and Azerbaijan that is meant to help end decades of conflict and reopen key transportation routes while allowing the U.S. to seize on Russia’s declining influence in the region.",
  "content": "WASHINGTON — President Donald Trump will convene a peace summit at the White House on Friday with the leaders of Armenia and Azerbaijan that is meant to help end decades of conflict and reopen key transportation routes while allowing the U.S. to seize on Russia’s declining influence in the region.\n\nThe two countries in the South Caucasus region will sign an agreement that will create a major transit corridor that will be named the Trump Route for International Peace and Prosperity, the White House said. That route will connect Azerbaijan and its autonomous Nakhchivan exclave, which are separated by a 32-kilometer-wide (20-mile-wide) patch of Armenian territory. The demand from Azerbaijan had held up peace talks in the past.\n\n“The roadmap they are agreeing to will build a cooperative future that benefits both countries, their region of the South Caucasus and beyond,” White House spokeswoman Anna Kelly said Friday. She added that the new transit corridor will “allow unimpeded connectivity between the two countries while respecting Armenia’s sovereignty and territorial integrity and its people.”\n\nFriday’s signing adds to the handful of peace and economic agreements brokered this year by the U.S., while Trump has made no secret of his wish to be awarded the Nobel Peace Prize for his role in helping to ease long-running conflicts across the globe. The peace deal between the Democratic Republic of Congo and Rwanda helped end the decadeslong conflict in eastern Congo, and the U.S. mediated a ceasefire between India and Pakistan, while Trump intervened in clashes between Cambodia and Thailand by threatening to withhold trade agreements with both countries if their fighting continued.\n\nYet peace deals in Gaza and Ukraine have been elusive.\n\nThe signing of a deal between Armenia and Azerbaijan, both former Soviet republics, also strikes a geopolitical blow to their former imperial master, Russia. Throughout the nearly four-decade conflict, Moscow played mediator to expand its clout in the strategic South Caucasus region, but its influence waned quickly after it launched the full-scale invasion of Ukraine in February 2022. The Trump-brokered deal would allow the U.S. to deepen its reach in the region as Moscow retreats, senior U.S. administration officials said.\n\nThe Trump administration began engaging with Armenia and Azerbaijan in earnest earlier this year, when Trump’s key diplomatic envoy, Steve Witkoff, met with Azerbaijan’s President Ilham Aliyev and other leaders in Baku and started to discuss what a senior administration official called a “regional reset.”\n\nNegotiations over who will develop the Trump Route - which will eventually include a rail line, oil and gas lines, and fiber optic lines - will likely begin next week, and at least nine developers have expressed interest already, according to the senior administration official, who briefed reporters on condition of anonymity. The Armenians suggested it be named after the U.S. president, the official said.\n\nSeparate from the joint agreement, both Armenia and Azerbaijan will sign deals with the United States meant to bolster cooperation in energy, technology and the economy, the White House said.\n\nTrump previewed much of Friday’s plan in a social media post Thursday evening, saying Aliyev and Armenian Prime Minister Nikol Pashinyan would participate in a peace ceremony and sign economic agreements with the U.S. that would “fully unlock the potential” of the South Caucasus region.\n\n“Many Leaders have tried to end the War, with no success, until now, thanks to ‘TRUMP,’” Trump said on his Truth Social site.\n\nThe Republican president will first meet with Pashinyan and then will host Aliyev. Finally, all three leaders will participate in a joint signing ceremony in the State Dining Room. That peace declaration will be the first signed by both Armenia and Azerbaijan since the end of the Cold War, according to the administration.\n\nThe two nations have been locked in conflict for nearly four decades as they fought for control of the Karabakh region, known internationally as Nagorno-Karabakh.\n\nThe area was largely populated by Armenians during the Soviet era but is located within Azerbaijan. The two nations battled for control of the region through multiple violent clashes that left tens of thousands of people dead over the decades, all while international mediation efforts failed.\n\nMost recently, Azerbaijan reclaimed all of Karabakh in 2023 and had been in talks with Armenia to normalize ties. Azerbaijan’s insistence on a land bridge to Nakhchivan had been a major sticking point, because while Azerbaijan did not trust Armenia to control the so-called Zangezur corridor, Armenia resisted control by a third party because it viewed it as a breach of sovereignty.\n\nBut the prospect of closer ties with the United States, as well as being able to move in and out the landlocked nation more freely without having to access Georgia or Iran, helped entice Armenia on the broader agreement, according to U.S. officials.\n\nMeanwhile, Russia stood back when Azerbaijan reclaimed control of Karabakh in the September 2023 offensive, angering Armenia, which has moved to shed Russian influence and turn westward. Azerbaijan, emboldened by its victory in Karabakh, also has become increasingly defiant in its relations with Moscow.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "senior U.S. administration officials",
      "weight": 0.079196684
    },
    {
      "name": "Azerbaijan",
      "weight": 0.07665699
    },
    {
      "name": "U.S. officials",
      "weight": 0.07317251
    },
    {
      "name": "Armenia",
      "weight": 0.07088443
    },
    {
      "name": "Trump",
      "weight": 0.0676609
    },
    {
      "name": "Donald Trump",
      "weight": 0.066929124
    },
    {
      "name": "President Donald Trump",
      "weight": 0.0668278
    },
    {
      "name": "peace deals",
      "weight": 0.06649852
    },
    {
      "name": "U.S.",
      "weight": 0.0628248
    },
    {
      "name": "White House",
      "weight": 0.060406707
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9873046875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.958984375
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.8984375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.625
    },
    {
      "name": "/News/World News",
      "score": 0.4375
    }
  ],
  "sentiment": {
    "positive": 0.2541504,
    "negative": 0.39379883,
    "neutral": 0.35180664
  },
  "summary": "President Donald Trump will host a peace summit with the leaders of Armenia and Azerbaijan at the White House. The agreement aims to end decades of conflict and reopen key transportation routes, allowing the U.S. to seize on Russia's declining influence in the region. The two countries will sign an agreement creating a major transit corridor named the Trump Route for International Peace and Prosperity. The new transit corridor will connect Azerbaijan and its autonomous Nakhchivan exclave, which have been separated by a 32-kilometer-wide patch of Armenian territory. The signing of the deal also represents a geopolitical blow to Russia. Separate from the agreement, both Armenia, Azerbaijan will sign deals with the United States to bolster cooperation in energy, technology and the economy.",
  "shortSummary": "President Donald Trump will convene a peace summit with Armenia and Azerbaijan, aiming to reopen key transportation routes and leverage Russia's retreat in the South Caucasus.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "a4aa28be87ce42aa9ad28a1aca19ac6b",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "President Donald Trump is hosting a peace summit at the White House with Armenian and Azerbaijani leaders to finalize an agreement aimed at ending decades of conflict and establishing a transit corridor named the Trump Route for International Peace and Prosperity. This corridor will connect Azerbaijan with its Nakhchivan exclave through Armenian territory, addressing a key issue that has stalled previous negotiations. The agreement is seen as a strategic move for the U.S. to increase its influence in the South Caucasus as Russia's role diminishes, following its invasion of Ukraine.",
  "argos_id": "YZSC2EHQT"
}