{
  "url": "https://www.benzinga.com/pressreleases/25/08/n46897617/lavior-appoints-ryan-shilling-as-vice-president-of-sales-u-s-market",
  "authorsByline": "PRNewswire",
  "articleId": "7e31d3c980614f38b3aa607ff2e1de1a",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "http://benzinga.com/next-assets/images/schema-image-default.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-06T08:48:00-04:00",
  "addDate": "2025-08-06T13:05:12.621889+00:00",
  "refreshDate": "2025-08-06T13:05:12.621891+00:00",
  "score": 1.0,
  "title": "Lavior Appoints Ryan Shilling as Vice President of Sales, U.S. Market",
  "description": "Seasoned Healthcare Leader Brings Strategic Vision and Deep Market Expertise to Accelerate Growth and Drive Patient-Centered Innovation MIAMI, Aug. 6, 2025 /PRNewswire/ -- Lavior, a leader in advanced healing solutions,",
  "content": "Seasoned Healthcare Leader Brings Strategic Vision and Deep Market Expertise to Accelerate Growth and Drive Patient-Centered Innovation\n\nMIAMI, Aug. 6, 2025 /PRNewswire/ -- Lavior, a leader in advanced healing solutions, proudly announces the appointment of Ryan Shilling as Vice President of Sales, U.S. Market. With more than 15 years of leadership experience across healthcare sectors, Shilling brings a proven track record of driving strategy, cultivating high-performing teams, and delivering measurable outcomes in complex care environments.\n\nShilling's background spans a broad spectrum of healthcare domains, including personal care, hospice and end-of-life services, home health, and federal and state healthcare programs. His expertise in physician procurement, post-acute care, and hospitality further underscores his ability to navigate evolving systems and design solutions that enhance both clinical and operational performance.\n\n\"Ryan's strategic mindset and passion for improving access to high-quality care make him an invaluable addition to our executive team,\" said Gilad Savion, CEO of Lavior. \"His deep understanding of publicly funded healthcare, coupled with his results-oriented leadership, will play a critical role as we expand our presence and deepen our impact in the U.S. market.\"\n\nThroughout his career, Shilling has been at the forefront of business development, building enduring partnerships that advance care delivery and foster innovation. Known for his collaborative approach, he is uniquely positioned to help Lavior deliver on its mission: elevating healing through innovation, compassion, and measurable outcomes.\n\n\"I'm proud to join Lavior's mission to put patients first and drive meaningful change in wound care across the country, especially at a time when healing outcomes matter more than ever and we have the opportunity to truly reshape patient care.\" said Shilling. \"Together, we have the opportunity to redefine what patient-centered healing looks like, delivering solutions that not only drive better results, but do so with empathy, purpose, and long-term sustainability.\"\n\nIn his new role, Shilling will focus on scaling Lavior's U.S. operations, expanding market access, and aligning sales strategy with evolving provider and payer needs in an increasingly outcomes-based environment.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "patient care",
      "weight": 0.10032728
    },
    {
      "name": "personal care",
      "weight": 0.08770444
    },
    {
      "name": "wound care",
      "weight": 0.087288566
    },
    {
      "name": "care delivery",
      "weight": 0.08679058
    },
    {
      "name": "Ryan Shilling",
      "weight": 0.08632297
    },
    {
      "name": "post-acute care",
      "weight": 0.08580092
    },
    {
      "name": "complex care environments",
      "weight": 0.08502234
    },
    {
      "name": "Shilling",
      "weight": 0.07684808
    },
    {
      "name": "healthcare domains",
      "weight": 0.07580715
    },
    {
      "name": "Seasoned Healthcare Leader",
      "weight": 0.07566415
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.8427734375
    },
    {
      "name": "/Health/Medical Facilities & Services/Other",
      "score": 0.7568359375
    },
    {
      "name": "/Business & Industrial/Business Operations/Management",
      "score": 0.67529296875
    },
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.50244140625
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.384033203125
    },
    {
      "name": "/Jobs & Education/Jobs/Job Listings",
      "score": 0.35546875
    }
  ],
  "sentiment": {
    "positive": 0.81347656,
    "negative": 0.041137695,
    "neutral": 0.14587402
  },
  "summary": "Lavior, a leading provider in advanced healing solutions, has appointed Ryan Shilling as Vice President of Sales, U.S. Market. Shilling, who has over 15 years of leadership experience across healthcare sectors, brings strategic vision and deep market expertise to accelerate growth and drive patient-centered innovation in complex care environments. His new role will focus on scaling Lavior's US operations, expanding market access, and aligning sales strategy with evolving provider and payer needs in an increasingly outcomes-based environment. Gilad Savion, CEO of Lavior, said Shilling's deep understanding of publicly funded healthcare and results-oriented leadership will play a critical role as we expand our presence and impact our impact in the US market.",
  "shortSummary": "Ryan Shilling, a seasoned healthcare leader with over 15 years in healthcare, joins Lavior's U.S. market sales team to accelerate growth and drive patient-centric innovation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7539a6d870094d23b3e471230ceb7993",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Lavior has appointed Ryan Shilling as Vice President of Sales for the U.S. Market, bringing over 15 years of healthcare leadership experience. His expertise spans various sectors, including personal care and hospice, and he aims to enhance patient-centered innovation and care delivery. Shilling's strategic vision will focus on scaling operations and aligning sales strategies with the evolving needs of providers and payers.",
  "argos_id": "16OG43DOY"
}