{
  "url": "https://www.yahoo.com/entertainment/articles/walking-dead-actress-kelley-mack-131332394.html?_guc_consent_skip=1754487506",
  "authorsByline": "YI-JIN YU",
  "articleId": "2125893c9e9b42eaa5ee3307a431b92c",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/9be80df60ac185d55c21552ad2065bdda9f146da99cd6be36533b8ccd3b927c6/ynews/resizefill_w1200/https://media.zenfs.com/en/us.abcnews.gma.com/dc52aa7519a08b9a5e69328f0fbfcf1d",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-06T13:13:32+00:00",
  "addDate": "2025-08-06T13:40:03.576854+00:00",
  "refreshDate": "2025-08-06T13:40:03.576857+00:00",
  "score": 1.0,
  "title": "'The Walking Dead' actress Kelley Mack dies at 33",
  "description": "Mack portrayed Addy on the hit horror series.",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nKelley Mack, an actress best known for her work on the horror series “The Walking Dead,” has died at age 33.\n\nA representative for Mack confirmed her death to ABC News and said in a statement, “She will be so missed.”\n\nIn an online statement, Mack's family said she died on Aug. 2 with her mother and aunt at her side following a battle with glioma, a type of tumor of the central nervous system.\n\n“It is with indelible sadness that we are announcing the passing of our dear Kelley,” Mack's family wrote in the statement, and also called her “a bright, fervent light.”\n\n“Kelley has already come to many of her loved ones in the form of various butterflies 🦋 ❤️. She will be missed by so many to depths that words cannot express,” the statement added.\n\nIn a January Instagram post, Mack revealed she had been diagnosed with diffuse midline glioma, a rare type of cancer.\n\nAs an actor, Mack portrayed Addy during the ninth season of “The Walking Dead” and Penelope Jacobs in the eighth season of “Chicago Med,” which will return for its 11th season this fall. She was also known for her role as Alice in the horror film “Broadcast Signal Intrusion.”\n\nBride shares magic of butterfly to honor late father during her wedding\n\nBorn Kelley Klebenow, Mack was a Cincinnati, Ohio, native and grew up in Ohio, North Carolina and Illinois, according to her family. She graduated from Chapman University in 2014 and lived and worked in Los Angeles for the past decade. She was the oldest of three children, including her sister, Kathryn, and brother Parker Mack, who is also an actor.\n\nJeffrey Dean Morgan talks about his 'Walking Dead: Dead City' family and more\n\nIn addition to acting, Mack was also a producer, writer and voiceover artist, who provided the voice of Gwen Stacy for the hit film “Spider-Man: Into the Spider-Verse.”\n\nMack’s family said a “recognition and remembrance” of life for Mack will be held Aug. 16 in Glendale, Ohio, and that another celebration of life will be held in Los Angeles at a date yet to be determined.",
  "medium": "Article",
  "links": [
    "https://www.goodmorningamerica.com/video/111897248",
    "https://www.instagram.com/p/DEXo7EBRnJm/",
    "https://www.goodmorningamerica.com/topics/TheWalkingDead",
    "https://www.goodmorningamerica.com/culture/story/jeffrey-dean-morgan-talks-walking-dead-dead-city-121406208"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Kelley Mack",
      "weight": 0.11592576
    },
    {
      "name": "Mack",
      "weight": 0.10178114
    },
    {
      "name": "Parker Mack",
      "weight": 0.101711236
    },
    {
      "name": "Kelley Klebenow",
      "weight": 0.07341568
    },
    {
      "name": "Dead City",
      "weight": 0.07289491
    },
    {
      "name": "Kelley",
      "weight": 0.06898717
    },
    {
      "name": "Los Angeles",
      "weight": 0.06799971
    },
    {
      "name": "diffuse midline glioma",
      "weight": 0.06523441
    },
    {
      "name": "Walking Dead: Dead City",
      "weight": 0.06185199
    },
    {
      "name": "Macks family",
      "weight": 0.060734224
    }
  ],
  "topics": [
    {
      "name": "The Walking Dead"
    },
    {
      "name": "In Memoriam"
    },
    {
      "name": "TV"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.97509765625
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.87158203125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.623046875
    },
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.3251953125
    }
  ],
  "sentiment": {
    "positive": 0.15710449,
    "negative": 0.37670898,
    "neutral": 0.4663086
  },
  "summary": "Kelley Mack, an actress known for her roles on \"The Walking Dead\" and \"Chicago Med,\" has died at age 33 following a battle with glioma. Mack's family confirmed her death via an online statement. In addition to acting, Mack was also a producer, writer and voiceover artist, who provided the voice of Gwen Stacy for the hit film \"Spider-Man: Into the Spider-Verse.\" A recognition and remembrance of life for Mack will be held on Aug. 16 in Glendale, Ohio, and another celebration of life will take place in Los Angeles.",
  "shortSummary": "Kelley Mack, best known for \"The Walking Dead” and other roles, has died at 33 after battling glioma, her family confirmed.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "3ffbad6ae4c14880b4cb110f572ee940",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.goodmorningamerica.com/culture/story/jeffrey-dean-morgan-talks-walking-dead-dead-city-121406208",
      "text": "Jeffrey Dean Morgan talks about his 'Walking Dead: Dead City' family and more\nActor Jeffrey Dean Morgan is opening up about what his \"Walking Dead\" family means to him.\nAhead of the season 2 premiere of \"The Walking Dead: Dead City\" this weekend, Morgan, who portrays Negan in the series and is an executive producer, said the latter role is \"his favorite part\" when it comes to working on the show in a creative way.\n\"That is your family,\" he said about the cast and crew in an interview with Variety. \"This is who I'm going to spend half the year with, every single day, for 14 hours a day, so you want to find people that you love, because we don't want any as assholes on the show.\"\nHe added, \"'The Walking Dead' has always been really good at picking great people. These are people who are all still my friends, even if they're no longer alive on the show, and I can't say that about a lot of other jobs I've had.\"\n\"Dead City\" is the first sequel to \"The Walking Dead\" franchise. It centers around Negan and Maggie (Lauren Cohan) who are \"travelling into a post-apocalyptic Manhattan, long ago off from the mainland,\" according to a press release.\n\"The crumbling city is filled with the dead and denizens who have made New York City their own world full of anarchy, danger, beauty, and terror,\" the press release continues. \"In season two, in the growing war for control of Manhattan, Maggie and Negan find themselves trapped on opposite sides. As their paths intertwine, they come to see that the way out for both is more complicated and harrowing than they ever imagined.\"\nMorgan, who joined \"The Walking Dead\" in season 6, which aired in 2015, said that he feels like \"one of the veterans\" of the franchise now.\n\"I feel like I've earned my stripes,\" he said. \"[Ten] years is a long time. This is not an easy show to do in any way, mentally and certainly physically, so I'm amazed by the fact that I'm still able to pull off my part of it.\"\n\"The Walking Dead: Dead City\" season 2 premieres Sunday, May 4, on AMC at 9 p.m. ET/PT and will be available to stream on AMC+."
    }
  ],
  "argos_summary": "Kelley Mack, an actress known for her roles in 'The Walking Dead' and 'Chicago Med,' has passed away at the age of 33 after battling glioma, a rare type of brain tumor. Her family confirmed her death, expressing their deep sadness and noting that she will be greatly missed. Mack, who also contributed as a producer and voiceover artist, was celebrated for her vibrant spirit and will be honored in memorial services in Ohio and Los Angeles.",
  "argos_id": "1G0C1B4LF"
}