{
  "url": "https://www.investors.com/news/technology/novo-nordisk-stock-novo-nordisk-earnings-q2-2025/",
  "authorsByline": "Investor's Business Daily, ALLISON GATLIN",
  "articleId": "7c3debe6a1874649b082a7e562b60c65",
  "source": {
    "domain": "investors.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://www.investors.com/wp-content/uploads/2019/09/stock-NovoNordisk-02-shutter.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-06T13:16:10+00:00",
  "addDate": "2025-08-06T13:21:13.154981+00:00",
  "refreshDate": "2025-08-06T13:21:13.154982+00:00",
  "score": 1.0,
  "title": "Novo Slumps As 'Unlawful' Knockoffs Pressure Its Biggest Business",
  "description": "The company says it's working to ensure patients only receive semaglutide produced by Novo Nordisk.",
  "content": "Novo Nordisk (NVO) stock slumped Wednesday after the drugmaker said it expects continued competition this year from \"unsafe and unlawful\" copycat versions of its blockbuster obesity drug, Wegovy.\n\nThe cautious view follows Novo's decision last week to cut its outlook for 2025 — a move that sent Novo Nordisk stock crashing. Despite that, Wegovy sales soared more than 67% to roughly $3.04 billion in the June quarter. That beat expectations for $2.97 billion, according to FactSet.\n\nStill, Dave Moore, Novo's executive vice president of U.S. operations, estimates around 1 million people in the U.S. are using compounded GLP-1 drugs, including semaglutide, the chemical backbone behind Wegovy and its diabetes counterpart, Ozempic.\n\nThis spring, the Food and Drug Administration determined Wegovy and Eli Lilly's (LLY) Zepbound were no longer in shortage, meaning compounders had to stop selling copies of the branded dosages. To keep the business going, companies like Hims & Hers Health (HIMS) have been leaning into personalized doses.\n\n\"Novo Nordisk is working to prevent unlawful and unsafe compounding of semaglutide in U.S., while making sure patients have access to safe legitimate semaglutide produced only by Novo Nordisk,\" Moore said on the earnings call with analysts. \"As unsafe and unlawful mass compounding continues, the Wegovy penetration within the cash channel has been lower than expected.\"\n\nYOU MAY ALSO LIKE:\n\nZoetis Reverses And Dives As Its Arthritis Setback Continues\n\nWhy Hims Stock Plunged — And Why It Could Still Remain A 'Market Darling'\n\nSee IBD Stock Lists & Get Pass/Fail Ratings For All Your Stocks With IBD Digital\n\nIBD Stock Of The Day: See How To Find, Track And Buy The Best Stocks\n\nStock Market Today: Track Market Trends And The Best Stocks To Watch",
  "medium": "Article",
  "links": [
    "https://www.investors.com/market-trend/stock-market-today/stock-market-today-market-trends-best-stocks-buy-watch/",
    "https://www.investors.com/news/technology/hims-stock-hims-hers-health-earnings-q2-2025/",
    "https://research.investors.com/quote.aspx?symbol=LLY",
    "https://research.investors.com/quote.aspx?symbol=NVO",
    "https://research.investors.com/quote.aspx?symbol=HIMS",
    "https://www.investors.com/news/technology/eli-lilly-stock-buy-now/",
    "https://www.investors.com/news/technology/zoetis-stock-zoetis-earnings-q2-205/",
    "https://www.investors.com/product/ibd-digital/?artProdLink=IBD_Digital",
    "https://www.investors.com/research/ibd-stock-of-the-day/",
    "https://x.com/AGatlin_IBD"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Novo Nordisk stock",
      "weight": 0.118530534
    },
    {
      "name": "Novo Nordisk",
      "weight": 0.09905326
    },
    {
      "name": "Hims Stock",
      "weight": 0.098099835
    },
    {
      "name": "IBD Stock",
      "weight": 0.096092835
    },
    {
      "name": "IBD Stock Lists",
      "weight": 0.09436043
    },
    {
      "name": "Novo",
      "weight": 0.08316478
    },
    {
      "name": "Wegovy sales",
      "weight": 0.08143083
    },
    {
      "name": "Wegovy",
      "weight": 0.07809824
    },
    {
      "name": "safe legitimate semaglutide",
      "weight": 0.07316773
    },
    {
      "name": "U.S. operations",
      "weight": 0.066352986
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.96875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.96533203125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.94287109375
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.91650390625
    },
    {
      "name": "/Health/Pharmacy/Drugs & Medications",
      "score": 0.359130859375
    }
  ],
  "sentiment": {
    "positive": 0.08892822,
    "negative": 0.7446289,
    "neutral": 0.16601562
  },
  "summary": "Novo Nordisk (NVO) stock fell after the company announced it expects continued competition from \"unsafe and unlawful\" copycat versions of its obesity drug, Wegovy, this year. This follows Novo's decision to cut its 2025 outlook, which led to a drop in Novo Nordisk stock. Despite this, sales for Wegovby rose by over 67% to roughly $3.04 billion in the June quarter, which surpassed expectations for $2.97 billion. Dave Moore, Novo’s executive vice president of U.S. operations, estimates that around 1 million people in the US. are using compounded GLP-1 drugs, including semaglutide. To keep the business alive, companies like Hims & Hers Health have been focusing on personalized doses.",
  "shortSummary": "Novo Nordisk's stock slumped as it warned of unsafe and unlawful copycat versions of its obesity drug Wegovy, despite a strong sales performance.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2ed9999bbc4444479047ad2136e81dde",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.investors.com/product/ibd-digital/?artProdLink=IBD_Digital",
      "text": "Get an edge in the stock market.\nWith IBD Digital you get all the resources you need to invest smarter and boost your profits. Our members get access to high-performance stock picks, comprehensive ratings and valuable benefits that help you become a better investor.\nNo obligation. Try 2 months for $20, then only $34.95/month thereafter.\nanchorTestWe help you maximize your profits.\nIBD has been helping people like you invest better for over 35 years. We’ve learned what it takes to outperform the market and prosper in any market condition. That’s why we’ve included all these powerful and time-saving features in one subscription.\nSmarter Stock Picks\nIBD Digital’s stock lists are full of top-rated growth stocks poised for big gains. Our lists are curated by proprietary algorithms incorporating over 100 years of data.\nComprehensive Stock Ratings\nIBD doesn’t just rate stocks as Buy, Hold or Sell. We give you precise 1-99 ratings on every stock and tell you how it stacks up against its competitors.\nBig Picture Market Analysis\nOur market analysis is unmatched. For over 35 years we’ve kept subscribers on the right side of the market trend. We notice details that others miss.\nA Powerful Stock Screener\nThe IBD Stock Screener scans thousands of stocks to give you the top-rated stocks that fit your criteria. It’s a quick way to get new trade ideas at the push of a button.\nThis is why IBD Digital is better.\nWe have a team of trusted experts\nAt IBD, we go beyond opinions and spin. We use the CAN SLIM® Investing System to guide investors through every market condition. We’re data-driven and laser-focused on achieving market outperformance year after year.\nWe give you more benefits and unmatched service\nIBD Digital members enjoy tons of benefits at no extra charge, including webinars, coaching, podcasts, how to invest videos, daily market highlight videos and best-in-class customer support.\nWe’ll help you get started investing faster\nThat includes a comprehensive stock market education plus support and training from the first day you join. IBD Digital can take years off your learning curve.\n\"Investor’s Business Daily delivers information you can’t get anywhere else. The first place you’re going to find new opportunities is IBD. \"\n- Mike G.\nSubscribe\nChoose your IBD Digital plan:\nTrial\nTry 2 months of IBD Digital for only $20. Cancel any time.\n$20\nFor the first 2 Months\nBilled at $34.95/month after the trial period ends.\nMonthly\nGet unlimited access to all of IBD Digital’s premium features, tools and content.\n$34.95/mo.\nAnnual\nSave over 21% off the monthly price when you sign up for an annual membership!\n$379/yr.\nSave $90 annually\n* After the initial 2-month term, the IBD Digital subscription will auto-renew at the regular monthly rate of $34.95. You can cancel at any time. Other conditions may apply. You can cancel at any time. Other conditions may apply. See Terms and Conditions on investors.com. Offer expires on 12/31/2022 at 11:59PM PT\nSubscribe\nChoose your IBD Digital plan:\nInvestor Bundle\n$30\nFor the first 2 months\nBilled at $49.99/month after the trial period ends.\nIBD Digital\n$20\nFor the first 2 months\nBilled at $34.95/month after the trial period ends.\n* After the initial 2-month term, the Investor Bundle subscription will auto-renew at the regular monthly rate of $49.99/month. After the initial 2-month term, the IBD Digital subscription will auto-renew at the regular monthly rate of $34.95. You can cancel at any time. Other conditions may apply. You can cancel at any time. Other conditions may apply. See Terms and Conditions on investors.com. Offer expires on 12/31/2022 at 11:59PM PT\nIBD Reviews\nMike G.\n“Investor’s Business Daily delivers information you can’t get anywhere else.”\nChris\n“I have been using IBD for years and find it invaluable. I recommend it to any friends interested in investing and trading. I don’t make a trade without looking at IBD.”\nCharlotte H.\n“I’ve been investing for 31 years and tried many different strategies. Nothing has beaten Investor’s Business Daily.”\nFrequently Asked Questions\nGet answers to some of the most common questions about IBD Digital.\nAll of IBD Digital’s stock lists, market timing strategies and proprietary stock ratings are based on the CAN SLIM Investing System. This system, created by legendary investor and IBD founder William O'Neil, is a complete approach to identifying winning stocks based on decades of research.\nOur stock lists are curated by advanced algorithms that we spent years programming and perfecting. We analyzed over 100 years of stock market data to find the characteristics shared by the best stocks of all time just before their big price moves. Then we created a way to identify stocks showing the same characteristics. That’s how IBD’s stock lists are curated every day.\nWe go far beyond the simple buy/sell/hold system that is common in the industry. We have created proprietary ratings based on decades of research that give exact 1-99 and A-E scores for every stock across several categories. Want to save even more time? Check out the 1-99 IBD Composite Score that combines all our ratings into a simple, powerful score of overall stock strength!\nSince it was founded in 1984, Investor’s Business Daily has had one of the most insightful and dedicated investing research companies in the business. Our team has decades of experience watching the market and is passionate about investing. They’ve seen every market condition and have mastered the CAN SLIM Investing system.\nIf you’re new to IBD Digital, your first 2 months will only cost $20. After that, your membership will renew at $34.95/month. Our best deal: You can save over $90 per year by switching to an annual subscription at a rate of $329/year!\nYou can cancel any time. Call our Customer Success Team at 800-831-2525 or cancel online.\nWe have a dedicated Customer Success team that’s ready to help with coaching and support! Call us, email us or chat with a team member and we’ll be happy to answer all your questions.\nCall our best-in-the-business Customer Success Team at 800-831-2525 and they’ll be glad to answer your questions.\nBecome a smarter investor today.\nIBD Digital gives you an edge in the market with one-of-a-kind investing tools and analysis. Plus, get access to best-in-class education and support to help you invest smarter no matter where you are in your investing journey.\nSubscribe for as low as $10 per month\nSelect your IBD Digital membership below:\nTrial\nTry 2 months of IBD Digital for only $20. Cancel anytime.\n$20\nFor the first 2 months\nBilled at $34.95/month after the trial period ends.\nMonthly\nGet unlimited access to all of IBD Digital’s premium features, tools and content.\n$34.95/mo.\nAnnual\nSave over 21% off the monthly price when you sign up for an annual membership!\n$379/yr.\nSave $90 annually\n* After the initial 2-month term, the IBD Digital subscription will auto-renew at the regular monthly rate of $34.95. You can cancel at any time. Other conditions may apply. You can cancel at any time. Other conditions may apply. See Terms and Conditions on investors.com. Offer expires on 12/31/2022 at 11:59PM PT\nStart Investing Smarter\n-\nUnlimited Access to IBD Digital across platforms and devices\n-\nRecommended portfolio exposure levels to help manage risk\n-\nProprietary investing tools and IBD ratings for 5,000+ stocks\n-\nDaily market analysis columns, including “The Big Picture” and “Stock Market Today”\n-\nAccess to the IBD Stock Screener and IBD Stock Checkup® tools\n-\nEducational webinars, podcasts, videos and more\n“Investor’s Business Daily delivers information you can’t get anywhere else.”\n-Mike G., subscriber\nCancel anytime\nSave More with a Dow Jones Bundle\nInvestor Bundle\n$30 for 2 months\n$49.99/month thereafter\nYou will be redirected to Barron’s to complete your purchase.\n-\nUnlimited Access to IBD Digital across platforms and devices\n-\nUnlimited access to Barron’s and MarketWatch across platforms and devices\n-\nAccess to 14 exclusive IBD stock lists\n-\nProprietary investing tools & IBD ratings for 5,000+ stocks\n-\nEducational webinars, podcasts, videos and more\n* After the initial 2-month term, the IBD Digital subscription will auto-renew at the regular monthly rate of $38.95. After the initial 2-month term, the Investor Bundle subscription will auto-renew at the regular monthly rate of $49.99/month. You can cancel at any time. Other conditions may apply. You can cancel at any time. Other conditions may apply. Offer expires on 12/31/2022 at 11:59PM PT\nFrequently Asked Questions\nGet answers to some of the most common questions about IBD Digital.\nAll of IBD Digital’s stock lists, market timing strategies and proprietary stock ratings are based on the IBD Methodology. This system, created by legendary investor and IBD founder William O'Neil, is a complete approach to identifying winning stocks based on decades of research.\nOur stock lists are curated by advanced algorithms that we spent years programming and perfecting. We analyzed over 100 years of stock market data to find the characteristics shared by the best stocks of all time just before their big price moves. Then we created a way to identify stocks showing the same characteristics. That’s how IBD’s stock lists are curated every day.\nWe go far beyond the simple buy/sell/hold system that is common in the industry. We have created proprietary ratings based on decades of research that give exact 1-99 and A-E scores for every stock across several categories. Want to save even more time? Check out the 1-99 IBD Composite Score that combines all our ratings into a simple, powerful score of overall stock strength!\nSince it was founded in 1984, Investor’s Business Daily has had one of the most insightful and dedicated investing research companies in the business. Our team has decades of experience watching the market and is passionate about investing. They’ve seen every market condition and have mastered The IBD Methodology.\nIf you’re new to IBD Digital, your first 2 months will only cost $20. After that, your membership will renew at $38.95/month. Our best deal: You can save over $88 per year by switching to an annual subscription at a rate of $379/year!\nYou can cancel any time. Call our Customer Success Team at 800-831-2525 or cancel online.\nWe have a dedicated Customer Success team that’s ready to help with coaching and support! Call us, email us or chat with a team member and we’ll be happy to answer all your questions.\nCall our best-in-the-business Customer Success Team at 800-831-2525 and they’ll be glad to answer your questions."
    },
    {
      "url": "https://www.investors.com/news/technology/hims-stock-hims-hers-health-earnings-q2-2025/",
      "text": "Hims stock tumbled Tuesday — but pared even worse losses — after the obesity-fighting kingpin lagged Wall Street's second-quarter sales forecasts. However, profit came in above expectations.\nSan Francisco-based Hims & Hers Health (HIMS) reported $544.8 million in sales, up 73% year over year. But that missed more bullish forecasts for $552 million, according to FactSet. Adjusted profit more than tripled year over year to 19 cents per share, topping calls for 15 cents.\nDespite the sales setback, the company reiterated its outlook for the year.\n\"It's never been more clear that we are delivering exactly what millions of people have been waiting for: access to personalized, high-quality care that meets people where they are,\" Chief Executive Andrew Dudum said in a statement.\nOn the stock market today, Hims stock fell 12.4%, closing at 55.52. That improved from a bigger double-digit loss in after-hours trading on Monday.\nHims Stock: Focus On Personalization\nHims & Hers Health is known for selling less expensive, compounded versions of branded drugs. In the aftermath of a Food and Drug Administration decision, however, Hims and other compounders can no longer sell the same dosage as their branded counterparts.\nSo, Hims & Hers is leaning into personalization.\nEthan Feller, a stock strategist at Zacks Investment Research, says Hims will likely remain a market darling. The number of subscribers grew 31% to 2.4 million while monthly average revenue per subscriber grew 30%.\n\"With this kind of growth, and plans to expand business verticals and geographies, the company is firing on all cylinders and continues to define what personalized healthcare looks like,\" he said in an email to Investor's Business Daily.\nFurther, he noted the number of subscribers using personalized treatment plans for multiple conditions has \"exploded\" nearly 170% to 500,000.\n\"That shows this isn't a one-and-done platform, and customers are sticking around to broaden their care,\" he said.\nAn Asterisk In Hims' Guidance\nHims reported about $190 million in revenue from its GLP-1 business, Leerink Partners analyst Michael Cherny said in a client note. This included branded and compounded weight-loss drugs and diabetes treatments.\nAnd the company kept its outlook for $2.3 billion to $2.4 billion in full-year sales, in line with the Street's forecast for $2.35 billion.\nBut with expectations for $50 million in sales from the European acquisition of Zava, \"something in the HIMS outlook had to slow,\" Cherny said. The company has said it expects about $725 million in sales this year from the GLP-1 business.\nCherny kept his market perform rating on Hims stock, but raised his price target to 43 from 42.\nShaking Off The Novo Dustup\nHims & Hers also guided to adjusted earnings before interest, taxes, depreciation and amortization (EBITDA) of $295 million to $335 million. Analysts projected $324 million.\nHims stock is also shaking off a recent dustup with Novo Nordisk (NVO). Though the companies ended their short collaboration, Hims stock broke out of a consolidation with a buy point at 67.37. Later, Hims stock fell as much as 8.4% below its entry, triggering a sell rule.\nStill, Hims stock has risen markedly this year. Shares rank fourth on the IBD 50 list of elite growth stocks.\nFollow Allison Gatlin on X/Twitter at @AGatlin_IBD.\nYOU MAY ALSO LIKE:\nWhy Replimune's Surprise Rejection Rattled Wall Street, And Cratered Its Stock\nHow Idexx Laboratories Is Riding The 'Puppy Boom' To New Highs\nLearn How To Time The Market With IBD's ETF Market Strategy\nStocks To Buy And Watch: Top IPOs, Big And Small Caps, Growth Stocks"
    },
    {
      "url": "https://www.investors.com/news/technology/zoetis-stock-zoetis-earnings-q2-205/",
      "text": "Zoetis (ZTS) stock reversed Tuesday, sinking into the red, despite beating second-quarter expectations as Librela sales continued to flounder.\nLibrela is Zoetis' monoclonal antibody treatment for osteoarthritis. Sales declined in the U.S. amid worries of severe side effects in some dogs. Zoetis told Investor's Business Daily last year that less than 1% of animals who've received its arthritis shots, which also includes Solensia, have experienced side effects.\nStill, William Blair analyst Brandon Vazquez expects bears to pick on the Librela decline in the U.S. and the fact Zoetis benefited from a positive exchange rate in the second quarter.\n\"Our take is that Librela sentiment is already low, so the decline might not matter as much, especially in the context of a total U.S. companion animal beat,\" he said in a report. \"Clearly, momentum is strong enough to offset it.\"\nBut, at the close, Zoetis stock fell 3.8% to 146.12. That reversed from a strong premarket gain.\nLibrela Weighs On Zoetis Stock\nTotal sales rose 4% to $2.46 billion, just above analysts' forecast for $2.41 billion. Adjusted profit also climbed nearly 13% to $1.76 per share, beating expectations for $1.62, according to FactSet.\nSales of medical treatments for pets — which Zoetis calls companion animals — climbed 8% to $1.79 billion. That beat expectations, Vazquez said.\n\"Growth in the quarter was driven by broad-based growth across the companion animal portfolio, including Simparica Trio, Apoquel/Apoquel Chewable, and Cytopoint,\" he said. \"Growth was partially offset by declines in OA pain (Librela and Solensia) in the U.S. (but saw growth internationally).\"\nLivestock sales, on the other hand, slipped 8% to $638 million, though beat forecasts. Vazquez noted the divestiture of a key business contributed to the sales decline. But growth was operationally strong across core species, including pigs, fish, poultry and cattle.\nZoetis raised its outlook for the year and now expects to earn $6.30 to $6.40 per share, up 10 cents at the midpoint from its prior guidance, on $9.45 billion to $9.6 billion in sales. The sales outlook is up $25 million, at the midpoint, from the guidance Zoetis issued three months ago.\nFollow Allison Gatlin on X/Twitter at @AGatlin_IBD.\nYOU MAY ALSO LIKE:\nHow Idexx Laboratories Is Riding The 'Puppy Boom' To New Highs\nInsmed Is Trading At A 25-Year High. Will Its 'Skeleton Key' Work?\nWant More IBD Insights? Subscribe To Our Investing Podcast!\nRun Custom Stock Screens With MarketSurge\nOptions Trading: How To Start Using Options, How To Manage Risk"
    }
  ],
  "argos_summary": "Novo Nordisk's stock fell after the company warned of ongoing competition from unsafe copycat versions of its obesity drug, Wegovy, despite a 67% increase in sales to $3.04 billion in the June quarter. The FDA's recent decision to lift the shortage status of Wegovy has allowed compounding pharmacies to sell alternatives, impacting Wegovy's market penetration. Meanwhile, Hims & Hers Health reported strong sales growth but missed Wall Street forecasts, prompting a drop in its stock, while Zoetis faced challenges with its arthritis treatment Librela despite overall sales growth.",
  "argos_id": "2WICC44V6"
}