{
  "url": "https://www.reuters.com/de/hauslich/regierung-beschliet-rentenpaket-scharfe-kritik-von-arbeitgebern-2025-08-06/",
  "authorsByline": "Holger Hansen",
  "articleId": "2255ba533209468f8730e092b93a0267",
  "source": {
    "domain": "reuters.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.reuters.com/resizer/v2/466BJJQ7PVGY5O53NZ3KL65MHM.png?auth=b9c3bf166c40a6778eb5672993fde7c30a15f48329026674eff92afd8da1d0ca&height=1005&width=1920&quality=80&smart=true",
  "country": "us",
  "language": "de",
  "pubDate": "2025-08-06T12:25:09.604000+00:00",
  "addDate": "2025-08-06T12:29:10.277780+00:00",
  "refreshDate": "2025-08-06T12:29:10.277783+00:00",
  "score": 1.0,
  "title": "Regierung beschließt Rentenpaket – Scharfe Kritik von Arbeitgebern",
  "description": "Die Bundesregierung hat ein milliardenschweres Rentenpaket zur Absicherung des Rentenniveaus und zur Ausweitung der Mütterrente auf den Weg gebracht. Das Kabinett billigte am Mittwoch einen entsprechenden Gesetzesentwurf von Arbeitsministerin Bärbel Bas. \"Gerade in unsicheren Zeiten sendet das Rentenpaket 2025 eine klare Botschaft an alle Generationen: Die Rente bleibt stabil und gerecht\", sagte die SPD-Co-Chefin. Die Kosten von jährlich zweistelligen Milliardenbeträgen sollen aus dem Bundeshaushalt finanziert werden, in dem ohnehin schon große Lücken klaffen. Die Arbeitgeber sprachen von einem \"Boomerang für Generationen\".",
  "content": "Berlin, 06. Aug (Reuters) - Die Bundesregierung hat ein milliardenschweres Rentenpaket zur Absicherung des Rentenniveaus und zur Ausweitung der Mütterrente auf den Weg gebracht. Das Kabinett billigte am Mittwoch einen entsprechenden Gesetzesentwurf von Arbeitsministerin Bärbel Bas. \"Gerade in unsicheren Zeiten sendet das Rentenpaket 2025 eine klare Botschaft an alle Generationen: Die Rente bleibt stabil und gerecht\", sagte die SPD-Co-Chefin. Die Kosten von jährlich zweistelligen Milliardenbeträgen sollen aus dem Bundeshaushalt finanziert werden, in dem ohnehin schon große Lücken klaffen. Die Arbeitgeber sprachen von einem \"Boomerang für Generationen\".\n\nKern des Vorhabens ist die Verlängerung der Haltelinie für das Rentenniveau. Dieses wird bis zum 1. Juli 2031 bei 48 Prozent des jeweils geltenden Durchschnittslohns gesichert. Zudem erhalten Eltern von vor 1992 geborenen Kindern ab 2027 drei statt bislang zweieinhalb Jahre Erziehungszeiten bei der Rente angerechnet. Dies bedeutet pro Kind rund 20 Euro mehr Rente im Monat. Teil des Pakets ist zudem, dass das sogenannte Anschlussverbot bei sachgrundlosen Befristungen für Personen nach Erreichen der Regelaltersgrenze aufgehoben wird, um den Wiedereinstieg in den Beruf zu erleichtern.\n\nBas kündigte als weitere Elemente die Frühstart- und Aktivrente an, das dann im Parlament als ein Paket beraten werde. \"Das ist die Frühstartrente, wo wir vorsorgen wollen für Kinder und ansparen wollen von sechs bis 18 Jahren\", sagte Bas bei einem Pressetermin mit Finanzminister Lars Klingbeil auf einer Baustelle. \"Und wir wollen auch bei denen, die länger arbeiten können und wollen, das attraktiver machen.\" Bei der Aktivrente sollen Ältere mit Steuervorteilen belohnt werden, wenn sie über das Erreichen des Rentenalters hinaus arbeiten.\n\nKOSTEN FÜR HALTELINIE ERREICHEN 2031 11 Mrd EURO\n\nFür die Mütterrente veranschlagt die Regierung jährlich rund fünf Milliarden Euro. Sie sollen ab 2028 rückwirkend auch für 2027 gezahlt werden. Die Mehrausgaben für die Haltelinie fallen den Schätzungen zufolge erst ab 2029 an und steigen bis 2031 auf rund elf Milliarden Euro. Die Finanzplanung von Klingbeil für den Bundeshaushalt weist für die Jahre 2027 bis 2029 bereits eine Finanzierungslücke von rund 172 Milliarden Euro auf, in der die höheren Rentenausgaben bereits berücksichtigt sind.\n\nScharfe Kritik kam von den Arbeitgebern. \"Der heutige Kabinettsbeschluss ist ein Fehler mit langfristigen Folgen\", sagte Arbeitgeberpräsident Rainer Dulger. \"Das geplante Rentenpaket wird zum Boomerang für kommende Generationen.\" Mit zusätzlichen Kosten von rund 50 Milliarden Euro nur bis zum Jahr 2031 sei es das teuerste Sozialgesetz dieses Jahrhunderts.\n\nDer Deutsche Gewerkschaftsbund (DGB) begrüßte das Vorhaben. \"Die Stabilisierung des gesetzlichen Rentenniveaus bei mindestens 48 Prozent ist ein wichtiger Schritt\", sagte DGB-Vorstandsmitglied Anja Piel. Die Gewerkschaften pochen auf weitere Schritte. Für eine bessere Absicherung im Alter sei eine Anhebung des Rentenniveaus auf 50 Prozent erforderlich.\n\nEine weitere Anhebung des Renteneintrittsalters lehnte Piel ebenso strikt ab wie auch Bas. Wer dies fordere, müsse auch sagen, was mit den Menschen geschehe, die nicht so lange arbeiten könnten, sagte Bas im ZDF: \"Das ist für die eine reine Rentenkürzung.\" Statt eines Zwangs solle die freiwillige Weiterarbeit attraktiver werden. Wirtschaftsministerin Katherina Reiche (CDU) hatte erklärt, längeres Arbeiten sei durch den demografischen Wandel und den Fachkräftebedarf unumgänglich.",
  "medium": "Article",
  "links": [
    "https://www.reutersagency.com/en/licensereuterscontent/?utm_medium=rcom-article-media&utm_campaign=rcom-rcp-lead",
    "https://www.reuters.com/de/hauslich/top-thema-regierung-plant-174-milliarden-neue-schulden-lcke-fr-folgejahre-wchst-2025-07-29/",
    "https://www.thomsonreuters.com/en/about-us/trust-principles.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "pension package",
      "weight": 0.11807543
    },
    {
      "name": "active pension",
      "weight": 0.10640812
    },
    {
      "name": "Finance Minister Lars Klingbeil",
      "weight": 0.067615815
    },
    {
      "name": "stop line",
      "weight": 0.06747312
    },
    {
      "name": "The planned pension package",
      "weight": 0.06530577
    },
    {
      "name": "old age",
      "weight": 0.064777076
    },
    {
      "name": "the statutory pension level",
      "weight": 0.061927162
    },
    {
      "name": "older people",
      "weight": 0.061599202
    },
    {
      "name": "the higher pension expenses",
      "weight": 0.061042108
    },
    {
      "name": "the early start pension",
      "weight": 0.06094625
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.98828125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.7607421875
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.5205078125
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.392578125
    },
    {
      "name": "/Law & Government/Social Services/Welfare & Unemployment",
      "score": 0.35546875
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.34912109375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Work & Labor Issues",
      "score": 0.33544921875
    },
    {
      "name": "/Finance/Financial Planning & Management/Retirement & Pension",
      "score": 0.331787109375
    }
  ],
  "sentiment": {
    "positive": 0.09460449,
    "negative": 0.5234375,
    "neutral": 0.3815918
  },
  "summary": "",
  "shortSummary": "",
  "translation": "Berlin, August 06 (Reuters) - The Federal Government has launched a billion -dollar pension package to secure the pension level and to expand the mother's pension. The cabinet approved a corresponding draft law of Minister of Labor Bärbel Bas on Wednesday. \"Especially in uncertain times, the 2025 pension package sends a clear message to all generations: the pension remains stable and fair,\" said the SPD-CO boss. The costs of double -digit billions of billions annually are to be financed from the federal budget, in which large gaps already gap. Employers spoke of a \"boomerang for generations\".\n\nThe core of the project is the extension of the stop line for the pension level. This will be secured in 48 percent of the applicable average wage by July 1, 2031. In addition, parents of children born in front of 1992 receive three and two and a half years of parenting periods from the pension. This means around 20 euros more pension a month per child. It is also part of the package that the so -called connection ban is lifted for persons for people after reaching the standard age limit in order to make it easier to return to work.\n\nBAS announced the early start and active pension as further elements, which would then advise in parliament as a package. \"This is the early start pension, where we want to provide for children and savings from six to 18 years,\" Bas said at a press appointment with Finance Minister Lars Klingbeil on a construction site. \"And we also want to make it more attractive with those who can and want to work longer.\" At the active pension, older people are to be rewarded with tax advantages if they work beyond reaching the retirement age.\n\nCosts for stop line reach 2031 11 billion euros\n\nThe government estimates around five billion euros annually for the mother's pension. From 2028 they should also be paid retrospectively for 2027. According to the estimates, the additional expenses for the stop line will only be incurred from 2029 and will increase to around eleven billion euros by 2031. The financial planning of Klingbeil for the federal budget has a funding gap of around 172 billion euros in 2027 to 2029, in which the higher pension expenses are already taken into account.\n\nSharp criticism came from the employers. \"Today's cabinet decision is a mistake with long -term consequences,\" said employer president Rainer Dulger. \"The planned pension package becomes boomerang for upcoming generations.\" With additional costs of around 50 billion euros only by 2031 it is the most expensive social law of this century.\n\nThe German Trade Union Confederation (DGB) welcomed the project. \"Stabilizing the statutory pension level at at least 48 percent is an important step,\" said DGB board member Anja Piel. The unions insist on further steps. For better protection in old age, an increase in the pension level to 50 percent is required.\n\nA further increase in the retirement age, Piel refused as strictly as Bas. Anyone who demands this must also say what is happening to the people who could not work for so long, BAS said in ZDF: \"This is a pure pension shortening for them.\" Instead of a compulsion, voluntary continuation should become more attractive. Minister of Economic Affairs Katherina Reiche (CDU) had stated that longer work was essential due to the demographic change and the need for skilled workers.",
  "translatedTitle": "Government decides pension package - sharp criticism of employers",
  "translatedDescription": "The Federal Government has launched a billion -dollar pension package to secure the pension level and to expand the mother's pension. The cabinet approved a corresponding draft law of Minister of Labor Bärbel Bas on Wednesday. \"Especially in uncertain times, the 2025 pension package sends a clear message to all generations: the pension remains stable and fair,\" said the SPD-CO boss. The costs of double -digit billions of billions annually are to be financed from the federal budget, in which large gaps already gap. Employers spoke of a \"boomerang for generations\".",
  "translatedSummary": "The German Federal Government has initiated a billion-dollar pension package to secure the pension level and expand the mother's pension. The core of the project is the extension of the stop line for the pension, secured in 48 percent of the applicable average wage by July 1, 2031. Parents of children born in 1992 will receive around 20 euros more pension a month per child from the pension. Additional costs for the mother’s pension will reach around 11 billion euros by 2031, according to estimates. The costs are expected to be funded from the federal budget, which already has a funding gap of around 172 billion euros in 2027 to 2029. The German Trade Union Confederation (DGB) welcomed the project, while unions called for further steps to increase pension levels to 50 percent and for a further increase in the retirement age.",
  "reprint": false,
  "reprintGroupId": "a62a36e467cb4814b48f5561f1961b8b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
      "text": "The Trust Principles\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity, and freedom from bias in the gathering and dissemination of information and news.\nTrust Principles – the history\nThe Trust Principles were created in 1941, in the midst of World War II, in agreement with The Newspaper Proprietors Association Limited and The Press Association Limited (being the Reuters shareholders at that time). The Trust Principles imposed obligations on Reuters and its employees to act at all times with integrity, independence, and freedom from bias.\nReuters Directors and shareholders were determined to protect and preserve the Trust Principles when Reuters became a publicly traded company on the London Stock Exchange and Nasdaq. A unique structure was put in place to achieve this. A new company was formed and given the name 'Reuters Founders Share Company Limited', its purpose being to hold a 'Founders Share' in Reuters.\nThe legal structure has evolved over time and the Founders Share and other contractual arrangements now confer a number of special rights upon the Thomson Reuters Founders Share Company. For example, (i) the Thomson Reuters Founders Share Company has enhanced voting rights in circumstances where someone is seeking to obtain a significant shareholding in, or acquire control of, Thomson Reuters and (ii) the prior consent of the Thomson Reuters Founders Share Company must be sought prior to undertaking any sale of, or other material transaction involving, the Reuters news business unit.\nThomson Reuters itself is obliged and committed to apply the Trust Principles to its operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the Thomson Reuters business and require Thomson Reuters Directors, in the performance of their duties, to have due regard to the Trust Principles, by the proper exercise of their powers and in accordance with their other duties as Directors.\nThe Trust Principles are:\n- That Reuters shall at no time pass into the hands of any one interest, group, or faction;\n- That the integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved;\n- That Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers and to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts;\n- That Thomson Reuters shall pay due regard to the many interests which it serves in addition to those of the media; and\n- That no effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business\nThomson Reuters Founders Share Company was established in 1984 when Reuters became a public company. The directors of Thomson Reuters Founders Share Company (known as ‘Trustees’) have a duty to ensure, to the extent possible, that the Trust Principles are complied with.\nThe Trustees are experienced and eminent people from diverse arenas in politics, diplomacy, media, public service and business. The Trustees are selected by a nomination committee and proposed to the board of the Thomson Reuters Founders Share Company for appointment. The nomination committee assists in scrutinizing candidates’ suitability and its members include two persons appointed by the chairman after consultation with the European Court of Human Rights and representatives of certain press associations. The Thomson Reuters Corporation board has two representatives on the nomination committee. The Chairman and Deputy Chairman of the Thomson Reuters Founders Share Company Board are members of the nomination committee, and the Chairman appoints three other directors of the Thomson Reuters Founders Share Company as members of the nomination committee. The Chairman of the Thomson Reuters Founders Share Company acts as chairman of the nomination committee.\nThe number of Trustees has to be at least 14 and not more than 18. Trustees have a minimum of two meetings per year, and receive reports on our activities in the different fields in which we operate (including Reuters news). The Trustees meet with both the Thomson Reuters Board and representatives of senior management. Through Thomson Reuters Founders Share Company's Chairman, regular contact is maintained with our company. The relationship is one of trust and confidence.\nIndependence of Thomson Reuters\nCustomers across the world depend on us to provide them with reliable and objective news and information.\nThis means that we have a special need to safeguard our independence and integrity and avoid any bias which may stem from control by specific individuals or interests.\nThe Thomson Reuters Trust Principles were adopted in 1941 and include the preservation of integrity, reliability of news, development of the news business, and related principles.\nToday, the Trust Principles are fundamental to our entire business.\nMore information\nContact us\nBrian Moss\nFor inquiries pertaining to Reuters reporting standards and the Trust Principles please email: brian.moss@thomsonreuters.com."
    }
  ],
  "argos_summary": "The German government has approved a multi-billion euro pension package aimed at stabilizing pension levels and expanding benefits for parents, particularly those with children born before 1992. The plan includes maintaining the pension level at 48% of the average wage until mid-2031 and increasing the credited child-rearing time for eligible parents. While the package has been welcomed by labor unions, it has faced criticism from employers who argue it will impose significant costs on future generations.",
  "argos_id": "37ICAVOVF"
}