{
  "url": "https://www.theguardian.com/world/2025/aug/06/israel-issues-forced-displacement-orders-amid-fears-of-full-occupation-in-gaza",
  "authorsByline": "Peter Beaumont",
  "articleId": "bf2406042b0347e7995d99aa9b97e33b",
  "source": {
    "domain": "theguardian.com",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.guim.co.uk/img/media/d61b61936869882ef2fac50ad4918f6fd93d9a63/129_0_2000_1600/master/2000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a8b7ba8fd51f5956b73d403157312b29",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-06T12:49:17+00:00",
  "addDate": "2025-08-06T12:55:13.379026+00:00",
  "refreshDate": "2025-08-06T12:55:13.379028+00:00",
  "score": 1.0,
  "title": "Israel issues forced displacement orders amid fears of full occupation in Gaza",
  "description": "Israeli military leaders reportedly oppose Netanyahu’s plans as the country faces growing diplomatic isolation",
  "content": "The Israeli military has placed parts of Gaza City and Khan Younis under a new enforced displacement orders amid fears that the country’s prime minister, Benjamin Netanyahu, is preparing to order the full occupation of the Palestinian territory later this week.\n\nThe latest order for Gaza – euphemistically described by the Israeli Defense Force as an “evacuation” – is the latest in dozens of such announcements that have seen the vast majority of Gaza’s population displaced, many on multiple occasions.\n\nThe move came as the US president, Donald Trump, said any decision over expanded Israeli control in Gaza was up to Israel. “As far as the rest of it, I really can’t say. That’s going to be pretty much up to Israel,” he told reporters on Tuesday.\n\nMany people had only returned to Gaza City relatively recently after long periods of displacement to find their homes war-damaged and looted with even doors and windows stolen in some cases.\n\nAs Gaza’s health ministry reported that five more people had died from starvation in the coastal strip, which has been plunged into a devastating hunger crisis owing to Israel’s complete block on aid entering earlier this year, Jordan reported an aid convoy of 30 trucks that had left for Gaza had been attacked by militant Jewish settlers upon entering Israel.\n\nThe attack, the second such incident in days, saw Jordan accuse Israel of failing to act to prevent repeated assaults. “This requires a serious Israeli intervention and no leniency in dealing with those who obstruct these convoys,” said Jordan’s government spokesperson Mohammad al-Momani.\n\nAmid continuing scenes of desperate suffering in Gaza, where vast areas have been rendered to fields of rubble by incessant Israeli strikes, the strip’s civil defence agency reported that 20 people were killed when an aid truck overturned on a crowd of people.\n\n“Twenty people were killed and dozens injured around midnight last night in a truck carrying aid [that] overturned … while hundreds of civilians were waiting for aid,” said the agency’s spokesperson, Mahmoud Bassal.\n\nThe incident took place near the Nuseirat refugee camp, as the truck was driving on an unsafe road that Israel had previously bombed, Bassal added.\n\nThe acute shortages of aid have seen trucks entering Gaza surrounded and looted by hungry Palestinians on numerous occasions, contributing to a pervasive sense of chaos.\n\nThe new forced displacement order for Gaza City comes as Israeli media reported Netanyahu’s apparent determination to push ahead with an expanded war after consultations with his military chiefs on Tuesday and despite growing disquiet from serving and former Israeli security officials over the proposals.\n\nCritics of the plan say any push for full occupation – a demand being made by Israel’s far right – would put the lives of Israeli hostages in Gaza at risk, could take between a year and two years to fully achieve and would come at the expense of the country’s increasing diplomatic isolation, with the international community increasingly horrified by its actions.\n\nAmong those who spoke out against the plan on Wednesday was the Israeli opposition leader, Yair Lapid. “I told Netanyahu that occupying Gaza is a very bad idea,” Lapid said after meeting with the Israeli prime minister. “You don’t make such a move if a majority of the people aren’t with you.”\n\nOther critics include former leaders of Israel’s Shin Bet internal security service, the Mossad spy agency and the military – and also the former Israeli prime minister Ehud Barak. In a video posted to social media this week, they said far-right members of the government are holding Israel “hostage” in prolonging the conflict.\n\nNetanyahu’s objectives in Gaza are “a fantasy” said Yoram Cohen, a former head of Shin Bet, in the video.\n\nAmid signs of divisions between Netanyahu and military commanders, the defence minister, Israel Katz, said on Wednesday that the army’s chief of staff, Eyal Zamir, could “express his views”, but that the military would ultimately have to “execute” any government decisions on Gaza.\n\nKatz’s statement on X came after reports in the Israeli media in recent days suggested that Zamir is opposed to a government plan to fully occupy the Gaza Strip.\n\n“It is the right and duty of the chief of staff to express his position in the appropriate forums, and after decisions are made by the political echelon, the [army] will execute them with determination and professionalism … until the war’s objectives are achieved,” Katz wrote.\n\n“As the defence minister responsible for the [army] on behalf of the government, I must ensure that these decisions are carried out – and so it will be,” he added.\n\nZamir has made no public statements on the matter but reportedly expressed his opposition to a full military occupation of Gaza during a restricted meeting between Netanyahu and security chiefs on Tuesday.\n\nAccording to the public broadcaster Kan 11, Zamir warned such an occupation would be a “trap”.\n\nThe moves come as Gaza’s health ministry said that at least 135 Palestinians, including 87 aid seekers, had been killed and 771 injured in Israeli attacks across Gaza in the past 24 hours.",
  "medium": "Article",
  "links": [
    "https://www.theguardian.com/us-news/donaldtrump",
    "https://www.theguardian.com/world/2025/aug/02/gaza-famine-starvation-crisis-israel",
    "https://www.theguardian.com/world/2025/aug/04/hundreds-of-ex-israeli-security-officials-urge-trump-to-help-end-war-in-gaza",
    "https://www.theguardian.com/world/2025/aug/05/wasteland-rubble-dust-graves-how-gaza-looks-from-the-sky",
    "https://www.theguardian.com/world/benjamin-netanyahu"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Gaza City",
      "weight": 0.09199532
    },
    {
      "name": "Gaza",
      "weight": 0.08956782
    },
    {
      "name": "Israeli media",
      "weight": 0.07961181
    },
    {
      "name": "Israeli hostages",
      "weight": 0.07657413
    },
    {
      "name": "Israel Katz",
      "weight": 0.075888984
    },
    {
      "name": "Israeli attacks",
      "weight": 0.075623855
    },
    {
      "name": "Israeli",
      "weight": 0.07420883
    },
    {
      "name": "expanded Israeli control",
      "weight": 0.07348664
    },
    {
      "name": "incessant Israeli strikes",
      "weight": 0.07163865
    },
    {
      "name": "Israel",
      "weight": 0.071616374
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.97412109375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.9248046875
    },
    {
      "name": "/News/World News",
      "score": 0.8759765625
    },
    {
      "name": "/News/Other",
      "score": 0.65283203125
    }
  ],
  "sentiment": {
    "positive": 0.045898438,
    "negative": 0.7949219,
    "neutral": 0.15881348
  },
  "summary": "The Israeli military has issued new enforced displacement orders for parts of Gaza City and Khan Younis amid fears that Prime Minister Benjamin Netanyahu is planning to order the full occupation of the Palestinian territory. The orders, which are described as an \"evacuation\", are part of a trend that has resulted in large numbers of displaced residents in Gaza. The US president, Donald Trump, stated that any decision regarding expanded Israeli control in Gaza was up to Israel. The order comes amid reports of a hunger crisis in Gaza, where five more people have died from starvation due to Israel's complete block on aid entering. Jordan reported that an aid convoy had been attacked by militant Jewish settlers upon entering Israel. Critics of the plan, including opposition leaders Yair Lapid and Yoram Cohen, argue that it would put lives of Israeli hostages at risk and would result in increased diplomatic isolation.",
  "shortSummary": "Israel's military has placed Gaza City and Khan Younis under forced displacement orders amid concerns of a full occupation by Benjamin Netanyahu.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b54475a4502848e29fa21ee9b1799fd1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.theguardian.com/world/2025/aug/02/gaza-famine-starvation-crisis-israel",
      "text": "The people of Gaza did not need this week’s official confirmation from UN-backed hunger experts that the “worst-case scenario of famine” was unfolding there. For months they have watched as their children waste away.\n“All my children have lost nearly half of their body weight,” said Jamil Mughari, a 38-year-old from Maghazi in central Gaza. “My daughter, who is five years old, now weighs only 11kg. My son Mohammad has become just skin and bones. All my children are like this.\n“I myself used to weigh 85kg, and now I’m down to 55.”\nHe was struggling to sustain the strength required to find food for his family. “Sometimes, while walking in the street, I feel dizzy and that I’m about to collapse, but I force myself to stay upright. I also sometimes experience shivering,” he said.\nOver the course of the week, Gaza passed two appalling milestones. The official Palestinian death toll passed 60,000, although the real figure, including those buried under the rubble from Israeli airstrikes, is likely to be far higher.\nThe human cost is likely to continue to rise steeply as starvation catches up with bombs and gunfire as an indiscriminate killer. On Tuesday, the Integrated Food Security Phase Classification (IPC), a panel of experts from the UN and other aid organisations, which had long warned of the threat of famine, confirmed that the line had been crossed.\n“The worst-case scenario of famine is currently playing out in the Gaza Strip,” the IPC said, as it called for a ceasefire to prevent further “catastrophic human suffering”.\nThe 2.2 million people of Gaza have long been experts in hunger, forced to scavenge for food each day in the face of Israel’s deliberate and severe restrictions to aid deliveries.\nMughari said that food was almost nonexistent: “We can go for a week or two without any flour. Sometimes we only have one meal a day, which is lentils, and sometimes we find nothing at all to eat – we spend the day drinking water just to feel full.”\nHis family has had to move seven times since the war began, forced to flee repeated Israeli offensives. But there was no way to escape the hunger that now grips the entire territory.\n“Sometimes we get lentils from donations or charitable people, or we borrow some money to buy them, that’s it,” he said. “We don’t receive any food aid from soup kitchens; those are only for certain camps, in small quantities.\n“They [Israelis] spread news about aid coming in, but only the strong and those with weapons seize the trucks and sell the goods at extremely high prices. How can the poor afford to buy them at such prices?”\nThe four food distribution sites across Gaza run by the Gaza Humanitarian Foundation are open for only a few minutes a day, leading to huge crowds of desperate people, who have come under Israeli fire while seeking humanitarian assistance, leading to mass casualties.\nMansoura Fadl al-Helou, a 58-year-old widow, is too frail to go to the distribution points and refuses to let her son go, for fear he would not come back alive.\n“The situation there is terrible and very dangerous. The worst part is the chaos among the men – people pushing and throwing each other to the ground,” she said. “Only my one son is here, but I always stop him from going near the aid trucks because of the danger posed by the army. I couldn’t bear to see him come back to me as a martyr.”\nMughari has undergone open-heart surgery and all his children are under 12. Even if they wanted to risk their lives for the chance of finding food, they are unable to.\n“I try to remain steadfast so I can provide my children with anything to eat,” he said. “We have sent many messages to the world, but no one has moved. We no longer know what to say. All I can tell the world is that we are dying slowly, save us from this tragedy.”\nAmong the horrors the Israel-Gaza war has brought to its people, the torture of parents seeing their children starve and being powerless to save them is surely one of the worst.\n“My youngest daughter is 14 years old, and her ribcage bones are clearly visible due to extreme weakness and malnutrition,” said Abu al-Abed, a father from Deir al-Balah. “I have four daughters and three sons. They suffer from dizziness and fatigue because of the lack of food. If I, their father, feel this way, how much worse must it be for them?”\nHe said they did not receive any aid and that the food market was expensive and they could afford to buy only a little there. “The prices are extremely high; they haven’t reached such levels of inflation even in European countries. And here in Gaza, there is no source of income at all.\n“There used to be soup kitchens in the area, but now they no longer exist. There are no places that provide free food any more.\nHe said he no longer believed the world had any sense of responsibility. “For years, they boasted about human rights and the protection of lives. What I see now is that all of this was a lie, we were deceived by these slogans.\n“If we had asked them to protect the rights of animals in Gaza, they would have responded immediately and done the impossible. But when it comes to the rights of the Palestinian people, no one remembers us or feels for us, not the Arabs, not the Muslims, not the Christians, no one.”\nThe official IPC recognition of what the people of Gaza knew only too well – that they are starving – brought some faint hope that the outside world would finally stir itself to act, though long experience did not bring much confidence that would happen.\nAl-Helou said: “We have been suffering from this famine for a long time, and no one has acted. I hope that through this message, the world will finally move to help us and save us from this slow death.”\nThe news of the UK’s pledge to recognise Palestine in September, barring a ceasefire and a fundamental change in direction from Israel, impressed her even less.\n“I don’t know what would change if the British government recognises the state of Palestine. What kind of state has no sovereignty, no right to self-defence?” she asked. “It’s a good step to recognise us and the state of Palestine, but it should be a real recognition – not symbolic. A state with real rights, real sovereignty, and a people with rights like any other nation.”"
    },
    {
      "url": "https://www.theguardian.com/world/2025/aug/05/wasteland-rubble-dust-graves-how-gaza-looks-from-the-sky",
      "text": "Seen from the air, Gaza looks like the ruins of an ancient civilisation, brought to light after centuries of darkness. A patchwork of concrete shapes and shattered walls, neighbourhoods scattered with craters, rubble and roads that lead nowhere. The remnants of cities wiped out.\nBut here, there has been no natural disaster and no slow passage of time.\nGaza was a bustling, living place until less than two years ago, for all the challenges its residents endured even then. Its markets were crowded, its streets were full of children. That Gaza is gone – not buried under volcanic ash, not erased by history, but razed by an Israeli military campaign that has left behind a place that looks like the aftermath of an apocalypse.\nThe Guardian was granted permission on Tuesday to travel onboard a Jordanian military aircraft providing aid. Israel announced last week that it had resumed coordinated humanitarian airdrops over Gaza, following mounting international pressure over severe shortages of food and medical supplies, which has reached such a crisis point that a famine is now unfolding there.\nThe flight offered not only a chance to witness three tonnes of aid – far from sufficient – dropped over the famine-stricken strip but also a rare opportunity to observe, albeit from above, a territory that has been largely sealed off from the international media since 7 October and the subsequent offensive launched by Israel. Following the Hamas-led attacks that day, Israel barred foreign journalists from entering Gaza – an unprecedented move in the history of modern conflict, marking one of the rare moments that reporters have been denied access to an active war zone.\nEven from an altitude of about 2,000ft (600 metres), it was possible to glimpse places that mark some of the conflict’s most devastating chapters – a landscape etched with the scars of its deadliest attacks.\nThese are the sites of bombings and sieges that have been courageously documented by Palestinian journalists – often at the cost of their own lives. More than 230 Palestinian reporters lie buried beneath in hastily dug cemeteries.\nAbout an hour and a half after takeoff, the plane flies over the ruins of northern Gaza and Gaza City, now a wasteland of crumbling concrete and dust. Buildings are reduced to rubble, roadways pitted with craters, entire neighbourhoods flattened. From this distance it is nearly impossible to see Gaza’s inhabitants. Only through a nearly-400mm camera lens is it possible to make out a small group of people standing among the ruins of a shattered landscape – the only sign of life in a place that appears otherwise uninhabitable.\nAs the aircraft approaches the Nuseirat refugee camp, the rear hatch opens and pallets of aid slide out, parachutes blooming behind as they fall toward the ground.\n“With today’s airdrops, the Jordan Armed Forces-Arab Army has now conducted 140 airdrop operations, in addition to 293 in cooperation with other countries, delivering 325 tonnes of aid to Gaza since the resumption of airdrops on 27 July,” a note from the Jordanian military reads.\nYet such quantities are nowhere close to being enough. Humanitarian agencies warn that hunger is spreading rapidly through the territory. While airdrops can create the perception that something is being done, they are, by common consensus, costly, inefficient and do not get anywhere near to the amount of aid that could be delivered by lorries. In the first 21 months of war, 104 days of airdrops supplied the equivalent of just four days of food for Gaza, Israeli data shows.\nThey can also be deadly; at least 12 people drowned last year trying to recover food that landed in the sea, and at least five were killed when pallets fell on them.\nFarther south, the plane passes over Deir al-Balah, in central Gaza. There, in the Baraka area below, on 22 May, 11-year-old Yaqeen Hammad, known as Gaza’s youngest social media influencer, was killed after a series of heavy Israeli airstrikes hit her house while she watered flowers in a tiny patch of greenery eked out of a displacement camp.\nA couple of kilometres further, the aircraft flies near Khan Younis, besieged for months by Israeli forces amid fierce fighting in and around its hospitals. Somewhere in the northern suburbs are the remains of the home of Dr Alaa al-Najjar, a Palestinian paediatrician who worked at al-Tahrir hospital, part of the Nasser medical complex. Her house was bombed in May while she was on shift. Her husband and nine of her 10 children were killed in the attack.\nFrom the skies, it is striking just how small Gaza is – a sliver of land that has become the stage for one of the world’s bloodiest conflicts. The territory is more than four times smaller than Greater London. In this tiny corner of the Middle East, more than 60,000 people have been killed in Israeli strikes, according to health authorities. Thousands more are estimated to remain buried under the rubble.\nA few hundred metres beneath us, the Guardian reporter Malak A Tantesh, a journalist and a survivor, works on one of her dispatches. Most of her fellow reporters, editors and other colleagues are yet to meet Tantesh, owing to the Israeli blockade that makes it impossible for Gaza’s people to leave. She has been displaced multiple times, lives without reliable access to food or water, and has lost relatives, friends and her home in the fighting. It is a strange and haunting feeling to receive a message from her as the Jordanian aircraft flies above.\nAs our aircraft turns back toward Jordan, a soldier onboard points toward the hazy horizon to the south. “That’s Rafah down there,” he says.\nGaza’s southernmost area, Rafah is a region now largely destroyed, where hundreds have died in the scramble for food since the Israeli- and US-backed Gaza Humanitarian Foundation took over food deliveries in May. Just a few kilometres to the east, amid crater-pocked hills, lies the site where, on 23 March, an Israeli military unit struck a convoy of Palestinian emergency vehicles, killing 15 medics and rescue workers who were later buried in a mass grave.\nAfter touching down at Jordan’s King Abdullah II airbase in Ghabawi, the same question seems to linger among the handful of reporters who boarded the flight: when will we see Gaza again?\nAnd after seeing this desert of shattered stones and graves, what more can be destroyed when so much has already been lost?"
    },
    {
      "url": "https://www.theguardian.com/world/2025/aug/04/hundreds-of-ex-israeli-security-officials-urge-trump-to-help-end-war-in-gaza",
      "text": "About 600 former Israeli security officials, including previous heads of the Mossad and the military, have urged Donald Trump to pressure Israel to end the war in Gaza as the country’s prime minister, Benjamin Netanyahu, considers expanding the conflict.\nIn an open letter, the former officials said an end to the war was the only way to save hostages still held by Hamas.\n“Your credibility with the vast majority of Israelis augments your ability to steer prime minister Netanyahu and his government in the right direction: end the war, return the hostages, stop the suffering,” they wrote.\nThey added that they thought Hamas no longer posed a strategic threat to Israel.\nThe letter comes as pressure mounts for the Israeli government to end the war, even as Netanyahu considers intensifying the offensive. Thousands of protesters took to the streets in Israel over the weekend after two videos were released of emaciated hostages held in Gaza.\nOne video in particular, which depicted a skeletal Evyatar David digging what he said could be his own grave, prompted a wave of outrage across Israel.\nOn Sunday night, the Hostages and Missing Families Forum headquarters released a statement that accused Netanyahu of “leading Israel and the kidnapped to doom”.\nNetanyahu said on Monday he would convene his security cabinet this week to discuss how to instruct the military to meet his war goals in Gaza, with Israeli media reporting the prime minister was inclining towards expanding the offensive and seizing the entire Palestinian territory.\nAccording to Israeli media, Netanyahu wants to try “pushing for the release of the hostages through decisive military victory”.\nIntensifying military activity in the Palestinian territory would placate the far-right ministers in Netanyahu’s governing coalition, who have consistently advocated against a ceasefire.\nThe Israeli government is exploring the idea of intensified military operations as ceasefire negotiations seemed to have stalled – which it blames on Hamas. The US and Israel withdrew their negotiators from Doha 10 days ago and said they would explore “alternative options” to retrieve the hostages.\nAn expansion of the war would be contrary to what Trump’s Middle East envoy told the families of hostages over the weekend was the US position. Steve Witkoff said Washington was backing a comprehensive end to the Gaza war that would bring hostages home and assured the families that would not mean more fighting.\nAny expansion of the conflict would risk worsening the already catastrophic humanitarian situation in Gaza. A UN-affiliated humanitarian body said the territory was experiencing famine, as the approximately 2.1 million people who live there experience mass starvation.\nDespite the announcement of expanded aid measures in Gaza, humanitarian groups say Israel is still not letting nearly enough aid into the territory. Israel denies there is starvation in Gaza and blames the UN for not distributing aid efficiently.\nAt least 40 Palestinians were killed by Israeli gunfire and airstrikes in Gaza on Monday, in addition to five people who died of starvation, health authorities said. At least 10 of those who were killed were shot as they queued for food outside distribution centres run by the private US Gaza Humanitarian Foundation (GHF).\nA nurse at al-Aqsa hospital was also killed when an airdropped pallet of aid fell on him in Deir al-Balah, central Gaza. Another man was taken to the hospital after a crate of aid fell on his tent.\nThe World Health Organization announced it was delivering medicine and blood units to hospitals across Gaza – a rare delivery to bolster the Palestinian territory’s devastated healthcare system.\nAlmost 61,000 people have been killed in Gaza since the war began. Israel launched the war in response to an attack on Israel on 7 October 2023 in which Hamas-led militants killed about 1,200 people and took 251 hostage.\nFamilies of the hostages rejected the idea of further fighting in Gaza, which they said on Sunday “endangers the lives of the kidnapped, who are already in immediate danger of death”.\nThe former Israeli security officials also warned against an expansion of the war, arguing that Israel had long since achieved its military objectives in Gaza.\n“At first this war was a just war, a defensive war, but when we achieved all military objectives, this war ceased to be a just war,” Ami Ayalon, the former head of the Shin Bet security agency, said in a video on Sunday night. “This [war] is leading the state of Israel to the loss of its security and identity.”\nA demonstration was also held outside the prime minister’s office in Jerusalem in protest against plans to sack Israel’s attorney general, Gali Baharav-Miara. The government voted for her dismissal on Monday, despite the Israeli supreme court saying she should not be replaced until her term has ended.\nIn March, the Israeli justice minister started the process of firing the attorney general.\nBaharav-Miara, who was appointed by the previous government, had come into conflict with Netanyahu on a number of issues including his indictments over allegations over bribery and fraud. The government has accused her of deliberately blocking its policy initiatives and for conducting politically motivated “witch-hunts”.\nShe has also made public statements against the undermining of the separation of powers, understood to be a response to Netanyahu’s controversial judicial overhaul.\nIsrael’s high court of justice issued an injunction against the government’s decision to dismiss the attorney general, leaving her in position for the time being. The government is expected to appeal against the decision to block the firing.\nIsraeli ministers have said they will stop inviting Baharav-Miara to hearings and committee meetings, regardless of the injunction.\nThe move to dismiss the attorney general has been widely criticised by opposition parties and rights monitors. The chair of the Democrats party, Yair Golan, accused the government of trying to fire Baharav-Miara to safeguard Netanyahu’s political interests.\n“The agenda for the upcoming meeting: increased security for Netanyahu and his family and the dismissal of the attorney general,” Golan said in a post on X, alleging the prime minister did not care about the lives of Israeli hostages."
    }
  ],
  "argos_summary": "The Israeli military has issued new displacement orders in Gaza amid fears of a potential full occupation by Prime Minister Benjamin Netanyahu, as the humanitarian crisis deepens with reports of starvation and mass casualties. The situation has drawn criticism from former Israeli security officials and opposition leaders, who warn that expanding military operations could jeopardize hostages and worsen diplomatic isolation. As the death toll in Gaza surpasses 60,000, humanitarian aid remains critically insufficient, with many civilians suffering from extreme hunger and violence during aid distribution efforts.",
  "argos_id": "4HR8J9460"
}