{
  "url": "https://www.foxnews.com/health/cdc-issues-china-travel-warning-chikungunya-virus-outbreak",
  "authorsByline": "Greg Norman",
  "articleId": "4fd6c6a337bd444586ae08097e3c76aa",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/chikungunya-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-06T08:27:00-04:00",
  "addDate": "2025-08-06T12:36:48.792774+00:00",
  "refreshDate": "2025-08-06T12:36:48.792775+00:00",
  "score": 1.0,
  "title": "CDC issues China travel warning over chikungunya virus outbreak",
  "description": "The U.S. Centers for Disease Control and Prevention is warning Americans about a fast-spreading outbreak of the mosquito-borne chikungunya virus.",
  "content": "The U.S. Centers for Disease Control and Prevention warned Americans to take \"enhanced precautions\" while traveling to China over an outbreak of the mosquito-borne chikungunya virus.\n\nThe agency issued a fresh travel warning this month saying that cases of the illness are rapidly spreading in Guangdong province, with most being reported in the city of Foshan. Chinese health officials said more than 7,000 cases have been confirmed there since June 2025.\n\n\"Most people infected with chikungunya virus develop some symptoms. Symptoms of chikungunya usually begin 3–7 days after a bite by an infected mosquito,\" according to the CDC. \"The most common symptoms are fever and joint pain. Other symptoms may include headache, muscle pain, joint swelling, or rash. Most people get better within a week; however, some can have severe joint pain for months to years following acute illness.\"\n\n\"People at risk for more severe disease include newborns infected around the time of birth, older adults (65 years or older), and people with medical conditions such as diabetes or heart disease. Death from chikungunya is rare,\" the CDC added. \"There is no specific treatment for chikungunya.\"\n\nIn Foshan, efforts to combat the virus include drones being sent out to identify mosquito breeding sites, workers spraying residents with mosquito repellent before allowing them into buildings and mosquito-eating fish being released into ponds, the New York Times reported.\n\nThe European Centre for Disease Prevention and Control said that as of July, there had been around 240,000 global cases of the chikungunya virus across 16 countries and territories. The cases have been linked to 90 deaths.\n\nThe CDC said in addition to China, there are outbreaks in countries including Bolivia, Kenya and Sri Lanka. Americans traveling to Brazil, Colombia, India, Mexico, Nigeria, Pakistan, the Philippines and Thailand also are at elevated risk of exposure to the virus.\n\nDOCTORS REVEAL KEY SIGNS OF LYME DISEASE AS TICK SEASON INTENSIFIES ACROSS US\n\n\"You can protect yourself by preventing mosquito bites, which includes using insect repellent; wearing long-sleeved shirts and pants; and staying in places with air conditioning or that have screens on the windows and doors,\" the CDC said in its advisory.\n\n\"Vaccination is recommended for travelers who are visiting an area with a chikungunya outbreak,\" the CDC continued, noting that there are currently two approved chikungunya vaccines in the U.S.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Seek medical care immediately if you develop fever, joint pain, headache, muscle pain, joint swelling, or rash during or after travel,\" the CDC advised.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/health/doctors-reveal-key-signs-lyme-disease-tick-season-intensifies-across-us",
    "https://www.foxnews.com/health/fda-warns-seniors-avoid-vaccine-after-deadly-complications",
    "https://www.foxnews.com/category/world/world-regions/china",
    "https://www.chp.gov.hk/files/pdf/consensus_statement_on_the_prevention_and_control_of_chikungunya_fever_in_hong_kong_aug2025.pdf",
    "https://www.foxnews.com/health/health-officials-alarmed-unprecedented-july-spike-west-nile-infected-mosquitoes-2-major-cities",
    "https://www.nytimes.com/2025/08/05/world/asia/china-chikungunya-virus-mosquitoes-covid.html",
    "https://www.foxnews.com/video/6360664094112",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://wwwnc.cdc.gov/travel/notices/level2/chikungunya-china",
    "https://www.foxnews.com/health/rare-tick-borne-virus-causing-neurological-symptoms-diagnosed-northeastern-state"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "chikungunya virus outbreak",
      "weight": 0.103569515
    },
    {
      "name": "chikungunya virus",
      "weight": 0.099800065
    },
    {
      "name": "chikungunya",
      "weight": 0.084023006
    },
    {
      "name": "mosquito repellent",
      "weight": 0.079814956
    },
    {
      "name": "mosquito bites",
      "weight": 0.07935184
    },
    {
      "name": "severe joint pain",
      "weight": 0.07715939
    },
    {
      "name": "mosquito breeding sites",
      "weight": 0.07509706
    },
    {
      "name": "China travel warning",
      "weight": 0.07346451
    },
    {
      "name": "joint pain",
      "weight": 0.07258369
    },
    {
      "name": "CDC",
      "weight": 0.066648
    }
  ],
  "topics": [
    {
      "name": "CDC"
    }
  ],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/Health/Public Health/Other",
      "score": 0.8828125
    },
    {
      "name": "/News/Health News",
      "score": 0.8701171875
    },
    {
      "name": "/Health/Health Conditions/Infectious Diseases/Other",
      "score": 0.7998046875
    },
    {
      "name": "/Health/Medical Literature & Resources/Other",
      "score": 0.447509765625
    },
    {
      "name": "/Health/Health Conditions/Infectious Diseases/Covid-19",
      "score": 0.391357421875
    }
  ],
  "sentiment": {
    "positive": 0.09295654,
    "negative": 0.55615234,
    "neutral": 0.35083008
  },
  "summary": "The U.S. Centers for Disease Control and Prevention (CDC) has issued a travel warning for China due to an outbreak of the mosquito-borne chikungunya virus. The warning comes as cases are rapidly spreading in Guangdong province, with most being reported in the city of Foshan. Over 7,000 cases have been confirmed there since June 2025. The most common symptoms of chikunya are fever and joint pain, with some suffering severe joint pain for months to years. Those at risk include newborns, older adults, and those with medical conditions such as diabetes or heart disease. The CDC recommends avoiding mosquito bites, wearing long-sleeved shirts and pants, and staying in places with air conditioning or that have screens on the windows and doors. There have been around 240,000 global cases of the virus, linked to 90 deaths.",
  "shortSummary": "The CDC issued a travel warning in China regarding the rapidly spreading chikungunya virus, urging enhanced precautions and vaccination recommendations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "1ff77ade4ef341d4b4e9b336c0a3e857",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/category/world/world-regions/china",
      "text": "Located in East Asia, China, also known as the People’s Republic of China, is the most populous country in the world, with a population exceeding 1.4 billion. China's largest cities are Shanghai, its financial center, and Beijing, the national capital. The current president is Xi Jinping, who has served in office since 2013. China borders 14 countries, has five time zones, and is made up of 23 provinces. The eastern power is also the world's largest economy by GDP at purchasing power, the second-wealthiest country, and the world's largest manufacturer and exporter. Along with having nuclear capabilities, China is considered a rising superpower and potential global rival to the United States.\nThe modern Chinese government emerged after the fall of its last monarch in 1912, giving way to the emergence of the Republic of China. During the Second Sino-Japanese War, China's ruling nationalists united the Chinese Communist Party to defeat the invading Japanese army. From 1945 to 1949, the country was in a civil war between the nationalists and communists that ended with the CCP claiming victory over modern-day mainland China and the nationalists fleeing to the island of modern-day Taiwan.\nCurrently, China is ruled by the Chinese Communist Party as a one-party socialist Republic. China has economic and political influence over various international organizations, including the United Nations, where it sits on the Security Council as a permanent member with the power to veto measures. China holds membership in the G20, APEC, RBICS, and the East Asia Summit.\nThe Chinese military has the largest standing army by individual military personnel and the second largest defense budget behind the U.S. The government of China has faced criticism for its repression of political dissidents and ethnic and religious minorities. One of China's closest allies is the neighboring eastern power of Russia."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/health/fda-warns-seniors-avoid-vaccine-after-deadly-complications",
      "text": "Older adults are being warned against receiving the chikungunya vaccine before traveling.\nThe Ixchiq vaccination, developed by Valneva to prevent the mosquito-borne chikungunya virus, was approved by the Food and Drug Administration (FDA) in November 2023 as the first of its kind.\nThe approval applies to anyone aged 18 and older who has a risk of being exposed to the virus.\nFIRST VACCINE FOR CHIKUNGUNYA VIRUS, AN ‘EMERGING GLOBAL HEALTH THREAT,’ GETS FDA APPROVAL\nBut the FDA and the Centers for Disease Control and Prevention (CDC) released a safety notice on May 9 recommending that adults over 60 years old pause use of the vaccine due to fatal complications.\n\"FDA and CDC will continue the evaluation of post-marketing safety reports for Ixchiq,\" the release reads.\n\"While the safety of Ixchiq for use in individuals 60 years of age and older is being further assessed, FDA and CDC are recommending a pause in use of the vaccine in this age group. FDA and CDC will update the public when the agencies complete their evaluation of this safety issue.\"\nThe advisory follows reports of \"serious adverse events,\" including neurologic and cardiac events in people who received the vaccine.\nCLICK HERE TO GET THE FOX NEWS APP\nTwo of 17 events resulted in death from severe complications. One death was caused by encephalitis, or inflammation in the brain, the alert stated.\nThose who experienced adverse effects of the vaccine were reported to be between the ages of 62 and 89.\nThe FDA warned that Ixchiq, which contains a live, weakened version of chikungunya, may cause symptoms similar to the virus.\nTypical symptoms of chikungunya include fever, severe joint pain, headache, muscle pain and a rash, according to the CDC.\nCLICK HERE TO SIGN UP FOR OUR HEALTH NEWSLETTER\nMost people recover within a week, but some may experience \"severe and disabling\" joint pain for weeks or months.\n\"This virus is in a similar category as dengue or Zika and is carried by the same mosquitoes,\" Fox News senior medical analyst Dr. Marc Siegel previously told Fox News Digital.\nAt the time of the vaccine's approval, the FDA described chikungunya as an \"emerging global health threat,\" with at least five million cases reported over the past 15 years.\nFor more Health articles, visit www.foxnews.com/health\nThe FDA plans to conduct an \"updated benefit-risk assessment\" for Ixchiq use in those over 60 years of age, according to the notice.\nFox News Digital's Melissa Rudy contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/health/doctors-reveal-key-signs-lyme-disease-tick-season-intensifies-across-us",
      "text": "Lyme disease is prevalent this time of year, especially in the Northeast, mid-Atlantic and upper-Midwest regions of the U.S. — though there have been reports of cases in expanding areas, according to the Centers for Disease Control and Prevention (CDC).\nBorrelia burgdorferi, the bacterial infection that causes Lyme disease, is transmitted to humans through the bite of a black-legged (deer) tick, per the above source.\nDeer ticks the size of a poppy seed can inject a numbing chemical when they bite, allowing the infection to go undetected until symptoms begin to show weeks later.\nTICKS SPREAD TO NEW REGIONS ACROSS AMERICA, BRINGING DANGEROUS DISEASES AND NEED FOR VIGILANCE\nThe infection can lead to severe muscle and joint pain, Lyme arthritis, cardiac complications and neurological conditions, experts told Fox News Digital.\nHow to know if you have Lyme disease\nA telltale sign of Lyme disease is a red circular bull’s-eye rash or multiple rashes on the skin, especially in tick-endemic regions.\nBetween 60% and 80% of patients will develop a rash, according to experts.\n\"We're looking for specific findings, like the classic bull's-eye rash, a swollen joint or a facial droop called Bell's palsy, which can be seen with Lyme disease,\" Dr. Andrew Handel, a pediatric infectious disease specialist at Stony Brook Children's Hospital on Long Island, New York, said in an interview with Fox News Digital.\nSymptoms typically emerge two weeks after the bite, becoming more severe if they go untreated.\nIf the infection isn’t treated at the time of the rash, patients will typically seek medical attention for later manifestations of the infection, Handel noted.\nThose can include Bell’s palsy (facial nerve paralysis), Lyme meningitis (often marked by severe headache, neck stiffness and fever) and carditis (inflammation of heart tissues).\nOne of the earliest signs of Lyme disease is overwhelming fatigue and joint aches, according to Dr. Daniel Cameron, an epidemiologist in Mount Kisco, New York, who specializes in tick-borne illnesses.\nOther symptoms may include fever, brain fog, dizziness, palpitations and nerve pain, among others.\nTesting, treatment and prevention\nA blood test can help diagnose Lyme disease, but timing matters.\n\"The way we diagnose Lyme disease in the blood is by looking for antibodies, for the immune system's response to the infection, as opposed to other infectious testing, where you find the bacteria itself,\" Handel told Fox News Digital.\nTICK BITES AND LYME DISEASE: WHAT TO DO IF A TICK BITES YOU OR YOUR PET\nTesting too early can result in a false negative, as antibody tests often don't turn positive until three or four weeks after the tick bite occurred.\nAfter sustaining a tick bite, experts recommend immediately removing the tick and seeing a healthcare provider.\nDoctors will typically prescribe a post-exposure prophylaxis (PEP) with a 200-milligram dose of the antibiotic doxycycline to be taken within 72 hours of a high-risk tick bite, epidemiologists told Fox News Digital.\n\"It's the immune system’s lingering response to the infection that you had in the past.\"\nAlthough studies have found this dose to be effective in the majority of cases, some physicians prefer a longer course of treatment for tick bites.\n\"I'm not a big fan of a single dose of doxycycline [200 mg] for a tick bite, even though it's pretty popular,\" Cameron told Fox News Digital. \"I don’t feel comfortable with a single dose if I really want to avoid Lyme.\"\nInstead, Cameron prefers a four-week course of antibiotics for suspected Lyme disease cases. For patients who don’t want to take antibiotics right away, he said he will \"watch and wait\" to see if symptoms emerge and then treat accordingly.\nThe doctor recommends that patients follow up in a month to be assessed and undergo screenings for other infections if necessary.\nIn the event that a patient develops Lyme, the disease typically responds well to a course of antibiotics, which may include doxycycline, amoxicillin or cefuroxime, according to experts.\nTreatment duration can vary from 10 days up to four to six weeks.\nChronic Lyme vs. babesiosis\nChronic Lyme disease — also known as post-treatment Lyme disease syndrome (PTLDS) — is a condition that affects a subgroup of patients who were already treated for Lyme disease, but continue to have symptoms.\n\"The bacteria is dead and gone. It's the immune system’s lingering response to the infection that you had in the past,\" Handel told Fox News Digital.\nFor these cases, doctors typically prescribe symptom-based therapies rather than additional antibiotics.\nMore research is needed in the field of PTLDS, experts agree.\nCLICK HERE TO GET THE FOX NEWS APP\n\"It remains an area that requires further understanding and investigation as to how to optimally treat the symptoms that patients have,\" Dr. Aaron Glatt, a hospital epidemiologist at Mount Sinai South Nassau on Long Island, New York, and spokesperson for the Infectious Diseases Society of America, said in an interview with Fox News Digital.\n\"However, the current data do not support providing additional antibiotic therapy for this condition.\"\nIf someone suspects they have PTLDS, they should discuss with their physician the possibility of other diseases, such as babesiosis, which is widely regarded as the second-most common tick-borne illness in the Northeastern U.S.\nWhile babesiosis is spread by the same tick as Lyme disease, it is caused by a parasite called Babesia microti rather than a bacterium, per the CDC.\nCLICK HERE TO SIGN UP FOR OUR HEALTH NEWSLETTER\n\"It’s the same tick, but doxycycline doesn’t do a thing for it, whether you take two pills or the full course,\" Cameron said. \"You’ll never get control of Babesia until you take some anti-parasite medicine.\"\nIf someone does not respond to Lyme treatment, Cameron recommends that they get tested for babesiosis and receive antiparasitic medications if necessary.\nProtecting against tick bites\nThe best way to prevent Lyme disease is to avoid tick bites in the first place, experts agree.\nThey recommend taking the following preventive measures.\n- Perform tick checks in common areas like behind the ears, knees, underarms, scalp, around the waistline, ankles, legs and groin area.\n- Shower within two hours of being outdoors.\n- Tumble clothes worn outdoors for at least 10 minutes in the dryer on high heat.\n- When outdoors, wear long sleeves and pants, with socks tucked into pants.\n- Consider wearing clothing that is pre-treated with permethrin, a synthetic chemical that acts as a tick repellent.\n- Use tick repellents that contain DEET, another synthetic chemical that has proven effective against ticks.\nFor more Health articles, visit www.foxnews.com/health\nIf you do find a tick on your body, Cameron and Handel suggest following the protocol below.\n- Using fine-tipped tweezers, remove the tick as close to the skin as possible. Pull upward using steady pressure.\n- Avoid squeezing the tick, as this can cause it to regurgitate and expel toxins into the body.\n- Do not burn the tick with a match or apply petroleum gel.\n- After removal, place the tick in a plastic bag to help your healthcare provider identify it.\n- Wash the area of the bite."
    },
    {
      "url": "https://wwwnc.cdc.gov/travel/notices/level2/chikungunya-china",
      "text": "Chikungunya in China\nKey points\n- There is an outbreak of chikungunya in Guangdong Province, China. Most cases have been reported in Foshan city (see map).\n- Mosquitoes spread the virus that causes chikungunya.\n- You can protect yourself by preventing mosquito bites, which includes using insect repellent; wearing long-sleeved shirts and pants; and staying in places with air conditioning or that have screens on the windows and doors.\n- Vaccination is recommended for travelers who are visiting an area with a chikungunya outbreak. Two chikungunya vaccines are approved for use in the United States.\n- If you are pregnant, reconsider travel to the affected areas, particularly if you are close to delivering your baby. Mothers infected around the time of delivery can pass the virus to their baby before or during delivery. Newborns infected in this way or by a mosquito bite are at risk for severe illness, including poor long-term outcomes.\n- In general, vaccination against chikungunya should be deferred until after delivery. However, when the risk of infection is high and exposure cannot be avoided, pregnant travelers should discuss with their healthcare provider the potential risks (to themselves and their babies) of chikungunya virus infection and the potential benefits and risks of vaccination so that vaccination can be considered.\n- Seek medical care immediately if you develop fever, joint pain, headache, muscle pain, joint swelling, or rash during or after travel.\nFor Clinicians\n- Two chikungunya vaccines are licensed in the United States:\n- Healthcare providers should refer to the vaccine package inserts for contraindications for use of each vaccine.\n- In addition, CDC and FDA recently investigated five hospitalizations for cardiac or neurologic events following vaccination with IXCHIQ among older people. This topic was discussed at the April 16th Advisory Committee on Immunization Practices (ACIP) meeting. We have also become aware of additional reports of serious adverse events among people aged 62 to 89 years from the use of the vaccine in other countries. Until these additional reports can be further investigated, the live-attenuated vaccine should not be used among people 60 years and older.\n- Healthcare providers should discuss the benefits and risks of vaccination with individual travelers based on their age, underlying health conditions, destination, trip duration, and planned activites.\nTraveler Information\n- Health Information for Travelers to China\n- CDC Chikungunya Website\n- Chikungunya vaccines\n- Avoid Bug Bites\nClinician Information\n- Chikungunya in the CDC Yellow Book (Health Information for International Travel)\n- Treatment and Prevention of Chikungunya Virus Disease\n- Chikungunya Vaccine Information for Healthcare Providers\n- FDA and CDC Recommend Pause in Use of Ixchiq (Chikungunya Vaccine, Live) in Individuals 60 Years of Age and Older While Postmarketing Safety Reports are Investigated\nChikungunya disease is caused by the chikungunya virus and is spread to humans through mosquito bites. Outbreaks have occurred in countries in Africa, Americas, Asia, Europe, the Caribbean, and Indian and Pacific Oceans.\nMost people infected with chikungunya virus develop some symptoms. Symptoms of chikungunya usually begin 3–7 days after a bite by an infected mosquito. The most common symptoms are fever and joint pain. Other symptoms may include headache, muscle pain, joint swelling, or rash. Most people get better within a week; however, some can have severe joint pain for months to years following acute illness.\nPeople at risk for more severe disease include newborns infected around the time of birth, older adults (65 years or older), and people with medical conditions such as diabetes or heart disease. Death from chikungunya is rare.\nThere is no specific treatment for chikungunya."
    },
    {
      "url": "https://www.foxnews.com/health/health-officials-alarmed-unprecedented-july-spike-west-nile-infected-mosquitoes-2-major-cities",
      "text": "Mosquitoes carrying the West Nile virus have reached one of the highest numbers ever recorded in Minnesota during the month of July, and authorities caution citizens to stay inside at dusk and dawn.\nThe blood-sucking bugs in all seven counties of the Minneapolis-Saint Paul metropolitan area tested positive for the disease, according to the Metropolitan Mosquito Control District (MMCD).\nMMCD ecologists processed nearly 200 mosquito pools and found Culex tarsalis mosquitoes, the species most blamed for spreading the West Nile virus, were \"active in some of the highest numbers\" ever recorded, according to FOX 9 Minneapolis-St. Paul.\nUS MEASLES CASES HIT HIGHEST LEVEL IN MORE THAN 30 YEARS, CDC DATA SHOWS\nOf 133 pools tested, 34 tested positive for the virus, showing a rate of more than 25% positivity, MMCD reported.\nThe rate is one of the highest recorded in the month of July, more in line with numbers seen in late August, when mosquito populations wind down.\nCDC DECLARES BIRD FLU EMERGENCY OVER AS EXPERTS WARN OF POSSIBLE FALL RESURGENCE\nPositive West Nile virus samples were also found in mosquitoes in other states, including Georgia, where they were confirmed in three different areas of Atlanta.\nThough the city is working on coordinating insect control, officials asked residents near affected areas to protect themselves from bites and eliminate standing water to prevent mosquito breeding.\nTICKS SPREAD TO NEW REGIONS ACROSS AMERICA, BRINGING DANGEROUS DISEASES AND NEED FOR VIGILANCE\nThe West Nile virus is a mosquito-borne disease that can cause encephalitis, or inflammation of the brain, according to the Minnesota Department of Health (MDH).\nOriginating between mosquitoes and birds in Africa and Europe, the virus spread to the U.S. in 1999 when an outbreak in New York sent nearly 60 people to the hospital over two months.\nCLICK HERE TO GET THE FOX NEWS APP\nMost of the patients had clinical signs of brain swelling, and seven patients died, according to a report from the National Institutes of Health.\nCLICK HERE TO SIGN UP FOR OUR HEALTH NEWSLETTER\nWhile the disease can be more detrimental to older patients and those with muscle weakness, MDH officials said most people bitten by infected mosquitoes experience either mild symptoms or none at all."
    },
    {
      "url": "https://www.foxnews.com/health/rare-tick-borne-virus-causing-neurological-symptoms-diagnosed-northeastern-state",
      "text": "As tick season continues to pick up steam across the U.S., a Maine resident has been diagnosed with a potentially serious tick-borne illness.\nThe adult, who lives in Hancock County, was hospitalized with Powassan virus after developing \"neurological symptoms,\" according to the Maine Center for Disease Control and Prevention (Maine CDC).\nPowassan virus is transmitted to humans through the bite of an infected woodchuck tick, or from an infected deer, though that is less likely.\nTICKS SPREAD TO NEW REGIONS ACROSS AMERICA, BRINGING DANGEROUS DISEASES AND NEED FOR VIGILANCE\nDr. Jorge P. Parada, M.D., medical advisor at the National Pest Management Association (NPMA) in Chicago, noted that the Powassan virus is rare compared to diseases like Lyme disease, but \"it’s still a serious concern.\"\n\"One of the most dangerous aspects of it is its rapid transmission,\" Parada told Fox News Digital.\n\"Powassan can be transmitted in as little as 15 minutes after the infected tick bites, while Lyme disease usually requires a 36- to 48-hour attachment time for transmission.\"\nDr. Marc Siegel, Fox News' senior medical analyst, confirmed this virus is transmitted much more quickly than Lyme disease, with an incubation period of one to four weeks.\nINVASIVE PESTS COULD STAGE DRAMATIC COMEBACK THIS SUMMER, EXPERTS WARN\nWhile cases are rare, with just seven to eight diagnoses each year in the U.S., they have been on the uptick in recent years — primarily in the Northeast and Great Lakes regions, according to the U.S. Centers for Disease Control and Prevention (CDC).\nAs with other tick-borne illnesses, the virus is most prevalent from late spring through mid-fall.\n\"Unlike most tick-borne illnesses, 10% to 15% of severe cases are fatal.\"\nInitial symptoms of Powassan virus include fever, headache, vomiting and weakness, per the CDC, although some infected people may not get sick.\nIn some cases, the virus can lead to severe illness, leading to inflammation of the brain and spinal cord.\nIn these rare cases, those infected may experience difficulty speaking, confusion, loss of coordination and seizures, the health agency warned.\nWhile anyone can develop severe disease, those at highest risk include older adults, children and people who are immunocomprised.\nCLICK HERE TO SIGN UP FOR OUR HEALTH NEWSLETTER\nThere are no vaccines available for Powassan virus.\n\"Unlike most tick-borne illnesses, 10% to 15% of severe cases are fatal, and half of the survivors experience permanent neurological damage,\" Parada said.\nMany who experience severe disease suffer from long-term symptoms, including headaches, memory problems and a decline in muscle strength.\nThere is not a specific medication for Powassan virus, with treatment focused on managing symptoms and complications, according to Maine CDC.\n\"Since there isn’t a treatment or vaccine for the Powassan virus, prevention is critical,\" Parada said.\nThe same tick prevention strategies for Lyme disease also apply to this virus, he said.\nThose include using EPA-registered insect repellents containing at least 20% DEET, wearing light-colored clothes with long sleeves and pants tucked into socks in areas with ticks, and performing a thorough tick check on yourself, your family and pets after being outdoors, according to Parada.\nCLICK HERE TO GET THE FOX NEWS APP\n\"We also recommend making your yard less attractive to ticks by keeping grass short, and using gravel or wood chips to create a ‘tick moat’ between the edge of your property to discourage migration,\" he advised.\nFor more Health articles, visit www.foxnews.com/health\nThe doctor added, \"The combination of Powassan’s rapid transmission, severe health consequences and lack of treatment options makes this an emerging public health concern that requires immediate attention to prevention efforts.\""
    }
  ],
  "argos_summary": "The CDC has issued a travel warning for Americans visiting China due to a chikungunya virus outbreak, particularly in Guangdong province, where over 7,000 cases have been reported. Symptoms include fever and joint pain, with severe cases more likely in vulnerable populations. The CDC recommends enhanced precautions, including vaccination and mosquito bite prevention measures, as well as immediate medical attention for symptoms during or after travel. Additionally, the FDA has paused the use of a new chikungunya vaccine for individuals over 60 due to safety concerns.",
  "argos_id": "4W0I8UULC"
}