{
  "url": "https://www.polygon.com/war-of-the-worlds-2025-ice-cube-review/",
  "authorsByline": "Matt Patches",
  "articleId": "34250d769817451da69c8e5e063520bc",
  "source": {
    "domain": "polygon.com",
    "paywall": false,
    "location": {
      "country": "be",
      "county": "Antwerp",
      "city": "Antwerp",
      "coordinates": {
        "lat": 51.2211097,
        "lon": 4.3997081
      }
    }
  },
  "imageUrl": "https://static1.polygonimages.com/wordpress/wp-content/uploads/2025/08/ice_cube_war_worlds.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-06T12:50:19+00:00",
  "addDate": "2025-08-06T12:54:20.321831+00:00",
  "refreshDate": "2025-08-06T12:54:20.321835+00:00",
  "score": 1.0,
  "title": "Ice Cube’s War of the Worlds earns its 0% on Rotten Tomatoes",
  "description": "A disastrous screenlife adaptation of the H.G. Wells classic does not have to be seen to be believed, but you should read about it.",
  "content": "There’s no mistaking War of the Worlds (2025), dumped at the end of July on to Amazon Prime Video, for Steven Spielberg and Tom Cruise’s acclaimed 2005 War of the Worlds. Or Byron Haskin's Academy Award-nominated 1953 War of the Worlds. Or the BBC’s 2019 TV version of War of the Worlds, which expanded the story to 24 episodes. Or even The Asylum’s 2005 straight-to-DVD War of the Worlds, which looks like it was produced for several thousand dollars.\n\nThere are many, many adaptations of H.G. Wells’ 19th-century sci-fi novel — some good, some bad. This year’s version lowers the quality bar so far it’s practically Jules Verne’s Journey to the Center of the Earth.\n\nThat’s because War of the Worlds (2025) takes place entirely on a computer screen — part of the ever-expanding “screenlife” genre — and, consciously or not, makes the case for a technocratic societal reboot where Teslas cars are rescue vehicles and Amazon drones swoop in to save the day. It’s also a complete misfire, to the tune of 0% on Rotten Tomatoes. The only redeeming quality: Ice Cube now has a place on Mount Razziemore in a movie I can only hope earns its own Mystery Science Theater 3000 episode.\n\nIce Cube stars as Will Radford, a surveillance technician working for the Department of Homeland Security. When he isn’t spying on his daughter and son using the nation’s Big Brother camera grid — what a guy! — he’s averting national crises by snuffing out extremism in America’s suburban neighborhoods. His latest target: “Disruptor,” a classic hooded hacker with Jigsaw-from-Saw voice modulation who intends on exposing a vague U.S. conspiracy, codenamed Goliath. Despite his ability to monitor and screw with every person on Earth with the click of a few buttons, Will does not believe the government would ever pull a fast one on the American people. His hunt for Disruptor is interrupted by a sudden, full-scale alien invasion.\n\nIf you squint, you can see how director Rich Lee — who has directed some visually intoxicating music videos for Eminem, Lana del Rey, and Billie Eilish over the years — might see the screenlife format as a modern update to Orson Welles’ notorious 1938 War of the Worlds radio broadcast, the found-footage fakery of its day. And there are shimmers of how Lee’s background in action previsualization for movies like the Pirates of the Caribbean trilogy could create thrilling ground-level visuals during a tripod attack. But the experiment fails as War of the Worlds’ disparate elements — Ice Cube’s over-the-top performance, SyFy-level special effects, and what appears to be literal phoned in performances by notable actors like Clark Gregg — collide in a cacophony of pop-up windows. The scope of the apocalyptic situation, so grand-yet-human in Spielberg and Haskin’s blockbuster versions, is suffocated by Microsoft Teams (maybe a Zoom version would have been slightly better).\n\nI don’t blame the screenlife genre as a whole. Unfriended remains unmatched, while Shudder’s Host rode the unfortunate circumstances of 2020 to video-call cinema glory. Last year’s Red Rooms even proved clicking around a computer screen in the dark could make for a gut-wrenching watch. Lee’s ambition for War of the Worlds isn’t necessarily lower, but the execution is jumbled. As the destruction ramps up, and tripods run amok across the globe, we’re mostly stuck with Ice Cube gawking and screaming into his computer like he’s an audience member of a much better movie. “Took your ass out!” he bellows as he watches fake CNN clips. I felt jealous.\n\nI am typically pro-Cube. I want the best for Cube. From Boyz in the Hood to Friday to the Barbershop movies and even junk like XXX: State of the Union, his natural no-BS charisma has proved versatile. But a Quentin Tarantino or Safdie brother needs to come rescue this guy. Zero chemistry breaks through the computer screens.\n\nA maudlin screenplay credited to Kenneth A. Golde and Marc Hyman apes the Spielberg “single dad” conceit, with Ice Cube attempting to parent his pregnant daughter and conspiracy-prone kid via video chat while he races to investigate the invasion from afar. Unfortunately, Will is a bit of a dick, and his kids are all plot pawns — she’s a biologist, he’s a hacker! — for a contrived conclusion that clumsily winds back to the original source material. Thankfully, their strained family bickering has the rhythms of a Saturday Night Live disaster-movie parody. We’re not supposed to laugh, but it’s OK if we do.\n\nPartway through War of the Worlds, Lee’s movie veers over a cliff, passing from well-intentioned into straight rotten. I at least found it delightfully obscene. In the end, the surveillance state — ridiculed by Will’s son, defended by a father losing faith in what he knows — is the hero. When Will and his NASA pal Dr. Sandra Salas (Eva Langoria, the only person asked to run around on foot in this film) discover that the entire war is a distraction effort to allow tiny alien robots to hack the world’s data servers. Though Ice Cube mentions multiple times that global servers are down, voila!, his keyboard is the almighty savior (this, despite the fact that he appears locked in his control room in one of the most comical bits of the movie). Using the power of Big Tech, Will and Sandra devise a plan that relies entirely on… Amazon… to deliver a flash drive… in the nick of time. Thank you for your service, \"Buy Now with 1-Click.\"\n\nAnd yes, before all that, someone really does escape a tripod in a Tesla.\n\nWar of the Worlds is a movie in which the phrase “fake news!” is yelped before characters actually do uncover a Deep State plot. If the movie were any good, I might fear the implications. But it seems like the reasonable pitch — to Cloverfield-ify H.G. Welles — maaaaaay have gotten away from everyone involved. There might be an audience for it: Those who hope Jeff Bezos and Elon Musk will have the clearance to get their playthings up in the sky before we actually have to defend ourselves from Martians may see it another way. Which actually makes Prime Video the perfect straight-to-streaming home for this bizarre 2025 reject.",
  "medium": "Article",
  "links": [
    "https://www.polygon.com/23591677/found-footage-horror-dead-replaced-screenlife-immersive/",
    "https://www.polygon.com/21519609/best-horror-movies-on-shudder/",
    "https://www.polygon.com/horror/460518/red-rooms-director-interview-serial-killer/",
    "https://www.youtube.com/watch?v=Xs0K4ApWl4g",
    "https://www.youtube.com/watch?v=qolmz4FlnZ0",
    "https://www.polygon.com/movies/612199/parasite-director-bong-joon-ho-favorite-steven-spielberg-movie-tom-cruise/",
    "https://www.polygon.com/22999975/mega-shark-vs-giant-octopus-asylum-movies-interview-jack-perez/",
    "https://www.youtube.com/watch?v=-PZsSWwc9xA",
    "https://www.polygon.com/2023/10/13/23914582/unfriended-watch-netflix-horror-movie-screenlife-best-halloween/",
    "https://www.youtube.com/watch?v=EHkozMIXZ8w&list=RDEHkozMIXZ8w&start_radio=1"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ice Cube",
      "weight": 0.064573534
    },
    {
      "name": "War",
      "weight": 0.060681537
    },
    {
      "name": "movies",
      "weight": 0.05578785
    },
    {
      "name": "Cube",
      "weight": 0.05060018
    },
    {
      "name": "Will Radford",
      "weight": 0.04902065
    },
    {
      "name": "Amazon Prime Video",
      "weight": 0.047625747
    },
    {
      "name": "Will",
      "weight": 0.04684142
    },
    {
      "name": "Ice Cube’s War",
      "weight": 0.046768438
    },
    {
      "name": "video chat",
      "weight": 0.042661473
    },
    {
      "name": "Amazon drones",
      "weight": 0.041600075
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.93359375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.69580078125
    },
    {
      "name": "/Arts & Entertainment/Movies/Action & Adventure Films",
      "score": 0.40966796875
    },
    {
      "name": "/Arts & Entertainment/Movies/Science Fiction & Fantasy Films",
      "score": 0.398193359375
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.326171875
    }
  ],
  "sentiment": {
    "positive": 0.08959961,
    "negative": 0.5551758,
    "neutral": 0.35498047
  },
  "summary": "Ice Cube's War of the Worlds (2025), a sci-fi adaptation of H.G. Wells' 19th-century novel, has received a 0% rating on Rotten Tomatoes. The film, which is part of the expanding \"screenlife\" genre, stars Cube as Will Radford, a surveillance technician working for the Department of Homeland Security. Despite this, the film fails to impress. The director Rich Lee's vision for the film was inspired by the director's background in action previsualization for movies like the Pirates of the Caribbean trilogy, but it fails. The only redeeming quality is that Cube now has a place on Mount Razziemore.",
  "shortSummary": "Ice Cube's \"War of the Worlds\" (2025) suffers from poor quality and genre-influenced performances, criticized for being a computer-based drama with mixed performances and visuals.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "a0e1f4bcb604461ea46c62379d8caf5b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.polygon.com/22999975/mega-shark-vs-giant-octopus-asylum-movies-interview-jack-perez/",
      "text": "The 1979 war film Apocalypse Now is infamous for going over budget, over schedule, and over the top to appease director Francis Ford Coppola’s every demand. 2009’s Mega Shark vs. Giant Octopus is infamous for ... the exact opposite reasons. Pumped through the direct-to-video company The Asylum’s “mockbuster” pipeline for a fraction of a fraction of the cost of a typical tentpole, the movie delivers just enough to validate the marquee-friendly title. Today, Apocalypse Now is revered as one of the great American films. Mega Shark vs. Giant Octopus floats through streaming libraries and provides the internet with big floppy CG shark memes. But was pulling it off any less of a feat than Coppola’s blood-sweat-and-tears epic?\nSomeone has to treat the Mega Shark vs. Giant Octopuses like their own personal Apocalypse Now, and writer-director Jack Perez was up for such a challenge. His early work in the 1990s, shooting behind-the-scenes documentaries on the sets of Carlito’s Way, The Flintstones, and Hard Target, eventually put him on the radar of Sam Raimi, who hired him to direct Hercules’ backdoor pilot for Xena. By then Perez had directed an indie feature, the found-footage-before-found-footage-was-a-thing horror flick America’s Deadliest Home Video, had stop-motion animation skills in his back pocket, and knew his way around a commercial set. The future was bright enough; Perez spent the ’90s and 2000s bouncing between indie features and gigs-for-hire like Wild Things 2 and MTV’s TV movie Monster Island.\nMega Shark vs. Giant Octopus, which finds a team of oceanographers scrambling to kill two underwater kaiju by luring them into a tentacle-flapping, jaw-snapping fight, was not a passion project. But when Perez signed on, he wanted it to be good — even if the Debbie Gibson-led creature feature was just another cog in The Asylum’s notorious business model. And it seemed to have worked; the movie’s low-rent visual effects and stilted drama mesmerized internet kids, prompting Asylum to produce several Mega Shark sequels. Before the hyper-self-aware gimmicks of Sharknado (also an Asylum joint), there was Perez funneling his monster-movie memories from the 1970s into cheapo popcorn entertainment.\nWhat did it take to get an Asylum movie wrapped and in the can? Out of morbid curiosity, I phoned Perez to talk about the making of Mega Shark vs. Giant Octopus.\n[Ed. note: This interview was edited and condensed for clarity.]\nHow did you wind up making Mega Shark vs. Giant Octopus for The Asylum?\nJack Perez: I’ve always bounced between independent films and more commercial work, depending on what opportunities are presented. The Asylum didn’t used to be a low-budget schlock factory — they were originally a distributor of independent movies, if you can believe it. The people there had distributed my second feature called The Big Empty, which was like a character-driven noir. They knew me from that, so when the company became this mockbuster schlock factory, they were looking for directors who could do stuff on a really tight, Roger Corman-style schedule. So if I was ever really low on money or a gig fell through or whatever, I was happy to jump in and do one of these nutty movies.\nI had been in preparation to do a more personal movie, a bigger budget movie that I had been prepping for a year, and it was ready to go and I was casting and then as it happens, so often in Hollywood, all the financing fell apart. I found myself like, “Oh, shit, how am I going to pay the rent?” So I picked up the phone and called The Asylum and said, “What do you got? I need something for this month.” They said, “Well, can you write and direct a ‘versus’ monster movie in a couple of weeks and shoot in a couple of weeks?” And I was like, “Yes, of course!”\nHow did you land on Mega Shark and Giant Octopus? Where do you start on a movie like this?\nI have a long love of monster movies — the films of Ray Harryhausen, King Kong, and, all the Godzilla movies were things that I was raised on as a kid. So it’s very easy for me to sort of open up that reservoir and reconstitute all those tropes and things that I love into whatever was necessary.\nBut at the time, The Asylum basically had a distribution deal for VHS and DVD. Basically the distributor said, “We need a ‘versus’ monster movie, can you guys do that kind of thing?” They said yes, and basically turned to someone like me to do it. At the time, they just had “Mega shark vs. Giant Squid” on paper — I don’t know if that came from 20,000 Leagues Under the Sea. But then as I was writing it, they were like, “No, it’s an octopus,” which didn’t really change it very much. The whole idea of “Mega versus Giant” is essentially taking Jaws and making it 500 feet tall. Because there was already a subgenre of shark movies in the wake of Jaws — Mako: The Jaws of Death, Tintorera: Killer Shark, Orca, and all that kind of stuff — it was something that was known. And, I didn’t know about this at the time, but there have been documented actual undersea battles between sharks and octopus on occasion!\nSo that’s what I was given. I wound up adopting a pseudonym at the time, even though ultimately it traced back to me, because the company had a penchant for re-editing. They did exactly that in this case. These movies are made very quickly, and when you’re dealing with so many limitations, production-wise, I find that speed, like tempo, is a way of compensating. A very fast-paced movie will hold your interest so that you can’t really scrutinize problems with performance, problems with writing, problems with special effects.\nThe problem with The Asylum is, sometimes they have to meet certain running time lengths, so they re-edit and pad it. So when you watch Mega Shark, my original cut is so much faster and funnier, but they needed it to be like 10 or 15 minutes longer. So the editors went in there and basically opened up the scenes. So you have this preponderance of unnecessary reaction shots and pauses. I can’t believe it still bothers me, but it’s like when somebody tries to extend their book report by double spacing.\nHow did you write toward the low-budget goals of the finished project while also making it fun?\nI had a two-week writing period and then some quick revisions. The stuff needed to be churned out. When you write on that schedule, you basically do the math and say, “How many pages a day do I need to complete it?” If it’s gonna be 100 pages, you have to write at least six or seven pages a day. Crazy.\nThe producers at The Asylum always had this mandate where they said, “This has to be written and directed with absolute seriousness.” In other words, you can’t poke fun at this stuff. Which, to me, was insane. To be dealing with such extreme limitations, you’re not going to fool anybody, so at every turn I tried to add absurdity into the story in terms of what happened, like the shark biting a plane out of the air, or the shark eating the Golden Gate Bridge. I mean I had one character making reference to Julius Caesar in the middle of the movie. I had things that I threw in the hopes that anybody who was half-aware would realize that the filmmakers were very aware that this was ridiculous, as opposed to being The Room or an Ed Wood movie.\nOne of my favorite things is: There’s a scene I wrote where they’re trying to come up with this formula to get the animals to come together to kill each other, some sort of pheromone, and I have this ridiculous little montage where they’re like basically adding food coloring to beakers and water, trying to solve the chemical equation problem. Some actual chemists got ahold of it, and they posted something on YouTube called “doing science” and they just show that scene because it’s the most uninformed idea of chemistry.\nThe one thing is, if you make a movie called Mega Shark vs. Giant Octopus, there really should be way more mega shark fighting giant octopus stuff. I would have preferred that they spent a little bit more money and made another, because I wrote way more fighting stuff than what’s in it. Like, instead of them double-spacing to pad the overall pacing, how about we just do a couple more fight sequences? Because that’s what people would want to see. But that would end up spending money, and nobody wants to do that.\nSo, I just wrote the most extreme stuff that I could. Knowing that the effects were not going to be photorealistic, the concept of the effect was more important to me. They needed to be the idea of the effect — like a shark jumping out of the ocean eating a plane. It wasn’t going to be photorealistic, but at least it would be fun.\nYou shot the movie in 12 days ... how?\nIt’s insane. I don’t wish it on anybody. Funny enough, the schedules have become even shorter.\nI used every trick in the book. I had made three or four features and TV prior to making Mega Shark, so I picked up a few things. You just have to design the hell out of it. You don’t shoot one frame more than you need. You shoot to cut.\nMostly it’s just about solving the problems that were inherent in my own script. In the movie, there’s all this submarine action, but there are no submarine sets flying around. And at least at the time [at The Asylum], there was no construction or production design budget to build a submarine set. So how do you convey a bunch of submarine scenes? I realized one of the stages we were shooting at had a standing sci-fi hallway set à la Alien, because there were 25 million Alien knockoffs in the wake of the original. So we had that kind of classic Ridley Scott futuristic corridor, and it was kind of narrow, which is what a submarine is, so I decided to just rent a periscope. We put everybody in sort of Red October jumpers and headsets, and put the periscope dead center, and we thought: if we used it as a strong sort of foreground, maybe people would forgive that the rest of it is not a submarine at all, but a hallway.\nIs the shoot a blur now, or are there some enjoyable memories that stand out?\nThere’s a scene at the beginning of the movie where they find a sperm whale that’s been bitten to pieces. That comes straight from Jaws 2, which I saw as a kid. So the mega shark would attack the biggest whale in the world.\nTypically, that would be a CGI effect. But I did a foreground miniature as an in-camera effect. We built a foam rubber whale that was about four feet long and set it up in front have the camera. It’s a classic force-perspective gag — you move the people a block away, and you line it up so that it appears that two are interacting with each other. And it’s an in-camera effect. It looks great! It just works every time. That was like me trying to have some fun because I felt so sort of frustrated at all the limitations. I was like, “I’m going to do something like I would have done when I was like a kid making Super 8 movies.” Everybody got a huge kick out of it, because nobody was accustomed to experiencing in-camera practical effects like that.\nThere were rumors that the movie would be converted and released in 3D, which is kind of unimaginable.\nYeah, that was talked about, which is crazy because that technology costs money. You can’t fault them for being ambitious in terms of what they want to do. And 3D hadn’t quite made a huge comeback, so the idea was really exciting. But I think the movie would have probably had to have been made in four days if they shot it in 3D.\nI’ve also been a film professor for 10 years, and I tell my students that if you’re going to make your first film, and you only have a couple thousand dollars, then do yourself a favor and write something that can be fully realized for the budget. If you only have $2,000, you don’t try to make Raiders of the Lost Ark, because it’s just not going to work. But that’s never stopped The Asylum. It’s like, “No, we’ll do Jurassic Park, but we’ll do it for a $1.95.” So you get this weird sort of approximation of something that sort of fits in a DVD sleeve.\nBut The Asylum is just a microcosm of the whole movie business. They know how much money their movie’s going to make. So they don’t want to spend a penny more that’s going to eat into their profit. Even though spending more would yield a better movie, if their primary goal is to make money, then they will sacrifice the quality of the movie and quality effects and the number of days it takes to shoot to ensure that there’s a return. But if you’re a filmmaker, you don’t think in those terms. You’re thinking, “Give me another shot. Give me one more hour, and I can make the movie better.”\nThe chance to make any movie is rare. If you’re one of those people who makes a movie every year, which is the 1%, then you’re probably not going to have the same appreciation. But, generally, it takes a couple of years between movies. So any opportunity, regardless of the limitations or the story, is an opportunity to play. You can either meet that with professionalism or you can meet it like a bitter brat. So I’ve always been real conscious of that, particularly when I only have like 12 days. Let’s try to make this as good as we can.\nMega Shark vs. Giant Octopus is available to stream for free with ads on Peacock, Tubi, and Pluto TV."
    },
    {
      "url": "https://www.polygon.com/horror/460518/red-rooms-director-interview-serial-killer/",
      "text": "Canadian filmmaker Pascal Plante was already dwelling on the eldritch terrors that lurked below the surface of the dark web before the COVID-19 pandemic sent him into lockdown. But by 2021, his self-inflicted misery, combined with sitting at home for long stretches of time, resulted in the screenplay for Red Rooms.\nA brilliant examination of parasocial voyeurism in our current true-crime content vortex, Red Rooms follows Kelly-Anne, a model who can’t look away from a high-profile serial killer case. She attends the trial, glued to every update about the accused from the back row, as lawyers describe his livestreamed murders in gruesome detail. She returns home to Google every imaginable lead, and comes up for air to gamble crypto on online Texas Hold ’em. Occasionally, she books a photo shoot. Where her life — and Plante’s film — goes is unexpected and creepy as hell.\nRed Rooms isn’t an obvious selection for spooky-season viewing, but Plante is in total control as he veers from austere thriller to the kind of horror that would tickle Brian De Palma fans. It shook me to my core. With the film out in theaters and rentable on digital platforms, Polygon spoke to Plante about how he went this dark — and entertaining — without going over the line.\nThis interview has been edited and condensed for clarity.\nPolygon: You’ve been thinking about and working on this one for many years. How does it look to you now with some distance?\nPascal Plante: I’m still happy that it has a conversation with whatever the current times are, because time moves fast, especially in a film that dabbles with technology. I actually had to flirt with sci-fi when I was writing. Let’s say her AI, for instance — it’s weird to say now, but ChatGPT was not around [in 2021]. And so for a technogeek film to be current, you need to think about how people use technology, what will make it relatable, even though maybe some of the things will get dated sooner or later. Everything about this movie technology-wise is going to be dated. But it gets you thinking a lot more about the tools, and human nature, and how humans interact with those tools. And that doesn’t change, really.\nThe movie was born out of the cult-like interest that can convene around murderers. How did you extrapolate that into a thriller that could work as a movie?\nI have a documentarian tendency where I know we’re making fiction and we’re bending truth, and that’s fine. But I value a lot of films that are able to depict niche subcultures in a relatable way, in a way where I’m not just empirically exploiting and stealing from the folklore of a scene in order to make something completely fictional. I would love, in an ideal world, that the people that are knowledgeable about what I’m trying to talk about and distill in an artistic vision, that they can be the one who endorse the film first, in a way.\nYou want serial-killer obsessives to say: “You see me.”\nI know you’re making a joke, but we had one encounter after a Q&A — a woman came up to me and the producer and said that she’s herself a fan of killers, and she devotes so many hours a day to them, and all that. I’m actually glad this happened, because it shows that I’m not overly judgmental about the characters. I’m trying to study the phenomenon, and the phenomenon is rooted in society. These behaviors are allowed and enabled by something macroscopic. That is what I’m trying to get across.\nI’m not trying to say that this is a crazy woman and she’s evil and all that. It’s way more than that. So just the fact that that person was comfortable enough to come and talk to us meant a lot. It just meant that I try to make valuable art that can engage in topical and harsh conversations. But no, I was more talking about people on the dark web who hang out on the internet. I wanted people permanently online to watch the film and be like, “Oh, [she’s] one of us.”\nIt sounds like you did a great deal of research around the topics of serial killers and the dark web experience, but how did that cohere into the film? When and where does imagination fit in?\nIt has to become a movie at one point, because research can only get you so far. I’m not doing a PhD. I’m not devoting my life to it. I’m devoting, like, a three-year cycle of my life. That was my obsession in that time frame. And at one point, yeah, I had to let the research go and start writing. The imagination has to take over. And it was much more of a safe space than the research part, because the research was rooted in something so grim and so depressing.\nDoing a genre film for a filmmaker in 2024 is actually amazing, because genre-film fans are very audacious. They want singular movies. They want films that challenge them. But that’s very fun when you know that there’s potentially an audience down the line who are willing to accept all the oddities of your creation, of your work. This pushes you to go bigger, bolder, more colorful, more expressionistic, go wild with music, go wild with sound design.\nThis is when it becomes a movie. The film has kind of four stages of aesthetics: It starts almost super robotic, almost like VR, almost like a computer is in charge of the camerawork, because we’re in the head of that character. […] Then it doubles more into a paranoid thriller, when she’s being seen a bit more, and she feels like she’s being seen. And we finish all the way in giallo, like with crazy filters and crazy colors, because now she’s completely over, across the mirror. She’s in her fantasy.\nRed Rooms centers on a horrific series of murders, but we barely see any of it. This is not a gory movie. It is a gory-sounding movie, between dialogue and off-screen videos. How far did you want to go with it?\nThat’s also tied to the way I researched the film, because I always tiptoed around the subject matter — I didn’t want to see anything. I didn’t want to go too deep in it. So I always had third parties telling me, like police reports or lawyers. So there’s this distance.\nAnd yet, whenever you deal with something that is so striking to the imagination, your imagination goes wild. And so by tiptoeing around so many things, I kept just having my imagination go nuts and creating those images. So I tried to get that core idea into the finished film, which of course could appeal to all the senses. I felt like if you shut down one sense, then the others get hyperactive. We fill in the blanks and we dialogue with the film with our imagination.\nI kind of fell down the rabbit hole of YouTube, like creepypastas, and I’m used to watching horror films. Whenever I watch a horror film, the comfort zone is easy for me. I know the codes more. It’s very rare that a horror film gets me super anguished. But some creepypastas did, and some of them were very good storytellers. I felt I was onto something. I was going to draw back from the century-old tradition of campfire gloomy stories that just get you in a weird mood. And that’s how the film will function — it’s just going to put you in a weird mood, not necessarily by being extremely graphic, but graphic orally, just the details, the attention to just the storytelling, the slow burn, so it ends up being disturbing in its own right.\nAnd even the snuff-movie scene in the film, you don’t see, but you hear — it’s terrible. I’m not going easy on you. I’m going hard on you.\nThe guy you got to play Chevalier, the accused killer on trial, plays perfectly into that. Maxwell McCabe-Lokos is silent the entire time, but absolutely terrifying.\nI know! Especially since the film is around him, but he’s not a subject character. He’s an object character in the sense that he’s being looked at. So I was actually shy to even engage with and approach some actors. I had wild ideas, because he’s a non-speaking role, so he could be anyone — he could be a musician, he could be someone from the States, he could be someone from Europe. Anybody could be the killer. So it really got me thinking about what I wanted. I wanted someone who had charisma, but, to a certain extent, not a Zac Efron type. I’ve been very aware about the criticisms about so many true-crime films casting very good-looking, charismatic actors, or on the other side, having someone who is too “monstrous.” I wanted someone in between.\nThe in-between ended up being banal. But there was something specific I was looking for, which was the eyes. I wanted someone who had eyes that kind of looked like Peter Lorre, kind of big, blue, expressive eyes. And so Max — my producer, Dominique Dussault, knew him, because he’s a Canadian indie filmmaker doing very interesting stuff. He’s an actor as well. He understands the artistic process. I was almost too shy to ask him, like, “Oh, Max, yeah, there’s this role in the screenplay, it’s nothing much…”\nBut then the first meeting, he said, “Yeah, OK, but it’s almost like there’s a microscope on my face at all times? So basically, if I rub my hands or if I cough, people go nuts?” And I said, “Yeah!” So he right away understood the challenge, which is that every single thing he does generates meaning, he is scrutinized by the camera, the characters. And so it’s actually pretty physical. He took it as an actor’s challenge, which I underestimated. And he understood it right away.\nThe anchor of the film is Juliette Gariépy, who was more of a model before doing the movie. How did you land on her to play Kelly-Anne, who is also a model?\nI guess to narrow it down to one thing, it’s sheer magnetism. The only way this film functions is if you as an audience look at her the way she looks at the killer. So you have to be like, OK, there’s some danger lurking below, but you’re not quite sure what it is. But you can't look away. She has that sense of danger, but in a very photogenic and magnetic way.\nThere’s more than that. It’s obviously a big role to do. It’s very physical. She learned to play squash. She learned about cryptocurrency. She learned about so many things. I had her watch films, listen to playlists of music that I curated for her. It’s a proper role. And not only that, but Juliette is very different than her character. She’s very bubbly, very funny, very expressive. But there’s something about her eyes… the craziness, like Klaus Kinski eyes. You’re just like, Oh my God.\nThere’s quite a bit of difference between people who seek out snuff films on the dark web and viewers who love gory horror movies. But do you hope the film rattles people who are into dark stuff? Did it rattle you in terms of an appetite for violence in movies?\nI think there are two things going on here. I find it way easier to watch a naïve, exploitative, sometimes gory and tense movie. I can watch Cannibal Holocaust. I can watch Hostel. But cruel films, I have a harder time — though sometimes there’s a fine line. There are filmmakers that create characters to crush them and dominate them. A good [Lars] von Trier was not like that, but the bad von Trier, they’re unwatchable to me. The guy is too sadistic. He’s too nihilistic. It’s no fun in it at all.\nHaving a head chopped off in a Tarantino movie with blood spurting is vastly different than psychological torment in a film. So there’s a line, but I think the line is: It has to boil down to the filmmaker’s view of the world. Are they just saying that everything sucks and that we’re all going to die? Or is there something else? Is there a bit of light? And even though I just did, of course, a dark film, I try to have the characters have some kind of redemption. There is light at the end of this very dark tunnel, which is important, if only to get going to our daily lives. I don’t crave happy endings, but give me some air!"
    },
    {
      "url": "https://www.polygon.com/23591677/found-footage-horror-dead-replaced-screenlife-immersive/",
      "text": "By the early 2010s, it seemed like the only way to make any kind of successful horror movie was to frame it as a found-footage film. A mode of storytelling relaunched in 1999 by The Blair Witch Project and carried on by Paranormal Activity and its followers, the technique was all about simulating the idea that a given movie wasn’t professionally filmed, but had somehow captured real events. It was designed to look and feel like mundane footage shot by ordinary people, eventually escalating into something terrifying.\nOn paper, this approach could make horror features more intense for audience members by making a film feel more immersive or believable, like something ripped from reality. Arguably more important for the bigwigs in Hollywood, found-footage movies’ rough visuals and rip-and-grip production made them cheaper to produce than normal horror fare. But what’s rampant one day in the moviegoing scene tends to become scarce the next. The traditional found-footage horror movie has mostly died off over the last decade, even as core tenets of the genre have endured in other kinds of scary storytelling.\nThe original incarnation of found-footage horror cinema could’ve lasted longer if it weren’t for that fatal flaw of burnout. Much as with the onslaught of hastily assembled digital 3D features after Avatar’s success in 2009, every studio in Hollywood began to release found-footage movies in the 2000s in the hopes of striking it rich at the box office with the next Blair Witch Project. Since these titles were so cheap to make, they could be hastily assembled by the most ramshackle of operations. Even the always cash-strapped Weinstein Company was able to churn out Apollo 18 in 2011.\nWith so many found-footage horror movies in the ecosystem, the subgenre’s cliches became glaringly apparent to moviegoers. The relentless shaky-cam work began to register as nauseating, and as a pro forma element rather than a unique detail of the cinematography. Titles like The Gallows struggled to concoct clever reasons why characters kept filming the events around them, even during chaotic, scary mayhem. This kind of lazy writing, inspiring incessant “Why don’t they put the camera down?!” jokes on the internet, quickly drowned out any potential excitement for new found-footage titles.\nIt didn’t help that found-footage movies struggled with a “live by the sword, die by the sword” problem. The excitement of using comparatively new filmmaking technology, like high-end portable digital cameras, to drive the plots of movies like Cloverfield lent these projects a sense of realism and made them relatable. The characters on screen were using tools familiar to average moviegoers. As technology became more and more integral to the lives of everyday people, it seemed like found-footage horror movies were uniquely situated to register as relevant to the global cinematic landscape.\nNowhere was found-footage horror fare’s capacity to be blisteringly current more apparent than in The Blair Witch Project. Daniel Myrick and Eduardo Sánchez’s film emerged from a decade of cinema where aspiring filmmakers were trying to use minimal financial means to make the next Clerks or El Mariachi. Capturing a trio of amateur filmmakers through their own cameras as they descend into dark madness was a perfect way to make a horror movie frighteningly relevant to 1990s pop culture. No other style of visual horror could quite crystallize that element like found-footage cinema.\nBut the later entries in this genre stopped feeling artistically novel or technologically relevant. Specifically, many of them felt behind the times in terms of how in-universe characters were recording spooky occurrences. As late as 2015, titles like Project Almanac were still centered on young characters walking around with big video cameras, but that just wasn’t how people recorded everyday footage anymore. In the age of the smartphone and Zoom calls, the concept of younger people using professional cameras to capture unusual events felt laughably old-school.\nThe ever-expanding treasure trove of information on the internet also kept found-footage creators from convincingly swaying moviegoers into believing that what they were watching was “real.” Back in 1999, The Blair Witch Project hinged its entire marketing campaign on pretending that the three young people featured in the film were actually missing, and that the film provided clues about their disappearance. This promotional concept, sustained for months in the late 1990s, would be debunked within a few hours on Twitter today. Rampant cynicism and easy access to tools like Wikipedia have ensured that a core appeal of early found-footage horror movies can no longer exist in 2023.\nBut that doesn’t mean everything about this style of filmmaking is dead. Certain tenets of the found-footage genre have evolved with the times into the screenlife subgenre. Films like Unfriended, Profile, Searching, and Missing take place entirely on computer screens. The characters are still being filmed by amateur means while facing intense scenarios, but now it’s through screen capture. There’s also a more incidental nature to how characters’ actions are recorded, with protagonists often unaware they’re being filmed.\nOther horror movies are capturing the raw, immersive feeling of found-footage movies in different ways. The recent horror phenomenon Skinamarink depicts its inexplicable suburban frights through cinematography evoking old, grainy home videos. Director Kyle Edward Ball designed Skinamarink to look like something you’d find on a blank VHS tape in a garage-sale bin. This keeps the film rooted in the hallmark of vintage found-footage fare of depicting something chilling hiding in plain sight, only perceivable through the lens of an ordinary camera.\nSkinamarink, unlike its found-footage predecessors, never pretends that a discernible in-universe character is holding the camera. Most spiritual successors to the likes of Paranormal Activity have avoided the pretense that audiences are watching “real” people. Searching and Missing are anchored by recognizable actors John Cho and Storm Reid, respectively. And the opening credits of We’re All Going to the World’s Fair — an earlier grainy, immersive horror movie that captures the same voyeuristic vibe as Skinamarink — introduces lead performer Anna Cobb as making “her feature film debut.” Though Fair tells its story largely through self-playing YouTube playlists and Skype calls, it still creates a discernible barrier between reality and its frightening story.\nClassic found-footage movies usually explain the presence of a camera by having someone controlling it (like T.J. Miller’s character Hud in Cloverfield) or making it clear to the viewer that the camera is fixed to a tripod or a similar object (like the original Paranormal Activity movies). The new horror movies following in their wake aren’t meant to be “real” pieces of footage. That gives directors more flexibility around what the audience sees. Missing, for instance, flips across time to show the desktop activity of both its protagonist and her mother. We’re All Going to the World’s Fair cuts between eerie videos being watched by tormented teen Casey (Cobb) and concerned adult JLB (Michael J. Rogers).\nSkinamarink goes the furthest with this deviation by framing many of its shots in such an aloof manner that moviegoers can’t even see the faces of the two young protagonists. While certain shots place viewers directly into a character’s point of view, most of the time, Skinamarink is capturing staples of a suburban home (toys on the floor, the basement, the living room) from angles and vantage points as unusual as the events that have befallen its central characters.\nJust the positioning of the camera is designed to make viewers uneasy because of the dissonance between the unorthodox camera angles and the grainy look evoking familiar home movies. These evocative choices in Skinamarink’s camerawork would be impossible to realize if the movie kept the camera permanently locked in a character’s hands.\nNo movie genre ever really stays dead, not as long as throwbacks, revivals, and movies inspired by the past are still being made. That’s just as true for found-footage horror movies as it is for musicals and Westerns. (Look at the recent found-footage movie The Outwaters for proof.) But the original incarnation of this genre, the boom that dominated the early 2010s, is basically defunct. Found-footage horror has evolved into more visually flexible fare that captures the same dynamic in new ways. It’s glaringly apparent what killed the trend, but it’s just as obvious that key facets of the genre are continuing to captivate and frighten moviegoers today. They’re just popping out of the shadows in very different ways."
    },
    {
      "url": "https://www.polygon.com/movies/612199/parasite-director-bong-joon-ho-favorite-steven-spielberg-movie-tom-cruise/",
      "text": "The New York Times recently published the results of a poll determining the 100 best movies of the 21st century so far, and the #1 slot went to Bong Joon Ho’s Best Picture winner Parasite. (It topped the paper’s subsequent readers’ poll, too.) As it happens, Bong Joon Ho also voted in the poll, and the Times made his ballot (along with many others) available online. He lists the 2005 Steven Spielberg/Tom Cruise movie War of the Worlds among his 10 choices, which makes that movie his selection for the best Steven Spielberg movie of the past 25 years. It’s a bold choice. But he may be right. At very least, War of the Worlds deserves to be talked about alongside classics like Jaws and Jurassic Park.\nThe Spielberg movie that actually made the overall top 100 list was his other (also excellent) Tom Cruise-led sci-fi film, Minority Report, at number 94. War of the Worlds, which recently celebrated its 20th anniversary, was a bigger but more divisive hit back in 2005, though it was overshadowed by Cruise’s talk-show antics and Scientology-stumping. In fact, it wound up as Cruise’s last big money-maker until he revived interest in the Mission: Impossible franchise six years later.\nThe Cruise factor is part of why War of the Worlds might seem like a counterintuitive choice for Bong’s favorite Spielberg movie. The South Korean director obviously enjoys dark-hued genre films, and he made his own movie where a family encounters a fantastical creature: The Host, released just a year after War of the Worlds. But that movie’s tone is vastly different from Spielberg’s, veering into comedy and satire to complement its heartfelt drama.\nMoreover, like Parasite, it uses a family ensemble to offer different point-of-view characters. Spielberg’s WotW, by contrast, is both vastly bigger and strikingly smaller. It’s one of the most intimate large-scale disaster movies ever mounted, chronicling no less than a massacre of the global human population by invading aliens, while sticking almost exclusively to the ground-level point-of-view of Ray (Tom Cruise), a super-divorced New Jersey dock worker, and his 10-year-old daughter Rachel (Dakota Fanning). Ray’s teenage son Robbie (Justin Chatwin) is there, too, if only to wriggle away from Ray whenever possible.\nThe trio of characters initially navigating this alien-ravaged landscape vaguely recalls the three men venturing into the ocean in Jaws, and the boy-girl siblings bring to mind the kids in Jurassic Park. War of the Worlds does indeed scan as the third film in a trilogy of creature features that most closely resemble Spielberg horror movies. Its way into that material, though, is arguably stranger than either of its companions. It uses the framework of a genre most popular in the respective decades of Jaws and Jurassic Park: the disaster movie.\nThough the 9/11 terrorist attacks on America didn’t put a total kibosh on the neo-disaster wave of the 1990s, they did push those types of movies toward an increasingly fantastical approach to mass destruction on screen. Though a few filmmakers like Man of Steel’s Zack Snyder did lean into a more harrowing sense of realism, later-period Roland Emmerich movies like The Day After Tomorrow and 2012 didn’t seem designed to remind people of 9/11. Their disaster-scapes were so outsized (and neutrally produced by Earth itself, rather than invaders) that they almost looked like simulations, or apocalyptic screensavers.\nSpielberg’s War of the Worlds has plenty of outlandish, retro sci-fi imagery: Certain elements of the original H.G. Wells novel from 1898, like the aliens’ tripod ships, are faithfully included, and when the ships start fertilizing their own vegetation with human viscera, the wide landscape shots look like a vivid, super-saturated set out of a 1950s melodrama.\nBut beyond the base-level awe these sequences inspire compared to Emmerich’s SimCity destruction, the then-contemporary 9/11 references are unmistakable (and darker than the superficial building-smashing of superhero movies): After witnessing an initial attack, Ray realizes he’s covered in the dust of incinerated people. Later, a terrified Rachel makes it explicit; as they speed away from the mass devastation in a stolen car, she asks in panic, “Is it the terrorists?”\nIn its way, this directness is as vivid as the kid dialogue in E.T., like the faux-teenage way Elliott calls his brother “penis breath” in anger. Before Spielberg made a more intimate movie about real-life terrorism with Munich (which also came out in 2005), he brought the chaos and fear of terrorism into summer movies that were supposed to provide escapism. His gift for moving the audience through the action with fluid, longer shots takes on a frightening immediacy.\nThough his two Jurassic Park movies are full of suspenseful sequences (and The Lost World is especially violent), War of the Worlds might be Spielberg’s most traditionally scary genre movie. (His depictions of war atrocities in movies like Schindler’s List and Saving Private Ryan are in another category altogether.) It’s not just the scale of the destruction, but its pitilessness; these aliens aren’t going through a list of symbolically powerful landmarks to blow up in perfectly framed wide shots. They’re open-firing into crowds and buildings, then eventually sweeping the corners to harvest human blood.\nFrom a business perspective, it made sense to release War of the Worlds in what was essentially the Independence Day spot. The movie itself, though, where most of the anti-alien heroics are accidental or off-screen, and all-American Tom Cruise is a semi-deadbeat dad who survives mostly by luck, feels like an ID4 takedown as accidentally pointed as Tim Burton’s Mars Attacks! (There’s even a more gruesome equivalent of Burton’s darkly funny image of a herd of cows on fire when an Amtrak train zips past refugees, engulfed in flames.)\nThe fantastical touches aren’t the only scary parts, either. Rewatching a mob of people senselessly attempt to steal Ray’s car and nearly destroy it, endangering Rachel in the process, I had two simultaneous thoughts: 1) This behavior makes no sense, and 2) this is also exactly what would happen in real life. War of the Worlds feels so emotionally realistic that it’s no wonder Spielberg can’t quite find the precise note to end on, beyond a thematically appropriate but vaguely unsatisfying reversion to the basic outline of the Wells novel. (At least in terms of the aliens’ fates.) It’s a beautifully made movie that can’t offer the same reassurances as other Spielberg sci-fi; Ray’s lessons about parenthood come with a crash course in its horrors, too.\nSo what does Bong see in this Spielberg movie in particular? Many of his movies invert War of the Worlds’ arc of harrowing horror to unsettled respite by providing a wilder, often more “fun” ride before arriving at a tragic end. (Though sometimes those tragedies are still laced with a hint of hope.) But Bong’s films also gleefully mix genres in ways that feel informed by what’s happening in the real world. In the same way, there is something genre-warped about the Spielberg film that depicts post-9/11 anxiety by peeling back layers of disaster-movie blockbusters, 1950s sci-fi, and outright horror, right down to how it handles its most Spielbergian-seeming human relationships. There’s nothing especially predictable about War of the Worlds. It unfolds with the terrifying clarity of a nightmare.\nWar of the Worlds is currently streaming on Paramount Plus."
    },
    {
      "url": "https://www.polygon.com/2023/10/13/23914582/unfriended-watch-netflix-horror-movie-screenlife-best-halloween/",
      "text": "[Ed. note: If you are reading this after Oct. 15, Unfriended is no longer on Netflix. But good news, movie watcher with good taste! It is now on the Criterion Channel, and available on VOD.]\nCinema’s screenlife subgenre, where the events of a movie largely take place online, and the story plays out on a computer, tablet, or smartphone screen, has become an emerging method to depict the unique anxieties of modern life. The format — something of a descendent of and replacement for the found-footage fad — is especially well-suited to thrillers and horror stories, as seen in 2023’s great mystery Missing, a follow-up to 2018’s Searching.\nWhile screenlife fiction really started at the turn of the century (the 2000 Franco-Belgian film Thomas in Love is generally considered the first screenlife feature), it was the 2014 horror hit Unfriended (produced by Night Watch and Wanted director Timur Bekmambetov, who coined the term “screenlife”) that really brought this style of filmmaking into the mainstream. It was a great test case: This movie rules. It’s been on Netflix for a while now, but its last day on the platform is Monday, Oct. 16, and you should absolutely watch it this spooky season.\nIn Unfriended, a group of high-school friends catch up via Skype. One of their fellow students recently took her own life after being bullied at school, and their call is interrupted by a mysterious persona implying that the friends had a hand in her death. This invader threatens them and holds them hostage on the call — until they start dropping off one by one, with some horrifying imagery.\nUnfriended is a tense movie that makes great use of the screenlife gimmick, keeping viewers firmly within the boundaries of a MacBook owned by protagonist Blaire (Shelley Hennig, Teen Wolf). The movie deftly uses familiar modern visual and audio cues: Mouse cursors blink expectantly. Users type out initial responses to events, delete them, and retype more tactful or cautious messages before finally sending them. And notification pop-ups and familiar app interfaces help immerse the audience in the movie’s world, and draw attention to different parts of the screen. The game cast also includes future Polygon favorites Moses Storm (Players) and Jacob Wysocki (arguably the funniest recurring star of the Dropout universe).\nThere’s also a 2018 sequel to Unfriended, Unfriended: Dark Web. That one is also very good, and it sheds the original movie’s supernatural trappings in favor of a more grounded mystery. If you’re interested, that one’s streaming on FreeVee.\nThis is your last weekend to watch Unfriended on Netflix — but don’t watch it on your TV. That’d be letting yourself off easy. Instead, watch the movie on a laptop or tablet to more fully immerse yourself in its drama and horror. I watched it for the first time on a laptop in a coffee shop, and I could not possibly recommend that experience more highly. You will never look at your laptop — or a Skype call — the same way again."
    }
  ],
  "argos_summary": "The 2025 adaptation of War of the Worlds, released on Amazon Prime Video, is criticized for its low quality and poor execution, earning a 0% rating on Rotten Tomatoes. The film, which takes place entirely on a computer screen, features Ice Cube as a surveillance technician caught in an alien invasion while dealing with family issues, but fails to deliver a coherent narrative or engaging performances. Despite attempts to modernize the story within the screenlife genre, the film is deemed a misfire, lacking the depth and impact of previous adaptations.",
  "argos_id": "F2L0NKO19"
}