{
  "url": "https://www.usatoday.com/story/nletter/2025/08/06/trump-threatens-pharmaceutical-tariffs/85538533007/",
  "authorsByline": "Daniel de Visé",
  "articleId": "c515aa6d4aa8459a85e315de16420761",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/06/USAT/85538787007-2214163062.jpg?crop=8201,4614,x0,y820&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-06T13:33:26+00:00",
  "addDate": "2025-08-06T13:52:18.826695+00:00",
  "refreshDate": "2025-08-06T13:52:18.826697+00:00",
  "score": 1.0,
  "title": "The Daily Money: Trump threatens pharmaceutical tariffs",
  "description": "Also: Back-to-school sales await",
  "content": "President Donald Trump now threatens to levy tariffs of up to 250% on pharmaceuticals imported into the United States.\n\nThe president told CNBC on Tuesday that he plans to announce new import taxes \"within the next week or so\" on pharmaceuticals and semiconductors.\n\nWhat will that mean for drug prices?\n\nThe kids aren't ready to hear about going back to school, but sales tax holidays in many states can help parents save on their back-to-school shopping.\n\nThat's particularly important this year, Betty Lin-Fisher reports, as shoppers say they are more stressed about tariffs and economic uncertainty.\n\nSeventeen states have sales-tax holidays. Here are the details.\n• Private equity is coming to your 401(k)\n• How to safely evacuate an airplane\n• Maxing out a 401(k) can be a bad thing\n\nFinally, here's a popular story from earlier this year you may have missed. Read it! Share it!\n\nAn inheritance often is seen as a financial windfall, but there are times when people may want to consider waving it off.\n\nReceiving a sizable gift can have unintended consequences that may upend your financial situation or cause friction between family members. If either is the case, consider refusing it, experts said. It may not be worth your time, money, or emotions.\n\nEach weekday, The Daily Money delivers the best consumer and financial news from USA TODAY, breaking down complex events, providing the TLDR version, and explaining how everything from Fed rate changes to bankruptcies impacts you.",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/money/2025/08/05/how-to-talk-your-team-about-ai/85403931007/",
    "https://www.usatoday.com/story/money/personalfinance/2025/06/27/how-disclaim-inheritance-why/84330310007/",
    "https://www.usatoday.com/story/money/2025/08/04/tj-maxx-new-stores-august/85510364007/",
    "https://www.usatoday.com/news/politics/donald-trump/",
    "https://www.usatoday.com/story/money/2025/08/05/trump-drug-pharmaceutical-tariffs/85524821007/",
    "https://www.usatoday.com/story/money/personalfinance/retirement/2025/08/01/maxing-out-your-401k/84407374007/",
    "https://www.usatoday.com/story/travel/airline-news/2025/08/05/airplane-evacuation-safety-study/85522590007/",
    "https://profile.usatoday.com/newsletters/the-daily-money/",
    "https://www.usatoday.com/story/money/2025/08/05/2025-sales-tax-holiday-back-to-school/85528078007/",
    "https://www.usatoday.com/story/money/2025/08/05/private-equity-401k-retirement-risk-stocks/85528941007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "sales tax holidays",
      "weight": 0.08173954
    },
    {
      "name": "pharmaceutical tariffs",
      "weight": 0.07393179
    },
    {
      "name": "new import taxes",
      "weight": 0.07298116
    },
    {
      "name": "Fed rate changes",
      "weight": 0.07280194
    },
    {
      "name": "tariffs",
      "weight": 0.07002612
    },
    {
      "name": "President Donald Trump",
      "weight": 0.06621811
    },
    {
      "name": "many states",
      "weight": 0.06424451
    },
    {
      "name": "Donald Trump",
      "weight": 0.06361141
    },
    {
      "name": "complex events",
      "weight": 0.063152954
    },
    {
      "name": "unintended consequences",
      "weight": 0.06278247
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.95361328125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9248046875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.8203125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.6572265625
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.314208984375
    }
  ],
  "sentiment": {
    "positive": 0.07232666,
    "negative": 0.6225586,
    "neutral": 0.30541992
  },
  "summary": "President Donald Trump has threatened to impose tariffs of up to 250% on pharmaceuticals imported into the United States. This could impact drug prices. Sales tax holidays in many states can help parents save on back-to-school shopping due to increased economic uncertainty and tariffs. An inheritance can have unintended consequences, potentially causing financial strife or causing family friction.",
  "shortSummary": "President Donald Trump threatens to levy tariffs of up to 250% on pharmaceuticals, impacting prices and raising concerns about financial consequences.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "992d699ea6bb4ceb920da190262537fe",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/money/2025/08/04/tj-maxx-new-stores-august/85510364007/",
      "text": "TJ Maxx opening 6 new stores this August. See locations, opening dates.\nA new T.J. Maxx store might be opening near you.\nThe retail chain is opening six stores across four states and the District of Columbia in August, according to its website. The newest batch of openings come after Ernie Herrman, CEO of T.J. Maxx's parent company TJX, announced in May 2024 a goal of opening at least 1,300 additional locations globally across the TJX portfolio of stores.\nTJX, which also oversees Marshalls, HomeGoods, Sierra and HomeSense stores, touts itself as an \"off-price retailer of apparel and home fashions.\" According to its website, the company was founded in 1976 and operates stores in nine countries across three continents. The company said in its first quarter earnings report it owned and operated 1,338 T.J. Maxx locations.\nHere’s what to know about this month’s T.J. Maxx openings.\nWhich states are getting new T.J. Maxx locations?\nNew stores are scheduled to open at the following locations on the following dates, according to the retailer's website:\n- Aug. 10: 9850 Brook Road, Glen Allen, Virginia\n- Aug. 21: 215 East Main St., Clinton, Connecticut\n- Aug. 24: 1233 North Lake Drive, Suite E, Saratoga Springs, Utah\n- Aug. 24: 945 North main Street, Suite F, Tooele, Utah\n- Aug. 24: 446 18th Street West, Dickinson, North Dakota\n- Aug. 28: 5300-B Wisconsin Ave NW, District of Columbia\nWhat does T.J. Maxx sell?\nThe retailer sells items across multiple categories, including clothes, home and beauty. Customers can also find items such as Halloween decor and pet toys at T.J. Maxx stores.\nItems in the beauty category include perfumes, makeup, handbags, jewlery and luggage, and the retailer's clothing offering includes items for kids and babies.\nT.J. Maxx began letting customers shop online in 2013. Customers can see the company's full offerings at Tjmaxx.com.\nGabe Hauari is a national trending news reporter at USA TODAY. You can follow him on X @GabeHauari or email him at Gdhauari@gannett.com."
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/08/05/private-equity-401k-retirement-risk-stocks/85528941007/",
      "text": "Private equity is coming to your 401(k). Are the rewards worth the risk?\nIn the past, the private equity world has been largely populated by ultra-rich investors, endowments and pension funds. That may be about to change.\nRetirement savers with 401(k) accounts are gaining access to the private investment market, which mostly pivots on privately held companies, rather than public ones.\nBlackRock, the world’s largest asset manager, announced in June that it will offer a 401(k) target-date retirement fund that includes private investments, with a launch date in 2026. Another retirement giant, Empower, said in May that it will offer private investments in some workplace accounts later this year. Other retirement plan providers have made similar moves.\nAnd the Trump Administration is expected to sign an executive order soon that would call for federal guidance on adding private investments to 401(k) plans, a move first reported in the Wall Street Journal.\nFirms that invest in private assets are pushing to gain access to 401(k)s and other “defined-contribution” workplace retirement plans, a $12 trillion market.\nPrivate equity firms raise money to buy, manage and sell companies for profit. Investors are typically very wealthy individuals or institutions. The private credit marketplace loans money to companies or individuals outside the banking and fixed-income industries.\nRegular retirement savers haven’t had much access to private investments in the past. The minimum investment in a private equity fund might be in the millions, or at least the hundreds of thousands, according to Investopedia. Your money might be tied up for years.\nHere's why wealthy investors like private equity\nBut there’s a reason wealthy investors and endowment managers like private equity funds.\nIn recent decades, “They actually have done better than the stock market by 1 to 2 percentage points,” said Robert Brokamp, a senior adviser at The Motley Fool.\nPrivate equity yielded average annual returns of 10.5% from 2000 through 2020, Investopedia reports. Other estimates range higher. Private equity is considered a high-risk, high-return alternative to the stock market, which, of course, carries its own risks.\n“Why do wealthy people like it? Because it has the highest upside,” said Keith Singer, a certified financial planner in Boca Raton, Florida.\nAlong with the upside comes a steep downside.\nPrivate companies face fewer regulations and reporting requirements than public ones. It can be hard to divine how much money a private company earns.\n“These are private companies, and with that comes less transparency,” Brokamp said. “That’s part of the reason people stay private: They don’t want to do all the regulatory filings that come with going public.”\nThe number of public companies has dropped “by about half” since the mid-1990s, Brokamp said. Private companies tend to stay private longer and do public stock offerings later.\nStocks are risky. Private equity can be riskier.\nStocks carry risk, but a retirement saver who puts money in an S&P 500 index fund is “investing in some pretty well-established companies,” Brokamp said.\nPrivate equity, by contrast, often involves companies in distress. Bankruptcies run higher.\n“Private equity is riskier than public equity,” said Caleb Silver, editor in chief of Investopedia. “It’s more speculative in nature because you are investing in companies that, in some cases, have no proven track record.”\nGiven the risk, Silver suggests an everyday retirement saver should not invest “more than 10% of your portfolio” in private investments: “It’s simply too risky.”\nSome of the emerging 401(k) offerings seem tailored to manage that risk. BlackRock, for example, plans to offer private investments within a broader target-date retirement fund.\nTarget-date funds generally offer a mix of stocks, bonds and other investments, with the mix growing more conservative as you approach retirement. The new BlackRock fund would allocate only 5% to 20% of its holdings to private investments, with the quotient dropping as you age.\nPrivate equity tends to be illiquid: Investors generally see their money tied up for months or years. In a 401(k), by contrast, you can typically buy or sell investments daily.\nThat should be less of a concern, though, when private equity sits in a target-date fund, which includes publicly traded investments that can be sold if an investor wants out.\nIn 2020, the Trump Administration issued an “Information Letter” instructing that 401(k)-type retirement plans could invest in private equity without violating federal regulations. The law requires 401(k) managers to act in the best interest of investors, protecting them from large losses and excessive fees.\nIs private equity too risky for retirement savers?\nSome observers fear, however, that the risks of private investment may be too steep for everyday retirement savers.\nIn June, Sen. Elizabeth Warren (D-Massachusetts) penned a letter to the CEO of Empower about its plan to offer private investments in 401(k) accounts.\n“Given the sector’s weak investor protections, its lack of transparency, expensive management fees, and unsubstantiated claims of high returns, we are seeking information on how your company will ensure the safety of the billions of dollars of retirement savings it safeguards as it implements this program,” Warren wrote.\nEmpower responded, in essence, that retirement savers deserve a crack at the lucrative private investment market, after decades of exclusion.\n“Empower believes in the democratization of private investing,” wrote Edmund F. Murphy III, the Empower CEO.\nEven so, leaders of the 401(k) industry will “feel more comfortable” about private investments if Congress approves legislation that explicitly allows it, said Thomas Gahan, managing director of Procyon Partners, a financial advisory firm in Shelton, Connecticut.\nGahan predicts more 401(k) providers will offer private investments as an option in the target-date funds, as BlackRock plans to do. “I think it’s a stepping stone,” he said.\nThe 401k industry may eventually allow any retirement saver to invest in funds made up entirely of private investments, Gahan said, but probably not without legislation that explicitly permits the investments – or an executive order from Trump.\n“This will happen over time,” he said, “not overnight.”"
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/08/05/trump-drug-pharmaceutical-tariffs/85524821007/",
      "text": "Trump plans drug tariffs of up to 250%\nPresident Donald Trump threatened to levy tariffs of up to 250% on pharmaceuticals imported into the United States.\nThe president told CNBC on Aug. 5 that he plans to announce new tariffs \"within the next week or so\" on imports of pharmaceutical and semiconductor imports.\nHe said he plans to launch a smaller tariff on drug imports before increasing the duties over 12 to 18 months to a maximum amount.\nTrump would start with an \"initially small tariff on pharmaceuticals,\" he said. \"But in one year, one-and-a-half years maximum, it's going to go to 150%, and then it's going to go to 250%, because we want pharmaceuticals made in our country.\"\nHe said other nations \"make a fortune\" on pharmaceuticals, citing drugs imported from China and Ireland.\nTrump has said several times in recent months that there could be trade actions for the pharmaceutical industry, which has globalized since the 1990s with a drug supply chain that stretches from Europe to China and India.\nIn July, Trump said his administration planned pharmaceutical-specific tariffs of up to 200%, though drug companies would have time to establish U.S.-based drug manufacturing.\nIn April, Trump said he planned to impose tariffs on pharmaceuticals made overseas, a move he said would prompt drug companies to move their operations to the U.S.\nOn July 31, Trump sent letters to 17 drug companies urging them to lower U.S. drug prices by Sept. 29 to \"most favored nation\" amounts paid by other nations.\nIn the letters, Trump urged drug companies to adopt such pricing on drug for Medicaid, the federal-state health insurance program for low-income residents.\nHe also requested drug companies lower U.S. prices to the same levels charged in Europe and elsewhere for newly-launched drugs for people on Medicare, Medicaid and private insurance plans.\nTrump also urged drug companies to lower pharmaceutical prices for U.S. consumers and businesses that directly purchase from drug companies.\n\"Make no mistake: a collaborative effort towards achieving global pricing parity would be the most effective path for companies, the government and American patients,\" Trump said in the letters. \"But if you refuse to step up, we will deploy every tool in our arsenal to protect American families from continued abusive drug pricing practices.\""
    },
    {
      "url": "https://www.usatoday.com/story/money/personalfinance/2025/06/27/how-disclaim-inheritance-why/84330310007/",
      "text": "Got a big inheritance coming your way? You may want to just say no. Here's why.\nAn inheritance often is seen as a financial windfall, but there are times when people may want to consider saying thanks, but no thanks.\nReceiving a sizable gift, if not structured properly, can have unintended consequences that may upend your financial situation or cause friction between family members. If either of those is the case, consider refusing it, experts said. It may not be worth your time, money, or emotions.\n“It’s very important what type of asset you’re inheriting ‒ what it can do for you and if it fits into your universe, and are you the best custodial of those assets?” said Miklos Ringbauer, certified public accountant in Southern California.\nWhy should people think about inheritance now?\nThe so-called great wealth transfer has begun. Nearly $124 trillion in assets will change hands through 2048, according to estimates by the consulting firm Cerulli Associates. Recipients are expected to inherit some $106 trillion of that amount, mainly from baby boomers, with the rest going to charity.\nAssets passed down will include cash and other liquid assets, stocks and bonds, real estate, business interests, retirement accounts, other investments, and personal property.\nWhen might you want to say no?\nSaying no to an inheritance isn’t typical, and experts suggest you consult with a financial planner and an accountant to help you determine if it's right for you.\nHowever, some instances in which you might want to consider refusing an inheritance include if:\n◾Inheriting assets would increase the size of your estate and potentially create tax planning complications for your own heirs once it’s time to pass your assets on.\n◾Accepting certain assets, such as money in an IRA or 401(k), leaves you with a big tax bill because you’d have to pay taxes on distributions, Ringbauer said. Distributions from accounts like a 401(k) or IRA are considered income, not capital gains, and could push you into a higher tax bracket. They also do not receive a step-up basis, meaning the cost basis would remain the same as the original owner.\n◾Inheriting assets causes a rift in the family. “If mom has four kids and leaves a daughter a little bit more, if daughter takes it, people will say she stole it or mom doesn’t love me as much,” said Patrick Simasko, elder law attorney and financial adviser at Simasko Law. “If she loses relationships with her siblings, she shouldn’t take it because of the emotional drama.”\n◾Accepting property that’s too hard to manage or unsellable. “Look at it before you accept,” Simasko said. “You may not want it.” Examples include large vacant lots in isolated areas and timeshares. Neither are easy to sell, but will cost you annual fees for the rest of your life, he said.\nBeware, tricky government benefits\nClaiming an inheritance can push you above income and asset limits to qualify for government programs like Medicaid or Supplemental Security Income (SSI). However, it isn’t as simple as disclaiming an inheritance to stay within the limits because refusing an inheritance is seen as gifting, which also isn’t allowed.\nBecause disclaiming an inheritance can still hurt you, some experts suggest you take the inheritance and spend it down immediately to requalify for benefits.\nMedicaid recipients can use their inheritance to pay off debt, pay for long-term care, make home modifications for safety and accessibility, prepay funeral and burial expenses via an Irrevocable Funeral Trust, or buy assets that are exempt from Medicaid’s asset limit such as furniture and appliances for one’s home, clothing, or upgrading a vehicle, according to the American Council on Aging.\nThe best way to avoid this is to ensure the “parent doesn’t leave the person money,” Simasko said. “Use a special trust instead and the person can draw from it.”\nFor example, assets to a beneficiary of an irrevocable trust don’t affect the beneficiary’s assets and wouldn’t count against their qualification for government benefits, Ringbauer said. Yet, the beneficiary would be able to tap those assets.\nHow to decline an inheritance\nThe legal process is “disclaiming” an inheritance, which means you’re refusing to accept the rights to the assets you were supposed to inherit. Here’s generally how it would work:\n◾Nine months to disclaim. Since it can sometimes take up to six months to get all the paperwork – letter disclaiming, signed, and maybe notarized and witnessed, and delivered ‒ there’s no time to waste once you discover there’s an inheritance out there you don’t want your name on, Ringbauer said.\n◾Disclaiming is irreversible. Once disclaimed, you can’t change your mind.\n◾You must not have received any benefits or taken possession of the asset before disclaiming.\n◾Check state rules. Every state has its own rules on inheritance, so you need to check those to make sure you're compliant.\nWhat happens to the disclaimed inheritance?\nDisclaimed inheritances will go to the next person, or beneficiary, in line. You can’t choose the person to receive the asset.\nIf there isn’t another person named as a next beneficiary, the asset would go through the probate process to be left to someone related to the deceased.\nMedora Lee is a money, markets, and personal finance reporter at USA TODAY. You can reach her at mjlee@usatoday.com and subscribe to our free Daily Money newsletter for personal finance tips and business news every Monday through Friday."
    },
    {
      "url": "https://www.usatoday.com/story/travel/airline-news/2025/08/05/airplane-evacuation-safety-study/85522590007/",
      "text": "Airplane evacuation safety concerns resurface after American Airlines incident\n- Passengers evacuating a burning American Airlines plane in Denver carried luggage, raising safety concerns.\n- Rep. Steve Cohen expressed concerns about evacuation safety and urged the FAA to conduct more realistic tests.\n- Experts emphasize the importance of leaving belongings behind during an evacuation.\nWhen an American Airlines flight was evacuated on the runway in Denver in July, video showed many of the passengers going down the slides with their carry-on luggage in tow.\nThat's a big no-no from safety experts, and it sparked the latest round of concerns from lawmakers and others that airplane evacuations just can't happen as safely as they should.\nIn a letter to the Federal Aviation Administration a few days after the American Airlines incident, Rep. Steve Cohen, D-Tenn., said he's concerned that airlines are no longer configured with evacuation safety in mind.\nCohen sponsored legislation that was passed as part of the 2024 FAA reauthorization, which requires the agency to conduct new evacuation testing to ensure modern aircraft can be evacuated in 90 seconds or less. The agency previously conducted evacuation testing in 2019, but many experts and lawmakers, including Cohen, said the design of those tests was flawed.\n“The urgency of these concerns was made evident by the recent emergency evacuation of American Airlines Flight 3023 at Denver International Airport, reportedly triggered by a landing gear fire. Video footage shows smoke pouring from the aircraft as passengers – some with carry-on bags, others carrying children – rushed down emergency slides.\" Cohen's letter said, adding that the evacuation appeared to have taken as long as 15 minutes.\n“Congress did not write the EVAC Act into law to produce symbolic improvements. We did so to ensure that every passenger, regardless of age, size, ability or language. can evacuate safely and efficiently in an emergency.\nSen. Tammy Duckworth, D-Ill., sent a similar letter to the FAA on Tuesday.\n\"These incidents once again raise serious questions about FAA’s 90 second evacuation standard as well as FAA’s assumptions about how evacuations occur in real world conditions (such as the assumption every passenger will comply with instructions to deplane without carry-on bags),\" her letter said.\nWhile it's unclear whether the FAA will conduct new, more rigorous, evacuation testing, experts said there are some things passengers can do to ensure they get off the plane as quickly and safely as possible in an emergency.\nThe most important thing is to leave everything behind.\n“During an evacuation, seconds matter. The time you take to grab something from in front of you or from the overhead compartment, it’s wasting time, and that time could result in a fatality,” Anthony Brickhouse, director of Embry-Riddle Aeronautical University’s Forensic Lab, previously told USA TODAY. “It creates clutter, and it could damage the slide, which can make it inoperable … The most important thing is to get yourself out of that aircraft as quickly as possible.”\nOther helpful actions include paying attention to the safety briefing on every flight, identifying your nearest exist, knowing your escape route and leaving your shoes on for takeoff and landing. Those phases of flight are when issues most often occur, so it's a good idea to be ready to move if you have to.\n(This story was updated to add new information.)\nZach Wichter is a travel reporter and writes the Cruising Altitude column for USA TODAY. He is based in New York and you can reach him at zwichter@usatoday.com."
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/08/05/how-to-talk-your-team-about-ai/85403931007/",
      "text": "Worried about AI at work? Avoid these 5 leadership mistakes with your team\nArtificial intelligence may be transforming the workplace, but for many employees, it’s fueling uncertainty instead of excitement. According to a 2025 Pew Research Center study, 52% of U.S. workers worry AI could disrupt or replace their jobs. And an August 2024 SHRM survey found that nearly half feel unprepared for automation, while 95% say they don’t trust their organization to manage the shift in a way that benefits everyone.\nHow managers address these concerns can make or break team morale and productivity. Experts say clear, honest communication is critical, but the wrong message can backfire, fueling fear instead of trust. Whether you’re rolling out new tools or just starting the conversation, it’s important to engage your team with transparency, context and empathy.\nBelow, two human resources experts break down five common mistakes to avoid when discussing AI with your team and provide guidance on navigating the discussion more effectively.\n1. Acting like it’s no big deal\nAccording to the World Economic Forum, when managers dismiss or avoid discussing AI concerns, they often create bigger problems down the road.\n“Business leaders can’t bury their heads in the sand and hope for the best,” says Eric Mochnacz, director of operations at Red Clover HR in New Jersey. “They must have up-front discussions about the benefits of AI in their business, the drawbacks, the potential impacts and the areas where they’ll not allow AI usage.”\nChad V. Sorenson, president of Florida-based Adaptive HR Solutions, agrees that direct communication is key. “Employees may feel AI threatens their jobs and may question leaders’ motives for introducing AI tools,” he explains. So, “address the fear and explore how AI can augment workflows and streamline repetitive tasks rather than replace workers.”\nTakeaway: Don’t downplay concerns about AI. Acknowledge employee fears openly and explain how AI will support, not replace, their work.\n2. Throwing around ‘AI’ without defining it\nAI isn’t just one thing. Mochnacz explains that there’s a significant difference between using generative AI to enhance email communications and utilizing AI chatbots to manage all customer interactions. Without these distinctions, employees don't understand what to expect from their workplace changes or how they can remain relevant.\n“AI is such a buzzword, and leaders haven’t taken the time to define it and understand the differences,” says Mochnacz. “I’ve been in meetings where people ask, ‘Can you do this with AI?’ or ‘Everyone’s talking about AI, so we have to do something with it.’”\nHe emphasizes the importance of clarifying the fundamentals:\n- What types of AI are we using and why?\n- What tasks will it/they replace or help with?\n- How much do we trust the tools to handle those tasks?\nTakeaway: Don’t use “AI” as a vague catchall. Clearly define what types of AI you’re using, what they do and why they matter to your team.\n3. Failing to explain the why\n“Any time leaders announce a new program or procedure without employee buy-in, there could be fear, skepticism or anger,” Sorenson cautions.\nInstead of simply telling employees what’s changing, explain why the company needs AI. How does it fit into broader business goals? This context helps employees understand their role in the transition rather than viewing it as a threat.\n“Ongoing two-way feedback is critical for continued refinement of how teams use AI to improve workflows, processes and results,” notes Sorenson.\nTakeaway: Don’t skip the context. Explain why AI is being adopted and how it supports your team’s goals to build trust and buy-in.\n4. Overhyping what AI can do\n“Leaders promising that AI will handle everything don’t have a clear understanding of its possibilities and limitations,” Sorenson says. For instance, AI can help employees understand benefit plans. But it can’t handle nuanced harassment complaints or mental health concerns. “AI systems must be trained to understand when a human must intervene,” he adds.\nMochnacz says the problem gets worse when leaders promise capabilities that may never materialize. “We have no idea what AI is going to be able to do in a month, three months or a year,” he emphasizes. So, it’s better to focus on specific, tested use cases rather than grand predictions about AI replacing everything.\nTakeaway: Avoid making big promises. Focus on what AI can realistically do today, not speculative future capabilities.\n5. Leaving people out of the process\n“Whenever there’s a business, industry or technology shift, involve those it may impact,” stresses Mochnacz. “Have up-front, direct conversations with your people about their roles and how they see AI helping them be more effective.”\nA recent MIT Sloan working paper finds that the most successful generative AI deployments consistently involve frontline workers from the earliest stages through rollout. Drawing on over 50 in-depth interviews, MIT researchers demonstrate that when employees help define the problem, co-design workflows, experiment with tools, and shape fair transition policies, not only does adoption improve, but worker productivity and job quality also rise.\nThe key here is framing AI as a collaboration partner rather than a threat. Mochnacz explains that when leaders present AI as a good reality for everyone, employees will engage with the technology. But when the message becomes \"prove AI can’t replace you,\" workers resist because it feels like an ultimatum.\nTakeaway: Don’t make AI decisions in a vacuum. Engage employees early and frame AI as a tool to support their work, rather than compete with it.\nWhat successful AI communication looks like\nSorenson says poor AI communication shows up in obvious ways. You might notice more pushback in meetings, higher employee turnover or a spike in anxious watercooler conversations. These signals suggest that employees feel excluded or uncertain and may be bracing for the worst.\nIn contrast, when communication is clear and inclusive, team engagement improves. “If your AI communication strategy is successful, employees should engage in the conversation,” Sorenson notes. “They’ll make suggestions to continue to refine its use, and demonstrate an increased productivity level.”\nLook for those signs of healthy adoption: employees asking questions, suggesting improvements and using AI to work more efficiently. When teams feel empowered, not threatened, you know you’ve struck the right balance.\nWhat is USA TODAY Top Workplaces 2025?\nDo you work for a great company? Each year, USA TODAY Top Workplaces, a collaboration between Energage and USA TODAY, ranks organizations across the U.S. that excel at creating a positive work environment for their employees. Employee feedback determines the winners.\nIn 2025, over 1,500 companies earned recognition as top workplaces. Check out our overall U.S. rankings. You can also gain insights into top-ranked employers by checking out the links below."
    },
    {
      "url": "https://www.usatoday.com/story/money/personalfinance/retirement/2025/08/01/maxing-out-your-401k/84407374007/",
      "text": "Is maxing out your 401(k) actually holding you back?\nContributing to a 401(k) is one of the best ways to save for retirement, and this type of account has several distinct advantages.\nFor one, it has a much higher contribution limit than many other retirement accounts. In 2025, you can invest up to $23,500 per year in a 401(k), while the contribution limit for traditional and Roth IRAs (individual retirement accounts) is just $7,000 per year.\nHowever, if you're contributing enough to max out your 401(k), it could potentially put you at a disadvantage in some ways. Here's how.\nLimited investment options could also limit your earnings\nWhen you invest in a 401(k), you will generally have a handful of investment options set by your company plan, such as target-date funds or other types of mutual funds.\nThere's nothing necessarily wrong with these investments, but they offer little flexibility in where, specifically, you invest. If you prefer a more hands-on approach that is more likely to earn you above-average returns, it can be difficult, even impossible at times, to change your investments within a 401(k).\nOther investing accounts, including IRAs, have far more options. From broad-market index funds to industry-specific exchange-traded funds (ETFs) to individual stocks, there are loads of investments out there that most 401(k)s simply don't offer. With the right strategy, these investments have the potential to significantly outperform many mutual funds included in 401(k) plans.\nAlso, many mutual funds found in 401(k)s have much higher fees compared to index funds and ETFs. Not only could you potentially earn more by investing in accounts outside of a 401(k), but you could potentially save thousands of dollars in fees, too.\nEarly (and late) retirement can be more expensive\nIf you plan to retire outside of your 60s and most or all of your savings are tied up in a 401(k), it can potentially throw a wrench in your plans.\nWithdrawing money from your 401(k) before age 59 1/2 will generally result in a 10% penalty on the amount you withdraw. Individuals who are at least 55 years old can sometimes avoid these fees, but that only applies to the 401(k) plan through your most recent employer — not all your older plans from previous jobs.\nOn the other end of the spectrum, delaying retirement well into your 70s can also create hiccups. At age 73, older adults will need to begin taking required minimum distributions (RMDs) from their 401(k) accounts. This is because 401(k) contributions are tax-exempt and tax-deferred, and mandatory withdrawals ensure that the government eventually gets its tax income.\nThere are also some RMD exceptions for those still working. If you own less than 5% of the company you work for, you could potentially delay RMDs until you retire. However, as with early withdrawals, this only applies to the 401(k) sponsored by your current company, not any previous accounts.\nIf you plan to retire far earlier or later than most traditional workers, it may make more sense to contribute to a Roth IRA, Roth 401(k) or taxable brokerage account. These options offer more flexibility in withdrawals, which can give you more choice in when you retire.\nWhen it pays to stick with a 401(k)\nEven if your 401(k) is less than ideal, there's still a fantastic reason to continue contributing to it: employer matching contributions. If your employer matches your 401(k) contributions, that's essentially free money — and it could increase your savings by thousands of dollars per year.\nKeep in mind, too, that there's no reason you can't contribute to multiple accounts. You may invest enough in your 401(k) to earn the full employer match, for example, then stash the rest in a Roth IRA to avoid RMDs. If you max out an IRA, you may then opt to put the rest in a brokerage account for more investment options.\nThe 401(k) is an incredibly powerful tool. But if you're putting all your eggs in one basket by maxing out this account, you could be missing out on fantastic perks from other types of accounts. With a more balanced approach, you can earn more, save more and set yourself up for a better retirement.\nThe Motley Fool has a disclosure policy.\nThe Motley Fool is a USA TODAY content partner offering financial news, analysis and commentary designed to help people take control of their financial lives. Its content is produced independently of USA TODAY.\nThe $23,760 Social Security bonus most retirees completely overlook\nOffer from the Motley Fool: If you're like most Americans, you're a few years (or more) behind on your retirement savings. But a handful of little-known \"Social Security secrets\"could help ensure a boost in your retirement income.\nOne easy trick could pay you as much as $23,760 more... each year! Once you learn how to maximize your Social Security benefits, we think you could retire confidently with the peace of mind we're all after. JoinStock Advisorto learn more about these strategies.\nView the \"Social Security secrets\" »"
    }
  ],
  "argos_summary": "President Trump announced plans to impose tariffs of up to 250% on imported pharmaceuticals and semiconductors, aiming to encourage domestic manufacturing. Meanwhile, discussions around private equity investments in 401(k) plans are gaining traction, with major firms like BlackRock planning to include private investments in retirement accounts, raising concerns about risks for everyday investors. Additionally, experts caution against the potential pitfalls of accepting inheritances, suggesting that in some cases, it may be wiser to decline them to avoid financial complications.",
  "argos_id": "H2PSZF8JC"
}