{
  "url": "https://finance.yahoo.com/news/inspired-nasdaq-inse-q2-sales-122520524.html",
  "authorsByline": "Adam Hejl",
  "articleId": "b952360aadcd4b43986fa97f97b07593",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/09Zvffa5CuvmYipms2KSqA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/stockstory_922/ecc5cdca10dc8de9ac87ea7a7421e882",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-06T12:25:20+00:00",
  "addDate": "2025-08-06T12:39:32.134450+00:00",
  "refreshDate": "2025-08-06T12:39:32.134454+00:00",
  "score": 1.0,
  "title": "Inspired’s (NASDAQ:INSE) Q2 Sales Beat Estimates",
  "description": "Gaming company Inspired (NASDAQ:INSE) reported Q2 CY2025 results beating Wall Street’s revenue expectations, with sales up 6.2% year on year to $80.3 million. Its non-GAAP loss of $0.19 per share was significantly below analysts’ consensus estimates.",
  "content": "Gaming company Inspired (NASDAQ:INSE) reported Q2 CY2025 results beating Wall Street’s revenue expectations , with sales up 6.2% year on year to $80.3 million. Its non-GAAP loss of $0.19 per share was significantly below analysts’ consensus estimates.\n\nIs now the time to buy Inspired? Find out in our full research report.\n• Operating Margin: 9.8%, down from 12.4% in the same quarter last year\n• Free Cash Flow was $3 million, up from -$13.9 million in the same quarter last year\n\n“We are pleased to deliver another strong quarter, underscoring the continued strength across our diversified business model,” said Lorne Weil, Executive Chairman of Inspired.\n\nSpecializing in digital casino gaming, Inspired (NASDAQ:INSE) is a provider of gaming hardware, virtual sports platforms, and server-based gaming systems.\n\nReviewing a company’s long-term sales performance reveals insights into its quality. Any business can put up a good quarter or two, but the best consistently grow over the long haul. Over the last five years, Inspired grew its sales at a 13.4% compounded annual growth rate. Although this growth is acceptable on an absolute basis, it fell short of our standards for the consumer discretionary sector, which enjoys a number of secular tailwinds.\n\nLong-term growth is the most important, but within consumer discretionary, product cycles are short and revenue can be hit-driven due to rapidly changing trends and consumer preferences. Inspired’s recent performance shows its demand has slowed as its annualized revenue growth of 1.1% over the last two years was below its five-year trend.\n\nInspired also breaks out the revenue for its three most important segments: Gaming, Leisure, and Virtual Sports, which are 33.9%, 11.5%, and 37.7% of revenue. Over the last two years, Inspired’s Gaming revenue (land-based casino games) was flat while its Leisure revenue (gaming terminals and amusement machines) averaged year-on-year 4.2% declines. A silver lining was Virtual Sports (digital gaming and sports betting), which averaged 4.1% growth.\n\nThis quarter, Inspired reported year-on-year revenue growth of 6.2%, and its $80.3 million of revenue exceeded Wall Street’s estimates by 6.8%.\n\nLooking ahead, sell-side analysts expect revenue to decline by 1.3% over the next 12 months, a slight deceleration versus the last two years. This projection is underwhelming and suggests its products and services will see some demand headwinds.",
  "medium": "Article",
  "links": [
    "https://stockstory.org/us/stocks/nasdaq/inse?utm_source=earningsArticle&utm_medium=yahoo&utm_campaign=top&utm_article=CF1ybGoBbkI%3D&utm_ticker=INSE"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "revenue",
      "weight": 0.091099925
    },
    {
      "name": "year",
      "weight": 0.08792998
    },
    {
      "name": "digital casino gaming",
      "weight": 0.08348134
    },
    {
      "name": "Inspired",
      "weight": 0.082430944
    },
    {
      "name": "digital gaming",
      "weight": 0.07967617
    },
    {
      "name": "Gaming company",
      "weight": 0.07748197
    },
    {
      "name": "gaming hardware",
      "weight": 0.075623006
    },
    {
      "name": "gaming terminals",
      "weight": 0.07531381
    },
    {
      "name": "the same quarter last year",
      "weight": 0.07049928
    },
    {
      "name": "Inspired’s Gaming revenue",
      "weight": 0.06695564
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9560546875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.8408203125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.8330078125
    },
    {
      "name": "/Games/Gambling/Other",
      "score": 0.4306640625
    },
    {
      "name": "/Games/Card Games/Poker & Casino Games",
      "score": 0.40771484375
    }
  ],
  "sentiment": {
    "positive": 0.25170898,
    "negative": 0.62646484,
    "neutral": 0.12225342
  },
  "summary": "Gaming company Inspired (NASDAQ:INSE) reported a 6.2% year on year sales increase in Q2 CY2025, surpassing Wall Street's revenue expectations. However, the company's non-GAAP loss of $0.19 per share was significantly below analysts’ consensus estimates. The operating margin was 9.8%, down from 12.4% in the same quarter last year, and free Cash Flow was $3 million, up from $13.9 million the previous year. Despite this, Inspired's growth fell short of industry standards for the consumer discretionary sector, which enjoys several secular tailwinds. Looking ahead, sell-side analysts expect revenue to decline by 1.3% over the next 12 months, a slight deceleration from the previous two years.",
  "shortSummary": "Gaming company Inspired's Q2 sales surged 6.2% to $80.3 million, despite a slower growth rate and slower demand, raising concerns about long-term growth and consumer discretionary demand.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "408a10563e8645d9ad2e22a0229b9478",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://stockstory.org/us/stocks/nasdaq/inse?utm_source=earningsArticle&utm_medium=yahoo&utm_campaign=top&utm_article=CF1ybGoBbkI%3D&utm_ticker=INSE",
      "text": "Inspired (INSE)\nWe aren’t fans of Inspired. Its underwhelming revenue growth and failure to generate meaningful free cash flow is a concerning trend.― StockStory Analyst Team\n1. News\n2. Summary\nWhy Inspired Is Not Exciting\nSpecializing in digital casino gaming, Inspired (NASDAQ:INSE) is a provider of gaming hardware, virtual sports platforms, and server-based gaming systems.\n- Demand will likely fall over the next 12 months as Wall Street expects flat revenue\n- Ability to fund investments or reward shareholders with increased buybacks or dividends is restricted by its weak free cash flow margin of 3.5% for the last two years\n- On the plus side, its market-beating returns on capital illustrate that management has a knack for investing in profitable ventures, and its rising returns show it’s making even more lucrative bets\nWhy There Are Better Opportunities Than Inspired\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than Inspired\nAt $8.82 per share, Inspired trades at 2.3x forward EV-to-EBITDA. The current valuation may be appropriate, but we’re still not buyers of the stock.\nWe’d rather pay a premium for quality. Cheap stocks can look like a great deal at first glance, but they can be value traps. Less earnings power means more reliance on a re-rating to generate good returns; this can be an unlikely scenario for low-quality companies.\n3. Inspired (INSE) Research Report: Q2 CY2025 Update\nGaming company Inspired (NASDAQ:INSE) beat Wall Street’s revenue expectations in Q2 CY2025, with sales up 6.2% year on year to $80.3 million. Its non-GAAP loss of $0.19 per share was significantly below analysts’ consensus estimates.\nInspired (INSE) Q2 CY2025 Highlights:\n- Revenue: $80.3 million vs analyst estimates of $75.2 million (6.2% year-on-year growth, 6.8% beat)\n- Adjusted EPS: -$0.19 vs analyst estimates of $0.01 (significant miss)\n- Adjusted EBITDA: $28.4 million vs analyst estimates of $25.36 million (35.4% margin, 12% beat)\n- Operating Margin: 9.8%, down from 12.4% in the same quarter last year\n- Free Cash Flow was $3 million, up from -$13.9 million in the same quarter last year\n- Market Capitalization: $237.4 million\nCompany Overview\nSpecializing in digital casino gaming, Inspired (NASDAQ:INSE) is a provider of gaming hardware, virtual sports platforms, and server-based gaming systems.\nThe company was founded to create advanced digital games with engaging user experiences and realistic graphics. Its products include physical machines like interactive gaming terminals that are placed on casino floors as well as online games.\nInspired generates revenue through the sale and leasing of gaming systems to operators along with service fees. Its customers include casino operators and online casinos.\n4. Gaming Solutions\nGaming solution companies operate in a dynamic and evolving market, and the digital transformation of the gaming industry presents significant opportunities for innovation and growth, whether it be immersive slot machine terminals or mobile sports betting. However, the gaming solution industry is not without its challenges. Regulatory compliance is a crucial consideration as companies must navigate a complex and often fragmented regulatory landscape across different jurisdictions. Changes in regulations can impact product offerings, operational practices, and market access, requiring companies to maintain flexibility and adaptability in their business strategies. Additionally, the competitive nature of the industry necessitates continuous investment in research and development to stay ahead of competitors and meet evolving consumer demands.\nCompetitors in the gaming technology and entertainment sector include Everi (NYSE:EVRI), PlayAGS (NYSE:AGS), and Light & Wonder (NASDAQ:LNW).\n5. Revenue Growth\nA company’s long-term sales performance is one signal of its overall quality. Any business can put up a good quarter or two, but many enduring ones grow for years. Over the last five years, Inspired grew its sales at a 13.4% compounded annual growth rate. Although this growth is acceptable on an absolute basis, it fell short of our standards for the consumer discretionary sector, which enjoys a number of secular tailwinds.\nWe at StockStory place the most emphasis on long-term growth, but within consumer discretionary, a stretched historical view may miss a company riding a successful new product or trend. Inspired’s recent performance shows its demand has slowed as its annualized revenue growth of 1.1% over the last two years was below its five-year trend.\nWe can better understand the company’s revenue dynamics by analyzing its three most important segments: Gaming, Leisure, and Virtual Sports, which are 33.9%, 11.5%, and 37.7% of revenue. Over the last two years, Inspired’s Gaming revenue (land-based casino games) was flat while its Leisure revenue (gaming terminals and amusement machines) averaged year-on-year 4.2% declines. A silver lining was Virtual Sports (digital gaming and sports betting), which averaged 4.1% growth.\nThis quarter, Inspired reported year-on-year revenue growth of 6.2%, and its $80.3 million of revenue exceeded Wall Street’s estimates by 6.8%.\nLooking ahead, sell-side analysts expect revenue to decline by 1.3% over the next 12 months, a slight deceleration versus the last two years. This projection doesn't excite us and suggests its products and services will see some demand headwinds.\n6. Operating Margin\nInspired’s operating margin has been trending up over the last 12 months and averaged 10.1% over the last two years. Its profitability was higher than the broader consumer discretionary sector, showing it did a decent job managing its expenses.\nThis quarter, Inspired generated an operating margin profit margin of 9.8%, down 2.6 percentage points year on year. This contraction shows it was less efficient because its expenses grew faster than its revenue.\n7. Earnings Per Share\nWe track the long-term change in earnings per share (EPS) for the same reason as long-term revenue growth. Compared to revenue, however, EPS highlights whether a company’s growth is profitable.\nInspired’s full-year EPS flipped from negative to positive over the last five years. This is encouraging and shows it’s at a critical moment in its life.\nIn Q2, Inspired reported adjusted EPS at negative $0.19, down from $0.20 in the same quarter last year. This print missed analysts’ estimates, but we care more about long-term adjusted EPS growth than short-term movements. We also like to analyze expected EPS growth based on Wall Street analysts’ consensus projections, but there is insufficient data.\n8. Cash Is King\nIf you’ve followed StockStory for a while, you know we emphasize free cash flow. Why, you ask? We believe that in the end, cash is king, and you can’t use accounting profits to pay the bills.\nInspired has shown poor cash profitability over the last two years, giving the company limited opportunities to return capital to shareholders. Its free cash flow margin averaged 1.8%, lousy for a consumer discretionary business.\nInspired’s free cash flow clocked in at $3 million in Q2, equivalent to a 3.7% margin. Its cash flow turned positive after being negative in the same quarter last year, but we wouldn’t read too much into the short term because investment needs can be seasonal, leading to temporary swings. Long-term trends are more important.\n9. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? A company’s ROIC explains this by showing how much operating profit it makes compared to the money it has raised (debt and equity).\nAlthough Inspired hasn’t been the highest-quality company lately, it found a few growth initiatives in the past that worked out wonderfully. Its five-year average ROIC was 25.3%, splendid for a consumer discretionary business.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. On average, Inspired’s ROIC increased by 2.9 percentage points annually over the last few years. This is a good sign, and if its returns keep rising, there’s a chance it could evolve into an investable business.\n10. Balance Sheet Assessment\nInspired reported $46.3 million of cash and $358.6 million of debt on its balance sheet in the most recent quarter. As investors in high-quality companies, we primarily focus on two things: 1) that a company’s debt level isn’t too high and 2) that its interest payments are not excessively burdening the business.\nWith $107.8 million of EBITDA over the last 12 months, we view Inspired’s 2.9× net-debt-to-EBITDA ratio as safe. We also see its $16 million of annual interest expenses as appropriate. The company’s profits give it plenty of breathing room, allowing it to continue investing in growth initiatives.\n11. Key Takeaways from Inspired’s Q2 Results\nWe enjoyed seeing Inspired beat analysts’ revenue and EBITDA expectations this quarter. On the other hand, its EPS missed. Overall, this print had some key positives. The stock remained flat at $8.82 immediately after reporting.\n12. Is Now The Time To Buy Inspired?\nUpdated: August 6, 2025 at 8:25 AM EDT\nA common mistake we notice when investors are deciding whether to buy a stock or not is that they simply look at the latest earnings results. Business quality and valuation matter more, so we urge you to understand these dynamics as well.\nInspired isn’t a terrible business, but it doesn’t pass our quality test. To kick things off, its revenue growth was mediocre over the last five years, and analysts expect its demand to deteriorate over the next 12 months. And while Inspired’s stellar ROIC suggests it has been a well-run company historically, its low free cash flow margins give it little breathing room.\nInspired’s EV-to-EBITDA ratio based on the next 12 months is 2.3x. This valuation multiple is fair, but we don’t have much faith in the company. We're fairly confident there are better investments elsewhere.\nWall Street analysts have a consensus one-year price target of $13.33 on the company (compared to the current share price of $8.82).\nAlthough the price target is bullish, readers should exercise caution because analysts tend to be overly optimistic. The firms they work for, often big banks, have relationships with companies that extend into fundraising, M&A advisory, and other rewarding business lines. As a result, they typically hesitate to say bad things for fear they will lose out. We at StockStory do not suffer from such conflicts of interest, so we’ll always tell it like it is."
    }
  ],
  "argos_summary": "Inspired (NASDAQ:INSE) reported Q2 CY2025 results with a 6.2% year-on-year revenue increase to $80.3 million, surpassing Wall Street expectations, although it posted a non-GAAP loss of $0.19 per share. Despite a strong quarter, analysts project a 1.3% revenue decline over the next year, indicating potential demand headwinds. The company's long-term growth has been underwhelming, with a compounded annual growth rate of 13.4% over five years, but recent performance shows a slowdown, particularly in its Gaming and Leisure segments.",
  "argos_id": "HDKYCPRKE"
}