{
  "url": "https://www.miamiherald.com/sports/college/acc/university-of-miami/article311572246.html",
  "authorsByline": "Jordan McPherson",
  "articleId": "310abad47de8492b9309afe58f86e73b",
  "source": {
    "domain": "miamiherald.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Miami-Dade County",
      "city": "Miami",
      "coordinates": {
        "lat": 25.7741728,
        "lon": -80.19362
      }
    }
  },
  "imageUrl": "https://www.miamiherald.com/public/latest-news/mb3l9s/picture296296454/alternates/LANDSCAPE_1140/2024-11-23%20AD0814%20Miami%20Hurricanes%20vs%20Wake%20Forest%20Demon%20Deacons.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-06T08:49:25-04:00",
  "addDate": "2025-08-06T12:53:30.506836+00:00",
  "refreshDate": "2025-08-06T12:53:30.506842+00:00",
  "score": 1.0,
  "title": "30 key Miami Hurricanes for 2025 season: Damari Brown ready to put injury behind him",
  "description": "The Miami Herald is counting down 30 of the most important players on the Hurricanes’ roster leading up to the season opener vs Notre Dame.",
  "content": "The Miami Hurricanes kick off the 2025 season on Aug. 31 with a marquee matchup against the Notre Dame Fighting Irish at Hard Rock Stadium (7:30 p.m., ABC).\n\nWith the calendar officially flipped to August, the Miami Herald is counting down 30 of the most important players on the Hurricanes’ roster, one per day leading up to the season opener, to provide a closer look at the team heading into coach Mario Cristobal’s fourth season.\n\nToday: The No. 25 player on our list, Damari Brown.\n\nWhat to know\n\nHow he got to Miami: 2023 recruiting class\n\nKey stats: 16 tackles, 1.5 tackles for loss in 11 games (five starts)\n\nIn summary: Damari Brown was primed to be a full-time starter for the Hurricanes in 2024, but a foot injury sustained in the Hurricanes’ season-opener against the Florida Gators derailed his season. Brown, a former standout at Plantation American Heritage, is now fully healthy and is expected to be in Miami’s cornerback rotation. He can play either the boundary or the nickel depending on what UM needs and how the depth chart shakes out although it looks like most of his playing time would likely come outside. OJ Frederique Jr. and Xavier Lucas figure to be the Hurricanes’ starting cornerbacks on the outside, with Brown and Ethan O’Connor also in the mix for rotation time. Keionte Smith and Charles Brantley are the two primarily in the mix for time in the nickel.\n\n“I’m still trying to get to my game play shape, top-tier form, but I feel like everything’s coming back slowly. I haven’t lost speed, skill or anything like that.” - Damari Brown on his health since recovering from injury\n\n“Just really for myself, [I] just [want] to prove that I am who I am. Obviously I’ve got to come to prove to you guys that I’m still Damari Brown. I have a lot in the tank that I’ve yet to show. I feel like I’m one of the best guys out but I have to showcase it.” - Damari Brown on his expectations for the season\n\n“I know there’s a question mark on our secondary — there kind of usually is year in and year out, but I feel like I have real good confidence, especially now that I’m back joining the guys. I can vouch and speak for us that it’ll be different.” - Damari Brown on the secondary\n\n“I’m glad to have him in Miami and have a chance to coach him and develop him. He’s been banged up, but throughout the spring he’s gotten better. All medical staff have done a great job is just trying to get him back. And he’s been building confidence. He’s made some plays. What you want to see with a guy that has a lot of football experience is how you go about your business every day to be a pro. And he’s been attacking.” - Defensive backs coach Zac Etheridge during spring practices on Damari Brown\n\nThe rest of the series",
  "medium": "Article",
  "links": [
    "https://www.miamiherald.com/sports/college/acc/university-of-miami",
    "https://www.miamiherald.com/sports/college/acc/university-of-miami/article311544700.html#storylink=mainstage_card",
    "https://www.miamiherald.com/sports/college/acc/university-of-miami/article311538200.html",
    "https://www.miamiherald.com/profile/218644615",
    "https://www.miamiherald.com/sports/college/acc/university-of-miami/article311544471.html#storylink=mainstage_card",
    "https://twitter.com/j_mcpherson1126",
    "https://www.facebook.com/MiamiHeraldSports/",
    "https://www.miamiherald.com/sports/college/acc/university-of-miami/article311560021.html#storylink=mainstage_card"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Damari Brown",
      "weight": 0.106534995
    },
    {
      "name": "Miami Hurricanes",
      "weight": 0.09730596
    },
    {
      "name": "Brown",
      "weight": 0.08475992
    },
    {
      "name": "fourth season",
      "weight": 0.07817947
    },
    {
      "name": "Hurricanes",
      "weight": 0.07428005
    },
    {
      "name": "Miami",
      "weight": 0.07165529
    },
    {
      "name": "rotation time",
      "weight": 0.065535195
    },
    {
      "name": "Hard Rock Stadium",
      "weight": 0.060328487
    },
    {
      "name": "time",
      "weight": 0.058087822
    },
    {
      "name": "30 key Miami Hurricanes",
      "weight": 0.056647595
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9970703125
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.97412109375
    },
    {
      "name": "/Sports/College Sports",
      "score": 0.9404296875
    }
  ],
  "sentiment": {
    "positive": 0.2788086,
    "negative": 0.26611328,
    "neutral": 0.45458984
  },
  "summary": "The Miami Hurricanes will begin their 2025 season against the Notre Dame Fighting Irish at Hard Rock Stadium on August 31. The Miami Herald is counting down 30 of the key players on the roster, one per day leading up to the season opener. Damari Brown, who was expected to be a full-time starter for the Hurricanes in 2024, is now fully healthy and expected to play in the team's defensive rotation. OJ Frederique Jr. and Xavier Lucas are expected to start as starting cornerbacks, with Brown and Ethan O’Connor also in the mix for rotation time. Brown expressed confidence in his ability to prove himself, despite previous injury.",
  "shortSummary": "The Miami Hurricanes, led by Damari Brown, will face Notre Dame in their 2025 opener, with Brown expected to play in multiple units.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b7ed7f85ba194d99a42395f747008aab",
  "places": [
    {
      "osmId": "2278785",
      "road": "105",
      "town": "Miami Gardens",
      "county": "Miami-Dade County",
      "state": "Florida",
      "postcode": "33056",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 25.95790165,
        "lon": -80.23769523916623
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "The Miami Hurricanes will begin their 2025 season on August 31 against the Notre Dame Fighting Irish. As part of a countdown of key players, Damari Brown, ranked No. 25, is highlighted; he is recovering from a foot injury that limited his play in 2024 but is now expected to contribute to the team's cornerback rotation. Brown expresses confidence in his abilities and readiness to showcase his skills, while coaches note his improvement and commitment during recovery.",
  "argos_id": "IP0YIQB18"
}