{
  "url": "https://finance.yahoo.com/news/royalty-pharma-nasdaq-rprx-misses-120814877.html",
  "authorsByline": "Jabin Bastian",
  "articleId": "919f88937af1419db342ac84d5321ee2",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/kqI_syfDyyqnCCZ0J19Tdg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/stockstory_922/d2b776c3bcdfc744b1ce6c4964de5c8d",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-06T12:08:14+00:00",
  "addDate": "2025-08-06T12:38:09.431005+00:00",
  "refreshDate": "2025-08-06T12:38:09.431007+00:00",
  "score": 1.0,
  "title": "Royalty Pharma (NASDAQ:RPRX) Misses Q2 Revenue Estimates",
  "description": "Healthcare royalties company Royalty Pharma (NASDAQ:RPRX) fell short of the market’s revenue expectations in Q2 CY2025, but sales rose 7.8% year on year to $579 million. Its GAAP profit of $0.16 per share was in line with analysts’ consensus estimates.",
  "content": "Healthcare royalties company Royalty Pharma (NASDAQ:RPRX) fell short of the market’s revenue expectations in Q2 CY2025, but sales rose 7.8% year on year to $579 million. Its GAAP profit of $0.16 per share was in line with analysts’ consensus estimates.\n\nIs now the time to buy Royalty Pharma? Find out in our full research report.\n• EPS (GAAP): $0.16 vs analyst estimates of $0.17 (in line)\n• Free Cash Flow was $364 million, up from -$138.6 million in the same quarter last year\n\n“We delivered excellent second quarter 2025 results, as the strength of our diversified portfolio drove 20% growth in Portfolio Receipts, and raised our full year guidance,” said Pablo Legorreta, Royalty Pharma’s founder and Chief Executive Officer.\n\nPioneering a unique business model in the pharmaceutical industry since 1996, Royalty Pharma (NASDAQ:RPRX) acquires rights to receive portions of sales from successful biopharmaceutical products, providing funding to drug developers without conducting research itself.\n\nA company’s long-term sales performance can indicate its overall quality. Any business can put up a good quarter or two, but the best consistently grow over the long haul. Regrettably, Royalty Pharma’s sales grew at a tepid 3.6% compounded annual growth rate over the last five years. This wasn’t a great result compared to the rest of the healthcare sector, but there are still things to like about Royalty Pharma.\n\nWe at StockStory place the most emphasis on long-term growth, but within healthcare, a half-decade historical view may miss recent innovations or disruptive industry trends. Royalty Pharma’s performance shows it grew in the past but relinquished its gains over the last two years, as its revenue fell by 1.2% annually.\n\nWe can better understand the company’s revenue dynamics by analyzing its most important segment, Portfolio Receipts. Over the last two years, Royalty Pharma’s Portfolio Receipts revenue averaged 11.8% year-on-year growth. This segment has outperformed its total sales during the same period, lifting the company’s performance.\n\nThis quarter, Royalty Pharma’s revenue grew by 7.8% year on year to $579 million, missing Wall Street’s estimates.\n\nLooking ahead, sell-side analysts expect revenue to grow 26.4% over the next 12 months, an improvement versus the last two years. This projection is eye-popping and implies its newer products and services will catalyze better top-line performance.",
  "medium": "Article",
  "links": [
    "https://stockstory.org/us/stocks/nasdaq/rprx?utm_source=earningsArticle&utm_medium=yahoo&utm_campaign=top&utm_article=CF1ybGoCZEk%3D&utm_ticker=RPRX"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Royalty Pharma",
      "weight": 0.11725633
    },
    {
      "name": "full year",
      "weight": 0.09027903
    },
    {
      "name": "Q2 Revenue Estimates",
      "weight": 0.09012615
    },
    {
      "name": "year",
      "weight": 0.08408733
    },
    {
      "name": "Royalty Pharma’s Portfolio Receipts revenue",
      "weight": 0.08244408
    },
    {
      "name": "revenue",
      "weight": 0.077013485
    },
    {
      "name": "Royalty Pharma’s revenue",
      "weight": 0.07476549
    },
    {
      "name": "Royalty Pharma’s sales",
      "weight": 0.07392042
    },
    {
      "name": "sales",
      "weight": 0.073824614
    },
    {
      "name": "analyst estimates",
      "weight": 0.07307131
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97412109375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.97265625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.958984375
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.79736328125
    }
  ],
  "sentiment": {
    "positive": 0.7285156,
    "negative": 0.16516113,
    "neutral": 0.10632324
  },
  "summary": "Royalty Pharma (NASDAQ:RPRX) fell short of Q2 revenue expectations for Q2 CY2025, with sales rising 7.8% year on year to $579 million. The company's GAAP profit of $0.16 per share was in line with analysts’ consensus estimates. However, free Cash Flow was $364 million, up from -$138.6 million the previous year. Despite this, Royalty Pharma's sales grew at a 3.6% compounded annual growth rate over the last five years. Looking ahead, sell-side analysts expect revenue to grow 26.4% over the next 12 months, an improvement from the last two years.",
  "shortSummary": "Royalty Pharma missed Q2 revenue expectations despite a 7.8% rise, driven by strong Portfolio Receipts performance, with increased full-year growth forecasted.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "db4500e7b4764924bca5904462bf858c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://stockstory.org/us/stocks/nasdaq/rprx?utm_source=earningsArticle&utm_medium=yahoo&utm_campaign=top&utm_article=CF1ybGoCZEk%3D&utm_ticker=RPRX",
      "text": "Royalty Pharma (RPRX)\nRoyalty Pharma piques our interest. Despite its slow growth, its highly profitable model gives it a margin of safety during times of stress.― StockStory Analyst Team\n1. News\n2. Summary\nWhy Royalty Pharma Is Interesting\nPioneering a unique business model in the pharmaceutical industry since 1996, Royalty Pharma (NASDAQ:RPRX) acquires rights to receive portions of sales from successful biopharmaceutical products, providing funding to drug developers without conducting research itself.\n- Exciting sales outlook for the upcoming 12 months calls for 22.4% growth, an acceleration from its two-year trend\n- Disciplined cost controls and effective management have materialized in a strong adjusted operating margin\n- On the flip side, its 3.8% annual revenue growth over the last five years was slower than its healthcare peers\nWhy Is Now The Time To Buy Royalty Pharma?\nHigh Quality\nInvestable\nUnderperform\nWhy Is Now The Time To Buy Royalty Pharma?\nRoyalty Pharma is trading at $37.91 per share, or 7.9x forward P/E. Price is what you pay, and value is what you get. We think the current valuation is quite a good deal considering Royalty Pharma’s business fundamentals.\nNow could be a good time to invest if you believe in the story.\n3. Royalty Pharma (RPRX) Research Report: Q2 CY2025 Update\nHealthcare royalties company Royalty Pharma (NASDAQ:RPRX) fell short of the market’s revenue expectations in Q2 CY2025, but sales rose 7.8% year on year to $579 million. Its GAAP profit of $0.16 per share was in line with analysts’ consensus estimates.\nRoyalty Pharma (RPRX) Q2 CY2025 Highlights:\n- Revenue: $579 million vs analyst estimates of $590 million (7.8% year-on-year growth, 1.9% miss)\n- EPS (GAAP): $0.16 vs analyst estimates of $0.17 (in line)\n- Adjusted EBITDA: $633 million vs analyst estimates of $606.6 million (109% margin, 4.4% beat)\n- Operating Margin: 36.3%, down from 50.2% in the same quarter last year\n- Free Cash Flow was $364 million, up from -$138.6 million in the same quarter last year\n- Market Capitalization: $15.97 billion\nCompany Overview\nPioneering a unique business model in the pharmaceutical industry since 1996, Royalty Pharma (NASDAQ:RPRX) acquires rights to receive portions of sales from successful biopharmaceutical products, providing funding to drug developers without conducting research itself.\nRoyalty Pharma operates at the intersection of finance and pharmaceuticals, creating a win-win arrangement for both drug developers and investors. The company purchases royalty interests in medications, which entitles it to receive a percentage of a drug's sales revenue over time. This model allows Royalty Pharma to benefit from pharmaceutical innovation without bearing the direct risks of drug development and clinical trials.\nThe company's portfolio spans more than 35 commercial products treating various conditions including cystic fibrosis, multiple sclerosis, cancer, and rare diseases. When a pharmaceutical company or research institution needs capital—whether to fund late-stage clinical trials, launch a new drug, or monetize an existing royalty stream—Royalty Pharma can step in with financing in exchange for future royalty rights.\nFor example, a university that developed a promising cancer treatment might sell its royalty rights to Royalty Pharma for an upfront payment, allowing the institution to immediately fund new research while Royalty Pharma collects the ongoing royalties as the drug generates sales. Similarly, a biotech company might partner with Royalty Pharma to fund a Phase 3 clinical trial in exchange for a percentage of future sales.\nRoyalty Pharma maintains a therapeutic-agnostic approach, focusing instead on products with strong clinical data or proven commercial success. The company employs scientific and financial experts who analyze potential acquisitions, tracking development programs across the industry to identify promising opportunities.\nThe company generates revenue entirely through the royalty payments it receives based on the sales performance of drugs in its portfolio. These royalties typically continue until patent expiration or for a contractually specified period. Royalty Pharma's largest revenue source comes from Vertex Pharmaceuticals' cystic fibrosis treatments, including Trikafta, which has patent protection extending to 2037.\n4. Branded Pharmaceuticals\nLooking ahead, the branded pharmaceutical industry is positioned for tailwinds from advancements in precision medicine, increasing adoption of AI to enhance drug development efficiency, and growing global demand for treatments addressing chronic and rare diseases. However, headwinds include heightened regulatory scrutiny, pricing pressures from governments and insurers, and the looming patent cliffs for key blockbuster drugs. Patent cliffs bring about competition from generics, forcing branded pharmaceutical companies back to the drawing board to find the next big thing.\nRoyalty Pharma's competitors include other healthcare royalty investors such as HealthCare Royalty Partners, Oberland Capital, and OrbiMed Advisors, as well as specialized investment firms like Drug Royalty Corporation and Ligand Pharmaceuticals (NASDAQ:LGND).\n5. Revenue Scale\nLarger companies benefit from economies of scale, where fixed costs like infrastructure, technology, and administration are spread over a higher volume of goods or services, reducing the cost per unit. Scale can also lead to bargaining power with suppliers, greater brand recognition, and more investment firepower. A virtuous cycle can ensue if a scaled company plays its cards right.\nWith just $2.31 billion in revenue over the past 12 months, Royalty Pharma lacks scale in an industry where it matters. This makes it difficult to build trust with customers because healthcare is heavily regulated, complex, and resource-intensive. On the bright side, Royalty Pharma’s smaller revenue base allows it to grow faster if it can execute well.\n6. Revenue Growth\nExamining a company’s long-term performance can provide clues about its quality. Any business can put up a good quarter or two, but many enduring ones grow for years. Over the last five years, Royalty Pharma grew its sales at a tepid 3.6% compounded annual growth rate. This wasn’t a great result compared to the rest of the healthcare sector, but there are still things to like about Royalty Pharma.\nLong-term growth is the most important, but within healthcare, a half-decade historical view may miss new innovations or demand cycles. Royalty Pharma’s performance shows it grew in the past but relinquished its gains over the last two years, as its revenue fell by 1.2% annually.\nWe can better understand the company’s revenue dynamics by analyzing its most important segment, Portfolio Receipts. Over the last two years, Royalty Pharma’s Portfolio Receipts revenue averaged 11.8% year-on-year growth. This segment has outperformed its total sales during the same period, lifting the company’s performance.\nThis quarter, Royalty Pharma’s revenue grew by 7.8% year on year to $579 million, missing Wall Street’s estimates.\nLooking ahead, sell-side analysts expect revenue to grow 26.4% over the next 12 months, an improvement versus the last two years. This projection is eye-popping and implies its newer products and services will catalyze better top-line performance.\n7. Operating Margin\nOperating margin is a key measure of profitability. Think of it as net income - the bottom line - excluding the impact of taxes and interest on debt, which are less connected to business fundamentals.\nRoyalty Pharma’s operating margin has been trending up over the last 12 months and averaged 53.4% over the last five years. On top of that, its profitability was elite for a healthcare business thanks to its efficient cost structure and economies of scale.\nAnalyzing the trend in its profitability, Royalty Pharma’s operating margin of 79.8% for the trailing 12 months may be around the same as five years ago, but it has increased by 61.3 percentage points over the last two years.\nThis quarter, Royalty Pharma generated an operating margin profit margin of 36.3%, down 13.9 percentage points year on year. This contraction shows it was less efficient because its expenses grew faster than its revenue.\n8. Earnings Per Share\nWe track the long-term change in earnings per share (EPS) for the same reason as long-term revenue growth. Compared to revenue, however, EPS highlights whether a company’s growth is profitable.\nSadly for Royalty Pharma, its EPS declined by 17.3% annually over the last five years while its revenue grew by 3.6%. However, its operating margin didn’t change during this time, telling us that non-fundamental factors such as interest and taxes affected its ultimate earnings.\nDiving into the nuances of Royalty Pharma’s earnings can give us a better understanding of its performance. A five-year view shows Royalty Pharma has diluted its shareholders, growing its share count by 58.8%. This has led to lower per share earnings. Taxes and interest expenses can also affect EPS but don’t tell us as much about a company’s fundamentals.\nIn Q2, Royalty Pharma reported EPS at $0.16, in line with the same quarter last year. This print missed analysts’ estimates. We also like to analyze expected EPS growth based on Wall Street analysts’ consensus projections, but there is insufficient data.\n9. Cash Is King\nIf you’ve followed StockStory for a while, you know we emphasize free cash flow. Why, you ask? We believe that in the end, cash is king, and you can’t use accounting profits to pay the bills.\nRoyalty Pharma has shown impressive cash profitability, giving it the option to reinvest or return capital to investors. The company’s free cash flow margin averaged 14% over the last five years, better than the broader healthcare sector.\nTaking a step back, we can see that Royalty Pharma’s margin expanded by 35.7 percentage points during that time. This is encouraging, and we can see it became a less capital-intensive business because its free cash flow profitability rose while its operating profitability was flat.\nRoyalty Pharma’s free cash flow clocked in at $364 million in Q2, equivalent to a 62.9% margin. Its cash flow turned positive after being negative in the same quarter last year, building on its favorable historical trend.\n10. Balance Sheet Assessment\nRoyalty Pharma reported $632 million of cash and $8.00 billion of debt on its balance sheet in the most recent quarter. As investors in high-quality companies, we primarily focus on two things: 1) that a company’s debt level isn’t too high and 2) that its interest payments are not excessively burdening the business.\nWith $2.72 billion of EBITDA over the last 12 months, we view Royalty Pharma’s 2.7× net-debt-to-EBITDA ratio as safe. We also see its $90.69 million of annual interest expenses as appropriate. The company’s profits give it plenty of breathing room, allowing it to continue investing in growth initiatives.\n11. Key Takeaways from Royalty Pharma’s Q2 Results\nWe struggled to find many positives in these results. Its EPS missed and its revenue fell short of Wall Street’s estimates. Overall, this was a weaker quarter. The stock traded down 1.7% to $37.25 immediately after reporting.\n12. Is Now The Time To Buy Royalty Pharma?\nUpdated: August 6, 2025 at 8:08 AM EDT\nWhen considering an investment in Royalty Pharma, investors should account for its valuation and business qualities as well as what’s happened in the latest quarter.\nRoyalty Pharma isn’t a terrible business, but it isn’t one of our picks. To kick things off, its revenue growth was uninspiring over the last five years. And while Royalty Pharma’s impressive operating margins show it has a highly efficient business model, its declining EPS over the last five years makes it a less attractive asset to the public markets.\nRoyalty Pharma’s P/E ratio based on the next 12 months is 7.6x. When scanning the healthcare space, Royalty Pharma trades at a fair valuation. For those confident in the business and its management team, this is a good time to invest.\nWall Street analysts have a consensus one-year price target of $42.15 on the company (compared to the current share price of $37.25), implying they see 13.1% upside in buying Royalty Pharma in the short term."
    }
  ],
  "argos_summary": "Royalty Pharma (NASDAQ:RPRX) reported Q2 CY2025 results with a 7.8% year-on-year revenue increase to $579 million, although it fell short of market expectations. The company's GAAP profit of $0.16 per share aligned with analyst estimates, while free cash flow improved significantly to $364 million. Despite a tepid 3.6% annual growth rate over the past five years, analysts project a 26.4% revenue growth over the next year, suggesting potential for better performance driven by newer products.",
  "argos_id": "KAIBLWM2V"
}