{
  "url": "https://www.thesun.co.uk/sport/36170692/gian-van-veen-crying-darts-cheating/",
  "authorsByline": "Jack Figg",
  "articleId": "6d194e97c817451bbc15cd6b4d24090f",
  "source": {
    "domain": "thesun.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "county": "West Yorkshire",
      "city": "Leeds",
      "coordinates": {
        "lat": 53.7440745,
        "lon": -1.5988598
      }
    }
  },
  "imageUrl": "https://www.thesun.co.uk/wp-content/uploads/2025/08/newspress-collage-za0p0lqdq-1754466469728.jpg?1754470099&strip=all&quality=100&w=1920&h=1080&crop=1",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-06T08:49:21+01:00",
  "addDate": "2025-08-06T07:53:18.357820+00:00",
  "refreshDate": "2025-08-06T07:53:18.357821+00:00",
  "score": 1.0,
  "title": "Darts star lifts lid on personal woes and moment opponent said he was cheating",
  "description": "DARTS star Gian van Veen cried his eyes out after being accused of cheating by an opponent. The Dutchman suffers from dartitis – a condition which stops players from releasing the dart due to…",
  "content": "DARTS star Gian van Veen cried his eyes out after being accused of cheating by an opponent.\n\nThe Dutchman suffers from dartitis - a condition which stops players from releasing the dart due to a psychological problem.\n\nVan Veen said on Huw Ware's Tops and Tales podcast: “I still remember one game on the Challenge Tour when I first got dartitis and my opponent was angry at me because he thought I was doing it on purpose.\n\n“I was in tears, crying my eyes out in the middle of Barnsley Metrodome because I was struggling so badly.\n\n\"And for my opponent to tell me I was cheating or something — it was heartbreaking.”\n\nThe name is a portmanteau and was coined by Darts World editor Tony Wood in 1981.\n\nThis condition sees darts players of all levels struggle psychologically - and it is suggested it comes from a fear of missing.\n\nAt the highest level, dartitis has affected many of the sport's best players, including five-time world champion Eric Bristow, who said he suffered with the condition for a decade.\n\nNathan Aspinall also appeared to struggle with the condition when he faced Luke Littler in the World Darts Championship on New Year's Day.\n\nVan Veen is still overcoming his issues now - but believes dartitis has actually made him a better player.\n\nHe said: “The weird thing is, I played better through it. I started averaging like 85 with dartitis.\n\n\"But when I got rid of it, I averaged 92, 93, because in my head, I was like, ‘You're not going to release the dart until you're 100 per cent sure you're going to hit the target.’\n\n\"So it took a while, but I started playing better, winning more games, and that massively grew my confidence.\n\n\"And that's how I eventually got rid of it.”\n\nFormer Youth World Champion Van Veen is now ranked 18th in the world and has titles in his sights.\n\nHe said: “I’m not going to sit here and say, ‘I’m going to win five world titles.’ I’ll be very happy with my career if I win one.\n\n\"I think so far, my career’s already been very successful. But yeah, I’d love to top it off — whether it’s in 20, 25, 30 years — with a world title.\n\n\"Doesn’t matter if it’s next year or in 10 or 15 years. Just win one, and I’ll be very satisfied.”",
  "medium": "Article",
  "links": [
    "https://www.thesun.co.uk/sport/32360515/what-is-dartitis-nathan-aspinall-premier-league-darts/#:~:text=Inside%20the%20%C2%A3799%20VIP,episode%20affected%20Berry%20van%20Peer.",
    "https://www.thesun.co.uk/sport/36158517/darts-emma-paton-sky-sports/",
    "https://www.thesun.co.uk/sport/36150150/premier-league-darts-wes-newton/",
    "https://www.thesun.co.uk/sport/36148313/darts-james-wade-branded-disrespectful-luke-littler-match/",
    "https://www.thesun.co.uk/sport/36144334/luke-littler-girlfriend-faith-australian-darts-masters/",
    "https://www.thesun.co.uk/sport/36166631/premier-league-burnley-quilindschy-hartman-aim-darts-professional/",
    "https://www.thesun.co.uk/sport/35149798/nathan-aspinall-premier-league-darts/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Former Youth World Champion Van Veen",
      "weight": 0.09117488
    },
    {
      "name": "Darts World",
      "weight": 0.083587736
    },
    {
      "name": "Van Veen",
      "weight": 0.083505936
    },
    {
      "name": "Darts World editor Tony Wood",
      "weight": 0.08147579
    },
    {
      "name": "DARTS star Gian van Veen",
      "weight": 0.07950987
    },
    {
      "name": "Gian van Veen",
      "weight": 0.07786654
    },
    {
      "name": "dartitis",
      "weight": 0.07724299
    },
    {
      "name": "darts players",
      "weight": 0.07680683
    },
    {
      "name": "Darts star",
      "weight": 0.072670236
    },
    {
      "name": "players",
      "weight": 0.07208178
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98193359375
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.64306640625
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.421630859375
    }
  ],
  "sentiment": {
    "positive": 0.09106445,
    "negative": 0.6088867,
    "neutral": 0.30029297
  },
  "summary": "Darts star Gian van Veen has revealed that he suffers from dartitis, a condition that prevents players from releasing the dart due to a psychological issue. The condition, coined by Darts World editor Tony Wood in 1981, has affected many of the sport's top players, including five-time world champion Eric Bristow. Van Veen, now ranked 18th in the world, believes that dartitis has made him a better player and increased his confidence.",
  "shortSummary": "Darts star Gian van Veen, overcome dartitis, reveals his struggles with confidence and success, aiming for world titles in the future.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "62d57eb6ed964497a9c083553dbfe4dc",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Darts player Gian van Veen expressed his emotional struggle with dartitis, a psychological condition that affects players' ability to release darts. He recounted a painful experience where an opponent accused him of cheating, which left him in tears. Despite the challenges, van Veen believes overcoming dartitis has improved his game, leading to higher averages and increased confidence. Currently ranked 18th in the world, he aspires to win a world title during his career.",
  "argos_id": "KI0RCTDCC"
}