{
  "url": "https://www.yahoo.com/news/articles/family-farm-shop-outlines-padel-124931698.html",
  "authorsByline": "Jonathan Sutton - Local Democracy Reporting Service",
  "articleId": "6822cf91d8c34ac58882ab380c0e61e2",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/8469742bb9aa29ae59c296205dcf1ba3f231d0195f1c057444434c623159ad04/ynews/resizefill_w1200/https://media.zenfs.com/en/bbc_us_articles_995/64f68d93b7ec1b82597074ef63dcf9ba",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-06T12:49:31+00:00",
  "addDate": "2025-08-06T13:22:49.145218+00:00",
  "refreshDate": "2025-08-06T13:22:49.145220+00:00",
  "score": 1.0,
  "title": "Family farm shop outlines padel tennis court plan",
  "description": "Proposals for the site at Perton include demolishing and redeveloping an existing \"dilapidated\" shop.",
  "content": "Plans for padel tennis courts near a proposed new farm shop have been outlined.\n\nBradshaws Farm in Perton near Wolverhampton, a fourth-generation family farm, has submitted plans, with proposals including demolishing and redeveloping the existing \"dilapidated\" farm shop.\n\nThe four courts will be open to the public and the Lawn Tennis Association, in a letter accompanying the application, stated there was unmet demand for the development.\n\nWith increasing financial strain on the industry, farmers need to diversify in order to survive, the applicants said. South Staffordshire Council planning officers are considering plans.\n\nThe site would have more than 50 parking spaces and it is planned the redeveloped area, near Wrottesley Park Road, will include a clubhouse.\n\nThe proposed development also includes demolishing and removing the \"existing dated and dilapidated farm shop structure and associated operational space\", documents submitted to the council stated.\n\nThey added the redevelopment would replace a \"functionally outdated structure with a well-designed, energy-efficient building that aligns with the rural character of the area\".\n\nThe development would generate local employment opportunities, the documents said.\n\nThey also stated introducing padel courts was consistent with planning policy objectives relating to outdoor recreation, public health and community wellbeing.\n\nPublic comments on the application can be made until 25 August.\n\nThe courts will be open to the public, including local schools and sports clubs.\n\nThis news was gathered by the Local Democracy Reporting Service which covers councils and other public service organisations.\n\nMore on this story\n• None Padel could come to Rotherham under new plans\n• None Plans to open new padel courts on industrial estate\n• None Padel: 'I want to play the sport but I can't afford it'",
  "medium": "Article",
  "links": [
    "https://www.bbc.co.uk/news/articles/ce82nyrzj3po?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "https://x.com/bbcwm",
    "https://www.sstaffs.gov.uk/",
    "https://www.facebook.com/BBCBlackCountry",
    "https://www.bbc.com/lnp/ldrs?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "https://www.bbc.co.uk/news/articles/cvgnedzkep0o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "https://www.bbc.co.uk/sounds/curation/p0cjf1dh?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "https://www.instagram.com/bbcwm/",
    "https://www.bbc.co.uk/news/articles/cvgv9q957vlo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "new padel courts",
      "weight": 0.10319411
    },
    {
      "name": "padel tennis court plan",
      "weight": 0.10202474
    },
    {
      "name": "padel tennis courts",
      "weight": 0.09771604
    },
    {
      "name": "padel courts",
      "weight": 0.09759201
    },
    {
      "name": "Family farm shop",
      "weight": 0.092101924
    },
    {
      "name": "new plans",
      "weight": 0.0789761
    },
    {
      "name": "other public service organisations",
      "weight": 0.0745921
    },
    {
      "name": "public health",
      "weight": 0.0725208
    },
    {
      "name": "planning policy objectives",
      "weight": 0.07202831
    },
    {
      "name": "South Staffordshire Council planning officers",
      "weight": 0.071510434
    }
  ],
  "topics": [
    {
      "name": "Tennis"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.95166015625
    },
    {
      "name": "/Business & Industrial/Agriculture & Forestry/Other",
      "score": 0.76318359375
    },
    {
      "name": "/Real Estate/Other",
      "score": 0.53466796875
    },
    {
      "name": "/Business & Industrial/Construction & Maintenance/Other",
      "score": 0.4697265625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.35693359375
    },
    {
      "name": "/Business & Industrial/Agriculture & Forestry/Farms & Ranches",
      "score": 0.30908203125
    }
  ],
  "sentiment": {
    "positive": 0.15917969,
    "negative": 0.22595215,
    "neutral": 0.6152344
  },
  "summary": "Plans for padel tennis courts near a proposed new farm shop in Perton near Wolverhampton have been outlined by a fourth-generation family farm. The proposal includes demolishing and redeveloping the existing farm shop, with four courts open to the public. The Lawn Tennis Association has stated there is unmet demand for the development. The site would have over 50 parking spaces and a clubhouse. South Staffordshire Council planning officers are considering the plans. Public comments on the application can be made until 25 August.",
  "shortSummary": "A family farm in South Staffordshire has submitted plans for four padel tennis courts, demolishing and redeveloping its existing farm shop.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "0be20d0b34f74f308c31c269097bde37",
  "places": [
    {
      "osmId": "23282268",
      "road": "Wrottesley Park Road",
      "suburb": "Perton",
      "city": "South Staffordshire",
      "county": "Staffordshire",
      "state": "England",
      "postcode": "WV6 7LX",
      "country": "United Kingdom",
      "countryCode": "gb",
      "coordinates": {
        "lat": 52.6068199,
        "lon": -2.2086205
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.bbc.co.uk/news/articles/cvgv9q957vlo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
      "text": "Plans to open new padel courts on industrial estate\n- Published\nPlans to open new padel courts on a recently built industrial estate have been submitted to a city council.\nIf approved, the new courts would open in two units at the G5 Industrial Park in Spring Road, Ettingshall, Wolverhampton.\nThe sport is a mix of squash and tennis and is played in doubles on an enclosed court about a third the size of a tennis court.\nThe planning application was submitted by Padel Warehouse 52 to the City of Wolverhampton Council. It stated: \"Given the popularity of the sport, there is a high demand for padel tennis facilities... The building's characteristics are well-suited for padel tennis.\"\nUnder the plans, the facility would be open from 06:00 to 23:00 BST with no external changes needed to the units.\nThe applicant stated that the early and late hours would allow customers to play before and after work and that refreshment provision and a seating area would be provided along with changing facilities.\nThe city council approved plans for the new industrial park in 2022 and it was built a year later.\nThis news was gathered by the Local Democracy Reporting Service which covers councils and other public service organisations.\nGet in touch\nTell us which stories we should cover in Wolverhampton\nFollow BBC Wolverhampton & Black Country on BBC Sounds, Facebook, external, X, external and Instagram, external.\n- Published1 June\n- Published9 June"
    },
    {
      "url": "https://www.bbc.com/lnp/ldrs?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
      "text": "The journalists are funded by the BBC as part of its latest Charter commitment, but are employed by regional news organisations.\nA total of 165 reporters are allocated to news organisations in England, Scotland, Wales and Northern Ireland.\nThese organisations range from television and radio stations to online media companies and established regional newspaper groups.\nLocal Democracy Reporters cover top-tier local authorities, second-tier local authorities and other public service organisations.\nPrinciples of operation: Questions and answers\nStories written by the democracy reporters are shared with more than 1,100 media titles and outlets that have signed up to be part of the Local News Partnerships scheme.\nTo be awarded the democracy reporter contracts, the successful news organisations had to pass stringent criteria which included financial standing and a strong track record of relevant journalism in the area they were applying to cover.\nThe award decisions were made by senior editorial BBC figures.\nThe full list of organisations that were awarded contracts can be viewed here.\nLocal Democracy Reporter content can be downloaded via an online portal, accessed via a log-in code supplied to all qualifying news organisations.\nThe Local Democracy Reporting Service (LDRS) is a public service news agency: funded by the BBC, provided by the local news sector, and used by qualifying partners. It’s like a franchise: different companies with different approaches, but using common editorial standards and all publishing into the same system.\n- The core purpose of the LDRS is to provide impartial coverage of the regular business and workings of local authorities in the UK, and other relevant democratic institutions such as mayoralties, combined authority areas, P&CCs, quangos, etc.\n- The Local Democracy Reporters' (LDRs) brief is to report on the decision-making process: what decisions are made in the public's name and how they are arrived at, what evidence is presented to the council, etc.\n- The expectation is that LDRs shall endeavour to attend all meetings in person.\n- In two-tier council areas the LDRs should cover district council affairs sufficiently to ensure that significant decisions (eg planning) are reported.\n- LDRs may provide other stories which are focused on local democracy and which are in the public interest so long as that does not detract from the core purpose of the service.\n- All their work must be available to all qualifying partners.\n- National politics is out of scope, but election campaigns and constituency work of MPs, AMs, MSPs and MLAs that specifically relates to relevant local audiences may be covered so long as it does not detract from the core purpose of the LDRS.\nLDRs report to the contract holder, not to the BBC or any other partner.\nWith the guidance and support of the contract holder, LDRs work to the brief covering the stories of greatest public interest and they should not undertake commissions for any partner.\nDirect questions and clarifications relating to content are acceptable, but any suggestions or comments relating to the service should go through a LDR's manager.\nThe only difference between the BBC and others is that it has a right to request interviews or 2-ways for BBC Local Radio. Depending on workload and commitments it is up to each LDR to decide whether or not to agree.\nNo. While meeting the highest standards of accuracy and impartiality, written content may conform to an employer's normal style. BBC training will help create a common standard for media content production.\n- All content must be created for all qualifying partners.\n- Content should be published as soon as possible after a meeting or event.\n- All content must be published using the LDRS Authoring Tool so all partners see it simultaneously.\n- All content must be titled COUNCIL NAME: Story Name.\n- It must be tagged with at least one top-tier local authority, but can have as many tags as are relevant.\n- Images and media must have a descriptive label.\n- Images and media must be rights-free (LDRs should not use their employer’s picture library, or images supplied by agencies or freelance contributors).\n- LDRs should, where possible, assign a \"Feature Image\" to a story.\n- LDRs must provide an Advisory note in the publishing system before the end of every week indicating their diary for the next seven days (or longer).\n- LDRs should source their content. An explanatory Note to Editors at the end of a story regarding the source will reduce queries from partners, especially around whether qualified privilege applies to all or part of a story.\n- LDRs should not file a story based on a press release already in the public domain unless it has been significantly developed with new quotes or information.\n- Embargoed content must explain why publication should be delayed.\n- Posts should be via LDRs' personal accounts rather than contractors' branded accounts.\n- LDRs are encouraged to post an Advisory in the LDRS Authoring Tool to let partners know if they intend live-Tweeting from a meeting, for example.\n- Tagging #LDReporter will help the partnership collate relevant tweets.\n- LDRs should be credited as \"First Name, Last Name, Local Democracy Reporter\".\n- By-lines or references within copy are acceptable.\n- Broadcasters should acknowledge LDRs when they appear on air or when the format allows.\n- Shared credit with other reporters is acceptable if LDRs' content is copied, edited or incorporated into new pieces of work.\n- The LDRS logo can also be used in print, online or on TV, but is not compulsory.\n- LDRs should refer to themselves as \"Local Democracy Reporters\", not \"BBC Local Democracy Reporters\" in all forms of communication, including social media profiles.\n- Corrections and clarifications relating to previously published stories must be clearly highlighted and issued immediately.\n- The headline style should be as follows: 'COUNCIL NAME: Story Name - CORRECTION'.\n- The first paragraph of the body copy should be as follows: 'CORRECTION: An earlier version of this story incorrectly stated that…'."
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/ce82nyrzj3po?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
      "text": "Padel: 'I want to play the sport but I can't afford it'\n- Published\nA shorter racket, a smaller court and an underarm serve.\nPadel tennis is one of the fastest-growing sports in the world, thanks to its basic skill level and social nature.\nAs demand grows, the number of venues isn't going up, but the cost of playing is.\nAccording to the Lawn Tennis Association (LTA), there are currently around 800 padel courts in Britain, but over 400,000 players.\nResearch by Ray Algar, an expert on the economics of sport and exercise, shows that the average off-peak court hire in the UK is about £30, but peak time prices can reach £80 at some venues.\n'I sometimes take a month off'\nRosie Hepworth got into padel about a year ago after seeing the sport on social media.\nThe rise of the racquet sport - usually played in doubles on an enclosed court where balls can be played off the walls - has been helped by influencers and celebrity players such as Stormzy.\nBut that popularity has driven up the price for players such as Rosie.\n\"I can't afford to play regularly,\" she tells BBC Newsbeat. \"It definitely slows down how much I can improve.\"\nThe trainee accountant only gets on the courts every few weeks and says her budget means she spends an average of £30 a month on padel, but has spent up to £70 before.\n\"If I have other financial commitments, then I might take a month off,\" she says.\nWhen Rosie's friends could no longer afford the high cost, she started playing in a league with strangers as a third or fourth player.\nShe says these open matches work out cheaper, and increase the number of available games.\n\"In central London, it's hard to find a court that is free,\" she says.\n\"They are so booked up that you have to book at least a week in advance.\"\nRosie cycles up to 50 minutes away from her home to courts that are almost half the price and quieter at peak times.\n\"I find it frustrating to have to travel so far for affordable courts,\" the 24-year-old says.\n\"But it's just about worth it because it's become a hobby I really enjoy.\"\nStudent Barnaby Stephenson took up the sport about two years ago and helped to found the University of Edinburgh's first padel club.\nThe 21-year-old says the city has fewer courts than others and getting to and from practices means a two-hour round-trip, which he describes as a \"struggle\".\nBarnaby's club had provided free balls and rackets to new members and charged just £2 per session, but the society had to stop offering social memberships due to \"unprecedented demand\".\nBarnaby wants to see more grassroots investment in state schools and public parks to make the sport more accessible.\n\"There needs to be more pressure and focus on developing padel in every community, rather than concentrating on middle-class areas,\" he says.\nWhere are the courts?\nThe BBC asked all of the local councils in the UK if they had put money into providing padel facilities.\nOf the 330 that responded, only three said that they had.\nWhile the LTA has spent more than £6m on the sport, this only accounts for 10% of all padel courts nationwide.\nMany of the rest are independently owned, driving up booking costs and increasing the number of private members' clubs.\nWe also tracked where courts were located across Britain using data from The Padel Directory, and found that most were in the wealthiest areas, with the highest numbers in the south of England.\nIn other countries it's a very different picture.\n\"We're one of the last nations in Europe to catch this padel wave,\" says Tom Murray, the LTA's head of padel.\nAs the organisation that looks after padel in the UK, the LTA has launched a new five-year strategy that aims to work with local authorities to build more courts.\nIt hopes to increase accessibility as other countries have done.\n\"In Spain it started as that premium elitist sport, but now it's far from it - it's second to football in terms of participation.\"\nMadrid will host this year's Euro Padel Cup in July - with a record 40 nations taking part.\nIt's an event Team GB players Catherine Rose and Nikhil Mohindra are training for.\nBritish number two Catherine began playing three years ago and recalls \"driving around the country\" to find opponents.\nIt was a different story for Nikhil, who says he was lucky enough to have a friend nearby he could practise with.\n\"I don't know how I would've played otherwise,\" the 22-year-old says.\nBoth want to boost participation. Catherine says there are fewer female players in the UK, and Nikhil thinks efforts could be made to improve diversity.\nHe says he's seen how diverse the sport can be during his visits to India as a padel ambassador.\n\"When I go there, I see courts being used 24 hours a day by everyone,\" he says.\n\"Anyone from any background can play - it's about opening up more courts in ethnic minority areas.\"\nTanaya Lai, who began playing tennis at four years old, says she's used to being \"surrounded by white people\".\nIt's something she's noticed since joining the University of Plymouth's padel team, but doesn't see it as a barrier.\n\"I am happy to be an Asian woman in sport,\" she says.\n\"Asian women need to know that they aren't excluded from these spaces and they can join if they want to.\"\nHowever, the 22-year-old does think that there are other obstacles.\n\"It's viewed as a posh, more upper-class sport because of how expensive courts are,\" she says. \"There need to be more public and cheaper courts.\"\nLike Rosie and Barnaby, Tanaya cannot afford to play padel as regularly as she would like and feels it has hindered her progress.\n\"I only really play league matches because it is expensive to just book a court and play for an hour or two,\" she explains.\n\"Otherwise I'd be able to play more.\"\nAdditional reporting by Lauren Woodhead"
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/cvgnedzkep0o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
      "text": "Padel could come to Rotherham under new plans\n- Published\nThe dedicated padel tennis centre could open in Rotherham under new plans submitted to the council.\nThe application to transform a vacant industrial unit in Hellaby would see several indoor padel courts built alongside a small cafe and bar.\nThe Lawn Tennis Association (LTA) has supported the proposal, describing the development as a \"fantastic attribute for the Rotherham area\".\nThe LTA said there were currently no padel courts in Rotherham and praised the facility's potential to boost participation in what it calls the \"fastest-growing sport in the world\".\nPadel is a racket sport that combines elements of tennis and squash, played on a smaller enclosed court, and is designed to be more accessible and sociable than traditional tennis.\nThe site, Unit 1, Sandbeck Way, is currently a vacant truck park and distribution warehouse which dates back to the 1970s, according to the Local Democracy Reporting Service.\nAccording to the applicant the building is no longer viable as a warehouse due to modern demands and structural limitations and has stood vacant since 2023.\nThe applicant said the centre would create up to 12 jobs, including roles for padel coaches, cleaning and maintenance staff, and a full-time site manager.\nParking provision would be expanded from the existing 14 spaces to a minimum of 37, with an additional 14 overspill spaces available at the nearby Trinity House unit. Eight parking bays would be equipped with electric vehicle charging points.\nIt would operate from 7am to 10pm on weekdays and 8am to 9pm at weekends.\nThe application is currently under consideration by Rotherham Council's planning department.\nGet in touch\nTell us which stories we should cover in Yorkshire\nListen to highlights from South Yorkshire on BBC Sounds, catch up with the latest episode of Look North\nRelated topics\nRelated stories\n- Published14 July\n- Published24 July"
    }
  ],
  "argos_summary": "Bradshaws Farm in Perton, near Wolverhampton, has proposed plans to build four padel tennis courts alongside a redeveloped farm shop, citing unmet demand for such facilities. The development aims to create local employment opportunities and enhance community wellbeing, with public comments accepted until August 25. Additionally, plans for new padel courts on an industrial estate in Wolverhampton have also been submitted, reflecting the growing popularity of the sport in the UK.",
  "argos_id": "M3B45ZUT8"
}