{
  "url": "https://www.bbc.com/sport/football/articles/cg4x112xv67o?at_medium=RSS&at_campaign=rss",
  "authorsByline": "BBC Sport",
  "articleId": "872196aff4d4467c827bbc3ec721d6a3",
  "source": {
    "domain": "bbc.com",
    "paywall": false,
    "location": {
      "country": "gb",
      "state": "",
      "county": "",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1134/live/e1d7f840-7221-11f0-843e-eb3da839c0e3.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-06T12:49:31.648000+00:00",
  "addDate": "2025-08-06T12:57:48.953799+00:00",
  "refreshDate": "2025-08-06T12:57:48.953801+00:00",
  "score": 1.0,
  "title": "David Gray challenges Hibs to 'change history' in Europe",
  "description": "Head coach David Gray is urging his players to \"change history in positive ways\" as Hibernian eye Conference League qualification.",
  "content": "Head coach David Gray is urging his players to \"change history in positive ways\" as Hibernian eye Conference League qualification.\n\nThe Leith side travel to Partizan Belgrade in the first leg of their third-round qualifier on Thursday after suffering Europa League heartache last week.\n\nA stunning extra-time bicycle kick from Midtjylland's Junior Brumado denied Hibs a penalty shootout at Easter Road, but Gray wants his team to respond by embracing a tough trip to a hostile Partizan Stadium.\n\nOn facing a potentially daunting atmosphere, the Hibs boss told BBC Scotland: \"You need to deal with that challenge. It's a different one many of the players haven't experienced before and we'll make sure players are ready for it.\n\n\"It will be tough. That intensity and atmosphere is something we have to contend with as well. I expect them to be fast and intense.\"\n\nDespite being the first British club to play in Europe, Hibs have never qualified for a group or league phase of a Uefa competition.\n\nTo change that, they will need to beat Partizan, who finished as a distant second in the Serbian top flight last term, and Legia Warsaw or AEK Larnaca in the play-off round.\n\n\"It's something that's not been done,\" added Gray, whose side started their Scottish Premiership campaign with a win at Dundee on Sunday.\n\n\"I keep challenging the players to change history in positive ways. It's going to take huge effort and maximum performance levels. The players need to relish this opportunity.\"",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "David Gray",
      "weight": 0.08605504
    },
    {
      "name": "Head coach David Gray",
      "weight": 0.08315122
    },
    {
      "name": "Hibs",
      "weight": 0.0811513
    },
    {
      "name": "Partizan Belgrade",
      "weight": 0.07742563
    },
    {
      "name": "Gray",
      "weight": 0.07719003
    },
    {
      "name": "players",
      "weight": 0.0761389
    },
    {
      "name": "Partizan Stadium",
      "weight": 0.07268214
    },
    {
      "name": "Europa League heartache",
      "weight": 0.07234319
    },
    {
      "name": "Partizan",
      "weight": 0.06918298
    },
    {
      "name": "last term",
      "weight": 0.068392806
    }
  ],
  "topics": [
    {
      "name": "European Football"
    },
    {
      "name": "Football"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9921875
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.984375
    }
  ],
  "sentiment": {
    "positive": 0.10424805,
    "negative": 0.59375,
    "neutral": 0.30151367
  },
  "summary": "Hibernian's head coach, David Gray, has challenged his team to \"change history in positive ways\" as they prepare for their third-round qualifier against Partizan Belgrade, following a disappointing Europa League result last week. Despite being the first British club to play in Europe, Hibs have never qualified for a group or league phase of a Uefa competition. To change this, Gray emphasised the importance of preparing for a challenging match at the hostile partizan Stadium and anticipates a fast and intense atmosphere from the team.",
  "shortSummary": "Hibernian coach David Gray urges a positive response from his team against Partizan Belgrade, aiming to secure Conference League qualification despite recent Europa League heartache.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "520bfddfc5d54aa2b6aa3fc24fa39c9d",
  "places": [
    {
      "osmId": "19754330",
      "road": "Albion Place",
      "suburb": "Leith",
      "city": "City of Edinburgh",
      "state": "Scotland",
      "postcode": "EH7 5QG",
      "country": "United Kingdom",
      "countryCode": "gb",
      "neighbourhood": "Lorne",
      "coordinates": {
        "lat": 55.9616856,
        "lon": -3.1651677730061154
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "Hibernian's head coach David Gray is motivating his players to make history by qualifying for the Conference League as they prepare for a challenging match against Partizan Belgrade. Following a disappointing exit from the Europa League, Gray emphasizes the need for his team to embrace the intense atmosphere of the Partizan Stadium. Hibs, despite being the first British club to compete in Europe, have never reached the group stage of a UEFA competition, and Gray is urging his players to seize this opportunity with maximum effort.",
  "argos_id": "SEQST1792"
}