{
  "url": "https://finance.yahoo.com/news/ozempic-maker-novo-nordisk-posts-074837482.html",
  "authorsByline": "AFP",
  "articleId": "6f2d690a69ec43cf9807e81e801e59a5",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/afp.com/6bb46d10ef56e27c034ddc466f89b1c5",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-06T07:48:37+00:00",
  "addDate": "2025-08-06T08:00:27.707625+00:00",
  "refreshDate": "2025-08-06T08:00:27.707626+00:00",
  "score": 1.0,
  "title": "Ozempic maker Novo Nordisk posts strong results but competition weighs",
  "description": "Danish pharmaceutical giant Novo Nordisk posted a sharp rise in second-quarter net profit Wednesday, but rising competition is weighing on sales of its diabetes and obesity treatments Ozempic and Wegovy in the United States.But it now faces growing competition from rival treatments made by US group Eli Lilly in United States.",
  "content": "Danish pharmaceutical giant Novo Nordisk posted a sharp rise in second-quarter net profit Wednesday, but rising competition is weighing on sales of its diabetes and obesity treatments Ozempic and Wegovy in the United States.\n\nThe group reported a net profit of 26.5 billion kroner ($4.1 billion), a 32 percent increase from the same period last year, while sales increased by 18 percent to 76 billion kroner.\n\nThe drug maker lowered its annual earnings outlook last week, causing its share price to continue its nearly year-long slide.\n\nThe company had already cut its forecast in May and announced the departure of its chief executive Lars Fruergaard Jorgensen.\n\n\"In May we mostly thought the bottom was reached,\" Mikael Bak, director of the Danish shareholders' association, told AFP.\n\nBak said \"every is a bit surprised\" that the situation has deteriorated.\n\n\"So now we don't want to see more disappointments, there are reasons to believe the business is healthy, the institution and the products good,\" he said.\n\nNovo Nordisk announced last week that it was promoting Maziar Mike Doustdar, its vice president for international operations, to succeed Jorgensen.\n\nThe popularity of Novo Nordisk's weight-loss treatments had once made it a darling of investors, boosting its share price and at one point making it Europe's most valuable company.\n\nBut it now faces growing competition from rival treatments made by US group Eli Lilly in United States.\n\nA rule by the US Food and Drug Administration allowing pharmacies to create so-called \"compound\" copycat versions of the drug, after high demand led to shortages, has also dented Novo Nordisk's earnings.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ozempic maker Novo Nordisk",
      "weight": 0.09774981
    },
    {
      "name": "Novo Nordisk",
      "weight": 0.09668488
    },
    {
      "name": "last week",
      "weight": 0.077986695
    },
    {
      "name": "US group Eli Lilly",
      "weight": 0.071965866
    },
    {
      "name": "rival treatments",
      "weight": 0.069541566
    },
    {
      "name": "growing competition",
      "weight": 0.06720458
    },
    {
      "name": "rising competition",
      "weight": 0.06701129
    },
    {
      "name": "Mikael Bak",
      "weight": 0.0652175
    },
    {
      "name": "United States",
      "weight": 0.063952014
    },
    {
      "name": "Maziar Mike Doustdar",
      "weight": 0.06289951
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.95361328125
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.92236328125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.7001953125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.501953125
    },
    {
      "name": "/Health/Pharmacy/Drugs & Medications",
      "score": 0.42919921875
    },
    {
      "name": "/News/Health News",
      "score": 0.378173828125
    }
  ],
  "sentiment": {
    "positive": 0.044433594,
    "negative": 0.8432617,
    "neutral": 0.11212158
  },
  "summary": "Danish pharmaceutical company, Novo Nordisk, has reported a sharp rise in Q2 net profit of 26.5 billion kroner ($4.1 billion), a 32 percent increase from the same period last year, while sales increased by 18 percent to 76 billion kronser. However, competition is increasing, affecting sales of its diabetes and obesity treatments Ozempic and Wegovy in the US. The company has also lowered its annual earnings outlook and announced the departure of its CEO, Lars Fruergaard Jorgensen. The popularity of Novo's weight-loss treatments once led to a surge in its share price, making it Europe's most valuable company.",
  "shortSummary": "Novo Nordisk reported a 32% rise in second-quarter net profit to 26.5 billion kroner, despite rising competition from Eli Lilly, impacting sales and prompting executive changes.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "405597bee794476d8500afcde2ba2952",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Novo Nordisk reported a 32% increase in second-quarter net profit to 26.5 billion kroner, despite rising competition impacting sales of its diabetes and obesity drugs, Ozempic and Wegovy, in the U.S. The company has lowered its annual earnings outlook twice this year, leading to a decline in its share price and the departure of CEO Lars Fruergaard Jorgensen. Increased competition from Eli Lilly and FDA regulations allowing pharmacies to create copycat versions of its drugs have further challenged Novo Nordisk's market position.",
  "argos_id": "XY10ZA73E"
}