{
  "url": "https://www.extremetech.com/computing/nvidia-to-sell-b30a-to-china-more-capable-than-h20-but-half-the-power-of",
  "authorsByline": "Jon Martindale",
  "articleId": "a59ca9aff59d47adb167c708e6e61ea4",
  "source": {
    "domain": "extremetech.com",
    "location": null
  },
  "imageUrl": "https://i.extremetech.com/imagery/content-types/01mH9CP6nk5HrO0ydHFzzu9/hero-image.fill.size_1200x675.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-19T17:55:22+00:00",
  "addDate": "2025-08-19T18:02:33.202447+00:00",
  "refreshDate": "2025-08-19T18:02:33.202448+00:00",
  "score": 1.0,
  "title": "Nvidia to Sell B30A to China: More Capable Than H20, But Half the Power of B300",
  "description": "This is after the US announced that it would allow the sale of more advanced technology to China, so long as the US gets a 15% cut of the proceeds.",
  "content": "Nvidia is developing a new cut-down version of its Blackwell Ultra B300 flagship AI platform for sale in the Chinese market, according to Reuters' sources. Although the B30A will be far faster than existing H20 platforms that are sold to China, it will still be around half the performance of the B300.\n\nThe sale of AI training and inference hardware from the US to China has been a major point of contention in the ongoing trade tariff war between the two nations and an example of the global drive towards semiconductor and AI self-sufficiency. However, news recently broke that Trump had approved the sale of more advanced hardware, but with an additional 15% tax on the profits companies like Nvidia and AMD made doing so.\n\nThe new Nvidia CPU would come under that tax, though it would likely be incredibly profitable anyway. Although China is looking to source more of its data center hardware from domestic sources, there's still no beating Nvidia's top chips for raw compute power. The B30A, although a far cry from what American data centers could run with the B300, would still be a considerable upgrade over what is currently available and many generations ahead of any Chinese-developed counterparts.\n\nThe B30A will reportedly use a single-die design rather than the dual-chip layout of the B300, thereby cutting performance in half at least. The final specifications for the B30A have yet to be finalized, so Nvidia may make additional tweaks to improve or curtail performance using clock speeds or adjusting available core counts, depending on the business and political environment at the time of their release.\n\nThat is a consideration that all major chip developers, and particularly chip exporters, need to consider under the current US administration. With tariffs changing at arbitrary times to arbitrary rates, as well as the potential for entire export blocks and additional taxes, it's a turbulent time to be selling high-end silicon. However, the demand is enormous, so even with these concerns, Nvidia, AMD, Intel, and other companies are all well placed to make incredible profits in the years to come.",
  "medium": "Article",
  "links": [
    "https://www.extremetech.com/computing/china-frets-over-nvidia-h20-ai-chips-nvidia-denies-any-backdoors-or-tracking",
    "https://www.reuters.com/world/china/nvidia-working-new-ai-chip-china-that-outperforms-h20-sources-say-2025-08-19/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Nvidia",
      "weight": 0.08170023
    },
    {
      "name": "arbitrary times",
      "weight": 0.07314034
    },
    {
      "name": "Blackwell Ultra B300",
      "weight": 0.07128509
    },
    {
      "name": "additional taxes",
      "weight": 0.07031804
    },
    {
      "name": "additional tweaks",
      "weight": 0.069897
    },
    {
      "name": "available core counts",
      "weight": 0.069325164
    },
    {
      "name": "existing H20 platforms",
      "weight": 0.06887045
    },
    {
      "name": "American data centers",
      "weight": 0.06850003
    },
    {
      "name": "B30A",
      "weight": 0.06492276
    },
    {
      "name": "China",
      "weight": 0.06464933
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.98828125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.75537109375
    },
    {
      "name": "/Computers & Electronics/Computer Hardware/Computer Components",
      "score": 0.61865234375
    }
  ],
  "sentiment": {
    "positive": 0.1903933,
    "negative": 0.37928995,
    "neutral": 0.43031678
  },
  "summary": "Nigigly is reportedly developing a new version of its Blackwell Ultra B300 flagship AI platform for sale in the Chinese market. The B30A will be significantly faster than existing H20 platforms sold to China, but will have half the performance of the B300. This move comes amidst ongoing trade tariff war between the US and China, which has approved the sale of advanced hardware with an additional 15% tax on the profits companies like Nvidia and AMD made. The new B300 will reportedly use a single-die design rather than the dual-chip layout, thereby reducing performance in half. However, while China is looking to source more of its data center hardware from domestic sources, there is no beating Nvidia's top chips for raw compute power.",
  "shortSummary": "Nvidia is developing the B30A, a significantly faster AI platform, for the Chinese market, amid trade tariff tensions and potential profit tax increases.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "bc9905181d9d4e149f9a787bca8d5e3d",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Nvidia is developing a scaled‑down B30A version of its Blackwell Ultra B300 AI platform for the Chinese market, offering roughly half the performance of the flagship but still surpassing existing H20 chips. The new chip will fall under a 15% tax on profits from sales to China, yet remains highly profitable. China’s push for domestic data‑center hardware cannot yet match Nvidia’s compute power, and the B30A’s single‑die design may allow Nvidia to adjust performance through clock speeds or core counts. Despite unpredictable U.S. tariffs and potential export blocks, the high demand for AI hardware keeps Nvidia, AMD, Intel and others poised for significant profits.",
  "argos_id": "11RM3G2RV"
}