{
  "url": "https://www.bbc.com/news/articles/c707k5wneygo?at_medium=RSS&at_campaign=rss",
  "authorsByline": "Danny Fullbrook",
  "articleId": "fe5067cad098497097bb0eea5aab2f6f",
  "source": {
    "domain": "bbc.com",
    "paywall": false,
    "location": {
      "country": "gb",
      "state": "",
      "county": "",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/4826/live/6172cf80-7e6b-11f0-90b7-f1a1efbee763.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T11:32:54.746000+00:00",
  "addDate": "2025-08-21T12:08:07.371300+00:00",
  "refreshDate": "2025-08-21T12:08:07.371303+00:00",
  "score": 1.0,
  "title": "Iver landfill data centre subject of legal action by campaigners",
  "description": "Campaigners are raising concerns about the environmental impact of the facility.",
  "content": "Campaigners are taking legal action over the government's decision that a large data centre should be built. In June 2024, Buckinghamshire Council rejected plans for the facility at the Woodlands Park landfill site in Iver over concerns it would damage the green belt environment. However, following an appeal by the developer, the government overturned the council's decision and granted planning permission. Not-for-profit company Foxglove and charity Global Action Plan have complained that the environmental impact has not been properly considered.\n\nThe two campaign groups say they have submitted a planning appeal under Section 288 of the Town and Country Planning Act 1990. They fear the site, which would be built across 775,000 sq ft (72,000 sq m), would strain local energy supply because of its use of the local substation. They also suspect it would drive up energy prices. The project should be subject to an environmental impact assessment, they said, and they criticised the government for not considering projected water consumption. Foxglove co-executive director Rosa Curling said: \"Local people and businesses in Buckinghamshire will soon be competing with a power guzzling-behemoth to keep the lights on, which as we've seen in the states, usually means sky-high prices. The government decision was made by Housing Minister Matthew Pennycook, on behalf of Housing Secretary Angela Rayner, who is also deputy prime minister. Global Action Plan's head of campaigns Oliver Hayes added: \"The deputy prime minister's lack of meaningful scrutiny of this application has serious consequences for people in Buckinghamshire and sends a worrying signal to communities across the country that more and bigger data centres are inevitable.\"\n\nThe UK is home to an estimated 477 data centres, which are giant warehouses filled with technology used to power digital services such as streaming and online banking. Pennycook acknowledged the potential landscape effects but argued this was outweighed by the need for data centres. The government had already granted planning permission for a data centre in Court Lane, Iver, in December 2024, and another in Abbots Langley, Hertfordshire, in May 2025. Figures seen by the BBC show the number of data centres in the UK are expected to increase by almost a fifth.",
  "medium": "Article",
  "links": [
    "https://www.instagram.com/bbc3cr",
    "https://www.bbc.co.uk/sounds/curation/p0cjf099",
    "https://www.westlondontechpark.com/",
    "https://www.facebook.com/BBCBedsHertsBucks/",
    "https://www.foxglove.org.uk/",
    "https://www.bbc.co.uk/news/articles/c3rqvd9lde8o",
    "https://x.com/BBC3cr",
    "https://www.greystoke.co.uk/",
    "https://www.globalactionplan.org.uk/",
    "https://www.gov.uk/government/publications/recovered-appeal-woodlands-park-landfill-site-land-south-of-slough-road-iver-buckinghamshire-ref-3347353-9-july-2025",
    "https://www.bbc.co.uk/news/articles/c7285e02qy4o",
    "https://www.bbc.com/news/topics/c1kr6zzegxzt",
    "https://www.legislation.gov.uk/ukpga/1990/8/contents",
    "https://www.bbc.co.uk/news/articles/clyr9nx0jrzo"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "data centres",
      "weight": 0.10444116
    },
    {
      "name": "Iver landfill data centre",
      "weight": 0.10432422
    },
    {
      "name": "charity Global Action Plan",
      "weight": 0.07031298
    },
    {
      "name": "Local people",
      "weight": 0.06918265
    },
    {
      "name": "local energy supply",
      "weight": 0.06874487
    },
    {
      "name": "Global Action Plan",
      "weight": 0.06863253
    },
    {
      "name": "deputy prime minister",
      "weight": 0.06818526
    },
    {
      "name": "Foxglove co-executive director Rosa Curling",
      "weight": 0.06618169
    },
    {
      "name": "Buckinghamshire Council",
      "weight": 0.064400256
    },
    {
      "name": "Housing Minister Matthew Pennycook",
      "weight": 0.06415655
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.95263671875
    },
    {
      "name": "/Business & Industrial/Construction & Maintenance/Other",
      "score": 0.916015625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.9091796875
    },
    {
      "name": "/News/Local News",
      "score": 0.82861328125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.373779296875
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Waste Management",
      "score": 0.3720703125
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Other",
      "score": 0.3525390625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.3388671875
    }
  ],
  "sentiment": {
    "positive": 0.044539265,
    "negative": 0.7340794,
    "neutral": 0.22138134
  },
  "summary": "Campaigners are taking legal action against the UK government's decision to allow a large data centre at the Woodlands Park landfill site in Iver, which was initially rejected by Buckinghamshire Council due to concerns it would damage the green belt environment. Following an appeal by the developer, the government granted planning permission. Not-for-profit company Foxglove and charity Global Action Plan have complained that the environmental impact of the project has not been properly considered. They fear it would strain local energy supply and increase energy prices. The decision was made by Housing Minister Matthew Pennycook on behalf of Housing Secretary Angela Rayner, who is also deputy prime minister.",
  "shortSummary": "Campaigners are suing the government for allowing a large data centre at Iver, citing inadequate environmental impact and potential energy shortages.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "fc8a5826b24d41a8b6081acb8189bdd7",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.bbc.co.uk/news/articles/clyr9nx0jrzo",
      "text": "Data centres to be expanded across UK as concerns mount\n- Published\nThe number of data centres in the UK is set to increase by almost a fifth, according to figures shared with BBC News.\nData centres are giant warehouses full of powerful computers used to run digital services from movie streaming to online banking - there are currently an estimated 477 of them in the UK.\nConstruction researchers Barbour ABI have analysed planning documents and say that number is set to jump by almost 100, as the growth in artificial intelligence (AI) increases the need for processing power.\nThe majority are due to be built in the next five years. However, there are concerns about the huge amount of energy and water the new data centres will consume.\nSome experts have warned it could drive up prices paid by consumers.\nMore than half of the new data centres would be in London and neighbouring counties.\nMany are privately funded by US tech giants such as Google and Microsoft and major investment firms.\nA further nine are planned in Wales, one in Scotland, five in Greater Manchester and a handful in other parts of the UK, the data shows.\nWhile the new data centres are mostly due for completion by 2030, the biggest single one planned would come later - a £10bn AI data centre in Blyth, near Newcastle, for the American private investment and wealth management company Blackstone Group.\nIt would involve building 10 giant buildings covering 540,000 square metres - the size of several large shopping centres - on the site of the former Blyth Power Station.\nWork is set to begin in 2031 and last for more than three years.\nMicrosoft is planning four new data centres in the UK at a total cost of £330m, with an estimated completion between 2027 and 2029 - two in the Leeds area, one near Newport in Wales, and a five-storey site in Acton, north-west London.\nAnd Google is building a data centre in Hertfordshire, an investment worth £740m, which it says will use air to cool its servers rather than water.\nBy some analyses, the UK is already the third-largest nation for data centres behind the US and Germany.\nThe government has made clear it believes data centres are central to the UK's economic future - designating them critical national infrastructure.\nBut there are concerns about their impact, including the potential knock-on effect on people's energy bills.\nIt is not known what the energy consumption of the new centres will be as this data is not included in the planning applications, but US data suggests they can be considerably more powerful than older ones.\nDr Sasha Luccioni, AI and climate lead at machine learning firm Hugging Face, explains that in the US \"average citizens in places like Ohio are seeing their monthly bills go up by $20 (£15) because of data centres\".\nShe said the timeline for the new data centres in the UK was \"aggressive\" and called for \"mechanisms for companies to pay the price for extra energy to power data centres - not consumers\".\nAccording to the National Energy System Operator, NESO, the projected growth of data centres in Great Britain could \"add up to 71 TWh of electricity demand\" in the next 25 years, which it says redoubles the need for clean power - such as offshore wind.\nBruce Owen, regional president of data centre operator Equinix, said the UK's high energy costs, as well as concerns around lengthy planning processes, were prompting some operators to consider building elsewhere.\n\"If I want to build a new data centre here within the UK, we're talking five to seven years before I even have planning permission or access to power in order to do that,\" he told BBC Radio 4's Today programme.\n\"So you're starting to see some of these AI workloads move into other countries, where the UK has always been a very important hub.\"\nUK deputy prime minister Angela Rayner has overturned some local councils' rejection of planning permission for data centres, citing their importance to the country's infrastructure and the government's growth push.\n'Fixated with sustainability'\nThere are also growing concerns about the environmental impact of these enormous buildings.\nMany existing data centre plants require large quantities of water to prevent them from overheating - and most current owners do not share data about their water consumption.\nStephen Hone, chief executive of industry body the Data Centre Alliance, says \"ensuring there is enough water and electricity powering data centres isn't something the industry can solve on its own\".\nBut he insisted \"data centres are fixated with becoming as sustainable as possible\", such as through dry-cooling methods.\nSuch promises of future solutions have failed to appease some.\nIn Potters Bar, Hertfordshire, residents are objecting to the construction of a £3.8bn cloud and AI centre on greenbelt land, describing the area as the \"lungs\" of their home.\nAnd in Dublin there is currently a moratorium on the building of any new data centres because of the strain existing ones have placed on Ireland's national electricity provider.\nIn 2023 they accounted for one fifth of the country's energy demand.\nLast month, Anglian Water objected to plans for a 435-acre data centre site in North Lincolnshire. The developer says it aims to deploy \"closed loop\" cooling systems which would not place a strain on the water supply.\nThe planning documents suggest that 28 of the new data centres would be likely to be serviced by troubled Thames Water, including 14 more in Slough, which has already been described as having Europe's largest cluster of the buildings.\nThe BBC understands Thames Water was talking to the government earlier this year about the challenge of water demand in relation to data centres and how it can be mitigated.\nWater UK, the trade body for all water firms, said it \"desperately\" wants to supply the centres but \"planning hurdles\" need to be cleared more quickly.\nTen new reservoirs are being built in Lincolnshire, the West Midlands and south-east England.\nA spokesperson for the UK government said data centres were \"essential\" and an AI Energy Council had been established to make sure supply can meet demand, alongside £104bn in water infrastructure investment.\nAdditional reporting by Tommy Lumby\nGet in touch\nDo you live near a proposed new data centre? Do you think they are good or bad for your community?\n- Published10 July\n- Published26 March 2024\n- Published12 September 2024\nSign up for our Tech Decoded newsletter to follow the world's top tech stories and trends. Outside the UK? Sign up here."
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/c3rqvd9lde8o",
      "text": "Rejected data centre gets approval after appeal\n- Published\nRejected plans to build a data centre on green belt land have been approved by the housing secretary after an appeal.\nAngela Rayner stepped in to push through Affinius Capital's proposals for the 65,000 sq m (700,000 sq ft) site at the Court Lane Industrial Estate in Iver, Buckinghamshire.\nThe deputy prime minister's decision overturns Buckinghamshire Council's decision to refuse the plans in October last year.\nThe site earmarked for the data centre, currently of mixed industrial use, is east of the M25 and bordered by the Grand Union Canal, as well as sewage and water treatment works.\nThe decision to approve the site was made on Rayner's behalf by housing and planning minister Matthew Pennycook, according to Local Democracy Reporting Service.\nPublished earlier this month, the judgement cites economic reasons, including the creation of 200 construction jobs, with a further 90 to operate the site once open, as among the justifications for the new tech hub.\nData centres are huge warehouses full of computers, supporting services like artificial intelligence (AI) and streaming.\nIn September, the new Labour government designated them as \"critical national infrastructure\", giving them the same importance and protections as water, energy and emergency services.\nPennycook acknowledged the proposed Iver data centre conflicted with green belt policy but said the factors in favour of the proposal included the need for new data centres, the re-use of previously developed land and investment and job creation.\nGet in touch\nDo you have a story suggestion for Beds, Herts & Bucks?\nFollow Beds, Herts and Bucks news on BBC Sounds, Facebook, external, Instagram, external and X, external.\nRelated topics\n- Published27 June 2024\n- Published17 December 2024\n- Published12 September 2024"
    },
    {
      "url": "https://www.bbc.com/news/topics/c1kr6zzegxzt",
      "text": "Iver1 hr agoGovernment faces legal challenge over data centreCampaigners are raising concerns about the environmental impact of the facility.1 hr ago12 Jun 2025Council cracks down on motorists for litteringA council has started using new enforcement powers to fine drivers a maximum £500 for littering.12 Jun 20257 Apr 2025Robbers jailed after axe attack on shopkeeperThe victim is dealing with life-changing injuries after one of the men hit him during the raid.7 Apr 202514 Jan 2025Man dies after Ferrari crashes into treePolice describe the single-vehicle collision as tragic.14 Jan 20254 Jan 2025'I knew that if I died I'd have a million regrets'Georgie Swallow says she used to feel insecure, but a cancer diagnosis changed her perspective.4 Jan 202520 Dec 2024Rejected data centre gets approval after appealA decision by Buckinghamshire Council is overturned by the housing secretary.20 Dec 20243 Apr 2024For sale: The mansion seized from £70m scammerA fraudster's confiscated luxury home is put on the market with a guide price of £2.75m.3 Apr 202427 Nov 2023Rail worker warns of 'danger to life' cracked tracksThe damaged rails are found at three locations on one of the busiest train lines in the country.27 Nov 202322 Aug 2023Companies admit £70m postal fraud conspiracyThe firms falsely declared the quantity, class and weight of mail for nine years, a court hears.22 Aug 2023..."
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/c7285e02qy4o",
      "text": "Fears 'data centre' near M25 would damage green belt\n- Published\nA council has refused plans for a data centre near the M25 because of concerns it would damage the green belt.\nDevelopers wanted to build a 775,000 sq feet (72,000 sq m) centre on a former landfill site near the village of Iver, in Buckinghamshire.\nBuckinghamshire Council planning officers said it would harm the green belt - an area free of development to prevent urban sprawl - in \"both spatial and visual terms\".\nBut the applicants said the centre - which would house computer servers - would create jobs and boost biodiversity.\nLetters of objection\nThe plan, on land between a river and the M25, was submitted by Greystoke Land and the UK arm of the construction giant Altrad.\nIt included offices, back-up generators, fuel storage, cycle and car parking and other infrastructure.\nA design statement said it would be \"landscape-led\" and buildings would have \"living green walls\".\nPlans for a bigger centre on the same site had been turned down in 2023.\nSixty three letters objecting to the latest proposal were sent to to the council.\nFollow Beds, Herts and Bucks news on Facebook, external, Instagram, external and X, external. Got a story? Email eastofenglandnews@bbc.co.uk, external or WhatsApp us on 0800 169 1830\nRelated topics\nMore M25 stories\n- Published23 June 2024\n- Published10 June 2024\n- Published17 June 2024"
    },
    {
      "url": "https://www.westlondontechpark.com/",
      "text": "top of page\nBoosting Britain’s economic growth\nDeveloping the UK’s data economy\nBuilding our digital infrastructure\nWest London Technology Park is a proposed data centre campus located between Uxbridge and Iver.\nHyperscale data centres are required for all forms of cloud computing including video streaming, picture storage, online shopping, online medical consultations and the internet of things.\nIn September 2024 the Government designated data centres as Critical National Infrastructure, confirming their importance to the UK economy.\nEconomic benefits\nWest London Technology Park will bring substantial benefits to the UK economy. These include £1 billion of foreign direct investment and up to £350m of new economic activity annually across London and the South East.\nAround 230 well-paid jobs will be created at the data centre and many more supported beyond the immediate vicinity.\nFailing to build at West London Technology Park and other similar locations will mean employers and investors will look to Amsterdam, Dublin, Frankfurt and Paris instead.\n£1bn foreign direct investment\n£350m new economic activity supported annually\n230 full-time jobs created locally\nMany more jobs supported nationally\nLocation\nCloud data centres have very specific technical requirements in terms of fibre connections, power and proximity to other data centres.\nWest London Technology Park is ideally positioned on the UK’s long–haul fibre network and is close to existing data centres in Stockley Park and Slough.\nThe nationally–significant campus will be built on degraded land. The site is a historic landfill which is bordered by the eight-lane M25 to the west, to the east by the West London Industrial Estate, and to the north by Iver substation.\nProposals\nWest London Technology Park will transform the former landfill into a state-of-the art data centre.\nGenerous green spaces will cover the majority of the site area, enhancing the visual appeal of the landscape.\nIts two carefully-designed buildings will be almost entirely screened by trees and landscaping. Plants will grow on the living walls and the landscaping and ponds will significantly improve biodiversity.\nMedia enquiries: media@westlondontechpark.com\nbottom of page"
    }
  ],
  "argos_summary": "Campaigners from Foxglove and Global Action Plan have launched a Section 288 appeal after the UK government overturned Buckinghamshire Council’s rejection of a 775,000‑sq‑ft data centre at Woodlands Park landfill, citing economic benefits and job creation. They argue the project will strain local energy supply, drive up electricity prices, and has not undergone a proper environmental impact assessment, particularly regarding water consumption. The case highlights growing national concerns as the UK’s data‑centre count is set to rise by almost a fifth, with critics warning that the sector’s high energy and water demands could burden consumers and the environment. The government, designating data centres as critical national infrastructure, has defended the approvals as essential for the country’s digital economy.}",
  "argos_id": "28BQ5FOBH"
}