{
  "url": "https://finance.yahoo.com/news/3-dow-stocks-set-soar-155500380.html?_guc_consent_skip=1755793742",
  "authorsByline": "Rick Munarriz, The Motley Fool",
  "articleId": "41542d529c534cc39b429c895f1973aa",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/motleyfool.com/1e53da73811fa91382b189a5e414bcb7",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T15:55:00+00:00",
  "addDate": "2025-08-21T16:32:00.511525+00:00",
  "refreshDate": "2025-08-21T16:32:00.511526+00:00",
  "score": 1.0,
  "title": "These 3 Dow Stocks Are Set to Soar in 2025 and Beyond",
  "description": "In a pool of 30 high-profile investments, let's take a look at the ones with the best chances to beat the market.",
  "content": "• Growth is accelerating again at Amazon, and that makes the recent Dow 30 inductee worth watching.\n• Coca-Cola has a long streak of dividend hikes with a payout ratio that has actually moved lower in recent years.\n• Disney's forward earnings multiple in the high teens could be even lower if just some of its latest moves pay off.\n• 10 stocks we like better than Amazon › Amazon (NASDAQ: AMZN), Coca-Cola (NYSE: KO), and Walt Disney (NYSE: DIS) are some of the country's most popular consumer brands. They also happen to make up a tenth of the Dow Jones Industrial Average (DJINDICES: ^DJI). I have nothing against the other 90% of the stocks make up the widely tracked 30-stock index, but I'll stick with Amazon, Coca-Cola, and Disney. They are three of the Dow 30 stocks that I think are positioned well to soar for the rest of 2025 and beyond. Let's take a closer look. It's hard to believe that the world's leading online retailer didn't punch its card to get into the Dow 30 until last year, but it's up a brisk 28% since the induction 18 months ago. The index is up less than 15% in that time, so the Amazon expedition is paying off so far for the Dow 30. Amazon's inclusion comes as growth slows for the dot-com icon. It has an applause-worthy run of growing its net sales by 9% or better in each of its first 28 years of trading, but it's been clinging to the low end of that range in recent years. Its top line has risen by 9% to 12% in each of the last three years, and it kicked off 2025 in uninspiring fashion when net sales climbed a mere 8.6% higher. It seemed as if the Dow 30 was too late on Amazon, but last month we saw a surprising acceleration of growth. Net sales rose 13% for Amazon's second quarter, which it announced at the end of last month. An 11% increase for its North American segment sales was nice, but the 16% jump in its international business -- fueled partly by a sluggish dollar -- was even better. The real star continues to be its high-margin Amazon Web Services (AWS) cloud business, up 18% for the quarter. It's just 18% of the revenue mix for Amazon, but it brought in more than half of the company's operating profit. The bottom line fared even better. Net income per share rose 33% to $1.68 a share. It was another double-digit percentage earnings beat for Amazon. Three months ago the e-tailing behemoth was forecasting just a 4% increase in operating profit on a 7% to 11% year-over-year bump in net sales. Business keeps accelerating for Amazon.\n\nThe stock isn't cheap if you consider that it's trading for nearly 30 times next year's earnings. It's fetching nearly 4 times trailing net sales, a stiff multiple for retail stocks but a bargain if you focus on the AWS business that also makes it a tech services company. You have to like how Amazon is starting to accelerate its business again. Its guidance for the current quarter calls for net sales to rise 10% to 13%. The way it blew the cover off the ball last time, it shouldn't surprise anyone if its top line finds a way to rise in the mid-teens for the first time in three years. It's putting the \"magnificent\" in the \"Magnificent Seven.\" Turning to a bubbly stock, Coca-Cola is the undisputed global leader in the realm of pop. It's also a global juggernaut among beverage stocks with 30 different brands generating more than $1 billion in annual sales each. You didn't think that Coca-Cola was just about the namesake beverage, did you? Coca-Cola is a high-margin business with a long string of positive profit surprises. It's not just a reliable source of sugary escapism or hydration. Income investors collecting today's 2.9% yield know that they can bank on this Dividend King to continue boosting its payouts the way it has for 63 straight years. With a trailing payout ratio of 69%, there is more than enough wiggle room to stretch that streak to 64 next year. There are some legitimate concerns about soda consumption trends, but Coca-Cola loves to climb that wall of worry. Revenue should climb for the fifth year in a row in 2025. I couldn't write about my favorite Dow 30 stocks without mouse droppings. Disney is the global entertainment leader that also happens to operate the world's most popular theme parks. It's a historical laggard. It has delivered just three fiscal years of double-digit revenue growth in this millennium. This might not seem to make it a good time to invest in Disney, but the future is brighter than its storied past. Disney is getting back into a good groove at the multiplex after putting out the world's three biggest movies last year. Its theme parks have been generating strong results coming out of the pandemic. Disney+ is now profitable, dramatically boosting the media stock's bottom line. Its latest tweak -- today's launch of the new ESPN streaming service -- is another sign that a company that many figured would be disrupted is doing the disrupting. At 18 times forward earnings it's also the cheapest of these three stocks. It's time to come home to the House of Mouse. Should you invest $1,000 in Amazon right now? Before you buy stock in Amazon, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Consider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $654,624!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,075,117!* Now, it’s worth noting Stock Advisor’s total average return is 1,052% — a market-crushing outperformance compared to 183% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join Stock Advisor. Rick Munarriz has positions in Walt Disney. The Motley Fool has positions in and recommends Amazon and Walt Disney. The Motley Fool has a disclosure policy. These 3 Dow Stocks Are Set to Soar in 2025 and Beyond was originally published by The Motley Fool",
  "medium": "Article",
  "links": [
    "https://www.fool.com/investing/stock-market/indexes/dow-jones/companies-in-the-dow/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=62709709-4d45-40dd-9a23-1492d031550d",
    "https://www.fool.com/investing/2025/08/05/i-cant-lie-im-excited-about-amazon-stock-after-th/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=62709709-4d45-40dd-9a23-1492d031550d",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=e820b967-4c8b-4a1a-8021-4b45752a272c&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001088%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D17500%26ftm_veh%3Darticle_pitch_feed_yahoo%26company%3DAmazon&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=62709709-4d45-40dd-9a23-1492d031550d",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=6141dc48-dec8-40b7-87d8-8f48c93b63cd&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000053%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_yahoo%26ftm_pit%3D17670",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=e820b967-4c8b-4a1a-8021-4b45752a272c&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001088%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_yahoo%26ftm_pit%3D17500&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=62709709-4d45-40dd-9a23-1492d031550d",
    "https://www.fool.com/investing/2025/08/21/these-3-dow-stocks-are-set-to-soar-in-2025-and-bey/",
    "https://www.fool.com/legal/fool-disclosure-policy/",
    "https://www.fool.com/author/1280/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "last year",
      "weight": 0.08046761
    },
    {
      "name": "beverage stocks",
      "weight": 0.07339027
    },
    {
      "name": "recent years",
      "weight": 0.07285493
    },
    {
      "name": "stock",
      "weight": 0.07220177
    },
    {
      "name": "Amazon",
      "weight": 0.07182584
    },
    {
      "name": "retail stocks",
      "weight": 0.07167622
    },
    {
      "name": "Net sales",
      "weight": 0.07149423
    },
    {
      "name": "net sales",
      "weight": 0.07149423
    },
    {
      "name": "next year",
      "weight": 0.070382364
    },
    {
      "name": "year",
      "weight": 0.069206424
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97998046875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.955078125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9482421875
    }
  ],
  "sentiment": {
    "positive": 0.68765867,
    "negative": 0.111438,
    "neutral": 0.20090333
  },
  "summary": "Amazon (NASDAQ: AMZN), Coca-Cola (NYSE: KO), and Walt Disney are among the top consumer brands in the Dow Jones Industrial Average (DJINDICES: ^DJI). These stocks make up a tenth of the popular consumer brands that make up the Dow 30. Amazon's growth is accelerating again, with net sales rising by 13% for the second quarter and its international business seeing an increase of 16%. CocaCola has a long streak of dividend hikes and a payout ratio that has been decreasing in recent years, while Disney's forward earnings multiple could be even lower if some of its latest moves prove to be successful. The company's high-margin Amazon Web Services (AWS) cloud business, up 18% for Q2, was the standout performance. Amazon shares are trading for nearly 30 times next year's earnings and nearly 4 times trailing net sales, a stiff multiple for retail stocks, but a bargain if you focus on the AWS business. Despite concerns about soda consumption trends, there are some concerns about the company's double-digit revenue growth in the future. Disney's future is brighter than the past three fiscal years, but it has delivered just three consecutive years of double digit revenue growth.",
  "shortSummary": "Amazon, Coca-Cola, and Disney are poised to soar in the next decade due to accelerating growth, strong dividends, and strong profit surprises, making up a tenth of the Dow 30.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "49f9c2be18a8479aa36ac9151fc9df0d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/investing/2025/08/05/i-cant-lie-im-excited-about-amazon-stock-after-th/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=62709709-4d45-40dd-9a23-1492d031550d",
      "text": "I get it. I do. Investors aren't accustomed to seeing Amazon (AMZN -0.97%) struggle. That's why Amazon stock fell more than 8% on Friday following Thursday's post-close release of its second-quarter numbers, which included disappointing earnings guidance hinting at headwinds on the artificial intelligence front.\nWhat if, however, the market's misreading the matter?\nI contend this is the case, which makes the stock's recent setback a fantastic buying opportunity. Here's the deal.\n(Some of) the numbers suggest Amazon is falling behind in AI\nFor any investors who've not yet heard (or as a refresher for those who have), for the three-month stretch ending in June Amazon turned $167.7 billion worth of revenue into a per-share profit of $1.68. That's well up from the year-ago comparisons of $148 billion and $1.26 per share, and better than analysts' estimates for a top line of $162.2 billion and per-share bottom line of $1.33. Its cloud computing arm did well too. Amazon Web Services' revenue grew 17% to $60.1 billion, $21.7 billon of which became operating income.\nAmazon's cloud business's growth pace, however, was also a key reason for Friday's stumble. It trailed the cloud computing growth reported by Microsoft (MSFT 0.13%) and Alphabet (GOOG 0.30%) (GOOGL 0.33%) for the same three-month stretch. Microsoft's cloud business grew 26% year over year last quarter, while Google Cloud's sales were up nearly 32% in Q2. Investors panicked, interpreting this stark difference in growth rates as a sign that Amazon is falling behind its AI competitors.\nThe wording of CEO Andy Jassy's thoughts on the current status of Amazon Web Services (AWS) made during the quarterly earnings conference call didn't help. Specifically, investors read doubt into his comment \"We could be doing more revenue and helping customers more, and we are working very hard on changing that outcome and how much capacity we have.\"\nAnd Q3's guidance only stoked these worries. Although companywide revenue for the quarter now underway should roll in between $174 billion and $179.5 billion versus analysts' consensus estimate of $173.1 billion, Amazon's Q3 operating income is only apt to be somewhere between $15.5 billion and $20.5 billion. That doesn't compare favorably to FactSet's consensus expectation of $19.5 billion. Amazon stock tanked as a result.\nInvestors are seeing things all wrong, though.\nThe rest of the story\nNo, Amazon's cloud business didn't grow nearly as fast as Google's or Microsoft's did during the second quarter of this year.\nThere's an important detail, however, being left out of the discussion. That's the fact that AWS is more than twice as big as either of the two top rivals. In fact, data compiled by Synergy Research Group indicates that with its 30% share of the global cloud market's total revenue, Amazon's cloud business is 50% bigger than next-nearest Microsoft. And while Microsoft's total Q2 cloud revenue improved year over year, it's been losing market share since early last year. Amazon's share at least ticked a little higher last quarter.\nThe bigger \"so what?\" is the mathematics of the matter. While Alphabet (Google) and Microsoft may have produced more relative growth with their respective cloud businesses than Amazon did, it's mathematically easier to grow from a smaller comparison than a larger one. On an absolute dollar basis, AWS technically did outgrow its rivals.\nLet's also not look past Synergy's data reminding us that AWS is still the planet's single-biggest cloud business. There's a reason it's been able to hold on to this lead.\nAnd for what it's worth, several analysts made the same observation following Thursday's release of Amazon's second-quarter numbers. Wedbush analyst Scott Devitt noted, \"While we understand the reaction in shares after-hours, we do not believe the company's longer-term opportunity is impaired, and our thesis remains intact.\" Meanwhile, although RBC Capital Markets analyst Brad Erickson concedes, \"this was an uncharacteristic setback quarter that will take some time to recover from,\" adding \"we believe in the company being able to maintain, if not accelerate, AWS growth over time, which should help restore investor faith in capitalizing on the AI opportunity.\"\nThere's good reason for this optimism too. During the call Jassy touted the company's relatively new AI-agent technology as well as its recently launched AI-powered virtual digital assistant Alexa+, which is also an advertising platform. These solutions don't suggest Amazon is actually falling behind in AI. Indeed, as CFO Brian Olsavsky pointed out in his discussion of the quarterly results, Amazon's cloud backlog now stands at a hefty $195 billion, up 25% from year-earlier levels.\nAWS' chief challenge right now? Mostly just a lack of access to the amount of electricity that data centers need.\nEven then, however, the company's helping itself. For instance, last year it began offering data center customers access to Arm Holdings' Graviton4 processor, which consumes up to 60% less power than comparable alternative processors.\nWorth it, if you can stomach it\nNone of this guarantees Amazon shares will be easy to own in the immediate future, of course. Echoing a sentiment from RBC's Brad Erickson, Wedbush analyst Scott Devitt believes \"in the coming quarters, we expect concerns around the intermediate-term trajectory of AWS growth rate and margin could remain an overhang on shares as investors contemplate the rising perception of AWS as a laggard in the AI space.\"\nIn other words, newcomers could be in for a bumpy, sometimes-scary ride for a while.\nBut as the old adage goes, fortune favors the bold.\nThis might help bolster your confidence: While Amazon's Q3 profit guidance of $18.5 billion (at the midpoint of its suggested range) may have been shy of analysts' expectations, that's still above last year's third-quarter operating income of $17.4 billion. It's also a pretty safe bet that Amazon is being purposely conservative with its profit outlook, as it has by an average of about $2 billion per quarter for the past several quarters. Investors are just too distracted by the noisy headlines to remember."
    },
    {
      "url": "https://www.fool.com/investing/stock-market/indexes/dow-jones/companies-in-the-dow/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=62709709-4d45-40dd-9a23-1492d031550d",
      "text": "For many casual investors, the Dow Jones Industrial Average (DJINDICES:^DJI) is the stock market. This index of 30 blue chip companies has been shorthand for the broad market since it was first published in 1896.\nAlthough there are better barometers for the performance of the overall stock market, even today the Dow tends to get first billing over other indexes such as the Nasdaq (NASDAQINDEX:^IXIC) and the S&P 500 (SNPINDEX:^GSPC) on newscasts and financial news websites.\nWhat companies are in the Dow?\nWhat companies are in the Dow?\nThe Dow Jones Industrial Average has been made up of 30 companies since 1928, which is why it's also known as the Dow 30. Even though it's called the Dow Jones Industrial Average, distinguishing it from other Dow Jones indexes such as the Dow Jones Transportation Average, the word \"industrial\" is an anachronism.\nThe index was once made up of industrial companies such as manufacturers and agricultural companies, but today it's a diverse snapshot of the stock market, containing representatives from almost every major stock market sector, including technology, consumer goods, healthcare, and energy, as well as industrials. The only exceptions are transportation and utilities, which have their own Dow Jones indexes.\nAccording to S&P Global (SPGI -0.62%), which operates both the Dow Jones and the S&P 500, there are few specific requirements for Dow components. They must be members of the S&P 500, which comes with its own set of requirements, including being based in the U.S. and being profitable at the time of admission. S&P Global has said that a stock is admitted to the Dow 30 \"only if the company has an excellent reputation, demonstrates sustained growth, and is of interest to a large number of investors.\"\nThe Dow index is price-weighted, meaning that each stock's impact on the index is determined by its share price. As a result, companies may be excluded based on a share price that is too high -- for example, in the $1,000 range -- or too low. The index managers also strive for a balance across sectors.\nThere is no set protocol for changing Dow components, but S&P Global has refreshed the index every few years by pulling two or three stocks and adding new ones. The company says that can happen because of \"corporate actions\" or \"market developments.\"\nDow companies tend to be well-known, mature companies with leading market positions. The chart below shows the 30 companies currently in the Dow Jones Industrial Average.\n| Company | Market Cap | Description |\n|---|---|---|\n| Amazon (NASDAQ:AMZN) | $1.8 trillion | E-commerce and cloud computing giant. |\n| American Express (NYSE:AXP) | $179 billion | Credit card and financial services company. |\n| Amgen (NASDAQ:AMGN) | $177.7 billion | A biotech company treating diseases such as cancer, heart disease, and kidney disorders. |\n| Apple (NASDAQ:AAPL) | $3.4 trillion | Maker of tech devices, including the iPhone, iPad, and Mac. |\n| Boeing (NYSE:BA) | $100.6 billion | Manufacturer of commercial and military aircraft. |\n| Caterpillar (NYSE:CAT) | $163.3 billion | Manufacturer of construction and mining equipment. |\n| Chevron (NYSE:CVX) | $257.8 billion | Integrated oil and gas company. |\n| Cisco Systems (NASDAQ:CSCO) | $200.2 billion | Maker of internet networking devices. |\n| Coca-Cola (NYSE:KO) | $312.7 billion | World's largest beverage company. |\n| Dow, Inc. (NYSE:DOW) | $36.15 billion | Maker of chemicals, including paint, packaging plastic, and rubber. |\n| Goldman Sachs (NYSE:GS) | $154.9 billion | A leading investment bank and asset management company. |\n| Home Depot (NYSE:HD) | $362.2 billion | A leading retailer of home improvement products. |\n| Honeywell International (NASDAQ:HON) | $133.5 billion | Manufacturer that makes products such as aircraft engines and air conditioners. |\n| Intel (NASDAQ:INTC) | $83.1 billion | Manufacturer of semiconductors. |\n| International Business Machines (NYSE:IBM) | $188 billion | Diversified information technology company. |\n| Johnson & Johnson (NYSE:JNJ) | $402.9 billion | Diversified healthcare company. |\n| JPMorgan Chase (NYSE:JPM) | $624 billion | Large commercial and investment bank. |\n| McDonald's (NYSE:MCD) | $206.6 billion | World's largest restaurant company. |\n| 3M (NYSE:MMM) | $72.6 billion | Conglomerate that makes products from Scotch brand tape to Ace bandages. |\n| Merck (NYSE:MRK) | $293.5 billion | Pharmaceutical and animal health company. |\n| Microsoft (NASDAQ:MSFT) | $3.04 trillion | Leading enterprise software company. |\n| Nike (NYSE:NKE) | $121.5 billion | Leading sportswear company. |\n| Procter & Gamble (NYSE:PG) | $413.3 billion | Maker of household products, including razors, paper products, and cleaning products. |\n| Salesforce.com (NYSE:CRM) | $236.8 billion | Cloud-based enterprise software company. |\n| Travelers (NYSE:TRV) | $52.75 billion | Property and casualty insurance company. |\n| UnitedHealth Group (NYSE:UNH) | $557.9 billion | The largest health insurance company in the U.S. |\n| Verizon (NYSE:VZ) | $174.6 billion | A major telecommunications company. |\n| Visa (NYSE:V) | $545.8 billion | Leading credit card company. |\n| Walmart (NYSE:WMT) | $620.9 billion | World's largest brick-and-mortar retailer. |\n| Walt Disney (NYSE:DIS) | $161.9 billion | Diversified entertainment company. |\nAs you can see, almost all of these companies qualify as mega-cap stocks, with valuations above $100 billion. Many of them are leaders in their sectors, and they represent a wide variety of industries.\nHistory of the Dow\nHistory of the Dow\nThe Dow Jones Industrial Average was created in 1896 by Charles Dow, an editor at The Wall Street Journal, and his business partner, Edward Jones. Before that, they published their first index in 1885, which consisted of 12 railroads and two industrial companies. Those would evolve into the Dow Jones Transportation Average and the Dow Jones Industrial Average.\nWhen the Dow was launched in 1896, it tracked 12 industrial companies, including General Electric (GE 1.48%), which was a Dow component until recently, and a number of companies that no longer exist such as American Tobacco, American Sugar, and Chicago Gas.\nIn 1916, the index expanded from 12 components to 20. It grew to hold 30 companies in 1928, just as it does today. In 1932, the index began to reflect the broader market rather than just industrial stocks, listing companies such as Coca-Cola and Procter & Gamble, which are still part of the index today.\nOver the past decade, the Dow has been reshuffled several times as its managers aimed for it to better reflect the growth of the tech industry as well as the decline of sectors such as energy and raw materials.\nUnderstanding the Dow\nUnderstanding the Dow\nUnlike the Nasdaq and the S&P 500, which are weighted by market cap, the Dow is a price-weighted index, so each stock has a greater influence on the index as its price goes up. For example, a 1% move in a stock trading at $200 a share would move the index twice as much as a 1% move in a stock priced at $100 a share.\nEach company's weight on the index is determined by the Dow Divisor, which is calculated by dividing the total price of all 30 Dow components by the value of the index. Currently, the Dow Divisor is 0.1517. This figure can change frequently for events like stock splits or when new companies are added to the index.\nThe Dow evolved this way because in the days before the personal computer, it was difficult to calculate a market-cap-based index, but it was easy to do a price-weighted one. Although the Dow may not be as accurate as other indexes, its performance generally reflects that of the broad stock market. That shows that the diversification and size of its components make it a convenient way to track the overall stock market.\nShortcomings of the Dow\nShortcomings of the Dow\nThere is no shortage of criticism for the Dow. Many investors believe its price-weighted nature makes it outdated and that there's no reason to use it now that market-cap-weighted indexes like the S&P 500 give a better view of the stock market's performance and are readily available.\nAnother issue with its price-weighted formulation is that high-priced stocks would never be permitted on the index, even if they deserve to be members. Before their stock splits, stocks such as Alphabet (GOOG 0.3%) (GOOGL 0.33%) and Amazon (AMZN -0.97%), even though they are among the most valuable companies in the world, would have never been selected to join the Dow Jones Industrial Average. That's because they both traded for more than $2,000 per share, so they would have severely distorted the index if they were added to it.\nSome critics also believe that 30 companies are too few to adequately reflect the diversity of the stock market. For example, the Dow doesn't include an auto manufacturer or any company from the auto sector. There are also no mining or raw material companies.\nRelated investing topics\nFinally, the Dow has been slower than other indexes to evolve with the fast growth of the technology sector. Although the Dow added Apple back in 2015, Alphabet, Tesla, Meta Platforms (META -1.49%), and Nvidia (NVDA -0.36%), which have a combined market cap of around $7 trillion, are all absent from the index. The tech companies it does contain -- such as Intel (INTC -1.13%) and Cisco (CSCO -0.28%) -- seem like dated legacy players, and both have performed poorly in recent years.\nDespite the criticism, the Dow is still a useful yardstick for measuring stock market performance, especially as many of its components are leading companies. Although it shouldn't be the only index you use to examine the stock market, understanding its strengths and weaknesses and what drives its movements will help you better assess the performance of the overall stock market."
    },
    {
      "url": "https://www.fool.com/investing/2025/08/21/these-3-dow-stocks-are-set-to-soar-in-2025-and-bey/",
      "text": "Amazon (AMZN -0.97%), Coca-Cola (KO -0.16%), and Walt Disney (DIS -0.67%) are some of the country's most popular consumer brands. They also happen to make up a tenth of the Dow Jones Industrial Average (^DJI -0.36%).\nI have nothing against the other 90% of the stocks make up the widely tracked 30-stock index, but I'll stick with Amazon, Coca-Cola, and Disney. They are three of the Dow 30 stocks that I think are positioned well to soar for the rest of 2025 and beyond. Let's take a closer look.\n1. Amazon\nIt's hard to believe that the world's leading online retailer didn't punch its card to get into the Dow 30 until last year, but it's up a brisk 28% since the induction 18 months ago. The index is up less than 15% in that time, so the Amazon expedition is paying off so far for the Dow 30.\nAmazon's inclusion comes as growth slows for the dot-com icon. It has an applause-worthy run of growing its net sales by 9% or better in each of its first 28 years of trading, but it's been clinging to the low end of that range in recent years. Its top line has risen by 9% to 12% in each of the last three years, and it kicked off 2025 in uninspiring fashion when net sales climbed a mere 8.6% higher. It seemed as if the Dow 30 was too late on Amazon, but last month we saw a surprising acceleration of growth.\nNet sales rose 13% for Amazon's second quarter, which it announced at the end of last month. An 11% increase for its North American segment sales was nice, but the 16% jump in its international business -- fueled partly by a sluggish dollar -- was even better. The real star continues to be its high-margin Amazon Web Services (AWS) cloud business, up 18% for the quarter. It's just 18% of the revenue mix for Amazon, but it brought in more than half of the company's operating profit.\nThe bottom line fared even better. Net income per share rose 33% to $1.68 a share. It was another double-digit percentage earnings beat for Amazon. Three months ago the e-tailing behemoth was forecasting just a 4% increase in operating profit on a 7% to 11% year-over-year bump in net sales. Business keeps accelerating for Amazon.\nThe stock isn't cheap if you consider that it's trading for nearly 30 times next year's earnings. It's fetching nearly 4 times trailing net sales, a stiff multiple for retail stocks but a bargain if you focus on the AWS business that also makes it a tech services company. You have to like how Amazon is starting to accelerate its business again. Its guidance for the current quarter calls for net sales to rise 10% to 13%. The way it blew the cover off the ball last time, it shouldn't surprise anyone if its top line finds a way to rise in the mid-teens for the first time in three years. It's putting the \"magnificent\" in the \"Magnificent Seven.\"\n2. Coca-Cola\nTurning to a bubbly stock, Coca-Cola is the undisputed global leader in the realm of pop. It's also a global juggernaut among beverage stocks with 30 different brands generating more than $1 billion in annual sales each. You didn't think that Coca-Cola was just about the namesake beverage, did you?\nCoca-Cola is a high-margin business with a long string of positive profit surprises. It's not just a reliable source of sugary escapism or hydration. Income investors collecting today's 2.9% yield know that they can bank on this Dividend King to continue boosting its payouts the way it has for 63 straight years. With a trailing payout ratio of 69%, there is more than enough wiggle room to stretch that streak to 64 next year.\nThere are some legitimate concerns about soda consumption trends, but Coca-Cola loves to climb that wall of worry. Revenue should climb for the fifth year in a row in 2025.\n3. Disney\nI couldn't write about my favorite Dow 30 stocks without mouse droppings. Disney is the global entertainment leader that also happens to operate the world's most popular theme parks. It's a historical laggard. It has delivered just three fiscal years of double-digit revenue growth in this millennium. This might not seem to make it a good time to invest in Disney, but the future is brighter than its storied past.\nDisney is getting back into a good groove at the multiplex after putting out the world's three biggest movies last year. Its theme parks have been generating strong results coming out of the pandemic. Disney+ is now profitable, dramatically boosting the media stock's bottom line. Its latest tweak -- today's launch of the new ESPN streaming service -- is another sign that a company that many figured would be disrupted is doing the disrupting. At 18 times forward earnings it's also the cheapest of these three stocks. It's time to come home to the House of Mouse."
    },
    {
      "url": "https://www.fool.com/legal/fool-disclosure-policy/",
      "text": "Here at The Motley Fool, when it comes to matters of money, we believe in transparency and accountability. Day in and day out, we dedicate ourselves to delivering responsible investing ideas and sound financial education. That's why, when it comes to talking about stocks, we think it's important that you know exactly where we're coming from. With this in mind, we have developed a company-wide disclosure policy to guide our business and communications. We call it Fool Disclosure. We invite you to take some time to read through it, and hope it helps inform your experience here in Fooldom.\nInvestors Communicating With Investors\nThe Motley Fool is a company that represents investors teaching and learning from other investors. Many financial publications do not permit their writers and editors to own stocks. The Motley Fool not only permits, but also encourages its staff to invest in common stock. Why? Two reasons.\nFirst, we strongly believe the most effective way to create wealth is through the long-term ownership of stocks. The stock market has compounded 10% average annual returns over the last century. We believe in using the stock market as a savings bank, and we strongly encourage treating money management as a lifelong endeavor. Therefore, we think it'd be downright mean of us to close that avenue of investment to our employees.\nSecond, and more important, we don't consider our employees to be journalists, but rather communicators and teachers of financial matters. It's a subtle but critical difference that affects our entire service -- from our online site at Fool.com, to our investment books, to our nationally syndicated newspaper column, to our newsletters and portfolio services. As a company, we utilize every available medium to teach people of all ages, all income levels, all backgrounds, and all genetic codes about money and its applications in modern life. Therefore, we believe our staff's involvement in managing their own money is critical to their learning more about the subject and their succeeding in their own lives. And who better to write about investing than those who do it themselves?\nThe Motley Fool writes about stocks in both free and paid content. We make stock recommendations in our various premium newsletter services and actually hold some of these shares in our portfolio services. We will disclose our recommendation or ownership until we cease to recommend the stock, or we sell our entire position. Of course, in both free and paid content we will continue to disclose whether the author has an interest in the stocks mentioned.\nInternally, the Fool has always strived to operate with the highest levels of integrity and transparency. As such, here are the key components of The Motley Fool's disclosure policy:\nDisclosure\n- When a writer writes about a stock that he or she has a position or beneficial interest in, that fact is disclosed at the end of the article.\n- If The Motley Fool recommends or holds a position in a stock, that fact is also disclosed at the end of the article.\n- All Fool employees and contractors -- that's anyone with a TMF prefix on their screen names -- are required to disclose their current positions, including stocks, mutual funds, and cryptocurrencies. We aggregate and display these positions for the entire company here. (We do not disclose the individual stocks that might be in a Fool's mutual funds.)\n- Affiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no knowledge of any affiliates' holdings and/or specific recommendations, and the affiliates' personnel have no knowledge of any editorial content before it is published. Our affiliate companies may also have their own disclosure policies, which they may make available on their respective sites.\nTrading Restrictions\nIn addition to the above disclosure requirements, Fool employees work under additional trading restrictions and guidelines. These restrictions require that they:\n- Must hold any stock they own for at least 10 days. (No day trading allowed -- as if we'd want to!)\n- Cannot write about a stock in the period of 2 market days before to 2 market days after purchasing or selling the stock.\n- Must clear trades with our compliance department prior to any transaction.\n- Must notify our compliance department every time they buy or sell a stock, regardless of whether they have written about it.\nInvestors in The Motley Fool\nThe Motley Fool is grateful to the people that have invested in us. The Fool's founders and some family members have invested in the company, and full-time employees receive stock options and/or stock in the company.\nBusiness and Technology Partners\nWe have business relationships with an ever-changing assortment of companies, including technology vendors, leasing companies, data providers, banks, distribution channels, advertisers, landlords, accountants, and the restaurants up the street from Fool HQ. Many of these companies are public companies operating in industries that we follow. There may be instances in which one of our newsletters recommends a company with whom we have a business relationship, or we may write an article about such a company on Fool.com. These occurrences are unintentional and coincidental, as the business end of The Motley Fool has no input or influence on the editorial side of things.\nIt would take too much space to list all the companies that we do business with, and we'd probably forget some anyway, but below are some of our major partners. (This list is most subject to change. We'll update it periodically, but we will not be able to keep pace with the rate of change.)\nInvesting Advertisers\nAs a general rule, if you see ads from a company on our site and emails, that company is paying us for such placement. Some of the major ones include E*Trade, Fidelity, Scottrade, OptionsHouse, and ShareBuilder. Additionally, companies pay us for inclusion in specific areas of our site (e.g., Registration Page, Broker Center).\nMotley Fool Money\nA portion of our site, branded as Motley Fool Money, writes reviews of personal finance products, including credit cards, mortgage offers, and brokerage accounts. We may receive compensation for offers that appear on Motley Fool Money, including compensation related to placement.\nWe may issue recommendations for preferred partners that we believe in and/or use ourselves. But keep in mind, this site may not include all available offers from our partners. For example, there are thousands of credit cards available. We’ll highlight a fraction of them. All picks are made at the editorial discretion of Motley Fool Money editorial team.\nFor a list of major advertisers on Motley Fool Money, click here.\nDistribution Partners\nSome of our major distribution partners include Yahoo! Finance, MSN Money, USA Today, AOL, Nasdaq, and CNN Money.\nNews, Quotes, Data, and Content Providers\nOur major providers include Xignite SIX Financial.\nMajor Service Providers or Other Partners\nSilicon Valley Bank, Slack, Namely, Charles Schwab, Interactive Brokers, Worldpay/Vantiv, and Jones Lang LaSalle.\nIn Conclusion\nWe have designed our disclosure and trading guidelines to serve our community, our customers, and our employees fairly. As always, though, you should remember to consider every piece of investment information you receive, here at the Fool or elsewhere, not as a de facto recommendation, but as an idea for further consideration. Even the strongest disclosure policy in the world does not excuse individuals from taking responsibility for their own decisions. Due diligence, critical thought, and use of the most extraordinary device in the world (the human brain) are crucial to your financial success.\nLast updated November 11th, 2024."
    }
  ],
  "argos_summary": "Amazon, Coca‑Cola and Disney—three Dow 30 constituents—are highlighted as likely to outperform in 2025. Amazon’s recent Q2 sales and AWS growth have accelerated, boosting its earnings and making its inclusion in the Dow a positive sign, though the stock fell after analysts worried about AI lag. Coca‑Cola continues to deliver steady revenue growth and a long dividend‑paying streak, while Disney’s theme‑park and streaming businesses are rebounding, lowering its forward P/E. The Motley Fool notes these stocks’ strong fundamentals and suggests they could be attractive long‑term holdings, but also warns of short‑term volatility and stresses its disclosure policy.",
  "argos_id": "2HCJRO8C4"
}