{
  "url": "https://www.seattletimes.com/entertainment/jury-acquits-memphis-man-charged-with-organizing-the-daytime-ambush-killing-of-rapper-young-dolph/",
  "authorsByline": "ADRIAN SAINZ",
  "articleId": "f9915bc8a70a4c14abd4883117a59fc0",
  "source": {
    "domain": "seattletimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "WA",
      "county": "King County",
      "city": "Seattle",
      "coordinates": {
        "lat": 47.6038321,
        "lon": -122.330062
      }
    }
  },
  "imageUrl": "https://images.seattletimes.com/wp-content/uploads/2025/08/08212025_YoungDolph_tzr_090846.jpg?d=1200x630",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T08:57:03-07:00",
  "addDate": "2025-08-21T16:28:24.109635+00:00",
  "refreshDate": "2025-08-21T16:28:24.109637+00:00",
  "score": 1.0,
  "title": "Jury acquits Memphis man charged with organizing the daytime ambush killing of rapper Young Dolph",
  "description": "A jury found a man not guilty of organizing the daytime ambush killing of rapper Young Dolph at a Memphis bakery in November 2021.",
  "content": "MEMPHIS, Tenn. (AP) — A jury found a man not guilty Thursday of organizing the daytime ambush killing of rapper Young Dolph at a Memphis bakery in November 2021.\n\nA Memphis jury deliberated about three hours before finding Hernandez Govan, 45, not guilty of first-degree murder and conspiracy to commit first-degree murder.\n\nGovan hugged his lawyer and thanked Shelby County Judge Jennifer Mitchell after she told him he was free to go.\n\nGovan was not accused of shooting Young Dolph, but prosecutors claimed he directed the two people who did. The jury was not convinced, however, despite a man’s testimony that Govan hired him to “do the hits” and was going to take $10,000 as his cut.\n\nGovan’s lawyer questioned the quality of the police investigation and the validity of cellphone communications between Govan and the men who shot Dolph, arguing that nothing in the communications directly incriminated Govan or tied him to the killings.\n\nYoung Dolph, whose legal name is Adolph Thornton Jr., was a rapper, independent label owner and producer who grew up in Memphis and was admired in the city for his charitable works. The 36-year-old was in his hometown to hand out Thanksgiving turkeys to families when his visit to his favorite cookie shop turned into an attack that shocked the entertainment world.\n\nAuthorities said two men exited a white Mercedes Benz and began shooting at the rapper at the bakery. He died after being shot about 20 times, according to a medical examiner’s report.\n\nTestifying against Govan was Cornelius Smith Jr., who has admitted to being one of the two shooters who ambushed Young Dolph. Smith previously was the main witness against Justin Johnson, who was convicted of first-degree murder in 2024 after Smith named him as the second shooter.\n\nMemphis prosecutors have portrayed the killing as part an effort by Anthony “Big Jook” Mims to get revenge on Young Dolph for diss tracks aimed at Big Jook and the record label he helped run for his brother, rapper Yo Gotti. Smith has testified that Big Jook put out a $100,000 hit on Young Dolph as well as smaller bounties on all the artists at Young Dolph’s record label, Paper Route Empire.\n\nAt the earlier trial of Justin Johnson, a prosecutor told jurors Cocaine Muzik Group (now known as Collective Music Group), a rival record label founded by Yo Gotti, wanted Young Dolph to work for them, but he turned them down.\n\nBig Jook was shot and killed outside a restaurant in January 2024.\n\nSmith testified Monday that “I didn’t know anything about Paper Route having no hits,” before Govan told him about them. He said Govan hired him to “do the hits,” including giving Smith guns for the killing, and was going to take $10,000 as his cut. Govan was also the person who told him and Johnson that Young Dolph would be in Memphis for the Thanksgiving turkey giveaway, so “that’s our opportunity,” Smith said.\n\nProsecutors introduced as evidence dozens of cellphone communications between Johnson, Smith, Govan and Big Jook ahead of the shooting.\n\nMeanwhile, Govan’s defense attorney, Manny Arora, tried to paint Smith as an unreliable witness who would say anything to try to get a lighter sentence.\n\nArora pointed to previous testimony where Smith recalled a chance encounter with Big Jook. At the time, Smith implied that Big Jook was the person who hired him. After Smith was arrested, his attorney called Big Jook’s attorney and received somewhere between $38,000 and $50,000 in cash. Smith said on Monday that he did not know who had supplied the money.\n\nSmith also testified that he previously heard that Govan might be working with the FBI. Arora asked why Smith would take a job from Govan if that were the case. Smith said Govan was “innocent until proven guilty.”\n\nGovan did not testify in his defense.\n\nSmith is charged with murder and conspiracy to commit murder but has pleaded not guilty and does not yet have a trial date.\n\nJohnson was sentenced last September to life in prison with the possibility of parole. He was later sentenced for two other convictions from the trial: conspiracy to commit murder and being a felon in possession of a gun.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "rapper Young Dolph",
      "weight": 0.104242064
    },
    {
      "name": "Young Dolph",
      "weight": 0.10225286
    },
    {
      "name": "Smith",
      "weight": 0.08906136
    },
    {
      "name": "Big Jook",
      "weight": 0.087112434
    },
    {
      "name": "Cornelius Smith Jr.",
      "weight": 0.086896986
    },
    {
      "name": "Govan",
      "weight": 0.08480685
    },
    {
      "name": "Hernandez Govan",
      "weight": 0.08427113
    },
    {
      "name": "Dolph",
      "weight": 0.077990204
    },
    {
      "name": "Memphis man",
      "weight": 0.073783845
    },
    {
      "name": "Memphis prosecutors",
      "weight": 0.06982847
    }
  ],
  "topics": [
    {
      "name": "Crime"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    },
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.9873046875
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.9853515625
    },
    {
      "name": "/News/Local News",
      "score": 0.9560546875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.9404296875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.93017578125
    },
    {
      "name": "/News/Other",
      "score": 0.9248046875
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.60205078125
    }
  ],
  "sentiment": {
    "positive": 0.06066636,
    "negative": 0.6993936,
    "neutral": 0.23994014
  },
  "summary": "A Memphis jury acquits Hernandez Govan, 45, of organizing the daytime ambush killing of rapper Young Dolph in 2021. The jury deliberated for three hours before finding him not guilty of first-degree murder and conspiracy to commit murder. Govan was not accused of shooting Dolph, but prosecutors claimed he directed the two men who did. Despite a man's testimony that Govan hired him to \"do the hits\" and was set to take $10,000 as his cut, Govan's lawyer questioned the police investigation and the validity of cellphone communications between Govan and the men who shot Dolph. Prosecutors have portrayed the killing as part of an effort by Anthony \"Big Jook\" Mims to revenge on YoungDolph for diss tracks aimed at him and his brother, rapper Yo Gotti.",
  "shortSummary": "A jury in Memphis acquitted Hernandez Govan of organizing the ambush killing of rapper Young Dolph, despite evidence suggesting otherwise.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "ae0421e99d6745eea2adbd7ae158adea",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "A Memphis jury acquitted 45‑year‑old Hernandez Govan of first‑degree murder and conspiracy for the 2021 ambush killing of rapper Young Dolph at a bakery, finding the evidence of his alleged direction of the shooters insufficient. Govan was never accused of firing the shots, but prosecutors claimed he hired two men, including Cornelius Smith Jr., to carry out the attack. Smith, who admitted to shooting Dolph, testified that Govan had hired him and provided guns, but his credibility was challenged by Govan’s defense. The case highlights the broader feud involving rapper Yo Gotti’s label and the late Anthony “Big Jook” Mims, who had reportedly placed a bounty on Dolph. Smith remains charged with murder and conspiracy but has not yet been tried.",
  "argos_id": "2UN2HZNUV"
}