{
  "url": "https://www.cnbc.com/2025/08/21/cracker-barrel-cbrl-new-logo-branding.html",
  "authorsByline": "Ali McCadden",
  "articleId": "9cc8ce9fd5104477a540f87b7c685a8f",
  "source": {
    "domain": "cnbc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Bergen County",
      "city": "Englewood Cliffs",
      "coordinates": {
        "lat": 40.8853773,
        "lon": -73.9523597
      }
    }
  },
  "imageUrl": "https://image.cnbcfm.com/api/v1/image/107417140-1716206718008-gettyimages-2153281967-PWeaver-FF-240519-05.jpeg?v=1755795364&w=1920&h=1080",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T18:01:23+00:00",
  "addDate": "2025-08-21T18:08:31.010400+00:00",
  "refreshDate": "2025-08-21T18:08:31.010402+00:00",
  "score": 1.0,
  "title": "Cracker Barrel shares plummet after pushback on new logo, brand refresh",
  "description": "Shares of Cracker Barrel plunged over 12% on Thursday after the restaurant unveiled its new logo earlier this week as part of a larger brand refresh.",
  "content": "Shares of Cracker Barrel Old Country Store plummeted roughly 10% on Thursday after the restaurant unveiled its new logo earlier this week as part of a larger brand refresh. The new logo removes the image of a man leaning against a barrel that was prominently featured in the original, leaving behind just the words Cracker Barrel against a yellow background. The phrase \"old country store\" has also been removed. The company said the colors in the logo were inspired by the chain's scrambled eggs and biscuits. The change is part of a \"strategic transformation\" to revitalize the brand that started back in May 2024. Under that mission, Cracker Barrel's brand refresh includes updates to visual elements, restaurant spaces and food and retail offerings.\n\nCracker Barrel said in March that the refresh will still maintain the brand's \"rich history of country hospitality\" and \"authentic charm that has made the brand a beloved destination for generations of families.\" \"We believe in the goodness of country hospitality, a spirit that has always defined us. Our story hasn't changed. Our values haven't changed,\" Chief Marketing Officer Sarah Moore said in a media release. However, many social media users have criticized the new logo, especially those in conservative circles. The president's son, Donald Trump Jr., amplified a post on Wednesday suggesting that the logo change was led by CEO Julie Felss Masino to erase the American tradition aspect of the branding and make it more general, as a way of leaning into diversity, equity and inclusion efforts. Conservative activist Robby Starbuck added his commentary on Thursday, writing in a post on X, \"Good morning @CrackerBarrel! You're about to learn that wokeness really doesn't pay.\" The company has a relatively small market cap of about $1.2 billion compared with other restaurant chains. Cracker Barrel is not the only stock to see large swings based on political social media posts. Earlier this month, shares of American Eagle soared after Trump posted that an ad featuring Sydney Sweeney, which faced significant social media pushback from the left, was \"the 'HOTTEST' ad out there.\" Back in 2023, Anheuser-Busch InBev faced heavy criticism from conservatives after a collaboration between Bud Light and social influencer Dylan Mulvaney, who is transgender.",
  "medium": "Article",
  "links": [
    "https://www.cnbc.com/donald-trump-jr/",
    "http://google.com/search?q=cnbc+between+Bud+Light+and+social+influencer+Dylan+Mulvaney%2C&amp;rlz=1C1GCEA_enUS1095US1095&amp;oq=cnbc+between+Bud+Light+and+social+influencer+Dylan+Mulvaney%2C&amp;gs_lcrp=EgZjaHJvbWUyBggAEEUYOTIGCAEQRRg8MgYIAhAjGCcyBggDECMYJzIMCAQQABhDGIAEGIoFMgwIBRAAGEMYgAQYigUyDAgGEAAYQxiABBiKBTIGCAcQRRg80gEIMTI1MWowajeoAgCwAgA&amp;sourceid=chrome&amp;ie=UTF-8",
    "https://x.com/robbystarbuck/status/1958541477019074867",
    "https://x.com/DonaldJTrumpJr/status/1958279379408372204",
    "https://www.crackerbarrel.com/newsroom/news-releases/2025/aug/cracker-barrel-appoints-new-agency-partners-to-support-brand-refresh",
    "https://www.cnbc.com/quotes/CBRL/",
    "https://www.cnbc.com/quotes/AEO/",
    "https://www.cnbc.com/quotes/CBRL",
    "https://www.cnbc.com/2025/08/04/american-eagle-aeo-stock-sydney-sweeney-trump.html",
    "https://www.cnbc.com/quotes/BUD/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "new logo",
      "weight": 0.0923439
    },
    {
      "name": "Cracker Barrel shares",
      "weight": 0.08856489
    },
    {
      "name": "political social media posts",
      "weight": 0.088016935
    },
    {
      "name": "Cracker Barrel",
      "weight": 0.08683478
    },
    {
      "name": "significant social media pushback",
      "weight": 0.08504957
    },
    {
      "name": "brand refresh",
      "weight": 0.08430094
    },
    {
      "name": "Cracker Barrel Old Country Store",
      "weight": 0.081955284
    },
    {
      "name": "many social media users",
      "weight": 0.07913964
    },
    {
      "name": "country hospitality",
      "weight": 0.071665615
    },
    {
      "name": "social influencer Dylan Mulvaney",
      "weight": 0.071557805
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9921875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.77734375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.62353515625
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.423828125
    },
    {
      "name": "/Food & Drink/Restaurants/Fast Food",
      "score": 0.398193359375
    },
    {
      "name": "/Food & Drink/Restaurants/Other",
      "score": 0.3876953125
    }
  ],
  "sentiment": {
    "positive": 0.15303648,
    "negative": 0.5698502,
    "neutral": 0.27711326
  },
  "summary": "Shares of Cracker Barrel Old Country Store fell by roughly 10% following the unveiling of its new logo and a larger brand refresh. The new logo removes the image of a man leaning against a barrel and replaces the phrase \"old country store\" on the front page. The company claims the change is part of a \"strategic transformation\" to revitalize the brand, which includes updates to visual elements, restaurant spaces, and food and retail offerings. However, social media users, including those in conservative circles, have criticized the new logo, suggesting it was led by CEO Julie Felaspo.",
  "shortSummary": "Cracker Barrel shares plummeted 10% after unveiling a new logo and brand refresh, sparking criticism from conservatives and social media users.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ee711f05d2ff46b8817c0d1071d43c5e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnbc.com/2025/08/04/american-eagle-aeo-stock-sydney-sweeney-trump.html",
      "text": "Shares of American Eagle surged more than 23% on Monday after President Donald Trump complimented the retailer's marketing campaign with actress Sydney Sweeney.\n\"Sydney Sweeney, a registered Republican, has the 'HOTTEST' ad out there. It's for American Eagle, and the jeans are 'flying off the shelves.' Go get 'em Sydney!\" Trump wrote on his social media site Truth Social not long after markets opened.\nShortly after Trump's post, shares of American Eagle jumped. Monday's gains come a little over a week after American Eagle first announced that the \"Euphoria\" star would headline its fall marketing campaign with the slogan: \"Sydney Sweeney has great jeans.\"\nInitially, the stock rose in an apparent bout of meme stock mania, but over the past week, shares of the company have been down as American Eagle has faced criticism about the campaign. That slump rebounded on Monday when Trump weighed in on the discourse.\nThe slogan American Eagle chose for the campaign — \"Sydney Sweeney has great jeans\" — has led some far-left critics to say the remark was a double entendre. Instead of being about pants, it was really about the actress' genetics and the fact that she has blonde hair and blue eyes, critics said. The ad also faced pushback more widely for being overly sexualized and out of touch, reminiscent of previous marketing norms that many say no longer resonate with the public.\nAmerican Eagle has stayed largely quiet on the matter — releasing a brief statement on its Instagram account on Friday that said the slogan \"is and always was about the jeans.\"\n\"We'll continue to celebrate how everyone wears their AE jeans with confidence, their way,\" the company said. \"Great jeans look good on everyone.\"\nThe saga highlights the tightrope that marketers are walking when deciding what types of ads to run and the audiences they should be targeting when consumer attention is harder than ever to win and maintain. Bud Lite's ill-fated Dylan Mulvaney collaboration and the subsequent impact on its sales and its parent company's stock price, highlighted how things can go wrong when companies release marketing that some may consider \"woke.\" On the other hand, American Eagle's campaign is now showing the other side of that coin – what can happen when a company releases marketing that isn't \"woke\" and perhaps more accepted on the cultural right.\nIn the lead-up to American Eagle's campaign with Sweeney, the company has been struggling to grow sales, and the marketing blitz is one of the many things it's doing to reverse that negative slump.\nIt's too early to say if the campaign has positively or negatively impacted sales, but it has made American Eagle more top of mind with shoppers. Google trend data shows search interest for American Eagle is at its highest level in more than 20 years. Whether or not that search interest translates to more shoppers buying jeans from American Eagle will be more clear when the retailer reports earnings, which is expected in the next few weeks.\nAs of Friday's close, shares of American Eagle were down more than 27% so far this year as the company grapples with larger macroeconomic concerns related to tariffs, consumer spending and its own merchandising missteps.\nEarlier this year, the company said it would take a $75 million write-down in spring and summer merchandise after it pulled its full-year guidance due to slow sales, steep discounting and a volatile macroeconomic environment.\nFor its current quarter, American Eagle said in May that it expects revenue to fall 5%, comparable sales to be down 3% and gross margin to be lower compared with the prior year. Its operating income for the second quarter is expected to be between $40 million and $45 million."
    },
    {
      "url": "https://www.cnbc.com/donald-trump-jr/",
      "text": "Skip Navigation\nMarkets\nPre-Markets\nU.S. Markets\nEurope Markets\nChina Markets\nAsia Markets\nWorld Markets\nCurrencies\nCryptocurrency\nFutures & Commodities\nBonds\nFunds & ETFs\nBusiness\nEconomy\nFinance\nHealth & Science\nMedia\nReal Estate\nEnergy\nClimate\nTransportation\nIndustrials\nRetail\nWealth\nSports\nLife\nSmall Business\nInvesting\nPersonal Finance\nFintech\nFinancial Advisors\nOptions Action\nETF Street\nBuffett Archive\nEarnings\nTrader Talk\nTech\nCybersecurity\nAI\nEnterprise\nInternet\nMedia\nMobile\nSocial Media\nCNBC Disruptor 50\nTech Guide\nPolitics\nWhite House\nPolicy\nDefense\nCongress\nExpanding Opportunity\nEurope Politics\nChina Politics\nAsia Politics\nWorld Politics\nVideo\nLatest Video\nFull Episodes\nLivestream\nTop Video\nLive Audio\nEurope TV\nAsia TV\nCNBC Podcasts\nCEO Interviews\nDigital Originals\nWatchlist\nInvesting Club\nTrust Portfolio\nAnalysis\nTrade Alerts\nMeeting Videos\nHomestretch\nJim's Columns\nEducation\nSubscribe\nPRO\nPro News\nJosh Brown\nNEW!\nLivestream\nFull Episodes\nStock Screener\nMarket Forecast\nOptions Investing\nChart Investing\nStock Lists\nSubscribe\nLivestream\nMenu\nMake It\nselect\nUSA\nINTL\nLivestream\nSearch quotes, news & videos\nLivestream\nWatchlist\nSIGN IN\nMarkets\nBusiness\nInvesting\nTech\nPolitics\nVideo\nWatchlist\nInvesting Club\nPRO\nLivestream\nMenu\nDonald Trump, Jr.\nBusinessman and President Donald Trump’s oldest son\nLatest\nCracker Barrel shares plummet after pushback on new logo, brand refresh\nAli McCadden\n1 Hour Ago\nTrump half-billion-dollar civil fraud fine overturned by New York appeals court\nDan Mangan\n|\nKevin Breuninger\n4 Hours Ago\nwatch now\nVIDEO\n12:11\nIs this the start of a friendship between US & China? Maybe, if Trump has his way\nAugust 8, 2025\nTrump Media builds $2 billion bitcoin hoard, as cryptocurrency swells president's net worth\nKevin Breuninger\nJuly 21, 2025\nShares of gun seller GrabAGun — backed by Donald Trump Jr. — tank after NYSE trading debut\nErin Doherty\nJuly 16, 2025\nwatch now\nVIDEO\n04:50\nTrump's tax bill will leave less money for future administrations to spend: Expert\nJune 29, 2025\nTesla already had big problems. Then Musk went to battle with Trump\nLora Kolodny\nJune 6, 2025\nTrump's USD1 stablecoin is off to a rocky start, data shows\nMacKenzie Sigalos\nJune 3, 2025\nDonald Trump Jr. distances himself from $TRUMP meme coin: 'I wasn't involved'\nMacKenzie Sigalos\nJune 3, 2025\nU.S. stocks vs. European stocks — here is where Jim Cramer comes down on the debate\nPaulina Likos\nMay 25, 2025\nTrump says Comey called for 'assassination of the president' with '8647' Instagram post\nDan Mangan\nMay 16, 2025\nFormer FBI Director James Comey under investigation for post seen as a potential threat to Trump's life\nMay 15, 2025\nLoad More"
    },
    {
      "url": "https://www.cnbc.com/quotes/CBRL",
      "text": "Cracker Barrel Old Country Store Inc CBRL:NASDAQ\nRT Quote | Last NASDAQ LS, VOL From CTA | USD\nLast | 3:03 PM EDT\n54.59-4.43 (-7.51%)\nVolume\n3,338,544\n52 week range\n33.86 - 71.93\n- Open56.77\n- Day High56.85\n- Day Low50.27\n- Prev Close59.02\n- 52 Week High71.93\n- 52 Week High Date07/23/25\n- 52 Week Low33.86\n- 52 Week Low Date04/04/25\nLatest On Cracker Barrel Old Country Store Inc\nKey Stats\n- Market Cap1.216B\n- Shares Out22.27M\n- 10 Day Average Volume0.73M\n- Dividend1.00\n- Dividend Yield1.83%\n- Beta1.41\n- YTD % Change2.07\nLatest On Cracker Barrel Old Country Store Inc\nKEY STATS\n- Open56.77\n- Day High56.85\n- Day Low50.27\n- Prev Close59.02\n- 52 Week High71.93\n- 52 Week High Date07/23/25\n- 52 Week Low33.86\n- 52 Week Low Date04/04/25\n- Market Cap1.216B\n- Shares Out22.27M\n- 10 Day Average Volume0.73M\n- Dividend1.00\n- Dividend Yield1.83%\n- Beta1.41\n- YTD % Change2.07\nRATIOS/PROFITABILITY\n- EPS (TTM)2.58\n- P/E (TTM)21.17\n- Fwd P/E (NTM)16.66\n- EBITDA (TTM)196.496M\n- ROE (TTM)12.90%\n- Revenue (TTM)3.51B\n- Gross Margin (TTM)69.00%\n- Net Margin (TTM)1.65%\n- Debt To Equity (MRQ)104.28%\nEVENTS\n- Earnings Date09/17/2025(est)\n- Ex Div Date07/18/2025\n- Div Amount0.25\n- Split Date-\n- Split Factor-"
    },
    {
      "url": "https://www.cnbc.com/quotes/CBRL/",
      "text": "Cracker Barrel Old Country Store Inc CBRL:NASDAQ\nRT Quote | Last NASDAQ LS, VOL From CTA | USD\nLast | 3:03 PM EDT\n54.59-4.43 (-7.51%)\nVolume\n3,338,556\n52 week range\n33.86 - 71.93\n- Open56.77\n- Day High56.85\n- Day Low50.27\n- Prev Close59.02\n- 52 Week High71.93\n- 52 Week High Date07/23/25\n- 52 Week Low33.86\n- 52 Week Low Date04/04/25\nLatest On Cracker Barrel Old Country Store Inc\nKey Stats\n- Market Cap1.216B\n- Shares Out22.27M\n- 10 Day Average Volume0.73M\n- Dividend1.00\n- Dividend Yield1.83%\n- Beta1.41\n- YTD % Change2.08\nLatest On Cracker Barrel Old Country Store Inc\nKEY STATS\n- Open56.77\n- Day High56.85\n- Day Low50.27\n- Prev Close59.02\n- 52 Week High71.93\n- 52 Week High Date07/23/25\n- 52 Week Low33.86\n- 52 Week Low Date04/04/25\n- Market Cap1.216B\n- Shares Out22.27M\n- 10 Day Average Volume0.73M\n- Dividend1.00\n- Dividend Yield1.83%\n- Beta1.41\n- YTD % Change2.08\nRATIOS/PROFITABILITY\n- EPS (TTM)2.58\n- P/E (TTM)21.17\n- Fwd P/E (NTM)16.66\n- EBITDA (TTM)196.496M\n- ROE (TTM)12.90%\n- Revenue (TTM)3.51B\n- Gross Margin (TTM)69.00%\n- Net Margin (TTM)1.65%\n- Debt To Equity (MRQ)104.28%\nEVENTS\n- Earnings Date09/17/2025(est)\n- Ex Div Date07/18/2025\n- Div Amount0.25\n- Split Date-\n- Split Factor-"
    }
  ],
  "argos_summary": "Cracker Barrel’s new logo, part of a broader brand refresh, triggered a roughly 10% drop in its shares after conservative backlash amplified by Donald Trump Jr. and other right‑wing commentators. The company says the redesign preserves its heritage while modernizing its look, but critics accuse it of erasing American tradition in favor of diversity and inclusion. The article also notes a parallel case where American Eagle’s stock surged after Trump praised its Sydney Sweeney campaign, illustrating how political endorsements can sway retail shares.",
  "argos_id": "2UYA4FAX9"
}