{
  "url": "https://www.nasdaq.com/articles/ccoi-november-21st-options-begin-trading",
  "authorsByline": "BNK Invest",
  "articleId": "37073dac95bd48a3b7b3b1abdd8c016d",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T15:31:57+00:00",
  "addDate": "2025-08-21T15:43:28.904295+00:00",
  "refreshDate": "2025-08-21T15:43:28.904296+00:00",
  "score": 1.0,
  "title": "CCOI November 21st Options Begin Trading",
  "description": "Investors in Cogent Communications Holdings, Inc. (Symbol: CCOI) saw new options begin trading today, for the November 21st expiration.  One of the key data points that goes into the price an option buyer is willing to pay, is the time value, so with 92 days until expiration the",
  "content": "Investors in Cogent Communications Holdings, Inc. (Symbol: CCOI) saw new options begin trading today, for the November 21st expiration. One of the key data points that goes into the price an option buyer is willing to pay, is the time value, so with 92 days until expiration the newly trading contracts represent a possible opportunity for sellers of puts or calls to achieve a higher premium than would be available for the contracts with a closer expiration. At Stock Options Channel , our YieldBoost formula has looked up and down the CCOI options chain for the new November 21st contracts and identified one put and one call contract of particular interest.\n\nThe put contract at the $22.50 strike price has a current bid of 25 cents. If an investor was to sell-to-open that put contract, they are committing to purchase the stock at $22.50, but will also collect the premium, putting the cost basis of the shares at $22.25 (before broker commissions). To an investor already interested in purchasing shares of CCOI, that could represent an attractive alternative to paying $36.72/share today.\n\nBecause the $22.50 strike represents an approximate 39% discount to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the put contract would expire worthless. The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 88%. Stock Options Channel will track those odds over time to see how they change, publishing a chart of those numbers on our website under the contract detail page for this contract. Should the contract expire worthless, the premium would represent a 1.11% return on the cash commitment, or 4.41% annualized — at Stock Options Channel we call this the YieldBoost.\n\nBelow is a chart showing the trailing twelve month trading history for Cogent Communications Holdings, Inc., and highlighting in green where the $22.50 strike is located relative to that history:\n\nTurning to the calls side of the option chain, the call contract at the $55.00 strike price has a current bid of 15 cents. If an investor was to purchase shares of CCOI stock at the current price level of $36.72/share, and then sell-to-open that call contract as a \"covered call,\" they are committing to sell the stock at $55.00. Considering the call seller will also collect the premium, that would drive a total return (excluding dividends, if any) of 50.19% if the stock gets called away at the November 21st expiration (before broker commissions). Of course, a lot of upside could potentially be left on the table if CCOI shares really soar, which is why looking at the trailing twelve month trading history for Cogent Communications Holdings, Inc., as well as studying the business fundamentals becomes important. Below is a chart showing CCOI's trailing twelve month trading history, with the $55.00 strike highlighted in red:\n\nConsidering the fact that the $55.00 strike represents an approximate 50% premium to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the covered call contract would expire worthless, in which case the investor would keep both their shares of stock and the premium collected. The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 80%. On our website under the contract detail page for this contract, Stock Options Channel will track those odds over time to see how they change and publish a chart of those numbers (the trading history of the option contract will also be charted). Should the covered call contract expire worthless, the premium would represent a 0.41% boost of extra return to the investor, or 1.62% annualized, which we refer to as the YieldBoost.\n\nThe implied volatility in the put contract example is 104%, while the implied volatility in the call contract example is 82%.\n\nMeanwhile, we calculate the actual trailing twelve month volatility (considering the last 250 trading day closing values as well as today's price of $36.72) to be 45%. For more put and call options contract ideas worth looking at, visit StockOptionsChannel.com.",
  "medium": "Article",
  "links": [
    "https://www.stockoptionschannel.com/symbol/?symbol=CCOI&month=20251121&type=put&contract=22.50",
    "https://www.holdingschannel.com/hedge-funds/holding-genq/",
    "https://www.holdingschannel.com/insider-buying/twer-insider-buying/",
    "https://www.stockoptionschannel.com/symbol/?symbol=CCOI&month=20251121&type=call&contract=55.00",
    "https://www.stockoptionschannel.com/slideshows/top-yieldboost-calls-of-the-spx/",
    "https://www.stockoptionschannel.com/",
    "https://www.pastearnings.com/ped.html"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "CCOI shares",
      "weight": 0.08816185
    },
    {
      "name": "CCOI stock",
      "weight": 0.08631798
    },
    {
      "name": "November 21st Options",
      "weight": 0.08465436
    },
    {
      "name": "more put and call options contract ideas",
      "weight": 0.075086385
    },
    {
      "name": "trading day",
      "weight": 0.074408375
    },
    {
      "name": "new options",
      "weight": 0.07396809
    },
    {
      "name": "calls",
      "weight": 0.07257993
    },
    {
      "name": "Stock Options Channel",
      "weight": 0.072474085
    },
    {
      "name": "Cogent Communications Holdings",
      "weight": 0.07040463
    },
    {
      "name": "CCOI",
      "weight": 0.066351146
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9951171875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.98828125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.9140625
    },
    {
      "name": "/Finance/Investing/Brokerages & Day Trading",
      "score": 0.6474609375
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.57080078125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.440673828125
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Precious Metals",
      "score": 0.31494140625
    }
  ],
  "sentiment": {
    "positive": 0.1733047,
    "negative": 0.14418416,
    "neutral": 0.68251115
  },
  "summary": "Investors in Cogent Communications Holdings, Inc. (CCOI) saw new options begin trading for the November 21st expiration. With 92 days until expiration, these newly trading contracts could offer an opportunity for sellers of puts or calls to achieve a higher premium than those available for contracts with a closer expiration. At Stock Options Channel, our YieldBoost formula identified one put and one call contract of particular interest. The put contract at the $22.50 strike price has a current bid of 25 cents, while the call contract has a bid of 15 cents. If an investor was to purchase shares of CCOI stock at the current price level of $36.72/share, and then sell-to-open that call contract as a \"covered call,\" they are committing to sell the stock at $55.00. However, there is also the possibility that the covered call contract would expire worthless, resulting in a total return of 50.19% if the stock gets called away at the November21st expiration (before broker commissions).",
  "shortSummary": "New options for Cogent Communications Holdings, Inc. expire on November 21st, offering potential premium increases for potential stock purchases or calls.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "0e0a1cfac36a4bef82d49ead1656bd5e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.stockoptionschannel.com/",
      "text": "| As of Thu, Aug 21, 12:30 PM |\n| |\n| Symbol | Put Vol | Call Vol | Put:Call Ratio |\n| NVDA | 442,809 | 673,538 | 0.66 | | TSLA | 356,741 | 401,428 | 0.89 | | PLTR | 303,652 | 354,252 | 0.86 | | AAPL | 181,570 | 155,102 | 1.17 | | WMT | 157,720 | 163,254 | 0.97 | | AMD | 127,478 | 167,579 | 0.76 | | INTC | 97,593 | 184,971 | 0.53 | | AMZN | 100,364 | 171,177 | 0.59 | | META | 92,349 | 100,945 | 0.91 | | UNH | 46,179 | 128,555 | 0.36 | | SMCI | 41,678 | 128,770 | 0.32 | | PCG | 104,266 | 60,916 | 1.71 | | GOOGL | 53,934 | 106,323 | 0.51 | | PSKY | 29,062 | 116,950 | 0.25 | | MSFT | 36,233 | 77,620 | 0.47 | | COIN | 22,444 | 78,714 | 0.29 | | GOOG | 23,635 | 51,429 | 0.46 | | PFE | 16,866 | 55,460 | 0.30 | | AVGO | 19,105 | 47,197 | 0.40 | | FSLR | 44,908 | 19,324 | 2.32 | | TGT | 33,406 | 29,801 | 1.12 | | CZR | 52,008 | 4,383 | 11.87 | | BAC | 28,592 | 27,682 | 1.03 | | C | 17,591 | 34,102 | 0.52 | | LLY | 16,134 | 34,770 | 0.46 | | PANW | 13,345 | 36,171 | 0.37 | | PYPL | 13,067 | 32,286 | 0.40 | | NFLX | 16,101 | 22,631 | 0.71 | | MU | 14,673 | 22,061 | 0.67 | | BA | 8,799 | 27,777 | 0.32 |\n|"
    },
    {
      "url": "https://www.pastearnings.com/ped.html",
      "text": "PED Past Earnings Q&A\nWhat was the best and worst PED past earnings results?\nFor PEDEVCO, I'm wondering what the company's very best and worst earnings results have been, on an earnings per share basis?\n✔️Accepted answer:\nThe highest PED past earnings result in our data set was 0.130/share posted in Q4 2024, while the lowest was in Q4 2014 when PED posted -2.500/share.\nSuggested answer:\nThe biggest top line earnings performance — aka revenue — quarter was in Q2 2024 when PED reported 0.01B in revenue, while the quarter with the lowest revenue in our data set was Q1 2016 at 582000 of revenue.\nSuggested answer:\nThere are 43 PED past earnings results in our data set.\nOn this page we presented the PED past earnings date information for PEDEVCO. Reviewing that\nPED Past Earnings for the company, we see that the highest past earnings result in our data set was in Q4 2024, when PED posted gaap of 0.130/share. Meanwhile the lowest PED past earnings result was in Q4 2014, when PED posted gaap of -2.500/share. Turning to top line revenue performance, the biggest revenue quarter in our data set was seen in Q2 2024 when PED reported 0.01B in revenue, while the smallest revenue quarter was Q1 2016 when PED reported 582000 in revenue.\nAny self directed investor doing their due diligence on PED or any other given stock can benefit from\nresearching all of the PEDEVCO past earnings — and here, we present each quarter's result all together\non one page for easy comparison. Studying this information can help when projecting future earnings, as well\nas determining whether the past earnings trajectory justifies the current stock value.\nThat's why we bring you\nPastEarnings.com to make it easy for investors to investigate\nPEDEVCO past earnings, or the past earnings information for any stock in our coverage universe.\nAnd in your continued research we hope you will be sure to check out the further links included for earnings\nsurprises history (beat/miss data) as well as next earnings dates for PED. Thanks for visiting, and the next\ntime you need to research\nPED past earnings or those of another stock, we hope you'll think of our site, as your\ngo-to past earnings research resource of choice."
    }
  ],
  "argos_summary": "Cogent Communications Holdings (CCOI) has new November 21 options with 92 days to expiration. A $22.50 put offers a 25¢ bid, potentially yielding 1.11% return if it expires worthless (88% chance), while a $55.00 call gives a 15¢ bid that could produce a 50.19% return if exercised (80% chance of expiring worthless). Implied volatilities are 104% for the put and 82% for the call, against a 45% trailing 12‑month volatility. The article also includes a table of other stocks’ option volumes and a separate section on PED past earnings data.",
  "argos_id": "63Z97ZSJG"
}