{
  "url": "https://www.foxnews.com/tech/remove-your-data-protect-your-retirement-from-scammers",
  "authorsByline": "Kurt Knutsson, CyberGuy Report",
  "articleId": "9e4f5eda965545f2ae3c65c7aca9ff4a",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/3-remove-your-data-to-protect-your-retirement-from-scammers.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T12:10:04-04:00",
  "addDate": "2025-08-21T16:28:24.132295+00:00",
  "refreshDate": "2025-08-21T16:28:24.132296+00:00",
  "score": 1.0,
  "title": "Remove your data to protect your retirement from scammers",
  "description": "Data brokers sell personal details that scammers use to target retirement funds through fake financial advisor calls and convincing phishing attempts",
  "content": "You've spent decades building your retirement fund. Now is the time to enjoy it, not lie awake worrying about scammers and identity thieves. Criminals are more aggressive than ever, and they know your personal information is the key to your money.\n\nThe good news? You can take simple steps to remove your personal data from risky websites and databases. These actions greatly reduce the chance of fraud and protect your hard-earned savings from scammers. By taking control of your information now, you keep your money secure and your retirement in your hands.\n\nTHE DATA BROKER OPT-OUT STEPS EVERY RETIREE SHOULD TAKE TODAY\n\nSign up for my FREE CyberGuy Report\n\nGet my best tech tips, urgent security alerts, and exclusive deals delivered straight to your inbox. Plus, you’ll get instant access to my Ultimate Scam Survival Guide - free when you join my\n• They're large. A lifetime of savings can add up to six or seven figures.\n• They're less monitored. Unlike checking accounts, you may only review them a few times a year.\n• They're easy to access remotely. Scammers don't need your wallet-just enough personal details to pretend to be you.\n\nElder fraud caused more than $4.9 billion in losses in 2024. In 72% of cases, scammers found victims' personal data online. Most of these crimes were tied to identity theft, allowing criminals to access accounts, redirect benefits, or launch phishing attacks.\n\nYou have an online profile even without social media\n\nYou don't have to be on Facebook to have your information online. Data brokers, companies you may have never heard of, collect and sell personal details about nearly every adult in the U.S. These profiles may include:\n\nFor scammers, this information is like a treasure map.\n\nHOW TO SECURE YOUR 401(K) PLAN FROM IDENTITY FRAUD\n\nWhen scammers know your age, address, and that you're retired, they can craft scams that feel frighteningly real. Some examples are:\n• Fake financial advisor calls: Claiming to represent your bank or retirement plan provider, they already know your full name, your investment type, and even the city you live in.\n• or annuity offers: Complete with official-sounding terms and personal details to make them seem legitimate.\n• Social engineering scams: Using information about your family or recent life events (like selling a home) to build trust before asking for account details.\n\nThe more accurate the personal data they have, the more convincing their story, and the higher the risk you'll believe them.\n\nReduce the target on your back\n\nEvery piece of personal information you remove from public databases is one less tool scammers can use. Removing your data can:\n• Limit how convincing those scams seem\n• Prevent your details from being resold repeatedly\n\nThink of it as changing the locks on your home before a break-in happens.\n\nHOW TO HAND OFF DATA PRIVACY RESPONSIBILITIES FOR OLDER ADULTS TO A TRUSTED LOVED ONE\n\nYou can contact data brokers and request that they delete your profile. To start, search your name online, find the sites listing your data, and follow each site's removal process. However, there's a catch:\n• There are hundreds of these companies\n• Each has a different process, often requiring ID copies or mailed letters\n• Many will repost your data within months unless you check back regularly\n\nIt's a time-consuming job that most people eventually abandon.\n\nA data removal tool handles the work for you. It:\n• Contacts hundreds of data brokers on your behalf\n• Tracks each request and follow-up to ensure deletion\n• Monitors continuously to keep your data off the lists\n\nWhile no service can guarantee the complete removal of your data from the internet, a data removal service is really a smart choice. They aren’t cheap, and neither is your privacy. These services do all the work for you by actively monitoring and systematically erasing your personal information from hundreds of websites. It’s what gives me peace of mind and has proven to be the most effective way to erase your personal data from the internet. By limiting the information available, you reduce the risk of scammers cross-referencing data from breaches with information they might find on the dark web, making it harder for them to target you.\n\nCheck out my top picks for data removal services and get a free scan to find out if your personal information is already out on the web by visiting \n\n\n\nGet a free scan to find out if your personal information is already out on the web:\n\nYou've worked too hard to let criminals take what you've built. By reducing your digital footprint, you protect both your money and your peace of mind. Start removing your personal information today, and keep your retirement exactly where it belongs, in your hands.\n\nIf you've been targeted by a scam, how did you handle it, and what advice would you give others? Let us know by writing to us at\n\nSign up for my FREE CyberGuy Report\n\nGet my best tech tips, urgent security alerts, and exclusive deals delivered straight to your inbox. Plus, you’ll get instant access to my Ultimate Scam Survival Guide - free when you join my",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/tech/data-broker-opt-out-steps-every-retiree-should-take-today",
    "https://www.foxnews.com/video/6374084075112",
    "https://www.foxnews.com/tech/how-scammers-exploit-your-data-pre-approved-retirement-scams",
    "https://www.foxnews.com/tech/data-brokers-endangering-your-retirement-security",
    "https://www.foxnews.com/tech/how-remove-your-personal-info-from-people-search-sites",
    "https://www.foxnews.com/tech/how-secure-your-401k-plan-from-identity-fraud",
    "https://www.foxnews.com/tech/how-hand-off-data-privacy-responsibilities-older-adults-trusted-loved-one"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "personal information",
      "weight": 0.10478054
    },
    {
      "name": "personal details",
      "weight": 0.089760825
    },
    {
      "name": "data brokers",
      "weight": 0.08956141
    },
    {
      "name": "data removal services",
      "weight": 0.08936615
    },
    {
      "name": "data",
      "weight": 0.083162926
    },
    {
      "name": "DATA PRIVACY RESPONSIBILITIES",
      "weight": 0.08059609
    },
    {
      "name": "information",
      "weight": 0.0760977
    },
    {
      "name": "Scammers",
      "weight": 0.0650956
    },
    {
      "name": "scammers",
      "weight": 0.0650956
    },
    {
      "name": "account details",
      "weight": 0.06186973
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.732421875
    },
    {
      "name": "/Shopping/Consumer Resources/Consumer Advocacy & Protection",
      "score": 0.51171875
    },
    {
      "name": "/Shopping/Consumer Resources/Identity Theft Protection",
      "score": 0.482177734375
    },
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.4248046875
    }
  ],
  "sentiment": {
    "positive": 0.11903628,
    "negative": 0.39355823,
    "neutral": 0.48740542
  },
  "summary": "The article suggests that simple steps can be taken to remove your personal data from risky websites and databases to prevent fraud and theft from occurring. These actions can significantly reduce fraud and protect your savings from scammers. Data brokers, companies that collect and sell personal information about nearly every adult in the US, collect this information. These profiles can be found online even without social media and are often easy to access remotely. The author recommends contacting data brokers to delete your profile and monitoring and erasing data from hundreds of websites. Additionally, removing data from public databases reduces the effectiveness of scammers' attempts to use this information to make convincing their lies appear. The article also discusses how to protect your 401(K) plan from identity theft.",
  "shortSummary": "Removing personal data from risky websites and databases can significantly reduce fraud and identity theft, enhancing retirement savings and security against scammers.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "53b81e998cdd428792b184d2281859a2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/tech/how-remove-your-personal-info-from-people-search-sites",
      "text": "Removing your personal information from people-search sites can feel pretty overwhelming. There are hundreds of these sites in the U.S. alone. In fact, the Privacy Rights Clearinghouse says there are over 500 companies that collect and sell personal information.\nAt first, it might seem impossible to get your details removed from all of them. But here's the good news: You don't need to tackle every single site. Your information isn't on all 500-plus sites.\nWith a bit of time and persistence, you can remove your info from the major ones, and every removal really counts. Let me show you exactly how to do it yourself.\nFirst, find which people-search sites have your info\nThe process will be easier if you have a list of people-search sites that have your personal information. Not only can you check them off as you go, but you'll also need a list for the last step. The easiest place to start is with a free scan that some data removal services provide. These scans automatically check a ton of people-search sites for your personal information and send you a report. You can also search for your full name on Google. This will probably bring up a mix of results, including your social media profiles.\nTHINK YOU CAN DELETE YOUR DATA YOURSELF? HERE'S WHY YOU'RE PROBABLY WRONG\nThe bigger your online presence, the more search results you'll likely have to sift through to find the people-search sites. I recommend searching for your name together with other personal details, like your email, phone number or home address. For some reason, this is more likely to bring up people-search sites, different ones depending on the combination of personal details you try. You may not be able to find all the people-search sites that have your info like this, though. You should also check any state-specific people-search sites, like StateofFlorida.com, and search all of the most popular people-search sites like:\n- Whitepages\n- Spokeo\n- BeenVerified\n- Intelius\n- MyLife\n- PeopleFinders\n- Radaris\n- TruthFinder\n- FastPeopleSearch\n- Instant Checkmate\nKeep in mind that many smaller or niche sites exist, especially those that are state or region-specific. These sites can be harder to find but may still have your information. Using scanning tools or data removal services can help uncover these less obvious listings.\nFollow the opt-out process for each site\nEvery people-search site has its own opt-out process, but most of them will require you to do something like this:\n- Find your listing: You'll usually need to search for your name, phone number, address or email on the site.\n- Submit a removal request: Most sites have an online form where you can request removal. Look for links that say \"Opt-Out,\" \"Do Not Sell My Info\" or \"Privacy Rights,\" which are usually found in the website footer.\n- Verify your request: Most sites will send you a confirmation email with a link you'll need to click. Some ask for a phone call verification. A few people-search sites request documents, like a photo ID (I recommend avoiding sending sensitive documents unless absolutely necessary). If a site insists on ID verification, try contacting their support to ask about alternative methods or consider skipping that site if you're uncomfortable.\nTOP 20 APPS TRACKING YOU EVERY DAY\nPro tip: Use a separate email address for opt-out requests\nMany sites require email verification. Using your regular email can expose it to spam or further data collection. Creating a dedicated or alias email address just for these requests helps protect your primary inbox and keeps things organized. Also, using various email aliases makes it so you don't have to worry about all your info getting taken in a data breach. An email alias address is a great way for you to stop receiving constant spam mail by simply deleting the email alias address. See my review of the best secure and private email services here.\nPhone verification and a secondary number\nIf a site requires phone verification, consider using a secondary number to avoid exposing your personal phone number. Services like Google Voice can provide you with a secondary number that you can use for online activities, keeping your primary number private. The process should take between five and 20 minutes for each site on your list, depending on how difficult they make it for you. But once you submit the request, removal is usually pretty quick. Your information should be off the site within 24 hours to a week, though it can sometimes take up to 30 days.\nDon't forget about Google search results\nPeople-search sites aren't the only places your info can pop up. Sometimes your personal info appears directly in Google search results, pulled from public records or other sites. If you find sensitive info in Google results, you can request removal through Google's own removal tools, especially if the info includes things like your Social Security number, bank account info or images you don't want to be public. This is a separate process, but it is worth doing alongside removing info from people-search sites.\nTHINK YOU CAN DELETE YOUR OWN DATA? WHY IT'S HARDER THAN YOU THINK\nKeep in mind, this isn't a one-and-done deal\nEven after you remove your info, there's a good chance it'll show up again. People-search sites constantly scrape public records and other databases to refresh their listings. Some sites offer \"suppression lists\" you can add your name to, but it's not a perfect system. Small changes, like a slightly different address, a new phone number or a missing middle name, can slip past their filters and pop up as a \"new\" profile.\nThe best way to stay on top of it is to set a reminder to recheck the main people-search sites every few months and repeat the opt-out process when needed. Maintaining a detailed tracker or spreadsheet with the sites you've contacted, dates and confirmation info can make this easier and help you avoid missing any sites.\nHOW TO GET RID OF ROBOCALLS WITH APPS AND DATA REMOVAL SERVICES\nA quick note on your rights (updated for 2025)\nThere is still no federal data privacy law in the U.S. that grants everyone the automatic right to opt out of people-search sites. However, the landscape is changing quickly at the state level. As of 2025, at least thirteen states have passed comprehensive privacy laws that give residents stronger opt-out rights, including:\n- California (California Consumer Privacy Act/California Privacy Rights Act - CCPA/CPRA)\n- Virginia (Virginia Consumer Data Protection Act - VCDPA)\n- Colorado (Colorado Privacy Act - CPA)\n- Connecticut (Connecticut Data Privacy Act - CTDPA)\n- Utah (Utah Consumer Privacy Act - UCPA)\n- Delaware (Delaware Personal Data Privacy Act - DPDPA)\n- Iowa (Iowa Consumer Data Protection Act - ICDPA)\n- Nebraska (Nebraska Data Privacy Act - NDPA)\n- New Hampshire (New Hampshire Data Privacy Act - NHDPA)\n- New Jersey (New Jersey Data Privacy Act - NJDPA)\n- Tennessee (Tennessee Information Protection Act - TIPA)\n- Minnesota (Minnesota Consumer Data Privacy Act - MCDPA)\n- Maryland (Maryland Online Data Privacy Act - MODPA)\nIf you live in one of these states, you now have a much stronger legal footing to demand that people-search sites remove your information. Many of these laws require companies to honor requests to opt out of the sale or sharing of your personal data, and some even require businesses to respect browser-based global opt-out signals. But even if you don't live in one of these states, you should still submit removal requests. Most people-search sites do not filter opt-out requests by state; they generally process any request they receive to avoid potential legal issues, regardless of your location.\nIf this sounds like too much work, there's help\nRemoving your data manually takes real time and commitment, especially since you have to keep doing it to stay off these sites. That's why many people turn to personal data removal services. Instead of going site by site yourself, a service can automatically send removal requests on your behalf, track the responses and re-request removals if your data reappears later.\nWhile no service promises to remove all your data from the internet, having a removal service is great if you want to constantly monitor and automate the process of removing your information from hundreds of sites continuously over a longer period of time. Check out my top picks for data removal services here.\nKurt's key takeaways\nManual removal is free and gives you full control, but it takes time and requires ongoing effort. Automated services cost money but save you time, handle rechecks and can catch new listings faster. Choose what best fits your budget and privacy needs. If you follow these steps and stay consistent, you can take back control of your personal information online. It might take some work, but every removal counts toward protecting your privacy.\nCLICK HERE TO GET THE FOX NEWS APP\nDo you think it should be your job to constantly remove your info from people-search sites or should companies and lawmakers be doing more to protect your privacy? Let us know by writing us at Cyberguy.com/Contact.\nFor more of my tech tips and security alerts, subscribe to my free CyberGuy Report Newsletter by heading to Cyberguy.com/Newsletter.\nAsk Kurt a question or let us know what stories you'd like us to cover.\nFollow Kurt on his social channels:\nAnswers to the most-asked CyberGuy questions:\n- What is the best way to protect your Mac, Windows, iPhone and Android devices from getting hacked?\n- What is the best way to stay private, secure and anonymous while browsing the web?\n- How can I get rid of robocalls with apps and data removal services?\n- How do I remove my private data from the internet?\nNew from Kurt:\n- Try CyberGuy's new games (crosswords, word searches, trivia and more!)\n- CyberGuy's exclusive coupons and deals\nCopyright 2025 CyberGuy.com. All rights reserved."
    },
    {
      "url": "https://www.foxnews.com/tech/data-broker-opt-out-steps-every-retiree-should-take-today",
      "text": "The tragic events in Minnesota last month stand as a solemn reminder for all Americans to reflect and take action. The gunman who targeted lawmakers may have used people search websites to hunt down his victims' home addresses before carrying out his deadly attacks. Police found a handwritten notebook in his vehicle containing a list of 11 data broker sites, along with notes about which were free and what personal data they displayed.\nWhether the suspect, Vance Boelter, actually used those sites to track down assassination targets has yet to be proven.\nThe sites included TruePeopleSearch, Spokeo, Pipl, PeopleFinders, BeenVerified, Whitepages, TruthFinder, Intelius, Ownerly, USSearch, and PeopleLooker. These same sites contain your information, too, and they sell it to anyone with a credit card.\nSign up for my FREE CyberGuy Report\nGet my best tech tips, urgent security alerts, and exclusive deals delivered straight to your inbox. Plus, you’ll get instant access to my Ultimate Scam Survival Guide - free when you join my CYBERGUY.COM/NEWSLETTER.\nYOUR HEALTH DATA IS BEING SOLD WITHOUT YOUR CONSENT\nWhich major data broker websites are tracking you?\nThe $200 billion data broker industry includes over 4,000 companies worldwide. Here are some major players:\n- Experian, Equifax and TransUnion (yes, these are credit bureaus that also broker data).\n- Acxiom, Epsilon, and CoreLogic (massive data aggregators).\n- Spokeo, BeenVerified, and TruthFinder (people search sites).\n- Whitepages, PeopleFinders, and Intelius (online directories).\nWhat personal information data brokers collect about you\nThese companies build detailed profiles that include your name, address, phone number, email, age, marital status, children's information, education, job, income, political leanings, health details, location data and purchasing habits. They gather this data from public records, social media, shopping habits, and your smartphone's location tracking.\nThe real dangers of data brokers: Privacy, scams, and identity theft\nData brokers do more than invade your privacy. They create serious real-world risks that affect your finances, safety, and overall quality of life.\nFinancial fraud: Scammers buy detailed financial profiles to specifically target seniors and people facing financial difficulties.\nPhysical safety threats: They sell your home address and phone number, putting domestic violence survivors and anyone who values privacy at serious risk.\nMedicare and healthcare scams: Scammers use your personal details to target you with fake Medicare offers, bogus health insurance plans, and medical identity theft schemes that can cost you thousands.\nSocial discrimination: Companies use your data to determine your loan rates and insurance costs, all without telling you how you're being judged.\nSpam calls and robocalls: Telemarketers and scammers buy your phone number and pester you with unwanted calls about everything from fake warranties to phony charity requests.\nThe DIY challenge: Opting out of data brokers\nYou can remove your information from data brokers, but they make it incredibly difficult on purpose. Thousands of data broker sites exist, and trying to remove your data is like trying to empty the ocean with a teaspoon. Even after you remove your info, it often pops back up again.\nWHAT IS ARTIFICIAL INTELLIGENCE (AI)?\nHow to manually remove your data from people search sites\nIf you're determined to take control of your data on your own, then here's what the step-by-step process typically looks like.\n1. Search: Find out which companies have your data by searching for yourself on major people-search sites and checking what comes up. However, many databases are private and hidden from view, so you can't always tell who has your info.\n2. Visit: Go to each website individually.\n3. Locate: Hunt for their opt-out procedures, which are usually buried in the fine print.\n4. Submit: Fill out and send removal requests. Note that some sites may require a phone call or additional forms.\n5. Follow up: Chase down companies that ignore your requests, which is unfortunately common.\n6. Monitor: Keep checking in regularly to see if your information reappears.\nPrivacy experts say handling the major data brokers alone takes 10 to 15 hours, plus ongoing monitoring.\nThe smart solution: Let a personal data removal service handle it\nIf you've tried it yourself and found the process overwhelming, there's a smarter approach. Professional data removal services can handle it for you:\n- Finding out which companies have your information.\n- Sending opt-out requests on your behalf.\n- Following up when companies don't respond.\n- Continuously monitoring for when your data pops back up.\n- Sending you regular updates on their progress.\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\nWhile no service can guarantee the complete removal of your data from the internet, a data removal service is really a smart choice. They aren’t cheap - and neither is your privacy. These services do all the work for you by actively monitoring and systematically erasing your personal information from hundreds of websites. It’s what gives me peace of mind and has proven to be the most effective way to erase your personal data from the internet. By limiting the information available, you reduce the risk of scammers cross-referencing data from breaches with information they might find on the dark web, making it harder for them to target you.\nCheck out my top picks for data removal services and get a free scan to find out if your personal information is already out on the web by visiting Cyberguy.com/Delete.\nGet a free scan to find out if your personal information is already out on the web: Cyberguy.com/FreeScan.\nKurt's key takeaways\nIt's a scary truth: data brokers have collected thousands of data points on nearly everyone with an online presence. Trying to manage all of that on your own can be overwhelming, and for most people, it simply isn't practical. Your personal information is already out there, being bought and sold every day. If you're retired or living on a fixed income, you may be an even bigger target. This isn't just about protecting your privacy. It's about safeguarding your identity, your safety, and your peace of mind.\nCLICK HERE TO GET THE FOX NEWS APP\nShould the government be doing more to stop data brokers from selling your personal information? Let us know by writing us at Cyberguy.com/Contact.\nSign up for my FREE CyberGuy Report\nGet my best tech tips, urgent security alerts, and exclusive deals delivered straight to your inbox. Plus, you’ll get instant access to my Ultimate Scam Survival Guide - free when you join my CYBERGUY.COM/NEWSLETTER.\nCopyright 2025 CyberGuy.com. All rights reserved."
    },
    {
      "url": "https://www.foxnews.com/tech/how-scammers-exploit-your-data-pre-approved-retirement-scams",
      "text": "Every year, American seniors lose over $28 billion to fraud, according to AARP. But here's the shocking part: Only a fraction ever gets reported.\nIf you've received a letter, email, or call claiming you've been \"pre-qualified\" or \"pre-approved\" for a 401(k) rollover or annuity upgrade, beware. These scams are getting smarter. They sound official and even personalized. But the offers aren't random; they're based on real details about you.\nSign up for my FREE CyberGuy Report\nGet my best tech tips, urgent security alerts and exclusive deals delivered straight to your inbox. Plus, you’ll get instant access to my Ultimate Scam Survival Guide — free when you join my CYBERGUY.COM/NEWSLETTER\n5 STEPS TO PROTECT YOUR FINANCES FROM FAMILY SCAMS\nWhy these retirement scams feel so real\nScammers now buy your personal data from data brokers to craft convincing offers. If you're in your 50s or 60s, you're a prime target. They know your age, homeownership status, estimated net worth and even retirement timeline. They don't guess, they know. Your information is being sold across hundreds of websites, and thousands of people can access it. Curious about how exposed you are?\nWHAT IS ARTIFICIAL INTELLIGENCE (AI)?\nWhat is a \"pre-qualified\" retirement scam?\nThese scams mimic real communications from financial institutions. You might get a letter or call claiming you're approved for a new investment or annuity opportunity. Scammers often use financial buzzwords like \"IRA consolidation\" or \"required minimum distribution guidance.\" The goal? To make you feel like you're dealing with a trusted expert. They create fake advisor profiles, complete with headshots, license numbers and U.S. contact info. Many even add logos or branding from familiar banks to boost credibility. But once you respond, they'll ask for private financial info or, worse, get you to transfer funds directly into their accounts.\nWhy older adults are prime targets\nScammers love targeting seniors because they typically have savings and are making major financial decisions. Plus, their data is easier to get. The unregulated data broker industry makes it easy for bad actors to find and target seniors with laser focus.\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\nHow scammers get your data\nThese scams are fueled by data purchased from brokers. These companies gather your details, compile profiles and sell them, often without your knowledge. You could appear on lists labeled \"Retirees with $250k+ Net Worth\" or \"Homeowners Nearing Retirement.\" It's disturbingly precise. Some brokers scrape public records, while others buy data from loyalty cards, surveys or sweepstakes. Bottom line: this happens quietly, behind your back.\nThe financial toll of these scams\nIn 2024, the FBI reported that seniors lost over $4.8 billion to scams, a record high. Retirement-related fraud was a major part of that. Once your money is gone, it's usually gone for good. Even if the scammer misled you, your bank may not cover the loss if you authorized the transaction. These scams drain more than just savings. They create lasting stress, fear and shame. Prevention is your best defense.\n6 warning signs of a retirement scam\nStay alert for these red flags anytime you get financial offers:\n- You didn't request the offer. If it's unsolicited, be skeptical, even if it looks legit.\n- Urges you to act fast. Pressure tactics are a classic scam move.\n- Promises \"guaranteed\" returns. No real investment can promise that.\n- Asks for sensitive details. Legitimate advisors won't demand your Social Security number or account info over email or phone.\n- References real personal info. Just because they \"know\" your retirement date, that doesn't mean they're trustworthy.\n- Lacks verifiable credentials. Always double-check licenses and business addresses through your state regulator.\nHow to protect yourself from retirement scams\nYou don't have to wait until it's too late. Follow these steps to take control today:\n1. Use a personal data removal service\nThe fewer people who can access your personal information, the safer you are. Opt out of data broker websites manually, or use a data-removal service. Manually removing yourself from hundreds of data brokers is overwhelming. A reputable service can automate the process and protect your exposure long-term. While no service can guarantee the complete removal of your data from the internet, a data-removal service is really a smart choice. They aren’t cheap, and neither is your privacy. These services do all the work for you by actively monitoring and systematically erasing your personal information from hundreds of websites. It’s what gives me peace of mind and has proven to be the most effective way to erase your personal data from the internet. By limiting the information available, you reduce the risk of scammers cross-referencing data from breaches with information they might find on the dark web, making it harder for them to target you.\nCheck out my top picks for data removal services, and get a free scan to find out whether your personal information is already out on the web by visiting Cyberguy.com/Delete\nGet a free scan to find out if your personal information is already out on the web: Cyberguy.com/FreeScan\n2. Verify the source\nContact your bank, broker or financial advisor directly. Never trust a cold call, email, or mailed offer without confirmation.\n3. Guard your personal details\nNever share your Social Security number, account numbers or full birthdate over the phone or email, even if the offer sounds legitimate.\n4. Loop in a trusted contact\nBefore making any financial moves, talk to a family member or someone you trust. A second opinion can expose red flags.\n5. Block scam messages\nUse spam filters, call blockers and browser protections to stop scam messages before they reach you.\n6. Use strong antivirus software\nProtect your devices from phishing links and malicious downloads that scammers use to steal personal info. The best way to safeguard yourself from malicious links that install malware, potentially accessing your private information, is to have antivirus software installed on all your devices. This protection can also alert you to phishing emails and ransomware scams, keeping your personal information and digital assets safe.\nGet my picks for the best 2025 antivirus protection winners for your Windows, Mac, Android & iOS devices CyberGuy.com/LockUpYourTech\n7. Monitor your accounts\nRegularly check your bank, investment and credit accounts for unusual activity, and set up alerts for transactions.\n8. Report suspicious activity\nIf you think you've been targeted, file a report with the FTC at reportfraud.ftc.gov. It helps investigators and prevents others from falling victim.\n9. Stay informed\nSubscribe to alerts from trusted sources like CyberGuy to stay ahead of new scams targeting seniors and retirees by signing up for my free CyberGuy Report newsletter at CYBERGUY.COM/NEWSLETTER\nWhat this means for you\nIf you're planning your retirement, you must be extra cautious. Scammers are watching, and they're armed with your data. Blocking them starts with controlling what's out there. The less they know, the harder it is to fool you.\nCLICK HERE TO GET THE FOX NEWS APP\nKurt's key takeaways\nDon't assume an offer is real just because it uses your real data. That's often a sign it's a scam. Scammers thrive on your personal information. Take control by locking it down, verifying offers and refusing to be rushed into decisions.\nShould data brokers be required to get your permission before selling your information? Let us know by writing to us at Cyberguy.com/Contact\nSign up for my FREE CyberGuy Report\nGet my best tech tips, urgent security alerts, and exclusive deals delivered straight to your inbox. Plus, you’ll get instant access to my Ultimate Scam Survival Guide — free when you join my CYBERGUY.COM/NEWSLETTE\nCopyright 2025 CyberGuy.com. All rights reserved."
    },
    {
      "url": "https://www.foxnews.com/tech/how-secure-your-401k-plan-from-identity-fraud",
      "text": "Your 401(k) might be one of the most valuable things you've got. And scammers are well aware of this. So, while you're focused on building a nest egg, they're out there coming up with new ways to take it from right under you. The tricky part is that most of us don't check our 401(k) accounts all that often, which makes it harder to spot unusual charges. And that gives cybercriminals the upper hand.\nThis isn't ideal for anyone, but the risks become even more serious the closer you get to retirement. For one thing, you've likely saved up a good sum. But, what's worse, a single successful attack could leave you without the cushion of your savings at a vulnerable time in life. This doesn't mean you're defenseless, though.\nThere's plenty you can do to protect yourself. I'll go over how criminals gain access to 401(k) accounts, what I personally recommend for locking things down, and what to do if something doesn't feel right.\nSign up for my FREE CyberGuy Report\nGet my best tech tips, urgent security alerts, and exclusive deals delivered straight to your inbox. Plus, you’ll get instant access to my Ultimate Scam Survival Guide - free when you join my CYBERGUY.COM/NEWSLETTER.\nHOW SCAMMERS EXPLOIT YOUR DATA FOR ‘PRE-APPROVED’ RETIREMENT SCAMS\nCommon types of 401(k) identity fraud\nContrary to popular belief, criminals don't always need to \"hack\" their way in. In fact, 99% of cyberattacks require you to let them in. So, social engineering is a favorite tactic. However, you should also be wary of traditional, less sophisticated attacks.\nThese are the tactics I see criminals use most often:\n- Phishing emails and fake logins. These look legit, but they take you to a fake site designed to steal your login. Criminals may make the message appear to come from your provider or the bank, then steal your information by asking you to \"verify\" your account.\n- Phone scams and robocalls. You may receive calls from the \"IRS\" or \"retirement office\" saying there's a problem with your 401(k). These scams always have a sense of urgency, using fear to pressure you into handing over personal information.\n- Loan and withdrawal fraud. Criminals may ask for an early withdrawal or loan and reroute the money to their own account.\n- 401(k) rollover scams. Scammers may ask you to move your funds into an individual retirement account (IRA), then try to convince you to make high-risk or worthless investments.\n- Business email compromise. Criminals may pose as HR or payroll and ask you to change your contribution settings or give them access to your account.\n- AI-powered impersonation. Cybercriminals can use deepfake voice tech and advanced chat tools to trick you into thinking you're speaking with someone you trust, like your financial advisor or even your spouse.\n- Mail theft. One of the easiest ways to steal from your 401(k) is by intercepting rollover checks sent through the mail. All they really need is your address.\n- SIM swapping and malware. Scammers can intercept security codes and log in to your account by hijacking your phone number or infecting your device.\nHow I recommend securing your 401(k)\nIt comes down to a few small habits to maintain your digital hygiene. Most of these focus on keeping your sensitive information private and secure. Data brokers actually collect and sell that information, making it easier for scammers to target you, things like your contact details, employment history, address, date of birth, and more. These companies have even been caught intentionally selling scammers data belonging to elders (who, unsurprisingly, later fell victim to elder fraud). Here's what I recommend you do to protect yourself from 401(k) scams:\nWHAT IS ARTIFICIAL INTELLIGENCE (AI)?\n1) Keep your personal information locked down\nYour data is the biggest weapon in a cybercriminal's arsenal. Taking it away reduces the risk of ever ending up on their radar to begin with. I use a data removal service to handle this part for me. While no service promises to remove all your data from the internet, having a removal service is great if you want to constantly monitor and automate the process of removing your information from hundreds of sites continuously over a longer period of time.\nCheck out my top picks for data removal services and get a free scan to find out if your personal information is already out on the web by visiting Cyberguy.com/Delete\nGet a free scan to find out if your personal information is already out on the web: Cyberguy.com/FreeScan.\n2) Use a strong password\nMake sure it's unique (never reuse passwords), at least eight characters, and complex. Try to keep it completely random and use a mix of numbers, symbols, and upper and lower case letters. This makes it much harder to crack. Consider using a password manager, which securely stores and generates complex passwords, reducing the risk of password reuse.\nCheck out the best expert-reviewed password managers of 2025 at Cyberguy.com/Passwords.\n3) Enable multi-factor authentication (MFA)\nIf your provider offers this option, it adds an extra layer of security. Check out my top picks for the top multi-factor authentication apps to protect your accounts.\n4) Check your 401(k) regularly\nI log in about once a month just to see if anything looks off. Many attacks don't result in obvious signs, so it may be too late to notice them in time unless you're actively looking.\n5) Turn on notifications and keep contact details up to date\nMost providers let you enable alerts for logins, withdrawals, and password changes. This way, if anyone does gain access, at least you'll know.\n6) Avoid using public Wi-Fi\nIf you're checking your account from a café or airport, cybercriminals can intercept your login credentials or other sensitive information. If it can't be avoided, make sure to use a good VPN to keep the connection secure.\nFor the best VPN software, see my expert review of the best VPNs for browsing the web privately on your Windows, Mac, Android & iOS devices at Cyberguy.com/VPN.\nIf you suspect 401(k) fraud, act fast\nSpeed is everything when it comes to financial fraud. These steps can help stop the damage and improve your chances of recovery:\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n1) Contact your plan provider immediately\nCall your 401(k) provider and request a freeze or lock on the account to prevent further activity.\n2) Notify your employer or plan administrator\nIf your retirement plan is through your job, loop in HR or your plan administrator right away. They may be able to escalate your case faster.\n3) Report the fraud to the government\nFile a complaint at IdentityTheft.gov and contact the Federal Trade Commission (FTC). If you lost money, also report it to your local police department.\n4) Freeze or flag your credit\nPlace a fraud alert or credit freeze with the major credit bureaus-Equifax, Experian, and TransUnion. This helps prevent further identity theft or loan fraud.\n5) Document every detail\nWrite down everything you know while it's still fresh-dates, suspicious activity, phone calls, emails, and names of people you spoke with. This information will be critical during any investigation.\n6) Check related accounts\nIf your 401(k) was compromised, check your bank accounts, credit cards, and other investment accounts for signs of suspicious activity.\n7) Change all related passwords\nImmediately change the login credentials for your 401(k), email, and any accounts connected to it. Use strong, unique passwords and enable multi-factor authentication.\n8) Watch for follow-up scams\nFraudsters may try again, posing as recovery services or investigators. Be cautious of anyone who contacts you unsolicited about the fraud.\nThe faster you move, the better your chances of mitigating the damage (and maybe even getting some of it reversed).\nCLICK HERE TO GET THE FOX NEWS APP\nKurt's key takeaways\nYour 401(k) should be building your future, not funding a scammer's payday. While most people check their retirement accounts less often than their email, that's exactly what cybercriminals count on. They're hoping you'll let your guard down. The good news? You have more control than you think. By locking down your personal info, checking your account regularly, and setting up the right alerts, you can stay one step ahead. It takes just a few small habits to protect one of your biggest financial assets. Don't wait until something goes wrong. A little attention now could save you everything later.\nIf someone drained your 401(k) tomorrow, how long would it take you to notice? Let us know by writing to us at Cyberguy.com/Contact.\nSign up for my FREE CyberGuy Report\nGet my best tech tips, urgent security alerts, and exclusive deals delivered straight to your inbox. Plus, you’ll get instant access to my Ultimate Scam Survival Guide - free when you join my CYBERGUY.COM/NEWSLETTER.\nCopyright 2025 CyberGuy.com. All rights reserved."
    },
    {
      "url": "https://www.foxnews.com/tech/data-brokers-endangering-your-retirement-security",
      "text": "You know, it's pretty unsettling when you think about it. We spend our whole lives working hard and saving up for retirement. Then, one day, you find out that some company you've never heard of is selling your personal information to whoever wants to buy it. It's not just alarming. It could actually put your financial security at risk.\nThese companies are data brokers that collect and sell people's personal information, often without us even knowing about it. And get this: Some of them might be trading info that could affect your retirement savings.\nCrazy, right? But don't worry, it's not all doom and gloom. There are things we can do to protect ourselves. I want to talk about how these data brokers operate and what steps you can take to keep your retirement plans safe.\nGET SECURITY ALERTS, EXPERT TIPS - SIGN UP FOR KURT’S NEWSLETTER - THE CYBERGUY REPORT HERE\nHow data brokers are endangering your retirement security\nThere’s one major way in which data brokers are endangering your retirement security, and it’s right there in the name: data brokers buy, sell, trade and otherwise spread your personal information far and wide. This endangers your retirement security in three distinct ways, each more dangerous than the last:\n1. Spray ‘n’ pray campaigns\nThey don’t know anything about you, but they have a way to reach you. Even if a scammer knows only your phone number or email address, it’s enough for them to reach out to you. If they don’t know who you are or anything about you, they have to take the most \"one-size-fits-all\" approach they can manage. Their goal is to get you to respond to them or click a link that leads to a malicious website. Once they learn more about you, they can better tailor their next moves.\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n2. A fire hose aimed in your general direction\nThey know what you’re like but not who you are. Scammers can buy ready-made packages of personal information from data brokers. A set like this might include only the phone numbers of people over the age of 60, for example, while another might provide the addresses of elderly people who require live-in care and are experiencing cognitive decline. The potential for abuse is clear. They don’t have to know your name to target a dangerously effective scam at you.\n3. A water pistol to the ear\nIn other words, something aimed right at you and very difficult to ignore. Scammers can also buy shockingly detailed information about you, from your full name to your health care and financial information. These scams are the most dangerous, with the attackers knowing enough about you to breeze past many of your defenses.\nAny of the above types of scams can end in what might be the ultimate fraud – identity theft – but these three are more likely to get there, and in fewer steps, than the others.\nWHAT IS ARTIFICIAL INTELLIGENCE (AI)?\nMASSIVE DATA BREACH AT FEDERAL CREDIT UNION EXPOSES 240,000 MEMBERS\nWhat you can do to protect your retirement security\nYou can reduce or avoid many of these risks by stopping data brokers from making it easier for scammers to target you and by arming yourself against the most common and effective tactics they use.\n1. Invest in personal data removal services: A trusted personal information removal service can stop data brokers in their tracks from sharing your information. While no service promises to remove all your data from the internet, having a removal service is great if you want to constantly monitor and automate the process of removing your information from hundreds of sites continuously over a longer period of time. Check out my top picks for data removal services here.\n2. Don’t click on links: No matter how much pressure or stress a message or phone call puts you under, stick to the golden rule of never following or clicking on links. Always go to the source of the communication via official channels from a secure device to confirm what’s happening. The best way to safeguard yourself from malicious links that install malware, potentially accessing your private information, is to have antivirus software installed on all your devices. This protection can also alert you to phishing emails and ransomware scams, keeping your personal information and digital assets safe. Get my picks for the best 2025 antivirus protection winners for your Windows, Mac, Android and iOS devices.\n3. Don’t give out sensitive information: If a message or email can put you under enough pressure to do something you shouldn’t (like follow a link to a phishing site), imagine what a phone call can do. Any request for personal information should raise red flags. If something seems off, hang up.\nUNDERSTANDING BRUSHING SCAMS AND HOW TO PROTECT YOURSELF\n4. Verify identities before handing over money or information: Always verify who you are dealing with before providing any personal details (name, address, date of birth, Social Security number, financial information, etc.) or money. If someone asks for this information or claims they need to send you money, follow this rule: \"Hang up, look up and call back.\" This applies to phone calls, texts and emails. Hang up or set the message aside, find the legitimate contact information for the organization in question and reach out through official channels (not social media) to confirm the request.\nTOP 5 MISTAKES THAT COULD EXPOSE YOUR FINANCIAL DATA TO CYBERCRIMINALS\nKurt’s key takeaways\nYou know, it's crazy to think about how much of our personal information is out there, floating around in the digital world. But here's the thing: We're not powerless in this situation. Sure, it can feel overwhelming, but there are steps we can take to protect ourselves and our hard-earned retirement savings. It's all about being aware, staying vigilant and using the tools at our disposal. Remember, your financial security is worth fighting for. So let's not just sit back and hope for the best. Let's take action and show those data brokers that we're not going to be easy targets. After all, we've worked too hard for too long to let anyone mess with our golden years, right?\nCLICK HERE TO GET THE FOX NEWS APP\nDo you think there should be regulations in place to limit the activities of data brokers, and what specific measures would you like to see implemented to better protect your personal information? Let us know by writing us at Cyberguy.com/Contact.\nFor more of my tech tips and security alerts, subscribe to my free CyberGuy Report Newsletter by heading to Cyberguy.com/Newsletter.\nAsk Kurt a question or let us know what stories you'd like us to cover.\nFollow Kurt on his social channels:\nAnswers to the most asked CyberGuy questions:\n- What is the best way to protect your Mac, Windows, iPhone and Android devices from getting hacked?\n- What is the best way to stay private, secure and anonymous while browsing the web?\n- How can I get rid of robocalls with apps and data removal services?\n- How do I remove my private data from the internet?\nNew from Kurt:\nCopyright 2025 CyberGuy.com. All rights reserved."
    },
    {
      "url": "https://www.foxnews.com/tech/how-hand-off-data-privacy-responsibilities-older-adults-trusted-loved-one",
      "text": "When I think about my golden years, I picture myself enjoying new hobbies and spending more time with loved ones. Yet, some of the very things that mark a well-lived life, like a fixed address, a long-time phone number, and a healthy savings account, also put you at risk of scams.\nThat's why you must protect your personal information. Today, it stands as the number one target for fraud. According to recent studies, 72% of elder fraud cases involve exposed personal data.\nManaging data privacy for older adults has become increasingly difficult. Threats evolve constantly, security settings change frequently, and scammers get smarter. Fortunately, you don't have to handle this alone.\nSign up for my FREE CyberGuy Report\nGet my best tech tips, urgent security alerts, and exclusive deals delivered straight to your inbox. Plus, you’ll get instant access to my Ultimate Scam Survival Guide - free when you join my CYBERGUY.COM/NEWSLETTER.\nHow a trusted loved one can help protect data privacy for older adults\nOne of the best ways to protect your data is by bringing a trusted loved one into the loop. This person can serve as your privacy partner, helping you stay safe while respecting your independence.\n- Spot phishing scams and fake messages.\n- Set up call blockers and scam filters, and adjust security settings.\n- Remove your personal information from the web.\n- Keep an eye on suspicious activity without taking over control.\nChoosing the right person to help with data privacy for older adults\nThat person could be a grown child, a niece or nephew, a sibling, or even a longtime friend. The key is finding someone tech-comfortable and dependable, someone who respects your boundaries.\nKeep in mind, almost 58% of financial exploitation of older adults is perpetrated by family members, so being related doesn't automatically make someone trustworthy. Before giving anyone access to your accounts or personal information, ask yourself:\n- Have they ever pressured me about money?\n- Do they respect my decisions and boundaries?\n- Would I trust them with my house keys or bank card?\nPrivacy checklist for older adults: What to protect\nThink of this like walking through your house and checking which doors need locks. Your digital life needs the same attention, and it helps to know where you might want backup. Here's a quick rundown of what to look at, why it matters, and when help is appropriate:\nPhone number\nYour cell phone number is often tied to two-factor authentication (2FA), account recovery, and scams like SIM swapping. It's smart to set up call blockers and lock your SIM. This is something someone tech-savvy can help you with.\nHome address\nYour address can be used in phishing attacks or even in-person scams. If it's listed on people-search sites, someone can help you remove it.\nEmail account\nThis is the gateway to most of your online life. Setting up strong two-factor authentication and email filters is a good idea. You might want help, but only if you trust the person completely.\nBank accounts\nThese are high-value targets. No one should have your passwords, but you can accept help setting up fraud alerts or reviewing account settings together.\nMedical portals\nThey hold sensitive health and billing info. You might want help making sure your logins are secure, but no one else needs access.\nSocial media accounts\nThese can be used to impersonate you or collect information. It's okay to get help locking down your privacy settings.\nShopping accounts\nMany store your address and credit card info. A trusted helper can assist you with clearing out old or unused accounts.\nPro tip: Jot this list down or print it out. Check off the areas where you'd like help, and mark the ones you'll handle solo. This makes conversations with family, caregivers, or tech support much easier and sets clear boundaries. And remember: you don't need to give full access to anyone. A little help is fine, but your privacy is yours to control.\nEssential privacy protections older adults should set up with a trusted partner\nOnce you’ve got your privacy partner and checklist in place, it’s time to start locking things down. These basic protections stop most scams before they start, and you don’t need to be a tech expert to get them working.\n1) Phone & device security\n- Add a SIM PIN so no one can steal your number.\n- Install a spam call blocker.\n- Set a strong screen lock (PIN, fingerprint, or face ID).\n- Turn on automatic updates so your software stays secure.\n- Use a password manager to keep logins safe and organized.\nGet more details about my best expert-reviewed Password Managers of 2025 at Cyberguy.com/Passwords.\n2) Scam & spam filtering\n- Turn on spam filters in your email.\n- Don’t respond to strange texts or emails, even if they sound urgent.\n- Mark anything suspicious as spam (don’t click or reply).\n3) Financial safeguards\n- Set up bank alerts for large or strange transactions.\n- Add a trusted contact to your bank profile (not full access, just someone to notify).\n- If needed, give read-only access to someone you trust to monitor, not manage your accounts.\n- Ask your bank about fraud protection options for older adults.\n- Talk to a lawyer if you want to set up a Power of Attorney for emergencies.\n4) Data removal\n- Remove personal information from social media and set profiles to private.\n- Remove personal information from people search sites and data brokers.\n- Let your privacy partner help monitor opt-out progress, but stay in the loop yourself.\n- Consider using a data removal service to keep your personal information offline.\nCheck out my top picks for data removal services and get a free scan to find out if your personal information is already out on the web by visiting Cyberguy.com/Delete.\nGet a free scan to find out if your personal information is already out on the web: Cyberguy.com/FreeScan.\nKurt's key takeaways\nStaying safe online doesn't mean giving up control. It means using the right tools and the right people to support your privacy. A few smart steps today can protect everything you've worked so hard to build.\nHave you had the privacy conversation with your loved ones yet? Why or why not? Let us know by writing us at Cyberguy.com/Contact.\nSign up for my FREE CyberGuy Report\nGet my best tech tips, urgent security alerts, and exclusive deals delivered straight to your inbox. Plus, you’ll get instant access to my Ultimate Scam Survival Guide - free when you join my CYBERGUY.COM/NEWSLETTER.\nCopyright 2025 CyberGuy.com. All rights reserved."
    }
  ],
  "argos_summary": "The article warns that data brokers collect and sell retirees’ personal information, enabling sophisticated identity‑theft and retirement scams that cost seniors billions. It explains how scammers use details from people‑search sites to craft targeted offers and phishing attacks, and cites recent statistics on elder fraud. The piece offers practical steps—opt‑out from data brokers, use data‑removal services, enable MFA, monitor accounts, and involve trusted family members—to reduce exposure and protect retirement assets. It also highlights emerging state privacy laws and encourages readers to stay vigilant and proactive.",
  "argos_id": "6E71YMBDQ"
}