{
  "url": "https://financialpost.com/pmn/back-to-school-spending-causing-financial-strain-for-many-parents-poll",
  "authorsByline": "The Canadian Press",
  "articleId": "956bf13f32fe48feb91f2744ba009412",
  "source": {
    "domain": "financialpost.com",
    "paywall": true,
    "location": {
      "country": "ca",
      "city": "Toronto",
      "coordinates": {
        "lat": 43.6534817,
        "lon": -79.3839347
      }
    }
  },
  "imageUrl": "",
  "country": "ca",
  "language": "en",
  "pubDate": "2025-08-21T16:24:26+00:00",
  "addDate": "2025-08-21T16:32:05.751503+00:00",
  "refreshDate": "2025-08-21T16:32:05.751504+00:00",
  "score": 1.0,
  "title": "Back-to-school spending causing financial strain for many parents: poll",
  "description": "TORONTO — Back-to-school season is straining most families’ budgets this year, according to a new poll, with 60 per cent of parents saying the cost of supplies has …",
  "content": "TORONTO — Back-to-school season is straining most families’ budgets this year, according to a new poll, with 60 per cent of parents saying the cost of supplies has increased since last year.\n\nThe online poll conducted by Leger this month found 63 per cent of parents say the return to school is having a significant impact on their finances, including nearly one-fifth who say the effect is “very significant.”\n\nCompared to last year, 21 per cent of parents say the cost of supplies is “much higher” and only a third report the cost being about the same.\n\nGet the latest headlines, breaking news and columns.\n• There was an error, please provide a valid email address. A welcome email is on its way. If you don't see it, please check your junk folder. The next issue of Top Stories will soon be in your inbox. We encountered an issue signing you up. Please try again\n\nAccording to Statistics Canada’s Consumer Price Index, the cost of living is up 1.7 per cent over last July, but grocery prices are rising at a higher rate — up 3.4 per cent over last year.\n\nStatistics Canada’s Consumer Price Index shows the cost of stationery across Canada has risen three per cent since last year, while children’s clothing has gone up by an average of 1.2 per cent across the country, with major variation between regions.\n\nSeventy-five per cent of parents say the price tag was one of their top three priorities when choosing which supplies to buy, while quality was a priority for 54 per cent and the ability to get all of their items in one place came in third, with 28 per cent listing it as an influence.\n\nWhile the “Buy Canadian” movement gripped the country earlier this year, it doesn’t seem to have translated to school shopping: only six per cent of parents listed the items’ country of origin as a factor influencing their decision.\n\nParents were most likely to buy the supplies from a big-box retailer such as Walmart or Canadian Tire, with 61 per cent saying that’s where they go. Another 38 per cent said they bought from dollar stores.",
  "medium": "Article",
  "links": [
    "https://financialpost.com/video-centre/",
    "https://financialpost.com/subscribe"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "last year",
      "weight": 0.09458156
    },
    {
      "name": "many parents",
      "weight": 0.08395601
    },
    {
      "name": "Parents",
      "weight": 0.08094803
    },
    {
      "name": "parents",
      "weight": 0.08094803
    },
    {
      "name": "1.2 per cent",
      "weight": 0.07919481
    },
    {
      "name": "1.7 per cent",
      "weight": 0.07919481
    },
    {
      "name": "21 per cent",
      "weight": 0.07919481
    },
    {
      "name": "28 per cent",
      "weight": 0.07919481
    },
    {
      "name": "3.4 per cent",
      "weight": 0.07919481
    },
    {
      "name": "54 per cent",
      "weight": 0.07919481
    }
  ],
  "topics": [
    {
      "name": "Polls"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Jobs & Education/Education/Primary & Secondary Schooling (K-12)",
      "score": 0.71875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.56396484375
    },
    {
      "name": "/News/Other",
      "score": 0.467529296875
    },
    {
      "name": "/News/Local News",
      "score": 0.4287109375
    },
    {
      "name": "/People & Society/Family & Relationships/Family/Other",
      "score": 0.33984375
    }
  ],
  "sentiment": {
    "positive": 0.330735,
    "negative": 0.29978517,
    "neutral": 0.36947986
  },
  "summary": "A new poll conducted by Leger has found that 60% of parents have reported that the cost of supplies has increased since last year, with 21% of them saying it is significantly higher compared to last year. The cost of living is up 1.7% over the previous year, but grocery prices are rising at a higher rate of 3.4%. Statistics Canada's Consumer Price Index indicates that the costs of stationery across Canada have risen three per cent since the previous fiscal year, while children's clothing has risen by an average of 1.2% across the country. 75% of respondents said the price tag was one of their top three priorities when choosing supplies, while 54% said quality was a priority for them.",
  "shortSummary": "A poll reveals that the high cost of school supplies is significantly impacting parents' finances, with 60% citing increased costs compared to last year.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "bfc058e6fae044849b401b88103409e1",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "A new Leger poll finds that back‑to‑school costs are straining families, with 60% of parents reporting higher supply prices and 63% saying school shopping significantly impacts their finances. Twenty‑one percent say supplies are much more expensive than last year, while only a third see costs unchanged. Canada’s CPI shows a 1.7% rise in living costs, with stationery up 3% and children’s clothing up 1.2%. Parents prioritize price (75%), quality (54%) and convenience (28%), buying mainly from big‑box retailers like Walmart and Canadian Tire, and only 6% consider the country of origin.",
  "argos_id": "73YLUJ5KG"
}