{
  "url": "https://www.nydailynews.com/2025/08/21/andy-reid-shooting-kansas-city-chiefs-office-bullet/",
  "authorsByline": "Joseph Wilkinson",
  "articleId": "123a85f2a558433a8fc65fe1872d026c",
  "source": {
    "domain": "nydailynews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.nydailynews.com/wp-content/uploads/2025/08/GettyImages-2220935595.jpg?w=1024&h=683",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T18:21:54+00:00",
  "addDate": "2025-08-21T18:54:18.295021+00:00",
  "refreshDate": "2025-08-21T18:54:18.295023+00:00",
  "score": 1.0,
  "title": "Bullet entered office of Chiefs coach Andy Reid last year with him inside",
  "description": "The bullet missed Reid by about 15 feet, while another gunshot struck one floor above his office.",
  "content": "A bullet broke glass and entered Kansas City Chiefs coach Andy Reid’s office while he was at work last year, according to a report published Wednesday.\n\nThe bullet missed Reid by about 15 feet and was lodged in a wall between Reid’s bathroom and the entry door to his office, the Kansas City Star reported. No one was injured in the May 2024 incident.\n\nThe shooting was not publicly known until the Star published its report on Wednesday. No suspects have been identified, and the circumstances of the incident remain unclear.\n\n“There is no indication this was a targeted incident at any person or organization,” Kansas City Police Captain Jake Becchina told the Star. “Because the building was occupied at the time of the bullet coming through the window, the case is being investigated as an aggravated assault.”\n\nThe shot was fired shortly after midnight on May 4, 2024, according to the Star. Reid is known for keeping long hours at the facility. After the shooting, his office was replaced with bulletproof glass.\n\nAt the same time, two other gunshots hit the Chiefs facility. One hit the third floor, a level above Reid’s office, and another struck an outdoor air conditioner.\n\nReid showed no public indication that the incident rattled him. He led the Chiefs to a Super Bowl championship just three months before the shooting and brought the team back to the title game nine months later, though they were blown out by the Philadelphia Eagles.",
  "medium": "Article",
  "links": [
    "https://www.kansascity.com/sports/nfl/kansas-city-chiefs/article311767668.html",
    "https://kcpolice.org/",
    "https://www.kansascity.com/sports/nfl/kansas-city-chiefs/article311679273.html",
    "https://www.nydailynews.com/2024/02/12/antwan-staley-its-time-to-place-andy-reid-among-the-all-time-great-nfl-coaches/",
    "https://www.chiefs.com/team/coaches-roster/andy-reid"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Chiefs coach Andy Reid",
      "weight": 0.12365738
    },
    {
      "name": "Kansas City Chiefs",
      "weight": 0.11683702
    },
    {
      "name": "Andy Reid",
      "weight": 0.110694684
    },
    {
      "name": "Kansas City Police",
      "weight": 0.10209571
    },
    {
      "name": "Reid",
      "weight": 0.10146462
    },
    {
      "name": "Kansas City Chiefs coach Andy Reid’s office",
      "weight": 0.10126692
    },
    {
      "name": "Kansas City Police Captain Jake Becchina",
      "weight": 0.10067775
    },
    {
      "name": "office",
      "weight": 0.09033759
    },
    {
      "name": "Chiefs",
      "weight": 0.081429236
    },
    {
      "name": "last year",
      "weight": 0.07467026
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.970703125
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.95947265625
    },
    {
      "name": "/News/Sports News",
      "score": 0.90234375
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.71923828125
    },
    {
      "name": "/News/Local News",
      "score": 0.66845703125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.58544921875
    },
    {
      "name": "/News/Other",
      "score": 0.54248046875
    }
  ],
  "sentiment": {
    "positive": 0.0552995,
    "negative": 0.72275937,
    "neutral": 0.22194114
  },
  "summary": "A bullet broke through glass and entered the office of Kansas City Chiefs coach Andy Reid while he was at work last year. The bullet missed Reid by about 15 feet and was lodged in a wall between Reid's bathroom and the entry door to his office. No one was injured in the incident, which occurred shortly after midnight on May 4, 2024. The incident is being investigated as an aggravated assault. After the shooting, Reid's office was replaced with bulletproof glass.",
  "shortSummary": "A bullet was fired into Kansas City Chiefs coach Andy Reid’s office, causing a minor injury and prompting an investigation into possible workplace-related issues.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "81d07d5fe5b9438982479f046c2facce",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.chiefs.com/team/coaches-roster/andy-reid",
      "text": "Kansas City Chiefs Official Team Website | Chiefs.com\nBiography\nAndy Reid enters his 13th season at the helm of the Kansas City Chiefs in 2025. He was hired as the club's 13th head coach in franchise history on January 7, 2013.\nEntering his 27th season as an NFL head coach, Reid owns a 273-146-1 regular season record and adds a 28-17 postseason record, giving him 301 total wins, which ranks fourth in NFL history and first among active head coaches. He is the first head coach to become the winningest coach for two different franchises (Chiefs, 143 regular season wins; Eagles, 130 regular season wins). Reid is a three-time Super Bowl Champion (LIV, LVII, LVIII). In 2019, his squad beat the San Francisco 49ers 31-20 in Super Bowl LIV. Just three seasons later, he led the Chiefs to three-straight Super Bowls (LVII, LVIII, LIX), winning back-to-back championships, marking the first time in NFL history a club won back-to-back Super Bowl titles in two decades. Kansas City beat the Philadelphia Eagles 38-35 in Super Bowl LVII followed by a 25-22 overtime victory over the San Francisco 49ers in Super Bowl LVIII.\nAndy Reid enters his 13th season at the helm of the Kansas City Chiefs in 2025. He was hired as the club's 13th head coach in franchise history on January 7, 2013.\nEntering his 27th season as an NFL head coach, Reid owns a 273-146-1 regular season record and adds a 28-17 postseason record, giving him 301 total wins, which ranks fourth in NFL history and first among active head coaches. He is the first head coach to become the winningest coach for two different franchises (Chiefs, 143 regular season wins; Eagles, 130 regular season wins). Reid is a three-time Super Bowl Champion (LIV, LVII, LVIII). In 2019, his squad beat the San Francisco 49ers 31-20 in Super Bowl LIV. Just three seasons later, he led the Chiefs to three-straight Super Bowls (LVII, LVIII, LIX), winning back-to-back championships, marking the first time in NFL history a club won back-to-back Super Bowl titles in two decades. Kansas City beat the Philadelphia Eagles 38-35 in Super Bowl LVII followed by a 25-22 overtime victory over the San Francisco 49ers in Super Bowl LVIII.\nReid joined the Chiefs after 14 seasons as Head Coach/Executive Vice President of Football Operations of the Philadelphia Eagles where he compiled a 130-93-1 (.583) regular season record. Including his years as an assistant coach, Reid's teams have made the playoffs 26 times (37-22 record). He has coached in eight Super Bowls and 15 Championship Games (8 NFC, 7 AFC), including being the first coach in NFL history to coach in five-consecutive home Conference Championship Games (2018-22). He owns three NFL Coach of the Year honors.\nSince his arrival in Kansas City, Reid's teams have made it to the playoffs 11 out of 12 seasons and played in seven-straight AFC Championship games (2018-24). He has led his squad to the Super Bowl five times in six seasons (2019, 2020, 2022, 2023, 2024), winning three championships, including back-to-back titles. In 12 seasons under Reid, the Chiefs have recorded 11 10-plus win seasons, logging a .730 (143-53) winning percentage, which is the top mark in franchise history.\nReid led the 2024 Kansas City Chiefs to a 15-2 record, the best single-season record in franchise history and extended its current streak to nine-straight AFC West division championships. As the No. 1 seed in the NFL playoffs, the club beat the Houston Texans 23-14 in the Divisional Round, marking Reid's 300th career win which made him just the fourth coach in NFL history to record 300 wins. The team then beat the Buffalo Bills 32-29 in the club's seventh-consecutive AFC Championship Game.\nReid's 2023 squad achieved an 11-6 record, extending the club's franchise record streak to eight-straight division titles. Entering the playoffs as the No. 3 seed, the Chiefs beat the Miami Dolphins 26-7 in the Wild Card Round at home before QB Patrick Mahomes had to play a playoff game on the road for the first time in his six-year career as a starter. The club beat the No. 2 seed Buffalo Bills 27-24 in the Divisional Round and the No. 1 seed Baltimore Ravens 17-10 in the AFC Championship Game before taking down the San Francisco 49ers 25-22 in overtime in Super Bowl LVIII. Mahomes earned his third Super Bowl MVP honor as the club secured its third Super Bowl title (LIV, LVII, LVIII) in five seasons. Earlier that season in a Week 5 win over the Minnesota Vikings, Reid surpassed Pro Football Hall of Fame Coach Tom Landry to sit in the fourth spot on the NFL's all-time wins list.\nIn 2022, Reid led his team to a 14-3 record, securing the club's seventh-consecutive AFC West title and a No. 1 seed in the playoffs. The Chiefs defeated the Jacksonville Jaguars 27-20 in the Divisional Round and beat the Cincinnati Bengals 23-20 in an AFC Championship Game rematch, extending the club's NFL record to five championship games hosted at GEHA Field at Arrowhead Stadium. The Chiefs went on to beat the Philadelphia Eagles 38-35 in Super Bowl LVII. Under Reid's tutelage, QB Patrick Mahomes added his second NFL MVP (2019, 2022) honor and second Super Bowl MVP (LIV, LVII) award to his resume after leading the NFL in several statistical categories, including passing yards (5,250), touchdowns (41) and 25+ yard passes (49).\nReid's 2021 squad recorded a 12-5 record in the NFL's first 17-game season, won a sixth-straight AFC West title and secured the No. 2 seed in the AFC. Kansas City defeated Pittsburgh 42-21 in the wild card round and Buffalo 42-36 in the Divisional Round en route to hosting the AFC Championship Game at GEHA Field at Arrowhead Stadium. The Chiefs fell to Cincinnati 27-24. In Week 4, Reid recorded his 100th victory with Kansas City (postseason included), becoming the first head coach in NFL history to tally 100-plus wins with two franchises.\nThe 2020 Kansas City Chiefs tallied a franchise-record 14 wins (14-2 record), won their fifth-straight AFC West title and secured the No. 1 seed in the AFC for the second time in three years (2018, 2020). Kansas City defeated Cleveland 22-17 in the Divisional Round and Buffalo 38-24 in its third-consecutive AFC Championship Game at GEHA Field at Arrowhead Stadium. Kansas City hoisted the Lamar Hunt Trophy as AFC Champions for the second-straight year en route to its second-consecutive Super Bowl appearance. After just three years as starting QB, Reid-mentored Mahomes was the fastest player to throw 100 touchdown passes, doing so in just 40 games.\nIn 2019, Reid's 12-4 Chiefs finished the regular season as AFC West Champs for a fourth-straight season and secured the No. 2 seed in the AFC. The club defeated Houston 51-31 in the Divisional Round and Tennessee 35-24 in the AFC Championship Game on it's way to returning to the Super Bowl for the third time in franchise history, marking the first Super Bowl appearance since the club won Super Bowl IV following the 1969 season. In Super Bowl LIV in Miami, Florida, Reid's Chiefs fell behind 20-10. Entering the fourth quarter, Mahomes rallied the offense, putting up 21-unanswered points to secure a 31-20 win over the San Francisco 49ers. Mahomes' performance earned him Super Bowl MVP honors.\nIn 2018, Reid's team notched a 12-4 record and third-straight AFC West title. Mahomes became the first player in Chiefs history to be named NFL MVP. The club earned a No. 1 seed in the playoffs and defeated the Indianapolis Colts 31-13 in the Divisional Round. The win marked Kansas City's first home playoff win since Jan. 8, 1994. The Chiefs hosted their first AFC Championship Game in franchise history, falling 37-31 in overtime to the eventual Super Bowl LIII Champion New England Patriots. Following the season, Reid was named Coach of the Year from the Maxwell Football Club for the fourth time in his career (2000, 2002, 2010, 2018). That season, following the club's Week 7 win over the Cincinnati Bengals, Reid became just the ninth head coach in NFL history to log 200 wins (regular and postseason).\nIn 2017, Reid led the Chiefs to a 10-6 record en route to the club's second-consecutive AFC West title, the first time in franchise history the club had won the division in back-to-back years.\nIn 2016, Reid led the Chiefs to a 12-4 record and an AFC West title for the first time since 2010. The team finished a perfect 6-0 against its division foes. It was the club's best record since going 13-3 in 2003. The Chiefs earned a first-round bye in the NFL playoffs and hosted a home AFC Divisional Game.\nIn 2015, Reid's Chiefs rattled off 10-consecutive regular season wins to finish 11-5 and earn a playoff berth. The Chiefs defeated the Houston Texans 30-0 in an AFC Wild Card Game in Houston, marking the team's first playoff win in 22 years. Reid and company advanced to the AFC Divisional Round. The club's 10-straight wins after starting just 1-5 marked the greatest turnaround in a single season in NFL history. Reid's efforts earned him AFC Coach of the Year honors.\nIn his first year with the club, Reid was named the 2013 AFC Coach of the Year by the 101 Committee after his squad recorded the greatest single-season turnaround in franchise history. Reid's team finished with an 11-5 record, a nine-game turnaround from the previous season and qualified for the postseason for the first time since 2010. Additionally, Reid mentored 10 players who earned Pro Bowl honors, more than any other team in the NFL that season.\nOne of the most successful coaches in professional sports, Reid utilizes a passionate, yet workmanlike approach as an NFL head coach. A former offensive lineman at BYU, Reid still lives and works with those humble principles he learned during his time in the trenches.\n\"Kansas City is just going to get better. This is just the start of it,\" the late Pro Football Hall of Fame Head Coach John Madden said upon Reid joining the Chiefs. \"He has a plan. And he's very thorough, very smart. He's a good coach, always has been.\"\nHis vision, his dedication and his organizational skills have been impeccable during his coaching career. Reid joined Philadelphia as head coach in 1999 and remained in that role through the 2012 season, becoming one of just 11 first-time NFL head coaches to lead 12-or-more seasons with the same club. Reid assumed the additional role of Executive Vice President of Football Operations in 2001.\nWhile compiling his 10-9 postseason record with Philadelphia, Reid led the Eagles franchise to one Super Bowl appearance, a game that saw Philadelphia fall by a mere field goal to the New England Patriots in Super Bowl XXXIX following the 2004 season. Reid guided Philadelphia to nine playoff appearances (2000, 2001, 2002, 2003, 2004, 2006, 2008, 2009, 2010) during his 14-year tenure in the City of Brotherly Love. During that time period, only Indianapolis (12) and New England (10) had more postseason appearances than the Eagles.\nThe Eagles captured their sixth NFC East division title under Reid in 2010. Along the way, Reid played a vital role in the rebirth of QB Michael Vick, who earned Comeback Player of the Year honors as well as a Pro Bowl berth. Reid, himself, earned Coach of the Year honors from the Maxwell Football Club.\nIn 2008, Reid became the 37th coach to reach the 100-win plateau and the 22nd to win 100 games with one franchise. He overcame a 5-5-1 start to reach the NFC Championship Game.\nIn 2006, the Eagles lost six of their first 11 games and two of their most explosive players in QB Donovan McNabb and DE Jevon Kearse, but Reid led a five-game win streak to close out the season, capturing the NFC East division title.\nThe 2004 Eagles clinched the NFC East title with five games remaining in the regular season and the No. 1 seed in the NFC playoffs. Along the way, Reid passed Greasy Neale for the most wins in franchise history as the Eagles earned their first trip to the Super Bowl since 1980.\nIn 2003, Philadelphia overcame an 0-2 start and a slew of injuries to post its second consecutive 12-win season. A year earlier, Reid was the overwhelming choice as the NFL's Coach of the Year as the Eagles thrived without the services of McNabb to still capture home-field advantage in the playoffs.\nAfter a 5-11 mark in his first season, Reid led the 2000 Eagles to the greatest turnaround in franchise history, finishing second in the NFC East at 11-5 and earning a trip to the NFC Divisional Playoffs. For his efforts, Reid was named the NFL's Coach of the Year by the Maxwell Football Club, The Sporting News, and Football Digest.\nThroughout his time in the NFL, Reid has continuously evaluated what is best for the game of football, serving on the NFL Competition Committee's Coaches Subcommittee. The subcommittee is instrumental in providing feedback to the NFL Competition Committee for potential rule changes and ways to improve the game.\n\"I am a huge fan of Coach Reid,\" NFL Commissioner Roger Goodell said. \"He is a person I have tremendous respect for as a coach and family man. Andy has been very helpful to me as Commissioner. He has tremendous insight into our game, and we are fortunate to have him in the NFL.\"\nReid was originally introduced as the head coach of the Philadelphia Eagles on Jan. 11, 1999, after spending seven seasons as an assistant coach with the Green Bay Packers under Head Coach Mike Holmgren. During his seven years with the Packers, Reid served as the tight ends coach and assistant offensive line coach (1992-96) and as quarterbacks coach (1997-98). In his span with the Packers, the team reached the playoffs six times and represented the NFC twice in back-to-back Super Bowls, defeating New England in Super Bowl XXXI and falling to Denver in Super Bowl XXXII.\nDuring his two-year stint as quarterbacks coach, Reid worked with Pro Football Hall of Fame QB Brett Favre. While tutoring Favre, Reid and the Packers won their second straight NFC title, and Favre garnered league MVP honors for the third-consecutive season.\nPrior to joining the NFL ranks, Reid's final collegiate stop was in Columbia, Missouri, as he coached the offensive line at the University of Missouri (1989-91). Prior to his stint with the Tigers, Reid spent two years working with the offensive line at the University of Texas – El Paso, and before that, he held the same position with Northern Arizona. Reid was hired as offensive line coach in 1983 and later promoted to offensive coordinator in 1984 at San Francisco State, helping the Gators lead the nation in passing and total offense for three consecutive years (1983-85).\nA tackle and guard at Brigham Young University from 1979-81, Reid entered the coaching ranks as a graduate assistant at BYU under Head Coach LaVell Edwards in 1982. It was in that time at BYU that Reid began his association with Holmgren, who served as the quarterbacks coach for the Cougars. While at BYU, Reid earned both a bachelor's degree in physical education and a master's degree in professional leadership in physical education and athletics. While playing for the Cougars, Reid was also a columnist for the Provo Daily Herald.\nA native of Los Angeles, Reid prepped at John Marshall High School in Los Angeles and went on to go to Glendale (Calif.) Junior College before attending BYU. Reid has been inducted into the Marshall High School Athletic Hall of Fame, as well as the Glendale Junior College Hall of Fame.\nEducation: Brigham Young University (B.A. 1981; M.A. 1983). Born: Los Angeles Family: Wife - Tammy; Children - Sons Spencer, Britt and the late Garrett, and daughters Drew Ann and Crosby. He has 13 grandchildren - Maverick, Somers, Saylor, Blake, Reid, Brigitte, Deacon, Canyon, Ryker, Rylen, Garrett, Ford and Levi."
    }
  ],
  "argos_summary": "A bullet fired at midnight on May 4, 2024, ricocheted through a window and lodged in a wall near Kansas City Chiefs coach Andy Reid’s office, missing him by about 15 feet and causing no injuries. The incident, which also struck a third‑floor office and an outdoor air conditioner, remains under investigation as an aggravated assault with no suspects identified. Following the event, Reid’s office was fitted with bulletproof glass, while the Chiefs’ coaching staff continued to lead the team to a Super Bowl championship just months earlier.",
  "argos_id": "78UP1UDL1"
}