{
  "url": "https://finance.yahoo.com/news/post-harvest-technologies-inc-launches-162400305.html",
  "authorsByline": "PR Newswire",
  "articleId": "a385eeeaa0e642e0b8ba41e27c22e1c6",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/prnewswire.com/2e766286f37268fe102b00a4e88a8823",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T16:24:00+00:00",
  "addDate": "2025-08-21T16:35:44.905402+00:00",
  "refreshDate": "2025-08-21T16:35:44.905404+00:00",
  "score": 1.0,
  "title": "Post Harvest Technologies, Inc. Launches King City Cooling, LLC to Strengthen Fresh Produce Infrastructure in California's Salad Bowl",
  "description": "Post Harvest Technologies, Inc., today announced the official launch of King City Cooling, LLC, a state-of-the-art cold storage and cross-dock facility designed to modernize and expand fresh produce infrastructure in California's Salinas Valley, also known as the \"Salad Bowl of the World.\"",
  "content": "KING CITY, Calif., Aug. 21, 2025 /PRNewswire/ -- Post Harvest Technologies, Inc., today announced the official launch of King City Cooling, LLC, a state-of-the-art cold storage and cross-dock facility designed to modernize and expand fresh produce infrastructure in California's Salinas Valley, also known as the \"Salad Bowl of the World.\"\n\nKing City Cooling, LLC was established to meet the increasing demand for modernized cold chain infrastructure that ensures efficiency, sustainability, and food safety from field to market. Strategically located in King City, the new company will serve growers, shippers, and retailers across the Salinas Valley by providing advanced pre-cooling, storage, and logistics solutions.\n\n\"King City Cooling represents the future of post-harvest infrastructure,\" said Jim White, PhD, Chairman, President & CEO of Post Harvest Technologies, Inc. \"As the fresh produce industry continues to expand, the need for efficient, scalable, and sustainable cold storage solutions has never been greater. This facility demonstrates our commitment to building resilient supply chains that minimize waste, increase throughput, and support the growers and shippers who supply America.\"\n• Sustainability & ESG Focus – Powered by on-site alternative energy microgrid, energy-efficient refrigeration systems, eco-friendly practices, and measures to reduce food waste at its core.\n• Scalability & Redundancy – Built to adapt with industry growth and seasonal demands, ensuring operational reliability and customer confidence.\n\nWith this launch, PHT continues its mission of transforming the U.S. fresh produce supply chain. King City Cooling joins PHT's expanding network of facilities to close the infrastructure gap in critical produce corridors.\n\nAbout Post Harvest Technologies, Inc.\n\nPost Harvest Technologies, Inc. is a leading developer, owner, and operator of mission-critical infrastructure for the U.S. fresh produce industry. Headquartered in California's Salinas Valley, the company provides advanced pre-cooling, cold storage, and logistics solutions that help reduce food waste, increase efficiency, and ensure food safety across the supply chain. By combining industry expertise, cutting-edge refrigeration and logistics systems, and a strong commitment to sustainability, Post Harvest Technologies is transforming how fresh produce moves from the field to the consumer – delivering greater resilience, profitability, and impact for growers, shippers, and retailers alike.",
  "medium": "Article",
  "links": [
    "https://mma.prnewswire.com/media/2755610/Post_Harvest_Technologies_Logo_Logo.html"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Fresh Produce Infrastructure",
      "weight": 0.10328921
    },
    {
      "name": "fresh produce infrastructure",
      "weight": 0.10328921
    },
    {
      "name": "King City Cooling",
      "weight": 0.095345445
    },
    {
      "name": "fresh produce",
      "weight": 0.09089755
    },
    {
      "name": "modernized cold chain infrastructure",
      "weight": 0.09012273
    },
    {
      "name": "King City",
      "weight": 0.08490365
    },
    {
      "name": "post-harvest infrastructure",
      "weight": 0.08437051
    },
    {
      "name": "critical produce corridors",
      "weight": 0.07413046
    },
    {
      "name": "food waste",
      "weight": 0.073149234
    },
    {
      "name": "Salinas Valley",
      "weight": 0.070719026
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Agriculture & Forestry/Other",
      "score": 0.9580078125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.9404296875
    }
  ],
  "sentiment": {
    "positive": 0.7953913,
    "negative": 0.021677941,
    "neutral": 0.18293074
  },
  "summary": "Post Harvest Technologies, Inc., has launched King City Cooling, LLC, a state-of-the-art cold storage and cross-dock facility in California's Salinas Valley, known as the \"Salad Bowl of the World,\" to meet the increasing demand for modernized cold chain infrastructure that ensures efficiency, sustainability, and food safety. The facility is designed to serve growers, shippers, and retailers across the Salinas valley. It is located in King City and is powered by on-site alternative energy microgrid, energy-efficient refrigeration systems, eco-friendly practices, and measures to reduce food waste. The launch of King City follows Post Harvest Technologies's mission to transform the U.S. fresh produce supply chain.",
  "shortSummary": "Post Harvest Technologies, Inc. launched King City Cooling, LLC to enhance fresh produce infrastructure in California's Salinas Valley by providing advanced pre-cooling, storage, and logistics.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "74467e17c633434e92cda44c4f0ef0d5",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Post Harvest Technologies, Inc. has launched King City Cooling, LLC, a new cold storage and cross‑dock facility in King City, California, aimed at modernizing the Salinas Valley’s fresh‑produce supply chain. The state‑of‑the‑art facility offers advanced pre‑cooling, storage, and logistics services powered by an on‑site alternative‑energy microgrid and energy‑efficient refrigeration to reduce waste and improve food safety. Designed for scalability and redundancy, it supports growers, shippers, and retailers with reliable, sustainable infrastructure as the industry expands. This launch expands PHT’s network of critical produce‑corridor facilities, reinforcing its mission to build resilient, efficient supply chains across the U.S.",
  "argos_id": "86N7REUCN"
}