{
  "url": "https://www.cnn.com/cnn-underscored/reviews/chamelo-smart-sunglasses-lineup",
  "authorsByline": "Enrique Perez",
  "articleId": "44db9a653c8b4c4f9f217c2fef633ad6",
  "source": {
    "domain": "cnn.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://media.cnn.com/api/v1/images/stellar/prod/lead-chamelo-sunglasses-cnnu-4.jpg?c=16x9&q=w_800,c_fill",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T16:06:42.113000+00:00",
  "addDate": "2025-08-21T16:18:16.947286+00:00",
  "refreshDate": "2025-08-21T16:18:16.947287+00:00",
  "score": 1.0,
  "title": "I cycled for 300 miles with Chamelo’s smart sunglasses on. Here’s what I think",
  "description": "Chamelo’s tint-changing smart sunglasses are as fun as they are practical, but these premium shades aren’t for everyone.",
  "content": "I first spotted Chamelo’s Shield sunglasses at CES 2025 in Las Vegas, and I was immediately intrigued. I’ve long dreamed of sunglasses that could adapt to changing light on the fly — something I wouldn’t have to constantly take off and on while cycling through shifting weather, sun and shade. The Chamelo Music Shields promised exactly that, with tunable tinting, a sleek and sporty design and built-in open-ear speakers.\n\nOn paper, and in the hands of brand ambassador and NBA All-Star Stephon Marbury, they felt like the future of smart glasses: sleek, stylish and surprisingly practical.\n\nAfter over three months of wearing three different models nearly every day — on commutes and rides; in rain, sun and supermarkets; and even at night weaving through city traffic — I came away with a mix of admiration and a few key frustrations. They’re ambitious, well-designed (if a little limited in style options) and genuinely fun to wear and show off. But they’re not without quirks. If you’re considering a pair of these unique wearables, here’s what stood out, what fell short and how they held up in the real world.\n\nWhat I liked about them\n\nI wore Chamelo’s Music Shields, Shields and Primes for over three months, logging more than 300 miles of cycling through New York City, New Orleans and San Francisco. I wore them on bright days, in the rain, on night rides, while running errands and during the Five Boro Bike Tour (a 40-mile ride across NYC). These weren’t just reviewed; they became part of my daily routine (and still are).\n\nRight out of the box, the fit and weight impressed me. The Primes were the lightest at 1.1 oz, followed by the Shields at 1.3 oz, and the Music Shields at 1.7 oz (unsurprising given the speakers and battery). The Music Shields were especially comfortable, with no slipping, pinching or pressure. And when you’re flying down a city street dodging traffic, the last thing you want is to fidget with your glasses. Manhattan motorists already seem to be trying to run you over for sport — this is one way to ensure they don’t succeed.\n\nSurprisingly rich sound and even better battery life.\n\nThe built-in open-ear audio quality was another win. I didn’t expect much, but the volume and clarity surprised me. They get loud — louder than Meta’s Ray-Bans — and stay clear, even in noisy environments. Taking calls hands-free was seamless; everyone I spoke with could hear me perfectly, and I never had trouble hearing them.\n\nI streamed podcasts through Midtown traffic, took calls while pedaling across bridges and listened to music on subway platforms, all while staying aware of my surroundings and without annoying the people nearby. (There’s a special place for people who blast music on speakers in public. Don’t be that person.)\n\nThe Music Shields’ function button powers them on, pairs them via Bluetooth and controls playback as well as your phone’s assistant. I had full conversations with people while secretly listening to The Clash, Miles Davis, The Meters or a podcast. When I finally told them — and demoed the glasses — the most common response was, “Holy sh*t I had no idea, I didn’t hear a thing!”\n\nChamelo’s lenses use liquid crystal film to adjust tint, either manually or automatically, depending on the model. The transition is quick and smooth. I loved this most on the Primes and Shields, which feature AutoPilot, an ambient light sensor that adjusts tint automatically.\n\nWhether I was riding through tree-covered paths or walking into dim cafés, the glasses just adapted. No swiping. No thought. They take a second or two to adjust, which is actually a plus — you don’t want them flickering as you ride through alternating light and shade. Every model I tested features 100% UV protection at every tint level, so you won’t have to worry about keeping your eyes safe from the sun.\n\nWith daily use, I charged the Music Shields every two days. Chamelo claims about 6.5 hours of continuous audio and up to 100 hours of tint adjustment on the Music Shields, and that was mostly accurate in my testing. At full (borderline uncomfortably loud) volume, the battery dropped to about 4 hours of continuous use, but their claim on just tint adjustment levels was spot-on.\n\nQuick charging was another bonus. Thirty minutes gave me enough power to last the whole day, especially on the Shields and Primes, which don’t have built-in audio and can last a whopping 70 hours of tint adjustment on the Primes (true to Chamelo’s claims) and 52 hours on the Shields.\n\nAnd for what it’s worth, these don’t scream, “I’m wearing smart glasses.” The Primes have a classic Wayfarer-esque look, more Ray-Ban than RoboCop. The Shields and Music Shields lean sportier, but not over the top.\n\nWhat I didn’t like about them\n\nWhile I’ve come to use Chamelo’s lineup daily — mainly the Music Shields because I can’t give up built-in audio on rides — they’re not perfect.\n\nMy biggest gripe is the limited tint range, which varies on each model (the Music Shields are 63–17%, Shields are 54–17%, and Primes are 45–9% visual light transmittance). It’s decent but could be better — none go fully clear or super dark, which makes nighttime use less than ideal and can still leave you squinting in bright sun.\n\nAnother gripe is that the Music Shields lack AutoPilot. Instead, you just get a manual touch slider for tint, which can be inconsistent, especially if your fingers are sweaty, it’s raining or you’re in motion. There’s no feedback (haptic, audio or visual), so you can’t tell if your adjustment registered. Often, I’d swipe thinking I had more range, only to realize I was already at max or minimum. In my testing, about three out of 10 swipes didn’t register. The Shields and Primes, on the other hand, had perfect responsiveness with 10 out of 10 swipes registered.\n\nStyle options are also limited. The frames worked for me, but Chamelo’s small lineup may not fit all head sizes or style preferences. To their credit, they’ve been adding more, including the new Prismatic series with color-changing tint (which I haven’t tried).\n\nLastly, the charging cables. While the magnetic USB-A to Pogo Pin charging cable is great, each model requires its own unique cable. Juggling three pairs meant juggling three different chargers that look very similar but are incompatible.\n\nIf you only own one pair, no problem. But if you collect sunglasses like I do (20 pairs in active rotation and counting), fumbling around trying to find the right cable for a particular pair is annoying, to say the least.\n\nAfter three months and 300 miles, it’s clear Chamelo is onto something. These aren’t perfect smart, variable-tint glasses, but they do fill a real need in a stylish, functional way.\n\nThe Music Shields are ideal for cyclists and commuters who want music, voice assistant access and variable lenses, though the lack of AutoPilot and limited tint range are misses. The Primes were my favorite for daily wear, with lightweight, stylish and smooth AutoPilot transitions, but no speakers. The Shields are a great outdoor exercise option with AutoPilot for those who don’t need audio.\n\nFor runners, cyclists, commuters or just fans of smart sunglasses, Chamelo’s lineup is worth the money. They’re priced slightly on the premium side, but not outrageously so.\n\nThey’re not perfect, but the fact that the Music Shields have become my default riding glasses even after testing ended says a lot. More importantly, they’ve made my rides safer, smoother and a hell of a lot more fun.\n\nCNN Underscored editors thoroughly test all the products we cover, and we take smart sunglasses just as seriously as we do laptops and all other tech. We’re made up of an experienced team of editors and writers who provide full transparency about our testing methodology. In addition to his 15-plus years of experience producing content all over the globe (including no shortage of trips spent trying out tech gadgets), senior video producer Enrique Perez is an avid lifelong cyclist who truly put these sunglasses through their paces over several months.",
  "medium": "Article",
  "links": [
    "https://www.cnn.com/cnn-underscored/health-fitness/best-blue-light-glasses",
    "https://www.avantlink.com/click.php?tt=cl&mi=27393&pw=290805&ctc=0821chamelo&url=https%3A%2F%2Fwww.scheels.com%2Fp%2F85006468215",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=2652&murl=https%3A%2F%2Fwww.buckle.com%2Fchamelo-prime-polarized-sunglasses%2Fprd-20492SPPRSHSMB%2Fsku-9771290000&u1=0821chamelo",
    "https://www.cnn.com/2025/06/14/tech/google-meta-snap-smart-glasses-ai",
    "https://go.skimresources.com/?id=87732X1565017&url=https%3A%2F%2Fwww.chamelo.com%2Fproducts%2Fshield-fire-lenses-sports-smart-glasses-electrochromic-tint-adjustable-changing-sunglasses&xcust=0821chamelo",
    "https://www.cnn.com/cnn-underscored/outdoors/best-sports-sunglasses",
    "https://www.cnn.com/cnn-underscored/reviews",
    "https://www.cnn.com/cnn-underscored/fashion/editors-stylists-favorite-sunglasses-under-150",
    "https://www.cnn.com/cnn-underscored/about/enrique-perez",
    "https://go.skimresources.com/?id=87732X1565017&url=https%3A%2F%2Fchamelo.com%2Fproducts%2Fprime-smoke-lenses-sports-smart-glasses-electrochromic-tint-adjustable-changing-sunglasses&xcust=0821chamelo",
    "https://www.cnn.com/cnn-underscored/electronics/chamelo-prime-shield-sunglasses-ces-2025",
    "https://go.skimresources.com/?id=87732X1565017&url=https%3A%2F%2Fchamelo.com%2Fproducts%2Fmusic-shield-white-frame-fire-lenses-sports-smart-glasses-electrochromic-tint-adjustable-changing-audio-sunglasses&xcust=0821chamelo"
  ],
  "labels": [
    {
      "name": "Paid News"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Music Shields",
      "weight": 0.07994001
    },
    {
      "name": "Shields",
      "weight": 0.06689041
    },
    {
      "name": "limited tint range",
      "weight": 0.065718934
    },
    {
      "name": "tint adjustment",
      "weight": 0.064788975
    },
    {
      "name": "smart sunglasses",
      "weight": 0.060165532
    },
    {
      "name": "smart glasses",
      "weight": 0.059763383
    },
    {
      "name": "tint",
      "weight": 0.059404675
    },
    {
      "name": "more range",
      "weight": 0.051958647
    },
    {
      "name": "Chamelo",
      "weight": 0.0516508
    },
    {
      "name": "Chamelo’s Music Shields",
      "weight": 0.0507434
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Lifestyle"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.52099609375
    },
    {
      "name": "/Beauty & Fitness/Fashion & Style/Other",
      "score": 0.397705078125
    }
  ],
  "sentiment": {
    "positive": 0.33025578,
    "negative": 0.23940365,
    "neutral": 0.43034056
  },
  "summary": "Chamelo’s smart sunglasses, the Music Shields, were introduced at CES 2025 and have been described as the future of smart glasses. The glasses, which can adjust to changing light on the fly, offer tunable tinting, a sleek design and built-in open-ear speakers. The reviewer tested three different models for over three months, logging over 300 miles of cycling through New York City, New Orleans and San Francisco. However, he noted some minor issues with the glasses, including a lack of swiping or pressure. The fit and weight were particularly well-received, with no slipping, pinching or pressure, and the speaker quality was another win. The lenses use liquid crystal film to adjust tint, either manually or automatically, depending on the model. The battery life on the Primes and Shields was also praised.",
  "shortSummary": "Chamelo’s Music Shields, featuring innovative design and adjustable light settings, perform well in urban environments but come with limitations in battery life and sound.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "08bc7a05a0184e67a7fa579d80f2c2cd",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnn.com/2025/06/14/tech/google-meta-snap-smart-glasses-ai",
      "text": "Silicon Valley thinks it’s finally found the next big thing in tech: smart glasses – the same thing Google tried (and failed at) more than a decade ago.\nBut Google Glass may simply have been ahead of its time. Now tech companies believe technology has finally caught up, thanks in part to artificial intelligence—and they’re going all-in on truly “smart” glasses that can see and answer questions about the world around you.\nThe latest example: Snap announced this past week it’s building AI-equipped eyewear to be released in 2026.\nThe renewed buzz around smart glasses is likely the combination of two trends: a realization that smartphones are no longer exciting enough to entice users to upgrade often and a desire to capitalize on AI by building new hardware around it.\nThat’s why, although smart glasses aren’t entirely new, advancements in AI could make them far more useful than the first time around. Emerging AI models can process images, video and speech simultaneously, answer complicated requests and respond conversationally.\nAnd that could make smart glasses finally worth wearing.\n“AI is making these devices a lot easier to use, and it’s also introducing new ways people can use them,” said Jitesh Ubrani, a research manager covering wearable devices for market research firm The International Data Corporation.\nMeet the new class of smart glasses\nGoogle, Snap, Meta and Amazon have previously released glasses with cameras, speakers and voice assistants.\nBut the Google Glass of a decade ago never caught on. The screen was tiny, the battery life was short and the “glasses” themselves were expensive and unfashionable. More modern glasses like Amazon’s Echo Frames, Meta’s original Ray-Ban Stories and early versions of Snap’s Spectacles made it easier to listen to music or take photos hands-free. Yet these still didn’t do anything you couldn’t already do with a smartphone.\nThis newer crop of smart glasses is far more sophisticated.\nFor example, when I tried prototype glasses based on Google’s software last year, I asked Google’s Gemini assistant to provide cocktail ideas based on liquor bottles I had been looking at on a shelf. The glasses will also remember what you’ve seen and answer questions based on that: During its I/O developers conference in May, a Google employee asked Gemini for the name of a coffee shop printed on a cup she has looked at earlier.\nWith the Ray-Ban Meta AI glasses, users can perform tasks like asking whether a pepper they’re looking at in a grocery store is spicy or translate conversations between languages in real time. Two million pairs have been sold since their 2023 debut, Ray-Ban parent company EssilorLuxottica said in February.\n“There’s been several years of various failed attempts,” said Andrew Zignani, senior research director of ABI Research’s Strategic Technologies team. “But there’s finally now some good concepts of what’s working.”\nAnd market research indicates the interest will be there this time. The smart glasses market is estimated to grow from 3.3 million units shipped in 2024 to nearly 13 million by 2026, according to ABI Research. The International Data Corporation projects the market for smart glasses like those made by Meta will grow from 8.8 in 2025 to nearly 14 million in 2026.\nWhat’s coming next\nSnap didn’t reveal many details about its forthcoming “Specs” glasses but did say they will “understand the world around you.\n“The tiny smartphone limited our imagination,” Snap wrote in a blog post announcing the glasses. “It forced us to look down at a screen, instead of up at the world.”\nApple is also said to be working on smart glasses to be released next year that would compete directly with Meta’s, according to Bloomberg. Amazon’s head of devices and services Panos Panay also didn’t rule out the possibility of camera-equipped Alexa glasses similar to those offered by Meta in a February CNN interview.\n“But I think you can imagine, there’s going to be a whole slew of AI devices that are coming,” he said in February.\nAI assistant apps, like OpenAI’s ChatGPT and Google’s Search and Gemini apps, are already laying the foundation for smart glasses by using your phone’s camera to answer questions about your surroundings. OpenAI is putting its tech in everything from a mysterious new gadget co-designed by Apple veteran Jony Ive to future Mattel toys.\nGoogle said last month that it would bring more camera use to its search app, a sign that it sees this technology as being key to the way people find information in the future. Apple this past week announced updates to its Visual Intelligence tool that let users ask questions about content on their iPhone’s screen, in addition to their surroundings, by using its camera.\nMeta CEO Mark Zuckerberg recently reiterated his belief that smart glasses could become critical to how people use technology during testimony in a federal antitrust case.\n“A big bet that we have at the company is that a lot of the way that people interact with content in the future is going to be increasingly through different AI mediums, and eventually through smart glasses and holograms,” he said in April.\nDo people actually want smart glasses?\nStill, tech giants need to get regular people to buy in. This includes potential privacy concerns, which played a big role in Google Glass’ demise. Recording video with camera-equipped glasses is more subtle than holding up your phone, although Meta and Google’s glasses have a light on the front to let other people know when a wearer is capturing content.\nPerhaps the biggest challenge will be convincing consumers that they need yet another tech device in their life, particularly those who don’t need prescription glasses. The products need to be worth wearing on people’s faces all day.\nAnd these devices likely won’t come cheap. Meta’s Ray-Bans usually cost around $300, roughly the price of a smartwatch. While that’s not nearly as expensive as the $3,500 Apple Vision Pro headset, it still may be a tough sell as people spend less on ancillary tech products. Global smartwatch shipments fell for the first time in March, according to Counterpoint Research, perhaps a sign that customers aren’t spending as much on devices they may not view as essential.\nYet tech firms are willing to make that bet to avoid missing out on what could be the next blockbuster tech product.\n“Many in the industry believe that the smartphone will eventually be replaced by glasses or something similar to it,” said Ubrani the IDC analyst. “It’s not going to happen today. It’s going to happen many years from now, and all these companies want to make sure that they’re not going to miss out on that change.”"
    },
    {
      "url": "https://go.skimresources.com/?id=87732X1565017&url=https%3A%2F%2Fchamelo.com%2Fproducts%2Fmusic-shield-white-frame-fire-lenses-sports-smart-glasses-electrochromic-tint-adjustable-changing-audio-sunglasses&xcust=0821chamelo",
      "text": "Size & Fit\nMeasurements\nFast & Free\nShipping\nWe offer Free US and international shipping on orders over $69. Packages shipping to the continental United States typically arrive within 4-7 business days and are sent out from our warehouse in Tennessee. Learn more\n30-Day Money\nBack guarantee\nIf you’re not completely satisfied with your Chamelo product, you can return it within 30 days for a full refund or exchange. Learn more\n1-Year\nWarranty\nWe stand behind the quality of our products, that’s why offer a 1-year warranty that covers any manufacturing defects. Learn more\n4 reasons why people\nlove Music Shield\nThe Features\nA game-changer\nfor fitness enthusiasts\nMusic Shield Specs\nbattery life\ntransmittance\nbattery life\nbattery\nlens tint\nFAQs\nHow does Music Shield work?\nWhat can Music Shield be used for?\nIs Music Shield waterproof?\nIs Music Shield polarized?\nHow fast is shipping?\nDo you offer a guarantee?\nCurious how our sunglasses work or anything else? We’d love to hear from you. Email us at hello@chamelo.com or call us at. (646)-413-7538.\nReviews\nHear from our\nhappy customers\nUpgrade your shades with confidence\nIf you’re not completely satisfied, return within 30 days for a full refund or exchange\nEnjoy free shipping on all orders of $69 or more (US & International). Orders usually arrive within 4-7 business days.\nIncluded with all glasses, covering any manufacturing defects\nCurious how our sunglasses work or anything else? Just email us at hello@chamelo.com\nGot a question about our glasses? Just email us at hello@chamelo.com"
    },
    {
      "url": "https://go.skimresources.com/?id=87732X1565017&url=https%3A%2F%2Fchamelo.com%2Fproducts%2Fprime-smoke-lenses-sports-smart-glasses-electrochromic-tint-adjustable-changing-sunglasses&xcust=0821chamelo",
      "text": "Size & Fit\nMeasurements\nFast & Free\nShipping\nWe offer Free US and international shipping on orders over $69. Packages shipping to the continental United States typically arrive within 4-7 business days and are sent out from our warehouse in Tennessee. Learn more\n30-Day Money\nBack guarantee\nIf you’re not completely satisfied with your Chamelo product, you can return it within 30 days for a full refund or exchange. Learn more\n1-Year\nWarranty\nWe stand behind the quality of our products, that’s why offer a 1-year warranty that covers any manufacturing defects. Learn more\n5 reasons why people\nlove Prime\nThe Features\nClassic shades\nfor on and off the field\nPrime Specs\nbattery life\ntransmittance\nbattery\nlens tint\nFAQs\nHow do the Prime sunglasses work?\nWhat are Prime suited for?\nAre Prime sunglasses waterproof?\nAre Prime sunglasses polarized?\nHow do I activate the Autopilot feature?\nHow long does the battery last for Autopilot and manual tint features?\nWhen is Prime shipping?\nDo you offer a guarantee?\nCurious how our sunglasses work or anything else? We’d love to hear from you. Email us at hello@chamelo.com or call us at. (646)-413-7538.\nReviews\nHear from our\nhappy customers\nUpgrade your shades with confidence\nIf you’re not completely satisfied, return within 30 days for a full refund or exchange\nEnjoy free shipping on all orders of $69 or more (US & International). Orders usually arrive within 4-7 business days.\nIncluded with all glasses, covering any manufacturing defects\nCurious how our sunglasses work or anything else? Just email us at hello@chamelo.com\nGot a question about our glasses? Just email us at hello@chamelo.com"
    },
    {
      "url": "https://go.skimresources.com/?id=87732X1565017&url=https%3A%2F%2Fwww.chamelo.com%2Fproducts%2Fshield-fire-lenses-sports-smart-glasses-electrochromic-tint-adjustable-changing-sunglasses&xcust=0821chamelo",
      "text": "Size & Fit\nMeasurements\nFast & Free\nShipping\nWe offer Free US and international shipping on orders over $69. Packages shipping to the continental United States typically arrive within 4-7 business days and are sent out from our warehouse in Tennessee. Learn more\n30-Day Money\nBack guarantee\nIf you’re not completely satisfied with your Chamelo product, you can return it within 30 days for a full refund or exchange. Learn more\n1-Year\nWarranty\nWe stand behind the quality of our products, that’s why offer a 1-year warranty that covers any manufacturing defects. Learn more\n5 reasons why people love Shield\nThe Features\nA game-changer\nfor fitness enthusiasts\nShield Specs\nbattery life\ntransmittance\nbattery\nlens tint\nFAQs\nHow do the Shield sunglasses work?\nWhat are Shield suited for?\nAre Shield sunglasses waterproof?\nAre Shield sunglasses polarized?\nHow do I activate the Autopilot feature?\nHow long does the battery last for Autopilot and manual tint features?\nDo you offer a guarantee?\nCurious how our sunglasses work or anything else? We’d love to hear from you. Email us at hello@chamelo.com or call us at. (646)-413-7538.\nReviews\nHear from our\nhappy customers\nUpgrade your shades with confidence\nIf you’re not completely satisfied, return within 30 days for a full refund or exchange\nEnjoy free shipping on all orders of $69 or more (US & International). Orders usually arrive within 4-7 business days.\nIncluded with all glasses, covering any manufacturing defects\nCurious how our sunglasses work or anything else? Just email us at hello@chamelo.com\nGot a question about our glasses? Just email us at hello@chamelo.com"
    }
  ],
  "argos_summary": "Chamelo’s Music Shields, Primes, and Shields combine variable‑tint lenses, lightweight design, and in‑built audio to create a practical, stylish option for cyclists, commuters, and outdoor enthusiasts. Over three months and 300 miles of real‑world use, the glasses impressed with smooth AutoPilot tint transitions, 100 % UV protection, and surprisingly clear open‑ear sound, though the Music Shields lack AutoPilot and offer a limited tint range that can leave users squinting in bright or dark conditions. Practical drawbacks include inconsistent manual tint control on the Music Shields, a small style lineup, and the need for separate charging cables for each model. Despite these quirks, the reviewer finds the Music Shields the go‑to pair for rides and recommends the Primes for everyday wear, while noting the broader smart‑glasses market is poised for growth as AI and camera‑enabled devices from Google, Meta, Snap, Apple and Amazon enter the fray.",
  "argos_id": "8EYI7B4S8"
}