{
  "url": "https://www.nytimes.com/athletic/6567282/2025/08/21/arsenal-women-chloe-kelly-olivia-smith/",
  "authorsByline": "Art de Roché",
  "articleId": "991612b44ddb46a89c0ef7c0551699d7",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/21132803/AB9_4306_qwVQUjb4-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T18:00:16+00:00",
  "addDate": "2025-08-21T18:22:03.988680+00:00",
  "refreshDate": "2025-08-21T18:22:03.988683+00:00",
  "score": 1.0,
  "title": "Arsenal Women’s Kelly, Hinds and Smith on homecomings, record fees and mindset",
  "description": "Three new signings discuss taking the Champions League winners to another level",
  "content": "Homecomings have been a theme of Arsenal’s summer transfer window. Their men’s team are on the verge of completing the return of a former Hale End attendee in Crystal Palace’s Eberechi Eze, but their women’s team got the memo at the start of the summer.\n\nBy July 7, Chloe Kelly and Taylor Hinds had been confirmed as their first two signings of the window. Both had spent time in the club’s academy setup. Both had left the club to join Everton in January 2018. And, seven and a half years later, both returned to north London with the aim of taking Arsenal to another level.\n\n“It’s always nice to come back to the club you grew up playing in the academy and experiencing first-team football with,” Kelly, who initially re-signed for Arsenal on loan from Manchester City in January before joining permanently upon the expiration of her City contract, told reporters at Arsenal’s training ground.\n\n“Your journey goes different ways but it always comes back home. The journey’s been a little bit crazy. Especially last season in the Champions League. In January, not thinking I’ll even go to the Euros and to win it with an amazing team was so special. But I’m a big believer that everything happens for a reason.”\n\nKelly and Hinds’ journeys have almost run parallel. They signed on the same day in January 2018 and both departed for clubs in England’s north-west in July 2020. Kelly landed at Manchester City, while Hinds made the move to Liverpool. It took five years for the pair to return, but neither would have it another way.\n\nKelly scored the winning goal of her first European Championship final win for England when she was a Manchester City player in 2022. That same year, Hinds had been part of the Liverpool side who earned promotion to the Women’s Super League after winning the Championship.\n\n“We had to take our journey away from here which is absolutely fine,” Hinds adds. “I’ve enjoyed the journey that I’ve been on and I’m proud of it. When you first start having the conversations it’s like, ‘Wow, I could be back where it all started’. It was an unbelievable feeling for me and I’m so proud to be here. The hard work doesn’t stop here, it still continues.”\n\nKelly and Hinds played alongside first-team players Leah Williamson and Lotte Wubben-Moy when coming through the ranks. With England’s two-time European champions given extra time off before reporting back for pre-season, Hinds had to wait to be truly reunited with her old team-mates, but that didn’t stop memories from flooding back.\n\nBefore she was able to drive, it was Williamson who would pick her up from the train station and take her to training.\n\nThinking back to those moments, she quips: “Now all the girls I used to play with are back, it’s a weird feeling. I was so young but now I’ve grown up and I’d like to say I’m more mature.”\n\nWhile maturity can be a result of age, one player who that does not seem to matter for is Olivia Smith. The 21-year-old made history when she joined Arsenal from Liverpool last month, becoming the first women’s footballer to command a fee of £1million.\n\nThe young forward has proven for years that she is not overawed by much. She has moved clubs in three consecutive summers and excelled each time. After scoring 18 goals in 11 games for North Toronto Nitros in 2022, she got 13 and assisted nine in 18 league games for Sporting CP in 2023-24 before having a PFA Young Player of the Year-worthy campaign with Liverpool last year.\n\nArsenal got first-hand experience of how hard it can be to contain her talent late on last season. She laughs not only when Arsenal planning specifically to stop her in their second game in a matter of weeks is brought up, but when the name Trevor Francis (the first £1m male player) is mentioned.\n\n“It’s definitely an honour,” Smith says. “To come with such a hefty price tag for such a young player, they (Arsenal) see the potential that I have, and my mindset. I’m hungry, I’m driven, I want to learn, I want to grow, and ultimately I want to win things.”\n\nThat willingness to learn and grow was a key part of Arsenal being Smith’s destination after Liverpool. Rather than just telling the forward how good she is, part of Arsenal’s pitch to her was around how they could make her better.\n\nOn how that has happened at her previous clubs, she adds: “I went to Portugal to try and build my IQ and technical skill. Then I came here (England) to improve my physicality and strength.”\n\nPart of Smith’s growth will be acclimatising to Arsenal’s collective efforts to follow up their Champions League triumph with a Women’s Super League title this season.\n\nKey to Arsenal’s business this summer has been lifting the quality of the squad, which means competition for places in multiple positions. With the additions of Smith and Kelly, Arsenal now have at least two quality options on both wings with Caitlin Foord and Beth Mead still in the mix. Hinds’ return also sees her join a full-back department that includes three internationals in Katie McCabe, Emily Fox and Steph Catley.\n\nIf Arsenal are to make real strides in their domestic quest against Chelsea, these are the steps they need to make, and the players coming in know that.\n\n“Challenges (are) you might not play but you’ve got to put yourself out there and put yourself in a position where you want to compete and are a team which is the best team in the world right now,” Hinds says.\n\n“It was the perfect time for me. Through my years at Liverpool, I built myself up, worked really hard and then I got to the point where I want to be winning trophies and I want to be competing at the highest level.\n\n“This is exactly where I want to be. I was here a few years ago growing up. It’s also so special to me, this club, and it feels like home already.”",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6510073/2025/07/23/chloe-kelly-england-italy-euro-2025/",
    "https://www.nytimes.com/athletic/6565048/2025/08/20/eberechi-eze-arsenal-transfer-agreement/",
    "https://www.nytimes.com/athletic/6499383/2025/07/17/olivia-smith-behind-the-deal-record-liverpool-arsenal/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Arsenal",
      "weight": 0.0796309
    },
    {
      "name": "Taylor Hinds",
      "weight": 0.06534043
    },
    {
      "name": "Hinds",
      "weight": 0.064470366
    },
    {
      "name": "last year",
      "weight": 0.060305025
    },
    {
      "name": "first",
      "weight": 0.05986962
    },
    {
      "name": "clubs",
      "weight": 0.056284864
    },
    {
      "name": "Manchester City",
      "weight": 0.053097785
    },
    {
      "name": "Chloe Kelly",
      "weight": 0.052977003
    },
    {
      "name": "first-team players",
      "weight": 0.052056264
    },
    {
      "name": "Arsenal Women’s Kelly",
      "weight": 0.051942192
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98388671875
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.97705078125
    }
  ],
  "sentiment": {
    "positive": 0.4623227,
    "negative": 0.15186347,
    "neutral": 0.38581383
  },
  "summary": "Arsenal's women's team has seen several homecomings, with Chloe Kelly and Taylor Hinds being confirmed as their first two signings of the summer transfer window. Both had previously played in the club's academy before returning to north London seven and a half years later. Kelly and Hinds, who both played for Manchester City and Liverpool respectively, signed on the same day in January 2018 and both departed for clubs in England's north-west in July 2020. Olivia Smith, who joined Arsenal from Liverpool for £1million, also reflected on her personal growth and dedication to the game.",
  "shortSummary": "Arsenal's summer transfer window featured notable returns, with notable ones like Chloe Kelly and Taylor Hinds, while Olivia Smith made history for her £1m purchase.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "10c0803f4f0843bfb00a6e689d96c614",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6565048/2025/08/20/eberechi-eze-arsenal-transfer-agreement/",
      "text": "The Athletic has live coverage of the 2025 summer transfer window.\nArsenal have an agreement in principle with Crystal Palace to sign Eberechi Eze.\nThe deal is worth in the region of the expired £68million (€78m, $91m) release clause, matching the level of fee Tottenham Hotspur were prepared to pay, and personal terms have been agreed.\nAdvertisement\nThe 27-year-old is expected to play for Palace against Fredrikstad in the Conference League play-off on Thursday before undergoing a medical with the north London club.\nThe operation was executed by Arsenal sporting director Andrea Berta and vice-chairman Tim Lewis.\nEze is set to become Arsenal’s seventh signing of what has been a busy first summer under Berta since his arrival from Atletico Madrid.\nGoalkeeper Kepa Arrizabalaga, defender Cristhian Mosquera, midfielders Martin Zubimendi and Christian Norgaard, winger Noni Madueke and striker Viktor Gyokeres have all moved to the Emirates Stadium.\nThe move for Eze, who was a boyhood Arsenal fan and played for the club’s academy, follows the injury for Kai Havertz, who is being assessed and could be set for a spell on the sidelines.\nEze joined Palace from QPR in the summer of 2020 in a deal worth around £17m and has made 169 appearances for the south London club, scoring 40 times. He has been capped 12 times by England, scoring once.\nWhy Arsenal want Eze\nAnalysis from Arsenal correspondent James McNicholas\nArsenal are huge admirers of Eberechi Eze’s talent.\nThe club initially explored a move for Eze when contact negotiations with Ethan Nwaneri were at a delicate stage. Once Nwaneri agreed a new deal, Arsenal’s interest waned, and they focused on other areas of the squad.\nThroughout, Arsenal have held concerns over price: they have been loath to meet a Palace valuation in the region of £60million.\nTheir pressing need for attacking reinforcements, particularly in the light of Kai Havertz’s injury, may change things. Arsenal are still awaiting the full prognosis for Havertz, but if he is to be absent for a considerable period, it will weaken their attack.\nEze is not a direct replacement for Havertz, but his signing would potentially free up the likes of Mikel Merino and Leandro Trossard to fill in at centre-forward until the Germany international returns.\nAdvertisement\nAside from Eze’s obvious quality, there’s an emotional component for Arsenal fans: Eze is a boyhood Arsenal fan who was part of the club’s academy. Throw in the prospect of beating Spurs to his signing, and there’s plenty for Arsenal supporters to be invested in…\nWhat he would bring to Arsenal\nAnalysis by senior data writer Mark Carey\nMikel Arteta has needed to strengthen the left side of his attack this summer.\nLeandro Trossard and Gabriel Martinelli’s output was in the good-not-great bucket last season, and it is clear that Arsenal needed players with the same attacking ferocity that comes from their right flank with Bukayo Saka and Martin Odegaard.\nAlong with Noni Madueke, Eze’s arrival provides that added strength from the left side of the pitch with a truly versatile profile — operating best as a No 10 but able to play on the left side of his team’s attack or drop into a left-sided midfield position if required. Whatever his role, he will look to find the space to impose maximum damage to the opposition with the sharpest efficiency.\nIn the modern game, those who can break a player-for-player press with a drop of the shoulder or a driving run forward have never been so valuable — opening up the opposition structure with a moment of individual quality as the dominoes begin to fall. Eze also has the ability to thread a pass forward when spaces open up in front of him, making him a double threat in the attacking third.\nAcquiring an attacking midfielder of the 27-year-old’s creative profile will be a crucial addition in Arsenal’s attack, and could well be the difference between a good season and a title-winning one.\n(Charlotte Wilson/Offside/Offside via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6510073/2025/07/23/chloe-kelly-england-italy-euro-2025/",
      "text": "All of England’s usual penalty-takers were off the pitch. So when they were awarded a penalty in the 119th minute of their Euro 2025 semi-final against Italy, Alex Greenwood went over to Sarina Wiegman and her assistant Arjan Veurink to ask who should take it.\n“It’s up to you: you or Chloe (Kelly),” said the coaches. Greenwood looked her team-mate in the eye and said, “What do you think?”\nAdvertisement\nKelly replied, “I’m confident”. Greenwood, who missed her penalty against Sweden in the shootout, did not need to ask again.\nKelly took her usual hop, skip and kick run up, but the height was comfortable for Laura Giuliani, who made a brilliant save. Kelly, however, was quickest to react on the follow-up, toe-poking the ball home and sealing England’s spot in the European Championship final via a 2-1 win after extra time. Amid the chaotic mess England had created for themselves, Kelly brought a moment of calm.\n“She thrives in these moments,” said Wiegman. “She loves them, you can tell.”\nThe player who scored the Euro 2022 winning goal had just sent England through to their third consecutive major tournament final. Neither Kelly’s saved penalty nor England’s performance was pretty, but somehow they got the job done.\nKelly’s goal celebrations sum her up. One was “chill out… I was going to score”, and the other, posing with one hand on the corner flag, was inspired by Thierry Henry. She is cold as ice and plays with swagger.\nWhen asked who has made Kelly the person she is today, her first answer was: “Myself”.\n“Chloe is just attitude, sass, confidence,” said her former Manchester City team-mate Lucy Bronze. “When she’s on the pitch, no matter the moment, how she’s feeling, the crowd, she’s going to push her shoulders back, big up her chest and go for it. She’s just got this attitude and confidence, you can’t buy it.”\nThe youngest of seven siblings, Kelly learned to be resilient from an early age. Her five brothers — Daniel, the oldest, then Jack, followed by triplets Ryan, Jamie and Martin — embody honest hard work while her mum is as “tough as nails”.\nKelly began at her childhood club Queens Park Rangers before moving to Arsenal’s centre of excellence, where she signed her first contract. But she was loaned twice to Everton and took the rejection as motivation to prove herself.\nAdvertisement\nHer story is one of grafting, patience and comebacks. You can call it confidence, sass or swagger, but Kelly knows her worth, and her past experiences have shaped her today.\nThe 27-year-old winger was frozen out of the City squad last season after losing her starting place following a breakdown in her relationship with manager Gareth Taylor. She desperately needed game time to secure a place in the England squad and eventually got it after securing a six-month loan move to Arsenal, with whom she won the Champions League last season. She has since joined the north London club on a three-year deal.\n“The moments in January when I felt like giving up football make you so grateful for these moments here today,” said Kelly after the game. “It makes you enjoy every minute of that.”\n“She just doesn’t really care what people think,” said defender Esme Morgan, who spent four years with Kelly at City. “She is just her own person and works hard.”\nKelly rose from the dark days just before Euro 2022. The year prior, she ruptured her right anterior cruciate ligament and worked tirelessly to be fit enough in time for selection.\nBronze, who shared the City gym with Kelly as she recovered from her knee injury for the first half of the 2021-2022 season, recalls the “blood, sweat and tears” during those sessions.\n“You probably wouldn’t expect her to be that crazy in the gym, but she’s such a competitor, so resilient,” said Bronze.\n“That’s why I know when she’s coming on in an England shirt, she can make a difference and she’ll give her all. I’ve seen it when nobody was there, when the fans weren’t there, the team wasn’t there, it was just me and her.”\nKelly has fulfilled the role of super sub to perfection.\nAgainst Sweden, when she came on in the 78th minute, her two pinpoint crosses were crucial to England’s comeback. She then dispatched her penalty with class.\nAgainst Italy, Kelly, as shown by the graphic below, ranked top for progressive carries, an impressive statistic given she only came on in the 77th minute.\nDespite not starting a single game, the England winger has also created eight chances, the highest number for a substitute in the competition. By comparison, Lauren Hemp and Alessia Russo have started all five games and created 10 and 11 chances, respectively.\nKelly accepts her role as a substitute without complaints. She was full of praise for her team-mate Michelle Agyemang, who brought England back from the brink yet again, describing the 19-year-old as an “unbelievable player” who has “the world at her feet”.\nAdvertisement\n“Kelly is a great team-mate to have around,” said Bronze. “She has not started any of the games but has made a difference in every single one. She is one of those players you want on your team.”\n“The way she carries herself off the pitch; I’ve not got enough good words to say about her,” added Greenwood.\nDespite Kelly saying she is responsible for who she is today, she has not forgotten those who have helped her on this journey.\n“Confidence comes from within but from around you as well,” she said. “The players I stand side by side with on the pitch breed confidence in each other. A lot of self-talk definitely happens. My family is really important and breeds a lot of confidence within me.”\n(Top photo: Eddie Keogh/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6499383/2025/07/17/olivia-smith-behind-the-deal-record-liverpool-arsenal/",
      "text": "Olivia Smith was always going to become women’s football’s first £1million player this summer — but nobody was meant to know.\nConfidentiality was the modus operandi before Smith’s record-breaking £1million ($1.34m) transfer from Liverpool to Arsenal became official on Thursday.\nThe circle of trust was small: Liverpool’s new managing director of women’s football, Andy O’Boyle, drove negotiations from Merseyside, with his Arsenal counterpart, Clare Wheatley, making decisions at the London end, before bringing in the player’s camp for the final negotiations. Not even Smith’s former Liverpool team-mate and captain, Taylor Hinds, whose contract expired in June and has joined Arsenal, was told about her decision.\nAdvertisement\nWhen Arsenal confirmed her arrival on a four-year contract this morning, the club’s press release stated only that Smith moved for an “undisclosed fee”.\nThe intimacy of the talks reflects how the Canada international has operated almost since her father, Sean Smith, placed a ball at his three-year-old daughter’s feet in Whitby, a town on the outskirts of Toronto.\nIn the Smith family, loyalty is not a currency; it is a way of life. Privacy is part of the equation.\nSo when Smith’s face was plastered across the internet on July 10, with stories reporting that Liverpool had agreed to sell the 20-year-old to Arsenal for a world-record transfer fee, a sense of chaos descended.\nAccording to sources, who, like all named in this article, wished to remain anonymous to protect relationships, privacy was important due to Smith’s youth and the inflated pressure that can come with a large price tag. Equally, even if Liverpool had accepted a bid from Arsenal, the player had not signed anything yet.\nThe next six days were spent taking the necessary steps to hammer out a deal.\nThe latest addition to the Arsenal family ❤️\nOlivia Smith is a Gunner ✍️ pic.twitter.com/9tDKSMcfxf\n— Arsenal Women (@ArsenalWFC) July 17, 2025\nSmith’s ability to adapt and conquer challenges, however, is part of the reason Arsenal felt comfortable committing £1million, plus the cost of her wages, on a forward who only scored seven goals in her one and only Women’s Super League campaign. The past three years have seen Smith climb from the semi-professional League 1 Ontario to Sporting CP in Portugal’s top flight (where she scored 13 goals and assisted nine in 18 league appearances) to Liverpool as their record signing at €250,000 (£216,000/$289,000 at current rates) last summer.\nThe WSL’s platform meant Smith’s scintillating performances with Liverpool, as well as her instinct and prowess in front of goal, caught the eye across Europe and back home in North America. But it was her raw ambition and mental maturity that led to the record move.\nAdvertisement\nIn Smith, Arsenal believe they have signed a young player who possesses an unrivalled mentality and a massive ceiling for development. To be proven in the highest division in two European leagues at 20 is rare, and while other clubs — such as Chelsea, France’s Lyon and Manchester City — were interested, Arsenal felt their plans for Smith set them apart.\nRather than just telling the forward how good she is, there were active discussions with the north London club on where they felt she could still improve. Head of player development James Honeyman supported Wheatley with these discussions, while former England international Jodie Taylor, Arsenal’s football services executive, provided a fellow player’s perspective.\nInitially, Liverpool had no intention to sell.\nThis was their message in January, as interest in Smith began to strengthen after her first five months in the WSL, and once again after they finished seventh in the 12-team league in early May.\nInternally, club officials knew that, at some point, Smith would leave, but they felt that since her contract would not expire until 2027, they had time. When then-head coach Matt Beard pushed to sign Smith for a club-record fee — committing nearly all of Liverpool’s summer 2024 budget for the women’s operation to one player — one of the major selling points to Liverpool’s owners at Fenway Sports Group (FSG) was the prospect of a profitable departure at some point.\nFSG’s operational model is based on spending only what a team brings in. Liverpool’s commitment to this template has significantly reduced the transfer expenditure of their women’s team compared to clubs further up the WSL table, a point of frustration for supporters and staff, including Beard, who cited this lack of investment throughout a four-year tenure that ended with his firing in February.\nAdvertisement\nLast summer, Liverpool ranked in the bottom four among WSL clubs for squad investment, ahead of only Everton, West Ham United and promoted Crystal Palace.\nSo while the club did not want to sell Smith, a consensus grew that any offer deemed “silly to pass on”, as one source at Liverpool put it, would need to be considered for the future of the women’s team. The world-record transfer of U.S. women’s national team defender Naomi Girma from San Diego Wave of the American NWSL to Chelsea in January for $1.1million (£909,000 at the time) served as a benchmark.\nThe man tasked with leading any transfer of Smith was O’Boyle, who had replaced Russ Fraser as Liverpool's managing director of women's football in April.\nO’Boyle is described by multiple people close to the deal as operating as the “lone wolf” who ensured all contact from interested parties worked exclusively through him and drove a “steep bidding war”.\nAs mentioned, interest in Smith from around Europe and within the WSL had begun as early as January. Manchester City made informal contact in February, but the lack of a full-time manager there after Gareth Taylor was sacked the following month ended their hopes. Two Michele Kang-owned teams, Lyon and the NWSL's Washington Spirit, were looking, too.\nIn June, Paris-Saint Germain had a bid rejected by Liverpool, who said it was less than half of what another club had put on the table. Club sources say the highest bid at that point was around £750,000.\nDespite Chelsea being in the mix before Smith’s move to Sporting, they did not want to be drawn into a bidding war this summer and felt her lack of experience and their large pool of options did not countenance meeting Liverpool’s asking price. Their highest offer never went above £650,000.\nArsenal had been tracking Smith for years, but their interest was not formalised until the second half of last season. March ended up being an informative month, not only because they kick-started their journey to a Champions League final they would eventually win with a comeback victory over Real Madrid in a two-leg quarter-final, but also because of two games against Liverpool.\nAdvertisement\nThe first came in the FA Cup quarter-finals, at home at Meadow Park. Liverpool won 1-0, and Smith caused constant issues for defender Katie McCabe. When Liverpool visited again two weeks later, this time at the Emirates Stadium in the league, Arsenal had devised a plan to nullify the Canadian specifically. They won 4-0.\nMeanwhile, the studying that has eventually made Smith an Arsenal player continued.\nDespite the money being demanded by the Merseyside club, Arsenal’s pursuit was “persistent”, as one source says, to the point Liverpool and Smith felt a move was inevitable. From an Arsenal perspective, that manifested in a confidence that they would always be the ones to seal a deal with the player.\nA world-record bid for promising young forwards is not new territory for Arsenal.\nIn January 2023, they made such an offer for Alessia Russo before signing the England striker, then 24, as a free agent when her Manchester United contract expired that summer.\nArsenal’s recent success, on and off the pitch, allowed them to bid so highly for Smith. Their savvy recruitment elsewhere also played a part. While Russo, Spain international Mariona Caldentey and Hinds are likely to be on considerable wages, signing them as free agents from United, Barcelona and Liverpool allows Arsenal some financial freedom.\nWinning the Women's Champions League in May was not as influential as some might think in monetary terms. Their prize money brought an initial windfall of €1million, rising to €1.5m in October following performance-based bonuses. But most of that will go towards operational costs, rather than being directly used in recruitment. As with most teams, the transfer budget at Arsenal Women comes from the parent club plus their own resources.\nWhile Smith’s brief senior career has been a dizzying series of ladder-climbs, leaving Liverpool was not on her cards this summer, according to multiple sources close to the player.\nHer calibre of play and star power led some within the club, and many outside it, to believe Smith had the potential to become the face of Liverpool women's team, even drawing comparisons with the men's side's Mohamed Salah, who joined from Roma of Italy for a then-club-record £36.9million in 2017 and has gone on to become the club’s record goalscorer in the Premier League.\nAdvertisement\nSmith, who scored Liverpool Women’s first WSL goal at Anfield in her debut at the club's main stadium in October, got two more there in March in a 3-1 win against Manchester United — the team’s first WSL victory at one of the sport's most iconic grounds. Dad Sean, with whom she maintains a close bond, is a lifelong Liverpool fan. She also liked the club’s staff, got along well with her team-mates and believed another season on Merseyside could be beneficial for her development.\nHowever, the February sacking of Beard, who had been pivotal in securing her signature, and the protracted, still-ongoing process of finding his permanent replacement (Liverpool are in talks with former City boss Taylor) left Smith’s camp with a sense of uncertainty. The departure of Hinds to Arsenal, as well as vocal interest from clubs who could promise better infrastructure and proven development tracks, became difficult to ignore.\nSelecting an environment where Smith could maximise her personal and professional development was paramount.\nWith Arsenal’s pedigree in developing and nurturing talent — Russo's progress since her arrival two years ago is one recent example — the club looked like a compelling landing spot for a player hoping to raise her stock. Winning the Champions League final, and head coach Renee Slegers’ history of working in their academy reinforced Arsenal’s reputation as a place for growth. The commitment to play all women's home matches next season at the 60,000-capacity Emirates was also a factor for Smith.\nOff the pitch, Arsenal have also excelled. In their 2023-24 accounts (up to May 2024, but released in March this year), their gate and other matchday revenues rose from £2.6million in 2022-23 to £4.3m, while their overall turnover grew from £10.9m to £15.2m. These figures would not have played a direct role in recruiting Smith, but show the direction Arsenal are heading in. Even with this deal's record outlay, the club do not expect this to be the end of their summer transfer business.\nUltimately, decision-makers at Liverpool acknowledged they were not in the position to offer Smith the resources and opportunities that Champions League-competing clubs can. They also believe selling for a fee nearly five times greater than what was paid for her just a year ago could push them closer to that status, if it's invested smartly.\nThe blueprint is there on the men’s side at Liverpool. In January 2018, they sold Philippe Coutinho to Barcelona for £142million. The money received helped pay for defender (and now team captain) Virgil van Dijk in that window and goalkeeper Alisson in the next one, both of whom were crucial to the club’s 2019 Champions League triumph and 2019-20 and 2024-25 Premier League title wins.\nAdvertisement\nThe sense of excitement and pride for those who have aided Smith on her journey is overwhelming — but that milestone fee is not the source. Instead, it's the sense of validation and acknowledged worth for the player’s countless sacrifices.\nSmith will need to adapt to what will be the greatest step up in her career to date, but former colleagues at Liverpool and her new ones at Arsenal harbour few worries that she will have any problems doing just that.\n(Top photo: Getty Images; design: Eamonn Dalton)"
    }
  ],
  "argos_summary": "Arsenal’s summer transfer window saw a focus on home‑grown talent, with the women’s squad signing former academy players Chloe Kelly and Taylor Hinds, both of whom returned after stints at Everton, Manchester City and Liverpool, while record‑setting forward Olivia Smith joined from Liverpool for a club‑record £1 million fee. The signings reinforce Arsenal’s strategy of strengthening depth on the wings and full‑back positions, adding competition for places alongside established internationals like Caitlin Foord, Beth Mead, Katie McCabe, Emily Fox and Steph Catley. Meanwhile, the men’s side is in talks to bring back former Hale End product Eberechi Eze from Crystal Palace, a move that would match Tottenham’s offer and address the squad’s attacking needs amid Kai Havertz’s injury concerns. Together, these moves underscore Arsenal’s ambition to build on recent successes, including a Champions League triumph, by investing in both experienced internationals and promising young talent across both squads.",
  "argos_id": "8L0102S47"
}