{
  "url": "https://www.yahoo.com/entertainment/articles/morgan-wallen-wont-submit-no-182157526.html",
  "authorsByline": "Paige Skinner",
  "articleId": "771fdc782ce749c8a00fa1e0c6c7f0fc",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/9453157c20f4c126cba427409e51f7d8a4819ce8144346f1eb8b0b0b69b2df5f/ynews/resizefill_w1200/https://media.zenfs.com/en/the_huffington_post_584/49b4b3fc5b2c73421c484254341a2d54",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T18:21:57+00:00",
  "addDate": "2025-08-21T19:00:50.817937+00:00",
  "refreshDate": "2025-08-21T19:00:50.817938+00:00",
  "score": 1.0,
  "title": "Morgan Wallen Won't Submit His No. 1 Album To The Grammys This Year",
  "description": "The country singer has never received a Grammy nomination for any work on his solo albums.",
  "content": "Country singer Morgan Wallen won’t submit his latest album, “I’m the Problem,” for Grammy consideration.\n\nThe album, which was released in May and features duets with Tate McRae, Eric Church and Post Malone, was a commercial success, debuting at No. 1 on the Billboard 200 chart. But the critical reception was mixed, with Rolling Stone giving the album three out of five stars.\n\nRelated: 'Elvis' Star Scouted Baseball Players' Backsides As He Bulked Up For New Movie\n\nBillboard and Hits Daily Double were the first to report on Wallen’s decision to not submit the album for the awards.\n\nRelated: EWW! 'South Park' Gets Extra Raunchy In X-Rated New Trump Takedown\n\nWallen, who released his debut album in 2018, has only been recognized by the Recording Academy, which hosts the Grammy Awards, twice — neither time for his own songs. He received nominations for Best Country Song and Country Duo/Group Performance, both for his features on Post Malone songs.\n\nRelated: Dua Lipa Explains Why That Sheer White Dress She Wore To A Wedding Wasn't Actually Offensive\n\nIt’s unclear why Wallen isn’t submitting his work to the Grammys and his reps did not immediately respond to a request for comment, but other artists have boycotted the Grammys in the past, including Drake and The Weeknd, who have both been critical of the voting process. The Weeknd broke his boycott in February, when he performed at the Grammys. Before his performance, Harvey Mason Jr., the CEO of the Recording Academy, said in a speech that he listened to The Weeknd’s criticism and redid the Grammys voting body, making it more diverse.\n\nWallen hasn’t been one to play by the rules. While appearing as the musical guest on NBC’s “Saturday Night Live” in March, Wallen walked off the show’s stage while host Mikey Madison and the cast members were still saying their goodbyes. Immediately afterward, he posted a photo of his plane with the caption, “Get me to God’s country.” He later said it wasn’t anything personal and that he was just ready to get home.\n\nRelated: ‘South Park’ Turns Up The Heat On Trump With ‘Perfect’ Return Of Beloved Character\n\nIn 2021, Wallen was “indefinitely” suspended by his record label after he was caught on video saying a racial slur. The Academy of Country Music announced his “Dangerous: The Double Album” wouldn’t be eligible for its awards that year.\n\nWallen made news again in 2024 when he threw a chair off the roof of a bar in Nashville. He pleaded guilty to two misdemeanor counts of reckless endangerment.\n\nThe Grammys did not immediately respond to a request for comment.",
  "medium": "Article",
  "links": [
    "https://www.huffpost.com/entry/saturday-night-live-morgan-wallen_n_67f3e6f5e4b0d28cb3c87e1d?utm_campaign=yahoo-recirc",
    "https://www.huffpost.com/entry/morgan-wallen-snl-walk-off_n_6820eb81e4b06987bce14cd8",
    "https://www.huffpost.com/entry/dua-lipa-wedding-guest-dress-controversy_n_68a5f0f8e4b08e59891ea417?utm_campaign=yahoo-recirc",
    "https://www.huffpost.com/entry/south-park-trump-towelie-penis_n_68a699c6e4b0221ae0929f9a?utm_campaign=yahoo-recirc",
    "https://www.huffpost.com/entry/morgan-wallen-snl-walk-off_n_6820eb81e4b06987bce14cd8?utm_campaign=yahoo-recirc",
    "https://www.billboard.com/music/awards/morgan-wallen-im-the-problem-not-submitted-2026-grammys-1236047754/",
    "https://www.huffpost.com/entry/austin-butler-baseball-butts-movie-training_n_68a5ee68e4b0d3165620363d?utm_campaign=yahoo-recirc",
    "https://www.huffpost.com/entry/morgan-wallen-wont-submit-album-to-grammys-this-year_n_68a73119e4b0221ae092dd0f?utm_campaign=yahoo-recirc",
    "https://www.huffpost.com/entry/morgan-wallen-guilty-plea-chair-throwing_n_675b4822e4b08876deeb76cc",
    "https://www.huffpost.com/entry/south-park-towelie-trump_n_68a55220e4b021f222362346?utm_campaign=yahoo-recirc",
    "https://68a4be8b3cdda8000840d17f--hits-daily-double.netlify.app/news/grammys/wallen-declines-to-submit-album-for-grammy-2025-08-19",
    "https://www.cnn.com/2025/02/03/entertainment/the-weeknd-grammys-boycott",
    "https://www.rollingstone.com/music/music-album-reviews/morgan-wallen-im-the-problem-review-1235341551/",
    "https://www.huffpost.com/entry/morgan-wallen-guilty-plea-chair-throwing_n_675b4822e4b08876deeb76cc?utm_campaign=yahoo-recirc"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Morgan Wallen",
      "weight": 0.09064115
    },
    {
      "name": "Wallen",
      "weight": 0.0883267
    },
    {
      "name": "Country singer Morgan Wallen",
      "weight": 0.08516919
    },
    {
      "name": "Grammys",
      "weight": 0.06894953
    },
    {
      "name": "X-Rated New Trump Takedown",
      "weight": 0.06694244
    },
    {
      "name": "Post Malone songs",
      "weight": 0.06277054
    },
    {
      "name": "Best Country Song",
      "weight": 0.062209774
    },
    {
      "name": "Post Malone",
      "weight": 0.05954714
    },
    {
      "name": "Country Music",
      "weight": 0.05888839
    },
    {
      "name": "South Park",
      "weight": 0.057883225
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.97412109375
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.6943359375
    }
  ],
  "sentiment": {
    "positive": 0.070286736,
    "negative": 0.68101144,
    "neutral": 0.24870184
  },
  "summary": "Country singer Morgan Wallen has decided not to submit his latest album, \"I'm the Problem,\" for consideration at the Grammys. The album, which debuted at No. 1 on the Billboard 200, was mixed with reviews, with Rolling Stone giving it three out of five stars. Wallen, who has only been recognized twice by the Recording Academy, received nominations for Best Country Song and Country Duo/Group Performance for his features on Post Malone songs. It is unclear why Wallen is not submitting his work to the Gram Awards, but other artists have done so in the past, including Drake and The Weeknd, who have criticized the voting process.",
  "shortSummary": "Country singer Morgan Wallen won't submit his latest album for the Grammys, despite it debuting at number one; he's known for controversial performances.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "142eddc497c5499296803c54fa459a43",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.huffpost.com/entry/dua-lipa-wedding-guest-dress-controversy_n_68a5f0f8e4b08e59891ea417?utm_campaign=yahoo-recirc",
      "text": "Dua Lipa is setting the record straight on a wedding guest outfit she wore that sparked outrage on the internet.\nThe “Levitating” singer addressed the dress in question that she wore to designer Simon Porte Jacquemus and Marco Maestri’s 2022 nuptials.\n“This outfit kind of caused a little bit of a stir online because it’s a wedding, and traditionally you’re not supposed to wear white to a wedding,” the singer shared in a video for Harper’s Bazaar’s “Fashion Flashback” series, which was released on Tuesday.\n“The dress code was white, and it was a gay wedding,” she shared. “From all the pictures you can see that everybody’s wearing white, so I don’t know why I got so much stick for it.”\nWell, she actually has one theory as to why people freaked out.\n“I think also because I was kind of quite naked as well,” Lipa said of the dress, which was indeed very sheer and very white.\nBut one of the grooms ― Jacquemus, the 35-year-old founder of his namesake fashion label ― had actually even designed the dress so that the singer would wear it to his nuptials in France.\n“It was at his request that I wore this dress to his wedding,” the “Barbie” actor added. “I absolutely loved it, I felt so good in it.”\nDua Lipa isn’t the only one who’s faced wrath for wearing a certain outfit to a wedding. Kendall Jenner once found herself at the center of controversy for a risqué dress she wore to friend Lauren Perez’s wedding in 2022.\nThe model’s scandalous black gown included slits from her neck to her navel, which many commenters found “inappropriate” due to the amount of skin showing.\nThe social media firestorm eventually caused the bride herself to weigh in. Perez said Jenner looked “stunning” and said she personally “loved” the dress. Jenner said in response to Perez that she “obvi asked for your approval in advance too.”"
    },
    {
      "url": "https://www.huffpost.com/entry/saturday-night-live-morgan-wallen_n_67f3e6f5e4b0d28cb3c87e1d?utm_campaign=yahoo-recirc",
      "text": "Morgan Wallen likely got more than he bargained for when he walked off the set of “Saturday Night Live” early last week.\nViewers noticed that the country singer, who served as the episode’s musical guest, made a surprisingly swift exit before the end credits even started to roll during the show’s “goodnights.”\nShortly after, Wallen shared a photo of a private plane with the caption, “Get me to God’s Country.”\nNaturally, “SNL” cast members and writers couldn’t resist taking a jab at the buzz Wallen created, and poked fun at his outburst during this week’s episode.\nTo kick off the show, James Austin Johnson portrayed President Donald Trump in a cold open sketch tackling tariffs.\n“I even put tariffs on an island that is uninhabited by humans. It’s called Heard and McDonald Island,” Johnson said as Trump.\n“You know, I had to mock up some artwork of McDonald Island,” he said.\n“I want to go to there. Get me to God’s Country, right?” he said, as the audience burst into laughter and applause. “Remember that? Wow.”\nColin Jost later took a jab at Wallen during a “Weekend Update” segment.\n“In the past two days, investors have lost over $6 trillion,” Jost said during another segment tackling Trump’s tariffs.\n“Money is leaving the stock market faster than Morgan Wallen at ‘goodnights,’” he quipped, as the audience again roared with laughter.\nKenan Thompson is the only “SNL” cast member so far to publicly speak about Wallen’s quick exit.\n“I don’t know what goes through people’s minds when they decide to do stuff like that,” Thompson said in an interview with Entertainment Weekly published last week. “I don’t know if he understood the assignment or not, or if he was really feeling a certain kind of way.”\nThompson said Wallen’s exit was “definitely a spike in the norm.”\n“We’re so used to everybody just turning around and high-fiving us, everybody’s saying, ‘Good job, good job, good job,’” he said. “So when there’s a departure from that, it’s like, ‘Hmm, I wonder what that’s about?’”\nThompson also added that he wasn’t sure if Wallen “had to go to the potty or something.”\nWallen has not yet said anything about the incident though he is now selling “Get me to God’s Country” merchandise on his website.\nThe country singer has had a rocky history with “SNL.” Back in October 2020, he was pulled from the show’s lineup for violating COVID-19 safety guidelines.\nWhen he returned that December, he cracked jokes about the incident during his appearance."
    },
    {
      "url": "https://www.huffpost.com/entry/morgan-wallen-snl-walk-off_n_6820eb81e4b06987bce14cd8?utm_campaign=yahoo-recirc",
      "text": "Country singer Morgan Wallen cleared up rumors that he angrily exited “Saturday Night Live” when he performed on the show as its musical guest in March, saying that “SNL” didn’t make him mad.\n“I was just ready to go home,” Wallen told comedian Caleb Pressley on Pressley’s YouTube channel. “I had been there all week.”\nIn a video published Sunday, Wallen appeared in Pressley’s comedic “Sundae Conversation” series, in which Pressley asked Wallen humorous questions, including if he cuts his own grass and takes out his own trash. Pressley then asked Wallen if he was a handyman around the house.\n“Could you fix a TV ―” Pressley said before pausing, “if it was on ‘SNL’?”\nWallen laughed, then said, “I could change it, for sure.”\nWallen made headlines in late March when he walked off the “SNL” stage, while the rest of the cast and guest host Mikey Madison were still saying their goodbyes. Later that night, Wallen posted a photo of his private jet on social media with the caption, “Get me to God’s country.” The caption soon became a meme with social media users writing it alongside irrelevant photos, including “SNL” writer Josh Patten, who posted a photo of a Krispy Kreme truck with the caption.\nLongtime “SNL” cast member Kenan Thompson said Wallen’s exit was “definitely a spike in the norm” and thought Wallen “had to go to the potty or something.”\n“I don’t know what goes through people’s minds when they decide to do stuff like that,” Thompson said. “I don’t know if he understood the assignment or not, or if he was really feeling a certain kind of way.”\nAccording to The Hollywood Reporter, “SNL” asked Wallen to appear in the pre-taped musical sketch “Big Dumb Line,” but he “wasn’t available.” Instead, Joe Jonas filled in.\nIn October 2020, Wallen was disinvited from performing on “SNL” after videos surfaced of him partying and not adhering to social distancing during the COVID-19 pandemic. A few months later, he was invited back and even made fun of the ordeal in a skit."
    },
    {
      "url": "https://www.huffpost.com/entry/south-park-towelie-trump_n_68a55220e4b021f222362346?utm_campaign=yahoo-recirc",
      "text": "“South Park” released a new clip teasing Wednesday night’s episode that features the return of a fan-favorite character as the show appears set to continue trolling President Donald Trump.\nThe clip shows Towelie ― a sentient towel who loves to get high ― arriving by bus in Washington, D.C., to find the city under military control.\n“This seems like the perfect place for a towel,” Towelie says as he watches a tank roll past the White House ― mimicking the real-life situation in which Trump has sent the National Guard into the city.\nTrump has claimed the military is needed to bring order to a city besieged by crime. However, the violent crime rate there dropped in both 2024 and 2025, leading critics to blast the move as a “stunt.”\n“South Park” has pulled a few stunts of its own since the show returned last month, mocking corporate parent Paramount for caving to Trump by agreeing to pay $16 million to settle a lawsuit over “60 Minutes” that most legal observers considered frivolous.\nTrump has claimed the settlement includes PSAs, and “South Park” mockingly gave him one at the end of the episode, which showed a very realistic Trump stripping in the desert until he was naked, complete with a talking “teeny tiny” penis.\nThe show continued to go after Trump and his administration in the second episode, which focused mostly on Homeland Security Secretary Kristi Noem.\nThe next episode airs Wednesday night on Comedy Central and will stream on Paramount+."
    },
    {
      "url": "https://www.cnn.com/2025/02/03/entertainment/the-weeknd-grammys-boycott",
      "text": "The Weeknd announced a world tour last week, but that wasn’t the only news.\nThe singer ended his four-year boycott of the Grammys on Sunday, when he took to the stage at the awards show to perform.\nHarvey Mason Jr., chief executive officer of the Recording Academy and MusiCares, introduced The Weeknd and recalled how the singer/songwriter was vocal after Mason first took over the role in 2020.\n“I remember waking up to the headlines that the Weeknd called out the Academy for lack of transparency in our awards. He went so far as to announce he was boycotting the Grammys,” Mason said from the Grammys stage. “That made for some interesting reading over breakfast. But you know what? Criticism is, okay. I heard him. I felt his conviction.”\nThe Weeknd had been riding high in 2020, smashing streaming records with his single “Blinding Lights.” He spoke up after he failed to garner a single Grammy nomination that year.\nMason let it be known that the Canadian singer was heard loud and clear.\n“What we all want is an organization dedicated to the wellbeing of all music makers and one that reflects the entire music community for now and for future generations,” Mason said on stage. “So over the past few years, we’ve listened, we’ve acted, and we’ve changed.”\nSince then, Mason said, the Recording Academy has “remade our membership, adding more than 3,000 women voting members.”\n“The Grammy electorate is now younger, nearly 40% people of color, and 66% of our members are new,” Mason said. “Since we started our transformation this year, the 13,000 voting members of the Academy nominated their peers and voted for the winners that you’re seeing on this stage tonight. It’s a system rooted in fairness, integrity, and the principle that every voice in our community matters.”\nThe Weeknd showed he has moved on with his surprise performance of “Cry For Me” and “Timeless” from his new album, titled “Hurry Up Tomorrow.” The project serves as the final chapter in his trilogy, following “After Hours” (2020) and “Dawn FM” (2022).\nHis “After Hours Til Dawn” stadium tour kicks off on Friday, May 9 in Phoenix, Arizona. There will be additional stops in Detroit, Chicago, Montréal, Denver, Las Vegas, Seattle, Vancouver, Miami, Atlanta, and more."
    },
    {
      "url": "https://www.rollingstone.com/music/music-album-reviews/morgan-wallen-im-the-problem-review-1235341551/",
      "text": "Morgan Wallen Is America’s Problem\nYou could say that Morgan Wallen has achieved his 2020s pop domination by brute force. His last two albums — 2021’s Dangerous: The Double Album and 2023’s One Thing at a Time — clock in at 30 and 36 tracks respectively, which thanks to streaming-era math is a boon to one’s chart fortunes. Just look at the current albums chart: Both releases are still in the Billboard 200’s top ten as of this writing, with Thing at Number 4 and Dangerous at Number 9, and they’ve each clocked in more than 100 weeks in the album chart’s highest echelon. But other artists have released data dumps without being rewarded by long-term listening and tours that consist of multi-night stadium stints. What is it about Wallen — a former baseball player and The Voice castoff from small-town Tennessee with a battery-acid-dipped drawl and a lot of search results that also include the word “controversy” — that makes him such a draw?\nI’m the Problem, Wallen’s fourth album, has a title that could double as a cheeky answer to that question. The song named after it, which leads off the track listing, is a stormy chronicle of a toxic relationship that seems too doomed to fail (“If I’m such a waste of breath/Such a waste of time/Then why you on your way to waste another Friday night?” Wallen grouses on the bridge). Placing it front and center reinforces the love-me-or-hate-me stance that Wallen has cultivated since his breakthrough in the late 2010s — an attitude that seems very attuned to a particular strain of the modern American mood, and one driven home by his albums’ heft.\nThis is why writing about Wallen’s on-record output can be a tricky thing. He has a bristly persona and history of not-great acts that can bleed into some listeners’ perceptions of him — and it isn’t helped by lines like “Baby I can’t wait to see the look on your pretty face, when I break your heart in two,” which appears on the blithely spiteful poison-pen letter “Kiss Her in Front of You.” But his polished (if slightly dour) country-rock is, as a representation of the form, well-crafted and hooky while not being immune to the occasional stylistic left turn: The existentially troubled line-disco cut “Love Somebody” could fit in on a Dua Lipa record with a couple of tweaks (it actually interpolates the British DJ Digital Farm Animals’ 2018 EDM-pop cut “Tokyo Nights,” which Lipa also flipped on her punchy 2024 single “Training Season”), while the whiskey-and-regret-soaked “Genesis” has a weary gleam that recalls mid-period Fleetwood Mac, and the duet with moody Canadian upstart Tate McRae, “What I Want,” has trap snares fluttering around the chorus.\nNot that his music is only ear-catching when it’s melding country with something else. “Jack and Jill,” which recounts the tale of two small-town kids whose big dreams get buried by a pile of empty bottles, is arrestingly told, with a gut-punch of a final line: “The preacher they used when they said ‘I do’/Is reading out of Psalm 23.” Wallen’s weary wail is well-suited to this particular tale of heartland heartbreak —wouldn’t you be at your wit’s end to see two more lives wasted like this? — and it helps the ballad, which is tucked into the album’s back half, stand out. Another track that comes near the end, the stomping country-rocker “Working Man’s Song,” also captures the zeitgeist: “I punch the clock, wanna punch a ticket to New York and punch the boss,” he grumbles over sturdy guitars, and even though he’s reached the echelon of stadium-headliner stardom where he’s probably a boss in some sense, the roiling anger feels real. (Another track with a more generalized antipathy toward city slickers, the HARDY-assisted “Come Back As a Redneck,” is less successful despite its music having enough bless-your-heart stevia to turn a swimming pool into sweet tea.)\nA more generous reading of Wallen’s penchant for albums that blow past the 90-minute mark might be that he feels like he has too much going on to fit his life into a standard release’s track listing, and in order to fully express himself he (with the help of Nashville’s top-flight songwriters and longtime producer Joey Moi) needs to gather up his feelings, contradictions and all, into an omnibus not dissimilar to those end-of-season Instagram photo compilations — although he’s more likely to flaunt his rougher moments than your typical poster. “Superman,” a free-flowing note to his son, gets into his public scrapes (“One day you’re gonna see my mugshot/From a night when I got a little too drunk” is its opening line) and alcoholism (“Now and then that bottle’s my kryptonite/Brings a man of steel down to his knees”) while admitting, “I hope I’m always your hero,” a sentiment that’s animated songs about the surprises that accompany parenthood since way before “Cat’s in the Cradle” was first committed to vinyl.\nPerhaps that willingness to nod toward his fuck-ups and air out his ugly thoughts is why people keep returning to Wallen and his music. After all, his official merch store is selling a necklace that declares, in precisely rendered sterling silver, that its wearer is, just like Wallen, “The Problem” — a bit of branded aspirationalism that also nods to why Wallen is one of this moment’s biggest stars. Yes, his public behavior and the music’s country trappings — from the copious shout-outs to whiskey to the banjos and mandolins — might make him seem more amenable to one side of 2025’s ever-widening political divide. But the “love me or leave me” attitude that animates his glowering songs is as American as apple pie — or apple pie whiskey."
    },
    {
      "url": "https://www.billboard.com/music/awards/morgan-wallen-im-the-problem-not-submitted-2026-grammys-1236047754/",
      "text": "As Morgan Wallen’s I’m the Problem sits at No. 1 on the Billboard 200 for the 11th non-consecutive week, Billboard has learned that his team will not submit the album, any of the 37 songs on the voluminous set, or Wallen for consideration for the 68th Grammy Awards, to be held Feb. 1, 2026.\nHits Daily Double broke the news earlier Tuesday (Aug. 19) that the album would not be submitted, but Billboard understands that the action goes further and includes not putting Wallen forward in any category, such as best country solo performance, or any of the seven songs that he co-wrote in any song categories in any genre or general field.\nHowever, Wallen and his camp are not stopping the other songwriters from submitting their works from the album, which has already spawned four No. 1s on Billboard’s Country Airplay chart and three chart-toppers on the Hot Country Songs chart. It has also generated one No. 1 on the Billboard Hot 100: Wallen’s duet with Tate McRae, “What I Want.”\nTrending on Billboard\nWallen, whose 2021 Big Loud/Republic album Dangerous: The Double Album is Billboard‘s No. 1 album of the first 25 years of the 21st century, is removing himself from consideration from an awards body whose voters have almost totally ignored his musical contributions.\nThe only Grammy nominations that the country superstar has received in his nearly 10-year career were for his work on Post Malone’s F1 Trillion album. Their chart-topping duet, “I Had Some Help,” received nods for best country duo/group performance and best country song for the awards presented this past February. Wallen has never received any nominations for any works from his solo albums.\nThough Wallen received no Grammy nominations, including best new artist, through the first few years of his budding superstardom, he further lost momentum in early 2021 when he was captured on video by a neighbor using a racial slur. He subsequently apologized and went to rehab.\nThough both the Academy of Country Music Awards and the Country Music Association Awards disqualified Wallen from eligibility for individual artist awards for one year, the Grammy Awards did not disqualify Wallen from being nominated.\nThe country-oriented awards, have welcomed Wallen back to a varying degree. Since the ACM and CMA Awards the bans were lifted, Wallen has received 13 CMA Awards nominations, and won the big one, entertainer of the year, in 2024.\nAt the ACM Awards, he has received 20 nominations since the scandal, winning three — album of the year in 2022 for Dangerous: The Double Album and an ACM Milestone Award that same year, and male artist of the year in 2023.\nAs of this week, Wallen has logged 40 weeks at No. 1 on the Billboard 200 — a total matched or exceeded by only eight artists in the chart’s nearly 70-year history. All eight of those artists have won multiple Grammys.\nAdditionally, Wallen is one of only 19 artists to log 30 or more weeks at No. 1 on the Billboard 200. Wallen and The Monkees are the only artists with 30 or more weeks at No. 1 who have not won a Grammy.\nFirst-round voting for the Grammy Awards runs Oct. 3-15 with nominations due to be announced Nov. 7.\nWallen’s action is extraordinarily rare, but not unprecedented among superstars. Both The Weeknd and Drake previously decided not to submit in the Grammy process. Their actions also followed years of feeling under-recognized.\nThe Weeknd decided to boycott the ceremony following his controversial shut-out at the 2021 ceremony. The R&B superstar was thought to be a strong contender for album of the year for his fourth LP After Hours, which spent four consecutive weeks at No. 1 on the Billboard 200, as well as for record and song of the year for his smash hit “Blinding Lights,” which became Billboard ‘s biggest Hot 100 song of all time. But when the 2021 Grammy Award nominations were revealed, The Weeknd’s name was nowhere to be found.\nThe Weeknd initially expressed his frustration toward the Recording Academy by tweeting, “The Grammys remain corrupt.” In his second Twitter missive, he wrote that he went from planning a Grammys performance to being “not invited.” The Weeknd later stated in a Billboard cover story that his snub in the top categories felt like “a sucker punch.”\nLike The Weeknd, Wallen may find himself nominated despite his decision not to submit, for example, if McRae’s team submits their duet. The Weeknd was up for three awards at the 2022 ceremony thanks to his contributions to recordings by Ye (formerly Kanye West) and Doja Cat.\nDrake blasted the Grammys following The Weeknd’s surprising shut-out at the 2021 Grammys. “I think we should stop allowing ourselves to be shocked every year by the disconnect between impactful music and these awards and just accept that what once was the highest form of recognition may no longer matter to the artists that exist now and the ones that come after,” he wrote on Instagram. “This is a great time for somebody to start something new that we can build up over time and pass on to the generations to come.”\nLeading up to the 2022 Grammy Awards, Drake was initially announced as a nominee for best rap performance (for “Way 2 Sexy,” featuring Future and Young Thug) and best rap album (for Certified Lover Boy), but asked to have his name withdrawn from contention for both awards on Dec. 6, 2021. The Recording Academy honored his request and officially removed his nominations for both awards.\nSince then, Drake has received eight nominations – all for collaborations with other artists.\nWallen’s representative declined to comment. Representatives from Big Loud, Republic and the Recording Academy did not immediately respond to a request for comment."
    },
    {
      "url": "https://www.huffpost.com/entry/morgan-wallen-snl-walk-off_n_6820eb81e4b06987bce14cd8",
      "text": "Country singer Morgan Wallen cleared up rumors that he angrily exited “Saturday Night Live” when he performed on the show as its musical guest in March, saying that “SNL” didn’t make him mad.\n“I was just ready to go home,” Wallen told comedian Caleb Pressley on Pressley’s YouTube channel. “I had been there all week.”\nIn a video published Sunday, Wallen appeared in Pressley’s comedic “Sundae Conversation” series, in which Pressley asked Wallen humorous questions, including if he cuts his own grass and takes out his own trash. Pressley then asked Wallen if he was a handyman around the house.\n“Could you fix a TV ―” Pressley said before pausing, “if it was on ‘SNL’?”\nWallen laughed, then said, “I could change it, for sure.”\nWallen made headlines in late March when he walked off the “SNL” stage, while the rest of the cast and guest host Mikey Madison were still saying their goodbyes. Later that night, Wallen posted a photo of his private jet on social media with the caption, “Get me to God’s country.” The caption soon became a meme with social media users writing it alongside irrelevant photos, including “SNL” writer Josh Patten, who posted a photo of a Krispy Kreme truck with the caption.\nLongtime “SNL” cast member Kenan Thompson said Wallen’s exit was “definitely a spike in the norm” and thought Wallen “had to go to the potty or something.”\n“I don’t know what goes through people’s minds when they decide to do stuff like that,” Thompson said. “I don’t know if he understood the assignment or not, or if he was really feeling a certain kind of way.”\nAccording to The Hollywood Reporter, “SNL” asked Wallen to appear in the pre-taped musical sketch “Big Dumb Line,” but he “wasn’t available.” Instead, Joe Jonas filled in.\nIn October 2020, Wallen was disinvited from performing on “SNL” after videos surfaced of him partying and not adhering to social distancing during the COVID-19 pandemic. A few months later, he was invited back and even made fun of the ordeal in a skit."
    },
    {
      "url": "https://www.huffpost.com/entry/morgan-wallen-wont-submit-album-to-grammys-this-year_n_68a73119e4b0221ae092dd0f?utm_campaign=yahoo-recirc",
      "text": "Country singer Morgan Wallen won’t submit his latest album, “I’m the Problem,” for Grammy consideration.\nThe album, which was released in May and features duets with Tate McRae, Eric Church and Post Malone, was a commercial success, debuting at No. 1 on the Billboard 200 chart. But the critical reception was mixed, with Rolling Stone giving the album three out of five stars.\nBillboard and Hits Daily Double were the first to report on Wallen’s decision to not submit the album for the awards.\nWallen, who released his debut album in 2018, has only been recognized by the Recording Academy, which hosts the Grammy Awards, twice — neither time for his own songs. He received nominations for Best Country Song and Country Duo/Group Performance, both for his features on Post Malone songs.\nIt’s unclear why Wallen isn’t submitting his work to the Grammys and his reps did not immediately respond to a request for comment, but other artists have boycotted the Grammys in the past, including Drake and The Weeknd, who have both been critical of the voting process. The Weeknd broke his boycott in February, when he performed at the Grammys. Before his performance, Harvey Mason Jr., the CEO of the Recording Academy, said in a speech that he listened to The Weeknd’s criticism and redid the Grammys voting body, making it more diverse.\nWallen hasn’t been one to play by the rules. While appearing as the musical guest on NBC’s “Saturday Night Live” in March, Wallen walked off the show’s stage while host Mikey Madison and the cast members were still saying their goodbyes. Immediately afterward, he posted a photo of his plane with the caption, “Get me to God’s country.” He later said it wasn’t anything personal and that he was just ready to get home.\nIn 2021, Wallen was “indefinitely” suspended by his record label after he was caught on video saying a racial slur. The Academy of Country Music announced his “Dangerous: The Double Album” wouldn’t be eligible for its awards that year.\nWallen made news again in 2024 when he threw a chair off the roof of a bar in Nashville. He pleaded guilty to two misdemeanor counts of reckless endangerment.\nThe Grammys did not immediately respond to a request for comment."
    },
    {
      "url": "https://www.huffpost.com/entry/morgan-wallen-guilty-plea-chair-throwing_n_675b4822e4b08876deeb76cc?utm_campaign=yahoo-recirc",
      "text": "Country singer Morgan Wallen will be incarcerated for seven days as part of a sentence for an incident in April when he threw a chair off the roof of a Nashville bar.\nWallen pleaded guilty Thursday in a Nashville courtroom to two misdemeanor counts of reckless endangerment, according to The Tennessean, a reduction from the three Class E felonies he faced at his initial arrest.\nAs a result of the plea, Wallen will spend seven days at a DUI education center and then be on probation for two years. He must also pay a $350 fine and court costs.\nWallen’s attorney Worrick Robinson issued a written statement after the court appearance saying that “upon the successful completion of his probation, the charges will be eligible for dismissal and expungement,” The Tennessean reported.\nWallen was arrested April 8 after he threw a chair from the sixth-floor rooftop of a bar owned by fellow singer Eric Church. The chair almost landed on two police officers standing on the street.\nBar staff told the police Wallen was the chair thrower, but he reportedly laughed off the incident.\nWallen didn’t comment on the incident or his arrest until April 19, when he tweeted on X, “I’m not proud of my behavior, and I accept responsibility.”\nApril’s arrest wasn’t Wallen’s first bout with the law at a celebrity-owned nightspot.\nIn May 2020, he was arrested for public intoxication and disorderly conduct after an incident at a Nashville bar owned by Kid Rock."
    },
    {
      "url": "https://www.huffpost.com/entry/south-park-trump-towelie-penis_n_68a699c6e4b0221ae0929f9a?utm_campaign=yahoo-recirc",
      "text": "“South Park” returned on Wednesday to hit President Donald Trump below the belt with multiple depictions of his “teeny tiny” penis.\nWarning: Spoilers below.\nThe episode also skewered tech CEOs and government leaders for bribing Trump with golden “gifts,” again depicted Trump’s bedroom lover as none other than Satan himself, and reduced Vice President JD Vance to a miniature sidekick who offers to bring his boss a “cumrag.”\nThat “cumrag,” tragically, turns out to be longtime “South Park” fan-favorite character Towelie.\nMuch of the episode focuses not on Trump, but on Randy Marsh ― Stan’s dad ― and his marijuana farm, which struggles after his workers are hauled off in a federal raid.\nHe sends Towelie to D.C. to lobby Trump for marijuana reclassification. Towelie finds the city overrun with military troops, as Trump has called in the National Guard, just as he has done in real life in a move critics have dismissed as a “stunt.”\nTowelie also finds a statue of Thomas Jefferson in the Capitol is now a statue of Trump, with a very small penis. Likewise, the statue of Abraham Lincoln at the Lincoln Memorial is also a statue of Trump, again with a tiny penis.\nWhen Towelie reaches the White House to meet Trump, an aide warns visitors to “avoid staring directly into his penis.”\nThere, Towelie joins a line of CEOs and officials who offer Trump “gifts” and assure him that his penis isn’t small.\nMeta CEO Mark Zuckerberg, for example, brings the president a gold-plated VR headset.\nTrump dismisses him as “a little bitch.”\nApple CEO Tim Cook shows up to give Trump a small sculpture ― something he did for real earlier this month.\nTrump takes the gift and goes to his bedroom, where he promptly tears off all his clothes and hops into bed with Satan.\n“Hey Satan! Look at what some dipshit tech CEO gave me,” he tells Satan. “I was thinking maybe we could try to shove it up your ass.”\nTowelie is there to lobby Trump to reclassify marijuana, but ends up as a gift to Trump instead. By the end of the episode, Satan finds Towelie in a White House bathroom, covered in white stains, begging for help.\n“Please,” Towelie asks Satan. “I wanna get out of here.”\n“So do I,” Satan replies. “But there is no escape from this place.”\n“South Park” has so far been biweekly since returning last month, and that pattern will continue ― at least for now ― as the next episode will air Sept. 3 on Comedy Central."
    },
    {
      "url": "https://www.huffpost.com/entry/morgan-wallen-guilty-plea-chair-throwing_n_675b4822e4b08876deeb76cc",
      "text": "Country singer Morgan Wallen will be incarcerated for seven days as part of a sentence for an incident in April when he threw a chair off the roof of a Nashville bar.\nWallen pleaded guilty Thursday in a Nashville courtroom to two misdemeanor counts of reckless endangerment, according to The Tennessean, a reduction from the three Class E felonies he faced at his initial arrest.\nAs a result of the plea, Wallen will spend seven days at a DUI education center and then be on probation for two years. He must also pay a $350 fine and court costs.\nWallen’s attorney Worrick Robinson issued a written statement after the court appearance saying that “upon the successful completion of his probation, the charges will be eligible for dismissal and expungement,” The Tennessean reported.\nWallen was arrested April 8 after he threw a chair from the sixth-floor rooftop of a bar owned by fellow singer Eric Church. The chair almost landed on two police officers standing on the street.\nBar staff told the police Wallen was the chair thrower, but he reportedly laughed off the incident.\nWallen didn’t comment on the incident or his arrest until April 19, when he tweeted on X, “I’m not proud of my behavior, and I accept responsibility.”\nApril’s arrest wasn’t Wallen’s first bout with the law at a celebrity-owned nightspot.\nIn May 2020, he was arrested for public intoxication and disorderly conduct after an incident at a Nashville bar owned by Kid Rock."
    },
    {
      "url": "https://www.huffpost.com/entry/austin-butler-baseball-butts-movie-training_n_68a5ee68e4b0d3165620363d?utm_campaign=yahoo-recirc",
      "text": "Austin Butler was given some unconventional prep material while gearing up for his upcoming baseball-flavored crime thriller, “Caught Stealing.”\nIn a new cover story for Men’s Health released Tuesday, the “Elvis” star shared how director Darren Aronofsky provided him with a plethora of photos of MLB players’ backsides so he knew just how to bulk up for his role as a former ballplayer caught in NYC’s gritty crime world.\n“I actually have a whole section of just baseball players’ asses that he would send me,” Butler told the magazine. “He was like, ‘Look how thick they are!’ ”\nIn addition to putting plenty of time in the gym, the actor told the magazine that he helped himself flesh out his 150-pound frame with a hearty diet of pizza and beer.\nBaseball players’ derrières have been earning a curious amount of attention as of late.\nOne topic that’s been fascinating sports fans has been Seattle Mariners catcher Cal Raleigh’s nickname: “Big Dumper.”\nBestowed with the moniker by a former teammate when he was first promoted to the major league back in 2021, the nickname really started making the rounds after Raleigh won the home run derby during this season’s All-Star weekend.\nHis posterior was even the focus of an awkwardly extreme close-up during a July broadcast of his team’s game against the New York Yankees.\nMariners gear with Raleigh’s ridiculous nickname have even begun outselling dupes of his standard jersey, the switch-hitter told GQ in a profile published last month."
    }
  ],
  "argos_summary": "Country star Morgan Wallen has decided not to submit his May‑released album \"I'm the Problem\"—which debuted at No. 1 on the Billboard 200 and features duets with Tate McRae, Eric Church and Post Malone—for any category at the 68th Grammy Awards, a move reported by Billboard and Hits Daily Double.  The album received mixed critical reception, earning a three‑star rating from Rolling Stone, and Wallen has only twice been recognized by the Recording Academy, both for collaborations with Post Malone.  While the exact motive behind the boycott remains unclear, Wallen’s history of public controversies—including a SNL stage walk‑off, a racial‑slur incident, and a recent reckless‑endangerment plea—may have influenced his decision, echoing similar Grammy boycotts by artists like Drake and The Weeknd.  The Recording Academy has responded to past criticisms by diversifying its voting body, but Wallen’s camp has declined to comment on the current withdrawal.",
  "argos_id": "AG3HNSQIV"
}