{
  "url": "https://www.bloomberg.com/news/videos/2025-08-21/balance-of-power-early-edition-8-21-2025-video?srnd=phx-technology",
  "authorsByline": "bn",
  "articleId": "0126be740f3642db95a2e27e7073fb15",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i4H7NBozdOpk/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T18:52:40.683000+00:00",
  "addDate": "2025-08-21T19:09:23.387092+00:00",
  "refreshDate": "2025-08-21T19:09:23.387093+00:00",
  "score": 1.0,
  "title": "DOJ Urges Fed’s Powell to Remove Cook",
  "description": "On the early edition of Balance of Power, Bloomberg Washington Correspondent Tyler Kendall and Senior Editor Michael Shepard discuss the latest news from Washington. On today's show, EY-Parthenon Senior Economist Lydia Boussour, Bluestack Strategies Founder Maura Gillespie, Lift Our Voices Co-Founder Julie Roginsky, Republican Congressman Nicole Malliotakis. (Source: Bloomberg)",
  "content": "Live from Washington, D.C. This is balance of power with Joe Matthew. The Justice Department confirms its plans to investigate a top Fed official as the White House maintains its pressure campaign on the central bank. Welcome to the Thursday edition of the fastest show in politics. This is bounce Power alongside Michael Shepard here in washington, i'm tyler Kendall. Jill mathew is off and it's a fast moving day here with a lot of developments, including fed governor Lisa Cook saying that she will not be bullied into leaving her post after President Trump elevated allegations of mortgage fraud. We'll have the latest here this hour with Bloomberg's Michael McKee. He's at the Kansas City Fed's annual economic symposium, which kicks off today as we gear up for Fed Chair Jerome Powell. Highly anticipated speech tomorrow. We'll give you all the latest to expect there. And then later this hour, Bloomberg News reporting that doubts are emerging about the future of security guarantees for Ukraine. We'll have a conversation with Republican Congresswoman Nicole Malliotakis from New York. As Michael Sheppard. Just moments ago, actually, we heard from President Trump saying that we will know within the next two weeks whether or not peace is feasible in Ukraine. And we've heard that timeframe from President Donald Trump before. It is almost the trope where he is kicking the can down the road, in essence, and it's unclear what will come next if he will really hold Russian President Vladimir Putin accountable to whatever he may have agreed to during the summit on Friday last week in Anchorage, Alaska. It's unclear. We didn't get much in the way of details about what was promised on either side other than an effort to try to move ahead. There were, of course, the urgent meetings convened in Washington on Monday that we spent a lot of time discussing and covering. But through it all, there was a shadow of a doubt that is really materializing now about Russia's seriousness to follow through on their next steps in the process. And, of course, we're also, Tyler, watching what is happening in the markets as well. We're seeing another day of declines, a fifth straight day. And we're going to go to Bloomberg World headquarters in New York for the Voice of Bloomberg Radio and the New York subway, Charlie Pellet, for all the numbers there, I thank you very much. And here's what's going on. We have got the Dow, the S & P, Nasdaq all declining, as you point out. Five straight days of declines on the S & P down 31 right now. That is a drop of just about 5/10 of 1%. The Dow lower by 205, now down 5/10. NASDAQ, the composite index down 121. That's a drop of 6/10 of 1%. Nasdaq 100, index down 7/10. And our MAG seven index down now by 8/10 of 1%. A strong reading on manufacturing in the run up to Jay Powell speech spurring a slide in bonds. Right now we've got the ten year yielding 4.34% with the two year 3.80%. We'll have the latest from Jackson Hole and our Michael McKee coming up in just a moment. Right now, spot gold is down $9 an ounce, down 3/10 of 1%, 33, 39. And West Texas Intermediate Crude up 1.2%, 6344 for a barrel of WTI Bitcoin now down by $2,000, a token down 1.8%. Bitcoin 112,334 on Bitcoin again, the S & P 500 index down for a fifth day. Apple is raising the monthly subscription price of its TV plus streaming platform by 30% to $13, all part of a push to generate more revenue from services. Apple after the announcement is trading lower right now. We do have Apple shares trading lower by 6/10 of 1%. Recapping S & P down 5/10 of 1% for on demand news 24 hours a day. Subscribe to bloomberg news now, wherever you get your podcasts and back, we go to Washington. Once again, your hosts, Michael Shepard and Tyler Kandel. All right, Charlie Pellet in world headquarters for us from New York. Thank you. As always, this is the Thursday edition of Balance of Power on Bloomberg Television and Radio. That also marks the first day of the Kansas City Fed's annual economics symposium in Jackson Hole, Wyoming. And there is a lot hanging over this year's gathering, of course, questions about the path of monetary policy and the future of a September rate cut. But also what has been the mounting pressure from this White House on the central bank, as President Trump called yesterday, for Fed Governor Lisa Cook to resign over allegations of mortgage fraud. And we did get a statement from Fed Governor Cook yesterday where she said that she will not be bullied into stepping down, adding in part, quote, I am gathering the accurate information to answer any legitimate questions and provide the facts. And that's where we want to start by bringing in Bloomberg's Michael McKee senior international economics and policy correspondent who is already there. He's been there all week in Jackson Hole for us. Mike, we heard from a top DOJ official earlier today saying that he does plan to investigate these allegations. What do we know about the administration's response so far and what's the latest when it comes to this? Well, the latest is that Ed Martin, who is the Justice Department official that the president has put in charge essentially of finding dirt or getting revenge on Democrats. He's also charged Senator Adam Schiff and the New York attorney general, Letitia James, with mortgage fraud has said that he is going to investigate the allegations sent to the Justice Department by the FHA FAA director yesterday, Bill Pulte. Martin went beyond that, though, and put out a statement saying he wants Jerome Powell to get rid of Lisa Cook to take her off the Fed board right now because Americans are demanding it. Well, that may not be true, but the real issue is Jay Powell has no authority to remove Lisa Cook. The only one who can remove a Fed governor from office is the president. And they have to do that for cause. And there's a lot of questions about whether all of this amounts to cause. So I've been told that Lisa Cook isn't going to get into a tit for tat with Ed Martin or anybody else on this. She will gather information, work behind the scenes with her lawyers on what happens next. And the Fed is not expecting any changes in personnel anytime soon. Might this this boil down simply to the question of Donald Trump trying to get another board seat in his favor here? It seems that way. Elisa Cook votes with the chair, basically with the majority. And so if the Fed were to cut interest rates in September, you could expect her to vote that way. Removing her one way or another wouldn't make a big difference in terms of the September 17th meeting. But if the president could get a fourth seat on the board with someone that he had nominated, there is a feeling that maybe he would have more control over what the Fed is thinking and doing going forward. Although the two members he's already appointed, Chris Waller and Mickey Bowman, might not be willing to go along with any presidential directive to change interest rates or act in any particular manner. Well, to expand on this, Mike, I know that we talked about it last hour here on balance power, but we have this great story on the Bloomberg terminal today titled, quote, Trump aims to win a majority on Fed Board with Cook ouster attempt. Can you just give us a little bit more context here about the makeup of the Fed board? And even if President Trump were to get this majority, would that necessarily mean that he gets his way when it comes to rate cuts? Well, it doesn't mean that the Fed Board of governors, there are seven of them run the overall Federal Reserve system, but there are 12 regional Fed banks headed by bank presidents chosen by boards of directors for those banks. Now, if the president got four votes on the seven member board, that would give the board the power to fire those regional presidents. But that would probably cause a major uproar on Wall Street. And so that's not considered likely. What it may be is that the president is looking for a longer term sympathetic view towards lower interest rates. And if he got four of the seven, then that's a majority of the board. He'd have to convince a few of the bank presidents. Five of them voted every meeting. And if he could do that, then he would have an easier path to get rates down. But where this all goes is really hard to predict because, as I mentioned, Mickey Bowman and Chris Waller have been on the Fed for some years now. They are not considered revolutionaries, even though they dissented at the last meeting. And most of the people I have spoken with here say they wouldn't expect them to vote for rates to go down just because Donald Trump wanted it. It would have to be justified by economic conditions. Well, Mike, one of the people you happened to speak with today, of course, was the host of the event, and that is Kansas City Fed President Jeff Schmidt. He was outlining his view that there is a marginally higher risk of inflation when weighed against the labor market risks. How is that shaping his view of what the Fed should do next? And how does he fit into the ranks of the other folks who will be seated at the table next month in deciding the Fed's policy move? Well, basically, he's saying if conditions continue as they are now, he would not want to cut rates because the danger is higher inflation now. That was what we saw out of the minutes of the July 30th meeting when they were released yesterday that only Waller and Bowman were the ones who were saying we should cut rates now. The rest of them were more concerned about inflation than the labor market. That meeting was before the last labor market report, which showed the big dramatic reduction in hiring and the revisions to previous months. And so there is some concern about what's happening in the labor market, but the unemployment rate barely moved. So if that stays the same and inflation ticks up a little bit and it's going to be much harder for the Fed to decide to cut rates. And it looks like Schmidt would be in the majority in that case. Bloomberg's Mike McKee out in Jackson Hole, Thank you so much for all your reporting. We're going to turn now next to Lydia Boosler. She is the E.y. Parthenon senior economist. Thank you for joining us, Lydia. I want to keep with the Fed for the moment. Lydia, In about 21 hours from now, we're going to be hearing from Fed Chair Jerome Powell. What are you going to be listening for in his keynote address at Jackson Hole? This will be, in a way, a valedictory for him as Fed chair. Are there any messages you will be trying to divine from his comments? Yes. So there's a lot of anticipation ahead of the speech. I think, you know, Fed Chair Powell will want to keep the options open when it comes to the September meeting. So there's a lot of talk about that September rate cut. I don't think we're going to get a strong signal as to what the decision in September will be. But, you know, Fed Chair Powell will be highlighting some latest developments on the outlook. So he might acknowledge what we've seen in the labour market in terms of some. Meaning in labor market conditions. And importantly, he's going to be covering the conclusion of the the revision of the Fed's framework. So we're going to hear about that. I think it's interesting that it's, you know, happening against a very different backdrop than the last one in 2020. We have an economy that has gone through the pandemic. We've seen a new paradigm when it comes to inflation with now people concerned about persistently high inflation. So I think the Fed will want to take that into account in their review. And of course, a large part of this conversation does have to do with tariffs. And it's worth mentioning that we did get some tariff news earlier today. The White House and the European Union putting forth this joint statement, perhaps a step in the right direction towards getting pen to paper when it comes to finalizing that agreement for 15% tariffs on EU exports in place, though not yet in place for those sector specific tariffs, including autos. Lydia, are we actually getting the sort of clarity that we need around tariffs to have this more precise economic forecast, the sort of precision that policymakers need to have in order to make these types of decisions? No, I think we have a backdrop in terms of tariffs that remain highly uncertain. So I do believe that, you know, with these higher tariffs and the lingering uncertainty that we are seeing on the policy front. We continue to see a downward pressure on economic activity from all that uncertainty. If you look at tariffs today, the average tariff rate is about 18%. We were at 2% last year. So that's a significant step up. And we are starting to see the impact of these tariffs on the economy. So if you think about the outlook in the second half of the year, I do think that this slower economic momentum that we are seeing in the data in the labor market, but also if you look at the underlying trend in GDP growth, when you look at real final sales to domestic purchasers, we have a clear indication that the economy is slowing down. And in the second half of the year, I think that's a trend that will be sustained. So we do expect to see below trend growth in the second half heading into 2026. Lydia, you talked about a slowdown there, but we're also seeing some flashes of impact on prices perhaps from the tariffs. What is your read on that, on the inflationary impact of these import levies and how much more will we see going through the end of the year? Yes, the inflation picture is quite complicated at the moment. There are a lot of cross-currents. If you look at the latest CPI reports, I think that was a clear indication of all these crosscurrents. We have services prices which have been a key source of these inflation pressure. They showed some renewed momentum in July. At the same time, on the good side, we had a clear indication of pass through in June and then more moderate pass through in July. So there is a lot of noise and it's really a reflection of this sort of messy and uneven process when it comes to the tariff pass through. But companies are starting to see some pressure on their margins. Higher returns are leading to higher cost, and they are leading companies also to start pulling back on hiring as well. So the impact of tariffs is really starting to show up and I think it will continue to build in the second half of the year. Can we talk just a little bit more, drill down a little bit more here, including how it how it pertains to the consumer? I'll I'll add another headline that we got here today, which is Wal-Mart Missed profit expectations for the first time in three years. Lydia. Well, slower income growth limit the extent to which firms can pass on these costs of tariffs. What are we watching here when it comes to that dynamic? Yeah, we are definitely expecting real income growth to slow in the coming months, and that's really driven by both that softening in the labor market, which is the key pillar of consumer spending growth. So that's going to lead to slower labor income growth. And at the same time you have that renewed reacceleration inflation. We've seen core inflation, both 3% for the CPI. So that those higher prices, they're also going to be eating into consumers purchasing power. So if you think about real income growth, you're definitely going to see a slowing trend that's already visible. When you look at the data, consumers have been actually spending a boom there. Maybe if you look at the annual trend in consumer spending and real disposable income growth. So as you move ahead, you all think you're starting to see some erosion in those fundamentals that are driving the consumer. So, yes, for now, consumers are still resilient, I think. The retail sales data were encouraging, but there are clear signs that with a softer labor market, with that inflation pressure and also confidence remaining depressed, we're going to see that slower momentum in consumer spending being sustained in in the coming months. Lady, you talked about a slower labor market. How much more will this influence Fed policymakers? We did hear earlier today from the Kansas City Fed president saying that he was actually more worried about prices than the labor market risk at this moment. But what is your take, which in the balance weighs more at this point? Yes. So yesterday you saw the minutes from the Fed, which they did show that you have a majority of policymakers at the Fed. They're still seeing the inflation rate, the upside risk to inflation as being more significant than the labor market risk. Now, that was at the July policy meeting. And since then, what we've seen is that very soft July jobs report. We've seen those massive downward revision to the May and June data. And I do think that when policymakers are looking at labor market conditions today, they are a little bit more concerned about that slowdown that we're seeing. And it's not just the jobs report. If you look at a broad range of labor market indicators, they've been signaling already for a while that labor demand has slowed significantly. The hiring rate is very low and we are also seeing slower dynamics on the supply side of the labor market as well. So as you know, as we get to the September meeting, I do think that the shift will be, you know, the focus will be a little bit more on the labor market side of the Fed's dual mandate. And that's the reason why we do expect to see a repeat of the December meeting. Right. Lydia Gusau, senior economist at Eli Parthenon, we thank you so much for joining us here on Bloomberg. Stick with us where balance of power is coming up right after the break. I'm Tyler Kendall alongside Michael Sheppard. And this is Bloomberg. This is the Thursday edition of Balance of Power on Bloomberg TV and Radio. And we saw a big development today surrounding one of President Trump's legal woes that now sounds like it's turning in to a pretty big win. A New York appeals court striking down a massive $464 million fraud penalty against the president and his companies in a civil suit over his asset valuations. Now, the New York attorney general, Letitia James, has already responded, saying that she will seek an appeal. And that's where we want to bring in Bloomberg's Joan Grasso, the host of Bloomberg Law on Bloomberg Radio. John, thanks so much for being here. Can we just start out by getting some context into this case? Why was President Trump facing such a massive penalty in the first place? What led to this? Well, the New York attorney general sued him for fraud, saying that he overvalued his assets when trying to get loans. So if you remember, there was the Trump triplex that he said was three times its value and its size. So that was the and it's also against the Trump son. So it was a judge trial and came back and he said that they were guilty of fraud and then he imposed this massive penalty. It was an unusual kind of fraud because the so-called victims, the banks, etc., weren't really complaining. They didn't even have anyone testify that they had been hurt by this. And that was part of the argument that Trump's lawyers and Trump made over and over again. Jared, is the issue really in this penalty being set aside, just a question of its size, or is there more to it than that? This was a very confusing 300 page opinion and it took almost 11 months to come down with it. Normally, these opinions come down, you know, maximum of a couple of months, and that's because the judges were all over the place. Two of the judges said they would have ordered a new trial. Two of the judges said the fraud conviction was justified, but the penalty was too large. One of the judges would have dismissed the case entirely. So what does stand, though, is that they said that the fraud conviction was justified and just the penalty was excessive. They said it wasn't it wasn't a cataclysmic loss so that it violated the Eighth Amendment to the Constitution, which outlaws excessive fines. And, you know, that is the big the big takeaway from this, because they also said the majority of them said that Attorney General Letitia James acted within her authority and she was vindicating the state's interest. You know that Trump has claimed that, in fact, the Justice Department is investigating Letitia James saying that she violated President Trump's civil rights by bringing this action. So it's it's a very confusing kind of decision. But what stands is that enough of the judges thought that the the the verdict was excessive. I mean, it was 300 and about 355 or something, and then it ballooned to over 500 with the interest penalties. Bloomberg suing Grasso, Thank you so much for your insights on this. I'm sure we'll be talking about it again. We're going to bring back our political panel here on balance of power. That's more a Gillespie from Blue Stack Strategies. She's the founder there and a Republican strategist. And we're also joined by Julie Roginsky, who's co-founder of Lift Our Voices and a Democratic strategist. Thank you both for hanging in there. I want to turn the topic now to events happening in Georgia. Vice President J.D. Vance is there with a handful of Republican lawmakers to try to sell to voters the one big beautiful bill that is the tax package that was signed into law by President Donald Trump earlier this year, a pillar of his economic policy. But more I wanted to turn to you to ask about how it is sitting with voters, including Republicans, and why they need to do this sort of sales campaign on the road. They definitely need to be organized in their messaging because polling, early polling showed that the American people were not happy with the big, beautiful bill, largely because of the cuts to health care programs that have been largely popular. So this effort, I think, is twofold, sending J.D. Vance out there. He is pretty intelligent. And so he can speak to here the numbers that they're seeing. The part of it, too, there is that these impacts are not going to be felt directly just yet. So a lot of it is kind of semantics. It's Democrats versus Republicans, Democrats telling you that, you know, you're going to be hurting. Republicans are saying that 85%. Of earners are are the top bottom 8% of earners are going to be benefiting from the tax cuts. So it's a basically a messaging war right now. And Republicans feel like they need to get out ahead of it because they're currently losing that messaging war. I also think that saying it's out there is to keep them kind of out of the what was happening earlier this week with Zelensky coming to D.C. with the conversations regarding Ukraine, just because he has been pretty adamant about America not being involved. And so the switch that Trump has taken, the president has taken on that message. There's that divide. And so rather than show it so glaringly, they're separating the two to have him go tell around the country about the big A bill. While the president is trying to show his foreign policy chops here in the United States. So I there's to fold to the tactic of sending J.D. Vance out to Georgia and more. Another aspect here, my shear point is that a lot of the tax cuts we saw in this tax bill are front loaded, but still a lot of voters aren't going to feel those impacts until 2026 compared to the spending cuts that are coming a little bit further down the road. But still, Julie, as we see the administration try to explain these benefits, I'm wondering how Democrats are trying to organize around a message when they're going up against big officials like the vice president now on the road. Well, you only need to see what's happening at the few Republican town halls that are being held during August recess. People are furious and they're not people living in New York City or San Francisco. There are people living in places like Nebraska and Iowa. They're just appalled at the fact that Republicans have now taken positions that will eventually throw grandma out of the nursing home, that will eventually cut food from food insecure people. And these are not necessarily people who are strangers to the Americans who vote for Republicans. I mean, you know, nursing homes don't care what your party affiliation is when they say to you, sorry, we can't afford to keep you here, sorry, you don't have Medicaid access, so we can't do anything to help you with home care. All of this is something that affects Americans on a daily basis. It's not if it's not you, it's your mom. If it's not your mom, it's your grandma. If it's not your grandma, it's your autistic child who needs help. And the help comes largely through these programs that have been cut. And so we're dealing with programs that touch everybody. I mean, everybody is affected by this for the most part. Unless you are incredibly wealthy, you can afford to pay for your nursing home or for your child out of pocket. And that's something that I think is a huge mistake for the Republicans. They have backloaded this to take effect after the 26 election, but not after the 28 election. And just wait until that happens in about a year and a half. It's going to be a disaster. Americans understand that now. Maybe they're not feeling it quite yet, but if you're listening to me, America, prepare yourselves, because it is going to happen in the next year and a half to two years. And better to be for, you know, forewarned. So you can be arms about what's coming down the pike. Julie, I wanted to keep with you on this next question, and you're describing a picture of really an angry Democratic base and perhaps a motivated one. And yet we do see findings in The New York Times published yesterday that voter registration for the party is down in as many as 30 states across the country, including some Democratic strongholds like Massachusetts and even California. How do you explain that? And what can the party do to turn that trend around in time for 2026? The party's got to learn how to fight. And, you know, we are way past the sternly worded letter part of this cycle. We're way past giving floor speeches and even, you know, for speeches that are excessive, like 25 hour floor speeches, people are looking for a fight. That's why somebody like Gavin Newsom has really captured the imagination of the Democratic base right now, and not just the Democratic base, but Democrats across, you know, people who are not even affiliated with the Democrats. Look, nobody is thrilled with Donald Trump's performance except for his MAGA base, which is about 35% of the electorate. Everybody else is souring on Trump on every single issue, whether it's the economy, whether it's immigration, whether it's crime, and every issue. He's now way down, if not underwater. And Democrats have an opportunity, but they have to seize it. And I think the problem is that our leaders in Washington are, you know, still playing by these Roberts from his orders as though it's the 1990s, as somebody who worked on the Hill in the nineties and the early twenties, I can tell you it was a magical time. That time is now gone. It is does not exist anymore. And yet we have saw the same leaders leading the Senate who were there then and believe that this is how things should be now. We are never getting that United States back. And I think Democrats need to understand, like Gavin Newsom understands, like Kathy Hochul in New York is starting to understand with redistricting, that whatever comes next is going to be very different from what's come before. Can't do what Joe Biden did, which is talk about the former guys. Though he was a flash in the pan. He wasn't coming back. He's here. Trumpism is here. If Trump is gone tomorrow, it will still be here. And we need to address it and we need to start leading like we're fighters and not like we're sitting on our heels waiting for him to implode on his own. I think that's why you're seeing disgust in the Democratic Party, including from people like me, who's dedicated her entire life to the Democratic Party and to getting Democrats elected for that reason. All right, Maura, in just her final 30 seconds here, another headline from that New York Times analysis finds that battleground states are swaying to the right. If what Julie is saying is correct, how do Republicans then maintain momentum against the sort of organizing that she's foreseeing from the Democratic Party? I think that when you look at the Donald Trump dynamic, he can't currently run again. So Republicans will need to shift their messaging because just as we're really pointing out, yes, MAGA has a stronghold with Donald Trump. However, there are people who have weighed on him, but that doesn't mean they're going to become Democratic voters. So you have to appeal to them as well. And so for Republican leadership and for those who are running for office and the Republican ballots, they need to be thinking, how do I message and how do I can, you know, convince people who are looking to vote for Republicans who are more pragmatic, speak to them about what they're doing for their communities. Talk more locally and trying to avoid some of the fray that Donald Trump tends to swarm the conversation. And that'll be their best ticket to winning and to fending off a Democratic push. All right, our political panel today, more Gillespie and Julie Rose PINSKY, we thank you so much for being us, being with us for both hours of balance of power here. We're going to have more coming up after the break, including the redistricting fight playing out in Texas. Stick with us. This is Bloomberg. And there's a story that we've been following closely here in Washington, though it's happening pretty far from here. And that's the redistricting story that's taking place and shape in Texas that has some pretty big implications for the 2026 midterms after the Texas House of Representatives approved a new state congressional map that is backed by President Donald Trump that caps a weeks long political standoff and boosts Republicans chance of keeping hold of the House come the midterms. President Trump posted on social about it, saying, quote, Big win for the great state of Texas. For more now, we're joined by Texas bureau chief julie Fine. Julie, thanks for sticking with us. It's always good to see you. Can you just bring us up to speed here because President Trump is posting about this being a big win, but is it a done deal yet? It is not a done deal yet. This has passed in the Texas House. The Senate is just pushing it out of committee. It will now be voted on later today by the full Senate. The full Senate, though, will have no problem getting it through. It was the House that had the real obstacle. So the House passed its bill. The Senate will pass its bill. They may have to rectify a few differences, but then it will go to Governor Abbott. Governor Abbott has made it very clear he put this on the agenda. Call that he is going to sign this bill. So it's pretty close to done, but not a done deal yet. Julie, This has been a pretty bitter and public spectacle. What sorts of scar tissue has it left among the legislators there in Austin? And is this going to make it hard to get business done in the state capital going forward? I mean, it's not going to make it that hard because the Republicans hold the majority in the Senate and in the House. But one thing about the Texas House is most bills are actually passed. 90% of the bills are bipartisan here, 90% or above in most legislative sessions. It is a close group, although there is definitely been this bitter battle. You could definitely see yesterday with the closing arguments, some very pointed remarks. However, I saw a walkout in 2021 as well. They came back in 2023 and worked together. Obviously, it's very tense right now. How long that lasts, I think really depends on the next few weeks. Bloomberg's Julie Fine from Dallas. Thank you so much for your insight. And we'll keep coming back to you for more on the Texas redistricting fight over the coming days. Now we'd like to turn to Representative Nicole Malliotakis, who is a Republican representing the 11th District of New York. And, Congresswoman, we'd like to stick with this topic of redistricting and ask whether this fight might be coming home to you. Do you see this battle actually moving to New York? And are you and your district perhaps vulnerable to moves by Democrats to redraw the map in the Empire State? I think this certainly does open up the floodgates all around the country. Now, as each state looks to make gains that will benefit their own political party. I've been very clear that whether it's Republicans or Democrats attempting to politically gerrymander that it's wrong. I believe it's corrupt and it silences and takes away the voice of the people who are supposed to be the ones who decide our elections. I think it's really important that we have the most competitive seats possible. That is how you hold your representative accountable, and that is how you ensure that they actually come out and speak to you, the voters, about what they're doing, what they're not doing, how they vote and why. And so I don't support what Texas is doing. And certainly, obviously, there's concern that they may try to do this again in New York now in 2022. Kathy Hochul and the Democrats didn't gerrymander even after there was a ballot referendum in which New Yorkers made very clear they did not want political gerrymandering. We sued after they egregiously redrew my district and we were able to get the entire map of the state of New York thrown out. And it was then a court appointed independent master that drew the lines. And what happened when we actually had fair maps in New York, Republicans made significant gains and the Democrats lost two of their incumbents. So I think that that was a lesson to Kathy Hochul and the Democrats. They tried to do the same thing again in 2024 when they did a switcheroo on the Court of Appeals and tried to remove the chief judge and sided with us and then backfill it, that position with somebody who did not side with us. And basically that was very corrupt. What Kathy Hochul did, they did win an opportunity to redraw. But because of the public outrage and the scrutiny nationally, they did not change the maps much in 2024. So here we are again, potential redistricting battle. But they would need to be a constitutional amendment, which would mean that they would have to pass this legislative session, next legislative session, and then go to the voters in a referendum. So the earliest they could potentially redraw these maps would be for 2028. But nonetheless, I think we will fight back and we will defeat them once again. Right. And it's interesting, Congresswoman, because we often said here that the path to taking the House in 2024 did run through New York, because we know that there were a lot of of those Republican seats that ultimately helped the GOP get the majority. But just to put a finer point on this conversation about redistricting, are you confident that if this were to happen again, that same legal pathway would be there for you to protect against the efforts that could be targeting your own district? Well, again, it would have to go to a public referendum, and I think we would actually win that once again. We did win it the first time around when they tried to do this. And then what they did was they just ignored the will of the people and jammed it through anyway, which is why we were able to sue successfully in court. What I would say to my fellow Republicans is that we have the opportunity here to win on merit, and that's the way elections should be. We've just delivered very significant tax relief for working Americans, for middle class families, for senior citizens. 88% of seniors across the country are going to see their tax liability on Social Security erased when they do their refunds next year. The economy is doing well. We're seeing trillions of dollars in private investment. We're seeing a lot of good things that have happened, whether it's prices coming down, energy costs coming down, mortgage rates coming down. And I think that we need to make sure that we're going out and talking about these successes because we're going to win America. We don't need to stoop to what the Democrats tried to do in New York, which is they couldn't win on merit in debate, which is why they redrew our maps or attempted to do so. So I again, I think this opens up a slippery slope. I don't want to see it happening. And an aside from that, it shouldn't be happening only once a decade after the census, which means the next redrawing of maps should be in 2032. Congresswoman, when we talk about the question of winning on merits and on debate and on the issues, we today we see and in fact this our vice president, J.D. Vance, joining some of your House Republican colleagues in Georgia to try to pitch the benefits of President Donald Trump's tax legislation, which you have. Course, had a role in in getting through the chamber. Why do you think there is the need to make the sales pitch to the American people? Have you detected any concern among your constituents? And is there an issue with the messaging itself from the party about what may be beneficial in the legislation? I think there's a lot of misinformation and there's a lot of confusion. The Democrats have said one thing and the Republicans are saying another. And so I think it's important for Republicans to be on the offensive because we are proud of this piece of legislation. It is the largest tax cut in history. It is making sure that the child tax credit not only gets extended, but gets increased. We're helping workers from tipped restaurant workers to Uber drivers to middle class families like the ones I represent. State and so state and local tax relief significant for New York. They're getting hammered by the Democrats, whether it's property taxes or income taxes. This is going to give them relief, I think, in some cases. And my district will see thousands of dollars in savings for families and the salt deduct the senior deduction. 51 million seniors across America are going to get relief and keep their Social Security paycheck without the government taking tax dollars from it. So what I would say is that this thing's going to sell on its own. I'm have confidence that when people do their taxes in 2026, they will see the significant relief for the 2025 tax year and you'll see the economy again continuing to grow. We're seeing GDP growth. We're seeing trillions of investment in private companies, domestic and foreign expanding operations, expanding manufacturing facilities here. It seems every week, if not every couple of days, that President Trump is announcing a new company that is expanding their operations, particularly in the automotive sector, pharmaceutical tech sector. This is really all all good stuff for our economy. And I think come a year from now when we're in the midterm elections, people will see the benefits and they'll see that the fear mongering that many of the Democrats were committing were simply fear mongering. Right. They'll see that the Medicaid cuts that they said we're going to take place did not happen, that seniors, disabled children with disabilities, all children, pregnant women, people below the federal poverty line will not have any of their benefits touched. They'll they'll see the the in they are seeing it regularly how those who are the fraudsters are getting prosecuted and I think overall will be will be shown to be the truthful ones in this debate. Well, and Congresswoman, Democrats are saying that they want to have some more say here, even though Republicans do hold both chambers of Congress. And I want to stick on this idea of of the work of Congress, because we should say for our radio listeners, you're joining us from world headquarters in New York. But when you get back here to Washington, there are going to be 14 working days before the continuing resolution expires. Are we going to just keep seeing continuing resolutions through the rest of the year or are we at risk of a shutdown if Democrats say that they're not able to come to the table in a meaningful way? Look, I've been in Congress for five years, and I've been through this a number of times where we avoided a government shutdown, we avoided a debt default. And I think we're going to do that again. But we do need to see some bipartisan cooperation. I'm proud to be a member of the House Problem Solvers Committee Caucus, rather, that is made up of half Republicans, half Democrats, where we come together to work through these types of more difficult things. It will make What makes the appropriations process different than reconciliation is that it needs to be bipartisan because we need to have the 60 votes in the Senate. And so there's going to have to be Democrats and Republicans coming together to avoid a government shutdown. Now, whether that means we're going to have to do a continuing resolution, I imagine it will probably be a short term continuing resolution. I don't want to see that. I would like to see the Republicans put forward a budget that reflects the priorities of the administration and the Republican controlled Congress. That is what the American people voted for. But when we don't have the votes to do so because you need the 60 votes in the Senate, it makes it more difficult. We'll probably see some changes, some additions to the it wouldn't be just a plain continuing resolution. There would be have to be a little more to get Republicans on board and deliver for our constituents. So I think that we'll see how things play out. But I am confident that we will avert a government shutdown, just like we've always have since I've been there. I've been there. In. Congresswoman, are you confident in the 30 seconds we have left that all Republicans will fall in line on a continuing resolution when it comes down to it? I have confidence that they will not all fall in line, that I'm pretty sure of it. And that happens with every continuing resolution. There's always a group of the Republicans that do not want to support a continuing resolution or they've never voted for a continuing resolution and don't intend to do so now, which is all the more reason why this needs to be a bi partisan process. And I think that, you know, I've supported the continuing resolutions. I think there may have been just one that I voted against for border because the border was not secure. And I think that you're going to see a large majority of the Republicans support it and a small minority of the Democrats who support it. That's probably how it would play out in my prediction. All right. Republican Congresswoman Nicole Malliotakis of New York, she represents New York's 11th Congressional district. Thank you so much for joining Bloomberg. And thank you for joining this early edition of Balance of Power. Mike and I will be back at 5 p.m. Eastern for the Late Edition. Bloomberg Businessweek Daily is up next. Stick with us. This is one.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9892578125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.9892578125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.88818359375
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.62744140625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.5224609375
    }
  ],
  "sentiment": {
    "positive": 0.09928168,
    "negative": 0.5553735,
    "neutral": 0.34534475
  },
  "summary": "The Justice Department has confirmed plans to investigate a top Fed official, Lisa Cook, as part of a White House campaign to pressure the central bank. This comes as concerns grow about the future of security guarantees for Ukraine. The Fed Chair Jerome Powell is set to deliver a highly anticipated speech at the Kansas City Fed's annual economic symposium. Meanwhile, President Trump said that within two weeks, he will know if peace is feasible in Ukraine, and it's unclear if he will hold Russian President Vladimir Putin accountable for his actions. The markets continue to decline, with the S & P 500 index down for a fifth day. The ten-year yield is 4.34% with the two-year 3.80%.",
  "shortSummary": "The Justice Department plans to investigate Fed official Lisa Cook over mortgage fraud allegations, amid ongoing political pressure and market declines.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "2f8e8e206c6c42fa871ad1319f5ec8e5",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The transcript covers a wide range of political and economic topics. It begins with a discussion of the Federal Reserve’s policy stance, highlighting Fed Chair Jerome Powell’s remarks on inflation, monetary policy, and the Fed’s commitment to maintaining a stable economy. Powell emphasizes the importance of keeping inflation low and the Fed’s willingness to adjust policy as needed. The conversation then shifts to the political arena, featuring a panel of Republican and Democratic experts debating the impact of President Trump’s tax legislation, the state of redistricting in Texas, and the potential for a government shutdown. The panel discusses the need for bipartisan cooperation to avoid a shutdown, the importance of fair redistricting, and the political messaging around tax cuts and social programs. The transcript also touches on the ongoing debate over continuing resolutions and the likelihood of a government shutdown, with Representative Nicole Malliotakis expressing confidence in averting a shutdown through bipartisan efforts. Overall, the discussion highlights the intersection of monetary policy, fiscal policy, and political strategy as the 2026 midterms approach. ",
  "argos_id": "CGXMH7H66"
}