{
  "url": "https://www.mlive.com/news/saginaw-bay-city/2025/08/saginaw-seeks-input-on-aging-water-treatment-plants-future.html",
  "authorsByline": "jhaywood, Mlive.com staff |, Mlive.com staff",
  "articleId": "b8d370991bb8435d96f8363b07f2a7f9",
  "source": {
    "domain": "mlive.com",
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Kent County",
      "city": "Grand Rapids",
      "coordinates": {
        "lat": 42.9632405,
        "lon": -85.6678639
      }
    }
  },
  "imageUrl": "https://www.mlive.com/resizer/v2/DQWNBULFNJERTOVPQPAHRHAXYQ.jpg?auth=3e0421c5de882634612e7f4675b3d3cdd3b60e85da5633680cf85e9d65de4564&width=1280&quality=90",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T16:24:40.268000+00:00",
  "addDate": "2025-08-21T16:41:48.279397+00:00",
  "refreshDate": "2025-08-21T16:41:48.279399+00:00",
  "score": 1.0,
  "title": "Saginaw seeks input on aging water treatment plant’s future",
  "description": "An informational session will be held Friday, Aug. 22, at 10:30 a.m.",
  "content": "Jeff Schrier | Mlive.com The Water Treatment Plant on Ezra Rust in Saginaw. The Saginaw News/MLive.com The Saginaw News/MLive.com\n\nSAGINAW, MI — Saginaw officials are inviting residents to weigh in on the future of the city’s century-old water treatment plant at an upcoming public meeting.\n\nThe informational session will be held Friday, Aug. 22, at 10:30 a.m. at the Andersen Enrichment Center, located at 120 Ezra Rust Drive, organizers said.\n\nRepresentatives from the city’s Water Treatment Services Division and Fishbeck Engineering will discuss options for the facility at 552 Ezra Rust Drive.\n\nThe city has partnered with Fishbeck Engineering on a comprehensive study to determine the plant’s long-term future. According to city officials, much of the equipment and piping in the nearly 100-year-old facility has reached the end of its useful life.\n\nThe study will recommend either replacing equipment and conducting large-scale rehabilitation of the current facility or constructing a new plant elsewhere. If officials opt for a new facility, the historic structure could be repurposed to benefit the community.\n\nMichael Grenier, director of the city’s Water and Wastewater Treatment Services, emphasized the importance of public participation in the decision-making process:\n\n“Our Water Treatment Division provides quality drinking water to thousands of City of Saginaw residents, and to 20 communities throughout Saginaw County and portions of Bay and Tuscola counties,” Grenier said in a statement. “However, with the age of our infrastructure, investment in our facility is essential to continue these services.”\n\nAdditional public meetings are planned for this fall to provide updates on the study and gather more community feedback. All meetings will be recorded and available on the city’s website, where residents can also submit comments online.\n\n“We want our citizens to be informed and involved as we develop the future plans for our Water Treatment Division and our historic facility,” Grenier said.\n\nGenerative AI was used to organize information for this story, based on data provided by the City of Saginaw Public Information Office. It was reviewed and edited by MLive staff.",
  "medium": "Article",
  "links": [
    "https://www.mlive.com/news/saginaw-bay-city/2025/08/need-your-drivers-license-back-clinic-offers-help-in-mid-michigan.html",
    "https://www.mlive.com/news/saginaw-bay-city/2025/08/tickets-for-netflix-stars-magic-show-in-saginaw-go-on-sale-this-week.html",
    "https://www.mlive.com/news/saginaw-bay-city/2025/08/chick-fil-a-restaurant-coming-to-former-kmart-site-in-bay-county.html",
    "https://www.mlive.com/news/saginaw-bay-city/2025/08/string-musicians-wanted-saginaw-bay-symphony-orchestra-holding-auditions.html",
    "https://www.mlive.com/news/saginaw-bay-city/2025/08/mid-michigan-weekend-events-county-fairs-cider-shops-movie-marathons-and-nostalgia.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Water Treatment Division",
      "weight": 0.101368695
    },
    {
      "name": "Water Treatment Services Division",
      "weight": 0.10132493
    },
    {
      "name": "Saginaw officials",
      "weight": 0.089134224
    },
    {
      "name": "city officials",
      "weight": 0.085977465
    },
    {
      "name": "Saginaw County",
      "weight": 0.08306474
    },
    {
      "name": "Saginaw",
      "weight": 0.07929874
    },
    {
      "name": "Ezra Rust",
      "weight": 0.07445961
    },
    {
      "name": "quality drinking water",
      "weight": 0.06884265
    },
    {
      "name": "Additional public meetings",
      "weight": 0.06830535
    },
    {
      "name": "Fishbeck Engineering",
      "weight": 0.064610355
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.98095703125
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Other",
      "score": 0.8525390625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.78515625
    },
    {
      "name": "/Business & Industrial/Construction & Maintenance/Other",
      "score": 0.64990234375
    }
  ],
  "sentiment": {
    "positive": 0.3893706,
    "negative": 0.07398683,
    "neutral": 0.5366426
  },
  "summary": "Saginaw officials are seeking public input on the future of the city's century-old water treatment plant. The public meeting will be held on August 22 at the Andersen Enrichment Center. The city has partnered with Fishbeck Engineering to investigate the plant's future, as much of its equipment and piping is reaching its end. The study recommends replacing equipment and undergoing large-scale rehabilitation or constructing a new plant elsewhere. If chosen, the historic structure could be used to benefit the community. Additional public meetings are scheduled for the fall.",
  "shortSummary": "Saginaw officials are seeking public input on the future of its century-old water treatment plant, proposing replacing equipment with a new facility.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "65e5cffdd1674b9b906dba43ba276bfd",
  "places": [
    {
      "osmId": "17956237",
      "road": "Ezra Rust Drive",
      "city": "Saginaw",
      "county": "Saginaw County",
      "state": "Michigan",
      "postcode": "48602",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 43.414195,
        "lon": -83.958218
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.mlive.com/news/saginaw-bay-city/2025/08/mid-michigan-weekend-events-county-fairs-cider-shops-movie-marathons-and-nostalgia.html",
      "text": "GENESEE TWP, MI — As August nears its end, summer is quickly transitioning to fall, providing a medley of activities suited for fans of either season.\nAmong them: a county fair, cider-and-donut sales, and mid-Michigan-themed movie screenings.\nHere are things to do with friends and family this weekend.\nVisit the Genesee County Fair\nThe county fair, which launched earlier this week, continues to offer a lineup of activities until Sunday, Aug. 24, at the Everett A. Cummings Center, located at 6130 E. Mt. Morris Road in Genesee Township.\nThose activities include a pig race, a pizza-eating contest, wrestling matches, human cannonball demonstrations, chainsaw artistry, and several music acts.\nClick here for a complete lineup of events remaining on the schedule.\nGrab a taste of fall\nSeasonal apple-and-cider shops across the state are opening for business.\nAmong that group is Bayne’s Apple Valley Farm, 5395 Midland Road in Saginaw County’s Tittabawassee Township.\nWhat distinguishes Bayne’s Apple Valley from the crowd this year is a brand-new parking lot, offering more spaces for the high volume of customers that frequent the establishment.\nPreviously, an overflow of traffic led some customers to park on adjoining grass and dirt lots on the property.\nFor information about Bayne’s Apple Valley offerings and hours of operation, visit the company’s Facebook page by clicking here.\nEnjoy a Paul Walter Hauser-thon\nSaginaw Township native Paul Walter Hauser’s status as a go-to Hollywood actor grew substantially this summer.\nIn fact, at some theaters, there are showtimes for three new-release films featuring Hauser in prominent supporting roles.\nOn Saturday, Aug. 23, at Bay City Cinemas, for example, a moviegoer can watch Hauser play sidekick to Liam Neeson in the comedy remake of “The Naked Gun” at 5:20 p.m.; then see Hauser play the villain-ish Mole Man in “The Fantastic Four: First Steps” at 6:50 p.m.; and conclude the marathon by viewing Hauser work alongside Sydney Sweeney in the action-thriller “Americana” at 9:35 p.m.\nAll three films also are screening at other theaters across mid-Michigan, including NCG Midland Cinema in Midland and NCG Trillium Cinema in Genesee County’s Grand Blanc.\nGo back in time\nIt’s not too late to enjoy free outdoor concerts this summer.\nAt Jolt Credit Union Park at The Dow Event Center in downtown Saginaw, the “Back to the ‘90s Retro Party” will feature The Rick Lieder Band performing throwback songs from that long-ago decade.\nOrganizers are encouraging attendees to dress in attire fit for the 1990s.\nFor more information about the event, click here.\nGo further back in time\nToo soon for ’90s nostalgia?\nIf that’s the case, mid-Michigan residents might consider venturing to the 46th annual Michigan Renaissance Festival at HollyGrove, a fictional village in Oakland County’s Groveland Township.\nThe seven-weekend event takes place from 9 a.m. to 7 p.m. each Saturday and Sunday through Sept. 28 as well as on Labor Day, Sept. 1, and “Festival Friday,” Sept. 26.\nFestivalgoers will be transported back to the 16th century and have the chance to meet the festival’s royal cast: 45 colorful characters inspired by the Renaissance era, including performers like Rick “Ric Roc” Carver of Vestaburg, who towers over visitors atop his stilts.\nThe Michigan Renaissance Festival draws approximately 260,000 visitors each year with an average of 18,000 visitors daily, organizers say."
    },
    {
      "url": "https://www.mlive.com/news/saginaw-bay-city/2025/08/need-your-drivers-license-back-clinic-offers-help-in-mid-michigan.html",
      "text": "MOUNT PLEASANT, MI — The Michigan Secretary of State will partner with state and community organizations to help eligible drivers regain their driving privileges through a “Road to Restoration” clinic in Mount Pleasant on Wednesday, Aug. 27.\nThe event, scheduled from 10 a.m. to 4 p.m. at Mid Michigan College, will offer one-on-one consultations with Michigan Department of State experts and volunteer attorneys, organizers said. These professionals will help attendees review their license status and provide guidance on returning to legal driving.\nOn-site services will include vision testing and written driver’s examinations. Participants seeking license restoration must bring several required documents, including identification, birth certificate, and proof of residency. They should also come prepared with either a $16 payment for their driving record or bring a pre-printed copy from the day before, organizers said.\nThe clinic will take place in the First Floor Community Rooms of the Center for Liberal Arts and Business facility, located at 2600 S. Summerton. While pre-registration is encouraged through Michigan.gov/R2R, walk-ins will be accepted between 11 a.m. and 3 p.m. as space allows.\nPartner organizations include the state Attorney General office, Michigan WORKS!, Michigan Association of United Ways, Detroit Justice Center, DTE Energy, Miller Canfield, Michigan 2-1-1, and Mid Michigan College.\nWhile participating courts will be available to process payments, the clinic does not offer DUI/OWI expungement services, and license reinstatement cannot be guaranteed, organizers said.\nGenerative AI was used to organize and structure this story, based on data provided by the Michigan Secretary of State. It was reviewed and edited by MLive staff.\nSaginaw County stories\n- Saginaw seeks input on aging water treatment plant’s future\n- Tickets for Netflix star’s magic show in Saginaw go on sale this week\n- Chick-fil-A restaurant coming to former Kmart site in Bay County\n- String musicians wanted: Saginaw Bay Symphony Orchestra holding auditions\n- Mid-Michigan weekend events: County fairs, cider shops, movie marathons and nostalgia"
    },
    {
      "url": "https://www.mlive.com/news/saginaw-bay-city/2025/08/string-musicians-wanted-saginaw-bay-symphony-orchestra-holding-auditions.html",
      "text": "SAGINAW, MI — The Saginaw Bay Symphony Orchestra will host open auditions for multiple string section positions for its 2025-26 season, offering opportunities for musicians to join one of mid-Michigan’s longstanding cultural institutions.\nUnder the direction of Music Director and Conductor Fouad Fakhouri, the orchestra is seeking musicians for section positions in violin, viola, cello, and bass, organizers said.\nThe auditions will take place on Friday, Sept. 26, at the Temple Theatre in downtown Saginaw.\nThe Saginaw Bay Symphony Orchestra, which began in 1935 as the Saginaw Civic Symphony Association, has evolved into a fully professional ensemble that performs classical mainstage concerts, pops programs, and educational performances throughout the season.\nSelected musicians will receive competitive per-service compensation and a geography-based travel allowance, organizers said.\nInterested candidates must submit a one-page resume to Personnel Manager Gregg Powell via email at greggpowellmusic@gmail.com.\nUpon review, qualified applicants will receive detailed audition requirements and repertoire information, organizers said. The audition committee maintains discretionary authority over candidate selection, with the possibility of consideration for the orchestra’s supplemental musician list.\nThe orchestra, which became a charter member of the American Symphony Orchestra League in 1953, continues to serve as a cornerstone of cultural life in mid-Michigan. Beyond its classical performances, the orchestra offers chamber music, educational programs, theatrical collaborations, and screened movie concerts.\nGenerative AI was used to organize and structure this story, based on data provided by the Saginaw Bay Symphony Orchestra. It was reviewed and edited by MLive staff.\nSaginaw County stories\n- Saginaw seeks input on aging water treatment plant’s future\n- Tickets for Netflix star’s magic show in Saginaw go on sale this week\n- Chick-fil-A restaurant coming to former Kmart site in Bay County\n- Need your driver’s license back? Clinic offers help in mid-Michigan\n- Mid-Michigan weekend events: County fairs, cider shops, movie marathons and nostalgia"
    },
    {
      "url": "https://www.mlive.com/news/saginaw-bay-city/2025/08/tickets-for-netflix-stars-magic-show-in-saginaw-go-on-sale-this-week.html",
      "text": "SAGINAW, MI — Fresh off his Netflix comedy special “Magic Lover,” magician Justin Willman is bringing his new tour to the Temple Theatre in downtown Saginaw this fall.\nThe performance, scheduled for Friday, Nov. 21, is part of Willman’s “One for the Ages” tour spanning more than 30 cities.\nWillman, who gained prominence as the creator and star of Netflix’s “Magic for Humans” and “Magic Prank Show,” has amassed over 1 billion views with his unique blend of magic and humor, organizers said.\nHis television appearances include “The Today Show,” “The Kelly Clarkson Show,” and “Conan.” The Magic Castle recently named him “Stage Magician of the Year,” and his performances have reached audiences from local theaters to the White House.\n“One for the Ages,” described as Willman’s largest tour to date, promises new material in an interactive format. The family-friendly show combines comedy with sleight-of-hand magic, designed to appeal to audiences of all ages, organizers said.\nTickets for the Saginaw performance go on sale Friday, Aug. 22, at 10 a.m. For more information, go to templetheatre.com/event/justinwillman2025.\nGenerative AI was used to organize and structure this story, based on data provided by Temple Theatre organizers. It was reviewed and edited by MLive staff.\nSaginaw County stories\n- Saginaw seeks input on aging water treatment plant’s future\n- Chick-fil-A restaurant coming to former Kmart site in Bay County\n- String musicians wanted: Saginaw Bay Symphony Orchestra holding auditions\n- Need your driver’s license back? Clinic offers help in mid-Michigan\n- Mid-Michigan weekend events: County fairs, cider shops, movie marathons and nostalgia"
    },
    {
      "url": "https://www.mlive.com/news/saginaw-bay-city/2025/08/chick-fil-a-restaurant-coming-to-former-kmart-site-in-bay-county.html",
      "text": "BANGOR TWP, MI – The rumors are true: Chick-fil-A is coming to Bay County.\nSignage for the popular restaurant chain has popped up along construction fencing at the intersection of Euclid Avenue and Wilder Road in Bangor Township, the site of where the old Kmart building was recently demolished.\nBangor Township Supervisor Glenn Rowley on Thursday, Aug. 21, confirmed the addition of the “home of the original chicken sandwich” after the company previously acknowledged it was \"actively pursuing a new location\" in the area.\nThe hope, a company spokesperson said previously, is that construction will begin on the restaurant in April 2026. A spokesperson said Thursday that the timeline has not changed.\nEach Chick-fil-A restaurant creates 80-120 jobs, a spokesperson previously told MLive.\nBefore construction of the restaurant could begin, contractors were tasked with demolishing the vacant building at 4001 N. Euclid Ave. that once housed Kmart.\nDemolition on the structure, built in 1965, according to property records, began earlier this month.\nThe popular restaurant would be the first of its kind in Bay County. One opened this year in Saginaw Township and has been overwhelmingly popular, with traffic often backed up onto Tittabawassee Road.\nSimilar traffic concerns were addressed by Bangor Township Planning Commission officials, who suggested adding a deceleration lane on Wilder Road to ease traffic for those interested in visiting the restaurant.\nEntryway reconstruction was noted as needing to occur before the restaurant could be feasible because “the existing commercial entrance is obsolete and substandard per current (Bay County Road Commission) commercial entrance requirements,” according to meeting minutes."
    }
  ],
  "argos_summary": "Saginaw officials are holding a public meeting on Aug. 22 to gather input on the future of the city’s nearly 100‑year‑old water treatment plant, with a study underway to decide whether to rehabilitate or replace the facility. The city’s Water and Wastewater Treatment Services Division and Fishbeck Engineering will present options, and residents can submit comments online or attend additional meetings later in the fall. Meanwhile, mid‑Michigan residents have a range of fall activities, from the Genesee County Fair and apple‑cider shops to a Paul Walter Hauser film marathon, a “Back to the ’90s” concert, and the Michigan Renaissance Festival. Other local news includes a Road to Restoration driver‑license clinic in Mount Pleasant, Saginaw Bay Symphony Orchestra auditions, a Justin Willman magic tour stop, and the announcement of a new Chick‑fil‑A location in Bay County.",
  "argos_id": "DCGDQIK44"
}