{
  "url": "https://www.bloomberg.com/news/videos/2025-08-21/bloomberg-markets-8-21-2025-video",
  "authorsByline": "bn",
  "articleId": "623b7cfba79247d98c1cbdabc4228903",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ipDnQSLMCL8o/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T18:34:25.671000+00:00",
  "addDate": "2025-08-21T18:58:41.582374+00:00",
  "refreshDate": "2025-08-21T18:58:41.582379+00:00",
  "score": 1.0,
  "title": "DOJ Urges Fed's Powell to Remove Lisa Cook",
  "description": "\"Bloomberg Markets\" follows the market moves across every global asset class and discusses the biggest issues for Wall Street. Today's guests: Crossmark Global Investments Chief Market Strategist Victoria Fernandez, State of Michigan Chief Growth Officer Hilary Doe and KeyBanc Capital Markets Equity Research Analyst Bradley Thomas. (Source: Bloomberg)",
  "content": "THIS IS BLOOMBERG MARKETS I'M SCARLET FU. THE TRUMP ADMINISTRATION PUSHES FOR AN OVERHAUL OF THE FEDERAL RESERVE BOARD AS POLICYMAKERS GATHER IN JACKSON HOLE, WYOMING. S & P 500 DOWN .4%, THE FIFTH STRAIGHT DECLINE. WE ARE SEEING THE VIX, BUT LITTLE BIT, STILL IN THE I-16 RANGE, FAIRLY LOW GIVEN THE YEAR TO DATE AVERAGE OF JUST UNDER 20. WE ARE SEEING THIS AT A TWO-WEEK HIGH. IN TERMS OF THE TREASURY MARKET, THE WORD PRICES MEAN A HIGHER -- LOWER PRICES MEAN HIGHER YIELD. DATA SHOW THAT A REBOUND IN MANUFACTURING SUGGESTS THAT MIGHT DARKEN THE OUTLOOK FOR AN IMMEDIATE RATE CUT IN SEPTEMBER. THE DOLLAR MOVING HIGHER FOLLOWING THE 10:00 A.M. RELEASE, UP .3%. THE BIG STORY IS WHAT IS HAPPENING WITH THE FEDERAL RESERVE. WE START WITH THE TRAUMA OVER THE CENTRAL BANK AS WALL STREET AWAITS JAY POWELL TOMORROW. TRUMP IS DEMANDING THAT GOVERNOR LISA COOK RESIGN, SOMETHING SHE SAYS SHE WILL NOT DO. BLOOMBERG SPOKE TO JEFFREY SCHMIDT, WHO REACTED TO THE TRUMP ADMINISTRATION'S PRESSURE CAMPAIGN. > > GREAT STEEL IS TESTED BY FIRE. WE CAN ALWAYS DO THIS BETTER, BUT I THINK THE NATURE OF INDEPENDENCE AND -- DON'T BELIEVE ME, BELIEVE OTHER NATIONS THAT HAVE CENTRAL BANKS AND DON'T -- IT SEEMS TO WORK. BUT I'M ALWAYS OPEN FOR THE CONVERSATION OF HOW DO WE MAKE IT AT HER. SCARLET: JOINING US FROM JACKSON HOLE IS ONE OF THE HOSTS OF \"BLOOMBERG SURVEILLANCE,\" OUR VERY OWN LISA ABRAMOWICZ. THE TRUMP ADMINISTRATION RAMPING UP PRESSURE ON LISA COOK OVER HER MORTGAGES. COOK ISSUED A STATEMENT SAYING SHE WILL STAY ON AT THE FEDERAL RESERVE. DO WE KNOW IF SHE IS ATTENDING THE EVENT AND MOVING ON WITH BUSINESS AS USUAL RIGHT NOW? LISA: IT IS A GREAT QUESTION, SCARLET. OUR UNDERSTANDING IS SHE WAS PLANNING ON ATTENDING. I HAVE NOT SEEN HER AS OF YET. A, REAL QUESTION HOW MUCH THIS WILL HANG OVER NOT ONLY THE PUBLIC, TO HAVE FED MEMBERS, BUT THE PRIVATE COMMENTARY. THEY ALL HAVE IMAGINED THEY HAVE BEEN UNDER INVESTIGATION AT ONE POINT OR ANOTHER. A REAL QUESTION OF WHAT IS THE ULTIMATE GOAL. THERE IS THIS FEELING THAT PRESIDENT TRUMP WANTS TO RESHAPE THE FEDERAL RESERVE AND THE BOARD OF GOVERNORS IS A KEY WAY TO DO IT, BUT TO WHAT END? YES, TO LOWER RATES, BUT IT IS A COMPLICATED ECONOMIC TIME. IT'S A REASON PEOPLE ARE TRYING TO KEEP THEIR HEADS DOWN, FOCUS ON EXACTLY THAT, AND CREATE THE POLICIES THAT WILL REDUCE LONGER-TERM INFLATION WITHOUT TORPEDOING THE LABOR MARKET. SCARLET: WE SHOULD MENTION AS WELL, ED MARTIN, A JUSTICE DEPARTMENT OFFICIAL, DID SAY IN HIS LETTER \"AT THIS TIME I ENCOURAGE YOU TO REMOVE MS. COOK FROM THE BOARD. NO AMERICAN THINKS IT IS APPROPRIATE THAT YOU SERVE DURING THIS TIME WITH A CLOUD HANGING OVER HER.\" LISA, WHEN YOU TALK ABOUT THE DIFFICULT ECONOMIC TIMES WE ARE IN RIGHT NOW, WE GOT SOME DATA THAT MAKES THINGS A LOT MORE COMPLICATED AS WELL. HOW MUCH ARE PEOPLE TALKING ABOUT THE DATA, AND HOW MUCH WE SHOULD TAKE SERIOUSLY SOFT DATA LIKE MANUFACTURING SURVEYS? LISA: THIS IS EXACTLY THE ISSUE. WE SAW DUELING DATA THIS MORNING THAT HIGHLIGHTS BOTH SIDES OF THE MANDATE. ON ONE HAND YOU HAVE JOBLESS CLAIMS CREEPING HIGHER AND ONGOING, CONTINUING CLAIMS THAT HAVE REACHED THE HIGHEST LEVELS IN CRAFT TO THE HIGHEST LEVEL SINCE --AND HAVE CREPT TO THE HIGHEST LEVELS SINCE 2021. HOUSING STARTS ARE PICKING UP IN CERTAIN AREAS FOR THE MANUFACTURING NUMBERS CAME IN FAIRLY STRONG. YOU DID SEE THERE WAS INFLATIONARY PRESSURE. IF YOU LOOK AT THE S & P PMI'S FOR EXAMPLE, IT WAS THE SECOND FASTEST PACE OF PRICE INCREASES FOR MANUFACTURERS GOING BACK TO 2022. EVEN FOR SERVICE PROVIDERS IT WAS THE SECOND FASTEST PACE. WHAT DOES THIS LOOK LIKE? THIS LOOKS LIKE STAGFLATION LIGHT. HOW DOES THE CENTRAL BANK BE WITH THAT? -- DEAL WITH THAT? IT IS A CONUNDRUM ON AN ONGOING BASIS. WALMART IS COMING OUT AND TALKING ABOUT THE PRICE INCREASES THAT THEY ARE TRYING TO ABSORB WHAT INEVITABLY ARE GOING TO HAVE TO PASS ALONG, HIGHLIGHT THE CONUNDRUM THE FED FACES. ON ONE HAND THERE WAS AGO CONCERN ABOUT INFLATION. WE SAW THAT IN THE MEETING MINUTES. ON THE OTHER HAND THERE IS THIS CONCERN ABOUT THE LABOR MARKET AND BEYOND JOBLESS CLAIMS, HINT AT THAT A LITTLE BIT, NOTHING SCREAMINGLY TERRIBLE, BUT THE IDEA THAT THE NONFARM PAYROLLS REPORT THAT SPOOKED THE MARKET WAS ONTO SOMETHING. THIS IS A REASON PEOPLE ARE FOCUSING ON THE ECONOMY, WHICH IS HIGHLY COMPLICATED, COMPLICATED ECONOMY, COMPLICATED POLITICAL BACKUP. SCARLET: LISA ABRAMOWICZ JOINING US FROM JACKSON HOLE, WYOMING, THANK YOU SO MUCH. FOR MORE ON HOW INVESTORS ARE BRACING FOR THAT FED CHAIR ADDRESS BY JAY POWELL, LET'S BRING IN VICTORIA FERNANDEZ, CHIEF MARKET STRATEGIST AT? GLOBAL INVESTMENTS. THE DATA WE GOT TODAY, HOW MUCH DO YOU THINK THAT IS SOMETHING THE MARKET IS REACTING TO VS. YOU HAVE GOT LIGHT TRADING AND ANTICIPATION BEFORE JAY POWELL'S COMMENTS TOMORROW? > > I THINK THE DATA IS FEEDING INTO THE ANTICIPATION. YOU HAD LISA TALKING ABOUT THE PMI NUMBERS THAT OUT. THOSE ARE REALLY IMPORTANT WHEN IT COMES TO INFLATION, BECAUSE THEY ARE A VERY STRONG SIX-MONTH LEADING INDICATOR TO PPI FINAL DEMAND. WE ARE SEEING OVER THE LAST FEW MONTHS THAT THOSE PMI NUMBERS, PRICES PAID, CONTINUE TO MOVE HIGHER. IT IS TELLING US WE SHOULD HAVE UPWARD INFLATION PRESSURE FROM NOW THROUGH THE END OF THE YEAR INTO EARLY 2026. THE FED HAS TO BE LOOKING AT THAT AS WELL AND THINKING, WELL, IF WE CONTINUE TO HAVE THESE INFLATION PRESSURES, IF YOU HAVE COMPANIES LIKE WALMART THAT HAS THE GREATEST PRICING POWER OF ANY COMPANY OUT THERE SAYING THEY WILL HAVE TO PASS THROUGH THESE TARIFF PRICE INCREASES, THEY ARE CONCERNED ON THE INFLATION SIDE. WHILE AT THE SAME TIME YOU HAVE CONCERNS ON THE LABOR MARKET, ALTHOUGH LABS ARE NOT REALLY RAMPING UP SIGNIFICANTLY. --LAYOFFS ARE NOT RAMPING UP SIGNIFICANTLY. ALL THIS DATA CONTINUES TO TELL THE MARKET WE ARE NOT SURE HOW POWELL IS GOING TO POSITION HIMSELF TOMORROW FOR THE SEPTEMBER FOMC MEETING. SCARLET: HAVING SAID THAT, EVEN BEFORE THE DATA WE HAVE BEEN SEEING A MINISLUMP IN EQUITIES. S & P 500 ON THE FIFTH DAY OF DECLINES, MAG 7 FALLING EVEN MORE, TODAY'S DECLINE OUTPACING THE S & P 500'S OVERALL. HOW MUCH DO YOU READ INTO THIS RECENT BOUT OF WEAKNESS? VICTORIA: THE WEAKNESS IS THIS ROTATION, THIS INTERNAL ROTATION WHERE YOU HAVE GOT SOME OTHERS HIGH MOMENTUM VECTOR STARTING TO CONSOLIDATE. THEY HAVE BEEN STRAINED. THEY HAVE BEEN IN THE HIGHEST PERCENTILES OF THEIR HISTORICAL RANGES. I THINK IT IS OK THAT THE MARKET IS TAKING A LITTLE BIT OF A BREATHER, ESPECIALLY WHILE IT IS WAITING TO GET A VERY IMPORTANT DATA FROM THE FED. WE HAVE SEEN THE VALUE FACTORS START TO PICK UP AND THE MORE DOWNTRODDEN SECTORS DO WELL. IF YOU LOOK, THE MAJORITY OF THE NAMES THAT HAVE COME DOWN HAVE BEEN THOSE TOP-DECILE PERFORMERS YEAR-TO-DATE, AND THE SEMIS MAKE UP 50% OF THE MARKET CAP. A LOT OF CHURNING GOING ON, BUT BECAUSE THE VIX IS NOT GOING TO ITS YEAR HIGHS, WE ARE OK FOR RIGHT NOW, AND MAYBE THE MARKET WILL CALM DOWN ONCE WE HAVE A BETTER IDEA OF WHAT WE THINK RATES ARE GOING TO DO. SCARLET: LET'S TALK A LITTLE BIT ABOUT WALMART. YOU MENTIONED IT EARLIER AND LISA POINTED OUT, HAVING TREMENDOUS PRICING POWER WHILE MAKING IT CLEAR THAT TARIFFS IS SOMETHING IT NEEDS TO KEEP A CLOSE EYE ON AND RESPOND TO DYNAMICALLY. WHAT DOES WALMART SAYING THAT DO IN TERMS OF THE REST OF THE RETAIL SECTOR, WHICH DOES NOT HAVE THE SAME PRICING POWER , M EAN? VICTORIA: I STILL THINK THEY ARE GOING TO GET PUNISHED IN THE SENSE THAT AS THEY CONTINUE TO PUT PRICES THROUGH TO CONSUMERS, AT SOME POINT THE CONSUMER THAT DOES NOT HAVE STIMULUS CHECKS COMING IN LIKE THEY DID DURING COVID, THEY ARE NOT GOING TO BE ABLE TO PAY HIGHER PRICES FOR EVERYTHING. THERE IS GOING TO BE SOME DEMAND DESTRUCTION THAT COMES THROUGH THAT ACTUALLY IN THE LONGER-TERM WILL BE DISINFLATIONARY. BUT THESE COMPANIES RIGHT NOW, IT IS NOT A GOOD LOOK. YOU HAVE TARGET, YOU HAD A MAKEUP BRAND TALKING ABOUT HIGHER PRICES, TARGET HAVING HIGH PRICES, WALMART HAVING HIGHER PRICES. IT SETS IT UP TO WHERE CONSUMERS ARE GOING TO SEE HIGHER PRICES ACROSS THE BOARD, NOT JUST MAYBE IN CERTAIN AREAS, BUT AS COMPANIES TRY TO KEEP THOSE EARNINGS UP, THOSE MARGINS UP, WHICH IS WHAT HAS REALLY BEEN SUPPORTIVE OF THIS ECONOMY FOR SO LONG. THEY ARE GOING TO HAVE TO HAVE CONSUMERS PAY MORE. SCARLET: IT FEELS LIKE MOST OF THE MAIN CATALYSTS ARE UPON US AND WILL BE SOON COME WITH JAY POWELL'S SPEECH TOMORROW MORNING. AFTER THAT, WHAT IS THE NEXT CATALYST FOR THIS MARKET? NOT WHAT WILL PEOPLE BE KEYING OFF OF INTO WE GET THE JOBS REPORT IN SEPTEMBER? VICTORIA: WE DO HAVE NVIDIA EARNINGS NEXT WEEK, SO THERE WILL BE A LOT OF EYES WATCHING NVIDIA TO SEE WHAT HAPPENS TO THAT WHOLE TECH SECTOR. THAT IS PART OF WHAT WE HAVE SEEN THIS BIG PULLBACK OVER THE LAST FEW DAYS. NVIDIA WILL BE IMPORTANT. WE GET MORE INFLATION AND MORE LABOR MARKET NUMBERS COMING BEFORE THE FOMC MEETING. PEOPLE ARE GOING TO BE KEYING IN ON THOSE TO DETERMINE WHAT THEY THINK IS GOING TO HAPPEN. AND OF COURSE WE DON'T KNOW IF WE ARE GOING TO HAVE ANOTHER NEW FED NUMBER ON THAT PANEL OR NOT BY THE TIME THE MEETING COMES AROUND. I THINK THERE'S A LOT OF WHAT-IFS OUT THERE THAT KEEP THE UNCERTAINTY LEVEL HIGH AND KEEP THIS CHURNING IN THE MARKET. SCARLET: A LOT OF WHAT-IFS OUT THERE. WHAT IS THE NUMBER ONE QUESTION YOU HAVE FOR JAY POWELL IN TERMS OF WHAT HE IS LIKELY TO ANSWER, WHAT HE IS LIKELY TO SHED LIGHT ON WHEN HE DOES SPEAK TOMORROW? HE HAS BEEN VERY GOOD BEING ABLE TO SAY A LOT BUT NOT SHOW HIS CARDS. VICTORIA: THAT'S TRUE. I THINK IF THEY ARE GOING TO DO A 25-BASIS-POINT CUT AT THE SEPTEMBER MEETING, WE WON'T GET MUCH INFORMATION FROM THEM BECAUSE THAT IS WHAT THE MARKET IS PRICING IN. IF HE IS LEANING TOWARDS STAYING ON HOLD AGAIN, WE WILL GET INFORMATION IN REGARDS TO THAT. MORE HAWKISH TONE TOMORROW. THOSE ARE THE ELEMENTS I'M WATCHING, IS THE FOCUS MORE ON INFLATION THAN LABOR, IS HE MENTIONING THE PMI NUMBERS, WHAT IS THE CONCERN LEVEL THERE. THAT IS GOING TO BE THE FOCUS. SCARLET: VICTORIA, THANK YOU SO MUCH. VICTORIA FERNANDEZ IS CHIEF MARKET STRATEGIST AT? AT GLOBAL INVESTMENT. COMING UP, THERE IS A TRADE AS WELL BECAUSE THE U.S. AND EU ARE ANNOUNCING NEW DETAILS ON THE TRADE AGREEMENT, BUT MAJOR ISSUES ARE STILL LEFT UNRESOLVED. WE ARE GOING LIVE TO WASHINGTON AND LONDON WITH THE LATEST ON WHERE THINGS STAND. THIS IS BLOOMBERG. ♪ > > THIS IS NOT THE END. IT'S THE BEGINNING. THIS FRAMEWORK IS THE FIRST STEP, ONE THAT CAN GROW OVER TIME TO COVER MORE SECTORS, IMPROVE MARKET ACCESS, AND STRENGTHEN OUR ECONOMIC TIES EVEN FURTHER. SCARLET: AND THAT WAS THE EUROPEAN COMMISSIONER FOR TRADE AND ECONOMIC SECURITY EARLIER TODAY AFTER THE U.S. AND EU TOOK THE NEXT STEPS TO FORMALIZE THEIR TRADE PACT. HERE WITH MORE ON THE NEW DETAILS IN THIS ONGOING AGREEMENT AND WHAT IS STILL UNRESOLVED IN THIS IS BLOOMBERG'S ENDA CURRAN, WHO JOINS US FROM WASHINGTON, AS WELL AS BLOOMBERG'S TRADE CZAR, BRENDAN MURRAY. WHEN THE TWO SIDES, THE EUROPEAN UNION AND THE U.S., ANNOUNCED A TRADE AGREEMENT, PRELIMINARY AGREEMENT, IT WAS KIND OF CONCEPTS OF A PLAN. WE HAVE A LITTLE MORE DETAIL TO GO WITH. FOR WHICH SECTORS DO WE HAVE THE DETAILS THAT COME TO A RESOLUTION? > > RIGHT, WE HAVE INCREMENTAL PROGRESS HERE IS WHAT A LOT OF PEOPLE ARE CHARACTERIZING THIS AS. WE KNOW THAT THE U.S. TARIFF ON EUROPEAN AUTOMOBILES IS GOING TO COME DOWN FROM 27.5% TO 15%. THAT WILL BE CONTINGENT ON THINGS THE EUROPEAN UNION NEEDS TO DO IN TERMS OF HOLDING UP ITS END OF THE BARGAIN ON TRADE BARRIERS. THE EUROPEAN UNION GOT SOME CLARITY, TOO, ON THE OTHER SECTORAL TARIFFS LIKE PHARMACEUTICALS AND CHIPS AND LUMBER, THAT THOSE WOULD ALSO COME DOWN TO 15% AS PART OF THE PROCESS THAT THEY WILL BOTH TRY TO CARRY OUT OVER THE NEXT COMING WEEKS. SCARLET: AUTO TARIFFS IS CRITICAL, GIVEN THE GERMAN AUTO INDUSTRY AND HOW MUCH THEY RELY ON THAT, IN THE U.S. MARKET AS WELL. ENDA LET ME COME TO YOU HERE. WE TALK ABOUT THE PRELIMINARY AGREEMENT AND NOW SOME DETAILS ARE BEING FILLED OUT. YET I WONDER TO WHAT EXTENT IF THIS IS WHAT TRADE DEALS IN TRUMP 2.0 WILL NOW LOOK LIKE, BECAUSE IN BEFORE TIMES, BEFORE PRESIDENT TRUMP CAME ALONG, HE WOULD HAVE MONTHS OF NEGOTIATIONS WITH TRIAL BALLOONS FLOATED, CULMINATING INSENSITIVE FINAL ANNOUNCEMENT OR SIGNING CEREMONY. THAT IS GONE BY THE WAYSIDE. ENDA: WE HAVE MOVED PRETTY FAR, SCARLET. PRESIDENT TRUMP WAS WARNING THE EU WITH TARIFFS OF UP TO 30%, AND HERE WE ARE, KIND OF AN AGREEMENT, EU TRADE COMMISSIONER SAID IT MEANS A WORK IN PROGRESS. MANY OF DETAILS THAT DO NEED TO BECOME CLEAR OVER TIME, NOT LEAST ON THE SIDE, PEOPLE ARE LOOKING AT THE INVESTMENT COMMITMENTS BY THE EU THAT PROMISES TO PUT HUNDREDS OF MILLIONS OF EUROS OF INVESTMENT IN THE U.S., HUNDREDS OF MILLIONS OF EUROS WORTH OF ENERGY. A LOT OF SCRUTINY AND ATTENTION ON WHERE WILL THE MONEY START TO FLOW, WHERE WILL IT FLOAT TO, HOW WILL THE INVESTMENTS BE MADE, WILL IT OF GOODS, GREEN INVESTMENTS, A LOT OF SCRUTINY ON THAT SIDE OF IT. ON PAPER, STABILIZING RELATIONS BETWEEN TWO MASSIVE ECONOMIC BLOCS, THAT IS IMPORTANT GIVEN THE POLITICAL BACKDROP. SCARLET: WELL SAID. BRENDAN, THE OTHER THING THAT THE OFFERED TO SWEETEN THE INITIAL BILLING, AGREEMENT WAS THE PROMISE TO INVEST $600 BILLION IN THE U.S. DO WE HAVE A SENSE OF HOW THAT IS GOING TO WORK AND IF THE PRIVATE SECTOR WILL COUNT AS PART OF THAT? BRENDAN: THE JOINT STATEMENT THEY RELEASED TODAY WAS VERY MUCH DIFFERENT THAN THE WAY TRUMP DESCRIBED IT INITIALLY, THAT THIS WAS SOME SORT OF SIGNING BONUS, THE WAY HE CHARACTERIZED IT. JAPAN'S INVESTMENT PLEDGES. WE DID NOT SEE ANY OF THAT FROM THE EUROPEAN AND U.S. STATEMENT TODAY. THE LANGUAGE WAS MUCH VAGUER AND IT GAVE NO STAKE TO THE WAY THAT JAPAN DEAL GIVES A 90-10 STAKE TO THE U.S. AND JAPAN. THERE WAS NONE OF THAT. STILL A LOT OF VAGARIES IN THE STEEL, AND AS ENDA, SUGGESTED THESE ARE TURNING INTO FOREVER NEGOTIATIONS, JUST ONGOING WITH NO CLEAR END IN SIGHT. SCARLET: GOOD STUFF. AND OUR CURRENT IN WASHINGTON AND BRENDAN MURRAY IN LIMITED, YOU HAVE A LOT TO DELIBERATE OVER IN COMING WEEKS AS WELL. COMING UP ON \"BLOOMBERG MARKETS ,\" A DELAYED TAX BILL IN CHICAGO COULD PUT THIS COOL DISTRICT IN A FINANCIAL BIND. MORE DETAILS IN A MOMENT. SCARLET: THIS IS \"BLOOMBERG MARKETS.\" CHICAGO'S PUBLIC SCHOOLS ARE FACING A CASH CRUNCH. THIS IS PART OF OUR MUNI MOMENT. A DELAYED PROPERTY TAX PAYMENT IS FORCING THE DISTRICT TO SEEK AUTHORIZATION TO ISSUE $1.25 BILLION IN TAX INTO THE PATIENT NOTES. THE SYSTEM CLOSE THE FISCAL YEAR WITH A NEGATIVE NET CASH POSITION. LET'S BRING SHRUTI SINGH IN CHICAGO. TELL ME WHERE THESE PROPERTY TAX COLLECTION'S ARE DUE TO ARRIVE AT HOW THE ANTICIPATION IS THAT THE CITY MIGHT NEED TO ISSUE, SCHOOL DISTRICT MIGHT NEED TO ISSUE, WOULD WORK. > > PROPERTY TAXES ARE THE LARGEST SOURCE OF REVENUE FOR THE CHICAGO PUBLIC SCHOOLS, AND THEY COME IN TWO THEY PATCHES. IN THE BEGINNING OF THE YEAR, AROUND MARCH, AND THEN AROUND AUGUST. PAYMENTS ARE DUE AUGUST 1, BUT THE BILLS HAVE NOT GONE OUT TO RESIDENTS BECAUSE THERE HAS BEEN A COMPUTER GLITCH. WHAT THAT MEANS IS THIS KEY AMOUNT OF CASH THAT THE DISTRICT COUNTS ON MAY NOT COME FOR WEEKS OR POTENTIALLY EVEN MONTHS. THE DISTRICT TREASURER TOLD THE SCHOOL BOARD LAST WEEK THAT THEY MAY NOT COME UNTIL ABOUT OCTOBER. SCARLET: MAY NOT COME TILL OCTOBER. WHAT DOES THIS MEAN GIVEN THAT THE SCHOOL YEAR IS ABOUT TO START AND THE SCHOOL DISTRICT NEED TO SPEND MONEY? THEY WILL HAVE TO CUT COSTS, WON'T THEY? SHRUTI: THEY ARE IN NEGOTIATIONS RIGHT NOW. THE SCHOOL DISTRICT HAS PRESENTED OF PROPOSAL FOR 2026. THE YEAR STARTED ON JULY 1, BUT THE BUDGET HAS NOT BEEN APPROVED YET. THE SCHOOL BOARD IS GOING TO VOTE ON THAT OR IS EXPECTED TO VOTE ON THAT ON AUGUST 28. WE DON'T KNOW EXACTLY HOW THEY ARE GOING TO CLOSE 730 $49 BUDGET DEFICIT. THE TAX ANTICIPATION NOTES ACT AS A BRIDGE UNTIL THEY GET THE CASH FLOW GOING. OVER THE LAST FEW YEARS, THOSE SHORT-TERM FARAWAYS HAVE INCREASED -- BORROWINGS HAVE BEEN INCREASING FOR THE DISTRICT. SCARLET: SHRUTI SINGH BRINGING US THE LATEST IN CHICAGO. NO ONE CHICAGO, RECENT COLLEGE GRAD -- BEYOND CHICAGO, RECENT COLLEGE GRADUATES ARE FEELING THE. GEN Z AND MILLENNIALS LEAVING PRICEY CITIES BEHIND IN SEARCH OF JOB OPPORTUNITIES AND A BETTER QUALITY OF LIFE. LET'S HEAR THE PITCH FROM THE CHIEF GROWTH OFFICER FOR THE STATE OF MICHIGAN, THE FIRST CHRISTIAN -- FIRST PERSON TO HOLD THIS POSITION FOR ANY STATE IN THE COUNTRY. I WANTED FIND OUT MORE ABOUT THE SURVEY. WHAT ARE THE BIGGEST FACTORS INFLUENCING YOUNG PROFESSIONALS AND RECENT COLLEGE GRADUATES IN TERMS OF WHERE THEY WANT TO LIVE? > > THANKS SO MUCH FOR HAVING ME. WHEN YOU LOOK FOR THE SURVEY RESULTS, WE HAVE SEEN SOMETHING PRETTY CONSISTENT. FOLKS CONTINUE TO BE CONCERNED ABOUT QUALITY OF SCHOOLS, QUALITY OF HEALTH CARE, COMMUNITY SAFETY, THAT SORT OF THING. WE ARE SEEING A REAL RISE IN CONCERN ABOUT AFFORDABILITY, AND IN PARTICULAR HOUSING AFFORDABILITY. 86% OF SURVEY RESPONDENTS SAID HOUSING AFFORDABILITY WAS GOING TO BE VERY IMPORTANT, EXTREMELY IMPORTANT IN DETERMINING WHERE THEY WERE GOING TO LIVE. ALONGSIDE A REAL FOCUS ON QUALITY OF PLACE. EVERY THING FROM WALK ABILITY, TRANSIT, AMENITY RICHNESS, REALLY IMPORTANT IN THE SURVEY. 75% OF RESPONDENTS IDENTIFYING ACCESS TO NATURE AND THE OUTDOORS AS BEING VERY OR EXTREMELY IMPORTANT IN CHOOSING WHERE THEY ARE GOING TO LIVE. TAKEN TOGETHER, IT PAINTS A PICTURE OF GEN Z AND MILLENNIALS DESIRING GREAT QUALITY OF PLACE IN LIFE BUT ALSO A COST-OF-LIVING. SCARLET: WHAT KIND OF INCENTIVES ARE THE YOUNG PEOPLE LOOKING FOR -- WHAT KIND OF INCENTIVES WITH A RESPOND TO --WOULD THEY RESPOND TO? HILARY: WITH RISING COSTS, FOLKS CONTINUE TO FEEL THE PINCH, THAT BECOMES A FACTOR, PROGRAMS THAT OFFER FINANCIAL INCENTIVES TEND TO BE MORE EFFECTIVE. OVER 50% OF SURVEY RESPONDENTSS SAID THAT FOLKS THAT OFFER THOSE FINANCIAL INCENTIVES OR THOSE KINDS OF PROGRAMS WOULD BE MOTIVATING ENOUGH FOR THEM TO CONSIDER A NEW PLACE TO CALL HOME. THESE INCLUDE THINGS LIKE STUDENT LOAN FORGIVENESS AND EVEN THINGS LIKE JOB PLACEMENT SUPPORT FOR FOLKS THAT MIGHT BE LOOKING FOR A CHANGE. IN MICHIGAN WE HAVE RESPONDED TO THE SENATE BEEN FOCUSED ON ENSURING WE CAN RETAIN TALENT HERE AND ATTRACT FOLKS FROM OTHER PARTS OF THE COUNTRY TO JOIN US, AND HAVE LAUNCHED PROGRAMS LIKE MAKE MICHIGAN HOME, MAKE MI HOME, SO COMMUNITIES CAN OFFER EVERYTHING FROM DOWN PAYMENT SUPPORT STUDENT LOAN FORGIVENESS TO RELOCATION SUPPORT TO ENSURE MICHIGAN TALENT AND FOLKS ACROSS THE COUNTRY CAN MAKE CHOOSING MICHIGAN A REAL NO-BRAINER. SCARLET: THAT MAKES A LOT OF SENSE. WHAT I THINK ABOUT MICHIGAN, IT THIS A CREDIBLE UNIVERSITY THAT ATTRACTS TALENT FROM WITHIN THE STATE AND OUTSIDE THE STATE AS WELL. KEEPING THAT TALENT INSIDE MICHIGAN I'M SURE IS A HUGE PRIORITY. WHAT SIGNIFICANT INITIATIVES HAVE YOU OBSERVED WORKED, AND WHAT ACCENT ARE THOSE SCALABLE, THAT CAN BE MULTIPLIED THROUGHOUT THE STATE AND PERHAPS BEYOND MICHIGAN? HILARY: ABSOLUTELY. ULTIMATELY WHAT WE CAN SEE THAT YOUNG PEOPLE ARE MAKING DECISIONS TO STAY IN A PLACE OR MOVE TO A PLACE BECAUSE THEY HAVE BEEN THREE THINGS. THEY WANT GREAT OPPORTUNITIES -- THAT MEANS A PLACE HAS TO ENSURE YOU ARE PROVIDING A GREAT JOB AND EDUCATIONAL OPPORTUNITIES. WE LEAN INTO THAT HERE IN MICHIGAN, ENSURING THAT WE CONTINUE TO HAVE THE SECOND FASTEST GROWING STARTUP ECOSYSTEM IN THE COUNTRY. WE HAVE REALLY FAST GROWING CLEAN ENERGY ECOSYSTEMS AND A DIVERSE ECONOMY TODAY IF YOU GO TO THE MICHIGAN AIRPORT, 130,000 OPEN JOBS. ANY COMPANY THAT WANTS TO, RETAIN OR ATTRACT TALENT YOU HAVE TO PROVIDE GREAT ECONOMIC OPPORTUNITIES, BUT UNIQUELY PLACES ACCESS TO OUTDOORS. IT'S NOON TO INVEST IN QUALITY OF PLACE -- CONTINUING TO INVEST IN QUALITY OF PLACE AND WALK ABILITY IS CRITICAL. CONTINUING TO ENSURE AFFORDABILITY. WE HAVE MADE THE START HOUSING INVESTMENTS EVEN THOUGH WE HAVE HOUSING PRICE THAT IS 40% MORE AFFORDABLE THAN AVERAGE. YOU NEED TO MAINTAIN AFFORDABILITY, AND WE'VE MADE SURE TO DO THAT HERE, DOWN PAYMENT PROGRAMS TO ENSURE YOUNG PEOPLE HAVE A PATH TO OWNERSHIP. I WOULD ENCOURAGE FOLKS TO THINK ABOUT INNOVATIVE PROGRAMS LIKE THAT, MANAGEMENT PROGRAMS LIKE MAKE MICHIGAN HOME, TO GIVE PEOPLE THOSE PATHWAYS. SCARLET: HILARY DOE, CHIEF GROWTH OFFICER FOR THE STATE OF MICHIGAN, THANK YOU SO MUCH. THE IDEA TO ENSURE THERE IS ENOUGH SUPPLY FIRMS. BOEING WITH A MAJOR FOREIGN DEAL. DETAILS NEXT. ♪ SCARLET: WELCOME TO \"BLOOMBERG MARKETS.\" I AM SCARLET FU. FIFTH DAY OF LOSSES FOR THE S & P 500. THE FED AWAITS JAY POWELL'S SPEECH TOMORROW MORNING. VIX IS MOVING UP -- HI 16'S HERE. IT HAS EDGED HIGHER TO A TWO-WEEK HIGH THE LAST FEW DAYS. STILL BELOW THE YEAR TO DATE AVERAGE OF JUST UNDER 20. BOND PRICES DOWN 10-YEAR YIELD THAT 4.34%. SOFT DATA SHOWED A RECOVERY, WHICH COULD REDUCE THE ODDS OF A RATE CUT IN SEPTEMBER AND FURTHER DOWN THE ROAD. THE BLOOMBERG DOLLAR INDEX HOLDING ONTO ITS GAINS. ONE THIRD OF 1% AFTER THE DATA RELEASE. A LOT OF ATTENTION ON THE FED WITH POWELL SPEAKING AT JACKSON HOLE, AND PRESSURE ON THE FED COMING FROM THE WHITE HOUSE. EARLIER TODAY THE ATLANTA FED PRESIDENT SAID HE SEES JUST ONE RATE CUT THIS YEAR, BUT HE IS WATCHING SIGNS OF AWAKENING LABOR MARKET. THAT I \"THAT IS KIND OF STILL WHERE I AM, BUT IN TODAY'S WORLD, EVERY ESTIMATE OR FORECAST HAS A WIDE CONFIDENCE BAND AROUND IT, I'M NOT STUCK ON ANYTHING.\" JANELLE MATE IS IN ATLANTA. IT SOUNDS LIKE HE IS MAINTAINING FLEXIBILITY IN HIS THINKING AS NEW DATA COMING. > > THAT'S RIGHT. HE IS STILL OF THE MINDSET THAT THEY ARE LIKELY TO CUT RATES ONE TIME THIS YEAR, BUT HE HAS BEEN WATCHING WHAT IS GOING ON WITH THE LABOR MARKET LAST REPORT SHOWED SUBSTANTIALLY WEAKER GROWTH AND EMPLOYMENT IN THE THREE MONTHS THROUGH JULY. IT IS SOMETHING ON HIS RADAR. BUT AS HE AND OTHER OFFICIALS HAVE SAID, THEY ARE GOING TO GET A LOT MORE DATA BEFORE THE SEPTEMBER GATHERING. THERE IS ANOTHER JOBS REPORT, THERE IS MORE INFLATION DATA COME. THAT WILL INFORM WHETHER OR NOT THEY SHOULD MOVE, THAT OF COURSE AFTER THAT WHAT WILL GO ON AFTER THAT. SCARLET: ABSOLUTELY. RAPHAEL BOSTIC DOES NOT HAVE A VOTE ON THE RATESETTING FOMC COMMITTEE THIS YEAR. CLEARLY WE WANT TO PAY ATTENTION TO WHAT HE IS SAYING, BUT THERE ARE OTHER VOICES IN THE ROOM THAT ARE MORE DIRECTLY IMPACTFUL. WE ALSO HEARD FROM OTHER FED OFFICIALS AS WEL INCLUDINGL JEFFREY SCHMID, WHO SPOKE TODAY, AND BOTANIC. CAN YOU WRAP UP FOR US WHAT THEIR STANCES? JONNELLE: WHAT WE'VE BEEN HEARING TODAY IS BASICALLY A LINGERING CONCERN ABOUT INFLATION. INFLATION IS STILL ABOVE OUR TARGET AND TRENDING HIGHER. EVEN GOING SO FAR AS TO SAY THAT IF SHE HAD TO MAKE A DECISION TOMORROW, SHE DOESN'T SEE THE CASE FOR LOWERING RATES AT THIS NEXT MEETING. SHE NODDED TO THE FACT THAT THEY ARE GOING TO GET A LOT MORE DATA AND SHE IS GOING TO GO INTO THE GATHERING WITH AN OPEN MIND. WHAT WE HAVE BEEN HEARING IS ALIGNED WITH WHAT WE LEARN FROM THE MINUTES, WHICH IS THAT MOST OFFICIALS WERE MORE CONCERNED, THEY SAW INFLATION AS A HIGHER RISK THAN EMPLOYMENT. WE DID GET THE EMPLOYMENT REPORT A FEW DAYS AFTER THAT. THEY ARE TAKING IN ALL OF THE DATA AND THEY ARE GOING TO MAKE THAT DECISION WHEN THE TIME COMES. KEEP IN MIND THAT WE ARE SEEING INFLATION STILL FACING A LOT OF PRESSURE. WHOLESALE INFLATION GROWS SUBSTANTIALLY IN THE LAST REPORT. IT IS A STAGFLATIONARY DIRECTION AND OFFICIALS ARE SEEING TENSION ON BOTH SIDES OF THE MANDATE. SCARLET: LISA ABRAMOWICZ WAS TELLING US IN THE EARLIER PART OF THE SHOW THAT THIS IS TAXATION LITE, AND THAT IS OF CONCERN. -- STAGFLATION LITE, AND THAT IS OF CONCERN. ON THE WHITE HOUSE'S PUSH TO REMAKE THE FEDERAL RESERVE BOARD, HOW MUCH IS THAT PRESSURE REFLECTED IN THE COMMENTS MADE BY THE FED OFFICIALS, IF AT ALL? JONNELLE: I WOULD SAY THAT MOST OF THEM HAVE BEEN SAYING THEY ARE FOCUSED ON THE JOB. THEY HAVE THE DUAL MANDATE TO KEEP THE LABOR MARKET STRONG AND BRING INFLATION BACK DOWN THE TARGET. THEY ARE TRYING TO TUNE OUT AS MUCH AS THEY CAN THE POLITICAL PRESSURE TO LOWER RATES AND FOCUSING MORE ON THE DATA. BUT IT'S NOT STOPPING THE WHITE HOUSE FROM PUTTING THE PRESSURE ON COOK, FINDING DIFFERENT AVENUES TO PUT MORE PRESSURE ON THE FED TO BASICALLY LOWER INTEREST RATES. SCARLET: THE DIRECTION THAT PRESIDENT TRUMP WANTS THEM TO MOVE IN. JONNELLE MARTE JOINING US FROM ATLANTA, THANK YOU SO MUCH. JONNELLE IS ONE OF OUR FEDERAL RESERVE REPORTERS. AS INVESTORS AWAY THE FED, LET'S HIGHLIGHT INDIVIDUAL EQUITY MEMBERS. FOR THAT WE BRING IN EMILY GRAFFEO. HI, EMILY. EMILY: ONE OF THE MOST READ STORIES ON THE BLOOMBERG TERMINAL IS ABOUT WALMART. RARE PROFIT MS., THE FIRST TIME THEY REPORTED PROFIT MISSING ESTIMATES IN THREE YEARS. WE ARE SEEING THE STOCK DROPPED 5%. IT WAS ALSO THE BIGGEST INTRADAY DROP SINCE MARCH, WHICH IS NEVER A GOOD THING TO SEE HERE FOR SUCH A LARGE COMPANY. THE COMPANY CITED A RISE IN INSURANCE CLAIMS, RESTRUCTURING COSTS, AND CHARGES. ECONOMIC BELLWETHER NOT DOING TOO WELL TODAY. YOU'RE WATCHING SHARES OF NABORS. IT IS UP 30% OVER THE LAST FOUR DAYS ON DEALNEWS. THIS IS A HUMAN RESOURCES SOFTWARE PROVIDER. THINK PAYROLL TOOLS, HR TOOLS. THE COMPANY IS TAKEN PRIVATE FOR $70 A SHARE IN CASH. THAT REPRESENTATIVE DUE TO PRESENT PREMIUM TO DAYFROORCE'S STOCK PRICE UNLESS TRADING SESSION BEFORE BLOOMBERG NEWS REPORTED THAT TALKS FOR THIS DEAL WERE IN DISCUSSION. WE SPOKE TO THE MANAGING PARTNER. TAKE A LISTEN. > > WE THINK THE SPACE OF GENERAL HUMAN CAPITAL MANAGEMENT SHOULD BE -- IS A GREAT OPPORTUNITY. WE THINK IT IS A HUGE OPPORTUNITY. THEY HAVE A REALLY AMBITIOUS AI ROADMAP. THEY ARE SELLING AI SKEWS, BUT THERE IS AN AMBITIOUS ROADMAP TO ROLLOUT A BUNCH OF AI AGENTS, AND WE CANNOT HELP THEM ACCELERATE THAT PATH TO AGENT -- CAN HELP THEM EXCELLENT WITH THAT PATH TO AGENTIC AI. RMILY: FINALLY, THE OWNER OF HIGH-END BRANDS LIKE, COVER GIRL THE BIGGEST INTRADAY DROP SINCE MARCH 2020. THE COMPANY REPORTED A WIDER THAN EXPECT A LOSS IN THE FOURTH QUARTER, REFLECTING MAYBE AN UNCERTAIN CONSUMER PULLING BACK FROM SPENDING ON MAKEUP AND PERFUMES AS THE ECONOMIC OUTLOOK STATES UNCERTAIN. SCARLET: THANK YOU SO MUCH, EMILY GRAFFEO. STAYING WITH COMPANY NEWS, A MAJOR DEAL FOR BOEING COULD BE IN THE WORKS. BLOOMBERG HAS LEARNED THAT BOEING IS MOVING CLOSER TOWARD TO DO WITH CHINA TO SELL UP TO 500 AIRCRAFT ACCORDING TO PEOPLE FAMILIAR WITH THE MATTER. HERE WITH MORE IS SAID PHILIP. PUT THIS INTO CONTEXT FOR US. BOEING HASN'T DONE A LOT OF BUSINESS WITH CHINA FLIGHT. > > BOEING LAST HAD A MAJOR DEAL WITH CHINA IN 2017. IT HAS ALMOST BEEN A DECADE SINCE CHINA ORDERED NEW BOEING AIRCRAFT. FOR BOEING, THIS IS A CRUCIAL MARKET. CHINA IS ONE OF THE WORLD'S FASTEST-GROWING AVIATION MARKETS. FOR BOEING, IT IS IMPORTANT HAVE A SEAT AT THE TABLE AND IMPORTANT FOR THEM TO COMPETE WITH AIRBUS. AND ALSO THE CHINESE HAVE NOT HAD ANY REPLACEMENT AND NOT HAD BOEING AIRCRAFT FOR GROWTH. BOTH SIDES NEED THE DEAL THAT HAPPEN. SCARLET: BOTH SIDES NEED THE DEAL THAT HAPPEN. DOES THE U.S.-CHINA TRADE DEAL NEED THIS TO HAPPEN? SIDDHARTH: ABSOLUTELY. A LARGE PART OF IT DEPENDS ON WHETHER CHINA AND THE U.S. CAN REACH A DEAL AND AGREE TO SOME SORT OF FRAMEWORK FOR TRADE AND THIS COULD BE THE CROWNING GLORY OF THAT DEAL. THE AIRCRAFT DEALS HAVE BEEN A LARGE PART OF DONALD TRUMP'S DIPLOMACY AND TRADE EFFORTS. A BOEING DEAL WOULD BE SOMETHING THAT WOULD BE A MASSIVE EIN FOR BOTH SIDES. SCARLET: YOU COVER THE AIRCRAFT INDUSTRY. AIRCRAFT ORDERS ARCTIC -- TYPICAL PART OF DIPLOMACY AND OVERALL TRADE NEGOTIATIONS. THIS WOULD BE PART AND PARCEL OF THAT HISTORY. SIDDHARTH: ABSOLUTELY, AND ESPECIALLY UNDER THIS ADMINISTRATION, AIRCRAFT DEAL -- WE HAD THE LARGE QATAR AIRWAYS ORDER WHEN DONALD TRUMP WENT TO VISIT QATAR. AND WHEN WE SAW THE BRITISH AIRWAYS ORDER TIED TO THE U.K. AGREEMENT WITH U.S., WE -- AVIATION AND AIRCRAFT ORDERS HAVE BECOME A MUCH LARGER TRADE NEGOTIATION. THIS WOULD BE SOMETHING THAT CARRIES ON IN THE SAME VEIN. OBVIOUSLY THE SCALE OF THIS WOULD BE MASSIVE. SCARLET: ESPECIALLY SINCE REALLY ONLY TWO MAJOR PLAYMAKERS IN THE WORLD, AIRBUS AND BOEING. YOU MENTIONED IN YOUR REPORTING THAT THE THING THAT MIGHT COMPLICATED MATTERS IS THAT THERE IS A BIT OF A LEADERSHIP VOID FOR BOEING IN CHINA. WALK US THROUGH WHAT IS GOING ON THERE. SIDDHARTH: GOING'S LONGTIME -- BOEING'S LONGTIME HEAD OF THE CHINA UNIT HAS DEPARTED. THEY HAVE INTERIM LEADERSHIP IN PLACE AND THAT MAKES THINGS MORE COMPLICATED, BECAUSE LONG-TERM LEADERSHIP HAD MORE WITH THE LOCAL AUTHORITIES AND MIGHT'VE BEEN ABLE TO GET THOSE DEALS. AT THE SAME TIME, THIS IS A VERY LARGE ORDER. THIS WOULD BE BEYOND PERSONALITY. IT WOULD BE -- THE NDRC, WHICH TYPICALLY COORDINATES HOW CHINESE AIRLINES PURCHASE AIRCRAFT, THEY WOULD BE LOOKING AT HAVE THEY GET THIS DEAL ACROSS THE LINE, AND BOEING'S SENIORMOST MANAGEMENT WILL BE INVOLVED IN ANY NEGOTIATIONS. SCARLET: REALLY APPRECIATE YOU JOINING US. SID PHILIP COVERING BOEING FROM BLOOMBERG NEWS. BOEING REPORTEDLY IN TALKS TO SELL UP TO 500 JETS TO CHINA. COMING UP, MORE ON THE RARE PROFIT MISS AT WALMART DRIVING SHARES LOWER, DOWN 4.5%. THIS IS BLOOMBERG. ♪ SCARLET: THIS IS \"BLOOMBERG MARKETS.\" I AM SCARLET FU. IT IS TIME FOR OUR STOCK OF THE HOUR. WE ARE WATCHING WALMART. SHARES ARE DROPPING IN THE WORST DAY SINCE MAY. THE RETAILERS SITES ARISE IN INSURANCE CLAIMS AS ONE FACTOR WEIGHING DOWN ON ITS BOTTOM LINE. FOR MORE, WE WANT TO BRING IN BRADLEY THOMAS AND EQUITY RESEARCH ANALYST AT KEYBANK CAPITAL MARKETS, OVERWEIGHT RANKING ON WALMART. WHEN WE LOOK AT THE WALMART NUMBER, THE EARNINGS MISSED, FIRST PROFIT MISSED IN THREE YEARS. REVENUE BEAT, AND THE OUTLOOK IS ROBUST AS WELL. IS IT SAFE TO SAY THIS IS A ONE-OFF AND IT WON'T BE REPEATED THE FOLLOWING QUARTER? > > THAT'S EXACTLY RIGHT, SCARLET. THAT IS OUR TAKE ON THIS. THE MISS HERE IN THE QUARTER IS ASSOCIATED WITH THIS ONE-OFF GENERAL LIABILITY CLAIM. WALMART IS SEEING FEWER PEOPLE MAKE A CLAIMS, BUT UNFORTUNATELY, WHEN THEY END UP BEING SETTLED, IT IS FOR MORE MATERIAL AMOUNT. THAT TOOK FOUR CENTS OR FIVE CENTS OUT OF EARNINGS THIS QUARTER. IT IS MORE UNIQUE AND YOU PEEL THINGS BACK AND LOOK AT THE UNDERLYING BUSINESS, A TREMENDOUS QUARTER OTHERWISE THAT I WOULD LOVE TO TELL YOU MORE ABOUT. SCARLET: LET'S TALK ABOUT THE NUMBERS UNDERNEATH. COMP SALES IN THE UNITED STATES ROSE 4.6%. HOW SUSTAINABLE ARE THESE INCREASES? BRADLEY: WE THINK IT IS VERY SUSTAINABLE. WE THINK THAT WALMART IS STILL IN THE EARLY INNINGS OF AMERICA REALIZING JUST HOW MUCH TIME AND MONEY COULD BE SAVED BY ADOPTING SHOPPING ON WALMART FROM AN E-COMMERCE PERSPECTIVE. I THINK THE NUMBERS ARE PARTICULARLY PRESENT WHEN YOU LOOK AT WALMART'S E-COMMERCE GROWTH OF 26% THIS QUARTER, MORE THAN DOUBLE THE RATE THAT AMAZON IS DOING RIGHT NOW. A LOT OF THAT IS COMING IN GROCERY, WHERE THE GROUP -- GREW MID-SINGLE DIGITS, TWICE THE RATE OF THE GROCERY INDUSTRY, BUT ALSO STRENGTHEN GENERAL MERCHANDISE, BOTH FROM THE GROWTH IN E-COMMERCE OVERALL AND SOME OF THE INITIATIVES THEY HAD TO EXPAND AND ENHANCE THEIR OFFERING. SCARLET: I GET WHY YOU ARE SAYING THAT THE UNDERLYING FUNDAMENTALS LOOK PRETTY GOOD. IN TERMS OF ITS GUIDANCE FOR THE FULL YEAR, IT RAISED ITS FULL-YEAR FORECAST, BUT I WONDER HOW CONSERVATIVE WALMART TENDS TO BE IN ITS OUTLOOK. WHEN IT SAYS IT SEES SALES RISING TO 4.75%, WHAT DO YOU THINK IT IS CAPABLE OF DELIVERING? IS IT BEYOND THAT, JUST KIND OF AIMING THE BAR PRETTY LOW? BRADLEY: WE THINK THAT A GOOD FOR THE COMPANY GOING FORWARD IS IN THE 4% RANGE, GIVE OR TAKE, DEPENDING ON IDIOSYNCRASIES OF ANY GIVEN QUARTER. WHAT IS INTERESTING IS THAT THE E-COMMERCE BUSINESS IS ABOUT 20% OF SALES. IT SHOULD CONTINUE TO GROW OVER 20%, AND THAT GETS YOU HALFWAY THERE FROM THAT MOMENTUM. WHAT IS GOING TO BE INTERESTING TO WATCH IN THE MONTHS AHEAD IS HOW MUCH PRICES CONTINUE TO TRICKLE UP BECAUSE OF TARIFFS. THE GOOD NEWS IS THAT BACK-TO-SCHOOL IS OFF TO A GOOD START SO FAR. THAT BODES WELL FOR THE HOLIDAY SEASON. BUT WE ARE LIKELY TO SEE FURTHER INCREASES IN PRICES BECAUSE JUST THE TIMING OF TARIFFS. SCARLET: THAT IS SOMETHING TO KEEP AN EYE ON FOR SURE. THE CFO MADE A COMMENT THAT WE ARE PLAYING OFFENSE. IS THERE ANY PART WHERE WALMART IS PLAYING DEFENSE? BRADLEY: THAT'S A GOOD QUESTION. WITH RESPECT TO THE OFFENSE, THEY HAVE HAD THIS WONDERFUL AD CAMPAIGN WITH WALTEON GOGGINS THAT IS HEALTH AWARENESS. ON THE DEFENSIVE SIDE OF THINGS, I DON'T KNOW IF I WOULD CHARACTERIZE IT AS DEFENSE, BUT AN AREA WE ARE WATCHING CLOSELY IS AMAZON'S CONTINUED INVESTMENT IN THE GROCERY BUSINESS. WALMART VERY MUCH HAS THE UPPER HAND AND IS INVESTING TREMENDOUSLY IN MANY WAYS FURTHER DISTANCE THEMSELVES FROM THE COMPETITION. BUT WE ARE WATCHING AMAZON CLOSELY AS THEY HAVE MADE ANNOUNCEMENTS ABOUT WANTING TO EXPAND THEIR OFFERING ON THE GROCERY SIDE OF THINGS. SCARLET: IS THERE ANYONE SEGMENT OF THE MARKET WHERE IT NEEDS TO DO MORE TO GROW ITS MARKET SHARE, OR IS IT HITTING ON ALL CYLINDERS? BRADLEY: WALMART HISTORICALLY HAS PERHAPS NOT BEEN AS STRONG IN GENERAL MERCHANDISE AS IT HAD BEEN IN GROCERY AND CONSUMER STAPLES. WE THINK WITH THE SUCCESS OF WALMART+ AND THE GROWTH IN HIGHER-INCOME HOUSEHOLDS, WHICH YOU ARE SEEING DRIVE THOSE RESULTS OF WALMART OF LATE, WE THINK THERE IS A BIG OPPORTUNITY TO CONTINUE TO ENHANCE THE GENERAL MERCHANDISE OFFERING. THAT WAS A BRIGHT SPOT FOR THE QUARTER, ACCELERATED FROM LAST QUARTER, AFTER A NUMBER OF YEARS THAT HAVE BEEN CHALLENGING SINCE THE PANDEMIC. WE THINK THAT BODES REALLY WELL FOR WALMART AS WELL. SCARLET: BRADLEY THOMAS OF KEYBANK CAPITAL MARKETS, THE TAKEAWAYS LOOK PAST THE SECOND-QUARTER NUMBERS. COMING UP, FAST CASUAL FOOD CHAINS ARE FEELING THE SQUEEZE, BUT COULD B'S AND CHEESECAKE FACTORY -- MAKE A COMEBACK? WE’LL BRING YOU ALL THE DETAILS NEXT. THIS IS BLOOMBERG. ♪ SCARLET: INFLATION AND ECONOMIC WORRIES ARE WEIGHING ON SPENDING AND THAT IS SHOWING UP IN ONE'S HOT FAST CASUAL CHAINS LIKE CHIPOTLE AND SWEET GREEN. AT THE SAME TIME, CHAINS LIKE APPLEBEE'S AND CHEESECAKE FACTORY ARE SEEING A RESURGENCE. OTHER PEOPLE WERE TRYING TO SAVE MONEY. > > PEOPLE ARE TRYING TO SAVE MONEY, BUT SOME CHAINS LIKE SWEET GREEN AND CHIPOTLE ARE HAVING A HARD TIME COMMUNICATING TO PEOPLE WHY THE MEALS ARE A GOOD DEAL. YOU CAN STILL GET A CHIPOTLE BOWL IN PARTS OF THE COUNTRY FOR AN AVERAGE OF $10. YOU WILL SPEND MORE IF YOU GO TO CHILI'S. BUT CHILI'S AND APPLEBEE'S HAVE DONE A GOOD JOB OF ATTACKING FAST FOOD AND SAYING THAT FOR A KIND OF THE SAME PRICE WE CAN -- FOR A PRICE YOU CAN ENJOY QUALITY AND A SKINNY MARGARITA ON THE SITE. SCARLET: IT IS THE PERCEPTION OF VALUE. HOW ARE THE FAST CASUAL CHAINS RESPONDING? DANIELA: THEY ARE STARTING TO RESPOND. SWEET GREEN STARTED LUNCHING WHAT THEY CALLED $13 BOWL DROPS, SLIGHTLY LOWER PRICE THAN NORMALLY WHAT YOU SEE ON THE MENU. THEY HAVE A LOYALTY PROGRAM THAT HAS SOME DISCOUNTS. THAT WAS ONE OF THE POINTS THAT CAME UP DURING THE CHIPOTLE RECENT EARNINGS, THAT THEY ARE TRYING TO FIGURE OUT HOW TO TELL PEOPLE THAT YOU CAN STILL GET A CHICKEN BALL FOR $10, WHICH IS ON AN ABSOLUTE BASIS NOT THAT HIGHER PRICE. THE THING IS THOSE CHAINS DON'T DISCOUNT A LOT AND THEY DON'T WANT TO PUT OUT THOSE FLASHY SPECIFIC PRICE POINTS TO DRAW PEOPLE IN, BECAUSE THEY THINK IT DEVALUES THE BRAND. THEY ARE IN A TOUGH SPOT RIGHT NOW. SCARLET: THEY CERTAINLY ARE. THEY HAVE TO CONVINCE NOT JUST CUSTOMERS, BUT THE STOCK MARKET AS WELL. REALLY APPRECIATE YOU JOINING US. ANOTHER STORY I'M WATCHING IS ROBINHOOD SAYING THEY ARE ADDING PRO AND COLLEGE FOOTBALL CONTRACTS TO ITS PREDICTION MARKETS. AT THE SAME TIME, THIS WEEK WE HEARD FANDUEL IS DIGGING UP WITH THE CHICAGO MERCANTILE EXCHANGE TO OFFER BETS ON STOCKS, COMMODITY PRICES, AND ECONOMIC INDICATORS, BLURRING THE LINES BETWEEN SPORTS BETTING AND EQUITY TRADING OR COMMODITIES TRADING. KATHERINE DOHERTY JOINS US FOR MORE. IS THERE EVEN A LINE ANYMORE? THEY ARE KIND OF ONE AND THE SAME AND THE PLATFORMS ARE ENCOURAGING THIS. > > I DO THINK THERE ARE LINES, BUT THIS IS AN INTERSECTION OF MAIN STREET AND WALL STREET. THESE PRODUCTION MARKETS, THESE PRODUCTS THEY'RE OFFERING THE FANDUEL CUSTOMER BASE, ARE ALL TIED TO FINANCIAL MARKETS. IT IS NOT YET ABOUT SPORTS BETTING. WHAT IS GOING TO BE INTERESTING IS HOW THE MARKET THAT TO THEIR CUSTOMER BASE. WHEN YOU THINK OF FANDUEL AND THE WAY THAT THEY HAVE CAPTURED SUCH A LARGE PART OF THE RETAIL CUSTOMER BASE, THAT IS WHAT CME, WHICH IS A LARGE EXCHANGE OPERATOR THAT HAS APPEALED TO COURT WALL STREET BIG INSTITUTIONAL PLAYERS WITH MILLIONS OF DOLLARS THAT THEY ARE PLACING THAT'S ON IN FORM OF FUTURE TRADING OPTIONS, CME AS BEEN MAKING A PUSH TO APPEAL TO THE BROADER RETAIL BASE. THAT IS WHY THIS PARTNERSHIP IS SUCH A SIGNIFICANT MOVE IN THAT DIRECTION. THEY ARE GOING TO BE THROUGH THIS PARTNERSHIP REACHING THE FANDUEL CUSTOMER BASE, AND THAT COULD IN TURN BRING MORE RETAIL CUSTOMERS TO THE PLATFORM. SCARLET: THE IDEA IS DEMOCRATIZING ACCESS TO FINANCIAL MARKETS, MEETING FOLKS WHERE THEY ARE. IF THEY ARE IN THE FANDUEL ECOSYSTEM, BRING IT TO THEM AND BROADEN OUT CUSTOMER BASE. LET'S TALK ABOUT ROBINHOOD, WHICH IS ADDING PRO AND COLLEGE FOOTBALL CONTRACT TO PRODUCTION MARKETS. IS THIS NOT JUST SPORTS BETTING -- SPORTS GAMBLING, I SHOULD SAY -- ON ROBINHOOD'S PLATFORM? KATHERINE: THE BIG QUESTION BEING ASKED IN THE INDUSTRY, AND WHEN YOU HAVE A REGULATED PLATFORM LIKE CME, THAT HAS THE CFTC WATCHING, THEY HAVE TO ABIDE BY REGULATION OUT THERE. THE TRICKY PART THAT FIRMS ARE HAVING TO NAVIGATE, INCLUDING CME,'S WITH SPORTS BETTING IN PARTICULAR THAT IS STATE-BY-STATE LEGISLATION THAT YOU ARE HAVING TO FIGURE OUT. AND SO WITH THESE PRODUCTION MARKETS, AND ESPECIALLY WITH THIS ANNOUNCEMENT, WHAT IS SIGNIFICANT WITH CME AND FANDUEL IS THEY ARE NOT TALKING ABOUT SPORTS BETTING AT. ROBINHOOD, YES, THEY ARE GETTING INTO THAT. BUT THEY ARE NOT IN EXCHANGE OPERATOR LIKE CME IS. THE NEXT QUESTION WILL BE DOES CME EVENTUALLY ENTER INTO THAT SAME SPORTS BETTING MARKETPLACE. BUT RIGHT NOW THE PRODUCTS THEY ARE OFFERING, SIMPLE YES, NO TYPE OF QUESTIONS THEY ARE GOING TO BE ASKING ON THE FANDUEL PLATFORM. THE BETS THAT CUSTOMERS CAN PLACE OUR AS LITTLE AS ONE DOLLAR. THAT IS MUCH DIFFERENT THAN IF YOU ARE TRADING IN THE FUTURES MARKET AND YOU ARE PLAYING AROUND WITH THOUSANDS, MILLIONS OF DOLLARS A DAY THAT A CUSTOMER BASE THAT CAN PLACE A BET FOR A DOLLAR, THAT IS GOING TO APPEAL TO THEM, AND IT IS GOING TO BE A NEW CUSTOMER BASE THAT CME HAS NOT YET REACHED IN THIS WAY. SCARLET: I CAN ONLY IMAGINE THE PROMOTIONS, THE CROSS PROMOTIONS THE INCENTIVES OFFERED TO, FANDUEL USERS FROM THE CME. WHILE YOU MAKE A BET ON THIS SPORTS TEAM -- THE BOSTON RED SOX IN YOUR CASE -- THAT'S DO SOMETHING ON THE S & P 500 FUTURES CONTRACT. KATHERINE: CME HAS BEEN MARKETING QUITE A LOT INTO THE SPORTS ARENAS AS WELL. SCARLET: KATHERINE DOHERTY, THANK YOU SO MUCH. I'M SCARLET FU, AND THAT DOES IT FOR \"BLOOMBERG MARKETS.\" \"BALANCE OF POWER\" IS UP NEXT.",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "MORE LABOR MARKET NUMBERS",
      "weight": 0.057393163
    },
    {
      "name": "LABOR MARKET",
      "weight": 0.04993933
    },
    {
      "name": "BLOOMBERG MARKETS",
      "weight": 0.048961706
    },
    {
      "name": "FINANCIAL MARKETS",
      "weight": 0.047679417
    },
    {
      "name": "HIGH PRICES",
      "weight": 0.047445126
    },
    {
      "name": "HIGHER PRICES",
      "weight": 0.047445126
    },
    {
      "name": "MORE INFLATION DATA",
      "weight": 0.047430657
    },
    {
      "name": "MORE INFLATION",
      "weight": 0.04724938
    },
    {
      "name": "MARKET ACCESS",
      "weight": 0.04713019
    },
    {
      "name": "MORE PRESSURE",
      "weight": 0.046212163
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.9931640625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.8896484375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.86279296875
    },
    {
      "name": "/News/Other",
      "score": 0.7890625
    },
    {
      "name": "/News/Local News",
      "score": 0.77880859375
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.650390625
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.63525390625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.439208984375
    },
    {
      "name": "/News/Gossip & Tabloid News/Scandals & Investigations",
      "score": 0.429931640625
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.305908203125
    }
  ],
  "sentiment": {
    "positive": 0.04177979,
    "negative": 0.8306088,
    "neutral": 0.12761143
  },
  "summary": "The Trump administration is pushing for an overhaul of the FEDERAL RESERVE BOARD, pushing for this as part of a broader effort to lower the inflation rate and lower prices. The DOJ has urged Federal Reserve Chairman Richard Powell to remove Lisa Cook from the board, which she insists she will not. The big issue is the ongoing pressure on Cook over her mortgage accounts and the perceived devaluation of her assets. The article discusses the potential impact of this pressure on the Federal Reserve on the economy and on the public and private sectors. It also discusses the implications of a potential tax cut in the future of the Fed, with ED MARTIN urging Congress to address this issue.",
  "shortSummary": "The DOJ urges Fed Chairman Powell to remove Lisa Cook from the FEDERAL RESERVE board amid market pressure, with S&P 500 down.4%, amid ongoing economic concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d16da8922ee843a09e906a693bc583f8",
  "places": [
    {
      "osmId": "10894031",
      "road": "Wall Street",
      "city": "Jacksonville",
      "county": "Duval County",
      "state": "Florida",
      "postcode": "32204",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 30.3427883,
        "lon": -81.6943731
      }
    },
    {
      "osmId": "1492556",
      "state": "Wyoming",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 43.684017,
        "lon": -110.44366292631179
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "The transcript covers a wide range of current economic and business news. It discusses the EU’s ongoing trade negotiations with the US, highlighting the EU’s push for a comprehensive trade framework and the importance of aircraft deals like Boeing’s potential sale of up to 500 jets to China. It also covers the US-China trade deal’s impact on Boeing and the broader trade relationship. The Walmart earnings miss is attributed to a one‑off liability claim, with analysts noting strong underlying fundamentals and a robust e‑commerce growth trajectory. Fast casual chains such as Chipotle and Sweet Green face value perception challenges amid inflation, while Applebee’s and Cheesecake Factory see a resurgence. The conversation shifts to the blurring lines between sports betting and financial markets, with FanDuel partnering with CME to offer retail customers access to futures contracts and Robinhood adding pro and college football contracts to its prediction markets. The overall tone reflects the intersection of consumer behavior, regulatory considerations, and market dynamics in a rapidly evolving economic landscape.",
  "argos_id": "E6KMQNX7I"
}