{
  "url": "https://www.foxnews.com/politics/trump-tariffs-push-india-closer-americas-strategic-rivals-china-russia",
  "authorsByline": "Morgan Phillips",
  "articleId": "08f6b44fad154eaca72aefab08bb8caa",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/08/931/523/putin-modi-xi.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T08:42:33-04:00",
  "addDate": "2025-08-21T12:55:19.196449+00:00",
  "refreshDate": "2025-08-21T12:55:19.196451+00:00",
  "score": 1.0,
  "title": "Trump tariffs push India closer to America's strategic rivals China and Russia",
  "description": "India strengthens ties with Moscow and Beijing as US-India relationship faces its most serious test in years following disputes over Russian oil purchases.",
  "content": "For more than two decades, Washington and New Delhi built a strategic partnership that was hailed as one of the great success stories of post–Cold War diplomacy. Today, that relationship is facing its most serious test in years — and India is signaling it has other options.\n\n\"We’re in a situation in the U.S.–India relationship where the premises and assumptions of the last 25 years — that everybody worked very hard to build, including the president in his first term — have just come completely unraveled,\" said Evan Feigenbaum, a South Asia expert at the Carnegie Endowment for International Peace. \"The trust is gone.\"\n\nSince President Trump imposed sweeping tariffs on Indian imports, New Delhi has turned visibly eastward. India’s national security advisor traveled to Moscow in recent weeks, its foreign minister is visiting this week and Chinese Foreign Minister Wang Yi just concluded talks in Delhi. Prime Minister Narendra Modi is preparing for his first trip to China in more than seven years, while Russian President Vladimir Putin is expected to host him in Moscow before the end of the year.\n\nThe pivot underscores how tariffs meant to punish India for its continued purchases of Russian oil may instead be pushing New Delhi closer to America’s rivals.\n\nTRUMP AND PUTIN’S RELATIONSHIP TURNS SOUR AS PRESIDENT PUSHES FOR RESOLUTION WITH UKRAINE\n\nTrump slapped a 25% tariff on Indian imports earlier this year, citing India’s willingness to keep buying Russian crude. On August 27, that tariff is set to double to 50%.\n\nIndian public opinion has bristled at what many see as U.S. interference in sovereign decision-making. \"They’re signaling very clearly that they view that as interference in India’s foreign policy, and they are not going to put up with it,\" Feigenbaum said.\n\nDespite initial hesitation, state-run refiners resumed Russian oil purchases, lured by discounts of 6–7%. Russian oil now accounts for 35% of India’s imports, up from a negligible 0.2% before the Ukraine war. Moscow, for its part, has seized the opening. \"We continue to ship fuel, including crude oil and oil products, thermal and coking coal,\" said Russian First Deputy Prime Minister Denis Manturov. \"We see potential for the export of Russian LNG.\"\n\nTRUMP’S DEADLINE ON SECONDARY TARIFFS ARRIVES; US-RUSSIAN RELATIONS HANG IN THE BALANCE\n\nRussia is using the rift to promote its vision of a \"great Eurasian partnership\" linking Moscow, Beijing and Delhi.\n\n\"All of this engagement we’re seeing between India and China now is not exclusively coming because of Trump and his tariffs,\" said Michael Kugelman, a Washington-based South Asia analyst. \"We’ve actually seen indications for almost a year of India wanting to ease tensions with China and strengthen relations, mainly for economic reasons. But the Trump administration’s policies have made India want to move even more quickly.\"\n\nSome of India’s moves are diplomatic theater meant to signal anger at Washington. But others are more durable. \"India is going to double down on some aspects of its economic and defense relationship with Russia,\" Feigenbaum said. \"And those parts are not performative.\"\n\nKugelman noted that before the Ukraine war, India had already begun reducing its reliance on Russian arms imports in favor of U.S., French and Israeli systems. \"But as soon as the invasion happened, India very quickly started buying more from Russia, particularly energy,\" he said. \"This is essentially validation of a view in India that the U.S. can’t be trusted, whereas Russia can — because Russia is always going to be there for India no matter what.\"\n\nModi has used the standoff to reinforce his image at home as a defender of sovereignty. \"India actually made a fair number of concessions to the Trump administration early on in its second term,\" Kugelman said, citing tariff reductions and agreements to repatriate undocumented workers. \"Because of those concessions, India needs to be careful about signaling further willingness to bend. This is one reason there was no trade deal — Modi put his foot down.\"\n\nWhile not directly criticizing Trump, Modi has emphasized that his priority is protecting the livelihoods of farmers, small businesses and young workers. That defiant tone, Kugelman added, has \"real political mileage\" in India’s domestic debate.\n\nThe Trump administration has shown no signs of backing down. Former White House trade advisor Peter Navarro blasted India’s oil purchases as \"opportunistic\" and \"deeply corrosive\" in a Financial Times op-ed this week.\n\n\"This two-pronged policy will hit India where it hurts — its access to U.S. markets — even as it seeks to cut off the financial lifeline it has extended to Russia’s war effort,\" Navarro wrote. \"If India wants to be treated as a strategic partner of the U.S., it needs to start acting like one.\"\n\nINDIAN PRIME MINISTER MODI TAKES PAGE FROM TRUMP, SAYS 'MAKE INDIA GREAT AGAIN,' OR 'MIGA'\n\nThe contrast with the U.S.–India relationship of two decades ago could not be starker. In 2008, the two countries struck a landmark civil nuclear deal that gave India access to American technology and fuel despite not being a signatory to the Non-Proliferation Treaty.\n\n\"India put the entire government on the line for the deal,\" Feigenbaum recalled. \"Bush really went to the mat and provided a lot of assurances to Congress that were politically not easy, but he was willing to take risks for the relationship.\"\n\nAt that time, Washington and Delhi managed to work around their disagreements. \"The U.S. objected to many aspects of India’s relationships with Iran, Burma and Russia,\" Feigenbaum said. \"India objected to aspects of the U.S. relationships with China and Pakistan. But neither side let that bleed back into the bilateral relationship in a completely debilitating way.\"\n\nFor years, the U.S. has viewed India as a democratic counterweight to China’s authoritarian model — central to its Indo-Pacific strategy under Obama, Trump and Biden. But now the question is whether that glue still holds.\n\n\"Both sides agree that countering China is the main glue that has really bound this relationship together over this 20-year period,\" Kugelman said. \"But the tensions, most of which are on the trade side, have begun to spill over into the broader partnership.\"\n\nHe noted that India will continue to see China as a long-term competitor because of border disputes and Beijing’s alliance with Pakistan. \"Those realities make it hard to imagine India no longer seeing China as a threat,\" he said. \"So the rationale for the Quad remains. But if the U.S.–India relationship continues this free fall, it will be very difficult to sustain.\"\n\nTalks on new defense cooperation are still on the calendar. But for now, Kugelman warned, trust has eroded: \"You talk about defense cooperation, intelligence sharing — that requires a lot of trust. And given what’s happened over the last few months, that might be a harder sell for the Indians.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nFeigenbaum sees India’s latest maneuvers as a reversal of past dynamics. \"Then, India was leveraging its partnership to signal to then-foe China that it had options,\" he said. \"Now they’re working with the Chinese to signal Washington rather than the other way around.\"\n\nThe message is clear: India will pursue its interests on its own terms, even if that means drawing closer to America’s rivals.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/politics/trump-putins-relationship-turns-sour-president-pushes-resolution-ukraine",
    "https://www.foxnews.com/video/6377101654112",
    "https://www.foxnews.com/world/trumps-deadline-secondary-tariffs-arrives-us-russia-relations-hang-balance",
    "https://www.foxnews.com/category/world/personalities/vladimir-putin",
    "https://www.foxnews.com/category/world/world-regions/india",
    "https://www.foxnews.com/apps-products",
    "https://www.foxbusiness.com/economy/trump-advisor-navarro-says-india-must-stop-buying-russian-oil",
    "https://www.foxnews.com/politics/indian-pm-modi-takes-page-trump-says-make-india-great-again-miga",
    "https://www.foxnews.com/video/6376649551112"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "India",
      "weight": 0.091184646
    },
    {
      "name": "Russian oil purchases",
      "weight": 0.06732742
    },
    {
      "name": "Russian oil",
      "weight": 0.06644388
    },
    {
      "name": "Trump tariffs",
      "weight": 0.066193074
    },
    {
      "name": "Russian arms imports",
      "weight": 0.059622835
    },
    {
      "name": "China",
      "weight": 0.057970013
    },
    {
      "name": "India’s relationships",
      "weight": 0.0546362
    },
    {
      "name": "Russian",
      "weight": 0.054559894
    },
    {
      "name": "India’s oil purchases",
      "weight": 0.05452718
    },
    {
      "name": "Russian President Vladimir Putin",
      "weight": 0.054113116
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9853515625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.97509765625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.916015625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.69091796875
    },
    {
      "name": "/News/World News",
      "score": 0.59375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.471435546875
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.37548828125
    }
  ],
  "sentiment": {
    "positive": 0.3128917,
    "negative": 0.39587033,
    "neutral": 0.29123804
  },
  "summary": "The US and India's strategic partnership, once a success story, is under a serious test as President Trump imposes sweeping tariffs on Indian imports. The tariffs were intended to punish India for its continued purchases of Russian oil, but may instead be pushing New Delhi closer to America's strategic rivals. Since the tariffs were imposed, India's national security advisor and foreign minister have visited Moscow, and Chinese Foreign Minister Wang Yi recently concluded talks in Delhi. This comes as Prime Minister Narendra Modi prepares for his first trip to China in over seven years. The rift between the two countries is being used to promote Russia's vision of a \"great Eurasian partnership\" linking Moscow, Beijing and Delhi. Despite India’s public opposition, Russia has seized the opportunity to ship fuel, including crude oil and oil products.",
  "shortSummary": "The Trump tariffs have led India to shift closer to China and Russia, reflecting a deteriorating strategic partnership with Washington.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "012ae13129f04aadaff4cc70a98dbdfb",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/politics/indian-pm-modi-takes-page-trump-says-make-india-great-again-miga",
      "text": "Indian Prime Minister Narendra Modi took a page from President Donald Trump's playbook during a joint press conference Thursday, saying he wants to make India great again, or \"MIGA.\"\nModi met with Trump at the White House, where the world leaders discussed a range of issues, including trade, the economic relationship between India and the United States and military sales.\nDuring a press conference, Modi said Indian people were focusing on their heritage and ways to ensure his nation is developed by 2047.\nINDIA'S MODI SPEAKS WITH 'DEAR FRIEND' PRESIDENT TRUMP AMID HOPES OF FURTHERING TIES\n\"Borrowing an expression from America, our vision for a developed India is to make India great again, or MIGA,\" he said through a translator. \"When America and India work together, that is, when it's MAGA plus MIGA, it becomes a mega partnership for prosperity.\n\"And it is this mega spirit that gives new scale and scope to our objectives.\"\nTRUMP'S TARIFF THREATS GO BEYOND 'TRADE AGREEMENT' TO ADVANCE AMERICAN INTERESTS: EXPERT\nAt the beginning of the press conference, Trump announced the United States would be providing India F-35 fighter jets and increasing military sales to the country by billions of dollars.\nTrump also said his administration approved the extradition of Tahawwur Rana, a Canadian citizen of Pakistani origin, one of the plotters of a deadly 2008 terrorist attack that killed 160 people.\n\"I'm pleased to announce that my administration has approved the extradition of one of the plotters and one of the very evil people of the world having to do with the horrific 2008 Mumbai terrorist attack to face justice in India,\" Trump said.\nIn addition, Modi said India would accept illegal Indian immigrants in the United States who are deported back home.\nCLICK HERE TO GET THE FOX NEWS APP\n\"Anybody who enters another country illegally,\" Modi said, \"they have absolutely no right to be in that country.\n\"And as far as India and the U.S. is concerned, we have always been of the same opinion. And that is that any verified Indian who is in the U.S. illegally, we are fully prepared to take them back to India.\""
    },
    {
      "url": "https://www.foxnews.com/apps-products",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/category/world/personalities/vladimir-putin",
      "text": "Media 18 hours ago Chuck Todd argues Putin made a 'huge miscalculation' by not giving Trump a 'win' at Alaska summit Former NBC host Chuck Todd argued that Russian President Vladimir Putin made a \"huge miscalculation\" by not giving President Donald Trump a win during the Alaska peace summit.\nUkraine 18 hours ago Ukraine’s stolen children crisis looms large as NATO meets on Russia’s war Ukrainian officials say more than 19,000 children have been unlawfully deported to Russia or occupied areas, with reports suggesting the number could be far higher.\nNATO 23 hours ago NATO scrambles warplanes as Russia hits near Romanian border in Ukraine NATO aircraft scrambled from Romania following a large-scale Russian attack on across Ukraine overnight, including in the Odesa region near Danube River border with allied nation.\nMedia 1 day ago 'The View' co-host Ana Navarro rips Melania Trump's Putin letter as 'so hypocritical you can't believe it' Ana Navarro of \"The View\" claimed first lady Melania Trump was a hypocrite for writing a “peace letter\" to Russian President Vladimir Putin while ignoring her husband.\nMedia Buzz 1 day ago Trump slams mail-in ballots as corrupt, but may not have the power to derail them Trump, citing Putin, vowed to end mail-in ballots with an executive order, despite both the facts and the Constitution’s limits on his power.\nRussia 1 day ago Russia launches largest attack on Ukraine this month following Trump's meetings with Putin, Zelenskyy Russia launched its largest attack of the month against Ukraine while Ukrainian President Volodymyr Zelenskyy met with U.S. President Donald Trump and European leaders.\nU.S. Defense & Military Politics 1 day ago Joint Chiefs, NATO counterparts to discuss Ukraine security guarantees after Trump suggests US air support Fox News confirmed that Gen. Dan Caine will be hosting military counterparts from Europe on Tuesday evening to discuss Ukrainian security guarantees.\nRussia 1 day ago Trump’s push for Putin-Zelenskyy talks hinges on Kremlin's conditions A Russia expert warns Putin views a potential Zelenskyy meeting as theater to show Russian greatness rather than genuine diplomacy for Ukraine peace talks.\nWhite House 1 day ago White House rejects ‘blank checks’ for Ukraine, presses NATO to shoulder costs The White House said Tuesday that President Donald Trump wants to respect the American taxpayer, and isn't interested in writing \"blank checks\" to support Ukraine.\nRussia 1 day ago White House announces Putin agreed to bilateral meeting with Zelenskyy Russian President Vladimir Putin has agreed to a bilateral meeting with Ukrainian President Volodymyr Zelenskyy, White House press secretary Karoline Leavitt announced Tuesday.\nUkraine 2 days ago Trump calls White House talks 'very good, early step' toward Russia-Ukraine peace: Here's what's next President Trump describes Ukraine peace talks as 'very good early step' following discussions with Zelenskyy and European leaders on security guarantees.\nOpinion 2 days ago MORNING GLORY: Can President Trump deliver a ceasefire or even a peace agreement between Russia and Ukraine? Analysis of recent Trump-Putin-Zelensky diplomatic meetings emphasizes the limits of media knowledge and warns against reporters claiming inside information about private negotiations.\nUkraine 2 days ago Russia’s Medvedev says Europe’s ‘coalition of the willing’ failed to outplay Trump after Zelenskyy meeting Former Russian President Dmitry Medvedev taunted European leaders early Monday, accusing them of having \"failed to outplay\" U.S. President Donald Trump.\nMedia Buzz 2 days ago Zelenskyy agrees to Trump-Putin meeting without cease-fire, but will Kremlin dictator go along? President Trump's changed stance on Ukraine war negotiations raises questions about Putin's willingness to make concessions in potential peace talks.\nVladimir Putin 2 days ago Trump moves to broker Putin-Zelenskyy meeting following DC peace talks President Trump announces plans for trilateral meeting with Putin and Zelenskyy after the pair meet one-on-one following Monday's peace talks with Europeans from the White House.\nUkraine 2 days ago Trump hails US war tech as key to Ukraine’s defense in meeting with Zelenskyy President Donald Trump emphasized that, during his administration, U.S. policy has focused on selling military technology to European allies instead of directly financing weapons packages.\nDonald Trump 2 days ago Trump spars with European leader during Ukraine talks over key step to peace German Chancellor Merz broke with the generally optimistic tone at the European leaders meeting at the White House on Monday, stating a ceasefire is necessary for peace.\nUkraine 2 days ago Russian drone strikes kill 7 in Kharkiv during Zelenskyy's White House meeting with Trump Ukraine suffers deadly Russian drone attacks on Kharkiv and Zaporizhzhia during Zelenskyy's Washington visit, with children among the reported casualties.\nWhite House 2 days ago Trump: Zelenskyy meeting not 'end of the road' for US support in securing a peace deal President Donald Trump said Monday that his meeting with Ukrainian President Volodymyr Zelenskyy isn't the last attempt to secure a peace deal.\nRussia 2 days ago EU preparing 19th round of Russia sanctions as Zelenskyy meets Trump EU maintains economic pressure on Russia with upcoming sanctions package while Ukrainian President Zelenskyy seeks Western support for Ukraine at White House meeting.\nWhite House 2 days ago Flashback: What happened the previous time Zelenskyy met with Trump in the Oval Office Ukrainian President Zelenskyy returns to the White House Monday with European leaders after Trump's meeting with Putin, following February's tense diplomatic exchange.\nDonald Trump 3 days ago Trump blasts 'lightweight' Dem senator who criticized Putin summit in Alaska: 'Stupid' President Trump blasted Democrat Sen. Chris Murphy, of Connecticut, as a \"lightweight,\" calling the lawmaker \"unattractive\" and \"stupid,\" after he criticized the Trump-Putin summit.\nUkraine 3 days ago Zelenskyy heads into crucial Trump meeting as US weighs security guarantees for Kyiv Ukraine's Zelenskyy rejects proposals related to territorial concessions to Russia ahead of crucial White House meeting with President Donald Trump and key European allies.\nVolodymyr Zelenskyy 3 days ago 'Our position is clear:' Zelenskyy and EU dismiss ceding Ukrainian land to Russia Ukraine's Zelenskyy says constitution prevents territorial surrender to Russia as international leaders discuss potential peace negotiations with Moscow.\nFox News Flash 3 days ago Rubio shoots down report that Trump backs Putin’s plan for Russia to control Ukraine’s Donbas region Marco Rubio clarifies that Ukrainian President Zelenskyy will decide on territorial issues in peace talks, not Trump, following reports concerning Donbas control.\nDonald Trump 3 days ago Pence says Trump needs to bring the 'hammer' down on Putin with immediate new sanctions Mike Pence calls for Donald Trump to demand secondary sanctions on Russia after Alaska summit shifts focus from Ukraine ceasefire to broader peace deal.\nVladimir Putin 3 days ago Trump envoy says Putin made 'robust' concessions during Alaska meeting talks on Ukraine President Donald Trump shifted focus from a Ukraine ceasefire toward a more comprehensive peace deal following his Alaska meeting with Russian President Vladimir Putin, according to Special Envoy Witkoff.\nRussia 4 days ago Putin demands control of key Ukrainian territory in exchange for peace: European diplomat President Donald Trump supports Russian leader Vladimir Putin's proposal for Moscow to take full control of the Donbas and freeze the front lines elsewhere for a deal with Ukraine.\nEurope 4 days ago European 'coalition of the willing' forms united front as Trump pushes Putin-Zelenskyy summit European leaders in a \"coalition of the willing\" are meeting to project unity in response to Putin’s demands at his summit with Trump ahead of Zelenskyy’s Washington visit.\nMelania Trump 4 days ago First Lady Melania Trump’s ‘peace letter’ to Putin: ‘It is time’ EXCLUSIVE: First Lady Melania Trump wrote a “peace letter\" to Russian President Vladimir Putin telling him “it is time\" to protect children and future generations around the globe, Fox News Digital has learned."
    },
    {
      "url": "https://www.foxnews.com/world/trumps-deadline-secondary-tariffs-arrives-us-russia-relations-hang-balance",
      "text": "President Donald Trump is preparing to announce new secondary tariffs Friday on nations who conduct trade with Russia amid its deadly war in Ukraine.\nThe White House has remained tight-lipped on what those tariffs will look like after the president first said in July they would amount to \"100%\" tariffs before causing confusion earlier this week when he told reporters he \"never said a percentage.\"\nWhile the specifics of what tax rates nations that trade with Russia could face remain unclear, Trump’s change in posture toward Russian President Vladimir Putin has become increasingly evident.\nFROM TALK TO TACTICS: TRUMP PIVOTS ON RUSSIA STRATEGY TO END WAR\n\"Trump's frustrated that the Russians have not taken advantage of his patience and generous offers, but it's very interesting that even after Trump announced he was moving submarines, and even after he announced the tough tariffs, the Russians still want to talk to him,\" Fred Fleitz, who served as a deputy assistant to Trump and chief of staff of the National Security Council during the president’s first term, told Fox News Digital.\n\"Putin does not want to anger Trump,\" he added. \"Putin never worried about angering Biden, and I think that this shows a degree of respect.\n\"It shows what Trump has achieved by exercising leadership on the global stage. And we'll see what happens,\" Fleitz said, adding he hoped it was not merely a stalling tactic by Putin.\nTrump’s return to the White House brought with it a sense of shock as he appeared to distance Washington from its top allies in Europe in favor of attempting to improve diplomatic relations with Putin, culminating in the infamous Oval Office showdown with Ukrainian President Volodymyr Zelenskyy in February.\nWhile the tussle brought renewed support from his top MAGA base, who favor ending U.S. involvement in foreign wars, it prompted concern among security experts. Ultimately, Trump’s patience with Putin began to shift, with the president consistently expressing his frustration at the Kremlin chief’s continued brutal attacks in Ukraine.\nIn mid-July, while sitting next to NATO Secretary General Mark Rutte, Trump announced Putin had 50 days to enter into a ceasefire or face \"very severe\" tariffs that would affect Moscow's top commodity, oil.\nZELENSKYY TELLS PUTIN TO 'BE BRAVE' AND FINALLY AGREE TO TRILATERAL MEETING WITH TRUMP\n\"Tariffs at about 100%, you'd call them secondary tariffs,\" he had said, indicating that nations that trade with Russia will see 100% tariffs slapped on them when trading with the U.S.\nThis would most greatly affect China and India, according to data released by the U.S. government Thursday, which showed both nations account for 46% of all Russian oil purchases in 2025.\nBut the U.S. is also the No. 1 export market for both China and India, which means higher price tags at the checkout line on their products will make Americans think twice before completing those purchases.\nAfter ongoing trade negotiations with both nations and Putin’s continued war effort in Ukraine, Trump last week pushed up his deadline to within 10 days of July 29, forcing a new deadline of Friday.\nBut while his promised tariffs were met with applause by some in the GOP, including Sen. Lindsey Graham, R-S.C. — he, along with Sen. Richard Blumenthal, D-C.T., is pushing the charge for 500% sanctions on Russia — other Republican members have not backed the move.\nSen. Rand Paul, R-Ky., has been outspoken against not only Trump’s tariffs but the bipartisan sanction push and argued to Fox Business’ Larry Kudlow this week that Trump’s tariffs on allies and foes alike will amount to $2 trillion in taxes for the American consumer.\nBut Fleitz pushed back on this argument and said he is not convinced that the tariffs will hurt the U.S. or Chinese economy, though Russia and India are likely to feel the pain.\n\"I think they're going to hurt the Russian and Indian economies,\" he said, noting that India could recover by buying oil elsewhere. Though some reporting has suggested that India may have saved over $30 billion by increasingly turning to Russian oil during 2022-2024 due to Moscow’s price cuts.\nTRUMP OPEN TO MEET PUTIN FACE-TO-FACE NEXT WEEK FOLLOWED BY THREE-WAY TALKS WITH UKRAINE'S ZELENSKYY\n\"It is going to be another factor that's going to pressure Putin to agree to a ceasefire. I don't know if that's going to happen immediately or in a few months, but I think it is going to put real pressure, inflict real pain on Russia,\" Fleitz said.\nOnce a staunch Trump ally, Rep. Marjorie Taylor Greene, R- Ga., took to X this week in response to a post by Trump that he would be enforcing tariffs on India for purchasing Russian oil and said, \"End Indian H1-B visas replacing American jobs instead and stop funding and sending weapons to the Obama/Biden/Neocon Ukraine Russia war.\"\nTrump’s favorable transition toward Ukraine and European allies has also ruffled some MAGA feathers, though security experts have argued it has given the president better leverage to take on major adversaries like Putin, and by extension, China.\nCLICK HERE TO GET THE FOX NEWS APP\n\"Diplomacy and negotiations are a good thing,\" said Fleitz, who serves as vice chair of the America First Policy Institute's Center for American Security. \"Peacemaking takes time, and the U.S.-Russia relationship was in a very bad situation when Trump came to office.\n\"I think these sanctions will hurt Russia very badly,\" Fleitz continued. \"The fact that Trump knows that secondary sanctions on India has, at least temporarily, hurt our relationship is really a remarkable sign of how committed Trump is to these sanctions.\n\"There's not going to be exceptions. It's not going to be some type of soft strategy with all kinds of loopholes,\" he added. \"I think it shows to Putin how serious Trump is, and it gives Trump leverage to negotiate with Putin.\""
    },
    {
      "url": "https://www.foxnews.com/politics/trump-putins-relationship-turns-sour-president-pushes-resolution-ukraine",
      "text": "While President Donald Trump previously refrained from speaking ill of Russian President Vladimir Putin, those days are over.\nThe ongoing war between Russia and Ukraine has changed the nature of their dynamic. Although the two appeared to get along, at least publicly, during Trump’s first administration, their relationship has unraveled as the more recent conflict persists.\nIn recent weeks, Trump has refused to mince his words when asked about Putin. Trump said during a Cabinet meeting July 8 he was fed up with Putin and said he was eyeing potentially imposing new sanctions on Russia.\n\"We get a lot of bulls--- thrown at us by Putin, if you want to know the truth,\" Trump said. \"He's very nice all the time, but it turns out to be meaningless.\"\nTRUMP MOVES NUCLEAR SUBMARINES WEEKS AFTER PRAISING SUB'S POWER IN IRAN STRIKES\nJohn Hardie, Russia program deputy director at the Foundation for Defense of Democracies, said Russia started to attract ire from Trump dating back to March after Ukraine agreed to a 30-day ceasefire. But Russia has failed to get on board with a ceasefire.\n\"Really, since then, I think Trump has come to view the Russians as the main impediment to a deal,\" Hardie told Fox News Digital Thursday.\nAdditionally, Hardie said that Trump has also grown frustrated that Russia will launch drone and missile attacks against Ukraine, even after directly speaking with Putin.\n\"What he's sort of latched on to are these Russian drone and missile barrages,\" Hardie said. \"That really seems to resonate with him.\"\nTensions only have continued to escalate between the U.S. and Russia since the July Cabinet meeting.\nTrump announced July 14 that he would sign off on \"severe tariffs\" against Russia if Moscow failed to agree to a peace deal within 50 days. He then dramatically reduced the deadline to only 10–12 days — which ends Friday.\nThe decision to reduce the timeline prompted former Russian President Dmitry Medvedev to caution that \"each new ultimatum is a threat and a step towards war.\"\nTRUMP LIFTS VEIL ON US SUBMARINES IN WARNING SHOT TO KREMLIN IN ‘CLEVER’ REPOSITIONING MOVE\nIn addition to economic sanctions, Trump responded to Medvedev and issued a rare statement disclosing that two U.S. Navy submarines would be moved in response to escalating threats from Russia.\n\"I have ordered two Nuclear Submarines to be positioned in the appropriate regions, just in case these foolish and inflammatory statements are more than just that,\" Trump said Aug. 1.\nTrump's disclosure of the submarine presence puts additional pressure on Russia to come to the negotiating table, according to Bryan Clark, a retired submarine officer and director of the Hudson Institute think tank’s Center for Defense Concepts and Technology.\n\"We have used very sparingly submarines to try to influence adversary behavior before, but this is pretty unusual, to do it against a nuclear-powered adversary like Russia in response to a nuclear threat by Russia,\" Clark told Fox News Digital Monday. \"So I think this is trying to essentially push back on Russia's frequent and long-standing threats to use nuclear weapons in part of the Ukraine conflict.\"\nMomentum is picking up on negotiations though, and U.S. Special Envoy Steve Witkoff met with Putin Wednesday.\nTrump said in a post on Truth Social afterward that \"great progress\" was made during the meeting. And now, Trump and Putin are expected to meet face to face imminently in an attempt to finally advance negotiations to end the war between Russia and Ukraine.\nStill, Hardie said he is skeptical that the meeting between Putin and Trump will result in meaningful progress.\n\"I don't expect a summit to produce much,\" Hardie said. \"And I think Putin could try to use the summit to placate Trump and kind of buy more time continues assault on Ukraine, but I think his goal is he'd love to be able to enlist Trump in his effort to impose these harsh terms on Ukraine.\"\nRussia has pushed for concessions in a peace deal that include barring Ukraine from joining NATO, preventing foreign peacekeeper troops from deploying to Ukraine after the conflict, and adjusting some of the borders that previously were Ukraine's.\nIt’s unclear if Trump plans to announce any additional economic burdens upon Russia Friday in accordance with the deadline that he imposed demanding that Russia signal willingness to end the conflict. But according to Trump, the ball is in Putin’s court.\n\"It’s going to be up to him,\" Trump told reporters Thursday. \"We’re going to see what he has to say. It’s going to be up to him. Very disappointed.\"\nThe White House did not disclose any details regarding potential Friday sanctions, but said that Trump wants to meet with Putin and Ukrainian President Volodymyr Putin to resolve the conflict.\n\"The Russians expressed their desire to meet with President Trump, and the President is open to this meeting,\" White House press secretary Karoline Leavitt said in a statement to Fox News Digital. \"President Trump would like to meet with both President Putin and President Zelensky because he wants this brutal war to end. The White House is working through the details of these potential meetings and details will be provided at the appropriate time.\""
    }
  ],
  "argos_summary": "The article describes how U.S. tariffs on Indian imports under Trump have eroded a 25‑year partnership, prompting India to pivot eastward, deepen ties with Russia and China, and buy discounted Russian oil. Indian officials and analysts say the trust that underpinned cooperation on defense, trade and intelligence has collapsed, and Modi is using the dispute to rally domestic support for sovereignty. While the U.S. remains a key strategic partner, the relationship now faces its most serious test, with India signaling it can pursue its interests independently of Washington.",
  "argos_id": "F2GHECJJJ"
}