{
  "url": "https://www.bloomberg.com/news/videos/2025-08-21/college-grads-eye-moving-to-escape-high-living-cost-video",
  "authorsByline": "bn",
  "articleId": "2ada7c33fd9e4707a1cb9259b608db58",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iteNOnw.Q5_Y/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T19:07:57.651000+00:00",
  "addDate": "2025-08-21T19:20:27.437999+00:00",
  "refreshDate": "2025-08-21T19:20:27.438000+00:00",
  "score": 1.0,
  "title": "College Grads Eye Moving to Escape High Living Cost",
  "description": "A new survey shows that gen z and millennials are leaving pricey cities behind in search of affordability, job opportunities and a better quality of life. State of Michigan Chief Growth Officer Hilary Doe has more on the story.  (Source: Bloomberg)",
  "content": "Hillary. We'll get to Michigan's picture in a bit, but I wanted to first find out more about the survey. What did you find are the biggest factors influencing young professionals, recent college graduates in terms of where they want to live? Yeah. So thanks so much for having me. When we looked for the survey results, you can see some things that have been pretty consistent. So, for example, folks are continue to be concerned about quality of schools and quality of health care, community safety, that sort of thing. We're also seeing a real rise in concern about affordability, in particular housing affordability. So 86% of survey respondents said that housing affordability was going to be very important or extremely important in determining where they were going to live alongside a real focus on quality of place. So everything from walkability and transit and amenity richness showing up is really important. In this survey to 75% of respondents identifying access to nature and the outdoors as being very or extremely important in choosing where they are going to live. So, you know, taken together, it really paints a picture for gen-z and millennials of a desire for great quality of place, great quality of life, but also a cost of living that allows folks to have, you know, the kind of life that they want to lead. So given all of that, what kind of incentives are these young people looking for when considering a move? What kind of incentives would they respond to? Right. So, you know, as rising costs and folks continue to feel that pinch, that becomes more of a factor. Programs that offer financial incentives also tend to be more effective. Right. So we're seeing more of those pop up. And over 50% of survey respondents also said that folks that offer those financial incentives or those kinds of programs would be motivating enough for them to consider a new place to call home. These things, these include things like student loan forgiveness, relocation support, and even things like job placement support, support for folks that might be looking for a change. You know, in Michigan, we've really responded to this. We've been really focused on ensuring we can retain our talent here and attract folks from other parts of the country to come and join us and have launched programs like Make Michigan Home, Make My Home, so communities across our state can offer everything from down payment support to student to loan forgiveness, to relocation support to ensure Michigan talent and folks across the country can make choosing Michigan a real no brainer. Yeah, that makes a lot of sense. And I think about Michigan and how it has this incredible university that attracts talent from within the state and from outside of the state as well. Keeping that talent inside Michigan, I'm sure, is a huge priority. What specific initiatives have you observed worked, and to what extent are those initiatives scalable? That can be, you know, kind of multiplied throughout the state and perhaps beyond Michigan. Yeah, absolutely. You know, I think ultimately what we can see is that young people are making their decisions to stay in a place or move to a place based on three things. They really want great opportunities. That means that a place has to ensure that you're providing, you know, great job and educational opportunities. So we've really leaned into that here in Michigan, ensuring that, you know, we continue to have the second fastest growing currently startup ecosystem in the country. We have, you know, really fast growing clean energy ecosystems and a diverse economy. Today, if you went to the Michigan career portal, you'd see maybe 140,000 open jobs. So anywhere in the country that wants to retain or attract talent, you still have to provide those great economic opportunities, but you also need great places and again, access to the outdoors. That's something we have in spades here. But continuing to invest in your transit and quality of place and walkability is critical. And then that third piece is, you know, continuing to ensure affordability. We've made historic housing investments here in our state, even though we already have a housing price that's 40% more affordable than the US average. You need to keep getting stock online to make sure that you can maintain that affordability. And we've really made sure to do that here and keep offering down payment programs and things like that to ensure young people have a path to ownership. Right. So I would continue to encourage folks to think about innovative programs like that, in addition to programs like Make Michigan Home that I mentioned earlier to give people those pathways.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Michigan talent",
      "weight": 0.08770274
    },
    {
      "name": "great places",
      "weight": 0.08209733
    },
    {
      "name": "Make Michigan Home",
      "weight": 0.07983087
    },
    {
      "name": "great quality",
      "weight": 0.076833434
    },
    {
      "name": "Michigan",
      "weight": 0.07450353
    },
    {
      "name": "young people",
      "weight": 0.074254215
    },
    {
      "name": "folks",
      "weight": 0.07183613
    },
    {
      "name": "down payment programs",
      "weight": 0.07029326
    },
    {
      "name": "place",
      "weight": 0.06760235
    },
    {
      "name": "down payment support",
      "weight": 0.06505083
    }
  ],
  "topics": [
    {
      "name": "Academia"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Jobs & Education/Education/Colleges & Universities",
      "score": 0.9208984375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.53271484375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.392333984375
    }
  ],
  "sentiment": {
    "positive": 0.3366971,
    "negative": 0.2875181,
    "neutral": 0.37578475
  },
  "summary": "The author shares her findings about the biggest factors influencing young professionals, recent college graduates, and young professionals in their search for where they want to live. The survey found that 86% of respondents said housing affordability was a significant factor in their decision to live in a new place, particularly in housing affordability. The author also noted a rise in concern about quality of schools, health care, and community safety, as well as walkability, transit, and amenity richness. In addition to these concerns, 75% identified access to nature and the outdoors as crucial factors in choosing where they live. As a result, over 50% of survey respondents said financial incentives or programs that offer financial incentives would motivate them to consider a move, particularly those offering financial incentives. Michigan has responded to this issue with programs like Make Michigan Home, Make My Home, and other initiatives like down payment support for student loan forgiveness, relocation support, and job placement support. The authors suggest that keeping the talent in Michigan is a key priority for the state, particularly focusing on ensuring it can retain talent and attract talent from other parts of the country. They also highlighted the importance of investing in transit and transit, walkability and amenities, and maintaining affordability.",
  "shortSummary": "A survey reveals that high housing affordability and quality of living are major factors influencing young professionals' decisions about where they will live, emphasizing investment in housing, quality of education, and outdoor access.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b773c263ee5f4f218a92badc89a72746",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "A recent survey of young professionals and recent college graduates shows that while quality of schools, health care, and community safety remain top concerns, housing affordability has become the most critical factor, with 86% citing it as very or extremely important. Respondents also prioritize walkability, transit, amenity richness, and access to nature, with 75% valuing outdoor access. Financial incentives such as student‑loan forgiveness, relocation support, and job placement assistance are viewed as strong motivators, with more than half of participants saying they would consider a move if offered such programs. Michigan has responded with initiatives like Make Michigan Home and Make My Home, providing down‑payment assistance, loan forgiveness, and relocation support to retain talent and attract newcomers, while also emphasizing its growing startup ecosystem, clean‑energy opportunities, and affordable housing relative to the national average.",
  "argos_id": "F5OAFTT3T"
}