{
  "url": "https://www.yahoo.com/entertainment/celebrity/articles/kylie-kelce-praises-taylor-swifts-122105191.html?_guc_consent_skip=1755779968",
  "authorsByline": "Rachel McRady",
  "articleId": "2ae827835ff04f9cae59e8ea0cde1428",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/ed3d787002c2e46291986408a61c9ed50199f5c4e4d891ec9636dd5225a0c777/ynews/resizefill_w1200/https://media.zenfs.com/en/people_218/c34cfa98a37879c7feecb555abee867a",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T12:21:05+00:00",
  "addDate": "2025-08-21T12:42:11.653106+00:00",
  "refreshDate": "2025-08-21T12:42:11.653109+00:00",
  "score": 1.0,
  "title": "Kylie Kelce Praises Taylor Swift's 'Badass’ Comment and Hints She Enjoys Singer's Sourdough",
  "description": "Swift has been dating Kylie's brother-in-law Travis Kelce for more than two years now",
  "content": "NEED TO KNOW\n• None Kylie Kelce called one of Taylor Swift's viral quotes from her New Heights podcast the \"most badass\"\n• None The mother of four also called herself an \"enjoyer of sourdough,\" referencing Swift's \"obsession\" with baking the bread and her revealing she has been making the savory treat for the Kelce family\n• None Swift's Aug. 13 New Heights episode broke records, hitting 13 million views in the first 24 hours\n\nThe 33-year-old showed some subtle love to her brother-in-law Travis Kelce’s longtime girlfriend, Taylor Swift, on the Thursday, Aug. 21, episode of her Not Gonna Lie podcast.\n\nDuring the episode, Kylie referenced an audio clip from Swift’s Aug. 13 New Heights podcast appearance that has been circulating in the world of women in sports.\n\n“There's a trending TikTok sound from the other podcast that I can confidently say is one of the most badass things ever said on there,” Kylie said, playing the audio of Swift jokingly saying, “I think we all know that if there’s one thing that male sports fans want to see in their spaces and on their screens, it’s more of me.”\n\nThe audio from that teaser clip has been used by many women in the sports world, including ESPN analyst, Mina Kimes.\n\n“It's so good. Let me tell you. The clip, for our audio listeners, is Mina essentially on every ESPN show,” Kylie explained. “And I love this because I'm a tell you right now, Mina would not be on every f------ show if she wasn't absolutely nailing it. Okay? So yeah. Fact is, Mina, I wanna see you on our screens, but I do love this.”\n\nKylie continued to rave over Swift’s quote, saying, “I love this audio so much. I love it. I love all the women in sports that I have seen using this trend. Ilona Maher, Livvy Dunne, Nebraska volleyball team. There have been so many women who have taken this audio and just absolutely nailed it.”\n\nThe mother of four kicked off the episode by introducing herself, saying, “I’m an enjoyer of sourdough, if you know, you know.”\n\nOf course, that comment was in reference to Swift’s self-proclaimed sourdough “obsession,” which she talked about at length during her record-breaking, two-hour episode on Travis and Jason Kelce’s New Heights podcast.\n\n“The sourdough's taken over my life in a huge way. I'm really talking about bread 60 percent of the time now,” the “Blank Space” singer said. “I'm just, like, always baking bread and texting my friends and being like, ‘Can I send you some bread? I need some feedback. Do you like this one better than you liked the other one? Like, I did the rise a little differently.”\n\nAnd the Grammy winner’s love of sourdough has included making treats for Kylie, Jason, 37, and their four daughters — Wyatt, Elliotte, Bennett and Finn.\n\n“Been really experimenting with the flavors there because we got now wild blueberry, raspberry, strawberry, the original and Kylie got me baking the cinnamon sugar,” Swift said, adding, “This one I've been workshopping for the girls because they love everything rainbow, funfetti sourdough … Because they love sprinkles. Like, we put sprinkles in everything when we hang out.”\n\nDuring the discussion, Swift also praised Jason and Kylie, saying, “You're exactly as I thought you would be. Kylie is exactly as I thought she would be, just like the realest, the smartest, the coolest.”\n\nNever miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\nSwift’s episode of New Heights reached 13 million views on YouTube in just 24 hours, dethroning Kylie’s previously-held record for the most viewed episode of New Heights.\n\n“Officially no longer the record holder for the most watched episode of the other podcast. There's no way it's even close, and I love that for me,” Kylie quipped last week.",
  "medium": "Article",
  "links": [
    "https://people.com/people-news-daily-newsletter-sign-up-8692701",
    "https://people.com/jason-kelce-8548268",
    "https://podcasts.apple.com/us/podcast/not-gonna-lie-with-kylie-kelce/id1780888125",
    "https://people.com/kylie-kelce-reacts-taylor-swift-beating-her-new-heights-podcast-episode-record-11790729",
    "https://www.youtube.com/@newheightshow",
    "https://people.com/tag/taylor-swift/",
    "https://people.com/taylor-swift-new-heights-travis-kelce-sourdough-baking-obsession-11790990",
    "https://www.instagram.com/accounts/login/?next=https%3A%2F%2Fwww.instagram.com%2Fp%2FDNZBg8Zy0vD%2F&is_from_rle",
    "https://people.com/travis-kelce-8285986",
    "https://people.com/kylie-kelce-praises-taylor-swift-badass-comment-hints-enjoys-her-sourdough-bread-11794996",
    "https://people.com/all-about-jason-kelce-wife-kylie-kelce-11790557"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Kylie Kelce",
      "weight": 0.09448212
    },
    {
      "name": "Taylor Swift",
      "weight": 0.088918224
    },
    {
      "name": "Kylie",
      "weight": 0.08317603
    },
    {
      "name": "Swift",
      "weight": 0.08175729
    },
    {
      "name": "New Heights",
      "weight": 0.08080732
    },
    {
      "name": "funfetti sourdough",
      "weight": 0.06996057
    },
    {
      "name": "Jason Kelce",
      "weight": 0.069277324
    },
    {
      "name": "sourdough",
      "weight": 0.06755687
    },
    {
      "name": "Travis Kelce",
      "weight": 0.065049104
    },
    {
      "name": "male sports fans",
      "weight": 0.05750532
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9970703125
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.888671875
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.6689453125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.349609375
    }
  ],
  "sentiment": {
    "positive": 0.27573276,
    "negative": 0.3244962,
    "neutral": 0.39977106
  },
  "summary": "Kylie Kelce, the mother of four, praised Taylor Swift for her \"most badass\" comment from her New Heights podcast, referring to an audio clip from her episode of the show. She also mentioned her own love of sourdough, highlighting Swift's obsession with baking the bread and revealed she has been making the savory treat for the Kelce family. The episode of Swift's episode on the Not Gonna Lie podcast, which broke records with 13 million views in the first 24 hours, surpassed the previous record for the most viewed episode of New Heights. During the discussion, Swift also praised her brother-in-law Travis Kelce’s girlfriend, Kylie.",
  "shortSummary": "Kylie Kelce praised Taylor Swift's \"most badass\" comment and expressed her love for sourdough during a New Heights podcast, which gained massive popularity.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "dc6b18ad4f694ac880174f15968a6fee",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://people.com/taylor-swift-new-heights-travis-kelce-sourdough-baking-obsession-11790990",
      "text": "Taylor Swift Details Her New Baking 'Obsession,' Which Makes Boyfriend Travis Kelce Feel Like the 'Luckiest Man in the World' Swift said she's become immersed in the world of sourdough bread ever since wrapping her record-breaking Eras tour in Dec. 2024 By Rachel McRady Rachel McRady Rachel McRady is a Digital News Editor at PEOPLE. She has been an entertainment journalist for more than a decade, previously working for E! News, Entertainment Tonight, and Us Weekly. People Editorial Guidelines Published on August 14, 2025 12:40PM EDT Leave a Comment Travis Kelce and Taylor Swift on 'New Heights'. Credit : New Heights/YouTube NEED TO KNOW During her Aug. 13 appearance on Travis and Jason Kelce's New Heights podcast, Taylor Swift opened up about her recent \"obsession\" with baking sourdough breadThe 35-year-old pop star said she spends \"60 percent\" of her time talking about breadShe also shared some of her recent flavor creations It’s a loaf story, baby just say yeast! Taylor Swift is in her sourdough era and proudly spent a good chunk of her time on boyfriend Travis Kelce and his brother Jason Kelce’s New Heights podcast discussing her new “obsession.” The Grammy winner, 35, appeared on the highly anticipated episode on Wednesday, Aug. 13, covering a wide range of topics from the origins of her love story with Travis to the announcement of her new 12th studio album, The Life of a Showgirl. However, in the wake of her record-breaking Eras tour coming to a close in December 2024, the pop star has been spending a lot of time at home focusing on her craft — baking, that is. “It's been so fun to see what Taylor actually gets into around the house,” Travis shared, referencing the home they share together. “I'd say all my hobbies could be categorized as, like, hobbies you could have had in the 1700s, you know? Like, I get all my granny s---,” Swift quipped. Travis Kelce and Taylor Swift on 'New Heights.'. New Heights/YouTube Some of those hobbies include sewing, painting and cooking with Swift clarifying that she has “a different baking obsession every six months,” prompting Travis to declare, “I am the luckiest man in the world.” The current obsession? Sourdough bread. “We're very deep in a sourdough obsession that has taken over my life,” she admitted. Travis, who is currently in preseason training for the NFL as a tight end for the Kansas City Chiefs, said it is “lucky” that he’s been so active amid his girlfriend’s carb-filled hobby. Related Stories Taylor Swift Reveals the Special Recipe She's 'Workshopping' for Jason Kelce's 4 Daughters Taylor Swift Reveals the Sweet Homemade Presents She's Gifted Jason and Kylie Kelce's 4 Daughters “The sourdough's taken over my life in a huge way. I'm really talking about bread 60 percent of the time now,” the “Blank Space” singer said. As for her best creations, Swift noted she’s partial to the regular sourdough as well as blueberry lemon, cinnamon swirl and cinnamon raisin. “I'm just, like, always baking bread and texting my friends and being like, ‘Can I send you some bread? I need some feedback. Do you like this one better than you liked the other one? Like, I did the rise a little differently,” Swift quipped. Ashley Avignone shares the sourdough bread Taylor Swift made her. Ashley Avignone/Instagram In fact, the singer’s close friend, Ashley Avignone, confirmed the comments, sharing a photo of Swift’s Cinnamon Raisin Sourdough on Aug. 14, which she packaged with cat stickers and a cheeky reference to her upcoming album, The Life of a Showgirl, by writing, “The Loaf of a Dough Girl.” On the podcast, Swift shared that she’s been immersed in “sourdough blogs.” “There’s a whole community of us and I didn’t know it. This is an underworld,” she joked. Travis laughed, adding, “Oh my gosh, the amount of people hoping you’re on their blog.” “Oh, I’m on your blog,” Swift said, facing the camera. “Girl, I’m on your blog.” Later in the podcast, Jason suggested a new baking challenge for Swift in light of her new orange-themed album, The Life of a Showgirl, which is coming out on Oct. 3. “Well, if I may, we need an orange PopTart now,” he said. Our new app is here! Free, fun and full of exclusives. Scan to download now! “If you really want me to, like, with, like, a marmalade, like, an orange marmalade in the middle and then an orange extract,” Swift said. And when Jason mentioned the marmalade-loving Paddington Bear, Swift replied, “Okay. No. I can get with this. I just didn't see the vision until now, and now I think it's kind of genius.” Close Leave a Comment Read more: Lifestyle Food"
    },
    {
      "url": "https://people.com/kylie-kelce-reacts-taylor-swift-beating-her-new-heights-podcast-episode-record-11790729",
      "text": "Kylie Kelce Shares Surprising Reaction to Taylor Swift Dethroning Her for the Most Listened to Episode of New Heights The 'Not Gonna Lie' podcast host addressed Swift's record-breaking appearance on Jason and Travis Kelce's 'New Heights' podcast By Rachel McRady Rachel McRady Rachel McRady is a Digital News Editor at PEOPLE. She has been an entertainment journalist for more than a decade, previously working for E! News, Entertainment Tonight, and Us Weekly. People Editorial Guidelines Published on August 14, 2025 08:27AM EDT 17 Comments Kylie Kelce; Travis Kelce and Taylor Swift on 'New Heights'. Credit : Michael Loccisano/Getty; New Heights/YouTube NEED TO KNOW Kylie Kelce opened up about losing her record for the most listened to episode of her husband Jason Kelce's New Heights podcast to Taylor SwiftSwift made her podcast debut in a two-hour episode of New Heights on Aug. 13In less than 24 hours, Swift's episode surpassed Kylie's 8.6 million record for her Sept. 2023 appearance on New Heights Kylie Kelce has been dethroned by Taylor Swift — and that’s completely fine by her. The wife of Jason Kelce dropped the latest episode of her Not Gonna Lie podcast on Thursday, Aug. 14, where she quickly addressed the Internet-breaking episode of Jason and brother Travis Kelce’s New Heights podcast, which dropped on Wednesday night with very special guest Swift. “Officially no longer the record holder for the most watched episode of the other podcast. There's no way it's even close, and I love that for me,” Kylie, 33, quipped, referencing her brother-in-law’s pop star girlfriend, 35, and her mega fandom. In fact, at the time of publication, Swift had just surpassed Kylie’s 8.6 million views from her record-setting Sept. 2023 episode in less than 24 hours. Kylie Kelce and Jason Kelce on a September 2023 episode of 'New Heights.'. New Heights/YouTube “It is very entertaining to watch the Internet break,” Kylie quipped of seeing the excitement surrounding Swift’s appearance on New Heights. “It's just crumbling apart, and I love it. I love it. I love that we know that a day before it releases my interview on the other podcast is going to lose its long-tenured reign as most-watched episode, and I welcome that whole heartedly. Let's drop that sucker down.” Kylie’s husband Jason, 37, even poked fun at the record-breaking moment at the end of Swift’s two-hour podcast, saying, “I think Kylie enjoyed being the no. 1 most viewed episode for the time that she had.” Our new app is here! Free, fun and full of exclusives. Scan to download now! Travis, 35, chimed in, saying, “Don’t you do that to Kylie,” with Swift echoing the sentiment by adding, “Don’t do that. You guys throw Kylie under the bus, you’re gonna pay for it.” Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. Jason Kelce laughs with Travis Kelce and Taylor Swift on 'New Heights.'. New Heights/Youtube Throughout the “So High School” singer’s lengthy episode, she referenced spending time with Kylie as well as her and Jason’s four daughters — Wyatt, 5, Elliotte, 4, Bennett, 2, and Finn, 4 months. “You're exactly as I thought you would be. Kylie is exactly as I thought she would be, just like the realest, the smartest, the coolest. You're fantastic. Obviously, you know that,” Swift told Jason during the episode. She also referenced Jason’s daughters while discussing her newfound love of baking sourdough bread. Related Stories Kylie Kelce Shares the Sensible Reason Why Her Daughters Have Never Been to Travis Kelce's Games (Exclusive) Kylie Kelce Reveals the Surprising Reason She Doesn't Let Her 4 Daughters Wear Bikinis “This one I've been workshopping for the girls because they love everything rainbow — funfetti sourdough,” she added. “Because they love sprinkles. Like, we put, you know, we put sprinkles in everything when we hang out.” Swift also teased Jason about Kylie using the same phrase to placate both him and their 4-year-old Elliotte. “She goes, ‘Okay, can we not do that right now?’ ” Taylor quipped, referencing Kylie shooting down a drunken idea of Jason's. “And since then, I've heard her say that exact thing to your 4-year-old about, like, ‘Mommy, I wanna throw this pudding on the wall. Wouldn't that be fun?’ ‘Can we not do it right now?’ ” Throughout the rare episode, Swift got candid on a variety of topics, including reclaiming her masters, how her love story with Travis began, her father’s recent heart surgery and her life both during and after the Eras Tour. She also debuted her upcoming 12th studio album, The Life of a Showgirl, revealing it will drop on Oct. 3. Close Leave a Comment Read more: Celebrity Celebrity Relationships Celebrity Friendships"
    },
    {
      "url": "https://people.com/all-about-jason-kelce-wife-kylie-kelce-11790557",
      "text": "All About Jason Kelce's Wife, Kylie McDevitt Kelce (Including Their Failed First Date!) Jason Kelce and his wife Kylie Kelce have welcomed four daughters together By Emily Krauser Emily Krauser Emily Krauser is a contributing writer at PEOPLE. She has been at PEOPLE since 2022. Her work has previously appeared in Entertainment Tonight, Style Network, Parade and J-14 Magazine. People Editorial Guidelines and Jordana Comiter Jordana Comiter Jordana Comiter is an Associate Editor on the Evergreen team at PEOPLE. She has been working at PEOPLE since 2024. Her work has previously appeared in Women’s Health Magazine, PopSugar, VeryWell Mind, Business Insider and The Chicago Reader. People Editorial Guidelines Published on August 14, 2025 10:25AM EDT Leave a Comment Jason Kelce and Kylie Kelce attend Thursday Night Football Presents The World Premiere of 'Kelce' on Sept. 8, 2023. Credit : Lisa Lake/Getty NEED TO KNOW Jason Kelce married his wife, Kylie Kelce, in April 2018The pair have welcomed four daughters togetherKylie launched the Not Gonna Lie podcast in December 2024 Jason Kelce's wife, Kylie Kelce (neé McDevitt), is proud to be married to him. After meeting on Tinder, the retired NFL player and Kylie made their romance Instagram official in March 2015. They got married in April 2018 and went on to welcome four children together: daughters Wyatt Elizabeth, Elliotte Ray, Bennett Llewellyn and Finnley \"Finn\" Anne. After 13 seasons in the NFL, Jason announced he was retiring from football in March 2024. During his retirement speech, he tearfully remembered the moment he met Kylie, saying, “I still remember the moment she walked through the door. The first instance is burned in my retina. It was like she glided through the opening, an aura around her.” Meanwhile, Kylie marked the occasion with a heartfelt Instagram post, writing, \"Your accolade studded 13 year career is a direct result of your hard work, determination, and resilience. I am immensely proud to be your wife and can’t wait to see what you do next.\" She continued, \"As always, the girls and I will be there cheering you on every step of the way! 💚.\" So, who is Jason Kelce's wife? Here's everything to know about Kylie Kelce and her relationship with the retired NFL player. She is a Philly girl Jason Kelce and his wife, Kylie McDevitt Kelce. Kylie Kelce Instagram Jason may not be a born and bred Philadelphian — the NFL star was raised in Cleveland Heights, Ohio — but he is firmly rooted in the City of Brotherly Love. The Super Bowl champ was drafted by the Philadelphia Eagles in 2011 and has played 12 seasons with the team. He is affectionally known city-wide (and beyond!) as the \"King of Philly.\" Kylie, however, was raised in Eagles country. Born in 1992, she grew up in Narberth, a Main Line suburb of Philadelphia. She stayed nearby for college, attending Cabrini University in Wayne, Pa. She majored in communications, and Jason was right by her side when she graduated in 2017. \"She's from the area. Both of her parents are here, my parents came in, and she has a lot of friends, family members. She's not alone by any stretch of the imagination,\" the pro athlete told reporters the day after his firstborn's birth in October 2019, noting that his teammates and coaches had been very supportive. \"There's not much I can do. Obviously, I can be supportive and whatnot, but, you know, you can't milk me.\" She and Jason met on Tinder Jason Kelce and Kylie McDevitt Kelce. Kylie Kelce Instagram In Kelce, a 2023 documentary by Amazon Prime Video, Kylie spoke about meeting her husband on Tinder, admitting that she didn't initially know that the person she matched with was an athlete. \"None of his pictures showed Eagles football,\" she said. During a September 2023 podcast episode of New Heights with Jason and Travis Kelce, she talked about spotting him on the app. \"His profile at the time was something along the lines of, 'I want to have deep meaningful conversations and talk about getting married and having kids,' \" she recalled. Kylie said that for their first date, she went to meet Jason and his friends at a bar. However, the date didn't last long. \"Forty-five minutes later, he fell asleep at the bar, like just, out, like asleep, asleep,\" she said in the documentary. Related Stories What to Know About Kylie and Jason Kelce's 4 Kids' Names (and How Their Newborn Finnley Broke Tradition!) How Did Taylor Swift and Travis Kelce Meet? All About the Start of Their Romance (Including the Unexpected Mutual Friend Who Played Cupid!) She also recounted on the podcast how fellow Eagles player Bo Allen then \"accomplished the most accomplished physical feat of his life when he fireman carried back to his apartment.\" Jason then said he was \"sober enough to know\" Kylie was \"the most beautiful woman I had ever seen in my life\" before noting that their second date \"went much better.\" \"The next day, he called and was like, can we try that again?\" Kylie said, adding that he \"did much better\" impressing her the next time they went out. The pair made their relationship Instagram official on Nov. 11, 2015, when Kylie shared a black-and-white picture with her beau along with the caption, \"Thank goodness you swiped right too.\" She and Jason got married in Philadelphia Jason Kelce and Kylie McDevitt Kelce. Kylie Kelce Instagram The couple tied the knot at the Logan Hotel in Philadelphia on April 14, 2018. Their wedding planner, Sarah Alderman, said there were about 170 guests at the wedding. The Kelce's 20-pound Irish wolfhound, Winnie, whom they adopted in May 2017 and are reportedly \"obsessed with\" according to Philadelphia Magazine, was among the attendees. The wedding came two months after Jason and his Eagles won Super Bowl LII. Their engagement appeared to be short, as Philadelphia photographer Hugh E Dillon claimed he received a tip \"six weeks\" earlier from a customer who said they saw Jason buying an engagement ring and wedding bands. Kylie shared a lovely message on Instagram on the pair's one-year wedding anniversary, writing, \"One year ago today we stood in front of our closest friends and family and vowed our love and commitment to each other. I am so beyond grateful that I get to share my life with this man.\" She is a girl mom Jason Kelce at training camp with his wife and children. Kylie Kelce/Instagram Jason and Kylie are proud parents to four daughters. Two months before they welcomed their firstborn, Kylie rocked a green Eagles shirt that said \"62 did this\" in all caps, with an arrow pointing to her belly. \"Just giving credit where credit is due... And to all the people who told me I was glowing... that was sweat,\" the mom-to-be joked on Instagram in August 2019. Their eldest daughter, Wyatt Elizabeth Kelce, was born on Oct. 2, 2019. Jason told reporters that originally they were thinking Wyatt for a boy and Charlotte for a girl, but friends took the latter name first and they liked how Wyatt sounded \"regardless\" of sex. Wyatt now has three little sisters. Elliotte Ray Kelce arrived on March 4, 2021; Bennett Llewellyn joined the family on Feb. 23, 2023; and Finnley \"Finn\" Anne was born on March 30, 2025. She supported her husband at the Super Bowl — while very pregnant Jason Kelce with his wife, Kylie, and two of their children. Kylie Kelce/Instagram Kylie was in the stands to cheer Jason on during the 2023 Super Bowl — and she was fully prepared in case she went into labor during the game. While Kylie brought her two OBs to the stadium in case she went into labor at the Super Bowl, she didn't end up giving birth that day. \"It was an epic game, an epic Super Bowl, an epic one for our family. We did miss out on one thing that could have made it more epic though. That baby is still inside Kylie's belly,\" Jason said during a February 2023 podcast episode of New Heights with Jason and Travis Kelce. He added, \"I was actually rooting for Kylie to go into labor and have the baby at the stadium. I feel like that's very selfish of me, but that's what I wanted to happen. I don't know why I wanted that to happen.\" On Feb. 10, 2023, Kylie talked to PEOPLE about her competitive spirit as Jason and her brother-in-law, Travis Kelce, prepared to face off at the Super Bowl. \"Being part of the Kelce family right now is very exciting,\" she said. \"I, of course, am like, 'Sorry Travis, we're not family this week,' \" she joked. \"But, you know, next week, it'll be all love again.\" She's a podcast host Jason Kelce and Kylie Kelce attend Chris Stapleton's Performance Live From The Fillmore New Orleans for SiriusXM and Pandora on Feb. 6, 2025, in New Orleans. Mike Coppola/Getty In December 2024, Kylie launched a podcast venture of her own, Not Gonna Lie. It was an instant hit, climbing to No. 1 on Spotify and Apple charts immediately after its debut. \"It absolutely blew my mind that you guys were able to get Not Gonna Lie to the No. 1 spot,\" she said during the second episode. \"I'm still in disbelief about that. The way that everyone has not only been so kind in the anticipation for episode 1, but then also the reactions you guys have had in the comments have been so encouraging, and I really appreciate you guys having such positive feedback considering I'm still a rookie and we're working out the kinks.\" Fans even declared Kylie \"the funniest Kelce\" in a post on X. In response, Jason quipped, \"Funniest looking...\" In August 2025, Travis' girlfriend Taylor Swift hopped on the New Heights podcast. The appearance broke New Heights' viewership records, which had previously been held by Kylie. (Her September 2023 appearance garnered 8.6 million views.) But Kylie took it all in stride. “Officially no longer the record holder for the most watched episode of the other podcast,\" she said during her Aug. 14 episode of Not Gonna Lie. \"There's no way it's even close, and I love that for me.\" She is a philanthropist The Kelces both give back to their community. Jason established his own foundation, (Be)Philly, a non-profit dedicated to improving the lives of Philadelphia's youth, in October 2022. \"Whether my family, my friends, or my fellow Philadelphians, I have always felt an overwhelming love and support that has helped reach my dreams and potential on and off the field. Now it's my turn,\" Jason wrote on the nonprofit's website. And Kylie has regularly helped raise money for the Eagles Autism Foundation. She throws an annual event at Ocean Drive in Sea Isle City, New Jersey, which raised $150,000 — of which the Kelces donated $50,000 — in its second year in 2022. Kylie has been volunteering from an early age — as a high schooler, she worked with the Special Olympics of New Jersey and helped pack boxes to send to troops. She played field hockey at the collegiate level Kylie McDevitt Kelce poses with two girls. Kylie Kelce Instagram As a student, Kylie played field hockey at Lower Marion High School in Ardmore, Pa., as well as during college. According to her Cabrini Athletics page, during her senior year in 2016, she was named to the All-CSAC First Team and ECAC South All-Stars First Team and scored 15 total points on five goals and five assists. In 2019, she called becoming a part of the Cabrini Field Hockey family \"one of the best decisions I've ever made.\" Kylie is now the head field hockey coach at her former high school and tries to teach her players how to see their team \"as your family.\" \"All of the things that we focus on — yes, we focus on skill. Yes, we focus on endurance. We focus on all the things that could potentially help us win in field hockey, but ultimately, I'm trying to help them win at life,\" she told PEOPLE in August 2024. \"So all of those character-building opportunities are things that we focus on mostly.\" She's friends with Taylor Swift Taylor Swift and Kylie Kelce in the suite during an NFL game on Jan. 21, 2024, in Orchard Park, N.Y. Andrew Mather/Kansas City Chiefs via AP Kylie first appeared to cross paths with her brother-in-law's girlfriend, Swift, when they shared a suite in January 2023, when the Kansas City Chiefs played against the Buffalo Bills. Kylie and Swift posed for photos together during the game, including one that Amanda Santa, the wife of Travis' manager, Aaron Eanes, shared on Instagram. The new friends were reunited at the 2024 Super Bowl as they cheered Travis on. In a video shared on X, Kylie and Swift can be seen chatting in the suite, along with the singer's dad, Scott. Over the years, Kylie and Swift have deepened their friendship. In April 2025, Taylor subtly supported Kylie after she welcomed her fourth child. Swift even picked up on one of Kylie's signature phrases while recalling Jason's shirtless shenanigans at the Chiefs vs. Bills playoff game in January 2024. \"One of the first things I saw was that you said to Kylie, 'I was just shotgunning beers with the Bills mafia, and I really wanna go through one of the fire tables, I wanna jump onto the flaming table,' \" Swift said during her August 2025 appearance on New Heights. \"And she goes, 'Okay, can we not do that right now?' \" She continued, \"And since then, I've heard her say that exact thing to your 4-year-old, about like, 'Mommy, I wanna throw this pudding on the wall, wouldn't that be fun?' \" She and Jason starred in a Wawa campaign Wawa — a convenience store chain — tapped Jason and Kylie to promote the brand's famous hoagies. Together, they filmed several short comedic commercials. “Directing these Wawa commercials with Jason is similar to the way I manage every day with our family,” the mom of three said in a press release. “I try to go in with a plan, but distractions happen, so we just take everything in stride and do our best.” Close Leave a Comment Read more: Celebrity Celebrity Relationships"
    },
    {
      "url": "https://people.com/kylie-kelce-praises-taylor-swift-badass-comment-hints-enjoys-her-sourdough-bread-11794996",
      "text": "Kylie Kelce Praises Taylor Swift's 'Badass’ Comment and Hints She Enjoys Singer's Sourdough Swift has been dating Kylie's brother-in-law Travis Kelce for more than two years now By Rachel McRady Rachel McRady Rachel McRady is a Digital News Editor at PEOPLE. She has been an entertainment journalist for more than a decade, previously working for E! News, Entertainment Tonight, and Us Weekly. People Editorial Guidelines Published on August 21, 2025 08:21AM EDT Leave a Comment Kylie Kelce; Taylor Swift. Credit : Not Gonna Life With Kylie Kelce/YouTube; New Heights Podcast/YouTube NEED TO KNOW Kylie Kelce called one of Taylor Swift's viral quotes from her New Heights podcast the \"most badass\"The mother of four also called herself an \"enjoyer of sourdough,\" referencing Swift's \"obsession\" with baking the bread and her revealing she has been making the savory treat for the Kelce familySwift's Aug. 13 New Heights episode broke records, hitting 13 million views in the first 24 hours Kylie Kelce is clearly a Swiftie! The 33-year-old showed some subtle love to her brother-in-law Travis Kelce’s longtime girlfriend, Taylor Swift, on the Thursday, Aug. 21, episode of her Not Gonna Lie podcast. During the episode, Kylie referenced an audio clip from Swift’s Aug. 13 New Heights podcast appearance that has been circulating in the world of women in sports. “There's a trending TikTok sound from the other podcast that I can confidently say is one of the most badass things ever said on there,” Kylie said, playing the audio of Swift jokingly saying, “I think we all know that if there’s one thing that male sports fans want to see in their spaces and on their screens, it’s more of me.” The audio from that teaser clip has been used by many women in the sports world, including ESPN analyst, Mina Kimes. “It's so good. Let me tell you. The clip, for our audio listeners, is Mina essentially on every ESPN show,” Kylie explained. “And I love this because I'm a tell you right now, Mina would not be on every f------ show if she wasn't absolutely nailing it. Okay? So yeah. Fact is, Mina, I wanna see you on our screens, but I do love this.” Kylie continued to rave over Swift’s quote, saying, “I love this audio so much. I love it. I love all the women in sports that I have seen using this trend. Ilona Maher, Livvy Dunne, Nebraska volleyball team. There have been so many women who have taken this audio and just absolutely nailed it.” The mother of four kicked off the episode by introducing herself, saying, “I’m an enjoyer of sourdough, if you know, you know.” Our new app is here! Free, fun and full of exclusives. Scan to download now! Of course, that comment was in reference to Swift’s self-proclaimed sourdough “obsession,” which she talked about at length during her record-breaking, two-hour episode on Travis and Jason Kelce’s New Heights podcast. “The sourdough's taken over my life in a huge way. I'm really talking about bread 60 percent of the time now,” the “Blank Space” singer said. “I'm just, like, always baking bread and texting my friends and being like, ‘Can I send you some bread? I need some feedback. Do you like this one better than you liked the other one? Like, I did the rise a little differently.” Travis Kelce and Taylor Swift on 'New Heights.'. New Heights/Youtube And the Grammy winner’s love of sourdough has included making treats for Kylie, Jason, 37, and their four daughters — Wyatt, Elliotte, Bennett and Finn. “Been really experimenting with the flavors there because we got now wild blueberry, raspberry, strawberry, the original and Kylie got me baking the cinnamon sugar,” Swift said, adding, “This one I've been workshopping for the girls because they love everything rainbow, funfetti sourdough … Because they love sprinkles. Like, we put sprinkles in everything when we hang out.” Related Stories Taylor Swift and Travis Kelce Kiss as She Jokes Podcast 'Got Her a Boyfriend' After He Used It as 'Personal Dating App' Taylor Swift Drops a Hint She and Travis Kelce Are Living Together During Appearance on His Podcast During the discussion, Swift also praised Jason and Kylie, saying, “You're exactly as I thought you would be. Kylie is exactly as I thought she would be, just like the realest, the smartest, the coolest.” Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. Swift’s episode of New Heights reached 13 million views on YouTube in just 24 hours, dethroning Kylie’s previously-held record for the most viewed episode of New Heights. “Officially no longer the record holder for the most watched episode of the other podcast. There's no way it's even close, and I love that for me,” Kylie quipped last week. Close Leave a Comment Read more: Celebrity Celebrity Relationships Celebrity Friendships"
    },
    {
      "url": "https://www.youtube.com/@newheightshow",
      "text": "- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nInnan du fortsätter till YouTube\nVi använder cookies och data för att\n- leverera och underhålla Googles tjänster\n- spåra avbrott och skydda mot spam, bedrägeri och otillåten användning\n- mäta målgruppsengagemang och webbplatsstatistik så att vi kan analysera hur våra tjänster används och förbättra tjänsternas kvalitet.\nOm du väljer knappen Godkänn alla använder vi även cookies och data för att\n- utveckla och förbättra nya tjänster\n- leverera annonser och mäta hur effektiva de är\n- visa anpassat innehåll utifrån dina inställningar\n- visa anpassade annonser utifrån dina inställningar\nOm du väljer knappen Avvisa alla använder vi inte cookies i dessa ytterligare syften.\nInnehåll och annonser utan anpassning påverkas bland annat av vad du tittar på för tillfället och din plats (annonser visas utifrån din ungefärliga plats). Innehåll och annonser med anpassning kan även omfatta sådant som videorekommendationer, en anpassad YouTube Hem-sida och anpassade annonser utifrån tidigare aktivitet, till exempel vad du tittar på och söker efter på YouTube. Vi använder även cookies och data för att anpassa upplevelsen efter lämplighet för din målgrupp, om tillämpligt.\nVälj knappen Fler alternativ för mer information, till exempel om hur du hanterar dina integritetsinställningar. Du kan även besöka g.co/privacytools när som helst."
    }
  ],
  "argos_summary": "Kylie Kelce praised Taylor Swift’s viral quote from her New Heights podcast as “the most badass” and joked about her own love of sourdough, a reference to Swift’s baking obsession that she shares with the Kelce family. In her Not Gonna Lie podcast, Kelce highlighted a trending TikTok clip of Swift saying male sports fans want to see more of her, noting how women in sports have used the audio. Swift’s August 13 New Heights episode broke the show’s viewership record with 13 million views in 24 hours, dethroning Kelce’s previous record. The episode also featured Swift baking various sourdough flavors for the Kelce children and praising Jason and Kylie. Kelce accepted the loss of the record with humor, saying she “loves that for me.”",
  "argos_id": "FC7K2UOLN"
}