{
  "url": "https://www.theguardian.com/us-news/2025/aug/21/california-plague-case-south-lake-tahoe",
  "authorsByline": "Anna Betts",
  "articleId": "ef8d82124d7c4014bdf5d9bd0abe072c",
  "source": {
    "domain": "theguardian.com",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.guim.co.uk/img/media/82361d36bc6302167ece676d9c7d57ed092ecdaf/92_0_1866_1492/master/1866.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a736f07c827f4af096bd61770019f744",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-21T17:56:32+00:00",
  "addDate": "2025-08-21T18:13:53.659017+00:00",
  "refreshDate": "2025-08-21T18:13:53.659018+00:00",
  "score": 1.0,
  "title": "California resident tests positive for the plague after camping, officials say",
  "description": "South Lake Tahoe resident was probably bitten by infected flea while camping in the area, local health authorities say",
  "content": "A resident of South Lake Tahoe in California has tested positive for the plague, local authorities announced this week.\n\nA statement released on Tuesday by health officials in El Dorado county said they were notified of the situation by the California department of public health (CDPH). The statement said the individual is now recovering at home and is under the care of a medical professional.\n\nHealth officials believe that the person “may have been bitten by an infected flea while camping in South Lake Tahoe area”, a popular recreation spot in the California mountains, and said that they are investigating the situation.\n\n“Plague is naturally present in many parts of California, including higher elevation areas of El Dorado county,” said Kyle Fliflet, El Dorado county’s acting director of public health. “It’s important that individuals take precautions for themselves and their pets when outdoors, especially while walking, hiking and or camping in areas where wild rodents are present.”\n\nAccording to the news release, plague is caused by the bacterium Yersinia pestis, and is most often transmitted by the bites of fleas “that have acquired the bacteria from infected squirrels, chipmunks and other wild rodents”.\n\nDogs and cats can also carry infected fleas into the home, officials said.\n\nIn the statement, local officials advised the public to avoid contact with wild rodents and to prevent pets from going near rodent burrows.\n\nThe news release said that while human cases of plague are “extremely rare” they can be very serious.Symptoms typically appear within two weeks of exposure and include fever, nausea, weakness and swollen lymph nodes, the release noted. If detected early, plague can be effectively treated with antibiotics.\n\nCDPH said that it routinely monitors rodent populations across California for plague activity.\n\nThe department said that surveillance in El Dorado county from 2021 through 2024 identified a total of 41 rodents that showed evidence of exposure to the plague bacterium.\n\nSo far in 2025, four rodents have tested positive, county officials said, adding that they were all within the Tahoe Basin.\n\nThis week’s case is not the region’s first brush with plague. The last confirmed human case in El Dorado county was in 2020, the statement added, and was also believed to be linked to the South Lake Tahoe area. Before that, the release says that two cases were reported in 2015 after exposure in Yosemite national park. All individuals were treated and recovered.\n\nIn 2021, the US Forest Service announced it was closing several popular sites at Lake Tahoe for several days after discovering plague in the chipmunk population.\n\nThe federal agency said at the time that “vector control” workers would complete “eradication treatments” in the area.\n\nLast year, Colorado health officials also confirmed a human case of the plague.\n\nThe Centers for Disease Control and Prevention estimates that there is an average of seven human plague cases a year in the US, with most of the human cases occurring in the western US.",
  "medium": "Article",
  "links": [
    "https://www.theguardian.com/environment/2021/aug/03/lake-tahoe-chipmunks-bubonic-plague",
    "https://www.eldoradocounty.ca.gov/County-Government/Countywide-Press-Releases/Resident-Tests-Positive-for-Plague",
    "https://county.pueblo.org/public-health-department/public-health-officials-confirm-first-human-plague-case-pueblo-county",
    "https://www.cdc.gov/plague/maps-statistics/index.html",
    "https://www.theguardian.com/us-news/2015/aug/07/california-child-diagnosed-plague-yosemite",
    "https://www.theguardian.com/us-news/california"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "El Dorado county",
      "weight": 0.09704109
    },
    {
      "name": "county officials",
      "weight": 0.09288153
    },
    {
      "name": "human cases",
      "weight": 0.09206737
    },
    {
      "name": "Plague",
      "weight": 0.09205761
    },
    {
      "name": "plague",
      "weight": 0.09205761
    },
    {
      "name": "South Lake Tahoe area",
      "weight": 0.090758115
    },
    {
      "name": "plague activity",
      "weight": 0.09013948
    },
    {
      "name": "Health officials",
      "weight": 0.08640378
    },
    {
      "name": "health officials",
      "weight": 0.08640378
    },
    {
      "name": "El Dorado",
      "weight": 0.08374574
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.9921875
    },
    {
      "name": "/Health/Public Health/Other",
      "score": 0.662109375
    },
    {
      "name": "/Health/Health Conditions/Infectious Diseases/Other",
      "score": 0.40869140625
    },
    {
      "name": "/News/Health News",
      "score": 0.363525390625
    }
  ],
  "sentiment": {
    "positive": 0.0628303,
    "negative": 0.6579115,
    "neutral": 0.2792582
  },
  "summary": "A resident of South Lake Tahoe, California, has tested positive for the plague, which is caused by the bacterium Yersinia pestis. Health officials believe the person may have been bitten by an infected flea while camping in the area. The disease is most often transmitted by fleas that acquired the bacteria from infected squirrels, chipmunks, and other wild rodents. The public is urged to avoid contact with wild rodents and to prevent pets from going near rodent burrows. The California Department of Public Health (CDPH) is monitoring rodent populations across California for plague activity. The last confirmed human case in El Dorado county was in 2020, and the last two cases were reported in 2015 after exposure in Yosemite national park.",
  "shortSummary": "A California resident tested positive for plague while camping, prompting health officials to warn the public about the dangers of contact with wild rodents.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f74ec17f59864150a3abcbaa41de61f9",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cdc.gov/plague/maps-statistics/index.html",
      "text": "Key points\n- An average of seven human plague cases are reported each year in the United States.\n- Plague occurs in the western U.S., with most cases in northern New Mexico and Arizona.\n- More recent plague epidemics have occurred in Africa, Asia, and South America, but most human cases since the 1990s have occurred in Africa.\nPlague in the United States\nPlague was first introduced into the United States in 1900, from rat–infested steamships that had sailed from affected areas. Epidemics occurred in port cities. The last urban plague epidemic in the United States occurred in Los Angeles from 1924 through 1925. Plague then spread from urban rats to rural rodent species and became entrenched in many areas of the western United States. Since that time, plague has occurred as scattered cases in rural areas. Most human cases in the United States are acquired in two regions:\n- Northern New Mexico, northern Arizona, and southern Colorado\n- California, southern Oregon, and far western Nevada\nOver 80% of United States plague cases have been the bubonic form. In recent decades, an average of seven human plague cases have been reported each year (range: 0–17 cases per year). Plague has occurred in people of all ages (infants up to age 96), though 50% of cases occur in people ages 12–45. It occurs in both men and women, though historically is slightly more common among men, probably because of increased outdoor activities that put them at higher risk.\nReported Cases of Human Plague - United States, 1970-2023\nSince the mid–20th century, plague in the United States has typically occurred in the rural West. Cases in the eastern United States are among people who traveled from the west or from laboratory exposure.\nTable of Reported Cases of Human Plague in the United States from 1970-2023\nHuman Plague Cases, Fatal and Non-fatal - United States, 2000-2023\nIn recent decades, an average of seven human plague cases have been reported each year (range: 0–17 cases per year).\nTable of Human plague cases, fatal and non-fatal - United States, 2000-2023\nPlague Worldwide\nMore recent plague epidemics have occurred in Africa, Asia, and South America, but most human cases since the 1990s have occurred in Africa. Almost all of the cases reported in the last 20 years have occurred among people living in small towns and villages or agricultural areas, rather than in larger towns and cities."
    },
    {
      "url": "https://www.theguardian.com/environment/2021/aug/03/lake-tahoe-chipmunks-bubonic-plague",
      "text": "Surrounded by fires, parched by drought, and shut down by the pandemic – residents of California’s scenic South Lake Tahoe thought they’d endured everything.\nThat was until this week, when the US Forest Service announced it was closing several popular sites after discovering bubonic plague in the chipmunk population.\nThe federal agency announced this week that “based on positive plague tests” in the rodent population around hiking areas, it would close the well-trafficked Taylor Creek Visitor Center and nearby Kiva Beach through Friday.\nThe closure includes some of the region’s most spectacular hiking spots, which meander through forested glades speckled with wildflowers and along a creek that leads to Lake Tahoe’s shore.\nAccording to the forest service, plague can be spread by “squirrels, chipmunks and other wild rodents”, specifically by fleas that come in contact with infected animals and go on to bite humans.\nAs frightening as it sounds, plague in rodents at higher elevations is apparently not that rare, and a spokeswoman for the US Forest Service said spread to humans was easily preventable with a few precautions.\n“Bubonic plague is naturally occurring in the Sierra Nevada Mountains and this region,” said Lisa Herron, a public affairs specialist for the agency’s Lake Tahoe basin management unit, which runs the closed facilities.\n“It’s something that visitors need to take precautions about, but it’s not something that they need to worry about.”\nShe said keeping pets at home, or at least on leash and away from rodent burrows, was one important strategy. But visitors should also stay away from chipmunks and squirrels and report any that are acting strange or lethargic to rangers.\nThe federal agency’s announcement on Facebook said “vector control” workers would complete “eradication treatments” in the area on Thursday in hopes of reopening the sites and the surrounding hiking areas by Friday.\nHerron said this week’s abatement efforts would not target the chipmunk populations themselves – but instead would try to wipe out their fleas.\nHerron said the real danger of getting bubonic plague comes from the fleas that carry the disease. Regional authorities conduct regular tests, in which they trap the rodents, anesthetize them, comb them for fleas and then test the fleas for plague, she said. Once plague is detected, vector control workers will give the area the forest equivalent of a flea bath.\n“What happens next is that the El Dorado county vector control will be dusting the burrows with a powder,” she said.\nThen there will be another round of trapping and testing and hopefully the visitor sites, which can draw several thousand visitors a day during the busy summer season, can be opened by this weekend, she said.\nBut plague in humans has been extremely rare in the area. Last year an avid walker from the South Lake Tahoe region tested positive, becoming the first case in five years, according to a story in the Tahoe Daily Tribune.\nHerron said if caught in time, plague in humans was now actually very treatable. Symptoms to watch for include sudden fever and chills, headache and muscle aches.\nLocal readers of the announcement seemed to take the closures in stride.\n“Drought, plague, fires, and earthquakes. Just another week in California,” said one poster, responding to the forest service’s announcement on Facebook.\nOthers mused that it seems ironic that, at a time when the Covid-19 pandemic seems destined to run on for two years, the bubonic plague can now be wiped out in four days.\n“Chipmunks and squirrels have had the plague for decades around the lake, nothing new,” said another Facebook user, responding to the latest story in the Tahoe Daily Tribune. “Just tell them to stay home and wear a mask.”\n-\nThis article was amended on 4 August 2021. An earlier version referred to animal control workers rather than vector control workers."
    },
    {
      "url": "https://county.pueblo.org/public-health-department/public-health-officials-confirm-first-human-plague-case-pueblo-county",
      "text": "Pueblo, CO— The Pueblo Department of Public Health and Environment, in collaboration with the Colorado Department of Public Health and Environment, has confirmed a human case of plague in a Pueblo County resident.\nPDPHE continues to investigate a potential source and asks the public to take the precautions listed below:\n- Eliminate places that rodents can hide and breed around your home, garage, shed or recreation area. Remove brush, rock piles, trash, and piles of lumber.\n- Avoid contact with dead animals. If you must handle sick or dead animals follow these guidelines. First, put on an insect repellant to protect yourself from fleas. Then use a long-handled shovel to place it in a garbage bag. Lastly, place the bag in an outdoor garbage can.\n- Use insect repellent that contains 20%-30% DEET to prevent flea bites. Treat pants, socks, shoe tops, arms, and legs.\n- Do not let pets sleep in bed with you.\n- Treat dogs and cats for fleas regularly. Flea collars have not been proven effective.\n- Do not allow pets to hunt or roam in rodent areas, such as prairie dog colonies.\n- Keep pet food in rodent-proof containers.\nTypical symptoms of plague include sudden fever and chills, severe headache, muscle aches, nausea, vomiting and a feeling of illness. A common symptom of plague is also swollen lymph nodes with pain.\nIf you develop symptoms of plague, see a health care provider immediately. Plague can be treated successfully with antibiotics, but an infected person must be treated promptly to avoid serious complications or death,” said Alicia Solis, program manager of the Office of Communicable Disease and Emergency Preparedness at PDPHE.\nThe plague bacterium (Yersinia pestis) is transmitted by fleas and cycles naturally among wild rodents. Plague occurs naturally and can infect humans and their pets. People get plague from bites of infected fleas, by touching or skinning infected animals, or inhaling droplets from the cough of an infected person or animal.\nFor more information about plague, visit pueblohealth.org.\n###"
    },
    {
      "url": "https://www.theguardian.com/us-news/2015/aug/07/california-child-diagnosed-plague-yosemite",
      "text": "A child who camped in California’s Yosemite national park has been diagnosed with the plague, the latest of several such infections in the western United States this year, health officials said.\nThe California child became ill and was hospitalized with the disease, carried by rodents and the fleas that live on them, after visiting the Stanislaus National Forest outside the park and then camping at Yosemite’s Crane Flat campground last month, officials said on Thursday.\nThe Los Angeles County child, whose name and age were not released, is recovering, state health officer Dr Karen Smith said in a statement.\nNews of the infection came just a day after officials in Pueblo, Colorado, said that an area adult had died from the plague, the second person in the state to succumb this year to a form of the centuries-old scourge.\nEarlier this year, a teen died from the plague in Colorado, and last year four people were sickened after coming into contact with an infected dog, officials said.\nSmith said the case was California’s first in humans since 2006. Public health officials would investigate the Yosemite and Stanislaus National Forest areas to try to determine the source of the infection, she said.\n“Although this is a rare disease, people should protect themselves from infection by avoiding any contact with wild rodents,” she said. “Never feed squirrels, chipmunks, or other rodents in picnic or campground areas, and never touch sick or dead rodents.“\nShe urged park visitors to avoid walking or camping near rodent burrows, to wear long pants tucked into boots when hiking and to spray insect repellent containing the chemical diethyltoluamide, or Deet, on socks and pant legs to reduce the risk of flea bites.\nIn 2012, another disease carried by rodents, called hantavirus, sickened nine people, killing three of them. Most of those cases were linked to dust from mouse droppings in tent cabins at the park’s Curry Village.\nPeople can inhale the hantavirus when mice droppings mix with dust, especially in confined, poorly ventilated spaces.\nComments (…)\nSign in or create your Guardian account to join the discussion"
    }
  ],
  "argos_summary": "A South Lake Tahoe resident has tested positive for plague, likely after a flea bite while camping, and is recovering at home under medical care. Health officials warn that plague is naturally present in California’s high‑elevation rodent populations and advise precautions such as avoiding rodent burrows, keeping pets away, and using DEET insect repellent. The case follows previous human infections in El Dorado County (2020) and Colorado (2025), and coincides with recent US Forest Service closures of popular Tahoe sites after detecting plague in chipmunks. Surveillance data show 41 rodent exposures from 2021‑2024 and four positive rodents in 2025, all within the Tahoe Basin. Despite its rarity, early antibiotic treatment can effectively manage plague symptoms such as fever, nausea, and swollen lymph nodes.",
  "argos_id": "FJ1HM0IT1"
}