{
  "url": "https://www.benzinga.com/markets/market-summary/25/08/47266189/sp-500-moves-lower-walmart-shares-fall-after-q2-results",
  "authorsByline": "Avi Kapoor",
  "articleId": "86254e9167344bc4bf251848b5aa8be1",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "https://cdn.benzinga.com/files/images/story/2025/08/21/SP-Sees-Stable-Outlook-Despite-Trumps-Co.jpeg?width=1200&height=800&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T13:27:41-04:00",
  "addDate": "2025-08-21T17:36:42.522356+00:00",
  "refreshDate": "2025-08-21T17:36:42.522357+00:00",
  "score": 1.0,
  "title": "S&P 500 Moves Lower; Walmart Shares Fall After Q2 Results - Aptorum Group (NASDAQ:APM), Coty (NYSE:COTY)",
  "description": "",
  "content": "U.S. stocks traded lower midway through trading, with the Dow Jones index falling around 50 points on Thursday.\n\nThe Dow traded down 0.62% to 44,660.91 while the NASDAQ fell 0.74% to 21,016.48. The S&P 500 also fell, dropping, 0.66% to 6,353.29.\n\nCheck This Out: How To Earn $500 A Month From Intuit Stock Ahead Of Q4 Earnings\n\nLeading and Lagging Sectors\n\n\n\nHealth care shares jumped by 0.7% on Thursday.\n\nIn trading on Thursday, consumer staples stocks fell by 0.9%.\n\nShares of Walmart Inc. WMT fell 4% on Thursday after the company reported mixed second-quarter results and raised its annual outlook.\n\nThe retail giant reported adjusted earnings per share of 68 cents, missing the analyst consensus estimate of 74 cents. Quarterly sales of $177.40 billion, up 4.8% year over year, outpaced the Street view of $176.16 billion. Total revenues on a constant currency basis increased 5.6%.\n• Aptorum Group Limited shares shot up 155% to $3.24 after the company announced that New York State’s Department of Health has approved the DiamiR APOE genotyping test.\n• Shares of Protagenic Therapeutics, Inc. got a boost, surging 94% to $4.43 after the company announced it has completed the first dose injections in its Phase 1 multiple-dose study of PT00114.\n• SelectQuote, Inc. shares were also up, gaining 40% to $2.5709 after the company reported better-than-expected fourth-quarter financial results and issued FY26 revenue guidance above estimates.\n• ModivCare Inc. shares dropped 61% to $0.7196. Modivcare filed voluntary Chapter 11 to implement restructuring support agreement backed by more than 90% of first lien lenders and 70% of second lien lender.\n• Shares of Coty Inc. were down 20% to $3.8850 following a fourth-quarter adjusted EPS miss. Additionally, Evercore ISI Group cut its price target on the stock from $10 to $7.\n• Canadian Solar Inc. was down, falling 19% to $10.38 after the company reported worse-than-expected second-quarter financial results and cut its FY25 sales guidance below estimates.\n\nCommodities\n\n\n\nIn commodity news, oil traded down 0.2% to $63.06 while gold traded down 0.2% at $3,383.50.\n\nSilver traded up 0.9% to $38.100 on Thursday, while copper fell 0.2% to $4.4335.\n\nEuropean shares were mixed today. The eurozone's STOXX 600 slipped 0.07%, while Spain's IBEX 35 Index fell 0.10%. London's FTSE 100 rose 0.18%, Germany's DAX 40 gained 0.01% and France's CAC 40 fell 0.53% during the session.\n\nAsian markets closed mixed on Thursday, with Japan's Nikkei 225 falling 0.65%, Hong Kong's Hang Seng falling 0.24%, China's Shanghai Composite gaining 0.13% and India's BSE Sensex gaining 0.17%.\n• U.S. initial jobless rose by 11,000 from the previous week to 235,000 in the second week of August, compared to market estimates of 225,000.\n• U.S. existing home sales climbed by 2% from the previous month to an annualized rate of 4.01 million in July.\n• The S&P Global services PMI fell to 55.4 in August from 55.7 in the previous month.\n• The S&P Global manufacturing PMI climbed to 53.3 in August versus 49.8 in July.\n• The Philadelphia Fed Manufacturing Index fell to -0.3 in August compared to 15.9 in the previous month.\n• Top 2 Industrials Stocks That May Keep You Up At Night In Q3",
  "medium": "Article",
  "links": [
    "https://www.benzinga.com/trading-ideas/dividends/25/08/47256446/how-to-earn-500-a-month-from-intuit-stock-ahead-of-q4-earnings",
    "https://www.benzinga.com/trading-ideas/short-ideas/25/08/47256608/top-2-industrials-stocks-that-may-keep-you-up-at-night-in-q3"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "ModivCare Inc. shares",
      "weight": 0.084094584
    },
    {
      "name": "Aptorum Group Limited shares",
      "weight": 0.07888642
    },
    {
      "name": "Walmart Shares",
      "weight": 0.075442635
    },
    {
      "name": "European shares",
      "weight": 0.07414639
    },
    {
      "name": "Health care shares",
      "weight": 0.07400636
    },
    {
      "name": "Shares",
      "weight": 0.072166905
    },
    {
      "name": "share",
      "weight": 0.072166905
    },
    {
      "name": "U.S. stocks",
      "weight": 0.06748786
    },
    {
      "name": "Coty Inc.",
      "weight": 0.067442425
    },
    {
      "name": "Walmart Inc.",
      "weight": 0.06565414
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.958984375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.95166015625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.94140625
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.3076171875
    }
  ],
  "sentiment": {
    "positive": 0.024764825,
    "negative": 0.90954095,
    "neutral": 0.065694176
  },
  "summary": "U.S. stocks fell mid-trading, with the Dow Jones index falling around 50 points and the S&P 500 dropping 0.66%. Shares of Walmart Inc. fell 4% after the company reported mixed second-quarter results and raised its annual outlook. Health care shares also jumped by 0.7%. Aptorum Group's shares rose 155% to $3.24 after the New York State’s Department of Health approved the DiamiR APOE genotyping test. Shares of Coty Inc. were down 20% to-$3.8850 following a fourth-quarter adjusted EPS miss and Evercore ISI Group cut its price target on the stock from $10 to $7.",
  "shortSummary": "US stocks fell, with the Dow Jones index dropping 50 points, while shares in Aptorum Group and Coty rising after Q2 results.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "68675014fe7e4e28a9667d8a153b7bfb",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.benzinga.com/trading-ideas/short-ideas/25/08/47256608/top-2-industrials-stocks-that-may-keep-you-up-at-night-in-q3",
      "text": "As of Aug. 21, 2025, two stocks in the industrials sector could be flashing a real warning to investors who value momentum as a key criteria in their trading decisions.\nThe RSI is a momentum indicator, which compares a stock’s strength on days when prices go up to its strength on days when prices go down. When compared to a stock’s price action, it can give traders a better sense of how a stock may perform in the short term. An asset is typically considered overbought when the RSI is above 70, according to Benzinga Pro.\nHere's the latest list of major overbought players in this sector.\nGMS Inc GMS\n- On June 30, GMS announced it will be acquired by a Home Depot subsidiary for $5.5 billion. John J. Gavin, Chair of GMS, added, “Following careful consideration of The Home Depot’s proposal, along with other potential opportunities for the Company, our Board determined that this transaction is in the best interests of GMS and all of our shareholders. Not only does this outcome deliver significant and certain value to our shareholders, but it also has the added benefit of bringing GMS together with The Home Depot and SRS, where we are confident our employees will flourish, our customers and suppliers will benefit from our increased offerings and resources, and we will honor the legacy of our founders who made all of this possible.” The company's stock jumped around 40% over the past six months and has a 52-week high of $110.28.\n- RSI Value: 71.6\n- GMS Price Action: Shares of GMS rose 0.1% to close at $109.54 on Wednesday.\n- Edge Stock Ratings: 82.64 Momentum score with Value at 0.77.\nBloom Energy Corp BE\n- On July 31, Bloom Energy posted better-tahn-expected quarterly earnings. KR Sridhar, Founder, Chairman, and CEO of Bloom Energy said, “As onsite power becomes increasingly self-evident, given rapid AI growth, there has never been better market pull for the Bloom products. Unlike alternatives, our products are purpose-built for the digital revolution. I am delighted to engage with our direct hyperscale partner, Oracle, with whom we can collaborate to optimize the watts to flops ratio.” The company's stock gained around 76% over the past month and has a 52-week high of $47.21.\n- RSI Value: 72.7\n- BE Price Action: Shares of Bloom Energy gained 3.3% to close at $44.51 on Wednesday.\nUnlock the rest of the BZ Edge Rankings and see how top stocks stack up.\nRead This Next:\nPhoto via Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/trading-ideas/dividends/25/08/47256446/how-to-earn-500-a-month-from-intuit-stock-ahead-of-q4-earnings",
      "text": "- A more conservative goal of $100 monthly dividend income would require 288 shares of Intuit.\n- An investor would need to own $1,008,174 worth of Intuit to generate a monthly dividend income of $500.\n- Get the exact trades and sectors to target before August’s biggest earnings-driven market moves. Details here →\nIntuit Inc. INTU will release earnings results for the fourth quarter after the closing bell on Thursday, Aug. 21.\nAnalysts expect the Mountain View, California-based company to report quarterly earnings at $2.66 per share, up from $1.99 per share in the year-ago period. Intuit projects to report quarterly revenue of $3.75 billion, compared to $3.18 billion a year earlier, according to data from Benzinga Pro.\nWith the recent buzz around Intuit, some investors may be eyeing potential gains from the company's dividends. As of now, Intuit offers an annual dividend yield of 0.60%, which is a quarterly dividend amount of $1.04 per share ($4.16 a year).\nSo, how can investors capitalize on its dividend yield to earn a regular $500 monthly?\nTo earn $500 per month or $6,000 annually from dividends alone, you would need an investment of approximately $1,008,174 or around 1,442 shares. For a more modest $100 per month or $1,200 per year, you would need $201,355 or around 288 shares.\nTo calculate: Divide the desired annual income ($6,000 or $1,200) by the dividend ($4.16 in this case). So, $6,000 / $4.16 = 1,442 ($500 per month), and $1,200 / $4.16 = 288 shares ($100 per month).\nNote that dividend yield can change on a rolling basis, as the dividend payment and the stock price both fluctuate over time.\nHow that works: The dividend yield is computed by dividing the annual dividend payment by the stock’s current price.\nFor example, if a stock pays an annual dividend of $2 and is currently priced at $50, the dividend yield would be 4% ($2/$50). However, if the stock price increases to $60, the dividend yield drops to 3.33% ($2/$60). Conversely, if the stock price falls to $40, the dividend yield rises to 5% ($2/$40).\nSimilarly, changes in the dividend payment can impact the yield. If a company increases its dividend, the yield will also increase, provided the stock price stays the same. Conversely, if the dividend payment decreases, so will the yield.\nINTU Price Action: Shares of Intuit fell 0.3% to close at $699.15 on Wednesday.\nOn Aug. 15, Citigroup analyst Steven Enders maintained Intuit with a Buy and raised the price target from $789 to $815.\nRead More:\nImage: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    }
  ],
  "argos_summary": "U.S. stocks fell on Thursday, with the Dow, Nasdaq and S&P 500 all down around 0.6‑0.7%. Health‑care shares rose, while consumer staples and Walmart slipped after mixed Q2 results. Other notable moves included a 155% jump in Aptorum after a New York health‑tech approval, a 94% rise for Protagenic following Phase‑1 trial progress, and a 61% drop for ModivCare after a Chapter 11 filing. Commodities were largely flat, oil and gold fell slightly, and silver edged up. International markets were mixed, with Europe’s STOXX 600 barely down and Asia’s Nikkei and Hang Seng falling, while China’s Shanghai Composite gained modestly. U.S. economic data showed a modest rise in jobless claims and home sales, but PMI readings slipped. In the industrials sector, GMS and Bloom Energy were highlighted as overbought, and Intuit is set to report Q4 earnings, with analysts projecting a $2.66 EPS and $3.75 billion revenue, while dividend‑income strategies were discussed.",
  "argos_id": "GKMABMTHY"
}