{
  "url": "https://www.pymnts.com/cpi-posts/eu-tech-regs-survive-for-now-in-trade-agreement-with-us/",
  "authorsByline": "CPI",
  "articleId": "33277188327e4cc48af4740e628ddbf8",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2022/10/eu-ai-regulations-tech.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T18:00:53+00:00",
  "addDate": "2025-08-21T18:20:51.232371+00:00",
  "refreshDate": "2025-08-21T18:20:51.232373+00:00",
  "score": 1.0,
  "title": "EU Tech Regs Survive, For Now, in Trade Agreement With US",
  "description": "The U.S. and the European Union agreed to punt, for now, on the question of the EU’s digital platform regulations in their trade deal. The two sides",
  "content": "The U.S. and the European Union agreed to punt, for now, on the question of the EU’s digital platform regulations in their trade deal.\n\nThursday offering details on the framework accord reached last month, which leaves out any reference to U.S. demands for changes to the Digital Services Act or Digital Markets Act. Instead, it refers only to a mutual commitment “to address unjustified digital trade barriers,” and to “work together” to reduce non-tariff trade barriers. The two sides released aThursday offering details on the framework accord reached last month, which leaves out any reference to U.S. demands for changes to the Digital Services Act or Digital Markets Act. Instead, it refers only to a mutual commitment “to address unjustified digital trade barriers,” and to “work together” to reduce non-tariff trade barriers.\n\nthat the dispute over the regs was holding up any agreement on a joint written statement formalizing the handshake deal reached between President Trump and European Commission president Ursula von der Leyen. The absence of any explicit language on the digital regulations in the joint statement is a win for the EU, at least for now. The U.S. had pressed aggressively in the negotiations for changes to the DSA and other EU tech regulations, which it claims unfairly target U.S. companies. As recently as Monday (8/18) thethat the dispute over the regs was holding up any agreement on a joint written statement formalizing the handshake deal reached between President Trump and European Commission president Ursula von der Leyen.\n\nsaid it “does not include any commitment on EU digital regulations. We have made it very clear to the US that changes to our digital regulations – the Digital Markets Act and the Digital Services Act – were not on the table.” Throughout the negotiations, however, the EU has held firm that changes to digital technology laws were off the table. A Q&A on the joint statementsaid it “does not include any commitment on EU digital regulations. We have made it very clear to the US that changes to our digital regulations – the Digital Markets Act and the Digital Services Act – were not on the table.”\n\nStill, that may not be the last word on the matter. The U.S. is expected to continue to pressure the EU over the rules, particularly content restrictions the U.S. claims amount to censorship of U.S. citizens and companies.\n\nto impose new visa restrictions on “foreign nationals who are responsible for censorship of protected expression in the United States,” including EU policymakers. It is “unacceptable for foreign officials to demand that American tech platforms adopt global content moderation policies or engage in censorship activity that reaches beyond their authority and into the United States,” Rubio said. In May, Secretary of Stateto impose new visa restrictions on “foreign nationals who are responsible for censorship of protected expression in the United States,” including EU policymakers. It is “unacceptable for foreign officials to demand that American tech platforms adopt global content moderation policies or engage in censorship activity that reaches beyond their authority and into the United States,” Rubio said.\n\nIn another partial victory for the EU, the U.S. agreed to lower its tariffs on automobiles and auto parts, and pharmaceuticals from 25% to 15%, in line with the levy imposed on all other goods in the deal. The reduction in auto tariffs will be delayed, however, until the EU initiates a process to eliminate tariffs on U.S. goods.\n\nThe across-the-board 15% tariff on EU goods is nonetheless a setback for European companies that previously enjoyed mostly unfettered access to the U.S. market.\n\nvon der Leyen tried to put the best face she could on a bad situation. “Faced with a challenging situation, we have delivered for our Member States and industry, and restored clarity and coherence to transatlantic trade,” she said. “This is not the end of the process, we continue to engage with the US to agree more tariff reductions, to identify more areas of cooperation, and to create more economic growth potential.” Invon der Leyen tried to put the best face she could on a bad situation. “Faced with a challenging situation, we have delivered for our Member States and industry, and restored clarity and coherence to transatlantic trade,” she said. “This is not the end of the process, we continue to engage with the US to agree more tariff reductions, to identify more areas of cooperation, and to create more economic growth potential.”",
  "medium": "Article",
  "links": [
    "https://www.commerce.gov/news/press-releases/2025/08/joint-statement-united-states-european-union-framework-agreement",
    "https://www.ft.com/content/3f67b6ca-7259-4612-8e51-12b497128552",
    "https://www.state.gov/announcement-of-a-visa-restriction-policy-targeting-foreign-nationals-who-censor-americans",
    "https://www.pymnts.com/cpi-posts/guidance-in-uncharted-territory-three-commission-cases-signal-new-era-in-eu-competition-enforcement/",
    "https://ec.europa.eu/commission/presscorner/detail/en/qanda_25_1974",
    "https://judiciary.house.gov/sites/evo-subsites/republicans-judiciary.house.gov/files/2025-07/DSA_Report%26Appendix%2807.25.25%29.pdf",
    "https://ec.europa.eu/commission/presscorner/detail/en/ip_25_1973"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "EU digital regulations",
      "weight": 0.1087982
    },
    {
      "name": "other EU tech regulations",
      "weight": 0.096303865
    },
    {
      "name": "EU Tech Regs",
      "weight": 0.09097469
    },
    {
      "name": "unjustified digital trade barriers",
      "weight": 0.08865173
    },
    {
      "name": "EU goods",
      "weight": 0.08754073
    },
    {
      "name": "EU",
      "weight": 0.08310222
    },
    {
      "name": "EU policymakers",
      "weight": 0.08259142
    },
    {
      "name": "U.S. companies",
      "weight": 0.07913291
    },
    {
      "name": "U.S. goods",
      "weight": 0.07912451
    },
    {
      "name": "U.S. demands",
      "weight": 0.0771105
    }
  ],
  "topics": [
    {
      "name": "European Union"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.95703125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.837890625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.80078125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.7529296875
    },
    {
      "name": "/News/Technology News",
      "score": 0.62841796875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.57080078125
    }
  ],
  "sentiment": {
    "positive": 0.07324808,
    "negative": 0.57473594,
    "neutral": 0.3520159
  },
  "summary": "The US and the European Union have agreed to postpone a dispute over the EU's digital platform regulations in their trade deal. The framework accord, reached last month, leaves out any reference to U.S. demands for changes to the Digital Services Act or Digital Markets Act. Instead, it refers only to a mutual commitment to address unjustified digital trade barriers and to reduce non-tariff trade barriers. This move is a win for the EU as the U., which had pushed for significant changes to these regulations. However, the U.K. is expected to continue to pressure the EU over the rules, particularly content restrictions the U.-S. claims amount to censorship of U.",
  "shortSummary": "The U.S. and EU agreed to punt on EU digital regulations in their trade deal, addressing unjustified digital trade barriers and reducing tariffs, despite ongoing tensions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5c1306ce19d54dfcaab93cbd9880f744",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.pymnts.com/cpi-posts/guidance-in-uncharted-territory-three-commission-cases-signal-new-era-in-eu-competition-enforcement/",
      "text": "Guidance in Uncharted Territory: Three Commission Cases Signal New Era in EU Competition Enforcement\nIn this blog post, authors Robert Klotz & Maira Aivalioti (Steptoe) talk about how the European Commission is increasingly open to supporting joint initiatives among competitors when such efforts align with EU policy priorities like sustainability and agriculture. Through two recent informal guidance letters and one opinion, the Commission demonstrated a willingness to clarify gray areas in competition law while encouraging collaborations that promote broader EU objectives. This reflects a shift toward a more adaptive enforcement strategy, where the Commission positions itself not only as an enforcer but also as a partner for businesses navigating complex regulatory environments.\nFeatured News\nNexstar to Acquire Tegna in $6.2 Billion Deal, Testing US Media Ownership Rules\nAug 21, 2025 by\nCPI\nAlphabet Faces Regulatory Uncertainty as DOJ Decision Nears\nAug 21, 2025 by\nCPI\nEU Tech Regs Survive, For Now, in Trade Agreement With US\nAug 21, 2025 by\nCPI\nHome Depot Secures Antitrust Clearance for GMS Deal in the US\nAug 21, 2025 by\nCPI\nEx-Baker McKenzie Partner Launches Austrian Antitrust Boutique\nAug 21, 2025 by\nCPI\nAntitrust Mix by CPI\nAntitrust Chronicle® – State Attorneys General\nAug 18, 2025 by\nCPI\nCPI TALKS… with Attorney General Aaron D. Ford\nAug 18, 2025 by\nAaron D. Ford\nUpdates on California’s Antitrust Enforcement\nAug 18, 2025 by\nMatthew Campbell, Paul Chander, Emily Huang, Jiya Kishore, Fin Mennuti, Charles Miller, Maria Ramirez & Shumi Ruan\nWhy States Always Have Parens Patriae Standing to Bring Antitrust Suits\nAug 18, 2025 by\nBrian M. Yost\nThe State Antitrust Enforcement Venue Act: A Measured Approach\nAug 18, 2025 by\nElizabeth R. Odette"
    },
    {
      "url": "https://www.state.gov/announcement-of-a-visa-restriction-policy-targeting-foreign-nationals-who-censor-americans",
      "text": "HomeOffice of the SpokespersonPress Releases...Announcement of a Visa Restriction Policy Targeting Foreign Nationals Who Censor Americans hide Announcement of a Visa Restriction Policy Targeting Foreign Nationals Who Censor Americans Press Statement Marco Rubio, Secretary of State May 28, 2025 Free speech is among the most cherished rights we enjoy as Americans. This right, legally enshrined in our constitution, has set us apart as a beacon of freedom around the world. Even as we take action to reject censorship at home, we see troubling instances of foreign governments and foreign officials picking up the slack. In some instances, foreign officials have taken flagrant censorship actions against U.S. tech companies and U.S. citizens and residents when they have no authority to do so. Today, I am announcing a new visa restriction policy that will apply to foreign nationals who are responsible for censorship of protected expression in the United States. It is unacceptable for foreign officials to issue or threaten arrest warrants on U.S. citizens or U.S. residents for social media posts on American platforms while physically present on U.S. soil. It is similarly unacceptable for foreign officials to demand that American tech platforms adopt global content moderation policies or engage in censorship activity that reaches beyond their authority and into the United States. We will not tolerate encroachments upon American sovereignty, especially when such encroachments undermine the exercise of our fundamental right to free speech. This visa restriction policy is pursuant to Section 212(a)(3)(C) of the Immigration and Nationality Act, which authorizes the Secretary of State to render inadmissible any alien whose entry into the Unites States “would have potentially serious adverse foreign policy consequences for the United States.” Certain family members may also be covered by these restrictions. Tags Foreign Governments Foreign Policy Freedom of Speech and Expression Immigration Office of the Spokesperson The Secretary of State"
    }
  ],
  "argos_summary": "The U.S. and EU have agreed to postpone addressing EU digital platform regulations in their trade deal, focusing instead on reducing non‑tariff barriers and avoiding reference to the Digital Services Act or Digital Markets Act. The agreement includes tariff concessions on U.S. auto parts and pharmaceuticals, but the EU will maintain a 15% tariff on most goods, while the U.S. will lower its tariffs on EU goods to 15%. The U.S. continues to press for changes to EU digital rules, especially around content moderation, and has announced visa restrictions on officials involved in censorship. The linked sources cover related topics such as EU competition enforcement, media ownership rules, antitrust clearances, and regulatory uncertainty for tech firms.",
  "argos_id": "H4GA9D6FM"
}