{
  "url": "https://www.newsweek.com/sports/mlb/could-orioles-destination-46-million-star-closer-after-felix-bautista-injury-2116714",
  "authorsByline": "Zach Pressnell",
  "articleId": "0ef28972a57f425ca290eaee243aebeb",
  "source": {
    "domain": "newsweek.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://d.newsweek.com/en/full/2706570/san-diego-padres-pitcher-robert-suarez.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T07:33:28-04:00",
  "addDate": "2025-08-21T11:41:04.868900+00:00",
  "refreshDate": "2025-08-21T11:41:04.868902+00:00",
  "score": 1.0,
  "title": "Could Orioles Be Destination For Star Closer After Felix Bautista Injury?",
  "description": "The Baltimore Orioles will be without Felix Bautista for at least a year after he underwent surgery again, and Baltimore needs to find a new closer.",
  "content": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nThe Baltimore Orioles were recently dealt the unfortunate news that closer Felix Bautista would miss the rest of the season with a shoulder injury.\n\nBautista underwent rotator cuff surgery and will miss at least the next 12 months of action. With that in mind, it's important to look at potential closer replacements for the Orioles as we quickly approach the offseason and eventually free agency.\n\nFanSided's Chris Landers recently suggested the Orioles could pursue San Diego Padres closer Robert Suarez in free agency after the unfortunate Bautista news.\n\n\"Suarez can opt out of his deal with the Padres at the end of the season, and considering both his production to date and the fact that San Diego just brought in Mason Miller, that seems all but assured,\" Landers wrote. \"He's not the most overwhelming guy to call on at the end of games — mostly because he doesn't miss nearly as many bats as you'd expect for someone who throws as hard as he does — but at a certain point the production speaks for itself.\n\n\"Suarez has posted a 2.99 ERA across 117.1 innings over the past two seasons, with 69 saves in that span. He knows how to pitch in big moments, he throws lots of strikes and he's got high-octane stuff. He will turn 35 in March, but there's no sign of diminishing stuff right now, and he likely won't break the bank due to his age and lack of eye-popping K numbers.\"\n\nSuarez will likely opt out of his contract with the Padres in the offseason. This would make him the perfect candidate for the Orioles to pursue on a two or three-year deal.\n\nThe flamethrower could slot in as the closer for the time being before moving to a set up role for Bautista as he ages.\n\nEither way, having Suarez and Bautista, when healthy, in the same bullpen would be dangerous for the Orioles.",
  "medium": "Article",
  "links": [
    "https://fansided.com/mlb/5-relievers-the-orioles-can-target-to-fill-the-felix-bautista-void-in-2026",
    "https://www.newsweek.com/sports/mlb/reds-elly-de-la-cruz-sends-3-word-message-quad-injury-concerns-2116606"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "closer Felix Bautista",
      "weight": 0.112426735
    },
    {
      "name": "San Diego Padres closer Robert Suarez",
      "weight": 0.10820278
    },
    {
      "name": "Felix Bautista",
      "weight": 0.092644095
    },
    {
      "name": "Felix Bautista Injury",
      "weight": 0.092385866
    },
    {
      "name": "potential closer replacements",
      "weight": 0.09041849
    },
    {
      "name": "Star Closer",
      "weight": 0.08770682
    },
    {
      "name": "San Diego Padres",
      "weight": 0.08734248
    },
    {
      "name": "Orioles",
      "weight": 0.084540464
    },
    {
      "name": "Bautista",
      "weight": 0.08236735
    },
    {
      "name": "Robert Suarez",
      "weight": 0.0762141
    }
  ],
  "topics": [
    {
      "name": "Baltimore Orioles"
    },
    {
      "name": "MLB"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97802734375
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.94482421875
    }
  ],
  "sentiment": {
    "positive": 0.11519678,
    "negative": 0.48963648,
    "neutral": 0.39516672
  },
  "summary": "The Baltimore Orioles have been dealt with the unexpected loss of their key player, Felix Bautista, due to a shoulder injury. FanSided's Chris Landers suggested that the Orioles may pursue San Diego Padres closer Robert Suarez in free agency. Suarez, who can opt out of his contract at the end of the season, has a 2.99 ERA across 117.1 innings over the past two seasons and 69 saves in that span. If healthy, combining Suarez and Bautism could pose a significant threat for the Orioles.",
  "shortSummary": "The Baltimore Orioles may pursue San Diego Padres closer Robert Suarez in free agency after Felix Bautista's season ended with a shoulder injury.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e7629ccada9142c3a2e973c8f1f9fee8",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.newsweek.com/sports/mlb/reds-elly-de-la-cruz-sends-3-word-message-quad-injury-concerns-2116606",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nThe Cincinnati Reds are in the midst of a very competitive postseason push with the New York Mets. Both clubs are vying for the final National League wild-card spot. The Mets have $760 million Juan Soto and a roster worth over a billion dollars. On the other hand, the Reds have Elly De La Cruz and one of the lowest payrolls in baseball.\nThe Reds' offense tends to only go as far as De La Cruz goes. Fortunately for Cincinnati, De La Cruz has been excellent for most of the season, and as a result, the Reds are in postseason contention in late August.\nBut the concerning piece with De La Cruz this season has been his stolen bases and speed. He's on pace to steal about 40 bases this season, which isn't a bad number, but he stole 67 bases a year ago. His sprint speed is slightly down, too.\nThis concern stems from a reported quad injury that has hampered De La Cruz for most of the season, but it hasn't been enough to keep him out of the lineup. The Reds' superstar has appeared in every game for the Reds this season.\nHe recently sent a message to the fans, media, and the baseball world regarding his injury.\n\"We're getting better,\" De La Cruz said following the Reds' win over the Los Angeles Angels on Tuesday night.\nOn Tuesday night, De La Cruz looked as fast, agile, and explosive as ever, as he scored from first base on a single against the Angels. Earlier in the game, he scored from first base on a bloop double that he had no business scoring on either.\nThe Reds are going to need him to be in the best shape possible for their postseason run. As all Cincinnati fans know, this team will only go as far as De La Cruz helps take them.\nMore MLB: Dodgers Fumble Chance To Replace Michael Conforto With Outfield Upgrade\nAbout the writer\nZach Pressnell is a Newsweek contributor based in Columbus, Ohio. His focus is MLB content. He has an extensive knowledge ... Read more"
    },
    {
      "url": "https://fansided.com/mlb/5-relievers-the-orioles-can-target-to-fill-the-felix-bautista-void-in-2026",
      "text": "While the Baltimore Orioles have long since been relegated to planning for 2026, the team's recent hot streak — Tuesday night's extra-innings win over the Boston Red Sox made it six victories in their last seven, a stretch that not coincidentally aligns with team's Opening Day lineup finally getting healthy — has given fans reason for optimism that the O's could be right back into contention next season.\nIf they're going to pull that off, though, they're going to need to do it without their All-Star closer. Baltimore got the worst possible news on big righty Felix Bautista on Wednesday: The man they call The Mountain, who's been on the shelf since July with a shoulder issue, has undergone surgery to repair a torn labrum and rotator cuff. According to MASN's Roch Kubatko, he'll be out for at least 12 months, throwing all of 2026 into jeopardy.\nBautista missed all of 2024 as he rehabbed from Tommy John surgery, but he was back looking like his All-Star self this season, with a 2.60 ERA and 50 strikeouts in just 34.2 innings of work. Now he's on the shelf again, and Baltimore will be back on the market for high-leverage help this winter.\nMike Elias is going to need to take a swing either via free agency or trade in order to compensate for the loss of Bautista. Luckily for he and his team, though, there are no shortage of options to consider.\nFor more news and rumors, check out MLB Insider Robert Murray’s work on The Baseball Insiders podcast, subscribe to The Moonshot, our weekly MLB newsletter, and join the discord to get the inside scoop during the MLB season.\n5. Pete Fairbanks, Tampa Bay Rays\nFairbanks comes with a reasonable team option for 2026 that the Rays will almost certainly pick up. But Tampa loves nothing more than staying one step ahead of free agency, so you can bet that the righty will be dangled in trade talks this offseason as the Rays look to get something in return rather than losing him for nothing next winter.\nFairbanks will be entering his age-32 season, but he shows no signs of slowing down, and he's quietly established himself as one of the game's most bankable relievers. He's got a 2.81 ERA since he burst onto the scene in 2020, and while he's lost a little velocity on his heater in the last year or two, his fastball/slider combination is still plenty effective. He's not the overwhelming force he once was, but he knows this division and knows how to get outs, and he can likely be had for cheaper than some of the other names on this list.\n4. Aroldis Chapman, Boston Red Sox\nWhy not keep Chapman's AL East tour going? The lefty is still lighting up radar guns at age 37, and he's authoring one of the very best seasons of his career for the Red Sox right now (1.13 ERA, 0.73 WHIP, 69 strikeouts in 48 innings).\nThis wouldn't be without risk, of course. Chapman can be a ... problematic locker room presence, and we've seen his effectiveness come and go on a year-to-year (or even week-to-week) basis. Relievers are inherently volatile, and Chapman is no exception. Plus, while he shows no signs of slowing down, Father Time comes for us all eventually.\nThen again, the ceiling is as high as anybody, and his age means that he's likely to be attainable on a one-year deal. And there's simply no making up for this sort of swing-and-miss stuff, especially in the era of the ghost runner in extra innings. If it clicks, he'll once again be among the best values on the market.\n3. Robert Suarez, San Diego Padres\nSuarez can opt out of his deal with the Padres at the end of the season, and considering both his production to date and the fact that San Diego just brought in Mason Miller, that seems all but assured. He's not the most overwhelming guy to call on at the end of games — mostly because he doesn't miss nearly as many bats as you'd expect for someone who throws as hard as he does — but at a certain point the production speaks for itself.\nSuarez has posted a 2.99 ERA across 117.1 innings over the past two seasons, with 69 saves in that span. He knows how to pitch in big moments, he throws lots of strikes and he's got high-octane stuff. He will turn 35 in March, but there's no sign of diminishing stuff right now, and he likely won't break the bank due to his age and lack of eye-popping K numbers.\n2. Ryan Helsley, New York Mets\nHelsley isn't doing his free agency any favors right now, as he's posted a 7.11 ERA since coming over to the Mets at the trade deadline while earning boos from his home crowd. But he was excellent for the Cardinals prior to the trade, and he's been among the better relievers in the sport for years now. It's much more likely that this is simply a blip on the radar as he acclimates to a new city and a new pennant chase, especially considering that his underlying metrics all still paint the picture of a high-leverage guy.\nHelsley's fastball is getting uncharacteristically hit around right now, but it's still an electric offering when he's locating it, consistently cracking triple digits. The chase rate and K rate are still elite, and he just turned 31 last month. The odds are good that he'll be back to looking like an All-Star closer next season, and who knows, maybe his current struggles will depress his market a little bit.\n1. Luke Weaver, New York Yankees\nHe might not have the save total or the name recognition as some of the guys above him on this list, but Weaver has done nothing but excel in whatever role the Yankees have asked of him over the last couple of years. Closer? Sure. Set-up man? You bet. Multiple innings? Whatever you need, Weaver has done it all and done it well.\nOf course, he doesn't have the longest track record of top-shelf relief work, and he's about to turn 32 years old. The stuff is legit, though, and there's little reason to believe that this is some sort of mirage or that the righty is due for regression. The movement profile on his fastball is excellent, his changeup is a true putaway pitch and he can attack both righties and lefties equally. Weaver is a fit no matter what you need, in other words, and while the Yankees will likely be motivated to keep him, hurting a division rival is always an added bonus."
    }
  ],
  "argos_summary": "The Baltimore Orioles’ closer Felix Bautista is out for the rest of the season after rotator cuff surgery, prompting the team to look for a replacement as the offseason approaches. FanSided’s Chris Landers recommends pursuing San Diego Padres closer Robert Suarez, who can opt out of his contract and offers strong two‑strikeout, high‑velocity relief at a reasonable cost. Suarez’s 2.99 ERA and 69 saves over two seasons make him a viable candidate for a two‑ or three‑year deal, potentially slotting in as closer before moving to a setup role. The article also lists other free‑agency options such as Ryan Helsley, Luke Weaver, and Aroldis Chapman, but highlights Suarez as the most attractive option for the Orioles’ bullpen needs.",
  "argos_id": "HYC7P2BO0"
}