{
  "url": "https://www.reuters.com/es/negocio/2EAYKXGW4RIXBP7WGQRTI2A6YY-2025-08-21/",
  "authorsByline": "Jaspreet Kalra",
  "articleId": "8f64dbfb48734d24ac12e320778dea56",
  "source": {
    "domain": "reuters.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.reuters.com/resizer/v2/466BJJQ7PVGY5O53NZ3KL65MHM.png?auth=b9c3bf166c40a6778eb5672993fde7c30a15f48329026674eff92afd8da1d0ca&height=1005&width=1920&quality=80&smart=true",
  "country": "us",
  "language": "es",
  "pubDate": "2025-08-21T12:21:07.444000+00:00",
  "addDate": "2025-08-21T12:29:25.489055+00:00",
  "refreshDate": "2025-08-21T12:29:25.489057+00:00",
  "score": 1.0,
  "title": "El dólar cae con los inversores preocupados por la independencia de la Fed y a la espera de Powell",
  "description": "El dólar estadounidense bajaba el jueves mientras los inversores esperaban las señales de política monetaria del simposio de Jackson Hole de la Reserva Federal, sin perder de vista la preocupación sobre la independencia del banco central tras la última intervención del presidente Donald Trump.",
  "content": "SINGAPUR, 21 ago (Reuters) - El dólar estadounidense bajaba el jueves mientras los inversores esperaban las señales de política monetaria del simposio de Jackson Hole de la Reserva Federal, sin perder de vista la preocupación sobre la independencia del banco central tras la última intervención del presidente Donald Trump.\n\n* Las divisas tuvieron una reacción tibia al anuncio de que Estados Unidos y la Unión Europea cerraron el acuerdo comercial marco que alcanzaron el mes pasado y que incluye un arancel estadounidense del 15% a la mayoría de las importaciones de la UE.\n\n* El euro y la libra esterlina cotizaban estables en 1,1649 dólares y 1,3460 dólares, respectivamente. El yen japonés bajaba un 0,3%, a 147,85 yenes por dólar, mientras que el franco suizo también sufría ligeras pérdidas.\n\n* La probabilidad de que la Reserva Federal recorte las tasas de interés el mes que viene se reducían ligeramente, al 79%, lo que ofreció un ligero apoyo al dólar, ya que la atención se centraba en la posición del presidente de la Reserva Federal, Jerome Powell.\n\n* Probablemente habrá una reacción mayor si Powell indica que la Fed podría mantener las tasas de interés estables de nuevo en septiembre, que si se inclina en la dirección de un recorte, dijo Kenneth Broux, jefe de investigación corporativa de divisas y tasas de Societe Generale.\n\n* \"Los riesgos son asimétricos. Dado que (un recorte) ya está descontado, el riesgo es que volvamos al 50-50\", agregó.\n\n* La reacción a esto sería una venta masiva de bonos del Tesoro de Estados Unidos de corto plazo y un dólar más fuerte, dijo Broux.\n\n* La petición del presidente Trump de que la gobernadora de la Fed, Lisa Cook, dimita por las acusaciones vertidas por uno de sus aliados políticos ha reavivado la preocupación de los inversores sobre los esfuerzos de este por ganar influencia sobre el banco central.\n\n* El índice del dólar , que mide la divisa estadounidense frente a otros seis pares, cotizaba estable en 98,337 y se encaminaba a una subida del 0,4% esta semana.",
  "medium": "Article",
  "links": [
    "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
    "https://www.reutersagency.com/en/licensereuterscontent/?utm_medium=rcom-article-media&utm_campaign=rcom-rcp-lead"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "stable interest rates",
      "weight": 0.09291784
    },
    {
      "name": "dollar",
      "weight": 0.08315291
    },
    {
      "name": "United States Treasury",
      "weight": 0.07848551
    },
    {
      "name": "last month",
      "weight": 0.074726745
    },
    {
      "name": "rates",
      "weight": 0.06642031
    },
    {
      "name": "investors",
      "weight": 0.065718114
    },
    {
      "name": "next month",
      "weight": 0.065306626
    },
    {
      "name": "President Donald Trump",
      "weight": 0.06452359
    },
    {
      "name": "Fed",
      "weight": 0.06397455
    },
    {
      "name": "currencies",
      "weight": 0.06395376
    }
  ],
  "topics": [
    {
      "name": "Federal Reserve"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.94482421875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.94384765625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.79736328125
    }
  ],
  "sentiment": {
    "positive": 0.07137163,
    "negative": 0.7986634,
    "neutral": 0.12996507
  },
  "summary": "",
  "shortSummary": "",
  "translation": "Singapore, Aug 21 (Reuters) - The US dollar went down on Thursday while investors waited for the monetary policy signals of the Jackson Hole symposium of the Federal Reserve, without losing sight of the concern about the independence of the Central Bank after the last intervention of President Donald Trump.\n\n* The currencies had a warm reaction to the announcement that the United States and the European Union closed the framework agreement that they reached last month and that includes an American tariff of 15% to most EU imports.\n\n* The euro and the sterling pound traded stable at $ 1,1649 and $ 1,3460, respectively. The Japanese yen down 0.3%, to 147.85 yen per dollar, while the Swiss Franco also suffered slight losses.\n\n* The probability that the Federal Reserve cut the interest rates next month were reduced slightly, to 79%, which offered a slight support to the dollar, since the attention focused on the position of the president of the Federal Reserve, Jerome Powell.\n\n* There will probably be a larger reaction if Powell indicates that the Fed could maintain stable interest rates again in September, that if it is inclined in the direction of a cut, said Kenneth Boux, head of corporate research of currencies and rates of Societe Generale.\n\n* \"The risks are asymmetric. Since (a cut) is already discounted, the risk is that we return to 50-50,\" he added.\n\n* The reaction to this would be a massive sale of the United States Treasury bonds and a stronger dollar, Boux said.\n\n* President Trump's request that the governor of the Fed, Lisa Cook, resigns for the accusations expressed by one of her political allies has revived investors' concern about her efforts to gain influence on the Central Bank.\n\n* The dollar index, which measures the American currency compared to six pairs, traded stable at 98,337 and was aimed at a 0.4% rise this week.",
  "translatedTitle": "The dollar falls with investors concerned with the independence of the Fed and waiting for Powell",
  "translatedDescription": "The US dollar went down on Thursday while investors waited for the monetary policy signs of the Jackson Hole symposium of the Federal Reserve, without losing sight of the concern about the independence of the Central Bank after the last intervention of President Donald Trump.",
  "translatedSummary": "The US dollar fell as investors waited for the monetary policy signals from the Jackson Hole symposium of the Federal Reserve. Concerns were raised about the independence of the Central Bank and the reduction of the probability of the Fed's interest rates being reduced to 79%. The euro and sterling pound traded stable at $1,1649 and $ 1,3460 respectively. The Japanese yen also saw slight losses. The president of the federal Reserve, Jerome Powell, is expected to indicate that the Fed could maintain stable interest rates in September.",
  "reprint": false,
  "reprintGroupId": "32609f751665418fb59d0f4ad3a0421d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
      "text": "The Trust Principles\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity, and freedom from bias in the gathering and dissemination of information and news.\nTrust Principles – the history\nThe Trust Principles were created in 1941, in the midst of World War II, in agreement with The Newspaper Proprietors Association Limited and The Press Association Limited (being the Reuters shareholders at that time). The Trust Principles imposed obligations on Reuters and its employees to act at all times with integrity, independence, and freedom from bias.\nReuters Directors and shareholders were determined to protect and preserve the Trust Principles when Reuters became a publicly traded company on the London Stock Exchange and Nasdaq. A unique structure was put in place to achieve this. A new company was formed and given the name 'Reuters Founders Share Company Limited', its purpose being to hold a 'Founders Share' in Reuters.\nThe legal structure has evolved over time and the Founders Share and other contractual arrangements now confer a number of special rights upon the Thomson Reuters Founders Share Company. For example, (i) the Thomson Reuters Founders Share Company has enhanced voting rights in circumstances where someone is seeking to obtain a significant shareholding in, or acquire control of, Thomson Reuters and (ii) the prior consent of the Thomson Reuters Founders Share Company must be sought prior to undertaking any sale of, or other material transaction involving, the Reuters news business unit.\nThomson Reuters itself is obliged and committed to apply the Trust Principles to its operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the Thomson Reuters business and require Thomson Reuters Directors, in the performance of their duties, to have due regard to the Trust Principles, by the proper exercise of their powers and in accordance with their other duties as Directors.\nThe Trust Principles are:\n- That Reuters shall at no time pass into the hands of any one interest, group, or faction;\n- That the integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved;\n- That Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers and to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts;\n- That Thomson Reuters shall pay due regard to the many interests which it serves in addition to those of the media; and\n- That no effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business\nThomson Reuters Founders Share Company was established in 1984 when Reuters became a public company. The directors of Thomson Reuters Founders Share Company (known as ‘Trustees’) have a duty to ensure, to the extent possible, that the Trust Principles are complied with.\nThe Trustees are experienced and eminent people from diverse arenas in politics, diplomacy, media, public service and business. The Trustees are selected by a nomination committee and proposed to the board of the Thomson Reuters Founders Share Company for appointment. The nomination committee assists in scrutinizing candidates’ suitability and its members include two persons appointed by the chairman after consultation with the European Court of Human Rights and representatives of certain press associations. The Thomson Reuters Corporation board has two representatives on the nomination committee. The Chairman and Deputy Chairman of the Thomson Reuters Founders Share Company Board are members of the nomination committee, and the Chairman appoints three other directors of the Thomson Reuters Founders Share Company as members of the nomination committee. The Chairman of the Thomson Reuters Founders Share Company acts as chairman of the nomination committee.\nThe number of Trustees has to be at least 14 and not more than 18. Trustees have a minimum of two meetings per year, and receive reports on our activities in the different fields in which we operate (including Reuters news). The Trustees meet with both the Thomson Reuters Board and representatives of senior management. Through Thomson Reuters Founders Share Company's Chairman, regular contact is maintained with our company. The relationship is one of trust and confidence.\nIndependence of Thomson Reuters\nCustomers across the world depend on us to provide them with reliable and objective news and information.\nThis means that we have a special need to safeguard our independence and integrity and avoid any bias which may stem from control by specific individuals or interests.\nThe Thomson Reuters Trust Principles were adopted in 1941 and include the preservation of integrity, reliability of news, development of the news business, and related principles.\nToday, the Trust Principles are fundamental to our entire business.\nMore information\nContact us\nBrian Moss\nFor inquiries pertaining to Reuters reporting standards and the Trust Principles please email: brian.moss@thomsonreuters.com."
    }
  ],
  "argos_summary": "On Thursday the U.S. dollar weakened as markets awaited signals from the Federal Reserve at the Jackson Hole symposium, while concerns over the central bank’s independence were heightened by President Trump’s request for Fed Governor Lisa Cook to resign. The dollar’s decline was offset by a modest 15% U.S. tariff on most EU imports, keeping the euro and pound largely unchanged, and the yen fell 0.3%. Expectations for an upcoming Fed rate cut fell slightly to 79%, and analysts warned that a dovish Powell stance could trigger a sharp Treasury sell‑off and a stronger dollar.",
  "argos_id": "IBGK2IRII"
}