{
  "url": "https://www.washingtontimes.com/news/2025/aug/21/vp-jd-vance-heralds-trump-tax-cuts-georgia-calls-democratic-sen-jon/",
  "authorsByline": "The Washington Times https://www.washingtontimes.com, https://www.washingtontimes.com/staff/seth-mclaughlin/, Seth McLaughlin",
  "articleId": "b6711c98ac0745a19a81deeaa4458c2d",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2025/08/21/AP25233684136681_c0-234-5616-3510_s1200x700.jpg?cb8bdaaafe19aeefebbc81a4d50578aeb1d81bb7",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T19:17:27+00:00",
  "addDate": "2025-08-21T19:25:32.108855+00:00",
  "refreshDate": "2025-08-21T19:25:32.108857+00:00",
  "score": 1.0,
  "title": "VP Vance heralds Trump tax cuts in Georgia, calls Democratic Sen. Jon Ossoff ‘far-left liberal’",
  "description": "Vice President J.D. Vance traveled to Georgia on Thursday to promote the tax cuts that President Trump has signed into law and that Republicans plan to use in the midterm elections next year to energize their troops in competitive races across the country.",
  "content": "Vice President J.D. Vance traveled to Georgia on Thursday to promote the tax cuts that President Trump has signed into law and that Republicans plan to use in the midterm elections next year to energize their troops in competitive races across the country.\n\nA month after casting the deciding vote on the president’s signature economic “Big Beautiful bill,” Mr. Vance told supporters at a refrigeration manufacturing facility just south of Atlanta that the tax cuts are helping lift families.\n\n“We believe you ought to keep more of your hard-earned money, and we believe if you are busting your rear end every single day, the government ought to make it easier for you, not harder for you,” Mr. Vance said.\n\n“We are cutting taxes for American taxpayers. We are securing the border,” he said. “And we got a president who is standing with law enforcement to make it easier to clean up our streets, to make them safe for our young families.”\n\nThe focus on Georgia comes as both parties begin to prepare for the midterm elections, where Sen. Jon Ossoff, widely considered the most vulnerable Democrat, is seeking a second term.\n\nMr. Trump’s “Big Beautiful” law — which extended the 2017 tax cuts, increased funding for the military and border security, and curtails future Medicaid spending by establishing new eligibility requirements for beneficiaries — is an early dividing line in the Senate race.\n\nThe top contenders for the GOP nomination — Reps. Buddy Carter and Mike Collins; along with former Tennessee football coach Derek Dooley, whose father, Vince, was a Hall of Fame football coach at the University of Georgia — praised the law.\n\nMr. Ossoff voted against Mr. Trump’s signature bill, calling it a disaster and warning that it will leave hundreds of thousands of Georgians without health coverage and force rural hospitals to close their doors.\n\nBefore Mr. Vance’s visit, Mr. Ossoff said the Trump administration is doing “damage control” because of the blowback it has faced for “defunding hospitals and nursing homes to cut taxes for the wealthiest people in the country.”\n\n“Vance is being sent on this little errand to come and play defense in Georgia, defending a bill they can’t defend, trying to sell the unsellable,” Mr. Ossoff said Wednesday on MSNBC. “Let me just say this about J.D. Vance: he was supposed to be this avatar for a new GOP that was for working-class people in the United States.”\n\n“His legacy forever now is casting the decisive vote to throw millions of Americans off health care, throwing seniors out of their nursing home beds, all to serve the wealthiest and most powerful people in the country,” Mr. Ossoff said. “He has zero credibility as a champion for America’s working class, and the damage control he is trying to do in Georgia this week is going to fall flat.”\n\nOn Thursday, Mr. Vance fired back, saying Mr. Ossoff’s opposition to the Trump agenda has exposed him as a “far-left liberal” and dismissed the idea that people will lose their health coverage.\n\n“It is not about kicking people off health care, it is about kicking illegal aliens the hell out of this country so we can preserve health care for the American families who need it,” Mr. Vance said.\n\nMr. Vance said Mr. Trump made a “sacred promise” to the American public that only “illegal aliens” would “lose access to health care.”\n\nThe battle over the new law is part of a broader fight over whether the Trump administration and the GOP-led Congress are helping or hurting the economy, which remains a top-of-mind issue for voters across the country who are concerned about inflation, wages and jobs.\n\nConsumer prices have been relatively stable despite doomsday predictions about Mr. Trump’s sweeping tariffs, which are a tax on imports. Wholesale prices have risen slightly, however, particularly for items like furniture, causing some economists to worry that the cost of levies will be passed along to consumers in the coming months.\n\nThe Consumer Price Index rose 2.7% in July on an annualized basis, the government reported. The number was relatively mild but above the Federal Reserve’s preferred target of 2%.\n\nA recent analysis from Pew Research found that 46% of Americans disapprove of the “Big Beautiful” law, while 32% approve. The remaining individuals are not sure.\n\nA YouGov tracking poll showed Americans are pessimistic about the economy, with half saying the economy is “getting worse,” 27% saying it is “getting better,” and 19% saying it is “about the same.”\n\nDemographic changes in Georgia, particularly in the sprawling Atlanta suburbs, have altered the state’s political landscape, transforming the once-reliable Republican state into a more competitive battleground.\n\nMr. Trump carried Georgia by slightly more than 2 percentage points over Vice President Kamala Harris last fall. Four years earlier, Democrat Joe Biden won the state by roughly 12,000 votes.\n\nMr. Ossoff and Sen. Raphael Warnock also emerged victorious in the 2020 election cycle, handing Democrats control of the U.S. Senate.",
  "medium": "Article",
  "links": [
    "https://goo.gl/forms/xGjXcUKYsKxMeCUl1"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mr. Trump",
      "weight": 0.08686167
    },
    {
      "name": "Mr. Vance",
      "weight": 0.08082125
    },
    {
      "name": "Trump tax cuts",
      "weight": 0.07906191
    },
    {
      "name": "Mr. Ossoff",
      "weight": 0.078110196
    },
    {
      "name": "President Trump",
      "weight": 0.07132249
    },
    {
      "name": "Trump",
      "weight": 0.065180294
    },
    {
      "name": "Vice President J.D. Vance",
      "weight": 0.06406537
    },
    {
      "name": "Georgia",
      "weight": 0.06115129
    },
    {
      "name": "J.D. Vance",
      "weight": 0.059895
    },
    {
      "name": "health care",
      "weight": 0.059795164
    }
  ],
  "topics": [
    {
      "name": "DNC"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.994140625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.97900390625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.845703125
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.78173828125
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.6064453125
    }
  ],
  "sentiment": {
    "positive": 0.12277362,
    "negative": 0.6437591,
    "neutral": 0.23346734
  },
  "summary": "Vice President J.D. Vance has visited Georgia to promote the tax cuts signed into law by President Trump, which Republicans plan to use in the midterm elections to boost their troops in competitive races across the country. This comes as both parties prepare for the midterms. The “Big Beautiful” law, which extended the 2017 tax cuts, increased funding for the military and border security, and curtails future Medicaid spending by establishing new eligibility requirements for beneficiaries, is an early dividing line in the Senate race. Democratic Sen. Jon Ossoff, who voted against the bill, accused Vance of casting the decisive vote to throw millions of Americans off health care, and threatened to force rural hospitals to close their doors.",
  "shortSummary": "Vice President J.D. Vance promoted President Trump’s tax cuts in Georgia, facing criticism from Democrats and Republicans ahead of the midterm elections.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4b99bf9d6de1410194d0dec0bddfd395",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Vice President J.D. Vance visited Georgia to promote President Trump’s “Big Beautiful” tax‑cut law, arguing it lifts families and secures the border, while Senator Jon Ossoff denounces the bill as a disaster that will cut healthcare and close rural hospitals. Vance defends the law as protecting American families from illegal immigration, claiming it preserves health care for citizens, whereas Ossoff accuses the bill of favoring the wealthy and undermining seniors. The clash reflects a broader partisan divide over the law’s economic impact, with mixed public approval and concerns about inflation. Georgia’s shifting demographics have turned the state into a competitive battleground, making the debate crucial for the upcoming midterm elections. The debate underscores the GOP’s strategy to use the tax cuts to energize voters in key races.",
  "argos_id": "J05INLNQP"
}