{
  "url": "https://nypost.com/2025/08/21/us-news/career-criminal-with-31-prior-arrests-slashes-nyc-cafe-worker-cops/",
  "authorsByline": "Joe Marino, Larry Celona, Amanda Woods",
  "articleId": "e7f10b3846b044fc92f114e2bf449ea3",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/109880924.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T19:09:07+00:00",
  "addDate": "2025-08-21T19:12:57.288090+00:00",
  "refreshDate": "2025-08-21T19:12:57.288091+00:00",
  "score": 1.0,
  "title": "Career criminal with 31 prior arrests slashes NYC cafe worker who tried to kick him out: cops",
  "description": "Wagner Louis, 32 – who cops say has 31 prior arrests – was “acting disorderly” inside Moka & Co., a Yemeni coffee shop on West 34th Street near Seventh Avenue, when the 50-year-old worker asked…",
  "content": "A career criminal with nearly three dozen prior arrests — including attempted murder — slashed a Manhattan cafe worker in the neck when the employee tried to give him the boot Wednesday afternoon, cops said.\n\nWagner Louis, 32 – who cops say has 31 prior arrests – was “acting disorderly” inside Moka & Co., a Yemeni coffee shop on West 34th Street near Seventh Avenue, just after 3 p.m. when the 50-year-old worker asked him to leave, authorities said.\n\nLouis then flew into a rage, pulling out a metal object and slashing the employee on the neck, police said.\n\nThe wounded staffer was taken to Bellevue Hospital, where he was initially listed in critical condition but had stabilized by Thursday, police said.\n\nMeanwhile, the armed maniac fled the scene in a car, but cops caught up to him at 34th Street and Park Avenue, authorities said.\n\nLouis was charged with attempted murder, assault in the second and third degrees, second-degree menacing and criminal possession of a weapon, police said.\n\nHis rap sheet includes another attempted murder arrest – for allegedly shooting a 21-year-old man three times in the leg in the lobby of a building on East 22nd Street near Flatbush Avenue in Brooklyn on Nov. 22, 2023, according to cops and a criminal complaint.\n\nIn that case, a judge set bail at $150,000 cash or $300,000 bond, which Louis ultimately posted, according to the Brooklyn District Attorney’s Office.\n\nHis most recent prior arrest was on July 24, 2024 for criminal possession of stolen property, also in Brooklyn, police said.\n\nLouis has also been arrested for unauthorized use of a vehicle and grand larceny, cops said.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/21/us-news/nh-mom-who-killed-husband-2-kids-in-murder-suicide-hoped-to-get-help-before-its-too-late/",
    "https://nypost.com/2025/08/20/us-news/wild-footage-captures-massive-carnival-cruise-ship-brawl-that-erupted-over-chicken-tenders/",
    "https://nypost.com/2025/08/21/us-news/trumps-massive-500m-civil-fraud-fine-in-ag-tish-james-case-thrown-out-by-ny-appeals-court/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "attempted murder",
      "weight": 0.08552705
    },
    {
      "name": "West 34th Street",
      "weight": 0.08532729
    },
    {
      "name": "34th Street",
      "weight": 0.08367411
    },
    {
      "name": "cops",
      "weight": 0.083563484
    },
    {
      "name": "NYC cafe worker",
      "weight": 0.0812731
    },
    {
      "name": "criminal possession",
      "weight": 0.079223245
    },
    {
      "name": "East 22nd Street",
      "weight": 0.07900917
    },
    {
      "name": "Wagner Louis",
      "weight": 0.075184315
    },
    {
      "name": "Louis",
      "weight": 0.073171005
    },
    {
      "name": "Flatbush Avenue",
      "weight": 0.07313551
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.9921875
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.97900390625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.9677734375
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.94384765625
    },
    {
      "name": "/News/Other",
      "score": 0.363037109375
    }
  ],
  "sentiment": {
    "positive": 0.05815368,
    "negative": 0.705006,
    "neutral": 0.2368403
  },
  "summary": "Wagner Louis, a 32-year-old career criminal with 31 prior arrests, slashed a Manhattan cafe worker in the neck when he asked him to leave. The worker was taken to hospital but has since stabilized. Louis was charged with attempted murder, assault, and criminal possession of a weapon. His most recent arrest was for criminal possession and arson.",
  "shortSummary": "A career criminal with 31 prior arrests slashed a Manhattan cafe worker's neck, fleeing with $1.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1bd1d75f34834539a4363a654281fb42",
  "places": [
    {
      "osmId": "1132461378",
      "road": "Flatbush Avenue",
      "quarter": "Flatbush",
      "suburb": "Brooklyn",
      "city": "New York",
      "state": "New York",
      "postcode": "11234",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.6520607,
        "lon": -73.9591256
      }
    },
    {
      "osmId": "183103232",
      "road": "Park Avenue",
      "suburb": "Brooklyn",
      "city": "New York",
      "state": "New York",
      "postcode": "11206",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Clinton Hill",
      "coordinates": {
        "lat": 40.6959189,
        "lon": -73.9639687
      }
    },
    {
      "osmId": "5680413",
      "road": "34th Street",
      "suburb": "Kings County",
      "city": "New York",
      "state": "New York",
      "postcode": "11232",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Greenwood Heights",
      "coordinates": {
        "lat": 40.6553492,
        "lon": -74.0031222
      }
    },
    {
      "osmId": "881813181",
      "road": "7th Avenue",
      "suburb": "Brooklyn",
      "city": "New York",
      "state": "New York",
      "postcode": "11220",
      "country": "United States",
      "countryCode": "us",
      "amenity": "SEVENTH AVENUE",
      "coordinates": {
        "lat": 40.6340024,
        "lon": -74.01428759782293
      }
    },
    {
      "osmId": "5670600",
      "road": "West 34th Street",
      "suburb": "Manhattan",
      "city": "New York",
      "county": "New York County",
      "state": "New York",
      "postcode": "10001",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Manhattan Community Board 5",
      "coordinates": {
        "lat": 40.7496595,
        "lon": -73.9874153
      }
    },
    {
      "osmId": "5681655",
      "road": "East 22nd Street",
      "suburb": "Brooklyn",
      "city": "New York",
      "state": "New York",
      "postcode": "11235",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.6284296,
        "lon": -73.9549029
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/21/us-news/trumps-massive-500m-civil-fraud-fine-in-ag-tish-james-case-thrown-out-by-ny-appeals-court/",
      "text": "Trump’s massive $500M civil fraud fine in AG Tish James’ case thrown out by NY appeals court\nPresident Trump won a huge victory Thursday when a New York appeals court threw out the massive, more than $500 million fine he owed in Attorney General Letitia James’ business fraud case.\nThe Appellate Division, First Department, overturned the whopping $464 million judgment that Trump, 78, faced after he was found to have fraudulently inflated his net worth by billions of dollars over a decade to get better loan and insurance terms.\nMuch of the case, brought by New York Attorney General Letitia James, against Trump, however, still remains in place and will now go to New York’s highest court as the legal battle between the state’s top lawyer and the commander in chief continues.\nThe 323-page decision included three separate opinions, but all agreed the fine against Trump — which had grown to $515 million including interest — was “excessive.”\n“While the injunctive relief ordered by the court is well crafted to curb defendants’ business culture, the court’s disgorgement order, which directs that defendants pay nearly half a billion dollars to the State of New York, is an excessive fine that violates the Eighth Amendment of the United States Constitution,” the main opinion by Judges Dianne T. Renwick and Peter H. Moulton read.\nStill, the five-judge panel kept in place a ban on Trump and his two eldest sons, Donald Trump Jr. and Eric Trump, from running a company in New York for several years. And the ruling kept in place an order for an outside monitor to oversee and file reports on the Trump Organization’s business dealings for three years.\nThose parts of the ruling had been on hold while the appeal was decided. And Trump posted a $175 million bond in place of paying the entire judgment during the appeal process.\nSince there wasn’t a majority reached in Thursday’s decision, the case can automatically qualify to be heard in the Empire State’s top court — the New York Court of Appeals.\nThe interest and fines against everyone in the case — including Don Jr. and Eric, and other Trump Org. execs — have ballooned to over $527 million since the February 2024 ruling from Manhattan Supreme Court Justice Arthur Engoron.\nThursday’s decision was a blow to James — whose office prosecuted Trump — and to Engoron, as at least one of the appellate judges found Engoron made “errors” in his rulings on the case.\nJames accused Trump and others of carrying out a “staggering fraud.” But the Republican commander-in-chief maintained his innocence, claiming that he was a target of the AG’s politically motivated prosecution.\nTrump lauded the ruling in two lengthy posts on Truth Social, repeating claims that the case was a “political witch hunt.”\n“TOTAL VICTORY in the FAKE New York State Attorney General Letitia James Case!,” Trump posted. “I greatly respect the fact that the Court had the Courage to throw out this unlawful and disgraceful Decision that was hurting Business all throughout New York State.”\nMeanwhile, James, in her own statement, glossed over the fact that the judgment was vacated, also playing the decision off as a victory.\n“The First Department today affirmed the well-supported finding of the trial court; Donald Trump, his company, and two of his children are liable for fraud.”\nJames said her office would appeal.\nEd Martin, Trump’s political weaponization czar, called for James to step down as the Empire State’s top lawyer after he launched a probe into allegations that she committed mortgage fraud on a Brooklyn townhouse and a Virginia home.\nMartin, the director of the Justice Department’s Weaponization Working Group, even showed up outside James’ multi-family residential property in Brooklyn last week.\n“I’m just happy to be on a block looking at houses,” Martin told a Post reporter at the time. “I’m just looking at houses, interesting houses. It’s an important house.”\nThe appeal court’s decision follows a theatrical, 11-week trial that threatened to derail Trump’s image as a real estate tycoon — and brand him as a fraudster — as he campaigned to regain the White House.\nTrial evidence revealed that Trump secured cushy interest rates between 2011 and 2021 after goosing up the value of assets like his Big Apple penthouse and Mar-a-Lago estate on financial papers.\nTrump’s business falsely claimed that his Trump Tower triplex was 30,000 square feet — rather than its true size of 11,000 square feet — and used the phony figures to pump up the pad’s value to $327 million in 2015 after claiming it was worth $80 million just four years earlier, evidence showed.\nTrump also valued Mar-a-Lago at $517 million on a financial filing despite his own tax broker admitting to listing the palatial estate’s “market value” at just $27 million in 2020, a witness revealed.\nTrump tax representative Michael Corbiciero testified that he used the lowball valuation — which is far below the estate’s value if it were sold as a private home — by calling the estate a “social club,” a distinction that scored Trump juicy tax breaks.\nThe deed for Mar-A-Lago bars Trump from selling the estate as anything but a social club, trial evidence shows.\nTrump nonetheless told banks and insurers that the Palm Beach estate was worth $517 million, and boasted during the trial that it was actually worth up to $1.5 billion, which would make it four times more valuable than the most expensive private home listed in the country.\n“The frauds found here leap off the page and shock the conscience,” Engoron wrote in his ruling.\nThe ruling comes after some members of the five-judge appeals panel appeared skeptical in September of the merits of the lawsuit brought by New York Attorney General Letitia James, which led to the trial.\nJudge Peter Moulton called the size of the penalty “troubling” and questioned if the law James had used to sue Trump, which doesn’t technically require someone to be “harmed,” had “morphed into something it was not meant to do.”\nThe case roiled the soon-to-be 47th president, who chose to leave the campaign trail for several days to attend the trial, calling the proceedings a “political witch hunt” and insisting that he did “nothing wrong.”\nEngoron and James are both elected Democrats, and James campaigned on a promise to investigate Trump, calling the then-president a “con man” and ″carnival barker.”\nTrump’s lawyers argued that the case had no “victims” and that “sophisticated” companies like Deutsche Bank did their own research before entering into the deals, and were all paid back in full.\nBut James’ office argued that Trump’s fudged financial filings were nonetheless harmful to the marketplace as a whole — and Engoron agreed.\n“The next group of lenders to receive bogus statements might not be so lucky,” he wrote in his ruling."
    },
    {
      "url": "https://nypost.com/2025/08/20/us-news/wild-footage-captures-massive-carnival-cruise-ship-brawl-that-erupted-over-chicken-tenders/",
      "text": "Disturbing video captures moment wild Carnival Cruise ship brawl breaks out ‘over chicken tenders’\nFried and furious.\nDisturbing footage captured the moment a massive melee broke out on a Carnival Cruise ship among fuming passengers seemingly upset over “chicken tenders.”\nThe violence among about two dozen brawlers erupted aboard the Sunshine at about 2 a.m. Monday — the last day of its voyage — as the ship was heading back to Miami, according to a passenger who filmed the mayhem.\n“Where the f–k is security?!” one bystander could be heard yelling in the footage as passengers trade blows and slam each other to the floor.\nMultiple security guards could be seen trying to break up the fight, with one overwhelmed officer fleeing the chaos and reaching for his radio as shoes went flying.\nAt one point, Bronx content creator Mike Terra — who filmed the uproar and shared it on his social media channels — flipped the camera to record his own reaction.\n“Over chicken tenders is crazy,” Terra said in the video.\nThe avid cruiser later responded to intrigued commenters, calling the ruckus an “isolated incident” that escalated over “more” than just food around 2 a.m. after the ship set sail from Miami.\nAnd when reached by The Post on Wednesday, Terra admitted: “We weren’t close enough to know why [the fight] really started, we just knew they were in line for food.”\nTerra captioned his video: “I always hear carnival is ghetto/ratchet I been cruising for years but this my 1st time seeing some action on a ship I was on YNs was tripping.”\nIt remains unclear what sparked the commotion.\nThe ship set sail from Miami last Thursday and made two stops in the Bahamas before returning to the Sunshine State on Monday.\nCarnival did not immediately respond to The Post’s request for comment."
    },
    {
      "url": "https://nypost.com/2025/08/21/us-news/nh-mom-who-killed-husband-2-kids-in-murder-suicide-hoped-to-get-help-before-its-too-late/",
      "text": "Troubled mom who killed husband, 2 kids in murder-suicide made sad admission, posted ominous TikToks weeks before tragedy\nThe struggling mom who killed her husband and two kids in a shocking murder-suicide had recently admitted that she needed professional help — ominously saying she hoped she would get it before “it’s too late.”\nIn the weeks before she shot herself and her family, Emily Long, 34, had posted videos on TikTok detailing her declining mental state as she prepared for family life without her husband, Ryan Long, 48, who had been diagnosed with terminal glioblastoma, an aggressive form of brain cancer.\n“I feel very, very lonely. I feel so anxious,” she said just two weeks ago in a video shared on her private account, the Daily Mail reported.\n“I know that I need to see a therapist, I know that I need to ask for help,” she wrote.\n“I feel so guilty that I’m not ready to get help yet, but … it is what it is, right? I know that I will one day, and I hope that I make the decision before I feel that it’s too late,” she added.\nEmily Long said she felt as if she were “withering away” and knew it was “only going to get worse.”\nAs her husband’s condition deteriorated, Emily appeared to become overwhelmed at the possibility of one day becoming a single mom.\nShe said she was trying to remain positive but at the same time had to “plan to be a widow, and plan to support your family on one income and to be a single parent of three kids and juggle all the things that come with that.”\n“I’m mourning my husband, I’m mourning my marriage and it’s still there. It’s very confusing and it’s very overwhelming,” she said in the TikTok clip, according to the Daily Mail.\nEmily Long shot her husband and her two eldest children, Parker, 8, and Ryan, 6, before taking her own life at their New Hampshire home early Monday, according to authorities.\nThe bodies of the four family members were discovered Monday at their home in Madbury, outside the city of Dover near the Maine border.\nThe couple’s 3-year-old child — the lone survivor of the slaughter — was found alive and unharmed inside the house and is now in the care of family members.\nThe mom’s death was ruled a suicide while her family members’ death were ruled homicides.\nA gun was found near their bodies, officials said.\nIn another chilling TikTok posted just two days before the shooting, Emily Long told her followers that her children were “definitely struggling” and she herself had been “really depressed” as she tried to restore healthy habits and normalcy in the home as her husband’s health declined.\n“I am determined to create normalcy,” she said in her grim video.\n“I’m making a point to get out of my depression and do this for my family,” she added.\nIf you or someone you know is affected by any of the issues raised in this story, call the National Suicide Prevention Lifeline at 800-273-TALK (8255) or text Crisis Text Line at 741741."
    }
  ],
  "argos_summary": "A 32‑year‑old criminal with 31 prior arrests slashed a Manhattan cafe worker after being asked to leave, was arrested and charged with attempted murder and other offenses. A New York appeals court threw out a $515 million civil fraud fine against former President Trump, but kept a ban on his company and a monitoring order in place, and the case will move to the state’s highest court. A video of a chaotic brawl on the Carnival Sunshine cruise ship, sparked by a dispute over chicken tenders, went viral as security struggled to control the fight. In a separate tragedy, a 34‑year‑old mother who had posted TikToks about her mental health and her husband’s terminal illness killed her husband and two children before taking her own life, leaving a 3‑year‑old survivor.",
  "argos_id": "J7CQR6KGJ"
}