{
  "url": "https://finance.yahoo.com/news/yangaroo-announces-q22025-financial-results-120000456.html",
  "authorsByline": "Newsfile Corp.",
  "articleId": "74c424359a774457b248ce7230c742e4",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/newsfile_64/486567339122251863c95898d91e3a8a",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T12:00:00+00:00",
  "addDate": "2025-08-21T12:20:14.894131+00:00",
  "refreshDate": "2025-08-21T12:20:14.894133+00:00",
  "score": 1.0,
  "title": "Yangaroo Announces Q2'2025 Financial Results",
  "description": "Reports Twelfth Consecutive Quarter of Positive Normalized EBITDA Amid Challenging Market Conditions Toronto, Ontario--(Newsfile Corp. - August 21, 2025) - YANGAROO Inc. (TSXV: YOO) (\"Yangaroo\", \"Company\"), a software leader in media asset workflow and distribution solutions, today announced its financial results for the second quarter ended June 30, 2025. The second quarter financial statements and corresponding management's discussion and analysis (the \"Second Quarter Filings\") are available a",
  "content": "Grant Schuetrumpf, President and CEO of Yangaroo, commented, \"We are pleased to report our twelfth consecutive quarter of positive Normalized EBITDA, reflecting the strength of our operations and our ongoing commitment to exceptional client service. While the macro market dynamics in the advertising and music sectors have created near-term headwinds, our disciplined approach and resilient business model position us well to navigate these challenges. As we move into the second half of 2025, we remain focused on executing our growth strategy, expanding our customer base, and investing in our platforms to capture both organic and non-organic opportunities across all divisions.\"\n\nFor the six months ended June 30, 2025, operating income and Normalized EBITDA were $5,747 and $485,160, respectively, compared to operating income of $128,075 and Normalized EBITDA of $575,399 for the six months ended June 2024.\n\nFor the three months ended June 30, 2025, operating loss and Normalized EBITDA were $18,777 and $220,909 respectively, compared to operating income of $110,704 and Normalized EBITDA of $337,818 in Q2'2024.\n\nHowever, despite the Company's continued focus and strategic efforts, total revenue for the quarter declined by $298,248, or approximately 15% year over year. The Company attributes the recent decline in part to ongoing geopolitical tensions and protectionist trade measures implemented by the U.S. government. The resulting tariff-related cost increases have led many brands to balance between absorbing a significant share of these expenses and selectively passing them on to consumers. For those prioritizing price competitiveness, the added cost pressures have eroded margins, leading to tighter cost controls and, in some cases, reductions in discretionary spending such as marketing. In the Company's view, this cautious spending environment has directly impacted the performance of Yangaroo's Advertising division. Despite these events and headwinds, the Company's continued emphasis on operational efficiency and disciplined cost control led to a smaller negative impact on operating income than expected.\n\nThe Company is pleased to report its twelfth consecutive quarter of positive Normalized EBITDA in the second quarter ended June 30, 2025. Management believes this is a demonstrative result of the Company's strong focus on strategic execution and cost management within the challenging environment imposed by the current geopolitical situation.\n\nToronto, Ontario--(Newsfile Corp. - August 21, 2025) - YANGAROO Inc. (TSXV: YOO) (\" Yangaroo \", \" Company \"), a software leader in media asset workflow and distribution solutions, today announced its financial results for the second quarter ended June 30, 2025. The second quarter financial statements and corresponding management's discussion and analysis (the \"Second Quarter Filings\") are available at www.yangaroo.com and on the Company's profile at www.sedarplus.ca . Please note that all currency in this press release is denominated in United States dollars , unless otherwise noted.\n• Revenue in Q2'2025 was $1,651,441 compared to $1,949,689 and $1,782,058 in the second quarter of 2024 and the first quarter of 2025, respectively.\n• Revenue decreased by $298,248, or 15%, versus Q2'2024. This was the result of a decrease in Advertising revenue of $222,360, or 16%, and a decrease in Entertainment revenue of $75,888, or 14%.\n• Revenue decreased by $130,617, or 7%, versus Q1'2025. The decrease in revenue was primarily attributed to lower Advertising revenue of $221,980, or 16%, offset by higher Music and Awards revenue with an increase of $27,752, or 12%, and $63,611, or 39%, respectively. The decrease in Advertising revenue can be strongly attributed to the current geopolitical situation, while the increase in Music and Awards revenue is due to seasonality with the second quarter typically having a higher volume and spend period.\n• Operating expenses in Q2'2025 were $1,670,218 compared to $1,838,985 and $1,757,532 in the second quarter of 2024 and the first quarter of 2025, respectively.\n• Operating expenses decreased by $168,767, or 9%, versus Q2'2024. The decrease in operating expenses was primarily attributed to reductions across headcount, marketing, general and administrative expenses, and technology and production expenses, offset by a slightly higher depreciation expense.\n• Operating expenses decreased by $87,314, or 5%, versus Q1'2025. The decrease in operating expenses was primarily attributed to the Company's cost control initiatives, which resulted in lower salaries, lower technology expenses, and lower general and marketing expenses.\n• Normalized EBITDA in Q2'2025 was $220,909 in comparison to Normalized EBITDA of $337,818 in Q2'2024 and Normalized EBITDA of $264,251 in Q1'2025.\n• Normalized EBITDA decreased by $116,909, or 35%, compared to Q2'2024. The decrease was primarily attributed to the overall decrease in revenue.\n• Normalized EBITDA decreased by $43,342, or 16%, compared to Q1'2025. This decrease was also primarily attributed to the overall decrease in revenue.\n\nDuring the quarter, the Company reached a settlement agreement of $60,000 with one of the defendant shareholders in connection with the ongoing legal proceedings related to the 2021 acquisition of Digital Media Services Inc. (\"DMS\").\n\nSubsequent to the quarter, the Company also reached a second settlement agreement for $150,000 with the accounting firm named in the same lawsuit.\n\nPursuant to the previously disclosed shares for services arrangement (the \"Shares for Services Arrangement\") entered into between the Company and Grant Schuetrumpf, the Company will issue a total of 81,123 common shares of the Company (the \"Shares\") for the months of May through July 2025, as follows:\n• 31,520 Shares at a price of $0.07 per Share for the month of June;\n• 49,603 Shares at a price of $0.09 per Share for the months of May and July, collectively.\n\nUpon the issuance of the Shares, the Company will have issued a cumulative total of 281,473 Shares for the months of January through July 2025 under the Shares for Services Arrangement.\n\nAs Mr. Schuetrumpf is an officer and director of the Company, the issuance of the Shares under the Shares for Services Arrangement is considered a \"related party transaction\" under Multilateral Instrument 61-101 – Protection of Minority Security Holders In Special Transactions (\"MI 61-101\") and the TSXV. The Company is relying on the exemptions from the formal valuation and the minority shareholder approval requirements of MI-61-101 contained in section 5.5 (a) and Section 5.7 (1)(a) as the fair market value of the common shares being issued to insiders in connection with the Shares for Services Arrangement does not exceed 25% of the market capitalization of the Company, as determined in accordance with MI 61-101.\n\nYangaroo is a technology provider in the media and entertainment industry, offering a cloud-based software platform for the management and distribution of digital media content. Yangaroo's Digital Media Distribution System (\"DMDS\") platform is a patented cloud-based platform that provides customers with a centralized and fully integrated workflow directly connecting radio and television broadcasters, digital display networks, and video publishers for centralized digital asset management, delivery, and promotion. DMDS is used across the advertising, music, and entertainment awards show markets.\n\nThe address of the Company's corporate office and principal place of business is 360 Dufferin Street, Suite 203, Toronto, Ontario, M6K 1Z8.\n\nNeither the TSX Venture Exchange nor Its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the accuracy of this release.\n\nUse of Non-IFRS Financial Measures\n\nThe following non-IFRS definitions are used in the press release because management believes that they provide useful information regarding the Company's ongoing operations. Readers are cautioned that the definitions are not recognized measures under IFRS, do not have standardized meanings prescribed by IFRS, and should not be construed to be alternatives to revenues and net earnings determined in accordance with IFRS or as an indicator of performance, liquidity, or cash flows. The Company's method of calculating these measures may differ from the methods used by other entities and accordingly, these measures may not be comparable to similarly titled measures used by other entities or in other jurisdictions.\n\nEBITDA as defined by the Company means Earnings Before Interest and financing costs (net of interest income), Income Taxes, Depreciation, and Amortization. EBITDA is derived from the statements of comprehensive income (loss) and can be computed as revenues less salaries and consulting expenses, technology and production expenses, marketing and promotion expenses, general and administrative expenses, any gain (loss) on the remeasurement of fair value and contingent consideration, foreign exchange (gain) loss, and any non-recurring items such as restructuring expenses, government subsidies, and goodwill impairment.\n\nNormalized EBITDA, as defined by the Company, means EBITDA adjusted for one-time non-recurring or non-cash items such as share-based compensation expenses, acquisition fees, restructuring fees, foreign-exchange expenses, revaluation of embedded derivative liability, revaluation on contingent consideration, and goodwill impairment.\n\nEBITDA Margin and Normalized EBITDA Margin as defined by the Company means EBITDA and Normalized EBITDA, respectively, as a percentage of revenue.\n\nWorking capital as defined by the Company means current assets less current liabilities.\n\nLiquidity as defined by the Company means cash plus the available capacity in the Company's revolving credit facility.\n\nThe Company believes EBITDA, EBITDA margin, liquidity, and working capital, are useful measures because they provide information to both management and investors with respect to the operating and financial performance of the Company.\n\nThis news release contains certain forward-looking statements and forward-looking information (collectively referred to herein as \"forward-looking statements\") within the meaning of applicable Canadian securities laws. All statements other than statements of present or historical fact are forward-looking statements. Forward-looking statements are often, but not always, identified by the use of words such as \"anticipate\", \"achieve\", \"could\", \"believe\", \"plan\", \"intend\", \"objective\", \"continuous\", \"ongoing\", \"estimate\", \"outlook\", \"expect\", \"may\", \"will\", \"project\", \"should\" or similar words, including negatives thereof, suggesting future outcomes.\n\nForward looking statements are subject to both known and unknown risks, uncertainties and other factors, many of which are beyond the control of YANGAROO, that may cause the actual results, level of activity, performance or achievements of YANGAROO to be materially different from those expressed or implied by such forward looking statements. Although YANGAROO has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements, there may be other factors that cause results not to be as anticipated, estimated or intended. The Company is making forward-looking statements with respect to the issuance of the Shares pursuant to the Shares for Services Arrangement, including the number of Shares to be issued.\n\nForward-looking statements are not a guarantee of future performance and involve a number of risks and uncertainties, some of which are described herein. Such forward-looking statements necessarily involve known and unknown risks and uncertainties, which may cause YANGAROO's actual performance and results to differ materially from any projections of future performance or results expressed or implied by such forward-looking statements. Any forward-looking statements are made as of the date hereof and, except as required by law, YANGAROO assumes no obligation to publicly update or revise such statements to reflect new information, subsequent or otherwise.\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/263292",
  "medium": "Article",
  "links": [
    "https://api.newsfilecorp.com/redirect/zAAKyuoN44"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Company",
      "weight": 0.06405321
    },
    {
      "name": "such statements",
      "weight": 0.06273742
    },
    {
      "name": "Operating expenses",
      "weight": 0.061860535
    },
    {
      "name": "operating expenses",
      "weight": 0.061860535
    },
    {
      "name": "lower technology expenses",
      "weight": 0.057061896
    },
    {
      "name": "cost management",
      "weight": 0.055753347
    },
    {
      "name": "Normalized EBITDA Margin",
      "weight": 0.0553712
    },
    {
      "name": "Normalized EBITDA",
      "weight": 0.05512549
    },
    {
      "name": "Non-IFRS Financial Measures",
      "weight": 0.054853182
    },
    {
      "name": "positive Normalized EBITDA",
      "weight": 0.05440626
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.95263671875
    },
    {
      "name": "/Business & Industrial/Advertising & Marketing/Marketing",
      "score": 0.748046875
    },
    {
      "name": "/Business & Industrial/Advertising & Marketing/Other",
      "score": 0.623046875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.31640625
    }
  ],
  "sentiment": {
    "positive": 0.11243546,
    "negative": 0.7762761,
    "neutral": 0.11128845
  },
  "summary": "Yangaroo Inc. (TSXV: YOO), a software leader in media asset workflow and distribution solutions, has announced its financial results for the second quarter of 2025. The company reported its twelfth consecutive quarter of positive Normalized EBITDA, reflecting the strength of its operations and commitment to client service. However, total revenue for the quarter declined by $298,248, or approximately 15% year over year, largely due to ongoing geopolitical tensions and protectionist trade measures implemented by the U.S. government. Despite these challenges, the company remains focused on executing its growth strategy, expanding its customer base, and investing in our platforms to capture both organic and non-organic opportunities across all divisions. The second quarter financial statements and management's discussion and analysis are available at www.yangaroo.com and on the company's profile at wwwsedarplus.ca.",
  "shortSummary": "Yangaroo reported a twelfth consecutive quarter of positive Normalized EBITDA despite declining revenue due to geopolitical tensions and trade measures, despite continued operational efficiency and cost control measures.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "8840c041d5994c5a815479595e1dea1d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://api.newsfilecorp.com/redirect/zAAKyuoN44",
      "text": "Yangaroo Announces Q2'2025 Financial Results\nReports Twelfth Consecutive Quarter of Positive Normalized EBITDA Amid Challenging Market Conditions\nAugust 21, 2025 8:00 AM EDT | Source: Yangaroo Inc.\nToronto, Ontario--(Newsfile Corp. - August 21, 2025) - YANGAROO Inc. (TSXV: YOO) (\"Yangaroo\", \"Company\"), a software leader in media asset workflow and distribution solutions, today announced its financial results for the second quarter ended June 30, 2025. The second quarter financial statements and corresponding management's discussion and analysis (the \"Second Quarter Filings\") are available at www.yangaroo.com and on the Company's profile at www.sedarplus.ca. Please note that all currency in this press release is denominated in United States dollars, unless otherwise noted.\nThe Company is pleased to report its twelfth consecutive quarter of positive Normalized EBITDA in the second quarter ended June 30, 2025. Management believes this is a demonstrative result of the Company's strong focus on strategic execution and cost management within the challenging environment imposed by the current geopolitical situation.\nHowever, despite the Company's continued focus and strategic efforts, total revenue for the quarter declined by $298,248, or approximately 15% year over year. The Company attributes the recent decline in part to ongoing geopolitical tensions and protectionist trade measures implemented by the U.S. government. The resulting tariff-related cost increases have led many brands to balance between absorbing a significant share of these expenses and selectively passing them on to consumers. For those prioritizing price competitiveness, the added cost pressures have eroded margins, leading to tighter cost controls and, in some cases, reductions in discretionary spending such as marketing. In the Company's view, this cautious spending environment has directly impacted the performance of Yangaroo's Advertising division. Despite these events and headwinds, the Company's continued emphasis on operational efficiency and disciplined cost control led to a smaller negative impact on operating income than expected.\nFor the three months ended June 30, 2025, operating loss and Normalized EBITDA were $18,777 and $220,909 respectively, compared to operating income of $110,704 and Normalized EBITDA of $337,818 in Q2'2024.\nFor the six months ended June 30, 2025, operating income and Normalized EBITDA were $5,747 and $485,160, respectively, compared to operating income of $128,075 and Normalized EBITDA of $575,399 for the six months ended June 2024.\nGrant Schuetrumpf, President and CEO of Yangaroo, commented, \"We are pleased to report our twelfth consecutive quarter of positive Normalized EBITDA, reflecting the strength of our operations and our ongoing commitment to exceptional client service. While the macro market dynamics in the advertising and music sectors have created near-term headwinds, our disciplined approach and resilient business model position us well to navigate these challenges. As we move into the second half of 2025, we remain focused on executing our growth strategy, expanding our customer base, and investing in our platforms to capture both organic and non-organic opportunities across all divisions.\"\nQ2'2025 Financial Highlights\n- Revenue in Q2'2025 was $1,651,441 compared to $1,949,689 and $1,782,058 in the second quarter of 2024 and the first quarter of 2025, respectively.\nRevenue decreased by $298,248, or 15%, versus Q2'2024. This was the result of a decrease in Advertising revenue of $222,360, or 16%, and a decrease in Entertainment revenue of $75,888, or 14%.\nRevenue decreased by $130,617, or 7%, versus Q1'2025. The decrease in revenue was primarily attributed to lower Advertising revenue of $221,980, or 16%, offset by higher Music and Awards revenue with an increase of $27,752, or 12%, and $63,611, or 39%, respectively. The decrease in Advertising revenue can be strongly attributed to the current geopolitical situation, while the increase in Music and Awards revenue is due to seasonality with the second quarter typically having a higher volume and spend period.\n- Operating expenses in Q2'2025 were $1,670,218 compared to $1,838,985 and $1,757,532 in the second quarter of 2024 and the first quarter of 2025, respectively.\nOperating expenses decreased by $168,767, or 9%, versus Q2'2024. The decrease in operating expenses was primarily attributed to reductions across headcount, marketing, general and administrative expenses, and technology and production expenses, offset by a slightly higher depreciation expense.\nOperating expenses decreased by $87,314, or 5%, versus Q1'2025. The decrease in operating expenses was primarily attributed to the Company's cost control initiatives, which resulted in lower salaries, lower technology expenses, and lower general and marketing expenses.\n- Normalized EBITDA in Q2'2025 was $220,909 in comparison to Normalized EBITDA of $337,818 in Q2'2024 and Normalized EBITDA of $264,251 in Q1'2025.\nNormalized EBITDA decreased by $116,909, or 35%, compared to Q2'2024. The decrease was primarily attributed to the overall decrease in revenue.\nNormalized EBITDA decreased by $43,342, or 16%, compared to Q1'2025. This decrease was also primarily attributed to the overall decrease in revenue.\nFinancial Highlights\n| Q2 2025 | Q1 2025 | Q4 2024 | Q3 2024 | ||||||||||||||\n| Cash | $ | 271,234 | $ | 217,088 | $ | 231,083 | 105,906 | ||||||||||\n| Working Capital (Deficiency) | (2,140,887) | (1,900,378) | (1,841,495) | (1,787,761) | |||||||||||||\n| Liquidity | 656,059 | 686,618 | 717,583 | 550,386 | |||||||||||||\n| Revenue | 1,651,441 | 1,782,058 | 2,241,659 | 1,942,525 | |||||||||||||\n| Operating Expenses | 1,670,218 | 1,757,532 | 1,950,876 | 1,593,542 | |||||||||||||\n| Other Expenses (Income) | 255,720 | 152,424 | (92,192) | 179,406 | |||||||||||||\n| Income Tax Expense (Recovery) | 6,671 | 909 | (97,327) | - | |||||||||||||\n| After-Tax Income (Loss) for the Period | (281,168) | (128,807) | 480,302 | 169,577 | |||||||||||||\n| Income (Loss) per Share – Basic | $ | (0.00) | $ | (0.00) | $ | 0.01 | $ | 0.00 | |||||||||\n| Income (Loss) per Share – Diluted | $ | (0.00) | $ | (0.00) | $ | 0.01 | $ | 0.00 | |||||||||\n| EBITDA | 63,051 | 158,596 | 651,570 | 374,900 | |||||||||||||\n| EBITDA Margin % | 3.82% | 8.90% | 29.07% | 19.30% | |||||||||||||\n| Normalized EBITDA * | 220,909 | 264,251 | 540,504 | 466,458 | |||||||||||||\n| Normalized EBITDA Margin % * | 13.38% | 14.83% | 24.11% | 24.01% |\n| Q2 2024 | Q1 2024 | Q4 2023 | Q3 2023 | ||||||||||||||\n| Cash | 86,118 | $ | 207,998 | $ | 150,928 | $ | 254,720 | ||||||||||\n| Working Capital (Deficiency) | (1,932,157) | (1,810,041) | (1,758,949) | (115,884) | |||||||||||||\n| Liquidity | 378,358 | 521,092 | 623,506 | 975,794 | |||||||||||||\n| Revenue | 1,949,689 | 1,922,631 | 2,128,768 | 1,708,931 | |||||||||||||\n| Operating Expenses | 1,838,985 | 1,905,260 | 2,172,342 | 1,708,684 | |||||||||||||\n| Other Expenses (Income) | 118,863 | (144) | 3,756,134 | 20,217 | |||||||||||||\n| Income Tax Expense (Recovery) | 120,872 | 1,950 | (134) | (11,907) | |||||||||||||\n| After-Tax Income (Loss) for the Period | (129,031) | 15,565 | (3,799,574) | (8,063) | |||||||||||||\n| Income (Loss) per Share – Basic | $ | (0.00) | $ | 0.00 | ($0.06) | ($0.00) | |||||||||||\n| Income (Loss) per Share – Diluted | $ | (0.00) | $ | 0.00 | ($0.06) | ($0.00) | |||||||||||\n| EBITDA | 307,730 | 356,704 | (3,407,954) | 322,585 | |||||||||||||\n| EBITDA Margin % | 15.78% | 18.55% | (160%) | 18.88% | |||||||||||||\n| Normalized EBITDA* | 337,818 | 237,581 | 211,061 | 266,269 | |||||||||||||\n| Normalized EBITDA Margin % * | 17.33% | 12.36% | 9.91% | 15.58% | |||||||||||||\n| * A non-IFRS measure. See \"Non-IFRS financial measures\" for definitions and reconciliation of non-IFRS measures to the relevant IFRS measures. |\nDuring the quarter, the Company reached a settlement agreement of $60,000 with one of the defendant shareholders in connection with the ongoing legal proceedings related to the 2021 acquisition of Digital Media Services Inc. (\"DMS\").\nSubsequent to the quarter, the Company also reached a second settlement agreement for $150,000 with the accounting firm named in the same lawsuit.\nShares for Services\nPursuant to the previously disclosed shares for services arrangement (the \"Shares for Services Arrangement\") entered into between the Company and Grant Schuetrumpf, the Company will issue a total of 81,123 common shares of the Company (the \"Shares\") for the months of May through July 2025, as follows:\n31,520 Shares at a price of $0.07 per Share for the month of June;\n49,603 Shares at a price of $0.09 per Share for the months of May and July, collectively.\nUpon the issuance of the Shares, the Company will have issued a cumulative total of 281,473 Shares for the months of January through July 2025 under the Shares for Services Arrangement.\nAs Mr. Schuetrumpf is an officer and director of the Company, the issuance of the Shares under the Shares for Services Arrangement is considered a \"related party transaction\" under Multilateral Instrument 61-101 – Protection of Minority Security Holders In Special Transactions (\"MI 61-101\") and the TSXV. The Company is relying on the exemptions from the formal valuation and the minority shareholder approval requirements of MI-61-101 contained in section 5.5 (a) and Section 5.7 (1)(a) as the fair market value of the common shares being issued to insiders in connection with the Shares for Services Arrangement does not exceed 25% of the market capitalization of the Company, as determined in accordance with MI 61-101.\nAbout YANGAROO\nYangaroo is a technology provider in the media and entertainment industry, offering a cloud-based software platform for the management and distribution of digital media content. Yangaroo's Digital Media Distribution System (\"DMDS\") platform is a patented cloud-based platform that provides customers with a centralized and fully integrated workflow directly connecting radio and television broadcasters, digital display networks, and video publishers for centralized digital asset management, delivery, and promotion. DMDS is used across the advertising, music, and entertainment awards show markets.\nThe address of the Company's corporate office and principal place of business is 360 Dufferin Street, Suite 203, Toronto, Ontario, M6K 1Z8.\n# # #\nFor YANGAROO Investor Inquiries:\nGrant Schuetrumpf\nPh: (416) 534 0607\ninvestors@yangaroo.com\nNeither the TSX Venture Exchange nor Its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the accuracy of this release.\nUse of Non-IFRS Financial Measures\nThe following non-IFRS definitions are used in the press release because management believes that they provide useful information regarding the Company's ongoing operations. Readers are cautioned that the definitions are not recognized measures under IFRS, do not have standardized meanings prescribed by IFRS, and should not be construed to be alternatives to revenues and net earnings determined in accordance with IFRS or as an indicator of performance, liquidity, or cash flows. The Company's method of calculating these measures may differ from the methods used by other entities and accordingly, these measures may not be comparable to similarly titled measures used by other entities or in other jurisdictions.\nEBITDA as defined by the Company means Earnings Before Interest and financing costs (net of interest income), Income Taxes, Depreciation, and Amortization. EBITDA is derived from the statements of comprehensive income (loss) and can be computed as revenues less salaries and consulting expenses, technology and production expenses, marketing and promotion expenses, general and administrative expenses, any gain (loss) on the remeasurement of fair value and contingent consideration, foreign exchange (gain) loss, and any non-recurring items such as restructuring expenses, government subsidies, and goodwill impairment.\nNormalized EBITDA, as defined by the Company, means EBITDA adjusted for one-time non-recurring or non-cash items such as share-based compensation expenses, acquisition fees, restructuring fees, foreign-exchange expenses, revaluation of embedded derivative liability, revaluation on contingent consideration, and goodwill impairment.\nEBITDA Margin and Normalized EBITDA Margin as defined by the Company means EBITDA and Normalized EBITDA, respectively, as a percentage of revenue.\nWorking capital as defined by the Company means current assets less current liabilities.\nLiquidity as defined by the Company means cash plus the available capacity in the Company's revolving credit facility.\nThe Company believes EBITDA, EBITDA margin, liquidity, and working capital, are useful measures because they provide information to both management and investors with respect to the operating and financial performance of the Company.\nCautionary Note Regarding Forward-looking Statements\nThis news release contains certain forward-looking statements and forward-looking information (collectively referred to herein as \"forward-looking statements\") within the meaning of applicable Canadian securities laws. All statements other than statements of present or historical fact are forward-looking statements. Forward-looking statements are often, but not always, identified by the use of words such as \"anticipate\", \"achieve\", \"could\", \"believe\", \"plan\", \"intend\", \"objective\", \"continuous\", \"ongoing\", \"estimate\", \"outlook\", \"expect\", \"may\", \"will\", \"project\", \"should\" or similar words, including negatives thereof, suggesting future outcomes.\nForward looking statements are subject to both known and unknown risks, uncertainties and other factors, many of which are beyond the control of YANGAROO, that may cause the actual results, level of activity, performance or achievements of YANGAROO to be materially different from those expressed or implied by such forward looking statements. Although YANGAROO has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements, there may be other factors that cause results not to be as anticipated, estimated or intended. The Company is making forward-looking statements with respect to the issuance of the Shares pursuant to the Shares for Services Arrangement, including the number of Shares to be issued.\nForward-looking statements are not a guarantee of future performance and involve a number of risks and uncertainties, some of which are described herein. Such forward-looking statements necessarily involve known and unknown risks and uncertainties, which may cause YANGAROO's actual performance and results to differ materially from any projections of future performance or results expressed or implied by such forward-looking statements. Any forward-looking statements are made as of the date hereof and, except as required by law, YANGAROO assumes no obligation to publicly update or revise such statements to reflect new information, subsequent or otherwise.\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/263292"
    }
  ],
  "argos_summary": "Yangaroo Inc. reported its second‑quarter 2025 results, showing a 15% revenue decline to $1.65 million largely due to a drop in advertising revenue amid geopolitical tensions and U.S. tariffs. The company posted an operating loss of $18.8 k but maintained a positive Normalized EBITDA of $220.9 k, marking its twelfth consecutive quarter of positive EBITDA. Cost‑control measures, including headcount and marketing cuts, helped mitigate the impact of lower sales. The quarter also included settlements of $60 k and $150 k related to a 2021 acquisition lawsuit, and the company issued shares to CEO Grant Schuetrumpf under a related‑party shares‑for‑services arrangement.",
  "argos_id": "JVMUYRII6"
}