{
  "url": "https://finance.yahoo.com/news/choice-hotels-international-survey-reveals-140400461.html",
  "authorsByline": "PR Newswire",
  "articleId": "c8422089e9ef4c6e916d68a38dd94309",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/prnewswire.com/95ebbf058b910ce79d1a3a96f003389b",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T14:04:00+00:00",
  "addDate": "2025-08-21T14:16:04.559309+00:00",
  "refreshDate": "2025-08-21T14:16:04.559311+00:00",
  "score": 1.0,
  "title": "Choice Hotels International Survey Reveals Waffles Are the Heart of Vacations and the Nation's Biggest Breakfast Debate",
  "description": "In celebration of National Waffle Day, Choice Hotels International (NYSE: CHH), one of the world's largest and most successful lodging franchisors, and its flagship hotel brand, Comfort Hotels, is spotlighting America's love for waffles and the breakfast moments that make vacations unforgettable. A new nationwide survey commissioned by Choice Hotels* reveals that waffles are far more than a morning meal – they're a cherished symbol of travel, connection, joy and the Comfort brand.",
  "content": "From childhood road trips to cozy hotel mornings, Comfort Hotels finds waffles aren't just breakfast – they're pure travel nostalgia. But when it comes to the perfect waffle, vacationers are charmingly divided.\n\nNORTH BETHESDA, Md., Aug. 21, 2025 /PRNewswire/ -- In celebration of National Waffle Day, Choice Hotels International (NYSE: CHH), one of the world's largest and most successful lodging franchisors, and its flagship hotel brand, Comfort Hotels, is spotlighting America's love for waffles and the breakfast moments that make vacations unforgettable. A new nationwide survey commissioned by Choice Hotels* reveals that waffles are far more than a morning meal – they're a cherished symbol of travel, connection, joy and the Comfort brand.\n\nWaffles as the Heart of the Vacation Morning\n\nNearly three in four travelers in the U.S. (74%) say a relaxing breakfast is essential to a great vacation, and 66% rank breakfast among their favorite family travel memories. While only 18% typically sit down for breakfast on a weekday, that number soars to 63% when on vacation – proof that waffles aren't just food, they're a vacation breakfast staple.\n\nBut this affection runs deeper than just enjoyment. More than three in four respondents (78%) say sharing food is their favorite way to connect with others and 57% associate waffles with cozy, relaxing mornings.\n\nFor decades, Comfort Hotels has been part of these moments with more than 30 million waffles made at its properties annually, each one contributing to a guest's cherished vacation memory. Travelers of all generations know and love the free, hot breakfast, inclusive of waffles and more, they receive while staying at Comfort properties.\n\nThe Great Waffle Debate: Crispy vs. Fluffy and Full-Size vs. Mini\n\nAmerica's love for waffles is undeniable but when it comes to the perfect bite, the nation is split. 41% percent of respondents say crispiness is a make-or-break factor when it comes to the perfect waffle, while the rest prefer a softer, fluffier bite.\n\nFor toppings, tradition reigns supreme with 74% remaining loyal to the classic pairing of butter and syrup.\n\nMini-sized products are trending across brands and industries, but waffles represent one area where Americans aren't willing to compromise contentment for cuteness as 67% prefer full-size waffles.\n\n\"Waffles aren't just something we serve, they're a symbol of Comfort, connection and the joy of travel,\" said Noha Abdalla, Chief Marketing Officer, Choice Hotels International. \"We know breakfast, especially waffles, is part of the emotional foundation of a hotel stay. Whether you're Team Crispy or Team Fluffy, we're proud to deliver the perfect start to the day for all our guests – one waffle at a time.\"",
  "medium": "Article",
  "links": [
    "https://mma.prnewswire.com/media/2754774/Choice_Hotels_International___waffle_survey.html"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Waffles",
      "weight": 0.10977989
    },
    {
      "name": "waffles",
      "weight": 0.10977989
    },
    {
      "name": "Comfort Hotels",
      "weight": 0.09290858
    },
    {
      "name": "Choice Hotels International",
      "weight": 0.09280372
    },
    {
      "name": "Choice Hotels International Survey",
      "weight": 0.091836214
    },
    {
      "name": "Choice Hotels",
      "weight": 0.089715146
    },
    {
      "name": "breakfast",
      "weight": 0.0812599
    },
    {
      "name": "cozy hotel mornings",
      "weight": 0.078521855
    },
    {
      "name": "Comfort properties",
      "weight": 0.07024226
    },
    {
      "name": "Vacations",
      "weight": 0.0661105
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/Travel & Transportation/Hotels & Accommodations/Other",
      "score": 0.60107421875
    },
    {
      "name": "/Food & Drink/Restaurants/Other",
      "score": 0.5625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.52490234375
    },
    {
      "name": "/Food & Drink/Restaurants/Restaurant Reviews & Reservations",
      "score": 0.37646484375
    }
  ],
  "sentiment": {
    "positive": 0.340082,
    "negative": 0.18469633,
    "neutral": 0.47522172
  },
  "summary": "A survey commissioned by Choice Hotels International has revealed that waffles are the heart of vacations and are a symbol of travel, connection, joy and the Comfort brand. The survey also revealed that nearly three in four travelers in the U.S. (74%) say a relaxing breakfast is essential to a great vacation, and 66% associate breakfast with their favorite family travel memories. While only 18% of respondents typically sit down for breakfast on a weekday, this figure increases to 63% when on vacation. The study also revealed a significant difference in the national preference for the perfect bite, with 41% identifying crispiness as a make-or-break factor, while 74% remaining loyal to the classic butter and syrup.",
  "shortSummary": "A Choice Hotels International survey reveals waffles are integral to American vacationing, and their enduring love for waffles and their importance as a symbol of travel and hospitality.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "af27b99419434bcd8a9a7a07510f5808",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Choice Hotels International and Comfort Hotels celebrate National Waffle Day by highlighting a new survey that shows waffles are a key part of vacation memories, with 74% of U.S. travelers saying breakfast is essential and 63% eating breakfast on vacation. The survey also reveals that 78% enjoy sharing food to connect, 57% link waffles to cozy mornings, and Comfort Hotels produces over 30 million waffles each year. Preferences split between crispy (41%) and fluffy waffles, while 74% stick to butter and syrup and 67% prefer full‑size waffles. The company’s CMO emphasizes that waffles symbolize comfort, connection, and the joy of travel for guests.",
  "argos_id": "M0Q06ZHFX"
}