{
  "url": "https://finance.yahoo.com/video/why-investors-buy-amphenol-avoid-110017068.html",
  "authorsByline": "Yahoo Finance Video",
  "articleId": "3fdd1f23c27646fca16639bfe0085763",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/6FUO6WCyWIBJK1Pail07gQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-08/c9bca760-7dfc-11f0-bfce-7c17df1600f2",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T11:00:17+00:00",
  "addDate": "2025-08-21T11:12:23.353790+00:00",
  "refreshDate": "2025-08-21T11:12:23.353791+00:00",
  "score": 1.0,
  "title": "Why investors should buy Amphenol & avoid Vertex Pharmaceuticals",
  "description": "Zacks Investment Management senior client portfolio manager Brian Mulberry joins Market Domination with Josh Lipton to discuss why he recommends buying Amphenol (APH) and why he says investors should stay away from Vertex Pharmaceuticals (VRTX). To watch more expert insights and analysis on the latest market action, check out more Market Domination.",
  "content": "Welcome to goodbye, or goodbye. Our goal here is to help cut through that noise, to navigate the best moves for your portfolio. I'm here now with Zach's investment management senior client portfolio manager, that would be Brian Mowberry. Brian, it's great to see you, as always. So we'll start here with one name you like, uh Brian, and that would be Amfenol. Now, this stock, it's a nice move already, Brian. It's up about 55% this year. Most on the street like it, you like it too. Let's go through the reasons why. The first reason, you say global leader in its industry. Let's take a beat right there, Brian. For the the uninitiated, walk us through what exactly this company does.\n\nAbsolutely. This is one of the most important names you may have never heard of. Amphenol is a global leader in the design and manufacture of electrical connections. And so what they've done over the last 10 years is really helped build out the 5G network and fiber optic connections in most of Europe, and also other parts of the world as well. So they're very, very good at creating and manufacturing and designing these electrical connections. They've recently just got a deal with Nvidia to help build data centers here in the United States.\n\nAll right, bullet point number two, why you say this one's a buy. Benefiting from demand in 5G expansion, walk us through it.\n\nRight, so obviously demand for 5G as a service has been growing for the last 10 years. That's a big part of their market. But now the segment of growth is increasing into data center build outs as well. So their their techniques and their expertise in this area, specifically, leads to a lot of growth. Their last earnings surprise was up 22%, just in the last quarter, and that leads to better gross margins as well.\n\nUh let's go to the third reason you say this one's a smart one to commit capital to. Support for future growth.\n\nStrong balance sheet here. They've been a really good steward of all of the revenue that they've been generating recently. They've got a strong dividend and all of this growth could lead to better treatment for shareholders, meaning increased dividends, and support for growth. If they need to acquire companies to expand rapidly, they have the cash on hand to do exactly that.\n\nAll right, so you made your case convincingly as always, Brian. Before everybody jumps in though, walk the viewers through what are some risks you got to think about?\n\nBecause the majority of their revenue has come from overseas, the biggest risk for them is the currency rate exchange. The soft dollar recently has helped some of this growth rate go in a positive direction, but if we see a reversal and the dollar gets stronger, that could be a headwind for growth on in the future.\n\nAll right, so that's what you like. Let's turn to one you don't like. You would avoid Vertex. Now, this stock is basically flat year to date. Let's walk through the reasons why you don't see too many catalysts ahead. One reason you would avoid it, overly dependent on one market.\n\nVertex is a leader in cystic fibrosis treatments, there's no question about that. They have five different products that treat that one area, but that's really the core of their business. They've tried recently to branch out into some other areas like pain management and things of that nature, it just hasn't gone well. So being concentrated with one real consumer of their product, and that spending is going down, makes us a little bit negative on the name.\n\nSecond reason you're negative, some products developing slower than expected.\n\nYeah, as I said that pain management program that they were working on, the trials were so poor, the efficacy was so bad they actually had to pull it. So they didn't even get to a point where they were trying to seek approval, and there's obviously a lot of cost in developing these types of drugs, it just didn't go anywhere. So again, a net negative on profitability.\n\nAll right, third reason you want to avoid having this one in your portfolio, competition increasing.\n\nSo not only are we seeing fewer dollars spent on cystic fibrosis treatment, we're starting to see other carriers come into the space with newer products, newer delivery systems. So competition is increasing on a declining pool of dollars out there. So it just makes growth a lot more difficult to achieve for a name like Vertex.\n\nFinally though, on Vertex, what's the what's the upside risk, Brian? How could you be wrong on this?\n\nWell, they are really good at what they do. As I said, their core competency is in cystic fibrosis. They have a new treatment that's recently been approved that could become the new standard of care, meaning it could treat 90% of patients six years and over. That could actually be the one component that adds growth back into it, but for us all of the other headwinds just line up to be too much to overcome.\n\nAll right, bottom line. Buy Amfenol, avoid Vertex, Brian says. Thank you, Brian, for your time. Thank you all for watching goodbye, or goodbye. More market domination coming right up on the other side.",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "newer products",
      "weight": 0.06746647
    },
    {
      "name": "cystic fibrosis treatment",
      "weight": 0.067060076
    },
    {
      "name": "cystic fibrosis treatments",
      "weight": 0.067060076
    },
    {
      "name": "growth",
      "weight": 0.06600514
    },
    {
      "name": "future growth",
      "weight": 0.06506948
    },
    {
      "name": "Brian Mowberry",
      "weight": 0.06236773
    },
    {
      "name": "other carriers",
      "weight": 0.06196162
    },
    {
      "name": "Brian",
      "weight": 0.061797753
    },
    {
      "name": "better treatment",
      "weight": 0.060754523
    },
    {
      "name": "Second reason",
      "weight": 0.060485926
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.984375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.97509765625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.96044921875
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.90478515625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.576171875
    }
  ],
  "sentiment": {
    "positive": 0.79616666,
    "negative": 0.05276992,
    "neutral": 0.15106334
  },
  "summary": "Investor Zach Zach's investment management senior client portfolio manager, Brian Mowberry, has highlighted why investors should buy Amphenol and avoid Vertex Pharmaceuticals. Amfenol, a global leader in the design and manufacture of electrical connections, is up 55% this year and has helped build out the 5G network and fiber optic connections in Europe and other parts of the world. The company recently announced a deal with Nvidia to help build data centers in the United States. However, Vertex's focus on cystic fibrosis treatments has not been well received, making it more difficult to achieve in other areas. There are also risks for Vertex, including the currency rate exchange, which could potentially hinder growth.",
  "shortSummary": "Amphenol shares rose over 55% amid strong investor support, but risks remain; limited growth and competition.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "12b4599a5af44e79ad94fe76deaef3ca",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Brian Mowberry recommends buying Amphenol, citing its leadership in electrical connections for 5G and data‑center infrastructure, strong earnings growth, solid balance sheet, and dividend potential, while noting currency‑exchange risk as a downside. He advises avoiding Vertex, pointing to its heavy reliance on cystic‑fibrosis treatments, stalled pain‑management trials, and rising competition in a shrinking market. Vertex’s only upside is a recently approved therapy that could become a new standard of care, but the overall headwinds remain significant. The overall takeaway is to add Amphenol to a portfolio and steer clear of Vertex.",
  "argos_id": "M5BVJCHBY"
}