{
  "url": "https://www.express.co.uk/news/politics/2098598/Graham-Stringer-ECHR-Migrant-crisis",
  "authorsByline": "Christian Calgie",
  "articleId": "2923b185821d43f1ab8d5e487f520e8d",
  "source": {
    "domain": "express.co.uk",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Stark County",
      "city": "Hartville",
      "coordinates": {
        "lat": 40.9636685,
        "lon": -81.3312195
      }
    }
  },
  "imageUrl": "https://cdn.images.express.co.uk/img/dynamic/139/1200x630/6376930.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-21T19:53:00+01:00",
  "addDate": "2025-08-21T19:22:06.568701+00:00",
  "refreshDate": "2025-08-21T19:22:06.568702+00:00",
  "score": 1.0,
  "title": "Labour MP becomes first to back leaving ECHR to stop small boats",
  "description": "Veteran MP breaks ranks and sides with Nigel Farage and Robert Jenrick on crucial issue",
  "content": "Labour veteran Graham Stringer has become the first MP on his side of the Commons to say Britain should quit the European Convention on Human Rights. His comments come amid yet another crisis for the Government as it panics following this week’s bombshell Epping Forest migrant hotel court ruling. After a record-breaking year for Channel crossings, Mr Stringer said on Thursday that Sir Keir Starmer must remove any legal impediment stopping the UK from ending the crisis, including leaving the ECHR. He told the BBC’s World at One programme: “What you’ve got to remember is most of the people crossing the Channel are young men, they have destroyed their papers before they get here, they’re coming from a completely civilised country in France. They’re paying international criminals to get here and the courts are saying they have a right to stay under the refugee convention, I assume, and possibly other conventions. That doesn’t seem reasonable to me.”\n\nAsked whether that included withdrawal from the Human Rights treaty, he simply said: “Yes.” “Clem Attlee, who was prime minister when the Convention on Human Rights was signed, agreed to it on the basis that it didn’t apply to the UK and the same with the Refugee Convention. Europe was in a mess. It applied only to Europe at the time.” He said the convention's rules on asylum were “very good” when they were introduced, but that the court has since “extended their remit, and we need laws that apply to the current situation”. On the migrant crisis itself, the Blackley and Middleton South MP fumed: “I think people who come here illegally, and they are funding international criminals, should not be allowed to stay. “What happens when they’re allowed to stay? They’re getting priority beyond my constituents who need to be housed, who need access to the health service and need access to dental services.”\n\nHe joins Lord Glasman as the only two Labour parliamentarians to back quitting the ECHR, aligning themselves with Nigel Farage and Robert Jenrick on the key issue. Kemi Badenoch is yet to confirm whether leaving the ECHR is official Tory policy, and has set up a commission to answer the question. It’s expected she will confirm that she would leave the ECHR if she becomes Prime Minister at the Tories’ October party conference. Another Labour MP, Jonathan Hinder, said in April that it’s “quite clear” that the convention “isn’t working”, taking aim at the judges’ “crazy judgements” and “huge judicial over-reach”. Mr Hinder said that while he would prefer to prioritise seeking reforms of the treaty, nothing should be “off the table” if those attempts at reform fail. Former Home Secretary Jack Straw has also said Britain should question its membership of the ECHR, writing in March that there is little reason to remain. Mr Straw argued: “It is the success of the HRA that provides the Prime Minister with a way through the dilemma … about the difficulties to effective immigration control that the ECHR presents. These have been thrown up not by the convention itself but by expansive, and sometimes inconsistent or incoherent, interpretations of its articles by the European Court of Human Rights in Strasbourg.”",
  "medium": "Article",
  "links": [
    "https://www.express.co.uk/latest/keir-starmer",
    "https://www.express.co.uk/",
    "https://www.express.co.uk/news/politics/2098241/asylum-seeker-numbers-uk-labour",
    "https://www.express.co.uk/news/politics/2070547/Human-rights-ECHR-crime-foreign-offenders-deportation",
    "https://www.express.co.uk/news/politics/2077581/keir-starmer-grooming-gangs-echr",
    "https://www.express.co.uk/news/uk/2081364/palestine-echr-medical-treatment-home-office",
    "https://www.express.co.uk/latest/bbc",
    "https://www.express.co.uk/privacy-notice",
    "https://www.express.co.uk/latest/conservative-party",
    "https://www.express.co.uk/latest/nigel-farage",
    "https://www.express.co.uk/latest/european-court-of-human-rights",
    "https://www.express.co.uk/news/politics/2097398/Epping-migrants-asylum-hotels",
    "https://www.express.co.uk/news/politics/2027975/Jack-Straw-ECHR-migration-Labour"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "ECHR",
      "weight": 0.07479206
    },
    {
      "name": "Human Rights",
      "weight": 0.07155335
    },
    {
      "name": "Labour veteran Graham Stringer",
      "weight": 0.060178068
    },
    {
      "name": "Prime Minister",
      "weight": 0.05886936
    },
    {
      "name": "Mr Stringer",
      "weight": 0.057291962
    },
    {
      "name": "Mr Straw",
      "weight": 0.056048095
    },
    {
      "name": "Labour MP",
      "weight": 0.05577196
    },
    {
      "name": "Mr Hinder",
      "weight": 0.0551822
    },
    {
      "name": "Former Home Secretary Jack Straw",
      "weight": 0.054095946
    },
    {
      "name": "international criminals",
      "weight": 0.053525943
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9873046875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9716796875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.81591796875
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.55712890625
    }
  ],
  "sentiment": {
    "positive": 0.043668777,
    "negative": 0.73249584,
    "neutral": 0.22383536
  },
  "summary": "Labour MP Graham Stringer has become the first MP to suggest that Britain should abandon the European Convention on Human Rights (ECM) to prevent small boats from crossing the Channel. His comments come amid another crisis for the government, following a recent Epping Forest migrant hotel court ruling. Stringer argues that the ECHR's rules on asylum were good when they were introduced but have since extended their reach and need laws to apply to the current situation. He joins Lord Glasman and Kemi Badenoch as the only two Labour parliamentarians to support quitting the ECM, aligning themselves with Nigel Farage and Robert Jenrick on this issue.",
  "shortSummary": "Labour MP Graham Stringer supports quitting the ECHR to prevent migrants from crossing the Channel illegally, while others argue for such a stance.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "94e40e932fe643619334082c7a036962",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.express.co.uk/",
      "text": "Public warned again that Chancellor will be hiking taxes by up to £27bn this autumn\nBy lunchtime today Sir Keir Starmer and his Cabinet were fire-fighting FOUR new crises...\nThe department has awarded several contracts in recent days relating to 'major...\nAn Emmerdale legend has been announced in the Strictly Come Dancing line up following...\nIn a world of reality TV and competitive cooking, Jasper Carrott's timeless humor...\nIn England and Wales, areas to the north and along the west coast are expected to be...\nThe child was at a shopping centre with his mother, who \"briefly lost sight of him\".\nEXCLUSIVE: Kemi Badenoch tells Daily Express that Sir Keir Starmer's 'shameful record...\nNew polling shows which party Brits think is to blame for the migrant hotel crisis.\nJust days after two GB News stars announced their departure, a third has anncounced...\nThis beautiful city is just a short drive from other major tourist destinations in the UK.\nHUR described the patrol boat as belonging to the \"Russian occupiers\" and said its...\nDaily Express\nThe Duke of Sussex's latest move on VJ Day has caused \"unease\" at the palace, claims...\nShoppers have described the cardigan as \"gorgeous\" and say it's a versatile wadrobe item.\nPM previously suggested people who delete offensive social media posts should not face...\nEXCLUSIVE: Helen Mirren has opened up about working on the Thursday Murder Club\nEmmerdale viewers were devastated as they watched as Mackenzie Boyd meet his demise at the hands of John Sugden\nArgos has launched a major Big Red sale event with Samsung TVs cut to their 'lowest...\nThe Chancellor is set to be eyeing up reforms to the way property is taxed in the UK.\nOur ruling elite have patronised ordinary Britons for decades... leaving decent,...\nThe government is encouraging people to fly flags of the nations of the UK - but some...\nStranger Things Star Millie Bobby Brown has announced that she has become a mum for...\nA bizarre 'mud spillage' incident has halted traffic on the M6\nAugust 2025 has been an abundant month for breathtaking astronomical events and, this...\nTrading profits for North America are now expected to come in at around £25 million for the year leading up to August - a drop from the initial £55 million.\nThe BBC has issued a statement about the future of Doctor Who following the recent...\nSir Brian May is set to launch a new single with The Struts following an...\nFollow our live blog for the latest updates as the Government releases new figures on...\nA royal expert issues a dire warning to the Royal Family after Prince William's...\nMastodon's former lead guitarist William Brent Hinds has reportedly died following a...\nFormer Atomic Kitten star Kerry Katona has had her say after Eamonn Holmes made a...\nFootage shows shoes and phones being used as weapons as chaos unravels on the ship.\nThe IDF is believed to be preparing for a ground offensive in Gaza City as Israel's PM aims to take over the Strip.\nTensions between Moscow and NATO were at a boiling point after a Russian drone...\nThe victim, aged in his 40s, is understood to be an English tourist, was taken to...\nAn expert warns the Chancellor may need to adjust the age limit at which Brits receive...\nEXCLUSIVE: The head of DOGE for Reform UK insists that \"Britain is full\" as he warns...\nNetflix fans were left frantically looking up a brand new show\nA new study has revealed Covid can prematurely age blood vessels.\nExperts said the fall was only possible because net migration hit such staggering levels\nBrits should leave lavender by their windows on Monday as the UK is set to become hot again, and flies are expected to run rampant in homes.\nThe building society is expanding some of its other services.\nEXCLUSIVE: The prediction comes as areas of the UK braved four heatwaves so far this...\nIf your internet connection feels sluggish or if your computer keeps disconnecting...\nA man has shared the lesson he learnt after finally opening a bottle of Jonnie Walker...\nA tourist from Central Asia shared their thoughts on the UK after visiting England,...\nLocal officials acknowledged that the measures were 'causing confusion' for...\nIf you've ever wondered what your pet thinks about you, a behaviourist has named the...\nThe woman allegedly began intimately touching the child after attempting to strike up a conversation with her.\nNorth Korea has boosted its nuclear weapons programme over the last five years, with...\nSherlock creator Steven Moffat has teased a new British drama which is set to air on...\nEberechi Eze is expected to complete his move to Arsenal later this week.\nNeighbours in the London borough of Tower Hamlets have woken up to the return of St...\nTravellers can experience true winter conditions comparable to those in the Alps and...\nRoses often look droopy at the end of summer, but it turns out there is a simple way...\nLawyers accused the airlines of acting 'deceptively and unlawfully' by advertising...\nDaily Express uses notifications to keep you updated"
    }
  ],
  "argos_summary": "Labour MP Graham Stringer has become the first on his side of the Commons to call for Britain to leave the European Convention on Human Rights, arguing that the treaty hampers effective immigration control amid a surge of Channel crossings. He cites the Epping Forest migrant hotel court ruling and claims that many crossers are young men who have destroyed documents and paid smugglers, and that the courts are granting them rights under the refugee convention. Stringer joins Labour colleagues Lord Glasman and Jonathan Hinder in supporting exit from the ECHR, aligning with figures like Nigel Farage and former Home Secretary Jack Straw who also question the treaty’s relevance. The move comes as the government faces multiple crises, including a looming tax hike and a migrant hotel crisis, while Tory figures such as Kemi Badenoch consider leaving the treaty if elected prime minister.",
  "argos_id": "N800140LG"
}