{
  "url": "https://www.express.co.uk/news/uk/2098372/reforms-zia-yusuf-slams-soft",
  "authorsByline": "Lotti OBrien",
  "articleId": "7127d45ed58e4dccb3a1f047fc26fde7",
  "source": {
    "domain": "express.co.uk",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Stark County",
      "city": "Hartville",
      "coordinates": {
        "lat": 40.9636685,
        "lon": -81.3312195
      }
    }
  },
  "imageUrl": "https://cdn.images.express.co.uk/img/dynamic/1/590x/2098372_1.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-21T13:02:00+01:00",
  "addDate": "2025-08-21T12:16:07.578546+00:00",
  "refreshDate": "2025-08-21T12:16:07.578547+00:00",
  "score": 1.0,
  "title": "Reform’s Zia Yusuf slams ‘soft touch Britain’ as migrant crisis 'gets worse'",
  "description": "The head of DOGE for Reform UK insists that \"Britain is full\" as he warns the situation will not change under Labour.",
  "content": "Reform’s Zia Yusuf has issued a stark warning to Brits in light of the Home Office’s new figures on migration. The data released on Thursday shows that the number of asylum seekers staying in hotels rose by 8% to 32,059 during Sir Keir Starmer's first year in power following a surge in Channel crossings. However, Mr Yusuf has condemned “soft touch Britain”, warning that the crisis will not improve under a Labour government. “The situation is dire and not only is it not improving, it is getting worse,” he told the Express. “Ultimately, British people, they are generous, they are warmhearted, they're welcoming but they've had enough now. Britain is full. We have no infrastructure to cope. People are being soaked in taxes to pay for all of these people to basically live a life of leisure at taxpayer expense.”\n\nThe number of people claiming asylum in the UK reached a record 111,084 in the year to June 2025. And small boat deportations are down by 7% to 2,330 in the 12-month period. The number is up 14% from 97,107 in the year to June 2024, according to data published by the Home Office. The previous record for a 12-month period was 109,343 in the year to March 2025. Nigel Farage’s head of DOGE UK continued: “Britain's a soft touch! Why are so many people coming from France? In some cases of risking their lives to come from France which is a safe country, a country to which millions of British people go on holiday? “As soon as they get to come here they get a complementary ferry service from the British border force, they get picked up, taken to a free hotel, free meals, free healthcare, free trips to the circus, free strips to the Safari Park. “Do a bit of work legally if you want to, but basically you get your entire life paid for you.” Mr Yusuf warns that the only way to reduce the soaring migration figures is by “taking away all of these incentives” and to “leave the ECHR” which he believes “will never happen under this government”.\n\nHome Secretary Yvette Cooper said: “We inherited a broken immigration and asylum system that the previous Government left in chaos. \"Since coming to office we have strengthened Britain’s visa and immigration controls, cut asylum costs and sharply increased enforcement and returns, as today’s figures show. “The action we have taken in the last 12 months - increasing returns of failed asylum seekers by over 30%, cutting asylum costs by 11%, reducing the backlog by 18% and our forthcoming plans to overhaul the failing asylum appeal system - are crucial steps to restoring order, and putting an end to the chaotic use of asylum hotels that we inherited from the previous government. “At the same time, we are bringing legal migration back under control, with a 48% reduction in work visas this year - and further stronger visa controls and higher skill requirements introduced through our White Paper expected to bring those overall numbers down further. “As we roll out further reforms, including the new pilot with France, new counter terror powers to strengthen border security, and new asylum reforms later this year (including reforms to speed up the persistent delays in the appeals system), we will continue to take the serious steps required to restore order, control and fairness to the system and to continue building the foundations of a new and stronger approach.”",
  "medium": "Article",
  "links": [
    "https://www.express.co.uk/news/uk/2098257/labours-day-shame-shocking-migrant",
    "https://www.express.co.uk/news/uk/2098008/migrant-guilty-sexually-assaulting-three",
    "https://www.express.co.uk/privacy-notice",
    "https://www.express.co.uk/news/politics/2097827/nigel-farages-lords-plea-starmer",
    "https://www.express.co.uk/latest/nigel-farage",
    "https://www.express.co.uk/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "new asylum reforms",
      "weight": 0.09110674
    },
    {
      "name": "asylum hotels",
      "weight": 0.08608498
    },
    {
      "name": "failed asylum seekers",
      "weight": 0.081971176
    },
    {
      "name": "asylum costs",
      "weight": 0.08123394
    },
    {
      "name": "asylum seekers",
      "weight": 0.08070965
    },
    {
      "name": "asylum",
      "weight": 0.076960176
    },
    {
      "name": "British people",
      "weight": 0.07346449
    },
    {
      "name": "new counter terror powers",
      "weight": 0.06772273
    },
    {
      "name": "first year",
      "weight": 0.06679058
    },
    {
      "name": "free strips",
      "weight": 0.06039016
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97900390625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.9375
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.87158203125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.83984375
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.57421875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.467041015625
    }
  ],
  "sentiment": {
    "positive": 0.046800565,
    "negative": 0.81669873,
    "neutral": 0.13650072
  },
  "summary": "Reform's Zia Yusuf has warned that the UK's immigration crisis is not improving and is likely to worsen under a Labour government. He criticised the Home Office for releasing new figures showing that asylum seekers staying in hotels rose by 8% to 32,059 during Sir Keir Starmer's first year in power. Yusuf also warned that Britain is already full and taxed heavily. The number of people claiming asylum in the UK reached a record 111,084 in the year to June 2025, and small boat deportations are down by 7% to 2,330 in the 12-month period. Home Secretary Yvette Cooper responded by saying she has taken steps to restore order, control and fairness to the system.",
  "shortSummary": "Reform's Zia Yusuf warns that the UK's migrant crisis is worsening, urging action from government reforms and enhanced security measures.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "22bcd8833ac24209895295db14150e29",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.express.co.uk/",
      "text": "By lunchtime today Sir Keir Starmer and his Cabinet were fire-fighting FOUR new crises threatening the future of Britain. How...\nIn a world of reality TV and competitive cooking, Jasper Carrott's timeless humor...\nIt is the highest number for any 12-month period since current records began in 2001.\nRachel Reeves is a luxury Britain cannot afford.\nMonty Python icon Eric Idle has a French hideaway to get away from fame back in the...\nJust days after two GB News stars announced their departure, a third has anncounced...\nThere are hundreds of items currently on sale, but I've scoured the Dunelm website to...\nThe government is encouraging people to fly flags of the nations of the UK - but some...\nEXCLUSIVE: The head of DOGE for Reform UK insists that \"Britain is full\" as he warns the situation will not change under Labour.\nThe Liverpool forward died in a car crash earlier this year.\nThe IDF is believed to be preparing for a ground offensive in Gaza City as Israel's PM...\nSamsung is handing out a free Samsung Galaxy Watch7 worth £239 through Currys-backed...\nDaily Express\nThe building society is expanding some of its other services.\nThe woman allegedly began intimately touching the child after attempting to strike up...\nNorth Korea has boosted its nuclear weapons programme over the last five years, with...\nSherlock creator Steven Moffat has teased a new British drama which is set to air on...\nEberechi Eze is expected to complete his move to Arsenal later this week.\nLawyers accused the airlines of acting 'deceptively and unlawfully' by advertising...\nThe unidentified object came down in a corn field near the village, creating a large...\nGreat British Bake Off judge Prue Leith shared her frustration with the \"lecturing\"...\nJade Damarell, 32, died after crashing onto a farm following a jump at Shotton...\nMillions take their driving test each year, but fewer than half are successful first...\nThe mum's genius method helps her get the most out of products - and some people can't...\nProper maintenance now can make all the difference in how well your lawn copes with...\nGood Morning Britain sparked fury amongst fans online minutes into the ITV show as they discussed the latest developments in the ongoing migrant crisis\nA leading car expert has revealed one shocking detail when getting behind the wheel of...\nRichard Osman's The Thursday Murder Club proved a literary sensation when it was...\nEurope is full of pretty towns and cities and there is one that is lesser-known but...\nLocals feel they 'have been left in the dark' over the huge 65ft sinkhole.\nEamonn Holmes spoke with Kerry Katona about her recent surgery on Thursday's GB News.\nFor a limited time only, Samsung is offering free laptops with some S25 Edge mobile...\nWorld Boxing have announced the new regulations.\nBetro was found guilty of conspiracy to murder, possessing a self-loading pistol and fraudulently evading the prohibition on importing ammunition\nArgos has launched a major Big Red sale event with Samsung TVs cut to their 'lowest...\nThe Chancellor is understood to be considering slashing the maximum people can take...\nThe UK has seen four heatwaves so far this summer, but with only two weeks of the...\nFor decades, German tourists have been one of the largest groups of foreign visitors...\nPrime minister Keir Starmer was easily skewered during an interview with Channel 4...\nThere is one big warning sign that your electrics could be putting you and your...\nChinese car manufacturer Xiaomi's latest YU7 could pass for one of the most iconic car...\nFlights are often a necessary part of any holiday, and losing your luggage can be incredibly frustrating. Here's what you need to know\nA warning has been issued to people buying these four food items at supermarkets like...\nTesco, Sainsbury's, Boots and John Lewis are among retailers who have written to the...\nThe Bank Holiday heat will be accompanied by dry conditions and sunny spells.\nOnly Connect host Victoria Coren-Mitchell married Peep Show star David Mitchell back...\nAfter victory in Epping, even Labour councils are said to be planning appeals against...\nThe new system is part of a multi-million plan to transform The National Lottery.\nBoden has released a host of new autumnal pieces, including polka dots and burgundy tones\nFirefighters worked through the night to tackle the huge blaze\nThis 10-second passport check could save your holiday and spare you last minute panic.\nThe series broke ground when it first hit our screens, as viewers were captivated by...\nThe GB News presenter issued a scathing rant over the government's 'incompetence'\nHMS Trent and a Wildcat helicopter shadowed Russian destroyer Vice Admiral Kulakov and...\nEggs are worth stocking up on to ensure you're never caught short when cooking at...\nLucy Connolly, 60, was jailed for 31 months for a tweet she posted on X following the...\nPeople are being urged consider these points before they put out there bins this weekend.\nDaily Express uses notifications to keep you updated"
    }
  ],
  "argos_summary": "Reform MP Zia Yusuf has warned that the surge in asylum seekers and hotel stays during Labour's first year will not ease, citing Home Office data showing 111,084 asylum claims and an 8% rise in hotel stays. He criticises the UK’s “soft touch” approach, calling for removal of incentives and even leaving the ECHR. Home Secretary Yvette Cooper counters that the new government has tightened controls, cut asylum costs, increased returns, and plans further reforms to restore order.",
  "argos_id": "PH08K3CFU"
}