{
  "url": "https://patch.com/connecticut/thehaddams-killingworth/new-italian-style-eatery-coming-higganum-owners-want-become",
  "authorsByline": "Michelle Tuccitto Sullo",
  "articleId": "75d98abc6e154117af888340fdeb4aa3",
  "source": {
    "domain": "patch.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://patch.com/img/cdn20/users/27034476/20250821/025240/styles/patch_image/public/chenzosmain___21144959229.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T18:52:42+00:00",
  "addDate": "2025-08-21T19:06:21.921536+00:00",
  "refreshDate": "2025-08-21T19:06:21.921538+00:00",
  "score": 1.0,
  "title": "New Italian-Style Eatery Coming To Higganum, Owners Want To ‘Become A Staple Here’",
  "description": "The owners hope to launch in September after renovating the restaurant space.",
  "content": "The eatery will be in the former home of Dino’s Pizza Restaurant, which closed in June after nearly three decades because its owners retired. Restaurateurs and partners Caleb Ellinas and Vincent Balisciano are currently renovating the 968 Killingworth Road space, with a goal of opening for customers in mid-to-late September.\n\nThe eatery’s name, “Chenzo’s,” comes from Balisciano’s nickname. “We want to become a staple here, where we welcome families, couples on date nights and people who want to come in for a glass of wine,” Balisciano said.\n\nEllinas and Balisciano have been working in the industry for about a decade, since their teens, and they both have restaurant management experience. They have been searching for a place to open their own venture for about two years. Ellinas’ brother has an existing martial arts studio in the same commercial plaza, so this location seemed like a perfect fit, according to the pair.\n\n“Once we saw the space, we really saw a future here,” Ellinas said. “People are really missing Dino’s, but the community has been very supportive. Everyone has been amazing during this whole process.” The space is being renovated, with new flooring, paint, bathrooms and a 12-seat, wood-top bar.\n\n“We are updating the space to have a modern, contemporary feel,” Ellinas said. The menu will feature offerings such as homemade meatballs and Italian nachos, lobster ravioli, penne in vodka sauce, and Tuscan butter shrimp. The restaurant’s primary focus will be on brick-oven pizza with both classic and unique combinations. One of the pizza selections will feature hazelnuts and local honey, for example. The focus will be on fresh and house-made ingredients, according to the pair. They plan to offer weekly happy hour specials and a half-off wine bottle night. “It will be contemporary modern Italian food,” Ellinas said. “We will change the menu as we see what the area wants.” The business is currently seeking applicants for a variety of positions, from bartenders to dishwashers to wait staff. Balisciano said he anticipates they will hire about eight workers.",
  "medium": "Article",
  "links": [
    "https://patch.com/connecticut/thehaddams-killingworth/restaurants-bars",
    "http://chenzospizza.com/",
    "https://patch.com/connecticut/thehaddams-killingworth/haddam-eatery-close-after-nearly-three-decades",
    "https://www.facebook.com/profile.php?id=61579332180698"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Caleb Ellinas",
      "weight": 0.07599416
    },
    {
      "name": "Vincent Balisciano",
      "weight": 0.07370632
    },
    {
      "name": "contemporary modern Italian food",
      "weight": 0.07350694
    },
    {
      "name": "Ellinas",
      "weight": 0.0718694
    },
    {
      "name": "Balisciano",
      "weight": 0.06788972
    },
    {
      "name": "Italian nachos",
      "weight": 0.06668004
    },
    {
      "name": "weekly happy hour specials",
      "weight": 0.066172495
    },
    {
      "name": "Italian",
      "weight": 0.058217525
    },
    {
      "name": "vodka sauce",
      "weight": 0.05693314
    },
    {
      "name": "date nights",
      "weight": 0.056455567
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Lifestyle"
    }
  ],
  "taxonomies": [
    {
      "name": "/Food & Drink/Restaurants/Other",
      "score": 0.939453125
    },
    {
      "name": "/News/Local News",
      "score": 0.89453125
    },
    {
      "name": "/Food & Drink/Restaurants/Restaurant Reviews & Reservations",
      "score": 0.7890625
    },
    {
      "name": "/Food & Drink/Cooking & Recipes/Cuisines",
      "score": 0.5087890625
    },
    {
      "name": "/Reference/Geographic Reference/Other",
      "score": 0.310791015625
    }
  ],
  "sentiment": {
    "positive": 0.48071277,
    "negative": 0.10539254,
    "neutral": 0.4138947
  },
  "summary": "Caleb Ellinas and Vincent Balisciano are planning to open a new Italian-style restaurant in Higganum, the former home of Dino's Pizza Restaurant. The restaurant, named \"Chenzo's,\" is set to open by mid-to-late September. The owners have been working in the industry for about a decade and have restaurant management experience. The space is being renovated with new flooring, paint, bathrooms, and a 12-seat wood-top bar. The menu will include dishes such as homemade meatballs and Italian nachos, lobster ravioli, penne in vodka sauce, and Tuscan butter shrimp. The business is seeking applicants for various positions.",
  "shortSummary": "Chenzo’s, a modern-style Italian-style restaurant based in Higganum, Ohio, is renovating and aiming to become a staple fixture of the area, with plans to open mid-September.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f52d7594be204252bafd214b8dbaf12b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://patch.com/connecticut/thehaddams-killingworth/haddam-eatery-close-after-nearly-three-decades",
      "text": "Restaurants & Bars\nPopular Haddam Pizzeria To Close After Nearly Three Decades\n\"This has been a very difficult and emotional decision and we are so sad to say goodbye,\" the owners said.\nHADDAM, CT — The owners of Dino’s Pizza Restaurant announced Thursday they plan to close after 29 years in business.\nThe last day is Sunday, June 29, owner and head chef Konstantinos Meleounis said, in a “You Live In Haddam If…” Facebook post. Meleounis said Thursday he plans to retire.\nThe restaurant, which is on Killingworth Road, is known for its pizza, grinders, Italian and Greek dishes, seafood and sandwiches.\nFind out what's happening in The Haddams-Killingworthfor free with the latest updates from Patch.\n“This has been a very difficult and emotional decision and we are so sad to say goodbye,” the Facebook post reads. “We have decided it’s time to move on to the next life adventure, whatever that might be.”\nThe post thanked the business’ past and present staff and all of its customers over the past three decades.\nFind out what's happening in The Haddams-Killingworthfor free with the latest updates from Patch.\n“We are grateful for your continued support and loyalty; you are the direct reason for our success as we are truly humbled and honored to have served you,” the post said.\nThe business has been the scene of many special events, from birthday parties, to first dates, to bridal and baby showers, the owners noted.\n“We will miss you all so very much,” they said.\nRead more:\n- Restaurant Owners Sue Landlord, Town Over Purchase\n- Longtime Sandwich Shop To Shutter, Owners Announce\n- Popular Eatery Making Big Change, Owners Announce\nWithin an hour, the announcement had garnered more than 100 comments from well-wishers, such as, “Thank you for serving us lunch and dinners for 29 years. Best wishes in your next adventure!”\nAnother commenter called it a “go to spot” close to home which will be dearly missed.\nMeleounis said he anticipates the spot will reopen as a restaurant with new owners following renovations.\nGet more local news delivered straight to your inbox. Sign up for free Patch newsletters and alerts."
    }
  ],
  "argos_summary": "Chenzo’s, a contemporary Italian restaurant named after co‑owner Vincent Balisciano’s nickname, is set to open in the former Dino’s Pizza Restaurant on 968 Killingworth Road in Haddam, CT, after the long‑running pizzeria closed in June due to the owners’ retirement. Restaurateurs Caleb Ellinas and Vincent Balisciano, who have been in the industry for about a decade, are renovating the space with new flooring, paint, bathrooms and a 12‑seat wood‑top bar, aiming to open for customers in mid‑to‑late September. The menu will feature brick‑oven pizza, homemade meatballs, Italian nachos, lobster ravioli, penne in vodka sauce, Tuscan butter shrimp, and unique toppings like hazelnuts and local honey, with plans for weekly happy hour specials and a half‑off wine bottle night. The pair are hiring around eight staff members, including bartenders, dishwashers, and wait staff, and intend to adapt the menu based on local preferences.",
  "argos_id": "Q3QRRQ205"
}