{
  "url": "https://www.washingtonexaminer.com/daily-on-defense/3763809/russia-launches-massive-attack-ukraine/",
  "authorsByline": "Jamie McIntyre, Christopher Tremoglie",
  "articleId": "3c9b277c23714e67832fb6a19e0ab320",
  "source": {
    "domain": "washingtonexaminer.com",
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.washingtonexaminer.com/wp-content/uploads/2025/08/Screenshot-2025-08-18-at-7.32.03-AM-3.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T11:23:08+00:00",
  "addDate": "2025-08-21T11:36:31.170245+00:00",
  "refreshDate": "2025-08-21T11:36:31.170247+00:00",
  "score": 1.0,
  "title": "Russia launches massive attack on Ukraine, while Putin slow rolls Trump",
  "description": "Daily on Defense: Russia launches new wave of attacks, Lavrov says Russia should guarantee security for Ukraine, Vance takes us inside the room, Miller rants against \"stupid hippies.\"",
  "content": "PUTIN’S WAR ROLLS ON: While the Kremlin remains noncommittal about a peace summit between Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky, Russia’s war machine continues to pursue its war aims with vigor. The latest attack involved more than 600 drones and missiles, which, in addition to targeting Zaporizhzhia and Dnipropetrovsk in the east, reached into far western Ukraine, hitting Lviv, and, according to Ukraine, a major American electronics manufacturer located near the southwest border with Hungary.\n\nIn a post on X, Zelensky said the “American-owned enterprise in Zakarpattia … has nothing to do with defense or the military,” calling it “a regular civilian business, supported by American investment, producing everyday items like coffee machines.” More than a dozen people were wounded in the strike.\n\nThe daily attacks continue as Zelensky has said he will meet with Putin at any time in any format. But the Kremlin seems in no rush for a meeting without assurances that Ukraine is ready to meet Russia’s unwavering demands, including the handover of the entire eastern Donbas region.\n\n“Putin is playing Trump,” said Rep. Eric Swalwell (D-CA) on CNN. “He drags this out and drags this out as he continues to bomb Ukraine and kill innocent children. And it’s because he knows Donald Trump is not serious about bearing real pressure down on Russia. He’s not going to put secondary sanctions on him. He’s not going to continue to send weapons of consequence to the battlefield in Ukraine. And so Putin can just play this delay, delay, delay game. It makes us look weak and worse.”\n\nOPINION: WILL TRUMP KEEP LETTING PUTIN PLAY HIM FOR TIME?\n\nLAVROV: ‘ROAD TO NOWHERE’: Meanwhile, in his latest remarks, Russian Foreign Minister Sergey Lavrov — in what might be considered laughable if it were not such a serious issue — suggested that Russia should be among the guarantors of Ukraine’s security in any post-war agreement.\n\nLavrov said Ukraine itself suggested as much in April of 2022, in failed talks just two months after the invasion. Lavrov claimed the draft agreement had been initialed, but blamed then-British Prime Minister Boris Johnson for killing the deal.\n\nLavrov says the Russian position remains that it will reject any regime of security guarantees that does not include Russian input, essentially implying a right to veto anything it’s not happy with, such as troops from NATO nations on Ukrainian soil.\n\n“We cannot accept the current proposal to address collective security issues without the Russian Federation. This approach is simply unworkable,” Lavrov said at a Moscow press conference. “I am certain that the West, particularly the United States, understands that any serious discussion of security without the Russian Federation is utopian. It is, quite frankly, a road to nowhere.”\n\nRUSSIA SAYS TALKS ABOUT UKRAINE’S SECURITY WITHOUT IT ARE A ‘ROAD TO NOWHERE’\n\nVANCE: ‘WE HAVEN’T FIGURED EVERYTHING OUT’: In an interview last night on the Fox News Show “The Ingraham Angle,” Vice President JD Vance talked about the promised meeting between Putin and Zelensky like it was a fait accompli.\n\n“We now have the Russians talking to the Ukrainians. They’re talking details about what would be necessary on each side to stop the fighting and stop the killing. We have made more progress in three months than the country had made in three years in stopping this conflict,” Vance told Fox News host Laura Ingraham. “We have made a lot of progress, Laura. Look, who knows what’s going to happen? The president tells me this all the time. You could never say with certainty what the outcome in this situation is going to be.”\n\n“There really are two big questions lingering out there. And in some ways it’s very simple, but in some ways it’s very complicated. Number one is, Ukraine wants to know that it’s not going to get invaded again by Russia. It wants to know that it’s got territorial integrity long into the future,” Vance said. “The Russians want certain pieces of territory, most of which they have occupied, but some of which they haven’t.”\n\n“So that is really where the meat of the negotiation is. The Ukrainians want security guarantees. The Russians want a certain amount of territory. Again, we finally got the details. We’re working on them. But we haven’t figured everything out. And I don’t think that we should force — we shouldn’t say that they can’t sit down until you have figured out every little detail. Sometimes, them sitting down is what facilitates figuring out those details.”\n\nOPINION: THE WEST MUST START PREPARING FOR UKRAINE PEACE TALKS TO FAIL\n\nGood Thursday morning and welcome to Jamie McIntyre’s Daily on Defense, written and compiled by Washington Examiner National Security Senior Writer Jamie McIntyre (@jamiejmcintyre) and edited by Christopher Tremoglie. Email here with tips, suggestions, calendar items, and anything else. Sign up or read current and back issues at DailyonDefense.com. If signing up doesn’t work, shoot us an email and we’ll add you to our list. And be sure to follow me on Threads and/or on X @jamiejmcintyre.\n\nCLICK HERE TO SIGN UP OR READ BACK ISSUES OF DAILY ON DEFENSE\n\nIN THE ROOM WHERE IT HAPPENED: ‘I’M GOING TO TALK TO THE GUY’: In his Fox News interview with Laura Ingraham, Vice President J.D. Vance painted a picture of what it was like Monday when Trump paused his meeting with European leaders to get a gut check from Russian President Vladimir Putin.\n\n“So we’re actually in the East Wing of the White House. And the president says, you know, we have had a pretty good meeting. I’m going to go call Vladimir Putin and see what he says about it. And everybody’s like, oh, you’re going to call him next week? And he’s like, no, what time is it in Moscow? Let’s call him right now,” Vance recalled. “You had a lot of the Europeans who were saying, no, no, no, there needs to be proper vetting and the teams have to prepare the phone call and blah, blah, blah, blah, blah. And the president was like, no, no, no. I want to talk to the guy. I’m going to talk to the guy.”\n\n“I think one of the things I have realized about President Trump’s leadership is he cuts through the B.S. of some of these diplomatic protocols and just says, I’m going to get things done. If I want to talk to somebody, I’m going to talk to somebody,” Vance said. “And I think that kind of no-holds-barred, no-B.S. diplomacy is part of the reason why we have made the progress we have.”\n\nVance said he’s never met Putin face-to-face, but he had talked to him on the phone. “It’s interesting. He’s more soft-spoken than you would necessarily expect,” Vance said. “The American media has a particular image of him. He’s soft-spoken in a certain way. He’s very deliberate. He’s very careful. And I think fundamentally he’s a person who looks out for the interests as he sees it as of Russia. And I think one of the reasons he respects the president of the United States is because he knows the president looks out for the interests of the American people.”\n\nPANETTA: TRUMP IS BEING ‘INCREDIBLY NAIVE’: Former Defense Secretary and CIA Director Leon Panetta offered a different assessment of Putin in an appearance on CNN yesterday.\n\n“Putin is about Russia, Putin is about winning, Putin is about killing people in order to be able to succeed in this war, that is who Putin is. And you cannot just simply sit back and hope that maybe deep down he’s a nice guy. We’ve made that mistake in the past with Putin. He cannot be trusted,” the former spymaster said.\n\nReferring to Trump’s open mic moment when he was heard telling French President Emmanuel Macron, “I think [Putin] wants to make a deal for me, you understand, as crazy as it sounds,” Panetta said Trump was being “incredibly naive” about the former KGB officer. “Putin does not take actions because somehow he’s trying to please you, that’s not what Putin is about.”\n\n“I think the President frankly has made a mistake by saying he wanted a ceasefire and then he backed away, that he wanted to make sure that Putin would agree or he would suffer consequences, and then backed away,” Panetta said. “That process of backing away from the threats that the President makes creates a sense of weakness.”\n\n“The President has to make clear if Putin does not meet with Zelensky, and they do not make progress, we are going to implement strong sanctions and we’re going to continue to provide weapons to Ukraine so that they can continue to fight this war.”\n\nPOLAND ACCUSES RUSSIA OF ‘PROVOCATION’ AFTER DRONE CRASH ON THE BORDER\n\nVANCE, HEGSETH, AND MILLER THANK THE TROOPS: In a visit to Washington’s iconic Union Station, a turn-of-the-century Beaux Arts rail station and shopping mall, featuring a gilded Roman barrel vaulted ceiling, Vice President Vance thanked National Guard troops who he credited for helping bring about a dramatic drop in crime.\n\n“A couple of years ago, when I brought my kids here, they were being screamed at by violent vagrants, and it was scaring the hell out of my kids,” Vance said. “And one of the things that we’ve done already in Union Station in just nine days is we’ve made it a place where people can walk around safely; they can bring their kids again; they can see this beautiful monument, the architecture; they can have a meal with their friends and their loved ones because, again, we’ve brought some law and order back to Washington, D.C.”\n\nVance said there has already been a “35% reduction of violent crime and a 50% reduction in robberies,” since Guard troops have hit the streets. “We are seeing really substantial effects because these guys are busting their ass,” Vance said, addressing a group of soldiers during lunch at a burger joint.\n\nHegeth said every Guard soldier he talked to expressed pride in the anti-crime mission. “They’re here because they’re patriots who serve the country and believe we deserve a beautiful, safe capital,” Hesgeth said. “They’re proud to be a part of making sure law and order is established here in the capital.”\n\nThere were some demonstrators protesting the militarization of police work in the city, but Vance dismissed them as “a bunch of crazy protesters,” who “hate the idea that Americans can enjoy their communities.”\n\nMiller, living up to his reputation as a firebrand, had the most incendiary words for the protesters. “The voices that you hear out there, those crazy Communists, they have no roots, they have no connections to this city, they have no families they are raising in this city,” he said. “They are the ones who’ve been advocating for the 1% of criminals and killers, the rapists, their drug dealers.”\n\n“All these demonstrators that you’ve seen out here in recent days, all of these elderly white hippies, they’re not part of this city and never have been. And by the way, most of the citizens who live in Washington, D.C. are black,” Miller said. “This is not a city that has had any safety for its black citizens for generations.”\n\n“So we’re going to ignore these stupid white hippies that all need to go home and take a nap because they’re all over 90 years old. And we’re going to get back to the business of protecting the American people and the citizens of Washington, D.C.”\n\nSTEPHEN MILLER BLASTS ‘STUPID WHITE HIPPIES’ DURING UNION STATION VISIT WITH VANCE AND HEGSETH\n\nWashington Examiner: Russia says talks about Ukraine’s security without it are a ‘road to nowhere’\n\nWashington Examiner: Poland accuses Russia of ‘provocation’ after drone crash on the border\n\nWashington Examiner: Opinion: Will Trump keep letting Putin play him for time?\n\nWashington Examiner: Opinion: The West must start preparing for Ukraine peace talks to fail\n\nWashington Examiner: NATO jets scramble to Ukraine-Romania border in response to Russian drone attack\n\nWashington Examiner: Bishop Barron praises Trump’s desire to ‘get to heaven,’ says he was ‘struck by his humility’\n\nWashington Examiner: Israel calls up 60,000 reservists for operation to take Gaza City\n\nWashington Examiner: Republicans praise Trump plan to paint border wall: ‘Black is the new orange’\n\nWashington Examiner: Vance told Zelensky he’d say nothing ‘as long as you behave’ in Oval Office\n\nWashington Examiner: Gabbard approves plans to cut ODNI roles she says are pushing ‘partisan priorities’\n\nWashington Examiner: Trump faces first breakdown in peace efforts as Rwanda-Congo peace deal collapses\n\nWashington Examiner: Stephen Miller blasts ‘stupid white hippies’ during Union Station visit with Vance and Hegseth\n\nWashington Examiner: White House launches TikTok account as third extension deadline creeps up\n\nPolitico: Pentagon Says US Will Play a Minimal Role in Ukraine’s Security Guarantee\n\nNew York Times: What Russia Is Doing to Grab Ukrainian Land While It Still Can\n\nWall Street Journal: In Eastern Ukraine, Fear and Disbelief Over Proposal to Cede Land to Russia\n\nWall Street Journal: How European Leaders Studied Trump and Learned to Speak His Language\n\nAP: Uganda agrees deal with US to take deported migrants if they don’t have criminal records\n\nBreaking Defense: Wilsbach, Former ACC Commander, in Running to Be Next Service Chief, Sources Say\n\nTimes of Israel: Israel to Purchase 2 More American KC-46 Refueling Planes for Its Air Force\n\nDefenseScoop: ‘Rapper Bot’ Hit the Pentagon in at Least 3 Cyberattacks\n\nAir & Space Forces Magazine: Stealth or Something Else? USAF Wants Ideas for Next-Gen Tanker Airframe\n\nBBC: US Navy Sailor Convicted of Spying for China\n\nAir & Space Forces Magazine: New Cyber Squadron in New Jersey Air Guard Going to McGuire\n\nStars and Stripes: Clone Wars: Air Force Wants to Study Copies of Iran’s Attack Drones\n\n10 a.m. 1775 Massachusetts Ave. NW — Brookings Institution discussion: “Replicator and Beyond: The Future of Drone Warfare,” with T.S. Allen, former director of Replicator-1 at the Defense Department Defense Innovation Unit; former Marine Corps Commandant Gen. David Berger; and Aditi Kumar, former principal deputy director of Replicator-1 at the Defense Department Defense Innovation Unit https://www.brookings.edu/events/replicator-and-beyond-the-future-of-drone-warfare/\n\n2 p.m. 214 Massachusetts Ave. NE — Heritage Foundation discussion: “Trump New Counterterrorism Strategy Landscape,” with Sebastian Gorka, deputy assistant to the president and senior director for counterterrorism at the National Security Council; and James Jay Carafano, senior counselor to the president and fellow at the Heritage Foundation https://www.heritage.org/terrorism/event/trump\n\n10 a.m. — National Institute for Deterrence Studies virtual seminar: “Deterrence in the Balance: Arms Control, Modernization, and Strategic Resolve,” with Mike Albertson, former senior adviser in the Office of the Secretary of Defense Office of Nuclear and Missile Defense Policy https://thinkdeterrence.com/events/deterrence-in-the-balance\n\n10 a.m. — Center for Strategic and International Studies Defense and Security Department and the U.S. Naval Institute or a Maritime Security Dialogue virtual and in-person discussion: “The Future of Naval Aviation,” with Vice Adm. Daniel Cheever, commander, Naval Air Forces and commander, Naval Air Force, U.S. Pacific Fleet in conversation with retired Rear Adm. Raymond Spicer, chief executive officer and publisher, U.S. Naval Institute https://www.csis.org/events/future-naval-aviation-conversation-vadm-cheever\n\n8 a.m 2401 M St., NW — George Washington University Project for Media and National Security Defense Writers Group breakfast conversation: “Assessing China’s Upcoming Parade-Extravaganza for the People’s Liberation Army,” with Mark Cozad and Timothy Heath, senior international defense researchers at RAND [email protected]\n\n3 p.m. Senate Chamber — Senate meets to resume consideration of the motion to proceed to S.2296, the “National Defense Authorization Act.” At approximately 5:30 p.m., the Senate will vote on the motion to invoke cloture on the motion to proceed to S.2296. http://www.senate.gov",
  "medium": "Article",
  "links": [
    "http://www.senate.gov",
    "https://www.washingtonexaminer.com/news/world/3761643/israel-reservists-called-up-gaza-city-takeover-operation/",
    "https://www.washingtonexaminer.com/author/christopher-tremoglie/",
    "https://www.bloomberg.com/news/articles/2025-08-19/pentagon-eyes-3-5-billion-restock-costs-from-israel-operations?sref=TmUfmp4E",
    "https://www.washingtonexaminer.com/news/world/3761861/russia-ukraine-security-talks-road-to-nowhere/",
    "https://www.washingtonexaminer.com/news/world/3762889/nato-jets-ukraine-border-russian-drone-attack/",
    "https://www.politico.com/news/2025/08/20/pentagon-minimal-security-guarantees-ukraine-00516856",
    "https://www.timesofisrael.com/liveblog_entry/israel-to-purchase-2-more-american-kc-46-refueling-planes-for-its-air-force/",
    "https://mid.ru/en/foreign_policy/news/2042165/",
    "https://www.washingtonexaminer.com/cdn-cgi/l/email-protection#8ee4e3ede7e0faf7fcebcef9effde6e7e0e9fae1e0ebf6efe3e7e0ebfca0ede1e3",
    "https://www.washingtonexaminer.com/policy/national-security/3762478/republicans-praise-trump-plan-paint-border-wall/",
    "https://www.wsj.com/world/ukraine-donetsk-russia-reaction-2adaef84?mod=hp_lead_pos2",
    "https://www.washingtonexaminer.com/policy/foreign-policy/3763585/vance-zelensky-trump-meeting-behave-argument/",
    "https://www.airandspaceforces.com/new-jersey-air-guard-cyber-jbmdl/",
    "https://www.washingtonexaminer.com/opinion/beltway-confidential/3760547/west-must-prepare-for-ukraine-peace-talks-to-fail/",
    "https://www.bbc.com/news/articles/cjw6847p2ypo",
    "https://www.washingtonexaminer.com/cdn-cgi/l/email-protection",
    "https://www.wsj.com/world/trump-europe-leaders-communication-1e28560f?mod=hp_lead_pos3",
    "https://www.defenseone.com/defense-systems/2025/08/pentagon-cuts-set-back-critical-ai-data-platform/407574/?oref=d1-homepage-top-story",
    "https://www.csis.org/events/future-naval-aviation-conversation-vadm-cheever",
    "https://thinkdeterrence.com/events/deterrence-in-the-balance-arms-control-modernization-and-strategic-resolve-with-mike-albertson/",
    "https://www.washingtonexaminer.com/news/white-house/3762153/white-house-tiktok-account-launch-third-extension-deadline-approaches/",
    "https://transcripts.cnn.com/show/cnc/date/2025-08-20/segment/11",
    "https://www.airandspaceforces.com/air-force-academy-majors-intact-faculty-cuts/",
    "https://www.stripes.com/branches/air_force/2025-08-20/iran-drone-replicas-18823276.html",
    "https://www.washingtonexaminer.com/news/world/3762715/poland-accuses-russia-provocation-drone-crash-border/",
    "https://www.nytimes.com/2025/08/20/world/europe/ukraine-russia-battlefield.html?unlocked_article_code=1.f08.NnRK.zIQWFb5zgMsB&smid=url-share",
    "https://www.wsj.com/world/europe/moscow-draws-hard-line-over-security-guarantees-for-ukraine-4b1e8428",
    "https://apnews.com/article/uganda-us-deportation-migrants-immigration-crackdown-trump-15edfb4d80677c51c56beb8ab5130cd4",
    "https://www.washingtonexaminer.com/opinion/beltway-confidential/3762603/trump-putin-negotiations-russia-ukraine-war-sanctions/",
    "https://www.washingtonexaminer.com/tag/daily-on-defense",
    "https://www.washingtonexaminer.com/policy/defense/3762526/pentagon-criticizes-report-about-pete-hegseth-security-detail/",
    "https://www.washingtonexaminer.com/in_focus/3760421/putin-prevaricates-details-emerge-ukraine-peace-proposal/",
    "https://www.heritage.org/terrorism/event/trumps-new-counterterrorism-strategy-landscape",
    "https://www.washingtonexaminer.com/author/jamie-mcintyre",
    "https://www.airandspaceforces.com/air-force-ideas-next-gen-tanker-ngas-airframe/",
    "https://www.washingtonexaminer.com/news/world/3761427/trump-breakdown-peace-efforts-rwanda-congo-peace-deal-collapses/",
    "https://www.washingtonexaminer.com/news/white-house/3760478/stephen-miller-stupid-white-hippies-union-station-vance-hegseth/",
    "https://twitter.com/jamiejmcintyre",
    "https://www.defensenews.com/pentagon/2025/08/20/pentagons-realistic-electronic-warfare-system-to-move-to-navy-lab/",
    "https://defensescoop.com/2025/08/20/rapper-bot-hit-pentagon-dodin-in-at-least-3-cyber-attacks/",
    "https://x.com/atrupar/status/1958211663062040954",
    "https://www.washingtonexaminer.com/politics/3762204/bishop-barron-praises-trump-desire-heaven/",
    "https://breakingdefense.com/2025/08/exclusive-wilsbach-retired-air-force-general-in-running-to-be-next-service-chief-sources-say/",
    "https://www.military.com/daily-news/2025/08/20/airman-killed-off-base-ak-47-shooting-near-fe-warren-air-force-base-identified.html",
    "https://www.brookings.edu/events/replicator-and-beyond-the-future-of-drone-warfare/",
    "https://www.airandspaceforces.com/article/drone-hype-and-airpower-amnesia/",
    "https://www.washingtonexaminer.com/news/white-house/3763396/gabbard-plan-cut-odni-roles-partisan-priorities/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Russian President Vladimir Putin",
      "weight": 0.058012486
    },
    {
      "name": "Vice President Vance",
      "weight": 0.057178706
    },
    {
      "name": "Vice President J.D. Vance",
      "weight": 0.054090343
    },
    {
      "name": "Vice President JD Vance",
      "weight": 0.05408488
    },
    {
      "name": "Ukraine peace talks",
      "weight": 0.05367712
    },
    {
      "name": "Washington Examiner",
      "weight": 0.052455295
    },
    {
      "name": "Washington Examiner National Security Senior Writer Jamie McIntyre",
      "weight": 0.05069697
    },
    {
      "name": "Eastern Ukraine",
      "weight": 0.048480466
    },
    {
      "name": "Vladimir Putin",
      "weight": 0.04843916
    },
    {
      "name": "Ukraine",
      "weight": 0.04791479
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9853515625
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.97314453125
    },
    {
      "name": "/News/World News",
      "score": 0.9326171875
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.861328125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.74658203125
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.66845703125
    }
  ],
  "sentiment": {
    "positive": 0.048791125,
    "negative": 0.7569125,
    "neutral": 0.19429632
  },
  "summary": "Russia has launched a massive military attack on Ukraine, using over 600 drones and missiles, targeting Zaporizhzhia and Dnipropetrovsk in the east, and reaching far western Ukraine, including Lviv and a major American electronics manufacturer near the border with Hungary. The Kremlin has not committed to a peace summit between Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky, pending assurances that Ukraine is ready to meet Russia's demands, including the handover of the eastern Donbas region. Russian Foreign Minister Sergey Lavrov suggested that Russia should be among the guarantors of Ukraine's security in any post-war agreement. Lavrov also stated that any serious discussion of security without the Russian Federation is a 'road to nowhere'.",
  "shortSummary": "Russian President Vladimir Putin continues his military campaign in Ukraine, rejecting any peace talks without assurances from Ukraine’s security stakeholders.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9bbff215578a44058b89bd8c3d361c8a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.bbc.com/news/articles/cjw6847p2ypo",
      "text": "US Navy sailor convicted of spying for China\nA US Navy sailor in California has been convicted of espionage for selling secrets to a Chinese agent who recruited him through social media.\nJinchao Wei, 25, was convicted of six charges, including espionage, conspiracy to commit espionage and unlawful export of classified data about US Navy ships.\nHe was paid more than $12,000 (£8,920) over an 18-month period by a Chinese intelligence officer who approached him in February 2022 for information about the USS Essex, which he served on, as well as other naval vessels.\nWei, also known as Patrick Wei, was arrested in August 2023 on espionage charges as he arrived for work on the amphibious assault ship.\n\"The defendant's actions represent an egregious betrayal of the trust placed in him as a member of the US military,\" US Attorney Adam Gordon said in a statement after the verdict was read.\n\"By trading military secrets to the People's Republic of China for cash, he jeopardised not only the lives of his fellow sailors but also the security of the entire nation and our allies.\"\nA naturalised US citizen, Wei served as a machinist's mate, held a security clearance and had access to sensitive information about the ship and other ships in the Pacific Fleet.\nDuring his weeklong trial, prosecutors presented evidence including phone conversations, electronic messages and audio messages that Wei had exchanged with his Chinese handler.\nWei called his Chinese contact \"Big Brother Andy\" and obliged to his requests to keep their relationship secret by using multiple encrypted apps to communicate and accept payments. Wei also used a new computer and phone provided by his handler.\nA text exchange between Wei and his mother was presented to show that he understood he was committing espionage.\n\"Other Chinese serving in the US Navy are still trying to figure out how to make extra money, and driving cabs. Whereas I am just leaking secrets,\" Wei texted his mother.\nShe responded: \"Good job!\"\nWei was approached by a Chinese agent while he was going through the process of becoming a US citizen.\nHe was recruited via social media by the Chinese intelligence officer, who at first portrayed himself as a naval enthusiast who worked for the state-owned China Shipbuilding Industry Corporation.\nEvidence showed Wei sent photographs and videos of the Essex, advised the officer of the location of various US Navy ships, and described the defensive weapons on board the Essex. He also described problems with his ship and other ships.\nWei is scheduled to be sentenced on 1 December and could face life in prison.\nWei could not be reached to comment. The BBC has approached his lawyer for comments.\nWei was arrested alongside Petty Officer Wenheng Zhao, who was arrested on charges of accepting more than $14,800 for sending sensitive photos and videos to a Chinese intelligence officer.\nProsecutors said Zhao transmitted \"plans for a large-scale maritime training exercise in the Pacific theatre, operational orders and electrical diagrams and blueprints for a Ground/Air Task Oriented Radar system located in Okinawa, Japan\".\nZhao was found guilty last year and sentenced to 27 months in prison."
    },
    {
      "url": "https://www.defensenews.com/pentagon/2025/08/20/pentagons-realistic-electronic-warfare-system-to-move-to-navy-lab/",
      "text": "The Pentagon’s advanced research hub says it has built the world’s largest, most realistic electronic warfare test capability and plans to install it at a Navy lab later this year.\nThe Defense Advanced Research Agency has been developing its Digital Radio Frequency Battlespace Emulator, or DRBE, since 2019 with the goal of helping improve the Defense Department’s ability to test new electronic warfare capabilities or provide realistic EW effects like radar jamming and spoofing.\nThe system uses a real-time high-performance computing architecture to reduce latency and provide more realistic RF simulation, according to program manager Anna Tauke-Pedretti.\nIn an interview with Defense News, Tauke-Pedretti said DRBE provides an option for DOD testers that lets them better tailor test events to specific scenarios or needs.\n“We’re able to test systems under more controlled and varying scenarios,” she said. “We can choose what we test against and what our environment looks like so we can better understand how our systems respond in certain environments.”\nEW simulation is a challenge for the DOD today — both in the lab and on live flight ranges. Labs often struggle to provide a realistic simulation, and open-air ranges are in high demand and the testing itself is complex and expensive. Tauke-Pedretti said DRBE is designed to tackle these concerns and make it easier for the military services to access high-fidelity testing.\nThe system itself takes up a few server racks, and Tauke-Pedretti said it doesn’t have major space constraints, which makes integrating DRBE fairly straightforward. She noted, however, that its power and cooling needs do require additional infrastructure.\nDARPA’s primary DOD partner for DRBE has been the Navy, and the program plans to transition the system to a service lab to start using the system operationally later this year. Tauke-Pedretti said other Pentagon agencies have shown interest in the system and DARPA is “actively exploring” options for integrating DRBE in other lab environments.\nAs the program prepares to hand over the initial system, Tauke-Pedretti said her office is already thinking about what the next generation of this capability could look like. That means increasing the number of systems that connect to DRBE, growing the size of the simulation and expanding its compute power.\nAt the heart of that expansion is an optical interconnect technology that will increase the system’s bandwidth and connect more systems with lower latency. That could allow DRBE to support new missions, like battlespace autonomy, digital modeling and materials science.\n“DRBE isn’t just a test tool; it has the potential to be a strategic enabler for next-generation defense technologies,” Tauke-Pedretti said. “By pushing the boundaries of real-time emulation and compute, we’re laying the groundwork for smarter, faster, and more resilient EW systems.”\nCourtney Albon is C4ISRNET’s space and emerging technology reporter. She has covered the U.S. military since 2012, with a focus on the Air Force and Space Force. She has reported on some of the Defense Department’s most significant acquisition, budget and policy challenges."
    },
    {
      "url": "https://www.washingtonexaminer.com/in_focus/3760421/putin-prevaricates-details-emerge-ukraine-peace-proposal/",
      "text": "Over a whirlwind four days of diplomacy designed to end the war in Ukraine, President Donald Trump has met with Russian President Vladimir Putin, Ukrainian President Volodymyr Zelensky, and prominent European leaders.\nTrump and Zelensky engaged warmly on Monday, expressing optimism about resolving the now 3 1/2-year war, the bloodiest and largest since World War II. This represents a marked contrast from the two leaders’ disastrous White House meeting in February. Other positive signals have also come to the fore.\nUkraine and Russia now appear ready to recognize territorial concessions based on the current battlefield front lines. This understanding would entail de facto but not de jure recognition of Russian control over Ukrainian territory in Crimea and southeastern Ukraine. It would also mean Russia tacitly giving up its requirement of total control over the entirety of central-southern and southeastern Ukrainian provinces that the Kremlin falsely claims as Russian territory. While these concessions would be painful for Ukraine, they would be tolerable alongside other evolving elements of the deal.\nNotably, there is new confidence that European ground forces could be deployed to Ukraine to provide Kyiv with “security guarantees.” Russia is sending mixed signals here but seems to be insisting that no Western troops enter Ukraine after a peace deal is reached. Still, it is good that Europe is putting meat on the bones of what any security guarantee force would look like. This force would aim to ensure any peace agreement in 2025 is not later smashed apart by a Russian invasion in 2030, 2035, or beyond. Ukraine’s concern is legitimate, given that Russia breached its 1994 Budapest Memorandum treaty obligations via its 2014 seizure of Crimea, and its Minsk 2 treaty commitments via its February 2022 invasion.\nWhat form would a peacekeeping force take?\nIt would be led by deployments from the United Kingdom, France, and Germany of perhaps 15,000 to 30,000 troops. This force would act as a so-called “tripwire” deterrence against a future Russian invasion (the tripwire principle was applied during the Cold War in relation to NATO military forces deployed in Berlin to deter an attack by the Soviet Union’s Red Army). Considering the need for the U.S. military to prioritize China-related threats, the burden must fall predominantly on Europe here. In turn, unreliable allies such as Spain and Hungary, which refuse to provide either funding or forces for these efforts, should be expelled from NATO. Similarly, if German Chancellor Friedrich Merz yields to parliamentary pressure not to deploy ground forces to Ukraine, Trump should relocate all U.S. military forces in Germany to other bases in Europe.\nThe ingredients to make any security guarantees credible are becoming more apparent. One challenge until now has been Trump’s reticence about the possibility of the U.S. military defending European peacekeepers if they were to come under Russian attack. But Trump now says the U.S. will be involved and “will help by air.” While greater detail is needed, Trump’s statement suggests a U.S. air power backstop for Europe. This will be a foundation stone of any successful security guarantee.\nAs I noted on Monday, “The lack of an American guarantee to come to the aid of allies that might be attacked in the future poses two key challenges. First, it will fundamentally damage Ukraine’s confidence that any security guarantees are worth the paper they are written on. If Nigel Farage becomes the next U.K. prime minister and Jordan Bardella the next French president, for example, troops from those countries might quickly be withdrawn from Ukraine. Putin can then return to conquest, rearmed and resupplied by years of post-sanctions peace. Only America has the strategic credibility to be reliable here. The Europeans also know that the Russians know this, which is why they are so determined to ensure any security guarantees have teeth. Trump can get the Europeans to pay for any security guardrails and man its de facto ramparts, but America will have to be ready to step in if the Russians decide to restart any conflict.”\nOther complicated considerations remain, however.\nFor a start, Zelensky and Putin have yet to meet. On Monday, Trump again pushed for the two leaders to meet, followed by a trilateral meeting involving himself. But while Zelensky has expressed openness to an immediate bilateral engagement with Putin, the Russian leader seems to be playing games.\nResponding to Trump’s entreaty on Monday, Putin suggested Zelensky come to Moscow. This was a very direct insult to Zelensky and, frankly, to Trump. It shows Putin’s desire to broadcast his overarching belief that Ukraine belongs to Russia, and his interest in signaling dominance over Zelensky (Trump is beginning to recognize how to turn this gamesmanship back against Putin). Russian Foreign Minister Sergey Lavrov is also playing down a near-term timetable for any meeting. This further indicates that Putin is playing for time, doing only the absolute minimum to avoid devastating new U.S. sanctions. In response, Trump should give Putin a deadline of seven days to meet with Zelensky or suffer those sanctions.\nOther questions also need resolution.\nTake Ukraine’s demand that Russia pay significant reparations for the immense damage that it has caused since February 2022. Putin will be reticent to agree to compensation payments for reasons of both pride and practicality. Russia’s economy is struggling, and its government revenues are running low. A possible solution may be found by providing Ukraine with access to Russian assets seized since the war began.\nSimilarly, international sanctions relief for Russia must be tempered to incentivize Russia’s acceptance of a peace agreement and its post-signing compliance. The conduct of the Russian intelligence services inside Ukraine will be particularly important in this regard.\nAfter all, where Putin has previously decided that direct military invasion of a perceived hostile country is impractical, he has repeatedly deployed covert intelligence officers to spread discord, murder, and even pursue attempted coup d’etats. A good example here comes from the Russian GRU military intelligence service’s failed 2016 coup attempt in Montenegro. Any viable peace deal will thus require so-called “snap back sanctions” or similar measures to impose timely, direct costs on any Russian undermining of Ukraine’s stability or sovereignty.\nAnother issue?\nU.S.-Russia relations following any peace agreement. While U.S.-European trade/investment is vastly more lucrative to the U.S. than any credible prospect of even much increased U.S.-Russia trade/investment, Trump is excited by the prospect of new U.S.-Russia economic cooperation. While this is not concerning in and of itself, the Kremlin will attempt to exploit any such cooperation to earn American political latitude to increase its hostile intelligence and military activity against Europe. Moreover, American business executives wishing to deal in Russia should be wary that while their new Russian engagements might make a quick buck, they will also bear significant medium-longer term risk of Justice Department corruption charges or their flying out of high-story windows.\nIn the same way, any new U.S.-Russia nuclear agreements must carry safeguards to ensure that Russia does not break its word. As with the Chemical Weapons Convention, the Intermediate-Range Nuclear Forces Treaty, and the Outer Space Treaty, Putin is happy to sign arms control treaties and then systematically break them.\nFIVE THINGS THE EUROPEANS ARE ASKING OF TRUMP\nWhere does this leave us?\nMomentum toward peace is clearly growing in Trump, Europe, and Ukraine. This is a good thing. But until Putin defers his penchant for KGB deception in favor of more constructive actions, it will be hard to find cause for real optimism."
    },
    {
      "url": "https://www.airandspaceforces.com/air-force-ideas-next-gen-tanker-ngas-airframe/",
      "text": "The Air Force is conducting another round of market research for its proposed next-generation tanker, specifically asking industry for ideas on the airframe—a wide-open question with major implications for the future fleet.\nThe request for information, released Aug. 15, is labeled as “controlled unclassified information” and is not publicly accessible. Companies have until Oct. 24 to respond.\nThis is the latest RFI for what the Air Force is calling the Next-Generation Air Refueling System. The Air Force Life Cycle Management Center launched the NGAS program with a request in 2023, and it released subsequent calls for ideas in 2024 for engines and mission systems.\nBut this new request could be crucial for determining how the service moves forward.\nNGAS was originally envisioned with at least some stealth features so it could accompany fighters into contested airspace. Lockheed Martin has unveiled several concepts, including an unmanned version, and startup JetZero has pitched its in-development blended wing-body aircraft as an option.\nBut officials have acknowledged that building a stealthy tanker might not be feasible, given other modernization priorities like the new F-47 fighter, the B-21 bomber, and the Sentinel intercontinental ballistic missile. Instead, they have suggested a modified approach.\n“When you look at this NGAS and NGAS family of systems … you’ll find us talking through this in terms of survivable air refueling,” Maj. Gen. Joseph D. Kunkel, head of Air Force Futures, said in April. “We’re trying to counter the entirety of the kill chain, and that could result in a bunch of different things. … That might not be just a stealth tanker, or just an end-game effector on a tanker, or just a networked tanker. There’s a family of things that come together to create survivability.”\nIn its 2026 budget request, the Air Force confirmed it’s no longer wedded to the idea of a stealthy tanker. Documents detailing plans for NGAS don’t mention stealth at all, but do say that “alternatives for more survivable tanking capability could potentially be addressed through more resilient connectivity and on-board and off-board self-protection. Acquisition strategies for any or all of these options would be directly related to requirements that will be refined through the FY 2026 activities.”\nThe latest RFI would count among those 2026 activities, as the new fiscal year begins Oct. 1, before responses are due.\nAny decision on NGAS could be impacted by the Air Force’s decision in July that it would forgo a competition to recapitalize its aging KC-135 fleet, opting instead to buy more KC-46 tankers.\nOn top of that, the Navy is working to field an unmanned refueler, the MQ-25. Boeing has pitched a version that can operate from land, rather than from aircraft carriers, that could be of interest to the Air Force depending on how the Navy program fares."
    },
    {
      "url": "https://www.military.com/daily-news/2025/08/20/airman-killed-off-base-ak-47-shooting-near-fe-warren-air-force-base-identified.html",
      "text": "An airman stationed at F.E. Warren Air Force Base, who died after being shot by an AK-47 fired through the wall of an off-base apartment in Wyoming, has been identified by service officials.\nSenior Airman Joshua Aragon, a specialist assigned to the 790th Missile Security Forces Squadron at the base's 90th Missile Wing, died early Saturday morning, a statement released late Tuesday evening detailed.\nThe airman accused of firing the weapon was identified as Airman 1st Class Jadan Orr with the 90th Missile Security Forces Squadron. Orr has been \"charged with involuntary manslaughter by the Laramie County District Attorney's Office,\" the statement said. Additionally, Military.com confirmed that charge with the local circuit court.\nRead Next: Air Force Chief's Sudden Retirement Raises Question of 'Who Is Next' in Leadership Shake-Up\nThe new details from F.E. Warren Air Force Base mark the second case of involuntary manslaughter being investigated involving Security Forces airmen at the Cheyenne, Wyoming, installation this summer.\nIn a Facebook Post on Saturday, the Cheyenne Police Department said that Aragon was 23 years old and that Orr was 20 years old. The incident happened after several friends had been drinking at an apartment until the early morning hours on Saturday, the police said.\nOrr had gone into the bedroom of the apartment with two friends and allegedly began handling an AK-47 in the room.\n\"At some point, Orr picked up an AK-47 that was in the room,\" the Cheyenne Police Department said on Facebook.\"While manipulating the firearm, Orr charged it and fired it through the wall into the living room, striking the victim in the torso.\"\n\"We are deeply saddened by the tragic loss of Senior Airman Aragon,\" Col. Terry Holmes, 90th Missile Wing commander, said in a statement. \"He was a valued member of our defender team, and his passing leaves a tremendous void. Our thoughts are with his family, friends and fellow airmen as we grieve this heartbreaking loss.\"\nThe Cheyenne Police Department is investigating the incident, and the 90th Missile Wing is cooperating with the probe, the Air Force's statement said.\nLast month, Security Forces Airman Brayden Lovan, 21, was killed by a firearm discharge involving a Sig Sauer M18 handgun at F.E. Warren. The July 20 incident led to a widespread pause of the pistol's use throughout Air Force Global Strike Command, as well as an investigation throughout the entire Air Force.\nBut earlier this month, the Air Force announced that \"an individual has now been arrested on suspicion of making a false official statement, obstruction of justice, and involuntary manslaughter.\"\nAir Force Global Strike Command's pause of the handgun's use is still ongoing. Lovan's death renewed scrutiny of Sig Sauer's P320 handgun, including its M17 and M18 military variants, amid yearslong allegations, lawsuits and reports of the pistols firing without the trigger being pulled.\nFollowing the announcement of the Air Force Global Strike Command investigation, the gun manufacturer said in a statement late last month that it has \"absolute confidence in the U.S. military's ability to conduct a thorough investigation and report their findings.\" It defended the P320 handgun, calling it \"one of the safest, most advanced pistols in the world -- meeting and exceeding all industry safety standards.\"\nNo public statement has been issued by Sig Sauer following the announcement of the arrest and involuntary manslaughter charge related to Lovan's death.\nRelated: Airman Accused of Firing AK-47 Through Apartment Wall in Latest Gun Death Near Wyoming Base"
    },
    {
      "url": "https://www.washingtonexaminer.com/opinion/beltway-confidential/3762603/trump-putin-negotiations-russia-ukraine-war-sanctions/",
      "text": "President Donald Trump deserves credit for his whirlwind diplomacy since last Friday. Trump has met with Russian president Vladimir Putin, Ukrainian President Volodymyr Zelensky, and European leaders toward reaching a just end to the now three and a half year war in Ukraine. Hundreds of thousands of people have been killed since Russia invaded Ukraine on Feb. 24, 2022. The war is the largest and bloodiest in Europe since the Second World War ended in 1945.\nIt’s now clear that Zelensky and America’s European allies are ready to make painful concessions and expensive investments to secure a durable peace. Unfortunately, however, it’s equally clear that Putin is again manipulating Trump’s good intentions to buy time to continue his war of conquest. Kremlin actions over the past 24 hours underline how Russia doesn’t want to take any substantive steps toward advancing the peace process.\nTake Trump’s push for Zelensky and Putin to hold a bilateral meeting as soon as possible. Zelensky has endorsed this suggestion, stating that as long as the talks are held at the head of state level, he is ready to meet in a neutral country. In contrast, Putin first responded to Trump’s suggestion by inviting Zelensky to Moscow. This invitation to Moscow was a deliberate slight designed to broadcast his dominance over Zelensky at home in Russia. It also served to advance the Russian imperialist narrative that Ukraine is actually part of Russia.\nThe Russians are now playing games over the very notion of a bilateral meeting.\nAs Russian foreign minister Sergey Lavrov put it on Wednesday, “When it comes to meetings at the highest level, it is necessary to prepare them in the most thorough way at all previous stages, so that the summits do not turn into a deterioration of the situation, but really put an end to the negotiations that we are ready to continue.”\nThis might sound legitimate, but it’s actually just Russian gamesmanship 101. The truth? Putin doesn’t want a bilateral meeting with Zelensky because the aftermath of that meeting would prove that he isn’t ready to make real concessions. At the same time, however, Putin doesn’t want to provoke new U.S. sanctions. That means the Kremlin has to keep inventing excuses to buy time without seeming to invent excuses to skirt Trump’s priority diplomatic agenda. But the gamesmanship is now fully apparent.\nTake Lavrov’s simultaneous effort to divide the U.S. and Europe over the security guarantees question. Deliberately avoiding the show of Western unity at the White House on Monday and Trump’s associated offer of air support to any European peacekeeping effort, Lavrov claimed that European countries want “to drag the United States back into its aggressive belligerent campaign to preserve and strengthen Ukraine as an instrument of deterrence of Russia. … This will not work.”\nAgain, the deflection here is apparent. Moscow wants to slow down any real momentum toward either peace or new U.S. sanctions by presenting the Kremlin’s emotive theatrics as legitimate concerns that require more debate and delay.\nPutin knows full well that while any peace deal will mean that Ukraine doesn’t join NATO anytime soon for reasons of Russian protest, nor can Ukraine accept a peace deal that doesn’t provide substantive safeguards against Russia again breaking its word and reinvading down the road. Remember, Russia breached its 1994 Budapest Memorandum commitments by seizing Crimea in 2014, and its 2015 Minsk 2 accord commitments by its full-scale invasion of Ukraine in 2022.\nAS PUTIN PREVARICATES, DETAILS OF UKRAINE PEACE PROPOSAL EMERGE\nTrump needs to recognize that Putin is the clear obstacle to the fulfillment of his noble agenda. Russia should be given a deadline of one week to get serious or suffer wide-ranging sanctions on its central bank and energy export partners.\nAfter a few months of suffering that pain in an economy already riven by high inflation and numerous other problems, and the continuing inability of the Russian armed forces to secure major territorial gains amid ever-increasing casualties, perhaps Putin will become more serious about peace."
    },
    {
      "url": "https://www.washingtonexaminer.com/policy/national-security/3762478/republicans-praise-trump-plan-paint-border-wall/",
      "text": "The miles of steel slats along the southern border are getting a fresh coat of paint meant to disincentivize would-be crossers, drawing praise from Republicans and new criticism from Democrats.\nHomeland Security Secretary Kristi Noem announced while in New Mexico this week that President Donald Trump had instructed her to paint the “entire” reddish brown wall black to make the beams hotter and more difficult for climbers to scale.\n“It’s tall, which makes it very, very difficult to climb, almost impossible. It also goes deep into the ground, which would make it very difficult, if not impossible, to dig under. And today we are also going to be painting it black,” Noem said in Santa Teresa, New Mexico, on Tuesday evening.\n“That is specifically at the request of the president, who understands that in the hot temperatures down here, when something is painted black, it gets even warmer, and it will make it even harder for people to climb,” Noem said.\nToday marks seven months of @POTUS Trump’s second term. When we got to work, America faced the worst border crisis in history. Today, that crisis isn’t just under control— it’s been obliterated.\n— Secretary Kristi Noem (@Sec_Noem) August 20, 2025\nThis wall is part of the difference. Too high to climb. Too narrow to squeeze… pic.twitter.com/pPxfVWVSCU\nThe Trump administration’s plan to paint the beams was met with strong support from Republican lawmakers in Washington.\nHouse Majority Leader Steve Scalise (R-LA) told the Washington Examiner on Wednesday that “this latest step will be one more deterrent that signals to the world that coming illegally through our southern border will not be possible.”\n“After only seven months in office, President Trump has completely turned around the disastrous mess the Biden administration created at the border, with crossings now down to their lowest level in decades,” Scalise wrote in a statement. “America is once again a nation that enforces our laws.”\nRep. Tony Gonzales (R-TX), whose district encompasses 800 miles of the 1,950-mile U.S.-Mexico border, said he thanked Noem on Tuesday during her visit to what was one of the epicenters for illegal immigration during the Biden administration.\n“I completely agree with President Trump’s approach to building more wall, which is one of the reasons why I voted yes on the one big beautiful bill, making it harder for criminals to scale the existing wall. Black is the new orange!” Gonzales wrote in a text message on Wednesday.\nNot all lawmakers support Trump’s paint project, however. Rep. Bennie Thompson (D-MS), the top Democrat on the House Homeland Security Committee, said the money could be better spent elsewhere.\n“This is unfortunately a cruel waste [of] taxpayer dollars that were stolen from healthcare programs in our communities,” Thompson said in a statement, referring to the billions in border dollars provided in the recently passed GOP tax law. “The American people deserve better.”\nThe idea of painting the slatted beams, which range from 18 to 30 feet tall, is not new. In May 2020, amid the pandemic, Trump reportedly told his advisers that painting them would make the steel hotter and that he preferred “matte black.” The project was said to cost around $500 million.\nOn Tuesday, U.S. Border Patrol Chief Mike Banks said during a press conference in New Mexico that painting it black would also prevent the steel beams from rusting in the open elements.\nDHS TO DENY IMMIGRATION BENEFITS TO THOSE WITH ‘ANTI-AMERICAN’ VIEWS\nPlans to repaint the steel slats come as the Trump administration works to build more of the border wall. In his first term, Trump surpassed 450 miles of new border wall, roughly the same amount funded but not completed by the day he left office in January 2021."
    },
    {
      "url": "https://www.washingtonexaminer.com/opinion/beltway-confidential/3760547/west-must-prepare-for-ukraine-peace-talks-to-fail/",
      "text": "President Donald Trump, Ukrainian President Volodymyr Zelensky, and various European leaders are focused on “security guarantees” to uphold any possible peace settlement between Russia and Ukraine.\nIdeas on the table range from the deployment of European troops in Ukraine to collective defense guarantees along the lines of NATO’s Article 5, which commits all NATO members to recognize an attack on one member as an attack on all members, thus requiring a mutual defense response. The logic here is that unless Ukraine’s security is entrenched by force of defensive arms, any pause in the fighting will simply set the stage for another Russian assault five, 10, or 15 years down the road.\nMoscow, however, is playing games. While Trump administration officials say Russia has now accepted some form of Western security guarantees for Ukraine, the Kremlin isn’t exactly echoing that rhetoric. On Tuesday, the Russian foreign ministry again described any Western troop presence in postwar Ukraine as utterly unacceptable. It is likely that Russia will not agree to any measures that secure Ukraine’s sovereignty. After all, that security would end the very project of coercion that has defined Russia’s policy toward Ukraine since 2014.\nEuropean leaders remain more optimistic. Zelensky has said security guarantees could be finalized within 10 days. French President Emmanuel Macron and British Prime Minister Keir Starmer are convening the “Coalition of the Willing” to prepare a detailed security guarantee package. The United States is expected to support any effort with air power, logistics, and intelligence efforts, but not ground forces.\nAgain, however, Moscow’s overarching desire to subjugate Ukraine remains omnipresent in the Kremlin’s calculations. That means the West must be prepared for what comes next: continued war.\nTrump says heavier sanctions are ready to go if peace efforts fail. But merely imposing additional sanctions alone won’t be enough. Secondary sanctions on buyers of Russian energy would cause Moscow discomfort by draining a critical source of revenue. However, sanctions must go in tandem with building Ukraine’s long-term defensive capability. This would allow Ukraine to increase military pressure on Moscow, gradually creating conditions that could make negotiations more successful.\nTo strengthen Kyiv’s position, Europe and the U.S. could support the development of a more resilient defense industry capable of meeting both current battlefield needs and future security challenges. Key areas of focus include domestic drone production, where Russia has maintained an advantage, and new ballistic missile systems. Funding for such programs could come from frozen Russian assets held in the West, complemented by ongoing European financial assistance. This would provide Ukraine with a more sustainable foundation for its defense over the long term.\nMeeting Ukraine’s demands today should go hand in hand with rebuilding Europe’s capacity to deter threats tomorrow. Europe must see sustained production of munitions, investment in next-generation technologies, and bolstered ability to respond quickly to crises on its borders.\nUKRAINE PEACE REQUIRES TRUMP TO DEMAND ACTION FROM PUTIN\nThis war has diminished Russia’s influence abroad from Syria to the South Caucasus. Moscow’s reach is weaker than before the invasion. Ukraine and its partners must seize on that, not allow Russia to recover.\nUnless the costs are real, Moscow will keep fighting."
    },
    {
      "url": "https://www.defenseone.com/defense-systems/2025/08/pentagon-cuts-set-back-critical-ai-data-platform/407574/?oref=d1-homepage-top-story",
      "text": "Pentagon reductions set back critical AI-data platform\nAfter users flocked to Advana, DOD’s AI office laid out a plan to keep it growing. Then came DOGE.\nPersonnel cuts are crippling progress on Advana, a Pentagon data platform that has been widely used in recent years to accelerate functions from logistics to finance to readiness—and which is key to the department’s AI plans, current and former defense and military officials say.\n“You tell this organization to do ‘A.’ Then you cut contracted staff by 80 percent and you have a turnover of close to what, 60 percent? Things are going to break. Things are going to get delayed. We’re in both places,” said one defense official who asked for anonymity to speak freely.\nIn 2021, the Defense Department comptroller launched the “Advancing Analytics” platform—soon shortened to Advana—as an accounting tool that could help keep track of what the Pentagon was buying and where it was sending it. DOD leaders pushed commanders and offices “hard,” in the words of one official, to adopt it. Within months, Advana had some 20,000 users across 42 organizations, and Booz Allen Hamilton had a five-year, $674 million contract to help expand and maintain it.\nIn less than a year, Advana was helping U.S. troops coordinate with European partners to track and deliver munitions and other supplies to wartorn Ukraine. The system proved so useful that in July 2022, DOD’s inspector general chided elements of the military for not adopting it fast enough.\nAs more DOD offices and agencies connected their systems to Advana, users across the Pentagon could coordinate their work—logistics, contracting, finance, and more—far more easily and accurately. By 2023, Advana had more than 72,000 users and far more data than initially expected.\nThis unexpected success strained the Advana system, so in June 2024, the Pentagon’s Chief Digital and Artificial Intelligence Office—which had taken over the Advana program—put development on hold so that its user interface could be improved and its underlying architecture could be strengthened.\nCDAO leaders also decided to split Advana into two parts: one to handle the urgent, often classified needs of warfighters, and another to handle slower, less dynamic business records, according to current and former officials. Among other things, this was intended to smooth the introduction of AI tools onto the platform. Yet the two parts would remain connected so that, for example, acquisition officials could make decisions based on battlefield data, while commanders could bring supply-and-contract data into their own war planning.\nOne month after pausing Advana development, CDAO unveiled plans for a 10-year, $15 billion Advancing AI Multiple Award Contract, or AAMAC. This vehicle was intended to bring in other software makers and cloud providers to help Booz Allen Hamilton split up Advana, give it a better front end for users, and update its back end for performance and growth. CDAO officials formally announced the plan in September and opened a process for contractors to submit proposals.\nCuts and cancellations\nThe election of Donald Trump brought a new team to the Pentagon. In February, a senior defense official described a desire to convert the Advana project into a program of record, ensuring consistent budgeting. In April, the Defense Department axed what it called “duplicative” consulting contracts, including at least one to Booz Allen. Two current officials we spoke to said the action reduced the amount of contractor support the company was able to provide to Advana. But a former senior official said that the point of AAMAC was to bring in additional contractors to work alongside the company. Booz Allen remains under contract to support Advana through early 2027. A company spokesperson said, “Decisions regarding current Advana contracts were made before the memo, and any staff reductions made earlier this year were due to normal contract transitions rather than the memo or DOGE reviews.”\nContracts are reduced or changed all the time. Defense officials assured the public that the program was still on track and the upgrade was in the works.\nBut the Trump administration took aim not just at excess consultants, but what they deemed excess staff as well. On Feb. 20, Defense Secretary Pete Hegseth announced plans to cut 5 to 8 percent of his department’s roughly 760,000-person civilian workforce, an effort aided by White House executive orders and its Department of Government Efficiency, run by Pentagon contractor Elon Musk.\nThe cuts hit the effort to modernize Advana hard. The CDAO lost two top architects as well as supporting staff, nearly 60 percent of its workers. Current and former officials said the cuts hollowed out the technical workforce needed to implement the upgrades.\nThe schedule began to slip. Promised upgrades were repeatedly delayed. Users across the department continued to wait. Last month, the entire AAMAC was put on hold.\nWhy did the loss of a few staffers, following a plan to expand the program, have such a big effect? Standing up a highly automated data environment works differently for the Defense Department than it would for a Fortune 500 company, which could call a vendor and easily purchase an out-of-the-box solution. The department has to verify the security and reliability of software, hardware, and even data according to specific standards. Even if some of the bureaucratic obstacles are unnecessary, many still exist in law and can’t just be ignored. Simply bringing in a data source to help train an AI platform can take months of review and security verification, according to one source. Then there is the issue of actually understanding Defense Department data, including where to find it across departments, offices, commands, and agencies. In short, no matter what the Defense Department decides to purchase as part of a new Advana effort, expert staff, now absent, will be necessary to make it work.\n“Literally, there’s no one else to do it,” said one defense official.\nFar-reaching effects\nAn indefinite delay to a data platform update may not sound like the sort of thing that could have far-reaching effects for the largest military in the world. But aside from its role in accounting—core to the stated goal of enabling the Defense Department to pass an audit— Advana has become the key data platform for many of its activities, including operational logistics and Joint Staff planning for large-scale conflict.\nIn future wars, defense planners anticipate “contested logistics,” making resupplying troops and other administrative functions more important, complex, and difficult. For more than a year, units have been incorporating Advana into key wargames and exercises. These experiments have demonstrated the value of easy access to as much information as possible about supply, logistics, and other “business” matters. One former senior defense official described it as essential to the goal of “getting ahead” of adversary efforts to thwart resupply and material support.\nBut unless the Advana platform gets the upgrades needed to keep it from buckling under the load, it will suffer a type of collapse, current and former officials said. Already, the current architecture does not meet demand and it’s difficult to run advanced analytic tools on it. Data, they said, is returning to “silos,” meaning officers and commanders are holding it rather than incorporating it into a central repository. They worry that simple requests will go back to an analog system of phone calls and emails, exchanges that could take days or weeks as opposed to instantaneous. Some officials said this is already happening in isolated instances.\nA larger concern is that individual services, commands, and offices may build their own data analysis tools but won’t have the benefit of all available Defense Department data. And exchanging data between entities will return to phone calls and email exchanges. That will sever the connections built up over the past few years, plunging the Pentagon back into a world of separate systems, figuring out orders and drafting plans through the exchange of PDFs, and Excel spreadsheets.\nIt’s “a little back in the future,” said one official.\nThe picture is of a Defense Department moving away from faster, better, joint, all-domain command and control, getting slower as adversaries get faster.\nComing changes\nChanges are already underway—for CDAO, at least.\nThe office is being moved under the office of the defense undersecretary for research and engineering, according to an Aug. 14 memo. The memo gives Undersecretary Emil Michael and his fellow defense undersecretary for acquisition and sustainment 120 days to deliver a plan for Advana and the Maven Smart Systems program, another CDAO AI effort. Defense One reviewed a copy of the memo, which was first reported by DefenseScoop.\nCurrent and former officials were cautiously optimistic that the change could provide high-level attention to the program to get it fixed— most importantly, by restoring cut staff.\n“Putting CDAO under R&E should help focus resources to do the upgrades necessary to make Advana an available platform for Fourth Estate use,” said one current official.\nHowever, another current defense official expressed concern that the move might shift data-centralization efforts away from AI-development programs, just when the two should be more closely integrated.\nA second former senior defense official said putting CDAO under the R&E undersecretary might turn AI efforts that are close to deployability into a “science project.”\n“Everyone is focused on moving projects out of R&E faster and fielding faster, which is a good thing. But this puts even more on their plate in a way that seems unnecessary. It could work out just fine, but there’s a lot of risk,” they said.\nAsked for comment on Advana and the merger memo, a defense official sent a statement.\n“The OUSD(A&S) has completed an assessment and delivered a recommendation on Advana, which is under review by Senior Department leadership. The Department of Defense is continuing to take decisive action to implement AI across enterprise functions and workflows, including instituting directives from President Trump’s AI Executive Order and the White House AI Action Plan.\n“Claims of dysfunction are unfounded; our efforts are focused on accelerating AI adoption to ensure the Department remains at the forefront of this new technological frontier.”\nOne month ago, a banner was added to the CDAO website: “More information on the Advana way ahead coming soon.”"
    },
    {
      "url": "https://defensescoop.com/2025/08/20/rapper-bot-hit-pentagon-dodin-in-at-least-3-cyber-attacks/",
      "text": "‘Rapper Bot’ hit the Pentagon in at least 3 cyberattacks\nThe powerful “Rapper Bot” Distributed Denial of Service-for-hire botnet impacted the Department of Defense Information Network (DODIN) in at least three attacks between April and August — when U.S. government authorities gained control of the disruptive malware web, two officials told DefenseScoop.\nFederal prosecutors in Alaska charged 22-year-old Ethan Foltz on Tuesday for allegedly running the large-scale cyber operation since before or around 2021. Authorities ranked Rapper Bot as “among the most powerful DDoS botnets to have ever existed,” in the affidavit for the criminal complaint.\nOn a call with a small group of reporters shortly after the announcement, sources familiar with this investigation who requested anonymity to speak freely about it, shared new details about this massive online extortion campaign that targeted victims all over the world — including a U.S. government network, a popular social media platform and multiple technology companies.\n“The Department of Defense, [and] specifically the defense industrial base, is one of the 16 critical infrastructures listed by the United States, which means we’re a big target. We get targeted by DDoS and botnet services all time. We have a very robust network defense team that handles that,” an official said.\nAlso known as CowBot or Eleven Eleven Botnet, Rapper Bot primarily pursued Internet of Things (IoT) computers and devices, which are embedded in equipment like iPads, appliances, digital recorders and WiFi routers.\nA special agent with the Defense Criminal Investigative Service wrote in an affidavit that “Rapper Bot forces infected devices to send large amounts of internet traffic to victim computers, a type of Internet crime termed ‘Distributed Denial of Service’ because the deluge of Internet traffic can effectively deny service, i.e. the ability to communicate with the Internet, for the duration of the DDoS attack.”\nThe botnet infected between 65,000 and 95,000 devices to regularly conduct high-tempo DDoS attacks — the largest of which may have exceeded six terabits per second. The criminal complaint noted that a DDoS attack averaging more than two terabits per second and lasting 30 seconds can cost a victim anywhere from $500 to $10,000.\nFoltz admitted to building and operating Rapper Bot for years — and sharing the profits with an accomplice he claimed to know only by the online handle “Slaykings” — when law enforcement officials served a search warrant at his Oregon residence on Aug. 6, according to officials.\nThe botnet allegedly conducted more than 370,000 attacks against 18,000 unique victims across 1,000 unique autonomous system numbers, from April to early August. A total of 80 nations were affected by Rapper Bot in that time period, and those DDoS assaults were most heavily concentrated in China, Japan, the United States, Ireland and Hong Kong.\n“There were at least three attacks during this time period against IP addresses managed by [DOD, or] against the DODIN,” the affidavit states. “Because Rapper Bot has been in operation since at least 2021, there is a strong likelihood that there are millions of victims, in terms of infected IoT devices, as well as millions of Rapper Bot initiated DDoS attacks.”\nThe two officials on the call with reporters Tuesday declined to provide a total number of IoT devices that got into or compromised U.S. government networks via Rapper Bot.\nHowever, they confirmed that there were no less than three attacks against IP addresses that are owned or operated by the DOD — such as those used for public affairs websites and other digital information resources.\n“I can’t go into detail on what those in particular were, for obvious reasons. But, it depends on who the customer is and what they’re targeting. Sometimes it’s just random. Sometimes it’s very specific, very targeted, and matching with other stuff that’s going on around the world. I can’t see what this was and what the pieces were — but in this case, it was not the defense industrial base I mentioned earlier,” an official told DefenseScoop. “This was, in fact, a DOD IP address or a series of them, but I can’t go into any further detail on that.”\nFoltz faces a maximum penalty of up to 10 years in prison if he’s convicted for the alleged cybercrimes.\nAccording to the affidavit, he told the special agent leading the investigation it would likely be difficult to determine the full scope of Rapper Bot’s reach, because the command and control was configured to wipe user and attack logs approximately once a week.\n“As an example of the effect attacks at this scale can have on different platforms, at least one large U.S. social media company had pronounced service outages in March 2025 that have been publicly associated with Rapper Bot,” the document stated.\nOn Tuesday’s call, officials said they “could not speak to” whether the sprawling botnet was responsible for the March 10, 2025, attack that caused intermittent outages on X — the social media platform owned by tech billionaire Elon Musk, who was playing a major part in the Trump administration’s disruptive Department of Government Efficiency (DOGE) initiatives at that time.\nTechnology companies, including Akamai, Amazon Web Services, Cloudflare, Digital Ocean, Flashpoint, Google, PayPal and Unit 221B, supplied a range of assistance and account records to support the government’s investigation into the criminal DDoS-for-hire campaign.\n“This is an extremely challenging threat space to address and effectively disrupt,” an official told reporters on the call."
    },
    {
      "url": "https://www.airandspaceforces.com/article/drone-hype-and-airpower-amnesia/",
      "text": "Cheap drones may be changing warfare, but the value of air superiority endures.\nThe proliferation of small unmanned aerial vehicles (UAVs) has shaken up the military world, fueling concern that UAVs could revolutionize airpower concepts and even negate the need for air superiority as a fundamental objective of airpower strategy. Dr. Kelly A. Grieco and Col. Maximillian K. Bremer’s “air littoral” concept—defining the airspace from the coordinating altitude to the Earth’s surface—argues that increasing numbers of UAVs and one-way attack “drones” have shifted the importance of air control to low altitudes, altering the doctrine of air superiority. Retired Army Lt. Gen. David Barno and Nora Bensahel assert that “drones” have displaced manned aircraft and are now threatening the U.S. Air Force’s relevance with “an almost-existential crisis.”\nThese perspectives all share another commonality: They suffer from a collective airpower amnesia acquired over a 30-year period in which American airpower reigned supreme against a series of nonpeer rivals. Absent the challenge of air-to-air combat and without the context to understand what could happen in a peer fight, these observers are overstating the impact of UAVs and misinterpreting their tactical role.\nThe biggest lesson from the Russia-Ukraine war is not how small UAVs are reshaping air warfare, but rather how they are reshaping ground combat.\nThe term “drone” lies at the heart of the problem. It is, at best, a lazy catchall, covering everything from an out-of-the-box commercial quadcopter to the YFQ-42 and YFQ-44 Collaborative Combat Aircraft autonomous fighters now under development for the U.S. Air Force. Lumping all these aircraft into a single, oversimplified category obscures their unique capabilities and fuels misguided hype.\nBreaking down UAVs into distinct groups based on weight, operating altitude, and speed as their defining characteristics can help clarify the diversity of this category of aircraft. Groups 1-3 represent small UAVs, which are the aerial weapons employed abundantly in the Russia-Ukraine conflict, causing some to shift airpower assumptions prematurely. These small UAVs frustrate ground operations and excel in reconnaissance, precision strike, and electronic warfare roles. But they do not challenge air superiority, which is defined as the degree of control of the air domain necessary to “enable successful execution of joint operations such as strategic attack, interdiction, and close air support (CAS),” according to Air Force doctrine. Small UAVs lack the capability and capacity to achieve such control because they do not possess the advanced air-to-air combat capability necessary to deny adversaries access to airspace. The fact is, the biggest lesson emerging from the Russia-Ukraine war is not how small UAVs are reshaping air warfare, but rather how they are reshaping ground combat. Neither side has been able to achieve air superiority over the other, resulting in an environment where small UAVs can wreak havoc on both infantry and armor.\nThe argument that UAVs have created a new domain between the ground and air known as the air littoral proposes an unnecessary redefinition of airspace management below the coordinating altitude (CA)—a combat-tested height that separates fixed-wing and rotary-wing operations. Small UAVs fit within existing doctrine, and air superiority’s fundamental principles remain unchanged. Coordination must begin between the air and ground components, adapting the CA to assign responsibility for targeting. This reinforces established airspace-management doctrine, preserving resources for securing air superiority against peer adversaries like China and Russia, whose advanced air defenses demand robust air control. As with past innovations, adapting to UAVs strengthens, rather than rewrites, the primacy of air superiority as a necessary goal in joint warfare.\nAssigning the Army to defend against enemy UAVs below the coordinating altitude and the Air Force to defend above it aligns with current tactics, technologies, and operational concepts. Though UAVs may be relatively new, their underlying operational characteristics are not. As retired Lt. Gen. David Deptula recently commented on the Aerospace Advantage Podcast from the Mitchell Institute of Aerospace Studies, “Drones are simply cruise missiles being used as a substitute for penetrating aircraft delivering PGMs.” Introducing new terms to replace existing ones with the same meaning undercuts a working system and risks confusion over solutions.\nSmall UAVs provide new capabilities that primarily affect ground operations. Deptula said small UAV’s “most effective use to date is in countering conventional infantry and armor engagements.” Additionally, counter-tactics, techniques, and procedures (TTPs), as well as emerging kinetic and directed-energy technologies, such as SHORAD (short-range air defense) and IRON BEAM, are rapidly diminishing their marginal impact on air operations. Claims of the revolutionary relevance of small UAVs in air operations are rash and simply unsupported by the reality of combat, as recently proven by Israel’s resounding, successful air campaign against Iran, which, lacking air superiority, has had to resort to ballistic missiles and cruise missiles. The U.S. is not doctrinally “woefully unprepared” to counter small UAVs operating below a coordinating altitude based on the past 30 years of successful air operations utilizing proven airspace management practices. Redefining this airspace as an air littoral is unnecessary and redundant. Instead, adapting and standardizing a UAV coordinating altitude for targeting responsibility will enhance efficiency in future operations.\nDrones: Evolutionary, Not Revolutionary\nRevolutionary technologies fundamentally reshape warfare by opening new domains and contesting control; evolutionary developments, however, merely enhance existing capabilities without altering core principles.\nWhen the Confederate submarine H.L. Hunley sank the USS Housatonic in 1864, it represented a revolutionary development that turned the undersea world into a new domain of warfare. Forever after, naval forces would have to operate in a new world where combat could take place both on the sea and beneath it. By World War II, submarines had become a significant difference-maker in warfare, disrupting shipping and diverting assets to develop anti-submarine technologies, such as sonar, ASW (antisubmarine warfare) aircraft, and depth charges, to counter their stealth advantages. This ultimately redefined naval strategy. Today, the balance of naval power increasingly hinges on the capabilities of submarines.\nThe advent of the airplane was likewise revolutionary, extending conflict into the vertical dimension and enabling the projection of combat power from the skies. Billy Mitchell envisioned that airplanes would end wars by overflying ground forces to strike cities and strategic industries, attacking the capacity to wage conventional wars. World War II confirmed airpower’s transformative role, though it hardly paved the way to end future wars. Counterair technologies, such as antiaircraft artillery (AAA), surface-to-air missiles, and radar, emerged as vital factors, and, according to airpower strategist Colin Gray, “war had been forever transformed.” Airplanes redefined military strategy, requiring dedicated air forces to secure air superiority.\nToday, a growing number of observers are ascribing similar characteristics to small unmanned aerial systems. Yet, unlike submarines or airplanes, which opened new domains of warfare, small UAVs are not so transformational. Deptula pointed out that these low-cost weapons are largely an extension of the ground domain, providing reconnaissance, precision strikes, and electronic warfare capabilities to ground warfighters without compromising air superiority. Furthermore, functioning like cruise missiles or precision-guided munitions, one-way UAVs rely on low-altitude flight, autonomous navigation, and precision targeting to evade radar cost-effectively. What is evident from conflicts like Ukraine’s is that these systems displace existing weapons, rather than offer domain-altering innovations.\nThis historical perspective clarifies why contemporary claims about “drones” reshaping air superiority are misguided. Assertions that “drones,” as witnessed in the Russia-Ukraine war or Iranian proxy wars, threaten the established doctrine of air superiority, misinterpret their impact and role. Barno and Bensahel’s claim of an Air Force “existential crisis,” where small UAVs supposedly “wrested command of the air from piloted aircraft,” collapses under scrutiny: Their cited Jordan strike was a cruise missile attack, not a drone wresting air superiority, according to Deptula. Their conflation exemplifies the amnesia that plagues the drone hype. UAVs are evolutionary tools that cost-effectively achieve similar effects to cruise missiles and long-range precision fires. Thus, as Deptula claims, “if there is any lesson to extract from the Russia-Ukraine war to date, it is the absolute necessity of air superiority.” This distinction reaffirms the Air Force’s enduring role in securing the skies.\nCountering UAVs\nBefore the mid-2000s, the U.S. Army had embedded SHORAD capability to defend maneuver forces against low-altitude threats. However, according to U.S. Army Air Defense Artillery Capt. Leopoldo Negrete, in the decades that followed, the lack of enemy fixed- or rotary-wing threats in Afghanistan and Iraq led the Army to prioritize point-defense air defense artillery (ADA), such as the Patriot, over SHORAD, thereby removing ADA coverage from maneuvering ground forces. Correctly, the Russia-Ukraine war and the emergence of small UAVs motivated the Army to reintroduce the Maneuver-SHORAD (M-SHORAD) capability, which includes a variant employing a laser called the Directed Energy (DE) M-SHORAD, according to Negrete. The reintroduction of M-SHORAD reestablishes doctrinally proven air defense relationships between the air and ground components to defend the airspace over maneuver forces, regardless of altitude, even while air superiority is achieved.\nOther counter-UAV technologies are rapidly emerging. The U.S. Army is working with Raytheon to field a fixed and mobile low, slow, small unmanned aerial vehicle integrated defense system (F/M-LIDS), equipped with a Coyote Block 2 SAM and two different machine guns capable of targeting UAVs. Israel’s Iron Beam anti-air defense laser could soon be operational, reducing the cost-per-shot compared to the kinetic Iron Dome, which costs $40,000 to $50,000 per shot, to $2-$3.50 per laser shot. The U.S. Marines fielded a hand-held Dronebuster system designed to jam the signals UAVs need to operate. As observed in the Russia-Ukraine conflict, UAV loss rates are high due to iterations of electronic attack capabilities, said Deptula. Even if adversaries scale small UAVs into mass swarms, advanced fighters, and networked defenses—like the F-22’s and F-35’s sensor fusion paired with air battle management—they retain the edge in denying air control, keeping superiority beyond “drones’” grasp. No example better illustrates this point than Iran’s launching of more than 170 “drones” and cruise missiles against Israel in early 2024, thwarted by manned U.S., Israeli, and Jordanian fighter aircraft aided by U.S. air battle management. Small UAVs’ psychological toll on ground forces—evident in Ukraine—amplifies their tactical bite, but this intimidation does not translate into air control.\nWhile small UAVs have altered the language of combat in the land domain, the U.S. Air Force does not need to\nredefine its doctrine, air superiority, or the pursuit of attaining it. Re-emerging is the codified doctrine for how the air and land components work together to achieve vital air defense for ground forces, allowing the USAF to focus on air superiority and prevent enemy air interdiction efforts in a near-peer fight. The seminal lesson from the Russia-Ukraine war is that freedom of maneuver is severely restricted without air superiority, and a decisive advantage cannot be achieved to meet military and political objectives without it.\nAdapting Doctrine: UAVs in Their Place\nAdaptation preserves primacy. To account for UAVs in a future conflict, airspace control plans should establish a coordinating altitude suitable for the area of operations to delineate targeting responsibilities between the ground component and the air component. The ground component, nominally through Army M-SHORAD or other ADA capabilities, should own responsibility for Group 1-3 UAVs—low, slow threats—coordinating with the air component commander for by-exception targeting. Group 4-5 UAVs, operating at higher altitudes, suit traditional interceptors (either fighters or surface-to-air missiles), which is why having the joint force air component commander dual-hatted as the area air defense commander is still an appropriate organizational construct. However, as recently demonstrated in operations defending Israel from air assault by Iranian cruise missiles, which are often mischaracterized as “drones,” fighter aircraft may be the only means to intercept these threats down to very low altitudes.\nThe airspace below the coordinating altitude has long been a contested area. AAA, man-portable air defenses (MANPADs), and mobile surface-to-air missiles create significant tactical problems for fighter aircraft. Additionally, the presence of rotary-wing aircraft at low altitudes requires airspace control measures, such as a coordinating altitude, that deconflicts fixed-wing and rotary-wing aircraft within an area of operations. Operating at low altitudes carries risks, and the need to deconflict fixed-wing and rotary-wing aircraft limits traditional fighters’ ability to counter UAVs. This has always presented a problem. Redefining the airspace below the coordinating altitude as the “air littoral” does not solve this problem.\nDrones and cruise missiles have not redefined air superiority in Ukraine, the Middle East, or elsewhere. On the contrary, small UAVs have proved necessary precisely because Russia, Ukraine, and Iran have been unable to attain air superiority. In the case of Ukraine, they do not have the aircraft necessary to achieve air superiority and have been denied authority by the U.S. to use long-range weapons to suppress Russian air defenses. Small UAVs alone have demonstrated no capacity to gain air superiority, even at low altitudes. Advanced aircraft such as the F-22 and F-35, and, in the future, the F-47 and collaborative combat aircraft (CCA), paired with air battle management platforms like the E-7 and Control and Reporting Centers, will be needed to conduct offensive counterair missions against advanced surface-to-air threats and enemy aircraft to attain air superiority and provide temporal freedom from effective enemy interference against friendly ground forces. In short, small UAVs thrive where air superiority is absent, not because they redefine it.\nTo stay ahead, combatant commanders must integrate counter-UAV technology, such as M-SHORAD, lasers, and jammers, into wargaming against peer threats, ensuring the viability of air superiority as it remains the linchpin of future victories. Avoiding the drone hype fallacy ensures resources are bolstered, not bypassed, by this framework. This requires prioritizing budgets for counter-UAV tech, advanced fighters, and air battle management capability to achieve air superiority. Advocating that the U.S. Air Force must pivot to a drone-heavy force based on suppositions derived from the Russia-Ukraine war, a conflict that does not reflect the capabilities or environment that the U.S. is likely facing in the future, is not only reckless but irresponsible.\nAir Superiority Unshaken\nThe Russia-Ukraine war and the Middle East conflicts highlight the tactical value of small UAVs, not a doctrinal crisis. An appropriate coordinating altitude for engagement aligns the roles of air and ground components to combat adversary UAVs effectively without overreacting. Over-focusing on low-altitude, small-payload, short-range drones diverts attention from advanced air forces and missile systems, which continue to pose genuine threats, especially after decades of counterinsurgency eroded high-end combat readiness. The current aim of the People’s Liberation Army Air Force (PLAAF) is “to serve as a comprehensive strategic air force capable of long-range airpower projection,” per the DOD’s 2024 annual report to Congress. The USAF must not abandon plans to recapitalize its combat air forces and air battle management capabilities to counter China. This will not happen by diverting money to saturate low-altitude airspace with drone swarms, as suggested by Grieco and Bremer.\nThe lack of recent air-to-air combat experience against medium-to high-altitude threats, shaped by 20 years of counterinsurgency operations in Iraq and Afghanistan, must not distract our military from prioritizing air superiority, which does not include quadcopters with hand grenades. Against a peer threat, pursuing air superiority in challenging threat environments requires strategic thinking, planning, and budgeting that drives requests; otherwise, the U.S. risks ceding the air domain advantage to its adversaries. Gen. Kenneth S. Wilsbach, Commander of Air Combat Command, summed up this imperative recently: “There’s been some talk in the public that the age of air superiority is over, and I categorically reject that.” Air superiority is “the first building block of any other military operation that you need to establish if you want to achieve objectives,” said Wilsbach.\nThe emergence of UAVs demands adaptation, not alarm. No time for airpower amnesia: Russia-Ukraine’s stalemate teaches us that the use of drones is evolutionary, not revolutionary. Doctrine endures—air superiority remains a prerequisite for success in major combat. Sustaining this edge requires budgets that prioritize advanced crewed airpower, supplemented with CCA and other UAVs as their capabilities evolve, rather than discarding validated doctrine learned over the past 100 years of airpower employment. That is the drone hype fallacy laid bare—tactics do not trump dominion. The low-cost, mass-deployable nature of small UAVs enhances ground operations and challenges infantry and armor, as seen in the conflicts in Ukraine and the Middle East, but it does not necessitate a change in the doctrine of air superiority. Commenting on comparisons between a potential invasion of Taiwan and Russia’s ongoing invasion of Ukraine, wherein some argue UAVs could thwart the People’s Republic of China’s aims, Adm. Samuel Paparo, Commander of U.S. Indo-Pacific Command, said, “Oh let’s just quit on everything. We’ve got some drones. All right, well, the PRC’s got 2,100 fighters, three aircraft carriers, and a battle force of over 200 destroyers.” The U.S. Air Force’s biggest problem is securing air superiority, not an alarmist doctrinal shift, which would almost certainly result in ceding the airpower advantage.\nThe U.S. Army must collaborate with industry to bolster defenses against UAV attacks, continue standing up M-SHORAD battalions, and refine systems like F/M-LIDS to protect bases and forces. Meanwhile, the U.S. Air Force must sustain investments in advanced crewed and uncrewed aircraft, including the F-47 next-generation air dominance (NGAD) penetrating counterair aircraft (PCA), the F-22, F-35, CCA, and air battle management platforms like the E-7 and Control and Reporting Centers to counter sophisticated adversaries—and maintain the air superiority vital to achieving national objectives. Far from signaling an existential crisis, small UAVs underscore a dual truth: Air superiority remains paramount, and coordinated air and ground component efforts, rooted in proven doctrine, are required to secure victory in future wars.\nLt. Col. Grant “SWAT” Georgulis, USAF, is a Master Air Battle Manager and currently assigned as the Deputy Chief of C2 Inspections as part of the Headquarters NORAD and NORTHCOM Inspector General team. He recently finished a yearlong Air Force National Defense Fellowship at The Mitchell Institute for Aerospace Studies. Lt. Col. Georgulis has served on a combatant command component staff, was an Air Force Weapons School instructor, and graduated from the Naval War College’s College of Naval Command and Staff and Air University’s School of Advanced Air and Space Studies. He previously commanded an E-3G Squadron, the 965 Airborne Air Control Squadron, at Tinker Air Force Base, Okla."
    },
    {
      "url": "https://www.washingtonexaminer.com/news/world/3761861/russia-ukraine-security-talks-road-to-nowhere/",
      "text": "A senior Russian official said talks about Ukraine’s security without Russia are a “road to nowhere,” raising a red flag on conversations happening among NATO allies on supporting Ukraine.\n“We cannot agree with the fact that it is now proposed to resolve collective security issues without the Russian Federation. This will not work,” Foreign Minister Sergey Lavrov said Wednesday during a press conference in Moscow.\n“And I am sure that in the West and above all in the United States they understand perfectly well that seriously discussing security issues without the Russian Federation is a utopia, a road to nowhere,” he added.\nWorld leaders are urgently working out the details of what a negotiated end of the Russia-Ukraine war could look like and how they can ensure Ukraine will never be invaded again. However, Russian officials have tamped down those expectations already. It is also not clear whether Russian President Vladimir Putin, who began the war and has had the ability to end it every day since then, is actually willing to do so.\nPresident Donald Trump and Putin met Friday in Anchorage, Alaska, to discuss the state of the conflict, and on Monday, Trump met with Ukrainian President Volodymyr Zelensky, the heads of Italy, Germany, France, the United Kingdom, and Finland, as well as the secretary general of NATO.\nRussia will “ensure its legitimate interests firmly and harshly,” Lavrov added.\nThe chiefs of defense of NATO countries met virtually on Wednesday. Adm. Giuseppe Cavo Dragone, the chairman of NATO’s Military Committee, hosted the meeting, while Gen. Alexus Grynkewich, the new Supreme Allied Commander Europe, made his first appearance at one after recently assuming the position.\nDragone said it was a “great, candid discussion,” and he added, “I thanked everyone for their always proactive participation in these meetings: we are united, and that unity was truly tangible today, as always.”\nChairman of the Joint Chiefs of Staff Dan Caine was also in attendance for the meeting, according to a U.S. defense official, who also told the Washington Examiner that Caine met with European leaders on Tuesday evening “to discuss best options for political leaders with respect to Ukraine peace negotiations.”\nZelensky has maintained that any agreement to end the war has to include guarantees from the West to deter Russia in the future from additional aggression.\nTrump ruled out putting U.S. troops on the ground in Ukraine as part of a larger peacekeeping force, though he left open the possibility of air support. NATO Secretary General Mark Rutte said 30 countries expressed an interest in helping with the security guarantees, including some outside of NATO, such as Australia and Japan.\nThe exact configuration of what such a peacekeeping force could look like remains unknown publicly.\n“We reiterate our repeatedly expressed position that we deny any scenarios that envisage the deployment of a military contingent to Ukraine with the participation of NATO states, which could lead to an uncontrollable escalation of the conflict with unpredictable consequences,” Russian Foreign Ministry spokeswoman Maria Zakharova said on Tuesday.\nRussian officials have said repeatedly that they would not accept NATO troops in Ukraine.\nBoth Trump and his special envoy, Steve Witkoff, have said Putin agreed to some security guarantees for Ukraine during the bilateral meeting in Alaska, though the messaging from the Kremlin appears to reject their comments.\nTrump also said the next step in ending the war would be a bilateral meeting between Zelensky and Putin, while French President Emmanuel Macron suggested such a conversation could occur in Geneva, Switzerland. The Swiss have expressed an openness to hosting it and said they would ask the International Criminal Court to exempt it from sanctions to allow Putin to travel to the country.\nThe Kremlin has not commented publicly about a possible Putin-Zelensky meeting, though Lavrov said Russia was open to meeting with more senior delegates than those involved in a recent but fruitless meeting between the two countries in Istanbul.\nWestern leaders have repeatedly accused Putin of dragging out negotiating efforts to end the war intentionally while simultaneously continuing Russian efforts along the front lines in eastern Ukraine and targeting cities far from there."
    },
    {
      "url": "https://www.washingtonexaminer.com/news/white-house/3760478/stephen-miller-stupid-white-hippies-union-station-vance-hegseth/",
      "text": "White House deputy chief of staff for policy Stephen Miller slammed the “stupid white hippies” protesting the National Guard’s presence in Washington, D.C., as he, Vice President JD Vance, and Defense Secretary Pete Hegseth thanked troops during a visit to Union Station.\nVance, Hegseth, and Miller made the trek to Union Station on Tuesday to show their support for National Guard members patrolling the streets of Washington amid President Donald Trump’s crime crackdown and takeover of the district’s police force.\nBut their presence at the station sparked a protest, with activists yelling, “Free D.C.!” Miller lambasted the shouting protesters as out-of-touch white hippies who don’t represent the district’s black population.\n“All these demonstrators that you’ve seen out here in recent days, all of these elderly white hippies, they’re not part of the city, and never have been,” Miller said before noting the district’s overwhelmingly black population. “This is not a city that has had any safety for its black citizens for generations, and President Trump is the one who is fixing that with the support of the Metropolitan Police Department, the support of the National Guard, and our federal law enforcement officers.”\nMiller continued, “So we’re going to ignore these stupid white hippies that all need to go home and take a nap because they’re all over 90 years old, and we’re going to get back to the business of protecting the American people and the citizens of Washington, D.C.”\nEchoing Miller’s criticisms against white protesters, Vance told the press: “It’s kind of bizarre that we have a bunch of old, primarily white people who are out there protesting the policies that keep people safe when they’ve never felt danger in their entire lives.”\nThe three men brought the National Guard members burgers from Shake Shack to thank them for their work.\n“You guys bust your ass all day and we give you hamburgers — not a fair trade, but we’re grateful for everything you do,” Vance said.\nAt times, comments from the men to the press were blocked out by the protesters heckling them and denouncing Trump’s unprecedented federalization of the district’s police force.\n“We don’t have to live like this. We do not have to allow our cities to be taken over by violence, ordered by chaos. You can actually do stuff,” Vance told reporters in defense of the Trump administration’s actions.\n“You can actually bring law and order to communities. You just gotta have the political willpower to do it,” Vance continued. “And I think you can hear these guys outside here, screaming at us. Of course, these are a bunch of crazy protesters.”\nThe vice president also claimed Union Station is a high-crime area that needed the National Guard’s presence.\n“You have vagrants, you have drug addicts, you have the chronically homeless. You have the mentally ill who harass, who threaten violence, who attack families, and they’ve done it for far too long,” Vance said. “This should be a monument to American greatness.”\nDespite polling showing that Washington residents are opposed to the military presence, Vance said he was “highly skeptical that a majority of D.C. residents don’t want their city … to have better public safety and more reasonable safety standards within Washington, D.C.”\nVance, however, punted on whether the administration would extend the 30-day takeover of Washington’s police force.\n“We’ll ultimately let the president of the United States determine where we are after 30 days of this emergency order,” Vance said when asked by a reporter. “I think that we’re going to make a lot of progress over the next 20 days. I think we’re nine days into this thing.”\nVANCE TO CAMPAIGN AGAINST OSSOFF IN THURSDAY TRIP TO GEORGIA\n“But if the president of the United States thinks that he has to extend his order to ensure that people have access to public safety, then that’s exactly what he’ll do,” he continued. “If he thinks he doesn’t have to do that, obviously he’ll make that determination.”\nAfter addressing reporters, Vance, Hegseth, and Miller had lunch at Shake Shack with the National Guard members."
    },
    {
      "url": "https://www.washingtonexaminer.com/news/world/3761643/israel-reservists-called-up-gaza-city-takeover-operation/",
      "text": "The Israeli government activated tens of thousands of reservists in its military ahead of a planned operation to take control of Gaza City.\nApproximately 60,000 reserve members of the Israel Defense Forces were called up. Additionally, about 20,000 soldiers who are currently serving had their term of service extended.\n“I instruct you to use all tools and all power to strike the enemy until it is subdued, and to protect IDF soldiers,” Defense Minister Israel Katz told Israeli military personnel on Wednesday.\nThe plan, referred to as operation “Gideon’s Chariots B,” is expected to give Israel functional control of almost the entire Gaza Strip.\nSuch a massive activation of soldiers is a bold political move for Israeli Prime Minister Benjamin Netanyahu and his Cabinet amid widespread protests calling for an end to the 22-month conflict.\nCritics of the Netanyahu government see the invasion of Gaza City as an unnecessary extension of hostilities and unproductive in recovering the remaining hostages.\nNetanyahu has emphasized his belief that no trace of Hamas should be allowed to survive. Gaza City is the last major stronghold where Hamas retains any military or political power.\nIsrael turned down the latest proposal for a ceasefire despite Hamas signaling approval of the plan.\nThat proposal would have established a 60-day cessation of hostilities and traded the release of 28 Israeli hostages, 10 of whom are alive and 18 of whom are dead, for an unidentified number of Palestinian prisoners.\nIsraeli intelligence believes 50 hostages remain in the hands of Hamas, but only 20 of them are believed to be alive.\nIsraeli Finance Minister Bezalel Smotrich dismissed Hamas’s ceasefire proposal, saying, “Stopping in the middle with a partial deal that abandons half of the hostages and that could lead to the suspension of the war in defeat.”\nIsraeli National Security Minister Itamar Ben-Gvir said Netanyahu doesn’t have a “mandate to go to a partial deal.”\nIsrael seems to have President Donald Trump’s blessing for the invasion of Gaza City, as Trump advocated the total destruction of Hamas on social media.\n“We will only see the return of the remaining hostages when Hamas is confronted and destroyed!!!” he wrote on Truth Social. “The sooner this takes place, the better the chances of success will be.”\nNETANYAHU’S RIGHT FLANK URGES NO DEAL ON LATEST HAMAS-APPROVED PROPOSAL\nAn estimated one million Palestinians are expected to be displaced by the operation.\nIsraeli officials said the military is making “humanitarian preparations” ahead of the invasion to care for such refugees."
    },
    {
      "url": "https://www.airandspaceforces.com/new-jersey-air-guard-cyber-jbmdl/",
      "text": "A new cyber squadron in the New Jersey Air National Guard will be based at Joint Base McGuire-Dix-Lakehurst, the latest development in a yearslong shift as the Air Force shifts Guard units away from missions that officials believe do not keep pace with modern warfare.\nThe 227th Cyber Operations Squadron officially activated April 1 but is not expected to reach full operational capability by spring 2030, the Air Force said in an Aug. 15 press release. The unit will be stationed at JBMDL. In May, the 227th Air Support Operations Squadron cased its colors at nearby Atlantic City Air National Guard Base. Its manpower slots will go to JBMDL to support the incoming cyber squadron.\nThe transition is part of the Air Force’s wider reduction of Tactical Air Control Party Airmen, who embed with ground troops to call in air strikes, supply drops, medevacs, and other forms of air support. In 2023, the Air Force said it would reduce the field of about 3,700 positions down to 2,130 over the next three years, a 44 percent drop.\nThe Air Force is also retiring the A-10 attack jet, which specializes in providing close air support missions for ground troops. In 2024, the service said the Maryland Air National Guard would trade its A-10s for a cybersecurity mission, a move which a Maryland Air Guard official said would make them “the only state in the nation that doesn’t fly.”\nBoth TACPs and A-10s played critical roles in the Global War on Terror, where they faced minimal enemy air defenses. Air Force officials predict that will not be the case in a conflict with rivals Russia or China, and they are trying to shed those platforms and capabilities to free up resources.\nSince its members can pursue civilian careers, the Air National Guard often positions itself as a reservoir of expertise in technical fields such as cyber.\n“We bring real-world perspective coming from industry,” Ken Flowers, chief technology officer with the National Guard Bureau, said in a December press release. “We can bring folks in that have dealt with artificial intelligence, machine learning, you know, quantum computing, in their day-to-day, and then come in here and they can apply it.”\nMost Air National Guard cyberspace squadrons stood up in the past 10 years or so, with new squadrons and facilities still in the pipeline. Recent developments include:\n- September 2023: Ohio stood up the 179th Cyberspace Wing, the first cyberspace wing in the Air National Guard, which had previously been a C-130-flying airlift wing.\n- December 2023: Virginia’s 185th Cyberspace Operations Squadron opens a brand new cyberspace facility at Joint Base Langley-Eustis, the 192nd Wing’s first purpose-built structure in 16 years.\n- August 2024: Tennessee activates the 228th Cyber Operations Group in a move meant to consolidate the state’s Air National Guard cyber programs"
    },
    {
      "url": "https://www.washingtonexaminer.com/politics/3762204/bishop-barron-praises-trump-desire-heaven/",
      "text": "EXCLUSIVE — President Donald Trump seems to be having a come-to-Jesus moment.\nThe president was speaking on Fox & Friends Tuesday morning about his efforts to secure peace in Ukraine when he suddenly offered an unprompted reflection on the fate of his immortal soul.\n“If I can save 7,000 people a week from being killed, I think that’s…” Trump told the hosts before trailing off. He continued, “I want to try and get to heaven, if possible. I’m hearing I’m not doing well. I am really at the bottom of the totem pole. But if I can get to heaven, this will be one of the reasons.”\nThe Washington Examiner contacted Bishop Robert Barron, prelate of the Diocese of Winona-Rochester and founder of Word on Fire, for his pastoral reaction to the president’s uncharacteristically existential remarks.\n“I was struck by his humility, admitting that he is at the bottom of the totem pole. That’s a good spiritual attitude to have before God,” Barron said, describing his immediate reaction to Trump’s comments. “Secondly, I was impressed by his motivation. Beyond wealth, power, and pleasure, he was seeking union with God.”\nThe bishop pointed to the president’s brush with death last year in Butler, Pennsylvania, as a possible impetus for a serious interrogation of his own soul.\n“I do think that the assassination attempt last summer affected a change in the president,” Barron said. “It convinced him that he was spared for a purpose, and therefore it opened him to accepting the ways of God’s providence. It also clarified his moral aim and brought into sharper relief the misdeeds of his past.”\nWhile far from an evangelist, Trump’s public statements following the attempt on his life have at times invoked strikingly religious rhetoric.\n“It remains my firm conviction that God alone saved me that day for a righteous purpose: to restore our beloved Republic to greatness and to rescue our Nation from those who seek its ruin,” the president said in an address last month commemorating the Butler incident.\nBut even in such contexts, Trump has always struck a triumphant tone. He has rarely implied a sense of insecurity about his morals or spiritual well-being.\nWhile the president’s comments weren’t exactly an intellectual treatise on the nature of salvation, his choice of phrase is telling about his understanding of God and the afterlife.\nBarron told the Washington Examiner that he believes the president was gesturing toward a conception of heaven in line with orthodox Christian belief.\n“I think he correctly sees heaven as a place of radical love, which is why he correlates it to the achievement of loving acts here below,” Barron said. “St. Thomas Aquinas said that in heaven, faith will fade away (for we will see God in the face) and hope will fade away (for we will have achieved what we have longed for), but love will remain, for love is what heaven is.”\nTrump was raised as a Presbyterian, the religion of his Scottish mother. He identified with the denomination for most of his life, including during his first term as president.\nHowever, Trump told Religion News Service in 2020, “Though I was confirmed at a Presbyterian church as a child, I now consider myself to be a non-denominational Christian.”\nBarron, along with other religious clergy, offered a benediction for Trump at the 2025 National Day of Prayer. He is also one of the faith leaders appointed by the White House to serve on its Religious Liberty Commission.\nHe has frequently sat down with politicians on both sides of the aisle to advocate the Catholic position on issues from abortion to immigration, but stresses that clergy cannot become absorbed into parties or campaigns.\n“The thing we can’t do, and we don’t do, is partisan politics,” he told Fox News Digital last year. “We can’t get in the business of saying, ‘OK, don’t vote for him, vote for this guy.’ Bishops don’t do that and priests shouldn’t do that.”\nTRADITIONALIST CATHOLIC SOCIETY APPROVED FOR VATICAN PILGRIMAGE DESPITE CANONICAL IRREGULARITY\nWhen asked what advice he would give Trump if the president was indeed concerned about the prospect of the final judgment, Barron said humility is an important virtue to maintain.\n“I would urge the president to maintain his attitude of humility before God, to open himself to God’s grace through prayer, and to allow his love for God to express itself in acts of love toward his neighbor,” he told the Washington Examiner."
    },
    {
      "url": "https://www.airandspaceforces.com/air-force-academy-majors-intact-faculty-cuts/",
      "text": "The U.S. Air Force Academy said this week it continues to offer all of its majors amid a rash of departures by civilian staff spurred by cuts to the federal workforce.\nTwenty-five faculty members—about 5 percent of the school’s total—have left so far this year, including those who opted into the federal Deferred Resignation Program, retired, or were not renewed for another term, the school said in a release.\nNearly 10 percent of the academy’s 1,500 or so civilian jobs were identified for elimination in 2025, the school said. Of those 140 positions set to be defunded, 36 were filled while 104 were vacant.\nThe cuts hit every part of the four-year university and have slowed some operations as that workload falls on the remaining uniformed and civilian staff—an impact felt across the Defense Department and the federal government at large as the workforce contracts.\nEleven of the 36 civilian staffers whose jobs are on the chopping block have been reassigned to “higher-priority” roles, USAFA said. The remaining 25 are awaiting new jobs. It’s unclear whether those employees are concentrated in a particular area of study or operations.\n“The goal is to continually work over the coming months to see how we can move teammates laterally into open billets, either at the Academy or other locations, to keep their expertise within the broader Air Force and Space Force enterprise,” Superintendent Lt. Gen. Tony D. Bauernfeind said in the release.\nThe Trump administration introduced the Deferred Resignation Program in January to entice federal workers to voluntarily quit rather than face the prospect of layoffs. Those who opted into the program are paid not to work through the end of the fiscal year on Sept. 30 or through the end of the calendar year, depending on when they accepted the offer.\n“We recognize that uncertainty can be challenging for our civilian employees, and by communicating early and often about the options available to them, we hope to help them navigate this change and find new opportunities, whether within our institution or beyond,” Kathryn Russel, the school’s director of manpower, personnel, and officer accessions, said in the release.\nThe Department of the Air Force said in April it sought to offload as much as 8 percent of its civilian workers across the Air Force and Space Force. Its fiscal 2026 budget request projects the civilian staff will shrink by 7.7 percent, from 124,600 workers in 2025 to about 115,000 next year.\nThe department “supports a large portion of the workforce participating in these programs while ensuring the Air Force and Space Force maintain operational readiness and the ability to perform mission-essential functions,” it said in an April 4 memo.\nThe academy has downplayed the impact of civilian cuts to its academic program, noting it routinely revises its course catalog as faculty rotate through over the years. To offset the loss of civilian staff, USAFA said it has added 19 military personnel to its faculty who “bring valuable operational experience to the classroom.”\nMost of the academy’s nearly 550 faculty members are Air Force officers, according to the service.\nAbout 4,000 cadets attend USAFA each year on their way to becoming officers in the Air Force, Space Force, and other branches of the U.S. and foreign militaries. Most major in science and engineering; other popular tracks include management and foreign area studies. The academy downsized from 27 to 26 majors as it consolidated electrical and computer engineering into one program at the beginning of the 2024-2025 school year.\nBauernfeind said the school will continue to offer the majors it promised through the end of the current academic year.\n“We are maintaining the academic rigor, accreditation, and high standards expected at the U.S. Air Force Academy,” Bauernfeind said. “Our faculty and staff are providing a world-class education to our cadets, and our institution will continue to produce officers ready to meet the challenges of a rapidly evolving security environment.”"
    },
    {
      "url": "https://www.brookings.edu/events/replicator-and-beyond-the-future-of-drone-warfare/",
      "text": "This event has reached capacity and in-person registration is now closed. Sign up to watch online instead »\nTwo years ago, the Department of Defense launched the first phase of the Replicator initiative, known as Replicator-1, with an ambitious goal: to rapidly field attritable, autonomous systems across multiple domains by August 2025. The aim was to deliver these capabilities to warfighters at speed and scale, while also driving broader improvements to the defense acquisition process. Now that we’ve reached the target date, did Replicator-1 meet its objectives?\nAs the initiative evolves, new questions emerge: What has been fielded so far in terms of offensive and defensive drones across maritime, land, and air domains? How are lessons from Replicator-1 informing Replicator-2, which focuses on counter-drone capabilities? What battlefield insights from Ukraine apply to U.S. operational needs—and which do not? And more broadly, how will drone warfare shape the future of conflict?\nOn August 21, join Brookings for an analytical discussion on the Replicator initiative and the evolving role of robotics in modern warfare. Online viewers can submit questions via e-mail to [email protected].\nAgenda\n-\nAugust 21\n-\nDiscussion\nGen. David H. Berger Former Commandant - U.S. Marine CorpsModerator\nMichael E. O’Hanlon Director of Research - Foreign Policy, Director - Strobe Talbott Center for Security, Strategy, and Technology, Co-Director - Africa Security Initiative, Senior Fellow - Foreign Policy, Strobe Talbott Center for Security, Strategy, and Technology, Philip H. Knight Chair in Defense and Strategy @MichaelEOHanlon\n-"
    },
    {
      "url": "https://apnews.com/article/uganda-us-deportation-migrants-immigration-crackdown-trump-15edfb4d80677c51c56beb8ab5130cd4",
      "text": "Uganda agrees to a deal with the US to take deported migrants if they don’t have criminal records\nKAMPALA, Uganda (AP) — Uganda has agreed a deal with the United States to take deported migrants on condition that the deportees should not have criminal records and not be unaccompanied minors, officials said Thursday.\nThe Ugandan foreign affairs ministry in a statement said the “two parties are working out the detailed modalities on how the agreement shall be implemented.”\nUganda also expressed a preference that those brought into the country should be of African nationalities.\nIt was not clear if the agreement had been signed but the ministry statement said it had been “concluded.”\nInternational Relations Minister Henry Okello Oryem told The Associated Press that while Uganda is known globally for its benevolent refugee policy, there are limits.\nAnd he questioned why the country would take people rejected by their own countries.\n“We are talking about cartels: people who are unwanted in their own countries. How can we integrate them into local communities in Uganda?” he asked.\nHe said the government was in discussions about “visas, tariffs, sanctions, and related issues, not accepting illegal aliens from the U.S. That would be unfair to Ugandans.”\nIn July, the U.S. deported five men with criminal backgrounds to the southern African kingdom of Eswatini and sent eight more to South Sudan."
    },
    {
      "url": "https://www.washingtonexaminer.com/news/white-house/3763396/gabbard-plan-cut-odni-roles-partisan-priorities/",
      "text": "Director of National Intelligence Tulsi Gabbard announced on Wednesday plans to cut her “bloated” department’s workforce by over 40% by the end of September, billing the effort as an initiative to save taxpayers over $700 million annually.\nAfter the reorganization wraps up at the end of fiscal 2025, the Office of the Director of National Intelligence will have around 1,300 staffers, down from the roughly 1,800 employed by the agency at the start of Gabbard’s tenure under the Trump administration.\nGabbard argued this week that the latest workforce reduction effort was needed to help the country’s premier intelligence department to “refocus on executing its core national security mission with integrity in the most agile, effective, and efficient way.”\n“Over the last 20 years, ODNI has become bloated and inefficient, and the intelligence community is rife with abuse of power, unauthorized leaks of classified intelligence, and politicized weaponization of intelligence,” she said in a statement.\nODNI and the intelligence community must make “serious changes to fulfill its responsibility to the American people and the United States Constitution by focusing on our core mission: find the truth and provide objective, unbiased, timely intelligence to the President and policymakers,” she added.\nODNI’s External Research Council and Strategic Futures Group will be cut entirely because they “operated as hubs for injecting partisan priorities into intelligence projects,” Gabbard said, according to Axios. Three other offices will be shut down and their staffers transferred to different departments because of concerns about redundancies, with the New York Post reporting that the Foreign Malign Influence Center, National Counterproliferation and Biosecurity Center, and the Cyber Threat Intelligence Integration Center will be taken up either by ODNI’s Mission Integration office or the National Intelligence Council.\nGabbard reportedly briefed Trump, White House chief of staff Susie Wiles, and Secretary of State Marco Rubio, who is also operating as the country’s national security adviser, about the planned force reduction two weeks ago.\nThe ODNI chief’s latest moves to reform her “politicized” department come after she, earlier this week, cut the security clearances of 37 current and former intelligence officials accused of having “abused the public trust,” including several involved in a 2017 federal report concluding Trump collaborated with Russia to help him defeat Hillary Clinton.\n“Being entrusted with a security clearance is a privilege, not a right,” Gabbard said. “Those in the Intelligence Community who betray their oath to the Constitution and put their own interests ahead of the interests of the American people have broken the sacred trust they promised to uphold.”\nGABBARD DOUBTS ‘OFFICIAL LINE’ ON NEW JERSEY DRONES: ‘STILL HAVE A LOT OF QUESTIONS’\nHer statement came amid an effort to put various Obama-era officials suspected of targeting Trump with investigations to hinder his hopes of winning the presidency under a microscope.\nLast month, Gabbard submitted multiple criminal referrals to the Justice Department probing former President Barack Obama, former CIA Director John Brennan, and ex-Director of National Intelligence James Clapper over concerns they illegally conspired to fabricate links between Trump and the Russian government."
    },
    {
      "url": "https://www.washingtonexaminer.com/news/world/3762715/poland-accuses-russia-provocation-drone-crash-border/",
      "text": "Poland on Wednesday accused Russia of provoking it after a Russian drone crashed in the eastern part of the country.\nPolish Defense Minister Władysław Kosiniak-Kamysz lamented the crash, which happened around 2 a.m. on Wednesday near the Polish village of Osiny. The explosion broke windows in some nearby houses, but no injuries were reported.\n“Russia is provoking us once again,” Kosiniak-Kamysz said at a news conference in Warsaw, as peace talks gave hope that the war in Ukraine “has a chance of ending.”\nThe crash comes after Russian President Vladimir Putin and President Donald Trump spoke in Alaska about peace in Ukraine. This week, Trump also held a summit with European leaders and Ukrainian President Volodymyr Zelensky on the same topic.\nNo violations of Polish airspace from Ukraine or Belarus were recorded on Wednesday, according to Poland’s Armed Forces Operational Command.\nKosiniak-Kamysz believes Russia will not admit to the crash.\n“I’ll say one thing that is certain: Russia will never admit to this. Just as it hasn’t admitted to any of the eight incidents in Moldova, three incidents in Romania, three in Lithuania, two in Latvia, or the one drone incident in Bulgaria,” he said.\nPolish Gen. Dariusz Malinowski, Armed Forces Operational Command deputy commander, said it’s unclear whether the crash was an intentional intrusion of Polish airspace or if the drone malfunctioned while targeting Ukraine.\nPolish Foreign Ministry spokesman Paweł Wroński confirmed that the country will send a diplomatic protest note to Russia in response to the crash. Wroński said the situation reminded Poland that it is also directly affected by the war in Ukraine.\n“And so here we have visible proof that Poland’s airspace is also endangered by this war, that something could happen, something could explode, it is unsafe, people could die, and the security of an allied state of the North Atlantic Alliance is at risk,” he said.\nTrump hopes to continue peace talks with Russia, including with a trilateral summit between himself, Zelensky, and Putin.\nRUSSIA SAYS TALKS ABOUT UKRAINE’S SECURITY WITHOUT IT ARE A ‘ROAD TO NOWHERE’\nOne of the largest obstacles to peace has been possible Ukrainian land concessions. Zelensky has resisted such moves in the past and said he will not “gift” land to Russia.\n“Ukrainians will not gift their land to the occupier,” Zelensky said."
    },
    {
      "url": "https://www.washingtonexaminer.com/policy/defense/3762526/pentagon-criticizes-report-about-pete-hegseth-security-detail/",
      "text": "The Pentagon has accused a news outlet of endangering Defense Secretary Pete Hegseth for reporting on information surrounding his protection detail.\nThe Army’s Criminal Investigation Division (CID) is the agency responsible for security for top Pentagon officials, and the secretary’s unusually large security detail has put a strain on CID, according to the Washington Post.\nIn addition to providing security for senior DoD officials, CID’s primary mission is to investigate crimes within the Army.\nCID has been forced to pull agents off investigations to bolster the protection details for Hegseth’s family, including for his second, now ex-wife, in Minnesota, Tennessee, and Washington, D.C. The agency has also activated military reservists to fill in some of the staffing shortages.\nPreviously, about 150 of CID’s roughly 1,500 agents, or 10%, work on protective duty. That number has increased about threefold since Hegseth started at the Pentagon in January, according to the Post.\nSeveral DoD officials criticized the report, claiming it endangers the secretary. The Post said it left out sensitive details.\n“Any action pertaining to the security of Secretary Hegseth and his family has been in response to the threat environment and at the full recommendation the Army Criminal Investigation Division (CID),” Chief Pentagon spokesman Sean Parnell said.\nSTEPHEN MILLER BLASTS ‘STUPID WHITE HIPPIES’ DURING UNION STATION VISIT WITH VANCE AND HEGSETH\nJacob Bliss, an assistant press secretary for the Pentagon, called the outlet “scum,” while acting deputy press secretary Joel Valdez said the reporters should face “severe punishment.” Kingsley Wilson, the Pentagon press secretary, claimed the Washington Post “is actively putting him and his family in danger for clicks,” and called the journalists “disgusting.”\nCID did not respond to a request for comment.\nThe agency told the outlet it “operates within existing resource constraints” and said it “proactively adjusts its efforts to address emerging threats and maintains a robust security posture in both the investigative and protective realms.”\nThe rise in politically motivated violence has also contributed to the need for a larger detail.\nTHE TRUMP SECURITY RECRUITMENT SURGE\nThe agencies tasked with the protection of government officials, which also includes the U.S. Marshals Service and U.S. Secret Service, have faced overwhelming scrutiny over the last year following the attempted assassination of President Donald Trump and the planned attempt that was stopped.\n“In the wake of two assassination attempts against President Trump, ICE agents facing a 1000% increase in assaults, and repeated threats of retaliation from Iran for striking their nuclear capabilities, it’s astonishing that the Washington Post is criticizing a high-ranking Cabinet official for receiving appropriate security protection,” Parnell added.\nThe Trump administration has stripped the federal security detail for a number of former officials, including former Defense Secretary Mark Esper and former Chairman of the Joint Chiefs of Staff Gen. Mark Milley, who were nominated to their most senior positions during Trump’s first term but are no longer on good terms with the president."
    },
    {
      "url": "https://www.washingtonexaminer.com/news/white-house/3762153/white-house-tiktok-account-launch-third-extension-deadline-approaches/",
      "text": "The White House launched a TikTok account on Tuesday, less than one month before the deadline to ban the app.\nThe new account has several videos prominently featuring President Donald Trump, including montages of the president from previous rallies. Trump controversially launched a 2024 campaign TikTok account, but didn’t join following his November victory.\nThe first video on the account is captioned, “America we are BACK! What’s up TikTok?”\n“Every day, I wake up determined to deliver a better life for the people all across this nation. I am your voice,” Trump says in a voice-over in one video.\n“MUST FOLLOW ON TIKTOK,” the White House’s Rapid Response account said in a post on X.\nWhite House spokeswoman Karoline Leavitt justified the decision by saying that the account was intended to communicate Trump’s accomplishments.\n“The Trump administration is committed to communicating the historic successes President Trump has delivered to the American people with as many audiences and platforms as possible,” she said.\n“President Trump’s message dominated TikTok during his presidential campaign, and we’re excited to build upon those successes and communicate in a way no other administration has before,” Leavitt added.\nAfter trying to ban TikTok in 2020, Trump changed his tune after his campaign saw the app’s ability to reach young voters. On his first day in office, Trump signed an executive order instructing the Department of Justice not to enforce the TikTok ban after it briefly went into effect. The first extension was in place for 75 days to buy time for more negotiations to find a new buyer, followed by another 75-day extension in April. On June 19, Trump signed another extension for 90 days. The current deadline is Sept. 17.\nUnder the law, Chinese company ByteDance must sell TikTok to a U.S.-based buyer if it wishes to continue operating in the United States.\nIn a June interview with Sunday Morning Futures with Maria Bartiromo, Trump mentioned as an aside, while discussing broader trade deals, that he had finally found a buyer for TikTok. When asked who, Trump replied that he would reveal the buyer “in about two weeks.”\n“I think I’ll need … probably China’s approval, and I think President Xi will probably do it,” Trump said.\n“Very, very wealthy people, it’s a group of very wealthy people,” he added before changing the subject.\nTRUMP EXPANDS TIKTOK BAN DEADLINE FOR A THIRD TIME\nHowever, the deal apparently fell through, as two weeks passed without mention of a new buyer.\nTrump’s repeated deadline extensions have frustrated congressional Republicans, who are worried about the app’s national security implications."
    },
    {
      "url": "https://transcripts.cnn.com/show/cnc/date/2025-08-20/segment/11",
      "text": "Return to Transcripts main page\nCNN News Central\nState of Emergency Declared in North Carolina as East Coast Braces for Hurricane Erin; Erin is a 110 MPH Cat 2 Hurricane and is Strengthening; Clashes Over Congressional Maps Reaching Fever Pitch in TX & CA; TX House Reconvenes, Moves Closer to Passing Redistricting Bill; Ukraine: 5 Civilians Killed in Russian Overnight Attack; White House, Kremlin Give Mixed Signals on Putin-Zelensky Meeting; Goods Containing Steel, Aluminum Could Get More Expensive Aired 3-3:30p ET\nAired August 20, 2025 - 15:00 ET\nTHIS IS A RUSH TRANSCRIPT. THIS COPY MAY NOT BE IN ITS FINAL FORM AND MAY BE UPDATED.\n(COMMERCIAL BREAK)\n[15:00:52]\nBORIS SANCHEZ, CNN HOST: North Carolina right now under a state of emergency with evacuations ordered in parts of the Outer Banks as Hurricane Erin tracks along the East Coast. The unusually large storm expected to strengthen to a Category 3 later today.\nBRIANNA KEILAR, CNN HOST: And Republican lawmakers in Texas locking the statehouse door and promising to keep legislators there until their newly drawn congressional map gets passed. Democrats can protest but they can't do much more to stop the process.\nAnd a near-death experience for these two influencers just as they were filming a food review at a Houston restaurant. They will join us live after suffering injuries in that.\nWe're following these major developing stories and many more all coming in right here to CNN NEWS CENTRAL.\nSANCHEZ: We begin with breaking news. Hurricane Erin stirring up nearly 30-foot waves in the Atlantic as the storm continues to climb up the East Coast. Erin remains a Category 2 hurricane with winds tracking at nearly a hundred and ten miles an hour. But forecasters do expect the storm to intensify in the coming hours.\nNorth Carolina is under a state of emergency right now. First responders are preparing for the worst expecting some roads to become impassable because of coastal flooding. Officials are urging some areas of the Outer Banks to get out now before it's too late. CNN's Dianne Gallagher is on the scene for us. Diane, are people heeding warnings from officials?\nDIANNE GALLAGHER, CNN NATIONAL CORRESPONDENT: You know, Boris, I was going to tell you yes up until about three seconds ago when you're now seeing the people here on the beach lifeguards and such going and getting people out of the ocean. Honestly, this is the first time today and even parts of yesterday that I've seen people try to swim in these waters. We have talked about just how fierce these rip currents are. I have not seen anybody with the exception of surfers who are allowed to be in the ocean right now although the waves are pretty choppy it's not great surf, but they're the only ones allowed to be in.\nSo, this is the first time I've seen swimmers -- they're asking people not to get in the ocean because of those dangerous rip currents. We're also seeing -- look you can see it's starting to get a little spicy out there, starting to get a little choppy again and we have high tide coming in at about three hours and that's when we expect things to really start to go south here in the Outer Banks. We're in Nags Head. There was not a mandatory evacuation of this part of the Outer Banks. It's a little further south in Ocracoke and Hatteras Islands.\nThose people for the most part especially the visitors have been leaving according to the governor of North Carolina Josh Stein. More than -- around 2,300 individuals have evacuated Ocracoke Island on that ferry already. Ferry service is going to be suspended temporarily today starting at 5:30 just before that high tide comes in.\nSo, once people are there, if they haven't gotten off the island yet, they're probably stuck there and the big concern we've talked about this for a couple days now is those big waves the storm surge potentially washing out or damaging North Carolina Highway 12. It is a road that runs through the Outer Banks. They are not able to get on or off these islands if they cannot get past that road, so you're stuck there at that point.\nAgain, right now you see people enjoying the beach. It's a nice day right now as long as you're not getting in the water. That'll probably change in a few hours.\nSANCHEZ: Yes, a good idea to enjoy the beach just from the sand today.\nDianne Gallagher, thank you so much for that update.\nLet's go to meteorologist Derek Van Dam now.\nDerek, when are we expecting to see the worst from Erin?\nDEREK VAN DAM, CNN METEOROLOGIST: Well, conditions will go down from this evening's high tide at 6 P.M. through the overnight hours and into the day tomorrow. I mean, this satellite loop is jaw-dropping, to see this expansive of a hurricane just parking itself off the southeast coast of the U.S. is -- it just brings back a lot of memories, right?\n[15:05:07]\nThink about Hurricane Sandy. The fortunate part about this is that it's going to stay offshore at least the worst part of this storm. We do know, though, that impacts will be felt all along the coastline. That's why we have these tropical storm warnings in place for North Carolina into Virginia, coastal areas of the Delmarva Peninsula, stretching northward all the way into South Carolina.\nSo, Atlantic City to Virginia Beach, Cape Hatteras, these areas anticipating getting the outer rain bands overnight tonight and into Thursday morning of this expanding storm system. It is ballooning in size, still a Category 2, but we're just shy of that major category status and it is really getting its act together. Of course, the core of the strongest winds remaining offshore. We're kicking it between the uprights here, between Bermuda and the eastern seaboard, but with the expanding wind field we're going to push up a lot of water from the Atlantic Ocean, so let's time this out for you.\nHatteras this evening and into the early morning hours, that's when we expect the tropical storm force winds. Atlantic City by Thursday afternoon and then just don't forget about Nantucket and the outer reaches of Massachusetts could experience some tropical storm force winds late Thursday into Friday. Check out these wave heights, Boris, this is not something we want to mess around with.\nSANCHEZ: Derek Van Dam, thank you so much for that. Brianna?\nKEILAR: Now to the redistricting fights in Texas and California, lawmakers in both states escalating their battles today with Texas Republicans now barreling towards a vote on their GOP friendly congressional map. It's a map that could add five Republican House seats in Congress. Democrats are still trying to delay matters today, but options and time are running out. And that is where California comes in, Democrats who control the legislature there are taking action to counter Texas' plans if they go through.\nFirst, let's go to Texas and CNN's Arlette Saenz.\nArlette, what's happening this hour?\nARLETTE SAENZ, CNN CORRESPONDENT: Well, Brianna, Texas House lawmakers are on hour four of their debate over this redistricting bill. Once that debate and amendment process is complete, they could proceed to the first vote on these new congressional maps. But some of the timing there still remains in flux.\nNow, Democrats have exhausted all of their legislative options to block this bill from moving forward. Instead, what they're doing on the House floor now is introducing some of the legal arguments that they will be able to make when they begin to file lawsuits against these maps in courts in the coming weeks and months.\nBut there has also been quite a few moments of frustration between both Democrats and Republicans. Here was one moment where Republican Representative Todd Hunter expressed his frustration with Democrats who had decided to leave the state for two weeks and prevent them from considering this in the first special session.\n(BEGIN VIDEO CLIP)\nREP. TODD HUNTER (R-TX): Hold it, let me finish. You want to be fair, let me finish. You opened up the questions. You own the walkout. You said you did that, but don't come into this body and say we didn't include you. You left us for 18 days and that's wrong.\n(END VIDEO CLIP) SAENZ: Now, right now it's not a matter of if but when these GOP maps will pass. First, it will need to make its way out of the House before going into the Senate. And then, once it's approved in that chamber, the Texas governor can sign it into law.\nKEILAR: Arlette, thank you so much.\nLet's bring in Steve Contorno now who is in Sacramento for the latest on the battle in California.\nAnd Steve, Governor Gavin Newsom just spoke out again. Tell us what he's saying.\nSTEVE CONTORNO, CNN REPORTER: Yes, Brianna. Governor Newsom just moments ago making clear that California Democrats did not start this fight but they will be responding in kind saying, quote, \"They are putting a stake in the ground and we're going to punch this bully in the mouth,\" take a listen.\n(BEGIN VIDEO CLIP)\nGOV. GAVIN NEWSOM (D) CALIFORNIA: Yes, we'll fight fire with fire. Yes, we will push back. It's not about whether we play hardball anymore, it's about how we play hardball.\n(END VIDEO CLIP)\nCONTORNO: Now, for Newsom, this is not just rhetoric around what's happening right now in the California legislature, this is also the pitch that he will be making to voters unlike in Texas where Republicans can just change the map mid-decade if they're -- using their majority. In California, there is a constitutionally mandated independent redistricting commission that Democrats are trying to get around this week and they will have to ultimately ask voters in November to override this constitutional commission and instead put in these maps that would give Democrats a five-seat advantage going into next year's midterm election.\n[15:10:05]\nSo, when you're hearing Newsom talk about Donald Trump, they very much want to make the President the center point and the focus of their campaign to try to get 50 percent of voters in support of their plan. Now, the action this week in Sacramento is moving quickly we saw the legislation introduced on Monday. They have been quickly heard in committees yesterday and today and we expect final passage as early as tomorrow.\nA lot of the debate today focused on the cost of a statewide election which one bill analysis said will be several hundred million dollars, Republicans saying that is way too much to force on California taxpayers, Democrats saying this is a price worth paying.\nKEILAR: Steve Contorno live for us in Sacramento, thank you.\nAnd still to come, Russia launching a new round of strikes on Ukraine as the White House insists plans are underway for a meeting between Presidents Vladimir Putin and Volodymyr Zelenskyy.\nPlus, hundreds of products just got more expensive to import into the U.S. now that President Trump's tariff on steel and aluminum has kicked in.\nAnd then later, we will talk with those two food influencers here. They were filming at a restaurant when that vehicle smashed through the window and right into their table. We'll have that and much more coming up on CNN NEWS CENTRAL.\n(COMMERCIAL BREAK)\n[15:15:48]\nKEILAR: President Trump says that he's trying to arrange a meeting between Russia's Vladimir Putin and Ukraine's Volodymyr Zelenskyy. But today, the Kremlin is again downplaying the prospect of a face-to-face between the two leaders. The White House has said that plans are underway for a meeting, but Russia's top diplomat is indicating that Putin has not agreed, saying instead that Putin supports sending more high-level officials to talks with Ukraine.\nThe back and forth comes as Ukrainian officials say at least five civilians were killed after a new round of Russian strikes overnight. We have Leon Panetta with us now. He served as Defense Secretary and CIA Director under President Obama.\nMr. Secretary, how do you read this? Because already we've seen these high-level officials talking ahead of these principal leader summits, so what do you take that to mean what you're hearing from the Kremlin?\nLEON PANETTA, WHITE HOUSE CHIEF OF STAFF, CLINTON ADMINISTRATION: Well, there's been a lot of motion in these last number of days with the summit in Alaska and then the summit in Washington. And a number of people have been talking some past each other.\nBut I'm worried that in terms of real progress, the ability to actually come together and resolve some of the issues that you have to resolve, that we're not making much headway. And part of the problem frankly is the lack of a ceasefire. If Russia can continue to blow the hell out of Ukraine and still pretend that they're serious about somehow negotiating, that's just a non-starter and it undermines the ability frankly for any of the parties to establish any kind of trust that party is truly willing to try to negotiate for peace.\nKEILAR: President Trump backed off of his demand for a ceasefire coming out of the Alaska meeting, but he's getting a lot of pressure from European leaders. I wonder if you think he's getting enough pressure and what it would take for him to get Russia to a ceasefire?\nPANETTA: The President by now he ought to have a pretty good understanding of Putin. And the reality is Putin cannot be trusted, and Putin made very clear particularly in Alaska that unless the root causes of this war are eliminated that Russia is not coming to the table. Well, the root causes of the war are the fact that Russia invaded Ukraine because it does not believe Ukraine is a separate country from Russia, period.\nSo, if that's where Putin's coming from that he basically wants to win this war, I think the most important thing for president Trump if he really wants to advance some kind of progress here is to make very clear to Vladimir Putin that he will not win this war, he will not win this war under any circumstances.\nAnd if that means that the President has to ultimately implement sanctions and continue to provide weapons to the Ukrainians, I frankly think that that is probably the only way you're going to convince Putin that he cannot succeed and he has to negotiate.\nYou heard that hot mic moment, which always is instrumental in telling us where a leader is -- where their mind actually is, right? And so, what we learned was Trump was telling -- I think it was Emmanuel Macron in this case, but nonetheless what he said was that Putin, you know, he thought wanted to do a deal for me -- for him. He thought that Putin wanted to do it for Trump. What do you think about him holding that belief? What would you caution him against holding that belief?\n[15:20:04]\nPANETTA: I think the President is being -- if he really believes that -- is being incredibly naive about Vladimir Putin. Putin does not take actions because somehow he's trying to please you, that's not what Putin is about.\nPutin is about Russia, Putin is about winning, Putin is about killing people in order to be able to succeed in this war, that is who Putin is. And you cannot just simply sit back and hope that maybe deep down he's a nice guy. We've made that mistake in the past with Putin. He cannot be trusted and therefore the only way to get Putin to the table to really negotiate on the issues that have to be negotiated is if he knows there is no alternative here that he's not going to be able to play for time, that he's not going to be able to continue this war and that he's not going to win period. He's -- but he's got to be convinced of that if we're going to make any progress.\nKEILAR: How does the U.S. do that? How do they make sure, you know, that they're in a position to ensure that Russia cannot win this war in a way that is palatable to the American public when it comes to anything that might have economic blowback on Americans?\nPANETTA: I think that if the President of the United States asked Putin to meet with Zelenskyy, which is obviously what they're trying to do now, and Putin keeps playing for time, dodges it, doesn't want to show up, I think the President has to say that the only alternative we have here is to make Putin understand he's got to pay a price. I think the President frankly has made a mistake by saying he wanted a ceasefire and then he backed away, that he wanted to make sure that Putin would agree or he would suffer consequences and then backed away.\nThat that process of backing away from the threats that the President makes creates a sense of weakness on the part of the President and Putin takes advantage of it. I think the President has to make clear if Putin does not meet with Zelenskyy, and they do not make progress, we are going to implement strong sanctions and we're going to continue to provide weapons to Ukraine so that they can continue to fight this war.\nKEILAR: Secretary Panetta, great to speak with you about this. Thanks for being with us.\nPANETTA: Good to be with you.\nKEILAR: After months of slumping sales and a boycott, Target CEO is stepping down. So, what's next for one of America's favorite big box stores? We'll have that next.\n(COMMERCIAL BREAK)\n[15:27:54]\nKEILAR: The Trump administration has quietly moved to put new tariffs on hundreds of items including many that you use every day from butter knives to spray deodorants and even some furniture all these items contain steel and aluminum. They were previously excluded from Trump's 50 percent tariff, but that is now changing. CNN's Matt Egan is with us now.\nSo, Matt, what more do we know about how this is going to impact us and also why it changed?\nMATT EGAN, CNN SENIOR REPORTER: Yes, Brianna. Look, this is a major expansion of tariffs and it's one that impacts items on store shelves across the country. Now, as you might remember, a few months ago the President slapped a 50 percent tariff on steel and aluminum. Originally, this massive tariff applied to just the raw materials, but now it is going to apply to a wide range of goods that contain steel and aluminum. This impacts more than 400 product categories that you might be thinking why should I care about steel and aluminum tariffs. Well, it turns out a lot of the items that we all own contain a lot of steel and aluminum. This is going to impact everything from as you mentioned butter knives, but also baby strollers spray deodorant, fire extinguishers and furniture, all of these items are now going to be more expensive to import into the United States but also some industrial items are impacted too.\nWind turbines, cranes, bulldozers also rail cars and it does make you sort of wonder how massive tariffs on all of those industrial items are going to impact the President's goals of trying to have American energy dominance and also to try to help it become more affordable for people to achieve the American dream of home ownership. We also know that a wide range of companies have already warned that they've planned to raise prices because of tariffs or they already have, right, everyone from Procter & Gamble and Nike, to Best Buy, toy makers Mattel and Hasbro, Adidas, Wal-Mart and the latest being Home Depot.\n[15:30:05]\nNow, the Trump administration, they say that the goal here is to try to ..."
    },
    {
      "url": "https://www.washingtonexaminer.com/policy/foreign-policy/3763585/vance-zelensky-trump-meeting-behave-argument/",
      "text": "Vice President J.D. Vance revealed on Wednesday a moment he attempted to “break the ice” with Ukrainian President Volodymyr Zelensky ahead of his high-profile encounter with President Donald Trump.\nThe two world leaders met in the Oval Office earlier this week to discuss ending the Ukraine-Russia war, months after a previous meeting in Washington, D.C., derailed into an explosive argument between Trump, Zelensky, and Vance that was captured for the world on television cameras.\nVance said this week that as he waited with Zelensky to meet with Trump again in the Oval Office, he cracked a joke about the viral quarrel that garnered some laughs from the Ukrainian president.\n“So President Zelensky walked into the Oval Office,” Vance said during an interview with Fox News’s Laura Ingraham on The Ingraham Angle. “I was chatting with him, with the president, with some of the senior Ukrainian delegation. I said, ‘Mr. President, so long as you behave, I won’t say anything.’ And he just chuckled a little bit. It was a good little icebreaker.”\nIn further comments detailing the behind-the-scenes of the high-profile meeting, which ended cordially this time around, Vance argued that the personal encounter between Trump and Zelensky, which followed a similar summit between Trump and Russian President Vladimir Putin in Alaska last week, was necessary if the countries wish to see an end to the Ukraine war. The vice president said the meetings helped distinguish “two big questions” about negotiations.\n“Number one is, Ukraine wants to know that it’s not going to get invaded again by Russia — wants to know that it’s got territorial integrity long into the future,” he said. “[And] the Russians want certain pieces of territory, most of which they’ve occupied, but some of which they haven’t.\n“So that is really where the meat of the negotiation is,” Vance continued. “The Ukrainians want security guarantees. The Russians want a certain amount of territory. Again, we finally got the details. We’re working on them, but we haven’t figured everything out, and I don’t think that we should force — we shouldn’t say that they can’t sit down until you’ve figured out every little detail. Sometimes them sitting down is what facilitates figuring out those details.”\nThe vice president also reflected on Trump’s federal takeover of Washington, D.C., which the White House has characterized as an effort to crack down on crime in the country’s capital. Violent crime in Washington has dropped 35% due to federal intervention, while robberies have dropped 55%, Vance claimed.\nWHITE HOUSE PRESSING TOWARD PUTIN-ZELENSKY BILATERAL DESPITE KREMLIN’S SILENCE\n“I hope the American people just recognize that you don’t have to live with lawlessness,” he said. “You don’t have to live with third-world murder rates. If you just take control of these cities, you can make them safe places to live again.”\n“If you’ve got the political will to enforce the law, you can make even cities like D.C. safe again,” Vance concluded. “And that’s what we’re demonstrating.”"
    },
    {
      "url": "https://www.washingtonexaminer.com/news/world/3762889/nato-jets-ukraine-border-russian-drone-attack/",
      "text": "Two German fighter jets were sent to the Ukraine-Romania border Tuesday night following a wave of drone strikes from Russia.\nOleh Kiper, the head of the Odesa province in Ukraine, said drones hit infrastructure and production facilities in the city of Izmail, which is situated on the Danube River at the border with Romania, a NATO member.\nUkrainian air force officials said Russia launched 93 drones and two ballistic missiles overnight, noting 62 of the drones and one missile were shot down or suppressed.\nThe German air force Typhoon fighters were sent to the area “to monitor the air situation in the border area with Ukraine, in the north of Tulcea County,” Romania’s defense ministry posted to social media.\nThe ministry noted that “during the mission, there were no penetrations of aircraft in the national airspace” and that the German jets returned safely.\nIn previous airstrikes, Russian planes have entered NATO airspace. Poland, another NATO member, has also reported several violations of its airspace from Russian missiles and drones, accusing Russia on Wednesday of “provocation” after a Russian drone crashed in eastern Poland.\n‘NO DEAL UNTIL THERE’S A DEAL’: TRUMP SUMS UP PUTIN MEETING IN SURPRISINGLY BRIEF PRESS CONFERENCE\nThe German aircraft are deployed to Romania as part of NATO’s “Enhanced Air Policing” mission, which began along the eastern border of NATO countries after Russia took Crimea and parts of eastern Ukraine in 2014. The Italian air force was previously deployed to Romania for the Enhanced Air Policing mission.\nUkrainian President Volodymyr Zelensky said the overnight strikes “only confirm the need to pressure Moscow, the need to impose new sanctions and tariffs until diplomacy works fully.”"
    },
    {
      "url": "https://www.washingtonexaminer.com/news/world/3761427/trump-breakdown-peace-efforts-rwanda-congo-peace-deal-collapses/",
      "text": "President Donald Trump is facing the first breakdown of one of his coveted peace deals, after Rwandan-backed rebels walked away from peace talks and launched a new offensive in the eastern Democratic Republic of the Congo.\nTrump previously vowed to impose severe consequences on any party that violates the peace agreement, but hasn’t followed through on his threat as of early Wednesday afternoon.\nThe Trump administration has hailed the president’s peacemaking work to resolve the long-running conflict between Rwanda and the DRC as one of, if not the most, impactful of his several high-profile peace deals, given its status as the 21st century’s single bloodiest conflict. Hopes were high at the June 27th Oval Office ceremony with Trump, Rwandan Foreign Minister Olivier Nduhungirehe, and Congolese Foreign Minister Thérèse Kayikwamba Wagner, after signing a peace agreement aiming to end fighting between Kinshasa and the Rwandan-backed insurgency in the eastern DRC, led by the rebel group M23.\nThose hopes were dashed this week, when the Aug. 18 deadline came and went with fighting only escalating.\nFighting between the Congolese armed forces and M23 appeared to simmer down, though not halting altogether, on July 19 when leaders from the two signed a declaration of principles. Fighting began again in earnest on Aug. 8, local sources told AFP, with the two sides contesting the town of Mulamba, in South Kivu province.\nLocal and security sources told the outlet and Le Monde that both sides shuttled in reinforcements on Aug. 10, with fighting escalating to the use of heavy weapons. M23 got the better of the fighting, pushing back FARDC forces.\nBoth sides accused the other of breaking the ceasefire. M23 spokesman Lawrence Kanyuka accused Kinshasa in a statement of conducting “offensive military maneuvers with a view to a large-scale conflict.”\nOn Tuesday, Kanyua accused “The kakistocratic regime in Kinshasa” of launching “systematic criminal attacks on densely populated areas using kamikaze drones and heavy artillery.”\nBoth sides paid lip service to the Doha ceasefire, but stressed that they had a right to respond to the opposing side’s provocations.\nDays before fighting exploded, the Sentry analysts Sasha Lezhnev and John Pendergast argued in Foreign Policy that the Trump-mediated agreement was waning, and hadn’t yet changed much on the ground.\n“So far, there has been little change in conflict dynamics on the ground, and there is no realistic plan for dismantling the Rwandan-backed rebel group M23 or the DRC-backed militia, the Democratic Forces for the Liberation of Rwanda (FDLR). Most concerning is that the financial pressure that helped lead to the agreements is waning,” they wrote.\nIn the June Oval Office meeting, Trump warned both Rwanda and the DRC that he would implement “very severe penalties, financial and otherwise,” if either side violated the agreement.\nThe Washington Examiner reached out to the State Department and White House for comment and asked whether the Trump administration would be implementing penalties against either party.\nImplementing a ceasefire is difficult due to the ambiguous nature of the links between Kigali and M23, and Kinshasa and allied militias.\nA December 2024 U.N. report alleged that M23 had become a de facto extension of the Rwandan Defense Forces. The report argued that roughly 4,000 regular RDF troops were operating alongside M23, sometimes fighting FARDC forces alongside them. M23 itself now resembles a conventional army, with uniforms, modern equipment, and advanced tactics rather than the ragtag militia group it once was.\nMost directly, the RDF had “de facto control” over M23 command, and “Every M23 unit was supervised and supported by RDF special forces.”\nThe report also gave some credence to Kigali’s fears, however, finding that the FARDC “continued to systematically rely on and cooperate with” the FDLR and other armed radical groups.\nM23 has come under heavy criticism for alleged human rights violations. A Wednesday report from Human Rights Watch alleged that the group massacred over 140 civilians in farming communities in North Kivu province.\nThe most violent round of fighting between the DRC and Rwanda-backed militants blew up in January, when M23 launched an offensive against the capital of North Kivu province, Goma, with a population of nearly 2 million. The DRC and United Nations forces were quickly routed, with their commanders abandoning their troops. Pictures and videos of the city in the aftermath showed abandoned uniforms, equipment, weapons, and vehicles. Thousands were killed in the offensive. M23 has since seized Goma and Bukavu, the capital of South Kivu province.\nRWANDA AND THE CONGO SIGN US-BROKERED PEACE DEAL TO END 21ST CENTURY’S BLOODIEST CONFLICT\nThe Trump administration‘s peace deal calls for the withdrawal of Rwandan forces from the DRC over 90 days, the implementation of an economic integration framework within 90 days, and the establishment of a joint security coordination mechanism within 30 days, according to a copy obtained by Reuters.\nOver 6 million people have died in the wars in the Congo since 1997."
    }
  ],
  "argos_summary": "Russia continues heavy drone and missile attacks on Ukraine, including western regions, while Putin remains reluctant to agree to a peace summit without concessions such as handing over Donbas. Zelensky has expressed willingness to meet but Russia demands territorial gains and security guarantees that exclude NATO troops, with Lavrov insisting Russia must be a guarantor. US officials, including Vice President Vance and former Defense Secretary Panetta, criticize Putin's delay tactics and urge stronger sanctions and continued arms support for Ukraine. Meanwhile, Trump and other Republicans push for rapid negotiations, while NATO and European leaders debate security guarantees and potential peacekeeping forces.",
  "argos_id": "SXIX9ADMS"
}