{
  "url": "https://www.benzinga.com/insights/short-sellers/25/08/47266857/how-do-investors-really-feel-about-johnson-johnson",
  "authorsByline": "Benzinga Insights",
  "articleId": "6403022b7047452bb35798ea7fc4b2bf",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "http://benzinga.com/next-assets/images/schema-image-default.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T14:00:31-04:00",
  "addDate": "2025-08-21T18:21:05.892438+00:00",
  "refreshDate": "2025-08-21T18:21:05.892439+00:00",
  "score": 1.0,
  "title": "How Do Investors Really Feel About Johnson & Johnson? - Johnson & Johnson (NYSE:JNJ)",
  "description": "",
  "content": "Johnson & Johnson's JNJ short percent of float has fallen 6.58% since its last report. The company recently reported that it has 17.14 million shares sold short, which is 0.71% of all regular shares that are available for trading. Based on its trading volume, it would take traders 1.76 days to cover their short positions on average.\n\nShort interest is the number of shares that have been sold short but have not yet been covered or closed out. Short selling is when a trader sells shares of a company they do not own, with the hope that the price will fall. Traders make money from short selling if the price of the stock falls and they lose if it rises.\n\nShort interest is important to track because it can act as an indicator of market sentiment towards a particular stock. An increase in short interest can signal that investors have become more bearish, while a decrease in short interest can signal they have become more bullish.\n\nSee Also: List of the most shorted stocks\n\nAs you can see from the chart above the percentage of shares that are sold short for Johnson & Johnson has declined since its last report. This does not mean that the stock is going to rise in the near-term but traders should be aware that less shares are being shorted.\n\nPeer comparison is a popular technique amongst analysts and investors for gauging how well a company is performing. A company's peer is another company that has similar characteristics to it, such as industry, size, age, and financial structure. You can find a company's peer group by reading its 10-K, proxy filing, or by doing your own similarity analysis.\n\nAccording to Benzinga Pro, Johnson & Johnson's peer group average for short interest as a percentage of float is 3.22%, which means the company has less short interest than most of its peers.\n\nDid you know that increasing short interest can actually be bullish for a stock? This post by Benzinga Money explains how you can profit from it.\n\nThis article was generated by Benzinga's automated content engine and was reviewed by an editor.",
  "medium": "Article",
  "links": [
    "https://www.benzinga.com/pro/",
    "https://www.benzinga.com/money/how-to-short-a-stock?adType=benzinga-insights&ad=short-interest&campaign=wallstreetadvantage",
    "https://www.benzinga.com/money/how-to-make-money-on-a-short-squeeze?adType=benzinga-insights&ad=short-interest&campaign=wallstreetadvantage",
    "https://www.benzinga.com/short-interest?adType=benzinga-insights&ad=short-interest&campaign=wallstreetadvantage"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Short interest",
      "weight": 0.13636965
    },
    {
      "name": "short interest",
      "weight": 0.13636965
    },
    {
      "name": "less short interest",
      "weight": 0.13333617
    },
    {
      "name": "increasing short interest",
      "weight": 0.12895961
    },
    {
      "name": "Short selling",
      "weight": 0.1165774
    },
    {
      "name": "short selling",
      "weight": 0.1165774
    },
    {
      "name": "Johnson",
      "weight": 0.0998477
    },
    {
      "name": "less shares",
      "weight": 0.088301614
    },
    {
      "name": "Benzinga Money",
      "weight": 0.07802224
    },
    {
      "name": "shares",
      "weight": 0.07738458
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.994140625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9931640625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9921875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.81640625
    }
  ],
  "sentiment": {
    "positive": 0.06253732,
    "negative": 0.6399866,
    "neutral": 0.29747614
  },
  "summary": "Johnson & Johnson's short percent of float has fallen 6.58% since its last report. The company reported that it has 17.14 million shares sold short, which is 0.71% of all regular shares available for trading. Short interest is an indicator of market sentiment and can indicate a decrease in short interest. However, traders should be aware that less shares are being shorted. The average for short interest as a percentage of float is 3.22%, which indicates that Johnson & Johnson has less short interest than most of its peers.",
  "shortSummary": "Johnson & Johnson's short interest has declined 6.58% to 0.71% amid market sentiment concerns, though this does not necessarily indicate a rise in stock prices.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "2fa9a9d0d6d84d3799275fe3f5db38e3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.benzinga.com/short-interest?adType=benzinga-insights&ad=short-interest&campaign=wallstreetadvantage",
      "text": "How to Make Money on a Short Squeeze\nThe current Reddit-fueled short squeeze on stocks like GameStop (NYSE: GME) and AMC Theaters (NYSE: AMC) has more investors interested in shorting and how they can profit from a short squeeze. While participating in a short squeeze has the potential to generate a large amount of money very quickly, many investors aren’t aware that this option can also compound losses.\nIf you’re interested in learning more about the short squeeze phenomena, how you can predict short squeezes and the pros and cons of this type of investment, our beginner’s guide is an excellent place to begin.\nWhat is a Short Squeeze?\nBefore we can describe how to make money on a short squeeze, we need to define short selling. Short selling occurs when investors bet against the price of a security or asset, believing that the price of the asset will decrease in the future. During a short, an investor will borrow a set number of shares of stock from someone on the market that currently owns them with the promise of returning the shares at a later date. Investors may short a stock on speculation, while hedge funds might use a short position as a form of insurance against a risky position held in the same asset.\nThe short seller will then sell the shares that they borrowed at the current market price. While the short is open, the short seller will pay interest to the lender who provided them with the shares. Ideally, the price of the stocks will fall and the short seller will be able to purchase them back for a reduced cost, return the shares, and keep the profit from the differences between the two prices paid, less interest.\nA short squeeze occurs when a heavily shorted stock rises in value instead of falling. Say a company’s stock is expected to decline but instead receives a major piece of good news, the price of each share can skyrocket. In this situation, short-sellers are still required to close out of their position on their contract expiration date, despite the fact that they will be taking a loss when they buy back the shares they initially borrowed. This can put regular investors in an advantageous position, driving up the price of a stock to “squeeze” the short sellers, forcing them to buy in to cover their positions. This upward momentum compounds, pushing the price of the stock even higher.\nBe Aware of a Short Squeeze\nThough a short squeeze can quickly cause the price of a stock to shortly rise in value, these changes in price are rarely driven by the underlying fundamentals of the company. Instead, investors use short squeezes as a quick play to earn a profit before exiting their positions once short sellers are squeezed out of their positions.\nIf you do decide to participate in a short squeeze, understand which stocks are likely to see a squeeze and anticipate when the squeeze will occur so you can come out on top. Buying in when the price is too high can leave you with shares worth only a fraction of their original value after all short positions have been closed.\nShort Squeeze Pros and Cons\nParticipating in a short squeeze comes with both pros and cons. Let’s take a look at both the advantages and disadvantages of this investment strategy.\nPros:\n- Theoretically unlimited profits: The biggest draw of short squeezes is that short sellers are required to purchase back shares of stock they’ve shorted on the expiration date, no matter the price. This means that if a short squeeze does occur, there is no upper limit on the total profit that you as the investor can take away from the trade.\n- Less risk for investors than short sellers: If you invest in a stock hoping for a short squeeze to occur and it doesn’t, the most you can lose is the amount of money that you invested. On the other hand, short sellers can undertake losses of more than 100% in addition to being subject to margin calls and interest. Anticipating a short squeeze is even less risky if you purchase long-term options, as you can simply choose not to execute the option if the stock doesn’t rise in value as you expected.\nCons:\n- Can compound losses: While being on the right side of a short squeeze can result in a virtually unlimited profit, getting caught up in the hype of a squeeze can also leave you with losses. For example, during the current GameStop squeeze, the price of GME stock peaked at about $347 on January 27, 2021. Just 1 week later, on February 3, shares of GME traded at an average price of $92.41 per share.\nWhile this isn’t a problem for investors who bought in when GameStop stock was trading at around $14 in October 2020, many investors got caught up in the flurry of activity and excitement around GME in January, buying in at prices of $300 or more. Those who are still holding their investments may be down hundreds or even thousands of dollars with little hope for recovery.\n- May leave you with a fundamentally shaky stock: As we’ve stated, sharp increases in stock prices associated with short squeezes typically have little to do with the underlying fundamentals of the company they’re associated with. This means if you do miss the exit point on the short squeeze, continuing to hold the stock long term might not be a viable option. This can be especially true when you consider that heavily-shorted stocks are typically associated with companies that are failing financially.\nAnticipating a Short Squeeze\nTiming a short squeeze can be challenging. Here are a few values you can use to predict when a short squeeze is coming.\n- High short-interest percentage: The more investors or investment firms that short a particular stock, the more competition there will be to buy the stock back at an expiration date. As more investors short an asset, the interest paid on that asset rises as demand increases. More investors shorting a stock may make a squeeze more effective.\n- High short-interest ratio: The short-interest ratio of a stock is calculated by dividing the stock’s current short interest by its average daily trading volume. The short interest ratio tells you, on average, how long it would take for a short seller to close out of their current position. The higher the short-interest ratio, the more likely a short squeeze is to occur, as competition to rebuy shares spikes.\nBest Online Brokers for Trading Short Squeeze\nNo matter if you’re planning on purchasing penny stocks, stocks for an upcoming short squeeze or long-term holds that you plan to keep in your portfolio for decades, the first step to investing is opening a brokerage account. If you don’t already have an active brokerage account, consider a few of our top choices below.\n- Best For:Active and Global TradersVIEW PROS & CONS:Securely through Interactive Brokers’ website\n- Best For:Momentum tradersVIEW PROS & CONS:securely through Centerpoint Securities's website\n- Best For:Day Traders and ScalpersVIEW PROS & CONS:securely through Guardian Trading's website\n- Best For:Active Short SellersVIEW PROS & CONS:securely through TradeZero [SPONSORED]'s website\n- Best For:High-Capital Short SellersVIEW PROS & CONS:securely through Cobra Trading's website\nExamples of a Short Squeeze\nOne major example of a short squeeze occurred in October 2008, when a short squeeze caused the price of car manufacturer Volkswagen AG to soar on the Frankfurt markets. After the public received unexpected news that fellow car manufacturer Porsche was planning to increase its shares in Volkswagen, a flurry of investors suddenly began buying into the stock. This caused the price of Volkswagen AG to move from a value of €210.85 to a value of more than €1,000 over the course of 2 days, as short sellers were forced to buy in at higher and higher prices to cover their shorted positions. This short squeeze briefly made Volkswagen the most valuable company in the world.\nDuring a short squeeze that began in October 2008, shares of Volkswagen stock quadrupled over the course of just a few days. This made it briefly the most valuable car manufacturer in the world.\nOf course, price fluxes from short squeezes never last forever. The price of Volkswagen dipped sharply after the conclusion of the squeeze. Today, Volkswagen’s shares are valued at about €132, or about $161 USD.\nShould You Get in on a Short Squeeze?\nWith the potential for limitless profits, getting involved in a short squeeze can be both exciting and profitable. It’s important to remember, however, that these squeezes can also be risky for both short position holders and sellers. If you do decide to get in on one of these riskier moves, remember to never invest more money than you can afford to lose.\nFrequently Asked Questions\nQ: What triggers a short squeeze?\nA short squeeze is triggered when the price of a heavily-shorted asset receives unexpected positive news and the price of the stock goes up.\nQ: Do you make more money short selling?\nIt is possible to make money short selling, especially if the price of a stock decreases significantly while your position is open. However, short selling can also lead to virtually limitless losses if a squeeze is triggered.\nQ: Is short selling illegal?\nShort selling is not illegal. However, the practice of “naked shorting” (selling shares of stock that have not been affirmatively determined to exist) is against the law.\nRelated content: How to Buy Volkswagen (VWAGY) Stock"
    },
    {
      "url": "https://www.benzinga.com/money/how-to-make-money-on-a-short-squeeze?adType=benzinga-insights&ad=short-interest&campaign=wallstreetadvantage",
      "text": "How to Make Money on a Short Squeeze\nThe current Reddit-fueled short squeeze on stocks like GameStop (NYSE: GME) and AMC Theaters (NYSE: AMC) has more investors interested in shorting and how they can profit from a short squeeze. While participating in a short squeeze has the potential to generate a large amount of money very quickly, many investors aren’t aware that this option can also compound losses.\nIf you’re interested in learning more about the short squeeze phenomena, how you can predict short squeezes and the pros and cons of this type of investment, our beginner’s guide is an excellent place to begin.\nWhat is a Short Squeeze?\nBefore we can describe how to make money on a short squeeze, we need to define short selling. Short selling occurs when investors bet against the price of a security or asset, believing that the price of the asset will decrease in the future. During a short, an investor will borrow a set number of shares of stock from someone on the market that currently owns them with the promise of returning the shares at a later date. Investors may short a stock on speculation, while hedge funds might use a short position as a form of insurance against a risky position held in the same asset.\nThe short seller will then sell the shares that they borrowed at the current market price. While the short is open, the short seller will pay interest to the lender who provided them with the shares. Ideally, the price of the stocks will fall and the short seller will be able to purchase them back for a reduced cost, return the shares, and keep the profit from the differences between the two prices paid, less interest.\nA short squeeze occurs when a heavily shorted stock rises in value instead of falling. Say a company’s stock is expected to decline but instead receives a major piece of good news, the price of each share can skyrocket. In this situation, short-sellers are still required to close out of their position on their contract expiration date, despite the fact that they will be taking a loss when they buy back the shares they initially borrowed. This can put regular investors in an advantageous position, driving up the price of a stock to “squeeze” the short sellers, forcing them to buy in to cover their positions. This upward momentum compounds, pushing the price of the stock even higher.\nBe Aware of a Short Squeeze\nThough a short squeeze can quickly cause the price of a stock to shortly rise in value, these changes in price are rarely driven by the underlying fundamentals of the company. Instead, investors use short squeezes as a quick play to earn a profit before exiting their positions once short sellers are squeezed out of their positions.\nIf you do decide to participate in a short squeeze, understand which stocks are likely to see a squeeze and anticipate when the squeeze will occur so you can come out on top. Buying in when the price is too high can leave you with shares worth only a fraction of their original value after all short positions have been closed.\nShort Squeeze Pros and Cons\nParticipating in a short squeeze comes with both pros and cons. Let’s take a look at both the advantages and disadvantages of this investment strategy.\nPros:\n- Theoretically unlimited profits: The biggest draw of short squeezes is that short sellers are required to purchase back shares of stock they’ve shorted on the expiration date, no matter the price. This means that if a short squeeze does occur, there is no upper limit on the total profit that you as the investor can take away from the trade.\n- Less risk for investors than short sellers: If you invest in a stock hoping for a short squeeze to occur and it doesn’t, the most you can lose is the amount of money that you invested. On the other hand, short sellers can undertake losses of more than 100% in addition to being subject to margin calls and interest. Anticipating a short squeeze is even less risky if you purchase long-term options, as you can simply choose not to execute the option if the stock doesn’t rise in value as you expected.\nCons:\n- Can compound losses: While being on the right side of a short squeeze can result in a virtually unlimited profit, getting caught up in the hype of a squeeze can also leave you with losses. For example, during the current GameStop squeeze, the price of GME stock peaked at about $347 on January 27, 2021. Just 1 week later, on February 3, shares of GME traded at an average price of $92.41 per share.\nWhile this isn’t a problem for investors who bought in when GameStop stock was trading at around $14 in October 2020, many investors got caught up in the flurry of activity and excitement around GME in January, buying in at prices of $300 or more. Those who are still holding their investments may be down hundreds or even thousands of dollars with little hope for recovery.\n- May leave you with a fundamentally shaky stock: As we’ve stated, sharp increases in stock prices associated with short squeezes typically have little to do with the underlying fundamentals of the company they’re associated with. This means if you do miss the exit point on the short squeeze, continuing to hold the stock long term might not be a viable option. This can be especially true when you consider that heavily-shorted stocks are typically associated with companies that are failing financially.\nAnticipating a Short Squeeze\nTiming a short squeeze can be challenging. Here are a few values you can use to predict when a short squeeze is coming.\n- High short-interest percentage: The more investors or investment firms that short a particular stock, the more competition there will be to buy the stock back at an expiration date. As more investors short an asset, the interest paid on that asset rises as demand increases. More investors shorting a stock may make a squeeze more effective.\n- High short-interest ratio: The short-interest ratio of a stock is calculated by dividing the stock’s current short interest by its average daily trading volume. The short interest ratio tells you, on average, how long it would take for a short seller to close out of their current position. The higher the short-interest ratio, the more likely a short squeeze is to occur, as competition to rebuy shares spikes.\nBest Online Brokers for Trading Short Squeeze\nNo matter if you’re planning on purchasing penny stocks, stocks for an upcoming short squeeze or long-term holds that you plan to keep in your portfolio for decades, the first step to investing is opening a brokerage account. If you don’t already have an active brokerage account, consider a few of our top choices below.\n- Best For:Active and Global TradersVIEW PROS & CONS:Securely through Interactive Brokers’ website\n- Best For:Momentum tradersVIEW PROS & CONS:securely through Centerpoint Securities's website\n- Best For:Day Traders and ScalpersVIEW PROS & CONS:securely through Guardian Trading's website\n- Best For:Active Short SellersVIEW PROS & CONS:securely through TradeZero [SPONSORED]'s website\n- Best For:High-Capital Short SellersVIEW PROS & CONS:securely through Cobra Trading's website\nExamples of a Short Squeeze\nOne major example of a short squeeze occurred in October 2008, when a short squeeze caused the price of car manufacturer Volkswagen AG to soar on the Frankfurt markets. After the public received unexpected news that fellow car manufacturer Porsche was planning to increase its shares in Volkswagen, a flurry of investors suddenly began buying into the stock. This caused the price of Volkswagen AG to move from a value of €210.85 to a value of more than €1,000 over the course of 2 days, as short sellers were forced to buy in at higher and higher prices to cover their shorted positions. This short squeeze briefly made Volkswagen the most valuable company in the world.\nDuring a short squeeze that began in October 2008, shares of Volkswagen stock quadrupled over the course of just a few days. This made it briefly the most valuable car manufacturer in the world.\nOf course, price fluxes from short squeezes never last forever. The price of Volkswagen dipped sharply after the conclusion of the squeeze. Today, Volkswagen’s shares are valued at about €132, or about $161 USD.\nShould You Get in on a Short Squeeze?\nWith the potential for limitless profits, getting involved in a short squeeze can be both exciting and profitable. It’s important to remember, however, that these squeezes can also be risky for both short position holders and sellers. If you do decide to get in on one of these riskier moves, remember to never invest more money than you can afford to lose.\nFrequently Asked Questions\nQ: What triggers a short squeeze?\nA short squeeze is triggered when the price of a heavily-shorted asset receives unexpected positive news and the price of the stock goes up.\nQ: Do you make more money short selling?\nIt is possible to make money short selling, especially if the price of a stock decreases significantly while your position is open. However, short selling can also lead to virtually limitless losses if a squeeze is triggered.\nQ: Is short selling illegal?\nShort selling is not illegal. However, the practice of “naked shorting” (selling shares of stock that have not been affirmatively determined to exist) is against the law.\nRelated content: How to Buy Volkswagen (VWAGY) Stock"
    },
    {
      "url": "https://www.benzinga.com/money/how-to-short-a-stock?adType=benzinga-insights&ad=short-interest&campaign=wallstreetadvantage",
      "text": "If you're interested in learning how to short stocks, get an edge over other traders with Benzinga Pro while we're currently offering a 14-day trial.\nIt’s easy to understand that you make money after buying a stock when the stock price increases. Traders who want to profit from a declining market can use a strategy called shorting stock. Continue reading to find out how you short a stock.\nQuick Look at How to Short a Stock:\n- Research: Identify a stock that you believe will decrease in value.\n- Borrow Shares: Borrow shares of the stock from your broker through a margin account.\n- Sell Shares: Sell the borrowed shares on the open market at the current market price.\n- Wait for Price to Drop: Monitor the stock’s price and wait for it to decrease.\n- Buy Back Shares: Once the price drops to your desired level, buy back the shares from the market.\n- Return Shares: Return the shares to your broker to close out the short position.\n- Profit/Loss: The difference between the price at which you sold the shares and the price at which you bought them back determines your profit or loss.\n- What Does it Mean to Short a Stock?\n- How Do You Do It?\n- An Example\n- See All 13 Items\nWhat Does it Mean to Short a Stock?\nTraders called short sellers use a short selling strategy to speculate on a future market fall of a particular share price.\n- Shorting a stock first involves borrowing the stock you wish to sell at a market-determined interest rate and then selling the borrowed equities to take advantage of a future market decline.\n- You profit by selling the borrowed stock at a higher price and subsequently buying it back at a lower price if the stock price falls. The profit consists of the difference between the price at which the trader sold the stock and the price they buy it back at less any borrowing and transaction costs.\nYou can also lose money if the market rises instead of declines as you expected when you initiated the position. This can be particularly problematic and cause something called a “short squeeze” if a large short position accumulates in a stock and significant buying interest subsequently emerges. Retail investors can take action here if they feel comfortable, and they will simply wait as the price declines further.\nStockbrokers generally have a stock loan arrangement with other clients and brokers where the broker pays a certain amount to borrow requested stock, if available. This arrangement allows the broker to use its customer’s stock held in margin accounts or to borrow stock from other brokers to facilitate its other clients’ short sales.\nSome market participants feel that this is a form of market manipulation, but it’s akin to seizing on an opportunity. Stocks often don’t fall into a position where shorting will make sense, and that’s it’s not a popular investment strategy.\nTypically, the fee for a stock loan on a liquid exchange traded stock is 0.30% per annum. If the stock is difficult to borrow, the stock loan fee could go up substantially.\nIn 2010, the U.S. Securities and Exchange Commission (SEC) implemented its alternative uptick rule, known as Rule 201, that lets investors in a stock exit their long positions before any short selling can legally occur. The rule becomes active if a stock’s price falls more than 10% in a single day. Short selling is then only allowed “if the price of the security is above the current national best bid.” The goal of this rule is to preserve investor confidence and promote market stability during times of high volatility and extreme selling pressure in a stock.\nHow Do You Do It?\nWhile it may sound complicated because of the borrowing aspect, the process of shorting a stock is actually pretty easy to put into practice. Shorting a stock can be explained in four simple steps:\n- The short seller asks their broker to borrow the stock they intend to sell from a holder willing to loan out their stock. They will need to pay a certain interest rate to the stockholder known as the broker loan rate.\n- They then either sell the stock they borrowed at the current market price or they place a limit order to sell it at a specific price and await execution of that order.\n- Once the short seller has successfully established a short position in the stock, they can close out that position by buying back the stock in the market, ideally at a lower price. This is known as “buying to cover.”\n- The borrowed stock is then returned to the owner with interest via the short seller’s brokerage account along with any dividends earned while the stock was borrowed.\nAn Example\nThe following example illustrates the concept of shorting stock using a specific company that had dropped significantly in January 2021.\nThe Company\nAcelRx Pharmaceuticals Inc. (NASDAQ:ACRX) is a specialty pharmaceutical company that saw its shares drop by over 16% in late January of 2021. The decline was attributed in large part to the company’s announcement of a secondary stock offering of 14.5 million new shares that would generate an additional $27.5 million for the company. This created quite a lot of downside risk.\nBeginning the Short Selling Process\nA short seller might expect that AcelRx’s stock price would decline after the stock offering was announced. To take advantage of this anticipated drop, the short seller would contact their broker to borrow the shares they need. As an example, they might ask for a loan of 1,000 shares of AcelRx. The short seller then places an order to sell the borrowed shares at a desired sell price.\nThe short seller could have sold the borrowed AcelRX stock at $2.80 on January 20 and bought back their short stock the next day for $2 per share. Had they done that, they would have realized a profit of $0.80 per share or $800 on a 1,000 share position.\nThe Result of Shorting a Stock\nAfter the announcement of the secondary offering, AcelRX stock declined significantly. This gave the short seller the opportunity to cash in their profits the very next day. If the short seller had not covered their short position quickly, the stock’s subsequent rebound may have cost the short seller money instead of allowing them to realize a profit.\nKeep in mind that the short seller is liable to pay any dividends received from the borrowed stock to the lender of the stock being shorted. The formula used for calculating the rate of return on a shorted security is as follows:\nRate of Return = (Sales proceeds from the short sale - dividends paid to stock lender - purchase price of the stock) / Initial margin requirement\nIn the above equation, the initial margin requirement is the proportion of the total market value of the securities that the short seller has to put up in cash to hold their short position.\nA margin account holder can borrow up to 50% of the equity in their trading account for the purchase of new securities or for short sales on normally traded stocks. A margin account also stipulates a maintenance margin that is typically 30% of the equity value. If the account’s equity falls below this maintenance margin level, the broker will issue a margin call to ask the client to take steps to bring the equity back to 50% within a given time frame. If that is not done promptly, then the client’s positions can be liquidated by the broker.\nMargin trading accounts have their own set of rules and minimum deposits depending on the broker and the stock you plan on shorting. Remember to check with your broker for information about how much of a particular stock you can sell short in your margin account and what your account’s maintenance margin level is.\nBest Online Brokers\nTake a look at these recommended stock brokers for your shorting needs.\n- Best For:Active and Global TradersVIEW PROS & CONS:Securely through Interactive Brokers’ website\n- Best For:Momentum tradersVIEW PROS & CONS:securely through Centerpoint Securities's website\n- Best For:Day Traders and ScalpersVIEW PROS & CONS:securely through Guardian Trading's website\n- Best For:Active Short SellersVIEW PROS & CONS:securely through TradeZero [SPONSORED]'s website\n- Best For:High-Capital Short SellersVIEW PROS & CONS:securely through Cobra Trading's website\nWhat to Know Before Short Selling\nIf you’re considering shorting a stock, make sure you’re informed about your broker’s requirements before you borrow stock to short. You should also be aware of any special circumstances that could make the stock rally before you cover your short position. The following list includes some things you should keep in mind before selling a stock short.\n- The security used for shorting should be liquid since illiquid stocks tend to be harder for brokers to borrow.\n- A trader who intends to short a stock should maintain a funded margin account with their broker, since margin is needed for shorting a stock.\n- Shorting is done by borrowing stock, so the broker will charge interest on that loan to pay to the stockholder. A short seller’s profit earned will be trimmed to that extent.\n- Short selling may be restricted on some stocks due to a low supply of available stock.\n- Stock borrowing costs can rise significantly under certain market conditions.\n- Shorting stocks is not allowed in your IRA account or in any other tax-deferred account.\nUsing Put Options\nShorting could lead to staggering losses if the shorted stock continues to move higher. A safer alternative to shorting a stock is buying a put option that gives you the right, but not the obligation, to sell the underlying security at the strike price on or before the expiration of the option.\nFor example, if you buy one $50 strike put option on ABC stock for $1.50 when it is “at the money” so that the underlying stock’s price is equal to the put option’s strike price, then that gives you the right to sell 100 shares of ABC stock at $50 up until the option’s expiration. You stand to make a profit on that option if the price of the stock drops below $48.50 by expiration since you paid $1.50 to purchase the put option.\nWhen you exercise the put option, you sell the stock at the strike price. You can then pocket the difference between the strike price minus the $1.50 you paid for it and the sale price of the stock.\nAlternatively, you can sell the put option contract before it expires. If the market has since declined, you might make a profit on your initial investment. This can sometimes fetch you better returns than what you might gain by shorting the stock, especially if relatively little time has passed and volatility in the stock has risen.\nRisks\nBefore you begin shorting stocks, it’s important to understand all the risks associated with this type of trade.\nBeware of a Short Squeeze\nOne of the key risks associated with shorting stocks is known as a “short squeeze.” This can occur when unexpected positive news concerning the company or the market triggers a notable upward move in a stock that has attracted considerable short interest. This can then send shorts sellers scurrying to cover their positions to minimize their losses.\nA perfect example of a short squeeze can currently be seen in the stock of GameStop. Some analysts estimate that the stock has a short interest of almost 140% of the total float of the company’s stock. When short sellers chase the security higher to cover their short positions, demand perks up from technical traders, which can trigger a further sharp rise in the price of a stock.\nAnother risk that can fuel a short squeeze comes from something called buy-ins. This occurs when a broker is forced to close out a short position in a highly non-liquid stock since the lender demands their security back, perhaps because they want to close out their long position.\nBuy-ins and short sellers rushing to cover their positions have thus far pushed the price of GameStop stock to dizzying heights well beyond its fundamental valuation as a company. The massive short squeeze has also bankrupted professional hedge funds that have been short the stock for years.\nDespite such pitfalls, shorting as a trading strategy is here to stay, primarily because it offers traders the opportunity to make money even in a downward trending stock market.\nIs Shorting Stock Right for You?\nAlthough shorting stocks has its associated risks, the trading strategy can show high returns if done correctly and at the right times. Make sure to carefully perform your research on any stock before initiating a short position. If you’re ready to start selling stocks short, check out Benzinga’s list of the best online stock brokers for shorting.\nFrequently Asked Questions\nCan I short any stock?\nNot all stocks can be shorted; it depends on the brokerage and market conditions. Some stocks may be hard to borrow or have restrictions.\nWhat fees or costs are associated with short selling?\nShort sellers may incur borrowing fees, margin interest and any dividends paid if the stock pays them while you are short.\nIs short selling recommended for beginner investors?\nShort selling is generally considered risky and may not be recommended for beginners due to its complexity and potential for significant losses.\nAbout Ryan Peterson\nRyan Peterson is a seasoned personal finance writer with a Bachelor’s Degree in Business from Indiana University. With over five years of experience, Ryan has crafted insightful content for multiple finance websites, including MoneyLion At Benzinga, he brings his expertise and passion for helping readers navigate the complex world of personal finance and investing, empowering them to make informed financial decisions."
    }
  ],
  "argos_summary": "Johnson & Johnson’s short interest has dropped to 0.71% of float, a decline that puts it below the peer average of 3.22% and suggests a more bullish sentiment. The article explains short selling mechanics, noting that short interest can signal bearishness but also create opportunities for short squeezes when a heavily shorted stock rises sharply. It outlines the risks and rewards of short squeezes, citing high-profile examples such as GameStop and Volkswagen, and warns that gains can be fleeting and losses substantial. Finally, it offers guidance on how to approach short selling, including using margin accounts, monitoring short‑interest ratios, and considering alternatives like put options.",
  "argos_id": "T2Y3F1V7K"
}