{
  "url": "https://www.startribune.com/3-principles-to-invest-by-whatever-comes-next/601458836",
  "authorsByline": "Dan Lefkovitz of Morningstar",
  "articleId": "e9b9d687c8ce4188838bd6803ec1a06b",
  "source": {
    "domain": "startribune.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MN",
      "county": "Hennepin County",
      "city": "Minneapolis",
      "coordinates": {
        "lat": 44.9772995,
        "lon": -93.2654692
      }
    }
  },
  "imageUrl": "https://www.startribune.com/200.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T17:57:02.360000+00:00",
  "addDate": "2025-08-21T18:19:23.834413+00:00",
  "refreshDate": "2025-08-21T18:19:23.834416+00:00",
  "score": 1.0,
  "title": "3 principles to invest by, whatever comes next",
  "description": "I recently opened a second-quarter investment account statement, not to euphoria—but relief.",
  "content": "Prison for repeat sex offender who picked up girl in Minnesota park, assaulted her for months\n\nReview: Novel offers a ‘Porthole’ into lives of the rich and messed up\n\nWatch it live tonight: No. 1 Marshall vs. No. 3 Willmar, volleyball rivals, is first Strib Varsity livestream\n\nHurricane Erin stirs up strong winds and floods part of a NC highway as it slowly moves out to sea\n\nCalifornia is set to act fast after Texas advances congressional maps to boost Republicans\n\nMajor Russian attack on western Ukraine hits an American factory during US-led push for peace\n\nUS home sales rose in July as mortgage rates eased a bit and home prices grew more slowly\n\nWhat to know about powerful Hurricane Erin as it moves away from the US East Coast\n\nTesla is slow in reporting crashes and the feds have launched an investigation to find out why\n\nFormer top aide to NYC mayor among 7 facing new charges in City Hall corruption probe\n\nSearches end in Wyoming mountains with Minnesotans still missing in separate cases\n\nGymnast who sparked FBI sex abuse inquiry into coach tells AP she's proud to come forward\n\nHow to get more Minnesota seniors moving to prevent dangerous falls? Perhaps a doctor’s note.\n\nJames Dobson, Focus on the Family founder and key leader on the Christian right, dies at 89\n\nMan arrested for WNBA sex-toy throwing at Liberty game, the 3rd arrest in string of disturbances\n\nLet's not forget, US equities flirted with a bear market earlier this year. There were concerns that China's DeepSeek artificial intelligence would bring down US technology titans. There were the tariffs. Yet, here we sit in the third quarter of 2025 with the Morningstar US Market Index up nearly 8% for the year and the Morningstar US Core Bond Index having returned more than 3%. Ahead of us lie multiple pathways. Economic data and earnings announcements will provide direction, but there are also ''unknown unknowns'' that could alter our course. Here are three investment principles to keep in mind. Principle 1: Where the market goes, nobody knows Coming into the year, how many pundits talked about AI out of China challenging US tech stocks? Did anyone expect tariffs to be such a factor? Though 2025 has had its plot twists, changes in market direction are hardly unusual.\n\nConsider thatstocks came into summer 2024 on a tear, beforesentiment turned. A series of releases—jobs, inflation, and earnings—compounded fears of a narrow and pricey market. Somehow, both an unexpected interest rate hike by the Bank of Japan and an expected rate cut by the Fed triggered selloffs. So, w here we go from here is anyone's guess. But I'll cite a story about how dead investors outperform living ones because they don't trade. Buy-and-hold has been a great strategy for long-term investors. Some think you don't need to own anything other than US equities. But I'llnote that the Morningstar Global Markets ex-US Index has trounced its US equivalent so far in 2025. What's behind the turnaround? The dollar weakening against many other currencies is part of the story. But markets in many regions—Europe, Latin America, and India—have roared to life this year.\n\nTo me, global investing is about casting the net as widely as possible. So, just as some argue that US-based multinationals provide American investors with global exposure, you could also argue that they're not fully exposed to the US, from a revenue perspective, with a purely domestic portfolio. The equity market's extreme volatility in 2025 makes bonds look like steady-Eddies. While US stocks were in free fall from late February through early April, the Morningstar US Core Bond Index gained 1.3%. Bonds diversified equities, serving as portfolio ballast. Bonds face a lot of ''headline risk.'' There are debt and deficit concerns. And the shadow of 2022's '' worst bond market ever '' lingers. While the risks are undeniable, fixed income is also the victim of fearmongering. Not only have bonds diversified stocks, they're also providing above-inflation income streams. Thanks to the painful interest rate hikes of 2022-23, yields on fixed income are at levels not seen since the mid-2000s.\n\nWe're likely to see more twists before 2025 is out. Short-term asset-price fluctuations are driven by a complex interplay of variables—macro and micro, fundamental and technical. Longer term, valuation can be a useful guide. According to my Morningstar Equity Research colleagues, the US stock market looked a bit pricey coming into the second half of 2025—not in dangerous bubble territory, but ''trading at a slight premium.'' The bargains cluster on the value side of the market and in smaller-cap stocks. Meanwhile, my colleagues in Morningstar Investment Management continue to see upside in bonds and international equities. As always, a buy-and-hold mindset and a diversified portfolio remain sensible investment tactics.",
  "medium": "Article",
  "links": [
    "https://www.startribune.com/wires/business"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US equities",
      "weight": 0.085286714
    },
    {
      "name": "US stocks",
      "weight": 0.08506863
    },
    {
      "name": "US tech stocks",
      "weight": 0.080136046
    },
    {
      "name": "US",
      "weight": 0.079960056
    },
    {
      "name": "US home sales",
      "weight": 0.07806424
    },
    {
      "name": "US technology titans",
      "weight": 0.07366239
    },
    {
      "name": "market direction",
      "weight": 0.06251283
    },
    {
      "name": "markets",
      "weight": 0.057922658
    },
    {
      "name": "the Morningstar US Core Bond Index",
      "weight": 0.05587937
    },
    {
      "name": "the US stock market",
      "weight": 0.054800663
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Weather"
    },
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.91650390625
    },
    {
      "name": "/News/Other",
      "score": 0.81640625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.576171875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.363037109375
    }
  ],
  "sentiment": {
    "positive": 0.14819574,
    "negative": 0.53055555,
    "neutral": 0.3212487
  },
  "summary": "The article discusses three investment principles for 2025, including where the market will go, where economic data and earnings announcements will provide direction, but also potential unknowns. The article notes that US equities flirted with a bear market earlier this year due to concerns about AI from China challenging US tech stocks and tariffs. However, the third quarter of 2025, with the Morningstar US Market Index up nearly 8% for the year, and the morningstar US Core Bond Index returning more than 3%. The author notes that global investing is about broadening the net and that global companies, like US-based multinationals, are not fully exposed to the US from a revenue perspective. Bonds diversify equities, serving as portfolio ballast. The author also notes that the volatility of the equity market in 2025 makes bonds look like steady-Eddies.",
  "shortSummary": "The stock market, driven by rising volatility, is poised for unpredictable future with volatile markets, particularly US equities and bonds, with potential for volatility and inflation concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "82769520989d4a59a794d2b91c6db830",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The article reports that a repeat sex offender was sentenced to prison after picking up a girl in a Minnesota park and assaulting her for months. It also lists a variety of unrelated news items, including a novel review, sports events, Hurricane Erin, political developments, a Russian attack, real‑estate data, and other miscellaneous stories. The piece serves as a broad news roundup rather than a focused investigative report.",
  "argos_id": "UBCQKDAD2"
}