{
  "url": "https://www.bloomberg.com/news/videos/2025-08-21/brunswick-sees-record-free-cash-flow-video?srnd=phx-technology",
  "authorsByline": "bn",
  "articleId": "a193d9f29dd04b73929c6d6fefc82396",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iMX9NfBICDos/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T16:15:10.685000+00:00",
  "addDate": "2025-08-21T16:31:29.183577+00:00",
  "refreshDate": "2025-08-21T16:31:29.183578+00:00",
  "score": 1.0,
  "title": "Brunswick Sees Record Free Cash Flow",
  "description": "Dave Foulkes, Brunswick CEO, says the largest recreational boat maker in the world is seeing pressure on the value part of its portfolio where consumers are more concerned about higher resale interest rates. However, he says demand for its premium brands remains strong. (Source: Bloomberg)",
  "content": "Let's talk about your outlook, because it looks like we've kind of bottomed out here. We've run aground, but hopefully we're going to ride the waves back up in the coming years. Is that how it looks to you? I think it does. Well, first of all, thank you for having me. And I think that was reflected, as you said, in our second quarter earnings. Revenue up year over year, revenue and earnings well ahead of guidance. Quarter of a billion of free cash flow. So we were extremely pleased with that performance. I would say, you know, as you mentioned, we've been through a cycle, but it hasn't been a uniform cycle. Our premium brands, Mercury Marine, you mentioned Sera, Boston Whaler, and our core brands have held up extremely well. Well, we've seen a bit more pressure is in the value part of our portfolio where, well, people are a little bit more influenced by, for example, retail interest rates. But overall, we definitely see good sentiment and good demand, particularly in the premium and core parts of our business. What kind of benefits do you get from being the biggest? I was looking at the RV screen on the Bloomberg relative value and you pretty much tower over your competition. You have a market cap of more than $4 billion. By a large margin, you sell the most recreational boats by unit. Everybody knows your brands are household names, bay liner, crest liner low are some of the others. And there are more and more. I think you have half of the outboard engine market with mercury. So we do. What kind of benefits do you get from that scale, Dave? Well, a lot of different benefits. For example, you know, we're really in our own ecosystem, if you like. We have a lot of internal sales to and from different parts of our business, our mercury outboard engines, for example, you mentioned get sold to our Sierra and Boston Whaler and Ballina and other brands. We also have Freedom Boat Club, which is our subscription boating model that takes engines and boats from our own businesses and puts them into that model. So really a lot of ecosystem benefits, but scale, you know, helps with pretty much everything. It helps us in negotiations, it helps us with absorption, it helps us be resilient. One of the important things that differentiates our business versus some others in the leisure and recreation center sector is our earnings power. In our recurring revenue businesses, we have very large parts and accessories, aftermarket, repower and subscription businesses that actually account for about 60% of our earnings. And they are really not as indexed to the new boat market as our Newport sales, for example, but depend more on boating participation. And actually, interestingly, even though new boat sales of decline since COVID boating participation is actually up. So if people have a boat, they are using it, they are enjoying it. I was on a lake on Saturday and Sunday last weekend. You could see plenty of people out there enjoying what has become, you know, pretty nice weather in the in the late part of the summer. So if they're using it, they're generating a need for Penny. They're using their Freedom Boat Club, for example. So we're excited about that participation part of our business. So boating participation rates still expanding healthily there. I do want to talk, Dave, about what you said on your July 24th conference call. You mentioned that retail conditions, they had improved in July versus the early part of the year, but has that continued? It's an uneven economy out there. Of course. I feel like the boating community is pretty motivated. But even still, have you been able to build on that momentum? Yes, we have. Since July, really, conditions have improved and I think a number of things have stabilized. I think sentiment and confidence has stabilized since probably early April. Overall, obviously, we've seen the equity market rebound significantly. So I think people are just feeling somewhat more confident and that is particularly come through, as I mentioned, in the premium and core parts of our market in the value part of the market are still relatively high, interest rates are still a bit of a deterrent, keeping some people on the sidelines. But we're doing everything we can to overcome that with promotions, for example, and it's beginning to work. So overall, I'm pleased with the overall trajectory of the year at the moment. I know you make most of your product in the US, Dave, but I wonder how tariffs impact you. We've heard from automakers like Ford, they make most of their products in the US as well, but they're still paying tariffs on the steel and the aluminum, the import, obviously auto parts, they get the magnets from China. You have to use all that stuff, too. How is it affecting your margins? Yeah, so you're exactly right. We make about 75% of all the products we make in the US, about 70% of our supply chain is in the US. We have more than that. We have operations in more than 20 states. So we're very much a US manufacturer, but we certainly do have a global supply chain were exposed, you know, about 4 to 5% of our supplies from China and obviously we're paying tariffs on that in our earnings material. We really talked about tariffs in four different ways. We talked about our exposure, which we're working down over time. About 4 to 5% of exposure we have right now is probably going to be about 2% by the end of next year. We talked about the actions that we're taking to mitigate the tariffs, which we're being very effective at. We talked a bit about the effect of the initial tariff announcements on demand, which has since alleviated, as I mentioned. But the other thing we talked about is the fact that we we really are the only domestic manufacturer, particularly of outboard engines, and we do have very high market share in the high forties to 50%. Our other our competitors are Japanese. And so in the long term we feel that we're kind of foundationally well positioned in an environment of more persistent tariffs. In the meantime, in the interim, though, we're doing everything we can to reduce our exposure in a lot of different ways, a lot of smart ways, I think. And our our organization is being very effective. Hey, Dave, just one question on the kind of boats you make. And as you said, you dominate in market share the classes in which you play. But we were talking with Steve Monette over. Malibu. Last week. And they rule the roost when it comes to inboard, you know, wakeboard, towing boats, water ski towing boats. Why don't you play in that in that sector? We do a little. We have a business called Heyday, which plays in the valley part of that sector. But if you think about the overall boating market in the U.S. being something in the range of 150000 to 200000 powerboats every year, the tow market is quite small, so only about 10,000 units. And so obviously mercury plays a little in that space, but it is not a space that we're heavily indexed to. Interestingly, we did by flight, which is an e-file company that does electric surfing, electric surfboards, if you like, electric foiling surfboards, which is an exciting way to go surfing without the need for surf boats. So, you know, we were finding, I think, smart ways to give people what they want in on water experiences without necessarily having to be the OEM in every segment.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "different parts",
      "weight": 0.070125185
    },
    {
      "name": "market share",
      "weight": 0.06529596
    },
    {
      "name": "new boat sales",
      "weight": 0.06311296
    },
    {
      "name": "boating participation rates",
      "weight": 0.05854417
    },
    {
      "name": "water ski towing boats",
      "weight": 0.057852793
    },
    {
      "name": "surf boats",
      "weight": 0.056559544
    },
    {
      "name": "boats",
      "weight": 0.05590219
    },
    {
      "name": "boating participation",
      "weight": 0.055302553
    },
    {
      "name": "COVID boating participation",
      "weight": 0.054551106
    },
    {
      "name": "tariffs",
      "weight": 0.054488625
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97607421875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.96142578125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.78564453125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.71630859375
    }
  ],
  "sentiment": {
    "positive": 0.60302246,
    "negative": 0.10576629,
    "neutral": 0.2912113
  },
  "summary": "Bronfield Corporation, a manufacturer of recreational boats, has reported a record year over year, revenue and earnings well ahead of guidance. The company, which has a market cap of over $4 billion and sells the most recreational boats by unit, is experiencing strong demand in premium and core parts of its business. Despite a period of low interest rates impacting the value part of the portfolio, the company has seen good demand and sentiment in premium parts of their business. The firm's scale and ability to adapt to fluctuating retail interest rates and fluctuating market conditions have also benefited the company. Despite the decline in new boat sales since COVID, boating participation is actually increasing, with boating activity expanding healthily. Despite some challenges, Brunswick has been able to build on this momentum and is optimistic about building on it through promotions and ongoing work to overcome issues such as high interest rates. However, tariffs on steel and aluminum imports are impacting the company's margins.",
  "shortSummary": "Brunnow's outlook for the next few years looks promising, driven by improving retail conditions, strong earnings, and strong boating participation, despite challenges from rising fuel prices and global economic conditions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d3f074e9256940a5bafa8bbf5a31f60b",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Brunswick’s Q2 earnings surpassed guidance, with revenue and earnings up and $0.5 billion of free cash flow generated. The company’s dominant market share in premium and core boating brands, combined with an ecosystem of engines, boats, and subscription services, drives resilience and 60% of earnings from recurring revenue. Boating participation remains strong despite a decline in new boat sales, and improved retail sentiment and promotions are helping to offset high interest rates, while tariffs on a small portion of the supply chain are being mitigated. Brunswick focuses on its core segments, maintains a U.S.-centric manufacturing base, and explores niche markets such as electric surfboards rather than expanding into low‑volume towboat categories.",
  "argos_id": "ZRL3L4K54"
}