{
  "url": "https://www.foxnews.com/entertainment/taylor-swifts-music-gave-travis-kelce-roadmap-how-her-perfect-boyfriend",
  "authorsByline": "Lori Bashian",
  "articleId": "0684ba1fe82b4a088828fbebc0c9e105",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/07/931/523/taylor-swift-travis-kelce-on-boat.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T14:46:26-04:00",
  "addDate": "2025-08-14T18:58:39.483219+00:00",
  "refreshDate": "2025-08-14T18:58:39.483220+00:00",
  "score": 1.0,
  "title": "Taylor Swift's music gave Travis Kelce a roadmap on how to be her perfect boyfriend",
  "description": "While appearing on Travis and Jason Kelce's podcast, \"New Heights,\" Taylor Swift and Travis talked about the early days of their relationship and how the Eras Tour brought them together.",
  "content": "Taylor Swift gave Travis Kelce all the clues he needed on how to be her ideal man.The 35-year-old Grammy Award-winning singer made her podcast debut when she appeared on Travis and Jason Kelce's podcast, \"New Heights\" on Wednesday. When asked why she chose to appear on the podcast, she joked, \"This podcast got me a boyfriend ever since Travis decided to use it as his personal dating app.\" She continued, \"This dude didn't get a meet-and-greet, and he's making it everyone's problem. That's what I thought at first... You realize he didn't even reach out to our management. He came with Pat [Mahomes] and he thought that because he knows the elevator lady, that he could talk to her about just getting down to my dressing room.\"Travis, however, credits the Eras Tour for getting them together, saying had he not gone to the show \"and been mesmerized\" by her on stage, \"and then left with such a desire to want to meet you,\" he would never have spoken about her on the podcast, which is what ultimately led to their relationship. He also shared how being at the show helped figure out how to win her over.TAYLOR SWIFT AND BOYFRIEND TRAVIS KELCE'S SHARED MORAL VALUES SPARKED ORGANIC LOVE STORY\"I was sitting there at the Eras Tour listening to every single one of those songs being like, ‘I know exactly what she wants me to do,'\" he said. \"I'm the luckiest man in the world.\"Travis famously spoke about seeing Swift in concert on a July 2023 episode of the podcast, and expressed disappointment that he wasn't able to give her a friendship bracelet he had made with his phone number on it. They began dating soon after, and that fall, she was seen at her first Kansas City Chiefs game – the rest is history.Swift found Travis' gesture to be \"wild,\" but admitted, \"I'm glad it worked.\"\"I was like, 'If this guy's not crazy, this is sort of what I've been writing songs about wanting to happen to me since I was a teenager,'\" she said.Swift explained that after Travis \"did the full send on the podcast,\" different people in her life began \"whispering in my ear about you,\" and telling her what a great guy he is.  She went on to say the whole situation made her feel like she \"was in an ‘80s John Hughes movie\" with someone \"standing outside of my window with a boombox saying, ‘I want to date you!’\"Since they met and began their relationship while she was on tour, a lot of their early relationship moments were spent in foreign countries, but Swift is happy to have some normalcy back in her life.\"We got to travel the world and have vacations and adventures when I wasn't on stage, which was really fun, because Europe was so fun, Australia's amazing, it was great,\" she said. \"I was on tour for so long, and now I'm finally not on tour, and it's kind of great, because I'm getting my hobbies back.\"LIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWSAside from singing and songwriting, her many hobbies are what she considers to be \"granny s---,\" which includes sewing, cooking and painting.\"I'd say all my hobbies could be categorized as hobbies you could have had in the 1700s,\" she explained. \"I have a different baking obsession every six months. Right now, we're very deep in a sourdough obsession that has taken over my life.\"\"I'm always baking bread and texting my friends like, 'Can I send you some bread? I need some feedback. Do you like this one better than you like the other one? I did the rise a little differently,'\" she later added. \"I'm on sourdough blogs. There's a whole community of us, and I didn't know it.\"Both Jason and Travis seem to be enjoying her sourdough phase, with Travis calling himself \"a lucky man,\" and Swift revealing he requested she send him two loaves while he was at training camp. It seems like Travis has even gotten in on the action, with Swift proudly stating he's also baked his own loaf, and, much to Jason's disbelief, it came out good.CLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\"His rose higher than mine,\" she said about Travis' bread. \"His was actually more delicious than mine.\" Swift also announced the release of her upcoming 12th studio album, \"The Life of a Showgirl,\" which is set to drop on October 3.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/newsletters",
    "https://www.foxnews.com/entertainment/taylor-swift-screams-eras-tour-concert-security-guard-stop-harassing-fan",
    "https://www.foxnews.com/apps-products",
    "https://www.foxnews.com/category/person/taylor-swift",
    "https://www.youtube.com/watch?v=M2lX9XESvDE&list=RDM2lX9XESvDE&start_radio=1",
    "https://www.foxnews.com/category/food-drink/recipes/techniques/baking",
    "https://www.foxnews.com/entertainment/taylor-swift-stuns-showgirl-new-album-cover",
    "https://www.foxnews.com/video/6376843447112",
    "https://www.foxnews.com/sports/taylor-swift-reveals-she-screamed-about-chiefs-drafting-xavier-worthy-she-became-football-obsessed",
    "https://www.foxnews.com/entertainment",
    "https://www.foxnews.com/entertainment/taylor-swift-boyfriend-travis-kelces-shared-moral-values-sparked-organic-love-story"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Travis Kelce",
      "weight": 0.08390164
    },
    {
      "name": "Travis",
      "weight": 0.07409593
    },
    {
      "name": "Taylor Swift",
      "weight": 0.07141875
    },
    {
      "name": "Swift",
      "weight": 0.0698875
    },
    {
      "name": "Jason Kelce",
      "weight": 0.06267361
    },
    {
      "name": "Kansas City Chiefs",
      "weight": 0.049916737
    },
    {
      "name": "hobbies",
      "weight": 0.049133148
    },
    {
      "name": "Travis and Jason Kelces podcast",
      "weight": 0.046675295
    },
    {
      "name": "different people",
      "weight": 0.04586293
    },
    {
      "name": "MORE ENTERTAINMENT",
      "weight": 0.045824748
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9951171875
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.919921875
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.66650390625
    }
  ],
  "sentiment": {
    "positive": 0.17455366,
    "negative": 0.44049162,
    "neutral": 0.38495478
  },
  "summary": "Taylor Swift, a Grammy Award-winning singer, gave Travis Kelce a guide on how to be her ideal boyfriend. She made her podcast debut on Travis and Jason Kelce's podcast, \"New Heights,\" and joked that the podcast got her a boyfriend after Travis used it as his personal dating app. The pair began dating soon after their relationship. Travis credits the Eras Tour for their success, stating that he would never have spoken about Swift on the podcast. Swift also revealed that her many hobbies include baking, cooking, and painting. She will release her upcoming 12th studio album, \"The Life of a Showgirl,\" which is set to drop on October 3.",
  "shortSummary": "Taylor Swift's music and her tour have led to her relationship with Travis Kelce, who credits them for their blossoming relationship.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "279ac62047d34bbb9a034047482247fb",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/entertainment/taylor-swift-screams-eras-tour-concert-security-guard-stop-harassing-fan",
      "text": "Bad blood was percolating in the Philadelphia stratosphere at Taylor Swift's Eras Tour on Saturday night.\nPerforming her second of three shows at Lincoln Financial Field in Philadelphia, Swift's lively concert was interrupted by a disturbance off-stage.\nWhile performing her hit song \"Bad Blood,\" Swift could be heard yelling at an unknown individual, \"She's fine. She wasn't doing anything!\"\nAs the song builds to the chorus, Swift grows more agitated, yelling, \"Hey! Stop!\"\nTAYLOR SWIFT SPEAKS OUT AFTER INJURING HERSELF DURING ERAS TOUR: 'IT WAS MY FAULT COMPLETELY'\nFox News Digital spoke to a fan at the concert, who detailed their confusion of the situation.\n\"As Swifties we were confused whether it was part of the song or not because of the nature of the song,\" she explained of the hit track off Swift's 1989 album.\n\"But we knew something was off, especially because Taylor doesn't speak to her fans that way.\"\nA representative for Swift did not immediately return Fox News Digital's request for comment.\nThe 12-time Grammy Award winner uttered one final \"Stop\" before strutting across the stage and continuing on with her set. She never addressed the incident, although video of the contentious moment went viral on social media.\nFans immediately defended Swift, explaining she was yelling at a security guard in an effort to protect her fans.\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\nPeople on social media were eager for the fan to come forward and explain exactly what happened.\nIn a video shared to her friend's TikTok account, Maryland resident Kelly Kelly revealed she was the fan Swift was protecting.\n\"Basically, the guard had been harassing our group all night… He just kept telling us not to touch the rail, and like every time we did anything, he was like on top of us,\" she began.\n\"We're dancing, we're having fun, and he didn't like it,\" she continued. \"Taylor noticed that I was having fun and that he didn't like it, and she didn't like it. And then he basically like got escorted out, and then they offered us free tickets for tonight.\"\nCLICK HERE TO GET THE FOX NEWS APP\nThe video quickly amassed more than 1 million likes, prompting Kelly to create her own account and thank Swift for standing up for her.\nKelly also spoke to GMA about the incident, explaining that she and her friends had front row seats at the concert.\n\"He kept telling me to stop. He kept telling me to like calm down and not to dance,\" she recalled of the moment. \"And I guess she noticed and she yelled at him and told him to leave me alone and that I wasn't doing anything wrong.\"\nThe next leg of Swift's tour will be at Gillette Stadium in Foxborough, Massachusetts."
    },
    {
      "url": "https://www.foxnews.com/entertainment/taylor-swift-stuns-showgirl-new-album-cover",
      "text": "Taylor Swift was still bejeweled as she released the sparkling cover of her new album, \"The Life of A Showgirl.\"\nSwift, 35, revealed the artwork for her 12th catalog, which included showstopping images of the singer dressed to the nines like one of Las Vegas' finest entertainers.\nThe global popstar appears to be near drowning on the cover, and she included a 12-set tracklist with the new drop.\nTAYLOR SWIFT ANNOUNCES TS12 ALBUM ‘THE LIFE OF A SHOWGIRL’ ON TRAVIS KELCE PODCAST\n\"And, baby, that’s show business for you,\" Swift captioned an Instagram post revealing the art. \"New album The Life of a Showgirl. Out October 3.\"\nTAYLOR SWIFT AND BOYFRIEND TRAVIS KELCE'S SHARED MORAL VALUES SPARKED ORGANIC LOVE STORY\nShe appears to be nearly submerged in water while wearing a sparkling outfit on the album cover, which featured the title in glittering orange letters.\nSwift slipped into another sultry showgirl ensemble complete with feathers and a black wig for one of the images captured by Mert Alas & Marcus Piggott.\nAPP USERS CLICK HERE TO VIEW POST\nAnother image featured Swift sprawled across chairs wearing a sequined corset number with matching knee-high boots and a pair of nude fishnets.\nThe pop star also made an appearance on her boyfriend Travis Kelce's podcast Wednesday. Travis and his brother Jason gave fans a hint earlier Monday morning after posting their podcast would return from hiatus early for a \"VERY\" special guest. Only the guest's silhouette was shown at the time, but fans immediately guessed Swift.\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\nTaylor detailed the 12-track setlist on the podcast, and revealed song names, including \"The Fate of Ophelia,\" followed by \"Elizabeth Taylor,\" \"Opal Light,\" \"Father Figure,\" \"Eldest Daughter,\" \"Ruin the Friendship,\" \"Actually Romantic,\" \"Wi$h Li$t,\" \"Wood,\" \"CANCELED!,\" \"Honey,\" and \"The Life of A Showgirl\" featuring Sabrina Carpenter.\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\nSwift's appearance on \"New Heights\" marks the first time the pop star has given an interview since she was named TIME's Person of the Year in 2023.\nAt the time, Swift and Travis had just begun dating, and she spoke about their budding romance for the first time publicly. The two first sparked romance rumors in September 2023 after Swift appeared at one of Travis' NFL games with his family. Shortly before, Travis had tried to give Swift a friendship bracelet with his phone number on it at one of her concerts.\nFox News Digital's Lauryn Overhultz contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/sports/taylor-swift-reveals-she-screamed-about-chiefs-drafting-xavier-worthy-she-became-football-obsessed",
      "text": "Taylor Swift opened up about how she went from only being involved in sports strictly to further her music career to going wild when the Kansas City Chiefs selected Xavier Worthy in the draft.\nSwift appeared on Travis and Jason Kelce’s podcast, \"New Heights,\" for the first time Wednesday night and, in between talking about their love story, the pop music icon talked about getting to know what professional football was all about.\nShe recalled asking Travis on their first date what it was like when he faced his brother in the 2023 Super Bowl but didn’t realize they technically weren’t on the field against one another at the same time.\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\n\"Jason, on our first date, I legitimately asked him what it was like when the Chiefs played the Eagles in the Super Bowl, and he looked across the field across the line of scrimmage and saw his brother standing on the other, like five feet in front of him on the field,\" she said.\n\"He didn’t even look at me. Like, I now know what an insane question that was. … I thought everyone was on the field at the same time. I thought it was like Jared Goff is here, and Josh Allen is here, and they blow a whistle. And they go at each other, and they’re like, ‘Who’s going to win?’\" she added, describing how she thought quarterbacks squared off in a one-on-one matchup.\nFrom there, Swift said she started to learn certain defensive schemes and went wild when the team drafted Worthy No. 32 overall in 2024.\nTAYLOR SWIFT STUNS AS SHOWGIRL ON NEW ALBUM COVER AS RELEASE DATE IS ANNOUNCED\n\"I didn’t know what a first down was. I didn’t know what the chains were. I didn’t know what a tight end was. … Oh my God, I fell in love with it. I became obsessed with it. I became a person who was running through the halls of my house screaming, ‘We drafted Xavier Worthy!’ My friends are like, 'Who body-snatched you? What do you mean we drafted Xavier Worthy?\"\nEven Travis expressed skepticism when she was going wild about Worthy when he didn’t even know who the team had drafted.\n\"I was so excited. I couldn’t believe it,\" she added.\nLater in the show, Swift said her only interaction with spots was when she sang the national anthem at football games.\nTAYLOR SWIFT AND BOYFRIEND TRAVIS KELCE'S SHARED MORAL VALUES SPARKED ORGANIC LOVE STORY\n\"My relationship with sports was like, you know, I grew up in Pennsylvania. I always heard my dad yelling at the screen watching Eagles games. That was always the sports sounds that I heard in my house,\" she said. \"However, I was up in my room, playing guitar, learning instruments, playing piano. I was focused on different things. I was so laser-focused on music, and that’s how it was in school.\n\"I would go to sporting events so I could sing the national anthem. Everything was a means to an end to get me to do music. I know every halftime show from the Super Bowls, but I didn’t watch the sports.\"\nTravis took credit for Swift being \"engulfed\" by football in an interview with GQ Magazine.\nCLICK HERE TO GET THE FOX NEWS APP\n\"I definitely became obsessed with sports when it came to him,\" she added. \"I’m competitive on his behalf, but if you and me are gonna go against each other in something athletic, I’m gonna let you win because I don’t see what the points even mean. I’m a fan of athletics and the sports. If I’m doing the sports, I’m throwing like this because I don’t really care where it’s supposed to go.\"\nFollow Fox News Digital’s sports coverage on X and subscribe to the Fox News Sports Huddle newsletter."
    },
    {
      "url": "https://www.foxnews.com/category/food-drink/recipes/techniques/baking",
      "text": "Food-Drink June 19 Costco customers campaign for return of beloved $1 treat despite new food court offerings Some Costco customers are longing for the return of the $1 food court churro, sparking debate about past menu items as the retailer rolls out new offerings.\nHealth June 5 Ozempic users report surprising cravings for certain smells: Here's what to know The rising trend of sweet-smelling gourmand fragrances coincides with anecdotal reports from GLP-1 weight-loss drug users experiencing new cravings for sugary scents.\nCelebrity Chefs June 4 Celebrity chef planning pop-up bakery at historic 16th century home, documents show Jamie Oliver, celebrity chef, proposes a pop-up bakery at Spains Hall, a Grade I-listed site, ensuring minimal impact on heritage while offering baked goods and coffee for a month.\nFood-Drink May 31 Archaeologists unearth ancient bread that survived underground for 5,000 years A rare 5,000-year-old bread loaf was recently found in Turkey's Eskisehir province. Preserved by burning, it's now recreated by bakers using ancient grains.\nFood-Drink May 12 Common household spice may interfere with medicines, study suggests Cinnamon consumption in large amounts could interfere with medication effectiveness, according to recent research. A study examines health implications and differences between cinnamon types.\nFood-Drink May 8 Protein-packed American-grown rice alternative has twice the amount as quinoa American-grown heritage grain sorghum offers twice the amount of protein content as quinoa and four times that of rice while being drought-tolerant and gluten-free.\nFood-Drink April 5 From bomb squad to baker and coffee maker: Former deputy crushes a new business A Navy veteran and former Florida deputy who once diffused bombs is now owner of a bakery and coffee shop. Fox News Digital spoke to a man who has dedicated his life to serving people.\nFood-Drink March 8 Birthday 'bunion cake' shaped like foot wows woman after her surgery A woman's video went viral after she shared a bunion-themed birthday cake that friends made to celebrate her birthday. She had just had foot surgery — and was happy to celebrate its completion.\nDessert Recipes March 1 Recipe for devil's food cake has important family connection for chef James Beard-nominated chef Gregory Leon of Milwaukee, Wisconsin, revealed to Fox News Digital why he makes his mother's devil's food cake recipe on his birthday each year.\nFood February 21 High egg prices putting a pinch on Louisiana bakeries ahead of Mardi Gras Egg prices have hit an all-time high and small businesses are feeling the sticker shock. One baker says this is the busiest time of year as people are looking to get their hands on a king cake.\nVIDEO February 16 Brothers make recipe app inspired by their grandmother Brothers Zach and Matthew Mashaal describe the events that led to the creation of \"Make It Like Mama,\" a new mobile app designed to preserve family recipes.\nVIDEO January 18 Founder of nut butter company says ingredients are made in America Indiana mother Lea Hurley, founder of American Dream Nut Butter, tells Fox News Digital how her company's products are \"from America and not outsourced.\"\nFood-Drink January 16 Egg prices soar: 6 suitable food substitutes to consider A registered dietitian shares thoughtful and healthy food alternatives that you can substitute for eggs amid today's rising prices. These suggestions won't break the budget.\nFood-Drink January 8 Girl Scouts say 2 cookie flavors will be retired after 2025 Girl Scout Cookie season began on Jan. 7, and with that came the news that two cookie varieties will not be sold after this year. Girl Scout cookies have been sold for over a century.\nFood-Drink December 24 Why do we leave Christmas cookies for Santa? Chef unwraps the tradition How did families come to leave cookies and milk for Santa Claus on Christmas? A celebrity chef told Fox News Digital how the tradition got its start and why a chocolate chip cookie is the best.\nDessert December 23 America's favorite Christmas cookie searches revealed by Google Trends Google Trends compiled data from across the United States to determine which Christmas cookie is the most uniquely searched for in each state. Some of these may be surprising.\nHoliday December 21 Easy recipe for doughnuts this Hanukkah Cookbook author Jamie Geller tells Fox News Digital why sufganiyot, a version of jelly doughnuts, are eaten during Hanukkah. Plus, a recipe on how to make them at home.\nVIDEO December 21 Jamie Geller's sufganiyot in a bag recipe for Hanukkah Jamie Geller shares her simple recipe for making sufganiyot, a jelly doughnut-like treat eaten during Hanukkah.\nDessert December 19 Most popular Christmas desserts by state revealed in new study An examination of Google Trends data identified the most popular Christmas dessert in each U.S. state, and the top result may come as a surprise to some.\nRecipes December 18 3 Christmas cookie exchange gift ideas for nearly every diet With Christmas cookie exchange and parties happening, here are three recipes that are bound to make most people happy. There are sesame ginger snaps, biscotti and vegan sugar cookies.\nDessert December 8 Arkansas dessert with an animal in its name is award-winning treat with 'no possum included' The Possum Pie is the Natural State's signature dessert with an animal in its name but not in the ingredients. Fox News Digital spoke to an Arkansas baker who describes what's actually in it.\nFood-Drink December 4 Bakery honors Christmas by recreating Nativity scene: 'Bread of life made from bread' This Christmas season, a bakery in England has created a Nativity scene almost entirely made of bread. Baby Jesus, plus Mary and Joseph, are all represented in the display.\nVIDEO November 26 Thanksgiving turkey-cooking tips from award-winning chef James Beard Award-winning chef Todd English tells Fox News Digital how he likes to cook a Thanksgiving turkey.\nVIDEO November 24 Enjoy some skin with your Thanksgiving turkey, 'Cooking with Darryl' creator says Darryl Postelnick of \"Cooking with Darryl\" tells Fox News Digital how a brine of milk and buttermilk makes a \"golden brown\" skin on your Thanksgiving turkey.\nRecipes November 23 This popular soda is chef's surprising biscuit ingredient: 'Family favorite' Chef Melissa Martin's biscuits have an unexpected ingredient: 7-Up soda. She shared the recipe adapted from her new cookbook with Fox News Digital.\nDeals November 18 6 baking essentials recommended by cake influencer Natalie Sideserf Natalie Sideserf, professional realistic cake maker, recommends some must-have baking products every baker needs.\nVIDEO November 17 The best tips for baking bread Chef Eric Levine, owner of 317 Main Street, shares his tips and tricks to making homemade bread on 'Fox & Friends Weekend.'\nFood-Drink November 17 San Francisco's sourdough is 'culinary symbol' and part of 49ers culture San Francisco's longest continuously operating company, Boudin Bakery, makes one of its most iconic foods: sourdough bread. Even the 49ers mascot is named Sourdough Sam.\nDessert November 16 What is a Charlotte Russe cake? Dessert's surprising history What is a Charlotte Russe? The pastry confection has been in the news this week after Whoopi Goldberg claimed a bakery refused to make this for her birthday due to politics.\nBaking November 12 How to make artisan bread if sourdough is too much of a commitment Making sourdough bread at home has become a popular social media trend, but perfecting a loaf can be difficult and time consuming. Artisan bread is a great alternative for beginners."
    },
    {
      "url": "https://www.foxnews.com/apps-products",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/entertainment/taylor-swift-boyfriend-travis-kelces-shared-moral-values-sparked-organic-love-story",
      "text": "Travis Kelce opened up about his \"organic\" love story with global pop star Taylor Swift.\nIt's been nearly two years since Swift shocked the world by showing up to a Kansas City Chiefs game decked out in red and gold. Now, Kelce is sharing how the two fell in love, despite the media frenzy that has followed the famous couple's every move.\n\"Whenever I’m with her, it feels like we’re just regular people,\" the NFL star told GQ. \"When there is not a camera on us, we’re just two people that are in love. It can be perceived as something else because of how much it is talked about and how much we are tracked whenever we do go out, but I would say that it’s as normal of…. It happened very organically even though from a media standpoint it was being tracked. It still happened very organically.\"\n\"Nothing I’ve ever done has been a controlled, organized process. When I say it was so organic, we fell in love just based off the people we were sitting in a room together with. We are two fun-loving people who have the morals to appreciate everyone for who they are. We share all those values. It kind of just took the f--- off.\"\nTAYLOR SWIFT ANNOUNCES TS12 ALBUM ‘THE LIFE OF A SHOWGIRL’ ON TRAVIS KELCE PODCAST\nWatching Swift over the past two years led Kelce to believe the two actually have a lot in common.\n\"I hadn’t experienced somebody in the same shoes as me, having a partner who understands the scrutiny, understands the ups and downs of being in front of millions,\" he explained to the outlet. \"That was very relatable, seeing how exhausted she would get after shows. She may not think of herself as an athlete. She will never tell anyone that she is an athlete. But I’ve seen what she goes through. I’ve seen the amount of work that she puts on her body, and it’s mind-blowing.\"\n\"To go out on a stage, on a computer, essentially, for three hours. The [Eras Tour] floor is literally – I’ve seen underneath that thing. It is a football-field-sized computer. You take that into Singapore, where it is scorching hot, and all of a sudden you’re feeling the fumes from the computer and you’re feeling the fumes from the sun and you’re doing a show for three hours with a lot of energy, bringing it every single song. That is arguably more exhausting than how much I put in on a Sunday, and she’s doing it three, four, five days in a row.\"\nFor Kelce, Swift has the morals and values he's always looked for in a partner. Some even mirror the values of his mom, Donna Kelce.\n\"Their kindness, their genuineness, their ability to say hello to everyone in the room,\" the football star listed when asked what the two share specifically. \"Their ability to show love and support no matter what. And on top of that, their work ethic. I saw my mother reach goals that she had set for herself, go from being a teller to working all the way up in the KeyBank building.\"\n\"I’ve seen Taylor do the exact same thing of setting goals for herself and exceeding the expectations and really captivating the world in that regard.\"\nSwift and Kelce first sparked romance rumors in September 2023 after Swift appeared at one of Travis' NFL games with his family. Shortly before, Travis had tried to give Swift a friendship bracelet with his phone number on it at one of her concerts.\n\"This all started when Travis very adorably put me on blast on his podcast, which I thought was metal as h---,\" she told TIME in 2023. \"We started hanging out right after that. So we actually had a significant amount of time that no one knew, which I’m grateful for, because we got to get to know each other. By the time I went to that first game, we were a couple. I think some people think that they saw our first date at that game? We would never be psychotic enough to hard launch a first date.\"\n\"When you say a relationship is public, that means I’m going to see him do what he loves, we’re showing up for each other, other people are there and we don’t care,\" Swift added. \"The opposite of that is you have to go to an extreme amount of effort to make sure no one knows that you’re seeing someone. And we’re just proud of each other.\"\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\nThe couple instantly had to deal with a level of fame that was likely normal for Swift, but not for Kelce. The NFL superstar was now dealing with paparazzi at his home in Kansas City along with constant speculation on the couple's relationship status.\n\"I’ve never dealt with it,\" he told The Wall Street Journal. \"But at the same time, I'm not running away from any of it ... The scrutiny she gets, how much she has a magnifying glass on her, every single day, paparazzi outside her house, outside every restaurant she goes to, after every flight she gets off, and she’s just living, enjoying life. When she acts like that, I better not be the one acting all strange.\"\nAt the time, Kelce admitted getting to know Swift was \"mind-blowing.\"\n\"I’ve never been a man of words. Being around her, seeing how smart Taylor is, has been f------ mind-blowing. I’m learning every day.\"\nAs their relationship has grown, Swift and Kelce have continued to support each other over the past two years, with the NFL star attending multiple concerts of the pop star's billion-dollar \"Eras Tour.\" Kelce even appeared on stage during one of Swift's tour stops in London.\nSwift has also made an appearance at both of Kelce's Super Bowl games in the last two years. In 2024, the NFL tight end shut down skeptics of the couple's relationship during the pre-game interview.\n\"You’re all crazy,\" he told CBS when asked what he'd say to people who didn't believe their love was real. \"Every last one of you, you’re crazy.\"\n\"It’s been nothing but fun,\" Kelce said at the time. \"We’ve both been learning about this lifestyle knowing that I brought her into the football world.\"\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\nSwift is also jumping into Kelce's podcast world by making an appearance on \"New Heights\" to announce her 12th studio album, \"The Life of a Showgirl.\"\nTravis and his brother Jason revealed Swift would be joining them on Aug. 13 after announcing a \"VERY\" special guest.\nAPP USERS CLICK HERE TO VIEW THE INSTAGRAM POST\nThe NFL brothers later shared a teaser clip featuring a flirty Swift and Kelce. The \"Midnights\" singer noted that blue looked good on the Kansas City Chiefs star. \"Yes, I know,\" Travis responded. \"It's the color of your eyes, sweetie. It's why we match so well.\""
    },
    {
      "url": "https://www.foxnews.com/category/person/taylor-swift",
      "text": "Taylor Swift has amassed global stardom with her hit songs that are loved by listeners around the world.\nBorn on December 13, 1989 in West Reading, Pennsylvania, Swift began as a country music artist before pivoting to pop.\nSongs like “Love Story,” “You Belong With Me,” “We Are Never Ever Getting Back Together,” “I Knew You Were Trouble” and “Shake It Off” are among Swift's most popular songs.\nHer fan base, known as the Swifies, are extremely loyal to the star, and dish out hundreds, even thousands of dollars to witness Swift's high-production concerts. Swift’s concerts are in such high demand that Ticketmaster shut down due to the volume of fans attempting to buy tickets for her “Eras” tour that took place through much of 2023 and continues in 2024.\nSwift has broken many records and earned countless awards for the music she has released over the years. In 2024, she became the first artist to win album of the year four times when she took home the award for “Midnights.” During her acceptance speech, she announced her newest album,”The Tortured Poets Department” coming out in April.\nSwift’s enormous level of fame has made many interested in her personal life, such as who the star is dating. She became all the buzz in the sports world when she began dating Kansas City Chiefs tight end Travis Kelce in September 2023.\nSince dating the football pro, she has had a frequentpresence at his NFL games, causing Swifies to tune in and attend the games as well. This has brought new fans, and lots of money to the league."
    }
  ],
  "argos_summary": "Taylor Swift made her podcast debut on the 'New Heights' podcast hosted by Travis and Jason Kelce, where she humorously discussed her relationship with Travis, crediting their connection to his attendance at her Eras Tour. The couple shared insights into their romance, highlighting their shared values and how they navigate the scrutiny of fame together. Swift also announced her upcoming album, 'The Life of a Showgirl,' set to release on October 3, while reflecting on her newfound interest in football and her hobbies like baking.",
  "argos_id": "06K0MW1KS"
}