{
  "url": "https://www.latimes.com/world-nation/story/2025-08-13/israeli-gunfire-kills-at-least-25-in-gaza-as-netanyahu-says-he-will-allow-palestinians-to-leave",
  "authorsByline": "Melanie Lidman and Samy Magdy",
  "articleId": "b76c5d53f9784c05986803ebbff733f4",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/d5cce3d/2147483647/strip/true/crop/4676x2455+0+331/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F75%2F54%2F0c0cdc70e6606c24ad2dca52c6df%2F4b327e244bbd498c91cf637c4512015d",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T14:06:00.405000+00:00",
  "addDate": "2025-08-13T14:14:03.957778+00:00",
  "refreshDate": "2025-08-13T14:14:03.957780+00:00",
  "score": 1.0,
  "title": "Israeli gunfire kills at least 25 in Gaza as Netanyahu says he will allow Palestinians to leave",
  "description": "Health officials and witnesses say Israeli gunfire has killed at least 25 people while seeking aid",
  "content": "Israeli soldiers use binoculars to look at damaged buildings in the Gaza Strip, from southern Israel, Wednesday, Aug. 13, 2025.\n\nIsraeli gunfire killed at least 25 people seeking aid in Gaza on Wednesday, health officials and witnesses said, while Prime Minister Benjamin Netanyahu said Israel will “allow” Palestinians to leave during an upcoming military offensive in some of the territory’s most populated areas.\n\nNetanyahu wants to realize President Trump’s vision of relocating much of Gaza’s population of over 2 million people through what he refers to as “voluntary migration” — and what critics have warned could be ethnic cleansing.\n\n“Give them the opportunity to leave! First, from combat zones, and also from the Strip if they want,” Netanyahu said in an interview aired Tuesday with i24, an Israeli TV station, to discuss the planned offensive in areas including Gaza City where hundreds of thousands of displaced people shelter. “We are not pushing them out but allowing them to leave.”\n\nWitnesses and staff at Nasser and Awda hospitals, which received the bodies, said people were shot dead on their way to aid distribution sites and while awaiting convoys entering Gaza. Israel did not immediately respond to a request for comment.\n\nEfforts to revive ceasefire talks have resumed after apparently breaking down last month. Hamas and Egyptian officials met Wednesday in Cairo, according to Hamas official Taher al-Nounou.\n\nIsrael has no plans to send its negotiating team to talks in Cairo, the prime minister’s office said.\n\nIsrael’s plans to widen its military offensive against Hamas to the areas of Gaza that it does not yet control have sparked condemnation and criticism at home and abroad, and could be intended to raise pressure on Hamas to reach a ceasefire.\n\nThe militants still hold 50 hostages taken in the Oct. 7, 2023, attack that sparked the war. Israel believes around 20 of them are alive. Families fear a new offensive endangers them.\n\nNetanyahu was asked by i24 News if the window had closed on a partial ceasefire deal and he responded that he wanted all of the hostages back, alive and dead.\n\nEgyptian Foreign Ministry Badr Abdelatty told reporters that Cairo is still trying to advance an earlier proposal for an initial 60-day ceasefire, the release of some hostages and an influx of humanitarian aid before further talks on a lasting truce.\n\nHamas says it will only release the remaining hostages in return for the release of Palestinians imprisoned by Israel, a lasting ceasefire and an Israeli withdrawal from Gaza. The militant group has refused to lay down its arms.\n\nIsrael and South Sudan are in talks about relocating Palestinians to the war-torn East African nation, The Associated Press reported Tuesday.\n\nThe office of Israel’s Deputy Foreign Minister, Sharren Haskel, said Wednesday she was arriving in South Sudan for a series of meetings in the first visit by a senior government official to the country, but she did not plan to broach the subject of moving Palestinians.\n\nSouth Sudan’s ministry of foreign affairs in a statement called reports that it was engaging in discussions with Israel about resettling Palestinians baseless.\n\nThe AP previously reported that U.S. and Israel have reached out to officials of three East African governments to discuss using their territories as potential destinations for moving Palestinians uprooted from Gaza.\n\nAmong those killed while seeking aid were 14 Palestinians in the Teina area approximately 1.8 miles from a food distribution site run by the Gaza Humanitarian Foundation, according to staff at Nasser hospital.\n\nHashim Shamalah said Israeli troops fired toward them as people tried to get through. Many were shot and fell while fleeing, he said.\n\nIsraeli gunfire killed five other Palestinians while trying to reach another GHF distribution site in the Netzarim corridor area, according to Awda hospital and witnesses.\n\nGHF said there were no incidents at or near its sites Wednesday.\n\nThe U.S. and Israel support GHF, an American contractor, as an alternative to the United Nations, which they claim allows Hamas to siphon off aid. The U.N., which has delivered aid throughout Gaza for decades when conditions allow, denies the allegations.\n\nAid convoys from other groups travel within 328 feet of GHF sites and draw crowds attempting to loot them. An overwhelming majority of violent incidents over the past few weeks have been related to those convoys, the GHF said.\n\nIsraeli fire killed at least six other people waiting for aid trucks close to the Morag corridor, which separates parts of southern Gaza, Nasser hospital said.\n\nU.N. says starvation at highest levels of the war\n\nU.N. spokesman Stephane Dujarric on Tuesday shared the warning from the World Food Program and said Gaza’s Health Ministry told U.N. staff that five people died over the previous 24 hours from malnutrition and starvation.\n\nThe Health Ministry says 106 children have died of malnutrition-related causes during the war and 129 adults have died since late June.\n\nThe U.N. and humanitarian partners still face significant delays and impediments from Israeli authorities who prevent the delivery of food and other essentials at the scale needed, Dujarric said.\n\nHamas-led militants abducted 251 people and killed around 1,200 people, mostly civilians, in the 2023 attack. Most of the hostages have been released in ceasefires or other deals.\n\nIsrael’s air and ground offensive has since displaced most of Gaza’s population, destroyed vast areas and pushed the territory toward famine. The offensive has killed more than 61,700 Palestinians, according to Gaza’s Health Ministry, which does not say how many were fighters or civilians but says around half were women and children.\n\nThe ministry is part of the Hamas-run government and staffed by medical professionals. The U.N. and independent experts consider it the most reliable source on war casualties. Israel disputes its figures but has not provided its own.\n\nLidman and Magdy write for the Associated Press.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/world-nation/story/2025-08-08/israel-plans-to-take-over-gaza-city-to-pressure-hamas-worries-rise-for-civilians-and-hostages",
    "https://www.latimes.com/world-nation/story/2025-08-09/israel-faces-growing-global-condemnation-over-military-expansion-in-gaza",
    "https://www.latimes.com/world-nation/story/2025-08-10/netanyahu-defends-planned-military-offensive-in-gaza-and-lashes-out-at-global-campaign-of-lies"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "southern Gaza",
      "weight": 0.07499013
    },
    {
      "name": "Gaza",
      "weight": 0.073598
    },
    {
      "name": "Gaza City",
      "weight": 0.07280958
    },
    {
      "name": "southern Israel",
      "weight": 0.069111675
    },
    {
      "name": "aid distribution sites",
      "weight": 0.06881243
    },
    {
      "name": "Israel",
      "weight": 0.066810794
    },
    {
      "name": "ceasefire talks",
      "weight": 0.06355348
    },
    {
      "name": "Palestinians",
      "weight": 0.062095083
    },
    {
      "name": "displaced people",
      "weight": 0.061951213
    },
    {
      "name": "GHF sites",
      "weight": 0.060615372
    }
  ],
  "topics": [
    {
      "name": "Crime"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.98095703125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.97802734375
    },
    {
      "name": "/News/World News",
      "score": 0.88671875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.84228515625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.6376953125
    },
    {
      "name": "/News/Other",
      "score": 0.60791015625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.35498046875
    }
  ],
  "sentiment": {
    "positive": 0.05582603,
    "negative": 0.7020317,
    "neutral": 0.24214226
  },
  "summary": "Israeli gunfire has killed 25 people seeking aid in Gaza, according to health officials and witnesses. Prime Minister Benjamin Netanyahu has stated that Israel will allow Palestinians to leave during a military offensive in some of the territory's most populated areas. This follows President Trump's vision of relocating much of Gaza's population through voluntary migration, which critics have warned could be ethnic cleansing. The Israeli military's plans to widen its military offensive against Hamas to areas it does not yet control have been met with criticism and criticism. Efforts to revive ceasefire talks between Hamas and Egypt have reportedly resumed. Israel and South Sudan are reportedly in talks about relocating Palestinians to South Sudan.",
  "shortSummary": "Israeli gunfire killed 25 Palestinians seeking aid in Gaza, while Israeli Prime Minister Benjamin Netanyahu indicated that Palestinians would be allowed to leave during a future offensive.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "c1816acadd7940eb9739abcbb0b47da6",
  "places": [
    {
      "osmId": "5250492223",
      "road": "Al Awda",
      "town": "Beit Hanoun",
      "stateDistrict": "North Gaza Governorate",
      "postcode": "500",
      "country": "Palestinian Territory",
      "countryCode": "ps",
      "coordinates": {
        "lat": 31.5560287,
        "lon": 34.5189807
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-09/israel-faces-growing-global-condemnation-over-military-expansion-in-gaza",
      "text": "Israel faces growing global condemnation over military expansion in Gaza\n- Share via\nDEIR AL BALAH, Gaza Strip — International condemnation grew Saturday over Israel’s decision for a military takeover of Gaza City, while little appeared to change immediately in the territory shattered by 22 months of war.\nCeasefire efforts appeared to be reviving with Israel’s announcement. U.S. special envoy Steve Witkoff was expected to meet with Qatar’s prime minister in Spain on Saturday to discuss a new proposal to end the war, according to two officials familiar with the talks who spoke on condition of anonymity because they weren’t authorized to speak with the media.\nMediators Egypt and Qatar are preparing a new ceasefire framework that would include the release of all hostages — dead and alive — in return for the war’s end and the withdrawal of Israeli forces, two Arab officials have told the Associated Press.\nHealth officials said that 20 Palestinians seeking aid were shot dead Saturday and 11 adults died of malnutrition-related causes in the past 24 hours, as the criticism of Israel came with pleas to allow far more food to reach people in the besieged enclave.\nHostages’ families were pressuring the government of Prime Minister Benjamin Netanyahu amid new fears over the 50 remaining hostages, with 20 of them thought to be alive and struggling.\n“The living will be murdered and the fallen will be lost forever” if the offensive goes ahead, said Einav Zangauker, whose son Matan is held in Gaza.\nShe called on Israelis including the powerful Histadrut labor union to “help us save the hostages, the soldiers and the state of Israel,” and she appeared to call for a general strike: “Shut the country down.”\nA joint statement by nine countries including Germany, Britain, France and Canada said that they “strongly reject” Israel’s decision for the large-scale military operation, saying it will worsen the “catastrophic humanitarian situation,” endanger hostages and further risk mass displacement. They said any attempts at annexation or settlement in the Gaza Strip violate international law.\nA separate statement by more than 20 countries — including ceasefire mediators Egypt and Qatar along with Saudi Arabia, Turkey and the United Arab Emirates — called Israel’s decision a “dangerous and unacceptable escalation.” Meanwhile, Russia said Israel’s plan will aggravate the “already extremely dramatic situation” in Gaza.\nThe United Nations Security Council planned an emergency meeting Sunday. And Germany has said it won’t authorize any exports of military equipment to Israel that could be used in Gaza until further notice.\nOfficials at Nasser and Awda hospitals said that Israeli forces killed at least 11 people seeking aid in southern and central Gaza. Some had been waiting for aid trucks, while others had been approaching aid distribution points.\nIsrael’s military denied opening fire and said that it was unaware of the incidents. The military secures routes leading to distribution sites run by the Israeli-backed and U.S.-supported Gaza Humanitarian Foundation, which didn’t immediately respond to a request for comment.\nTwo witnesses told the AP that Israeli troops fired toward crowds approaching a GHF distribution site on foot in the Netzarim corridor, a military zone that bisects Gaza. One witness, Ramadan Gaber, said that snipers and tanks fired on aid-seekers, forcing them to retreat.\nIn the north, Israeli fire killed at least nine and wounded more than 200 as people sought aid entering Gaza through the Zikim crossing, said Fares Awad, head of the Health Ministry’s ambulance and emergency service in the area. There was no immediate Israeli comment.\nIn Deir al Balah in central Gaza, some aid-seekers cheered the latest airdrops of aid. Hundreds of people rushed to grab what they could, though many have called the process degrading. Aid organizations have called airdrops expensive, insufficient and potentially dangerous for people on the ground.\nIsrael’s military said that at least 106 packages of aid were airdropped Saturday as Italy and Greece joined the multinational effort for the first time. Video from Italy’s Defense Ministry showed not only packages being parachuted over Gaza but the dry and devastated landscape below.\nBarefoot children collected rice, pasta and lentils that had spilled from packages onto the ground.\n“This way is not for humans, it is for animals,” said one man at the scene, Mahmoud Hawila, who said he was stabbed while trying to secure an airdropped package.\nIsrael alleges, without giving evidence, that Hamas systematically diverts aid from the existing U.N.-led system, which denies it. That system has called for more of the trucks waiting outside Gaza to be allowed not just into the territory, but safely to destinations inside it for distribution.\nWith temperatures reaching above 90 degrees in Gaza, families fanned themselves with pieces of cardboard or metal trays and slept on the ground outside their tents, while some women collected water before dawn.\n“My children cry day and night. My son scratches his body because of the heat,” said Nida Abu Hamad, whose displaced family shelters in Gaza City.\nGaza’s Health Ministry said the new adult deaths from malnutrition-related causes over the past 24 hours brought the total to 114 since it began counting such deaths in June. It said that 98 children have died of malnutrition-related causes since the war began with the Hamas-led attack on southern Israel on Oct. 7, 2023, with militants killing around 1,200 people and abducting 251.\nIsrael is “forcing Palestinians into a state of near-starvation to the point that they abandon their land voluntarily,” Turkish Foreign Minister Hakan Fidan said at a news conference in Egypt.\nThe toll from hunger isn’t included in the Health Ministry’s death toll of 61,300 Palestinians in the war. The ministry, part of the Hamas-run government and staffed by medical professionals, doesn’t distinguish between fighters or civilians in its count, but says around half of the dead have been women and children. The U.N. and independent experts consider it the most reliable source on war casualties.\nIsrael disputes the ministry’s figures, but hasn’t provided its own.\nShurafa, Metz and Magdy write for the Associated Press and reported from Deir al Balah, Jerusalem and Cairo, respectively. AP writers Sam Mednick in Tel Aviv and Matthew Lee in Washington contributed to this report."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-08/israel-plans-to-take-over-gaza-city-to-pressure-hamas-worries-rise-for-civilians-and-hostages",
      "text": "Israel plans to take over Gaza City to pressure Hamas. Worries rise for civilians and hostages\n- Share via\nJERUSALEM — Israel said Friday it will intensify its 22-month war with Hamas by taking over Gaza City, drawing a dismissal from the militant group and renewed international calls to end the conflict while stirring fears for Palestinian civilians and Israeli hostages still held in Gaza.\nIsrael’s air and ground war has killed tens of thousands of people in Gaza, displaced most of the population, destroyed vast areas and pushed the territory toward famine. The timing of another major ground operation is unclear. It will likely require mobilizing thousands of troops and forcibly evacuating civilians, almost certainly exacerbating the humanitarian catastrophe.\nAn official familiar with the plans to take over Gaza City said the operation would be “gradual” and that there is no start date. The official spoke on condition of anonymity to discuss sensitive matters.\nMediators from Egypt and Qatar are working on a new framework that will include the release of all hostages — dead and alive — in one go in return for an end of the war in Gaza and the withdrawal of Israeli forces from the strip, according to two Arab officials.\nBefore Israel’s Security Cabinet approved the plan to take over Gaza City, Prime Minister Benjamin Netanyahu had outlined more sweeping plans Thursday in an interview with Fox News, saying Israel planned to take control of all of Gaza. Israel already controls around three-quarters of the territory.\nHamas rejected Israel’s plans. “Expanding of aggression against our Palestinian people will not be a walk in the park,” the group said in a statement.\nInternational powers, including Israeli allies, have stepped up criticism of the war amid mounting shock over media reports showing starvation.\nGermany said Friday it would not authorize the export of military equipment that could be used in Gaza until further notice.\nTensions could rise further if Netanyahu follows through on the more sweeping plans to take control of the entire territory, two decades after Israel’s unilateral withdrawal.\nAsked in the interview with Fox News ahead of the Security Cabinet meeting if Israel would “take control of all of Gaza,” Netanyahu replied: “We intend to, in order to assure our security, remove Hamas there.” He added that Israel did not intend to “keep it.”\nIsrael’s new plan may be aimed in part at pressuring Hamas to accept a ceasefire on Israel’s terms.\nIt may also reflect the reservations of Israel’s military chief of staff, Lt. Gen. Eyal Zamir, who reportedly warned that expanding operations would endanger the remaining 20 or so living hostages held by Hamas and further strain Israel’s army after nearly two years of regional wars.\nThe military “will prepare to take control of Gaza City while providing humanitarian aid to the civilian population outside the combat zones,” Netanyahu’s office said in a statement after the Security Cabinet meeting.\nAmir Avivi, a retired brigadier general and chairman of Israel’s Defense and Security Forum, estimated it would take less than three months to mobilize some 30,000 troops, evacuate Palestinian civilians and take over Gaza City.\nHamas-led militants triggered the war when they stormed into Israel on Oct. 7, 2023, killing around 1,200 people and abducting 251. Most of the hostages have been released in ceasefires or other deals but 50 remain inside Gaza. Israel believes around 20 of them to be alive.\nIsrael’s retaliatory campaign has killed more than 61,000 Palestinians, according to Gaza’s Health Ministry, which does not say how many were fighters or civilians. The ministry is part of the Hamas-run government and staffed by medical professionals.\nThe United Nations and independent experts view the ministry’s figures as the most reliable estimate of casualties. Israel has disputed them without offering a toll of its own.\nThe efforts for a new ceasefire have the backing of major Arab Gulf monarchies, according to two officials who spoke anonymously due to the sensitivity of the discussions. One is involved directly in the deliberations and the second was briefed on the efforts. The monarchies are concerned about further regional destabilization if Israel fully reoccupies Gaza, the officials said.\nThe yet-to-be-finalized framework aims to address the contentious issue of what to do with Hamas’ weapons, with Israel seeking full disarmament and Hamas refusing. The official directly involved in the efforts said discussions are underway about “freezing arms,” which may involve Hamas retaining but not using its weapons. It also calls for the group to relinquish power in the strip.\nA Palestinian-Arab committee would run Gaza and oversee the reconstruction efforts until the establishment of a Palestinian administration with a new police force, trained by two U.S. allies in the Middle East, to take over the strip, the official said. It is unclear what role the Western-backed Palestinian Authority would play.\nThe second official said the U.S. administration has been briefed on the broad lines of the framework.\nA senior Hamas official, speaking on condition of anonymity because he wasn’t authorized to brief the media, said the group has yet to receive details on the latest efforts to revive ceasefire talks.\nOfficials in Qatar, Egypt and Israel — as well as the White House — did not respond to requests for comment.\nU.S. envoy Steve Witkoff told hostage families during his recent visit that Israel was shifting its approach to pursue a comprehensive “all-or-nothing” deal aimed at ending the war and securing the release of hostages, according to a person who attended the meeting who spoke on the condition of anonymity because they were not authorized to discuss the private meeting.\nIsrael has repeatedly bombarded Gaza City and carried out numerous raids there, only to return to neighborhoods again and again as militants regrouped. It is one of the few areas in Gaza that hasn’t been turned into an Israeli buffer zone or placed under evacuation orders.\nUmm Youssef from Gaza City said she had left the city for over 16 months before returning to her home.\n“The area is all rubble. Rubble is an overstatement, it is a sand pile. There is nothing here to occupy. There is no life here,” she said.\nA major ground operation there could displace tens of thousands of people and further disrupt efforts to deliver food to the hunger-stricken territory.\nIt’s unclear how many people are still in Gaza City, the territory’s largest before the war. Hundreds of thousands fled under evacuation orders in the opening weeks of the conflict, but many returned during a ceasefire at the start of this year.\nShurafa, Metz and Magdy write for the Associated Press. Shurafa reported from Deir al-Balah, Gaza Strip, and Magdy from Cairo. Associated Press writers Melanie Lidman in Telaviv, Israel; Danica Kirka in London; Michelle Price in Washington; Joseph Krauss in Ottawa, Ontario; Sam Mednick in Tel Aviv; and Fanny Brodersen in Berlin contributed to this report."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-10/netanyahu-defends-planned-military-offensive-in-gaza-and-lashes-out-at-global-campaign-of-lies",
      "text": "Amid global outcry, Netanyahu announces new Gaza offensive will be even broader\n- Share via\nJERUSALEM — Israeli Prime Minister Benjamin Netanyahu on Sunday defended a new military offensive in Gaza that’s more sweeping than previously announced, declaring in the face of growing condemnation at home and abroad that Israel “has no choice but to finish the job and complete the defeat of Hamas.”\nEven as more Israelis express concern over the 22-month war, Netanyahu said the security Cabinet last week instructed the dismantling of Hamas strongholds not only in Gaza City but also in the “central camps” and Muwasi. A source familiar with the operation, who spoke on condition of anonymity because they were not authorized to talk to the media, confirmed that Israel plans the operations in both areas.\nThe crowded camps — sheltering well over a half a million displaced people, according to the United Nations — had not been part of Israel’s announcement Friday of the offensive in Gaza City. It was unclear why, though Netanyahu faced criticism this weekend within his ruling coalition that targeting Gaza City was not enough. The prime minister said there would be “safe zones,” but such designated areas have been bombed in the past.\nNetanyahu’s office late Sunday said he had spoken with President Trump about the plan and thanked him for his “steadfast support.”\nHours after Netanyahu spoke, broadcaster Al Jazeera announced that one of its correspondents, Anas al-Sharif, was killed along with other journalists in an Israeli strike in Gaza City. Israel confirmed his death.\nAs authorities were reporting this weekend that two more Palestinian children had died of malnutrition-related deaths — bringing their toll in Gaza to 100 since the start of the war — the Israeli prime minister asserted Sunday that there is “no starvation in Gaza,” dismissing the notion as a “global campaign of lies.”\nNetanyahu spoke to foreign media just before an emergency meeting of the United Nations Security Council, which has been a platform for outrage but little action on the war.\n“Our goal is not to occupy Gaza, our goal is to free Gaza,” Netanyahu said.\nNetanyahu said there is a “fairly short timetable” for next steps in Gaza, but didn’t give specifics. The goals, he said, include demilitarizing the territory, the Israeli military having “overriding security control” there and a non-Israeli civilian administration in charge.\nIsrael wants to increase the number of aid distribution sites, he said, but in a later briefing to local media, he asserted: “There is no hunger. There was no hunger. There was a shortage, [but] there was certainly no policy of starvation.”\nNetanyahu also said he has directed Israel’s military to “bring in more foreign journalists” — which would be a striking development, as they haven’t been allowed into the Gaza Strip beyond trips with the military during the war.\nHe again blamed many of Gaza’s problems on the militant group Hamas, including civilian deaths, destruction and aid shortages. “Hamas still has thousands of armed terrorists,” he said, adding that Palestinians are “begging” to be freed from them.\nHamas responded with a lengthy statement that summed up Netanyahu’s remarks as “blatant lies.”\nLate Sunday, heavy bombardment was reported in Gaza City. Shortly before midnight, Al Jazeera said Al-Sharif was killed in a strike along with other journalists and a driver, citing the director of Shifa Hospital in Gaza City.\nIsrael’s military confirmed it, saying that Al-Sharif had “posed as a journalist” and alleging he was with Hamas. The Committee to Protect Journalists last month had said it was gravely concerned for his safety and that he was being “targeted by an Israeli military smear campaign.”\nAt Sunday’s U.N. Security Council meeting, the United States defended Israel, saying it has the right to decide what’s best for its security. It called allegations of genocide in Gaza false.\nThe U.S. has veto power on the Security Council and can block proposed actions there.\nOther council members, and U.N. officials, expressed alarm. China said Israel’s campaign amounted to the “collective punishment” of the people of Gaza, which it called unacceptable. Russia warned against a “reckless intensification of hostilities.”\n“This is no longer a looming hunger crisis; this is starvation,” said Ramesh Rajasingham with the U.N. humanitarian office. “Humanitarian conditions are beyond horrific. We have frankly run out of words to describe it.”\nIsrael faces growing unrest even among its closest allies. Netanyahu said Chancellor Friedrich Merz of Germany had “buckled under” the growing international criticism by stopping exports of military equipment to Israel that could be used in Gaza. Merz told public broadcaster ARD that Germany and Israel were talking “very critically” but Berlin’s overall policy of friendship hadn’t changed.\nAt least 31 Palestinians were killed while seeking aid in Gaza in the last 24 hours, hospitals and witnesses said Sunday.\nThe Associated Press spoke to witnesses of gunfire in the Israeli-controlled Morag and Netzarim corridors and the Teina area in the south. All accused Israeli forces of firing at crowds trying to reach food distributions or waiting for convoys.\nFifteen people were killed while waiting for aid trucks close to the newly built Morag corridor that separates the southern cities of Rafah and Khan Yunis, according to Nasser Hospital.\nThe situation is a “death trap,” said Jamal al-Laweh, who said Israeli forces opened fire there. “But I have no other choice to feed the kids.”\nSix people were killed while waiting for aid in northern Gaza near the Zikim crossing, according to Gaza’s Health Ministry and Shifa Hospital.\nIn central Gaza, witnesses said they heard warning shots before the fire was aimed toward crowds trying to reach a food distribution site operated by the Israeli-backed and U.S.-funded Gaza Humanitarian Foundation. The AP could not independently confirm who fired the shots. Al-Awda Hospital in the nearby Nuseirat refugee camp said four people were killed by Israeli gunfire.\n“First, it was in the air, then they started to fire at the people,” said Sayed Awda, who waited hundreds of yards from the aid site.\nSix other aid seekers were killed while trying to reach Gaza Humanitarian Foundation sites in Khan Yunis and Rafah, Nasser Hospital said.\nThe foundation sites opened in May as an alternative to the U.N.-run aid system, but their early operations have been marred by deaths and chaos, with aid seekers coming under gunfire near routes leading to the sites.\nResponding to AP inquiries, the foundation’s media office said: “There were no incidents at or near our sites today and these incidents appear to be linked to crowds trying to loot aid convoy.”\nIsrael’s military said there were no incidents involving its troops near central Gaza aid sites.\nSeven people were killed in airstrikes, local hospitals said — three near the fishermen’s port in Gaza City, and two adults and two children in a strike that hit a tent in Khan Yunis. Israel’s military did not immediately comment on the strikes, but has accused Hamas of operating from civilian areas.\nIsrael’s air and ground offensive has displaced most of Gaza’s population and pushed the territory toward famine. Two more Palestinian children died of malnutrition-related causes on Saturday, authorities said, bringing the toll among children to 100 since the war began.\nA total of 117 adults have died of malnutrition-related causes since late June, when the Health Ministry started to count that age category, it said.\nThe hunger toll is in addition to the ministry’s war toll of 61,400 Gazans. The Health Ministry, part of the Hamas-run government and staffed by medical professionals, doesn’t distinguish between fighters or civilians in its tally, but says around half of the dead have been women and children. The U.N. and independent experts consider it the most reliable source on war casualties.\nHostages’ relatives have urged a labor strike in Israel next week over the plans to expand military operations, fearing it will endanger their loved ones. Fifty hostages remain after being taken in the Hamas-led attack on Oct. 7, 2023, that sparked the war. Twenty are believed to be alive.\nDozens of people sat outside the U.S. Consulate in Jerusalem to protest Israel’s offensive. “I think it’s a horrible decision. It’s like deciding that we don’t want [hostages] alive anymore,” said one person, Milly Rothschild.\nTens of thousands of Israelis rallied in Tel Aviv on Saturday night in what local media called one of the largest antigovernment protests in months.\nLishay Miran-Lavi, whose husband, Omri, is among the hostages, appealed to Trump and U.S. special envoy Steve Witkoff to halt the fighting.\n“The decision to send the army deeper into Gaza is a danger to my husband, Omri. But we can still stop this disaster,” she said.\nAlso Sunday, Israeli Defense Minister Israel Katz toured the northern part of the Israeli-occupied West Bank, where about 40,000 Palestinians have been driven from their homes this year in the West Bank’s largest displacement since Israel captured the territory in 1967.\nIsrael says the operations are needed to stamp out militancy, as violence by all sides has surged since the war in Gaza began.\nKatz said the military would remain in the area’s refugee camps at least until the end of the year, and said the number of warnings about attacks against Israelis in the West Bank had decreased by 80% since the operation began in January.\nShurafa, Metz and Magdy write for the Associated Press and reported from Deir al Balah, Gaza Strip, Jerusalem and Cairo, respectively. AP writers Melanie Lidman in Tel Aviv, Sally Abou AlJoud in Beirut, Edith M. Lederer at the United Nations and Jamey Keaten in Geneva contributed to this report."
    }
  ],
  "argos_summary": "Israeli gunfire has reportedly killed at least 25 people in Gaza as Prime Minister Benjamin Netanyahu announced plans for a military offensive aimed at taking control of Gaza City and other areas, raising concerns about the humanitarian crisis and the safety of hostages. Netanyahu's strategy includes allowing Palestinians to leave combat zones, which critics warn could lead to ethnic cleansing. Meanwhile, international condemnation is growing over Israel's military actions, with calls for a ceasefire and humanitarian aid access amidst rising starvation and casualties in Gaza.",
  "argos_id": "09SHYY483"
}