{
  "url": "https://www.benzinga.com/pressreleases/25/08/g47137067/groupon-inc-investors-company-investigated-by-the-portnoy-law-firm",
  "authorsByline": "Globe Newswire",
  "articleId": "d60e2f743d0843c0b8cdde87ab9bba77",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "http://benzinga.com/next-assets/images/schema-image-default.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T15:51:20-04:00",
  "addDate": "2025-08-14T20:02:41.635201+00:00",
  "refreshDate": "2025-08-14T20:02:41.635203+00:00",
  "score": 1.0,
  "title": "Groupon, Inc. Investors: Company Investigated by the Portnoy Law Firm - Groupon (NASDAQ:GRPN)",
  "description": "Investors can contact the law firm at no cost to learn more about recovering their losses LOS ANGELES, Aug. 14, 2025 (GLOBE NEWSWIRE) -- ​The Portnoy Law Firm advises Groupon, Inc. (\"Groupon\" or \"the Company\")",
  "content": "Investors can contact the law firm at no cost to learn more about recovering their losses\n\nLOS ANGELES, Aug. 14, 2025 (GLOBE NEWSWIRE) -- ​The Portnoy Law Firm advises Groupon, Inc. (\"Groupon\" or \"the Company\") GRPN investors that the firm has initiated an investigation into possible securities fraud and may file a class action on behalf of investors. Groupon investors that lost money on their investment are encouraged to contact Lesley Portnoy, Esq.\n\nInvestors are encouraged to contact attorney Lesley F. Portnoy, by phone 310-692-8883 or email: info@portnoylaw.com, to discuss their legal rights, or click here to join the case. The Portnoy Law Firm can provide a complimentary case evaluation and discuss investors' options for pursuing claims to recover their losses.\n\nOn June 9, 2025, the short-seller Captain's Log published a report regarding Groupon, Inc., alleging that the Company engaged in questionable accounting practices and misled investors about the success of its purported turnaround.\n\nFollowing the publication of this report, Groupon's stock price declined $1.61 per share, or approximately 4.89%, closing at $31.33 per share on June 9, 2025.\n\nPlease visit our website to review more information and submit your transaction information.\n\nThe Portnoy Law Firm represents investors in pursuing claims against caused by corporate wrongdoing. The Firm's founding partner has recovered over $5.5 billion for aggrieved investors. Attorney advertising. Prior results do not guarantee similar outcomes.",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/Tracker?data=sNK_hDjudYY2kC2HEp4XsKWPUGaDGcfik1lFX6754RTULKtok_dxbsvq5oU7LFIOEHqZKi8AO8-4F-wHsryxTPKOd-T2o0UzeVJvtpf-PkI=",
    "https://www.globenewswire.com/Tracker?data=55S5io7BLjxCLeYRSz-0t3qTWeuqv6tgj_WipvHCTC05PhBs-yqCVLHi1WmxOkhERSCAtbe59VHvDZrEBlc2UW8lZm2dPZGikwtlPrjEDlUe9VsFZ7DbObpC5kcewIo9",
    "https://www.globenewswire.com/Tracker?data=_m7q9iRnKjwtrBkx4TUiJMkzEtKj-no_W7rdO8u6jqo39gz0BgAsSjEJZ0NYQ3xgQ68dzxiAn-sb4vfntlmMxb55yUeU6ieNFFlaXN6Eg2k=",
    "https://www.globenewswire.com/Tracker?data=2-9CpeMsEf2qGUC5uOlbglPxfdc-L_NtivSg4yyd3sHkn_hBYPVaZpPHstnpeyZQVBabUWOJ8tWOGWLjEt29xg==",
    "https://www.globenewswire.com/Tracker?data=wLl6H-VpmBnSI63cjuMgFZ3naOcPH5IZo9vCActWmekO4evqsf4j1Jlhjo0vLkLzWWIxxA34veh5eTTyDQGfoouh8ZiHL7P334S0CMOuex8=",
    "https://www.globenewswire.com/Tracker?data=2S1T0hC4W2Da_1nnan0Aa5CDVmWZp0-yCnAT05KIeh3Mh0ZDmCa5iqMnZ9C9gEJkKUrI8JksoReJcO6a6RaBShxEhPwbRzjEOSUbMMgmCEc=",
    "https://www.globenewswire.com/Tracker?data=2-9CpeMsEf2qGUC5uOlbgu9LJiWqD4p9C2VES8yP4yhdHKx3LjRjgOHA5E_REdP4ugsfBSk0Wen1Mt35G1Hcag==",
    "https://www.globenewswire.com/Tracker?data=UH2FTzc3KFcdBKL0QXhQ1QbGdIx9P4LDsOqPl08ZtUlugDdcMCvR3m_CkDdklYdELfjbBVxBZG4iyTQK1z-ckgGEtqJX7yUXgx6k2XZNDbg=",
    "https://www.globenewswire.com/NewsRoom/AttachmentNg/ea0dd9c0-6e41-4d5a-ad27-b277677af6df",
    "https://www.globenewswire.com/Tracker?data=hVmGGQyQW2XuURidsGv6mPcY0e_-gKdZlSQwu6wn0EabhSaN4BrP9BKL0lbnNG7fu8ibl8W0ghf_p2PIFq1IEA9_WHJqbvsfeyzD-7POJs0="
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Groupon investors",
      "weight": 0.13786586
    },
    {
      "name": "GRPN investors",
      "weight": 0.11711498
    },
    {
      "name": "Investors",
      "weight": 0.11311961
    },
    {
      "name": "investors",
      "weight": 0.11311961
    },
    {
      "name": "aggrieved investors",
      "weight": 0.11272419
    },
    {
      "name": "attorney Lesley F. Portnoy",
      "weight": 0.09571959
    },
    {
      "name": "Lesley F. Portnoy",
      "weight": 0.09436481
    },
    {
      "name": "Groupon",
      "weight": 0.09266511
    },
    {
      "name": "Groupon, Inc. Investors",
      "weight": 0.080974594
    },
    {
      "name": "more information",
      "weight": 0.08028498
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Stocks"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9892578125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9677734375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.94189453125
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.83642578125
    },
    {
      "name": "/Law & Government/Legal/Business & Corporate Law",
      "score": 0.818359375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.8017578125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.7041015625
    },
    {
      "name": "/Law & Government/Legal/Legal Services",
      "score": 0.68212890625
    }
  ],
  "sentiment": {
    "positive": 0.1436621,
    "negative": 0.23700336,
    "neutral": 0.6193346
  },
  "summary": "The Portnoy Law Firm has informed Groupon, Inc. (Groupon) that it is investigating possible securities fraud and may file a class action on behalf of investors. Investors can contact the law firm at no cost to learn more about recovering their losses. The short-seller Captain's Log published a report alleging that Groupon engaged in questionable accounting practices and misled investors about its purported turnaround. Following the publication of the report, Groupon's stock price declined by approximately 4.89% and its shares fell to $31.33% on June 9, 2025.",
  "shortSummary": "The Portnoy Law Firm is investigating Groupon's potential securities fraud, offering advice on potential legal actions and compensation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3843797c6a2040418553246a1ce7c675",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.globenewswire.com/Tracker?data=_m7q9iRnKjwtrBkx4TUiJMkzEtKj-no_W7rdO8u6jqo39gz0BgAsSjEJZ0NYQ3xgQ68dzxiAn-sb4vfntlmMxb55yUeU6ieNFFlaXN6Eg2k=",
      "text": "CLASS ACTION CASES\nclick below to learn more and join\nclick below to learn more and join\nFounding Partner\nLesley Portnoy brings more than a decade of experience representing investors and consumers in recovering losses caused by corporate fraud and wrongdoing. Lesley is based in Los Angeles.\nLesley has assisted in the recovery of billions of dollars on behalf of aggrieved investors, including the victims of the Bernard M. Madoff bankruptcy. Courts throughout the United States have appointed him as Lead Counsel to represent investors in securities fraud class actions.\nAs Lead Counsel with in In re Yahoo! Inc. Sec. Litig., a high-profile class action litigation against Yahoo! Inc., Lesley helped achieve an $80 million settlement for the Class in 2018. The case involved the biggest data breaches in U.S. history, in which over 3 billion Yahoo accounts were compromised.\nOther securities fraud cases that Lesley successfully litigated include Parmelee v. Santander Consumer USA Holdings Inc.; In re Fifth Street Asset Management, Inc. Sec. Litig.; In re ITT Educational Services, Inc. Sec. Litig.; In re Penn West Petroleum Ltd. Sec. Litig.; Elkin v. Walter Investment Management Corp.; In re CytRx Corporation Sec. Litig.; Carter v. United Development Funding IV; and In re Akorn, Inc. Sec. Litig.\nLesley received his B.A. in 2004 from the University of Pennsylvania. In 2009, he simultaneously received his JD magna cum laude from New York Law School and his Masters of Business Administration from City University of New York. At New York Law School, Lesley was on the Dean’s List-High Honors and an Articles Editor for the New York Law School Law Review.\nLesley is admitted to practice in New York and California, and is admitted to practice before the United States Court of Appeals for the Second Circuit, and the United States District Courts for the Southern and Eastern Districts of New York, the Central, Northern, and Southern Districts of California and the Northern District of Texas.\nLesley Portnoy brings more than a decade of experience representing investors and consumers in recovering losses caused by corporate fraud and wrongdoing. Lesley is based in Los Angeles.\nLesley has assisted in the recovery of billions of dollars on behalf of aggrieved investors, including the victims of the Bernard M. Madoff bankruptcy. Courts throughout the United States have appointed him as Lead Counsel to represent investors in securities fraud class actions.\nGet Informed\nA class action is a type of lawsuit in which one person, usually the lead or named plaintiff, represents everyone who suffered similar harm from the defendant’s unlawful conduct. Class action lawsuits are often filed when it would be impractical or prohibitively expensive for each person who was harmed to file an individual lawsuit. This procedural device enables shareholders or consumers who have suffered relatively small losses or injury to seek recovery from large corporations possessing much greater legal and financial resources without having to bear the financial risk.\nIn federal court, a “lead plaintiff” will be appointed to represent the other shareholders who purchased the securities during the “class period,” which is the time frame during which the fraud occurred. While class action lawsuits can take two to three years to litigate, they may also settle much sooner.\nSecurities class actions are lawsuits filed by at least one investor seeking to recover losses caused by corporate fraud and malfeasance. Securities class actions typically allege that a corporation through its officers and directors misled investors over a certain period of time, the “Class Perios.”\nClass actions typically take at least 2-3 years to litigate, although the actual time it takes to resolve a case varies, depending on the complexity of the case, the issues involved and other factors.\nUnder the direction of the federal securities laws, Courts appoint a lead plaintiff to direct legal counsel and represent the interests of the class of investors harmed by the alleged corporate wrongdoing.\nIf you purchased your securities during the class period, and your purchase resulted in a loss, you may be eligible to recover money damages.\nYes, investors can participate in the class action after selling shares, so long as the shares were purchased during the Class Period.\nNo. The Portnoy Law Firm will advance all costs of your class action lawsuit. Operating on a contingency basis, clients do not pay out of pocket, and the firm only recovers its expenses upon recovering money for clients.\nPotentially, other investors may file another case, in the event more than one class action filed, the court typically consolidates the cases into one single cases. The lead case will incorporate all the potential claims and parties."
    }
  ],
  "argos_summary": "The Portnoy Law Firm has launched an investigation into Groupon, Inc. for potential securities fraud, following a report by short-seller Captain's Log that alleged questionable accounting practices by the company. Investors who suffered losses are encouraged to contact attorney Lesley Portnoy for a complimentary case evaluation and to discuss joining a possible class action lawsuit. Groupon's stock price fell nearly 5% after the report was published.",
  "argos_id": "0P3X1UBB1"
}