{
  "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/accord-announces-second-quarter-financial-results-2",
  "authorsByline": "Business Wire",
  "articleId": "f9ed6bf7154c4b8987324639fd0a8cb3",
  "source": {
    "domain": "financialpost.com",
    "paywall": true,
    "location": {
      "country": "ca",
      "city": "Toronto",
      "coordinates": {
        "lat": 43.6534817,
        "lon": -79.3839347
      }
    }
  },
  "imageUrl": "https://mms.businesswire.com/media/20250814975844/en/1826475/3/ENG_rgb.jpg",
  "country": "ca",
  "language": "en",
  "pubDate": "2025-08-14T23:05:46+00:00",
  "addDate": "2025-08-14T23:18:36.182995+00:00",
  "refreshDate": "2025-08-14T23:18:36.182997+00:00",
  "score": 1.0,
  "title": "Accord Announces Second Quarter Financial Results",
  "description": "TORONTO —  Accord Financial Corp. (TSX – ACD) today released its financial results for the quarter ended June 30, 2025. The financial figures presented in this rele…",
  "content": "The Company’s President and CEO, Mr. Simon Hitzig, commented: “Following successful initiatives in 2024 to streamline the business and reduce leverage, we recorded modest portfolio growth over the first half of 2025. However, the Company’s balance sheet, with its primary and other debt obligations maturing in the near term, is an obstacle to realizing potential growth opportunities. Throughout the first half, working closely with our financial advisors, the Company has continued to focus on strategic initiatives to repay its outstanding debt and further simplify the business.”\n\nGet the latest headlines, breaking news and columns.\n• There was an error, please provide a valid email address. A welcome email is on its way. If you don't see it, please check your junk folder. The next issue of Top Stories will soon be in your inbox. We encountered an issue signing you up. Please try again\n\n“The anticipated extension provides time for the Company to continue to actively pursue a broad range of strategic initiatives, including potential divestitures of portfolio assets or business units as well as other financing alternatives, to address its maturing debt obligations (with $217.6 million as at June 30, 2025 due by January 31, 2026) and maximize shareholder value. The Company continues to work with its financial advisors to support its pursuit of strategic initiatives and debt repayment or refinancing, but there is no assurance that such initiatives will yield a successful result,” said Mr. Hitzig. “While we focus on these initiatives, profitable operating performance and growth will continue to be a challenge.” The Company does not plan to provide updates on the status of its strategic initiatives until material developments emerge.\n\nAccord’s finance receivables and loans (“funds employed”) closed at $398 million on June 30, 2025, up 9.0% from $366 million at the start of the year, but down from $431 million on June 30, 2024 (impacted by the sale of the AEF portfolio). Despite modest portfolio growth over the first half, average funds employed during the quarter slipped to $395 million compared to $428 million in the second quarter of 2024. Reflecting the year-over-year decline in average funds employed, and lower average yields, second quarter revenue was $16.2 million compared to $20.0 million in the same period last year.\n\nAlong with the year-over-year decline in revenue, the Company has reduced overhead, with second quarter general and administrative expenses coming in at $6.7 million versus $8.2 million in the same period last year. For the second quarter in a row, the Company earned a pre-provision operating profit, however, the $1.9 million provision for credit losses pushed the Company to a second quarter net loss attributable to shareholders of $876,000, an improvement from the $1.3 million loss in the first quarter. The loss of 10 cents per common share caused book value per share to slip to $9.19.\n\nThe Company’s financial statements have been prepared in accordance with IFRS. The Company uses a number of other financial measures to monitor its performance and believes that these measures may be useful to investors in evaluating the Company’s operating performance and financial position. These measures may not have standardized meanings or computations as prescribed by IFRS that would ensure consistency between companies using these measures and are, therefore, considered to be non-IFRS measures. The non-IFRS measures presented in this press release are as follows:\n\nAdjusted net earnings, adjusted net loss and adjusted EPS/LPS. The Company derives these measures from amounts presented in its IFRS prepared financial statements. Adjusted net earnings (loss) comprise shareholders’ net earnings before net single account loss (in 2023 and 2024), professional fees related to bank negotiations (2024 and 2025), stock-based compensation, business acquisition expenses (primarily amortization of intangible assets) and restructuring expenses. Adjusted EPS (basic and diluted) is adjusted net earnings (loss) divided by the weighted average number of common shares outstanding (basic and diluted) in the period. Management believes adjusted net earnings is a more appropriate measure of operating performance as it excludes items which do not relate to ongoing operating activities. The following table provides a reconciliation of the Company’s net earnings to adjusted net earnings:",
  "medium": "Article",
  "links": [
    "https://financialpost.com/subscribe",
    "https://financialpost.com/video-centre/"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "adjusted net loss",
      "weight": 0.08546164
    },
    {
      "name": "other financial measures",
      "weight": 0.083992615
    },
    {
      "name": "Adjusted net earnings",
      "weight": 0.08183381
    },
    {
      "name": "adjusted net earnings",
      "weight": 0.08183381
    },
    {
      "name": "strategic initiatives",
      "weight": 0.08154493
    },
    {
      "name": "Second Quarter Financial Results",
      "weight": 0.08083055
    },
    {
      "name": "net single account loss",
      "weight": 0.07483648
    },
    {
      "name": "successful initiatives",
      "weight": 0.07334196
    },
    {
      "name": "second quarter revenue",
      "weight": 0.072969116
    },
    {
      "name": "Second Quarter",
      "weight": 0.07137306
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9921875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.96337890625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.916015625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.91162109375
    }
  ],
  "sentiment": {
    "positive": 0.1322667,
    "negative": 0.7440552,
    "neutral": 0.12367804
  },
  "summary": "Accord has announced its second quarter financial results, with modest portfolio growth over the first half of 2025, but its balance sheet remains an obstacle to realizing potential growth opportunities. The company's President and CEO, Simon Hitzig, stated that the company's balance sheet, with its primary and other debt obligations maturing in the near term, is an issue that prevents it from realizing growth potential. The Company is focusing on strategic initiatives to repay its outstanding debt and simplify the business, including potential divestitures of portfolio assets or business units, and other financing alternatives. Despite modest growth, average funds employed slipped to $395 million compared to $428 million in the second quarter of 2024. Despite this, the company has reduced overhead and earned a pre-provision operating profit for the second consecutive consecutive quarter. The financial statements have been prepared in accordance with IFRS and the company uses other non-IFRS measures to monitor its performance.",
  "shortSummary": "Accord's second quarter results show modest portfolio growth but challenges remain from ongoing debt refinancing and asset management initiatives.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "74347c5e00a446dbbd6df4b68529271c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The Company, led by President and CEO Simon Hitzig, reported modest portfolio growth in the first half of 2025 but faces challenges due to maturing debt obligations totaling $217.6 million by January 2026. Despite a 9% increase in finance receivables and loans, revenue declined year-over-year, resulting in a net loss attributable to shareholders of $876,000. The Company is actively pursuing strategic initiatives, including potential divestitures and refinancing options, to address its debt while managing operational performance.",
  "argos_id": "1DV1QW4CV"
}