{
  "url": "https://www.nytimes.com/athletic/6553769/2025/08/14/manchester-city-charges-richard-masters/",
  "authorsByline": "Jacob Whitehead",
  "articleId": "a8cbd2c030bc496ca278fe25e6a5a55e",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/14123221/richard-masters-pl-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T21:30:47+00:00",
  "addDate": "2025-08-14T21:37:51.357111+00:00",
  "refreshDate": "2025-08-14T21:37:51.357112+00:00",
  "score": 1.0,
  "title": "Premier League chief Richard Masters urges ‘patience’ on Manchester City charges case",
  "description": "\"It would be wrong for me to speculate about when or whether there are any frustrations in the system,\" Masters said on Thursday.",
  "content": "Premier League CEO Richard Masters refused to be drawn on questions surrounding the apparent delay to the league’s ongoing legal case against Manchester City.\n\nCity were charged with 115 breaches of Premier League regulations in February 2023, with the formal hearing concluding on December 6 last year. Over eight months later, the independent three-person panel has not released any decision.\n\nAsked at a media event on the eve of the Premier League season whether he was disappointed with the length of the process, Masters replied: “I really can’t comment and there are very good reasons for that. As you know, our rules are very clear.\n\n“I can’t talk about the process in any aspect between the period when allegations and charges are announced until a decision is handed down, and it would be wrong for me to speculate about when or whether there are any frustrations in the system.”\n\nTwo weeks ago, the Premier League’s handbook was updated to include a clause that all judicial panel members would be required to devote “sufficient time, diligence and industry to ensure the expeditious and efficient conduct of the arbitration”.\n\nLater, Masters added: “This is an independent panel independently selected. And they’re in charge of the case. They’re in charge of the process and the timings. We have no influence over that. So we have to be patient and wait for these things to happen.\n\n“Our rules state when a decision is handed down at some point, it will be made public. And I’m sure that’s going to be the case here.”\n\nThe executive insisted that this update did not reflect the length of the case against City, which is commonly regarded as the most complex and hotly-fought in Premier League history.\n\n“At all times, (and) it’s got nothing to do with any particular case going on, it’s just about improving the efficiency of our judicial system,” he said. “As you know, we constantly bend the rulebook to try and make it more efficient whilst preserving all of the things you need in a properly functioning system.”\n\nThis has been a testing process for Masters, with Premier League clubs seemingly at loggerheads over the process, a feeling of discord heightened by several high-profile battles over updates to the league’s profitability and sustainability (PSR) and associated party transaction (APT) regulations.\n\nMasters batted away questions over whether a negative outcome for the Premier League would lead to his resignation.\n\n“You’re asking me to speculate on the outcome of the case,” he said. “I’m not going to do it. That’s all I can say.”",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6550850/2025/08/14/alternative-premier-league-table-matchweek-one-projections/",
    "https://www.nytimes.com/athletic/6255724/2025/04/05/premier-league-atp-letter-manchester-city-loans/",
    "https://www.nytimes.com/athletic/6281172/2025/04/15/premier-league-psr-leicester/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Premier League CEO Richard Masters",
      "weight": 0.116719514
    },
    {
      "name": "Premier League chief Richard Masters",
      "weight": 0.11670116
    },
    {
      "name": "Premier League",
      "weight": 0.115128495
    },
    {
      "name": "Premier League regulations",
      "weight": 0.11472715
    },
    {
      "name": "Premier League clubs",
      "weight": 0.1104636
    },
    {
      "name": "Premier League history",
      "weight": 0.108510144
    },
    {
      "name": "Manchester City charges case",
      "weight": 0.09891266
    },
    {
      "name": "Richard Masters",
      "weight": 0.08680471
    },
    {
      "name": "Masters",
      "weight": 0.07782664
    },
    {
      "name": "Manchester City",
      "weight": 0.07517195
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.9541015625
    },
    {
      "name": "/News/Sports News",
      "score": 0.93359375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.802734375
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.4970703125
    }
  ],
  "sentiment": {
    "positive": 0.04069105,
    "negative": 0.75366926,
    "neutral": 0.20563968
  },
  "summary": "Premier League CEO Richard Masters has urged patience over the ongoing legal case against Manchester City, which has not yet been resolved. City was charged with 115 breaches of Premier League regulations in February 2023, with the formal hearing concluding on December 6 last year. The independent three-person panel has yet to make a decision. The Premier League's handbook recently updated to stipulate that all judicial panel members must spend sufficient time, diligence, and industry to ensure the efficient conduct of the arbitration. Masters insisted that this update did not reflect the length of the case, which is considered the most complex and contentious case in Premier League history.",
  "shortSummary": "Premier League CEO Richard Masters urges patience as the independent panel deliberates on Manchester City’s disciplinary charges for 115 breaches of Premier League regulations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "978d95b2bf7b4930bfba16c7be651b55",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6281172/2025/04/15/premier-league-psr-leicester/",
      "text": "The Premier League has moved to tighten its financial rules amid an ongoing arbitration dispute with Leicester City.\nThe wording around its profitability and sustainability rules (PSR) has been amended and appears to directly relate to the arbitration case centring around Leicester’s losses during the three-year accounting period ending in 2022-23 and whether it fell under EFL or Premier League jurisdiction.\nAdvertisement\nOn January 14, the Premier League said no clubs had been charged with a PSR breach, but that Leicester were still at risk of a possible sanction. The Athletic had reported the week before that rival clubs expected Leicester would be in breach. A verdict is yet to be publicised.\nThe rules were amended at a recent meeting of Premier League clubs with the league’s handbook — where the English top flight’s rules and guidelines are outlined — updated last week. Among several new rules relating to promoted clubs and the limits on their losses, the below rule E.49 has been added.\nIt states: “If a club is relegated from the league, that club shall, notwithstanding relegation, remain bound by Rules E.47 to E.86 as if it were still a club, until such a time as it has complied with all of its obligations relating to all its obligations to its last season as a club.”\nThis confirms that clubs are still under Premier League jurisdiction until they have satisfied everything under the rules for the season in which they were relegated.\nIt remains unclear whether or how these changes will impact the Leicester case. However, whenever the Premier League changes its rules, they cannot be applied retrospectively and are only enforceable from the date they were amended.\nA statement from the Premier League in January read: “Issues as to the jurisdiction of the Premier League over Leicester City Football Club in relation to PSR compliance are currently the subject of confidential arbitration proceedings.\n“Accordingly, neither the league nor the club will make any further comment at this stage about any aspect of the club’s compliance or otherwise with any of the PSR or related rules, save to say that no complaint has been brought against Leicester by the league for any breach of the PSRs for the period ending season 2023-24.”\nAdditional reporting: Dan Sheldon\nWhat does this mean for Leicester and PSR?\nAnalysis by Chris Weatherspoon\nWere it not for events of last year, this new wording could easily have passed by without fanfare. In confirming clubs are required to comply with Premier League rules even in seasons they are relegated, and clarifying a club’s PSR loss limit in all EFL seasons within a given PSR cycle is £13m rather than the Premier League’s £35m, the changes merely codify what many already assumed to be true.\nThat was until Leicester’s successful appeal last September, which found the Premier League had no jurisdiction to punish Leicester because they had been relegated by the time their 2022-23 accounting year finished.\nLeicester argued they had “sought to ensure that the rules are applied based on how they are actually written”. This is the Premier League tightening the language of those rules, and it comes at a time when multiple recent stories have raised questions around the strength of the league’s existing financial regulations.\nAdvertisement\nThe change strengthens the Premier League’s hand in pursuing charges against relegated clubs it believes have breached PSR. The wording largely mirrors that enacted by the EFL, reducing the scope for clubs to manoeuvre between the divisional gaps in the way Leicester managed previously.\nAs for Leicester, the change represents a worrying shift in the regulatory landscape. The EFL is already expected to be readying charges for if – or when – the club is relegated back to its jurisdiction. This change to the 2024-25 rules also means the club’s loss limit for the current three-year PSR cycle is set at £83m – and confirms the club could be punished by the Premier League if they breach that limit, even if they are relegated.\n(Top photo: Shaun Botterill/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6255724/2025/04/05/premier-league-atp-letter-manchester-city-loans/",
      "text": "The Premier League has written to its clubs to inform them about the second legal challenge Manchester City launched relating to their amended associated party transactions (APT) rules this year.\nAn independent tribunal comprised of Lord Dyson, Christopher Vajda KC and Sir Nigel Teare concluded that the APT rules in place between December 2021 and November 2024 were “unlawful” and “void and unenforceable”.\nAdvertisement\nPremier League clubs then voted through amendments to the APT rules in November, despite Manchester City warning them against doing so until the tribunal had released its full ruling.\nAnd on February 6, Richard Masters, the Premier League’s chief executive, wrote to clubs to inform them that City had launched a legal challenge against the amended APT rules.\nFollowing on from that, the Premier League has now written to clubs to provide an update on the process. In it, the Premier League included a statement of claim outlining why City believe the amended rules to be unlawful.\nWhat’s the new development?\nAfter Manchester City launched a fresh challenge against the Premier League’s latest version of the APT rules, both parties will be readying themselves for another legal showdown.\nBut once that legal claim had been lodged, it is standard procedure from the league’s perspective to then tell its clubs what is happening.\nSo, with that in mind, the Premier League has written to the other 19 clubs to inform them of the process that will now be followed. This included a statement of claims that details what Manchester City are challenging in the rules.\nThe latest development is not the beginning of another legal challenge — it is all tied to the one City launched in February.\nDan Sheldon\nWhat are shareholder loans?\nWhen clubs borrow money from their owners, usually interest-free. According to City, and agreed by the panel, an interest-free loan cannot be fair market value — and, therefore, this is the sort of loophole APT laws need to close.\nArsenal, Everton, and Brighton & Hove Albion all have over £250million ($316m) in interest-free loans from their shareholders.\nJacob Whitehead\nWhat’s Man City’s issue with them?\nCity believe that clubs not having to pay interest on loans from their owners gives them an unfair advantage.\nInterest on loans can amount to millions of pounds, so an owner helping a club avoid those should be considered in a similar way to how sponsorships are scrutinised if they are deemed to be from a company ‘associated’ with a club. City believe that if their sponsorship deals with Abu Dhabi-based companies are put under the microscope and have new values assigned to them, the loans should be scrutinised, too.\nAdvertisement\nThey say that these loans and market-rate interest rates should be factored into profit and sustainability rules (PSR) calculations and in their latest legal challenge, they provide figures showing that some Premier League clubs have benefitted in this way.\nSam Lee\nWhich clubs use them most and why?\nBased on the most recent figures to the summer of 2024, Everton led the way, with £450.8million due to the Farhad Moshiri-controlled Bluesky Capital Limited. That loan was converted to equity in full when the club was sold to The Friedkin Group last September.\nThe loan was interest-free. If charged at market rates, Everton would have been on the hook for significant financing costs, which would have worsened their already fraught PSR position. The treatment of loans was a key area of contention in Everton’s PSR dispute with the Premier League last season, given the confusion around how the funds from Moshiri were used.\nSix Premier League clubs owed their owners (or related parties) over £100million at the last check. All of them, bar Chelsea, can link at least some of their ‘internal’ debt to building new stadiums or enhancing existing facilities. Naturally, those improvements flow through eventually in higher gate receipts, helping clubs’ bottom lines, but the Premier League’s PSR also encourage clubs to spend on infrastructure.\nThat isn’t all that shareholder loans get spent on. Brighton, for example, owed owner Tony Bloom £406.4million as recently as June 2022. The club built a new stadium under Bloom in 2011, though it only cost £101m, according to their accounts. Brighton undeniably benefited from Bloom’s interest-free funding in their march up the pyramid. The club has, however, repaid £106.7m to him over the past two seasons. Doing so didn’t impact the club’s ability to comply with PSR but did constitute a substantial cash outflow.\nAt the other end of the scale, Manchester City owe their owners nothing. The club was long funded by equity under the current owners, much like Newcastle United since October 2021. Those two clubs’ owners have deeper pockets than most, so funding has been provided with seemingly little expectation of, or need for, repayment.\nEven clubs without owner loans on their books aren’t necessarily similar. Where City and Newcastle have minimal debt overall, Tottenham Hotspur took on huge external loans to fund their new stadium, with none of the money for the build coming from their owners. Spurs spent £29.7million on servicing their £851.4m debts last season.\nChris Weatherspoon\nAre they a competitive advantage?\nAs with just about everything to do with Premier League finances, nuance abounds. On the face of it, owners ploughing in hundreds of millions interest-free, or at low interest, does confer an advantage over those clubs that are left to tap alternative funding sources — particularly as interest rates rise. Clubs still have to manage any subsequent losses carefully, they can do so without the need to charge what those loans would normally cost in interest.\nAdvertisement\nYet it’s hardly that simple. Take Arsenal. Up until 2020, the club’s debt was entirely external, brought about by their building of the Emirates Stadium. Their owner debt (which isn’t interest-free, either) only leapt up as the pandemic hammered gate revenues — which were linked to the outstanding bonds. Arsenal’s owners stepped in and refinanced the debt to the tune of £202million, incurring £32.2m in costs to repay the bonds early, so it’s not as straightforward as stating they’ve benefitted from £300m-plus in low-interest financing.\nCity pushing the matter is unlikely to be solely focused on their belief that other clubs have an unfair advantage. This latest claim appears to be another front in its ongoing legal tussle with the Premier League.\nAfter all, City have rarely owed their owners anything since their late 2008 takeover by the Abu Dhabi United Group, despite receiving huge amounts from them, and they’ve benefited more than most from financial regulations subsequently being introduced. In the five seasons before the Premier League brought in financial fair play rules in 2013, City received £984.8million in owner funding, much of it in equity — a huge competitive advantage. Had PSR loss limits been in place then, City’s breach would have been big. Obviously, they weren’t and clubs act according to the conditions of the time.\nYet that presents another question from this latest case: what if backdating interest on shareholder loans to 2021, as City appear to be advocating, pushes a club into a PSR breach? Should the club be punished when they could argue they would not have taken out the loans if the rules were different?\nThe answer, almost certainly, would lie in yet more courtroom battles.\nChris Weatherspoon\nIs this related to the main case against Manchester City?\nNo. Not officially, anyway. All of this goes back to last year’s legal challenge against the legality of the Premier League’s APT regulations, which was, legally, entirely separate to the ongoing saga related to the 130 charges against City. The fallout, including Friday’s updates, relates to associated party transactions. This second challenge from City is ensuring that the Premier League properly scrutinises the interest-free shareholder loans, which came from the first challenge.\nAdvertisement\nIn terms of any ‘unofficial’ crossovers to the much-anticipated charges, any legal defeats for the Premier League — whether at the hands of City’s lawyers or anybody else’s — are likely to give City encouragement while we all await the much bigger verdict. Plus, one byproduct of the APT challenge may see Arsenal and Brighton, two of City’s biggest rivals off the pitch, handed a considerable PSR headache.\nSam Lee\nWhat happens next?\nBoth parties, unsurprisingly, are confident they will emerge victorious following the tribunal, which is being chaired by the same three-person panel and is yet to take place, for the second APT challenge.\nThe existing APT rules — voted in by clubs in November — remain in place and, for now, are deemed to be legally sound.\nBefore that vote took place, City warned their fellow Premier League sides not to usher through any changes to the rules until the tribunal had delivered its full verdict relating to their first legal challenge.\nAnd on the back of their victory in February, City will feel confident they have a strong case to present when it comes to getting the amended APT regulations thrown out.\nIf that proves to be the case, then it will be another significant defeat for the Premier League.\nDan Sheldon\n(Top photo: Carl Recine/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6550850/2025/08/14/alternative-premier-league-table-matchweek-one-projections/",
      "text": "Introducing The Alternative Premier League Table, a new series you can enjoy on The Athletic every Thursday during the season.\nWe all know how compelling it is to stare at a league table. Whether your team is in the middle of a winning run or mired in terrible form, five minutes looking at the standings can convince you that a hundred different futures are possible.\nAdvertisement\nEveryone knows the standard layout of a league table, and ours will contain several of those elements. What it will also have each week is one or two guest metrics that tap into the conversations taking place across the competition. It could be how the 20 sides are performing versus their expected goals, how many teenagers each team have fielded so far this season, how sides take corners, or how many times the coaching staff have been shown yellow cards.\nFrankly, the possibilities are endless — and exciting. Our aim is to enhance your holistic knowledge of the most popular football league on the planet, unearth and explain some of the season’s underlying trends.\nEach week, Anantaajith Raghuraman will analyse the whole division, but in week one, with the games yet to begin, he starts by breaking down the Premier League season predictions and projections…\nThe Premier League is back, and that means everyone from armchair fans to the most advanced supercomputers has plenty of thoughts about how the next nine months will play out.\nOpta’s projected points model — based on 10,000 simulations of the upcoming season using their team strength model — is a solid starting point. And the first edition of The Alternative Premier League table below orders all 20 teams by their projected points (as of Monday, August 11). We have also included The Athletic’s staff predictions by way of comparison. Oh, and you can sort the table by any metric each week by clicking the column title.\nWhile projected points will be our starting point for assessing the new season, it would be remiss not to acknowledge some of its limitations.\nRecent competitive form — which for most clubs means the 2024-25 season — is a significant indicator, which may explain some of the rankings in the above table. While taking in transfer activity via the impact of player trading on betting markets, the metric cannot measure the projected success of signings or the impact of departures. The same applies to managerial changes, too.\nKeeping all that in mind, we have divided the 20 teams into three distinct categories.\nThe surprises\nLast season’s big-name underperformers, Manchester United and Tottenham Hotspur, have been similarly rated by the xPT model, with predicted finishes of 12th and 14th, respectively.\nUnited have retooled their attack by spending about £200million ($270m) on Matheus Cunha, Bryan Mbeumo and Benjamin Sesko. The need for an athletic midfielder and perhaps a reliable goalkeeper remains but this now feels like a squad with enough depth for a no-European-games campaign.\nAdvertisement\nRuben Amorim’s methods required time on the training ground and following a busy preseason, they should get plenty of it during the campaign too. Their start to the campaign, by Opta’s fixture difficulty scale, is the toughest in the league with Arsenal, Fulham, Burnley, Manchester City and Chelsea in their opening five games. Results early on, a Conference League spot and a deep cup run should be bare minimums for Amorim’s second season.\nAs for Tottenham, Europa League success has been followed by the departures of coach Ange Postecoglou and captain Son Heung-min, and the arrivals of new coach Thomas Frank, winger Mohammed Kudus, and midfielder Joao Palhinha.\nThe misfortune with injuries that hit the club for most of last season has continued into this summer. James Maddison may well be out for the entire season with a knee injury, while Dejan Kulusevski is still recuperating from knee surgery and Dominic Solanke missed plenty of pre-season. Playing in the expanded Champions League will pose its challenges, too.\nTottenham hit their absolute floor in the league last season, but pre-season and Frank’s press conferences have hinted at promise. Their expectation should be to finish somewhere between sixth, as predicted on average by our staff, and 14th.\nNewcastle’s projected finish — above weekend opponents Aston Villa — may raise eyebrows too.\nTheir form to end last season was middling, with two wins in their final six games, while their transfer window, as has been discussed endlessly, has been a struggle. With Callum Wilson gone and Alexander Isak — as it stands — in effective exile, a frontline that boasts Anthony Elanga, Anthony Gordon, Harvey Barnes, and Jacob Murphy still needs some extra firepower.\nPre-season has been tricky too, with defeats against Celtic, Arsenal, Atletico Madrid, and the K-League XI. While Newcastle have kept hold of many of their key players, have added defender Malick Thiaw and are pursuing forwards before the end of the window, their midfield still feels light outside of the first-choice trio of Bruno Guimaraes, Sandro Tonali and Joelinton. Joe Willock, who is currently injured, and Lewis Miley are their only real backups, which explains the interest in Jacob Ramsey.\nAhead of the season’s first game, it’s tough to see them combine another top-five finish with Champions League participation.\nThe wave of optimism has reached the banks of Selhurst Park too, with the xPT model seeing Crystal Palace mount a seventh-place finish. Success in the FA Cup and Community Shield are undoubtedly a factor, as is the fact that they have — so far — kept hold of their core from last season.\nEven considering all that, Conference League football is bound to take its toll and Palace’s squad is not deep enough. Wide defender Borna Sosa is their only outfield addition of the window so far, while Eddie Nketiah, Matheus Franca, Cheick Doucoure, and Chadi Riad are all injured. Daichi Kamada joined that list after hobbling off against Liverpool at Wembley.\nThe futures of Marc Guehi and Eberechi Eze are in doubt, too. Unless there’s a flurry of activity in the final weeks of the window, a club-record seventh-place finish feels far-fetched.\nThe same may be felt about Brentford, predicted to finish 10th by the xPT model. Along with Frank, his coaching staff and Mbeumo, they have also lost captain Christian Norgaard and goalkeeper Mark Flekken, while Yoane Wissa could depart too.\nThe foundations currently in place should serve new manager Keith Andrews well. Caoimhin Kelleher and Jordan Henderson are handy additions, while Kevin Schade, Mikkel Damsgaard, Nathan Collins and Yegor Yarmolyuk, among others, are fantastic players.\nAdvertisement\nHaving finished 10th last season, a regression looks likely, though relegation — as predicted by a fair few of our staff — may be a step too far in a negative direction.\nFulham, after an 11th-place finish in a campaign where they competed for a European spot for large swathes, have been predicted to drop all the way to 15th. They have been the least active Premier League side in this transfer window, only signing goalkeeper Benjamin Lecomte from Montpellier.\nRodrigo Muniz, who has 17 league goals across the last two campaigns despite starting just 26 matches, is being linked with a move away. If so, he will need replacing but with most of last season's stars and Marco Silva still at Craven Cottage, another top-half finish shouldn't be ruled out.\nAs expected\nThe three newly-promoted sides are an apt place to start this tier.\nSunderland have signed Reinildo, Granit Xhaka, Noah Sadiki, Simon Adingra, Omar Alderete and Marc Guiu (on loan), with more deals in the works too. While some may deem a predicted finish at the very bottom, below Burnley and Leeds United, to be unfair, there is an undeniable 2018-19 Fulham feel to it all.\nAt best, Regis Le Bris’ team could fight for 17th. But a season akin to 2023-24 Luton Town and 2024-25 Ipswich Town ending in relegation after inciting brief whispers of ‘Could they do it?’ is a very real possibility.\nLeeds have also bolstered their ranks. Lucas Perri should be an upgrade over Illan Meslier, while Sean Longstaff, Jaka Bijol and Lukas Nmecha add Premier League-level physicality and potential. They drew with Manchester United, Villarreal and Milan in pre-season and the need for a goalscorer is evident, hence the upcoming signing of free agent Dominic Calvert-Lewin.\nLeeds’ vocal fans and proud history are welcome additions, and the club will hope our staff’s 17th-place prediction comes true. But a Daniel Farke departure midway through the season and a swift return to the Championship by the end of it are also very much on the cards.\nAdvertisement\nBurnley head coach Scott Parker’s Premier League record (nine wins and 30 losses in 52 matches) is only a minor improvement on Farke’s (six wins and 35 losses in 49 matches).\nParker’s side have a more solid defensive identity than Vincent Kompany’s 2023-24 side, but the overall structure of Burnley’s squad should still breed scepticism. They are a largely inexperienced team with few Premier League-ready starters. They might put up a better fight than they did last time out in the top flight, but it’s difficult to see them displace one of the established names.\nIf one of these three are to stay up, Wolves could be that team to make way, according to our staff, who predict them to finish 19th, and they are not too far away on xPT either at 17th. They have lost three trusted players in captain Nelson Semedo, Matheus Cunha, and Rayan Ait-Nouri, with the latter two contributing a combined 19 goals and 13 assists in the league last season.\nVitor Pereira has done an admirable job so far. Jhon Arias and David Moller Wolfe profile as direct replacements for Cunha and Ait-Nouri, and Fer Lopez is a talented player too. Jorgen Strand Larsen’s loan deal from Celta Vigo has been turned permanent but he is the subject of interest from Newcastle United. Wolves still need more incomings, potentially in central midfield and central defence, to build on the second half of last season.\nAt the other end of the table, the usual suspects Liverpool, Arsenal and Manchester City are expected to fill the top three in exactly that order. A three-pronged fight for the title is on the cards, with all three teams given sizeable probabilities of a finish across the top three by our staff…\n| Position | 1 | 2 | 3 |\n|---|---|---|---|\nLiverpool | 45% | 38% | 14% |\nArsenal | 31% | 31% | 31% |\nMan City | 21% | 21% | 45% |\n… and Opta's prediction model.\n| Position | 1 | 2 | 3 |\n|---|---|---|---|\nLiverpool | 29% | 20% | 14% |\nArsenal | 25% | 19% | 15% |\nMan City | 18% | 17% | 15% |\nLiverpool are the consensus favourite to repeat their title success after adding Hugo Ekitike, Florian Wirtz, Milos Kerkez and Jeremie Frimpong, all of whom started their Community Shield defeat on penalties to Palace. Isak and Parma defender Giovanni Leoni may yet be added, too.\nOptimism at Anfield is through the roof but Arne Slot admitted after last Sunday's match that they need to find a balance between attack and defence. Liverpool have conceded 11 goals in seven games in preseason, having taken 14 games to do so in the league last season.\nAdvertisement\nArsenal, meanwhile, struck that balance in their final preseason match, a 3-0 win over Athletic Club. Marquee signing Viktor Gyokeres scored while the Spanish side were limited to just two shots all game. Martin Zubimendi looks at home in midfield alongside Declan Rice, while Noni Madueke, Norgaard and Cristhian Mosquera, along with teenage sensation Max Dowman, have shown their value across pre-season. Jurrien Timber, Gabriel and Riccardo Calafiori are back to full fitness too.\nThe vibes are good and having come second thrice in a row, perhaps this will be Arsenal’s year. How their reconfigured attack functions will be decisive.\nAs for Manchester City, they will have to cope with a Rodri-shaped hole in midfield in the early weeks at least, with the Spaniard not expected to be fully fit before the September international break.\nThe 3-0 pre-season win over Palermo showed that Tijjani Reijnders and Rayan Cherki together could provide some solutions in and out of possession. Pep Guardiola finally has a true left-back in Ait-Nouri, while Omar Marmoush should be better after a full pre-season.\nDefensive transitions could hurt them again if Ilkay Gundogan and Bernardo Silva are forced to play lots of minutes, but otherwise, this City team is much better equipped to deal with the top two than last season’s.\nRight below the current 'Big Three' are Chelsea. Another busy summer has included Club World Cup success (and the theatrics that came with it) in the U.S. and eight arrivals, including Joao Pedro, Liam Delap, Jamie Gittens, Jorrel Hato and Estevao. This still-massive squad has been trimmed too, with 11 permanent departures.\nLevi Colwill’s ACL injury is the only blot on an otherwise successful preparatory period that has included convincing wins over Bayer Leverkusen and Milan. This is still an inexperienced team, so a title charge could perhaps be a step too far but given their quality in depth, they can trouble all of Liverpool, Arsenal, and City.\nAdvertisement\nNottingham Forest, 11th on the xPT table and predicted to finish 12th by our staff, round out this tier. An unexpectedly successful 2024-25 season had a further win at the Court of Arbitration for Sport, which confirmed Forest's presence in the Europa League, replacing Crystal Palace.\nThe summer has seen one key change in Elanga’s departure to Newcastle, but the other changes have been around the periphery, with Danilo, Ramon Sosa, Andrew Omobamidele, Matt Turner, and Harry Toffolo all leaving. Dan Ndoye, Igor Jesus, Jair Cunha, and Angus Gunn have joined.\nEven when considering Nuno Espirito Santo’s simple tactical improvements, Forest overperformed in many regards last season. Can Chris Wood score 20 league goals from just 13.4xG again? Will tiring legs and the variance that accompanies their direct approach turn in the opposite direction as they did late last season?\nThe dreaded Thursday-Sunday double-act will undoubtedly bring complications too, and a fall-off feels inevitable.\nDebatable\nAston Villa\nhave had a quiet summer, which has led to varying opinions on their floor and ceiling. Evann Guessand is the only signing expected to improve their senior squad that did not bring Marcus Rashford, but kept hold of Ollie Watkins (for now). Ramsey could depart to Newcastle, but Emi Buendia, back from a loan spell at Leverkusen, could act as his in-house replacement.\nVilla dropped two spots in the league last season after finishing fourth in 2023-24 and will also tread the Thursday-Sunday path this season. Another drop-off would be understandable but with Unai Emery, a settled squad, and the likes of Newcastle, their opening-day opponents, in turmoil, maybe less is more, and a European spot for the fourth season running is in the post.\nAlso expected to compete for a European spot once again are Brighton and Hove Albion, predicted to finish ninth by our writers and eighth on xPT. They have been busy this summer, adding Charalampos Kostoulas, Maxim De Cuyper, Diego Coppola and Olivier Boscagli, while Joao Pedro, Simon Adingra, Pervis Estupinan and Valentin Barco have all departed.\nAdvertisement\nJoao Pedro, who scored 10 times in 27 league games last season, could be a big miss. Kostoulas, only 18, has big boots to fill alongside 34-year-old Danny Welbeck. Brighton’s defence has improved on paper, though, and if they can hold onto Carlos Baleba amid interest from Manchester United, they should be primed for another season in and around the elite teams.\nEverton provide a more interesting case study. The second half of last season under David Moyes has prompted optimism, which has been compounded by the arrivals of Thierno Barry and Jack Grealish (on loan), even if fans are yet to see how the team adapts to life at Hill Dickinson Stadium.\nOur staff have them finishing 14th, while the xPT model has them one place higher. But a quick glance at my colleague Carl Anka’s amnesty for outrageous takes ahead of 2025-26 has seen several suggest Everton to fight for a top-half finish or even European qualification.\nMoyes did that with West Ham when few expected him to, so it may not be beyond the realms of possibility.\nSpeaking of West Ham, they have said goodbye to multiple players, including a few stalwarts, this summer. Michail Antonio, Aaron Cresswell, Lukasz Fabianski, Vladimir Coufal, Kurt Zouma and Danny Ings have all left upon the expiry of their contracts, while Kudus was sold to Tottenham. El Hadji Malick Diouf, Mads Hermansen, Kyle Walker-Peters and Callum Wilson have joined.\nA full pre-season should aid Graham Potter after the team struggled to break out of its Julen Lopetegui funk in the second half of last season. But the ceiling of this team still looks quite bleak, with our writers expecting them to finish 15th while they are 16th on xPT.\nPerhaps West Ham will surprise us all, but after the topsy-turvy nature of the last three seasons, nobody knows what to expect apart from Jarrod Bowen (13 goals and eight assists in the league last season) to be good again.\nAdvertisement\nThe final team on this list are Bournemouth, coming off a summer in which they lost Milos Kerkez to Liverpool, Dean Huijsen to Real Madrid and Illia Zabarnyi to Paris Saint-Germain, while Kepa Arrizabalaga departed after his loan spell. Adrien Truffert, Bafode Diakite and Djordje Petrovic have come in, with more activity expected before the end of this month.\nKeeping hold of Andoni Iraola and Antoine Semenyo is a positive and the hope will be for fewer injuries after Adam Smith, Evanilson and Luis Sinisterra all spent extended time on the sidelines. Lewis Cook, Ryan Christie and Enes Unal are all currently on the injury table, though. Dango Ouattara could depart amid interest from Brentford, with The Athletic reporting on Wednesday that Bayer Leverkusen's Amine Adli could be his replacement.\nBournemouth are ninth in xPT and were picked to finish 11th by our staff but could end up several places either side of those due to the chaotic nature of their football and big-name departures from last season’s successful core."
    }
  ],
  "argos_summary": "Premier League CEO Richard Masters declined to comment on the delay of the legal case against Manchester City, which involves 115 breaches of league regulations. The independent panel's decision is still pending over eight months after the formal hearing concluded. Additionally, the Premier League has updated its rules regarding profitability and sustainability, which may impact ongoing disputes, including one involving Leicester City. The league is tightening its financial regulations amid various legal challenges, including Manchester City's recent legal action against amended associated party transaction rules.",
  "argos_id": "2Z1RQDULB"
}