{
  "url": "https://nypost.com/2025/08/14/sports/bodybuilding-champ-hayley-mcneff-dead-at-37-in-unexpected-tragedy/",
  "authorsByline": "Bridget Reilly",
  "articleId": "edbf7a0e6a0943b19beb1c5ca242a610",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/109594646.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:46:31+00:00",
  "addDate": "2025-08-14T19:48:51.478353+00:00",
  "refreshDate": "2025-08-14T19:48:51.478355+00:00",
  "score": 1.0,
  "title": "Bodybuilding champion Hayley McNeff dead at 37 in ‘unexpected’ tragedy",
  "description": "She was an accomplished bodybuilder who won state titles in Maryland and Delaware.",
  "content": "Bodybuilding champion Hayley McNeff died last Friday, with the news confirmed on Wednesday.\n\nAccording to an obituary published on Boston.com, the death of the Concord, Mass., native was “unexpected but peaceful.”\n\n“Hayley was like a beam of light in this world. She had boundless energy and was very determined to achieve whatever she set out to do,” Hayley’s dad, Dave, told People in a statement. “She set her sights on bodybuilding and fitness and achieved the highest success that sector offered. She loved us and we love Hayley very much, we miss her madly.”\n\nMcNeff’s family is set to hold a service on Saturday and has asked for attendees to make a donation to the National Alliance on Mental Illness in McNeff’s honor.\n\nPer the obituary, McNeff graduated from Concord-Carlisle High School and University of Massachusetts Amherst, and was an accomplished bodybuilder in the 2000s with state titles in Maryland and Delaware. She was also part of the 2005 documentary “Raising the Bar,” which highlights the world of the sport.\n\n“The quest for getting huge will never end,” McNeff said about her career in the documentary. “There’s no limit. I hope there’s a day that I’ll be able to look in the mirror 100% of the time and be like, ‘Yeah man, I’m huge.'”\n\nAfter retirement from the sport, McNeff decided to pursue a graduate degree in psychology.\n\n“She had a gift for making those around her laugh and feel welcomed,” the obituary reads. “Her energy and determination was a constant in her life and she always accomplished what she set out to achieve. She treasured her friendships and nurtured strong, lasting relationships with those who knew her best. Hayley will be deeply missed by her parents, siblings, extended family, and friends.”\n\nUpon hearing the news of McNeff’s death, bodybuilding coach Dave Palumbo posted a tribute message on Instagram.\n\n“I’m sad to hear of the passing of former woman bodybuilder @hayleysmash (HAYLEY MCNEFF) … she left us way too soon,” he wrote. “She was a good soul, super intelligent and had tremendous potential as a bodybuilder. She appeared in @dave_pulcinella RAISING THE BAR videos back in the day and I was proud to be able to call her a friend. Prayers to her family and friends. R.I.P. @official_rxmuscle.”\n\nMcNeff is one of many bodybuilders who have recently passed away.\n\nZunila Hoyos Mendez died at 43 in June after she was killed in a hammer attack. A month prior, Gui Bull died at 30.",
  "medium": "Article",
  "links": [
    "https://www.instagram.com/p/DNRZNquN7th/?img_index=1",
    "https://nypost.com/2025/08/14/sports/three-wnba-players-ejected-after-fiery-sun-sky-scrap/",
    "https://www.boston.com/news/massachusetts-obituaries/2025/08/12/local-obituary-hayley-mcneff-concord-native-umass-amherst-grad-and-champion-bodybuilder/",
    "https://people.com/hayley-mcneff-family-speaks-out-after-sudden-death-exclusive-11791238",
    "https://nypost.com/2025/08/13/sports/taylor-swift-reveals-question-that-left-travis-kelce-speechless-on-first-date/",
    "https://nypost.com/2025/08/14/sports/angry-michael-phelps-has-dire-warning-for-usa-swimming/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Hayley McNeff",
      "weight": 0.11124073
    },
    {
      "name": "Bodybuilding champion Hayley McNeff",
      "weight": 0.109679274
    },
    {
      "name": "McNeff",
      "weight": 0.09301556
    },
    {
      "name": "former woman bodybuilder @hayleysmash",
      "weight": 0.07555798
    },
    {
      "name": "bodybuilding coach Dave Palumbo",
      "weight": 0.07518532
    },
    {
      "name": "Hayley",
      "weight": 0.07259076
    },
    {
      "name": "many bodybuilders",
      "weight": 0.06758518
    },
    {
      "name": "Dave Palumbo",
      "weight": 0.061664194
    },
    {
      "name": "extended family",
      "weight": 0.056232445
    },
    {
      "name": "bodybuilding",
      "weight": 0.05600206
    }
  ],
  "topics": [
    {
      "name": "In Memoriam"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.9140625
    },
    {
      "name": "/News/Sports News",
      "score": 0.70458984375
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.402099609375
    }
  ],
  "sentiment": {
    "positive": 0.36702004,
    "negative": 0.2152601,
    "neutral": 0.41771984
  },
  "summary": "Bodybuilding champion Hayley McNeff has died at the age of 37, with her family describing her as \"unexpected but peaceful\" and \"a beam of light\" who achieved the highest success in the sport. Her family plans to hold a service on Saturday and has requested a donation to the National Alliance on Mental Illness in Mcneff's honor. McNeef was an accomplished bodybuilder in the 2000s with state titles in Maryland and Delaware. She also starred in the 2005 documentary \"Raising the Bar\". After retiring from the sport, she pursued a graduate degree in psychology.",
  "shortSummary": "Hayley McNeff, a bodybuilding champion and documentary maker, died at 37, leaving a significant void in the sport.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7496c1d4750f4024b1a94ea53928276f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.boston.com/news/massachusetts-obituaries/2025/08/12/local-obituary-hayley-mcneff-concord-native-umass-amherst-grad-and-champion-bodybuilder/",
      "text": "Sign up for the Today newsletter\nGet everything you need to know to start your day, delivered right to your inbox every morning.\nHayley C. McNeff, of Sudbury, formerly of Concord, MA. Such a bright light has left this world too soon with the unexpected but peaceful passing of Hayley C. McNeff on August 8, 2025.\nBorn and raised in Concord, she was the beloved daughter of David J. McNeff of Wayland and Michelle C. Walker of South Dartmouth and was the cherished sister of Ashley S. McNeff of San Francisco and Scott P. McNeff of Quincy. She was the niece of Susan G. McNeff of Newburyport and Kathy M. McNeff of Needham.\nHayley graduated from Concord-Carlisle High School and the University of Massachusetts Amherst with a Bachelor of Arts degree. A lifelong athlete, she excelled as an accomplished equestrian, a talented board diver and skier as a youth and young adult. As an adult, she discovered a passion for bodybuilding and was the US Bodybuilding Champion during her career. She later pursued graduate studies in psychology, driven by a desire to better understand and help others.\nHayley was known for her quick wit and constant sense of humor, she had a gift for making those around her laugh and feel welcomed. Her energy and determination was a constant in her life and she always accomplished what she set out to achieve. She treasured her friendships and nurtured strong, lasting relationships with those who knew her best. Hayley will be deeply missed by her parents, siblings, extended family, and friends.\nVisitation at the George F. Doherty & Sons Funeral Home, 477 Washington St., Wellesley, on Saturday, August 16, from 10-11am followed by a funeral service at 11am. Relatives and friends kindly invited. Interment private. In lieu of flowers, donations may be made to NAMI Massachusetts, 529 Main St., Suite #1M17, Boston, MA 02129.\nGet everything you need to know to start your day, delivered right to your inbox every morning.\nStay up to date with everything Boston. Receive the latest news and breaking updates, straight from our newsroom to your inbox."
    },
    {
      "url": "https://people.com/hayley-mcneff-family-speaks-out-after-sudden-death-exclusive-11791238",
      "text": "Fitness Influencer Hayley McNeff's Family Speaks Out After Her Sudden Death at Age 37 (Exclusive) The champion bodybuilder died at her home in Sudbury, Mass., on Aug. 8, McNeff’s father confirmed to PEOPLE By Luke Chinman Luke Chinman Luke Chinman is a writer at PEOPLE. He joined PEOPLE in 2024. His work has previously appeared in The Berkshire Eagle and Luxe Interiors + Design. People Editorial Guidelines Published on August 14, 2025 02:53PM EDT Leave a Comment Hayley McNeff. Credit : Hayley McNeff/Instagram NEED TO KNOW Following influencer and champion bodybuilder Hayley McNeff’s sudden death at 37, her family is speaking outIn an exclusive statement to PEOPLE, McNeff’s father writes, “Hayley was like a beam of light in this world\" McNeff was a decorated athlete, counting bodybuilding state titles in Maryland and Delaware among her achievements The family of influencer and champion bodybuilder Hayley McNeff is speaking out after her sudden death. “Hayley was like a beam of light in this world. She had boundless energy and was very determined to achieve whatever she set out to do,” Hayley’s father Dave tells PEOPLE in an exclusive statement. “She set her sights on bodybuilding and fitness and achieved the highest success that sector offered. She loved us and we love Hayley very much, we miss her madly.” The 37-year-old bodybuilder died at her home in Sudbury, Mass., on Aug. 8, her family confirmed to PEOPLE. According to an official obituary published in local outlet Boston.com on Aug. 12, the death of the lifelong athlete was “unexpected but peaceful.” McNeff was born and raised in Concord, Mass., where she graduated from Concord-Carlisle High School and went off to the University of Massachusetts Amherst for her bachelor’s degree, per her obituary. In addition to bodybuilding, which she picked up as an adult, McNeff excelled at equestrian, board diving and skiing. Hayley McNeff. Hayley McNeff/Instagram Our new app is here! Free, fun and full of exclusives. Scan to download now! McNeff’s obituary says she was a decorated bodybuilder — counting state titles in Maryland and Delaware among her achievements — and she was featured in the 2005 documentary Raising the Bar, which explores the world of competitive bodybuilding. After stepping away from the sport later in life, she pursued a graduate degree in psychology. Per McNeff’s obituary, the late bodybuilding champion will be remembered for her “quick wit” and “constant sense of humor.” Hayley McNeff. Hayley McNeff/Instagram “She had a gift for making those around her laugh and feel welcomed,” the obituary continues. “Her energy and determination was a constant in her life and she always accomplished what she set out to achieve. She treasured her friendships and nurtured strong, lasting relationships with those who knew her best. Hayley will be deeply missed by her parents, siblings, extended family, and friends.” Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. Close Leave a Comment Read more: Celebrity Celebrity Deaths Celebrity Death Tributes"
    },
    {
      "url": "https://nypost.com/2025/08/14/sports/three-wnba-players-ejected-after-fiery-sun-sky-scrap/",
      "text": "Apparently ejections now comes in threes.\nA trio of WNBA players earned the boot Wednesday night following an altercation during the Sun’s 71-62 home win over the Sky.\nConnecticut’s Bria Harley and Chicago’s Rebecca Allen each received ejections for starting the scuffle, while the Sky’s Ariel Atkins’ night ended early “for being an escalator” after shoving Hartley and touching a referee, according to crew chief Angelia Suffern as reported by ESPN.\nThe situation unfolded early in the second quarter when the Sun’s Saniya Rivers and Hartley battled Allen for a rebound, which the former corralled.\nHartley and Allen tangled arms and in the battle for the ball, Hartley seemingly shoved Allen to the floor.\nAllen attempted to grab Hartley as she fell before later taking a hold of her jersey for several seconds while her opponent stood over her.\nPlayers from both sides eventually made their way over, with Atkins running full steam into a referee while she attempted to confront Hartley.\nWhile said referee attempted to distance Atkins from Harley, she nudged the official.\nAtkins and Hartley then yelled at one another as the tensions started to calm down.\nThe skirmish reportedly stopped play for roughly 10 minutes.\nHartley and Allen both did not score in their 10 minutes before being ejected, while Atkins had five points.\nSky coach Tyler Marsh called the situation “unfortunate.”\n“I think things like that have a tendency to happen when there’s not a control put on the game prior to — there’s usually an incident that goes overlooked that leads to something like that,” Marsh said. “I think [Allen] clearly got elbowed in the face right in front of the ref. It wasn’t called. Then, other things ensued.\n“It’s unfortunate for us. Two players that play high-quality, high-valuable minutes for us, we were down for most of the game. It was tough. I thought the team rallied back, fought hard to finish it out but it’s unfortunate.”\nThe ejections left the Sky with just eight players available in the second half due to Angel Reese missing the game with a back injury and Courtney Vandersloot being sidelined with an ACL tear.\nThe Sky (8-24) have now lost 11 of 12, including three straight."
    },
    {
      "url": "https://nypost.com/2025/08/13/sports/taylor-swift-reveals-question-that-left-travis-kelce-speechless-on-first-date/",
      "text": "Taylor Swift didn’t sugarcoat a thing while discussing her first date with Travis Kelce that took place sometime after the Chiefs tight end attended an Eras Tour show in Kansas City in the summer of 2023.\nDuring her world-consuming appearance on the “New Heights” podcast Wednesday, Swift recalled not knowing anything about football — and asking Kelce “the most insane question” about playing in the Super Bowl against his brother, former Eagles center Jason Kelce, who retired in March 2024.\n“I knew he wasn’t crazy the first couple of times we talked… He’s like a human exclamation point,” Swift, 35, said. “I use so many more exclamation points now. And you aren’t judgmental that I knew nothing about the world you’re in.\n“On our first date, I legitimately asked him what it was like when the Chiefs played the Eagles in the Super Bowl, and he looked across the line of scrimmage and saw his brother standing five feet away from him.”\nTravis was speechless because that wasn’t possible, as the brothers played offensive positions and wouldn’t be on the field at the same time.\n“He didn’t even look at me,” Swift said, laughing.\n“I now know what an insane question that was… I thought everyone was out there at the same time… I didn’t know what a first down was… what a tight end was… I fell in love with it, I became obsessed with it.”\nKelce and Swift went public with their relationship in October 2023, when they were spotted holding hands in New York City.\nIn an interview with Time magazine that December, Swift said they were a couple when she attended the Sept. 24 game against the Bears at Arrowhead Stadium — and “we walked right in” through the general admission entrance.\n“I love this new world that Travis has shown me,” Swift said. “It’s so fun, it’s so exciting, there is so much pressure on these players … the pressure on sports is such a different type that I have such respect for everyone, everyone on his team.”\nKelce repeatedly said on the podcast that he’s the luckiest guy in the world.\n“I’ve been so lucky because I never got to see what the suite was when I played,” said Kelce, to which Swift quipped, “Because there was never a camera on it.”\nAs for her relationship with sports, pre-Kelce: “I grew up in [Pennsylvania], I always used to hear my dad yelling at the screen watching Eagles games,” Swift said. “I would go to sporting events so that I could sing the national anthem. Everything was a means to an end to get me to do music.\n“But I definitely became obsessed with sports because of [Travis]. I’m competitive on his behalf.”\nEarlier on the show, Swift said that “New Heights” podcast “got me a boyfriend because Travis decided to use it as his personal dating app two years ago.”"
    }
  ],
  "argos_summary": "Bodybuilding champion Hayley McNeff passed away unexpectedly at the age of 37, with her family describing her as a 'beam of light' and a determined individual who achieved great success in bodybuilding. McNeff, a Concord, Massachusetts native, was known for her accomplishments in the sport, including state titles and a feature in the documentary 'Raising the Bar.' Following her retirement, she pursued a graduate degree in psychology and was remembered for her humor and strong relationships with friends and family. A service is planned in her honor, with donations requested for the National Alliance on Mental Illness.",
  "argos_id": "35LDCLW2A"
}