{
  "url": "https://www.startribune.com/gov-tim-walz-wavering-on-third-term-setting-off-quiet-scramble-within-dfl/601454550",
  "authorsByline": "Sydney Kashiwagi, Ryan Faircloth",
  "articleId": "e3be098e0a564a5b850e64d299a21940",
  "source": {
    "domain": "startribune.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MN",
      "county": "Hennepin County",
      "city": "Minneapolis",
      "coordinates": {
        "lat": 44.9772995,
        "lon": -93.2654692
      }
    }
  },
  "imageUrl": "https://arc.stimg.co/startribunemedia/EPGQ7QENVFE6HBC4DR7AC7PXOU.JPG?&w=1200&ar=1.91:1&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T21:56:49.690000+00:00",
  "addDate": "2025-08-14T22:02:29.617842+00:00",
  "refreshDate": "2025-08-14T22:02:29.617847+00:00",
  "score": 1.0,
  "title": "Gov. Tim Walz wavering on third term, setting off quiet scramble within DFL",
  "description": "Democrats are eagerly waiting to see if Walz will run for re-election, and some are eyeing higher office if he steps aside.",
  "content": "Review: New stories put characters at the corner of ‘huh?’ and ‘yikes’\n\nGreat Clips CEO, who built the company into the country’s largest salon chain, is retiring\n\nSocial Security has existed for 90 years. Why it may be more threatened than ever\n\nMinneapolis Park Police officer’s gun was holstered when man fired it during scuffle, charges say\n\nGov. Tim Walz wavering on third term, setting off quiet scramble within DFL Democrats are eagerly waiting to see if Walz will run for re-election, and some are eyeing higher office if he steps aside. Minnesota Gov. Tim Walz acknowledges applause before delivering his State of the State address to a joint session of the Legislature at the State Capitol in St. Paul on April 23. (Jeff Wheeler/The Minnesota Star Tribune)\n\nMinnesota Gov. Tim Walz is privately wavering on whether to seek re-election after previously signaling he was likely to run, a shift that’s prompting intense speculation about his political future and jockeying among Democrats with ambitions for higher office. Walz has gone from walking up to the line of declaring he will run for a third term to privately questioning in recent weeks if he wants to serve for 12 consecutive years, according to interviews with nearly a dozen people in the party, including some who are close to the governor. The DFL governor has pushed back self-imposed deadlines to announce his plans from the early summer to after Labor Day. Walz was knocked off course by the June 14 assassination of Melissa Hortman, who was his close friend and governing partner in the Minnesota House, according to several people with knowledge of his thinking. His reluctance also comes as he could face considerable headwinds if he runs for re-election, after a failed vice presidential bid that eroded his popularity in parts of the state. His hesitation has been noticed by party activists and officials, several of whom put the odds of him running in 2026 at 50-50. A bench of Democrats is eager to run if the seat opens up in a state where Republicans haven’t won the governor’s office in nearly 20 years. “There are people clearly ready to jump if he makes the decision not to run,” said former Minnesota DFL chair Mike Erlandson, who added he’s heard of some Democrats who are “rearranging the deck chairs” ahead of Walz’s announcement. “There will be a furious race, potentially.” Walz told the Minnesota Star Tribune in July that Hortman is “irreplaceable” and her death “could be a reason to do it again and a reason not to.” People close to Walz said he viewed Hortman as a possible gubernatorial successor and running mate, since current Lt. Gov. Peggy Flanagan is running for the U.S. Senate. But Walz and his team knew it would be hard to sell Hortman on leaving her beloved House leadership post to become his second-in-command.\n\nMinnesota Governor Tim Walz listens during an interview with Star Tribune journalists in the governor’s office at the Minnesota State Capitol on Dec. 12, 2024. (Alex Kormann/The Minnesota Star Tribune) The Walz campaign is preparing as if he is going to run. A senior advisor to the campaign said Walz raised more than $1 million this summer. The advisor said they’re also interviewing candidates for the role of campaign manager. “Governor Walz is focused on the future of Minnesota — building better schools, safeguarding against Republican attacks on health care, and expanding greater economic opportunity for all,” Walz’s spokesman, Teddy Tschann, said in a statement Thursday. “He’s energized by the enthusiastic support Minnesotans have shown for his vision.” If Walz doesn’t run, his departure could trigger a domino effect of statewide office openings. Party insiders widely believe Minnesota Secretary of State Steve Simon and Attorney General Keith Ellison could both run for governor if Walz steps aside, creating additional statewide vacancies. Asked Tuesday if he would run for governor if Walz stepped aside, Ellison said, “I’m not ready to make any news about that today.” Earlier this year, Ellison indicated he planned to run for re-election as attorney general. Simon declined to comment. His team did not rule out the possibility of him running for governor when asked about his future in May.\n\nSecretary of State Steve Simon speaks during a press conference on June 18, 2024. (Glen Stubbe/The Minnesota Star Tribune) Other Democrats whose names have been floated for governor include U.S. Sen. Amy Klobuchar, Minnesota Senate Majority Leader Erin Murphy and St. Paul Mayor Melvin Carter. Asked if she is considering running for governor if Walz decides not to, Klobuchar would not say. Instead, she said she hopes Walz runs for re-election and that she thinks he will. A person close to Carter said he’s strongly considering running for governor, and that he had been gearing up for a gubernatorial run since earlier this year when Walz was considering running for U.S. Senate. Carter, who is facing a challenge from his former aide and state Rep. Kaohly Vang Her, could not immediately be reached for comment on his plans. Some Democrats are eyeing other statewide offices in the event of a shuffle at the top of the ticket. Ben Weisbuch, who leads the Minnesota DFL’s Jewish Community Outreach Organization, is moving closer to a bid for secretary of state if Simon doesn’t seek re-election and runs for governor instead.\n\n“I’ve heard the rumors like everyone else has,” Weisbuch said, referring to the possibility of Walz not seeking a third term. Weisbuch said he will only run for secretary of state if Simon steps aside. DFL state Rep. Emma Greenman, a voting rights attorney, told the Star Tribune that people have encouraged her to run for secretary of state or for attorney general if the offices open up. Other possible candidates for attorney general include former DFL House Majority Leader Ryan Winkler and Democratic state Rep. Zack Stephenson, among others. Minnesota Attorney General Keith Ellison sifts through the piles of executive orders and directives by the Trump administration while in his office at the Minnesota Capitol in St. Paul on April 9. (Elizabeth Flores/The Minnesota Star Tribune) The reshuffling from a Walz departure could be reminiscent of 2018, when then-Attorney General Lori Swanson announced she would run for governor instead of re-election. Her departure prompted Ellison to run for attorney general instead of re-election to Congress and led to Rep. Ilhan Omar running for and winning Ellison’s congressional seat. Democratic strategist Abou Amara said the 2026 election could provide the DFL an opportunity for a “generational reset” if Walz steps aside and Simon and Ellison leave their offices to run for governor. It could also prove to be a “stress test” for the direction the DFL takes into the future.",
  "medium": "Article",
  "links": [
    "https://www.startribune.com/news-politics",
    "https://www.startribune.com/author/sydney-kashiwagi/600362766",
    "https://www.startribune.com/minnesota-secretary-of-state-steve-simon-wont-run-for-us-senate/601345152",
    "https://www.startribune.com/author/ryan-faircloth/6370411",
    "https://www.startribune.com/gov-tim-walz-bullish-about-re-election-chances-if-we-run-again-we-will-win/601392790"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Minnesota Gov. Tim Walz",
      "weight": 0.09629271
    },
    {
      "name": "Minnesota Governor Tim Walz",
      "weight": 0.093801536
    },
    {
      "name": "Tim Walz",
      "weight": 0.0852323
    },
    {
      "name": "Gov. Tim Walz",
      "weight": 0.084082216
    },
    {
      "name": "Walz",
      "weight": 0.08252796
    },
    {
      "name": "Governor Walz",
      "weight": 0.080690034
    },
    {
      "name": "Minnesota Attorney General Keith Ellison",
      "weight": 0.07464288
    },
    {
      "name": "former Minnesota DFL chair Mike Erlandson",
      "weight": 0.07275988
    },
    {
      "name": "Minnesota",
      "weight": 0.07114438
    },
    {
      "name": "DFL state Rep. Emma Greenman",
      "weight": 0.067097686
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.98095703125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.970703125
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.86767578125
    },
    {
      "name": "/News/Local News",
      "score": 0.8642578125
    },
    {
      "name": "/News/Other",
      "score": 0.482666015625
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.40576171875
    }
  ],
  "sentiment": {
    "positive": 0.06495134,
    "negative": 0.67219764,
    "neutral": 0.26285103
  },
  "summary": "Minnesota Gov. Tim Walz is reportedly wavering on running for a third term, setting off a scramble within DFL Democrats. The shift has fueled speculation about his political future and potential for higher office. If Walz does not run, his departure could trigger a domino effect in statewide office positions. Some Democrats are eyeing higher office if he steps aside. Walz's decision to run for re-election was influenced by the assassination of Melissa Hortman, his close friend and governing partner in the Minnesota House. His campaign is preparing as if he is running, raising over $1 million this summer and interviewing candidates for the role of campaign manager.",
  "shortSummary": "Minnesota Governor Tim Walz is wavering on seeking a third term, sparking a DFL party scramble and potential leadership changes, amid concerns over his future role and political popularity.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8ba5b75b53df4537a481b127b59adc7b",
  "places": [
    {
      "osmId": "99776960",
      "road": "Capitol Heights",
      "suburb": "Frogtown",
      "city": "Saint Paul",
      "county": "Ramsey County",
      "state": "Minnesota",
      "postcode": "55103",
      "country": "United States",
      "countryCode": "us",
      "amenity": "State Lot Q",
      "coordinates": {
        "lat": 44.957228900000004,
        "lon": -93.10001485426822
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.startribune.com/gov-tim-walz-bullish-about-re-election-chances-if-we-run-again-we-will-win/601392790",
      "text": "Gov. Tim Walz on Monday gave his strongest signal yet that he intends to seek a third consecutive term next year, confidently predicting he will win if he runs again and warning possible challengers they’d face the “best fundraiser that ever sat in this office.”\nIn a wide-ranging interview with the Minnesota Star Tribune, Walz said he believes Republicans will face a poor midterm election outlook next year due to the unpopularity of President Donald Trump and his signature tax and spending bill that was approved by Congress last week. Walz said he is well positioned to make a case for re-election in 2026, arguing he has led the state through challenging times and can continue to be a counterweight to the Trump administration.\n“It won’t be me against a theoretical Republican. It will be one of theirs who will bend the knee to Donald Trump, and it will be this bill tanking the economy and Donald Trump having done more stuff,” Walz said. “If we run again, we will win.”\n“I have the capacity to ramp up a campaign that would be bigger than anything that they would see,” Walz added.\nOne prominent Republican, Kendall Qualls, has entered the 2026 race for governor so far. Qualls, an Army veteran and former health care executive, campaigned for governor in 2022 and narrowly lost the GOP endorsement to Scott Jensen.\nWalz could face some resistance if he runs again, particularly from voters outside the core metro counties. More voters recently polled by the Minnesota Star Tribune said they’d rather see him step aside than seek a third term, and at least 6 in 10 registered voters outside Hennepin and Ramsey counties said they disapprove of the governor’s performance in office, including in the suburbs.\nAsked when he’ll formally announce his re-election plans, the DFL governor said, “I think you can probably start to figure it out.” He said he will decide soon but is giving it a little more thought after the assassination of Rep. Melissa Hortman, his close governing partner.\nWalz said he expects to face some of his most difficult governing decisions yet over the next 18 months, due to cuts Republicans in Congress made to federal entitlements, including Medicaid and nutrition. He said it’d be difficult for him to say he’s “not going to do [the job] after that.”"
    },
    {
      "url": "https://www.startribune.com/minnesota-secretary-of-state-steve-simon-wont-run-for-us-senate/601345152",
      "text": "Secretary of State Steve Simon won’t run for U.S. Senate, making him the latest well-known Minnesota Democrat to pass on a bid for retiring Sen. Tina Smith’s seat.\nHis decision follows Gov. Tim Walz, Attorney General Keith Ellison, U.S. Rep. Ilhan Omar and Dave Wellstone, the son of the late Minnesota Sen. Paul Wellstone, who all announced in recent weeks that they were staying out of the contest.\nSimon’s decision means the Democratic field may be close to set with Lt. Gov. Peggy Flanagan, U.S. Rep. Angie Craig and former state Sen. Melisa López Franzen currently in the running.\n“He’s not looking to run for Senate at this time,” Simon’s campaign spokesperson Risikat Adesaogun told the Minnesota Star Tribune, adding that Simon will not endorse in the Senate race because he never makes endorsements in his current role.\nDFL sources say Simon is interested in a gubernatorial bid, but only if Walz doesn’t run for re-election. Walz has said he will announce this summer whether he will seek a third term as governor.\nAdesaogun would not confirm or deny when asked if Simon would run for governor. She also was not able to provide a timeline on when Simon would make a decision on a re-election bid for his current position.\n“It’s great that there’s interest in this very important job in Minnesota and in the country, but Steve is very much still focusing on his work to protect democracy and the rights of Minnesotans,” Adesaogun said when asked if Simon is considering a governor run.\nSimon won a third term as secretary of state in 2022, in race that became a test of voters’ faith in the state’s election system. Simon beat Republican Kim Crockett, an attorney who had cast doubt on the results of the 2020 presidential election, by more than 9 percentage points."
    }
  ],
  "argos_summary": "Minnesota Governor Tim Walz is reconsidering his plans for re-election, prompting speculation among Democrats about potential candidates for the governorship if he decides not to run. His hesitation follows the assassination of a close ally and a decline in his popularity after a failed vice presidential bid. Several prominent Democrats, including Secretary of State Steve Simon and Attorney General Keith Ellison, are eyeing the governor's seat, which could lead to a significant reshuffling of statewide offices in Minnesota.",
  "argos_id": "3E34N2VQQ"
}