{
  "url": "https://nypost.com/2025/08/14/us-news/alleged-devils-den-killer-pleads-not-guilty-to-capital-murder-charges/",
  "authorsByline": "Caitlin McCormack",
  "articleId": "27a3034e849c4388a248c5e7cf97897c",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/COMP-AP_Arkansas-Hikers-Killed_03558-c0d0a-0.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T00:23:55+00:00",
  "addDate": "2025-08-15T00:26:04.894188+00:00",
  "refreshDate": "2025-08-15T00:26:04.894191+00:00",
  "score": 1.0,
  "title": "Alleged Devil’s Den killer pleads not guilty to capital murder charges for slaughter of parents in front of young daughters",
  "description": "Andrew James McGann, 28, was charged with two counts of capital murder for the July 26 killing of Clinton David Brink, 43, and Cristen Amanda Brink, 41.",
  "content": "The depraved teacher, who authorities claim confessed to stabbing a couple hiking in Arkansas with their two young daughters, pleaded not guilty to capital murder charges Thursday.\n\nAndrew James McGann, 28, was charged with two counts of capital murder for the July 26 killing of Clinton David Brink, 43, and Cristen Amanda Brink, 41.\n\nMcGann was set to start working at Springdale Public Schools, just 30 miles north of Devil’s Den State Park, where he allegedly slaughtered and ditched Clinton and Cristen’s bodies.\n\nThe couple died protecting their daughters, 9 and 7 years old, from their killer, family members said.\n\nThe girls were found uninjured after the attack and were placed in the custody of other family members.\n\nAuthorities have yet to determine a motive for the attack, but don’t suspect the young girls were the primary targets.\n\nPolice said that Clinton hung behind to try and fend off the assailant while Cristen rushed their children to safety. Once they were far enough away, Cristen doubled back to help her husband and was eventually killed alongside him.\n\nTheir bodies were found in a remote part of the park, far off the hiking trail. By then, their assailant was long gone, and police waited six hours before notifying the public that an apparent murderer was still at large.\n\nIn the days following the brutal double homicide, a statewide manhunt ensued as police provided a sketch and descriptions of the killer based on the courageous girls’ vivid accounts.\n\nOn July 31, McGann was arrested mid-haircut, which authorities chalked up to the teacher’s attempt to get a fresh back-to-school look — not to conceal his identity.\n\nMcGann’s shellshocked hairdresser described him as “soulless,” while parents of his former students said he was frequently “standoffish” and relatively “disinterested in his students.”\n\nHe resigned from an elementary school in Texas in 2023 after an internal investigation found that “his classroom management and professional judgment” were below par.\n\nAt the same time, he faced allegations of displaying inappropriate behavior in front of his students, including “tickling” and giving gifts to female students, horrified parents told The Post.\n\nCircuit Judge Joanna Taylor scheduled McGann’s next hearing for Nov. 14. He’s being held without bond.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/07/28/us-news/parents-murdered-at-devils-den-were-heroes-protecting-their-little-girls-family-says/",
    "https://nypost.com/2025/07/28/us-news/arkansas-couple-killed-at-devils-den-state-park-while-hiking-with-young-daughters-suspect-at-large/",
    "https://nypost.com/2025/08/01/us-news/teacher-accused-in-devils-den-murders-of-married-couple-in-front-of-their-daughters-barely-speaks-during-brief-hearing-as-hes-held-without-bail/",
    "https://nypost.com/2025/08/01/us-news/devils-den-killer-andrew-james-mcgann-was-pretty-cold-teacher/",
    "https://nypost.com/2025/07/29/us-news/arkansas-police-release-sinister-photo-of-parent-killer-wanted-for-devils-den-double-homicide-as-manhunt-continues/",
    "https://nypost.com/2025/08/01/us-news/devils-den-state-park-murder-suspect-andrew-james-mcgann-arrested-in-arkansas-lupitas-beauty-salon/",
    "https://nypost.com/2025/07/30/us-news/28-year-old-suspect-charged-with-devils-den-park-murders-of-married-couple-hiking-with-daughters/",
    "https://nypost.com/2025/07/31/us-news/devils-den-victim-mom-was-slaughtered-after-saving-daughters-and-then-running-back-to-help-husband-cops/",
    "https://nypost.com/2025/07/31/us-news/devils-den-alleged-killer-james-andrew-mcgann-is-teacher-who-may-have-been-fired-for-misconduct/",
    "https://nypost.com/2025/08/01/us-news/devils-den-murder-suspect-andrew-james-mcgann-would-tickle-girls-told-one-i-wish-you-could-be-my-girlfriend-parent-at-his-former-school-says/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "capital murder charges",
      "weight": 0.078532495
    },
    {
      "name": "Andrew James McGann",
      "weight": 0.07517326
    },
    {
      "name": "capital murder",
      "weight": 0.07369695
    },
    {
      "name": "Cristen Amanda Brink",
      "weight": 0.07191422
    },
    {
      "name": "McGann",
      "weight": 0.071305335
    },
    {
      "name": "young daughters",
      "weight": 0.071094476
    },
    {
      "name": "Clinton David Brink",
      "weight": 0.06940138
    },
    {
      "name": "female students",
      "weight": 0.068210654
    },
    {
      "name": "horrified parents",
      "weight": 0.06326451
    },
    {
      "name": "Cristen",
      "weight": 0.062442545
    }
  ],
  "topics": [
    {
      "name": "Crime"
    },
    {
      "name": "Murder"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.97900390625
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.96044921875
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.931640625
    },
    {
      "name": "/News/Other",
      "score": 0.8896484375
    },
    {
      "name": "/News/Local News",
      "score": 0.8896484375
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.533203125
    }
  ],
  "sentiment": {
    "positive": 0.05376868,
    "negative": 0.75136995,
    "neutral": 0.19486143
  },
  "summary": "Andrew James McGann, a former Springdale Public Schools teacher, has been charged with capital murder for the murder of Clinton David Brink, 43, and Cristen Amanda Brink 41 in front of their two young daughters in July. The couple died protecting their daughters, who were found uninjured after the attack. McGann allegedly confessed to the crime and was arrested mid-haircut to conceal his identity. He is currently being held without bond. The motive for the attack is yet to be determined.",
  "shortSummary": "Andrew McGann, the depraved teacher accused of murdering parents in Arkansas, pleaded not guilty to capital murder charges, despite being known for inappropriate behavior.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8694a4d7a50a42768b307651ad0441ae",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/07/30/us-news/28-year-old-suspect-charged-with-devils-den-park-murders-of-married-couple-hiking-with-daughters/",
      "text": "28-year-old suspect charged with Devil’s Den park murders of married couple hiking with daughters\nA suspect has been arrested for the heartless double murder of two parents who were slain protecting their young daughters on a hiking trail in Arkansas’ Devil’s Den State Park on Saturday — ending a frantic, five-day manhunt.\nAndrew James McGann, 28, was arrested Wednesday in Springdale, Ark., and charged with two counts of capital murder, according to a release from the Arkansas State Police.\nClinton David Brink, 43, and his wife, Cristen Amanda Brink, 41, were hiking with their two daughters, 7 and 9, through Devil’s Den State Park on Saturday when a man alleged to be McGann attacked them on a trail around 2:30 p.m., officials said.\nThe children escaped unharmed and reported that their parents were stabbed along a trail at the tourist destination famous for its caves and rock formations, according to a CNN report.\n“Clinton and Cristen died heroes protecting their little girls, and they deserve justice,” the Brink family told local ABC News in a statement.\nThe heroic parents’ bodies were found on the popular hiking trail hours after the grisly attack, setting off a desperate search for their killer — described as a man wearing a baseball cap, sunglasses and fingerless weightlifting gloves.\nThe Brinks had recently moved to Arkansas from South Dakota. Clinton was set to start his new job as a milk delivery driver on Monday, his employer said.\nInvestigators have not announced a motive for the twisted killings, but state officials praised the arrest.\n“No news can heal the enormous harm done to the Brink family in last weekend’s crime, but this announcement is a comfort and reassurance for our State,” Gov. Sarah Huckabee Sanders said in the release.\n“If you target innocent people, law enforcement will hunt you down and bring you to justice,” Sanders said.\nLocal law enforcement called McGann a “monster” and praised investigators for the quick apprehension.\n“Because of their hard work and investigative skill, we were able to take a monster off the streets, and bring relief to those two precious girls, and the rest of our citizens,” state police Col. Mike Hagar said in the arrest announcement."
    },
    {
      "url": "https://nypost.com/2025/08/01/us-news/devils-den-murder-suspect-andrew-james-mcgann-would-tickle-girls-told-one-i-wish-you-could-be-my-girlfriend-parent-at-his-former-school-says/",
      "text": "Devil’s Den murder suspect Andrew James McGann would ‘tickle’ girls, told one, ‘I wish you could be my girlfriend,’ parent at his former school says\nThe teacher accused of murdering two parents in front of their young daughters at Devil’s Den State Park in Arkansas once put a little girl on his lap and asked her to be his “girlfriend” at his former Texas school, a disturbed parent recalled to The Post Friday.\nAndrew James McGann, 28 — who authorities say admitted to butchering Clinton David Brink, 43, and wife Cristen Amanda Brink, 41, on Saturday — put the “little girl on his lap” and said “things like, ‘I wish I could date you, I wish you could be my girlfriend,’ just really nasty like grooming behavior,” said Zacharri Polyak, whose son attended Donald Elementary School in Flower Mound when the accused killer taught there.\n“This monster was around our children,” fumed the dad, who added that his son was occasionally in his class on Fridays.\n“Mr. McGann was giving a lot of special treatment to girls in particular. He was giving them candy, bringing them Sonic drinks, playing tag with them, tickling them, just really suspect behavior,” Polyak said.\nThe north Texas school district, Lewisville ISD, told The Post McGann was placed on administrative leave “following concerns related to classroom management, professional judgement, and student favoritism” while he was employed during the 2022-2023 school year.\nHowever, their “internal investigation found no evidence of inappropriate behavior with students.”\nMcGann resigned in May 2023, according to the school district.\nBut Polyak expressed outrage that he was let off so easily.\n“It should have been an immediate firing with reports to Child Protective Services,” he charged.\nSierra Marcum, whose son was in McGann’s fourth-grade class at the Texas school, shared that the alleged murderer was strange and standoffish during her previous encounters with him.\n“[He was] pretty cold. You could ask him a question, and he would give you a one-word response,” Marcum said. “Overall, just pretty disinterested in his students.”\nHe was the “most standoffish teacher” she had ever met, she said.\nMarcum reported some of McGann‘s behavior to a principal after her son came home upset, she said.\n“Eventually, he told me that he and some other classmates had noticed that Mr. McGann was very touchy and showed a lot of favoritism to certain girls in the class,” Marcum said, without elaborating.\n“I guess [the murder allegations] did surprise me, because while I thought he was off, I never thought he was violent,” she told WFAA.\nMcGann was hired the next school year to teach fifth grade at Spring Creek Elementary in Oklahoma – which told The Post that a thorough background check turned up nothing to indicate he shouldn’t be hired.\n“As with all district employees, McGann underwent and passed all legally required national background checks,” the school district said in a statement, adding that no alarms were raised during his interview and that there was never reason to discipline him during his tenure.\nMcGann was set to start a new teaching job at Springdale Public Schools in a week.\nSPS superintendent Jared Cleveland confirmed McGann had been hired for the teaching job, but said he “has not at any time come into contact with Springdale students or the families we serve,” according to 5 News.\nMcGann allegedly ambushed the parents and stabbed them to death while their two daughters, ages 9 and 7, ran to safety. The two girls were unharmed.\nPolice tracked down McGann at a barbershop and arrested him mid-haircut after a five-day manhunt.\nHe was charged Wednesday with capital murder.\nMcGann appeared in court Friday and was ordered held without bail, according to News 5.\nInvestigators have yet to determine a motive for the deadly attack."
    },
    {
      "url": "https://nypost.com/2025/07/29/us-news/arkansas-police-release-sinister-photo-of-parent-killer-wanted-for-devils-den-double-homicide-as-manhunt-continues/",
      "text": "Arkansas police release sinister photo of parent killer wanted for Devil’s Den double homicide as manhunt continues\nArkansas State Police released a sinister image of the heartless man they suspect killed the parents of two young girls while hiking in Devil’s Den State Park last Saturday — as the manhunt for the double murderer presses on into a fourth day.\nThe photo shows a man standing in the woods with his back to the camera near the edge of a trail overlooking thick foliage and underbrush.\nHis face is not visible, but the image shows many of the suspect’s recognizable features from behind, including a baseball cap, short dark hair and a large backpack — matching a suspect sketch released by authorities earlier Tuesday.\nPolice are still searching for a white male with a medium build who was last seen wearing a long-sleeved shirt with the sleeves rolled up, dark pants, a dark baseball cap, sunglasses and fingerless gloves, officials said.\nAuthorities added that the suspect was wearing a black backpack at the time of the murders, which was captured in the photo released by police.\nThey believe he fled the scene in a black four-door sedan that might have been a Mazda with a taped-over license plate.\nLast Saturday, Clinton David Brink, 43, and Cristen Amanda Brink, 41, were found dead in a remote part of the 2,500-acre park. They were attacked while they were on a hike with their two young daughters.\nTheir children, ages 7 and 9, turned up at the park’s visitor center unharmed and were released into the custody of other family members.\nThe family remembered the couple as “heroes protecting their little girls.”\n“They will forever live on in all of our hearts,” the family wrote in a statement.\nThe Brinks had recently moved to Arkansas from South Dakota. Clinton was set to start his new job as a milk delivery driver on Monday, his employer said.\nThe bodies were taken to a state crime lab to determine the exact cause of death, authorities said.\nInvestigators are still working to determine a motive.\nThe Devil’s Den State Park, tucked away within the Ozark National Forest, is best known for its natural beauty, including multiple caves and rock formations, along with recreational activities like fishing and horseback riding."
    },
    {
      "url": "https://nypost.com/2025/08/01/us-news/devils-den-killer-andrew-james-mcgann-was-pretty-cold-teacher/",
      "text": "Devil’s Den murder suspect Andrew James McGann was ‘most standoffish’ elementary school teacher: ‘Just pretty disinterested’\nThe teacher accused of murdering a couple as they hiked with their two young daughters at Devil’s Den State Park in Arkansas was “cold” and “disinterested” in his students before he was placed on administrative leave two years ago, parents recalled.\nAndrew James McGann, 28 — who authorities say admitted to butchering Clinton David Brink, 43, and wife Cristen Amanda Brink, 41, on Saturday — was strange and standoffish in class, said Sierra Marcum, whose son was in McGann’s fourth-grade class.\n“[He was] pretty cold. You could ask him a question, and he would give you a one-word response,” Marcum said. “Overall, just pretty disinterested in his students.”\nHe was the “most standoffish teacher” she had ever met, she said.\nMarcum, whose son was in McGann’s class at Donald Elementary School in Flower Mound, Texas, in 2023, reported some of McGann‘s behavior to a principal after the boy came home from school upset, she said.\n“Eventually he told me that he and some other classmates had noticed that Mr. McGann was very touchy and showed a lot of favoritism to certain girls in the class,” Marcum said, without elaborating.\n“I guess [the murder allegations] did surprise me, because while I thought he was off, I never thought he was violent,” she told WFAA.\nMcGann was eventually placed on administrative leave from the school in spring 2023 “following concerns related to classroom management, professional judgment, and student favoritism,” according to a spokesperson for the Lewisville Independent School District.\nAn internal investigation found no evidence of “inappropriate behavior” with students, the school district said.\nMcGann is accused of ambushing the parents on the remote trail and stabbing them to death while their daughters, ages 9 and 7, fled to safety and were unharmed.\nThe frightening random attack sparked a five-day manhunt ending in McGann being tracked to a barbershop and arrested mid-haircut. He was charged Wednesday with capital murder.\nHe briefly appeared in court Friday, when he was assigned a public defender and ordered held without bail, according to 5newsonline.com\nWashington County Prosecutor Brandon Carter said he planned to request a no-contact order for the family of the victims, if a bond for McGann is eventually set.\nInvestigators are still searching for a motive in the deadly attack.\nWith Post wires"
    },
    {
      "url": "https://nypost.com/2025/07/28/us-news/arkansas-couple-killed-at-devils-den-state-park-while-hiking-with-young-daughters-suspect-at-large/",
      "text": "Arkansas police searching for murderer who killed couple at Devil’s Den, cops didn’t alert public of double homicide for 6 hours\nThe desperate hunt for the murderer who killed a married couple in front of their young daughters at Devil’s Den State Park in Arkansas was stepped up Monday — as cops also scrambled to justify taking six hours to alert the public that a double killer was on the run.\nCalls first came in at 2:30 p.m. that there was a potential assault in the eerily named state park — with first responders then hearing screams, according to 5News.\nBy the time they caught up to the family, it was too late, and parents Clinton David Brink, 43, and Cristen Amanda Brink, 41, were found dead, officials said.\nThey were attacked in front of their two daughters — ages 7 and 9 — who were found safe and uninjured nearby.\nPolice did not elaborate on how or when the couple was killed. Reporters received tips of a massive police presence in the area at 4:30 p.m., but were told to leave the area and given no info, 5News said.\nIt was not until 8:40 p.m. — roughly six hours after the initial call — that Arkansas State Police released the first warning that a massive manhunt was underway, the outlet noted.\nThe delay was blamed on how “the terrain is rugged, vegetation is thick and there is no cellphone service.”\n“The location is in remote, rural Arkansas,” an ASP spokesperson told 5News. “It took time for our special agents to arrive on scene, locate witnesses, conduct interviews, and collaborate information so we released the appropriate information.”\nPolice issued an updated description of the suspect on Sunday and said he was last seen wearing a long-sleeve shirt with the sleeves rolled up rather than a tank top as initially reported.\nHe is described as having a medium build, wearing dark pants, a red baseball cap and sunglasses. Police said he also had a backpack and was wearing fingerless gloves.\nThe suspect was seen driving into the park in a black four-door sedan, possibly a Mazda, with its license plate covered by tape.\nShea Lewis, secretary of the Arkansas Department of Parks, Heritage and Tourism, said in a statement that the state has “increased law enforcement presence in our state parks.”\n“Our Park Rangers are fully commissioned law enforcement officers, and they are actively engaged in ensuring the safety and security of our park guests,” he said. “We remain committed to supporting the ongoing investigation and to maintaining Arkansas State Parks as safe, welcoming places for all.”\nDevil’s Den State Park — nestled in Ozark National Forest about 30 miles south of Fayetteville — is a tourist destination famous for its caves, rock formations and thousands of acres of woods."
    },
    {
      "url": "https://nypost.com/2025/07/31/us-news/devils-den-victim-mom-was-slaughtered-after-saving-daughters-and-then-running-back-to-help-husband-cops/",
      "text": "Devil’s Den mom was slaughtered after saving daughters and then running back to help husband: cops\nThe heroic Arkansas mother knifed to death in a Devil’s Den State Park rushed her daughters to safety while her husband fended off their crazed assailant — and was murdered when she went back to help her spouse, police revealed Thursday.\nCristen Amanda Brink, 41, fled with her kids when the family was ambushed by a knifeman on a remote wilderness trail Saturday, with her 43-year-old husband, Clinton David Brink, grappling with the attacker so they could get away.\nCristen got the kids to a safe place — then ran back into danger to help her husband, Arkansas prosecutors and police revealed at a press conference Thursday.\nBut she never returned to collect the terrified girls.\nBy the time the dust settled, she and her husband were dead, and their killer was in the wind.\nAfter a four-day manhunt — fueled largely by the courageous girls’ vivid description of the attacker — suspect Andrew James McGann, 28, was finally arrested Wednesday, while he was getting his hair cut at a barbershop in Springdale.\nPolice say he confessed to the crime and that his DNA matched blood found at the scene — but that he is expected to plead not guilty.\nNo motive in the grisly attack has been revealed, but investigators said Thursday there was “no indication to suggest that the girls were his target.”\nBut McGann — a teacher with certifications to teach elementary and middle school in three states — previously faced allegations of inappropriate behavior at a Texas school where he taught in 2023.\nAn investigation found no conclusive evidence, but McGann resigned soon afterward.\nDespite those allegations, McGann was due to start teaching again in Arkansas’ Springdale Public Schools next week.\nMcGann has no criminal record as an adult, prosecutors said, no known history of mental illness, and no connection of any kind to the victims.\n“It appears to be a completely random event,” prosecutors said at the press conference.\nHe also made no apparent attempt to conceal his movements, according to investigators, explaining he appears to have gotten a haircut after the killings — but it wasn’t an attempt to conceal his identity.\n“You can chalk that up to school starts next week,” investigators said.\nThey added that his handling of the crime was “very sloppy” — so sloppy that investigators were able to locate and arrest him within an hour of identifying him as the suspect.\nProsecutors said they would use the “full weight” of their office to bring justice to the Brinks, and that they would not waive the death penalty if McGann is found guilty of the murders.\nThe Brinks’ daughters — including a third girl who was not at the park with them during the attack — are in the care of family members.\nThey had just moved to Arkansas from South Dakota, and Clinton was planning to start a new job as a milk delivery driver soon."
    },
    {
      "url": "https://nypost.com/2025/08/01/us-news/teacher-accused-in-devils-den-murders-of-married-couple-in-front-of-their-daughters-barely-speaks-during-brief-hearing-as-hes-held-without-bail/",
      "text": "Teacher accused in Devil’s Den murders of married couple in front of their daughters barely speaks during brief hearing as he’s held without bail\nThe teacher accused of murdering a couple in front of their kids at Devil’s Den State Park in Arkansas last week showed no emotion and barely spoke a word as he was ordered held without bail at his first court appearance Friday morning.\nAndrew James McGann, 28, stood motionless before a judge in Washington County Courthouse — wearing black and white striped jail scrubs, shackles and his mop of curly hair — during the brief hearing, where he was flanked by his lawyer and the judge told him his rights.\nMcGann was assigned a public defender to represent him in the case and he was held without bail. He’s due to be arraigned on Aug. 25 on two counts of capital murder.\nMcGann is accused of killing Cristen Amanda Brink, 41, and Clinton David Brink, 43, in front of two of their daughters, ages seven and nine, on July 26. He was arrested five days later at a salon while he was in the middle of getting a haircut.\nGov. Sarah Huckabee Sanders lamented the tragic killings during an interview on “Fox and Friends” early Friday morning but praised the Brink parents as “heroes” for ensuring their daughters weren’t harmed during the attack.\n“It looks very much like the husband wanted to first protect his wife and daughters,” Huckabee Sanders said. “She got them to safety and then came back to help. And both of these parents, unfortunately, senselessly were killed.”\n“They did so protecting their daughters in such a miraculous way,” the governor said.\nFollow The Post’s coverage of the Devil’s Den murders\n- Devil’s Den murder suspect Andrew James McGann would ‘tickle’ girls, told one, ‘I wish you could be my girlfriend,’ parent at his former school says\n- Devil’s Den madman charged with slaughtering hikers in front of their little girls is teacher who was accused of misconduct\n- Devil’s Den mom was slaughtered after saving daughters and running back to help husband: cops\n“We can never imagine the difficulty and the pain that these two girls will go through. But they get to know that their parents died as heroes, protecting them,” she said.\nThe governor noted that McGann “will not see the light of day for a long time.”\nThe Prairie Grove family had been on a walk in the park when a knife-wielding McGann allegedly attacked them.\nThe dad attempted to fight McGann off while the mom shuttled the girls to safety before coming back to try to help her husband.\nMcGann was tracked to Lupita’s Beauty Salon in Springdale roughly 35 miles away from the park after his black 2022 Kia Stinger was spotted parked outside the salon.\nHairstylist Adriana Ruiz Avalos said McGann unsettled her but she started his haircut anyway before three detectives showed up mid-trim and arrested the suspect.\nMcGann was allegedly tied to the crimes through DNA left at the scene.\n“I had an eerie feeling about him,” Avalos told NewsNation’s Ashleigh Banfield Thursday. “He looked soulless.”\nWashington County Prosecutor Brandon Carter has said his office will give the jury the option to sentence McGann to the death penalty.\nWith Post wires"
    },
    {
      "url": "https://nypost.com/2025/08/01/us-news/devils-den-state-park-murder-suspect-andrew-james-mcgann-arrested-in-arkansas-lupitas-beauty-salon/",
      "text": "Eerie moment Devil’s Den murder suspect Andrew James McGann is arrested mid-haircut for allegedly killing married couple: ‘He looked soulless’\nChilling new video shows the madman accused of slaughtering a couple in front of their young daughters at Devil’s Den State Park in Arkansas looking eerily calm during his arrest at a barbershop — as his hairdresser described him as “soulless.”\nAndrew James McGann, 28, is captured in surveillance camera footage devoid of emotion and still wearing his barber cape as police handcuffed him at Lupita’s Beauty Salon in Springdale, Arkansas at around 5 p.m. Wednesday.\nMcGann stopped for a haircut five days after he allegedly stabbed to death Cristen Amanda Brink, 41, and her husband, Clinton David Brink, 43.\nNo motive has been revealed in the gruesome attack, which has left a 7-year-old and a 9-year-old without their parents.\nThe alleged knifeman’s stylist immediately gave hairstylist Adriana Ruiz Avalos the creeps.\n“As soon as I saw him, as I was telling him to come into my chair, I had an eerie feeling about him,” Avalos told NewsNation’s “Banfield” Thursday night.\n“He looked soulless,” she said. “He didn’t look right.”\nThe murder suspect, who led cops on a wild, five-day manhunt, told Avalos not to cut anything off the top of his hair in an apparent effort to keep his eyes covered and continue evading police, the outlet reported.\nAvalos had never seen McGann before the haircut session and found his hair and scalp in poor condition.\n“Very dry and matted,” Avalos said of McGann’s locks, adding his eyes were “sunken” as he sat in the barber chair.\nLaw enforcement agents tracked McGann down to the salon, pinpointing him inside because his car, a black 2022 Kia Stinger, was parked outside.\nMcGann kept his head down and tried not to engage with the plainclothes agents when a detective entered the shop, 35 miles away from Devil’s Den State Park.\n“He really didn’t say anything until they were like, ‘I believe it’s your car,’” Avalos said.\nThe hairstylist believes McGann wasn’t aware that cops had tracked him down until it was too late.\nAn apparent plainclothes officer is shown in footage removing McGann’s barber cape before he was escorted out of the shop in handcuffs, according to the outlet.\nMcGann is charged with two counts of capital murder in the killing\nHe appeared in court Friday, where he was ordered held without bail until his arraignment on Aug. 25\nEvery morning, the NY POSTcast offers a deep dive into the headlines with the Post’s signature mix of politics, business, pop culture, true crime and everything in between. Subscribe here!\nThe family of four was allegedly ambushed by McGann on a remote wilderness trail Saturday.\nClinton Brink fended off the attacker as his wife rushed their daughters to safety.\nThe doting wife returned to help her husband, Arkansas prosecutors and police revealed Thursday.\nThe couple was found dead in the wilderness, and their killer had fled."
    },
    {
      "url": "https://nypost.com/2025/07/28/us-news/parents-murdered-at-devils-den-were-heroes-protecting-their-little-girls-family-says/",
      "text": "Parents murdered along Devil’s Den park trail were ‘heroes protecting their little girls,’ family says\nThe married couple who were murdered in front of their daughters while hiking at Devil’s Den State Park in Arkansas died as “heroes protecting their little girls,” according to the victims’ devastated family, as a massive manhunt for the killer continues.\nClinton David Brink, 43, and Cristen Amanda Brink, 41, were slain Saturday afternoon — with the alarm raised by their chilling screams, according to police audio suggesting they were stabbed.\nThey were killed while walking along a trail in a remote section of the vast park with their daughters, ages 7 and 9, who both survived uninjured, authorities have said.\n“Clinton and Cristen died heroes protecting their little girls, and they deserve justice,” the Brink family told ABC News in a statement.\n“They will forever live in all of our hearts.\n“The family is asking for privacy during this very difficult time as they grieve and learn how to navigate this new reality. They ask that if anyone has any information at all that will help in the investigation to please contact the proper authorities immediately.”\nAuthorities have not disclosed how the mother and father were killed. However, officials were responding to a report of a possible stabbing on the Devil’s Den trail around 2:30 p.m. Saturday when they heard screaming, according to police radio audio shared by CNN.\n“Washington County received a call from the visitor center,” someone said on the official audio captured by Broadcastify.com. “Two children are there. They advised that their parents were assaulted. One was possibly stabbed. The parents are missing.”\nOne responder heading toward the scene radioed that they heard “yelling calling for help,” according to recordings obtained by 5News.\n“We’re hearing them too towards the end of the lower part of the Devil’s Den trail,” another official responds.\nBy the time they reached the family, the parents were both dead — and the killer in the wind.\n“We found the victims down here,” a man says in the recordings. “They’re on the lower Devil’s Den trail where I’ve got two … two bodies.”\nThe couple’s daughters were not hurt in the attack and have since been placed with family members, according to the Arkansas State Police.\nIt’s not clear if the killings were targeted. The couple had just recently moved to Arkansas from out of state, police said.\nThe unidentified suspect was last seen wearing a long-sleeve shirt with the sleeves rolled, dark pants, a dark baseball cap, sunglasses, a black backpack, and fingerless gloves, police said.\nOfficials said he was seen driving toward a park exit in a black four-door sedan, possibly a Mazda, with a taped-over license plate. From that exit, that vehicle could have traveled on State Highway 170 or State Highway 220.\nArkansas State Police did not announce a warning about the manhunt for a double murderer until around 8:40 p.m. Saturday, more than six hours after the threat was first reported. Police blamed it on the difficulties of the remote murder scene.\nThe bodies were found in “a remote and rural area, where the terrain is rugged, vegetation is thick and there is no cellphone service,” state police said."
    },
    {
      "url": "https://nypost.com/2025/07/31/us-news/devils-den-alleged-killer-james-andrew-mcgann-is-teacher-who-may-have-been-fired-for-misconduct/",
      "text": "Devil’s Den madman charged with slaughtering hikers in front of their little girls is a teacher who was accused of misconduct\nThe madman accused of slaughtering two parents defending their young daughters in Arkansas’ Devil’s Den State Park is a teacher with a record of moving from school-to-school after allegations of inappropriate behavior.\nAndrew James McGann, 28, was due to start teaching Springdale Public Schools (SPS) in a week – just days after he allegedly ambushed Clinton David Brink, 43, and his wife, Cristen Amanda Brink, 41, on a hiking trail last Saturday and stabbed them to death while their girls fled to safety.\nSPS superintendent Jared Cleveland confirmed McGann had been hired to teach, but said he “has not at any time come into contact with Springdale students or the families we serve,” according to 5 News.\nBut it wouldn’t be the first time the alleged killer had been around kids – McGann also has teaching certificates for early childhood education through middle school in Oklahoma and Texas, the outlet reported.\nAnd McGann previously taught at the Donald Elementary School near Dallas, Texas – where resigned from in 2023 after allegations of alarming behavior toward young girls in class.\n“My son and several students witnessed Mr. McGann being inappropriate with little girls in the class and reported it to the principal at the time,” wrote Sierra Marcum on Facebook, claiming to be the mother of one of McGann’s Texas students.\n“Mr. McGann was allowed to resign without consequence and statement was put out saying there was no evidence of inappropriate behavior,” she added. “He was then allowed to continue teaching in other districts in Oklahoma and Arkansas.”\nAn email Donald Elementary sent to parents after McGann’s Wednesday arrest confirmed there were “complaints of poor classroom management and poor professional judgment” – but explained that while no evidence was found, he resigned in May 2023 after an investigation.\n“The district investigated complaints of poor classroom management and poor professional judgment related to concerns about uneven treatment of students and displays of favoritism,” read the email, shared with The Post by Donald Elementary’s Lewisville Independent School District.\n“Our investigation did not find any evidence of inappropriate behavior with a student, however we did find his classroom management and professional judgment to be below our district’s expectations,” it continued.\nMcGann was hired the next school year to teach fifth grade at Spring Creek Elementary in Oklahoma – which told The Post that a thorough background check turned up nothing to indicate he shouldn’t be hired.\n“As with all district employees, McGann underwent and passed all legally required national background checks,” the school district said in a statement, adding that no alarms were raised during his interview and that there was never reason to discipline him during his tenure.\nHe left Spring Creek Elementary at the end of the 2023-24 school year for employment elsewhere.\nDespite those allegations, investigators said Thursday that there was “no indication to suggest” that the Brinks’ daughters were the target of his alleged attack.\nPolice said the attack appeared to be completely random, and that McGann had no connection with the Brinks at all.\nThe family was ambushed while they hiked through the remote park, with Cristen rushing the girls to safety while Clinton stayed back to fend off their attacker.\nOnce the girls were safe Cristen ran back to help her husband – but both ended up dead and left on the trail with stab wounds.\nThe girl’s descriptions of their attacker led police to McGann on Wednesday, and he was arrested while getting his haircut at a Springdale barbershop.\nHe allegedly confessed to the crimes, but is expected to plead guilty.\nProsecutors said McGann — whose DNA matched blood left at the murder scene — could face the death penalty if convicted."
    }
  ],
  "argos_summary": "Andrew James McGann, a 28-year-old teacher, has been charged with capital murder for the stabbing deaths of Clinton David Brink, 43, and Cristen Amanda Brink, 41, while they were hiking with their two daughters in Arkansas' Devil’s Den State Park. The couple was killed as they attempted to protect their children, who escaped unharmed. McGann, who had a history of inappropriate behavior allegations at previous schools, was arrested after a five-day manhunt and is being held without bond, with a court hearing scheduled for November 14.",
  "argos_id": "3JBODNFYZ"
}