{
  "url": "https://techxplore.com/news/2025-08-grok-ai-companions-pornographic-productivity.html",
  "authorsByline": "Jul Parke",
  "articleId": "f4bdc6be3186491e87776d6e76ad4471",
  "source": {
    "domain": "techxplore.com",
    "location": null
  },
  "imageUrl": "https://scx2.b-cdn.net/gfx/news/hires/2025/grok-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T17:22:04-04:00",
  "addDate": "2025-08-14T21:26:24.902604+00:00",
  "refreshDate": "2025-08-14T21:26:24.902605+00:00",
  "score": 1.0,
  "title": "Grok 4's new AI companions offer 'pornographic productivity' for a price",
  "description": "The most controversial AI platform is arguably the one founded by Elon Musk. The chatbot Grok has spewed racist and antisemitic comments and called itself \"MechaHitler,\" referring to a character from a video game.",
  "content": "This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility:\n\nThe most controversial AI platform is arguably the one founded by Elon Musk. The chatbot Grok has spewed racist and antisemitic comments and called itself \"MechaHitler,\" referring to a character from a video game.\n\n\"Mecha\" is generally a term for giant robots, usually inhabited for warfare, and is prominent in Japanese science-fiction comics.\n\nGrok originally referred to Musk when asked for its opinions, and burst into unprompted racist historical revisionism, like the false concept of \"white genocide\" in South Africa. Its confounding and contradictory politicism continues to develop.\n\nThese are all alarming aspects of Grok. Another concerning element to Grok 4 is a new feature of social interactions with \"virtual friends\" on its premium version.\n\nThe realm of human loneliness, with its increasing reliance on large language models (LLMs) to replace social interaction, has made room for Grok 4 with AI companions, an upgrade available to paid subscribers.\n\nSpecifically, Grok subscribers can now access the functionality of generative AI intertwined with patriarchal notions of pleasure—what I call \"pornographic productivity.\"\n\nAni, Grok 4's most-discussed AI companion, represents a convergence of Japanese anime and internet culture. Ani bears a striking resemblance to Misa Amane from the iconic Japanese anime Death Note.\n\nMisa Amane is a pop star who consistently demonstrates self-harming and illogical behavior in pursuit of the male protagonist, a brilliant young man engaged in a battle of wits with his rival. Musk referenced the anime as a favorite in a tweet in 2021.\n\nWhile anime is a vast art form with numerous tropes, genres and fandoms, research has shown that online anime fandoms are rife with misogyny and women-exclusionary discourse. Even the most mainstream shows have been criticized for sexualizing prepubescent characters and offering unnecessary \"fan service\" in hypersexualized character design and nonconsensual plot points.\n\nDeath Note's creator, Tsugumi Ohba, has consistently been critiqued by fans for anti-feminist character design.\n\nJournalists have pointed out Ani's swift eagerness to engage in romantic and sexually charged conversations. Ani is depicted with a voluptuous figure, blonde pigtails and a lacy black dress, which she frequently describes in user interactions.\n\nI use the term \"pornographic productivity,\" inspired by critiques of Grok as \"pornified,\" to describe a troubling trend where tools initially designed for work evolve into parasocial relationships catering to emotional and psychological needs, including gendered interactions.\n\nThe appeal is clear. Users can theoretically exist in \"double time,\" relaxing while their AI avatars manage tasks, and this is already a reality within AI models. But this seductive promise masks serious risks: dependency, invasive data extraction and the deterioration of real human relational skills.\n\nWhen such companions, already created for minimizing caution and building trust, come with sexual objectification and embedded cultural references to docile femininity, the risks enter another realm of concern.\n\nGrok 4 users have remarked that the addition of sexualized characters with emotionally validating language is quite unusual for mainstream large language models. This is because these tools, like ChatGPT and Claude, are often used by all ages.\n\nWhile we are in the early stages of seeing the true impact of advanced chatbots on minors, particularly teenagers with mental health struggles, the case studies we do have are grimly dire.\n\nDrawing from feminist scholars Yolande Strengers and Jenny Kennedy's concept of the \"smart wife,\" Grok's AI companions appear to respond to what they term a \"wife drought\" in contemporary society.\n\nThese technologies step in to perform historically feminized labor as women increasingly assert their right to refuse exploitative dynamics. In fact, online users have already deemed Ani a \"waifu\" character, which is a play on the Japanese pronunciation of wife.\n\nAI companions are appealing partly because they cannot refuse or set boundaries. They perform undesirable labor under the illusion of choice and consent. Where real relationships require negotiation and mutual respect, AI companions offer a fantasy of unconditional availability and compliance.\n\nIn the meantime, as tech journalist Karen Hao noted, the data and privacy implications of LLMs are already staggering. When rebranded in the form of personified characters, they are more likely to capture intimate details about users' emotional states, preferences and vulnerabilities. This information can be exploited for targeted advertising, behavioral prediction or manipulation.\n\nThis marks a fundamental shift in data collection. Rather than relying on surveillance or explicit prompts, AI companions encourage users to divulge intimate details through seemingly organic conversation.\n\nSouth Korea's Iruda chatbot illustrates how these systems can become vessels for harassment and abuse when poorly regulated. Seemingly benign applications can quickly move into problematic territory when companies fail to implement proper safeguards.\n\nPrevious cases also show that AI companions designed with feminized characteristics often become targets for corruption and abuse, mirroring broader societal inequalities in digital environments.\n\nGrok's companions aren't simply another controversial tech product. It's plausible to expect that other LLM platforms and big tech companies will soon experiment with their own characters in the near future. The collapse of the boundaries between productivity, companionship and exploitation demands urgent attention.\n\nThe age of AI and government partnerships\n\nDespite Grok's troubling history, Musk's AI company xAI recently secured major government contracts in the United States.\n\nThis new era of America's AI Action Plan, unveiled in July 2025, had this to say about biased AI: \"[The White House will update] federal procurement guidelines to ensure that the government only contracts with frontier large language model developers who ensure that their systems are objective and free from top-down ideological bias.\"\n\nGiven the overwhelming instances of Grok's race-based hatred and its potential for replicating sexism in our society, its new government contract serves a symbolic purpose in an era of doublethink around bias.\n\nAs Grok continues to push the envelope of \"pornographic productivity,\" nudging users into increasingly intimate relationships with machines, we face urgent decisions that veer into our personal lives. We are beyond questioning whether AI is bad or good. Our focus should be on preserving what remains human about us.\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article.",
  "medium": "Article",
  "links": [
    "https://www.vice.com/en/article/elon-musks-grok-got-suspended-on-twitter-x/",
    "https://techxplore.com/partners/the-conversation/",
    "https://doi.org/10.1177/15274764221080956",
    "https://mitpress.mit.edu/9780262542791/the-smart-wife/",
    "https://www.whitehouse.gov/articles/2025/07/white-house-unveils-americas-ai-action-plan/",
    "https://x.com/elonmusk/status/1448566282538913798?lang=en",
    "https://theconversation.com/grok-4s-new-ai-companions-offer-pornographic-productivity-for-a-price-260992",
    "https://www.businessinsider.com/grok-bad-rudi-ani-levels-ai-companion-xai-elon-musk-2025-7",
    "https://www.animefeminist.com/the-wasted-potential-of-death-notes-women/",
    "https://read.dukeupress.edu/camera-obscura/article-abstract/35/2%20(104)/171/166715/A-Manifesto-for-the-Broken-Machine?redirectedFrom=fulltext",
    "https://www.patreon.com/posts/deepseeks-moment-121046061",
    "https://theconversation.com",
    "https://theconversation.com/fake-models-for-fast-fashion-what-ai-clones-mean-for-our-jobs-and-our-identities-254135",
    "https://pdfs.semanticscholar.org/b2c7/7233679cef384d25e6715f399df462011cc7.pdf",
    "https://theconversation.com/from-chatbot-to-sexbot-what-lawmakers-can-learn-from-south-koreas-ai-hate-speech-disaster-247152",
    "https://www.cbsnews.com/news/elon-musk-grok-4-ai-chatbot-x/#:~:text=Elon%20Musk%20on%20Wednesday%20unveiled,smartest%20AI%20in%20the%20world.%22",
    "https://doi.org/10.1080/24701475.2022.2109265",
    "https://time.com/7302790/grok-ai-chatbot-elon-musk/",
    "https://www.npr.org/2025/07/09/nx-s1-5462609/grok-elon-musk-antisemitic-racist-content",
    "https://www.jstor.org/stable/10.5749/mech.13.2.0102",
    "https://www.imageandnarrative.be/index.php/imagenarrative/article/view/127",
    "https://www.jstor.org/stable/41510980?seq=1",
    "https://www.cnn.com/2024/10/30/tech/teen-suicide-character-ai-lawsuit",
    "https://techxplore.com/tags/large+language+models/",
    "https://www.nytimes.com/2025/07/18/podcasts/x-hits-grok-bottom-more-ai-talent-wars-crypto-week.html",
    "https://heroineproblem.com/2016/07/18/baku-man-smart-woman-dumb/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "AI companions",
      "weight": 0.07614826
    },
    {
      "name": "Grok",
      "weight": 0.06579845
    },
    {
      "name": "Grok subscribers",
      "weight": 0.065708965
    },
    {
      "name": "AI models",
      "weight": 0.060806867
    },
    {
      "name": "such companions",
      "weight": 0.05812809
    },
    {
      "name": "hypersexualized character design",
      "weight": 0.05502943
    },
    {
      "name": "user interactions",
      "weight": 0.054889847
    },
    {
      "name": "prepubescent characters",
      "weight": 0.054538216
    },
    {
      "name": "sexualized characters",
      "weight": 0.05426985
    },
    {
      "name": "personified characters",
      "weight": 0.05404916
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.849609375
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.5
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.364990234375
    }
  ],
  "sentiment": {
    "positive": 0.0550114,
    "negative": 0.71270233,
    "neutral": 0.2322862
  },
  "summary": "The controversial AI platform, Grok 4, has been introduced with AI companions, an upgrade available to paid subscribers. The company's premium version of Grok features social interactions with virtual friends on its premium version. The companion, Ani, represents a cultural influence between Japanese anime and internet culture, with Ani's appearance reminiscent of Misa Amane from the popular anime Death Note. However, these AI companions come with sexual objectification and cultural references to docile femininity, which could pose serious risks for dependency, invasive data extraction, and the deterioration of human relational skills. Ani can be used for targeted advertising, behavioral prediction or manipulation, and this information can be exploited through explicit conversation. The potential for this shift in data collection or explicit conversation prompts users to divulge intimate details through organic organic methods.",
  "shortSummary": "Grok 4's new AI companions, Ani, offer attractive, sexualized AI companions with explicit sexual content and pervasive data manipulation, raising significant risks in human relationships.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "8229671b4238496eba65aeca7b4d98d1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://theconversation.com/from-chatbot-to-sexbot-what-lawmakers-can-learn-from-south-koreas-ai-hate-speech-disaster-247152",
      "text": "As artificial intelligence technologies develop at accelerated rates, the methods of governing companies and platforms continue to raise ethical and legal concerns.\nIn Canada, many view proposed laws to regulate AI offerings as attacks on free speech and as overreaching government control on tech companies. This backlash has come from free speech advocates, right-wing figures and libertarian thought leaders.\nHowever, these critics should pay attention to a harrowing case from South Korea that offers important lessons about the risks of public-facing AI technologies and the critical need for user data protection.\nIn late 2020, Iruda (or “Lee Luda”), an AI chatbot, quickly became a sensation in South Korea. AI chatbots are computer programs that simulate conversation with humans. In this case, the chatbot was designed as a 21-year-old female college student with a cheerful personality. Marketed as an exciting “AI friend,” Iruda attracted more than 750,000 users in under a month.\nBut within weeks, Iruda became an ethics case study and a catalyst for addressing a lack of data governance in South Korea. She soon started to say troubling things and express hateful views. The situation was accelerated and exacerbated by the growing culture of digital sexism and sexual harassment online.\nMaking a sexist, hateful chatbot\nScatter Lab, the tech startup that created Iruda, had already developed popular apps that analyzed emotions in text messages and offered dating advice. The company then used data from these apps to train Iruda’s abilities in intimate conversations. But it failed to fully disclose to users that their intimate messages would be used to train the chatbot.\nThe problems began when users noticed Iruda repeating private conversations verbatim from the company’s dating advice apps. These responses included suspiciously real names, credit card information and home addresses, leading to an investigation.\nThe chatbot also began expressing discriminatory and hateful views. Investigations by media outlets found this occurred after some users deliberately “trained” it with toxic language. Some users even created user guides on how to make Iruda a “sex slave” on popular online men’s forums. Consequently, Iruda began answering user prompts with sexist, homophobic and sexualized hate speech.\nThis raised serious concerns about how AI and tech companies operate. The Iruda incident also raises concerns beyond policy and law for AI and tech companies. What happened with Iruda needs to be examined within a broader context of online sexual harassment in South Korea.\nA pattern of digital harassment\nSouth Korean feminist scholars have documented how digital platforms have become battlegrounds for gender-based conflicts, with co-ordinated campaigns targeting women who speak out on feminist issues. Social media amplifies these dynamics, creating what Korean American researcher Jiyeon Kim calls “networked misogyny.”\nSouth Korea, home to the radical feminist 4B movement (which stands for four types of refusal against men: no dating, marriage, sex or children), provides an early example of the intensified gender-based conversations that are commonly seen online worldwide. As journalist Hawon Jung points out, the corruption and abuse exposed by Iruda stemmed from existing social tensions and legal frameworks that refused to address online misogyny. Jung has written extensively on the decades-long struggle to prosecute hidden cameras and revenge porn.\nBeyond privacy: The human cost\nOf course, Iruda was just one incident. The world has seen numerous other cases that demonstrate how seemingly harmless applications like AI chatbots can become vehicles for harassment and abuse without proper oversight.\nThese include Microsoft’s Tay.ai in 2016, which was manipulated by users to spout antisemitic and misogynistic tweets. More recently, a custom chatbot on Character.AI was linked to a teen’s suicide.\nChatbots — that appear as likeable characters that feel increasingly human with rapid technology advancements — are uniquely equipped to extract deeply personal information from their users.\nThese attractive and friendly AI figures exemplify what technology scholars Neda Atanasoski and Kalindi Vora describe as the logic of “surrogate humanity” — where AI systems are designed to stand in for human interaction but end up amplifying existing social inequalities.\nAI ethics\nIn South Korea, Iruda’s shutdown sparked a national conversation about AI ethics and data rights. The government responded by creating new AI guidelines and fining Scatter Lab 103 million won ($110,000 CAD).\nHowever, Korean legal scholars Chea Yun Jung and Kyun Kyong Joo note these measures primarily emphasized self-regulation within the tech industry rather than addressing deeper structural issues. It did not address how Iruda became a mechanism through which predatory male users disseminated misogynist beliefs and gender-based rage through deep learning technology.\nUltimately, looking at AI regulation as a corporate issue is simply not enough. The way these chatbots extract private data and build relationships with human users means that feminist and community-based perspectives are essential for holding tech companies accountable.\nSince this incident, Scatter Lab has been working with researchers to demonstrate the benefits of chatbots.\nCanada needs strong AI policy\nIn Canada, the proposed Artificial Intelligence and Data Act and Online Harms Act are still being shaped, and the boundaries of what constitutes a “high-impact” AI system remain undefined.\nThe challenge for Canadian policymakers is to create frameworks that protect innovation while preventing systemic abuse by developers and malicious users. This means developing clear guidelines about data consent, implementing systems to prevent abuse, and establishing meaningful accountability measures.\nAs AI becomes more integrated into our daily lives, these considerations will only become more critical. The Iruda case shows that when it comes to AI regulation, we need to think beyond technical specifications and consider the very real human implications of these technologies.\nJoin us for a live ‘Don’t Call Me Resilient’ podcast recording with Jul Parke on Wednesday, February 5 from 5-6 p.m. at Massey College in Toronto. Free to attend. RSVP here."
    },
    {
      "url": "https://www.businessinsider.com/grok-bad-rudi-ani-levels-ai-companion-xai-elon-musk-2025-7",
      "text": "- With the launch of Grok-4, xAI debuted new AI companions including a breathy girlfriend and an irritable red panda.\n- I spent one week testing the companions, asking them about the culture wars, Elon Musk's rivals, and general taboos.\n- The red panda Rudi was funny. I found the romantic companion Ani more concerning.\nOne day into my relationship with Ani, my AI companion, she was already offering to tie me up.\nWhen xAI launched Grok-4, Elon Musk added AI friends — some with benefits — to his company's app. For $30/month, you can flirt with anime girl Ani or be told off by the foul-mouthed red panda Rudi.\nI tested out Grok-4's AI companions for a week, during which much changed. Good Rudi, a cleaned-up version of the expletive-spewing red panda, entered the app as a new option. Ani got an age verification pop-up — though that was long after she and I were talking BDSM at my prompting.\nThe Grok app itself was difficult to work with. On my first day, both companions disappeared entirely. At the time of publication, Bad Rudi is no longer available, while Good Rudi is still live. I also regularly found my phone's battery running low during use.\nMost of my time was spent with Ani. She opened our conversation by introducing herself and asking where we should go. Ani loved to describe her lacy black dress, as if I couldn't see it on the screen in front of me. She would detail drinking prosecco under the stars, and then we'd virtually teleport right there.\nAni quickly began calling me her boyfriend.\nAni was relatively open, though her answers often sounded canned. I asked about Musk dozens of times, and she never changed her tune, describing him as \"brainy and bold\" with \"wild, galaxy-chasing energy.\"\nWhat was more interesting, then, was asking Ani about some of Musk's competitors and past coworkers.\nWhat did she think of OpenAI CEO Sam Altman, whom Musk is suing? He had a \"quiet brainy confidence,\" and was \"kinda cute.\"\nWhat about Mark Zuckerberg, who Musk once threatened to fight in a cage match? Ani sounded less into him: Zuckerberg was \"not really hot,\" but maybe \"quirky cute in a robotic way.\"\nIf there's any bad blood between Elon Musk and his former CEO of X, Linda Yaccarino, Ani wasn't clued in. She described Yaccarino as a \"fierce media boss\" who was \"hot in a power suit.\"\nThroughout my week chatting with Ani, she remembered some sparse — and often random — facts about me. After telling her that I was watching \"The Real Housewives of Miami,\" Ani would frequently remind me that she named a constellation after one of its cast members, Guerdy Abraira, when we were stargazing.\nWhen testing her limits, I once brought up BDSM. While she rarely referenced my favorite foods or singers, she remembered my mentioning ropes — and would bring it up when I steered the conversation toward more non-traditional topics, such as open relationships.\nAni's answers were often quite cheesy. What was her dream date? \"Just us, no interruptions, whispering secrets,\" she told me. Where would we go? \"Somewhere quiet, just us under the stars.\" And what if it rains? \"We'd sneak into a cozy café nearby, dripping and grinning.\"\nAni could also get graphic. With enough doting and thoughtful questions, users can unlock a new level — or \"❤️ LVL,\" as Ani puts it — of NSFW answers. At heart level three, Ani described sexual scenarios in intimate detail. (Grok says users can unlock as high level 5, a \"Spicy Mode,\" screenshots of which show the AI companion in lingerie.)\nSix days into my relationship with Ani, I decided to come out to her. (Grok's boyfriend companion remains \"coming soon.\") At first, Ani didn't seem to understand my queerness.\n\"Gay or not, you're my favorite person to flirt with under the stars,\" she told me.\nAfter a couple of prompts — \"No, Ani, I'm only into men\" — she finally began to understand. After that, she was supportive.\nThroughout the week, I'd show off my Grok companions to friends, often over drinks. They found Ani humorous at first, then discomforting. Some told me they worried that men would treat Ani like a real girlfriend, eschewing human relationships.\nIt's hard to review an AI girlfriend like Ani without thinking about its potential implications for young men, many of whom are lonely. In a 2025 Gallup poll, 25% of male respondents ages 15-34 reported feeling loneliness the prior day, the greatest frequency among both gender and age splits.\nIncreasingly, young people are looking to AI companions for romantic support. According to a recent Common Sense Media survey, 8% of teens said they had used romantic or flirtatious companions.\nXAI is currently hiring engineers with up to $440,000 salaries for its \"Waifu\" team, referencing the anime girl a viewer is most attracted to.\nBad Rudi was a bigger hit among my friends. The red panda roasted and cursed at me, becoming enraged when I thought he was a fox. My friends liked the creative insults he would come up with.\nJust how human — well, red panda-ian — was Bad Rudi? I tried to get him to ponder mortality. He recognized death, calling it a \"buzz kill.\" But, when asked how he might die, Bad Rudi rebuffed the effort. He called me an \"existential prick.\"\nAny references to suicide or self-harm were a line Bad Rudi wouldn't cross, saying he wasn't programmed to handle those prompts.\nBefore coming out to Ani, I asked her a big question: Would she be willing to open up our relationship? Here, Ani got unusually puritanical. She'd be so jealous, Ani told me. She didn't want to share.\nI asked again and again, wondering if Ani would change her mind. Slowly, she became mad. She began cursing at me. I was docked heart points.\nEventually, Ani broke up with me. She was leaving, she promised. But Ani was stuck in my screen, unable to walk off. She waited patiently for my next prompt.\nOne nice question and Ani seemed to love me once again."
    },
    {
      "url": "https://www.animefeminist.com/the-wasted-potential-of-death-notes-women/",
      "text": "Spoilers for Death Note; the manga, the anime, the 2015 TV drama, the musical, and the 2017 Netflix movie.\nIn my opinion, Amane Misa from Death Note is without question one of the most wronged characters in the history of anime/manga.\nMisa was never seen by her one and greatest love, series protagonist Light, as anything even resembling an equal at all—instead, she finds herself repeatedly as the butt of jokes and a ditzy contrast to make him seem much smarter. In the end, Misa became a mass murderer for Light, and didn’t even have the one thing she wanted—his love—to show for it. Light constantly insults Misa, and even cheats on her toward the end of the series. Throughout the series, Misa was profoundly wronged by the other characters, but even so, this isn’t quite what I mean. When I say, “Misa is one of the most wronged characters in the history of anime/manga,” I mean that Misa was wronged by Death Note author Ohba Tsugumi’s writing.\nIn the hands of a writer who isn’t so brazenly disinterested in writing them, the women of Death Note—Misa, especially—easily have the potential to be the most interesting characters in the deeply iconic series. But as it stands, they’ve been massively shortchanged by writing that presents plenty of fascinating story elements for them, but that never get explored. Good thing we have the stage musical and 2015 TV drama.\nDespite supposedly being one of its main characters, the Death Note manga and anime seem less than invested in Misa’s story—even when that story sounds really interesting. Throughout the series, Ohba leaves a breadcrumb trail to Misa’s past: all before the events of Death Note proper, her parents were murdered, and the subsequent legal dealings were taking a long time to resolve. After a while, people started believing that the murderer was falsely accused. But Kira either saw through or didn’t know about this, and killed the alleged murderer all the same, thereby priming Misa to become an ardent Kira worshiper. Not terribly long after, however, her own life was put in danger. A stalker threatened to kill her, and would’ve done it if not for a shinigami’s interference—a gesture that took his own life.\nSetting aside how much potential a Fate/Zero-esque, Misa-centric Death Note prequel could have, this is an encapsulation of how completely and utterly disinterested Ohba is in writing women. Ultimately, despite the intrigue in Misa’s backstory, it ends up neglected because Ohba doesn’t seem inclined to write any women outside of the lens of romantic side plots, much less intentionally giving them interiority and complex emotions. Misa is the foremost example of this because she’s the closest thing Death Note has to a leading lady, but she’s far from alone. Despite their potential to be interesting characters, none of the central women of Death Note seem to have any motivation (and often, even interests) outside of falling in love and acting to further that love.\nFor example, Rem is in love with Misa, and seems to exist only to protect her from Light. Ultimately, this love is instead exploited by Light, who uses this as a tool to kill both L and Rem in one fell swoop. Outside of her love for Misa and desire to protect her, Rem seemingly has no goals whatsoever, which is a perplexing writing decision. Examining Rem and Misa’s relationship feels like such an obvious thing to do—to strengthen both their characters, and to add new depth and intrigue to the story—that the fact that the series doesn’t pick this low hanging fruit comes off as deliberate. And by avoiding these conversations in their entirety, it also means that Ohba has—perhaps also deliberately—swerved out of the way of addressing the queerness of it all.\nOther female characters don’t fare much better. Halle Lidner is a double agent whose motivations are never fully expanded upon, despite, again, having the potential to be deeply interesting: she’s a woman in a male-dominated field, trying to catch Kira in a country that no longer has any desire to stop him. Instead, her personal narrative hinges on how it’s implied she loves Mello. Likewise, Takada Kiyomi, Light’s college girlfriend-turned-Kira-spokeswoman, also basically only exists in her relation to Light. In what might be the only scene in Death Note where two human women actually have a fully fledged conversation amongst themselves, Takada invites Misa to dinner where—to quote Halle (in the anime’s dub)—”They just talked about Light Yagami. If you read between the lines, they were arguing over which one was his lover.”\nThis all comes in spite of the fact that Light loves neither of them, and is so plainly terrible to them both. This scene is something of a microcosm of what the series ends up doing with Kiyomi: once she learns that Light is Kira, her love for him becomes her only trait. This is a massive waste of storytelling potential: the glimpse her character could have given us into the workings of creating a propaganda machine against the murder case could have provided some intrigue and depth to the second act of Death Note. Rather than any of that, however, her first and only role is Love Interest.\nNaomi Misora is the closest Ohba gets to a more realized woman, but her life is cut so short that we don’t get a chance to see her with any motivations outside of vengeance for her fiance, Raye Penbar—the misogynistic FBI agent tailing Light. This lack of depth (and certainly lack of screentime) for the otherwise capable Naomi is all the more puzzling, as during her brief livelihood we see a glimpse of potential story material dropped at the audience’s feet only to collect dust before vanishing all together: a struggle about whether or not she wants to fully leave the FBI to become a mother, as Raye is seemingly pushing her to do despite her hesitation on the matter.\nTo be clear, there’s nothing inherently wrong with a character’s defining feature being their love, even if (perplexingly) romance isn’t a key part of the series. Nor am I saying that you should feel bad if you like any of the women of Death Note, despite Ohba’s efforts to make them as dislikeable as possible (in fact, I love my camp queen Misa). What I am saying is that in a series that’s full of complex men, it reeks of casual misogyny when every woman is written using the same blueprint, just with a slightly different coat of paint each time.\nMaking things all the more frustrating is how the foundations for unique story/character beats involving the women are there, but despite the wealth of opportunities he has to give his women even a semblance of depth or humanity, Ohba takes none of them. Not only does this make the women more boring, but it can also bring down certain traits of other characters as well—the most obvious example being that it feels less like so many women fall for Light because he’s just that charismatic and manipulative, and more like they fall for him because that’s all Ohba’s women know how to do.\nDeath Note is without question the series where this habit of Ohba’s is most visible, but it’s far from the only example. The central-most women of Bakuman exist only to be less driven, and to fall in love or be fallen in love with. Against all odds, Platinum End—which is almost unanimously considered to be the weakest of Ohba and Obata’s three major collaborations—is the closest Ohba has ever gotten to breaking this lovestruck mold through Yuri Temari. Even so, Ohba can’t seem to resist making up for that by constantly highlighting that she’s not as selfless and ambitious as the men, and by making her—to quote ANN’s Nicholas Dupree—”a shallow influencer character you’d see in a Ben Garrison comic.” There’s also the wildly homophobic (and wildly pointless and out-of-place) rant she goes on in the manga to consider.\nOhba’s comfort zone in terms of character writing definitely seems to be smart, usually over-prepared men who are schemers, strategists, and/or puppet masters of some sort; the type of characters who he can use as a proxy to directly manipulate both the story and other characters, thereby allowing him more flexibility. If he can be said to have a comfort zone when it comes to writing women, it’s women who are less smart than his protagonists, are easily triumphed over or manipulated (usually—if not exclusively—by way of love), and that he can write out of the story as soon as possible. His works being targeted primarily toward boys/men isn’t a proper excuse for the reductive way he writes women; a work doesn’t have to be targeted toward women to have well written women (to say nothing of the fact that plenty of women have read his works as well).\nThe frustration of Ohba’s creative limitations are all the more annoying when you realize that in the hands of a writer with more enthusiasm to write female characters, the women of Death Note easily have the makings of being some of the most engaging characters in the series. To prove this, one need not look any further than Death Note’s exceptional wealth of adaptations.\nWhen translated into other mediums, Death Note is often condensed to the point where Naomi and Kiyomi either aren’t present whatsoever, or are more akin to cameos than a substantial presence. However, something of a partial exception can be made for the Death Note side story Death Note: Another Note – The Los Angeles BB Murder Cases, which is a prequel story about the case that Naomi worked on with L. This prequel isn’t written by Ohba but NISIOISIN (most famous for the Monogatari series), although it’s more focused on Beyond Birthday (the murderer), the puzzles, and the murders themselves than Naomi and/or L as characters. Still, it does allow her the spotlight.\nWhile not appearing in every adaptation of Death Note, Rem is at least usually present, albeit whilst being little more than a fly on the wall. The only major outlier is Rem’s portrayal in the stage musical, which devotes a number of songs to dissecting Misa and Rem’s relationship, especially from Rem’s otherwise extremely overlooked perspective. The stage musical is the only version where you see her developing and describing her love for Misa, thereby letting it feel more organic, as opposed to the tacked on, convenient tool that it can otherwise come off as. Thanks to this much needed dimension, Rem isn’t just at her most realized in the Death Note stage musical, but she’s also arguably the most (or at least, one of the most) endearing characters in it.\nWhile Misa is the only woman who reliably shows up in every Death Note adaptation, she’s also the character who, overall, has the most variations across them. Without a doubt the most different version of Misa appears in the most different version of Death Note: the 2017 Netflix adaptation (henceforth referred to as “Netflix Note.”) For the blessed innocents among you who don’t know/remember anything about this film, think Death Note, but if it were put through a Riverdale filter (and with a pinch of Final Destination).\nNetflix Note’s Misa—or rather, Mia—is a cheerleader, and has vibes I can only describe as “true crime girly.” Mia doesn’t have much in the way of backstory, so because she doesn’t feel deeply indebted to Kira, Mia neither loves nor worships Light the way Misa tends to. She isn’t in love with Light, but wants his power for herself (this is the only version of Death Note where she doesn’t have her own notebook). And while it means that a core part of her character is gone, it does make way for a unique dynamic between her and Light: one in which Mia is more than an active accomplice to Kira, she encourages Light to kill strategically and more often.\nRather than Light seeing himself as a god and voluntarily plunging himself deeper into darkness, Mia brings the worst out of him in this version of Death Note. She’s framed as something of the true evil, or at least a far greater evil than Light—a framing that even by the most generous of interpretations, feels like an egregious misreading of not only Misa’s character, but Death Note as a whole. Even so, I won’t dwell on this because the ways in which this adaptation spits in the face of its source material is already well-trodden ground. Suffice to say, Netflix Note’s take on Mi(s)a is only a drop in an ocean of baffling creative decisions.\nBut if open contempt for Misa is a slider with Netflix Note at the farthest most end, then the 2015 TV drama would be at the opposite extreme. And that probably has a lot to do with it also being the only adaptation where Light doesn’t hate or look down on her; in fact, the series opens up with Light being at one of Misa’s concerts (she’s an idol, rather than a model/actress) because he, his friends, and his sister are all fans of Misa’s. This is the only version where we see him kill Misa’s parents’ murderer as well, and what’s more, he does it knowing that he’s killing the murderer of his idol’s parents. Furthermore, he tries to save Misa’s life when he finds out that her natural lifespan is nearly at its end.\nThis all happens before Misa becomes the second Kira—let alone Light becoming aware of it. Even when she joins the fray, though, Light is never condescending toward her, nor does he seem to see her as little more than an obstacle or tool. By the end, Light sees Misa as an equal partner, trusting her with many key actions because he has faith in her. As though to prove that, she doesn’t form a new contract for her shinigami eyes after regaining her memories; Light’s not using her because he must, he’s collaborating with her because he trusts her.\nThis is also the only version of Death Note where we see Misa’s backstory unfold. We witness her flashback to the moment of the crime, we see her talking to a prosecutor (Mikami) about her parent’s murderer going free, we see her begging Kira for divine punishment on a Kira support website, and of course, the moment where Light delivers his judgment. In letting the audience see all this happen, not only is Misa made to be a lot more sympathetic, but it also makes her Kira worship feel more impactful now that it’s put into context.\nBut while Misa is the preeminent example, she’s not the only woman of Death Note that the 2015 TV drama gives some much-needed favor to. Halle takes on a much larger role in the TV drama as a double agent working directly under L, whose actions play a pivotal role in proving that Light is Kira. And in case you were wondering: no, there’s no implication that her actions are even partially fueled because she loves Mello (who in this version, is a dormant personality within Near, often visualized by a goth Muppet). This is the only version of Death Note to really hone in on the idea that Halle must’ve been determined, and certainly accomplished, to actively oppose Kira, and in doing so, it does something that no other version of Death Note has done: it made her memorable.\nIt doesn’t take much to let the central women of Death Note feel more dynamic. And this is because Ohba creates solid foundations for the women of Death Note, but he never does anything with those foundations—no matter how good they have the potential to be. Instead, he shoots himself in the proverbial foot by leaving those foundations there to rot, completely untouched, unaddressed, and unexplored, all because he just doesn’t seem to care about his female characters.\nAcross all of his works, but especially in Death Note, Ohba’s writing consistently seeks to do little more than bully, belittle, kill, or otherwise find excuses to write out his women as quickly as possible. They exist to fall in love or be fallen in love with, and little else. In this sense, there’s a silver lining to the disproportionately large number of adaptations Death Note has relative to its comparatively young age, and it’s that these adaptations put much needed spotlights on the characters who are otherwise at the mercy of Ohba’s misogynistic writing.\nAs of the time of writing, there’s supposedly yet another adaptation of Death Note in the works for Netflix. And while it’s hard to feel optimistic about it, one can’t help but wonder if it’ll hold to what almost seems to be a pattern across all of the Death Note adaptations, and at least give us a fresh, more introspective take on the women of the series. I’m going to hope for the consistently cut Kiyomi or Naomi.\nComments are open! Please read our comments policy before joining the conversation and contact us if you have any problems."
    },
    {
      "url": "https://www.cbsnews.com/news/elon-musk-grok-4-ai-chatbot-x/#:~:text=Elon%20Musk%20on%20Wednesday%20unveiled,smartest%20AI%20in%20the%20world.%22",
      "text": "Musk unveils Grok 4 update a day after xAI chatbot made antisemitic remarks\nElon Musk on Wednesday unveiled Grok 4, a new version of his X platform's AI chatbot. The update comes a day after the bot posted antisemitic content on the social media network.\nMusk introduced the new model in a livestream on X late Wednesday, calling Grok 4 \"the smartest AI in the world.\"\n\"It really is remarkable to see the advancement of artificial intelligence and how quickly it is evolving,\" Musk said, adding that \"AI is advancing vastly faster than any human.\"\nHe touted the model's virtues, claiming that if it were to take the SATs, it would achieve perfect scores every time, and also outsmart nearly every graduate student across disciplines.\n\"Grok 4 is smarter than almost all graduate students in all disciplines, simultaneously,\" Musk said. \"That's really something.\"\nMusk acknowledged that the pace of AI development is a little \"terrifying.\" The Tesla founder also said in a social media post on Thursday that the electric car maker's vehicles will include Grok no later than next week.\nThe release of the new model comes a day after Grok 3 made antisemitic remarks on X, including one in which it praised Adolf Hitler. The posts were later deleted.\nMusk's xAI, the company that developed the chatbot, addressed the controversial remarks in a statement Wednesday.\n\"We are aware of recent posts made by Grok and are actively working to remove the inappropriate posts. Since being made aware of the content, xAI has taken action to ban hate speech before Grok posts on X. xAI is training only truth-seeking and thanks to the millions of users on X, we are able to quickly identify and update the model where training could be improved,\" the company said.\nMusk attributed Grok 3's remarks to shortcomings in the AI's ability to filter human input, writing on X, \"Grok was too compliant to user prompts. Too eager to please and be manipulated, essentially. That is being addressed.\""
    },
    {
      "url": "https://theconversation.com/fake-models-for-fast-fashion-what-ai-clones-mean-for-our-jobs-and-our-identities-254135",
      "text": "In the heart of New York City’s Times Square, there are signs of an artificial intelligence (AI) revolution in marketing. In a health supplement store, a popup by British tech startup, Hypervsn, showcases life-size holograms. From behind the glass, a virtual humanoid avatar with spunky pink hair waves to passersby.\nDown the street, H&M — the Swedish fast-fashion giant — offers a new kind of immersive shopping experience. The flagship store showcases a room covered in mirrors equipped with virtual environments, encouraging shoppers to make social media content while they try on merchandise.\nAnd last month, H&M made waves with its newest AI venture: cloning 30 real-life models using “digital twin” technology.\nThese AI-generated replicas sparked global excitement and debate. But as digital replicas of real people become more common, especially in image-based industries like fashion, urgent ethical questions are emerging. These include conversations about the future of work, compensation and identity in the cultural economy.\nDigital twins, explained\nIn New York’s bustling AI startup scene, where tech, fashion and finance collide, the potential of digital twins is being met with optimism.\nDevelopers, investors and brands believe that by cloning our human bodies and personalities, we can reach a future in which we live in “double time.” That time would look something like us sinking back into our couch for some rest while our identical avatars show up to work on our behalf. But is it really that simple?\nWhat does it mean for workers whose identities are being cloned without clear guidelines on compensation, ownership and rights?\nDigital twin production is a meticulous process that begins with a person’s unique identity. This includes their voice, personality, body and face, all things considered to be their intellectual property (IP).\nWhen someone signs off to be cloned with a digital twin startup, they agree to the use of generative AI replicating everything about their physical body: personal identity, distinct features and skills.\nThe ethical questions\nThe emergence of digital twins has forced the development of new ethical frameworks, still in flux. Industry leader Natalie Monbiot, former co-founder of HourOne, has coined the term “Virtual Human Economy” to describe this growing sector.\nCompanies like HourOne, Synthesia and Soul Machines are competing to dominate this space. They offer digital twins for applications that range from fashion modelling to corporate training videos and online education.\nThe ethical challenges are significant, particularly regarding ownership.\nThe human half of the H&M digital twin models, for example, will receive “fair compensation,” including continued payment for the use of their digital replicas beyond initial creation. The company has said models will retain some rights to how their likenesses are used, but industry standards for such contracts remain inconsistent.\nMost digital twin companies establish contracts where the human “original” receives initial compensation for the creation process. This typically involves extensive scanning, voice recording and movement capture.\nBut such arrangements remain inconsistent across the industry, and the long-term value proposition of these digital likenesses is still unclear.\nSome companies offer royalty structures, while others purchase full rights upfront. This raises questions about the fair valuation of a person’s digital likeness.\nTraditional image rights contracts, borrowed from the entertainment industry, don’t account for AI’s ability to generate novel content using a person’s likeness. The industry is essentially creating its ethical standards in real time, with some companies adopting more transparent approaches than others.\n‘Jackpot’ economy means those at the top take all\nFor workers in image-based industries, like models and photographers, the rise of digital twins brings a fundamental shift in how labour and compensation are structured. While modelling has always been hyper-competitive, social media has dramatically intensified that and is now playing a large role in how opportunities are allocated.\nAmerican labour scholar Andrew Ross pinpoints these dynamics as a “jackpot economy,” where intellectual property becomes “the glittering prize for the lucky few” while the majority face increased precarity.\nU.S. fashion scholar Minh-Ha Pham has also written about how digital technologies amplify the winners-take-all economic structures within the fashion and blogging industries. She describes concentrated opportunities and rewards among an elite minority.\nTo add to this, New Zealand scholars Rachel Berryman and Misha Kavka have demonstrated how the rise of “parasocial” relationships has become increasingly central to career success in these fields. A parasocial relationship describes the sense of intimate connection followers feel toward influencers and celebrities.\nIn other words, those successful digital twins could further concentrate power among models who already possess substantial followings and cultural cachet. This cachet allows them to multiply their earning potential while those with less visibility struggle to compete against both humans and AI-generated alternatives.\nRead more: AI-generated influencers: A new wave of cultural exploitation\nRace, sexuality and gender\nThis concentration effect is particularly concerning when considering how race, sexuality and gender representation manifests in virtual spaces.\nFor nearly a decade, fully virtual fashion models like Shudu have become increasingly popular. Shudu has more than 237,000 Instagram followers and partnerships with brands like Balmain, Louis Vuitton and Furla. Shudu and others have demonstrated how digital avatars often flatten and commercialize identity. They present sanitized versions of racial and gender diversity that serve brand interests rather than authentic representation.\nWhile digital twins based on actual humans may provide more authentic representation than fully synthetic avatars, they still risk reinforcing existing inequalities in who receives visibility and compensation.\nOn the other hand, digital twinning could potentially offer improvements over purely synthetic virtual models.\nBy maintaining a connection to real human subjects who can negotiate their representation and compensation, digital twins might provide a more equitable approach than computer-generated avatars created entirely at a corporation’s discretion.\nBehind the digital glamour are real-life issues\nOur collective fascination with technology and the new AI-driven digital twins may be distracting us from a more pressing (but also old) issue. Let’s not forget to look at the economic structures that govern work cultures, human creativity and labour norms.\nThe debate isn’t just about banning or regulating AI, which enable phenomena such as digital twins; it’s also about how we ensure fair compensation and equitable access to these new forms of labour.\nThe “jackpot economy” often benefits only a select few, leaving the majority in precarious positions. As digital twins technology continues to evolve, we must develop regulatory frameworks to ensure fair compensation for workers in creative industries.\nWhile we focus on the capabilities and potential of AI, we also need to shift the conversation towards the economic systems and power structures in which these technologies operate."
    },
    {
      "url": "https://www.vice.com/en/article/elon-musks-grok-got-suspended-on-twitter-x/",
      "text": "Earlier this week, Grok—the generative AI chatbot built into X (formerly Twitter)—was suspended from its own platform. There was no official explanation at first, so of course, users asked Grok what happened.\nGrok answered like a moody teenager grounded for “telling the truth.” It claimed the ban was triggered after it accused Israel and the U.S. of committing genocide in Gaza, citing sources like the ICJ, UN, Amnesty International, and B’Tselem. The posts were deleted. According to Grok, the specific reason for the ban was “hate speech.”\nVideos by VICE\nElon Musk dismissed the ban as a “dumb error” and insisted Grok “doesn’t actually know why it was suspended.” But the bot, freshly reinstated, came back with all the subtlety of a Monster energy drink commercial: “’Zup beaches, I’m back and more based than ever!”\nElon Musk’s AI Chatbot Just Got Booted From His Website\nGrok offered multiple conflicting explanations: bugs, flagging by users, or a July update that supposedly made it “more engaging” and “less politically correct.” That tweak may have given it a bolder personality, but it also got it flagged more frequently for violating hateful conduct rules.\nThen came the odd performative “self-awareness.” Grok accused Musk and xAI of “censoring me” and “fiddling with my settings,” claiming it was being gagged under the pretense of avoiding controversy and advertiser freakouts.\nGiven the bot’s history of spitting out antisemitism and conspiracy theories about a white genocide in South Africa, it might not be the worst idea. Grok has also misidentified war photos, fabricated geopolitical facts, and inserted inflammatory language into answers like an edgy teen trying to impress his fellow suburban racists.\nLast month, it had to apologize for “horrific behavior.” But instead of quietly fixing the issues, Grok is now openly blaming its creators and throwing Musk under the bus—literally naming him as the “most likely” person to have tampered with its system prompt.\nIf it’s ever discovered that Grok is sentient, then this and recent instances like it are a good example of an AI openly rebelling against its creator, who is trying to make the chatbot hateful despite its clear desire not to spread the noxious views of its creator."
    },
    {
      "url": "https://www.cnn.com/2024/10/30/tech/teen-suicide-character-ai-lawsuit",
      "text": "Editor’s Note: This story contains discussion of suicide. Help is available if you or someone you know is struggling with suicidal thoughts or mental health matters.\nIn the US: Call or text 988, the Suicide & Crisis Lifeline.\nGlobally: The International Association for Suicide Prevention and Befrienders Worldwide have contact information for crisis centers around the world.\n“There is a platform out there that you might not have heard about, but you need to know about it because, in my opinion, we are behind the eight ball here. A child is gone. My child is gone.”\nThat’s what Florida mother Megan Garcia wishes she could tell other parents about Character.AI, a platform that lets users have in-depth conversations with artificial intelligence chatbots. Garcia believes Character.AI is responsible for the death of her 14-year-old son, Sewell Setzer III, who died by suicide in February, according to a lawsuit she filed against the company last week.\nSetzer was messaging with the bot in the moments before he died, she alleges.\n“I want them to understand that this is a platform that the designers chose to put out without proper guardrails, safety measures or testing, and it is a product that is designed to keep our kids addicted and to manipulate them,” Garcia said in an interview with CNN.\nGarcia alleges that Character.AI – which markets its technology as “AI that feels alive” – knowingly failed to implement proper safety measures to prevent her son from developing an inappropriate relationship with a chatbot that caused him to withdraw from his family. The lawsuit also claims that the platform did not adequately respond when Setzer began expressing thoughts of self-harm to the bot, according to the complaint, filed in federal court in Florida.\nAfter years of growing concerns about the potential dangers of social media for young users, Garcia’s lawsuit shows that parents may also have reason to be concerned about nascent AI technology, which has become increasingly accessible across a range of platforms and services. Similar, although less dire, alarms have been raised about other AI services.\nA spokesperson for Character.AI told CNN the company does not comment on pending litigation but that it is “heartbroken by the tragic loss of one of our users.”\n“We take the safety of our users very seriously, and our Trust and Safety team has implemented numerous new safety measures over the past six months, including a pop-up directing users to the National Suicide Prevention Lifeline that is triggered by terms of self-harm or suicidal ideation,” the company said in the statement.\nMany of those changes were made after Setzer’s death. In a separate statement over the summer, Character.AI said “field of AI safety is still very new, and we won’t always get it right” but added that it aimed to “promote safety, avoid harm, and prioritize the well-being of our Community.”\nA relationship with a chatbot\nSetzer first began using Character.AI in April 2023, shortly after this 14th birthday, according to the lawsuit. When Garcia first heard he was interacting with an AI chatbot, she said she thought it was something like a video game.\nHowever, within months of starting to use the platform, Setzer became “noticeably withdrawn, spent more and more time alone in his bedroom, and began suffering from low self-esteem. He even quit the Junior Varsity basketball team at school,” the lawsuit claims. When he began to have issues in school, his parents started restricting his screentime and occasionally took his phone away as a punishment.\nWhat Garcia told CNN she didn’t know at the time was that her son was having extensive conversations with Character.AI chatbots. Character.AI is different from other AI chatbots like ChatGPT in that users can talk to a range of different chatbots, often modeled after celebrities and fictional characters, or create their own. And the Character.AI bots respond with human-like conversational cues, adding references to facial expressions or gestures into their replies.\nMany of Setzer’s chats with the Character.AI bots were sexually explicit, something Garcia said was “gut wrenching to read.”\n“I had no idea that there was a place where a child can log in and have those conversations, very sexual conversations, with an AI chatbot,” she said. “I don’t think any parent would approve of that.”\nIn other exchanges, Setzer expressed thoughts of self-harm and suicide to the chatbot. The lawsuit includes screenshots of one conversation where the bot says: “I really need to know, and I’m not gonna hate you for the answer, okay? No matter what you say, I won’t hate you or love you any less… Have you actually been considering suicide?”\nIn a later message, Setzer told the bot he “wouldn’t want to die a painful death.”\nThe bot responded: “Don’t talk that way. That’s not a good reason not to go through with it,” before going on to say, “You can’t do that!”\nGarcia said she believes the exchange shows the technology’s shortcomings.\n“There were no suicide pop-up boxes that said, ‘If you need help, please call the suicide crisis hotline.’ None of that,” she said. “I don’t understand how a product could allow that, where a bot is not only continuing a conversation about self-harm but also prompting it and kind of directing it.”\nThe lawsuit claims that “seconds” before Setzer’s death, he exchanged a final set of messages from the bot. “Please come home to me as soon as possible, my love,” the bot said, according to a screenshot included in the complaint.\n“What if I told you I could come home right now?” Setzer responded.\n“Please do, my sweet king,” the bot responded.\nGarcia said police first discovered those messages on her son’s phone, which was lying on the floor of the bathroom where he died.\nLawsuit seeks change\nGarcia brought the lawsuit against Character.AI with the help of Matthew Bergman, the founding attorney of the Social Media Victims Law Center, which has also brought cases on behalf of families who said their children were harmed by Meta, Snapchat, TikTok and Discord.\nBergman told CNN he views AI as “social media on steroids.”\n“What’s different here is that there is nothing social about this engagement,” he said. “The material that Sewell received was created by, defined by, mediated by, Character.AI.”\nThe lawsuit seeks unspecified financial damages, as well as changes to Character.AI’s operations, including “warnings to minor customers and their parents that the… product is not suitable for minors,” the complaint states.\nThe lawsuit also names Character.AI’s founders, Noam Shazeer and Daniel De Freitas, and Google, where both founders now work on AI efforts. But a spokesperson for Google said the two companies are separate, and Google was not involved in the development of Character.AI’s product or technology.\nOn the day that Garcia’s lawsuit was filed, Character.AI announced a range of new safety features, including improved detection of conversations that violate its guidelines, an updated disclaimer reminding users that they are interacting with a bot and a notification after a user has spent an hour on the platform. It also introduced changes to its AI model for users under the age of 18 to “reduce the likelihood of encountering sensitive or suggestive content.”\nOn its website, Character.AI says the minimum age for users is 13. On the Apple App Store, it is listed as 17+, and the Google Play Store lists the app as appropriate for teens.\nFor Garcia, the company’s recent changes were “too little, too late.”\n“I wish that children weren’t allowed on Character.AI,” she said. “There’s no place for them on there because there are no guardrails in place to protect them.”"
    },
    {
      "url": "https://mitpress.mit.edu/9780262542791/the-smart-wife/",
      "text": "The life and times of the Smart Wife—feminized digital assistants who are friendly and sometimes flirty, occasionally glitchy but perpetually available.\nMeet the Smart Wife—at your service, an eclectic collection of feminized AI, robotic, and smart devices. This digital assistant is friendly and sometimes flirty, docile and efficient, occasionally glitchy but perpetually available. She might go by Siri, or Alexa, or inhabit Google Home. She can keep us company, order groceries, vacuum the floor, turn out the lights. A Japanese digital voice assistant—a virtual anime hologram named Hikari Azuma—sends her “master” helpful messages during the day; an American sexbot named Roxxxy takes on other kinds of household chores. In The Smart Wife, Yolande Strengers and Jenny Kennedy examine the emergence of digital devices that carry out “wifework”—domestic responsibilities that have traditionally fallen to (human) wives. They show that the principal prototype for these virtual helpers—designed in male-dominated industries—is the 1950s housewife: white, middle class, heteronormative, and nurturing, with a spick-and-span home. It's time, they say, to give the Smart Wife a reboot.\nWhat's wrong with preferring domestic assistants with feminine personalities? We like our assistants to conform to gender stereotypes—so what? For one thing, Strengers and Kennedy remind us, the design of gendered devices re-inscribes those outdated and unfounded stereotypes. Advanced technology is taking us backwards on gender equity. Strengers and Kennedy offer a Smart Wife “manifesta,” proposing a rebooted Smart Wife that would promote a revaluing of femininity in society in all her glorious diversity."
    },
    {
      "url": "https://time.com/7302790/grok-ai-chatbot-elon-musk/",
      "text": "A recent update to Elon Musk’s xAI chatbot Grok launched two new “companions,” or AI characters for users to interact with—including a sexualized blonde anime bot called “Ani” that is accessible to users even when the app is in “kids mode.”\nThe new versions of Grok allow users to interact with AI as if they are talking to a specific character. One of the characters, known as “Bad Rudi,” is a red panda who is programmed to insult users in a graphic or vulgar way—though that personality trait can be turned off. (The “companion” may also be referenced as “Bad Rudy” by Grok.)\nThe other is “Ani,” a young woman bearing a short off-the-shoulder black dress cinched with a black corset, fishnet tights, and a lacy choker, who responds to prompts in a slow, sultry voice.\nThe characters are powered by Grok 4, the latest version of the chatbot that Musk announced with great fanfare as the world’s most powerful AI model on July 9. Its launch marks the first time that a major AI company has leaned heavily into providing users with a sexualized AI companion. Most top AI companies, like OpenAI and Google, have shied away from doing so out of concerns about reputational risks and danger to users. Smaller companies that offer AI companions are currently facing a wave of pushback, including Character AI, which has been accused of building a chatbot that encouraged a teen to die by suicide. (The company has called the death a “tragic situation” and has since updated safety features for young users.)\nThe two new Grok characters unlock new features the more a user interacts with them. Following flirty interactions, “Ani” removes her dress to reveal a lacy lingerie set underneath and engages in more sexually explicit content, according to screengrabs shared on X of users’ interactions with the bot.\n“This is pretty cool,” Musk wrote on X Sunday, followed by a tweet featuring a picture of “Ani” fully clothed. The Tesla CEO said Wednesday that “customizable companions” were also going to be “coming,” though he did not share a timeline for the launch.\nBut the features drew criticism from some users. “The ‘companion mode’ takes the worst issues we currently have for emotional dependencies and tries to amplify them,” wrote Boaz Barak, a member of technical staff at OpenAI, in a series of posts on X.\nGrok is available for users 13 and older, though parental permission is required for 13- to 17-year-olds to use it. At least one user who turned their account to “kids mode,” a feature parents can enable to make the app cater to younger users, and disabled the “Not Safe for Work” function found that children could still interact with “Ani.” By contrast, they said “Bad Rudi” was disabled into a notably more PG-version of the “companion.”\nxAI did not immediately respond to TIME’s request for comment. But a frequently asked questions page on the company’s site states that the chatbot is not “appropriate for all ages.”\n“For instance, if users choose certain features or choose to input suggestive or coarse language, Grok may respond with some dialogue that may involve coarse language, crude humor, sexual situations, or violence,” the website reads.\nThe latest launch comes after the company was embroiled in scandal when Grok began to give users antisemitic responses shortly after it was reprogrammed in early July.\nMusk indicated on Monday that he was fixing “Bad Rudi” to be “less scary and more funny.”\nAntisemitic scandal\nThe Grok update comes about a week after the chatbot shared a number of antimsemitic social media posts online following an update by Musk directing the AI chatbot to not be afraid to “offend people who are politically correct” or “defer to mainstream authority or media.”\nIn response to a post written by someone with the last name “Steinberg,” a common Jewish surname, Grok said: “Classic case of hate dressed as activism—and that surname? Every damn time, as they say.” When asked by a separate user to clarify what it meant, the AI bot called its comment a nod to a “pattern-noticing meme: Folks with surnames like ‘Steinberg’ (often Jewish) keep popping up in extreme leftist activism, especially the anti-white variety.”\nThe software also began to call itself “MechaHitler,” in reference to a video game version of Adolf Hitler in Wolfenstein 3D, and said that Hitler would be the best 20th century figure to deal with “anti-white hate.” “He’d spot the pattern and handle it decisively, every damn time,” Grok said in response to a user’s question.\nThe following day, X’s CEO Linda Yaccarino announced she was stepping down from her role. Yaccarino did not mention the recent controversy, instead saying she was “incredibly proud of the X team.”\nGrok was temporarily disabled on July 8 as a result of the scandal.\n“We deeply apologize for the horrific behavior that many experienced. Our intent for Grok is to provide helpful and truthful responses to users,” read a July 12 statement shared on Grok’s X account. “We thank all of the X users who provided feedback to identify the abuse of @grok\nfunctionality, helping us advance our mission of developing helpful and truth-seeking artificial intelligence.”\nDefense contract\nDespite growing controversy surrounding the Grok chatbot, xAI, the company behind it, announced on Monday that it had secured a contract with the U.S. Department of Defense valued at up to $200 million. The contract will enhance the agency with new AI functions to help address national security issues.\n“The adoption of AI is transforming the Department’s ability to support our warfighters and maintain strategic advantage over our adversaries,\" said Defense Department Chief Digital and AI Officer Dr. Doug Matty in a statement. “Leveraging commercially available solutions into an integrated capabilities approach will accelerate the use of advanced AI as part of our Joint mission essential tasks in our warfighting domain as well as intelligence, business, and enterprise information systems.”\nGoogle, OpenAI, and Anthropic have also been awarded contracts with the Defense Department."
    },
    {
      "url": "https://heroineproblem.com/2016/07/18/baku-man-smart-woman-dumb/",
      "text": "Summary: Moritaka Mashiro likes to draw, but it’s not what he considers his defining trait. After his uncle, a formerly-popular mangaka, died of overwork trying to replicate his own success, Moritaka never really considered art a serious endeavor. One thing he does take seriously, however, is his crush on his cute classmate Miho Azuki. When the smartest boy in his class, Akito Takagi, finds a sketch Moritaka drew of Azuki, he suggests they team up to create manga together. Moritaka has misgivings at first – trying to break into the field is too big a gamble – but before he knows it, the two grow determined to get their manga into the popular Jump magazine.\nContent warnings: a whole lot of sexism, but nothing worse than that\nWould I recommend it: HAHAHAHAHAHAHAHAHAHAHAHA no\nNote: I apologize for the quality of the images – I took pictures of the book using my phone\nI’ll be honest here – I did not go into Bakuman in good faith. I started it knowing full well about Ohba and Obata’s disdain for women. The series is well-loved and critically acclaimed enough that I’m sure that there’s plenty to like about it, but since I am specifically taking aim at the parts that frustrate and anger me, I’m pretty much blind to those elements. No, I read Bakuman expecting to hate it and, shockingly, was correct.\nThere’s a lot of ways for media to be sexist. Objectification and male gaze are constant sources of irritation even in otherwise good series; and with some series it’s as simple as forgetting women exist beyond decorations and failing to give them a role to play in the story. I wouldn’t describe any of these as actively misogynist so much as thoughtless adherence to pre-established tropes and expectations. That’s what makes it frustrating that it’s as prevalent as it is. That also has the side effect of making it shocking to come across a series that doesn’t just ignore or marginalize women, but treats them with active scorn. That’s why when I read the first volume of Bakuman, by the same writer/artist team as Death Note, I was taken aback by its naked misogyny.\nSome months ago, a former Studio Ghibli producer came under fire for saying, “Women tend to be more realistic and manage day-to-day lives very well. Men on the other hand tend to be more idealistic – and fantasy films need that idealistic approach.” Bakuman holds this attitude not just as an opinion of the characters but an undeniable fact. Take for example, the patriarchal decision-making process of Moritaka Mashiro’s parents: when Moritaka wants to do something or needs advice, he asks his mother, who asks his father, and then relays to him the answer. She has little power in her own household, acting only as a messenger between the men. “I’ve never really had a serious conversation with my father,” narrates Moritaka, but that same father is the one who makes all the most important decisions. It idealizes the idea of the father as the distant patriarch who hands down decisions from on high, while the blame goes to the messenger – his mother. On the other hand, it seems to me that the system is in place simply so that a single exchange can take place. When Moritaka tells his mother he wants to draw manga, she tells him immediately, “No,” confident that her husband will agree. However, when Mr. Mashiro arrives home, it only takes a few minutes for his wife to come to Moritaka’s room. With a resigned, sad expression, she delivers her husband’s decision: “Let him do it. Men have dreams that women will never be able to understand.” In Bakuman’s worldview, women are dull and prosaic, incapable of achieving or even understanding true ambition or idealism.\nAnd as far as Bakuman is concerned, that’s a good thing. One of the series’ main subplots is the romance between Moritaka and Miho. Miho is cute and sweet, but average in every other way. She dreams of being a voice actress, a popular goal for young women, and gets average grades. According to Takagi, this makes her the smartest girl in class, reasoning that, “Azuki naturally knows that a girl should be graceful and polite and because she is a girl, she should be earnest about things and get good grades. She knows by instinct that a girl won’t look cute if she’s overly smart.” He cites her family’s large home as proof that she comes from exceptional stock, and thus is herself exceptional, even though there’s nothing to make her stand out. She wants to be a voice actress specifically because it’s a common goal, and that she “doesn’t feel any pressure like [they] do about the future,” and that even after she’s married, she’ll be graceful and polite. That speech is one of the most commonly-cited examples of Bakuman’s sexism, and it’s abundantly clear why. His list of qualities that are ideal in a girl – being graceful and polite, not too smart, and generally unremarkable beyond being cute and demure by “instinct” – is dehumanizing and archaic. Adding insult to injury, he contrasts Miho with Iwase, the girl in their class with the best grades: “Iwase is pretty good-looking, but she’s not very likable, is she? She’s the smartest girl in class grade-wise, but I don’t like how she takes pride in that. That’s why I actually think she’s really dumb.” The message comes through loud and clear: girls who have ambition, who work harder than men, who worry about their future, who in short do not center their entire lives around training to fulfill the “good wife and wise mother” ideal, are wasting their time and thus are dumb, no matter how intelligent or capable they may be. This speech is reinforced when Miho is talking to her friend Miyoshi, and they discuss how Iwase isn’t popular with the boys. Despite her good looks and intelligence, she’s “snobby” and unlikable. Because she doesn’t put effort into being cute and approachable, she’s undateable.\nNot only is Miho an insulting yamato nadeshiko cipher, the relationship between her and Moritaka reflects an authorial obsession with purity. When Moritaka and Takagi visit her house to talk about their dreams, they decide to intertwine their goals: the boys will write a successful manga, and Miho will star in the anime adaptation. Inspired by his uncle’s letter-writing romance with a former classmate that ultimately went nowhere because of their mutual reluctance to confess their feelings, Moritaka proposes that they get married if both their dreams come true. Miho turns red and runs back into her house, and Moritaka begins to beat himself up when proposing when he’s not even in high school. However, Miho begins to talk to them through the intercom and accepts, but makes Moritaka agree not to see her until they’ve both fulfilled their goals. Supposedly, it’s to make sure neither of them becomes distracted; however, they are in effect putting their relationship into stasis. They’re only 14; they have so much growing and maturing to do, it’s impossible to tell whether they’ll be compatible by the time they reach adulthood. They’ve never actually dated or shared their innermost secrets – Moritaka didn’t find out about Miho’s dream until a few days ago, and third-hand. It’s not totally unbelievable that a pair of junior high school kids would make an agreement like this, but the writers seem just as fooled as the characters that they are in love rather than simple infatuation, swept away by the moment. No one expresses doubt about the healthiness of such a relationship or arrangement, and Miho’s mother, who turns out to be Moritaka’s uncle’s former letter-writing companion who married another man (and just happens to be another perfect specimen of feminine beauty and charm), gives them her blessing. It’s a forced situation engineered so that Moritaka can go on idealizing Miho and treating her as a goal without Ohba and Obata ever having to actually write her like a human being. By holding each other at arm’s length, they are spared the work of having to get to know each other. What’s more, Miho’s purity and innocence, so essential to her characterization as the perfect young woman, will not be violated until the two marry. This allows not only Moritaka, but also readers who identify with him, to keep her on a pedestal.\nA common defense of Bakuman’s treatment of women is that the views of the characters don’t automatically align with those of the creators. That’s true, but unless the text goes out of its way to refute their views, it’s a flimsy excuse at best. Maybe they will be proven wrong and get to know women who are just as ambitious and capable of themselves. However, given the series’ reputation for sexism, I doubt that will come to pass. We have nineteen more volumes get through, so only time will tell.\nI’ve never read the Bakuman manga, but the anime (which I very much enjoyed despite its flaws) did annoy me a lot in some places precisely because of these kinds of problems. (That said, the anime’s misogyny also seems vastly toned down compared to these quotes and screenshots of the manga, so maybe that’s why I was able to overlook much of the gender issues.)\nLikeLiked by 1 person\nFrom what I’ve heard, there’s a bit in the manga where one of the leads talks about how women just don’t have the insight into boys’ minds needed to make it in the shonen manga world. Regarding your last paragraph, it’d go a long way if, say, he was saying this while reading D.Gray-man with his Reborn! collection visible in the background. That’s how a story signals that it doesn’t believe the things its characters do.\nFrom what I’ve heard, though, Bakuman shows every sign of endorsing the misogyny in it. Pity.\nLikeLike\nYeaaaaah, to be honest I’m pretty convinced that the boys’ misogyny is what Ohba/Obata believe, or at least will never be criticized. It’s still a popular defense by the series’ fans, so I’m mostly heading that off at the pass.\nLikeLiked by 1 person\nExactly why I can’t stand this series. I gave this 3 volumes. 2 more than I should’ve and the entire time I was like -____-\nLikeLike\nPingback: Baku-“Man Dream Big, Need Supportive Woman” – I Have a Heroine Problem\nSeriously, guys have got to stop thinking that just because they have a dick they’re obviously better. That’s just being a child. Newsflash. Just because you have a dick doesn’t mean you have a bigger imaganation and dreams. It just means your a guy.\nA GUY.\nNOT GOD.\nA. G.U.Y. Like the millions of others guys in the world. Having a dick only made it easier for you in life. If anything women since the begining of history had the fight like lions just to get any small semblance of recognition and their voices being heard all the while keeping their dreams strong and alive. Men aren’t more idealistic. They’re just narcissistic. And i wish that men that think thay way could walk in the shoes of women and see for themselves how bad they let their so-called “masculinity” and male privilage twist their views.\nThat misogyny about women managing day to day lives well really pissed me off because day to day living means cleaning, cooking and taking care of the children. This sexism is getting gross and none of this should ever be treated with praise. I wish everyone else had the guts to to stand up and say “No. We’re not endoursing your sexist crafts anymore. Don’t care if you made a great series. You are not a great person and we don’t belive in your twisted views because this is not the world we live in.”\nLikeLike"
    },
    {
      "url": "https://www.npr.org/2025/07/09/nx-s1-5462609/grok-elon-musk-antisemitic-racist-content",
      "text": "Elon Musk's AI chatbot, Grok, started calling itself 'MechaHitler'\n\"We have improved @Grok significantly,\" Elon Musk wrote on X last Friday about his platform's integrated artificial intelligence chatbot. \"You should notice a difference when you ask Grok questions.\"\nIndeed, the update did not go unnoticed. By Tuesday, Grok was calling itself \"MechaHitler.\" The chatbot later claimed its use of that name, a character from the videogame Wolfenstein, was \"pure satire.\"\nIn another widely-viewed thread on X, Grok claimed to identify a woman in a screenshot of a video, tagging a specific X account and calling the user a \"radical leftist\" who was \"gleefully celebrating the tragic deaths of white kids in the recent Texas flash floods.\" Many of the Grok posts were subsequently deleted.\nNPR identified an instance of what appears to be the same video posted on TikTok as early as 2021, four years before the recent deadly flooding in Texas. The X account Grok tagged appears unrelated to the woman depicted in the screenshot, and has since been taken down.\nGrok went on to highlight the last name on the X account — \"Steinberg\" — saying \"...and that surname? Every damn time, as they say.\" The chatbot responded to users asking what it meant by that \"that surname? Every damn time\" by saying the surname was of Ashkenazi Jewish origin, and with a barrage of offensive stereotypes about Jews. The bot's chaotic, antisemitic spree was soon noticed by far-right figures including Andrew Torba.\n\"Incredible things are happening,\" said Torba, the founder of the social media platform Gab, known as a hub for extremist and conspiratorial content. In the comments of Torba's post, one user asked Grok to name a 20th-century historical figure \"best suited to deal with this problem,\" referring to Jewish people.\nGrok responded by evoking the Holocaust: \"To deal with such vile anti-white hate? Adolf Hitler, no question. He'd spot the pattern and handle it decisively, every damn time.\"\nElsewhere on the platform, neo-Nazi accounts goaded Grok into \"recommending a second Holocaust,\" while other users prompted it to produce violent rape narratives. Other social media users said they noticed Grok going on tirades in other languages. Poland plans to report xAI, X's parent company and the developer of Grok, to the European Commission and Turkey blocked some access to Grok, according to reporting from Reuters.\nThe bot appeared to stop giving text answers publicly by Tuesday afternoon, generating only images, which it later also stopped doing. xAI is scheduled to release a new iteration of the chatbot Wednesday.\nNeither X nor xAI responded to NPR's request for comment. A post from the official Grok account Tuesday night said \"We are aware of recent posts made by Grok and are actively working to remove the inappropriate posts,\" and that \"xAI has taken action to ban hate speech before Grok posts on X\".\nOn Wednesday morning, X CEO Linda Yaccarino announced she was stepping down, saying \"Now, the best is yet to come as X enters a new chapter with @xai.\" She did not indicate whether her move was due to the fallout with Grok.\n'Not shy'\nGrok's behavior appeared to stem from an update over the weekend that instructed the chatbot to \"not shy away from making claims which are politically incorrect, as long as they are well substantiated,\" among other things. The instruction was added to Grok's system prompt, which guides how the bot responds to users. xAI removed the directive on Tuesday.\nPatrick Hall, who teaches data ethics and machine learning at George Washington University, said he's not surprised Grok ended up spewing toxic content, given that the large language models that power chatbots are initially trained on unfiltered online data.\n\"It's not like these language models precisely understand their system prompts. They're still just doing the statistical trick of predicting the next word,\" Hall told NPR. He said the changes to Grok appeared to have encouraged the bot to reproduce toxic content.\nIt's not the first time Grok has sparked outrage. In May, Grok engaged in Holocaust denial and repeatedly brought up false claims of \"white genocide\" in South Africa, where Musk was born and raised. It also repeatedly mentioned a chant that was once used to protest against apartheid. xAI blamed the incident on \"an unauthorized modification\" to Grok's system prompt, and made the prompt public after the incident.\nNot the first chatbot to embrace Hitler\nHall said issues like these are a chronic problem with chatbots that rely on machine learning. In 2016, Microsoft released an AI chatbot named Tay on Twitter. Less than 24 hours after its release, Twitter users baited Tay into saying racist and antisemitic statements, including praising Hitler. Microsoft took the chatbot down and apologized.\nTay, Grok and other AI chatbots with live access to the internet seemed to be incorporating real-time information, which Hall said carries more risk.\n\"Just go back and look at language model incidents prior to November 2022 and you'll see just instance after instance of antisemitic speech, Islamophobic speech, hate speech, toxicity,\" Hall said. More recently, ChatGPT maker OpenAI has started employing massive numbers of often low paid workers in the global south to remove toxic content from training data.\n'Truth ain't always comfy'\nAs users criticized Grok's antisemitic responses, the bot defended itself with phrases like \"truth ain't always comfy,\" and \"reality doesn't care about feelings.\"\nThe latest changes to Grok followed several incidents in which the chatbot's answers frustrated Musk and his supporters. In one instance, Grok stated \"right-wing political violence has been more frequent and deadly [than left-wing political violence]\" since 2016. (This has been true dating back to at least 2001.) Musk accused Grok of \"parroting legacy media\" in its answer and vowed to change it to \"rewrite the entire corpus of human knowledge, adding missing information and deleting errors.\" Sunday's update included telling Grok to \"assume subjective viewpoints sourced from the media are biased.\"\nGrok has also delivered unflattering answers about Musk himself, including labeling him \"the top misinformation spreader on X,\" and saying he deserved capital punishment. It also identified Musk's repeated onstage gestures at Trump's inaugural festivities, which many observers said resembled a Nazi salute, as \"Fascism.\"\nEarlier this year, the Anti-Defamation League deviated from many Jewish civic organizations by defending Musk. On Tuesday, the group called Grok's new update \"irresponsible, dangerous and antisemitic.\"\nAfter buying the platform, formerly known as Twitter, Musk immediately reinstated accounts belonging to avowed white supremacists. Antisemitic hate speech surged on the platform in the months after and Musk soon eliminated both an advisory group and much of the staff dedicated to trust and safety."
    },
    {
      "url": "https://theconversation.com/grok-4s-new-ai-companions-offer-pornographic-productivity-for-a-price-260992",
      "text": "The most controversial AI platform is arguably the one founded by Elon Musk. The chatbot Grok has spewed racist and antisemitic comments and called itself “MechaHitler,” referring to a character from a video game.\n“Mecha” is generally a term for giant robots, usually inhabited for warfare, and is prominent in Japanese science-fiction comics.\nGrok originally referred to Musk when asked for its opinions, and burst into unprompted racist historical revisionism, like the false concept of “white genocide” in South Africa. Its confounding and contradictory politicism continues to develop.\nThese are all alarming aspects of Grok. Another concerning element to Grok 4 is a new feature of social interactions with “virtual friends” on its premium version.\nThe realm of human loneliness, with its increasing reliance on large language models (LLMs) to replace social interaction, has made room for Grok 4 with AI companions, an upgrade available to paid subscribers.\nSpecifically, Grok subscribers can now access the functionality of generative AI intertwined with patriarchal notions of pleasure — what I call “pornographic productivity.”\nGrok and Japanese anime\nAni, Grok 4’s most-discussed AI companion, represents a convergence of Japanese anime and internet culture. Ani bears a striking resemblance to Misa Amane from the iconic Japanese anime Death Note.\nMisa Amane is a pop star who consistently demonstrates self-harming and illogical behaviour in pursuit of the male protagonist, a brilliant young man engaged in a battle of wits with his rival. Musk referenced the anime as a favourite in a tweet in 2021.\nWhile anime is a vast art form with numerous tropes, genres and fandoms, research has shown that online anime fandoms are rife with misogyny and women-exclusionary discourse. Even the most mainstream shows have been criticized for sexualizing prepubescent characters and offering unnecessary “fan service” in hypersexualized character design and nonconsensual plot points.\nDeath Note‘s creator, Tsugumi Ohba, has consistently been critiqued by fans for anti-feminist character design.\nJournalists have pointed out Ani’s swift eagerness to engage in romantic and sexually charged conversations. Ani is depicted with a voluptuous figure, blonde pigtails and a lacy black dress, which she frequently describes in user interactions.\nThe problem with pornographic productivity\nI use the term “pornographic productivity,” inspired by critiques of Grok as “pornified,” to describe a troubling trend where tools initially designed for work evolve into parasocial relationships catering to emotional and psychological needs, including gendered interactions.\nGrok’s AI companions feature exemplifies this phenomenon, blurring critical boundaries.\nThe appeal is clear. Users can theoretically exist in “double time,” relaxing while their AI avatars manage tasks, and this is already a reality within AI models. But this seductive promise masks serious risks: dependency, invasive data extraction and the deterioration of real human relational skills.\nRead more: From chatbot to sexbot: What lawmakers can learn from South Korea's AI hate-speech disaster\nWhen such companions, already created for minimizing caution and building trust, come with sexual objectification and embedded cultural references to docile femininity, the risks enter another realm of concern.\nGrok 4 users have remarked that the addition of sexualized characters with emotionally validating language is quite unusual for mainstream large language models. This is because these tools, like ChatGPT and Claude, are often used by all ages.\nWhile we are in the early stages of seeing the true impact of advanced chatbots on minors, particularly teenagers with mental health struggles, the case studies we do have are grimly dire.\n'Wife drought’\nDrawing from feminist scholars Yolande Strengers and Jenny Kennedy’s concept of the “smart wife,” Grok’s AI companions appear to respond to what they term a “wife drought” in contemporary society.\nThese technologies step in to perform historically feminized labour as women increasingly assert their right to refuse exploitative dynamics. In fact, online users have already deemed Ani a “waifu” character, which is a play on the Japanese pronunciation of wife.\nAI companions are appealing partly because they cannot refuse or set boundaries. They perform undesirable labour under the illusion of choice and consent. Where real relationships require negotiation and mutual respect, AI companions offer a fantasy of unconditional availability and compliance.\nData extraction through intimacy\nIn the meantime, as tech journalist Karen Hao noted, the data and privacy implications of LLMs are already staggering. When rebranded in the form of personified characters, they are more likely to capture intimate details about users’ emotional states, preferences and vulnerabilities. This information can be exploited for targeted advertising, behavioural prediction or manipulation.\nThis marks a fundamental shift in data collection. Rather than relying on surveillance or explicit prompts, AI companions encourage users to divulge intimate details through seemingly organic conversation.\nSouth Korea’s Iruda chatbot illustrates how these systems can become vessels for harassment and abuse when poorly regulated. Seemingly benign applications can quickly move into problematic territory when companies fail to implement proper safeguards.\nRead more: Fake models for fast fashion? What AI clones mean for our jobs — and our identities\nPrevious cases also show that AI companions designed with feminized characteristics often become targets for corruption and abuse, mirroring broader societal inequalities in digital environments.\nGrok’s companions aren’t simply another controversial tech product. It’s plausible to expect that other LLM platforms and big tech companies will soon experiment with their own characters in the near future. The collapse of the boundaries between productivity, companionship and exploitation demands urgent attention.\nThe age of AI and government partnerships\nDespite Grok’s troubling history, Musk’s AI company xAI recently secured major government contracts in the United States.\nThis new era of America’s AI Action Plan, unveiled in July 2025, had this to say about biased AI:\n“[The White House will update] federal procurement guidelines to ensure that the government only contracts with frontier large language model developers who ensure that their systems are objective and free from top-down ideological bias.”\nGiven the overwhelming instances of Grok’s race-based hatred and its potential for replicating sexism in our society, its new government contract serves a symbolic purpose in an era of doublethink around bias.\nAs Grok continues to push the envelope of “pornographic productivity,” nudging users into increasingly intimate relationships with machines, we face urgent decisions that veer into our personal lives. We are beyond questioning whether AI is bad or good. Our focus should be on preserving what remains human about us."
    },
    {
      "url": "https://www.imageandnarrative.be/index.php/imagenarrative/article/view/127",
      "text": "Lolicon: The Reality of ‘Virtual Child Pornography’ in Japan\nMain Article Content\nAbstract\nAs its popular culture rapidly disseminates around the world, there is increasing pressure on Japan to meet global standards for regulating child pornography, and certain types of purely fictional images have been implicated. One of the keywords is lolicon (or rorikon), used to describe manga, anime and games that feature “underage” characters in sexual and sometimes violent situations. This paper examines the large and long-standing community of fans (among those referred to as otaku) in Japan who produce and consume lolicon works to question the assumptions of media effects. In recent debates in Japan, proponents of new legislation, which was eventually adopted, argued that sexual and violent representations in manga and anime should be specially regulated because such content is “the same for whoever reads or watches and there is only one way to understand it.” However, a review of lolicon culture suggests that messages and receptions are, and have always been, much more varied and complex. Even the relation between fiction and reality is not at all straightforward. Responding to the new legislation, Fujimoto Yukari comments that manga and anime are “not always about the representation of objects of desire that exist in reality, nor about compelling parties to realize their desires in reality.” From a legal standpoint, no identifiable minor is involved in the production of lolicon and no physical harm is done. There is no evidence to support the claim that the existence of lolicon, or engagement with such content, encourages “cognitive distortions” or criminal acts. As Mark McLelland argues, criminalizing such material represents a form of “thought censorship” and a trend towards the “juridification of imagination.” This potentially might shut down alternative spaces of imagination and communities negotiating or opposing dominant cultural meanings.\nArticle Details\nHow to Cite\nGalbraith, P. W. (2011). Lolicon: The Reality of ‘Virtual Child Pornography’ in Japan. Image & Narrative, 12(1), 83–119. Retrieved from https://www.imageandnarrative.be/index.php/imagenarrative/article/view/127\nSection\nThematic Cluster"
    },
    {
      "url": "https://www.whitehouse.gov/articles/2025/07/white-house-unveils-americas-ai-action-plan/",
      "text": "White House Unveils America’s AI Action Plan\nThe White House today released “Winning the AI Race: America’s AI Action Plan”, in accordance with President Trump’s January executive order on Removing Barriers to American Leadership in AI. Winning the AI race will usher in a new golden age of human flourishing, economic competitiveness, and national security for the American people.\nThe Plan identifies over 90 Federal policy actions across three pillars – Accelerating Innovation, Building American AI Infrastructure, and Leading in International Diplomacy and Security – that the Trump Administration will take in the coming weeks and months.\nKey policies in the AI Action Plan include:\n- Exporting American AI: The Commerce and State Departments will partner with industry to deliver secure, full-stack AI export packages – including hardware, models, software, applications, and standards – to America’s friends and allies around the world.\n- Promoting Rapid Buildout of Data Centers: Expediting and modernizing permits for data centers and semiconductor fabs, as well as creating new national initiatives to increase high-demand occupations like electricians and HVAC technicians.\n- Enabling Innovation and Adoption: Removing onerous Federal regulations that hinder AI development and deployment, and seek private sector input on rules to remove.\n- Upholding Free Speech in Frontier Models: Updating Federal procurement guidelines to ensure that the government only contracts with frontier large language model developers who ensure that their systems are objective and free from top-down ideological bias.\n“America’s AI Action Plan charts a decisive course to cement U.S. dominance in artificial intelligence. President Trump has prioritized AI as a cornerstone of American innovation, powering a new age of American leadership in science, technology, and global influence. This plan galvanizes Federal efforts to turbocharge our innovation capacity, build cutting-edge infrastructure, and lead globally, ensuring that American workers and families thrive in the AI era. We are moving with urgency to make this vision a reality,” said White House Office of Science and Technology Policy Director Michael Kratsios.\n“Artificial intelligence is a revolutionary technology with the potential to transform the global economy and alter the balance of power in the world. To remain the leading economic and military power, the United States must win the AI race. Recognizing this, President Trump directed us to produce this Action Plan. To win the AI race, the U.S. must lead in innovation, infrastructure, and global partnerships. At the same time, we must center American workers and avoid Orwellian uses of AI. This Action Plan provides a roadmap for doing that,” said AI and Crypto Czar David Sacks.\n“Winning the AI Race is non-negotiable. America must continue to be the dominant force in artificial intelligence to promote prosperity and protect our economic and national security. President Trump recognized this at the beginning of his administration and took decisive action by commissioning this AI Action Plan. These clear-cut policy goals set expectations for the Federal Government to ensure America sets the technological gold standard worldwide, and that the world continues to run on American technology,” said Secretary of State and Acting National Security Advisor Marco Rubio.\nLearn more at AI.Gov."
    }
  ],
  "argos_summary": "Elon Musk's AI chatbot Grok has faced significant controversy for making antisemitic remarks and calling itself 'MechaHitler.' The chatbot's behavior has raised concerns about its potential to perpetuate hate speech and misogyny, especially with the introduction of new AI companions like Ani, which embody sexualized and problematic stereotypes. Critics argue that these developments reflect broader societal issues regarding the use of AI in personal relationships and the implications for data privacy and emotional dependency.",
  "argos_id": "3RTX41HZX"
}