{
  "url": "https://www.latimes.com/entertainment-arts/business/story/2025-08-14/fox-direct-to-consumer-streaming-service-takes-off-next-week",
  "authorsByline": "By Stephen BattaglioStaff Writer  Follow",
  "articleId": "df85f0ca63ee4b61847f72c00f498990",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/e4ea088/2147483647/strip/true/crop/3505x1840+0+248/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff4%2F97%2F9b9ca6a5416696012437aba556fc%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2189690000",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T22:08:15.989000+00:00",
  "addDate": "2025-08-14T22:14:27.402775+00:00",
  "refreshDate": "2025-08-14T22:14:27.402780+00:00",
  "score": 1.0,
  "title": "Fox's $20-a-month news and sports streamer launches next week. Here's what's on it",
  "description": "Fox's news and sports content will be available to stream for $19.99 a month.",
  "content": "Fox Corp. is betting on sports and news to fuel its new Fox One streaming service.\n\nRupert Murdoch’s Fox Corp. has largely stayed on the sidelines of the streaming wars.\n\nFox, which owns the most-watched cable news channel Fox News and has TV rights to major sporting events such as the NFL and MLB post-season baseball, has remained committed to the declining pay TV business.\n\nBut with 65 million households no longer hooked up to cable or satellite services, the company making its channels available to non-pay TV customers for the first time with Fox One, a new streaming platform that will launch Aug. 21.\n\n“There is a growing audience outside of cable,” said Pete Distad, chief executive of direct-to-consumer for Fox Corp., who previewed the service Thursday at a press briefing at the company’s New York headquarters. “We need to give to give those cord-cutters and cord-nevers access to our content.”\n\nFor $19.99 a month, Fox One will provide subscribers with their local Fox TV affiliate that carries a package of NFL games, plus two Fox Sports cable channels. A full year subscription will cost $199.\n\nFox One will also carry Fox News Media’s channels, which include Fox News, Fox Weather and Fox Business. It will provide replays of Fox programming on demand, with access to current seasons of entertainment programs and DVR capabilities with unlimited storage.\n\nBut the main selling point of Fox One will be the company’s array of live events, which include next year’s FIFA World Cup. The service will be promoted with the marketing tag line, “We Live For Live.”\n\nSports is the driver for the service. Fox Corp. and Walt Disney Co. have already agreed to offer a package deal for Fox One and the upcoming ESPN direct-to-consumer service also launching next week, for $39.99 a month, a savings of $10. ESPN will charge subscribers $29.99 on its own.\n\nDistad said his company will look at more opportunities to bundle Fox One with other streaming services.\n\nUntil now, Fox’s biggest investment in streaming was the acquisition of Tubi, an ad-supported free streaming service that has grown to capture 1% of all U.S. TV viewing according to Nielsen.\n\nFox Corp. sold its TV and movie studio assets to Disney in 2019, partly because the company did not believe it could compete with deep-pocketed tech firms such as Amazon and Apple, which have spent freely on producing content for their streaming platforms.\n\nBut Amazon and Netflix — which acquired NFL rights in recent years — have shown that they can draw large audiences for live sports events, an area where Fox Corp. is already deeply entrenched.\n\nThe real test for the new streaming product will be the appetite for Fox News. The conservative-leaning news channel dominates its competitors in the TV ratings. Whether consumers who have cut the cable cord will be willing to pay to stream the channel’s live feed is an open question.\n\n“Nobody knows how many news fans are outside of the pay TV universe,” Distad said.\n\nDistad is encouraged by the reach of Fox News content online after it airs live on the TV network. Fox News scored 1.5 billion views on YouTube and 3.7 billion views on social media platforms in the last quarter.\n\nFox News Media’s existing streaming channel, Fox Nation, will be offered as a $5 add-on for Fox One for a total of $24.99 a month. The service has documentaries, true crime shows and movies that appeal to the Fox News audience.\n\nFox Corp. executives are keeping their expectations low. It’s priced high enough so that the consumer who is currently happy with their current cable TV subscription is not likely to cancel.\n\nBut Distad said profit projections are “aggressive” as the platform will not spend money to create original programming. All of the content is being provided from its existing networks.\n\nInvestment in original programming has been the main obstacle to profitability for the streaming services that have proliferated in recent years.\n\nDistad said the company is considering putting podcasts on the Fox One platform. Fox Corp. company recently acquired Red Seat Ventures, a media company that specializes in providing business support and technical services for right-leaning podcasts.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/business/story/2025-08-13/californias-burger-wars-heat-up-as-the-habit-burger-grill-escalates-billboard-battle-with-in-n-out",
    "https://www.latimes.com/business/story/2025-08-13/here-are-the-evs-you-can-buy-for-35-thousand-or-less",
    "https://www.latimes.com/business/story/2025-08-01/what-can-retirees-do-to-deduct-medical-expenses",
    "https://www.latimes.com/entertainment-arts/business/story/2025-02-10/super-bowl-lix-scores-126-million-viewers-despite-blowout",
    "https://www.latimes.com/entertainment-arts/business/story/2025-05-13/espn-standalone-streaming-service-will-cost-29-99-a-month-staring-in-sept",
    "https://www.latimes.com/entertainment-arts/business/story/2025-02-10/fox-corp-acquires-podcast-marketer-red-seat-ventures",
    "https://www.latimes.com/entertainment-arts/business/story/2021-10-21/fox-news-digital-weather-service-climate-change-murdoch",
    "https://www.latimes.com/entertainment-arts/business",
    "https://www.latimes.com/entertainment-arts/business/story/2024-06-13/amid-streaming-inflation-tubi-cashes-in-on-the-value-of-free-fox"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Fox Corp. company",
      "weight": 0.12497061
    },
    {
      "name": "Fox Corp.",
      "weight": 0.119192764
    },
    {
      "name": "Fox News",
      "weight": 0.1155492
    },
    {
      "name": "Fox Corp. executives",
      "weight": 0.1136178
    },
    {
      "name": "Fox News content",
      "weight": 0.1125892
    },
    {
      "name": "Fox programming",
      "weight": 0.110692225
    },
    {
      "name": "Fox",
      "weight": 0.110152274
    },
    {
      "name": "Fox TV",
      "weight": 0.10715991
    },
    {
      "name": "Fox Nation",
      "weight": 0.107077345
    },
    {
      "name": "Fox Sports",
      "weight": 0.10652029
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    },
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/TV & Video/TV Networks & Stations",
      "score": 0.8720703125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.87158203125
    },
    {
      "name": "/News/Sports News",
      "score": 0.716796875
    },
    {
      "name": "/News/Other",
      "score": 0.61474609375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.55810546875
    }
  ],
  "sentiment": {
    "positive": 0.5735895,
    "negative": 0.03468301,
    "neutral": 0.39172748
  },
  "summary": "Fox Corp. is investing in sports and news as its new Fox One streaming service launches next week. The company, which owns Fox News and has TV rights to major sporting events, is making its channels available to non-pay TV customers for the first time. The service will cost $20 a month and will include local Fox TV affiliate, two Fox Sports cable channels, and Fox News Media's channels. The main selling point of Fox One will be its array of live events, including next year's FIFA World Cup. Pete Distad, CEO of direct-to-consumer for Fox Corp., previewed the service at a press briefing. Fox Corp. and Walt Disney Co. have agreed to offer a package deal for Fox One and the upcoming ESPN direct-t-consumer service, for $39.99 a month, a savings of $10.99 on its own.",
  "shortSummary": "Fox Corp. launches its $20-a-month streaming service Fox One, focusing on sports and news, aiming to attract non-pay TV customers and compete with tech giants like Amazon.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ba6543fe79e34ed39b76899fbf5ca282",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/entertainment-arts/business/story/2024-06-13/amid-streaming-inflation-tubi-cashes-in-on-the-value-of-free-fox",
      "text": "As streaming becomes more expensive, Tubi cashes in on the value of free\n- Share via\nIn the era of “streamflation,” it’s a good time to be Tubi.\nSubscription prices for Netflix, Disney+, Max and Peacock have crept up over the last year, and more consumers are turning to the free, ad-supported video-on-demand service owned by Fox Corp.\nNielsen data showed that May was Tubi’s most-watched month ever, with an average audience of 1 million viewers, up 46% from a year ago.\nThe streamer edged out Disney+, which averaged 969,000 viewers. Tubi also easily beat NBCUniversal’s Peacock, Warner Bros. Discovery’s Max and Paramount Global’s Paramount+ while also topping free competitors such as the Roku Channel and Pluto TV. YouTube is the only free ad-supported streaming platform with more viewers than Tubi.\nThird-quarter revenue for Tubi grew 22% year-over-year at a time when the advertising market was sluggish, according to Fox.\n“Tubi continues to pull ahead from its (ad-supported video on demand) competition and post faster than expected growth,” analysts at research firm MoffettNathanson said in a report for clients.\nThe escalating subscription costs of the competition have certainly helped. With Netflix, Amazon and others now selling advertising in addition to charging fees, Tubi is looking like a better deal to many budget-conscious consumers.\n“Of course, those are things that are going to positively impact us,” Adam Lewinson, chief content officer for Tubi, said in a recent interview.\nThe San Francisco-based company was founded in 2017 and acquired by Fox in 2020 for $440 million. Tubi currently offers 250,000 TV episodes and movies.\nTubi says 63% of its users describe themselves as “cord-nevers” — people who have never subscribed to a pay-TV package — or cord-cutters. About half are what Tubi categorizes as multicultural, covering Black, Latino, Asian and LGBTQ+ audiences.\nAlthough Tubi has a wide array of livestreaming channels that deliver shows, live sports and news in real time, 90% of its viewing is on demand, younger viewers’ preferred way to watch. The streamer says the median age of its audience is 39, the youngest in television.\nTubi has built a mass-appeal product by covering a wide swath of genres, including horror and sci-fi. It has become a destination for work by Black filmmakers. The company is the platform for Village Roadshow’s Black Noir Cinema initiative, aimed at creating Blaxploitation-style films (the first one, “Cinnamon,” starred Pam Grier, an iconic actor from the genre’s original era).\nShonda Rhimes’ medical drama continues to draw new fans and has become the most-streamed Disney show around the world.\nTubi has an array of vintage hit network TV series that are discovered and then devoured by younger viewers not already familiar with them. But it also provides a home for shows that were ignored when they initially ran on traditional TV, even highlighting them in a section called “Canceled Too Soon.”\nOne such obscurity, “Believe,” was gone after 13 episodes on NBC in the 2013-14 TV season. But the series from “Gravity” director Alfonso Cuarón, about a girl with supernatural abilities, is now a Tubi hit.\n“If things stay on its current course, we believe it’s going to get far more viewers on Tubi than it ever got in its first window on broadcast,” Lewinson said of “Believe.”\nThe next step for Tubi is to expand its production of original programs and movies, which remain an important draw for consumers when they choose a streaming service. Starting with low-budget 2021 thriller “Twisted House Sitter,” the company has produced 200 titles, mostly genre movies, documentaries and animated series.\nBut with success comes the ability to attract higher-profile talent. Filming has begun on original Tubi film “The Thicket,” a dark western starring Peter Dinklage and Juliette Lewis.\nLewinson acknowledges that some explaining was required to get Dinklage to sign on with his project when they first met two years ago.\n“I had to get him comfortable with what we are building,” Lewinson said.\nAs Tubi has expanded its presence in the TV landscape, it’s no longer a heavy lift for Lewinson to get big names into the fold. This fall, the service is launching its first original series, “The Z Suite,” with Lauren Graham, a multigenerational TV star thanks to her “Gilmore Girls” fame.\n“The Z Suite” features Graham as a fired advertising mogul whose agency is taken over by its Gen Z employees. Tubi developed the series after the marketing department noted an abundance of TikTok videos about generational divides in the workplace.\nBesides inspiration for programs, social media has given Tubi a lift through genre fans who post about the streamer’s content.\n“There is a gentleman on Reddit who actually has a spreadsheet with synopses of all of our horror movies,” said Nicole Parlapiano, Tubi’s chief marketing officer. “We are really good at tapping into fandom communities, whether it be on Reddit or TikTok.”"
    },
    {
      "url": "https://www.latimes.com/entertainment-arts/business/story/2021-10-21/fox-news-digital-weather-service-climate-change-murdoch",
      "text": "Fox News gets into the weather business. Will climate-conscious viewers take it seriously?\n- Share via\nWhenever consumers are asked to name their primary reason for tuning into a TV newscast, the No. 1 answer is always the weather.\nCable news channels of every political stripe see their ratings rise when a weather event occurs, and climate change is increasing their severity and frequency.\nIt’s why Fox News Media is investing more than $10 million in a new digital service called Fox Weather that will be available as a free, live, 24-hour ad-supported streaming video channel available as a mobile app and on internet-connected TVs through services such as Tubi. It will also be seen on over-the-air TV stations reaching 26 million homes.\nThe service launching Monday will test the elasticity of the Fox News brand name.\nWhile the flagship news network at Rupert Murdoch’s Fox Corp. is the most-watched channel on cable TV, its conservative commentary has become more polarizing in recent years. Fox News has come under fire recently over how its opinion hosts have stoked public skepticism of the COVID-19 vaccines, at times with misinformation.\nFox News commentators have also been largely dismissive of climate change. Last year, prime-time host Tucker Carlson described climate change as “systemic racism in the sky,” and he raised doubts about its impact on the wildfires that swept the West Coast.\nThe attitude spilled into the news coverage last month, when one of Fox News’ anchors, Bill Hemmer, put quotes around the term climate change during coverage of extreme weather that caused flooding in New York City.\nThe political stance raises the question of whether viewers who eschew the channel for the right-leaning political bent of its most-watched hosts will trust a weather service with the Fox name.\nThe company will face well-established competitors such as the Weather Channel, the leading national TV source of weather information for 40 years. AccuWeather, which has supplied forecasts to consumers, media outlets and corporations since 1962 and has ramped up its own cable channel, recently launched a video streaming service called AccuWeather Now. Colorado-based WeatherNation also supplies forecasts to TV stations and cable systems throughout the U.S.\nSharri Berg, a 25-year veteran of Fox News who is overseeing the new venture, said the Fox Weather service will deliver accurate information to users and treat climate change as a reality.\n“Climate change is part of the way we all live now,” Berg said in a recent interview at Fox News headquarters in Manhattan. “We won’t be debating it. We’re going to cover it with science and facts and data. I have zero oversight for Fox News prime time and they have zero oversight over Fox Weather.”\nAmy Freeze, a veteran meteorologist who joined Fox Weather from the Walt Disney Co.’s WABC-TV in New York, fried an egg on a sidewalk in Newark in 2011 when the area had its hottest day on record. She also covered the two biggest blizzards in New York City history.\nExplaining the science behind such extreme weather events has become part of the job. “It’s something we should be talking about, whether it’s getting warmer colder, wetter, drier,” said Freeze. “All of those things encompass what we’re doing every day.”\nBerg said she has already assigned a meteorologist to cover the 2021 U.N. Climate Change Conference in Glasgow this month. “We will have a team who will listen and learn and report,” she said.\nBill Hague, executive vice president of the research firm Magid, said Fox Weather will have no choice but to play it straight if it wants to be a viable competitor, even in an age where advocacy and opinion have seeped into TV news.\n“With the weather, you’ve got to be right,” Hague said. “It’s an area where consumers don’t mess around.”\nPolarizing politics are making topical talk shows a rough ride for contrarian voices.\nFox News Media Chief Executive Suzanne Scott pushed the idea of a weather service as part of the company’s effort to expand its brand name and tap revenue streams beyond cable television. While the Fox News Channel continues to generate robust profits, the pay-TV universe that provides the bulk of its revenue is on a slow but steady decline.\nThe company has put its name on a streaming service, Fox Nation, which offers lifestyle and entertainment programming that appeals to its news audience, and according to analyst estimates now has more than 1 million paid subscribers. Fox News also launched a book publishing imprint in November that has turned out two bestsellers, including anchor Shannon Bream’s “The Women of the Bible Speak,” which has sold more than 500,000 copies.\nFor Fox Weather, the company hired a staff of 100 people, 40 of whom are accredited meteorologists. Along with Freeze, who started her career at KTLA in Los Angeles, the company recruited Nick Kosir, known as the Dancing Weatherman, a Charlotte, N.C., meteorologist whose TikTok routines have accrued 2.5 million followers.\nFox Weather will also draw on the meteorologists at the 18 Fox television stations, including KTTV in Los Angeles, enabling the service to go deeper on regional and local weather events when necessary. The set, which can accommodate up to 10 meteorologists at a time, will alter its lighting to reflect current conditions, with orange and blue hues for clear skies during the day or red to signify a weather emergency.\nWhile Fox Weather will have a video stream that looks like the forecasts viewers are used to seeing on TV newscasts, the service’s app is offering innovations aimed at attracting younger consumers.\nFox has acquired Weather Lab, an Austin, Texas-based firm that developed a 3-D radar map that gives app users the ability to scan across the country for conditions on their mobile devices. The app can also be personalized to track long-range forecasts for up to 10 different dates and locations.\n“My 16 year-old daughter will use this,” said Berg, citing a demographic group that does not typically watch TV news or weather.\nStarting in January, viewers will also be able to watch Fox Weather for free on digital over-the-air channels in the cities where the Fox Corp. owns TV stations.\nThe TV journalist unearths a family secret and finds forgiveness through his new memoir.\nFox Weather will attempt to pull audiences away from the Weather Channel, now owned by Byron Allen’s Entertainment Studios. However, the company is not sitting by idly as Fox News Media encroaches on its turf.\nNext year, the Weather Channel will launch a direct-to-consumer streaming product, Weather Channel +, where consumers without a pay TV subscription can get the service’s live forecasts and programming for $4.99 a month.\nLater in 2022, the company is rolling out Weather Channel en Español, a full-time Spanish-language service that will be available for streaming and on over-the-air digital channels throughout the country.\nAllen, whose firm acquired the Weather Channel and its digital assets, including Weather.com, for a reported $300 million, said he welcomes the arrival of Fox Weather. He believes it will generate more attention for his outlets.\n“I bought the Weather Channel in March 2018, and you guys barely wrote about it,” Allen said. “Rupert Murdoch launches a weather network, and I’ve been doing back-to-back interviews over the last couple of days. I love the competition. There is no Muhammad Ali without George Foreman. The weather news and information business is more essential than ever. So it would have been disappointing if he didn’t do it. I think they are going to do a great job.”\nThe Weather Channel has upped its coverage and discussion of climate change in recent years. Allen won’t speculate on how Fox will approach the issue, but he believes it’s unlikely that any weather news service could convince the audience that the problem isn’t severe.\n“Our bosses, the viewers, are going to have their own ideas,” Allen said. “What are you going to say to the viewers in New York City who saw their cars floating down the street?”"
    },
    {
      "url": "https://www.latimes.com/business/story/2025-08-13/here-are-the-evs-you-can-buy-for-35-thousand-or-less",
      "text": "Here are the EVs you can buy for less than $35,000\n- Share via\nAs steep tariffs threaten to drive up car prices and an incentive for buying electric vehicles nears its expiration date, electric vehicles and plug-in hybrids are becoming harder to afford.\nFor those looking to make the switch to electric on a budget, there are just a few low-cost options. Here’s a look at those available for under $35,000.\nIn the second quarter, 703 high-speed public charging stations opened in the U.S., close to the record. Chargers are showing up even in very rural areas.\nNissan Leaf\nThe 2025 Nissan Leaf starts at $28,140, according to the company website. The four-door compact sport-utility vehicle has a range of 212 miles and tops the list of the most affordable all-electric cars available in the U.S.\nThe Leaf, which originally hit roads in 2010, was the first mass-market electric vehicle, according to Nissan. It helped spur global interest in EVs and was the top-selling plug-in electric car until 2020, when it was surpassed by the Tesla Model 3.\nAccording to the auto industry site Edmunds, a major disadvantage of the Leaf is its charging port, which is not compatible with many public chargers. Known as a CHAdeMO, the technology was once more common but is being phased out.\nEdmunds also criticizes the Leaf for its small storage capacity and limited range, but lists comfort and a quiet ride as part of the car’s appeal. Nissan also sells the Ariya, an electric crossover SUV with a range of 289 miles and a starting price around $39,000.\nHyundai Kona Electric\nThe 2025 Kona Electric has a manufacturer’s suggested retail price of $32,975. The SUV has a range of 261 miles and can charge from 10% to 80% in as little as 43 minutes with a direct current fast charger.\nThat’s slower than some of its rivals, according to Edmunds, which also cites the Kona for “lackluster” handling. The vehicle is easy to drive and park, however, and is a good value for its price, the site’s reviewer said.\nHyundai has been working on all-electric vehicles since 1991, when the automaker developed the Sonata Electric Vehicle for testing. Its first commercially available EV was the Hyundai BlueOn, in 2010.\nChevrolet Equinox EV\nThe 2025 Equinox EV starts at $33,600, according to Chevrolet’s website. It has a 319-mile range and touts itself as “America’s most affordable 315+ mile range EV.”\nThe Chevrolet Blazer, another EV option from the American manufacturer, is one of this year’s top-selling EVs. At Camino Real Chevrolet in Monterey Park, electric vehicles make up about 20% of sales, according to dealership President Robb Hernandez.\nEdmunds rated the Equinox EV a 7.5 out of 10 for performance, 8.5 out of 10 for comfort and a 10 out of 10 for range and efficiency. The car has more than 15 safety and driver assistance features.\nToyota Prius Plug-in Hybrid\nThe 2025 Prius Plug-in Hybrid is priced at $33,375 and has 44 miles of battery power. After that, the car switches to gasoline.\nThe Prius Plug-in Hybrid is a particularly good value for drivers who don’t go more than 40 miles in one day and can charge frequently, said iSeeCars.com analyst Karl Brauer. Drivers without a home charger would have to navigate the public network, which can have long wait times. Imperfect charging infrastructure is a deterrent for some considering the switch to electric, Brauer said.\nToyota has revamped its Prius model, which once had a bad reputation for its appearance and low power. The Prius Plug-in has 220 horsepower and can accelerate from zero to 60 mph in less than 7 seconds.\nEdmunds rated the Prius Plug-in Hybrid an 8.5 out of 10 for performance, 7.5 out of 10 for comfort and a 9.5 out of 10 for fuel economy.\nKia Niro Plug-in Hybrid\nThe 2025 Niro Plug-in Hybrid has an all-electric range of 33 miles and a starting price of $34,490. It is one of Kia’s three plug-in hybrid options, which also include the Sportage and the Sorento.\nAccording to Edmunds, the Niro Plug-in Hybrid has impressive fuel economy and stylish interior design, but lacks all-wheel drive. Edmunds rated the model an 8 out of 10 for performance, an 8.5 out of 10 for comfort and a 8.5 out of 10 for technology.\nKia debuted its first EV for the commercial market in 2015 with the release of the electric Kia Soul.\nAre more options coming?\nThe price of an EV is a significant barrier to a more complete transition to electric vehicles in the U.S., experts said.\nThe average price of a new electric vehicle in the U.S. is $56,910, according to the latest data from Kelley Blue Book, while the average price of a gas-powered car was $49,740 in late 2024.\nDealerships are still waiting to see the full effects of new auto tariffs, which are expected to jack up the price of imported parts. Kelley Blue Book predicted overall vehicle prices could increase as much as $6,000 as a result of the tariffs.\nA $7,500 tax credit for buyers of new electric vehicles and one worth $4,000 for used EVs expire in September.\nThe higher price tag on EVs stems from expensive batteries and manufacturing. It can be pricier to insure an EV too — data collected by Insurify shows that EVs cost more than $4,000 to insure per year, 49% more than gas-powered cars. For first time EV owners, it can also cost up to $2,000 to install a home charger.\nStill, depending on where you live and the type of driving you do, it can be cheaper in the long run to own an EV. The cost of electricity is generally less than filling up at the pump, experts said.\nVehicles that burn gasoline or diesel are a major contributor to human-caused climate change, experts said, and transitioning away from fossil fuels is key to a healthy climate. Drivers hoping to reduce their reliance on gas also have the option of a plug-in hybrid, which runs on both gas and electricity.\nCar buyers will bear the brunt of the $30-billion cost of President Trump’s tariffs, driving up already high U.S. auto prices by almost $2,000 per vehicle, consultant AlixPartners said.\nChinese automaker BYD sells ultra low-priced fully electric models, but they are not available in the U.S. The BYD Seagull starts at less than the equivalent of $8,000.\n“There’s this perpetual challenge for automakers trying to price EVs competitively, at a compelling price point that average people would go and buy them,” said Brauer, the analyst. If automakers are smart, he said, “they will keep it under $30,000, because with the loss of the incentive, there’s a real psychological benefit to be able to say you’re under $30,000.”\nFord’s answer to cheap Chinese EVs is a $30,000 electric pickup truck the company hopes to launch in 2027. The automaker this week said it will invest nearly $5 billion to build the truck and develop a smaller, lighter battery.\nAside from Tesla, no other major manufacturer will meet the state’s 35% threshold for zero-emission vehicles in the 2026 model year, a trade group leader says.\nSlate Auto, a relatively new American automaker backed by Jeff Bezos, says it’s building a basic EV with a starting price between $20,000 and $30,000 before customization. The company originally advertised the vehicle at less than $20,000, but had to backtrack after President Trump eliminated a $7,500 tax credit for new electric vehicles. The incentive expires Sept. 30, and Slate says the vehicles will be available in late 2026.\nTesla analyst Dan Ives said he expects several less expensive EV models to drop in the next six months, including Tesla’s stripped down Model Y. Tesla has not confirmed the release date or price for the new Model Y.\nThe most affordable EVs already on the market usually don’t go as far on a charge as higher-priced ones, Ives said.\n“They’re still worth buying,” he said. “They’re a very good value.”"
    },
    {
      "url": "https://www.latimes.com/business/story/2025-08-01/what-can-retirees-do-to-deduct-medical-expenses",
      "text": "What can retirees do to deduct medical expenses?\n- Share via\nDear Liz: My wife and I, both in our early 90s, are fortunate to have good health insurance. However, we have significant expenses that are not covered. As you might expect, we are retired and receive income from Social Security, pensions, annuities and investments. Are we eligible to use flexible health accounts funded with pretax dollars? If so, what’s the best way to set that up and how would we pay those uncovered health bills?\nAnswer: Unfortunately, you don’t have access to pretax accounts that could help you pay medical bills.\nFlexible spending accounts are offered by employers, and contributions are limited annually (in 2025, the limit is $3,300). Health savings accounts have higher limits but require you to have a qualifying high-deductible health insurance plan. Once you’re on Medicare, as you two presumably are, you are no longer allowed to contribute to an HSA.\nYou might be able to deduct medical expenses that exceed 7.5% of your adjusted gross income. To claim the deduction, you would need to have enough itemized expenses to exceed the standard deduction, which in 2025 is $34,700 for a married couple filing jointly who are 65 and older. (The standard deduction for a married couple filing jointly is $31,500, while people 65 and older get an additional deduction of $1,600 each.)\nThere’s also a new, temporary $6,000 deduction for people 65 and older that is available whether you itemize or take the standard deduction. This bonus deduction begins to phase out for adjusted gross income above $150,000 for married couples filing jointly and disappears at AGIs above $250,000. This deduction is set to expire after the 2028 tax year.\nDear Liz: I was perplexed by your column in which you pooh-poohed pay-on-death and transfer-on-death accounts in favor of trusts. But you gave no specific explanation. Rather, you said trusts “generally allow a smoother, more organized settlement of the estate than other probate-avoidance options.” Would you please explain what is smoother and more organized than POD and TOD transfers? (Beneficiary deeds fall into the same category as POD and TOD, to my way of thinking.) These transfers simply involve a copy of the death certificate and some minimal paperwork. What could be simpler?\nAnswer: The fact that you asked this question suggests you may not be familiar with the many ways these transfers can cause unintended problems. An estate planning attorney could fill you in.\nOne issue covered previously in this column is the fact that the person settling the estate typically needs money to pay final bills. If all the funds in the estate have been transferred to beneficiaries, the executor would have to beg for money to be returned (with no guarantee beneficiaries will cooperate) or pay the expenses out of their own pocket.\nAnother obvious issue is unequal distribution if you have more than one heir. Account values can change over time, leading to sometimes dramatic differences in what the beneficiaries receive.\nSpeaking of change, it’s the one constant in life. A living trust allows you to easily update your estate plan in one centralized place as circumstances change. Altering beneficiary designations can take a lot more work, and it’s easy to miss an account if you have several.\nBeneficiary designations offer limited contingency planning. If the beneficiaries die before you or otherwise can’t inherit, the account could come back into your estate and be subject to probate. Also, many people forget to update their beneficiaries after major life changes, which can mean the wrong people inherit. More than one ex-spouse has received retirement funds or life insurance proceeds because the beneficiary form wasn’t updated.\nAnother unfortunately common occurrence is an inheritance that disqualifies a disabled beneficiary from receiving government benefits. You also can’t control how money is spent with a beneficiary designation, which can be a problem if the beneficiary is a minor, an addict or a spendthrift.\nPlus, people get sued. Beneficiary designations offer no protection against creditors, while a properly written trust can help protect your assets and your heirs’ inheritance.\nThis is by no means an exhaustive list of the potential issues with beneficiary designations. They can be a solution for people with limited funds who can’t afford to pay an estate planning attorney, or when they’re part of a coordinated estate plan. Many people set up a trust for real estate and financial accounts, for example, and use beneficiaries for retirement accounts, notes Jennifer Sawday, an estate planning attorney in Long Beach.\nThe more money you have and the more complex your situation, the more you — and your heirs — would benefit from expert, individualized advice.\nLiz Weston, Certified Financial Planner, is a personal finance columnist. Questions may be sent to her at 3940 Laurel Canyon, No. 238, Studio City, CA 91604, or by using the “Contact” form at asklizweston.com."
    },
    {
      "url": "https://www.latimes.com/entertainment-arts/business",
      "text": "News\nHome Page\nCalifornia\nElection 2024\nHousing & Homelessness\nPolitics\nScience & Medicine\nWorld & Nation\nBusiness\nArtificial Intelligence\nAutos\nJobs, Labor & Workplace\nReal Estate\nTechnology and the Internet\nCalifornia\nCalifornia Politics\nEarthquakes\nEducation\nHousing & Homelessness\nL.A. Influential\nL.A. Politics\nMental Health\nClimate & Environment\nGlobal Warming\nWater & Drought\nEntertainment & Arts\nArts\nBooks\nStand-Up Comedy\nHollywood Inc.\nThe Envelope (Awards)\nMovies\nMusic\nTelevision\nThings to Do\nDe Los\nEn Español\nFood\n101 best restaurants in L.A.\nRecipes\nImage\nArt & Culture\nConversations\nDrip Index: Event Guides\nFashion\nShopping Guides\nStyling Myself\nLifestyle\nHealth & Wellness\nHome Design\nL.A. Affairs\nPlants\nTravel & Experiences\nWeekend\nThings to Do in L.A.\nObituaries\nVoices\nEditorials\nLetters to the Editor\nContributors\nShort Docs\nSports\nAngels\nAngel City FC\nChargers\nClippers\nDodgers\nDucks\nGalaxy\nHigh School Sports\nKings\nLakers\nOlympics\nUSC\nUCLA\nRams\nSparks\nWorld & Nation\nImmigration & the Border\nIsrael-Hamas\nMexico & the Americas\nUkraine\nTimes Everywhere\n404 by L.A. Times\nFacebook\nInstagram\nLA Times Today\nNewsletters\nPhotography\nPodcasts\nShort Docs\nTikTok\nThreads\nVideo\nYouTube\nX (Twitter)\nFor Subscribers\neNewspaper\nAll Sections\n_________________\nLA Times Studios\nBusiness\n• AI & Tech\n• Banking & Finance\n• Commercial Real Estate\n• Goods & Retail\n• Healthcare & Science\n• Law\nDoctors & Scientists\nHot Property\nLive & Well\nOrange County\nThe Hub: Rebuilding LA\nTravel\nWeddings & Celebrations\nNewsletters\nLive Stream\nEvents\nScreening Series\nCrossword\nGames\nL.A. Times Store\nSubscriptions\nManage Subscription\nEZPAY\nDelivery Issue\neNewspaper\nStudents & Educators\nSubscribe\nSubscriber Terms\nGift Subscription Terms\nAbout Us\nAbout Us\nArchives\nCompany News\neNewspaper\nFor the Record\nGot a Tip?\nL.A. Times Careers\nL.A. Times Store\nL.A. Times Studios\nNews App: Apple IOS\nNews App: Google Play\nNewsroom Directory\nPublic Affairs\nRights, Clearance & Permissions\nShort Docs\nAdvertising\nClassifieds\nFind/Post Jobs\nHot Property Sections\nLocal Ads Marketplace\nL.A. Times Digital Agency\nMedia Kit: Why the L.A. Times?\nPeople on the Move\nPlace an Ad\nPlace an Open House\nSotheby’s International Realty\nSpecial Supplements\nHealthy Living\nHigher Education\nPhilanthropy\nCopyright © 2025, Los Angeles Times |\nTerms of Service\n|\nPrivacy Policy\n|\nCA Notice of Collection\n|\nDo Not Sell or Share My Personal Information\nSections\nShow Search\nSearch Query\nSubmit Search\nAdvertisement\nHollywood Inc.\nMovies\nTV\nAwards\nMusic\nHollywood Inc.\nArts\nBooks\nTheater\nMuseums & Art\nComedy\nBehold\nHero Complex\nMore\nMovies\nTV\nAwards\nMusic\nHollywood Inc.\nArts\nBooks\nTheater\nMuseums & Art\nComedy\nBehold\nHero Complex\nAdvertisement\nTop Headlines\nFox’s $20-a-month news and sports streamer launches next week. Here’s what’s on it\nFox’s news and sports content will be available to stream for $19.99 a month.\nWhy a streamer beloved by fans of British TV is turning to big U.S. stars\nAug. 14, 2025\nOver 160 Blizzard workers in Irvine join union as gaming-industry labor movement expands\nAug. 14, 2025\nDavid Ellison’s plan to rebuild Paramount: ‘Top Gun 3’ and more ‘Star Trek’\nAug. 13, 2025\n‘South Park’ is having its best ratings in years. Thank Trump and Kristi Noem spoofs\nAug. 13, 2025\nPriscilla Presley faces $50-million L.A. lawsuit from former business partner\nAug. 13, 2025\nPrince Harry and Meghan stay with Netflix — but with a lesser deal\nAug. 11, 2025\nWhat’s next for SAG-AFTRA as Fran Drescher declines to seek reelection\nAug. 11, 2025\nMore Headlines\nParamount, UFC and the biggest question for streaming sports fans\nAug. 12, 2025\nParamount lands UFC rights in $7.7-billion streaming and TV deal\nAug. 11, 2025\nWho will be late-night TV’s last man standing? Byron Allen takes his shot\nAug. 11, 2025\n‘The Mandalorian’ actor Gina Carano and Disney settle lawsuit over alleged wrongful termination\nAug. 8, 2025\nL.A. media mogul Byron Allen sells 10 TV stations to Gray Media\nAug. 8, 2025\nNew boss of Paramount grilled about rumored Trump deal\nAug. 7, 2025\nFor Subscribers\nIf anyone can make a movie now, what does Hollywood still stand for?\nAug. 7, 2025\nParamount film chief Brian Robbins exits ahead of Skydance takeover\nAug. 6, 2025\nESPN nabs streaming rights for WWE events in $1.6-billion deal\nAug. 6, 2025\nDisney’s streaming business continues to grow, despite theatrical losses\nAug. 6, 2025\nNFL takes 10% stake in Disney’s ESPN, which will take over the NFL Network\nAug. 5, 2025\nFormer CNBC pundit and fugitive sentenced to prison for bilking investors out of millions\nAug. 5, 2025\nLoad More\nMost Read\nCalifornia\nBorder Patrol agents stage show of force at Newsom’s ‘big beautiful press conference’\nCalifornia\nNewsom calls for special November election to block Trump from ‘rigging’ 2026 midterms\nCalifornia\nAs crews battle King fire near Pyramid Lake, wind-whipped Hawk fire gains strength\nCalifornia\nHomeless people in detention camps? Fears grow about Trump and the Olympics\nAug. 14, 2025\nVoices\nArellano: Can homegrown teens replace immigrant farm labor? In 1965, the U.S. tried\nAug. 14, 2025\nAdvertisement\nAdvertisement\nAdvertisement\nAdvertisement"
    },
    {
      "url": "https://www.latimes.com/entertainment-arts/business/story/2025-02-10/fox-corp-acquires-podcast-marketer-red-seat-ventures",
      "text": "Fox Corp. acquires conservative podcast marketer Red Seat Ventures\n- Share via\nFox Corp. has acquired Red Seat Ventures, a media company that specializes in right-leaning podcasts and live events.\nThe deal announced Monday is another move by Fox to expand its digital media holdings. Last week, Fox Corp. Executive Chairman Lachlan Murdoch told Wall Street analysts that the company will launch a sports- and news-oriented streaming service this year.\nRed Seat provides ad sales, marketing and production support for digital content creators, many of them aimed at politically conservative audiences. The company said the 17 podcasts it services reached 200 million users in November 2024.\nThe deal means Fox will own the New York company that services digital programs created by Tucker Carlson, Eric Bolling, Bill O’Reilly and Megyn Kelly, all of whom were once part of the talent roster at Fox News.\nRed Seat has no editorial control over the programs it services and neither will Fox. Terms of the deal were not disclosed.\nA major pivot to digital is coming. But will consumers value the CNN brand enough to pay for it online?\nRed Seat will continue to operate as a standalone entity operated by its founding partners, Chris Balfe and Kevin Balfe. They will report to Fox’s Tubi Media Group, led by Paul Cheesbrough.\n“The creator economy is one of the fastest growing media categories worldwide by measure of reach and influence, and consumers are increasingly looking to get their information, insights and entertainment directly from the voices and brands they trust across these platforms,” Cheesbrough said in a statement.\nOther former cable and network talent who are Red Seat clients include Chris Hansen, an investigative journalist made famous by his “To Catch a Predator” franchise on NBC’s “Dateline,” and true-crime analyst Nancy Grace.\nRed Seat also owns CrimeCon, a major fan convention for true-crime enthusiasts."
    },
    {
      "url": "https://www.latimes.com/entertainment-arts/business/story/2025-02-10/super-bowl-lix-scores-126-million-viewers-despite-blowout",
      "text": "Super Bowl LIX scores a record 127.7 million viewers despite blowout\n- Share via\nThe Super Bowl may have developed immunity against a terrible game.\nAn average of 127.7 million viewers watched Sunday‘s Fox telecast of the Philadelphia Eagles’ 40-22 drubbing of the Kansas City Chiefs in Super Bowl LIX, setting a new record based on data from Nielsen, Adobe Analytics and the streaming service Tubi.\nThe figure is up 3% from last year’s record of 123.7 million viewers who watched the Chiefs’ 25-22 win over the San Francisco 49ers on CBS.\nFox said an average of 13.6 million viewers watched the game on Tubi, the free ad-supported streaming platform owned by parent company Fox Corp., which carried the event for the first time. An additional 900,000 watched on the NFL’s streaming app. The combination made it the most streamed Super Bowl ever.\nSpanish-language networks Telemundo and Fox Deportes brought in an additional 1.9 million viewers.\nThe addition of Tubi as an option likely brought in casual fans and the growing number of consumers who watch video only on digital devices without cable or a TV antenna. Tubi has about 97 million active users as of January.\nIn addition to the TV commercials that went for as much as $8 million for a 30-second spot, Fox sold spots placed exclusively on Tubi at around $2 million each, according to AdAge. The Tubi audience far exceeded the 8.5 million viewers projected by Fox.\nAdvertisers paid as much as $8 million for a commercial on the Big Game that keeps getting bigger.\nLast year’s Super Bowl was streamed on Paramount+ and the NFL streaming app, both of which require a subscription.\nThe Super Bowl has regularly topped 100 million viewers since 2009 and fluctuated based on the competitiveness of the game. But that may no longer matter as the event has evolved into a national viewing holiday available on an array of free platforms.\nThe showdown at Caesar’s Superdome in New Orleans peaked at 137.7 million viewers between 8 and 8:15 p.m. Eastern time. With the Eagles leading the Chiefs 24-0 going into the third quarter, viewing dropped off but was still strong enough to set a record for the entire game.\nSuper Bowl LIX had the ingredients of another ratings record-setter, with Taylor Swift to cheer on boyfriend Travis Kelce, the Chiefs’ star tight end. President Trump heightened the anticipation by being the first sitting commander-in-chief to attend a Super Bowl.\nThe lopsided outcome of Sunday’s contest was reminiscent of the run of terrible Super Bowl matchups of the mid-1980s, when there were five consecutive blowouts decided by 19 points or more.\nViewers surveyed in USA Today’s annual Super Bowl Ad Meter chose a Budweiser commercial featuring the beer brand’s iconic Clydesdale horses as their favorite.\nThe halftime show featuring Pulitzer Prize-winning hip-hop artist Kendrick Lamar was polarizing on social media, but provided the liveliest conversation of the night amid the Chiefs’ dismal performance on the field. It was also the most-watched halftime show ever with 133.5 million viewers, up 3% over last year’s performance by Usher."
    },
    {
      "url": "https://www.latimes.com/business/story/2025-08-13/californias-burger-wars-heat-up-as-the-habit-burger-grill-escalates-billboard-battle-with-in-n-out",
      "text": "California’s burger wars heat up as Habit Burger & Grill trolls In-N-Out with new billboard\n- Share via\nHabit Burger & Grill has doubled down on its provocative marketing strategy, updating its billboard trolling of burger giant In-N-Out for a second consecutive year after once again beating the chain in a national ranking.\nHabit has updated its existing billboard near Los Angeles International Airport, directly across from an In-N-Out location on Sepulveda Boulevard, to reflect its rival’s drop to fourth place in USA Today’s 10 Best fast-food burger rankings. The same sign from last year has been recycled, with the “#2” crossed out in red and replaced with “#4.”\nIn-N-Out CEO Lynsi Snyder moves her family east to Tennessee, citing California’s difficult environment for raising kids and business operations.\nThe company — which took first place for the best fast-food burger (the Double Char) — also earned top rankings from USA Today for best fast casual restaurant and best fast-food side dish for its tempura green beans.\n“We congratulated In-N-Out on being #2 last year with a billboard,” Jack Hinchliffe, chief marketing officer at Habit, said in a press release. “This year, we were going to send a gift but couldn’t afford the postage to Tennessee, so we saved a few bucks and reused the same billboard. We just had to swap out the 2 for a 4.”\nThe Tennessee reference is a pointed jab at In-N-Out’s eastward expansion. In January 2023, the company announced plans to establish an Eastern territory office in Franklin, Tenn., by 2026. Last month, billionaire owner and Chief Executive Lynsi Snyder announced on a conservative podcast that she is personally leaving California for Tennessee.\n“There’s a lot of great things about California, but raising a family is not easy here. Doing business is not easy here,” Snyder said during her appearance on a conservative podcast. She specifically cited COVID-19 pandemic-era restrictions as particularly challenging for business operations.\nSnyder’s departure represents a seismic shift for the leader of a brand that has been a pillar of California fast-food culture for more than 75 years.\nThe move places In-N-Out among a growing list of major companies relocating from California, including electric car maker Tesla, financial services firm Charles Schwab, and oil giant Chevron, all citing regulatory challenges, operational costs and policy disagreements.\nDespite a growing narrative that California is hostile to businesses, experts say the state still has unmatched advantages.\nThe timing of Habit’s latest marketing gambit coincides with In-N-Out’s continued decline in the annual USA Today rankings. In-N-Out ranked sixth in 2023, second in 2024, and fourth this year.\nUSA Today’s 10 Best contests rely on expert panels to select nominees, followed by public voting to determine winners. While not scientific, the rankings have gained attention among consumers.\nThe billboard campaign represents an asymmetric marketing battle between two companies of vastly different sizes. In-N-Out operates more than 400 locations across eight states, while Habit has more than 385 restaurants across 14 states and international markets since opening its first location in Santa Barbara in 1969.\n“We were born in Santa Barbara in 1969, remain proudly Californian and we’re not going anywhere,” Hinchliffe said.\nBoth chains maintain their headquarters in Irvine, located about seven miles apart, though In-N-Out plans to consolidate its California operations in Baldwin Park, where Harry Snyder, Lynsi Snyder’s grandfather, co-founded the company in 1948.\nThe In-N-Out billboard is part of a broader campaign by Habit targeting multiple competitors. The company has deployed mobile billboards to locations near other chains that made the USA Today rankings, including Chipotle, Five Guys, Shake Shack and Panera Bread, offering congratulatory messages on their lower rankings.\nIn-N-Out did not respond to a request for comment."
    }
  ],
  "argos_summary": "Fox Corp. is launching a new streaming service, Fox One, on August 21, aimed at sports and news enthusiasts, priced at $19.99 per month. The service will provide access to local Fox affiliates, sports channels, and Fox News, targeting the growing number of cord-cutters. Additionally, Fox's ad-supported platform Tubi is experiencing significant growth, outperforming competitors in viewership, while the company also invests in a new weather service, Fox Weather, to expand its digital media presence.",
  "argos_id": "3RWIENECM"
}