{
  "url": "https://www.morningstar.com/news/pr-newswire/20250814cg50452/jane-doe-100-files-suit-against-obgyn-mark-mulholland-providence-st-joseph-health-and-kadlec-regional-medical-center-alleging-sexual-abuse-and-decades-of-ignored-patient-complaints",
  "authorsByline": "",
  "articleId": "196d971accc34b6a87b473489e51d577",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T20:11:00-05:00",
  "addDate": "2025-08-15T01:55:06.294926+00:00",
  "refreshDate": "2025-08-15T01:55:06.294930+00:00",
  "score": 1.0,
  "title": "Jane Doe 100 files suit against OBGYN Mark Mulholland, Providence St. Joseph Health and Kadlec Regional Medical Center, alleging sexual abuse and decades of ignored patient complaints",
  "description": "",
  "content": "SEATTLE, Aug. 14, 2025 /PRNewswire/ -- Jane Doe 100 has filed suit in King County Superior Court, alleging she was physically and sexually abused by Tri-Cities OBGYN Mark E. Mulholland. Jane Doe 100 is represented by attorneys Tamara Holder, of Tamara Holder Law, and Elizabeth Hanley, of Schroeter Goldmark Bender.\n\nJane Doe 100 alleges she visited Mulholland at Providence St. Joseph Health and Kadlec Regional Medical Center, in Richland, Washington, in August 2022, and that during the appointment, Mulholland performed a gloveless \"exam;\" was aggressive and caused her pain; complimented the appearance of her private parts; and he asked if she was single.\n\nJane Doe 100 further alleges that, since as early as 2003, defendants received numerous patient complaints about Mulholland both before and after her appointment in August 2022. Additionally, in April 2025, the Washington Department of Public Health filed a formal complaint against Mulholland for \"abuse\" and \"unprofessional conduct\" on behalf of three patients.\n\nHolder and Hanley currently represent over 150 female patients.\n\n\"As a Kamiakin High School graduate, just like Mulholland, I am devastated to learn that, not only did he allegedly abuse so many trusting female patients, but that one of the few medical centers in the area lured women to him, only for them to be violently abused, and then the women were ignored when they complained. We are devoted to not only obtaining justice for our clients but also to exposing how Providence and Kadlec profited off of Mulholland's alleged sex crimes and abuses of his position of trust and power,\" said Holder.\n\n\"Mulholland's actions represent a horrifying betrayal of trust—and the healthcare institutions that enabled his abuse must also be held accountable. To the survivors who were ignored, dismissed, or silenced: Your courage in coming forward will bring justice for Mulholland's abuse, and will protect others from ever enduring this kind of violation again,\" Hanley added.\n\nJane Doe 100 accuses the defendants of sex-based discrimination, failure to protect patients, and institutional negligence. Case No. 25-2-22557-7KNT\n\nHolder spearheaded the multi- plaintiff litigation against Chicago-area OBGYN and convicted sex offender Fabio Ortega. Hanley regularly represents survivors in sexual assault and discrimination cases, notably against powerful entities that fail to prevent systemic abuse.",
  "medium": "Article",
  "links": [
    "https://www.prnewswire.com/news-releases/jane-doe-100-files-suit-against-obgyn-mark-mulholland-providence-st-joseph-health-and-kadlec-regional-medical-center-alleging-sexual-abuse-and-decades-of-ignored-patient-complaints-302530742.html",
    "https://c212.net/c/link/?t=0&l=en&o=4487428-1&h=3031499404&u=http%3A%2F%2Ftamaraholderlaw.com%2F&a=Tamara+Holder",
    "https://mma.prnewswire.com/media/2751176/Picture1.html",
    "https://mma.prnewswire.com/media/2749497/Screenshot_2025_08_07_at_6_31_19_PM.html",
    "https://c212.net/c/link/?t=0&l=en&o=4487428-1&h=760582266&u=https%3A%2F%2Fsgb-law.com%2Four-team%2Felizabeth-hanley&a=Elizabeth+Hanley"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "OBGYN Mark Mulholland",
      "weight": 0.1021181
    },
    {
      "name": "Mark Mulholland",
      "weight": 0.09694119
    },
    {
      "name": "Mark E. Mulholland",
      "weight": 0.0927786
    },
    {
      "name": "Mulholland",
      "weight": 0.0925296
    },
    {
      "name": "Tri-Cities OBGYN Mark E. Mulholland",
      "weight": 0.09020843
    },
    {
      "name": "ignored patient complaints",
      "weight": 0.08831241
    },
    {
      "name": "sexual abuse",
      "weight": 0.08655937
    },
    {
      "name": "numerous patient complaints",
      "weight": 0.08226076
    },
    {
      "name": "systemic abuse",
      "weight": 0.08005033
    },
    {
      "name": "Providence St. Joseph Health",
      "weight": 0.07886148
    }
  ],
  "topics": [
    {
      "name": "Sexual Exploitation"
    },
    {
      "name": "Crime"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.9404296875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.93115234375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.7451171875
    },
    {
      "name": "/Health/Medical Facilities & Services/Hospitals & Treatment Centers",
      "score": 0.7431640625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.6630859375
    },
    {
      "name": "/Health/Medical Facilities & Services/Other",
      "score": 0.583984375
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.529296875
    },
    {
      "name": "/News/Other",
      "score": 0.521484375
    }
  ],
  "sentiment": {
    "positive": 0.061281048,
    "negative": 0.7281946,
    "neutral": 0.2105244
  },
  "summary": "Jane Doe 100 has filed a lawsuit against OBGYN Mark Mulholland, Providence St. Joseph Health and Kadlec Regional Medical Center in King County Superior Court, alleging sexual abuse and decades of ignored patient complaints. The suit alleges that Mulhollenand performed a gloveless \"exam;\" was aggressive and caused her pain, complimented her private parts, and asked if she was single. Since as early as 2003, defendants received numerous patient complaints about Mulhollyand. Additionally, the Washington Department of Public Health filed a formal complaint against Mulholand for \"abuse\" and \"unprofessional conduct\" on behalf of three patients. The lawsuit accuses the defendants of sex-based discrimination, failure to protect patients, and institutional negligence.",
  "shortSummary": "Jane Doe 100 has sued OBGYN Mark Mulholland and Providence St. Joseph Health and Kadlec Regional Medical Center for sexual abuse and neglect, alleging multiple patient complaints.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "ce326e0db4334752b949e15cd8144049",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.prnewswire.com/news-releases/jane-doe-100-files-suit-against-obgyn-mark-mulholland-providence-st-joseph-health-and-kadlec-regional-medical-center-alleging-sexual-abuse-and-decades-of-ignored-patient-complaints-302530742.html",
      "text": "Jane Doe 100 files suit against OBGYN Mark Mulholland, Providence St. Joseph Health and Kadlec Regional Medical Center, alleging sexual abuse and decades of ignored patient complaints\nSEATTLE, Aug. 14, 2025 /PRNewswire/ -- Jane Doe 100 has filed suit in King County Superior Court, alleging she was physically and sexually abused by Tri-Cities OBGYN Mark E. Mulholland. Jane Doe 100 is represented by attorneys Tamara Holder, of Tamara Holder Law, and Elizabeth Hanley, of Schroeter Goldmark Bender.\nJane Doe 100 alleges she visited Mulholland at Providence St. Joseph Health and Kadlec Regional Medical Center, in Richland, Washington, in August 2022, and that during the appointment, Mulholland performed a gloveless \"exam;\" was aggressive and caused her pain; complimented the appearance of her private parts; and he asked if she was single.\nJane Doe 100 further alleges that, since as early as 2003, defendants received numerous patient complaints about Mulholland both before and after her appointment in August 2022. Additionally, in April 2025, the Washington Department of Public Health filed a formal complaint against Mulholland for \"abuse\" and \"unprofessional conduct\" on behalf of three patients.\nHolder and Hanley currently represent over 150 female patients.\n\"As a Kamiakin High School graduate, just like Mulholland, I am devastated to learn that, not only did he allegedly abuse so many trusting female patients, but that one of the few medical centers in the area lured women to him, only for them to be violently abused, and then the women were ignored when they complained. We are devoted to not only obtaining justice for our clients but also to exposing how Providence and Kadlec profited off of Mulholland's alleged sex crimes and abuses of his position of trust and power,\" said Holder.\n\"Mulholland's actions represent a horrifying betrayal of trust—and the healthcare institutions that enabled his abuse must also be held accountable. To the survivors who were ignored, dismissed, or silenced: Your courage in coming forward will bring justice for Mulholland's abuse, and will protect others from ever enduring this kind of violation again,\" Hanley added.\nJane Doe 100 accuses the defendants of sex-based discrimination, failure to protect patients, and institutional negligence. Case No. 25-2-22557-7KNT\nHolder spearheaded the multi- plaintiff litigation against Chicago-area OBGYN and convicted sex offender Fabio Ortega. Hanley regularly represents survivors in sexual assault and discrimination cases, notably against powerful entities that fail to prevent systemic abuse.\n[email protected], (312) 440-9000\nSOURCE The Law Firm of Tamara N. Holder, LLC\nWANT YOUR COMPANY'S NEWS FEATURED ON PRNEWSWIRE.COM?\nNewsrooms &\nInfluencers\nDigital Media\nOutlets\nJournalists\nOpted In\nShare this article"
    },
    {
      "url": "https://c212.net/c/link/?t=0&l=en&o=4487428-1&h=760582266&u=https%3A%2F%2Fsgb-law.com%2Four-team%2Felizabeth-hanley&a=Elizabeth+Hanley",
      "text": "Elizabeth Hanley is an experienced plaintiffs’ attorney and shareholder at Schroeter Goldmark & Bender in Seattle, where her work continues the firm’s 55-year tradition of advocating for those who have been harmed.\nIn her practice, Ms. Hanley represents individuals who have been wrongfully terminated or discriminated against; individuals who have suffered wrongful death or serious personal injury; employees who have been subjected to wage and hour violations individually or on a class-wide basis; and labor unions.\nIn the courtroom, Hanley is known for her ability to connect with juries, often by distilling complex information in ways that develop trust and effectively conveys what’s at stake and why it matters. Her trial preparation regularly leads to favorable outcomes for her clients, including many cases she has tried to verdict in Washington’s federal and state courts.\nBeyond the courtroom, Hanley plays an active role in shaping the law itself. Her legislative work is a natural extension of her passion for advocacy which is rooted in her belief that justice shouldn't depend on outdated or unjust laws.\nShe has been recognized as a Top 100 Trial Lawyer by the National Trial Lawyers each year since 2013. Additionally, she has been recognized by Washington Super Lawyers every year since 2017, as a Top 50 Woman Attorney by Washington Super Lawyers and by The Best Lawyers of America since 2021.\nShe serves by appointment to the Washington Supreme Court to the Washington Pattern Jury Instructions Committee. She is also presently the president of Washington State Association of Justice for the 2024-25 term.\nHanley earned a BA at Gonzaga University, and during her undergraduate years studied British Literature at Trinity College, Oxford University. She earned a JD from University of San Diego School of Law. Prior to becoming an attorney, she served as lead articles editor of the San Diego International Law Journal. She also represented taxpayers in disputes with the IRS at the University of San Diego School of Law Tax Clinic, and received honors in trial advocacy.\nHanley grew up in Montana, where she developed a competitive spirit and determination as the oldest of five siblings. Outside of her legal practice, she enjoys the challenge of endurance sports and is often found training for a triathlon or climbing one of the Pacific Northwest region’s peaks. In fact, she has summited many iconic peaks in the Northwest, including Mt. Rainier in 2023.\nHanley has two accomplished daughters who share her passion for advocacy and helping others.\n- $5,800,000 settlement of wage and hour class action in Carlson v. Home Depot\n- $3,260,000 jury verdict on disability discrimination claim\n- $8,000,000 settlement of personal injury claims and wrongful death from auto crash\n- $2,800,000 settlement for sex assault victim\n- $2,300,000 settlement for disability discrimination claims by employee\n- $1,750,000 settlement for race and gender discrimination claims by employee\n- $670,000 settlement of personal injury claims from auto crash\n- $680,000 in jury verdicts and judgments for wage and hour claims by two employees\n- $1,750,000 settlement of wage and hour class action in Hudson v. Oatridge Sec. Grp., Inc., et al.\n- $760,000 settlement of retaliation and failure to accommodate disability claims for employee\n- $1,500,000 settlement of personal injury claims by pedestrian hit by auto\n- $375,000 settlement of pregnancy discrimination claim\n- $1,100,000 settlement of sexual harassment and retaliation claims by employee\n- $1.95 million settlement of wage and hour class action in\nRogers, et al. v. Recovery Centers of King County - $1.75 million settlement of wage and hour class action,\nTolliver, et al. v. Avvo - $650,000 jury verdict for employee retaliated against for opposing national origin discrimination\n- $660,000 in judgments/awards for employee who experienced disability discrimination\n- $2.3 million settlement of wrongful discharge in violation of public policy, settlement for healthcare provider reporting safety violations\n- $700,000 settlement of employee’s age discrimination claim\n- $330,000 settlement of claims by employee who was sexually harassed by her co-worker\n- $750,000 settlement of wage and hour class action in\nKariuki v. Pacific Bells, LLC, et al. - $1 million settlement for client who was injured as a result of medical malpractice\n- $500,000 settlement for employee who was sexually harassed by her co-worker\nEducation\n- University of San Diego School of Law, J.D., 2006\n- Gonzaga University, B.A., Honors Program 2002\nAdmissions\n- Washington State\n- United States Supreme Court\n- U.S. District Court, Western District of Washington\n- U.S. District Court, Eastern District of Washington\n- U.S. Ninth Circuit Court of appeals\n- Washington Courts, Washington Pattern Instruction Committee (2018 to Present)\n- Holy Names Academy, Development Committee (2018 to Present)\n- Washington State Association for Justice, President (2024-2025)\n- Washington State Association for Justice, Board of Governors (2017- Present)\n- Justice for All PAC, Co-Treasurer (2017 - Present)\n- Justice for All PAC, Board Member (2015- Present)\n- Washington State Association for Justice, Legislative Steering Committee (2013 - Present)\n- Lawyers Helping Hungry Children, Board (2006 - Present)\n- Washington State Bar Association, Rules Committee (2014 - 2016)\n- Washington State Association of Justice, Chair Employment Law Section (2014 - 2016)\n- Washington State Bar Association, MCLE Task Force (2013 - 2015)\nProfessional Recognition\n- Elizabeth Hanley was included in the 2021 Edition of The Best Lawyers in America© for Personal Injury Litigation.\n- Selected to Washington Super Lawyers by Super Lawyers® (2017 - 2025)\n- Named to the Irish Legal 100 (2024)\n- Selected to Washington Rising Stars by Super Lawyers® (2010 & 2012, 2014 - 2016)\nPublications\n- “The Amendments to the Federal Rules of Discovery: The Effect on the Employment Case,” Trial News, Vol. 52-1\n- “Evidentiary Issues,” Washington Employment Law Desk Book, published 2013\n- “Ashcroft v. Iqbal’s Limited Application to Employment Discrimination Claims,” American Association for Justice Employment Rights Quarterly\n- “Evidentiary Issues,” Washington Employment Law Desk Book, published 2017\n- “Employment Law,” Washington Civil Rights Law Desk Book, published 2017\nSpeaking Engagements\n- \"Ethical Issues That Arise in Employment Cases,\" WSBA Ethics in Civil Litigation Seminar, Washington State Bar Association, 2019\n- \"When Cancer Comes to Work: Navigating Employment Law Issues,\" Cancer Pathways, 2019.\n- \"#MeToo Lawyering,\" Annual CLE, Federal Bar Association, Western District of Washington 2018\n- \"When Cancer Comes to Work: Navigating Employment Law Issues,\" Cancer Pathways, 2018.\n- \"Protecting the Problem Plaintiff,\" Washington Employment Lawyers Association, Annual Conference, 2018.\n- \"Discovery Sanctions,\" WSAJ Pierce County RoundTable, 2018.\n- \"When Cancer Comes to Work: Navigating Employment Law Issues,\" Cancer Pathways, 2017\n- Speaker and CLE Co-Chair, \"Employment Law CLE – Tips, Tactics, Trends and Desk Book Update,\" 2017\n- \"Social Media Admissions in Litigation,\" WSAJ, 2017\n- \"When Cancer Comes to Work: Navigating Employment Law Issues,\" Cancer Pathways, 2016\n- \"Trial In Action: Voir Dire,\" WSAJ, 2016\n- \"What All Trial Lawyers Need to Know,\" Washington State Association for Justice, (“WSAJ”), 38th Annual Insurance Law Seminar, Employment Practices Insurance, 2016\n- \"Exempt or Non-Exempt: That is the Question,\" WSAJ, The Business of Practicing Law, 2015\n- \"Attorney Fee Awards Update Under Washington’s Wage Statute,\" WSAJ, 2015\n- \"Proving From Beginning to End: Anatomy of a Recent Victory,\" Washington Employment Lawyers Association (“WELA”), Annual Conference, 2015\n- \"Americans with Disabilities Act: 25th Anniversary,\" WSAJ, 2015\n- Moderator, Judicial Panel, WELA Annual Seminar, 2014\n- \"Employment Law for Plaintiff’s Attorneys: WLAD and Title VII,\" WELA Annual Conference, 2013\n- \"Your Case Has Been Removed to Federal Court: Now What?\" WSAJ Automobile Cases Seminar, 2011\n- \"Getting Out of Arbitration- What You Don’t Know: Thinking Outside the Box in Employment Law,\" 2011\n- \"Securing a Jury Trial: Defeating Arbitration Agreements,\" WELA, 2011\n- \"Legal Issues for Freelance Editors,\" Writers Guild, 2011\n- \"Spoliation of Evidence in the Employment Case,\" Luvera Seminar, WSAJ, 2011\n- \"Avoiding Dismissal After the Iqbal Case,\" WELA, 2010\n- \"Balancing the Practice of Law with Parenting,\" UW Law School, 2010\n- \"Getting Evidence Into the Computer & Beyond,\" WSAJ, 2009\nI met with Elizabeth in November 2019. I had been recently let go from my dental job shortly after being diagnosed with stage 4 breast cancer. I had worked in the dental field for 35 years and was 61 years old. I had received an email from my former employers letting me know that I was no longer employed at their dental practice. You can only imagine the panic I felt not to mention the deep betrayal from a group of doctors that I thought were supporting me during my battle. In my consultation, I knew immediately that Elizabeth would be the attorney to represent me. Her professionalism was above and beyond what would be expected from an attorney of her caliber. However, it was her unwavering compassion and fierceness that let me know she would fight to the end to right the wrong that had been undeservedly done to me. Elizabeth put me at ease and let me know that under no circumstance was this appropriate behavior and totally unacceptable, that having a disability I had rights and they had disregarded these rights. There was absolutely no reason to warrant tossing me aside as if I didn't matter or assuming that I would not be able to continue doing my job to the fullest extent. Or the fact that I was a person who worked hard for them every day and took pride in my position. I represented their practice with integrity and made sure that my treatment of our patients and fellow team members was always with upmost respect. After all we are in healthcare and that's what we do, take care of our patients. They didn't even take into consideration that they fired me during breast cancer awareness month. Elizabeth stood by my side and empowered me to stand up and let my former employers know that I matter and no one deserves to be treated this way! So, together we walked through this battle to defend my personhood and send the message that you cant treat me this way. Due to Covid and multiple delays on their end this walk together went nearly 4 years. Elizabeth kept in contact with me at all times. She kept me updated when even the smallest of information came to her. Elizabeth checked in on me on a regular basis and wanted to know how I was doing and how my treatment was going. Making sure if I needed anything to help me during my fight. She expressed her concerns that I was taking care of myself and celebrated with me as I continued to beat this. Elizabeth always made sure that I knew she was there for me and if I needed anything she would help me in anyway she could. She encouraged me as I went through this journey and on many occasions she let me know how proud she was of me as I faced many challenges. My former employers were not willing to settle out of court because they felt they had done nothing wrong and the jury would side with them. So off to court we went. Another amazing attorney from SGB Joe Solseng joined forces along with an impressive support team. All I can say is they should have settled out of court. It was impressive beyond to have this legal team show them that you are not allowed to treat an employee this way. After a long 8 day trial, the jury deliberated for a mere 90 minutes. They awarded me handsomely, way beyond my wildest dreams. I was vindicated and the message was sent loud and clear. This was unacceptable and you simply can not treat your employees this way. If you are in need of legal representation, you will be hard pressed to find a better attorney along with an extremely impressive group of individuals, than Elizabeth Hanley and her legal team at SGB. Thank you Elizabeth, your dedication has meant the world to me. |\nYou have suffered a life-changing injury. Ms. Hanley will embody intellectual agility, ethical sensibilities, and a deep commitment to set you up for success while you navigate the complicated process of trying to recover physically, mentally, emotionally, financially, socially, professionally, and personally. Ms. Hanley is mindful of the intangible compensation a personal injury client desperately seeks: justice and accountability. With swift critical thinking skills, Ms. Hanley is thoughtful, efficient, and logical whether it is nuanced knowledge of previous case law or understanding how to defend and prepare the complex layers of your life before, during and after the injury. Ms. Hanley has a magnetic balance of determination, wisdom, and fearlessness. Ms. Hanley was patient and responsive to medical providers, giving her a degree of thoroughness and humility about my case. Ms. Hanley is intuitive, proactive, and purposeful with her time, effort and energy. As a client who required accommodations because of a disability, I was concerned if the extra support, guidance and flexibility that I needed would become burdensome. Instead, Ms. Hanley empowered me during each step of the process, expressed appreciation for my comments and questions, and through effective communication showed me she was a sophisticated communicator on my behalf. Ms. Hanley articulates legal jargon and processes in a way that clients can synthesize and appreciate. Every client should have the honor of being represented by Ms. Hanley. |\nElizabeth Hanley is driven, knowledgeable and was extremely attentive. She out performed opposing counsel at every step. I would highly recommend her.\nI hired Elizabeth Hanley when an employment situation became untenable and I consider myself extremely lucky to have found her. I could not have been better served by Elizabeth and her team. After working at a company for many years I was diagnosed with a serious illness. I was discriminated and retaliated against because the medical treatment impacted the company’s insurance costs. Friends and coworkers encouraged me to speak with an attorney and I was fortunate to be able to meet with Elizabeth. Her expertise combined with deep knowledge and genuine empathy helped me navigate a very stressful, difficult time. I was supported and felt I had a true advocate in Elizabeth. We did file suit and a few months before our court date, Elizabeth negotiated a settlement that I was very happy with. Elizabeth was always impeccably prepared and knew my case details inside and out. Her support made me feel as though she was personally offended by how I’d been treated and my emotional well-being was always her priority. My only regret for settling was not being able to see Elizabeth argue the case in court! She is incredibly impressive in depositions and mediation and I can only imagine her courtroom mastery. I cannot recommend Elizabeth Hanley highly enough.\nElizabeth represented me in a personal injury case. Though the case took a long time to eventually resolve, as these things sometimes do (the legal system being what it is and all), Elizabeth consistently kept me in loop on what was going on and fought vigorously and intelligently on my behalf from beginning to end, eventually concluding with a very healthy settlement. I always felt well informed of the risks, rewards, options, and situation throughout the entire time -- and I've had experiences with other lawyers where this was definitely not the case, where I was kept in the dark, or wasn't ever really sure what to expect. I also felt like she genuinely cared about my case, and I think her attention to detail and level of communication throughout the entire process is a testament to that. I don't think I could have asked for a better lawyer to represent me and my interests in that case.\nElizabeth did an amazing job with our case and my respect for her is immense. She's not only a great and wise attorney but also cares about people and advocates for them. She understands the struggle we as women have in our careers to be equal with men. But beyond that, she's strategic and helps utilize the tools available to obtain justice. Wish I could give more than 5 stars!\nElizabeth is a compassionate, smart, and tenacious attorney who gets results! I was in two car crashes about a year apart. My medical care was somewhat disjointed, and the insurance companies deemed that I had been in treatment for far longer than what my injuries indicated. Thankfully, Elizabeth was recommended to me and she seamlessly took over my case. Elizabeth continuously made me feel like I was her only client. She took the time to answer my endless questions. She even attended a doctor's appointment with me so we could discuss my treatment plan moving forward. I felt heard by Elizabeth and she took the stress out of the process of my personal injury case. After reaching a settlement, I was thrilled with my outcome!\nIf you want to work with a kind, intelligent and strategic attorney who delivers, hire Elizabeth.\nI had a situation where an employer was withholding earned wages. I was referred to Elizabeth via an industry colleague who praised her knowledge of the law and customer service. After my initial meeting with Elizabeth, I was very confident that she would deliver the results I was needing. In short, Elizabeth exceeded my expectations with her expertise and tenaciously litigating my case. Elizabeth recovered my earned wages and then some. If you have a shady employer who is violating employment laws, they will quickly learn that is just not acceptable behavior if you chose to have Elizabeth represent your case.\nElizabeth helped me to reach a settlement in an ADA discrimination case against my former employer. Elizabeth was always kind in her dealings with me and helped me throughout the process. She was an excellent communicator and responded to my concerns right away. I appreciated the fact that she approached my case pragmatically and was always looking out for my bottom line by pointing out the best ways to keep legal fees down. Elizabeth came through on her promises to me and worked hard to see to it that I walked away with what was fair. I would not hesitate to recommend Elizabeth in the future.\nAfter finding myself in a very tenuous situation with a former employer, a colleague recommended Elizabeth to me. In my first meeting with Elizabeth, I found her to be both knowledgeable and practical. We reviewed the situation in detail, and I felt like she was the right choice to represent me in the matter.\nWorking with Elizabeth was extremely easy. She was thorough in her approach and combed through all pieces of information related to my case. She negotiated with the other attorney (representing the company) in both a professional and practical manner. Additionally, the team supporting Elizabeth was equally professional and easy to work with.\nThough it took nearly a year, Elizabeth never lost focus on the matter. She diligently worked through the issue and ultimately was able to reach a settlement that met my expectations.\nSince working with Elizabeth, I've recommended her to two other colleagues.\nA small group of colleagues and I hired Ms. Hanley several years ago for a pay dispute. She's extremely knowledgeable and more importantly genuinely cares about her clients. She always would take the time to make sure we understood the intricacies of the law and how it applied us. It's really rare to find someone that genuinely enjoys helping and fighting for people, and that's what I believe fuels Ms. Hanley in what she does. My colleagues and I are extremely grateful for the amazing work she has done.\nWhen you hire an attorney you want to know that your hard earned money that you are handing over is hard at work. This woman is a gladiator which is what you need when you have a large company after your job. Elizabeth didn't contact just any company attorney she contacted the Attorney in charge of the attorneys. She works weekends and even holidays. The night before Thanksgiving I was speaking to Ms. Hanley and she told me she would contact the company attorney on Thanksgiving and throughout the weekend because when her clients need something she does what it takes. A little crazy but she got it done by Monday all of my demands were accepted.\nShe is also upfront if she doesn't think she will win she will not take on your case. A lot of people work for Fortune 500 Companies and are afraid of trying to sue them or think that attorneys won't touch them. Elizabeth is not that person. She has no fear of them at all.\nAbsolutely, the best in the industry. Don't waste your money on any attorney. Spend the consultant money on Elizabeth and be confident that your case is valid before writing the big retainer check.\nYou know it’s a very good signal when you ask trusted contacts who is the best employment attorney and you hear the same name over-and-over, \"Elizabeth Hanley\". Having just completed a successful engagement with her I can tell you why.\n1) She is honest:\nShe fully explores your issue, quickly distills your legal options and most importantly states whether or not she is best positioned to help you. In an industry where some attorneys over-sell to acquire clients she is the opposite. She is realistic, disciplined, pragmatic and ultimately tells you what you need to know not what you might want to hear. Further, she has conviction around what she wants to work on and for whom. I value and admire that.\n2) She is a specialist:\nDemonstrates strong command and depth of knowledge which is on target and valuable. I had a legal issue that extended outside of her space and she decisively brought in a lawyer from another firm who was uniquely qualified in that specialty.\n3) She is experienced:\nShe knows how to execute. Whether its establishing the frameworks for her arguments, supporting with legal precedents or successfully engage and communicating with opposing counsel she is highly credible and always in top form.\n4) She cares about you:\nShe is compassionate about your situation and determined to help you prevail.\n5) She delivers:\nSimply put, I got the outcome I had hoped for!\nI cannot speak highly enough about Elizabeth's legal representation. It was easy for me to trust Elizabeth's advisement as she was always honest (even when the truth was difficult to hear), provided context, and respected my budget. I knew having Elizabeth on my side that there were no surprises which afforded me the ability to maintain a stress free life during this contentious time. Elizabeth is extremely well-versed in Employment and Labor, Discrimination and Sexual Harassment laws and how navigate the legal and court process so that they benefited me and my case. She is a truly talented attorney and always had my best interest in mind. Elizabeth genuinely cared about me and my case and I couldn't have been more pleased with the legal representation she provided me. I would highly recommend Elizabeth to anyone in need of an attorney.\nI interviewed four other attorneys prior to finding Elizabeth to help me with a complex workplace discrimination issue. As an executive who is highly critical of those in professional service fields, I give her the highest rating! She is an absolute gem who delivered outstanding results on my behalf.\nElizabeth was easy to talk to, trustworthy, objective and compassionate. She is clearly a well-read expert in her field, but also quick and agile on her feet in the moment. She clearly articulated options and risks. She led me through a vulnerable situation with confidence, letting me know what to expect each step of the way. She advised several points I never would have considered and knew how to leverage them for maximum benefit. I am incredibly grateful for her help and cannot recommend her highly enough!\nI had never hired a lawyer before but had heard many good things about Elizabeth. She was so helpful, kind, and amazing through the whole process. She never stopped fighting for me and my case through the very end. She was also very responsive to all my several hundred questions along the way. I can't thank her enough and would highly recommend her!"
    }
  ],
  "argos_summary": "Jane Doe 100 has filed a lawsuit against OBGYN Mark E. Mulholland and two medical institutions, alleging physical and sexual abuse during a 2022 appointment. The suit claims that Mulholland performed an inappropriate exam and made unprofessional comments, while also highlighting a history of patient complaints against him dating back to 2003. The attorneys representing Jane Doe 100, Tamara Holder and Elizabeth Hanley, emphasize the need for accountability from both Mulholland and the healthcare institutions that allegedly ignored prior complaints.",
  "argos_id": "3VTGUZK4S"
}