{
  "url": "https://nypost.com/2025/08/14/us-news/lewandowski-has-only-worked-69-days-under-noem-with-61-still-to-go-dhs-says-after-concerns-over-his-special-status/",
  "authorsByline": "Diana Nerozzi, Jennie Taer, Steven Nelson",
  "articleId": "b4047a4ce8834a29a8e30f38ff74e910",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-6xi6z5dh3-1755194126837.jpg?quality=75&strip=all&1755179738&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:08:45+00:00",
  "addDate": "2025-08-14T19:10:23.641398+00:00",
  "refreshDate": "2025-08-14T19:10:23.641401+00:00",
  "score": 1.0,
  "title": "Corey Lewandowski has only worked 69 days under Kristi Noem — with 61 still to go — DHS says after concerns over ‘special’ status",
  "description": "WASHINGTON — Corey Lewandowski has logged just 69 days as a “special” employee of Homeland Security Secretary Kristi Noem — allowing him to serve another 61, the Trump administration sa…",
  "content": "WASHINGTON — Corey Lewandowski has logged just 69 days as a “special” employee of Homeland Security Secretary Kristi Noem — allowing him to serve another 61, the Trump administration said Thursday after weeks of speculation about Lewandowski apparently blowing past the 130-day limit.\n\nLewandowski, 51, has served as Noem’s de facto chief of staff since late January, and fellow administration aides were puzzled when he remained on the job well past what they believed to be his end date in early June — leading to theories that he was using colleagues’ badges to clock into work.\n\nThe Department of Homeland Security told The Post Thursday that 69 working days had been recorded by Trump’s former 2016 campaign manager, confirming a figure first reported by Axios.\n\n“Mr. Lewandowski’s time is kept by a career DHS employee who submits the paperwork on a bi-weekly basis,” the department said.\n\nA White House official hailed plummeting illegal immigration numbers under Noem and Lewandowski’s leadership when asked about his status.\n\n“The Tremendous results coming from the Department of Homeland Security — a historically secure border, safer American communities, and successful deportations of criminal illegal aliens — speak for themselves,” she said.\n\nLewandowski reportedly was denied the permanent role of DHS chief of staff due to widespread allegations that he and Noem, 53, are having an extramarital affair.\n\nBoth are married to other people and have repeatedly denied an improper relationship.\n\nThe pair have traveled extensively together on official business this year, including trips to Argentina, Bahrain, Costa Rica, Guatemala, Poland and Italy.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/14/us-news/wild-video-shows-dems-pick-for-sc-gov-race-being-arrested-in-his-underwear-while-calling-himself-god-and-superman/",
    "https://nypost.com/2023/09/15/kristi-noem-corey-lewandowski-affair-shakes-up-trump-running-mate-stakes/",
    "https://nypost.com/2025/07/01/us-news/tom-homan-says-total-border-encounters-last-month-were-less-than-single-day-under-biden/",
    "https://www.axios.com/2025/08/14/white-house-dhs-lewandowski-noem",
    "https://nypost.com/2025/08/14/us-news/ashley-biden-shared-photo-of-husband-howard-krein-with-girlfriend-before-divorce-filing/",
    "https://nypost.com/2025/08/14/us-news/dc-sandwich-slinger-idd-as-doj-trial-attorney-fired-from-position-after-hurling-sub-at-fed-agent/",
    "https://nypost.com/2025/04/08/us-news/kristi-noem-dodges-kicks-from-migrant-suspect-as-she-leads-ice-deportation-raids-in-phoenix/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Homeland Security Secretary Kristi Noem",
      "weight": 0.101169474
    },
    {
      "name": "Corey Lewandowski",
      "weight": 0.09211727
    },
    {
      "name": "Kristi Noem",
      "weight": 0.08992601
    },
    {
      "name": "Lewandowski",
      "weight": 0.087710075
    },
    {
      "name": "Homeland Security",
      "weight": 0.08312829
    },
    {
      "name": "DHS chief",
      "weight": 0.08115802
    },
    {
      "name": "Noem",
      "weight": 0.0791281
    },
    {
      "name": "plummeting illegal immigration numbers",
      "weight": 0.07570491
    },
    {
      "name": "criminal illegal aliens",
      "weight": 0.072117634
    },
    {
      "name": "fellow administration aides",
      "weight": 0.0709199
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9921875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.97412109375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.91650390625
    }
  ],
  "sentiment": {
    "positive": 0.07139836,
    "negative": 0.62162524,
    "neutral": 0.3069764
  },
  "summary": "The Department of Homeland Security (DHS) has confirmed that former campaign manager Corey Lewandowski has only worked 69 days under Homeland Security Secretary Kristi Noem, with 61 more to go. This revelation comes amid concerns that Lewandowski may have exceeded the 130-day limit on his \"special\" status. The department kept Lewandowski's timebook by a career employee, who submits the paperwork weekly. There are also rumours that he may have been using colleagues' badges to clock into work. Noem and Lewandowski have been involved in an extramarital affair, which they deny.",
  "shortSummary": "PresidentCorey Lewandowski worked 69 days as a special employee of Homeland Security, allowing him to serve another 61, amid speculation about his work ethic.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "237bfceef66a4a4ea80c90e661d93143",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/07/01/us-news/tom-homan-says-total-border-encounters-last-month-were-less-than-single-day-under-biden/",
      "text": "Trump border czar Tom Homan reveals staggering drop in border crossings last month: ‘Less than a single day under Biden’\nFederal authorities encountered fewer migrants attempting to illegally enter the US last month than what officials faced daily during the Biden administration, border czar Tom Homan revealed Tuesday.\n“Total Border Patrol encounters for the entire month of June 2025 was 6,070,” according to Homan, who noted in an X post that the figure is “less than a single day under Biden.”\n“As a matter of fact, the total number of encounters is less than half of a single day under Biden on many days,” the Trump administration official said, adding that “none of the 6,070 were released into the US. ZERO.”\nThe total released by Homan marks a 93.1% drop in nationwide Border Patrol encounters from June 2024, when 87,606 migrants were nabbed trying to enter the country illegally.\nIt’s also a 94% and 97% decline from June 2023 and June 2022, when, respectively, 100,606 and 193,027 migrants were encountered by Border Patrol.\nIn June 2022, the average daily total of migrant encounters was about 6,434 per day.\nLast month, Border Patrol reported encountering just over 10,000 migrants nationwide.\nHoman attributed the massive reduction in border-crossings to President Trump’s crackdown on illegal immigration, calling it, “The Trump Effect.”\n“President Trump has created the most secure border in the history of the nation and the data proves it,” the border czar asserted. “We have never seen numbers this low. Never.”\n“God bless the men and women of the US Border Patrol and God bless the men and women of ICE,” Homan continued. “The interior arrests and consequences help to drive down illegal immigration.”\n“The TRUMP EFFECT keeps America winning.”"
    },
    {
      "url": "https://nypost.com/2025/04/08/us-news/kristi-noem-dodges-kicks-from-migrant-suspect-as-she-leads-ice-deportation-raids-in-phoenix/",
      "text": "Kristi Noem dodges kicks from migrant suspect as she leads ICE deportation raids in Phoenix\nPHOENIX — Homeland Security Secretary Kristi Noem isn’t afraid of getting her hands dirty on President Trump’s deportation raids.\nNoem led about 100 federal agents on an early morning raid Tuesday in Arizona’s capital, where they nabbed three illegal migrants wanted on charges from weapons and drug offenses to running a money laundering operation.\nThe Post was there as she dodged kicks from a suspect wearing slip-on shoes and gamely told him, “You’re not scaring me with your Croc.”\nThe multi-agency task force — led by Phoenix Immigration and Customs Enforcement agents and joined by a coterie of federal law enforcement and immigration agencies — nabbed three illegal immigrant felons with extensive criminal histories.\nNoem, clad in police tactical gear including a flak jacket, sported her two-tone gold Rolex as she greeted agents from ICE’s Enforcement and Removal Operations, Homeland Security Investigations, the FBI, and the Drug Enforcement Administration in a dingy underground parking garage. She shook hands with officers as she thanked them for their work and pledged to get them the resources they need to do their jobs better.\n“The effort of cooperation we have between agencies is getting turned onto steroids. We have this being multiplied across the country exponentially, now anyone who’s in this country illegally that’s committing crimes and has broken our laws will face consequences,” Noem told The Post.\n“We’ll be sweeping them up faster than we ever have before.”\nAgents were briefed on the day’s targets before a dozen vehicles rolled out — with Noem leading the convoy behind the wheel of a BearCat armored SWAT vehicle.\nAlso in the BearCat with Noem was former Trump campaign manager and senior adviser Corey Lewandowski, who introduced himself to the federal agents as “chief of staff.” DHS later clarified that he is an adviser to DHS and a special government employee.\nThe first suspect arrested was Bonifacio Renteria-Cruz, an illegal migrant felon from Mexico with ties to the Sinaloa Cartel, according to DHS. His lengthy rap sheet includes prior convictions for aggravated assault, weapons charges, and an active arrest warrant in Mexico for homicide.\nRenteria-Cruz had been ordered removed by an immigration official in 2008.\nNext on the task force’s chopping block was illegal alien Jose Escobar-Robles, identified as helping run Monroy Enterprises, a money service business believed to be illegally funneling money to Mexico to benefit cartels engaged in drug smuggling and human trafficking.\nAfter he was slapped in cuffs and loaded into the back of a police car, Noem asked him questions about whether he has family as he raised his Croc shoe in an attempt to block out the camera, impatiently imploring the agents, “Let’s go, let’s go.”\nNoem retorted, “You’re gonna go — you’re gonna go home, and you’re gonna get prosecuted,” adding, “You’re not scaring me with your Croc” as he repeatedly kicked his foot in her direction.\nThe final suspect picked up in the raids, Luis Garcia-Sanchez, is allegedly connected to the notorious 18th Street Gang. He was wanted for felony narcotics charges dating back to 1987 and twice ordered removed from the country, DHS said.\nGarcia-Sanchez was barefoot and surrounded by a pungent cloud of pot smoke when agents showed up with the warrant. His wife retrieved his shoes before they loaded him into a waiting police car.\nAs officers led Garcia-Sanchez, 61, away in handcuffs, he told The Post that he was no longer affiliated with the LA-based street gang and that he was a grandfather now.\nHe told Noem from the back of a squad car, sounding somewhat remorseful, that he has three kids, and that he didn’t want them to wind up living the gangbanger lifestyle like their father.\n“Go deal with the consequences of breaking the law here. Give them an example of being a better person,” Noem told a handcuffed Garcia-Sanchez.\nNoem said the raids would continue and were part of stepped-up efforts under the Trump administration to round up migrants — including those whose primary crime is being in the country illegally.\nShe also highlighted new provisions of the Alien Registration Act of 1940, which were set to go into effect on April 11.\nThe law requires foreign nationals who have been in the US 30 days or longer to register with the federal government or be subject to fines, imprisonment, or deportation.\nAs a result of that act, she said, “everyone in this country illegally” will be subject to criminal charges.\n“We’re past the deadline of the Alien Registration Act, so everyone in this country illegally now, it’s a criminal charge. Everyone should know we’re enforcing the act. If you’ve been here longer than 30 days and haven’t registered with the government, we are now coming after you criminally,” she said.\n“That means we can come into your home and get you, charge you and remove you, and the fines are up to $1,000 a day,” she said, adding that federal agencies are now empowered to use all of the authority at their disposal “to make sure American citizens are the only ones afforded the rights of being in this country.”\n“Everybody else is going to pay consequences for breaking our laws.”\nNoem also referenced the Supreme Court’s lifting of an order blocking the administration from using the Alien Enemies Act, paving the way to deport more criminal migrants to El Salvador’s infamous Terrorism Confinement Center prison, CECOT.\n“We’re going to continue using that act in order to return people from these terrorist organizations to face consequences and be removed from our country,” she said, noting that there’s plenty of room in the facility and more to come.\n“You’ll see us continuing to partner with El Salvador. CECOT has the capacity for 40,000 individuals, and [El Salvador President Nayib Bukele] has said they’ll take as many as we want to send. There’s 14,000 there now, and he said he plans to build another prison right next to it.”"
    },
    {
      "url": "https://nypost.com/2025/08/14/us-news/wild-video-shows-dems-pick-for-sc-gov-race-being-arrested-in-his-underwear-while-calling-himself-god-and-superman/",
      "text": "Wild video shows Dems’ pick for SC gov’s race being arrested in his underwear — while calling himself God and Superman\nWild, newly released dashcam footage shows the Democrats’ choice to run for governor in South Carolina getting arrested recently in just his underwear — while swearing, using the n-word and referring to himself as both God and Superman.\nMarried father of four William “Mullins” McLeod, 53, is facing calls from his own party to step down from the gubernatorial race that he only formally entered Monday after video emerged a day later of his bizarre arrest just months earlier in May, according to WCBD.\nThe prominent attorney was stopped in downtown Charleston while “yelling at the top of his lungs” and wearing only underwear and shoes, according to a police report — which suggested he showed signs “typical of an individual under the influence of a stimulant narcotic.”\nThe Dem referred to his upcoming election race — even threatening to kick an opponent’s “f–king teeth in” — while refusing to tell cops his name, instead referring to himself as God and Superman, the hour-long video released through a Freedom of Information Act request shows.\n“It doesn’t matter, my friend, trust me,” he told one officer when asked his name. “I’m one of the most just humans to ever walk this soil,” he said.\n“Superman sounds good,” he added bizarrely.\nMcLeod also issued threats toward current and former Palmetto State politicians during the profanity-laden rant.\n“I’m gonna kick your f–king teeth in,” he says at one point, appearing to reference Republican Attorney General Alan Wilson, who announced his bid for governor earlier this summer.\nMcLeod — who is heard uttering the n-word at least twice in the video — also refuses to get out of the patrol car when it arrives at the jail, instead telling an officer he would sleep in the back seat.\n“No, I’m not doing it, no. I’m not getting out of this car. It’s time to go to bed,” he shouts at the officer, before being forcibly removed and booked into the jail shortly before 1 a.m., according to an arrest report retrieved by WCBD.\nMcLeod’s eyes were “extremely bloodshot and highly dilated … typical of an individual under the influence of a stimulant narcotic,” according to the report.\nIt wasn’t immediately clear whether McLeod — who ran unsuccessfully for governor in 2010 and served two terms as Charleston County Democratic Party chairman — was tested for drugs during his arrest.\nHe is facing misdemeanor charges for disorderly conduct.\nHis party leadership is calling on him to step down from the gubernatorial race, in which he is currently the party’s only candidate.\n“After reviewing the transcript of the dash cam footage from his recent arrest, it is clear that Mr. McLeod is navigating profound challenges and should focus on his mental and emotional well-being instead of a campaign for governor,” the chair of the South Carolina Democratic Party, Christale Spain, said in a statement Wednesday.\nEvery morning, the NY POSTcast offers a deep dive into the headlines with the Post’s signature mix of politics, business, pop culture, true crime and everything in between. Subscribe here!\n“We offer him compassion and pray he finds the support he needs.”\nMcLeod’s campaign team did not respond immediately to requests for comment, but he branded his arrest “unlawful” in a recent interview announcing his candidacy.\n“The only thing I’d ask the voters is to please give me a little bit of grace and know that long before we go to Election Day, they’ll know exactly what happened,” he told the Post and Courier.\n“And when they learn what happened around my unlawful arrest, it will be a reason why I absolutely need to be our state’s governor,” he said, adding that he had been exercising his “God-given, constitutional right to be in a public place” when he was arrested."
    },
    {
      "url": "https://nypost.com/2025/08/14/us-news/dc-sandwich-slinger-idd-as-doj-trial-attorney-fired-from-position-after-hurling-sub-at-fed-agent/",
      "text": "DC sandwich slinger ID’d as DOJ employee, fired from position after hurling sub at federal agent\nWASHINGTON — His career is toast.\nA DC dimwit who slung a Subway sandwich at a federal agent on the streets of the capital earlier this week has been identified as a now-former Justice Department worker.\nAttorney General Pam Bondi announced Thursday that Sean Charles Dunn, 37, who is facing a felony assault charge for the sandwich strike, has been fired from his DOJ role.\n“If you touch any law enforcement officer, we will come after you,” Bondi declared. “I just learned that this defendant worked at the Department of Justice — NO LONGER. Not only is he FIRED, he has been charged with a felony.”\n“This is an example of the Deep State we have been up against for seven months as we work to refocus DOJ,” she added. “You will NOT work in this administration while disrespecting our government and law enforcement.”\nDunn worked as an international affairs specialist in the Justice Department’s criminal division — which handles cases of fugitives abroad and helps foreign countries on extradition matters with their own fugitives, according to the DOJ.\nDunn appeared to have been similar to a paralegal — assisting attorneys in handling a “large volume of cases, including the litigation of those matters,” according to the DOJ’s job listing for the position.\nHe does not appear to be an attorney as his name isn’t listed on the DC bar’s website.\nAn attorney for the suspect did not immediately respond to requests for comment and attempts to contact Dunn directly were unsuccessful.\nDunn was allegedly caught on camera berating a group of federal officers as “fascists” before lobbing his deli sandwich and hitting a US Customs and Border Protection agent in the chest.\n“F— you! You f—ing fascists! Why are you here? I don’t want you in my city!” Dunn allegedly fumed within inches of an officer’s face, per a criminal complaint.\nAccording to the complaint, Dunn successfully attempted to flee on foot, telling a local cop while he was being processed: “I did it. I threw a sandwich.”\nFootage of the incident went viral against the backdrop of President Trump’s deployment of hundreds of federal law enforcement personnel to assist DC police in cracking down on crime.\nDunn faces one count of assaulting, resisting or impeding a federal officer and faces up to one year in prison if convicted.\n“The police are not out there to get pushed around or beat up,” DC US Attorney Jeanine Pirro declared in announcing the case against Dunn. “He thought it was funny. Well, he doesn’t think it’s funny today because we charged him with a felony: Assault on a police officer.”\n“So there, stick your Subway sandwich somewhere else!”\nOn Monday, Trump federalized the DC Metropolitan Police Department for 30 days and activated the National Guard to patrol the District’s streets.\nSince then, hundreds of federal officials have arrested more than 100 suspects, with 23 collared on Monday, 43 nabbed on Tuesday and 45 apprehended on Wednesday, according to data from the Trump administration.\nTrump’s crackdown comes after former Department of Government Efficiency (DOGE) employee Edward Coristine — aka “Big Balls” — was beaten up while intervening to prevent a carjacking last week."
    },
    {
      "url": "https://nypost.com/2025/08/14/us-news/ashley-biden-shared-photo-of-husband-howard-krein-with-girlfriend-before-divorce-filing/",
      "text": "Ashley Biden shared a photo of husband Howard Krein hand in hand with ‘his girlfriend’ hours before bombshell divorce filing\nAshley Biden, the former first daughter who is fresh off filing for divorce from her husband, Dr. Howard Krein, shared a picture purportedly showing her ex with another woman.\n“My husband and his girlfriend holding hands,” the 44-year-old wrote in the Instagram Story, over a picture of a man and a woman taken from behind. She accompanied the story with the Notorious B.I.G. song “Another,” featuring Lil’ Kim, which details an affair.\n“What do you do when your man is untrue? Do you cut the sucker off and find someone new?” Lil’ Kim raps in the portion of the song Biden shared on social media.\nThe dark-haired man in a casual short-sleeved shirt and the blond woman in a strapless black dress are not immediately identifiable, but Biden’s message was clear.\nSunday morning’s Instagram Story — which was quickly taken down — came just hours before Biden filed for a divorce from the 58-year-old plastic surgeon in a Philadelphia court after 13 years of marriage.\nAnother since-deleted Instagram Story, showing Biden walking through a park giving a thumbs-up to the tune of Beyonce’s song “Freedom,” also appeared to allude to the split.\nIn a subsequent story accompanied by the Lauryn Hill song “Freedom Time,” she reposted a quote, “New life, new beginnings means new boundaries. New ways of being that won’t look or sound like they did before.”\nFormer President Joe Biden’s daughter is seeking spousal support from her ex as part of the divorce, court records seen by Radar Online show.\nBiden, executive director of the nonprofit Delaware Center for Justice, is “unable to sustain herself” while the divorce is pending, according to the documents filed by her attorney Charles Meyer.\nShe is requesting a no-fault divorce, claiming that the marriage is “irretrievably broken,” and that the couple are living “separate and apart,” the documents show.\nBiden and Krein did not respond to requests for comment Thursday.\nThe couple married in 2012 in Greenville, Delaware, two years after meeting through Ashley’s late brother, Beau, who died of cancer in 2015.\nKrein, a New Jersey-born otolaryngologist at Thomas Jefferson University, proposed in 2011 at Big Sur, California.\nThey married at Delaware’s St. Joseph on the Brandywine Roman Catholic Church in a ceremony combining her traditions with Krein’s Jewish ones, before the couple and some 200 guests traveled to the Biden family’s nearby lakeside home in Wilmington for a reception and dinner.\nJoe Biden, who was vice president at the time, personally prepped the house for his youngest child’s wedding.\n“I kept telling Ash, we’ve got to open up the church and practice walking up and down the aisle so I can handle it,” he previously told People.\nHe was also full of praise for his future son-in-law, saying, “This is the right guy. And he’s getting a helluva woman.”\nKrein also served on the Biden Cancer Initiative’s board of directors between 2017 and 2019, and advised his 2020 presidential campaign on its response to the COVID-19 pandemic in an unofficial capacity.\nAt last year’s DNC in Chicago, Ashley Biden recounted her wedding day and discussed her father’s words to her before she tied the knot.\n“Before he walked me down the aisle, he turned to me and said he would always be my best friend. All these years later, Dad, you are still my best friend,” she said in an address that brought her father to tears."
    },
    {
      "url": "https://nypost.com/2023/09/15/kristi-noem-corey-lewandowski-affair-shakes-up-trump-running-mate-stakes/",
      "text": "SD Gov. Kristi Noem having ‘absurdly blatant and public’ affair with ‘handsy’ Trump aide Corey Lewandowski, sources say\nMarried Republican South Dakota Gov. Kristi Noem has engaged in a years-long affair with longtime Donald Trump adviser Corey Lewandowski, multiple sources told The Post Friday.\nThough no images of the two getting frisky are known to exist, the pair have been less than discreet about their relationship, with one source recalling them making out at a hotel bar during the 2021 Conservative Political Action Conference in Orlando, Fla.\n“I remember it was so absurdly blatant and public,” said the person, who recalled Noem and Lewandowski getting “handsy” at the bar of the Hyatt Regency Orlando with between 100 and 200 others around.\n“It wasn’t like 2 a.m.,” the source said. “It isn’t like we caught them at some dive bar miles away. It’s a lobby bar where everyone is staying and so there’s a bajillion political operatives and journalists and electeds around. I remember I saw it with my own eyes and a couple other people saw it and the blatantness was absurd.”\n“This has been a known, open thing and we’ve all been waiting for it to blow up at some point,” the person added.\nThe liaison emerged one week after Noem, a 51-year-old mom of three, formally endorsed Trump, 77, for the 2024 Republican presidential nomination, raising the pitch of speculation that the 45th president would pick her as his running mate.\n“He’s 100% banging her,” said a second person familiar with the relationship between Noem and Lewandowski, first reported by DailyMail.com.\nThe source added that they personally witnessed Noem “sitting on his [Lewandowski’s] lap” and “playing grab-ass” during an event at Trump’s Mar-a-Lago resort in December 2020.\n“The usual stuff that drunk people who are having affairs do,” the person said of the interaction.\nAnother person who saw the pair at Mar-a-Lago on the same occasion confirmed, “I saw her on his lap.”\n“I thought they were a couple. They were all over each other,” added this source, who had met Lewandowski before, but was unacquainted with Noem — whom the witness recalled as otherwise “so beautiful” and “poised.”\nA fourth source told The Post the dalliance has been widely known in Republican political circles for “years,” adding that Noem’s husband, Bryon, is said to have moved out of the governor’s mansion in Pierre roughly two years ago.\nBryon Noem runs an eponymous insurance company in Bryant, SD, a couple hours’ drive from the state capital. Details of his current living arrangements are unclear.\nA fifth person told The Post that he and fellow GOP operatives were “well aware” of the fling and suggested the story finally appeared in print thanks to “one of her competitors for VP.”\nBoth Trump and political pundits have publicly mused for months about potential running mates, with some of the names mentioned including Noem, former Arizona gubernatorial candidate Kari Lake, former Secretary of State Mike Pompeo, Sen. Marsha Blackburn (R-Tenn.), former ambassador to Germany Ric Grenell, House Republican Conference Chair Elise Stefanik (R-NY), current GOP presidential candidate Vivek Ramaswamy, and hard-right Rep. Marjorie Taylor Greene (R-Ga.).\nNoem herself was once considered a potential 2024 contender but opted not to enter the race, telling Fox News last month that no Republican could win the nomination as long as Trump was running.\n“Why run if you can’t win?” she asked.\nOn Sept. 8, Noem announced at a rally in Rapid City that she was backing Trump, calling him “the fighter that our country needs.”\n“You made America great again once, let’s do it again,” Noem said while introducing the former president.\n“I will do everything I can to help him win and save this country.”\nLewandowski, 49, was Trump’s first 2016 campaign manager and widely credited with engineering his victory in the 2016 New Hampshire primary, which bolstered the real estate mogul after a loss to Sen. Ted Cruz (R-Texas) in the Iowa caucuses.\nHowever, Lewandowski’s star began to fade after he was accused of manhandling Breitbart reporter Michelle Fields following a Trump press conference in March 2016.\nHe was charged with one count of simple battery, which was later dropped.\nLewandowski was dismissed from the Trump campaign three months later, following reported clashes with then-campaign chairman Paul Manafort.\nHowever, the Massachusetts native remained close to Trump while a private citizen. According to former special counsel Robert Mueller’s report on the Russia investigation, Trump summoned Lewandowski to the Oval Office on June 19, 2017, and ordered him to tell then-Attorney General Jeff Sessions to both make a public statement criticizing the probe and direct Mueller to limit the scope of his investigation to future foreign interference in US elections.\nLewandowski arranged a meeting with Sessions, but the AG canceled due to a last-minute conflict. The following month, Trump summoned Lewandowski again and told him that if Sessions did not agree to meet, Lewandowski should tell Sessions he was fired. Lewandowski passed the order to then-White House deputy chief of staff Rick Dearborn, who pocketed it and did not deliver it to Sessions.\nThe former campaign operative has been married since 2005 to wife Allison Hardy, but has been accused of numerous affairs and acting inappropriately with high-profile women in the Trump orbit.\nIn November 2017, pro-Trump singer Joy Villa said Lewandowski had slapped her backside “really hard” at a holiday party. When Villa told him to keep his hands to himself, Lewandowski reportedly told her, “Go ahead, I work in the private sector” — then smacked her butt again.\n“It was completely demeaning and shocking,” Villa told Politico at the time.\nLewandowski also reportedly engaged in an on-again, off-again relationship with then-White House communications director Hope Hicks.\nIn 2021, he was removed as chairman of the pro-Trump Make America Great Again Action super PAC after the wife of a major donor to the former president accused him of inappropriate behavior.\nTrashelle Odom told Las Vegas police that Lewandowski asked for her hotel room number and made inappropriate comments about his genitals. At one point in their conversation, Odom told Lewandowski she was from a “bad area” in California.\n“That is when Lewandowski told me that he ‘was from a bad part of Boston and have [sic] killed people,’” Odom told the cops. “I initially believed that he was joking and attempted to laugh it off. That is when Lewandowski went into detail and stated something to the effect of, ‘When I was 10, I stabbed someone over and over again, killing him.’ He continued and shared that when he was older he ‘stabbed a man in the back of the head, also killing him.’”\nNoem also publicly announced that she was cutting ties with Lewandowski, whom her office called a “volunteer” adviser. However, DailyMail.com reported that statement was more show than substance.\n“She fired him without really firing him,” one source told the outlet.\n“He never left.”\nLewandowski declined to comment on the record for this story.\nA Noem spokesman directed The Post to a statement given to DailyMail.com, which began: “This is so predictable that you would attack Governor Noem less than a week after she endorsed Donald J. Trump as the 47th President of the United States.”\n“As Governor Noem said during that endorsement speech: ‘Yes, I will be attacked for speaking the truth to all of you tonight. Yes, I expect Joe Biden, these candidates, their political operatives, and the media will perpetuate ugly, hateful misinformation in an attempt to destroy me and my family because of my opinions. It’s nothing new. I’m getting used to it, honestly.'”\nEditor’s note: An earlier version of this story quotes a source as saying they saw Noem sitting on Lewandowski’s lap at Mar-a-Lago in March 2020. In fact, the sighting took place in December 2020."
    }
  ],
  "argos_summary": "Corey Lewandowski, a special employee of Homeland Security Secretary Kristi Noem, has reportedly exceeded the 130-day limit for his position, leading to speculation about his status and alleged use of colleagues' badges. Noem and Lewandowski, both married, have faced allegations of an extramarital affair, which they deny, despite being seen together in compromising situations at public events. Meanwhile, Noem has been actively involved in deportation raids, emphasizing a crackdown on illegal immigration under the Trump administration, which has seen a significant drop in border crossings.",
  "argos_id": "4503SOHJN"
}