{
  "url": "https://people.com/authorities-find-body-believed-to-be-23-year-old-man-who-disappeared-after-hailed-ride-rocky-mountain-national-park-11791584",
  "authorsByline": "Jillian Frankel",
  "articleId": "43ab06169b544055be1ddea2bde5d6a9",
  "source": {
    "domain": "people.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://people.com/thmb/rFXyFruiGZBCLfpgl_g7J9z5qaY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(763x580:765x582)/Blake-Kieckhafer-081425-1-9e92e445a4ca4317b16e6e79025f9804.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T00:20:55+00:00",
  "addDate": "2025-08-15T00:33:57.681163+00:00",
  "refreshDate": "2025-08-15T00:33:57.681165+00:00",
  "score": 1.0,
  "title": "Authorities Find Body Believed to Be 23-Year-Old Man Who Disappeared After Hailing a Ride to Rocky Mountain National Park",
  "description": "Authorities ended their search for Blake Kieckhafer, who disappeared at Rocky Mountain National Park, after finding a body believed to be the 23-year-old. He was last seen on Aug. 7.",
  "content": "Officials have found a body believed to be a man who went missing after hailing a ride share service to Rocky Mountain National Park in Colorado last week, a park official says.\n\nA Rocky Mountain National Park spokesperson announced on Thursday, Aug. 14, that authorities found remains likely associated with Blake Kieckhafer, 23, from Omaha, Neb., a day earlier. The body was recovered above Emerald Lake.\n\n\"Rocky Mountain National Park rangers completed an on-scene investigation and recovery operations took place by helicopter,\" a park spokesperson said in a statement. \"His body was flown to a landing zone in Rocky Mountain National Park and transferred to the Larimer County Coroner’s Office.\"\n\nSearch efforts began after Kieckhafer's family reported him missing to park rangers on Monday, Aug. 11, a National Park Service spokesperson said in a statement on Tuesday, Aug. 12.\n\nKieckhafer was last spotted in the Upper Beaver Meadows area of the park on Aug. 7, around 5:20 p.m. local time, when he was dropped off by the ride share service, the NPS spokesperson said.\n\n Never miss a story — sign up for to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. \n\n\"Investigations lead to search efforts being focused in the Emerald Lake area on Wednesday. Over 80 people were involved in yesterday’s search efforts,\" the park spokesperson said.\n\nThe Larimer County Coroner's Office will confirm the identity of the body, according to the Rocky Mountain National Park statement.",
  "medium": "Article",
  "links": [
    "https://www.nps.gov/romo/learn/news/search-efforts-underway-for-a-missing-man-last-seen-in-rocky-mountain-national-park.htm",
    "https://people.com/google-engineer-29-likely-died-instantly-hit-falling-branch-popular-hiking-trail-11781188",
    "https://people-app.onelink.me/HNIa/kz7l4cuf",
    "https://people.com/23-year-old-man-hailed-ride-rocky-mountain-national-park-disappeared-11791502",
    "https://forms.dotdashmeredith.com/people-news-inline"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Rocky Mountain National Park",
      "weight": 0.13323376
    },
    {
      "name": "Rocky Mountain National Park rangers",
      "weight": 0.13036594
    },
    {
      "name": "National Park Service",
      "weight": 0.11210316
    },
    {
      "name": "Search efforts",
      "weight": 0.094532505
    },
    {
      "name": "search efforts",
      "weight": 0.094532505
    },
    {
      "name": "park rangers",
      "weight": 0.09412616
    },
    {
      "name": "A Rocky Mountain National Park spokesperson",
      "weight": 0.092454255
    },
    {
      "name": "the Rocky Mountain National Park statement",
      "weight": 0.08875358
    },
    {
      "name": "compelling human interest stories",
      "weight": 0.08061469
    },
    {
      "name": "Blake Kieckhafer",
      "weight": 0.07882465
    }
  ],
  "topics": [
    {
      "name": "Crime"
    }
  ],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.97705078125
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.9248046875
    },
    {
      "name": "/News/Other",
      "score": 0.61669921875
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.48583984375
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.401611328125
    }
  ],
  "sentiment": {
    "positive": 0.078738414,
    "negative": 0.57334214,
    "neutral": 0.34791943
  },
  "summary": "Officials have found a body believed to be 23-year-old man who went missing after using a ride share service to Rocky Mountain National Park in Colorado. The remains were likely to be those of Blake Kieckhafer, who was last seen in the Upper Beaver Meadows area of the park on Aug. 7. The body was recovered by a helicopter and transferred to the Larimer County Coroner's Office.",
  "shortSummary": "Officials found a body in Rocky Mountain National Park, believed to be that of missing 23-year-old Blake Kieckhafer.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "1d41bb786ed844ab96be631a4cf2fdca",
  "places": [
    {
      "osmId": "390960",
      "county": "Larimer County",
      "state": "Colorado",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.3553915,
        "lon": -105.71769566830672
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://people.com/google-engineer-29-likely-died-instantly-hit-falling-branch-popular-hiking-trail-11781188",
      "text": "Boyfriend Says Google Engineer, 29, Likely Died Instantly After Being Hit by Falling Branch on Popular Hiking Trail “It was just unimaginable that something like this could occur,” said Angela Lin's boyfriend By Sam Gillette Sam Gillette Sam Gillette is a staff writer at PEOPLE. She first joined PEOPLE in 2016. People Editorial Guidelines Updated on July 30, 2025 01:14PM EDT Leave a Comment Tuolumne Grove at Yosemite National Park. Credit : Getty NEED TO KNOW A 29-year-old Google software engineer is dead after she was hit by a branch while hiking in Yosemite National Park on July 19She was with two friends and her boyfriend, who immediately administered CPR\"We lost a loved and respected member of our team,\" a Google spokesperson tells PEOPLE A man is mourning his 29-year-old girlfriend, Google software engineer Angela Lin, after she died in a freak accident while they were hiking in Yosemite National Park. On Saturday, July 19, Lin, boyfriend David Hua and two friends had stopped to look at giant sequoias along Tuolumne Grove, a popular hiking trail, when there was a loud cracking sound, Hua told SFGate, the first outlet to report on Lin's death. “Two to three seconds later, branches fell out of the sky,” said Hua, who did not immediately respond to PEOPLE’s request for comment. “One big branch struck Angela, and then there were a bunch of smaller ones directly behind me.” When the man opened his eyes, he saw his girlfriend on the ground as blood pooled around her head. While Hua called 911 and performed CPR until a park ranger was able to assist, he said that emergency responders told him that Lin most likely died as soon as she was struck by the branch, SFGate reported. In a statement shared with PEOPLE, the Tuolumne County Sheriff’s Office says a report was received that Saturday around 5:50 p.m. local time of \"a fatal incident in the Tuolumne County portion of the park involving a hiker who had been struck by falling portions of a tree.\" Investigators from the coroner division of the sheriff's office then responded to the Mather Ranger Office to take possession of the victim's body, which officials confirm was Lin. Her death was ruled accidental and a result of \"blunt injuries,\" the sheriff's office said. A spokesperson for Yosemite National Park says an investigation into the incident is ongoing and no further information is available. Related Stories Mom, 49, Dies After Being Crushed by Falling Tree Branches at Softball Camp for 16-Year-Old Daughter: Report 8-Year-Old Boy Killed, 4 Others Injured by Falling Tree Branch at California Summer Camp Lin first joined Google in 2022, and previously worked as an engineer at Salesforce for more than two years, according to her LinkedIn profile. She graduated with her bachelor’s degree in electrical engineering and computer sciences from the University of California, Berkeley in 2017, before earning her master’s degree in computer science from The University of Texas at Austin two years later. \"We lost a loved and respected member of our team,\" a Google spokesperson tells PEOPLE in a statement. “We’re very saddened by this tragedy and our hearts are with their family and loved ones.” A memorial service will be held later for family and loved ones. Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories Now, Lin’s boyfriend and family are left to remember the young woman, who loved swing dancing, singing and being in nature, SFGate reported. “It was just unimaginable that something like this could occur,” said Hua, later adding, \"no words can describe the shock and grief we are all experiencing.\" Close Leave a Comment Read more: Human Interest Real People Real People Tragedy"
    },
    {
      "url": "https://people.com/23-year-old-man-hailed-ride-rocky-mountain-national-park-disappeared-11791502",
      "text": "23-Year-Old Man Hailed a Ride to Rocky Mountain National Park, Then He Disappeared Blake Kieckhafer was last seen on Thursday, August 7 By Jillian Frankel Jillian Frankel Jillian Frankel is a staff writer at PEOPLE covering current events. She previously worked as a producer and reporter for NBC News. People Editorial Guidelines Published on August 14, 2025 06:04PM EDT Leave a Comment Blake Kieckhafer, 23, was last seen alive on Thursday, August 7 at Rocky Mountain National Park. Credit : nps.gov NEED TO KNOW Blake Kieckhafer, 23, disappeared after taking a ride share service to Rocky Mountain National Park in Colorado, National Park Service officials sayHe was last seen on Thursday, August 7, when he was dropped off at the park by a ride share serviceHis family reported him missing on Monday, August 11 A 23-year-old man is missing after hailing a ride share service to Rocky Mountain National Park in Colorado, park officials say. Search efforts began after the family of Blake Kieckhafer, from Omaha, Nebraska, reported him missing to park rangers on Monday, August 11, a National Park Service spokesperson said in a statement on Tuesday, August 12. Our new app is here! Free, fun and full of exclusives. Scan to download now! Kieckhafer was last spotted in the Upper Beaver Meadows area of the park on Thursday, August 7 around 5:20 p.m. local time, when he was dropped off by the ride share service, the park spokesperson said. No updates have been shared since and park officials did not immediately respond to PEOPLE's request for comment. Related Stories N.C. Woman Found Alive 9 Months After She Went Missing with Her Car Abandoned Near Off-the-Grid Calif. Desert Community Man, 35, Goes Missing at Grand Canyon National Park, Leaving His Truck Behind in Trail Parking Lot Kieckhafer's brother Justin pleaded for information in a Facebook group post on Sunday, August 10, calling it a \"shot in the dark.\" He said Blake bought something at an O'Reilly Auto Parts shop and purchased a day pass to Rocky Mountain National Park that was scanned on Thursday evening, the day he was last seen. Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. Blake was last seen wearing a dark T-shirt, dark pants, and a dark baseball cap with no logo, according to park officials. He was carrying a small, maroon daypack and is about 5'11\" and 180 lbs. with short blond hair, a mustache and blue/green eyes. Officials are urging those with information about Kieckhafer's whereabouts to call the National Park Service Investigative Services Bureau Tip Line or submit a tip online or via email. Close Leave a Comment Read more: Human Interest Real People"
    }
  ],
  "argos_summary": "Authorities have recovered a body believed to be Blake Kieckhafer, a 23-year-old man who went missing after taking a ride share to Rocky Mountain National Park in Colorado on August 7. His remains were found above Emerald Lake, and the Larimer County Coroner's Office will confirm the identity. Search efforts began after his family reported him missing on August 11, with investigations focusing on the Emerald Lake area.",
  "argos_id": "45E6Z82FS"
}