{
  "url": "https://www.yahoo.com/news/articles/passenger-f-15-ride-along-234906561.html",
  "authorsByline": "Stephen Losey",
  "articleId": "5867db42659947cd9409f5862b0499a6",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/f2795a4f47a4fd99ff48a76e6433661156381fcc479b77cf2e99739d42c0981e/ynews/resizefill_w1200/https://media.zenfs.com/en/air_force_times_767/2ee806d4f10c1cc68dbfc3c152f132c2",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T23:49:06+00:00",
  "addDate": "2025-08-15T00:05:25.468714+00:00",
  "refreshDate": "2025-08-15T00:05:25.468715+00:00",
  "score": 1.0,
  "title": "Passenger on F-15 ride-along ejected on runway, video shows",
  "description": "Nothing was injured in the unexpected ejection, except perhaps the passenger's pride.",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nAn F-15D Eagle flight that was apparently intended to be a reward for hard work ended up not getting off the ground, when its passenger was ejected while the fighter was still on the flight line.\n\nThe video, posted Wednesday on the unofficial Air Force amn/nco/snco Facebook page, shows the immediate aftermath of the unusual on-the-ground ejection, as an F-15 from the 104th Fighter Wing at Barnes Air National Guard Base in Massachusetts slowly rolls down the flight line, away from a plume of smoke that was left behind by the ejection.\n\nThe unfortunate airman who seconds before was its passenger, who the video’s caption identifies as a recruiting officer for the wing, can be seen next to the flight line, seemingly struggling to his feet. Smoke left over from the ejection also trails out of the F-15’s rear seat.\n\nAccording to a report by The War Zone, the 104th said the ground mishap occurred Tuesday afternoon and prompted a 36-hour safety standdown of all flight operations, which has now ended.\n\nThere were apparently no injuries caused by the unexpected ejection, although one service member was sent to the hospital for an evaluation, the 104th said.\n\nThe incident is now being investigated, the 104th said.\n\nIncentive flights like Tuesday’s are regular occurrences, typically offered as a reward for service members who excelled at their job.\n\nOn-the-ground ejections, however, are rare — but not unheard of. In 2019, a civilian going on a fly-along with the French Air Force was ejected from a Rafale B fighter jet during takeoff, injuring his back but not causing more serious harm.\n\nAnd in December 2022, an F-35B pilot conducting a quality check on a new jet was forced to punch out of the jet at ground level when its engine failed in a dramatic and alarming way. Video of that crash showed the fighter hovering close to the ground and descending, then bouncing, tipping forward and spinning around with its nose and wing touching the ground before the ejection.\n\nThat incident led to a months-long delivery halt of new F-35s as engine manufacturer Pratt & Whitney looked for a way to fix the engine vibration problem that led to that crash.\n\nTuesday’s mishap at the 104th, however, seems to have primarily prompted jokes and memes on web pages such as amn/nco/snco. One video, captioned “The Simpsons predicted the future once again” and shared by the Facebook page Thursday shows the character Milhouse sitting in the cockpit of an F-15 at an air show, angrily pretending to conduct strafing runs and stabbing at the jet’s controls — until he hits the wrong button and sends his ejection seat flying through the air.",
  "medium": "Video",
  "links": [
    "https://www.facebook.com/groups/275310917589751/posts/1300616891725810/",
    "https://www.facebook.com/reel/4192170774392209",
    "https://www.defensenews.com/air/2022/12/27/pentagon-grounds-small-group-of-f-35s-after-ejection-on-texas-runway/",
    "https://www.militarytimes.com/off-duty/military-culture/2019/04/06/sacrebleu-civilian-accidentally-ejected-from-french-fighter-jet-during-fly-along/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "ground level",
      "weight": 0.07917052
    },
    {
      "name": "Incentive flights",
      "weight": 0.070514426
    },
    {
      "name": "Air Force",
      "weight": 0.06643493
    },
    {
      "name": "Barnes Air National Guard Base",
      "weight": 0.064757936
    },
    {
      "name": "engine manufacturer Pratt",
      "weight": 0.06427406
    },
    {
      "name": "104th",
      "weight": 0.06124319
    },
    {
      "name": "Video",
      "weight": 0.059849564
    },
    {
      "name": "video",
      "weight": 0.059849564
    },
    {
      "name": "service members",
      "weight": 0.05969713
    },
    {
      "name": "web pages",
      "weight": 0.059417125
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.7998046875
    },
    {
      "name": "/Travel & Transportation/Transportation/Air Travel",
      "score": 0.71044921875
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Aviation Industry",
      "score": 0.65966796875
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.42529296875
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.392578125
    }
  ],
  "sentiment": {
    "positive": 0.06480123,
    "negative": 0.68520844,
    "neutral": 0.24999031
  },
  "summary": "An F-15D Eagle flight from the 104th Fighter Wing at Barnes Air National Guard Base in Massachusetts ended up unofficially when its passenger was ejected from the plane while the fighter was still on the flight line. The incident, which occurred on the ground, was posted on the unofficial Air Force amn/nco/snco Facebook page and led to a 36-hour safety standdown of all flight operations. No injuries were reported, although one service member was taken to the hospital for evaluation. This incident is now under investigation. The mishap has led to jokes and memes on social media, with one video showing the ejected airman being identified as a recruiting officer for the wing.",
  "shortSummary": "A passenger on an F-15 ride-along was ejected on to the ground, prompting safety concerns and memes, while Yahoo uses AI to generate takeaways.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "3fe978089e0b4bebbd54457b9677f34f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.defensenews.com/air/2022/12/27/pentagon-grounds-small-group-of-f-35s-after-ejection-on-texas-runway/",
      "text": "Clarification: This story has been updated with more information on the organization investigating the Dec. 15 F-35B crash.\nWASHINGTON — The F-35 Joint Program Office has grounded a small number of newer F-35 Joint Strike Fighters in response to the Dec. 15 incident in which a hovering fighter crashed on a Texas runway and its pilot ejected.\nIn a statement to Defense News on Tuesday, the F-35 Joint Program Office confirmed it issued guidance as a result of the incident and that some higher-risk F-35s are grounded, at least until January. The JPO, which said the guidance was dated Tuesday, declined to specify how many F-35s are unable to fly.\n“The F-35 Joint Program Office has issued a Time Compliance Technical Directive (TCTD) to restrict some aircraft, which have been evaluated to be of higher risk, from flight operations while the investigation into the mishap on December 15 continues and until procedures can be developed for their return to flight,” the JPO said. “The affected aircraft have been identified, and the JPO will work with the [U.S. military] services and [international] partners to ensure compliance with the TCTD.”\nVideo of the dramatic F-35B crash earlier this month at Naval Air Station Joint Reserve Base Fort Worth, Texas, and its pilot’s successful on-the-ground ejection quickly went viral on social media.\nLockheed Martin builds the vast majority of F-35s at its facility in Fort Worth, and the company had not yet transferred this new F-35B to the U.S. government when the crash occurred. Pratt & Whitney makes the F135 propulsion systems that power all variants of the F-35.\nThe U.S. Air Force pilot, who was performing quality checks on the F-35B for the Defense Contract Management Agency, can be seen hovering the fighter not far above the ground in the crash video. The fighter descends, bounces off the ground and tips forward. Its nose and then right wing touch the ground, the fighter starts to spin around, and the pilot ejects.\nThe JPO would not say what caused the grounded F-35s to be deemed at a higher risk.\nA source familiar with the program, who spoke on the condition of anonymity because they were not authorized to discuss details of the incident, said the initial assessment of the investigation, which is being conducted by the Naval Air Systems Command with the support of the JPO, found that a propulsion system issue led to the Dec. 15 crash of the hovering F-35B, which has now led to broader groundings in the fleet.\nThe source said that, in guidance to the services, the JPO said a failure of a tube used to transfer high-pressure fuel in the fighter’s F135 engine prompted the office to update its safety risk assessments.\nThe JPO also told the services that jets with fewer than 40 hours of flying are affected, this source said.\nThe JPO declined to confirm that information.\nPratt & Whitney said in a statement to Defense News it could not comment on the Dec. 15 crash because it involves an ongoing investigation.\nIn its Tuesday statement to Defense News, the JPO said the groundings were put into place after a “preliminary assessment of the risk” and that it was taking steps it hoped would allow the directive to be modified sometime in January.\n“The safety of flight crews is the JPO’s primary concern,” the statement concluded.\nThough the JPO would not say exactly how many F-35s were grounded, it confirmed the grounded jets include all three variants. Some of those grounded F-35s are American fighters.\nThe news site Times of Israel on Sunday reported the Israeli Air Force had grounded 11 of its F-35s due to the incident, and that they would be checked for similar issues. Israel flies the F-35I, which is based on the F-35A.\nIn a statement to Defense News, Lockheed Martin said it is continuing to work with Navy officials in Fort Worth following the incident, and the company referred other questions on the groundings to the JPO.\nLockheed Martin said on its website it has so far delivered more than 875 F-35s to the U.S. military and the program’s partner nations.\nStephen Losey is the air warfare reporter for Defense News. He previously covered leadership and personnel issues at Air Force Times, and the Pentagon, special operations and air warfare at Military.com. He has traveled to the Middle East to cover U.S. Air Force operations."
    },
    {
      "url": "https://www.militarytimes.com/off-duty/military-culture/2019/04/06/sacrebleu-civilian-accidentally-ejected-from-french-fighter-jet-during-fly-along/",
      "text": "The privileged experience of a fly-along in a French Air Force Rafale B fighter jet went terribly wrong last month for one civilian who was shockingly ejected from the jet during a takeoff from Saint Dizier Air Base in northeastern France.\nThe unidentified 64-year-old passenger, who “does not belong to the [French] Ministry of Armed Forces,” sustained back injuries but was listed in stable condition after being taken to the hospital, according to Aerotime News Hub.\n“His health condition is not a cause for concern,” Col. Cyrille Duvivier, spokesman for the French Air Force, told Aerotime News.\nIn many cases, fly-along opportunities are extended to elected officials or those in the press to highlight capabilities of the aircraft, according to reports.\nBut aviation experts agree randomly firing passengers into the sky is typically not one of those capabilities.\nMultiple investigations into the March 21 incident were immediately opened to determine exactly what went awry, and France subsequently suspended all training flights for its fleet of Rafale jets.\nThat suspension, which didn’t affect operational flights, was lifted March 28, according to the Aviationist.\nPrior to the flight, the passenger was likely to have received a detailed briefing on all operational procedures, according to David Cenciotti of the Aviationist.\n“You are clearly explained what to touch and what you should not touch in the cockpit,\" Cenciotti wrote. \"The ejection seat handle is one of those things you should be aware of.”\nAerotime News echoed those sentiments, albeit bluntly, noting that the civilian’s injuries “can be attributed to a lack of preparation.\"\nHow one is supposed to prepare for being surprisingly catapulted into the air is unknown.\nIt remains unclear whether the error was the result of the passenger touching a “do not touch” apparatus, or if the jet simply found his company less than preferable and said “au revoir” to its guest.\nWherever the fault lies, nightmares ensued, and “Top Gun” fans everywhere were forced once more to relive the grim fate of Goose.\nGreat balls of fire.\nThe pilot, meanwhile, sustained minor injuries to his hands after the unscheduled ejection broke the canopy glass, but was able to land the aircraft shortly after the ejection.\nJ.D. Simkins is the executive editor of Military Times and Defense News, and a Marine Corps veteran of the Iraq War."
    }
  ],
  "argos_summary": "An F-15D Eagle from the 104th Fighter Wing experienced an unusual on-the-ground ejection incident, where a recruiting officer was ejected while the aircraft was stationary, prompting a safety standdown of flight operations. Fortunately, there were no serious injuries, although one service member was hospitalized for evaluation. The incident has sparked humor and memes online, contrasting with a recent F-35B crash that led to the grounding of several aircraft due to a propulsion system issue.",
  "argos_id": "4XWQZP46N"
}