{
  "url": "https://appleinsider.com/articles/25/08/14/ios-26-beta-6-gets-small-build-update-doesnt-bring-back-blood-oxygen-sensor",
  "authorsByline": "Wesley Hilliard",
  "articleId": "7aae625f9d7447769ac09047309afdb9",
  "source": {
    "domain": "appleinsider.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Cupertino",
      "coordinates": {
        "lat": 37.3228934,
        "lon": -122.0322895
      }
    }
  },
  "imageUrl": "https://photos5.appleinsider.com/gallery/64740-134868-iOS-26-xl.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:11:10+00:00",
  "addDate": "2025-08-14T19:18:29.993702+00:00",
  "refreshDate": "2025-08-14T19:18:29.993705+00:00",
  "score": 1.0,
  "title": "iOS 26 beta 6 gets small build update, doesn't bring back blood oxygen sensor",
  "description": "Apple released a small build update to iOS 26 developer beta 6, which does not re-enable the blood oxygen sensor on Apple Watch in spite of the earlier iOS 18.6.1 update that did.",
  "content": "Apple released a small build update to iOS 26 developer beta 6, which does not re-enable the blood oxygen sensor on Apple Watch in spite of the earlier iOS 18.6.1 update that did.\n\nApple has found a way to bring back the blood oxygen sensor to the Apple Watch via software without violating Masimo patents or an import block. The update went out via iOS 18.6.1 on Thursday, but Apple did not include the change via the iOS 26 developer beta release.\n\nThe new iOS 26 developer beta is still beta 6, but it has a slightly new build number — 23A5318f up from 23A5318c. Apple didn't share why it updated the build, and no notable changes have been discovered as of this publication.\n\nThe blood oxygen sensor has been present in Apple Watch models sold since a sales ban began in January 2024, but Apple has simply turned off the feature via software. Devices sold before January 18, 2024 in the United States never lost the feature.\n\nWhile the import ban remains in place, Apple has clearly found a way around the Masimo patents while being able to enable the blood oxygen sensor. However, users on the developer cycle haven't gotten the update just yet.\n\nThere is a chance that Apple has included the software workaround in the beta releases and could enable it via a backend push later. There have been no reports of the blood oxygen detector actually coming back online after the update.\n\nIf you're not on the beta train, then iOS 18.6.1 and watchOS 11.6.1 are available with the blood oxygen sensor update. Download updates via the Settings app, General, Software Update.",
  "medium": "Article",
  "links": [
    "https://appleinsider.com/inside/ios-18",
    "https://appleinsider.com/articles/24/01/18/apple-to-sell-apple-watch-with-blood-oxygen-detection-removed-to-bypass-itc-import-ban",
    "https://appleinsider.com/articles/25/08/14/apple-rolls-out-ios-1861-watchos-1161-with-restored-blood-oxygen-feature",
    "https://appleinsider.com/articles/24/01/15/us-customs-say-apple-watch-changes-are-enough-to-beat-itc-ban",
    "https://appleinsider.com/inside/ios-26",
    "https://appleinsider.com/inside/apple-watch",
    "https://appleinsider.com/inside/watchos-11"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "blood oxygen sensor",
      "weight": 0.14114319
    },
    {
      "name": "Apple Watch",
      "weight": 0.13566488
    },
    {
      "name": "Apple Watch models",
      "weight": 0.13137406
    },
    {
      "name": "Apple",
      "weight": 0.12311057
    },
    {
      "name": "small build update",
      "weight": 0.122353606
    },
    {
      "name": "the blood oxygen sensor update",
      "weight": 0.09660053
    },
    {
      "name": "updates",
      "weight": 0.09628979
    },
    {
      "name": "beta",
      "weight": 0.09254368
    },
    {
      "name": "iOS",
      "weight": 0.08797714
    },
    {
      "name": "The blood oxygen sensor",
      "weight": 0.08329832
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.833984375
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.82470703125
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.6513671875
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.344482421875
    }
  ],
  "sentiment": {
    "positive": 0.16840811,
    "negative": 0.2345333,
    "neutral": 0.59705865
  },
  "summary": "Apple has released a small build update to iOS 26 developer beta 6, which does not re-enable the blood oxygen sensor on its Apple Watch. This is in spite of the earlier iOS 18.6.1 update. The update was sent out via iOS18.1. However, Apple has found a way to bring back the sensor via software without violating Masimo patents or an import block. The new beta 6 has a slightly different build number and no notable changes have been discovered.",
  "shortSummary": "Apple released a small iOS 26 beta 6 update that does not include a blood oxygen sensor, allowing users to test the functionality without violating Masimo patents.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "73c3e5f93cd74686b3fadcaed14c0b98",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://appleinsider.com/inside/watchos-11",
      "text": "watchOS 11\nDeals\nAll about watchOS 11\nTable of Contents\nApple continues to polish the mature Apple Watch operating system by utilizing existing data points to provide more useful and actionable information. The Vitals app, Training Load metrics, and other similar features make up a significant portion of user-facing updates introduced in watchOS 11.\nIn addition to new metrics and data, Apple has added a few small updates to the UI. Since watchOS 10 introduced a significant redesign, Apple kept the overall OS changes minimal.\nThe limited display space and computing power of Apple Watch make watchOS a challenging platform to update consistently. Despite WWDC 2024 having a focus on Apple Intelligence, none of those features are coming to Apple Watch — at least not directly.\nWhile on-device AI interactions won't be possible, there is a chance that Apple will let users communicate with AI tools through their Apple Watch. However, such features have not been announced for watchOS 11.\nApple will reveal watchOS 12 during WWDC 2025 on June 9. It may have slight design changes that make it have elements similar to visionOS.\nwatchOS 11 features\nThere are a limited number of features coming to watchOS 11, and unlike other operating systems like macOS Sequoia, it doesn't benefit from inheriting everything coming to iOS 18. The most significant updates revolve around repackaging existing data points in a readable and actionable way that wasn't possible before, at least not without third-party apps.\nDespite extensive customization options coming to iOS, Apple continues to offer the same limited options for Apple Watch. There is an updated photo watch face feature with an interesting algorithm for producing good-looking images, but that's it.\nThe widget view now has access to Live Activities, the same ones that appear on the iPhone Dynamic Island. Developers don't need to do anything to support these new updating widgets.\nVitals app\nVitals is a new app introduced with watchOS 11 that allows users to measure important health metrics gathered during sleep. These metrics are compared to a baseline to determine when something is outside the expected range.\nMetrics gathered include:\n- Heart rate\n- Respiratory rate\n- Wrist temperature\n- Sleep duration\n- Blood oxygen\nIf two or more metrics fall out of their typical range, users are notified. Vitals will explain how elevation, alcohol, or illness could affect the out-of-range metrics.\nThe Vitals app and analysis rely on information developed from the Apple Heart and Movement Study.\nBlood oxygen detection is still turned off on new Apple Watches sold in the United States. No news of if or when the feature might return as the lawsuit with Masimo is still ongoing.\nPregnancy tracking\nIf a user logs an active pregnancy in the Health app, it will shift some aspects of the Health and Cycle Tracking apps to account for it. For example, the Cycle Tracking app will show the user's gestational age with an option to log symptoms.\nWhen people are pregnant, their heart rate increases, so Apple will prompt pregnant users to update their high heart rate notification threshold. That way, there is a reduced risk of false alarms.\nUsers can also be reminded to take monthly mental health assessments. Since depression and other conditions are higher risks during pregnancy, users can use the assessments to determine if more help is needed.\nWalking steadiness alerts are active during the third trimester of pregnancy.\nTraining Load\nWorkouts performed over a month will establish a baseline to determine a metric called Training Load. It determines the strain on the user's body from workouts performed over the previous seven days.\nTraining Load is determined by measuring the intensity and duration of workouts compared to the baseline. Apple wants the metric to provide a useful overview of the effectiveness of workouts over time.\nFor example, watchOS 11 could help users prepare for events like a 5K or bike race using Training Load. An effort rating after each workout is shown from 1 to 10 based on age, height, weight, GPS, heart rate, and elevation.\nManual entry is needed for strength training. Users can adjust the rating if they believe it misrepresents the intensity of the workout.\nThe 28-day training load is a weighted average. It is compared to a 7-day average to provide a rating of well below, below, steady, above, or well above. These indicate if the user is ramping up or slowing down their fitness regimen.\nRest days and Apple Fitness+ updates\nThe biggest finally of WWDC arrived during the watchOS 11 presentation. Users will be able to pause their streaks in case of sickness or rest days.\nA streak can be paused at any time for as long as is needed — a day, week, month, or any custom length. There are users who have streaks dating back to the original Apple Watch release that have had to abandon them in the event of being bedridden or injured in any way.\nThe Fitness app on iPhone is getting some customization options. Users can choose which metrics are shown in the rings displayed at the top of the app. Fitness will also provide new metrics for workouts like running, hiking, swimming, and mindfulness.\nApple Fitness+ has been redesigned with For You, Explore, and Library sections for curating content. Rather than seeing a pre-organized set of workouts, they will appear based on usage history and preferences for each tab.\nWatch faces\nDespite obvious demand, Apple still hasn't added a third-party watch face store. However, Apple did include an interesting new photos watch face that algorithmically finds the most suitable images in the user's library for watch face use.\nThere has been a slow shift in the past few watchOS releases that somewhat deemphasize the watch face. The Smart Stack has always-updating information and now Live Activities, for example.\nSince new watch faces are a motivation to upgrade to a new watchOS version, Apple may be holding out on new faces for a future release. There's also some chance that the rumored larger Apple Watch Series 10 might come with new optimized faces.\nwatchOS 11 release date and compatibility\nApple released watchOS 11 to the public after a beta period through the summer. It was released alongside iOS 18, iPadOS 18, macOS Sequoia, tvOS 18, and visionOS 2.\nCompatible devices:\n- Apple Watch Series 10\n- Apple Watch Series 9\n- Apple Watch Series 8\n- Apple Watch Series 7\n- Apple Watch Series 6\n- Apple Watch Ultra 2\n- Apple Watch Ultra\n- Apple Watch SE 2\nSupport for Apple Watch Series 4, Apple Watch Series 5, and the first-generation Apple Watch SE has been dropped with watchOS 11."
    },
    {
      "url": "https://appleinsider.com/articles/24/01/15/us-customs-say-apple-watch-changes-are-enough-to-beat-itc-ban",
      "text": "Apple's software fix to disable a blood oxygen sensing feature in the Apple Watch could be enough to thwart the ITC import ban, U.S. Customs and Border Protection has determined.\nThe Apple Watch Series 9 and Apple Watch Ultra 2, among other models, are the subjects of a currently-stayed ITC import ban brought about by a Masimo patent infringement complaint. However, it seems that Apple's attempt to work around the ban with changes is enough for U.S. Customs to allow imports to continue.\nA Monday Federal Circuit filing from Masimo refers to a January 12 decision by the Exclusion Order Enforcement Branch of U.S. Customs and Border Protection. The filing, spotted by 9to5Mac, explains that the branch has \"decided that Apple's redesign falls outside the scope of the remedial orders in the ITC investigation underlying Apple's appeal.\"\nAs part of the request, Apple claimed \"its Redesigned Watch products definitely (1) do not contain pulse oximetry functionality,\" the Masimo filing quotes.\nHowever, since Apple maintained that some of the information in the proceeding is confidential, Masimo didn't provide a copy of the decision in the filing. No public release of the filing exists either.\nUltimately, Masimo's attorneys explain, the \"EOE Branch decision finding the redesign outside the scope of the remedial orders would eliminate any irreparable harm alleged by Apple.\"\nMinimal sales impact\nAt face value, the discussion by Masimo in the filing indicates that Apple has done something to the Apple Watch to mean the claims of patent infringement no longer apply, at least in the eyes of U.S. Customs and Border Protection.\nHowever, it isn't explained what has changed. The discussion of a \"redesign\" could mean physical changes to the hardware, but that would require extensive work and resource consumption to perform in a short timeframe.\nThe more likely result is Apple's rumored software update, which it submitted to Customs for investigation in late December. Again, while there isn't explicit detail on what the update does, it is likely to simply disable the blood oxygen features.\nTo consumers, who can still buy a current-gen Apple Watch in the United States since the ITC ban is stayed for the moment, the decision won't immediately change things. Existing stocks of Apple Watch units in the country that have the feature enabled will continue to do so.\nWhat it will affect are units imported into the United States. At that point, Apple will theoretically be selling the Apple Watch with the relevant features disabled.\nApple is highly likely to comment on the situation before it occurs."
    },
    {
      "url": "https://appleinsider.com/inside/ios-26",
      "text": "iOS 26\nAll about iOS 26\nTable of Contents\nApple has redesigned its entire ecosystem and unified the naming based on the year. So, now we have iOS 26 with a Liquid Glass design that makes everything reflective and bubbly in an attempt to emulate visionOS.\nThe redesign was spread across the ecosystem, but iOS 26 was impacted the most. The Home Screen, Control Center, and other aspects show off the design almost constantly.\nThere were a lot of smaller announcements, especially around app functionality. Apple has spent the last several WWDCs focusing on features that promote communication and customization, and 2025 was no different.\niOS 26 design\nThat new design changes a lot of how iOS looks and feels, but you'll still see a Lock Screen, swipe up to view a Home Screen, and swipe over to see the App Library. Imagine it's like replacing a brick building with an identical one made of glass — the core layout is the same, but how it looks affects how it works to an extent.\nMany of the modals, menus, and toolbars were rethought to ensure that controls are always near where you last tapped. They've got a sleek new glassy layer, but the buttons work the same.\nThe redesign yielded some interesting interaction changes as well, like how the Safari address bar shrinks when scrolling. There's also a lot more disappearing elements that gets out of the way intelligently.\nApple has been changing how much the Liquid Glass material is used across the ecosystem during the betas. It is still applied quite heavily in some areas, but others have been adjusted to help with legibility.\nBeyond the iOS 26 redesign, there are plenty of new features across the system.\niOS 26 features\nApple didn't introduce a redesign and stop the keynote. There are several updates, including new Apple Intelligence features, changes to Messages, and a new Apple Games app.\nOne of the more useful features revealed during the keynote is the two new call features.\nCall Screening will automatically answer unknown numbers and ask for their information before ringing the phone and showing the user a transcript. That gives the user a chance to determine if the call is legitimate or spam before accepting or declining.\nAnother call feature is Hold Assist. It allows users to essentially \"hang up\" when put on hold while the call remains active and the user is notified when a human operator picks up the phone.\nA new app coming to iPhone, iPad, and Mac with the OS 26 releases is the Games app. It acts as a central hub for launching games, discovery, and social features for games.\nUsers can easily launch the Games app by pressing the \"Home\" button on any connected controller — as long as that button isn't already mapped like on the Backbone One. It can also be launched using an automation and Game Focus.\nApple designed the Games app to work in portrait or landscape so it could easily be navigated with a controller. Connect with friends, view achievements, join multiplayer games, and create new challenges all within the app.\nSome feature highlights in iOS 26:\n- Updated Phone app with unified layout\n- Call Screening helps prevent inadvertently answering spam calls\n- Hold Assist lets users put away their phone until an agent is available\n- Messages gets new filters with spam screening\n- Live Translation across the system, like in Messages, FaceTime, and Apple Music\n- Apple Intelligence comes to Shortcuts\n- Visual Intelligence is part of the screenshot tool\n- Image Playground and Genmoji get new styles and ChatGPT support\n- Apple Intelligence seeks out package tracking in Mail to add to Wallet\n- Reminders gains Apple Intelligence suggestions and sorting\n- CarPlay is updated with the Liquid Glass design\n- Apple Games app adds discovery and social tools to one central location\n- Safari is redesigned with a floating, rounded tab layout\n- Messages gains backgrounds, polls, and group chat typing indicators\n- Users can create multiple journals in the Journal app\n- Photos gets more customization, new tab design with Liquid Glass\n- FaceTime gets a new landing page with Contact Posters\n- Notes gains import and export of Markdown files\n- Passwords gets a history view to access old passwords\niPhone users have had increased anxiety over battery life and health ever since the so-called batterygate situation with old batteries and peak power throttling in iOS 10. Apple has answered this anxiety with a comprehensive battery management system within Settings that has been upgraded on a regular basis.\nThe latest updates include a new \"time to 80%\" indicator on the Lock Screen above the clock and a new adaptive power setting. The adaptive power mode uses additional optimizations to manage charging and features like Low Power Mode in relation to how the device is used.\nThe WWDC keynote has barely concluded, and there are a lot of details to uncover about all of Apple's latest operating systems. Stay tuned for more details on this page for iOS 26.\nEverything below this point has been preserved for historical purposes. It was written before WWDC 2025 and addresses the rumors and expectations around the new iOS update.\nNo, iOS 26 isn't an operating system Apple will announce in seven years, it is potentially the new name for what's being announced in 2025. The naming convention change is going to apply across the board, so iPadOS 26, macOS 26, visionOS 26, tvOS 26, and watchOS 26.\nIf you've been keeping up with rumors about iOS 19, this is that same OS update. Apple is still expected to reveal a redesigned ecosystem around the visionOS paradigm, more AI tools, and new features to match.\nSo yes, that video above covering iOS 19 is still accurate if you swap every mention of iOS 19 for iOS 26. We'll get into the rumors for this operating system in a moment, but first, let's dive into Apple's naming conventions.\niOS 26: what's in a name?\nOf course, it fundamentally doesn't matter what Apple calls its next iOS release. In fact, it doesn't really need to call it anything publicly other than \"iOS.\"\nThe number slapped onto the end of the operating system name serves a purpose distinguishing between releases, but Apple turned it into a piece of marketing. However, it never seemed to stick, and iPhone users barely recognized that they were running something called iOS, let alone which number it was.\nCurrent operating system versions:\nThere is a need for versioning, but with annual releases, it makes sense to address each operating system by a year. Though, there is some question behind Apple's reasoning behind calling it iOS 26 in 2025, and the answer is still tied to marketing.\nWhen car manufacturers announce their new vehicles in the first half of the year, they don't call them by the year they are announced. That's because by the time the vehicle launches to the masses, there's very little time left in the year, and once the calendar year rolls over, that car now sounds outdated.\nThe same thinking can be applied to the iOS 26 naming convention. It will release to the public about a week before October 2025, so that leaves only three months of the year it'll be the \"wrong year,\" followed by nine months of iOS 26 being the current release in 2026.\nAnother marketing angle could be applied to how Apple releases updates to the public. The initial launch of iOS 26 will show up as an optional update for a few weeks, then shift to being the only one available as iOS 18 is phased out.\nIn 2026, when users are on iOS 26, the iOS 27 release will be shown as an optional update as well. In that case, it'll appear more like you're getting access to a future version of iOS early and could help drive adoption.\nRegardless, it's still the same operating system with the same design and features. The naming convention shift aligns with the rumored redesign, so it makes sense for Apple to pull the trigger now.\niOS 26 redesign\nRumors indicate that Apple will be performing a significant redesign across its ecosystem to better unify the look and feel of its software. The unification is said to be around visionOS, which has a transparent, glassy, bubbly look compared to the other operating systems.\nEarly leaks around the redesign have been called insufficient. Mockups showed glossy elements with edge-lit glass-like textures in some apps and on Home Screen icons, but the rest of the system seemed relatively unchanged.\nIf Apple's redesign is as significant as rumors seem to suggest, it'll be one of the biggest redesigns since the move away from skeuomorphism with iOS 7. Love it or hate it, Apple seems set on making visionOS the future of its ecosystem.\nThe redesign isn't limited to iOS 26 either. It is expected to affect the design, to some extent, across every operating system.\nThe Home Screen could be where one of the biggest changes occurs, since Apple's squircle icons are, well, iconic. Apple Vision Pro has a Home View with circular icons, but apparently Apple isn't going that far. Instead, the icons will be slightly more rounded, but still squircle in shape.\nOther renders show various menus and buttons with shiny, glassy textures that likely reflect light based on the device’s accelerometer. Menus and modal windows also take on a more transparent design as well.\nApple Intelligence in iOS 26\nApple Intelligence could take a back seat during WWDC 2025. Some rumors even suggest that Apple could put off announcing new features for its AI initiative until later in the year while focusing on OS updates.\nHowever, given the scrutiny on Apple for how it has handled its AI rollout so far, it seems highly unlikely that the keynote will go by without making it a central focus of its strategy.\nNearly every feature announced for iOS 18 was released in 2024 and early 2025, except perhaps the most important one. The new app intents system that provides on-screen and contextual data to Apple Intelligence and Siri was going to supercharge Apple's on-device AI efforts, but it never arrived.\nApple seemingly had to push the feature back to iOS 26 in order to try and account for hallucinations related to using LLM-based technology. If Apple was going to pull off such a feature, the error rate had to be slim, if not none.\nDevelopers have been able to target the app intents since iOS 18.2, so there could be broad support baked in by the time the feature rolls out. It is expected that Apple will show off the feature again during WWDC 2025 and release it in the fall.\nAnother rumor around Apple's AI efforts centers around developer APIs. Right now, developers can implement parts of Apple's tools into their apps, like Image Playground or Writing Tools, but they can't utilize the models themselves for custom features.\nThat could change in iOS 26. The combination of access to on-device models and contextually aware Apple Intelligence could help Apple leapfrog back into the AI race. It is the only company building the technology with privacy and security in mind, which could give it an advantage.\nApple Health AI\nOne of Apple's new Apple Intelligence features could be an \"AI doctor\" that lives in Apple Health. While the rumor calls it a doctor, it will likely be closer to what you'd call a health coach for regulatory purposes.\nThe Apple Health app is a massive repository for data that isn't exactly human-parseable. Sure, it has the ability to show trends and recent data, but it's not all that useful unless you know what to look for.\nInstead, Apple's AI tool could allow users to ask questions about their data or have conversations about their health choices. The Apple Health AI would be able to better correlate and explain items, like less sleep occurring when alcohol is consumed or weight gain after too many sodas.\nThe feature could also tie into Apple's Fitness+ program by connecting health data points to fitness plans. If a user’s age, weight, medication, diet, sleep, and more can be taken into account, it could mean getting much more personalized workout recommendations.\nRebooting Siri as an LLM\nApple is rumored to be working on rebuilding Siri's backend to be run by an LLM instead of more basic machine learning. It could mean having an advanced AI chatbot built into the operating system that goes way beyond simple commands and questions.\nBasically, take every rumored feature of Apple Intelligence and roll it in with an on-device assistant capable of taking advantage of it all. It would mean a significant upgrade to Siri and its capabilities.\nThe LLM-based Siri with access to what's being shown on the display, donated data via the app intent system, and other on-device data would be highly tuned into the user and its needs. A lot of the potential functionality depends on how well Apple can execute on AI the second time around.\nSuch a significant overhaul won't be simple. Rumors place it at iOS 26.4 before becoming available. That is if it even makes it to iOS 26.\nWith feature delays already plaguing iOS 18, there's going to be a difficult road ahead for Apple's AI plans. However, changes in leadership around AI and Siri may help push things forward.\niOS 26 accessibility updates\nApple has made it a habit to announce accessibility features for upcoming operating systems ahead of WWDC. There's nothing here hinting at an operating system redesign, but there are a lot of great quality-of-life updates for users that need them.\nThe new features include:\n- Accessibility Nutrition Labels on the App Store\n- Magnifier for Mac\n- Braille Access\n- Accessibility Reader\n- Live captions on Apple Watch\n- Live Recognition in Apple Vision Pro\nAccessibility Nutrition Labels give users an overview of what features are compatible with a given app in the App Store. It could help push some apps to adopt features in order to help promote them as accessible apps.\nBraille access is a big update, bringing support for Braille across the system like taking notes or transcribing conversations. Braille Access also works as an app launcher and Braille Ready Format file support.\nAccessibility Reader lets users adjust font size, color, spacing, and other settings. It is available within any app, including the Magnifier app.\nMore features are coming to Apple Watch and Apple Vision Pro as well. Plus, Apple plans to update existing features.\n- Eye Tracking on iPhone and iPad\n- Head Tracking to control devices with head movements\n- Switch Control for Brain Computer Interfaces\n- Assistive Access for the Apple TV app\n- Customizable Music Haptics on iPhone\n- Sound Recognition gains Name Recognition\n- Voice Control for Xcode\n- New languages in Live Captions\n- Large Text in CarPlay\nThe features are expected as a part of iOS, macOS, visionOS, tvOS, and watchOS in 2025. They could arrive in the initial release or in a point one or two update before the end of 2025.\niOS 26 release date\nApple is expected to release iOS 26 to the public in September 2025 after the iPhone 17 lineup is revealed. The beta for iOS 26 will begin in June immediately after the WWDC keynote.\nEvery device that supports iOS 18 is expected to maintain support for iOS 26. Those are:\n- iPhone 17, 17 Air, 17 Pro, 17 Pro Max (2025)\n- iPhone 16e, iPhone 16, 16 Plus, 16 Pro, 16 Pro Max (2024)\n- iPhone 15, 15 Plus, 15 Pro, 15 Pro Max (2023)\n- iPhone 14, 14 Plus, 14 Pro, 14 Pro Max, iPhone SE (3rd gen) (2022)\n- iPhone 13, 13 Mini, 13 Pro, 13 Pro Max (2021)\n- iPhone 12, 12 Mini, 12 Pro, 12 Pro Max, iPhone SE (2nd gen) (2020)\n- iPhone 11, 11 Pro, 11 Pro Max (2019)\n- iPhone XS, iPhone XS Max, iPhone XR (2018)"
    },
    {
      "url": "https://appleinsider.com/articles/25/08/14/apple-rolls-out-ios-1861-watchos-1161-with-restored-blood-oxygen-feature",
      "text": "If you didn't have it already, blood oxygen sensing is again available to U.S. users with the rollout of iOS 18.6.1 and watchOS 11.6.1.\nOn Thursday, Apple announced that it would be bringing the much-missed Blood Oxygen feature to Apple Watch Series 9, Apple Watch Series 10, and Apple Watch Ultra 2 via a pair of updates to both iPhone and Apple Watch. Those updates are now available to download for affected users' devices.\nApple hasn't disclosed what was done to resolve its patent dispute, and probably won't say anything else about it. It did say that the move was \"enabled by a recent U.S. Customs ruling.\"\nOnce a user updates both devices, sensor data from the Blood Oxygen app on Apple Watch will be measured and calculated on the paired iPhone. Results are viewable within the Respiratory section of the Apple Health app.\nThe years-long battle began all the way back in 2020 when Masimo alleged Apple stole trade secrets and infringed ten patents used in the Apple Watch's health tracking features. Masimo also accused Apple of poaching staff and using confidential technology without proper credit.\nApple disabled the feature via software to keep selling the Apple Watch in the United States during the appeal process. The feature had been absent from Apple's flagship wearable for more than 18 months.\nThe release of iOS 18.6.1 has build number 22G90. The update's release notes are brief.\nThis update provides a new Blood Oxygen experience for users in the United States with Apple Watch Series 9 and Series 10, and Apple Watch Ultra 2. Measurements are calculated on iPhone and viewed in the Health app.\nHow to update to watchOS 11.6.1\n- Ensure the Apple Watch is charged to at least 50% and connected to Wi-Fi\n- On your Apple Watch, open the Settings app\n- Tap General\n- Tap Software Update\n- Tap Install if a software update is available\n- Follow the on-screen instructions\nHow to update to watchOS 11.6.1 via iPhone\n- Ensure your watch is charged to 50% and connected to Wi-Fi\n- On your iPhone, open the Apple Watch app\n- Tap General\n- Tap Software Update\n- Tap the update if it is available\n- Follow the on-screen instructions\nHow to update to iOS 18.6.1\n- On your iPhone, open the Settings app\n- Tap General\n- Tap Software Update\n- Tap the update to install\n- When prompted, follow the on-screen instructions\nThis update does not apply to Apple Watch devices sold outside of the U.S. or those purchased and activated before the initial ban."
    },
    {
      "url": "https://appleinsider.com/inside/ios-18",
      "text": "iOS 18\nAll about iOS 18\nTable of Contents\nApple revealed iOS 18 during WWDC on June 10, 2024. The new iOS is packed with updates for every iPhone that supports the release, plus exclusive Apple Intelligence features for iPhone 15 Pro and the entire iPhone 16 lineup.\nAll eyes may have been on Apple's AI efforts, but those were held for iOS 18.1 and only for a limited number of users. The more significant updates for most users center on customization, privacy controls, and new cross-app functionality.\nEverything new in iOS 18:\n- Free placement of icons and widgets on the Home Screen within the pre-set grid\n- Dark mode icons and tinted icons for more uniform Home Screen styling\n- Lock Screen buttons for Flashlight and Camera can be replaced with other apps and shortcuts\n- Control Center gets pages, customized layouts, and third-party app access\n- Photos app is redesigned with a unified view, custom layout, and more\n- Messages has new text effects, RCS support, and emoji tapbacks\n- Mail will get new sorting options later in 2024\n- Safari has Highlights that show page summaries, Maps locations, or Apple Music links\n- An all-new Passwords app\n- Lock or hide apps\nThese features are launching across all compatible iPhones. However, Apple did reserve Apple Intelligence for devices running A17 Pro and later, meaning iPhone 15 Pro, iPhone 15 Pro Max, and all iPhone 16 models.\nApple revealed iOS 26 during WWDC 2025, which features a full redesign using Liquid Glass, additional Apple Intelligence features, and improvements to social apps. It is a big shift that relies heavily on the processing power of modern iPhone chips that will be hard for competitors to replicate.\nMore customization\nA significant portion of the iOS 18 portion of WWDC was centered around user customization. The Home Screen, Lock Screen, Control Center, and even some apps like Photos all have customization options.\nThe iPhone Home Screen has been a structured grid of icons since the device's inception. That hasn't changed beyond adding widgets, but now users can leave blank spaces in the grid for even more custom screens.\nUsers that spend time theming their Home Screen with different colors and icons will be happy to hear that it is easier than ever. Icons can be set to a dark mode, including Apple's, so they have a dark background and colorful icon.\nIf a color tint is desired, it can be applied to the dark mode icons and widgets so that everything has a color overlay. Developers can submit special layered icons to ensure the effect is pleasant when applied.\nThe Lock Screen buttons for flashlight and camera can be replaced with different app launchers, Shortcuts, and other system features. It even works on a per-Focus basis.\nThe biggest change to customization occurred in Control Center. Users can now freely place icons on up to 10 pages of Control Center.\nThese buttons can be a 1x1 square or expand to take up an entire page, like the Music button. Home controls, device controls, and even third-party app functions can be added to Control Center.\nMessages upgrades & RCS\nApple is finally adopting RCS, which means sending text messages to Android users will see a vast improvement. The Rich Communication Services standard works over the internet instead of older phone signals still used by SMS.\nWhen Apple users communicated using SMS, it meant downgrading photos and videos to tiny pixelated media suitable for the old-school communication standard. With RCS, full-sized images and video with HDR can be sent over the network.\nRCS also means users will be able to have more rich group chats, see typing indicators, and have access to cross-platform message reactions.\nApple also introduced new Messages features like text formatting, per-word animations, and an option to schedule messages called Send Later. Images and emoji will be able to be generated using Image Playground as well.\nApple Intelligence\nApple Intelligence uses on device models to offer things like Writing Tools, which can proofread text and offer different styles to make it sound more professional. In some cases, the user can hand requests off device to Private Cloud Compute servers for privacy-preserving Apple LLMs or optionally to ChatGPT.\nThere's also Image Playground, which can be used to generate emoji for use in Messages. Images can also be generated, but on a limited basis with animated themes.\nSiri is also being given a big upgrade thanks to Apple Intelligence. On-device command processing will be much better, even when the user stumbles over a command or makes a mistake.\nHowever, it appears that Apple will delay the release of the new Siri by several months. The significant undertaking of changing how Siri works for billions of daily requests will take until later in 2025 in an iOS 19 release.\nDevelopers will have to build support for Apple Intelligence, but Apple has made it straightforward by tying the features to existing app intent structures. While there are already new Siri features in beta, the full version with app intent tie ins will take time.\nApps with Apple Intelligence Siri support coming:\n- Books\n- Calendar\n- Camera\n- Contacts\n- Files\n- Freeform\n- Keynote\n- Magnifier\n- News\n- Notes\n- Photos\n- Reminders\n- Safari\n- Stocks\n- Settings\n- Voice Memos\nThe initial launch of Apple Intelligence took place with iOS 18.1 and it included Writing Tools, system wide summaries, and Photos Clean Up. More features are arriving with each point update.\nThe new app intent system that will let Siri have on-screen context for commands is expected to fully launch sometime in 2025. Apple has already asked developers to begin work on the new feature in iOS 18.2.\nPhotos Clean Up\nThe AI powered object removal feature in Photos arrived in a beta of iOS 18.1. It works similarly to third-party apps with repair tools or Google's Magic Eraser, but it runs on Apple Intelligence, on device.\nUsers that want to use the feature in iOS 18.1 will see a small eraser icon in the photo editor. The first time this is tapped, it will download the tool.\nPhotos with easily removed objects or other removal suggestions will show up with rainbow-colored and shiny material on top. Tapping these objects will automatically remove the highlighted region.\nOtherwise, objects can be removed by drawing a circle around an object or coloring in the object. The AI will attempt to understand what the image should look like without the removed item, then rebuild the area to some effect.\nResults vary based on the size of the object and what surrounds it. Complex backgrounds or ones without a reference to what should be behind what you're removing may result in a bad outcome.\niOS 18.2\nThe second wave of Apple Intelligence features included ChatGPT integration, Visual Intelligence for iPhone 16, and Image Playground. The other previously released tools also got a few updates with iOS 18.2.\nSiri can pass information provided by the user to ChatGPT privately and securely. Simply ask Siri to do so in the prompt when speaking or typing to Siri.\nVisual Intelligence also has a tie in to ChatGPT by giving users the ability to send data to ChatGPT directly from the camera. Another option exists to send camera output to Google reverse image search.\nImage Playground is a big part of the release, if a bit odd for Apple. The images generated can be made from text prompts or photos from the user's library.\nGenmoji is an offshoot of Image Playground and it gives users the ability to create an emoji by describing it. It appears as a new button on the keyboard when in the emoji picker.\niOS 18.3 launched in January 2025 with no new user-facing features. Apple did address concerns with notification summaries by making them italicized and removing news apps from the feature.\niOS 18.4\nApple released iOS 18.4 to the public on March 31, 2025 with a handful of user-facing features. Apple Intelligence was meant to get an upgrade that added more context through app intents, but it was delayed into the next year.\nApple News+ users get a new food and recipes section, Apple Intelligence gets Priority Notificaitons, and there are several new Shortcuts actions. There's also a handful of new emoji that will help drive adoption of the update.\niOS 18.5 & iOS 18.6\niOS 18.5 didn't have any user-facing features beyond a new opt-in system for on-device Apple Intelligence training. Users that opt into providing device analytics to Apple will also provide polling results that help train AI while preserving user privacy via Differential Privacy.\niOS 18.6 was a bug fix update and may be the last major update before iOS 26 launches in September.\niOS 18 release date\nApple released iOS 18 to the public on September 16, 2024. While the initial update contained all of the new customization options, the Apple Intelligence features didn't arrive until iOS 18.1, and ChatGPT, Genmoji, and Visiual Intelligence arrived in iOS 18.2.\nEverything below this point was written before WWDC 2024 and contains rumors and speculation surrounding the release. It will remain in this page for reference.\niOS 18 rumor cycle\nIt's no secret, Apple is going to have a big artificial intelligence focus in 2024 starting with WWDC. Every operating system, including iOS 18, will have AI features throughout, and some information about these rumored features has already been leaked.\nApple will focus on privacy and security with its on-device AI tools. Some rumors indicate Apple may be looking into server-side AI, but that may not be ready for iOS 18.\nFeatures will focus on small models that run without connecting to the internet unless necessary. Tools in Safari, Notes, the and Messages app will enhance basic interactions.\nOther features will likely be announced and updated, like more widget options, customization tools, and changes to HomeKit.\nThe following information has been obtained from anonymous people familiar with Apple's plans for iOS 18 or from other leaks and rumors that have been reported.\nPrivacy is paramount\nApple sees privacy as a fundamental human right. So, expect the company's AI strategy for iOS 18 to have a central theme around privacy and data control.\nExisting tools that use large language models (LLM) or generative AI tend to rely on sucking up a lot of information freely available on the web or consumer's device. These data sets and the prompts provided by users are used to continue training the models, which leads to privacy concerns.\nApple is expected to focus on training the models separate from the user's devices and data. When a model is used, it will use data available on the device to make decisions, but that user data will remain on the device and not become part of the larger model.\nThere has been some discussion of Apple offering paid access to LLMs made by other companies, but these would come with a warning about data privacy. An AI-focused App Store could be introduced.\nSiri and Spotlight with generative AI\nAn Apple-made algorithm codenamed Ajax has been rumored to have generative AI capabilities in iOS 18. It could be used to provide improved responses from Siri, Spotlight, and other system-level search tools like those in Messages.\nAjax will be able to learn from user data found in Files, Contacts, Messages, and apps exposed to Spotlight to quickly find specific content buried deep across the system and provide summaries or direct links. The on-device model will be able to generate responses to queries about user data without an internet connection.\nApple isn't looking to introduce chatbot capabilities, so don't expect ChatGPT-like interactions with Siri. However, the search tools will be able to do more than the \"result from Wikipedia\" that frustrates many users today.\nThe generative AI assistant could help with texting by providing summaries of conversations. For example, if you've been away from a group chat and return to find hundreds of unread messages, Ajax could tell you what you missed in a quick summary.\nIntelligent Browsing\nNot much is known about Intelligent Browsing just yet other than the option exists. It appears to rely, in part, on Apple's generative AI called Ajax.\nThe user will have to enable Intelligent Browsing in iOS 18 manually. It will then be able to provide information as the user is browsing, like webpage summaries or image search tools.\nThe image search functionality is in the works, but it may not make it for the iOS 18 release day. It apparently builds on the Visual Lookup feature in Photos and will enable users to perform actions on photos found on the web.\nAnother new tool is coming to Safari, but it isn't clear if it will have AI-focused capabilities. It is a tool called Web Eraser, and it can remove elements of a page by tapping them.\nPhotos Clean Up\nAnother Apple AI feature in iOS 18 will be focused on photo retouching. Clean Up will be able to remove objects from a photo using generative AI.\nThe feature will differ from conventional repair and removal tools, which rely on machine learning to determine how to remove an object. Generative AI will be able to better understand what is in a photo and what should be behind an object for more accurate object removal and photo retouching.\nApple could introduce other features like generative fill, but it isn't clear if that will arrive when iOS 18 debuts. The Photos app on Mac already has a repair tool, and it appears that Clean Up replaces that entirely.\nVoice transcription and summary\nThe Notes app will be getting Voice Memos integration, and both applications are getting AI capabilities. The on-device AI in iOS 18 will be able to take a Voice Memo, provide a voice memo transcription that is searchable, and generate a summary.\nUsers will be able to open the Notes app and start an audio recording while taking notes simultaneously. The feature is available in third-party apps already, but Apple's melding of Voice Memos and Notes may Sherlock those.\nOnce a recording has been completed, users will be able to ask questions about the content of the recording. For example, if you missed a specific part of a lecture, ask for when that topic occurred and a summary of it.\nApple Music Passthrough and Smart Transitions\nA new feature called \"Smart Transitions\" is expected to replace or enhance the existing crossfade function. It would use an understanding of the current song and upcoming song to determine how to best transition between them.\nThe existing crossfade function works the same as it always has — it simply starts playing a song a few seconds before the previous song ends.\nAnother feature called Passthrough is coming, though nothing is known about the feature beyond appearing as a setting in Apple Music and QuickTime. It seems to be associated with Dolby Atmos.\nMerging apps\nA pattern has emerged from various insider details about iOS 18 — cross-app functionality is spreading. The Calculator is going to appear in Notes, the Calendar app will have a Reminders view, and Voice Memo recordings will also get added to Notes.\nIt isn't clear if these are the only new integrations coming with the updated operating system, but it shows how Apple's first-party apps continue to evolve. Being able to take notes with an intelligent calculator function could Sherlock some of the popular notes-meets-math apps like Soulver.\nThe Calendar and Reminders integration won't be as in-depth as apps like Fantastical, but having a universal view of all tasks could be enough to bring more people into Apple's free apps. Sherlocking doesn't always have to do with being the best option, it can happen by being the good-enough default.\nBy integrating different functionality across the operating system, Apple may push more users to fall back to first-party apps. If a user can't pick the default calculator, for example, they're more likely to default to Apple's apps. Apps like Apple Music and Safari have come under antitrust scrutiny for similar system-level Apple-only functionality.\nUI changes throughout iOS 18\nThere are several rumors around how Apple might tweak the look and feel of iOS, but nothing is certain yet. The Settings app could be rearranged completely with prioritization of certain elements and new groupings based on functionality.\nThe Home Screen could get another change that allows free placement of icons and widgets. Apple has locked users to a grid that must be filled in top to bottom, leading to users coming up with clever design techniques like blank icons.\nWhile apps have been able to offer alternative app icons for years, there could be even further customization options soon. Users can already build a Shortcut with a custom icon that launches an app, but doing so removes basic functionality from the launcher like long press quick actions. Enabling customers to choose any image for app icons would be a significant change.\nOne exploit found the ability to animate icons, which could add yet another element of customization. While icons animating continuously might create chaos, Apple could choose a more stable route. Apps like Calendar and Clock are able to show accurate information by updating regularly, so such a feature could finally come to third-party icons.\niOS 18 release date\nApple will reveal iOS 18 during WWDC, which is being held June 10, 2024. It will be announced alongside iPadOS 18, tvOS 18, watchOS 11, macOS 15, and visionOS 2.\nAfter a brief beta period over the summer, Apple will release iOS 18 to the public shortly after the iPhone 16 launch in September."
    },
    {
      "url": "https://appleinsider.com/articles/24/01/18/apple-to-sell-apple-watch-with-blood-oxygen-detection-removed-to-bypass-itc-import-ban",
      "text": "After Apple's failed bid to keep selling Apple Watch models with blood oxygen detection during an appeal process, the company will simply sell the affected models with the feature removed.\nMasimo and Apple are locked in a legal battle over an alleged patent violation for blood oxygen detection. The International Trade Commission (ITC) recommended an import ban on affected devices, which Apple has failed repeatedly to have stayed during appeals processes.\nAs a result, the Apple Watch Series 9 and Apple Watch Ultra 2 are meant to be removed from sale on January 18 if unchanged. However, Apple has models ready to sell without blood oxygen detection, which passed Customs and is allowed to be sold despite the import ban.\nApple shared a statement with media outlets seen by AppleInsider explaining the situation.\n\"Apple's appeal is ongoing, and we believe the US Court of Appeals for the Federal Circuit should reverse the USITC's decision. We strongly disagree with the USITC decision and resulting orders.\nPending the appeal, Apple is taking steps to comply with the ruling while ensuring customers have access to Apple Watch with limited disruption. These steps include introducing a version of Apple Watch Series 9 and Apple Watch Ultra 2 in the United States without the Blood Oxygen feature. There is no impact to Apple Watch units previously purchased that include the Blood Oxygen feature.\nApple Watch Series 9 and Apple Watch Ultra 2 without the Blood Oxygen feature will become available from apple.com starting 6am PT on January 18, and from Apple Stores starting January 18.\"\nAnyone who purchased an Apple Watch before January 18 will have functioning blood oxygen detection. Those seeking an Apple Watch with the feature enabled will need to purchase one from non-Apple retailers, which should still have stock of the original models and are not required to cease sales.\nThe appeal process could take over a year, in which case Apple Watch Series 10 and other models could launch with alterations that avoid Masimo's patents altogether. Whatever happens with the case, Apple is unwilling to settle."
    },
    {
      "url": "https://appleinsider.com/inside/apple-watch",
      "text": "Apple Watch\nAll about Apple Watch\nTable of Contents\n- Apple Watch\n- 1. Banning the Apple Watch\n- 2. Apple Watch Features\n- watchOS\n- 3. watchOS 11\n- Health and fitness features\n- User interface and user experience upgrades\n- Other watchOS 11 features\n- Watch Faces\n- Bands\n- Digital Crown\n- Activity Monitoring\n- Family Setup\n- 4. Apple Fitness+\n- Crash Detection\n- 5. Apple Watch Price Guide\n- 6. Apple Watch History\n- Force Touch Display\nThe Apple Watch was released in 2015 with three distinct models, several bands, and software that emphasized communication. Rather than become a fashion icon or social revolution, the Apple Watch ultimately evolved into the health and fitness wearable of today.\nThere are three types of Apple Watch available for purchase — the premium Apple Watch Ultra 2, the standard Apple Watch Series 10, and the budget Apple Watch SE.\nRumors have begun about the next generation of Apple Watch due in 2025. The Apple Watch Ultra 3 and Apple Watch Series 11 are both expected.\nBanning the Apple Watch\nMasimo is a company that builds medical equipment and has been entangled in a patent lawsuit over blood oxygen detection with Apple since 2020. It culminated in the United States International Trade Commission siding with Masimo and banning the import of affected Apple Watch models.\nThe only models for sale with the feature are the Apple Watch Series 9 and Apple Watch Ultra 2. After an initial ban and appeal in December left the situation in question, the ITC doubled down and said the ban remains in effect for the duration of appeals.\nApple had a solution ready in case the ban remained in effect. Customs agreed that Apple removing blood oxygen detection from the affected models via software was sufficient to get around the import ban.\nAs of January 18, any Apple Watch purchased in the United States has the blood oxygen detection feature disabled. Existing models sold before that date are unaffected.\nThe Apple Watch SE is also unaffected.\nApple will be able to reenable the feature once the ban has been lifted. It isn't clear which will happen first — Apple winning its appeals or Masimo's patents expiring in 2028.\nApple Watch Features\nThe Apple Watch has seen a few design changes over the years, but all have shared similar characteristics. The Apple Watch runs watchOS, an operating system built specifically for the tiny watch screen. The Digital Crown, changeable watch bands, and an OLED screen have persisted throughout each generation of Apple Watch.\nwatchOS\nThere have been a few redesigns of watchOS over the years as Apple refined what the Apple Watch was for. While fitness and health were obvious uses, it wasn't always the priority. The first iteration of watchOS focused on communication with favorite friends, heartbeat sharing, and shareable doodles.\nBy 2018, Apple had found its balance for Apple Watch — fewer weird social features and more health, notification, and fitness focus. Each Apple Watch hardware revision and software update has refined these features into a mature operating system.\n- watchOS 8 made it so users can access the Share Sheet from more locations and better control text entry. Apple also introduced a new photo portrait watch face and the Find My app in this update.\n- watchOS 9 introduced customizable workouts and a Medication tracking app. Older watch faces were also adjusted to take advantage of larger displays.\n- watchOS 10 provided a full redesign of the operating system, making widgets available with a Digital Crown turn and Control Center with a Side Button press.\n- watchOS 11 includes the new Vitals app, Training Load, and a new Photos watch face.\nwatchOS 11\nAnnounced at WWDC 2024, watchOS 11 was released in September. While it didn't get much screen time during the keynote, Apple did mention several new features that benefit users.\nHealth and fitness features\nLike most major watchOS updates, Apple introduced plenty of new health and fitness-related features with watchOS 11.\nNew pregnancy-tracking features have been added to the Cycle tracker of Apple Health. It now shows the gestational age and tracks the pregnancy across health charts. It provides recommendations and notifications for health during pregnancy, such as reviewing the high heart rate threshold and receiving alerts for increased fall risk in the third trimester.\nVitals is a new feature that uses data collected while a wearer sleeps to establish a typical range for health metrics like heart rate, respiratory rate, wrist temperature, blood oxygen, and sleep duration.\nIf any of these metrics are outside the typical range, the Apple Watch will send a notification with contextual information about possible factors, such as medications, elevation, alcohol, or illness. This can help users understand that paying closer attention to their bodies is a good idea.\nThe new Training Load feature helps users understand how workouts impact their bodies over time. It compares the intensity and duration of workouts over the last seven days to the previous 28 days, classifying the current training load to help users gauge the strain on their body and make informed decisions about their exercise regimen.\nSimilar to Training Load, a new effort rating has been added to the Workout app. The metric will gauge a user's exercise intensity, pace, elevation, heart rate, and personal data factor into each rating.\nUsers can now pause their Activity Rings for a day, week, month, or more and maintain their award streak.\nUser interface and user experience upgrades\nNew interactive widgets are displayed based on time, location, and more. New widgets include severe weather alerts, Training Load, Photos, Distance, and Shazam.\nThe Smart Stack feature has also been upgraded to automatically display relevant Widgets based on time, location, and other factors. Live activities are also included in the Smart Stack, providing important information such as the arrival time of an Uber or the likelihood of rain.\nA redesigned Photos face uses machine learning to search a user's photo library, select the best images, and create watch faces featuring their favorite people, pets, and places.\nOther watchOS 11 features\nThe Apple Watch Maps app will feature topographic maps with detailed trail networks and hikes, including all 63 U.S. national parks. Users can save maps to their Apple Watch to access them offline with turn-by-turn voice guidance.\nThe Translate app supports 20 languages, allowing users to see translations by typing or dictating a phrase. Users can also play the translation aloud and slow it down if needed. Languages can easily be downloaded to the Apple Watch, too.\nWatch Faces\nDespite user demand, Apple has never allowed third-party Apple Watch faces to be made for users. Instead, Apple provides custom watch faces with the occasional new face or update each year.\nEven though users are restricted to a specific set of Apple Watch faces, many are still available with different color choices for each. Add in custom complications and photo watch faces, and there are a near-endless number of faces a user can create.\nThe control over the Apple Watch face gallery gives Apple the ability to keep copyright or infringing material out of the user's hands. Also, it means a better overall experience for the look and feel of the device.\nSome inventive developers have found ways to add customization to watch faces previously unheard of by using unique widgets. While this is a limited workaround, it can still provide unique combinations for a more-personal watch face.\nBands\nBands use a simple hook and sliding mechanism to attach and secure the band in place. Apple offers a range of bands, but third-party manufacturers also make custom bands using Apple's template.\nSimilar to the era of iPod cases, then iPhone cases, watch bands have exploded into their own micro-business.\nEvery generation has used the same Apple Watch band lugs. This continued even when the device moved to a larger display in the fourth and seventh generations because the watch's physical size did not change. Pressing one of the buttons on either side of the casing releases the band.\nApple often introduces new colors and designs for existing watch bands but rarely uses new designs or materials. In 2020, Apple announced a line of \"Solo\" Apple Watch bands without a fastener. Apple designed these bands to stretch over the hand. Users must therefore order them to size.\nNew Apple Watch bands based on country flags were released in June 2021. There are 22 bands to choose from, and users can download the corresponding watch face from Apple's website.\nApple's next move in watch bands occurred in 2023 when it abandoned leather across its accessory lineup. It offered an alternative called FineWoven, but it's not an ideal replacement given its cloth-like material is prone to damage and stains.\nInterchangeable Apple Watch bands have remained a primary selling point since the original model was released in 2015. However, with each passing update, it is clear that Apple may have to change the connector eventually — rendering existing watch band collections useless without an adapter.\nDigital Crown\nThe Digital Crown is based on conventional time-setting crowns from analog watches. Apple set out to re-create this type of analog control for the digital era, leading to the Digital Crown. It rests on conductive liquid metal, allowing the crown to turn without the need for more complex wiring for signals.\nThe Digital Crown acts as a home button and a scroll wheel for navigation. A long press will invoke Siri, and a double press will switch back to the last app.\nEmbedded in the flat side of the crown is a conductive plate. It serves as part of the circuit from wrist to finger during an ECG on Apple Watch Series 4 and later. You can perform the measurement using the ECG app that is pre-installed on the device.\nAn update in watchOS 7.2 made it possible for ECG to detect atrial fibrillation at higher heart rates of up to 150BPM. Previously, the ECG app would not work if the user's heart rate was too high.\nApple repurposed the Digital Crown in the AirPods Max as a volume control knob and Siri interface. Apple Vision Pro also got a Digital Crown to control volume and immersion level.\nActivity Monitoring\nEach generation of Apple Watch includes various technologies targeting activity monitoring. The heart-rate sensor and accelerometer both track movement and activity throughout the day. Apple Health's Activity Rings display daily progress for three goals: a target exercise goal, calories burned, and hours where a user has gotten up to move.\nApple Watch allows users to share their activity rings inside the Activity app. This app gives users medals based on steady habits and the closing of rings. It also includes a social aspect, allowing users to challenge each other. One initiative called \"Apple Watch Connected\" will enable gyms to reward their members based on Activity app performance.\nFamily Setup\nFamily Setup lets a Family Group organizer set up a cellular Apple Watch for a family member without a dedicated iPhone. Children in the household get their own phone number for each Apple Watch, allowing them to keep in touch even if they don't have phones.\nFamily Setup lets parents specify with which contacts children can communicate. It can give parents automatic location notifications to keep tabs on where their family is. Kids can also use their wearables to track activity.\nSchooltime Mode is a feature that helps kids stay focused, limiting available features and activating Do Not Disturb during the school day while giving them a unique Apple Watch face.\nFamily Setup requires a fourth-generation device with cellular capabilities.\nApple Fitness+\nAs a part of Apple's push for services, the company released a new subscription called Apple Fitness+. It launched in December 2020 and is available on the Apple TV, iPad, and iPhone as an app.\nUsers can launch a workout from the device app or the Apple Watch. There are several workouts available, and thanks to the connectivity of Apple's devices, workout metrics from the Watch will appear on the screen.\nThe Fitness+ service is constantly updated with new workout videos from many instructors. The workouts range from simple cooldowns to challenging core exercises.\nCrash Detection\nThe iPhone 14 lineup, Apple Watch Series 8, Apple Watch SE, and Apple Watch Ultra have purpose-built sensors and algorithms for Crash Detection. If the user is in a severe car crash, the iPhone or Apple Watch will contact emergency services.\nIf both devices are present, they will work in tandem to determine if a crash has occurred. The technology isn't foolproof, however, and can be triggered by non-crash events like some roller coasters.\nCrash Detection utilizes an upgraded high dynamic range gyroscope, high g-force accelerometer, barometer, GPS, microphone, and advanced motion algorithms to determine if a severe crash occurred. Apple designed the algorithm to detect front impacts, side impacts, rear-end collisions, and rollovers.\nIf the user doesn't dismiss the alert in ten seconds, another ten-second timer starts. After that, emergency services are contacted.\nAn automated message with an estimated location and search radius will be played to the emergency services on a loop. Each replay will play back quieter to give the user a chance to speak to emergency services, and a button can be pressed to stop the recorded playback.\nAfter hanging up with emergency services, a call will be placed to emergency contacts. A ten-second timer will appear that can be dismissed before the call goes out.\nMinor collisions should not trigger Crash Detection. The accelerometer can detect up to 256G of force, and it uses the data collected from other sensors to determine if a crash occurred.\nSome users have reported false crashes have been detected on roller coasters, but the results are varied. Apple says that there isn't a \"silver bullet\" description that nails down exactly when Crash Detection activates since the algorithm has so many factors.\nEmergency services have reported concerns about wasted resources directed towards false positives. Skiiers have had some trouble from the feature on iPhone and Apple Watch, and don't always dismiss the false alarm.\nApple Watch Price Guide\nRetail prices start at $199 (USD) across the product line, but retailers regularly offer Apple Watch deals that offer double-digit and triple-digit savings on current and closeout models.\nApple Watch History\nBefore Apple Watch was released, it required the disparate skills of countless Apple staff and outside experts. Designer Marc Newson was brought in to help, as was Angela Ahrendts, who would become Apple's senior vice president of Retail and Online Stores.\nUnusually, though, it appears that this product began with one person's idea. Jony Ive, then Apple's chief designer, reportedly started working on the Apple Watch in 2011. Apple CEO Tim Cook has separately noted that Apple Watch development began after the death of Steve Jobs.\nHowever, the idea's origin could have begun as early as 2005. That was when Ive and his design team say they became serious about precision machining on the scale of the Apple Watch. And to explore how to do this, they visited watch manufacturers.\n\"We started researching watch companies just to understand machining metals, finishing metals, product assembly,\" design team creative lead Doug Satzger said in Leander Kahney's book, \"Jony Ive: The Genius Behind Apple's Greatest Products.\"\nThen two months after Jobs died in 2011, the New York Times reported that Apple was researching a wearable computer.\n\"A person with knowledge of the company's plans told me that a 'very small group of Apple employees' had been conceptualizing and even prototyping some wearable devices,\" wrote journalist Nick Bilton. \"One idea being discussed is a curved-glass iPod that would wrap around the wrist; people could communicate with the device using Siri, the company's artificial intelligence software.\"\n\"The brain that brings all these things together is the smartphone, which, after all, is really the first wearable computer,\" he continued. \"Researchers note that the smartphone is almost never more than three feet away from its user.\"\nStill, if Ive says it started in 2011, that also means that the Apple Watch was officially Apple's first entirely new product since its co-founder's death. With the industry speculating how Apple could fare without Jobs, it was both a product and a way to demonstrate Tim Cook's direction.\nIf the aim was to show that Apple could still innovate the way it had, Ive says that he found the process \"humbling.\" This is a man who worked on the iPhone, literally the most successful product ever made, and yet the Watch was harder.\n\"Even though Apple Watch does so many things, there are cultural, historical implications and expectations,\" Ive said in 2014. \"That's why it's been such a difficult and humbling program.\"\nHe meant how reinventing the phone had been a lot less complicated than reinventing the watch. Technology has its fans, especially Apple, but the watches and watch collection is an entire other world with its history, rules, and obsessives.\nIve may have been one of them. When the Apple Watch came out, it was seen by some horologists as an affront. As phone manufacturers said, technology firms couldn't just walk in and make a phone, so some saw Apple as arrogant for launching the Apple Watch when it knew nothing about classical watch-wearers.\nWhen interviewed by leading watch publication Hodinkee, Jony Ive was asked about watches and reportedly recounted an anecdote about buying an Omega Speedmaster Professional in the 90s.\nThat would be like telling how you bought a Mac SE/30, or perhaps a Mac IIfx –– machines that were expensive, classic, and are still beloved. If that didn't tell horologists that Ive was serious, then his background is why the Apple Watch leverages watch ideas like complications and a crown.\nUltra\nApple Watch Ultra is a new type of wearable from Apple separate from the standard lineup. It features a rugged titanium enclosure, an extra button, and specialized sensors.\nThe Apple Watch Ultra 2 improved on the original with a new SiP and brighter display. Apple added a space black color option in 2024.\nThe sapphire display is flat surrounded by a raised lip of titanium. The Digital Crown is protected by a crown guard, and the buttons are designed for use when wearing gloves.\nApple promoted the watch alongside three extreme activities — triathlons, diving, and hiking. There are three bands purpose-built for these activities too — Alpine, Trail, and Ocean.\nThe Action Button on the side of the Apple Watch Ultra can be programmed to perform different actions based on Focus. It adds a new range of quick-action functionality that can even launch a Shortcut.\nThis model is $799 and is available in natural titanium and space black.\nTenth Generation\nApple Watch Series 10 was released with a slight redesign in 2024. It got a thinner case with a wider display that has smaller bezels.\nThe resulting sizes increased by 1mm to 46mm and 42mm. The display on the 46mm option is larger than the display on the 49mm Apple Watch Ultra.\nNo new health sensors were added, but Apple did introduce a sleep apnea detection feature that works on the tenth and ninth generation models.\nThe wide angle display is 80% brighter and the always on mode refreshes every second. So, select watch faces now have a ticking second hand.\nApple Watch Series 10 is available in aluminum and titanium. The titanium option takes over in the previous price reserved for stainless steel.\nNinth Generation\nThe Apple Watch Series 9 iterated yet again, but this time with a faster S9 SiP. The new chipset enables features like on-device Siri and Double Tap.\nThere's not a lot to say about the 2023 model. It has the same sensors as the previous generation, the same external design, and runs watchOS 10.\nApple added a brighter display that enables the device to reach 2,000 nits in bright settings like in direct sunlight.\nThis model of Apple Watch starts at $399 for the 41mm size or $429 for the 42mm size. Adding Cellular to the aluminum model is a $100 premium, but stainless steel models get cellular by default.\nSE\nThe second-generation Apple Watch SE introduced Crash Detection, upgraded to the S8 SiP, and got a new plastic composite back case. It offers basic health and fitness tracking features without all the bells and whistles of more-premium models.\nUsers get access to heart rate tracking, workout tracking, and fall detection at a lower entry price with SE. It has the Series 4 design and lacks the always-on display.\nThe purpose of this model is to serve as an entry model for budget-conscious consumers. If people don't need temperature tracking, the ECG function, or blood oxygen tracking, then this is the model to get.\nThe 41mm model is $249 and the 42mm model is $299. Cellular options for Family Setup are also available at a slight premium.\nEighth Generation\nThe Apple Watch Series 8 is an iterative update with Crash Detection and temperature sensing as the two headlining features. While the everyday use of the Watch may not change much, these features could be critically important to some users.\nTemperature detection is tied directly to the cycle tracking feature in Apple Watch. It gathers temperature over about a week to establish the user's baseline sleeping temperature.\nThen, using that data and other metrics, it can determine if a person may have ovulated in the recent days prior. This retroactive notification of ovulation can be key in planning a pregnancy or determining reproductive health.\nCrash Detection has been a controversial feature for the 2022 Apple Watches. Users and emergency responders are complaining of false positives, which leads to wasted resources.\nApple no longer offers this model as a new purchase.\nSeventh Generation\nAnnounced in September 2021, the Apple Watch Series 7 was more a slight design refinement than a major new release. The biggest change was the display, which uses a larger 41mm or 45mm display, depending on the model, and increasing the amount of viewable screen by 20%.\nThe increased screen reduces the borders by 40% compared to the 2020 model. While the chassis has been redesigned with more rounded corners, the overall appearance hasn't massively changed in this iteration.\nCharging's faster by up to 33%, with an eight-minute charge providing enough power for 8 hours of sleep tracking.\nThey are offered in aluminum in five colors, the Apple Watch Series 7 starts from $399. A stainless steel version is also available in silver, graphite, gold, and a space black titanium model.\nRead the review here: Apple Watch Series 7 review: Bigger than you think\nSixth Generation\nIn September 2020, Apple launched the Apple Watch Series 6 and the more family-friendly Apple Watch SE. The latter was aimed at families, particularly children, from its lower price of $279 and its Family Setup features.\nThose let a parent set up a Watch for a child without buying them an iPhone, too. And it lets those parents stay in touch with their kids by including location notifications.\nIf you instead had from $399 to spend on an Apple Watch Series 6 at the time, you could have had the same features –– but also much more. It features a significantly brighter always-on display, a faster processor, and blood oxygen tracking.\nAgain, Apple pushed the health features, with the latest watchOS 7.2 improving the ECG functions.\nRead our review here: Review: Apple Watch Series 6 is still the best smartwatch to buy\nYou can also check out the Apple Watch SE review here: Review: Apple Watch SE is the smartwatch for first-time buyers and upgrade-holdouts\nForce Touch Display\nBefore 2020, every generation of the smartwatch had included a Force Touch Display. This allowed users to press \"into\" the content to open up contextual menus. If this sounds familiar, it's because it was the fore-bearer to the now-deprecated 3D Touch.\nBecause of its small screen and limited interactions, Force Touch on this device stuck around one year longer than on iPhones. However, watchOS 7 and the 2020 hardware updates removed it.\nFifth Generation\nThe Apple Watch Series 5 was announced on September 20, 2019. It was the first model with an always-on display.\nThe always-on feature was a surprise. It had been predicted to come eventually, and it had been wanted from the start, but it was a surprise that Apple had managed it quite so soon.\nApple revealed other new hardware elements, such as an emergency call function and a compass that improved walking directions in Apple Maps. And there were new software options too –– as for the first time, Apple Watch owners could now download apps directly from the App Store.\nApple Watch Series 5 started at $399 for the aluminum GPS-only one. For LTE, it was from $499. And there was again an Apple Watch Edition, this time with a ceramic chassis.\nRead the review here: The Apple Watch Series 5 leaves the competition in the dust\nFourth Generation\nThe overt red dot from the previous generation, signifying LTE, was dropped in favor of a more subtle red circle on the Apple Watch Series 4. That was the least of the changes made for this generation.\nThis model was as close to a reinvention of the Watch as Apple had made up to then. It featured an ECG monitoring sensor and a faster processor on the inside.\nAnd on the outside, it was bigger. Gone were the original 38mm and 42mm sizes. In were 40mm and 44mm.\nFor these \"small\" and \"large\" sizes, the difference of an extra 2mm plus reduced bezels meant that the screen should show a lot more information. Alongside all of the familiar Watch elements like the round face, new corner complications came.\nApple Watch Series 4 was launched on September 12, 2018, and prompted many people to sell on their old Watches to get one. They needed $399 for the non-cellular version and $499 for LTE.\nRead the review here: Review: Apple Watch Series 4 is the full realization of what a wearable can and should do\nThird Generation\nReleased in September 2017, the Apple Watch Series 3 was the first to include cellular capabilities, meaning users could make phone calls from it without their iPhone. LTE Watches had a distinctive red dot in their digital crown, otherwise, there were no visible hardware differences.\nThere was an audible one, though. For the first time, Siri on Apple Watch could answer you verbally.\nIf the second-generation models were released to fix issues with the original version, chiefly speed, then the Series 3 felt like something new. Significantly, the Series 3 is still on sale as of 2021, whereas neither the Series 4 nor Series 5 are.\nThat said, the only versions of the Series 3 you can buy now are with Sport Bands with limited colors. You could get silver, space gray, or gold finishes in aluminum at launch. Or silver and space black in stainless steel.\nWhat you couldn't get was either ceramic or the original gold. There was no Edition model for two Watch generations.\nBy this stage, Apple had gone all-in on the idea that Apple Watch was for health and fitness. It always had features for these, but arguably Apple initially positioned it as a fashion accessory.\nThat may not be true. Apple targeted the fashion market with its gold Apple Watch Edition, then dropped that model. But Apple was entering a brand new market with the Watch, and even Apple needs to make a splash sometimes.\nWhether the Watch was a fashion statement or Apple making a statement to the world that it was now in the timepiece game, Series 3 concentrated on health and fitness.\nRead the review here: Apple Watch Series 3 with cellular further establishes an emerging computing platform\nSecond Generation\nThe \"Series 0\" name began to appear in 2016 when Apple launched Apple Watch Series 1 and Apple Watch Series 2. The Series 1 was mostly the same as the original but had a faster processor.\nThe original Watch had an Apple S1 processor, while the Series 1 had an Apple S1P and the Series 2 an S2P.\nBoth S1P and S2P were around 50% faster than the original Apple Watch. The Series 2 included GPS, a brighter display, and a degree of waterproofing.\nThere seemed to be little significant difference in the 2016 Apple Watch releases. They came with watchOS 3, and the latest operating system they can run is watchOS 6.\nThere were, though, very noticeable changes in pricing. For instance, there was no gold Apple Watch Edition for Series 1 or 2, though there was an Edition in ceramic.\nPlus, there was now an Apple Watch Nike version. This included a Nike sport band, which could be bought separately.\nWith its various bands and different materials, Apple Watch Series 1 started at $269. The Series 2 sold from $369 in aluminum and $549 in stainless steel.\nRead the review here: Apple Watch Series 2 is a great improvement, but watchOS 3 steals the show\nFirst Generation\nAs early as 2012, the word was out about a forthcoming Apple Watch –– or, as it was always called then, the iWatch. At one point, Apple was said to be working with Intel to build its smartwatch.\nApple wouldn't say yes, and it wouldn't say no. There was as much speculation then about a watch as there is now about an Apple Car, but infinitely less published information. Few leaks happened, and while there were patents as early as 2007, none were recognized as being for the watch until much later.\nNext, in 2013, Apple hired Kevin Lynch as what they described as vice president of technology but was actually the head of the Apple Watch project. If he were the head, though, Jony Ive remained the heart.\nAnd he showed so on September 4, 2014, when, before the Watch was even launched, he privately predicted extreme success. Without directly quoting him or his reported profanity about it, the New York Times said that Ive believed Switzerland's watch industry was going to be in trouble.\nFive days later, Tim Cook introduced... the iPhone 6. And Apple Pay. Then at 55 minutes into the presentation, he said that could've been enough.\n\"We've really gone through enough to call it a day,\" he said to laughter from the audience. \"But we're not quite finished yet. We have one more thing.\"\nTim Cook spent 46 minutes detailing the new Apple Watch, which included a slightly vague promise to release it early the following year. It would ultimately go on sale with pre-orders on April 10, 2015.\nThose pre-orders consisted of three models, which Apple called \"collections.\" There were three available: the 18-carat gold \"Edition,\" the stainless steel standard model, and the aluminum sport model.\nEach came in either 38mm or 42mm sizes, with correspondingly different screens, but were otherwise functionally identical. For instance, all included the Digital Crown, and all of them would only light up their screen when you turned your wrist to see the time.\nOtherwise, the Apple Watches only differed in their materials –– and price. While the sport model started at $349, the Edition was made from 18-carat gold and cost north of $10,000."
    }
  ],
  "argos_summary": "Apple has released a minor update to the iOS 26 developer beta 6, which does not restore the blood oxygen sensor on the Apple Watch, despite a previous update (iOS 18.6.1) that re-enabled it. The blood oxygen feature remains disabled on new Apple Watches sold in the U.S. due to an ongoing legal dispute with Masimo over patent infringement, although Apple has found a software workaround to comply with import restrictions. Users on the developer beta have not yet received this update, and it is unclear when or if the blood oxygen sensor will be reactivated for them.",
  "argos_id": "5HE6UJYVN"
}