{
  "url": "https://www.pcmag.com/news/california-again-rejects-starlink-launch-increase-but-it-might-not-matter",
  "authorsByline": "Michael Kan",
  "articleId": "3b0cd137e68648a8bb0ff5c9c86d9704",
  "source": {
    "domain": "pcmag.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.pcmag.com/imagery/articles/052ISHcOY3UTQlOesEGN11R-1.fit_lim.size_1200x630.v1755209957.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T22:20:05+00:00",
  "addDate": "2025-08-14T22:24:40.269683+00:00",
  "refreshDate": "2025-08-14T22:24:40.269685+00:00",
  "score": 1.0,
  "title": "California Again Rejects Starlink Launch Increase, But It Might Not Matter",
  "description": "The California Coastal Commission unanimously votes against increasing Falcon 9 launches to 100 per year. A US military loophole will probably allow them anyway.",
  "content": "A California commission has again shot down a proposal to increase Starlink satellite launches from a local base — but it appears SpaceX and the US military don’t care.\n\nOn Thursday, the California Coastal Commission unanimously rejected a US Space Force request to boost the number of Falcon 9 launches from 36 to 100 per year at Vandenberg Space Force Base. The decision arrives nearly a year after the commission denied an earlier proposal to increase the launches from 36 to 50 by partly citing SpaceX CEO Elon Musk’s controversial politics and business practices. In response, Musk sued over alleged political discrimination.\n\nAt Thursday’s hearing, neither SpaceX nor US Space Force representatives showed up, likely because the military sidestepped the commission by classifying the Falcon 9 launches as a federal activity. The launches at Vandenberg base have involved both Starlink and Starshield, a military-grade version of the satellite internet service.\n\nThe Department of the Air Force has since cleared SpaceX to increase the number of Falcon 9 launches to 50, citing “no significant impact” on the local environment. In addition, the US military has kicked off its own process to increase the number of Falcon 9 launches at Vandenberg to 100 per year. Although the Air Force is soliciting public input for a final decision this fall, the process also sidelines the California Coastal Commission.\n\nThe Air Force is merely consulting the commission, along with several other federal agencies. As a result, a California commission staff member conceded during Thursday’s hearing: “Effectively, the result of this vote does not prevent SpaceX from continuing launch activities.\"\n\nThis time, the commission voted to reject the proposal, solely for a lack of information from the US Space Force, rather than mentioning Musk’s conduct. This includes “significant unresolved questions” about the noise and sonic booms from the increased launches and scarce details about the possible impact on surrounding marine and coastal wildlife.\n\n“There are a number of unanswered questions that make it really quite impossible for us to engage,” said Vice Chair Commissioner Caryl Hart. “And here today, once again, we see no appearance by the US Air Force, US Space Force, or SpaceX to answer the questions that we have — further indications that there just doesn’t seem to be willingness to provide further information.”\n\nThe commission’s report has also questioned the US Space Force classifying Falcon 9 launches as federal activity, saying a “small fraction” of the total flights have been meant to serve Department of Defense contracts.\n\nDuring the hearing, local Californians also chimed in, saying they fear the impacts on noise levels and to local wildlife. \"So, how does it feel to be ignored by your federal government and gazillionaires? Not good,\" one resident said. \"We want to protect. We're protectors. This can't be said for SpaceX. I'm sorry. They're exploiters.\"\n\nMeanwhile, Commissioner Christopher Lopez said he appreciated how Starlink can supply broadband during disasters or outages. This was evident when a tractor accidentally cut a fiber connection in his community, causing everyone to lose internet and wireless access, except for \"those people who were early adopters of Starlink services.\"\n\n\"For me, I hope as we move forward, there's a continued willingness and openness to foster and rebuild a relationship that once existed,\" he said, despite voting to reject the launch increase.\n\nSpaceX and the US Space Force didn't immediately respond to a request for comment.",
  "medium": "Article",
  "links": [
    "https://www.vandenberg.spaceforce.mil/Portals/18/VSFB_Falcon%209%20Final%20AMENDED%20FONSI_SIGN_8MAR2025.pdf",
    "https://www.pcmag.com/news/rip-peripherals-next-gen-windows-to-lean-heavily-on-ai-voice-and-vision",
    "https://documents.coastal.ca.gov/reports/2025/8/Th9b/Th9b-8-2025-exhibits.pdf",
    "https://www.pcmag.com/privacy",
    "https://twitter.com/Michael_Kan",
    "https://www.pcmag.com/news/t-mobile-cellular-starlink-helped-198000-users-in-areas-hit-by-wildfires",
    "https://www.pcmag.com/terms",
    "https://documents.coastal.ca.gov/reports/2025/8/Th9b/Th9b-8-2025-report.pdf",
    "https://www.pcmag.com/news/spacex-slams-virginia-for-overlooking-starlink-in-states-broadband-funding",
    "https://www.pcmag.com/cdn-cgi/l/email-protection#2e43474d464f4b4271454f406e5e4d434f49004d4143",
    "https://www.pcmag.com/news/elon-musk-sues-to-block-california-from-regulating-falcon-9-launches",
    "https://www.pcmag.com/news/is-starlinks-5-standby-mode-actually-a-great-bargain",
    "https://www.pcmag.com/news/california-rejects-bid-to-increase-starlink-launches-citing-musks-controversies",
    "https://www.pcmag.com/news/us-pushes-to-bypass-regulator-ok-more-starlink-launches-at-space-force",
    "https://www.pcmag.com/news/starlink-cuts-monthly-fee-dish-price-in-latest-bid-to-attract-new-us-customers",
    "https://www.pcmag.com/news/whatsapp-russia-is-restricting-app-access-so-it-can-spy-on-people",
    "https://www.pcmag.com/news/spacexs-next-big-rival-is-honda-watch-the-carmakers-test-rocket-fly",
    "https://www.pcmag.com/news/environmental-groups-accuse-elon-musks-xai-of-gross-neglect-in-memphis",
    "https://www.pcmag.com/authors/michael-kan",
    "https://www.linkedin.com/in/michael-kan-29603514"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US Space Force",
      "weight": 0.106348634
    },
    {
      "name": "Starlink satellite launches",
      "weight": 0.09991294
    },
    {
      "name": "Starlink Launch Increase",
      "weight": 0.09885399
    },
    {
      "name": "launch activities",
      "weight": 0.091262944
    },
    {
      "name": "Vandenberg Space Force Base",
      "weight": 0.08830925
    },
    {
      "name": "US",
      "weight": 0.07191899
    },
    {
      "name": "Starlink services",
      "weight": 0.06711304
    },
    {
      "name": "a US Space Force request",
      "weight": 0.06555852
    },
    {
      "name": "SpaceX",
      "weight": 0.06448708
    },
    {
      "name": "federal activity",
      "weight": 0.064016245
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.73193359375
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Space Technology",
      "score": 0.70263671875
    },
    {
      "name": "/News/Other",
      "score": 0.5625
    },
    {
      "name": "/News/Technology News",
      "score": 0.55224609375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.478515625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.3505859375
    }
  ],
  "sentiment": {
    "positive": 0.052199785,
    "negative": 0.7153373,
    "neutral": 0.23246291
  },
  "summary": "A California commission has unanimously rejected a proposal by the US Space Force to increase the number of Falcon 9 launches from 36 to 100 per year at Vandenberg Space Force Base. This decision comes nearly a year after the commission partially dismissed an increase in the number due to SpaceX CEO Elon Musk's controversial politics and business practices. The Department of the Air Force has since cleared SpaceX to increase launches to 50, citing \"no significant impact\" on the local environment. However, the US military has begun its own process to increase this number. The commission's report also questioned the legality of classifying Falcon 9 flights as a federal activity, noting that a small fraction of the total flights have been intended to serve Department of Defense contracts.",
  "shortSummary": "The California Coastal Commission again rejected a US Space Force request to increase Falcon 9 launches from 36 to 100 per year at Vandenberg Space Force Base, citing concerns over environmental impact.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "02a6994e1b654490b01bfd231dc53a06",
  "places": [
    {
      "osmId": "317711",
      "county": "Santa Barbara County",
      "state": "California",
      "postcode": "93437",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 34.7088437,
        "lon": -120.54474220377836
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "The California Coastal Commission has rejected a proposal to increase Falcon 9 satellite launches from Vandenberg Space Force Base from 36 to 100 per year, citing a lack of information from the US Space Force regarding environmental impacts. Despite this, the US military has initiated its own process to increase launches to 100, classifying them as a federal activity, which allows them to bypass the commission's authority. Local residents expressed concerns about noise and wildlife impacts, while some commissioners acknowledged the benefits of Starlink services during emergencies.",
  "argos_id": "676C95TQZ"
}