{
  "url": "https://www.wired.com/story/nvidia-chips-export-controls-trump-h20-security/",
  "authorsByline": "Louise Matsakis",
  "articleId": "8e2c47c0f4c3447dbd187800aac2ee14",
  "source": {
    "domain": "wired.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://media.wired.com/photos/688a7098154631f796d00feb/191:100/w_1280,c_limit/MIC-Drama-Over-Nvidia-Chips-Business-2225847972.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T15:56:42.625000-04:00",
  "addDate": "2025-08-14T20:09:15.967183+00:00",
  "refreshDate": "2025-08-14T20:09:15.967188+00:00",
  "score": 1.0,
  "title": "Why Trump Flip-Flopped on Nvidia Selling H20 Chips to China",
  "description": "Nvidia struck a surprising deal after convincing the president that H20 chips aren’t a national security risk. But whether the reversal is good or bad depends on who you ask.",
  "content": "The tech industry is reeling from President Trump’s surprising new deal with Nvidia. Earlier this week, Trump said he would allow the company to continue selling its H20 chips to China in exchange for a 15 percent share of the revenues.\n\n“The H20 is obsolete. You know, it’s one of those things, but it still has a market,” Trump said at a press conference on Monday. “So we negotiated a little deal.”\n\nThe unusual and legally dubious arrangement is a striking reversal for the Trump administration, which banned all H20 sales to China earlier this year. The president reportedly changed his mind about the issue after meeting with Nvidia CEO Jensen Huang, who has argued that allowing Chinese companies to buy H20s doesn’t pose a risk to US national security.\n\nOn one hand, this is a simple story about a president who appears to have been influenced by a powerful executive lobbying in his company’s interest. But beneath the surface, there’s a much more interesting and complicated saga about how we got here.\n\nNvidia introduced the H20 last year after the US government banned the company from selling a more powerful chip, the H800, to China. The move was part of an ambitious project orchestrated by Biden administration officials who believed the United States needed to prevent China from developing advanced artificial intelligence first.\n\nFor the past few months, I’ve been working closely with Graham Webster, a researcher at Stanford University who sought to understand how and why the Biden team decided the US needed to curb China’s access to advanced semiconductors in the first place. Today, WIRED is publishing Graham’s definitive account of what really happened behind the scenes, based on interviews with more than 10 former US officials and policy experts, some of whom spoke on the condition of anonymity.\n\n“I did this piece because the official legal justification for the controls, military and human rights, was obviously never the whole story,” Graham told me. “Clearly AI was in the mix, and I wanted to understand why in some depth.”\n\nGraham writes that several key officials in Biden’s White House and Commerce Department “believed AI was approaching an inflection point—or several—that could give a nation major military and economic advantages. Some believed a self-improving system or so-called artificial general intelligence could be just over the technical horizon. The risk that China could reach these thresholds first was too great to ignore.”\n\nSo the Biden team decided to take action. In the fall of 2022, they unveiled broad export controls aimed at preventing China from accessing the most advanced chips required for training powerful AI systems, as well as specialized equipment Beijing needed to modernize its own domestic chipmaking industry.\n\nThe move was the start of a multi-year project that “would reshape relations between the world’s two largest powers and alter the course of what may be one of the most consequential technologies in generations,” Graham writes.\n\nWhat struck me about Graham’s story is just how many people involved in Biden’s export control policies moved on to other influential positions in the world of AI, computing, and national security. Jason Matheny, who led the White House’s policy on technology and national security, is now the president and CEO of RAND, a prominent think tank that often serves government clients. Tarun Chhabra, who worked on the National Security Council, now leads national security policy at Anthropic.",
  "medium": "Article",
  "links": [
    "https://www.wired.com/story/chips-china-artificial-intelligence-controls/",
    "https://www.wired.com/story/big-interview-nvidia-jensen-huang-2024/",
    "https://www.wsj.com/world/china/nvidia-ceo-jensen-huang-trade-tariffs-475b5cd7?",
    "https://www.wired.com/story/nvidia-gretel-acquisition-synthetic-training-data/",
    "https://www.delawarepublic.org/2025-08-12/a-look-at-the-deal-to-allow-nvidia-chip-sales-to-china-in-exchange-for-revenue"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US national security",
      "weight": 0.074479
    },
    {
      "name": "Biden administration officials",
      "weight": 0.073628336
    },
    {
      "name": "national security policy",
      "weight": 0.07315477
    },
    {
      "name": "powerful AI systems",
      "weight": 0.070284605
    },
    {
      "name": "H20 Chips",
      "weight": 0.067324765
    },
    {
      "name": "China",
      "weight": 0.06648478
    },
    {
      "name": "Graham Webster",
      "weight": 0.065516286
    },
    {
      "name": "national security",
      "weight": 0.063346066
    },
    {
      "name": "Graham",
      "weight": 0.06189699
    },
    {
      "name": "broad export controls",
      "weight": 0.061790004
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.97802734375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.87060546875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.787109375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.61474609375
    },
    {
      "name": "/Computers & Electronics/Computer Hardware/Computer Components",
      "score": 0.45068359375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.300537109375
    }
  ],
  "sentiment": {
    "positive": 0.13588485,
    "negative": 0.48505813,
    "neutral": 0.37905705
  },
  "summary": "President Trump has made a surprising decision to allow Nvidia to continue selling its H20 chips to China in exchange for a 15 percent share of the revenues. This move is a significant reversal for the Trump administration, which had previously banned all H20 sales to China. The decision was made after meeting with Nvidia CEO Jensen Huang, who argued that allowing Chinese companies to buy H20s poses no risk to US national security. The H20 introduced last year after the US government banned the company from selling a more powerful chip, the H800, to China, and was part of an ambitious project led by Biden administration officials who believed the US needed to prevent China from developing advanced artificial intelligence first. WIRED's Graham Robinson has published a definitive account of the events behind the scenes, based on interviews with over 10 former US officials and policy experts.",
  "shortSummary": "President Trump's unexpected deal with Nvidia allows the company to sell its H20 chips to China, despite previously denying national security risks.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ac7aa12b249f433cb00598799d6aa7cc",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.wired.com/story/big-interview-nvidia-jensen-huang-2024/",
      "text": "In a world where people are increasingly doubting the potential of AI, you can count on Jensen Huang, the CEO of Nvidia, to be the last one hyping up how AI will be the fundamental force that changes society.\nTalking to WIRED senior writer Lauren Goode at The Big Interview event on Tuesday in San Francisco, Huang called the trend of AI “a reset of computing as we know of [it] over the last 60 years.” The force of AI is, he said, “so incredible, it’s not as if you can compete against it. You are either on this wave, or you missed that wave.”\nThat means, Jensen said, “people are starting to realize that AI is like the energy and communications infrastructure—and now there’s going to be a digital intelligence infrastructure.”\nThe task for Huang now, however, is whether he can get others, especially governments around the world, to agree on his vision.\nHuang was the only interviewee at the event who phoned in from outside the country. He was in Thailand, where Huang said he lived for five years as a kid and where, just today, he met with Paetongtarn Shinawatra, Thailand’s prime minister to talk about building “world-class AI infrastructure” in the country together.\nIt’s the latest stop of Huang’s whirlwind tour this year to pitch governments on the idea that they should forge their individual paths to the future by building their own AI infrastructure, processing their own national data, having their own AI systems, and, obviously, buying Nvidia chips for that purpose.\nThe pitch seems to have worked pretty well. Thailand is the new addition to a list of at least 10 countries, according to data compiled by Sherwood News, that have signed up for AI infrastructure projects with Nvidia. Huang himself said during the interview that he was in Denmark, Japan, Indonesia, and India this year; the countries all decided to build their own national AI systems—using Nvidia chips.\nThe success of Huang’s pitch to global governments reflects both a fundamental recognition of the potential of AI systems and an increasingly splintering internet where geographical boundaries are being rebuilt online. AI is the latest tech product where the invisible flow of chips and data are being obstructed by nation-state borders.\nOne of the main tensions lies between the US and China, two leading technology powerhouses that are eager to take first place in the coming wave of technological changes. When the two countries collide, Nvidia inevitably finds itself at the center of the storm.\nJust this Monday, the Biden administration announced new restrictions that will ban the export of chip components and chip-making technologies to China. One of the restrictions is on high-bandwidth memory, or HBM, a memory component often used in customized AI chips. Nvidia’s H20 chips, which are designed to be sold to Chinese companies without violating the export controls, contain HBM chips. Nvidia has reportedly stopped taking Chinese orders for H20 chips as early as September, according to Chinese media reports, anticipating the restrictions this week.\nAsked about the impact of the restrictions on Nvidia, especially the components that go into Nvidia chips, Huang shied away from talking about the specifics, but said the “interactions with the administration have been great,” which was greeted by a wave of laughter in the crowd in San Francisco.\nAnd as the Donald Trump presidency nears, Huang is also extending a friendly hand, despite the political instabilities the president-elect might bring. “I reached out to President Trump, congratulated him, wished him success, and told him we’ll do everything we can to make the administration succeed,” Huang said.\nTrump recently pledged to put in a 25 percent tariff on imports from Mexico and Canada and a 10 percent additional blanket tariff on anything from China. The 25 percent tariff on Mexican imports would impact Nvidia’s new chip factory being built in the country.\nHuang is hoping the Trump administration would also buy his vision of AI as the source of fundamental societal changes. “I’m certain that the new administration and President Trump will be quite interested in this industry, and I’ll be more than delighted to provide support and answer any questions that I can,” Huang said.\nBut there’s also another geopolitical tension Nvidia is trying to capitalize on: the one between the leading AI forces—the US, China, and the companies that operate there—and everywhere else. Countries outside of those two powerhouses increasingly feel left out of the race and have to rely on the former to benefit from the AI technology revolution.\nIf companies from the US and China are defining what our future looks like, other countries are rightfully worried about whether they can protect their own interests in the AI age. That’s what makes Huang’s \"sovereign AI” pitch a popular one to governments worldwide.\n“Countries are awakened to the incredible capabilities of AI and the importance of AI for their own nations,” Huang said. “They realize that their data is part of their natural resources. Their data encodes their society’s knowledge and culture and common sense. Their hopes and dreams.”"
    },
    {
      "url": "https://www.wired.com/story/chips-china-artificial-intelligence-controls/",
      "text": "Alan Estevez was sitting at his dining room table wearing a T-shirt when Secretary of Commerce Gina Raimondo called on Zoom to ask if he wanted to be the Biden administration’s top export control official. “You’re going to have to sell me on this,” Estevez recalls telling her.\nIt was 2021, and the outspoken New Jersey native thought he had finally left public service behind. After more than three decades at the Pentagon, he had left and taken a job in consulting. He wasn’t sure if he was ready to go back.\nCould he be tempted by the opportunity to help oversee the tens of billions of dollars in semiconductor funding the administration was seeking from Congress? “I came from DOD,” he recalls saying. “$50 billion is OK money, but it’s not a lot of money.” Then Raimondo appealed to his sense of service. Estevez gave in and took the job.\nBy the time Estevez was sworn in as under secretary of commerce for industry and security in the spring of 2022, he had his work cut out for him. The role he had accepted would turn out to be at the center of America’s first serious effort to confront the geopolitical risks of artificial intelligence. Within a few years, the project would reshape relations between the world’s two largest powers and alter the course of what may be one of the most consequential technologies in generations.\nShortly after he joined the Commerce Department, Estevez says, he began hearing from officials in the White House. Over breakfast one morning, Tarun Chhabra and Jason Matheny, two key figures working on technology and national security, told Estevez they were planning something big, and they would be needing his help.\nOver the next six months, the US government revolutionized its strategy for competing with China, now widely considered the nation’s most important technological rival. For years, US officials had sought to keep China one or two generations behind in semiconductors, the building blocks of modern technology that power everything from smartphones to AI. But now, as National Security Adviser Jake Sullivan declared that September, “we must maintain as large of a lead as possible.”\nOn October 7, 2022, the Biden administration announced a sweeping set of export controls designed to cut off China from the most advanced chips used for training powerful AI models, as well as specialized tools that China would need to upgrade its own lagging chipmaking industry. Officially, the controls were intended to throttle China’s military modernization and stem human rights abuses fueled by surveillance technology. But as observers digested the dozens of pages of technical specifications and legalese, it became clear that the implications of the new policy were far more vast.\nIn practice, the United States was delivering a targeted blow that would ripple out across the Chinese economy, impacting research and development in every industry and scientific field that relied on computationally intensive machine learning. Anywhere cutting-edge AI or high-performance computing held promise—futuristic weapons, yes, but also curing disease and modeling climate change—the policy could undermine China. A New York Times writer called it a “declaration of economic war.”\nWar or not, the Biden administration was placing a high-stakes bet that the United States could use its leverage to hold China back and that the losses in terms of forgone US exports to China and collateral damage to bilateral ties would be worth it. On one hand, it was a gamble that relied on ideas established in Washington decades ago. US policymakers had been using tech restrictions to stymie China’s military modernization and punish the country for human rights abuses since the Cold War. More recent advancements in missiles and surveillance technology reinforced that logic. But several people who served in the Biden administration say that a more novel concern was also behind the big bet.\nKey officials believed AI was approaching an inflection point—or several—that could give a nation major military and economic advantages. Some believed a self-improving system or so-called artificial general intelligence could be just over the technical horizon. The risk that China could reach these thresholds first was too great to ignore.\nThis account of how the Biden administration chose to respond is based on interviews with more than 10 former US officials and policy experts, some of whom spoke on the condition of anonymity to discuss internal government deliberations.\nHobbling Huawei\nWhen the Biden administration introduced its transformative policy, it did not start from scratch. During his first term, President Donald Trump had also targeted Chinese tech, including semiconductor firms, as part of a broader effort to curb the country’s technological rise and global influence.\nIn 2019, the Commerce Department added the Chinese IT giant Huawei to its Entity List, which effectively cut it off from US supply chains, including chips, unless it got a special license. Officials justified the measure with allegations that Huawei had violated US sanctions on Iran. But experts believed they were also trying to undermine the company more generally, fearing that Huawei’s exports of 5G wireless infrastructure around the world could give Chinese spies and saboteurs a leg up.\nThen the Trump administration doubled down, this time by turning to an obscure legal provision called the “foreign-produced direct product rule.” The FDPR was originally designed to make sure that goods made through US innovation and technology—like missiles or airplane parts—didn’t go into weapons systems sold to adversaries, even if those systems were built abroad. In 2020, the Trump administration turned this long-arm tool on Huawei, explicitly targeting the company’s “efforts to obtain advanced semiconductors developed or produced from US software and technology,” as Commerce Secretary Wilbur Ross said at the time.\nWhile the FDPR had previously been used to enforce multilateral arms controls, the move against Huawei targeted “items made with US technology that were not sensitive, that were not on the control list, that had nothing to do with any AI,” says Kevin Wolf, a former Obama administration export control official.\n“Everybody thought that would be the end of this very novel extraterritorial control,” Wolf added. Instead, the US government found the FDPR irresistible. It would later turn it on Russia after the 2022 invasion of Ukraine and would eventually wield it to constrain high-powered computing in China. “Obviously we started using it like candy,” says Estevez. “Certainly threatening to use it if not actually using it.”\nIn the first Trump administration, the US added Semiconductor Manufacturing International Corporation (SMIC), a leading Chinese chipmaker, to the Entity List and brought criminal charges against another Chinese semiconductor company, Fujian Jinhua (a judge later found it not guilty). It also worked with the Netherlands, home to the chipmaking tool giant ASML, to restrict exports of especially cutting-edge semiconductor equipment. All these moves were, in a way, part of normal business amid worsening ties between the US and China. They didn’t require visions of advanced AI to make sense in Washington, where traditional concerns about military modernization, rights abuses, and fair markets were more than enough to justify targeted efforts against Chinese tech.\nRevolutionary Technology\nWhen Biden took office in 2021, some members of his policy team brought with them a novel anxiety: AI systems might become so capable that they would supercharge national power, leaving rival militaries and economies at a great disadvantage.\nIn early 2019, when you had to be a bit of a geek to have heard of OpenAI’s early GPT models, Matheny—one of Estevez’s early breakfast partners from the White House—was founding director of the Center for Security and Emerging Technology. Essentially a think tank housed inside Georgetown University, CSET was launched with a $55 million grant from Open Philanthropy, a group aligned with the effective altruism movement that funds work addressing issues ranging from “potential risks from advanced artificial intelligence” to global health. “AI and other emerging technologies will deliver profound benefits to society, but they will also introduce new risks,” Matheny said at the center’s launch.\nIt wasn’t long before CSET scholars identified China’s growing strength in AI development as a US national security risk. Those scholars included Tarun Chhabra—the other White House breakfast partner—as well as future Biden administration officials Saif Khan and Ben Buchanan, all of whom studied technology and national security at CSET.\nChhabra coauthored a report published in February 2020 that recommended the United States and key allies “coordinate on the terms under which they will export leading-edge AI chips to China” and “forge a democratic way of AI.” That April, Khan coauthored a separate paper arguing for putting controls on chipmaking equipment to ensure that China remained “reliant on democracies for state-of-the-art chips.” In August, just months before Biden was elected president, Buchanan identified computing power as a key input that allows countries to develop AI and warned that the US was likely running out of time before it could no longer restrain China’s access to it. The National Security Commission on Artificial Intelligence, a research panel created by Congress that included Matheny, also called for “implementing coordinated export controls on advanced semiconductor manufacturing equipment with allies.”\nChhabra, Matheny, Khan, and Buchanan—four experts with varying backgrounds who crossed paths at CSET—would all go on to work on AI policy in the Biden White House. Once there, they and others, including Chris McGuire, a State Department official who had worked on the final AI Commission report, set to work operationalizing their ideas. One former official recalled that their work to keep advanced chipmaking equipment out of Chinese hands began as early as the transition. The theory was that gatekeeping the tools would ensure there would be no Chinese version of Nvidia and would prevent Chinese companies like SMIC from building cutting-edge factories. This would, as Khan had advocated, keep Chinese AI developers dependent on US suppliers.\nAs the Biden team assembled in 2021, however, its ambitions were broader. Limiting China’s chipmaking abilities would block it from independently building computing power, but Chinese developers could still simply buy the best chips from US companies. As close observers of AI were debating the potential of large language models, no one knew for sure what might be possible in the future with vast quantities of what were then the most powerful chips. Some officials believed that keeping China dependent on US supplies would no longer be enough. It was time, they judged, to build support across the administration for cutting off the chips themselves.\nFormer officials recall being motivated by a combination of different risks. Some say the idea of artificial general intelligence was explicitly on their mind. (While there is no universally accepted definition of AGI, the term generally refers to an AI system superior to humans across all intellectual fields.) Others say they were concerned more about specific AI capabilities, whether things that had already been envisioned—supercharged propaganda, automated cyber hacking, synthetic bioweapons—or ones yet to be foreseen. Others say their worries were not even directly related to AI, pointing to reporting that a Chinese company may have used US software to develop chips that in turn powered a supercomputer used to develop hypersonic missiles for the People’s Liberation Army. The stakes were especially high, some believed, because a powerful AI system might be used to develop even more capable AI systems, compounding a country’s lead and leaving competitors not just incrementally behind, but wallowing in a bygone paradigm. If some of these fears sound vague or far out, that’s because they are. Policymakers, however, are forced to take action in the face of uncertainty, and here, the uncertainty itself was cause for alarm.\nThe prescription that officials came up with to meet this challenge—a broad effort to limit China’s independent access to computing power—would require buy-in from across the federal government, including several cabinet secretaries and the president himself.\nExecution\nNot everyone was on board at first. The White House team had identified risks that demanded action, but there would also be costs. Nvidia, one of the crown jewels of US tech, would be banned from selling some of its most lucrative products to an enormous growing market. Producers of chipmaking equipment, such as Applied Materials and Lam Research, would lose the ability to sell their advanced products to Chinese factories. Experts believed that China might still eventually succeed in developing its own independent semiconductor ecosystem, and cutting the country off could motivate actors around the world to build an America-free supply chain to avoid future disruptions.\nFormer White House officials say they worked intensively to understand the potential blowback. The Chinese government’s reaction to the move would clearly be negative, but no one could know what form it would take. Would Beijing target iconic US firms like Apple? Cut off supplies of critical minerals? If China retaliated hard, what options would Washington have?\nThen there were the specifics. How would the policy distinguish between equipment that really posed a risk, and products companies should still be able to sell? Estevez says he remembers the White House pushed for restrictions on a larger number of items, while the Commerce Department, which is responsible for promoting economic growth, sought a more tailored approach. “Trying to hold China back is a fool’s errand,” Raimondo, the commerce secretary, told The Wall Street Journal toward the end of Biden’s term, describing export controls as mere “speed bumps” for China.\nYet the administration kept plowing forward. Several former officials specifically cited Chhabra’s bureaucratic skill and determination as central to making the chip strategy happen. “American technology should not enable adversaries to build AI capabilities that will be turned against American troops, strategic assets, and critical infrastructure,” says Chhabra, now out of government and leading national security policy at Anthropic. “Strong export controls are essential for America's national security and AI dominance.”\nIt’s not unusual for a group of scholars with a bold new vision for policy to join the government, but it’s far less common for their ideas to be put swiftly into action. “Look, Tarun and I argued all the time,” says Estevez, but “moving in the same direction was not the issue.” At least among this group of staffers, the core dispute wasn’t over whether they should try to constrain China, but over how—broad restrictions versus targeted measures that preserved more flexibility for industry.\nFinding that balance has been a moving target. After the first round of controls in October 2022, the Biden administration decided it needed to further tighten restrictions. Officials had already banned Nvidia from selling its best AI training chip to China, but the company then developed a new, China-specific chip with capabilities that pushed right up to the limits of the existing rules. In October 2023 and December 2024, the Biden administration tightened the controls on both chips and chipmaking equipment to plug what were perceived as unintentional loopholes.\nTo make any of this stick, however, the Biden administration first needed help from Japan and the Netherlands. Keeping advanced chips out of the Chinese market was a relatively discrete task, targeting just a few products. Undermining Chinese efforts to build cutting-edge chips of their own, on the other hand, was a multinational endeavor. That’s because semiconductor fabrication relies on precision machinery and software from around the world, with particularly crucial inputs coming from the Dutch company ASML and Japanese companies such as Tokyo Electron. If the United States banned its equipment suppliers from selling to China, but Japan and the Netherlands kept selling, US businesses would lose revenue, and China would still be able to upgrade its domestic manufacturing.\nThe Biden administration had sought Japanese and Dutch cooperation at the outset, but there was no quick agreement. So the White House decided to go it alone and announced the 2022 controls before the allies signed on, knowing full well that the move would hurt US companies. The Biden administration then had to convince Tokyo and Amsterdam that joining the effort was worth losing some exports and risking Chinese retaliation. After decades at the Defense Department, Estevez was well aware that AI represented the future of warfare, he says. Whether or not an AI inflection point was coming, he knew military planners would still prefer to face a Chinese adversary that was lagging behind technologically. This idea seemed to also carry weight with allied officials. “The sales pitch to the Dutch and the Japanese was: Artificial intelligence is the future,” says Estevez. “And they bought that.”\nOne way or another, the persuasion worked. In January 2023, Japanese and Dutch national security officials joined Sullivan at Blair House, the traditional guest quarters for visiting dignitaries across from the White House, to sign an agreement to institute parallel export controls on chipmaking equipment sold to China.\nAftermath\nToday, Chhabra works at Anthropic, one of the most well-funded AI startups in the US. Buchanan is a professor at Johns Hopkins University. Khan is a fellow at the Institute for Progress, a think tank focused on innovation. Matheny left the administration in 2022 to become president and CEO of RAND, a storied research organization that often serves government clients. They are each, in various ways, still working on AI, computing, and national security. And they’re watching as the Trump administration pulls the country in seemingly conflicting directions.\nOn one hand, most of the semiconductor controls the Biden team enacted have remained in place. Earlier this year, Trump even put restrictions on another Nvidia chip called the H20, which has proven useful for certain kinds of AI development tasks. Several Biden officials said they would have also moved to cut China off from H20s if they had more time in office.\nBut after Nvidia CEO Jensen Huang reportedly began lobbying Trump, the White House abruptly reversed course. In a legally questionable move, Trump said he would authorize licenses for Nvidia to sell H20s to China in exchange for a share of the revenue.\nBuchanan says the move undermined what Republicans and Democrats had both agreed was a key national security priority. “Reversing the effective bipartisan course on China AI chip controls, when those chips matter more than ever, is a unilateral surrender,” he says.\nTrump, however, has described the situation very differently. “The H20 is obsolete. You know, it’s one of those things, but it still has a market,” he said at a press conference on Monday. “So we negotiated a little deal.”"
    },
    {
      "url": "https://www.delawarepublic.org/2025-08-12/a-look-at-the-deal-to-allow-nvidia-chip-sales-to-china-in-exchange-for-revenue",
      "text": "MICHEL MARTIN, HOST:\nWe wanted to hear more about why this deal is so significant, so we've called Peter Harrell. He's an attorney who advises companies and investors on international risks. He's a nonresident fellow at the Carnegie Endowment for International Peace. He also served as senior director for international economics in the Biden administration, and he's here with us now. Good morning.\nPETER HARRELL: Michel, thanks for having me on.\nMARTIN: So say more about what is so new about this deal. I keep hearing the word unprecedented. Is it, and how so?\nHARRELL: Well, what's new about this deal is the fact that Nvidia and AMD have agreed to pay 15% of their China revenues to the U.S. government. Traditionally, when the government has issued export control licenses, it has done so for free. Sometimes there's a very small fee of a few thousand dollars associated with processing an application. But there's just never before been this kind of concept where the government has said, we'll let you sell this stuff abroad, but you got to give us sort of a rev share, if you will - a revenue share - of what you're making.\nMARTIN: So are you hearing from other companies about this? What are they saying?\nHARRELL: Well, I think there's a lot of surprise in industry because this is very new. This is something that is unprecedented. And of course, companies are wondering what this means for them. Is this going to be a precedent that will be applied more broadly? Are other exporters, especially in the high-tech sector, going to begin to get requests to share their revenue? Or is this going to be some kind of one-off that, you know, maybe applies to Nvidia and AMD but won't apply more broadly?\nMARTIN: Well, traditionally, though - haven't been a consideration about selling technology where national security concerns were paramount. Does this shift the priority?\nHARRELL: Well, that is why, from a policy level, this is so unprecedented. Traditionally, the government has not charged a fee because it has been reviewing these licenses solely on the basis of, does allowing this export to China hurt U.S. national security, or does it help U.S. industry in ways that do not hurt national security? So they'd review the product and see, well, this is just, you know, too high-risk a piece of equipment or too advanced a chip to go to China, and there's never been a financial part of this.\nAnd this, I worry, really changes the incentives for the government because instead of reviewing this license application on the basis of, does allowing China to buy this chip hurt U.S. national security? - now the government's going to be thinking, well, maybe it does or it doesn't hurt U.S. national security, but we could get 15% out of this. And that really changes the incentive structure and the basis on which these things have historically been granted.\nMARTIN: So to that end, a number of national security experts sent a letter to Secretary of Commerce Howard Lutnick last month expressing concern over the exports of these chips to China. The president on Monday said at a press conference that there's nothing to worry about. Do you have an opinion about who's right here?\nHARRELL: So I do think these - selling these chips to China poses a national security risk. I take President Trump's point that these are not actually the most advanced chips anymore. These are chips that are two or three years out of date. That said, they are still more advanced than anything China can make indigenously. And so this is giving China a computer - compute capability that it wouldn't otherwise have. And, of course, simply charging Nvidia 15% does nothing to address the national security risk. You could think about ways to address the national security risk. Maybe only sell them even older chips, not even chips this advanced, or maybe limit, you know, very specifically and very carefully who can use these chips. But simply taking 15% off the top doesn't do anything to address potential national security risks.\nMARTIN: So before I let you go, we have about a minute left here. A number of the president's policies, particularly these kind of unprecedented ones, have experienced legal challenges. Some have been successful. Some have not. Do you anticipate a legal challenge to this, and who would bring it?\nHARRELL: So, Michel, I think your last point there is really the key question. Who would bring it? I do think there are questions about whether this is legal. Congress in 2018, when it passed a new export control law, included a provision in that law that appears to prohibit the Commerce Department from collecting fees for export control licenses. The statute says no fees shall be collected or required, so there would seem to be a basis for a legal challenge. That said, you know, Nvidia and AMD just agreed to this deal, so it's hard for me to see them turning around and suing over it. I think that if this becomes more common - if the Commerce Department starts saying, we want 15% across the board to other exporters - down the road, you may see a legal challenge.\nMARTIN: That's Peter Harrell. He's a nonresident fellow at the Carnegie Endowment for International Peace. Mr. Harrell, thank you so much.\nHARRELL: Thank you.\n(SOUNDBITE OF BROKEBACK'S \"ANOTHER ROUTINE DAY BREAKS\") Transcript provided by NPR, Copyright NPR.\nNPR transcripts are created on a rush deadline by an NPR contractor. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record."
    }
  ],
  "argos_summary": "President Trump has struck a controversial deal with Nvidia, allowing the company to sell its H20 chips to China in exchange for a 15% revenue share, reversing earlier bans imposed by his administration. This decision has raised concerns about national security, as the H20 chips, while considered obsolete, still provide advanced capabilities that could benefit China. The Biden administration had previously implemented strict export controls to limit China's access to advanced semiconductors, driven by fears of AI advancements giving China a significant military and economic edge.",
  "argos_id": "6A5UK7HM2"
}