{
  "url": "https://www.washingtontimes.com/news/2025/aug/14/war-weary-ukraine-skeptical-summit-russia-advances-battlefield/",
  "authorsByline": "https://www.washingtontimes.com/staff/guillaume-ptak/, Mike Glenn, Guillaume Ptak, Guillaume Ptak and Mike Glenn, The Washington Times https://www.washingtontimes.com, https://www.washingtontimes.com/staff/mike-glenn/",
  "articleId": "aa6439a54ac94e1b98e722e6c376e8a6",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2025/08/07/Russia_Ukraine_War_73338_c0-242-5808-3630_s1200x700.jpg?2eea077db11081564a9c9ccf41d000f90ed9795c",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T22:00:57+00:00",
  "addDate": "2025-08-14T22:08:34.941050+00:00",
  "refreshDate": "2025-08-14T22:08:34.941053+00:00",
  "score": 1.0,
  "title": "War-weary Ukraine skeptical of summit as Russia advances on battlefield, spreads chaos in Europe",
  "description": "Russia’s battlefield breakthrough in Ukraine this week and the Kremlin’s relentless sabotage campaign across the rest of Europe are ratcheting up the already high stakes for President Trump ahead of Friday’s summit — and worrying already pessimistic Ukrainians.",
  "content": "KYIV — Russia’s battlefield breakthrough in Ukraine this week and the Kremlin’s relentless sabotage campaign across the rest of Europe are ratcheting up the already high stakes for President Trump ahead of Friday’s summit — and worrying already pessimistic Ukrainians.\n\nAmid troubling reports that Russian forces have pierced Ukrainian lines in Donbas and a warning from Norway that Russian hackers temporarily seized control and sabotaged operations of a hydroelectric dam, the American president will host Vladimir Putin, his Russian counterpart, for a face-to-face meeting at a military base in Anchorage, Alaska.\n\nUkrainian President Volodymyr Zelenskyy and his allies among European leaders expressed cautious optimism Thursday that Mr. Trump has taken heed of repeated warnings that the Russian leader cannot be trusted, and they collectively praised Mr. Trump for his support for an international force they are mustering to enforce the terms of any eventual peace agreement.\n\nBut on the battered streets of Kyiv, optimism is in short supply.\n\n“I don’t expect anything. What negotiations can you have without Ukraine?” Oleksandra Pobol, a Kyiv resident who recently lost her home to a Russian missile attack, told a Globe and Mail reporter.\n\nHer skepticism was echoed by Oleksandra Kozlova, another war-weary Kyiv resident. The 39-year-old, who works at a digital agency in Kyiv, told The Associated Press Wednesday that she believes Ukrainians “have already lost hope” that meaningful progress can be made toward ending the war.\n\nCar salesman Anton Vyshniak told the wire service that Ukraine’s priority now should be saving the lives of its military service members, even at the expense of territorial concessions.\n\n“At the moment, the most important thing is to preserve the lives of male and female military personnel. After all, there are not many human resources left,” he said. “Borders are borders, but human lives are priceless.”\n\nSome Ukrainians are resigned to losing territory.\n\n“I want them to agree to some kind of truce. We have been fighting for a long time,” a resident identified only as Volodymyr told the Kyiv Post. He said he was prepared to lose some long-occupied parts of Ukraine, like Donetsky and Crimea, if it meant peace.\n\nArtem Fysun, a soldier with the Peaky Blinders drone unit, predicted in an interview with the Kyiv Independent that the Trump-Putin talks would produce nothing.\n\n“These negotiations will lead nowhere,” he said. “It’s unlikely that Putin, Trump and even Zelenskyy will be able to agree on stopping the war because I see that on the front line, Putin is not stopping.”\n\nDespite the pessimism, Mr. Zelenskyy’s approval rating remains solid, stabilized at 67%, down from a high of 84% in the early days of the war, according to a recent Gallup poll.\n\n“Zelenskyy remains popular and the military retains overwhelming public trust,” Gallup officials said. “Yet, confidence in several national institutions remains below 50%.”\n\nMeanwhile, as Mr. Putin pushes his advantage on the battlefield in Ukraine, the Kremlin is also being blamed for an escalating series of sabotage and infrastructure attacks across Europe, with the most recently reported incident involving the April takeover of the hydroelectric dam in Norway.\n\nThe director of the Norwegian Police Security Service, Beate Gangas, said the attacks are increasingly being carried out against Western nations to stoke fear and unrest.\n\nA recent report from the Center for Strategic and International Studies documented more than 200 clandestine incidents linked to Russia between January 2022 and March 2025, tracking a campaign of disruption across Europe blamed on Russia that Western officials described as “reckless.”\n\nSince Moscow’s invasion of Ukraine, Western officials have accused Russia and its proxies of staging dozens of attacks and other incidents, ranging from vandalism to arson and attempted assassination.\n\nIntelligence officials tell The Washington Times the campaign is becoming more violent.\n\nDuring the Norway dam attack, hackers gained access to a digital system that remotely controls one of the dam’s valves and opened it to increase the water flow. The valve was open for about four hours but did not pose a danger to the surrounding area.\n\nAccording to the author of the CSIS sabotage report, Seth G. Jones — a former senior official in the U.S. Defense Department — the number of Russian hybrid operations in Europe tripled between 2023 and 2024, after already quadrupling the year prior.\n\n“Putin sees Western military support for Ukraine as escalation. And because there’s only so much he can do to escalate inside Ukraine, he’s now turning to asymmetric hybrid operations elsewhere in Europe,” said Ned Price, a former CIA analyst and State Department spokesman under the Biden administration. “These are unattributable, asymmetric actions — but the pattern is increasingly clear.\n\nMany of these plots and attacks are being carried out at the behest of Russian intelligence services.”\n\nThe CSIS report notes that the primary targets of these Russian operations include transport infrastructure (27%), public institutions (27%), critical energy and communication systems (20%), and companies involved in Ukraine-related military logistics (21%).\n\n“This isn’t new. The Kremlin never stopped using the tools of sabotage, disinformation, cyberwarfare and targeted killings,” Mr. Price told The Times.\n\nThis story is based in part on wire service reports.",
  "medium": "Article",
  "links": [
    "https://goo.gl/forms/xGjXcUKYsKxMeCUl1"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Russian hybrid operations",
      "weight": 0.07130916
    },
    {
      "name": "Russian intelligence services",
      "weight": 0.06933445
    },
    {
      "name": "Russian forces",
      "weight": 0.0655831
    },
    {
      "name": "Russian hackers",
      "weight": 0.06508175
    },
    {
      "name": "Mr. Trump",
      "weight": 0.064674124
    },
    {
      "name": "Ukraine",
      "weight": 0.064345315
    },
    {
      "name": "Western military support",
      "weight": 0.062555686
    },
    {
      "name": "wire service reports",
      "weight": 0.061853737
    },
    {
      "name": "Mr. Putin",
      "weight": 0.061806943
    },
    {
      "name": "Russian",
      "weight": 0.061038453
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.986328125
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.9658203125
    },
    {
      "name": "/News/World News",
      "score": 0.9384765625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.921875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.70263671875
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.5390625
    }
  ],
  "sentiment": {
    "positive": 0.05682963,
    "negative": 0.7715923,
    "neutral": 0.17157805
  },
  "summary": "Ukraine is skeptical of a summit between President Trump and Russian President Vladimir Putin, due to reports that Russian forces have advanced on Ukrainian lines in Donbas and a warning from Norway that Russian hackers had taken control and sabotaged operations of a hydroelectric dam. Ukraine's President, Volodymyr Zelenskyy, and allies among European leaders expressed cautious optimism that Mr. Trump has taken heed to warnings that Russian leader cannot be trusted. However, some residents believe that meaningful progress will not be made towards ending the war. The Kremlin is also being blamed for an increasing series of sabotage and infrastructure attacks across Europe, with the most recent incident involving the April takeover of the hydroelectric Dam in Norway. A recent report from the Center for Strategic and International Studies documented over 200 clandestine incidents linked to Russia between 2022 and 2025.",
  "shortSummary": "Ukraine is pessimistic about the prospects of a potential summit with Russia, amid escalating sabotage and violence from Moscow across Europe.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "57dcf9ed59794d01a31f279f9730e89d",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Russia's recent military advances in Ukraine and its ongoing sabotage efforts across Europe are raising concerns ahead of a summit between President Trump and President Putin. While Ukrainian leaders express cautious optimism about Trump's support for an international peace force, many Ukrainians remain skeptical about the potential for meaningful negotiations, with some resigned to territorial losses for the sake of peace. Concurrently, a report highlights a surge in Russian hybrid operations in Europe, indicating a shift in tactics as Moscow responds to Western military support for Ukraine.",
  "argos_id": "6BDI6LZ5D"
}