{
  "url": "https://www.latimes.com/sports/lakers/story/2025-08-14/lakers-2025-2026-schedule",
  "authorsByline": "By Thuc Nhi NguyenStaff Writer  Follow",
  "articleId": "cea4fc89574d49c6b7f146b40994656d",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/0c466f6/2147483647/strip/true/crop/2938x1542+0+0/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb0%2Ff3%2F567d466b48e091d4e222808fdd94%2Faptopix-lakers-mavericks-basketball-69004.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T20:24:27.967000+00:00",
  "addDate": "2025-08-14T20:28:34.076545+00:00",
  "refreshDate": "2025-08-14T20:28:34.076547+00:00",
  "score": 1.0,
  "title": "2025-26 Lakers schedule: Lakers open at home and later face formidable Grammy road trip",
  "description": "LeBron James and Luka Doncic will lead the Lakers through the 2025-26 NBA schedule, which includes a tough Grammy road trip later in the season.",
  "content": "LeBron James, center, and Luka Doncic are set to lead the Lakers through an NBA schedule that includes a season opener and Christmas game at home.\n\nAs LeBron James enters his record-setting 23rd NBA season and superstar Luka Doncic back for his first full season in L.A., the Lakers are tied with the NBA champion Oklahoma City Thunder, the Golden State Warriors and the New York Knicks for the most nationally televised games in the league.\n\nThe NBA announced the regular season schedule Thursday, and the Lakers’ slate highlights the league’s growing number of broadcast partners. The Lakers open the season at home against the Golden State Warriors on Oct. 21 on NBC, have ABC/ESPN’s 5 p.m. primetime slot against the Houston Rockets on Christmas Day and will welcome a familiar face back to Crypto.com Arena on Nov. 28 on Prime.\n\nAnthony Davis’ return to L.A. with the Dallas Mavericks at 7 p.m. on Nov. 28 will wrap up NBA Cup group play. The former Lakers star forward was injured during what was going to be his return to L.A. last season after he was traded to the Mavericks in a shocking trade.\n\nNow in its third year, the NBA Cup will begin on Oct. 31 with the Lakers playing at Memphis in West Group B that also includes the New Orleans Pelicans, the Clippers and the Mavericks. The Lakers have their second group game at New Orleans on Nov. 14 before playing the Clippers on Nov. 25 in Inglewood, where the game is scheduled to begin at 8 p.m. PST on NBC, the latest starting time for any in-season tournament game.\n\nThe NBA released only 80 of 82 regular-season games for each team as the final two games in December will be announced based on NBA Cup standings. The knockout rounds for the tournament begin on Dec. 9.\n\nThe Lakers’ annual Grammy trip will have a hometown interlude as the two-week-long road trip includes a game at the Clippers on Jan. 22 at 7 p.m. But the meeting in Inglewood doesn’t necessarily ease the travel load as it is the second of the nine-game trip, sandwiched between games at Denver (Jan. 20) and Dallas (Jan. 24).\n\nAfter returning from the trip, the Lakers have an eight-game homestand, highlighted by a Feb. 22 game against the Boston Celtics, when the franchise will unveil a Pat Riley statue outside Crypto.com Arena, the team announced Thursday. The coach of the Showtime Lakers who guided the team to four NBA championships will be the 14th statue in the arena’s Star Plaza.\n\nThe Lakers begin training camp Sept. 29 before playing six preseason games, beginning in Palm Springs on Oct. 3 against the Suns. The slate also includes a game against the Mavericks in Las Vegas on Oct. 15.\n\n21: Golden State, 7; 24: Minnesota, 7; 26: at Sacramento, 6; 27: Portland, 7:30; 29: at Minnesota, 6:30; 31: at Memphis, 6:30.\n\n2: Miami. 6:30; 3: at Portland, 7; 5: San Antonio, 7; 8: at Atlanta, 5; 10: at Charlotte, 4; 12: at Oklahoma City, 6:30; 14: New at Orleans, 5; 15: at Milwaukee, 5; 18: Utah, 7:30; 23: at Utah, 5; 25: at Clippers, 8; 28: Dallas, 7; 30: New Orleans, 6:30.\n\n1: Phoenix, 7; 4: at Toronto, 4:30; 5: at Boston, 4; 7: at Philadelphia, 4:30; 18: at Utah, 6; 20: at Clippers, 7:30; 23: at Phoenix, 6; 25: Houston, 5; 28: Sacramento, 6:30; 30: Detroit, 7:30.\n\n2: Memphis, 7:30, 4: Memphis, 6:30; 6: at New Orleans, 5; 7: at San Antonio, 4:30; 9: Milwaukee, 7:30; 12: at Sacramento, 7; 13: Atlanta, 7:30; 15: Charlotte, 7:30; 17: at Portland, 7; 18: Toronto, 6:30; 20: at Denver, 7; 22: at Clippers, 7; 24: at Dallas, 5:30; 26: at Chicago, 5; 28: at Cleveland, 4; 30: at Washington, 4.\n\n1: at New York, 4; 3: at Brooklyn, 4:30; 5: Philadelphia, 7; 7: Golden State, 5:30; 9: Oklahoma City, 7; 10: San Antonio, 7:30; 12: Dallas, 7; 20: Clippers, 7; 22: Boston, 3:30; 24: Orlando, 7:30; 26: at Phoenix, 6; 28: at Golden State, 5:30.\n\n1: Sacramento, 6:30; 3: New Orleans, 7:30; 5: at Denver, 7; 6: Indiana, 7:30; 8: New York, 12:30; 10: Minnesota, 8; 12: Chicago, 7:30; 14: Denver, 5:30; 16: at Houston, 6; 18: at Houston, 6:30; 19: at Miami, 5; 21: at Orlando, 4; 23: at Detroit, 4; 25: at Indiana, 4; 27: Brooklyn, 7:30; 30: Washington, 7; 31: Cleveland, 7:30.\n\n2: at Oklahoma City, 4:30; 5: at Dallas, 4:30; 7: Oklahoma City, 7:30; 9: at Golden State, 7; 10: Phoenix, 7:30; 12: Utah, 5:30.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/sports/lakers/story/2025-06-29/lebron-james-exercises-player-option-sets-nba-record",
    "https://www.latimes.com/sports/lakers",
    "https://www.latimes.com/sports/lakers/story/2025-08-08/lakers-open-season-at-home-against-the-warriors",
    "https://www.latimes.com/sports/lakers/story/2025-08-02/lakers-luka-doncic-three-year-165-million-dollar-contract-extension",
    "https://www.latimes.com/sports/lakers/story/2025-02-01/lakers-luka-doncic-mavericks-anthony-davis-blockbuster-trade",
    "https://www.latimes.com/sports/story/2025-03-05/lebron-james-50-thousand-career-points-lakers-milestone-luka-doncic"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Christmas game",
      "weight": 0.091718
    },
    {
      "name": "games",
      "weight": 0.08873885
    },
    {
      "name": "NBA Cup",
      "weight": 0.08499553
    },
    {
      "name": "Lakers",
      "weight": 0.081923805
    },
    {
      "name": "New Orleans",
      "weight": 0.08099031
    },
    {
      "name": "NBA Cup standings",
      "weight": 0.08085695
    },
    {
      "name": "NBA Cup group play",
      "weight": 0.080251254
    },
    {
      "name": "NBA",
      "weight": 0.07716962
    },
    {
      "name": "New York",
      "weight": 0.07501905
    },
    {
      "name": "last season",
      "weight": 0.07484263
    }
  ],
  "topics": [
    {
      "name": "Basketball"
    },
    {
      "name": "Grammy Awards"
    },
    {
      "name": "NBA"
    },
    {
      "name": "Los Angeles Lakers"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    },
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9873046875
    },
    {
      "name": "/Sports/Team Sports/Basketball",
      "score": 0.96044921875
    }
  ],
  "sentiment": {
    "positive": 0.18533018,
    "negative": 0.22317,
    "neutral": 0.5914998
  },
  "summary": "The Los Angeles Lakers will play their regular season schedule for 2025-26, which includes a home game against the Golden State Warriors on Oct. 21 on NBC, a Christmas game against Houston Rockets on Christmas Day and a return to the Dallas Mavericks on Nov. 28. The Lakers are tied with the NBA champion Oklahoma City Thunder, the Golden state Warriors, and the New York Knicks for the most nationally televised games in the league. The team's annual Grammy trip will feature a two-week-long road trip, which will be followed by an unveiling of a Pat Riley statue outside the arena's Star Plaza. The NBA Cup will begin on October 31 with the Lakers playing at Memphis in West Group B.",
  "shortSummary": "The Lakers have a challenging season opener and a challenging Grammy road trip, featuring LeBron James and Luka Doncic, with all of them on home soil.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "644ccf300678437fa473b985981f2537",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/sports/lakers/story/2025-08-08/lakers-open-season-at-home-against-the-warriors",
      "text": "Lakers open season at home against the Warriors, will host Rockets on Christmas Day\n- Share via\nLakers and NBA fans in general will get a quick view of two of the league’s longtime greats when LeBron James and the Lakers open the regular season against Stephen Curry and the Golden State Warriors on Oct. 21 at Crypto.com Arena, the league announced Tuesday morning.\nThe game, scheduled to tip off at 7 p.m., will be nationally televised on NBC and it will give Lakers fans a chance to see Luka Doncic’s new and trimmed body.\nAlso, the Lakers will play the Houston Rockets and newly acquired Kevin Durant on Christmas Day at home, one of five games on the holiday being broadcast by ABC and ESPN. The game, set to tip off at 5 p.m., will give fans another chance to see the league’s veteran superstars go at it again.\nThe NBA will release the full schedule soon.\nThe Lakers will start training camp Sept. 29 and will play six preseason games.\nThe first preseason game is against the Suns at Acrisure Arena in Palm Springs on Oct. 3. The rest of the preseason game are: at Golden State on Oct. 5; against the Warriors at Crypto.com Arena on Oct. 12; against the Suns in Phoenix on Oct. 14; against the Dallas Mavericks at T-Mobile Arena in Las Vegas on Oct. 15; against the Sacramento Kings at home on Oct. 17."
    },
    {
      "url": "https://www.latimes.com/sports/lakers/story/2025-06-29/lebron-james-exercises-player-option-sets-nba-record",
      "text": "- Share via\nLakers superstar LeBron James will once again make NBA history by playing in his 23rd NBA season.\nJames exercised his player option for $52.6 million to play for the Lakers during the 2025-26 season, his agent and CEO of Klutch Sports Rich Paul told The Times on Sunday morning.\nJames, the NBA’s all-time leading scorer, had been tied with Vince Carter for the most seasons played in the NBA at 22. This will be James’ eighth season with the Lakers.\nJames, 40, is 50 games from breaking Hall of Famer Robert Parish’s record for the most games played in the regular season.\nThe Lakers helped address a need to increase their athleticism at the wing by acquiring Arkansas’ Adou Thiero, the No. 36 overall pick of the NBA draft.\nJames averaged 24.4 points per game last season, 8.2 assists and 7.8 rebounds.\nFellow Laker Dorian Finney-Smith reportedly declined his $15.3-million player option and will pursue free agency, a person with knowledge of his decision told The Times. Finney-Smith, who is coming off a strong season with the Lakers, is expected to be pursued by multiple teams. He could still return to the Lakers. ESPN was first to report Finney-Smith’s decision.\nLast week, Austin Reaves declined the team’s maximum offer of four years for $89 million, according to a person with knowledge of the situation.\nReaves, 27, still has two years left on his deal, for $13.9 million next season and $14.9 million in the 2026-27 season, and he holds a player option for the last year of his deal.\nHe was third on the Lakers in scoring last season, averaging career-highs in scoring (20.2), assists (5.8), rebounds (4.5) and minutes per game (34.9). He shot 46% from the field and 37.7% from three-point range.\nWith the James and Smith player option questions resolved Sunday, the Lakers are focused on filling out their roster. They added an athletic wing player when they acquired Adou Thiero in a trade with the Minnesota Timberwolves, who drafted him with the 36th pick in the second round.\nThe most pressing need for the Lakers remains a center, and they’ll have to look into free agency or via trade to acquire one.\n“As I said at the end of the year, we know one of the things we have to address is the center position and that’s clearly going to be one of our focuses as we begin the free-agency period,” Rob Pelinka, the Lakers’ president of basketball operations, told Spectrum SportsNet after the second round of the draft Thursday. “So, we’re looking forward to just putting in the hard work and making sure we take care of all the needs on the roster to give [Lakers coach] JJ [Redick] the tools he needs for this team to be great next season.”\nWhile exercising his option required a commitment from James, he continues to closely monitor the moves of a franchise that has been through sweeping changes during the last year.\nThe Lakers hired JJ Redick, a widely respected basketball mind with no previous head coaching experience, and drafted James’ son Bronny.\nThe franchise later executed a blockbuster trade, sending All-Star center Anthony Davis to Dallas in exchange for All-Star guard Luka Doncic.\nRedick helped lead the Lakers to the playoffs before injuries and the lack of a center sealed the end of the team’s season.\n“I don’t know what the roster will look like. I don’t know where I stand right now, but I think whatever happens, I think JJ is gonna continue to grow,” James said after the team was eliminated from the playoffs. “Thought he had a hell of a rookie campaign for a rookie coach. And it’s a lot different being a rookie coach. It’s already hard being a rookie coach in the NBA. And it’s a hell of a lot harder being a rookie head coach coaching the Lakers. It’s a whole ’nother ballgame.\n“And I thought he handled it extremely well. I thought he just learned every single day, held us accountable. He pushed us. I thought JJ and his coaching staff were great throughout the whole season. That was pretty cool.”\nLeBron James becoming the first NBA player to reach 50,000 career points was meaningful because it created another way to appreciate his sustained excellence.\nJames wouldn’t commit to a decision about his future shortly after the Lakers were eliminated from the playoffs by the Minnesota Timberwolves, striking a tone similar to his comments after playoff series losses the previous two years.\n“I don’t have an answer to that,” James said to questions about his future. “Something I sit down with my family, my wife and my support group and kind of just talk through it and see what happens. And just have a conversation with myself on how long I want to continue to play.\n“I don’t know the answer to that right now, to be honest.”\nThe Lakers delivered another twist earlier this month, with Jeanie Buss and her family selling majority control of the Lakers to Dodgers majority owner Mark Walter and TWG Global investment group.\nPaul told ESPN that James resumed on-court basketball activity this week after suffering a sprained MCL in his left knee during the playoffs and is watching how the Lakers build around the 26-year-old Doncic.\n“LeBron wants to compete for a championship,” Paul told ESPN. “He knows the Lakers are building for the future. He understands that, but he values a realistic chance of winning it all. We are very appreciative of the partnership that we’ve had for eight years with Jeanie [Buss] and Rob [Pelinka] and consider the Lakers as a critical part of his career.\n“We understand the difficulty in winning now while preparing for the future. We do want to evaluate what’s best for LeBron at this stage in his life and career. He wants to make every season he has left count, and the Lakers understand that, are supportive and want what’s best for him.”"
    },
    {
      "url": "https://www.latimes.com/sports/story/2025-03-05/lebron-james-50-thousand-career-points-lakers-milestone-luka-doncic",
      "text": "- Share via\nAnother night, another milestone for LeBron James, although this one did indeed resonate more than most.\nBecoming the first NBA player to reach 50,000 career points created a particularly alluring way to express and appreciate James’ sustained excellence over 22 seasons. Just another number, sure, but a very large one, previously unattained.\nIt even caused James, 40, to pause and reflect.\n“It’s a hell of a lot of points, and I’m super blessed to be able to put that many points up in the best league in the world with the best players in the world over my career,” he told Spectrum SportsNet in an on-court interview after the Lakers defeated the New Orleans Pelicans 136-115 at Crypto.com Arena on Tuesday.\n“It’s pretty special.”\nLeBron James has 34 points and Luka Doncic has 30 points and 15 assists in easy victory over New Orleans.\nJames had a couple of days to prep his remarks. He entered the game one point shy of 50,000 in regular season and playoff games combined, having long ago surpassed Kareem Abdul-Jabbar’s previous record of 44,149.\nMidway through the first quarter, James made a three-point shot from the wing off an assist from his exceptional new running mate, Luka Doncic. James finished with 34 points, eight rebounds and six assists, improving the Lakers’ sparkling record to 39-21.\nThe addition of Doncic has clearly invigorated James, who was named the Western Conference Player of the Month for averaging 29.3 points, 10.5 rebounds and 6.9 assists in February. As with most of his accomplishments these days, James is the oldest player to earn the award, which has been his 41 times.\nTeaming with James has invigorated Doncic as well. The five-time All-NBA guard has scored an impressive 13,841 points in six-plus seasons. He could barely fathom 50,000.\n“It’s amazing,” Doncic told reporters. “Watching him do this stuff at this age, it’s just unbelievable. Like 50K points ... it’s, I can’t even explain how insane that is. He might get to 70K, you never know.”\nLeBron James has surpassed Kareem Abdul-Jabbar’s 38,387 NBA points, a benchmark set when the legendary Lakers center retired 36 years ago.\nKarl Malone is the only player besides James and Abdul-Jabbar to reach even 40,000 points, and the closest active player is Kevin Durant with 35,225 points through Tuesday.\nJames is at 50,033 — and counting."
    },
    {
      "url": "https://www.latimes.com/sports/lakers/story/2025-02-01/lakers-luka-doncic-mavericks-anthony-davis-blockbuster-trade",
      "text": "- Share via\nNEW YORK — The Lakers pulled off a stunning trade Saturday night, sending center Anthony Davis to the Dallas Mavericks in a three-team deal for star guard Luka Doncic to set up the organization for its post-LeBron James era with one of the NBA’s best young players.\nThe deal happened after the Lakers beat the New York Knicks 128-112 in Madison Square Garden, according to people with knowledge of the situation not authorized to speak publicly. The Lakers sent Davis, young guard Max Christie and their 2029 first-round draft pick to Dallas for Doncic and forwards Maxi Kleber and Markieff Morris. The Lakers also sent second-year guard Jalen Hood-Schifino to the Utah Jazz, who got second-round picks from the Lakers (their 2025 pick from the Clippers) and Mavericks to facilitate the trade.\nThe trade happened 17 years to the day after the Lakers acquired Pau Gasol in a deal that helped set up the franchise’s championships in 2009 and 2010.\nLeBron James finishes with 33 points, 12 assists and 11 rebounds to power the Lakers to a 128-112 victory over the New York Knicks.\nAccording to one Laker not authorized to speak publicly, the trade was a complete shock to the players and came after one of their best wins of the season.\nAccording to people with knowledge of the trade talks not authorized to discuss the deal, it occurred without the knowledge any of players, including James, and was done almost completely between general managers Rob Pelinka of the Lakers and Nico Harrison, who joined the Mavericks after being a longtime Nike executive. The two have an extensive history dating to Kobe Bryant’s time with the sneaker brand.\nPeople briefed on the trade said it was made with complete alignment between ownership, the front office and the coaches. The Lakers were approached by Dallas and couldn’t turn down the chance to chart their future after James.\n“My first thought is how are LeBron James and Luka Doncic going to play together?” one rival team executive said. “My second thought, if you’re getting Luka Doncic, you do it anyways.”\nQuestions about the future of James, who holds a no-trade clause and can opt out of a $52.6-million player option and become a free agent after this season, are being asked by executives on rival teams.\nIn Doncic, the Lakers have acquired one of the premier on-ball players in the world. He’s a five-time All-Star, a five-time All-NBA player who led the Mavericks to the NBA Finals a season ago. He’s averaging 28.1 points, 8.3 rebounds and 7.8 assists this season and is recovering from a calf injury that’s kept him out since Christmas. He’s expected back before the All-Star break.\nESPN’s Tim McMahon reported that the Mavericks were uneasy with a long-term commitment to Doncic because of persistent conditioning issues. Doncic is under contract for the next two seasons and eligible for an extension this summer.\nWith the Lakers acquiring Luka Doncic while trading Anthony Davis, expect more moves and questions about the LeBron James era in Los Angeles.\nDavis, an NBA champion with the Lakers in 2020 and in the middle of another All-Star season, rejoins an assistant from that championship team in Mavericks coach Jason Kidd and, like Pelinka, has extensive ties with Harrison through Nike. Davis joins a Mavericks team that has Kyrie Irving, Klay Thompson and an emerging two-way player in Christie, who has played the best basketball of his career.\nTwo weeks ago, Davis lobbied for the Lakers to add another center so he could spend more time playing power forward. Dallas has two centers in Daniel Gafford and Derrick Lively II, who is out because of an ankle injury.\nThe Lakers are scheduled to return to Los Angeles from their annual Grammys road trip, in which they went 4-1, on Sunday. The Lakers are set to host Dallas for their next matchup on Feb. 25."
    },
    {
      "url": "https://www.latimes.com/sports/lakers/story/2025-08-02/lakers-luka-doncic-three-year-165-million-dollar-contract-extension",
      "text": "‘Just the beginning’: Luka Doncic on why he agreed to a three-year, $165-million contract extension\n- Share via\nA familiar playlist of Balkan hits led Luka Doncic out onto the court at the Lakers practice facility. A gallery display of photos stood in the back. Six months after first arriving here in a blockbuster trade that shocked the NBA, Doncic has good reason to finally relax.\nDoncic signed a three-year, $165-million deal with a player option in 2028 on Saturday, his agent Bill Duffy, confirmed to The Times. In 2028, he would be eligible for a five-year extension worth more than $360 million.\nIt was an exclamation point to Doncic’s summer media tour that included a “Men’s Health” article detailing his offseason workout regimen, a “Today Show” interview and a photo opp with Aaron Judge at a New York Yankees game.\nNow it’s back to basketball.\n“We have what we need to compete for the championship,” Doncic said. “I’ll try to win every game no matter what and we got some new great guys on the team so you know we’re going to go for it.”\nSeveral of Doncic’s Lakers teammates, including Marcus Smart, Deandre Ayton, Rui Hachimura, Gabe Vincent and Maxi Kleber, were seated in the background of the impromptu Saturday morning news conference. Doncic, wearing a slim-fitting black suit that showcased his widely talked about toned figure, hunched on a tall chair next to general manager Rob Pelinka.\nLuka Doncic compared favorably to Aaron Judge when they met Monday at Yankee Stadium. The star guard could sign a contract extension with the Lakers as soon as Saturday.\nAfter Doncic and Pelinka posed for the traditional photo opportunity, Lakers teammates and coach JJ Redick descended on the floor and squeezed in for a photo as Doncic held his gold No. 77 jersey.\nLess than a full season into his Lakers tenure, Doncic was a critical figure in helping construct what he proudly proclaimed could be “a team to win the championship.” He placed two calls to Smart to lure the defensive ace to L.A. after the Washington Wizards bought out his contract. A smiling Ayton stood to Doncic’s left in the photos, the 7-foot center adding a lob-catching center that will “unlock so much in Luka,” Pelinka said.\n“Our thesis for our roster was to get younger,” said Pelinka, who also added 23-year-old sharpshooting forward Jake LaRavia in free agency. “... We like the upgrades we were able to make to the roster. But by no means are we going to be satisfied. I think every year we’re on an infinite cycle to try to improve this team and win championships and we’ll stay committed to that work.”\nIn 28 games with the Lakers, Doncic averaged 28.2 points, 8.1 rebounds and 7.5 assists in 35.1 minutes per game. But the team was handily bounced from the playoffs, losing 4-1 to the Minnesota Timberwolves in a first-round series as Doncic averaged 30.2 points per game, 7.0 rebounds and 5.8 assists.\nAfter the shocking trade that sent Anthony Davis to Dallas in exchange for Doncic, the Slovenian star was criticized for his work ethic and fitness. But after working with his personal trainers, Doncic’s svelte physique has been the talk of the NBA since “Men’s Health” published a feature about how he remade his body with an offseason program focused on weightlifting, sprints and a no-sugar, high-protein diet.\nThe makeover has been perceived as Doncic’s revenge since the Mavericks traded him unceremoniously. Yet Doncic insisted he was already “on my way [to] doing it.”\n“But it was just kind of a fresh start,” Doncic added.\nThe 26-year-old’s extension was one of the biggest check marks of the Lakers’ offseason that also included LeBron James exercising his player option for $52.6 million. The 40-year-old superstar who is entering his 23rd NBA season was not present Saturday.\nSaturday’s announcement came six months to the day after Doncic joined the team in a trade that, for the first time, took focus in the Lakers organization away from James. The franchise suddenly brought in another central figure who would carry the team into its next era.\nThe move took Doncic by surprise. He wouldn’t have chosen to leave Dallas. But by signing a new deal with the Lakers, he affirmed his choice for the future.\n“We could not be more grateful for you choosing this partnership,” Pelinka said. “The best young basketball player in the universe joins, for the long-term future, the best sports franchise on the globe.”\nThe decision wasn’t difficult for Doncic, who posted on social media that the extension was “just the beginning.” He knew from his Lakers debut, after he recovered from a lingering calf injury that marred his final months with the Mavericks, that he could make a home with this franchise. The fan reception made it clear in his mind.\nDoncic has endeared himself to the community by donating to wildfire recovery in L.A., pledging funds to restore Kobe and Gianna Bryant murals around the city and paying for parking at Lakers games. On Saturday, Doncic made his first comments in Spanish, acknowledging the high number of Spanish-speaking Lakers fans. He joked that he wouldn’t speak English.\n“Being a Laker is an honor,” Doncic said, “and I wanted to be here.”"
    }
  ],
  "argos_summary": "LeBron James is set to begin his record 23rd NBA season with the Los Angeles Lakers, who will feature prominently in nationally televised games, including a season opener against the Golden State Warriors and a Christmas Day matchup against the Houston Rockets. The Lakers have made significant roster changes, trading Anthony Davis to the Dallas Mavericks for Luka Doncic, who has signed a three-year contract extension with the team. As the Lakers prepare for the upcoming season, they aim to balance immediate competitiveness with future planning, especially with James' career nearing its end.",
  "argos_id": "73QPLELGV"
}