{
  "url": "https://arstechnica.com/tech-policy/2025/08/starlink-tries-to-block-virginias-plan-to-bring-fiber-internet-to-residents/",
  "authorsByline": "Jon Brodkin",
  "articleId": "086e17ebb97146fe9485662cbe5f817c",
  "source": {
    "domain": "arstechnica.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/getty-starlink-1152x648.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T20:32:02+00:00",
  "addDate": "2025-08-14T20:39:52.366538+00:00",
  "refreshDate": "2025-08-14T20:39:52.366540+00:00",
  "score": 1.0,
  "title": "Starlink tries to block Virginia’s plan to bring fiber Internet to residents",
  "description": "SpaceX urges Trump admin to reject Virginia’s broadband grant proposal.",
  "content": "Starlink operator SpaceX is fighting Virginia's plan to deploy fiber Internet service to residents, claiming that federal grant money should be given to Starlink instead. SpaceX is already in line to win over $3 million in grant money in the state but is seeking $60 million.\n\nStarlink is poised to benefit from the Trump administration rewriting rules for the $42 billion Broadband Equity, Access, and Deployment (BEAD) grant program. While the Biden administration decided that states should prioritize fiber in order to build more future-proof networks, the Trump administration ordered states to revise their plans with a \"tech-neutral approach\" and lower the average cost of serving each location.\n\nWith the Trump administration backing its attempt to obtain more federal funding for Starlink, SpaceX is likely to object to state plans that still include significant fiber builds. That's what happened yesterday when SpaceX filed comments on Virginia's final proposal, which will be reviewed by the National Telecommunications and Information Administration (NTIA).\n\nThe Virginia plan \"represents a massive waste of federal taxpayer money, reverting to the Biden Administration's failed approach to BEAD and completely disregarding the Trump Administration's effort to restructure the program to accelerate broadband deployment and reduce spending,\" SpaceX alleged. \"Simply put, Virginia has put its heavy thumb on the scale in favor of expensive, slow-to-build fiber bias over speedy, low-cost, and technology neutral competition.\"\n\nSpaceX urged the NTIA to deny Virginia's proposal. Such an outcome could result in a dispute between the Trump administration and Virginia, which is led by a Republican governor who touted the state's broadband plan in an announcement last week.\n\nStarlink is generally seen as more beneficial in harder-to-serve areas because of its capacity limits, but Starlink and the Trump administration want satellite technology to be treated the same as fiber when it comes to giving out grants.",
  "medium": "Article",
  "links": [
    "https://cdn.arstechnica.net/wp-content/uploads/2025/08/SpaceX-Comments-to-VA-Final-Proposal-Final.pdf",
    "https://arstechnica.com/tech-policy/2025/03/starlink-benefits-as-trump-admin-rewrites-rules-for-42b-grant-program/",
    "https://www.dhcd.virginia.gov/governor-glenn-youngkin-publishes-plan-virginia-complete-broadband-access"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "state plans",
      "weight": 0.109558776
    },
    {
      "name": "Starlink operator SpaceX",
      "weight": 0.099456005
    },
    {
      "name": "federal grant money",
      "weight": 0.093245566
    },
    {
      "name": "fiber Internet",
      "weight": 0.0905206
    },
    {
      "name": "fiber Internet service",
      "weight": 0.089524694
    },
    {
      "name": "Virginia",
      "weight": 0.08699256
    },
    {
      "name": "Trump",
      "weight": 0.085358754
    },
    {
      "name": "fiber",
      "weight": 0.08346934
    },
    {
      "name": "significant fiber builds",
      "weight": 0.0831826
    },
    {
      "name": "federal taxpayer money",
      "weight": 0.08256547
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.947265625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.8603515625
    },
    {
      "name": "/News/Technology News",
      "score": 0.7255859375
    },
    {
      "name": "/Internet & Telecom/Service Providers/Other",
      "score": 0.6572265625
    },
    {
      "name": "/Internet & Telecom/Service Providers/ISPs",
      "score": 0.59033203125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.453857421875
    },
    {
      "name": "/Internet & Telecom/Service Providers/Phone Service Providers",
      "score": 0.4189453125
    }
  ],
  "sentiment": {
    "positive": 0.10121218,
    "negative": 0.5310913,
    "neutral": 0.3676966
  },
  "summary": "Starlink operator, SpaceX, is challenging Virginia's plan to deploy fiber Internet service to residents, arguing that federal grant money should be given to Starlink instead. While SpaceX is already eligible for over $3 million in grant money in Virginia, it is seeking $60 million. The Trump administration has backed Starlink's efforts to obtain more federal funding for Starlink, which is expected to benefit from rewriting rules for the $42 billion Broadband Equity, Access, and Deployment (BEAD) grant program. The final proposal for Virginia's proposal will be reviewed by the National Telecommunications and Information Administration (N.A.\n.",
  "shortSummary": "Starlink is opposing Virginia's fiber Internet deployment plan, arguing that federal grant money should be allocated to Starlink instead, amid ongoing regulatory scrutiny.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1bfa61284a8b47c18cea114d5c3f69d5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dhcd.virginia.gov/governor-glenn-youngkin-publishes-plan-virginia-complete-broadband-access",
      "text": "Virginia’s proposal, published today, will save $200 million under new rules authorized by U.S. Secretary of Commerce\nGovernor Glenn Youngkin today announced that Virginia has published a proposal to complete the Commonwealth’s goal of providing high-speed internet connection to all homes, businesses, and community centers.\nDepartment of Housing and Community Development (DHCD) published the Commonwealth’s Broadband, Equity, Access and Deployment (BEAD) Final Proposal which, once approved, will award $613 million in federal funding to connect the last 133,500 Virginia locations not yet covered by high-speed internet services.\nWhen Governor Youngkin took office in 2022, there were 435,924 customers left unserved in Virginia. With a combination of federal and state resources, the Commonwealth has funded connections to all customers statewide except 133,500 remaining customers. The plan published for public comment today will bring that number to zero.\n“Day one, we made a promise to connect all Virginia homes and businesses to reliable, high-speed internet, and these grants, once approved, will fund the last step to keeping that promise,” said Governor Glenn Youngkin. “All Virginians should be proud that we are the nation’s leader in broadband connections, having built 3.5 times more connections in the past four years than any other state. And with the new rules approved by Secretary Lutnick that cut red tape, we are able to do it while saving $200 million taxpayer dollars, a 25 percent savings.”\nThe grants for broadband installation, administered by DHCD, will be submitted to the U.S. Department of Commerce’s National Telecommunications and Information Agency (NTIA) for final approval. The funding will connect 133,500 customers to reliable, high-speed internet and leverage $434 million in private investment from internet providers.\nUnder the new “Benefit of the Bargain” grant application process at U.S. Department of Commerce, Virginia received double the applications, showing robust interest in the program’s streamlined requirements established by the Trump Administration. Through the partnership, Virginia will connect all unserved homes and businesses while also controlling costs.\n“This proposal is a significant step forward in Virginia’s broadband expansion efforts. Our approach is designed not only to connect communities but to support economic growth, education, healthcare, and public safety across the Commonwealth,” said Secretary of Commerce & Trade Juan Pablo Segura.\n“Today’s grant proposal reflects Virginia’s commitment to ensuring every community has access to the modern connectivity it needs to thrive,” said Department of Housing & Community Development Director Maggie Beal. “By utilizing a smart mix of technologies—from fiber to fixed wireless to satellite—we’re maximizing the impact of every taxpayer dollar and building a stronger, more connected Virginia.”\nVirginia’s Final Proposal is now open for public comment for a 7-day window before it is submitted to the NTIA for final approval.\nMore information on Virginia’s Final Proposal can be found at dhcd.virginia.gov/bead."
    },
    {
      "url": "https://arstechnica.com/tech-policy/2025/03/starlink-benefits-as-trump-admin-rewrites-rules-for-42b-grant-program/",
      "text": "The Trump administration is eliminating a preference for fiber Internet in a $42.45 billion broadband deployment program, a change that is expected to reduce spending on the most advanced wired networks while directing more money to Elon Musk's Starlink and other non-fiber Internet service providers. One report suggests Starlink could obtain $10 billion to $20 billion under the new rules.\nSecretary of Commerce Howard Lutnick criticized the Biden administration's handling of the Broadband Equity, Access, and Deployment (BEAD) program in a statement yesterday. Lutnick said that \"because of the prior Administration's woke mandates, favoritism towards certain technologies, and burdensome regulations, the program has not connected a single person to the Internet and is in dire need of a readjustment.\"\nThe BEAD program was authorized by Congress in November 2021, and the US was finalizing plans to distribute funding before Trump's inauguration. The National Telecommunications and Information Administration (NTIA), part of the Commerce Department, developed rules for the program in the Biden era and approved initial funding plans submitted by every state and territory.\nThe program has been on hold since the change in administration, with Senator Ted Cruz (R-Texas) and other Republicans seeking rule changes. In addition to demanding an end to the fiber preference, Cruz wants to kill a requirement that ISPs receiving network-construction subsidies provide cheap broadband to people with low incomes. Cruz also criticized \"unionized workforce and DEI labor requirements; climate change assessments; excessive per-location costs; and other central planning mandates.\"\nLutnick's statement yesterday confirmed that the Trump administration will end the fiber preference and replace it with a \"tech-neutral\" set of rules, and explore additional changes. He said:\nUnder my leadership, the Commerce Department has launched a rigorous review of the BEAD program. The Department is ripping out the Biden Administration's pointless requirements. It is revamping the BEAD program to take a tech-neutral approach that is rigorously driven by outcomes, so states can provide Internet access for the lowest cost. Additionally, the Department is exploring ways to cut government red tape that slows down infrastructure construction. We will work with states and territories to quickly get rid of the delays and the waste. Thereafter we will move quickly to implementation in order to get households connected.\nLutnick said the department's goal is to \"deliver high-speed Internet access... efficiently and effectively at the lowest cost to taxpayers.\""
    }
  ],
  "argos_summary": "SpaceX is contesting Virginia's plan to deploy fiber Internet, arguing that federal grant money should favor Starlink instead. The company is seeking $60 million in funding, claiming that Virginia's proposal represents a waste of taxpayer money by prioritizing fiber over satellite technology. The Trump administration's recent changes to the Broadband Equity, Access, and Deployment (BEAD) program support SpaceX's position, advocating for a tech-neutral approach that could benefit satellite providers like Starlink.",
  "argos_id": "7EAAY63RB"
}