{
  "url": "https://finance.yahoo.com/news/elite-pharmaceuticals-inc-reports-financial-202400614.html",
  "authorsByline": "Newsfile Corp.",
  "articleId": "99d466aafec245a1983eee7b4bcbcdbc",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/newsfile_64/2765ddbf9a5852649fe7802fa48a0abb",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T20:24:00+00:00",
  "addDate": "2025-08-14T20:31:19.483242+00:00",
  "refreshDate": "2025-08-14T20:31:19.483245+00:00",
  "score": 1.0,
  "title": "Elite Pharmaceuticals, Inc. Reports Financial Results for the First Quarter of Fiscal Year 2026 ended June 30, 2025 and Provides Conference Call Information",
  "description": "Conference Call Scheduled for Friday, August 15 at 11:30 AM EDT Northvale, New Jersey--(Newsfile Corp. - August 14, 2025) - Elite Pharmaceuticals, Inc. (OTCQB: ELTP) (\"Elite\" or the \"Company\"), a specialty pharmaceutical company developing niche generic products, announced results for the first quarter of fiscal year 2026 ended June 30, 2025 (\"First Quarter\").Consolidated revenues for the three-month period ending June 30, 2025, were $40.2 million, an increase of $21.4 million or approximately 1",
  "content": "Conference Call Scheduled for Friday, August 15 at 11:30 AM EDT\n\nNorthvale, New Jersey--(Newsfile Corp. - August 14, 2025) - Elite Pharmaceuticals, Inc. (OTCQB: ELTP) (\"Elite\" or the \"Company\"), a specialty pharmaceutical company developing niche generic products, announced results for the first quarter of fiscal year 2026 ended June 30, 2025 (\"First Quarter\").\n\nConsolidated revenues for the three-month period ending June 30, 2025, were $40.2 million, an increase of $21.4 million or approximately 114% as compared to the comparable period of the prior fiscal year. Operating profits were $21.7 million, an increase of $17.8 million or approximately 462%, as compared to the comparable period of the prior fiscal year. The increase in operating profits was primarily attributed to sales of Elite's lisdexamfetamine products, which were launched after the comparable period of the prior fiscal year, as well as overall strong growth in the Elite label product lines as compared to the comparable period in the prior fiscal year.\n\nElite's management will host a conference call to discuss the First Quarter of Fiscal Year 2026 financial results and provide an update on recent business developments. Stockholder questions should be submitted to the company in advance of the call.\n\nThe financial statements can be viewed for Elite's First Quarter of Fiscal Year 2026 on Form 10-Q here.\n\nElite Pharmaceuticals, Inc. is a specialty pharmaceutical company that develops and distributes niche generic products. Elite specializes in developing, manufacturing, and distributing oral, controlled-release drug products. Elite owns multiple generic products, which it distributes nationally under the Elite Laboratories, Inc. label. Elite also has products licensed to TAGI Pharma. Elite operates a cGMP and DEA-registered research, development, and manufacturing facility in Northvale, NJ. For more information, visit www.elitepharma.com.\n\nThis press release contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, including, without limitation, those related to the effects, if any, on future results, performance or other expectations that may have some correlation to the subject matter of this press release. Readers are cautioned that such forward-looking statements involve, without limitation, risks, uncertainties and other factors not under the control of Elite, which may cause actual results, performance or achievements of Elite to be materially different from the results, performance or other expectations that may be implied by these forward-looking statements. These forward-looking statements may include statements regarding the expected timing of approval, if at all, of products by the FDA, and the actions the FDA may require of Elite in order to obtain such approvals. These forward-looking statements are not guarantees of future action or performance. These risks and other factors are discussed, without limitation, in Elite's filings with the Securities and Exchange Commission, including its reports on forms 10-K, 10-Q, and 8-K. Elite is under no obligation to update or alter its forward-looking statements, whether as a result of new information, future events or otherwise.",
  "medium": "Article",
  "links": [
    "https://api.newsfilecorp.com/redirect/bggnNHgMkV",
    "https://api.newsfilecorp.com/redirect/244gvIzGwV",
    "https://api.newsfilecorp.com/redirect/Mqq1juvk2D"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Elite Pharmaceuticals",
      "weight": 0.105151
    },
    {
      "name": "Elite",
      "weight": 0.1027291
    },
    {
      "name": "future results",
      "weight": 0.08272761
    },
    {
      "name": "Financial Results",
      "weight": 0.08238359
    },
    {
      "name": "niche generic products",
      "weight": 0.08205275
    },
    {
      "name": "multiple generic products",
      "weight": 0.08149054
    },
    {
      "name": "actual results",
      "weight": 0.07589342
    },
    {
      "name": "statements",
      "weight": 0.075413354
    },
    {
      "name": "products",
      "weight": 0.07537775
    },
    {
      "name": "Conference Call Information",
      "weight": 0.074728325
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97607421875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9541015625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.91748046875
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.83984375
    }
  ],
  "sentiment": {
    "positive": 0.5534112,
    "negative": 0.037531596,
    "neutral": 0.40905726
  },
  "summary": "Elite Pharmaceuticals, Inc. (Elite) has announced its financial results for the first quarter of fiscal year 2026 ended June 30, 2025, with consolidated revenues for the three-month period ending June 30th 2025 at $40.2 million, an increase of $21.4 million or approximately 114% as compared to the comparable period of the previous fiscal year. Operating profits increased by $17.8 million or nearly 462% as a result of sales of Elite's lisdexamfetamine products and overall growth in the Elite label product lines. The company will host a conference call on August 15 at 11:30 AM EDT to discuss the financial results and provide an update on business developments. The financial statements can be viewed for Elite's First Quarter of Fiscal Year 2026 on Form 10-Q here.",
  "shortSummary": "Elite Pharmaceuticals reports increased revenues and operating profits, but risks and uncertainties remain in its financial statements.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e302928cf1094c4091c2bd4262f307c1",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Elite Pharmaceuticals, Inc. reported a significant increase in consolidated revenues for the first quarter of fiscal year 2026, reaching $40.2 million, a 114% rise compared to the previous year. Operating profits also surged to $21.7 million, marking a 462% increase, primarily driven by sales of lisdexamfetamine products and overall growth in Elite's product lines. A conference call is scheduled for August 15 to discuss these financial results and recent business developments.",
  "argos_id": "7W5RXN0X7"
}