{
  "url": "https://thehill.com/regulation/court-battles/5453479-minnesota-shooting-suspect-vance-boelter-indicted-on-state-charges/",
  "authorsByline": "Filip Timotija",
  "articleId": "609f032ff3dd44e09eac4ca8af81739f",
  "source": {
    "domain": "thehill.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://thehill.com/wp-content/uploads/sites/2/2025/08/AP25226801607396-e1755219667302.jpg?w=1280",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T01:01:24+00:00",
  "addDate": "2025-08-15T01:11:44.813141+00:00",
  "refreshDate": "2025-08-15T01:11:44.813146+00:00",
  "score": 1.0,
  "title": "Minnesota shooting suspect Vance Boelter indicted on state charges",
  "description": "A Minnesota man accused of killing State House Speaker Melissa Hortman and her husband, Mark, Vance Boelter, was indicted on Thursday by a grand jury on eight charges, including two counts of first…",
  "content": "A Minnesota man accused of killing State House Speaker Melissa Hortman and her husband, Mark, Vance Boelter, was indicted on Thursday by a grand jury on eight charges, including two counts of first-degree murder.\n\nHennepin County Attorney Mary Moriarty announced that Boelter, who was also accused of injuring another Democratic Party state lawmaker and his wife in June, was hit with four counts of attempted first-degree murder, two counts of first-degree premeditated murder, impersonating a police officer and animal cruelty.\n\nBoelter was accused of shooting Hortman and her husband on June 14 at their home, both of whom died from gunshot injuries. Boelter also allegedly tried to kill state Sen. John Hoffman, his wife, Yvette and the couple’s daughter, Hope.\n\nMoriarty said during a press conference that her office “received hundreds of videos and thousands of pages of reports over a period of weeks” and that her team “carefully reviewed the file and put together the evidence to present to the grand jury.”\n\nThe fourth count of attempted first-degree murder was included over Boelter’s alleged attempt to attack Democratic state Rep. Kristin Bahner, who was not home when Boelter visited while reportedly impersonating a law enforcement officer.\n\nThe anomaly cruelty charge was added over Boelter’s alleged shooting of Hortman’s dog.\n\n“These charges reflect the weight of Mr. Boelter’s crimes, and our thoughts are with Melissa and Mark Hortman’s family, the Hoffman family, Rep. Bahner, and Sen. (Ann) Rest,” Moriarty said in a statement, according to CBS News.\n\nJust one guilty verdict on the first-degree murder charges could lead to Boelter serving life in prison. Boelter pleaded not guilty to federal charges earlier this month.\n\nLast month, a grand jury indicted Boelter on six federal charges, including murder counts.\n\n“The damage done to the victims — those with us, those who were taken from us, and to our entire community — has opened wounds that will never heal,” Moriarty said, CBS reported.",
  "medium": "Article",
  "links": [
    "https://thehill.com/regulation/court-battles/5402679-vance-boelter-indicted-federal-charges/",
    "https://www.cbsnews.com/minnesota/news/hennepin-county-attorney-updates-case-against-vance-boelter/",
    "https://thehill.com/homenews/state-watch/5352976-vance-boelter-charged-political-attack/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Vance Boelter",
      "weight": 0.11337485
    },
    {
      "name": "Boelter",
      "weight": 0.1087775
    },
    {
      "name": "state charges",
      "weight": 0.09850703
    },
    {
      "name": "federal charges",
      "weight": 0.08693589
    },
    {
      "name": "state Sen. John Hoffman",
      "weight": 0.08632924
    },
    {
      "name": "Democratic state Rep. Kristin Bahner",
      "weight": 0.08618953
    },
    {
      "name": "murder counts",
      "weight": 0.08188459
    },
    {
      "name": "State House Speaker Melissa Hortman",
      "weight": 0.081096634
    },
    {
      "name": "Melissa Hortman",
      "weight": 0.08019901
    },
    {
      "name": "Mark Hortman",
      "weight": 0.0787426
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "General"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.97314453125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.966796875
    },
    {
      "name": "/News/Local News",
      "score": 0.91650390625
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.9150390625
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.69189453125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.6708984375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.56591796875
    },
    {
      "name": "/News/Other",
      "score": 0.479736328125
    }
  ],
  "sentiment": {
    "positive": 0.0572137,
    "negative": 0.7437722,
    "neutral": 0.19901405
  },
  "summary": "Vance Boelter, accused of killing State House Speaker Melissa Hortman and her husband, Mark, has been indicted on eight charges, including two counts of first-degree murder. Other charges include four counts of attempted first-dismeanor murder, two counts for premeditated murder, impersonating a police officer, and animal cruelty. Boeelter was also accused of attempting to kill state Sen. John Hoffman, his wife, and their daughter, Hope. The charges were announced by Hennepin County Attorney Mary Moriarty.",
  "shortSummary": "Vance Boelter, accused of killing Minnesota lawmakers and attempting to kill others, was indicted for eight counts including first-degree murder.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f6d460c684d04ca48eb78d0cbae511d9",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cbsnews.com/minnesota/news/hennepin-county-attorney-updates-case-against-vance-boelter/",
      "text": "Hennepin County attorney announces grand jury indictment of Vance Boelter\nHennepin County Attorney Mary Moriarty has secured a grand jury indictment against Vance Boelter, the man accused in the June 14 killing of Minnesota House Speaker Melissa Hortman and her husband Mark and the wounding of state Sen. John Hoffman and his wife.\nMoriarty announced the following state charges against Boelter in a news conference held on Thursday afternoon:\n- Two counts of first-degree premeditated murder\n- Melissa Hortmam\n- Mark Hortman\n- Four counts of attempted first-degree murder\n- John Hoffman\n- Yvette Hoffman\n- Hope Hoffman\n- State Rep. Kristin Bahner\n- Felony cruelty to an animal\n- The Hortmans' family dog, Gilbert - Impersonating an officer\nMoriarty's office notes that a guilty verdict for just one of the first-degree murder charges carries a life sentence without the possibility of parole.\nThis is the first criminal charge Boelter faces in connection with Bahner, whose house Boelter is accused of targeting between the separate shootings at the Hortman and Hoffman houses. Investigators said Boelter visited Bahner's Maple Grove home and knocked on her door, but she was away with her family on vacation at the time.\n\"Boelter drives to the home of state Rep. Kristin Bahner, whose name is handwritten multiple times in the notes found in Boelter's fake squad car. Her name has a star next to it,\" Moriarty said. \"He rings her doorbell for over two minutes. He yells, 'This is the police,' and points a flashlight at her front door. He tries to open the handle. Bahner was not home.\"\nAlso new among the charges is that Boelter is being charged with felony cruelty to an animal for killing the Hortmans' family dog, Gilbert.\n\"Gilbert was barking when Mark opens the door, but when Mark says, 'Gilbert, stay,' Gilbert stops barking and is quiet,\" Moriarty said. \"Boelter willfully shot Gilbert — an act of cruelty that led to yet another loss for the Hortmans' grieving family.\"\nBoelter pleaded not guilty to federal charges earlier this month during an arraignment hearing. Moriarty says she believes Boelter will not appear in state court until he is convicted of federal charges. If he is convicted of those, he could face the death penalty.\n\"The damage done to the victims — those with us, those who were taken from us, and to our entire community — has opened wounds that will never heal,\" Moriarty said in a written statement. \"These charges reflect the weight of Mr. Boelter's crimes, and our thoughts are with Melissa and Mark Hortman's family, the Hoffman family, Rep. Bahner, and Sen. (Ann) Rest.\""
    }
  ],
  "argos_summary": "Vance Boelter has been indicted by a grand jury on eight charges, including two counts of first-degree murder for the shooting deaths of Minnesota State House Speaker Melissa Hortman and her husband, Mark. The indictment also includes charges of attempted murder related to attacks on other lawmakers and animal cruelty for allegedly killing the Hortmans' dog. Boelter has pleaded not guilty to federal charges and could face life in prison if convicted.",
  "argos_id": "87NH4WOI1"
}