{
  "url": "https://finance.yahoo.com/news/invivyd-reports-second-quarter-2025-204900292.html",
  "authorsByline": "Invivyd",
  "articleId": "112d9097e666400abcbf9a399c38feab",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/VWLnjHZ7IrhOtfkLlRSVAQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0xNzc-/https://media.zenfs.com/en/globenewswire.com/e0b6836818161372feda25b028224f9e",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T20:49:00+00:00",
  "addDate": "2025-08-14T21:00:07.373681+00:00",
  "refreshDate": "2025-08-14T21:00:07.373682+00:00",
  "score": 1.0,
  "title": "Invivyd Reports Second Quarter 2025 Financial Results and Recent Business Highlights",
  "description": "PEMGARDA® (pemivibart) net product revenue of $11.8 million reported for Q2 2025, representing 413% growth year-over-yearInvivyd’s target of near-term profitability (1H 2025) was not met but remains possible with the upcoming respiratory virus seasonAnnounced alignment with U.S. FDA on rapid pathway to full approval (BLA) of vaccine alternative monoclonal antibody candidate VYD2311 to protect American adults and adolescents from COVID-19Announced attractive safety profile and pharmacokinetics da",
  "content": "Following a Type C meeting in July 2025, Invivyd announced alignment with FDA on a rapid pathway to full approval (BLA) of vaccine alternative monoclonal antibody VYD2311 to protect American adults and adolescents from COVID-19, subject to agreement on safety database size for Phase 2/3 clinical trial and pending full protocol review, and announced the company’s objectives for VYD2311 development.\n\nComprehensive dose modeling of VYD2311 serum virus neutralizing antibody (sVNA) titers (submitted to FDA and recently published in medRxiv) indicates possible strong protection from symptomatic COVID-19 achievable via IM dosing on a long interval (months to quarters and beyond).\n\nFollowing a single dose, serum concentrations of VYD2311 remained high at six months with an observed half-life of the IM dose route having the longest duration at 76.0 (CI: 68.5 – 90.7) days.\n\nIn June 2025, Invivyd announced positive full Phase 1/2 clinical data for VYD2311, a next-generation monoclonal antibody (mAb) candidate designed to prevent and treat COVID-19, including an attractive safety profile demonstrated across all dosing cohorts and routes of administration – intravenous (IV), subcutaneous (SC), and intramuscular (IM); all reported adverse events (AEs) were deemed unrelated or classified as mild to moderate and largely related to injection site and infusion reactions with no serious or severe AEs observed.\n\n“While the second quarter PEMGARDA growth was modest, the base business is growing along with our internal commercial capabilities, while we are simultaneously looking toward an improved target product profile with VYD2311 to protect ordinary Americans from symptomatic COVID-19,” said Bill Duke, Chief Financial Officer of Invivyd. “In addition to further protocol development to advance VYD2311, we look forward to additional upcoming anticipated milestones including identification of a potentially best-in-class RSV candidate in Q3 2025, identification of a preclinical measles candidate by the end of 2025, and advancement of our efforts to support the Long COVID community with the recently formed SPEAR Study Group.”\n\n“We believe we are entering a remarkable period of change for the company that points toward an exciting future,” said Marc Elia, Chairman of the Board at Invivyd. “Having characterized VYD2311 safety and pharmacokinetics in our Phase 1/2 trial, we are fully engaged on designing our clinical and go-to-market strategy for what we believe will be an exciting alternative to COVID-19 vaccination. As PEMGARDA ® (pemivibart) moves into the fall season, we expect to move quickly to cement our position as the leading provider of monoclonal antibody technology for Americans in need of COVID-19 protection. With U.S. Food and Drug Administration (FDA) advice in hand, we look forward to the VYD2311 Phase 2/3 clinical trial design and finalization with the FDA, including anticipated alignment on a pivotal study plan for pediatrics, and advancement of other pipeline opportunities that leverage our technology, such as RSV and measles.”\n• \n• Company has initiated discovery efforts to assess pipeline expansion beyond SARS-CoV-2, including potential targets such as respiratory syncytial virus (RSV) and measles.\n• Company anticipates providing an update on identification of an RSV candidate in the third quarter of 2025 and an update on identification of a preclinical measles mAb candidate in the fourth quarter of 2025.\n• \n• In July 2025, Invivyd and leading researchers formed SPEAR (Spike Protein Elimination and Recovery) Study Group to assess the effects of mAb therapy for Long COVID and COVID-19 Post-Vaccination Syndrome.\n• In April 2025, Invivyd entered into a $30 million non-dilutive term loan facility with Silicon Valley Bank, a division of First Citizens Bank, supporting balance sheet optionality and providing potential additional runway for commercial and pipeline execution if certain conditions and milestones are met.\n• Revenue: Reported Q2 2025 PEMGARDA net product revenue of $11.8 million, as compared to $2.3 million in Q2 2024.\n• Cash Position: Cash and cash equivalents were $34.9 million as of June 30, 2025.\n• Research & Development (R&D) Expenses (including In-Process R&D): R&D expenses were $9.6 million for the quarter ended June 30, 2025, compared to $30.3 million for the comparable period of 2024. This decrease is primarily attributable to a decrease in commercial manufacturing costs of VYD2311, a decrease in clinical trial costs related to our CANOPY Phase 3 clinical trial and a decrease in personnel-related costs.\n• Selling, General & Administrative (SG&A) Expenses: SG&A expenses were $16.6 million for the quarter ended June 30, 2025, compared to $21.1 million for the comparable period of 2024. This decrease is primarily attributable to a decrease in stock-based compensation expense, partially offset by increased headcount-related costs and professional services fees.\n• Net Loss and Net Loss per Share: Net loss was $14.7 million for the quarter ended June 30, 2025, compared to $47.2 million for the comparable period in 2024. Basic and diluted net loss per share was $0.12 for the quarter ended June 30, 2025, compared to $0.40 for the comparable period in 2024.\n\n\n\nPEMGARDA® (pemivibart) is a half-life extended investigational monoclonal antibody (mAb). PEMGARDA was engineered from adintrevimab, Invivyd’s investigational mAb that has a robust safety data package and provided evidence of clinical efficacy in global Phase 2/3 clinical trials for the prevention and treatment of COVID-19. PEMGARDA has demonstrated in vitro neutralizing activity against major SARS-CoV-2 variants, including JN.1, KP.3.1.1, XEC and LP.8.1. PEMGARDA targets the SARS-CoV-2 spike protein receptor binding domain (RBD), thereby inhibiting virus attachment to the human ACE2 receptor on host cells.\n\nPEMGARDA (pemivibart) injection (4500 mg), for intravenous use is an investigational mAb that has not been approved, but has been authorized for emergency use by the U.S. FDA under an EUA for the pre-exposure prophylaxis (prevention) of COVID-19 in adults and adolescents (12 years of age and older weighing at least 40 kg) who have moderate-to-severe immune compromise due to certain medical conditions or receipt of certain immunosuppressive medications or treatments and are unlikely to mount an adequate immune response to COVID-19 vaccination. Recipients should not be currently infected with or have had a known recent exposure to an individual infected with SARS-CoV-2.\n\nPEMGARDA is not authorized for use for treatment of COVID-19, treatment of Long COVID, or post-exposure prophylaxis of COVID-19. Pre-exposure prophylaxis with PEMGARDA is not a substitute for vaccination in individuals for whom COVID-19 vaccination is recommended. Individuals for whom COVID-19 vaccination is recommended, including individuals with moderate-to-severe immune compromise who may derive benefit from COVID-19 vaccinations, should receive COVID-19 vaccination. In individuals who have recently received a COVID-19 vaccine, PEMGARDA should be administered at least 2 weeks after vaccination.\n\nAnaphylaxis has been observed with PEMGARDA and the PEMGARDA Fact Sheet for Healthcare Providers includes a boxed warning for anaphylaxis. The most common adverse reactions included systemic infusion-related reactions and hypersensitivity reactions, local infusion site reactions, and infusion site infiltration or extravasation. For additional information, please see the PEMGARDA full product Fact Sheet for Healthcare Providers, including important safety information and boxed warning.\n\nTo support the EUA for PEMGARDA, an immunobridging approach was used to determine if PEMGARDA may be effective for pre-exposure prophylaxis of COVID-19. Immunobridging is based on the serum virus neutralizing titer-efficacy relationships identified with other neutralizing human mAbs against SARS-CoV-2. This includes adintrevimab, the parent mAb of pemivibart, and other mAbs that were previously authorized for EUA. There are limitations of the data supporting the benefits of PEMGARDA. Evidence of clinical efficacy for other neutralizing human mAbs against SARS-CoV-2 was based on different populations and SARS-CoV-2 variants that are no longer circulating. Further, the variability associated with cell-based EC50 value determinations, along with limitations related to pharmacokinetic data and efficacy estimates for the mAbs in prior clinical trials, impact the ability to precisely estimate protective titer ranges. Additionally, certain SARS-CoV-2 viral variants may emerge that have substantially reduced susceptibility to PEMGARDA, and PEMGARDA may not be effective at preventing COVID-19 caused by these SARS-CoV-2 viral variants.\n\nThe emergency use of PEMGARDA is only authorized for the duration of the declaration that circumstances exist justifying the authorization of the emergency use of drugs and biological products during the COVID-19 pandemic under Section 564(b)(1) of the Federal Food, Drug, and Cosmetic Act, 21 U.S.C. § 360bbb-3(b)(1), unless the declaration is terminated or authorization revoked sooner. PEMGARDA is authorized for use only when the combined national frequency of variants with substantially reduced susceptibility to PEMGARDA is less than or equal to 90%, based on available information including variant susceptibility to PEMGARDA and national variant frequencies.\n\nThe CANOPY Phase 3 clinical trial was designed to evaluate the safety and tolerability of pemivibart and to assess immunobridging from pemivibart to certain historical data from the company’s previous Phase 2/3 clinical trial of adintrevimab (ADG20) for the prevention of symptomatic COVID-19 (EVADE). Additionally, there were pre-specified exploratory endpoints through three, six and twelve months to evaluate clinical efficacy of pemivibart compared to placebo in the prevention of RT-PCR-confirmed symptomatic COVID-19. The latest analysis from the Phase 3 CANOPY clinical trial included 365-day data. The CANOPY clinical trial enrolled participants in two cohorts: Cohort A was a single-arm, open-label trial in adults with moderate-to-severe immune compromise including complex underlying medical conditions. Cohort B was a randomized, placebo-controlled cohort that enrolled adults without moderate-to-severe immune compromise at risk of acquiring COVID-19 due to regular unmasked face-to-face interactions in indoor settings.\n\nVYD2311 is a novel monoclonal antibody (mAb) candidate being developed for COVID-19 to continue to address the urgent need for new prophylactic and therapeutic options. The pharmacokinetic profile and antiviral potency of VYD2311 may offer the ability to deliver clinically meaningful titer levels through more patient-friendly means such as an intramuscular route of administration.\n\nVYD2311 was engineered using Invivyd’s proprietary integrated technology platform and is the product of serial molecular evolution designed to generate an antibody optimized for neutralizing contemporary virus lineages. VYD2311 leverages the same antibody backbone as pemivibart, Invivyd’s investigational mAb granted emergency use authorization in the U.S. for the pre-exposure prophylaxis (PrEP) of symptomatic COVID-19 in certain immunocompromised patients, and adintrevimab, Invivyd’s investigational mAb that has a robust safety data package and demonstrated clinically meaningful results in global Phase 2/3 clinical trials for the prevention and treatment of COVID-19.\n\nInvivyd, Inc. (Nasdaq: IVVD) is a biopharmaceutical company devoted to delivering protection from serious viral infectious diseases, beginning with SARS-CoV-2. Invivyd deploys a proprietary integrated technology platform unique in the industry designed to assess, monitor, develop, and adapt to create best in class antibodies. In March 2024, Invivyd received emergency use authorization (EUA) from the U.S. FDA for a monoclonal antibody (mAb) in its pipeline of innovative antibody candidates. Visit https://invivyd.com/ to learn more.\n\nTrademarks are the property of their respective owners.\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Words such as “anticipates,” “believes,” “could,” “expects,” “estimates,” “intends,” “potential,” “predicts,” “projects,” and “future” or similar expressions (as well as other words or expressions referencing future events, conditions or circumstances) are intended to identify forward-looking statements. Forward-looking statements include statements concerning, among other things, the company’s target of achieving profitability; expectations regarding the COVID-19 landscape and upcoming respiratory virus season; beliefs about the company’s market position; plans related to the company’s research and development activities; expectations regarding the biophysical properties, clinical trial design, regulatory pathway, target product profile and target populations for VYD2311; the anticipated focus and goals of the SPEAR Study Group; the ongoing in vitro neutralizing activity of PEMGARDA against dominant SARS-CoV-2 variants; the potential of PEMGARDA as a mAb for pre-exposure prophylaxis (prevention) of COVID-19 in certain immunocompromised persons; the potential of VYD2311 as a novel mAb candidate that may be able to deliver clinically meaningful titer levels through more patient-friendly means; the company’s devotion to delivering protection from serious viral infectious diseases, beginning with SARS-CoV-2; potential pipeline expansion beyond SARS-CoV-2, including potential targets such as RSV and measles, and expected announcements related thereto; and other statements that are not historical fact. The company may not actually achieve the plans, intentions or expectations disclosed in the company’s forward-looking statements and you should not place undue reliance on the company’s forward-looking statements. These forward-looking statements involve risks and uncertainties that could cause the company’s actual results to differ materially from the results described in or implied by the forward-looking statements, including, without limitation: uncertainties regarding the company’s expectations, projections and estimates regarding future costs and expenses, future revenue, capital requirements, and the availability of and the need for additional financing; whether the company’s cash and cash equivalents are sufficient to support its operating plan for as long as anticipated; uncertainties regarding market acceptance, payor coverage and reimbursement, or future revenue generated by PEMGARDA; how long the EUA granted by the FDA for PEMGARDA will remain in effect and whether such EUA is revised or revoked by the FDA; the ability to maintain a continued acceptable safety, tolerability and efficacy profile of any product candidate following regulatory authorization or approval; the success of the company’s in-house sales force, and company’s ability to maintain and expand sales, marketing and distribution capabilities to successfully commercialize PEMGARDA; changes in expected or existing competition; changes in the regulatory environment; the outcome of the company’s engagement with regulators; uncertainties related to the regulatory authorization or approval process, and available development and regulatory pathways; uncertainties related to reaching agreement with FDA on the safety database size for the pivotal clinical trial of VYD2311 and full protocol review; clinical trial site activation or enrollment rates; the timing, progress and results of the company’s discovery, preclinical and clinical development activities; unexpected safety or efficacy data observed during preclinical studies or clinical trials; the predictability of clinical success of the company’s product candidates based on neutralizing activity in nonclinical studies; the risk that results of nonclinical studies or clinical trials may not be predictive of future results, and interim data are subject to further analysis; potential variability in neutralizing activity of product candidates tested in different assays, such as pseudovirus assays and authentic assays; variability of results in models and methods used to predict activity against SARS-CoV-2 variants; whether the epitope that pemivibart and VYD2311 targets remains structurally intact; whether the company’s product candidates are able to demonstrate and sustain neutralizing activity against major SARS-CoV-2 variants, particularly in the face of viral evolution; whether the company’s integrated technology platform is able to produce mAbs with broad and durable viral protection along with improved drug properties; the company’s reliance on third parties; complexities of manufacturing mAb therapies, and availability of quantities of commercial product in the future, if authorized or approved; macroeconomic and political uncertainties; the company’s ability to realize the anticipated benefits of its term loan facility; the company’s ability to continue as a going concern; and whether the company has adequate funding to meet future operating expenses and capital expenditure requirements. Other factors that may cause the company’s actual results to differ materially from those expressed or implied in the forward-looking statements in this press release are described under the heading “Risk Factors” in the company’s Annual Report on Form 10-K for the year ended December 31, 2024 and the company’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2025, each as filed with the Securities and Exchange Commission (SEC), and in the company’s other filings with the SEC, and in its future reports to be filed with the SEC and available at www.sec.gov. Forward-looking statements contained in this press release are made as of this date, and Invivyd undertakes no duty to update such information whether as a result of new information, future events or otherwise, except as required under applicable law.\n\nThis press release contains hyperlinks to information that is not deemed to be incorporated by reference in this press release.\n\n(1) Includes related-party amounts of $490 and $1,274 as of June 30, 2025 and December 31, 2024, respectively. \n\n\n\n\n\n(1) Includes related-party amounts of $472 and $924 for the three and six months ended June 30, 2025 and no related-party amounts for the three and six months ended June 30, 2024.\n\n(2) Includes related-party amounts of $1,140 and $2,268 for the three and six months ended June 30, 2025 and $1,131 and $2,266 for the three and six months ended June 30, 2024, respectively.",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/Tracker?data=n1BGtvV3fL6Kgr2faW8VaADlexKha9TLcbkWA8X7kpVjun28DN2kjC183wZe5TIJeUjwM_Oh90L6C3yL_gu76dot3zDT60Rltol4wgshHvY=",
    "https://www.globenewswire.com/Tracker?data=8wJk2k3WfF4eTMunzxguklflUYlzJehQg2OHYsO9MLz0aiN_69mr5OY-VlY575fzQWwg4XvM99xxac-BAYt7ZvmIpVpR8EiGMp2uINh1VT4="
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Company",
      "weight": 0.06412053
    },
    {
      "name": "clinical trials",
      "weight": 0.06243485
    },
    {
      "name": "clinical trial costs",
      "weight": 0.06159244
    },
    {
      "name": "clinical trial design",
      "weight": 0.059423614
    },
    {
      "name": "prior clinical trials",
      "weight": 0.058591057
    },
    {
      "name": "VYD2311 safety",
      "weight": 0.05607714
    },
    {
      "name": "other neutralizing human mAbs",
      "weight": 0.055860788
    },
    {
      "name": "PEMGARDA",
      "weight": 0.05533601
    },
    {
      "name": "symptomatic COVID-19",
      "weight": 0.054629534
    },
    {
      "name": "COVID-19 protection",
      "weight": 0.05401781
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.91650390625
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.91357421875
    },
    {
      "name": "/News/Health News",
      "score": 0.86328125
    },
    {
      "name": "/Health/Pharmacy/Drugs & Medications",
      "score": 0.62744140625
    },
    {
      "name": "/Health/Health Foundations & Medical Research",
      "score": 0.4697265625
    }
  ],
  "sentiment": {
    "positive": 0.86053354,
    "negative": 0.01756575,
    "neutral": 0.12190072
  },
  "summary": "Invivyd has reported its second quarter 2025 financial results and announced alignment with FDA on a rapid pathway to full approval (BLA) of vaccine alternative monoclonal antibody VYD2311 to protect American adults and adolescents from COVID-19. The company's objective is to develop VYD2211, a vaccine alternative to SARS-CoV-2. The drug has been shown to have a strong protection from COID-19 through long interval dosing. In June 2025, Invivyd announced positive Phase 1/2 clinical data for VYD2411, which is designed to prevent and treat COVID19. Additional milestones include identification of a potentially best-in-class RSV candidate in Q3 2025, identification of preclinical measles candidate by the end of 2025, and expansion of other pipeline opportunities that leverage our technology.",
  "shortSummary": "Invisivyd reported positive clinical data for VYD2311, a next-generation monoclonal antibody candidate to protect adults and adolescents from COVID-19, with significant milestones in development and development.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "09d2468a2b74414d8ab2bd554e72e172",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Invivyd has announced alignment with the FDA for a rapid pathway to full approval of its monoclonal antibody VYD2311, aimed at protecting adults and adolescents from COVID-19. The company reported positive Phase 1/2 clinical data, indicating a strong safety profile and prolonged serum concentrations after a single dose. Additionally, Invivyd is expanding its pipeline to include candidates for respiratory syncytial virus (RSV) and measles, while also forming the SPEAR Study Group to investigate mAb therapy for Long COVID.",
  "argos_id": "8I40VPCE9"
}