{
  "url": "https://www.pymnts.com/news/retail/2025/target-and-ulta-beauty-to-end-shop-in-shop-partnership-next-year/",
  "authorsByline": "PYMNTS",
  "articleId": "8630c977f42b40cb82c8b2aed0e1a74d",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2025/08/Ulta-Beauty-Target-retail-shopping-partnerships.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:21:27+00:00",
  "addDate": "2025-08-14T19:33:01.692455+00:00",
  "refreshDate": "2025-08-14T19:33:01.692456+00:00",
  "score": 1.0,
  "title": "Target and Ulta Beauty to End Shop-in-Shop Partnership Next Year",
  "description": "Target and Ulta Beauty said Thursday (Aug. 14) that they have mutually agreed not to renew their shop-in-shop partnership when the current agreement",
  "content": "and said Thursday (Aug. 14) that they have mutually agreed not to renew their shop-in-shop partnership when the current agreement expires in August 2026.\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\nThe experience, which offers access to beauty products and lets customers link their and accounts, will continue in Target stores and on until August 2026, the companies said in a Thursday .\n\n“Both companies remain committed to delivering a seamless shopping experience and product availability through the end of the partnership, as well as continuing to support their teams and partners during the transition,” the release said.\n\nUlta Beauty will continue to offer beauty and wellness products through its own omnichannel experience, including the online that is set to launch later this year, and Target will continue to offer a “differentiated beauty assortment and new experience” for its customers, per the release.\n\nThe Wall Street Journal (WSJ) Thursday that Ulta Beauty CEO Kecia Steelman said in April that the company paused the opening of more locations with Target and was considering how to operate the partnership more efficiently.\n\nTarget has posted 10 quarters of flat or falling sales, according to the report.\n\nCNBC Thursday that analyst wrote in an equity research note that the end of the partnership was probably driven in part by Target’s issues with “messy in-store operations,” retail theft and insufficient staffing.\n\nReuters Thursday that Target has faced softening demand from customers, especially for discretionary purchases.\n\nTarget and Ulta Beauty announced in November 2020 that they would launch a concept at the start of 2021, offering Ulta Beauty merchandise to Target customers online and in 100 Target locations across the country.\n\nDuring the pandemic, Ulta Beauty had to lay off numerous staff members as its stores closed and sales shifted online.\n\nPYMNTS reported in July 2024 that the with Ulta Beauty brought new and exclusive products to Target and catered to a wider range of customer preferences.\n\nCNBC reported Thursday that there are currently Ulta Beauty shops in more than 600 of Target’s 1,981 U.S. stores.",
  "medium": "Article",
  "links": [
    "https://www.target.com/",
    "https://www.wsj.com/business/retail/ulta-beauty-target-to-conclude-partnership-in-2026-70d2ad84",
    "https://www.linkedin.com/in/bellingerdavid",
    "https://corporate.target.com/press/release/2025/08/ulta-beauty-and-target-announce-plans-to-conclude-partnership-in-2026",
    "https://www.linkedin.com/in/kecia-steelman-57b8b66/",
    "https://www.cnbc.com/2025/08/14/ulta-and-target-end-deal-for-in-store-shops.html",
    "https://finance.yahoo.com/news/ulta-beauty-target-plan-conclude-131230536.html",
    "https://www.pymnts.com/news/retail/2020/retail-partnership-brings-ulta-beauty-to-target-stores/",
    "https://www.target.com/l/target-circle/-/N-pzno9",
    "https://www.target.com/c/ulta-beauty-at-target/-/N-ueo8r",
    "https://www.ulta.com/rewards/all",
    "https://www.mizuhogroup.com/securities",
    "https://www.ulta.com/company/marketplace",
    "https://www.pymnts.com/news/retail/2024/target-bolsters-store-experiences-through-strategic-collaborations/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ulta Beauty shops",
      "weight": 0.11538277
    },
    {
      "name": "Target customers",
      "weight": 0.11292165
    },
    {
      "name": "Target stores",
      "weight": 0.11172638
    },
    {
      "name": "Ulta Beauty",
      "weight": 0.109663844
    },
    {
      "name": "Ulta Beauty merchandise",
      "weight": 0.10513268
    },
    {
      "name": "Ulta Beauty CEO Kecia Steelman",
      "weight": 0.09840268
    },
    {
      "name": "Target",
      "weight": 0.09796113
    },
    {
      "name": "beauty products",
      "weight": 0.08063004
    },
    {
      "name": "new experience",
      "weight": 0.07488721
    },
    {
      "name": "Thursday",
      "weight": 0.0713157
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97802734375
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.72314453125
    },
    {
      "name": "/Business & Industrial/Advertising & Marketing/Other",
      "score": 0.30078125
    }
  ],
  "sentiment": {
    "positive": 0.11544287,
    "negative": 0.56518596,
    "neutral": 0.3193712
  },
  "summary": "The two retailers have agreed not to renew their shop-in-shop partnership, which expires in August 2026. The current agreement allows customers to access beauty products and accounts in stores across the country. Ulta Beauty will continue to offer beauty and wellness products through its own omnichannel experience, including the online store set to launch later this year. The companies have also stated they remain committed to delivering a seamless shopping experience and product availability through the end of the partnership. The news is attributed to Target's issues with in-store operations, retail theft, and insufficient staffing.",
  "shortSummary": "Target and Ulta Beauty will end their shop-in-shop partnership in August 2026 due to operational issues, but remain committed to creating a seamless experience.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "734ae1d0758047919d30f87247d26926",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.pymnts.com/news/retail/2020/retail-partnership-brings-ulta-beauty-to-target-stores/",
      "text": "“The durable strategy we have built has made Target a top retail destination,” Target Chairman and CEO Brian Cornell said in the announcement. With the Ulta Beauty partnership, he said, “we are able to expand our growing beauty business with new, exciting brands, an immersive experience, and loyalty benefits to transform how our guests shop for all their beauty needs.”\nThe shop-in-shop concept will bring expanded merchandise to Target customers online and in some stores at the start of 2021. Target and Ulta Beauty said that as trusted retailers with omnichannel outreach and a speciality in curation, they are aiming to forge a new way for people to gain exposure and access to different and emerging brands.\n“Ulta Beauty at Target reflects further evolution in our omnichannel strategy, rooted in unlocking the potential of our physical and digital footprints, creating more seamless shopping opportunities for our loyal guests and continuing to lead the beauty industry. More than ever before, now is the time for innovation in retail,” said Ulta Beauty CEO Mary Dillon.\nShe added that Target “shares our company values” and said Ulta Beauty looks forward to delivering “our beauty expertise, unparalleled assortment and digital innovation” to an expanded customer base.\nThe shop-in-shop is expected to offer Ulta Beauty’s virtual try-on tool GLAMLab, and will have newly-trained associates with beauty expertise.\nAs the coronavirus pandemic took hold, Ulta Beauty had to lay off numerous staff members as stores closed and sales shifted online. Distribution center workers were given a $2 per hour wage hike and its CEO stopped collecting a salary. Overall, worker furloughs in the retail industry topped 1 million by mid-April.\nTarget said its holiday hiring this year was focusing on fulfilling digital demand, reflecting the new reality of shopping amid COVID-19.\nIn October, Target introduced new measures aimed at reducing in-store gridlock for holiday shoppers — shopping reservations, in-store check-out reservations, employees using handheld checkout devices and more."
    },
    {
      "url": "https://www.ulta.com/company/marketplace",
      "text": "- Home\n- Ulta Beauty Marketplace\nUlta Beauty Marketplace\nComing soon! Grow your business with the largest beauty retailer in the U.S.\nTap into more opportunities\nwith Ulta Beauty Marketplace\nReach over 44 million members\nConnect with highly engaged beauty enthusiasts who shop all things beauty and wellness, all in one place.\nPartner with the leading specialty beauty retailer\nBuild your brand and grow your business alongside our curated assortment.\nUtilize our tools & tech\nEasily access our technology to manage and grow your eCommerce business.\nGet reliable support\nReceive dedicated support from our Marketplace team to help reach your goals.\nCheck back for more information\nUlta Beauty Marketplace\nGet ready for the Ulta Beauty Marketplace, launching Fall 2025! This is your chance to partner with the leading beauty retailer in the U.S. and showcase your brand to a loyal, beauty-obsessed audience. Join a curated platform designed to connect your business with passionate shoppers in one vibrant space. With cutting-edge tools, powerful tech, and dedicated support from our Marketplace team, you’ll have everything you need to grow your brand, expand your reach, and elevate your success. Don’t miss out on this exciting opportunity to thrive in the world of beauty!"
    },
    {
      "url": "https://www.cnbc.com/2025/08/14/ulta-and-target-end-deal-for-in-store-shops.html",
      "text": "Ulta Beauty and Target said Thursday that they have decided to end a deal that opened makeup and beauty shops in hundreds of Target's stores.\nShares of Target fell about 2% in early trading, while Ulta's stock slid about 1%.\nIn a news release, the companies said the partnership — which also added some of Ulta's merchandise to Target's website — will end in August 2026. Target had added more than 600 Ulta Beauty shops to its stores since 2021, according to a company spokesperson. That's nearly a third of Target's 1,981 U.S. stores.\nUlta Beauty at Target shops carried a smaller and rotating assortment of the merchandise at the beauty retailer's own stores. They were staffed by Target's employees.\nThe loss of the popular beauty retailer's products could be another blow to Target as it tries to woo back both shoppers and investors. Target's annual sales have been roughly flat for four years and it expects sales to decline this fiscal year. Shares of the company are worth less than half of what the were back in 2021, when they hit an all-time closing high of $266.39. It also has faced backlash over both its Pride collection and its rollback of key diversity, equity and inclusion initiatives.\nStore traffic for Target has declined year over year nearly every week from the week of Jan. 27, days after the company's DEI announcement, through the week of Aug. 4, according to Placer.ai, an analytics firm that uses anonymized data from mobile devices to estimate overall visits to locations. Target traffic had been up weekly year over year in the four weeks before Jan. 27.\nThe only exceptions to that trend were the two weeks on either side of Easter, when traffic rose less than 1% year over year, the firm's data showed.\nOn earnings calls and in investor presentations, leaders of the Minneapolis-based company had touted Ulta's shops and its trendy beauty brands as a way to drive store traffic.\nAt a investor presentation in New York City in March, CEO Brian Cornell highlighted beauty as a growth category for Target and cited it as reason for confidence in Target's long-term business. He said the company had gained market share in beauty and its sales in the category rose by nearly 7% in the fiscal year that ended in early February.\nTarget's CEO Brian Cornell, 66, is expected to depart the company soon. The longtime Target leader renewed his contract for approximately three years in September 2022 after the board scrapped its retirement age of 65.\nDavid Bellinger, an analyst for Mizuho Securities who covers retailers, said in an equity research note on Thursday that Target's \"messy in-store operations\" as well as issues with retail theft and insufficient staffing at stores likely contributed to the companies ending their partnership.\n\"Overall, we see losing the Ulta shop-in-shop relationship as a negative development and something else Target's next CEO will have to grapple with,\" he wrote.\nIn a statement on Thursday, Target Chief Commercial Officer Rick Gomez said the discounter is \"proud of our shared success with Ulta Beauty and the experience we've delivered together.\"\n\"We look forward to what's ahead and remain committed to offering the beauty experience consumers have come to expect from Target – one centered on an exciting mix of beauty brands with continuous newness, all at an unbeatable value,\" he said.\nIn a statement, Ulta's Chief Retail Officer Amiee Bayer-Thomas described the Target deal as \"one of many unique ways we have brought the power of beauty to guests nationwide.\"\n\"As we continue to execute our Ulta Beauty Unleashed plans, we're confident our wide-ranging assortment, expert services and inspiring in-store experiences will reinforce our leadership in beauty and define the next chapter of our brand,\" she said."
    }
  ],
  "argos_summary": "Ulta Beauty and Target have announced they will not renew their shop-in-shop partnership, which is set to expire in August 2026. The decision comes amid Target's ongoing sales struggles and operational challenges, including retail theft and staffing issues. Both companies will continue to support their teams and customers until the partnership ends, with Ulta Beauty focusing on its own omnichannel experience and Target aiming to enhance its beauty offerings.",
  "argos_id": "91XDYCDZV"
}