{
  "url": "https://www.pcmag.com/about/how-we-test-printers",
  "authorsByline": "M. David Stone",
  "articleId": "a181453928a340449d6894a70ddfca86",
  "source": {
    "domain": "pcmag.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.pcmag.com/imagery/articles/071g8yYLHQQGCrkBHmc294W-15.fit_lim.size_1200x630.v1754937178.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T21:53:18+00:00",
  "addDate": "2025-08-14T22:29:33.904413+00:00",
  "refreshDate": "2025-08-14T22:29:33.904414+00:00",
  "score": 1.0,
  "title": "How We Test Printers",
  "description": "Our lab tests measure overall performance, functionality, and output quality to help you pick the right printer for your needs.",
  "content": "Printers come in all sorts of varieties—all-in-ones! label printers! wide-format art printers!—and with a dizzying array of potential features. They can be focused primarily on printing text, graphics, or photos, or they might handle all three types of output reasonably well. They can be limited to letter- and legal-size paper, or any larger (or smaller) size you like. And a printer might \"only\" print, or be a multifunction printer (MFP), also called an all-in-one (AIO) , that also scans and copies.\n\nAnd that's just the basics . Other features can include sending and receiving emails or faxing via phone lines or through the cloud. Printing from cameras is another distinction, as is printing from and scanning to memory cards, USB keys, phones, and tablets. (How about even printing on old-school optical discs?)\n\nOur testing takes all of these variations, and more, into account to cover every aspect of printer functionality, print quality, speed, and hardware and software usability.\n\nTo thoroughly test every aspect of printing, we use two core sets of documents for every printer that can print them, plus additional sets for some specific types of printers. For example, for near-dedicated photo printers that can print at 17 inches, 19 inches, or even wider widths, we add appropriately sized photos, up to the maximum size the printer can handle and that the vendor has supplied paper for.\n\nAt the other extreme, dedicated label printers can't print letter-size documents, so we use files consisting of nothing but address labels to test the ones that print paper labels, or a standard text phrase to test the ones that print label strips, typically on plastic media.\n\nAll tests are run using one of several printer testbed Windows systems, all of which have identical hardware and software. To ensure that the software environment is identical, we restore the disk image for each testbed from a master image as the first step in our tests before installing each printer.\n\nThe results provide a firm basis for comparison between printers as appropriate. Even though we can't print a letter-size business document on a dedicated 4-by-6-inch photo printer, for example, we can print 4-by-6-inch photos on almost any printer, which lets us compare speeds and quality over the entire range from small-format photo printer to desktop inkjet, laser, and professional-level wide-carriage photo printer.\n\nOur business suite of test documents includes documents created in and printed from Adobe Acrobat and Microsoft Word, Excel, and PowerPoint . Some have only text or only business graphics. Others mix text with embedded charts and photos. All output is on the same brand and type of 20-pound-weight plain paper for all printers, and all images are printed in default mode in simplex (one-sided). For printers with auto duplexing (two-sided printing), we also print the Word file in duplex.\n\nOur photo suite includes 300dpi-resolution photographs in two sizes: 4 by 6 inches and 8.5 by 11 inches. We use nine color photos and one 8.5-by-11-inch monochrome photo. The color images are chosen to include skin tones, a wide range of shading from dark to light in a single image, and \"memory colors.\" (The latter are real-world  colors that people tend to remember and know what they should look like, such as grass green, sky blue, and flesh tones.)\n\nFor photo printing, we use the paper the vendor recommends; if there is no vendor recommendation, we use the same high-quality 24-pound color copier paper for all lasers or the same generic photo paper for all inkjets . For all photos in the photo suite, we use the highest quality available without custom or advanced settings.\n\nFor additional quality tests for near-dedicated, professional-level photo printers, we typically use assorted fine art papers, as provided by the vendors, to show off the printers to their best advantage. For small-format printers with a maximum 5-by-7-inch image size, we use a modified set of our photo suite that includes the 4-by-6-inch photos from the standard photo suite, and resized versions of the 8.5-by-11-inch photos. Smaller photo printers (for 2-by-3-inch photos, for example) are typically designed to print as phone companions, which means they can't print from our Windows testbeds to run our standard tests. In those cases, we run ad hoc tests appropriate for the individual printer and report how we tested them.\n\nTo measure performance, we time each file in the full business applications suite and each of the 4-by-6-inch photos in the photo suite. Because print times and quality can vary from one print run to the next, we print each file multiple times, then average the results. The exact number of times depends on how much variability we see in the first few runs of the test.\n\nFor simplex printing, we report the times for the Word text document alone and for the entire business applications suite. For the Word document, we report the time for the first page only (as a first page out, or FPO, time), which is most relevant for short text documents. We also report the speed in seconds and in pages per minute (ppm) for both the entire document and for the document without the first page, which is the most relevant speed for longer documents than we include in our tests.\n\nBecause this is a text document, it needs little to no processing time, which means the results reflect the fastest speeds you can expect to see from the printer. Documents with graphics, photos, or even text with significant formatting are likely to take longer.\n\nFor the full business applications suite, we report the speed in both time and ppm for the entire suite, including the Word file. The difference in ppm speeds for the entire suite as compared with the speed for the Word file alone comes partly from the FPO times added to each file, and partly from the extra processing time needed for the graphics and photos in the other files of the suite.\n\nSome printers lose a much higher percentage of their speed in ppm compared with others when printing in duplex as opposed to printing the same file in simplex. That makes the duplex print speed the more important factor if most of your printing is two-sided. For duplex printing of the Word file, we report the time for the first sheet (pages 1 and 2), and the speed in time and in pages per minute (ppm) for both the rest of the document without the first page, and for the entire document.\n\nWe also report the average time in seconds for printing a 4-by-6-inch photo.\n\nFor testing output quality, we use both the files that we time and additional output we print specifically for testing quality. Because how well a printer does on any one type of document isn't necessarily indicative of how well it will do on the others, we report print quality separately for text, graphics, and photos. We evaluate quality based primarily on specific issues in each image that we know, from experience, are likely problem areas for printers. We use carefully selected criteria for each individual issue, and a clearly defined scale for each measure.\n\nFor text quality, we look at the output for several fonts, in sizes ranging from 4 to 72 points, in the printer's default mode on plain paper. We pay special attention to how well-formed the characters are at each font size and how sharp the characters' edges are. We also consider how well the printer maintains the separation between characters, how well it holds the loops in characters like lowercase Es and Gs, and whether the text is a suitably dark black rather than gray. Many of these issues require magnification to see the actual problem at small font sizes, but they make the difference between a 4- or 6-point font being easily readable or not.\n\nFor graphics quality, we analyze the Microsoft Excel charts and Microsoft PowerPoint slides from the business applications suite. We look for color saturation, consistency of fills, posterization (lack of smoothness in gradients), banding, misregistration, ability to hold thin lines, and dithering. In addition, if we see any issues that we don't normally look for, we factor those in and report them.\n\nFor photo quality, we focus our analysis on the accuracy of image reproduction on photo paper for printers that use photo paper, or on the high-quality color copier paper we use with most laser printers for our photo suite. We also consider the photos included in our business applications suite, which are printed in the printer's default mode on plain paper.\n\nFor functionality testing, we judge ease of hardware setup, software installation, and network setup. We also look at how easy it is to use features such as front-panel menus, driver settings, and both printing from and scanning to USB memory keys, websites, and mobile devices.\n\nFor paper handling, we note input capacity, number of paper trays, and limits on paper sizes, and for printers that offer only manual duplex for printing, we test that feature as well. Where printers have additional paper-handling capabilities such as stackers, sorters, and finishers with a stapler and hole-punch features, we test those features, too.\n\nAdditional tests for all-in-one printers (AIOs) necessarily vary by model, depending on the functions the individual printer offers. For AIOs that offer scanning, copying, and faxing, we test all three functions, including using both the flatbed and the automatic document feeder (ADF) if there is one. For ADFs that duplex, we test the duplex feature, too. (For more on this, see how we test scanners .)\n\nMore generally, we confirm that each function works and is appropriate for the target user. For a mono laser AIO meant for an office, for example, we confirm that the output quality is suitable for office use, which means that the copy and scan features handle text well; how well it handles graphics and photos is less important. For an inkjet AIO designed for a photo enthusiast or a scrapbooker, however, scanning and copying color photos and graphics are key issues, while features like software for OCRing text aren't.\n\nFinally, with both single-function and multifunction printers, we test any unusual features—such as using a QR code on a front-panel LCD to establish a mobile connection—to make sure they work as promised and are actually useful.\n\nOur consistent use of the same testing protocol for every printer allows us to make accurate and useful comparisons between models, so you know exactly how they measure up. No matter what you need a printer for, we'll help you find one that's exactly right.",
  "medium": "Article",
  "links": [
    "https://www.pcmag.com/privacy",
    "https://www.pcmag.com/terms",
    "https://www.pcmag.com/picks/the-best-printers",
    "https://www.pcmag.com/picks/best-cheap-printers",
    "https://www.pcmag.com/reviews/adobe-acrobat-pro-dc",
    "https://www.pcmag.com/about/how-we-test-everything-we-review",
    "http://PCMag.com",
    "https://www.pcmag.com/picks/the-best-wide-format-printers",
    "https://www.pcmag.com/reviews/microsoft-office-365-home",
    "https://www.pcmag.com/picks/the-best-inkjet-printers",
    "https://www.pcmag.com/cdn-cgi/l/email-protection#6d0043090c1b0409431e190203082d1b081f0417020343030819",
    "https://www.pcmag.com/picks/the-best-laser-printers",
    "https://www.pcmag.com/authors/m-david-stone",
    "https://www.pcmag.com/picks/the-best-all-in-one-printers",
    "https://www.pcmag.com/about/how-we-test-scanners",
    "https://www.pcmag.com/picks/the-best-photo-printers"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Smaller photo printers",
      "weight": 0.10004464
    },
    {
      "name": "label printers",
      "weight": 0.08751522
    },
    {
      "name": "photo paper",
      "weight": 0.0857085
    },
    {
      "name": "Printers",
      "weight": 0.085569166
    },
    {
      "name": "printers",
      "weight": 0.085569166
    },
    {
      "name": "photo quality",
      "weight": 0.08404306
    },
    {
      "name": "printer functionality",
      "weight": 0.083740875
    },
    {
      "name": "dedicated label printers",
      "weight": 0.08303581
    },
    {
      "name": "most laser printers",
      "weight": 0.08200197
    },
    {
      "name": "color photos",
      "weight": 0.07798166
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.436767578125
    }
  ],
  "sentiment": {
    "positive": 0.27015096,
    "negative": 0.13404906,
    "neutral": 0.59580004
  },
  "summary": "Printers come in various types of printer types, with features such as printing text, graphics, or photos, and multifunction printers (MFP) that also scan and copies. These tests cover every aspect of printer functionality, print quality, speed, and hardware and software usability. The author tests two core sets of documents for every printer that can print them, plus additional sets for some specific types of printers. The tests are run using different printer testbed Windows systems, all using identical hardware, software, and software. The results provide a firm basis for comparison between printers and their performance. The test documents include documents created in and printed from Adobe Acrobat and Microsoft Word, Excel, and PowerPoint, and photos created on the same brand and type of 20-pound-weight plain paper for all printers. All output is printed in default mode in simplex (one-sided). For printers with auto duplexing (two-sided printing), we also print the Word file in duplex.",
  "shortSummary": "Printers vary wildly across various categories of printing, from multifunction printers to multifunction ones, with distinct but consistent test models and hardware.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "e64781bb58314ca7a19f4e7208448fe7",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Printers come in various types and functionalities, including all-in-ones, label printers, and wide-format printers, each designed for different printing needs such as text, graphics, or photos. Testing involves a comprehensive evaluation of print quality, speed, and usability across multiple document types and sizes, ensuring consistent comparisons. The testing process includes measuring performance metrics, assessing output quality for text, graphics, and photos, and evaluating additional features like scanning and copying for multifunction printers.",
  "argos_id": "9K29OC4ZR"
}