{
  "url": "https://www.washingtontimes.com/news/2025/aug/14/cessna-pilot-arrested-illegal-landing-antarctica-strikes-deal-avoid/",
  "authorsByline": "The Washington Times https://www.washingtontimes.com, https://www.washingtontimes.com/staff/brad-matthews/, Brad Matthews",
  "articleId": "1a597ea2130649bbb89bd1b97038171c",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2024/08/06/Switzerland_Teen_Pilot_78813_c0-239-5733-3583_s1200x700.jpg?a8bd776ad7944d5eb79f983fe61a5b0153358a4d",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T21:28:24+00:00",
  "addDate": "2025-08-14T21:34:25.922660+00:00",
  "refreshDate": "2025-08-14T21:34:25.922661+00:00",
  "score": 1.0,
  "title": "Cessna pilot arrested for illegal landing in Antarctica strikes deal to avoid prosecution",
  "description": "The teenage American pilot who was arrested for illegally landing in Chilean Antarctica as part of a worldwide flight to raise money for cancer research has reached a deal to avoid prosecution.",
  "content": "The teenage American pilot who was arrested for illegally landing in Chilean Antarctica as part of a worldwide flight to raise money for cancer research has reached a deal to avoid prosecution.\n\nEthan Guo, a pilot and social media influencer, avoided prosecution with the deal but is having trouble getting out of Antarctica.\n\nHe was 19 when he illegally landed his aircraft at Teniente Rodolfo Marsh Martin Airport in late June. The attorney general for Magallanes and Chilean Antarctica accused Mr. Guo of changing his flight plans, falsely reporting his plane as lost, and landing illegally.\n\nUnder the deal with Chilean prosecutors, Mr. Guo agreed to make a $30,000 donation to a Chilean children’s cancer research foundation within 30 days, leave Chile and not return for three years, the attorney general’s office said on Instagram as translated from Spanish.\n\nProsecutors also demanded Mr. Guo pay for security and maintenance of his single-engine Cessna 182Q, which can cost as much as $600 a day, Chilean prosecutor Cristian Crisosto told CNN.\n\nMr. Guo is flying to all seven continents to raise $1 million for St. Jude Children’s Research Hospital. He has spent six weeks at the Chilean air base, where he landed and turned 20 during his stay.\n\nDespite the deal, Mr. Guo says the Chileans will not let him leave and that boat trips away from the base are infrequent.\n\nHe told ABC News that Chilean authorities told him that the Cessna is unfit to fly and does not have enough fuel, that the weather conditions in Antarctica, where it is the middle of winter, are poor, and that he is not skilled enough.\n\n“All four of those statements are objectively false. I have all the paperwork. I have insurance that even covers Antarctica. The plane has enough fuel, the plane is working. And I am a qualified pilot,” Mr. Guo told ABC News.\n\nThe attorney general’s office said that Mr. Guo was only supposed to fly over the city of Punta Arenas, Chile.\n\nMr. Crisosto told local Chilean radio station Radio Cooperativa that “all the information available in the investigation indicates that he didn’t get lost or have any problems,” as translated from Spanish.\n\n“If you review the posts he made as an influencer some time before his arrival in Punta Arenas, he had already set his sights on landing in Antarctica by plane. This shows that it wasn’t a mistake or that he was lost, but rather that he always had the will and the knowledge of what he wanted to achieve,” Mr. Crisosto told Radio Cooperativa as translated from Spanish.\n\nMr. Guo told ABC News that on his way to Ushuaia, Argentina, his single-engine Cessna 182Q experienced engine failure and lost radio transmission. He then landed in Chilean Antarctica.\n\nIn a statement, Mr. Guo told The Associated Press that following escalating difficulties with his flight, he “requested and received explicit, direct permission to land at the Marsh base from a high-ranking DGAC official via WhatsApp, an authorization that was subsequently confirmed by the base’s air traffic controller.”",
  "medium": "Article",
  "links": [
    "https://goo.gl/forms/xGjXcUKYsKxMeCUl1",
    "https://www.washingtontimes.com/news/2025/jul/3/ethan-guo-teen-global-humanitarian-flight-arrested-accused-landing/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mr. Guo",
      "weight": 0.11301456
    },
    {
      "name": "Chilean Antarctica",
      "weight": 0.1040406
    },
    {
      "name": "Mr. Crisosto",
      "weight": 0.09063242
    },
    {
      "name": "Chilean prosecutors",
      "weight": 0.086722426
    },
    {
      "name": "Chilean prosecutor Cristian Crisosto",
      "weight": 0.08637297
    },
    {
      "name": "Guo",
      "weight": 0.085282974
    },
    {
      "name": "Ethan Guo",
      "weight": 0.08392519
    },
    {
      "name": "Chilean authorities",
      "weight": 0.081011504
    },
    {
      "name": "local Chilean radio station",
      "weight": 0.08066917
    },
    {
      "name": "Chilean",
      "weight": 0.079817936
    }
  ],
  "topics": [
    {
      "name": "Antarctica"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.9384765625
    },
    {
      "name": "/Travel & Transportation/Transportation/Air Travel",
      "score": 0.9150390625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.83984375
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Aviation Industry",
      "score": 0.76025390625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.347900390625
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.32373046875
    }
  ],
  "sentiment": {
    "positive": 0.048290405,
    "negative": 0.6965769,
    "neutral": 0.25513265
  },
  "summary": "Ethan Guo, a teenage American pilot and social media influencer, was arrested in Chile for illegally landing his plane in late June as part of a worldwide flight to raise money for cancer research. The attorney general for Magallanes and Chilean Antarctica accused Guo of changing his flight plans, falsely reporting his plane as lost, and landing illegally. Under a deal with Chilean prosecutors, Guo agreed to make a $30,000 donation to a Chilean children's cancer research foundation within 30 days, leave Chile and not return for three years. Despite this, he has been unable to leave Antarctica.",
  "shortSummary": "American pilot Ethan Guo, arrested for illegally landing in Chilean Antarctica, agreed to a $30,000 donation to charity within 30 days, but struggles to leave.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "21f2ab3681974277915167045fb6e470",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Ethan Guo, a 19-year-old American pilot, reached a deal with Chilean prosecutors to avoid prosecution after illegally landing in Antarctica during a flight to raise funds for cancer research. As part of the agreement, he must donate $30,000 to a Chilean children's cancer foundation and leave Chile for three years. Despite the deal, Guo faces difficulties leaving Antarctica, claiming that authorities are preventing him from departing due to false statements about his aircraft's condition and his piloting skills.",
  "argos_id": "9R8PT1LU8"
}