{
  "url": "https://gizmodo.com/andor-season-2-welcome-to-the-rebellion-screenplay-star-wars-2000642920",
  "authorsByline": "James Whitbrook",
  "articleId": "b651b6ae95b04066b4d56b09e9eefa0c",
  "source": {
    "domain": "gizmodo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://gizmodo.com/app/uploads/2025/08/andor-season-2-welcome-to-the-rebellion-cassian-mon-mothma-1200x675.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:45:26+00:00",
  "addDate": "2025-08-14T20:02:55.827301+00:00",
  "refreshDate": "2025-08-14T20:02:55.827302+00:00",
  "score": 1.0,
  "title": "Read the Script to One of the Best Episodes of 'Andor' and Experience Greatness",
  "description": "Tony Gilroy feared releasing the scripts to the 'Star Wars' series to avoid them being consumed by generative AI models—but one of the finest hours of 'Andor' has had its screenplay released.",
  "content": "One of the few rare issues with Andor being as good as it is is that we’re not getting more of it, in any format—but one that especially stings is that we came so close to being able to look at the scripts behind the smash-hit Star Wars series. We were on the verge of greatness, as a certain Imperial director would’ve put it, in 2023 when Tony Gilroy and Lucasfilm announced that season one’s scripts would be published online, only for them to never arrive. Gilroy gave us an incredibly valid reason earlier this year—to avoid the scripts being fed into generative AI models—dashing our hopes that we’d ever similarly see the scripts for the then-upcoming season 2 released either.\n\nBut at least on that front, there’s a tiny glimmer of hope.\n\nAs part of its For Your Consideration campaign effort in the upcoming TV awards season (which, of course, includes Andor and its 14 Emmy nominations), Disney’s official FYC website has been updated to include a post-final production script for Andor season 2 episode 9, “Welcome to the Rebellion”, by Dan Gilroy. The episode, itself nominated in the Outstanding Writing For A Drama Series category at next month’s 77th Emmys, climaxes the third act of Andor season 2, and sees Cassian assist Mon Mothma’s escape from Coruscant after she delivers a damning speech in the Imperial Senate over Palpatine’s role in the Ghorman Massacre.\n\nEven though we’ve had plenty of opportunity to watch and revisit the episode itself, reading the script offers some fascinating insight into the creative process behind Andor, and the chance to see what emotive beats and intent came from Gilroy’s writing, and what flourished or was tweaked naturally through the cast’s performance and interpretation of it. It’s also just a remarkable reading experience too, one that captures the tension that would ultimately sizzle on screen, with a flow and pacing that, even if you’re not used to reading a shooting script, glides by with a keen slickness. It’s not surprising that, even among an extremely strong crop of scripts to pick from in season 2, this is the one that earned Andor the nomination.\n\nBut as good as it is, it now makes Lucasfilm and Gilroy’s decision to stop the release of the rest of the Andor scripts all the more heartbreaking. It would be absolutely incredible that now the show is complete to be able to either freely peruse or even buy a coffee table book collecting the 24 scripts in a single place and re-experience the journey from a perspective that we rarely get for Star Wars material. Just another thing to blame generative AI for, for now at least.\n\nYou can read the full script to “Welcome to the Rebellion” here.",
  "medium": "Article",
  "links": [
    "https://gizmodo.com/star-wars-andor-scripts-disney-plus-tony-gilroy-1850391202",
    "https://gizmodo.com/tony-gilroy-has-the-perfect-reason-his-andor-scripts-werent-released-2000574015",
    "https://debut.disney.com/fyc/twds/series_fyc/andor-202206301429?tab=screenplay",
    "https://gizmodo.com/andor-gets-14-emmy-nominations-in-a-genre-heavy-year-2000629453",
    "https://gizmodo.com/andor-season-2-episode-3-mon-mothma-dance-2000589757",
    "https://gizmodo.com/andor-season-2-best-moments-spoilers-star-wars-2000603436",
    "https://gizmodo.com/andor-tarkin-massacre-ghorman-eu-canon-2000598711",
    "https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856",
    "https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650",
    "https://gizmodo.com/james-cameron-ai-threat-2000641872",
    "https://assets.debut.disney.com/documents/Andor%20209%20--%20POST%20FINAL%20--%203.3.24[1].pdf",
    "https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161",
    "https://gizmodo.com/andor-season-2-endings-explained-luthen-kleya-bix-star-wars-2000602980",
    "https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806",
    "https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140",
    "https://gizmodo.com/disney-went-to-the-emmys-and-said-for-your-consideration-andor-all-of-it-2000606618"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "scripts",
      "weight": 0.105077334
    },
    {
      "name": "Andor season",
      "weight": 0.104076505
    },
    {
      "name": "Andor",
      "weight": 0.082458675
    },
    {
      "name": "season",
      "weight": 0.073392615
    },
    {
      "name": "Tony Gilroy",
      "weight": 0.07097364
    },
    {
      "name": "Dan Gilroy",
      "weight": 0.068560116
    },
    {
      "name": "the Andor scripts",
      "weight": 0.0667845
    },
    {
      "name": "Gilroy",
      "weight": 0.06622745
    },
    {
      "name": "generative AI models",
      "weight": 0.06372777
    },
    {
      "name": "a post-final production script",
      "weight": 0.06369355
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.919921875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.9072265625
    },
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.67919921875
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.476806640625
    }
  ],
  "sentiment": {
    "positive": 0.51228607,
    "negative": 0.13416086,
    "neutral": 0.3535531
  },
  "summary": "Disney's official website has updated to include a post-final production script for Andor season 2 episode 9, \"Welcome to the Rebellion\", by Dan Gilroy, which is one of the best episodes of the show and has been nominated for Outstanding Writing For A Drama Series at the 77th Emmys. The script offers fascinating insight into the creative process behind Andor, capturing the tension and pacing of the episode. However, the decision to not release the rest of the Andor scripts was made by Tony Gilroy and Lucasfilm to avoid using generative AI models for the upcoming season 2 release. The full script can be read on the official FYC website.",
  "shortSummary": "Despite Andor's exceptional quality, the show's scripts are often overlooked due to technological limitations, especially when it comes to releasing online, though there are hopes for future releases.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "0aaa1dbbd5b849c7a110a7e79ba89939",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://gizmodo.com/star-wars-andor-scripts-disney-plus-tony-gilroy-1850391202",
      "text": "Tony Gilroy, the Andor creator, showrunner, and screenwriter, will be launching a website to release the production scripts for all 12 Andor episodes online, for free, for everyone. This news came from journalist Jeff Goldsmith, who attended the Disney+ series’ Emmy FYC event, and io9 confirmed it with Disney.\nFollowing Cassian Andor, unlikely and only half-willing Rebel spy, Andor has been critically hailed as one of the best Star Wars shows in years. Earnest and brutal, Andor is a show that treats its audience with respect, which comes down to the truly excellent writing—and Gilroy’s understanding that what makes a good show is not necessarily what fans might say they want.\nA production script is the screenplay that is used on-set to help organize scenes and shooting schedules. It’s usually marked up by script coordinators and used as a guide during shooting. If there are deleted scenes, improvised lines, or even lines that have been changed in post-production, audiences will be able to pick out the nuances from an analysis of a production script. The production script is, more or less, the final draft of a screenplay that is used to direct the action on camera.\nThis is very cool. So many scripts are locked away, and only people with insider connections or who are members of screenwriting community get access to them. I get this impetus; a script is, by its very definition, unfinished. It is the outline for an altogether different piece of media. But learning from scripts is invaluable. It provides depth, an inside look at what exactly the screenwriter wanted to happen.\nThe Andor scripts are also important because of how polished other behind-the-scenes looks at Disney+’s Star Wars shows have been; The Mandalorian and The Book of Boba Fett both got entries in the Disney+ “Disney Gallery” documentary series and concept art books, but not scripts. (I suspect we’re not getting the Boba Fett scripts because, frankly, that show wasn’t very well written.)\nAndor season two is currently in production and will debut on Disney+ next year. We’ll keep you posted about when those season one scripts become available for reading.\nAuthor’s Note: I love reading scripts! Some of the great scripts out there (if you can get your hands on them) are The Green Knight, Gone Girl, Midsommar, and The Shape of Water.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161",
      "text": "The DC Extended Universe is finally giving Marvel a run for its money—something that’s bound to increase now that James Gunn is running the show. The DCEU’s myriad projects stretch far beyond superhero mainstays Batman, Superman, and the Justice League, promising to include new and interesting takes on DC Comics’ enormous stable of characters.\nWhat follows is an up-to-date list of everything DCEU-related that’s on the way: DC movies heading to theaters, as well as DC streaming movies and shows coming to Max.\nLast updated 8/23/2023.\nWhat’s the next DC Movie?\nAquaman and the Lost Kingdom\nRelease date: December 20 (in theaters)\nDirector James Wan returns for the next adventure following Arthur Curry (Jason Momoa) as the newly crowned King of Atlantis. Now in his new role, Arthur will explore more of the world under the sea while also dealing with new threats from Black Manta (Yahya Abdul-Mateen II) and others. Like Shazam 2, Aquaman 2 has endured its share of release-date changes, with its new Christmas 2023 date designed to give Wan and company ample time to complete all the necessary special effects.\nUpcoming DC Movie Release Dates\nJoker: Folie à Deux\nRelease date: October 4, 2024 (in theaters)\nTodd Phillips never saw his Joker movie as anything but a singular film. But over a billion dollars at the box office and an Oscar for Best Actor (for star Joaquin Phoenix) obviously changed things. We have a few nuggets of info so far: the title is Joker: Folie à Deux(French for “shared madness”), Phoenix is returning and will co-star with Lady Gaga (who’s playing Harley Quinn), Zazie Beetz is probably returning as Arthur Fleck’s neighbor, and… it’s likely going to be a musical? Filming wrapped in early April 2023.\nThe Batman 2\nRelease date: 2025 (in theaters)\nHot off the success of Matt Reeves’ long-awaitedThe Batman, everyone involved made it clear that wasn’t a one-and-done. Robert Pattinson’s Batman will be back. Will he face off with the Joker? It’s possible but not definitive. You’d imagine the Penguin and Catwoman could be back too. We don’t know much yet about this one, but we do know it won’t be arriving until 2025.\nCurrent DC Shows\nDoom Patrol Season 4, Part 2\nRelease date: TBD 2023 (on Max)\nThe fourth and final season of Doom Patrol—starring Brendan Fraser, Matt Bomer, Diane Guerrero, April Bowlby, Joivan Wade, Timothy Dalton, Skye Roberts, and Michelle Gomez—already aired its first batch of episodes; the remaining six will return later this year.\nUpcoming DC Movies and Shows Without Release Dates\nThe Penguin\nRelease date: Unknown (on Max)\nYou saw him in The Batman and now, Colin Farrell’s Penguin is getting his own Max series. As of April 2023, the show is in production, with a cast that also includes Cristin Milioti, Rhenzy Feliz, Michael Kelly, Shohreh Aghdashloo, and Deirdre O’Connell, with Clancy Brown and Michael Zegen recurring.\nPeacemaker Season 2\nRelease date: Unknown (on Max)\nFrom the instant that opening credits scene rolled for the first time, DC fans and non-fans alike fell in love with Peacemaker. Well, he’s coming back, still played by John Cena and still from the twisted mind of James Gunn. There’s no word on when it’ll happen but we’re guessing 2024.\nSuperman: Legacy\nRelease date: July 11, 2025\nJames Gunn will write and direct this Superman movie, which is touted as not being an origin story. Casting announcements started with Clark Kent/Superman and Lois Lane, who’ll be played by David Corenswet and Rachel Brosnahan. We also know Isabela Merced will play Hawkgirl, Edi Gathegi is Mister Terrific, and Nathan Fillion is a Green Lantern (Guy Gardner), as well as Anthony Carrigan as Metamorpho.\nMore Upcoming DC Movies and Shows Announced for the Gunn/Safran Era\nThe shake-up at DC Studios got a huge zap of energy at the end of January, when James Gunn and Peter Safran announced their massive slate of planned projects. Little is known about most of these projects so far in terms of cast and crew and even release dates—but we do have a few tidbits for each.\nCreature Commandos (An animated Max show) – A seven-episode animated series written by James Gunn himself. It stars Indira Varma (Obi-Wan Kenobi, Game of Thrones) as the Bride, who’s the lead character, and Marvel veteran Frank Grillo as Rick Flagg Sr.—father of Rick Flagg, played by Joel Kinnaman in The Suicide Squad. The rest of the cast includes David Harbour (Stranger Things) as Eric Frankenstein, Sean Gunn (Guardians of the Galaxy Vol. 3) as G.I. Robot, Zoe Chao (The Afterparty) as Nina Mazursky, Alan Tudyk (Star Wars: Rogue One) as Dr. Phosphorus, Maria Bakalova (Guardians of the Galaxy Vol. 3) as new character Princess Ilana Rostovic, and Peacemaker’s Steve Agee and Sean Gunn returning as John Economos and Weasel, respectively.\nWaller (A live-action Max show) – Viola Davis will reprise her Suicide Squad character; the story will bring back characters from the Peacemaker show and tell a story with events set between Peacemaker seasons one and two.\nLanterns (A live-action Max show) – Set on Earth, this mystery series will follow Hal Jordan and John Stewart doing their thing as DC’s “super cops.”\nThe Authority (Theatrical film) – The Wildstorm superhero characters will make their big-screen debut in a film co-written by Gunn.\nParadise Lost (A live-action Max show) – How did Wonder Woman’s world, Themyscira, come to be? Find out in this Game of Thrones-ish tale set before her birth.\nThe Brave and the Bold (Theatrical film) – Based on the acclaimed Grant Morrison comic run, this will explore the story of Batman’s son, Damien Wayne, and will feature “other members of the extended Bat-family.”\nBooster Gold (A live-action Max show) – The “loser from the future” superhero character gets his own series.\nSupergirl: Woman of Tomorrow (Theatrical film) – Based on Tom King’s comics run, this movie will explore how Supergirl is different from Superman. It’s not yet certain if Sasha Calle, who plays Supergirl in The Flash, will reprise the role here.\nSwamp Thing (Theatrical film) – The character’s “dark origins” will be the focus of this one. DC does horror! Rumored but not yet confirmed to be directing, James Mangold (Indiana Jones 5) told Collider that he’s slated to write the script.\nUpcoming DC Movies and Shows That Were Once in Development, But Whose Fate Is Unclear in the Gunn/Safran Era\nTa-Nehisi Coates and J.J. Abrams’ Superman movie\nRelease date: Unknown (in theaters)\nThe news of Superman: Legacy cast uncertainty on this project from writer Ta-Nehisi Coates and producer J.J. Abrams. There hadn’t been an update on this one in a while, but in late April, James Gunn himself told io9 that the two films don’t necessarily cancel each other out: “That’s an exciting movie … if it comes in and it’s great … and if the timing is right, that could absolutely happen. That’s totally unrelated. It would be an Elseworlds tale like Joker.”\nMichael B. Jordan Superman Series\nRelease date: Unknown (for Max)\nMichael B. Jordan was once developing a Superman take for Max as a limited series that would feature Val-Zod as opposed to Clark Kent. Again, there hasn’t been an update in a while.\nStatic Shock\nRelease date: Unknown\nPart of the relaunch of the Milestone comic brand is this adaptation produced by, once again, Michael B. Jordan. A writer was hired back in 2021 to come up with a script and we haven’t heard much since.\nJustice League Dark\nRelease date: Unknown (for Max)\nJ.J. Abrams was among the people involved with bringing this evil super-team to life and while there hasn’t been a ton of movement on the project of late, it’s been around long enough that we’d imagine it happens eventually.\nMetal Men\nRelease date: Unknown\nOne of the more recent pre-Gunn/Safran DC films to go into development, this is this tale of six beings based on various powerful metals. It’s from directors Ron Clements and John Musker (Aladdin, The Little Mermaid, and Moana), so if it happens, it’ll have an incredible pedigree.\nZatanna\nRelease date: Unknown\nLast year, Emerald Fennell won an Oscar for writing Promising Young Woman. She followed that up landing the job to write this DC superhero flick about the young magician. Like most of the films in this section, there hasn’t been movement in a while.\nHourman\nRelease date: Unknown\nYes, the hero who takes a drug that makes him a hero for an hour was, back in 2021, rumored to be in development. Whether or not that’s still the case is unknown but we figured it was worth noting.\nUntitled Arkham Show\nRelease date: Unknown (on Max)\nIn addition to The Penguin, Matt Reeves has said he plans to expand the world of The Batman into Max shows. At one point, a series about Gotham PD was in the works, but now he says it might be more about the inner workings at Arkham Asylum. On October 25, The Staircase’s Antonio Campos came aboard as a writer—the third to hold that position on the potential series so far—and may direct and serve as showrunner if the show happens, according to a report in Variety.\nWant more io9 news? Check out when to expect the latest Marvel and Star Wars releases, what’s next for the DC Universe on film and TV, and everything you need to know about House of the Dragon and Lord of the Rings: The Rings of Power."
    },
    {
      "url": "https://gizmodo.com/andor-gets-14-emmy-nominations-in-a-genre-heavy-year-2000629453",
      "text": "Television, it turns out, is geeky as hell. That seemed to be the major takeaway as the 77th annual Emmy Award nominations were announced Tuesday, with Severance leading all nominees with 27 total, HBO’s The Penguin coming in second with 24, The Last of Us in fifth with 16, and Andor coming in sixth with 14, including Outstanding Drama Series.\nOther genre shows, such as The Acolyte, Agatha All Along, Black Mirror, The Boys, Cobra Kai, Dune: Prophecy, House of the Dragon, Invincible, Paradise, Poker Face, What If, and What We Do in the Shadows all each got at least one nomination. And, for the first time ever, Han Solo himself, Harrison Ford, got an Emmy nomination for his work on the Apple TV+ show Shrinking.\nSo which awards did Andor get? Well, besides the biggest one, they are mostly technical. Here’s the list:\n- OUTSTANDING PRODUCTION DESIGN FOR A NARRATIVE PERIOD OR FANTASY PROGRAM (ONE HOUR OR MORE)\n- OUTSTANDING CINEMATOGRAPHY FOR A SERIES (ONE HOUR)\n- OUTSTANDING FANTASY/SCI-FI COSTUMES\n- OUTSTANDING DIRECTING FOR A DRAMA SERIES\n- OUTSTANDING PICTURE EDITING FOR A DRAMA SERIES\n- OUTSTANDING MUSIC COMPOSITION FOR A SERIES (ORIGINAL DRAMATIC SCORE)\n- OUTSTANDING ORIGINAL MUSIC AND LYRICS\n- OUTSTANDING GUEST ACTOR IN A DRAMA SERIES\n- OUTSTANDING CHARACTER VOICE-OVER PERFORMANCE\n- OUTSTANDING DRAMA SERIES\n- OUTSTANDING SOUND EDITING FOR A COMEDY OR DRAMA SERIES (ONE HOUR)\n- OUTSTANDING SOUND MIXING FOR A COMEDY OR DRAMA SERIES (ONE HOUR)\n- OUTSTANDING SPECIAL VISUAL EFFECTS IN A SEASON OR A MOVIE\n- OUTSTANDING WRITING FOR A DRAMA SERIES\nAnd that guest actor spot went to Forest Whitaker for playing Saw Gerrera, and the voice-over performance went to Alan Tudyk. So, that means, despite a very nice 14 nominations, of all the incredible actors who appear on the show, only the Oscar winner got an Emmy nomination.\nHere’s a list of the other major categories with genre shows in them.\nOutstanding Drama Series\n- Andor\n- The Diplomat\n- The Last of Us\n- Paradise\n- The Pitt\n- Severance\n- Slow Horses\n- The White Lotus\nLead Actor in a Drama Series\n- Sterling K. Brown, Paradise\n- Gary Oldman, Slow Horses\n- Pedro Pascal, The Last of Us\n- Adam Scott, Severance\n- Noah Wyle, The Pitt\nLead Actress in a Drama Series\n- Kathy Bates, Matlock\n- Sharon Horgan, Bad Sisters\n- Britt Lower, Severance\n- Bella Ramsey, The Last of Us\n- Keri Russell, The Diplomat\nOutstanding Comedy Series\n- Abbott Elementary\n- The Bear\n- Hacks\n- Nobody Wants This\n- Only Murders in the Building\n- Shrinking\n- The Studio\n- What We Do in the Shadows\nLead Actor in a Comedy Series\n- Adam Brody, Nobody Wants This\n- Seth Rogen, The Studio\n- Jason Segel, Shrinking\n- Martin Short, Only Murders in the Building\n- Jeremy Allen White, The Bear\nLead Actress in a Comedy Series\n- Uzo Aduba, The Residence\n- Kristen Bell, Nobody Wants This\n- Quinta Brunson, Abbott Elementary\n- Ayo Edebiri, The Bear\n- Jean Smart, Hacks\nOutstanding Limited or Anthology Series\n- Adolescence\n- Black Mirror\n- Dying for Sex\n- Monsters: The Lyle and Erik Menendez Story\n- The Penguin\nLead Actor in a Limited or Anthology Series\n- Colin Farrell, The Penguin\n- Stephen Graham, Adolescence\n- Jake Gyllenhaal, Presumed Innocent\n- Brian Tyree Henry, Dope Thief\n- Cooper Koch, Monsters: The Lyle and Erik Menendez Story\nLead Actress in a Limited or Anthology Series\n- Cate Blanchett, Disclaimer\n- Meghann Fahy, Sirens\n- Rashida Jones, Black Mirror\n- Cristin Milioti, The Penguin\n- Michelle Williams, Dying for Sex\nYou can see the full list of nominees here. Winners will be announced at the show on September 14.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806",
      "text": "“Star Wars! Nothing but Star Wars! Give me those Star Wars! Don’t let them end…” Just as Bill Murray said it in 1978, we’re still saying it today. Star Wars is everywhere these days, with multiple movies and TV shows in the works from Disney and Lucasfilm. This article will give you the most up-to-date Star Wars release dates so you know exactly when every new Star Wars movie or Disney+ show will arrive.\nWhat are the next three movies? What TV shows are coming up? Have any TV shows or movies been canceled? What are people saying about what’s next? We’ve got you covered on all things in a galaxy far, far away.\nThis post was last updated on 9/13/2023.\nWhat’s the next Star Wars movie?\nSharmeen Obaid-Chioy’s New Jedi Order Film Film\nRelease Date: TBD, but May 26, 2026, December 18, 2026 or December 17, 2027 (In Theaters)\nAt Star Wars Celebration 2023 in London, Lucasfilm announced that three Star Wars movies are now in the works.\nJames Mangold (Indiana Jones 5) will direct a film 25,000 years before any known Star Wars timeline about the first Jedi to use the Force.\nDave Filoni will direct a film that’s kind of the Star Wars Disney+ Avengers, telling the story of a climactic event meeting the stories of The Book of Boba Fett, The Mandalorian, Ahsoka and more in the time between Return of the Jedi and The Force Awakens.\nAnd Sharmeen Obaid-Chioy will direct a film set 15 years after the events of The Rise of Skywalker following Rey (Daisy Ridley) as she creates a New Jedi Order.\nThis last one, we think, is the film that Damon Lindelof (Lost, The Leftovers, Watchmen) was co-writingwith Justin Britt-Gibson before departing the project. Steven Knight is now reportedly writing.\nA week after the news of these films first broke, it began to seem like the Rey project by Obaid-Chioy could be the first one out of the gate. However, in June, Disney shuffled its release schedule and moved its December 2025 Star Wars movie to May 2026, and added a third Star Wars movie to the schedule in December 2026. So maybe these three movies are on those dates. We’ll see.\nUpcoming Star Wars release dates\nThese shows and movies have all been officially announced and are in various stages of production, even if we don’t know when they will definitely come out.\nStar Wars: Ahsoka\nRelease Date: Now Playing (On Disney+)\nThe first full live-action Ahsoka Tano show from co-creator Dave Filoni is finally here. Rosario Dawson is, of course, returning. And our first look at footage confirmed that actress Natasha Liu Bordizzo has been cast as Sabine Wren; more recently, Eman Esfandi was confirmed as Ezra Bridger. At Star Wars Celebration this year we learned Mary Elizabeth Winstead is playing Hera Syndulla, Lars Mikkelsenis playing Grand Admiral Thrawn and Wes Chatham is his right-hand man.\nWhat does that all mean? Well, in the first teaser trailer, you can see she’ll make good onthe Star Wars Rebels finale and go after Thrawn. And what about the fact she knows Luke Skywalker now? And how does Ray Stevenson’s lightsaber-wielding character fit in?\nThe show is now airing on Disney+ and here you can read our weekly recaps:\nEpisode 1, “Master and Apprentice: and Episode 2, “Toil and Trouble”\nEpisode 6, premiering September 19\nEpisode 7, premiering September 26\nEpisode 7, premiering October 3\nStar Wars: Skeleton Crew\nRelease Date: 2023 (On Disney+)\nCreated by Spider-Man Homecoming/Far From Home/No Way Home director Jon Watts along with writer Chris Ford, this mystery Star Wars show is now currently in development. The title for the show was released during the Star Wars Celebration, and was previously internally referred as “Grammar Radio.” Celebration also revealed its headlining star, Jude Law.\nSet after the events of Return of the Jedi, Skeleton Crew is described as an adventure in the mold of Amblin adventures of the 1980s. The show will be about seeing the galaxy through the eyes of children (but it is not a kids show), and will follow a group of children who get lost in the galaxy and try to find their way home. Jon Watts explained that the series will take place during the same time period as the upcoming Ahsoka series and The Mandalorian.\nFilming on the series began in 2022 and ended in early 2023. And though not much is know about what happens on the show,it has been revealed that The Daniels, the Oscar-winning directors of Everything Everywhere All At Once, directed an episode. Ditto David Lowery, who did the film The Green Knight. Read more about the show here.\nio9 saw the first footage at Star Wars Celebration 2023 and you can read about it here. Three of the main stars of the show are played by Ravi Cabot-Conyers, Kyriana Kratter, and Robert Timothy Smit. Rumors suggest it could debut in November or December 2023.\nStar Wars: The Acolyte\nRelease Date: 2024 (On Disney+)\nRussian Doll co-creator Leslye Headland will be the first person to bring the excellent High Republic timeline into live-action with this show, long rumored to star Amandla Stenberg before an actual confirmation finally arrived at San Diego Comic-Con 2022—one of few Star Wars bits of news to emerge from the convention.\nIn an interview in 2022, Headland revealed the show would be about 100 years before the events of The Phantom Menace. “A lot of those characters haven’t even been born yet,” she said. “We’re taking a look at the political and personal and spiritual things that came up in a time period that we don’t know much about. My question when watching The Phantom Menace was always like, ‘Well, how did things get to this point?’ How did we get to a point where a Sith lord can infiltrate the Senate and none of the Jedi pick up on it? Like, what went wrong? What are the scenarios that led us to this moment?”\nIn an interview released later, Headland spoke about her goals for the series. For Headland, above all else The Acolyte is a mystery, and that mystery is figuring out what is going on in this peak period. It was also suggested that The Acolyte will bring more elements from the Expanded Universe to canon, but what parts that will be incorporated will remain to be seen.\nIn September 2022, both Jodie Turner-Smith and Squid Game’s Emmy-winning Lee Jung-Jae joined the cast, with an official announcement in November adding Carrie-Anne Moss, Manny Jacinto, and others to the roster. The first image, which you see above, was released in November and you can read about the first footage here, which was shown at Star Wars Celebration 2023.\nAnd no, despite what bullcrap rumors you may have been reading online, the show has not been canceled.\nAndor: Season 2\nRelease Date: August 2024 (On Disney+)\nSeason one of Tony Gilroy’s Rogue One prequel starring Diego Luna showed an excitingly different side of Star Wars. Season two will reportedly be spread across the four years leading up to Rogue One, with four episodes covering each year in Cassian Andor’s life until that fateful point. Filming began in late 2022.\nAt Star Wars Celebration 2023, Gilroy announced the show should be out in August 2024 and showed fans the first footage from the season. Read about it here. Plus, the final episodes of the season/series will take place just days before Rogue One, leading right into that story.\nOne minor hiccup though, due to the Writer’s Guild strike, showrunner and head writer Tony Gilroy left his duties show in May 2023. He’s unlikely to return until the Writer’s Strike is over, which could cause a delay.\nStar Wars: A Droid Story\nRelease Date: TBD (On Disney+)\nLucasfilm Animation is teaming up with Industrial Light and Magic for this streaming show that will “introduce us to a new hero, guided by legendary duo R2-D2 and C-3PO.” We don’t know anything beyond that and there hasn’t been a significant update in years, which could be a good thing or bad thing.\nStar Wars: Lando\nRelease Date: TBD (On Disney+)\nWay back in December 2020, Disney announced a bunch of Star Wars TV shows. Among them was a Lando show which, at the time, was going to be made by Dear White People creator Justin Simien. After that, things went quiet for about three years. Then,in an April 2023 article, Donald Glover hinted that he’s still interested and it’s still possible in the works. A May 2023 interview with Lucasfilm president Kathleen Kennedy confirmed it’s still in the works.\nThe first significant update in almost three years came in July when news broke that Simien has been off the project since he started working on Haunted Mansion, and not only is Donald Glover going to star in the series, he’s co-writing it with his brother Stephen.\nUntitled Taika Waititi Star Wars Movie\nRelease Date: TBD\nIn May 2020, news broke that Oscar-winning director of Thor: Ragnarok would be helming and co-writing along with Krysty Wilson-Cairns. “Taika’s approach to Star Wars will be fresh, unexpected, and … unique,” Lucasfilm president Kathleen Kennedy said. “His enormous talent and sense of humor will ensure that audiences are in for an unforgettable ride.”\nThere was a time when this was likely to be the next Star Wars film but, after Star Wars Celebration 2023, it seems like it’s now on the back burner. That was confirmed by Lucasfilm president Kathleen Kennedy who said the Oscar-winner is still working on the film, it’s just going slowly.\nIn the past, Waititi has discussed some broad ideas of what he wants to do with his upcoming film. Read those below.\nTaika Waititi Doesn’t Want Star Wars to Rely on Legacies\nAre You as Confused About Taika Waititi’s Star WarsMovie as We Are?\nUntitled Dave Filoni Star Wars Movie\nRelease Date: TBD\nWe mentioned this one above but, at some point, Dave Filoni will be directing a film that is meant to be a climactic event wrapping up stories that have begun on shows he’s involved with such as The Mandalorian, Ahsoka, The Book of Boba Fett, Skeleton Crew and others.\nUntitled James Mangold Star Wars Movie\nRelease Date: TBD\nThis was one of the three films announced at Star Wars Celebration but, like Filoni’s, isn’t likely to be next. This one is set 25,000 years before the original trilogy and tells the story of the first person to use the Force.\n“For me, it’s about, I want to be part of the saga, but I also don’t want to be holding so much lore in the air that you can hardly tell a story,” Mangold told io9 when asked about this film. “And what I really wanted to do…was just can we make a kind of the Ten Commandments of the Force, you know? A kind of origin story of how the Force came to be known, understood, wielded, and harnessed.” We love this idea so much we even wrote about it.\nStar Wars Movies and TV Shows That Are Currently Unscheduled and Haven’t Been Officially Announced, But We Think Are Still Happening\nThe Mandalorian Season 4\nRelease Date: TBD\nWith The Mandalorian Season 3 now in the books, all eyes look ahead to season 4. However, the season has not yet been officially announced. Unofficially though, series creator Jon Favreau said he’s already written a fourth season which he probably wouldn’t have done just for fun. It’s coming. It’s just a matter of when, especially with writers and actors on strike.\nThe Book of Boba Fett Season 2\nRelease Date: TBD (On Disney+)\nThe Book of Boba Fett season one ended with the implication that we’d see more of these character in the future. But alas, there has been no official announcement… yet. Dive into the making-of season one while we wait and ponder the words of executive producer Robert Rodriguez who said he knows when the character is coming back, but he can’t say when.\nUntitled Shawn Levy Movie\nRelease Date: TBD\nShawn Levy, the prolific director and producer behind Stranger Things, Night at the Museum, and Free Guy is gearing up to develop a film in a galaxy far far away. He’ll focus on that after completing Deadpool 3, which stars Ryan Reynolds and Hugh Jackman.\nStar Wars Movies and TV Shows That Are Currently Unscheduled and Probably NOT Going To Happen\nStar Wars: Rangers of the New Republic\nOriginally announced alongside shows like Obi-Wan Kenobi, Ahsoka, and Andor, Rangers of the New Republic was rumored to be Cara Dune’s show which would tie into The Mandalorian and Book of Boba Fett. However, with actress Gina Carano no longer a part of Star Wars, word on the street is this will no longer be happening. Nothing is official though.\nUntitled Rian Johnson Trilogy\nLet’s be honest. Do we think this is happening anymore? Probably not. Rian Johnson has moved on to other things. But, until we hear otherwise (and no one is officially saying), we’d be remiss if we didn’t mention that before the divisive release of The Last Jedi, Lucasfilm officially said Johnson would make his very own trilogy. It hasn’t officially been canceled yet but, in a new interview, Lucasfilm president Kathleen Kennedy suggested that it’s been placed on the back burner as Johnson does other things. With Johnson’s next film, Glass Onion, set for release in late 2022 though, he’s been quoted saying he still hopes these movies happen. So do we.\nStar Wars: Rogue Squadron\nFor several years, Wonder Woman director Patty Jenkins’ film about pilots in the Star Wars universe has been earmarked as the next film. Well, that’s no longer the case. After months of rumors suggesting it might move off its 2023 release date, Disney officially took it off the schedule. On December 13 2022, Jenkins said the movie is still in “active development” but recent news suggests it’s dead. Lucasfilm president Kathleen Kennedy disagrees, saying in May 2023 it’s still on the books.\nUntitled Kevin Feige Movie\nMarvel Studios President Kevin Feige is best known for helping create the Marvel Cinematic Universe. But as much as he loves Marvel, he loves Star Wars even more. And so it was exciting to hear that he was producing a Star Wars movie and even recruited Loki and Doctor Strange in the Multiverse of Madness writer Michael Waldron to help him. Feige doesn’t like to even acknowledge this project though and in a 2022 interview, Lucasfilm president Kathleen Kennedy also tiptoed around the project’s existence. Then, a few weeks before Star Wars Celebration 2023, we learned the project is likely dead.\nFor more, check out io9’s list of every canceled (or re-worked) Disney Star Wars project.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/andor-season-2-episode-3-mon-mothma-dance-2000589757",
      "text": "We open Andor‘s second season with, among other things, Mon Mothma in crisis. The moment she had been dreading since her deal with the devil in season one—the wedding of her daughter Leida to scoundrel financier Davo Sculden’s son—has arrived, a reminder of what the cost of funding the rebellion means to her, and the past traumas of Chandrilan culture, made manifest. But at the climax of it all we and Mon Mothma alike find out just how worst it can get for her to commit to this path, and what it will take to truly make Mon a rebel.\nIt’s not her speech denouncing the Ghorman Massacre—at least, not yet. We know that’s to come. Instead, Mon seals her path in the climax of season two’s three-episode first act with a simple, beautiful, terrible act… a dance.\nThe final third of Andor season two’s third episode, “Harvest,” comes as Mon has a frosty conversation with wedding guest and longtime rebellious associate Luthen Rael. Over the course of the three-day traditional wedding ceremony that Mon has anxiously labored through, her old friend and confidant Tay Kolma has become increasingly and, to Mon and Luthen alike, disturbingly, unreliable. Facing stresses that have ruined his marriage and threaten to bankrupt him, it becomes clear over the course of the ceremony with each encounter Kolma has with Mon that he is cozying up to Sculden, and with that partnership, gaining leverage in the potential of revealing the back-end dealings of Mon’s “charitable foundations” set up to cover her rebel financing. Mon wants to do what Mon does best: talk, negotiate, appease Tay with whatever price he asks for. Luthen wants his own perennial alternative: Tay Kolma needs to die.\n“We’d be vulnerable forever. You need to be protected,” Luthen growls at Mon amidst the bustle of the wedding’s final celebrations.\n“I’m not sure what you’re saying,” Mon snaps back.\n“How nice of you,” comes Luthen’s reply as he walks away… and suddenly, the refined quiet of the haughty, overwrought Chandrilan ceremonies is shattered by discordant, rhythmic noise.\nA DJ droid comes bursting into the room, and the energy turns on a dime. The music is not what you’d expect from everything we’ve seen of the Chandrilan wedding rites across these three episodes, we’ve just seen Luthen putting on airs to gift Leida and Stekan an ancient Chandrilan cultural statue thought lost to time. It blares synthy trills and thrumming beats, a sister piece to Nicholas Britell’s similarly hypnotic track “Niamos!” from season one. The crowd goes wild, spinning in circles, arms swinging, cheering and whooping.\nThe sequence becomes cut throughout the rest of the final act of the episode, as we rotate between the events on Chandrila and Mina-Rau. Bix’s attempted rape at the hands of an Imperial officer, Stormtroopers closing in on Brasso, Cassian’s return with experimental TIE in hand, as he attempts to rescue them, even Vel seeing Cinta from afar as it becomes clear she’s there to assassinate Tay on Luthen’s behalf—the outcome already decided well before his chat with Mon. All these moments intertwined are everything about what it takes to be part of the resistance to the Empire’s fascist grasp: the terrors that system’s abuse of power allows, the strength to defy it, the heroism of turning the odds, and the bloody-handed willingness to do what it takes to keep the movement alive. This is the rebellion that Mon Mothma has backed, this is what she and her money has helped make.\nAnd every time we return to her, that music drowning it all out, the crowds swirling around her, enclosing on her, the more Mon loses herself to the moment and the truth of what she has built. It’s an incredible tonal discordance to the events that weave through it, but in Mon’s gradual slip into an almost-trance, we parallel her embrace of what she now is too truly part of. A drink becomes two, an awkwardness as she first enters the dance circle—alone in a sea of many—gives way to flow, to confidence, and as we cut away from Cassian, Bix, and Wilmon one last time, fleeing away from Mina-Rau after losing Brasso, it becomes this hypnotic elation. Mon is one with the crowd, at its very center, as the camera whips and and makes disorienting spins around her, and all of a sudden it’s her arms likewise whipping around in the air above her more intensely than anyone else.\nThe episode ends on the cost of rebellion: Brasso’s dead body as Cassian’s purloined TIE pulls away from Mina-Rau, its grieving crew silent with tear slicked faces. Cinta taking Tay Kolma to his doom as Vel collapses away from the bustle of the party, reckoning with her chance encounter. But the music keeps playing. Mon Mothma keeps dancing.\nIn this sweeping moment of ecstatic delirium, she embraces what she has become. It’s not how anyone might have imagined that Andor might galvanize its fascinating political figurehead as we race towards the Rebel Alliance’s formal birth, but the contrast of the claustrophobic, almost hedonistic quality of Mon’s dancing with the tragedies unfolding around her is a fittingly symbolic moment for the show’s resistance. Now it’s up for us to see what Mon Mothma is really capable of when the beat stops playing.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/disney-went-to-the-emmys-and-said-for-your-consideration-andor-all-of-it-2000606618",
      "text": "With Andor‘s second and final season now complete, Disney is hoping to turn the show’s critical raves and thoughtful discourse into award-season triumphs. It’s submitting the show for consideration in 23 categories at this year’s Emmys. Among the honors Andor hopes to compete for: Outstanding Drama Series, which it was nominated for back in 2023 but ended up losing to Succession.\nThe 2025 race is again a strong one, with Severance the likely frontrunner. But even if Andor doesn’t claim the top prize, it still has excellent chances to not only be nominated in, but win several other categories. According to Variety, these are the categories in which Disney is submitting Andor for Emmy consideration:\n- Outstanding Drama Series\n- Directing for a Drama Series: Janus Metz for episode 208, “Who Are You?”\n- Writing for a Drama Series: Dan Gilroy for episode 209, “Welcome to the Rebellion”\n- Lead Actor in a Drama Series: Diego Luna (Cassian Andor)\n- Supporting Actor in a Drama Series: Stellan Skarsgård (Luthen Rael); Kyle Soller (Syril Karn)\n- Supporting Actress in a Drama Series: Genevieve O’Reilly (Mon Mothma); Denise Gough (Dedra Meero); Adria Arjona (Bix Caleen); Faye Marsay (Vel Sartha); Elizabeth Dulau (Kleya Marki)\n- Guest Actor in a Drama Series: Ben Mendelsohn (Orson Krennic); Forest Whitaker (Saw Gerrera); Benjamin Bratt (Bail Organa)\n- Guest Actress in a Drama Series: Varada Sethu (Cinta Kaz)\n- Character Voice-Over Performance: Alan Tudyk (K-2SO)\nThe rest of the categories are: Casting for a Drama Series, Cinematography for a Series (One Hour), Fantasy/Sci-Fi Costumes, Period of Fantasy/Sci-Fi Makeup (Non-Prosthetic), Period or Fantasy/Sci-Fi Hairstyling, Production Design for a Narrative Period or Fantasy Program (One Hour or More), Music Composition for a Series (One Hour or More), Music Composition for a Series (Original Dramatic Score), Original Music and Lyrics (“We Are the Ghor”), Picture Editing for a Drama Series, Sound Editing for a Comedy or Drama Series (One Hour), Sound Mixing for a Drama Series (One Hour), Special Visual Effects in a Season or a Movie, Stunt Coordination for Drama Programming, and Stunt Performance.\nStar Wars series are no strangers to Emmy wins; The Mandalorian is currently the live-action show with the most trophies, having won 15 total across its three seasons in mostly technical categories. This year’s Emmy nominations are announced July 15, and the ceremony will be held September 14 in Los Angeles. What are your predictions?\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/andor-season-2-endings-explained-luthen-kleya-bix-star-wars-2000602980",
      "text": "Andor‘s final batch of episodes had to walk a steady balancing act, tying together myriad swirling character arcs into the overarching looming shadow of not just the events of Rogue One, but the events of Star Wars itself. In navigating those final climactic days where Andor could be itself as well as the passer of the torch, the show managed to give us and its characters alike the endings that perhaps mattered most.\nLuthen\nIt’s impossible to talk about the final arc of Andor without talking about the ending it gets out of the way first. Luthen’s long-awaited confrontation with Dedra is tragic in many ways, not just because of his choice to sacrifice himself to deny her the information she craves, but because, in contrast to the other rebellious stories we see climax here, it’s so incredibly lonely. There is no grand exit, no long goodbye—he gets a brief moment with Kleya when he sends her away, and of course, Dedra’s attempts to keep him alive make the actual moment of his end occur after the course of episode 10, “Make It Stop.” He dies quietly, he dies unable to really know just what an impact he’s about to have on the people he knew, the people he loved, the Rebellion, and the fate of the galaxy itself.\nBut Luthen’s final moment standing, before he takes the knife to himself, as sad as it is, is also a beautiful one—one that thematically then ties the endings of the rest of the rebels across Andor‘s final act together brilliantly. “The Rebellion isn’t here anymore, it’s flown away,” he tells Dedra. “It’s everywhere now… there’s a whole galaxy out there, waiting to disgust you.” The work Luthen did may have been isolatory by design, playing cells and operatives off each other, the paranoia of all the secrets he helped keep. But as he burns brightly, for that sunrise he knew he’d never see, he is defiantly steadfast that what he has helped create has connected voices all over the galaxy. That there are, as his agents’ code phrase said, friends everywhere.\nPartagaz and the ISB\nIt is this particular thematic throughline sparked by Luthen’s words that also defines the endings of our Imperial antagonists across the arc in stark contrast. We’ll get to Dedra separately, but it’s interesting that the endings we get for Andor‘s ISB apparatus—represented by her, Partagaz, and Heert in these episodes, and to a lesser extent double-agent Lonni—are lonely for very different reasons than Luthen’s was. Syril’s death on Ghorman laid the blueprint here: Andor‘s vision of the Empire is defined in equal parts the abuse of its systems for personal glorification, and the deadly threat of that system subsuming even its most ardent supports and benefactors, because that’s exactly what the Empire is designed to do.\nLonni might die at Luthen’s hands, it’s implied, but he dies because his use as a tool of the system he’d turned on is over. Heert’s grand chase of Kleya—a mirror to Dedra’s obsession with Axis that he’d sneered at her for—is rewarded with K2 tossing his lifeless body around as a meatshield, crumpled and forgotten. Partagaz’s is perhaps the most deliciously bitter, not just for the system he helped create crashing down around him, but because, again, his final moments are spent realizing that the rebellion is so much bigger than the “disease” he thought he could contain and sterilize. He’s alone in a room, committing suicide, after hearing Nemik’s manifesto: he has no idea who it is. He just knows, again, that it’s getting out everywhere.\nKleya\nKleya’s end is not so much an end, but a continuation of a legacy that she’s followed her whole life. Luthen’s sacrifice gives her a chance to flee and tell the Rebellion about the Death Star, but it also pushes her out from under his lonely world of cloak and daggers, in a way. In the flashbacks that are woven throughout her solo mission to lay Luthen to rest before the Empire can pull him from the brink, we see her story start alone and afraid and angry—and in choosing to save this orphaned child and help her point that anger somewhere as she grows up, Luthen’s final gift to Kleya is to give her something bigger to be part of. Perhaps it’s a story we’ll revisit someday, of Kleya’s life in the Rebellion, but in this moment that set of facts doesn’t really matter, it’s that she gets to carry on his spirit as the Rebellion flourishes.\nDedra\nIt’s fitting and so telling then, that Kleya and Dedra’s final moments on-screen in Andor are side-by-side. If Kleya wakes up to on the new dawn of being part of the thing her mentor helped build, then Dedra—clad in those white-and-orange scrubs of the Imperial prison system—is to witness the structure that she helped build and champion chew her up and spit her out into some forgotten hole. We know from season one’s arc on Narkina-5 that the Empire has now designed these facilities to never really grant freedom. There’s a fascinating parallel to Syril’s own death in her ultimate punishment, the idea that her obsession with Axis, as his was with Cassian, pushed her and pushed her to a point where the Empire itself could turn on her and discard her, and she’d be too blinkered to notice it until it was too late.\nIt’s not just that Dedra’s hoarding of information she shouldn’t have lands her in Krennic’s crosshairs, it’s her drive to get Luthen, to keep him alive once he mortally wounds himself, in the hopes that she will be rewarded regardless of any transgression she’s made to get there. That the Imperial system she believed in will work for her, rather than her for it. But the Empire exists to consume even its most loyal adherents, and so her punishment for championing it so ardently is as satisfying to watch as it was inevitable.\nBix\nIf any of Andor‘s endings might prove controversial, it’s perhaps its very last one. In some ways, Bix’s isolation from the final act of Andor (a decision she makes, but one that still takes her out of the broader fight she had previously yearned to be part of), only for her to part the series with the revelation that she’s given birth to Cassian’s child—a child he’ll never know—treats her story as less her own, and more in the service of Cassian’s. But it’s likewise also compelling that Bix is the rare character who ends the series given the chance of peace, of not having to fight and struggle. Many of the journeys that close out Andor are ones that we know will continue, and more specifically that continue in the sense that their fight isn’t over yet. That she is the final vision we have the show feels, in part, that this is what it was all for: to be free to live life with loved ones, a generation that can grow up in the hope that they in turn don’t have to fight and struggle to maintain that peace.\nBail Organa\nBut wait! Bail Organa’s journey doesn’t end in Andor. He’s in Rogue One! He’s technically in A New Hope, or at least very, very tiny atomized parts of him are!\nBut while those stories are, chronologically speaking, Bail’s last moments in the Star Wars saga, it feels like Andor actually gives the man himself a proper sendoff—more proper than the hasty one he gets in Rogue One to go meet his explosive destiny—in his brief chat with Cassian. It’s short and sweet but laden with meaning, to give Bail a little teeth, and a moment of bonding with Cassian after their initial disagreements. We don’t ever get to see Bail’s final moments from his own perspective on screen (they’re retold, if you’re interested, in the From a Certain Point of View anthology), but giving him a goal to go out swinging feels like a fitting coda.\nThe Stories Left Untold\nBut for all the above stories that Andor wraps up in its last act, there’s just as many—and it’s just as important—that it leaves so many paths open. There’s characters we just simply don’t see again, like Leida after her wedding, or even further flung characters like Kino Loy from season one. There’s characters for who the story just continues elsewhere, like Cassian and K2 themselves, or Mon Mothma, last seen chatting to Vel amid the hubbub of Yavin IV, or Saw, staring down the Imperial occupation of Jedha. Some of these are famous Star Wars figures, and we know where they end up, but just as important is getting flashes like Wilmon and Dreena sharing food, or, in a grimly hilarious fashion, a drunken Perrin hanging off the arm of Davro Sculden’s wife.\nPerhaps most fitting then is an end we glimpse, but never get: when Cassian wakes from his slumber to go on his mission to Kafrene, he dreams of his long-missing sister. Andor‘s first major story thread, the focus of its opening scenes to put this whole story into motion, never gets resolved. Some people may be frustrated by that, in an age when Star Wars fans and Star Wars itself, at times, is obsessed with checking off the facts and details of its world. But we get everything we need to know: Cassian still thinks about her. He dies never getting the answer. We will, perhaps rightfully, never learn ourselves.\nNot all ends definitively. Life goes on. Even as we know the broad strokes of what’s about to go down in this moment in Star Wars, some answers are just never found. But there’s a whole texture of existence beneath that sweeping saga and those big questions, and that’s what Andor was always reminding us of.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/andor-tarkin-massacre-ghorman-eu-canon-2000598711",
      "text": "Ever since it was first teased that Andor‘s second season was preparing to show the tragedy that set the stage for the formal formation of the Rebel Alliance, there’s similarly been discussion of the fact that there are two Ghorman Massacres. The one we are about to learn much more about in this week’s batch of episodes, and the very different version of events that took place in Star Wars‘ old Expanded Universe. Would we be getting something new, or something inspired by the story that had come before? Andor simply responded: why not both?\nAlthough this week’s episodes are primed to ignite the simmering tensions for what will become the Ghorman Massacre—the one that sparks Mon Mothma to publicly rail against Palpatine’s authoritarianism, flee the Senate, and call for the Alliance to Restore the Republic—last week’s act of Andor season two took us to Ghorman early to explore the planet’s resistance to the Empire. We learn pretty quickly during that exploration that while tensions between the Ghor and the Empire are at an all time high at the moment (thanks to a campaign the Empire’s enacting to fulfill its secret desire to mine the world for resources it needs to build the Death Star), disdain for the regime is not just contemporary feeling on the world.\nThere has already been a massacre on Ghorman once. The Tarkin one.\nThis Tarkin massacre matches many of the details of what was the primary Ghorman Massacre in Star Wars‘ old EU: it took place relatively early on in reign of the Empire, it involved a young Tarkin slaughtering hundreds of unarmed Ghorman protestors by landing a cruiser on them, it sparked wider public blowback to the Imperial regime. It is, for all intents and purpose, the EU’s Ghorman Massacre reconstituted into current Star Wars continuity. But crucially, it is no longer the incident that takes that name. The new story doesn’t erase the EU one, it weaves it into history, and creates thematic and narrative depth by choosing to say that it was not one or the other, but both.\nNow, Ghorman’s history of resistance holds up a mirror to the cyclical conflict echoed throughout the wider Star Wars saga—and crucially, the Empire’s cruelty, the Tarkin Doctrine of fear crushing dissent, is given a fatal flaw. Ghorman didn’t break in the wake of this first Imperial atrocity, it remembered its past and fought regardless, and although we’re only on the cusp of learning the full details of this latest one, we know the planet’s resistance will inspire greater pushback against the Empire in the wake of it, laying the groundwork for open galactic civil war and the Empire’s fall in its wake. It’s a brilliant parallel to the first season’s lessons with Nemik, the idea that fascist control through power can be broken if only people try, and keep trying, to not bend in the face of it.\nAnd most importantly, it’s texture that matters more than just checking off a known name or event. Andor doesn’t nudge and point when it makes note of the Tarkin massacre; if you weren’t already familiar that this was a known thing from the EU it might as well just have been an organic piece of background information. It’s woven into the narrative in the moment, not to disrupt the current story, but further enrich it. It’s something the series has done a surprising amount of, from offhand mentions of the Rakatans to the oodles of Easter eggs in Luthen’s antiques collections: it treats Star Wars‘ “legends” as history, something to provide color and context but not to necessarily dictate the story it’s telling in the here and now.\nThe point of evoking the Tarkin massacre is not simply to say “here is that thing from that other time” and call it a day, but to recognize the storytelling potential of recognizing these twinned versions of this same event, and realizing it’s more interesting to have both co-exist rather than cancel out one or the other. After all, there should always be a little truth in legends.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/tony-gilroy-has-the-perfect-reason-his-andor-scripts-werent-released-2000574015",
      "text": "One of the biggest reasons Andor is so good is one you probably don’t even think about. Sure, you can look at the gorgeous images on screen, the intense performances, and the beautiful sets, but none of that is possible without the writing. Show creator and Oscar-nominated screenwriter Tony Gilroy is the man most responsible for the writing on Andor and, a few years back, he teased Lucasfilm was going to release the scripts for season one to the public. Unfortunately, that never happened—and in a new interview, he had the perfect reason why.\n“I wanted to do it,” Gilroy told Collider. “We put it together. It’s really cool. I’ve seen it, I loved it. AI is the reason we’re not.” Ah, yes. Everyone’s favorite thing: AI. It is true though; in 2023, when Gilroy mentioned releasing the scripts, sites like Chat GPT that scrape the internet to steal, uh, learn for various tasks were not a big thing. So the fact his scripts would be eaten up and spit out by the machine wasn’t a consideration. But soon after, it was.\n“In the end, it would be 1,500 pages that came directly off this desk,” he continues. “I mean, terribly sadly, it’s just too much of an X-ray and too easily absorbed. Why help the fucking robots any more than you can? So, it was an ego thing. It was vanity that makes you want to do it, and the downside is real. So, vanity loses.”\nHonestly, good for Tony Gilroy. Yes, it would be cool for fans to own his scripts, presumably in the form of some nice book. But literally putting out the blueprint of how to structure a perfect television show over 12 hours, complete with character arcs, twists, and turns, only for them to be copied ad nauseam in college term papers everywhere would only make his brand of talent and skill less special. Keep things secret. Keep them safe.\nGilroy is out this week promoting not just Andor season two which releases next month, but that Andor is coming to Hulu and YouTube. You can see the first three episodes for free here, watch an awesome season one recap below, and read our interview with the showrunner at this link.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856",
      "text": "There’s now over 30 feature films in addition to eight Disney+ shows in 15 years in the Marvel Cinematic Universe. 2023 got off to a promising start here’s what’s coming next from the MCU. In short: a lot, we began Phase Five with Ant-Man and the Wasp: Quantumania followed by Guardians of the Galaxy: Volume 3, Secret Invasion and by the fall we’ve got The Marvels on the horizon along with season 2 of Loki.\nHere’s the latest news for Marvel theatrical release dates and Marvel TV release dates on Disney+—which the studio can often tweak or reschedule—so we get it, keeping track of when your favorite superheroes are returning or making their debuts can be challenging. Don’t worry, to help you stay on top of things, we’re compiling all the current MCU release dates; when specific titles have been announced but still not officially scheduled, we’ll put them in order when we think they’re most likely to show up.\n(Last updated 6/16/23)\nWhat’s the next Marvel movie?\nThe Marvels\nRelease date: November 10 (In theaters)\nThe sequel to Captain Marvel will pull together three of the MCU’s most powerful women: Brie Larsen’s titular Captain, Ms. Marvel’s Iman Vellani as Kamala Khan, and Teyonah Parris as Monica Rambeau. Nia DaCosta (who most recently helmed the revival of Candyman) is directing the film.\nIn the finale of Ms. Marvel season one, Carol Danvers showed up in Kamala Khan’s bedroom, marking the first real tease of the film. The film release date change came with a poster. Most recently the teaser trailer dropped and here’s our breakdown of everything we saw.\nUpcoming Marvel Cinematic Universe Release Dates\nSecret Invasion\nRelease date: June 21 (On Disney+)\nThis series picks up storylines from both Captain Marvel and Spider-Man: Far From Home to explain the decades-long Skrull invasion of Earth. Samuel L. Jackson and Ben Mendelsohn will star withEmilia Clarke taking on the role of Talos’ grown daughter who has joined a rebellious splinter cell of Skrulls. Martin Freeman has also confirmed he will be appearing in Secret Invasion.\nThe Disney+ blurb of the series describes the series as a “crossover event series showcasing a faction of shape-shifting Skrulls who have been infiltrating Earth for years.” A trailer was released at D23.\nLoki Season 2\nRelease date: Fall 2023 (On Disney+)\nThe smash hit series about Tom Hiddleston’s antihero will return soon for more variant shenanigans across the multiverse. Hiddleston confirmed “the whole cast” of Loki’s first season will return for season two on an episode of Jimmy Kimmel Live. In December, we got a very, very brief tease of season two.\nEcho\nRelease date: November 29, 2023 (On Disney+)\nThis spinoff from the Hawkeye series will follow Echo, a deaf martial artist, as played by actress Alaqua Cox. Devery Jacobs (Reservation Dogs) co-stars. Echo officially began filming on May 24, according to a tweet by series creator Marion Dayre. According to James Clement on an episode of the Weekly Planet podcast, both Vincent D’Onofrio and Charlie Cox are set to return for the Echo series at Disney+.\nThe series was recently announced along with Ironheart, Agatha Coven of Chaos and What If season 2 as potentially moving to 2024.\nX-Men ‘97\nRelease date: Fall 2023 (On Disney+)\nThe X-Men are coming to the MCU… kinda. X-Men ‘97 is a revival of the classic ‘90s animated show, bringing back the same style, stories and yes, theme song, of the iconic series. (See more: X-Men ‘97 Looks Like a Nostalgic Blast From the Past)\nIronheart\nRelease date: 2024 (On Disney+)\nWith Tony Stark gone, the MCU needs a new super-genius inventor. Enter teenage prodigy Riri Williams (played by Dominique Thorne), who creates a brand new, ultra-advanced armored suit. Other cast members include Anthony Ramos (In the Heights) as the villain the Hood and Lyric Ross (This Is Us). Chinaka Hodge (TNT’s Snowpiercer) is attached as the head writer, and Black Panther director Ryan Coogler is an executive producer alongside Marvel’s Kevin Feige and others. Manny Montana (Good Girls) has joined the cast of Marvel’s Ironheart in an undisclosed role as well as Han Solo himself, Alden Ehrenreich.\nAgatha: Coven of Chaos\nRelease date: Winter 2024 (On Disney+)\nThis spinoff from WandaVision will star Kathryn Hahn as her fan-favorite character Agatha Harkness. Joe Locke (Heartstopper) and Aubrey Plaza (Hahn’s Parks and Recreation co-star, among her other many credits) are also in the cast, as is Patti LuPone. (A second WandaVision spin-off, this one focusing on Paul Bettany’s Vision, is also reportedly in the works.)\nCaptain America: Brave New World\nRelease date: August 26, 2024 (in Theaters)\nWe’ve got a new Captain America, so it was inevitable that we’d be getting a new Cap movie. Anthony Mackie will appear in the title role. Harrison Ford was announced to take over the role of General Thaddeus Ross and will make his debut in this release.\nDaredevil: Born Again\nRelease date: Spring 2024 (On Disney+)\nCharlie Cox and Vincent D’Onofrio will return as Daredevil and Kingpin for an 18-episode Disney+ series. Jon Bernthal has signed on to reprise his role as the Punisher. Things remain uncertain for Foggy and Karen.\nThunderbolts\nRelease date: December 20, 2024 (In theaters)\nMarvel Studios is readying a movie based on the comic Thunderbolts and director Jake Schreier has been tapped to bring it to life. This film marks the end of Phase Five of the Marvel Cinematic Universe. Steven Yeun (Nope) signed on for an undisclosed role\nBlade\nRelease date: February 14, 2025 (In theaters)\nDisney hasn’t revealed much about this reboot of the franchise that features a badass vampire-hunter who is also a vampire, but we know that it stars two-time Academy Award winner Mahershala Ali, who also played Cornell “Cottonmouth” Stokes in Netflix Marvel series Luke Cage. We also know Blade appeared (or at least his voice did) in the end credits of The Eternals. After losing director Bassam Tariq, who would have been the first U.S.-Pakistani person to helm a Marvel Studios film, Blade was put on pause, and its release date was shifted. But now it has a new director in place: Lovecraft Country’s Yann Demange, as well as a writer in Michael Starrbury, so the September 2024 date looks ever more likely.\nDeadpool 3\nRelease date: May 3, 2024 (In Theaters)\nRyan Reynolds’ “merc with the mouth” is set to appear in Disney’s first R-rated film following the company’s completed acquisition of Fox assets. Oh, and did you happen to hear that Hugh Jackman’s Wolverine is also appearing in this one? Unless you are cut off from all social media, you no doubt caught that announcement.\nDeadpool 3 writers Rhett Reese and Paul Wenick spoke with Den of Geek about how Deadpool’s move to the MCU will not affect the feel of the movie. Or, in Wernick’s words: “Deadpool’s gonna be Deadpool.” Reese also said that Disney has been more than willing to ensuring the franchise keeps its core identity. Shawn Levy (Free Guy) is directing.\nFantastic Four\nRelease date: May 2, 2025 (In theaters)\nPhase Six of the Marvel Cinematic Universe, kicks off with the MCU debut of Marvel’s most famous family. Jon Watts was scheduled to directbut he is no longer doing that—Matt Shakaman of WandaVision is now in the chair—and though we saw John Krasinski as Mr. Fantastic in Doctor Strange in the Multiverse of Madness, there’s no guarantee he returns.\nAvengers: The Kang Dynasty\nRelease date: May 1, 2026 (In theaters)\nSince neither Phase Four or Phase Five ended with Avengers movies, Phase Six will end with two, back to back. The first is The Kang Dynasty, a title which heavily suggests that Kang (Jonathan Majors) will play a major role. Destin Daniel Cretton (Shang-Chi) will direct.\nAvengers: Secret Wars\nRelease date: May 7, 2027 (In theaters)\nIt all comes down to this. Phase Six, and the whole Phase 4-6 arc of the Multiverse Saga, ends with Secret Wars. We don’t know anything about the plot other than the comics that the title is based on; Marvel veteran Michael Waldron (Loki, Doctor Strange in the Multiverse of Madness) is writing the script.\nArmor Wars\nRelease date: Unknown (In theaters)\nThis project—originally slated for a Disney+ series, but now getting the feature film treatment—will follow James Rhodes (Don Cheadle) as he tracks down stolen tech that allows criminals to replicate Iron Man technology.\nAlso: Marvel slotted several other projects for Phase Six that take place alongside Fantastic Four and the Avengers films. There are two in fall 2024, two in winter 2024, one in winter 2025, two in spring 2025 and two in summer 2025. Some of those are probably…\nUnscheduled But Probably Still Happening Shows & Movies\nMoon Knight Season 2\nRelease date: Unknown (On Disney+)\nMoon Knight himself, Oscar Isaac, was recently spotted in Egypt and teased that a second season of his show could be on the way. Marvel and Disney have yet to confirm.\nMarvel Zombies\nRelease date: Unknown (On Disney+)\nThis new animated show is loosely spun out from a breakout episode of What If? that saw MCU heroes battling a zombie apocalypse.\nSpider-Man: Freshman Year\nRelease date: Unknown (On Disney+)\nDisney says this new animated series follows Peter Parker “on his way to becoming Spider-Man in the MCU, with a journey unlike we’ve ever seen and a style that celebrates the character’s early comic book roots.”\nWhat if…? Season 2\nRelease date: Unknown (On Disney+)\nThe speculative animated series and its omnipresent narrator the Watcher will return with an all-new season. The show’s creators say next season will focus on new stories, new heroes, and “lots of fun.” Though the trailer still hasn’t been released, the Marvel Animation Panel at San Diego Comic Con revealed some Phase 4 characters that will be in the show.\nUntitled Wakanda Series\nRelease date: Unknown (On Disney+)\nNot much is known yet about this show set in Black Panther’s home country.\nUntitled Shang-Chi sequel\nRelease date: Unknown (In theaters)\nShang-Chi’s debut movie was compelling, exciting and fun. It also made a ton of money, so a sequel is inevitable. That the film’s director is making Avengers: The Kang Dynasty does throw it into limbo a bit.\nUntitled Wonder Man series\nRelease date: Unknown (On Disney+)\nMarvel Studios has announced that it’s moving ahead with a Wonder Man series. Shang-Chi and the Legend of the Ten Rings director Destin Daniel Cretton is attached to helm and Brooklyn 99 writer Andrew Guest (who also produced Hawkeye) is on board to showrun the series. On October 31, the title star was announced: genre favorite Yayha Abdul-Mateen II.\nUntitled mutants movie\nRelease date: Unknown (In theaters)\nNow that Disney owns the old Fox assets that included all the “mutant” Marvel superheroes, you can very likely count on characters like the X-Men making an MCU debut.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140",
      "text": "At a Glance:\nDoctor Who ended the eras of both Chris Chibnall as series showrunner and Jodie Whittaker as the 13th Doctor in 2022 with “The Power of the Doctor,” bringing to a close a three-season, three-special run.\nWhittaker’s replacement is returning star David Tennant. He will play the official 14th incarnation of the Doctor under returning showrunner Russell T. Davies, who revived Doctor Who in 2005 and managed the series until 2009.\nTennant will appear in three specials in November 2023 to coincide with the 60th anniversary of Doctor Who on November 23.\nHe’ll be joined by returning characters Donna Noble and Wilfred Mott, who were played by Catherine Tate and Bernard Cribbins in season four of Doctor Who. Neil Patrick Harris will play a new villain, while Heartstopper’s Yasmin Finney will play a character named Rose.\nTennant will be succeeded by Sex Education’s Ncuti Gatwa as the 15th Doctor. His announcement in May 2022 makes him the first Black male actor to play the character on-screen.\nGatwa will star in Doctor Who’s 14th season, set to air some time in 2024.\nMillie Gibson will co-star as the 15th Doctor’s companion.\nGame of Thrones star Indira Varma will play a mysterious character known as “the Duchess.”\nDoctor Who’s beloved tradition of doing a Christmas Special—no more New Year’s Day Specials, in other words—will return in 2023, with another confirmed for 2024.\nComedian Sooz Kempner will star in Doom’s Day, a new transmedia Doctor Who campaign tied into the anniversary. She’ll play Doom, the titular intergalactic assassin, who has found herself hunted by Death itself—and must use a purloined vortex manipulator with a day’s worth of time-jumping charge to find the Doctor and save herself.\nThis post was last updated 5/30/23.\nWhat’s Been Going on in Doctor Who?\nThree Doctor Who specials aired out the last days of Jodie Whittaker’s time as the Doctor in 2022. “Eve of the Daleks” saw the Doctor and her companions Dan (introduced in the prior 13th season, known as Doctor Who: Flux) and Yaz facing the titular iconic monsters in a time loop paradox. “Legend of the Sea Devils” revived the classic ‘70s monsters for a new adventure, while “Power of the Doctor” saw the 13th Doctor face off against the Master in an adventure that ultimately saw her mortally wounded, returning her companions to contemporary Earth while she regenerated into a new body.\nWhy Is David Tennant the Doctor Again? Is David Tennant Playing the 10th Doctor?\nWhittaker regenerated not into previously announced new Doctor Ncuti Gatwa, but David Tennant, who played the official 10th incarnation of the Time Lord from Christmas 2005 to New Year’s Day 2010, before reprising the role for Doctor Who’s 50th anniversary special, “The Day of the Doctor,” in 2013.\nWhile this marks his first return on-screen in the series since then, Tennant will not be playing the 10th Doctor, but the official 14th incarnation—and the character will be aware that they are both using a familiar form and are a new entity. Aside from the fact that Tennant is arguably the most popular actor to take on the role, so bringing him back for the 60th anniversary makes sense, there’s plenty of reasons Doctor Who can come up with as to why the Doctor’s regenerative process decided to re-use an old identity, more of which you can read about here.\nWhen Will Doctor Who Return in 2023?\nDoctor Who will return for three special episodes in November 2023, set to air in celebration of the series’ 60th anniversary.\nWhat Is Doctor Who’s 60th Anniversary Special About?\nAside from Tennant returning as the Doctor, he’ll be joined by former companions Donna Noble and Wilfred Mott, played by Catherine Tate and Bernard Cribbins (the actor’s last role prior to his passing in July 2022) in Doctor Who’s fourth season. Donna exited the series as a regular character after an adventure lead to her needing to have her memory wiped by the 10th Doctor, forgetting her time alongside him lest her mind face grievous harm, so just how Donna will play into the the story remains to be seen.\nThe Doctor and Donna will face a mysterious new adversary, played by Neil Patrick Harris, and will be joined in the specials by Yasmin Finney as a new character named Rose. How Finney’s Rose might connect to the other famous Rose of Doctor Who, Billie Piper’s Rose Tyler, also remains to be seen.\nIs There a Trailer for Doctor Who’s 60th Anniversary?\nThe first premiered at the end of “The Power of the Doctor,” and you can watch it above. The second premiered in December and you can watch it here:\nWhen Will Ncuti Gatwa Become the Doctor?\nGatwa is briefly seen in the trailer for Doctor Who’s 60th anniversary, so will presumably follow the long tradition of new Doctors appearing in the final moments of their predecessor’s last episodes to become the 15th Doctor. The BBC has announced that Gatwa will appear as the Doctor first “over the festive season” in 2023, before he takes over full-time in a new season of the show after that.\nIs There a Doctor Who Season 14 Release Date?\nThere’s no current release date for season 14 of Doctor Who, but it is expected to be broadcast some time in 2024.\nWhere Is Doctor Who Streaming in the U.S. and UK?\nCurrently, the first 13 seasons of the revived Doctor Who are streaming on the BBC iPlayer in the UK; in the U.S., the revived series streams exclusively on HBO Max. In both countries, episodes from the classic era of the show are available through Britbox.\nThis will change in 2023, at least in the U.S. The BBC and Disney have announced that as part of a new deal, Doctor Who will stream exclusively worldwide on Disney+, except for in the UK and Ireland, where it will still stream on the BBC iPlayer and BBC One. It’s currently unknown if this will affect Doctor Who’s place on BBC America, where it currently airs in the U.S..\nDoes Disney Co-Own Doctor Who Now?\nA report in the wake of the BBC/Disney announcement from British paper the Telegraph alleged that the deal will also see Disney contribute finances to help create the show, and while the series’ creative team will still hold control of the series primarily, the deal will allow Disney some level of say in the creative decisions for the series—as well as allowing access to talent or “cinematic production moments” previously inaccessible due to the BBC’s budget for the show.\nNone of this has been confirmed by the BBC, however. The announcement strictly focused on Disney’s acquisition of Doctor Who’s streaming rights, and did not mention any co-owning. The new era of the series will be made for the BBC by Bad Wolf Studios, created by former Doctor Who producer Julie Gardner and former BBC Controller of Fiction Jane Tranter—which is now owned by Sony Pictures Television, after the studio took a majority stake in Bad Wolf in December 2021. The series was previously made by BBC Studios directly.\nIn January, Davies did say that Doctor Who is now working with a bigger budget, telling GQ that Disney’s involvement came about as part of “the BBC’s notion to go for a streamer to invest in the show worldwide … We’re not on the budget level with Star Wars and the Marvel shows, [but] it’s better than it was … We’re not allowed to talk about budget… but it’s more than I’ve ever had to work with.”\nWant more io9 news? Check out when to expect the latest Marvel,\nStar Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about James Cameron’s Avatar: The Way of Water."
    },
    {
      "url": "https://gizmodo.com/andor-season-2-best-moments-spoilers-star-wars-2000603436",
      "text": "Andor season 2 came to an end this week, putting an end to Cassian’s chapters of the Skywalker saga and bringing about one of the greatest additions to Star Wars‘ modern era. Across four arcs jumping us closer and closer to the time of Rogue One, the season delivered some of the best Star Wars has had to offer–which made looking back on the season to collect what was the very best of the best joyous and painful in equal measure. But considering we can’t just say “all of it”, here’s our pick for 20 of the highest highlights from Andor‘s long goodbye.\nAct 1 (Episode 1-3)\nStealing the TIE Avenger\nAndor so rarely allows itself a big damn hero action setpiece–action is, more often than not, the terrifying climax of tense release, from the Narkina 5 prison riot to the Imperial oppression on Ferrix and Ghorman. But season 2 opens with a wonderful little display to give us a Cassian who has smoothly settled into his part as a Rebel agent, infiltrating Imperial ship research facilities on Sienar to swipe a prototype TIE (one with a fun Expanded Universe legacy). And then, just to knock him down a peg, it has him alert all the guards he can by accidentally backing it into a wall while he figures out the controls. Can’t let him get too smooth.\nKrennic’s Kalkite Boardoom\nKrennic’s Imperial meeting room to reveal his plans for the planet of Ghorman is already a delicious example of how the Empire controls and abuses people on various fronts, but really, the reason this scene is so good is Ben Mendelsohn just relishing being back in Krennic’s white cape. This is Krennic on the precipice of completing everything he’s ever wanted, and all he needs is one more thing: Kalkite. Deep, substrate, foliated kalkite, to be specific.\nIt’s just a joy to watch Medelsohn dance around like he’s top dog as he practically chews every word in the scene. Krennic’s just enjoying being in the spotlight as he lays out how this room of top Imperial brass, from the ISB to propaganda divisions to the navy, is going to help him achieve it.\nDedra vs. Eedy\nThere is already so much going on as Andor hits you with the reveal that Dedra and Syril have started seeing each other, and the relationship is as weirdly charged as you could’ve imagined. But in witnessing a slice of their bizzaro domesticity, we get the diva-off fans could only have dreamed off: a dinner at home with Syril’s mother Eedy, which leads to a stern Dedra turning the tables and making very clear who is wearing the immaculately-ironed pants in this relationship.\nBix Strikes Back\nAs the eye of Imperial oppression looms ever further over Mina-Rau, we see the true evils the Empire’s power manifests as in a shocking first for Star Wars, an attempted rape, explicitly named as such, when one of the inspection officers corners Bix and goes to assault her. It’s gutwrenching to watch, and one of the most tense fight sequences we’ve ever got in Star Wars, even as we get to see Bix triumph over her would-be abuser. It’s a powerful moment, and a chilling way to make the Empire’s abusive rot come to the forefront.\nMon Mothma’s Dance\nThe sequence of Mon Mothma’s crashout at Leida’s wedding has a bunch of layers to it–the tacit realisation from her that Luthen is willing to kill anyone he needs to to protect her, Cinta and Vel’s distant connection as the latter realises the former’s there to do Luthen’s dirty work, it all climaxing with Cassian coming just too late to save Brasso on Mina-Rau. But tying that all into the hypnotic, almost delirious sequence of Mon walking away from her conversation with Luthen to just give herself a moment to be lost in the crowd of dancing, exhilarated partygoers, swaying to the thrumming electro beats of that banger of a track… it’s a beautiful way to climax the first act.\nAct 2 (Episode 4-6)\nVarian Skye, Fashion Elite\nAs a nice mirror to his infiltration on Sienar, when Luthen first sends Cassian to Ghorman–a planet known for its exports of fashion–we get to see him do a bit of classic spywork and really dress to play the part, masquerading as designer Varian Skye to set up a meeting with the Ghorman resistance. It’s a very cool look (those shades!), but it’s also another way we get to see Cassian play his charm offensive, swaggering around with the confidence of a classy elite before he really makes clear to the Front just how much more prepared for this kind of thing he is compared to them.\nTarkin’s Legacy\nSyril’s infiltration of the discontent Ghormans and ‘Varian’s’ arrival on the planet reveals a wonderful bit of layering to Star Wars continuity: the massacre we’ve all known was coming this season wasn’t the first on Ghorman, there was one that took place years prior under the watch of Wilhuff Tarkin. It is, of course, a nod to the Expanded Universe’s original Ghorman Massacre, but Andor‘s choice to not just thrown in a nod to that version of events, but synthesize into its own history as further commentary on the Empire is a brilliant way to have an easter egg mention otherwise have some real dramatic heft.\nThe Sculden Heist\nAndor‘s second season is somehow even more tense than the first a lot of the times, and one of its best moments just layers on that tension thick: Kleya recruiting Lonni at a party hosted by Davro Sculden so she can successfully remove a listening device from an antique Luthen sold to the Chandrilan magnate before it’s discovered. There’s so much at play, not just as Kleya struggles to manage both her own nerves and Lonni’s as she struggles to free the device: they’re interrupted by Krennic and more ISB bigwigs being toured around by Sculden, who then bring up Luthen, Perrin, and Mon Mothma. The butting of heads between Senator and Director, the will-they-won’t they of just who might get ratted out in this moment it’s all deliciously done.\nVel and Samm\nThe tragic, sudden death of Cinta after she and Vel are also sent to Ghorman on Luthen’s behalf is one of season 2’s most delicate moments, but after the initial shock of her catching a stray blaster bolt from the unseasoned Front member Samm, what really twists the knife in is Vel’s reaction afterwards. Not content to leave the distraught young man be, Vel takes all her pain and pushes it into a terrifying warning for Samm that what he’s done, the life he’s unjustly destroyed, will haunt him for the rest of his life. A harsher punishment than if she’d lashed out or tried to hurt him in turn.\n“We’re the Fuel”\nSaw makes a compelling case for why so many are willing to follow him in a brilliant, charismatic scene with Wilmon after the Partisans use the young man’s technical skills to successfully steal a load of highly volatile starship fuel. Inviting Wil to huff the toxic fumes as he has taken to–a predilection that we know will eventually leave Saw’s body broken down even further by Rogue One. Saw’s loving ode to Rhydonium as the symbol of everything his fight against the Empire stands for is equal parts rousing and heartbreaking. Admitting that he’s long exchanged his life and his sanity for what he has to do to resist the evil of the Empire, in that moment Saw truly becomes the charismatic leader we’ve been told he is, consequences be damned.\nAct 3 (Episode 7-9)\nThe Healer and the Messenger\nAndor has largely drawn itself to other forms of spirituality than the Force up to his point, but Cassian’s brief encounter with a mysterious healer at the Yavin base is a wonderful way to bring Star Wars‘ core mysticism into the fold. It’s treated with a sense of weight and trepidation in equal bearing, as the healer offers a portent of Cassian’s importance to the skeptical man and an awestruck Bix. If so much of Star Wars is going to play with the idea of destiny and fate, this was a clever, beautiful way to bring in the inevitability of the events of Rogue One into the narrative of Andor.\nThe Massacre\nThe explosion of the protests on Ghorman into a full-on Imperial massacre is one of the most chilling sequences in contemporary Star Wars. A brilliant mirror to the climax of season 1 and the riots on Ferrix being putdown by the Imperials, the Ghorman Massacre not only becomes bigger from an action standpoint, but thematically denser and richer as it weaves in Syril realising just too late that everything Dedra was working him for was a horror on a scale unlike anything he could’ve comprehended. It’s also so brutal and horrible to watch, and that’s even before you get to…\n“Who Are You?”\nAh, what a perfect end to Syril Karn. From the moment he spots Cassian among the screaming masses being slaughtered on the plaza, to the moment a confounded Cassian hits him with the question that’s haunted his whole life, Syril’s final moments are a brilliant exploration of what has made his character so compelling, a deft commentary on how the Imperial machine craves young, impressionable men like him, only to forge them into useful, evil tools that can be discarded at a moment’s notice. A fitting end to one of the show’s best characters.\nThe Senate Speech\nWe don’t get to hear the full version, but we hear enough of Mon’s rousing denouncement of the Ghorman Massacre to matter, as does the galaxy, as she finally lets her rebellion step into the sunlight for all to see. It’s already potent for the moment it represents in Star Wars, but it’s a profound step for the franchise’s relationship with its own political history, with the explicit invocation of Empire’s actions as genocide. It’s always been the endeavour of the foolhardy to obfuscate Star Wars‘ political message, but this was the franchise shouting it for all to hear in a way you can’t ignore.\nRe-Writing the Story\nAndor has layered all sorts of connective tissue to the wider world of Star Wars across its story, but in making Mon Mothma a central figure of its story, it was always going to be running headlong towards another series almost as inevitably as it was Rogue One: her flight from Coruscant to Dantooine as depicted in Star Wars Rebels, to make the formal declaration of the Rebel Alliance. How Andor handles that is subtle, but fascinating, climaxing Mon and Cassian’s flight from the Senate with a moment of realization for the latter, and just how much this wider Rebellion is going to distance itself from the part that raised Cassian up: the story of Cassian’s extraction will be handed off to a more proper Yavin escort, the story told in a cleaner, more palatable way. It is by no means a knock to Rebels, but it’s a brilliant way to bridge those two stories.\nAct 4 (Episodes 10-12)\nLuthen and Kleya\nIt’s unfair to practically assign an entire episode of prestige television as a best ‘moment’, but christ, that’s kind of what “Make It Stop” ends up being. From Dedra cornering Axis at last, to Kleya’s one-woman infiltration mission to send Luthen on his way after he mortally wounded himself rather than give up the Rebellion, it’s an incredible farewell to one of Andor‘s core characters, while passing on his legacy to the next generation, woven throughout a brilliant exploration of their history together. Andor‘s got a lot of finest hours in its two seasons, but this is the finest among them.\nKrennic Gets Dedra\nNot to pick a moment within the above moment, but it would be remiss to not point out the moment Dedra’s obsession and ambition finally lays her low. The moment of terror as she realizes Krennic has come to bludgeon the systems she has upheld against her for hoarding all the little scraps of information that lead to word of the Death Star making it out to Luthen is incredibly played by Denise Gough, and Mendelsohn again manages to balance the delectably scene-chewing bravado of Krennic with a genuine menace.\n“It’s Everywhere, Isn’t It?”\nGetting to hear Nemik’s manifesto one more time might have been enough to mark this as a best moment, but the way it’s deployed is incredibly satisfying: one of the last things ISB head Major Partagaz hears, as he prepares to kill himself rather than face comeuppance for the ISB’s failures is an unknown voice of rebellion that’s echoing across the galaxy. His final admittance that the “disease” he sought to contain has come to choke him is a fitting end.\nCassian’s Dream\nOne of the first things Andor set up was Cassian’s search for his long lost sister, and in an age where Star Wars is more broadly obsessed with filling in as many details it can about its world and its characters, the fact that the show largely moved on from the “mystery” became something of a sticking point for some fans. Andor season 2 doesn’t give us an answer either–or rather, perhaps not one that would satisfy that need for cold, hard facts. One of the last things we see Cassian do in the whole show is wake up from a brief dream of his sister, and it’s all we really need to know: that he still thought of her, even right up to the very end, even if neither he or we got the answer.\nThe Final Shot\nRegardless of the controversy around Bix’s arc in season 2, the very last scenes of the series climaxing with her living a life of peace on Mina-Rau are a potent, hopeful note to end the series on. A series that was always barrelling towards the tragic sacrifice of its titular character instead ends on the revelation that the legacy he loved and shared with Bix will live on into a new generation, one that, at least for a while, will get to eventually come of age in a galaxy at peace.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/james-cameron-ai-threat-2000641872",
      "text": "As the industry behind generative AI keeps touting its evolution, Hollywood stands on a precipice to see just who’s going to be first to break ground leveraging the controversial technology in film production (although, reportedly, not for a lack of trying and failing behind the scenes). But for James Cameron, at least, the current will-they-won’t-they approach is untenable—and the filmmaker believes that studios have to start getting a grip on the technology now, before it irrevocably damages the livelihoods of moviemaking creatives for good.\n“I can’t think of anything coming up that is bigger and more important to us right now than confronting this generative AI issue,” Cameron recently told Screendaily, as he continues work on the future of the Avatar franchise in New Zealand. “It is critical that we master it and control it so that it remains an artistic tool and it doesn’t replace artists. The idea that this technology could potentially replace actors and the unique lens that every artist brings is horrifying… The new tools have the possibility of doing great harm because they can replace an actor, or they can synthesize an actor who is dead.”\nCameron has already been vocal over his concern with generative AI, leveraging his cultural history with the robo-apocalypse seen in the Terminator movies to jokingly, but not really jokingly, warn people that unchecked embrace of AI is a dangerous moment we find ourselves in—whether it’s for creative or other technological purposes.\n“I do think there’s still a danger of a Terminator-style apocalypse where you put AI together with weapons systems, even up to the level of nuclear weapon systems, nuclear defense counterstrike, all that stuff,” Cameron recently told Rolling Stone. “I feel like we’re at this cusp in human development where you’ve got the three existential threats: climate and our overall degradation of the natural world, nuclear weapons, and superintelligence. They’re all sort of manifesting and peaking at the same time. Maybe the superintelligence is the answer. I don’t know. I’m not predicting that, but it might be.”\nCameron hopes that one of those threats, climate change, might be combatted in part by the legacy of the sci-fi worlds he explores in Avatar. But as for generative AI, the filmmaker does not necessarily see the technology as a threat to be destroyed—instead, to be mastered and contained before it replaces human creativity. Last year, it was announced that Cameron had joined the executive board of StabilityAI, in part to see how the intersection of AI-generated images and visual FX work could be used in filmmaking.\n“I want to learn it, I want to master it for myself, then use my own best judgment about how I apply it to my personal art,” Cameron continued to Screen Daily. “It takes me four years to make an Avatar movie, so I think about how great it would be if I could do it in three years or two years.”\n“Movies are very, very expensive now, and it seems to me that the cinema is becoming less important to the world at large, which is horrifying as well after spending 42 years making movies to be seen in movie theaters,” he concluded. “We’re not seeing as many movies getting greenlit and getting made of the type that I love—the fantasy, the phantasmagorical, science fiction, big, visually opulent films.”\nBut while Cameron is open to seeing how the technology could aid filmmakers at some point, right now, it’s seemingly clear to him the current state of generative AI has no place in his creative process—it was reported earlier this year that Cameron claimed Avatar: Fire and Ash, due out later this year, will open with a title card informing the audience that no generative AI was used in the process of its creation.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650",
      "text": "Trying to keep track of what’s coming in the realm of Star Trek feels like trying to stop a tribble from procreating. Before even more new series are announced, here’s our guide of when to expect all the new Star Trek shows, as well as returning familiar favorites, and what else is in the works right now. Engage!\nThis post was last updated 7/14/23.\nCurrently Airing: Star Trek: Strange New Worlds Season 2\nThe Enterprise is back after a successful first season, and this time Captain Kirk will be along for the ride with another appearance by Paul Wesley after his surprise finale role in season one. Not much else is known about the season so far, other than one episode will see the show crossover with Star Trek: Lower Decks in a live-action/animated hybrid directed by The Next Generation’s Jonathan Frakes. The show has also been renewed for a third season.\nSeason two recaps:\n“Tomorrow and Tomorrow and Tomorrow”\n“Charades”\nUpcoming: Star Trek: Lower Decks Season 4\nThe third season of the animated series following the misfit crew of the USS Cerritos—and in particular its cadre of ensigns, Mariner (Tawny Newsome), Boimler (Jack Quaid), Tendi (Noël Wells), and Rutherford (Eugene Cordero)—once again followed our heroic ensigns and the remaining bridge officers aboard the Cerritos. Season four will be arriving in late summer. The show has also been renewed for a fifth season.\nUpcoming: Star Trek: Discovery Season 5\nExpected in early 2024, Discovery’s fifth season will be 10 episodes long, down from the 13 of prior seasons. In the wake of season four‘s climax earlier this year, Michael Burnham (Sonequa Martin-Green) led her crew in a desperate attempt to save the galaxy from a mysterious anomaly created by an extra-galactic race, ensuring peace and stability for the Federation once more… for now. As her romantic partner Book (David Ajala) pays time for his own role in a campaign to surreptitiously destroy that anomaly, we’re not sure what awaits Burnham and Discovery’s crew just yet, but given this show, we’re sure it’ll be very, very dramatic.\nIn Flux: Star Trek: Prodigy Season 2\nThe animated series aimed at younger Trek fans (and Janeway fans!) and kids at heart can be found on both Nickelodeon and Paramount+. The first season was divided into two parts, with part two wrapping up at the end of 2022; after Paramount+ announced it would not move forward with the show’s already greenlit season two, it was removed from the service. (A home release of the complete first season is still possible; the first 10 episodes are still available for purchase.) Fans are still waiting to hear if Prodigy season two will surface on a different outlet.\nUpcoming: Starfleet Academy\nIt’s really happening! After a long tease, filming on this series will begin in 2024. Here’s the official announcement from co-showrunners and executive producers Alex Kurtzman and Noga Landau:\n“Admission is now open to Starfleet Academy! Explore the galaxy! Captain your destiny! For the first time in over a century, our campus will be re-opened to admit individuals a minimum of 16 Earth years (or species equivalent) who dream of exceeding their physical, mental and spiritual limits, who value friendship, camaraderie, honor and devotion to a cause greater than themselves. The coursework will be rigorous, the instructors among the brightest lights in their respective fields, and those accepted will live and study side-by-side with the most diverse population of students ever admitted. Today we encourage all who share our dreams, goals and values to join a new generation of visionary cadets as they take their first steps toward creating a bright future for us all. Apply today! Ex Astris, Scientia!”\nUpcoming (movie): Star Trek: Section 31\nAnnounced as a TV series back in 2019 as a spinoff for fan-favorite Discovery guest star Michelle Yeoh, this plunge into the seediest side of Starfleet—the shadowy spy organization Section 31 first introduced in Deep Space Nine—is now planned as a Paramount+ film.\nNewly minted Oscar winner Yeoh will return as former emperor of the Mirror Universe’s Terran Empire, Phillipa Georgiou, now turned into a kinder, but still kickass person by her time with Michael Burnham. “I’m beyond thrilled to return to my Star Trek family and to the role I’ve loved for so long,” Yeoh said in a statement. “Section 31 has been near and dear to my heart since I began the journey of playing Philippa all the way back when this new golden age of Star Trek launched. To see her finally get her moment is a dream come true in a year that’s shown me the incredible power of never giving up on your dreams. We can’t wait to share what’s in store for you, and until then: live long and prosper (unless Emperor Georgiou decrees otherwise)!”\nWritten by Craig Sweeny and directed by Olatunde Osunsanmi, Star Trek: Section 31 will start production later this year, and eventually come to Paramount+.\nWhere Can I Stream Classic Star Trek Shows?\nThat’s all the new bits of Star Trek coming. But what about the old Star Trek? In the U.S. at least, the vast majority of classic Star Trek shows are available exclusively to stream on Paramount+ (albeit not without issues), although some holdouts remain on other streaming services. Here’s a full list of classic Star Trek shows and where to stream them, as well as links to our recommended episode guides for every series!\nStar Trek: The Original Series (Paramount+)\nStar Trek: The Animated Series (Paramount+)\nStar Trek: The Next Generation (Paramount+, Netflix)\nStar Trek: Deep Space Nine (Paramount+, Netflix)\nStar Trek: Voyager (Paramount+)\nStar Trek: Enterprise (Paramount+)\nWant more io9 news? Check out when to expect the latest Marvel and Star Wars releases, what’s next for the DC Universe on film and TV, and everything you need to know about House of the Dragon and Lord of the Rings: The Rings of Power."
    }
  ],
  "argos_summary": "Tony Gilroy, the creator of the critically acclaimed Star Wars series Andor, has expressed disappointment over the decision to withhold the scripts for the show to prevent them from being used in generative AI models. However, there is a glimmer of hope as a post-final production script for season 2, episode 9 has been released as part of Disney's Emmy campaign. The article highlights the show's significant Emmy nominations and the impact of its storytelling, particularly focusing on character arcs and political themes, as it approaches the events leading to Rogue One.",
  "argos_id": "9WLG9EVT4"
}