{
  "url": "https://www.foxnews.com/entertainment/halle-berry-turns-heads-birthday-bikini-photos-from-vacation",
  "authorsByline": "Lori Bashian",
  "articleId": "03505c1f8176467b98a5a573c6dfb485",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/halle-berry-cannes-twead.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:48:58-04:00",
  "addDate": "2025-08-14T23:53:18.742913+00:00",
  "refreshDate": "2025-08-14T23:53:18.742915+00:00",
  "score": 1.0,
  "title": "Halle Berry turns heads with birthday bikini photos from vacation",
  "description": "Halle Berry celebrated her 59th birthday in paradise with boyfriend Van Hunt, posting a series of photos of herself in bikinis on Instagram.",
  "content": "Halle Berry is sharing snapshots from her family vacation in paradise.\n\nThe actress celebrated her 59th birthday by sharing a number of photos from her beach vacation, which included pictures of her in different Monday Swimwear bikinis.\n\nIn one of the photos, Berry laughs at the camera while dressed in a gold bikini, which she paired with a silk headscarf and white sunglasses. In another, she throws her head back with laughter while dressed in the same gold bikini, this time pairing it with a long-sleeve cropped cover-up and a tropical drink in a coconut.\n\nOther photos show her from behind as she looks out at the ocean while sitting on the trampoline attached to her boat anchored while out at sea.\n\nHALLE BERRY CHANNELS INNER BOND GIRL IN BIKINI PHOTOS FROM LAKE POWELL VACATION\n\n\"Phew…! cooking, cleaning and mothering,\" she captioned the post, seemingly referencing recent comments made by her ex-husband, David Justice, during his Aug. 7 appearance on Matt Barnes’ \"All the Smoke\" podcast.\n\nOn the podcast, Justice explained that his understanding of relationships \"wasn't vast,\" and he believed at the time that a wife \"should cook, clean, [and be] traditional, you know?\n\n\"Then, I’m thinking, ‘OK, if we have kids, is this the woman I want to have kids with and build a family with?’\" he explained. \"At that time, as a young guy — she don’t cook, don’t clean, don’t really seem, like, motherly, and then we start having issues.\"\n\nFans of the actress flooded the comments section with birthday messages, including some famous faces. Actress Julianne Moore wrote, \"Happy birthday beautiful,\" while Jurnee Smollett wrote, \"Happy birthday to our Queen!!!!! Love you so.\"\n\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\n\nOthers were tickled by Berry's caption, with one fan writing, \"that’s awesome your [sic] having a lot of fun being a mother and a cook,\" and another adding, \"Your the best at being a mother Halle.\"\n\nA third chimed in with, \"Great clap back!\" while another added, \"AMAZING CAPTION.\"\n\nOne of the photos in her birthday post featured her relaxing in a bed while in a white bikini with boyfriend Van Hunt, who she has been with since 2020.\n\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"The minute I started to feel like I understood myself and what I had been doing wrong, Van’s brother, who I had known for many years, came to me and said, ‘You should meet my brother,'\" she told Marie Claire in September 2024. \"The nature of the way this happened, I have a real belief that this is it. This is my person.\"",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/category/entertainment/events/divorce",
    "https://www.foxnews.com/entertainment/halle-berry-channels-inner-bond-girl-bikini-photos-from-lake-powell-vacation",
    "https://www.foxnews.com/entertainment",
    "https://www.foxnews.com/video/6356173632112",
    "https://www.foxnews.com/entertainment/halle-berry-stuns-swimsuit-photos-while-desert-vacation",
    "https://www.foxnews.com/entertainment/julianne-moore-told-look-prettier-sometimes-wishes-tanned-blonde",
    "https://www.foxnews.com/entertainment/halle-berry-vant-hunt-dating",
    "https://www.foxnews.com/newsletters",
    "https://www.foxnews.com/apps-products"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "birthday bikini photos",
      "weight": 0.105422586
    },
    {
      "name": "Happy birthday",
      "weight": 0.08078869
    },
    {
      "name": "birthday messages",
      "weight": 0.07730164
    },
    {
      "name": "BIKINI PHOTOS",
      "weight": 0.0742417
    },
    {
      "name": "Other photos",
      "weight": 0.070847765
    },
    {
      "name": "different Monday Swimwear bikinis",
      "weight": 0.07033793
    },
    {
      "name": "photos",
      "weight": 0.069836795
    },
    {
      "name": "Halle Berry",
      "weight": 0.064985074
    },
    {
      "name": "LAKE POWELL VACATION",
      "weight": 0.06062689
    },
    {
      "name": "boyfriend Van Hunt",
      "weight": 0.05981927
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.986328125
    },
    {
      "name": "/Arts & Entertainment/Online Media/Online Image Galleries",
      "score": 0.869140625
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.7060546875
    },
    {
      "name": "/Hobbies & Leisure/Special Occasions/Holidays & Seasonal Events",
      "score": 0.54296875
    },
    {
      "name": "/Arts & Entertainment/Movies/Other",
      "score": 0.302734375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.3017578125
    }
  ],
  "sentiment": {
    "positive": 0.24228303,
    "negative": 0.3071262,
    "neutral": 0.45059073
  },
  "summary": "Halle Berry celebrated her 59th birthday with a series of photos from her family vacation in paradise. The photos, which included her in different Monday Swimwear bikinis, were shared alongside comments by her ex-husband, David Justice, during an appearance on Matt Barnes’ \"All the Smoke\" podcast. The comments were shared by fans, including famous faces such as Julianne Moore, Jurnee Smollett, and others. One of the photos featured her relaxing in a bed while in a white bikini with boyfriend Van Hunt.",
  "shortSummary": "Halle Berry celebrated her 59th birthday with photos in multiple bikinis from her family vacation in Hawaii, contrasting with her ex-husband's criticism of her cooking and mothering.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e9cf68551d7644eb82eb5e5de2d685dc",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/entertainment/julianne-moore-told-look-prettier-sometimes-wishes-tanned-blonde",
      "text": "At 62 years old, Julianne Moore is an accomplished Academy Award-winning actress. She's a mother, an advocate, and someone who has been subjected to scrutiny due to her appearance.\n\"Someone in the film industry said to me, ‘You should try to look prettier,'\" she admitted in an interview with The Times.\n\"I was like, ‘I don’t know if I can.' Obviously, ours is a business where there is some physicality involved, but beauty and prettiness are subjective,\" she added.\nIn addition, Moore admitted her radiant red locks made her feel insecure.\nJULIANNE MOORE REVEALS DIRECTOR FIRED HER FROM ROLE THAT EVENTUALLY WENT TO MELISSA MCCARTHY\n\"My red hair made me feel like an outsider growing up. Redheads are 2% of the global population. Nobody wants to feel like they’re in the minority, particularly as a young child,\" she shared with the British newspaper.\n\"Now I feel very identified with my hair and freckles, but there’s still a part of me that would rather be a tanned blonde,\" she added.\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\nBecause of her fair complexion, Moore explains that she has trouble being in the sun.\n\"I can’t be in the sun for half an hour without burning. I look just like my mother and she said to me, ‘Stay out of the sun,’\" she said.\nBut she explained her late mother's advice has actually helped her keep her skin looking youthful. \"Because I’m so fair and have freckles, I have always had to wear a hat and sunscreen. That has made the biggest difference to me in terms of maintaining my skin. But people do not want to hear that,\" she noted.\nCLICK HERE TO GET THE FOX NEWS APP\nMoore also talked about how she stays healthy. \"I don’t like weights and I don’t do well in gyms. But for me, yoga works as a mind-body exercise. That effort of concentration clears my mind. When I’m done with the class, I feel calmer.\""
    },
    {
      "url": "https://www.foxnews.com/entertainment/halle-berry-channels-inner-bond-girl-bikini-photos-from-lake-powell-vacation",
      "text": "Halle Berry is turning back the clock.\nThe 58-year-old actress shared a series of photos from her vacation to Lake Powell, one of which shows her walking towards the camera in a strapless black and white bikini, with the lake's rock formations behind her.\nShe accessorized the swimsuit with a colorful bandanna around her head and a long gold necklace.\n\"Then we found this slice of heaven!\" she captioned the post, adding, \"Swipe to end for a little surprise message…\"\nCANDACE CAMERON BURE SIZZLES IN STRING BIKINI WHILE ON TROPICAL GETAWAY WITH HUSBAND\nThe carousel of photos also featured photos of the actress in a blue shirt and sunglasses taking a selfie as the boat made its way through the rock canyons, two pairs of feet lounging on the boat and the beautiful views on the lake.\nHer \"surprise message\" came in the last slide, which featured a video of Berry yelling out \"I love you,\" with her voice echoing back to her through the canyon walls.\nFans in the comments section could not help but compare the first photo to the iconic scene of Berry from the 2002 James Bond movie, \"Die Another Day.\" In the scene, Berry can be seen coming out of the ocean in a bright orange bikini.\n\"That doesn't make any d*mn sense for Ms. Berry to still have that ‘Die Another Day’ body after it's been 20+ years since she appeared in that movie,\" one fan wrote.\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\nOthers responded to her message in the last slide, writing, \"Love you right back, sis! Here’s a rose just for you,\" and \"WE LOVE YOU TOOOO!!!!\"\nIn a November 2021 interview with Vogue, Berry reflected on the lengthy process of choosing the iconic orange bikini for the film, explaining she tried \"so many bikinis and so many belts\" before landing on what was seen in the film.\n\"We had a knowing that it would maybe, because it was in a Bond movie, become an iconic situation … something that would live a very, very long time,\" she said. \"The biggest acting challenge I had was to make it look like the water was warm and I was having a grand old time when I was freezing my butt off.\"\nBerry has not been shy about sharing swimsuit photos, having recently posted a series of pictures of her in a black and white one-piece swimsuit while vacationing in Joshua Tree, California.\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER"
    },
    {
      "url": "https://www.foxnews.com/entertainment/halle-berry-stuns-swimsuit-photos-while-desert-vacation",
      "text": "Halle Berry is enjoying some fun in the sun.\nThe 58-year-old \"Monster's Ball\" actress posted a series of swimsuit photos from her desert oasis while on vacation in Joshua Tree, Calif. The photos feature Berry in a black and white one-piece swimsuit by Monday Swimwear, with a cutout on the lower back.\n\"Desert days 🌵 windows down, music up, nowhere to be but here,\" she captioned the post.\nIn a few of the photos, Berry can be seen standing outside in front of a large glass window as she smiled at the camera, and others showed her giving the camera playful sultry looks as she played around with poses incorporating her large black sunhat.\nHEATHER GRAHAM FLAUNTS AGELESS FIGURE IN STUNNING BIKINI COLLECTION DURING ITALIAN VACATION\nMost of the photos were taken from the waist up, but the actress also included two full-body selfies, which not only showed off her toned body, but also the stunning rocky landscape surrounding her.\nFans in the comments section were quick to comment with heart and fire emojis, while others commented on her beauty.\n\"Summer looks amazing on you queen @halleberry cheers!\" one fan wrote, while another added, \"Always stunning!\" A third follower chimed in with, \"Most beautiful woman in the world 😍.\"\n\"Desert days 🌵 windows down, music up, nowhere to be but here.\"\nThis isn't the first time Berry has showcased her toned body on Instagram. In honor of the 20th anniversary of her iconic movie, \"Catwoman,\" last year, the actress posted topless photos of herself on Instagram, in which she is holding her two kittens in strategic positions to cover her chest while wearing a black mask to pay homage to the character.\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\n\"And STILL... meow! It’s been 20 years today since I had the honor of bringing this iconic character to life,\" Berry captioned the post. \"She will always be close to my heart and I will forever be Patience Phillips aka CATWOMAN!\"\nThe actress first broke out onto the scene following her role in the 1992 movie, \"Boomerang,\" which led to an Emmy win in 2000 for \"Introducing Dorothy Dandridge,\" and an Academy Award win for \"Monster's Ball,\" in 2002.\nIn addition to \"Catwoman,\" Berry has starred in a number of action movies, including \"Die Another Day,\" the \"X-Men\" trilogy, \"John Wick: Chapter 3 - Parabellum,\" \"The Union\" and many others.\nIn August 2024, Berry said in a Netflix video on Instagram, she has been injured many times while making these films.\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\"I’ve been knocked out three times, got an arm broken, broke ribs twice… two ribs one time, three ribs another time… broke a tail bone, broke two toes and a finger. This finger,\" she said as she held up her middle finger."
    },
    {
      "url": "https://www.foxnews.com/category/entertainment/events/divorce",
      "text": "Joe Biden 56 mins ago Ashley Biden deletes social media post attacking soon-to-be-ex-husband amid divorce filing: reports Joe Biden's youngest daughter shared and deleted a cryptic post aimed at her soon-to-be-ex husband on Sunday amid a divorce filing, reports claim.\nCelebrity Divorces 2 days ago Ashley Biden files for divorce from husband, Howard Krein, after 13 years of marriage: reports Former President Joe Biden's daughter Ashley Biden files for divorce from her husband, plastic surgeon Howard Krein, whom she married in 2012.\nJennifer Aniston 3 days ago Jennifer Aniston calls Brad Pitt split ‘juicy reading’ during painful tabloid storm Jennifer Aniston opened up about the \"vulnerable time\" following her divorce from ex-husband Brad Pitt. At the time, Pitt moved on quickly with now ex-wife Angelina Jolie.\nCelebrity Marriages 3 days ago Billy Joel’s ex-wife defends singer against ‘homewrecker’ claims, says first marriage was already 'wrecked' Billy Joel's former wife Elizabeth Weber says the Piano Man wasn't a homewrecker, since her marriage to his bandmate Jon Small already had issues. Joel and Weber were married from 1973 to 1982.\nDenise Richards August 5 Denise Richards shows up at ex's home after he allegedly 'put down' her dog without permission: report \"Real Housewives\" star Denise Richards allegedly showed up unannounced to her estranged husband's home Sunday amid their tumultuous divorce.\nJessica Simpson August 2 Jessica Simpson suggests ‘mistakes’ were made by estranged husband in candid comments about divorce Jessica Simpson opens up about her unexpected divorce from Eric Johnson after nearly a decade, explaining how she chooses love over resentment to heal from heartbreak.\nReality July 27 'Real Housewives' star Kim Zolciak rebuilds life as estranged husband takes surprising career turn \"Real Housewives of Atlanta\" star Kim Zolciak and former NFL player Kroy Biermann are moving forward with their lives amid a messy divorce that began in 2023 after nearly 12 years of marriage.\nEntertainment July 26 Christie Brinkley reveals Billy Joel’s three final words to her before she left him Billy Joel and Christie Brinkley explain how their marriage deteriorated despite wanting it to work, citing his consuming work schedule and her growing loneliness.\nEntertainment July 25 Zac Brown reveals engagement to famous jewelry designer as legal battle with ex-wife unfolds Country star Zac Brown and jewelry designer Kendra Scott announced their engagement, sharing they are 'happy and grateful' to have found each other after Brown's divorce from Kelly Yazdi.\nBooks July 21 Clint Eastwood struggled with monogamy in Hollywood, viewed marriage as ‘form of confinement’: author New biography by Shawn Levy examines Hollywood star Clint Eastwood's unconventional approach to marriage, revealing periods of commitment and infidelity in his life.\nChristie Brinkley July 20 Christie Brinkley recounts the devastating personal moment that ‘nearly broke her’ At 71, Christie Brinkley opens up in Social Life Magazine about the painful memories in her memoir \"Uptown Girl,\" including the public revelation of her husband's affair.\nEntertainment July 17 Denise Richards accuses estranged husband of abuse and death threats in restraining order filing Denise Richards obtains temporary restraining order against Aaron Phypers, citing allegations of violent choking and death threats throughout their marriage.\nThe Real Housewives July 10 'Real Housewives' star Erika Jayne moves on with US Army vet ‘Sheriff of Baghdad' while divorcing Tom Girardi Erika Jayne moves on with military veteran John McPhee, known as \"The Sheriff of Baghdad,\" while her divorce from Tom Girardi faces delays after four years.\nTV July 9 Gary Coleman's ex knows more about his death 'than she's telling': former FBI agent Polygraph examiner George Olivo states that Gary Coleman's ex-wife Shannon Price knows why she did poorly on \"Lie Detector: Truth or Deception\" when asked about the late star's 2010 fall.\nNBA July 8 Dwight Howard's wife files for divorce just six months after marriage: report Former NBA star Dwight Howard's wife, Amber Rose Howard, has filed for divorce in Georgia after six months of marriage, reportedly requesting alimony and equal division of marital assets and property.\nDenise Richards July 8 Denise Richards makes $250K a month, but drops over $100K on luxury lifestyle: divorce docs According to the petition obtained by Fox News Digital, Denise Richards, 54, earns more than $250,000 per month from various TV appearances, brand deals and OnlyFans activity.\nEntertainment July 7 Denise Richards' husband files for divorce, months after she revealed he helps run her OnlyFans account Denise Richards' husband Aaron Phypers files for divorce after six years, citing irreconcilable differences and seeking spousal support from the actress.\nCelebrity Divorces June 24 Hugh Jackman, Deborra-Lee Furness finalize divorce after 27 years of marriage Hugh Jackman's 27-year marriage to Deborra-Lee Furness is officially over. Furness previously spoke out about the \"traumatic journey of betrayal\" in their relationship.\nBrad Pitt June 24 Brad Pitt confesses he 'needed rebooting' after sobering incident that led to Angelina Jolie divorce Brad Pitt opens up about his journey to sobriety through Alcoholics Anonymous following his 2016 divorce from Angelina Jolie, sharing that he was \"on my knees\" before seeking help.\nBooks June 18 Johnny Depp, Amber Heard’s inner circle saw ‘red flags’ in doomed relationship: book Authors Kelly Loudenberg and Makiko Wholey have written a new book, \"Hollywood Vampires: Johnny Depp, Amber Heard, and the Celebrity Exploitation Machine.\"\nEntertainment June 14 'Party of Five' star Scott Wolf's estranged wife taken to hospital by police, accuses actor of abuse in video \"Party of Five\" star Scott Wolf's estranged wife, Kelley Wolf, was taken to hospital by police after announcing their divorce, claiming Scott had been \"abusing\" her in an Instagram video.\nOlympics June 4 Ryan Lochte and his wife announce divorce after 7 years of marriage Six-time Olympic gold medalist Ryan Lochte and his wife, former Playboy model Kayla Rae Reid, announced on Instagram that their marriage is ending.\nCelebrity Divorces June 2 Hugh Jackman’s rumored flame Sutton Foster stays silent after his ex's statement about 'betrayal' Sutton Foster, a Broadway actress who previously starred in the sitcom \"Younger,\" appeared on the red carpet solo for the 69th Annual Drama Desk Awards in New York City.\nCelebrity Divorces June 1 Hugh Jackman's friend says actor is 'moving on with his life' after Deborra-Lee Furness' 'betrayal' statement Hugh Jackman's friend Gus Warland shared insights on Jackman's emotional state amid his divorce from Deborra-Lee Furness and her statement on \"betrayal.\"\nEntertainment May 28 Hugh Jackman's ex speaks out on 'traumatic journey of betrayal' as she files for divorce Hugh Jackman's ex Deborra-Lee Furness officially files for divorce in New York after 27 years of marriage. She also spoke out about \"betrayal.\"\nCelebrity Divorces May 6 Kelsea Ballerini says divorce should not be ‘glamorized’ 3 years after her marriage ended Kelsea Ballerini says she doesn't want to glamorize or celebrate divorce after releasing \"Rolling Up The Welcome Mat\" in 2023. The \"Patterns\" singer wrote the album about her ex.\nQuizzes April 27 American Culture Quiz: Test yourself on equestrian events, flag facts and famous food The American Culture Quiz is a weekly test of our unique national traits, trends, history and people. This time, test your knowledge of equestrian events, flag facts and famous food.\nCelebrity Divorces March 31 Hulk Hogan breaks out the popcorn as ex-wife, daughter feud in nasty online battle Hulk Hogan and his wife, Sky Daily, appeared to react to his daughter and ex-wife sharing alleged family drama online. Brooke Hogan previously explained why she cut off contact with her parents.\nCelebrity Divorces March 28 Christina Haack accuses estranged husband of 'intimidation' after allegedly spotting him in her neighborhood Christina Haack claimed she has spotted ex Josh Hall wandering around her Newport Beach, California, neighborhood, even though he lives in Tennessee amid their split.\nCelebrity Divorces March 28 Hulk Hogan's daughter cut off contact with parents due to alleged 'vicious pattern' of behavior Hulk Hogan and Linda Hogan's daughter revealed the reason she doesn't speak to either parent, in a lengthy statement shared on Thursday. Linda and Hogan divorced in 2009."
    },
    {
      "url": "https://www.foxnews.com/entertainment/halle-berry-vant-hunt-dating",
      "text": "Halle Berry seemingly confirmed she has a new man in her life.\nThe actress, who is 54, shared a photo on Instagram on Thursday sporting a wide smile while wearing a black T-shirt with singer Van Hunt's name on it.\nShe tagged the musician in the photo, writing, “now ya know... ♥️🦶🏽.”\nThe foot emoji appeared to be a nod to a photo she posted back in July where her feet were entangled with an unnamed man.\nHALLE BERRY ON WHY HER HISTORIC OSCAR WIN IS ALSO AMONG HER 'BIGGEST HEARTBREAKS'\n“Sunday, funday❤️,” Berry captioned the pic.\nShe posted a similar picture in August in honor of her birthday.\nHALLE BERRY SHARES TOPLESS PHOTO AND PROCLAIMS: ‘SELF-LOVE IS NEVER SELFISH'\nHunt, 50, appeared to confirm their relationship by reposting Berry's picture wearing his T-shirt.\n“there you go…” he captioned the photo.\nThe “Seconds of Pleasure” singer previously posted photos of a woman kissing his cheek, but it was unclear who the mystery woman was.\nHALLE BERRY FILES TO REPRESENT HERSELF IN DIVORCE WITH OLIVIER MARTINEZ: REPORT\nBoth Berry and the Grammy winner liked comments in support of their relationship and responded to some fans with heart emojis.\nIn April, the “Catwoman” actress declared n an Instagram Live conversation with Lena Waithe that she might “stay” single.\n\"I’m very much a relationship-oriented person, I always want to be with someone,\" Berry confessed (via People). \"But I decided, no I’m going to slow my roll, I’m going to take a minute and I’m going to spent time with me.\"\nHALLE BERRY STUNS IN PHOTO CELEBRATING HER 54TH BIRTHDAY\nBerry added: \"And it’s been so great that I think I might stay like this.”\nThe star told Waithe, 36, that she originally planned on taking \"one full year\" to be single.\n\"One year led to two years, and two years is now leading to three years,” Berry said. \"But I’m fine because I think the next relationship I have I think I will have a better chance of attracting and choosing what’s right for me because I’ve taken this time to think about what’s important to me.\"\nHALLE BERRY ON BEING SINGLE: 'I MIGHT STAY LIKE THIS'\nAt the time, Berry said she didn't \"feel the need for a relationship\" and had no plans \"to rush or accept something that’s not totally right for\" herself.\nCLICK HERE TO GET THE FOX NEWS APP\nThe actress has been married three times: first to baseball player David Justice, then to singer-actor Eric Benét, and finally French actor Olivier Martinez, with whom she shares her 6-year-old son Maceo.\nBerry also shares 12-year-old daughter Nahla Ariela with her ex Gabriel Aubry.\nFox News’ Nate Day contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/apps-products",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    }
  ],
  "argos_summary": "Halle Berry celebrated her 59th birthday with a beach vacation, sharing photos in various bikinis, including a gold one, while enjoying time with her boyfriend, Van Hunt. In her post, she humorously referenced traditional gender roles in relationships, responding to comments made by her ex-husband, David Justice. Fans flooded her comments with birthday wishes and compliments, highlighting her beauty and fun spirit.",
  "argos_id": "AFHI9W140"
}