{
  "url": "https://nypost.com/2025/08/14/us-news/feds-seeking-death-penalty-for-trans-zizian-cult-member-who-murdered-vermont-border-patrol-agent/",
  "authorsByline": "Associated Press",
  "articleId": "31792225b1854840b9855eb81110d214",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/109596463.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:54:41+00:00",
  "addDate": "2025-08-14T19:56:58.317313+00:00",
  "refreshDate": "2025-08-14T19:56:58.317315+00:00",
  "score": 1.0,
  "title": "Feds seeking death penalty for Trans Zizian cult member who murdered Vermont border patrol agent",
  "description": "Teresa Youngblut, 21, of Washington state, is among a group of radical computer scientists focused on veganism, gender identity and artificial intelligence who have been linked to six killings in t…",
  "content": "The Justice Department said Thursday it will seek the death penalty against a member of the cultlike Zizians group accused of killing a U.S. Border Patrol agent in Vermont in the latest Trump administration push for more federal executions.\n\nTeresa Youngblut, 21, of Washington state, is among a group of radical computer scientists focused on veganism, gender identity and artificial intelligence who have been linked to six killings in three states. She’s accused of fatally shooting agent David Maland on Jan. 20, the same day President Donald Trump was inaugurated and signed a sweeping executive order lifting the moratorium on federal executions.\n\nYoungblut initially was charged with using a deadly weapon against law enforcement and discharging a firearm during an assault with a deadly weapon. But the Trump administration signaled early on that more serious charges were coming, and a new indictment released Thursday charged her with murder of a federal law enforcement agent and other crimes.\n\nIn February, Attorney General Pam Bondi mentioned Maland as an example when saying she expects federal prosecutors to seek the death penalty in cases involving the murder of law enforcement officers. And Youngblut’s attorneys recently said they had been given a July 28 deadline to offer preliminary evidence about why she should be spared such a punishment. They asked a judge last month to delay that deadline until January, but the judge declined.\n\nAt the time of the shooting, authorities had been watching Youngblut and her companion, Felix Bauckholt, for several days after a Vermont hotel employee reported seeing them carrying guns and wearing black tactical gear. She’s accused of opening fire on border agents who pulled the car over on Interstate 91. An agent fired back, killing Bauckholt and wounding Youngblut.\n\nThe pair were among the followers of Jack LaSota, a transgender woman also known as Ziz whose online writing attracted young, highly intelligent computer scientists who shared anarchist beliefs.\n\nMembers of the group have been tied to the death of one of their own during an attack on a California landlord in 2022, the landlord’s subsequent killing earlier this year, and the deaths of one of the members’ parents in Pennsylvania.\n\nAuthorities are investigating the connection between murders across the country to the “Zizians” — a cult of highly-educated trans vegan “rationalists.” Jack “Ziz” LaSota has allegedly influenced his followers to kill. The transgender leader of the group, who has posted about “transhumanism” and other topics. Some followers say LaSota is dead, but that seems to be a plot to avoid authorities. LaSota used the name “Andrea Phelps.” Two Zizians who are accused of attacking Curtis Lind in Solano County, Calif., because they were squatting on his property. Lind, who lost an eye in the attack, shot and killed Borhanian, but was going to testify against Leatham and another accused assailant and “Ziz” follower, Suri Dao. Maximilian Bentley Snyder in Solano County Criminal Court for his arraignment on Jan. 28, 2025. Snyder has been arrested for killing 82-year-old Lind to prevent him from testifying at the trial. Lind was stabbed and had his throat slit on the street outside his home in Vallejo, Calif. on Jan. 17. Snyder was engaged to be married to Youngblut. Youngblut and Bauckholt were stopped by Border Patrol agent David Maland on Jan. 20 in northern Vermont. Youngblut allegedly shot at Maland, who was killed. Bauckholt was killed by return fire. Youngblut was arrested. Michelle Jacqueline Zajko is a person of interest in the deaths of her parents Rita and Richard Zajko. Authorities say the gun Youngblut used in the border patrol attack was bought by Michelle Jacqueline Zajko — the trans nonbinary adult child of Rita and Richard Zajko, who were found killed in mysterious and unsolved circumstances in Delaware County, Pa. in early 2023. Zajko, whose blog shows connections to the Ziz cult, has not been charged with a crime.\n\nLaSota and two others face weapons and drug charges in Maryland, where they were arrested in February, while LaSota faces additional federal charges of being an armed fugitive.\n\nAnother member of the group who is charged with killing the landlord in California had applied for a marriage license with Youngblut.\n\nMichelle Zajko, whose parents were killed in Pennsylvania, was arrested with LaSota in Maryland, and has been charged with providing weapons to Youngblut in Vermont.\n\nVermont abolished its state death penalty in 1972. The last person sentenced to death in the state on federal charges was Donald Fell, who was convicted in 2005 of abducting and killing a supermarket worker five years earlier.\n\nBut the conviction and sentence were later thrown out because of juror misconduct, and in 2018, he pleaded guilty and was sentenced to life in prison.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/14/us-news/wild-video-shows-dems-pick-for-sc-gov-race-being-arrested-in-his-underwear-while-calling-himself-god-and-superman/",
    "https://nypost.com/2025/08/14/us-news/ashley-biden-shared-photo-of-husband-howard-krein-with-girlfriend-before-divorce-filing/",
    "https://nypost.com/2025/08/14/us-news/dc-sandwich-slinger-idd-as-doj-trial-attorney-fired-from-position-after-hurling-sub-at-fed-agent/",
    "https://nypost.com/2025/02/18/us-news/as-zizian-cult-leader-is-arrested-heres-what-they-believe/",
    "https://nypost.com/2025/02/25/us-news/zizian-cult-defector-brett-danielson-not-dead-has-been-in-hiding/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Vermont border patrol agent",
      "weight": 0.07400868
    },
    {
      "name": "death penalty",
      "weight": 0.07029967
    },
    {
      "name": "federal charges",
      "weight": 0.06902275
    },
    {
      "name": "Border Patrol agent David Maland",
      "weight": 0.06897443
    },
    {
      "name": "agent David Maland",
      "weight": 0.06862853
    },
    {
      "name": "additional federal charges",
      "weight": 0.06736113
    },
    {
      "name": "border agents",
      "weight": 0.06485671
    },
    {
      "name": "Youngblut",
      "weight": 0.06359766
    },
    {
      "name": "Teresa Youngblut",
      "weight": 0.06295222
    },
    {
      "name": "Michelle Jacqueline Zajko",
      "weight": 0.060716547
    }
  ],
  "topics": [
    {
      "name": "Crime"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.92919921875
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.927734375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.91845703125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.91259765625
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.79833984375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.6474609375
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.595703125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Discrimination & Identity Relations",
      "score": 0.58056640625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.5263671875
    },
    {
      "name": "/News/Other",
      "score": 0.51416015625
    },
    {
      "name": "/People & Society/Other",
      "score": 0.446044921875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.443603515625
    }
  ],
  "sentiment": {
    "positive": 0.055482667,
    "negative": 0.7125179,
    "neutral": 0.2319994
  },
  "summary": "The Justice Department is planning to seek the death penalty against Teresa Youngblut, a member of the cultlike Zizians group accused of murdering a U.S. Border Patrol agent in Vermont. YoungblUT, a 21-year-old Washington state woman, is among a group of radical computer scientists focused on veganism, gender identity, and artificial intelligence linked to six killings in three states. She is accused of fatally shooting agent David Maland on the same day President Donald Trump was inaugurated and signed a sweeping executive order lifting the moratorium on federal executions. A new indictment has been filed charging her with murder of a federal law enforcement agent and other crimes. The group has also been linked to an attack on a California landlord in 2022 and the deaths of one of their members’ parents in Pennsylvania.",
  "shortSummary": "The Justice Department plans to seek the death penalty for Teresa Youngblut, a member of the Zizians cult, who killed a Vermont border patrol agent.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a815d1d7b0d84243a3e3b5804d84b381",
  "places": [
    {
      "osmId": "19687522",
      "road": "Interstate Corporate Center",
      "county": "Chittenden County",
      "state": "Vermont",
      "postcode": "05493",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 44.4484664,
        "lon": -73.1113155
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/14/us-news/wild-video-shows-dems-pick-for-sc-gov-race-being-arrested-in-his-underwear-while-calling-himself-god-and-superman/",
      "text": "Wild video shows Dems’ pick for SC gov’s race being arrested in his underwear — while calling himself God and Superman\nWild, newly released dashcam footage shows the Democrats’ choice to run for governor in South Carolina getting arrested recently in just his underwear — while swearing, using the n-word and referring to himself as both God and Superman.\nMarried father of four William “Mullins” McLeod, 53, is facing calls from his own party to step down from the gubernatorial race that he only formally entered Monday after video emerged a day later of his bizarre arrest just months earlier in May, according to WCBD.\nThe prominent attorney was stopped in downtown Charleston while “yelling at the top of his lungs” and wearing only underwear and shoes, according to a police report — which suggested he showed signs “typical of an individual under the influence of a stimulant narcotic.”\nThe Dem referred to his upcoming election race — even threatening to kick an opponent’s “f–king teeth in” — while refusing to tell cops his name, instead referring to himself as God and Superman, the hour-long video released through a Freedom of Information Act request shows.\n“It doesn’t matter, my friend, trust me,” he told one officer when asked his name. “I’m one of the most just humans to ever walk this soil,” he said.\n“Superman sounds good,” he added bizarrely.\nMcLeod also issued threats toward current and former Palmetto State politicians during the profanity-laden rant.\n“I’m gonna kick your f–king teeth in,” he says at one point, appearing to reference Republican Attorney General Alan Wilson, who announced his bid for governor earlier this summer.\nMcLeod — who is heard uttering the n-word at least twice in the video — also refuses to get out of the patrol car when it arrives at the jail, instead telling an officer he would sleep in the back seat.\n“No, I’m not doing it, no. I’m not getting out of this car. It’s time to go to bed,” he shouts at the officer, before being forcibly removed and booked into the jail shortly before 1 a.m., according to an arrest report retrieved by WCBD.\nMcLeod’s eyes were “extremely bloodshot and highly dilated … typical of an individual under the influence of a stimulant narcotic,” according to the report.\nIt wasn’t immediately clear whether McLeod — who ran unsuccessfully for governor in 2010 and served two terms as Charleston County Democratic Party chairman — was tested for drugs during his arrest.\nHe is facing misdemeanor charges for disorderly conduct.\nHis party leadership is calling on him to step down from the gubernatorial race, in which he is currently the party’s only candidate.\n“After reviewing the transcript of the dash cam footage from his recent arrest, it is clear that Mr. McLeod is navigating profound challenges and should focus on his mental and emotional well-being instead of a campaign for governor,” the chair of the South Carolina Democratic Party, Christale Spain, said in a statement Wednesday.\nEvery morning, the NY POSTcast offers a deep dive into the headlines with the Post’s signature mix of politics, business, pop culture, true crime and everything in between. Subscribe here!\n“We offer him compassion and pray he finds the support he needs.”\nMcLeod’s campaign team did not respond immediately to requests for comment, but he branded his arrest “unlawful” in a recent interview announcing his candidacy.\n“The only thing I’d ask the voters is to please give me a little bit of grace and know that long before we go to Election Day, they’ll know exactly what happened,” he told the Post and Courier.\n“And when they learn what happened around my unlawful arrest, it will be a reason why I absolutely need to be our state’s governor,” he said, adding that he had been exercising his “God-given, constitutional right to be in a public place” when he was arrested."
    },
    {
      "url": "https://nypost.com/2025/08/14/us-news/dc-sandwich-slinger-idd-as-doj-trial-attorney-fired-from-position-after-hurling-sub-at-fed-agent/",
      "text": "DC sandwich slinger ID’d as DOJ employee, fired from position after hurling sub at federal agent\nWASHINGTON — His career is toast.\nA DC dimwit who slung a Subway sandwich at a federal agent on the streets of the capital earlier this week has been identified as a now-former Justice Department worker.\nAttorney General Pam Bondi announced Thursday that Sean Charles Dunn, 37, who is facing a felony assault charge for the sandwich strike, has been fired from his DOJ role.\n“If you touch any law enforcement officer, we will come after you,” Bondi declared. “I just learned that this defendant worked at the Department of Justice — NO LONGER. Not only is he FIRED, he has been charged with a felony.”\n“This is an example of the Deep State we have been up against for seven months as we work to refocus DOJ,” she added. “You will NOT work in this administration while disrespecting our government and law enforcement.”\nDunn worked as an international affairs specialist in the Justice Department’s criminal division — which handles cases of fugitives abroad and helps foreign countries on extradition matters with their own fugitives, according to the DOJ.\nDunn appeared to have been similar to a paralegal — assisting attorneys in handling a “large volume of cases, including the litigation of those matters,” according to the DOJ’s job listing for the position.\nHe does not appear to be an attorney as his name isn’t listed on the DC bar’s website.\nAn attorney for the suspect did not immediately respond to requests for comment and attempts to contact Dunn directly were unsuccessful.\nDunn was allegedly caught on camera berating a group of federal officers as “fascists” before lobbing his deli sandwich and hitting a US Customs and Border Protection agent in the chest.\n“F— you! You f—ing fascists! Why are you here? I don’t want you in my city!” Dunn allegedly fumed within inches of an officer’s face, per a criminal complaint.\nAccording to the complaint, Dunn successfully attempted to flee on foot, telling a local cop while he was being processed: “I did it. I threw a sandwich.”\nFootage of the incident went viral against the backdrop of President Trump’s deployment of hundreds of federal law enforcement personnel to assist DC police in cracking down on crime.\nDunn faces one count of assaulting, resisting or impeding a federal officer and faces up to one year in prison if convicted.\n“The police are not out there to get pushed around or beat up,” DC US Attorney Jeanine Pirro declared in announcing the case against Dunn. “He thought it was funny. Well, he doesn’t think it’s funny today because we charged him with a felony: Assault on a police officer.”\n“So there, stick your Subway sandwich somewhere else!”\nOn Monday, Trump federalized the DC Metropolitan Police Department for 30 days and activated the National Guard to patrol the District’s streets.\nSince then, hundreds of federal officials have arrested more than 100 suspects, with 23 collared on Monday, 43 nabbed on Tuesday and 45 apprehended on Wednesday, according to data from the Trump administration.\nTrump’s crackdown comes after former Department of Government Efficiency (DOGE) employee Edward Coristine — aka “Big Balls” — was beaten up while intervening to prevent a carjacking last week."
    },
    {
      "url": "https://nypost.com/2025/02/18/us-news/as-zizian-cult-leader-is-arrested-heres-what-they-believe/",
      "text": "As Zizian ‘cult’ leader is arrested, here’s what the vegan transgender group believes — and other disturbing deaths members are linked to\nMysterious alleged Zizian cult leader Jack Lasota was arrested alongside an accomplice in Maryland on Monday.\nThe elusive head of the largely transgender, vegan group had gone as far as to apparently fake his own death in 2022 to avoid scrutiny. However, at the time of Lasota’s arrest he was wanted in both California and Pennsylvania.\nTaken into custody alongside Lasota were alleged followers Daniel Blank, 26, and Michelle Zajko, 32, a person of interest in the double murder of her parents – both fatally shot in their heads at their home on New Year’s Eve 2022.\nTheir deaths are two of four linked to the cult – which is based around LaSota, 34, who previously went by Ziz online – alongside an elderly landowner in California and a border patrol agent killed in a shootout with another member of the group in Vermont on Jan. 20.\nPolice say members of the Zizian group could number as high as 30 and they appear to be mainly young trans women who are math and computer whizzes, who previously worked at NASA, Google and on Wall Street.\nThey gather around Ziz, who was born male but now identifies as female and grew up in Alaska before moving to the Bay Area. There he gathered acolytes who believe in the same eccentric and arcane blend of Silicon Valley-driven Rationalist movement theories and animal rights.\nBoth investigators and people who know the Zizians told The Post many of them have been estranged from their parents, some are thought to be on the autism spectrum and that they are an anti-sex group who take hormones for their gender transitions.\nThe Zizians are involved in esoteric practices like “unihemispheric sleep”— a practice not dissimilar to hypnosis where adherents are told to sleep with one eye open in a state of chronic exhaustion.\nThe practice is meant to prove the two hemispheres of the brain are distinct identities, with one side thought to be female and one male, one side thought to be good and the other evil. They two sides “often desire to kill each other,” according to Lasota’s blog.\n“They talk as if they really believe they have supernatural powers and they believe movies like ‘The Matrix’ are real and they can manipulate reality,” an investigator familiar with the Zizians told The Post.\n“They talk about the Nazis and the Holocaust a lot. They’ve made it very difficult and confusing to catch them. They all have so many aliases and move around a lot. We think a lot of what’s happened can be traced back to Ziz.”\nBecause many of the group use numerous different names and a variety of pronouns and have been linked to California, Vermont, North Carolina and Pennsylvania, it makes them more difficult to track according to police sources.\nJessica Taylor, 32, of Berkeley, Calif., first became friendly with at least four Zizians beginning around 2015 when she met them at the Center for Applied Rationality, an organization in the city which hosts\nworkshops on cognitive science and “de-biasing” with a mission to “develop clear thinking for the sake of humanity’s future,” according to its website.\nShe said Ziz appeared normal at first and they had discussions about “self”. But by 2019, Taylor said Ziz had started to strike her as “creepy” – especially when he gave a “strange description” of the suicide of a mutual connection, which seemed to link to the group’s theory on brain function.\n“Ziz’s belief was this person had two brain hemispheres, one good – another one non-good, like selfish… [and that led to a] commitment to kill the self.\n“And I already knew two of about six or seven people in his group had committed suicide by this stage – which is a lot for a small group. It was strange. They had a high death rate.”\nTwo people in the group’s orbit who took their own lives were named Maia Pasek, who left a quasi-suicide note in 2018 referencing rational thought processes, and Jay Winterford — also known as Jacob Pekarek — a math and science graduate in 2021.\nSince then the death toll has risen dramatically, including four civilians.\nNine years ago, due to the high cost of living in the San Francisco area, Lasota and other Zizians lived aboard an old half-sunken tugboat in Pillar Point Harbor near Half Moon Bay.\nThere they befriended Curtis Lind, a boat enthusiast described by one friend as an “old, friendly hippie.”\nAround 2020 he invited the group to live in campers and box trucks on his modest property in nearby Vallejo which he had envisioned as a sort of artists’ colony, a close friend of Lind told The Post.\nLind didn’t charge the group rent during the worst of the pandemic but when it was over he requested some payment – but the Zizians refused to pony up.\n“Curt was just a great guy,” his friend and neighbor of 25 years, John Jenkins, 66, told The Post.\n“He was cool with [the Zizians]. They obviously were a little different but he was very open-minded.”\nBy “different,” Jenkins said he meant the group appeared to be mostly men when they arrived to camp on Lind’s land — but then he noticed mail was coming for them with both male and female names.\n“Then we’d see one walk down the street with his shirt off and we’d see boobies,” Jenkins said. “It was a little confusing. But Curt just told us they were transgender.”\nJenkins was on the property when Lind was allegedly violently ambushed by a group of Zizians in Nov. 2022.\nJenkins said Lind was carrying his pistol at the time because group members had been throwing rocks at his house. They allegedly stabbed him 57 times, taking out his eye and thrusting a sword through his back.\nLind fired back at his attackers, killing Amir “Emma” Borhanian and injuring another Zizian. He then limped over to his close friend, Pat McMillan’s, trailer.\n“His eyeball was hanging off his face and the sword was still impaled in his back when he got to Pat’s,” Jenkins said.\nLind survived that first attack and went on to live a relatively normal life, although without his eye, Jenkins said.\nTwo people from the attack on Lind were scheduled to go on trial this April, with the victim as key witness. However, last month Lind was murdered, with his throat allegedly slit by a 22-year-old Seattle man, Maximilian Snyder.\nCalifornia prosecutors have claimed Snyder killed Lind to prevent him from testifying against the suspects accused of the earlier attack on him.\nSnyder had previously obtained a marriage license to wed another Zizian, Teresa “Milo” Youngblut, 21.\nThree days after Lind’s death, Youngblut was in a car with Ophelia, née Felix, Bauckholt, 27, a math whiz from Germany who had been part of a lively and fun Jersey City-based group of fintech wizards before getting involved with the Zizians.\nUS Border Patrol agents pulled them over in northern Vermont and Police say Youngblut fired a weapon, killing agent David “Chris” Maland, 44.\nBauckholt also pulled out a gun but was killed in the exchange of fire. Youngblut is now being held in a New Hampshire jail in connection with Maland’s murder.\nThe shootout shed light on another case which was, until then, going cold — the handgun used to kill Maland was bought by Zajko, according to police.\nZajko, reportedly transitioning from female to male also and also using the name “Jamie,” was questioned by police about the murders but then fled.\nFriends said they had heard the elder Zajkos were increasingly distressed by their estrangement from their daughter and it’s believed they told her she was going to be cut out of their will if she didn’t resume contact with them, shortly before their murders.\nFriends of Zajko’s parents say they can’t believe she wasn’t already in custody.\n“We are still so confused and angry that nothing has been done and there’s no justice for Rich and Rita,” said a longtime friend of the couple, who were landlords of about 16 apartment units in the area.\n“If that Border Patrol agent hadn’t been killed, I bet their case would never have been solved.”\nThe source, like many friends of the murder victims, did not want to be publicly identified because they fear retribution from the Zizians.\n“It’s only when the Border Patrol agent was killed last month that everything became connected. They didn’t deserve this.\n“They couldn’t have children which is why they adopted Michelle. Rich used to say his wife was over the moon when they got her as a baby.”\nPennsylvania state police sources told The Post they believe they had enough evidence to arrest Zajko for the murders but the Delaware County DA’s office told the Post cops still had not provided adequate evidence. With Zajko’s arrest this week on unrelated charges, that could change.\nRing camera video from two neighbors’ homes the night of the murders shows a car pulling up to the Zajko home at 11:30 p.m. A minute later, screams of “Mom!” and “Oh my God! Oh, God! God!” could be heard. The footage showed two people going into the house and then an upstairs light went on. Nine minutes later two people were seen leaving the home and driving away in the car.\nOne of the two neighbors who gave their Ring video to police admitted to The Post it was impossible to make out from the video who got out of the car that fateful night.\nWith the arrests of Zajko and Lasota, the seven most prominent members of the Zizians are now either dead or in custody.\nLasota’s sister, Naomi, had reported him missing in 2022, claiming he had fallen off the back of a boat. The Coast Guard searched but did not find a body and an obituary was published.\nHowever, far from dead, Lasota was then arrested in a police raid on a Pennsylvania hotel in Jan. 2023 by officers investigating the murder of the Zajkos.\nIn that incident LaSota reportedly kept his eyes closed, refused to speak and had to be carried from the hotel room by four officers after refusing to move.\nLaSota was charged with disorderly conduct and obstruction, according to court records, but did not show up for hearings.\nThe trio arrested this week were all held without bail after a brief court appearance Tuesday. Currently they all face minor charges of trespassing, obstructing and hindering and possession of a handgun in a vehicle.\n“I shouldn’t be here, I haven’t done anything wrong,” Lasota said by video link when beamed into a Maryland court on Tuesday.\nHow long Lasota can be uncooperative remains to be seen, but prosecutors in various jurisdictions across the US are now preparing cases.\n“I warned Ophelia about the Zizians,” Taylor told The Post. “I knew about the suicides in the group – so I thought that when people go there it’s maybe dangerous for them. This group has a high death rate. And that was even before the murders.”"
    },
    {
      "url": "https://nypost.com/2025/08/14/us-news/ashley-biden-shared-photo-of-husband-howard-krein-with-girlfriend-before-divorce-filing/",
      "text": "Ashley Biden shared a photo of husband Howard Krein hand in hand with ‘his girlfriend’ hours before bombshell divorce filing\nAshley Biden, the former first daughter who is fresh off filing for divorce from her husband, Dr. Howard Krein, shared a picture purportedly showing her ex with another woman.\n“My husband and his girlfriend holding hands,” the 44-year-old wrote in the Instagram Story, over a picture of a man and a woman taken from behind. She accompanied the story with the Notorious B.I.G. song “Another,” featuring Lil’ Kim, which details an affair.\n“What do you do when your man is untrue? Do you cut the sucker off and find someone new?” Lil’ Kim raps in the portion of the song Biden shared on social media.\nThe dark-haired man in a casual short-sleeved shirt and the blond woman in a strapless black dress are not immediately identifiable, but Biden’s message was clear.\nSunday morning’s Instagram Story — which was quickly taken down — came just hours before Biden filed for a divorce from the 58-year-old plastic surgeon in a Philadelphia court after 13 years of marriage.\nAnother since-deleted Instagram Story, showing Biden walking through a park giving a thumbs-up to the tune of Beyonce’s song “Freedom,” also appeared to allude to the split.\nIn a subsequent story accompanied by the Lauryn Hill song “Freedom Time,” she reposted a quote, “New life, new beginnings means new boundaries. New ways of being that won’t look or sound like they did before.”\nFormer President Joe Biden’s daughter is seeking spousal support from her ex as part of the divorce, court records seen by Radar Online show.\nBiden, executive director of the nonprofit Delaware Center for Justice, is “unable to sustain herself” while the divorce is pending, according to the documents filed by her attorney Charles Meyer.\nShe is requesting a no-fault divorce, claiming that the marriage is “irretrievably broken,” and that the couple are living “separate and apart,” the documents show.\nBiden and Krein did not respond to requests for comment Thursday.\nThe couple married in 2012 in Greenville, Delaware, two years after meeting through Ashley’s late brother, Beau, who died of cancer in 2015.\nKrein, a New Jersey-born otolaryngologist at Thomas Jefferson University, proposed in 2011 at Big Sur, California.\nThey married at Delaware’s St. Joseph on the Brandywine Roman Catholic Church in a ceremony combining her traditions with Krein’s Jewish ones, before the couple and some 200 guests traveled to the Biden family’s nearby lakeside home in Wilmington for a reception and dinner.\nJoe Biden, who was vice president at the time, personally prepped the house for his youngest child’s wedding.\n“I kept telling Ash, we’ve got to open up the church and practice walking up and down the aisle so I can handle it,” he previously told People.\nHe was also full of praise for his future son-in-law, saying, “This is the right guy. And he’s getting a helluva woman.”\nKrein also served on the Biden Cancer Initiative’s board of directors between 2017 and 2019, and advised his 2020 presidential campaign on its response to the COVID-19 pandemic in an unofficial capacity.\nAt last year’s DNC in Chicago, Ashley Biden recounted her wedding day and discussed her father’s words to her before she tied the knot.\n“Before he walked me down the aisle, he turned to me and said he would always be my best friend. All these years later, Dad, you are still my best friend,” she said in an address that brought her father to tears."
    },
    {
      "url": "https://nypost.com/2025/02/25/us-news/zizian-cult-defector-brett-danielson-not-dead-has-been-in-hiding/",
      "text": "Zizian cult defector believed to have died in 2022 has been in hiding, fearing maniac vegan group’s revenge\nA former Zizian cult member widely believed to have died by suicide is actually alive and hiding from the “dangerous” group, The Post can reveal.\nGwen Danielson was thought to have died in 2022 even by a lawyer representing her in an active case, but has instead been lying low at an undisclosed location.\nDanielson — who, like many Zizians, is transgender and legally became a woman in 2017, according to court papers — still “fears for her life,” according to her father, Brett Danielson.\n“She checks in regularly and I heard from her very recently but she’s not ready to come out of hiding just yet,” he told The Post.\nDanielson split from the increasingly unhinged group of “rationalist” computer scientists over an argument within the group, according to her father.\n“Their political ideology was that killing animals is just as violent as killing people and therefore everybody is guilty of violence,” he said.\n“And that probably led some of them to a self-justification for their own propensity for violence.”\nAuthorities are investigating four killings across the US linked to various members of the loose-knit group, including a double homicide in Pennsylvania, a murder in California, and a shootout that left a US border guard dead in Vermont.\nJack “Ziz” LaSota, 34, who has been described as the leader of the group, was arrested on February 16 alongside Michelle Zajko, 32, and Daniel Blank, 26, in Maryland after they were seen trespassing, raising suspicion. A gun was found in their vehicle.\nProsecutors in different jurisdictions across the country are thought to be preparing further charges.\nZajko is a suspect in the murder of her parents in Pennsylvania but has not been charged in that case. Two others tied to the group are also in custody, both for murder.\nMaximillian Snyder is charged over the Jan. 17 death of Curtis Lind, who had at one time let the group camp on his property, and Teresa Youngblut over the shooting of the David Maland, the Border Patrol guard, on Jan. 20. Youngblut has pleaded not guilty, while Snyder has yet to enter a plea.\nNow that the apparent Zizian ringleaders are facing justice, Danielson’s father is hoping their family can move on.\n“Hopefully [the recent arrests] are the end of their activities and those who really were somewhat innocently pulled into the vortex of this can get their lives straightened back out again.\n“I’m hoping that this allows [Gwen] to come out of hiding, put things behind her and move on,” he added.\nBrett said his understanding of why the Zizians mostly happen to be transgender or non-binary is that, as part of their “rationalism” interests, they believe taking estrogen led to “clearer thinking.”\n“Gwen spoke a lot about the difference in the way of mental acuity with estrogen versus testosterone,” he told The Post.\nThe rumors of Danielson’s death started soon after LaSota was reported missing by his sister, who said he had gone overboard off a boat in the San Francisco Bay, according to court papers seen by The Post.\nAn extensive search by the Coast Guard could not find LaSota’s body and an obituary was published for him that stated he loved “adventure … music, blueberries, biking, computer games, and animals.”\nJerold Friedman, an attorney presenting both LaSota and Danielson on charges related to a protest they had staged in 2019, noted both were apparently dead from separate incidents at the time.\n“Mr. Friedman believes that Ms. Danielson may have committed suicide and would like time to investigate,” a court order dated August 2022 read.\nFriedman did not respond to a request for comment from The Post.\nHowever, LaSota was found to be alive and arrested at a Pennsylvania hotel in January 2023 and questioned about the double homicide of Zajko’s parents.\nHe was eventually let go, but now stands charged with trespassing and obstruction as well as having a gun in a vehicle stemming from the Maryland arrest. A judge ordered LaSota, Zajko and Blank held without bail, describing them as flight risks.\nLaSota’s current attorney, Daniel McGarrigle, declined to answer any questions regarding his client’s case.\nJessica Taylor, an artificial intelligence researcher who knew several of the group members, first met at least four Zizians around 2015 at the Center for Applied Rationality, an organization in the city which hosts workshops on cognitive science and “de-biasing” with a mission to “develop clear thinking for the sake of humanity’s future,” according to its website.\nShe told The Post the group had a “high death count” that included several suicides.\nTwo people in the group’s orbit who took their own lives were named Maia Pasek, who left a quasi-suicide note in 2018 referencing rational thought processes, and Jay Winterford — also known as Jacob Pekarek — a math and science graduate in 2021.\n“I knew about the suicides in the group … but before [Lind was attacked and murdered] I didn’t generally have the sense they could be violent,” she said.\n“Now I think they are a criminal gang.”"
    }
  ],
  "argos_summary": "The Justice Department is pursuing the death penalty for Teresa Youngblut, a member of the Zizians cult, accused of murdering U.S. Border Patrol agent David Maland in Vermont. Youngblut, along with other cult members, is linked to multiple killings across the U.S., including the deaths of her parents in Pennsylvania. The Zizians, a group of radical computer scientists with anarchist beliefs, have been involved in various violent incidents, raising concerns about their influence and activities.",
  "argos_id": "AG4ZWHF5T"
}