{
  "url": "https://www.seattletimes.com/seattle-news/law-justice/centralia-police-shoot-injure-man-police-say-fired-at-officers/",
  "authorsByline": "Mara Mellits",
  "articleId": "bc12519bf44f4955ac39798db47c653b",
  "source": {
    "domain": "seattletimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "WA",
      "county": "King County",
      "city": "Seattle",
      "coordinates": {
        "lat": 47.6038321,
        "lon": -122.330062
      }
    }
  },
  "imageUrl": "https://images.seattletimes.com/wp-content/uploads/2025/07/07252025_tzr_tzr_142400.jpg?d=1200x630",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T16:49:22-07:00",
  "addDate": "2025-08-15T00:12:11.227365+00:00",
  "refreshDate": "2025-08-15T00:12:11.227366+00:00",
  "score": 1.0,
  "title": "Centralia police shoot, injure man police say fired at officers",
  "description": "A Centralia police officer on Wednesday shot and injured a man who reportedly pointed a gun at a train crew passing through Chehalis then shot at officers, according to a Facebook post from the Centralia police. Police were dispatched at...",
  "content": "A Centralia police officer on Wednesday shot and injured a man who reportedly pointed a gun at a train crew passing through Chehalis then shot at officers, according to a Facebook post from the Centralia police.\n\nPolice were dispatched at 9:45 a.m. near the stock ponds north of Chamber of Commerce Way, according to the post.\n\nCentralia police could not be reached Thursday afternoon.\n\nWhen officers tried to make contact with the man, he started running toward the railroad tracks, the post said. While running, he started shooting at officers, according to the post. The suspect fired his handgun at one detective sergeant from the Centralia Police Department and two officers from the Chehalis Police Department, the post said. He then ran south toward the railroad tracks toward Chehalis, according to the post.\n\nOfficers from the Centralia and the Chehalis police departments, deputies from the Lewis County sheriff’s office and officers from the Department of Corrections were all dispatched.\n\nNorth and southbound Interstate 5 were closed as a “safety precaution” because the suspect had already fired his gun, according to Centralia police.\n\nThe man was found still armed, and while a negotiator tried to speak with him, he ignored officers’ commands and continued to walk toward them, according to the post.\n\nAn officer used “a less-lethal foam round” to try to take the suspect into custody, the Facebook post said. “That was unsuccessful,” the post said.\n\nA Centralia detective then shot the man, who was then taken into custody, the post said.\n\nOfficers rendered first aid and EMTs took over medical care before he was taken to Centralia Providence Hospital.\n\nThe Region 3 Independent Investigation Team from the Washington State Patrol will conduct the investigation into the officer who shot the man.\n\nThe detective who shot the man has been placed on leave, per standard protocol, the post said.",
  "medium": "Article",
  "links": [
    "https://www.facebook.com/CentraliaPD98531/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Centralia police",
      "weight": 0.12181905
    },
    {
      "name": "Officers",
      "weight": 0.108117655
    },
    {
      "name": "officers",
      "weight": 0.108117655
    },
    {
      "name": "Centralia",
      "weight": 0.09667489
    },
    {
      "name": "Centralia Providence Hospital",
      "weight": 0.09499829
    },
    {
      "name": "man",
      "weight": 0.09246994
    },
    {
      "name": "police departments",
      "weight": 0.09078107
    },
    {
      "name": "A Centralia police officer",
      "weight": 0.08610849
    },
    {
      "name": "police",
      "weight": 0.08572533
    },
    {
      "name": "Chehalis",
      "weight": 0.06964062
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.97802734375
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.97412109375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.95361328125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.79052734375
    },
    {
      "name": "/Sensitive Subjects/Firearms & Weapons",
      "score": 0.302978515625
    }
  ],
  "sentiment": {
    "positive": 0.06250877,
    "negative": 0.6539057,
    "neutral": 0.28358558
  },
  "summary": "A Centralia police officer shot and injured a man who allegedly fired at officers after pointing a gun at a train crew passing through Chehalis. The incident occurred at 9:45 a.m. near the stock ponds north of Chamber of Commerce Way. When officers tried to make contact with the man, he ran towards the railroad tracks and started shooting at them. The suspect was eventually taken into custody and taken to Centralia Providence Hospital. The officer who shot the suspect has been placed on leave.",
  "shortSummary": "A Centralia police officer shot and injured a man who pointed a gun at a train crew before running to the railroad tracks.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "166354cefcfa4df7b6904eced3bde4e6",
  "places": [
    {
      "osmId": "8323720342",
      "road": "I 5",
      "county": "Cowlitz County",
      "state": "Washington",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 45.9372321,
        "lon": -122.767153
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "A Centralia police officer shot and injured a man who allegedly pointed a gun at a train crew and fired at officers during a confrontation in Chehalis. The incident began when police attempted to contact the suspect, who fled and shot at officers before being apprehended. Despite attempts to use less-lethal measures, the situation escalated, leading to the officer's use of a firearm. The suspect was taken to a hospital for treatment, and an investigation into the shooting is being conducted by the Washington State Patrol.",
  "argos_id": "AV46XGQK2"
}