{
  "url": "https://www.latimes.com/espanol/entretenimiento/articulo/2025-08-14/critica-en-medio-de-su-violencia-la-secuela-de-nobody-acentua-el-humor-en-aras-de-la-diversion",
  "authorsByline": "Por Sergio BursteinStaff Writer and Assistant Editor  Seguir",
  "articleId": "84d4d62a18d34c76b472c6a3ab0bd4a1",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/7acc78e/2147483647/strip/true/crop/5602x2941+0+529/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F7e%2F86%2Fe841558440deb4e7a17791762172%2Fnobody-2.jpg",
  "country": "us",
  "language": "es",
  "pubDate": "2025-08-14T20:28:13.793000+00:00",
  "addDate": "2025-08-14T20:42:19.946760+00:00",
  "refreshDate": "2025-08-14T20:42:19.946762+00:00",
  "score": 1.0,
  "title": "CRÍTICA. En medio de su violencia, la secuela de ‘Nobody’ acentúa el humor en aras de la diversión",
  "description": "Bob Odenkirk regresa para causar caos e hilaridad en 'Nobody 2'",
  "content": "Vista en el presente, “Nobody” (2021) pierde parte del encanto que tuvo durante su estreno, realizado cuando los estragos de la pandemia todavía se cernían sobre nosotros y el público no había regresado plenamente a las salas, lo que permitió que estuviera disponible en formatos caseros poco después de su salida en salas y que funcionara como un producto de entretenimiento superior a los que se suelen lanzar directamente en plataformas.\n\nNo es que fuera mala, ni mucho menos; de hecho, se trataba de una cinta que, pese a su aparente falta de creatividad en comparación a producciones semejantes y relativamente recientes, lograba convencer por su saludable empleo del humor y por la presencia inestimable de Bob Odenkirk, el excelente y carismático actor de las series “Breaking Bad” y “Better Call Saul”, quien se ponía en la piel de un personaje que iba a contracorriente de todo lo que el mismo intérprete había hecho antes.\n\nEn lugar de ser un tipo cargado de malicia, pero absolutamente incapaz de levantar un dedo para defenderse de manera física, el oriundo de Illinois se convertía ahora en un hombre que, inicialmente, parecía responder a las características esperadas en un sujeto como él, al ser presentado como un padre de familia incapaz de recurrir a la violencia durante un asalto a su hogar, pero que, súbitamente, volvía a las andanzas del pasado para revelarse como un asesino a sueldo del gobierno con la habilidad de derrotar a varios enemigos a la vez.\n\nDe ese modo, la figura del ‘ejercito de una sola persona’, que había sido ya explotada en su faceta correspondiente a individuos de cierta edad en la saga de “Taken” y en la franquicia de “John Wick”, se vio aquí sumada por su adjudicación a una persona de aspecto realmente inofensivo que, además, se veía involucrada en una serie de aventuras que se tomaban mucho menos en serio que las anteriores, sin perder por ello los estallidos de violencia propios de los enfrentamientos y reforzándoles incluso hasta caer en el ‘gore’.\n\nLo interesante del caso es que Hutch Mansell, el oficinista transformado en arma letal, fue creado por Derek Kolstad, quien hizo lo mismo con John Wick, llegando a escribir los guiones de las tres primeras entregas fílmica de la serie cinematográfica protagonizada Keanu Reeves. En ese sentido, no se trata de una copia, sino de la reutilización ingeniosa de una premisa propia, a la usanza de lo que han hecho otros autores de la cultura popular, como Kevin Williamson (“Scream”, “I Know What You Did Last Summer”), quien efectuó algo semejante en el género del terror.\n\nPor ese lado, “Nobody” resultó bienvenido, pero su encanto no se hizo memorable, sobre todo porque su segunda parte se escudaba en una serie interminable de combates a mano que no terminaban ofreciendo algo realmente novedoso. Ante ello, era razonable sentir un poco de desconfianza ante el anuncio de una secuela que se ha tardado cuatro años en llegar, pero que se lanza finalmente en cines este fin de semana.\n\nNo había que temer tanto, claro, porque la primera película, como ya dijimos, no se tomaba demasiado en serio a sí misma, y porque era de esperar que ocurriera lo mismo con la segunda, que cambiaba de director (reemplazando al ruso Ilya Naishuller por el indonesio Timo Tjahjanto) pero mantenía a Kolstad, quien, a estas alturas, se ha convertido en un experto proveedor de entretenimiento.\n\nLo que sí se podía esperar es que “Nobody 2” se limitara a replicar lo sucedido en el título original sin mayores modificaciones, y aunque estamos seguros de que sus detractores la verán de ese modo, sentimos que Kolstad ha tenido un gran acierto al acentuar los aspectos ridículos de lo que hizo antes para darle vida a lo que es, básicamente, una comedia de acción brutal pero a la vez hilarante, casi como una versión de “Naked Gun” para adultos.\n\nApelando a una influencia inesperada (la de la saga “National Lampoon’s Vacation”, conocida en Latinoamérica como “Vacaciones”), el guionista construye una suerte de secuela directa en la que Mansell, plenamente reintegrado a su peligroso trabajo, decide tomarse un respiro en consideración a la creciente indiferencia que le muestran sus familiares, lo que lo lleva a emprender con ellos un viaje de descanso que, evidentemente, será mucho menos pacífico de lo planeado.\n\nY es que el hombre no puede con su genio, por lo que se enemistará casi de inmediato con la mafia local del pueblo que visita, compuesta al menos parcialmente por el dueño de un parque de atracciones (Wyatt Martin), un policía corrupto (Colin Hanks) y una contrabandista de alto vuelo (Sharon Stone). Tiene nuevamente a su lado a sus hijos y a su encantadora esposa (Connie Nielsen), quienes se ven eventualmente sumados por otros personajes habituales de este universo, como su inquieto padre (Christopher Lloyd) y su solidario hermanastro (RZA).\n\nBajo estas condiciones, la falta de credibilidad de muchas de las escenas se convierte en un factor descartable y hasta propicio para el desarrollo del humor. Y aunque la cinta posee una evolución narrativa que no destaca precisamente por su astucia, se preocupa al menos en desarrollar la relación entre Mansell y su mujer, que se encontraba antes simplemente delineada y que, en este caso, obtiene aristas interesantes, favoreciendo con ello el desempeño de la gran Nielsen. Por otro lado, ver a la legendaria Stone en la piel de una villana desquiciada no es algo que merezca ser pasado por alto.\n\nOdenkirk tiene 62 años, y más allá de cualquier entrenamiento al que se haya sometido, estamos seguros de que no hizo por cuenta propia la totalidad de los momentos de acción que le correspondían a su personaje. Pero parece haber estado definitivamente involucrado en muchos de ellos, y recurre frecuentemente a esa expresividad visual tan suya que le permite manifestar emociones sin tener que pronunciar palabra. Verlo en la pantalla justifica ya el precio de la entrada y logra incluso que queramos volver a verlo en el papel.\n\nPor su parte, en su primera asignación hollywoodense, Tjahjanto, director y guionista de cintas de acción tan implacables y ultra violentas como “The Night Comes for Us” (2018) y “The Shadow Strays” (2014), aprovecha su probado talento para las coreografías de lucha con la finalidad de ofrecernos secuencias en movimiento que superan definitivamente a las del capítulo 1.\n\nTampoco se ve obligado a dejar completamente de lado su obsesión por la brutalidad (hay un detalle relacionado a un dedo que no deja de impresionar), pero logra que su aproximación al asunto resulte mucho más tolerable que la habitual debido al abundante empleo de la comicidad que le impone el texto actual.\n\nDe hecho, sin contar con la espectacularidad de los dos títulos citados de Tjahjanto -que se pueden encontrar en Netflix-, “Nobody 2” es uno de esos filmes que los espectadores recordarán por escenas específicas de pelea, como la que sucede al interior de un elevador, la que se produce en un parque de diversiones y, por supuesto, la que se da en medio de un río, a bordo de un bote de turistas coronado por un patito. Si esto no te divierte, es que no tienes sangre en la cara (o en la conciencia).",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other usual characters",
      "weight": 0.05296765
    },
    {
      "name": "hand fighting",
      "weight": 0.043714035
    },
    {
      "name": "specific fighting scenes",
      "weight": 0.04367312
    },
    {
      "name": "Timo Tjahjanto",
      "weight": 0.042270165
    },
    {
      "name": "other authors",
      "weight": 0.042153437
    },
    {
      "name": "Derek Kolstad",
      "weight": 0.042118866
    },
    {
      "name": "John Wick",
      "weight": 0.04147247
    },
    {
      "name": "brutal action",
      "weight": 0.04145269
    },
    {
      "name": "Nobody",
      "weight": 0.039676383
    },
    {
      "name": "such implacable and ultra -violent action tapes",
      "weight": 0.03869739
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.939453125
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.8505859375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.79931640625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.70068359375
    },
    {
      "name": "/Arts & Entertainment/Movies/Drama Films",
      "score": 0.35498046875
    }
  ],
  "sentiment": {
    "positive": 0.1662884,
    "negative": 0.4643791,
    "neutral": 0.36933252
  },
  "summary": "",
  "shortSummary": "",
  "translation": "Viewed in the present, \"Nobody\" (2021) loses part of the charm that had during its premiere, made when the pandemic ravages still hovered over us and the public had not fully returned to the rooms, which allowed it to be available in homemade formats shortly after its room exit and that functioned as a product of entertainment superior to those that are usually launched directly on platforms.\n\nNot that it was bad, much less; In fact, it was a tape that, despite its apparent lack of creativity compared to similar and relatively recent productions, managed to convince for its healthy employment of humor and for the invaluable presence of Bob Odenkirk, the excellent and charismatic actor of the “Breaking Bad” series and “Better Call Saul”, who was put in the skin of a character that was going to same interpreter had done before.\n\nInstead of being a guy loaded with malice, but absolutely unable to lift a finger to defend herself physically, the native of Illinois now became a man who, initially, seemed to respond to the expected characteristics in a subject like him, being presented as a family father unable to resort to violence during an assault on his home, but that, suddenly, he returned to the jurisdiction of the past Government's salary with the ability to defeat several enemies at the same time.\n\nIn this way, the figure of the ‘Singer Army’, which had already been exploited in its facet corresponding to individuals of a certain age in the saga of “Taken” and in the franchise of “John Wick”, was seen here added by its award to a really harmless appearance person who, in addition, was involved in a series of adventures that were taken much less seriously. Building of violence of the confrontations and reinforcing them even until they fall into the ‘gore’.\n\nThe interesting thing is that Hutch Mansell, the office worker transformed into a lethal weapon, was created by Derek Kolstad, who did the same with John Wick, coming to write the scripts of the first three film deliveries of the Keanu Reeves stars starred. In that sense, it is not a copy, but the ingenious reuse of their own premise, in the way of what other authors of popular culture have done, such as Kevin Williamson (\"Scream\", \"I Know What You Did Last Summer\"), who performed something similar in the genre of terror.\n\nOn that side, \"Nobody\" was welcome, but his charm did not become memorable, especially since his second part was shielded in an endless series of hand fighting that did not end up offering something really new. Given this, it was reasonable to feel a bit of distrust of the announcement of a sequel that has taken four years to arrive, but that is finally thrown in cinemas this weekend.\n\nWe had not to fear so much, of course, because the first film, as we said, did not take itself too seriously, and because it was expected that the same thing happened with the second, which changed from director (replacing the Russian Ilya Naishuller with the Indonesian Timo Tjahjanto) but kept Kolstad, who, at this point, has become an expert entertainment.\n\nWhat could be expected is that \"Nobody 2\" would limit himself to replicating what happened in the original title without major modifications, and although we are sure that his detractors will see it in that way, we feel that Kolstad has had a great success by accentuating the ridiculous aspects of what he did before to give life to what is basically a comedy of brutal action but at the same time hilarious, almost as a version of “naked Gun ”for adults.\n\nAppealing to an unexpected influence (that of the “National Lampoon’s Vacation” sag Pacific of the planned.\n\nAnd it is that the man cannot with his genius, so he will almost immediately eradicate with the local mafia of the town that visits, composed at least partially by the owner of an amusement park (Wyatt Martin), a corrupt policeman (Colin Hanks) and a high flight smuggler (Sharon Stone). He has his children and his lovely wife by his side (Connie Nielsen), who are eventually added by other usual characters of this universe, such as his restless father (Christopher Lloyd) and his solidarity his brother (Rza).\n\nUnder these conditions, the lack of credibility of many of the scenes becomes a disposable factor and even conducive to the development of humor. And although the tape has a narrative evolution that does not stand out precisely because of its cunning, it cares at least in developing the relationship between Mansell and his wife, who was previously outlined before and that, in this case, obtains interesting edges, thereby favoring the performance of the great Nielsen. On the other hand, seeing the legendary Stone in the skin of a deranged villain is not something that deserves to be overlooked.\n\nOdenkirk is 62 years old, and beyond any training to which he has submitted, we are sure that he did not make the totality of the moments of action that corresponded to his character. But it seems to have been definitely involved in many of them, and frequently resorts to that visual expressiveness so yours that it allows you to manifest emotions without having to pronounce word. Seeing it on the screen already justifies the ticket price and even wants to see it on paper again.\n\nOn the other hand, in its first Hollywood assignment, Tjahjanto, director and screenwriter of such implacable and ultra -violent action tapes as “The Night Comes for Us” (2018) and “The Shadow Strays” (2014), takes advantage of its proven talent for the fight choreographies in order to offer us moving sequences that definitively exceed those of chapter 1.\n\nNor is it forced to completely put aside its obsession with brutality (there is a detail related to a finger that does not stop impressing), but it achieves that its approach to the matter is much more tolerable than the usual due to the abundant use of the comic that the current text imposes.\n\nIn fact, without the spectacularity of the two titles mentioned by Tjahjanto -which can be found in Netflix -, “Nobody 2” is one of those films that the spectators will remember for specific fighting scenes, such as the one that happens inside an elevator, which occurs in a fun park and, of course, the one that occurs in the middle of a river, on board a tourist Duckling If this does not have fun, you have no blood on your face (or in consciousness).",
  "translatedTitle": "CRITICISM. In the midst of its violence, the sequel to ‘Nobody’ accentuates humor for the sake of fun",
  "translatedDescription": "Bob Odenkirk returns to cause chaos and hilarity in 'Nobody 2'",
  "translatedSummary": "The sequel to \"Nobody\" (2021), which was released four years after the original title was released, has been criticised for its lack of creativity and for its emphasis on humor. Despite its lacklustre presentation, it was praised for its use of humor and the presence of Bob Odenkirk, the actor of \"Breaking Bad\" series and \"Better Call Saul\" who plays a character similar to the character of \"Taken\" and \"John Wick\". The film's protagonist, Hutch Mansell, was created by Derek Kolstad, who also wrote the scripts for the first three film deliveries of Keanu Reeves starred. However, the second half of \"Nobody 2\" was criticized for focusing on the same themes and not offering anything new. The film is set to be released in cinemas this weekend.",
  "reprint": false,
  "reprintGroupId": "8b722c3395434bd389f22d39450ffaae",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "La película 'Nobody' (2021) se presenta como un entretenido producto de acción y comedia, destacando la actuación de Bob Odenkirk como un padre de familia que se convierte en un asesino a sueldo. Aunque su secuela, 'Nobody 2', ha tardado en llegar, se espera que mantenga el mismo tono humorístico y de acción, con un enfoque en la relación familiar del protagonista y la inclusión de personajes como Sharon Stone. El nuevo director, Timo Tjahjanto, promete mejorar las secuencias de lucha, ofreciendo un filme que combina brutalidad y comedia de manera efectiva.",
  "argos_id": "AZJ0WR7XS"
}