{
  "url": "https://www.ajc.com/news/2025/08/sexual-violence-in-conflicts-worldwide-increased-by-25-last-year-un-says/",
  "authorsByline": "EDITH M. LEDERER",
  "articleId": "e890f3f44c9d436482da6aeb2f1da87c",
  "source": {
    "domain": "ajc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "GA",
      "county": "Fulton County",
      "city": "Atlanta",
      "coordinates": {
        "lat": 33.7489924,
        "lon": -84.3902644
      }
    }
  },
  "imageUrl": "https://www.ajc.com/resizer/v2/RTYVLCHPWFGM5JPANPE5CQO7TQ.jpg?auth=d286746e50f6054d08a4b2fc23501c4483cac7e098850cc97a2d2b8488c4eb79&width=1200&height=630&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T22:22:46.380000+00:00",
  "addDate": "2025-08-14T22:30:41.592333+00:00",
  "refreshDate": "2025-08-14T22:30:41.592334+00:00",
  "score": 1.0,
  "title": "Sexual violence in conflicts worldwide increased by 25% last year, UN says",
  "description": "The U.N. says sexual violence in conflicts worldwide increased by 25% last year, with the highest number of cases in the Central African Republic, Congo, Haiti, Somalia and South Sudan",
  "content": "Over 70% of those listed have appeared on the report’s blacklist annex for five years or more without creating steps to prevent the violence, the U.N. chief said.\n\nFor the first time, the report includes two parties that have been notified the U.N. has “credible information” that could put them on next year’s blacklist if they don't take preventive actions: Israel’s military and security forces over allegations of sexual abuse of Palestinians primarily in prisons and detention, and Russian forces and affiliated armed groups against Ukrainian prisoners of war.\n\nIsraeli U.N. Ambassador Danny Danon, who circulated a letter Tuesday from Guterres about the country’s forces being put on notice, said the allegations “are steeped in biased publications.”\n\n“The U.N. must focus on the shocking war crimes and sexual violence of Hamas and the release of all hostages,” he said.\n\nRussia’s U.N. mission said it had no comment on the secretary-general’s warning.\n\nThe 34-page report said “conflict-related sexual violence” refers to rape, sexual slavery, forced prostitution, forced pregnancy, forced abortion, forced sterilization, forced marriage and other forms of sexual violence. The majority of victims are women and girls.\n\n“In 2024, proliferating and escalating conflicts were marked by widespread conflict-related sexual violence, amid record levels of displacement and increased militarization,” Guterres said. “Sexual violence continued to be used as a tactic of war, torture, terrorism and political repression, while multiple and overlapping political, security and humanitarian crises deepened.”\n\nThe toll of sexual violence in conflict\n\nThe U.N. says women and girls were attacked in their homes, on roads and while trying to earn a living, with victims ranging in age from 1 to 75. Reports of summary executions of victims after rape persisted in Congo and Myanmar, it said.\n\nIn an increasing number of places, the report said armed groups “used sexual violence as a tactic to gain and consolidate control over territory and lucrative natural resources.”\n\nWomen and girls perceived to be associated with rival armed groups were targeted with sexual violence in the Central African Republic, Congo and Haiti, it said.\n\nIn detention facilities, the report said sexual violence was perpetrated “including as a form of torture,” reportedly in Israel and the Palestinian territories, Libya, Myanmar, Sudan, Syria, Ukraine and Yemen.\n\n“Most of the reported incidents against men and boys occurred in detention, consistent with previous years, and included rape, threats of rape and the electrocution and beating of genitals,” the report said.\n\nThe U.N. peacekeeping mission in the Central African Republic documented cases of rape, gang rape, forced marriage and sexual slavery affecting 215 women, 191 girls and seven men.\n\nIn mineral-rich eastern Congo, the peacekeeping mission documented nearly 800 cases last year including including rape, gang rape, sexual slavery and forced marriage, “often accompanied by extreme physical violence,” the report said. The number of cases involving the M23 rebel group, now controlling the main city Goma, rose from 43 in 2022 to 152 in 2024, it said.\n\nIn Sudan, where civil war is raging, the report said groups providing services to victims of sexual violence recorded 221 rape cases against 147 girls and 74 boys, “with 16% of survivors under five years of age, including four one-year-olds.”",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/central-african-republic-russia-wagner-africa-corps-b9e4078548ceda4bbe8b70eb821d5a87",
    "https://apnews.com/hub/democratic-republic-of-the-congo",
    "https://apnews.com/article/israel-hamas-gaza-sexual-violence-weapon-war-63c4f657e4389ac2aaf51d79343da8ec",
    "https://apnews.com/hub/haiti",
    "https://apnews.com/article/un-israel-palestinians-sexual-violence-guterres-1483a001fff4c6fb4aee3eae7424d746",
    "https://apnews.com/article/israel-hamas-war-abuse-detention-22e9fa04a39198603c0021543e721be6"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Sexual violence",
      "weight": 0.108749464
    },
    {
      "name": "sexual violence",
      "weight": 0.108749464
    },
    {
      "name": "sexual slavery",
      "weight": 0.09074672
    },
    {
      "name": "sexual abuse",
      "weight": 0.08476963
    },
    {
      "name": "extreme physical violence",
      "weight": 0.07708488
    },
    {
      "name": "gang rape",
      "weight": 0.07479974
    },
    {
      "name": "armed groups",
      "weight": 0.074780785
    },
    {
      "name": "Reports",
      "weight": 0.073686354
    },
    {
      "name": "affiliated armed groups",
      "weight": 0.07360709
    },
    {
      "name": "rival armed groups",
      "weight": 0.07354197
    }
  ],
  "topics": [
    {
      "name": "Sexual Exploitation"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.94140625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.837890625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.650390625
    },
    {
      "name": "/News/World News",
      "score": 0.62890625
    },
    {
      "name": "/News/Other",
      "score": 0.55126953125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.436767578125
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.407958984375
    }
  ],
  "sentiment": {
    "positive": 0.048406724,
    "negative": 0.7542564,
    "neutral": 0.19733684
  },
  "summary": "The United Nations (UN) has reported that sexual violence in conflicts increased by 25% last year, with over 70% of those listed have been on the blacklist for five years or more without creating steps to prevent the violence. This includes Israel's military and security forces over allegations of sexual abuse of Palestinians in prisons and detention, and Russian forces and affiliated armed groups against Ukrainian prisoners of war. The report also includes two parties that have been notified the U.N. has \"credible information\" that could put them on next year's blacklist if they don't take preventive actions. The majority of the victims are women and girls. The UN report details instances of sexual violence, including rape, sexual slavery, forced prostitution, forced pregnancy, forced abortion, forced sterilization, and forced marriage.",
  "shortSummary": "The UN reports a 25% increase in conflict-related sexual violence, with over 70% of global offenders facing persistent violence issues.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7dd3a6ea65cc4ba1831664494b51bf40",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/israel-hamas-gaza-sexual-violence-weapon-war-63c4f657e4389ac2aaf51d79343da8ec",
      "text": "Israeli report accuses Hamas of using sexual violence as a weapon of war on Oct. 7\nIsraeli report accuses Hamas of using sexual violence as a weapon of war on Oct. 7\nTEL AVIV, Israel (AP) — An Israeli report released Tuesday said that Hamas used sexual violence as a “tactical weapon of war” in its Oct. 7, 2023, attacks, building on other investigations by international and Israeli rights groups and the United Nations.\nThe report by the Dinah Project, a team of legal and gender experts, based its findings on survivor and witness testimonies, accounts from first responders, and forensic, visual and audio evidence. It called for a shift in how conflict-related sexual violence is prosecuted, saying Hamas silenced its victims by killing them, robbing investigators of key evidence.\n“Most victims were permanently silenced — either murdered during or after the assaults or remain too traumatized to talk — creating unique evidentiary challenges,” the report said, calling for a more tailored legal approach.\nThe report comes as Israel and Hamas are negotiating a ceasefire for the 21-month war in Gaza, which began with the militants’ surprise cross-border raid. The deal would pause the fighting in the Palestinian territory and release some of the remaining 50 hostages, more than half whom are said to be dead.\nAccounts of sexual violence from hostages and witnesses\nThe report said it relied on dozens of accounts, including from one survivor of attempted rape at a music festival, 15 returned hostages, 17 witnesses and multiple first responders.\nIn some cases, the Dinah Project carried out its own interviews, while in others it relied on publicly available testimony or published accounts.\nCiting accounts in Israeli and international media, it said 15 former hostages either experienced or witnessed some form of sexual assault which included physical sexual violence, forced nudity, verbal sexual harassment and threats of forced marriage. Two male hostages said they faced forced nudity and physical abuse when naked.\nThe report said witness accounts indicated at least 15 separate cases of sexual assault, including at least four instances of gang rape.\nThe report said its findings showed patterns in the assaults, including victims found partially or fully naked with their hands tied, evidence of gang rape followed by killing, genital mutilation and public humiliation, indicating they were intentionally used as a weapon of war.\nReport builds on other accusations of sexual violence by Hamas\nA Hamas official did not immediately respond to a request for comment. Hamas has previously denied claims that its forces carried out sexual violence on Oct. 7, 2023, when militants stormed into Israel, killing 1,200 people and taking 251 hostage.\nIn a report last year, the United Nations said there were “reasonable grounds” to believe Hamas committed rape, “sexualized torture,” and other cruel and inhumane treatment of women during its attack.\nIn issuing arrest warrants for three Hamas leaders who were eventually killed by Israel, the prosecutor of the International Criminal Court said they bore responsibility for “rape and other acts of sexual violence as crimes against humanity” during the Oct. 7 attack.\n‘The feeling of being someone else’s property’\nThe report included testimony from more than a dozen returned hostages.\n“In captivity, I went through hell: Hunger, thirst, loneliness,” said Ilana Gritzewsky, who was kidnapped from her home in Kibbutz Nir Oz and held hostage for 55 days, at an event in Jerusalem marking the publication of the report. “Physical and psychological torture. My body ached. My bones were broken. But the humiliation, the fear, the feeling of being someone else’s property — that is the pain that never leaves.”\nGritzewsky said after passing out during her kidnapping, she awoke in Gaza, half undressed, surrounded by militants who pointed their weapons at her while groping her. “Today — almost two years later — people still ask if it really happened. If they really raped, burned, murdered, kidnapped. If they really hurt women. If men were really harmed too. So I tell you — yes. It happened. And it’s still happening.”\nGritzewsky has been an outspoken campaigner for her boyfriend, Matan Zangauker, who was also kidnapped and has been held hostage in Gaza for 21 months.\nReport urges a new approach\nThe report recommended that conflict-related sexual violence should be treated differently from regular sexual crimes to allow for evidence that doesn’t primarily rely on testimony from victims, to account for “the systematic silencing of victims.”\nIt called for different forms of evidence to be admitted in any prosecution and for joint criminal responsibility to be applied to all participants in the attack, rather than trying to link individual perpetrators to specific acts and victims.\nThis approach would create “a pathway to justice for victims of the Oct. 7 attack and potentially for victims in other conflict zones,” the report said.\n“We must learn from past experience and the understanding that we, as Israeli women, must shout our voices for those who can no longer shout, and we must bring them justice,” said Michal Herzog, the first Lady of Israel.\n___\nAssociated Press writer Fatma Khaled in Cairo and Melanie Lidman in Tel Aviv, Israel contributed to this report."
    },
    {
      "url": "https://apnews.com/article/central-african-republic-russia-wagner-africa-corps-b9e4078548ceda4bbe8b70eb821d5a87",
      "text": "Russia asks Central African Republic to replace Wagner with state-run Africa Corps and pay for it\nBANGUI, Central African Republic (AP) — Officials in the Central African Republic have said that Russia has called on the country to replace the private Wagner mercenary group with Moscow’s state-run Africa Corps and requested payment for further security services.\nThe Central African Republic’s government has been reluctant to agree to Moscow’s demands, because it sees Wagner as more effective and they prefer to pay for services with minerals, not in cash.\nFor years, Wagner has been in Central African Republic, where they are protecting President Faustin Archange Touadera and his government, and helped him win a 2023 constitutional referendum that could extend his power indefinitely. In exchange, they’ve enjoyed access to the country’s rich minerals, including gold.\nBut Russia has been trying to transition from Wagner to Africa Corps since Wagner’s leader, Yevgeny Prigozhin, was killed in a plane crash in 2023. The Wagner mercenaries were replaced earlier this year in Mali.\nA Central African Republic military official told The Associated Press on Tuesday that the Russian deputy defense minister made the demands about a shift to Africa Corps and payment for its services earlier this year during several visits to the country.\nThe official said government authorities are reluctant to agree, because they believe the private-run Wagner would be more effective than Africa Corps, which is under direct command of the Russian defense ministry.\nWagner has “connections with the officers, are feared operationally and have the resources,” said the official, who wasn’t allowed to publicly discuss the matter so spoke on condition of anonymity.\nThe military official said that according to the Russian demands, the Central African Republic “must not only cover the costs of Africa Corps personnel, but also pay significant sums of money to Russia, amounting to billions of CFA francs (millions of dollars).\n“But authorities in Bangui said they are unable to pay the amount,” the official said. “Instead, they hope to compensate Russia with strategic and mineral resources, notably gold, uranium, and iron.”\nA senior Central African lawmaker with direct knowledge of the negotiations confirmed the demands by Russia to the AP.\n“We discussed it, and the government needs to make proposals,” said the lawmaker, who who wasn’t authorized to talk to reporters about the issue so spoke on condition of anonymity.\nThere are also questions regarding the Kremlin’s demand for payment. Both officials who spoke with the AP didn’t mention a specific amount, but they suggested that it was too much for the country to pay.\nRussia’s Defense Ministry didn’t immediately respond to a request for comment.\nThe Central African Republic has been in conflict since 2013 when predominantly Muslim rebels seized power and forced the president from office. A 2019 peace deal was signed but six of the 14 armed groups involved in the deal withdrew from it. Wagner is credited for helping prevent the rebels from retaking the capital in 2021.\nUnlike Wagner, which fights rebels alongside government forces, Africa Corps is more focused on training and that could be a contentious issues for both countries, said Ulf Laessing, head of the Sahel program at the Konrad Adenauer Foundation.\n“In Mali, they forced them to accept the change,” Laessing said. “I don’t think the Central African Republic has options since they chased away the Europeans.”\nFrance, the Central African Republic’s former colonial ruler, had a significant military presence in the country since it’s independence in 1960, but withdrew its last troops in 2022 after a fallout with authorities.\n___\nMark Banchereau reported from Dakar, Senegal."
    },
    {
      "url": "https://apnews.com/article/un-israel-palestinians-sexual-violence-guterres-1483a001fff4c6fb4aee3eae7424d746",
      "text": "Israel rejects UN allegations that its forces have sexually abused detained Palestinians\nUNITED NATIONS (AP) — The U.N. chief warned Israel that the United Nations has “credible information” of sexual violence and other violations by Israeli forces against detained Palestinians, which Israel’s U.N. ambassador dismissed as “baseless accusations.”\nSecretary-General Antonio Guterres said in a letter to Ambassador Danny Danon that he is “gravely concerned” about reported violations against Palestinians by Israeli military and security forces in several prisons, a detention center and a military base.\nGuterres said he was putting Israeli forces on notice that they could be listed as abusers in his next report on sexual violence in conflict “due to significant concerns of patterns of certain forms of sexual violence that have been consistently documented by the United Nations.”\nDanon, who circulated the letter and his response Tuesday, said the allegations “are steeped in biased publications.”\n“The U.N. must focus on the shocking war crimes and sexual violence of Hamas and the release of all hostages,” he said.\nDanon was referring to the militant group’s surprise attack in southern Israel on Oct. 7, 2023, where some 1,200 people were killed and about 250 taken hostage. Israeli authorities said women were raped and sexually abused.\nThe Hamas attack triggered the ongoing war in Gaza, which has killed more than 61,400 Palestinians, according to Gaza’s Health Ministry, which does not say how many were fighters or civilians but that about half were women and children.\nDanon stressed that “Israel will not shy away from protecting its citizens and will continue to act in accordance with international law.”\nBecause Israel has denied access to U.N. monitors, it has been “challenging to make a definitive determination” about patterns, trends and the systematic use of sexual violence by its forces, Guterres said in the letter.\nHe urged Israel’s government “to take the necessary measures to ensure immediate cessation of all acts of sexual violence, and make and implement specific time-bound commitments.”\nThe secretary-general said these should include investigations of credible allegations, clear orders and codes of conduct for military and security forces that prohibit sexual violence, and unimpeded access for U.N. monitors.\nIn March, U.N.-backed human rights experts accused Israel of “the systematic use of sexual, reproductive and other gender-based violence.”\nThe Commission of Inquiry on the Occupied Palestinian Territory said it documented a range of violations perpetrated against Palestinian women, men, girls and boys and accused Israeli security forces of rape and sexual violence against Palestinian detainees.\nAt the time, Israeli Prime Minister Benjamin Netanyahu lashed out at the U.N. Human Rights Council, which commissioned the team of independent experts, as an “anti-Israel circus” that “has long been exposed as an antisemitic, rotten, terrorist-supporting, and irrelevant body.” His statement did not address the findings themselves."
    },
    {
      "url": "https://apnews.com/article/israel-hamas-war-abuse-detention-22e9fa04a39198603c0021543e721be6",
      "text": "Israel court hears bid to close prison where soldiers are accused of sexually assaulting Palestinian\nIsrael court hears bid to close prison where soldiers are accused of sexually assaulting Palestinian\nJERUSALEM (AP) — The Israeli Supreme Court considered a petition Wednesday to shutter a desert military prison where soldiers have been accused of abusing Palestinians, as a new video emerged purporting to show the sexual assault of a Palestinian detainee.\nRights groups have been engaged in a legal battle since June to shut down the detention facility, known as Sde Teiman, where Israel has held many Palestinians detained in Gaza during the 10-month war with Hamas. The groups claim that conditions at the facility are grave and that abuse by Israeli soldiers is common, basing their claims on testimony from released detainees and Israeli whistleblowers.\nCalls for the prison’s closure ramped up in late July, when Israeli military police arrested 10 soldiers from Sde Teiman on suspicion of their involvement in the alleged sexual assault of a Palestinian detainee at the facility. Five of the soldiers are no longer under investigation. A physician who identified himself as the person who reported the attack said last week that the detainee appeared to have been seriously sexually abused.\nThe soldiers’ detention triggered angry protests by supporters, and at least two government ministers demanded their release. The response underscored tensions between the military command and hard-line nationalists in Prime Minister Benjamin Netanyahu’s government who advocate even harsher treatment of Palestinians detained from Gaza.\nDefense lawyer Nati Rom told The Associated Press that the soldiers were arrested about a month after the alleged attack and are accused of performing acts of sodomy on the detainee. He said the soldiers used force to defend themselves against a detainee who attacked them during a search, but did not sexually abuse him.\nA video purporting to reveal the assault shows a group of masked soldiers wresting a detainee from the ground, where he and other Palestinians appear to be lying face down in a fenced-in pen, their arms cuffed above their heads. The soldiers take the detainee to an area of the pen they appear to cordon off using shields. Footage then shows about eight soldiers and a dog with the detainee, largely hidden from view by shields held up by some of the soldiers. Israel’s Channel 12 news, which broadcast the video, said it captures the moment of the attack.\nTwo soldiers who formerly worked at the facility and requested anonymity for fear of retribution told the AP they believed the video had been taken at Sde Teiman. The room in which the detainees appear, a corral topped by barbed wire, matches photos of the facility shared with the AP and the description of incarceration conditions that whistleblowers have previously described.\nMilitary prosecutors stated that evidence brought forth in the case indicates “a reasonable suspicion of the commission of the acts,” the Israeli military said Tuesday. The military did not comment on the video.\nU.S. officials have seen the video, State Department spokesperson Matthew Miller said Wednesday. He called the reports of sexual abuse “horrific.”\n“Prisoners’ human rights need to be respected in all cases and when there are alleged violations, the government of Israel needs to take steps to investigate those who are alleged to have committed abuses and, if appropriate, hold them accountable,” Miller said.\nMeanwhile, more information about the case has come to light from a doctor who treated the detainee in question.\nDr. Yoel Donchin, an Israeli anesthesiologist at the field hospital for Palestinian detainees at Sde Teiman, came forward Friday as the person who reported the case to the military authorities.\nIn an interview with Israeli public broadcaster Kan, Donchin said the detainee’s life was in danger and that he was in need of emergency surgery after the attack.\nDuring the interview, Donchin confirmed information attributed to an unidentified medical official who said the detainee had fractured ribs, showed signs of beating and bore evidence of being sodomized, leading to a tear in the lower part of the intestines.\nDonchin said the detainee’s case was the most extreme he had witnessed since working at the facility.\nNaji Abbas, a case manager with Physicians for Human Rights-Israel, said the detainee was transferred to a civilian hospital outside Sde Teiman about a month ago because his injuries were too severe for treatment at the military facility. Abbas received his information from a medical source with knowledge of the case.\nIn a written submission to the Israeli Supreme Court in advance of Wednesday’s hearing, state attorneys did not mention the military’s sexual assault investigation, but insisted the rights groups’ claims of deplorable conditions were inaccurate.\nThe Israeli organization arguing in court for the military prison’s closure, the Association for Civil Rights in Israel, had alleged that detainees at the facility are punished with severe violence, including with attack dogs and sexual assault; made to sit on the ground blindfolded and handcuffed 24 hours a day; forbidden from moving or speaking and rarely shower or change clothes.\nAn investigation by the AP into the facility documented how detainees are blindfolded, handcuffed and diapered during medical treatment.\nThe state, in a written response, said detainees were given sufficient food and water, showered regularly, accessed medical treatment as needed, and were blindfolded and handcuffed because of concerns that they could harm staff. The state said a new wing of Sde Teiman set to open Sept. 5 would improve conditions, including adding a walking area for detainees. Additional improvements are expected to be made later this year, it said.\nFollowing Wednesday’s hearing, the court gave the state a week and a half to provide more information about conditions at the prison.\nSde Teiman was the main military prison holding Palestinians captured in large-scale raids on the Gaza Strip. Israel began moving detainees out of the facility following the rights groups’ petition to shut it down. State filings show 28 detainees remain.\nUnder Israeli law, Palestinians from Gaza can be held at the facility, and other military detention camps, without a detention order, trial or charge for over a month. Many Palestinian detainees have spent weeks in the facility before being released back to Gaza after Israeli authorities deemed them unaffiliated with militant groups.\n___\nThis story has been edited to correct the name of the organization Physicians for Human Rights-Israel. ___\nAssociated Press reporters Tia Goldenberg and Melanie Lidman in Tel Aviv, Israel; and Jack Jeffery in Ramallah, West Bank, contributed to this report."
    }
  ],
  "argos_summary": "The U.N. report highlights the alarming prevalence of conflict-related sexual violence, with over 70% of listed parties failing to take preventive measures. For the first time, Israel's military and Russian forces in Ukraine have been warned they could be blacklisted for alleged abuses. The report details various forms of sexual violence used as tactics of war across multiple conflict zones, emphasizing the need for a new legal approach to address these crimes effectively.",
  "argos_id": "B4BF0A0LU"
}