{
  "url": "https://www.thesun.co.uk/fabulous/36297021/best-sun-cream-hack-ever-promises-no-tears/",
  "authorsByline": "Abigail Wilson",
  "articleId": "f0d4fda0fa9645c78edf896a61ad3e8a",
  "source": {
    "domain": "thesun.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "county": "West Yorkshire",
      "city": "Leeds",
      "coordinates": {
        "lat": 53.7440745,
        "lon": -1.5988598
      }
    }
  },
  "imageUrl": "https://www.thesun.co.uk/wp-content/uploads/2025/08/newspress-collage-o3v9k2bto-1755192727832.jpg?1755196357&strip=all&w=1920&h=1080&crop=1",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-14T20:12:30+01:00",
  "addDate": "2025-08-14T19:20:33.826198+00:00",
  "refreshDate": "2025-08-14T19:20:33.826200+00:00",
  "score": 1.0,
  "title": "Survive hot weather with mum's 'best sun cream hack' that promises no tears",
  "description": "A SAVVY mum has shared a “genius” trick to guarantee there are no tears when applying sun cream. Not only does it make the process much more fun for youngsters, but if your little one hates having …",
  "content": "A SAVVY mum has shared a “genius” trick to guarantee there are no tears when applying sun cream.\n\nNot only does it make the process much more fun for youngsters, but if your little one hates having sun cream applied, then you’ll need to check this out.\n\nWith this simple tip, which has been hailed the “best sun cream hack ever,” you’ll need an unexpected kitchen essential.\n\nPosting on social media, Gemma McCartan, a mum-of-two and full-time content creator from the UK, gave her followers a close-up look at her trick, which involves using spoons when applying spray sun cream.\n\nAlongside her short video, the influencer beamed: “The best sun cream hack for kids EVER.”\n\nShe then said: “To the mum who posted this, I love you.”\n\nInstead of wrestling her son Max to close his eyes so she could apply the spray sun cream to his face, the youngster instead put two spoons over his eyes.\n\nGemma was then able to spray his face with sun cream, without it getting in his eyes and causing any tears.\n\nMoments after, the woman's daughter then did the same, yet again ensuring a seamless application with no irritation of the eyes, whilst at the same time, making the often agonising process much more exciting.\n\nThrilled with her hack, Gemma later wrote: “It’s been a game changer.”\n\nClearly beaming with the simple trick, the mother added: “It’s made my day, I had the kids crying on holiday until we found this hack.”\n\nGemma’s TikTok clip, which was posted under the username @gemmamccartan, has clearly left many open-mouthed, as it has quickly racked up 200,800 views.\n\nNot only this, but it’s also amassed 2,074 likes and 138 comments.\n\nParents were impressed with the “genius” trick and many thought it was a “great” idea.\n\nWhilst a third commented: “Not only practical, it gives the kids a feeling of control over what's about to happen, so they are more willing to cooperate. Great idea.”\n\nMeanwhile, someone else gushed: “Best idea ever for sun cream.”\n\nThe importance of sun cream in your skincare routine Dermatologist and skincare enthusiast Andrea Suarez - known as Dr Dray - revealed why you should wear suncream. The one thing you can do that will make the biggest difference - and this matters for all ages - is protecting your skin from the sun, Andrea stressed. \"The vast majority of external aging is due to exposure to ultraviolet radiation,\" she continued, not because you're \"not using some jazzy serum or layering 90 different things on your face everyday\". \"If you're not doing in your 20s, get on that now.\" But she said the use of sun cream alone doesn't go far enough. Andrea urged that you also wear sun-protective clothing like broad-brimmed hats and long sleeves, on top of not staying out too long in the sun. Doing this over your lifetime - and all year, not just during the summer or on sunny days - \"will reduce the visible signs of photoageing\", Andrea said. Those are wrinkles, muddled pigmentation and sagging skin.\n\nHowever, at the same time, one user wrote: “Should have cream on eyelids too as they can burn, I know it stings if it gets in eyes but it’s such a sensitive area so best to have full coverage.”\n\nTo this, Gemma wrote back and explained: “Yes but my son has allergies so this is amazing.”\n\nNot only this, but another person asked: “Won't they get a burnt line where the handles are?”\n\nIn response, Gemma confirmed that instead of spraying the sun cream on her youngster’s eyelids, after the fun part, she then uses her finger for a more controlled application, as she acknowledged: \"I use my finger to do the sides and lids.”\n\nUnlock even more award-winning articles as The Sun launches brand new membership programme - Sun Club",
  "medium": "Article",
  "links": [
    "https://www.thesun.co.uk/topic/tips-tricks-life-hacks/",
    "https://www.thesun.co.uk/fabulous/36288180/paid-24-hour-job-nobody-wants/",
    "https://www.thesun.co.uk/fabulous/parenting/",
    "https://www.thesun.co.uk/shopping/25782300/best-sun-creams/",
    "https://www.thesun.co.uk/news/uknews/",
    "https://www.thesun.co.uk/fabulous/6233142/sunburn-treatment-healing-time/",
    "https://www.thesun.co.uk/fabulous/35489550/best-sun-cream-free-soltan-boots/",
    "https://www.thesun.co.uk/fabulous/36276642/holiday-mistakes-look-classless/",
    "https://www.thesun.co.uk/fabulous/36238230/i-went-to-bed-and-woke-up-to-my-downstairs-neighbour-raping-me-he-tracked-my-footsteps-to-plan-his-sick-attack/",
    "https://www.thesun.co.uk/travel/family/",
    "https://www.thesun.co.uk/fabulous/23038848/suncream-mistakes-how-to-avoid/",
    "https://www.thesun.co.uk/topic/social-media/",
    "https://www.tiktok.com/@gemmamccartan/video/7537995809485262102",
    "https://www.thesun.co.uk/topic/parenting/",
    "https://www.thesun.co.uk/topic/tiktok/",
    "https://www.thesun.co.uk/topic/body-shapes/",
    "https://www.thesun.co.uk/news/32897510/sun-club-membership/",
    "https://www.thesun.co.uk/fabulous/18405156/skincare-expert-putting-suncream-on-wrong-never-get-burnt/",
    "https://www.thesun.co.uk/topic/influencers/",
    "https://www.thesun.co.uk/fabulous/36291727/easy-75-hour-job-3-day-weekend/",
    "https://www.thesun.co.uk/health/36146029/anti-suncream-influencers-dangerous/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "sun cream",
      "weight": 0.1179268
    },
    {
      "name": "spray sun cream",
      "weight": 0.11297548
    },
    {
      "name": "cream",
      "weight": 0.084069386
    },
    {
      "name": "The best sun cream hack",
      "weight": 0.07557724
    },
    {
      "name": "the spray sun cream",
      "weight": 0.06667461
    },
    {
      "name": "the sun cream",
      "weight": 0.06254013
    },
    {
      "name": "Gemma McCartan",
      "weight": 0.061728936
    },
    {
      "name": "mums best sun cream hack",
      "weight": 0.060949545
    },
    {
      "name": "eyes",
      "weight": 0.058752224
    },
    {
      "name": "Gemma",
      "weight": 0.058205977
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Weather"
    }
  ],
  "taxonomies": [
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.669921875
    }
  ],
  "sentiment": {
    "positive": 0.40038252,
    "negative": 0.21933797,
    "neutral": 0.38027954
  },
  "summary": "A UK mum, Gemma McCartan, has shared a 'genius' trick to guarantee no tears when applying sun cream for her children. The trick involves using spoons when applying spray sun cream, which is often difficult for children who dislike having it applied. Instead of wrestling her son Max to close his eyes, she uses two spoons over his eyes and then applies the cream to his face. This technique ensures a seamless application without causing any irritation. The video of this trick has been viewed 200,800 times and has been praised by parents and followers alike. The importance of sun cream in skincare routines is also highlighted by dermatologist Andrea Suarez, who stressed the importance of protecting your skin from the sun.",
  "shortSummary": "A Savvy mum's \"best sun cream hack ever” involves spoons, making applying spray cream more fun for children, while emphasizing the importance of daily sunscreen use.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7cd6bde747c74bc8bb8fc4b985ce97b1",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "A UK mother, Gemma McCartan, shared a creative sun cream application hack using spoons to prevent tears during the process. By placing spoons over her children's eyes, she was able to spray sun cream without it irritating their eyes, making the experience more enjoyable. The video showcasing this trick has gained significant attention on social media, with many parents praising its effectiveness and the sense of control it gives children.",
  "argos_id": "B54CCNJ0D"
}