{
  "url": "https://finance.yahoo.com/news/guggenheim-reiterates-sell-tesla-tsla-230626944.html",
  "authorsByline": "Ghazal Ahmed",
  "articleId": "0b0ee8e4da584d46972a47d016fda019",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/insidermonkey.com/98a64c7bd4d70dbd9748849d899a46a7",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T23:06:26+00:00",
  "addDate": "2025-08-14T23:18:05.721342+00:00",
  "refreshDate": "2025-08-14T23:18:05.721342+00:00",
  "score": 1.0,
  "title": "Guggenheim Reiterates Sell on Tesla (TSLA) Despite FSD and Robotaxi Updates",
  "description": "Tesla, Inc. (NASDAQ:TSLA) is one the AI Stocks Analysts Are Watching Closely. On August 12, Guggenheim analyst Ronald Jewsikow reiterated a Sell rating on the stock with a $175.00 price target. The firm said that it is sticking with its sell rating and that it is cautious on the company’s full self-driving. CEO Elon Musk unveiled some […]",
  "content": "Tesla, Inc. (NASDAQ:TSLA) is one the AI Stocks Analysts Are Watching Closely. On August 12, Guggenheim analyst Ronald Jewsikow reiterated a Sell rating on the stock with a $175.00 price target. The firm said that it is sticking with its sell rating and that it is cautious on the company’s full self-driving.\n\nCEO Elon Musk unveiled some important updates around both the Robotaxi operations in Austin and the upcoming FSD model. The updates were made in a series of posts on X over the weekend.\n\nWhile Tesla shares “somewhat paradoxically” rallied on the news, names like Uber and Lyft who were previously sensitive to Tesla autonomy, did too. The firm considers this as “mixed signals from the market.”\n\n“On the Robotaxi operations in Austin, CEO Musk indicated it would be open to the public next month, which we believe is earlier than investor expectations and a sign of confidence in the service and feedback from the invite-only riders to date. We believe the expanded FSD model has positive implications for bulls focused on the potential for TSLAs fleet eventually becoming Robotaxis (positive read on inference compute), and the opening of the Austin Robotaxi experience to the public is a key step on the growth path of inviting a potentially more critical set of consumers. While safety drivers will remain, and no timeline has been provided for their removal, bulls have been willing to overlook the optics of safety drivers in TSLA vehicles, and we see no reason why that would change now.”\n\nTesla, Inc. (NASDAQ:TSLA) is an automotive and clean energy company that leverages advanced artificial intelligence in its autonomous driving technology and robotics initiatives.\n\nWhile we acknowledge the potential of TSLA as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock.\n\nREAD NEXT: 10 AI Stocks Investors Are Watching Closely and 10 AI Stocks Analysts Are Watching Closely.",
  "medium": "Article",
  "links": [
    "https://www.insidermonkey.com/blog/three-megatrends-one-overlooked-stock-massive-upside-1548959/",
    "https://www.insidermonkey.com/blog/10-ai-stocks-analysts-are-watching-closely-2-1589696/?singlepage=1",
    "https://www.insidermonkey.com/blog/10-ai-stocks-analysts-are-watching-closely-2-1589696/",
    "https://finance.yahoo.com/quote/TSLA",
    "https://www.insidermonkey.com/blog/10-ai-stocks-investors-are-watching-closely-3-1590156/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "certain AI stocks",
      "weight": 0.09148279
    },
    {
      "name": "TSLA vehicles",
      "weight": 0.082189344
    },
    {
      "name": "TSLA",
      "weight": 0.0777175
    },
    {
      "name": "greater upside potential",
      "weight": 0.07142295
    },
    {
      "name": "Tesla autonomy",
      "weight": 0.0707479
    },
    {
      "name": "Tesla shares",
      "weight": 0.07056911
    },
    {
      "name": "Guggenheim analyst Ronald Jewsikow",
      "weight": 0.068219826
    },
    {
      "name": "Tesla",
      "weight": 0.06664064
    },
    {
      "name": "CEO Elon Musk",
      "weight": 0.06427479
    },
    {
      "name": "safety drivers",
      "weight": 0.06318904
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.93115234375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.87890625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.8427734375
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Brand)/Tesla Motors",
      "score": 0.64599609375
    },
    {
      "name": "/News/Technology News",
      "score": 0.486572265625
    }
  ],
  "sentiment": {
    "positive": 0.46118376,
    "negative": 0.0885357,
    "neutral": 0.45028055
  },
  "summary": "Guggenheim has reiterated its Sell rating on Tesla, Inc. (NASDAQ:TSLA) despite CEO Elon Musk's updates regarding the Robotaxi operations in Austin and the upcoming FSD model. The firm is cautious about the company’s full self-driving capabilities, citing mixed signals from the market. While Tesla shares initially rose on the news, other companies like Uber and Lyft also saw increased interest. Gugganheim analyst Ronald Jewsikow believes the expanded FSD could have positive implications for the potential for the company's fleet to eventually become Robotaxis, a positive read on inference compute. The company also acknowledges the potential of TSLA as an investment, but believes certain AI stocks offer greater upside potential and carry less downside risk.",
  "shortSummary": "Guggenheim analyst Ronald Jewsikow reiterated Tesla’s Sell rating despite recent updates on FSD and Robotaxi, emphasizing ongoing risks and potential upside.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4edadd7df45540719f11e6008f45673b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.insidermonkey.com/blog/three-megatrends-one-overlooked-stock-massive-upside-1548959/",
      "text": "There’s a once-in-a-generation convergence happening right now. Three unstoppable megatrends are reshaping the global economy—and one under-the-radar stock is perfectly positioned to profit from all of them.\nThis isn’t a flashy AI stock or a speculative play. It’s the infrastructure backbone of the future—and it’s trading at a bargain.\nLet me explain.\nTrend #1: The AI Arms Race\nArtificial intelligence is the most transformational force since the steam engine—and it’s just getting started.\nBut behind every ChatGPT prompt and robotic breakthrough is something few investors are thinking about:\nPower. Lots of it.\nWall Street is pouring hundreds of billions into artificial intelligence—training smarter chatbots, automating industries, and building the digital future. But there’s one urgent question few are asking:\nWhere will all of that energy come from?\nEven Sam Altman, the founder of OpenAI, issued a stark warning: “AI depends on an energy breakthrough.”\nElon Musk was even more blunt:\n“AI will run out of electricity by next year.”\nAs the world chases faster, smarter machines, a hidden crisis is emerging behind the scenes. Power grids are strained. Electricity prices are rising. Utilities are scrambling to expand capacity.\nAnd that’s where the real opportunity lies…\nOne little-known company—almost entirely overlooked by most AI investors—could be the ultimate backdoor play. It’s not a chipmaker. It’s not a cloud platform. But it might be the most important AI stock in the US.\nAs demand from AI data centers explodes, this company is gearing up to profit from the most valuable commodity in the digital age: electricity.\nThe “Toll Booth” Operator of the AI Energy Boom\n- It owns critical nuclear energy infrastructure assets, positioning it at the heart of America’s next-generation power strategy.\n- It’s one of the only global companies capable of executing large-scale, complex EPC (engineering, procurement, and construction) projects across oil, gas, renewable fuels, and industrial infrastructure.\n- It plays a pivotal role in U.S. LNG exportation—a sector about to explode under President Trump’s renewed “America First” energy doctrine.\nWhile investors pile into chip stocks with sky-high valuations, this company is quietly supplying the electricity that makes AI possible. No matter who wins the AI race—Microsoft, Google, Amazon, Meta—this company gets paid.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nTrend #2: Trump’s Tariff Strategy Could Trigger a U.S. LNG Export Boom\nDonald Trump has made one thing clear: he’s coming back to renegotiate global trade—on America’s terms.\nHis top priority? Narrowing the U.S. trade deficit. And this time, he’s not just targeting Chinese imports—he’s taking aim at every trade partner who’s been running a surplus at America’s expense.\nTrump’s team is already working behind the scenes to revise trade deals with Japan, Europe, and South Korea. And while the media focuses on tariffs and quotas, savvy investors are watching where the real money will flow:\nInto American LNG.\nHere’s why: The U.S. is sitting on a massive glut of natural gas—thanks to the shale boom. Domestic prices are near historic lows, while Europe and parts of Asia are paying 3–5x more for the same fuel. It’s the perfect imbalance.\nAnd Trump knows it.\nThat’s why he’s pressuring our trading partners to buy American energy as part of future trade agreements. It’s a simple way to cut the trade deficit without slapping tariffs on U.S. consumers.\nThat sets the stage for a massive wave of U.S. LNG exports, backed by political momentum and international demand.\nNow here’s where our stock comes in…\nOur stock is a tollbooth operator in this booming sector. This company builds the infrastructure that makes LNG exports possible—the pipelines, terminals, and systems that physically move U.S. gas to global buyers.\nIf Trump succeeds in tying LNG purchases to trade deals—and all signs suggest he will—this company will be printing money on every contract signed. The more the world buys American gas, the more this company earns.\nAnd this isn’t some hypothetical “if.” The groundwork is already being laid:\n- Europe is scrambling to replace Russian gas permanently.\n- Japan is actively sourcing non-Chinese, non-Russian LNG.\n- India and South Korea are deepening energy ties with the U.S.\n- New terminals are being planned and permitted in anticipation of the coming surge.\nTrump’s tariff threats may dominate the headlines—but his behind-the-scenes LNG diplomacy could be the real financial windfall for U.S. energy companies.\nAnd our pick is sitting in the perfect spot to benefit.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nTrend #3: The Great Onshoring Boom—And the $9 Billion Clue in Indiana\nFor decades, America offshored its industrial base. Now, that trend is reversing—and fast.\nFrom semiconductors to pharmaceuticals, manufacturing is coming back to U.S. soil. Rising geopolitical tensions, Trump-era tariffs, and global supply chain shocks have forced companies to rethink their entire operating models. The result? A tidal wave of onshoring—and our stock is riding it like a pro.\nJust look at what’s happening in Lebanon, Indiana.\nPharma giant Eli Lilly is investing $9 billion into two state-of-the-art manufacturing facilities at the LEAP Lebanon Innovation and Research District. This is one of the largest life sciences manufacturing investments in U.S. history—and it’s not a one-off.\nOur company—a global leader in engineering, procurement, and construction management (EPCM)—has already been awarded a $3.2 billion contract for this project. That’s not a preliminary deal. This is full notice to proceed. Shovels are in the ground. Steel is going up. Money is already flowing.\nAnd this is just the beginning.\nThe Lilly project is a bellwether for what’s coming: dozens of similar large-scale facilities across the country, spanning sectors from biotech to clean energy to advanced manufacturing. Each one will require complex infrastructure, deep engineering know-how, and flawless execution.\nThat’s exactly what our company delivers.\nThis isn’t speculative future revenue. This is high-margin, long-duration, politically supported work—backed by blue-chip clients and megatrends. And as more companies race to bring operations home, our stock is in the pole position to win contract after contract.\nn fact, you can think of it this way:\nWherever America rebuilds its industrial backbone, this company gets paid.\nIt’s not just an AI play. It’s not just an energy play. It’s also the ultimate onshoring pick-and-shovel stock—a contractor to the next American manufacturing supercycle.\nAnd while Wall Street focuses on headlines, smart investors are loading up on the company quietly collecting billion-dollar checks behind the scenes.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nBuilt for the Future: Zero Debt, Cash to Deploy, and AI in Its Sights\nWhile most energy and utility firms are buried under mountains of debt and coughing up hefty interest payments just to appease bondholders…\nThis company is completely debt-free.\nIn fact, it’s sitting on a war chest of cash—equal to nearly one-third of its entire market cap.\nIt also owns a huge equity stake in another red-hot AI play, giving investors indirect exposure to multiple AI growth engines without paying a premium.\nAnd here’s what the smart money has started whispering…\nThe Hedge Fund Secret That’s Starting to Leak Out\nThis stock is so off-the-radar, so absurdly undervalued, that some of the most secretive hedge fund managers in the world have begun pitching it at closed-door investment summits.\nThey’re sharing it quietly, away from the cameras, to rooms full of ultra-wealthy clients.\nWhy? Because excluding cash and investments, this company is trading at less than 7 times earnings.\nAnd that’s for a business tied to:\n- The AI infrastructure supercycle\n- The onshoring boom driven by Trump-era tariffs\n- A surge in U.S. LNG exports\n- And a unique footprint in nuclear energy—the future of clean, reliable power\nYou simply won’t find another AI and energy stock this cheap… with this much upside.\nThis isn’t a hype stock. It’s not riding on hope.\nIt’s delivering real cash flows, owns critical infrastructure, and holds stakes in other major growth stories.\nThis is your chance to get in before the rockets take off!\nThe Reveal: Our Top Short-Term Stock Pick for 2025\nThis is the moment when most newsletters put up a paywall and ask you to spend $99.99 to find out the name of the stock.\nBut we’re not doing that today.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nAt Insider Monkey, we believe in earning your trust first—by delivering real value, upfront. We’re confident that once you see the quality of our research and the strength of our ideas, you’ll want to subscribe on your own terms.\nSo here it is—our top short-term stock pick of 2025:\n👉 Fluor Corporation (Ticker: FLR)\nWhen we published our premium report at the end of April, FLR was trading around $35 per share. Based on everything we’ve laid out—from the AI infrastructure boom to the LNG export surge and the American manufacturing revival—we believe FLR is poised to double over the next 12 to 24 months.\nAnd this isn’t just a recommendation—it’s a conviction.\nI personally took a double-sized position in my own portfolio. That’s how strongly I believe in Fluor’s upside.\nThis is our free gift to you.\nWe want you to profit from it—and see firsthand the power of aligning your investments with long-term megatrends.\nIf you’re interested in going even deeper…\nIf you’d like to access our #1 long-term AI stock pick—one that we believe has 10,000% upside potential over the next decade—click here to learn more.\nWe’ve shown you what we can do.\nNow imagine what you’ll unlock as a premium subscriber."
    },
    {
      "url": "https://www.insidermonkey.com/blog/10-ai-stocks-investors-are-watching-closely-3-1590156/",
      "text": "The United States is stepping up its efforts to prevent the illegal diversion if its advanced artificial intelligence chips to China. In latest news, sources have revealed that the country has placed location tracking devices in targeted shipments of its chips. These chips, they believe, are at high risk of illegal diversions.\nThe move aims to proactively detect AI chips being diverted to locations which are under US export restrictions. The sources reveal that these tracking devices apply only to select shipments under investigation.\nThrough the trackers, the government will be able to build cases against parties who profit from violating U.S. export controls. It is said that the trackers are typically hidden in the packaging of the server shipments. However, it is not known which parties have been involved in installing them and where they were put in along the shipping route.\nFor this article, we selected AI stocks by going through news articles, stock analysis, and press releases. These stocks are also popular among hedge funds. The hedge fund data is as of Q1 2025.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\n10. Pony AI Inc. (NASDAQ:PONY)\nNumber of Hedge Fund Holders: 13\nPony AI Inc. (NASDAQ:PONY) is one of the 10 AI Stocks Investors Are Watching Closely. On August 12, the company announced its unaudited financial results for the second quarter ended June 30, 2025. It announced producing over 200 Gen-7 robotaxi vehicles as of August 11, which positions it well on track to reach its target of 1,000 vehicles by year-end.\nThe company’s second-quarter revenues increased 76% year-over-year to $21.5 million, attributed largely to its robotaxi services and licensing revenues. Robotaxi services revenues grew 158% to $1.5 million, whereas fare-charging revenues increased over 300%.\nPONY AI reports beginning mass production of its Gen-7 robotaxi models in June and July via partnerships with Guangzhou Automobile Group and Beijing Automotive Industry Corporation. Its fully-driverless commercial robotaxi services are operated across China’s four tier-one cities; whereas it has also expanded operations to Dubai, South Korea, and Luxembourg.\n“This quarter marked a significant milestone in our journey toward large-scale production and deployment, further solidifying our leadership in the Robotaxi industry. Since mass production started two months ago, over 2001 Gen-7 Robotaxi vehicles have rolled off the production line, putting us firmly on track to hit the year-end 1,000-vehicle target. Our robust Robotaxi revenues more than doubled, with fare-charging revenues surging by over 300% year-over-year. The path toward positive unit economics is also clear, as we made substantial improvements in key cost items such as remote assistance and vehicle insurance. These achievements are underpinned by our rapid scaling and operational breakthroughs in all four tier-one cities in China, coupled with expanded presence in Dubai, South Korea and Luxembourg. As we enter the second half of this pivotal year of mass production, we are driving strongly toward positive unit economics and accelerating our multi-year growth trajectory.”\n– Dr. James Peng, Chairman and Chief Executive Officer of Pony.ai.\nPony AI Inc. (NASDAQ:PONY) specializes in autonomous mobility, offering AI-driven robotruck and robotaxi services, intelligent driving software, and vehicle integration solutions.\n9. BigBear.ai Holdings, Inc. (NYSE:BBAI)\nNumber of Hedge Fund Holders: 17\nBigBear.ai Holdings, Inc. (NYSE:BBAI) ) is one of the 10 AI Stocks Investors Are Watching Closely. On August 12, H.C. Wainwright analyst Scott Buck lowered the price target on the stock to $8.00 (from $9.00) while maintaining a Buy rating. The price target cut follows BigBear.ai’s second quarter results which it posted after the markets closed on August 11th.\nThe firm discussed how the artificial intelligence company’s revenue of $32.5 million was significantly below its $41 million estimate. BigBear.ai also lowered its full-year revenue guidance to $125.0M to $140.0M, down from $160.0M and $180.0M. The firm considers this low guidance to be because of lower 2Q25 revenue coupled with disruptions in federal contracts, particularly in programs supporting the U.S. Army.\nThe firm acknowledged that these results are disappointing, but also pointed out that they shouldn’t come as a surprise.\n“While disappointing, these results should not come as a surprise given what we have heard from other reporting peers in the defense space, which have also experienced program delays. We believe revenue visibility could begin to improve as the business moves towards 2026.”\nThe firm also considers BigBear.ai to be a beneficiary of the One Big Beautiful Bill.\n“Longer term, we believe BigBear.ai is well positioned to be a beneficiary of the One Big Beautiful Bill, which substantially increases investment in areas aligned with the company’s core competencies. This includes $170.0B of incremental funding to the Department of Homeland Security. In addition, the company solidified its balance sheet during 2Q25, ending the quarter with more than $390.0M of available cash. We expect this capital to be deployed in coming quarters, through reinvestment in the business as well as complementary M&A. While we expect shares to respond negatively to 2Q25 results and change in guidance, we see an improved balance sheet and favorable industry and legislative trends as catalysts for long term growth. As a result, we suspect operating results and outlook should look materially stronger a year from now. We recommend investors take advantage of any near term weakness in BBAI shares to accumulate a position ahead of more favorable operating results. We remain Buy-rated but ave lowered our price target to $8 from $9, reflecting our lower 2026 revenue forecast.”\nBigBear.ai Holdings, Inc. (NYSE:BBAI) is an artificial intelligence specialist that provides decision intelligence solutions for national security, digital identity, supply chain and logistics, enterprise operations, and manned-unmanned teaming in autonomous systems."
    },
    {
      "url": "https://www.insidermonkey.com/blog/10-ai-stocks-analysts-are-watching-closely-2-1589696/?singlepage=1",
      "text": "In an unexpected move, China is reportedly telling companies to refrain from using Nvidia’s H20 chips after the chipmaker was recently granted approval to resume shipping.\nAccording to a Bloomberg report, authorities have told companies to avoid using the Nvidia chips, or those from AMD, for government and national security use cases.\nNvidia and similar companies were previously banned from exporting chips to China, but the Trump administration had recently granted approval for selling the chips in exchange for a stipulated percentage of the revenues.\nEven though China is now refraining from using the chips for government and national security use cases, Trump has recently called out Nvidia’s H20 chip as being “obsolete.” He also noted that he wouldn’t allow the higher-end Blackwell shipments there without a 30% to 50% decrease in performance.\nOver the weekend, a social media account connected to Chinese state media stated that the H20 chips are not “safe.”\nFor this article, we selected AI stocks by going through news articles, stock analysis, and press releases. These stocks are also popular among hedge funds. The hedge fund data is as of Q1 2025.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\n10. SoundHound AI, Inc. (NASDAQ:SOUN)\nNumber of Hedge Fund Holders: 18\nSoundHound AI, Inc. (NASDAQ:SOUN) is one of the 10 AI Stocks Analysts Are Watching Closely. On August 11, Ladenburg Thalmann analyst Glenn Mattson upgraded the stock from Neutral to Buy with a price target of $16.00 (from $9.00). The rating upgrade comes after Soundhound posted second-quarter revenue well above expectations driven by its large contract wins.\nAccording to the firm, momentum in core verticals is helping offset previous concerns about low-margin contracts from the Amelia acquisition. These are anticipated to be phased out over the next 18 months.\nIt believes that SoundHound is building a broader platform that may link automotive, restaurant and enterprise customers into a voice-enabled ecosystem. This will in turn create lead-generation revenue streams.\n“We upgrade shares to Buy and raise our PT to $16 (from $9). We continue to view Voice as one of the key early applications for AI systems. The company is a leader in this space and is adding significant utility for enterprises looking to adopt AI functionality. The Amelia acquisition still needs further integration but is providing solid benefits in terms of scale, new lead generation, and an entry into the enterprise. While valuation remains elevated, the growth and scale justify that premium, in our view. We now use a 22x multiple on our new 2027 estimate to achieve our $16 PT. This is justified by the rule of 40 peer set found in the body of the report.”\nSoundHound AI, Inc. (NASDAQ:SOUN) is a voice artificial intelligence company offering voice AI solutions to businesses.\n9. C3.ai, Inc. (NYSE:AI)\nNumber of Hedge Fund Holders: 24\nC3.ai, Inc. (NYSE:AI) is one of the 10 AI Stocks Analysts Are Watching Closely. On August 11, Wolfe Research analyst Gal Munda reiterated an Underperform rating on the stock with a $15.00 price target. The rating affirmation follows the company’s first quarter fiscal 2026 results.\nOn Friday, the company reported that it sees preliminary revenue of $70.2 million-$70.4 million, an estimated 33% below the midpoint of its previous Q1 guidance for $100 million-$109 million.\nThe adjusted operating loss will be $57.7 million-$59.9 million, almost twice as bad as the $23.5 million-$33.5 million loss that the company had expected.\nCompany CEO Thomas Siebel said that sales results during the quarter were “completely unacceptable” but driven by “disruptive effect” of the reorganization and his ongoing health issues.\nWolfe Research noted that it believes F1Q26 results have been a “negative surprise that will likely drive shares materially lower despite the restructuring of the sales organization.”\n“In July, the company announced a search for a successor to the CEO, and in the 8-K filing (link to filing here), it did not reiterate guidance, which we viewed as a risk to expectations. We believe F1Q26 results were a negative surprise that will likely drive shares materially lower despite the restructuring of the sales organization. Given the disappointing F1Q26 results, we believe FY26 revenue guidance could be revised significantly lower or potentially pulled entirely. Reiterate UP and $15 PT. “\nC3.ai, Inc. (NYSE:AI) is an enterprise artificial intelligence (AI) software company involved in building and operating enterprise-scale AI applications and accelerating digital transformation.\n8. Atlassian Corporation (NASDAQ:TEAM)\nNumber of Hedge Fund Holders: 44\nAtlassian Corporation (NASDAQ:TEAM) is one of the 10 AI Stocks Analysts Are Watching Closely. On August 11, Stephens analyst Brett Huff lowered the price target on the stock to $202.00 (from $221.00) while maintaining a Equal Weight rating.\nThe price target cut follows Atlassian’s mixed 4Q, guided FY1Q light, and guided mixed FY26.\nDespite the PT cut, Stephens pointed out to several factors supporting the stock:\n“(1) data refuting worry that developer AI coding tools will slow growth\n(2) getting FY26 guide done w/o too much pain/deceleration (+18% YOY)\n(3) a reiteration of FY27’s >20% total rev CAGR growth guide,\n(4) commentary/data giving confidence in multiple growth drivers to keep TEAM in high teens growth range LT\n(5) some worry got built when stock traded down ~8% in trading session before reporting AMC yesterday. “\nThe firm believes that AI-related demand fears are overblown and stock price is reasonable. Nevertheless, it isn’t going against market sentiment considering much of the growth is being pushed to later years.\n“While we think AI-driven seat headwind fears are overblown and despite more reasonable valuation (trading 6.3x EV/FY2E rev), we don’t want to fight sentiment driven by AI and back-half loaded/FY27-loaded growth needed to meet guidance, so remaining EW. Updating target from $221 to $202 (based on 7.6x EV/FY2 rev vs. post-COVID 10.6x average).”\nAtlassian Corporation (NASDAQ:TEAM) is a global software company that designs, develops, licenses, and maintains various software products worldwide.\n7. Fortinet, Inc. (NASDAQ:FTNT)\nNumber of Hedge Fund Holders: 62\nFortinet, Inc. (NASDAQ:FTNT) is one of the 10 AI Stocks Analysts Are Watching Closely. On August 11, Susquehanna lowered the firm’s price target on the stock to $80 from $110 and kept a Neutral rating on the shares.\nAccording to the firm, Fortinet delivered a fine 2Q and raised its guidance across most metrics. The firm likes the company, its market opportunity, and large firewall refresh cycle, the risk/reward appears balanced at current levels.\nFortinet, Inc. (NASDAQ:FTNT), a cybersecurity company, provides enterprise-level next-generation firewalls and network security solutions, leveraging artificial intelligence across its cybersecurity products.\n6. Dell Technologies Inc. (NYSE:DELL)\nNumber of Hedge Fund Holders: 63\nDell Technologies Inc. (NYSE:DELL) is one of the 10 AI Stocks Analysts Are Watching Closely. On August 11, the company announced updates to its Dell AI Data Platform, helping customers better support the full lifecycle of AI workloads.\nThe AI Data Platform aims to enhance unstructured data ingestion, transformation, retrieval and compute performance to streamline AI development and deployment so that massive datasets can transform into reliable and high quality real-time intelligence for generative AI.\nDell has also introduced an unstructured data engine developed in collaboration with Search AI leader Elastic to improve data processing capabilities for enterprise artificial intelligence applications. The unstructured data engine aims to offer real-time, secure access to large-scale unstructured datasets for inferencing, analytics, and intelligent search.\nDeveloped in collaboration with open-source Search AI leader Elastic, the data engine will provide customers advanced vector search, semantic retrieval and hybrid keyword search capabilities for powering AI applications.\nThe company also announced that its PowerEdge R7725 server with NVIDIA RTX PRO 6000 Blackwell Server Edition GPUs will be the first 2U server platform to deliver the NVIDIA AI Data Platform reference architecture. Together, Dell and the NVIDIA AI Data Platform reference design will provide a GPU-accelerated reference architecture for AI.\n“The key to unlocking AI’s full potential lies in breaking down silos and simplifying access to enterprise data. Collaborating with industry leaders like NVIDIA and Elastic to advance the Dell AI Data Platform will help organizations accelerate innovation and scale AI with confidence.”\n-Arthur Lewis, president, Infrastructure Solutions Group, Dell Technologies.\nDell Technologies Inc. (NYSE:DELL) provides IT solutions, including servers, storage, networking, and personal computing devices, to businesses and consumers worldwide.\n5. Constellation Energy Corporation (NASDAQ:CEG)\nNumber of Hedge Fund Holders: 83\nConstellation Energy Corporation (NASDAQ:CEG) is one of the 10 AI Stocks Analysts Are Watching Closely. On August 11, Raymond James analyst J.R. Weston raised the price target on the stock to $393.00 (from $391.00) while maintaining an Outperform rating.\nRaymond James rating affirmation is a reflection of Constellation’s market leadership as the nation’s largest clean energy producer, largest nuclear fleet operator, and largest commercial-industrial retail book holder.\nThe company is also involved in two of the three nuclear data center deals announced to date, exemplifying its robust base business even without new deals. Two factors will be fueling Constellation’s double-digit EPS growth through 2030.\n“The company expects double-digit EPS growth through 2030, fueled by its nuclear fleet and surging clean energy demand. Closure and integration of private merchant generator Calpine (recently approved by both FERC and Texas regulators) will provide a catalyst stream, enhancing this low-capex story with major financial optionality through buybacks. In a high-flying subsector, CEG’s +45% YTD performance and +177% gains since January 2024 reflect its premium valuation as an established nuclear leader. We maintain our Outperform rating.”\nConstellation Energy Corporation (NASDAQ:CEG) is an energy provider specializing in clean, carbon-free energy solutions.\n4. Micron Technology, Inc. (NASDAQ:MU)\nNumber of Hedge Fund Holders: 96\nMicron Technology, Inc. (NASDAQ:MU) is one of the 10 AI Stocks Analysts Are Watching Closely. On August 11, Wolfe Research analyst Chris Caso reiterated an Outperform rating on the stock with a $160.00 price target. The rating reiteration follows Micron pre-announcing its fiscal Q4 results ahead of a competitor conference.\nMicron revealed that revenue would be approximately $500 million higher than previously expected, with gross margins about 250 basis points better than previous guidance. Better pricing, particularly in DRAM products, has driven the noted improvements.\nEPS guidance has been raised from $2.50 to $2.85, with continued demand for data center and AI products. While HBM traction is strong, some investors remain cautious about the second half of the year due to the effect of potential pull-ins on the 2H CY25 outlook and the likelihood that Samsung qualifies on HBM4/Rubin at NVDA.\n“The positive preannouncement and pricing commentary however indicate – so far, so good. More following the company’s presentation. Details. MU updated its previous guidance for its F4Q25, indicating that the midpoint of its revenue guidance is expected to be ~$500mn above its prior expectations, driving an additional ~250bps GM at the midpoint. In addition, MU anticipates OpEx to be a touch above its prior guidance, now $1.22bn (vs prior $1.20bn), driving implied OpM ~280bps higher than previous guidance to ~33.6%. EPS guidance was increased to $2.85 from $2.50. MU noted the revised guidance reflects improved pricing, particularly in DRAM, and strong execution.”\nMicron Technology, Inc. (NASDAQ:MU) develops and sells memory and storage products for data centers, mobile devices, and various industries worldwide.\n3. Vistra Corp. (NYSE:VST)\nNumber of Hedge Fund Holders: 102\nVistra Corp. (NYSE:VST) is one of the 10 AI Stocks Analysts Are Watching Closely. On August 11, CFRA analyst Daniel Rich raised the price target on the stock to $230.00 (from $215.00) while maintaining a Buy rating. The firm maintains a positive outlook toward nuclear operators and particularly assigns a premium valuation for Vistra to reflect its strong growth expectations compared to regulated utilities.\nThe firm noted that the Lotus Infrastructure gas generation acquisition announced in May 2025 will likely close in Q4 2025 of early Q1 2026. While broad-based tariff concerns did result in a major draw down of the shares, they have since recovered.\n“We anticipate that the Lotus Infrastructure gas generation acquisition will close in Q4 2025 or early Q1 2026, helping VST capture upside from rapidly rising electricity demand trends. Shares have recovered to near all-time highs after a significant drawdown in Q2 based on broad-based tariff concerns, and we look favorably on the company recently raising 2026 EBITDA guidance, which we note is not inclusive of potential upward adjustments due to the Lotus Infrastructure deal.”\nThe firm also emphasized that nuclear power is one of the relative “winners” under the OBBB legislation.\n“We also see nuclear power as one of the relative “winners” under the OBBB legislation, with tax credits maintaining their long-term status under the original IRA provisions. We expect roughly 11% EPS CAGR (on a GAAP basis) and 8% dividend CAGR from 2024-2027.”\nVistra Corp. (NYSE:VST) operates as an integrated retail electricity and power generation company.\n2. Tesla, Inc. (NASDAQ:TSLA)\nNumber of Hedge Fund Holders: 104\nTesla, Inc. (NASDAQ:TSLA) is one the 10 AI Stocks Analysts Are Watching Closely. On August 12, Guggenheim analyst Ronald Jewsikow reiterated a Sell rating on the stock with a $175.00 price target. The firm said that it is sticking with its sell rating and that it is cautious on the company’s full self-driving.\nCEO Elon Musk unveiled some important updates around both the Robotaxi operations in Austin and the upcoming FSD model. The updates were made in a series of posts on X over the weekend.\nWhile Tesla shares “somewhat paradoxically” rallied on the news, names like Uber and Lyft who were previously sensitive to Tesla autonomy, did too. The firm considers this as “mixed signals from the market.”\n“On the Robotaxi operations in Austin, CEO Musk indicated it would be open to the public next month, which we believe is earlier than investor expectations and a sign of confidence in the service and feedback from the invite-only riders to date. We believe the expanded FSD model has positive implications for bulls focused on the potential for TSLAs fleet eventually becoming Robotaxis (positive read on inference compute), and the opening of the Austin Robotaxi experience to the public is a key step on the growth path of inviting a potentially more critical set of consumers. While safety drivers will remain, and no timeline has been provided for their removal, bulls have been willing to overlook the optics of safety drivers in TSLA vehicles, and we see no reason why that would change now.”\nTesla, Inc. (NASDAQ:TSLA) is an automotive and clean energy company that leverages advance.d artificial intelligence in its autonomous driving technology and robotics initiatives.\n1. Amazon.com, Inc. (NASDAQ:AMZN)\nNumber of Hedge Fund Holders: 328\nAmazon.com, Inc. (NASDAQ:AMZN) is one of the 10 AI Stocks Analysts Are Watching Closely. On August 11, Freedom Broker analyst Egor Tolmachev raised the price target on the stock to $255.00 (from $240.00) while maintaining a Hold rating.\nThe investment bank noted how Amazon has delivered strong financial results for the second quarter, surpassing both market expectations and its own guidance across all segments. Retail efficiency gains were particularly noted.\nThe firm did note that AWS performance was mixed and Q3 profit forecast was cautious. Nevertheless, it revised its financial forecast based on its confidence in the company’s ability to mitigate geopolitical risk and monetize continued logistics improvements.\n“Q3 guidance came in well above revenue expectations but below profit forecasts, marking a second area of perceived weakness in the release. We view this as prudent management positioning in light of heightened geopolitical uncertainty. We have revised our financial forecasts upward, reflecting confidence in Amazon’s ability to mitigate geopolitical risk and monetize continued logistics improvements. Despite the negative share price reaction, we see upside potential and reiterate our Buy rating, raising our target price from $240 to $255.”\nAmazon.com Inc. (NASDAQ:AMZN) is an American technology company offering e-commerce, cloud computing, and other services, including digital streaming and artificial intelligence solutions.\nWhile we acknowledge the potential of AMZN as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an AI stock that is more promising than AMZN and that has 100x upside potential, check out our report about this cheapest AI stock.\nREAD NEXT: 10 AI Stocks in the Spotlight Today and 10 AI Stocks Analysts Are Tracking Closely.\nDisclosure: None. Insider Monkey focuses on uncovering the best investment ideas of hedge funds and insiders. Please subscribe to our free daily e-newsletter to get the latest investment ideas from hedge funds’ investor letters by entering your email address below."
    },
    {
      "url": "https://finance.yahoo.com/quote/TSLA",
      "text": "Tesla, Inc. (TSLA)\nThis price reflects trading activity during the overnight session on the Blue Ocean ATS, available 8 PM to 4 AM ET, Sunday through Thursday, when regular markets are closed.\n- Previous Close\n339.23 - Open\n335.76 - Bid 335.20 x 100\n- Ask 336.02 x 200\n- Day's Range\n330.40 - 340.47 - 52 Week Range\n202.59 - 488.54 - Volume\n72,973,667 - Avg. Volume\n103,603,291 - Market Cap (intraday)\n1.082T - Beta (5Y Monthly) 2.33\n- PE Ratio (TTM)\n197.40 - EPS (TTM)\n1.70 - Earnings Date Oct 22, 2025\n- Forward Dividend & Yield --\n- Ex-Dividend Date --\n- 1y Target Est\n306.32\nTesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive; and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners. This segment also provides services and repairs to its energy product customers, including under warranty; and various financing options to its residential customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.\nwww.tesla.com125,665\nFull Time Employees\nDecember 31\nFiscal Year Ends\nSector\nIndustry\nRecent News: TSLA\nView MoreRelated Videos: TSLA\nPerformance Overview: TSLA\nTrailing total returns as of 8/14/2025, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) .\nYTD Return\n1-Year Return\n3-Year Return\n5-Year Return\nCompare To: TSLA\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\nStatistics: TSLA\nView MoreValuation Measures\nMarket Cap\n1.09T\nEnterprise Value\n1.07T\nTrailing P/E\n202.01\nForward P/E\n181.82\nPEG Ratio (5yr expected)\n6.40\nPrice/Sales (ttm)\n12.87\nPrice/Book (mrq)\n14.16\nEnterprise Value/Revenue\n11.55\nEnterprise Value/EBITDA\n79.09\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n6.34%\nReturn on Assets (ttm)\n2.91%\nReturn on Equity (ttm)\n8.18%\nRevenue (ttm)\n92.72B\nNet Income Avi to Common (ttm)\n5.88B\nDiluted EPS (ttm)\n1.70\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n36.78B\nTotal Debt/Equity (mrq)\n16.82%\nLevered Free Cash Flow (ttm)\n1.34B\nResearch Analysis: TSLA\nView MoreResearch Reports: TSLA\nView MoreTesla: Board Announces New Pay Package for CEO Elon Musk\nTesla is a vertically integrated battery electric vehicle automaker and developer of autonomous driving software. The company has multiple vehicles in its fleet, which include luxury and midsize sedans, crossover SUVs, a light truck, and a semi truck. Tesla also plans to begin selling more affordable vehicles, a sports car, and offer a robotaxi service. Global deliveries in 2024 were a little below 1.8 million vehicles. The company sells batteries for stationary storage for residential and commercial properties including utilities and solar panels and solar roofs for energy generation. Tesla also owns a fast-charging network.\nRatingPrice TargetTesla: Board Announces New Pay Package for CEO Elon Musk\nTesla is a vertically integrated battery electric vehicle automaker and developer of autonomous driving software. The company has multiple vehicles in its fleet, which include luxury and midsize sedans, crossover SUVs, a light truck, and a semi truck. Tesla also plans to begin selling more affordable vehicles, a sports car, and offer a robotaxi service. Global deliveries in 2024 were a little below 1.8 million vehicles. The company sells batteries for stationary storage for residential and commercial properties including utilities and solar panels and solar roofs for energy generation. Tesla also owns a fast-charging network.\nRatingPrice TargetLowering EPS estimates; CEO Musk sees 'rough quarters ahead'\nTesla Inc. manufactures and sells electric vehicles, and energy generation and storage systems. The company was founded in 2003 and went public in June 2010 with an initial public offering at $17 per share. Tesla has approximately 49,000 employees. It recently moved its headquarters to Austin, Texas from Palo Alto, California and its stock is a component of the S&P 500 index.\nRatingPrice TargetThe major U.S. indices are slightly higher at midday on Friday, as earnings\nThe major U.S. indices are slightly higher at midday on Friday, as earnings news and tariff talk are atop the headlines. On the tariff front, Donald Trump is now putting 50-50 odds on whether a deal with the EU will happen by August 1, and also said that his administration has not 'had a lot of luck' in discussions with Canada. As well, there are financial press reports that the already announced U.S.-Japan deal has possibly hit a snag related to how profits will be shared on Japan's proposed investment in the U.S.\nTop Analysts: TSLA\nView MoreOverall Score\nDiscover which analysts rank highest for TSLA overall weighted by direction, price target, and price movement.\nLearn MoreDirection Score\nDiscover which analysts rank highest on predicting the directional movement of TSLA.\nLearn MorePrice Score\nDiscover which analysts rank highest on predicting the price target of TSLA.\nLearn More"
    },
    {
      "url": "https://www.insidermonkey.com/blog/10-ai-stocks-analysts-are-watching-closely-2-1589696/",
      "text": "In an unexpected move, China is reportedly telling companies to refrain from using Nvidia’s H20 chips after the chipmaker was recently granted approval to resume shipping.\nAccording to a Bloomberg report, authorities have told companies to avoid using the Nvidia chips, or those from AMD, for government and national security use cases.\nNvidia and similar companies were previously banned from exporting chips to China, but the Trump administration had recently granted approval for selling the chips in exchange for a stipulated percentage of the revenues.\nEven though China is now refraining from using the chips for government and national security use cases, Trump has recently called out Nvidia’s H20 chip as being “obsolete.” He also noted that he wouldn’t allow the higher-end Blackwell shipments there without a 30% to 50% decrease in performance.\nOver the weekend, a social media account connected to Chinese state media stated that the H20 chips are not “safe.”\nFor this article, we selected AI stocks by going through news articles, stock analysis, and press releases. These stocks are also popular among hedge funds. The hedge fund data is as of Q1 2025.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\n10. SoundHound AI, Inc. (NASDAQ:SOUN)\nNumber of Hedge Fund Holders: 18\nSoundHound AI, Inc. (NASDAQ:SOUN) is one of the 10 AI Stocks Analysts Are Watching Closely. On August 11, Ladenburg Thalmann analyst Glenn Mattson upgraded the stock from Neutral to Buy with a price target of $16.00 (from $9.00). The rating upgrade comes after Soundhound posted second-quarter revenue well above expectations driven by its large contract wins.\nAccording to the firm, momentum in core verticals is helping offset previous concerns about low-margin contracts from the Amelia acquisition. These are anticipated to be phased out over the next 18 months.\nIt believes that SoundHound is building a broader platform that may link automotive, restaurant and enterprise customers into a voice-enabled ecosystem. This will in turn create lead-generation revenue streams.\n“We upgrade shares to Buy and raise our PT to $16 (from $9). We continue to view Voice as one of the key early applications for AI systems. The company is a leader in this space and is adding significant utility for enterprises looking to adopt AI functionality. The Amelia acquisition still needs further integration but is providing solid benefits in terms of scale, new lead generation, and an entry into the enterprise. While valuation remains elevated, the growth and scale justify that premium, in our view. We now use a 22x multiple on our new 2027 estimate to achieve our $16 PT. This is justified by the rule of 40 peer set found in the body of the report.”\nSoundHound AI, Inc. (NASDAQ:SOUN) is a voice artificial intelligence company offering voice AI solutions to businesses.\n9. C3.ai, Inc. (NYSE:AI)\nNumber of Hedge Fund Holders: 24\nC3.ai, Inc. (NYSE:AI) is one of the 10 AI Stocks Analysts Are Watching Closely. On August 11, Wolfe Research analyst Gal Munda reiterated an Underperform rating on the stock with a $15.00 price target. The rating affirmation follows the company’s first quarter fiscal 2026 results.\nOn Friday, the company reported that it sees preliminary revenue of $70.2 million-$70.4 million, an estimated 33% below the midpoint of its previous Q1 guidance for $100 million-$109 million.\nThe adjusted operating loss will be $57.7 million-$59.9 million, almost twice as bad as the $23.5 million-$33.5 million loss that the company had expected.\nCompany CEO Thomas Siebel said that sales results during the quarter were “completely unacceptable” but driven by “disruptive effect” of the reorganization and his ongoing health issues.\nWolfe Research noted that it believes F1Q26 results have been a “negative surprise that will likely drive shares materially lower despite the restructuring of the sales organization.”\n“In July, the company announced a search for a successor to the CEO, and in the 8-K filing (link to filing here), it did not reiterate guidance, which we viewed as a risk to expectations. We believe F1Q26 results were a negative surprise that will likely drive shares materially lower despite the restructuring of the sales organization. Given the disappointing F1Q26 results, we believe FY26 revenue guidance could be revised significantly lower or potentially pulled entirely. Reiterate UP and $15 PT. “\nC3.ai, Inc. (NYSE:AI) is an enterprise artificial intelligence (AI) software company involved in building and operating enterprise-scale AI applications and accelerating digital transformation."
    }
  ],
  "argos_summary": "Tesla, Inc. (TSLA) is under scrutiny from analysts, with Guggenheim maintaining a Sell rating and a price target of $175, citing concerns over its full self-driving technology. CEO Elon Musk announced updates on Robotaxi operations in Austin, which are set to open to the public next month, indicating confidence in the service. Despite a mixed market reaction, Tesla's advancements in autonomous driving and AI continue to attract attention, while some analysts suggest other AI stocks may offer better investment potential.",
  "argos_id": "B88HG8GT8"
}