{
  "url": "https://www.bloomberg.com/news/videos/2025-08-15/trump-administration-said-to-discuss-stake-in-intel?srnd=phx-technology",
  "authorsByline": "bn",
  "articleId": "b883483ca15d40e2a0184afa0e0d0c93",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i_xmCWNjFbWY/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T00:34:34.084000+00:00",
  "addDate": "2025-08-15T00:39:49.383175+00:00",
  "refreshDate": "2025-08-15T00:39:49.383176+00:00",
  "score": 1.0,
  "title": "Trump Administration Said to Discuss Stake in Intel",
  "description": "The Trump administration is in talks with Intel Corp. to have the US government take a stake in the beleaguered chipmaker, according to people familiar with the plan, in the latest sign of the White House’s willingness to blur the lines between state and industry. Bloomberg's Nick Turner shares what we know so far. (Source: Bloomberg)",
  "content": "Bloomberg's also learned that the Trump administration is in talks with Intel on the US government potentially taking a stake in the company. For more on the scoop, let's get to senior tech editor Nick Turner. Nick, thanks for joining us. A lot's changed this week. At the start of the week, we had President Trump pressuring the Intel CEO Lip-bu Tan to leave. Now we've got the US government potentially buying a stake in Intel. So what's changed? Well, the two men had a meeting, so I think that laid the groundwork for these latest discussions. And it seems like he's safe at the moment. That being Lip-bu Tan and his job at Intel. But it'll be interesting to see how this deal ultimately unfolds if it happens. But it would be just sort of kind of the latest White House attempt to sort of make a private public sector agreement that that would have been pretty unusual before this administration. So what are the details of this? Can you tell us from your reporting what you found out? Because it's also understood that, you know, this could have implications for Intel's Ohio plant. Yeah, I mean, that is kind of the crux of it. We don't have a lot of details in terms of of the money involved. What we know is that this plant in Ohio, it's sort of a collection of plants that ultimately they promised would become the biggest chip making facility in the world. This that was back during the Biden administration. And since then, they've kind of scaled back those plans. They've delayed the opening of the first plant until at least 20 the 2030s. And I know that certainly there's some legislators in Ohio and who want to see this happen faster. And and it seems like a priority for the White House as well. There's interesting political optics here as well, because, you know, we've had this news of a revenue sharing deal potentially with India and AMD over the sale of chips to China. And now this potentially the government taking a stake in a publicly listed company. This is the sort of thing that you might expect the Chinese Communist Party to do, getting involved in state owned businesses. What's what's the rationale here? Is there any precedent for this? You know, I mean, there's some maybe some recent precedent, as you just mentioned, with with this administration. But I think it is kind of charting new territory for the U.S. and and it will have to sort of see how it plays out. I mean, in the case of Intel, Intel does need help. I mean, I'm not sure whether they'll arrive at a figure that will put the company on the right track, per se. But certainly it's been losing money. It's been struggling to regain its technological edge. And the current CEO has really been focused on cost cutting, which makes it all the harder for the company to make good on promises to increase domestic manufacturing, which is obviously a Trump priority.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Trump Administration",
      "weight": 0.08492113
    },
    {
      "name": "Intel",
      "weight": 0.08362773
    },
    {
      "name": "senior tech editor Nick Turner",
      "weight": 0.071112394
    },
    {
      "name": "President Trump",
      "weight": 0.07057698
    },
    {
      "name": "Trump",
      "weight": 0.063844696
    },
    {
      "name": "White House",
      "weight": 0.060046364
    },
    {
      "name": "plants",
      "weight": 0.059250847
    },
    {
      "name": "Intels Ohio plant",
      "weight": 0.05915481
    },
    {
      "name": "Stake",
      "weight": 0.057508327
    },
    {
      "name": "interesting political optics",
      "weight": 0.05740651
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.95703125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.95166015625
    },
    {
      "name": "/News/Technology News",
      "score": 0.91259765625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.65869140625
    }
  ],
  "sentiment": {
    "positive": 0.07070573,
    "negative": 0.5868314,
    "neutral": 0.3424629
  },
  "summary": "The US government is reportedly in discussions with Intel about potentially purchasing a stake in the company. This move follows a meeting between President Trump and Intel CEO Lip-bu Tan, which could potentially impact the company's Ohio plant. The deal would be the latest White House attempt to make a private public sector agreement, which would have been unusual before this administration. The potential impact of the deal could be seen as implications for the future of the Ohio plant where Intel promised to become the world's largest chip-making facility.",
  "shortSummary": "The Trump administration is in talks with Intel regarding a potential stake, potentially impacting Intel's Ohio plant, amid ongoing political tensions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "0ede17f3b53f44359499e0873ffe51ce",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The Trump administration is reportedly in discussions with Intel about the U.S. government potentially acquiring a stake in the company, following a meeting between President Trump and Intel CEO Lip-bu Tan. This development comes amid concerns over Intel's delayed plans for its Ohio chip manufacturing facility and its ongoing struggles to regain technological competitiveness. The situation raises questions about the implications of government involvement in a publicly traded company, a move that could be seen as unprecedented in the U.S. context.",
  "argos_id": "BHWWX3P8M"
}