{
  "url": "https://www.newsmax.com/politics/donald-trump-melania-trump-hunter-biden/2025/08/14/id/1222550/",
  "authorsByline": "Nicole Wells",
  "articleId": "a8b15cb63a1d49e7bde8f4d45eb3172c",
  "source": {
    "domain": "newsmax.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Palm Beach County",
      "city": "Boca Raton",
      "coordinates": {
        "lat": 26.3586885,
        "lon": -80.0830984
      }
    }
  },
  "imageUrl": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=1b8f5ad6-5a32-4818-b29b-5ca6794067a0&SiteName=Newsmax",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:16:49-04:00",
  "addDate": "2025-08-14T23:31:24.861895+00:00",
  "refreshDate": "2025-08-14T23:31:24.861897+00:00",
  "score": 1.0,
  "title": "Trump Tells Melania 'Go Forward' on Suit Against Hunter Biden",
  "description": "President Donald Trump said Thursday that he supports first lady Melania Trump's moving ahead with her threat to sue former President Joe Biden's son Hunter Biden over comments that she is linked to deceased convicted sex offender Jeffrey Epstein.",
  "content": "President Donald Trump said Thursday that he supports first lady Melania Trump's moving ahead with her threat to sue former President Joe Biden's son Hunter Biden over comments that she is linked to deceased convicted sex offender Jeffrey Epstein.\n\n\"Well, I said, 'Go forward.' You know, I've done pretty well on these lawsuits lately, and I said, 'Go forward with it,'\" Trump said during an interview.\n\nDuring an Aug. 5 appearance on the \"Channel 5 With Andrew Callaghan\" podcast, Hunter Biden claimed while responding to a question about why the Trump administration might be withholding documents related to the disgraced financier that that Epstein introduced Melania Trump to her husband.\n\nEpstein died by suicide in 2019 while awaiting trial on federal sex trafficking charges.\n\n\"Do I think that there's an actual list?\" Biden asked, referencing Epstein's rumored client list.\n\n\"No, I don't think that there's an actual list. I don't think that he was that stupid. But do I think that what they do have implicates him?\" he asked, referencing Trump.\n\n\"Yeah, I think so. You know, I mean, Epstein introduced Melania to Trump. The connections are like so wide and deep.\"\n\nIn a letter obtained by The Hill dated Aug. 6, Melania Trump's attorney said that Hunter Biden's remarks are \"false, disparaging, defamatory,\" and \"extremely salacious.\" The first lady has threatened to sue Biden for more than $1 billion in damages.\n\nOn Thursday, Trump told Fox that Epstein had \"nothing\" to do with his being introduced to his wife and blasted the news media, saying, \"They do that to demean. They make up stories.\n\n\"I mean, I can tell you exactly how it wasn't. It was another person, actually. I did meet through another person. But it wasn't Jeffrey Epstein.\n\n\"Yeah, I told her, 'Let's go ahead and do it.' I let her use my lawyers. She was very upset about it,\" Trump added.\n\nIn another appearance on Callaghan's show on Thursday, Hunter Biden was asked whether he would formally apologize to the first lady, as her lawyer had demanded to avert a lawsuit.\n\n\"F*** that. That's not going to happen,\" he said.\n\n\"First of all is, what I said was what I have heard and seen reported and written primarily from Michael Wolff,\" Biden said.\n\n\"But also dating back all the way to 2019 when The New York Times — Annie Karni and Maggie Haberman — reported that sources said Jeffrey Epstein claimed to be the person who introduced Donald Trump to Melania at that time.\"\n\nThe former first son also said that Melania Trump's threat of a lawsuit doesn't \"add up to anything other than a designed distraction.\"",
  "medium": "Article",
  "links": [
    "https://thehill.com/homenews/administration/5452941-trump-backs-melania-lawsuit-hunter-biden/",
    "https://www.newsmax.com/us/hunter-biden-melania-trump-jeffrey-epstein/2025/08/14/id/1222465/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "first lady Melania Trump",
      "weight": 0.122228004
    },
    {
      "name": "Melania Trump",
      "weight": 0.12033932
    },
    {
      "name": "Hunter Biden",
      "weight": 0.11047437
    },
    {
      "name": "Donald Trump",
      "weight": 0.102936156
    },
    {
      "name": "President Donald Trump",
      "weight": 0.101942
    },
    {
      "name": "Trump",
      "weight": 0.098989576
    },
    {
      "name": "Joe Biden",
      "weight": 0.09548903
    },
    {
      "name": "Jeffrey Epstein",
      "weight": 0.09446136
    },
    {
      "name": "Biden",
      "weight": 0.09417028
    },
    {
      "name": "Epstein",
      "weight": 0.08559012
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.93603515625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.90478515625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.85107421875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.7724609375
    },
    {
      "name": "/News/Gossip & Tabloid News/Scandals & Investigations",
      "score": 0.69873046875
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.59814453125
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.56396484375
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.55810546875
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.35498046875
    }
  ],
  "sentiment": {
    "positive": 0.044088535,
    "negative": 0.7596665,
    "neutral": 0.196245
  },
  "summary": "President Donald Trump has supported first lady Melania Trump's decision to sue former President Joe Biden's son, Hunter Biden, over comments that she is linked to deceased convicted sex offender Jeffrey Epstein. The comments were made during an appearance on the \"Channel 5 With Andrew Callaghan\" podcast, where Biden claimed that Epstein introduced Melania Trump to her husband. Despite these claims, President Donald Trump insisted that Epstein had nothing to do with the introduction. The first lady has threatened to sue Biden for over $1 billion in damages.",
  "shortSummary": "President Donald Trump supports Melania Trump's lawsuit against Hunter Biden over comments suggesting she was linked to Jeffrey Epstein.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "cba875624e5348fca4426a75b3f39b44",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "President Donald Trump supports Melania Trump's decision to sue Hunter Biden for claiming she was introduced to him by Jeffrey Epstein. Trump stated that Biden's comments are false and defamatory, and he has encouraged Melania to proceed with the lawsuit, which seeks over $1 billion in damages. Hunter Biden, in response, has refused to apologize and maintains that his remarks were based on prior reports linking Epstein to the introduction.",
  "argos_id": "CHH1OJC9C"
}