{
  "url": "https://techxplore.com/news/2025-08-quantum-alternative-gps-military-spaceplane.html",
  "authorsByline": "Samuel Lellouch",
  "articleId": "789c2bc7f6d041e39eb07b18020d00ec",
  "source": {
    "domain": "techxplore.com",
    "location": null
  },
  "imageUrl": "https://scx2.b-cdn.net/gfx/news/hires/2024/quantum.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T14:49:04-04:00",
  "addDate": "2025-08-14T18:58:05.068795+00:00",
  "refreshDate": "2025-08-14T18:58:05.068797+00:00",
  "score": 1.0,
  "title": "Quantum alternative to GPS navigation will be tested on US military spaceplane",
  "description": "A US military spaceplane, the X-37B orbital test vehicle, is due to embark on its eighth flight into space on August 21, 2025. Much of what the X-37B does in space is secret. But it serves partly as a platform for cutting-edge experiments.",
  "content": "This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility:\n\nA US military spaceplane, the X-37B orbital test vehicle, is due to embark on its eighth flight into space on August 21, 2025. Much of what the X-37B does in space is secret. But it serves partly as a platform for cutting-edge experiments.\n\nOne of these experiments is a potential alternative to GPS that makes use of quantum science as a tool for navigation: a quantum inertial sensor.\n\nSatellite-based systems like GPS are ubiquitous in our daily lives, from smartphone maps to aviation and logistics. But GPS isn't available everywhere. This technology could revolutionize how spacecraft, airplanes, ships and submarines navigate in environments where GPS is unavailable or compromised.\n\nIn space, especially beyond Earth's orbit, GPS signals become unreliable or simply vanish. The same applies underwater, where submarines cannot access GPS at all. And even on Earth, GPS signals can be jammed (blocked), spoofed (making a GPS receiver think it is in a different location) or disabled—for instance, during a conflict.\n\nThis makes navigation without GPS a critical challenge. In such scenarios, having navigation systems that function independently of any external signals becomes essential.\n\nTraditional inertial navigation systems (INS), which use accelerometers and gyroscopes to measure a vehicle's acceleration and rotation, do provide independent navigation, as they can estimate position by tracking how the vehicle moves over time. Think of sitting in a car with your eyes closed: you can still feel turns, stops and accelerations, which your brain integrates to guess where you are over time.\n\nEventually though, without visual cues, small errors will accumulate and you will entirely lose your positioning. The same goes with classical inertial navigation systems: as small measurement errors accumulate, they gradually drift off course, and need corrections from GPS or other external signals.\n\nIf you think of quantum physics, what may come to your mind is a strange world where particles behave like waves and Schrödinger's cat is both dead and alive. These thought experiments genuinely describe how tiny particles like atoms behave.\n\nAt very low temperatures, atoms obey the rules of quantum mechanics: they behave like waves and can exist in multiple states simultaneously—two properties that lie at the heart of quantum inertial sensors.\n\nThe quantum inertial sensor aboard the X‑37B uses a technique called atom interferometry, where atoms are cooled to the temperature of near absolute zero, so they behave like waves. Using fine-tuned lasers, each atom is split into what's called a superposition state, similar to Schrödinger's cat, so that it simultaneously travels along two paths, which are then recombined.\n\nSince the atom behaves like a wave in quantum mechanics, these two paths interfere with each other, creating a pattern similar to overlapping ripples on water. Encoded in this pattern is detailed information about how the atom's environment has affected its journey. In particular, the tiniest shifts in motion, like sensor rotations or accelerations, leave detectable marks on these atomic \"waves\".\n\nCompared to classical inertial navigation systems, quantum sensors offer orders of magnitude greater sensitivity. Because atoms are identical and do not change, unlike mechanical components or electronics, they are far less prone to drift or bias. The result is long duration and high accuracy navigation without the need for external references.\n\nThe upcoming X‑37B mission will be the first time this level of quantum inertial navigation is tested in space. Previous missions, such as NASA's Cold Atom Laboratory and German Space Agency's MAIUS-1, have flown atom interferometers in orbit or suborbital flights and successfully demonstrated the physics behind atom interferometry in space, though not specifically for navigation purposes.\n\nBy contrast, the X‑37B experiment is designed as a compact, high-performance, resilient inertial navigation unit for real world, long-duration missions. It moves atom interferometry out of the realms of pure science and into a practical application for aerospace. This is a big leap.\n\nThis has important implications for both military and civilian spaceflight. For the US Space Force, it represents a step towards greater operational resilience, particularly in scenarios where GPS might be denied. For future space exploration, such as to the moon, Mars or even deep space, where autonomy is key, a quantum navigation system could serve not only as a reliable backup but even as a primary system when signals from Earth are unavailable.\n\nQuantum navigation is just one part of the current, broader wave of quantum technologies moving from lab research into real-world applications. While quantum computing and quantum communication often steal headlines, systems like quantum clocks and quantum sensors are likely to be the first to see widespread use.\n\nCountries including the US, China and the UK are investing heavily in quantum inertial sensing, with recent airborne and submarine tests showing strong promise. In 2024, Boeing and AOSense conducted the world's first in-flight quantum inertial navigation test aboard a crewed aircraft.\n\nThis demonstrated continuous GPS-free navigation for approximately four hours. That same year, the UK conducted its first publicly acknowledged quantum navigation flight test on a commercial aircraft.\n\nThis summer, the X‑37B mission will bring these advances into space. Because of its military nature, the test could remain quiet and unpublicized. But if it succeeds, it could be remembered as the moment space navigation took a quantum leap forward.\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article.",
  "medium": "Article",
  "links": [
    "https://aerospace.honeywell.com/us/en/about-us/blogs/what-is-an-inertial-navigation-system",
    "https://www.boeing.com/innovation/innovation-quarterly/2025/03/beyond-gps-quantum-navigation-flight-test",
    "https://techxplore.com/tags/atoms/",
    "https://theconversation.com",
    "https://scienceexchange.caltech.edu/topics/quantum-science-explained/quantum-physics",
    "https://gps.stanford.edu/research/current-and-continuing-gpspnt-research/cyber-safety-transportation/anti-spoofing",
    "https://arxiv.org/abs/2001.10976",
    "https://theconversation.com/quantum-alternative-to-gps-navigation-will-be-tested-on-us-military-spaceplane-262967",
    "https://techxplore.com/tags/quantum+mechanics/",
    "https://www.dlr.de/en/latest/news/2017/20170123_maius-1-first-bose-einstein-condensate-generated-in-space_20337",
    "https://www.diu.mil/latest/advancing-quantum-sensing-for-the-dod-from-lab-to-orbit-within-months",
    "https://www.bbc.co.uk/programmes/w3ct5z6x",
    "https://techxplore.com/tags/quantum+computing/",
    "https://www.gov.uk/government/news/un-jammable-quantum-tech-takes-flight-to-boost-uks-resilience-against-hostile-actors",
    "https://techxplore.com/tags/navigation+systems/",
    "https://techxplore.com/partners/the-conversation/",
    "https://www.jpl.nasa.gov/missions/cold-atom-laboratory-cal/",
    "https://www.spaceforce.mil/News/Article-Display/Article/4256759/us-space-force-scheduled-to-launch-eighth-x-37b-mission/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "quantum inertial navigation",
      "weight": 0.11152206
    },
    {
      "name": "Quantum navigation",
      "weight": 0.10788748
    },
    {
      "name": "classical inertial navigation systems",
      "weight": 0.09758453
    },
    {
      "name": "navigation systems",
      "weight": 0.09705999
    },
    {
      "name": "GPS navigation",
      "weight": 0.09652282
    },
    {
      "name": "Traditional inertial navigation systems",
      "weight": 0.09603473
    },
    {
      "name": "space navigation",
      "weight": 0.09517508
    },
    {
      "name": "quantum inertial sensors",
      "weight": 0.09420264
    },
    {
      "name": "quantum inertial sensing",
      "weight": 0.08689455
    },
    {
      "name": "quantum sensors",
      "weight": 0.08612116
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Science"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.90283203125
    },
    {
      "name": "/Science/Astronomy",
      "score": 0.82666015625
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Space Technology",
      "score": 0.8193359375
    },
    {
      "name": "/Science/Physics",
      "score": 0.5634765625
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.447509765625
    },
    {
      "name": "/News/Other",
      "score": 0.335205078125
    }
  ],
  "sentiment": {
    "positive": 0.07796768,
    "negative": 0.55133855,
    "neutral": 0.3706938
  },
  "summary": "A US military spaceplane, the X-37B orbital test vehicle, is set to embark on its eighth flight into space on August 21, 2025. The X‑37B is partly used as a platform for cutting-edge experiments, including a quantum inertial sensor. This technology could revolutionize navigation in environments where GPS is unavailable or compromised. The sensor uses atom interferometry, where atoms are cooled to the temperature of near absolute zero, causing them to behave like waves and exist in multiple states simultaneously, allowing for long duration and high accuracy navigation without the need for external references. The upcoming mission will be the first time this level of quantum inertrial navigation is tested in space. This move towards a practical application for aerospace could have significant implications for the US Space Force, particularly in scenarios where GPS might be denied access to exploration destinations such as the moon, Mars or deep space.",
  "shortSummary": "The X-37B will test quantum inertial navigation technology, leveraging physics like atoms, to improve navigation in remote areas and potentially revolutionize commercial operations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "b30343b2a29d4281a9127f36d09f023f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://arxiv.org/abs/2001.10976",
      "text": "Physics > Atomic Physics\n[Submitted on 29 Jan 2020]\nTitle:Atom interferometry and its applications\nView PDFAbstract:We provide an introduction into the field of atom optics and review our work on interferometry with cold atoms, and in particular with Bose-Einstein condensates. Here we emphasize applications of atom interferometry with sources of this kind. We discuss tests of the equivalence principle, a quantum tiltmeter, and a gravimeter.\nCurrent browse context:\nphysics.atom-ph\nReferences & Citations\nBibliographic and Citation Tools\nBibliographic Explorer (What is the Explorer?)\nConnected Papers (What is Connected Papers?)\nLitmaps (What is Litmaps?)\nscite Smart Citations (What are Smart Citations?)\nCode, Data and Media Associated with this Article\nalphaXiv (What is alphaXiv?)\nCatalyzeX Code Finder for Papers (What is CatalyzeX?)\nDagsHub (What is DagsHub?)\nGotit.pub (What is GotitPub?)\nHugging Face (What is Huggingface?)\nPapers with Code (What is Papers with Code?)\nScienceCast (What is ScienceCast?)\nDemos\nRecommenders and Search Tools\nInfluence Flower (What are Influence Flowers?)\nCORE Recommender (What is CORE?)\narXivLabs: experimental projects with community collaborators\narXivLabs is a framework that allows collaborators to develop and share new arXiv features directly on our website.\nBoth individuals and organizations that work with arXivLabs have embraced and accepted our values of openness, community, excellence, and user data privacy. arXiv is committed to these values and only works with partners that adhere to them.\nHave an idea for a project that will add value for arXiv's community? Learn more about arXivLabs."
    },
    {
      "url": "https://gps.stanford.edu/research/current-and-continuing-gpspnt-research/cyber-safety-transportation/anti-spoofing",
      "text": "Anti-Spoofing\nA GPS spoofing attack attempts to “deceive” a GPS receiver by broadcasting counterfeit GPS signals, structured to resemble a set of normal GPS signals, or by rebroadcasting genuine signals captured elsewhere or at a different time. These spoofed signals may be modified in such a way as to cause the receiver to estimate its position to be somewhere other than where it actually is, or to be located where it is but at a different time, as determined by the attacker.\nSpoofing attacks have become increasingly common since 2023. One of the earliest suspected cases was the capture of a Lockheed RQ-170 drone aircraft in northeastern Iranin December 2011, that likely was the result of such an attack. Currently, multiple spoofing events are detected are detected daily using ADS-B reports from aircraft.\nFor a number of years, Stanford has been performing research on how to make GPS and GPS receivers more robust against spoofing attacks. Current research includes the following techniques:\n- Using WAAS message authentication\n- Time of arrival techniques\n- Use of antenna to distinguish direction of arrival\n- Using and comparing encrypted PY code\nThe FAA has supported Stanford’s research in this area.\nView Inside GNSS Article (PDF): A Multi-Antenna Defense Receiver-Autonomous GPS Spoofing Detectionby Paul Montgomery (Novariant, Inc), Todd Humphreys (University of Texas at Austin), Brent Ledvina (Virginia Tech), March/April 2009."
    },
    {
      "url": "https://theconversation.com/quantum-alternative-to-gps-navigation-will-be-tested-on-us-military-spaceplane-262967",
      "text": "A US military space-plane, the X-37B orbital test vehicle, is due to embark on its eighth flight into space on August 21 2025. Much of what the X-37B does in space is secret. But it serves partly as a platform for cutting-edge experiments.\nOne of these experiments is a potential alternative to GPS that makes use of quantum science as a tool for navigation: a quantum inertial sensor.\nSatellite-based systems like GPS are ubiquitous in our daily lives, from smartphone maps to aviation and logistics. But GPS isn’t available everywhere. This technology could revolutionise how spacecraft, airplanes, ships and submarines navigate in environments where GPS is unavailable or compromised.\nIn space, especially beyond Earth’s orbit, GPS signals become unreliable or simply vanish. The same applies underwater, where submarines cannot access GPS at all. And even on Earth, GPS signals can be jammed (blocked), spoofed (making a GPS receiver think it is in a different location) or disabled – for instance, during a conflict.\nThis makes navigation without GPS a critical challenge. In such scenarios, having navigation systems that function independently of any external signals becomes essential.\nTraditional inertial navigation systems (INS), which use accelerometers and gyroscopes to measure a vehicle’s acceleration and rotation, do provide independent navigation, as they can estimate position by tracking how the vehicle moves over time. Think of sitting in a car with your eyes closed: you can still feel turns, stops and accelerations, which your brain integrates to guess where you are over time.\nEventually though, without visual cues, small errors will accumulate and you will entirely lose your positioning. The same goes with classical inertial navigation systems: as small measurement errors accumulate, they gradually drift off course, and need corrections from GPS or other external signals.\nWhere quantum helps\nIf you think of quantum physics, what may come to your mind is a strange world where particles behave like waves and Schrödinger’s cat is both dead and alive. These thought experiments genuinely describe how tiny particles like atoms behave.\nAt very low temperatures, atoms obey the rules of quantum mechanics: they behave like waves and can exist in multiple states simultaneously – two properties that lie at the heart of quantum inertial sensors.\nThe quantum inertial sensor aboard the X‑37B uses a technique called atom interferometry, where atoms are cooled to the temperature of near absolute zero, so they behave like waves. Using fine-tuned lasers, each atom is split into what’s called a superposition state, similar to Schrödinger’s cat, so that it simultaneously travels along two paths, which are then recombined.\nSince the atom behaves like a wave in quantum mechanics, these two paths interfere with each other, creating a pattern similar to overlapping ripples on water. Encoded in this pattern is detailed information about how the atom’s environment has affected its journey. In particular, the tiniest shifts in motion, like sensor rotations or accelerations, leave detectable marks on these atomic “waves”.\nCompared to classical inertial navigation systems, quantum sensors offer orders of magnitude greater sensitivity. Because atoms are identical and do not change, unlike mechanical components or electronics, they are far less prone to drift or bias. The result is long duration and high accuracy navigation without the need for external references.\nThe upcoming X‑37B mission will be the first time this level of quantum inertial navigation is tested in space. Previous missions, such as Nasa’s Cold Atom Laboratory and German Space Agency’s MAIUS-1, have flown atom interferometers in orbit or suborbital flights and successfully demonstrated the physics behind atom interferometry in space, though not specifically for navigation purposes.\nBy contrast, the X‑37B experiment is designed as a compact, high-performance, resilient inertial navigation unit for real world, long-duration missions. It moves atom interferometry out of the realms of pure science and into a practical application for aerospace. This is a big leap.\nThis has important implications for both military and civilian spaceflight. For the US Space Force, it represents a step towards greater operational resilience, particularly in scenarios where GPS might be denied. For future space exploration, such as to the Moon, Mars or even deep space, where autonomy is key, a quantum navigation system could serve not only as a reliable backup but even as a primary system when signals from Earth are unavailable.\nQuantum navigation is just one part of the current, broader wave of quantum technologies moving from lab research into real-world applications. While quantum computing and quantum communication often steal headlines, systems like quantum clocks and quantum sensors are likely to be the first to see widespread use.\nCountries including the US, China and the UK are investing heavily in quantum inertial sensing, with recent airborne and submarine tests showing strong promise. In 2024, Boeing and AOSense conducted the world’s first in-flight quantum inertial navigation test aboard a crewed aircraft.\nThis demonstrated continuous GPS-free navigation for approximately four hours. That same year, the UK conducted its first publicly acknowledged quantum navigation flight test on a commercial aircraft.\nThis summer, the X‑37B mission will bring these advances into space. Because of its military nature, the test could remain quiet and unpublicised. But if it succeeds, it could be remembered as the moment space navigation took a quantum leap forward."
    },
    {
      "url": "https://scienceexchange.caltech.edu/topics/quantum-science-explained/quantum-physics",
      "text": "What Is Quantum Physics?\nQuantum physics is the study of matter and energy at the most fundamental level. It aims to uncover the properties and behaviors of the very building blocks of nature.\nWhile many quantum experiments examine very small objects, such as electrons and photons, quantum phenomena are all around us, acting on every scale. However, we may not be able to detect them easily in larger objects. This may give the wrong impression that quantum phenomena are bizarre or otherworldly. In fact, quantum science closes gaps in our knowledge of physics to give us a more complete picture of our everyday lives.\nQuantum discoveries have been incorporated into our foundational understanding of materials, chemistry, biology, and astronomy. These discoveries are a valuable resource for innovation, giving rise to devices such as lasers and transistors, and enabling real progress on technologies once considered purely speculative, such as quantum computers. Physicists are exploring the potential of quantum science to transform our view of gravity and its connection to space and time. Quantum science may even reveal how everything in the universe (or in multiple universes) is connected to everything else through higher dimensions that our senses cannot comprehend.\nThe Origins of Quantum Physics\nThe field of quantum physics arose in the late 1800s and early 1900s from a series of experimental observations of atoms that didn't make intuitive sense in the context of classical physics. Among the basic discoveries was the realization that matter and energy can be thought of as discrete packets, or quanta, that have a minimum value associated with them. For example, light of a fixed frequency will deliver energy in quanta called \"photons.\" Each photon at this frequency will have the same amount of energy, and this energy can't be broken down into smaller units. In fact, the word \"quantum\" has Latin roots and means \"how much.\"\nKnowledge of quantum principles transformed our conceptualization of the atom, which consists of a nucleus surrounded by electrons. Early models depicted electrons as particles that orbited the nucleus, much like the way satellites orbit Earth. Modern quantum physics instead understands electrons as being distributed within orbitals, mathematical descriptions that represent the probability of the electrons' existence in more than one location within a given range at any given time. Electrons can jump from one orbital to another as they gain or lose energy, but they cannot be found between orbitals.\nOther central concepts helped to establish the foundations of quantum physics:\n- Wave-particle duality: This principle dates back to the earliest days of quantum science. It describes the outcomes of experiments that showed that light and matter had the properties of particles or waves, depending on how they were measured. Today, we understand that these different forms of energy are actually neither particle nor wave. They are distinct quantum objects that we cannot easily conceptualize.\n- Superposition: This is a term used to describe an object as a combination of multiple possible states at the same time. A superposed object is analogous to a ripple on the surface of a pond that is a combination of two waves overlapping. In a mathematical sense, an object in superposition can be represented by an equation that has more than one solution or outcome.\n- Uncertainty principle: This is a mathematical concept that represents a trade-off between complementary points of view. In physics, this means that two properties of an object, such as its position and velocity, cannot both be precisely known at the same time. If we precisely measure the position of an electron, for example, we will be limited in how precisely we can know its speed.\n- Entanglement: This is a phenomenon that occurs when two or more objects are connected in such a way that they can be thought of as a single system, even if they are very far apart. The state of one object in that system can't be fully described without information on the state of the other object. Likewise, learning information about one object automatically tells you something about the other and vice versa.\nMathematics and the Probabilistic Nature of Quantum Objects\nBecause many of the concepts of quantum physics are difficult if not impossible for us to visualize, mathematics is essential to the field. Equations are used to describe or help predict quantum objects and phenomena in ways that are more exact than what our imaginations can conjure.\nMathematics is also necessary to represent the probabilistic nature of quantum phenomena. For example, the position of an electron may not be known exactly. Instead, it may be described as being in a range of possible locations (such as within an orbital), with each location associated with a probability of finding the electron there.\nGiven their probabilistic nature, quantum objects are often described using mathematical \"wave functions,\" which are solutions to what is known as the Schrödinger equation. Waves in water can be characterized by the changing height of the water as the wave moves past a set point. Similarly, sound waves can be characterized by the changing compression or expansion of air molecules as they move past a point. Wave functions don't track with a physical property in this way. The solutions to the wave functions provide the likelihoods of where an observer might find a particular object over a range of potential options. However, just as a ripple in a pond or a note played on a trumpet are spread out and not confined to one location, quantum objects can also be in multiple places—and take on different states, as in the case of superposition—at once.\nObservation of Quantum Objects\nThe act of observation is a topic of considerable discussion in quantum physics. Early in the field, scientists were baffled to find that simply observing an experiment influenced the outcome. For example, an electron acted like a wave when not observed, but the act of observing it caused the wave to collapse (or, more accurately, \"decohere\") and the electron to behave instead like a particle. Scientists now appreciate that the term \"observation\" is misleading in this context, suggesting that consciousness is involved. Instead, \"measurement\" better describes the effect, in which a change in outcome may be caused by the interaction between the quantum phenomenon and the external environment, including the device used to measure the phenomenon. Even this connection has caveats, though, and a full understanding of the relationship between measurement and outcome is still needed.\nThe Double-Slit Experiment\nPerhaps the most definitive experiment in the field of quantum physics is the double-slit experiment. This experiment, which involves shooting particles such as photons or electrons through a barrier with two slits, was originally used in 1801 to show that light is made up of waves. Since then, numerous incarnations of the experiment have been used to demonstrate that matter can also behave like a wave and to demonstrate the principles of superposition, entanglement, and the observer effect.\nThe field of quantum science may seem mysterious or illogical, but it describes everything around us, whether we realize it or not. Harnessing the power of quantum physics gives rise to new technologies, both for applications we use today and for those that may be available in the future."
    },
    {
      "url": "https://aerospace.honeywell.com/us/en/about-us/blogs/what-is-an-inertial-navigation-system",
      "text": "-\nLocation\n-\nNorth America\n-\nLatin America\n-\nAsia Pacific\n- |\n- Sales & Service Partners\n- |\n- Contact Us\n- |\n-\nSelect Shopping Cart Account\nChoose the account number for your parts ordering shopping cart. Your current cart will be saved when switching accounts.\nAccount# Account Name City Zip/Post Code CANCELPROCEEDMy Account\n-\nIndustries\nIndustries\n-\nLocation\n-\nNorth America\n-\nLatin America\n-\nAsia Pacific\n- |\n- Sales & Service Partners\n- |\n- Contact Us\n- |\nYou are browsing the product catalog for\nYou are viewing the overview and resources for\n- Blogs\n- What is An Inertial Navigation System?\nYour browser is not supported.\nFor the best experience, please access this site using the latest version of the following browsers:\nBy closing this window you acknowledge that your experience on this website may be degraded.\nWhat is An Inertial Navigation System?\nJon Thorland\nWhether you’re traveling by commercial airliner, business jet, military transport or even a new self-driving car, chances are pretty good that an inertial navigation system (INS) is playing an integral role in your journey from Point A to Point B. The modern INS is accurate, reliable and newly affordable for a number of emerging applications and markets.\nWhat is an inertial navigation system?\nAn inertial navigation system (INS) is comprised of an IMU, a global navigation satellite system (GNSS) receiver and sensor fusion software. These components work together to calculate position, orientation, and velocity to deliver critical navigation information in GNSS-denied areas like urban canyons, bridges, tunnels, mountains, parking garages and dense forests.\nThe information from the IMU is used to compute how an object has moved through three-dimensional space, what direction it’s heading and how fast it’s going. An INS often receives data from a global navigation satellite system (GNSS) receiver and fuses it with data from the IMU to provide information to the host computer about the platform’s absolute position (latitude, longitude, and altitude) and attitude (roll, pitch, and heading). The host computer on the platform (for example, an autonomous vehicle) then uses that information to complete its mission.\nThe IMU and GNSS technologies complement each other and improve the accuracy of modern navigation systems. For example, GNSS data improves the accuracy of INS data by compensating for the drift that occurs due to the accumulation of small errors in the data provided by the IMU.\nOn the other hand, it’s important to note that an INS doesn’t require GNSS or any other external references to compute an object’s position or direction. This is extremely useful in cases where GNSS signals are unavailable, blocked or interrupted, such as when a vehicle equipped with an INS travels through a tunnel.\nThe INS was one of the biggest game-changers in the history of navigation, freeing us from the days when aviators flew by the stars or relied on magnetic compasses and gimballed gyroscopes, which had severe limitations especially near the poles. Once INS solutions were installed on aircraft, they enabled a massive breakthrough by providing flight crews with unprecedented levels of situational awareness.\nInertial navigation systems have continually improved over the decades. Advances to make INS solutions smaller and less expensive have enabled adoption across a wide range of emerging markets requiring an autonomous operation.\nSince being proven in a host of aerospace applications, INS capabilities are now making inroads in the industrial world. For example, innovators are applying INS-based technologies to autonomous vehicles and in fields as diverse as manufacturing, robotics, agriculture, transportation, industrial equipment, marine, mobile mapping, oil and gas, and mining.\nHoneywell engineers are doing exciting and pioneering work aimed at applying the company’s unique expertise in inertial sensing and INS technologies to these and other industries. We have current initiatives aimed at helping customers accomplish such challenging tasks as navigating an autonomous car or remotely piloted vehicle, stabilizing a high-speed camera, enabling 3D mapping and surveying underwater pipelines.\nSign up to receive exclusive marketing e-communications including updates about our product offerings, special offers, news, and events.\nCopyright © 2025 Honeywell International Inc.\nMaximum File Size\nMaximum Files Exceeded\nDue to inactivity you will be logged out in 000 seconds.\nMaximum File Size\nMaximum Files Exceeded\nYour documents are ready for you. Please click here to open.\nMaximum File Size\nMaximum Files Exceeded\nThere is an issue with invoices zip file download. Please go back and try again later. Thanks!\nMaximum File Size\nMaximum Files Exceeded\nYour orders excel is ready for download. Please click here to download.\nMaximum File Size\nMaximum Files Exceeded\nThere is an issue with orders excel file download. Please go back and try again later. Thanks!"
    },
    {
      "url": "https://www.diu.mil/latest/advancing-quantum-sensing-for-the-dod-from-lab-to-orbit-within-months",
      "text": "Space experiment is a notable benchmark in Quantum Sensing program, marking the first in a series of operationally relevant quantum sensing demonstrations occurring across all domains\nWASHINGTON, D.C. (July 29, 2025) — The Defense Innovation Unit (DIU) and the Air Force Rapid Capabilities Office (AFRCO) X-37B program office partnered to demonstrate an emerging technology critical to the Department of Defense: the first strategic grade quantum inertial sensor in space. The payload is scheduled to be part of the eighth mission of the X-37B Orbital Test Vehicle (OTV-8) on August 21, 2025, from Kennedy Space Center, Florida.\nIn the Fall of 2023, DIU, Vector Atomic and partner Honeywell aerospace delivered the quantum inertial sensor, the first space hardware for the company. After delivery of the space experimental payload, the team fully integrated the quantum inertial measurement unit (IMU), a fundamental system needed for comprehensive inertial navigation. Extensive ground and flight tests will be executed this Fall. Lessons learned from qualifications of the space inertial sensor directly contributed to subsequent design cycles, emphasizing the benefits from rapid prototyping for emerging technology like quantum sensing. This space experiment is a notable benchmark in DIU’s Transition of Quantum Sensing (TQS) program, one in a series of operationally relevant quantum sensing demonstrations occurring across all domains.\nTQS is a collaboration between DIU, Office of the Undersecretary of Defense for Research & Engineering's Quantum (OUSD(R&E)-Quantum), and the Services, aims to accelerate fielding of quantum sensors to address strategic Joint Force needs, to include positioning, navigation, and timing (PNT) and anomaly detection missions. The collaborative approach of the TQS program combined with a mixture of startups, non-traditional government contractors, traditional defense contractors, and DoD laboratories, is vital for delivering the next generation of resilient and precise navigation capabilities. Along with the TQS inertial efforts, DIU and stakeholders are conducting field tests for magnetic, gravity aided navigation as well as anomaly detection across land, sea, air, and with this mission space- domains.\nThis quantum inertial sensor represents a notable progression for the quantum community. “Building a fully integrated, high performance atomic instrument that meets the rigor for space qualification is a positive referendum for quantum sensors as it relates to practical DoD missions. Demonstrations like the quantum inertial space experiment confirms the maturation the DoD needs to see from the quantum sensing community,” says LtCol Nicholas Estep, Director of the Emerging Technology Portfolio at DIU.\nThe opportunity to work with the X-37B program is a first for DIU, paving a path to inject new technologies in the space domain relevant to the DoD. The X-37B orbital test vehicle, a platform ideal for dynamic space operations, is well suited as a partner for a quantum PNT sensor. In addition to providing a unique experimental environment, the collaboration allowed a non-traditional company without space heritage to collaborate with traditional space integrators. The partnership between DIU and AFRCO X-37B program could open the aperture for emerging companies and technology within DIU to find paths to orbit."
    },
    {
      "url": "https://www.dlr.de/en/latest/news/2017/20170123_maius-1-first-bose-einstein-condensate-generated-in-space_20337",
      "text": "MAIUS 1 – First Bose-Einstein condensate generated in space\n- The MAIUS 1 experiment was launched on 23 January 2017 at 3:30 CET on board a sounding rocket from Esrange Space Center near Kiruna in northern Sweden.\n- German scientists have, for the first time, succeeded in producing a Bose-Einstein condensate in space and using it for interferometry experiments.\n- NASA is interested in the German know-how for its Cold Atom Laboratory (CAL), a device for the investigation of ultrasound quantum gases.\nThe MAIUS 1 (Matter-Wave Interferometry in Microgravity) experiment could be described as one of the most complex experiment ever flown on a sounding rocket. MAIUS 1 was launched at 03:30 Central European Time (CET) on 23 January 2016 on board a sounding rocket from the Esrange Space Center near Kiruna in northern Sweden. During the approximately six-minute microgravity phase of the flight, German scientists succeeded in producing a Bose-Einstein condensate (BEC) in space for the first time and performing atom interferometry experiments with them. \"Bose-Einstein condensates are produced when a gas is cooled down to close to absolute zero,\" explains Rainer Forke from the Space Administration at the German Aerospace Center (Deutsches Zentrum für Luft- und Raumfahrt; DLR). \"We are delighted to be able to demonstrate that the MAIUS 1 system works perfectly in space. During the microgravity phase, around 100 individual experiments were carried out on different aspects of matter-wave interferometry.\"\nUltra-cold atoms in a mini-lab\nScientists from 11 German research facilities have, over a few years, miniaturised the technology for the production of Bose-Einstein condensates in order for the experimental set-up to fit into the payload module of a sounding rocket around two and a half metres high and 50 centimetres in diameter. \"Normally, such a device fills a whole laboratory room,\" says Stephan Seidel, scientific leader of MAIUS 1 from the University of Hannover. \"Designing a system so compact and robust that it can fly on a sounding rocket has been a major challenge for scientists and engineers.\" To produce a Bose-Einstein condensate, a cloud of atoms – in this case the researchers used rubidium atoms – must be cooled down to almost minus 273 degrees Celsius. Conventional cooling methods are not sufficient for this purpose. In a two-phase process, the movement of the atoms is therefore first decelerated using lasers – because the faster an atom moves, the higher its temperature.\nTiny lasers are installed in the MAIUS device, whose beams slow down the rubidium atoms. The particles are then loaded into an atomic trap from which they cannot escape. This trap is created by means of an atom chip on which magnetic fields are generated. The magnetic containment can be thought of as the 'walls' of the trap. After laser cooling, the second phase of the temperature reduction begins in the magnetic trap. During this, the magnetic field is reduced, so that the height of the 'walls' is reduced. Consequently, only the coldest and hence most motionless particles remain in the trap, while the more mobile atoms can surmount the lower barrier. The ultra-cold atoms produced in this way are used in MAIUS for matter-wave interferometry. \"The stimulus for extending interferometry with matter waves for as long as possible also has an important application aspect,\" says Ernst Rasel, project manager at the University of Hanover. \"The sensitivity of an atom interferometer namely scales quadratically with the free evolution time of BECs in such a measuring device, so it is not surprising that long-term satellite missions are also under consideration. The use of quantum sensors in satellites for more precise geodesy and navigation is also being discussed.\"\nGerman expertise is also in demand for NASA's ISS experiment\n\"We are very interested in German expertise for our Cold Atom Laboratory (CAL), a facility for the study of ultracold quantum gases,\" says Mark Lee from the US space agency NASA. \"CAL is scheduled for launch to the International Space Station (ISS) in June 2017.\" In 2007, as part of QUANTUS (Quantum Gases in Microgravity) – the predecessor project of MAIUS 1 – scientists succeeded in producing a Bose-Einstein condensate in microgravity for the first time. To this end, the QUANTUS system was integrated into a capsule, which was used to carry out drop-tower experiments at the Center for Applied Space Technology and Microgravity (Zentrum für angewandte Raumfahrttechnologie und Mikrogravitation; ZARM) in Bremen. The world-renowned research with QUANTUS has been an important pioneer for the MAIUS project and remains an important research platform for the preparation of further missions.\nWas Einstein right?\nThe successful launch of MAIUS 1 has demonstrated that the technology works perfectly under space conditions. Two further missions – MAIUS 2 and 3 – will follow in 2018 and 2019. On MAIUS 2, in addition to ultra-pure rubidium atoms, ultra-cold potassium atoms will be used on a sounding rocket for the first time. With MAIUS 3, the falling velocity of Bose-Einstein condensates from both atomic species is to be compared via interferometry. This is intended to test the equivalence principle, which lies at the heart of Einstein’s General Theory of Relativity. If this principle were to be refuted, the Theory of Relativity would no longer be valid without restrictions.\nBut these experiments too are just another step on the way to a long-term mission in space. The aim is to be able to use the technology on satellites or the ISS. This is because the experiments could be carried out for weeks or even months in microgravity, while in the drop tower this is only possible for about nine seconds and, during a rocket flight, for about six minutes.\nMatter-wave interferometry in space\nSimilar to light rays, the wave properties of matter can be visualised using interferometry and used for high-sensitivity measurements. MAIUS has succeeded in successfully using matter-wave interferometry with Bose-Einstein condensates for the first time in space. Carrying out the experiments under microgravity conditions enables these special quantum states to be maintained for seconds.\nGerman research network is implementing the mission\nThe MAIUS 1 project is under the scientific supervision of the Leibniz University of Hannover in collaboration with the Humboldt University and the Ferdinand Braun Institute in Berlin, ZARM of the University of Bremen, the Johannes Gutenberg University of Mainz, the University of Hamburg, the University of Ulm and the Technical University of Darmstadt. The DLR Institute of Space Systems in Bremen, the DLR 'Simulation and Software Technology' facility in Braunschweig and the DLR Mobile Rocket Base (MORABA), which also carries out the launch campaign, are also part of the research group. The project is coordinated and supported by the DLR Space Administration with funding from the German Federal Ministry of Economics and Technology (Bundesministeriums für Wirtschaft und Energie; BMWi)."
    },
    {
      "url": "https://www.gov.uk/government/news/un-jammable-quantum-tech-takes-flight-to-boost-uks-resilience-against-hostile-actors",
      "text": "Un-jammable quantum tech takes flight to boost UK’s resilience against hostile actors\nA first-of-its-kind achievement as quantum navigation tech developed in the UK has been successfully tested in flight.\n- In a commercial world-first, quantum navigation tech developed in the UK was successfully tested in flight\n- while GPS jamming is relatively rare and does not directly impact an aircraft’s flight path, quantum systems will provide another layer of security\n- the government has supported the company running the tests, Infleqtion, and their partners from across the country with nearly £8 million as part of its vision to make the UK a leading quantum-enabled economy\nIn a first-of-its-kind achievement, the UK has successfully completed commercial flight trials of advanced quantum-based navigation systems that cannot be jammed or spoofed by hostile actors.\nWhile GPS jamming is currently relatively rare and does not directly impact an aircraft’s flight path, new quantum-based Positioning, Navigation, and Timing (PNT) systems could, over time, offer one part of a larger solution to providing highly accurate and resilient navigation that complements current satellite systems – which could help ensure that the thousands of flights that take place around the world daily, proceed without disruption.\nInfleqtion, a quantum technology firm, in collaboration with aerospace companies BAE Systems and QinetiQ, completed the trials at MoD Boscombe Down in Wiltshire, with Science Minister Andrew Griffith aboard the final test flight on Thursday 9 May.\nThese tests are the first time that this sort of ground-breaking technology has been tested in the UK on an aircraft in flight, and the first such flights worldwide that have been publicly acknowledged.\nLed by Infleqtion and in collaboration with industry and academic partners, this project has received backing of nearly £8 million from the government. This funding, together with the £2.5 billion National Quantum Strategy and the National Quantum Technologies Programme, aims to cement the UK’s position as a leading quantum-enabled economy.\nScience Minister Andrew Griffith said:\nFrom passenger flights to shipping, we all depend on navigation systems that are accurate, safe and secure. The scientific research we are supporting here on quantum technology could well provide the resilience to protect our interests.\nThe fact that this technology has flown for the first time in British skies, is further proof of the UK as one of the world leaders on quantum.\nIn a series of test flights, the team led by Infleqtion has demonstrated two ground-breaking quantum technologies: the compact Tiqker optical atomic clock and a tightly confined ultra-cold-atom-based quantum system, both aboard QinetiQ’s RJ100 Airborne Technology Demonstrator, a modified aircraft.\nThe technology being tested on the flight will form part of a Quantum Inertial Navigation System (Q-INS), which has the potential to revolutionise PNT, with the system offering exceptional accuracy and resilience, independent of traditional satellite navigation using GPS.\nPNT helps us know our location, navigate, and keep track of time. The cornerstone of modern PNT technology is precision clocks. These ultra-accurate timekeepers are crucial for various applications, and portable production of ultracold atoms is another key piece of the puzzle. Ultracold atoms - atoms that have been cooled to temperatures near absolute zero (the coldest possible temperature) - are ideal for building quantum accelerometers and gyroscopes, which form the heart of a Q-INS.\nThe test is part of a project funded by UK Research and Innovation (UKRI) specifically focusing on creating quantum sensors to address the UK’s heavy reliance on GNSS/GPS for location, navigation and timing data. This dependence creates a vulnerability, as a single point of failure (like jamming or spoofing GPS signals) could disrupt critical economic, defence, and strategic activities.\nThe consortium working alongside Infleqtion includes Fraunhofer Centre for Applied Photonics, Alter Technology UK, Caledonian Photonics, Redwave Labs, PA Consulting, BAE Systems, and QinetiQ.\nInfleqtion UK President, Dr Timothy Ballance, said:\nOur recent trials mark a significant step forward in the development of quantum PNT solutions. The work we have done directly addresses the critical need to reduce our reliance on satellite navigation systems, which are vulnerable to various risks.\nThe successful flight trials demonstrate the potential of quantum technology in overcoming navigation system challenges, which is an exciting development for future applications in the aerospace industry and beyond.\nHenry White, Sensing Technology Lead - BAE Systems, said:\nThese trials are an important step forward in developing quantum technology that could ultimately offer a significant military advantage. Knowing reliably and precisely when and where any asset and sensor system are, feeds into additional options for platform design and capability. This will play a big role in supporting the development of next generation combat air systems. Working closely with wider industry and experts now, at the early stages of the technology development helps us to shape the solution in a way that ensures the technology can be integrated for military applications.\nSimon Galt, Managing Director (Air) at QinetiQ said:\nWe’re proud to be partnering with BAE Systems and Infleqtion to enable the successful trial of this cutting-edge technology, demonstrating our ability to rapidly and effectively collaborate across the defence ecosystem, combining our quantum expertise with our Airborne Technology Demonstrator jet.\nRoger McKinlay, Challenge Director Quantum Technologies at Innovate UK, part of UK Research and Innovation (UKRI), said:\nModern infrastructure is increasingly dependent on highly accurate timing and navigation derived from satellite signals. These flight tests mark the culmination of two excellent projects, funded through UKRI, which Infleqtion has had the vision to create and the deftness in leadership to execute with an outstanding team of collaborators.\nThe completion of these flight trials marks a significant milestone towards Mission 4 of the UK’s National Quantum Strategy. By 2030, this mission aims to deploy quantum navigation systems on aircraft, providing next-generation accuracy and resilience independent of satellite signals. The successful testing of an optical atomic clock, Infleqtion’s Tiqker, and core elements of a quantum inertial sensor aboard QinetiQ’s RJ100 Airborne Technology Demonstrator represents a breakthrough in airborne quantum technology.\nNotes to editors\nInfleqtion\nInfleqtion, with offices in the United States, United Kingdom, and Australia, delivers high-value quantum information precisely where it is needed. By operating at the Edge, our software-configured, quantum-enabled products deliver unmatched levels of precision and power, generating streams of high-value information for commercial organizations, the United States, and allied governments. With 16 years of ColdQuanta’s pioneering quantum research as our foundation, our hardware products and AI-powered solutions address critical market needs in positioning, navigating, and timing, global communication security and efficiency, resilient energy distribution, and accelerated quantum computing. Learn how Infleqtion is revolutionizing how we communicate, navigate, and discover at www.Infleqtion.com and connect with us on LinkedIn.\nInfleqtion UK is a wholly-owned subsidiary of the flagship commercial brand Infleqtion. Infleqtion UK has a fully equipped quantum research laboratory and established production facilities in Oxford for its UK-developed Photonically Integrated Cold Atom Source (PICAS) product. The company conducts advanced research and development in inertial sensing and advanced timing for navigation within GNSS-denied environments, radiofrequency sensors for communications and defence applications, memory modules for secure quantum networks, and quantum information platforms for computation and simulation.\nBAE Systems\nAt BAE Systems, we provide some of the world’s most advanced, technology-led defence, aerospace and security solutions. We employ a skilled workforce of around 100,000 people in around 40 countries. Working with customers and local partners, we develop, engineer, manufacture, and support products and systems to deliver military capability, protect national security, and keep critical information and infrastructure secure.\nQinetiQ\nQinetiQ is an integrated global defence and security company focused on mission-led innovation. We employ more than 8,500 highly-skilled people, committed to creating new ways of protecting what matters most; testing technologies, systems, and processes to make sure they meet operational needs; and enabling customers to deploy new and enhanced capabilities with the assurance they will deliver the performance required. Visit our website www.QinetiQ.com. Follow us on LinkedIn and Twitter @QinetiQ. Visit our blog www.QinetiQ-blogs.com.\nUK Research and Innovation\nUK Research and Innovation (UKRI) is the largest public funder of research and innovation in the UK, investing £8 billion annually spanning all disciplines and all sectors. We are nine councils, drawing on our unique breadth and depth of expertise to work with government and other stakeholders to enrich lives, by increasing our understanding of ourselves and the world around us, supporting innovative businesses and public services, and creating high-quality jobs throughout the UK."
    },
    {
      "url": "https://www.boeing.com/innovation/innovation-quarterly/2025/03/beyond-gps-quantum-navigation-flight-test",
      "text": "Beyond GPS\nTeam completes 1st quantum navigation flight test\nBy Mychaela Kekeris, Boeing Writer\nBoeing completed the world’s first recorded flight test of multiple quantum sensors in 2024, enabling an in-flight airplane to navigate without GPS for four hours.\nAlthough quantum sensors for navigation have been researched in laboratory settings for years, the test was the first known operation of the sensors on an airplane during flight. That and subsequent flights produced real-time navigation data, which is needed to field any application of the technology.\nThe quantum navigation system does not typically experience the temporary disruptions in service that can arise with current GPS or other navigational systems. The quantum navigation system’s accuracy could enable airplanes on commercial routes to navigate without GPS for the entirety of flight.\nMeasuring success\nThe team conducted the test using a six-axis quantum inertial measurement unit (IMU). The IMU was integrated into a full inertial navigation system and deployed on a Beechcraft 1900D for the series of flight tests. A quantum IMU is designed to be more accurate than conventional IMUs. The improved accuracy can lead to reductions in navigation errors from tens of kilometers at the end of a long flight to as little as tens of meters.\nThe flight test out of St. Louis showed conclusively that the quantum sensors were able to operate successfully through takeoff, landing and multiple maneuvers.\n“Boeing is leading the development of quantum technology that will help improve flight safety,” said Ken Li, Boeing Principal Senior Technical Fellow and principal investigator for quantum navigation.\nQuantum qualifications\nBoeing collaborated with California-based AOSense to design and build the quantum IMU.\n“We designed our quantum IMU for robust operation in harsh environments, and we are pleased to confirm that during the flight test the sensor performed along all input axes much as we predicted,” said AOSense president Brenton Young. AOSense has been developing quantum sensors since 2004.\nHow it works\nThe IMU uses a quantum-sensing technique called atom interferometry to detect rotation and acceleration using atoms, providing navigational accuracy and precision without a GPS reference.\nThe IMU consists of three quantum inertial sensors, each of which measures single-axis accelerations and rotations of the airplane. The IMU keeps track of the path the airplane has taken from its initial position. Boeing engineers integrated the quantum inertial sensors with additional sensors and hardware to ensure reliable performance in flight. The result was the first known quantum-enabled navigation system of its kind.\nQuick to quantum\n“The ability to safely operate in GPS-denied environments is critical to both defense and commercial applications,” said Todd Citron, Boeing chief technology officer. “This flight test shows Boeing’s innovative approach to leveraging quantum technologies for operationally relevant challenges.”\nRapid iteration and testing enabled the Boeing and AOSense team to advance technology from three single-axis sensors operating in a laboratory environment to a quantum IMU operating in flight over a span of only 15 months. During this period, the team conducted multiple laboratory, ground vehicle and flight tests, each focused on identifying improvements to increase the sensor’s capability and reliability.\n“Such rapid advancements indicate great promise for quantum sensors to be part of the next generation of navigation sensors,” said Jay Lowell, Boeing Principal Senior Technical Fellow and quantum technology research manager. “This flight test is a historic first step in that direction.”\nStar tracker\nThe flights also tested Boeing’s All Source Positioning, Navigation and Timing (ASPNT) software. The software combines information from multiple GPS-denied navigation sensing modalities, including vision-based navigation, terrain-referenced navigation, gravity-anomaly-referenced navigation, magnetic-anomaly-referenced navigation, a star tracker, and signal of opportunity (SOOP) at various levels of technology readiness levels.\nIn addition to the quantum IMU, the flights tested two other sensors: AQNav, a full stack quantum navigation system from SandboxAQ, and a day-time-capable star tracker that Boeing developed with HRL Laboratories. Pairing AQNav with the star tracker was key to developing magnetic-anomaly-referenced navigation technology.\nThe star tracker provided precise attitude and position references to support the flight tests. The star tracker’s shortwave infrared (SWIR) technology is also a unique development. Compared with star trackers used in military systems 50 years ago, the Boeing-designed system is smaller, weighs less, uses a fraction of the power, and realizes better performance.\nTwo telescopes, together with the SWIR cameras, form the main portion of the star tracker. The star tracker mounts next to a custom window that is transparent to SWIR light, making the star tracker operable.\nMagnetic measurement\nAQNav uses the Earth’s magnetic field to compare real-time measurements to a premapped magnetic field. This approach, combined with the data from the IMU, significantly anchors IMU drift by limiting potential navigation errors through a process that correlates the aircraft’s trajectory with the observed magnetic data.\nAQNav helps to ensure navigation deviations remain within an operational margin. This results in a highly reliable and accurate alternate navigation system that effectively curbs error accumulation over time, which is critical for flying in areas where GPS signals are unavailable. Designed to be unjammable, unspoofable, 24-hour, all-weather, and terrain-agnostic, AQNav is a passive technology that operates in the background without user interaction.\n“Rapid advances were greatly accelerated thanks to Boeing’s collaborative approach and their exceptional ability to integrate with SandboxAQ,” said AQNav senior hardware engineer Eddie Rodriguez. “This strong partnership, combined with our expertise in artificial intelligence modeling, allowed us to deliver an enhanced system and demonstrate its capabilities within just six months.”\nWhat's next\nBoeing will conduct a series of laboratory tests to help understand how the quantum IMU navigation sensors behave under certain environmental conditions, such as temperature and vibration. These tests will provide data for Boeing and AOSense engineers to improve the quantum navigation system’s performance, robustness and reliability. IQ"
    }
  ],
  "argos_summary": "The X-37B orbital test vehicle is set to launch its eighth mission on August 21, 2025, featuring a quantum inertial sensor designed as a potential alternative to GPS for navigation in environments where traditional signals are unavailable or compromised. This quantum sensor utilizes atom interferometry to achieve high sensitivity and accuracy, making it suitable for military and civilian applications, particularly in space exploration. The mission represents a significant advancement in quantum technology, with implications for future navigation systems that could operate independently of GPS.",
  "argos_id": "CQ3AHCG9G"
}