{
  "url": "https://www.latimes.com/business/story/2025-08-14/metas-superintelligence-dream-team-will-be-management-challenge-of-the-century",
  "authorsByline": "Jo Constantz",
  "articleId": "731968014f8d444ca9a2bfe00b4b0049",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/8a4345c/2147483647/strip/true/crop/2000x1050+0+142/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fde%2F61%2F95704e1251798b1029fc009dce63%2F1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:49:47.363000+00:00",
  "addDate": "2025-08-14T19:55:36.533151+00:00",
  "refreshDate": "2025-08-14T19:55:36.533153+00:00",
  "score": 1.0,
  "title": "Meta’s superintelligence dream team will be management challenge of the century",
  "description": "Meta Platforms Inc. is spending a fortune to assemble the brightest minds in artificial intelligence. Chief Executive Officer Mark Zuckerberg may want to note: Research suggests that packing a team with too much genius can backfire.",
  "content": "The Meta AI logo on a laptop arranged in Germantown, New York, US, on Wednesday, July 23, 2025. In April, Meta said it could spend as much as $72 billion on capital expenditures this year, with a focus on AI and the data centers used to train and run the models.\n\nMeta Platforms Inc. is spending a fortune to assemble the brightest minds in artificial intelligence. Chief Executive Officer Mark Zuckerberg may want to note: Research suggests that packing a team with too much genius can backfire.\n\nSo far, more than a dozen engineers from OpenAI have defected to Meta, joined by notable experts from Anthropic and Google’s DeepMind. Zuckerberg’s wager is that by concentrating top talent and giving them unlimited resources, he can gain ground on rivals and fast-track the development of AI systems so advanced that they will approach “artificial general intelligence,” the hypothetical point at which the model surpasses human-level capacities.\n\nAs it turns out, loading up a team with multiple superstars is not always a winning strategy, as any frustrated sports fan could tell you. Without expert management, too much talent in one group can lead to diminishing returns — or even outright failure — if egos clash and the chemistry is poor enough.\n\n“There’s this belief on Wall Street and in Silicon Valley that you just bring the most capable people, put them together and magic just happens,” said Boris Groysberg, a professor at Harvard Business School who has studied team dynamics for over two decades. “No, magic doesn’t happen. What you have in many cases is a lot of jealousy, backstabbing, sabotage.”\n\nAt Meta, keeping the superstars out of these traps is a task that falls to Alexandr Wang, the 28-year-old former CEO of Scale AI, and former GitHub Inc. CEO Nat Friedman, 48, the newly appointed leaders of Meta’s 50-person superintelligence unit.\n\nDecades of academic studies indicate the challenges they’ll face.\n\nIn the 1970s, management scholar Meredith Belbin observed that teams composed entirely of high-IQ individuals were prone to prolonged arguments, showed little cohesion and struggled to reach decisions, with members more interested in debating than collaborating.\n\nIn 2011, Groysberg and others published a study concluding that on Wall Street, after a certain point, adding more “all-star” analysts to research teams at elite firms actually hurt performance. There appeared to be a tipping point, usually reached when all-stars with overlapping areas of expertise accounted for roughly half the research team, where the analysts’ egos took over and they started gatekeeping information instead of cooperating.\n\nOther research, meanwhile, shows that a team’s performance depends a lot on how well its members communicate and collaborate. Teams that allow more turn-taking in discussions tend to have higher “collective intelligence,” regardless of the raw brainpower in the room.\n\nA couple of management principles become especially important when overseeing powerhouse teams. One is that each person’s lane must be clearly defined.\n\n“If everyone has clear swimming lanes, they’re not going to see each other as a threat,” said Lindred Greer, a professor at the University of Michigan’s Ross School of Business. If there are people with similar backgrounds and talents, Greer said that kind of duplication is ok – as long as they’re kept separate.\n\nAnother trick is to openly determine at the outset who will hold decision-making rights on key issues, otherwise competition for authority may destroy the group.\n\n“Sometimes hierarchy has a bad name — you’ve got a leader telling everybody what to do,” said Anita Williams Woolley, a professor at Carnegie Mellon University’s Tepper School of Business. “But actually, there are certain ways in which having a hierarchy helps groups coordinate.” The hierarchy can change based on the problem at hand, Woolley said, but clarity is crucial in an environment where everyone wants to be on top.\n\nAnd then there’s building group chemistry, which means developing trust between team members, communicating openly and establishing a sense of shared purpose. While there’s a lot of science to these aspects of making great teams — from Richard Hackman’s 2002 book Leading Teams to Google’s Project Aristotle — many leaders aren’t willing to put in the time it takes, Groysberg said.\n\n“We just don’t have a lot of executives and CEOs who have the rigor and patience to implement it,” he said. “I always say, if you need a high performing team on Friday, Thursday is not the day to start building it.”\n\nThough the warning applies universally, it’s especially relevant at Meta, which is assembling its superintelligence team in a hurry to catch up with Google and OpenAI.\n\nAnd then there’s the money, which almost never fails to complicate matters.\n\nWith all of Zuckerberg’s widely publicized poaching efforts, which have included the dangling of pay packages topping $200 million, compensation details for many of the new recruits have become public knowledge. That could strain team-building efforts and influence the team’s dynamics.\n\n“For many groups in that sort of setting, what people are paid is almost like wearing your rank on your sleeve in the military – you walk in and you have two stars and they have three stars,” Woolley said. “It absolutely establishes what the hierarchy is. It’ll be important for the leaders to be absolutely clear if that’s true here as well.”\n\nMichael Dell, CEO of Dell Technologies Inc., said in a recent interview that the extravagant compensation packages for new AI hires could rankle veteran Meta employees. “People generally have a sense of fairness, right? They want to be treated fairly relative to others and relative to the opportunities that they have out there in the overall market,” he said.\n\nIf discontent isn’t apparent right away, Groysberg said, that doesn’t mean it won’t manifest in the next compensation cycle.\n\nAsked to comment on the potential management challenges for the Meta Superintelligence Lab, a company spokesperson told Bloomberg, “We know there’s a lot of interest in MSL, and seemingly everyone has an opinion, but we’re just focused on doing the work to develop personal superintelligence.”\n\nZuckerberg disputes some of the press reports about the specific packages he’s offering to AI experts but defends his strategy of recruiting an all-star team, telling The Information in a recent interview that AI “is going to be something that is the most important technology in our lives. It’s going to underpin how we develop everything at the company, and it’s going to affect society very widely. So we just want to make sure that we get the best folks to work on this, from entrepreneurs to researchers to engineers working on the data and infrastructure.”\n\nZuckerberg has arguably placed his largest bet on Wang. Meta invested $14.3 billion in Scale AI, without taking full control of the company. Scale AI generated $870 million in revenue last year offering data services to train AI systems. Some of its most prominent customers, including Google and OpenAI, are reportedly cutting ties with the company in the wake of Meta’s investment, fueling debate over whether Meta’s true goal was to acquire Wang and not the 49% stake it now holds in the business.\n\nThough Wang has prodigious talent for math and science and now a successful track record as a founder — he dropped out of MIT after a year to co-found Scale AI in 2016 — neither he nor his startup has produced breakthrough AI research. At Scale AI, Wang’s team worked with an army of data-labeling contractors who provided what he described as the “picks and shovels” for the AI gold rush. At Meta, he’ll now have to earn the respect of a team of world-class AI scientists.\n\nWang has a reputation for relentlessness and set a demanding pace at Scale AI, declaring that “too much is the right amount,” as he wrote in 2024. Wang also became known for his drive to keep the organization as “talent dense” as possible, looking for people who would be able to match his ambition.\n\nAccording to Groysberg, who recently wrote a case study about Scale AI, Wang participated in weekly hiring meetings, personally reviewing each candidate’s materials and forcing managers to rigorously defend their choices. “Alex goes through every single person in every function with a fine-tooth comb,” one executive told Groysberg. “He very much cares about hiring impressive people. And the way we measure that a lot of the time is through that balance of IQ and EQ. And then you bundle that up with just an extreme amount of grit.”\n\nWhether what worked at Scale will translate to Meta remains to be seen.\n\n“I think Meta got the smartest person that I know,” Groysberg said. “In that area, they got the star. And then the question is: Can they build the star team?”",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/business/story/2025-08-01/the-ai-race-has-big-tech-spending-344-billion-this-year",
    "https://www.latimes.com/business/story/2025-08-08/metas-29-billion-deal-marks-key-moment-for-private-credit",
    "https://www.latimes.com/business/story/2025-08-08/ex-openai-deepmind-staffers-set-for-1-billion-value-in-andreessen-led-round"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "research teams",
      "weight": 0.077988565
    },
    {
      "name": "team members",
      "weight": 0.076198
    },
    {
      "name": "Teams",
      "weight": 0.074298166
    },
    {
      "name": "teams",
      "weight": 0.074298166
    },
    {
      "name": "team dynamics",
      "weight": 0.0728487
    },
    {
      "name": "great teams",
      "weight": 0.07248891
    },
    {
      "name": "powerhouse teams",
      "weight": 0.071864724
    },
    {
      "name": "Scale AI",
      "weight": 0.07010036
    },
    {
      "name": "breakthrough AI research",
      "weight": 0.062202
    },
    {
      "name": "AI systems",
      "weight": 0.06054545
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.94140625
    },
    {
      "name": "/News/Technology News",
      "score": 0.92236328125
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.875
    },
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.48583984375
    },
    {
      "name": "/Computers & Electronics/Enterprise Technology/Other",
      "score": 0.38427734375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.31689453125
    }
  ],
  "sentiment": {
    "positive": 0.051404234,
    "negative": 0.70443517,
    "neutral": 0.24416058
  },
  "summary": "Meta Platforms Inc. is investing heavily in artificial intelligence (AI) talent, with a potential $72 billion in capital expenditures this year alone. The company is using top AI minds from OpenAI, Anthropic, and Google's DeepMind to gain ground on rivals and develop advanced AI systems. However, research has shown that too much talent in one group can lead to diminishing returns or outright failure if egos clash and poor chemistry is poor enough. The task of managing the superintelligence team will be a challenge due to research studies showing that adding more “all-star” analysts to research teams at elite firms can actually increase performance. Management principles such as clearly defining each person’s lane and establishing a shared purpose for the team must be crucial, as well as preventing competition for authority.",
  "shortSummary": "Meta Platforms Inc. is investing billions in assembling superintelligence experts, emphasizing clear team dynamics and strategic strategic thinking to avoid team conflicts and sabotage.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "cad2adfcd92540b59f4762582bff5cbf",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/business/story/2025-08-01/the-ai-race-has-big-tech-spending-344-billion-this-year",
      "text": "The AI Race has Big Tech spending $344 billion this year\n- Share via\nIf there’s any lesson to take from the spending plans issued by the world’s largest technology companies over the past two weeks, it’s to never underestimate the fear of missing out.\nMicrosoft Corp., which set a $24.2 billion capital spending record last quarter, plans to drop upwards of $30 billion in the current period. Amazon.com Inc. similarly spent $31.4 billion last quarter, almost double what it dropped a year ago, and is maintaining that level of investment. Google owner Alphabet Inc. raised its capital expenditures guidance this year to $85 billion.\nThen there’s Meta Platforms Inc.: The social networking giant lifted the low end of its forecast for 2025 capital expenditures and projected that costs will continue to grow at an even faster pace next year. Altogether, the four companies are expected to spend more than $344 billion for the year, with much of it going to the data centers necessary to run AI models.\n“We’ve basically tripled capex investment in cloud due to AI,” Bloomberg Intelligence analyst Mandeep Singh said.\nThe emphasis from virtually every company executive during this earnings season was on investing as quickly as possible to get ahead. “We need the teams to execute at their very best to get the capacity in place as quickly and effectively as they can,” Microsoft Chief Financial Officer Amy Hood told analysts in a call Wednesday. Susan Li, Meta’s CFO, said the goal of its own spend is to secure the advantage “in developing the best AI models.”\nWall Street’s response has been mixed.\nMeta was rewarded — in large part because the company posted a strong second-quarter sales beat and issued a rosy revenue forecast, signaling that the billions it’s spending on AI are paying off. “On advertising, the strong performance this quarter is largely thanks to AI unlocking greater efficiency and gains across our ad system,” Chief Executive Mark Zuckerberg said on an analyst call.\nZuckerberg has plans to build several massive data centers and has been luring top AI researchers with compensation packages valued at hundreds of millions of dollars. The company recently restructured its internal AI division, now referred to as Meta Superintelligence Labs, in an effort to build human-level AI capabilities and apply that technology across its products.\nShares of the company have gained more than 8% since it reported earnings on Wednesday.\nAmazon, on the other hand, failed to convince investors that its lavish spending has been worth it. The stock was down as much as 8.1% on Friday after the company reported tepid sales from its cloud division. The results were “especially disappointing” given the strong performance from Google’s and Microsoft’s own cloud services, according to Bloomberg Intelligence.\nAnd the ongoing capital costs won’t help. The operating margin for Amazon’s cloud unit will continue to face pressure “through 2026 as capital spending ramps up,” Bloomberg Intelligence analysts Poonam Goyal and Anurag Rana said.\nAlphabet’s shares are essentially unchanged from last week when it reported earnings and issued guidance. The company raised its capital expenditures outlook by $10 billion and expects to ramp up spending even more in 2026. CEO Sundar Pichai explained that the investments are necessary to keep up with customer demand.\n“Obviously, we are seeing strong momentum across our portfolio, and especially in cloud,” Pichai told analysts in a call on July 23. “It’s a tight supply environment, and we are investing more to expand.”\nNikhil Lai, an analyst at Forrester, put it another way: If Google wants to keep up with rivals, he said, it has little choice but to follow suit. “Google’s hand is forced by OpenAI to spend tremendously on AI’s infrastructure and applications,” Lai said.\nMicrosoft tied its AI investments directly to a 39% jump in sales for its Azure cloud-computing division, which came in ahead of analysts’ estimates. “We continue to lead the AI infrastructure wave and took share every quarter this year,” CEO Satya Nadella said in a call with analysts on July 30.\n“In Microsoft’s case, the returns are good,” Gil Luria, an analyst with D.A. Davidson & Co., said in an interview. The only question now is whether Microsoft’s customers are in turn seeing a decent return on investment, he said. “That’s where the test will be,” he said. “If they don’t, they’re not going to increase that spend next year.”\nApple Inc.’s capital plans pale in comparison to its Big Tech peers. But the iPhone maker did raise its spending estimates, tying much of the increase to AI efforts. Apple’s property, plant and equipment investments totaled $9.47 billion in the nine months ended June 28, up nearly 45% from a year ago.\n“You are going to continue to see our capex grow,” CFO Kevan Parekh told analysts on Thursday. “It’s not going to be exponential growth, but it is going to grow, substantially. And a lot of that’s a function of the investments we’re making in AI.”\nUrbano and Menon write for Bloomberg."
    },
    {
      "url": "https://www.latimes.com/business/story/2025-08-08/ex-openai-deepmind-staffers-set-for-1-billion-value-in-andreessen-led-round",
      "text": "Ex-OpenAI, DeepMind staffers set for $1 billion value in Andreessen-led round\n- Share via\nVenture firm Andreessen Horowitz has agreed to lead a $200-million investment in Periodic Labs, a startup building artificial intelligence for material science, according to people familiar with the matter.\nThe agreement values Periodic Labs at $1 billion before the investment, an impressive price for a months-old company, according to the people, who asked not to be identified because the information is private.\nOpenAI had previously agreed to lead the investment, but Periodic Labs decided that Andreessen Horowitz could offer more resources, one of the people said. OpenAI is still expected to participate in the financing and potentially team up with the company, the person said. The round hasn’t closed, and terms of the deal could change.\nAndreessen Horowitz didn’t respond to a request for comment. Spokespeople for Periodic Labs and OpenAI declined to comment.\nPeriodic Labs was founded by Liam Fedus, OpenAI’s former vice president of research and a key member of the team that launched ChatGPT, and Ekin Dogus Cubuk, a former research scientist at Google’s DeepMind AI division. The idea is to use AI to study materials and potentially discover new ones.\nThe Information earlier reported some details of Periodic Labs’ fundraising plans.\nLittle has been shared about the new venture. In a March tweet announcing his departure from OpenAI, Fedus said he was excited about AI for science. He called it “one of the most strategically important areas” for OpenAI and said the company planned to “invest in and partner” with Periodic Labs.\nFedus is part of a growing group of former OpenAI staffers launching their own ventures, a cadre that’s drawn comparisons to the “PayPal mafia,” a group of prolific entrepreneurs including Elon Musk and Peter Thiel. Anthropic, the OpenAI rival, was started by ex-OpenAI executives Dario and Daniela Amodei. Thinking Machines Lab, recently valued at $10 billion, was founded by former OpenAI executive Mira Murati.\nInvestors are jostling for stakes in startups launched by alumni of OpenAI and other AI pioneers and are willing to pay lofty prices for what they see as rare talent. At the same time, larger companies are trying to retain employees with massive compensation packages worth hundreds of millions.\nSeveral other OpenAI employees — including Rhythm Garg, Linden Li and Yash Patil — recently exited the company to launch a startup called Applied Compute. The startup quickly raised funding from Benchmark, Bloomberg reported.\nBenchmark’s investment valued Applied Compute at $100 million, Upstarts Media reported. That’s still remarkably high for such an early-stage deal, though it pales in comparison with the valuation that Periodic Labs commanded — thanks to Fedus’ central role in creating ChatGPT.\nClark writes for Bloomberg."
    },
    {
      "url": "https://www.latimes.com/business/story/2025-08-08/metas-29-billion-deal-marks-key-moment-for-private-credit",
      "text": "Meta’s $29-billion deal marks key moment for private credit\n- Share via\nThe heavy hitters of private credit have been waiting for this moment for years.\nMajor lenders, which often cater to companies with dented credit, talk endlessly about the opportunities in investment-grade debt and in financing the breakneck growth of artificial intelligence. They’ve done smaller deals, but this week they caught the biggest fish yet: a $29-billion financing package for Meta Platforms Inc.’s massive data center in Louisiana.\nThat transaction, led by Pacific Investment Management Co. and Blue Owl Capital Inc., hits all the high notes: It’s a top-notch business in a hot sector. It disrupts the usual route that companies like Meta travel to get money from investors through banks. And, it’s huge.\n“Private credit has been itching to get into this space,” said John Medina, senior vice president on the global project and infrastructure finance team at Moody’s Ratings. “This deal is one of the first of its kind for private credit, and if it is successful, we would expect to see more.”\nThe biggest technology companies are in an AI arms race now, and they need cash to win. Elon Musk’s xAI Corp. recently told investors it plans to spend $18 billion on data centers, and is looking at raising debt backed by projects rather than at the corporate level. Others including Amazon.com Inc. and OpenAI Inc. are pursuing their own sites across the United States. Morgan Stanley estimates that capital expenditures on AI could exceed $3 trillion in the next three years.\nFor Meta, Pimco is leading $26 billion in debt and Blue Owl is providing $3 billion in equity. The debt portion is likely to be issued in the form of investment-grade bonds backed by the data center’s assets, people familiar with the matter said, adding that the final structure is still in flux. Morgan Stanley is advising Meta on the deal and arranging the financing.\nThe bidding war for the financing lasted months. It was competitive because private credit firms have been all-but-begging for access to the investment-grade debt world that banks dominate. Other private credit firms that grappled for the top spot include Apollo Global Management Inc. and KKR & Co., which made it to the final round, as well as Brookfield Asset Management Ltd., Blackstone Inc. and Ares Management Corp., said the people, who were not authorized to speak publicly.\nIt is the largest funding package related to a specific AI data center by a mile, with others involving xAI Corp. or Coreweave Inc. well below $10 billion. Microsoft Inc., BlackRock Inc. and the United Arab Emirates’ MGX investment vehicle are teaming up to raise $30 billion of private equity that can be leveraged to $100 billion, with Nvidia Corp. and xAI also joining in, but that money is for a series of data warehouses and energy infrastructure rather than an individual project.\nThe most recent debt deal of any kind that’s even near the size of Meta’s was a $26-billion bond sale to support Mars Inc.’s purchase of rival food-maker Kellanova in March. A group of banks put together the financing, which was funneled through to their typical investors in the syndicated market.\nPrivate credit firms have about $450 billion of dry powder to invest, according to Preqin data, and are clamoring for this kind of business.\nThe corporate acquisitions that often fuel private credit deals are practically at a standstill. And these firms aspire to more fully become rivals to traditional Wall Street banks — handling everything from advising companies to structuring their debt to providing some of it themselves. Expanding further into investment-grade deals could help make private credit a $40-trillion market, according to an estimate from Apollo.\n“This ecosystem of private investment-grade is a massive market with a huge tailwind,” Michael Zawadzki, the global chief investment officer at Blackstone’s credit and insurance unit, said last year.\nRepresentatives for Apollo, Meta, Pimco, Blue Owl, Brookfield, Blackstone, Ares and Morgan Stanley declined to comment. Those for KKR and xAI didn’t immediately respond to requests for comment.\nKKR and Energy Capital Partners last year agreed to a $50-billion partnership to accelerate the development of infrastructure for artificial intelligence. Blue Owl has helped finance AI infrastructure before, including through a $15-billion joint venture for a data center in Abilene, Texas.\nBlue Owl Chief Executive Officer Marc Lipschultz has compared the AI craze to the Gold Rush: Though lenders aren’t out there digging for treasure, they can provide the “picks and shovels” that technology firms need.\n“In this case, it takes the modern version, the data centers,” he said during a conference call on July 31. “And we are the best placed firm to help develop and to help fund those data centers.”\nArroyo and Fishlow write for Bloomberg. Laura Benitez and Kurt Wagner contributed to this report."
    }
  ],
  "argos_summary": "Meta Platforms Inc. is heavily investing in artificial intelligence, planning to spend up to $72 billion this year, with a focus on assembling a top-tier team of AI experts from companies like OpenAI and Google. However, research indicates that having too many high-caliber individuals in one team can lead to conflicts and diminished performance if not managed properly. The management of this superintelligence unit falls to Alexandr Wang and Nat Friedman, who will need to navigate potential challenges related to team dynamics and compensation disparities among new recruits and existing employees.",
  "argos_id": "CU35XJZAF"
}