{
  "url": "https://www.ajc.com/news/2025/08/after-secret-meetings-marta-names-new-interim-ceo/",
  "authorsByline": "Sara Gregory",
  "articleId": "16ef8f5d744544e69921d2f7926fd526",
  "source": {
    "domain": "ajc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "GA",
      "county": "Fulton County",
      "city": "Atlanta",
      "coordinates": {
        "lat": 33.7489924,
        "lon": -84.3902644
      }
    }
  },
  "imageUrl": "https://www.ajc.com/resizer/v2/IG65BU5PSZTTYHM2H4KGBFRMT4.jpg?auth=7cdaa9a663eb7c93882be07beaec0206bac96517c11ebaafe451b5f1f51bf707&smart=true&width=2048&height=1365",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T22:22:57.366000+00:00",
  "addDate": "2025-08-14T22:31:14.484375+00:00",
  "refreshDate": "2025-08-14T22:31:14.484377+00:00",
  "score": 1.0,
  "title": "After secret meetings, MARTA names new interim CEO",
  "description": "MARTA’s ad hoc CEO search committee met four times without public notice since July 17.",
  "content": "The discussions in those meetings led to Hunt’s selection and to the appointment of an “operations committee” that will advise him on his executive decisions.\n\nThe committee, which will meet with Hunt weekly, is made up of Peter Aman from Atlanta Mayor Andre Dickens office; Katie Kirkpatrick, head of the Atlanta Metro Chamber of Commerce; Anna Roach, executive director of the Atlanta Regional Commission; and Keith Parker, MARTA’s former chief and the current CEO of Goodwill of North Georgia.\n\nParker is the only person on the committee with transportation expertise.\n\nThere could be as many as three additional members appointed.\n\nHunt declined to speak with reporters after his appointment, but during the meeting thanked the board for their trust in him.\n\n“I’m accepting this role A) with a humble heart, B) knowing everything we need to do to move forward,” he said, adding that with everyone’s help, “I know we’re going to build an even better MARTA going forward.”\n\nThe secret board discussions were apparently contentious at times, with MARTA board member Valencia Williamson from Clayton County saying during public comment the decisions around appointing an interim have “not been easy” and divided the board at times.\n\nThose disagreements seemingly delayed the naming of an interim; Chair Jennifer Ide said the goal had been to pick someone July 24.\n\nThe search committee was supposed to gather that day, apparently, but the meeting was canceled in lieu of a full board meeting, which had been advertised. When asked why the search committee meetings had not been advertised, MARTA spokeswoman Stephany Fisher said it was a mistake and that future meetings would be.\n\nFisher said she didn’t know about the four other ad hoc meetings until Thursday.\n\nIt’s unclear when they were held. The acknowledgment they happened at all came in the resolution approved by the board naming Hunt, which Ide read aloud before the board voted. In an interview after the meeting, Ide walked that back.\n\n“I should say, we had four rounds of discussions,” she said. “We never had an in-person meeting. It was phone calls of different members of the committee deciding where we should go next.”\n\nRichard T. Griffiths, a former CNN executive and Georgia First Amendment Foundation board member, said the four meetings should have been public and disclosed as such.\n\nHe said the state’s open meetings act is clear. “If they had four meetings, those all should have been public meetings.”\n\nIde said the debate was over who to appoint and whether to go with an internal or external candidate. That led to the decision to appoint both an internal candidate and an external advising board.\n\n“This was the best solution we could come up with for not losing speed and momentum but bringing fresh thought and play,” Ide said.\n\nOne of the external candidates the board was interested in was Parker, she said, but “Goodwill wasn’t willing to do without Keith.”\n\n“This is the way that I am able to get Keith’s input, is by having him serve on the strategic committee,” Ide said.\n\nThe committee interviewed three internal candidates, she said.\n\nIn addition to Hunt, they interviewed Chief Financial Officer Kevin Hurley and Rhonda Allen, who has served as chief in an acting capacity since June. Ide said they didn’t interview external candidates but that she talked with “four or five” possibilities herself.\n\nIt’s unclear exactly what the advisory board’s role will be, or how it is different from the MARTA board, which is itself tasked with overseeing the chief. The resolution appointing the advisers said they are to work with Hunt “on a weekly basis” and with the MARTA board monthly.\n\nThe announcement of the advisory committee won praise Thursday from Atlanta Mayor Andre Dickens, who said in a statement he was encouraged the board turned to executives “who are deeply committed to the success of metro Atlanta and have experience leading transformational change efforts.”\n\n“MARTA is a critical ingredient to our success, and the Atlanta region is counting on them to build the world-class system that residents deserve,” the mayor said.\n\nKirkpatrick, from the metro chamber, was the only one of the four appointees to respond to a request for comment. She congratulated Hunt and said she is looking forward to working with him.\n\n“This is a moment that calls for bold, visible leadership,” Kirkpatrick said.\n\nMARTA has been besieged with problems in recent months. Since Greenwood’s resignation, Ide has said twice the board recognizes the urgency needed to “turn the ship around.” She said Thursday she’s aware business and civic groups are frustrated with the board itself, and members could be more transparent.\n\n“We need to talk about bad news as much as we talk about good news,” Ide said. “That’s hard as a leader, I think, to acknowledge when things aren’t going smoothly.”\n\nHunt and the advisory board will oversee MARTA and its $1.55 billion budget during a pivotal time for the agency. It is in the process of launching a bus network redesign, new rail cars and new fare gates, all of which are expected to roll out in the next year. There is also a major renovation at Five Points station and construction for the system’s first rapid bus line that are underway — and behind schedule.\n\nThere is additional pressure to ensure MARTA is ready for the World Cup next summer. Greenwood previously told The Atlanta Journal-Constitution’s editorial board the agency was “more than ready,” but several recent smaller events have had snags, most recently when an escalator malfunctioned after a Beyoncé concert.\n\nBefore his early retirement, Greenwood had led the agency as chief for almost three years and as deputy for two years before that. It’s unlikely the next chief executive and general manager will come from within, Ide said. Neither Hunt nor Allen are interested, she added.\n\nIde said the past month has shown the need to build MARTA’s internal capacity.\n\n“We need to make sure … that we are planning for successions and transitions,” she said. “Three to five years from now I would love to see a much deeper bench here.”\n\nIt’s also possible the next chief won’t come from the transit industry, an idea pushed by Atlanta’s business and civic community.\n\nThe board has selected Diversified Global to conduct a national search. Ide said the board opted against using search firms MARTA has used in the past and went with Diversified Global because they have experience running searches beyond the transportation industry.\n\n“We don’t want to limit ourselves to perhaps the same pool of candidates that that might sort of naturally come to mind,” she said.\n\nIde said she was in favor of public meetings to solicit feedback on what the board should look for in its next chief.\n\nIdeally, she said, a permanent leader would be in place before next summer’s FIFA World Cup games.",
  "medium": "Article",
  "links": [
    "https://www.ajc.com/news/2025/06/ajc-interview-marta-more-than-ready-for-world-cup-events-chief-says/",
    "https://www.ajc.com/news/2025/07/experts-brake-failure-not-weight-overload-likely-cause-of-marta-escalator-failure/",
    "https://www.ajc.com/news/atlanta-news/marta-unveils-its-futuristic-new-train-cars/JEC6OGPADRDEBA4RA2JD4VS56E/",
    "https://www.ajc.com/news/atlanta-news/more-marta-rapid-bus-delays-push-project-completion-beyond-2026-world-cup/OGUMI374XFF7RIMLOSHHFYZQSU/",
    "https://www.ajc.com/news/atlanta-news/marta-unveils-proposed-bus-service-changes-how-to-learn-more-and-give-the-agency-feedback/GFMXEA4A5NC4NGJOP4WW7E7SXU/",
    "https://www.ajc.com/news/crime/marta-to-start-five-points-station-renovation-in-may/LGX3V57NX5AUDFG6ONYMVWIJUQ/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "MARTA board member Valencia Williamson",
      "weight": 0.0886225
    },
    {
      "name": "Georgia First Amendment Foundation board member",
      "weight": 0.07320938
    },
    {
      "name": "public meetings",
      "weight": 0.072720386
    },
    {
      "name": "secret meetings",
      "weight": 0.06808264
    },
    {
      "name": "MARTA",
      "weight": 0.067705564
    },
    {
      "name": "future meetings",
      "weight": 0.06636329
    },
    {
      "name": "Atlanta Mayor Andre Dickens",
      "weight": 0.064367674
    },
    {
      "name": "MARTA spokeswoman Stephany Fisher",
      "weight": 0.063982666
    },
    {
      "name": "metro Atlanta",
      "weight": 0.06309382
    },
    {
      "name": "Atlanta Mayor Andre Dickens office",
      "weight": 0.06247301
    }
  ],
  "topics": [
    {
      "name": "Business Leaders"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.94921875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.75390625
    },
    {
      "name": "/News/Local News",
      "score": 0.69287109375
    }
  ],
  "sentiment": {
    "positive": 0.077656545,
    "negative": 0.52758574,
    "neutral": 0.39475778
  },
  "summary": "After secret board discussions, MARTA has named its new interim CEO, Hunt, following the appointment of an \"operations committee\" that will advise him on executive decisions. The committee includes Peter Aman from Atlanta Mayor Andre Dickens' office, Katie Kirkpatrick, Anna Roach, and Keith Parker, former MARTA’s former chief and current CEO of Goodwill of North Georgia. Parker is the only person on the committee with transportation expertise. The decision to appoint an external or internal candidate was made after discussions were reportedly contentious and divided the board. The resolution appointing the advisers stated they will work with Hunt weekly and monthly with the MARTA board.",
  "shortSummary": "MarTA appointed Hunt as interim CEO after secret meetings, appointing a committee led by Atlanta Mayor Andre Dickens, to advise him on executive decisions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ad69e102c5d34afe81387efe9b8d579d",
  "places": [
    {
      "osmId": "34847161",
      "suburb": "Lindbergh",
      "city": "Atlanta",
      "county": "Fulton County",
      "state": "Georgia",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Mayfair",
      "coordinates": {
        "lat": 33.814166400000005,
        "lon": -84.37075334040617
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.ajc.com/news/crime/marta-to-start-five-points-station-renovation-in-may/LGX3V57NX5AUDFG6ONYMVWIJUQ/",
      "text": "MARTA is set to start working on the Five Points Station renovation in May after 10 months of delays, officials said Thursday afternoon.\nThe announcement comes after months of disagreements between MARTA and the city of Atlanta over how to proceed with the project to transform the transit agency’s central station.\nIn February, MARTA said the city intentionally stalled approval of the demolition permits needed to begin work. Public records obtained by The Atlanta Journal-Constitution appear to show that city officials, at the direction of Mayor Andre Dickens, tied permit approval to the completion of an audit into MARTA spending.\nDickens denied holding up permits and said the city wanted the work to start.\n“Anyone that told you we were holding or delaying permits was lying to you,” Dickens said last month.\nDemolition permits were approved after an AJC story about the delays published in mid-March. City staff said their approval of the permits while the audit issue was still pending proves the two issues weren’t tied together.\nOther permits related to the project are still pending but are expected to be complete soon, spokesperson Stephany Fisher said.\n“We are in active discussions with the city to finalize the remaining permits,” Fisher said. “Our goal is to get construction started and avoid additional costs with delay.”\nThe $230 million renovation will consist of removing the existing concrete canopy and replacing it with a translucent roof, as well as adding street-level bus bays. It’s being paid for primarily with proceeds from the halfpenny sales tax Atlanta voters approved for transit expansion projects in 2016.\nMARTA is at risk of incurring fines of up to $10,000 per day for each day past last July’s planned start.\nWork is set to begin May 17, Fisher said. The whole project will take four years to complete.\nThe station will remain open to trains and pedestrians during construction, though the work will impact some routes.\nStation services at Five Points, like the police precinct, lost and found and reduced fare offices, will be relocated, with details to be announced soon, MARTA said.\nThe station soccer field, the community garden, information booth and federal building tunnel will close during construction.\nRestrooms will also close. Passengers can use restrooms at the nearby GWCC/CNN Center, Peachtree Center, Georgia State and West End stations.\nBus service changes\nStops on eight bus routes will be relocated to Forsyth Street: 3, 21, 40, 49, 55, 107, 186 and 813.\nThree routes will be detoured through downtown and will no longer stop at Five Points: 26, 42 and 816.\nSix routes that previously terminated at Five Points will terminate at Georgia State Station: 21, 42, 49, 55, 107 and 186.\nThree other routes will now terminate at King Memorial Station: 26, 813 and 899.\nOne route, 816, will now terminate at Civic Center Station.\nCobbLinc, Ride Gwinnett and Xpress commuter buses will operate as scheduled.\nAdditional bus rider impacts are expected and will be announced at a later date.\nKeep Reading\nThe Latest\nFeatured"
    },
    {
      "url": "https://www.ajc.com/news/atlanta-news/marta-unveils-its-futuristic-new-train-cars/JEC6OGPADRDEBA4RA2JD4VS56E/",
      "text": "As General Manager and CEO Collie Greenwood waved from the cockpit, train car number 1004 made its inaugural ride into MARTA’s Lindbergh Station to a noisy backdrop of train honks, cheers and Metallica’s “Enter Sandman” blasting from speakers.\nOnlookers crowded the platform with phones lifted to capture the exact moment when the transit agency’s new CQ400 railcars came into sight. It’s the first design change to MARTA’s trains since they began rolling almost half a century ago.\n“Your chariot has arrived at last,” Greenwood told those gathered before encouraging them to explore the aluminum-frame train still sporting that “new car” smell.\nCredit: Miguel Martinez/AJC\nCredit: Miguel Martinez/AJC\nThe flashy demonstration — average riders must wait until the end of the year before the new trains are actually in service — was the main attraction at Thursday’s State of MARTA address, which was hosted in partnership with the Council for Quality Growth.\nGreenwood painted a rosy picture of a transit agency that has struggled with service reliability, low ridership, and safety, focusing instead on MARTA’s wins: triple-A bond ratings, station renovations and an investment in a new train control system.\n“The state of MARTA is strong,” he said.\nAll of MARTA’s existing trains will eventually be replaced by 224 new railcars built by Stadler, a Swiss rail construction company with its U.S. headquarters in Utah. The train cars were built in Hungary and work is being completed at Stadler’s Salt Lake City plant.\nThe new trains are four cars long, all connected by an open gangway that lets riders walk from one end to the other. It’s a design popular in Europe and Asia but newer to the U.S., where it was first introduced by New York City’s transit system last year.\nThe front of the cars features a lighted “smile” that will correspond with the rail line being served, either Red, Gold, Green or Blue. The overall look is like a scene from a sci-fi movie, and display boards on the trains proclaimed “The Future is Here.”\nInside, there are 100 digital display screens with route information. Cameras and noise monitors will alert operators and law enforcement to disruptions on the train that might require intervention.\nThe trains will be outfitted with a new train control system designed by Stadler and approved by MARTA’s Board of Directors in December for $500 million. The railcars, purchased in 2019, cost $700 million total, MARTA spokeswoman Stephany Fisher said.\nThe new trains require less electricity to operate and are designed with the latest safety standards in the event of a crash, said Martin Ridder, Stadler’s U.S. CEO. They also feature redundant systems to minimize service disruptions.\nRidder said there’s no other train car like it in North America.\n“It’s got that feel and look that makes you want to take the train,” Ridder told The Atlanta Journal-Constitution.\nCredit: Miguel Martinez-Jimenez\nCredit: Miguel Martinez-Jimenez\nMARTA Board Chairperson Jennifer Ide said she thinks the new train cars are “transformational” and will give metro Atlantans a visual reminder of the changes happening at MARTA and reassure them that progress is being made.\n“It’s exciting to see all of these initiatives that have been worked on behind the scenes for a number of years come together and come to life,” Ide said in an interview.\nIde said she thinks the new trains will help draw in riders, along with efforts to allow tap-to-pay instead of fare cards and WiFi throughout the system. But she said MARTA also has to address reliability so that the system is competitive with other options.\nIde said she’d planned to take a bus to MARTA’s headquarters a day earlier but after waiting, she learned the route was canceled. On Thursday, she had her husband drop her off because it would have taken her nearly an hour by transit.\n“Even I’m not going to choose to ride 54 minutes when it’s a seven-minute drive,” Ide said. “We’ve got to figure out other ways.”\nGreenwood said in an interview that the new cars demonstrate how much MARTA cares about the quality of the ride. He said it was exhilarating to show off the new trains.\n“This train is such a visceral representation of what we mean to provide to the city of Atlanta and to metropolitan Atlanta that I think it’s going to do wonders for ridership,” Greenwood said. “I think people are going to start there and then start to figure out, well, what else can MARTA do for us if they’re putting this much care and concern and technology into the rail system?”\nCredit: Miguel Martinez-Jimenez\nCredit: Miguel Martinez-Jimenez\nMARTA has struggled more than almost every other major transit agency in the country to recover bus and train ridership that fell during the pandemic, according to a recent Federal Transit Administration report. Ridership in 15 cities has surpassed prepandemic levels but not in Atlanta, where recovery is below average and ranked second-to-last compared to other metros.\nGreenwood said it’s a challenge because of high work-from-home rates in Atlanta.\nWhile ridership hasn’t fully returned, Greenwood said the annual increases are a hopeful sign of progress. He said he hoped new residents moving to the metro will opt for transit even if former riders have developed new habits.\n“Bus and rail are going to take some time,” he said.\nThe upcoming bus network redesign should also help with ridership, Greenwood said.\nMARTA is in the process of getting feedback on the first major overall of the bus network in the transit agency’s history. The plans call for more frequent routes in some areas and will remove routes in others in exchange for on-demand rideshares. The total number of routes would drop from 113 to 79.\nThe new bus service changes are expected to go into effect by the end of 2025.\nAbout the Author\nKeep Reading\nThe Latest\nFeatured"
    }
  ],
  "argos_summary": "MARTA has appointed a new interim CEO, Hunt, and established an operations committee to advise him, which includes key local leaders with varying expertise. The board's decision-making process was contentious, leading to delays in the appointment, and there are calls for greater transparency in their meetings. As MARTA faces significant challenges, including a $1.55 billion budget and upcoming projects like a bus network redesign and station renovations, the new leadership aims to enhance the agency's operations and prepare for the World Cup next summer.",
  "argos_id": "DWDBAQCMI"
}