{
  "url": "https://www.yahoo.com/entertainment/articles/7-best-movies-streaming-netflix-204044983.html?_guc_consent_skip=1755204681",
  "authorsByline": "Alex Welch",
  "articleId": "f6946a627f9f4e77ab9e9a5784240e0b",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/063d68e65e2d8e6f7c0b5ccf2174aa261be9f049d668bf21d39dfa1cbc18a8b3/ynews/resizefill_w1200/https://media.zenfs.com/en/thewrap.com/8859ed706a5cc0b7f62dc678ed8042ca",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T20:40:44+00:00",
  "addDate": "2025-08-14T20:55:41.844199+00:00",
  "refreshDate": "2025-08-14T20:55:41.844200+00:00",
  "score": 1.0,
  "title": "The 7 Best New Movies Streaming on Netflix in August",
  "description": "Here are the seven best new movies streaming on Netflix in August 2025, including \"Clueless,\" \"Groundhog Day\" and \"Jurassic Park.\"",
  "content": "Netflix’s August film slate includes originals like “My Oxford Year,” “The Thursday Murder Club” and “Fixed.” Those are not the streaming service’s only new additions this month, though. Netflix has also added a diverse batch of existing film classics to its library in August, including the hangout comedy to end all hangout comedies and the movie that finally landed one of Hollywood’s greatest directors his first, long overdue Oscar.\n\nHere are TheWrap’s picks for some of the best movies that have started streaming on Netflix in August.\n• None The 7 Best New Movies Streaming on Netflix in August\n• None All the ‘Peter Pan’ Connections in ‘Alien: Earth,’ Explained: Wendy, Neverland and Lost Boys\n• None ‘Nobody Wants This’ Season 2 First Look Shows Kristen Bell and Adam Brody Securely Snuggled Up\n• None ‘Miss Governor’ Cast and Character Guide: Who’s Who in Tyler Perry’s Netflix Comedy?\n\n“Clueless,” director Amy Heckerling’s clever, endlessly quotable adaptation of Jane Austen’s “Emma,” is one of the most beloved comedies of the 1990s for a reason. Set in mid-’90s Southern California, the film features a host of memorable performances — namely, those given by its three female leads, Alicia Silverstone, Stacey Dash and Brittany Murphy.\n\nBreezy and practically overflowing with confidence, “Clueless” is a comedy that manages to poke fun at its characters and satirize their lives while also embracing and celebrating their youthful optimism and well-intentioned naiveté. It knows how to both love its characters and laugh at them, and if you want to know why it is often regarded as one of Hollywood’s greatest teen films, that is just one of the reasons.\n\nNetflix is not lacking when it comes to films and TV shows suitable for the whole family. This month, though, the streaming service has added a contemporary family-friendly classic to its platform in 2010’s “Despicable Me.” Starring Steve Carell as Gru, a supervillain with an army of yellow-skinned henchmen, the film launched an entire, multimedia franchise that is still alive and kicking 15 years later.\n\nHowever, none of its sequels or spin-offs have been able to truly match the original’s imaginative creativity or charmingly ridiculous spirit. Carell’s vocal performance as Gru has reached iconic status at this point, and all it takes is revisiting “Despicable Me” one time to remember why moviegoers fell so in love with the character — and his many minions — back in 2010.\n\nWriter-director Richard Linklater’s “Dazed and Confused” is a love letter to the 1970s, friendship, young love and youth itself. Set in 1976, the film follows an ensemble of high school and middle school students in Austin, Texas, as they cross paths, haze, hang out and fall in love with each other over the course of just one day. Featuring memorable performances from then unknown, up-and-coming stars like Ben Affleck, Milla Jovovich, Parker Posey and Matthew McConaughey, “Dazed and Confused” is a memory piece overflowing with distinct, lived-in characters, moments and details.\n\nIt’s a coming-of-age film about an era that now sits in the distant past and thus fittingly captures the momentary, impermanent nature of school, youth and, well, everything. In a world where nothing seems to last forever, though, the magic of “Dazed and Confused” remains unwavering and undying.\n\nIt’s hilarious. It’s thrilling. It’s absurdly violent. It’s the film that finally netted director Martin Scorsese his first and only Oscar to date. It’s “The Departed.”\n\nA remake of the 2002 Hong Kong crime drama “Infernal Affairs,” Scorsese’s film follows an assortment of police officers and gangsters as the tensions between them are gradually stoked by a cop pretending to be a gangster (Leonardo DiCaprio) and a gangster pretending to be a cop (Matt Damon). Tightly paced even at 151 minutes long, “The Departed” is an explosive, relentlessly violent film that refuses to pull a single punch.\n\nIt will make your heart race and your jaw drop, and it will do all of that even before it reaches its deranged, maniacal gut-punch of a third act.\n\nDespite spawning countless, inferior imitators and popularizing the time-loop genre, “Groundhog Day” has truly stood the test of time. Co-written by Danny Rubin and director Harold Ramis, the film’s story of a narcissistic weatherman (Bill Murray) who finds himself stuck in an unending, seemingly inescapable time loop has lost none of its comedic, romantic or dramatic power in the 32 years since it first hit theaters.\n\nThat is due, in no small part, to the brilliance of the lead performance given by Bill Murray, who is so perfectly cast as the film’s cynical protagonist that it is impossible to imagine any other actor playing the role. Behind the camera, though, it is Ramis who finds the right balance of observational, deeply human humor and fantastical comedy. In doing so, he ensured that audiences could connect to “Groundhog Day” in spite of its ridiculous premise, and moviegoers have continued to love it for well over three decades now.\n\nFew movies inspire pure wonder as powerfully as “Jurassic Park” does. Steven Spielberg’s 1993 adaptation of the Michael Crichton novel of the same name is a maximalist sci-fi thriller about reckless technological advancement and the danger of human arrogance. It is one of the most beloved and revered films that Spielberg has ever made, and its release in the same year as the filmmaker’s Best Picture-winning “Schindler’s List” cemented him as one of the most formidable and capable directors that Hollywood has ever seen.\n\n“Jurassic Park” is part monster movie, part coming-of-age adventure, part family drama and part action epic, and it all just works. The film’s sequels have been chasing its greatness for the past 30 years. While some have come close, none have managed to find the same, potent combination of awe-inspiring technical brilliance and cinematic artistry that makes “Jurassic Park” one of Hollywood’s signature blockbusters.\n\nThe “Fast and Furious” series has emerged over the past 24 years as one of Hollywood’s biggest franchises, and it still has not yet reached its conclusion. While the series has produced a handful of memorable entries, 2011’s “Fast Five” remains the most rightly revered and beloved. This heist-centric installment not only introduces Dwayne Johnson’s Luke Hobbs, but it also marks the moment when the “Fast and Furious” franchise began to focus more on its now-signature, physics-defying set pieces.\n\nThe resulting effect was a jolt of renewed life that the franchise has been riding the high of ever since. As entertaining as “Fast & Furious 6,” “Furious 7” and — to a lesser extent — “The Fate of the Furious” all are, though, “Fast Five” still hits harder than any other film that the franchise has produced up to this point. It’s an exhilarating slice of pulpy blockbuster filmmaking that does not take itself too seriously, even as it delivers one cheer-worthy vehicular stunt and fistfight after another.\n\nThe post The 7 Best New Movies Streaming on Netflix in August appeared first on TheWrap.",
  "medium": "Article",
  "links": [
    "https://www.thewrap.com/best-new-movies-on-netflix-august-2025/?utm_source=yahoo-news&utm_medium=web&utm_campaign=more-from-the-wrap",
    "https://www.thewrap.com",
    "https://www.thewrap.com/join-pro/?utm_source=article&amp;utm_medium=site&amp;utm_campaign=articlePROpromo&amp;utm_id=070825",
    "https://www.thewrap.com/miss-governor-cast-character-guide-netflix-tyler-perry/?utm_source=yahoo-news&utm_medium=web&utm_campaign=more-from-the-wrap",
    "https://www.thewrap.com/alien-earth-peter-pan-connections-easter-eggs-explained/?utm_source=yahoo-news&utm_medium=web&utm_campaign=more-from-the-wrap",
    "https://www.thewrap.com/best-new-movies-on-netflix-august-2025/",
    "https://www.thewrap.com/nobody-wants-this-season-2-netflix-first-look-photos/?utm_source=yahoo-news&utm_medium=web&utm_campaign=more-from-the-wrap"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "films",
      "weight": 0.07422126
    },
    {
      "name": "existing film classics",
      "weight": 0.07151238
    },
    {
      "name": "part monster movie",
      "weight": 0.053783383
    },
    {
      "name": "director Martin Scorsese",
      "weight": 0.050600898
    },
    {
      "name": "director Harold Ramis",
      "weight": 0.050166063
    },
    {
      "name": "Netflix’s August film slate",
      "weight": 0.049347557
    },
    {
      "name": "part family drama",
      "weight": 0.04922723
    },
    {
      "name": "memorable performances",
      "weight": 0.047672506
    },
    {
      "name": "Hollywood’s greatest teen films",
      "weight": 0.046841096
    },
    {
      "name": "Few movies",
      "weight": 0.04646246
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.89990234375
    },
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.87353515625
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.50439453125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.30859375
    }
  ],
  "sentiment": {
    "positive": 0.5072861,
    "negative": 0.08708356,
    "neutral": 0.40563038
  },
  "summary": "Netflix's August film slate includes originals, films such as \"My Oxford Year,\" \"The Thursday Murder Club,\" and \"Fixed. The company also added a diverse selection of existing film classics to its library. The list includes a selection of films from the 1990s, including \"Clueless,\" an adaptation of Jane Austen’s “Emma,” and “The Departed.” TheWrap lists these films as some of the best new movies streaming on Netflix in August.",
  "shortSummary": "Netflix’s August offerings include new releases like “Clueless\" and “Dazed and Confused,\" while “Despicable Me\" and \"Peter Pan\" also feature prominently, with notable new additions and classic films.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "98f40f67418c4968a7f9d0c0f37c8657",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Netflix's August lineup features original films like \"My Oxford Year\" and \"The Thursday Murder Club,\" alongside classic favorites such as \"Clueless,\" \"Despicable Me,\" and \"Jurassic Park.\" The streaming service also highlights notable films like \"The Departed,\" which earned Martin Scorsese his first Oscar, and the iconic comedy \"Groundhog Day.\" Additionally, the beloved heist film \"Fast Five\" continues to be a standout in the long-running franchise.",
  "argos_id": "F5IPHFVLF"
}