{
  "url": "https://nypost.com/2025/08/14/us-news/former-delaware-gov-mike-castle-dead-at-86/",
  "authorsByline": "Associated Press",
  "articleId": "cf2ab5d6fdbb409ab81f85477a3016aa",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/109604729.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T23:58:09+00:00",
  "addDate": "2025-08-15T00:00:31.287952+00:00",
  "refreshDate": "2025-08-15T00:00:31.287954+00:00",
  "score": 1.0,
  "title": "Former Delaware Gov. Mike Castle dead at 86",
  "description": "Ex-Delaware Gov. Mike Castle has died at the age of 86.",
  "content": "Former Delaware Gov. Mike Castle, a Republican moderate who championed creating the popular 50 State Quarters Program of commemorative coins while he served in Congress, has died.\n\nThe Delaware Republican Party announced that Castle died Thursday in Greenville but shared no other details.\n\nCastle was among Delaware’s most successful politicians, never losing a race until his stunning upset in a 2010 primary for the U.S. Senate seat that Democrat Joe Biden held before becoming vice president.\n\nDuring his 18 years in Congress, Castle became a leader of centrist Republicans, earning a reputation as a fiscal conservative and social moderate not afraid to challenge the party line on issues ranging from government spending to environmental protection and abortion.\n\nAs Delaware’s lone representative in the U.S. House from 1993 to 2011, he supported a pay-as-you-go policy for both spending and tax cuts.\n\nCastle played roles in improving child nutrition programs and establishing the No Child Left Behind education reform program.\n\nHis signature issue in Congress was the commemorative quarters program that featured coins honoring each state, starting with Delaware.\n\nHe was dubbed by the coin grading service Numismatic Guaranty Company as “The Coinage Congressman.”\n\nThe quarters boosted federal revenues as they were taken out of circulation.\n\nHe also helped establish a similar program honoring U.S. presidents with dollar coins, beginning in 2007, and an “America the Beautiful” quarter program honoring national parks, monuments and nature areas starting in 2010.\n\n“The Honorable Michael Castle embodied the best of public service — moderation, integrity, and a steadfast commitment to all Delawareans,” Delaware GOP Chairman Gene Truono said in a statement Thursday.\n\nCastle had been a state lawmaker and lieutenant governor before becoming governor in 1985.\n\nDelaware Gov. Matt Meyer ordered flags flown at half-staff for the next week in Castle’s honor.\n\n“During his time as governor, Mike Castle visited every single school in our state, including mine, where he spoke to my high school class with the same warmth, humility, and commitment to public service that defined his career,” said Meyer, a Democrat.",
  "medium": "Article",
  "links": [
    "https://www.coasttv.com/news/gene-truono-elected-chairman-of-delaware-republican-party/article_7b058c98-9fb4-4c08-a313-981ad01e31b1.html",
    "https://nypost.com/2025/08/14/us-news/dc-sandwich-slinger-idd-as-doj-trial-attorney-fired-from-position-after-hurling-sub-at-fed-agent/",
    "https://nypost.com/2025/08/13/us-news/colorado-police-chiefs-toddler-killed-by-k-9-named-draco/",
    "https://www.facebook.com/whyypublicmedia/posts/delaware-gov-matt-meyer-is-arguing-that-party-insiders-shouldnt-pick-the-nominee/1200545345417531/",
    "https://nypost.com/2025/08/14/us-news/ashley-biden-shared-photo-of-husband-howard-krein-with-girlfriend-before-divorce-filing/",
    "https://nypost.com/2025/08/12/us-news/white-house-scrapped-biden-ship-tour-after-learning-how-many-steps-were-involved-emails-show/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Former Delaware Gov. Mike Castle",
      "weight": 0.110607445
    },
    {
      "name": "Mike Castle",
      "weight": 0.10490047
    },
    {
      "name": "Castle",
      "weight": 0.09678285
    },
    {
      "name": "Michael Castle",
      "weight": 0.096103325
    },
    {
      "name": "Delaware Gov. Matt Meyer",
      "weight": 0.08634326
    },
    {
      "name": "Delaware GOP Chairman Gene Truono",
      "weight": 0.078474924
    },
    {
      "name": "child nutrition programs",
      "weight": 0.077246465
    },
    {
      "name": "Delaware",
      "weight": 0.07604181
    },
    {
      "name": "commemorative coins",
      "weight": 0.07574135
    },
    {
      "name": "public service",
      "weight": 0.07320286
    }
  ],
  "topics": [
    {
      "name": "In Memoriam"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.98388671875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.94287109375
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.8720703125
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.6240234375
    },
    {
      "name": "/News/Local News",
      "score": 0.5400390625
    }
  ],
  "sentiment": {
    "positive": 0.4037397,
    "negative": 0.23882855,
    "neutral": 0.35743168
  },
  "summary": "Former Delaware Gov. Mike Castle, a Republican moderate known for creating the 50 State Quarters Program while in Congress, has died at the age of 86. Castle was known for his role in improving child nutrition programs and establishing the No Child Left Behind education reform program. His signature issue was the commemorative quarters program, which boosted federal revenues as they were removed from circulation. He also established a similar program honoring U.S. presidents with dollar coins.",
  "shortSummary": "Former Delaware Gov. Mike Castle, a Republican moderate who founded the 50 State Quarters Program and served in Congress, has died at 86.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "844cdaecc00545ecabaca476c52ace91",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/13/us-news/colorado-police-chiefs-toddler-killed-by-k-9-named-draco/",
      "text": "Police chief’s tot killed by K-9 dog named Draco in ‘tragic incident’\nA police chief’s 3-year-old daughter has died after she was attacked by a law enforcement K-9 named Draco at the family’s home, authorities in Colorado said.\nThe child was found unresponsive in the yard of the house, the Kit Carson County Sheriff’s Office said.\nOfficials haven’t said what may have led up to the attack and said the incident is still under investigation.\nThe girl, who has not been publicly identified, was the daughter of Burlington Police Chief Nathan Hill, who was not home at the time of the attack, authorities have confirmed.\n“We are deeply saddened by the tragic incident that occurred within the city limits of Burlington, CO. Our hearts go out to Chief Nate Hill, his wife and family for the loss of their little girl, who was victim of a dog attack,” Burlington Police Department said.\nEmergency medical personnel rushed the child to the hospital, where she was pronounced dead.\nThe German shepherd was taken to the Burlington dog pound and euthanized, police said.\nDraco had been a single-purpose narcotics detection K-9 for the Cheyenne County Sheriff’s Office, but was non-active at the time of the deadly attack, Kit Carson Sheriff Travis Beldon said.\n“He’s trained for detection. He’s not in any way trained for patrol work, apprehension, anything that would involve biting … So it is very uncharacteristic for him to attack in this fashion,” he told KENS5.\nThe dog was used as recently as June 19 for a traffic stop to detect controlled substances, according to a Cheyenne County Sheriff’s Office press statement.\nHe had recently been retired from duty after Cheyenne County discontinued its K-9 program, and was donated to the Burlington Police Department.\nHill was keeping the dog at his home at the time of the attack, police said."
    },
    {
      "url": "https://nypost.com/2025/08/12/us-news/white-house-scrapped-biden-ship-tour-after-learning-how-many-steps-were-involved-emails-show/",
      "text": "White House scrapped Biden ship tour after learning ‘how many steps were involved,’ emails show\nThe White House opted against having former President Joe Biden board a vessel during a July 2023 visit to a Philadelphia shipyard after learning “lots of steps” were required to get on board, newly released emails show.\nThe records, obtained by watchdog group Protect the Public’s Trust via a Freedom of Information Act (FOIA) and first reported by Fox News, show Department of Transportation staffers attempting to gather information about Biden’s July 20, 2023, trip to the Philly Shipyard and what the president would be doing during his visit.\nThe DOT’s Maritime Administration (MARAD) had awarded the Philly Shipyard a contract to build a massive National Security Multi-Mission Vessel (NSMV) years earlier – but the agency learned days before Biden’s trip that the White House would not allow the then-80-year-old president to inspect the boat.\n“No visit to the NSMV vessel is planned after the WH realized how many steps were involved to get on the ship,” a MARAD official notified members of Office of the Secretary of Transportation (OST), quoting a contact the agency had at that shipyard.\n“True – lots of steps on grating,” the message continued in a parenthetical note.\nBiden’s visit to the Philly Shipyard (PSI), where he met with apprentices and attended a steel-cutting ceremony for an offshore wind farm construction vessel, came just weeks after he took a hard fall at an Air Force Academy graduation ceremony in Colorado.\nSince the fall, the president had been observed boarding Air Force One using the aircraft’s shorter set of stairs.\nSeven days before the Philadelphia shipyard visit, Biden stumbled on Air Force One’s short staircase as he prepared to depart Helsinki-Vantaan International Airport in Finland.\nThe White House’s refusal to let Biden board the National Security Multi-Mission Vessel in Philadelphia may not have been the only time the president wasn’t allowed to get on a boat over concerns about the number of steps involved.\nFormer British Prime Minister Boris Johnson claimed in his autobiography, “Unleashed,” that the White House would not allow Biden to board the British Navy’s flagship aircraft carrier – the HMS Prince of Wales – ahead of the 2021 G7 summit in Cornwall.\nThe decision left Johnson questioning Biden’s “physical fitness.”\n“His staff told us that he would not in fact be boarding our vast aircraft carrier — which we had proudly stationed in the bay — because it had so many steps; and we wondered what that meant about his physical fitness,” Johnson said, according to an excerpt from the former prime minister’s book obtained by The Telegraph."
    },
    {
      "url": "https://nypost.com/2025/08/14/us-news/dc-sandwich-slinger-idd-as-doj-trial-attorney-fired-from-position-after-hurling-sub-at-fed-agent/",
      "text": "DC sandwich slinger ID’d as DOJ employee, fired from position after hurling sub at federal agent\nWASHINGTON — His career is toast.\nA DC dimwit who slung a Subway sandwich at a federal agent on the streets of the capital earlier this week has been identified as a now-former Justice Department worker.\nAttorney General Pam Bondi announced Thursday that Sean Charles Dunn, 37, who is facing a felony assault charge for the sandwich strike, has been fired from his DOJ role.\n“If you touch any law enforcement officer, we will come after you,” Bondi declared. “I just learned that this defendant worked at the Department of Justice — NO LONGER. Not only is he FIRED, he has been charged with a felony.”\n“This is an example of the Deep State we have been up against for seven months as we work to refocus DOJ,” she added. “You will NOT work in this administration while disrespecting our government and law enforcement.”\nDunn worked as an international affairs specialist in the Justice Department’s criminal division — which handles cases of fugitives abroad and helps foreign countries on extradition matters with their own fugitives, according to the DOJ.\nDunn appeared to have been similar to a paralegal — assisting attorneys in handling a “large volume of cases, including the litigation of those matters,” according to the DOJ’s job listing for the position.\nHe does not appear to be an attorney as his name isn’t listed on the DC bar’s website.\nAn attorney for the suspect did not immediately respond to requests for comment and attempts to contact Dunn directly were unsuccessful.\nDunn was allegedly caught on camera berating a group of federal officers as “fascists” before lobbing his deli sandwich and hitting a US Customs and Border Protection agent in the chest.\n“F— you! You f—ing fascists! Why are you here? I don’t want you in my city!” Dunn allegedly fumed within inches of an officer’s face, per a criminal complaint.\nAccording to the complaint, Dunn successfully attempted to flee on foot, telling a local cop while he was being processed: “I did it. I threw a sandwich.”\nFootage of the incident went viral against the backdrop of President Trump’s deployment of hundreds of federal law enforcement personnel to assist DC police in cracking down on crime.\nDunn faces one count of assaulting, resisting or impeding a federal officer and faces up to one year in prison if convicted.\n“The police are not out there to get pushed around or beat up,” DC US Attorney Jeanine Pirro declared in announcing the case against Dunn. “He thought it was funny. Well, he doesn’t think it’s funny today because we charged him with a felony: Assault on a police officer.”\n“So there, stick your Subway sandwich somewhere else!”\nOn Monday, Trump federalized the DC Metropolitan Police Department for 30 days and activated the National Guard to patrol the District’s streets.\nSince then, hundreds of federal officials have arrested more than 100 suspects, with 23 collared on Monday, 43 nabbed on Tuesday and 45 apprehended on Wednesday, according to data from the Trump administration.\nTrump’s crackdown comes after former Department of Government Efficiency (DOGE) employee Edward Coristine — aka “Big Balls” — was beaten up while intervening to prevent a carjacking last week."
    },
    {
      "url": "https://nypost.com/2025/08/14/us-news/ashley-biden-shared-photo-of-husband-howard-krein-with-girlfriend-before-divorce-filing/",
      "text": "Ashley Biden shared a photo of husband Howard Krein hand in hand with ‘his girlfriend’ hours before bombshell divorce filing\nAshley Biden, the former first daughter who is fresh off filing for divorce from her husband, Dr. Howard Krein, shared a picture purportedly showing her ex with another woman.\n“My husband and his girlfriend holding hands,” the 44-year-old wrote in the Instagram Story, over a picture of a man and a woman taken from behind. She accompanied the story with the Notorious B.I.G. song “Another,” featuring Lil’ Kim, which details an affair.\n“What do you do when your man is untrue? Do you cut the sucker off and find someone new?” Lil’ Kim raps in the portion of the song Biden shared on social media.\nThe dark-haired man in a casual short-sleeved shirt and the blond woman in a strapless black dress are not immediately identifiable, but Biden’s message was clear.\nSunday morning’s Instagram Story — which was quickly taken down — came just hours before Biden filed for a divorce from the 58-year-old plastic surgeon in a Philadelphia court after 13 years of marriage.\nAnother since-deleted Instagram Story, showing Biden walking through a park giving a thumbs-up to the tune of Beyonce’s song “Freedom,” also appeared to allude to the split.\nIn a subsequent story accompanied by the Lauryn Hill song “Freedom Time,” she reposted a quote, “New life, new beginnings means new boundaries. New ways of being that won’t look or sound like they did before.”\nFormer President Joe Biden’s daughter is seeking spousal support from her ex as part of the divorce, court records seen by Radar Online show.\nBiden, executive director of the nonprofit Delaware Center for Justice, is “unable to sustain herself” while the divorce is pending, according to the documents filed by her attorney Charles Meyer.\nShe is requesting a no-fault divorce, claiming that the marriage is “irretrievably broken,” and that the couple are living “separate and apart,” the documents show.\nBiden and Krein did not respond to requests for comment Thursday.\nThe couple married in 2012 in Greenville, Delaware, two years after meeting through Ashley’s late brother, Beau, who died of cancer in 2015.\nKrein, a New Jersey-born otolaryngologist at Thomas Jefferson University, proposed in 2011 at Big Sur, California.\nThey married at Delaware’s St. Joseph on the Brandywine Roman Catholic Church in a ceremony combining her traditions with Krein’s Jewish ones, before the couple and some 200 guests traveled to the Biden family’s nearby lakeside home in Wilmington for a reception and dinner.\nJoe Biden, who was vice president at the time, personally prepped the house for his youngest child’s wedding.\n“I kept telling Ash, we’ve got to open up the church and practice walking up and down the aisle so I can handle it,” he previously told People.\nHe was also full of praise for his future son-in-law, saying, “This is the right guy. And he’s getting a helluva woman.”\nKrein also served on the Biden Cancer Initiative’s board of directors between 2017 and 2019, and advised his 2020 presidential campaign on its response to the COVID-19 pandemic in an unofficial capacity.\nAt last year’s DNC in Chicago, Ashley Biden recounted her wedding day and discussed her father’s words to her before she tied the knot.\n“Before he walked me down the aisle, he turned to me and said he would always be my best friend. All these years later, Dad, you are still my best friend,” she said in an address that brought her father to tears."
    }
  ],
  "argos_summary": "Former Delaware Governor Mike Castle, a prominent moderate Republican known for creating the 50 State Quarters Program, has passed away at the age of 86. He served in Congress for 18 years, gaining a reputation as a fiscal conservative and social moderate, and was involved in significant initiatives like child nutrition programs and the No Child Left Behind education reform. Castle's death was announced by the Delaware Republican Party, and flags will be flown at half-staff in his honor.",
  "argos_id": "FRSOAHAAU"
}