{
  "url": "https://www.foxnews.com/sports/johnny-manziel-wishes-nothing-best-arch-manning-except-1-game-during-texas-2025-season",
  "authorsByline": "Scott Thompson",
  "articleId": "ed791cac688c42669b07b0a9e0ab1e59",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/johnny-manziel-arch-manning-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T20:04:40-04:00",
  "addDate": "2025-08-15T00:11:22.514961+00:00",
  "refreshDate": "2025-08-15T00:11:22.514962+00:00",
  "score": 1.0,
  "title": "Johnny Manziel wishes 'nothing but the best' for Arch Manning — except for 1 game during Texas' 2025 season",
  "description": "Texas A&M legend Johnny Manziel offered advice to Arch Manning while admitting he wants the Longhorns quarterback to struggle when he faces the Aggies in November.",
  "content": "Heisman Trophy winner Johnny Manziel wishes \"nothing but the best\" for Arch Manning as Manning embarks on his first season as a full-time starter with the Texas Longhorns.\n\nBut Manziel's own college football allegiance has him hoping Manning has his worst game of the year during Rivalry Week in college football.\n\nManziel's Texas A&M Aggies take priority over any Longhorns player.\n\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\n\n\"Whenever [Texas] plays Texas A&M, I hope he throws five picks and no touchdowns and gives us an opportunity to win that ballgame we need to win,\" Manziel told Fox News Digital while discussing his partnership with Sling TV.\n\n\"The Lone Star Showdown\" is the moniker for Texas-Texas A&M week, which is commonly played during Rivalry Week. This year, the game will be played Nov. 28, the latest regular-season game for the Aggies and Longhorns.\n\nSo, Manziel will have other weeks before that matchup to watch what the Longhorns and Manning are doing while rooting on his Aggies.\n\nARCHIE MANNING SAYS GRANDSON ARCH 'ISN'T GOING' TO DECLARE FOR THE 2026 NFL DRAFT\n\nManning's expectations as the Longhorns' starter are through the roof with Quinn Ewers moving on to the NFL. Texas is atop The Associated Press' Top 25 preseason poll, and many are picking them to win this year's College Football Playoff.\n\nManziel isn't going to go that far, but he is excited to see what Manning can do with the spotlight on him in Austin.\n\n\"Texas is starting out very highly ranked,\" Manziel said. \"A lot of hype around them, and there’s a lot of pressure in that situation. But, from what he’s shown so far, you’d think he’d be able to handle it, and he’s going to play well. The SEC, week in and week out, we’ll find out exactly what he’s made of.\n\n\"For me, from my perspective, I’m wishing him nothing but the best. Seems like an amazing kid, has an amazing family. I want him to do amazing things outside of that one day.\"\n\nManziel got to know the Manning family well, having won the coveted \"Manning Award\" for the best college football quarterback during his Heisman-winning 2012 campaign at A&M.\n\nArch has a strong support system with his uncles, Peyton and Eli Manning; his father, Cooper Manning; and his grandfather, New Orleans Saints legend Archie Manning. But Manziel is curious, like the rest of the country, to see how Arch does when he's between the lines facing the reigning national champion Ohio State Buckeyes to kick off his 2025 campaign.\n\n\"When you’re ranked that high going into the season, and you have the hype and the name and everything that comes along with it, you’re going to get everybody’s best shot week in and week out,\" Manziel said. \"Right out of the gate for them in their schedule, they get a real test playing a real team out of the gate.\n\n\"So, you’re getting everybody’s best shot. People are coming for you, and there’s gonna be defenses you haven’t seen before, looks you haven’t seen before. They’re really going to be gunning for you.\"\n\nManziel knows the expectations of leading a highly-touted SEC school.\n\n\"The main thing that he has to do is just continue to be a good leader, continue to run the offense the way he’s taught, the way he needs to, and just keep things in a good perspective that not everything is going to go smooth every single drive, every single week,\" Manziel said of Manning.\n\n\"You’re going to deal with some adversity. You’re going to have some ballgames that are three-point games where you have to try to hold people out, and hopefully they go your way.\n\n\"The best thing that he can do is show up, be the guy, be the leader, and go out and play his best football week in and week out.\"\n\nA DIFFERENT WAY TO WATCH FOOTBALL\n\nManziel partnered with Sling TV, a subsidiary of DISH Network Corporation, to promote a different way of watching football this season, one that takes the consumer into consideration.\n\nSling TV is offering three new streaming subscription packages: Day Pass, Weekend Pass and Week Pass, which all give 24-hour access to the platform.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nWhen it comes to football, especially at the college level, not all fans want to pay a premium for games they won’t watch. Manziel loves that he can pick and choose the right streaming subscription with Sling TV.\n\n\"I get these notifications on my phone that say, ‘You get charged X amount for this or that.’ I’m like, ‘Man, I’m just trying to watch ball.’ To have something start at $4.99, and you pick which one you want — you want a day, a week, a weekend. Being an SEC guy through and through, I think, for me, it makes it easy for me to watch whatever I want whenever I want, and it’s really easy. You don’t have to sit there with overhead or anything else going on. For me, I don’t think it can be any better.\"\n\nFollow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/category/sports/ncaa/texas-longhorns",
    "https://www.foxnews.com/category/person/arch-manning",
    "https://www.foxnews.com/newsletters",
    "https://www.foxnews.com/category/sports/ncaa/texas-am-aggies",
    "https://www.foxnews.com/sports/archie-manning-says-grandson-arch-isnt-going-declare-2026-nfl-draft",
    "https://www.foxnews.com/sports",
    "https://www.foxnews.com/video/6376934507112",
    "https://twitter.com/FoxNewsSports_",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/category/sports/nfl",
    "https://www.foxnews.com/sports/arch-manning-receives-comparison-legendary-texas-quarterback"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Arch Manning",
      "weight": 0.08708227
    },
    {
      "name": "Eli Manning",
      "weight": 0.07862706
    },
    {
      "name": "Manning",
      "weight": 0.07813721
    },
    {
      "name": "Cooper Manning",
      "weight": 0.077993095
    },
    {
      "name": "Archie Manning",
      "weight": 0.07733206
    },
    {
      "name": "Johnny Manziel",
      "weight": 0.07638009
    },
    {
      "name": "Manziel",
      "weight": 0.0747806
    },
    {
      "name": "Texas A&M Aggies",
      "weight": 0.07364971
    },
    {
      "name": "Texas A&M",
      "weight": 0.07044171
    },
    {
      "name": "New Orleans Saints legend Archie Manning",
      "weight": 0.07034525
    }
  ],
  "topics": [
    {
      "name": "Sports Figures"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9892578125
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.97265625
    },
    {
      "name": "/Sports/College Sports",
      "score": 0.91748046875
    }
  ],
  "sentiment": {
    "positive": 0.43709517,
    "negative": 0.17764023,
    "neutral": 0.38526455
  },
  "summary": "Heisman Trophy winner Johnny Manziel has wished for Arch Manning, who is set to start his first season as a full-time starter with the Texas Longhorns. However, Manziel's college football allegiance, specifically for the Texas A&M Aggies, takes priority over any Longhorns player. This comes during Rivalry Week in college football, when the game will be played Nov. 28. Manziel expressed his admiration for Manning's family and expressed hope for him to perform well under the high expectations of leading a highly-ranked SEC school. He also highlighted his partnership with Sling TV, a subsidiary of DISH Network, to promote a different way of watching football this season.",
  "shortSummary": "Johnny Manziel wishes Arch Manning the best possible season for Texas Longhorns, while Texas A&M Aggies dominate Rivalry Week and his family excels in supporting him.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b11c9fd1013345e0a9182190f1ed6f72",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/category/sports/ncaa/texas-longhorns",
      "text": "NFL 58 mins ago NFL free agent Isaiah Bond plans to join Browns after grand jury clears him in sexual assault case Isaiah Bond, a former Alabama and Texas football star, was cleared of criminal charges in a sexual assault case and announced he'll sign with the Cleveland Browns.\nTexas Longhorns 1 hour ago Johnny Manziel wishes 'nothing but the best' for Arch Manning — except for 1 game during Texas' 2025 season Texas A&M legend Johnny Manziel offered advice to Arch Manning while admitting he wants the Longhorns quarterback to struggle when he faces the Aggies in November.\nTexas Longhorns 8 hours ago 2025 College Football Predictions: Picking Power 4 Conference Champions FOX Sports college football writers Michael Cohen and RJ Young give their predictions for the conference championship game and winners from each Power 4 conference.\nOhio State Buckeyes 3 days ago 2025 CFP Championship Odds: Can Texas Win Title After Topping Preseason Poll? The preseason AP Poll has dropped, and Texas will now look to pull off a feat that hasn't been accomplished since 2017. See the latest CFP title odds.\nCollege Football 3 days ago Arch Manning, Texas sit atop preseason AP college football poll The Associated Press' preseason Top 25 college football poll was released on Monday and the Texas Longhorns were ranked No. 1 to start the 2025 season.\nUSC Trojans 6 days ago Defining Success For Ohio State, Michigan and Other Top Programs in 2025 Joel Klatt believes it will be a failure of a season for Texas and Penn State if they don't reach the national championship game. For some other programs, though, he thinks they should be happy if they just make the CFP.\nLSU Tigers 6 days ago Top 10 QBs Heading Into 2025 College Football Season The college football season is nearly upon us, so it's time to debate QBs. FOX Sports Research put together their top 10.\nTexas Longhorns August 7 Archie Manning says grandson Arch 'isn't going' to declare for the 2026 NFL Draft Texas Longhorn's quarterback Arch Manning will be at Texas for a couple of years, with his grandfather Archie Manning stating he \"isn't going\" to declare for the 2026 NFL Draft.\nNFL August 7 2026 NFL Draft No. 1 Pick Odds: Arch Drops After Archie's Comments When grandpa speaks, the sportsbooks listen. And now, Arch Manning is a longshot to go No. 1 in the 2026 NFL Draft. See the latest odds.\nOklahoma Sooners August 6 2025 SEC Title Odds: 'There's Not A Real Standout Team' As one bookmaker put it, \"Maybe we will get some variance this year,\" after Bama or UGA has won the conference 10 of the last 11 times. Patrick Everson has the scoop.\nKansas State Wildcats August 4 Joel Klatt's 2025 College Football Rankings: Does Penn State Stay on Top? After ranking Penn State No. 1 in his post-spring poll, Joel Klatt kept the Nittany Lions in the top spot, while another team skyrocketed.\nCleveland Browns July 29 Browns owner Jimmy Haslam dismisses speculation surrounding Arch Manning The Cleveland Browns are focused on the season ahead and not Arch Manning's draft plans, owner Jimmy Haslam confirmed to the media Tuesday.\nNotre Dame Fighting Irish July 29 Who Are The Top 10 Running Backs Heading Into The 2025 College Football Season? There isn't a true top dog at running back entering the 2025 college football season, but there are plenty of players who have a case to be thought of as the player at the position.\nTexas Longhorns July 24 Arch Manning receives comparison to legendary Texas quarterback Former Texas Longhorns head coach Mack Brown compared Arch Manning to another great quarterback who had immense success in burnt orange.\nTexas Longhorns July 23 2025 College Football Odds: Wager On Longhorns Could Cash For $1.8 Million A $300k wager on the Longhorns could mean a seven-figure payday for one bettor — but only if Texas wins the national title.\nOhio State Buckeyes July 22 What are the 10 Biggest College Football Rivalries of All Time? What are the 10 biggest rivalries in college football? FOX Sports Research compiled the list of all-time matchups.\nNotre Dame Fighting Irish July 19 Unrivaled Announces NIL Deals With College Stars JuJu Watkins, Azzi Fudd, More JuJu Watkins, Flau'Jae Johnson and Azzi Fudd are three of 14 top women's college basketball players that Unrivaled is signing to NIL deals.\nTexas Longhorns July 18 Texas Picked to Win 2025 SEC Championship With Arch Manning at QB Texas, with Heisman Trophy candidate Arch Manning set to take over at QB, is the preseason pick to win the SEC championship.\nKentucky Wildcats July 17 House Settlement Provides Level NIL Playing Field in SEC, Says Arkansas Coach Sam Pittman says the $2.8B settlement that went into effect this month has positively leveled the college football playing field.\nTexas Longhorns July 16 Texas star Arch Manning calls staying with Longhorns 'a no-brainer' despite transfer speculation Texas Longhorns quarterback Arch Manning faced massive attention at SEC Media Days, where he explained why it was a \"no-braine\"' to remain where he was instead of transferring.\nTexas Longhorns July 15 Texas' Arch Manning Dodges Question On Possible 2026 NFL Draft Entrance Widely viewed as the No. 1 prospect in the 2026 NFL Draft, Arch Manning said he's \"just focused\" on the 2025 season when he was asked about entering the draft next year at SEC Media Days.\nIndiana Hoosiers July 11 The Basketball Tournament 2025 Bracket, Scores, Schedule The Basketball Tournament is set to tip off on July 18. Here'a look at the teams, schedule, bracket, scores and more!\nUCF Knights July 8 Big 12 Commish Doubles Down On Preference For 5-11 Playoff Model If CFP Expands Big 12 Commissioner Brett Yormark prefers a 16-team College Football Playoff model with five automatic qualifiers and 11 at-large bids, turning down other potential models that could give the conference more automatic bids.\nLSU Tigers July 8 2025 Heisman Trophy Odds: Three QBs Top The Early Oddsboard Check out the 2025 Heisman Trophy odds, as well as betting insights, as the season kicks off in less than two months.\nOregon Ducks July 5 How 2024-25 CFP Would've Looked Under Proposed Expansion Formats Here's what last year's CFP could've looked like under the proposed format changes recently discussed on \"Big Noon Conversations.\"\nGeorgia Bulldogs July 2 'College Football 26': The 10 Highest-Rated QBs, Offensive and Defensive Players Ohio State's Jeremiah Smith is the highest-rated player in \"College Football 26,\" with a teammate of his earning the highest rating for defensive players.\nCollege Football July 1 Peyton Manning says nephew Arch has 'swagger' from his father, athletic abilities that 'skipped a generation' NFL great Peyton Manning shared his insights on nephew and Texas quarterback Arch Manning after he impressed at the Manning Passing Academy.\nTexas Longhorns June 30 Texas' Arch Manning shares advice from Matthew McConaughey as popularity grows Texas Longhorns star quarterback Arch Manning talked about the advice he received from Matthew McConaughey as his fame has risen in Austin.\nMichigan Wolverines June 28 2025 College Football Predictions: 10 Matchups that will Shape the Regular Season Texas vs. Ohio State in Week 1? Yes please! Ohio State vs. Michigan in Week 14? Absolutely! FOX Sports' Joel Klatt lists 10 games that will shape the 2025 college football season.\nLouisville Cardinals June 25 Highest-Paid College Football Players if NIL Existed Since 2000 Johnny Manziel. Tim Tebow. Michael Vick. Who would have been the most profitable college football players if NIL existed since the turn of the century?"
    },
    {
      "url": "https://www.foxnews.com/sports/arch-manning-receives-comparison-legendary-texas-quarterback",
      "text": "Arch Manning will enter his first season as the Texas Longhorns’ starting quarterback with high expectations, even though he’s only started two games in his young career.\nMack Brown, a former head coach at Texas and North Carolina, made another wild comparison to Manning, likening him to legendary Longhorns quarterback Vince Young.\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\n\"He also seems like he listens. He's very humble,\" Brown said in a recent appearance on \"The Stampede.\" \"He said too much has been written about me, more than I've accomplished. I mean, he is kind of self-deprecating. But I like it. He's a whole lot like Vince at the same age.\"\nYoung didn’t need to throw too much in his sophomore season as the team rode the back of Cedric Benson in the backfield. It was his junior season in which he broke out, won the Big 12 Offensive Player of the Year Award and led the Longhorns to a stunning national championship victory over USC. He had 3,036 passing yards and 26 touchdown passes that season.\nREVEILLE X, TEXAS A&M'S COLLIE MASCOT, UNDERGOES EYE SURGERY FOLLOWING GLAUCOMA DIAGNOSIS\nBrown also liked how Manning conducted himself during his SEC Media Days appearance last week and how he avoided questions about what other coaches had said about him.\nManning is more polished with the media than most – and he’s had a lot of role models to look up to. He’s the son of Cooper Manning, who was a high school football great in his own right, and the nephew of Super Bowl champions Peyton and Eli Manning. He’s also the grandson of Archie Manning.\nThe lineage is there, but soon it will be time to shut up and play football.\nCLICK HERE TO GET THE FOX NEWS APP\nHe had 939 passing yards and nine touchdown passes last season. However, his first task as a starter will be to go up against the defending national champion Ohio State Buckeyes on Aug. 30.\nFollow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter."
    },
    {
      "url": "https://www.foxnews.com/category/sports/nfl",
      "text": "LOVE FOR THE GAME Mark J. Rebilas/Imagn Images Kansas City Chiefs Travis Kelce takes credit for turning Taylor Swift into an 'engulfed' football fan\nUP FOR GRABS AP Photo/Jacob Kupferman Cleveland Browns Shedeur Sanders remains 4th on Browns' unofficial depth chart ahead of Eagles preseason matchup\nTOUCHDOWN Charles LeClaire/USA TODAY Sports Las Vegas Raiders Jon Gruden wins key ruling in Nevada in case against NFL\nPULLED OVER Bob Donnan-Imagn Images Cleveland Browns Report: Browns star Myles Garrett cited for speeding 100 mph in 60 mph zone near team facility\nTexas Longhorns 34 mins ago Johnny Manziel wishes 'nothing but the best' for Arch Manning — except for 1 game during Texas' 2025 season\nOklahoma Sooners 8 hours ago Who are the Top 10 Impact Transfer Quarterbacks Entering the 2025 CFB Season?\nNFL NFL free agent Isaiah Bond plans to join Browns after grand jury clears him in sexual assault case\nNFL Taylor Swift says turning Jason Kelce’s daughters into cat fans after white lie was a ‘great challenge’\nNew England Patriots Stefon Diggs noncommittal on Patriots debut as he recovers from injury: 'Taking it day by day'\nNew York Jets Jets' Justin Fields shares he's 'low-key addicted' to reading his Bible, talks relationship with God\nNFL Jason Kelce defends himself after debuting new look in podcast featuring Taylor Swift: 'Don't hate me'\nKansas City Chiefs Taylor Swift reveals she screamed about Chiefs drafting Xavier Worthy after she became football 'obsessed'\nCincinnati Bengals Bengals rookie knocks down Joe Burrow during practice, sparks heated confrontation with teammates"
    },
    {
      "url": "https://www.foxnews.com/category/sports/ncaa/texas-am-aggies",
      "text": "Kansas State Wildcats August 4 Joel Klatt's 2025 College Football Rankings: Does Penn State Stay on Top? After ranking Penn State No. 1 in his post-spring poll, Joel Klatt kept the Nittany Lions in the top spot, while another team skyrocketed.\nTexas A&M Aggies July 23 Reveille X, Texas A&M's collie mascot, undergoes eye surgery following glaucoma diagnosis Reveille X, Texas A&M's mascot, underwent a medical procedure to remove her right eye after a glaucoma diagnosis. The university's president said the collie is recovering well.\nPenn State Nittany Lions July 22 Who Wore It Best? Greatest College Football Players by Jersey Number, 26-50 College football players take pride in their jersey numbers, but who has ultimate bragging rights? Here are the greatest players in college football history to wear Nos. 26-50!\nOhio State Buckeyes July 22 What are the 10 Biggest College Football Rivalries of All Time? What are the 10 biggest rivalries in college football? FOX Sports Research compiled the list of all-time matchups.\nLiberty Flames July 21 College football transfer portal tracker: BYU QB Retzlaff Transfers to Tulane The transfer season for college football has technically come to an end, but some players have been allowed to move shortly before the season begins.\nMichigan Wolverines June 28 2025 College Football Predictions: 10 Matchups that will Shape the Regular Season Texas vs. Ohio State in Week 1? Yes please! Ohio State vs. Michigan in Week 14? Absolutely! FOX Sports' Joel Klatt lists 10 games that will shape the 2025 college football season.\nLouisville Cardinals June 25 Highest-Paid College Football Players if NIL Existed Since 2000 Johnny Manziel. Tim Tebow. Michael Vick. Who would have been the most profitable college football players if NIL existed since the turn of the century?\nCincinnati Bengals June 10 Bengals rookie Shemar Stewart stands firm in contract battle: 'I'm 100% right' Cincinnati Bengals first-round pick Shemar Stewart skipped mandatory minicamp during a contract standoff after the team reportedly attempted to void future guarantees.\nTexas A&M Aggies May 20 Former Texas A&M football star Brian Williams dies after competing in half-marathon: 'Purest in heart' Family says Brian Williams, the 24-year-old Texas A&M engineering graduate, was \"the kindest, purest in heart\" after he died from heat stroke complications on Sunday.\nTexas A&M Aggies April 10 Texas A&M head coach Mike Elko condemns defensive lineman's explicit motto revelation Texas A&M head coach Mike Elko spoke out and condemned the comments his defensive lineman, DJ Hicks, made to reporters during a press conference.\nAuburn Tigers March 16 2025 NCAA Tournament projections: Indiana, UNC, Xavier all in play for final bids Selection Sunday is here! Will UNC, Xavier and Indiana find their way into the tourney? Mike DeCourcy answers that and more with his latest NCAA Tournament projections.\nFlorida Gators March 9 College basketball rankings: Duke takes over No. 1; St. John's enters top 5 FOX Sports' John Fanta breaks down what stood out most from the weekend and reveals his latest top 25 rankings.\nTexas A&M Aggies March 2 Texas A&M pitcher calls out fans for 'disgusting' criticism amid team's slow start Texas A&M pitcher Shane Sdao put out a statement on Sunday, going after fans who have made allegedly hateful remarks toward players amid the team's slow start.\nTennessee Volunteers February 28 College basketball weekend preview: Top five games to watch Saturday The college basketball regular season is winding down, and each game is key to March hopes. Here are the five best games to watch Saturday.\nTexas A&M Aggies February 25 Georgia's Kirby Smart takes swipe at Johnny Manziel: 'Champion of Fireball' Georgia Bulldogs football head coach Kirby Smart appeared to take a shot at former star quarterback Johnny Manziel during a coaching clinic.\nAlabama Crimson Tide February 24 AP Top 25: Auburn holding strong atop men's poll; preseason No. 1 Kansas out Auburn remains atop the AP Top 25 for the seventh straight week, while preseason No. 1 Kansas dropped out for the first time in nearly four years.\nIllinois Fighting Illini February 21 College basketball weekend preview: Top five matchups to tune into Saturday College basketball continues to deliver with a fantastic slate of games this weekend. Here are the five best games to watch Saturday!\nAlabama Crimson Tide February 17 AP Top 25: Auburn remains No. 1, Florida up to No. 2 in men's poll Auburn's win at Alabama assured the Tigers would keep the No. 1 ranking in the AP men's poll, while Florida improved to No. 2.\nTexas A&M Aggies February 14 College basketball weekend preview: Top five matchups to watch Saturday College basketball has an unbelievable slate of games this weekend, including No. 1 vs. No. 2! Here are the five best games to watch Saturday.\nPurdue Boilermakers February 3 AP Top 25: Maryland enters for first time since 2023; Auburn remains No. 1 Auburn remained atop The Associated Press Top 25 men's poll, while Maryland is back for the first time in nearly two years.\nCleveland Browns January 8 2025 NFL mock draft: Who should take Shedeur Sanders, Cam Ward? With the 2024 regular season over, the top 18 picks of the first round of the 2025 NFL Draft have been set. FOX Sports' Ben Arthur and Henry McKenna mock those selections.\nMichigan Wolverines December 24 2025 NFL Mock Draft: Giants select Cam Ward No. 1, Jags pick Hunter, Sanders to LV J-Mac is back with his mock 2025 NFL Draft. Find out which teams he predicts will select some of college football's biggest names on Night 1 of next year's draft.\nIowa State Cyclones December 23 AP Top 25: Tennessee, Auburn remain 1-2 in men's poll featuring 10 SEC teams Tennessee and Auburn remained Nos. 1-2 atop the AP men's college basketball poll, which featured 10 total SEC teams.\nIowa State Cyclones December 9 AP Top 25: Tennessee is No. 1 after big shakeup; Kansas, Wisconsin tumble Tennessee is the new No. 1 in men's college basketball after a massive shakeup in the AP Top 25, while Kansas took a tumble.\nAuburn Tigers December 4 Early signing day: Top 10 2025 college football recruiting classes Early signing day has arrived in college football. Which classes ranked in the top 10? Here's a full look at the best recruiting classes for 2025.\nTexas A&M Aggies November 30 Texas A&M superfan proposes to girlfriend during ESPN's 'College GameDay' ahead of rivalry game vs. Texas Two Texas A&M Aggie superfans got engaged after a surprise proposal during a segment on ESPN's \"College GameDay\" on Saturday before the Aggies play Texas on Saturday night.\nArizona State Sun Devils November 29 FOX Super 6 contest: Geoff Schwartz's college football Week 14 picks Enter the free Super 6 Contest featuring Week 14 in college football for a chance to win cash prizes! And don't worry — Geoff Schwartz is here to help with your picks.\nOhio State Buckeyes November 29 College football Week 14 preview: Five best games to watch this weekend FOX Sports college football writer Laken Litman breaks down the top five games to watch this weekend. Here's what to know.\nTexas A&M Aggies November 24 AP Top 25: Oregon, Ohio State hold firm; Alabama out of top 10; Colorado No. 23 Oregon is the consensus No. 1 for the fourth straight week despite Ohio State's dominant win over Indiana. Several upsets scramble the rankings.\nTexas A&M Aggies November 24 Unranked Auburn upsets CFP-hopeful Texas A&M in 4 OT thriller after game-tying score is dropped Texas A&M had a chance to get themselves into the next bracket projection after earlier upsets, but they dropped the game-tying score in quadruple overtime."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/sports/archie-manning-says-grandson-arch-isnt-going-declare-2026-nfl-draft",
      "text": "Archie Manning knows his grandson, Arch, and he thinks the Texas quarterback will be around for some time.\nArchie, 76, said he hasn’t discussed the possibility of Arch potentially declaring for the 2026 NFL Draft but doesn’t think his grandson will declare.\n\"Arch isn’t going to do that. He’ll be at Texas,\" Manning told Texas Monthly.\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\nThe hype train for Arch going into this first year as starter is full steam ahead. Fans have labeled the Longhorns’ quarterback as a Heisman Trophy candidate, which angers his grandfather.\n\"People are saying he’s a Heisman candidate,\" Archie said. \"You’re not a Heisman Trophy candidate when you haven’t played but three games. It’s crazy.\"\nArch stepped in and started three games this season when Quinn Ewers got hurt and missed time with an oblique injury.\nLEGENDARY SPORTS AGENT BREAKS DOWN TRUMP'S 'SAVING COLLEGE SPORTS' EXECUTIVE ORDER\nIn addition to those three starts, Manning has appeared in seven games this season for Texas. He has completed 67.8% of his passes while throwing for 939 yards and nine touchdowns with two interceptions.\nManning has also shown an ability to run, rushing for 100 yards and four touchdowns this season. Even when Ewers returned from injury, Texas head coach Steve Sarkisian substituted Manning for a couple of plays that involved the quarterback running.\nCLICK HERE TO GET THE FOX NEWS APP\nMuch to Archie’s chagrin, Texas was the No. 1-ranked team in the coaches’ preseason top 25, which is spurred by the excitement about Manning taking the reins as the team’s starting quarterback.\nLast season, the Longhorns went 13-3 and were eliminated by the eventual champions, the Ohio State Buckeyes, in the semifinals of the College Football Playoff. With Arch at the helm, Longhorn fans are eyeing a national championship.\nFollow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter."
    }
  ],
  "argos_summary": "Johnny Manziel, the Heisman Trophy winner, expressed his support for Arch Manning as he begins his first season as the Texas Longhorns' starting quarterback, but hopes Manning struggles during their rivalry game against Texas A&M. Manning faces high expectations, being ranked highly in preseason polls and seen as a potential Heisman candidate, despite his limited experience. Manziel advises Manning to maintain leadership and perspective as he navigates the pressures of playing for a top-ranked SEC team.",
  "argos_id": "FUVQHTP4B"
}