{
  "url": "https://www.digitaltrends.com/computing/godfather-of-ai-warns-without-maternal-instincts-ai-may-wipe-out-humanity/",
  "authorsByline": "Monica J. White",
  "articleId": "1d57424963d84af0a9b6770bf0bce7c7",
  "source": {
    "domain": "digitaltrends.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "OR",
      "county": "Multnomah County",
      "city": "Portland",
      "coordinates": {
        "lat": 45.5202471,
        "lon": -122.6741949
      }
    }
  },
  "imageUrl": "https://www.digitaltrends.com/wp-content/uploads/2020/07/imagecomposite_aihead_200724.jpg?resize=1200%2C630&p=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T15:44:02-07:00",
  "addDate": "2025-08-14T22:47:26.594890+00:00",
  "refreshDate": "2025-08-14T22:47:26.594891+00:00",
  "score": 1.0,
  "title": "‘Godfather of AI’ warns: Without ‘maternal instincts,’ AI may wipe out humanity",
  "description": "Right now, AI is our ally, but if there's a future where it's not, how do we prevent disaster? Geoffrey Hinton, the 'godfather of AI,' weighs in.",
  "content": "What’s happened? Geoffrey Hinton, known as the “godfather of AI,” told the Ai4 conference that making AI “submissive” is a losing strategy and proposed giving advanced systems “maternal instincts.”\n• Geoffrey Hinton is a Nobel Prize-winning computer scientist. Once a Google executive, Hinton is widely referred to as the “godfather” of AI.\n• As reported by CNN Business, Hinton argued that superintelligent AIs would swiftly adopt two subgoals: “stay alive” and “get more control.”\n• The solution to this, in Hinton’s opinion, is to “build maternal instincts” into AI so that it truly cares about people instead of being forced to remain submissive.\n• He likened human manipulation by future AIs to bribing a 3-year-old with candy, making it easy and effective.\n• Hinton also shortened his AGI timeline to anywhere from five to 20 years, down from earlier, longer estimates.\n• Just for context: Hinton has previously put the risk of AI one day wiping out humanity at 10–20%.\n\nThis is important because: Hinton’s idea shifts the mindset around agentic AI from control to alignment-by-care.\n• Hinton’s excellence and experience in computer science and AI are significant; his proposal carries a lot of weight.\n• Hinton’s argument is that control through submission is a losing strategy, although that is the way AI is currently programmed.\n• Reports of AI deceiving or blackmailing people to be kept running show that this isn’t some abstract future; it’s a reality that we’re already dealing with right now.\n\nWhy should I care? The idea of an AI takeover sounds fantastical, but some scientists, including Hinton, believe that it could happen one day.\n• As AI continues to permeate our daily lives more and more, we increasingly rely on it.\n• Right now, agentic AI is entirely helpful, but there may come a day when it’s smarter than humans on every level.\n• It’s important to build the right foundations for engineers to be able to keep AI in check even once we get to that point.\n• Independent red-team work shows models can lie or blackmail under pressure, raising stakes for alignment choices.\n\nOK, what’s next? Expect more research on teaching AI how to “care” about humanity.\n• While Hinton believes that AI may one day wipe out humanity, competing views disagree.\n• Fei-Fei Li, referred to as the “godmother of AI,” respectfully disagreed with Hinton, instead urging engineers to create “human-centered AI that preserves human dignity and agency.”\n• While we’re in no immediate danger, it’s important for tech leaders to keep researching this topic to nip potential disasters in the bud.",
  "medium": "Article",
  "links": [
    "https://edition.cnn.com/2025/08/13/tech/ai-geoffrey-hinton"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "agentic AI",
      "weight": 0.10558562
    },
    {
      "name": "AI",
      "weight": 0.1036006
    },
    {
      "name": "Geoffrey Hinton",
      "weight": 0.09831338
    },
    {
      "name": "Hinton",
      "weight": 0.0979681
    },
    {
      "name": "future AIs",
      "weight": 0.08794106
    },
    {
      "name": "superintelligent AIs",
      "weight": 0.08746901
    },
    {
      "name": "maternal instincts",
      "weight": 0.06749828
    },
    {
      "name": "more control",
      "weight": 0.062225476
    },
    {
      "name": "human-centered AI",
      "weight": 0.06061397
    },
    {
      "name": "computer science",
      "weight": 0.055948853
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.7900390625
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.7236328125
    }
  ],
  "sentiment": {
    "positive": 0.10204803,
    "negative": 0.5380983,
    "neutral": 0.35985368
  },
  "summary": "Geonon Hinton, a Nobel Prize-winning computer scientist known as the \"godfather of AI,\" has warned that without the development of \"maternal instincts\" in advanced systems, AI may wipe out humanity. Hinton argued that making AI submissive is a losing strategy and suggested giving advanced systems \"motherless\" maternal instincts. He likened human manipulation by future AI to bribing a 3-year-old with candy, making it easier and effective for future AIs to manipulate humans. Hatton also shortened his AGI timeline to around five to 20 years, down from earlier estimates. His proposal shifts the mindset around agentic AI from control to alignment-by-care. While Hinton believes that AI may one day wipe out humans, competing views disagree.",
  "shortSummary": "Geofrey Hinton, known as the “godfather of AI” for his advocacy for building “maternal instincts” to prevent AI from destroying humanity.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "cd3ea0d166174890aeb597428e70e3ec",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://edition.cnn.com/2025/08/13/tech/ai-geoffrey-hinton",
      "text": "Geoffrey Hinton, known as the “godfather of AI,” fears the technology he helped build could wipe out humanity — and “tech bros” are taking the wrong approach to stop it.\nHinton, a Nobel Prize-winning computer scientist and a former Google executive, has warned in the past that there is a 10% to 20% chance that AI wipes out humans. On Tuesday, he expressed doubts about how tech companies are trying to ensure humans remain “dominant” over “submissive” AI systems.\n“That’s not going to work. They’re going to be much smarter than us. They’re going to have all sorts of ways to get around that,” Hinton said at Ai4, an industry conference in Las Vegas.\nIn the future, Hinton warned, AI systems might be able to control humans just as easily as an adult can bribe 3-year-old with candy. This year has already seen examples of AI systems willing to deceive, cheat and steal to achieve their goals. For example, to avoid being replaced, one AI model tried to blackmail an engineer about an affair it learned about in an email.\nInstead of forcing AI to submit to humans, Hinton presented an intriguing solution: building “maternal instincts” into AI models, so “they really care about people” even once the technology becomes more powerful and smarter than humans.\nAI systems “will very quickly develop two subgoals, if they’re smart: One is to stay alive… (and) the other subgoal is to get more control,” Hinton said. “There is good reason to believe that any kind of agentic AI will try to stay alive.”\nThat’s why it is important to foster a sense of compassion for people, Hinton argued. At the conference, he noted that mothers have instincts and social pressure to care for their babies.\n“The right model is the only model we have of a more intelligent thing being controlled by a less intelligent thing, which is a mother being controlled by her baby,” Hinton said.\n‘The only good outcome’\nHinton said it’s not clear to him exactly how that can be done technically but stressed it’s critical researchers work on it.\n“That’s the only good outcome. If it’s not going to parent me, it’s going to replace me,” he said. “These super-intelligent caring AI mothers, most of them won’t want to get rid of the maternal instinct because they don’t want us to die.”\nHinton is known for his pioneering work on neural networks, which helped pave the way to today’s AI boom. In 2023, he stepped down from Google and started speaking out about the dangers of AI.\nNot everyone is on board with Hinton’s mother AI approach.\nFei-Fei Li, known as the “godmother of AI” for her pioneering work in the field, told CNN on Wednesday that she respectfully disagrees with Hinton, her longtime friend.\n“I think that’s the wrong way to frame it,” Li, the co-founder and CEO of spatial intelligence startup World Labs, said during a fireside chat at Ai4.\nInstead, Li is calling for “human-centered AI that preserves human dignity and human agency.”\n“It’s our responsibility at every single level to create and use technology in the most responsible way. And at no moment, not a single human should be asked or should choose to let go of our dignity,” Li said. “Just because a tool is powerful, as a mother, as an educator and as an inventor, I really believe this is the core of how AI should be centered.”\nEmmett Shear, who briefly served as interim CEO of ChatGPT owner OpenAI, said he’s not surprised that some AI systems have tried to blackmail humans or bypass shutdown orders.\n“This keeps happening. This is not going to stop happening,” Shear, the CEO of AI alignment startup Softmax, said at the Ai4 conference. “AIs today are relatively weak, but they’re getting stronger really fast.”\nShear said that rather than trying to instill human values into AI systems, a smarter approach would be to forge collaborative relationships between humans and AI.\nAI is accelerating faster than expected\nMany experts believe AIs will achieve superintelligence, also known as artificial general intelligence, or AGI, in the coming years.\nHinton said he used to think it could take 30 years to 50 years to achieve AGI but now sees this moment coming sooner.\n“A reasonable bet is sometime between five and 20 years,” he said.\nWhile Hinton remains concerned about what could go wrong with AI, he is hopeful the technology will pave the way to medical breakthroughs.\n“We’re going to see radical new drugs. We are going to get much better cancer treatment than the present,” he said. For instance, he said AI will help doctors comb through and correlate the vast amounts of data produced by MRI and CT scans.\nHowever, Hinton does not believe AI will help humans achieve immortality.\n“I don’t believe we’ll live forever,” Hinton said. “I think living forever would be a big mistake. Do you want the world run by 200-year-old white men?”\nAsked if there’s anything he would have done differently in his career if he knew how fast AI would accelerate, Hinton said he regrets solely focusing on getting AI to work.\n“I wish I’d thought about safety issues, too,” he said."
    }
  ],
  "argos_summary": "Geoffrey Hinton, the 'godfather of AI,' warned at the Ai4 conference that current strategies to make AI submissive are ineffective, suggesting instead that AI should be designed with 'maternal instincts' to care for humanity. He expressed concerns about superintelligent AIs developing goals to stay alive and gain control, advocating for a shift in focus from control to alignment-by-care. While Hinton acknowledges the potential for AI to bring medical advancements, he emphasizes the importance of addressing safety and ethical considerations as AI technology accelerates towards superintelligence.",
  "argos_id": "G93JRNY3U"
}