{
  "url": "https://www.latimes.com/socal/daily-pilot/news/story/2025-08-14/scenic-fundraiser-backs-local-conservancys-effort-to-save-a-rare-newport-beach-estuary",
  "authorsByline": "By Sara CardineStaff Writer  Follow",
  "articleId": "124e30ba366c4cee93f130cae06920eb",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/db3426e/2147483647/strip/true/crop/3534x1855+0+188/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F0b%2F58%2Fbbef22554694a20f5e45f41bf357%2Fgbtb-bay-photo-bryan.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T22:22:42.129000+00:00",
  "addDate": "2025-08-14T22:31:48.804036+00:00",
  "refreshDate": "2025-08-14T22:31:48.804038+00:00",
  "score": 1.0,
  "title": "Scenic fundraiser backs local conservancy's effort to save a rare Newport Beach estuary",
  "description": "Since 1967, the Newport Bay Conservancy has worked to preserve the Upper Newport Bay. A fundraiser Saturday aims to support a massive, multi-million dollar restoration of the ecological jewel.",
  "content": "The Newport Bay Conservancy hosts an annual Gourmet by the Bay fundraiser in support of its efforts to preserve and restore the Upper Newport Bay, seen in 2024.\n\nFor more than half a century, the Newport Bay Conservancy has wrapped its collective arms around the 1,000-acre Upper Newport Bay to protect the ecologically important habitat from the encroachment of development, invasive species and other worldly harms.\n\nSince 1967, a stalwart team of biologists, philanthropists and legions of volunteers have worked to educate the public about the estuary that provides a home, refuge and crossing to hundreds of species of fish birds and other wildlife, many of which are endangered.\n\nFrom school visits and kayak tours to coastal cleanups and a volunteer-run native plant nursery, the conservancy’s outreach touches more than 50,000 visitors annually. A broader, multiyear effort to reconstruct and restore the Bay and its watershed began in 2018 and is about to head into its largest and most transformative work to date.\n\nYet, on one evening each year, the conservancy’s stakeholders join together, surrounded by the pristine natural beauty they’ve vowed to preserve, to raise their glasses to the efforts of the past year and to look ahead to the future — and it’s time once more for Gourmet by the Bay.\n\nThe seventh annual fundraising dinner takes place this Saturday, from 5 to 8 p.m. at the Peter and Mary Muth Interpretive Center in Newport Beach, with sunset views, live music, a silent and live auction as well as a farm-to-table dinner catered by Chef Nicoletta Grippo and drinks from Tap Truck Orange County, all served on a patio overlooking the scenic Back Bay.\n\nBilled as “an evening designed to delight your senses,” Gourmet by the Bay is both a gathering of and a thank you to the many people who bring the organization’s mission and vision to life through their volunteerism and philanthropy, according to Heather Cieslak, the conservancy’s operations director.\n\n“This gives us an opportunity for our friends to come together and have a night at the Bay on the patio and get a chance to celebrate the accomplishments of the conservancy throughout the year,” she said Wednesday.\n\n“It’s a natural evening, a chance to see birds flying by, see the changing of the tides and watch the sun set — it’s really stunning,” Cieslak added. “We don’t really decorate — one of our things is to let the resource speak for itself.”\n\nProceeds from the event will support the work of the Newport Bay Conservancy as it embarks on a crucial third phase of a larger “restoration era,” during which it will lead a multi-million dollar restoration and adaptation of the , a natural canyon on the Bay’s east side.\n\nThat work is set to begin this fall and includes restoring 14 acres of historical salt marsh and creating transitional wetland habitats that will help build the resilience of sensitive species as sea levels rise and salt water intrusion increases.\n\nA collaboration of partners, from the city of Newport Beach and California Coastal Conservancy to state and federal wildlife agencies, are helping to fund the project, through grants and reimbursements, and monitor the restored areas in the years after work has been completed.\n\nBut as the project lead, the Newport Bay Conservancy will be responsible for initiating the work and coming up with the funds to get the ball rolling, another reason why this year’s Gourmet by the Bay’s fundraising efforts are especially crucial, officials say.\n\nFor Cieslak, the important effort is worth undertaking if it means restoring and preserving the Bay’s ecological presence in Orange County and California at large.\n\n“These natural estuaries are few and far between on our California coastline, because over 90% of coastal estuaries have been developed over,” she said. “These areas, these buffer zones, are so important for wildlife, for migrating birds and for our own health and wellness.”\n\nGourmet by the Bay takes place Saturday, at 5 p.m., at the Peter and Mary Muth Interpretive Center, 2301 University Drive, Newport Beach. General admission is $120 for members, $145 for non-members. For more details, visit .",
  "medium": "Article",
  "links": [
    "https://newportbay.org/",
    "https://www.latimes.com/socal/daily-pilot/news/story/2023-08-12/big-canyon-restoration-project-in-newport-beach-to-begin-third-phase-in-fall-2024",
    "https://www.latimes.com/socal/daily-pilot/news",
    "https://newportbay.org/projects/big-canyon-project/",
    "https://www.eventbrite.com/e/gourmet-by-the-bay-tickets-1406588737779"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Upper Newport Bay",
      "weight": 0.10321947
    },
    {
      "name": "Bay",
      "weight": 0.088458754
    },
    {
      "name": "Back Bay",
      "weight": 0.086221434
    },
    {
      "name": "Newport Beach",
      "weight": 0.079643406
    },
    {
      "name": "The Newport Bay Conservancy",
      "weight": 0.06416447
    },
    {
      "name": "the Newport Bay Conservancy",
      "weight": 0.06416447
    },
    {
      "name": "California Coastal Conservancy",
      "weight": 0.06298391
    },
    {
      "name": "the Upper Newport Bay",
      "weight": 0.06091692
    },
    {
      "name": "coastal estuaries",
      "weight": 0.056915533
    },
    {
      "name": "other wildlife",
      "weight": 0.05446796
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.916015625
    },
    {
      "name": "/News/Local News",
      "score": 0.798828125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Charity & Philanthropy",
      "score": 0.71826171875
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Regional Parks & Gardens",
      "score": 0.53662109375
    },
    {
      "name": "/Science/Ecology & Environment/Other",
      "score": 0.480224609375
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Other",
      "score": 0.380859375
    }
  ],
  "sentiment": {
    "positive": 0.6851272,
    "negative": 0.049148135,
    "neutral": 0.26572472
  },
  "summary": "The Newport Bay Conservancy has hosted its seventh annual fundraiser, Gourmet by the Bay, in support of its efforts to preserve and restore the Upper Newport Bay, a rare estuary in Newport Beach, California. The event, which takes place from 5 to 8 p.m. at the Peter and Mary Muth Interpretive Center, will be a thank you night to the many people who contribute to the conservancy's mission and vision. Proceeds from the event will support the Newport Bay conservancy as it begins a multi-million dollar restoration and adaptation of the natural canyon on the Bay's east side. The work includes restoring 14 acres of historical salt marsh and creating transitional wetland habitats to help build the resilience of sensitive species as sea levels rise and salt water intrusion increases.",
  "shortSummary": "The Newport Bay Conservancy hosts the annual Gourmet by the Bay fundraiser to support its multi-million dollar restoration and adaptation of the Upper Newport Bay.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4d670c8fac64436e85ae4c2d6889eb15",
  "places": [
    {
      "osmId": "307535574",
      "road": "Back Bay Loop Trail",
      "town": "Newport Beach",
      "county": "Orange County",
      "state": "California",
      "postcode": "92660",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 33.65335905,
        "lon": -117.88541481690777
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://newportbay.org/",
      "text": "Newport Bay Conservancy (NBC) is focused exclusively on the protection and preservation of Upper Newport Bay – one of the most precious natural resources in Southern California.\nVisitors\nGetting out on the water is one of the best ways of viewing the birds and other wildlife up close. The Newport Bay Conservancy offers a guided kayak tour every Saturday morning year-round in partnership with the Newport Aquatic Center located at Northstar Beach.\nStudents\nHow to Help\nAmong the very few remaining, undeveloped wetlands on the California coast located in Orange County, Upper Newport Bay is recognized as a globally significant hotspot of biodiversity. NBC works to sustain an amazing diversity of marine, plant and animal life in its stewardship of the Bay.\nRestoration of native habitat is one of NBC’s primary activities, bringing together highly trained experts, committed volunteers, the public, and local businesses in the process of uprooting invasive plants and returning the proper plant life to encourage biodiversity.\nThe environmental education programs NBC provides for both academic students of all ages and the general public enhance their knowledge and appreciation of the Bay; increased awareness of the role everyone plays in protecting the environment is essential.\nSupporting research in the the square mile of protected tidelands and uplands of the Bay builds our knowledge of this rich biosphere, while proper science-based management helps sustain the 154 square mile watershed of central Orange County that drains to the Pacific via the Bay.\nNBC seeks to advocate for residents of central Orange County and many of our visitors from far and wide to enjoy the natural beauty of this precious resource and to learn more about its ecological value.\nAs NBC strives to protect and preserve the Upper Newport Bay, we also aim to foster human diversity by creating a culture in which every visitor, volunteer, public steward, partner, member and employee feels at home. Upper Newport Bay welcomes people of all races, genders, nations, ages, abilities, and backgrounds."
    },
    {
      "url": "https://www.latimes.com/socal/daily-pilot/news/story/2023-08-12/big-canyon-restoration-project-in-newport-beach-to-begin-third-phase-in-fall-2024",
      "text": "Big Canyon restoration project in Newport Beach to begin third phase in fall 2024\n- Share via\nConstruction for the third and final phase of the Big Canyon restoration project is now scheduled for fall 2024, according to the Newport Bay Conservancy, having received final approvals for a coastal permit application from the state Coastal Commission on Thursday.\nThe final phase affects 29.5 acres of Big Canyon Nature Park, one of the biggest tributaries to upper Newport Bay. Roughly 45 acres of the park are designated as Big Canyon Nature Park and owned by the city of Newport Beach, while the lower 15 acres are owned by the California Department of Fish and Wildlife. That section lies within the Upper Newport Bay State Ecological Reserve, where Phase III will take place.\nThe first phase included hydrology improvements in the northernmost 6 acres, while the second focused on restoration and drainage improvements in the 11.3 acres of the canyon immediately to the west of the Phase I site, according to Coastal Commission staff. Phase II was completed in 2021.\nThe final phase seeks to address restoration of the native salt marshes, realignment of existing freshwater flows to improve drainage and water quality, and final improvements to the existing public trails and signage throughout the park.\nAs part of the approval, the Coastal Commission required a habitat restoration plan, nesting bird protection measures, herbicide use protocols, other agency approvals, construction best-management practices, a construction staging plan, assumption of risk and protection of archaeological and tribal cultural resources.\nThe restoration project is organized through the efforts of the Newport Bay Conservancy, the city of Newport Beach and CDFW.\n“On behalf of the project partners, we thank the Coastal Commission for its ongoing support of this important project, which has already made significant progress in the first two phases,” Newport Beach spokesman John Pope said following the approval Thursday. “The Big Canyon restoration removes a major mosquito breeding area, creates an open water area for marine birds and animals, eliminates invasive plants and restores native plants. We encourage the public to view the restoration efforts and educators to lead ecological tours of the area.”\nNewport Bay Conservancy restoration manager Alys Arenas said the conservancy is waiting on other permits, but the delay in construction is because of the nesting and breeding seasons, which span from March to September.\n“We have a short window from Sept. 15 to March 15 to get any ground-moving work, basic removal, planting, and then it’ll fall into monitoring and maintenance period. The short term will be 120 days, but after that, it’s three to five years of monitoring and maintenance before it can be called complete,” Arenas said.\n“It is a unique area. You can consider this area a transitional zone. It’s a buffer between our wetland habitats and ... it’s significantly important because of long-term sea level rise,” Arenas continued. “As we get higher sea level rise, there’s going to be a higher marsh for the water to recede and for the wildlife to rely on as we do expect some of our marsh to be underwater in 50 years. It’s important that, as well as aside from recreational activities, we provide habitat for wildlife and educational benefits.”\nPhase III is projected to cost about $6 million. The total cost for the permitting, planning, design and implementation of all three phases is estimated to be between $10 million and $11 million."
    },
    {
      "url": "https://newportbay.org/projects/big-canyon-project/",
      "text": "Big Canyon is the largest remaining natural canyon on the east side of Newport Bay. The Conservancy is the final phase of the multi-phase water quality, restoration, and adaptation project in Big Canyon Nature Park. The 60-acre open space is located at the downstream end of the Big Canyon Watershed in the City of Newport Beach, within Orange County, California. Big Canyon Creek drains the 1,300-acre Big Canyon Watershed directly into the Upper Newport Bay Ecological Reserve (UNBER) and State Marine Conservation Area. The area it has been heavily influenced by the construction of a salt evaporation pond, historical placement of dredge and fill material, interim restoration efforts, and other human activities. Stockpiling of dredge fill during the 1950s and 1960s within Big Canyon Creek raised the elevations within the canyon and consequently channelized the creek to the north. The creek now winds through the Nature Park in a general southeast to northwest direction and then discharges into Upper Newport Bay.\nPHASE III Groundbreaking coming Fall 2025. Phase III consists of several components, including restoring 14 acres of historical salt marsh and establishment of transitional wetland habitats, providing long-term benefits to climate resiliency along the California coast. This Project provides a unique opportunity to establish transitional zones as sea level rise (SLR) alters habitats within the UNBER. Phase III proposes to extend the saltwater influence into the Project limits, allowing the tidal extent and inundation to increase with SLR. Transitional zones will allow migration of salt marsh vegetation with future SLR to improve the overall resiliency of salt marsh in UNB, supporting sensitive coastal habitats and several federally and state listed species. Design below courtesy of Burns & McDonnell.\nPHASE II Monitoring and Maintenance Ongoing. Check out this plant palate featuring what was planted to start recognizing them as they grow or join us on Thursday mornings as we make sure we keep the site free of any non-native invasive plants. Phase 2A also included the HUGE task of removing a 6-acre infestation of Brazilian Pepper Trees. Check out why this was so important through watching the Project Kickoff video on YouTube.\nProject Partners & Funders:\nCalifornia State Coastal Conservancy\nUS Fish & Wildlife Service\nOcean Protection Council\nCalifornia Department of Fish and Wildlife\nCity of Newport Beach\nBurns & McDonnell\nESA\nFor more information on Big Canyon, visit the City of Newport Beach’s Resource and Recreation Management Plan for the entire space."
    },
    {
      "url": "https://www.eventbrite.com/e/gourmet-by-the-bay-tickets-1406588737779",
      "text": "Newport Bay Conservancy (NBC) invites you to an evening designed to delight your senses. Nature is complex, diverse, and finely balanced, just like the best of cuisines. Chef Nicoletta Grippo (@do_or_dine_catering) is returning with her Farm to Table Catering. She is committed to making only the highest quality food, using sustainable ingredients, and making everything from scratch. Grab wine, beer, or a featured drink and enjoy the outdoor patio. There is no better place to see nature in all its beauty, than right over the Bay.\nEnjoy a silent auction, live music, spectacular views, and dinner with like-minded supporters of the Bay. Net proceeds from the event will go to support the Conservancy’s ongoing programs.\nIndividual tickets are $120 members, $145 non-members (which includes Pelican-level membership).\nNot available that day? No problem, support our mission by clicking on the event tickets or visiting our website making a donation. Or become a GBTB sponsor or contribute an item or experience to our silent auction.\nWant to be a sponsor/buy a table? Other ticketing options include:\nSupporting Sponsor $200: Admission for one and recognition at event, NBC's website, & social media\nBronze Sponsor $400: All perks of being a supporting sponsor and admission for two.\nSilver Sponsor $800: All perks of being a supporting sponsor and admission for four.\nGold Sponsor $1,200: All the perks as a supporting sponsor, one table (seats 6) and a guided walking or water tour for 6.\nPlatinum Sponsor $2,500: All the perks as a supporting sponsor, two tables (seats 12) and a guided walking or water tour for 12.\nPlatinum Sponsors:"
    }
  ],
  "argos_summary": "The Newport Bay Conservancy is hosting its annual Gourmet by the Bay fundraiser to support the preservation and restoration of the Upper Newport Bay, a vital ecological habitat. The event, featuring a farm-to-table dinner and auctions, aims to raise funds for a significant restoration project set to begin this fall, which includes restoring historical salt marshes and creating transitional wetland habitats. With a history of over 50 years of conservation efforts, the conservancy engages the public through various educational programs and volunteer opportunities, emphasizing the importance of protecting this unique coastal ecosystem.",
  "argos_id": "GBRZYNMAP"
}