{
  "url": "https://www.sfchronicle.com/sports/article/love-s-absence-colts-qb-battle-are-feature-20818410.php",
  "authorsByline": "AP Sports Writer, By MICHAEL MAROT",
  "articleId": "f229693208484e2c85ff0466ca0b0ef6",
  "source": {
    "domain": "sfchronicle.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T23:28:33+00:00",
  "addDate": "2025-08-15T00:10:58.226935+00:00",
  "refreshDate": "2025-08-15T00:10:58.226936+00:00",
  "score": 1.0,
  "title": "Love's absence, Colts QB battle are feature attractions of joint practice with Packers",
  "description": "Green Bay Packers quarterback Jordan Love says it was the right choice to have surgery to repair a torn ligament in the thumb of his non-throwing hand because the season hasn't started. Love sat out...",
  "content": "Yes, the joint practice between the Green Bay Packers and Colts just outside Indianapolis went just like any other training camp practice — with all eyes studying the good, bad and ugly of the quarterbacks.\n\n“Had a torn ligament in my thumb and we did a surgery to repair it. So on the road to recovery,” Love said in his first public comments since having the procedure earlier this week on his non-throwing hand. “If this was in the middle of the season, we probably would have been doing something that we didn't get the surgery on. But with it still being early, having time to recover and be fully ready for Week 1, the recommendation was for surgery.”\n\nThe hope is Love begins working his way back next week and will have a couple of additional weeks to recover before Green Bay's Sept. 7 season opener against Detroit. Love said it hasn't been decided whether he'll participate in next week's joint practice with Seattle.\n\n“I think easing back into it, we might do some things differently just to protect the thumb for now,” Love said. “That's one of those things where, after having the surgery, you don't want to go back out there and re-injure it before the season. So we'll be smart with it.”\n\nLove was injured on the final play of Green Bay's second series in last week's loss to the New York Jets. Initially, he said he didn't think anything was wrong, but he talked with trainers to see what they thought. While he practiced Monday, Love was making handoffs with his right hand instead of his left.\n\nRichardson is expected to get his most extensive action of the preseason when the Colts and Packers square off Saturday. Coach Shane Steichen said earlier this week he plans to use Jones for the first two series and let Richardson take most of the first-half snaps.\n\nThat assumes Richardson stays healthy. He missed some of Indy's offseason workouts with a sore throwing shoulder, and then dislocated the pinkie on his throwing hand during last week's preseason loss at Baltimore. Trainers popped the finger back into place, but Richardson didn't take another snap against the Ravens because he couldn't grip the ball properly.\n\n“I think that's natural,” Jones said when asked if he wonders when a winner will emerge. “I think in this position, obviously, you're aware of it and are thinking about it. But I think you know that strategy for me and anyone in this situation is kind of focus as much as you can on what you need to do.”\n\n“I think our youth showed a little bit today in some instances with the injuries we have,” Packers tight end Tucker Kraft said. “We're out here, full pads, expecting big things from some of the guys we're elevating and I think we just left some meat on the bone.”",
  "medium": "Article",
  "links": [
    "https://x.com/i/status/1956076154814685622",
    "https://apnews.com/hub/nfl"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "next week",
      "weight": 0.09064743
    },
    {
      "name": "Green Bay Packers",
      "weight": 0.08655346
    },
    {
      "name": "additional weeks",
      "weight": 0.08450707
    },
    {
      "name": "Love",
      "weight": 0.074470684
    },
    {
      "name": "joint practice",
      "weight": 0.06952169
    },
    {
      "name": "Packers tight end Tucker Kraft",
      "weight": 0.068020955
    },
    {
      "name": "Colts QB battle",
      "weight": 0.06533883
    },
    {
      "name": "big things",
      "weight": 0.061917387
    },
    {
      "name": "next weeks joint practice",
      "weight": 0.061832897
    },
    {
      "name": "Richardson",
      "weight": 0.06081716
    }
  ],
  "topics": [
    {
      "name": "Football"
    },
    {
      "name": "NFL"
    },
    {
      "name": "Green Bay Packers"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.970703125
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.96875
    }
  ],
  "sentiment": {
    "positive": 0.116945,
    "negative": 0.48578978,
    "neutral": 0.39726517
  },
  "summary": "The joint practice between the Green Bay Packers and Indianapolis Colts took place outside of Indianapolis. Quarterback Love underwent surgery to a torn ligament on his non-throwing hand, and it is unclear if he will participate in next week's joint practice with Seattle. The hope is Love will begin working his way back next week and have several more weeks to recover before Green Bay's Sept. 7 season opener against Detroit. Meanwhile, the Colts are set to play against the Packers, with Jones expected to play the first two series and Richardson expected to take most of the first-half snaps.",
  "shortSummary": "The absence of injured Green Bay Packers quarterback Love and a potential shootout with the Colts highlights the team's injury concerns ahead of the season opener.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f36d921618e4461da10814aa83299e31",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "During a joint practice between the Green Bay Packers and Indianapolis Colts, quarterback Jordan Love discussed his recent thumb surgery and his recovery timeline, aiming to be ready for the season opener against Detroit. Love expressed caution about returning to practice to avoid re-injury. Meanwhile, Colts quarterback Anthony Richardson is set to play extensively in the upcoming preseason game, despite recent injuries affecting his performance.",
  "argos_id": "GTFLYN8ET"
}