{
  "url": "https://www.forbes.com/sites/robreischel/2025/08/14/the-good-bad-and-ugly-the-green-bay-packers-joint-practice-with-the-colts/",
  "authorsByline": "Rob Reischel",
  "articleId": "b6969c32655843e4883ce85ec3f0f524",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/62fe40baadccff017f1dbcbd/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T22:22:53+00:00",
  "addDate": "2025-08-14T22:31:54.873677+00:00",
  "refreshDate": "2025-08-14T22:31:54.873680+00:00",
  "score": 1.0,
  "title": "The Good, Bad And Ugly The Green Bay Packers’ Joint Practice With The Colts",
  "description": "The Green Bay Packers and Indianapolis Colts had a spirited practice Thursday that was dominated by both defenses.",
  "content": "Just minutes before the Green Bay Packers and Indianapolis Colts held a joint practice Thursday, Packers coach Matt LaFleur was asked what he was looking for.\n\n“I expect our guys to compete to the best of their ability and keep it clean,” LaFleur said. “I think that’s reasonable to expect. We haven't had any of those in practice. I don’t see why it has to happen now.\n\n“The beauty is they’re an AFC team, we’re an NFC team. We don’t play each other in the regular season. If we play each other at the end of this thing, that’s a win for everybody. So, the goal is just to get better today.\n\nFor the most part, LaFleur got what he wanted.\n\nThe two teams had a spirited practice that was dominated by both defenses. Now, Green Bay and Indianapolis will meet in the second preseason game of the year Saturday at noon.\n\nHere’s the good, bad and ugly from the joint practice compiled from multiple reports.\n\nLOVE STORY: Two days after undergoing surgery to repair a ligament in non-throwing (left) thumb, Green Bay quarterback Jordan Love was in Indianapolis with his team.\n\n“He’s in great spirits. He’s here with us,” Packers coach Matt LaFleur said. “So, yeah, now it’s about just about putting in the work to get the thumb rehabbed.”\n\nLove was injured after taking a sack on his final snap of the preseason opener on Aug. 9 against the New York Jets.\n\nLove won't take the field for joint practices and exhibition games against both Indianapolis and Seattle over the next nine days. He could practice as early as next week, though, and expects to be fully healthy for Week 1.\n\n“I think with the timeframe that we have right now, finishing up training camp and preseason and heading into the season with the choice to be going into the season 100% healthy was definitely the call I wanted to make,” Love said. “Dealing with injuries last year, I wanted to go into this thing feeling good.”\n\nUNDER PRESSURE: Green Bay finished ninth in the league with 45 sacks last season. The Packers’ pressure was inconsistent, though, and defensive coordinator Jeff Hafley had to get creative with his blitz packages.\n\nThat wasn’t the case Thursday, as the Packers got after Indianapolis quarterbacks throughout.\n\nEarly in practice, end Rashan Gary beat right tackle Braden Smith for a sack. Moments later, end Lukas Van Ness beat left tackle Bernhard Raimann for sack of his own.\n\nLater, linebackers Quay Walker and Ty’Ron Hopper got home on blitzes, and defensive tackle Colby Wooden had a sack after a dominant inside rush.\n\nVan Ness added a second sack before the practice was over, and rookie Barryn Sorrell had a sack of his own.\n\n“We came together collectively after the Jets game and knew we had to come out with a little more passion, a little more fight,” Van Ness said. “I think we did today.”\n\nGETTING DEFENSIVE: The Colts were a middle-of-the-pack 13th in total offense and 17th in scoring offense last season. The Packers made them look like a bottom feeder throughout the day, though.\n\nIn addition to Green Bay’s consistent pressure, cornerbacks Keisean Nixon and Johnathan Baldwin had interceptions. Linebacker Isaiah Simmons had an interception in the 2-minute drill and safety Evan Williams recovered a fumble that was forced by fellow safety Javon Bullard.\n\n“We’ve just got to keep stacking,” Van Ness said. “As good as it was, I look at the bad things. I think we gotta close out practice better. That’s something to look forward to and improve and be better for moving forward.”\n\nAUTOMATIC: Kicker Brandon McManus was 5-for-5 on field goals and is now 61 of 65 on all of his kicks this summer (93.8%). McManus made field goals from 38, 41, 44, 47 and 56 yards.\n\nRookie Mark McNamee also made all three of his kicks, connecting from 45 yards twice and also drilling a 47-yarder.\n\nTHIS AND THAT: Left tackle Rasheed Walker (groin) returned to practice. Walker, who’s made 35 starts at left tackle the last two seasons, is battling second-year man Jordan Morgan for that job. … Running back Israel Abandikanda (hamstring) also returned to practice. … Green Bay No. 4 quarterback Taylor Elgersma completed four straight passes in a 2-minute drill late in practice, but that drive eventually died.\n\nHEAD ‘HUNTER’: Colts rookie safety Hunter Wohler, a former standout at the University of Wisconsin and Muskego High School, sent Packers rookie wideout Matthew Golden to the ground with a shoulder shot.\n\nGolden was running a crossing route, quarterback Malik Willis overthrew him, then Wohler sent him to the ground. Packers tight end Tucker Kraft got in Wohler’s face, but things didn't escalate.\n\nANOTHER ONE BITES THE DUST: Wide receiver Romeo Doubs suffered a back injury in Tuesday’s practice and missed the joint practice. Wideouts Jayden Reed (foot), Dontayvion Wicks (calf) and Savion Williams (hamstring) also didn't practice.\n\nThat meant of the Packers’ top five receivers, only rookie Matthew Golden was available.\n\nFROM THE INFIRMARY: In addition to the Packers’ dearth of wideouts, the following players didn’t practice: quarterback Jordan Love, safeties Xavier McKinney and Zayne Anderson, and cornerback Nate Hobbs.\n\nOFFENSIVE: The Packers were without quarterback Jordan Love and four of their top five receivers. So it was really no surprise that the offense had a tough day.\n\nIn a two-minute drill at the end of practice, quarterback Malik Willis went 0-for-4.\n\nWillis also had a rough start playing with several receivers that are extreme long shots to make the final roster. Willis did complete a 35-yard pass to Mecole Hardman and a 20-yarder to Julian Hicks midway through the practice, but overall the offense struggled.\n\n“Our youth showed a little bit in some instances with the injuries that we have on our depth chart,” tight end Tucker Kraft said. “So we had guys coming up and playing. We're out here, full pads, expecting big things from some of the guys that we're elevating and just, we left some meat on the bone.\n\n“We were doing a good job competing, but we know the level that we expect to play at and I personally just didn't — I didn't think that we had all — we didn't empty the tank.”",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Green Bay quarterback Jordan Love",
      "weight": 0.07810026
    },
    {
      "name": "joint practices",
      "weight": 0.07444285
    },
    {
      "name": "practice",
      "weight": 0.07144393
    },
    {
      "name": "Packers rookie wideout Matthew Golden",
      "weight": 0.071022786
    },
    {
      "name": "quarterback Jordan Love",
      "weight": 0.0696451
    },
    {
      "name": "Packers tight end Tucker Kraft",
      "weight": 0.06806567
    },
    {
      "name": "Packers coach Matt LaFleur",
      "weight": 0.066044234
    },
    {
      "name": "Green Bay",
      "weight": 0.06333064
    },
    {
      "name": "Indianapolis quarterbacks",
      "weight": 0.06259195
    },
    {
      "name": "Colts rookie safety Hunter Wohler",
      "weight": 0.062311053
    }
  ],
  "topics": [
    {
      "name": "Football"
    },
    {
      "name": "NFL"
    },
    {
      "name": "Green Bay Packers"
    },
    {
      "name": "Indianapolis Colts"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97314453125
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.94921875
    }
  ],
  "sentiment": {
    "positive": 0.16397403,
    "negative": 0.5068048,
    "neutral": 0.3292211
  },
  "summary": "The Green Bay Packers and Indianapolis Colts held a joint practice, which was largely dominated by both teams' defenses. The two teams will face each other in the second preseason game of the year on Saturday. Green Bay quarterback Jordan Love was present with the team, two days after undergoing surgery to repair a ligament in his thumb. Love is expected to be fully fit for the season opener and could practice as early as next week. Despite this, Green Bay's pressure was inconsistent, with the Colts' defense showing consistent pressure throughout the day. The Packers finished ninth in the league with 45 sacks last season. The team's kicking is improving, with kicker Brandon McManus making five field goals this summer.",
  "shortSummary": "The Green Bay Packers and Indianapolis Colts held a joint practice, showcasing strong defensive performances and significant injuries, ahead of their upcoming clash.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e5cd1307a8f04110b0088dc15ec16664",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "During a joint practice between the Green Bay Packers and Indianapolis Colts, Packers coach Matt LaFleur emphasized the importance of competition and maintaining a clean practice. The Packers' defense excelled, with multiple players recording sacks and interceptions, while the offense struggled due to the absence of key players, including quarterback Jordan Love and several top receivers. Kicker Brandon McManus had a perfect day, making all his field goals, but overall, the Packers faced challenges with their offensive performance.",
  "argos_id": "I2HL521ML"
}