{
  "url": "https://www.ksl.com/article/51360910/whats-happening-at-las-2028-summer-games-for-the-first-time",
  "authorsByline": "Deseret Digital Media",
  "articleId": "409f363fc8914832b28d884eeaa942db",
  "source": {
    "domain": "ksl.com",
    "location": null
  },
  "imageUrl": "https://img.ksl.com/slc/3106/310615/31061580.jpg?filter=kslv2/responsive_story_lg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T00:45:36+00:00",
  "addDate": "2025-08-15T00:50:31.454277+00:00",
  "refreshDate": "2025-08-15T00:50:31.454279+00:00",
  "score": 1.0,
  "title": "What's happening at LA's 2028 Summer Games for the first time",
  "description": "During the 2028 Summer Games in Los Angeles, venues will be able to display the names of corporate sponsors for the first time.",
  "content": "LOS ANGELES — During the 2028 Summer Games in Los Angeles, venues will be able to display the names of corporate sponsors for the first time.\n\nNaming rights have already been sold for squash, boxing and weightlifting venues at the Comcast Squash Center and Peacock Theater at Universal Studios and for the volleyball venue at the Honda Center in Anaheim, the LA28 organizing committee announced Thursday.\n\nThe new moneymaker for both the LA Games and the U.S. Olympic and Paralympic Committee is a pilot program that could see other existing venue names used at the Olympics along with new names for up to 19 temporary venues.\n\nIn addition to keeping their existing venue naming rights during Games time, the organizing committee said companies that sign on to the new program will also \"secure additional marketing assets to significantly bolster their activation efforts.\"\n\nVenues that could be identified by their current names include SoFi Stadium, home to the NFL's Los Angeles Rams and Los Angeles Chargers. The stadium, which will host Olympic swimming, had been referred to by organizers as \"2028 Stadium\" or the \"Stadium in Inglewood.\"\n\nThat's because previously, venues were expected to be \"clean,\" scrubbed of any commercialization under International Olympic Committee rules. The pilot program gives the IOC's top-level international sports the first chance to purchase eligible rights.\n\nCasey Wasserman, LA28's chair and president, called the new revenue stream historic.\n\n\"These groundbreaking partnerships with Comcast and Honda, along with additional partners to come, will not only generate critical revenue for LA28 but will introduce a new commercial model to benefit the entire movement,\" Wasserman said in a statement.\n\nThe amount of money expected to be raised from selling naming rights for the $7.1 billion LA Games was not disclosed. Wasserman said the deals are \"advancing LA28's mission of a fully privately funded and no-new-build Games.\"\n\nOrganizers of Utah's 2034 Winter Games are also counting only on private sources of revenue to cover the $4 billion price tag and on reusing venues from the last time the state hosted an Olympics, in 2002, along with temporary competition sites.\n\nIt's not clear if the option of selling naming rights will be available for the 2034 Games, but it would likely be a welcome source of additional revenue.\n\nDuring the 2002 Games, the Delta Center was called the Salt Lake Ice Center, even though the airline was a sponsor. Now home to the Utah Mammoth hockey team as well as the Utah Jazz, the arena will be the site of Olympic hockey in 2034.\n\nA Bloomberg News story at the time reported that on a single night of figure skating coverage on NBC, the airline could have gained exposure worth an estimated $4.3 million had commentators referred to the arena as the Delta Center instead of the generic name.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Games time",
      "weight": 0.09729781
    },
    {
      "name": "other existing venue names",
      "weight": 0.09171422
    },
    {
      "name": "LA Games",
      "weight": 0.08889986
    },
    {
      "name": "new names",
      "weight": 0.08626805
    },
    {
      "name": "Venues",
      "weight": 0.08181386
    },
    {
      "name": "venues",
      "weight": 0.08181386
    },
    {
      "name": "Games",
      "weight": 0.08091958
    },
    {
      "name": "Naming rights",
      "weight": 0.07966898
    },
    {
      "name": "naming rights",
      "weight": 0.07966898
    },
    {
      "name": "additional revenue",
      "weight": 0.07399096
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.939453125
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.55322265625
    },
    {
      "name": "/Sports/International Sports Competitions/Olympics",
      "score": 0.4697265625
    }
  ],
  "sentiment": {
    "positive": 0.41941014,
    "negative": 0.05900768,
    "neutral": 0.5215822
  },
  "summary": "During the 2028 Summer Games in Los Angeles, venues will be able to display the names of corporate sponsors for the first time. This move is part of a pilot program that could see existing venue names used at the Olympics and potentially new names for up to 19 temporary venues. Companies that sign on to the program will also secure additional marketing assets to bolster their activation efforts. The amount of money raised from selling naming rights for the $7.1 billion LA Games was not disclosed.",
  "shortSummary": "During the 2028 Summer Games, venues will be able to display corporate sponsors' names, creating a new revenue model for the event.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f076f25e24a740e8bd3b5f0713c13a8d",
  "places": [
    {
      "osmId": "860635712",
      "road": "Champion Drive",
      "city": "Inglewood",
      "state": "California",
      "postcode": "90301",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 33.95340735,
        "lon": -118.33900981025587
      }
    },
    {
      "osmId": "1078322666",
      "road": "Stadium Drive",
      "city": "Inglewood",
      "state": "California",
      "postcode": "90303",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 33.9482327,
        "lon": -118.3379357
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "For the first time during the 2028 Summer Games in Los Angeles, venues will display corporate sponsor names, with rights already sold for several venues including squash, boxing, and volleyball locations. This pilot program aims to generate revenue for the LA Games and the U.S. Olympic and Paralympic Committee, allowing companies to maintain existing venue names while also gaining additional marketing opportunities. The initiative marks a significant shift from previous IOC rules that required venues to be free of commercial branding.",
  "argos_id": "IV159SWBK"
}