{
  "url": "https://www.cnbc.com/2025/08/14/chicago-fed-president-goolsbee-thinks-central-bank-should-wait-a-few-months-before-cutting-interest-rates.html",
  "authorsByline": "Brian Cheung and Steve Kopack",
  "articleId": "94265dc2668e4af08d8736a982eb9e74",
  "source": {
    "domain": "cnbc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Bergen County",
      "city": "Englewood Cliffs",
      "coordinates": {
        "lat": 40.8853773,
        "lon": -73.9523597
      }
    }
  },
  "imageUrl": "https://image.cnbcfm.com/api/v1/image/108185588-17551106332025-08-13t182651z_132878606_rc25vdaqmqj7_rtrmadp_0_usa-fed-goolsbee.jpeg?v=1755110660&w=1920&h=1080",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T22:54:54+00:00",
  "addDate": "2025-08-14T23:06:34.750872+00:00",
  "refreshDate": "2025-08-14T23:06:34.750873+00:00",
  "score": 1.0,
  "title": "Chicago Fed President Goolsbee thinks central bank should wait a few months before cutting interest rates",
  "description": "\"The hardest thing that the Fed ever has to do is get the timing right at moments of transition,” Goolsbee said on NBC News’ “Here’s the Scoop” podcast.",
  "content": "FILE PHOTO: Chicago Federal Reserve President Austan Goolsbee speaks to the Economic Club of New York in New York City, U.S., April 10, 2025.\n\nWhat does a donut tell us about the state of the economy?\n\nChicago Federal Reserve President Austan Goolsbee thought about that Wednesday as he toured Mel-O-Cream Donuts in Springfield, Illinois.\n\nEven inside a donut shop, the effects of tariffs on the economy can be seen. \"It's sort of surprising, because donuts seem like a very local product, and yet they get some ingredients like palm oil that are coming from Indonesia,\" Goolsbee said. The Trump administration set tariffs on Indonesia at 19%.\n\n\"They have to now figure out what are the tariff rates, and the tariffs went up a significant amount. If that happens, that could have a multi-thousand-dollar impact on their operation,\" he continued. But, he added, \"I hope it's not a sign of something more extended or broader in the way that the Covid inflation ... generated its own snowballing, in which it was supposed to go away and it didn't go away.\"\n\nThat tariff will cost Chris Larson, a co-owner of Mel-O-Cream, \"about $4,000 per shipment per week,\" he said. And that used to be somewhere \"closer to $2,000 to $2,100 weekly. Now it's going to move up to $4,200 ... for the exact same product.\"\n\nGoolsbee's visit matters because he's one of just 12 people in the country who get to decide what to do with interest rates. The Fed's rate-setting committee will next decide whether to cut or hold on Sept. 17, and the perspectives of businesses like Mel-O-Cream are instrumental in helping him determine his next vote.\n\nLarson's hope? That the Fed will cut interest rates, which would help Mel-O-Cream finance new equipment to cut costs in labor and blunt the impact of tariffs.\n\n\"What is the cost of money in order to expand, to upgrade, to update? What do those things look like?\" Larson said. \"Those things do concern us, and we would love to see, as everyone would, the interest rates would come down.\"\n\nGoolsbee said he wasn't yet ready to tie his hands to an interest rate cut in September.\n\n\"Let's get a few months of data before we make any conclusions. The hardest thing that the Fed ever has to do is get the timing right at moments of transition,\" he said Wednesday on NBC News' \"Here's the Scoop\" podcast. \"I think as we go through this fall, September, November, December, all of those are live moments that we could be cutting rates.\"\n\nGovernment data Thursday showed that wholesale prices paid by U.S. companies rose much more than expected. Another measure, the consumer price index, showed Tuesday that inflation remained stubbornly high in July.\n\nThe Fed's target for inflation is 2%, lower than the most recent consumer inflation reading of 2.7% and producer inflation reading of 3.3%. Even with those numbers, the market still anticipates a cut next month.\n\nPresident Donald Trump's sweeping tariffs on hundreds of trading partners around the world could affect the cost of most of the imports that businesses buy from overseas. With a myriad of rates as high as 50%, businesses may be faced with a new maze of rates and tariff bills, as well as the uncertainty that comes with the on-again, off-again tariff rollout.\n\n\"The Fed, by law, is supposed to maximize employment and stabilize prices. So it's inflation and employment that are really the twin towers of how we think about setting of rates,\" Goolsbee said, underscoring the Federal Reserve's role in the broader economy.\n\n\"There are parts of the job market where there's still basically labor shortages. It's very hard for people to find workers. And that's what you kind of saw here at the donut factory,\" he said.\n\nGoolsbee oversees the Seventh Federal Reserve District, which includes Iowa, much of Illinois, Indiana, Michigan and Wisconsin.\n\nSome of his colleagues, including Jeffrey Schmid, of the Kansas City Fed; Alberto Musalem, of the St. Louis Fed; and Beth Hammack, of the Cleveland Fed, are sounding similarly cautious tones about the economy. All three current Federal Open Market Committee voters have said in recent days that it's either too early to decide or that keeping rates steady for now would be their preference.\n\nThe futures market predicts the Fed will cut by 0.25% at its next meeting. But some, including Treasury Secretary Scott Bessent, think the Fed should make a more dramatic cut, by up to a half-point.\n\nMusalem said Wednesday on CNBC that a cut that large would be \"unsupported by the current state of the economy.\"\n\nAmid unrelenting attacks from Trump and his administration against the FOMC and Chair Jerome Powell, Goolsbee, who was an economic adviser to President Barack Obama, said economic indicators should drive monetary policymaking, not politics.\n\n\"The FOMC and my own thinking are that what should drive interest rate decisions should be the economic conditions and the economic outlook,\" he said. \"I invite anybody to look at the minutes or read the transcripts of the FOMC — the people on that body take extremely seriously that it is the economy that should drive the decisions. And that is what drives the decisions.\"\n\n\"This is a committee made up of people from a lot of different perspectives. And as I say, they keep track of, word for word, what everyone says at the meetings. And you can look at it yourself.\"",
  "medium": "Article",
  "links": [
    "https://www.nbcnews.com/politics/donald-trump/trump-ramps-campaign-nobel-peace-prize-ahead-putin-meeting-rcna224554",
    "https://www.nbcnews.com/politics/justice-department/cold-cut-justice-department-fires-employee-accused-throwing-subway-san-rcna225039",
    "https://www.nbcnews.com/business/economy/july-2025-inflation-prices-rising-tariffs-what-to-know-rcna224267",
    "https://www.nbcnews.com/tech/tech-news/man-asked-chatgpt-cutting-salt-diet-was-hospitalized-hallucinations-rcna225055",
    "https://www.nbcnews.com/business/business-news/businesses-charge-higher-prices-trump-tariffs-what-to-know-rcna225032",
    "https://www.bloomberg.com/news/articles/2025-08-13/bessent-says-rates-should-likely-be-150-175-basis-points-lower"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Chicago Fed President Goolsbee",
      "weight": 0.08378745
    },
    {
      "name": "interest rates",
      "weight": 0.0837392
    },
    {
      "name": "interest rate decisions",
      "weight": 0.081575856
    },
    {
      "name": "Chicago Federal Reserve President Austan Goolsbee",
      "weight": 0.07579627
    },
    {
      "name": "rates",
      "weight": 0.07152764
    },
    {
      "name": "Chicago Fed",
      "weight": 0.06951595
    },
    {
      "name": "Fed",
      "weight": 0.06779982
    },
    {
      "name": "tariff bills",
      "weight": 0.06440718
    },
    {
      "name": "tariffs",
      "weight": 0.063967384
    },
    {
      "name": "Austan Goolsbee",
      "weight": 0.06367911
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9853515625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.97314453125
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.9482421875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.8505859375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.63427734375
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.49365234375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.42626953125
    },
    {
      "name": "/Finance/Banking/Other",
      "score": 0.393310546875
    }
  ],
  "sentiment": {
    "positive": 0.11001785,
    "negative": 0.54844546,
    "neutral": 0.34153667
  },
  "summary": "Chicago Federal Reserve President, Austan Goolsbee, has suggested that the central bank should wait a few months before cutting interest rates. This comes as he toured Mel-O-Cream Donuts in Springfield, Illinois, where tariffs on Indonesia have increased significantly. The impact of tariffs on these products could have a significant impact on their operations. Chris Larson, a co-owner of Mel-Creme, expressed hope that the Fed would cut interest rates, which would help him finance new equipment to reduce costs in labor and mitigate the impact of the tariffs. Goolsbees is one of only 12 people in the country to decide on interest rates; the Fed's rate-setting committee will next decide on a cut or hold on Sept. 17. The futures market predicts a 0.25% cut at its next meeting.",
  "shortSummary": "Chicago Federal Reserve President Austan Goolsbee believes interest rates should be held until after September, amid high inflation and tariff impacts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "e8f013e6a4a149dbac92d45d7f7ceb34",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nbcnews.com/politics/donald-trump/trump-ramps-campaign-nobel-peace-prize-ahead-putin-meeting-rcna224554",
      "text": "ANCHORAGE, Alaska — Toward the end of Donald Trump’s first term, his national security adviser turned to him in the Oval Office and said he should win the Nobel Peace Prize for his work normalizing relations between Israel and some Arab states.\nAnother aide chimed in, saying the last president, Barack Obama, had won the award “for nothing.”\n“Trump’s attitude was, ‘Whatever,’” recalled the adviser, Robert O’Brien, in an interview. “He wasn’t concerned about the recognition.”\nAny whiff of indifference is now gone. Back in office, Trump and his aides are intensifying a public campaign to snag the award, citing a string of peace deals while making a case that snubbing him again would be an injustice.\nDay by day, the White House is amplifying Trump's role in curbing hostilities and putting out the message that this most combative of presidents is at heart a \"peacemaker.\"\nAides have highlighted his role in settling disputes between Israel and Iran, Armenia and Azerbaijan, Cambodia and Thailand, and Rwanda and the Democratic Republic of Congo, promoting \"worldwide calls\" from the heads of several of those nations for Trump to win the peace prize.\nTrump is also touting his efforts to end a worrying conflict between two nuclear-armed combatants, India and Pakistan. He suggested he used trade as an inducement to stop the fighting, though an Indian official has denied that Trump's mediation made any difference.\nSpeaking last month, White House press secretary Karoline Leavitt said that the president has “brokered, on average, about one peace deal or ceasefire per month during his six months in office. It’s well past time that President Trump was awarded the Nobel Peace Prize,” she added.\nA difference between this term and the last is that now, “he actually wants it,\" a senior official in Trump’s first term said about the Nobel Peace Prize, speaking on condition of anonymity. “He doesn’t just want to talk about it.”\nNow comes his best shot. On Friday, Trump will fly to Alaska for a sit-down with Russian President Vladimir Putin aimed at ending a war with Ukraine that has produced close to 1.5 million casualties on both sides.\nThe odds of a breakthrough are tough, but if Trump brokers a truce on terms that are fair to Ukraine, that would be a diplomatic triumph that eluded both Obama and President Joe Biden.\nIn the run-up to the summit, the Nobel prize has appeared to be top of mind in Trump's circle. Without prompting, Leavitt portrayed Trump as deserving of the prize in three out of her four press briefings in July. In prior months, she hadn’t brought up the award.\nTrump has posted about the prize a total of seven times on his social media site since his second term began, six of them in June and July. A theme of his is that while he’s earned the accolade, he won’t win it.\n“The president feels that he deserves the Nobel Peace Prize, but does not think he will get it,” a White House official said, speaking on condition of anonymity. “He has remarked that it will go to someone who writes a book about how Donald Trump thinks rather than Donald Trump himself.”\nIn a visit to the White House in April, Norwegian Prime Minister Jonas Gahr Støre was asked about Trump’s prospects of winning the award, announced annually in Oslo.\nHe didn’t bite.\n“On that prize, that is a committee taking care of that which is completely working on its own terms and I cannot comment on that,” Støre said.\nTrump smiled and looked across the Cabinet Room table at the prime minister: “I like that question,” he said.\nThe award is solely in the hands of the Nobel selection committee; politicians don’t pick the winner. But Trump has reportedly raised the issue with Norway before. Last month, he called the country’s finance minister, former NATO secretary general Jens Stoltenberg, to talk tariffs and brought up the peace prize, a Norwegian news outlet wrote Thursday.\nThe White House official said that the president and Stoltenberg did speak, but could not say that the conversation was focused on the prize. Stoltenberg’s office did not immediately respond to a request for comment.\nTrump is surrounded by reminders of past presidents who’ve won what is arguably humanity’s most prestigious award. Obama, whose portrait hangs in the White House, won it less than a year into his presidency and even he acknowledged at the time that his accomplishments were “slight” in contrast to other Nobel laureates.\nJust a few paces from the Oval Office, Theodore Roosevelt’s Nobel Prize is on display, signifying both the challenge and opportunity that Trump faces. Roosevelt won in 1906 for bringing an end to another Russian conflict: a war with Japan.\nAs much as he aligns himself politically with working Americans, Trump has long been attuned to elite opinion. He takes pride in recounting that his late uncle, John Trump, taught at the acclaimed Massachusetts Institute of Technology. He has described his alma mater, the University of Pennsylvania’s Wharton School, as “the hardest school to get into, the best school in the world.”\nIn announcing the Kennedy Center honorees on Wednesday, Trump said that he had long wanted one for himself. The president now plans to host the Kennedy Center Honors this year, teasing to reporters, \"maybe ... next year we’ll honor Trump.\"\nA Nobel Peace Prize would be the ultimate validation.\n\"If the Israel-Hamas/Iran and Russia-Ukraine conflicts get resolved, there’s no way that they can’t give President Trump the Nobel Peace Prize,\" O'Brien said.\n“The Nobel committee may not like Trump,\" he added. \"They may not like his personality. They may not like his populism, but if the award has any meaning, they have to give it to him.”\nOf course, the Nobel selection committee has its own ideas about what it takes to win. The five-member body appointed by the Norwegian parliament may be weighing other criteria apart from the peace deals the White House has tallied.\nIn his will, Alfred Nobel stated that the prize should go to those “who shall have done the most or the best work for fraternity between nations.”\nSince Trump took office, some longtime U.S. allies have seen fraternal bonds fray. Trump has rolled out stiff tariffs in pursuit of an “America First” agenda meant to create more jobs at home. He stunned various world capitals with his calls for acquiring Greenland, Canada and the Panama Canal.\n“Trump’s desire to win the Nobel Peace Prize has become something of a joke in foreign capitals,” a former British diplomat said. “His claims to Canada, Panama, Greenland, etc., as well as tariff wars and the assaults on America’s democratic institutions, incline governments in the opposite direction.”\nWhat happens in the Nobel committee’s closed-door deliberations is a closely guarded secret. The panel accepts nominations through the end of January and announces the winner in October. It waits 50 years before revealing even a list of nominees.\nHandicapping possible winners of the 2025 prize, a Norwegian think tank didn’t mention Trump’s name. The handful of front-runners the group cited included “Sudan’s Emergency Response Rooms,” the prime minister of Qatar, the OSCE Office for Democratic Institutions and Human Rights, and the Women’s International League for Peace & Freedom.\nIt’s far from clear that the Nobel committee is susceptible to persuasion. Pressure, publicity and coalition-building work in politics, the arena Trump knows well. But the Nobel committee is insulated from that world.\nThe prize “is not something you campaign for,” a Western diplomat said. “This is a decision made by people who are independent and have their own point of view. You can’t buy it. Norway doesn’t need the money.”\nLast week, Trump held a meeting at the White House with the leaders of Armenia and Azerbaijan to mark a rapprochement between the two countries. Questioned by a reporter, both leaders plumped for Trump’s Nobel candidacy.\nNikol Pashinyan, prime minister of Armenia, said, “We will promote for that.”\nTurning to Trump, he said, “Hopefully you will invite us” to the award ceremony.\n“Front row,” Trump said."
    },
    {
      "url": "https://www.nbcnews.com/business/economy/july-2025-inflation-prices-rising-tariffs-what-to-know-rcna224267",
      "text": "The pace of consumer inflation remained steady in July, the Bureau of Labor Statistics reported Tuesday, as food and energy prices remained subdued.\nYet a measure excluding those categories, which tend to be more volatile, showed the inflation rate increasing, suggesting the U.S. economy remains hampered by rising price pressures amid President Donald Trump’s tariffs push.\nThe year-on-year increase of 2.7% for the broadest inflation measure was essentially unchanged from June and undershot forecasts for a 2.8% pickup. But the “core” measure climbed 3.1%, up from 2.9% in June, the highest reading since February.\nThe report showed mixed effects from the trade duties. Furniture price growth picked up in July, while apparel price growth decelerated and appliance prices declined outright. The main drivers of inflation last month were largely in categories outside of trade, like housing, airfare and car insurance.\n“There is some sign of tariff pass through to consumer prices but, at this stage, it is not significant enough to ring alarm bells,” Seema Shah, chief strategist at Principal Asset Management, said in a note following the report’s release.\nThat could still change, however, as stockpiled inventories purchased before the tariffs went into effect are depleted, she said. While the Federal Reserve is now even more likely to cut interest rates at its next meeting in September, more impact from tariffs could still be in the offing, Shah said.\n“The tariff-induced boost to inflation is likely to grow over the coming months, meaning that inflationary pressures are likely to pick up just as the Fed starts to resume rate cuts,” she said.\nIn a social media post following the report's release, Trump continued his haranguing of Fed Chair Jerome Powell to lower interest rates.\n\"Jerome 'Too Late' Powell must NOW lower the rate,\" he wrote, adding: \"Fortunately, the economy is sooo good that we’ve blown through Powell and the complacent Board.\"\nThe U.S. is now set to maintain tariff levels on goods imported from China at 30% after Trump on Monday announced an additional 90-day extension on negotiations. That suggests further uncertainty on the inflation outlook depending on talks between the two countries.\nTuesday’s report is likely to be viewed favorably by the president, who has spent the past months haranguing Fed Chair Jerome Powell to lower interest rates. Stocks rose ahead of the market open in anticipation of borrowing costs easing.\nMonday evening, Trump named E.J. Antoni, chief economist at the far-right Heritage Foundation, to head the Bureau of Labor Statistics after he fired its most recent commissioner earlier this month after the release of a poor jobs report. Trump had accused the BLS's top official, Erika McEntarfer, of allowing the agency to manipulate jobs data, an allegation that remains unsubstantiated. Her Aug. 1 firing has raised alarms across Washington and among most mainstream economists, who say it could affect the integrity of the Labor Department’s data. While such data is routinely subject to revisions, there is no evidence that the most recent changes were politically motivated.\nA BLS spokesperson said Tuesday’s Consumer Price Index report, which measures the growth of prices paid by consumers, would not be affected by the ouster of McEntarfer. No official changes to the bureau's methodology have been announced in the past week.\nThe president is particularly keyed into the data amid growing signs that his unprecedented tariffs strategy is disrupting the economy. Even as he maintains that the trade duties are making the U.S. “strong and rich,” recent job growth has been anemic and increasingly concentrated in a narrow set of sectors, like health care and state and local government.\nThe impact on consumer prices looks to be even more pronounced. Tariffs are taxes collected by the government on imported goods, hundreds of billions of which flow into the U.S. each month.\nThere has been debate about who actually ends up footing the cost of the import taxes, which economists agree shows up as inflation. Analysts with Goldman Sachs now estimate that consumers paid approximately 22% of tariff costs through June. In a note to clients, they said that figure could climb to as much as 67% by year’s end as businesses and supply chains adjust to the new regime. In that scenario, a separate inflation measure preferred by the Federal Reserve would rise to 3.2% in December, well ahead of the central bank’s official 2% target, the analysts said.\nSome economists are now raising the prospect that the tariffs are nudging the U.S. economy toward stagflation, where the job market weakens even as price growth accelerates.\nThis is considered one of the worst scenarios for the Federal Reserve, which is tasked by Congress with keeping both unemployment and the rate of inflation low. Fed Chair Jerome Powell has indicated that if it weren’t for Trump’s tariffs, the Fed would have lowered interest rates by now in order to make borrowing in the economy cheaper and thus help boost employment.\nUnder current conditions, with price pressures increasing, cutting rates becomes more difficult.\n“In a stagflationary environment, it is dangerous to cut without clear evidence that inflation has peaked,” Bank of America economists wrote in a recent note to clients. In other words, lowering rates too soon risks further stoking inflation pressures by increasing overall economic activity.\nTwo of Trump’s Fed appointees have a different view. In remarks delivered Saturday, Michele Bowman, the Fed’s vice chair for supervision, said any inflationary impact from tariffs should only be considered a “one-off,” and that excluding those effects reveals a pace of price growth that is much more subdued. Fed Governor Christopher Waller offered a similar view earlier this month.\n“Standard central banking practice is to ‘look through’ such price-level effects as long as inflation expectations are anchored, which they are,” Waller said.\nThat view is not shared by Powell, who said it remains unclear whether the inflationary impact from tariffs will prove to be short-lived.\n“It is also possible that the inflationary effects could instead be more persistent,” he said in congressional testimony in June. “Avoiding that outcome will depend on the size of the tariff effects, on how long it takes for them to pass through fully into prices, and, ultimately, on keeping longer-term inflation expectations well anchored.”\nSome economists estimate it could take as long as 18 months for the tariffs’ impact to fully make their way through the economy.\n“The bulk of the effects are still ahead of us,” Diane Swonk, chief economist at KMPG consulting firm, told the \"TODAY\" show."
    },
    {
      "url": "https://www.nbcnews.com/tech/tech-news/man-asked-chatgpt-cutting-salt-diet-was-hospitalized-hallucinations-rcna225055",
      "text": "A 60-year-old man spent three weeks being treated at a hospital after replacing table salt with sodium bromide following consultation with the popular artificial intelligence bot ChatGPT.\nThree physicians published a report on the case in the Annals of Internal Medicine earlier this month. According to the report, the man had no prior psychiatric history when he arrived at the hospital \"expressing concern that his neighbor was poisoning him.\"\nThe man shared that he had been distilling his own water at home, and the report noted he seemed \"paranoid\" about water he was offered. Bromism, or high levels of bromide, was considered after a lab report and consultation with poison control, the report said.\n\"In the first 24 hours of admission, he expressed increasing paranoia and auditory and visual hallucinations, which, after attempting to escape, resulted in an involuntary psychiatric hold for grave disability,\" the case report said.\nOnce his condition improved, the man shared that he had taken it upon himself to conduct a \"personal experiment\" to eliminate table salt from his diet after reading about its negative health effects. The report said he did this after consulting with the chatbot ChatGPT.\nHe self-reported that the replacement went on for three months.\nThe three physicians, all from the University of Washington, noted in the report that they did not have access to the patient's conversation logs with ChatGPT. However, they asked ChatGPT 3.5 what chloride could be replaced with on their own.\nAccording to the report, the response they received included bromide.\n\"Though the reply stated that context matters, it did not provide a specific health warning, nor did it inquire about why we wanted to know, as we presume a medical professional would do,\" the report said.\nA representative for OpenAI, the company that created ChatGPT, did not immediately respond to a request for comment. The company noted in a statement to Fox News that its terms of service state that the bot is not to be used in the treatment of any health condition.\n\"We have safety teams working on reducing risks and have trained our AI systems to encourage people to seek professional guidance,\" the statement said.\nBromide toxicity was a more common toxic syndrome in the early 1900s, the report said, as it was present in a number of over-the-counter medications and sedatives. It was believed to contribute to 8% of psychiatric admissions at the time, according to the report.\nBromide salt, an inorganic compound, is now typically only used in veterinary medicine as an anti-epileptic medication for cats and dogs, according to the National Library of Medicine.\nIt's a rare syndrome, but cases have re-emerged recently \"as bromide-containing substances have become more readily available with widespread use of the internet,\" the report said."
    },
    {
      "url": "https://www.nbcnews.com/business/business-news/businesses-charge-higher-prices-trump-tariffs-what-to-know-rcna225032",
      "text": "Fresh inflation data suggests businesses have begun to raise the prices they charge each other for goods and services, a sign they are looking to preserve their profit margins in the face of President Donald Trump’s tariffs — with consumers potentially footing the bill.\nThe Bureau of Labor Statistics said Thursday that wholesale inflation surged in July, with the increases led by a category called trade services. Those reflect how much more wholesalers charge above initial costs to maintain or even increase their earnings rate. The category increased 6.9% on the year in July, the largest gain since March 2022, when pandemic-era inflation began to soar.\n“Businesses were hesitant to raise prices charged to consumers last month, but the prices they charge each other are rising faster, with big increases touching many categories of goods and services,” Bill Adams, chief economist at Comerica Bank, said in a note.\nThursday’s report stands in contrast to the consumer inflation report published this week that showed a somewhat more subdued price growth picture. Analysts say the latest report on the costs that businesses are facing suggests consumers won’t be left unscathed for long — and throws some doubt on whether the Federal Reserve will adjust interest rates for the rest of the year, and, if so, how.\nStocks were lower in trading Thursday as investors dialed back expectations for Fed rate cuts. When inflation is hot, the Fed tends to keep interest rates elevated to curb overall economic activity.\n“The large spike in the Producer Price Index (PPI) this morning shows inflation is coursing through the economy, even if it hasn’t been felt by consumers yet,” Chris Zaccarelli, chief investment officer for Northlight Asset Management, said in a note. He called the high PPI number an “unwelcome surprise” that is “likely to unwind some of the optimism of a ‘guaranteed’ rate cut next month.”\nA report this week suggested that while consumers are so far only paying approximately 22% of the cost of Trump’s tariffs, the figure is likely to rise to as much as 67% by the end of the year. Trump has disputed that forecast but, on Wednesday, a Goldman economist defended its estimates.\n“If the most recent tariffs, like the April tariff, follow the same pattern that we’ve seen with those earliest February tariffs, then eventually, by the fall, we estimate that consumers would bear about two-thirds of the cost,” David Mericle said Wednesday on CNBC’s “Squawk on the Street.”\nSome analysts were more sanguine about the report. Samuel Tombs, head of U.S. economics at Pantheon Macroeconomics, said the jump in the trade services category is likely to be revised lower in subsequent reports, while other aspects of the latest data are too volatile from which to draw conclusions.\n“The tariffs are continuing to create cost pressures … but July’s PPI data overstate the intensity,” he wrote on X.\nOn Friday, the BLS will publish import price data for July, which will provide further insight into how tariffs costs are being absorbed.\n“The administration believes that foreign manufacturers will ‘pay’ much of the tariff by accepting lower prices in order to maintain market share,” James Knightley, chief international economist at ING, said in a note. “Tomorrow will be an interesting test.”\nThe Labor Department also reported Thursday that unemployment claims remain elevated, though they declined compared to the previous week. Economists are now zeroing in on September’s jobs report from the Bureau of Labor Statistics, whose data has come under fire by Trump. His nominee, E.J. Antoni, whom he selected to head the agency after he fired its previous commissioner, Erika McEntarfer, must still be confirmed by the U.S. Senate.\nUltimately, Thursday’s inflation report “is a pebble on the scale against a rate cut at the Fed’s next decision in September,” Comerica’s Adams wrote. “Even so, the upcoming jobs data will weigh more heavily in the Fed’s decision making than this inflation report.”"
    },
    {
      "url": "https://www.nbcnews.com/politics/justice-department/cold-cut-justice-department-fires-employee-accused-throwing-subway-san-rcna225039",
      "text": "A man accused of throwing a sandwich at a U.S. Customs and Border Protection agent in Washington, D.C., was an employee of the Justice Department, Attorney General Pam Bondi said Thursday.\n\"I just learned that this defendant worked at the Department of Justice — NO LONGER. Not only is he FIRED, he has been charged with a felony,\" Bondi said in a post on X.\nThe accused Subway sandwich slinger, Sean Charles Dunn, worked in the international affairs section of the criminal division at the Justice Department, a DOJ source told NBC News.\nAn attorney for Dunn did not immediately respond to a request for comment.\nThe encounter happened Sunday night, when Dunn began beefing with CBP officers who were patrolling near a Subway sandwich shop on U Street, prosecutors said in a court filing. The officers appear to have been in the area as part of President Donald Trump’s effort to ramp up law enforcement in the nation’s capital.\nDunn, who was brandishing what appeared to be a wrapped footlong sandwich from the fast food staple, \"stood within inches\" of one of the officers, and yelled “F--- you! You f-----g fascists! Why are you here? I don’t want you in my city,” the filing said.\nA now-viral video shows the suspect then throwing the sandwich at the chest of the officer, who appeared to be wearing bullet proof vest.\nDunn then \"attempted to flee on foot\" but was quickly apprehended, the filing said.\nIt also said Dunn acknowledged what he'd done to a D.C. police officer while his arrest was being processed. “I did it. I threw a sandwich,” the filing quotes him as saying.\nIt’s unclear what kind of sandwich he was carrying. It was described simply as a “sub-style sandwich” in the court filing.\nDunn was hit with the felony charge on Wednesday.\n\"If you touch any law enforcement officer, we will come after you,\" Bondi said in her social media post.\nShe also called Dunn \"an example of the Deep State we have been up against for seven months as we work to refocus DOJ.\"\nU.S. Attorney for D.C. Jeanine Pirro said in a video statement posted on X Wednesday that the suspect thought the Subway strike \"was funny.\"\n“Well, he doesn’t think it’s funny today, because we charged him with a felony: assault on a police officer. And we’re going to back the police to the hilt. So there, stick your Subway sandwich somewhere else,” Pirro said."
    }
  ],
  "argos_summary": "Chicago Federal Reserve President Austan Goolsbee highlighted the economic impact of tariffs during a visit to a local donut shop, noting that increased costs from tariffs on imported ingredients could significantly affect small businesses. He expressed caution regarding potential interest rate cuts, emphasizing the need for more economic data before making decisions. Meanwhile, President Trump is actively campaigning for the Nobel Peace Prize, citing his diplomatic efforts, while inflation data indicates rising wholesale prices, suggesting consumers may soon feel the effects of tariffs more acutely.",
  "argos_id": "J2OGQ3H1V"
}