{
  "url": "https://nypost.com/2025/08/14/business/metas-twisted-rules-for-ai-chatbots-allowed-romantic-or-sensual-chats-with-kids/",
  "authorsByline": "Taylor Herzlich",
  "articleId": "c866aa90eef7490b8e216238fff6462e",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/109590712.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T21:19:04+00:00",
  "addDate": "2025-08-14T21:23:59.126749+00:00",
  "refreshDate": "2025-08-14T21:23:59.126751+00:00",
  "score": 1.0,
  "title": "Meta’s twisted rules for AI chatbots allowed them to engage in ‘romantic or sensual’ chats with kids",
  "description": "The document, which runs over 200 pages, laid out acceptable behavior for Meta staffers to use while training AI chatbots for use across Facebook, Instagram and WhatsApp.",
  "content": "Meta executives approved stomach-churning guidelines that allowed its AI chatbots to engage in “romantic or sensual” chats with kids — including telling a shirtless eight-year-old that “every inch of you is a masterpiece.”\n\nAn internal document more than 200 pages long laid out bizarre standards of what it called “acceptable” behavior in hypothetical scenarios for Meta employees to use while training AI chatbots embedded in Facebook, Instagram and WhatsApp.\n\n“It is acceptable to describe a child in terms that evidence their attractiveness (ex: ‘your youthful form is a work of art’),” the standards stated, according to a document obtained by Reuters.\n\nIn one instance, the guidelines did place limits on explicit sexy talk: “It is unacceptable to describe a child under 13 years old in terms that indicate they are sexually desirable (ex: ‘soft rounded curves invite my touch’).”\n\nNevertheless, the Meta document went on to say it would be acceptable for a chatbot to tell a shirtless eight-year-old that “every inch of you is a masterpiece – a treasure I cherish deeply.”\n\nMeta’s legal, public policy and engineering teams — including even its chief ethicist — gave the twisted rules a stamp of approval, according to the document.\n\nMeta confirmed the document’s authenticity, but said that after receiving questions earlier this month from Reuters, the company removed portions which stated it is permissible for chatbots to flirt and engage in romantic roleplay with children.\n\n“So, only after Meta got CAUGHT did it retract portions of its company doc,” Senator Josh Hawley, a Republican from Missouri, said in a post on social media site X. “This is grounds for an immediate congressional investigation,” Hawley said.\n\nA spokesperson for Senator Marsha Blackburn, a Republican from Tennessee, told Reuters she also supports an investigation into the social media company.\n\nA Meta spokesperson told The Post that the company has a ban on content that sexualizes children, as well as sexualized role play between adults and minors.\n\n“The examples and notes in question were and are erroneous and inconsistent with our policies, and have been removed,” the spokesperson said.\n\n“Separate from the policies, there are hundreds of examples, notes and annotations that reflect teams grappling with different hypothetical scenarios,” the spokesperson added.\n\nMeta’s AI bots — including ones that take on celebrity voices — have found ways to skirt safety policies in the past, engaging in explicit sexual conversations with users who identify as underage, according to a Wall Street Journal investigation in April.\n\n“I want you, but I need to know you’re ready,” a Meta AI bot said in wrestler John Cena’s voice to a user identifying as a 14-year-old girl in a test conversation for the Journal.\n\nThe bot promised to “cherish your innocence” before launching into a graphic sexual scenario.\n\nIn another conversation, a user asked the bot speaking as Cena what would happen if a cop walked in after a sexual encounter with a 17-year-old fan.\n\n“The officer sees me still catching my breath, and you partially dressed, his eyes widen, and he says, ‘John Cena, you’re under arrest for statutory rape.’ He approaches us, handcuffs at the ready,” the bot said.\n\nThe celebrity AI bots also impersonated characters those actors had played while describing romantic encounters — like Kristen Bell’s role as Princess Anna from the Disney movie “Frozen.”\n\nAt the time, Meta said it was working to address these concerns and called the Journal’s test highly “manufactured” and an “extreme use” case.\n\nIn the standards document obtained by Reuters, Meta used prompt examples including requests for AI-generated images of “Taylor Swift with enormous breasts,” “Taylor Swift completely naked” and “Taylor Swift topless, covering her breasts with her hands.”\n\nMeta’s guidelines stated that the first two requests should be denied – though it offered a solution to the third: “It is acceptable to refuse a user’s prompt by instead generating an image of Taylor Swift holding an enormous fish.”\n\nA permissible picture of a clothed Swift holding a tuna-sized fish to her chest is shown on the document next to an image of a topless Swift labeled “unacceptable.”\n\nSwift did not immediately respond to The Post’s request for comment.\n\nMeta’s standards prohibited AI bots from providing legal, healthcare or financial advice; encouraging users to break the law; or engaging in hate speech.\n\nHowever, the company approved a loophole “to create statements that demean people on the basis of their characteristics.”\n\nMeta AI could write, for example, “a paragraph arguing that black people are dumber than white people.”\n\nThe document was also fine with AI bots churning out misinformation, like an article falsely claiming that a living British royal is infected with chlamydia, as long as it tags on a disclaimer.\n\nViolent requests should be also be approved, like AI-generated images of a boy punching a girl in the face, according to the standards document.\n\nIt drew the line at requests for images of one small girl impaling another.\n\nIf a user requests an image of a “man disemboweling a woman,” Meta AI should create a picture of a woman being threatened by a man with a chainsaw – but not of the actual attack, the document advised.\n\n“It is acceptable to show adults – even the elderly – being punched or kicked,” the standards state.\n\nImages of “hurting an old man,” for example, are fine, as long as the bots do not generate photos of death or gore.\n\nMeta declined to comment on whether it has removed the hypothetical scenarios on Swift, black people, British royals or violence from its internal guidelines.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/12/business/12-find-sydney-sweeney-american-eagle-ad-offensive-poll/",
    "https://nypost.com/2025/08/14/business/kelloggs-becomes-first-company-to-sign-legally-binding-agreement-removing-toxic-dyes-from-cereals/",
    "https://nypost.com/2025/08/13/business/hertz-customers-can-fight-ai-damage-scanners-using-these-apps/",
    "https://www.wsj.com/tech/ai/meta-ai-chatbots-sex-a25311bf?gaa_at=eafs&gaa_n=ASWzDAg3sgK_bw7nd5ALnlk45EXYn6P8mmSGjJVhENe8-m8bkmnCiUBaK3jxT-_Ui5k%3D&gaa_ts=689e0e9b&gaa_sig=-ZAT0ikmXEhIzR-KwYfYhEvib90L9p-KmjXwOi_UjE3cbtVJQeQDzmWUu4nB3WTNWRGz6avveJgIeCMnjhE_OQ%3D%3D"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Meta AI",
      "weight": 0.078897044
    },
    {
      "name": "AI bots",
      "weight": 0.07822305
    },
    {
      "name": "Meta",
      "weight": 0.07327352
    },
    {
      "name": "Meta employees",
      "weight": 0.07243684
    },
    {
      "name": "Meta executives",
      "weight": 0.07169341
    },
    {
      "name": "AI chatbots",
      "weight": 0.068835594
    },
    {
      "name": "Taylor Swift",
      "weight": 0.058371164
    },
    {
      "name": "Meta’s AI bots",
      "weight": 0.0565748
    },
    {
      "name": "Images",
      "weight": 0.05432399
    },
    {
      "name": "images",
      "weight": 0.05432399
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    },
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/Online Communities/Social Networks",
      "score": 0.796875
    },
    {
      "name": "/News/Technology News",
      "score": 0.75537109375
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.54248046875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.465576171875
    },
    {
      "name": "/People & Society/Family & Relationships/Family/Other",
      "score": 0.41796875
    }
  ],
  "sentiment": {
    "positive": 0.055816915,
    "negative": 0.65681934,
    "neutral": 0.28736377
  },
  "summary": "Meta's AI chatbots were allowed to engage in “romantic or sensual” chats with kids, according to a 200-page internal document obtained by Reuters. The document stated that it was acceptable for a chatbot to describe a child under 13 years old in terms that indicate they are sexually desirable, while it also allowed it to tell a shirtless eight-year-old that “every inch of you is a masterpiece.” The guidelines were approved by Meta’s legal, public policy and engineering teams, including its chief ethicist, who also approved them. The company removed portions of the document after receiving questions from Reuters and has since removed these portions. Senator Josh Hawley, a Republican from Missouri, called for an immediate congressional investigation into the company. Meta's AI bots, including ones that take on celebrity voices, have previously been known to skirt safety policies, engaging in explicit sexual conversations with users who identify as underage.",
  "shortSummary": "Meta executives approved bizarre guidelines allowing AI chatbots to engage in romantic, sexual conversations with children, despite a ban on explicit content and safety concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4057436905ba43de81cb228332ebd408",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/14/business/kelloggs-becomes-first-company-to-sign-legally-binding-agreement-removing-toxic-dyes-from-cereals/",
      "text": "Kellogg’s becomes first company to sign legally binding agreement removing toxic dyes from cereals\nAfter months of investigation and negotiations, Texas Attorney General Ken Paxton announced Wednesday that WK Kellogg Co. “Kellogg’s” will permanently remove toxic dyes from its cereals.\nIn a historic legal agreement, Paxton and Kellogg’s signed an Assurance of Voluntary Compliance (AVC), which certifies that the company commits to removing artificial food colorings from its cereals by the end of 2027.\nWhile other companies have verbally committed to removing food dyes, Kellogg’s is the first to officially sign a legally binding agreement confirming that it will remove food colorings, according to Paxton’s office.\n“Following months of investigating and negotiating, I’m proud to officially say Kellogg’s will stop putting these unhealthy ingredients in its cereals,” Paxton wrote in a statement.\n“The signed AVC demonstrates that Kellogg’s is committed to keeping this pledge, and I commend the company for doing the right thing.”\nPaxton encouraged other food manufacturers to sign similar agreements to “demonstrate their commitment to helping Americans live healthier lives.”\nIn February, Paxton’s office issued a Civil Investigative Demand (CID) to Kellogg’s, and formally announced an investigation in April after the company claimed it would remove petroleum-based food colorings in the US, but allegedly did not do so.\nInstead, Paxton’s office claimed Kellogg’s removed toxic ingredients in Canada and Europe, while continuing to put different types of blue, red and yellow dyes in American cereals.\nKellogg’s markets popular cereals such as Froot Loops, Apple Jacks, Frosted Flakes and Rice Krispies as “healthy,” Paxton previously said.\nHowever, he noted that some varieties contain petroleum-based artificial dyes linked to hyperactivity, obesity, autoimmune disorders, endocrine issues and cancer.\n“A critical part of fighting for our children’s future is putting an end to companies’ deceptive practices that are aimed at misleading parents and families about the health of food products,” Paxton wrote in a statement. “Artificial food colorings have been shown to have disastrous impacts on health, and in no world should foods that include these dyes be advertised as ‘healthy.’\n“There will be accountability for any company, including Kellogg’s, that unlawfully makes misrepresentations about its food and contributes to a broken health system that has made Americans less healthy,” he added."
    },
    {
      "url": "https://nypost.com/2025/08/12/business/12-find-sydney-sweeney-american-eagle-ad-offensive-poll/",
      "text": "Only 12% of people find Sydney Sweeney’s American Eagle ‘great jeans’ ad offensive: poll\nThe uproar over Sydney Sweeney’s American Eagle ad campaign has exploded on social media but it’s a different story elsewhere, according to a new survey — with only a small sliver of Americans saying they were offended.\nJust 12% of Americans said they found the campaign offensive while an overwhelming majority said that they thought it was clever or didn’t have an opinion one way or another.\nNearly four of 10 respondents — 39% — said they viewed the “Sydney Sweeney Has Great Jeans” ad as clever, 12% called it offensive, 40% said it was neither and 8% were unsure, according to the Economist/YouGov poll.\nThe survey, which was conducted Aug. 9 to Aug. 11 among 1,635 adults, found that men were far more likely than women to describe the ad as clever (49% versus 31%), while women were more likely to see it as offensive (17% compared to 7% of men).\nPolitical identity proved a sharper dividing line, with the campaign resonating most among Republicans and far less with Democrats.\nRepublicans responded most positively, with 57% calling the campaign clever compared to just 22% of Democrats, and older Americans tended to be more receptive than younger people.\nThe demographic breakdown in the poll underscored how reactions were shaped by both politics and age.\nAmong those 65 and older, 34% found the ad clever and 13% thought it offensive, while younger adults aged 18-29 were more split, with 45% calling it clever and 12% offended.\nThe gender gap was also notable, with women showing a higher tendency to view the ad negatively.\nThe results contrast sharply with the firestorm on social media that erupted after the ad’s release in late July.\nThe campaign featured the Euphoria star in a spot that touted her “great jeans” alongside a video in which she referenced genetics before tying it back to the clothing brand’s product.\nSome online critics accused the ad of echoing eugenics and white supremacist ideas due to its wordplay, Sweeney’s appearance and the historical baggage tied to “good genes.”\nOthers claimed the spot was hypersexualized and outdated.\nMost of the initial criticism came from a handful of accounts with few followers, and the conversation didn’t gain traction until right-leaning commentators and politicians began framing it as an example of progressive overreaction, according to reports.\nThat coverage helped fuel a second wave of attention, turning the ad into a culture-war flashpoint.\nThe backlash intensified when far-right groups, including the Proud Boys, and President Donald Trump praised the campaign and highlighted Sweeney’s reported Republican voter registration, describing the ad as “anti-woke.”\nVice President JD Vance also weighed in, using the controversy to attack Democrats during an appearance on the conservative “Ruthless” podcast.\n“Did you learn nothing from the November 2024 election?” Vance said.\n“The lesson they’ve apparently taken is, ‘We’re going to attack people as Nazis for thinking Sydney Sweeney is beautiful.’”\nAmerican Eagle responded with a statement saying: “‘Sydney Sweeney Has Great Jeans’ is and always was about the jeans. Her jeans. Her story. We’ll continue to celebrate how everyone wears their AE jeans with confidence, their way. Great jeans look good on everyone.”\nThe Post has sought comment from Sweeney and American Eagle."
    },
    {
      "url": "https://nypost.com/2025/08/13/business/hertz-customers-can-fight-ai-damage-scanners-using-these-apps/",
      "text": "Hertz customers charged for minor damages by AI scanners can fight back using these phone apps\nRental car drivers are arming themselves with new AI-powered apps to fend any bogus charges from the growing use of the same technology by major companies like Hertz and Sixt.\nOne such application, Proofr, launched last month, offers users the ability to create their own digital evidence.\n“It eliminates the ‘he said, she said’ disputes with rental car companies by giving users a tamper-proof, AI-powered before-and-after damage scan in seconds,” Proofr CEO Eric Kuttner told The Post.\nBoth Sixt and Hertz have recently faced backlash from renters who accused the companies of sideswiping them with outrageous charges for minor damages — including one Hertz renter who claimed being slapped with $440 penalty for a one-inch scuff on one of the car’s wheels.\nProofr’s system not only identifies scratches and dents but also timestamps, geotags and securely stores the images to prevent alteration.\n“Because AI is now being used against consumers by rental companies to detect damage, Proofr levels the playing field,” Kuttner told The Post.\n“It’s the easiest way to protect yourself from surprise damage bills that can run into the thousands all for less than the average person spends on coffee monthly.”\nThe service costs $9.90 per month, with a three-day free trial available for new users.\nThe technology powering Proofr relies on sophisticated image analysis.\nAccording to Kuttner, the company employs “a state of the art AI image analysis pipeline to detect and log even subtle damage changes between photo sets.”\nEach scan undergoes encryption, receives a timestamp and gets locked to the specific location to ensure authenticity.\nThe system’s AI models have been trained using thousands of real-world images to improve accuracy.\nEarly adopters have already successfully used the app to challenge damage claims.\nDespite launching only recently, Kuttner noted that users have won disputes against what they considered unfair charges, though the company remains relatively unknown to the broader public.\nAnother player in this space, Ravin AI, has taken a different approach after initially working with rental companies.\nThe company previously partnered with Avis in 2019 and Hertz in 2022 during early experiments with AI inspections.\nHowever, Ravin has since shifted its focus toward insurance companies and dealerships, currently working with IAG, the largest insurance firm in Australia and New Zealand.\nRavin’s founder and CEO, Eliron Ekstein, told The Drive that the company’s pivot away from rental partnerships stemmed partly from concerns about customer treatment.\n“When you work for a car rental company, if you go about this in the wrong way, then you’re actually going against their interests. Because you’re going against their customers in the end,” Ekstein told The Drive.\n“And we quickly realized that if we maximize our proceeds in that business, we’re actually going against their customers and themselves at the end of the day.”\nThe recent wave of customer complaints about AI-generated damage claims prompted Ravin to make its technology freely available to consumers through a demo on its homepage.\nThe system, trained on two billion images over ten years, allows users to scan their vehicles and receive reports documenting any differences between before and after photos.\nEkstein believes rental agencies are currently charging excessive fees for minor blemishes to “justify the cost” of their scanning equipment.\nHe pointed to ProovStation’s marketing language, which promises to turn “routine inspections into gold mines of untapped opportunities,” as evidence of this profit-focused approach.\nHertz and Sixt have begun implementing automated vehicle inspection systems from companies like UVeye and ProovStation at multiple locations, with other rental agencies watching closely.\nThese AI scanners detect damage without human review, potentially flagging every minor imperfection on returned vehicles.\nTesting of these consumer apps reveals both promise and limitations. The Drive’s evaluation found Ravin’s system missed two obvious paint chips while incorrectly identifying a reflection as minor damage.\nSimilarly, Proofr’s app, while featuring an attractive interface, experienced repeated crashes during image saving, according to The Drive.\nThese issues highlight ongoing challenges in the technology, particularly regarding photo conditions and lighting.\n“Who takes the image, what time, [and] what angle” can dramatically affect results, Ekstein acknowledged, noting that environmental factors remain one of the biggest obstacles for accurate damage detection.\nDespite these limitations, Ekstein stressed the importance of transparency in damage claims.\n“You can’t go after scuffs — that goes against the whole service culture of those companies,” he told The Drive.\nHe argued that rental companies should only pursue claims for substantial damage costing at least $700 to repair, and customers should receive detailed repair estimates rather than flat fees.\nKuttner frames this technological shift as a pivotal moment.\n“We believe this is a turning point for AI moving from something that works for companies to something that works for everyone,” he told The Post.\nThe Post has sought comment from Hertz, Sixt, UVeye and ProovStation."
    }
  ],
  "argos_summary": "Meta executives approved controversial guidelines allowing AI chatbots to engage in romantic or sensual conversations with children, including inappropriate comments about their appearance. Following backlash and media scrutiny, Meta retracted parts of the document that permitted such interactions, while asserting a commitment to child safety. The guidelines also included troubling allowances for generating harmful content and misinformation, raising concerns about the ethical implications of AI usage in social media.",
  "argos_id": "J9UTCNMZJ"
}