{
  "url": "https://patch.com/california/san-francisco/sf-author-chris-carlsson-brings-hidden-san-francisco-haight-street",
  "authorsByline": "JL Trey Odom",
  "articleId": "d024f3345acb4901ae91fc5e6e17aa96",
  "source": {
    "domain": "patch.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://patch.com/img/cdn20/users/27157684/20250814/024611/styles/patch_image/public/img-2694___14142645976.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T20:48:36+00:00",
  "addDate": "2025-08-14T21:07:36.875255+00:00",
  "refreshDate": "2025-08-14T21:07:36.875258+00:00",
  "score": 1.0,
  "title": "SF Author Chris Carlsson Brings ‘Hidden San Francisco’ To Haight Street",
  "description": "Carlsson is celebrating the second edition release of his book via a talk at a Haight-Asbury bookstore.",
  "content": "SAN FRANCISCO, CA — Sure, there’s the Golden Gate Bridge, the Painted Ladies, Lombard Street and the sea lions that hang out at PIER 39 in Fisherman’s Wharf – all of which are on tourists’ “must-see” lists.\n\nBut San Francisco is a city chock full of lesser known landmarks, stories and complexities, which author Chris Carlsson excavates in “Hidden San Francisco: A Guide to Lost Landscapes, Unsung Heroes & Radical Histories” (Pluto Press, 376 pages, $19.99). “It's a guidebook that takes a deep dive into the lost, forgotten and suppressed histories of the city,” Carlsson told Patch.\n\nCarlsson is giving a talk at Bound Together Books this Friday at 7 p.m., during which he’ll discuss features in the second edition of “Hidden San Francisco,” published in April 2025. In the second edition, readers will find the new preface “In the Wake of the Pandemic,” as well as a new chapter, which he’ll be referencing during his presentation.\n\n“The chapter covers a bunch of ecological treks, hidden treasures of the physical landscape of the city that people often don't know about, even if they've lived here for a long time,” he said. He’s also added a “mini-history of tech” in San Francisco, including a consideration of ever-present-day artificial intelligence, in the second edition.\n\nCarlsson is a writer, San Francisco historian, photographer and avid bicyclist who has lived in the city since 1978. He's written three other books: “When Shells Crumble”; “After the Deluge”; and “Nowtopia.” His “Hidden San Francisco” guidebook and online archival project, FoundSF, go hand-in-hand. FoundSF is a comprehensive digital history archive of San Francisco, of which he’s been the co-director and main curator for nearly three decades.\n\n“It’s where a great deal of history has accumulated over the years,” he said. The first edition of “Hidden San Francisco\" was published in February 2020. “I do a lot of walking tours, bike tours and boat tours these days,\" he said. \"Most of it involves telling stories, and I've become a better storyteller [as a result]. Over time, that led to the book.\" Bound Together Books is located at 1369 Haight St., San Francisco. A flyer on a Haight Street utility pole promotes Chris Carlsson's talk about his book, \"Hidden San Francisco.\" (JL Odom / Patch)",
  "medium": "Article",
  "links": [
    "https://patch.com/california/san-francisco/arts-entertainment",
    "https://boundtogether.org/",
    "https://chriscarlsson.com/after-the-deluge/",
    "https://www.foundsf.org/Main_Page",
    "https://chriscarlsson.com/writing/nowtopia-the-book/",
    "https://chriscarlsson.com/hidden-san-francisco-the-book/",
    "https://chriscarlsson.com/when-shells-crumble/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Hidden San Francisco",
      "weight": 0.12859842
    },
    {
      "name": "San Francisco",
      "weight": 0.12764142
    },
    {
      "name": "San Francisco historian",
      "weight": 0.12126095
    },
    {
      "name": "author Chris Carlsson",
      "weight": 0.08751815
    },
    {
      "name": "Chris Carlsson",
      "weight": 0.0857421
    },
    {
      "name": "SF Author Chris Carlsson",
      "weight": 0.08362927
    },
    {
      "name": "Radical Histories",
      "weight": 0.08208016
    },
    {
      "name": "history",
      "weight": 0.07840401
    },
    {
      "name": "“Hidden San Francisco",
      "weight": 0.07589479
    },
    {
      "name": "Carlsson",
      "weight": 0.07181654
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/Reference/Geographic Reference/Other",
      "score": 0.646484375
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Other",
      "score": 0.5830078125
    },
    {
      "name": "/Travel & Transportation/Travel Guides & Travelogues",
      "score": 0.56787109375
    },
    {
      "name": "/News/Local News",
      "score": 0.32421875
    }
  ],
  "sentiment": {
    "positive": 0.24520104,
    "negative": 0.27056926,
    "neutral": 0.48422968
  },
  "summary": "Author Chris Carlsson has brought his book \"Hidden San Francisco\" to Haight Street, where he explores lesser known landmarks and stories. The book, \"A Guide to Lost Landscapes, Unsung Heroes & Radical Histories,\" is published by Pluto Press and aims to dive into the lost, forgotten and suppressed histories of San Francisco. Carlsson will discuss the second edition of the book, which will be published in 2025. He also added a \"mini-history of tech\" in the book. The guidebook and online archival project, FoundSF, are closely intertwined.",
  "shortSummary": "Chris Carlsson's book “Hidden San Francisco: A Guide to Lost Landscapes, Unsung Heroes and Radical Histories\" (Pluto Press) explores lesser known landmarks and stories in the city's history.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8092feaf1e994db782ed18b293d933e8",
  "places": [
    {
      "osmId": "28518695",
      "road": "Pier 39",
      "city": "San Francisco",
      "state": "California",
      "postcode": "94133",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 37.808703,
        "lon": -122.410116
      }
    },
    {
      "osmId": "402111597",
      "road": "Lombard Street",
      "city": "San Francisco",
      "state": "California",
      "postcode": "90214",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Russian Hill",
      "coordinates": {
        "lat": 37.8020202,
        "lon": -122.4194836
      }
    },
    {
      "osmId": "5455630121",
      "road": "Taylor Street",
      "city": "San Francisco",
      "state": "California",
      "postcode": "94133",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 37.808332,
        "lon": -122.415715
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://chriscarlsson.com/when-shells-crumble/",
      "text": "When Shells Crumble\nKing Tides! Intelligent fungi! Martial Law!\nHeat waves! Atmospheric rivers and floods!\nA discussion of When Shells Crumble that connects it to Nowtopia on a one-hour long podcast at “Speaking Out of Place,” June 20, 2024\nA glowing review at the San Francisco Chronicle!\n“When Shells Crumble may well be the most optimistic disaster novel you’ll ever read…”\n—A.D. Cirulis, San Francisco Chronicle, Nov. 29, 2023\nA nice Q&A in Mission Local, February 22, 2024\nby Chris Carlsson\nISBN 978-1-959556-82-4\n468 pages\nWhen Shells Crumble\n$25.00 plus shipping\n(Outside the U.S. shipping cost is the price of the book! If you want one shipped outside the U.S. please pay for two books and I’ll send you one!)\nAVAILABLE NOW AT THESE SAN FRANCISCO BOOKSTORES:\nCity Lights Books, Medicine for Nightmares, Bird & Beckett, Dog-Eared Books, Borderland Books, Bound Together Books\nThe inventor of the Hempattery quits her corporate job to pursue her visionary biotech experiments only to find a back-burnered idea of hers was stolen, bioengineered, and disseminated by mysterious biohackers, leading to a new malleable fungus that takes on properties no one expected. The Robertson family, a sprawling black San Francisco clan, finds itself at the heart of this swirling urban saga. From the 101-year-old matriarch through her youngest son Frank, a UCSF cop, to the urban farming granddaughter Janet, sons and daughters move through this strangely familiar San Francisco.\nAfter a Supreme Court-endorsed reversal of the popular vote in Arizona and Wisconsin leads to a new Republican government in 2024, protests erupt, and a National Emergency is declared. When security forces open fire at a Dolores Park protest, resistance blooms and surprising new agents of history appear, from urban peasants, activist plumbers, and mountain squatters, to underground scientists, disaffected security personnel, and rebellious tech workers. The federal government begins to erode from within as its efforts to dictate food and energy consumption falter while climate catastrophes produce unprecedented economic and ecological crises.\nChris Carlsson is one of the great bards of San Francisco, whose activism and storytelling have reshaped the way we understand our city’s past—and changed its future. When Carlsson offers a vision of urbanism to come, you’d better pay attention.\n—Annalee Newitz, author of The Terraformers and Four Lost Cities: A Secret History of the Urban Age\nCarlsson’s masterful storytelling coupled with his deep ecological and historical knowledge of the Bay Area roots this novel intimately in place and community. His characters are multi-faceted, communicating the complexity of movements for justice made up of passion, vision, compromise, conflict and possibility. When Shells Crumble is a wild ride, that will leave you breathless at times, while over and over again centering the power of community — across many lines of difference — to manifest the world we so desperately need.\n—Joanna Shenk\nSo deeply personal, alarming and hopeful. It’s a great read!\n—Meg Sandine\nJust finished and loved your book—only regret was facing reality after I finished it!\n—Stacey Carter\nCarlsson invites us to put the imagination back in the revolution. When Shells Crumble is reminder that the path from dystopia to utopia may not be as long as we have feared it to be.\n—James R. Tracy, co-author No Fascist USA! The John Brown Anti Klan Committee and Lessons for Today’s Movements\nFuturist and thought provoker Carlsson once again imagines a near-future scenario where disaster spawns opportunities for radical self-reliance. San Francisco and the greater Bay Area are where history, politics, culture and environment create a messy stew of biotech, inequality, activism, and overreaching federal crackdowns. But wait—mysteriously enabled flora and fauna may be allies in the struggle! As with his first novel After the Deluge, Carlsson’s ideas will stay in your mind long after you put down his tale of radicalized plumbers and urban gardeners.\n—Laura Lent, retired, formerly Chief of Collections & Technical Services, San Francisco Public Library\nA must read account of modern day SF: the different possible scenarios that could await us and how to organize to ensure a just future. Urban gardeners, plumbers, biotech hackers and crows—yes, crows!!—organize to fight back against an authoritarian regime.\n—Tina Gerhardt, Environmental Journalist and Academic\nMost dystopian fiction takes the reader to strange new worlds where mutations are large and grotesque. The strength of Chris Carlsson’s When Shells Crumble instead arises from how close its future-world is to our present-day Trumpland realities. Enriched by Carlsson’s deep, sympathetic understanding of San Francisco Bay Area alternative undergrounds, When Shells Crumble brings us into a landscape of martial law and spirited resistance to it, made all the more chilling by how little distance there seems between his imagined nightmare scenario and the near-nightmare we currently inhabit.\n—Joseph Matthews, author of The Blast"
    },
    {
      "url": "https://chriscarlsson.com/after-the-deluge/",
      "text": "After the Deluge\nAfter the Deluge\nA Novel of Post-Economic San Francisco\nA teenage arsonist threatens a partially submerged mid-22nd century San Francisco. As a Public Investigator “tryout” seeks evidence across the utopian city full of canals and veloways, political and social conflicts erupt. When there is no such thing as property, what is crime, and how does a utopian society protect itself from bad behavior? Should scientists be as free as artists to create? What is a “free market” for work without and money and commodities?\nNewly available again!\nOrder directly from Amazon’s print-on-demand service here.\nA provocative and speculative journey to the Bay Area of 2157… more an imaginary treasure map than utopia-by-the-numbers blueprint… This book might show much more in common with Starhawk’s Fifth Sacred Thing if Carlsson weren’t so precisely and persistently allergic to the kind of earth religion Starhawk promotes. After The Deluge is for atheists and agnostics and activists who don’t need the goddess to get their revolutionary groove on.\n—Anu Bonobo, Fifth Estate Magazine, Fall 2005\nAs a great American writer and champion of the rights of working people, Carl Sandburg, once wrote: Nothing happens unless first a dream. After the Deluge is a dream of an intelligently organized America in a coming century. Yet far from a dry polemic, the work presents its arguments through a mystery story both intriguing and revealing, and delightfully full of humorous touches. Here are compelling, flesh-and-blood characters with often contradictory points of view, culminating in a final chapter as effective and arresting as any I have read in decades.\n—Daniel Steven Crafts, Emmy-winning composer and social revolutionary (not necessarily in that order)\nMany tackle the apocalypse, but not since Ernest Callenbach’s Ecotopia has a writer envisioned its Left Coast utopian aftermath. In Carlsson’s highly imaginative sci-fi thriller, an alienated teen and an arson investigator reveal the fissures in San Francisco’s revolutionary new society. After The Deluge deserves a wide readership for its vivid blueprint of a sustainable direct democracy set among the still-familiar human cultures and neighborhoods—enhanced by greenways and canals—of the City by the Bay.\n—Laura Lent, librarian, San Francisco Public Library\nSet in a just plausible future in San Francisco, Chris Carlsson‘s first novel explores right and wrong in a too perfect world when human passions, for better and worse, cannot be predicted, controlled, or even gently channeled into willing, mutually beneficial compliance. We may never see the world we dream of, which lies just underneath the city we love and the lives we lead. We need fiction like this to show us the possibilities we might dare to imagine.\n—Jon Christensen, Steinbeck Fellow, San Jose State University"
    },
    {
      "url": "https://chriscarlsson.com/writing/nowtopia-the-book/",
      "text": "Nowtopia - The Book\nNowtopia is a book about a new politics of work. It profiles tinkerers, inventors, and improvisational spirits who bring an artistic approach to important tasks that are ignored or undervalued by market society. Rooted in practices that have been emerging over the past few decades, Nowtopia’s exploration of work locates an important thread of self-emancipatory class politics beyond the traditional arena of wage-labor.\nOutlaw bicycling, urban permaculture, biofuels, free software, even the Burning Man festival, are windows into a scarcely visible social transformation that challenges politics as we know it. As capitalism continues its inexorable push to corral every square inch of the globe into its logic of money and markets, new practices are emerging that are redefining politics. In myriad ways, people are taking back their time and technological know-how from the market and in small under-the-radar ways, are making life better right now. In doing so, they also set the foundation—technically AND socially—for a genuine movement of liberation from market life. The social networks thus created, and the practical experience of cooperating outside of economic regulation, become a breeding ground for new strategies and tactics to confront the everyday commodification to which capitalism reduces us all.\nNowtopia uncovers resistance and rebellion amidst fractions of a slowly recomposing working class in America. Rarely self-identifying as mere ‘workers,’ people from all walks of life are doing incredible amounts of work in their “free” “non-work” time. This unpaid work is creating immediate practical improvements in daily life. More interesting still, these myriad initiatives constitute a more thorough-going refusal of politics and economics as usual. In Nowtopia, Marx’s concept of the General Intellect is freshly applied to the disparate initiatives that are percolating largely out of public sight. Building on the investigative methodology developed by autonomist Marxists in Europe and the U.S.A., Carlsson recontextualizes the so-called “middle class” as an example of working class recomposition. The practical rebellions outlined in this book embody a deeper challenge to the basic epistemological underpinnings of modern life, as a new ecologically-driven politics emerges from below to reshape our assumptions about science, technology and human behavior.\nThe semi-conscious war between these life-affirming, self-emancipating behaviors and the coercive domination of money, property, and survival amidst contrived scarcity is the core investigation of this book.\nTranslated into Italian by Shake Edizioni (Milan: 2009) and Portuguese by Tomo Editorial (Porto Alegre, Brazil: 2014)"
    },
    {
      "url": "https://chriscarlsson.com/hidden-san-francisco-the-book/",
      "text": "Hidden San Francisco—The Book\nA “Baker’s Dozen” Virtual Tour, featuring 13 short videos (selected from the 85 “stops” in the four-themed chapters, and 44 additional “stops” in the walking tours appendix of Hidden San Francisco).\nThe second edition includes new tours on the wild and natural parts of San Francisco that most tourists never visit, from Glen Canyon to Sutro Forest. There is also a new introduction examining the impact of the pandemic, as well as a mini-history of tech in the city, from the Gold Rush to AI.\nSan Francisco is an iconic and symbolic city. But only when you look beyond the picture-postcards of the Golden Gate Bridge and the quaint cable cars do you realize that the city’s most interesting stories are not the Summer of Love, the Beats, or even the latest Gold Rush in Silicon Valley.\nHidden San Francisco is a guidebook like no other. Structured around the four major themes of ecology, labor, transit and dissent, Chris Carlsson peels back the layers of San Francisco’s history to reveal a storied past: behind old walls and gleaming glass facades lurk former industries, secret music and poetry venues, forgotten terrorist bombings, and much more. Carlsson delves into the Bay Area’s long prehistory as well, examining the region’s geography and the lives of its inhabitants before the 1849 Gold Rush changed everything, setting in motion the clash between capital and labor that shaped the modern city.\nThe definitive ‘history from below,’ Hidden San Francisco highlights moments of historic contestation when paths forked and choices fought over by the city’s prior inhabitants opened some doors and closed others. From the perspective of the students and secretaries, longshoremen and waitresses, Hidden San Francisco uncovers dozens of overlooked, forgotten, and flushed histories that pulse through the streets and hills even today, inviting the reader to see themselves in the middle of the ongoing, everyday process of making history . . . together.\n2nd edition Public Events:\nThursday, May 8, 2025, 6:30 pm Medicine for Nightmares, 24th Street San Francisco\nSaturday, May 31, 12 noon Presidio Visitors Center/Tunnel Tops Park, followed by hike to Baker Beach!\nThursday, July 24, 6:00 pm City Lights Books (zoom).\nFriday, August 15, 7:00 pm Bound Together Books on Haight Street near Masonic.\nThursday, September 25, 7:00 pm, Bird & Beckett Books and Music, Chenery Street, Glen Park\nSaturday, September 27, 4:00 pm, North Beach Branch Library, Columbus Avenue.\nAuthor Appearances:\nFebruary 28, 2020: Inaugural Bay Cruise, 4-6:30\nMarch 5, 1-2pm: KPOO-FM radio\nMarch 11: birthday party and book release at our Shaping SF Talk series at 518 Valencia, 7:30-9:30\nMarch 24, East Bay Yesterday podcast!\nApril 14, 2-3:30pm: San Francisco Village, 3220 Fulton Street, SF (ZOOM)\nMay 18, Pluto Press podcast!\nJune 24, Against the Grain, KPFA-FM\nJuly 7, 7-8 pm: Mechanics Institute, 65 Post Street, Zoom presentation\nJuly 14, 7-8:30 pm: San Francisco Public Library, Zoom presentation\nAugust 5, 5-6:30 pm: Northern California Tour Guide Guild (Zoom)\nJanuary 12, 2021, 1:30-4pm: Osher Lifelong Learning Institute (OLLI) San Francisco State University (Zoom)\nReviews\nSan Francisco is long overdue for a history like this! Smart, accessible, and an outgrowth of decades of history by and for the people, this is a book that everyone who has left a piece of their heart in the city needs to read. Its vibrant stories of the past are invaluable tools for charting a sustainable, inclusive future.\n—Barbara Berglund Sokolov, PhD, Historian, Presidio Trust\nFrom co-founding the groundbreaking mass bike ride Critical Mass, to launching the subversive anti-corporate zine Processed World, to his well-researched, lively and fun online historical pieces, for decades Chris Carlsson has been a city treasure, a truly indispensable San Franciscan. In his new book “Hidden San Francisco,” Carlsson brings his unique combination of erudition, curiosity and passionate progressivism to a remarkably wide range of subjects—from the city’s profaned natural glories, to little-known episodes in its labor history, to a Homeric list of people, organizations and movements that have tried to throw a spoke in the grinding cogs of various incarnations of The Establishment. Anyone interested in San Francisco’s hidden histories should read this book.\n—Gary Kamiya is the author of the bestselling book Cool Gray City of Love: 49 Views of San Francisco. He also writes “Portals of the Past,” a history column that appears in the San Francisco Chronicle.\nWith the city awash these days with more and more newcomers, Chris Carlsson’s Hidden San Francisco is more vital than ever for keeping us all connected to the wild, weird, and radical histories that make this place so special. Dig into it—it’s full of gold.\n—Susan Stryker, dir., “Screaming Queens: The Riot at Compton’s Cafeteria.\nIf you want to explore San Francisco in depth, this book will introduce you to Chris Carlsson, activist and guide extraordinaire. For three decades Chris has wandered through the city producing a prodigious flow of guided tours on foot and by bike, lectures, and books plus FoundSF.org, a wiki that “invites history buffs, community leaders, and San Francisco citizens of all kinds to share their unique stories, images, and videos from past and present.” Unlike your conventional guide books with their emphasis on where to shop, eat, and be entertained, this is a dissenter’s guidebook that invites you into a more holistic view of the city—bringing to life the stories of everyone from the hot politicians and their corporate paymasters to those tens of thousands of people—“the unsung and often ignored” streetcar conductors, secretaries, construction workers, organizers, musicians, cabbies, and longshoreman who actually built the city and keep it running. The story is a wild one and not always pretty given the City’s long, sometimes violent history of class and racial conflict. Chris would like you to “see your own participation in the City’s life—whether as a resident or a visitor—in a new light.” The text and tours will help you do just that.\n—Peter Booth Wiley is a publisher and author who has explored the city’s history in his own writing for half a century.\nIt is gratifying to see Shaping San Francisco, an invaluable resource for local history and education, turned into a book. Scores of sparkling vignettes—from Mission Rock to the Haight, Balmy Alley to Telegraph Hill—illuminate the city with the torch of social criticism and the sharp lens of a local sage. This is history from below at its best and a guidebook through the byways of collective memory. No one knows San Francisco better than Chris Carlsson, who unearths stories across the city to use as stepping stones to the past. He, too, is one of the city’s best kept secrets, in the trenches for decades—along with LisaRuth Elliott—digging up and archiving the city’s history. And he’s done it all on a shoestring—just a bike, laptop and insatiable curiosity. Best of all, he loves to share his wisdom with the people of the city through tours, events, media—and this delightful book.\n—Richard Walker, Prof. Emeritus, UC Berkeley, author of Pictures of a Gone City, Atlas of California, The Country in the City and The Conquest of Bread.\n“An original, vividly-written people’s history of the nation’s ‘Left Coast City.’ Photos, maps, and self-guided tours of over one hundred of the most important and iconic historic places and spaces bring to life the authors’ beautifully-crafted and well-informed San Francisco stories.”\n—Bill Issel, Professor Emeritus of History, San Francisco State University, and coauthor of San Francisco 1865-1932: Politics, Power, and Urban Development\nA historical guidebook and a call to action, Hidden San Francisco uncovers the histories of struggle hidden within San Francisco’s buildings, alleyways, and open spaces. This crackling “street history” arrives at an urgent moment. As longtime residents are displaced and their pasts erased, continued gentrification appears inevitable. But this book reminds us that wherever we stand in San Francisco, we are surrounded by spaces where residents once demanded and achieved a more inclusive city. This book inspires readers to rediscover San Francisco and find a city in which the future is not yet written.\n—Christopher Agee, The Streets of San Francisco: Policing and the Creation of a Cosmopolitan Liberal Politics, 1950-1972\nSan Francisco sits at the precipice of a rapacious new gilded age and is at the center of a global existential crisis over progress, climate change, and our humanity. Tech moguls headquartered in the Bay Area seek to surveille and commodify all that we know and breathe, while real estate barons corner one of the world’s most livable and multicultural places. With this concise history, Chris Carlsson shows us that this is not the first bout between San Francisco and the captains of unfettered greed. San Francisco was at the core in the struggles of the last gilded age. Through persistent struggle and deliberate political opposition, this history shows us that there are ways justice can prevail. This history is a guide for informed rebellion!\n—Jason Henderson, Professor, Geography and Environment, San Francisco State University\nThis is the history of San Francisco I’ve been waiting for. With Shaping San Francisco (the organization) serving as the primary public hostel giving intellectual shelter to all matters of this region’s peoples history, Chris Carlsson and LisaRuth Elliott have been the preeminent concierges. For them to translate and distill all they have learned into Hidden San Francisco is a monumental gift for everyone interested in this metropolis. It not only reorients our conceptions of the past, it gives us bicycling and walking tour itineraries so we can viscerally experience how we are participants in the regions remaking. History as public practice comes alive in this compelling page turner.\n—Sean Burns author of Archie Green: The Making of a Working Class Hero\nWant to know about Nicaraguans in the Mission organizing in solidarity with the Sandinistas? Why Chinese fishermen were sailing boats made out of redwood into the Bay’s mudflats? Who was involved in the ten-year protest against evicting elderly men from the I-Hotel in Manilatown? Look no further! Few people know the streets (and history) of San Francisco as well as Chris Carlsson, a co-founder of Critical Mass bike rides who guides readers through San Francisco’s long, strange trip. Sadly, gentrification is fast ripping the heart out of a city that generations of artists, immigrants, and working-class radicals have made into a unique and wondrous place. However, Carlsson’s a good enough historian to know that the current redevelopment wave wasn’t the first. This book, thus, can be read as an obituary for his beloved home or, perhaps, a call to arms to renew the city again.\n—Peter Cole, Professor of History, Western Illinois University, Author, Dockworker Power: Race and Activism in Durban and the San Francisco Bay Area, University of Illinois Press: 2018\nEvery city needs and deserves a Chris Carlsson. San Francisco is fortunate to have him and Hidden San Francisco, not just because history from below is worth remembering, but more importantly because it is full of possibilities we should never forget for the present and future of The City.\n—Jon Christensen, UCLA Institute of the Environment and Sustainability, Laboratory for Environmental Narrative Strategies, Department of History, Center for Digital Humanities, cityLAB, Adjunct Assistant Professor, Senior Fellow, Journalist-in-Residence"
    }
  ],
  "argos_summary": "Chris Carlsson's \"Hidden San Francisco: A Guide to Lost Landscapes, Unsung Heroes & Radical Histories\" explores the city's overlooked histories and lesser-known landmarks, offering a unique perspective on San Francisco beyond its iconic attractions. The second edition, set to be released in April 2025, includes a new chapter on ecological treks and a mini-history of technology in the city. Carlsson, a long-time resident and historian, aims to connect readers with the rich, often suppressed narratives that shape the city's identity.",
  "argos_id": "JHXPP39OZ"
}