{
  "url": "https://www.foxnews.com/politics/dc-police-announce-major-action-immigration-enforcement-after-trumps-crime-crackdown",
  "authorsByline": "Cameron Arcand",
  "articleId": "43cef16f6ba041859a40d31f9f4f8652",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/07/ice-reuters.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T14:41:45-04:00",
  "addDate": "2025-08-14T18:51:56.961863+00:00",
  "refreshDate": "2025-08-14T18:51:56.961864+00:00",
  "score": 1.0,
  "title": "DC police announce major action on immigration enforcement after Trump's crime crackdown",
  "description": "DC police chief authorizes sharing information with immigration agencies during traffic stops but prohibits arrests based solely on federal immigration warrants.",
  "content": "Washington, D.C., Police Chief Pamela Smith issued an executive order giving limited cooperation with federal immigration authorities on Thursday.\n\nThe move comes after the recent federal takeover of the department and the sending of National Guard troops to curb crime and homelessness in the capital.\n\nAccording to the order, Metropolitan Police Department officers can now help with \"sharing information about persons not in MPD custody\" such as during \"traffic stops\" and can provide \"transportation for federal immigration agency employees and detained subjects,\" according to NBC 4 Washington.\n\n‘RADICAL’ DC OFFICIALS TREATED OFFICERS ‘LIKE CRAP,’ POLICE LEADER SAYS – 7 ATTACKS THAT LED TO TRUMP TAKEOVER\n\nHowever, the order says personnel cannot \"make any inquiry through any database solely for the purpose of inquiring about an individual's immigration status.\"\n\n\"Members shall not make inquiries into any person's immigration status for the purpose of determining whether they have violated the civil immigration laws or for the purpose of enforcing civil immigration laws,\" the order stated.\n\n\"Members shall not arrest individuals based solely on federal immigration warrants or detainers as long as there is no additional criminal warrant or underlying offense for which the individual is subject to arrest,\" the order continued.\n\nI SUPPORT TRUMP TAKING CONTROL OF DC POLICE — THE CONSTITUTION IS ON HIS SIDE\n\nThe capital is considered a sanctuary city, which Mayor Muriel Bowser tried to get scrapped earlier this year, according to Axios.\n\nCLICK HERE FOR MORE IMMIGRATION COVERAGE\n\n\"Excellent news. America’s capital city should not be a sanctuary for lawlessness,\" Sen. Mike Lee, R-Utah, tweeted.\n\nThe federal takeover of the police department was announced by President Donald Trump on Monday, and there’s been a heightened law enforcement presence throughout the city, including the National Guard at places like Union Station.\n\nAG PAM BONDI MEETS WITH DC MAYOR AS TRUMP DISPATCHES NATIONAL GUARD TROOPS IN CAPITAL\n\nOn Wednesday night alone, there were 45 arrests, and 29 of them were people in the country illegally, as numerous federal agencies are taking part in the major crackdown.\n\nWhile the takeover has been praised by Republicans and some D.C. residents, many Democrats have been vocally opposed. The move was prompted in large part by juvenile criminal activity throughout the city in recent months.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"The Administration’s actions are unprecedented, unnecessary, and unlawful. There is no crime emergency in the District of Columbia. Violent crime in DC reached historic 30-year lows last year, and is down another 26% so far this year,\" D.C. Attorney General Brian Schwalb posted to X on Monday. \"We are considering all of our options and will do what is necessary to protect the rights and safety of District residents.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/category/topic/sanctuary-cities",
    "https://www.foxnews.com/category/us/immigration",
    "https://www.foxnews.com/us/radical-dc-officials-treated-officers-like-crap-police-leader-says-7-attacks-led-trump-takeover",
    "https://www.foxnews.com/category/us/washington-dc",
    "https://www.foxnews.com/category/crime",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/politics/ag-pam-bondi-meets-dc-mayor-trump-dispatches-national-guard-troops-capital",
    "https://www.foxnews.com/opinion/i-support-trump-taking-control-dc-police-constitution-his-side",
    "https://x.com/SegravesNBC4/status/1955982188551327974",
    "https://www.foxnews.com/video/6376922687112"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "federal immigration warrants",
      "weight": 0.09930729
    },
    {
      "name": "federal immigration agency employees",
      "weight": 0.09621897
    },
    {
      "name": "federal immigration authorities",
      "weight": 0.09610871
    },
    {
      "name": "immigration enforcement",
      "weight": 0.08695574
    },
    {
      "name": "civil immigration laws",
      "weight": 0.086820535
    },
    {
      "name": "DC POLICE",
      "weight": 0.08009734
    },
    {
      "name": "DC police",
      "weight": 0.08009734
    },
    {
      "name": "MORE IMMIGRATION COVERAGE",
      "weight": 0.07754095
    },
    {
      "name": "numerous federal agencies",
      "weight": 0.07693119
    },
    {
      "name": "DC MAYOR",
      "weight": 0.06842206
    }
  ],
  "topics": [
    {
      "name": "Social Issues"
    },
    {
      "name": "US Politics"
    },
    {
      "name": "Immigration"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.94287109375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.93603515625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.8642578125
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.8232421875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.720703125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.708984375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.55419921875
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.5029296875
    },
    {
      "name": "/News/Local News",
      "score": 0.310791015625
    }
  ],
  "sentiment": {
    "positive": 0.056165583,
    "negative": 0.7248186,
    "neutral": 0.21901582
  },
  "summary": "Washington, D.C., Police Chief Pamela Smith has issued an executive order limiting cooperation with federal immigration authorities. This follows the recent federal takeover of the department and the deployment of National Guard troops to combat crime and homelessness in the capital. The order allows for officers to assist in sharing information about individuals not in custody and providing transportation for federal immigration agency employees and detained subjects. However, it also stipulates that they cannot make inquiries into individuals' immigration status based solely on federal immigration warrants or detainers. The move has been praised by Republicans and some D.c. residents, but many Democrats have voiced opposition.",
  "shortSummary": "Washington D.C. Police Chief Pamela Smith issued an executive order allowing limited cooperation with federal immigration authorities, amid a major crime crackdown.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "11b1b94cbefb495a830b26ccdc476102",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/category/topic/sanctuary-cities",
      "text": "Media 1 day ago Ex-police chief warns Chicago cops will get hurt because Mayor Johnson won’t help ICE A former Riverside police chief warned that Mayor Brandon Johnson's anti-ICE stance could lead to injuries among Chicago police officers and federal agents.\nImmigration 4 days ago ICE arrests illegal immigrant charged with child sex crimes after his release by local police despite detainer ICE arrested an illegal immigrant from Guatemala after Rhode Island police released him despite child sex crime charges and an active immigration detainer.\nSanctuary Cities 6 days ago $30K in migrant housing aid has Dem gov on hot seat for 'revolving door' policy As Gov. Maura Healey, D-Mass., closes down her state's migrant shelters, she is facing criticism for simultaneously making migrants eligible for tens of thousands in housing aid.\nFox News Flash August 7 Tom Homan puts sanctuary cities 'on notice' as Trump administration cracks down on immigration Border Czar Tom Homan put sanctuary cities on notice as the Justice Department ramps up its crackdown on jurisdictions that hinder immigration enforcement.\nMigrant Crime August 6 Two illegal immigrant suspects indicted on attempted murder charges in CBP officer shooting case in NYC Manhattan DA announces additional charges against two suspects with illegal immigration status who shot off-duty border patrol officer during armed robbery.\nVIDEO August 6 Tom Homan: We are putting sanctuary cities ‘on notice’ Border czar Tom Homan discusses sanctuary city policies and the ‘Speedway Slammer’ migrant detention facility on ‘The Faulkner Focus.’\nImmigration August 5 Bondi DOJ names and shames 35 sanctuary jurisdictions that ‘put American citizens at risk’ Department of Justice identifies nearly three dozen cities and states for allegedly protecting illegal immigrants, warns of legal action against jurisdictions\nVIDEO August 3 Democratic Party 'gets more status fighting ICE than criminals,' former official says Former Acting ICE Director Jonathan Fahey discusses ICE detaining an illegal immigrant accused of killing a New Jersey mom and child during a drunk driving incident and the Trump administration's legal efforts against sanctuary city policies.\nImmigration July 31 Democrats creating 'two-tiered' legal system that keeps Latinos down, says LA GOP leader A legal immigrant and chair of the Los Angeles County GOP is saying that pro-sanctuary Democrats are deliberately building a two-tiered justice system designed to trap Latinos and immigrants in a “permanent underclass.\"\nSanctuary Cities July 30 Newsom office dismisses crime fears, defends sanctuary policies amid surge in violence: 'Fake news' Gov. Gavin Newsom is denying experts' claims that sanctuary policies sheltering lawbreakers are directly responsible for a rising crime and violence in Democratic-run jurisdictions.\nSanctuary Cities July 28 Dems' sanctuary policies shield 'gangbangers,' harm Latino families, businesses, says Hispanic GOP lawmaker Hispanics living in Democratic-run jurisdictions are frustrated with sanctuary policies allowing criminal illegal aliens to prey on their communities, says a Latino GOP lawmaker.\nPortland July 28 Portland anti-ICE demonstrators confused when person in full-size Elmo costume shows up A person in Elmo costume trolls anti-ICE demonstrators on Friday at a Portland detention facility amid tensions at the controversial location.\nOpinion July 28 America’s crime drop isn’t a coincidence. Trump’s immigration policies are working Crime rates fall as immigration enforcement increases under Trump administration, with violent crime now lower than pre-pandemic 2019 levels according to new report\nChicago July 26 Federal judge tosses Trump DOJ lawsuit against sanctuary policies in Chicago A federal judge in Illinois has dismissed a Trump administration lawsuit that sought to disrupt limits Chicago imposes on cooperation between federal immigration agents and local police.\nJustice Department July 24 Trump DOJ sues New York City over long-standing sanctuary immigration policies New York City faces federal lawsuit from the Trump administration targeting sanctuary policies dating back to 1989 that prevent authorities from honoring ICE detainer requests.\nVIDEO July 24 New twist in Kilmar Abrego Garcia court battle: 'Judges will be checked' Former federal prosecutor and acting ICE Director Jonathan Fahey weighs in a judge pausing Kilmar Abrego Garcia's release and the rise in ICE detainers in New York City.\nDonald Trump July 23 ICE detainers in top sanctuary city have skyrocketed under Trump compared to Biden's 4-year term: DHS Data released by the Department of Homeland Security shows that the Trump administration has surged the number of ICE detainers in New York City compared to former President Joe Biden.\nVIDEO July 21 Tom Homan: The Left doesn't want to admit the truth Trump 'border czar' Tom Homan outlines why the crime rate is so high in New York and promises to 'flood the zone' on sanctuary cities on 'Hannity.'\nVIDEO July 21 Democrats' policies shield these 'monsters' from deportation: Stephen Miller White House deputy chief of staff for policy Stephen Miller fires back at Hunter Biden's f-bombs against deportations on 'The Ingraham Angle.'\nSanctuary Cities July 21 Eric Adams responds to Tom Homan pledge to ‘flood the zone’ with ICE agents after CBP shooting After Tom Homan vowed to “flood the zone\" with ICE agents in response to the shooting of a CBP agent in NYC, Mayor Eric Adams weighed in on whether he'll cooperate.\nVIDEO July 21 BREAKING: Noem, Homan sound alarm after 2nd illegal arrested in CBP shooting Retired Border Patrol Agent Chris Clem and former Homeland Security advisor Chuck Moreno join 'America's Newsroom' to weigh in on an illegal immigrant allegedly shooting and injuring an off-duty Border Patrol agent.\nImmigration July 18 Feds' California Home Depot raid nabs 11 illegal migrants, one with 67 prior jail bookings Border Patrol in Sacramento arrested 11 illegal migrants during a raid at a Home Depot parking lot — including one man with 67 prior bookings in California since 1986.\nImmigration July 17 Twice-deported migrant rapist freed as Dems face heat for sanctuary policies The release of a twice-deported rapist in Virginia is putting renewed focus on the dangers posed by Democrat-led sanctuary policies that limit cooperation with Immigration and Customs Enforcement (ICE).\nOregon July 16 Portland City Council considers how to boot ICE out of city facility Portland’s progressive-leaning city council is exploring ways to expel Immigration and Customs Enforcement (ICE) from a detention facility that has become a flashpoint for violent clashes between agents and radical agitators.\nImmigration July 10 Florida tourist hotspot nearly becomes sanctuary city before leaders reverse ICE policy Florida's Key West voted to reinstate its immigration agreement with ICE just one week after ending it, following threats of penalties from Governor DeSantis's administration.\nFlorida July 2 DeSantis administration threatens to punish island city that voted to end police agreement with ICE Florida officials threatened Key West commissioners with removal after they voted to end their immigration enforcement partnership with ICE.\nImmigration July 1 DOJ silent on whether NYC politician who allegedly assaulted ICE officer will face charges The DOJ is remaining silent on whether it will be pressing charges against NYC comptroller and then Democratic mayoral candidate Brad Lander after he allegedly assaulted a federal immigration officer.\nVIDEO June 25 GOP lawmaker cites ‘new Democratic Party policies’ for rising national security threats Rep. Brian Mast, R-Fla., discusses U.S. national security after the Trump administration bombed Iranian nuclear facilities on ‘The Story.’\nNational Guard June 24 GOP bill would grant Trump right to deploy National Guard for immigration enforcement The GUARD Act aims to authorize presidential deployment of National Guard for immigration enforcement when states refuse to cooperate, with harsh penalties for attackers.\nImmigration June 23 ICE arrests alleged gang member hiding from Mexican authorities in sanctuary city: 'Heinous murderer' ICE captures Orlando Diaz-Cebada, an illegal immigrant with alleged gang ties, in New Haven after fleeing Mexico where he's wanted for aggravated homicide of an officer."
    },
    {
      "url": "https://www.foxnews.com/category/crime",
      "text": "VIDEO 30 mins ago Bondi puts sanctuary cities on notice after DC federal takeover, answers if other areas could be next Attorney General Pam Bondi told Fox News Digital she's demanding answers from sanctuary jurisdictions on what they're doing to cooperate with the Trump administration after D.C. police federal takeover.\nKentucky 33 mins ago Louisville woman shot and killed walking child to school bus stop Kentucky police are searching for the shooter who killed a woman at a school bus stop in Louisville. Children witnessed the deadly shooting.\nWashington DC 45 mins ago Trump's federal crime operation brings 100 arrests, 800 National Guard troops to Washington Trump's federal crime task force makes 45 arrests overnight in Washington, D.C., while protests emerge against National Guard deployment and police takeover.\nImmigration 50 mins ago DC police announce major action on immigration enforcement after Trump's crime crackdown DC police chief authorizes sharing information with immigration agencies during traffic stops but prohibits arrests based solely on federal immigration warrants.\nVIDEO 51 mins ago DC shop owners speak out on juvenile crime after massive robbery Sajib Uddula and Tamika Alston, the owners of a store that was robbed by juveniles, discusses Washington D.C.’s crime problem and more on ‘America Reports.’\nNevada 1 hour ago Dramatic video shows Nevada casino gunman immediately opening fire on responding officers Bodycam footage shows Reno officers engaging with armed suspect Dakota Hawver after police say he killed Justin Aguila, Andrew Canepa and Angel Martinez at Grand Sierra Resort casino.\nVIDEO 1 hour ago Controversial college 'health kits' go viral, spark debate 'Outnumbered' reacts to some parents sending their children to college with Narcan.\nVIDEO 1 hour ago NYPD officer chases down shooting suspect Bodycam footage showed NYPD officers rushing to apprehend a shooting suspect after gunshots rang out.\nWashington DC 2 hours ago GOP Sen. Markwayne Mullin, former MMA fighter, skips seat belts in DC over carjacking fears GOP Sen. Markwayne Mullin of Oklahoma said he does not wear a seat belt while driving in Washington D.C. due to the possibility of being carjacked\nVirginia 2 hours ago Multiple Virginia deputies 'shaken up' after being injured in gunfire while serving warrants, protective order Pittsylvania County Sheriff Michael Taylor said the three deputies who were injured in gunfire while responding to a home are \"shaken up\" but are expected to survive."
    },
    {
      "url": "https://www.foxnews.com/politics/ag-pam-bondi-meets-dc-mayor-trump-dispatches-national-guard-troops-capital",
      "text": "Washington, D.C., Mayor Muriel Bowser and the city's police chief traveled to Justice Department headquarters on Tuesday to meet with Attorney General Pam Bondi and other senior administration officials to discuss the temporary National Guard takeover in the nation's capital.\nThe meeting came hours after President Donald Trump announced plans Monday to temporarily federalize law enforcement in the nation's capital, both through deploying hundreds of D.C. National Guard troops, and taking control in the near-term of the city's local police force.\nSpeaking to reporters after the meeting, Bowser said the sit-down was focused on coordination and strategy with the federal government.\n\"What I’m focused on is the federal surge and how to make the most of the additional officer support that we have,\" Bowser said. \"We have the best in the business with [Metropolitan Police Chief] Pamela Smith to lead that effort, and to make sure that the men and women who are coming from federal law enforcement are being well-used, and that if there’s National Guard here they’re being well-used.\"\nIS THREATENING TO 'FEDERALIZE' DC WITH NATIONAL GUARD AND MORE. HERE'S HOW THAT COULD PLAY OUT\nThe meeting with Bondi and other senior Trump officials, including FBI Director Kash Patel and U.S. Marshals Service Director Gady Serralta, came after Trump on Monday announced plans to use a 1973 D.C. Home Rule Act provision to send National Guard troops to D.C., as part of an effort to \"reestablish law order and public safety\" and temporarily federalize the city.\nD.C. officials, for their part, also urged calm on Tuesday, with Chief Smith stressing to reporters that they regularly work alongside federal law enforcement officials. \"I think this is going to be a good effort,\" she said Tuesday.\n\"It's going to be an effort that's supported by both teams, the Metropolitan Police Department, as well as our federal partners,\" she said.\n\"What we've done at this point is we have provided the team – the administrator – with a strategic plan on how we will provide resources around our city,\" she said.\n\"I think it's something that is doable. We know that we have to get illegal guns off of our streets, and if we have this influx or enhanced presence, it's going to make our city even better.\"\nFBI OUSTS FORMER ACTING DIRECTOR, AGENT INVOLVED IN J6 PROSECUTIONS, WITH MORE EXPECTED\nThe effort was separately praised by Bondi, who described the sit-down with Bowser on social media as \"productive.\"\n\"We agreed that there is nothing more important than keeping residents and tourists in Washington, D.C., safe from deadly crime,\" Bondi said on Tuesday. \"At President Trump’s direction, @TheJusticeDept will work closely with D.C. city government and [the] @DCPoliceDept to make Washington, D.C. safe again.\"\nTrump has long vowed to \"clean up\" D.C., a goal he has stressed since his first term in office.\nTrump in March signed an executive order, \"Making DC Safe and Beautiful Task Force,\" designed to address issues with a city he has long derided as \"filthy,\" \"horribly run\" and \"crime-ridden,\" among other things.\n\"We want to have a great, safe capital,\" he told reporters earlier this year. \"And we’re going to have it. And that includes cleanliness and it includes other things.\"\nBowser stressed at a press conference Monday that crime rates have fallen in the city, pointing to preliminary figures compiled by the D.C. Police Department and released earlier this year.\nSince then, \"We haven’t taken our foot off the gas,\" Bowser said Monday. She said D.C. is continuing its efforts to fight violent crime, even without the authorities of a full state.\n\"I can’t say that given some of the rhetoric of the past, that we’re totally surprised\" by the Trump administration's efforts, Bowser said during the press conference Monday. \"I can say to D.C. residents that we will continue to operate our government in a way that makes you proud.\"\nCLICK HERE TO GET THE FOX NEWS APP\nMeanwhile, the DC Police Union also said Monday that it supported the administration taking over the police force, but stressed they backed the move only so long as it is a \"temporary measure.\""
    },
    {
      "url": "https://www.foxnews.com/category/us/washington-dc",
      "text": "Washington DC 49 mins ago Trump's federal crime operation brings 100 arrests, 800 National Guard troops to Washington Trump's federal crime task force makes 45 arrests overnight in Washington, D.C., while protests emerge against National Guard deployment and police takeover.\nImmigration 54 mins ago DC police announce major action on immigration enforcement after Trump's crime crackdown DC police chief authorizes sharing information with immigration agencies during traffic stops but prohibits arrests based solely on federal immigration warrants.\nVIDEO 55 mins ago DC shop owners speak out on juvenile crime after massive robbery Sajib Uddula and Tamika Alston, the owners of a store that was robbed by juveniles, discusses Washington D.C.’s crime problem and more on ‘America Reports.’\nWashington DC 2 hours ago GOP Sen. Markwayne Mullin, former MMA fighter, skips seat belts in DC over carjacking fears GOP Sen. Markwayne Mullin of Oklahoma said he does not wear a seat belt while driving in Washington D.C. due to the possibility of being carjacked\nMedia 2 hours ago Schumer feels 'perfectly safe’ in DC, says Republicans are ‘full of it' on crime concerns Senate Minority Leader Chuck Schumer claimed Republicans were \"full of it\" regarding D.C. safety fears as President Trump deploys National Guard troops and takes control of police.\nVIDEO 3 hours ago Trump hints at potential new sanctions on Russia amid upcoming Putin summit President Donald Trump previews his summit with Russian President Vladimir Putin and discusses the crackdown on crime in Washington, D.C., on ‘The Brian Kilmeade Show.’\nNew Mexico 7 hours ago Democratic governor declares state of emergency in crime-ridden county New Mexico’s Democrat governor on Wednesday declared a state of emergency over rampant violence and drug trafficking in a large swath of her state.\nWashington DC 7 hours ago Schumer gives profanity-laced response to whether Dems will help extend DC police takeover Senate Minority Leader Chuck Schumer vowed Democrats will fight \"tooth and nail\" against President Donald Trump's request to extend federal control over D.C. police beyond 30 days.\nWashington DC 7 hours ago Blue cities in Trump’s crosshairs after DC police takeover Washington, D.C., recorded a homicide rate of 27.54 per 100,000 residents in 2024, ranking fourth among major U.S. cities despite overall violent crime dropping 35% from 2023.\nWashington DC 8 hours ago Police in DC get yelled at while setting up checkpoint along popular nightlife corridor Protesters confronted police officers at a checkpoint on 14th Street Northwest in Washington D.C., yelling 'get off our streets' following Trump's federal takeover.\nMedia 8 hours ago Washington, DC crime reporter turned victim speaks out, says Trump recognizes ‘major issue’ impacting lives Washington Examiner journalist Anna Giaritelli shares how a 2020 sexual assault in Washington, D.C., changed her life and career after her attacker was repeatedly released.\nMedia 9 hours ago Former Capitol Police Chief says crime by ‘gangs of youth’ in DC has spiked, escaped ‘certain neighborhoods’ Former Capitol Police Chief Steven Sund warned that the homicide rate in the nation's capital is five to six times higher than other major US cities.\nFox News Flash 9 hours ago Capitol Hill staffer stabbed in head, chest welcomes Trump's Washington, DC crime crackdown Capitol Hill staffer who survived random stabbing attack near the Capitol shares message of forgiveness and reacts to Trump's new crime crackdown in Washington, D.C.\nDonald Trump 9 hours ago WATCH: DC homeless weigh in on Trump cleaning up city streets As President Donald Trump cracks down on crime and rampant homelessness in Washington, D.C., homeless individuals weighed in on what they think of the administration’s efforts to clean up the streets.\nOpinion 10 hours ago MORNING GLORY: President Trump should go far and fast in reforming the DC police President Trump gains 30-day authority over the DC police force under Home Rule Act, with power to hire and fire department leadership amid public safety and crime concerns.\nImmigration 13 hours ago ICE says illegal migrant threatened to harm himself with butcher knife when stopped by officers in DC ICE said an illegal migrant was detained in Washington, D.C., after he was stopped by agents and subsequently motioned that he would harm himself with a butcher knife.\nMedia 15 hours ago AG Pam Bondi suggests Trump's crime crackdown in DC will help Latino residents U.S. Attorney General Pam Bondi says President Donald Trump's order to crack down on crime in Washington, D.C. is 'crystal clear,' as critics claim the capital's crime is down.\nNational Guard 19 hours ago 400 National Guard members descend upon DC; expanded crime crackdown expected Wednesday night A National Guard deployment reacheed 400 members in Washington as a federal operation began targeting crime and homelessness around the clock Wednesday.\nWashington DC 19 hours ago DOJ employee charged with felony after allegedly whacking federal agent with sandwich amid Trump DC crime crackdown Sean Charles Dunn was arrested and charged with felony assault after he allegedly screamed at federal agents in D.C. then whacked a CBP agent with a sandwich before running off.\nMedia 20 hours ago MSNBC’s Joe Scarborough admits ‘so many’ Democrats are secretly cheering Trump’s DC crime crackdown Joe Scarborough admitted Democrats secretly cheer Trump's decision to federalize D.C. police and deploy 800 National Guard troops to combat crime.\nWashington DC 21 hours ago Federal oversight in Washington – a special case as old as America itself From mutinies to modernity, the District of Columbia's unique constitutional status lets Congress – and now President Trump – exert rare control over the capital’s streets and future.\nPolitics 22 hours ago Republicans ready to support Trump's move to skirt Congress in DC crime crackdown President Donald Trump wants to extend his takeover of the Washington, D.C., police, and some congressional Republicans are backing him up.\nCrime 22 hours ago Woman gunned down in 'safe' DC neighborhood as Trump launches federal police takeover Fatal shooting happened in Washington D.C. after Trump federalized police force and deployed National Guard members alongside other federal law enforcement agencies.\nWashington DC 22 hours ago DC mayor reverses course on Trump intervention, downplays city crime D.C. mayor urges community action to protect city autonomy against Trump's authoritarian push and federal police takeover during livestreamed town hall meeting.\nCrime 22 hours ago DC violence has grown far more deadly, despite Dems claiming 30-year low The chances of a person facing a violent crime in Washington, D.C., has dropped in recent years, but the possibility of dying during such a crime has skyrocketed, data shows.\nMedia 23 hours ago Anti-Trump CNN commentator rips 'profoundly stupid' Democrats over DC crime response Anti-Trump CNN pundit S.E. Cupp criticized Democrats' response to President Trump's D.C. police federalization, saying their fact-based approach ignores voter feelings.\nVIDEO 23 hours ago John Yoo urges DC mayor to ‘look at the Constitution’ Former Deputy Assistant Attorney General John Yoo discusses President Donald Trump’s federal takeover of D.C. police and more on ‘The Story.’\nVIDEO 23 hours ago Trump is ‘making the right move’ by federalizing DC police, CEO argues Alexo Athletica CEO Amy Robbins and California Assemblywoman Alexandra Macedo, R-Calif., discuss President Donald Trump’s decision to federalize the D.C. police and more on ‘Fox News @ Night.’\nMedia 1 day ago MSNBC contributor voices alarm on DC crime, says issue is 'personal' and many are frustrated MSNBC contributor discussed D.C. crime frustrations after President Trump announced National Guard deployments in the nation's capital and a federal takeover of the local police.\nOpinion 1 day ago DAVID MARCUS: Trump understands that safety is for every citizen, not just the lucky few Trump announced his plans for a federal takeover of the Washington, D.C. police department on Monday following a spate of recent violent crimes in the capital."
    },
    {
      "url": "https://www.foxnews.com/opinion/i-support-trump-taking-control-dc-police-constitution-his-side",
      "text": "President Donald Trump announced Monday that his administration would take over the District of Columbia police and also deploy 800 national guard soldiers and new federal law enforcement units in the nation’s capital.\n\"This is Liberation Day in D.C., and we’re going to take our capital back,\" Trump said at a White House news conference flanked by Defense Secretary Pete Hegseth, Attorney General Pam Bondi and other senior administration officials. \"It’s going to be a model. And then we’ll look at other cities also. But other cities are studying what we’re doing,\" Trump said. \"We’re going to have a safe, beautiful capital, and it’s going to happen very quickly.\"\nDemocratic leaders responded with their usual eloquence. \"Violent crime in Washington, D.C. is at a thirty-year low. Donald Trump has no basis to take over the local police department. And zero credibility on the issue of law and order. Get lost,\" House Minority Leader Hakeem Jeffries, D-N.Y., posted on X.\nRepeating the same talking point as many other elected Democrats, Former House Speaker Nancy Pelosi, D-Calif., questioned Trump’s move by comparing it to his delay in calling out the National Guard to step the January 6, 2021, attack on the Capitol.\nUS ATTORNEY PIRRO SAYS ADMINISTRATION WON’T TOLERATE ‘OUT OF CONTROL’ CRIME IN THE NATION’S CAPITAL\nDespite Democratic complaints, few should question the need for greater public safety in our nation’s inner cities. But under our federal system, crime remains the purview of the states. \"The regulation and punishment of intrastate violence… has always been the province of the States,\" the Supreme Court observed in United States v. Morrison (2000). As the great Chief Justice John Marshall declared a century ago, Congress \"has no general right to punish murder committed within any of the States,\" and it is \"clear [that] congress cannot punish felonies generally.\"\nCriminal justice sits at the very core of the states’ police power – their general right to regulate the people and activity within their borders – aside from the specific, narrow areas (such as regulating interstate commerce) delegated by the Constitution to the federal government.\nAll laws in the District of Columbia are federal laws. If the mayor and city officials are allowing rising crime, especially because of lenient laws and policies toward offenders, the president should intervene.\nBut that is not the case with Washington, D.C. The Constitution specifically creates the District of Columbia as a city beyond the power of any state. As James Madison explained in Federalist No. 43, the \"seat of government\" must fall only under the power of the nation. Otherwise, he warned, \"the public authority might be insulted, and its proceedings interrupted with impunity,\" and the state where the capital resided \"might bring on the national councils an imputation of awe or influence, equally dishonourable to the government and dissatisfactory to the other [states].\" The Framers wanted the national government located in a city that would not be under any partisan control.\nTRUMP ACTIVATES NATIONAL GUARD TROOPS TO ADDRESS ‘TOTALLY OUT OF CONTROL’ CRIME IN WASHINGTON\nBut in 1973, Congress passed a Home Rule Act (with President Richard Nixon’s support) that created a mayor, a city council, and some limited rights to self-government.\nThis was a constitutional error.\nUnder the Constitution, there is no true local government in D.C.; the entire city is but a subdivision of the national government. Trump’s takeover of the D.C. police and his deployment of troops and federal law enforcement does not intrude on any rights of local government because, unlike the case with deployment of troops in Los Angeles earlier this year, there is no need to pay respect to a state’s sovereignty.\nThe president needs no state’s permission to deploy U.S. troops and federal law enforcement to protect federal property, facilities, and personnel.\nEven if D.C. home rule did not run contrary to the Framers’ design for the nation’s only federal city, Trump would still have authority to take Monday’s action. The president has an obligation to ensure public safety in D.C. Under Article II of the Constitution, the president has the duty to \"take Care that the Laws be faithfully executed.\"\nAll laws in the District of Columbia are federal laws. If the mayor and city officials are allowing rising crime, especially because of lenient laws and policies toward offenders, the president should intervene. He has the constitutional responsibility to restore common-sense law enforcement methods that will protect those who work and live in Washington.\nCLICK HERE FOR MORE FOX NEWS OPINION\nThe 1973 Home Rule Act itself, even if it is constitutional, recognizes the president’s authority. It allows him to take over the D.C. police for 30 days in the case of an emergency. The president could declare the high number of murders – the capital city has always had one of the nation’s highest murder rates, and currently sits at the fourth highest – an emergency. While murders in 2024 fell, they were coming down from a pandemic high; murders in D.C. are still far higher than the 2012 low. In any event, the Home Rule Act provision only applies to the D.C. police; the Act does not – and could not – limit the president’s authority to deploy troops or the FBI to protect the federal city.\nPresident Trump’s decision to restore law and order in the District of Columbia is only the first step. He can take the necessary second step by working with Congress to end home rule and restore the control of the elected branches of government over the District.\nJust as he has asserted his control over the bureaucracy by firing agency heads, he could test the constitutional waters by removing the mayor and other D.C. officials. They, too, are only assistants to the president who help him fulfill his responsibility to execute federal law; if they fail to perform, he can and should replace them.\nCLICK HERE TO GET THE FOX NEWS APP\nA half-century ago, Congress and the president gave in to the misguided idea that residents of D.C. had a democratic right to manage their own affairs. But the Framers did not want D.C. to fall under anyone’s partisan control, especially those who would use their control of the District to influence the federal government itself (recall the harassment of Trump officials that went unpunished during his first term).\nTrump and Congress should admit that home rule has failed and start making D.C. the great federal city it should be."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/category/us/immigration",
      "text": "Immigration: What to know about border security, US immigration policy and more\nImmigration in the United States has become a controversial topic in the political arena. There are several steps one must take to become a U.S. citizen, which are outlined on the U.S. Citizenship and Immigration Services website. These steps include preparing an application for naturalization, paying fees, completing an interview and taking the oath of allegiance to the United States.\nPresident Donald Trump and his administration prioritized securing the border and cracking down on the millions of undocumented immigrants already living in the country. U.S. Immigration and Customs Enforcement is the federal agency responsible for enforcing immigration laws. Since beginning his second term in the White House, Trump has worked to initiate the deportation of undocumented immigrants.\nThousands of people gathered in downtown Los Angeles for protest demonstrations over immigration. The scene turned from peaceful to violent as rising unrest prompted police to deploy tear gas. The Los Angeles immigration protests were among other nationwide protests against federal immigration raids conducted by ICE agents. California Gov. has continued to blame Trump for the escalating protests, claiming that they were peaceful demonstrations before the National Guard and Trump's rhetoric intensified the conflict.\n“Alligator Alcatraz,” the nation's newest detention facility for undocumented immigrants, is located in the Florida Everglades and surrounded by swampland teeming with alligators and pythons. Florida Gov. Ron DeSantis authorized the construction of the detention center on a 30-square-mile property in the swamplands of Miami-Dade County under an emergency order in June 2025. The property, a former airport, has been outfitted with sturdy tent structures to house 5,000 undocumented immigrants amid the Trump administration's deportation blitz to remove the millions of migrants who entered the country during the Biden administration."
    },
    {
      "url": "https://www.foxnews.com/us/radical-dc-officials-treated-officers-like-crap-police-leader-says-7-attacks-led-trump-takeover",
      "text": "President Donald Trump on Monday moved to federalize policing in the nation's capital, following years of unchecked violent crime in Washington, D.C.\nThe polarizing move has caused an uproar from opponents, and celebrations from supporters who want to see an end to violence in the city. The move comes after Washington has garnered national attention with a string of high-profile incidents in recent months and years that precipitated Trump's move.\nHowever, not everyone agrees with Trump's new plan.\nFox News contributor and former D.C. homicide detective Ted Williams is among those who oppose the federal intervention. \"While the president may mean well, this is going nowhere fast,\" he told Fox News Digital. \"D.C. is not a war zone. The lawsuits for constitutional violations are coming. This is overkill.\"\nHe also said criminals will just wait out the federalization, and return when National Guard troops are pulled from the streets.\n\"Jo Jo and his boys are going on vacation and will return after this crazy experiment ends.\"\nNational Fraternal Order of Police President Joe Gamaldi likes Trump's plan.\n\"Their average homicide rate has doubled in the last 10 years. They used to average less than 100 homicides. Now they average over 200,\" Gamaldi said, a claim which is backed up by the city's own data.\n\"And it's because you have a radical element on that city council that has defunded their police. They have embraced revolving door criminal justice policies. And frankly, they treated the hardworking men and women of law enforcement in that town like crap. So, of course, they need help. You have to do something, otherwise it's going to get out of control.\"\nBelow is a list of some of the most notorious crimes the city has seen.\n1. Ex-DOGE staffer beaten by teens in attempted carjacking\nIn the early morning hours of Aug. 3, an ex-Department of Government Efficiency (DOGE) staffer was beaten during an attempted carjacking in the city's Logan Circle neighborhood.\nEdward Coristine, known as \"Big Balls,\" was confronted by a group of teens while out with his significant other. Police said he pushed the woman into his vehicle to protect her and bore the brunt of the wrath of the criminals.\nTRUMP IS THREATENING TO 'FEDERALIZE' DC WITH NATIONAL GUARD AND MORE. HERE'S HOW THAT COULD PLAY OUT\nNearby patrol officers intervened, and the attackers escaped on foot, but not before Coristine was left bloodied.\nA 15-year-old male and a 15-year-old female have been arrested in connection with the crime. They face charges of unarmed carjacking.\n2. Congressional intern shot dead\nEric Tarpinian-Jachym, 21, was shot June 30 on the 1200 block of 7th Street, Northwest. He died a day later. He was a student at the University of Massachusetts - Amherst and was interning for Rep. Ron Estes, R-Kan.\nSeveral people exited a vehicle and began firing shots. The Metropolitan Police Department (MPD) said Tarpinian-Jachym was not the target of the shooting.\nA 16-year-old male and an adult female were shot, but both survived. The FBI is assisting MPD in the case's investigation. No suspects have been captured.\n3. Two Israeli Embassy staffers shot and killed\nOn May 21, two Israeli Embassy staffers were shot and killed while leaving an event at the Capital Jewish Museum.\nThe victims were Yaron Lischinsky, an Israeli, and Sarah Milgrim, an American.\nElias Rodriguez, 31, of Chicago was captured immediately. He has been charged not only with the murders, but with federal hate crimes. He allegedly shouted \"Free, free Palestine!\" while in custody.\nTRUMP TO HOLD NEWS CONFERENCE ON DC CRIME AFTER FEDERAL AGENTS HIT STREETS\n4. Roving teen mob wreaks havoc in Navy Yard neighborhood\nOn the night of May 17, a mob of about 100 teenagers terrorized the Navy Yard neighborhood a block from Nationals Park.\nIt was the second such teen takeover in less than a month.\nAt about 8 p.m., police began receiving calls about disorderly conduct, but the situation quickly turned violent. One group of teens beat two bystanders, punching them, knocking them to the ground and then stomping on them, according to WUSA9.\nA similar fight broke out later. Fox News Digital obtained video of the incident:\n5. Senior congressional staffer carjacked, robbed in Navy Yard\nOn May 9, a staffer from California Democratic Rep. Sara Jacobs' office was the victim of an armed carjacking in the Navy Yard neighborhood.\nThe staffer, who remained unnamed, was robbed of a government-issued iPhone, MacBook, ID and Capitol parking pass.\nThe next day, the car was recovered, and a 15-year-old juvenile male of Washington was charged with armed carjacking, and a 14-year-old juvenile male of Maryland was charged with carrying a pistol without a license and unauthorized use of a vehicle.\n6. House Democrat carjacked at gunpoint in Navy Yard\nIn late 2023, Rep. Henry Cuellar, D-Texas, was carjacked by armed, masked men outside an apartment building that is a popular residence for members of congress, also in the Navy Yard neighborhood.\nAt the time, Cuellar said he made the conscious decision not to fight back for his own safety.\nHe condemned the crime, calling the criminals \"punks with guns,\" and touched on soft-on-crime policies, noting that if criminals are put in jail, \"you've got to lock them up and keep them there.\"\n7. House Democrat assaulted in apartment elevator\nIn February 2023, Rep. Angie Craig, D-Minn., was attacked in the elevator of her apartment in the nation's capital.\nPolice identified 26-year-old Kendrick Hamlin as the suspect. Craig said Hamlin punched her in the chin and grabbed her by the neck.\nCraig said she fended him off with the hot cup of coffee she was carrying.\nTRUMP ACTIVATES NATIONAL GUARD TROOPS TO ADDRESS ‘TOTALLY OUT OF CONTROL’ CRIME IN WASHINGTON\nOther recent violent crimes include the 2023 beating death of a homeless man with a metal pipe near the Ellipse in Washington's downtown, and a Metropolitan Area Transit Authority police officer who was stabbed in the face near the D.C. Navy Yard subway station.\nCLICK HERE TO GET THE FOX NEWS APP\nFox News' Stephen Sorace, Adam Sabes, David Spunt, Charles Creitz, Landon Mion and Sarah Rumpf-Whitten contributed to this report."
    }
  ],
  "argos_summary": "Washington, D.C. Police Chief Pamela Smith has issued an executive order allowing limited cooperation with federal immigration authorities, following President Trump's federal takeover of the police department to address rising crime and homelessness. The order permits Metropolitan Police officers to share information during traffic stops but prohibits them from inquiring about immigration status or making arrests based solely on federal immigration warrants. This move has sparked mixed reactions, with supporters praising efforts to enhance public safety, while opponents argue it undermines local governance and civil rights.",
  "argos_id": "JJDW5SCJC"
}