{
  "url": "https://finance.yahoo.com/news/why-everyone-talking-lyft-190500232.html?_guc_consent_skip=1755199819",
  "authorsByline": "Lawrence Nga, The Motley Fool",
  "articleId": "4f34392867c5409b80a6b7b7ce48947f",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/YAuVOqtsa42Vp7eCNbyK.g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/motleyfool.com/968613879738e88ca99e2bcc0c31116b",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:05:00+00:00",
  "addDate": "2025-08-14T19:32:09.339142+00:00",
  "refreshDate": "2025-08-14T19:32:09.339145+00:00",
  "score": 1.0,
  "title": "Why Is Everyone Talking About Lyft?",
  "description": "Lyft's turnaround story is gaining momentum.",
  "content": "• Lyft operates with a narrower focus strategy compared to its larger peer, Uber.\n• Thanks to cost-cutting measures and increased efficiency, Lyft is now on track to achieve sustainable profitability.\n• Lyft has multiple levers to drive business growth in the years to come.\n• 10 stocks we like better than Lyft › Lyft (NASDAQ: LYFT) has spent much of its public life as the smaller player in ride-hailing -- overshadowed by Uber, questioned about its path to profitability, and often dismissed by investors seeking a safer bet. Fast-forward to 2025, and the narrative is shifting. Lyft just delivered one of its strongest quarters ever, with record bookings, positive generally accepted accounting principles (GAAP) earnings, and almost a billion dollars in trailing free cash flow. The underdog is starting to punch above its weight -- and investors are paying more attention. Lyft runs a two-sided marketplace that connects riders and drivers through its app. It earns the bulk of its revenue by taking a commission on each ride. Other sources include: The company's asset-light model means it doesn't own vehicles, which keeps capital needs low. However, it also means constant competition for riders and drivers -- and the pressure to keep prices competitive without eroding margins. Compared to its larger peer, Uber, Lyft has a narrower focus, both in the type of services offered (mainly mobility) and the regions it covers (the U.S., Canada, and, lately, Europe). This differentiated strategy means that Lyft may not have the scale that Uber has, but its focus and specialization provide some edge against its peers. For instance, Lyft can direct resources toward refining ride-hailing economics -- like lowering driver incentives, optimizing pricing algorithms, and reducing wait times -- without cross-subsidizing other segments. Additionally, in North America, Lyft is synonymous with ride-hailing, making marketing more straightforward. There's no confusion about whether you're booking a car, ordering dinner, or shipping a package. So, despite having a smaller market share than Uber in the U.S., Lyft demonstrates that its focus strategy is the right one, both operationally and financially (more on this in the next section). If you followed Lyft's IPO years ago, you know the most significant criticism: The company could grow, but it couldn't make money. That's changing fast.\n\nHere are some highlights from the second quarter of 2025:\n• Adjusted earnings before interest, taxes, depreciation, and amortization (EBITDA): $129.4 million, a 26% increase, with a 2.9% margin.\n• Free cash flow: $329.4 million for the quarter; nearly $1 billion over the last 12 months. The ride-hailing company is growing, profitable, and generating a substantial cash flow. Beyond these financial metrics, one operational metric tells the story best: incentive cost per ride fell from $1.82 in Q2 2023 to $1.03 this quarter. That means Lyft is spending less to keep both riders and drivers engaged -- and those savings are reflected directly in the bottom line. Lyft's successful transition into a profitable business model matters in today's higher-interest-rate environment, which differs from the earlier years, when capital was cheap. With its solid cash flow, it can now fund its future growth using internal funds, rather than relying on debt or equity markets, which provides more flexibility and stability when making long-term strategic investments. After years of operating under a growth-at-all-costs model, Lyft is now on a more sustainable growth trajectory, making measured investments to achieve profitable growth. One potential area of growth will be its expansion into the European market through the acquisition of Freenow, which will give Lyft access to 180 cities across Europe and significantly expand its addressable market. It's still early days, but if this acquisition delivers the intended benefits, it can set the stage as a springboard for Lyft's global expansion in the years to come. While entering new markets looks exciting, finding better ways to grow customer wallet share and improve monetization in existing markets can be equally profitable. To this end, Lyft can increase the number of rides per month for existing users, expand its advertising business, and establish new partnerships to attract high-value customers. And let's not forget the opportunity in autonomous vehicles, via partnerships with companies like Baidu and Benteler Mobility, among others. These partnerships enable Lyft to capitalize on the potential growth of robotaxis without incurring the significant investment required to develop its infrastructure. What does it mean for investors? Lyft is still the smaller player in a fiercely competitive industry. However, by sharpening its focus, improving operational efficiency, and transforming the business into a cash generator, it has transitioned from survival mode to sustainable growth mode. It won't overtake Uber anytime soon (and probably won't in the foreseeable future). The good news is that it doesn't have to be that way. By owning its niche, expanding selectively, and keeping a tight grip on costs, Lyft can deliver solid returns for patient investors who believe in its disciplined approach. Investors seeking an alternative to Uber in the ride-hailing industry should keep this underdog on their radar. Do the experts think Lyft is a buy right now? The Motley Fool’s expert analyst team, drawing on years of investing experience and deep analysis of thousands of stocks, leverages our proprietary Moneyball AI investing database to uncover top opportunities. They’ve just revealed their 10 best stocks to buy now — did Lyft make the list? When our Stock Advisor analyst team has a stock recommendation, it can pay to listen. After all, Stock Advisor’s total average return is up 1,062% vs. just 185% for the S&P — that is beating the market by 877.34%!* Imagine if you were a Stock Advisor member when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $649,544!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,113,059!* The 10 stocks that made the cut could produce monster returns in the coming years. Don't miss out on the latest top 10 list, available when you join Stock Advisor. Lawrence Nga has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Uber Technologies. The Motley Fool recommends Lyft. The Motley Fool has a disclosure policy. Why Is Everyone Talking About Lyft? was originally published by The Motley Fool",
  "medium": "Article",
  "links": [
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=9d6f8386-d1d6-4b8b-8cfb-6b5f7f45745a&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000053%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_yahoo%26ftm_pit%3D17670",
    "https://www.fool.com/author/20315/",
    "https://www.fool.com/legal/fool-disclosure-policy/",
    "https://www.fool.com/investing/stock-market/basics/revenue-vs-profit/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=38bc05a0-941e-4234-9535-a61ae643973b",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=384d52c3-5109-4576-a8ce-cbbfc0d9a3b2&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001139%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D18007%26ftm_veh%3Darticle_pitch_feed_yahoo%26company%3DLyft&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=38bc05a0-941e-4234-9535-a61ae643973b",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=384d52c3-5109-4576-a8ce-cbbfc0d9a3b2&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001139%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_yahoo%26ftm_pit%3D18007&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=38bc05a0-941e-4234-9535-a61ae643973b",
    "https://www.fool.com/investing/2025/08/14/why-is-everyone-talking-about-lyft/",
    "https://www.fool.com/terms/g/generally-accepted-accounting-principles/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=38bc05a0-941e-4234-9535-a61ae643973b"
  ],
  "labels": [
    {
      "name": "Opinion"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Lyft",
      "weight": 0.08829947
    },
    {
      "name": "business growth",
      "weight": 0.06282762
    },
    {
      "name": "profitable growth",
      "weight": 0.05990015
    },
    {
      "name": "ride",
      "weight": 0.056517035
    },
    {
      "name": "rides",
      "weight": 0.056517035
    },
    {
      "name": "sustainable growth mode",
      "weight": 0.05618842
    },
    {
      "name": "existing markets",
      "weight": 0.05464549
    },
    {
      "name": "new markets",
      "weight": 0.054609627
    },
    {
      "name": "Free cash flow",
      "weight": 0.05208248
    },
    {
      "name": "trailing free cash flow",
      "weight": 0.051676128
    }
  ],
  "topics": [
    {
      "name": "Ridesharing"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.99609375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.947265625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.94189453125
    }
  ],
  "sentiment": {
    "positive": 0.50070614,
    "negative": 0.12198645,
    "neutral": 0.37730742
  },
  "summary": "LyLyon (NASDAQ: LYFT) has been a smaller player in ride-hailing, often overshadowed by Uber and dismissed by investors seeking a safer bet. The company, which operates with a narrower focus strategy compared to its larger peer, Uber, has delivered one of its strongest Q2 results ever, with record bookings, positive GAAP earnings, and almost a billion dollars in trailing free cash flow. Despite having a smaller market share than Uber, Lyft's focus and specialization provide an edge against its peers due to its specialization in services offered in the U.S., Canada, and Europe. Despite this, the company's growth trajectory is on a sustainable growth trajectory, with its acquisition of Freenow, which will give Lyft access to 180 cities across Europe and significantly expand its addressable market. Additionally, Lyft can expand its business into partnerships with companies like Baidu and Benteler to develop its infrastructure without incurring significant investment. The ride-sharing platform is becoming more transparent and less costly than Uber. Despite its transition into a profitable business model, Lyft has transitioned from survival mode to sustainable growth mode, it is still a competitive industry.",
  "shortSummary": "Lyndon's profitability is rapidly increasing due to cost-cutting and efficiency, with multiple levers to drive growth and profitability, despite limited market share and investment opportunities.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "50217277b9484d7abf6ff46c421051a6",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/investing/2025/08/14/why-is-everyone-talking-about-lyft/",
      "text": "Lyft (LYFT 0.24%) has spent much of its public life as the smaller player in ride-hailing -- overshadowed by Uber, questioned about its path to profitability, and often dismissed by investors seeking a safer bet.\nFast-forward to 2025, and the narrative is shifting. Lyft just delivered one of its strongest quarters ever, with record bookings, positive generally accepted accounting principles (GAAP) earnings, and almost a billion dollars in trailing free cash flow. The underdog is starting to punch above its weight -- and investors are paying more attention.\nHow Lyft makes money\nLyft runs a two-sided marketplace that connects riders and drivers through its app. It earns the bulk of its revenue by taking a commission on each ride. Other sources include:\n- Micromobility: scooters and bikes in select cities.\n- Partnerships: deals with airlines, credit card issuers, and delivery companies.\n- Advertising: sponsored listings, in-app promos, and brand partnerships.\nThe company's asset-light model means it doesn't own vehicles, which keeps capital needs low. However, it also means constant competition for riders and drivers -- and the pressure to keep prices competitive without eroding margins.\nCompared to its larger peer, Uber, Lyft has a narrower focus, both in the type of services offered (mainly mobility) and the regions it covers (the U.S., Canada, and, lately, Europe). This differentiated strategy means that Lyft may not have the scale that Uber has, but its focus and specialization provide some edge against its peers.\nFor instance, Lyft can direct resources toward refining ride-hailing economics -- like lowering driver incentives, optimizing pricing algorithms, and reducing wait times -- without cross-subsidizing other segments. Additionally, in North America, Lyft is synonymous with ride-hailing, making marketing more straightforward. There's no confusion about whether you're booking a car, ordering dinner, or shipping a package.\nSo, despite having a smaller market share than Uber in the U.S., Lyft demonstrates that its focus strategy is the right one, both operationally and financially (more on this in the next section).\nFrom cash burner to cash generator\nIf you followed Lyft's IPO years ago, you know the most significant criticism: The company could grow, but it couldn't make money. That's changing fast.\nHere are some highlights from the second quarter of 2025:\n- Gross bookings: $4.5 billion, up 12% year over year.\n- Revenue: $1.6 billion, up 11% year over year.\n- Net income: $40.3 million, up from $5 million a year ago.\n- Adjusted earnings before interest, taxes, depreciation, and amortization (EBITDA): $129.4 million, a 26% increase, with a 2.9% margin.\n- Free cash flow: $329.4 million for the quarter; nearly $1 billion over the last 12 months.\nThe ride-hailing company is growing, profitable, and generating a substantial cash flow. Beyond these financial metrics, one operational metric tells the story best: incentive cost per ride fell from $1.82 in Q2 2023 to $1.03 this quarter. That means Lyft is spending less to keep both riders and drivers engaged -- and those savings are reflected directly in the bottom line.\nLyft's successful transition into a profitable business model matters in today's higher-interest-rate environment, which differs from the earlier years, when capital was cheap. With its solid cash flow, it can now fund its future growth using internal funds, rather than relying on debt or equity markets, which provides more flexibility and stability when making long-term strategic investments.\nThe road ahead for Lyft\nAfter years of operating under a growth-at-all-costs model, Lyft is now on a more sustainable growth trajectory, making measured investments to achieve profitable growth.\nOne potential area of growth will be its expansion into the European market through the acquisition of Freenow, which will give Lyft access to 180 cities across Europe and significantly expand its addressable market. It's still early days, but if this acquisition delivers the intended benefits, it can set the stage as a springboard for Lyft's global expansion in the years to come.\nWhile entering new markets looks exciting, finding better ways to grow customer wallet share and improve monetization in existing markets can be equally profitable. To this end, Lyft can increase the number of rides per month for existing users, expand its advertising business, and establish new partnerships to attract high-value customers.\nAnd let's not forget the opportunity in autonomous vehicles, via partnerships with companies like Baidu and Benteler Mobility, among others. These partnerships enable Lyft to capitalize on the potential growth of robotaxis without incurring the significant investment required to develop its infrastructure.\nWhat does it mean for investors?\nLyft is still the smaller player in a fiercely competitive industry. However, by sharpening its focus, improving operational efficiency, and transforming the business into a cash generator, it has transitioned from survival mode to sustainable growth mode.\nIt won't overtake Uber anytime soon (and probably won't in the foreseeable future). The good news is that it doesn't have to be that way. By owning its niche, expanding selectively, and keeping a tight grip on costs, Lyft can deliver solid returns for patient investors who believe in its disciplined approach.\nInvestors seeking an alternative to Uber in the ride-hailing industry should keep this underdog on their radar."
    },
    {
      "url": "https://www.fool.com/legal/fool-disclosure-policy/",
      "text": "Here at The Motley Fool, when it comes to matters of money, we believe in transparency and accountability. Day in and day out, we dedicate ourselves to delivering responsible investing ideas and sound financial education. That's why, when it comes to talking about stocks, we think it's important that you know exactly where we're coming from. With this in mind, we have developed a company-wide disclosure policy to guide our business and communications. We call it Fool Disclosure. We invite you to take some time to read through it, and hope it helps inform your experience here in Fooldom.\nInvestors Communicating With Investors\nThe Motley Fool is a company that represents investors teaching and learning from other investors. Many financial publications do not permit their writers and editors to own stocks. The Motley Fool not only permits, but also encourages its staff to invest in common stock. Why? Two reasons.\nFirst, we strongly believe the most effective way to create wealth is through the long-term ownership of stocks. The stock market has compounded 10% average annual returns over the last century. We believe in using the stock market as a savings bank, and we strongly encourage treating money management as a lifelong endeavor. Therefore, we think it'd be downright mean of us to close that avenue of investment to our employees.\nSecond, and more important, we don't consider our employees to be journalists, but rather communicators and teachers of financial matters. It's a subtle but critical difference that affects our entire service -- from our online site at Fool.com, to our investment books, to our nationally syndicated newspaper column, to our newsletters and portfolio services. As a company, we utilize every available medium to teach people of all ages, all income levels, all backgrounds, and all genetic codes about money and its applications in modern life. Therefore, we believe our staff's involvement in managing their own money is critical to their learning more about the subject and their succeeding in their own lives. And who better to write about investing than those who do it themselves?\nThe Motley Fool writes about stocks in both free and paid content. We make stock recommendations in our various premium newsletter services and actually hold some of these shares in our portfolio services. We will disclose our recommendation or ownership until we cease to recommend the stock, or we sell our entire position. Of course, in both free and paid content we will continue to disclose whether the author has an interest in the stocks mentioned.\nInternally, the Fool has always strived to operate with the highest levels of integrity and transparency. As such, here are the key components of The Motley Fool's disclosure policy:\nDisclosure\n- When a writer writes about a stock that he or she has a position or beneficial interest in, that fact is disclosed at the end of the article.\n- If The Motley Fool recommends or holds a position in a stock, that fact is also disclosed at the end of the article.\n- All Fool employees and contractors -- that's anyone with a TMF prefix on their screen names -- are required to disclose their current positions, including stocks, mutual funds, and cryptocurrencies. We aggregate and display these positions for the entire company here. (We do not disclose the individual stocks that might be in a Fool's mutual funds.)\n- Affiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no knowledge of any affiliates' holdings and/or specific recommendations, and the affiliates' personnel have no knowledge of any editorial content before it is published. Our affiliate companies may also have their own disclosure policies, which they may make available on their respective sites.\nTrading Restrictions\nIn addition to the above disclosure requirements, Fool employees work under additional trading restrictions and guidelines. These restrictions require that they:\n- Must hold any stock they own for at least 10 days. (No day trading allowed -- as if we'd want to!)\n- Cannot write about a stock in the period of 2 market days before to 2 market days after purchasing or selling the stock.\n- Must clear trades with our compliance department prior to any transaction.\n- Must notify our compliance department every time they buy or sell a stock, regardless of whether they have written about it.\nInvestors in The Motley Fool\nThe Motley Fool is grateful to the people that have invested in us. The Fool's founders and some family members have invested in the company, and full-time employees receive stock options and/or stock in the company.\nBusiness and Technology Partners\nWe have business relationships with an ever-changing assortment of companies, including technology vendors, leasing companies, data providers, banks, distribution channels, advertisers, landlords, accountants, and the restaurants up the street from Fool HQ. Many of these companies are public companies operating in industries that we follow. There may be instances in which one of our newsletters recommends a company with whom we have a business relationship, or we may write an article about such a company on Fool.com. These occurrences are unintentional and coincidental, as the business end of The Motley Fool has no input or influence on the editorial side of things.\nIt would take too much space to list all the companies that we do business with, and we'd probably forget some anyway, but below are some of our major partners. (This list is most subject to change. We'll update it periodically, but we will not be able to keep pace with the rate of change.)\nInvesting Advertisers\nAs a general rule, if you see ads from a company on our site and emails, that company is paying us for such placement. Some of the major ones include E*Trade, Fidelity, Scottrade, OptionsHouse, and ShareBuilder. Additionally, companies pay us for inclusion in specific areas of our site (e.g., Registration Page, Broker Center).\nMotley Fool Money\nA portion of our site, branded as Motley Fool Money, writes reviews of personal finance products, including credit cards, mortgage offers, and brokerage accounts. We may receive compensation for offers that appear on Motley Fool Money, including compensation related to placement.\nWe may issue recommendations for preferred partners that we believe in and/or use ourselves. But keep in mind, this site may not include all available offers from our partners. For example, there are thousands of credit cards available. We’ll highlight a fraction of them. All picks are made at the editorial discretion of Motley Fool Money editorial team.\nFor a list of major advertisers on Motley Fool Money, click here.\nDistribution Partners\nSome of our major distribution partners include Yahoo! Finance, MSN Money, USA Today, AOL, Nasdaq, and CNN Money.\nNews, Quotes, Data, and Content Providers\nOur major providers include Xignite SIX Financial.\nMajor Service Providers or Other Partners\nSilicon Valley Bank, Slack, Namely, Charles Schwab, Interactive Brokers, Worldpay/Vantiv, and Jones Lang LaSalle.\nIn Conclusion\nWe have designed our disclosure and trading guidelines to serve our community, our customers, and our employees fairly. As always, though, you should remember to consider every piece of investment information you receive, here at the Fool or elsewhere, not as a de facto recommendation, but as an idea for further consideration. Even the strongest disclosure policy in the world does not excuse individuals from taking responsibility for their own decisions. Due diligence, critical thought, and use of the most extraordinary device in the world (the human brain) are crucial to your financial success.\nLast updated November 11th, 2024."
    },
    {
      "url": "https://www.fool.com/terms/g/generally-accepted-accounting-principles/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=38bc05a0-941e-4234-9535-a61ae643973b",
      "text": "Generally accepted accounting principles, or GAAP, is a set of accounting standards followed by most U.S. businesses, nonprofit organizations, and state and local governments. GAAP is industry shorthand used to denote the standardized guidelines that specify how and what companies report to the public.\nInterested parties, such as investors, lenders, and potential donors, expect companies to adhere to GAAP reporting standards so that they can understand an organization's financial performance and compare it to others. Let's take a closer look at these generally accepted principles and who uses them.\nWho uses GAAP?\nWho uses GAAP?\nPublicly traded companies adhere to GAAP because it is required by the Securities and Exchange Commission (SEC). That means GAAP is particularly useful for investors because it requires each company to measure and report its financial performance in the same way. Directly comparing companies and different reporting periods for the same company are integral to making investment decisions.\nBy contrast, most private companies keep track of their financial performances only for tax purposes. GAAP principles have less importance if the company doesn't plan to offer an initial public offering (IPO). Companies often report both GAAP and non-GAAP (adjusted) results.\nIPO\nWhat are the generally accepted accounting principles?\nWhat are the generally accepted accounting principles?\nAuditors and internal accountants are required to follow these 10 generally accepted accounting principles:\n1. Regularity\nCompanies must follow all specific rules and regulations with regularity. The accounting principles work together, so any deviation from reporting requirements on one part of a company's financial statement could cause other parts to be incorrect.\n2. Consistency\nThe same accounting standards should be consistently applied to the entire accounting process. And a company must verify that these standards have been carried out throughout the company.\n3. Sincerity\nAccurate and impartial accounting is imperative. Despite being paid by the companies they are auditing, accountants must prepare truthful and sincere financial statements.\n4. Permanence of method\nDifferent but equally valid accounting methods are sometimes available. Companies should use the same methods across reporting periods as much as possible. Establishing a permanent accounting method facilitates accurate comparison.\n5. Noncompensation\nThe value of a company's liabilities should not be compensated for by the value of the company's assets. A company's assets may exceed its debt, but its financial statements should report its asset and liabilities separately.\n6. Prudence\nAccountants should be prudent and conservative when deciding which accounting methods to use. A prudent approach ensures a company's financial performance is not overstated.\n7. Continuity\nAccounting should be conducted based on the assumption that a company will continue to operate indefinitely. If an accountant is required to make any assumptions, those assumptions should be based on historical precedents set by the business.\n8. Periodicity\nFinancial data should be reported at regular intervals to allow for easy comparison among reporting periods and companies.\n9. Materiality\nAll material financial data and information should be disclosed. Anything that affects a company's financial standing is generally considered material, meaning companies must provide full financial disclosure.\n10. Utmost good faith\nAccountants and business managers should act in good faith by honestly recording transactions and collecting financial data.\nFour additional GAAP principles\nFour additional GAAP principles\nIn addition to these 10 primary principles, companies are expected to adhere to four additional principles to guarantee the integrity and consistency of their financial statements:\n- Recognition: Financial statements should accurately recognize all of a company's assets, liabilities, revenue, and expenses.\n- Measurement: Financial statements should measure and present financial results in accordance with GAAP specifications.\n- Presentation: For its financial statements, a company should present an income statement, balance sheet, and cash flow statement.\n- Disclosure: In the spirit of full disclosure, financial statements should include any necessary notes to fully explain the financial information provided.\nRevenue\nRules and regulations for GAAP\nRules and regulations for GAAP\nThe Financial Accounts Standards Board (FASB), a nonprofit organization given regulatory authority by the SEC in the 1970s, establishes specific rules and standards in accordance with GAAP. These are the basics of GAAP rules:\n- Accrual accounting: GAAP accounting is accrual accounting. The accrual accounting method records revenue when a service is provided or a good is sold, not when cash is exchanged. Direct expenses, such as cost of goods sold, are accounted for when the sale of the product or service occurs. Indirect expenses, such as rent and marketing, are accounted for when the expense is paid.\n- Depreciation and capital expenditures: The costs of large asset purchases are accounted for over the life of the asset. If a business buys a piece of equipment expected to last 10 years, the business will expense 10% of the cost of the equipment each year for 10 years.\n- Historical cost: Most assets, like a company's property, facilities, and equipment, are reported on the company's balance sheet at their original costs, not their current market values.\n- Bad debts: Companies with significant accounts receivable -- money owed to them by customers -- must account for the likelihood that some of that money will never be received.\nAccountants devote their entire careers to understanding and applying the specific rules that the FASB establishes in accordance with GAAP. Knowing at least the basics of GAAP can help investors better understand and compare the companies in their portfolios."
    },
    {
      "url": "https://www.fool.com/investing/stock-market/basics/revenue-vs-profit/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=38bc05a0-941e-4234-9535-a61ae643973b",
      "text": "Revenue and profit are two of the most important numbers to focus on for business owners and stock investors alike. Revenue is the total amount of money the company has earned in a given period; profit is what's left after expenses have been deducted.\nFor some companies, markups and efficiency are so high that there isn't much of a difference between revenue and profit. For other, more capital-intensive businesses, a net profit of 2% or 3% is a good year.\nLet's drill down into the key differences between the two numbers and then walk through an example.\nKey differences between revenue and profit\nKey differences between revenue and profit\nThe key difference is that revenue has not had any expenses deducted from it. Profit (and there are different kinds of profit) is revenue minus expenses. It can even be a negative number if the company lost money.\nRevenue and the various types of profit are reported on the income statement (also known as the profit and loss statement). The statement starts with revenue on the top line and then goes through the types of expenses before ending with net income, or the bottom line.\nLet's go over the different types of profit, starting at the top.\n- Gross profit: The first type of profit is gross profit. Gross profit is equal to revenue minus cost of goods sold. The costs of goods sold vary by industry but follow the same general concept -- they are the direct costs tied to sales. For a company such as Target (TGT -1.02%), the cost of goods sold would include the cost of inventory and labor hours in stores. A company's gross margin gives you a good idea of how much it can mark up its goods or services from the prices it's paying to suppliers.\n- Operating profit: The next one down the line is operating profit. Think of operating profit as gross profit minus overhead. Most other types of expenses that are key to operations -- such as rent, administrative salaries, and insurance -- are classified as operating expenses. Operating profit shows you how much money the core business is earning.\n- Net profit: Net profit is what's left over after all other expenses are deducted. This includes taxes, interest expenses, and one-time items such as legal settlements. These expenses can vary greatly from year to year. The other expenses also aren't tied to business core operations, so they don't fit into the cost of goods sold or operating expenses categories. Net profit (and the earnings-per-share version, or EPS) is the number most followed by the stock market. Understanding that net profit may be volatile even when gross and operating profit are consistent can give you leg up on other investors.\nOnce you get the hang of evaluating financial statements, the differences in these numbers will be second nature. As a beginner, the most important thing to keep in mind is that revenue is the top line number that shows how much money the company has earned during the period. Profit is what's left over after the different types of expenses are covered.\nRevenue vs. profit example\nRevenue vs. profit example\nLet's look at two companies with very different cost structures, starting with Target:\n| Oct. 31, 2021 (numbers in millions) | Dollar Amounts | Percentage |\n|---|---|---|\n| Revenue | $25,652 | 100% |\n| Cost of Goods Sold | $18,206 | 71% |\n| Gross Profit | $7,446 | 29% |\n| Operating Expenses | $5,436 | 21% |\n| Operating Income | $2,010 | 8% |\n| Other Expenses | $522 | 2% |\n| Net Income | $1,488 | 6% |\nTarget produced $25.7 billion of revenue in the third quarter of 2021. On average, $0.71 of every dollar went to cost of goods sold. That means, on average, the stuff you bought from Target costs them about 71% of what you paid, leading to a gross profit of $7.5 billion, or 29%.\nOperating Expenses\nNext, $5.4 billion, or 21% of revenue, went to operating expenses. For retailers like Target, it's normal for overhead to cost a lot less than the direct cost of goods sold.\nFinally, taxes and other expenses amounted to $522 million, bringing Target's net profit, the bottom line, to $1.5 billion, or 6% of revenue.\nNow let's look at DocuSign (DOCU -2.43%):\n| Dec. 31, 2021 (numbers in thousands) | Dollar Amounts | Percentage |\n|---|---|---|\n| Revenue | $545,463 | 100% |\n| Cost of Goods Sold | $115,975 | 21% |\n| Gross Profit | $429,488 | 79% |\n| Operating Expenses | $432,846 | 80% |\n| Operating Income | ($3,358) | -1% |\n| Other Expenses | $2,318 | 0% |\n| Net Income | ($5,676) | -1% |\nDocuSign isn't quite as big as Target; its quarterly sales came to $545 million. About 21% went to cost of goods sold, producing a $430 million gross profit, which was 79% of revenue.\nThe gross profit margin seems great until you see the operating expenses number, which was about $3 million more than gross profit. The expenses mean the company had an operating loss in the quarter equal to around 1% of revenue. Add in the other expenses, and the net loss was $5.7 million.\nDocuSign's business model is completely different than Target's, and it shows in the income statement. DocuSign sells subscriptions to its valuable software services. Target buys products from other businesses, marks them up about 30%, and sells them in brick-and-mortar stores.\nRelated investing topics\nBecause of this business model difference, the cost structure is also completely different. Most of Target's expenses are in cost of goods sold because it has to pay for the inventory it sells. DocuSign's cost of goods sold is a lot lower as a percentage of revenue because it doesn't have many direct costs related to each sale.\nOperating expenses are the opposite. Target pays for the overhead it needs to keep going, while DocuSign is investing in overhead. It paid $400 million in this quarter alone on research and development and sales costs. It is plowing all its gross profit into future growth, and the operating loss reflects that."
    }
  ],
  "argos_summary": "Lyft is shifting its narrative as it reports one of its strongest quarters in 2025, achieving record bookings and nearly a billion dollars in trailing free cash flow. The company has implemented cost-cutting measures and improved operational efficiency, leading to sustainable profitability and a focus on growth through strategic investments, including a European expansion via the acquisition of Freenow. Despite being smaller than Uber, Lyft's specialized approach and successful transition to a cash-generating model position it as a viable alternative for investors in the competitive ride-hailing industry.",
  "argos_id": "JRQHYH5S9"
}