{
  "url": "https://www.forbes.com/sites/forbes-personal-shopper/article/hiking-shoes-vs-hiking-boots/",
  "authorsByline": "Steven John",
  "articleId": "478f1db395864fc297f6f729e9b18096",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/689e314f563ea64bc828c5b1/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T18:20:04-04:00",
  "addDate": "2025-08-14T22:34:51.215432+00:00",
  "refreshDate": "2025-08-14T22:34:51.215434+00:00",
  "score": 1.0,
  "title": "Hiking Shoes Vs. Hiking Boots: A Guide To Finding The Right Trail Footwear",
  "description": "In this guide, we break down the key differences between hiking shoes and boots based on factors like weight, breathability and cushioning. Here's what you need to know.",
  "content": "Whether you’re a casual hiker, a seasoned backpacker, a thru-hiker chasing the triple crown or a world traveler, you’ve likely faced a classic footwear dilemma: hiking shoes vs. hiking boots. It’s a debate as old as the trails you walk on, and while both styles have their distinct advantages, the right one depends on your terrain choices, pack weight and personal preferences. This guide breaks down the key differences between hiking shoes and hiking boots, and although we won’t crown a clear winner—spoiler alert—we will help you understand how each option serves different needs.\n\nBy the time we reach the end, you’ll be equipped with the information you need to choose footwear based on your hiking style, comfort preferences and protection requirements. Focusing on key factors like weight, breathability and cushioning, here’s everything you need to know about hiking shoes vs. hiking boots before investing in a pair (or two) of your very own.\n\nBoth hiking shoes and hiking boots are designed to keep your feet comfortable, supported and safe as you navigate the trail. Here’s a brief overview of each style to help you understand how they perform.\n\nHiking shoes feature tough uppers and toe caps to protect your feet, with cushy midsoles and rugged outsoles that provide all-day support and traction. Sporting a lower cut than hiking boots, they’re lighter and more flexible to promote quick, nimble movement. Technically, they aren’t as nimble as trail running shoes, but they offer comfort and protection for hikes over varied terrain, all while supporting more weight as you carry essentials on your back.\n\nHiking boots feature high collars to improve protection and support, which comes in handy when you’re hiking with heavy loads or navigating more technical terrain. They usually feature tougher uppers made from leather or synthetic material, along with reinforced toe caps and waterproof membranes to keep moisture out. Sporting a thick midsole that may incorporate a shank and deep outsole lugs for grip, they absorb heavy impacts and help keep you upright, which reduces fatigue over longer distances.\n\nTo demonstrate the difference in weight between hiking shoes and hiking boots, I conducted an impromptu survey by weighing popular models across both styles.\n\nMy unsystematic findings revealed that the average pair of boots weighs around 2.5 pounds, or 1.25 pounds per boot. That might sound heavy, and compared to the weight of your typical running shoe, it most certainly is, but the added weight translates to better ankle support, underfoot cushioning, stability and overall protection.\n\nOf course, the added support and stability that hiking boots offer isn’t always necessary. My improvised weigh-in found that the average pair of hiking shoes weighs about 1.6 pounds, or half a pound per shoe. That’s almost one pound less than a pair of hiking boots, and when you’re looking to travel faster and lighter, it’s a reduction in weight you may well notice.\n\nUltimately, if conditions are less than extreme and you’re not stuffing a lot of weight in your pack, hiking shoes are usually the better pick. But if you need more protection or intend to carry more weight over long distances, boots will offer more long-term support.\n\nHiking shoes feature a below-the-ankle collar that exposes more of your leg and generally offers better breathability than boots. But the difference in breathability isn’t just about footwear style—it’s about the materials a brand uses and design choices.\n\nLeather uppers and waterproof membranes, for example, offer more durability and protection against moisture, but these same materials tend to trap heat and limit airflow. On the other hand, synthetic mesh and non-membrane constructions allow for better ventilation, so your feet stay cooler and drier, but they sacrifice some durability.\n\nBoth hiking shoes and hiking boots can feature any of these materials, which is why breathability isn’t really determined by the type of footwear. Instead, it comes down to the balance between protection versus airflow, so you’ll want to choose a combination of materials based on your needs.\n\nHiking boots typically feature thicker, firmer cushioning to help support more weight over longer distances, while hiking shoes tend to use lighter, more flexible cushioning for agility and speed. Still, the sheer volume of cushioning isn’t the only consideration you should make.\n\nAs was the case with breathability, it all comes down to how you intend to use your footwear. A lightweight hiking shoe might feel like walking on a cloud when you’re navigating a short, mellow trail, but a boot’s more sturdy cushioning might be a better option on a multi-day hike when you’re carrying lots of weight. Cushioning is largely a matter of preference and how far you intend to hike.\n\nHiking Shoes Vs. Hiking Boots: Which Is Right For You?\n\nWhen it comes to hiking shoes vs. hiking boots, there’s no right answer—the “right” pair of footwear is based on your preferences and what you’re likely to encounter on the trail.\n\nTo make the decision process easy, ask yourself a question: What kind of terrain and load am I expecting on my hike?\n\nIf you’re sticking to groomed trails, moving fast and carrying less weight, hiking shoes are a nimble, breathable, comfortable choice that will serve you well. If you’re carrying a heavy pack through more technical terrain, hiking boots will offer better ankle support, durability and protection.\n\nThere may not be a right answer—plenty of experienced thru-hikers prefer to walk in trail running shoes, after all—but there is an answer that meets your unique needs. And if you find that your adventures call for hiking shoes and boots, consider investing in one of each to cover all your bases Consider what you’ll encounter on your adventures and how much you intend to pack, and you’ll have an easier time deciding between these two styles.\n\nThe writers and editors on the Forbes Vetted gear team have been testing and reviewing outdoor gear and apparel for years. We’ve covered everything from men’s running shoes to compression socks to workout shoes, all in the name of helping you make more informed purchases.\n• This guide was written by Forbes Vetted staff writer Steven John, an avid hiker and trail runner for nearly two decades. He has worn dozens of pairs of hiking shoes, boots and trail running shoes over the years, and applied his hands-on experience and in-depth research to this comparison guide.\n• This article was reviewed by Forbes Vetted gear editor Cam Vigliotta. He has over a decade of experience hiking and backpacking in everything from hiking sandals to shoes to boots. In fact, he began hiking in boots for years before discovering the lightweight, nimble, grippy benefits of trail running shoes, which he now spends most of his time in outdoors.",
  "medium": "Article",
  "links": [
    "https://www.forbes.com/sites/forbes-personal-shopper/article/best-running-shoe-for-men/",
    "https://www.forbes.com/sites/forbes-personal-shopper/article/the-best-workout-shoes-for-men/",
    "https://www.forbes.com/sites/forbes-personal-shopper/article/best-hoka-shoe-for-walking/",
    "https://www.forbes.com/sites/forbes-personal-shopper/article/best-compression-socks-for-running/",
    "https://www.forbes.com/sites/forbes-personal-shopper/article/best-hiking-sandals/",
    "https://www.forbes.com/sites/forbes-personal-shopper/people/KaraCuzzone/",
    "https://www.forbes.com/sites/forbes-personal-shopper/2025/08/13/hoka-bondi-9-review/",
    "https://www.forbes.com/vetted/",
    "https://www.forbes.com/sites/forbes-personal-shopper/people/cam-vigliotta/",
    "https://www.forbes.com/sites/forbes-personal-shopper/people/stevenjohn/"
  ],
  "labels": [
    {
      "name": "Paid News"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Hiking Boots",
      "weight": 0.1183808
    },
    {
      "name": "Hiking boots",
      "weight": 0.1183808
    },
    {
      "name": "hiking boots",
      "weight": 0.1183808
    },
    {
      "name": "Hiking Shoes",
      "weight": 0.11547067
    },
    {
      "name": "Hiking shoes",
      "weight": 0.11547067
    },
    {
      "name": "hiking shoes",
      "weight": 0.11547067
    },
    {
      "name": "trail running shoes",
      "weight": 0.093425736
    },
    {
      "name": "hiking sandals",
      "weight": 0.09152691
    },
    {
      "name": "boot",
      "weight": 0.08231467
    },
    {
      "name": "boots",
      "weight": 0.08231467
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.7734375
    }
  ],
  "sentiment": {
    "positive": 0.28317532,
    "negative": 0.15263115,
    "neutral": 0.5641935
  },
  "summary": "The article discusses the difference in weight, breathability and cushioning between hiking shoes and hiking boots. This guide explains how each option serves different needs and how to choose footwear based on your hiking style, comfort preferences, and protection requirements. The article also notes that hiking shoes feature tough uppers and toe caps to protect your feet, with cushy midsoles and rugged outsoles that provide support and traction. While hiking boots feature high collars to improve protection and support, these shoes offer more long-term support. The difference in breathability is also about the materials used and design choices. If conditions are less extreme, hiking shoes are usually the better pick, but if you need more protection or intend to carry more weight over long distances, boots offer longer support.",
  "shortSummary": "Hiking shoes vs. hiking boots offer distinct but related benefits, depending on your hiking style, weight, breathability, and protection needs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "00699bf54718431cb7f5319bc491fd19",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.forbes.com/sites/forbes-personal-shopper/article/the-best-workout-shoes-for-men/",
      "text": "Gym shoes aren’t just comfortable and durable—they help you move better, train harder and recover faster. I took a closer look at some of the best-selling athletic shoes and surveyed Forbes Vetted staffers to round up an assortment of the best workout shoes for men that meet different needs in and out the gym. The most versatile shoe of the bunch is the Reebok Nano 2.0, which I like for its stability and spacious toe box. It’s an ideal option for weightlifting, HIIT workouts and cross-training alike.\nThere was a time not long ago when you did just about everything in a single pair of shoes—running, biking, lifting and so on. But as we’ve learned more about movement and performance over the years, our footwear has evolved to meet the needs of different activities. That’s why I evaluated the following workout shoes based on what they’re designed to do, how they fit and the kind of support they offer. Below, the best workout and gym shoes for men, and what you need to know to find a solid pair.\nReebok launched the Nano in 2011 when it became the official footwear brand of CrossFit, and a year later, the Nano 2.0 hit shelves, quickly becoming a staple in the cross-training community. With a 4mm drop, its low-profile design feels stable, and the wide toe box gives your forefoot room to splay with each step, improving balance and control. Despite being over a decade old, Reebok continues to refine the design, keeping it as lightweight (around 10 ounces per shoe), breathable and grippy as its newer cross-training counterparts. It’s a true do-it-all shoe, built for a wide range of workouts.\nWith that said, the Nano 2.0 doesn’t offer much in the way of cushioning, which can make repetitive jumps and long runs feel jarring—that’s the tradeoff for its stability and sheer versatility. If you’re after a cross trainer with more cushioning, the Nike Metcon or NoBull Impact might be a better fit. But if you need a tough, reliable shoe to power through varied workouts, the Nano 2.0 is more than up to the task.\nYou can think of the Metcon as Nike’s answer to the Reebok Nano and NoBull Impact. Released in 2015, it’s a well-rounded, versatile cross trainer designed to power you through just about any workout. Like the Nano, it has a slight 4mm drop, and a strip of sticky fabric extends from the base to the top of the shoe, adding durability for rope climbs. Underfoot, dual-density foam boosts support and responsiveness, while the grippy rubber outsole keeps you steady on different surfaces.\nThe main drawback is that the Metcon 10 is on the heavier side, and you’ll feel that extra weight during box jumps or jump roping. The upper also isn’t the most breathable, though it won’t leave your feet overheating during a tough workout. And because it’s lighter than its predecessor, the Metcon 9, you’re ultimately shedding a few ounces, which never hurts. Whether you’re new to CrossFit or a HIIT veteran, the Metcon 10 is a shoe that’s built to perform.\nThe Nike Pegasus Trail 5 is a bread-and-butter trail shoe, much like the Brooks Ghost 17 is for the road—reliable, versatile and a great fit for most runners. Built on the wildly popular Pegasus platform, it delivers the same dependable feel that’s won over countless road runners, but with a few trail-ready tweaks. Nike gives it a slightly more aggressive tread pattern that wraps around the toe for added durability, making it better suited for dirt and gravel, and ReactX foam makes it more responsive for those quick movements on the trail.\nIt’s also surprisingly plush, which some runners might find a little too soft and unsteady for technical terrain—it mutes ground feel, making the trail experience a bit less precise. And while the outsole is fine for dry or mostly dry trails, I can’t help but wish for better traction via a Vibram outsole, like on Nike’s trail racer, the Ultrafly. Still, if you’re new to trail running or already love the Pegasus on the road, this is an easy shoe to reach for.\nBest Gym Shoes For Men\nA Workout Shoe Fit For CrossFit, Weightlifting And More\nTake a quick scan around your local gym, and you’ll likely see NoBull Impact cross-trainers at least once. This pair is very popular among athletes for good reason: Designed to be equal parts supportive and cushioned, they’re a do-it-all workhorse in the gym. Similar to the Reebok Nano 2.0, they feature a 4mm heel drop to provide a secure, grounded feel for recreational weightlifting. They also have a grippy sole to tackle quick, multidirectional movements, rope climbing and a variety of CrossFit exercises.\nBut the NoBull Impact design sets itself apart from the Nano 2.0 with its added cushioning. The thick midsole excels at shock absorption, making it a more comfortable choice for jumping, walking and short sprints. In other words, they can help take the sting out of high-intensity movements, like box jumps and burpees. That said, avid long-distance runners are better off with a shoe that has a plusher and more responsive feel, as well as improved breathability to limit foot sweats, like the Brooks Ghost 16 or Nike Pegasus Trail 5.\nThe Brooks Ghost 17 is about as straightforward as running shoes get, in the best possible way. With balanced support, a touch of extra cushioning to take the edge off long runs and a breathable upper to keep your feet cool, it’s an easy-to-wear option for most runners. And, with four widths to choose from, it accommodates just about any foot shape.\nWith that in mind, the Ghost 17 isn’t the most aggressive running shoe out there, so if you’re looking for a pair to help you through tempo runs, I suggest something a bit more responsive, like the Hoka Mach 6. And as someone with slightly wide feet, I’d prefer a roomier toe box for added comfort, but it does fit true to size. If you’re looking for a versatile, comfort-first trainer that checks all the basic boxes, the Ghost 17 is a solid place to start. Read my review of the Ghost 17 for more insights.\nNot suitable for daily use (less durable than other shoes)\nThe Hoka Rocket X 3 is built for one thing: speed. If you’re chasing a PR or trying to hit a qualifying time, this is the race shoe to have on your feet. It’s shockingly lightweight—a full pair weighs about one pound—yet it doesn’t skimp on performance. The winged carbon plate provides just the right amount of stiffness to keep your stride snappy and efficient. Meanwhile, dual-density PEBA foam, stacked in two layers, offers plush yet responsive cushioning to keep your legs feeling fresh deep into a race.\nOf course, like most high-performance race shoes, all this technology doesn’t come cheap, and the foam won’t maintain its spring forever—it’s built for speed over longevity, and typically gives its best results until about the 250-mile mark. But if you’re looking for a dedicated race-day shoe that gives you every possible advantage, from a lightweight feel to energy-returning propulsion, this one delivers.\nBest Lifting Shoes For Men\nA Stable Platform That's Comfortable And Supportive\nThe Rogue Do-Win Weightlifting Shoes are a solid choice if your training revolves around squats, presses and Olympic lifts. With a 19mm (o.75-inch) heel, they provide an aggressive drop that encourages a deeper, more upright squat position, which is exactly what you want when chasing big numbers. The hard plastic heel is the preferred height for Olympic weightlifting, offering the stability and support needed to move heavy loads with confidence.\nThe leather upper isn’t as breathable as a typical athletic shoe, but you’re not logging miles in these anyway, so it’s not a big deal. Plus, with two foot straps on each shoe, you get a locked-in fit that reduces any chance of slipping when you’re under load. If you’re willing to spend a little more, you could go for another tried-and-true option like the Adidas Powerlift 5, but if you’re new to lifting or just looking for a wallet-friendly, no-nonsense lifting shoe, the Do-Win is a great addition to your gym bag.\nWhether or not you buy into the idea of recovery footwear, there’s no denying the comfort of slipping into a pair of soft, open-toed sandals after a tough run—and Hoka’s Ora Recovery Slide 3 delivers to hush your barking dogs. Built with a thick foam midsole for maximum cushioning, it feels like walking on a cloud, and airflow channels help keep your feet cool and comfortable (which I imagine also feels like walking on a cloud).\nThere’s not much to this slide, but that’s exactly the point—it’s simple, plush and designed for pure relaxation. Some reviewers mention it runs a bit large, so if you’re new to Hoka, you might want to size down. But if you already wear the brand, your usual size should be just right.\nForbes Vetted’s gear section includes several footwear guides, from work boots to running shoes to hiking sandals. Our approach encourages staffers with different backgrounds and abilities to share their footwear feedback, so we evaluate every shoe from a different perspective before sharing our recommendations with you.\nAuthor of this guide and Forbes Vetted gear editor Cam Vigliotta has over six years of experience testing outdoor, health and wellness equipment. With a degree in kinesiology, he’s spent time with an assortment of athletes over the years who rely on athletic footwear . And when he’s not evaluating workout shoes, he wears a few select pairs to run, hike, ski, bike and travel.\nThis guide was reviewed by Forbes Vetted editorial director Brinda Ayer, who’s a seasoned runner and fitness advocate, and has over a decade of experience in lifestyle journalism.\nBecause fitness and health go hand in hand, we sought advice from Dr. Chloe Costigan, PT, of Mobility-Doc, for additional insights into the qualities of a top tier gym shoe.\nWe routinely revisit this guide to make sure our advice is accurate and up to date. In August 2025, it was updated by Vigliotta, who replaced the Nike Metcon 9 with the Metcon 10, the Brooks Ghost 16 with the Ghost 17, and named the Hoka Rocket X 3 the best racing shoe for men.\nHow We Chose The Best Workout Shoes For Men\nWe took a closer look at what goes into comfortable, durable workout shoes for men, keeping a few key factors in mind:\nA reliable workout shoe should feel good from the moment you put it on. We looked for options with responsive cushioning, supportive midsoles and a secure fit that won’t cause discomfort. Breathable materials were also prioritized to keep feet cool and dry.\nWorkout shoes take a beating, especially if you use them every day, so we focused on well-made options that feature tough yet flexible materials. Reinforced uppers, grippy outsoles and quality stitching also earned high marks.\nWhether you’re lifting, sprinting or tackling a high-intensity interval workout, you need a shoe that keeps you upright. We picked models with grippy rubber soles, lateral support and solid heels to help prevent slipping or wobbling, and provide confidence with each step.\nWorkout shoes aren’t all built for the same purpose. We made sure to include an assortment of running shoes, cross trainers, lifting shoes and even recovery footwear, so there’s a solid option for every discipline.\nWhat To Consider When Shopping For Workout Shoes\nWhen it comes to finding a pair of workout shoes, you’ll want to look beyond the brands you know and the online hype that launches styles into stardom. Here’s how to break it down:\nActivity Preferences\nThe first step to finding the best workout shoe for you is to evaluate your preferences and consider a shoe that pairs well with your preferred workout style. Of course, not all workout shoes are created equal: Running shoes prioritize cushioning and propulsion, while cross trainers offer lateral support for side-to-side movement. They’ll also be made from slightly different materials and fit a bit differently on your feet.\nFit And Construction\nSpeaking of fit, your shoes should feel good out of the box, and they should offer enough cushioning and support to maintain comfort through any workout. According to Dr. Costigan, you’ll want to look for styles that deliver a snug feel (though it shouldn’t be too tight), breathable materials and the right arch support for your foot.\nBe sure to consider how different materials support different activities. Road and trail running shoes rely on breathable uppers and supportive midsoles; cross-training shoes offer lateral support and stability; and lifting shoes feature an elevated heel that lets you fold at the knees and hips while putting less strain on your ankles.\nWorkout shoes take a beating, so you want something made from high-quality materials that can withstand frequent use and abuse. Reinforced stitching, strong uppers and a tough rubber outsole all make for a longer-lasting shoe.\nStability And Support\nNo matter the activity, a stable shoe helps prevent injuries. Whether you’re using the shoes to lift weights or get through some high-intensity interval training, you’ll want to feel steady on your feet. For cross trainers or weightlifting, find shoes with features like a firm heel counter, lateral support and a grippy outsole that provides the balance and traction you need for dynamic movements. For road running, look at shoes with ample midsole cushioning to absorb impact; and for trail runners, you’ll want something with decent cushion and good grip so you’re not sliding around on dirt and rocks.\nYou won’t always know if a shoe is right for you the first time you wear it—it sometimes takes a little trial and error to find a comfortable, supportive shoe. And as Dr. Costigan points out, it’s not just about how your feet feel. The wrong pair can cause discomfort in your knees and lower back too. If something feels off, it’s a sign to try something different. But when you do find the perfect pair, grab an extra set to rotate them and keep things feeling fresh.\nWe swapped the Nike Metcon 9 with the newer Metcon 10, the Brooks Ghost 16 with the Ghost 17, and added the Hoka Rocket X 3 as the best racing shoe for men.\nWe named the NoBull Impact the best gym shoe for men and adding FAQs on choosing the right workout shoe for you."
    },
    {
      "url": "https://www.forbes.com/sites/forbes-personal-shopper/article/best-running-shoe-for-men/",
      "text": "Running is one of the easiest and most effective ways to stay in shape. All it takes is some basic gear, motivation and a place to run, whether that’s a city sidewalk, local track or treadmill. But if you want to run in comfort and stay injury-free, the right pair of running shoes is essential. That’s why we spoke with experts and drew on our experiences as long-time runners to find the best running shoes for men. Based on our findings, the Asics Gel Kayano 31 will meet the needs of most runners, and the Saucony Guide 18 is great for longer distances.\nWe consulted shoe experts, physical therapists, podiatrists and runners of all abilities when creating this guide. As a result, you’ll find a range of options to suit almost any runner, whether you’re into trails, long distances or casual laps around the neighborhood. Below, you’ll find the best running shoes for men, and tips to help you find a comfortable pair that meets your needs.\nThey say a jack of all trades is a master of none, but the Gel Kayano 31 from Asics makes that hard to apply universally. “This shoe falls into the high cushion support category and is a wonderful solution for those needing an extra level of support and guidance without sacrificing a high level of cushion,” says Victor Ornelas,senior director of vendor management at Fleet Feet. “You get the best of both worlds.” Essentially, this shoe holds your foot exactly where it should be, with your heel locked in place, arches supported and toes free to spread out with each step. And at the same time, it features gel-like cushioning for added comfort.\nWith many running shoes, you usually have to choose between a soft shoe that absorbs impact and a supportive one that promotes proper alignment, but the Gel Kayano 31 strikes a balance between both. And because it’s available in a range of colors, sizes and widths, there’s likely a pair for you that fits perfectly. Whether you have a neutral stride or tend to supinate (when your foot rolls outward as you step), the design provides optimal support. And although it’s on the pricey side, all that cushioning, a soft sock liner and excellent grip makes it worth the investment.\nIf you’re going to be logging lots of miles in your running shoes, the Saucony Guide 18 is a savvy choice to consider. It has a six-millimeter heel-to-toe drop, which allows for a natural foot position and lasting comfort even on long outings, and features plenty of midsole foam to absorb repetitive heel strikes. The shoe is made with what Saucony calls “Center Path Technology,” which is essentially a wide, supportive underfoot platform with raised sidewalls that help keep your foot planted in the center of the shoe rather than rolling to one side or the other; this is a welcome feature for long runs, and one that will reduce soreness and the chance of injury.\nThe toe box of the Guide 18 is on the narrower side, and that can be a critical issue for runners whose toes naturally splay wide with each step. Assuming they fit properly, this is an ultra comfortable shoe thanks to a snug but not constraining mesh upper that breathes well and helps keep your foot secure, so the midsole and outsole can tackle longer distances.\nThe Hoka Arahi 7 was designed with stability in mind, and when we talk about running shoe \"stability,\" we’re referring to a shoe’s ability to minimize excessive inward rolling (also known as overpronation) as it makes contact with the ground. This is achieved through features like additional support on the inner side of the shoe, a firm heel and a wider platform, all of which you’ll find in the Arahi 7. You’ll also find enhanced midsole support that’s compression molded to cradle arches and further stabilize your feet.\nSome people find the stability features of this shoe a bit too rigid and bemoan its lack of cushy feel, but if your feet tend to roll, it’s a wise move to give up some cushioning in the name of proper—and therefore safer—foot positioning. Again, it’s not the most cushioned shoe ever, but it provides an energetic response to each step that propels you forward, and a soft yet durable flat-knit upper keeps your feet well-positioned.\nYou’ll find features on the Saucony Peregrine 15 that you’d expect to find on any good trail running shoe, like sturdy lugs and an aggressive tread pattern that grabs onto rocks, roots and loose dirt with ease. You’ll also find a tough plate under the midsole that helps protect against rocks and pokey things. And you’ll get a sufficiently well-cushioned insole that reduces the jarring foot strikes that come with downhill segments.\nWhat makes this trail running shoe stand out is the reinforced mesh upper that’s at once breathable and flexible but also tough enough to protect your foot from scrapes and pokes along the trail. And there’s a D-ring feature for easy gaiter compatibility which adds even more protection for your foot, ankle and lower leg. The four-millimeter offset is ideal for people who tend to land with on their midfoot, though it’s a bit small for people who land heel-first, so it’s a good idea to have a sense of your (trail) running style before you commit to this shoe.\nOrnelas calls the Nike Vaporfly 4 “one of the original disruptors in the super shoe racing space.\" While the shoe’s carbon fiber plate (which Nike calls the “Flyplate”) delivers serious propulsion, it adds negligible weight: These road running shoes weigh a scant 13.4 ounces. And yes, that’s for the pair—each shoe alone weighs barely more than six ounces. Despite that minimal weight, there is plenty of foam underfoot to absorb the impacts of fast feet on hard surfaces, so you can wear these shoes for a marathon or tempo training.\nThe elephant in the room is the price, which isn’t light, but the Vaporfly 4 is a “level up” type of shoe for serious road running. The mesh upper is flexible and breathes well, while a size-reduced tongue shaves off just a bit more weight to make the design as light as can be. The six-millimeter drop is ideal for people whose heels hit the road first, as is a little bulge in the midsole padding at the heel.\nIf you have wide feet, as in 4E wide, then the Glycerin 22 from Brooks belongs on your foot. You can also get this shoe in a 2E wide, a medium width (1D), and it’s available in a wide range of sizes. The shoe has a more pronounced 10-millimeter drop that can take some getting used to, but once you do, you’ll love the amount of cushioning you get from the large nitrogen-infused foam at the heel and the launch-like effect from the smaller, denser foam under the toe box.\nI’ve worn Brooks running shoes for more miles than I can count both on roads and treadmills, and I can tell you they really are comfortable and supportive, though the outsoles do wear down rather fast with lots of road running, and that can lead to improper foot alignment. If you struggle to find good running shoes for your extra wide feet, however, it’s worth giving these a try and replacing them with a new pair as needed.\nI wear my Mount To Coast R1 running shoes to the gym at least two days a week, and while there I log at least three miles on a treadmill and complete myriad weight training and circuit training exercises. And on an average of three other days per week, I wear my R1s on outdoor runs as well— they are truly that versatile, comfortable and durable. Each shoe weighs just a hair over eight ounces, yet they have plenty of cushioning and support thanks to a nitrogen-“charged” PEBA foam midsole that’s way lighter than EVA foam.\nThe R1s feature a midsole design that keeps the shoe in secure contact with your foot all the way through each step, from toe to heel, so you maintain control through every stride and decrease energy loss as you run. And a clever two-part lacing system allows you to tie traditional laces near the top of your foot, while a cinching toggle handles the lower portion of your foot for quick adjustments as your feet swell. To learn more about the Mount To Coast R1, read the full review that breaks down this distance shoe.\nIf your foot lands naturally without overpronating, the Gel-Cumulus 27 from Asics will serve you well as a neutral training shoe. In the world of running, \"neutral\" refers to a shoe designed for runners with a normal or balanced foot pronation, meaning their feet don’t excessively roll inward or outward. Neutral running shoes, like the Gel-Cumulus 27, prioritize cushioning and comfort, providing support without correcting foot movement.\nThis style a great choice for the person who uses running as a way to train for other sports, as opposed to the diehard runner who needs shoes with some degree of specialization. Some verified buyers report this shoe being a bit too stiff, but Victor Ornelas describes it as \"a moderate cushion everyday trainer with a smooth and quiet heel-to-toe transition,” which should work for most casual runners.\nThe Forbes Vetted gear team recommends apparel and equipment only after we’ve done our homework. We interview qualified experts, perform exhaustive research, comb through reviews and spend as much time using products as we can to ensure our advice is sound.\nThis guide to men’s running shoes was written by Steven John, a Forbes Vetted gear and tech staff writer. He has worked as a journalist for more than 13 years and has been a regular runner for much longer than that, logging thousands of miles in myriad running shoe brands, including many featured here.\nThis guide was reviewed by Forbes Vetted gear editor Cam Vigliotta, who has over six years of experience testing and evaluating gear. He dedicates time each week to training, and as a road and trail runner, he’s competed in races ranging from 5Ks to 50Ks.\nWhile researching shoes for this guide, we spoke with multiple experts to learn more about running shoes, foot health and general physical health. These include: Victor Ornelas, senior director of vendor management at Fleet Feet; Dr. Stephen Hill, associate professor at the College of Podiatric Medicine at Samuel Merritt University; Dr. Milica McDowell, PT, certified exercise physiologist and VP of operations at Gait Happens; Dillon Sullivan, a buyer with Sun & Ski Sports; and Troy Hurst, PT, DPT with Flow Feet Orthopedic Shoes.\nWe update this guide as new versions of these running shoes become available—or as we find better recommendations for each category. This guide was first published in May 2025.\nHow We Chose The Best Running Shoes For Men\nWe look beyond our own experiences with running shoes to create a more holistic picture with well-researched recommendations. The following steps helped us dive into men’s running shoes from every angle:\nWe spoke to podiatrists, physical therapists, footwear experts and runners to help develop the categories in this guide. In doing so, we’ve created an assortment of options that meet the needs of different runners.\nWe studied the construction of running shoes, from outsoles to midsoles to uppers to lacing systems and beyond, noting the best materials and design elements. We also looked at variables like sizing options, shoe weight, arch support, heel-to-toe offset (drop) and more.\nOnce we established our running shoe categories and firmly understood the many elements of a comfortable, reliable running shoe, we relied on expert recommendations, first-hand experience and scores of customer reviews and ratings to lock in our picks for the best men’s running shoes.\nWhat To Look For In The Best Running Shoes For Men\n“Before you start to look at brands and models, start with the basics,” says Dillon Sullivan. Here are all the factors you need to consider as you look for a pair of running shoes.\nOutsole\nRoad running shoe outsoles typically feature a smooth, shallow and flexible tread pattern designed for optimal traction on hard surfaces like pavement, sidewalks and treadmills. These treads are generally uniform and of modest depth, and road running shoe outsoles are often relatively flexible.\nTrail running shoe outsoles, on the other hand, usually feature a tread pattern with deep, individually set lugs (small rubber projections) designed to enhance traction on various types of terrain, from uneven ground to loose materials to wet surfaces. The size, shape and spacing of these lugs will vary by shoe, and different designs offer different levels of grip. Trail runners often feature a much stiffer outsole than road shoes for added protection and durability.\nMidsole\n“The midsole is where the cushioning technology lives, and this is a key area of differentiation between shoes,” says Hurst. “Materials like EVA foam, TPU or PEBA offer varying degrees of softness, responsiveness (energy return) and durability.” Running shoe cushion levels range from “maximalist,” which you might describe as walking on a cloud, to more moderate or minimal cushioning for those who prefer ground feel. For shorter, faster running, less midsole cushioning is usually advised.\nDrop\nDrop refers to the change in height from the heel of the shoe to the toe. A larger drop, such as 10 millimeters, will encourage your foot to make contact with the ground at the heel, which transfers more of the impact to your knees and hips. A shorter drop encourages a midsole strike or even a toe landing, which keeps more of the impact in your foot and ankles. A smaller drop is generally the better choice for faster running, though a bigger drop may be necessary if you’re trying to protect your lower body from injury.\nUpper\n\"The upper, which wraps around your foot, should be made of breathable materials, often an engineered mesh or knit, to allow for airflow and prevent irritation,\" says Hurst. He adds that some uppers offer more structure, while others provide a sock-like and highly flexible feel. Personal preference plays a large role in selecting an upper, but mesh uppers are generally lighter and more breathable than knit or synthetic leather materials, which makes them a good option for hot weather or high-intensity runs.\nToe Box\n“Toes are meant to be splayed—or spread—out wide when we are walking or running,” says McDowell. “The more compressed your toes are, touching or even smushed together, the less you can use numerous key muscles in your foot to help propel yourself forward.” Make sure you find running shoes that allow for at least a finger’s width of space in front of your toes and in which your toes can separate as they would if you were running barefoot.\nFrequently Asked Questions (FAQs)\nAlso called “offset,” this is the height difference a running shoe creates between the heel and toes. “People who predominantly heel strike during running or people with a tight Achilles tendon tend to prefer 10 to 12 millimeter drop,” says Dr. Hill, while those who land on their midfoot or forefoot will do better with less of an offset, which can also allow for a more natural (or barefoot style) running gait.\nRunning shoes generally last between 300 and 500 miles, or roughly four to six months of regular wear for a runner who runs 20 miles per week. This can vary greatly, of course, depending on factors like run frequency, speed and intensity, terrain, pronation or supination and the environment in which you run.\nModern running shoes don’t require a break-in period because they use flexible fabrics and reactive foams. “There should be no ‘break-in’ period or adjustment,\" says Victor Ornelas. “The shoe should feel like an extension of your body and allow you to experience the activity at hand.\""
    },
    {
      "url": "https://www.forbes.com/sites/forbes-personal-shopper/people/KaraCuzzone/",
      "text": "As the supervising deals and coupons editor for Forbes Vetted, I’m constantly monitoring the best sales and promo codes across the internet. I'm also responsible for Vetted's content strategy during tentpole events like Amazon Prime Day and Cyber Week.\nI’ve been writing and editing commerce content for the past seven years, and I have five years of experience covering major sale events. I’ve been a member of the Forbes Vetted team for over four years. My work has also appeared in Cosmopolitan, Byrdie, PureWow and Wondermind.\nHoka Bondi 9 Review: My Honest Thoughts On Hoka’s Most Cushioned Design\nForbes Vetted editor Kara Cuzzone has been testing the Hoka Bondi 9 for the past seven months. Here is her unfiltered Hoka Bondi 9 review on the design, cushion and more.\nThere’s A Huge Owala Sale Happening This Week\nIn honor of back-to-school season, you can save 20% on Owala water bottles this week. Here are all the details.\nThe Best Prime Day Hoka Deals Aren’t On Amazon: 12 Hidden Sales We Found\nAmazon isn't the only place to find major sales this week. We found the best Prime Day Hoka deals at retailers like Zappos and REI.\nDyson Airwrap Sale: Score $100 Off The Multi-Styler This Prime Day\nDyson Airwrap sales are few and far between, but during Prime Day you can save $100 on the coveted multi-styling hair tool. Here are all the details.\nThe Bissell Little Green Machine Is Marked Down To $82 For Prime Day\nScore the Bissell Little Green Machine for its lowest price of the year this Prime Day.\nDyson Hair Dryer Sale: The Supersonic Origin Is $80 Off For Prime Day\nThis Amazon Prime Day, shop the Dyson Supersonic Origin at the lowest price we've seen from the retailer. Here are all the details.\nThere’s A Secret SkinCeuticals Sale Happening Right Now\nDermstore is hosting a rare SkinCeuticals sale this week. Here's how to save 15% on the brand's most popular products.\nThe 6 Best Shoes For Plantar Fasciitis, Based On Testing And Expert Insight\nWe researched shoes from popular brands like Hoka and Oofos to find the best shoes for plantar fasciitis. Here are the six pairs we recommend.\nStaud Tommy Bags Are On Sale For $177 Right Now—Get One Before They Sell Out\nOur supervising deals and coupons editor found Staud Tommy bags on sale for an all-time-low price. Here are all the details.\nSephora’s Spring Sale Ends Tonight—Shop These 37 Editor-Approved Deals Before They’re Gone\nSephora's spring sale ends tonight. We've gathered 37 editor-approved items to add to your cart while you still can."
    },
    {
      "url": "https://www.forbes.com/sites/forbes-personal-shopper/2025/08/13/hoka-bondi-9-review/",
      "text": "I’ve logged hundreds of miles in my 15 years as a runner, completing one full marathon and seven half marathons along the way. In other words, I’m sharing my Hoka Bondi 9 review because I know a thing or two about what makes a good running sneaker. Hoka makes some of my favorite designs (I ran the NYC marathon in the first generation Kawanas), so I was excited to get my hands on a pair of the Hoka Bondi 9s when they first launched back in January. Over the past seven months, I’ve put them to the test for everything from incline walks on the treadmill to speed workouts on pavement. The verdict? They’re extremely comfortable and supportive—but not very versatile.\nFor the uninitiated, the Bondi is one of Hoka’s most cushioned silhouettes. The first iteration debuted in 2011, and the style has remained a favorite among walkers and runners who prefer cushy shoes that minimize impact. The newest generation features a new midsole and increased breathability while still providing plush support. Here’s my full Hoka Bondi 9 review based on months of wearing the shoe.\nHoka Bondi 9 Features\nExtra Cushioning Without Extra Weight\nWalkers and runners with sensitive joints should appreciate that Hoka added two additional millimeters of cushioning to the Bondi 9’s midsole, so it absorbs impact and cradles your foot even better than previous versions. It results in a chunky silhouette, but the sneaker isn’t heavy. In fact, the design is only 0.5 to 0.7 ounces heavier than the Hoka Clifton 10 (depending on whether you’re buying a men’s or women’s shoe).\nThe thick cushioning makes these sneakers especially supportive for long walks and travel days spent on your feet. I occasionally deal with foot pain on days when I log 10,000-plus steps, but that didn’t happen to me once while I was wearing these shoes.\nThey allow for a really smooth run, too—as long as you’re not concerned about speed. I found these sneakers to be best for my casual evening runs, during which I typically ran 4 miles at most and kept an easy pace. When I tried to push my pace, I felt weighed down by the thick design. I didn’t experience the easy turnover that I’ve felt in lighter sneakers, but these aren’t really designed for that, so I can’t fault them too much.\nPlush And Comfortable Over Time\nThe Hoka Bondi 9 is undoubtedly one of the most comfortable sneakers I’ve ever worn. And that’s by design. In addition to its famous cushioning, the Bondi 9 features special heel and arch support and a soft knit upper. The shoe feels comfortable and plush from the very first wear, and I didn’t get any blisters (a problem I’ve had with other sneakers in the past).\nSome sneakers start out comfortable, but start to make your feet hurt as the day goes on. That isn’t the case here. I’ve worn the Bondi 9s for busy days in New York City when I’m trekking to and from the subway, tackling steep stairs and chasing my dog around. And at the end of those days, I find that my feet aren’t sore or tired thanks to the ample support of these shoes.\nImpressive Durability\nIn my tenure as a runner, I’ve found that I can usually tell when a sneaker is starting to wear down, because I start to get pain in my right knee and arch. To me, that’s a sign that the shoe’s support has worn down, and my joints are starting to pay the price. Depending on how much I’m running, that tends to happen at the six- to nine-month mark. So far, I’ve been wearing the Bondi 9s for seven months and I haven’t felt any discomfort. And even more impressively, the treads don’t look that worn either.\nAnother issue that I sometimes have with sneakers is that the upper starts to wear down near my inner ankles, possibly because I occasionally rub one shoe against the other due to overpronation. None of my Hoka sneakers have ever shown this sign of wear and tear, and that continues to be true with the Bondi 9. That really speaks to the durability of the upper material in my opinion.\nWhat To Consider About The Hoka Bondi 9\nIf you’re looking for a versatile sneaker that you can get away with using for easy runs, speed workouts and long runs, this isn’t the shoe for you. The thick design is going to leave you feeling weighed down and held back from your best pace. It’s designed for casual runs and walking, and those activities are the only ones in which it truly excels.\nIt’s also worth noting that my feet got a bit hot in the Bondi 9s during tougher workouts, despite the brand’s tweaks to the upper aimed at improving breathability. So if you already struggle with sweaty feet, you may want to steer clear of this sneaker.\nThe Final Verdict\nI’ve gotten way more use out of the Hoka Bondi 9s than I originally thought I would. I find myself reaching for them when I know I’ve got a long day on my feet ahead of me, and they never disappoint. I initially planned on wearing them mostly for walking, but they’ve also become a go-to for easy run days when I’m not worried about my pace.\nYou’d be hard-pressed to find a more supportive neutral sneaker. Just make sure you’re okay with a chunky silhouette, because these certainly aren’t subtle.\nHow I Tested The Hoka Bondi 9\nTo uncover the advantages and drawbacks of the Hoka Bondi 9, I wore the sneaker for a variety of activities including walking, running and sprinting over the course of seven months. I took note of how my feet and joints felt during each exercise, and observed whether it felt like the shoes weighed me down at all (they only did when it came to sprinting). I also wore them for long travel days and while running errands around New York City to assess their performance as an everyday sneaker. And I monitored the foams and fabrics to ensure they didn’t fail over time.\nWhy Trust Forbes Vetted\nThe Forbes Vetted team regularly reviews sneakers to uncover the best models for specific activities—like running—as well as specific concerns—like plantar fasciitis. We personally test top pairs from brands like Hoka, On and Brooks to find the best options for our readers needs.\n- Supervising deals and coupons editor Kara Cuzzone, who authored this review, has over seven years of experience testing products in multiple categories—including health and fitness. She’s been running regularly for the past 15 years, logging hundreds (if not thousands) of miles in various sneakers from Asics, Brooks, Hoka and Nike.\n- This article was reviewed by commerce editor Christine Colby. She has over a decade of experience in media, with a deep knowledge of the product testing process thanks to her experience with sites like People, Verywell Health and The Spruce."
    },
    {
      "url": "https://www.forbes.com/sites/forbes-personal-shopper/people/cam-vigliotta/",
      "text": "As the gear editor at Forbes Vetted, I review and recommend products in the consumer outdoors and fitness spaces, from bikes and tents to treadmills and fitness trackers. As a former commerce editor, copywriter and cultural journalist, my work has appeared in publications like Gear Junkie, Field Mag, REI’s Uncommon Path and more. When I’m not writing about gear, you can find me testing it in the field while camping, hiking, running, biking and skiing. I hold a degree in kinesiology from the University of Massachusetts Amherst, where I spent extended periods working with the institution’s locomotion research group studying bipedal movement. I currently live in Central Oregon, where trails and mountains are a stone’s throw from home.\nThe Best Hoka Shoes For Walking, Recommended By Pro Shoe Testers\nFrom the cushy Clifton to the slip-resistant Bondi SR, we pored over specs, features and foams to find the best Hoka shoes for walking. Here are the models we recommend.\nThe Best Hoka Running Shoes: Our Picks After Logging Hundreds Of Miles\nWe logged miles in several top-rated styles, from the versatile Clifton to the race-ready Rocket X 3, to find the best Hoka running shoes. Here are the ones we recommend.\nDometic Recon Review: Smart Looks, Deep Chills, Cool Features\nThe Recon is a stackable, packable cooler with handy features. We packed it to the brim and took it camping to find out if it excels, or falls short of expectations.\nThe Best Workout Shoes For Men—8 Gym Shoes I Recommend As A Gear Expert\nWhether you're a runner, lifter, racer or CrossFit athlete, these are the best workout shoes for men, according to our in-house gear expert.\nThe 6 Best Walking Pads, According To Our Editors\nCompact, quiet and easy on your wallet, under-desk treadmills make it easy to sneak in extra steps during the workday. Here are the best walking pads you can get now.\nThe Best Cold Plunge Tubs To Boost Recovery, Energy And Wellness\nCold water immersion boasts myriad benefits, and the best cold plunge tubs make it easy to reap them at home. Here are the models we recommend for a variety of use cases.\nThe Best Hiking Sandals, Based On Years Of Testing Experience\nComfortable, capable and ready for adventure, the best hiking sandals free your feet through summer. Here are our top picks from Teva, Chaco, Keen and more.\nThe Best Barefoot Shoes That Promote Flexibility And Natural Movement\nHere are the best barefoot shoes we recommend for walking, running, hiking, lifting and everyday wear. Our top picks include Xero, Whitin and Merrell.\nHoka Clifton Vs. Hoka Bondi: Which Running Shoe Is Right For You?\nHaving trouble deciding between two of Hoka's top-selling shoes? We break down how these models compare and help you decide which one is right for you.\nThe 7 Best Protein Powders, With Insights From Dietitians\nWe reviewed different blends and spoke with dietitians to find an assortment of the best protein powders for various diets and goals."
    },
    {
      "url": "https://www.forbes.com/sites/forbes-personal-shopper/people/stevenjohn/",
      "text": "I’m a staff writer focused on gear and tech with more than a dozen years of experience in journalism. When not writing, ideally I’ll be found on a trail, in a kayak, or in the kitchen, usually with my wife and kids nearby in all noted situations.\nHiking Shoes Vs. Hiking Boots: A Guide To Finding The Right Trail Footwear\nIn this guide, we break down the key differences between hiking shoes and boots based on factors like weight, breathability and cushioning. Here's what you need to know.\nPump Up Your Routine With The Best Over Ear Headphones For Working Out\nThe best over ear headphones for working out immerse you in music and stay snugly in place. Here are our top picks, from Bose to Beats and more.\nThe Best On Running Shoes, Backed By Insights From Podiatric Experts\nWe evaluated and tested several best-selling styles, from the cushy Cloudmonster to the Cloudflyer 5, to find the best On running shoes. Here are the models we recommend.\nThe Best Inflatable Paddle Boards Of 2025 Pack Small And Play Big\nThe best inflatable paddle boards let you explore and engage your body for hours on end. Here are the models we recommend, based on experience and expert insights.\nThe 8 Best Non-Alcoholic Beers, According To Our Taste-Testing Panel\nWe tested 26 NA brews to find the best non-alcoholic beers across a range of categories, including the best non-alcoholic IPA, the best non-alcoholic lager and more."
    },
    {
      "url": "https://www.forbes.com/sites/forbes-personal-shopper/article/best-compression-socks-for-running/",
      "text": "I've evaluated outdoor and fitness equipment for over five years.\nSep 20, 2024, 02:53pm EDT\nCompression socks have become a common sight in the running world. Worn by professional athletes and amateurs alike, they provide graduated compression across your ankles and legs to increase circulation and blood flow, offering extra support where runners need it most. These socks are available in different levels of tightness (typically measured in mmHg), with stronger compression being more beneficial for boosting recovery.\nWhile they’re often promoted as a performance tool, research shows that compression socks are actually more effective for recovery—when you’re looking to reduce soreness and aid muscle repair. With this in mind, I evaluated dozens of the best compression socks for running to separate the wheat from the chaff, relying on my expertise and that of Chloe Costigan, a doctor of physical therapy for Mobility-Doc in Bethlehem, Pennsylvania.\nBased on my findings, the CEP Run Tall Compression Sock 4.0 is my top pick for consistent, effective compression. If you’re looking for a slightly less expensive pair, I recommend the Rymora Compression Sock for around $10. And if you need a half-calf, merino or light compression sock, I’ve found great options for these as well.\nAsk any longtime runner to name a few of their favorite compression socks and it won’t be long until someone mentions CEP. The European brand sells a vast selection of athletic apparel, but it’s the Run Tall Compression Sock 4.0 that steals the show with its technical, graduated compression. Made from a breathable blend of polyamide and spandex, the fabric makes use of small channels to funnel air through the calf and footbed to prevent overheating, while a silver treatment prevents the buildup of funky odors and bacteria. In terms of compression, the sock gently constricts around the arch, ankle and calf to improve blood flow, and that same compression relieves pain from plantar fasciitis, shin splints and tender Achilles tendons.\nOf course, the obvious drawback to such a popular, effective compression sock is the sticker price. At $60, the Run Compression Tall Sock 4.0 is the priciest option in this guide, and it’s one of the more expensive compression socks on the market today. Still, I think the superior combination of comfort, quality, breathability and compression justifies the price if you’re looking for a running compression sock that checks all the boxes; it’s one that’s sure to meet the needs of most runners.\nBest Budget Compression Socks For Running\nA Wallet-Friendly, Seamless Style For Casual Comfort\nMOST POPULAR\nRymora Compression Socks\nMaterials: 54% nylon, 39% polyester, 7% elastic fiber | Compression: 15–20 mmHg | Sizes: S, M, L\nPros:\nDesign reduces friction and prevents blisters\nSoft fabric\nGreat value\nCons:\nMay be difficult to put on\nIf you’re trying compression socks for the first time or need a basic pair for around the house, this option from Rymora should do the trick. Made from a blend of synthetic fabrics with a hint of elastic fiber for added stretch, it’s a comfortable and sporty style that provides no-frills relief. And while it isn’t outfitted with air channels for breathability or silver for odor control, the Rymora compression sock does eliminate any seams, so you won’t suffer from unwanted blisters in the middle of a long run.\nRealistically, my biggest concern with this sock is long-term durability, but it’s hard to beat the wallet-friendly price at $16 (or less when it goes on sale). For that reason, I recommend wearing this sock after workouts instead of taking it out for long-distance efforts. Get to know how it feels, keep an eye on the fabric over time, and use it for short runs around the block or longer runs if the fabric holds up.\nBest Merino Wool Compression Socks For Running\nDurable, Odor-Free Relief For The Miles Ahead\nSmartwool Run Compression Socks\nMaterials: 49% merino wool, 12% nylon, 31% recycled nylon, 8% elastane | Compression: 20–30 mmHg | Sizes: S, M, L\nPros:\nExtended durability zones\nMesh patterning for breathability\nOdor-free benefits of merino wool\nCons:\nExpensive\nAs a big fan of merino wool, I’ve worn Smartwool’s Run Compression Socks for a little over a year, and in spite of taking them on long-distance hikes and runs up and down the West Coast, they haven’t so much as broken a sweat (even though I certainly have). While the design makes use of nylon and elastane, merino wool is the star of the show here because of its breathability, durability and long-term comfort. Whether I’m gearing up for a day in the mountains or kicking back on the couch to recover, the soft fabric and moderate compression feel great for hours, and the fit is spot-on as well. And because merino wool naturally fights odor-causing bacteria, these socks won’t smell even if you’re wearing them for an ultramarathon or a weekend backpacking trip.\nIn my experience, the biggest problem most people have with merino wool is how much it costs, but I recommend thinking of it as an investment. Sure, budget-friendly socks or thermal underwear have their place, but if you’re willing and able to invest in apparel and accessories made with high-quality fabrics like merino, they’ll last longer and offer more comfort.\nBest Half-Calf Compression Socks For Running\nA Versatile Style For Runs, Rides And Other Adventures\nWhether it’s a matter of comfort, style or some other personal preference, you might not want to wear a knee-high compression sock—but because you’re probably still looking for some compression above the ankle, I recommend the Swiftwick Aspire Crew. Featuring a thin, breathable fabric blend that offers “firm” compression about the ankle and lower calf, the Aspire Crew is a multipurpose option for running, cycling or almost any other activity. What I like most about this sock is the thin fabric that makes it easier to feel where your foot is in space, and the fact that Swiftwick offers it in a high-visibility neon yellow to help others see you on the road or trail.\nThe only issue you might have with such thin fabric is the lack of cushioning, but not to worry: If the Aspire Crew doesn’t offer the underfoot support you need, consider the Flite XT Mid-Crew with moderate compression and cushioning that’s a bit more stable as well. And if the lack of cushioning isn’t a problem, your legs will love the Aspire’s blend of stretchiness and support.\nWhile all of the compression socks in this guide are designed to help your legs recover after running, I specifically like 2XU’s Recovery Sock for its length, graduated fit and padding. In terms of length, it sits just below the knee to compress your entire lower leg, so you’ll feel the constriction from every angle, but it isn’t too tight. That’s because 2XU designs this sock with a graduated fit that applies the greatest degree of compression at the ankle, and it decreases towards the calf to improve circulation. From there, padded zones add cushioning to the heels and balls of your feet, ensuring you can run, walk or lounge around the house in total comfort.\nAgain, the biggest drawback here is the price, but it’s admittedly hard to put a price on recovery. The other complaint I hear most often is that the socks are hard to put on and take off, but this comes with the territory. Make the upfront investment and choose the right size, and these socks will provide the support and recovery that your legs need.\nBest Light Compression Socks For Running\nGentle Support For Sore, Achy Legs\nBombas Everyday Compression Socks\nMaterials: 70% cotton, 15% polyester, 9% elastane, 6% nylon | Compression: 15–20 mmHg | Sizes: S, M, L\nPros:\nA Goldilocks degree of compression\nVersatile enough for exercise, travel, pregnancy and more\nBombas donates a pair of socks for every pair you buy\nCons:\nNot specifically a running sock\nSometimes the firm and extra-firm compression that most compression socks provide can feel overwhelming, which is why I recommend Bombas’ Everyday Compression Socks for soft, light compression. While most of the other socks on this list offer 20–30 mmHg of compression, Bombas dials that figure back to 15–20 mmHg, so it feels more like a gentle hug than a firm squeeze. When paired with a honeycomb arch support, soft cotton fabrics and fun colors, the Everyday Compression Sock is easy to love and even easier to wear.\nWith that said, it’s worth noting this isn’t a true running compression sock. If you’re looking for a Bombas sock that’s built specifically for exercise, the brand’s Performance Compression Sock is the way to go: It offers 20–30 mmHg of compression, airflow technology and more durable fabrics. But if you simply want light compression that transitions from a workout to a weekend of travel, this sock can’t be beat.\nAs Forbes Vetted’s gear editor, I selected every pair of compression socks in this guide, and I’ve been covering outdoors and wellness topics for years. I hold a degree in kinesiology from the University of Massachusetts, where I served as a research assistant in the biomechanics lab.\nIn addition to my professional background, I’m also a dedicated runner who trains for road and trail races ranging from 5k to 50k in length. I’ve tried compression socks from various brands over the years, and I currently wear the Smartwool Run Compression Socks when fast and effective recovery is essential, especially after long training runs.\nI aim to refresh this list regularly to ensure information, availability and prices are up-to-date. This article was written and published in September 2024.\nHow We Chose The Best Compression Socks For Running\nTo identify and recommend the best compression socks for running, I relied on my own expertise, consulted other runners who use compression socks and read customer reviews from those who bought compression socks for running with their own money.\nI gathered a list of more than 12 socks from a variety of brands before analyzing their features, taking into consideration compression levels, materials, sizing and durability. That list of 12 was then cut to a total of six, all featured in this guide.\nI read through countless consumer reviews, determining which socks offer minimal relief as a result of weaker compression and which are truly capable when it comes to improving circulation and blood flow.\nUpon evaluating different socks, I spoke with Chloe Costigan, DPT, a physical therapist at Mobility-Doc in Bethlehem, Pennsylvania, to learn more about the benefits of compression socks for running and how to find the right socks for your needs.\nI tapped internal sources to find out what features other Vetted writers and editors look for in compression socks for running, as well as which socks they find most comfortable and helpful.\nThis final list reflects the socks that reviewers, as well as my internal sources, consider to be the best on the market.\nWhat To Consider When Shopping For Compression Socks For Running\nCompression Level\nWhy it matters: Compression socks come in different levels of tightness, usually measured in mmHg. Think of it like this—lighter compression might feel good for some extra support during your run, but if you’re really looking to boost recovery, a stronger level of compression can make a big difference in reducing soreness and improving circulation.\nKey consideration: For recovery, aim for a pair in the 15–30 mmHg range. This pressure helps your muscles get the oxygen and circulation they need after a tough workout. For running, you can use socks that fall within the same range, but Costigan notes that your legs will swell the longer you run; so while a tighter sock might feel good over the first few miles, the fit might become uncomfortable as you go a longer distance.\nFit And Sizing\nWhy it matters: A good fit is everything when it comes to compression socks. Too tight, and the fabric will quickly feel restrictive. Too loose, and you won’t get the support you’re after.\nKey consideration: Be sure to measure your legs and check each brand’s sizing chart before you buy. A snug but comfortable fit is key to both keeping you comfy and helping with recovery. “The general guideline I use is that they should feel tighter than your typical sock, like a firm support, but not uncomfortably tight,” says Costigan. “If you feel like you couldn’t stand to have them on for more than 60 minutes, they’re too tight.”\nMaterials\nWhy it matters: The material your socks are made from affects how breathable and moisture-wicking they’ll be. This is important both during runs, when you want to keep your feet cool, and after, when moisture control helps prevent odor and irritation.\nKey consideration: Look for synthetic blends like nylon or spandex—they stretch well, breathe better and hold up over time, keeping your feet dry and comfortable no matter how hard you’re working out or recovering. Costigan also notes that it’s important to consider how the sock feels along the top of your calf: “Patients will most frequently complain of a tightness or irritation across the top portion of the sock.”\nDurability\nWhy it matters: You’re going to put these socks through a lot, both during runs and when you wear them for recovery afterward. Durable socks hold their shape, keep their compression strength and last through many wash cycles.\nKey consideration: Go for socks that are known to hold up. A pair that wears out quickly or loses its compression won’t give you the long-term benefits you’re seeking. “They last quite a while, assuming you follow the care instructions,” says Costigan.\nPurpose (Running Vs. Recovery)\nWhy it matters: You can wear compression socks during a run or after a run is over—it all comes down to your needs. “When you’d find more benefit from the use of them during a run would be training for longer distances or doing speed work,” explains Costigan. Meanwhile, recovery-focused socks are designed to boost circulation and help reduce inflammation when you're resting between workouts.\nKey consideration: If recovery is your main goal, consider grabbing a pair specifically designed for post-run use. They’ll help with muscle repair and leave you feeling fresher for your next run."
    },
    {
      "url": "https://www.forbes.com/sites/forbes-personal-shopper/article/best-hoka-shoe-for-walking/",
      "text": "Curious about which walking shoes truly stand out, I casually polled my friends, family and fellow walkers, only to find that one name kept surfacing: Hoka. That discovery sparked a deeper dive into the best Hoka shoes for walking, as I looked for models that deliver on comfort, support and stability. After testing and comparing options, the Clifton 10 emerged as the top all-around pick due to its lightweight cushioning and sheer versatility. I also like the Bondi 9, for even more cushioning, and the Arahi 8 if you need a proper stability shoe.\nKnown for its colorful, max-cushioned trainers, Hoka kicked off the chunky footwear movement over a decade ago, and many of its bestsellers still stand out as great for walking. To evaluate Hoka’s walking shoes, I compared specs like stack height and weight in addition to midsole support and cushioning, stability, traction and overall comfort. I also spoke with Caroline Bermel, head shoe tester and content marketing specialist at Fleet Feet, for some buying advice.\nFor years, the Clifton has served as my go-to running shoe because it’s light, plush and versatile. But over time, I’ve started wearing it even when I’m walking—it’s just that comfortable. The breathable upper is lightweight and perfectly snug to prevent overheating, but doesn’t sacrifice durability. Padding around the ankle is soft and flexible to minimize rubbing. And while the Clifton has long been praised for its cushioning, it doesn’t feel like you’re sinking into the ground with each step. Rather, it’s supportive and supple to absorb impact.\nHoka considers the Clifton a neutral shoe, which means it isn’t designed for stability, but it does contain the brand’s Active Foot Frame technology that supports landings. If you need even more cushioning, you might consider the Bondi 9 or, for a more responsive ride, the Mach 6 is also easy to wear. For more insights, read my Hoka Clifton 10 review, as I wore it to train for a marathon.\nThink of the Bondi as the Clifton’s bigger sibling. Technically, it weighs less than the Clifton 10, but more of its girth is found in the midsole, which increases the stack height. (By comparison, the Bondi 9 measures 42mm at the heel versus 38mm on the Clifton 10.) Hoka completes it with a breathable mesh upper, and the collar is soft to reduce friction. Active Foot Frame technology supports landings, and that’s a welcome feature—a shoe this tall might otherwise feel unstable.\nHoka devotees know that the Bondi isn’t the brand’s cushiest shoe. That honor goes to the Skyward X—a model with a stack height of 46mm at the heel. If you try the Bondi and it’s not cushioned enough, you’ve got options. But for most people who prefer ample foam that doesn’t muffle the walking experience, it’s the way to go. “Overall, the Bondi 9 is a great shoe for walks, easy runs and long days on your feet,” explains Forbes Vetted supervising editor Kara Cuzzone. If you’re torn between the Bondi 9 versus the Clifton 10, be sure to read up on how they compare.\nIf you overpronate (meaning your foot collapses inward as you step and puts strain on the muscles surrounding it) or suffer from flat feet, the Arahi 8 is designed to provide additional stability. Updated with Hoka’s “H-frame” technology, it features firm strips of foam along the sides of the shoe that prevent rolling, but it doesn’t overcorrect your gait. Instead, think of it as a gentle helping hand that keeps your foot upright and the surrounding muscles engaged. “They fit like a glove but still have plenty of toe room, which has been really helpful on longer runs when my feet start to swell,” says Forbes Vetted associate director of operations, Kayla Sigaroudi.\nBeyond stability, the Arahi 8 is lighter than many other stability running shoes we’ve covered, but it’s still a bit heavy at 9.8 ounces per shoe (men’s). It probably won’t be the style you reach for to get through speedy walks, but it’s comfortable thanks to balanced cushioning and a gusseted tongue. It’s also a bit softer than its predecessor (the Arahi 7) and other stability shoes like the Hoka Gaviota 5, so keep that in mind if you prefer more stiffness and structure. Otherwise, this is a great option if you’re rebuilding your foundation due to overpronation or injury.\nExcellent stability keeps the foot in a neutral alignment\nSolid cushioning for all-day comfort\nCurved sole promotes a smooth gait\nCons:\nNot available in extra-wide sizes\nThe Gaviota 5 is a stability shoe designed for longer walks or extended periods of time on your feet. Stiffer foam along the entire edge of the shoe keep your foot in place while softer foam in the middle maintains comfort. It’s finished with a breathable upper, plush collar and MetaRocker—a design element that adds a slight curve to the base to help with heel-to-toe transitions as you walk.\nIf you don’t specifically need a stability shoe, the Bondi or Clifton should work for you, because they also come with added cushioning. And if you ultimately need less cushioning but want the stability and support, you can move down to the Arahi. Otherwise, this is a solid, balanced shoe that should meet your needs for long distances.\nTreated with a water repellent to prevent moisture buildup\nCons:\nChunkier and more stiff than other Hoka shoes\nMost of Hoka’s walking shoes are versatile enough to handle flat gravel roads, but if you need more grip, the Anacapa Breeze Low is a solid option. It features a layer of nubuck leather along the top for added durability, and comes with a PFC-free DWR treatment to keep moisture at bay. But the star of the show is the outsole—it features 5mm lugs and Vibram MegaGrip rubber for best-in-class traction. That might be overkill if you’re walking on a dirt path, but it really comes in handy around roots, rocks and wet obstacles.\nKeep in mind that what you gain in toughness, you lose in comfort. The shoe feels chunky and rigid, almost like a hiking shoe, so assess when and where you walk before deciding if it’s worth sacrificing some of that support (it’s also available in a low-top with Gore-Tex or a mid-top with a higher cuff). Otherwise, the Clifton 10 should get the job done more often than not.\nOn paper, the Bondi SR looks a lot like its sibling, the Bondi 9, but unlike the classic Bondi, the SR adjusts key details to make it more suitable for the workplace. The upper, for example, is crafted with a water-resistant leather, and the collar has memory foam for long-lasting comfort. Underfoot, a slip-resistant rubber keeps you on your feet, and the tread pattern is designed to improve traction. Overall, this shoe is safe for kitchens, hospitals, warehouses and other workplace environments.\nThe Bondi SR isn’t as light as the Bondi 9, nor is it as breathable. And while you can technically exercise in it, it isn’t a true athletic shoe. That said, it’s a comfortable, durable style for professional use that keeps your feet happy, even if you’re standing for hours at a time.\nThe Forbes Vetted gear team are experts in all things fitness footwear. Our editors and writers have put countless sneakers to the test—many from Hoka. By tapping into our in-depth testing and research, we’ve published a collection of gear roundups, including this guide and a guide to the best Hoka running shoes.\nForbes Vetted gear editor Cam Vigliotta, who authored this guide, has over six years of experience testing sneakers and workout shoes. As an avid runner (and walker), he owns many pairs of Hoka shoes, including the new Clifton 10, Mach 6 and Anacapa Breeze Low. He has a background in kinesiology, and uses that experience to evaluate footwear.\nOther Forbes Vetted staffers helped us test Hoka walking shoes. Supervising editor Kara Cuzzone tested the Bondi 9, and associate director of operations, Kayla Sigaroudi, tested the Arahi 8.\nTo learn more about Hoka walking shoes, we spoke with Caroline Bermel, head shoe tester and content marketing specialist for Fleet Feet. Her insights helped us make more informed recommendations based on different needs and create a buying guide that’s aimed at helping you find a comfortable, supportive walking shoe.\nWe review and update this guide regularly to ensure its accuracy and that our recommendations are still available. It was last updated in August 2025 by Vigliotta, who reviewed the latest recommendations and replaced the outgoing Arahi 7 with the new Arahi 8.\nHow We Chose The Best Hoka Shoes For Walking\nWe took many steps—both literally and figuratively—to find the best Hoka shoes for walking. Here’s how we made our picks:\nWe looked into Hoka’s best-selling models to find styles suitable for walking based on our experience and real-world feedback. Cushy, stable shoes like the Clifton 10 and Bondi 9 were some of the first models we considered, followed by others like the stability-driven Arahi 8and the slip-resistant Bondi SR.\nWe evaluated a range of options based on a set of key variables, starting with cushioning and support. Walking shoes should have ample foam underfoot to absorb impact, but each model’s construction produces a different experience. We looked at shoes with responsive, balanced and plush cushioning to cover all our bases.\nA shoe’s upper and outsole help determine when and where you should wear it. Models like the Clifton 10 feature a breathable upper and versatile outsole for pavement, sidewalks and other hard surfaces. Others, like the Anacapa Breeze Low and Bondi SR, are designed for trails and slippery surfaces, respectively. We considered options that cater to different preferences.\nWhen you combine cushioning, stability, traction and features like breathability, what kind of shoe do you wind up with? And who is it best for? By comparing shoes to one another based on all these basic elements, we gained a better understanding of each style before making our recommendations.\nHow To Shop For Hoka Walking Shoes\nWhen you’re trying to choose the best Hoka walking shoe for you, we recommend paying close attention to such key features as the shoe’s cushioning, support, stability and traction.\nCushioning And Support\nAt the heart of any good Hoka walking shoe is a cushioned midsole for long-term comfort, but the degree of cushioning varies from one shoe to the next. As Bermel notes, the right shoe “depends on the individual’s preferences.”\nWhile it’s difficult to gauge just how cushioned a shoe really is until you wear it, Hoka designates shoes as either responsive, balanced or plush based on the amount of cushioning they provide. Responsive cushioning uses firmer materials and foams to help your feet push off with efficiency; plush cushioning absorbs impact to create a forgiving ride; and balanced cushioning sits in the middle to deliver protective cushioning that maintains some responsiveness.\nIf you prefer truly plush cushioning, consider the Bondi, Hoka’s tried-and-true max-cushioned shoe. For balanced cushioning that supplies a best-of-both-worlds experience, models like the Clifton and Transport should meet your needs. And if you’re after responsive cushioning for faster walking, the Mach series is a great option.\nStability\nA walking shoe’s stability refers to how it supports your foot through the gait cycle. While even neutral shoes contain some stability elements, true stability shoes are designed to address overpronation, which occurs when your foot rolls inward as you step. Not all walkers need a true stability shoe, but if you overpronate, it can really help.\nHoka classifies a shoe’s stability as either neutral, moderate or stable. Neutral shoes feature a symmetrical bed of cushioning, but don’t add stability elements; stable shoes contain some form of intervention, like “H-frame” technology—a form of construction that prevents excessive inward rolling; and moderate shoes contain features that make the design inherently stable, like a wide base, to support neutral gaits.\nUnderstanding your natural gait can help you find a walking shoe that meets your needs. The Arahi, for example, improves stability because it contains a strip of foam along the medial side to prevent overpronation. Similarly, the Gaviota features “H-frame” technology that weaves firmer foam around the entire shoe. Other models, like the Clifton and Bondi, are neutral shoes, meaning they provide basic support via a symmetrical footbed.\nTraction\nMost people use their walking shoes on hard, dry surfaces like concrete or asphalt, but that doesn’t mean you should overlook traction. Again, Hoka makes different shoes for different purposes, so it’s important to consider your needs.\nIf you use your shoes to run errands, take the dog on a walk or travel, models like the Clifton, Bondi and Gaviota are great because they’re made with a basic, durable rubber outsole for longevity and versatility. If you prefer to walk on local trails or dirt roads that require a bit more traction, consider the Anacapa Breeze Low or even the Speedgoat—both feature Vibram MegaGrip rubber to boost traction. And the Bondi SR has a true slip-resistant outsole, which is great for some workplaces.\nIntended Use\nUltimately, the best Hoka walking shoe for you comes down to how you use it. A plump, squishy trainer like the Bondi isn’t really suitable for trails, while the Anacapa Breeze Low isn’t necessary for sunny sidewalks. Consider when and where you prefer to walk and narrow down your options from there.\nWe reviewed our recommendations and buying advice, replacing the outgoing Hoka Arahi 7 with the Arahi 8 as our preferred Hoka stability shoe for walking."
    },
    {
      "url": "https://www.forbes.com/sites/forbes-personal-shopper/article/best-hiking-sandals/",
      "text": "Hiking sandals have been a part of my warm weather footwear rotation for over a decade. At first, they served as comfy camp shoes—something to lounge in after a long day on the trail. But I quickly realized the best hiking sandals are not only comfortable, but capable, and often all you really need to get out there. I’ve worn them across the Sierras, along the shores of New England and everywhere in between—backpacking, rafting and even running to find styles that truly hold up. And now, I’ve put together this in-depth guide to the best hiking sandals. My top recommendation: the Bedrock Cairn Evo 3D—it’s perfect for most people and environments.\nOver the years, I’ve gravitated toward minimalist sandals that are simple yet skillful, but I recognize that feet are different from one pair to the next. What works for my feet might not work for yours, which is why I reviewed hiking sandals based on a set of shared criteria: traction, durability, fit and stability. In the end, I found great options from Teva, Chaco, Bedrock, Hoka, Keen and more. Below, the best hiking sandals, and how you can go about selecting a quality pair.\nWeight (per pair): 15.6 ounces | Upper: Polyester and nylon | Midsole: EVA | Outsole: Rubber | Closure: Buckle | Sizes: 5 to 13(men), 6 to 14 (women)\nThe Bedrock Cairn Evo has been my preferred hiking sandal for five years now; others have come along, but none have replaced it. My adoration for this sandal is a result of many things, but it starts with the three-point Y strap up top. By combining a buckle, hook and hook-and-loop systems, it’s incredibly easy to dial in the fit, and once you get it right, you never have to adjust it. The straps are also incredibly durable and likely to outlive the sole.\nSpeaking of the sole, Bedrock pairs a thin EVA midsole with a Vibram XS Trek EVO outsole that’s durable and grippy. The tread isn’t as aggressive as a hiking boot, but it’s capable on a variety of surfaces, from loose dirt to wet granite rocks. And after you’ve worn it down over time, simply send it back to Bedrock as part of the brand’s Re-Soul and Repair Program for fresh rubber (a $65 process).\nAs fond as I am of the Cairn Evo, it’s not a perfect adventure sandal. The thong strap between the toes, for example, is polarizing—some love it, others hate it (I fell into the latter camp but eventually moved on). It’s also thin and flat, so it doesn’t offer the same support as a thicker sandal like the Chaco Z/1 Rapid Pro. Still, I personally. consider these minor drawbacks. The Cairn Evo’s simple, lightweight, repairable design strikes a balance between comfort and capability that meets the needs of most hikers.\nTeva’s Original Universal Sandal transcends outdoor activities, and because it costs less than a tank of gas these days, we can’t help but crown it the best budget pick. So what do you get for $60? Well, the straps are made from recycled polyester, and they secure around the ankle and forefoot with hook-and-loop straps. The EVA midsole adds a bit of cushioning to maintain comfort, and a basic rubber outsole supplies sufficient grip.\nTeva doesn’t shy away from colors and patterns, which means you can find the Original Universal in a variety of styles. And while the bare-bones footbed might not offer much support for those with high arches, it keeps flat feet comfy for miles on the trail. That said, this is a wallet-friendly sandal, so it may not last you many summers if you hike in it for hundreds of miles, and the outsole isn’t as grippy as others in this guide. Really, it’s a good option for everyday wear and the occasional hike on a mellow trail. If you’re looking for a Teva model with a bit more support and grip, the Hurricane XLT2 might better meet your needs, and it costs just $20 more.\nKeen’s Newport H2 Sandal just so happens to be our favorite water shoe, but if you’re in need of a sandal that offers toe protection, it should also serve you well on hikes. By blending a classic hiking shoe base with a sandal-like strap, Keen submits a piece of summertime footwear that’s lightweight, durable and eager to tackle obstacles.\nThe washable polyester webbing on top allows air to pass through for improved breathability, but it still offers just enough protection to keep most dirt and debris out. An EVA insole provides arch support and cushioning, and a nonmarking outsole adds much-needed grip. But the big talking point here is the closed-toe design that prevents you from stubbing a toe in a rocky riverbed or stabbing it on a sharp root. The toe bumper does its job dutifully.\nIt’s also worth noting that, because this sandal features a shoelike platform, it’s incredibly comfortable for miles on end. The Hoka Hopara 2 won us over in the comfort department, but if that sandal doesn’t quite meet your needs, consider this one instead.\nIt wouldn’t be fair to describe the Hopara 2 as a shoe or a sandal—it’s a little bit of both, which is exactly what Hoka was going for. The upper, for example, is made of stronger bits of fabric to give it shoelike structure, but it’s finished with mesh to dramatically improve breathability. Underfoot, a chunky sole looks and feels like a classic Hoka running shoe, but it’s designed to make the Hopara 2 amphibious, so you can confidently tackle river crossing or rafting trips in comfort. And it’s finished with a quick-lace toggle that makes it easy to slip on and cinch in seconds; a hook-and-loop strap around the heel helps tighten things up for a secure fit.\nThere isn’t a whole lot to criticize about the Hopara 2, but it is heavy at 10.4 ounces per shoe (women’s), which means it weighs about the same as a running shoe. It’s also far more enclosed than most open-toed hiking sandals, which may defeat the purpose of a sandal altogether if you’re looking to liberate your feet. Ultimately, it isn’t your typical sandal, nor is it your typical shoe, and as a result, it won’t be the right option for everyone. But if you’re after that sort of balance, there isn’t anything else quite like it.\nTeva’s Hurricane XLT2 Sandal serves those of us with flat feet. Truth be told, any number of sandals on this list can make a flat foot happy (my flat feet happen to love Bedrock sandals), but if you fancy a sandal that offers more cushioning and support without forcing an arch, this is the one for you.\nNot unlike the Original Universal sandal mentioned above, the Hurricane XLT2 uses thick, recycled webbing and hook-and-loop straps to create a secure, comfortable fit, and the patterns are just as eye-catching. But this sandal differs from its sibling below the foot, where thicker EVA material offers a lot more comfort and support. A built-in nylon shank adds more stability as you explore mixed terrain, and Durabrasion rubber is more grippy. Teva even treats these materials with a peppermint-based antimicrobial layer that fights the growth of odor-causing bacteria.\nThe Hurricane XLT2 is a crowd pleaser, but it’s still not quite as durable as a pair of Chacos or Bedrocks. The hook-and-loop straps can also wear down over time and lose their stickiness, which necessitates replacing the sandal altogether—no repair program exists. But this sandal is a step above the Original Universal, which makes it a great option if you like Teva and want something a bit more rugged and reliable than the brand’s base sandal.\nI spent a few days rafting the Tuolumne River in the Chaco Z/1 Rapid Pros, and I walked away impressed. If you’ve worn Chacos before, this sandal looks and feels like its siblings —it’s chunky, heavy and incredibly durable. What’s new, however, is the outsole designed in collaboration with Vibram and professional raft guides. According to Chaco, the Vibram Megagrip compound has six times the grip on wet river rock compared to other adventure sandals, which is a claim I can back up with anecdotal evidence. Whether I was playing in the river or wading through it, the Z/1 Rapid Pros felt planted, and I never really questioned if they were grippy enough to keep me upright. Others in my raft (who were also wearing this sandal) said the same, so it’s a option if you spend time on the water and need the traction.\nThe only downsides of the Z/1 Rapid Pro (and Chaco sandals in general) are that they’re heavy and thick. To be sure, these qualities are also what make Chaco so popular, but if you have flat feet or prefer a truly lightweight design, you should probably look elsewhere. Otherwise, this new-ish sandal from Chaco is a confidence-inspiring companion.\nCam Vigliotta serves as Forbes Vetted’s gear editor, and as the author of this guide, he spent time logging hundreds of miles in hiking sandals from Teva, Chaco, Bedrock, Hoka and more. He holds a degree in kinesiology and understands the pivotal role footwear plays in allowing us to explore in safe comfort.\nWe return to this guide regularly to ensure the information we provide is accurate and up-to-date. In doing so, we provide you with the details you need to find a comfortable, long-lasting pair of hiking sandals. This guide was last updated in July 2025.\nHow We Chose The Best Hiking Sandals\nWe spent time on trails and in rivers near and far to find the best hiking sandals. Here’s how we made our picks:\nWe looked into established sandal brands to find styles suitable for hiking based on experience and real-world feedback. Popular sandals like the Chaco Z/1 Rapid Pro and Teva Hurricane XLT2 were some of the first models we considered, followed by others like the shoe-sandal-hybrid Hoka Hopara 2 and the Keen Newport H2.\nWe evaluated specific sandals based on a set of key variables, starting with traction and stability. Hiking sandals should have grippy outsoles to help you traverse loose or wet surfaces, though each outsole’s construction offers a different experience. Stability, meanwhile, is a result of the outsole material, the shape of the sandal and how much cushioning it offers. Designs with more foam like the Hoka Hopara 2 feel less stable than barefoot-style sandals.\nA sandal’s upper determines how it secures to your foot. Models like the Bedrock Cairn Evo feature a thong-style strap system. Others like the Teva Original Universal use hook-and-loop straps that are easy to adjust. We considered various options to fit different feet.\nWhen you combine traction, stability and features like strap design, you’re left with a sandal that should help you explore the world. By comparing options against one another based on these elements, we gained a better understanding of each style before making our recommendations.\nHow To Shop For The Best Hiking Sandals\nReady to invest in a pair of hiking sandals? As you weigh your options, keep these variables in mind to ensure the pair you choose meets your needs.\nActivity\nThink about the type of activity you plan to do and the terrains you expect to encounter when wearing your sandals. Will you be exploring rocky trails, sandy beaches, raging rivers or all of the above? Different sandals offer varying levels of grip and protection, which is why we recommend looking at reviews to determine where former buyers have used their sandals to better understand where they shine.\nStability\nLook for hiking sandals with adequate support and cushioning. A contoured footbed and beefy midsole help reduce fatigue and provide stability on uneven surfaces. And if you prefer a barely there sandal that’s solely designed to protect your foot from the ground, consider lightweight or minimalist models.\nMaterials\nLook for hiking sandals made from durable and quick-drying materials that include synthetic fabrics, leather and rubber. These materials should also be breathable and water-resistant to ensure long-term comfort.\nTraction\nPay close attention to the outsole design, including the lug patterns and materials used, to ensure they provide reliable traction on various surfaces. Deep lugs or a grippy Vibram outsole enhance stability on slippery, loose or uneven terrain.\nDurability\nRead the reviews, assess the materials and inspect the construction quality to gauge the durability of a pair of sandals. Hiking sandals should be able to withstand frequent use on a variety of terrain. Consider investing in sandals with repair programs, like those available through Chaco or Bedrock, that allow you to mend and restore your sandals after years of use.\nWe overhauled this guide for 2025 by reassessing our top picks and the buyer’s guide information, naming the Bedrock Cairn Evo the top hiking sandal overall."
    }
  ],
  "argos_summary": "This article provides a comprehensive guide to choosing between hiking shoes and hiking boots, emphasizing that the right choice depends on individual preferences, terrain, and pack weight. Hiking shoes are lighter and more flexible, making them suitable for less extreme conditions and faster travel, while hiking boots offer more support and protection for heavier loads and technical terrain. Key factors to consider include weight, breathability, cushioning, and the specific needs of the hiker.",
  "argos_id": "JXI7XECDS"
}