{
  "url": "https://www.cnet.com/home/energy-and-utilities/everything-you-need-to-know-about-choosing-the-right-home-generator-for-your-needs/",
  "authorsByline": "AJ Dellinger",
  "articleId": "7d56607d745e4a45b4c7aabf0b688f1c",
  "source": {
    "domain": "cnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.cnet.com/a/img/resize/9394747db9403d330204b7e68dbcc23611f22615/hub/2021/12/16/668df70a-c00b-40e5-8e36-355809bd017c/gettyimages-1278295972.jpg?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:29:00+00:00",
  "addDate": "2025-08-14T19:47:25.718432+00:00",
  "refreshDate": "2025-08-14T19:47:25.718434+00:00",
  "score": 1.0,
  "title": "Everything You Need to Know About Choosing the Right Home Generator for Your Needs",
  "description": "When you're looking to protect the power to your whole home, you want to know you've picked the best generator. Here's what to know about costs, types and installation before you buy.",
  "content": "When accidents happen and knock your power out, having a home generator can be the difference between a cold dark night and ruined food and having your refrigerator running, lights on and being comfortable at home. There are many options to choose from, including portable units to standby systems and even solar-powered alternatives. The right generator for you balances your needs with your budget, including operational costs. As shown by a recent CNET survey, 78% of US adults are concerned about rising energy prices, making an efficient generator a smart investment.\n\nUnderstanding the costs, installation requirements and benefits will help you decide if a generator fits your home setup and lifestyle. This guide covers everything you need to make an informed decision about adding this backup power source to your home.\n\nThe average American faced 5.5 hours of outages in 2022, partly due to severe weather. While that's an improvement from previous years, the long-term trend shows outages are becoming more common, particularly weather-related ones.\n\nThough addressing extreme weather conditions requires broader solutions, a home generator will bring you immediate peace of mind when the power goes out. However, generators are a big investment that might seem more of a luxury than a necessity for some households.\n\nConsider the generator costs, installation processes and what to expect from this backup power source. Then you can make an informed decision as to whether you want a home generator to kick on when the lights go out. Because maybe you're better suited for an alternative or are comfortable and prepared to remain in the dark until an outage passes, even as they become more common.\n\nHow much does a home generator cost?\n\nThe cost of a home generator will depend on several factors, from its make and model to its power capacity and features. According to HomeAdvisor, the typical cost of a whole-home generator so far in 2025 lands between $1,538 to $8,818.\n\nOne of the biggest factors in the price of a generator is how much it will have to power, typically measured in kilowatts. According to the US Energy Information Administration, the average American household uses just short of 900 kilowatt-hours per month, about 30kWh per day. Typically, generators with 20kW of capacity are considered whole-home generators and cost more. If a generator has less than 10kW of power, it's meant for smaller jobs and will cost less.\n\nAnother factor that plays a significant role in the cost of a generator is the fuel source. Gasoline-powered generators are the most common type of generator and typically cost less than alternatives like solar battery backups, which store electricity for you to use when you need it.\n\nYou will have to factor the cost of the fuel itself into this equation, as you'll need to fuel the generator to use it. Some home generators run on natural gas, which is typically cheaper than gasoline. Propane is a common fuel source for portable power stations, less so for whole-home options. Diesel is considered to be the most efficient generator fuel, although it is less effective in cold temperatures. These trade-offs and considerations will play into your decision.\n\n\"The largest expense by far is the cost of purchasing and installing the generator,\" according to Don Whaley, founder and former president of Direct Energy. Installation costs will vary by the type of generator you purchase.\n\nWith a portable generator, there is no real installation cost. A whole home generator, by contrast, is a more permanent structure that requires proper setup. Installation costs include labor and electrical work including circuitry and transfer switches. It may include installing a concrete pad for the generator. All that can cost between $1,500 to $5,000, according to HomeAdvisor.\n\nMaintaining a generator carries a small annual cost. You should also get your generator inspected before seasons when you're most likely to need it. This can cost as much as $80 to $300.\n\nThen there is the cost of actually running a generator, which varies by type of generator. Estimates from HomeAdvisor suggest that if you are operating a whole home generator that is powered using diesel or propane, you can expect to pay around $200 per day for 20kW of power. A portable gas generator providing 5kW of power can cost around $100 per day to run, depending on gas prices.\n\nNatural gas, which is commonly used for whole home generators, tends to be the most affordable option, although it can also rack up costs, depending on how long you have to depend on it.\n\n\"The cost of running the machine, assuming the fuel is natural gas piped to your home, can be significant,\" Whaley said. \"But in the current market, with natural gas hovering at or below $3 per MMBtu [metric million British thermal unit], you'd have to have an extended outage for that cost to become significant.\" The cost is now about $4 per MMBtu.\n\nWhat are the benefits of a home generator?\n\nHaving power at home through an outage isn't just about convenience, although it certainly makes riding out a storm easier. It's also about safety and security. \"Outages lasting for days aren't just inconvenient. They can be life-threatening,\" Whaley explained.\n\nWhen power outages strike for short periods, a generator can prevent the hassles that often follow, like food spoiling. When outages are longer or the result of extreme weather events, generators can prevent disasters.\n\nWhen Texas experienced a severe winter storm in 2021, many households were unprepared for the loss of power and experienced freezing cold temperatures. More than 240 people died as a result of the storm and the resulting power outages, according to the Texas Department of Health and Human Services. Generators can also keep your air conditioner running during heat waves that knock out electricity. In these situations, generators can be life-saving purchases.\n\nThe map below shows data from the US Energy Information Administration about the average number of power outages per year the average utility customer in each state had from 2018-2022 (using all reporting methods). We also looked at the average total duration of outages per year in hours. Generally, states along the coast and those in the Southeast had the most and longest outages.\n\nHaving a home generator during a power outage can be convenient or potentially life-saving, depending on the situation, but it does carry a significant cost that some might not be willing or able to pay.\n\n\"It's unlikely that the system will ever pay for itself based on electricity produced versus the cost of electricity from the grid,\" Whaley said. A generator is more an investment in protection than one that you may expect a return on.\n\nAccording to Whaley, it's worth considering your situation and how your household may benefit from a home generator. \"Families with small children or elderly parents are the ones for whom generators make the most sense. These are the vulnerable segments of the population and those least adaptable to extended outages,\" he explained.\n\nWhether owning a home generator is worth it comes down to whether you can afford the up-front cost and ongoing maintenance, and how at-risk you and your family might be if you are without power for an extended period. Alongside your budget, take into account the support network around you and your access to other essential goods.\n\nGenerators that keep your whole home powered in an outage may be too costly or overkill for some households. Some alternatives can power a room or essential systems throughout your home at a cost that may better fit your budget.\n\nA portable generator, typically designed to provide power to a single room for a limited period, typically costs between $200 to $6,000, compared to $2,000 to $20,000 for a whole home option. There are also critical systems generators, which are meant to support essential systems including heat, lighting and kitchen appliances. You can expect a critical systems generator to cost $4,000 to $5,500.\n\nThese systems typically run on fossil fuel sources, but there are solar options available, as well. Most solar and battery storage options cost more, especially for higher capacity, but can operate without fossil fuels. It's worth considering, especially with many Americans complaining of increasingly high energy bills.",
  "medium": "Article",
  "links": [
    "https://www.cnet.com/home/energy-and-utilities/best-portable-power-stations/",
    "https://www.cnet.com/home/energy-and-utilities/a-guide-to-blackouts-why-they-happen-and-how-to-stay-safe/",
    "https://www.climatecentral.org/climate-matters/surging-weather-related-power-outages",
    "https://www.eia.gov/tools/faqs/faq.php?id=97&t=3",
    "https://www.dshs.texas.gov/sites/default/files/news/updates/SMOC_FebWinterStorm_MortalitySurvReport_12-30-21.pdf",
    "https://www.eia.gov/todayinenergy/detail.php?id=61303&src=email",
    "https://www.cnet.com/home/energy-and-utilities/backup-battery-vs-generator-which-emergency-power-option-is-better/",
    "https://www.cnet.com/home/energy-and-utilities/is-the-home-battery-the-new-generator/",
    "https://www.eia.gov/dnav/ng/hist/rngwhhdm.htm",
    "https://www.homeadvisor.com/cost/electrical/install-a-generator/",
    "https://www.cnet.com/home-tips/",
    "https://www.cnet.com/home/energy-and-utilities/how-to-choose-the-right-home-generator/",
    "https://www.cummins.com/na/generators/home-standby/generator-size-calculator",
    "https://www.linkedin.com/in/don-whaley/",
    "https://www.cnet.com/home/energy-and-utilities/direct-energy-review-an-accessible-provider-with-plenty-of-options/",
    "https://www.cnet.com/personal-finance/banking/advice/cnet-survey-78-percent-of-americans-are-stressed-out-about-high-energy-bills/",
    "https://www.cnet.com/home/energy-and-utilities/blackout-prep-made-easy-protect-your-home-with-these-simple-tips/",
    "https://www.cnet.com/personal-finance/banking/cnet-survey-78-percent-of-americans-are-stressed-out-about-high-energy-bills/",
    "https://www.cnet.com/home/energy-and-utilities/how-big-of-a-home-generator-do-you-need/",
    "https://www.cnet.com/home/energy-and-utilities/best-solar-generators/",
    "https://www.cnet.com/home/energy-and-utilities/battery-backup-buying-guide-heres-everything-you-need-to-know/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "whole home generators",
      "weight": 0.11993464
    },
    {
      "name": "Generators",
      "weight": 0.105537176
    },
    {
      "name": "generator",
      "weight": 0.105537176
    },
    {
      "name": "generators",
      "weight": 0.105537176
    },
    {
      "name": "critical systems generators",
      "weight": 0.101623714
    },
    {
      "name": "power outages",
      "weight": 0.09472721
    },
    {
      "name": "Installation costs",
      "weight": 0.078132026
    },
    {
      "name": "home",
      "weight": 0.076084405
    },
    {
      "name": "costs",
      "weight": 0.07445186
    },
    {
      "name": "extended outages",
      "weight": 0.07405732
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Energy & Utilities/Other",
      "score": 0.54833984375
    },
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.52685546875
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.4599609375
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Electricity",
      "score": 0.402587890625
    }
  ],
  "sentiment": {
    "positive": 0.18762141,
    "negative": 0.2680181,
    "neutral": 0.54436046
  },
  "summary": "The cost of a home generator can be the difference between having a power outage or having it running when it goes out due to accidents or other issues, but it can provide immediate comfort and convenience. The cost of the home generator depends on several factors such as its make and model, power capacity and features, including its size, capacity, and its operational costs. The average American household uses just short of 900 kilowatt-hours per month, about 30kWh per day, according to the US Energy Information Administration. The fuel source, including diesel or propane, can also influence the cost of maintaining a generator and maintenance. The biggest cost of purchasing and installing the generator will depend on the type of generator and installation costs.",
  "shortSummary": "A home generator can provide essential backup power for your home during severe weather, but costs and installation factors can vary depending on your needs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "65ce71bacd4b4a418a210f408562120a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnet.com/home/energy-and-utilities/best-solar-generators/",
      "text": "SOLAR DEALS OF THE WEEK\n- $299 (save $499)\n- $170 (save $200)\n- $108 (save $140)\nThe weather is starting to warm up, making it a nice opportunity to enjoy some time outdoors. It's also never too early to prep for the next power outage or emergency by picking up a solar generator that can keep your devices and appliances powered during an outage. We've tested several models and the Jackery Explorer 2000 Plus is our favorite solar generator, replacing the Jackery Solar Generator 2000 Pro. It can be paired with Jackery Solar Saga 200 panels, our favorite portable solar panels. The combination's light weight means it's easier to move than competitors with similar battery sizes. It also stores more charge in a shorter amount of time. If the Jackery Solar Generator 2000 Plus isn't what you're looking for, there are plenty of options for any budget.\nRead more: 23 Great Tech Gifts Under $100\nAll of the solar generators listed here were run through empirical testing at CNET's lab and handled and examined in person by me. All the picks below were made with firsthand knowledge.\nCan solar panels save you money?\nInterested in understanding the impact solar can have on your home? Enter some basic information below, and we’ll instantly provide a free estimate of your energy savings.\nSolar generators are smaller-scale versions of whole-house solar panels and batteries. Portable power stations have been available for a while now and using home solar panels to charge on the go is the next logical step. Combine portable power stations with portable solar panels and you have yourself a solar generator. Unlike their portable gas-powered generators, solar generators keep your devices on without the noise and toxic fumes.\nWe've tested the leading solar-powered generators to see how they stack up against each other and have chosen our favorites below. There are solar generators for a variety of needs and occasions, from smaller, car-battery-size options you could easily carry with you to high-powered, checked-bag-size ones that, while definitely portable, take a little more effort to move. All the solar generators on our best list performed well in testing and have a variety of features that boost their values, such as wireless charging and UPS functionality.\nThe 5 best solar generators of 2025\nThe Jackery Solar Generator 2000 Plus is a fast-charging portable power station that can be bundled with SolarSaga 200W panels for recharging off-grid. It replaces its predecessor, the Solar Generator 2000 Pro, which is generally unavailable these days offering much of the same capabilities and features.\nIn testing, it hit 100% charge using AC power from a wall outlet in just less than 2 hours -- about twice as fast as the other large solar generators we tested. Jackery says the generator can charge with solar in 2 hours with six of its SolarSaga solar panels (a total cost of more than $6,000 without discounts). It can be expanded to a 6,000-watt capacity with additional batteries (an additional $1,599 at MSRP) and can be paired with a transfer switch (an extra $399) for a whole-home power backup solution.\nOur lab tests showed that the Jackery Explorer 2000 Plus (the power station part of this generator) uses about 88% of its stated capacity of 2,160 watt-hours. That's about average for the industry. The Jackery SolarSaga 200 (the solar panel part of the generator) has an impressive 24.3% efficiency rating and a capacity of 200 watts. The solar generator can be charged with a maximum solar input of 1,400 watts.\nIt has a simple yet informative display and weighs 61.5 pounds, making it lighter than many similarly sized competitors. It has the features you expect from a solar generator -- two outlets for USB-A, two USB-C, four AC plugs and a 25A AC output and 12-volt car ports. The warranty is nothing to scoff at, with a three-year standard warranty and an automatic two-year extended warranty if you purchase directly from Jackery.\nOnce again, my pick for the best small solar generator is the one that charges the fastest. In this case, the Bluetti EB3A was three times faster than similarly sized generators in our wall charging test, reaching a full charge in just 81 minutes. Bluetti's stated recharge times from solar are at least twice as fast as many similar units. It has an easy-to-read display that moves beyond just the basics such as overall charge and tells you how much power is flowing in and out and with which outputs you have turned on. (Other smaller units typically have more limited displays.)\nBluetti's PV200 portable solar panel offers up to 23.4% efficiency. Under ideal conditions, the solar panel can recharge the generator in less than 2 hours. The PV200's charging capacity of 200 watts is the EB3A's maximum solar input. Combined with AC charging from your wall, the charging capacity reaches 430 watts, and the generator can recharge in as little as 1.2 hours.\nCNET's tests found that the EB3A used less of its battery than the Jackery Solar Generator 240. It starts with a larger battery, though, so its usable capacity is actually a bit higher. Its base price is just a bit higher, but the clear, informative display and powerful panel make up for it.\nWith a stated battery capacity of 595 watt-hours and a 100-watt solar panel, the Oupes 600-watt Solar Generator Kit is a great value at its current discount price on Amazon. Even considering that our tests showed that closer to 83% of that capacity is usable (which is in line with industry averages), you're still getting close to one watt per dollar spent. The Oupes also boasts one of my favorite displays for ease of reading and all the ports you're looking for (USB-A, USB-C, 12-volt car charger and AC wall outlet).\nThe Oupes charges a bit slower than others and its 100-watt solar panel has a 20% efficiency rating, slightly below others we tested. If fast solar charging is what you're after, this Oupes isn't for you. It can connect only one panel at a time. Still, for its cost, it's a great value.\nThe Fossibot F3600 Pro offers a compelling solar generator solution for those seeking an extra-large portable power station. Its substantial 3,840Wh capacity provides ample power for home backup, putting it in the same size category as the Anker Solix F3800, our current best extra-large portable power station.\nThe Fossibot stands out with an 89% measured capacity versus 79% on the Solix. Given the size, the charging speed is relatively fast, with the power station charging to full in less than 3 hours. Speaking of charging, the F3600 Pro can be paired with a 420W solar panel for recharging, which is one of the highest-power portable solar panels we've seen. The panel has a 23.4% power efficiency and you can buy between one and four additional panels as a bundle with the Fossibot F3600. It can also be paired with up to two expansion batteries, giving you a potential total capacity of 11.52Wh.\nThe unit features a range of USB-A, USB-C, AC and DC ports, allowing simultaneous powering of up to 15 devices with a maximum output of 3600W. UPS functionality is built in, with a 10-millisecond switchover, making it a reasonable way to back up home appliances that aren't too sensitive, such as a computer. It supports app monitoring with Bluetooth and Wi-Fi connectivity.\nPrice is another big selling point. The portable power station and the solar panel go on frequent sales. Currently, you can get a bundle that includes an F3600 Pro and two SP420 solar panels for $3,099 (MSRP $4,989), 38% off its full price. It can also be paired with a coupon code for additional savings.\nThe Grecell T-1000 is a capable midsized solar generator with an 888 watt-hour battery. We tested it to a 86% measured usable capacity. That's pretty solid overall and it'll charge to full in just shy of 7 hours, which isn't the fastest we've seen but falls in the middle of the pack with the competition.\nIt can charge up to 10 devices at the same time and can pair with 200W solar panels so you can keep it running off-grid. The 200W portable solar panel (an additional $399) has a 23.5% efficiency rating, just shy of the 200W Jackery Solar Saga.\nThe portable power station part supports pure sine wave to help you charge more sensitive electronics and appliances. It's well equipped with outlets: two AC outlets, one USB-C PD port, three USB-A ports, two DC outputs, one car outlet and a wireless charging pad on top, which is a nice feature we like to see on portable power stations.\nAt just 18 pounds, the T-1000 is the cheapest power station in its immediate weight class and even without sales it's 40% cheaper than its immediate competitors. It's currently available for $230 off with a coupon, bringing the price down to $469. Both the portable power station and solar panel come with a 24-month warranty.\nFactors to consider when choosing a solar generator\nFor a relatively new product, there are a lot of solar generators on the market. Instead of getting overwhelmed by options, focus on a few key specifications of the products and compare from there.\nCapacity\nPerhaps the most obvious consideration is the capacity of the portable power station and the solar panels. The power station's capacity measures how much energy you can store, while the solar panels' capacity measures how much solar energy you can funnel into the battery at one time. Another measure of capacity you'll want to note is how many solar panels you can plug into the portable power station at once. Some power stations are limited to one panel at a time, while others allow you to plug in multiple panels or daisy-chain them together. The greater the capacity, the more devices you can run for longer, but the weight and cost of the whole setup will increase as well.\nCost\nAs with most other purchases, you'll likely consider the cost. It can get a bit tricky to compare costs across solar generators because they come in different sizes and configurations. Some comparisons can be fairly easy: You can compare costs for different-sized power stations or solar panels (all else being equal) by calculating how many dollars per watt you're spending. In other instances, it might come down to personal preference: How much more are you willing to pay for a power station that charges two hours faster than a competitor? How much would you pay to be able to attach two, four or six solar panels instead of one?\nOutput\nNot only can portable power stations store different amounts of energy but they can also push out different amounts of energy. If you want to use your solar generator to run a specific device, make sure its output can meet the energy requirements of that device. For example, if you need to run a device that draws 120 watts of electricity, but your power station can provide only 100, you'll need a bigger power station.\nAlso, be on the lookout for surge output. Devices that have motors often require extra electricity to start up. If you'll need to back up a fridge or run a power tool, for example, make sure that your power station can meet the surge requirements, too.\nWeight\nSolar generators don't have to be portable, but many are designed to be. A solar generator is only as portable as your ability to move it. If you're going to be schlepping it around a worksite every day, or just moving it every once in a while while you're camping, weight may be more or less important to you.\nHow we test solar generators\nTesting for solar generators in the CNET lab takes place in two stages: One for the portable power station portion and one for the solar panels. Here's how we test each.\nPower station battery capacity\nFor the battery capacity test, we start with a fully charged battery. Then we plug lights into the fully charged battery and turn them on. We measure the amount of energy the lights are drawing and time how long they take to drain the battery.\nHere's why that's important: The stated capacity of a battery isn't always the same as the battery's usable capacity. If a solar generator has a stated capacity of 100 watt-hours and you plug in a lightbulb that draws 20 watts, you can expect it to run for 5 hours (20 watts times 5 hours equals 100 watt-hours). If the battery runs out in 4 hours, its actual capacity is 80 watt-hours or 80% of its stated capacity. The usable capacity is the amount of energy storage you actually get.\nPower station charge time\nThere is a surprising diversity of charge times across solar generators. We measure the time it takes to charge from empty to 50%, from 50% to 80% and then from 80% to full. Many manufacturers will tout the speed that you can charge their solar generators to 80%. That's because 80% is a significant portion of the battery, and the last bit of the battery takes longer to charge.\nPortable solar panels\nAt CNET we rely on hands-on tests and empirical data as much as possible, but the solar panel portion of a solar generator is more difficult to pull off in a lab setting. Instead, for the solar panel portion, we had to rely on the specifications each company published about its solar panels, paying special attention to the efficiency rating, durability and warranty period.\nRead more: Just looking for an emergency backup? Check out our list of best portable solar panels and solar batteries.\nOther solar generators we tested\nBluetti AC200P (currently unavailable): The AC200P was in a dead heat for the best large (and best overall) solar generator. It tops CNET's best list for portable power stations. It has an impressive battery usage -- using 95% of its 2,000-watt-hour capacity -- and a respectable charging time. It also has the most detailed display, which might be more than the average user needs. It holds a ton of energy and can provide a slightly higher surge output than my pick, the Jackery 2000 Pro. Ultimately, I chose the Jackery for its faster solar charge time and lighter weight.\nAnker 757 Solar Generator: The Anker 757 was considered for a top spot on our best list and would be a good choice. It charges speedily from the wall, filling its 1,229-watt-hour capacity in a brief 88 minutes and can accommodate 300 watts of solar charging. Its usable battery capacity was right in line with industry averages, and its solar panels (the same that come with the Anker 555) are efficient too.\nRockpals 300W Power Station and 100W Solar Panel (currently unavailable): This solar generator performed just fine in our tests. It was the fastest charging of the rest in its smaller size category (though much slower than our favorite, Bluetti's EB3A). Rockpals is very reasonably priced and, depending on discounts, could rival our value pick. Its look is a little different from others too, with more pronounced grills, if that's a factor in your decision-making.\nBioLite BaseCharge Solar Generator 1500: The BioLite BaseCharge 1500 solar generator combines Biolite's BaseCharge 1500 power station and Solar Panel 100. The 1,521-watt-hour power station uses a bit more than average of its battery capacity, includes an informative and easy-to-read display and was one of only three that we tested to feature wireless charging. In our wall charge test, it took more than twice as long to charge as the Bluetti AC200P and six times as long as the Jackery 2000 Pro. That said, the solar panel is one of the lightest of its size. You get a very respectable 10.53 watts for every pound of solar panel. You can buy a solar generator with one, two or four panels.\nBluetti EB55+ with PV120 Solar Panel: This solar generator was my solid second choice in the midsize category. It had the second-fastest charging time (although it was still twice as long as the EcoFlow Delta Mini) and a usable battery capacity slightly below average (81% of its 537 watt-hours), according to our tests. Paired with a 120-watt solar panel with an efficiency rating of up to 23.4%, it's a good option.\nJackery Solar Generator 1000 Pro: Jackery already has two entries on our best list, and the Solar Generator 1000 Pro is another solid offering. With good charge times and efficient solar panels (24.3%), there's a lot to like. With four SolarSaga 200 panels, it can charge as fast from the sun as from a wall: 1.8 hours. Read CNET's Brian Cooley's firsthand account.\nGeneverse HomePower Pro Solar Generator: This sleek offering from Geneverse (until recently, Generark), is one of the faster chargers CNET tested, needing just 120 minutes to fill its 1,200-watt-hour capacity. It can also take up to 800 watts of solar charging, which means it'll charge from the sun faster than many on this list as well. Geneverse solar panels have efficiency ratings north of 23%. The HomePower Pro is a solid offering. The Jackery 2000 beat it out in the large category because of its larger battery and solar charging capacity but could be a better fit depending on your needs.\nBioLite BaseCharge Solar Generator 600: BioLite's smaller model has some really nice features, including a thorough and easy-to-read display, and it was one of only three that we tested to have wireless charging. Hands-on, it was lighter and noticeably easier to move around than some other models. The 662-watt-hour power station charged slower than its similarly sized competitors (426 minutes from the wall), but it was more competitive than the larger BaseCharge 1500 in that respect.\nAnker 555 Solar Generator: This solar generator from Anker had one of the most impressive usable battery capacity numbers of everything we tested, at 94% of its 1,024-watt-hour capacity, but a slower charge time of 361 minutes. For its size, it's chock full of ports, including three for USB-C. The package includes two 100-watt solar panels (with efficiency ratings of up to 23%), which also matches its maximum solar input.\nYeti 200X + Nomad 50 Solar Generator (currently unavailable): This small option from Goal Zero has had lower-than-average usable battery capacity (65% of its 187 watt-hours) and was one of the slower chargers (though not as slow as the Jackery 240). The power station is remarkably light, although the Nomad 50 solar panel (50 watts) is a bit heavier (and pricier) per watt than others on the list.\nEcoFlow Delta Mini (Out of stock): Once our top pick for the best midsize solar generator, the Delta Mini is now sadly out of stock. When we tested it, we liked its 882 Wh battery which was capable of powering small appliances, with up to 300 watts of add-on solar charging capacity. It also came with five AC outlets, two USB-A ports, a USB-A fast charging port, a USB-C outlet and a 12.6-volt car power outlet, all while weighing 23.6 pounds.\nSolar generators FAQs\nIs there a limit to how many solar panels I can add to a solar generator?\nSolar generators have a limit to the amount of energy they can take in from the sun at a time. Manufacturers list the solar input limit (sometimes called the DC input limit) in watts. It represents the amount of solar you can use to charge a generator at one time. For example, our best large solar generator, the Jackery Solar Generator 2000 Plus, has a limit of 1,400 watts, which means it can handle up to six SolarSaga panels. The higher the limit, the faster you'll be able to charge from solar by adding more panels.\nHow long can a solar generator power my device?\nThat depends on how big the generator is and what your device's energy requirements are. Jackery says its large model, the Solar Generator 2000 Plus, will run a refrigerator for 3.1 hours, a ventilator for 35 hours and an electric oven for 1 hour. Off the grid, in an RV setting, it can power a portable air conditioner for almost 2 hours, a coffee maker for almost 3 hours and a TV for 23 hours.\nTo figure out how long any given solar generator will charge any given device, you need to know the generator's capacity and the device's draw. In a very simple example, say you have a 60-watt light bulb. Keeping this bulb lit for an hour would take 60 watt-hours of energy. If your solar generator has a capacity of 240 watt-hours, you could power this light for 4 hours without recharging.\nWhat devices can my solar generator power?\nTo find out if a solar generator will be able to power any given device, you'll need to know how much power the device draws and how much power the solar generator can push out. If a solar generator, say the Bluetti AC200P, has an output of 2,000 watts, it can push that amount of power continuously. It should run devices that don't require more than that amount of power.\nThere's one more specification you need to check. Some devices require a short burst of extra power when they start up. To see if your solar generator will be able to handle that, confirm what its surge output power is. The Bluetti AC200P can surge power up to 4,800 watts for a brief period."
    },
    {
      "url": "https://www.cnet.com/home/energy-and-utilities/best-portable-power-stations/",
      "text": "Power outages can be inconvenient, especially in the summer. If you live in an area where this is common, having a backup power source can be a lifesaver. And while a traditional generator can be expensive, a power station is an affordable alternative. It'll help you stay powered during a power outage and double as a great add-on to your camping gear.\nOur Picks\nGENERATORS DEALS OF THE WEEK\n- $169 (save $259)\n- $449 (save $799)\n- $499 (save $799)\n- $179 (save $269)\nWith that said, not all power stations are created equal. Some models are large and powerful enough to run a refrigerator for days, while others are designed for portability, offering just enough juice to keep your mobile devices charged for a few hours.\nAfter testing over 140 power stations and evaluating charging options, capacity, charge time and other features, we've narrowed down our top picks that can serve your needs, ranging from portability to whole home backup.\nWhich is the best overall portable power station?\nAfter countless hours of testing, our CNET experts found the clear answer to which portable power station is the best -- the $2,199 Jackery Explorer 2000 Plus. Jackery's offerings have never failed us in the portable power station arena, and this one is certainly no exception with its incredible features such as wireless charging and compatibility with solar panels. What set the Jackery Explorer 2000 Plus apart was the ability to expand it by adding external batteries, increasing its overall capacity and capabilities, although competitors like EcoFlow, Anker and others now boast this feature as well.\nRead more: Best Smart Home Gifts\nBest 10 portable power stations\nPros\n- Tested 88% usable capacity (better than industry average)\n- Charges via solar (1,400-watt input) or AC in under 2 hours\n- Highly expandable capacity, scalable up to an impressive 24kWh\n- Powerful 3000W output (6000W surge) capable of running heavy-load devices and appliances\nCons\n- Expensive at $2,000 compared with similar-capacity models\n- No wireless charging\nBest for:\nThe Jackery Explorer 2000 Plus is ideal for homeowners, RV enthusiasts and off-grid adventurers who need reliable, expandable power. With its 2,042.8Wh capacity (expandable to 5kWh with extra batteries), it can keep essential appliances running during outages or power a weekend camping trip with ease. The balance of capacity, charging speed and portability makes it the most versatile option for people who want one power station to handle multiple scenarios.\nWhy we recommend it:\nIn our testing, the Jackery 2000 Plus delivered an impressive 88.13% of its rated capacity, higher than many competitors in its class. It charges fully in just under 2 hours via AC or solar, and its 3,000-watt pure sine wave inverter safely powers sensitive electronics like medical devices or laptops. The built-in MPPT solar controller optimizes off-grid charging, and the sturdy design holds up to rugged outdoor use. For those who need dependable power without compromise, this is the best all-around choice.\nThe power station comes with a telescoping handle and durable wheels. You'll also notice the inclusion of a round RV-type AC output rated at 25 amps. What's more, if you'd like to pick up two of these, you can use the new Jackery expansion connector to link up both units and supply yourself with two separate 240-volt outlets (each rated 30 amps). We've seen this from a few other manufacturers, but I'm happy to see Jackery doing this early in the game.\nSimilarly, Jackery has thrown in on the modular game by offering external expansion batteries. For now, the 2000 Plus is the only unit that'll accept these batteries, but we can assume more are to follow. Each external battery has the same capacity as the base 2000 Plus unit, and currently, you can link up to five additional batteries to the main unit for a staggering 12,256.8Wh. Additionally, you can still combine two sets of the six-piece combos for that 240-volt capability and an even larger capacity of 24,513.6Wh.\nFor these reasons and more, the Jackery 2000 Plus is our top pick for both the best large and best overall portable power station.\nWho shouldn't buy it:\nBudget-conscious buyers should consider smaller models like the EcoFlow River 3, as the Jackery 2000 Plus commands a premium price at $2,199 without any sales. Its 61.5-pound weight also makes it less suitable for backpacking compared with ultraportable options like the Bluetti Handsfree 2. If you need only short-term power for small devices, this unit’s capacity may be overkill.\nPros\n- Excellent balance of capacity (1,264Wh), power output (2,000 watts), and manageable portability for its class\n- Rapid AC wall charging (100 minutes to full) and efficient solar charging (800W input)\n- Quiet operation, with noise levels not exceeding 30dB during charging\n-\nCons\n- On the heavier side for capacity\n- May not work best for high power appliances\nBest for:\nThe Jackery Explorer 1000 Plus is an excellent choice for people who require more than 1kWh of power but not the immense capacity (or cost and weight) of larger whole-home backup systems. It is well-suited for RV enthusiasts, van lifers and outdoor adventurers who need to power more demanding devices or multiple items simultaneously. Its expandability also makes it a good option for those who anticipate their power needs growing over time.\nWhy we recommend it:\nThe Explorer 1000 Plus is a versatile midrange option, with its 1.26kWh initial capacity, robust 2,000-watt continuous output, and, critically, the ability to expand up to 5kWh. These features give it a lot of versatility, from extended camping trips to reliable backup for essential home devices. You can charge via a wall outlet in about 1.5 hours -- or double that time if you opt for the 1000 Plus’ 800-watt solar charging input. Tested capacity is solid at 79.97%, which tends to be average for power stations.\nThe fast AC and solar charging capabilities, coupled with the longevity and safety of its LiFePO4 battery, are significant strengths. For most people who need serious power, modular is the way to go. Jackery's lineup continues to impress us with its full suite of expandable products.\nWho shouldn't get it:\nIf you're on a very tight budget, you may want a cheaper, lower capacity option like the 286Wh EcoFlow River 3 Plus. It may also not be the best choice for people needing to run very large, power-hungry appliances (like central air conditioners) for multiple days without any opportunity for recharging.\nPros\n- Very fast Turbo AC charging (950-watt input, 80% in 45 minutes, full charge in approximately 1.5 hours)\n- Power Lifting Mode can draw high-draw resistive devices up to 2,000 watts\n- Good solar input capacity (up to 500 watts) can recharge in 2 to 3 hours\n- UPS with a 20ms switchover time\nCons\n- Number of USB ports limited compared with competitors\n- Can't be recharged via a USB-C input\nWho it's best for:\nThe Bluetti AC70 is well-suited for anyone who needs quick recharges and has variable power needs. Its \"Power Lifting Mode\" makes it particularly useful for those who might occasionally need to power simple high-wattage resistive appliances like hairdryers, electric kettles or small heaters without investing in a much larger unit. Its portability also makes it a good grab-and-go power source.\nWhy we recommend it:\nThis station has 768Wh of capacity, and is currently on sale for $359 for Prime members. (We tested this unit to have about 93% of that capacity as usable. Anything over 90% is excellent.) It also has a rated power output of 1,000 watts (2,000 peak) and promises to charge to 80% in 45 minutes.\nThe Bluetti AC70's standout features are its impressive 950-watt Turbo Charging, which can replenish 80% of its battery in just 45 minutes, and the innovative 2000W Power Lifting mode for handling specific high-draw resistive loads. In our charge tests, we found that in turbo charge mode, the AC70 hits that 80% charge even faster, at just 33 minutes. These capabilities, combined with a durable LiFePO4 battery, a respectable 500-watt solar input, and useful features like UPS mode and app control, make it a highly versatile and usable power station in its category. It also has a UPS switchover of 20ms, though we recommend you check any essential medical equipment if you plan to use this as a backup power source -- some devices require switchover times below 12ms.\nAll in all, this is a great package with a low price tag, which makes it a perfect budget option.\nWho shouldn't get it:\nIf you need to continuously run sensitive high-wattage electronics or motor-driven appliances above its 1,000-watt rated output, look for a unit with a higher continuous power rating. People who heavily rely on USB-C for recharging the power station itself will find its absence a letdown.\nPros\n- Extremely lightweight and compact, making it highly portable for various activities\n- Very fast 1-hour AC charging from 0% to 100%\n- Reliable UPS capability with a quick switchover time, protecting sensitive devices\n- Includes a powerful 100W USB-C Power Delivery port for fast-charging compatible devices\n-\n-\nCons\n- The 245Wh capacity can't power high-wattage appliances\n- Only two AC outlets, with one being a two-prong outlet, which may limit connectivity for some devices\n- No built-in LED light, a common emergency feature on many portable power stations\nWho it's best for:\nThe EcoFlow River 3 is an ideal companion for digital nomads, students, photographers and anyone needing a highly portable solution to power or charge laptops, smartphones, cameras, drones and other small electronic devices on the go. Its UPS feature also makes it suitable for providing emergency power to essential low-wattage devices like Wi-Fi routers or CPAP machines (provided their power draw is within limits). At just $2539 at full price, it's also incredibly affordable.\nWhy we recommend it:\nThere's a lot to like in this small, reasonably priced package. The River 3 weighs just 7.8 pounds and measures 10 by 8.3 by 4.4 inches. Perhaps more impressively, it comes with 90% usable capacity out of the box, with the ability to charge to full in an hour. It's not shy on ports or features either, with two AC ports, one car port output, a USB-C output and two USB-A ports. Like many portable power stations today, it supports solar panel charging, generator hookups, and car battery recharging -- making it a great option for camping as well.\nEcoFlow also says devices drawing less than 100 watts will get double the battery life. It includes UPS capability with a switchover time of under 20 milliseconds, which should be sufficient for most electronics -- except highly sensitive devices like PCs or medical equipment. I also like the screen, which lets you monitor charging output and battery capacity at a glance. For this much power in such a small package, the River 3 is hard to beat.\nWho shouldn't get it:\nThe River 3 isn't a great option if you need to run appliances such as mini-fridges, coffee makers, heaters or power tools, as its 300-watt output and 245Wh capacity will be insufficient. Those requiring multiple grounded AC outlets or significantly longer runtimes for their devices should consider larger and more powerful models.\nPros\n- Extremely fast AC charging: 100% in 70 minutes, 80% in 50 minutes\n- Ultra-quiet operation during recharge (approx. 25 dB)\n- Specialized fast-charging capability for select DJI drone batteries\n- Reliable UPS mode with a rapid 0.02-second switchover time\n-\nCons\n- Solar and car charging cables and adapters are not included\n- Capacity is relatively small for users with extensive power needs\n-\nBest for:\nThe DJI Power 500 is an excellent choice for DJI drone operators seeking a fast and reliable field charging solution. It's also well-suited for photographers, videographers and content creators who need to quickly recharge camera batteries, laptops and other essential gear on location. People who prioritize extremely quiet operation, such as those using it indoors or in noise-sensitive camping environments, will appreciate its low decibel rating. Its rapid recharge capability also makes it ideal for individuals who need quick power top-ups for smaller devices and can't afford long downtimes.\nWhy we recommend it:\nWith DJI’s fast-charging technology, Power 500 gets you back to 100% power in just 70 minutes or, if you’re in a rush to get out, charged to 80% in just 50 minutes. The dual 100-watt USB-C two-way ports can provide separate power supplies to two devices, such as cameras, phones and laptops. Certified by five SGS noise tests, the DJI Power operates at 25 decibels, as quiet as a whisper. Tested capacity came out to a solid 79.66%, which tends to be the average for many power stations we've tested.\nThe ultra-quiet 25dB operation during recharging is another major advantage, ensuring minimal disturbance. Coupled with robust safety mechanisms, a durable LFP battery, and a useful UPS mode, it presents a compelling package for its target audience. The growing consumer demand for less intrusive technology, especially for indoor or serene outdoor settings, makes its quietness a key differentiator.\nWith a 512-watt-hour capacity and 1,000-watt output, the DJI Power 500 all-scenario portable power station can serve as an essential backup power source during emergencies, especially for road trippers and content creators.\nWho shouldn't get it:\nIf you need a power station to run high-wattage appliances (like microwaves or large power tools) for extended periods, its capacity will be insufficient. Those looking for a solution with a very large battery capacity without needing to purchase multiple units should explore larger models, including the Jackery Explorer 1000 Plus. Budget-conscious individuals should also factor in the additional cost of solar or car charging accessories if those are required.\nPros\n- All-in-one integrated design combining a power station with a functional backpack\n- Good capacity (512Wh) and output (700W continuous, 1200W)\n- Fast AC charging (600W input, 80% in 45 minutes) and efficient solar charging (350W input, full in 2 hours)\nCons\n- Combined weight of the power station and backpack when fully loaded with gear is 45-50 pounds\n- Weight, might feel unbalanced for some users, particularly hiking on uneven terrain\nWho it's best for:\nThe Bluetti Handsfree 2 Backpack is tailor-made for outdoor photographers, videographers, drone pilots, hikers, mountaineers and any adventurer who needs a truly mobile, hands-free power source for their electronic gear in remote locations. It excels in scenarios where setting down a traditional power station is impractical or inefficient.\nWhy we recommend it:\nThe Bluetti Handsfree 2 is one of the most unique power stations we've tested at CNET's lab. It's half a portable power station and half a backpack. Yes, it's very niche in terms of form factor, but if you're hiking, it's hard to beat a backpack-based setup since you'll likely be carrying one anyway. The power station itself has a 700-watt AC output, two USB-C and two USB-A charging ports, and it can charge up to five devices simultaneously. The backpack is IPX4 water-resistant and can carry a load of 66 pounds.\nThe 512-watt-hour battery is enough to keep you going for a while, and it comes with 87% usable capacity, which is pretty good. You can even pair it with a 100-watt portable solar panel and solar generator to further extend your options. (You can buy this as a bundle, too.) The entire power station can be charged to 100% in a little over 1 hour.\nThe 60-liter backpack is designed with camera users in mind. Its main compartment fits a camera body, multiple lenses, charging packs and accessories while still leaving space for clothing, a laptop or iPad and other essentials -- perfect for the roving photojournalist in you.\nWho shouldn't get it:\nIf you don't require a backpack-integrated power solution or need to power higher capacity devices in a fixed location, Fossibot and Anker may have more suitable solutions. It may not also be the most balanced weight while hiking when fully loaded.\nPros\n- Good selection of 10 output ports, including a 15-watt wireless charger\n- Decent 999Wh capacity and 1,000-watt output for general-purpose use and powering various appliances\n- LED light with bright, SOS and flashlight modes for emergencies or low-light conditions\n-\nCons\n- Uses NCM Li-ion battery, which usually has a shorter cycle life compared with the more prevalent LiFePO4 batteries\n- Relatively slow AC recharge rate with a maximum input of 155W\nWho it's best for:\nThe Grecell T-1000 is is great for anyone who needs a durable power station for use in rugged environments. It comes with a rugged build and and offers plenty of bang for the buck. At just 18 pounds, the T-1000 is the cheapest power station in its immediate weight class (about 40% cheaper than its immediate competitors). It also appears to go on sale fairly often.\nWhy we recommend it:\nThe Grecell T-1000 is the first we've tested from the manufacturer, and there's a good amount to like despite not being revolutionary. As far as specs go, you get a 888-watt-hour battery with an 86% measured usable capacity. That's pretty solid overall, and it'll charge to full in just shy of 7 hours.\nIt's well equipped with outlets: two AC outlets, one USB-C PD port, three USB-A ports, two DC outputs, one car outlet and a wireless charging pad on top. It can charge up to 10 devices at the same time and can pair with 200-watt solar panels so you can keep it running off-grid. It also supports pure sine wave to help you charge more sensitive electronics and appliances.\nThe combination of its compact size, large capacity and numerous input and output options gives the T-1000 great bang for your buck. If you can get the Grecell T-1000 at a competitive price, its robust external build and plentiful output options, including a wireless charger, offer good utility.\nWho shouldn't get it:\nPeople seeking the longest possible battery operational lifespan should consider models with LiFePO4 chemistry, which generally offers more charge cycles than NCM. Those who prioritize fast recharging speeds or a modern, aesthetically pleasing design may find other power stations more appealing.\nPros\n- 3840Wh base capacity with expandability up to 26.9kWh with one unit, or 53.8kWh with two units and 12 expansion batteries\n- Extremely high 6,000-watt continuous AC output with dual-voltage (120/240 volts)\n- Solar input capacity of up to 3,200 watts for very fast off-grid recharging (100% in as little as 1.5 hours)\n- Impressive five-year warranty\nCons\n- Extremely heavy at 136.7 pounds\n- Home Power Panel is required for some of the most advanced features, like automatic home backup and local energy saving\nWho it's best for:\nThe Anker Solix F3800 Plus is designed for homeowners seeking a premium, highly capable, and massively expandable whole-home backup power system. It is also an excellent solution for people living off-grid with significant power demands, or those who wish to maximize solar energy utilization. EV owners will appreciate its direct EV charging capability as a backup or supplementary power source.\nWhy we recommend it:\nThe Anker Solix F3800 Plus stands as one of the most powerful and versatile \"portable\" (wheeled) energy solutions currently available, offering capabilities that rival those of permanently installed home battery systems like the Tesla Powerwall. Its 3,200-watt solar input, 6,000-watt dual-voltage output, massive expandability options and intelligent features such as Storm Guard (when paired with the Home Power Panel ) make it a top-tier choice for achieving serious energy independence and comprehensive backup power. The increased solar input over its predecessor is a significant upgrade, so it's an even better option for off-grid power than the F3800.\nCNET contributor Adam Doud put it to the test in his home, trying it with a variety of high-power devices. \"The F3800 Plus powered my refrigerator for 12 hours, the longest time I got from my devices and appliances,\" Doud said. \"This was followed by my Hisense 65-inch U8K TV, which the Solix F3800 Plus kept running for another 7 hours.\"\nHe also tried it with a clothes dryer, reporting, \"You can probably expect to get about eight cycles out of the portable power station -- handy if you have a long power outage and need to dry clothes for your whole family.\"\nIt offers versatile direct EV and RV charging via dedicated NEMA ports, intelligent app control with features like Storm Guard for proactive emergency preparedness, and is built around robust EV-class LFP batteries designed for a long lifespan.\nWho shouldn't get it:\nThe F3800 Plus is wasted on anyone who doesn't need its huge capacity or expansion capabilities. If all you need is a genuinely lightweight, easily carried unit for camping or frequent transport, there are more portable picks from Jackery, EcoFlow, Bluetti and others.\nPros\n- Massive base capacity (3840Wh) expandable up to 11,520Wh\n- Very high continuous power output (3,600 watts) with a substantial surge capacity (7,200 watts) for demanding appliances\n- Very fast recharging options: AC (2,200 watts), solar (2,000 watts) and combined AC+Solar (up to 4,200 watts)\n- Often priced more affordably than competitors.\n-\n-\nCons\n- Extremely heavy, with the main unit weighing 92.59 pounds\n- Two-year warranty is shorter than competitors\nBest for:\nThe Fossibot F3600 Pro is an outstanding choice for homeowners seeking substantial and expandable backup power capable of running an entire house during outages, particularly those in areas with frequent power cuts or high-peak electricity. The F3600 Pro's price and capacity earn it a place on this list. This portable power bank is usually listed at $2,699, but frequent sales can make it an even more attractive option. As of writing, it's currently $1,299.\nWhy we recommend it:\nFossibot isn't a household name, but that doesn't stop it from being a great value option for those looking for an extra-large power station for home backup. This power station comes with a massive 3,840Wh capacity, putting it in the same size category as the Anker Solix F3800. Measured capacity works out to 89%, which is fairly solid and helps it beat out the Solix, which managed only 79%. In charging speed, the F3800 has the edge, reaching a full charge in under 3 hours, compared with the F3600 Pro, which takes 5 hours and 32 minutes to fully recharge.\nOther capabilities are impressive. The F3600 Pro comes with a mix of USB-A, USB-C, AC and DC ports, letting it power up to 15 devices at the same time with a maximum output of 3,600 watts. You can pair it with up to two expansion batteries, giving you a potential total capacity of up to 11.52Wh, though that's less than the six batteries the F3800 can take. It can also be paired with solar panels for recharging and supports car and generator charging. UPS functionality is built-in, with a 10-millisecond switchover and monitoring via an app that connects to Bluetooth and Wi-Fi.\nWho shouldn't get it:\nThis power station won't be the best option for portability or light-duty use. It also takes up a lot of space. Finally, if you want better (five-year) warranty support and more expansion options, the Solix F3800 Plus remains the better option for the capacity.\nPros\n- Expandable capacity from a base of 1,024Wh up to 5.12kWh with additional B2 batteries\n- Powerful 2,000 watts continuous AC output with a high 4,500-watt surge capacity, capable of running demanding appliances\n- One hour full recharge with combined AC (1,400 watts) and Solar (800 watts) input or rapid AC-only charging (80% in 50 minutes)\n- Integrated UPS less than 20ms switchover\nCons\n- Cooling fan can be quite loud during operation\n- Slower charging to full than River 3\nBest for:\nThe Oupes Mega 1 is an excellent choice for those seeking a high-value, expandable 1kWh portable power station that doesn't skimp on charging speed or output power. It's well-suited for RVers, campers and for providing home backup for essential devices. Its combination of features and performance at its price makes it attractive to budget-conscious consumers who still want robust capabilities.\nWhy we recommend it:\nThis is the smallest of the Oupes Mega series lineup, but that doesn't make it the least. For starters, it has a 95% measured usable capacity, notably higher than many other similarly size portable power stations. It charges to full in just over 1.5 hours, which isn't as fast as the River 3, but still fairly impressive for the size. You get a total of 13 outputs, with four AC ports capable of 2,000 watts output, two USB-C ports (100 watts), four USB-A ports (18 watts), one car outlet (120 watts) and two DC 5521 ports. It also supports 20 recharging with solar panels and has a 20-millisecond UPS switchover for more sensitive devices.\nThe Oupes Mega 1 packs a significant punch with its 2,000 watts continuous output, a 1,024Wh LiFePO4 battery that can be expanded to over 5kWh and exceptionally fast charging capabilities, including a 1-hour full recharge using combined AC and solar input. The rich feature set, which includes 13 output ports, smart app control and UPS functionality, all offered at a competitive price, gives it great value in the mid-capacity portable power station market.\nWho shouldn't get it:\nThe Mega 1 is a capable portable power station, but if portability is your most important factor, we like the EcoFlow River 3 for the compact size and faster charging to full.\nRecent updates\nMay 2025: We updated all of the products on the list with pros and cons, new merchant links and additional recommendations for use cases. We replaced the Anker Solix F3800 with the newer Anker Solix F3800 Plus. We removed the Dakota Lithium PS2400 because it's no longer available and added the Oupes Mega 1. We updated our testing procedures with a graphic that shows our new process to test charging and discharge time and included new comparison tables that show our test results.\nBest tested portable power stations comparison table\n| Make | Model | Spec Wh | Active Energy (Wh) | Usable Capacity | Start Time | Time to 50% | t50 (h) | Time to 80% | t80 (h) | Time to 100% | t100 (h) | Charge Active Energy (Wh) | Discharge AE (Wh) / Charge AE (Wh) | |\n|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|\n| Fossibot | 3600 | 3840 | 3383 | 88.10% | 2/10/2025 10:53:34 | 2/10/2025 12:20:34 | 1.45 | 2/10/2025 13:12:34 | 2.32 | 2/10/2025 14:54:34 | 4.02 | 4,360.06 | 77.59% | |\n| Bouge RV | Rover 2000 | 2008 | 1788.322 | 89.06% | 02/12/25 01:40:08PM | 2/12/2025 14:28:08 | 0.80 | 02/12/25 03:10:08PM | 1.50 | 02/12/25 05:00:08PM | 3.33 | 2,300.33 | 77.74% | |\n| Bluetti | Elite 200 | 2073.6 | 1927.17 | 92.94% | 2/11/2025 14:41:47 | 02/11/25 03:35:47PM | 0.90 | 02/11/25 04:08:47PM | 1.45 | 02/11/25 04:32:47PM | 1.85 | 2,491.64 | 77.35% | |\n| VTOMAN | Flashspeed 1000 | 828 | 653.88 | 78.97% | 02/18/25 02:35:06PM | 2/18/2025 15:11:06 | 0.60 | 2/18/2025 15:33:06 | 0.97 | 2/18/2025 15:49:06 | 1.23 | 897.43 | 72.86% | |\n| Schneider | OffGrid 730 | 738 | 535.86 | 72.61% | 2/28/2025 15:07:12 | 2/28/2025 19:30:12 | 4.38 | 2/28/2025 21:56:12 | 6.82 | 2/28/2025 23:36:12 | 8.48 | 807.28 | 66.38% | |\n| Anker | F3800 Plus | 3840 | 3095.59 | 80.61% | 2/26/2025 10:13:04 | 2/26/2025 11:38:04 | 1.42 | 2/26/2025 12:30:04 | 2.28 | 2/26/2025 13:25:04 | 3.20 | 4,969.85 | 62.29% | |\n| Duracell | G800 | 620 | 500.53 | 80.73% | 2/10/2025 15:07:34 | 2/10/2025 16:33:34 | 1.43 | 2/10/2025 17:21:34 | 2.23 | 2/10/2025 18:17:34 | 3.17 | 711.59 | 70.34% | |\n| Grecell | H2400 | 2400 | 1625.97 | 67.75% | 3/14/2025 10:56:53 | 3/14/2025 11:53:53 | 0.95 | 3/14/2025 12:30:53 | 1.57 | 3/14/2025 13:10:53 | 2.23 | 2,105.77 | 77.21% | |\n| ETAKER | M2000 | 2008 | 1771.62 | 88.23% | 3/18/2025 9:53:42 | 3/18/2025 10:56:42 | 1.05 | 3/18/2025 11:29:42 | 1.60 | 3/18/2025 12:11:42 | 2.30 | 2,247.26 | 78.83% | |\n| OSCAL | PowerMax 2400 | 2400 | 1731.79 | 72.16% | 3/19/2025 14:05:11 | 3/19/2025 14:51:11 | 0.77 | 3/19/2025 15:35:11 | 1.50 | 3/19/2025 16:07:11 | 2.03 | 2,253.12 | 76.86% | |\n| ECOFLOW | River 3 Plus | 286 | 242.61 | 84.83% | 3/20/2025 13:41:16 | 3/20/2025 14:07:16 | 0.43 | 3/20/2025 14:22:16 | 0.68 | 3/20/2025 14:34:16 | 0.88 | 316.08 | 76.76% | |\n| Bluetti | AC200L | 2048 | 1923.17 | 93.90% | 3/24/2025 11:03:59 | 3/24/2025 12:00:59 | 0.95 | 3/24/2025 12:35:59 | 1.53 | 3/24/2025 13:06:59 | 2.05 | 2,419.32 | 79.49% | |\n| Pecron | E3600LFP | 3072 | 2614.5 | 85.11% | 3/26/2025 9:32:30 | 3/26/2025 10:33:30 | 1.02 | 3/26/2025 11:11:30 | 1.65 | 3/26/2025 11:39:30 | 2.12 | 3,553.40 | 73.58% | |\n| Bluetti | Apex 300 | 2764.8 | 2385.78 | 86.29% | 4/16/2025 8:43:52 | 4/16/2025 9:55:52 | 1.20 | 4/16/2025 10:38:52 | 1.92 | 4/16/2025 11:09:52 | 2.43 | 3,350.32 | 71.21% | |\n| Bluetti | Apex 300 + B300K Expansion Battery | 5529.6 | 4674.77 | 84.54% | 4/22/2025 14:54:53 | 4/22/2025 17:24:53 | 2.50 | 4/22/2025 18:54:53 | 4.00 | 4/22/2025 19:57:53 | 5.05 | 6,722.98 | 69.53% | |\n| Jackery | HomePower 3000 | 3072 | 2721.22 | 88.58% | 4/28/2025 10:57:10 | 4/28/2025 12:01:10 | 1.07 | 4/28/2025 12:40:10 | 1.72 | 4/28/2025 13:18:10 | 2.35 | 3,500.02 | 77.75% | |\n| Enphase | IQ PowerPack 1500 | 1500 | 1309.7 | 87.31% | 4/30/2025 8:47:41 | 4/30/2025 9:26:41 | 0.65 | 4/30/2025 9:49:41 | 1.03 | 4/30/2025 10:19:41 | 1.53 | 1,701.15 | 76.99% |\nHow we test portable power stations\nCurrently, we look at two main performance metrics for portable power stations: charge time and discharge capacity. Every company that sells portable power stations provides the expected number of watt-hours its products are supposed to last. That can vary from as low as 240 watt hours to as many as 2,000 watt hours for a larger power station.\nThat means if you run a device with a 1-watt output on a power station with 240Wh, it should last for about 240 hours. On a 2,000Wh power station, you'd get an impressive 2,000 hours. That would last you almost three months. For reference, a USB-C iPhone charger draws up to 18 watts, a 3-quart Instant Pot draws 700 watts and a standard microwave draws around 600 to 1,200 watts, depending on the model.\nUsable capacity\nA power station's capacity should be a no-brainer. You should be able to look at a device's rated watt-hours and purchase accordingly based on your needs. Generally, you can do that. I've found that you typically won't see the entire capacity rating as usable power.\nLots of factors can affect this, and most of them center on how the manufacturer chooses to build its units' internals to manage their charged capacity. There is some (usually negligible) amount of power that goes to fuel the various indicator lights and readable LED panels on the units. Some of the larger units even have their own operating systems, so it's almost like powering an additional mini PC on the inside. Other units can have power-saving features where they reduce outgoing bulk power as they come close to depleting their charge.\nTo run our capacity tests, we connect several 10,000-lumen LED work lights, rated at 110 watts, to each unit. (The number of work lights is based on the overall watt-hour rating of the unit under test, or UUT.) We record the outgoing voltage and wattage using external measurement instruments or the UUT's own measurements if available. Once we have this data, we can leverage the calculations into a dizzying array of information about the UUT's performance. The main piece of information we look at here is the observed capacity, based on our measurements, compared to the UUT's stated capacity.\nHere's that mass of data in a nifty chart, where longer bars indicate power stations with greater percentages of battery capacity that you can put to use.\nIn every case, that percentage ends up at less than 100%. Most manufacturers say you should calculate expected usage at 85% of the stated capacity. Generally, we consider anything above 80% to be a good capacity, with anything below 70% being subpar.\nCharge time\nCharging performance can be nearly as important as knowing your capacity stats. It helps to know how long your device will take to charge, especially if you're crunched for time or need to be able to charge quickly for whatever reason.\nWe report three data points for charging performance. Each unit is plugged in for AC charging and we record how long it takes to reach 50%, 80% and 100% charge. Half-full is probably the least amount of power you're going to want, especially from the smaller units. 80% is the \"magic number\" for many rechargeable batteries.\nTake a look at the full charge test results below. Charge times are listed in hours, so shorter bars indicate power stations that charge faster. In many cases, you can see how the charge rate is fairly constant between 0% and 50% (red) and from 50% to 80% (yellow), before slowing down from 80% to 100% (green).\nFactors to consider when purchasing a portable power station\nThe two most critical specifications are capacity, measured in watt-hours, and output, measured in watts. Watt-hours indicate the total amount of energy stored, akin to the size of a fuel tank; it determines how long the power station can run connected devices.\nFor instance, a 700Wh station was observed to keep a refrigerator running for 14.5 hours in one scenario. Watts, on the other hand, represent the rate at which power can be delivered, similar to an engine's power; this dictates which devices, and how many, can be run simultaneously. It's important to distinguish between rated (continuous) wattage and surge (peak) wattage, the latter being a short burst of higher power needed to start some appliances. A common guideline is to calculate expected energy usage at about 85% of a power station's stated capacity to account for conversion losses.\nIf you need a portable power station consider the devices you intend to power, note their individual wattage requirements (usually found on the device label), and estimate the desired runtime to select an appropriately sized unit.\nHere are the all the key factors you'll want to look at when deciding on a portable power station.\n- Size: Portable power stations come in a wide array of sizes and capacities, from the small and compact EcoFlow River 3, to the more capacious Anker Solix F3800, which stretches the limits of the word \"portable,\" despite coming with wheels. The smaller power stations may be better for camping, digital nomads and those on the go, while the extra-large ones are best for folks who want home backup power. There is an inherent trade-off in portable power stations: higher capacity and greater power output generally result in increased weight and larger physical dimensions.\n- Capacity: Capacity is measured in watt-hours, giving you a sense of the energy stored and how long a power station can run connected devices.\n- Output: Output is the other piece of the puzzle here, measured in watts. You'll want to consider what you need to run. If you simply top off some phones and laptops, the smaller portable power stations that have just one or two AC outlets and a handful of USB-C and USB-A ports should be enough for you. If you want to run more demanding appliances like microwaves, toasters and air fryers, you'll need something with more juice, like the Jackery Explorer 2000 Plus.\n- Ports: The number and type of output ports are significant. We look for a sufficient array of AC outlets (grounded, and sometimes specialized like NEMA TT-30P for RVs 16), USB-A ports (ideally with Quick Charge 3.0), high-power USB-C Power Delivery ports (60 watts or 100 watts for laptops and other devices) and DC/car accessory outlets.\n- UPS (Uninterruptible Power Supply): This feature allows the power station to act as a backup, automatically switching to battery power within milliseconds (e.g., <10ms or 20ms) if grid power fails, thus protecting sensitive electronics like computers, modems, or medical devices from data loss or interruption.\n- App Control: Many modern units offer Wi-Fi or Bluetooth connectivity, enabling remote monitoring of battery status, power usage, and adjustment of settings via a smartphone application.\n- Expandability: The option to add external battery packs to increase total energy storage is a valuable feature for future-proofing and adapting to growing needs, as seen in models from Jackery, Anker, Fossibot, and Oupes.\n- Recharging: AC wall charging is often the fastest method for many units, with some models like the DJI Power 500 achieving a full charge in 70 minutes and the EcoFlow River 3 in just 1 hour. Solar charging is a key feature for off-grid use. Some advanced models, like the Fossibot F3600 Pro 15 and Oupes Mega 1 38, support combined charging, using both AC and solar inputs simultaneously for the fastest possible recharge times.\n- Convenience Features: Built-in LED lights for illumination or emergency signaling, and wireless charging pads for compatible smartphones, add to user convenience.\nAll portable power stations compared\n| Manufacturer | Make | Model | Display Name | Price($) | Watt-hour spec | Size Category | Measured Usable Capacity(Wh) | Measured Usable Capacity(%) | Time to 100% Charge | Charging Metric(Wh/min) | Weight (lbs) | Battery Type | Wireless Charging | #of USBA | #of USBC | #of AC Outlets | DC ouputs? Cig or 5621 | App Enabled | Solar Input (W) | AC Voltage Output spec | AC Voltage output measured | Watts continuous spec | Watts surge spec | Charge Test Start Time | Charge Test 50% Time | Charge Test 80% Time | Charge Test 100% Time | Time to 50% Charge | Time to 80% Charge | Discharge Test Start Time | Discharge Test End Time | Discharge Test Elapsed Time | Discharge Test Observed Watts |\n|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|\n| Bluetti | AC | 2A Eco mode | Bluetti AC2A | 249 | 204.8 | S (<600) | 176.8 | 86.33 | 0:02:06 | 1.63 | 7.9 | LiFePO4 | No | 2 | 1 | 2 | Yes | Yes | 200 | 120 | 119.1 | 300 | 600 | 2023-10-26 12:12 | 2023-10-26 13:14 | 2023-10-26 13:51 | 2023-10-26 14:18 | 0:01:02 | 0:01:39 | 2023-10-26 10:27 | 2023-10-26 12:11 | 0:01:44 | 102 |\n| Runhood | Rallye | 1200 | Runhood Host Engine 1200 | 999 | 648 | M (600-1299) | 433.33 | 66.87 | 0:02:48 | 3.86 | 10.8 | Li-NMC | Yes | 2 | 2 | 3 | Yes | No | 180 | 120 | 120.4 | 1200 | 2400 | 2023-10-30 10:11 | 2023-10-30 11:15 | 2023-10-30 11:48 | 2023-10-30 12:59 | 0:01:04 | 0:01:37 | 2023-10-24 10:38 | 2023-10-24 12:48 | 0:02:10 | 200 |\n| Bluetti | AC | 2A Standard mode | Bluetti AC2A | 204.8 | S (<600) | 180.2 | 87.99 | 0:02:06 | 1.63 | 7.9 | LiFePO4 | No | 2 | 1 | 2 | Yes | Yes | 200 | 120 | 119.1 | 300 | 600 | 2023-10-26 10:38 | 2023-10-26 11:40 | 2023-10-26 12:16 | 2023-10-26 12:44 | 0:01:02 | 0:01:38 | 2023-10-26 14:20 | 2023-10-26 16:06 | 0:01:46 | 102 | |\n| Bluetti | AC | 2A Turbo mode | Bluetti AC2A | 179 | 204.8 | S (<600) | 180.2 | 87.99 | 0:01:09 | 2.97 | 7.9 | LiFePO4 | No | 2 | 2 | 2 | Yes | Yes | 200 | 120 | 119.1 | 300 | 600 | 2023-10-27 15:03 | 2023-10-27 15:32 | 2023-10-27 15:51 | 2023-10-27 16:12 | 0:00:29 | 0:00:48 | 2023-10-27 13:13 | 2023-10-27 14:59 | 0:01:46 | 102 |\n| Bluetti | AC | 70 Eco mode | Bluetti AC70 | 768 | M (600-1299) | 703.08 | 91.55 | 0:02:14 | 5.73 | 22.5 | LiFePO4 | No | 2 | 2 | 2 | No | Yes | 500 | 120 | 119.1 | 1000 | 2000 | 2023-10-31 9:43 | 2023-10-31 10:44 | 2023-10-31 11:15 | 2023-10-31 11:57 | 0:01:01 | 0:01:32 | 2023-10-31 11:30 | 2023-10-31 13:53 | 0:02:23 | 295 | |\n| Goal Zero | Yeti | 200X | Goal Zero Yeti 200X | 299.95 | 187 | S (<600) | 122.67 | 65.6 | 0:05:06 | 0.61 | 5 | Li-ion | No | 2 | 2 | 1 | Yes | No | 150 | 120 | 111 | 120 | 200 | Dec 30, 1899, 2:32:00 PM | Dec 30, 1899, 4:34:00 PM | Dec 30, 1899, 6:10:00 PM | Dec 30, 1899, 7:38:00 PM | 0:02:02 | 0:03:38 | Dec 30, 1899, 5:59:00 PM | Dec 30, 1899, 7:31:00 PM | 0:01:32 | 80 |\n| Renogy | Phoenix | 200 | Renogy Phoenix 200 | 209.99 | 222 | S (<600) | 212.87 | 95.89 | 0:04:23 | 0.84 | 5.3 | Li-ion | No | 3 | 1 | 2 | Yes | No | 60 | 120 | 115 | 200 | 400 | Dec 30, 1899, 10:15:00 AM | Dec 30, 1899, 1:11:00 PM | Dec 30, 1899, 1:52:00 PM | Dec 30, 1899, 2:38:00 PM | 0:02:56 | 0:03:37 | Dec 30, 1899, 2:40:00 PM | Dec 30, 1899, 4:44:00 PM | 0:02:04 | 103 |\n| Jackery | Explorer | 240 | Jackery Explorer 240 | 219.99 | 240 | S (<600) | 236.8 | 98.67 | 0:05:17 | 0.76 | 6.6 | Li-ion | No | 2 | 0 | 1 | Yes | No | 100 | 110 | 109 | 200 | 400 | Dec 30, 1899, 12:00:00 PM | Dec 30, 1899, 2:19:00 PM | Dec 30, 1899, 3:50:00 PM | Dec 30, 1899, 5:17:00 PM | 0:02:19 | 0:03:50 | Dec 30, 1899, 10:40:00 AM | Dec 30, 1899, 1:08:00 PM | 0:02:28 | 96 |\n| Bluetti | EB | 3A | Bluetti EB3A | 299 | 268.8 | S (<600) | 241.5 | 89.84 | 0:01:21 | 3.32 | 10.14 | LiFePO4 | Yes | 2 | 1 | 2 | Yes | Yes | 200 | 120 | 119.9 | 600 | 1200 | Dec 30, 1899, 12:00:00 PM | Dec 30, 1899, 12:34:00 PM | Dec 30, 1899, 12:54:00 PM | Dec 30, 1899, 1:21:00 PM | 0:00:34 | 0:00:54 | Dec 30, 1899, 10:30:00 AM | Dec 30, 1899, 11:40:00 AM | 0:01:10 | 207 |\n| Rockpals | N/A | 300W | Rockpals 300W | 299.99 | 280.8 | S (<600) | 220.5 | 78.53 | 0:04:28 | 1.05 | 7.7 | Li-ion | No | 3 | 1 | 1 | Yes | No | 100 | 110 | 106.2 | 300 | 500 | Dec 30, 1899, 2:32:00 PM | Dec 30, 1899, 4:06:00 PM | Dec 30, 1899, 5:29:00 PM | Dec 30, 1899, 7:00:00 PM | 0:01:34 | 0:02:57 | Dec 30, 1899, 5:59:00 PM | Dec 30, 1899, 8:26:00 PM | 0:02:27 | 90 |\n| BougeRV | Flash | 300 | BougeRV Flash 300 | 399.99 | 286 | S (<600) | 242.27 | 84.71 | 0:00:47 | 6.09 | 14.6 | Li-NMC | Yes | 3 | 1 | 2 | Yes | No | 600 | 115 | 109.6 | 600 | 1200 | 2023-08-15 16:23 | 2023-08-15 16:37 | 2023-08-15 16:45 | 2023-08-15 17:10 | 0:00:14 | 0:00:22 | 2023-08-15 14:56 | 2023-08-15 16:15 | 0:01:19 | 184 |\n| Enernova | ETA | 288 | Enernova ETA | 299 | 288 | S (<600) | 233.7 | 81.15 | 0:03:37 | 1.33 | 8.81 | LiFePO4 | No | 3 | 1 | 2 | Yes | No | 200 | 120 | 102 | 600 | 1100 | Dec 30, 1899, 12:14:00 PM | Dec 30, 1899, 12:52:00 PM | Dec 30, 1899, 1:22:00 PM | Dec 30, 1899, 3:51:00 PM | 0:00:38 | 0:01:08 | Dec 30, 1899, 10:39:00 AM | Dec 30, 1899, 1:23:00 PM | 0:02:44 | 85.5 |\n| Jackery | Explorer | 300 Plus | Jackery Explorer 300 Plus | 299.99 | 288 | S (<600) | 235.67 | 81.83 | 0:01:58 | 2.44 | 8.27 | LiFePO4 | No | 2 | 2 | 1 | Yes | No | 100 | 120 | 120.1 | 300 | 600 | Dec 30, 1899, 10:49:00 AM | Dec 30, 1899, 11:37:00 AM | Dec 30, 1899, 12:06:00 PM | Dec 30, 1899, 12:47:00 PM | 0:00:48 | 0:01:17 | Dec 30, 1899, 10:27:00 AM | Dec 30, 1899, 11:37:00 AM | 0:01:10 | 202 |\n| Monster | Power Grid | 300 | Monster P.G. 300 | 399 | 296 | S (<600) | 268.5 | 90.71 | 0:06:43 | 0.73 | 7.7 | Li-ion | Yes | 3 | 1 | 2 | Yes | No | 110 | 106.8 | 300 | 600 | Dec 30, 1899, 3:51:00 PM | Dec 30, 1899, 6:47:00 PM | Dec 30, 1899, 8:30:00 PM | Dec 30, 1899, 10:34:00 PM | 0:02:56 | 0:04:39 | Dec 30, 1899, 9:33:00 AM | Dec 30, 1899, 11:03:00 AM | 0:01:30 | 179 | |\n| Fanttik | EVO | 300 | Fantiik EVO 300 | 299.97 | 299 | S (<600) | 260 | 86.96 | 0:04:34 | 1.09 | 8.8 | Li-ion | No | 2 | 2 | 2 | Yes | No | 200 | 110 | 115.8 | 300 | 600 | Dec 30, 1899, 12:00:00 PM | Dec 30, 1899, 2:03:00 PM | Dec 30, 1899, 3:22:00 PM | Dec 30, 1899, 4:34:00 PM | 0:02:03 | 0:03:22 | Dec 30, 1899, 12:36:00 PM | Dec 30, 1899, 1:56:00 PM | 0:01:20 | 195 |\n| Togo | Power Advance | Togo-PST-A350 | Togo PST-A350 | 269.99 | 346 | S (<600) | 341.53 | 98.71 | 0:04:17 | 1.35 | 11 | Li-ion | Yes | 3 | 1 | 1 | Yes | No | 100 | 120 | 116.5 | 330 | Dec 30, 1899, 12:00:00 PM | Dec 30, 1899, 1:57:00 PM | Dec 30, 1899, 3:29:00 PM | Dec 30, 1899, 4:17:00 PM | 0:01:57 | 0:03:29 | Dec 30, 1899, 11:15:00 AM | Dec 30, 1899, 12:49:00 PM | 0:01:34 | 218 | |\n| 70mai | Hiker | 400 | 70mai Hiker 400 | 359.99 | 378 | S (<600) | 283.67 | 75.04 | 0:04:30 | 1.4 | 8.6 | Li-NMC | No | 3 | 1 | 2 | Yes | Yes | 120 | 110 | 109.8 | 400 | 800 | Dec 30, 1899, 12:07:00 PM | Dec 30, 1899, 2:29:00 PM | Dec 30, 1899, 3:55:00 PM | Dec 30, 1899, 4:37:00 PM | 0:02:22 | 0:03:48 | Dec 30, 1899, 10:18:00 AM | Dec 30, 1899, 11:50:00 AM | 0:01:32 | 185 |\n| Rocksolar | NOMAD | RS650 | Rocksolar NOMAD RS650 | 419 | 444 | S (<600) | 359.9 | 81.06 | 0:06:43 | 1.1 | 11 | Li-ion | No | 3 | 0 | 3 | Yes | No | 100 | 110 | 110.8 | 400 | 600 | Dec 30, 1899, 12:00:00 PM | Dec 30, 1899, 3:48:00 PM | Dec 30, 1899, 5:40:00 PM | Dec 30, 1899, 6:43:00 PM | 0:03:48 | 0:05:40 | Dec 30, 1899, 12:37:00 PM | Dec 30, 1899, 2:35:00 PM | 0:01:58 | 183 |\n| Duracell | Power | 500 | Duracell Power 500 | 599 | 515 | S (<600) | 372.9 | 72.41 | 0:04:56 | 1.74 | 13.4 | Li-ion | No | 3 | 1 | 2 | Yes | No | 200 | 120 | 119.3 | 500 | 1000 | Dec 30, 1899, 9:46:00 AM | Dec 30, 1899, 1:59:00 PM | Dec 30, 1899, 2:00:00 PM | Dec 30, 1899, 2:42:00 PM | 0:04:13 | 0:04:14 | Dec 30, 1899, 9:52:00 AM | Dec 30, 1899, 11:45:00 AM | 0:01:53 | 198 |\n| Bluetti | N/A | EB55 | Bluetti EB55 | 499 | 537 | S (<600) | 434.58 | 80.93 | 0:03:04 | 2.92 | 16.5 | LiFePO4 | Yes | 4 | 1 | 4 | Yes | No | 200 | 110 | 109 | 700 | 1400 | Dec 30, 1899, 12:00:00 PM | Dec 30, 1899, 1:39:00 PM | Dec 30, 1899, 2:22:00 PM | Dec 30, 1899, 3:04:00 PM | 0:01:39 | 0:02:22 | Dec 30, 1899, 11:12:00 AM | Dec 30, 1899, 1:41:00 PM | 0:02:29 | 175 |\n| BigBlue | Cellpowa | 500 | BigBlue Cellpowa 500 | 499.99 | 537.6 | S (<600) | 475.7 | 88.49 | 0:06:15 | 1.43 | 17.2 | LiFePO4 | No | 2 | 2 | 2 | Yes | No | 200 | 120 | 119.3 | 500 | 1000 | Dec 30, 1899, 12:00:00 PM | Dec 30, 1899, 2:57:00 PM | Dec 30, 1899, 4:25:00 PM | Dec 30, 1899, 6:15:00 PM | 0:02:57 | 0:04:25 | Dec 30, 1899, 2:31:00 PM | Dec 30, 1899, 4:53:00 PM | 0:02:22 | 201 |\n| Litheli | PowerHUB | B600 | Litheli PowerHUB B600 | 499.99 | 562 | S (<600) | 498.33 | 88.67 | 0:07:01 | 1.33 | 12.96 | Li-ion | Yes | 2 | 1 | 2 | Yes | No | 100 | 110 | 108.2 | 600 | 1200 | Dec 30, 1899, 12:20:00 PM | Dec 30, 1899, 3:25:00 PM | Dec 30, 1899, 5:10:00 PM | Dec 30, 1899, 7:21:00 PM | 0:03:05 | 0:04:50 | Dec 30, 1899, 10:57:00 AM | Dec 30, 1899, 12:52:00 PM | 0:01:55 | 260 |\n| Ecoflow | River | MAX | EcoFlow River MAX | 599 | 576 | S (<600) | 426.25 | 74 | 0:01:37 | 5.94 | 17 | Li-ion | No | 3 | 1 | 3 | Yes | No | 200 | 120 | 121 | 600 | 1200 | Dec 30, 1899, 12:00:00 PM | Dec 30, 1899, 12:34:00 PM | Dec 30, 1899, 12:58:00 PM | Dec 30, 1899, 1:37:00 PM | 0:00:34 | 0:00:58 | Dec 30, 1899, 12:38:00 PM | Dec 30, 1899, 2:11:00 PM | 0:01:33 | 275 |\n| Oupes | N/A | 600W | Oupes 600W | 349 | 595 | S (<600) | 495.55 | 83.29 | 0:06:52 | 1.44 | 15 | LiFePO4 | No | 2 | 1 | 2 | Yes | No | 100 | 110 | 109.4 | 600 | 1000 | Dec 30, 1899, 12:00:00 PM | Dec 30, 1899, 3:30:00 PM | Dec 30, 1899, 5:39:00 PM | Dec 30, 1899, 6:52:00 PM | 0:03:30 | 0:05:39 | Dec 30, 1899, 1:26:00 PM | Dec 30, 1899, 4:05:00 PM | 0:02:39 | 187 |\n| Encalife | N/A | UAF550 | Encalife UFA550 | 779.97 | 595 | S (<600) | 519.1 | 87.24 | 0:05:01 | 1.98 | 15.7 | LiFePO4 | No | 3 | 1 | 2 | Yes | No | 200 | 120 | 104 | 600 | 1100 | Dec 30, 1899, 9:37:00 AM | Dec 30, 1899, 12:05:00 PM | Dec 30, 1899, 1:37:00 PM | Dec 30, 1899, 2:38:00 PM | 0:02:28 | 0:04:00 | Dec 30, 1899, 10:17:00 AM | Dec 30, 1899, 1:16:00 PM | 0:02:59 | 174 |\n| BioLite | BaseCharge | 600 | BioLite BaseCharge 600 | 699 | 622 | M (600-1299) | 543.2 | 87.33 | 0:07:06 | 1.46 | 13 | Li-NMC | Yes | 2 | 2 | 2 | Yes | No | 120 | 110 | 109 | 600 | 1200 | Dec 30, 1899, 2:32:00 PM | Dec 30, 1899, 5:51:00 PM | Dec 30, 1899, 8:02:00 PM | Dec 30, 1899, 9:38:00 PM | 0:03:19 | 0:05:30 | Dec 30, 1899, 5:59:00 PM | Dec 30, 1899, 7:51:00 PM | 0:01:52 | 291 |\n| Energizer | N/A | PPS700 | Energizer PPS700 | 399 | 626 | M (600-1299) | 479.75 | 76.64 | 0:06:36 | 1.58 | 12 | Li-NMC | No | 4 | 1 | 1 | Yes | No | 100 | 110 | 113 | 600 | 1200 | Dec 30, 1899, 12:00:00 PM | Dec 30, 1899, 3:41:00 PM | Dec 30, 1899, 5:28:00 PM | Dec 30, 1899, 6:36:00 PM | 0:03:41 | 0:05:28 | Dec 30, 1899, 1:16:00 PM | Dec 30, 1899, 2:51:00 PM | 0:01:35 | 303 |\n| Runhood | Rallye | 600 | Runhood Rallye 600 | 739 | 648 | M (600-1299) | 528.83 | 81.61 | 0:04:38 | 2.33 | 16.2 | Li-NMC | Yes | 2 | 1 | 2 | Yes | No | 200 | 110 | 110.1 | 600 | 1200 | Dec 30, 1899, 12:10:00 AM | Dec 30, 1899, 2:05:00 AM | Dec 30, 1899, 2:52:00 AM | Dec 30, 1899, 4:48:00 AM | 0:01:55 | 0:02:42 | Dec 30, 1899, 12:07:00 PM | Dec 30, 1899, 2:54:00 PM | 0:02:47 | 190 |\n| Oscal | PowerMax | 700 | Oscal PowerMax 700 | 469 | 666 | M (600-1299) | 511 | 76.73 | 0:05:30 | 2.02 | 16.5 | Li-ion | Yes | 4 | 2 | 2 | Yes | No | 150 | 110 | 108 | 700 | 1400 | Dec 30, 1899, 2:37:00 PM | Dec 30, 1899, 4:53:00 PM | Dec 30, 1899, 6:31:00 PM | Dec 30, 1899, 8:07:00 PM | 0:02:16 | 0:03:54 | Dec 30, 1899, 3:01:00 PM | Dec 30, 1899, 4:25:00 PM | 0:01:24 | 365 |\n| Ugreen | Power Roam | 600 | Ugreen P.R. 600 | 499 | 680 | M (600-1299) | 541.2 | 79.59 | 0:01:38 | 6.94 | 19.8 | LiFePO4 | No | 2 | 2 | 5 | Yes | Yes | 200 | 120 | 120.1 | 600 | 1500 | Dec 30, 1899, 11:51:00 AM | Dec 30, 1899, 12:40:00 PM | Dec 30, 1899, 1:09:00 PM | Dec 30, 1899, 1:29:00 PM | 0:00:49 | 0:01:18 | Dec 30, 1899, 12:44:00 PM | Dec 30, 1899, 3:28:00 PM | 0:02:44 | 198 |\n| Jackery | Explorer | 700 Plus | Jackery Explorer 700 Plus | 799 | 680.96 | M (600-1299) | 599.65 | 88.06 | 0:01:39 | 6.88 | 22.05 | 120 | 119.9 | 1000 | 2000 | Dec 30, 1899, 11:43:00 AM | Dec 30, 1899, 12:20:00 PM | Dec 30, 1899, 12:50:00 PM | Dec 30, 1899, 1:22:00 PM | 0:00:37 | 0:01:07 | Dec 30, 1899, 1:26:00 PM | Dec 30, 1899, 4:25:00 PM | 0:02:59 | 201 | ||||||||\n| EcoFlow | River 2 | PRO | EcoFlow R2 Pro | 749 | 768 | M (600-1299) | 634.25 | 82.58 | 0:01:09 | 11.13 | 17.2 | LiFePO4 | 220 | 120 | 111.3 | 800 | 1600 | Dec 30, 1899, 12:36:00 PM | Dec 30, 1899, 1:05:00 PM | Dec 30, 1899, 1:25:00 PM | Dec 30, 1899, 1:45:00 PM | 0:00:29 | 0:00:49 | Dec 30, 1899, 4:35:00 PM | Dec 30, 1899, 6:44:00 PM | 0:02:09 | 295 | ||||||\n| Ecoflow | Delta | Mini | EcoFlow Delta Mini | 999 | 882 | M (600-1299) | 760 | 86.17 | 0:01:37 | 9.09 | 23.6 | 120 | 118.2 | Dec 30, 1899, 12:00:00 PM | Dec 30, 1899, 12:35:00 PM | Dec 30, 1899, 12:59:00 PM | Dec 30, 1899, 1:37:00 PM | 0:00:35 | 0:00:59 | Dec 30, 1899, 11:34:00 AM | Dec 30, 1899, 2:14:00 PM | 0:02:40 | 285 | ||||||||||\n| Encalife | N/A | UAF1100 | Encalife UFA1100 | 1294.97 | 992 | M (600-1299) | 837.6 | 84.44 | 0:04:56 | 3.35 | 24.7 | 120 | 103.8 | 600 | 1100 | Dec 30, 1899, 10:25:00 AM | Dec 30, 1899, 12:49:00 PM | Dec 30, 1899, 2:17:00 PM | Dec 30, 1899, 3:21:00 PM | 0:02:24 | 0:03:52 | Dec 30, 1899, 10:18:00 AM | Dec 30, 1899, 12:42:00 PM | 0:02:24 | 349 | ||||||||\n| Renogy | PPS | 1000 | Renogy 1000 | 729.99 | 998.4 | M (600-1299) | 805.1 | 80.64 | 0:01:37 | 10.29 | 41 | 120 | 119.6 | 1500 | 3000 | Dec 30, 1899, 9:47:00 AM | Dec 30, 1899, 10:21:00 AM | Dec 30, 1899, 10:40:00 AM | Dec 30, 1899, 11:24:00 AM | 0:00:34 | 0:00:53 | Dec 30, 1899, 11:08:00 AM | Dec 30, 1899, 12:45:00 PM | 0:01:37 | 498 | ||||||||\n| Jackery | Explorer | 1000 Pro | Jackery Explorer 1000 Pro | 999 | 1002 | M (600-1299) | 895.93 | 89.41 | 0:01:44 | 9.63 | 25.4 | 2 | 2 | 3 | 800 | 120 | 119.8 | 1000 | 2000 | Dec 30, 1899, 12:11:00 PM | Dec 30, 1899, 12:55:00 PM | Dec 30, 1899, 1:22:00 PM | Dec 30, 1899, 1:55:00 PM | 0:00:44 | 0:01:11 | Dec 30, 1899, 2:07:00 PM | Dec 30, 1899, 5:05:00 PM | 0:02:58 | 302 | ||||\n| Geneverse | HomePower | ONE | Geneverse HomePower ONE | 999 | 1002 | M (600-1299) | 911.8 | 91 | 0:07:44 | 2.16 | 23.37 | 110 | 110.6 | Dec 30, 1899, 12:00:00 PM | Dec 30, 1899, 3:30:00 PM | Dec 30, 1899, 5:46:00 PM | Dec 30, 1899, 7:44:00 PM | 0:03:30 | 0:05:46 | Dec 30, 1899, 10:42:00 AM | Dec 30, 1899, 1:56:00 PM | 0:03:14 | 282 | ||||||||||\n| EcoFlow | Delta | 2 | EcoFlow Delta 2 | 999 | 1024 | M (600-1299) | 716.55 | 69.98 | 0:01:26 | 11.91 | 27 | LiFePO4 | 2 | 2 | 6 | 500 | 120 | 120.1 | 1800 | Dec 30, 1899, 11:15:00 AM | Dec 30, 1899, 11:50:00 AM | Dec 30, 1899, 12:09:00 PM | Dec 30, 1899, 12:41:00 PM | 0:00:35 | 0:00:54 | Dec 30, 1899, 5:13:00 PM | Dec 30, 1899, 7:46:00 PM | 0:02:33 | 281 | ||||\n| Phyleko | ENF1000S | N/A | Phyleko ENF1000S | 999 | 1024 | M (600-1299) | 807.35 | 78.84 | 0:05:36 | 3.05 | 28 | LiFePO4 | 120 | 104 | 1000 | Dec 30, 1899, 12:12:00 PM | Dec 30, 1899, 2:58:00 PM | Dec 30, 1899, 4:40:00 PM | Dec 30, 1899, 5:48:00 PM | 0:02:46 | 0:04:28 | Dec 30, 1899, 9:41:00 AM | Dec 30, 1899, 1:02:00 PM | 0:03:21 | 241 | ||||||||\n| Anker | SOLIX | F1200 | Anker PowerHouse 555 | 899.99 | 1024 | M (600-1299) | 966 | 94.34 | 0:06:01 | 2.84 | 29.8 | LiFePO4 | 2 | 3 | 6 | 110 | 109.3 | 1000 | Dec 30, 1899, 11:15:00 AM | Dec 30, 1899, 2:09:00 PM | Dec 30, 1899, 3:54:00 PM | Dec 30, 1899, 5:16:00 PM | 0:02:54 | 0:04:39 | Dec 30, 1899, 8:34:00 AM | Dec 30, 1899, 12:04:00 PM | 0:03:30 | 276 | |||||\n| Deeno GT | x1500 | N/A | Deeno GT x1500 | 799 | 1036 | M (600-1299) | 725 | 69.98 | 0:05:55 | 2.92 | 32.6 | LiFePO4 | 200 | 120 | 111.5 | 1500 | 3000 | Dec 30, 1899, 2:37:00 PM | Dec 30, 1899, 5:29:00 PM | Dec 30, 1899, 7:15:00 PM | Dec 30, 1899, 8:32:00 PM | 0:02:52 | 0:04:38 | Dec 30, 1899, 4:04:00 PM | Dec 30, 1899, 6:00:00 PM | 0:01:56 | 375 | ||||||\n| Deeno | GT | S1500 | Deeno GT S1500 | 799 | 1036 | M (600-1299) | 915.08 | 88.33 | 0:01:27 | 11.91 | 32.4 | 120 | 118.7 | 1500 | 3000 | Dec 30, 1899, 11:47:00 AM | Dec 30, 1899, 12:30:00 PM | Dec 30, 1899, 12:56:00 PM | Dec 30, 1899, 1:14:00 PM | 0:00:43 | 0:01:09 | Dec 30, 1899, 1:27:00 PM | Dec 30, 1899, 3:46:00 PM | 0:02:19 | 395 | ||||||||\n| 70mai | Tera | 1000 | 70mai Tera 1000 | 989 | 1043.9 | M (600-1299) | 874.2 | 83.74 | 0:04:12 | 4.14 | 27.5 | 120 | 110.4 | 1200 | 2400 | Dec 30, 1899, 11:15:00 AM | Dec 30, 1899, 1:15:00 PM | Dec 30, 1899, 2:27:00 PM | Dec 30, 1899, 3:27:00 PM | 0:02:00 | 0:03:12 | Dec 30, 1899, 10:28:00 AM | Dec 30, 1899, 12:49:00 PM | 0:02:21 | 372 | ||||||||\n| Enernova | ETA | Pro | EnernovaETA Pro 1200W | 999 | 1050 | M (600-1299) | 882.08 | 84.01 | 0:01:36 | 10.94 | 35.27 | 120 | 109.6 | 1200 | 1800 | Dec 30, 1899, 10:25:00 AM | Dec 30, 1899, 11:05:00 AM | Dec 30, 1899, 11:30:00 AM | Dec 30, 1899, 12:01:00 PM | 0:00:40 | 0:01:05 | Dec 30, 1899, 12:12:00 PM | Dec 30, 1899, 2:37:00 PM | 0:02:25 | 365 | ||||||||\n| Anker | Solix | C1000 | Anker Solix C1000 | 999 | 1056 | M (600-1299) | 939.57 | 88.97 | 0:01:31 | 11.6 | 28.4 | LiFePO4 | No | 2 | 2 | 6 | Yes | Yes | 120 | 119.5 | 1800 | 2400 | 2023-09-26 9:33 | 2023-09-26 10:17 | 2023-09-26 10:40 | 2023-09-26 11:04 | 0:00:44 | 0:01:07 | 2023-09-26 9:32 | 2023-09-26 11:54 | 0:02:22 | 397 | |\n| GoSun | PowerBank | 1100 | GoSun PowerBank 1100 | 1499 | 1100 | M (600-1299) | 997.33 | 90.67 | 0:11:37 | 1.58 | 25.4 | 110 | 103.5 | 1200 | 2000 | Dec 30, 1899, 12:00:00 PM | Dec 30, 1899, 5:27:00 PM | Dec 30, 1899, 9:05:00 PM | Dec 30, 1899, 11:37:00 PM | 0:05:27 | 0:09:05 | Dec 30, 1899, 1:14:00 PM | Dec 30, 1899, 4:04:00 PM | 0:02:50 | 352 | ||||||||\n| BougeRV | Fort 1000 | N/A | BougeRV | 999.99 | 1120 | M (600-1299) | 1015.3 | 90.65 | 0:06:05 | 3.07 | 28.7 | LiFePO4 | 200 | 110 | 113.7 | 1200 | 2000 | Dec 30, 1899, 1:15:00 PM | Dec 30, 1899, 4:21:00 PM | Dec 30, 1899, 6:13:00 PM | Dec 30, 1899, 7:20:00 PM | 0:03:06 | 0:04:58 | Dec 30, 1899, 1:21:00 PM | Dec 30, 1899, 4:54:00 PM | 0:03:33 | 286 | ||||||\n| Bluetti | N/A | AC180 | Bluetti AC180 | 799 | 1152 | M (600-1299) | 1020.42 | 88.58 | 0:01:23 | 13.88 | 35.27 | 120 | 119.5 | 1800 | Dec 30, 1899, 10:25:00 AM | Dec 30, 1899, 11:02:00 AM | Dec 30, 1899, 11:24:00 AM | Dec 30, 1899, 11:48:00 AM | 0:00:37 | 0:00:59 | Dec 30, 1899, 1:01:00 PM | Dec 30, 1899, 3:36:00 PM | 0:02:35 | 395 | |||||||||\n| Geneverse | HomePower | One PRO | Geneverse HP One PRO | 1499 | 1210 | M (600-1299) | 886.9 | 73.3 | 0:02:00 | 10.08 | 38.36 | LiFePO4 | 2 | 2 | 3 | 800 | 120 | 119 | 1200 | 2400 | Dec 30, 1899, 3:40:00 PM | Dec 30, 1899, 4:31:00 PM | Dec 30, 1899, 5:04:00 PM | Dec 30, 1899, 5:40:00 PM | 0:00:51 | 0:01:24 | Dec 30, 1899, 2:25:00 PM | Dec 30, 1899, 5:26:00 PM | 0:03:01 | 294 | |||\n| Anker | PowerHouse | 757 | Anker SOLIX F1200 | 799.99 | 1229 | M (600-1299) | 1055.6 | 85.89 | 0:01:28 | 13.97 | 43.9 | 4 | 2 | 6 | 110 | 109.1 | 320 | Dec 30, 1899, 12:00:00 PM | Dec 30, 1899, 12:40:00 PM | Dec 30, 1899, 1:03:00 PM | Dec 30, 1899, 1:28:00 PM | 0:00:40 | 0:01:03 | Dec 30, 1899, 10:29:00 AM | Dec 30, 1899, 2:21:00 PM | 0:03:52 | 273 | ||||||\n| Jackery | Explorer | 1000 Plus | Jackery Explorer 1000 Plus | 1199 | 1264.64 | M (600-1299) | 1011.33 | 79.97 | 0:01:40 | 12.65 | 32 | 120 | 119 | 2000 | 4000 | Dec 30, 1899, 10:28:00 AM | Dec 30, 1899, 11:04:00 AM | Dec 30, 1899, 11:32:00 AM | Dec 30, 1899, 12:08:00 PM | 0:00:36 | 0:01:04 | Dec 30, 1899, 9:48:00 AM | Dec 30, 1899, 1:13:00 PM | 0:03:25 | 296 | ||||||||\n| Jackery | Explorer | 1500 Pro | Jackery Explorer 1500 Pro | 1699 | 1512 | L (1300-2199) | 1365 | 90.28 | 0:02:00 | 12.6 | 37.48 | Li-ion | 2 | 2 | 3 | 1400 | 120 | 120.3 | 1800 | 3600 | Dec 30, 1899, 1:58:00 PM | Dec 30, 1899, 2:48:00 PM | Dec 30, 1899, 3:13:00 PM | Dec 30, 1899, 3:58:00 PM | 0:00:50 | 0:01:15 | Dec 30, 1899, 3:57:00 PM | Dec 30, 1899, 8:30:00 PM | 0:04:33 | 300 | |||\n| BiolLite | BaseCharge | 1500 | BioLite BaseCharge 1500 | 1699 | 1521 | L (1300-2199) | 1339.03 | 88.04 | 0:12:56 | 1.96 | 26.5 | Li-ion | 2 | 3 | 3 | 400 | 110 | 109.6 | 1200 | 2200 | Dec 30, 1899, 12:00:00 AM | Dec 30, 1899, 6:33:00 AM | Dec 30, 1899, 11:02:00 AM | Dec 30, 1899, 12:56:00 PM | 0:06:33 | 0:11:02 | Dec 30, 1899, 7:21:00 PM | Dec 30, 1899, 11:59:00 PM | 0:04:38 | 289 | |||\n| VTOMAN | Flashspeed | 1500 | VTOMAN FlashSpeed 1500 | 1699.99 | 1548 | L (1300-2199) | 1271 | 82.11 | 0:01:04 | 24.19 | 41.4 | 110 | 112.4 | 1500 | 3000 | Dec 30, 1899, 10:04:00 AM | Dec 30, 1899, 10:30:00 AM | Dec 30, 1899, 10:48:00 AM | Dec 30, 1899, 11:08:00 AM | 0:00:26 | 0:00:44 | Dec 30, 1899, 12:51:00 PM | Dec 30, 1899, 3:35:00 PM | 0:02:44 | 465 | ||||||||\n| Pecron | E | 2000 | Pecron E2000 | 1499 | 1929 | L (1300-2199) | 1806.7 | 93.66 | 0:03:31 | 9.14 | 48.5 | LiFePO4 | 1300 | 120 | 121 | 2000 | 4000 | Dec 30, 1899, 4:12:00 PM | Dec 30, 1899, 6:03:00 PM | Dec 30, 1899, 7:04:00 PM | Dec 30, 1899, 7:43:00 PM | 0:01:51 | 0:02:52 | Dec 30, 1899, 4:40:00 PM | Dec 30, 1899, 9:07:00 PM | 0:04:27 | 406 | ||||||\n| Bluetti | N/A | AC200P | Bluetti AC200P | 1599 | 2000 | L (1300-2199) | 1914.08 | 95.7 | 0:04:51 | 6.87 | 60.6 | 120 | 119.9 | 2000 | 4800 | Dec 30, 1899, 12:00:00 PM | Dec 30, 1899, 2:00:00 PM | Dec 30, 1899, 3:25:00 PM | Dec 30, 1899, 4:51:00 PM | 0:02:00 | 0:03:25 | Dec 30, 1899, 10:04:00 AM | Dec 30, 1899, 1:47:00 PM | 0:03:43 | 515 | ||||||||\n| Jackery | Explorer | 2000 Plus | Jackery Ex 2000 Plus | 2199 | 2042.8 | L (1300-2199) | 1800.33 | 88.13 | 0:01:55 | 17.76 | 61.5 | LiFePO4 | 1400 | 120 | 119.5 | 3000 | 6000 | Dec 30, 1899, 10:32:00 AM | Dec 30, 1899, 11:20:00 AM | Dec 30, 1899, 11:50:00 AM | Dec 30, 1899, 12:27:00 PM | 0:00:48 | 0:01:18 | Dec 30, 1899, 9:47:00 AM | Dec 30, 1899, 1:27:00 PM | 0:03:40 | 491 | ||||||\n| EcoFlow | Delta | 2 MAX | EcoFlow Delta 2 Max | 2697 | 2048 | L (1300-2199) | 1847.27 | 90.2 | 0:01:38 | 20.9 | 50.7 | LiFePO4 | 1000 | 120 | 121.9 | 2400 | 4800 | Dec 30, 1899, 9:52:00 AM | Dec 30, 1899, 10:38:00 AM | Dec 30, 1899, 11:04:00 AM | Dec 30, 1899, 11:30:00 AM | 0:00:46 | 0:01:12 | Dec 30, 1899, 12:35:00 PM | Dec 30, 1899, 4:24:00 PM | 0:03:49 | 484 | ||||||\n| Anker | SOLIX | F2000 | Anker PowerHouse 767 | 1999 | 2048 | L (1300-2199) | 1847.27 | 90.2 | 0:02:00 | 17.07 | 67.2 | LiFePO4 | 2 | 3 | 4 | 1000 | 120 | 119 | 2400 | Dec 30, 1899, 8:02:00 PM | Dec 30, 1899, 9:02:00 PM | Dec 30, 1899, 9:29:00 PM | Dec 30, 1899, 10:02:00 PM | 0:01:00 | 0:01:27 | Dec 30, 1899, 4:28:00 PM | Dec 30, 1899, 8:17:00 PM | 0:03:49 | 484 | ||||\n| Bluetti | AC200 | MAX | Bluetti AC200 MAX | 1599 | 2048 | L (1300-2199) | 1756.8 | 85.78 | 0:04:40 | 7.31 | 61.9 | LiFePO4 | 900 | 120 | 120.8 | 2200 | 4800 | Dec 30, 1899, 10:37:00 AM | Dec 30, 1899, 12:37:00 PM | Dec 30, 1899, 1:54:00 PM | Dec 30, 1899, 3:17:00 PM | 0:02:00 | 0:03:17 | Dec 30, 1899, 10:09:00 AM | Dec 30, 1899, 1:45:00 PM | 0:03:36 | 488 | ||||||\n| Encalife | N/A | YUE2000 | Encalife YUE2000 | 3719.97 | 2048 | L (1300-2199) | 1505.4 | 73.51 | 0:03:04 | 11.13 | 52.9 | 120 | 113.2 | 2000 | 4000 | Dec 30, 1899, 11:18:00 AM | Dec 30, 1899, 12:56:00 PM | Dec 30, 1899, 1:35:00 PM | Dec 30, 1899, 2:22:00 PM | 0:01:38 | 0:02:17 | Dec 30, 1899, 9:35:00 AM | Dec 30, 1899, 12:48:00 PM | 0:03:13 | 468 | ||||||||\n| Daranener | NEO 2000 | 2000 | DaranEner NEO2000 | 1499 | 2073.6 | L (1300-2199) | 1749.88 | 84.39 | 0:01:46 | 19.56 | 56.4 | LiFePO4 | 600 | 110 | 112.9 | 2000 | 3000 | Dec 30, 1899, 3:48:00 PM | Dec 30, 1899, 4:44:00 PM | Dec 30, 1899, 5:19:00 PM | Dec 30, 1899, 5:34:00 PM | 0:00:56 | 0:01:31 | Dec 30, 1899, 12:37:00 PM | Dec 30, 1899, 6:48:00 PM | 0:06:11 | 283 | ||||||\n| Zendure | SuperBase Pro | 2000 | Zendure SuperBase Pro 2000 | 1799 | 2096 | L (1300-2199) | 1851.67 | 88.34 | 0:01:59 | 17.61 | 46.5 | Li-NMC | 4 | 6 | 2400 | 110 | 108 | 2000 | 4000 | Dec 30, 1899, 9:08:00 PM | Dec 30, 1899, 9:59:00 PM | Dec 30, 1899, 10:29:00 PM | Dec 30, 1899, 11:07:00 PM | 0:00:51 | 0:01:21 | Dec 30, 1899, 11:18:00 AM | Dec 30, 1899, 6:02:00 PM | 0:06:44 | 275 | ||||\n| Jackery | Explorer | 2000 Pro | Jackery Explorer 2000 Pro | 2099 | 2160 | L (1300-2199) | 1866.2 | 86.4 | 0:01:57 | 18.46 | 43 | Li-ion | 2 | 2 | 3 | 1400 | 120 | 120.4 | 2200 | 4400 | Dec 30, 1899, 11:15:00 AM | Dec 30, 1899, 12:01:00 PM | Dec 30, 1899, 12:30:00 PM | Dec 30, 1899, 1:12:00 PM | 0:00:46 | 0:01:15 | Dec 30, 1899, 8:34:00 AM | Dec 30, 1899, 2:46:00 PM | 0:06:12 | 301 | |||\n| Enernova | ETA | Ultra | Enernova ETA Ultra 2000W | 1799 | 2160 | L (1300-2199) | 1887.97 | 87.41 | 0:01:54 | 18.95 | 55.1 | 120 | 108.7 | 2000 | 4000 | Dec 30, 1899, 10:20:00 AM | Dec 30, 1899, 11:09:00 AM | Dec 30, 1899, 11:38:00 AM | Dec 30, 1899, 12:14:00 PM | 0:00:49 | 0:01:18 | Dec 30, 1899, 10:25:00 AM | Dec 30, 1899, 1:54:00 PM | 0:03:29 | 542 | ||||||||\n| Dabbsson | N/A | DBS2300 | Dabbsson DBS2300 Fast charge | 1299 | 2330 | XL (2200+) | 2007.2 | 86.15 | 0:02:02 | 19.1 | 57.8 | LiFePO4 | No | 3 | 3 | 4 | Yes | Yes | 800 | 120 | 118.7 | 2200 | 4400 | 2024-01-03 13:30 | 2024-01-03 14:24 | 2024-01-03 15:02 | 2024-01-03 15:32 | 0:00:54 | 0:01:32 | Dec 30, 1899, 2:29:00 PM | Dec 30, 1899, 5:57:00 PM | 0:03:28 | 579 |\n| Yoshino | N/A | B4000 SST | Yoshino B4000 SST | 3299 | 2611 | XL (2200+) | 2284.67 | 87.5 | 0:01:52 | 23.31 | 55.1 | Li-ion | Yes | 2 | 2 | 2 | Yes | Yes | 600 | 120 | 118.7 | 4000 | 6000 | Dec 30, 1899, 3:20:00 PM | Dec 30, 1899, 4:07:00 PM | Dec 30, 1899, 4:48:00 PM | Dec 30, 1899, 5:12:00 PM | 0:00:47 | 0:01:28 | Dec 30, 1899, 12:49:00 PM | Dec 30, 1899, 4:39:00 PM | 0:03:50 | 596 |\n| Jackery | Explorer | 3000 Pro | Jacker Explorer 3000 Pro | 2799 | 3024 | XL (2200+) | 2443.75 | 80.81 | 0:02:25 | 20.86 | 63.93 | Li-ion | 2 | 2 | 4 | 120 | Dec 30, 1899, 12:02:00 PM | Dec 30, 1899, 12:59:00 PM | Dec 30, 1899, 1:40:00 PM | Dec 30, 1899, 2:27:00 PM | 0:00:57 | 0:01:38 | Dec 30, 1899, 12:09:00 PM | Dec 30, 1899, 4:24:00 PM | 0:04:15 | 575 | |||||||\n| Mango | Power E | N/A | Mango Power E | 3999 | 3530 | XL (2200+) | 3175 | 89.94 | 0:02:40 | 22.06 | 100 | LiFePO4 | 2000 | 120 | 122.5 | 3000 | 4800 | Dec 30, 1899, 3:50:00 PM | Dec 30, 1899, 5:05:00 PM | Dec 30, 1899, 5:49:00 PM | Dec 30, 1899, 6:30:00 PM | 0:01:15 | 0:01:59 | Dec 30, 1899, 6:35:00 AM | Dec 30, 1899, 12:50:00 PM | 0:06:15 | 508 | ||||||\n| EcoFlow | Delta | Pro | EcoFlow Delta Pro | 3699 | 3600 | XL (2200+) | 3328.32 | 92.45 | 0:02:39 | 22.64 | 99.2 | LiFePO4 | 2 | 2 | 5 | 1600 | 120 | 120.7 | 3600 | 7200 | Dec 30, 1899, 9:35:00 AM | Dec 30, 1899, 10:56:00 AM | Dec 30, 1899, 11:46:00 AM | Dec 30, 1899, 12:14:00 PM | 0:01:21 | 0:02:11 | Dec 30, 1899, 10:15:00 AM | Dec 30, 1899, 3:04:00 PM | 0:04:49 | 691 | |||\n| Oupes | Mega | 5 | Oupes Mega 5 | 3299 | 5040 | XL (2200+) | 4568.18 | 90.64 | 0:03:34 | 23.55 | 112.4 | LiFePO4 | No | 4 | 2 | 5 | Yes | Yes | 2100 | 120 | 120.1 | 4000 | 7000 | Dec 30, 1899, 9:29:00 AM | Dec 30, 1899, 11:10:00 AM | Dec 30, 1899, 12:16:00 PM | Dec 30, 1899, 1:03:00 PM | 0:01:41 | 0:02:47 | Dec 30, 1899, 9:32:00 AM | Dec 30, 1899, 4:03:00 PM | 0:06:31 | 701 |\n| Bluetti | AC | 70 standard mode | Bluetti AC70 | 768 | M (600-1299) | 717.83 | 93.47 | 0:02:13 | 5.77 | 22.5 | LiFePO4 | Yes | 2 | 2 | 2 | Yes | Yes | 500 | 120 | 119 | 1000 | 2000 | 2023-11-01 11:26 | 2023-11-01 12:26 | 2023-11-01 12:58 | 2023-11-01 13:39 | 0:01:00 | 0:01:32 | 2023-11-02 11:59 | 2023-11-02 14:25 | 0:02:26 | 295 | |\n| Bluetti | AC | 70 Turbo mode | Bluetti AC70 | 329 | 768 | M (600-1299) | 712.92 | 92.83 | 0:01:29 | 8.63 | 22.5 | LiFePO4 | No | 2 | 2 | 2 | Yes | Yes | 500 | 120 | 119.1 | 1000 | 2000 | 2023-11-03 10:35 | 2023-11-03 11:03 | 2023-11-03 11:08 | 2023-11-03 12:04 | 0:00:28 | 0:00:33 | 2023-11-03 13:40 | 2023-11-03 16:05 | 0:02:25 | 295 |\n| Oukitel | BP | 2000 slow charge | Oukitel BP2000 | 1845 | 2048 | L (1300-2199) | 1843.47 | 90.01 | 0:03:50 | 8.9 | 52.91 | LiFePO4 | No | 4 | 2 | 4 | Yes | No | 1000 | 120 | 118.8 | 2200 | 4000 | 2023-11-07 10:45 | 2023-11-07 12:36 | 2023-11-07 13:43 | 2023-11-07 14:35 | 0:01:51 | 0:02:58 | 2023-11-06 11:09 | 2023-11-06 14:52 | 0:03:43 | 496 |\n| Oukitel | BP | 2000 | Oukitel BP2000 | 1899 | 2048 | L (1300-2199) | 1860 | 90.82 | 0:01:54 | 17.96 | 52.91 | LiFePO4 | No | 4 | 2 | 4 | Yes | No | 1000 | 120 | 118.8 | 2200 | 4000 | 2023-11-13 9:42 | 2023-11-13 10:38 | 2023-11-13 11:00 | 2023-11-13 11:36 | 0:00:56 | 0:01:18 | 2023-11-10 11:25 | 2023-11-10 15:10 | 0:03:45 | 496 |\n| Runhood | Energy Bar | 324 | Runhood Energy Bar 324 | 299 | 324 | S (<600) | 253.53 | 78.25 | 0:06:35 | 0.82 | 3.9 | Li-NMC | No | 2 | 2 | 1 | No | No | 110 | 109.8 | 80 | 160 | 2023-11-14 9:45 | 2023-11-14 12:46 | 2023-11-14 14:21 | 2023-11-14 16:20 | 0:03:01 | 0:04:36 | 2023-11-13 14:28 | 2023-11-13 18:05 | 0:03:37 | 70.1 | |\n| Oukitel | BP | 2000 W/Smart Expansion battery Fast charge mode | Oukitel BP2000 W/Smart Expansion battery | 2334.4 | 4096 | XL (2200+) | 3630.8 | 88.64 | 0:03:28 | 19.69 | 93 | LiFePO4 | No | 5 | 3 | 4 | Yes | No | 1000 | 120 | 119 | 2200 | 4000 | 2023-11-15 10:30 | 2023-11-15 12:00 | 2023-11-15 13:03 | 2023-11-15 13:58 | 0:01:30 | 0:02:33 | 2023-11-14 10:08 | 2023-11-14 15:21 | 0:05:13 | 696 |\n| Duracell | M250 | MBA250W | Duracell M250 | 299 | 219 | S (<600) | 164.37 | 75.06 | 0:04:14 | 0.86 | 4.5 | Yes | 2 | 2 | 1 | No | No | 120 | 114.5 | 100 | 2023-11-30 9:23 | 2023-11-30 10:56 | 2023-11-30 11:22 | 2023-11-30 13:37 | 0:01:33 | 0:01:59 | 2023-11-27 16:06 | 2023-11-27 20:34 | 0:04:28 | 36.8 | |||\n| Oukitel | BP | 2000/W Smart expansion battery Slow charge | Oukitel BP2000/ W Expansion Battery | 2334.4 | 4096 | XL (2200+) | 3684.45 | 89.95 | 0:07:31 | 9.08 | 93 | LiFePO4 | No | 5 | 3 | 4 | Yes | No | 1000 | 120 | 118.7 | 2200 | 4000 | 2023-11-27 9:38 | 2023-11-27 13:19 | 2023-11-27 15:30 | 2023-11-27 17:09 | 0:03:41 | 0:05:52 | 2023-11-24 10:01 | 2023-11-24 15:20 | 0:05:19 | 693 |\n| Power Cache | N/A | 300 | Power Cache 300 | 199.99 | 293.76 | S (<600) | 265.95 | 90.53 | 0:07:14 | 0.68 | 7.9 | Li-ion | No | 2 | 1 | 1 | Yes | No | 100 | 120 | 120.3 | 300 | 600 | 2023-12-05 10:23 | 2023-12-05 12:35 | 2023-12-05 13:52 | 2023-12-05 17:37 | 0:02:12 | 0:03:29 | 2023-12-04 15:00 | 2023-12-04 16:21 | 0:01:21 | 197 |\n| Power Cache | N/A | 600 | Power Cache 600 | 399.99 | 642.6 | M (600-1299) | 460 | 71.58 | 0:08:01 | 1.34 | 15.4 | Li-ion | No | 2 | 1 | 2 | Yes | No | 400 | 120 | 121.5 | 600 | 1200 | 2023-12-05 10:23 | 2023-12-05 14:00 | 2023-12-05 16:30 | 2023-12-05 18:24 | 0:03:37 | 0:06:07 | 2023-12-04 13:42 | 2023-12-04 14:51 | 0:01:09 | 400 |\n| Power Cache | N/A | 1000 | Power Cache 1000 | 799.99 | 1075 | M (600-1299) | 885 | 82.33 | 0:07:10 | 2.5 | 23.1 | Li-ion | No | 2 | 1 | 2 | Yes | No | 400 | 120 | 119.1 | 1000 | 2000 | 2023-12-12 9:48 | 2023-12-12 13:00 | 2023-12-12 14:58 | 2023-12-12 16:58 | 0:03:12 | 0:05:10 | 2023-12-10 10:25 | 2023-12-10 13:25 | 0:03:00 | 295 |\n| Bailibatt | N/A | 300W | Bailibatt 300W | 179 | 257.52 | S (<600) | 217 | 84.27 | 0:11:01 | 0.39 | 4.6 | Li-ion | No | 3 | 1 | 2 | Yes | No | 240 | 112 | 300 | 600 | 2024-01-02 10:34 | 2024-01-02 15:50 | 2024-01-02 18:20 | 2024-01-02 21:35 | 0:05:16 | 0:07:46 | 2023-12-23 14:15 | 2023-12-23 16:35 | 0:02:20 | 93 | |\n| Pecron | E | 1500 | Pecron E1500 | 1299 | 1536 | L (1300-2199) | 1394 | 90.76 | 0:01:16 | 20.21 | 39.7 | LiFePO4 | Yes | 4 | 2 | 3 | Yes | No | 800 | 120 | 120.1 | 2200 | 4400 | 2024-01-03 10:46 | 2024-01-03 11:18 | 2024-01-03 11:30 | 2024-01-03 12:02 | 0:00:32 | 0:00:44 | 2024-01-03 10:55 | 2024-01-03 13:39 | 0:02:44 | 510 |\n| Anker | Solix | F3800 | Anker Solix F3800 | 2,799 | 3840 | XL (2200+) | 3030.45 | 78.92 | 0:02:53 | 22.2 | 132.3 | LiFePO4 | No | 2 | 3 | 6 | Yes | Yes | 2400 | 120 | 119 | 6000 | 12000 | 2024-01-05 9:58 | 2024-01-05 11:26 | 2024-01-05 12:19 | 2024-01-05 12:51 | 0:01:28 | 0:02:21 | 2024-01-04 10:47 | 2024-01-04 15:14 | 0:04:27 | 681 |\n| Ugreen | Power Roam | 2400 | Ugreen Power Roam | 1999 | 2048 | L (1300-2199) | 1698.67 | 82.94 | 0:01:25 | 24.09 | 56.2 | LiFePO4 | No | 2 | 4 | 6 | Yes | Yes | 600 | 120 | 118 | 1800 | 2400 | 2024-01-05 9:41 | 2024-01-05 10:23 | 2024-01-05 10:47 | 2024-01-05 11:06 | 0:00:42 | 0:01:06 | 2024-01-04 15:16 | 2024-01-04 18:44 | 0:03:28 | 490 |\n| Goal Zero | Yeti Pro | 4000 | Goal Zero Yeti Pro 4000 Turbo Mode | 3999.95 | 3993.6 | XL (2200+) | 3460.75 | 86.66 | 0:02:49 | 23.63 | 115.7 | LiFePO4 | No | 3 | 3 | 4 | Yes | Yes | 3000 | 120 | 114 | 3600 | 7200 | 2024-01-08 9:28 | 2024-01-08 10:53 | 2024-01-08 11:46 | 2024-01-08 12:17 | 0:01:25 | 0:02:18 | 2024-01-05 12:31 | 2024-01-05 21:36 | 0:09:05 | 381 |\n| Goal Zero | Yeti Pro | 4000 | Goal Zero Yeti Pro 4000 low charge mode | 3999.95 | 3993.6 | XL (2200+) | 3460.75 | 86.66 | 0:15:53 | 4.19 | 115.7 | LiFePO4 | No | 3 | 3 | 4 | Yes | Yes | 3000 | 120 | 113.7 | 3600 | 7200 | 2024-01-09 15:05 | 2024-01-09 23:31 | 2024-01-10 4:48 | 2024-01-10 6:58 | 0:08:26 | 0:13:43 | 2024-01-11 12:31 | 2024-01-11 21:36 | 0:09:05 | 381 |\n| Goal Zero | Yeti Pro + Tank Pro | 8000 | Goal Zero Yeti Pro 8000 slow charge mode | 6299.95 | 7988 | XL (2200+) | 7128.18 | 89.24 | 0:12:49 | 10.39 | 195.7 | LiFePO4 | No | 3 | 3 | 4 | Yes | Yes | 3000 | 120 | 113.7 | 3600 | 7200 | 2024-01-23 10:12 | 2024-01-23 17:06 | 2024-01-23 21:29 | 2024-01-23 23:01 | 0:06:54 | 0:11:17 | 2024-01-19 9:48 | 2024-01-19 20:37 | 0:10:49 | 659 |\n| Goal Zero | Yeti Pro+ Tank pro | 8000 | Goal Zero Yeti Pro 8000 turbo charge mode | 6299.95 | 7988 | XL (2200+) | 7128.18 | 89.24 | 1:05:52 | 4.46 | 195.7 | LiFePO4 | No | 3 | 3 | 4 | Yes | Yes | 3000 | 120 | 113.7 | 3600 | 7200 | 2024-01-18 9:53 | 2024-01-19 12:55 | 2024-01-19 14:46 | 2024-01-19 15:45 | 1:03:02 | 1:04:53 | 2024-01-12 9:48 | 2024-01-12 20:37 | 0:10:49 | 659 |\n| Dabbsson | DBS2300+DBS3000b external battery | Dabbsson DBS2300+DBS3000B W/external Fast Charge | 2999 | 5330 | XL (2200+) | 4480.2 | 84.06 | 0:04:12 | 21.15 | 113.3 | LiFePO4 | No | 3 | 3 | 4 | Yes | Yes | 1800 | 120 | 118.1 | 2200 | 4400 | 2024-01-17 9:53 | 2024-01-17 11:43 | 2024-01-17 12:49 | 2024-01-17 14:05 | 0:01:50 | 0:02:56 | 2024-01-16 10:56 | 2024-01-16 17:29 | 0:06:33 | 684 | |\n| Dabbsson | DBS2300+DBS3000B W/External battery | Dabbsson DBS2300+DBS3000B W/ External Slow charge | 2999 | 5330 | XL (2200+) | 4486.75 | 84.18 | 0:09:24 | 9.45 | 113.3 | LiFePO4 | No | 3 | 3 | 4 | Yes | Yes | 1800 | 120 | 118.1 | 2200 | 4400 | 2024-01-19 9:50 | 2024-01-19 14:05 | 2024-01-19 16:59 | 2024-01-19 19:14 | 0:04:15 | 0:07:09 | 2024-01-18 13:01 | 2024-01-18 19:34 | 0:06:33 | 685 | |\n| Dabbsson | DBS2300 | Dabbsson DBS2300 Slow charge | 1299 | 2330 | XL (2200+) | 2007.2 | 86.15 | 0:04:13 | 9.21 | 57.8 | LiFePO4 | No | 3 | 3 | 4 | Yes | Yes | 800 | 120 | 2200 | 4400 | 2024-01-22 14:48 | 2024-01-22 16:53 | 2024-01-22 18:12 | 2024-01-22 19:01 | 0:02:05 | 0:03:24 | 2024-01-19 14:29 | 2024-01-19 17:57 | 0:03:28 | 579 | ||\n| Bluetti | AC | 180T | Bluetti AC180T Turbo mode | 1499 | 1433.6 | L (1300-2199) | 1293.6 | 90.23 | 0:01:13 | 19.64 | 58.4 | LiFePO4 | No | 2 | 2 | 4 | Yes | Yes | 500 | 120 | 1800 | 3600 | 2024-01-26 9:25 | 2024-01-26 9:58 | 2024-01-26 10:17 | 2024-01-26 10:38 | 0:00:33 | 0:00:52 | 2024-01-25 9:52 | 2024-01-25 14:16 | 0:04:24 | 294 | |\n| Bluetti | AC | 180T | Bluetti AC180T Standard mode | 1433.6 | L (1300-2199) | 58.4 | LiFePO4 | No | 2 | 2 | 4 | Yes | Yes | 500 | 120 | 1800 | 3600 | ||||||||||||||||\n| Oupes | Mega | 3 | Oupes Mega 3 | 1999 | 3072 | XL (2200+) | 2850 | 92.77 | 0:01:56 | 26.48 | 83.33 | LiFePO4 | No | 4 | 2 | 5 | Yes | Yes | 2100 | 120 | 119.6 | 3600 | 7200 | 2024-01-29 9:31 | 2024-01-29 10:28 | 2024-01-29 11:03 | 2024-01-29 11:27 | 0:00:57 | 0:01:32 | 2024-01-26 14:28 | 2024-01-26 19:13 | 0:04:45 | 600 |\n| Ampace | Andes | 600 pro | Ampace Andes 600Pro | 599 | 584 | S (<600) | 480.92 | 82.35 | 0:01:29 | 6.56 | 16.8 | LiFePO4 | No | 2 | 2 | 2 | Yes | Yes | 200 | 120 | 119.1 | 600 | 1800 | 2024-01-30 15:11 | 2024-01-30 15:45 | 2024-01-30 16:08 | 2024-01-30 16:40 | 0:00:34 | 0:00:57 | 2024-01-30 9:29 | 2024-01-30 11:54 | 0:02:25 | 199 |\n| Dakota Lithium | PS | 2400 | Dakota Lithium PS2400 | 2399 | 2060.8 | L (1300-2199) | 1869.48 | 90.72 | 0:01:17 | 26.76 | 55 | LiFePO4 | Yes | 2 | 2 | 3 | Yes | No | 800 | 120 | 119.5 | 2400 | 4800 | 2024-01-31 9:34 | 2024-01-31 10:11 | 2024-01-31 10:35 | 2024-01-31 10:51 | 0:00:37 | 0:01:01 | 2024-01-30 12:24 | 2024-01-30 16:07 | 0:03:43 | 503 |\n| Oupes | Mega | 3 W/B2 battery | Oupes Mega 3 W/ B2 battery | 2621 | 5120 | XL (2200+) | 4795 | 93.65 | 0:05:12 | 16.41 | 125.1 | LiFePO4 | No | 8 | 4 | 5 | Yes | Yes | 2100 | 120 | 119.6 | 3600 | 7000 | 2024-02-01 9:21 | 2024-02-01 11:25 | 2024-02-01 12:41 | 2024-02-01 14:33 | 0:02:04 | 0:03:20 | 2024-01-31 10:06 | 2024-01-31 16:57 | 0:06:51 | 700 |\n| Litheli | Power Hub | Eclair1000 | Litheli Power Hub Eclair1000 | 1199.98 | 1069 | M (600-1299) | 732 | 68.48 | 0:00:53 | 20.17 | 35.1 | LiFePO4 | Yes | 2 | 4 | 4 | Yes | Yes | 400 | 110 | 109.1 | 1800 | 3600 | 2024-02-05 9:43 | 2024-02-05 10:08 | 2024-02-05 10:22 | 2024-02-05 10:36 | 0:00:25 | 0:00:39 | 2024-02-02 13:00 | 2024-02-02 15:00 | 0:02:00 | 366 |\n| Yoshino | B330 | SST | Yoshino B330 SST | 349 | 241 | S (<600) | 209.1 | 86.76 | 0:02:54 | 1.39 | 9.9 | Li-NMC | No | 2 | 2 | 2 | Yes | Yes | 100 | 120 | 122 | 330 | 660 | 2024-02-20 10:06 | 2024-02-20 11:25 | 2024-02-20 12:15 | 2024-02-20 13:00 | 0:01:19 | 0:02:09 | 2024-02-16 13:23 | 2024-02-16 15:26 | 0:02:03 | 102 |\n| Anker | Solix | C800 Plus | Anker Solix C800 Plus | 649 | 768 | M (600-1299) | 683.1 | 88.95 | 0:01:00 | 12.8 | 24.03 | LiFePO4 | No | 2 | 2 | 5 | Yes | Yes | 300 | 120 | 119.8 | 1200 | 1600 | 2024-02-28 9:33 | 2024-02-28 10:00 | 2024-02-28 10:15 | 2024-02-28 10:33 | 0:00:27 | 0:00:42 | 2024-02-27 9:45 | 2024-02-27 12:03 | 0:02:18 | 297 |\n| Generac | GB | 1000 | Generac GB1000 | 899 | 1086 | M (600-1299) | 965.25 | 88.88 | 0:02:40 | 6.79 | 27.1 | Li-NMC | Yes | 2 | 2 | 3 | Yes | No | 468 | 120 | 122.5 | 1600 | 3200 | 2024-03-04 13:03 | 2024-03-04 14:20 | 2024-03-04 15:08 | 2024-03-04 15:43 | 0:01:17 | 0:02:05 | 2024-03-04 10:24 | 2024-03-04 12:47 | 0:02:23 | 405 |\n| Milwaukee | NA | Carry On | Milwaukee Carry On | 699 | 432 | S (<600) | 304.85 | 70.57 | 0:01:26 | 5.02 | 28 | Li-ion | No | 1 | 1 | 2 | No | No | 120 | 122.2 | 1800 | 3600 | 2023-03-24 9:39 | 2023-03-24 10:05 | 2023-03-24 10:34 | 2023-03-24 11:05 | 0:00:26 | 0:00:55 | 2024-03-22 12:00 | 2024-03-22 13:31 | 0:01:31 | 201 | |\n| VTOMAN | FlashSpeed | 1000 | VTOMAN FlashSpeed 1000 | 999 | 828 | M (600-1299) | 661.87 | 79.94 | 0:01:14 | 11.19 | 37.4 | LiFePO4 | No | 4 | 2 | 3 | Yes | No | 300 | 110 | 109.1 | 1000 | 2000 | 2024-03-26 9:54 | 2024-03-26 10:29 | 2024-03-26 10:51 | 2024-03-26 11:08 | 0:00:35 | 0:00:57 | 2024-03-22 13:36 | 2024-03-22 16:02 | 0:02:26 | 272 |\n| Bluetti | AC | 240 | Bluetti AC240 | 1899 | 1536 | L (1300-2199) | 1328.4 | 86.48 | 0:01:14 | 20.76 | 72 | LiFePO4 | No | 2 | 2 | 2 | Yes | Yes | 1200 | 120 | 120.8 | 2400 | 4800 | 2024-04-04 15:52 | 2024-04-04 16:23 | 2024-04-04 16:42 | 2024-04-04 17:06 | 0:00:31 | 0:00:50 | 2024-04-04 10:34 | 2024-04-04 13:18 | 0:02:44 | 486 |\n| Lion Energy | NA | Summit | Lion Summit | 499 | 665 | M (600-1299) | 570.35 | 85.77 | 0:04:25 | 2.51 | 18 | LiFePO4 | No | 2 | 2 | 2 | Yes | Yes | 150 | 120 | 110.8 | 530 | 2024-05-06 10:02 | 2024-05-06 12:08 | 2024-05-06 13:32 | 2024-05-06 14:27 | 0:02:06 | 0:03:30 | 2024-05-03 9:57 | 2024-05-03 13:00 | 0:03:03 | 187 | |\n| Lion Energy | NA | Safari | Lion Safari | 1699 | 1612 | L (1300-2199) | 1388.33 | 86.12 | 0:02:27 | 10.97 | 57.3 | LiFePO4 | No | 2 | 2 | 4 | Yes | Yes | 600 | 120 | 118.5 | 3000 | 6000 | 2024-05-07 13:32 | 2024-05-07 14:44 | 2024-05-07 15:28 | 2024-05-07 15:59 | 0:01:12 | 0:01:56 | 2024-05-07 14:31 | 2024-05-07 17:21 | 0:02:50 | 490 |\n| DJI | Power | 1000 | DJI Power 1000 | 1000 | 1024 | M (600-1299) | 815.73 | 79.66 | 0:01:06 | 15.52 | 28.66 | LiFePO4 | No | 2 | 2 | 2 | No | No | 120 | 120 | 120.3 | 1100 | 2200 | 2024-05-10 9:27 | 2024-05-10 10:00 | 2024-05-10 10:16 | 2024-05-10 10:33 | 0:00:33 | 0:00:49 | 2024-05-09 10:12 | 2024-05-09 12:53 | 0:02:41 | 304 |\n| Goal Zero | Yeti | 700 | Goal Zero yeti 700 | 599.95 | 677 | M (600-1299) | 566.83 | 83.73 | 0:01:51 | 6.1 | 20.9 | LiFePO4 | No | 2 | 2 | 2 | Yes | Yes | 200 | 120 | 115.8 | 600 | 1200 | 2024-05-10 14:35 | 2024-05-10 15:29 | 2024-05-10 15:57 | 2024-05-10 16:26 | 0:00:54 | 0:01:22 | 2024-05-10 11:34 | 2024-05-10 14:33 | 0:02:59 | 190 |\n| Etaker | M | M2000 | Etaker M2000 | 1399.99 | 2008 | L (1300-2199) | 1818.67 | 90.57 | 0:02:17 | 14.66 | 44.6 | Li-ion | No | 4 | 2 | 6 | Yes | No | 1000 | 120 | 118.7 | 2000 | 4000 | 2024-07-03 12:53 | 2024-07-03 13:49 | 2024-07-03 14:20 | 2024-07-03 15:10 | 0:00:56 | 0:01:27 | 2024-07-02 14:38 | 2024-07-02 18:18 | 0:03:40 | 496 |\n| Segway | Cube | 1000 | Segway Cube 1000 | 799 | 1024 | M (600-1299) | 840.57 | 82.09 | 0:01:48 | 9.48 | 35.7 | LiFePO4 | No | 4 | 2 | 3 | Yes | Yes | 800 | 120 | 2200 | 4400 | 2024-07-05 14:43 | 2024-07-05 15:12 | 2024-07-05 15:40 | 2024-07-05 16:31 | 0:00:29 | 0:00:57 | 2024-07-05 11:53 | 2024-07-05 14:40 | 0:02:47 | 302 | |\n| Segway | Cube | 2000 | Segway Cube 2000 | 2199.99 | 2040 | L (1300-2199) | 1778.55 | 87.18 | 0:02:21 | 14.47 | 57.5 | LiFePO4 | No | 2 | 2 | 3 | Yes | Yes | 800 | 120 | 119.1 | 2200 | 4400 | 2024-07-10 9:33 | 2024-07-10 10:34 | 2024-07-10 11:10 | 2024-07-10 11:54 | 0:01:01 | 0:01:37 | 2024-07-09 13:28 | 2024-07-09 17:01 | 0:03:33 | 501 |\n| BioLite | BaseCharge | 1500+ | BioLite BaseCharge 1500+ | 1299 | 1521 | L (1300-2199) | 1196 | 78.63 | 0:05:40 | 4.47 | 28.5 | Li-NMC | Yes | 2 | 3 | 3 | Yes | No | 400 | 110 | 109.3 | 1200 | 2400 | 2024-07-29 10:19 | 2024-07-29 12:08 | 2024-07-29 13:39 | 2024-07-29 15:59 | 0:01:49 | 0:03:20 | 2024-07-26 9:26 | 2024-07-26 12:41 | 0:03:15 | 368 |\n| BioLite | BaseCharge | 600+ | BioLite BaseCharge 600+ | 599 | 622 | M (600-1299) | 484.75 | 77.93 | 0:03:39 | 2.84 | 14 | Li-NMC | Yes | 2 | 2 | 2 | Yes | No | 200 | 110 | 109.8 | 600 | 1000 | 2024-07-29 10:13 | 2024-07-29 11:38 | 2024-07-29 12:33 | 2024-07-29 13:52 | 0:01:25 | 0:02:20 | 2024-07-26 9:43 | 2024-07-26 11:28 | 0:01:45 | 277 |\n| 4 Patriots | Power | Sidekick | 4 Patriots Power Sidekick | 499.95 | 299 | S (<600) | 258.68 | 86.52 | 0:05:26 | 0.92 | 8.4 | LiFePO4 | No | 2 | 2 | 2 | Yes | No | 60 | 110 | 111.2 | 300 | 600 | 2024-08-01 14:31 | 2024-08-01 16:57 | 2024-08-01 18:33 | 2024-08-01 19:57 | 0:02:26 | 0:04:02 | 2024-08-01 12:58 | 2024-08-01 14:21 | 0:01:23 | 187 |\n| 4 Patriots | Power Generator | 2000X | 4 Patriots Power Generator 2000X | 2999.95 | 1612.8 | L (1300-2199) | 1404.67 | 87.09 | 0:03:51 | 6.98 | 55 | LiFePO4 | No | 2 | 2 | 4 | Yes | No | 525 | 120 | 118 | 2000 | 4000 | 2024-08-02 10:37 | 2024-08-02 12:19 | 2024-08-02 13:26 | 2024-08-02 14:28 | 0:01:42 | 0:02:49 | 2024-07-31 11:44 | 2024-07-31 14:36 | 0:02:52 | 490 |\n| Ampace | Andes | 1500 | Ampace Andes 1500 | 1399 | 1462 | L (1300-2199) | 1218.07 | 83.32 | 0:01:16 | 19.24 | 36.4 | LiFePO4 | No | 4 | 2 | 4 | Yes | Yes | 600 | 120 | 119.8 | 2400 | 3600 | 2024-08-06 14:39 | 2024-08-06 15:07 | 2024-08-06 15:28 | 2024-08-06 15:55 | 0:00:28 | 0:00:49 | 2024-08-06 10:26 | 2024-08-06 14:28 | 0:04:02 | 302 |\n| EcoFlow | River | 3 | EcoFlow River 3 | 239 | 245 | S (<600) | 221.99 | 90.61 | 0:00:59 | 4.15 | 7.28 | LiFePO4 | No | 2 | 1 | 2 | Yes | Yes | 110 | 120 | 119 | 300 | 550 | 2024-08-08 13:37 | 2024-08-08 14:03 | 2024-08-08 14:19 | 2024-08-08 14:36 | 0:00:26 | 0:00:42 | 2024-08-09 11:21 | 2024-08-09 13:35 | 0:02:14 | 99.4 |\n| Oupes | Mega | 5 W/ B5 extra battery | Oupes Mega 5 W/ B5 extra battery | 4354 | 10080 | XL (2200+) | 8856 | 87.86 | 0:07:28 | 22.5 | 209.07 | LiFePO4 | No | 4 | 2 | 5 | Yes | Yes | 2100 | 120 | 119.9 | 4000 | 7000 | 2024-08-27 9:42 | 2024-08-27 13:05 | 2024-08-27 15:05 | 2024-08-27 17:10 | 0:03:23 | 0:05:23 | 2024-08-22 10:10 | 2024-08-22 16:10 | 0:06:00 | 1476 |\n| Grecell | T | T-1000 | Grecell T-1000 | 700 | 999 | M (600-1299) | 884.58 | 88.55 | 0:06:45 | 2.47 | 17.8 | Li-NMC | Yes | 3 | 1 | 2 | Yes | No | 200 | 120 | 109.3 | 1000 | 2000 | 2024-09-30 10:22 | 2024-09-30 13:02 | 2024-09-30 14:42 | 2024-09-30 17:07 | 0:02:40 | 0:04:20 | 2024-09-29 9:56 | 2024-09-29 13:09 | 0:03:13 | 275 |\n| Bluetti | Handsfree | 2 | Bluetti Handsfree 2 | 599 | 512 | S (<600) | 446.2 | 87.15 | 0:01:11 | 7.21 | 16.5 | LiFePO4 | No | 2 | 2 | 1 | Yes | Yes | 350 | 120 | 119.1 | 700 | 2024-10-07 10:35 | 2024-10-07 11:05 | 2024-10-07 11:24 | 2024-10-07 11:46 | 0:00:30 | 0:00:49 | 2024-10-04 15:15 | 2024-10-04 16:47 | 0:01:32 | 291 | |\n| EBL | MP | 1000 | EBL MP1000 | 999 | 999 | M (600-1299) | 883.22 | 88.41 | 0:07:12 | 2.31 | 18.7 | Li-NMC | Yes | 3 | 1 | 2 | Yes | No | 200 | 110 | 108.3 | 1000 | 2000 | 2024-10-14 10:49 | 2024-10-14 13:46 | 2024-10-14 15:27 | 2024-10-14 18:01 | 0:02:57 | 0:04:38 | 2024-10-10 15:00 | 2024-10-10 18:17 | 0:03:17 | 269 |\n| Oupes | Mega | 1 | Oupes Mega 1 | 449 | 1024 | M (600-1299) | 972.7 | 94.99 | 0:01:34 | 10.89 | 27.8 | LiFePO4 | No | 4 | 2 | 4 | Yes | Yes | 800 | 120 | 119.1 | 2000 | 4500 | 2024-10-22 9:50 | 2024-10-22 10:11 | 2024-10-22 10:24 | 2024-10-22 11:24 | 0:00:21 | 0:00:34 | 2024-10-21 15:00 | 2024-10-21 17:22 | 0:02:22 | 411 |\n| Ecoflow | River | 3 Plus | Ecoflow River 3 Plus | 286 | S (<600) | 10.4 | LiFePO4 | No | 2 | 1 | 3 | Yes | 220 | 120 | 600 | 850 | |||||||||||||||||\n| Bluetti | Elite | 200 V2 | Bluetti Elite 200 V2 | 2073.6 | L (1300-2199) | 53.35 | LiFePO4 | No | 2 | 2 | 4 | Yes | Yes | 1000 | 120 | 118.8 | 2600 | 3900 | 392 | ||||||||||||||\n| Fossibot | F3600 Pro | 1,299 | 2899 | 3840 | XL (2200+) | 3428.67 | 89.29 | 0:05:32 | 11.57 | 93.69 | LiFePO4 | No | 2 | 4 | 4 | Yes | 2000 | 120 | 3600 | 2024-12-10 9:10 | 2024-12-10 11:29 | 2024-12-10 12:54 | 2024-12-10 14:42 | 0:02:19 | 0:03:44 | 2024-12-06 10:01 | 2024-12-06 16:11 | 0:06:10 | 556 | ||||\n| Anker | Solix | F3800 | Anker Solix F3800 | 3999 | 3840 | XL (2200+) | 3030.45 | 78.92 | 0:02:53 | 22.2 | 132.3 | LiFePO4 | No | 2 | 3 | 6 | Yes | Yes | 2400 | 120 | 119 | 6000 | 12000 | 2024-01-05 9:58 | 2024-01-05 11:26 | 2024-01-05 12:19 | 2024-01-05 12:51 | 0:01:28 | 0:02:21 | 2024-01-04 10:47 | 2024-01-04 15:14 | 0:04:27 | 681 |\n| Fossibot | F3600 Pro | F3600 | FOSSiBOT F3600 Pro Portable Power Station | 1499 | 3840 | XL (2200+) | 23004.4 | 599.07 | 0:04:01 | 15.93 | 92.59 | LiFePO4 | No | 2 | 3 | 13 | No | Yes | 2000 | 2025-02-10 10:53 | 2025-02-10 12:20 | 2025-02-10 13:12 | 2025-02-10 14:54 | 0:01:27 | 0:02:19 | 2025-01-28 14:42 | 2025-01-28 21:30 | 0:06:48 | 3383 | ||||\n| Bouge RV | Bouge RV | Rover2000 | ROVER2000 Semi-Solid State Portable Power Station | 999.99 | 2008 | L (1300-2199) | 4738.27 | 235.97 | 0:03:40 | 9.13 | 47 | Other | No | 3 | 3 | 5 | Yes | 1500 | 2025-02-26 13:56 | 2025-02-26 14:44 | 2025-02-26 15:29 | 2025-02-26 17:36 | 0:00:48 | 0:01:33 | 2025-02-27 9:49 | 2025-02-27 12:29 | 0:02:40 | 1776.85 | |||||\n| Bluetti | Elite 200 V2 | BLUETTI Elite 200 V2 Portable Power Station | 999 | 2073.6 | L (1300-2199) | 7451.72 | 359.36 | 0:01:51 | 18.68 | 53 | LiFePO4 | No | 2 | 2 | 4 | Yes | Yes | 2025-02-11 14:41 | 2025-02-11 15:35 | 2025-02-11 16:08 | 2025-02-11 16:32 | 0:00:54 | 0:01:27 | 2025-02-24 11:47 | 2025-02-24 15:39 | 0:03:52 | 1927.17 | ||||||\n| VTOMAN | Flashspeed 1000 | Flashspeed | VTOMAN FlashSpeed 1000 Power Station | 499 | 828 | M (600-1299) | 1057.11 | 127.67 | 0:01:14 | 11.19 | 37 | LiFePO4 | No | 4 | 2 | 3 | Yes | 300 | 2025-02-18 14:35 | 2025-02-18 15:11 | 2025-02-18 15:33 | 2025-02-18 15:49 | 0:00:36 | 0:00:58 | 2025-02-14 11:28 | 2025-02-14 13:05 | 0:01:37 | 653.88 | |||||\n| Schneider | OffGrid 730 | OffGrid | Schneider OffGrid Portable Power Station 730 | 649.99 | 738 | M (600-1299) | 562.65 | 76.24 | 0:08:29 | 1.45 | 13.9 | Li-ion | Yes | 3 | 2 | 3 | Yes | No | 100 | 2025-02-28 15:07 | 2025-02-28 19:30 | 2025-02-28 21:56 | 2025-02-28 23:36 | 0:04:23 | 0:06:49 | 2025-02-28 10:24 | 2025-02-28 11:27 | 0:01:03 | 535.86 | ||||\n| Anker | SOLIX F3800 Plus | 2,600 | Anker SOLIX F3800 Portable Power Station | 2999.99 | 3840 | XL (2200+) | 19141.06 | 498.47 | 0:03:12 | 20 | 132.3 | LiFePO4 | No | 2 | 3 | 8 | Yes | 2400 | 9000 | 1800 | 2025-02-26 10:13 | 2025-02-26 11:38 | 2025-02-26 12:30 | 2025-02-26 13:25 | 0:01:25 | 0:02:17 | 2025-02-25 14:13 | 2025-02-25 20:24 | 0:06:11 | 3095.59 | |||\n| Duracell | G800 | Duracell G800 Portable Power Station | 699 | 620 | M (600-1299) | 0:03:10 | 3.26 | 19.4 | Li-NMC | No | 3 | 2 | 3 | Yes | No | 100 | 120 | 119.96 | 800 | 2025-02-10 15:07 | 2025-02-10 16:33 | 2025-02-10 17:21 | 2025-02-10 18:17 | 0:01:26 | 0:02:14 | 2025-02-27 1:45 | 2025-02-27 2:44 | 0:00:59 | |||||\n| Grecell | H2400 | GRECELL Portable Power Station 2400W | 1289 | 1843.2 | L (1300-2199) | 0:02:14 | 13.76 | 55 | LiFePO4 | No | 2 | 2 | 4 | Yes | No | 800 | 120 | 120.27 | 2400 | 2025-03-14 10:56 | 2025-03-14 11:53 | 2025-03-14 12:30 | 2025-03-14 13:10 | 0:00:57 | 0:01:34 | 2025-03-13 13:54 | 2025-03-13 17:08 | 0:03:14 | |||||\n| ETAKER | M2000 | M2000 | ETAKER Portable Power Station M2000 | 1299 | 2008 | L (1300-2199) | 0:02:18 | 14.55 | 4 | 2 | 6 | Yes | No | 200 | 120 | 119.88 | 2000 | 2025-03-18 9:53 | 2025-03-18 10:56 | 2025-03-18 11:29 | 2025-03-18 12:11 | 0:01:03 | 0:01:36 | 2025-03-17 10:15 | 2025-03-17 13:47 | 0:03:32 | |||||||\n| OSCAL | PowerMax 2400 | PowerMax | OSCAL PowerMax 2400 Portable Power Station | 980 | 1872 | L (1300-2199) | 0:02:02 | 15.34 | LiFePO4 | Yes | 4 | 2 | 4 | Yes | Yes | 800 | 120 | 120.79 | 2400 | 2025-03-19 14:05 | 2025-03-19 14:51 | 2025-04-07 15:35 | 2025-03-19 16:07 | 0:00:46 | 19:01:30 | 2025-03-19 9:59 | 2025-03-19 13:26 | 0:03:27 | |||||\n| ECOFLOW | River 3 Plus | River 3 Plus | EcoFlow RIVER 3 Plus Portable Power Station | 229 | 286 | S (<600) | 0:00:53 | 5.4 | 10.4 | LiFePO4 | No | 2 | 1 | 1 | Yes | No | 220 | 120 | 119.02 | 600 | 2025-03-20 13:41 | 2025-03-20 14:07 | 2025-03-20 14:22 | 2025-03-20 14:34 | 0:00:26 | 0:00:41 | 2025-03-20 11:48 | 2025-03-20 12:16 | 0:00:28 | ||||\n| BLUETTI | AC200L | AC200L | BLUETTI AC200L Portable Power Station | 1099 | 2048 | XL (2200+) | 0:02:03 | 16.65 | 62.4 | LiFePO4 | No | 2 | 2 | 4 | Yes | 1200 | 120 | 120.98 | 2400 | 2025-03-24 11:03 | 2025-03-24 12:00 | 2025-03-24 12:35 | 2025-03-24 13:06 | 0:00:57 | 0:01:32 | 2025-03-24 16:28 | 2025-03-24 18:18 | 0:01:50 | |||||\n| Pecron | E3600LFP | E3600LFP | PECRON E3600LFP Portable Power Station | 1399 | 3072 | XL (2200+) | 0:02:07 | 24.19 | LiFePO4 | Yes | 4 | 2 | 4 | Yes | Yes | 2400 | 120 | 120.4 | 3600 | 2025-03-26 9:32 | 2025-03-26 10:33 | 2025-03-26 11:11 | 2025-03-26 11:39 | 0:01:01 | 0:01:39 | 2025-03-25 15:27 | 2025-03-25 22:40 | 0:07:13 |\nAnker\nAnker Solix F3800: The capacity and capabilities of portable power stations continue to evolve, with the largest models being capable of home backup and running high-power appliances. The Anker Solix F3800 is one such portable power station, with plenty of juice and the ability to run just about anything in your home, making it more similar to whole-home backup systems like the EcoFlow Delta Pro Ultra and Tesla Powerwall. It's also worth noting that the F3800 has a successor -- the F3800 Plus, which now takes our top spot for extra-large power stations and home backup. There are a few things I am particularly fond of with the F3800. For starters, you can add up to six expansion batteries for a total of 26.9Wh capacity. The Solix F3800 boasts a nominal power output of 6,000 watts and the capacity for 120/240 split-phase output in the same unit. It also has both NEMA 14-50 and L14-30 receptacles to directly charge things like your EV, RV or large appliances. You could also choose to pull double duty, run two of these units and max out the expansion batteries for a total of 53.8kWh capacity. Doing so would double your power output to 12,000 watts. It's no slouch in testing either, with a reasonable 79% usable measured capacity and the ability to charge to full in under 3 hours. Bluetooth and Wi-Fi connectivity allow for monitoring energy use through the app, which is a nice touch. It comes with a generous five-year warranty, which is notably longer than the other extra-large portable power station on this list, the Fossibot F3600 Pro.\nAnker 555 PowerHouse (1,024Wh) (Update: Currently unavailable): An increasing number of portable power stations are shipping with LifePO4 batteries, and I love that. The 555 is slower to charge than most of its competitors but sports a 94% usable capacity and an attractive price versus the number of watt-hours; the better to power those six AC outlets.\nAnker Solix C1000 (1,056Wh): Another good option from Anker. It tested well in our lab and comes with a built-in LED light which is a nice touch for emergencies. Anker currently has it at almost half off and supports a five-year warranty, making it a great option when it's on sale.\nAnker Solix C800 Plus (768Wh): So, I kind of like this guy. It only really performed average in our standard tests for power stations, but it has a feature that is quite interesting, if not a bit gimmicky. In a storage compartment on top of the unit, you will find a telescoping pole that can be mounted onto the power station to support one of two rechargeable camping lights. You're not getting a ton of light out of these things, but, some light is infinitely better than no light. Plus you get the hands-free mode with the telescoping pole mount -- maybe that is what the 'plus' is for?\nAnker Solix F1200 (1,229Wh): This unit was previously known as the PowerHouse 757 from Anker, and was also CNET's previous pick for \"best portable power station for backup.\" Its UPS mode was one of the earlier units to boast \"less than 20ms\" switchover time in the event of a power outage. It's also currently $500 off on Anker's site.\nAnker Solix F2000 (2,048Wh): Previously known as the Anker PowerHouse 767 and previous winner of \"best large portable power station\" here on CNET. This model has lots to offer by way of features and options -- pretty much anything other than wireless charging. It also performed well on our usable capacity and charge time tests. It's now been supplanted by the Solix F3800 Plus.\nBiolite\nBioLite BaseCharge 600+ (622Wh): BioLite has released upgraded versions of its BaseCharge 600 and 1500 models. There's a little give and take here -- the upgraded units charge a bit faster, but have a little less usable capacity. Still, just an 'OK' pick.\nBioLite BaseCharge 1500+ (1,521Wh): Having tested both the 600 and 1500 models of the upgraded BioLite BaseCharge+ line, I can tell you that this company is consistent in its product manufacturing. The BaseCharge 1500+ is about 2.5 times the capacity of the 600+. That 2.5 modifier carries across the board fairly accurately from price to capacity, charge times and everything else. If you like the 600+, but you wish you had two and a half of it, save yourself the effort and just buy the 1500+.\nBluetti\nBluetti AC180 (1,152Wh): This unit tested well enough, scoring 88% usable capacity and charging via AC outlet at 13.88 watt-hours per minute. But unlike many of the other Bluetti units that use the same physical format, this unit does not support capacity expansion via external batteries.\nBluetti AC180T (1,433Wh): I like this unit, but I'm just as, if not more, excited about its energy platform: the SwapSolar Ecosystem. Not unlike some of the Runhood units we've tested, this ecosystem uses interchangeable batteries that'll power multiple products from the brand. We have also tested an electric cooler on the same ecosystem. As far as large power stations, the performance metrics were great with this unit, just not quite enough to capture a title.\nBluetti AC2A (204.8Wh): A great option if you don't need a ton of capacity but do need options beyond just USB connectivity. This unit is in the capacity ballpark of a very large power bank and priced similarly. Plus, it's currently on sale through the manufacturer for $149.\nBluetti AC200P (2,000Wh): This is one of Bluetti's earlier large portable power stations and a previous winner for \"best large portable power station.\" It's $400 off on Bluetti's site. It still offers plenty of power and options, but is likely nearing the end of its product cycle lifespan (hence the discount).\nBluetti AC 200 Max (2,048 Wh) (Update: Out of stock): The AC200 Max once held our title for the best value portable power station, giving you a 2,048 watt-hours of capacity (expandable to 8,192Wh), 2,200-watt output (4,800-watt surge) and 900 watts of solar charging power (1,400-watt solar plus AC). That's nothing to laugh at in this price range. Most offerings with similar specs sit closer to $2,000 and often are missing the expandability aspect. The AC200 Max is comparable in form to Bluetti's larger format AC300 and AC500 units.\nBluetti AC240 (1,536Wh): I've tested a dozen or more Bluetti power stations at this point. The AC240 is good, as are most of Bluetti's offerings, but I wasn't particularly blown away and didn't find anything new to be excited about here. It performed slightly below many other Bluetti units on the usable capacity test but has many of the expandability options I admire, and UPS switchover times are coming down across the board -- 15ms on this unit, although I'll be happier when sub-12ms is the standard.\nBluetti EB3A (268Wh): If you're interested in something small to work for your personal charging needs but those pocket-sized battery packs just don't cut it, this could be your option. As a previous CNET best value winner, the EB3A has what you need to keep rocking for a couple of days.\nBluetti EB55 (537Wh): We've liked almost every unit from Bluetti, and three of them took previous titles in this best list, but this unit was overshadowed by its siblings. Offerings that are just as good or better at better prices keep the EB55 out of the winner's circle.\nBouge\nBougeRV Fort 1000 (1,120Wh): I'm a fan of BougeRV's approach to camping and outdoor products in this space. It's worth checking out, especially if you're looking for more flexibility in areas like solar panels or DIY options. The Fort 1000 did well in our tests but didn't stand out enough to capture any titles.\nBougeRV Flash 300 (286Wh) (Update: Out of stock): Another one bites the dust. Once our top pick for the best small portable power station, it came with 600 watts of power, supported wireless charging and could charge to 100% in 45 minutes.\nEcoFlow\nEcoFlow River Max (576Wh) (Update: Currently unavailable): Blazing fast charging and a low-cost per watt-hour make this a reasonable pick, although this unit did test lowest in measured versus expected capacity, putting it at 425 usable watt-hours. Where'd those extra 151 watt-hours go?\nEcoflow River 2 Pro: A previous title holder for \"best budget portable power station,\" this is still a great pick for anyone looking for affordable power options. It charges fully in just over 1 hour and accesses a respectable 82.6% of the battery's 768Wh stated capacity.\nEcoFlow Delta 2 (1,024Wh): The EcoFlow Delta 2 is similar to the Anker 555 PowerHouse across the board -- features, pricing and so on. The main differences you can see from our tests are the usable capacity percentages: Anker with 94% versus EcoFlow with about 70% and charging rates. Both are rated at 1,024Wh. The EcoFlow Delta 2 charged to full in only 86 minutes, 275 minutes faster than the Anker model. Another point for EF is that it can wire in a secondary battery module, taking the capacity from 1,024Wh to 2,048Wh. Expect to pay an additional $300 for that battery expansion.\nEcoFlow Delta 2 Max (2,048Wh): Another example of a great product that didn't capture any of our titles. The Delta 2 Max performed well in all of our tests, and with the ability to expand to 6.144kWh, you're really walking the line between a portable power station and a whole-home energy solution.\nEcoFlow Delta Mini (882Wh) (Update: Out of stock): When we tested it, this model hit a sweet spot of basic functionality, capacity and price, earning it a spot on our list as the best portable power station for camping. It also supported charging with solar panels. Unfortunately, it's no longer available for sale.\nEcoFlow Delta Pro (3,600Wh): The EcoFlow Delta Pro is one of the largest portable power stations on our list at 3.6kWh (expandable up to 25kWh), and also happens to be one of the fastest charging. Lots of power and plenty of charge options to keep that power rolling.\nJackery\nJackery Explorer 240 (240Wh): We've been fans of all the Jackery units we've ever tested in the past, and that doesn't change here. Just missing the best small power station title, this unit still boasts the second-best capacity rating of all the ones we tested. It was a little slow to charge but is offered at a great price.\nJackery Explorer 300 Plus (288Wh): Another nice entry into the platform, the 300 Plus offers a solid power option in small form. Not a ton of frills, but it does what you expect it to do.\nJackery Explorer 700 Plus (680.96Wh): If you need more power output than the 300 Plus (300-watt/600-watt) then the 1,000-watt (2,000-watt surge) of the 700 Plus may be what you're looking for. It will charge via AC in about 1 hour and 30 minutes, and it has one of Jackery's higher usable capacity percentages at 88%.\nJackery Explorer 1000 Pro (1,002Wh): The 1000 Pro falls into our large portable power station, which begins at 1,000Wh (this Jackery weighs in at 1,002Wh; the same as its big brother, the 2000 Pro). I like the 2000 more than the 1000 for a few reasons, so the 1000 never had a shot at taking the \"large\" category. But it still has good performance, nice features and amazing charge times.\nJackery Explorer 1500 Pro (1,512Wh) (Update: Out of stock): With this Jackery you'll get a dependable machine that performs well. In our usable capacity tests it came in at 90.4% and charges quickly: 0 to 100% in 2 hours, with AC-only charging. Toss in a couple of solar panels and you can drop that time down quite a bit.\nJackery Explorer 2000 Pro (2,160Wh): This was a previous title-holder of the fastest charging portable power station. The Jackery units overall are great and dependable. If you're looking for a model (really, an entire lineup) that will recharge fast with multiple, even combined options, Jackery is a no-brainer.\nJackery Explorer 3000 Pro (3,024Wh): Another beast of a unit and a great offering from Jackery. If you're already a Jackery fan but need more battery capacity, this is an easy win for you. Otherwise, recent improvements include wheels, telescoping handling and that round RV plug we've been waiting for.\nOupes\nOupes 600W (595Wh): Not a bad little unit. I love that it has the LifePO4 battery. It performed about average (maybe a hair under par) and I feel like it could be cheaper. The name can be hard to pronounce. \"Oops\" is our best guess.\nOupes Mega 3 (3,072Wh): Another great offering from Oupes with stellar performance. The numbers from our test lab slightly favored the Mega 3 over the Mega 5. We also tested the B2 expansion battery with this unit and further improved the numbers for usable capacity. The Mega line continues to impress with both performance and value.\nOupes Mega 5 (5,040Wh): Previous titleholder for \"best extra-large power station,\" the Mega 5 is a beast. It maxes out at 5,040Wh, with a single expansion battery option, the B5, bringing the total to 10.08kWh. At 4,000-watt output with a 7,000-watt surge, you'll be able to power pretty much anything you want (as long as it uses either a standard 120-volt plug or the round RV type). It also has a large solar charging capacity (4,050-watt) and in our tests proved to be the second fastest charging unit, going from 0 to 100% in 214 minutes, or 3 hours and 54 minutes. That ends up being 23.55-watt hours per minute charged, which is the second-highest rate we've recorded.\nOther portable power stations we've tested\n4Patriots Power Sidekick (299Wh): The specs on this small unit are ok - 87% usable capacity is about the norm and it charges at about one watt-hour per minute. That's a bit slow, but not unheard-of for these small units. It does come with a small, 40-watt solar panel, but I think it is still overpriced at $500.\n4Patriots Power Generator 2000X (1612.8Wh): While I do think this is a better engineered product than the smaller Sidekick offering from 4Patriots, I still feel like their product lines are overpriced. Again, they do come with small solar panels, but that is hardly worth double the sticker price in many instances. Usable capacity is still in line at 87% but this size unit only charging at 7Wh/min is a bit underpowered in my opinion.\nAmpace Andes 600 Pro (584Wh): This is an OK unit. It sits right around the industry standard for usable capacity. We did find that the charging moved much slower than the marketing materials claim: 90 minutes to 80% charge vs. the advertised 60 minutes.\nApace Andes 1500 (1462Wh): There are a couple of notable improvements between the smaller Pro unit I previously tested and this larger 1500Wh unit. For one - weight. The spec capacity is almost three times larger, and normally capacity and weight are proportional, but despite the larger capacity, the 1500 weighs only a little over double the smaller unit. This thing charges quickly too. It doesn't quite hold up to the company's 55-minute charge time claim, but one hour and sixteen minutes isn't bad!\nBailibatt 300W (257Wh): Another small, affordable unit. The Bailibatt comes in at 84% usable capacity, which is good. It takes 11 hours to charge, which is.... not as good. If you have specific limited charging needs and plenty of time to recharge, the price tag makes it worth considering.\nBigBlue Cellpowa 500 (537.6Wh): This is a better-than-average performing unit at better-than-average pricing, but there's nothing outstanding about it.\nDabbsson DBS2300 (2,300Wh): I love that it's a modular format, expandable up to 8.33kWh. The 87% usable capacity is good and charges relatively quickly. It charges at over 18 watt-hours per minute, for a total of 122 minutes to charge the entire 2,300Wh.\nDakota Lithium PS 2400 (2,060.8Wh) Update: Out of stock: The Dakota Lithium PS2400 is the fastest-charging portable power station on our list. Now, looking at our test data, that doesn't mean that it took less time to charge than any other unit, but, in using our residential AC charging method, it instead indicates the unit that charges the most watt-hours per minute. This method allows the large-capacity units to compete in this category with much smaller units that naturally charge much faster. It showed a respectable 90.72% in usable capacity while also giving us our fastest charge metric to date. We showed a charge rate of 26.76 watt-hours per minute, just edging out the Oupes Mega 3 by about 0.3 Wh/m. Also notable is the unit's 10ms switchover time. Charging from 0% to 100% in 77 minutes, the PS2400 sees 26.76 watts-per-minute charging from a standard 120-volt, 20-amp residential outlet. A close second was the Oupes Mega 3 at 26.48 watts per minute, followed by the VTOMAN Flashspeed in a more distant third at 24.9 watts per minute. Different units make up the bulk of the next-best contenders, from companies like Oupes, VTOMAN, UGreen and Goal Zero. If charging to recover your total capacity is a major concern for you, these are the units to look at. In addition, they all offer simultaneous charging from other inputs like solar or other DC inputs if you need to up your recharge game.\nDaranEner NEO2000 (2,073.6Wh): This unit didn't win any categories, but it did perform in the top tier for our charge tests and came in about average for our usable battery capacity tests. This sturdy unit has plenty of features and one of the lowest prices per watt-hour.\nDeeno GT S1500 (1,036Wh): We previously tested the Deeno GT X1500, and the S1500 is a big step up. It has the same capacity and same pricing, but with nearly 20% more usable capacity than the previous model and it charges nearly five times faster.\nDeeno X1500 (1,036Wh): The X1500 did not fare well in our tests. It came through with one of the lowest usable capacity scores we've collected so far at 69.88%, meaning you see about 724Wh out of the stated 1,036Wh. For the price, there are better options.\nDJI Power 1000 (1,024Wh): I want to note first off that I do not have a drone that's compatible with the SDC super-fast charge function for select DJI drones. I think that's likely to be one of the best selling points for this particular unit. I'm also happy that there are two 140-watt USB C ports. Outside of those features, there isn't much else to talk about. It does charge fast but it came in low on our usable capacity test.\nDuracell Power 500 (515Wh): This is the first Duracell unit I've tested, but not the first battery brand to put out a portable power station (see Energizer at the top of this list). So far, the results are similar. Test results come back with under-average performance and questionable prices.\nDuracell M250 (219Wh): Overall, this smaller unit is proportionally comparable to the larger Power 500 Duracell model. The M250 came in at 75% usable capacity, just a couple of points higher than the Power 500. You're getting approximately half the capacity for half the price. Charging is also in line, taking around the same time (4+ hours) to charge half the capacity (at half the input power). I like the cylindrical shape -- I'm guessing Duracell wants it to look like that familiar battery profile -- and that the lid opens up to allow for power cable storage within the unit.\nEBL MP1000 (999Wh): This is not a bad little unit. Doesn't charge too quickly, but overall usable battery capacity is good. It has a wireless charge pad and lots of options for inputs and outputs. It isn't something I'd run out to buy for myself, but if you can catch it on sale, it could be a low-cost way into a smaller power station.\nEncalife UAF550 (595Wh): Of the three Encalife chargers, this has the largest usable capacity percentage at 87% but the slowest charging at 1.98-watt hours per minute.\nEncalife UAF1100 (992Wh): Industry standard usable capacity here at about 84%, but a bigger drop in the charge capabilities at 3.35-watt hours per minute from its larger sibling.\nEncalife YUE2000 (2,048Wh): A bit of variation in our model hierarchy groupings with Encalife. As you might expect, charging capabilities do increase with larger units. The YUE2000 being the largest of the three charges relatively quickly, at about 11.13 watt-hours per minute. In this series, the usable capacities trend in the other direction, with this unit showing 73% usable capacity.\nEnernova ETA 288 (288Wh): This is another example of a hierarchy of models where the smaller units underperform, but larger models improve. This unit took about 3 hours and 40 minutes to charge, but it reached about 81% usable capacity.\nEnernova ETA Pro (1,050Wh): Moving up a notch, this one has 83% usable capacity and charges 1kW in about 1 hour and 30 minutes. It's a better showing and about 10 cents cheaper per watt-hour than its smaller sibling.\nEnernova ETA Ultra (2,150Wh): This is the best of the three, sporting 2160Wh, 87% usable capacity and it charges in under 2 hours.\nEnergizer PPS700 (626Wh) (Update: Currently Unavailable): OK performance and features overall, but one of the lowest-tested capacities, making the usable capacity closer to 477Wh.\nEtaker M2000 (2008Wh): While the M2000 didn't win any of our categories, I do like the platform. More manufacturers are offering increased capabilities like ones you'll see here: semi-solid state battery engineering, modular platform to increase capacity, ability to expand to 240VAC, direct EV charging and a few more use cases that are more niche. It's a reasonable grab, especially if you're looking for something more sturdy like cold weather charging -- all with a usable capacity percentage of 91 -- above average for the units we normally test.\nFanttik Evo 300 (299Wh): This is a solid pick in the small power station category, and this unit has my favorite display: It's extra large and easy to read. We did see average performances on our charging and capacity tests.\nGenerac GB1000 (1,086Wh): Generac has been a household name in the power landscape (especially generators) for dozens of years in the US. It isn't that surprising to see it here in the portable battery space. I wasn't blown away by this unit. It tested quite average (if not a smidge below on charge speed) but overall, still does what you need: to transport power.\nGeneverse HomePower One (1,002Wh): This unit was the second slowest overall to charge, but did well on its usable capacity rating at 91%. Its display is small but offers all the standard input and output features you'd want.\nGeneverse HomePower One Pro (1,210Wh): This is the grownup version of the Geneverse HomePower One. The feature specs are about the same, but at $500 more, you're only getting about 200 extra watt-hours. In addition, the standard One model comes in at 91% usable capacity versus the Pro model's 73%. That gives you 912.6 usable watt-hours with the standard and only 886.7Wh on the Pro. The Pro charged in almost a quarter of the time it took the standard version.\nGoal Zero Yeti 200X (187Wh):: The Goal Zero products are solidly made, but we got the lowest score in our \"usable capacity\" tests from this unit. It's about 65% compared to the industry-accepted norm of 85%. There are better products in the small portable power station category.\nGoal Zero Yeti 700 (677Wh): Overall this unit tested OK; nothing outstanding. One of the more interesting aspects of the design is the use of plastic protective 'flaps' covering the in/output ports. The use case here seems to be for a more rugged durability for camping or otherwise roughing it where you might have an increased exposure to mud, dirt, dust or water. Outside of those environments, the flaps can be bothersome.\nGoal Zero Yeti Pro 4000 (3,993.6Wh): Runner-up for our best extra-large power station title, the Yeti Pro 4000 is a tank (which, by the way, is the name of the expansion battery: \"Tank Pro 4000\"). You get tons of input and output options, and it is expandable to 20kW capacity. We were able to charge this via standard AC outlet in 2 hours and 49 minutes, giving us our third-fastest charging rate so far at 23.63 Wh/min charged. It also offers 3,000-watt solar input. If you're looking into home backup, also check out the Haven10 transfer switch accessory to bring your home online.\nGoSun PowerBank 1100 (1,100Wh): I wanted to like this unit more, partially because of GoSun's extended offerings of solar-friendly devices. As far as capacity goes, this runs in the middle of the pack, but man is it slow to charge. It took nearly 12 hours -- over six times as long as our largest power station (Jackery Explorer 2000 Pro) -- which offers nearly twice the capacity. At $1,199, I'd like to see a faster charging option and more outputs or at least wireless charging.\nLion Energy Safari (1,612Wh): I tested two units, the first I've had my hands on, from Lion Energy. Two immediate observations on the superficial side: First, I like the physical packaging of these units. It reminds me of Oupes, which I also like. Second, these things sound like the names of energy drinks. Otherwise, I wasn't impressed. This larger unit also had a bad connection to its display screen. In general, the color screen looks better than most other options. In my case, I had several lines plaguing each view.\nLion Energy Summit (665Wh): The TL;DR is above, with the larger unit, but for additional context, units tested about average in terms of usable capacity. My main performance complaint is the charge speed. Both units are a bit low for their capacity category. I would be happier if the Summit charged at the Safari rate, and the Safari was retooled for nearly double its current speed.\nLitheli PowerHUB B600 (562Wh): This one can be slow to charge, but otherwise, there's a lot to like here. It has good usable capacity at a decent price, since it's currently marked at about 40% off. Litheli is also offering a battery platform (U-Battery) with this unit. Two smaller batteries plug into the main unit that you can then use with a variety of other tools. Check out our upcoming coverage on handheld vacuums to see Litheli's performance there.\nLitheli PowerHUB Eclair1000 (1,069Wh): Another unit from Litheli offering the U-Battery platform, but it's closer to double the capacity of the last unit we tested. The capacity score was low, but the charge speed has vastly improved from the B600. Worth a look if you're interested in the U-Battery platform.\nMango Power E (3,530Wh): I mentioned this unit earlier as the runner-up in the fastest charging category. This thing is loaded with features, even allowing you to provide 240-volt service by linking a second unit. There are also battery expansions for the Mango Power E. The one downside is the price tag, as this unit also comes through as the most expensive portable power station with a list price of $4,250.\nMilwaukee M18 Carry-On Power Supply: It isn't a great portable power station. You're probably considering buying it because you're already on the platform. If that's the case, I say go for it. It will work with all batteries on the M18 platform, so you have some control over how much juice you want to carry around. This will put a fair amount of convenience into situations for people who are Milwaukee tool users and find themselves in energy-shy situations.\nMonster Power Grid 300 (296Wh): The Power Grid 300 can be slow to charge but did test at over 90% usable capacity. It has all the bells and whistles you'd expect at this level at a price that's a tad high.\nOscal PowerMax 700 (666Wh): Another unit that didn't perform particularly well in our tests, but does boast a ton of features, including a \"non-stop continuous power supply mode.\"\nOukitel BP2000 (2,048Wh): This is the first unit we've tested from Oukitel (along with its expansion battery -- we will be publishing more on expansion batteries soon) and we were pleasantly surprised. To begin, the BP2000 scored an impressive 90% on usable battery capacity and also scored well in our charge tests, taking less than 2 hours to charge all 2048Wh of capacity. Oukitel is also leaning into the modular and expandable approach, allowing you to add up to seven additional units for a total of just over 16kWh of power. The BP2000 also boasts sub 10ms switchover time as its UPS feature.\nPecron E1500 (1,536Wh): I will say that I'm a bit torn with this unit. I tested the E2000LFP model first and was impressed with the results. The E1500LFP did not fare as well. Specifically, the usable capacity came in especially low at 68% compared to the E2000 at 94%. Other than that, the charging is beefier, charging at about twice the rate as the other unit. And you still get perks like wireless charging and expandability from 1536Wh up to 7680Wh.\nPecron E2000LFP (1,920Wh): I discussed this unit briefly earlier as the runner-up to the Delta Mini in the \"best portable power station for camping\" race. It has more options than the Mini and is suitably priced. I'm also a fan of any of the companies that adopt the modular approach with the capability to expand capacity with external batteries, like Pecron has done. You can also pick up a rolling caddy for the unit if you're on the go.\nPhyleko ENF1000S (1,024Wh) (Update: Currently Unavailable): I've seen this body style before in the GoSun 1100; it feels super sturdy and I do like the larger colorful display. Otherwise, this unit landed just under average in our tests.\nPower Cache 300 (293.76Wh): We tested a trio of power stations from Power Cache. The 300 model did well as far as usable capacity goes (91%) but took over 7 hours to charge. Another upside is that it's affordable, with a $200 retail tag.\nPower Cache 600 (642.6Wh): Costing $250 more than its smaller sibling, this middle child showed the least impressive performance of all three models, coming in at only 72% usable capacity and taking over 8 hours to charge to 100%. If price is your main concern, it's an affordable option.\nPower Cache 1000 (1,075Wh): The largest of the three units, this one performed moderately, coming in at 82% usable capacity and taking about the same amount of time to charge as the small 300 model, which is just over 7 hours. That does mean it charges over four times faster than the small unit, but 7 hours is still 7 hours. Selling at $470.\nRenogy Phoenix 200 (189Wh) (Update: Currently Unavailable): Slower to charge, but it has 96% usable battery capacity paired with the lowest price of any unit we've tested. This a great option for smaller use cases or for people generally interested in checking out portable power stations at a reasonable price.\nRenogy 1000 (998.4Wh) (Update: Currently Unavailable): This is another decent performer. It charges fast enough for its relative capacity category, but only offered us about 80% usable capacity. Normally, I wouldn't be too bothered, but the smaller Renogy unit we tested clocked in at 96% usable capacity, so I was hoping for more.\nRockpals 300W (Update: Currently Unavailable): This unit also came in under the line in usable capacity. Given the industry standard of 85%, Rockpals' 78% is lacking. In terms of charge speed, this unit is one of the faster small portable power stations. It has decent features and kind of looks like a handheld radio.\nRocksolar Nomad RS650 (444Wh): Until the company updates this unit, there are likely better options for almost anything you're looking to do. It has a high price, low usable capacity, slow charge time and is low on features and options, but it does work.\nRunhood Rallye 600 (648Wh): There are a couple of these types of units on the market now, and I've been waiting for their arrival. This Runhood unit is the first modular-style portable power station I've been able to get my hands on, and I love what it means for the industry. Performance-wise, this model was about average, but it could offer you more flexibility and convenience than many other units. The batteries are swappable, so you can pick up extras, in addition to standalone AC and USB modules that can use those extra batteries without being plugged into the main power station unit. This could be a game-changer for trips where every member of the family is off in a different area draining some electronic device. I look forward to adding a \"best modular power station\" category soon.\nRunhood Rallye 1200 (648Wh) (Update: Currently Unavailable): The capacity is the same for this unit as it is for its younger sibling, the 600 (listed above). The 600 and 1200 designations refer to the constant power output in watts, with each unit's peak power doubling that constant power number. You do get an extra AC outlet but the increase in power output is the main difference. Likely worth it if you're into the modular design, but need more power than the 600 has to offer.\nSegway Cube 1000 (1024Wh): I am always excited to check out new entries into the portable power station category, especially from companies that are already in similar spaces. The Segway Cubes are a solid first product, leaning into modularity and avoiding an attempt to match all the latest bells and whistles. The units show an average usable capacity percentage, the same for charge speed.\nSegway Cube 2000 (2040Wh): The Segway Cubes are offered in retail capacities of either 1 or 2kW. The platform is expandable to 5kW. The interesting choice is Segway's decision to offer both the 1kW and 2kW retail options, when both options are otherwise identical and identically expandable. It seems that either retail option contains an identical inverter and 1kW battery. The Cube 2000 offers an additional battery expansion that goes between the two previously mentioned units. At that point, you can add a total of four battery expansions to max out the platform at 5kW.\nTogo Power Advance 346 (346Wh): This unit held the title for best small portable power station for about two years on this list; solid performance, great features and an attractive price tag.\nUgreen Power Roam 600 (680Wh): This unit didn't do great in our tests, but it has a reasonable price. It charges quickly, but that has more to do with the smaller capacity than an elevated charging capability.\nUgreen PowerRoam 2400 (2,048Wh): I was happy to see that this model did better than the previous smaller model we tested. 83% on usable capacity and it charged in the same amount of time as the smaller unit, about 1.5 hours for each one, which means the 2400 was charging at about four times the rate. This one also has wheels and a telescoping handle for ease of movement.\nVTOMAN Flashspeed 1000 (828Wh): This is the second VTOMAN Flashspeed I've tested and the smaller of the two. This smaller unit didn't fare as well as its big brother in our tests. While it's a capable machine, I struggle to find a scenario where the minimal cost difference between the two would keep me from buying the 1500 over the 1000.\nVTOMAN Flashspeed 1500 (1,548Wh): This unit did about average on our usable capacity test, but, charging from 0 to 100% in 64 minutes, the FlashSpeed 1500 sees 24.19 watts-per-minute charging from a standard 120-volt, 20-amp residential outlet, which is one of the fastest charge rates we've seen here in the test labs. If charge speed and time are primary concerns for you, it's almost impossible to do better than the Flashspeed 1500.\nYoshino B330 SST (241Wh): This is a cute little power station. It has a USB-C 100-watt port, a couple of AC outlets and is pretty light for what it offers. It comes in just above average for usable capacity but does have a slow charge rate. If you're looking for a little power in a compact package, it's worth considering.\nYoshino B4000SST (2,611Wh): This unit tested fairly well in our lab. 87% usable capacity, blazing-fast charge speeds and a decent feature set. It's an option worth considering, if you can find it on sale.\nZendure SuperBase Pro 2000 (2,096Wh) (Update: Out of stock): The first unit we tested with the Li-NMC battery composition. This unit also just missed the best large portable power station title. It has a weight-to-capacity ratio, likely thanks to the NMC composition, and boasts our highest solar charging capacity to date at 2,400 watts. Its telescoping handle and wheels make it easier to manage, but the form makes it better for navigating paved walkways than \"off-road\" terrain.\n70mai Hiker 400 (378Wh) (Update: Out of stock): This unit didn't fare too well in our tests, coming in at about 75% usable capacity (versus the industry standard of 85%) and taking about 4 hours and 30 minutes to charge its 378Wh.\n70mai Tera 1000 (1043.9Wh): The larger of the two 70mai units tested better, hitting the industry standard for usable capacity and taking about 20 minutes less to charge nearly three times the capacity of the smaller model.\nPortable power station FAQs\nWhat battery types are most common in portable power stations?\nHow many years do portable power stations last?\nWhat can you run on a portable power station?\nJackery vs. Anker: Which portable power station brand should you choose?\nCan a power station run a refrigerator?\nHow long can you run a portable power station?\nHow is a portable power station different from a generator?\nCan you use solar panels with a portable power station?\nCan you use a portable power station as a UPS?\nWhat is the difference between a power bank and a portable power station?\nCan a portable power station be your home backup?\nMore home recommendations\n- 10 Generators to Keep Your Lights On\n- Best Fire Pits\n- Best Flashlights\n- Best Smart Garage Door Controllers\n- How to Make a Cheap, Simple Lawn Sprinkler System\n- How to Grow Vegetables Without a Backyard\n- Backyard Movie Night: What You Need for Summer Cinema Under the Stars\n- Best Portable iPhone Chargers and Phone Banks"
    },
    {
      "url": "https://www.cnet.com/home/energy-and-utilities/direct-energy-review-an-accessible-provider-with-plenty-of-options/",
      "text": "As one of the biggest names in the industry, if you're shopping for an energy supplier in a deregulated market, you're likely to come across Direct Energy.\nDirect Energy was founded in Toronto in 1986 but is now a subsidiary of international giant NRG Energy and is based in Houston. The company claims to supply nearly 4 million residential and business customers with electricity, natural gas and home efficiency services. It currently operates as an energy supplier in several deregulated markets across the eastern US and Alberta, Canada.\nDeregulated energy markets result when utilities and other energy producers opt to make the energy they generate available on a wholesale energy market. Suppliers buy off the market and resell to you at retail rates. This all happens on paper via contracts and financial transactions -- local utilities still physically generate and deliver energy to people within their geographical footprint, but who those people pay for that energy is now up to them.\nDirect Energy offers a wide variety of different fixed price contracts for terms as short as month-to-month all the way up to five years. It's also possible to sign up for a green energy plan in which the company will offset up to 100% of your energy consumption with renewable energy certificates that are tied to energy produced by a sustainable source like wind, solar or hydropower.\nThe company also offers other novel incentives, like plans that include free energy on nights or weekends (or both), or an Amazon Prime subscription.\nDirect Energy is among the largest and most financially stable of an emerging crop of energy suppliers in deregulated markets, thanks to its ties to NRG.\nThat said, it has a \"D\" rating with the Better Business Bureau backed up by dozens of recent one-star reviews, many of which seem to relate to billing issues. We don't place a lot of stock in online reviews, but there seems to be a clear and consistent pattern of problems.\nAs always, before entering into any agreement, be sure to do your own research and due diligence, and don't be afraid to ask sales representatives what the company has done to address all the problems you've read about online.\nPros and cons of Direct Energy\n| Pros | Cons |\n|---|---|\n|\n|\nWhat states and provinces does Direct Energy operate in?\n| Plan type | Service areas |\n|---|---|\nElectricity | Alberta (Canada), Connecticut, Delaware, Illinois, Massachusetts, Maryland, New Hampshire, New Jersey, New York, Ohio, Pennsylvania, Texas, Washington, D.C. |\nNatural Gas | Alberta (Canada), Illinois, Indiana, Maryland, Massachusetts, Michigan, New Jersey, Ohio, Pennsylvania |\nRenewable energy | Alberta (Canada), Delaware, Illinois, Massachusetts, Maryland, New Hampshire, New Jersey, New York, Ohio, Pennsylvania, Texas, Washington, D.C. |\nDirect Energy: Types of plans offered\nFixed-rate plans: Direct Energy offers mostly fixed-rate plans for electricity and natural gas, with up to 100% renewable energy plans also offered in many states. You can choose the contract length you want (up to three years in some markets) and for that period you'll be guaranteed energy at a set rate. At the end of the term, the rate will update to the current market rate if you opt to renew. This could be a good option if you're satisfied with the current cost of energy and don't think it will drop significantly in the near term, or if you just like knowing what you'll be paying for energy each month.\nVariable rate plans: Variable rate plans are essentially like paying market rates for energy, with prices that will fluctuate. Direct Energy only offers this option in Alberta and Texas. It could be a good choice if you expect energy prices to go down in the near future.\nBundled plans: Sometimes energy suppliers will bundle electricity and natural gas service in a single plan for additional savings. Direct Energy currently only offers this option in Alberta.\nRenewable energy plans: Direct Energy offers \"green energy\" plans or add-ons supported by \"Renewable Energy Certificates that are purchased and retired in an amount sufficient to match your annual consumption.\"\nDirect Energy says the RECs are sourced from \"eligible renewable energy resources like biomass, hydro, solar or wind.\" This means it isn't directly producing renewable energy itself, but rather buying certificates tied to production from green producers to offset the energy its customers use. It's a potential option if you want to support renewable energy development on your monthly bill.\nDirect Energy: Types of rates and plans available\nElectricity plans\n| Plan type | Plan type description | Contract lengths | States/provinces available |\n|---|---|---|---|\nFixed-rate plan | Fixed-rate plans have a set price per kilowatt-hour of monthly electricity consumption for a certain duration of months | Month-to-month, 9 months, 10 months, 11 months, 12 months, 13 months, 14 months, 15 months, 16 months, 18 months, 24 months, 27 months, 36 months (not all plans available in all markets) |\n|\nVariable rate plan | Rates per kilowatt-hour are based on the fluctuating energy market | Month-to-month in Texas; 1 year or 3 years in Alberta | AB, TX |\nNatural gas plans\n| Plan type | Plan type description | Contract lengths | States/provinces available |\n|---|---|---|---|\nFixed-rate plan | Rates per therm are fixed for a certain duration of months. | 4 months, 5 months, 6 months, 9 months, 12 months, 18 months (not all plans available in all markets) | AB, IL, IN, MD, MA, MI, NJ, OH, PA |\nVariable rate plan | Rates per therm are based on the fluctuating energy market. | 1 year, 3 year, 5 year | AB |\nRenewable energy plans\n| Plan type | Plan type description | Contract lengths | States/provinces available |\n|---|---|---|---|\nSimply Green and similar 100% renewable energy plans | Direct Energy purchases renewable energy certificates tied to solar, wind, hydro or biomass-based energy production projects. | Month-to-month, 12 months, 15 months, 18 months, 24 months, 27 months, 36 months, 5 years (not all plans are available in all markets) | AB, DE, IL, MD, MA, NH, NJ, NY, OH, PA, TX, DC |\nBundled plans\n| Plan type | Plan type description | Contract lengths | Provinces available |\n|---|---|---|---|\nGas and electric dual fuel plan | Fixed- or variable rate plans available with optional renewable energy add-ons | 1 year, 3 years | AB |\nOther services offered by Direct Energy\nWhole home protection maintenance and repair plans | A la carte options to keep up a home's HVAC, electrical, appliances, plumbing, water and sewer. |\nWhy it's important to check the fine print\nWhen shopping on Direct Energy's website, each plan includes links to something like \"plan documents,\" \"plan details,\" \"terms of service\" or the more cryptic \"EFL\" for electricity facts label. Be sure to actually read the fine print on these documents, including some specific details:\n- Average price per kWh.\n- Contract duration.\n- Contact information.\n- Cancellation or early termination fees.\n- Electricity usage credits.\n- Moving or transfer fees.\n- Late payment fees.\n- Potential usage penalty charges.\n- Auto bill pay discount requirements.\n- Time of use rates or escalators.\n- Utility delivery charges.\n- Renewable energy percentage.\n- Renewal terms.\n- Utility delivery charges.\nConfusion over these items surfaces repeatedly in online reviews and complaints about the company. Being knowledgeable about this information before signing a contract can prevent potential misunderstandings and make you better prepared to advocate for yourself should problems arise.\nBottom line: Is Direct Energy a good choice?\nDirect Energy and its parent company NRG likely aren't going anywhere anytime soon. This strong foundation makes them worthy of a closer look as you shop for energy, as it provides leverage for the company to offer several options across multiple markets.\nAs we all know from living on Earth in 2023, working with larger companies offering attractive terms can frequently be offset by shortcomings in the customer service department. A concerning number of Direct Energy customers report negative experiences online. Be diligent in your research and grill representatives about how they're working to do better.\nHow do I sign up for Direct Energy?\nYou can enroll in a Direct Energy plan by entering your ZIP code into the Choose Energy marketplace. Here you can shop and compare Direct Energy to other providers and plans available in your area.\nYou can enroll in most plans online via chooseenergy.com or through a Choose Energy telephone representative. Choose Energy is a CNET partner site, which (like CNET) is owned by Red Ventures."
    },
    {
      "url": "https://www.cnet.com/home/energy-and-utilities/is-the-home-battery-the-new-generator/",
      "text": "We've all been there: The lights go out and the power company sends you a text message. A tree fell on a transmission line or the weather turned severe, and you'll be out of electricity until people in hard hats can get things running again.\nIn 2021, the average American household experienced a little more than 7 hours of power outages, with the typical outage lasting 2 hours, according to the US Energy Information Administration.\nWhen that happens, you probably find yourself wishing you had a backup source of power. For years, that's typically meant a generator fueled by gasoline, propane, natural gas or some other fossil fuel. More recently, it might mean a set of solar panels on your roof and a battery in the basement or the backyard, a system that can set you back tens of thousands of dollars.\nOffering the full suite of Generac's gas powered generators and rechargeable backup batteries, Canter Power Systems has been providing back-up power options for 70 years and is now the largest full-service generator installer in the nation.\nBut what about just the big home battery by itself?\n\"For somebody who's motivated to get a generator, they're also motivated to get a battery,\" Jigar Shah, director of the Department of Energy's Loan Programs Office, told CNET.\nAt the renewable energy industry's annual RE+ trade show in Las Vegas in September, we spoke to industry folks to figure out if a standalone home battery really can serve the function of a generator. Here's what we found.\nCan you get a battery without solar panels?\nA home battery that provides something like 12 kilowatt-hours of backup electricity might cost you $10,000 or more, but that still pales in comparison to the cost of the battery and solar panels together, which might run you closer to $30,000. (Getting exact estimates can be difficult because these systems are designed for your specific home and needs, and because the solar industry isn't super transparent about pricing.)\nSome batteries can only be installed alongside solar panels, and it's definitely a worthwhile consideration if you're in the market to become energy independent from your utility. Solar and battery companies are pivoting from the idea of selling \"solar panels\" to the idea of selling a complete \"solar energy system,\" or even merging solar panels, batteries and smart home technology to create one cohesive smart energy system.\nBut the basic answer to the question is, yes, you can get a home battery with no solar panels attached. And the battery market is getting competitive, with a lot of companies -- both those with familiar names and those that have only been around a few years -- showing off products on the RE+ show floor.\nThat evolving market means prices are getting more affordable. \"Battery prices recently, over the past few months, are definitely coming down,\" said Zoe Gaston, principal analyst for US distributed solar at the consulting and research firm Wood Mackenzie.\nThe downside to batteries without solar panels is that your battery has to be charged by something. In this case, it's being charged by energy from the grid that you pay your power company for. That energy might be expensive, and it might be generated at a polluting coal- or gas-fired power plant. Keep that in mind.\nTax credits change the math on batteries\nIt used to be that you couldn't get a federal tax credit for a battery unless it came attached to solar panels. The Inflation Reduction Act, passed by Congress in 2022, changed that. Now a battery is eligible for the 30% residential clean energy credit, just like solar panels, as long as it's at least 3 kilowatt-hours in capacity.\nThat change goes a long way toward making batteries more affordable.\n\"Resiliency, to a typical homeowner, can be achieved in a couple of ways. The conventional way people have done it for years is just to install a backup generator,\" said Chris Rogge, solutions architect in clean transportation and energy at Black & Veatch, a construction and engineering firm. \"That has its own challenges as far as emissions and noise and maintenance go, but also economic inequality. Not everyone can afford to throw a $10,000 backup generator on their house.\"\nState-level policies are also encouraging growth in the battery market and nudging people toward installing them. In California, changes to solar net metering policies (the way you get paid for surplus energy sold back to the grid) are encouraging homeowners to store and use their own energy rather than sell it.\nWhat batteries can do that generators can't\nGenerators run when you need them, when the power goes out. Batteries don't just have to be there as backups.\n\"Standalone energy storage can be used more economically than a backup generator, because it's not a stranded asset during periods when there isn't a power outage,\" Rogge said.\nSome states and utilities have what are called time-of-use rates, in which electricity costs more during times of peak demand (think the late afternoon and early evening) and less during times of lower demand (such as the middle of the night). \"You can use energy storage to store energy when it's cheaper and run off of your energy storage during peak hours,\" Rogge said.\nThat function, known as energy arbitrage, helps in more ways than one. It can save you money -- further increasing the value proposition of getting a battery. Instead of being something you buy for several thousand dollars and use only when the power goes out, it can save you money every single day.\nBut the fact that it's being used every single day might itself be an advantage, said J. Stephen Pollock, chief revenue officer of Lunar Energy, which makes batteries. If a battery is functioning regularly, you'll likely notice issues during a time you don't really need it. With a generator, you won't use it -- or realize there's a problem with it -- until you need it.\nA battery is also cleaner, meaning you won't have to worry about fire risks, smells, noise or fumes as you would with a generator. And you don't have to worry about maintaining a fuel connection, which sometimes requires people to test and certify them every year. \"Buying a battery is cheaper than that,\" Shah said.\nBatteries also tend to have longer warranties than generators -- typically 10 years or more, compared to three to five years for generators.\nWhat generators can do that batteries can't\nThe problem with batteries is that, if there's nothing to charge them (like solar panels), you're stuck with however much energy is in them when the lights go out. That might not be a whole lot. The average American home uses roughly 900 kilowatt-hours of electricity per month, or about 30kWh per day. A Tesla Powerwall, one of the most popular home batteries out there, holds up to 13.5kWh -- less than half a day of normal energy use.\nA generator, meanwhile, will keep producing electricity as long as it has fuel, and that could be a lot longer than a battery will last. So for extended outages, a battery without solar panels will be no use once it's drained, but a generator will keep chugging.\nThe typical power outage isn't a multi-day blackout: The average power outage in the US is about 2 hours, more than enough time for a battery. And a battery can last longer if it's only used to power essential electrical loads instead of everything."
    },
    {
      "url": "https://www.climatecentral.org/climate-matters/surging-weather-related-power-outages",
      "text": "Climate Matters•September 14, 2022\nSurging Weather-related Power Outages\nKEY CONCEPTS\nBetween 2000 and 2021, about 83% of reported major outages in the U.S. were attributed to weather-related events.\nThe average annual number of weather-related power outages increased by roughly 78% during 2011-2021, compared to 2000-2010.\nFrom 2000-2021, there were 1,542 weather-related power outages. Most outages were caused by winter weather (22%), tropical cyclones (15%), and other severe weather (58%).\nSoutheast, Midwest, and Northeast experienced the greatest number of weather-related outages from 2000-2021.\nThe states with the most reported weather-related power outages were Texas, Michigan, California, North Carolina, and Pennsylvania.\nREPORT: Surging Power Outages and Climate Change\nThe power grid is essential, but vulnerable.\nWe all depend on the electricity system that serves homes and businesses across the U.S., but this system is vulnerable to large-scale outages caused by extreme weather.\nHurricanes, wildfires, ice storms, flooding, and heat waves are growing in frequency, duration, and/or intensity with climate change—which puts stress on the nation’s aging electrical infrastructure.\nThe effects of climate change can both increase electricity demand and compromise electricity supply. And most of the nation’s electrical infrastructure wasn't built to function in our present-day climate. Further warming could impact electricity system performance, resilience, and capacity to meet demand.\nPower outages are rising. Weather is often the cause.\nClimate Central analyzed major power outages (during which at least 50,000 customers lost power) in the U.S. from 2000-2021, as reported by utility companies to the federal government and the North American Electric Reliability Corporation.\nThe decade from 2011-2021 experienced 64% more major power outages than that from 2000-2010.\nAbout 83% of all reported power outages from 2000-2021 can be attributed to a weather-related event.\nBetween 2011 and 2021, the average annual number of weather-related power outages increased by roughly 78% compared to 2000-2010.\nOutages by type of weather event\nUtilities are required to describe the cause when reporting major power outages. The cause reported by utilities is often based on qualitative criteria rather than using specific quantitative thresholds (e.g., for severe weather). Climate Central conducted additional analysis to more accurately assign weather types to reported outages, where possible.\nFrom 2000-2021, there were 1,542 weather-related major power outages, of which:\n58% were caused by severe weather such as high winds, rain and thunderstorms\n22% were caused by winter weather, including snow, ice, and freezing rain\n15% were caused by tropical storms and hurricanes\nExtreme heat and wildfire accounted for the remaining ~5% of outages\nRegional weather-related outages\nBecause of the interconnected nature of the grid, some types of extreme weather, including winter storms and hurricanes, can affect large areas and cause power outages across multiple states and regions.\nThe number of weather-related outages varies among U.S. regions—which partly reflects the weather each region experiences, as well as relative population density and infrastructure age.\nThe Southeast had the most weather-related major outages (474).\nThe Midwest ranked second in total weather-related outages (363), but first in outages due to severe weather (295).\nThe Northeast was third in both weather-related (346) and severe weather-related (183) outages.\nThe states with the most reported weather-related power outages from 2000-2021 were: Texas (180), Michigan (132), California (129), North Carolina (97), and Pennsylvania (82)—all of which are ranked among the top 10 most populous states, however the populations of Texas and California are nearly three- to four-times larger than Michigan or North Carolina.\nBuilding a more resilient power system\nThere are a number of promising and innovative solutions to build electricity security into our system now, especially alongside the anticipated near-term growth in renewable energy capacity. Here are a few:\nMicrogrids are self-sufficient energy systems with a smaller geographic footprint.\nSmart grid technologies allow operators and customers to better assess grid stability.\nHardening the grid refers to measures that fortify the system against damage. Examples include tree trimming along power lines and burying overhead transmission lines.\nBidirectional charging, although not yet a standard feature for most electric vehicles, would allow vehicles to power homes during blackouts and serve as an energy storage resource for the grid.\nIncentives can further encourage customers to cut back on usage during peak times.\nPOTENTIAL LOCAL STORY ANGLES\nWeather and climate disasters in your state or region\nNOAA’s interactive tool allows you to visualize the frequency and cost of billion-dollar weather and climate events over time for the country, geographical regions, and states. The EIA has a map to help identify risks to energy infrastructure from significant storms and other weather events. Local utility companies often provide current power outage maps and updates by zip code.\nAre individuals and facilities in your area prepared for power outages?\nFEMA and the CDC offer preparedness and safety guidance for power outages. And the Substance Abuse and Mental Health Services Administration provides research on how disasters affect low-income communities.\nTools for reporting on extreme weather events and disasters\nJournalism schools and organizations provide advice for responsibly reporting on disasters, including focusing on safety, data, and cultural sensitivity. Be sure to check out Climate Central’s extreme weather toolkits (in English and Spanish) and online workshops for covering disasters.\nLOCAL EXPERTS\nThe SciLine service, 500 Women Scientists or the press offices of local universities may be able to connect you with local scientists who have expertise on weather-related power outages and climate change. The American Association of State Climatologists is a professional scientific organization composed of all state climatologists.\nNATIONAL EXPERTS\nEliza Hotchkiss\nSenior Disaster Recovery and Resilience Analyst\nGroup Manager, Resilient Systems Design and Engineering\nNational Renewable Energy Laboratory\nMedia contact: David Glickson (David.Glickson@nrel.gov)\nRelated expertise: Energy security and resilience\nEric Larson, Ph.D.\nSenior Scientist (Energy Systems) at Climate Central, and\nSenior Research Faculty, Andlinger Center for Energy and the Environment, Princeton University\nContact: elarson@princeton.edu\nMETHODOLOGY\nPower outage data from 2000 to 2021 was collected from the U.S. Department of Energy’s Form OE-417 reports. Major outages are considered to be events that affected at least 50,000 customers. For the purpose of our analysis, we consider only power outages (including blackouts and voltage losses), fuel supply emergencies, and emergency appeals for reduced electricity usages where there was a reported number of customers affected or power lost and where outages were attributed to weather- or wildfire-related causes. We do not include reports of vandalism or cyber-attacks. Regional definitions broadly correspond with those outlined in the Fourth National Climate Assessment with the exception of Hawaii and Puerto Rico. Power outages that affected multiple states and regions were counted in each state and region's total number of events, but were counted only once in the national number of events."
    },
    {
      "url": "https://www.cnet.com/home/energy-and-utilities/how-to-choose-the-right-home-generator/",
      "text": "Experts say that between the years 2000 and 2019, extreme weather events have become more frequent, as has the devastation they often bring with them. January's terrible Los Angeles fires are an unfortunate example of that, and the Environmental Protection Agency has warned that the situation is getting worse all the time. Ever-increasing temperatures, heat waves and other climate changes suggest extreme weather events aren't going anywhere. Those events often have a direct impact on the way we live our lives, not least by taking out the local power grid. Power cuts can be catastrophic, and there's little you can do to stop them from happening.\nThe good news is there are ways you can at least prepare for power outages, including looking at generators, batteries and other ways to provide backup for your home. If you're looking for ways to keep the power at home on during outages, a whole home generator might be a fit. But knowing which one is right for you is dependent on your home and your needs.\nFactors to consider when shopping for whole home generator\nThere are a number of factors to consider when shopping for a whole home generator. First and foremost, you'll want to consider whether a generator is right for your situation. Then you'll need to consider what capacity, fuel type and additional features you might need, all while keeping in mind a budget that makes sense for you.\nDo you need a generator at all?\nBefore anything else, you should ask yourself this foundational question: Do you need one? The reality is that some situations do not necessitate or are not suitable for a whole home generator.\nIf you live in an apartment complex in a populated city, you are unlikely to need this much power and may face challenges even installing one. You are also less likely to experience long-term power outages if you live in densely populated or wealthier areas. Studies suggest rural and suburban areas and low-income neighborhoods are statistically more likely to face extended outages.\nIf you are in a smaller space or do not need to power your whole home and instead just need access to essential spaces or appliances, consider a portable generator or even a home power station that can provide power for essential devices like cell phones or small appliances.\nDetermining wattage needs\nDetermining the wattage necessary to keep your house powered should the grid go down is a key consideration.\nOne practical method is to simply add up the wattage of the appliances you'll want to have access to during an outage. You'll need to regulate usage to ensure that you do not exceed your capacity, but this will allow you to save on both up front costs and fuel.\nA reputable generator dealer or installer should also be able to help you determine which size you need. It's probably best to speak to more than one so you can compare their answers.\nFinding the best fuel\nWhole home generators typically use three main fuel options: natural gas, propane and diesel. Each fuel type has its own set of benefits and downsides.\nNatural gas generators are popular due to the convenience of a continuous fuel supply provided from the utility grid. They're cleaner-burning and require less maintenance compared to other options. However, gas lines can be disrupted by storms, affecting the generator's functionality.\nPropane generators offer flexibility as they can use portable propane tanks or be connected to a larger, stationary tank. Propane has a longer shelf life than gasoline, but is sometimes less readily available than natural gas and the cost can fluctuate. You'll need to monitor and refill propane tanks to make sure you have the fuel necessary to ride out an extended outage.\nDiesel generators are often more fuel-efficient than their gas counterparts and can provide a stable power source for extended periods of time. However, diesel generators usually require more maintenance and the fuel can degrade over time. Storage of diesel fuel also requires attention to prevent contamination.\nTypically generators powered by gasoline or diesel \"must be refilled every 12 to 16 hours depending on the load on the machine,\" says Don Whaley, former president of Texas operations for Direct Energy and adviser to OhmConnect. \"Homeowners choosing this option will need to ensure an ample supply of fuel on hand to carry them through several days of outage.\"\nWhat about a home battery?\nHome battery backup systems store energy that you can use to power your house during an outage. Batteries get that electricity from your home solar system or the electrical grid. As a result, they're much better for the environment than fossil fuel-powered generators. They also might be better for your wallet.\nSeparately, if you have a time of use utility plan, you can use a battery backup system to save money on your electricity bill. Instead of paying high electricity rates during peak usage hours, you can use energy from your battery backup to power your home. In off-peak hours, you can use your electricity as normal at a cheaper rate and recharge your battery when it costs less.\nBatteries connected to solar panels don't require a fuel supply in order to provide power. Solar batteries also come with a high price tag, so the up-front cost will play a major factor for most people.\nKeep your budget in mind\nWhile a generator has a host of benefits, the reality is that budget will be one of the biggest determining factors in most peoples' decisions. HomeAdvisor estimates that whole-house generators range in cost from $5,000 to $25,000. This expense, along with the cost of fuel, will be a limiting factor for many households.\nIf cost is a significant factor, Whaley suggests going with a cheaper, smaller option like a portable generator. \"Smaller generators will run refrigerators, lights, televisions, computers and Wi-Fi routers,\" he says. There are some trade-offs. Most small generators \"will not run central air or heat, so if consumers opt for smaller units, they will need to make allowances for heating or cooling their homes in extreme weather conditions.\"\nWhole home generators and safety\nWhole home generators ensure your safety by keeping essential home systems functioning, but they are not without risks. The potential for carbon monoxide emissions means there is a potential for carbon monoxide poisoning, which can cause headaches and dizziness and even lead to loss of consciousness and death.\nTo address this, many modern generators come equipped with carbon monoxide shutoff switches that automatically turn off the unit if elevated levels are detected. These are essential to your safety and the safety of others in your home. You'll also want to ensure proper ventilation for the device. Generators should be installed away from windows, doors and vents to prevent exhaust gasses from entering your home.\nWhole home generator options\nThere are a number of trusted and reliable brands of whole home generators to choose from, most with modern safety features and flexibility when it comes to capacity and fuel sources that will allow you to find the right option for you and your home. Below are three suggestions of options to get you started, though CNET has not reviewed or tested any of them.\n- Honda EB10000: A whole home backup power option with electric start and fuel efficient power. Built with an advanced carbon monoxide detection system that will shut down should levels get too high. Easy to install, runs on gasoline or natural gas.\n- Generac Guardian Wi-Fi Enabled Standby Generator: A modern generator with a 22-kilowatt capacity, it's capable of powering most homes. It comes with built in safety features and a Quiet Mode. Runs on natural gas or propane.\n- Briggs & Stratton PowerProtect DX 22kW Home Standby Generator: A commercial-grade generator that can be used to keep your whole home powered in an outage. Offers hookups for liquid propane and natural gas with protective features to combat corrosion and other risks. Easy installation and removal. Graded for non-emergency use in case you'd like to go off-grid."
    },
    {
      "url": "https://www.cnet.com/home/energy-and-utilities/battery-backup-buying-guide-heres-everything-you-need-to-know/",
      "text": "As electricity costs continue to rise, solar panels are a smart way to tap into efficient and clean energy from the sun. A recent CNET survey found that 78% of US adults are worried about rising home energy bills, and 70% are actively taking steps toward energy efficiency. If you’re thinking along the same lines, now might be the right time to explore solar power. Installing solar panels and connecting them to the grid can help reduce your monthly bills and cushion costs when the sun isn’t shining. But if you want real energy independence, you’ll need to get a solar battery. Without one, even a roof full of solar panels won’t help during a grid outage -- you’ll still be left in the dark.\n\"Something that people don't consider is that if they're on natural gas, and the power goes out in the winter, they think their heater is going to work, but most have an electric fan, so if the power goes out you still need something,\" said Mike Murphy, owner of Utah-based PrepSOS, which sells solar batteries, generators and other emergency-preparedness equipment.\nPlenty of folks, including those in a recent Reddit thread, often wonder if solar batteries are worth the investment. The short answer is absolutely. A battery completes your solar setup, giving you access to stored solar energy day or night and can keep your lights on and essential devices powered during emergencies. Plus, if your area supports net metering, you could knock extra money off of your electric bill by selling surplus energy back to the grid when it’s most valuable.\nCan solar panels save you money?\nInterested in understanding the impact solar can have on your home? Enter some basic information below, and we’ll instantly provide a free estimate of your energy savings.\nSolar batteries come with a price tag, and choosing the right one can feel overwhelming. That’s where we come in. This guide breaks down everything you need to know to shop smart and find the right solar battery for your home.\nHow solar batteries work\nThe simplest way to think of batteries is to imagine that the electricity in your house flows through wires in much the same way as water through plumbing. Batteries fill the role of a storage tank, making electricity readily available when it's needed, just as indoor pressure tanks and water heaters do with water. When batteries are tapped for energy, their reserve of stored electricity is depleted, but in a properly wired system, they can be automatically replenished by \"catching\" any excess electricity flowing through the system from sources like solar panels or the grid.\nDepending on your goals for installing batteries, your system might look a bit different.\n1. Connect just to solar panels: Batteries connected only to solar panels will fill when the sun shines and will discharge when you use electricity and the sun is down or behind clouds. It's one option if you are off-grid and away from electrical utilities.\n2. Connect to solar panels and to the grid: If you have a solar inverter that can temporarily disconnect you from the grid, you have what's known as a hybrid solar system. In such a system, you can charge your battery with your solar panels or the grid and use the energy stored there in your home or send it back to the grid and save some money via rate arbitrage (if you have time-of-use rates). A hybrid system can also keep your house powered during a power outage.\n3. Connect just to the grid: While we wouldn't call them solar batteries, you can install batteries without solar panels at all. They would charge from the grid and would be useful for backup power or for enrolling in a virtual power plant.\nPros and cons of solar batteries\nThe pros and cons of buying a battery largely boil down to savings (and backup power) versus cost.\nThe extra solar electricity you store in your solar batteries can be used in place of electricity you'd normally have to buy from your utility, or sold back to the grid when it's most valuable. This can save you some money and relieve some pressure on the grid when there's peak demand. (Whether this is a viable money-saving option for you depends on your utility's net metering rules.)\nSome companies are starting to allow people to enroll their batteries in virtual power plants, a fleet of batteries, smart thermostats and other household appliances that work together to decrease demand on the grid. Where available, virtual power plants might come with additional perks for the battery owner.\nIn addition, you'll be able to use your battery bank in the event that the grid goes down due to a failure, natural disaster or even a solar flare. A backup generator can also help keep the power on in an emergency (and charge your batteries), but it requires burning fossil fuels, usually either gas or propane.\nBatteries do add considerable expense to your home energy system, but federal tax credits and other incentive programs usually can be applied to the cost of storage.\n| Battery Pros | Battery Cons |\n|---|---|\n| Can reduce energy bills | Savings vary depending on local utility and net metering rules |\n| Getting cheaper, and eligible for tax credits and incentives | Expensive |\n| Stored power for when the grid goes down | Large battery banks require significant storage space |\n| Storing and releasing energy during peak usage hours can reduce stress on the grid | Not all utilities encourage or reward this practice |\n| Cleaner source of backup power than a generator | A generator may be more useful in a major emergency |\n| Latest battery chemistries (like Li-PO4) are exceedingly safe and simple to maintain | Some batteries pose health and fire risks and require management and maintenance |\n| Increased energy independence |\nDifferent types of solar batteries\nThere are several kinds of batteries used in battery backup systems, including lithium-ion and lead-acid batteries. Here's a quick overview.\nLithium-ion batteries\nThere are multiple lithium chemistries on the market, including nickel-manganese-cobalt, lithium polymer and lithium iron phosphate. The latest lithium technology comes with less danger of fire than older headlines might lead you to believe. They're capable of a deeper discharge than lead acid batteries (you can use up to 90% of a charge per cycle without inflicting much damage) and are much easier to maintain with a longer lifespan. They're also significantly more expensive and sensitive to temperature. Increasingly, they are becoming standard in residential solar applications.\nLead-acid batteries\nThe basics of this technology are essentially unchanged for over a century. They remain inexpensive and widely available. For solar systems, it's popular to use somewhat more expensive sealed batteries that require less maintenance and eliminate the risk of dealing with a potential acid spill and hydrogen off-gassing. For a while, sealed lead acid seemed to be the future of solar batteries.\nHowever, all lead acid batteries require more careful monitoring of charge levels compared with lithium-ion and can't compete in terms of efficiency, energy and lifespan but are a good and plentiful budget alternative.\nFlow batteries\nFlow batteries (or redox flow batteries) are less common in home systems since they're mainly designed for commercial use. The technology appears promising, and it could become more widely used in residential battery backup systems in the near future.\nNickel-cadmium batteries\nNickel-cadmium batteries have a high energy density with double the energy of a lead-acid battery. Nickel-cadmium batteries are very durable, expensive and work well in extreme temperatures making them a good choice for large-scale commercial and industrial projects. Cadmium is toxic and generally not appropriate for residential use.\nBuying a backup battery system\nIn general, a solar battery bank can cost between $10,000 to $25,000 for 10 to 25 kilowatt hours of power. (The US Department of Energy says solar batteries can cost anywhere from $12,000 to $22,000.)\nThat said, it ultimately comes down to your budget and energy needs. A small off-grid solar system with enough battery capacity for the basics (no air conditioning or electric heaters allowed) using a pair of high-capacity flooded lead acid batteries can be had for $500 total. Upgrading to lithium-ion costs $1,300 for a system with comparable capacity.\nAdding batteries is a significant expense for any system, but the good news is that nearly a third will come back to you in the form of the 30% federal renewable energy tax credit. Other incentives may also be available from state and local governments, utilities, and even credit unions.\nHow to set up a battery backup system\nIt's best to use a certified solar installer or electrician to install your solar batteries and connect them to your solar array, your home, the grid and an EV charger if you desire. You should expect to spend a few thousand dollars for the labor involved, and there may be additional components like inverters, charge controllers and EV charge stations that can also add hundreds or thousands of dollars in expense.\nIf you have confidence in your DIY skills and experience with electricity, it is possible to install batteries yourself. Just be sure to check with local regulations, building codes and equipment warranties.\nIf you go the DIY route, make sure all batteries are the same age (ideally new). Don't mix new batteries with older ones to help make sure they charge evenly.\nMaintaining a battery backup system\nFor all batteries, follow any manufacturers' instructions regarding monitoring the depth of discharge. Generally, for lead acid batteries, this means trying to keep them over half charged as much as possible. Many lithium-ion batteries can safely be taken down to only 10% charge. Flooded lead-acid batteries also need to be topped off with distilled water a few times a year.\nLifespan and warranties\nA few years after installation, you may notice that your battery backup system doesn't hold a charge as well as it used to. That's because, like other types of batteries, battery backups lose storage capacity over time.\nTo account for this, battery backups include a warranty that expresses how efficient the battery should be by the end of the warranty period. Many of the top solar batteries offer 10 years and 70%, meaning that by the end of the 10-year warranty, the battery should still operate at 70% of its original performance. Lead acid battery warranties typically last for two to five years.\nInverters and batteries\nInverters play an important role in how the battery stores and converts solar energy. While solar panels generate electricity in direct current, the electric grid and homes generally use alternating current. An inverter can convert AC to DC or vice versa, and most solar batteries include an inverter to store the energy in DC form, as well as an inverter to convert it back into AC to be used in the grid or the home.\nBecause inversion of current isn't perfectly efficient, battery producers are always experimenting with how to invert less often and increase the efficiency of the battery. As a result, some batteries will not have inverters for both input and output included in the system. Talk to your solar installer about the battery system you're considering so that you can make sure you have all the external inverters you need.\nBeware cheap inverters, which are everywhere. To power modern household appliances, a pure sine wave inverter is essential; otherwise, you may end up frying some of the more delicate electronic circuits in your home.\nFAQ\nWhy do I need a battery with solar panels?\nSolar power is available for only part of the day. Adding a solar power storage battery system ensures you always have power when the sun isn't out or during a power outage.\nCan I install my own solar battery?\nA professional solar electricity system installer can help you select a battery that works well with your goals, whether you want to be entirely off-grid, have an emergency store for outages or minimize your costs from the electric company during peak hours.\nDIY battery installation instructions abound online, but beware. Working with electrical equipment is dangerous and doing so without the proper training may also void your warranties and put you out of compliance with codes and other regulations.\nDo solar batteries qualify for the federal tax credit?\nYes. The 30% federal solar tax credit can be applied to the total cost of your solar battery system if your battery can hold at least 3 kilowatt-hours of energy and is installed in 2023 or later.\nHow many solar batteries do I need to power my house?\nIt depends on how you intend to use them. Likely, fewer batteries are required if you simply hope to maximize net metering savings. To keep your home powered during an extended blackout, you will need to calculate your total power needs\nCan I use a normal battery for solar?\nCompared with a normal battery, solar batteries are purpose-built to keep your home and office running for long hours, and they have a long life. A home battery like the Tesla Powerwall is also much bigger than most batteries you're thinking of -- and should be installed by a professional.\nHow long will a 10kW solar battery last?\nA 10kW solar battery is rated to last for about 10 to 12 hours of use when keeping the essentials running. This assumes between 750W and 1,000W of electricity use per hour. Exact battery life will depend on your use case."
    },
    {
      "url": "https://www.cnet.com/home-tips/",
      "text": "Best Laptops We've Tested (August 2025)\n1 hour ago\nApple's New Low-Cost iPad Could Come With the A18 Chip and Apple Intelligence, Report Says\n2 hours ago\nBuy an iPad or Mac, Get Free AirPods or an Accessory With Apple's Back-to-School Promo\n7 hours ago\nI Flew Antigravity's 8K 360-Degree Drone and It Felt Like Using a Wii Remote\n7 hours ago\nChange These 3 Settings on Your OLED Laptop for Better Battery Life\n9 hours ago\nStuff Your Kindle Day is Here: Grab Free and $1 Historical Fiction E-Books\n1 day ago\nBest Apple Studio Display Deals: Save $50 at Adorama, $100 Off for Students\n1 day ago\nGet School-Ready With an M-Series iMac or Mac Mini on Your Desk From Just $360\n1 day ago\nGet Back to School Ready With This $599 Apple 13-Inch M1 MacBook Air\n1 day ago\nLaptop Taking Up Too Much Space? Close It and Use a Monitor\n2 days ago\nSamsung’s Latest Galaxy Book 5 Pro 360 Laptop Just Hit a Record-Low at Amazon\n2 days ago\nLooking to Recycle an Old Laptop or Printer? Here's Where You Can Take It\n2 days ago\nAct Fast to Score This HORI Piranha Plant Camera for the Nintendo Switch 2 While It’s at a Record-Low $40\n3 days ago\nApple's Low-Cost MacBook to Start at $599, Report Says\n3 days ago\nForget the M4 MacBook Air, the Upgraded M2 Version Is Just $699 Right Now\n3 days ago"
    },
    {
      "url": "https://www.cnet.com/home/energy-and-utilities/blackout-prep-made-easy-protect-your-home-with-these-simple-tips/",
      "text": "Whether it's from heat or storms, the weather can leave you in the dark. Hurricane Helene knocked out power to more than 4 million customers in the Southeast. And Hurricane Milton is threatening Florida after growing quickly into a Category 5 storm Monday.\nThis comes after a hot summer across much of the US, with heat waves and drought conditions in much of the country.\nRough weather often means power outages. A blackout that lasts an hour or two isn't a big deal, but one that lasts days can be outright dangerous for you and your family. The alarms are already blaring that some parts of the US are going to be extremely vulnerable to energy shortages and blackouts this year.\nCan solar panels save you money?\nInterested in understanding the impact solar can have on your home? Enter some basic information below, and we’ll instantly provide a free estimate of your energy savings.\nYou can fare a lot better if you take the time to learn why blackouts happen and how to prepare for them. Experts say it doesn't have to be time-consuming, but even a simple blackout plan can save you a lot of headaches.\nHere's your guide to weathering your next blackout safely, and maybe even comfortably.\nWhy do blackouts happen?\nBlackouts happen for many reasons. In the past few years, the North American Electric Reliability Corporation warned of an increased risk of blackouts throughout much of western North America. The prospect of hotter than normal summers, lower than normal hydroelectric reservoirs and potentially higher than usual demand for electricity all made it more likely the supply of electricity wouldn't have been able to meet the demand for it, triggering blackouts.\nMore common reasons for blackouts are weather-related. Wildfires, hurricanes, thunderstorms and snowstorms can bring down power lines or disrupt electricity generation, causing blackouts.\nEven extreme cold on its own can cause the power grid to go down. With more Americans electrifying their home heating systems, extreme cold can ramp up electricity demand beyond what the grid can handle.\n\"Everything is jumping on the grid at the same time when it gets freezing cold,\" said Kyle Raabe, president of consumer power at Generac, a company that makes generators and backup batteries.\nAs extreme weather gets more intense due to climate change, more blackouts could be a consequence. If blackouts do occur in your area, there are a few things you can do beforehand to prepare.\nRead more: Do Blackouts Affect Homes With Solar Panels? Sometimes\nWe used data from the US Energy Information Administration to map how many power outages per year the average utility customer in each state had from 2018-2022 (using all reporting methods). We also looked at the average total duration of outages per year, in hours.\nAre blackouts dangerous?\nBlackouts are disruptive, plain and simple. Those disruptions could range from something as minor as an interrupted TV show, to something as life-threatening as a temperature-sensitive medicine going bad.\nA short blackout may not pose a big danger, but longer ones lasting many hours or even days can put you at risk. Some rural Americans rely on electric well pumps for their drinking water, while just about everyone relies on a fridge to keep their food from spoiling. \"Now all the sudden it becomes, can I eat?\" Raabe said.\nPeople with limited mobility might be the most vulnerable during a blackout, according to Raabe. If you can't easily jump in a car and drive to a hotel or a friend's home to access electricity, you need to make sure you can safely hunker down in your own home for an extended period.\n\"It's different for everyone, and it's part of the reason we always recommend, think about it ahead of time,\" Raabe said.\nHow to prepare for a blackout: A checklist\nThe Department of Energy has a list of some things to have on hand for blackout preparation. That list is reflected below with a few additions.\n- Flashlights and batteries: The DOE suggests a flashlight in every room, but it seems good enough to have plenty of lights and batteries handy. Sure, phones have flashlights, but if a blackout carries on for a while, you might want to save that phone charge for other tasks, like communication or entertaining a kid.\n- Candles and matches: Candles don't run out of battery and matches are a reliable fire starter. Take extra caution with open flames, don't leave them unattended and don't use them if there's a risk of a gas leak.\n- Alternative lighting: Getting a solar lantern that can recharge without plugging in or LED lanterns with long-lasting batteries are two other ways to safely light your house.\n- Your utility's emergency number: If you smell a gas leak, you don't want to be reliant on Wi-Fi to pull up your utility's emergency number. Write it down somewhere.\n- Backup generator: Generators can be big purchases but can provide backup energy. If you get one, make sure it is safely installed and far from your windows to avoid the risk of carbon monoxide poisoning. If you have a backup battery, you can make sure it's fully charged ahead of bad weather.\n- Ice packs and a cooler: If you have medicine that needs to stay cold, make sure you have some ice packs and a cooler ready. Then, only open it when you need it. Each time it's opened, warm air gets in and reduces the time the interior will stay cold. The same goes for your fridge and freezer.\n- Water: If you get water from a well, you'll need to keep water on hand. The DOE suggests one gallon a day per person.\n- Food: Keep some food that's nonperishable and doesn't require cooking. Canned goods would work well here.\n- First aid kit: You can stock your own first aid kit or buy one from the Red Cross.\n- Disaster plan: Decide beforehand where you and your family will meet if your home isn't an option and communication isn't possible.\n- Locations of cooling or warming stations: Cities often have cooling stations in the summer (or warming stations in the winter). If your air conditioning or furnace is out, make sure you know places you can head if it gets dangerously hot or cold.\nWhat not to do during a blackout\nThe biggest thing you want to avoid during a blackout is improperly using a portable home generator. The gas-powered devices emit toxic fumes that you don't want coming into your home. \"Number one, keep that away from the house,\" Raabe said. \"Get that thing away from the house and run the cords in.\"\nYou also want to avoid frying your expensive electronics with a power surge when the power comes back on. Using a surge protector, or unplugging TVs and computers, can help prevent this.\nAnd of course, try not to open your fridge or freezer frequently during a blackout. You want to preserve the cold (and your food) for as long as possible.\nWhat to do after a blackout\nAfter the power comes back, the hard part is over, but you'll need to dispose of any spoiled food or medicine. With food, it's best to err on the side of caution. Throw things away if they've been unrefrigerated (above 40 degrees) for two or more hours, the Department of Homeland Security says. (The department runs the website Ready.gov with tips to prepare for almost any kind of disaster.) With medicines, it's best to consult with your doctor.\nAnother key step: Revisit that blackout plan you made and see what you might want to do differently next time. Raabe recommends you ask yourself, \"Hey, did my plan work for me?\"\nA blackout is bound to bring some sort of inconvenience, but managing those problems and staying safe is possible with just a bit of preparation.\nHere are additional ways your phone can help in an emergency and how to keep your pets safe during natural disasters. Plus, the five things that could help you get through a power outage.\nFrequently asked questions\nAre blackouts becoming more common?\nYes, blackouts and power disruptions have become more frequent over the past few years. This is mainly driven by extreme weather events in the US. Low-income areas and states that are prone to extreme weather events, such as hurricanes and winter storms, are more likely to experience blackouts.\nIs a generator necessary for getting through a blackout?\nIn a word: No. Everyone has different needs during a blackout. Some households might do fine with a small portable battery to charge their phones. Other families might feel safe with a small portable generator to power a fridge and other essentials. Others might want the convenience of a permanent standby generator that flips on automatically and powers their entire home.\nWhat's the difference between a brownout and a blackout?\nA blackout is a total and unexpected loss of power. Blackouts can last anywhere from a few minutes to a few days or even weeks. A brownout is only a partial loss of power, where a system's capacity and voltage are reduced. Brownouts usually happen when there's high demand across the power grid."
    },
    {
      "url": "https://www.eia.gov/dnav/ng/hist/rngwhhdm.htm",
      "text": "|\n||||||||||||\n| Henry Hub Natural Gas Spot Price (Dollars per Million Btu) | ||||||||||||\n| Year | Jan | Feb | Mar | Apr | May | Jun | Jul | Aug | Sep | Oct | Nov | Dec |\n|---|---|---|---|---|---|---|---|---|---|---|---|---|\n| 1997 | 3.45 | 2.15 | 1.89 | 2.03 | 2.25 | 2.20 | 2.19 | 2.49 | 2.88 | 3.07 | 3.01 | 2.35 |\n| 1998 | 2.09 | 2.23 | 2.24 | 2.43 | 2.14 | 2.17 | 2.17 | 1.85 | 2.02 | 1.91 | 2.12 | 1.72 |\n| 1999 | 1.85 | 1.77 | 1.79 | 2.15 | 2.26 | 2.30 | 2.31 | 2.80 | 2.55 | 2.73 | 2.37 | 2.36 |\n| 2000 | 2.42 | 2.66 | 2.79 | 3.04 | 3.59 | 4.29 | 3.99 | 4.43 | 5.06 | 5.02 | 5.52 | 8.90 |\n| 2001 | 8.17 | 5.61 | 5.23 | 5.19 | 4.19 | 3.72 | 3.11 | 2.97 | 2.19 | 2.46 | 2.34 | 2.30 |\n| 2002 | 2.32 | 2.32 | 3.03 | 3.43 | 3.50 | 3.26 | 2.99 | 3.09 | 3.55 | 4.13 | 4.04 | 4.74 |\n| 2003 | 5.43 | 7.71 | 5.93 | 5.26 | 5.81 | 5.82 | 5.03 | 4.99 | 4.62 | 4.63 | 4.47 | 6.13 |\n| 2004 | 6.14 | 5.37 | 5.39 | 5.71 | 6.33 | 6.27 | 5.93 | 5.41 | 5.15 | 6.35 | 6.17 | 6.58 |\n| 2005 | 6.15 | 6.14 | 6.96 | 7.16 | 6.47 | 7.18 | 7.63 | 9.53 | 11.75 | 13.42 | 10.30 | 13.05 |\n| 2006 | 8.69 | 7.54 | 6.89 | 7.16 | 6.25 | 6.21 | 6.17 | 7.14 | 4.90 | 5.85 | 7.41 | 6.73 |\n| 2007 | 6.55 | 8.00 | 7.11 | 7.60 | 7.64 | 7.35 | 6.22 | 6.22 | 6.08 | 6.74 | 7.10 | 7.11 |\n| 2008 | 7.99 | 8.54 | 9.41 | 10.18 | 11.27 | 12.69 | 11.09 | 8.26 | 7.67 | 6.74 | 6.68 | 5.82 |\n| 2009 | 5.24 | 4.52 | 3.96 | 3.50 | 3.83 | 3.80 | 3.38 | 3.14 | 2.99 | 4.01 | 3.66 | 5.35 |\n| 2010 | 5.83 | 5.32 | 4.29 | 4.03 | 4.14 | 4.80 | 4.63 | 4.32 | 3.89 | 3.43 | 3.71 | 4.25 |\n| 2011 | 4.49 | 4.09 | 3.97 | 4.24 | 4.31 | 4.54 | 4.42 | 4.06 | 3.90 | 3.57 | 3.24 | 3.17 |\n| 2012 | 2.67 | 2.51 | 2.17 | 1.95 | 2.43 | 2.46 | 2.95 | 2.84 | 2.85 | 3.32 | 3.54 | 3.34 |\n| 2013 | 3.33 | 3.33 | 3.81 | 4.17 | 4.04 | 3.83 | 3.62 | 3.43 | 3.62 | 3.68 | 3.64 | 4.24 |\n| 2014 | 4.71 | 6.00 | 4.90 | 4.66 | 4.58 | 4.59 | 4.05 | 3.91 | 3.92 | 3.78 | 4.12 | 3.48 |\n| 2015 | 2.99 | 2.87 | 2.83 | 2.61 | 2.85 | 2.78 | 2.84 | 2.77 | 2.66 | 2.34 | 2.09 | 1.93 |\n| 2016 | 2.28 | 1.99 | 1.73 | 1.92 | 1.92 | 2.59 | 2.82 | 2.82 | 2.99 | 2.98 | 2.55 | 3.59 |\n| 2017 | 3.30 | 2.85 | 2.88 | 3.10 | 3.15 | 2.98 | 2.98 | 2.90 | 2.98 | 2.88 | 3.01 | 2.82 |\n| 2018 | 3.87 | 2.67 | 2.69 | 2.80 | 2.80 | 2.97 | 2.83 | 2.96 | 3.00 | 3.28 | 4.09 | 4.04 |\n| 2019 | 3.11 | 2.69 | 2.95 | 2.65 | 2.64 | 2.40 | 2.37 | 2.22 | 2.56 | 2.33 | 2.65 | 2.22 |\n| 2020 | 2.02 | 1.91 | 1.79 | 1.74 | 1.75 | 1.63 | 1.76 | 2.30 | 1.92 | 2.39 | 2.61 | 2.58 |\n| 2021 | 2.71 | 5.35 | 2.62 | 2.66 | 2.91 | 3.26 | 3.84 | 4.07 | 5.16 | 5.51 | 5.05 | 3.76 |\n| 2022 | 4.38 | 4.69 | 4.90 | 6.60 | 8.14 | 7.70 | 7.28 | 8.81 | 7.88 | 5.66 | 5.45 | 5.53 |\n| 2023 | 3.27 | 2.38 | 2.31 | 2.16 | 2.15 | 2.18 | 2.55 | 2.58 | 2.64 | 2.98 | 2.71 | 2.52 |\n| 2024 | 3.18 | 1.72 | 1.49 | 1.60 | 2.12 | 2.54 | 2.07 | 1.99 | 2.28 | 2.20 | 2.12 | 3.01 |\n| 2025 | 4.13 | 4.19 | 4.12 | 3.42 | 3.12 | 3.02 | 3.20 |\n| - = No Data Reported; -- = Not Applicable; NA = Not Available; W = Withheld to avoid disclosure of individual company data. |\n| Release Date: 8/13/2025 |\n| Next Release Date: 8/20/2025 |\nReferring Pages:"
    },
    {
      "url": "https://www.cnet.com/personal-finance/banking/cnet-survey-78-percent-of-americans-are-stressed-out-about-high-energy-bills/",
      "text": "Key survey findings:\n- 78% of US adults are concerned about rising home energy costs.\n- 32% of US adults are leaning on borrowing and payment plans to afford their energy bills.\n- 70% of US adults are taking steps to become more energy efficient.\n- 32% of US adults are concerned about the cost of energy-efficiency projects, such as upgrading the HVAC system or installing solar panels.\nThe heat is already breaking records this summer, and Americans are feeling the burn of rising energy costs.\nAn exclusive CNET Money survey found that more than 78% of US adults are concerned about their home energy bills, and an alarming 32% are turning to financing options, like credit cards, loans or payment plans to get by.\nI'm not surprised by the data. Last month, I reported that 93% of Americans are worried about inflation, and 41% said high utility bills had the biggest sticker shock. The data tracks.\nWe saw small dips in average energy costs over the past three months, but overall, energy costs are up 4.3% since June of 2023, according to the latest Consumer Price Index report. And when utility company costs go up, so do ours, said Daniella Flores, a personal finance expert and CNET Money Expert Review Board member.\nAs concerns about inflation and energy use linger, it may seem like expensive energy bills are a given. But there are steps you can take to lower your energy costs. Here's what CNET uncovered in our latest survey and how experts say you can save both energy and money.\nHome energy bill concerns are growing nationwide\nCNET survey data reveals home energy costs are affecting household finances. Interestingly, we found there isn't much variance by region.\nCNET ranked the top 10 states with the highest electricity bills and found a similar trend that energy costs -- specifically electricity -- aren't a regional issue. The top 10 states with the highest average electricity bills are Connecticut, Hawaii, Massachusetts, Rhode Island, Maryland, Tennessee, West Virginia, Alabama, Alaska and Maine. The top 10’s average monthly electric bills range from $160 to $202 -- well above the national average of $135.\nEven more interesting, only six out of the top 10 are also states with the highest electricity rates. California, New York, New Hampshire, Vermont and Michigan have some of the highest electric rates in the US, but not the highest electric bills.\nMost Americans are struggling to pay rising energy bills\nAs energy costs rise, fitting this unpredictable expense into your budget can be difficult. Most US adults have a plan to tackle high energy bills, but this survey found an alarming 32% of US adults are leaning on borrowing, payment plans or assistance programs to afford their energy bills. Similarly, 24% of participants said they are cutting back on essential purchases to fit energy bills into their budgets.\nOthers are cutting back on nonessential spending (39%), dipping into savings (15%) and increasing their income (13%).\nCan't afford your energy bill? Do this before turning to credit cards\nUsing credit cards may seem like the next best solution if you can't afford to pay your energy bill. But paying for your energy bills with a credit card can be costly in different ways. Not only can this lead to interest and debt if you can't pay the balance back in full, but some energy companies charge a processing fee when you use a credit card to pay your bill.\nInstead, consider one of the below options:\nIf you can’t afford your monthly energy bill without leaning on credit, Flores and Kanj both recommend contacting your utility companies to see if you qualify for a payment plan. A utility-approved payment plan can help you pay off your balance in installments over a set period of time. While payment plans help if you are behind on paying off your bill, it won’t solve the long-term problem of affordable energy costs.\nYou may also qualify for LIHEAP, a federally funded utility bill assistance program. LIHEAP may ease the burden of heating and cooling costs with bill pay assistance, home weatherization repairs or energy crisis help. For more information, you can visit the Office of Community Services website, brochure, email the National Energy Assistance Referral service at energy@ncat.org or call 1-866-NRG-NEAR.\nIf it’s predictability you seek, many utility companies offer budget billing plans. Also known as level billing or average billing, depending on your utility company, budget billing will even out your monthly energy bill versus a fluctuating one based on your seasonal consumption patterns. If enrolled, your utility will use your previous energy usage profile and predict your next 12 months of billing and divide it by 12 months. Under budget billing, your monthly bill will be the same amount each month. If you go over the expected amount at the end of your agreement, you’ll pay the difference. But if you pay for more energy than you use, you’ll see a credit.\n“If you have an older home, your electricity bill might be a lot more expensive in the summer than it is for the winter,” said Kanj. “These plans can even out your bill over the full 12 months so that you have a more predictable monthly payment.”\nExpert tips to save money on energy bills\nThe majority of survey respondents (70%) said they are making an effort to be energy efficient. Most are incorporating energy-efficient products, but a smaller percentage are taking on more expensive projects such as upgrading their HVAC system to a more efficient one or installing solar panels.\nHere's what homeowners and renters say they are doing to reduce energy costs, and expert advice to lower your bill even more.\nShop for energy-efficient products\nAccording to the survey, 44% of participants use energy-efficient products such as smart light bulbs, plugs and thermostats.\nSwitching to smart products like these can be effective, said Wael Kanj, a senior research associate at Rewiring America, a nonprofit that supports electrification efforts. Energy-efficient products can help lower your energy bill and improve your heating and cooling system's efficiency. They're small upgrades that can be less daunting to take on than major renovations, said Kanj.\nFlores and their wife live in Washington state and have made energy upgrades, like installing a more efficient air conditioning unit in their home. To save even more money, Flores turns the unit off or raises the temperature setting when they can. They also run ceiling fans to help circulate the air. Despite their best efforts, even the cost of maintaining efficient appliances is getting more expensive.\n\"The largest part of our energy bill seems to be our heating and cooling,\" said Flores. \"Our AC bill is going up summer to summer, year over year because it's getting hotter and drier every summer.\"\nMonitor your thermostat temperature\nIf you rent or can't afford smart home tech upgrades right now, Kanj says there are other small steps you can take to lower your energy bills. If a smart thermostat isn't in the cards right now, try adjusting your thermostat before you leave home to lower costs. 78 degrees is the ideal temperature to set your thermostat to during the summer to save money, according to Energy Star, a program of the US Environmental Protection Agency and the US Department of Energy. During the winter, the federal program recommends setting your thermostat to 68 degrees.\nParticipate in a virtual power plant\nA virtual power plant is a new power distribution model where an energy operation -- like a utility -- can control how you use your energy or tap into your stored energy. VPP programs in the US are voluntary and aim to relieve the power grid at times of peak demand. Only 3% of survey respondents say they participate in a virtual power plant program. Reed said that number should rise quickly as more utility companies experiment with ways consumers can help the power grid -- and find more incentives for these programs.\nThe benefit of VPP participation is the bill credits in exchange for allowing your utility company -- or another third party -- to leverage your home’s energy technology when the electric grid is overwhelmed. A few common examples are solar batteries, backup battery storage or smart thermostats. When the grid is stressed and by allowing your utility access to your thermostat, for example, it can remotely adjust your home’s temperature in exchange for bill credits.\nInsulate and weatherize windows and doors\nOnly 16% of US adults are insulating their home to improve energy efficiency, the survey reveals. But it's the one tip Kanj recommends the most.\nInsulating your home is a good first step. If your home isn't well-insulated, you'll likely spend more on your heating and cooling bills because you're sending your energy (and money) out the door, he added.\nHow can you tell if the insulation around your windows and doors is working? Check to see if you can feel air escaping through cracks. You can pick up insulation kits and weather stripping at your local hardware store to seal up areas around your home where air is leaking. If you already have insulation installed, make sure it's still intact and not worn out. To further boost your efforts, add insulated window treatments, such as blinds and curtains, to keep your home cooler in the summer and warmer in the winter.\nCheck to see if you live in a deregulated area\nIf your energy provider's costs have skyrocketed, you may be able to shop around for a new company or energy plan, depending on where you live. First, check if you live in a deregulated state -- also known as an energy choice market. If so, you can compare electricity rates, plans and providers to see if you could be saving money. You might also choose a fixed-rate energy plan, which can provide you with stability and predictability for your gas or electric bills.\nIt's not always easy to figure out how much you're paying, so make sure you understand how to read your energy bill and contact your provider if you have any questions.\nConsider a solar panel investment\nA solar panel investment can help offset some or all of your electricity costs. But it usually comes with a hefty upfront investment in the ballpark of $15,000 to $50,000 based on factors like how many panels you need and where you live. Experts agree, though, that solar panels do eventually pay for themselves. The average payback period is about six to 12 years, CNET contributor Mike De Socio reported last year. After the payback period, all the energy solar panels produce is essentially free.\nAdding a solar battery is another expensive option that can cost around another $10,000. But a solar battery can store excess energy from your panels at night when they aren't producing energy. It can even sell stored energy back to your utility company for bill credits, if your provider has a generous net metering program.\nIf your home isn’t a good candidate for solar panels because of shade or cost, see if community solar is an option in your area. Community solar programs let you buy into a power plan that's connected to a solar farm in your area, Kanj added.\nRead more: 7 Questions to Ask an Energy Provider Before Signing Up\nHow to afford energy efficient upgrades\nDespite most US adults trying to be energy efficient, they're also concerned about the costs. According to the survey, 32% of US adults worry about the expense of energy efficiency projects, while 29% question whether making changes will actually help them save money.\nKanj acknowledges that cost is a big factor for many people, but says that upgrading your HVAC system or replacing it with a heat pump -- a big home renovation 14% of our survey participants said they were tackling -- can make a big difference in your bill for decades to come.\nReed, who also reports on heat pumps for CNET and witnessed first-hand how they operate at CES, said they can serve a dual purpose -- working as an all-electric and energy-efficient alternative to a furnace and an air conditioner.\n\"The Inflation Reduction Act created like an electric bank account for every household where they have access to money that they can use to make these upgrades and bring the cost of these electrical appliances down,\" said Kanj.\nIf you're considering making energy efficient upgrades to your home, make sure you look into the tax credits and rebates you're eligible for, such as the residential clean energy credit and the energy efficient home improvement credit. Many states offer their own credits, too.\nRewiring America also has a savings calculator you can use to find out how much you could save with eligible tax credits and state-level rebates after you enter some household information. If you're feeling overwhelmed and not sure where to start, Kanj recommends scheduling a home energy audit, which is an in-person walk-through of your home with a contractor who will show you more energy-efficient solutions you could make to cut costs. That way, you'll have a plan of options and can choose what fits in your long- and short-term goals, added Kanj.\nMethodology\nAll figures, unless otherwise stated, are from YouGov Plc. The total sample size was 2467 adults. Fieldwork was undertaken between June 3rd and 5th, 2024. The survey was carried out online. The figures have been weighted and are representative of all US adults 18+, respectively."
    },
    {
      "url": "https://www.cnet.com/personal-finance/banking/advice/cnet-survey-78-percent-of-americans-are-stressed-out-about-high-energy-bills/",
      "text": "Key survey findings:\n- 78% of US adults are concerned about rising home energy costs.\n- 32% of US adults are leaning on borrowing and payment plans to afford their energy bills.\n- 70% of US adults are taking steps to become more energy efficient.\n- 32% of US adults are concerned about the cost of energy-efficiency projects, such as upgrading the HVAC system or installing solar panels.\nThe heat is already breaking records this summer, and Americans are feeling the burn of rising energy costs.\nAn exclusive CNET Money survey found that more than 78% of US adults are concerned about their home energy bills, and an alarming 32% are turning to financing options, like credit cards, loans or payment plans to get by.\nI'm not surprised by the data. Last month, I reported that 93% of Americans are worried about inflation, and 41% said high utility bills had the biggest sticker shock. The data tracks.\nWe saw small dips in average energy costs over the past three months, but overall, energy costs are up 4.3% since June of 2023, according to the latest Consumer Price Index report. And when utility company costs go up, so do ours, said Daniella Flores, a personal finance expert and CNET Money Expert Review Board member.\nAs concerns about inflation and energy use linger, it may seem like expensive energy bills are a given. But there are steps you can take to lower your energy costs. Here's what CNET uncovered in our latest survey and how experts say you can save both energy and money.\nHome energy bill concerns are growing nationwide\nCNET survey data reveals home energy costs are affecting household finances. Interestingly, we found there isn't much variance by region.\nCNET ranked the top 10 states with the highest electricity bills and found a similar trend that energy costs -- specifically electricity -- aren't a regional issue. The top 10 states with the highest average electricity bills are Connecticut, Hawaii, Massachusetts, Rhode Island, Maryland, Tennessee, West Virginia, Alabama, Alaska and Maine. The top 10’s average monthly electric bills range from $160 to $202 -- well above the national average of $135.\nEven more interesting, only six out of the top 10 are also states with the highest electricity rates. California, New York, New Hampshire, Vermont and Michigan have some of the highest electric rates in the US, but not the highest electric bills.\nMost Americans are struggling to pay rising energy bills\nAs energy costs rise, fitting this unpredictable expense into your budget can be difficult. Most US adults have a plan to tackle high energy bills, but this survey found an alarming 32% of US adults are leaning on borrowing, payment plans or assistance programs to afford their energy bills. Similarly, 24% of participants said they are cutting back on essential purchases to fit energy bills into their budgets.\nOthers are cutting back on nonessential spending (39%), dipping into savings (15%) and increasing their income (13%).\nCan't afford your energy bill? Do this before turning to credit cards\nUsing credit cards may seem like the next best solution if you can't afford to pay your energy bill. But paying for your energy bills with a credit card can be costly in different ways. Not only can this lead to interest and debt if you can't pay the balance back in full, but some energy companies charge a processing fee when you use a credit card to pay your bill.\nInstead, consider one of the below options:\nIf you can’t afford your monthly energy bill without leaning on credit, Flores and Kanj both recommend contacting your utility companies to see if you qualify for a payment plan. A utility-approved payment plan can help you pay off your balance in installments over a set period of time. While payment plans help if you are behind on paying off your bill, it won’t solve the long-term problem of affordable energy costs.\nYou may also qualify for LIHEAP, a federally funded utility bill assistance program. LIHEAP may ease the burden of heating and cooling costs with bill pay assistance, home weatherization repairs or energy crisis help. For more information, you can visit the Office of Community Services website, brochure, email the National Energy Assistance Referral service at energy@ncat.org or call 1-866-NRG-NEAR.\nIf it’s predictability you seek, many utility companies offer budget billing plans. Also known as level billing or average billing, depending on your utility company, budget billing will even out your monthly energy bill versus a fluctuating one based on your seasonal consumption patterns. If enrolled, your utility will use your previous energy usage profile and predict your next 12 months of billing and divide it by 12 months. Under budget billing, your monthly bill will be the same amount each month. If you go over the expected amount at the end of your agreement, you’ll pay the difference. But if you pay for more energy than you use, you’ll see a credit.\n“If you have an older home, your electricity bill might be a lot more expensive in the summer than it is for the winter,” said Kanj. “These plans can even out your bill over the full 12 months so that you have a more predictable monthly payment.”\nExpert tips to save money on energy bills\nThe majority of survey respondents (70%) said they are making an effort to be energy efficient. Most are incorporating energy-efficient products, but a smaller percentage are taking on more expensive projects such as upgrading their HVAC system to a more efficient one or installing solar panels.\nHere's what homeowners and renters say they are doing to reduce energy costs, and expert advice to lower your bill even more.\nShop for energy-efficient products\nAccording to the survey, 44% of participants use energy-efficient products such as smart light bulbs, plugs and thermostats.\nSwitching to smart products like these can be effective, said Wael Kanj, a senior research associate at Rewiring America, a nonprofit that supports electrification efforts. Energy-efficient products can help lower your energy bill and improve your heating and cooling system's efficiency. They're small upgrades that can be less daunting to take on than major renovations, said Kanj.\nFlores and their wife live in Washington state and have made energy upgrades, like installing a more efficient air conditioning unit in their home. To save even more money, Flores turns the unit off or raises the temperature setting when they can. They also run ceiling fans to help circulate the air. Despite their best efforts, even the cost of maintaining efficient appliances is getting more expensive.\n\"The largest part of our energy bill seems to be our heating and cooling,\" said Flores. \"Our AC bill is going up summer to summer, year over year because it's getting hotter and drier every summer.\"\nMonitor your thermostat temperature\nIf you rent or can't afford smart home tech upgrades right now, Kanj says there are other small steps you can take to lower your energy bills. If a smart thermostat isn't in the cards right now, try adjusting your thermostat before you leave home to lower costs. 78 degrees is the ideal temperature to set your thermostat to during the summer to save money, according to Energy Star, a program of the US Environmental Protection Agency and the US Department of Energy. During the winter, the federal program recommends setting your thermostat to 68 degrees.\nParticipate in a virtual power plant\nA virtual power plant is a new power distribution model where an energy operation -- like a utility -- can control how you use your energy or tap into your stored energy. VPP programs in the US are voluntary and aim to relieve the power grid at times of peak demand. Only 3% of survey respondents say they participate in a virtual power plant program. Reed said that number should rise quickly as more utility companies experiment with ways consumers can help the power grid -- and find more incentives for these programs.\nThe benefit of VPP participation is the bill credits in exchange for allowing your utility company -- or another third party -- to leverage your home’s energy technology when the electric grid is overwhelmed. A few common examples are solar batteries, backup battery storage or smart thermostats. When the grid is stressed and by allowing your utility access to your thermostat, for example, it can remotely adjust your home’s temperature in exchange for bill credits.\nInsulate and weatherize windows and doors\nOnly 16% of US adults are insulating their home to improve energy efficiency, the survey reveals. But it's the one tip Kanj recommends the most.\nInsulating your home is a good first step. If your home isn't well-insulated, you'll likely spend more on your heating and cooling bills because you're sending your energy (and money) out the door, he added.\nHow can you tell if the insulation around your windows and doors is working? Check to see if you can feel air escaping through cracks. You can pick up insulation kits and weather stripping at your local hardware store to seal up areas around your home where air is leaking. If you already have insulation installed, make sure it's still intact and not worn out. To further boost your efforts, add insulated window treatments, such as blinds and curtains, to keep your home cooler in the summer and warmer in the winter.\nCheck to see if you live in a deregulated area\nIf your energy provider's costs have skyrocketed, you may be able to shop around for a new company or energy plan, depending on where you live. First, check if you live in a deregulated state -- also known as an energy choice market. If so, you can compare electricity rates, plans and providers to see if you could be saving money. You might also choose a fixed-rate energy plan, which can provide you with stability and predictability for your gas or electric bills.\nIt's not always easy to figure out how much you're paying, so make sure you understand how to read your energy bill and contact your provider if you have any questions.\nConsider a solar panel investment\nA solar panel investment can help offset some or all of your electricity costs. But it usually comes with a hefty upfront investment in the ballpark of $15,000 to $50,000 based on factors like how many panels you need and where you live. Experts agree, though, that solar panels do eventually pay for themselves. The average payback period is about six to 12 years, CNET contributor Mike De Socio reported last year. After the payback period, all the energy solar panels produce is essentially free.\nAdding a solar battery is another expensive option that can cost around another $10,000. But a solar battery can store excess energy from your panels at night when they aren't producing energy. It can even sell stored energy back to your utility company for bill credits, if your provider has a generous net metering program.\nIf your home isn’t a good candidate for solar panels because of shade or cost, see if community solar is an option in your area. Community solar programs let you buy into a power plan that's connected to a solar farm in your area, Kanj added.\nRead more: 7 Questions to Ask an Energy Provider Before Signing Up\nHow to afford energy efficient upgrades\nDespite most US adults trying to be energy efficient, they're also concerned about the costs. According to the survey, 32% of US adults worry about the expense of energy efficiency projects, while 29% question whether making changes will actually help them save money.\nKanj acknowledges that cost is a big factor for many people, but says that upgrading your HVAC system or replacing it with a heat pump -- a big home renovation 14% of our survey participants said they were tackling -- can make a big difference in your bill for decades to come.\nReed, who also reports on heat pumps for CNET and witnessed first-hand how they operate at CES, said they can serve a dual purpose -- working as an all-electric and energy-efficient alternative to a furnace and an air conditioner.\n\"The Inflation Reduction Act created like an electric bank account for every household where they have access to money that they can use to make these upgrades and bring the cost of these electrical appliances down,\" said Kanj.\nIf you're considering making energy efficient upgrades to your home, make sure you look into the tax credits and rebates you're eligible for, such as the residential clean energy credit and the energy efficient home improvement credit. Many states offer their own credits, too.\nRewiring America also has a savings calculator you can use to find out how much you could save with eligible tax credits and state-level rebates after you enter some household information. If you're feeling overwhelmed and not sure where to start, Kanj recommends scheduling a home energy audit, which is an in-person walk-through of your home with a contractor who will show you more energy-efficient solutions you could make to cut costs. That way, you'll have a plan of options and can choose what fits in your long- and short-term goals, added Kanj.\nMethodology\nAll figures, unless otherwise stated, are from YouGov Plc. The total sample size was 2467 adults. Fieldwork was undertaken between June 3rd and 5th, 2024. The survey was carried out online. The figures have been weighted and are representative of all US adults 18+, respectively."
    },
    {
      "url": "https://www.eia.gov/todayinenergy/detail.php?id=61303&src=email",
      "text": "On average, U.S. electricity customers experienced approximately five and one-half hours of electricity interruptions in 2022, almost two hours less than in 2021, according to our recently released Annual Electric Power Industry Report. The annual decline was driven by fewer major events in 2022 compared with 2021.\nSince 2013, the average duration of electricity interruptions each year has remained consistently around two hours after excluding major events. Major events that cause power interruptions include weather, interference from vegetation near power lines, and utility practices. We measure U.S. electric utility reliability using two indexes:\nWe measure the impact these major events have on electricity reliability by comparing the SAIDI and SAIFI values of the affected states with the U.S. average (5.6 hours of outages and 1.4 outages per customer). In 2022, the United States had 18 weather-related disasters that exceeded $1 billion dollars in damages per event. Notable major events include the following:\nCustomers in Florida, West Virginia, Maine, Vermont, and New Hampshire experienced the most interrupted power in 2022, ranging from an average of 10.3 hours in New Hampshire to 19.1 hours in Florida. Nationwide, electricity customers in the District of Columbia, Delaware, Rhode Island, Nebraska, and Iowa had the shortest total electricity interruptions in 2022, ranging from an average of 34 minutes in the District of Columbia to 85 minutes in Iowa.\nA higher average frequency of outages, unlike average duration, tends to be associated more with non-major events. Nationwide, Alaska had the most power interruptions per customer (3.5 interruptions on average), followed by Tennessee, Maine, West Virginia, and Vermont, all of which are heavily forested states. Power interruptions resulting from falling tree branches are common, especially because of winter ice and snowstorms that weigh down tree limbs and power lines. The District of Columbia had both the shortest outages and the fewest number of interruptions per customer.\nPrincipal contributor: Alex Gorski\nTags: electricity, prices, weather, outages"
    },
    {
      "url": "https://www.cnet.com/home/energy-and-utilities/backup-battery-vs-generator-which-emergency-power-option-is-better/",
      "text": "Power outages can't be predicted, and they can really ruin your day. That's exactly what happened when Puerto Rico's beleaguered power grid failed, leading to power outages on New Year's Eve. Thankfully, there are ways to be prepared for power outages this summer. There are two main options available when preparing your home in case of a power outage: home batteries and generators. Here, we break down how to choose the best option for you.\nPreviously, the only option was fuel-powered standby generators, but these days there are plenty of different backup power solutions. Quieter, fume-free home battery backups have arrived and are here to stay. Generators can run as long as you have fuel (usually propane, diesel or methane gas -- more commonly known as natural gas) to feed them. Home batteries also come without the carbon monoxide risk, noise or as much of the fuel cost. Solar panels can help keep your battery topped off but come with their own price tags.\nBatteries and generators provide the same basic service, but are considerably different devices. They both have pros and cons, so here's what you need to know when choosing.\nHome battery\nHome battery backup systems, such as the Tesla Powerwall or the LGES 10H and 16H Prime, store energy, which you can use to power your house during an outage. Batteries get that electricity from your home solar system or the electrical grid. As a result, they're much better for the environment than fuel-powered generators. They also might be better for your wallet.\nSeparately, if you have a time-of-use utility plan, you can use a battery backup system to save money on your electricity bill. Instead of paying high electricity rates during peak use hours, you can use energy from your battery backup to power your home. In off-peak hours, you can use your electricity as normal -- but at a cheaper rate -- and recharge your battery when it costs less.\nIf you have solar panels, you'll be able to store any excess electricity generated by your solar panels. This stored electricity can be used to power your home during the nighttime and periods of panel inefficiency.\nVirtual power plants, where you give up a bit of control over your battery's charge to your utility or another third party, are increasingly available. By giving up some access to the energy stored in your battery, you can earn a bit of money.\nGenerators\nOn the other hand, standby generators connect to your home's electrical panel and kick on automatically when the power goes out. Generators run on fuel to keep your electricity on during an outage -- typically natural gas, liquid propane or diesel. Other generators have a \"dual fuel\" feature, meaning that they can run on natural gas or liquid propane.\nCertain natural gas and propane generators can connect to your home's gas line or propane tank so there's no need to refill them manually. Diesel generators will need to be topped up to keep running.\nBattery backup vs. generator: How do they compare?\nThese pieces of equipment perform the same basic job but come with different costs, maintenance requirements and performance.\nPricing\nIn terms of cost, battery backups are the pricier option upfront. Generators need fuel to run, which means that you'll spend more money over time to maintain a steady fuel supply.\nWith battery backups, you'll need to pay for the backup battery system, as well as installation costs (each of which are in the thousands). Exact pricing will vary based on which battery model you choose and how many of them you need to power your home. It's common for an average-size home battery backup system to run between $10,000 and $20,000.\nFor generators, the up-front costs are slightly lower. On average, the price of purchasing and installing a standby generator can range from $7,000 to $15,000. Remember that generators require fuel to run, which will increase your operating expenses. The specific costs will depend on a few factors, including the size of your generator, which type of fuel it uses and the amount of fuel used to run it. You may also need to pay for regular maintenance or inspections of your generator.\nInstallation\nBattery backups earn a slight edge in this category because they can be mounted to the wall or floor, whereas generator installations require a bit more work. Regardless, you'll need to hire a professional for either type of installation, both of which will require a full day of work and may cost several thousand dollars.\nSome home batteries are more like oversized portable power stations and require little more than having an electrician install a transfer switch or smart electrical panel.\nAside from setting up the device itself, installing a generator also requires pouring a concrete slab, connecting the generator to a dedicated fuel source and installing a transfer switch.\nMaintenance\nBattery backups are the clear winner in this category. They're quiet, run independently, don't produce any emissions and don't require any ongoing maintenance.\nOn the other hand, generators can be quite noisy and disruptive when they're in use. They also emit exhaust or fumes, depending on which type of fuel they use to run -- which may irritate you or your neighbors.\nKeeping your home powered\nAs far as how long they can keep your home powered, standby generators easily outperform battery backups. As long as you have enough fuel, generators can run continuously for up to three weeks at a time (if necessary).\nThat's simply not the case with battery backups. Let's use the Tesla Powerwall as an example. It has 13.5 kilowatt-hours of storage capacity, which can provide power for a few hours on its own. You can get extra power out of them if they're part of a solar panel system or if you use multiple batteries in a single system.\nExpected lifespan and warranty\nIn most cases, battery backups come with longer warranties than standby generators. These warranties are measured in different ways.\nOver time, battery backup systems lose the ability to hold a charge, much like phones and laptops. For that reason, battery backups include an end-of-warranty capacity rating, which measures how effectively a battery will hold a charge by the end of its warranty period. In Tesla's case, the company guarantees that the Powerwall battery should retain 70% of its capacity by the end of its 10-year warranty.\nSome backup battery manufacturers also offer a \"throughput\" warranty. This is the number of cycles, hours or energy output (known as \"throughput\") that a company guarantees on its battery.\nWith standby generators, it's easier to estimate lifespan. Good-quality generators can run for 3,000 hours, as long as they're well maintained. Therefore, if you run your generator for 150 hours per year, it should last about 20 years.\nWhich battery backup is right for you?\nAcross most categories, battery backup systems come out on top. In short, they're better for the environment, easier to install and cheaper to run long-term. Plus, they have longer warranties than standby generators.\nPortable generators can be a good option in some cases. Unlike battery backups, you only need a single generator to restore power in an outage, which brings down the initial costs. Plus, standby generators can last longer than battery backup systems in a single session. As a result, they'll be a safer bet if the power is out for days at a time.\nYou might not need that big of a solution if you're only planning to back up a few things for short periods of time. You can also consider less-permanent solutions such as portable generators and portable power stations if your needs aren't as intensive.\nHow long does a solar battery last?\nMany solar batteries are warrantied for 10 or even 15 years. Batteries lose some of their capacity over the course of their lifetime. Tesla Powerwalls, for example, are guaranteed to have at least 70% of their capacity at the end of their 10-year warranty.\nHow long can a home battery backup your home?\nThis depends entirely on how much you're trying to power during an outage. A Tesla Powerwall has a capacity of 13.5 kilowatt-hours. If you want to keep the lights on and you have one 100-watt light bulb, you could theoretically keep it burning for 135 hours. If you want to add a refrigerator that requires 500 watts, it would reduce your run time to 22.5 hours. If you want to have a power-outage movie marathon on your 500-watt TV, your charge will last for a bit over 12 hours. When a backup battery is installed, you might be able to designate critical loads and send battery power only to those circuits during a blackout.\nIf your battery is connected to solar panels, it'll recharge throughout the day, extending its useful charge, sometimes over days."
    },
    {
      "url": "https://www.cnet.com/home/energy-and-utilities/how-big-of-a-home-generator-do-you-need/",
      "text": "Power outages are an increasingly common part of American life.\nWhether an outage lasts for a few minutes or a few hours, most people would prefer to keep the lights on and the fridge running during a blackout. And you can -- with the help of a portable or home generator. These generators use gasoline, propane or natural gas (all fossil fuels) to keep the electricity on.\nBut even if you've already decided you want a home generator, there are more decisions to make. Chief among them is choosing the right generator for your home. There are disadvantages to going too big or too small, so you want to try and get it right.\nHere's how to figure out what the right size is for your home generator.\nOffering the full suite of Generac's gas powered generators and rechargeable backup batteries, Canter Power Systems has been providing back-up power options for 70 years and is now the largest full-service generator installer in the nation. These products or services have not been evaluated by CNET's editorial staff. If you get an estimate or make a purchase through this link, we may receive a commission.\nCalculating the right generator size\nUltimately, choosing the right size for your generator is about making sure it can do what you want it to do, according to Kyle Raabe, president of consumer power at Generac.\nSome people want their entire home to remain powered without interruption, while others just want to charge their phone and keep their food from spoiling. \"What's important to people is different,\" Raabe said.\nA generator that's too small will be an obvious disappointment, because it will leave some of your essential appliances in the dark. And if you go too big, you'll have extra power, but you'll probably pay more than you need to, Raabe said.\nWhat's the deal with wattage?\nWattage is a measurement of the amount of electricity your home is using at any given time with your appliances running. Raabe said the average \"running wattage\" for a home is 2 to 4 kilowatts. But the important number for generators is \"starting wattage,\" which is the measurement of how much power is being used during a surge of demand when all of your appliances kick on; that can be anywhere between 18 to 26 kW, Raabe said.\nThe electrical code in the US generally requires that home generators be sized to handle that starting wattage, which would accommodate all of your appliances turning on at once after the generator starts running.\nUsing wattage to find the right sized generator for you\nOnce you understand how much starting wattage your home needs -- let's say 22 kW -- you'd want a generator with the same wattage -- 22 kW -- or more.\nLet's say you want a generator that can keep your fridge, A/C and water heater running, but you don't need your entire home backed up. The combined starting wattage of those three appliances is likely between 10 and 15 kW, which is the size of the generator you'd want.\nThere are some online calculators that allow you to plug in your appliances and home details and get an estimated starting wattage and generator size.\nYou can also go a bit smaller than your total starting wattage if you stagger your appliances when they turn back on. Because appliances draw a big surge of energy right when they turn on, and then return to a much lower running wattage, you can reduce your max starting wattage by staggering when your appliances turn on after a blackout -- a feature that some generators offer as a default, Raabe said.\nRead more: How to Choose Between Home Batteries and Generators\nGenerator size rules of thumb\nIt's hard to generalize the rules about sizing your generator, Raabe said. Each home and each person's needs are different.\nThat said, if you don't want to do any math, you can get a rough idea using an online calculator, and then bring in an expert to inspect your home and give you a more precise estimate, according to Raabe.\n\"A lot of people will just go bigger,\" Raabe said, because it gives them peace of mind. Or they'll use the staggering technology to reduce the size of the generator they need. \"That's by far the preferred way to go,\" he said.\nShould you get a generator?\nTo answer this question, Raabe says you should start by asking yourself: \"What's at risk?\" and \"What's the problem you're trying to solve?\"\nFor some people, blackouts are a minor inconvenience, or they can easily travel to a place that does have power until their lights come back on.\nFor others, blackouts might mean losing access to water from a well pump or refrigeration of critical medications. Especially for older folks who might not be able to travel to safety, a blackout is a bigger risk. \"Being without power, there's a level of seriousness there,\" Raabe said.\nIf you fall into the latter category, you should probably think about getting a generator if you can afford it. But if you don't mind the occasional candlelit evening, you can probably get by without one.\nGenerator alternatives\nIf you're looking for a fossil fuel-free generator alternative, you have options.\nIf you're looking for partial (and portable) backup, you can look into portable power stations, batteries you can charge up and move around to wherever you need power. A solar generator (which adds portable solar panels to a power station) would let you charge up using the sun, instead of grid power.\nHome batteries can back up your whole home if you get enough of them, but more typically back up essential appliances. Paired with solar panels, batteries can let you use solar power through the night.\nFrequently asked questions\nHow do I safely operate a generator?\nIf you've got a permanent home generator, it will automatically kick on safely and run as long as it's needed. If you're plugging in a portable gas generator, be sure to keep it far away from your house and any windows, to ensure the exhaust fumes don't drift inside.\nWhat size generator do I need to back up my whole home?\nThis depends on what you want to back up and how big your home is. You can use an online calculator to get a rough estimate, but contact a professional to get a precise estimate for your home."
    },
    {
      "url": "https://www.homeadvisor.com/cost/electrical/install-a-generator/",
      "text": "How Much Does Whole-House Generator Installation Cost in 2025?\nInstalling a whole-house generator costs an average of $5,172\nThe average cost of a whole-house generator installation is $5,172, ranging between $1,539 and $8,828, on average, for most homeowners.\nGenerator capacity, brand, and installation complexity are major cost drivers for your installation.\nBudgeting for maintenance is crucial to ensure long-term reliability.\nProfessional generator installation reduces safety risks and ensures proper setup.\nThis article was updated using automation technology and thoroughly reviewed for accuracy by HomeAdvisor Editor Ryan Noonan.\nInstalling a backup generator costs $5,172 on average, with most homeowners paying between $1,539 and $8,828. Depending on your situation, you can pay as little as $350 or as high as $13,500 on the high end.\nGenerators come in various sizes, configurations, and fuel types, and each factor can influence your final costs. When you set your budget, remember to plan for routine maintenance and bring in a licensed generator installer. Professional installation protects your investment, extends the generator’s life, and gives you peace of mind.\nWhole-House Generator Cost Factors\nYour final generator price comes down to a handful of key details—capacity, brand, labor rates, and a few site-specific extras. Here’s how your total cost breaks down.\nCapacity\nGenerator prices range from $500 to $18,000 based on how many kilowatts you need. Models over 30 kilowatts (kW) require liquid cooling, which adds a few thousand dollars to the base unit price compared to air cooling.\nSmall homes with one or two bedrooms and several appliances may need a low-end generator, costing $2,000 to $3,500. Large homes with high energy demands, like multiple refrigerators or heavy-duty HVAC, may need a 20-kilowatt or larger generator.\n| Generator Size in kW | Use | Unit Cost Range |\n|---|---|---|\n| 1–6 | Portable backup sizes | $500–$1,800 |\n| 7.5–10 | Essential and non-essential systems for homes under 1,500 sq. ft. | $2,000–$3,500 |\n| 14–18 | Critical systems for homes ranging from 1,500–3,000 sq. ft. | $4,000–$5,500 |\n| 20–24 | Main systems for large homes, 3,000–5,000 sq. ft. | $5,000–$6,500 |\n| 26–32 | Main systems for large homes, plus additional appliances and devices | $6,500–$15,000 |\n| 36–38 | Large homes with numerous high-demand appliances | $14,000–$16,000 |\n| 45–48 | Large homes with numerous appliances, systems, and commercial-grade equipment | $16,200–$21,000 |\nBrand\nThe brand you pick affects quality, reliability, available features, and the total price tag. Well-known brands like Generac or Cummins are popular among homeowners for their reliability, warranties, and customer service. They offer an array of generator models to suit various household needs.\n| Brand | Starting Cost |\n|---|---|\n| Champion | $2,000 |\n| Briggs & Stratton | $3,150 |\n| Generac | $6,000 |\n| Cummins | $3,700 |\n| Honda | $1,310 |\nConcrete Pad\nConcrete pads for generators cost $50 to $75 per square foot or $1,000 total for an 18-square-foot pad. Large standby and whole-house generators are permanent installations, so a concrete pad is necessary to protect them from water and other elements that can damage internal components.\nTransfer Switch\nA transfer switch detects electrical disconnection and switches from the grid power supply to your generator. The National Electric Code requires these devices for safety and backfeeding prevention.\nThere are several types of power switches. Residential buildings use either standard manual transfer switches, which range from $500 to $2,000, or automatic transfer switches, which range from $2,000 to $30,000.\nLabor\nHiring a generator installer in your area to install a permanent home generator costs between $1,500 and $5,000. While not required for portable units, installing a transfer switch and power inlet box also adds to labor costs. Most contractors charge on a per-project basis, but some contractors may add fees based on individual factors, such as:\nEnergy load assessment\nSite preparation\nFuel tank configuration\nGas line connection\nElectrical panel upgrade\nTransfer switch installation\nWiring and circuits\nPermits\nExpect to spend $50 to $200 per permit, though local rules and your installation specs set the final number. Most homeowners need one permit for the electrical upgrade and another for the fuel line or tank.\nMaintenance\nSet aside $80 to $300 per year for a pro to service your generator. Scheduling a tune-up before summer and again before winter helps catch problems early and keeps the unit ready for the next outage.\nElectrical Upgrades\nSome generator installations require changing or upgrading your electrical panel to accommodate the additional power supply. An electrical subpanel costs $500 to $2,000 and can isolate specific circuits for essential appliances. For large-capacity generators, you may need to replace the main electrical panel to handle increased loads safely.\nEnhancements\nGenerator enhancements can help your unit run more efficiently. Here are a few options to consider:\nWireless monitor ($200–$400): Provides remote generator status monitoring\nSmart load manager ($150–$300): Creates different zones to switch the power between them\nWhole-House Generator Cost by Type\nDepending on the type and size, you’ll spend $500 to $25,000 for most generators.\nStandby\nA standby generator costs $5,000 to $25,000. These permanent installations are hardwired to your home and can automatically power your home when it doesn’t have access to grid power. Depending on your home’s power demand and the size of the generator, a standby generator can power an entire home or just critical systems, such as HVAC, refrigeration, and lighting.\nPortable\nPortable generators cost $500 to $2,000. They run on either gasoline or diesel and range in size. Small one-kilowatt units can power critical systems, and larger units of up to 7.5 kilowatts can power most of a home. Portable units are ideal for short-term needs because they require manual operation.\nWhole-House Generator Cost by Fuel Type\nThe fuel type of a generator affects unit costs, installation fees, and ongoing expenses. Each fuel type has different advantages and drawbacks regarding efficiency, availability, and cost.\n| Fuel Type | Average Cost Range |\n|---|---|\n| Natural gas | $2,000–$21,000 |\n| Liquid propane | $2,000–$21,000 |\n| Diesel | $3,000–$20,000 |\n| Gasoline | $500–$3,000 |\n| Solar | $2,000–$25,000 |\n| Battery backup | $10,000–$25,000 |\nNatural Gas\nNatural gas generators cost $2,000 to $21,000. They’re only available as standby units because they require a permanent natural gas connection. The higher relative cost for a natural gas generator stems from its more complex fuel delivery system, but it offers superior efficiency and convenience over other types. Installation can be more costly, often requiring gas line pressure testing and generator ventilation checks.\nLiquid Propane\nPropane generators cost $2,000 to $21,000, and portable options average $600 to $2,600. They’re a popular option for off-the-grid and rural areas without natural gas line infrastructure. Propane generators also require setting up and storing a propane tank, ranging from $300 to $1,500, but liquid propane offers cleaner burning and has an indefinite shelf life.\nDiesel\nDiesel generators cost $3,000 to $20,000 for standby units. These large units are known for high efficiency and longevity but require manual refilling and sometimes have high fuel costs.\nGasoline\nGasoline generators are the most cost-effective option, at $500 to $3,000. They are mostly small and portable options, and gas is readily available in most regions. However, high gas prices and shorter shelf life can make them less economical.\nSolar\nSolar generators cost $2,000 to $25,000 for most homes. Most whole-home units cost $10,000 or more and involve installing solar panels. Portable solar generators are compact units with a built-in solar panel array, inverter, and battery to store generated power. They range from $1,500 to $5,000.\nSmall units can’t store large amounts of energy. Modern solar technology allows most units to produce power even during overcast days, although efficiency depends on the quality of solar equipment and your specific climate.\nBattery Backup\nA battery backup costs $10,000 to $25,000 for whole-home units. Fuel costs depend on whether you’re pulling from the grid or a solar array, but it’s an economical and sustainable backup option.\nCosts depend on the quality of the battery and other features. For example, some backup batteries automatically prioritize charging during off-peak grid rates to save costs.\nDoes Installing a Whole-House Generator Increase Home Value?\nA standby generator often boosts home value—especially in areas that see frequent outages or severe weather. The added convenience, comfort, and security appeal to future buyers, and they’re essential for households that rely on medical equipment.\nBudgeting for a Whole-House Generator\nGet the most from your investment and streamline your costs with these budgeting tips for whole-house generators:\nCollect at least three quotes from local generator installers so you can compare equipment and labor costs.\nMatch the generator size to your home’s load—buying extra capacity only drives up the bill.\nAsk generator installers about off-season deals or limited-time promos to trim expenses.\nLook for fuel-saving features that help you cut operating costs over the long haul.\nHow HomeAdvisor Gets Its Cost Data\nNo place is more important than your home, which is why HomeAdvisor connects homeowners with local pros to transform their houses into homes they love. To help homeowners prepare for their next project, HomeAdvisor provides readers with accurate cost data and follows strict editorial guidelines. We surveyed thousands of real customers about their project costs to develop the pricing data you see, so you can make the best decisions for you and your home. We pair this data with research from reputable sources, including the U.S. Bureau of Labor Statistics, academic journals, market studies, and interviews with industry experts—all to ensure our prices reflect real-world projects.\nPlan on professional maintenance once a year. In between visits, follow the owner’s manual for oil changes, air-filter swaps, spark-plug checks, and battery tests. Drain gasoline if the unit will sit for months, and run the generator briefly every few weeks to keep parts lubricated. At the first sign of trouble, book a repair visit so minor issues don’t spiral into major damage.\nWith regular service, a quality standby generator can run for 30 to 50 years—or roughly 3,000 hours of standby power. Limit any single run to 500 hours or less to avoid excess wear. Pairing the unit with an extended warranty and sticking to yearly maintenance protects performance and keeps your investment working when you need it most.\nA whole-house generator delivers reliable power, keeps critical systems online, and can raise resale value. It’s a smart add-on if you work from home, experience frequent outages, store perishables, use medical devices, or rely on a sump pump. During a blackout, the unit switches on automatically so you stay comfortable, productive, and safe."
    },
    {
      "url": "https://www.cnet.com/home/energy-and-utilities/a-guide-to-blackouts-why-they-happen-and-how-to-stay-safe/",
      "text": "Whether it's from heat or storms, the weather can leave you in the dark. Hurricane Helene knocked out power to more than 4 million customers in the Southeast. And Hurricane Milton is threatening Florida after growing quickly into a Category 5 storm Monday.\nThis comes after a hot summer across much of the US, with heat waves and drought conditions in much of the country.\nRough weather often means power outages. A blackout that lasts an hour or two isn't a big deal, but one that lasts days can be outright dangerous for you and your family. The alarms are already blaring that some parts of the US are going to be extremely vulnerable to energy shortages and blackouts this year.\nCan solar panels save you money?\nInterested in understanding the impact solar can have on your home? Enter some basic information below, and we’ll instantly provide a free estimate of your energy savings.\nYou can fare a lot better if you take the time to learn why blackouts happen and how to prepare for them. Experts say it doesn't have to be time-consuming, but even a simple blackout plan can save you a lot of headaches.\nHere's your guide to weathering your next blackout safely, and maybe even comfortably.\nWhy do blackouts happen?\nBlackouts happen for many reasons. In the past few years, the North American Electric Reliability Corporation warned of an increased risk of blackouts throughout much of western North America. The prospect of hotter than normal summers, lower than normal hydroelectric reservoirs and potentially higher than usual demand for electricity all made it more likely the supply of electricity wouldn't have been able to meet the demand for it, triggering blackouts.\nMore common reasons for blackouts are weather-related. Wildfires, hurricanes, thunderstorms and snowstorms can bring down power lines or disrupt electricity generation, causing blackouts.\nEven extreme cold on its own can cause the power grid to go down. With more Americans electrifying their home heating systems, extreme cold can ramp up electricity demand beyond what the grid can handle.\n\"Everything is jumping on the grid at the same time when it gets freezing cold,\" said Kyle Raabe, president of consumer power at Generac, a company that makes generators and backup batteries.\nAs extreme weather gets more intense due to climate change, more blackouts could be a consequence. If blackouts do occur in your area, there are a few things you can do beforehand to prepare.\nRead more: Do Blackouts Affect Homes With Solar Panels? Sometimes\nWe used data from the US Energy Information Administration to map how many power outages per year the average utility customer in each state had from 2018-2022 (using all reporting methods). We also looked at the average total duration of outages per year, in hours.\nAre blackouts dangerous?\nBlackouts are disruptive, plain and simple. Those disruptions could range from something as minor as an interrupted TV show, to something as life-threatening as a temperature-sensitive medicine going bad.\nA short blackout may not pose a big danger, but longer ones lasting many hours or even days can put you at risk. Some rural Americans rely on electric well pumps for their drinking water, while just about everyone relies on a fridge to keep their food from spoiling. \"Now all the sudden it becomes, can I eat?\" Raabe said.\nPeople with limited mobility might be the most vulnerable during a blackout, according to Raabe. If you can't easily jump in a car and drive to a hotel or a friend's home to access electricity, you need to make sure you can safely hunker down in your own home for an extended period.\n\"It's different for everyone, and it's part of the reason we always recommend, think about it ahead of time,\" Raabe said.\nHow to prepare for a blackout: A checklist\nThe Department of Energy has a list of some things to have on hand for blackout preparation. That list is reflected below with a few additions.\n- Flashlights and batteries: The DOE suggests a flashlight in every room, but it seems good enough to have plenty of lights and batteries handy. Sure, phones have flashlights, but if a blackout carries on for a while, you might want to save that phone charge for other tasks, like communication or entertaining a kid.\n- Candles and matches: Candles don't run out of battery and matches are a reliable fire starter. Take extra caution with open flames, don't leave them unattended and don't use them if there's a risk of a gas leak.\n- Alternative lighting: Getting a solar lantern that can recharge without plugging in or LED lanterns with long-lasting batteries are two other ways to safely light your house.\n- Your utility's emergency number: If you smell a gas leak, you don't want to be reliant on Wi-Fi to pull up your utility's emergency number. Write it down somewhere.\n- Backup generator: Generators can be big purchases but can provide backup energy. If you get one, make sure it is safely installed and far from your windows to avoid the risk of carbon monoxide poisoning. If you have a backup battery, you can make sure it's fully charged ahead of bad weather.\n- Ice packs and a cooler: If you have medicine that needs to stay cold, make sure you have some ice packs and a cooler ready. Then, only open it when you need it. Each time it's opened, warm air gets in and reduces the time the interior will stay cold. The same goes for your fridge and freezer.\n- Water: If you get water from a well, you'll need to keep water on hand. The DOE suggests one gallon a day per person.\n- Food: Keep some food that's nonperishable and doesn't require cooking. Canned goods would work well here.\n- First aid kit: You can stock your own first aid kit or buy one from the Red Cross.\n- Disaster plan: Decide beforehand where you and your family will meet if your home isn't an option and communication isn't possible.\n- Locations of cooling or warming stations: Cities often have cooling stations in the summer (or warming stations in the winter). If your air conditioning or furnace is out, make sure you know places you can head if it gets dangerously hot or cold.\nWhat not to do during a blackout\nThe biggest thing you want to avoid during a blackout is improperly using a portable home generator. The gas-powered devices emit toxic fumes that you don't want coming into your home. \"Number one, keep that away from the house,\" Raabe said. \"Get that thing away from the house and run the cords in.\"\nYou also want to avoid frying your expensive electronics with a power surge when the power comes back on. Using a surge protector, or unplugging TVs and computers, can help prevent this.\nAnd of course, try not to open your fridge or freezer frequently during a blackout. You want to preserve the cold (and your food) for as long as possible.\nWhat to do after a blackout\nAfter the power comes back, the hard part is over, but you'll need to dispose of any spoiled food or medicine. With food, it's best to err on the side of caution. Throw things away if they've been unrefrigerated (above 40 degrees) for two or more hours, the Department of Homeland Security says. (The department runs the website Ready.gov with tips to prepare for almost any kind of disaster.) With medicines, it's best to consult with your doctor.\nAnother key step: Revisit that blackout plan you made and see what you might want to do differently next time. Raabe recommends you ask yourself, \"Hey, did my plan work for me?\"\nA blackout is bound to bring some sort of inconvenience, but managing those problems and staying safe is possible with just a bit of preparation.\nHere are additional ways your phone can help in an emergency and how to keep your pets safe during natural disasters. Plus, the five things that could help you get through a power outage.\nFrequently asked questions\nAre blackouts becoming more common?\nYes, blackouts and power disruptions have become more frequent over the past few years. This is mainly driven by extreme weather events in the US. Low-income areas and states that are prone to extreme weather events, such as hurricanes and winter storms, are more likely to experience blackouts.\nIs a generator necessary for getting through a blackout?\nIn a word: No. Everyone has different needs during a blackout. Some households might do fine with a small portable battery to charge their phones. Other families might feel safe with a small portable generator to power a fridge and other essentials. Others might want the convenience of a permanent standby generator that flips on automatically and powers their entire home.\nWhat's the difference between a brownout and a blackout?\nA blackout is a total and unexpected loss of power. Blackouts can last anywhere from a few minutes to a few days or even weeks. A brownout is only a partial loss of power, where a system's capacity and voltage are reduced. Brownouts usually happen when there's high demand across the power grid."
    }
  ],
  "argos_summary": "Home generators can provide essential backup power during outages, which are becoming more frequent due to severe weather and rising energy costs. Options include portable units, standby systems, and solar-powered alternatives, with costs ranging from $1,538 to $8,818 for whole-home generators. While generators can be a significant investment, they offer peace of mind and safety during extended outages, especially for vulnerable populations. Understanding the costs, installation requirements, and benefits is crucial for making an informed decision about whether a generator is right for your home.",
  "argos_id": "K0PKDX856"
}