{
  "url": "https://www.usatoday.com/story/sports/nfl/2025/08/14/matthew-stafford-injury-update-workout-saturday/85665991007/",
  "authorsByline": "Tyler Dragon",
  "articleId": "fe720ab503634ac598e7498a11f9d59d",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/14/USAT/85666064007-usatsi-26368015.jpg?crop=8000,4501,x0,y266&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T20:59:06+00:00",
  "addDate": "2025-08-14T21:05:47.750795+00:00",
  "refreshDate": "2025-08-14T21:05:47.750797+00:00",
  "score": 1.0,
  "title": "Rams QB Matthew Stafford to workout Saturday, per coach Sean McVay",
  "description": "Rams head coach Sean McVay provided an encouraging update about veteran quarterback Matthew Stafford on Thursday.",
  "content": "• Rams QB Matthew Stafford will have a workout on Saturday to test his aggravated back injury.\n• The Rams held a joint practice with the Saints after the Chargers canceled a planned session due to injury concerns.\n\nMatthew Stafford’s back injury is the biggest storyline surrounding the Los Angeles Rams this summer. Rams head coach Sean McVay provided an encouraging update about the veteran quarterback on Thursday.\n\nStafford will have a workout on Saturday, Aug. 16, McVay told reporters. The Rams coach said Stafford’s session is expected to be like the one he had last Saturday.\n\nStafford’s been bothered by an aggravated disk in his back that’s caused him to miss training camp. The veteran quarterback was supposed to practice in some capacity on Monday, Aug. 11, after his previous throwing session last Saturday, but he didn’t “feel great” following the workout.\n\nThe Rams quarterback will give it another try this weekend with the hopes his back responds better to the workout.\n\nStafford could be back on the field in relatively short order if all goes well.\n\nThe Rams host their crosstown rival, the Los Angeles Chargers, on Saturday at SoFi Stadium in a preseason exhibition. The Rams and Chargers were scheduled to have a joint practice on Wednesday, but Chargers coach Jim Harbaugh canceled the session because of injury concerns.\n\nThe Rams pivoted and conducted a joint practice with the New Orleans Saints on Thursday.",
  "medium": "Article",
  "links": [
    "https://twitter.com/TheTylerDragon",
    "https://sportsdata.usatoday.com/football/nfl/players/matthew-stafford/323205",
    "https://www.usatoday.com/story/sports/nfl/2025/08/12/matthew-stafford-back-injury-rams/85620726007/",
    "https://sportsdata.usatoday.com/football/nfl/teams/los-angeles-rams/343",
    "https://www.usatoday.com/picture-gallery/sports/nfl/2025/07/22/nfl-training-camps-2025-photos/85331884007/",
    "https://www.usatoday.com/story/sports/nfl/2025/08/11/matthew-stafford-injury-update-sean-mcvay-rams/85615679007/",
    "https://sportsdata.usatoday.com/football/nfl/scores"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Rams QB Matthew Stafford",
      "weight": 0.12747265
    },
    {
      "name": "Rams head coach Sean McVay",
      "weight": 0.11759845
    },
    {
      "name": "last Saturday",
      "weight": 0.109195895
    },
    {
      "name": "Matthew Stafford",
      "weight": 0.108626574
    },
    {
      "name": "coach Sean McVay",
      "weight": 0.10172131
    },
    {
      "name": "Chargers coach Jim Harbaugh",
      "weight": 0.101243004
    },
    {
      "name": "Saturday",
      "weight": 0.10043184
    },
    {
      "name": "Rams",
      "weight": 0.097811736
    },
    {
      "name": "Stafford",
      "weight": 0.09667421
    },
    {
      "name": "Sean McVay",
      "weight": 0.084408924
    }
  ],
  "topics": [
    {
      "name": "Sports Figures"
    },
    {
      "name": "Football"
    },
    {
      "name": "NFL"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98388671875
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.97607421875
    }
  ],
  "sentiment": {
    "positive": 0.09162544,
    "negative": 0.52804095,
    "neutral": 0.3803336
  },
  "summary": "The Los Angeles Rams have confirmed that their quarterback, Matthew Stafford, will undergo a workout on Saturday to test his aggravated back injury. The injury has been a significant storyline for the team this summer, with Stafford missing training camp due to an aggravated disk. The Rams held a joint practice with the Saints after the Chargers cancelled a planned session due to injury concerns. If all goes well, the Rams could be back on the field within days.",
  "shortSummary": "The Rams' Matthew Stafford will workout on Saturday to test his back injury, following a brief absence, and hopes to return for the upcoming game against the Chargers.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d68e81404009408ba7e07a91caf1d319",
  "places": [
    {
      "osmId": "860635712",
      "road": "Champion Drive",
      "city": "Inglewood",
      "state": "California",
      "postcode": "90301",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 33.95340735,
        "lon": -118.33900981025587
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/matthew-stafford/323205",
      "text": "See the current futures odds for Jonathan Greenard to win the 2025 NFL Defensive Player of the Year award.\nSee the current futures odds for Andrew Van Ginkel to win the 2025 NFL Defensive Player of the Year award.\nSee the current futures odds for Fred Warner to win the 2025 NFL MVP award.\nSee the current futures odds for Dallas Turner to win the 2025 NFL Defensive Player of the Year award.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/scores",
      "text": "Gannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/2025/08/11/matthew-stafford-injury-update-sean-mcvay-rams/85615679007/",
      "text": "Rams' Matthew Stafford 'didn't feel good enough to practice' Monday, per Sean McVay\nMatthew Stafford's training camp debut ended up being a false start.\nThe Los Angeles Rams quarterback has been sidelined for the entirety of training camp thus far with a back injury. Stafford received an epidural to relieve the pain from an aggravated disc in his back, according to NFL Network's Ian Rapoport on Aug. 6.\nStafford went through a workout on Saturday, throwing 60 passes without limitations. Head coach Sean McVay was optimistic about the 37-year-old quarterback, revealing the team planned to have him in training camp practice on Monday.\nThat was short-lived, however, as Stafford appeared at practice in street clothes.\nMcVay said, via the team's website, that Stafford \"didn't feel good enough\" to participate, adding that they would take a cautious approach.\nThe Rams coach said that Stafford \"had a great workout\" and \"felt good\" on Saturday, \"but then you come into today (Monday), it doesn't feel great, and so didn't think it was the right decision to be able to push him.\"\nWith the Rams' season opener less than a month away, the clock is ticking on Stafford's ability to be ready in time for Week 1 – even if the veteran figures to require less practice at this stage of his career.\nMcVay continued to emphasize the importance of being smart in their approach to the injury, stating that they'll continue to take it one day at a time.\n\"More than anything, I feel for a guy that I really care about that wants to be out there more than anything else,\" McVay said. \"We're going to be smart. But he didn't feel good enough, and we didn't think it was the right thing to do based on how he woke up feeling today.\"\nAs for the possibility of surgery, McVay said that wasn't a conversation they've had, adding that it hasn't come up. He was also non-committal about Stafford's status if there was a regular season game this week, saying he didn't know if the quarterback could play, but added, \"I think he still probably would be able to play just based on how he feels.\"\nThere are still a few weeks to sort everything out, but for now, it's Jimmy Garoppolo who continues to get the first-team reps in practice.\nStetson Bennett has slid up into the backup role as a result.\nAs for the Rams, they'll want Stafford atop the depth chart when they battle the Houston Texans in Week 1. Based on McVay's comments, however, don't expect L.A. to rush him back."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/2025/08/12/matthew-stafford-back-injury-rams/85620726007/",
      "text": "Matthew Stafford's back injury isn't a concern, but Rams using caution with quarterback\nMatthew Stafford will be back (pun intended). It’s not time to be concerned…yet.\n“I think the fair answer is, I'm going to take it a day at a time as well,” Los Angeles Rams coach Sean McVay answered on Monday, Aug. 11 when asked if he was concerned about Stafford’s back ailment. “I can't be 27 days from now in Houston.”\nIt’s fair to raise an eyebrow about Stafford’s aggravated disk in his back that’s caused him to miss training camp. The veteran quarterback was supposed to practice in some capacity on Monday after a throwing session on Saturday, but he didn’t “feel great” following the workout.\n“I feel for Matthew because of how much he wants to be out there and feel good. Ultimately what ended up happening, had a great workout, felt good, but then come in (Monday), it doesn't feel great. (I) didn't think that was the right decision to be able to push him,” McVay said. “We're going to be smart, but he didn't feel good enough and we didn't think it was the right thing to do based on how he woke up feeling today.”\nThe Rams are “smart” to be cautious with Stafford. He’s a 37-year-old quarterback entering NFL season No. 17. He’s in the fifth year of McVay’s offense and knows the scheme. The Rams have more than three weeks until their 2025 season opener at SoFi Stadium against the Houston Texans.\nTwenty-plus days out, it’s not time to be overly concerned. However, the concern meter rises incrementally each passing day Stafford is out of practice. Stafford is missing valuable practice reps with new addition wideout Davante Adams. Plus, there’s natural rust the veteran quarterback will have to work through when he does return.\nHow many practice reps will Stafford have before Sept. 7? Will Stafford be able to shake off any rust from his absence before it’s time for the real action? Two of the Rams’ first three games are against playoff teams from a season ago, including the defending Super Bowl champion Philadelphia Eagles.\nThe positive news is the Rams have shown the capability to rebound from a shaky start. They began the 2024 season 1-4 before rallying to win the NFC West title. The bad news is Stafford’s a 37-year-old quarterback with back issues. Stafford was sacked 28 times last year. He was hit 63 times, the most in his four seasons in Los Angeles. What happens when Stafford takes hits this season? Back issues tend to occasionally flare up for an athlete Stafford’s age.\nThe Rams are right to exercise caution. It’s not time to be concerned. But the situation can change quickly, especially with a veteran quarterback’s back.\n“He looked damn good throwing the other day. Nobody's tougher than him,” McVay said. “We also want to see if we can have him feeling as good as possible. That's super important.”\nFollow USA TODAY Sports' Tyler Dragon on X @TheTylerDragon."
    }
  ],
  "argos_summary": "Los Angeles Rams quarterback Matthew Stafford is set to undergo a workout on Saturday to assess his aggravated back injury, which has kept him out of training camp. Head coach Sean McVay remains optimistic but emphasizes a cautious approach, noting that Stafford did not feel well enough to practice earlier this week despite a successful throwing session last Saturday. With the Rams' season opener approaching, the team is focused on ensuring Stafford's health while managing his practice time.",
  "argos_id": "K7621ZVYN"
}