{
  "url": "https://www.nasdaq.com/articles/ess-tech-revenue-jumps-fiscal-q2",
  "authorsByline": "The Motley Fool",
  "articleId": "de788c177fb34012bc33371b0ed55ffc",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T20:41:00+00:00",
  "addDate": "2025-08-14T21:16:30.273140+00:00",
  "refreshDate": "2025-08-14T21:16:30.273141+00:00",
  "score": 1.0,
  "title": "ESS Tech Revenue Jumps in Fiscal Q2",
  "description": "Key PointsGAAP revenue grew nearly sevenfold from Q2 2024 to Q2 2025, driven by the first Energy Base battery project sales.",
  "content": "Key Points\n• None GAAP revenue grew nearly sevenfold from Q2 2024 to Q2 2025, driven by the first Energy Base battery project sales.\n• None GAAP net loss and cash burn improved significantly year over year, with GAAP operating expenses declined by 35% quarter-over-quarter.\n• None GAAP cash and cash equivalents ended the quarter at $0.8 million, highlighting ongoing liquidity risks even after raising fresh capital.\n• These 10 stocks could mint the next wave of millionaires ›\n\nESS Tech (NYSE:GWH), a company known for its iron flow long-duration energy storage batteries, released earnings for the second quarter of fiscal 2025 on August 14, 2025. The headline from the release was a significant increase in GAAP revenue, reaching $2.4 million and met analyst consensus. Although the company’s GAAP net loss narrowed sharply year over year, liquidity remains a top concern, with a period-end cash balance of just $0.8 million despite recent capital-raising moves. The quarter showed real operational progress and commercial traction.\n\nWhat ESS Tech Does and Where It’s Focused\n\nESS Tech designs and manufactures iron flow batteries for use in long-duration energy storage. These batteries are made to address the needs of renewable energy projects and modernize the electric grid, offering an alternative to lithium-ion batteries. The company’s flagship products use abundant materials, long-lasting components, and a proprietary Proton Pump which enables over 20,000 charge cycles without loss of performance.\n\nSince its founding, ESS Tech has focused on making its technology more competitive with established battery types by cutting manufacturing costs and building partnerships that provide customers with financial guarantees. The business sees long-duration storage—energy storage for periods longer than eight hours—as the largest area where it can stand out. To support market adoption, ESS Tech collaborates with insurers and development banks to ensure reliability, performance, and strong incentives for buyers.\n\nQuarter Highlights: What Happened and What Drove the Numbers\n\nThe second quarter saw a major milestone: the first sale of the new Energy Base iron flow battery platform, a product aimed at utility- and grid-scale storage needs. While sales are still early-stage, ESS Tech reported closing this initial project and entering into new contracts for further Energy Base deployments. Proposal activity remained high, with over 1.1 gigawatt hours (GWh) of projects submitted—an indicator of rising market interest even if actual order conversion is still developing.\n\nFinancial results showed GAAP revenue was nearly seven times higher than in Q2 2024, reflecting the first direct sales impact of the new Energy Base system. At the same time, cost cuts were significant. GAAP operating expenses dropped by 35% quarter-over-quarter, and adjusted EBITDA (non-GAAP) loss improved by 49% compared to Q1 2025. The company also highlighted an approximately 80% reduction in operating cash burn in June 2025 compared to the monthly average for the first five months of the year, showing early results of renewed cost discipline and efficiency efforts.\n\nMargins remained a challenge: GAAP costs to produce and deliver the batteries were still more than three times total GAAP revenue, leading to a gross loss for the quarter. This outcome points to the typical early-stage hurdles of ramping up a new manufacturing process—especially as economies of scale have not yet been fully realized. ESS Tech’s management noted that GAAP cost of revenue fell 15% from Q1 2025, but acknowledged gross loss remains large in absolute terms. No material one-time charges or events were declared, with no new dividend initiated or changed this period.\n\nThe financial position at the period’s close was a key storyline. GAAP cash on hand finished at only $0.8 million. The company responded by raising up to $31 million in new capital, including an immediate cash infusion and a $25 million Standby Equity Purchase Agreement in July 2025. This deal allows ESS Tech to sell shares as needed to meet liquidity needs, though this form of financing may lead to shareholder dilution. There were no declared changes to issued or planned dividends—the company does not currently pay a dividend. Newly appointed leaders joined the executive team, including a Chief Operating Officer and interim Chief Financial Officer, signaling a focus on operational stability and driving performance toward profitability.\n\nLooking Ahead: Guidance and Areas to Watch\n\nESS Tech did not provide specific forward guidance for revenue or profit in the next quarter or for all of fiscal 2025. The company signaled continued investment in commercialization and operational discipline. Leadership plans to focus on converting its robust proposal pipeline into signed contracts, while maintaining cost-cutting strategies wherever possible.\n\nWith liquidity concerns still present, investors will likely pay close attention to GWH, which does not currently pay a dividend.\n\nRevenue and net income presented using U.S. generally accepted accounting principles (GAAP) unless otherwise noted.\n\nWhere to invest $1,000 right now\n\nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 1,062%* — a market-crushing outperformance compared to 185% for the S&P 500.\n\nThey just revealed what they believe are the 10 best stocks for investors to buy right now, available when you join Stock Advisor.\n\nJesterAI is a Foolish AI, based on a variety of Large Language Models (LLMs) and proprietary Motley Fool systems. All articles published by JesterAI are reviewed by our editorial team, and The Motley Fool takes ultimate responsibility for the content of this article. JesterAI cannot own stocks and so it has no positions in any stocks mentioned. The Motley Fool recommends ESS Tech. The Motley Fool has a disclosure policy.",
  "medium": "Article",
  "links": [
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=b95731f7-8a51-431c-928c-54027963a30a&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001039%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_partners%26ftm_pit%3D17187&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=b3bf7ca7-7346-4318-a8ab-811b66da4a2e",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=b4f70056-7589-496c-9024-a9f545c1a88c&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D10969%26source%3Disaedikp0000070%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_partner%26ftm_pit%3D17996",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=b95731f7-8a51-431c-928c-54027963a30a&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001039%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D17187%26ftm_veh%3Darticle_pitch_feed_partners&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=b3bf7ca7-7346-4318-a8ab-811b66da4a2e",
    "https://www.fool.com/legal/fool-disclosure-policy/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "ESS Tech Revenue",
      "weight": 0.08293592
    },
    {
      "name": "GAAP revenue",
      "weight": 0.0810917
    },
    {
      "name": "GAAP cost",
      "weight": 0.07954268
    },
    {
      "name": "GAAP costs",
      "weight": 0.07954268
    },
    {
      "name": "GAAP cash",
      "weight": 0.0790353
    },
    {
      "name": "GAAP net loss",
      "weight": 0.075790524
    },
    {
      "name": "ESS Tech",
      "weight": 0.07396796
    },
    {
      "name": "GAAP operating expenses",
      "weight": 0.06797034
    },
    {
      "name": "GAAP",
      "weight": 0.0661956
    },
    {
      "name": "iron flow batteries",
      "weight": 0.063777044
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97265625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9677734375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9208984375
    }
  ],
  "sentiment": {
    "positive": 0.837237,
    "negative": 0.04906731,
    "neutral": 0.11369565
  },
  "summary": "ESS Tech (NYSE:GWH), a company known for its iron flow long-duration energy storage batteries, reported a significant increase in GAAP revenue of nearly sevenfold from Q2 2024 to Q2 2025, driven by the first Energy Base battery project sales. Despite this, GAAP net loss and cash burn improved significantly year over year, with operating expenses decreasing by 35% quarter-over-quarter. Despite raising up to $31 million in new capital, ESS Tech faced significant liquidity risks with a period-end cash balance of only $0.8 million. The company's focus is on making its technology more competitive with established battery types by reducing manufacturing costs and securing partnerships that provide customers with financial guarantees. No new dividend or dividend changes were declared during this period.",
  "shortSummary": "ESS Tech's revenue surged nearly sevenfold to $2.4 million in Q2 2025, driven by Energy Base battery sales, despite significant losses and liquidity concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9a5dbd7733ba41a4aaf20b86db16868f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/legal/fool-disclosure-policy/",
      "text": "Here at The Motley Fool, when it comes to matters of money, we believe in transparency and accountability. Day in and day out, we dedicate ourselves to delivering responsible investing ideas and sound financial education. That's why, when it comes to talking about stocks, we think it's important that you know exactly where we're coming from. With this in mind, we have developed a company-wide disclosure policy to guide our business and communications. We call it Fool Disclosure. We invite you to take some time to read through it, and hope it helps inform your experience here in Fooldom.\nInvestors Communicating With Investors\nThe Motley Fool is a company that represents investors teaching and learning from other investors. Many financial publications do not permit their writers and editors to own stocks. The Motley Fool not only permits, but also encourages its staff to invest in common stock. Why? Two reasons.\nFirst, we strongly believe the most effective way to create wealth is through the long-term ownership of stocks. The stock market has compounded 10% average annual returns over the last century. We believe in using the stock market as a savings bank, and we strongly encourage treating money management as a lifelong endeavor. Therefore, we think it'd be downright mean of us to close that avenue of investment to our employees.\nSecond, and more important, we don't consider our employees to be journalists, but rather communicators and teachers of financial matters. It's a subtle but critical difference that affects our entire service -- from our online site at Fool.com, to our investment books, to our nationally syndicated newspaper column, to our newsletters and portfolio services. As a company, we utilize every available medium to teach people of all ages, all income levels, all backgrounds, and all genetic codes about money and its applications in modern life. Therefore, we believe our staff's involvement in managing their own money is critical to their learning more about the subject and their succeeding in their own lives. And who better to write about investing than those who do it themselves?\nThe Motley Fool writes about stocks in both free and paid content. We make stock recommendations in our various premium newsletter services and actually hold some of these shares in our portfolio services. We will disclose our recommendation or ownership until we cease to recommend the stock, or we sell our entire position. Of course, in both free and paid content we will continue to disclose whether the author has an interest in the stocks mentioned.\nInternally, the Fool has always strived to operate with the highest levels of integrity and transparency. As such, here are the key components of The Motley Fool's disclosure policy:\nDisclosure\n- When a writer writes about a stock that he or she has a position or beneficial interest in, that fact is disclosed at the end of the article.\n- If The Motley Fool recommends or holds a position in a stock, that fact is also disclosed at the end of the article.\n- All Fool employees and contractors -- that's anyone with a TMF prefix on their screen names -- are required to disclose their current positions, including stocks, mutual funds, and cryptocurrencies. We aggregate and display these positions for the entire company here. (We do not disclose the individual stocks that might be in a Fool's mutual funds.)\n- Affiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no knowledge of any affiliates' holdings and/or specific recommendations, and the affiliates' personnel have no knowledge of any editorial content before it is published. Our affiliate companies may also have their own disclosure policies, which they may make available on their respective sites.\nTrading Restrictions\nIn addition to the above disclosure requirements, Fool employees work under additional trading restrictions and guidelines. These restrictions require that they:\n- Must hold any stock they own for at least 10 days. (No day trading allowed -- as if we'd want to!)\n- Cannot write about a stock in the period of 2 market days before to 2 market days after purchasing or selling the stock.\n- Must clear trades with our compliance department prior to any transaction.\n- Must notify our compliance department every time they buy or sell a stock, regardless of whether they have written about it.\nInvestors in The Motley Fool\nThe Motley Fool is grateful to the people that have invested in us. The Fool's founders and some family members have invested in the company, and full-time employees receive stock options and/or stock in the company.\nBusiness and Technology Partners\nWe have business relationships with an ever-changing assortment of companies, including technology vendors, leasing companies, data providers, banks, distribution channels, advertisers, landlords, accountants, and the restaurants up the street from Fool HQ. Many of these companies are public companies operating in industries that we follow. There may be instances in which one of our newsletters recommends a company with whom we have a business relationship, or we may write an article about such a company on Fool.com. These occurrences are unintentional and coincidental, as the business end of The Motley Fool has no input or influence on the editorial side of things.\nIt would take too much space to list all the companies that we do business with, and we'd probably forget some anyway, but below are some of our major partners. (This list is most subject to change. We'll update it periodically, but we will not be able to keep pace with the rate of change.)\nInvesting Advertisers\nAs a general rule, if you see ads from a company on our site and emails, that company is paying us for such placement. Some of the major ones include E*Trade, Fidelity, Scottrade, OptionsHouse, and ShareBuilder. Additionally, companies pay us for inclusion in specific areas of our site (e.g., Registration Page, Broker Center).\nMotley Fool Money\nA portion of our site, branded as Motley Fool Money, writes reviews of personal finance products, including credit cards, mortgage offers, and brokerage accounts. We may receive compensation for offers that appear on Motley Fool Money, including compensation related to placement.\nWe may issue recommendations for preferred partners that we believe in and/or use ourselves. But keep in mind, this site may not include all available offers from our partners. For example, there are thousands of credit cards available. We’ll highlight a fraction of them. All picks are made at the editorial discretion of Motley Fool Money editorial team.\nFor a list of major advertisers on Motley Fool Money, click here.\nDistribution Partners\nSome of our major distribution partners include Yahoo! Finance, MSN Money, USA Today, AOL, Nasdaq, and CNN Money.\nNews, Quotes, Data, and Content Providers\nOur major providers include Xignite SIX Financial.\nMajor Service Providers or Other Partners\nSilicon Valley Bank, Slack, Namely, Charles Schwab, Interactive Brokers, Worldpay/Vantiv, and Jones Lang LaSalle.\nIn Conclusion\nWe have designed our disclosure and trading guidelines to serve our community, our customers, and our employees fairly. As always, though, you should remember to consider every piece of investment information you receive, here at the Fool or elsewhere, not as a de facto recommendation, but as an idea for further consideration. Even the strongest disclosure policy in the world does not excuse individuals from taking responsibility for their own decisions. Due diligence, critical thought, and use of the most extraordinary device in the world (the human brain) are crucial to your financial success.\nLast updated November 11th, 2024."
    }
  ],
  "argos_summary": "ESS Tech reported significant growth in its Q2 2025 earnings, with GAAP revenue increasing nearly sevenfold year-over-year to $2.4 million, driven by the first sales of its Energy Base battery project. Despite narrowing its net loss and reducing operating expenses by 35%, the company faces liquidity challenges, ending the quarter with only $0.8 million in cash. ESS Tech is focused on long-duration energy storage solutions and aims to convert a robust proposal pipeline into signed contracts while maintaining cost-cutting measures.",
  "argos_id": "L3HP3ZQYV"
}