{
  "url": "https://www.cbsnews.com/pittsburgh/news/penndot-aaa-back-to-school-safety-tips/",
  "authorsByline": "By\n                        \n              Chilekasi  Adele",
  "articleId": "501897fd16c94360a96b0afc0bbd6819",
  "source": {
    "domain": "cbsnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/06/16/875232fd-d72f-4247-9207-da34b303b662/thumbnail/620x350/9eb20b6e37b57e14c29580c9db942e25/bus-school.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T16:49:00-04:00",
  "addDate": "2025-08-14T20:57:23.550952+00:00",
  "refreshDate": "2025-08-14T20:57:23.550954+00:00",
  "score": 1.0,
  "title": "PennDOT and AAA team up to discuss back to school commute safety",
  "description": "Whether it's on the school bus, commuting to school, or even on the roads during bus pick-up, everyone has to be safe.",
  "content": "With the return to school comes reminders about safety.\n\nWhether you're riding in a school bus, maybe driving something smaller, or even walking, the message from AAA East Central and PennDOT is clear: everyone needs to be in on making the trips to and from school safe.\n\nFor drivers, that may require starting your commute a little bit earlier, so you're not rushing to your destination.\n\n\"It's crucial that you take steps so that you're not stressed out because then when you're stressed, you're more tempted to do more dangerous things behind the wheel,\" Jim Garrity of AAA East Central said.\n\nIf you have younger kids walking to school, you may want to go over safety tips before they go back.\n\n\"Do it a couple of times before school starts just so that they feel comfortable and confident,\" Yasmeen Manyisha of PennDOT District 11 said.\n\nFor teenagers who may be driving to school, it's important to root out any distractions that could take their eyes off the road.\n\n\"If that means putting the cell phone in the back seat, if that means putting the do not disturb function on your phone, do it,\" Garrity said.\n\nGarrity also said that one of the biggest distractions for teenagers is other teenagers who may provide distractions as passengers.\n\nParents should speak with teenagers even though they may not think they have to listen to safety tips. It's more than talking with them, Garrity said; parents must be good examples.\n\nBut it's also more than that – it's showing the right behaviors as well.\n\n\"If you are a distracted driver or an aggressive driver, chances are they'll end up one too,\" he said.\n\nWhen it comes to being safe on school buses, Manyisha said that parents should make sure kids aren't acting up or walking on the bus. Actions that end up distracting bus drivers can put everyone on the bus at risk.\n\nIf there's an emergency, like a crash or a bus fire, Manyisha says kids should know where the emergency exits are.\n\nFor example, every bus has one on the back door.\n\n\"There should be one on each side, there should be one on the roof,\" Manyisha said.\n\nIf you need to get out of a school bus in an emergency? Do not rush to the back and jump out the door.\n\n\"Make sure you're sitting down on the floor, and kind of scooting out of the bus,\" Manyisha said.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "school buses",
      "weight": 0.13164374
    },
    {
      "name": "bus drivers",
      "weight": 0.11291363
    },
    {
      "name": "school",
      "weight": 0.10033271
    },
    {
      "name": "Yasmeen Manyisha",
      "weight": 0.08416856
    },
    {
      "name": "AAA East Central",
      "weight": 0.08246696
    },
    {
      "name": "Manyisha",
      "weight": 0.0785487
    },
    {
      "name": "Jim Garrity",
      "weight": 0.07553358
    },
    {
      "name": "other teenagers",
      "weight": 0.07157838
    },
    {
      "name": "safety tips",
      "weight": 0.070181146
    },
    {
      "name": "drivers",
      "weight": 0.07009632
    }
  ],
  "topics": [
    {
      "name": "AAA"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.96142578125
    },
    {
      "name": "/Jobs & Education/Education/Primary & Secondary Schooling (K-12)",
      "score": 0.9111328125
    },
    {
      "name": "/Autos & Vehicles/Vehicle Codes & Driving Laws/Other",
      "score": 0.85498046875
    },
    {
      "name": "/Travel & Transportation/Transportation/Traffic & Route Planners",
      "score": 0.360595703125
    }
  ],
  "sentiment": {
    "positive": 0.07256856,
    "negative": 0.60346967,
    "neutral": 0.32396173
  },
  "summary": "The return of school comes with reminders about safety for drivers and students, whether they are driving in a school bus, a car, or a smaller vehicle, or walking. AAA East Central and PennDOT have highlighted the importance of avoiding distractions while driving, particularly for teenagers driving to school, and for drivers, starting your commute earlier and avoiding stressful situations can lead to more dangerous behavior behind the wheel. For younger students, parents should instruct them about safety tips before they return to school. For school buses, Yasmeen Manyisha of PennDot District 11 recommends that students should be aware of the emergency exits on each other's school bus.",
  "shortSummary": "The return of school holidays means safety reminders for drivers and teenagers, emphasizing importance for ensuring their safety while driving or walking to and from school.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "98b399ab54ae4d46bb1f48d858c159ca",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "As students return to school, AAA East Central and PennDOT emphasize the importance of safety during commutes. Drivers are encouraged to start their journeys earlier to avoid stress, while parents should review safety tips with younger children and discuss distractions with teenage drivers. Additionally, it's crucial for parents to model safe driving behaviors, as children often emulate their actions. For school bus safety, children should be aware of emergency exits and proper procedures in case of an emergency.",
  "argos_id": "LPC32XKUH"
}