{
  "url": "https://www.foxnews.com/us/ice-hauls-illegal-immigrants-convicted-child-crimes-nationwide-wednesday-sweep-clear-message",
  "authorsByline": "Alexandra Koch",
  "articleId": "41a17e9537fb4ee48e9a9909fda6e927",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/08/931/523/ice-arrests.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T15:41:20-04:00",
  "addDate": "2025-08-14T19:49:50.283345+00:00",
  "refreshDate": "2025-08-14T19:49:50.283347+00:00",
  "score": 1.0,
  "title": "ICE hauls in illegal immigrants convicted of child crimes in nationwide Wednesday sweep: 'clear message'",
  "description": "Federal agents detain illegal immigrants from Mexico, Ecuador and Honduras previously convicted of sexual assault and indecency with children.",
  "content": "FIRST ON FOX: Immigration and Customs Enforcement (ICE) agents on Wednesday hauled in some of the \"worst of the worst\" illegal immigrants convicted of heinous crimes against children, part of an ongoing federal effort to target violent offenders living in the U.S. unlawfully.Homeland Security Assistant Secretary Tricia McLaughlin told Fox News Digital that under President Donald Trump and DHS Secretary Kristi Noem, ICE is prioritizing arresting pedophiles, abusers and sexual predators. McLaughlin said 70 percent of ICE arrests target illegal immigrants who have criminal convictions or pending criminal charges in the U.S.ICE BUSTS SEVERAL CONVICTED CRIMINALS, INCLUDING CHILD RAPIST WHO THREATENED TO KILL 11-YEAR-OLD VICTIM\"DHS is sending a clear message to illegal aliens: if you prey on children, if you victimize the innocent, ICE will find you, arrest you, and remove you from our country,\" McLaughlin said.According to DHS, some of the illegal immigrants arrested by ICE on Wednesday include:Juan Ortiz-Mora, an illegal Mexican national, was previously convicted of two counts of indecency with a child in Tarrant County, Texas. Ronald Echeverria-Tumbaco, of Ecuador, was previously convicted of aggravated indecent assault of a child under the age of 16 in Montgomery County, Pennsylvania. ICE IN HOUSTON RELEASES NEW DETAILS ABOUT ARRESTED ILLEGAL CHILD SEX OFFENDERSLeidy Linares-Rapalo, an illegal immigrant from Honduras, has been convicted of two counts of child abuse in Hall County, Nebraska. Jheremy Julian Morales-Juarez, a Mexican national, was previously convicted of possession of obscene material depicting minors in Riverside, California. CLICK HERE TO GET THE FOX NEWS APPJuan Espino-Escamilla, an illegal immigrant from Mexico, was previously convicted of sexual assault in Reno, Nevada.",
  "medium": "Article",
  "links": [
    "https://foxnews.com/person/n/gov-kristi-noem",
    "https://www.foxnews.com/category/us/immigration/illegal-immigrants",
    "https://foxnews.com/DOWNLOAD",
    "https://www.foxnews.com/politics/ice-busts-several-convicted-criminals-child-rapist-who-threatened-kill-11-year-old",
    "https://www.foxnews.com/category/politics/executive/homeland-security",
    "https://www.foxnews.com/video/6376885562112",
    "https://www.foxnews.com/category/world/world-regions/location-mexico",
    "https://www.foxnews.com/us/ice-houston-releases-new-details-about-arrested-illegal-child-sex-offenders",
    "https://www.foxnews.com/category/us/immigration/migrant-crime"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "illegal immigrants",
      "weight": 0.12112993
    },
    {
      "name": "child crimes",
      "weight": 0.10393916
    },
    {
      "name": "CHILD RAPIST",
      "weight": 0.100732215
    },
    {
      "name": "child abuse",
      "weight": 0.10018554
    },
    {
      "name": "SEVERAL CONVICTED CRIMINALS",
      "weight": 0.09883803
    },
    {
      "name": "children",
      "weight": 0.09877096
    },
    {
      "name": "illegal aliens",
      "weight": 0.09834213
    },
    {
      "name": "ICE arrests",
      "weight": 0.08810362
    },
    {
      "name": "ICE",
      "weight": 0.08496872
    },
    {
      "name": "ARRESTED ILLEGAL CHILD SEX OFFENDERSLeidy Linares-Rapalo",
      "weight": 0.08210944
    }
  ],
  "topics": [
    {
      "name": "Social Issues"
    },
    {
      "name": "Immigration"
    },
    {
      "name": "Crime"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.8662109375
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.84228515625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.8310546875
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.69873046875
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.57861328125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.3232421875
    },
    {
      "name": "/News/Other",
      "score": 0.302490234375
    }
  ],
  "sentiment": {
    "positive": 0.046847116,
    "negative": 0.7274645,
    "neutral": 0.22568835
  },
  "summary": "Immigration and Customs Enforcement (ICE) agents arrested several illegal immigrants convicted of child crimes in a nationwide sweep. The arrests are part of an ongoing effort to target violent offenders living in the U.S. under President Donald Trump and DHS Secretary Kristi Noem. 70% of ICE arrests target illegal immigrants who have criminal convictions or pending criminal charges in the US. Some of the illegal immigrants arrested include Juan Ortiz-Mora, an illegal Mexican national, who was previously convicted of two counts of indecently with a child in Texas, and Ronald Echeverria-Tumbaco, an Ecuadorian who was convicted of aggravated indecent assault of a child under the age of 16.",
  "shortSummary": "ICE agents arrested numerous illegal immigrants for child crimes, sending a clear message to violent offenders, prioritizing violent offenders like pedophiles and sexual predators, under President Donald Trump.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "20f5124d268c407cb3ebfe97262e560c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/category/us/immigration/migrant-crime",
      "text": "Washington DC 2 hours ago Trump's federal crime operation brings 100 arrests, 800 National Guard troops to Washington Trump's federal crime task force makes 45 arrests overnight in Washington, D.C., while protests emerge against National Guard deployment and police takeover.\nDonald Trump 3 hours ago EXCLUSIVE: Trump-aligned legal group files FOIA request for DC crime data, citing alleged manipulation Pro-Trump legal group launches investigation into D.C. crime data following placement of police officer Michael Pulliam on administrative leave for alleged falsification.\nImmigration 11 hours ago GOP Senate hopeful unloads on Biden admin after whistleblower exposes who was sold IDs: 'Appalled' Former clerk exposes scheme where illegal immigrants allegedly paid $200 for driver's licenses in Louisville, Kentucky, leading to firings and an ongoing investigation.\nImmigration 19 hours ago ‘Living laboratory’: Trump admin urged to look to South America for lessons on fighting migrant gangs A former Venezuelan military officer is urging the Trump administration to look to South America for best strategies in fighting against the migrant gangs that flooded the U.S. under Biden.\nDonald Trump 1 day ago US appeals court says Trump can slash billions in owed USAID funds The decision is a victory for President Donald Trump, who moved to dismantle USAID and other foreign spending almost immediately after he was sworn in to his second White House term.\nImmigration 2 days ago ICE Houston arrests more than 350 gang members -- and it's not just MS-13 In Trump’s first six months back in office, ICE Houston has arrested more than 350 illegal migrants tied to over 40 gangs — including violent street crews like MS-13 and Tren de Aragua.\nImmigration 2 days ago DHS Secretary Noem says Rachel Morin's killer 'should have never been in our country' Victor Martinez-Hernandez was sentenced to life without parole for brutal murder and rape of Rachel Morin, 37-year-old Maryland mother of five children in 2023.\nMigrant Crime 3 days ago Rachel Morin's family slams illegal immigrant killer at sentencing: 'He can't hurt anyone else' Convicted killer Victor Martinez-Hernandez sentenced to consecutive life terms for strangling Rachel Morin, 37-year-old mother, on Maryland trail in 2022.\nSanctuary Cities August 7 $30K in migrant housing aid has Dem gov on hot seat for 'revolving door' policy As Gov. Maura Healey, D-Mass., closes down her state's migrant shelters, she is facing criticism for simultaneously making migrants eligible for tens of thousands in housing aid.\nHomeland Security August 7 Noem says ICE agents are facing '1000% increase in assaults' DHS Secretary Kristi Noem reported that ICE agents are facing a 1000% increase in assaults as they \"risk their lives to arrest the worst of the worst.\"\nCrime August 7 Border crisis shifts to Caribbean: Homeland Security fights silent war in Puerto Rico Homeland Security Investigations in Puerto Rico reports significant reduction in smuggling load, higher fentanyl presence following enhanced enforcement and new funding under Trump.\nMigrant Crime August 6 Trump administration arrests 'worst of the worst' criminal illegal immigrants in enforcement sweep The Trump administration targeted criminal illegal immigrants for deportation as DHS arrests individuals with convictions across multiple states.\nMigrant Crime August 6 Two illegal immigrant suspects indicted on attempted murder charges in CBP officer shooting case in NYC Manhattan DA announces additional charges against two suspects with illegal immigration status who shot off-duty border patrol officer during armed robbery.\nImmigration August 6 ICE raid tipoffs from Dem lawmaker could mean charges, says DHS rep: 'Looks like obstruction' A Democratic state lawmaker tipping off ICE operations in her community could be hit with obstruction-of-justice charges, a spokesperson for the Department of Homeland Security said.\nBorder security August 5 6 criminal aliens nabbed in Houston ICE raids boast startling number of convictions A group of six criminal illegal aliens have been arrested by ICE in Houston after having collectively illegally entered the country a staggering 42 times.\nMigrant Crime August 5 Venezuelan suspect 'should never have been in the United States,' police chief says after deadly shooting Suspect in Aurora domestic violence shooting captured Monday morning after weekend incident that killed one woman while five children were present in apartment\nDonald Trump August 5 US crime dropped widely in 2024, FBI says — with some notable caveats U.S. crime rates declined significantly across major categories in 2024 according to FBI data, with property crime down 8% and motor vehicle theft dropping 18% from 2023.\nIllegal Immigrants August 1 ICE lodges detainer against illegal migrant charged with kidnapping, sexually assaulting neighbor in Texas ICE has placed a detainer on Jose Maldonado-Zavala, a 60-year-old from Honduras, after he allegedly kidnapped and sexually assaulted his neighbor in Texas.\nMigrant Crime July 31 DHS scoops up trans illegal alien charged with heinous crime on child in sanctuary city: 'Worst of the worst' A transgender illegal alien from Colombia, Nicol Alexandra Contreras-Suarez, is being charged with child rape in the sanctuary city of New York, according to the DHS.\nImmigration July 30 ICE busts several convicted criminals, including child rapist who threatened to kill 11-year-old victim Seven foreign nationals with serious criminal records, including child sex crimes and assault, were arrested by ICE as part of deportation enforcement efforts.\nImmigration July 30 Former ICE chief torches 'unconscionable' Biden-era policies as Trump's DHS finds migrant children Former ICE director explains how Trump administration efforts to locate missing migrant children could expand with new funding for additional ICE agents\nMigrant Crime July 30 Kentucky teen dies protecting mother from illegal immigrant's violent alleged assault in family apartment Illegal immigrant charged with murder after shooting 15-year-old Kentucky boy who intervened during attempted rape of his mother in July incident.\nSanctuary Cities July 30 Newsom office dismisses crime fears, defends sanctuary policies amid surge in violence: 'Fake news' Gov. Gavin Newsom is denying experts' claims that sanctuary policies sheltering lawbreakers are directly responsible for a rising crime and violence in Democratic-run jurisdictions.\nMigrant Crime July 29 Illegal who conspired to bludgeon teen to death with baseball bat among latest ICE roundups An illegal alien convicted of a conspiracy to murder a teen using a baseball bat is among some of the “worst of the worst\" criminal illegals arrested by ICE recently, the agency says.\nHouston and Galveston July 29 ICE in Houston releases new details about arrested illegal child sex offenders ICE reports 214 illegal immigrants with child sex offense charges arrested, including multiple offenders who entered the country illegally multiple times.\nIllegal Immigrants July 28 Noem exposes the 'monsters' Democrat senator is fighting to protect in immigration battle Maryland delegation stages sit-in after being denied access to Baltimore ICE facility, as Secretary Noem accuses Senator Van Hollen of protecting criminal immigrants.\nMigrant Crime July 28 Illegal immigrant caught working as police officer in Maine while attempting to buy firearm Federal authorities apprehended an illegal Jamaican national employed by Old Orchard Beach Police, raising concerns about hiring practices in law enforcement.\nImmigration July 28 ICE sit-in 'photo op' by Maryland Dems blasted by DHS chief Noem The DHS is bashing Sen. Chris Van Hollen, D-Md., and other Democrats for attempting to “squeeze\" out headlines by demanding to enter and staging a sit-in at an ICE facility in Baltimore.\nSanctuary Cities July 28 Dems' sanctuary policies shield 'gangbangers,' harm Latino families, businesses, says Hispanic GOP lawmaker Hispanics living in Democratic-run jurisdictions are frustrated with sanctuary policies allowing criminal illegal aliens to prey on their communities, says a Latino GOP lawmaker.\nDonald Trump July 28 'Dangerous and illegal': Democrat AGs sue Trump over effort to use SNAP to locate migrants The Trump administration's demand that states turn over personal SNAP recipient data prompted a lawsuit from Democrat, who say it's a front to track down and deport illegal immigrants."
    },
    {
      "url": "https://www.foxnews.com/category/world/world-regions/location-mexico",
      "text": "Mexican Cartel Violence 2 hours ago DOJ charges five alleged Mexican cartel leaders, touts ‘extraordinary policework’ that led to indictments DOJ announces criminal charges against five United Cartels leaders with $26 million rewards offered for arrests in international drug trafficking case.\nOpinion 5 days ago Trump sends military after the cartels and it’s long overdue U.S. military deployment targets Mexican cartels as DHS reports reveal corrupt military and law enforcement crossing border to assist drug trafficking organizations\nCrime August 7 Border crisis shifts to Caribbean: Homeland Security fights silent war in Puerto Rico Homeland Security Investigations in Puerto Rico reports significant reduction in smuggling load, higher fentanyl presence following enhanced enforcement and new funding under Trump.\nDemocratic Party August 4 House Dem declares she is a 'proud Guatemalan' before American at Progressive International conference Rep. Delia Ramirez declared she's prouder to be Guatemalan than American at leftist Panamerican Congress attended by progressive lawmakers.\nWhite House August 2 Trump closes week with plans to reposition subs amid heightened Russia tension, new tariffs Trump orders nuclear submarines repositioned after Russian tensions escalate, while implementing new tariffs on Canada and other countries this week.\nTravel August 1 Americans in vacation hot spot may see more military than margaritas this summer Mexico deploys over 7,000 security personnel including National Guard and military to protect tourists in Cancun and Riviera Maya amid rising cartel violence concerns.\nRepublicans July 30 Border county Republicans say Trump policies improve security while Democrats cite 'cruelty' Southern Arizona community officials note reduced illegal crossings under President Trump, but also ongoing drug smuggling issues and effects of previous policies.\nSouth America July 29 US accuses Venezuelan regime of narco-terrorism over alliances with Tren de Aragua, Sinaloa Cartel The U.S. Department of the Treasury has sanctioned the Cartel de los Soles as a global terrorist group for allegedly supporting violent organizations like Tren de Aragua and the Sinaloa Cartel.\nUS Environment July 25 US-Mexico Tijuana River sewage crisis deal is ‘massive’ win for Americans, EPA says EPA Administrator Lee Zeldin announces US-Mexico deal to resolve the Tijuana River sewage crisis, calling it a massive environmental win for San Diego-area residents.\nAirlines July 23 Delta plane aborts takeoff in Mexico City after plane nearly lands on top of aircraft A Delta Boeing jet bound for Atlanta safely stopped takeoff when pilots observed another aircraft landing in front of them on the same runway in Mexico City.\nCulture Trends July 19 Border Patrol morale goes through the roof, 'dramatically' changed under Trump administration Border Patrol agents in Tucson revealed to Fox News Digital how their frontline duties have been affected while defending the border under the Trump administration.\nSoft Drinks July 18 Why Mexican Coke is a fan favorite and where to buy it after Trump's sweet announcement Mexican Coca-Cola’s cult following is due to the beverage's cane sugar recipe, which fans say delivers a “completely different\" taste, though experts warn it’s not much healthier\nTravel July 18 Officials at popular tourist spot cave to protesters who called out Americans Mexico City officials announce plans to address gentrification after locals protest mass tourism, with demonstrators targeting American visitors amid a 70% increase in U.S. residents.\nImmigration July 18 Feds' California Home Depot raid nabs 11 illegal migrants, one with 67 prior jail bookings Border Patrol in Sacramento arrested 11 illegal migrants during a raid at a Home Depot parking lot — including one man with 67 prior bookings in California since 1986.\nOpinion July 18 PAM BONDI & ROBERT MURPHY: Team Trump is fighting deadly drug cartels to save American lives Under Trump, federal agencies seized over 44 million fentanyl pills and 68,000 pounds of meth while designating cartels as Foreign Terrorist Organizations\nUS July 14 Chinese illegal immigrant crossings that surged during Biden admin a 'national security concern,' expert warns A border security expert said the large number of Chinese illegal immigrants who crossed the southern border during the Biden administration poses a national security risk.\nBoxing July 8 Boxing legend Julio César Chávez defends son after arrest by US immigration officials Boxing legend Julio César Chávez defended his son in an interview with Mexican media after he was arrested in the U.S. and faces deportation.\nTravel July 8 Americans targeted in Mexico City as locals protest against tourism and soaring rents Anti-tourism protests erupted in Mexico City as locals face gentrification challenges similar to Barcelona and Venice demanding stricter housing laws and legislation to regulate tourism levels.\nCrime July 6 American with 'CIA' credentials and variety of weapons arrested in Mexico Mexican authorities arrested an American with alleged CIA credentials and six firearms, magazines, ammunition and tactical equipment for disturbing the peace.\nBoxing July 4 Mexico President expects boxer Julio César Chávez Jr. to be deported, hopes he serves sentence in home country Mexican President Sheinbaum confirms hope for former boxing champion Julio Cesar Chávez Jr. to serve weapons trafficking sentence in Mexico\nBoxing July 3 Mexican boxer Julio Cesar Chavez Jr arrested by ICE days after fighting Jake Paul Julio Cesar Chavez Jr., who fought Jake Paul just four days ago, was arrested by ICE as the Department of Homeland Security announced his \"expedited removal\" from the U.S.\nImmigration July 2 Federal judge orders Mexican migrant seeking asylum to be released by ICE A federal judge in Oregon has ordered the release of Mexican migrant who had been held in an ICE detention facility for nearly a month after agents arrested him moments after a routine asylum hearing.\nBorder wall July 2 Mexican border town sees fewer crossing attempts, deportations than expected under Trump Local business owners in Nogales, Mexico, discuss Trump's impact on border security, revealing fewer crossing attempts and unexpected calm despite deportation preparations.\nMexico July 1 Twenty dead bodies discovered in Mexico, including corpses hanging from bridge Four decapitated bodies were found hanging from a bridge and 16 additional corpses were discovered in a van amid ongoing cartel violence in the capital of Mexico's Sinaloa state.\nNew Jersey June 29 New Jersey lawmaker proposes legislation renaming Delaware Bay to 'The Bay of New Jersey' A New Jersey Republican has proposed renaming the Delaware Bay as \"The Bay of New Jersey\" a few months after Trump's Gulf of America executive order.\nMexican Cartel Violence June 27 Sinaloa cartel hacker turned Mexico City cameras against FBI, leading to killings, DOJ says Justice Department reveals cartel hacker compromised FBI attaché's phone data and used city surveillance to eliminate witnesses, the DOJ said.\nUS June 27 Human smugglers sentenced in horrific Texas truck deaths of 53 migrants Two human smugglers who were convicted of causing the deaths of 53 migrants whom they were trying to sneak into the U.S. in a sweltering hot tractor trailer were sentenced today.\nBorder wall June 21 Mexican mayor applauds Trump’s 'cleaning house' deportation plan The mayor of the border city of Nogales in Sonora, Mexico, Juan Francisco Gim Nogales, discusses the reality of how Trump's deportation plans have affected his community.\nMexico June 19 Border Patrol agents shut down massive drug smuggling tunnel between Tijuana and San Diego Border Patrol agents uncovered a sophisticated narcotics smuggling tunnel connecting Tijuana and San Diego, featuring electrical and ventilation systems.\nDonald Trump June 14 Mexican Senate president says LA is essentially Mexico: I'd ‘pay for the wall’ if it ceded US southwest Mexican Senate President Gerardo Fernández Noroña displayed a 1830s map showing California and Texas as Mexican territory during the LA immigration debate."
    },
    {
      "url": "https://www.foxnews.com/politics/ice-busts-several-convicted-criminals-child-rapist-who-threatened-kill-11-year-old",
      "text": "FIRST ON FOX: Multiple convicted criminals in the country illegally were arrested by Immigration and Customs Enforcement Tuesday, including some convicted of sex crimes against children.\nSierra Leone national Mohammed Sesay was convicted a decade ago in Maryland of raping an 11-year-old girl multiple times within five months in 2014 and threatening to kill her if she spoke up about the abuse.\nAccording to the Department of Homeland Security, Sesay’s actions were only revealed after an \"assault\" during a family function when the father of the victim learned of the incident.\n‘WORST OF THE WORST’ SNARED: ICE NABS ILLEGAL IMMIGRANTS CONVICTED OF HORRIFIC CRIMES\n\"What these innocent children had to endure is horrifying: a criminal illegal alien raping an 11-year-old child 15 different times; a pedophile; innocent children who were struck and injured by an illegal alien driving drunk, sending one child to intensive care. These criminals should have never been in this country in the first place, and these children should have never been victimized,\" DHS Assistant Secretary Tricia McLaughlin said in a statement.\n\"Under President Trump and Secretary Noem, this department is putting the safety of Americans first. Thanks to ICE, these monsters are in custody and will be removed from our communities.\"\nGuatemalan national Pablo Tahay-Par was convicted of unlawfully contacting a minor as a sexual offense in Pennsylvania.\nDHS ARRESTS FIVE ILLEGAL IMMIGRANTS CONVICTED OF SERIOUS CRIMES, INCLUDING MURDER AND CHILD ABUSE\nSalvadoran national Alex Ventura was convicted of drunk driving, which resulted in six children being hurt, according to KPRC. The outlet reported that the 2022 crash resulted in a fractured skull to one of the children.\nCLICK HERE FOR MORE IMMIGRATION COVERAGE\nVenezuelan national Jose David Contreras-Sierra also has a long rap sheet in Rockville, Maryland, including \"armed robbery, handgun use during a felony, first-degree assault and drug distribution,\" according to DHS.\nIn addition, Dominican national Deibe Ramos-Rodriguez was convicted on alien smuggling charges in Texas. Daniel Gutierrez-Leiva of Guatemala was arrested by ICE Baltimore and has a second-degree rape conviction in the Old Line State.\nCLICK HERE TO GET THE FOX NEWS APP\nAccording to the ICE website, Wilbert Rudlof Wiebe-Thiessen was also arrested by ICE Dallas Tuesday. The Mexican citizen, 34, has been charged with \"assaulting a family or household member by impeding their breath or circulation and terroristic threats causing fear of imminent serious bodily injury in Texas.\"\nThe announcements come as the agency regularly updates its \"Worst of the Worst\" arrests as it tries to ramp up deportations and hire more ICE agents, including with a new ad campaign and bonuses meant to entice people to join. The recent Trump-backed One Big Beautiful Bill Act includes funding for 10,000 more agents. Besides the arrest highlights, ICE also maintains an active \"Most Wanted\" list."
    },
    {
      "url": "https://www.foxnews.com/us/ice-houston-releases-new-details-about-arrested-illegal-child-sex-offenders",
      "text": "More information has been released regarding illegal immigrant child sex offenders arrested by U.S. Immigration and Customs Enforcement (ICE) in the Houston area in the last six months. The Houston ICE Field Office has arrested 214 illegal migrants charged or convicted of a sex offense involving a minor so far under the Trump Administration.\nThat is more than the Houston Field Office arrested during the entire 2024 fiscal year when they arrested 211 illegal immigrants charged or convicted of a child sex offense, according to the Department of Homeland Security (DHS).\nOf the 214 criminal illegal immigrants arrested, 179 had final orders of removal from an immigration judge. 141 have already been removed.\n\"Thanks to ICE Houston, 214 less pedophiles on our streets. These are the type of perverted predators ICE is targeting and removing from our country,\" DHS Assistant Secretary Tricia McLaughlin said. \"President Trump and Secretary Noem will not allow these sickos to prey on children in the U.S. Our message to these depraved criminals is clear: LEAVE NOW. If you don’t, we will hunt you down and deport you.\"\nSome of the criminal illegal immigrants charged or convicted of a child sex offense arrested by the ICE ERO Houston Field Office in the past six months include:\nGabriel Julio Velazquez Lopez, 25, criminal illegal immigrant from Mexico, convicted of sexual assault of a child and assault with intent to rape. He illegally entered the U.S. four times since 2016. ICE arrested him on April 8th, and he was deported on April 10, 2025.\n‘WORST OF THE WORST’ SNARED: ICE NABS ILLEGAL IMMIGRANTS CONVICTED OF HORRIFIC CRIMES\nRoberto Antonio Caballero-Garcia, a 31-year-old criminal illegal immigrant from El Salvador, was arrested for three counts of sexual assault of a child in Dallas County. He was convicted in 2017 and given 10 years deferred adjudication. ICE deported him on May 5, 2025.\nICE ARRESTS OVER 200 ILLEGAL ALIEN CHILD SEX OFFENDERS IN HOUSTON AREA IN PAST 6 MONTHS\nCarlos Alfredo Lopez Espinal, a 45-year-old criminal illegal immigrant from El Salvador, was convicted of sexual indecency with a minor in March 2025. He was arrested by ICE on July 18, 2025.\nMeliton Gonzalez, a 76-year-old criminal illegal immigrant from Mexico, was convicted of child sexual assault in 2015 and sentenced to 10 years. Gonzalez has been illegally in the country since 1976. He was deported by ICE on June 12th, after serving time in Texas.\nCLICK HERE TO GET THE FOX NEWS APP\nMario Ramirez Martinez, a 71-year-old criminal illegal immigrant from Mexico, was convicted of two counts of sexual assault of a child in Hidalgo County, Texas. He served 10 years in prison; arrested by ICE and deported June 2, 2025."
    },
    {
      "url": "https://www.foxnews.com/category/us/immigration/illegal-immigrants",
      "text": "Crime 1 hour ago ICE hauls in illegal immigrants convicted of child crimes in nationwide Wednesday sweep: 'clear message' Federal agents detain illegal immigrants from Mexico, Ecuador and Honduras previously convicted of sexual assault and indecency with children.\nWashington DC 1 hour ago Trump's federal crime operation brings 100 arrests, 800 National Guard troops to Washington Trump's federal crime task force makes 45 arrests overnight in Washington, D.C., while protests emerge against National Guard deployment and police takeover.\nVIDEO 2 hours ago Actor Dean Cain to be sworn in as ICE agent next week 'Superman' actor Dean Cain joins the ‘Brian Kilmeade Show’ to explain his decision to become an ICE officer and address pushback over his choice.\nVIDEO 10 hours ago Pritzker under fire after illegal immigrant reportedly kills ex-WNBA star's mom in head-on collision Illinois state Sen. Andrew Chesney (R) joins 'Fox & Friends First' to discuss why Gov. JB Pritzker's policies are to blame after the deadly collision and what laws need to change.\nImmigration 14 hours ago ICE says illegal migrant threatened to harm himself with butcher knife when stopped by officers in DC ICE said an illegal migrant was detained in Washington, D.C., after he was stopped by agents and subsequently motioned that he would harm himself with a butcher knife.\nVIDEO 1 day ago Portsmouth Police Department shares video of ICE arrest The Portsmouth Police Department released a video allegedly showing ICE's arrest of Josue Perez Gomez in Rhode Island.\nImmigration 1 day ago Last migrant hotel in New York City set to close as 'emergency shelter' program sunsets The Row hotel in Times Square will end migrant housing operations as the Trump administration border policies reduce migrant arrivals to New York City.\nMedia 1 day ago Kentucky whistleblower claims licensing center sold IDs to illegal immigrants 'under the table' Former Kentucky Transportation Cabinet clerk Melissa Moorman claimed in a lawsuit that she was fired after reporting on her co-workers’ illegal activity.\nDonald Trump 1 day ago Rural town to turn closed prison into ICE detention facility despite resident pushback The small town of Mason, Tenn., has voted to turn a former prison into an ICE detention center, which will be run by CoreCivic.\nPhoenix Mercury 1 day ago Ex-WNBA player's mom dies in car crash involving illegal immigrant, officials say The mother of former WNBA player Sophie Brunner was killed when an illegal immigrant crashed head-on into her car in Illinois, a lawmaker said.\nImmigration 1 day ago ICE Ordered to Fix 'Horrifying' Conditions at NYC Facility After Migrant Complaints Federal judge orders ICE to immediately improve conditions at 26 Federal Plaza immigration facility in NYC, requiring reduced capacity and better hygiene products.\nVIDEO 2 days ago ICE official describes the 'BAD ACTORS' the agency is 'going after' Acting I.C.E. director Todd Lyons weighs in on the agency reportedly setting a new detention record this week and addresses whether Rhode Island police 'cooperated' with the arrest of an alleged sex offender on 'America Reports.'\nImmigration 2 days ago ICE Houston arrests more than 350 gang members -- and it's not just MS-13 In Trump’s first six months back in office, ICE Houston has arrested more than 350 illegal migrants tied to over 40 gangs — including violent street crews like MS-13 and Tren de Aragua.\nMigrant Crime 3 days ago Rachel Morin's family slams illegal immigrant killer at sentencing: 'He can't hurt anyone else' Convicted killer Victor Martinez-Hernandez sentenced to consecutive life terms for strangling Rachel Morin, 37-year-old mother, on Maryland trail in 2022.\nVIDEO 3 days ago DHS official argues Rhode Island is 'putting their own people in danger' DHS Public Affairs assistant secretary Tricia McLaughlin claims Rhode Island 'refused' to honor a detainer for an illegal migrant on 'America Reports.'\nVIDEO 3 days ago Mexico responds to Trump's alleged approval of military force against cartels: No 'invasion' 'Outnumbered' reacts to President Donald Trump's decision to involve the U.S. military in the fight against drug cartels.\nIllegal Immigrants 3 days ago Illinois Democrats tell feds to stop trying to 'usurp' state authority over immigration Illinois Democrats tell DOJ and DHS that state sanctuary laws, including TRUST Act and Chicago Welcoming City Ordinance, follow constitutional requirements.\nFox News Flash 3 days ago Rachel Morin's mother explains painstaking process of writing statement to read at killer's sentencing Victor Antonio Martinez Hernandez, an illegal immigrant convicted of rape and murder, faces sentencing as his victim's mother prepares emotional impact statement.\nVIDEO 3 days ago Acting ICE director explains the necessity of agents to assist with arresting illegal criminals Acting I.C.E. director Todd Lyons discusses the recent arrest of a criminal illegal immigrant in Rhode Island, the work behind the 'Speedway Slammer,' the attempts to recruit new agents, and more on the 'Big Weekend Show.'\nImmigration 4 days ago Trump border wall materials sold by Biden may soon find their way back to the feds, auctioneer claims Border wall materials once sold for pennies on the dollar will be returned to government at-cost through deal between GovPlanet and Trump's border czar office.\nImmigration 4 days ago ICE arrests illegal immigrant charged with child sex crimes after his release by local police despite detainer ICE arrested an illegal immigrant from Guatemala after Rhode Island police released him despite child sex crime charges and an active immigration detainer.\nVIDEO 5 days ago Florida AG vows to ‘fight back’ against ‘judicial activism’ after judge pauses ‘Alligator Alcatraz’ construction Florida Attorney General James Uthmeier discusses the federal judge who temporarily paused ‘Alligator Alcatraz’ construction over environmental concerns on ‘Fox Report.’\nVIDEO 5 days ago Trump admin builds new migrant detention centers Former Acting ICE Director Jonathan Fahey joins ‘Fox News Live’ to discuss the Trump administration’s intensifying crackdown on illegal immigration and the decision to change the age limits for immigration officers.\nIllegal Immigrants 5 days ago DHS video honors young woman killed in hit-and-run allegedly caused by illegal immigrant Katie Abraham and her friend, Chloe Polzin, were killed in a hit-and-run allegedly caused by an illegal immigrant from Guatemala who is suspected of driving under the influence.\nVIDEO 5 days ago DHS releases video honoring young woman killed in hit-and-run with an illegal migrant.mp4 In January, Katie Abraham and her friend, Chloe Polzin, were killed in a drunk driving hit-and-run caused by an illegal migrant. (Credit: DHS)\nTexas 5 days ago Owner of Trump-themed burger chain faces deportation after feds allege illegal status, 'sham' marriages Lebanese restaurateur Roland Beainy, the co-owner of a Trump-branded burger chain in Texas, is facing deportation for visa violations, according to ICE.\nVIDEO 5 days ago Sanctuary city leaders defy ICE detainers, face backlash from DHS DHS Assistant Secretary Tricia McLaughlin joins ‘Fox & Friends’ to discuss how sanctuary city leaders are refusing to honor ICE detainers.\nOpinion 5 days ago Trump sends military after the cartels and it’s long overdue U.S. military deployment targets Mexican cartels as DHS reports reveal corrupt military and law enforcement crossing border to assist drug trafficking organizations\nBill Maher 5 days ago Bill Maher confronts Dr. Phil on joining Trump admin's ‘unpopular’ ICE raids Bill Maher confronted Dr. Phil on \"Real Time\" about his participation in ICE raids and debated the effects of their operations.\nVIDEO 5 days ago Army veteran: Nobody is more thrilled than me to see Special Forces 'stacking cartel members like cardboard' Former U.S. Army Special Forces Jim Hanson commends the Trump administration's 'tremendous step' against drug cartels on 'Jesse Watters Primetime.'"
    },
    {
      "url": "https://www.foxnews.com/category/politics/executive/homeland-security",
      "text": "Immigration 1 hour ago DC police announce major action on immigration enforcement after Trump's crime crackdown DC police chief authorizes sharing information with immigration agencies during traffic stops but prohibits arrests based solely on federal immigration warrants.\nMedia 3 hours ago Schumer feels 'perfectly safe’ in DC, says Republicans are ‘full of it' on crime concerns Senate Minority Leader Chuck Schumer claimed Republicans were \"full of it\" regarding D.C. safety fears as President Trump deploys National Guard troops and takes control of police.\nWashington DC 9 hours ago Police in DC get yelled at while setting up checkpoint along popular nightlife corridor Protesters confronted police officers at a checkpoint on 14th Street Northwest in Washington D.C., yelling 'get off our streets' following Trump's federal takeover.\nImmigration 14 hours ago ICE says illegal migrant threatened to harm himself with butcher knife when stopped by officers in DC ICE said an illegal migrant was detained in Washington, D.C., after he was stopped by agents and subsequently motioned that he would harm himself with a butcher knife.\nImmigration 19 hours ago ‘Living laboratory’: Trump admin urged to look to South America for lessons on fighting migrant gangs A former Venezuelan military officer is urging the Trump administration to look to South America for best strategies in fighting against the migrant gangs that flooded the U.S. under Biden.\nImmigration 1 day ago 'Barbaric criminals': ICE removes slew of Southeast Asian nationals convicted of serious crimes The Trump administration deported 12 Laotian illegal immigrants convicted of serious crimes, as DHS continues removing criminal aliens from American streets.\nImmigration 1 day ago ICE Ordered to Fix 'Horrifying' Conditions at NYC Facility After Migrant Complaints Federal judge orders ICE to immediately improve conditions at 26 Federal Plaza immigration facility in NYC, requiring reduced capacity and better hygiene products.\nImmigration 2 days ago ICE Houston arrests more than 350 gang members -- and it's not just MS-13 In Trump’s first six months back in office, ICE Houston has arrested more than 350 illegal migrants tied to over 40 gangs — including violent street crews like MS-13 and Tren de Aragua.\nImmigration 2 days ago DHS Secretary Noem says Rachel Morin's killer 'should have never been in our country' Victor Martinez-Hernandez was sentenced to life without parole for brutal murder and rape of Rachel Morin, 37-year-old Maryland mother of five children in 2023.\nVIDEO 3 days ago DHS official argues Rhode Island is 'putting their own people in danger' DHS Public Affairs assistant secretary Tricia McLaughlin claims Rhode Island 'refused' to honor a detainer for an illegal migrant on 'America Reports.'\nVIDEO 5 days ago DHS releases video honoring young woman killed in hit-and-run with an illegal migrant.mp4 In January, Katie Abraham and her friend, Chloe Polzin, were killed in a drunk driving hit-and-run caused by an illegal migrant. (Credit: DHS)\nTexas 5 days ago Owner of Trump-themed burger chain faces deportation after feds allege illegal status, 'sham' marriages Lebanese restaurateur Roland Beainy, the co-owner of a Trump-branded burger chain in Texas, is facing deportation for visa violations, according to ICE.\nIllegal Immigrants 6 days ago List of countries taking in illegal immigrant deportees grows with latest African partners President Donald Trump's mass deportation strategy expands with Rwanda accepting 250 deportees while other countries, like Eswatini and South Sudan, also receive immigrants.\nHomeland Security 6 days ago Cuban-born congressman calls for 'Squad' member’s removal over ‘Guatemalan before American’ remark Cuban-born congressman files resolution against Rep. Delia Ramirez for Homeland Security Committee removal following her controversial remarks about Guatemalan identity in Mexico.\nVIDEO 6 days ago Trump administration demands Colorado turn over alleged Tren de Aragua killer 'Outnumbered' discusses Colorado's illegal immigration problem after a Tren de Aragua gang member allegedly shot multiple victims during a domestic dispute.\nHomeland Security 6 days ago Noem, in Illinois, calls out Gov. Pritzker, Chicago's mayor over their handling of criminal illegal immigrants Homeland Security Secretary Kristi Noem said Illinois Gov. JB Pritzker and Chicago Mayor Brandon Johnson are \"being obstructionist\" when it comes removing criminals.\nOpinion 6 days ago Russia, China are trying to seize control of the Arctic. We can't let them succeed Trump's Big Beautiful Bill, now law, provides $8.6 billion for new Coast Guard icebreakers to counter Russian and Chinese Arctic expansion and protect American interests.\nIndyCar Racing 6 days ago Mexican IndyCar driver 'caught off guard' by ICE's 'Speedway Slammer' post on social media Pato O'Ward, a Mexican-born IndyCar driver, was \"caught off guard\" by the Department of Homeland Security's post depicting an ICE-sponsored racecar.\nHomeland Security 6 days ago Trump, GOP fight antisemitic violence amid latest FBI probe — in sharp contrast to Biden's silence House Homeland Security Committee warns of rising antisemitic violence after FBI launches probe into targeted attack on former Israeli soldier in Missouri.\nImmigration August 7 ICE detainee found 'hanging by the neck' at Pennsylvania detention center ICE detainee Chaofeng Ge, 32, was pronounced dead at a Pennsylvania detention center after being discovered hanging in a shower room, officials said.\nHomeland Security August 7 Noem says ICE agents are facing '1000% increase in assaults' DHS Secretary Kristi Noem reported that ICE agents are facing a 1000% increase in assaults as they \"risk their lives to arrest the worst of the worst.\"\nHomeland Security August 7 16 in custody after immigration raid at LA Home Depot, DHS says An immigration raid at an LA Home Depot led to 16 detentions as federal officials targeted the MacArthur Park area where there's been reported MS-13 gang activity.\nCrime August 7 Border crisis shifts to Caribbean: Homeland Security fights silent war in Puerto Rico Homeland Security Investigations in Puerto Rico reports significant reduction in smuggling load, higher fentanyl presence following enhanced enforcement and new funding under Trump.\nVIDEO August 6 Dean Cain 'proud' to be among the 'patriots' who stepped up to join ICE Actor Dean Cain sheds light on joining I.C.E. and why he got involved in law enforcement on 'Fox News @ Night.'\nVIDEO August 6 Dean Cain tells Jesse Watters he'll be sworn in as an ICE agent ASAP Brand new I.C.E agent Dean Cain discusses the recruitment of I.C.E. agents and his joining of the ranks on 'Jesse Watters Primetime.'\nImmigration August 6 ICE raid tipoffs from Dem lawmaker could mean charges, says DHS rep: 'Looks like obstruction' A Democratic state lawmaker tipping off ICE operations in her community could be hit with obstruction-of-justice charges, a spokesperson for the Department of Homeland Security said.\nImmigration August 5 'Speedway Slammer' is red state's answer to 'Alligator Alcatraz' detention facility Governor Braun partners with Trump administration to create 1,000-bed immigration detention center at Miami Correctional Center funded by federal reconciliation bill.\nImmigration August 3 Colorado deputy could face massive fine for sharing information with immigration authorities A Colorado deputy faces a $50,000 fine in a lawsuit for allegedly sharing immigration information with federal agents in violation of a recent state law.\nImmigration August 2 What are ICE’s visiting policies, and why are Democrats suing over them? Following Democratic lawmakers filing a lawsuit over being denied access to a Maryland ICE facility, DHS is clarifying its simple procedures for members of Congress requesting to visit its facilities.\nHomeland Security August 1 Illegal immigrant facing attempted murder charges for stabbing victim multiple times at soccer game ICE lodges immigration detainer against 20-year-old from Honduras who faces attempted murder charges for stabbing attack during public soccer game in Baldwin County."
    }
  ],
  "argos_summary": "ICE agents recently arrested multiple illegal immigrants convicted of serious crimes, including sexual offenses against children, as part of a federal initiative to target violent offenders. Homeland Security Assistant Secretary Tricia McLaughlin emphasized that the agency is prioritizing the removal of individuals who prey on children, with a significant percentage of arrests focusing on those with criminal convictions. The recent operations have resulted in the detention of numerous individuals from various countries, including Mexico, Ecuador, and Honduras, all with histories of heinous crimes.",
  "argos_id": "LUJ8ZLAFB"
}