{
  "url": "https://www.mercurynews.com/2025/08/14/galaxycon-renner-shatner-rocky-horror-picture-show-san-jose/",
  "authorsByline": "Sal Pizarro",
  "articleId": "d17aa495cdcc4503800d988ce5962712",
  "source": {
    "domain": "mercurynews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "San Jose",
      "coordinates": {
        "lat": 37.3361905,
        "lon": -121.890583
      }
    }
  },
  "imageUrl": "https://www.mercurynews.com/wp-content/uploads/2024/08/SJM-L-GALAXYCLO-0819-3.jpg?w=1024&h=700",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T20:49:03+00:00",
  "addDate": "2025-08-14T20:54:12.831321+00:00",
  "refreshDate": "2025-08-14T20:55:38.937473+00:00",
  "score": 1.0,
  "title": "GalaxyCon bringing superhero, sci-fi and horror icons to San Jose",
  "description": "Guests at this weekend’s “festival of fandom” include Jeremy Renner, William Shatner and Barry Bostwick from “The Rocky Horror Picture Show.”",
  "content": "An Avenger, Capt. Kirk and Ivan Drago will be in downtown San Jose this weekend as GalaxyCon returns for its second year.\n\nThe “festival of fandom”, which opens Friday afternoon and runs through Sunday at the San Jose McEnery Convention Center, is expected to draw more than 30,000 people over the weekend — including many cosplayers whose elaborate outfits will make for great people-watching.\n\nBut the real draws are the celebs, who encompass a wide range of pop culture including movies and TV, comics, gaming, pro wrestling, voice acting and podcasts.\n\nThe big names scheduled to attend include Jeremy Renner (Hawkeye from Marvel’s Avengers movies), cult-movie fan favorite Danny Trejo, Dolph Lundgren from “Rocky IV,” and William Shatner, who is the closest thing to a Patron Saint of Pop Culture that we have in Silicon Valley.\n\nThere are also some great treats for horror movie fans, with cast members from “Terrifier” (Elliott Fullam and Laura Lavera) and the 1998 “Scream” (Matthew Lilliard, Skeet Ulrich, Jamie Kennedy and original Ghostface Lee Waddell) taking part in Q&A panels.\n\nBarry Bostwick, who played Brad in 1975’s “The Rocky Horror Picture Show,” also will have a special meet-and-greet event Saturday night before the 10 p.m. showing of the cult classic film, which is celebrating its 50th anniversary this year. This will be similar to one of the regular “midnight” shows at theaters (including San Jose’s 3Below): a “shadowcast” performance with the Barely Legal live cast. Could Bostwick be persuaded to take part in the Time Warp? We can only hope.\n\nBeyond those events, there are countless photo opportunities, panel discussions, late-night events and costume contests available to conventiongoers (some involve an extra charge). You can get the full schedule and tickets at www.galaxycon.com/sanjose.",
  "medium": "Article",
  "links": [
    "https://www.mercurynews.com/2025/08/14/waymo-san-jose-chamber-commerce-bbq-pizarro/",
    "https://www.mercurynews.com/2025/08/12/san-jose-to-mark-the-80th-anniversary-of-world-war-ii-victory/",
    "https://www.mercurynews.com/2025/08/09/common-san-jose-jazz-summer-fest-downtown-music-malo-pizarro/",
    "https://galaxycon.com/pages/galaxycon-san-jose",
    "https://www.mercurynews.com/2025/08/07/alebrijes-mexican-art-downtown-san-jose-jazz-summer-fest-pizarro/",
    "https://www.mercurynews.com/2025/08/05/its-san-joses-turn-to-honor-the-grateful-dead-in-december/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "San Jose",
      "weight": 0.087860055
    },
    {
      "name": "downtown San Jose",
      "weight": 0.086985886
    },
    {
      "name": "horror movie fans",
      "weight": 0.08359459
    },
    {
      "name": "movies",
      "weight": 0.06630757
    },
    {
      "name": "original Ghostface Lee Waddell",
      "weight": 0.06199996
    },
    {
      "name": "Rocky IV",
      "weight": 0.060998097
    },
    {
      "name": "Ghostface Lee Waddell",
      "weight": 0.058050975
    },
    {
      "name": "cult-movie fan favorite Danny Trejo",
      "weight": 0.05708484
    },
    {
      "name": "the San Jose McEnery Convention Center",
      "weight": 0.05690773
    },
    {
      "name": "Capt. Kirk",
      "weight": 0.05613998
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.7080078125
    },
    {
      "name": "/Arts & Entertainment/Movies/Action & Adventure Films",
      "score": 0.3125
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Other",
      "score": 0.306640625
    }
  ],
  "sentiment": {
    "positive": 0.359189,
    "negative": 0.09618003,
    "neutral": 0.544631
  },
  "summary": "The second year of GalaxyCon, a festival of fandom in downtown San Jose, is set to bring in over 30,000 people, including celebrities from superhero, sci-fi, and horror movies. The event, which includes actors from Marvel's Avengers, Danny Trejo, Dolph Lundgren, and William Shatner, will be held at the San Jose McEnery Convention Center. Other notable attendees include a special meet-and-greet event with Barry Bostwick, who played Brad in 1975's \"The Rocky Horror Picture Show\" and cast members from \"Terrifier\" and \"Scream\" for horror movie fans. The full schedule and details can be found at the website.",
  "shortSummary": "The second annual GalaxyCon in San Jose features notable celebrities like Jeremy Renner, Captain America, and William Shatner, with over 30,000 attendees expected, including over 30% of the crowd.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "afa4a98688d74caa8841c36b708f1d43",
  "places": [
    {
      "osmId": "24168622",
      "road": "South Almaden Boulevard",
      "city": "San Jose",
      "county": "Santa Clara County",
      "state": "California",
      "postcode": "95113",
      "country": "United States",
      "countryCode": "us",
      "amenity": "San Jose McEnery Convention Center",
      "neighbourhood": "SoFA",
      "coordinates": {
        "lat": 37.328945250000004,
        "lon": -121.88901588334974
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.mercurynews.com/2025/08/14/waymo-san-jose-chamber-commerce-bbq-pizarro/",
      "text": "The San Jose Chamber of Commerce’s annual barbecue is always the see-and-be-seen event of the year for the city’s business community. But the big star everyone’s going to want a selfie with won’t be a CEO or a politician — but a car.\nWaymo will have one of its self-driving vehicles on display at the Aug. 21 soiree at History Park in San Jose, in advance of the Mountain View company starting service in the Bay Area’s largest city.\nThe California Public Utilities Commission gave the green light for Waymo to begin offering passenger service in May, and the autonomous cars — with people behind the wheel — have been spotted on San Jose streets, but no service date has been announced yet.\n“It’s about time autonomous vehicles rolled into San Jose,” Mayor Matt Mahan said back in May. “For decades, our region has shaped the future — and now, the ride to work is as forward-thinking as the breakthroughs happening at the office.”\nIt would be fun to see the vehicle taking folks on trips around History Park, but it’ll probably be stationary. If you do want the chance to check out the Waymo vehicles up close, though, you’d better act fast. Ticket sales for the barbecue, presented by Sutter Health and sponsored by a bevy of other companies (including Mountain View-based Waymo), wrap up this week.\nGo to www.sjchamber.com/chamber-bbq for more details."
    },
    {
      "url": "https://galaxycon.com/pages/galaxycon-san-jose",
      "text": "AUGUST 15-17, 2025\nGalaxyCon San Jose is More Than a Comic-Con! It’s a 3-Day FESTIVAL OF FANDOM with celebrities, artists, writers, voice actors, cosplayers, entertainers, creators, wrestlers, fan groups, panelists, and PEOPLE LIKE YOU!\nJoin fans from across the galaxy and celebrate Comic Books, Pop Culture, Sci-Fi, Fantasy, Anime, Gaming, Cosplay, and more!\nClick Here For TicketsWe look forward to seeing you August 15-17, 2025 at the San Jose McEnery Convention Center.\nIf you have questions, please email\nFRIDAY 2pm to 2am\nSATURDAY 10am to 2am\nSUNDAY 10am to 8pm\nSan Jose McEnery Convention Center\n150 W San Carlos St\nSan Jose, CA 95113\nsanjose@galaxycon.com\n(954) 231-0574\nFRIDAY 2pm to 8pm\nSATURDAY 10am to 8pm\nSUNDAY 10am to 6pm\nOur special events, featuring celebrity encounters, upgraded event packages, and more, will take your GalaxyCon experience to new heights!\nClick HereExplore a galaxy of cosplay with contests, meetups, special guests, and so much more!\nClick HereBe more than an attendee! Find applications for volunteers, panels, fan groups, professional creators, entertainment, press, and more at the link below!\nGet InvolvedCome in costume or come as you are! Take part in our legendary Costume and Cosplay Contests with awesome prizes & famous cosplay guest judges! Compete for over $4,000 in cash, plus medals, trophies, and bragging rights!\nBringing a PROP? Make sure to check our policy HERE for safety requirements.\nApply NowLet us know here >>>\nPlease Note: Requests are not guaranteed. We wish we could work with all of the stars, but schedules and budgets don't always align."
    },
    {
      "url": "https://www.mercurynews.com/2025/08/05/its-san-joses-turn-to-honor-the-grateful-dead-in-december/",
      "text": "Now that Dead & Company’s wildly successful shows have ended at Golden Gate Park, it’s San Jose’s turn to honor the 60th anniversary of the Grateful Dead in December.\nSan Jose Rocks, a nonprofit dedicated to highlighting Santa Clara County’s role in music history, has put its celebration plans into high gear to commemorate the site of the band’s first show as the Grateful Dead on Dec. 4, 1965. The performance happened at an “acid test” party at a house on South Fifth Street in downtown San Jose. The house is no longer there, but in fitting irony, the building that happens to be on that site today is San Jose City Hall.\nDan Orloff, founder and executive director of San Jose Rocks, said initial design work is completed on a bronze plaque to commemorate the historic event, which city officials agreed to earlier this year.\n“San Jose was ground zero for the Grateful Dead’s cosmic launch, and it’s high time we crank up the volume on that legacy. This plaque is more than just bronze on a wall — it’s a shoutout to the night the music got weird, wild, and wonderfully historic right here in our city. San Jose Rocks is proud to mark the spot where the Dead were born and history got loud.”\nOrloff says the goal is to dedicate the plaque on Dec. 4, 2025. As part of San Jose Rocks’ deal with the city, the nonprofit will be raising all the money to pay for the 20-by-30-inch bronze plaque — featuring the band’s iconic “Steal Your Face” logo — and the celebration around its installation. That’s where Orloff hopes that Grateful Dead fans in Silicon Valley and beyond will come in.\nSan Jose Rocks has arranged for a pretty cool donor gift, too. Contributors at various levels starting at $125 will receive limited-edition handbills or commemorative posters designed for this cause by artist Stanley Mouse, who created posters for the Bill Graham-promoted shows as well as album covers for the Grateful Dead and Journey. You can find out more at sanjoserocks.org/article/the-grateful-dead-tribute.\nEven San Jose Mayor Matt Mahan — who was barely a teenager when Jerry Garcia died in 1995 — is backing the project, saying the Dead are an “undeniable part of San Jose’s rich musical history.”\n“Our city council meetings are clearly not as exciting as a Dead show, but we’re proud to host a plaque for fans to honor the legendary band’s legacy where it all began, right here in San Jose,” Mahan said in a statement.\nCREATIVE WEEKEND IN LOS ALTOS: The Fine Art in the Park festival is returning to Lincoln Park in Los Altos this weekend for its 50th year. The juried show features the work of more than 150 artists from across the country, who produced original paintings, sculptures, photographs, textiles and ceramics. The weekend will include live music, along with a food court featuring nearby favorites including Chef Chu’s, Aurum, Redwood Grill, Rustic House and Taco Al Vapor.\nPurchases made during the show support scholarships, international disaster relief, clean water projects and other causes supported by the Los Altos Rotary Club. The show is open from 10 a.m. to 5:30 p.m. both Saturday and Sunday, and admission is free. Get more information at www.rotaryartshow.com.\nHISTORIC HUNT: Sarah Winchester is pretty well-known in these parts thanks to her sprawling mansion, the Winchester Mystery House, which attracts droves of people every year to explore its 160 rooms and architectural oddities. But the life of her sister, Isabel Merriman, is probably a real mystery to most people in the Bay Area. That’s why the Los Altos History Museum is spotlighting Merriman — who lived in the area that became Los Altos — with its latest exhibit, “Building El Sueño: Isabel Merriman, Sarah Winchester, and the California Dream.”\nOn Saturday, the museum is inviting the public to take part in “Isabel’s Scavenger Hunt,” from noon to 4 p.m. in its garden (with a prize going to the first 50 people who complete it). Museum Curator and Director of Exhibits Amy Ellison said the event is centered around Merriman’s deep love for plants and animals. She grew a variety of flowers at her home, El Sueño, and sold them at a floral shop she ran in Mountain View. She also served on the board of the Palo Alto Humane Society and cared for neglected animals.\nAppropriately, visitors can hang out with friendly therapy dogs from the Palo Alto Humane Society’s “Visiting Pals” program from noon to 2 p.m. during the scavenger hunt. The exhibit, which opened in late June, runs through Nov. 30. You can get more information at www.losaltoshistory.org."
    },
    {
      "url": "https://www.mercurynews.com/2025/08/12/san-jose-to-mark-the-80th-anniversary-of-world-war-ii-victory/",
      "text": "There are several eye-catching items on display at “V is for Victory in the Valley: Stories from World War II,” a new exhibition that opened last weekend at History Park in San Jose, but three really stood out to me.\nThe first is an olive-green blanket that serves as the centerpiece of the exhibition, which opened last weekend and runs through October in the Leonard McKay Gallery at the Pasetta House. It’s covered with military patches — collected by a young Janice Paull — from soldiers coming through San Jose who stopped at the post office her father ran. Some — like the emblem of the 101st Airborne and the 1st Cavalry — are easily recognizable but others are more obscure.\nHistory San Jose CEO Bill Schroh said he and Collections Curator Katrina Anderson have been using Google Lens to identify some of them. Possibly the most interesting one is the blanket’s center: a “blood chit” that was carried by airmen identifying them as Americans fighting to help China against the Japanese.\nThe other is the flight jacket and other items, including a Distinguished Flying Cross, Silver Star and Flying Medal earned by Capt. Samuel L. Washington, a member of the Tuskegee Airmen, an all Black air squadron. Washington was from Cleveland but eventually settled in San Jose after the war.\nThe third is a photograph taken on South First Street in downtown San Jose after the war’s end was announced in August 1945. There’s a lot of jubilation on display, but as Schroh points out, the people in the photo are more diverse — both in ethnicity and social status — than modern viewers might have expected from a smaller agricultural city 80 years ago. (The theater in the photo’s background is the long-gone Mission, close to where Urban Putt is now.)\nOf course, this Saturday would be a perfect time to visit the exhibition as the Spirit of ’45 Living History Day and Swing Dance will be taking place, starting at 2 p.m. The annual celebration includes a fashion show, a victory parade, vintage cars and military vehicles and lots of family-friendly activities that tie back to World War II. The Chinese Historical and Cultural Project’s museum will be among the park’s historic buildings open Saturday, and it also has a new exhibit on the contributions of Chinese Americans to the war effort.\nThe whole day culminates in an evening swing dance accompanied by the Big Band music of Swing Solution. Admission varies from $10-$25 depending on whether you want to just go to the daytime portion, the evening festivities or the whole thing. Get more details and tickets at www.historysanjose.org.\nART IN THE SKY: There was a lot to take in at last weekend’s San Jose Jazz Summer Fest — from a rousing set by the Pacific Mambo Orchestra to a soulful finale on the main stage delivered by 86-year-old legend Mavis Staples — so it’s almost hard to believe there was a drone show on Saturday night, too.\nThe 13-minute show featured over 250 drones creating colorful animations in the sky over Park Avenue in downtown San Jose. Half of it celebrated Summer Fest, depicting jazz legends who’ve played the fest like Etta James and Herbie Hancock, while the second half brought the “Alebrijes en San Jose” Mexican art exhibition to life.\nUnfortunately, a lot of festival attendees missed the 9:15 p.m. show entirely because main stage headliner P.J. Morton’s set was still going on. And the music from the stage mostly drowned out the drone show soundtrack, curated by local DJ The CME. But if you did miss it, you’ve got another chance to catch the drone show on Sept. 6 during Ritmo y Colores, a cultural festival at Plaza de Cesar Chavez.\nPARTY WITH A PURPOSE: Bandleader Tito Puente Jr. will headline this Saturday’s Tres Vinos fundraiser for the School of Arts and Culture at the Mexican Heritage Plaza in downtown San Jose. Tickets for the dinner event, which includes a wine tasting, are available at www.schoolofartsandculture.org."
    },
    {
      "url": "https://www.mercurynews.com/2025/08/07/alebrijes-mexican-art-downtown-san-jose-jazz-summer-fest-pizarro/",
      "text": "Alebrijes — the bright towering art sculptures — have brought a welcome splash of color to downtown San Jose.\nA touring exhibit of eight 20-foot-tall multicolored statues of “magical animals” has been installed in and around Plaza de Cesar Chavez this week, as part of the celebration of the 35th annual San Jose Jazz Summer Fest, which opens Friday night and runs through Sunday.\nThe jazz may fade away after this weekend, but “Alebrijes en San Jose” will continue to brighten downtown through Sept. 28, with several free, public events over the next few weeks around the Oaxacan art pieces.\nSan Jose Jazz Board President Julie Ramirez said both Summer Fest and the exhibition celebrate the rhythms and resilience of San Jose through music and art. “These towering Alebrijes are more than sculptures — they visit us as guardians of artistic expression and cultural heritage,” Ramirez said.\nSan Jose Jazz Executive Director Brendan Rawson has long wanted to extend the festival’s timeline and hustled to assemble sponsors to bring the art exhibit to San Jose. Summer Fest will include a drone show Saturday night that will highlight the alebrijes and bring them to life in the sky, Rawson said.\nThe eight 1,200-pound fiberglass sculptures glow in different colors at night, courtesy of LEDs inside each one, which depict creatures like coyote with a serpent tail, a CatBird, a LionBull, a rabbit, a dog, an armadillo and an alien. The exhibit celebrates the work of Mexico City artist Pedro Linares, who first created the art style of surrealistic animals and coined the term “alebrije.” One of the artists who created the Alebrijes is his son, Leonardo Linares, and the smaller, original statues on which the big versions are based also are on display inside San Jose City Hall.\nThe artistic celebration started Wednesday night with a packed-to-the-rafters gala at the San Jose Museum of Art, organized by Mezcal restaurant owner Adolfo Gomez, who is from Oaxaca, Mexico. He brought together several of the Mexican chefs at Silicon Valley restaurants to show off their culinary artistry, including Jo Lerma-Lopez and Julio Juarez from Luna Mexican Kitchen, Azari Cuenca Maitret from Copita, Sandra Murillo from Petiscos, Luis Cruz from the Pressroom and, from Mezcal, Miguel Rovera, Tavo Gomez (Adolfo’s brother) and Libo Gomez (Adolfo’s mom).\n“As someone born in Oaxaca, seeing these monumental alebrijes come to life in the heart of downtown San Jose feels deeply personal and powerful,” Gomez said. “In a time when immigrant communities are often politicized or erased, it’s more important than ever to uplift and honor the cultures that shape this city.”\nCELEBRATING INDIA: Festive is going to be the word of the day Saturday afternoon in downtown San Jose. San Jose Jazz’s Summer Fest will be in full swing at Plaza de Cesar Chavez and the surrounding area. But Discovery Meadow also is expected to be packed with crowds attending Swades: Celebrate India Festival, which will include Indian dance and music performances, booths selling Indian street food, a shopping bazaar and family-friendly activities.\nThe festival, sponsored by the Association of Indo-Americans, starts at 1 p.m., and will include a 3:30 p.m. parade that will proceed south from the intersection of Almaden Boulevard and San Fernando Street to the San Jose McEnery Convention Center. You can get tickets or more information at www.aiaevents.org.\nSINGING FOR THEIR SUPPER: It looked like it might be curtains for the Lyric Theatre earlier this year, but donations have managed to keep the light opera company afloat — for now. But audiences can help out, and have a good time doing it, when the Lyric presents a special original musical revue, “The Great Gilbert & Sullivan Sing-Off,” at the Saratoga Civic Theater.\nThe show involves three different companies competing in a Gilbert & Sullivan Festival, performing selections by the Victorian-era creators of such shows as “H.M.S. Pinafore,” “The Pirates of Penzance” and “The Mikado.” Each company will provide a wildly different experience for the audience, which will be asked to vote for their favorite at the end.\nIt’s directed and conceived by Doreen Finklestein, who also worked on the script and some new lyrics with Cordelia Willis and Ronan Beltracchi. There are only three performances — Saturday at 2 p.m. and 7:30 p.m. and Sunday at 2 p.m. Tickets are available for $35-$55 at lyrictheatre.org.\nHAVE YOUR SAY, SAN JOSE: The San Jose Downtown Association is hosting a Public Safety Town Hall 6 p.m. Friday at the San Jose McEnery Convention Center. San Jose Mayor Matt Mahan and Santa Clara County Supervisor Betty Duong will talk about public safety challenges downtown and answer questions from the public at the event, which will be moderated by Alan “Gumby” Marques, the Downtown Association’s interim CEO.\nThe town hall is scheduled for 90 minutes and will be held in Room 230 at the convention center. It is free and open to the public, and questions can be submitted in advance at sjdowntown.com/town-hall.\nBear in mind that this is happening the same time that San Jose Jazz Summer Fest will be kicking off nearby at Plaza de Cesar Chavez, so traffic and parking is going to be a challenge."
    },
    {
      "url": "https://www.mercurynews.com/2025/08/09/common-san-jose-jazz-summer-fest-downtown-music-malo-pizarro/",
      "text": "There’s no better pulse-pounding three days in downtown than San Jose Jazz Summer Fest weekend, and Friday’s opening night was a perfect example of why. Music just flooded downtown all night — from the festival stages to the bars and restaurants on South First Street and San Pedro Square.\nThe good vibes started building when Grammy-nominated vocalist José James started things off on the Jay Paul Company Main Stage, getting the Plaza de Cesar Chavez crowd energized with his music and a few shoutouts about how much he appreciated being in San Jose. That energy continued through a set by Ghost-Note that followed and and all the way up through the climax of the night, a 90-minute performance by Grammy-winning rapper Common.\n“Where are my people from San Jose at right now?” asked the multitalented actor and rapper, whose later reference to the intersection of King and Story roads, the heart of San Jose’s lowrider culture, earned another huge response from the crowd. He was joined on stage for his final songs by Bilal, another Grammy-winning vocalist who collaborated with him on the groundbreaking album “Like Water for Chocolate” and who was between two of his own sets Friday night.\nIf there was nothing else happening at the 35th annual festival Friday night, that would have been enough. But there was so much more.\nThe Latin Tropical Stage on Park Avenue is often more quiet on Friday night, but not this year, with an opening set by Andre Cruz and Chris Lujan and a vibrant performance by La Marisoul and the Love Notes Orchestra building up to a crowd-pleasing end to the evening courtesy of Latin rock band Malo. The Malo performance happened the same time as Common was on the main stage, forcing some tough decisions and a lot of foot traffic between the two crowds.\nSan Jose Jazz Executive Director Brendan Rawson said there’s an emphasis this year on the future of jazz, and Friday night’s lineup leaned into the concept.\nStraight-ahead jazz fans packed the upstairs lobby of the California Theatre — rechristened the California Music Lounge for the weekend — to hear sets by the Bennett Roth Quartet and Summer Carmago, a 23-year-old trumpet phenom who is the youngest member of the “Saturday Night Live” band. The stage at the south end of Plaza de Cesar Chavez, which will be filled with blues and New Orleans-style music Saturday and Sunday, was on Friday night given over to artists who would appeal to younger crowds, like Kiefer and DJ Harrison.\nContinuing with that theme, Summer Fest also has its first artist-in-residence this year, trumpet player Theo Croker, who was on the schedule for a solo set Saturday at the intimate SJZ Break Room stage and Sunday at the California Theatre as well as guesting with other performers throughout the weekend.\n“The character of jazz, the nature of the art form is always striving, always seeking,” Rawson said. “We’re very fortunate with a lot of these young artists to be able to give them the format and let them create interesting stuff.”\nThe festival’s Saturday lineup included the Preservation Hall Jazz Band, the John Pizzarelli Trio, Lalah Hathaway, the Pacific Mambo Orchestra, P.J. Morton and a 9:15 p.m. drone show to celebrate the “Alebrijes en San Jose” Mexican art exhibit.\nSunday’s closing day promised a strong finish, too, with acts including the Headhunters, the Mohini Day Quartet, Swing Solution, All Things Swamp, La Doña and the legendary Mavis Staples, who will close out the main stage at 6 p.m. The full schedule and tickets are available at summerfest.sanjosejazz.org.\nGETTING PICKLED: Pickleball has found its way to downtown San Jose, as San Jose City Councilmember Michael Mulcahy — joined by San Jose Parks Director Jon Cicirelli and reps from the Guadalupe River Park Conservancy, the San Jose Sharks and Little Italy — cut the ribbon Wednesday on a quartet of pickleball courts in Arena Green between SAP Center and Little Italy. When Mulcahy was running for office last year, he and campaign manager Chris Roth saw the potential to turn the park’s tired tennis courts into a venue for the trendy racquet sport.\nAn eight-team tournament followed the ribbon cutting to inaugurate the renovated courts, which are branded with 9-foot by 6-foot versions of the San Jose “placemark” — the city’s more dynamic, secondary logo — which could be visible from planes landing at San Jose Mineta airport. Let me know if you see them when you’re flying in.\nGETTING SAUCED: Speaking of Little Italy, the Boss of the Sauce tomato sauce contest is coming back next weekend for the first time since the COVID-19 pandemic. The Aug. 17 tournament will pit eight Italian restaurants against each other, and having from the sound of it, they’re all confident they’ve got the goods.\nJohnny McGrew of Mio Vicino Pasta and Pizzeria says their marinara recipe belonged to the mother of original owner Tommy Caso, who was from Boston’s north end, and was passed down to current head chef Elias Salvador, whose been with them for 33 years. Pino Spatole, owner and chef at Paesano Ristorante in Little Italy says his secret is to use fresh Roma tomatoes, never canned, which are cooked twice — with a trip through a passatutto (an Italian food mill) in between. Deanna Orkin of Sorelle Italian Bistro says their sauce is all about the family traditions of the mom and three sisters who opened the restaurant 12 years ago.\nThe other contestants include Poor House Bistro, Bibo’s at Littlest Little Italy, Locanda Restaurants and Tony & Alba’s Pizza and Pasta.\nThe splattering starts at noon in the piazza in front of the Little Italy Cultural Center and Museum, with the winner and the People’s Choice Champion expected to be crowned around 4 p.m. You can enjoy the sauces — and freshly cooked pasta — for a $25 ticket available at www.littleitalysj.com/events.\nPOLICE REPORT: San Jose Police Chief Paul Joseph expressed a little trepidation speaking to the Rotary Club of San Jose on Wednesday, addressing a crowd that included some city councilmembers and Assistant City Manager Lee Wilcox. “In case this doesn’t go well, I’m really glad the mayor’s ‘pay-for-performance’ plan wasn’t enacted,” joked Joseph, who did just fine talking about how the department is using both technology and non-sworn community service officers to help make up for its perpetual understaffing."
    }
  ],
  "argos_summary": "GalaxyCon returns to downtown San Jose this weekend, featuring celebrities like Jeremy Renner, Danny Trejo, and William Shatner, along with panels, cosplay contests, and special events for fans. The event is expected to attract over 30,000 attendees, offering a vibrant atmosphere for pop culture enthusiasts. Additionally, the San Jose Chamber of Commerce will showcase a self-driving Waymo vehicle at its annual barbecue, while the city prepares to commemorate the Grateful Dead's legacy with a plaque installation in December.",
  "argos_id": "LYDY6AFIV"
}