{
  "url": "https://www.latimes.com/world-nation/story/2025-08-14/police-chief-orders-more-cooperation-with-immigration-agents-as-federal-activity-takes-root-in-dc",
  "authorsByline": "Ashraf Khalil",
  "articleId": "5af51943dba14bc980b07f0b87ff05d3",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/ad34c17/2147483647/strip/true/crop/5555x2916+0+393/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6c%2F8e%2F033c2e71450687c7176cc35310ea%2F380018a200db43c197e25a02abdc2aa6.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T00:46:48.297000+00:00",
  "addDate": "2025-08-15T00:51:13.560391+00:00",
  "refreshDate": "2025-08-15T00:51:13.560392+00:00",
  "score": 1.0,
  "title": "Police chief orders more cooperation with immigration agents as federal activity takes root in D.C.",
  "description": "The police chief’s order establishes that Metropolitan Police Department officers may now share information with immigration agencies regarding people not in custody — such as someone involved in a traffic stop or checkpoint.",
  "content": "National Guard personnel keep watch as travelers arrive at the entrance to Union Station near the Capitol in Washington, Thursday, Aug. 14, 2025.\n\nThe Washington, D.C., police chief stepped up cooperation between her officers and federal immigration officials as President Trump’s law enforcement takeover of the nation’s capital took root Thursday. National Guard troops watched over some of the world’s most renowned landmarks, and Humvees took up position in front of the busy main train station.\n\nThe police chief’s order establishes that Metropolitan Police Department officers may now share information with immigration agencies regarding people not in custody — such as someone involved in a traffic stop or checkpoint. MPD officers may also provide “transportation for federal immigration employees and detained subject,” the order states.\n\nThe changes, which raise collaboration between the two forces in notable ways, erodes the district’s long-standing policy against cooperating with civil immigration enforcement. They are effective immediately.\n\nMayor Muriel Bowser, walking a tightrope between the Republican White House and the constituency of her largely Democratic city, was out of town Thursday for a family commitment in Martha’s Vineyard but would be back Friday, her office said.\n\nIn a city tense from days of ramp-up toward federal law enforcement intervention, volunteers helped homeless people leave long-standing encampments — to where, exactly, was often unclear. Trump told reporters that he was pleased at how the operation — and, now, its direct link with his immigration-control efforts — was unfolding.\n\n“That’s a very positive thing, I have heard that just happened,” Trump said of Police Chief Pamela Smith’s order. “That’s a great step. That’s a great step if they’re doing that.”\n\nA boost in police activity, federal and otherwise\n\nFor an already wary Washington, Thursday marked a notable — and highly visible — uptick in presence from the previous two days. The visibility of federal forces around the city, including in many high-traffic areas, was striking to residents going about their lives. Trump has the power to take over federal law enforcement for 30 days before his actions must be reviewed by Congress, though he has said he’ll reevaluate as that deadline approaches.\n\nThe response before Thursday had been gradual and, by all appearances, low key. But on Wednesday night, officers set up a checkpoint in one of D.C.’s popular nightlife areas, drawing protests. The White House said 45 arrests were made Wednesday night, with 29 people arrested for living in the country illegally; other arrests included for distribution or possession of drugs, carrying a concealed weapon and assaulting a federal officer.\n\nTroops were stationed outside the Union Station transportation hub as the 800 Guard members who have been activated by Trump start in on missions that include monument security, community safety patrols and beautification efforts, the Pentagon said.\n\n“They will remain until law and order has been restored in the District as determined by the president, standing as the gatekeepers of our great nation’s capital,” Pentagon press secretary Kingsley Wilson said. “The National Guard is uniquely qualified for this mission as a community-based force with strong local ties and disciplined training.”\n\nWilson said the troops won’t be armed and declined to give more details on what the safety patrols or beautification efforts would entail or how many Guard members have already been sent out on the streets.\n\nNational Guard Major Micah Maxwell said troops will assist law enforcement in a variety of roles, including traffic control posts and crowd control. The Guard members have been trained in de-escalation tactics and crowd control equipment, Maxwell said.\n\nThe White House said Thursday that Guard members aren’t making arrests but are “protecting federal assets, providing a safe environment for law enforcement officers to make arrests and deterring violent crime with a visible law enforcement presence.”\n\nAlthough the current deployment is taking place under unprecedented circumstances, National Guard troops are a semi-regular presence in D.C., typically being used during mass public events like the annual Fourth of July celebration. They have regularly been used in the past for crowd control in and around Metro stations.\n\nTrump on Thursday denied that the federal law enforcement officials he sent into Washington’s streets to fight crime have been diverted from priority assignments like counterterrorism. Asked if he was concerned about that, Trump said he’s using a “very small force” of soldiers and that city police are now allowed to do their job properly amidst his security lockdown.\n\nFor homeless residents, an uncertain time is at hand\n\nMeanwhile, about a dozen homeless residents in Washington packed up their belongings with help from volunteers from charitable groups and staffers from some city agencies. Items largely were not forcibly thrown out by law enforcement, but a garbage truck idled nearby.\n\nSeveral protesters held signs close by, some critical of the Trump administration. Once the residents had left, a construction vehicle from a city agency cleared through the remains of the tents.\n\nThe departures were voluntary, but they came in response to a clear threat from the Trump administration. Advocates expect law enforcement officers to fan out across D.C. in the coming days to forcibly take down any remaining homeless encampments. In Washington Circle, which still contains a few tents, city workers put up signs announcing “general cleanup of this public space” starting at 10 a.m. Monday.\n\nFor two days, small groups of federal officers have been visible in scattered parts of the city. But more were present in high-profile locations Wednesday night, and troops were expected to start doing more missions Thursday.\n\nAgents from Homeland Security Investigations have patrolled the popular U Street corridor, while Drug Enforcement Administration officers were seen on the National Mall, with Guard members parked nearby. DEA agents also joined MPD officers on patrol in the Navy Yard neighborhood, while FBI agents stood along the heavily trafficked Massachusetts Avenue.\n\nKhalil writes for the Associated Press. Associated Press journalists Jacquelyn Martin, Mike Pesoli, Darlene Superville and David Klepper contributed to this report.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/world-nation/story/2025-08-14/judge-strikes-down-trump-guidance-against-diversity-programs-schools-colleges",
    "https://www.latimes.com/world-nation/story/2025-08-14/bondi-fires-justice-department-employee-accused-of-throwing-sandwich-at-federal-agent",
    "https://www.latimes.com/world-nation/story/2025-08-14/dcs-homeless-pack-up-as-sweeps-are-expected-what-we-know-about-trumps-plan-to-clear-encampments",
    "https://go.mpdconline.com/GO/EO_25_005.pdf"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "federal law enforcement",
      "weight": 0.09016615
    },
    {
      "name": "law enforcement officers",
      "weight": 0.09015599
    },
    {
      "name": "federal law enforcement intervention",
      "weight": 0.08508573
    },
    {
      "name": "law enforcement",
      "weight": 0.08091326
    },
    {
      "name": "federal officers",
      "weight": 0.078580365
    },
    {
      "name": "National Guard troops",
      "weight": 0.07402655
    },
    {
      "name": "federal immigration officials",
      "weight": 0.06993991
    },
    {
      "name": "civil immigration enforcement",
      "weight": 0.069732346
    },
    {
      "name": "federal immigration employees",
      "weight": 0.06858619
    },
    {
      "name": "federal forces",
      "weight": 0.06825938
    }
  ],
  "topics": [
    {
      "name": "US Politics"
    },
    {
      "name": "Social Issues"
    },
    {
      "name": "Immigration"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.91748046875
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.91015625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.81005859375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.79150390625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.708984375
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.53759765625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.5263671875
    },
    {
      "name": "/News/Local News",
      "score": 0.452392578125
    },
    {
      "name": "/News/Other",
      "score": 0.323486328125
    }
  ],
  "sentiment": {
    "positive": 0.13000299,
    "negative": 0.5508184,
    "neutral": 0.3191786
  },
  "summary": "The Washington, D.C., police chief has ordered increased cooperation between her officers and federal immigration officials as President Trump's law enforcement takeover of the nation's capital takes hold. The changes include sharing information with immigration agencies regarding people not in custody, and providing transportation for federal immigration employees and detained individuals. This move undermines the district's policy against cooperating with civil immigration enforcement. The National Guard has been activated to assist law enforcement in a variety of roles, including traffic control posts and crowd control. The visibility of federal forces around the city was seen as a significant increase from the previous two days. The president has the power to take over federal law enforcement for 30 days before his actions must be reviewed by Congress.",
  "shortSummary": "The Washington, D.C, police chief ordered increased cooperation with federal immigration officials, enhancing law enforcement cooperation and deterring violent crime, as federal law enforcement takes over.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "2f40aa76b93941c0af69e161b32ff9fb",
  "places": [
    {
      "osmId": "738189330",
      "road": "Union Station Drive Northeast",
      "suburb": "Near Northeast",
      "city": "Washington",
      "state": "District of Columbia",
      "postcode": "20401",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "NoMa",
      "coordinates": {
        "lat": 38.897766,
        "lon": -77.0074143
      }
    },
    {
      "osmId": "66418809",
      "road": "West Terraces and Steps",
      "city": "Washington",
      "state": "District of Columbia",
      "postcode": "20004",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 38.88981295000001,
        "lon": -77.00902077737487
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-14/judge-strikes-down-trump-guidance-against-diversity-programs-schools-colleges",
      "text": "Judge strikes down Trump guidance against diversity programs at schools and colleges\n- Share via\nWASHINGTON — A federal judge on Thursday struck down two Trump administration actions aimed at eliminating diversity, equity and inclusion programs at the nation’s schools and universities.\nIn her ruling, U.S. District Judge Stephanie Gallagher in Maryland found that the Education Department violated the law when it threatened to cut federal funding from educational institutions that continued with DEI initiatives.\nThe guidance has been on hold since April when three federal judges blocked various portions of the Education Department’s anti-DEI measures.\nThe ruling Thursday followed a motion for summary judgment from the American Federation of Teachers and the American Sociological Association, which challenged the government’s actions in a February lawsuit.\nThe case centers on two Education Department memos ordering schools and universities to end all “race-based decision-making” or face penalties up to a total loss of federal funding. It’s part of a campaign to end practices the Trump administration frames as discrimination against white and Asian American students.\nThe new ruling orders the department to scrap the guidance because it runs afoul of procedural requirements, though Gallagher wrote that she took no view on whether the policies were “good or bad, prudent or foolish, fair or unfair.”\nSchools are on alert after the Department of Education said it would cut federal funding unless they abolished diversity, equity and inclusion programs, potentially including culturally themed campus housing and graduation ceremonies.\nGallagher, who was appointed by President Trump, rejected the government’s argument that the memos simply served to remind schools that discrimination is illegal.\n“It initiated a sea change in how the Department of Education regulates educational practices and classroom conduct, causing millions of educators to reasonably fear that their lawful, and even beneficial, speech might cause them or their schools to be punished,” Gallagher wrote.\nCalifornia will not comply with Trump order to certify its 1,000 school districts have ended diversity, equity and inclusion programs -- risking federal dollars.\nIn April, the California Department of Education defied a Trump administration order to certify that the state’s 1,000 school districts had ended all diversity, equity and inclusion programs even though billions in education dollars were threatened. The state has defended DEI efforts in schools and contended that “there is nothing in state or federal law” that outlaws it.\n“Hooray!” said Los Angeles school board member Tanya Ortiz Franklin. “We love court rulings that recognize the value of our kids and the vision of democracy, which includes diversity, equity and inclusion, and we look forward to implementing all that we can to make sure kids know where they come from, that they’re valued here and that we are preparing them for the world.”\nThe Los Angeles Unified school board and Supt. Alberto Carvalho have been outspoken against Trump administration polices against DEI. This week they took action to protect students and their families against immigration raids that have swept the city, approving increased school police patrols around campuses and supporting volunteers who are helping to walk children to and from school to keep them safe.\nLos Angeles school board member Rocío Rivas also expressed relief that the DEI guidance had been blocked because of the widespread impact it would have on programming “geared to protect” students of color and LGBTQ+ students.\n“So many programs are multilingual, multicultural,” Rivas said. “So it’s a relief that ... that it’s being halted because, you know, these are programs that are much needed in our in our district.”\nDemocracy Forward, a legal advocacy firm representing the plaintiffs, called it an important victory over the administration’s attack on DEI.\n“Threatening teachers and sowing chaos in schools throughout America is part of the administration’s war on education, and today the people won,” said Skye Perryman, the group’s president and CEO.\nThe Education Department did not immediately comment on Thursday.\nThe conflict started with a Feb. 14 memo declaring that any consideration of race in admissions, financial aid, hiring or other aspects of academic and student life would be considered a violation of federal civil rights law.\nThe memo dramatically expanded the government’s interpretation of a 2023 Supreme Court decision barring colleges from considering race in admissions decisions. The government argued the ruling applied not only to admissions but across all of education, forbidding “race-based preferences” of any kind.\n“Educational institutions have toxically indoctrinated students with the false premise that the United States is built upon ‘systemic and structural racism’ and advanced discriminatory policies and practices,” wrote Craig Trainor, the acting assistant secretary of the department’s Office for Civil Rights.\nAmid President Trump’s attack on DEI, California schools and colleges aim to keep diversity efforts intact while skirting clashes with the administration.\nA further memo in April asked state education agencies to certify they were not using “illegal DEI practices.” Violators risked losing federal money and being prosecuted under the False Claims Act, it said.\nIn total, the guidance amounted to a full-scale reframing of the government’s approach to civil rights in education. It took aim at policies that were created to address longstanding racial disparities, saying those practices were their own form of discrimination.\nThe memos drew a wave of backlash from states and education groups that called it illegal government censorship.\nIn its lawsuit, the American Federation of Teachers said the government was imposing “unclear and highly subjective” limits on schools across the country. It said teachers and professors had to “choose between chilling their constitutionally protected speech and association or risk losing federal funds and being subject to prosecution.”\nBinkley writes for the Associated Press."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-14/bondi-fires-justice-department-employee-accused-of-throwing-sandwich-at-federal-agent",
      "text": "Bondi fires Justice Department employee accused of throwing sandwich at federal agent\n- Share via\nWASHINGTON — A man charged with a felony for hurling a sandwich at a federal law-enforcement official in the nation’s capital has been fired from his job at the Justice Department, Atty. Gen. Pam Bondi said in a social media post Thursday.\nA video of Sean Charles Dunn berating a group of federal agents late Sunday went viral online. Dunn was arrested on an assault charge after he threw a “sub-style” sandwich at a Customs and Border Protection agent, a court filing said.\nDunn, 37, of Washington, was an international affairs specialist in the Justice Department’s criminal division, according to a department official who spoke on the condition of anonymity to discuss a personnel matter.\n“This is an example of the Deep State we have been up against for seven months as we work to refocus DOJ,” Bondi wrote. “You will NOT work in this administration while disrespecting our government and law enforcement.”\nA multiagency flood of uniformed federal law enforcement officers had fanned out across the city over the weekend after the White House had announced stepped-up measures to combat crime. That was before President Trump’s announcement Monday that he was taking over Washington’s police department and activating 800 members of the National Guard.\nThe Justice Department still employs a former FBI agent who was charged with joining a mob’s attack on the U.S. Capitol and cheering on rioters during the Jan. 6, 2021, siege, repeatedly yelling, “Kill ‘em!” as they attacked police. The former FBI supervisory agent, Jared Lane Wise, is serving as a counselor to Justice Department pardon attorney Ed Martin Jr., who was a leading figure in Trump’s campaign to overturn the 2020 election.\nAround 11 p.m. on Sunday, Dunn approached a group of CBP agents, pointed a finger in an agent’s face and swore at him, calling him a “fascist,” a police affidavit says. An observer’s video captured Dunn throwing a sandwich at the agent’s chest, the affidavit says.\n“Why are you here? I don’t want you in my city!” Dunn shouted, according to police.\nDunn tried to run away but was apprehended, police said.\nAn attorney for Dunn didn’t immediately respond to a request for comment on Dunn’s charge.\nThe incident coincided with Trump’s push to flood the city with National Guard troops and federal officers. Trump claims crime in the city has reached emergency levels, but city leaders point to statistics showing violent crime at a 30-year low.\nKunzelman and Richer write for the Associated Press."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-14/dcs-homeless-pack-up-as-sweeps-are-expected-what-we-know-about-trumps-plan-to-clear-encampments",
      "text": "Washington’s homeless pack up as sweeps are expected\n- Share via\nSome of the District of Columbia’s homeless residents were packing their belongings Thursday before expected sweeps to clear out remaining encampments around the nation’s capital, part of President Trump’s federal takeover of policing in the city.\nTrump said this week that homeless people will be moved far from the city in his crackdown on crime. But details of the plan to do so are unclear.\nWashington’s status as a congressionally established federal district gives Trump the opportunity to push his tough-on-crime agenda. It’s prompted concern from advocates and others who say there are better ways to address homelessness than clearing encampments and leaving their occupants worrying about where they go.\nHere’s a look at what we know and what questions remain about how Trump’s actions will affect the city’s homeless population:\nWhat’s happening to encampments?\nNear the Institute of Peace on Thursday morning, AP journalists saw about a dozen homeless D.C. residents packing their belongings. Items weren’t being forcibly thrown out by law enforcement, but an earth mover dug out and scooped away the remains of encampments, depositing them into the bed of an idling truck.\nYards away, several protesters held signs, some critical of the Trump administration. Volunteers from some of the agencies around the city that help homeless people were on hand, and advocates said they expected law enforcement officers to fan out across Washington. later Thursday to take down any remaining homeless encampments,\nAmber W. Harding, executive director of the Washington Legal Clinic for the Homeless, said she believed that “federal law enforcement will begin systematically rounding up and arresting unhoused people.” She believed officers would ask people to move on or would “offer shelter,” arresting people if they refused either directive.\n“We do not have enough shelter beds for everyone on the street,” Harding said. “This is a chaotic and scary time for all of us in D.C., but particularly for people without homes.”\nLucho Vásquez, executive director of the Coalition for the Homeless, said his group was “focusing all energies on opening and operating temporary facilities” for anyone in need of emergency shelter, food or other resources after the removals.\nWhere will the city’s homeless people be taken?\nIt’s not entirely clear.\nTrump wrote on his social media site before Monday’s news conference announcing the takeover that homeless people will have to leave immediately. “We will give you places to stay, but FAR from the Capital,” he posted.\nAsked this week where homeless people would be relocated, White House press secretary Karoline Leavitt said local police and federal agencies would “enforce the laws that are already on the books,” which, she said, “have been completely ignored.”\nCiting a city regulation that she said gives local police “the authority to take action when it comes to homeless encampments,” Leavitt said homeless people “will be given the option to leave their encampment, to be taken to a homeless shelter, to be offered addiction or mental health services.” Those who refuse “will be susceptible to fines or to jail time.”\nIn the last five months, U.S. Park Police have removed 70 homeless encampments, giving the people living in them the same options, she said. As of Tuesday, Leavitt said only two homeless encampments remained in district parks maintained by the National Park Service and would be removed this week.\nHow many homeless people are in Washington?\nIt is difficult to obtain accurate counts of homeless populations.\nOn one day at the end of each January, municipal agencies across the United States perform a “point-in-time” count aimed at capturing the total number of people in emergency shelters, transitional housing or without any housing.\nThe 2025 count in the district put the total at 5,138 adults and children, a 9% decrease compared with the year before, according to Democratic Mayor Muriel Bowser.\nWhat are city officials doing for the homeless?\nDistrict officials said Tuesday they were making additional shelter space available.\nKevin Donahue, the city administrator, said outreach workers were visiting homeless encampments and the city has a building available that could house as many as 200 people, if needed.\nDonahue made the comments during a conversation with community advocates and Bowser. The conversation was broadcast on X.\nHe said the outreach would continue through the week with a “greater level of urgency.”\nBowser said that when Trump sees homeless encampments in the city it “triggers something in him that has him believing our very beautiful city is dirty, which it is not.”\nWhat are people in Washington saying?\nWashington residents emphasized reductions in crime in recent years and concerns over the removal of homeless encampments in interviews Tuesday criticizing the federal takeover of the city’s police department.\nJeraod Tyre, who has lived in the city for 15 years, said “crime has been slowing down lately” and argued that federal troops would only escalate tensions because they do not have “relationships with the people in the community” like local police do.\nSheiena Taylor, 36, said she is more fearful as a result of the presence of federal forces in the city where she was born and raised.\nTaylor said she has seen federal officers around her home and on the subway and worries about their targeting of young people and people experiencing homelessness.\n“Being homeless isn’t a crime,” she said, emphasizing the need for solutions to the root causes of homelessness or crime rather than policing.\nIn several spots across the city, AP journalists talked to homeless people who were being told either by federal law enforcement officials or advocacy groups to pack up tents and belongings from parks and other public spaces before more official removal measures. Some expressed fear and anxiety about what might be coming.\nKinnard writes for the Associated Press. AP writers Christine Fernando in Chicago, Mike Balsamo and Darlene Superville; video journalists River Zhang and Nathan Ellgren; and photographer Jacquelyn Martin contributed to this report."
    }
  ],
  "argos_summary": "In Washington, D.C., the police chief has increased cooperation with federal immigration officials amid President Trump's law enforcement takeover, allowing officers to share information and transport detained individuals. National Guard troops have been deployed to monitor the city, with a visible presence at key locations, while the administration plans to clear homeless encampments, raising concerns among advocates about the treatment of vulnerable populations. A federal judge recently struck down Trump administration actions aimed at eliminating diversity programs in schools, highlighting ongoing tensions over civil rights and immigration policies.",
  "argos_id": "MDJ75JGML"
}