{
  "url": "https://www.usatoday.com/story/news/world/2025/08/13/israel-gaza-cairo-ceasefire-talks-hamas/85638200007/",
  "authorsByline": "Nidal al-Mughrabi and Emily Rose",
  "articleId": "782f7b646e0745bd8d5bf28c7e526f2a",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/13/USAT/85638212007-20250813-t-094113-z-1035793399-rc-2-s-5-gac-07-m-4-rtrmadp-3-israelpalestiniansgazaheat.JPG?crop=4898,2755,x0,y256&width=3200&height=1800&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T10:42:51+00:00",
  "addDate": "2025-08-13T10:49:02.269020+00:00",
  "refreshDate": "2025-08-13T10:49:02.269022+00:00",
  "score": 1.0,
  "title": "Israel says Gazans free to exit while Hamas attends Cairo ceasefire talks",
  "description": "Hamas held talks with Egyptian mediators over a potential ceasefire while Israel struck Gaza's main city prior to a planned takeover.",
  "content": "CAIRO/JERUSALEM, Aug 13 (Reuters) - Militant group Hamas' chief negotiator held talks with Egyptian mediators over a potential ceasefire in the Gaza war on Wednesday while Israel struck the territory's main city prior to a planned takeover and again invited Palestinians to leave.\n\nIsraeli Prime Minister Benjamin Netanyahu reiterated an idea - also enthusiastically floated by U.S. President Donald Trump - that Palestinians should simply leave the enclave housing more than 2 million people after nearly two years of conflict.\n\n\"They’re not being pushed out, they’ll be allowed to exit,\" he told Israeli television channel i24NEWS. \"All those who are concerned for the Palestinians and say they want to help the Palestinians should open their gates and stop lecturing us.\"\n\nArabs and many world leaders are aghast at the idea of displacing the Gaza population, which Palestinians say would be like another \"Nakba\" (catastrophe) when hundreds of thousands fled or were forced out during a 1948 war.\n\nIsrael's planned re-seizure of Gaza City - which it took in the early days of the war before withdrawing - is probably weeks away, officials say. That means a ceasefire is still possible though talks have been floundering and conflict still rages.\n\nIsraeli planes and tanks bombed eastern areas of Gaza City heavily, residents said, with many homes destroyed in the Zeitoun and Shejaia neighbourhoods overnight. Al-Ahli hospital said 12 people were killed in an airstrike on a home in Zeitoun.\n\nTanks also destroyed several houses in the east of Khan Younis in south Gaza too, while in the centre Israeli gunfire killed nine aid-seekers in two separate incidents, Palestinian medics said. Israel's military did not comment.\n\nHamas chief negotiator Khalil Al-Hayya's meetings with Egyptian officials in Cairo on Wednesday were to focus on stopping the war, delivering aid and \"ending the suffering of our people in Gaza,\" Hamas official Taher al-Nono said in a statement.\n\nEgyptian security sources said the talks would also discuss the possibility of a comprehensive ceasefire that would see Hamas relinquish governance in Gaza and concede its weapons.\n\nA Hamas official told Reuters the group was open to all ideas if Israel pulls out. However, \"Laying down arms before the occupation is dismissed is impossible,\" the official, who asked not to be named, told Reuters.\n\nNetanyahu's plan to expand military control over Gaza, which Israeli sources said could be launched in October, has heightened global outcry over the widespread devastation, displacement and hunger in the enclave.\n\nAbout half of Gaza's residents live in the Gaza City area.\n\nForeign ministers of 24 countries, including Britain, Canada, Australia, France and Japan, said this week the humanitarian crisis in Gaza had reached \"unimaginable levels\" and urged Israel to allow unrestricted aid.\n\nIsrael denies responsibility for hunger, accusing Hamas of stealing aid. It says it has taken steps to increase deliveries, including daily combat pauses in some areas and protected routes for aid convoys.\n\nThe Israeli military on Wednesday said that nearly 320 trucks entered Gaza through the Kerem Shalom and Zikim crossings and that a further nearly 320 trucks were collected and distributed by the U.N. and international organizations in the past 24 hours along with three tankers of fuel and 97 pallets of air-dropped aid.\n\nThe United Nations and Palestinians say aid entering Gaza remains far from sufficient.\n\nThe war began on October 7, 2023, when Hamas-led militants stormed into southern Israel, killing 1,200 people and taking 251 hostages, according to Israeli figures. Israel's offensive against Hamas in Gaza since then has killed more than 61,000 Palestinians, according to local health officials.",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/picture-gallery/news/world/2025/07/27/gaza-starvation-spreads-photos/85395898007/",
    "https://www.usatoday.com/story/news/world/2025/07/29/gaza-death-toll-starvation-food-famine/85423669007/",
    "https://www.usatoday.com/picture-gallery/news/world/2025/08/08/israel-plan-gaza-palestine-takeover-photos/85575059007/",
    "https://www.usatoday.com/story/news/world/2025/08/12/hamas-hostage-videos-israeli-media-gaza-aid-crisis/85621710007/",
    "https://www.usatoday.com/story/news/world/2025/08/06/thirst-hits-gaza-polluted-aquifers-broken-pipelines/85538277007/",
    "https://www.usatoday.com/videos/news/2025/08/04/fired-contractor-slams-gaza-aid-effort-likens-it-to-hunger-games/85515395007/",
    "https://www.usatoday.com/news/world/benjamin-netanyahu/",
    "https://www.usatoday.com/news/politics/donald-trump/",
    "https://www.usatoday.com/story/news/politics/2025/07/29/marjorie-taylor-greene-gaza-genocide-crisis/85424233007/",
    "https://www.usatoday.com/story/news/world/2025/08/13/un-sexual-violence-allegations-israel-russia/85637912007/",
    "https://www.usatoday.com/story/news/politics/2025/07/28/trump-rejects-netanyahu-starvation-food-crisis-gaza/85404936007/",
    "https://www.usatoday.com/story/news/world/2025/07/28/gaza-starving-food-crisis-israel/85401750007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Gaza City",
      "weight": 0.09218551
    },
    {
      "name": "Gaza",
      "weight": 0.088712364
    },
    {
      "name": "south Gaza",
      "weight": 0.08808354
    },
    {
      "name": "Hamas",
      "weight": 0.070950754
    },
    {
      "name": "Egyptian officials",
      "weight": 0.06900765
    },
    {
      "name": "Cairo ceasefire talks",
      "weight": 0.06726506
    },
    {
      "name": "Israeli sources",
      "weight": 0.06667782
    },
    {
      "name": "southern Israel",
      "weight": 0.06604676
    },
    {
      "name": "unrestricted aid",
      "weight": 0.06469467
    },
    {
      "name": "Palestinians",
      "weight": 0.06414818
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.9697265625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.94384765625
    },
    {
      "name": "/News/World News",
      "score": 0.91357421875
    },
    {
      "name": "/News/Other",
      "score": 0.6064453125
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.417724609375
    }
  ],
  "sentiment": {
    "positive": 0.05354959,
    "negative": 0.7150876,
    "neutral": 0.2313628
  },
  "summary": "Israel's Prime Minister, Benjamin Netanyahu, has stated that Palestinians should not be pushed out of Gaza, but be allowed to leave the enclave after nearly two years of conflict. This comes as Hamas' chief negotiator, Khalil Al-Hayya, is in talks with Egyptian mediators for a potential ceasefire in the Gaza war. Israel's planned re-seizure of Gaza City, which it took in the early days of the war before withdrawing, is expected to occur within weeks. The talks are also expected to discuss the possibility of a comprehensive ceasefire that would see Hamas relinquish governance in Gaza and surrender its weapons. The Israeli military has reported that nearly 320 trucks entered Gaza and nearly 320 aid deliveries in the past 24 hours.",
  "shortSummary": "Hamas' chief negotiator discussed a ceasefire in Gaza with Egyptian mediators, while Israel continued its military campaign and invited Palestinians to leave.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "b01e5e14821f4312b18a8bf082597046",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/news/world/2025/07/28/gaza-starving-food-crisis-israel/85401750007/",
      "text": "One meal a day. $20 for an egg. Choosing which kid gets fed. Starvation stalks Gaza\nOne meal a day. Forced to choose which of her kids get fed. In the market, because all the banks are closed and there is a cash liquidity crisis, $20 for a single egg; $1,400 for a bag of flour that might last 20 days.\nSuch is the plight of Gazans like Amal Nassar, 35, an English teacher from Deir Al-Balah in the central part of the Palestinian enclave. Nassar, her three children and her husband are among more than 2 million Gazans who remain trapped almost two years since the war that began after Hamas attacked Israel on Oct. 7, 2023.\n\"We don't have enough to eat,\" Nassar said in a WhatsApp message over the weekend. USA TODAY has written about Nassar's story of giving birth to her daughter Mira in a war zone without access to pain relief.\nOn July 28, for the second day running, Israel paused its military operations in Gaza to \"improve the humanitarian response.\" That follows a series of alarming warnings from world leaders and global officials, from the United Nations' World Health Organization and from dozens of humanitarian agencies that malnutrition and even starvation in Gaza is on a \"dangerous trajectory.\"\nThe United Nations' World Food Programme says a third of Gaza's population does not eat for several days at a time. One in 4 Gazans, it says, are \"enduring famine-like conditions.\" The Hamas-run health ministry, the chief source of health data in Gaza, says more than 100 people have died from malnutrition in recent days.\nIsrael disputes claims it is intentionally starving Gazans\nIsrael has rejected claims that it is intentionally starving Gaza's population. It accuses the United Nations of failing to collect and distribute aid sitting on Gaza's border. For nearly two years, it has also accused Hamas of stealing aid for Gaza's desperate and hungry population and using it as a weapon of control.\n\"There is no policy of starvation in Gaza, and there is no starvation in Gaza,\" Israeli Prime Minister Benjamin Netanyahu said July 28. He called those suggestions a \"bold-faced lie,\" prompting a response from President Donald Trump while he was on a trip to Scotland.\n\"From what I see on TV, I can say those kids look starving,\" Trump said. ''We’re sending a lot of money and a lot of food. The children in Gaza must receive food and security immediately.\"\nGoing hungry in Gaza\nRecent reports indicate there's not much evidence of systematic Hamas aid theft. Amid growing international pressure, Israel has allowed the United Arab Emirates and Jordan to resume aid drops of flour, sugar and canned foods in Gaza. But aid workers say airdrops are not as effective as convoys of trucks.\nEven large transport planes can't carry as much aid as truck convoys. They can also be dangerous. It's not uncommon for aid dropped from planes to injure or even kill people who are trying to get to them.\n\"We need more food to be able to enter Gaza,\" said Beckie Ryan, the Gaza response director for CARE, an aid group. Ryan is in Deir Al-Balah, where CARE runs a health clinic. She said \"everyone is hungry.\" Her clinic has seen a spike in cases of children who are either malnourished or acutely malnourished, she said, and soaring summer temperatures combined with limited water supplies are making things worse.\nRyan also said cases like Nassar's were fairly typical in Gaza right now. Most people are limited to one meal a day. They are having to chose which of their children gets food. Because no cash has been allowed into Gaza for almost two years and markets accept only cash, those who are still lucky enough to be earning a salary are having to pay as much as double to effectively buy the cash they need to pay for the limited goods for sale.\nRyan said there are \"multiple layers\" that explain why it has been so hard to get food to Gazans. But the most important thing is \"access to the thousands of trucks that are sitting in Egypt and Jordan,\" she said. \"It's the quickest and most efficient way. Right now our ability to move those trucks is extremely limited.\"\nFor Nasser, where the food comes from or who's to blame for the lack of it is of secondary importance.\nShe said she and her husband don't dare go near distribution centers run by the Gaza Humanitarian Foundation, an American contractor. They are too scared. It is backed by the United States and Israel but not the United Nations. The international body has reported hundreds of deaths of Palestinians trying to access these centers. Some of those deaths have been linked, by the United Nations, to Israeli gunfire and shelling; the foundation has accused the United Nations of using \"false and exaggerated statistics\" over the deaths.\nNasser said weeks can go by without her family eating a single piece of fresh fruit or a vegetable. She said one diaper for her daughter, Mira, can cost as much as $10 with the extra fees for cash. She uses plastic bags when she can't afford diapers, but they give Mira rashes that bleed. She said she constantly worries about her children, and they are losing weight. She herself is newly pregnant, exhausted and often feels dizzy.\n\"Our situation,\" she said, \"is really horrible.\""
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/07/28/trump-rejects-netanyahu-starvation-food-crisis-gaza/85404936007/",
      "text": "'Every ounce of food': Trump presses Israel on starvation in Gaza; 'children look very hungry'\nPresident Trump disagreed with Israeli Prime Minister Benjamin Netanyahu's claim that no starvation is taking place among the people of Gaza.\nWASHINGTON − President Donald Trump said he disagrees with Israeli Prime Minister Benjamin Netanyahu's claim that no starvation is taking place among the people of Gaza, and urged Israel to let more food in.\n\"Those children look very hungry,\" Trump said July 28 when asked by a reporter whether he agrees with Netanyahu's assessment. \"But we're giving a lot of money and a lot of food, and other nations are now stepping up.\"\n“I want to make sure they get the food, every ounce of food,'' he said.\nTrump made the remarks ahead of a bilateral meeting with U.K. Prime Minister Keir Starmer in Turnberry, Scotland, where the second-term U.S. president arrived July 25 for a four-day trip.\nAs images of emaciated children in Gaza have alarmed the world, Netanyahu denied Israel is conducting a starvation campaign, calling such accusations a \"bold-faced lie\" and even rejecting that starvation is occurring.\n“There is no policy of starvation in Gaza and there is no starvation in Gaza,\" Netanyahu said July 27.\nThe Gaza health ministry said July 28 that at least 14 people had died in the past 24 hours of starvation and malnutrition, bringing the war's death toll from hunger to 147, including 89 children, most of them in just the last few weeks.\nTo help get additional food into Gaza, Israel on July 27 announced a halt in military operations for 10 hours a day in parts of Gaza and new aid corridors as Jordan and the United Arab Emirates airdropped supplies into the enclave.\nTrump, speaking alongside Starmer at his golf resort, said the United States had provided $60 million for humanitarian aid, and other nations would have to step up.\nTrump said he discussed the Gaza conflict with European Commission President Ursula von der Leyen on July 27, and she told him European countries would ramp up their assistance.\nStarmer called the mounting starvation in Gaza a \"humanitarian crisis\" and an \"absolute catastrophe,\" adding that \"the people in Britain are revolted by what they're seeing on their screens.\"\nIsrael cut off all supplies to Gaza from the start of March and reopened the territory with new restrictions in May. Israel says it abides by international law but must prevent aid from being diverted by militants, and it blames Hamas for the suffering of Gaza's people.\n\"You have a lot of starving people,\" Trump said, later criticizing the Hamas militant group for not agreeing to release more Israeli hostages, living and dead. Trump said he told Netanyahu that Israel's approach would likely have to change.\n\"I told Bibi that you have to maybe do it a different way.\"\nContributing: Reuters\nReach Joey Garrison on X @joeygarrison."
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/07/29/marjorie-taylor-greene-gaza-genocide-crisis/85424233007/",
      "text": "Marjorie Taylor Greene calls crisis in Gaza 'genocide,' first Republican lawmaker to do so\nWASHINGTON − Rep. Marjorie Taylor Greene, R-Georgia, said there is a \"genocide\" happening in Gaza, becoming the first Republican lawmaker to use the term to describe the ongoing humanitarian crisis in the enclave.\n\"It’s the most truthful and easiest thing to say that Oct 7th in Israel was horrific and all hostages must be returned, but so is the genocide, humanitarian crisis, and starvation happening in Gaza,\" Greene wrote on X.\nHers is an uncommon statement in a caucus that has rallied around Israel since October 2023, when Hamas attacked Israel, killing 1,200 people and taking 251 hostages.\nIsrael has strongly rejected claims that the country is perpetuating a genocide against Palestinians in Gaza.\nRecently the Israeli military announced it would pause action in certain parts of Gaza for hours each day and increase aid drops in the enclave. Reports of mass starvation have spread since Israel first cut off supplies to the region in March, then reopened aid lines, with new restrictions, in May.\nMore than 125 people have died due to malnutrition, including 85 children, the Hamas-run Gaza Health Ministry said over the weekend. A 5-month-old baby, Zainab Abu Haleeb, died of malnutrition at Nasser Hospital in southern Gaza on July 26.\nIn recent weeks, more than 800 people have been killed while trying to reach food, according to the United Nations, mostly in shootings by Israeli soldiers posted near controversial Gaza Humanitarian Foundation distribution centers.\n\"I can unequivocally say that what happened to innocent people in Israel on Oct 7th was horrific,\" Greene wrote in an earlier social media post over the weekend. \"Just as I can unequivocally say that what has been happening to innocent people and children in Gaza is horrific.\"\n\"This war and humanitarian crisis must end!\"\nHer post on July 28 calling Israel's attack on Gaza a genocide was part of a direct criticism of her Republican colleague Rep. Randy Fine, who was elected in April to fill the seat vacated by former National Security Adviser Mike Waltz.\nFine, a Jewish member of Congress and staunch defender of Israel, has been outspoken on social media, denying the crisis in Gaza in multiple posts and writing in another, \"starve away.\""
    },
    {
      "url": "https://www.usatoday.com/story/news/world/2025/08/12/hamas-hostage-videos-israeli-media-gaza-aid-crisis/85621710007/",
      "text": "Hamas hostage videos silenced Israeli media's talk of Gaza aid crisis\nJERUSALEM, Aug 12 (Reuters) - A growing willingness among Israeli news media to critically explore the humanitarian crisis in Gaza has all but evaporated in recent weeks after militant group Hamas released videos of two emaciated Israeli hostages.\nIn late July, as images of starving Gazans stirred international outcry, some Israeli press and broadcasters began to carry reports on the worsening conditions there, urging a more robust aid response.\nYonit Levi, the main news anchor of Channel 12, branded the humanitarian crisis in Gaza a \"moral failure\" live on air, and the heads of some universities and the national Holocaust memorial appealed to the government to help hungry Gazans.\nIsraeli media has largely focused during 22 months of war on the trauma and impact on Israelis of Hamas' Oct. 7, 2023 attack, in which, according to Israeli tallies, some 1,200 people were killed and 251 taken hostage. Coverage has concentrated on the fate of the hostages and the casualties suffered by the Israeli army.\nSome Israelis welcomed Levi's comment and the spate of reports discussing conditions in Gaza as evidence of a readiness to examine the impact of the war on Palestinian civilians.\nBut the mood in Israel hardened dramatically when, on July 31, Hamas released a video of the skeletal 21-year-old Israeli hostage Rom Braslavski, weeping and in pain. It was followed three days later by a video of Evyatar David, 24, who said he was being forced to dig his own grave.\nThe videos - which one Palestinian source said were designed to show the terrible impact of restricted aid flows in Gaza - backfired, shutting down the growing sympathy in Israel towards civilians there.\nAmid international condemnation of Hamas, thousands of protestors took to the streets in Israel to demand the immediate return of the hostages. About 50 hostages are still in Gaza, but only around 20 of them are thought to still be alive.\nUri Dagon, deputy editor-in-chief of Yisrael Hayom, Israel's most widely circulated newspaper, said that with hostages being held by Hamas in Gaza, Israelis \"don't have the ability to experience the pain of the other side.\"\n\"I know that sounds terrible but it's the truth,\" he said.\nDagon accused foreign media of falling into a \"campaign of lies\" about starvation in Gaza: while his paper had published articles on suffering there, it emphasized that Hamas was to blame. He questioned why foreign outlets that published photos of emaciated Gazans had not given the same prominence to the harrowing images of Evyatar David.\n\"I suggest senior editors in the international press review themselves and only then discuss how the Israeli press is conducting itself,\" Dagon said.\nDENIALS OF STARVATION\nPolls in the wake of Oct. 7 that showed most Palestinians approved of the attack sowed anger in Israel. Videos of Gazans crowding around hostages in the immediate aftermath of the raid, filming them on their mobile phones, spitting on them and beating them also fuelled lasting resentment.\nHarel Chorev, a senior researcher Moshe Dayan Center at Tel Aviv University specializing in media and Palestinian society, said such incidents made it difficult for many Israelis to feel sympathy for people in Gaza.\nWhile international media, barred by Israel from entering Gaza, have relied on Palestinian journalists, many Israelis have little faith in their reporting. Some cite the lack of press freedom in Gaza under Hamas' authoritarian rule.\n\"I don't think there is a famine in Gaza,\" said Orit Maimon, 28, a lawyer from Tel Aviv. \"I don't think the situation there is ideal or very good but I don't think there is a famine.\"\nThe Gaza health ministry says 222 people have died of starvation and malnutrition, including 101 children, since the war began.\nRight-wing Channel 14 has devoted coverage in recent weeks to discrediting some reports of starving children. When a child featured in a front-page photograph in Britain's Daily Express newspaper was discovered to have a pre-existing health condition, some Israeli outlets reacted with outrage.\nA poll released this month by The Israel Democracy Institute, a Jerusalem-based think tank, found that 78% of Jewish Israelis think Israel is making a substantial effort to avoid Palestinian suffering while only 15% think Israel could do more and chooses not to.\nThe Israeli offensive makes reporting in Gaza perilous. According to the Palestinian Journalists Syndicate, a professional body, Israel has killed more than 230 journalists in Gaza since November. Reuters was unable to verify those figures independently.\nIsrael denies deliberately targeting journalists and says many of those killed were members of militant groups working under the guise of the press.\nOn Sunday, Israel's military said it killed an Al Jazeera journalist in an airstrike: it accused 28-year-old Anas Al Sharif of being a Hamas cell leader. Al Sharif had rejected the accusations, which Israel made before he was killed, and rights advocates said Al Sharif was targeted for his reporting.\nMore than 61,000 Palestinians have been killed by Israel's military campaign, according to Gaza health officials\nCRITICISM OF THE GOVERNMENT\nPolls conducted over the course of the war found that around 70% of the Israeli public wants to see Israel make a deal to release the hostages, even if that means ending the war immediately.\nSeveral Israeli media have criticized Netanyahu's government for failing to bring the hostages home or to enunciate a clear plan for Gaza after the conflict. Amongst its most outspoken critics has been left-leaning newspaper Haaretz, which has also published considerable reporting on the suffering in Gaza, including investigative pieces on army operations there.\nIn November, Netanyahu's cabinet – which includes far-right ultranationalist parties – approved a ban on officials talking to Haaretz and government advertising boycott of the paper, accusing it of supporting \"the enemies of the state in the midst of a war\".\nThe Israeli prime minister's office declined to comment for this story.\nNetanyahu's ministers have also put forward a proposal to privatize Channel 11, the public broadcaster, which a spokesperson for his Likud party criticized for serving the radical left and damaging Israelis' morale. Some media experts have warned this could have a chilling effect on media coverage of the government.\nAsa Shapira, head of the Marketing and Advertising studies at Tel Aviv University, said the government's actions impact what Israeli channels decide to show.\nWhile editorial decisions to focus on the fate of Israeli hostages was a response to public concern, there was also fear of attracting government disapproval, he said.\n(Additional reporting by Nidal Al-Mughbrabi in Cairo and Michal Yaakov Itzhaki in Jerusalem; Writing by Michael Georgy; Editing by Daniel Flynn)"
    },
    {
      "url": "https://www.usatoday.com/story/news/world/2025/08/13/un-sexual-violence-allegations-israel-russia/85637912007/",
      "text": "UN chief puts Israel, Russia 'on notice' over conflict-related sexual violence accusations\nUNITED NATIONS, Aug 12 (Reuters) - United Nations Secretary-General Antonio Guterres warned Israel and Russia on Tuesday that he has significant concerns about patterns of certain forms of sexual violence by their armed and security forces, according to a report seen by Reuters.\nThe alleged crimes included incidents of genital violence, prolonged forced nudity of captives, and abusive and degrading strip searches aimed at humiliation and interrogation.\nIn his annual report to the Security Council on conflict-related sexual violence, Guterres put Israel and Russia \"on notice\" that they could be listed next year among parties \"credibly suspected of committing or being responsible for patterns of rape or other forms of sexual violence.\"\nThe warning resulted from \"significant concerns regarding patterns of certain forms of sexual violence that have been consistently documented by the United Nations,\" he wrote.\nIsrael's U.N. Ambassador Danny Danon described the concerns as baseless accusations.\n\"The U.N. must focus on the shocking war crimes and sexual violence of Hamas and the release of all hostages. Israel will not shy away from protecting its citizens and will continue to act in accordance with international law,\" Danon said in a statement.\nPalestinian militants Hamas - whose Oct. 7, 2023, attack on southern Israel triggered the current war in Gaza - were listed in Guterres' report on Tuesday as a group \"credibly suspected of committing or being responsible for patterns of rape or other forms of sexual violence\" in armed conflict.\n“We categorically reject all these allegations,\" senior Hamas official Basem Naim told Reuters, adding in reference to Israeli remarks: “These are certainly new attempts to use lies to divert attention from the ongoing brutal crimes committed by this fascist government and its army against our people in Gaza.\"\n'CREDIBLE INFORMATION'\nIn his warning to Israel, Guterres said he was \"gravely concerned about credible information of violations by Israeli armed and security forces\" against Palestinians in several prisons, a detention center and a military base.\n\"Cases documented by the United Nations indicate patterns of sexual violence such as genital violence, prolonged forced nudity and repeated strip searches conducted in an abusive and degrading manner,\" he wrote in the report.\nWhile Israeli authorities had engaged with his special envoy on sexual violence in conflict over the past year, Guterres said \"limited information has been provided on accountability measures undertaken in relation to alleged incidents of sexual violence, despite witness testimony and digital evidence of Israeli soldiers committing such violations.\"\nRussia's mission to the U.N. in New York did not immediately respond to a request for comment on the report. Guterres said Russian authorities have not engaged with his special envoy.\nGuterres wrote that he was \"gravely concerned about credible information of violations by Russian armed and security forces and affiliated armed groups\" primarily against Ukrainian prisoners of war, in 50 official and 22 unofficial detention facilities in Ukraine and Russia.\n\"These cases comprised a significant number of documented incidents of genital violence, including electrocution, beatings and burns to the genitals, and forced stripping and prolonged nudity, used to humiliate and elicit confessions or information,\" he said.\nRussia launched its full-scale invasion of neighboring Ukraine in February 2022.\n(Reporting by Michelle Nichols; Additional reporting by Nidal Al Mughrabi; Editing by Don Durfee and Daniel Wallis)"
    },
    {
      "url": "https://www.usatoday.com/story/news/world/2025/08/06/thirst-hits-gaza-polluted-aquifers-broken-pipelines/85538277007/",
      "text": "Terrible thirst hits Gaza with polluted aquifers and broken pipelines\nGAZA/CAIRO, Aug 6 (Reuters) - Weakened by hunger, many Gazans trek across a ruined landscape each day to haul all their drinking and washing water - a painful load that is still far below the levels needed to keep people healthy.\nEven as global attention has turned to starvation in Gaza, where after 22 months of a devastating Israeli military campaign a global hunger monitor says a famine scenario is unfolding, the water crisis is just as severe according to aid groups.\nThough some water comes from small desalination units run by aid agencies, most is drawn from wells in a brackish aquifer that has been further polluted by sewage and chemicals seeping through the rubble, spreading diarrhoea and hepatitis.\nCOGAT, the Israeli military agency responsible for coordinating aid in the Israeli-occupied Palestinian territories, says it operates two water pipelines into the Gaza Strip providing millions of litres of water a day.\nPalestinian water officials say these have not been working recently.\nIsrael stopped all water and electricity supply to Gaza early in the war but resumed some supply later though the pipeline network in the territory has been badly damaged.\nMost water and sanitation infrastructure has been destroyed and pumps from the aquifer often rely on electricity from small generators - for which fuel is rarely available.\nCOGAT said the Israeli military has allowed coordination with aid organisations to bring in equipment to maintain water infrastructure throughout the conflict.\nMoaz Mukhaimar, aged 23 and a university student before the war, said he has to walk about a kilometre, queuing for two hours, to fetch water. He often goes three times a day, dragging it back to the family tent over bumpy ground on a small metal handcart.\n\"How long will we have to stay like this?\" he asked, pulling two larger canisters of very brackish water to use for cleaning and two smaller ones of cleaner water to drink.\nHis mother, Umm Moaz, 53, said the water he collects is needed for the extended family of 20 people living in their small group of tents in Deir al-Balah in the central Gaza Strip.\n\"The children keep coming and going and it is hot. They keep wanting to drink. Who knows if tomorrow we will be able to fill up again,\" she said.\nTheir struggle for water is replicated across the tiny, crowded territory where nearly everybody is living in temporary shelters or tents without sewage or hygiene facilities and not enough water to drink, cook and wash as disease spreads.\nThe United Nations says the minimum emergency level of water consumption per person is 15 litres a day for drinking, cooking, cleaning and washing. Average daily consumption in Israel is around 247 litres a day according to Israeli rights group B'Tselem.\nBushra Khalidi, humanitarian policy lead for aid agency Oxfam in the Israeli-occupied Palestinian territories said the average consumption in Gaza now was 3-5 litres a day.\nOxfam said last week that preventable and treatable water-borne diseases were \"ripping through Gaza\", with reported rates increasing by almost 150% over the past three months.\nIsrael blames Hamas for the suffering in Gaza and says it provides adequate aid for the territory's 2.3 million inhabitants.\nQUEUES FOR WATER\n\"Water scarcity is definitely increasing very much each day and people are basically rationing between either they want to use water for drinking or they want to use a lot for hygiene,\" said Danish Malik, a global water and sanitation official for the Norwegian Refugee Council.\nMerely queuing for water and carrying it now accounts for hours each day for many Gazans, often involving jostling with others for a place in the queue. Scuffles have sometimes broken out, Gazans say.\nCollecting water is often the job of children as their parents seek out food or other necessities.\n\"The children have lost their childhood and become carriers of plastic containers, running behind water vehicles or going far into remote areas to fill them for their families,\" said Munther Salem, water resources head at the Gaza Water and Environment Quality Authority.\nWith water so hard to get, many people living near the beach wash in the sea.\nA new water pipeline funded by the United Arab Emirates is planned, to serve 600,000 people in southern Gaza from a desalination plant in Egypt. But it could take several more weeks to be connected.\nMuch more is needed, aid agencies say. UNICEF spokesperson James Elder said the long-term deprivations were becoming deadly. \"Starvation and dehydration are no longer side effects of this conflict. They are very much frontline effects.\"\nOxfam's Khalidi said a ceasefire and unfettered access for aid agencies was needed to resolve the crisis.\n\"Otherwise we will see people dying from the most preventable diseases in Gaza - which is already happening before our eyes.\"\n(Reporting by Ramadan Abed in Deir al-Balah, Gaza, Nidal al-Mughrabi in Cairo and Olivia Le Poidevin in Geneva; writing by Angus McDowall; Editing by Alexandra Hudson)"
    },
    {
      "url": "https://www.usatoday.com/story/news/world/2025/07/29/gaza-death-toll-starvation-food-famine/85423669007/",
      "text": "Gaza death toll hits 60,000 as global monitor demands action to avert famine\nFamine fears and the new death toll are grim milestones in a conflict that began almost two years ago when Hamas attacked Israel.\n- Officials in the Hamas-controlled Gaza strip say the war has now killed 60,000 Palestinians.\n- Israel says 5,000 aid trucks entered Gaza in two months.\n- The new Palestinian toll does not distinguish between fighters and civilians. Thousands more bodies are believed to be buried under rubble.\nCAIRO − A worst-case scenario of famine is unfolding in Gaza and immediate action is needed to avoid widespread death, a hunger monitor warned on Tuesday, as the number of Palestinians reported killed in the conflict with Israel crossed the 60,000 threshold.\nThe hunger alert and the new death toll are grim milestones in a conflict that began almost two years ago when Hamas attacked Israel, sparking an offensive that has laid waste to much of the enclave and ignited hostilities across the region.\nThe alert by the Integrated Food Security Phase Classification (IPC) raised the prospect that the man-made starvation crisis in Gaza could be formally classified as a famine, in the hope that this might raise the pressure on Israel to let in far more food.\nStarvation, malnutrition, disease\nWith international criticism growing, Israel announced steps over the weekend to ease aid access. But the World Food Program (WFP) said July 29 it was not getting the permissions it needed to deliver enough aid since Israel began humanitarian pauses on Sunday.\n\"Mounting evidence shows that widespread starvation, malnutrition, and disease are driving a rise in hunger-related deaths,\" the IPC said, adding that \"famine thresholds\" have been reached for food consumption in most of the Gaza Strip.\nIt said it would quickly carry out the formal analysis that could allow it to classify Gaza as \"in famine.\"\nFor famine to be declared, at least 20% of the population must be suffering extreme food shortages, with one in three children acutely malnourished and two people out of every 10,000 dying daily from starvation or from malnutrition and disease.\nGaza health authorities have been reporting more and more people dying from hunger-related causes. The total stands at 147, among them 88 children, most of whom died in the last few weeks.\nImages of emaciated Palestinian children have shocked the world, with Israel's strongest ally, President Donald Trump, declaring that many people were starving. He promised to set up new \"food centers.\"\nIsrael has denied pursuing a policy of starvation. Foreign Minister Gideon Saar said on Tuesday that the situation in Gaza was \"tough\" but there were lies about starvation there.\nDeadliest conflict\nThe death toll of 60,000 announced by Gaza health authorities, whose figures are often cited by the U.N. and have previously described as reliable by the World Health Organization, underlines this as the deadliest war in the decades-long Israeli-Palestinian conflict.\nThe previous deadliest conflict between Israel and the Hamas Islamist group - which seized control of Gaza in 2007 - was in 2014, when 2,100 Palestinians were killed in Gaza, mostly civilians, while Israel lost 67 soldiers and six civilians.\nIsrael launched its latest offensive in response to Hamas' attacks on October 7, 2023, when militants killed some 1,200 people and took another 251 hostage - Israel's deadliest ever day.\nThe new Palestinian toll does not distinguish between fighters and civilians. Thousands more bodies are believed to be buried under rubble, meaning the true toll is likely to be significantly higher, Palestinian officials and rescue workers say.\nIsraeli airstrikes overnight killed at least 30 Palestinians in Nuseirat camp in central Gaza, Gaza health authorities said. Doctors at Al-Awda Hospital said at least 14 women and 12 children were among the dead.\nThe hospital also said that 13 people had been killed and dozens wounded by Israeli fire along the Salahudeen Road as they waited for aid trucks to roll into Gaza.\nA total of 55 Palestinians were killed in attacks overnight, Gaza health authorities said. The Israeli military did not immediately respond to a request for comment.\nFifty of the hostages seized on October 7 remain in Gaza, of whom 20 are believed to be alive.\nThe latest talks aimed at securing a ceasefire and freeing the hostages collapsed last week. Netanyahu said on Sunday that Israel would keep fighting until the hostages were freed and Hamas' military and governing capabilities destroyed.\nOnly half of food aid approved\nSaar said 5,000 aid trucks had entered Gaza in the last two months, and that Israel would assist those wanting to conduct airdrops - a delivery method that aid groups say is ineffective and tokenistic.\nRoss Smith, a senior regional programme adviser at the World Food Program, told reporters in Geneva by video: \"We're getting approximately 50% of what we're requesting into Gaza since these humanitarian pauses started on Sunday.\n\"We are not going to be able to address the needs of the population unless we can move in the volume that we need.\"\nAfter an 11-week Israeli blockade, limited U.N.-led aid operations resumed on May 19 and a week later the obscure new U.S.-based Gaza Humanitarian Foundation - backed by Israel and the United States - began distributing food aid.\nThe rival efforts have sparked a war of words - pitting Israel, the U.S. and the GHF against the U.N., international aid groups and dozens of governments from around the world.\nIsrael and the U.S. accuse Hamas of stealing aid - which the militants deny - and the U.N. of failing to prevent it. The U.N. says it has not seen evidence of Hamas diverting much aid. Hamas accuses Israel of causing starvation and using aid as a weapon.\nThe IPC said 88% of Gaza was now under evacuation orders or within militarized areas, and was critical of GHF efforts.\nIt said most of the GHF food items \"require water and fuel to cook, which are largely unavailable.\"\nThe IPC's Famine Review Committee said: \"Our analysis of the food packages supplied by the GHF shows that their distribution plan would lead to mass starvation.\"\nGHF said its aid boxes are based on the same ingredient lists used by other aid groups and meet standards for total calories and nutritional value."
    }
  ],
  "argos_summary": "Hamas' chief negotiator is in talks with Egyptian mediators about a potential ceasefire in the ongoing Gaza war, while Israel continues its military operations, including heavy airstrikes on Gaza City. Israeli Prime Minister Netanyahu suggested that Palestinians could leave the enclave, a notion that has drawn international condemnation, likening it to a forced displacement reminiscent of the 1948 Nakba. The humanitarian crisis in Gaza is dire, with reports of widespread starvation and malnutrition affecting the population, as the death toll from the conflict surpasses 60,000, prompting calls for increased aid and a ceasefire.",
  "argos_id": "METWI5K5N"
}