{
  "url": "https://www.latimes.com/world-nation/story/2025-08-14/judge-orders-rfk-jr-s-health-department-to-stop-sharing-medicaid-data-with-deportation-officials",
  "authorsByline": "Amanda Seitz and Kimberly Kindy",
  "articleId": "3da703e1f5024322af0b002eb72c71c8",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/48ae2f1/2147483647/strip/true/crop/5616x2948+0+398/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb8%2F4b%2Ff49109b24672837b98a7f9b487a6%2Fe11324de323641faa1b54f3c55df93e7.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T00:41:17.211000+00:00",
  "addDate": "2025-08-15T00:46:19.850960+00:00",
  "refreshDate": "2025-08-15T00:46:19.850962+00:00",
  "score": 1.0,
  "title": "Judge orders RFK Jr.'s health department to stop sharing Medicaid data with deportation officials",
  "description": "A federal judge has ordered the U.S. Department of Health and Human Services to stop sharing personal data of Medicaid enrollees with deportation officials",
  "content": "Health and Human Services Secretary Robert F. Kennedy Jr. speaks during an event with President Donald Trump on improving Americans’ access to their medical records in the East Room of the White House, Wednesday, July 30, 2025, in Washington.\n\nA federal judge ordered the nation’s health department to stop giving deportation officials access to the personal information — including home addresses — of all 79 million Medicaid enrollees.\n\nThe U.S. Department of Health and Human Services first handed over the personal data on millions of Medicaid enrollees in a handful of states in June. After an Associated Press report identified the new policy, 20 states filed a lawsuit to stop its implementation.\n\nIn July, the Centers for Medicare and Medicaid Services entered into a new agreement that gave the Department of Homeland Security daily access to view the personal data — including Social Security numbers and home address — of all the nation’s 79 million Medicaid enrollees. Neither agreement was announced publicly.\n\nThe extraordinary disclosure of such personal health data to deportation officials in the Trump administration’s far-reaching immigration crackdown immediately prompted the lawsuit over privacy concerns.\n\nThe Medicaid data sharing is part of a broader effort by the Trump administration to provide DHS with more data on migrants. In May, for example, a federal judge refused to block the Internal Revenue Service from sharing immigrants’ tax data with Immigration and Customs Enforcement to help agents locate and detain people living without legal status in the U.S.\n\nThe order, issued by federal Judge Vince Chhabria in California, temporarily halts the health department from sharing personal data of enrollees in those 20 states, which include California, Arizona, Washington and New York.\n\n“Using CMS data for immigration enforcement threatens to significantly disrupt the operation of Medicaid—a program that Congress has deemed critical for the provision of health coverage to the nation’s most vulnerable residents,” Chhabria wrote in his decision, issued on Tuesday.\n\nChhabria, an appointee of President Barack Obama, said that the order will remain in effect until the health department outlines “reasoned decisionmaking” for its new policy of sharing data with deportation officials.\n\nA spokesperson for the federal health department declined to directly answer whether the agency would stop sharing its data with DHS. HHS has maintained that its agreement with DHS is legal.\n\nImmigrants who are not living in the U.S. legally, as well as some lawfully present immigrants, are not allowed to enroll in the Medicaid program that provides nearly free coverage for health services. But federal law requires all states to offer emergency Medicaid, a temporary coverage that pays only for lifesaving services in emergency rooms to anyone, including non-U.S. citizens. Medicaid is a jointly funded program between states and the federal government.\n\nImmigration advocates have said the disclosure of personal data could cause alarm among people seeking emergency medical help for themselves or their children. Other efforts to crack down on illegal immigration have made schools, churches, courthouses and other everyday places feel perilous to immigrants and even U.S. citizens who fear getting caught up in a raid.\n\n“Protecting people’s private health information is vitally important,” Washington state’s Attorney General Nick Brown said in a statement. “And everyone should be able to seek medical care without fear of what the federal government may do with that information.”\n\nSeitz and Kindy write for the Associated Press.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/politics/story/2025-07-28/california-other-states-sue-over-usda-demand-for-info-on-snap-recipients",
    "https://www.latimes.com/california/story/2025-08-08/how-many-citizens-have-been-arrested-in-immigration-crackdown",
    "https://www.latimes.com/world-nation/story/2025-08-01/judge-pauses-trump-administrations-push-to-expand-fast-track-deportations"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Medicaid data",
      "weight": 0.10642185
    },
    {
      "name": "such personal health data",
      "weight": 0.10472047
    },
    {
      "name": "personal data",
      "weight": 0.09836982
    },
    {
      "name": "emergency Medicaid",
      "weight": 0.084885366
    },
    {
      "name": "data",
      "weight": 0.08388739
    },
    {
      "name": "more data",
      "weight": 0.08326334
    },
    {
      "name": "Medicaid enrollees",
      "weight": 0.08317374
    },
    {
      "name": "CMS data",
      "weight": 0.082819484
    },
    {
      "name": "health coverage",
      "weight": 0.08182864
    },
    {
      "name": "health services",
      "weight": 0.07730029
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.94970703125
    },
    {
      "name": "/Health/Public Health/Health Policy",
      "score": 0.8359375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.79638671875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.7939453125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.68408203125
    },
    {
      "name": "/Finance/Insurance/Health Insurance",
      "score": 0.54345703125
    }
  ],
  "sentiment": {
    "positive": 0.04492769,
    "negative": 0.7142032,
    "neutral": 0.24086908
  },
  "summary": "A federal judge has ordered the nation's health department to stop giving deportation officials access to the personal information of all 79 million Medicaid enrollees. The Department of Health and Human Services first shared the personal data on millions of Medicaid enrolees in a handful of states in June, but after a news report revealed the policy, 20 states filed a lawsuit to prevent it. The disclosure of personal data led to concerns about the operation of Medicaid, which is a jointly funded program between states and the federal government. The judge's decision will remain in effect until the health department outlines its new policy.",
  "shortSummary": "A federal judge has ordered the health department to stop sharing Medicaid data with deportation officials, amid privacy concerns and state efforts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "ea75b48d24844ba3b52aa0250340fa24",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/california/story/2025-08-08/how-many-citizens-have-been-arrested-in-immigration-crackdown",
      "text": "As more citizens are swept up in immigration raids, Democrats demand answers\n- Share via\n- A group of 49 Democratic U.S. senators and representatives are demanding the Department of Homeland of Security release details on the arrests, detainment of U.S. citizens caught up in its immigration sweeps.\n- The department reports that no citizens have been deported, though at least three American-born children have been removed from the country, according to a lawsuit.\n- The crackdown is expected to massively expand after Congress approved a $170 billion budget for Immigration and Customs Enforcement.\nAmerican citizens have been increasingly caught up in the immigration crackdown: a 4-year-old boy with cancer deported to Honduras, a doctoral student filming a raid in Hollywood detained for 25 hours, an Illinois man held for 10 hours in detention.\nIncreasingly frustrated that the aggressive tactics are sweeping up American citizens, Democratic members of Congress have been pressing for a full accounting of the citizens detained.\nOn Friday morning 49 Congress members, led by Sens. Elizabeth Warren (D-Mass.), Alex Padilla (D-Calif.), Mark Kelly (D-Ariz.), and Reps. Lou Correa (D-Santa Ana) and Dan Goldman (D-N.Y.), sent letters to the Department of Homeland Security Inspector General Joseph V. Cuffari and two other immigration oversight offices asking them to open an investigation into encounters with American citizens and “determine whether DHS is violating Americans’ civil rights.”\n“ICE policy makes clear that, by law ‘ICE cannot assert its civil immigration enforcement authority to arrest and/or detain a U.S. citizen,” the legislators wrote. “However, in recent high-profile cases, ICE has erroneously arrested U.S. citizens, at times appearing to use violent physical force.”\n“ICE has even deported U.S. citizens: in multiple cases, ICE has deported U.S. citizen children along with their undocumented parents, reportedly against the families’ wishes. Particularly in Latino and Native American communities, Americans increasingly fear that their citizenship will not protect them from being swept up in DHS’s immigration enforcement activities.”\nFor months Democratic members of Congress have been demanding the Trump administration answer pointed questions, to little avail.\nThe letters were sent to Cuffari, Troup Hemenway, acting officer for Civil Rights and Civil Liberties, and Joseph Guy, director for the Office of Immigration Detention Ombudsman. The latter two of those offices have been hollowed out under the Trump administration, which had attempted to abolish them completely.\n“The administration owes the American people answers, particularly as Republicans in Congress just approved record funding for immigration enforcement, which threatens to put even more citizens at risk,” said Warren.\nThe Trump administration has adamantly defended its actions.\n“DHS enforcement operations are highly targeted and are not resulting in the arrest of U.S. citizens,” said department spokeswoman Tricia McLaughlin in response to The Times’ inquiry about the number of Americans detained, arrested and deported under the administration.\n“We do our due diligence. We know who we are targeting ahead of time,” she said. “If and when we do encounter individuals subject to arrest, our law enforcement are trained to ask a series of well-determined questions to determine status and removability. “\nIn the case of Romero, the 4-year old with Stage-4 cancer, DHS said at the time that his mother had a final deportation order and said she chose to be deported with her children. Her lawyers contend the mother, who was arrested during a check-in with immigration officials in Louisiana, was never given a choice and was prohibited from talking to lawyers. They filed a lawsuit last month, along with another mother who also was deported with her 2-year-old citizen daughter.\nJennifer Ibañez Whitlock, a policy expert at the National Immigration Law Center, said Immigration and Customs Enforcement used to publish data related to citizens booked-in and arrested, but that was mandated through appropriations and is no longer required.\nCurrently available data show that in fiscal year 2025 there were no citizens deported and seven arrested. There were 3,700 parents of citizens removed and 6,341 arrested. The data are aggregated and do not show the location, reason for enforcement, outcome or length of detention — as lawmakers are asking for.\nWhitlock suspects the data are an undercount based on the number of cases she has seen in the media.\nThe immigration crackdown is expected to expand considerably. Congress approved a $170-billion budget for border and immigration enforcement earlier this summer, giving the agency the largest boost in generations. President Trump wants 10,000 new U.S. Immigration and Customs Enforcement officers and 3,000 new Border Patrol agents to be hired.\nImmigrant advocates fear with more capabilities, enforcement levels will explode and exacerbate encounters with citizens. Already they said, the White House has given agencies wider latitude than they had before.\n“We are seeing the agency unleashed like never before,” said Jesse Franzblau, associate director of policy of National Immigrant Justice Center. “ICE is just picking up people, whoever is nearby and there is a lot of racial profiling happening.”\nHe points to Julio Noriega, a 54-year-old U.S. citizen who was among those picked up in sweeps in early January in Chicago and placed in handcuffs.\nNoriega had been looking for work when agents picked him up and took him to an ICE processing center before looking inside his wallet, according to court documents. The Center and the ACLU of Illinois attorneys said he was detained for 10 hours and then released without his arrest ever being documented. Lawyers argued DHS violated a 2022 settlement requiring agents have probable cause to believe that a person is in the country illegally before arresting them and then reporting it.\n“We don’t have any transparency about warrantless arrests, we don’t have transparency about how many U.S. citizens are being swept up and being arrested, “ he said. The data on citizen detained, he said, aren’t always being captured.\n“We don’t know how many U.S. citizens are being detained beyond the media accounts,” he said. “It’s incumbent on these agencies to produce this information. These are serious issues.”\nThe letter asks the oversight bodies to provide by Sept. 5 detailed information on stops, arrests, detentions and deportation of citizens including a breakdown by month, location, reason for enforcement action, outcome, and length of time in ICE custody.\n“It should send chills down everyone’s spine if just one U.S. citizen is detained without due process during an ICE raid,” said Padilla. “This is not a question of rights of immigrants versus rights of Americans, it’s about ensuring that due process is afforded and protected for everyone, which the 5th Amendment guarantees.”\nDebrorah Fleischaker, the former chief of staff at U.S. Immigration and Customs Enforcement said verifying somebody’s citizenship can sometimes be complicated, but officials should be explaining how that works.\n“It’s not necessarily automatically inappropriate to have arrested or held a U.S. citizen, but they certainly should not be deporting them,” she said.\n“My guess is that they are encountering U.S citizens much more often than they have historically just because the scope of their interior enforcement activities are so much larger than they ever have been.”\nEduardo Casas, an attorney for Job Garcia, the doctoral student who was detained after filming a raid at a Home Depot in Hollywood, said he has been asking immigration officials for information about citizens detained and arrested during the Los Angeles sweeps this summer, but has so far been rebuffed.\n“They are not being transparent,” said Eduardo Casas, an attorney with the Mexican American Legal Defense and Educational Fund. “We know that citizens are being caught up in this broader enforcement paradigm that centers around mass deportation. The way they try to accomplish mass deportation is by pushing the boundaries of civil liberties in the same way that they’ve done for people like Job.”\nCasas said he interviewed other citizens present during raids and a pattern emerged. People filming angered agents, who then arrested them and took them to detention centers.\n“They’ll take people as far as detention centers, and then say that you may be charged, and then they let them go,” he said. “It’s also not always a very formal process.”"
    },
    {
      "url": "https://www.latimes.com/politics/story/2025-07-28/california-other-states-sue-over-usda-demand-for-info-on-snap-recipients",
      "text": "California, other states sue over USDA demand for SNAP recipients’ data\n- Share via\n- Trump administration officials say the new data sharing requirements are meant to help prevent waste, fraud and abuse.\n- California and other states questioned the administration’s intentions and said the data sharing would put vulnerable people at risk.\nCalifornia and a coalition of other liberal-led states filed a federal lawsuit Monday challenging the U.S. Department of Agriculture’s recent demand that they turn over the personal information of millions of people receiving federal food assistance through the Supplemental Nutrition Assistance Program.\nUSDA Secretary Brooke Rollins informed states this month that they would have to transmit the data to the USDA’s Food and Nutrition Service to comply with an executive order by President Trump. That order demanded that Trump’s agency appointees receive “full and prompt access” to all data associated with federal programs, so that they might identify and eliminate “waste, fraud, and abuse.”\nLast week, USDA officials informed state SNAP directors that the deadline for submitting the data is Wednesday and that failure to comply “may trigger noncompliance procedures” — including the withholding of funds.\nIn announcing the states’ lawsuit Monday, California Atty. Gen. Rob Bonta said the “unprecedented” demand “violates all kinds of state and federal privacy laws” and “further breaks the trust between the federal government and the people it serves.”\nThe Trump administration barred undocumented immigrants from Head Start and other federal benefit programs — a move California Atty. Gen. Rob Bonta called ‘cruel.’\nBonta’s office noted that states have administered the equivalent of SNAP benefits — formerly known as food stamps — for 60 years. It said that California alone receives “roughly $1 billion a year” to administer the program in the state and that “any delay in that funding could be catastrophic for the state and its residents who rely on SNAP to put food on the table.”\nThe USDA has demanded data for all current and former SNAP recipients since the start of 2020, including “all household group members names, dates of birth, social security numbers, residential and mailing addresses,” as well as “transactional records from each household” that show the dollar amounts they spent and where. The USDA said it may also collect information about people’s income.\nMeanwhile, a Privacy Impact Assessment published by the agency showed that it also is collecting data on people’s education, employment, immigration status and citizenship.\nThe USDA officials have said the initiative will save taxpayers money by eliminating “information silos” that allow inefficiencies and fraud to fester in federal programs.\n“It is imperative that USDA eliminates bureaucratic duplication and inefficiency and enhances the government’s ability not only to have point-in-time information but also to detect overpayments and fraud,” Rollins wrote in a July 9 letter to the states.\nThe Trump administration, which is pursuing what the president has called the biggest mass deportation of undocumented immigrants in the nation’s history, has requested sensitive data from other federal programs and services — including Medicaid and the Internal Revenue Service — to share with immigration officials.\nThat has raised alarm among Democrats, who have said that tying such services to immigration enforcement will put people’s health at risk and decrease tax revenue. California sued the Trump administration this month for sharing Medicaid data with Immigration and Customs Enforcement.\nOn Monday, Bonta raised similar alarms about the administration’s demand for SNAP data, questioning what it will do with the information and how families that rely on such assistance will react. His office said it appeared to be “the next step” in the administration’s anti-immigrant campaign.\n“President Trump continues to weaponize private and sensitive personal information — not to root out fraud, but to create a culture of fear where people are unwilling to apply for essential services,” Bonta said. “We’re talking about kids not getting school lunch; fire victims not accessing emergency services; and other devastating, and deadly, consequences.”\nBonta said that the USDA demand for SNAP benefits data is illegal under established law, and that California “will not comply” while it takes the administration to court.\n“The president doesn’t get to change the rules in the middle of the game, no matter how much he may want to,” Bonta said. “While he may be comfortable breaking promises to the American people, California is not.”\nThe new data collection does not follow established processes for the federal government to audit state data without collecting it wholesale. During a recently concluded public comment period, Bonta and other liberal attorneys general submitted a comment arguing that the data demand violates the Privacy Act.\n“USDA should rethink this flawed and unlawful proposal and instead work with the States to improve program efficiency and integrity through the robust processes already in place,” they wrote.\nLast week, California and other states sued the Trump administration over new rules barring undocumented immigrants from accessing more than a dozen other federally funded benefit programs, including Head Start, short-term and emergency shelters, soup kitchens and food banks, healthcare services and adult education programs.\nThe states did not include USDA in that lawsuit despite its issuing a similar notice, writing that “many USDA programs are subject to an independent statutory requirement to provide certain benefits programs to everyone regardless of citizenship,” which the department’s notice said would continue to apply.\nBonta announced Monday’s lawsuit along with New York Atty. Gen. Letitia James. Joining them in the lawsuit were Kentucky Gov. Andy Beshear and the attorneys general of Arizona, Colorado, Connecticut, the District of Columbia, Delaware, Hawaii, Illinois, Maine, Maryland, Massachusetts, Michigan, Minnesota, New Jersey, New Mexico, Oregon, Rhode Island, Washington and Wisconsin, as well as the state of Kentucky."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-01/judge-pauses-trump-administrations-push-to-expand-fast-track-deportations",
      "text": "Judge pauses Trump administration’s push to expand fast-track deportations\n- Share via\nWASHINGTON — A federal judge agreed on Friday to temporarily block the Trump administration’s efforts to expand fast-track deportations of immigrants who legally entered the U.S. under a process known as humanitarian parole — a ruling that could benefit hundreds of thousands of people.\nU.S. District Judge Jia Cobb in Washington, D.C., ruled that the Department of Homeland Security exceeded its statutory authority in its effort to expand “expedited removal” for many immigrants. The judge said those immigrants are facing perils that outweigh any harm from “pressing pause” on the administration’s plans.\nThe case “presents a question of fair play” for people fleeing oppression and violence in their home countries, Cobb said in her 84-page order.\n“In a world of bad options, they played by the rules,” she wrote. “Now, the Government has not only closed off those pathways for new arrivals but changed the game for parolees already here, restricting their ability to seek immigration relief and subjecting them to summary removal despite statutory law prohibiting the Executive Branch from doing so.”\nFast-track deportations allow immigration officers to remove somebody from the U.S. without seeing a judge first. In immigration cases, parole allows somebody applying for admission to the U.S. to enter the country without being held in detention.\nImmigrants’ advocacy groups sued Homeland Security Secretary Kristi Noem to challenge three recent DHS agency actions that expanded expedited removal. A surge of arrests at immigration courts highlights the lawsuit’s high stakes.\nThe judge’s ruling applies to any non-citizen who has entered the U.S. through the parole process at a port of entry. She suspended the challenged DHS actions until the case’s conclusion.\nCobb said the case’s “underlying question” is whether people who escaped oppression will have the chance to “plead their case within a system of rules.”\n“Or, alternatively, will they be summarily removed from a country that — as they are swept up at checkpoints and outside courtrooms, often by plainclothes officers without explanation or charges — may look to them more and more like the countries from which they tried to escape?” she added.\nA plaintiffs’ attorney, Justice Action Center legal director Esther Sung, described the ruling as a “huge win” for hundreds of thousands of immigrants and their families. Sung said many people are afraid to attend routine immigration hearings out of fear of getting arrested.\n“Hopefully this decision will alleviate that fear,” Sung said.\nSince May, U.S. Immigration and Customs Enforcement officers have positioned themselves in hallways to arrest people after judges accept government requests to dismiss deportation cases. After being arrested, the government renews deportation proceedings but under fast-track authority.\nPresident Trump sharply expanded fast-track authority in January, allowing immigration officers to deport someone without first seeing a judge. Although fast-track deportations can be put on hold by filing an asylum claim, people may be unaware of that right and, even if they are, can be swiftly removed if they fail an initial screening.\n“Expedited removal” was created under a 1996 law and has been used widely for people stopped at the border since 2004. Trump attempted to expand those powers nationwide to anyone in the country less than two years in 2019 but was held up in court. His latest efforts amount to a second try.\nICE exercised its expanded authority sparingly at first during Trump’s second term but has since relied on it for aggressive enforcement in immigration courts and in “workplace raids,” according to plaintiffs’ attorneys.\nKunzelman and Spagat write for the Associated Press. Spagat reported from San Diego."
    }
  ],
  "argos_summary": "A federal judge has ordered the U.S. Department of Health and Human Services to cease sharing personal information of Medicaid enrollees with deportation officials, following a lawsuit from 20 states concerned about privacy violations. The ruling highlights the potential disruption to Medicaid operations and the chilling effect on immigrants seeking medical care. Meanwhile, Democratic lawmakers are pressing for accountability regarding the treatment of U.S. citizens caught in immigration enforcement actions, as reports of citizens being detained and deported alongside undocumented individuals have raised significant civil rights concerns.",
  "argos_id": "MHSH4XA83"
}