{
  "url": "https://www.sfchronicle.com/sports/article/broncos-edge-rusher-nik-bonitto-misses-practice-20818301.php",
  "authorsByline": "By PAT GRAHAM, AP Sports Writer",
  "articleId": "fc525063a8434e5b8d8a1639caf26002",
  "source": {
    "domain": "sfchronicle.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T21:56:56+00:00",
  "addDate": "2025-08-14T22:18:05.280357+00:00",
  "refreshDate": "2025-08-14T22:18:05.280361+00:00",
  "score": 1.0,
  "title": "Broncos edge rusher Nik Bonitto misses practice after bone spur procedure, expected back next week",
  "description": "Broncos edge rusher Nik Bonitto has missed a joint practice with Arizona after having a bone spur removed from his foot. Coach Sean Payton says Bonitto could return next week. Bonitto, entering the...",
  "content": "Bonitto, who is entering the final year of his rookie contract, could return to the field next week. His recent procedure left him with three stitches in his foot, coach Sean Payton said after practice on a sweltering day at the Broncos' team facility.\n\n“It just made a lot of sense,” Payton said of taking care of the bone spur now rather than trying to manage it through the regular season.\n\nBonitto appears to be next in line for a new contract after the Broncos finalized deals for receiver Courtland Sutton and defensive lineman Zach Allen. Asked if his star pass rusher's absence had anything to do with his contract, Payton opened up about Bonitto's bone-spur issue — and his own.\n\n“I had two spurs removed on my big toe, and that hurt like you know what,” Payton said. \"I’m still recovering. It’s better. His is something that we just had done, and we knew that he was going to miss this week.\n\n“He’ll be up and at it next week. He’s been fantastic. The days he’s missed has been this simple bone spur in a unique spot on the top of the foot. It’s not weight bearing.”\n\nBonitto is coming off a season in which he was named second-team All-Pro after leading the team with 13 1/2 sacks.\n\nIt's the second straight week the Broncos have taken part in a joint practice. That's why Payton said he's going to sit most of the starters in Saturday's preseason game against the Cardinals, including quarterback Bo Nix.\n\nHis plan is to play the starters for roughly 10 plays in the final preseason game on Aug. 23 at New Orleans.\n\nNotes: Payton said tight end Nate Adkins will miss some time in the regular season after undergoing a procedure on his ankle. “There weren’t any other things that they noticed,” Payton said. “It was a smart decision.”",
  "medium": "Article",
  "links": [
    "https://apnews.com/hub/nfl"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "bone spur procedure",
      "weight": 0.10846811
    },
    {
      "name": "Broncos edge rusher Nik Bonitto",
      "weight": 0.09503999
    },
    {
      "name": "Sean Payton",
      "weight": 0.09168113
    },
    {
      "name": "coach Sean Payton",
      "weight": 0.0916261
    },
    {
      "name": "Payton",
      "weight": 0.0881774
    },
    {
      "name": "next week",
      "weight": 0.07874304
    },
    {
      "name": "Nik Bonitto",
      "weight": 0.077852696
    },
    {
      "name": "Broncos",
      "weight": 0.07190471
    },
    {
      "name": "Bonitto",
      "weight": 0.0719036
    },
    {
      "name": "receiver Courtland Sutton",
      "weight": 0.06876715
    }
  ],
  "topics": [
    {
      "name": "Football"
    },
    {
      "name": "NFL"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.970703125
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.95166015625
    }
  ],
  "sentiment": {
    "positive": 0.09669373,
    "negative": 0.57747084,
    "neutral": 0.3258354
  },
  "summary": "Bronx edge rusher Nik Bonitto, who is entering the final year of his rookie contract, may return to the field next week after a bone spur procedure left him with three stitches in his foot. Coach Sean Payton explained that Bonitto's absence was not directly related to his contract, but to avoid managing the bone spur during the regular season. Bonitto is expected to return to play in the final preseason game against the Cardinals, where most of the starters will be sat out due to the injury.",
  "shortSummary": "Denver Broncos' Nik Bonitto is out for a week after a bone spur procedure, potentially paving the way for a new contract, with his return expected next week.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "b55cd51cdbbf496a8bdbd9e0376d9fb1",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Bonitto, entering the final year of his rookie contract, is expected to return to practice next week after undergoing a procedure for a bone spur in his foot. Coach Sean Payton emphasized the importance of addressing the issue now rather than during the regular season. Bonitto, who led the Broncos with 13 1/2 sacks last season and was named second-team All-Pro, is seen as a key player for the team. Additionally, tight end Nate Adkins will miss some regular season time following an ankle procedure.",
  "argos_id": "NCRWI32O3"
}