{
  "url": "https://www.aljazeera.com/news/2025/8/14/lawyers-in-brazil-submit-final-statement-for-bolsonaro-in-coup-trial",
  "authorsByline": "Al Jazeera",
  "articleId": "0a370afcc46e49abb67fa134eaf800b6",
  "source": {
    "domain": "aljazeera.com",
    "paywall": false,
    "location": {
      "country": "qa",
      "city": "Doha",
      "coordinates": {
        "lat": 25.2856329,
        "lon": 51.5264162
      }
    }
  },
  "imageUrl": "https://www.aljazeera.com/wp-content/uploads/2025/07/AP25198571584452-1753146742.jpg?resize=1920%2C1440",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:12:43+00:00",
  "addDate": "2025-08-14T19:18:16.679981+00:00",
  "refreshDate": "2025-08-14T19:18:16.679984+00:00",
  "score": 1.0,
  "title": "Lawyers in Brazil submit final statement for Bolsonaro in coup trial",
  "description": "Former president denies involvement in alleged effort to overturn his loss in the 2022 election.",
  "content": "Former president denies involvement in alleged effort to overturn his loss in the 2022 election.\n\nLawyers have submitted a final statement on behalf of Brazilian ex-President Jair Bolsonaro in a trial focused on his alleged role in a plot to stay in power despite losing the 2022 election.\n\nIn a statement submitted on Wednesday evening, Bolsonaro’s legal representatives denied the charges against him and said that prosecutors had presented no convincing evidence.\n\n“There is no way to convict Jair Bolsonaro based on the evidence presented in the case, which largely demonstrated that he ordered the transition … and assured his voters that the world would not end on December 31st,” the document states.\n\nThe right-wing former president faces up to 12 years in prison if convicted of attempting to mount a coup after losing a presidential election to left-wing rival and current President Luiz Inacio Lula da Silva.\n\nBolsonaro, who raised alarm in the months leading up to the election by casting doubt on the voting process, has denied involvement in the plot, which allegedly included plans for Lula’s assassination.\n\nThe former leader’s legal representatives say the fact that he authorised the transition contradicts the coup allegations.\n\n“This is evidence that eliminates the most essential of the accusatory premises,” they said.\n\nProsecutor-General Paulo Gonet submitted final arguments in July, citing handwritten notes, digital files, message exchanges, and spreadsheets that he said show details of a conspiracy to suppress democracy.\n\nFollowing Bolsonaro’s election loss, crowds of his supporters gathered outside of military bases, calling on the armed forces to intervene and prevent Lula from taking office. A group of Bolsonaro’s supporters also stormed federal buildings in the capital of Brasilia on January 8, 2023. Some drew parallels to a military coup in the 1960s that marked the beginning of a decades-long period of dictatorship, for which Bolsonaro himself has long expressed fondness.\n\nBolsonaro and his allies, including United States President Donald Trump, have depicted the trial as a politically motivated “witch hunt”.\n\nA recent survey conducted by Datafolha, a Brazilian polling institute, found that more than 50 percent of Brazilians agree with the court’s decision to place Bolsonaro under house arrest in August. The survey also found that a majority believe that Supreme Court Justice Alexandre de Moraes, a frequent target of right-wing ire and central figure in the trial, is following the law.\n\nRespondents also largely disagreed with the claim that Bolsonaro was being persecuted for political reasons, with 39 percent in agreement and 53 percent in disagreement.\n\nSpeaking from the White House on Thursday, Trump said Bolsonaro was an “honest man” and the victim of an attempted “political execution”.\n\nThe Trump administration has mounted a pressure campaign to push the court to drop Bolsonaro’s case, sanctioning De Moraes and announcing severe sanctions on Brazilian exports to the US. That move has met anger in Brazil and been depicted as an attack on Brazilian sovereignty.",
  "medium": "Article",
  "links": [
    "https://www.aljazeera.com/news/2025/8/3/rallies-held-in-brazil-in-support-of-embattled-bolsonaro-facing-legal-peril",
    "https://www.aljazeera.com/news/2025/7/17/brazils-lula-slams-trump-says-there-is-no-logic-to-us-tariff-threat",
    "https://www.aljazeera.com/news/2025/7/15/bolsonaro-tried-to-incite-insurrection-prosecutor-tells-brazil-top-court",
    "https://www.aljazeera.com/news/2025/1/9/brazil-marks-the-anniversary-of-the-january-8-attack-on-its-capital",
    "https://www.aljazeera.com/news/2025/8/4/brazil-supreme-court-justice-orders-house-arrest-of-embattled-bolsonaro",
    "https://www.aljazeera.com/news/2025/7/30/us-sanctions-brazils-supreme-court-judge-overseeing-case-against-bolsonaro"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Jair Bolsonaro",
      "weight": 0.09963851
    },
    {
      "name": "Bolsonaro",
      "weight": 0.09713022
    },
    {
      "name": "Brazilian ex-President Jair Bolsonaro",
      "weight": 0.09482129
    },
    {
      "name": "coup trial",
      "weight": 0.07130035
    },
    {
      "name": "final statement",
      "weight": 0.062346507
    },
    {
      "name": "Bolsonaro’s election loss",
      "weight": 0.061287817
    },
    {
      "name": "United States President Donald Trump",
      "weight": 0.05980201
    },
    {
      "name": "Brazilian exports",
      "weight": 0.059504986
    },
    {
      "name": "Supreme Court Justice Alexandre de Moraes",
      "weight": 0.059325032
    },
    {
      "name": "Luiz Inacio Lula da Silva",
      "weight": 0.059022844
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9921875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.93505859375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.93408203125
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.9150390625
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.90380859375
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.607421875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.52001953125
    }
  ],
  "sentiment": {
    "positive": 0.05670584,
    "negative": 0.7253871,
    "neutral": 0.21790709
  },
  "summary": "Brazil's former President, Jair Bolsonaro, has denied involvement in an alleged coup attempt to overturn his loss in the 2022 election. His lawyers have submitted a final statement on behalf of the former president, stating that there is no way to convict him based on the evidence presented. The trial is focusing on Bolsonar's alleged role in a plot to stay in power despite losing the election. If convicted, he could face up to 12 years in prison. Bolsonara's supporters have protested against the trial, comparing it to a military coup in the 1960s. The US government has been trying to drop the case, sanctioning Supreme Court Justice Alexandre de Moraes and imposing severe sanctions on Brazilian exports to the US.",
  "shortSummary": "Lawyers for ex-President Jair Bolsonaro, accused of plotting to seize power despite losing the 2022 election, submit a final statement denying the charges.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4668bbea41fb49bf86d16caf2763889d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.aljazeera.com/news/2025/7/30/us-sanctions-brazils-supreme-court-judge-overseeing-case-against-bolsonaro",
      "text": "Brazil slams ‘unacceptable’ US sanctions on judge overseeing Bolsonaro case\nThe US froze Judge de Moraes’s assets, citing his role in arbitrary detentions, censorship, and cases against Bolsonaro.\nBrazil has criticised the United States Department of the Treasury’s decision to impose sanctions on Supreme Court Justice Alexandre de Moraes over alleged suppression of freedom of expression and the ongoing trial of former Brazilian President Jair Bolsonaro.\nBrazil’s President Luiz Inacio Lula da Silva also released a statement on Wednesday condemning what he called the “US government’s interference in the Brazilian justice system”.\nRecommended Stories\nlist of 3 itemsBrazil’s Supreme Court declines to arrest Bolsonaro over social media ban\nUS restricts visas for Brazilian officials over Bolsonaro ‘witch-hunt’\n“The Brazilian government stands in solidarity with [de Moraes], who is the target of sanctions motivated by the actions of Brazilian politicians who betray our country and our people in defence of their own interests,” President Lula said, without naming Bolsonaro.\nDe Moraes is overseeing a case against the former president, who stands accused of masterminding a plot to orchestrate a coup and stay in power after his 2022 election defeat to Lula.\nAnnouncing sanctions against de Moraes earlier on Wednesday, US Treasury Secretary Scott Bessent said the Brazilian Supreme Court justice had “taken it upon himself to be judge and jury in an unlawful witch-hunt”.\n“De Moraes is responsible for an oppressive campaign of censorship, arbitrary detentions that violate human rights, and politicised prosecutions – including against former President Jair Bolsonaro,” Bessent said.\nDe Moraes was sanctioned under the Global Magnitsky Act, which allows the US to impose economic penalties against foreigners it considers to have a record of corruption or human rights abuses.\nBessent’s statement accused de Moraes of “serious human rights abuse[s]” for targeting opposition politicians – including Bolsonaro – journalists, newspapers, and US and international companies, including social media platforms.\nThe decision orders the freezing of any assets or property de Moraes may have in the US.\nUS President Donald Trump previously tied tariffs on Brazil to what he called a “witch-hunt” against his right-wing ally.\nIn a letter in mid-July announcing a 50-percent tariff on Brazilian goods, which will start on August 6, Trump opened the message with criticism of Bolsonaro’s prosecution. Trump has since softened the blow by excluding key sectors in Brazil, such as aircraft, energy and orange juice, from the heaviest levies.\n“We’re not facing the worst-case scenario,” Brazilian Treasury Secretary Rogerio Ceron told reporters on Wednesday.\nResponding to the 50-percent tariff in his statement on Wednesday, President Lula criticised Washington’s “unjustifiable” attempts to use “political arguments to validate the trade measures” against his country.\n“The political motivation behind the measures against Brazil undermines national sovereignty and the historical relationship between the two countries,” he said.\nOn July 18, Brazilian police swooped on Bolsonaro’s home and political headquarters, while de Moraes ordered the former president to wear an ankle bracelet and stop using social media over allegations he courted interference in his trial from Trump.\nHours later, Washington imposed US visa restrictions on de Moraes, his family and other unnamed court officials, escalating tensions with the government of Latin America’s largest economy.\nBolsonaro has denied attempting to overthrow the government, but has acknowledged taking part in meetings aimed at reversing the election’s outcome."
    },
    {
      "url": "https://www.aljazeera.com/news/2025/7/17/brazils-lula-slams-trump-says-there-is-no-logic-to-us-tariff-threat",
      "text": "Brazil’s Lula slams Trump, says there is no ‘logic’ to US tariff threat\nBrazilian president says that Donald Trump was elected to lead the US, not to be ‘the emperor of the world’.\nBrazilian President Luiz Inacio Lula da Silva has said that his country will not take instructions from the United States after US President Donald Trump threatened Brazil with 50 percent tariffs and called for an end to the trial of right-wing ally Jair Bolsonaro.\nIn an interview with CNN on Thursday, President Lula said that the tariffs have no “logic” but that he does not believe there is a “crisis” in relations between the US and his country as of yet.\nRecommended Stories\nlist of 3 itemsWhat’s behind Trump’s 50 percent tariff for Brazil despite trade surplus?\nTrump’s new Brazil tariffs could raise US beef prices\n“For me, it was a surprise, not only the value of that tariff, but also how it was announced, the way it was announced,” Lula said. “We cannot have President Trump forgetting that he was elected to govern the US, not to be the emperor of the world.”\nThe US president’s heavy-handed approach to economic relations with other countries has chafed foreign leaders such as Lula, who has expressed frustration at what he sees as Trump’s efforts to dictate terms to Brazil on matters of trade and domestic judicial proceedings.\nBolsonaro, the former president of Brazil who has close ties with Trump and his family, is currently on trial for alleged efforts to mount a coup and reverse Lula’s victory over him in the 2022 election.\nTrump, who also faced legal trouble stemming from his efforts to remain in office after losing an election, has called the trial a “witch hunt” and demanded that it come to an end. He has recently done the same for another right-wing ally, Israeli Prime Minister Benjamin Netanyahu.\n“The judiciary branch of power in Brazil is independent. The president of the republic has no influence whatsoever,” Lula said, stating that Bolsonaro “is not being judged personally”, but “being judged by the acts he tried to organise a coup d’etat”.\nThe US has also warned Brazil that it will be penalised with higher tariffs if it continues its work as a leading member of BRICS, a coalition of developing economies that have sought to promote alternatives to the US-backed global financial system.\nTrump has attacked the group for “anti-Western priorities” and threatened higher tariffs for any countries involved with the bloc.\nIn Latin America, where the US has a long history of heavy-handed involvement in the domestic affairs of various nations, Trump’s threats and blunt use of US economic leverage have sparked anger.\n“Brazil is to take care of Brazil and take care of the Brazilian people, and to take not to take care of the interests of the others,” Lula said.\n“Brazil will not accept anything imposed on it. We accept negotiation and not imposition.”"
    },
    {
      "url": "https://www.aljazeera.com/news/2025/8/3/rallies-held-in-brazil-in-support-of-embattled-bolsonaro-facing-legal-peril",
      "text": "Rallies held in Brazil in support of embattled Bolsonaro facing legal peril\nThe ex-president, accused of seeking to overturn the 2022 election that he lost, has been backed by US President Donald Trump.\nSupporters of former far-right Brazilian President Jair Bolsonaro have rallied across the main cities of the country against the Supreme Court coup trial that could land the ex-leader in prison for years.\nProtesters in Sao Paolo, Rio de Janeiro and other cities on Sunday carried Brazilian and the United States flags, in an apparent reference to United States President Donald Trump’s support for a staunch ally.\nRecommended Stories\nlist of 4 itemsProtesters demonstrate against Trump’s steep tariffs in Brazil\nBolsonaro’s son blasts top Brazilian court official over assets freeze\nBrazil’s Supreme Court declines to arrest Bolsonaro over social media ban\nThey also held banners with Bolsonaro’s and Trump’s pictures on them as they shouted slogans.\nBolsonaro is accused of seeking to overturn the 2022 election won by his left-wing opponent, current President Luiz Inacio Lula da Silva.\nBolsonaro supporters stormed Brazil’s congress in January 2023, ransacking the chambers and attacking police, in violent scenes that evoked Trump supporters’ attack on the US Capitol two years before.\nA Brazilian general has given evidence that the alleged plotters also wanted to assassinate leftist Lula and several other public officials.\nThe prosecution told the court that former army officer Bolsonaro and seven others were guilty of participating in “armed criminal association” and had sought to “violently overthrow the democratic order”.\nA coup conviction carries a sentence of up to 12 years. A conviction on that and other charges could bring decades behind bars for Bolsonaro.\nThe former president has repeatedly denied the allegations and asserted that he is the target of political persecution.\n‘A witch hunt’\nBolsonaro says he is the victim of political persecution, echoing Trump’s defence when the US president faced criminal charges before his White House return.\nAl Jazeera’s Monica Yanakiew, reporting from Sao Paolo, said that protesters were thanking Trump for his support.\n“There are a lot of American flags here and people are saying ‘Thank you Trump’,” she said.\n“They are thanking President Trump for sanctioning Brazil,” Yanakiew added.\nTrump has slammed the trial a “witch hunt” and his Treasury Department has sanctioned Brazil’s Supreme Court Justice Alexandre de Moraes in response.\nBrazil has strongly criticised the US decision to impose sanctions on de Moraes.\nTrump has openly admitted he is punishing Brazil for prosecuting his political ally Bolsonaro. He also signed an executive order slapping 50 percent tariffs on Brazilian imports, citing Bolsonaro’s “politically motivated persecution.”\nProtesters gathered on the streets of Brazil on Friday to denounce Trump for the steep tariffs he imposed on the country’s exports. The demonstrations erupted in cities like Sao Paulo and Brasilia, as residents voiced their anger on the first day of Trump’s latest tariff campaign.\nBrazil is slated to see some of the highest US tariffs in the world. The tariff is due to enter into force on August 6."
    },
    {
      "url": "https://www.aljazeera.com/news/2025/8/4/brazil-supreme-court-justice-orders-house-arrest-of-embattled-bolsonaro",
      "text": "Brazil Supreme Court orders house arrest of former President Bolsonaro\nJustice Alexandre de Moraes rules Bolsonaro violated pre-trial precautionary measures imposed by the court.\nBrazil’s Supreme Court has issued a house arrest order for former President Jair Bolsonaro, who is standing trial for allegedly plotting a coup.\nThe decision, issued on Monday, comes a day after protests in support of the former far-right president were held across Brazil.\nRecommended Stories\nlist of 3 itemsRallies held in Brazil in support of embattled Bolsonaro facing legal peril\nUS appeals court hears arguments about legality of Trump tariffs\nBolsonaro is accused of seeking to overturn the 2022 election, won by his left-wing opponent and current President Luiz Inacio Lula da Silva.\nA media representative for Bolsonaro confirmed that police placed him under house arrest on Monday evening at his Brasilia residence. The police also seized his mobile phone. Supporters of the former president soon gathered outside the residential development where he lives to show their support.\nBolsonaro’s lawyers said in a statement that an appeal against the decision would be lodged, arguing that the former president had not violated any court order.\nThe house arrest order was issued by Justice Alexandre de Moraes, who is facing sanctions by the administration of United States President Donald Trump for overseeing the case against Bolsonaro.\nMoraes said Bolsonaro had violated precautionary measures imposed by the court restricting the former president’s social media use and political messaging.\nThe prosecution accuses Bolsonaro of leading an armed criminal organisation, attempting to stage a coup and attempting a violent abolition of the democratic rule of law, aggravated damage and deterioration of listed heritage.\nA coup conviction carries a sentence of up to 12 years.\nThe former president’s supporters stormed and ransacked the National Congress and other state institutions in January 2023 to reject Lula’s victory. After his defeat weeks earlier, Bolsonaro had declined to publicly concede his loss.\nBolsonaro forcefully rejects the allegations against him, describing his prosecution as a witch-hunt.\nMoraes said in his decision on Monday that the former president was posting content on the social media channels of his three lawmaker sons.\nThe judge added that Bolsonaro has spread messages with “a clear content of encouragement and instigation to attacks against the Supreme Court and a blatant support for foreign intervention in the Brazilian Judiciary”.\nIn July, Moraes froze the assets of Bolsonaro’s son, Eduardo, on suspicion that the funds are being used to lobby the Trump administration against the Brazilian government.\nEduardo lashed out against Moraes, accusing him of acting like a dictator.\n“If he thinks this will make me stop, I make it clear: I will not be intimidated, and I will not be silenced. I prepared myself for this moment,” the former president’s son said in a social media post last month.\n“This is just another demonstration of abuse of power and confirms everything I have been denouncing in Washington and to authorities worldwide.”\nThe house arrest ruling will keep Bolsonaro under ankle monitoring and allow only his relatives and lawyers to visit him. All mobile phones from his home will also be seized.\nThe prosecution of Bolsonaro has caused a deep diplomatic rift between Brazil and the Trump administration.\nLast month, Trump imposed 50 percent tariffs on Brazil, directly tying the tariffs to the trial of his fellow right-wing politician Bolsonaro. Then, last week, the US administration imposed sanctions against Moraes, accusing him of “arbitrary detentions that violate human rights”.\nPresident Lula has rebuked the US sanctions as “unacceptable”.\n“The Brazilian government stands in solidarity with [Moraes], who is the target of sanctions motivated by the actions of Brazilian politicians who betray our country and our people in defence of their own interests,” Lula said, referring to Bolsonaro.\nThe US State Department swiftly condemned the decision to place Bolsonaro under house arrest on Monday.\n“Justice Moraes, now a US-sanctioned human rights abuser, continues to use Brazil’s institutions to silence opposition and threaten democracy,” the department’s Bureau of Western Hemisphere Affairs said in a post on X.\n“Putting even more restrictions on Jair Bolsonaro’s ability to defend himself in public is not a public service,” it added."
    },
    {
      "url": "https://www.aljazeera.com/news/2025/7/15/bolsonaro-tried-to-incite-insurrection-prosecutor-tells-brazil-top-court",
      "text": "Bolsonaro tried to ‘incite insurrection’, prosecutor tells Brazil top court\nFormer Brazilian president says he never violated democracy, rejects coup attempt accusations as a ‘witch hunt’.\nBrazil’s chief prosecutor has called for a guilty verdict in the case of far-right former President Jair Bolsonaro, who has denied accusations of leading an alleged coup plot.\n“The evidence is clear: the defendant acted systematically, throughout his mandate and after his defeat at the polls, to incite insurrection and the destabilisation of the democratic rule of law,” Prosecutor-General Paulo Gonet said in a 517-page document released late on Monday.\nRecommended Stories\nlist of 3 itemsTrump slaps 30% tariffs on all goods from EU and Mexico\nTrump singles out Brazil for 50 percent tariffs over Bolsonaro trial\nBolsonaro is accused of seeking to overturn the 2022 election in which he was defeated by a left-wing rival.\n“All the accusations are false. I never violated democracy or the constitution,” Bolsonaro said on X hours before Gonet submitted his final allegations. He said the trial was a “witch hunt”, echoing a term used by US President Donald Trump when he came to his South American ally’s defence last week.\nThe prosecution accuses Bolsonaro of leading an armed criminal organisation, attempting to stage a coup and attempting violent abolition of the democratic rule of law, aggravated damage and deterioration of listed heritage.\nThe defence will present its case shortly. Then the panel of Supreme Court justices that opened a trial against the former president will vote on whether to convict or acquit him. Experts expect that to happen in the second half of the year.\nA coup conviction carries a sentence of up to 12 years. A conviction on that and other charges could bring decades behind bars.\nThe former president has repeatedly denied the allegations and asserted that he is the target of political persecution.\nTrump last week imposed a 50 percent import tax on Brazil, directly tying the tariffs to Bolsonaro’s trial. The US president has described Bolsonaro as a friend.\nTrump said that Brazil “is doing a terrible thing in their treatment” of Bolsonaro.\nGonet formally charged Bolsonaro and 33 others in February in connection with an alleged coup days after President Luiz Inacio Lula da Silva took office.\nThe former president’s supporters stormed and ransacked the National Congress and other state institutions in January 2023 to reject Lula’s victory. After his defeat weeks earlier, Bolsonaro had declined to publicly concede his loss.\nPolice have accused Bolsonaro aides of attempting to disrupt the transfer of power to spark a military coup.\nBefore the election, Bolsonaro had suggested without evidence that the vote could be marred by fraud.\nIn his filing, Gonet said Bolsonaro’s actions “were not limited to a passive stance of resistance to defeat, but were a conscious effort to create an environment conducive to violence and a coup”.\nHe added that “the criminal organisation documented almost all of the actions described in the indictment through recordings, handwritten notes, digital files, spreadsheets, and exchanges of electronic messages”.\nThe prosecution is also seeking convictions for several close allies of Bolsonaro, including his running mate during the 2022 election, his former Defense Minister Walter Braga Netto; ex-Justice Minister Anderson Torres; and his aide-de-camp Mauro Cid.\nBrazil’s Supreme Court president, Justice Luis Roberto Barroso, said the US “sanctions” — a reference to Trump’s tariffs — are based on “an inaccurate understanding” of events.\n“For those who didn’t live through a dictatorship or don’t remember one, it’s worth remembering: there was a lack of freedom, torture, forced disappearances, the closure of Congress, and the persecution of judges. In today’s Brazil, no one is persecuted,” Barroso said.\nOn Tuesday, Trump reiterated his opposition to the prosecution of Bolsonaro, praising the former Brazilian president as a “good man”.\n“He loves the country, and he fought hard for those people, and they want to put him in jail,” Trump told reporters. “I think that’s a witch hunt.”\nA day earlier, senior US diplomat Darren Beattie accused the Brazilian government of “attacks” on Bolsonaro and freedom of expression.\n“Such attacks are a disgrace and fall well below the dignity of Brazil’s democratic traditions,” Beattie said in a social media post. “President Trump’s statements are clear. We will be watching closely.”"
    },
    {
      "url": "https://www.aljazeera.com/news/2025/1/9/brazil-marks-the-anniversary-of-the-january-8-attack-on-its-capital",
      "text": "Brazil marks the anniversary of the January 8 attack on its capital\nPresident Lula attended the event to denounce the ‘coup’ against him, led by supporters of his predecessor Jair Bolsonaro.\nBrazilian President Luiz Inacio Lula da Silva has marked the second anniversary of an attack on government buildings with a celebration in the plaza where the violence took place.\nOn Wednesday, Lula – who underwent surgery last month to treat bleeding in his brain – appeared in the Three Powers Plaza in the capital Brasilia to denounce the riots of January 8, 2023, which he has likened to a coup against his presidency.\nRecommended Stories\nlist of 3 itemsBrazil’s former defence minister arrested in attempted coup probe\nBrazil’s Lula released from hospital after brain bleed surgery\nHe also used the occasion to project defiance in the wake of the attack, which saw thousands of protesters break into the presidential palace, Supreme Court building and Congress.\n“Today is the day to say loud and clear: We’re still here,” Lula told his supporters.\n“We’re here to say that we are alive and that democracy is alive, contrary to what the January 8, 2023, coup plotters had planned.”\nThe attack on January 8 came just seven days after Lula, a left-wing leader, had been inaugurated for a non-consecutive third term.\nLula was not in the presidential palace at the time, nor was Brazil’s Congress in session. But the attack caused millions of dollars in damage, and dozens of law enforcement officers and protesters were injured.\nMany of the rioters had sought to spur a military uprising against Lula’s presidency.\nLula’s election had been narrow: He entered a run-off race against incumbent President Jair Bolsonaro in October 2022 and emerged victorious by one of the tightest margins in Brazilian history. Just over 2.1 million votes separated the two candidates.\nBut the far-right Bolsonaro had been spreading false claims well before the election that Brazil’s electronic voting system was vulnerable to fraud, and he refused to publicly acknowledge defeat in the wake of the vote.\nThat spurred widespread protest, with Bolsonaro supporters blocking highways and attacking police headquarters in Brasilia. A bomb threat in the capital was even reported in the lead-up to the inauguration.\nBolsonaro left the country for Florida before Lula took power. He has since returned to the country, where he faces numerous legal cases and investigations.\nSome pertain to his role in spreading misinformation about the election, as well as his connection to the attack on January 8, 2023.\nIn June 2023, Brazil’s electoral court ruled that Bolsonaro could not run for office again until 2030, as punishment for using government resources to sow distrust in the voting system.\nAnd in November 2024, federal police officially accused Bolsonaro and 36 allies of plotting to overturn the 2022 election results. Prosecutor-general Paulo Gonet has yet to decide whether to formally charge the former president.\nOther probes have looked into whether Bolsonaro embezzled jewellery from Saudi Arabia while in office, or spread misinformation during the COVID-19 pandemic.\nStill, on Wednesday, Bolsonaro asserted on social media that United States President-elect Donald Trump had invited him to Washington, DC, for his inauguration on January 20.\n“My lawyer, Dr Paulo Bueno, has already forwarded a request to Minister Alexandre de Moraes for me to get my passport back so that I can attend this honourable and important historical event,” Bolsonaro wrote.\nHis passport was confiscated amid the ongoing investigations."
    }
  ],
  "argos_summary": "Former Brazilian President Jair Bolsonaro is facing trial for allegedly attempting to overturn his 2022 election loss to current President Luiz Inacio Lula da Silva, with prosecutors claiming he incited insurrection and led a coup plot. Bolsonaro's lawyers have denied the charges, asserting that there is insufficient evidence to convict him, and they argue that his actions to authorize a transition contradict the coup allegations. The trial has drawn international attention, particularly due to U.S. President Donald Trump's support for Bolsonaro and the subsequent sanctions imposed by the U.S. on Brazilian officials, which Brazil has condemned as interference in its judicial system.",
  "argos_id": "NQEZ8EZ2C"
}