{
  "url": "https://www.dallasnews.com/sports/mavericks/2025/08/14/must-see-games-on-mavericks-2025-26-schedule-luka-doncics-return-texas-showdowns-more/",
  "authorsByline": "Mike Curtis",
  "articleId": "0f7287044a8740bc8a1e8347e39f9ee3",
  "source": {
    "domain": "dallasnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "TX",
      "county": "Dallas County",
      "city": "Dallas",
      "coordinates": {
        "lat": 32.7762719,
        "lon": -96.7968559
      }
    }
  },
  "imageUrl": "https://dmn-dallas-news-prod.cdn.arcpublishing.com/resizer/v2/BBS4FMFHZVHFVEAK25F5ZFKWSQ.jpg?auth=173d2746a8b292ac88851b8af5fcad7b586ecf46552d3f94f301e65469b915c1&quality=80&width=1200&height=630&focal=1553,360",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T00:41:01.853000+00:00",
  "addDate": "2025-08-15T00:50:31.441043+00:00",
  "refreshDate": "2025-08-15T00:50:31.441048+00:00",
  "score": 1.0,
  "title": "Must-see games on Mavericks’ 2025-26 schedule: Luka Doncic’s return, Texas showdowns, more",
  "description": "Here are 10 games to keep tabs on as the Dallas Mavericks look to reclaim their status as a title contender.",
  "content": "The Dallas Mavericks will begin their journey to return to relevance in the Western Conference on Oct. 22 against the San Antonio Spurs, and they’ll conclude the season April 12 at home against the Chicago Bulls.\n\nThere are 80 games sandwiched between those two dates that will determine if Dallas reclaims its status as a contender.\n\nHere’s an early look at the top 10 games from the Mavericks’ regular season schedule:\n\nThis one is self-explanatory. This game marks the first time Mavericks fans will get a chance to see their newcomers, Cooper Flagg and D’Angelo Russell, play alongside their signature favorites, Anthony Davis, Dereck Lively II, P.J. Washington and Daniel Gafford.\n\nThe Spurs will visit with a revamped young squad that includes Victor Wembanyama, Stephon Castle and No. 2 overall pick Dylan Harper.\n\nWho will start? What will the rotations be like? Who’s left out? This is the first chance to find out the answers to those questions.\n\nThe Mavericks will start the season with five straight games at American Airlines Center, but their first road game won’t be in the United States. Dallas will meet the Detroit Pistons for the NBA’s 2025 Mexico City Game on Nov. 1.\n\nIt’s the franchise’s eighth game in Mexico. The Mavericks previously defeated the Pistons 122-111 in Mexico City on Dec. 12, 2019. Detroit, led by Arlington’s Cade Cunningham, is coming off its first playoff appearance since 2019.\n\nHere’s an interesting scheduling quirk: Because the Mexico City Game is considered a home game for the Pistons, this means the Mavs will not play in Detroit this season.\n\nThe Mavericks are scheduled to play against Houston, another Southwest Division rival, four times this season. The first will be the most significant because the Rockets will boast their retooled roster, headlined by Kevin Durant.\n\nThe Rockets finished second in the Western Conference last season and came up short in the first round of the playoffs, but they’re back with more offensive firepower by adding the former Texas Longhorn.\n\nAll three Texas teams (Mavericks, Rockets, Spurs) are positioned to do well in the Southwest Division and this matchup will offer a glimpse of competitive basketball whenever these teams clash.\n\nLuka Doncic’s name will dominate the conversation whenever the Lakers and Mavericks are mentioned in the same sentence. However, this game is all about Anthony Davis, who will play against his former team in Los Angeles for the first time since he was dealt to Dallas.\n\nIt’s an opportunity for Davis to be on the winning side of the matchup since the trade, as the Mavericks have dropped the first two games since Feb. 1.\n\nThere’s also an extra layer of prominence surrounding the meeting because it’s the Mavericks’ group cup finale in the NBA Cup. Depending on the records of both teams, there could be more on the line than pride. An opportunity to advance to the NBA Cup’s Knockout Rounds could be in play.\n\nWhen healthy, the Mavericks should be one of the most intriguing teams to watch. The NBA recognized that by rewarding them with their sixth consecutive Christmas Day game.\n\nDallas will travel to San Francisco to play against the Golden State Warriors on Christmas Day. The game has a 4 p.m. tipoff and will be televised on (Ch. 8)/ESPN.\n\nThe Mavericks will play against the New York Knicks on MLK Day, which has become one of the league’s most-anticipated days as teams across honor the life and legacy of Dr. Martin Luther King Jr.\n\nDallas will travel to the Big Apple on Jan. 19 to play its lone game at Madison Square Garden. The game will be televised on (Ch. 5)/Peacock and will begin at 4 p.m.\n\nDoncic will return to American Airlines Center twice this season, but Jan. 24, 2026 is the first time he’ll return to play against his former team since his emotional homecoming game on April 9. Doncic scored 45 points in that game and helped his Lakers to a second straight win following the trade that landed him in Los Angeles.\n\nThe game, televised on ABC, shouldn’t bear the same heightened emotions as the first, but there will always be an extra level of significance when Doncic walks through the opposing tunnel at AAC.\n\nIt’s almost guaranteed to be a good game anytime Anthony Edwards and the Minnesota Timberwolves are pitted against the Mavericks on the schedule. The Mavericks will have played against Minnesota twice by the time this game rolls around, but this one bears significance because it’s the first game following the All-Star break. This is usually around the time when teams recognize the need to up their intensity to prepare for the playoffs.\n\nA foe that’s appeared in back-to-back Western Conference finals should be a good test for the Mavericks, who are vying to return to the playoffs.\n\nThe Mavericks have an early meeting with the defending world champion Thunder on Oct. 27, but the real test against Oklahoma City will be on Dec. 5. It’s a nationally televised game on Prime Video and will offer both teams an opportunity to find continuity after the first 23 games of the season.\n\nDallas was the only team in the NBA to defeat the Thunder multiple times last season and this game should serve as a measuring stick to see where they stand after the first quarter of the season.\n\nJayson Tatum won’t be available for the Mavericks’ annual trip to Boston because of his torn Achilles, and perhaps not even Kyrie Irving, but there should be a lot of attention on this game for several reasons.\n\nCooper Flagg, who grew up a fan of the Celtics, was born and raised in Newport, Maine, which is just over a three-hour drive from Boston. That means the No. 1 overall pick will likely have several supporters in the building for his first game inside TD Garden.\n\nThese two teams will always be intertwined because of the 2024 NBA Finals. It remains to be seen whether the Mavericks will be fully healthy for this game, but there should be enough excitement for an early March meeting between two intriguing interconference rivals.\n\nFind more Mavericks coverage from The Dallas Morning News here.",
  "medium": "Article",
  "links": [
    "https://www.dallasnews.com/sports/mavericks/2025/01/31/arlington-native-cade-cunningham-is-1st-pistons-all-star-since-2019-a-great-feeling/",
    "https://www.dallasnews.com/help/terms-of-service/",
    "https://www.dallasnews.com/sports/mavericks/2025/08/14/dallas-mavericks-2025-26-schedule-takeaways-kyrie-irving-luka-doncic-cooper-flagg/",
    "https://www.dallasnews.com/sports/mavericks/2025/06/10/mavericks-to-play-regular-season-game-in-mexico-city-this-time-against-the-pistons/",
    "https://www.dallasnews.com/sports/mavericks/2025/08/08/dallas-mavericks-to-play-golden-state-warriors-on-christmas-day-per-report/",
    "https://www.dallasnews.com/topic/dallas-mavericks/",
    "https://www.dallasnews.com/sports/mavericks/2025/06/25/who-is-cooper-flagg-10-things-to-know-about-dallas-mavericks-no-1-overall-pick/",
    "http://sportsday.dallasnews.com/sports/mavericks/2025/06/22/shai-gilgeous-alexander-thunder-are-nba-champions-after-beating-pacers-in-7-games/",
    "https://www.dallasnews.com/sports/mavericks/2025/04/09/luka-doncics-return-to-dallas-with-lakers-only-reminded-fans-of-what-theyll-miss/",
    "https://x.com/MikeACurtis2",
    "https://www.dallasnews.com/sports/mavericks/2025/07/23/luka-doncic-skinny-dallas-mavericks-la-lakers-offseason-nico-harrison-trade/",
    "https://www.dallasnews.com/sports/mavericks/2025/06/22/suns-reportedly-deal-kevin-durant-to-rockets-sending-former-longhorn-back-to-texas/",
    "https://www.dallasnews.com/help/privacy-policy",
    "https://www.dallasnews.com/sports/mavericks/",
    "https://www.dallasnews.com/sports/mavericks/2025/08/14/full-dallas-mavericks-2025-26-nba-regular-season-schedule-released/",
    "https://www.dallasnews.com/topic/cooper-flagg/",
    "https://www.dallasnews.com/sports/mavericks/2025/06/30/who-is-dangelo-russell-10-things-to-know-about-the-guard-joining-the-dallas-mavericks/",
    "https://www.dallasnews.com/sports/mavericks/2025/08/13/2025-nba-cup-schedule-revealed-when-will-mavericks-play-against-the-lakers/",
    "https://www.dallasnews.com/sports/mavericks/2025/08/14/dallas-mavericks-nico-harrison-mike-tomlin-aaron-rodgers-pittsburgh-steelers/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mavericks fans",
      "weight": 0.082751326
    },
    {
      "name": "more Mavericks coverage",
      "weight": 0.08186902
    },
    {
      "name": "Mavericks",
      "weight": 0.08158335
    },
    {
      "name": "first",
      "weight": 0.072807565
    },
    {
      "name": "teams",
      "weight": 0.06656216
    },
    {
      "name": "their first road game",
      "weight": 0.061765935
    },
    {
      "name": "his first game",
      "weight": 0.0591999
    },
    {
      "name": "the first game",
      "weight": 0.0591999
    },
    {
      "name": "last season",
      "weight": 0.059051473
    },
    {
      "name": "Mexico City Game",
      "weight": 0.055514395
    }
  ],
  "topics": [
    {
      "name": "Dallas Mavericks"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9912109375
    },
    {
      "name": "/Sports/Team Sports/Basketball",
      "score": 0.955078125
    }
  ],
  "sentiment": {
    "positive": 0.3181625,
    "negative": 0.16710813,
    "neutral": 0.5147293
  },
  "summary": "The Dallas Mavericks' 2025-26 schedule includes 80 games that will determine if the team maintains its status as a contender in the Western Conference. The team will begin their journey to relevance on Oct. 22 against the San Antonio Spurs and conclude their season on April 12 at home against the Chicago Bulls. This will be the first time fans will see the team's newcomers, Cooper Flagg and D'Angelo Russell, play alongside Anthony Davis, Dereck Lively II, P.J. Washington and Daniel Gafford. The Mavericks will also play against the Detroit Pistons for the NBA's 2025 Mexico City Game on Nov. 1, marking their eighth game in Mexico. They will not play in Detroit this season due to a scheduling quirk. They are scheduled to play against Houston four times this season. The NBA rewarded them with their sixth consecutive Christmas Day game.",
  "shortSummary": "The Dallas Mavericks’ season begins on Oct. 22 against the San Antonio Spurs, with key games like Luka Doncic's return and Houston's return.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3841fbe0929140adbeb23a4df42320b7",
  "places": [
    {
      "osmId": "25312698",
      "road": "Victory Avenue",
      "city": "Dallas",
      "county": "Dallas County",
      "state": "Texas",
      "postcode": "75219",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Harwood District",
      "coordinates": {
        "lat": 32.7905076,
        "lon": -96.81027213460834
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.dallasnews.com/sports/mavericks/2025/08/14/full-dallas-mavericks-2025-26-nba-regular-season-schedule-released/",
      "text": "After a week full of teases, the Dallas Mavericks officially revealed their 2025-26 regular season schedule on Thursday.\nThe Mavericks will open the season Oct. 22 by hosting San Antonio, will spend Christmas in San Francisco against the Warriors and will travel to Madison Square Garden to face the New York Knicks on Jan. 19, all of which were revealed earlier this week by the NBA.\nAnthony Davis’ long-anticipated return to face the Los Angeles Lakers will come on Nov. 28, marking the first time he will play against his former team since he was shockingly traded to Dallas on Feb. 1.\nNo. 1 overall pick Cooper Flagg, who grew up a fan of the Boston Celtics as a native of Newport, Maine, will play at TD Garden for the first time on Friday, March 6.\nThe Mavericks’ four-game schedule for the NBA Cup was released on Wednesday, which is highlighted by their first matchup of the season against the Lakers. They will also travel to Memphis on Nov. 7, followed by home meetings against the LA Clippers on Nov. 14 and New Orleans Pelicans on Nov. 21.\nDallas’ regular season finale will be Sunday April 12 at home against the Chicago Bulls.\nThe Mavericks won’t have the same roster they did a season ago, with Flagg and D’Angelo Russell as new additions, along with two-way guards Ryan Nembhard and Miles Kelly (with Spencer Dinwiddie outgoing).\nThe Mavericks begin their preseason Oct. 6 in Fort Worth against the Oklahoma City Thunder.\n2025-26 Dallas Mavericks schedule\nD-Live goes BACK to the Dinosaur Park... Or so we thought? 🎬🗓️@ticketmaster // #MFFL pic.twitter.com/Yz4siaEJaz\n— Dallas Mavericks (@dallasmavs) August 14, 2025\nFind more Mavericks coverage from The Dallas Morning News here."
    },
    {
      "url": "http://sportsday.dallasnews.com/sports/mavericks/2025/06/22/shai-gilgeous-alexander-thunder-are-nba-champions-after-beating-pacers-in-7-games/",
      "text": "OKLAHOMA CITY — Shai Gilgeous-Alexander walked off the court for the final time this season, collapsed into the arms of coach Mark Daigneault and finally smiled.\nIt was over.\nThe climb is complete. The rebuild is done. The Oklahoma City Thunder are champions.\nThe best team all season was the best team at the end, bringing the NBA title to Oklahoma City for the first time. Gilgeous-Alexander finished off his MVP season with 29 points and 12 assists, and the Thunder beat the Indiana Pacers — who lost Tyrese Haliburton to a serious leg injury in the opening minutes — 103-91 in Game 7 of the NBA Finals on Sunday night.\n“It doesn’t feel real,” said Gilgeous-Alexander, the Finals MVP. “So many hours. So many moments. So many emotions. So many nights of disbelief. So many nights of belief. It’s crazy to know that we’re all here, but this group worked for it. This group put in the hours and we deserve this.”\nJalen Williams scored 20 points and Chet Holmgren had 18 for the Thunder, who finished off a season for the ages. Oklahoma City won 84 games between the regular season and the playoffs, tying the 1996-97 Chicago Bulls for third most in any season.\nOnly Golden State (88 in 2016-17) and the Bulls (87 in 2015-16) won more.\nIt’s the second championship for the franchise. The Seattle SuperSonics won the NBA title in 1979; the team was moved to Oklahoma City in 2008. There’s nothing in the rafters in Oklahoma City to commemorate that title.\nIn October, a championship banner is finally coming. A Thunder banner.\n“They behave like champions. They compete like champions,” Daigneault said. “They root for each other’s success, which is rare in professional sports. I’ve said it many times and now I’m going to say it one more time. They are an uncommon team and now they’re champions.”\nThe Pacers led 48-47 at the half even after losing Haliburton to what his father said was an Achilles tendon injury about seven minutes into the game. But they were outscored 34-20 in the third quarter as the Thunder built a 13-point lead and began to run away.\n“Deflated, but proud of everything we’ve accomplished,” Pacers guard TJ McConnell said.\nBennedict Mathurin had 24 points and 13 rebounds for Indiana, which still is waiting for its first NBA title. The Pacers — who were 10-15 after 25 games and were bidding to be the first team in NBA history to turn that bad of a start into a championship — had leads of 1-0 and 2-1 in the series, but they simply didn’t have enough in the end.\nHome teams improved to 16-4 in NBA Finals Game 7s. And the Thunder became the seventh champion in the last seven seasons, a run of parity like none other in NBA history.\nPacers forward Pascal Siakam was part of the Toronto team that won in 2019, Thunder guard Alex Caruso was part of the Los Angeles Lakers team that won in the pandemic “bubble” in 2020, Milwaukee won in 2021, Golden State in 2022, Pacers forward Thomas Bryant and Denver prevailed in 2023, and Boston won last year’s title.\nAnd now, the Thunder get their turn. The youngest team to win a title in nearly a half-century has reached the NBA mountaintop.\nThe Thunder are the ninth franchise to win a title in NBA Commissioner Adam Silver’s 12 seasons. His predecessor, David Stern, saw eight franchises win titles in his 30 seasons as commissioner.\n“It really hurts on the one hand,” Pacers coach Rick Carlisle said. “On the other hand, this team has given all of Pacer Nation something to be very proud of.”"
    },
    {
      "url": "https://www.dallasnews.com/sports/mavericks/2025/08/13/2025-nba-cup-schedule-revealed-when-will-mavericks-play-against-the-lakers/",
      "text": "A few more games from the Dallas Mavericks’ 2025-26 regular-season schedule have been revealed. Most notably, the first matchup of the season between the Mavericks and Los Angeles Lakers.\nThe Mavericks will play in Los Angeles on Nov. 28, which marks Anthony Davis’ first opportunity to play against his former Lakers squad. It’s also the third regular-season meeting between the two teams since their stunning blockbuster trade on Feb. 1 that brought Davis to Dallas and sent Luka Doncic to Los Angeles.\nThe NBA announced matchups Wednesday afternoon for the group play stage of the 2025 Emirates NBA Cup, the league’s annual in-season tournament. The Mavericks are in West Group B, along with the Lakers, Los Angeles Clippers, Memphis Grizzlies and New Orleans Pelicans.\nThe announcement coincided with the league’s new partnership with Amazon, which will broadcast the Mavericks’ group play games on four consecutive Fridays in November.\nThe Mavericks will open the NBA Cup at Memphis on Nov. 7 at 7 p.m. It’s a familiar matchup since the two teams met in the second game of last season’s play-in tournament. Dallas was eliminated from postseason contention by suffering a 120-106 loss to Memphis on April 18.\nAmerican Airlines Center will play host for the team’s next two NBA Cup games. The Clippers will visit Dallas on Nov. 14 at 7:30 p.m. The game will be televised on Prime Video. That matchup will be followed by a meeting with the Pelicans on Nov. 21 at 7:30 p.m.\nThe Mavericks’ final opponent of group play will be against Doncic and the Lakers. The group play finale will be broadcast on Prime Video and has a 9 p.m. tipoff.\nPrime Video will have exclusive rights to televise the NBA Cup’s knockout rounds, including the quarterfinals (Dec. 9 and Dec. 10), semifinals (Dec. 13) and championship game (Dec. 16).\nThe complete 2025-26 regular-season schedule will be announced on Thursday.\nX/Twitter: @MikeACurtis2\nFind more Mavericks coverage from The Dallas Morning News here."
    },
    {
      "url": "https://www.dallasnews.com/sports/mavericks/2025/06/22/suns-reportedly-deal-kevin-durant-to-rockets-sending-former-longhorn-back-to-texas/",
      "text": "The Houston Rockets are acquiring 15-time All-Star and four-time Olympic gold medalist Kevin Durant from the Phoenix Suns in a blockbuster deal struck Sunday, a person with knowledge of the agreement told The Associated Press.\nThe Rockets are giving up Dillon Brooks, Jalen Green and six future picks — including the No. 10 selection in Wednesday’s opening round of this year’s draft — according to the person who spoke to the AP on condition of anonymity because the deal was still pending NBA approval.\nIt ends weeks of speculation about where Durant would end up. Many teams were involved at various times, including Miami and Minnesota, but in the end Phoenix accepted the Rockets’ offer.\nESPN first reported the trade.\nFans learned of the news while Durant was on stage in New York at Fanatics Fest NYC, and when they began reacting, Durant started smiling broadly.\n“We’re gonna see, man,” Durant said from the stage. “We’re gonna see.”\nBREAKING: Kevin Durant was traded to the Houston Rockets while he was ON STAGE at Fanatics Fest.\n— Arye Pulli (@AryePulliNFL) June 22, 2025\nHe had no clue and even asked if it was real.\nOn his first reaction to being traded: “We’re gonna see man, we’re gonna see.” pic.twitter.com/UKixsyLT6B\nBoardroom, the ever-growing media company that Durant and his business partner, Rich Kleiman, co-founded in 2019, teams up with Fanatics on a number of projects. The panel that Durant was set to appear on there Sunday was called “Global Game Changers.”\nHe certainly figures to change the game for the Rockets.\nHouston finished No. 2 in the Western Conference in the regular season, albeit 16 games behind No. 1 Oklahoma City. It now adds a two-time champion to its young core as it looks to make another jump next season.\nDurant averaged 26.6 points this season, his 17th in the NBA — not counting one year missed because of injury. For his career, the 6-foot-11 forward is averaging 27.2 points and seven rebounds per game.\nThe move brings Durant back to the state of Texas, where he played his one year of college basketball for the Longhorns and was the college player of the year before going as the No. 2 pick in the 2007 draft by Seattle.\nHouston will become his fifth franchise, joining the SuperSonics (who then became the Oklahoma City Thunder), Golden State, Brooklyn and Phoenix. Durant won his two titles with the Warriors in 2017 and 2018, and last summer in Paris he became the highest-scoring player in U.S. Olympic basketball history and the first men’s player to be part of four gold-medal teams.\nDurant is a four-time scoring champion, a two-time Finals MVP and one of eight players in NBA history with more than 30,000 career points, joining the club on Feb. 11.\nDurant is under contract next season for roughly $50 million before becoming a free agent in 2026.\nHis departure from the Suns was expected and ends a disappointing 2 1/2 years in the desert. Durant never enjoyed consistent team success despite being part of a trio that included star guards Devin Booker and Bradley Beal.\nDurant was acquired by the Suns from the Brooklyn Nets in a four-team trade-deadline deal in 2023, just days after new owner Mat Ishbia bought the team for roughly $4 billion. Phoenix gave up a lot to acquire the then-34-year-old, sending young standouts Mikal Bridges and Cam Johnson, along with four future first-round picks, to Brooklyn.\nFind more Mavericks coverage from The Dallas Morning News here."
    },
    {
      "url": "https://www.dallasnews.com/sports/mavericks/2025/04/09/luka-doncics-return-to-dallas-with-lakers-only-reminded-fans-of-what-theyll-miss/",
      "text": "The prodigal son returned Wednesday to American Airlines Center, and fatted calf was the only thing not on the menu. A billboard in the catacombs paid thanks to Luka Doncic. Giveaway T-shirts draped over seats did the same. In Slovenian, no less. Frankly, it was all a little surreal. Certainly ironic, considering only two months ago the Mavs kicked him to the curb.\nThe way Jason Kidd talked about Luka before the Lakers’ 112-97 rout, calling him “one of the greatest players in the world,” you might have wondered why he didn’t try to stop Nico Harrison from making the biggest mistake of his life.\nWhich is why now and, for the foreseeable future, the Mavs’ general manager will hear fevered chants of “Fire Nico” whenever things get dull.\nAnd make no mistake, even if the Mavs eventually make good on Nico’s promise of winning it all one of these days, life without Luka will be duller.\nA two-minute video tribute during the Lakers’ introductions — covering memories stretching from the day he was drafted nearly to the day he was dumped — reminded us of what we’ll miss.\nLuka conjuring trick shots, Luka passing behind his back, Luka finding teammates most guards could locate only with an assist from a bloodhound.\nLuka laughing. Luka winning.\nLuka snarling at poor Rudy Gobert.\nLuka crying after the video was over, echoes of “Lu-ka ... Lu-ka” still ringing in his ears.\n“A lot of emotions,” he said after the game, typically understated.\n“It was amazing.”\nThe Mavs leaked a lot of foolishness about Luka after the trade in an attempt to justify it on the sly. Some of it was even true. The problem was none of it rose to the level of trading a player who, in another five, 10 years, would have eclipsed Dirk Nowitzki as the greatest player in franchise history.\nAs it looks now, unless Anthony Davis or Kyrie Irving play into their dotage, Dirk will retire the title.\nNico talks a lot about culture, implying Luka didn’t fit the one he’s crafting. But if Luka didn’t bleed Mavs blue, it was sure hard to tell after Wednesday’s video. Especially with his head buried in LeBron James’ shoulder.\nOf course, Luka being Luka, it didn’t take long for him to put on his game face. His coach, JJ Redick, called his show of vulnerability, followed by a line of 45 points, eight rebounds, six assists and four steals — on the second night of a back-to-back, at that — “superhuman.”\nAlmost as though we were watching the video all over again, only with the Mavs as the bad guys.\nOn his first drive, the buzz in the building growing with each dribble, Luka got to the block and threw a perfect behind-the-back pass to Jaxson Hayes under the rim.\nNo assist.\nNot even a completion.\nHayes couldn’t have been more surprised by the basketball if he’d been sitting in the 10th row, knocking back a cold one.\nClearly, Luka and the Lakers are still getting acquainted. They don’t have much in the way of frontline talent beyond Luka, King James and Austin Reaves, yet, since the trade, they’ve clawed past Denver for third place in the Western Conference. Say what you want about Luka — and, judging by Wednesday’s official reaction, the Mavs are all over the map on the subject — he can lift a team, as he proved in ‘22 and again last season.\nMeanwhile, the team he left behind will do well to make the last play-in slot, then beat a hasty exit.\nBesides the worst trade in local lore, a lot has gone wrong for the Mavs this year. More than Anthony Davis can fix, anyway. Look, I’m not blaming him for this mess. He’s played well when he’s healthy, which is the book on him. As Kidd reminded us Wednesday, he’s an all-time top 75 player. A certified two-way threat.\nBut, no matter how diversified your portfolio, it’s hard to make much of an impact without the ball in your hands.\nThe Mavs are still getting used to Davis, too. As the other guy playing against his former team Wednesday, Davis finished with 13 points, 11 rebounds and six assists. Not awful, but not exactly what you’d expect against a team flexing just one true center, either.\nIn his first game back at his old digs, Luka put on his usual show, and the grateful locals reacted to every pass, shot or penetration as though he’d never left. Hard to tell sometimes which team was at home.\nThis is what happens when you’re still trying to wrap your head around a deal that left you feeling like your kid came home from college with a new set of parents.\nGoing into the game, Kidd expected Mavs fans to show their allegiance to Luka, and he was cool with it. Even the boos. He acknowledged there will always be arguments over what in the world could lead the Mavs to trade a player so beloved, even after he’s wearing a different uniform in the same building. He asked only that those same fans believe in these Mavs.\n“There’s still hope,” he said, “and there will be hope 10 years from now.”\nA nice sentiment, except it’s hard to see at the moment. Hard to think about Luka 10 years from now, still in a Lakers’ uniform, his Mavs’ days long since past. Hard to imagine Kidd still here. Nico, too. The kid sitting a few feet from me banged the “Fire Nico” chant long, loud and often. Especially personal when you realize you won’t get to grow up with Luka after all. He looked to be about 8. A lifetime of grief still to give.\nTwitter/X: @KSherringtonDMN\nFind more Mavericks coverage from The Dallas Morning News here."
    },
    {
      "url": "https://www.dallasnews.com/sports/mavericks/2025/08/14/dallas-mavericks-2025-26-schedule-takeaways-kyrie-irving-luka-doncic-cooper-flagg/",
      "text": "The Dallas Mavericks are a little more than six weeks away from kicking off training camp in Vancouver, but they finally have clarity about their regular-season schedule that’ll span from late October to mid-April.\nThe NBA announced the schedules for the regular seasons for all 30 teams on Thursday afternoon and the Mavericks are the beneficiaries of a favorable amount of nationally televised games.\nHere are six takeaways from the Mavericks’ 2025-26 regular season schedule:\nGoin’ back-to-back: The Mavericks are slated to play in 14 back-to-backs this season. While that’s one set more than last season’s total of 13, there are five teams with 16 sets of back-to-back games (Charlotte, Denver, Philadelphia, Phoenix and Washington) and seven teams with 15 (Golden State, LA Clippers, Miami, New Orleans, Portland, Toronto and Utah).\nFive of Dallas’ back-to-backs will be played at American Airlines Center and do not require any travel. Five of them begin and end on the road. Two are home-to-road and the other two are road-to-home.\nThe Mavericks finished with a record of 8-5 in the second game of back-to-backs last season.\nStill in the spotlight: The Mavericks are expected to be without Kyrie Irving for multiple months to begin the season as he recovers from ACL surgery. However, that doesn’t mean there will be a lack of exposure for a team that still has Anthony Davis, Klay Thompson, Dereck Lively II and No. 1 overall pick Cooper Flagg.\nThe Mavericks have the 10th-most national TV games in the NBA this season with 23 games, including eight on NBC/Peacock, five on Amazon’s Prime Video, five on ESPN, three on ABC and two on Peacock alone. The team’s local broadcast schedule is expected to be announced at a later date.\nAway for the holidays: The Mavericks had the benefit of spending the majority of the holiday season in Dallas in 2024-25, but that won’t be the case this year.\nThe Mavericks will spend Halloween abroad as they prepare to face the Detroit Pistons in the 2025 Mexico City Game on Nov. 1. Thanksgiving will also be on the road since they’ll face Luka Doncic and the Los Angeles Lakers for the first time on Nov. 28, which falls on Black Friday.\nLess than a month later, they’ll spend Christmas Day in the Bay Area as they visit the Golden State Warriors. After spending New Year’s Day in Houston in 2025, the Mavericks will have the luxury of bringing 2026 in from the comfort of their own homes before they host Philadelphia on Jan. 1.\nWhen will Luka return, again? It won’t be nearly as emotional as the first time, but going forward, Doncic’s return to American Airlines Center will be one of the league’s most anticipated games of the year.\nJan. 24 is the day the former Mavericks superstar returns to the place he once called home. It’s one of four games listed on the schedule against the Lakers. Doncic will also return on April 5.\nInteresting trends: The Mavericks will start their 45th anniversary season with a five-game homestand, their longest of the season. The first three opponents did not qualify for the playoffs last season, but the other two foes met in last season’s NBA Finals: Oklahoma City and Indiana.\nThe Mavs’ longest road trip of the season is six games, spanning from Feb. 7 to 24, but it’s broken up into three each because of the All-Star break. The opponents during that stretch: San Antonio, Phoenix, Los Angeles. They’ll come out of the break and visit Minnesota, Indiana and Brooklyn.\nThe second-longest road trip of the season is a five-game East Coast swing from March 3 to March 10, with opponents including Charlotte, Orlando, Boston, Toronto and Atlanta.\nPossible Irving return game?\nIt’s difficult to pinpoint exactly when Irving will be healthy enough to return from an ACL tear he suffered in his left leg on March 3. According to the Hospital for Special Surgery in New York, where the team announced Irving underwent a successful procedure on March 26, it usually takes 9 to 12 months to recover from ACL surgery.\nMavericks general manager Nico Harrison gave a brief update on Irving on July 14 ahead of the team’s third summer league game.\n“Kyrie’s ahead of schedule, but we kind of knew he would be because of the way he attacks his rehab and he’s going [in] two and three times a day,” Harrison said.\nHere are a few options for an Irving return based on 9, 10, 11 and 12-month timelines.\nThe first game after the 9-month mark is a road game on Dec. 27 against the Sacramento Kings. The first game after the 10-month mark is a home game against the Minnesota Timberwolves on Jan. 28.\nIf the Mavericks choose to wait until after the All-Star break, then the first game after the 11-month mark is a home game against the Sacramento Kings.\nEither matchup against the Kings would be symbolic because Irving suffered his injury in a home game against the Kings.\nIf Irving chooses to wait a full 12 months before he returns to the court, then the first game he’d be eligible to play in would fall on March 27 at Portland. That would leave the veteran guard with nine games left in the regular season to ramp up for the playoffs.\nX/Twitter: @MikeACurtis2\nFind more Mavericks coverage from The Dallas Morning News here."
    },
    {
      "url": "https://www.dallasnews.com/sports/mavericks/2025/08/14/dallas-mavericks-nico-harrison-mike-tomlin-aaron-rodgers-pittsburgh-steelers/",
      "text": "Just like last year, the Dallas Mavericks and Pittsburgh Steelers had a training camp crossover.\nA year after Nico Harrison and Jason Kidd ventured up north to observe Steelers camp and get some ideas from Steelers coach Mike Tomlin, Harrison returned.\nLeVelle Moton, the head men’s basketball coach at North Carolina Central, posted a picture on his social media account of himself, Nico Harrison, Aaron Rodgers and College of Charleston assistant basketball coach Jeff McInnis having lunch at Steelers camp.\nTomlin also posted a picture on Instagram with Harrison, Moton and McInnis captioned, “Loved sharing ideas and talking hoops with these guys. Always a pleasure to have them at camp.”\nOne key difference is Kidd apparently did not make the trip out to Pittsburgh, unlike last year.\n“As a coach, you always want to get better, and when you talk about the head coach of the Pittsburgh Steelers, Tomlin is the best,” Kidd told the Pittsburgh Post-Gazette last year.\nAlthough Harrison had a significantly more turbulent season than Tomlin since their last meeting, thanks to his infamous Luka Doncic trade that infuriated Mavericks fans, Tomlin is facing some pressure of his own. The Steelers have been mired in mediocrity recently and have not won a playoff game since 2017.\nNow, Tomlin’s hopes rest on the shoulders of the 41-year-old Rodgers and Harrison’s hopes rest on 32-year-old Anthony Davis’ shoulders.\nMaybe Tomlin and Harrison shared ideas on how to handle their upcoming pressure-packed seasons?\nFind more Mavericks coverage from The Dallas Morning News here."
    },
    {
      "url": "https://www.dallasnews.com/sports/mavericks/2025/06/10/mavericks-to-play-regular-season-game-in-mexico-city-this-time-against-the-pistons/",
      "text": "For the eighth time in franchise history, the Dallas Mavericks will play a regular-season game in Mexico City.\nThe 2025 Mexico City Game will feature the Mavericks and Detroit Pistons at the Arena CDMX in Mexico City on Nov. 1, the NBA announced late Tuesday.\nThe NBA and Zignia Live today announced that The NBA Mexico City Game 2025 will feature the @dallasmavs and the @DetroitPistons playing a regular-season game hosted by Zignia Live at the Arena CDMX in Mexico City on Saturday, Nov. 1.\n— NBA Communications (@NBAPR) June 11, 2025\nComplete release: https://t.co/tBBg0OZtZC pic.twitter.com/ENFK10uvD6\n“We take significant pride in the fact that the Mavericks organization and our supporters reflect the increased globalization of basketball and the NBA,” Mavericks CEO Rick Welts said in a statement.\nThe release didn’t identify the home team, so it’s unclear if the game will decrease by one the number of games played at American Airlines Center.\nBoth rosters feature All-Stars. The Mavericks are headlined by Anthony Davis, Klay Thompson and Kyrie Irving, who is expected to miss a significant portion of the regular season while recovering from ACL surgery.\nThe Pistons are led by first-time All-Star guard Cade Cunningham, along with a bevy of emerging talent such as Jalen Duren, Jaden Ivey and Ausar Thompson. Detroit tripled its win total this season from a year ago and qualified for the playoffs for the first time since 2018.\nThe Mavericks participated in the first NBA game in Mexico on Oct. 27, 1992, beating the Houston Rockets in a preseason game.\nOne of the most explosive scoring performances in the annual Mexico City games belongs to former Mavericks superstar Luka Doncic, who dropped 41 points with 12 rebounds and 11 assists, coincidentally to help Dallas defeat the Pistons in December 2019. He is the only player to record a triple-double in a Global Games competition, and his performance ranks as the second-highest point total in a global game.\nRight before he was traded to the Mavericks, assistant general manager Michael Finley tied a then-career-high 35 points in Mexico City in December 1996 as a member of the Phoenix Suns.\nThis season’s matchup between Dallas and Detroit marks the NBA’s 34th game in Mexico since 1992 – more than any country outside of the U.S. and Canada. It also coincides with traditional Día de Muertos (Day of the Dead) celebrations in the city for the second consecutive year.\nWe are ready… ¿y tú, México? 🇲🇽🏀@Softtek // #MFFL pic.twitter.com/8NQApmWOt1\n— Dallas Mavericks (@dallasmavs) June 11, 2025\nThe game will showcase Dia de Muertos with a themed court, fan engagement initiatives and other elements.\n“The vibrancy of Mexico City and the passion of its fans make it the perfect place to host these Global Games, and we are thrilled at the opportunity to represent the NBA and the city of Dallas in Mexico City for the eighth time,” Welts said.\nX/Twitter: @MikeACurtis2\nFind more Mavericks coverage from The Dallas Morning News here."
    },
    {
      "url": "https://www.dallasnews.com/sports/mavericks/2025/06/30/who-is-dangelo-russell-10-things-to-know-about-the-guard-joining-the-dallas-mavericks/",
      "text": "With Kyrie Irving recovering from an ACL tear, the Dallas Mavericks will turn to another veteran guard early in the 2025-26 season.\nThe Mavericks agreed to a two-year, $13 million deal with D’Angelo Russell early in free agency. Russell will join the Mavericks after closing out the 2024-25 season with the Brooklyn Nets.\nHere are 10 things to know about Russell:\n1. The basics\nName: D’Angelo Russell\nPosition: Guard\nBirthdate: February 23, 1996 (29 years old)\nHeight: 6-3 Weight: 193 pounds\nCollege: Ohio State\nHometown: Louisville, Kentucky\nNBA experience: 10 years\n2. Reuniting with some old friends\nWhen Russell lands in Dallas, he’ll get a chance to reunite with some old friends. The guard will once again team up with Anthony Davis and Max Christie, two players he shared the court with in Los Angeles.\nRussell also briefly teamed up with Klay Thompson when he played for the Golden State Warriors in 2019. Russell shouldn’t face too much trouble trying to acclimate to his surroundings in North Texas.\n3. He has a signature celebration\nThroughout his NBA career, Russell has been known for his signature celebration. After hitting big shots, Russell has notably pointed toward his arm to emphasize the “ice” in his veins.\nMultiple NBA stars have since adopted the celebration, using it in clutch moments. Anthony Davis used the “ice in my veins” gesture during his Mavericks debut against the Houston Rockets in February.\n4. He has some well-known nicknames\nRussell has gone by some well-known nicknames throughout his NBA stint. One of his nicknames simply shortens his first name to DLo (or D-Lo, depending on how you spell it). The other nickname, dloading, is seen on his social media handles.\nThe “loading” moniker can reglularly be seen on Russell’s social media posts.\n5. His high school is an NBA factory\nBefore he spent one season at Ohio State, Russell built up his skills at a prep school that has produced multiple NBA standouts. The school? Montverde Academy.\nRussell transferred to Montverde after spending his freshman year (2010-11) at Central High School in Louisville, Kentucky. During his stint at Montverde, Russell notably teamed up with future NBA players like Ben Simmons and Joel Embiid.\nMultiple first-round draftees have since passed through Montverde. Cooper Flagg, one of Russell’s future Mavericks teammates, played at the school before starring at Duke.\n6. Draft pedigree\nRussell’s NBA career started with high expectations. The Lakers selected the guard with the No. 2 overall pick in the 2015 NBA draft.\nIt was easy to see why the Lakers coveted Russell in that year’s draft. In his lone season at Ohio State, he averaged 19.3 points, 5.7 rebounds and five assists. He earned multiple accolades, being named a consensus first-team All-American.\nRussell had a chance to learn from Lakers icon Kobe Bryant as a rookie in Los Angeles.\n7. His first Lakers stint had some awkward moments\nRussell’s first year in the NBA wasn’t exactly smooth. While the young guard tried to adjust to the professional game, he found himself in some hot water with teammates and Lakers fans.\nBack in 2016, ESPN reported a rift between Russell and a few of his teammates after a controversial video circulated on social media. Russell apparently recorded the video, which showed the guard having a private conversation with Nick Young.\nAfter the incident was reported, Russell was booed by the crowd at what was then Staples Center. He told reporters he felt “sick” over how the situation unfolded.\n“I can’t really show my face anywhere without people hating me right now,” Russell said. “I don’t know. I try to handle it the right way and remember why I’m here, which is to play basketball.”\nRussell then told reporters that he offered apologies to Young over the incident.\nRussell’s first Lakers stint ultimately lasted just two seasons. He was traded to the Brooklyn Nets in 2017, paving the way for one of the best campaigns of his professional career.\n8. He has an All-Star appearance on his résumé\nRussell’s second season in Brooklyn was one to remember. In 2018-19, the guard played a pivotal role in helping a young Nets team reach the NBA playoffs.\nHe showed what he can do as an offense’s focal point, averaging 21.1 points, 3.9 rebounds and seven assists. Russell was rewarded for his strong showing with an NBA All-Star selection.\nHe played for Team Giannis in the 2019 All-Star Game, scoring six points off the bench.\n9. The Mavericks will be his fifth NBA team\nRussell is a well-traveled guard at this point in his professional career. We’ve already mentioned his move from Los Angeles to Brooklyn. After two seasons with the Nets, Russell was traded to the Golden State Warriors in 2019 as part of a sign-and-trade package for Kevin Durant.\nHis Golden State tenure was a short one, as he was traded to the Minnesota Timberwolves at the 2020 trade deadline. He spent about three years in Minnesota, then found himself back with the Lakers at the 2023 trade deadline.\nRussell was once again traded from Los Angeles to Brooklyn in December 2024. He was a free agent this offseason, agreeing to a deal with the Mavericks ahead of the 2025-26 campaign.\n10. He has a podcast\nRussell has his own podcast. The guard launched his show, The Backyard Podcast, in 2023. On his show, he discusses a variety of NBA-related topics.\nRussell notably interviewed Davis after he was traded from the Lakers to the Mavericks in February. You can see their interview below:\nFind more Mavericks coverage from The Dallas Morning News here."
    },
    {
      "url": "https://www.dallasnews.com/sports/mavericks/2025/06/25/who-is-cooper-flagg-10-things-to-know-about-dallas-mavericks-no-1-overall-pick/",
      "text": "Cooper Flagg is officially headed to Dallas.\nWith the No. 1 overall pick in the 2025 NBA draft, the Mavericks selected the Duke superstar. Flagg spent just one season at Duke, quickly showcasing his skills as one of the nation’s top young basketball players.\nHere are 10 things to know about the Mavericks’ newest draftee:\n1. The basics\nName: Cooper Flagg\nBirthdate: December 21, 2006 (18 years old)\nHometown: Newport, Maine\nCollege: Duke\nHeight: 6-8 Weight: 221 pounds\n2. A rare No. 1 overall pick for the Dallas Mavericks\nFlagg is already in an exclusive group when it comes to the Mavericks’ history books. He’s only the second player to be drafted by the franchise with the first overall pick.\nBefore Flagg, Mark Aguirre was the only player to hold the distinction. The Mavericks selected Aguirre at No. 1 overall during the 1981 draft.\n3. A high school phenom\nIf you follow basketball, you’ve known Flagg’s name since his high school days.\nHe became the first freshman to be named the Maine Gatorade Player of the Year after leading Nokomis Regional High School to a state championship. After his freshman year, he transferred to Montverde Academy, a basketball prep powerhouse.\nHe was initially in the class of 2025, but reclassified to the 2024 recruiting class and became the top recruiting prize in the 2024 class. Flagg committed to Duke on October 30, 2023.\nAs a high school prospect, he was named to the 2024 McDonald’s All-American Boys Game, won the Gatorade National Player of the Year, Mr. Basketball USA and Naismith Prep Player of the Year.\n4. Outstanding year at Duke\nFlagg lived up to all the hype at Duke.\nHe averaged 19.2 points, 7.5 rebounds, 4.2 assists, 1.4 steals and 1.4 blocks per game for the Blue Devils and led Duke to a 35-4 record en route to the Final Four.\nFlagg received every honor you could imagine during his lone college season, winning the National Player of the Year, National Freshman of the Year, ACC Player of the Year, ACC Rookie of the Year, ACC All-Defensive Team, All-ACC First Team and was a consensus First Team All-American.\n5. Competing against the NBA’s best\nFlagg was the youngest player to win the USA Basketball Male Athlete of the Year, winning the award for his performance at the Under-17 FIBA World Cup.\nTwo years later, he was named to the USA Select Team to practice with the U.S. men’s national team that was preparing for the Paris 2024 Summer Olympics.\nJust 17 years old at the time, Flagg turned heads as he competed against the men’s national team.\nCooper Flagg cooking NBA superstars during 2024 Team USA training camp before the Paris Olympics last summer:\n— Mavs Film Room 🐴🎥 (@MavsFilmRoom) May 13, 2025\n🎥: @BenGolliver\npic.twitter.com/22Vkp29J1B\n6. Already has a shoe deal\nFlagg had a shoe deal before he ever suited up in a college basketball game.\nHe signed with New Balance before his freshman year at Duke, partly due to the company’s close ties with his home state. There is a manufacturing factory that is just 25 miles from his childhood hometown in Maine.\n“The connection with New Balance as a family company and a company with Maine roots means a lot to me,” Flagg told ESPN at the time. “That makes this really different and special. My mom used to go to the tent sale for back-to-school shopping there when we were kids. That really aligns the brand with my roots. It’s a perfect fit.”\n7. He has a twin brother\nMavericks fans might feel like they’re seeing double if Flagg lands in Dallas.\nThe Duke standout has a twin brother named Ace. Like Cooper, Ace is pretty good at basketball. Ace, a 6-8 forward, committed to Maine in 2024 and is a three-star recruit in the class of 2025.\n8. Has some Dirk-like moves\nFlagg is a multidimensional player capable of standing out on offense and defense. While his fundamentals are solid, he can also break out some flashy moves.\nBack in March, Flagg separated from a Wake Forest defender and drained a smooth, one-legged fadeaway jumper. It’s a move Dirk Nowitzki executed to perfection throughout his Mavericks career.\nFlagg has been working on that shot for years.\n9. Thrived in a visit to Dallas earlier this year\nFlagg seemed pretty comfortable in North Texas the last time he visited.\nThe forward led Duke to an 89-62 win over SMU in an ACC matchup at Moody Coliseum. Flagg scored 24 points on 7-of-12 shooting, coming down with a team-high 11 rebounds. His highlights included a poster dunk on 7-2 SMU center Samet Yigitoglu.\nProjected No. 1 pick, Cooper Flagg wputs up 7th 20+ point game against SMU 😈\n— B/R Hoops (@brhoops) January 4, 2025\n24 PTS | 7-12 FG | 10 REB | 2 BLK pic.twitter.com/bFud5HYyvX\n10. Grew up watching one of the greats\nHis NBA career hasn’t started yet, but Flagg has already been compared to one of the game’s all-time greats in Larry Bird. According to an article from Yahoo Sports’ Jeff Eisenberg, Flagg grew up watching DVDs that chronicled Bird’s career.\nHe would even watch replays of Celtics games from the 1985-86 season in his parents’ minivan on his way to practices.\nFind more Mavericks coverage from The Dallas Morning News here."
    },
    {
      "url": "https://www.dallasnews.com/sports/mavericks/2025/01/31/arlington-native-cade-cunningham-is-1st-pistons-all-star-since-2019-a-great-feeling/",
      "text": "DETROIT — The year is 2010, and Arlington is hosting the NBA All-Star Game.\nIn the heart of the winter, the basketball world gathered in the Dallas-Fort Worth area for the yearly showcase between the league’s brightest stars. Mavericks legend Dirk Nowitzki was among the select group of All-Stars and served as the unofficial host for the weekend’s festivities.\nIt was then that an 8-year-old Cade Cunningham realized he wanted to become an All-Star.\nFast forward to 2025, that goal is no longer a dream. It became a reality Thursday night when the Pistons guard was selected by the league’s head coaches as a reserve for the Eastern Conference player pool of All-Stars.\nOn Friday, before he lit up the scoreboard for 40 points to help Detroit defeat the Mavericks, Cunningham discussed why his goal of becoming an All-Star was an important box to check.\n“It’s a great league. It’s a lot of unbelievable players,” he said. “To be a part of that is something that I’ve always dreamt of. I’ve always wanted to be the best in basketball since I was a kid. To be in that conversation now, it’s a great feeling. There’s still more that I can climb.”\nThe path to becoming an All-Star wasn’t easy for the fourth-year guard, who missed most of his sophomore season because of surgery to repair a stress fracture in his left shin. He’s had a different head coach in each of the last three seasons: Dwane Casey, Monty Williams and now J.B. Bickerstaff. Lastly, the Pistons finished with the worst record in the NBA the last two seasons, which included tying an NBA record 28 straight losses in 2023-24.\nWith those trials are in the rearview mirror, Cunningham is having a breakout season while trying to put the Pistons (23-24) in contention for the Play-In Tournament. He holds season averages of 25.0 points, 6.4 rebounds and 9.3 assists, while shooting 45.4% from the field and 36% from 3-point range.\nHe is on pace for a career high in assists and ranks third in the NBA behind Atlanta Hawks guard Trae Young and Denver Nuggets center Nikola Jokic. He’s one of only eight players in NBA history to hold career averages of 21 points, seven assists and five rebounds, a group that also includes Luka Doncic.\nCunningham is the first Pistons player to become an All-Star since Blake Griffin in 2019.\n“I think it all lines up with what our plans are for this year,” he said. “We have more goals to go get now, but I think it’s been a great start to the year and we can finish the right way.”\nWhen did Cade Cunningham know he wanted to be an All-Star?\n— Mike Curtis (@MikeACurtis2) January 31, 2025\nHe was 8 when the NBA held All-Star Weekend at Cowboys Stadium in his hometown of Arlington, TX.\n“It was just cool. Dirk was my guy. He was an All-Star that year…I was a kid then. It’s crazy now being a part of it.” pic.twitter.com/jMfqBVFjjF\nCunningham spent Thursday night watching the announcement at a restaurant with his family, including older brother Cannen Cunningham, who played center for the SMU men’s basketball team from 2011 to 2015. The younger Cunningham was the fourth player announced as an Eastern Conference reserve, and the anticipation made him feel like watching the NBA draft lottery.\nIt was the latest instance of the national media attention Cunningham and the Pistons have received over the last month. He’s done interviews with TNT’s Inside the NBA crew, along with ESPN’s NBA Today. His improved play has coincided with more eyes on his game, including those of Charles Barkley.\n“I’m so happy for that kid,” Barkley said when Cunningham was revealed as an All-Star.\nAnd after watching Nowitzki compete in All-Star Games for the majority of his childhood, Cunningham is now in a similar position.\n“I was a kid then,” he said. “It’s crazy now being a part of it.”\nX/Twitter: @MikeACurtis2\nFind more Mavericks coverage from The Dallas Morning News here."
    },
    {
      "url": "https://www.dallasnews.com/topic/cooper-flagg/",
      "text": "Here are 10 games to keep tabs on as the Dallas Mavericks look to reclaim their status as a title contender.\nA meeting with the Lakers and Luka Doncic is part of a few interesting trends in the Mavericks’ schedule.\nFans will get a chance to see the No. 1 overall pick Cooper Flagg face off with the No. 2 overall pick Dylan Harper on the NBA’s opening night.\nSome of the Mavs’ stars will be chasing big milestones and making their way up the NBA’s all-time leaderboards.\nSee what sportsbooks think of the Mavericks in 2025-26 and which awards Dallas players could be candidates for.\nLively can relate to Flagg’s upcoming task of beginning his NBA career as a teenager.\nDallas is still winless this year against Indiana, but brought the WNBA to American Airlines Center for the second time this season.\nThe Mavs will hold camp in Vancouver, Canada from Sept. 30 through Oct. 4.\nWho better to help Dallas get to know Flagg than two reporters who’ve covered him since his lone season at Nokomis High School in Maine?\nMarshall spoke to reporters following the latest edition of the Mavs Academy Hoop Camp.\nMaxwell Lewis and Matthew Cleveland combined for 35 points in the win over Orlando.\nPlus, how a two-way guard out of Gonzaga, Ryan Nembhard, is a steal.\nScheffler won Best Golfer, while Flagg was named Best College Athlete in men’s sports.\nThe news came down shortly after this year’s No. 1 overall pick was in attendance at Dallas’ Summer League game.\nMaxwell Lewis was Dallas’ leading scorer with 23 points on the night.\nKevin Sherrington, Evan Grant and Shawn McFarland discuss the latest hot sports topics in North Texas.\nFlagg, the player coming to Dallas to save the Mavericks from last year’s disaster, is not yet a finished product.\nHarrison shared praise for Flagg after two impressive summer league showings.\nFlagg’s time in Vegas may have been short-lived, but there’s plenty to take away from his time on the court.\nHopefully Mavs fans got enough of a look at Flagg to hold them over until the preseason..."
    },
    {
      "url": "https://www.dallasnews.com/sports/mavericks/2025/07/23/luka-doncic-skinny-dallas-mavericks-la-lakers-offseason-nico-harrison-trade/",
      "text": "If you thought questions about Luka Doncic’s conditioning would disappear just because Nico Harrison no longer pushes the narrative, you’d be mistaken. A couple of recent NBA insider reports, including one this week from SportsDay alum Marc Stein, contend the new face of the Lakers franchise is “incredibly committed to his conditioning” and, in fact, has already “dropped significant weight.”\nOf course, we’ve heard and seen this before. Luka goes home to Slovenia, hits the sauna and posts a couple selfies of his summer glow-up.\nThen in January it looks like he might be driving through Freddy’s Frozen Custards after games for a concrete on the way back to the crib.\nLuka Doncic looking slim at Real Madrid game pic.twitter.com/2ysW9atB6M\n— NBAbzy (@nbabzyy) May 26, 2025\nConventional thinking is you should take these reports about his conditioning with a grain of salt, if not a dollop of whipped cream. Time and before-and-after photos will tell us about Luka’s commitment to his swimsuit-season look.\nJust the same, here’s what should give Nico pause, not to mention nightmares:\nWhat if Luka really means it this time? What if hanging around LeBron James at the gym made him a believer? What if he doubles down on his cardio?\nWhat if his motivation now is to stick it up Nico’s assertations?\nBecause if Luka made All-NBA first team five times when he’s a half-court heave from peak physical condition, imagine what he’d do when not sucking wind?\nCould he avoid those pesky injuries that have kept him from playing more than 66 games just twice in seven seasons? Could he play a little more defense? Could he extend his All-NBA stretch another decade or more?\nCould he reposition the Lakers as the center of the NBA universe along the way?\nNico is banking he’ll do none of the above or else he wouldn’t have traded him to a rival in the same conference. He’s so sure of it, he didn’t need long-term assurances such as multiple first-round picks. The forbidden notion of swapping a 26-year-old superstar for another six years older didn’t bother him. Why? Because he figures Luka’s All-Star window is no more wide open than Davis’, and the latter gives him a better shot at winning now, anyway.\nFor the record, let me repeat that I don’t necessarily disagree with some of Nico’s concerns about Luka. We’re not alone. Reggie Miller called out Luka during a broadcast a couple years ago. Reporters wouldn’t keep writing about his offseason workouts if it wasn’t a concern, and Luka wouldn’t keep posting pics.\nMy layman’s take on Luka based on years of field study is he’s a basketball savant who developed a killer instinct while hooping against grown men. While it no doubt accelerated his growth, it also probably contributed to the deferred adolescence we’ve witnessed when it comes to taking care of himself.\nHe’s also just 26, and as the father of four children at least the same age, let’s just say adulthood is occasionally a moving target.\nBasically, whatever Luka’s shortcomings, they don’t rise to the level of dumping a generational player early in his prime.\nRob Pelinka was all too glad that Nico was ready to do so. As the Lakers’ general manager said after the trade, the opportunity to acquire “a one-of-a-kind young superstar who will lead this franchise for years to come” doesn’t come around often. Never, even. ESPN not only ranked it just this week as the worst deal of the decade, the worldwide leader also called it “the worst, and perhaps the most shocking, transaction in NBA history.”\nSo there’s that.\nThe Lakers are all-in on Luka, if you were wondering. Before he went shopping for new players, according to reports, Pelinka asked for Luka’s list. Not LeBron’s. Luka suggested a rim-runner in Deandre Ayton as well as Flower Mound Marcus’ own Marcus Smart, who might help cover up some of Luka’s defensive deficiencies.\nFirst, though, Smart, 31, needs to get in better shape himself. Stein reports that a lack of conditioning last year with the Wizards was “an undeniable issue” for the former Defensive Player of the Year. The potential upside of his addition could thus be twofold.\nMaybe what the Mavs should have done instead of trading Luka was to get him a workout buddy.\nFor his part, Nico seems to believe all has worked out just fine for the Mavs after Cooper Flagg fell in their laps. Could be why he claimed the night of the draft that “fortune favors the bold.”\nThere was nothing bold about lucking into Flagg, but it certainly took some gall to trade Luka.\nFlagg’s addition redeems the Mavs’ future and, as long as everyone’s healthy, strengthens their chances of winning now. The problem is Nico improved a rivals’ chances, too. Now ... and into the next decade. As a bonus, he gave the new face of the Lakers the motivation to do what the Mavs wanted from him all along. The irony would make O. Henry weep.\nOn a related note, Luka should remember the wisdom of Jim Bouton, who related in “Ball Four” the words of a great philosopher:\nWhitey Ford always said that the way to make coaches think you’re in shape in the spring is to get a tan. It makes you look healthier and at least five pounds lighter.\nNever got off a sandlot myself, but the principle holds. When choosing a sunscreen’s SPF, I always go with “well done.”\nTwitter/X: @KSherringtonDMN\nFind more Mavericks coverage from The Dallas Morning News here."
    }
  ],
  "argos_summary": "The Dallas Mavericks are set to begin their 2025-26 NBA season on October 22 against the San Antonio Spurs, with a total of 80 games to determine their playoff prospects. Key matchups include a Christmas Day game against the Golden State Warriors and a highly anticipated return of Luka Doncic to American Airlines Center on January 24. The Mavericks have added new talent, including No. 1 overall draft pick Cooper Flagg and D'Angelo Russell, while navigating the absence of Kyrie Irving due to injury. The season will also feature the Mavericks' participation in the NBA Cup and a game in Mexico City against the Detroit Pistons.",
  "argos_id": "NS8FEF9WY"
}