{
  "url": "https://www.digitaltrends.com/gaming/you-need-to-drop-everything-and-play-these-three-playstation-plus-games-this-weekend-august-15-17/",
  "authorsByline": "Jesse Lennox",
  "articleId": "dce1531e33f542cc8fd41fdad9b807b2",
  "source": {
    "domain": "digitaltrends.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "OR",
      "county": "Multnomah County",
      "city": "Portland",
      "coordinates": {
        "lat": 45.5202471,
        "lon": -122.6741949
      }
    }
  },
  "imageUrl": "https://www.digitaltrends.com/wp-content/uploads/2022/11/Battlefield-2042-Season-3-new-map.jpg?resize=1200%2C630&p=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T16:00:00-07:00",
  "addDate": "2025-08-14T23:13:26.239398+00:00",
  "refreshDate": "2025-08-14T23:13:26.239399+00:00",
  "score": 1.0,
  "title": "You need to drop everything and play these three PlayStation Plus games this weekend (August 15-17)",
  "description": "You'll need to make extra time this weekend to make sure you have time to play these giant PlayStation Plus games.",
  "content": "Look, PlayStation fans, time is of the essence. I know the Battlefield 6 beta is happening as I write this and the temptation is high to sink all your time into that while it lasts. I get it, but why not save that excitement for the full game and play some full games? With Metal Gear Solid Delta and Lost Soul Aside coming out so soon, we all need to be extra judicious with how we spend our gaming hours. But, I also understand we need to be just as careful with our cash, which is why I found three games in the PS Plus library to clear your weekend for. The first pick is going to be a bit controversial, I know, but stick with me and I think you’ll understand what I’m getting at.\n\nOkay, I get why this looks like a bed recommendation. For one thing, the Battlefield 6 beta is currently in its last couple of days, so why would anyone want to play the old Battlefield, right? Secondly, isn’t this game totally busted and bad? I wouldn’t blame anyone for thinking the game is still a total dumpster fire, but it actually isn’t. Dice has steadily improved the game, squashing bugs, fixing performance, and steering the game closer to what traditional fans wanted it to be. Is it as good as Battlefield 6 is even in beta? No, but it is still a great Battlefield game…now. Plus, this might be the last game in a long time where you can play in 124-player battles. Even as a fun little experiment, I think it is worth giving a shot.\n\nBattlefield: 2042 is available now on PS4, PS5, Xbox One, Xbox Series X/S, and PC.\n\nWho doesn’t love blowing stuff up? The Battlefield games have become the gold standard for massive destruction in multiplayer games, but the first time we ever saw dynamic destructible environments in a real way was the Red Faction games. The first two entries are fine FPS games, but Guerilla completely blew everyone away with its realistic destruction. The Re-Mars-tered edition might have the worst name imaginable, but don’t let that dissuade you from actually playing it. There’s a decent enough plot about a resistance group on Mars to follow if you want, but the real fun of this game comes from running around and blasting everything to bits with high explosives to see how they fall down. It’s simple but oh so satisfying.\n\nRed Faction: Guerrilla Re-Mars-tered is available now on PS4, Xbox One, Switch, and PC.\n\n2023 was stuffed with so many great games that I’m still going back to titles I missed from that year, including Humanity. This puzzler is a bit like a modern Lemmings game where you control a Shiba Inu tasked with guiding crowds of humans through obstacles to reach the goal. You will place different actions on the level to get the flow of people to move or perform actions in specific spots to get them where they need to be. There are also a few optional objectives in the levels for an extra challenge. This is a perfect example of a puzzle game that is easy to understand but gets rather complex and tricky by the end. And, if you happen to own a VR headset, you can play it all in virtual reality.\n\nHumanity is available now on PS4, PS5, Xbox One, Xbox Series X/S, and PC.",
  "medium": "Article",
  "links": [
    "https://store.steampowered.com/app/1581480/HUMANITY/",
    "https://store.steampowered.com/app/1517290/Battlefield_2042/",
    "https://www.digitaltrends.com/gaming/mafia-the-old-country-wont-satisfy-your-gta-6-cravings-play-these-instead/",
    "https://www.digitaltrends.com/gaming/everything-you-need-to-know-about-the-ps5-price-specs-games-and-more/",
    "https://www.digitaltrends.com/gaming/is-metal-gear-solid-delta-snake-eater-cross-platform/",
    "https://www.digitaltrends.com/gaming/i-suck-at-battlefield-6-but-i-havent-had-this-much-fun-with-the-franchise-since-bad-company-2/",
    "https://store.steampowered.com/app/667720/Red_Faction_Guerrilla_ReMarstered/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "multiplayer games",
      "weight": 0.112122186
    },
    {
      "name": "fine FPS games",
      "weight": 0.106852084
    },
    {
      "name": "a great Battlefield game",
      "weight": 0.068491
    },
    {
      "name": "Xbox Series X",
      "weight": 0.06643183
    },
    {
      "name": "Xbox One",
      "weight": 0.06488254
    },
    {
      "name": "The Battlefield games",
      "weight": 0.064204186
    },
    {
      "name": "so many great games",
      "weight": 0.064127974
    },
    {
      "name": "the Red Faction games",
      "weight": 0.0640142
    },
    {
      "name": "a modern Lemmings game",
      "weight": 0.06310789
    },
    {
      "name": "the last game",
      "weight": 0.060357843
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    },
    {
      "name": "Playstation"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.947265625
    },
    {
      "name": "/Computers & Electronics/Consumer Electronics/Game Systems & Consoles",
      "score": 0.490478515625
    },
    {
      "name": "/Games/Computer & Video Games/Action & Platform Games",
      "score": 0.37646484375
    }
  ],
  "sentiment": {
    "positive": 0.19731002,
    "negative": 0.43117517,
    "neutral": 0.3715148
  },
  "summary": "The article suggests that while the Battlefield 6 beta is taking place, PlayStation fans should focus on other games like Metal Gear Solid Delta and Lost Soul Aside. The article also recommends three games in the PS Plus library, including Battlefield: 2042, Red Faction: Guerrilla Re-Mars-tered, and Humanity. The first pick is controversial as it is still a great Battlefield game, despite the recent improvements to the game by Dice. The second pick is a puzzle game, Humanity, where players control a Shiba Inu to guide crowds of humans through obstacles to reach the goal. The third pick is Battlefield: Battlefield 2042.",
  "shortSummary": "Three PlayStation Plus games, including Battlefield: 2042, Red Faction: Guerrilla Re-Mars-tered, and Humanity: 2023, are recommended for play this weekend despite the ongoing Battlefield 6 beta.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "518c1ae72ac24f8584fb401c07d49a50",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.digitaltrends.com/gaming/i-suck-at-battlefield-6-but-i-havent-had-this-much-fun-with-the-franchise-since-bad-company-2/",
      "text": "Gripping my LMG for dear life, I dodged incoming fire as my squad rushed the objective. Smoke and debris filled the air and gunshots echoed off the canyon walls. I could barely see my own teammates a few feet ahead of me in all the chaos, let alone the enemy soldiers laying down fire on us.\nA second squad was picked off in the advance and the zone was too hot for me to stop and revive them. I slide into what I hope is cover on the slope to a sniper’s nest and lay down my resupply bag. I had no idea if it would do any good, but I felt I needed to do something. From there, I darted around the chokepoint, sliding between barricades, sandbags, and rocks for cover, using my defibrillator to keep my team and our reinforcements in the game. I catch glimpses of the enemy multiple times, and even lay down some fire, but it is all I can do to land a few shots among the chaos.\nWhen I’m eventually shot down with no earthly idea where my attacker was, I accept my fate and hope I did something to help my team.\nOnly to suddenly see myself getting dragged out of the killzone as a friendly tank rolls ahead and draws all the incoming fire. I’m saved, falling back to heal before I get back into the fray to keep my team alive.\nChaos and earthquakes\nI lost that match of the Battlefield 6 beta. But we held that point, and that’s the story I’m going to tell. The last time I had stories like that in a multiplayer shooter that I can recall was Battlefield: Bad Company 2 on the Xbox 360. I was able to spend hundreds of hours in that game thanks to how it lent itself to so many emergent moments in gameplay. The combination of destruction, large-scale battles, and complementary classes hooked me in a way few games ever had.\nOh, and I was good.\nNow, however, things have changed. It’s been over a decade since Bad Company 2 and I’ve lost that sharp eye I once had. I can still aim decently, but I find myself having a much more difficult time spotting enemies in modern games. I could chalk it up to the better graphics making characters stand out less, my eyes just not being what they once were, or both. Either way, I knew I was going to struggle to pull my weight starting the Battlefield 6 beta.\nExcept that wasn’t the case. Yes, I was still outgunned in 90% of firefights, but that didn’t mean I wasn’t contributing. In fact, I was arguably more effective when I didn’t shoot my gun. That’s something that has always been a part of the Battlefield experience, but has been eroded over time. With Battlefield 6, not only can I make a meaningful impact on the game in ways that didn’t involve killing, but it was just as engaging.\nFor all of you who can land crazy flick shots and can lock on to enemy heads when only a single pixel is exposed, you’ll be well served here as well. The times I was able to tap into my old skills for a few moments and deal some death of my own were fantastic, but I think Battlefield 6 wants you to find a balance.\nThe giant maps, destructible environments, vehicles, and classes aren’t core to the Battlefield experience just because they are required to help sell the fantasy (or nightmare) of actually participating in a warzone-like experience. They do do that, but they also contribute to a theme of collaboration. No matter what you’re trying to do, whether it be attacking a point on foot or blasting through a choke point with a vehicle, nothing in Battlefield 6 can be accomplished on your own. Not only that, but you also need every single skillset available if you want to win.\nThat’s what this beta has going in spades right now — it creates stories and moments regardless of raw shooting skill. I played solo with my mic off, but teamwork just came naturally. This could’ve just been my good fortune, but players wanted to stick together, resupply, wait for engineers to repair vehicles, and follow pings. I think Battlefield 6 subtly conditions players to want to play more collaboratively because going off on your own just isn’t fun. You might get a couple of kills, but the adrenaline you feel participating in a clash between two forces where nothing goes to plan is the real prize.\nTime will tell if Battlefield 6 has the legs to keep me engaged like Bad Company 2 once did, but if this beta is anything to go by, this might be the return to form I’ve been waiting for."
    },
    {
      "url": "https://www.digitaltrends.com/gaming/is-metal-gear-solid-delta-snake-eater-cross-platform/",
      "text": "The original Metal Gear Solid 3: Snake Eater is one of the best PS2 games of all time. Being the earliest game in the Metal Gear timeline, it is also the perfect game to get a remake for PS5, Xbox Series X/S, and PC with a revived Fox Hunt multiplayer mode. The main draw of the game is still the epic stealth-action single player campaign, but the unique hide-and-seek-based gameplay of Fox Hunt garnered a cult following back in the day and has a great chance of being an even bigger hit with this remake. But aside from learning when we can start playing that multiplayer mode, the big question is whether or not Metal Gear Solid Delta will have cross-platform support. We know there are differences between the versions, so let’s see what we know about crossplay so far.\nIs Metal Gear Solid Delta: Snake Eater cross-platform?\nWe were originally in the dark as to whether or not Metal Gear Solid Delta would have cross-platform support, but as of August 13, we finally got an answer. Posted on the official Japanese Metal Gear X account, we learn (via translation) that crossplay between platforms will not be supported.\nThat means that PS5, Xbox Series X/S, and PC players will not be able to compete in stealth-action multiplayer matches together when the online mode launches. This is a rather baffling move, as very few non-exclusive multiplayer games do not have cross-platform support anymore. We have seen some examples of games launch without crossplay in the past that later added it so there is hope, but I don’t get the impression that this is a priority for Konami.\nWhen will Metal Gear Solid Delta: Snake Eater’s online mode launch?\nJust as important as knowing whether the game will be cross-platform is knowing when the online mode will launch. The base game will be out on August 28, but according to the official Konami website, Fox Hunt is currently scheduled for “fall 2025.” That timeframe could theoretically be any time between September and November so I will keep my ears open and update you as soon as we get a firm launch date."
    },
    {
      "url": "https://www.digitaltrends.com/gaming/mafia-the-old-country-wont-satisfy-your-gta-6-cravings-play-these-instead/",
      "text": "The wait for GTA 6 only seems to get more and more unbearable the closer we get. May 26, 2026, is still a long way away to wait for an upcoming video game, though, and we’re all looking for something to fill the void. There’s no replacing a GTA game. If there were, we wouldn’t be so ravenous for a new one, but that doesn’t mean there aren’t games that get just close enough to satisfy — like an appetizer before the main course.\nMafia: The Old Country just released and is decidedly not that game. There are things to like about it, but if you were hoping it would scratch that open-world sandbox itch, you will be thoroughly disappointed. If you were counting on this game to tide you over until GTA 6 comes, not to worry because I found a handful of old and upcoming PS5 and Xbox Series X titles that will do the trick.\nMafia 3\nThe reason many of us thought The Old Country would quench our thirst for a GTA-like game is largely due to the fact that the last game in the series was essentially that — a GTA game set in the ’60s. While it can’t match the size or scope of even GTA 5, Mafia 3 will give you that open-world narrative and third-person action you’re looking for. The setting and narrative have always been the strengths of the Mafia games, and that’s still true in The Old Country, but the vibe and feeling of this New Orleans-inspired city with classic cars and music from the time make it such an immersive experience. There’s not as much side content or crazy ways to cause chaos, but this is the Mafia game to go for.\nSleeping Dogs\nSleeping Dogs deserved so much better. It has thankfully reached more of a cult status since it launched, but it struggled upon release despite being such a polished title. This is a bit of an older game now, but there is a definitive version that polishes it up for last-gen systems that still looks great. The easiest pitch for this game is to imagine a GTA game set in Hong Kong where you play as an undercover cop infiltrating a triad gang. There’s plenty of driving and shooting, but hand-to-hand combat reminiscent of Arkham combat and parkour movement is especially fresh for the genre. With the option to align yourself with the criminals or police, it puts more weight on your choices in and out of missions. Don’t sleep on this one!\nCyberpunk 2077\nMost of these entries could be sold as “GTA but set in X,” where X could mean a location or time period and that’d be enough to sell it for most games. Cyberpunk 2077 isn’t just GTA but in the cyberpunk future — it’s even better. Now that the game is all fixed up and the systems are working as intended. Night City is as much a living, breathing world as anything RockStar has made, which is a statement I don’t make lightly. In fact, if you dig the whole corporate dystopian, light body-horror-esque theme of this world, it may be even better. The main plot is great, but all the side missions dealing with various repercussions and extremes of a future where cybernetics are fully integrated into our bodies are the real meat this game gives you to chew on.\nGhost of Yotei\nThe first of two upcoming games I want to highlight is just around the corner. Ghost of Yotei is a PS5 exclusive and sequel to Ghost of Tsushima, which was a standout open world game from 2020. This game looks to be more of that, but better. The world is almost unbelievably stunning this time around. The vistas, colorful trees, and wide open fields are begging to be explored. This is yet another revenge story, but we’ve already seen plenty of freedom in exploration and side activities in the world. I can’t say with absolute certainty this game will be as great as I hope, but if the first game is anything to go by then the odds are pretty good it will be.\nThe Outer Worlds 2\nSure, The Outer Worlds is more of a Fallout-like than GTA, but I think it can serve both audiences. You aren’t getting one big, interconnected world to roam around, but several hubs like the first game. However, like that first game, The Outer Worlds 2 promises much deeper and intentional level design and quests. I would say this game fits the bill if you wanted to inject more roleplaying into your GTA experience. You might also not expect a ton of emergent gameplay, but if past Obsidian games are anything to go by, you should expect the game to react and adapt based on your actions in some surprising and fun ways. Again, the proof will be in the pudding when this game comes out this fall, but at least it isn’t an $80 game anymore, right?"
    },
    {
      "url": "https://www.digitaltrends.com/gaming/everything-you-need-to-know-about-the-ps5-price-specs-games-and-more/",
      "text": "The undisputed king of this console generation is the PS5, but what about this machine pushed it so far ahead of the competition? Both the PlayStation 5 and Xbox Series X/S consoles had a rough start to the generation. They launched under unfortunate circumstances, with both a global pandemic and supply issues making them difficult to get for months after launch. Thankfully, around five years into the generation, and with all eyes looking at what the PS6 could be, the PS5 is easily accessible and hitting its stride with amazing upcoming video games. This is the most popular console on the market, but if you don’t have one yet, you might not understand why it is so popular over the Xbox or Nintendo Switch 2. I’ll run down all the biggest points you should know about the PS5 if you’re looking to pick one up, including the price, specs, games, and more.\nPS5 specs\n| Dimensions | 19.6 x 7.1 x 16.8 in or 17 x 6.5 x 13.8 in for the Slim |\n| Weight | 10.54 pounds or 7.06 pounds for the Slim |\n| Color | Black and white |\n| CPU | 3.5GHz Custom Zen 2 |\n| GPU | 10.28 TFLOPS 2.23GHz |\n| Memory | GDDR6, 16GB |\n| Memory bandwidth | 448GBps |\n| Storage | 825GB SSD or 1TB SSD for the Slim |\n| Optical drive | Yes |\n| 4K | Yes |\n| HDR | Yes |\n| Ports | Includes USB and NVME slot |\n| Online subscription | PS Plus |\n| Price | Digital: $450 Disc: $500 Slim Disc: $500 Slim Digital: $450 |\n| Digital Trends review | 4.5/5 |\nThere are two base versions of the PS5 on the market right now: the PS5 and the PS5 Slim. There’s also the PS5 Pro, but that’s such a unique case that I’m going to give that its own section later on. The Slim is basically just the newer model of the original PS5 that has no performance boosts, just a bit more memory, and a smaller form factor. There are still digital and disc versions for each to pick from, depending on whether or not you want to purchase physical games or use its Blu-Ray player.\nIn terms of raw power, the PS5 is the strongest home console on the market. You can check out all the chips and terraflops if you like, but the PS5 games with the best graphics speak for themselves. Even games that are available on both PS5 and Xbox Series X tend to look and/or run better on the PS5. And there’s no competition when comparing it to the Switch 2.\nPS5 design\nThere are two main design options for the PS5, depending on whether you’re looking at the base unit or the Slim. There’s also a slight difference if you opt for the disc vs. digital versions, but that’s splitting hairs a bit.\nThe original PS5 is ugly. Some people might like its strange aesthetic, but most people agree that it is a big eyesore and stash it away out of sight wherever they can. The revised design of the PS5 Slim is slightly better, but still not something most people would want to display. It is thankfully a good deal smaller, plus it has a nice divide in the faceplate so it isn’t a solid block of color, but still has the same general shape.\nPS5 price\nYou have a lot of different models and types of PS5 to pick from at various price points. The lowest you will pay right now is $450, which is the cheapest option out there for this level of power. You can get a Series S for less or a Switch 2 for the same price, but all PS5 models outclass those two in power.\nIf you want a disc drive, you will be looking at a $500 investment for a new system. Of course, now that they have been out on the market for so many years, you should be able to find a used or discounted one fairly easily.\nPS5 controllers\nThe standard DualSense controller is the best PlayStation controller yet. It has all the functionality of the old DualShock 4, plus haptic feedback and adaptive triggers that make games that much more tactile. The stick and button layout is all unchanged, including the parallel sticks. If you loved any previous Sony controller, you will love this one too.\nFor enthusiasts, there’s also the DualSense Edge. While a bit on the pricy side, it does allow for more customization options and adds back paddles. The one universal downside on the PS5 controllers is their battery life. The base DualSense lasts only around 8 hours, give or take depending on the game, while the Edge actually dies faster despite the higher price.\nPS5 games\nEvery major third-party and indie game is present and accounted for the on the PS5. But it gets even better, because now most former Xbox exclusives are also on PlayStation in addition to Sony’s own first-party games that can’t be played anywhere else. That only leaves Nintendo exclusive games as the only segment of games missing from the library. With all that taken into account, the PS5 easily has the most robust and wide selection of games.\nSpecial mention has to go to its own exclusives, though. These are some of the best PS5 games, with games like Spider-Man 2, Death Stranding 2, and Demon’s Souls all being some of the best the console has to offer.\nPS5 Pro\n| PlayStation 5 | PlayStation 5 Pro | |\n| CPU | 8-core AMD Zen 2 @ 3.5GHz | 8-core AMD Zen 2 @ up to 3.85GHz |\n| GPU | 10.28 TFLOPs, 36 CUs at 2.23GHz (Variable Frequency) | 16.7 TFLOPs, AMD Radeon, RDNA graphics engine |\n| Memory | 16GB GDDR6 | 16GB GDDR6/256-bit |\n| Internal Storage | Custom 1TB SSD | 2TB SSD |\n| External Storage | NVMe SSD slot, USB HDD | NVMe SSD slot, USB HDD |\n| Video Output | 4K at 120Hz, 8K | 4K at 120Hz, 8K |\n| Wi-Fi | Wi-Fi 6 | Wi-Fi 7 |\n| Price | $500 | $700 |\nJust like in the PS4 generation, Sony released a mid-generation upgrade called the PS5 Pro. You can compare the specs above, but the main thing to note is that it has the exact same CPU but a better GPU. What this means is that the Pro can push graphics further, but not necessarily make more complex games. What this mostly looks like is allowing you to play games without having to pick between performance or quality mode and instead getting the best of both worlds in one. It also comes standard with 2TB of storage space, which is double the amount you can get in a normal PS5.\nThat extra storage space is important because the Pro has no disc version available. You can purchase the attachable disc drive as a separate purchase for an additional $80 if you have a collection of physical games you want to keep playing.\nEven though the PS5 Pro can more easily hit 4K, that isn’t anything the base PS5 can’t do in quality mode in the same games. And if you don’t have a TV that supports those higher graphics like 4K anyway then it would be a moot point. The Pro does have a new upscaling technology called PlayStation Spectral Super Resolution (PSSR) that uses machine learning to improve the resolution of games. This is more of a benefit for developers and is likely to be a bigger deal when it is improved upon for the PS6.\nDesign-wise, the PS5 Pro sticks to the same overall design as the previous versions, but is closest to a Slim. The only real difference is that it has more ridges on the diagonal faceplate slit.\nRemember that this is a Pro, not a PS6. There are no games that will only run on the Pro that you can’t also play on a base PS5. It is a great option if you want the latest and greatest tech, or don’t want to have to choose between quality and performance mode, but by no means essential.\nPlayStation Plus\nSony’s competitor to Game Pass is the three-tiered PlayStation Plus service. The Essential tier gives you three “free” games per month, the ability to play online, and cloud saves. Extra adds in a catalogue of PS4 and PS5 games to download, and the Premium tier gives you access to PS1, PS2, PSP, and PS3 (via streaming) games on top of it all. Here’s how much each one will cost at the time of writing:\n- Essential – $80 per year\n- Extra – $135 per year\n- Premium – $160 per year\nEssential is the easiest tier to recommend, but if you’re new to PlayStation or know you will take advantage of having access to all these games, even if you aren’t fully in control of what is added or removed, then the Extra tier offers great value. Premium has the least broad appeal, but if you enjoy retro games or want to revisit childhood classics from the early PlayStation days, this is the easiest way to do it.\nIt’s never too late to join in on the fun, so if you’re ready to take the plunge and get yourself a PS5, you may also want to get some of the best PS5 accessories, best PS5 headsets, and, of course, the best PS5 games."
    }
  ],
  "argos_summary": "The article discusses the importance of managing gaming time and finances for PlayStation fans, especially with upcoming titles like Metal Gear Solid Delta and Lost Soul Aside. It highlights three recommended games from the PS Plus library: Battlefield 2042, which has improved significantly and offers large-scale battles; Red Faction: Guerrilla Re-Mars-tered, known for its dynamic destructible environments; and Humanity, a puzzle game that challenges players to guide crowds through obstacles. Additionally, it touches on the PS5's specifications, design, and game library, emphasizing its popularity and performance compared to competitors.",
  "argos_id": "OB6U6NJEQ"
}