{
  "url": "https://www.morningstar.com/news/pr-newswire/20250814cn51563/cctv-china-up-close-zhejiang-tour-explores-deqing",
  "authorsByline": "",
  "articleId": "fa902dc01e9c436994c76e8d4cddbde7",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T20:10:00-05:00",
  "addDate": "2025-08-15T01:55:06.295844+00:00",
  "refreshDate": "2025-08-15T01:55:06.295848+00:00",
  "score": 1.0,
  "title": "CCTV+: China Up Close: Zhejiang Tour Explores Deqing",
  "description": "",
  "content": "BEIJING, Aug. 14, 2025 /PRNewswire/ -- From August 8 to 10, 2025, the \"China Up Close Series: Zhejiang Tour\" brought a contingent of nearly 70 journalists and editors from South Korea, Spain, Bulgaria, and Iceland to Deqing, a county in Zhejiang province. Alongside CGTN (China Global Television Network), they trained their cameras and notebooks on the area, aiming to capture its landscapes, history and cultural rhythms for audiences abroad.\n\nThe articles, information, and content displayed on this webpage may include materials prepared and provided by third parties. Such third-party content is offered for informational purposes only and is not endorsed, reviewed, or verified by Morningstar.\n\nMorningstar makes no representations or warranties regarding the accuracy, completeness, timeliness, or reliability of any third-party content displayed on this site. The views and opinions expressed in third-party content are those of the respective authors and do not necessarily reflect the views of Morningstar, its affiliates, or employees.\n\nMorningstar is not responsible for any errors, omissions, or delays in this content, nor for any actions taken in reliance thereon. Users are advised to exercise their own judgment and seek independent financial advice before making any decisions based on such content. The third-party providers of this content are not affiliated with Morningstar, and their inclusion on this site does not imply any form of partnership, agency, or endorsement.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "such content",
      "weight": 0.10998795
    },
    {
      "name": "third parties",
      "weight": 0.10913769
    },
    {
      "name": "content",
      "weight": 0.106380716
    },
    {
      "name": "Zhejiang Tour",
      "weight": 0.09101119
    },
    {
      "name": "China Global Television Network",
      "weight": 0.08766449
    },
    {
      "name": "Such third-party content",
      "weight": 0.0838672
    },
    {
      "name": "third",
      "weight": 0.08099861
    },
    {
      "name": "Morningstar",
      "weight": 0.08080289
    },
    {
      "name": "third-party content",
      "weight": 0.08035313
    },
    {
      "name": "Zhejiang province",
      "weight": 0.07651448
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.9541015625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.380126953125
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Other",
      "score": 0.341552734375
    },
    {
      "name": "/News/Local News",
      "score": 0.339111328125
    }
  ],
  "sentiment": {
    "positive": 0.19736257,
    "negative": 0.115747616,
    "neutral": 0.6868898
  },
  "summary": "The \"China Up Close Series: Zhejiang Tour\" took place from August 8 to 10, 2025, featuring nearly 70 journalists and editors from South Korea, Spain, Bulgaria, and Iceland. The tour was part of an effort to capture the area's landscapes, history, and cultural rhythms for international audiences. However, Morningstar does not guarantee the accuracy, completeness, timeliness, or reliability of any third-party content.",
  "shortSummary": "A major international tour, featuring 70 journalists and a team of experts, explored Deqing in China's Zhejiang province to capture the nation's cultural heart.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "aad95d6795f245d6a4e83a9411abc2f4",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "From August 8 to 10, 2025, the \"China Up Close Series: Zhejiang Tour\" hosted nearly 70 journalists and editors from various countries, including South Korea, Spain, Bulgaria, and Iceland, in Deqing, Zhejiang province. The event, organized in collaboration with CGTN, aimed to showcase the region's landscapes, history, and culture to international audiences.",
  "argos_id": "OLND309B9"
}