{
  "url": "https://www.washingtontimes.com/news/2025/aug/14/viktor-hovland-goes-low-storms-scottie-scheffler-birdies-no-18-shoot/",
  "authorsByline": "George Gerbo, The Washington Times https://www.washingtontimes.com, https://www.washingtontimes.com/staff/george-gerbo/",
  "articleId": "9b48c7d8afe24134be93ac2a1016da43",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2025/08/14/DSC_4746_c0-201-4829-3017_s1200x700.jpg?ff4d3e4afc59a3b82bc71cb5c0981d5076d55939",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T00:12:27+00:00",
  "addDate": "2025-08-15T00:16:32.634577+00:00",
  "refreshDate": "2025-08-15T00:16:32.634578+00:00",
  "score": 1.0,
  "title": "Hovland goes low before storms, but Scheffler birdies No. 18 to shoot 66 at BMW Championship",
  "description": "Viktor Hovland posted a 67 to take the clubhouse lead before storms interrupted play Thursday afternoon during the first round of the BMW Championship, but Scottie Scheffler birdied his final hole after the rain to best him with a 4-under-66.",
  "content": "OWINGS MILLS, Md. — Viktor Hovland posted a 67 to take the clubhouse lead before storms interrupted play Thursday afternoon during the first round of the BMW Championship, but Scottie Scheffler birdied his final hole after the rain to best him with a 4-under-66.\n\n“I had a great start and a great finish. In between was a little bit ’meh,’” Scheffler said. “I don’t know, I felt like I hit a lot of fairways today. I think I maybe missed one on 16 and I think I missed a fairway on 10, but other than that, I was in the fairway a lot today. Last week I felt like I didn’t drive it as good as I would have hoped to, so going into this week, I felt like I definitely drove it better around this course.”\n\nHovland carded six birdies and three, front-nine bogeys for his round, including birdies on both par 5s, Nos. 4 and 16. Scheffler matched him on birdies, including three of the final four holes, while committing one fewer bogey. Scheffler finished his round by curving a nearly 26-foot putt into the hole from just inside the fringe on No. 18.\n\n“The irons were pretty solid,” Hovland said. “Hit a lot of really nice iron shots, especially kind of coming down the stretch because there’s some pretty tough finishing holes in there. Like 17 and 18, hit a nice 5-iron into 17, made the putt, and even 18, I’m there with a 6-iron into a pretty narrow green.”\n\nScheffler, the world No. 1, does not have to worry about his FedEx Cup Playoffs status. Hovland’s round, meanwhile, tremendously boosted his chances of staying inside the top 30 and advancing to next week’s Tour Championship. A FedEx Cup champion in 2023, Hovland entered this week on the playoff bubble at No. 28, falling two spots after finishing tied for 32nd at last week’s St. Jude Championship.\n\n“I guess there’s something about kind of having your back against the wall and having to perform,” Hovland said. “I think sometimes I can get too much into my head about swing mechanics and all that stuff, which I still think is important, but I think when you’re in the playoff and I’m 28th and top 30 advances, it’s like, all right, we kind of have to forget about that stuff a little bit this week and just go out there and play, and I do think that’s definitely helping me in the short term.”\n\nPlay was halted for more than two hours in the mid-afternoon as lightning and intense rain swept across Caves Valley’s rolling terrain.\n\n“Golf course is in good shape. We’ll see how it plays over the next few days,” Scheffler said. “I would have preferred to not get the rain to keep the firmness of the golf course, but overall we’ll see how it develops and changes over the next few days, and we’ll see.”\n\nAlong with Hovland, 12 other players were able to finish their rounds before the suspension, including Michael Kim, who recorded three birdies on the front nine for a two-under 68.\n\n“I felt like every part of my game was pretty solid. Only missed like one or two drives off the tee and hit some wedges close,” Kim said. “Putted it nice, chipped it pretty nice. Felt like everything was pretty good today.”\n\nKim needs an even stronger push than Hovland to make it to East Lake for the first time. He began today at 42nd in the standings, but was projected just inside the top 30 following his round.\n\n“If you had told me I’d be top 50, I would have just signed right there and just watched everyone else play,” Kim said. “But once I had a really good stretch in that beginning to the middle part of the season, I really wanted to make the push for the Tour Championship.”",
  "medium": "Article",
  "links": [
    "https://goo.gl/forms/xGjXcUKYsKxMeCUl1",
    "https://www.washingtontimes.com/topics/scottie-scheffler/",
    "https://www.washingtontimes.com/topics/viktor-hovland/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Viktor Hovland",
      "weight": 0.073457286
    },
    {
      "name": "Hovland",
      "weight": 0.07337712
    },
    {
      "name": "Last week",
      "weight": 0.07089645
    },
    {
      "name": "Scottie Scheffler",
      "weight": 0.06524438
    },
    {
      "name": "Scheffler",
      "weight": 0.061874934
    },
    {
      "name": "intense rain",
      "weight": 0.06078956
    },
    {
      "name": "BMW Championship",
      "weight": 0.060513865
    },
    {
      "name": "No",
      "weight": 0.059191428
    },
    {
      "name": "Nos",
      "weight": 0.059191428
    },
    {
      "name": "Tour Championship",
      "weight": 0.058810513
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97705078125
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.537109375
    },
    {
      "name": "/Sports/Individual Sports/Golf",
      "score": 0.484375
    }
  ],
  "sentiment": {
    "positive": 0.22222504,
    "negative": 0.35979438,
    "neutral": 0.41798058
  },
  "summary": "Viktor Hovland led the first round of the BMW Championship with a 67, but Scottie Scheffler came back with a 66. Hovlands' performance was interrupted by rain, which halted play for more than two hours. Schefflers finished his round with a score of 4-under-66. This performance significantly boosted his chances of advancing to the Tour Championship next week. Play was suspended before Hovlander's round could finish, with Michael Kim finishing with a two-under 68.",
  "shortSummary": "Vincenco Hovland posted a 67 before storms interrupted play, while Scott Scheffler posted a 66 to lead the BMW Championship.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "3bdb1adb1c8a494bb3bdbbb51a28c520",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Scottie Scheffler took the lead in the BMW Championship with a 4-under-66 after birdying his final hole, while Viktor Hovland, who posted a 67, initially held the clubhouse lead before play was interrupted by storms. Hovland's strong performance is crucial for his chances to advance to the Tour Championship, as he is currently on the playoff bubble. Michael Kim also performed well with a 68, moving closer to qualifying for the Tour Championship.",
  "argos_id": "OMXGL5VOF"
}