{
  "url": "https://www.businessinsider.com/retire-early-fast-travel-couple-felt-exhausted-stress-2025-8",
  "authorsByline": "Kelly Benthall",
  "articleId": "0dbc3c1b074442889445b1228e8c4637",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/689cadc8a17a8c5b4052cbae?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T00:14:01+00:00",
  "addDate": "2025-08-15T00:19:33.252767+00:00",
  "refreshDate": "2025-08-15T00:19:33.252769+00:00",
  "score": 1.0,
  "title": "We retired early to see the world — but fast travel made life feel stressful again",
  "description": "Kelly Benthall, 54, and her husband retired early. Five weeks of fast-paced travel through the UK and Ireland confirmed her preference for slow travel.",
  "content": "Plain and simple — hold the tomatoes — fast travel is exhausting.My husband Nigel and I retired early last year to slow travel the world. We've made it a habit to stay in one place for a month. It feels long enough to unpack, exhale, and feel like we live there.But this summer, we broke our own rules.We planned a five-week sprint through the UK and Ireland — seven stops in quick succession, most just five days long. We started in Dorset with a brief, emotionally heavy family visit, then made our way through Cornwall, the Cotswolds, the Lake District, Edinburgh, North Wales, and finally ended with a three-day finale in Dublin.It was part memory lane, part reunion tour, and a whole lot of intentional sightseeing. Some stops held memories for Nigel, others were entirely new. It was a chance for both of us to explore his home country with fresh eyes.We packed in everything from castles and sea cliffs to wild ponies, old friends, long walks, and short pub chats.It felt like an affair, not with a person, but with a different kind of travel. A thrilling, nostalgic, completely unsustainable fling with speed.Love Business Insider? Add Business Insider as a preferred source on Google to see more of us.By the numbers:It was a whirlwind of firsts — and then the crash.By the end of the trip, my legs were stronger than ever, thanks to all the walking and staircases — many of which felt too narrow for a modern human with luggage.But the rest of me shut down. After Dublin, when we finally arrived at our more long-term monthlong Airbnb in Killaloe, Ireland, I slept for a full day. Even after that, I felt drained.Four days in, my mind was still on high alert — scanning for surprises, wrong turns, or a crowd around the corner. That internal alarm system — so helpful while navigating new terrain — didn't know how to switch off.We had also spent more money than usual. Without monthlong Airbnb discounts or home-cooked meals, the costs added up. We indulged in well-regarded restaurants nearly every day, and we felt it in both our budget and our waistlines.There were a couple of late nights too — 2 a.m. pub closings and dance floors I used to keep up with, but that now leave us wrecked the next day. That's not our rhythm anymore.During the trip, we pushed hard to do each region justice — hiking to hidden waterfalls, exploring caves, storm-watching over valleys, and wandering historic streets.And then it hit me, we were those tourists. Respectful, yes. Grateful, always. But always on the move, like playground visitors: admiring the beauty, but never staying long enough to earn trust.It was the opposite of what slow travel makes possible — the chance to return to the same café twice, to learn names, to show up not just as a guest but as a quiet part of the scenery.That tension wore on me. We were seeing everything, but belonging nowhere.The pace wasn't just a physical strain, but mental as well.Fast travel began to mimic the stress patterns of the life we left behind. Before we retired, I spent decades in a high-pressure career, always scanning, solving, planning the next thing.It took me a lot of work to untangle myself from that rhythm. Yet here I was again, dreaming of logistics, overloading my senses, and feeling that familiar hum of burnout.I'd also taken up writing in retirement, but somewhere between documenting it all and trying to feel it, I lost the thread.We had no buffer. No pause. Just momentum.And yet, the moments still shone.We found awe on many occasions: sea shanties in a Cornish pub that left us teary, storm clouds that rolled over the lakes like theater curtains, and yes — sharing a pint while standing in line for a castle.We watched sheep graze near medieval stone circles. We wandered through St. Giles as sunlight streamed through stained glass. Nigel even got pulled onstage to dance in Dublin — whiskey in hand, the crowd cheering.We were wrecked. But we were alive.Now we're in a quiet town in Ireland, finally staying put for a full month. One Airbnb. One grocery shop. No checkouts to plan.We didn't retire early to rush life, we did it to be present.Fast travel showed us what we could cram in. Slow travel reminds us why we left the rush behind.Do you have a story about retiring abroad that you want to share? Get in touch with the editor: akarplus@businessinsider.com.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Fast travel",
      "weight": 0.06898432
    },
    {
      "name": "fast travel",
      "weight": 0.06898432
    },
    {
      "name": "Slow travel",
      "weight": 0.061337654
    },
    {
      "name": "slow travel",
      "weight": 0.061337654
    },
    {
      "name": "travel",
      "weight": 0.057932366
    },
    {
      "name": "long walks",
      "weight": 0.05152739
    },
    {
      "name": "short pub chats",
      "weight": 0.048505094
    },
    {
      "name": "part reunion tour",
      "weight": 0.04844794
    },
    {
      "name": "part memory lane",
      "weight": 0.047887664
    },
    {
      "name": "monthlong Airbnb discounts",
      "weight": 0.047396358
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/Travel & Transportation/Travel Guides & Travelogues",
      "score": 0.84619140625
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Other",
      "score": 0.80126953125
    },
    {
      "name": "/Travel & Transportation/Other",
      "score": 0.458740234375
    }
  ],
  "sentiment": {
    "positive": 0.12473698,
    "negative": 0.53278166,
    "neutral": 0.34248134
  },
  "summary": "The author and her husband, Nigel, retired early last year to slow travel the world, but fast travel made life feel stressful again. They experienced a five-week sprint through the UK and Ireland, with seven stops in quick succession, most just five days long, ending in Dublin. The trip was part memory lane, part reunion tour, and a chance for both of them to explore his home country with fresh eyes. Despite the physical strain and increased spending, the stress of fast travel led to a physical and mental breakdown. The author describes how the experience was compared to the experience of a regular tourist. Despite late nights and late nights, these experiences left them feeling exhausted the next day. They found awe in many places, including sea shanties in a Cornish pub and storm clouds in Ireland.",
  "shortSummary": "Fast travel, led by Nigel, can be exhausting and addictive, especially for those who have experienced slow travel like ourselves.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "157bc1f2ca034352a29af6fb1127966e",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The author reflects on a recent fast travel experience through the UK and Ireland, contrasting it with their usual slow travel approach. While the trip was filled with memorable moments and exploration, it ultimately led to physical and mental exhaustion, reminiscent of their previous high-pressure career. Now settled in a quiet town in Ireland for a month, they emphasize the importance of being present and the value of slow travel over the rush of fast-paced itineraries.",
  "argos_id": "OVBHKBYOI"
}