{
  "url": "https://www.techradar.com/pro/security/hackers-could-take-over-millions-of-dahua-cctv-cameras-because-of-two-critical-flaws-heres-how-to-stay-safe",
  "authorsByline": "Wayne Williams",
  "articleId": "9900e61a14d24b6fb934fec70cd086c6",
  "source": {
    "domain": "techradar.com",
    "paywall": false,
    "location": {
      "country": "in",
      "city": "New Delhi",
      "coordinates": {
        "lat": 28.6138954,
        "lon": 77.2090057
      }
    }
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/VYUvuTTzCCkadZrogPdk7A.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:28:00+00:00",
  "addDate": "2025-08-14T19:44:38.792316+00:00",
  "refreshDate": "2025-08-14T19:44:38.792317+00:00",
  "score": 1.0,
  "title": "Millions of Dahua security cameras at risk from unauthenticated takeover flaws",
  "description": "Attackers can gain root access and install persistent malicious code",
  "content": "• Vulnerabilities allow remote code execution without authentication over local or internet connections\n\nResearchers at Bitdefender have announced two critical vulnerabilities affecting a large number of Dahua smart cameras.\n\nThe flaws, which were patched in the most recent firmware update, could allow unauthenticated attackers to take full control of affected devices.\n\nDahua has confirmed that a total of 126 models were affected, including multiple IPC, SD, and DH series devices, not just the Hero C1 model first reported.\n\nThe first of the vulnerabilities, CVE-2025-31700, is a buffer overflow flaw in Dahua camera firmware that can be triggered when the device processes specially crafted network packets. If exploited, it could cause the camera to crash or, in some cases, allow a remote attacker to run their own code on the device.\n\nThe second, CVE-2025-31701, is another buffer overflow issue also exploitable through maliciously crafted packets sent over the network. It too can be used to crash the camera or potentially gain full remote control depending on the target’s defenses.\n\nBoth can be exploited to run arbitrary code with root privileges.\n\nBitdefender privately reported the issues to Dahua on March 28, 2025. The Chinese video surveillance equipment manufacturer acknowledged the report the next day and validated the findings by April 1.\n\nIt requested some time to prepare a fix for the issues, with patches finally rolling out last month, followed by the agreed public disclosure.\n\nThe two vulnerabilities can be especially dangerous for devices accessible from the internet via port forwarding or UPnP, as no authentication is required for possible exploitation.\n\nBitdefender warns that successful attacks could bypass firmware integrity checks and deploy persistent malicious code, making cleanup difficult.\n\nDahua, the world’s second-largest CCTV manufacturer behind Hikvision, has faced scrutiny in several countries over cybersecurity issues and data privacy concerns, particularly related to potential vulnerabilities in its network-connected devices.\n\nIt maintains a Product Security Incident Response Team (PSIRT) to coordinate with researchers on reported flaws, such as in the case of these vulnerability disclosures.\n\nIt is urging all customers who have not yet done so to update their camera firmware as a matter of urgency.\n\nFor anyone unable to do so immediately, it advises disconnecting vulnerable devices from direct internet access, disabling UPnP, and isolating cameras on separate networks to reduce risk.\n\nA detailed list of affected models is included in Dahua’s online advisory, along with links to patched firmware.\n\nBoth Dahua and Bitdefender stress unpatched internet-connected devices should be considered prime targets.\n\nYou might also like\n• Take a look at our round up of the best home video surveillance systems\n• Researchers discover 40,000 private webcams exposed online: how to secure yours now",
  "medium": "Article",
  "links": [
    "https://bitdefender.evyy.net/c/221109/278689/4466?subId1=trdpro-us-7969390770384809753&sharedId=trdpro-us&u=https%3A%2F%2Fwww.bitdefender.com%2Fen-us%2Fblog%2Flabs%2Fvulnerabilities-identified-in-dahua-hero-c1-smart-cameras",
    "https://www.dahuasecurity.com/aboutUs/trustedCenter/details/775",
    "https://www.techradar.com/pro/is-the-worlds-largest-cctv-surveillance-camera-vendor-going-to-be-the-next-huawei-canada-gov-bans-hikvision-amidst-security-fears",
    "https://www.techradar.com/best/best-home-video-surveillance",
    "https://www.techradar.com/pro/researchers-discover-40-000-private-webcams-exposed-online-how-to-secure-yours-now"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Dahua camera firmware",
      "weight": 0.107418485
    },
    {
      "name": "Dahua security cameras",
      "weight": 0.09463599
    },
    {
      "name": "Dahua smart cameras",
      "weight": 0.09398767
    },
    {
      "name": "affected devices",
      "weight": 0.08944338
    },
    {
      "name": "vulnerable devices",
      "weight": 0.07884753
    },
    {
      "name": "devices",
      "weight": 0.076444395
    },
    {
      "name": "cameras",
      "weight": 0.074924715
    },
    {
      "name": "Dahua",
      "weight": 0.07346298
    },
    {
      "name": "patched firmware",
      "weight": 0.07301041
    },
    {
      "name": "remote code execution",
      "weight": 0.07234717
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.93408203125
    },
    {
      "name": "/Computers & Electronics/Computer Security/Network Security",
      "score": 0.7822265625
    },
    {
      "name": "/Computers & Electronics/Computer Security/Hacking & Cracking",
      "score": 0.52490234375
    },
    {
      "name": "/Computers & Electronics/Computer Security/Other",
      "score": 0.398193359375
    }
  ],
  "sentiment": {
    "positive": 0.047106046,
    "negative": 0.67982465,
    "neutral": 0.27306926
  },
  "summary": "Researchers at Bitdefender have identified two critical vulnerabilities affecting a large number of Dahua smart cameras, allowing unauthenticated attackers to take full control of affected devices. The vulnerabilities affect 126 models, including multiple IPC, SD, and DH series devices. If exploited, these vulnerabilities can cause the camera to crash or allow a remote attacker to run their own code on the device. These vulnerabilities can be particularly dangerous for devices accessible from the internet via port forwarding or UPnP, as no authentication is required for possible exploitation. The flaws were discovered in a recent firmware update and have been validated by Dahua by April 1. Both Dahua and Bitdiscipl",
  "shortSummary": "Dahua's smart cameras face two critical vulnerabilities, one allowing unauthenticated attackers to control devices without authentication, requiring urgent firmware update.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1856f09497b341d19f08fabf228d9be8",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dahuasecurity.com/aboutUs/trustedCenter/details/775",
      "text": "Advisory ID：DHCC-SA-202507-001\nFirst Published：2025-07-23\nCybersecurity is a global challenge affecting all internet-connected devices, regardless of their origin. At Dahua, we are committed to maintaining the highest level of cybersecurity across our products and solutions, prioritising the swift resolution of any reported vulnerabilities. Dahua’s Product Security Incident Response Team (PSIRT) is dedicated to addressing security vulnerabilities promptly, notifying customers of potential risks, and sharing best practices to strengthen cybersecurity awareness.\nIn response to security issues reported by Bitdefender IoT Research Team, Dahua immediately conducted a comprehensive investigation of affected product models and has developed patches and firmware that fix the vulnerabilities. Please download from https://www.dahuasecurity.com/support/downloadCenter or contact Dahua local technical support to upgrade.\nWe strongly suggest, consistent with cybersecurity best practice, that all Dahua customers follow our security advisory, in order to ensure their systems are up-to-date and maximally protected. In the meantime, customers with other concerns on cybersecurity related issues, please feel free to contact us at psirt@dahuatech.com.\nSummary\n1. CVE-2025-31700\nAn attacker could exploit a buffer overflow vulnerability by sending specially crafted malicious packets, potentially causing service disruption (e.g., crashes) or remote code execution (RCE). Some devices may have deployed protection mechanisms such as Address Space Layout Randomization (ASLR), which reduces the likelihood of successful RCE exploitation. However, denial-of-service (DoS) attacks remain a concern.\n2. CVE-2025-31701\nAn attacker could exploit a buffer overflow vulnerability by sending specially crafted malicious packets, potentially causing service disruption (e.g., crashes) or remote code execution (RCE). Some devices may have deployed protection mechanisms such as Address Space Layout Randomization (ASLR), which reduces the likelihood of successful RCE exploitation. However, denial-of-service (DoS) attacks remain a concern.\nVulnerability Score\nThe vulnerability classification has been performed by using the CVSSv3.1 scoring system (http://www.first.org/cvss/specification-document).\nCVE-2025-31700\nBase Score：8.1(CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H)\nTemporal Score：7.3(E:P/RL:O/RC:C)\nCVE-2025-31701\nBase Score：8.1(CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H)\nTemporal Score：7.3(E:P/RL:O/RC:C)\nAffected Products\nThe following product series are currently known to be partially affected by this issue. For the specific list of affected models, please refer to: https://materialfile.dahuasecurity.com/uploads/soft/20250723/Affected-Models.pdf. Versions with a build date after April 16, 2025 are not affected by this issue.\n|\nCVE ID |\nAffected Models |\nAffected Version |\n|\nCVE-2025-31700 CVE-2025-31701 |\nIPC-1XXX Series IPC-2XXX Series IPC-WX Series IPC-ECXX Series SD3A Series SD2A Series SD3D Series SDT2A Series SD2C Series |\nVersions which Build time before 2025/4/16 |\nNote: Please login to the Web interface of the device to view Build time, which you can find on the Settings-System Information-Version Information page (setting-systeminfo-version).\nFix Software Download\nPlease download the corresponding fix software or its newer version as listed in the above table from Dahua website, or contact Dahua local technical support to upgrade.\nl Cloud Upgrade：For products with cloud upgrade capability, the related repair version will be successively pushed through the cloud upgrade within 30 working days.\nl Dahua Official website: https://www.dahuasecurity.com/support/downloadCenter。\nl Dahua Technical Support Personnel.\nSupport Resources\nFor any questions or concerns related to our products and solutions, please contact Dahua PSIRT at psirt@dahuatech.com.\nAcknowledgment\nWe acknowledge the support of Bitdefender IoT Research Team who reported it to Dahua and coordinated with us to handle this vulnerability.\nRevision History\n|\nVersion |\nDescription |\nDate |\n|\nV1.0 |\nInitial public release |\n2025-07-23 |"
    },
    {
      "url": "https://www.techradar.com/best/best-home-video-surveillance",
      "text": "Best home video surveillance of 2025: smart security for your property\nKeep your home safe with the best home video surveillance\nThe best home video surveillance systems will give you peace of mind by allowing you to quickly and easily set up and protect your property.\nMost modern home video surveillance kits integrate well into smart home setups, which means it's incredibly easy to set up cameras and detectors around your home, with smartphone apps that let you monitor your property no matter where you are.\nSo, don't think that video surveillance systems are complex setups that are only suitable for businesses. The best home video surveillance systems are user-friendly and affordable, and apart from the sensors and cameras, require no other specialised equipment. As we mentioned, you can use a smartphone app, or software on your PC, to set everything up.\nThis includes viewing livestreams of your property, as well as get alerts when you're away, and remotely arm or disarm the system.\nMany kits come with cameras and sensors as part of a package, making it easy to set up straight away, while others are more modular, allowing you to buy additional cameras and sensors depending on the size of your home. Many also give you the option of professional installation, or doing it yourself.\nUltimately, home surveillance is becoming easier to use and manage, with minimal fuss and easy installation. Technology is making home protection easier and more accessible than ever, especially by a combination of mobile apps and voice commands to control and manage them.\nThe smart home integration also means that security can be just one aspect of your smart home, along with bulbs, heating, and even plugs for electricity.\nHere then are the best in home video surveillance options. We researched and tested each tool to assess the ease of setup, pricing, connectivity, and smart assistant integration. We also considered how the tools store the videos and the additional features they have.\n- We've also highlighted the best home security systems.\nThe best home video surveillance of 2025 in full\nWhy you can trust TechRadar\nReasons to buy\nReasons to avoid\nNest provides a wireless home video surveillance system, which can connect with Google Home Hub to provide a smart solution for more than just security.\nThe main bundle includes a video doorbell, which provides a 160 degrees field of view and records in 4:3 aspect HD video, both during the day and at night. It uses person, motion, and sound alerts to detect visitors. When set up with Nest Aware it can provide continuous streaming and be configured to recognize family and friends, as well as provide a special alert when they come to the door.\nYou don't even need to come to the door to answer, as you can use your mobile device to connect with the doorbell. Prerecorded quick responses are also available if you don't want to answer the door directly.\nAn outdoor and indoor camera are also included in the bundle, which can provide always-on recording so that nothing is missed. The outdoor camera is waterproof, comes with night vision, has a 12x digital zoom to enhance any detail you need to focus on. Both can also be included in a Nest Aware package to record and store all video automatically to the cloud.\nWhile previously Nest offered plans with different recording and storage options, Nest is now part of the Google Nest smart home services, with each Nest device available to buy separately. However, the new website does not suggest recording options that might be available, and the presumption at this stage is that you can simply use your Google Drive storage.\nRead our full Google Nest cam review here.\nReasons to buy\nReasons to avoid\nSimpliSafe provides an easy to set-up home video surveillance system, centered on a main base station. This can connect using WiFi or cellular networks, which means if your internet goes down your home security won't.\nSimpliSafe provide a number of bundles, which usually include core elements of the base station, security keypad, motion sensor, and window sensors. Different packages can add more sensors, panic buttons, as well as sensors for temperature, fire, or flooding. Alternatively you can build you own package to include the hardware and features you think you'll need.\nThere are also options to include an indoor video camera and/or a video doorbell, to provide a full video surveillance solution. These both use motion sensing to begin recording in HD video and audio, across a 120 degree field of vision. SimpliSafe state that the SimpliSafe cam is uniquely configured to work with heat signatures from people so pets shouldn't cause false alarms.\nAlerts are provided when movement is detected, and recordings can be managed from a mobile device. Any video streams are also compressed to reduce loss of quality over the internet, and are secured with strong encryption for up to 30 days.\nOverall, SimpliSafe offers a simple and accessible package, but isn't as feature-rich as alternatives.\nRead our full SimpliSafe review here.\n3. Resideo\nReasons to buy\nReasons to avoid\nResideo security is the rebranded name for the Honeywell Smart Home Security system, and is one of the simplest home video surveillance systems on the market. However, it's also a smart solution that works with Alexa voice commands to offer a lot of possibilities.\nThe central feature of the Resideo Security system is a single all-in-one device which works both as a motion and audio sensor, and records HD video when triggered. This is automatically stored online for up to 24 hours. Even better, as well as being able to monitor and manage everything from a mobile app, the Resideo all-in-one has Alexa built-in so you you can also use voice commands to control not just your security, but also any other smart features built into your home - so you can control heating and lighting if you have appropriate smart fittings.\nThere is also the option to purchase additional motion viewers, both for indoors and outdoors, to complement the system and extend its use in larger homes. And another really nice feature is that you can turn the top fitting to close off the video camera, so as to allow for privacy.\nHowever, while the previous Honeywell brand offered membership plans for additional video storage and monitoring, these no longer appeared advertised as an included service. Additionally, a Resideo Security system requires professional installation, making is less easy to set up and run compared to some others.\nReasons to buy\nReasons to avoid\nVivint SmartHome is a comprehensive home surveillance system with video recording built in as standard, and smart home features also available as required.\nCore products include a video doorbell, indoor and outdoor cameras, smart locks, and garage control. The indoor video camera comes with full 1080p HD video recording as well as two-way audio. Custom notifications are available, and up to 30 days of continuous recording can be saved. A particularly nice feature is that it also includes a one-touch contact button that your family can push to contact you instantly.\nEverything can be managed directly using a mobile app, a home security panel, and voice controls when using Google Home or Alexa. This means you can integrate it with other smart home features, not least lighting and heating, as required, using voice commands or your mobile app. Vivint can also integrate with other wireless security products such as from Nest.\nWhat Vivint offers on top of everyone else featured here is a 24/7 monitoring solution. However, this usually requires a professional installer to set up your system, plus the monitoring will usually come packaged with a product set specifically put together for your home, rather than be offered as an addon with flat-rate pricing.\nRead our full Vivint security systems review here.\nReasons to buy\nReasons to avoid\nRing is another wireless home surveillance option which allows you to control and monitor everything over Wi-Fi from a desktop or mobile device.\nThe central feature of any Ring home security system is a video doorbell, which comes in four main types. The Video Doorbell and Video Doorbell 2 both use infra-red to detect motion and alert you whenever someone is at the door, whether they ring the bell or not. You can then monitor what is happening from your smartphone or tablet and provide an audio response directly if required. The main difference between the two is that the original Video Doorbell records in 720p HD video, while the Video Doorbell 2 records in 1080p HD video.\nTwo additional models are the Ring Video Doorbell Pro and the Video Doorbell Elite, both of which use pixel-based technology to detect motion. Both record in 1080p HD video, with 160 degree fields of vision.\nWhile all of the video doorbells have night-vision capabilities, there is the option to purchase outdoor security lighting to work with the system. Additionally, indoor and outdoor cameras are also available to work with the Ring surveillance system. While the original Video Doorbell is reasonably priced, adding hardware can get expensive quite fast.\nYou can record the video directly to your phone or to a cloud account, or alternatively you can subscribe to a Ring plan to automatically upload everything to a Ring cloud account for 30 days storage.\nRead our full Ring video doorbell review here.\n- We've also featured the best home automation systems.\nWhat is home video surveillance?\nHome video surveillance systems are devices to monitor and safeguard the home. These systems include security cameras that have smart functionality and integration with smart assistants like Alexa, Siri, and Google Home.\nThe cameras commonly have features like HD resolution, night vision, smartphone integration, wide field of vision, and motion detection.\nHow to choose the best home video surveillance for you?\nWhen selecting the best home video surveillance systems, you'll want to consider what type of system you need and what parts of your home you need it for.\nIf you need surveillance for the outdoors, then you'll want a weather-resistant camera that has wireless functionality. For the indoors, a wired camera that's less durable will be fine.\nYou'll want to check whether the camera connects to the Wi-Fi or records directly to local storage. If your home has a steady Wi-Fi connection, it makes sense to opt for Wi-Fi-enabled security cameras, but analog security cameras are a wiser choice if there's no steady internet.\nYou'll also want to look out for features like night vision, Full HD recording, wide field of vision, and temperature and movement sensors, among other things.\nThe best home video surveillance: How we test\nWhen testing the best home video surveillance tools, we looked at how reliable, easy to setup, and well-integrated they were. We checked what smart assistants they can be paired with, the quality of their smartphone companion apps, and smart home features.\nWe evaluated the different bundles and packages they come with, whether they offer Wi-Fi and cellular options, and the installation process. Video storage is essential, so we checked whether they have local storage or internet storage.\nWe also perform several additional tests to thoroughly understand how well a device performs. See how we test, review, and rate products on TechRadar.\nSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!\nBrian has over 30 years publishing experience as a writer and editor across a range of computing, technology, and marketing titles. He has been interviewed multiple times for the BBC and been a speaker at international conferences. His specialty on techradar is Software as a Service (SaaS) applications, covering everything from office suites to IT service tools. He is also a science fiction and fantasy author, published as Brian G Turner."
    },
    {
      "url": "https://www.techradar.com/pro/is-the-worlds-largest-cctv-surveillance-camera-vendor-going-to-be-the-next-huawei-canada-gov-bans-hikvision-amidst-security-fears",
      "text": "Is the world's largest CCTV surveillance camera vendor going to be the next Huawei? Canada bans Hikvision amidst security fears\nCanada boots out Chinese surveillance giant Hikvision\n- Geopolitics, not just technology, is quietly rewriting who can sell cameras in Western markets\n- Hikvision says it’s unfair, but the shutdown shows trust is no longer automatic for Chinese firms\n- Company denies wrongdoing, but surveillance fears are now enough to end entire business operations\nCanada has ordered Chinese surveillance giant Hikvision to cease its operations in the country, citing national security concerns.\nThe ban follows a formal review conducted under the Investment Canada Act and marks a move against foreign technology firms.\n\"The government has determined that Hikvision Canada Inc.’s continued operations in Canada would be injurious to Canada’s national security,\" said Industry Minister Mélanie Joly.\nInternational pressure and rising suspicion\nHikvision, one of the world’s largest producers of surveillance cameras, has operated in Canada since 2014.\nHowever its expansive global reach and ties to state-linked projects in China have long drawn concern from Western countries.\nAlthough the government has not made public the specific reasons behind its decision, it has stated intelligence and security assessments played a central role.\nThis silence is likely to fuel speculation, much like in previous crackdowns on Huawei, where classified intelligence was used to justify broad commercial restrictions.\nSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!\nThe comparison to Huawei is not unwarranted. Hikvision now finds itself under the same kind of scrutiny that led to Huawei’s ejection from 5G infrastructure projects across the Five Eyes nations.\nThe US, UK, and Australia have all already taken measures against Hikvision, particularly over claims its cameras have been used to surveil Uyghur Muslims in China’s Xinjiang region, allegations that Beijing denies.\nThe FBI has also warned about malware targeting webcams, and the Western world often believes that Chinese IoT is arguably more dangerous than TikTok, which is considered spyware.\nUnsurprisingly, Hikvision “strongly disagrees” with Canada's decision, saying, “We believe it lacks a factual basis, procedural fairness, and transparency,” the company claims the move appears “to be driven by the parent company’s country of origin.”\nWith geopolitical tensions continuing to define much of the West’s approach to Chinese firms, decisions like Canada’s risk being seen less as technology-based judgments and more as political posturing.\nHikvision claimed it cooperated fully with authorities and submitted all requested documents, but this did not alter the outcome.\nIt’s unclear how many public buildings in Canada still use Hikvision devices, but Joly has committed to reviewing and phasing out any remaining equipment.\n“I strongly urge Canadians to take note of this decision and make their own decisions accordingly,” she warned.\nThe Canadian government appears to be focusing on surveillance risks, and this questions the trustworthiness of smart devices, like the webcams or parental control solutions.\nAs more homes and workplaces adopt smart cameras and monitoring tools, the line between convenience and intrusion becomes thinner.\nIf bans become more commonplace, vendors may need to prove more than just feature strength to remain competitive.\nWhether you're selecting a home monitoring system or seeking the best antivirus software, the politics of hardware and software are becoming harder to ignore.\nVia Economic Times\nYou might also like\n- These are the best business smartphones right now\n- We've also listed the best rugged laptops available\n- Amazon has a million robots on its floors - close to outnumbering human workers\nEfosa has been writing about technology for over 7 years, initially driven by curiosity but now fueled by a strong passion for the field. He holds both a Master's and a PhD in sciences, which provided him with a solid foundation in analytical thinking. Efosa developed a keen interest in technology policy, specifically exploring the intersection of privacy, security, and politics. His research delves into how technological advancements influence regulatory frameworks and societal norms, particularly concerning data protection and cybersecurity. Upon joining TechRadar Pro, in addition to privacy and technology policy, he is also focused on B2B security products. Efosa can be contacted at this email: udinmwenefosa@gmail.com\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://bitdefender.evyy.net/c/221109/278689/4466?subId1=trdpro-us-7969390770384809753&sharedId=trdpro-us&u=https%3A%2F%2Fwww.bitdefender.com%2Fen-us%2Fblog%2Flabs%2Fvulnerabilities-identified-in-dahua-hero-c1-smart-cameras",
      "text": "Researchers at Bitdefender have identified critical security vulnerabilities in the firmware of the Dahua Hero C1 (DH-H4C) smart camera series. The flaws, affecting the device's ONVIF protocol and file upload handlers, allow unauthenticated attackers to execute arbitrary commands remotely, effectively taking over the device.\nThe vulnerabilities were reported to Dahua for responsible mitigation and disclosure and are now patched at the time of publication.\nThe issues were verified on a Dahua Hero C1 (DH-H4C) running firmware version V2.810.9992002.0.R (Build Date: 2024-01-23) with ONVIF version 21.06 and Web UI version V3.2.1.1452137. This version was confirmed as the latest available when starting our research through the device’s own update interface.\nOther device models that were identified during the vendor’s own audit include: IPC-1XXX Series, IPC-2XXX Series, IPC-WX Series, IPC-ECXX Series, SD3A Series, SD2A Series, SD3D Series, SDT2A Series, SD2C Series with firmware versions older than 2025/04/16.\nWe would like to extend our sincere thanks to the Dahua security team for their professional handling of the vulnerabilities reported. Their prompt triage, prioritization, and resolution of the issues demonstrate a strong commitment to customer safety and product integrity. This type of collaboration between researchers and vendors is extremely valuable to the broader cybersecurity ecosystem - ensuring that vulnerabilities are addressed before they can be weaponized. We hope to see this level of responsiveness and transparency replicated across the industry.\nThe ONVIF request handler on port 80 (function at 0x19e530) parses the Host header incorrectly, leading to an unbounded copy of the header on the stack. If the header contains a ‘]’ character that is not followed by a ‘:’ character, the strncpy function gets the size by subtracting the buffer’s address from the address of the ‘]’ character. This allows an attacker to write an arbitrary number of bytes to the stack, as long as the payload does not contain a ‘]’ character or a null byte. This oversight allows for an unauthenticated stack-based buffer overflow, ultimately overwriting the return address and several CPU registers (r4–r11).\nThe strncpy call at 0x0019e898:\nExploitation is possible without prior authentication, and a successful attack results in full code execution. The proof-of-concept (PoC) developed by researchers shows the attacker writing system commands into memory and then invoking them through carefully crafted return-oriented programming (ROP) chains. The PoC drops an ELF payload using tftp and spawns a bind shell on port 4444 using LD_PRELOAD, bypassing binary signature checks.\nA second vulnerability exists in the handler for the undocumented endpoint POST /RPC2_UploadFileWithName/*. Here, the camera copies the Cseq HTTP header directly into a buffer located in the .bss memory section using a flawed strncpy implementation.\nThe strncpy call at 0x00583948:\nThe variable at 0x03955c38 stores a pointer to a structure that can be overwritten by strncpy. The functions at 0x00586dd4 and 0x00586d18 continuously check this structure for expired sessions. Because no bounds checking is performed, an attacker can overwrite adjacent global variables, including a structure that stores pointers to session management functions. These are routinely invoked by the firmware to manage timeouts. By planting a crafted structure in memory, the attacker can redirect execution to a call to system(), again resulting in full remote code execution—no authentication needed.\nFunction 0x00586dd4 using a function pointer from the controlled structure:\nThis exploit is similarly demonstrated in a PoC which uses a long header value to overflow the target structure and redirect execution.\nBoth vulnerabilities are unauthenticated and exploitable over the local network. Devices exposed to the internet through port forwarding or UPnP are especially at risk. Successful exploitation provides root-level access to the camera with no user interaction.\nBecause the exploit path bypasses firmware integrity checks, attackers can load unsigned payloads or persist via custom daemons, making cleanup difficult.\ntags\nThe meaning of Bitdefender’s mascot, the Dacian Draco, a symbol that depicts a mythical animal with a wolf’s head and a dragon’s body, is “to watch” and to “guard with a sharp eye.”\nView all posts"
    },
    {
      "url": "https://www.techradar.com/pro/researchers-discover-40-000-private-webcams-exposed-online-how-to-secure-yours-now",
      "text": "Researchers discover 40,000 private webcams exposed online: how to secure yours now\nDark web forums are trading live camera feeds\n- Default passwords and outdated firmware are turning your home camera into a public livestream, report warns\n- Thousands of exposed webcams are offering a front-row seat into private and corporate life\n- A simple web browser is all it takes to peek into 40,000 unsecured camera feeds\nThousands of internet-connected webcams, intended to enhance safety and convenience, are now unintentionally offering a window into private lives and secure environments.\nResearch by Bitsight claims over 40,000 webcams around the world are publicly accessible online, often without their owners’ knowledge.\nThese include security cameras, baby monitors, office surveillance systems, and even devices inside hospitals and factories.\nA growing digital threat, not a hypothetical one\nThe investigation highlights just how easily accessible these cameras are.\n“No passwords. No protections. Just out there,” wrote João Cruz, Principal Security Research Scientist at Bitsight TRACE, noting it requires neither elite hacking skills nor expensive software. In many cases, all it takes is a web browser and a valid IP address.\n“We first raised the alarm in 2023, and based on this latest study, the situation hasn’t gotten any better.”\nExposed footage ranges from innocent scenes, like bird feeders, to far more sensitive views, such as home entry points, live feeds from living rooms, whiteboards in office spaces, and even operations inside data centers.\nSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!\nWorryingly, disturbing conversations have emerged on dark web forums, where some users share methods for locating exposed cameras, or even sell access to live feeds.\n“This isn’t hypothetical: this is happening right now,” Cruz emphasized.\nThe United States leads with roughly 14,000 exposed cameras, followed by Japan, Austria, Czechia, and South Korea. These aren’t isolated incidents but part of a broader failure in how internet-connected cameras are deployed and managed.\nBitsight’s team scanned for both HTTP- and RTSP-based cameras, and the results suggest these figures may only scratch the surface.\nMany of the exposed devices result from basic setup errors: default credentials, open internet access, and outdated firmware that leave systems vulnerable.\nWhile vendors and manufacturers must improve device security, users also share responsibility.\nChoosing products vetted for cybersecurity can help, but users should also pair their camera setups with tools like leading antivirus software and top-rated parental control solutions, which often include network monitoring to flag unusual access or unprotected devices.\nUltimately, private users should always check remote accessibility settings, change default passwords, update firmware regularly, and, especially for enterprises, enforce firewall protections and require VPN access.\nYou might also like\n- These are the best VPN with antivirus solutions\n- Take a look at our pick of the best password managers\n- Epson launches subscription where you pay \"just\" $7.99 to rent a printer and print 50 pages every month\nEfosa has been writing about technology for over 7 years, initially driven by curiosity but now fueled by a strong passion for the field. He holds both a Master's and a PhD in sciences, which provided him with a solid foundation in analytical thinking. Efosa developed a keen interest in technology policy, specifically exploring the intersection of privacy, security, and politics. His research delves into how technological advancements influence regulatory frameworks and societal norms, particularly concerning data protection and cybersecurity. Upon joining TechRadar Pro, in addition to privacy and technology policy, he is also focused on B2B security products. Efosa can be contacted at this email: udinmwenefosa@gmail.com\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    }
  ],
  "argos_summary": "Bitdefender has identified two critical vulnerabilities in Dahua smart cameras, allowing unauthenticated attackers to execute remote code and take full control of affected devices. The vulnerabilities, CVE-2025-31700 and CVE-2025-31701, affect 126 models and can be exploited via specially crafted network packets. Dahua has released firmware updates to address these issues and urges users to update their devices immediately to mitigate risks, especially for those exposed to the internet.",
  "argos_id": "OYUHIOOME"
}