{
  "url": "https://www.morningstar.com/news/globe-newswire/9513086/apptech-payments-corp-highlights-q2-2025-financial-and-strategic-developments",
  "authorsByline": "",
  "articleId": "1da90106403747c19bbacfec60a3678d",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T18:19:37-05:00",
  "addDate": "2025-08-14T23:47:00.006287+00:00",
  "refreshDate": "2025-08-14T23:47:00.006289+00:00",
  "score": 1.0,
  "title": "AppTech Payments Corp. Highlights Q2 2025 Financial and Strategic Developments",
  "description": "",
  "content": "CARLSBAD, Calif., Aug. 14, 2025 (GLOBE NEWSWIRE) -- AppTech Payments Corp. (“AppTech” or the “Company”) (NASDAQ: APCX), a fintech company innovating payment solutions for businesses, today announced financial results for the second quarter ended June 30, 2025.\n\nFor the three months ended June, the Company reported an operating loss of $1.9 million, or $0.06 per share, compared to an operating loss of $2.9 million, or $0.12 per share, for the same period in 2024. This year-over-year improvement reflects the Company’s ongoing efforts to expand revenue opportunities and enhance operational efficiency.\n\n“Our Q2 results reinforce the positive momentum we’ve been building over the last few quarters,” said Felipe Corrado, AppTech’s Chief Financial Officer. “We’re executing against a disciplined plan focused on scaling revenues and streamlining costs—setting the stage for continued progress toward breakeven and profitability.”\n\nAppTech continues to invest in its core platform and diversify its product offerings to meet the evolving needs of merchants and partners. With revenues growing and expenses being actively managed, the Company remains committed to delivering long-term shareholder value.\n\nAppTech Payments Corp. (NASDAQ: APCX) provides digital financial services for financial institutions, corporations, small and midsized enterprises (“SMEs”), and consumers through the Company’s scalable cloud-based platform architecture and infrastructure. For more information, please visit apptechcorp.com.\n\nThis press release may contain forward-looking statements that are inherently subject to risks and uncertainties. Any statements contained in this document that are not historical facts are forward-looking statements as defined in the U.S. Private Securities Litigation Reform Act of 1995. Words such as “anticipate, believe, estimate, expect, forecast, intend, may, plan, project, predict, should, will” and similar expressions as they relate to AppTech are intended to identify such forward-looking statements. These risks and uncertainties include, but are not limited to, general economic and business conditions, effects of continued geopolitical unrest and regional conflicts, competition, changes in methods of marketing, delays in manufacturing or distribution, changes in customer order patterns, changes in customer offering mix, and various other factors beyond the Company’s control. Actual events or results may differ materially from those described in this press release due to any of these factors. AppTech is under no obligation to update or alter its forward-looking statements, whether as a result of new information, future events, or otherwise.",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/Tracker?data=8kAX_FVBYxnMX6IfypSrWsywuqqmJLmH-GvGXIeoOM-WaL-_sTgHAk9HEd1aYoMu85RKnCLcMvjJMqL3l4sDqvL8J1XbwrGZp706530PPrI=",
    "https://www.globenewswire.com/NewsRoom/AttachmentNg/379aefb1-24b0-4096-9f1d-276645ce6c04"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "financial results",
      "weight": 0.08147353
    },
    {
      "name": "Company",
      "weight": 0.07934891
    },
    {
      "name": "AppTech Payments Corp.",
      "weight": 0.07815714
    },
    {
      "name": "AppTech",
      "weight": 0.067582294
    },
    {
      "name": "digital financial services",
      "weight": 0.066061355
    },
    {
      "name": "financial institutions",
      "weight": 0.06584198
    },
    {
      "name": "revenue opportunities",
      "weight": 0.06450798
    },
    {
      "name": "customer offering mix",
      "weight": 0.06354651
    },
    {
      "name": "results",
      "weight": 0.061627302
    },
    {
      "name": "continued geopolitical unrest",
      "weight": 0.05800108
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Business"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9873046875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.69873046875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.53076171875
    }
  ],
  "sentiment": {
    "positive": 0.2678119,
    "negative": 0.18556944,
    "neutral": 0.5466187
  },
  "summary": "AppTech Payments Corp. (NASDAQ: APCX) has announced its financial results for the second quarter of 2025, with an operating loss of $1.9 million or $0.06 per share, compared to the same period in 2024. This improvement reflects AppTech's ongoing efforts to expand revenue opportunities and enhance operational efficiency. The company continues to invest in its core platform and diversify its product offerings to meet merchant and partner needs. Despite these challenges, AppTech remains committed to delivering long-term shareholder value. This press release may contain forward-looking statements that are inherently uncertain due to factors beyond the company's control.",
  "shortSummary": "AppTech Payments Corp. (AppTech) reported a 46% increase in Q2 Q2 losses to $1.9m, driven by continued efforts to expand revenue opportunities and reduce costs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7d468ac09fee4c1d946f968261c8ac20",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.globenewswire.com/Tracker?data=8kAX_FVBYxnMX6IfypSrWsywuqqmJLmH-GvGXIeoOM-WaL-_sTgHAk9HEd1aYoMu85RKnCLcMvjJMqL3l4sDqvL8J1XbwrGZp706530PPrI=",
      "text": "“AppTech has been our payment processing vendor for quite some time now. Their rates and fees were lower in every category than the vendor we were using. Their ability to assist us in both our face-to-face transactions and our e-commerce processing has been extremely helpful. Their attention to detail and willingness to help with any situation that comes up makes them a valuable asset.”\n- Patrick Clouden, CEO Consumer Energy Solutions (Tampa, FL)\n“AppTech Merchant Services is a reliable, low-cost payment provider that I can recommend to my e-commerce clients. It's easily integrated into shopping carts and custom scripts using their APIs. Technical support is always helpful when I do have questions during development.\"\n- Michelle Shinn, CEO Cross Fire Marketing Group (Cleveland, OH)\n\"AppTech consistently has excellent customer service, and I am always very impressed with how fast they are able to help assist me by both phone and email - especially someone like me who has minimal knowledge about the industry and always asks A LOT of questions! Last year I changed the name of my business which was a bit of a headache, to say the least, thankfully the Team was able to help me transfer smoothly and without any added stress. I have recommended AppTech Payments to everyone that asks about my processing company and will continue to do so - I honestly would never go with another company! Thank you, AppTech!”\n- Neal Cantone, Co-owner\nPomona Print Stop (Rancho Cucamonga, CA)"
    }
  ],
  "argos_summary": "AppTech Payments Corp. reported a reduced operating loss of $1.9 million for Q2 2025, an improvement from $2.9 million in the same quarter of 2024, reflecting efforts to enhance revenue and operational efficiency. The company is focused on scaling revenues and managing costs, aiming for breakeven and profitability. AppTech continues to invest in its platform and diversify offerings to meet merchant needs, while customer testimonials highlight its competitive rates and strong support.",
  "argos_id": "P1GROMUPH"
}