{
  "url": "https://www.yahoo.com/entertainment/articles/taylor-swift-red-carpet-look-192058446.html",
  "authorsByline": "Michelle Lee",
  "articleId": "1aec9b2862454c8d9b3e43ad2bba216f",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/73670a26cd37d5c4f92b30ed341da88071ed8f159e502d07bc694b2e80324f47/ynews/resizefill_w1200/https://media.zenfs.com/en/people_218/119601b16070775ed30aa19551c2b4c8",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:20:58+00:00",
  "addDate": "2025-08-14T19:40:06.591327+00:00",
  "refreshDate": "2025-08-14T19:40:06.591328+00:00",
  "score": 1.0,
  "title": "This Taylor Swift Red Carpet Look Had “Showgirl” Written All Over It Before She Even Announced the Album",
  "description": "Fans are pointing out that this particular look is similar to an outfit featured in the art for Swift's 12th studio album",
  "content": "NEED TO KNOW\n• None Taylor Swift fans have connected the dots between a look featured in the singer's new era and a past red carpet outfit of hers\n• None The album art for The Life of a Showgirl depicts Swift in a red corset look by The Blonds, which fans are saying draws similarities to the Vivienne Westwood dress she wore to the 2025 Grammys\n• None Swift revealed the concept photos for TS12 the same day she appeared on the New Heights podcast\n\nLeave it to Taylor Swift fans to leave no stone unturned.\n\nSince the singer rolled out new details of her 12th studio album, The Life of a Showgirl, Swifties have been locked in finding what fashion breadcrumbs Swift left leading up to the big announcement. Now that art for TS12 has been revealed, there's been a lot more to dive into.\n\nThe Grammy winner's 12-track record is accompanied by images of Swift in \"Viva Las Vegas\" mode. The outfits are camp, glam and what you'd expect to see if a showgirl's wardrobe busted at the seams — and, most of all, point to a brand new aesthetic for Swift. But has it been in front of our eyes this whole time?\n\nWhen Sarah Chapelle, the fan behind the popular Instagram account @taylorswiftstyled, began rolling out the details on the clothes worn for the shoot, her followers began pointing out similarities between Swift's current fashion choices and her recent red carpet looks, alluding to the pop star channeling her Life of a Showgirl era before it was announced.\n\nFor one of the shoots, stylist Joseph Cassell Falconer outfitted Swift in a bejeweled ruby red bodysuit with an exaggerated scooped neckline. The design was pulled from The Blonds' Fall 2024 collection and was styled with equally glitzed-up gloves and fishnet tights, very much like how it was on the runway. It drew comparisons to the Vivienne Westwood mini she wore to the 2025 Grammys, especially with the mirrored necklines.\n\nWhen she opened up about the album on Travis and Jason Kelce's New Heights podcast, Swift revealed that she was working on it last spring and summer when she was on the Eras Tour. So between then and now, it's completely possible that Swift drew inspiration from her very own photos for her big red carpet moment.\n\nFans also pointed out that that night, Swift wore Lorraine Schwartz earrings with 12 rubies on each, possibly planting another Easter egg.\n\nAfter all, she did leave fans in mystery when she attended the 2024 Grammys in an academia-coded Schiaparelli gown and custom Lorraine Schwartz watch necklace that alluded to The Tortured Poets Department, which she announced that night.\n\nHer stylist also dressed Swift in a skin-baring crystal chainmail look from the Area 2022 collection, a costume that jogged our memories of Swift's 2022 MTV VMAs equally sexy entrance.\n\nThat year, the Miss Americana star wore an Oscar de la Renta dress with draped crystal beading akin to the former outfit. She then changed into a starry and very performer-esque Moschino romper to celebrate her wins. Yes, the awards show may have been a month out from Swift releasing Midnights, however we can't help but hope that Swift was always channeling her inner showgirl.\n\nNever miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\nIf you're wondering if someone as busy as the global superstar has the time to map out clues this detailed, she said in her New Heights interview that's it's actually something she really enjoys to get fans involved with.\n\n\"There's dos and don'ts. Right? Like, I'm never gonna plant an Easter egg that ties back to my personal life. It's always gonna be towards music or a musical something I'm coming up with.\" She added that she loves scheming ideas that will leave those who are following to \"be like, oh my god.\"",
  "medium": "Article",
  "links": [
    "https://people.com/tag/taylor-swift/",
    "https://people.com/style/vmas-2022-taylor-swift-wears-oscar-de-la-renta-crystal-mini-dress-red-lip/",
    "https://people.com/grammys-2024-taylor-swift-reputation-coded-black-and-white-outfit-red-carpet-photos-details-8553252",
    "https://people-app.onelink.me/HNIa/kz7l4cuf",
    "https://people.com/taylor-swift-new-album-life-of-a-showgirl-style-easter-eggs-decoded-11789517",
    "https://people.com/taylor-swift-red-carpet-look-easter-egg-the-life-of-a-showgirl-11791085",
    "https://people.com/the-life-of-a-showgirl-taylor-swift-album-everything-to-know-11789352",
    "https://www.instagram.com/accounts/login/?next=https%3A%2F%2Fwww.instagram.com%2Fp%2FDNUcxkmRd96%2F%3Fhl%3Den&is_from_rle",
    "https://people.com/people-news-daily-newsletter-sign-up-8692701"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Taylor Swift fans",
      "weight": 0.1062643
    },
    {
      "name": "Taylor Swift",
      "weight": 0.09990374
    },
    {
      "name": "Swift",
      "weight": 0.09917461
    },
    {
      "name": "This Taylor Swift Red Carpet Look",
      "weight": 0.071842216
    },
    {
      "name": "Fans",
      "weight": 0.06186908
    },
    {
      "name": "fans",
      "weight": 0.06186908
    },
    {
      "name": "New Heights",
      "weight": 0.061386786
    },
    {
      "name": "Swifts current fashion choices",
      "weight": 0.057499066
    },
    {
      "name": "custom Lorraine Schwartz watch necklace",
      "weight": 0.055113703
    },
    {
      "name": "new details",
      "weight": 0.053505573
    }
  ],
  "topics": [
    {
      "name": "Celebrities"
    },
    {
      "name": "Fashion"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.994140625
    },
    {
      "name": "/Beauty & Fitness/Fashion & Style/Other",
      "score": 0.81591796875
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.80078125
    },
    {
      "name": "/Arts & Entertainment/Online Media/Online Image Galleries",
      "score": 0.6015625
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.5517578125
    }
  ],
  "sentiment": {
    "positive": 0.18088093,
    "negative": 0.34116304,
    "neutral": 0.47795603
  },
  "summary": "Taylor Swift's new era, The Life of a Showgirl, has been highlighted by fans who believe it was influenced by her past red carpet outfits. The album art for The Life12 depicts Swift in a red corset look by The Blonds, which fans believe is similar to the Vivienne Westwood dress she wore to the 2025 Grammys. The concept photos for the album also included images of Swift in \"Viva Las Vegas\" mode. The stylist behind the popular Instagram account @taylorswift.",
  "shortSummary": "Taylor Swift fans have been clues about her new era by connecting her recent red carpet looks to the album art for The Life of a Showgirl.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "354ee2195baf44228a658a0ebefa63af",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://people.com/taylor-swift-new-album-life-of-a-showgirl-style-easter-eggs-decoded-11789517",
      "text": "Taylor Swift Has Been Hinting at 'The Life of a Showgirl' All Along with These Style Easter Eggs The pop star announced her 12th album 'The Life of a Showgirl' on Aug. 12 — but the signs have been out there By Michelle Lee Michelle Lee Editorial Assistant, Style & Beauty, PEOPLE People Editorial Guidelines Published on August 12, 2025 04:38PM EDT 10 Comments Taylor Swift's style Easter eggs pointing to er new album. Credit : Bob Levey/TAS23/Getty; TAS2024/Getty NEED TO KNOW Taylor Swift announced her 12th album The Life of Showgirl on Aug. 12 on her boyfriend Travis Kelce's New Heights podcastNews of the pop star's record has left Swifties deep-diving into all her past style choices that may have hinted at her new orange-themed eraHere's what Swifties are decoding so far about Swift's wardrobe, lipstick and more Taylor Swift's new era has arrived — and as always there is a lot to unpack. On Aug. 12, the Grammy winner, 35, announced TS12 otherwise known as her new album, The Life of a Showgirl, alongside her boyfriend Travis Kelce on the New Heights podcast. And shortly after the news broke, it didn't take long for eagle-eyed Swifties to piece together all the clues pointing towards the theme of the pop star's 12th record. Spoiler: there's orange — tons of it. Over the years, Swift's albums have taken on a life of their own and it's all thanks to the meticulous attention she puts into her color-coded catalog that she references on and off stage, often through her outfits. Speak Now is purple, 1989 is blue, Reputation is black mixed with green, Red is — you guessed it — red, and so on. So, when Swift brought out a mint-green and orange briefcase to reveal Life of a Showgirl, the internet went wild over all the style hints carefully planted by Swift in the recent past. Taylor Swift performs onstage during night four of \"Taylor Swift | The Eras Tour\" at La Defense on May 12, 2024, in Paris, France. Kevin Mazur/TAS24/Getty A Showgirl Wardrobe Some Swifties believe that she started Showgirl-ing her wardrobe during her record-breaking Eras Tour, but more specifically when she introduced a slew of new orange looks during the European leg last spring. At that time, the \"Fortnight\" singer debuted a fiery lineup of orange outfits, including a new tangerine Versace bodysuit with Christian Louboutins to match, a coral Versace blazer, a sunset-hued ruffled dress and an ombré yellow and orange Roberto Cavalli set. Offstage, Swift found ways to include orange in her night out outfits too, the most loudest sartorial moment being when she stepped out for dinner in London in a $2,000+ Vivienne Westwood plaid skirt suit with hints of the bold colorway. Mastermind Beauty Moves Other fans have noticed Swift making tweaks to her signature glam too. While there have been a few times she's appeared publicly without her famous bold red lipstick, her switch to a warmer cinnamon-toned coral shade has been more noticeable in Swift's beauty choices as of late. In October 2024, Lorrie Turk, the makeup artist behind Swift's most-talked glam moments, confirmed that her go-to lipstick for the Miss Americana star has been The Original Lipstick in the shade Morocco by Nars. The warm terracotta shade is what topped off Swift's grunge-core makeup for that year's MTV Video Music Awards last year and the finishing touch to the face she wore for Kelce's Kansas City Chiefs match on Sept. 5. Swift cheekily swiped a similar color lipstick on her pout for her appearance on New Heights too, signaling a change for the superstar's makeup bag. Taylor Swift at the 2025 Grammys. Matt Winkelmeyer/Getty Bejeweled Details Next up, we have a numerical fashion Easter egg, which isn't surprising for someone's who's masterminded her brand around her lucky number 13. As a fan on X pointed out, Swift began repping the number 12 as early as the 2025 Grammys in February. The two-digit number is significant to the album, not only representing the date it was announced, but also in its placement in her lineup of records, which she possibly weaved into her jewelry selection for the awards show that night with her pair of 60-carat Lorraine Schwartz earrings that each featured 12 gleaming natural rubies. Could the \"T\" on her internet-breaking thigh chain stand for the album's first initial, even though we all thought it was a dedication to her man? Maybe, although the letter's symbolism is still up for interpretation. Taylor Swift and Sabrina Carpenter. TAS2024/Getty Working Late Teasing Potential Collabs The next best question is who might feature on Swift's album. After all, the performer doesn't just lean into clues with her style — she's also forged some of the most powerful musical crossovers of all time, which leads us to what — or shall we say who — might show up on The Life of a Showgirl. So far, Swifties are predicting a potential crossover between Swift and her pal Sabrina Carpenter. The \"Espresso\" singer, 26, first opened for the Eras Tour in Latin America in 2023 then made a surprise appearance during Swift's show in New Orleans in October 2024. Fans on X and TikTok have been resharing concert clips of Swift's opening monologue for Carpenter that night. One line that screams collaboration? \"Put on some clothes,\" which is exactly what Carpenter captioned a recent Instagram post promoting her album, Man's Best Friend, which drops on Aug. 29. Taylor Swift and Travis Kelce. David Eulitt/Getty Images; Dustin Satloff/Getty Images Why Orange? Call it coincidence or calculation, but it's safe to say that all of this leads us to another big question: Why orange? Fans have been coming up with theories on that too and a plausible one points to Swift's love story with a certain Kansas City athlete. Thanks to color analysis Swifties (and yes our very own PEOPLE editors) are convinced that Kelce's football team's red and yellow colors make up Swift's new color scheme. And if you couple that with how smitten the two are with each other, well, it makes for one solid era! Close Leave a Comment Read more: Lifestyle Beauty & Style Celebrity Fashion"
    },
    {
      "url": "https://people.com/taylor-swift-red-carpet-look-easter-egg-the-life-of-a-showgirl-11791085",
      "text": "This Taylor Swift Red Carpet Look Had Showgirl Written All Over It Before She Even Announced the Album Fans are pointing out that this particular look is similar to an outfit featured in the art for Swift's 12th studio album By Michelle Lee Michelle Lee Editorial Assistant, Style & Beauty, PEOPLE People Editorial Guidelines Published on August 14, 2025 03:20PM EDT Leave a Comment Taylor Swift at the 2025 Grammys. Credit : Jon Kopaloff/WireImage NEED TO KNOW Taylor Swift fans have connected the dots between a look featured in the singer's new era and a past red carpet outfit of hersThe album art for The Life of a Showgirl depicts Swift in a red corset look by The Blonds, which fans are saying draws similarities to the Vivienne Westwood dress she wore to the 2025 GrammysSwift revealed the concept photos for TS12 the same day she appeared on the New Heights podcast Leave it to Taylor Swift fans to leave no stone unturned. Since the singer rolled out new details of her 12th studio album, The Life of a Showgirl, Swifties have been locked in finding what fashion breadcrumbs Swift left leading up to the big announcement. Now that art for TS12 has been revealed, there's been a lot more to dive into. The Grammy winner's 12-track record is accompanied by images of Swift in \"Viva Las Vegas\" mode. The outfits are camp, glam and what you'd expect to see if a showgirl's wardrobe busted at the seams — and, most of all, point to a brand new aesthetic for Swift. But has it been in front of our eyes this whole time? Taylor Swift for \"The Life of a Showgirl\". Mert Alas & Marcus Piggot When Sarah Chapelle, the fan behind the popular Instagram account @taylorswiftstyled, began rolling out the details on the clothes worn for the shoot, her followers began pointing out similarities between Swift's current fashion choices and her recent red carpet looks, alluding to the pop star channeling her Life of a Showgirl era before it was announced. Related Stories Taylor Swift Makes a Dazzling Entrance into Her 'Showgirl' Era in Over 76 Carats Worth of Diamonds and Gemstones Taylor Swift Has Been Hinting at 'The Life of a Showgirl' All Along with These Style Easter Eggs For one of the shoots, stylist Joseph Cassell Falconer outfitted Swift in a bejeweled ruby red bodysuit with an exaggerated scooped neckline. The design was pulled from The Blonds' Fall 2024 collection and was styled with equally glitzed-up gloves and fishnet tights, very much like how it was on the runway. It drew comparisons to the Vivienne Westwood mini she wore to the 2025 Grammys, especially with the mirrored necklines. Taylor Swift at the 2025 Grammys. Frazer Harrison/Getty When she opened up about the album on Travis and Jason Kelce's New Heights podcast, Swift revealed that she was working on it last spring and summer when she was on the Eras Tour. So between then and now, it's completely possible that Swift drew inspiration from her very own photos for her big red carpet moment. Our new app is here! Free, fun and full of exclusives. Scan to download now! Fans also pointed out that that night, Swift wore Lorraine Schwartz earrings with 12 rubies on each, possibly planting another Easter egg. After all, she did leave fans in mystery when she attended the 2024 Grammys in an academia-coded Schiaparelli gown and custom Lorraine Schwartz watch necklace that alluded to The Tortured Poets Department, which she announced that night. Taylor Swift for \"The Life of a Showgirl\". Mert Alas & Marcus Piggot Her stylist also dressed Swift in a skin-baring crystal chainmail look from the Area 2022 collection, a costume that jogged our memories of Swift's 2022 MTV VMAs equally sexy entrance. That year, the Miss Americana star wore an Oscar de la Renta dress with draped crystal beading akin to the former outfit. She then changed into a starry and very performer-esque Moschino romper to celebrate her wins. Yes, the awards show may have been a month out from Swift releasing Midnights, however we can't help but hope that Swift was always channeling her inner showgirl. Taylor Swift at the 2022 MTV VMAs. Taylor Swift at the 2022 MTV VMAs afterparty. Taylor Swift at the 2022 MTV VMAs. Credit: Dia Dipasupil/Getty Taylor Swift at the 2022 MTV VMAs afterparty. Credit: Gotham/GC Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. If you're wondering if someone as busy as the global superstar has the time to map out clues this detailed, she said in her New Heights interview that's it's actually something she really enjoys to get fans involved with. \"There's dos and don'ts. Right? Like, I'm never gonna plant an Easter egg that ties back to my personal life. It's always gonna be towards music or a musical something I'm coming up with.\" She added that she loves scheming ideas that will leave those who are following to \"be like, oh my god.\" Close Leave a Comment Read more: Lifestyle Beauty & Style Celebrity Fashion"
    },
    {
      "url": "https://people.com/the-life-of-a-showgirl-taylor-swift-album-everything-to-know-11789352",
      "text": "The Life of a Showgirl: All About Taylor Swift's 12th Album (and the Easter Eggs She Teased for Months!) On Aug. 13, Swift revealed the details of her next album on the 'New Heights' podcast By Jordana Comiter Jordana Comiter Jordana Comiter is an Associate Editor on the Evergreen team at PEOPLE. She has been working at PEOPLE since 2024. Her work has previously appeared in Women’s Health Magazine, PopSugar, VeryWell Mind, Business Insider and The Chicago Reader. People Editorial Guidelines Updated on August 14, 2025 12:13PM EDT 1 Comment Taylor Swift announces her next album 'The Life of a Showgirl' on the 'New Heights' podcast ; Taylor Swift performs during The Eras Tour on June 28, 2024, in Dublin, Ireland. Credit : New Heights/Instagram ; Charles McQuillan/TAS24/Getty NEED TO KNOW On Aug. 12, Taylor Swift announced the title of her upcoming 12th studio album, The Life of a ShowgirlShe announced the news during her appearance on Travis Kelce and Jason Kelce's New Heights podcast, which was released on Aug. 13Fans have begun decoding Easter eggs about the album, which drops Oct. 3 Taylor Swift is entering her 12th era! At 12:12 am on Aug. 12, the 14-time Grammy winner announced the title of her upcoming 12th studio album, The Life of a Showgirl. The announcement came just hours after a string of cryptic posts sent fans down an Easter egg chase and led to rumors of a major announcement. On Monday, Aug. 11, the Instagram account for New Heights — the podcast hosted by Swift’s boyfriend Travis Kelce and his brother Jason Kelce — teased a “VERY special guest” for the Aug. 13 \"special episode.\" The post featured a glittery orange background paired with mint green-colored text and Jason wearing what appeared to be a shirt with a photo of Swift. Twelve minutes later, Taylor Nation, her in-house marketing team, posted an Instagram carousel of 12 orange-themed photos from the Eras Tour with the caption, “Thinking about when she said, ‘See you next era… .’ ” As the day went on, the Kelce brothers confirmed that Swift will be the special guest, and a mysterious glittery orange and green countdown appeared on the singer's website. The details fans were waiting for finally arrived during her appearance on New Heights, when Swift revealed that The Life of a Showgirl will be released on Oct. 3. The new project comes on the heels of Swift re-acquiring the masters of her first six albums in May 2025, when her announcement included a sneaky hint: 12 \"i's\" on the word \"thiiiiiiiiiiiiis,\" which fans took as a nod toward her 12th album, dubbed \"TS12\" by Swifties. From the Easter eggs she teased to the album's collaborators, here's everything to know about Taylor Swift's 12th album, The Life of a Showgirl. How did Taylor Swift announce her 12th album, The Life of a Showgirl? Taylor Swift announces her new album, 'The Life of a Showgirl' on 'New Heights' podcast. New Heights/Instagram On Monday, Aug. 11, Swift's official website began a countdown that expired at 12:12 a.m. on Aug. 12 and revealed that her new album's pre-order had opened. At the same time, New Heights and Swift's Instagram accounts released a joint teaser from Wednesday's podcast episode, in which Swift announced the news. In the video clip shared at 12:12 am, Swift says, \"Can I show you something?\" Jason replies, \"Okay. What do we got? We got a briefcase? Mint green, with T.S. on it,\" leading Swift to reply, \"Yup.\" After Jason asks what is inside the briefcase, Swift reveals that it is her \"brand new album, The Life of a Showgirl.\" \"TS 12!\" Travis chimes in. What is the color scheme of The Life of a Showgirl? 'The Life of a Showgirl' album cover. Mert Alas & Marcus Piggot From the moment the Kelce brothers teased Wednesday’s guest in an Instagram post featuring a glittery orange background and mint green text — the same hues that later appeared on a countdown on Swift’s website — fans began speculating that that might be the color scheme for a new album. When Swift’s website finally unveiled the project (with its cover art blurred at the time), the color scheme proved to be a blend of glittery orange and mint green. When will The Life of a Showgirl be released? Taylor Swift. TAS Rights Management The Life of a Showgirl will be released on Oct. 3, 2025. What Easter eggs did Swift use to tease her 12th album? Taylor Swift and her cat in October 2024. Taylor Swift/Instagram (2) As Swifties know, color coding, word searches, cryptic hints and Easter eggs are all part of Swift's \"Mastermind.\" In October 2022, she told The Washington Post that it's about \"turning new music into an event for my fans and trying to entertain them in playful, mischievous, clever ways.\" \"As long as they still find it fun and exciting, I’ll keep doing it,\" Swift said — and that she did. Now that Swift has revealed her album, fans are tracing the clues she seemed to have been leaving for months. One hint that fans caught on to came as early as Aug. 12, 2024 — exactly one year before she announced the new album — when Swift stepped out in London wearing an orange and mint green plaid outfit. Related Stories Taylor Swift and Travis Kelce’s Relationship Timeline 13 Easter Eggs in Taylor Swift's Tortured Poets Department Spotify Exhibit Then, in October 2024, Swift posted a video from the Hard Rock Stadium in Miami Gardens, Fla., where she was making a stop on her Eras Tour, captioned, \"Back in the office… 😎 .\" In the video, there is a clear \"A12\" sign in the background, which fans suspect was her way of hinting at the Aug. 12 announcement. Perhaps one of the biggest Easter eggs came during her final stop on the Eras Tour. As the show came to a close, Swift told the crowd she would see them \"next era\" and exited the stage, walking through an orange door, which she confirmed was an Easter egg during her appearance on New Heights. Will The Life of a Showgirl have any collaborators? Taylor Swift and Sabrina Carpenter perform during The Eras Tour on Oct. 26, 2024, in New Orleans. TAS2024/Getty While sharing the album's track list on New Heights, Swift revealed that Sabrina Carpenter is featured on the title track. Before Swift officially shared the news, fans had an inkling that Carpenter could be involved. When the Taylor Nation account teased a new album on Aug. 11, the post included 12 photos — 11 of the pop star by herself, and one with the \"Espresso\" singer. But, that's not all: When Swift introduced her on the New Orleans stop of the Eras Tour with a playful phone call, she told her to \"put on some clothes,\" — the same phrase that Carpenter captioned an Instagram post just days before the reveal of The Life of a Showgirl. Who is involved in the production of The Life of a Showgirl? Taylor Swift performs at Groupama Stadium on June 2, 2024, in Lyon, France. John Shearer/TAS24/Getty On New Heights, Swift confirmed that she teamed up with Max Martin and Shellback for The Life of a Showgirl. “It was really special,\" she said on the podcast. \"It meant the world to me to have this creative experience where we knew we had to bring the best ideas we’ve ever had. I also know the pressure I’m putting on this record by saying that, but I don’t care because I love it that much.\" She hinted that she would be working with the producers again on Aug. 12 when she uploaded a curated playlist to Spotify titled \"And, baby, that's show business for you,\" with a glittery orange and green \"T.S.\" cover. The playlist includes 22 tracks — which fans noted were all produced by Martin and Shellback — including \"New Romantics,\" \"I Did Something Bad\" and \"Bad Blood.\" Martin is known for working with the biggest pop icons, including Swift, Adele, Britney Spears and Katy Perry, and making some of the most beloved pop hits of all time, from Swift's \"Blank Space\" to Spears' \"...Baby One More Time.\" Close Leave a Comment Read more: Entertainment Music Pop Music"
    },
    {
      "url": "https://people.com/style/vmas-2022-taylor-swift-wears-oscar-de-la-renta-crystal-mini-dress-red-lip/",
      "text": "Taylor Swift Makes Grand Return to the VMAs in Crystal Minidress — and Her Signature Red Lipstick! The \"All Too Well\" singer paired her glittering Oscar de la Renta dress with matching Christian Louboutin heels and Lorraine Schwartz jewels By Hedy Phillips Hedy Phillips Hedy Phillips is the Senior Style News Editor at PEOPLE. She has been working at PEOPLE since 2022. Her work has previously appeared in POPSUGAR, HelloGiggles, Reader's Digest and more. People Editorial Guidelines Published on August 28, 2022 08:34PM EDT Taylor Swift. Credit : Arturo Holmes/FilmMagic Taylor Swift is in the house! The \"All Too Well\" songstress made a surprise appearance at this year's MTV VMAs in crystal-covered Oscar de la Renta minidress featuring an open-back. Swift, 32, has been spending some time out of the spotlight lately, but got all dolled up to walk the black carpet in the over-the-top glam look alongside her fellow musicians, including Jack Harlow, Khalid, Conan Gray and more. Swift brought along \"Team All Too Well,\" as she shared on TikTok ahead of her appearance — her short film's star Dylan O'Brien and the cinematographer Rina Yang. The intricate Oscar de la Renta minidress is nude with strands of jewels strategically draped around Swift's body, including one long strand around her arms and two down her back, bringing the whole look together. Swift also wore matching Christian Louboutin heels and Lorraine Schwartz jewelry to complete the look. Check out PEOPLE's full VMAs coverage to get the latest news on one of music's biggest nights. She kept her hair swept back off her face, allowing her dress to do all the talking, but Swift still added a few pops of flair on her eyes in the form of more jewels. And no Taylor Swift look is complete without a bold, signature red lip. For more on the 2022 VMAs, listen below to our daily podcast PEOPLE Every Day. Swift tapped beauty icon Pat McGrath for her beauty look on her big night. The makeup guru shared on Instagram that she did Swift's look using all Pat McGrath products, calling the singer her \"angel.\" \"TAYLOR-MADE BEAUTY💎💎💎 'Surprise! I have been SO EXCITED about this! The MOST DIVINE @taylorswift in #makeupbypatmcgrath at the 2022 @mtv #VMAs in total #patmcgrathlabs,\" McGrath wrote before listing out the products used on Swift's face. And if you're looking to replicate that bold red lip, you'll need LiquiLUST Legendary Wear Matte Lipstick in Elson 4. Swift is up for a handful of awards at this year's ceremony. She's nominated for video of the year for \"All Too Well\" (10 Minute Version) (Taylor's Version), best longform video for \"All Too Well\" (10 Minute Version) (Taylor's Version), best cinematography for \"All Too Well\" (10 Minute Version) (Taylor's Version), best direction for \"All Too Well\" (10 Minute Version) (Taylor's Version) and best editing for \"All Too Well\" (10 Minute Version) (Taylor's Version). Taylor Swift Shares Details on Upcoming 'Midnights' Album: 'The Stories of 13 Sleepless Nights' Dia Dipasupil/Getty Swift dropped her \"All Too Well\" (10 Minute Version) (Taylor's Version) in November last year as part of the re-release of her music following the loss of her masters. The extended \"All Too Well,\" which originally appeared on Swift's 2012 album Red, has everything the original did with a more mature flair — plus a brand new short film starring O'Brien and Sadie Sink. As legend has it, \"All Too Well\" was inspired by a devastating breakup Swift weathered over a decade ago, and over the years, it has become a fan-favorite and one of the Grammy winner's most acclaimed songs, thanks to its vivid, cinematic storytelling. That storytelling is finally brought to the screen in All Too Well The Short Film, in which Sink plays a young Swift and O'Brien portrays her ex-lover, whom Swifties have long suspected to be Jake Gyllenhaal. Jeff Kravitz/Getty This appearance of Swift's comes after she popped up at Haim's London concert in July, wearing a matching look with the trio of sisters. Swift shared a TikTok video of the performers getting ready backstage, where fans can see Este, Danielle and Alana Haim wearing their signature black bikini tops and baggy black leather pants. The camera then pans to Swift who is sporting a similar outfit including a buckled Louis Vuitton crop top and matching black leather pants. Alongside the video — set to the tune of the children's song \"Copycat\" — Swift wrote, \"Hitting copypaste on your friends' looks like @haimtheband.\" Arturo Holmes/FilmMagic Look Back at the MTV VMA Vanguard Award Winners Through the Years The 2022 VMAs are airing live Sunday night from the Prudential Center in Newark, New Jersey. Close Read more: Lifestyle Beauty & Style Red Carpet Style"
    },
    {
      "url": "https://people.com/grammys-2024-taylor-swift-reputation-coded-black-and-white-outfit-red-carpet-photos-details-8553252",
      "text": "Taylor Swift Wears Watch Choker, Opera Gloves in 2024 Grammys Look Full of Reputation Style Easter Eggs Swift is up for six nominations at this year's show — and she's already dressed like a winner. All about her major red carpet moment By Brittany Talarico Brittany Talarico Brittany Talarico is PEOPLE's Style & Beauty Director, where she oversees fashion and beauty coverage across the brand's platforms. This includes managing the vertical's tentpoles, running lead on the Met Gala, which is among PEOPLE.com's top-trafficked red carpet events every year, interviewing the industry's top celebrities and tastemakers and breaking A-list celeb news (a New Jersey shore native, it is no surprise that her favorite interview ever was with Bruce Springsteen). Brittany has represented the brand on national TV programs including Good Morning America and The CW's two TV specials on the British Royals. You may also see her on one of PEOPLE's green screen social media videos decoding Taylor Swift's style. She joined PEOPLE from Cosmopolitan in 2013, where she was an Associate Editor. People Editorial Guidelines Updated on February 4, 2024 09:11PM EST Taylor Swift's wardrobe has been working overtime lately — from the stadium stands to the 2024 Grammys red carpet! The 12-time Grammy winner is back at music's biggest night, this time nominated for six awards. And here are so many Reputation-era Easter eggs in her look, we're busy decoding them all. Swift nodded at her Reputation Taylor's Version re-release as she stepped out at the 66th Annual Grammy Awards in a show-stopping black-and-white look featuring a strapless Schiaparelli gown with a thigh-high slit, worn with black opera gloves, and a number of telling accessories. Her custom made Lorraine Schwartz vintage watch that was turned into a choker appeared to be set to midnight, which could nod at the release time of the album drop. In fact, Swift piled on 300 carats of Lorraine Schwartz Diamonds. There are six chains on her necklace which lines up with Reputation being her sixth album and the black-and-white of it all nods to the original album's black-and-white cover. She wore her hair swept to the side in textured waves and completed the look with a vampy red lip. Kayla Oaddams / Getty Images At this year's show, Swift, 34, is being recognized for her work on Midnights, which is up for album of the year. (And if she wins, she'll become the first performing artist to win the category four times.) The pop superstar's single, \"Anti-Hero,\" is also recognized in the record of the year and song of the year categories. Gilbert Flores/Billboard via Getty Swift attended the Grammys last year, where she was nominated for four awards, rocking head-to-toe midnight blue in a Roberto Cavalli two-piece set, featuring a crystal-embellished long-sleeve crop top and matching floor-length skirt. She also wore Giuseppe Zanotti platform heels dyed to match her dress and $3 million worth of Lorraine Schwartz jewelry, featuring over 136 carats of natural purple sapphires, paraibas and kite-shaped diamond earrings. Axelle/Bauer-Griffin/FilmMagic In 2021, the decorated singer-songwriter made history when she accepted her third album of the year grammy win for Folklore. And she topped best dressed lists in her romantic, ethereal Oscar de la Renta mini dress. How Many Grammys Has Taylor Swift Won? A Look Back at All Her Grammy Awards Getty The fairytale-like long-sleeve mini was completely covered in various types of flower appliqués. She completed the look with baby pink Christian Louboutin heels and Cathy Waterman jewelry. Kevin Mazur/Getty Swift kept he wardrobe equal parts romantic and whimsy for her medley performance of \"Cardigan,\" \"August\" and \"Willow\" on the Grammys stage that year, wearing a metallic blue and silver custom Etro dress and Cathy Waterman hairpiece. TAS Rights Management 2021 via Getty Boyfriend Travis Kelce was noticeably missing from the global superstar's Grammys' entourage on Sunday night as he preps for the big game. During a recent appearance on the The Pat McAfee Show, Kelce confirmed he would not be able to be Swift's date at this year's event as the Kansas City Chiefs gear up for their fifth Super Bowl in five years. \"I wish I could go support Taylor at the Grammys, and watch her win every single award that she’s nominated for,\" he shared before adding, \"But I think I've got practice on Sunday.\" The Chiefs will be using Saturday as a practice day and Sunday as a travel day to Las Vegas, where they will face off against the San Francisco 49ers in Super Bowl TK on Feb. 11. \"Unfortunately, I've gotta get ready for this big old Super Bowl that we’ve got in a week,\" Kelce added on the show. Travis Kelce Confirms He Can't Attend the Grammys with Taylor Swift Due to Super Bowl: 'I Wish I Could' Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human interest stories. Swift was there to cheer her man on at the AFC Championship on Jan. 28 where the Chiefs defeated the Baltimore Ravens and secured their spot in the Super Bowl. The singer rushed the field along with Kelce's family and friends after the win, sharing a passionate kiss with the NFL star on the field. Patrick Smith/Getty The 12-time Grammy winner has become a pro at game day dressing, putting WAG style at the forefront of pop culture in chic custom coats and mini skirts, while also supporting local, female-fronted businesses along the way (and rocking a red lip that just doesn't quit!). After the Grammys broadcast, Swift will jet to Tokyo, Japan for the next leg of her Eras Tour kicking off Feb. 7 with four back-to-back shows, before likely returning back stateside to cheer Travis and the Chiefs on at the Super Bowl, which also happens to be her 13th game. See PEOPLE's full coverage of the 66th annual Grammy Awards as they're broadcasting live on CBS and Paramount+ on Feb. 4 from the Crypto.com Arena in Los Angeles. Read more: Entertainment Awards Shows and Events Grammys"
    }
  ],
  "argos_summary": "Taylor Swift recently announced her 12th studio album, 'The Life of a Showgirl,' during an appearance on the New Heights podcast, revealing a vibrant new aesthetic that includes orange and mint green themes. Fans have been connecting her current fashion choices, such as a red corset look by The Blonds, to past outfits, notably a Vivienne Westwood dress from the 2025 Grammys, suggesting she has been hinting at this new era for some time. The album, set for release on October 3, 2025, features 12 tracks and includes a collaboration with Sabrina Carpenter.",
  "argos_id": "PJS0SAARD"
}