{
  "url": "https://www.nytimes.com/2025/08/14/weather/hurricane-erin-spaghetti-models.html",
  "authorsByline": "Judson Jones",
  "articleId": "ea16a8876c0343659aa9c8655ca498a2",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/images/2025/08/11/multimedia/cyclone-tracker-2025-erin-al052025-satellite_map/cyclone-tracker-2025-erin-al052025-satellite_map-facebookJumbo-v94.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T22:22:37.343000+00:00",
  "addDate": "2025-08-14T22:31:48.831313+00:00",
  "refreshDate": "2025-08-14T22:31:48.831315+00:00",
  "score": 1.0,
  "title": "What Hurricane Models Say About Tropical Storm Erin",
  "description": "The storm’s likely path is coming into focus, but a lot can still change. Here’s what the forecasters look at.",
  "content": "As Tropical Storm Erin moves west toward the Caribbean islands and the official forecast from the National Hurricane Center shows the storm likely beginning to curve — potentially even away from the United States — the center’s forecasters have exercised caution, consistently warning that there is a “greater than normal uncertainty” about where the storm will go after the weekend.\n\nBut why?\n\n\n\nThe uncertainty has to do with quite a few factors, but a main one is the output of the computer weather models that help meteorologists make their forecasts. Specifically, it’s a type of map called a spaghetti plot showing where a computer simulation predicts the center of the storm will be five, seven or even 14 days in the future.\n\nThese mapped model outputs get their name from their resemblance to long strands of pasta.\n\nThe closer the lines are together, the more confidence forecasters have in what the storm might do, because it means many of the models agree with one another. For the next few days, there is a pretty reliable consensus that the storm will track northwest. But how much and when it might turn north or even northeast are still big questions.\n\n“The confidence in the predicted location is less at, say, five days, than at two days, said Richard Pasch, an expert at the Hurricane Center. “In the case of Erin, the model spread increases beyond five days, but not unusually so.”",
  "medium": "Article",
  "links": [
    "https://twitter.com/burgwx/status/1699234098613801326?s=20"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Hurricane Models",
      "weight": 0.111982554
    },
    {
      "name": "Tropical Storm Erin",
      "weight": 0.09297658
    },
    {
      "name": "big questions",
      "weight": 0.07500586
    },
    {
      "name": "forecasters",
      "weight": 0.07084407
    },
    {
      "name": "Erin",
      "weight": 0.07031904
    },
    {
      "name": "long strands",
      "weight": 0.06867494
    },
    {
      "name": "Richard Pasch",
      "weight": 0.06716381
    },
    {
      "name": "the computer weather models",
      "weight": 0.066138715
    },
    {
      "name": "These mapped model outputs",
      "weight": 0.06290311
    },
    {
      "name": "the next few days",
      "weight": 0.061586797
    }
  ],
  "topics": [
    {
      "name": "Hurricanes"
    }
  ],
  "categories": [
    {
      "name": "Weather"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Weather",
      "score": 0.986328125
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.393310546875
    }
  ],
  "sentiment": {
    "positive": 0.14825214,
    "negative": 0.3687236,
    "neutral": 0.48302427
  },
  "summary": "The National Hurricane Center has issued a warning that there is \"greater than normal uncertainty\" about where the storm will go after the weekend. The uncertainty is due to the output of computer weather models, which are often linked to the storm's location. The closer these lines align, the more confident forecasters have about their predictions. However, the uncertainty remains high.",
  "shortSummary": "As Tropical Storm Erin approaches, forecasters warn of significant uncertainty, with many predicting its next move based on the spaghetti plot of a potential future storm.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "05c028dc5cc54ca387830b4b589c37c1",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Tropical Storm Erin is moving west toward the Caribbean, with forecasts indicating a potential curve away from the U.S. However, the National Hurricane Center warns of significant uncertainty regarding the storm's path beyond the weekend. This uncertainty is largely due to varying outputs from computer weather models, particularly illustrated by spaghetti plots, which show differing predictions for the storm's future location.",
  "argos_id": "PMIP3L13R"
}