{
  "url": "https://finance.yahoo.com/news/even-time-high-vanguard-p-192200695.html",
  "authorsByline": "Daniel Foelber, The Motley Fool",
  "articleId": "5105ca6a726b4087ad069430000297e4",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/motleyfool.com/3a90b702423836eb1b284bde212cf2ed",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:22:00+00:00",
  "addDate": "2025-08-14T19:52:27.086348+00:00",
  "refreshDate": "2025-08-14T19:52:27.086350+00:00",
  "score": 1.0,
  "title": "Even at an All-Time High, The Vanguard S&P 500 ETF Isn't as Expensive as It Seems",
  "description": "Peeling back the veil on the S&P 500's elevated valuation reveals a rally grounded in logic.",
  "content": "• The S&P 500 has gotten more expensive because of outsized gains in recent years.\n• The index is much more growth-oriented than in the past, which helps justify a higher valuation.\n• The S&P 500's composition has also made it less diversified and more prone to volatility.\n• 10 stocks we like better than Vanguard S&P 500 ETF ›\n\nExchange-traded funds (ETFs) can provide low-cost ways to get exposure to a diversified basket of stocks. With over $1.5 trillion in assets, the Vanguard S&P 500 ETF (NYSEMKT: VOO) is the largest S&P 500 (SNPINDEX: ^GSPC) fund by net assets -- even larger than the iShares Core S&P 500 ETF and the SPDR S&P 500 ETF Trust .\n\nThe Vanguard S&P 500 ETF is hovering around an all-time high at the time of this writing -- up 8.5% year to date and a whopping 66.4% since the start of 2023. But S&P 500 earnings haven't grown nearly as fast, which has pushed up the valuation of the index.\n\nHere's why the S&P 500 isn't as expensive as it seems, including a few reasons why it could still be a good buy at an all-time high.\n\nOne simple way to measure the S&P 500's valuation is to look at the price appreciation of the index compared to changes in its operating earnings per share (EPS). Operating earnings can be a better metric for tracking the valuation of the S&P 500 because they exclude one-time charges or gains that don't accurately represent the performance of the underlying businesses.\n\nHere's a look at how the S&P 500 has traded in comparison to its operating EPS over different intervals.\n\nAs you can see in the table, the S&P 500 is rising faster than operating earnings, which has expanded its valuation. Overall, the businesses that make up the S&P 500 are relatively expensive based on their performance.\n\nAnother way of looking at S&P 500 valuation is forward earnings projections. The forward price-to-earnings (P/E) ratio of the S&P 500 takes the current price and divides it by analyst consensus estimates for earnings over the next year rather than the trailing 12 months.\n\nAccording to data from FactSet from Aug. 1, the forward P/E ratio of the S&P 500 is 22.2 compared to a five-year average forward P/E of 19.9 and a 10-year average forward P/E of 18.5. So the S&P 500 commands a 20% premium to its 10-year average. On the surface, it looks like the index is massively overvalued. However, the valuation of the S&P 500 and companies in general should arguably go up over time as companies become more efficient.",
  "medium": "Article",
  "links": [
    "https://secure.money.com/pr/sdccd4b30b28?s1=POM&s2=Vertical",
    "https://www.fool.com/investing/stock-market/indexes/sp-500/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=d6c29083-12d8-4688-8d73-ed105893f04d",
    "https://secure.money.com/pr/oa80b51d8b14?s1=POM&s2=Vertical",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=4cbbf8a2-67f8-42c0-a54f-ead59ec42d1a&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000053%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_yahoo%26ftm_pit%3D17670",
    "https://secure.money.com/pr/j9884ce60aa0?s1=POM&s2=Vertical"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Operating earnings",
      "weight": 0.10345496
    },
    {
      "name": "operating earnings",
      "weight": 0.10345496
    },
    {
      "name": "forward earnings projections",
      "weight": 0.09536235
    },
    {
      "name": "Vanguard S&P 500 ETF",
      "weight": 0.08415041
    },
    {
      "name": "earnings",
      "weight": 0.08330626
    },
    {
      "name": "S&P 500 earnings",
      "weight": 0.07948655
    },
    {
      "name": "time",
      "weight": 0.078586206
    },
    {
      "name": "recent years",
      "weight": 0.078419074
    },
    {
      "name": "S&P 500 valuation",
      "weight": 0.078010984
    },
    {
      "name": "the iShares Core S&P 500 ETF",
      "weight": 0.06277724
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9697265625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9453125
    },
    {
      "name": "/Finance/Investing/Funds",
      "score": 0.87744140625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.475830078125
    }
  ],
  "sentiment": {
    "positive": 0.41090706,
    "negative": 0.095617816,
    "neutral": 0.49347517
  },
  "summary": "The Vanguard S&P 500 ETF, which is up 8.5% year to date and a whopping 66.4% since 2023, has been more expensive due to outsized gains in recent years. The index is more growth-oriented than in the past, and its composition has made it less diversified and more prone to volatility. However, the index's valuation has been expanded due to the fact that its earnings have not grown nearly as fast, pushing up the valuation of the index. Despite this, there are several reasons why the index could still be a good buy at an all-time high. The forward price-to-earnings (P/E) ratio and analyst consensus estimates for earnings over the next year are among the reasons for this.",
  "shortSummary": "The Vanguard S&P 500 ETF, at an all-time high, is undervalued due to its more growth-oriented nature and volatile trading patterns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "da7f8eaff90f4546bc1f2db2995cb737",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/investing/stock-market/indexes/sp-500/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=d6c29083-12d8-4688-8d73-ed105893f04d",
      "text": "When it comes to the major U.S. stock indexes, the S&P 500 index is considered the best gauge of the overall stock market's performance and an indicator of how large U.S. corporations are performing.\nWith that in mind, here’s what all investors should know about the S&P 500 index, how it works, how you can invest in it, and why doing so could be a smart move.\nWhat is the S&P 500 index?\nWhat is the S&P 500 index?\nThe S&P 500 (also known as the Standard & Poor's 500) is a registered trademark of the joint venture S&P Dow Jones Indices. It is a stock index that consists of the 500 largest companies in the U.S. and is generally considered the best indicator of how U.S. stocks are performing overall.\nIn simple terms, the S&P 500 is a measure of the performance of America's 500 largest stocks. For this reason, the S&P 500 is a common benchmark against which portfolio performance can be evaluated.\nThe S&P 500 index is weighted by market capitalization, which means that larger companies make up more of the index's performance. Each listed company doesn't simply represent 1/500th of the index. Massive companies such as Apple (AAPL -0.17%) and Amazon (AMZN 2.93%) have a greater impact on the S&P 500 index than relatively smaller companies like General Motors (GM 1.65%).\nOne key point is that, although these are 500 large companies, there's a wide range of valuations. The largest companies in the index have market caps in excess of $3 trillion. This is more than 200 times larger than the smallest S&P 500 companies, which have market caps of less than $10 billion.\nWhy use it?\nWhy use the S&P 500?\nYou may be wondering why the S&P 500 is considered so useful as a market and economic indicator. Because the S&P 500 consists of a broad basket of stocks without too many small or obscure companies, it contains the companies most widely owned by individual investors. In fact, the 500 companies account for roughly 80% of the overall value of the stock market in the U.S.\nCompany weighting formula and calculation\nThe weighting formula for S&P 500 stocks is fairly straightforward. First, the company's market cap is determined by multiplying each company's outstanding share count by its current share price.\nNext, the market caps of all S&P 500 components are added together. Each company's market cap is then divided by the total to determine its weight in the index. For example, if the combined market cap of all S&P 500 companies is $40 trillion and one company has a $1 trillion market cap, it would make up 2.5% of the index by weight.\nWhich companies are in the S&P 500 index?\nThe S&P 500 index is composed of 503 stocks issued by 500 different companies. There's a difference in numbers because a few S&P 500 component companies issue more than one class of stock. For example, Alphabet Class C (GOOG 0.46%) and Alphabet Class A (GOOGL 0.53%) stock are both included in the S&P 500 index.\nObviously, it wouldn't be practical to list all of the S&P 500 companies here. But because the S&P 500 is weighted by market cap, its performance is mostly driven by the performances of the stocks of the largest companies.\nWith that in mind, here's a look at the 10 largest companies of the S&P 500 index as of June 23, 2025. This list and its sequence can, and probably will, change over time.\n- Microsoft (MSFT 0.46%)\n- Nvidia (NVDA 0.28%)\n- Apple (AAPL -0.17%)\n- Amazon (AMZN 2.93%)\n- Alphabet (GOOGL 0.53%) (GOOG 0.46%)\n- Meta Platforms (META 0.28%)\n- Broadcom (AVGO 0.76%)\n- Berkshire Hathaway (BRK.A 0.4%)(BRK.B 0.37%)\n- Tesla (TSLA -1.0%)\n- JPMorgan Chase (JPM 1.25%)\nData source: Dow Jones S&P Indexes.\nSP 500 vs. others\nS&P 500 vs. other major indexes\nAlthough the S&P 500 is widely regarded as the best gauge of how the U.S. stock market is doing, there are several other indexes that can be useful for investors as well, including:\n- Dow Jones Industrial Average\n- Nasdaq Composite\n- Russell 2000 (small-cap index)\nS&P 500 vs. Dow Jones Industrial Average\nThe Dow Jones Industrial Average is a price-weighted index, meaning that the companies with the highest stock prices have the most influence on the index regardless of their valuations. The Dow only lists 30 companies and excludes some of the largest stocks in the market -- for example, Amazon, Alphabet, and Berkshire Hathaway.\nBecause the Dow is price-weighted, Goldman Sachs (GS 0.34%), with a nearly $650 share price currently, has more than six times as much influence over the Dow's performance as Walmart (WMT -0.08%), despite Goldman's market cap being roughly one-fourth of Walmart's.\nFor these reasons, the S&P 500 is considered by most experts to be a better stock market indicator.\nS&P 500 vs. the Nasdaq\nThe obvious difference between the S&P 500 and the Nasdaq Composite Index is that stocks in the latter must be listed exclusively on the Nasdaq market. The S&P 500 is a mix of both Nasdaq and New York Stock Exchange (NYSE) stocks. The Nasdaq has a higher proportion of technology stocks than the broader market, so it is more of a tech-heavy index. You may notice that when tech stocks are underperforming, the Nasdaq Composite tends to underperform the S&P 500 as well.\nAnother key difference is that while the S&P 500 consists of large-cap stocks, the Nasdaq Composite contains all qualified stocks listed on the Nasdaq exchange, so it's more diverse in terms of the market caps represented.\nS&P 500 vs. the Russell Indexes\nThe Russell Indexes are designed to provide benchmarks for the entire stock market. The Russell 1000 is the closest comparison to the S&P 500 since it's a large-cap stock index that consists of 1,000 stocks (twice as many as the S&P 500) and is representative of about 93% of the stock market.\nThere is also the more popular Russell 2000 index, which is considered to be the best benchmark of how small-cap U.S. stocks are doing. Collectively, the Russell 1000 and Russell 2000 are known as the Russell 3000, which is a total stock market benchmark index.\nHow to invest in it\nHow can you invest in the S&P 500 index?\nYou can invest in the S&P 500 index by purchasing shares of a mutual fund or exchange-traded fund (ETF) that passively tracks the index. These investment vehicles own all the stocks in the S&P 500 index in proportional weights.\nThe Vanguard S&P 500 ETF (VOO 0.09%), which trades just like a stock, and the Vanguard 500 Index Fund Admiral Shares (NASDAQMUTFUND:VFIAX) mutual fund are two attractive options. Both have extremely low fees and deliver virtually identical performance as the S&P 500 index over time.\nIn addition, you can buy S&P 500 futures, which trade on the Chicago Mercantile Exchange, although this is a far more complex way to invest than simply buying an index fund. These are essentially options that enable hedging or speculating on the index's future value.\nRelated investment topics\nIs this investment for you?\nIs investing in the S&P 500 right for you?\nLegendary stock market investor Warren Buffett has famously said that a low-cost S&P 500 index fund is the best investment that most people can make. It’s not difficult to see why. Over long periods, the S&P 500 has delivered annualized total returns of 9% to 10%, and you can easily invest in a passive S&P 500 fund with virtually no investment fees.\nIf you have the time, knowledge, and desire to properly research stocks and maintain a portfolio, it’s certainly possible over the long term to achieve superior investment returns relative to the S&P 500. However, not everyone has the time and discipline needed to invest in stocks that way, and newer investors especially may be better off buying shares in an S&P 500 index fund until they build up their knowledge.\nInvesting in the S&P 500 is a way to get broad exposure to the profitability of U.S. businesses without too much exposure to any individual company’s performance. Over time, the S&P 500 can produce strong returns for your portfolio with minimal effort on your part.\nFAQs\nS&P 500 FAQs\nWhat is the S&P 500?\nThe S&P 500 (also known as the Standard & Poor's 500), a registered trademark of the joint venture S&P Dow Jones Indices, is a stock index that consists of the 500 largest companies in the U.S. It is generally considered the best indicator of how U.S. stocks are performing overall. From another angle, the S&P 500, as an index, is a statistical measure of the performance of America's 500 largest stocks. In this context, the S&P 500 is a common benchmark against which portfolio performance can be evaluated.\nWhat are stock market indexes?\nA stock market index shows how investors feel an economy is faring. An index collects data from a variety of companies across industries. Together, that data forms a picture that helps investors compare current price levels with past prices to calculate market performance. Some indexes focus on a smaller subset of the market. For example, the Nasdaq index has a high concentration in technology stocks. So, if you want to know how technology is performing, you’d want to look at the Nasdaq stock index.\nWhat is the Nasdaq Composite Index?\nThe Nasdaq Composite is a stock market index that consists of the stocks that are listed on the Nasdaq stock exchange. To be included in the index:\n- A stock must be listed exclusively on the Nasdaq market.\n- The stock must be a common stock of an individual company, so preferred stocks, exchange-traded funds (ETFs), and other types of securities are excluded.\n- American depositary receipts (ADRs), real estate investment trusts (REITs), and shares of limited partnerships are eligible, however.\nThat's why there are so many stocks included in the Nasdaq Composite and why the number of stocks in the index changes often. The index is designed to be representative of the entire Nasdaq stock market, not just the largest companies."
    }
  ],
  "argos_summary": "The S&P 500 has seen significant price increases, leading to higher valuations, primarily due to its growth-oriented composition and reduced diversification, making it more volatile. Despite its forward price-to-earnings ratio being above historical averages, some argue that the index's valuation could be justified as companies become more efficient over time. Investors can gain exposure to the S&P 500 through low-cost ETFs like the Vanguard S&P 500 ETF, which is currently at an all-time high.",
  "argos_id": "PRXJA922H"
}