{
  "url": "https://www.androidauthority.com/kindle-petit-color-leak-3587712/",
  "authorsByline": "Matt Horne",
  "articleId": "9b02eb4fd9a9481eaa16eaf57e737b83",
  "source": {
    "domain": "androidauthority.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "",
      "county": "",
      "city": "",
      "coordinates": {
        "lat": 0.0,
        "lon": 0.0
      }
    }
  },
  "imageUrl": "https://www.androidauthority.com/wp-content/uploads/2025/08/Kindle-Petit-Color-Leak-Reddit-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T21:46:38+00:00",
  "addDate": "2025-08-14T22:03:30.217214+00:00",
  "refreshDate": "2025-08-14T22:03:30.217216+00:00",
  "score": 1.0,
  "title": "Alleged Kindle Petit Color prototype surfaces amid leaker’s claims of Amazon fallout",
  "description": "A Redditor has shared unverified images of a Kindle Petit Color, describing it as a smaller color e-reader with swappable bezels.",
  "content": "Every so often, a corporate dispute spills out in public. In the tech world, that can mean unreleased hardware suddenly hitting the internet. That’s what appears to have happened here, as a Portuguese-language post on Reddit claims to show an unannounced Kindle model. It was shared by a self-described former Amazon associate who says they cut ties with the company and plan to leak more.\n\nIn the post on the r/kindle subreddit, the user — who appears to be based in Brazil — shared photos of what they call a prototype Kindle Petit Color: a compact e-reader with a Kaleido 3 color E-Ink display. The images show colorful book covers and text on a white device labeled “prototype” and “not for resale.”\n\nThe leaker says it can apply “progressive color” to text and interface elements, smoothly shifting hues through up to four shades as you read. It also allows saturation adjustments for more vibrant results than Amazon’s Kindle Colorsoft, the latest version of which was launched just last month in the US. The prototype lacks a front light, but the source claims the final version will include one.\n\nThey allege the Petit Color will launch in November 2025 in white or black, alongside detachable bezels in Green Leaf, Deep Purple, Chromatic Gray, and a “Mermaid” gradient that changes from pink to teal depending on the viewing angle. It’s said to be slightly smaller than the 11th-generation Kindle and cheaper than the Colorsoft.\n\nThe leaker also claimed that Amazon is developing a larger “Kindle Carta Color” with an almost A4-sized display, though they say they’re not directly involved in that project.\n\nNone of these details are confirmed, and a scorned former associate isn’t exactly an objective source. Posting prototype images without authorization can breach non-disclosure agreements, but the poster appears unfazed by any such obligation. For now, the alleged Petit Color remains firmly in leak territory.",
  "medium": "Article",
  "links": [
    "https://www.androidauthority.com/kindle-colorsoft-16gb-kids-launched-3580704/",
    "https://www.androidauthority.com/android-authority-preferred-source-google-search-3586296/",
    "https://www.androidauthority.com/android-authority-comment-policy/",
    "https://www.androidauthority.com/tag/amazon-kindle/",
    "https://www.reddit.com/r/kindle/comments/1mp8n11/a_amazon_quebrou_a_parte_deles_do_contrato_ent%C3%A3o/",
    "https://www.androidauthority.com/news/",
    "https://www.androidauthority.com/which-kindle-model-do-i-have-1073996/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Kindle Petit Color",
      "weight": 0.108910814
    },
    {
      "name": "Alleged Kindle Petit Color prototype",
      "weight": 0.10835223
    },
    {
      "name": "Kindle Carta Color",
      "weight": 0.100368015
    },
    {
      "name": "Petit Color",
      "weight": 0.09177495
    },
    {
      "name": "Kindle Colorsoft",
      "weight": 0.086426705
    },
    {
      "name": "Kindle",
      "weight": 0.079623796
    },
    {
      "name": "prototype images",
      "weight": 0.07631928
    },
    {
      "name": "a prototype Kindle Petit Color",
      "weight": 0.07277886
    },
    {
      "name": "Amazon fallout",
      "weight": 0.06953586
    },
    {
      "name": "Amazon",
      "weight": 0.06779469
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.88720703125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.5400390625
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.52197265625
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.34814453125
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.31640625
    }
  ],
  "sentiment": {
    "positive": 0.07453607,
    "negative": 0.5461985,
    "neutral": 0.37926546
  },
  "summary": "A Portuguese-language post on Reddit claims to show a prototype Kindle Petit Color, a compact e-reader with a Kaleido 3 color E-Ink display. The post was shared by a self-proclaimed former Amazon associate who claims they have cut ties with the company and plan to leak more. The prototype lacks a front light, but the final version will include one. The leaker alleges that the Petit Colour will launch in November 2025 in white or black, with detachable bezels and a \"Mermaid\" gradient that changes depending on the viewing angle.",
  "shortSummary": "A leaked prototype of the Kindle Petit Color e-reader, featuring a Kaleido 3 display, raises eyebrows as part of ongoing corporate fallout.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9a21ce65a1c54d93bfe54a64d4029d00",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.androidauthority.com/news/",
      "text": "News\nAudioComputingGamingGeneral technologyMobileSmart homeStreaming and entertainmentWearables and health\nGoogle Pixel 9 Pro Fold drops to new record-low price!\nThe Google Pixel 9 Pro Fold has never been cheaper than today!\nEdgar Cervantes\nAlleged Kindle Petit Color prototype surfaces amid leaker’s claims of Amazon fallout\nMatt Horne1 hour ago\n0\nAndroid 16 QPR1 is nearly complete as Beta 3.1 arrives for testers\nStephen Schenck1 hour ago\n0\nGoogle Home finally adds full temperature scheduling for older Nest thermostats\nMishaal Rahman2 hours ago\n0\nThe Pixel 10 report card is now in: Here's how the phones score in energy efficiency and durability\nPixel 10 Pro may last longer than the base model, despite having a smaller battery.\nRyan McNeal\nGoogle’s latest foldable teaser raises unexpected naming questions\nMatt Horne5 hours ago\n0\nMultiple Galaxy S25 FE leaks reveal renders, colors, and possible launch date\nRyan McNeal5 hours ago\n0\nWear OS smartwatches no longer have this leg up over the Apple Watch\nMatt Horne6 hours ago\n0\nOur latest\nSamsung has a new way you can get a Galaxy foldable at an actually affordable price\nMatt Horne7 hours ago\n0\nFinding the best deals on Google Flights is about to get a little easier\nRyan McNeal8 hours ago\n0\nGemini's getting a nice usability upgrade for its text responses (Updated)\nChristine Romero-Chan8 hours ago\n0\nThe Fitbit app on your Pixel Watch just got a gorgeous Material 3 makeover\nRita El Khoury9 hours ago\n0\nThought HTC was dead? It just launched a surprisingly compelling Ray-Ban Meta rival\nTushar Mehta10 hours ago\n0\nNew Gemini features will give the chatbot a better memory, but also selective amnesia\nMegan Ellis10 hours ago\n0\nNow even Flip phones will get 200MP cameras\nHadlee Simons10 hours ago\n0\nGoogle Find Hub's automatic enrollments will only give you two days to opt out (APK teardown)\nAamir Siddiqui10 hours ago\n0\nThe Galaxy S25 series might be more popular than all other Snapdragon 8 Elite phones combined\nTushar Mehta11 hours ago\n0\nGoogle Wallet has a new shortcut UI, but I'm not sure it's an upgrade\nHadlee Simons11 hours ago\n0\nSurvey reveals the worst Android phone to buy this month\nAamir Siddiqui12 hours ago\n0\nLatest Google Messages bug gives you two (or three) app icons\nAamir Siddiqui12 hours ago\n0"
    },
    {
      "url": "https://www.androidauthority.com/android-authority-comment-policy/",
      "text": "Android Authority is a community of technology enthusiasts. We’re brought together by our interest in all things tech, regardless of brand, platform, and price point. Our writers care deeply about the topics they cover, and so do our readers.\nBecause we’re all passionate, it’s easy for discussions around certain topics to become heated, but that’s not an excuse for discussions to degenerate.\nHere are the general rules that cover commenting on Android Authority platforms, including on-site comment sections, YouTube, and various social media channels.\nDo’s\n- Always be civil.\n- Read the content before commenting.\n- Post thoughtful comments that meaningfully contribute to the discussion.\n- Give constructive criticism in response to posts and other comments.\n- Ignore the trolls, they crave attention.\n- Downvote low-quality comments. Flag spam and abusive comments.\nDon’ts\n- Attack commenters, Android Authority staff, or other individuals.\n- Post off-topic comments.\n- Post abusive, insulting, threatening, harassing, sexist, racist, misogynist, homophobic comments.\n- Reveal personal information of any individuals.\n- Spam, self-promote, impersonate.\n- Post low-effort comments that don’t add anything to the discussion.\n- Post porn, gore, or other NSFW content.\n- Post or link to pirated content of any type.\n- Post slanderous or defamatory comments.\nHouse rules\n- Comments are solely the opinions of the individuals leaving them. In no way does Android Authority endorse or condone them.\n- Failure to comply with the guidelines above may result in your comments being deleted or moderated.\n- Repeat and serious offenders will be banned.\n- We reserve the right to delete or moderate comments at any time and at our sole discretion.\n- This policy may be changed at any time and at our sole discretion."
    },
    {
      "url": "https://www.androidauthority.com/android-authority-preferred-source-google-search-3586296/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nWant more Android Authority? How to set us as your preferred source in Google Search\nAugust 12, 2025\nSince 2007, Android Authority has strived to bring all of our readers the very best coverage of Android and the mobile tech world. And even after 18+ years as a proudly independent media outlet, we’re as driven as we’ve ever been to bring you all the latest exclusive reports, app teardowns, leaks, hands-on reviews, experience-based features, lab testing, and other expert analysis.\nOf course, how we’ve been able to get that coverage to you has changed in countless ways during that time, be it via our website, YouTube channel, social media, or new projects like Authority Insights, which combines our elite reporting with a podcast and a newsletter, as well as our brand new YouTube channel from Android Authority‘s Pixel guy, C. Scott Brown.\nWe want to continue to bring you the very best Android and mobile tech coverage, and you can help us do that.\nWe know and deeply appreciate that so many of you repeatedly visit our website and other channels to constantly see what we’ve been working on, often every day. Every one of those clicks or interactions helps us remain independent and every bit as innovative and ambitious as we’ve been since day one.\nSo, if you want to see even more of our content, guarantee you don’t miss anything from us, or just want to continue to support our mission, we’d like to ask you a big favor and set Android Authority as a preferred source in Google Search. It only takes a few seconds, it doesn’t cost you anything, and it will help us continue to bring you the best possible content for the next decade and beyond.\nThis feature is currently only available in the US and India, but we’ll let you know when other regions are included in this new feature. For those who already have it, here’s how to do it:\nHow to set Android Authority as a preferred source\n- Search for a topic that’s in the news and find the “Top stories” header. If you don’t see this, you might need to input a different query. “Galaxy S26 Pro” worked for us at the time of writing.\n- Click on the icon on the right of the “Top stories” header. That’s the icon with the stacked squares and a star on top.\n- Search for “Android Authority” and select it to set it as a preferred source. You can add other websites at this stage, too — support your favorite publications!\n- Refresh your search results to see more from your favorite sites.\nOnce again, a big thank you to all our readers, viewers, and followers — your passion for Android and tech is what pushes us forward. We hope you’ll add us as a preferred source (and please feel free to encourage any other tech enthusiasts you know to do the same!), but even if you don’t, we’re grateful for every one of you that supports our work in any way possible. And as ever, if you have any feedback for us, please drop an email to contact@androidauthority.com.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/kindle-colorsoft-16gb-kids-launched-3580704/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nAmazon launches a cheaper color Kindle and its first model for kids\nJuly 24, 2025\n- Amazon has launched a cheaper Kindle Colorsoft 16GB and a new Kindle Colorsoft Kids model.\n- The Kids version includes a year of Amazon Kids Plus, a colorful case, and parental controls.\n- Both devices use the same color screen as last year’s model, which we didn’t love.\nAmazon is still betting on color E-Ink, even if it had a somewhat rocky start last year. The company just added two more devices to its Kindle Colorsoft lineup: a cheaper 16GB version and a new Kindle Colorsoft Kids. Both are available starting today.\nAs outlined in Amazon’s press release, the 16GB Colorsoft costs $249.99, shaving $30 off the Signature Edition from last year by dropping the wireless charging and cutting the storage in half. Otherwise, it’s the same device, complete with the same color screen, adjustable warm light, and ability to highlight text in different colors.\nThe new Kids version is the first color Kindle aimed at younger readers. It’s priced at $269.99 and includes a year of Amazon Kids Plus, a colorful protective case, and Amazon’s usual suite of parental controls. Amazon says kids who read comics and graphic novels on Kindle spend nearly 50% more time reading than average, so this move makes sense.\nBoth models use the same Colorsoft display that debuted last year. At the time, Amazon’s first color Kindle was met with some skepticism from us. We found the display resolution frustrating, which drops to 150ppi in color mode, as well as the lack of any real note-taking features. Some buyers also reported screen tint issues that led to delays and a promised software fix.\nAmazon hasn’t changed the hardware here, but it’s clearly hoping these new additions will broaden the appeal, either to those who didn’t want to spend $280 for the Signature Edition or to families looking for a kid-friendly option.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/which-kindle-model-do-i-have-1073996/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nWhich Kindle do I have? A quick guide to identifying all of Amazon's e-readers\nApril 11, 2025\nThe Amazon Kindle is arguably Amazon’s best product. The e-ink display, the long battery life, and the simple design make for excellent e-readers. Early Kindle had some confusing naming schemes, an issue that Amazon has cleaned up in recent releases. Still, many of these devices look like one another, so we’re here to help you determine which one you own. You may need to know which Kindle model to buy, the proper case or other accessories, or fix an issue, but how do you check which Kindle model you have? Perhaps you’re just curious, and you can’t remember. Here’s a quick and dirty guide to which Kindle you have from all the available options.\nEditor’s note — This article is for Kindle e-readers. If you have a Kindle Android tablet, you can easily find your device’s name in the Settings menu.\nQUICK ANSWER\nKindles running firmware 5.14 or higher can go into Settings, Device Options, and Device Info. Your device's name should be the first thing listed. If you have a device running older firmware, you can check your Amazon account, use the serial number of the device, or look out for the physical identifiers listed below.\nJUMP TO KEY SECTIONS\nIdentify your Kindle with Device Info\nKindle devices now list their own device name in the Device Info section, starting with firmware version 5.14. That should include all modern Kindles and some from a few years back. Here’s how to check:\n- Go into the Settings menu.\n- Navigate to Device Options.\n- Tap the Device Info option.\n- Your Kindle will display information like Wi-Fi MAC address, firmware version, and other details.\n- The very first item on the list should be your device’s model. Check the photo above to see what it looks like.\n- Note — The Device Info section may vary depending on your device and the firmware version.\nAnd that’s it. You should be able to see your device’s name easily. Unfortunately, older devices don’t have this luxury, so we’ll continue with other ways to identify your device.\nCheck your Amazon account\nYour Kindle is presumably linked to your Amazon account, so one method of checking which device you have is to contact Amazon directly.\nTo do this, head to www.amazon.com/mydevices. If you’re logged in, you’ll see the general Manage Your Content and Devices page, which shows all of the digital content and physical devices linked to your account. Along the top, you can select Devices to narrow it down. When you see your Kindle, select it to see a description of which model you have.\nUse the Kindle’s serial number or model number\nOnce you identify your serial or model number, refer to the table below to figure out which version you own.\nHow to find your serial number\n- Go into your Settings menu.\n- Navigate to Device Options.\n- Finally, go to Device Info.\n- The serial number and your Wi-Fi MAC Address, firmware version, and other data should be there.\n- Note — This method works for modern Kindles. The Settings menu may be slightly different on older models.\nHow to find your model number\nThe model number is printed in two places. The first is on the back of the device, where all the information is. It’s usually towards the bottom. The other place is on the original box.\n| Kindle model (Release year) | Generation | Serial number prefix | Model number | Short name |\n|---|---|---|---|---|\n| Kindle model (Release year) Kindle Scribe (2022) | Generation 11th | Serial number prefix G092 | Model number C4A6T4 | Short name KS |\n| Kindle model (Release year) Kindle Basic 4 (2022) | Generation 11th | Serial number prefix G092 | Model number C2V2L3 | Short name KT5 or K8gen (unconfirmed) |\n| Kindle model (Release year) Kindle Paperwhite 5 (2021) | Generation 11th | Serial number prefix G001LG, G001PX | Model number M2L3EK / M2L4EK | Short name KPW5, PW5 |\n| Kindle model (Release year) Kindle Oasis 3 (2019) | Generation 10th | Serial number prefix G0011L, G000WQ, G000WM, G000WN, G000WL, G000WP | Model number S8IN4O | Short name KOA3 |\n| Kindle model (Release year) Kindle Basic 3 (2019) | Generation 10th | Serial number prefix G0910L, G0910WH | Model number J9G29R | Short name KT4 |\n| Kindle model (Release year) Kindle Paperwhite 4 (2019) | Generation 10th | Serial number prefix G000PP, G000T6, G000T1, G000T2, G00102, G00103, G000T3, G0016R (Plum), G0016S (Sage) | Model number PQ94WIF | Short name PW4 |\n| Kindle model (Release year) Kindle Oasis 2 (2017) | Generation 9th | Serial number prefix G000P8, G000S1, G000SA, G000S2 | Model number CW24WI | Short name KOA2 |\n| Kindle model (Release year) Kindle Basic 2 (2016) | Generation 8th | Serial number prefix G000K9, G000KA | Model number SY69JL | Short name KT3 |\n| Kindle model (Release year) Kindle Oasis (2016) | Generation 8th | Serial number prefix G0B0GC ,G0B0GD, G0B0GR, G0B0GU, G0B0GT | Model number S8IN4O | Short name KOA |\n| Kindle model (Release year) Kindle Paperwhite 3 (2015) | Generation 7th | Serial number prefix G090G1, G090G2, G090G4, G090G5, G090G6, G090G7, G090KB, G090KC, G090KE, G090KF, G090LK, G090LL | Model number DP75SDI | Short name PW3 |\n| Kindle model (Release year) Kindle Voyage (2014) | Generation 7th | Serial number prefix B013, 9013, B054, 9054, B053, 9053, B02A, B052, 9052 | Model number NM460SZ | Short name KV |\n| Kindle model (Release year) Kindle Basic 1 (2014) | Generation 7th | Serial number prefix B0C6, 90C6, B0DD, 90DD | Model number WP63GW | Short name KT2, BASIC |\n| Kindle model (Release year) Kindle Paperwhite 2 (2013) | Generation 6th | Serial number prefix B0D4, 90D4, B05A, 905A, B0D5, 90D5, B0D6, 90D6, B0D7, 90D7, B0D8, 90D8, B0F2, 90F2, B017, 9017, B060, 9060, B062, 9062, B05F, 905F, B061, 9061 | Model number EY21 / DP75SDI (unconfirmed, but there seems to be overlap with previous and future Paperwhites) | Short name PW2 |\n| Kindle model (Release year) Kindle Paperwhite 1 (2012) | Generation 5th | Serial number prefix B024, B01B, B020, B01C, B01D, B01F, B00C (tester versions only) | Model number EY21 | Short name PW |\n| Kindle model (Release year) Kindle 5 (2012) | Generation 5th | Serial number prefix B012 | Model number SV98LN | Short name K5, K5G |\n| Kindle model (Release year) Kindle Touch (2012) | Generation 4th | Serial number prefix B00F, B011, B010 | Model number D01200 | Short name KT, K5W |\n| Kindle model (Release year) Kindle 4 (2011) | Generation 4th | Serial number prefix B00E, B023, 9023 | Model number D01100 | Short name K4, K4S, K4B |\n| Kindle model (Release year) Kindle 3 (2010) | Generation 3rd | Serial number prefix B008, B006, B00A | Model number D00901 | Short name K3 |\n| Kindle model (Release year) Kindle DX (2010) | Generation 2nd | Serial number prefix B004, B005, B009 | Model number D00611 | Short name DX, DXI, DXG |\n| Kindle model (Release year) Kindle 2 (2009) | Generation 2nd | Serial number prefix B002, B003 | Model number D00701 | Short name K2, K2I |\n| Kindle model (Release year) Kindle (2007) | Generation 1st | Serial number prefix B001, B101 | Model number D01400 | Short name K1 |\nUse your Kindle’s physical appearance\nFinally, we can help you identify your model based on its appearance. We only recommend this if you cannot get your serial or model numbers from the settings. Most Kindles also have a model number printed on the back of the device. If yours hasn’t rubbed off, you can Google your model number to find out your exact model and generation.\nIf that fails you, the section below shows you how to identify your Kindle based on its physical appearance. It’s the least efficient way, but it still works.\n12th Generation\n- Kindle Colorsoft Signature Edition (2024) — You’d be hard-pressed to miss that you have the Colorsoft, as it’s the first-ever color Kindle.\n- Kindle Scribe 2 (2024) — The Scribe 2 looks almost exactly the same as the original Scribe at first glance. That is unless you have the Tungsten Green model, which is a dead giveaway that it’s the latest version.\n- Kindle Paperwhite 6 (2024) — The latest Paperwhite has a softer and less sticky finish on the back of the device. It also has more rounded corners and more curved edges than its predecessor. As with the Scribe 2, colors will be the most obvious giveaway, as Raspberry Pink or Jade Green will tell you that you have the 2024 model.\n- Kindle 12 (2024) — There’s very little way to tell the latest basic Kindle from its predecessor. It has a 6-inch display and USB charging. The main differences are a better contrast for deeper blacks, and less screen glare.\n- Kindle Paperwhite Kids (2024) — Slightly thinner than the 2024 Paperwhite, the most obvious giveaway for the Kids version is that you’ll find a parental dashboard in the settings.\n11th Generation\n- Kindle Paperwhite 5 (2021) — The Paperwhite 5 has the black Amazon swoosh on the back and “Kindle” in white letters on the front. It’s physically similar to the Paperwhite 4. The biggest difference is its ability to emit warm light from the screen. Thus, if yours has a setting to emit warm light, it’s a Paperwhite 5. Otherwise, it’s a Paperwhite 4.\n- Kindle Basic 4 (2022) — The Basic 4 is part of the 11th-generation Kindle. It looks very similar to the Paperwhite 5 but with a slightly smaller display. Additionally, the text on the front of the device is the same color as the device and not white like the Paperwhite.\n- Kindle Scribe (2022) — The Scribe may not be part of the 11th Generation, but we’re listing it here anyway. This one looks similar to previous Oasis devices, except the thick bezel is on the left instead of the right. It also comes with a USB-C port. Notably, it’s also the only one you can write on.\n10th Generation\n- Kindle Basic 3 — The back has the Amazon arrow logo without the word “Amazon.” It is otherwise physically identical to the Basic 2 aside from size.\n- Kindle Paperwhite 4 — The Paperwhite 4 looks physically identical to the Paperwhite 3, except the text on the front is white instead of black.\n- Kindle Oasis 3 — The Oasis 3 is physically identical to the Oasis 2. The only differentiation, as far as we know, is the Oasis 3 can emit warm light from the screen instead of the usual backlight color of the Oasis 2. If your settings have a warm light option, it’s an Oasis 3. Otherwise, it’s an Oasis 2.\n9th Generation\n- Kindle Oasis 2 — The Oasis 2 is much larger than most other models at 7 inches, with a two-button handle on the right side. The handle is thicker than the rest of the device. The back has an Amazon arrow logo with “Amazon” text written vertically rather than horizontally.\n8th Generation\n- Kindle Basic 2 — The back features rounded edges, which are different than the sloped edges of the Basic 1. Otherwise, the front looks identical to other basic models.\n- Kindle Oasis — The original Oasis looks the same as the other models. However, the original Oasis was much smaller than the other two, which is its only defining difference.\n7th Generation\n- Kindle Paperwhite 3 — The Paperwhite 3 is the only Paperwhite with black text on the front. It looks strikingly similar to Basic 1. However, looking closely, you’ll notice the Paperwhite 3 has a taller screen than the Basic 1.\n- Kindle Voyage — The Voyage has a unique front design, with thin, vertical lines on the side and left and right soft-touch buttons for easy page-turning.\n- Kindle Basic 1 — The first Basic is very similar to the other three Basic devices. However, on the back, the edges are sloped rather than rounded; to our knowledge, it is the only e-reader in the bunch with those sloped designs.\n6th Generation\n- Kindle Paperwhite 2 — The second-generation Paperwhite is the only Paperwhite with a glossy black Amazon logo on the back. All future generations have engraved logos with the same material as the rest of the device. The front looks the same as basically all other Paperwhites.\n5th Generation\n- Kindle 5 — The fifth-gen is physically identical to the fourth generation, except this one comes in black instead of silver. They are otherwise so close that Amazon lists them together on its list of all devices.\n- Kindle Paperwhite 1 — The first Paperwhite looks the same as future generations. However, the first one is the only one with the name on the back and the front. All future generations use the Amazon logo.\n4th Generation\n- Kindle Touch — The Touch is easy enough to identify. It’s the only one with the physical, four-line home button on the front of the device.\n- Kindle 4 — The fourth-gen e-reader has the characteristic square button on the front with two circular buttons on the left and right sides. However, this one only came in silver, and the fifth-generation model only came in black.\n3rd Generation\n- Kindle 3 — This third-gen product is the last one that came with a full keyboard. It has four rows of buttons along with two page turn buttons on the right side. This model also introduced the square button that would be prevalent in the fourth and fifth-generation models later on.\n2nd Generation\n- Kindle 2 — This one has a totally unique look. It had a five-row keyboard with two buttons on the left and five buttons on the right. It is the only Amazon e-reader with that configuration.\n- Kindle DX — The DX has a larger screen than most early devices. However, its four-row keyboard is much smaller, and, as a result, the screen-to-body ratio is much larger than most, making it easy to identify.\n1st Generation\n- Kindle 1 — The first one is easily identifiable by its keyboard. It’s the only one with a keyboard split down the middle and separated for easier two-hand typing. Additionally, each key has a weird bend that is vastly different from all other models.\nThank you for being part of our community. Read our Comment Policy before posting."
    }
  ],
  "argos_summary": "A Reddit user claims to have leaked images of an unannounced Kindle model, dubbed the Kindle Petit Color, featuring a Kaleido 3 color E-Ink display. The prototype is said to allow for 'progressive color' adjustments and is expected to launch in November 2025, alongside a larger Kindle Carta Color. While the details remain unconfirmed and the source is a former Amazon associate, the leak suggests Amazon's ongoing development in color e-readers.",
  "argos_id": "QML6VEKCB"
}