{
  "url": "https://www.miamiherald.com/opinion/article311706249.html",
  "authorsByline": "Linda Blackford",
  "articleId": "440d1b69bc974390ae4263bcd6bb5ecc",
  "source": {
    "domain": "miamiherald.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Miami-Dade County",
      "city": "Miami",
      "coordinates": {
        "lat": 25.7741728,
        "lon": -80.19362
      }
    }
  },
  "imageUrl": "https://www.kentucky.com/public/latest-news/dnx3u1/picture311079055/alternates/FREE_1140/LEX_01_OpEdBreathitthorses_",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:12:30+00:00",
  "addDate": "2025-08-14T19:16:55.158837+00:00",
  "refreshDate": "2025-08-14T19:16:55.158839+00:00",
  "score": 1.0,
  "title": "Wild horses are going to die brutally in slaughterhouses. It’s all legal",
  "description": "Wild horses are going to die brutally in slaughterhouses. It’s all legal",
  "content": "Kentucky likes to call itself the Horse Capital of the World.\n\nUnless, that is, you mean wild horses, in which case some elected officials seem perfectly willing to let them be shipped off to slaughter in Mexico or Canada.\n\nA few weeks ago, I wrote about some herds of wild horses that live on abandoned mine lands outside of Jackson in Breathitt County. Some were released by owners for grazing, many more have been born there. They are a big draw for tourists, who see the horses with tour guides from the Appalachian Horse Project.\n\nThe horses are overpopulating and becoming a genuine nuisance to nearby homeowners, as well as a danger to motorists when the animals come down off the mountain in winter to search for food.\n\nBut for two years, the Appalachian Horse Project and the Kentucky Equine Education Project Foundation have been working on a solution: A sanctuary where the horses could get veterinary care, adequate food, and birth control to slow down the birth rate.\n\nThe Breathitt County Industrial Authority voted unanimously to support the project and was actively looking for land. Chairwoman Sue Clair said the authority remained supportive of whatever it can do to help because the horses have brought so much tourism.\n\n“The horses have been a great drawing card here in Breathitt County,” Clair said. “People come from far and wide to look at them”\n\nBut in the meantime, the Breathitt Fiscal Court ignored that potential solution and voted to get rid of the horses — full stop.\n\nThat invoked the state’s stray-hold process, which allows anyone to come and get the horses, take them to be rehomed, or more likely to be sold to dealers who take the horses on a grueling journey north or south to a slaughterhouse.\n\nRight now, there are 24 horses listed as stray holds on the website of the Office of the State Veterinarian. That means they are free roaming horses that have been picked up by their new owners if no one else claims them. The Department of Agriculture says this website is their only involvement in the process, and it’s entirely left up to county officials.\n\nFive of the horses listed have been picked up by the Kentucky Humane Society, including Jasmine and Thor, a mare and foal I wrote about. They will be fed, taken care of and rehomed.\n\nThe other 19 were picked up by Brandon Ferguson, a horse dealer in West Liberty. In a phone interview, he told me that he will try to tame and sell the horses for riding. But it’s also possible, he said, that he will sell them to someone who will in turn sell them to a kill pen that holds horses until they can be shipped to slaughterhouses.\n\nAnd Ferguson is playing by the rules, such as they are.\n\nWitnesses in Breathitt County have reported that other horses are just being sedated with dart guns, and hauled off without even filling out the stray-hold paperwork. It’s unclear exactly how many have been carted away without documentation.\n\nHorse slaughter was banned in the United States in 2007 because, as a culture, we have decided that while we eat cows, horses are companion animals. Other countries do consume horse meat, which is why slaughterhouses still exist in Mexico and Canada.\n\nDoes Breathitt County Judge Executive Jeffrey Noble care? Who knows? He has refused to return numerous requests for comment. Same for Jamie Holbrook, the county animal control officer.\n\nIf Kentucky really wants to consider itself the Horse Capital of the World, it needs to revamp our stray-hold laws to make sure it can’t be used to funnel horses for human consumption. Then the General Assembly could assist these non-profits with more funding for population control.\n\nThat work to help the free-roaming horses in other counties, such as Pike, Magoffin and Perry, will continue, said Elisabeth Jensen, who runs the KEEP Foundation.\n\n“Since this issue came up, and we realized the Breathitt fiscal court would not be cooperative in solving this problem, other counties have said they would like to work with us to have this Appalachian Horse Center in their county,” Jensen said.\n\nKEEP and other groups will also be working with legislators about new statutory language about the stray-hold pickup rules and what happens after that.\n\nThis is a complicated issue. But in a state that relies so much on horses — their breeding, their racing, their brand, their companionship — finding a solution is the least Kentucky can do.",
  "medium": "Article",
  "links": [
    "https://www.miamiherald.com/opinion",
    "https://kentucky.com/subscribe",
    "https://twitter.com/lbblackford",
    "https://pmc.ncbi.nlm.nih.gov/articles/PMC2034431/",
    "https://www.miamiherald.com/profile/218577095",
    "https://www.kyagr.com/statevet/strayhorse/",
    "https://appalachianhorseproject.org/visitor-programs",
    "https://www.kentucky.com/opinion/linda-blackford/article311074305.html"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other horses",
      "weight": 0.12166729
    },
    {
      "name": "horses",
      "weight": 0.117130496
    },
    {
      "name": "Wild horses",
      "weight": 0.116905674
    },
    {
      "name": "wild horses",
      "weight": 0.116905674
    },
    {
      "name": "Horse slaughter",
      "weight": 0.11507342
    },
    {
      "name": "horse meat",
      "weight": 0.11367253
    },
    {
      "name": "free roaming horses",
      "weight": 0.107817814
    },
    {
      "name": "stray holds",
      "weight": 0.07612421
    },
    {
      "name": "Breathitt County",
      "weight": 0.074226394
    },
    {
      "name": "other counties",
      "weight": 0.073157154
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Pets & Animals/Animal Products & Services/Animal Welfare",
      "score": 0.59521484375
    },
    {
      "name": "/News/Local News",
      "score": 0.4853515625
    },
    {
      "name": "/Pets & Animals/Pets/Dogs",
      "score": 0.34033203125
    }
  ],
  "sentiment": {
    "positive": 0.0829729,
    "negative": 0.55713683,
    "neutral": 0.35989028
  },
  "summary": "Kentucky, known as the Horse Capital of the World, has allowed wild horses to be shipped off to slaughter in Mexico or Canada. The wild horses live on abandoned mine lands outside of Jackson in Breathitt County, which are a significant draw for tourists and a nuisance to homeowners and motorists. The Appalachian Horse Project and the Kentucky Equine Education Project Foundation have been working towards creating a sanctuary where the horses can receive veterinary care, adequate food, and birth control. However, the Breathitt Fiscal Court voted to get rid of the horses, invoking the state's stray-hold process. Currently, there are 24 horses listed as stray holds on the website of the Office of the State Veterinarian. Five of these horses have been rehomed by the Kentucky Humane Society and 19 by horse dealer Brandon Ferguson.",
  "shortSummary": "Kentucky, despite its reputation as the Horse Capital of the World, is facing a crisis over overpopulating wild horses and potential human consumption issues, leading to unnecessary slaughterhouse closures.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "cb8f4a9dbbe7480caa497aa04d7cae8b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://appalachianhorseproject.org/visitor-programs",
      "text": "If you are new to the Appalachian area, you will be surprised at the hidden beauty of the mountains and the friendliness of the people. The Appalachian area represents a unique part of the American culture, which is rich in tradition, strong family ties, mountain-inspired music and art, and a sense of independence built from years of isolation from large cities.\nWe will take you into those mountains so you can get up close and personal with our free-roaming horses. Many are very friendly and will come up very close, while others are more shy and will look but not approach us.\nThe tours last 3 hours, and will be led by a local resident Tour Guide. You can reserve a tour for the morning or afternoon. You will travel in a truck or 4-wheel vehicle, or an ATV, depending on the weather and the size of the group. We keep our groups small so everyone can ask questions and have a change to safely pet one of the horses, if they would like to.\nThe tours last 3 hours, and will be led by a local resident Tour Guide. You can reserve a tour for the morning or afternoon. You will travel in a truck or 4-wheel vehicle, or an ATV, depending on the weather and the size of the group. We keep our groups small so everyone can ask questions and have a change to safely pet one of the horses, if they would like to.\nYour Tour Guide will tell you about the history and culture in the Eastern Kentucky Appalachian region, about the role of coal mining in the area, and how the horses came to live in the mountains. On the ride to the top of the mountain, you will travel on a scenic road winding along a clear stream and shaded by native trees.\nAfter you reserve your tour, we will send you more detailed information with maps, and answers to questions many people ask.\nYou will be glad to know that 50% of your tour fee goes directly to helping the horses, such as winter feed, salt blocks, vet care, transportation, etc. (The other 50% goes to our Tour Guides).\nQUESTIONS? Email us at tours@appalachianhorsecenter.org"
    }
  ],
  "argos_summary": "Kentucky's wild horse population, particularly in Breathitt County, faces a crisis as local officials consider shipping them to slaughterhouses despite efforts by organizations like the Appalachian Horse Project to establish a sanctuary for their care. The Breathitt Fiscal Court has opted to remove the horses, invoking a stray-hold process that could lead to their sale for slaughter, while some horses have already been taken in by the Kentucky Humane Society. Advocates are calling for changes to stray-hold laws and increased support for population control measures to protect these animals, which are a significant draw for tourism in the region.",
  "argos_id": "QNC81TM77"
}