{
  "url": "https://www.pymnts.com/earnings/2025/adyen-says-embedded-finance-helps-businesses-deal-with-macro-challenges/",
  "authorsByline": "PYMNTS",
  "articleId": "dfd3c08283334afd93bd57c02b8a4f01",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2022/09/Adyen.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:20:55+00:00",
  "addDate": "2025-08-14T19:32:33.443254+00:00",
  "refreshDate": "2025-08-14T19:32:33.443257+00:00",
  "score": 1.0,
  "title": "Adyen Says Embedded Finance Helps Businesses Deal With Macro Challenges",
  "description": "Adyen said Thursday (Aug. 14) that it saw growth in its key metrics in the first half as its embedded finance platform added new customers and increased",
  "content": "Adyen said Thursday (Aug. 14) that it saw growth in its key metrics in the first half as its embedded finance platform added new customers and increased its wallet share with existing ones.\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\nThese gains overcame the challenges the company faced in terms of slower volume from Asia-headquartered companies that sell into the United States, due to new U.S. tariffs, and the strong euro that impacted other customers, Adyen executives said Thursday during an earnings call.\n\nDuring the first half, Adyen saw year-over-year gains of 20% in net revenue, 5% in processed volume and 28% in EBITDA, according to a Thursday earnings release.\n\nIf a single large volume customer is excluded, the company’s processed volume would have been up 23%, the release said.\n\nIngo Jeroen Uytdehaage, co-CEO and member of the management board at Adyen, said during the call that the challenges seen in the first half also present opportunities.\n\n“The first is to make sure that we continue to help them increase their authorization rates at the lowest cost and the lowest fraud rates, very important topic,” Uytdehaage said. “The second topic that we invest a lot of time in together with our customers is making sure they can enter new geographies — the APAC merchants as an example, but that’s of course a broader theme for our customers. And then thirdly, how we can help platforms to become a financial technology player.”\n\nAdyen’s investment in infrastructure and its holding of banking licenses in Europe, the United States and the United Kingdom help the company build products that are relevant to its customers, Uytdehaage said.\n\nLooking ahead, Uytdehaage said Adyen will move quickly to add stablecoins if merchants see a need for them and if that technology proves to help move money quickly.\n\nAdyen is also tracking the rise of autonomous agents in online commerce. The company is preparing to help merchants cater to this business and prevent fraud.\n\n“If you look at our platform — our single platform globally — we have a couple of components in our platform that already are catered for this journey,” Uytdehaage said during the call. “We have authentication, we have tokenization, we have a very good fraud system, and packaging this with the new needs of our merchants for Adyen’s eCommerce will lead to the best product.”",
  "medium": "Article",
  "links": [
    "https://www.adyen.com/press-and-media/adyen-publishes-h1-2025-financial-results",
    "https://nl.linkedin.com/in/ingo-uytdehaage-559a9133"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "new customers",
      "weight": 0.09161221
    },
    {
      "name": "Adyen executives",
      "weight": 0.08056482
    },
    {
      "name": "Adyen",
      "weight": 0.07867908
    },
    {
      "name": "other customers",
      "weight": 0.07682373
    },
    {
      "name": "new U.S. tariffs",
      "weight": 0.06960119
    },
    {
      "name": "new geographies",
      "weight": 0.06796379
    },
    {
      "name": "processed volume",
      "weight": 0.06641798
    },
    {
      "name": "Ingo Jeroen Uytdehaage",
      "weight": 0.06414511
    },
    {
      "name": "merchants",
      "weight": 0.06205339
    },
    {
      "name": "slower volume",
      "weight": 0.061500326
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97802734375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.8759765625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.59326171875
    },
    {
      "name": "/Finance/Banking/Other",
      "score": 0.58251953125
    }
  ],
  "sentiment": {
    "positive": 0.8550431,
    "negative": 0.022675136,
    "neutral": 0.12228173
  },
  "summary": "Adyen has reported a significant growth in its key metrics in the first half, with its embedded finance platform adding new customers and increasing its wallet share with existing ones. This growth overcame challenges such as slower volume from Asia-headquartered companies that sell into the United States, new U.S. tariffs, and a strong euro impacting other customers. The company saw year-over-year gains of 20% in net revenue, 5% in processed volume and 28% in EBITDA. Adyen's co-CEO, Inoj Jeroen Uytdehaage, emphasized the importance of helping platforms increase their authorization rates at the lowest cost and the lowest fraud rates. Looking ahead, he said the company would move quickly to add stablecoins if merchants see a need for them.",
  "shortSummary": "Adyen's embedded finance platform grew significantly in the first half, overcoming challenges such as rising costs, a strong euro, and competition from online retailers.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c3dc838239e346bead765b265251e521",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.adyen.com/press-and-media/adyen-publishes-h1-2025-financial-results",
      "text": "Amsterdam · August 14th, 2025\nAdyen publishes H1 2025 financial results\nAdyen delivered resilient performance driven by continued expansion with existing customers\nAMSTERDAM, August 14, 2025 — Adyen (AMS: ADYEN) today announced financial results for the half year ending June 30, 2025.\n“We entered the year with a clear focus: deepening relationships with existing customers and bringing new enterprise and platform businesses onto our platform,” said Ethan Tandowsky, CFO.\n“In the first half, our disciplined execution drove continued traction across regions and verticals, even as some customers faced a more challenging operating environment. As market dynamics shift, the ability to adapt is becoming as important as the ability to grow.\nThis is where our setup makes a real difference. By staying close to our customers and combining our single platform with deep local expertise, we’re uniquely positioned to support their strategy shifts and strengthen our foundation for long-term growth.”\nH1 2025 key metrics\nNet revenue was €1,093.5 million, up 20% year-on-year (“YoY”) (21% on a constant currency basis).\nProcessed volume was €649.0 billion, up 5% YoY, 23% excluding a single large volume customer.\nEBITDA was €543.7 million, up 28% YoY, with EBITDA margin landing at 50%.\nFree cash flow conversion ratio was 87%, with CapEx at 4% of net revenue.\nIssuing volume exceeded €2.0 billion, with customer count nearly doubling YoY.\nThis press release highlights key information and results from Adyen’s H1 2025 earnings. You can find the full H1 2025 financial results and accompanying Shareholder Letter including our outlook here. Today, at 3 PM CEST, we will host our H1 2025 Earnings call with our Co-CEO, Ingo Uytdehaage, and CFO, Ethan Tandowsky. You can access the livestream here. A recording will be made available shortly thereafter on the same webpage.\nInvestor Day 2025\nOn Tuesday November 11, 2025, Adyen will host an Investor Day in Amsterdam. The event will be livestreamed publicly via the company’s investor relations webpage. For investors and analysts, the event can be attended either in person, or via livestream.\nAbout Adyen\nAdyen (ADYEN:AMS) is the financial technology platform of choice for leading companies. By providing end-to-end payments capabilities, data-driven insights, and financial products in a single global solution, Adyen helps businesses achieve their ambitions faster. With offices around the world, Adyen works with the likes of Meta, Uber, H&M, eBay, and Microsoft.\nImportant Legal Information\nThis press release contains information that qualifies, or may qualify, as inside information within the meaning of Article 7(1) to (4) of Regulation (EU) No 596/2014 (Market Abuse Regulation).\nThe information in this press release and the H1 2025 Shareholder Letter is unaudited. Any person who comes into possession of this document must inform themselves about and comply with any legal restrictions governing possession, distribution, or use of the document.\nFor further details on the non-IFRS measures included in this press release, refer to the note ‘Non-IFRS financial measures’ to the Financial Statements (note 1.2 to the Interim Condensed Consolidated Financial Statements; note 2.2 to the Consolidated Financial Statements).\nForward-looking statements are not facts and only represent the current views and assumptions of Adyen N.V. (“Adyen”) regarding future events, many of which are by nature inherently uncertain and beyond Adyen’s control. Factors that could cause actual results to deviate materially from those anticipated by forward-looking statements include, but are not limited to, macroeconomic, demographic and political conditions and risks, actions taken and policies applied by governments, financial regulators and private organizations (including payment schemes and credit rating agencies), market conditions and turbulence in financial and other markets, and the success of Adyen in managing the related risks. Subject to statutory obligations, Adyen does not intend to publicly update or revise forward-looking statements to reflect events or circumstances after the date the statements were made, and assumes no obligation to do so.\nAdyen does not consent to, authorize, endorse, support, encourage, or participate in, directly or indirectly, unsponsored depository receipt (“DR”) programs regarding Adyen securities. Adyen specifically disclaims any liability whatsoever arising out of or in connection with any unsponsored DR program."
    }
  ],
  "argos_summary": "Adyen reported strong growth in its key metrics for the first half of 2025, with a 20% increase in net revenue, 5% in processed volume, and 28% in EBITDA. Despite challenges such as reduced volume from Asia-based companies and the impact of a strong euro, the company expanded its customer base and deepened relationships with existing clients. Co-CEO Ingo Uytdehaage highlighted opportunities for growth through improved authorization rates and geographic expansion, while also preparing to adapt to emerging trends like stablecoins and autonomous agents in online commerce.",
  "argos_id": "QRX2HD4X0"
}