{
  "url": "https://gizmodo.com/star-trek-strange-new-worlds-recap-season-3-episode-6-kirk-2000642915",
  "authorsByline": "James Whitbrook",
  "articleId": "dbc03740bcf24299b86f399daefcb1b5",
  "source": {
    "domain": "gizmodo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://gizmodo.com/app/uploads/2025/08/star-trek-strange-new-worlds-recap-sehlat-who-ate-its-tail-spock-kirk-1200x675.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T21:15:05+00:00",
  "addDate": "2025-08-14T21:34:31.192584+00:00",
  "refreshDate": "2025-08-14T21:34:31.192585+00:00",
  "score": 1.0,
  "title": "'Star Trek' Is Born on 'Strange New Worlds'",
  "description": "'The Sehlat Who Ate Its Tail' provides the crucible that 'Strange New Worlds' has been building towards since before it even existed: the forging of the team that made 'Star Trek'.",
  "content": "A few weeks ago in Strange New Worlds‘ up-and-down third season, “A Space Adventure Hour” delivered a deeply unsubtle paean to the creation of Star Trek. This week, Strange New Worlds does much the same: but this time the birth of Star Trek is within the text itself, making for a much more interesting lens on the birth of an icon.\n\nFrom the moment that it opens, it becomes clear that “The Sehlat Who Ate Its Tail” (named for a Vulcan idiom that Spock uses later on) is not going to be a typical episode of Strange New Worlds. Not in that “oh, something’s going to be kooky and fun!” way that you might expect after last week’s dire-stakes episode and the season’s general back-and-forth in tone swaps so far, but because we do not open on the Enterprise, or with her crew at all: instead, on the personal log of Commander Kirk, aboard the U.S.S. Farragut.\n\nAt which point the planet the Farragut was monitoring—and Kirk was butting heads with his captain, V’Rel (Zoe Doyle), over beaming down and surveying—explodes. Just like last week, everyone immediately locks in, especially Jim, when V’Rel is incapacitated by the extreme damage caused by the Farragut‘s proximity to an exploding planet. But things go somehow even more badly when, of course, the Enterprise beams to respond to the Farragut‘s distress signal—beaming over an assist team of Nurse Chapel, Scotty, Spock, and Uhura. As everyone races into action and Kirk begins slowly realizing that he’s getting the command experience he’s been waiting for at the worst possible time, the vessel responsible for destroying a planet in a single blast, a massive, tendriled junk ship comes flying along and gobbles the Enterprise up before promptly warping away.\n\nThe Farragut is alone, and barely holding together, let alone capable of pursuit. It’s operating on a skeleton crew, most beamed away to Enterprise before its abduction. And James T. Kirk is staring at a captain’s chair, with Mr. Spock, Mr. Scott, Uhura, and Chapel at his side.\n\nIf “A Space Adventure Hour” was an episode talking about the metanarrative about the birth of Star Trek as a television show, then suddenly, you realize: this is an episode about the birth of Star Trek, the team that we know will go on to appear in the original series. At long last, the crucible that will one day forge one of the franchise’s defining heroes has begun.\n\nSo it’s great then that “The Sehlat Who Ate Its Tail” is really an episode about rocking Kirk’s shit for 45 minutes. The episode splits between the Farragut and the captured Enterprise, disabled in the interior of the junk ship as its systems are drained of power, effectively doing one of Strange New Worlds‘ “disaster on a spaceship” episodes twice over. Kirk has to rally a group of officers who don’t really know, and don’t really trust, him as he tries to figure out what kind of a leader he is in time to rescue Enterprise and stop this junker ship on a collision course with destroying another world called Sullivan’s Planet. Pike, meanwhile, has to deal with shadowy infiltrators sucking his ship dry, a ticking time bomb that will kill both the Enterprise crew and the Farragut‘s wounded.\n\nThe stuff aboard Enterprise is fun and definitely tense, even if it is also definitely the b-plot of the episode. Pike and La’an have the mystery of the junkers to solve, Carol Kane gets to ham it up and get everyone to wire up rotary telephones to overcome the ship’s power loss and communications blockage. There’s intrigue and whimsy, but still, the focus of “The Sehlat Who Ate Its Tail” is clear: this is the making of Kirk’s moment.\n\nIt gives Wesley material that, for the most part up to now, he’s lacked the chance to chew on. Most of Kirk’s appearances on Strange New Worlds have been technicalities: alternate realities, through the lens of episodes like the musical or “Space Adventure Hour” and its holodeck metanarrative (thankfully, Wesley does not go hard on the Shatnerisms as he was encouraged to then). This is Kirk, the man who is going to become Captain Kirk, and he has been thrust into an incredible challenge, with a team that he doesn’t know yet and arguably before he may even have really wanted to be in it.\n\nThankfully, Strange New Worlds realizes that it’s important to not suddenly supercharge this character into the man that we already know. We see elements of the man we will come to love in the original Star Trek, his braggadocio and his desire to always challenge and take risks, but crucially, we also see the deeply human elements of Kirk that people often forget in their memories, especially amplified here in his younger self. This is a Kirk that doubts, and loses his cool, and is allowed to react to the stress of the situation he’s found himself in, and react poorly, and fairly so given the circumstances.\n\nLikewise, this gives the proto-TOS crew that he finds himself leaning on to get the Farragut even remotely close to shipshape a chance to react to this Kirk, and begin to feel out the seeds of what will become their relationships. It’s fun to watch Martin Quinn’s Scotty absolutely hate working with this guy, a thickheaded commander who wants to push systems an engineer knows can’t be pushed, just as it’s fun to watch Kirk’s relationship with Uhura, and the trust they already established together last season, flourish even further as that bond deepens.\n\nIt is, of course, also fun to watch the early days of Spock and Kirk’s understanding of each other begin to coalesce. That becomes crucial here when the stress does get to Kirk when his plan to juice Farragut‘s engines almost literally blows up in his and Scotty’s faces, leaving the ship dead in the water between the junker ship and its next target at Sullivan’s planet, which is home to a pre-warp civilization. Kirk blows up, needing to get off the bridge, and his more senior fellows among the Enterprise crew realize that the young commander is in a very precarious moment.\n\nIt takes Spock confronting and comforting him, removed from an emotional response to the stress everyone is feeling, to get Kirk to rearticulate and find the confidence he needs to deal with the setbacks and pressure the situation has demanded of him. It’s a wonderful moment between the two as they start feeling each other out, how comfortable they can be even in this nascent phase of their relation, what boundaries there still are, and what can be bonded over to create a friendship that we know will span lifetimes. Again, crucially, Strange New Worlds understands here that it cannot just speedrun these characters into their original Trek selves just yet. We can see glimmers of those bonds, but just as it’s vital for this episode to give us a Kirk that is flawed and still learning, and willing to both make and accept his mistakes, it’s just as vital that we come out of this episode feeling that the crew that will one day serve aboard the Enterprise together are still not yet that crew. They’re just closer than they were an episode before.\n\nThis is the most important thing “The Sehlat Who Ate Its Tail” arguably needed to nail, and so when the day is saved by some Kirkian ingenuity (and some assists from Scotty, Uhura, Spock, and Chapel) to free the Enterprise and destroy the junker ship before it can consume Sullivan’s Planet, we can perhaps forgive that the last twist the episode makes doesn’t quite land as effectively as the rest of it does. Amid the destruction of the junker ship, Spock manages to confirm, right as Pike and La’an do, ridding the Enterprise of its last infiltrator, that the mysterious foe they faced was a colony ship of 7,000 human beings, life signs blinking out as the junker ship tears apart.\n\nIt turns out, as the Enterprise discovers during debrief, the vessel was, in its core form, a ship sent from Earth just after the end of World War III, staffed with scientists who believed that Earth may not be able to recover, and humanity’s hope lay in the stars. Whatever happened to them in the generations since to transform their descendants into monstrous, planet-and-ship-devouring scavengers is left unsaid as Kirk’s first victory in the chair is tinged with the discomfort that he is responsible for having to have slaughtered thousands of people to save millions, and both the Farragut‘s interim commander and the Enterprise crew find themselves humbled by the revelation.\n\nWhile it does again build on this episode as not being about the establishment of the legend of Jim Kirk but the flawed and deeply human man that he will come to be (and always was beneath our memory of that legend), what sits as odd in this final twist is the sudden swerve Strange New Worlds has to take to serve it. Would the climax of the episode have labored this consternation if this crew of disenfranchised descendants were early Vulcans, or Romulans, or another Federation species? What if they were some other alien species that we either knew or didn’t know? Or is the point meant to be that our deeply human heroes are now touched and aggrieved at the revelation that they have had to kill other humans, specifically, before they could kill them?\n\nAfter all, up to the moment of this revelation “The Sehlat Who Ate Its Tail”, both through its characters and the narrative itself, framed these mysterious junkers as explicitly monstrous, just as this season did with the Gorn in its premiere. They had destroyed worlds, killed countless crews of ships whose vessels were consumed in its growth, and were on the precipice of indiscriminately extinguishing a population in the millions. The fact that it suddenly wants Kirk and the rest of the characters to wrestle with remorse because the perpetrators of these atrocities were human raises some uncomfortable questions about who and what gets to be treated with sympathy on the show that the episode simply does not have time to answer, saving this moment for its very end.\n\nBut again, for the worse this time, that was never meant to be the focus of this episode. From beginning to end, “The Sehlat Who At Its Tail” is about the genesis of the unit that would go on to become the original Star Trek, forging them together amid a grand trial. There, at least, it delivers one of the season’s best episodes yet, albeit in a slightly compromised form.",
  "medium": "Article",
  "links": [
    "https://gizmodo.com/star-trek-strange-new-worlds-tos-characters-2000629554",
    "https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140",
    "https://gizmodo.com/star-trek-strange-new-worlds-season-5-movie-2000641342",
    "https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806",
    "https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856",
    "https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161",
    "https://gizmodo.com/star-trek-strange-new-worlds-recap-space-adventure-hour-laan-spock-2000635434",
    "https://gizmodo.com/star-trek-strange-new-worlds-season-3-premiere-recap-2000630467",
    "https://gizmodo.com/star-trek-strange-new-worlds-recap-through-the-lens-of-time-2000639878",
    "https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Jim Kirk",
      "weight": 0.07319356
    },
    {
      "name": "Kirk",
      "weight": 0.07315316
    },
    {
      "name": "Commander Kirk",
      "weight": 0.07144057
    },
    {
      "name": "Captain Kirk",
      "weight": 0.07124608
    },
    {
      "name": "Strange New Worlds",
      "weight": 0.06671847
    },
    {
      "name": "James T. Kirk",
      "weight": 0.06655778
    },
    {
      "name": "episodes",
      "weight": 0.06475272
    },
    {
      "name": "ships",
      "weight": 0.061346125
    },
    {
      "name": "Enterprise",
      "weight": 0.058837328
    },
    {
      "name": "Star Trek",
      "weight": 0.057515416
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.89892578125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.85400390625
    }
  ],
  "sentiment": {
    "positive": 0.087918825,
    "negative": 0.55593544,
    "neutral": 0.35614565
  },
  "summary": "The birth of Star Trek is depicted in an episode of the third season of Strange New Worlds, which focuses on the birth of the icon. The episode, \"The Sehlat Who Ate Its Tail,\" does not open on the Enterprise, but instead on the personal log of Commander Kirk aboard the U.S. Farragut. This episode focuses on Kirk's battle with his captain, V'Rel, who is incapacitated due to the damage caused by the Farraggut’s proximity to an exploding planet. The team that we know will later appear in the original series is seen as the crucible that will one day forge one of the franchise's defining heroes.",
  "shortSummary": "\"The Sehlat Who Ate Its Tail, on Strange New Worlds, celebrates the birth of Star Trek through the pages of Commander Kirk’s personal log, while depicting Enterprise's struggles and subsequent destruction.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "986dd5844eba41db9fb29cef52a3253f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://gizmodo.com/star-trek-strange-new-worlds-recap-through-the-lens-of-time-2000639878",
      "text": "Star Trek: Strange New Worlds‘ third season has had a bit of an awkward tone issue. Across four episodes already, we’ve switched episode-to-episode from pretty grim circumstances (a Gorn attack here, a zombie outbreak there) to lighthearted silliness (an encounter with Trelane here, a holodeck murder mystery there). Even as those individual episodes haven’t all entirely worked to varying degrees, this back-and-forth has only really helped to make the show feel a bit aimless. So while this week’s episode is indeed another lurch from light to dark, the way it handles that darkness feels like a much keener reminder for this season: that there can be a real cost to what the crew of the Enterprise does.\nInitially, “Through the Lens of Time” sets itself up almost as if it’s going to juke from the season’s episodic tonal switch—taking a bit of a jump from last week’s sudden flourishing of romance between Spock and La’an, the initial premise seems ripe for an awkward meet cute. The Enterprise has offered its services to Doctor Korby in aid of his latest archaeological discovery: a series of artifacts that have led him to the location of an ancient ruin that he believes holds the key to unlocking immortality. With Nurse Chapel naturally coming along to assist her partner, alongside young medical ensign Gamble (irregular season 3 guest star Chris Myers) eager to go on his very first away mission—hey, does anyone hear an alarm bell ringing in their heads?—the awkwardness comes in the fact that, of course, security chief La’an and senior science officer Spock are going to be advising the landing party, which also includes the potentially-closening Uhura and Beto Ortegas, officially assigned to begin recording a Starfleet propaganda documentary about life aboard the ship.\nInitially, our main quartet is in a perpetual state of “this is fine, this is fine, we’re all fine” as they try to dance around the fact that Christine, La’an, and Spock have all barely spoken to each other since the latter two became casually entangled. Spock makes a very specific point that he’s keeping away from Chapel and Korby’s mission, managing it from aboard Enterprise with La’an while they, alongside Gamble, Uhura, and Beto go down to the digsite, and while it’s clear there’s an awkward tension in the air, it’s again largely played lightly. Everyone involved knows this is awkward and weird, they just kind of don’t want to say it, especially while Korby has a lot riding on his mission (especially so, as he makes a point of talking to Chapel about being willing to ask Starfleet for assistance).\nWhile not as broadly hijinks-based as “Wedding Bell Blues” and “A Space Adventure Hour”, it all feels like, even with the broader seriousness of the mission at hand here—Star Trek does love it an ancient ruin of an old civilization with potentially wildly advanced technology even beyond what the Federation has at hand—we’re in for an episode that is about Spock, Chapel, Korby, and La’an, and the first two in particular, learning to work with each other professionally in spite of what’s going on between them all personally.\nBut “Through the Lens of Time” twists the knife into something almost the moment the landing party gets inside the ancient ruins, when ensign Gamble goes over to a strange group of desiccated corpses in the otherwise untouched ruins (there’s that alarm bell ringing again) while the rest of the group investigates their surroundings, opens up their belongings (it’s getting louder), finds a glowing orb within (seriously, does no one else hear that?) and holds it up… and it explodes, shattering and violently exploding Gamble’s eyes with it.\nIt’s immediate horror. Poor Gamble’s screaming, the white of his medical uniform stained with his own blood. They’re not just burned or blinded or damaged; his eyes are gone, and we get to see the gruesome extent of the holes left in his head. Suddenly, whatever frustrations or friction is going on with the romances involved in the away team are out the window: everyone locks in step to transport Gamble back to sickbay, and La’an and Spock come down to the planet to at least pause, if not put a wrap, on Korby’s mission due to the sudden danger. Everything is put aside: these are Starfleet officers, dealing with a situation that has gone sideways real fast.\nWell… mostly. Things naturally immediately go from bad to worse: the rest of the landing party, now with Spock and La’an along, find themselves locked inside the ancient ruins, a defense system violently eliminating anyone who attempts to leave as they learn when their alien guide is vaporized. Aboard Enterprise, it also quickly becomes clear that this is not going to be a case of replicating Gamble a new pair of eyes and dealing with a traumatic injury: something has sneaked itself inside his body, and whether or not Gamble is even alive anymore to be saved from it is an altogether different question M’Benga, Pike, and the rest of the crew find themselves dealing with (Captain Batel too, who was back aboard Enterprise for her ongoing treatment—more on that later).\nVery quickly, this becomes an episode that isn’t asking, “Oh ho, will it be awkward between all these characters because of them dating each other?” and suddenly becomes one that asks, “Can these characters put that aside to get out of this alive?” The answer to that is yes, of course, because two-thirds of the characters involved all need to go on to appear in the original Star Trek. But that doesn’t stop “Through the Lens of Time” from having some remarkably delectable tension as things keep deteriorating both on and off the planet. In the ruins, the dwindled party is separated further thanks to some timey-wimey planar protections, forcing La’an and Chapel to steady each other, Spock and Korby to set aside the latter’s distrust of Starfleet and their own personal hangups with each other, and then Uhura trying to ensure Beto—adjacent to Starfleet but essentially a civilian member of the media—doesn’t completely freak out.\nOn and off the Enterprise, everyone locks in. The away team puzzle their way back to each other and discover the reason behind the ruins’ existence in the first place, aboard the ship, while dealing with the spirit—an ancient noncorporeal entity from a sinister species called the Vezda—making it clear that it’s puppeting Gamble’s corpse to try and take over the Enterprise and a suddenly feral Batel, who appears to have been given a latent Gorn-rage by her experimental treatment. Doctor M’Benga manages to diffuse the situation with the Vezda (with a little gunplay from Pelia), freeing Gamble’s body and containing the malevolent spirit. It’s all tense, even as the episode ping-pongs between the ruins and the Enterprise, but it’s arguably Star Trek doing the competence porn it does best: a group of people who can, at one moment, be friendly and clunkily navigating the social faux pas of workplace relationship fallout, and the very next, when confronted with an unspeakable danger, put that aside to do their jobs and do them to the best of their ability.\nIt speaks, as Spock says to Chapel as they figure out she is their key to getting out of the ruins by a Last Crusade-ian invisible bridge walk of faith, about trust going two ways between people. All these Starfleet officers know, implicitly, regardless of what is going on in their lives and even between them, that at the end of the day, when their backs are up against the hull of their starship, they can trust each other to face a problem and deal with it. Which in and of itself is a nice message to remind viewers of when it comes to this universe and a much better alternative to having this episode be consumed by drama between Korby, Chapel, Spock, and La’an.\nBut it’s also a secondary point to the real heart of “Through the Lens of Time”: that no matter how locked in our Starfleet heroes are in these crisis moments, there is a cost to what they do every day, and even with the shenanigans being as frequent as they have been on Strange New Worlds lately, they live incredibly dangerous lives. Lives that can, as Gamble learned far too soon, be brutally snuffed out in an instant.\nJust how much the young ensign’s death impacts you is down to personal reaction—he’s only been around for a few episodes, and if there is a major weakness to “Through the Lens of Time”, it’s that it’s clunkily unsubtle about indicating that something extremely bad is going to happen to this character from almost the second it opens on him recording a personal log. Strange New Worlds doesn’t particularly try to mine his death for dramatic pathos or have the characters act like they’ve known him for years and years—part of the shock of his death, beyond the posthumous ghost puppetry of it all, is that he is still such a relatively new member of the crew, and now he’s, very violently, not.\nBut his death is important for a series that has, so far this season, leaned perhaps a little too far into a tonal flippancy where, even in rough situations, the Enterprise has gotten out of things largely unscathed. Gamble’s death is a necessary punctuation point to Star Trek‘s love of stunning people performing their jobs extremely well: sometimes even doing that will not be enough when faced with the dangers of boldly going and pushing the frontiers of your understanding. Sometimes you might uncover wonders unlike anything seen in millennia; other times you might get your shit rocked by an explicitly evil spirit. That they carry on regardless of that potential is what makes Star Trek the series it is.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/star-trek-strange-new-worlds-recap-space-adventure-hour-laan-spock-2000635434",
      "text": "Strange New Worlds loves being Star Trek. That’s different from, say, Lower Decks, a series that loved being about Star Trek and the metatextual acknowledgement of that to the nerdiest of degrees. Strange New Worlds knows that it is Star Trek and enjoys that: its connection to the original, the warts-and-all embrace of episodic storytelling, its desire to poke and prod at itself endlessly, and its willingness to vacillate its tone from high drama to high camp on a dime. Sometimes, that can make for incredibly good fun. But sometimes, when it’s just a little too much, the show can lose itself, not seeing the forest for the trees.\nUnfortunately, this week’s episode leans a bit too much into the latter.\n“A Space Adventure Hour” is a Star Trek holodeck episode. Well, really, it’s an extended excuse to do a Dixon Hill-esque riff and do a holodeck episode despite the fact that shipboard holodeck technology wasn’t common in Star Trek until the time of The Next Generation, a century beyond when Strange New Worlds is set. “A Space Adventure Hour” acquiesces to that—it frames La’an as its primary perspective and the person in charge of testing an experimental holodeck system aboard Enterprise because of her history with holographic battle simulators, seen in Discovery, and even Pike nods to the eventual existence of the Rec Room seen in Star Trek: The Animated Series. It ultimately concludes that the technology isn’t there to be used aboard starships yet, setting the stage for its eventual refinement and arrival by the time of TNG.\nBut that’s all excuses. “A Space Adventure Hour” exists because the Strange New World team thought, “We’re a Star Trek show, and you know what Star Trek does? Holodeck episodes.” And it is, for the most part, a perfectly fine one of those. “A Space Adventure Hour” fits into the milieu of that Trek trope well enough and doesn’t really add much along the way: La’an is tasked with testing the system’s power draw while the Enterprise is at full operational capacity examining a dying neutron star; she does so by getting it to replicate a 1960s murder mystery whodunit inspired by a series of novels she read as a child, populating her cast of holographic characters with the likenesses of the main crew. It’s a holodeck episode, so things go wrong, safety protocols go offline, and suddenly La’an finds out that to get out of the holodeck alive, she must solve a mystery designed specifically to challenge her.\nThat’s all stuff that we’ve seen from holodeck episodes before, from Dixon Hill stories like “The Big Goodbye” to things like Voyager‘s “The Killing Game” or, perhaps most inspirationally, Deep Space Nine‘s “Our Man Bashir.” And “A Space Adventure Hour” does a mostly decent job at hitting those beats, letting the regular cast loosen up and play very different characters from their usual selves, but it doesn’t really build on the holodeck stories that come before it so much as it does just point at the expected beats of those stories, going through the motions. At least, until the climax of the murder mystery fizzles out with a “twist” reveal—more on that later.\nSo it’s perhaps better than worse, then, that “A Space Adventure Hour” isn’t really about being a holodeck murder mystery. At least, it’s not interested in being a particularly good one: what “A Space Adventure Hour” is actually about is telling you that the original Star Trek, the show this show is a prequel to, is the greatest television show of all time, one that changed the whole world, and one that should’ve lasted forever and ever, and any plan to cancel it, or anything like it, is an act of profound hubris and misjudgment. Very funny for that message to come now, in Strange New World‘s third season, weeks after Paramount announced that it would conclude with a truncated fifth. But anyway!\nStrange New Worlds is not a particularly subtle TV show, but it’s not telling you all this by literally just having characters in Star Trek turn to the camera and go, “Star Trek is great!” Instead, it is a step removed: the titular “Space Adventure Hour” and the key connecting conceit of La’an’s murder mystery setting is a fictional 1960s sci-fi TV show called The Last Frontier, which has just been cancelled after its first season by a studio executive whose murder sets off the whole whodunnit. Anson Mount plays T.K. Bellows, the shy writer and Last Frontier creator who believes sci-fi shows are a social good and the future of the industry but longs for more, in the vein of a Gene Roddenberry. Rebecca Romijn plays Sunny Lupino, a former model and starlet turned Hollywood producer who backs The Last Frontier because she believes in its potential, our stand-in for Lucille Ball. Paul Wesley is Last Frontier‘s leading man, Maxwell Saint, a pompous actor playing the ship’s machismo-fueled captain, pulling off the most tortured William Shatner impersonation yet committed to screen. Seriously, the pauses are interminable.\nAll the motivations for potential suspects in the executive’s murder hinge on the fact that practically everyone involved in The Last Frontier believes in the show as a force for good, even beyond being great television. As more bodies begin to drop and finger-pointing pokes and prods at individual paranoias, as far as pretty much anyone in the holoprogram’s cast is concerned, Last Frontier (and through its thin veneer, the original Trek) is unimpeachable. The climax of the murder mystery narrative is even paused so Celica Rose Gooding, playing talent agent Joni Gloss, can give that “turn to camera and say how good this show is” speech to La’an, evangelizing over a dead body right in front of her that The Last Frontier can, and should be given the opportunity to, change television and the lives of the American people for good. Again: not a subtle show, but the remove from what it’s actually saying to what it wants to say to its audience might as well be glass, to the point you’re almost a little insulted that Strange New Worlds didn’t commit fully and have a holoprogram about a fictional murder on the set of actual Star Trek.\nWhich is odd because we do actually get to see Last Frontier for what it is—the episode is bookended by an extended scene from the faux-show as a cold open, and its credits close out over a “blooper reel” behind the scenes. And despite what the rest of the episode goes on to do to evangelize its worth, as a parody of the original Star Trek, it’s oddly mean. The sets are significantly cheaper-looking than much of what classic Trek ever did, and the script feels like an extended “Spock’s Brain” gag but somehow even more convoluted. The acting (Wesley’s Saint is joined by Jess Bush/Chapel and Melissa Navia/Ortegas as actresses Adelaide Shaw and Lee Woods, respectively) is intentionally clunky and ham-fisted, right down to Wesley’s exaggerated Shatnerisms. The show all these characters go on to laud as a huge hit and a cultural game changer isn’t even close to the original Star Trek‘s quality; it just kind of sucks. Strange New Worlds has done a much better job of loving homages to the look and direction of Star Trek before—the “Balance of Terror” homages in season one’s “A Quality of Mercy” remain one of the show’s finest hours—so The Last Frontier ends up feeling less like the show being in on a joke and more like the show just laughing at what came before it. It’s an especially odd contrast with what the rest of the episode wants to say.\nBut once it’s got that unsubtle message out regardless, “A Space Adventure Hour” remembers that it’s technically a holodeck episode and needs to wrap fast, which is where the aforementioned “twist” comes in. La’an’s murder mystery ultimately doesn’t really matter, because the mystery plot was an entire misdirect: none of the holoprograms in its setting committed the crime, but instead a holographic rendering of Spock, who was inserted into the program to act as if the real Spock had come to help La’an out with her test. A murderer she never would’ve expected, she gasps as she figures it out, less because of her personal relationship to Spock but more because the possibility of him being the suspect is thrown from so far out of left field that it doesn’t feel set up by the episode itself and more of a gotcha once “A Space Adventure Hour” remembered that it needed to stop telling you that Star Trek is good and finish its original plot.\nIt’s made even more thorny by the fact that this revelation climaxes back aboard Enterprise in reality with La’an going to Spock’s quarters to resume dance lessons with him (a thing we’re reminded of this episode that he’s kept up with her since “Wedding Bell Blues”) and recount her experiences testing the holodeck out and his role in the twist… culminating in the two revealing their romantic interest in each other, sealing it with a kiss.\nIt feels like an odd choice, wherever Strange New Worlds takes this over the course of the rest of the season. Spock’s barely moved on from his romance with Nurse Chapel, narratively speaking—a plot that was given a ton of build-up and then all fell apart relatively quickly once they got together. La’an herself was already given a will-they-won’t-they romantic arc with a legacy Trek character last season with Kirk, even if it ended unrequited. Especially given how “Wedding Bell Blues” already used its three-month timeskip to justify La’an immediately compartmentalizing her traumatic history with the Gorn, it feels bizarre to just thrust her into a second romantic arc so quickly, like these are the only two options available to her as a character.\nIt’s a peculiar end to a peculiar episode, one that never quite manages to extend its charms long enough to effectively communicate what it wants. Strange New Worlds has gotten by on its charms an awful lot over its past seasons, but perhaps it’s becoming increasingly visible that those charms have a limit.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/star-trek-strange-new-worlds-tos-characters-2000629554",
      "text": "Star Trek: Strange New Worlds is uniquely situated on the Trek timeline, showing us adventures that unfurled not long before the original series. That means that there’s no avoiding having some familiar character names popping up, and with that, the built-in fun of seeing, say, an iconic figure like Spock be played in a younger iteration, with Ethan Peck stepping in for Leonard Nimoy.\nThis fun change in perspective is something fans already experienced in J.J. Abrams’ alt-world Star Trek movies (featuring, for instance, Spock played by Zachary Quinto). And it’s also happened in other Trek series—remember when TOS rapscallion Harry Mudd popped up on Star Trek: Discovery? But no other Paramount+ release has leaned into the refreshed nostalgia harder than Strange New Worlds, to the point that fans who’ve met SNW versions of Spock, Chapel, Uhura, Kirk, and Scotty are starting to wonder when the rest of the gang is going to show up.\nSpeaking to Polygon, co-showrunner Akiva Goldsman explained that even though the show now has an endpoint in sight, he’s upbeat about the trajectory it was given. “[The studio] gave us the opportunity to get up to TOS. We’ve got to reach TOS to fulfill the promise to the fans, which was ‘What happens to all these people? How do they start to become those characters we know, and what happens to the ones we don’t see in canon?’”\nWith some key TOS legacy characters yet to appear—McCoy and Sulu especially—Goldsman teases hope but offers no guarantees.\n“You will not see [all] of the original series crew before this show wraps,” he said, but did confirm to Polygon that other familiar faces will indeed turn up before SNW bids farewell. He didn’t specify which ones, of course, so we’ll have to wait and see.\nStar Trek: Strange New Worlds returns for its third season July 17 on Paramount+, with a fourth and (shortened) fifth (and final) season also on the way.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161",
      "text": "The DC Extended Universe is finally giving Marvel a run for its money—something that’s bound to increase now that James Gunn is running the show. The DCEU’s myriad projects stretch far beyond superhero mainstays Batman, Superman, and the Justice League, promising to include new and interesting takes on DC Comics’ enormous stable of characters.\nWhat follows is an up-to-date list of everything DCEU-related that’s on the way: DC movies heading to theaters, as well as DC streaming movies and shows coming to Max.\nLast updated 8/23/2023.\nWhat’s the next DC Movie?\nAquaman and the Lost Kingdom\nRelease date: December 20 (in theaters)\nDirector James Wan returns for the next adventure following Arthur Curry (Jason Momoa) as the newly crowned King of Atlantis. Now in his new role, Arthur will explore more of the world under the sea while also dealing with new threats from Black Manta (Yahya Abdul-Mateen II) and others. Like Shazam 2, Aquaman 2 has endured its share of release-date changes, with its new Christmas 2023 date designed to give Wan and company ample time to complete all the necessary special effects.\nUpcoming DC Movie Release Dates\nJoker: Folie à Deux\nRelease date: October 4, 2024 (in theaters)\nTodd Phillips never saw his Joker movie as anything but a singular film. But over a billion dollars at the box office and an Oscar for Best Actor (for star Joaquin Phoenix) obviously changed things. We have a few nuggets of info so far: the title is Joker: Folie à Deux(French for “shared madness”), Phoenix is returning and will co-star with Lady Gaga (who’s playing Harley Quinn), Zazie Beetz is probably returning as Arthur Fleck’s neighbor, and… it’s likely going to be a musical? Filming wrapped in early April 2023.\nThe Batman 2\nRelease date: 2025 (in theaters)\nHot off the success of Matt Reeves’ long-awaitedThe Batman, everyone involved made it clear that wasn’t a one-and-done. Robert Pattinson’s Batman will be back. Will he face off with the Joker? It’s possible but not definitive. You’d imagine the Penguin and Catwoman could be back too. We don’t know much yet about this one, but we do know it won’t be arriving until 2025.\nCurrent DC Shows\nDoom Patrol Season 4, Part 2\nRelease date: TBD 2023 (on Max)\nThe fourth and final season of Doom Patrol—starring Brendan Fraser, Matt Bomer, Diane Guerrero, April Bowlby, Joivan Wade, Timothy Dalton, Skye Roberts, and Michelle Gomez—already aired its first batch of episodes; the remaining six will return later this year.\nUpcoming DC Movies and Shows Without Release Dates\nThe Penguin\nRelease date: Unknown (on Max)\nYou saw him in The Batman and now, Colin Farrell’s Penguin is getting his own Max series. As of April 2023, the show is in production, with a cast that also includes Cristin Milioti, Rhenzy Feliz, Michael Kelly, Shohreh Aghdashloo, and Deirdre O’Connell, with Clancy Brown and Michael Zegen recurring.\nPeacemaker Season 2\nRelease date: Unknown (on Max)\nFrom the instant that opening credits scene rolled for the first time, DC fans and non-fans alike fell in love with Peacemaker. Well, he’s coming back, still played by John Cena and still from the twisted mind of James Gunn. There’s no word on when it’ll happen but we’re guessing 2024.\nSuperman: Legacy\nRelease date: July 11, 2025\nJames Gunn will write and direct this Superman movie, which is touted as not being an origin story. Casting announcements started with Clark Kent/Superman and Lois Lane, who’ll be played by David Corenswet and Rachel Brosnahan. We also know Isabela Merced will play Hawkgirl, Edi Gathegi is Mister Terrific, and Nathan Fillion is a Green Lantern (Guy Gardner), as well as Anthony Carrigan as Metamorpho.\nMore Upcoming DC Movies and Shows Announced for the Gunn/Safran Era\nThe shake-up at DC Studios got a huge zap of energy at the end of January, when James Gunn and Peter Safran announced their massive slate of planned projects. Little is known about most of these projects so far in terms of cast and crew and even release dates—but we do have a few tidbits for each.\nCreature Commandos (An animated Max show) – A seven-episode animated series written by James Gunn himself. It stars Indira Varma (Obi-Wan Kenobi, Game of Thrones) as the Bride, who’s the lead character, and Marvel veteran Frank Grillo as Rick Flagg Sr.—father of Rick Flagg, played by Joel Kinnaman in The Suicide Squad. The rest of the cast includes David Harbour (Stranger Things) as Eric Frankenstein, Sean Gunn (Guardians of the Galaxy Vol. 3) as G.I. Robot, Zoe Chao (The Afterparty) as Nina Mazursky, Alan Tudyk (Star Wars: Rogue One) as Dr. Phosphorus, Maria Bakalova (Guardians of the Galaxy Vol. 3) as new character Princess Ilana Rostovic, and Peacemaker’s Steve Agee and Sean Gunn returning as John Economos and Weasel, respectively.\nWaller (A live-action Max show) – Viola Davis will reprise her Suicide Squad character; the story will bring back characters from the Peacemaker show and tell a story with events set between Peacemaker seasons one and two.\nLanterns (A live-action Max show) – Set on Earth, this mystery series will follow Hal Jordan and John Stewart doing their thing as DC’s “super cops.”\nThe Authority (Theatrical film) – The Wildstorm superhero characters will make their big-screen debut in a film co-written by Gunn.\nParadise Lost (A live-action Max show) – How did Wonder Woman’s world, Themyscira, come to be? Find out in this Game of Thrones-ish tale set before her birth.\nThe Brave and the Bold (Theatrical film) – Based on the acclaimed Grant Morrison comic run, this will explore the story of Batman’s son, Damien Wayne, and will feature “other members of the extended Bat-family.”\nBooster Gold (A live-action Max show) – The “loser from the future” superhero character gets his own series.\nSupergirl: Woman of Tomorrow (Theatrical film) – Based on Tom King’s comics run, this movie will explore how Supergirl is different from Superman. It’s not yet certain if Sasha Calle, who plays Supergirl in The Flash, will reprise the role here.\nSwamp Thing (Theatrical film) – The character’s “dark origins” will be the focus of this one. DC does horror! Rumored but not yet confirmed to be directing, James Mangold (Indiana Jones 5) told Collider that he’s slated to write the script.\nUpcoming DC Movies and Shows That Were Once in Development, But Whose Fate Is Unclear in the Gunn/Safran Era\nTa-Nehisi Coates and J.J. Abrams’ Superman movie\nRelease date: Unknown (in theaters)\nThe news of Superman: Legacy cast uncertainty on this project from writer Ta-Nehisi Coates and producer J.J. Abrams. There hadn’t been an update on this one in a while, but in late April, James Gunn himself told io9 that the two films don’t necessarily cancel each other out: “That’s an exciting movie … if it comes in and it’s great … and if the timing is right, that could absolutely happen. That’s totally unrelated. It would be an Elseworlds tale like Joker.”\nMichael B. Jordan Superman Series\nRelease date: Unknown (for Max)\nMichael B. Jordan was once developing a Superman take for Max as a limited series that would feature Val-Zod as opposed to Clark Kent. Again, there hasn’t been an update in a while.\nStatic Shock\nRelease date: Unknown\nPart of the relaunch of the Milestone comic brand is this adaptation produced by, once again, Michael B. Jordan. A writer was hired back in 2021 to come up with a script and we haven’t heard much since.\nJustice League Dark\nRelease date: Unknown (for Max)\nJ.J. Abrams was among the people involved with bringing this evil super-team to life and while there hasn’t been a ton of movement on the project of late, it’s been around long enough that we’d imagine it happens eventually.\nMetal Men\nRelease date: Unknown\nOne of the more recent pre-Gunn/Safran DC films to go into development, this is this tale of six beings based on various powerful metals. It’s from directors Ron Clements and John Musker (Aladdin, The Little Mermaid, and Moana), so if it happens, it’ll have an incredible pedigree.\nZatanna\nRelease date: Unknown\nLast year, Emerald Fennell won an Oscar for writing Promising Young Woman. She followed that up landing the job to write this DC superhero flick about the young magician. Like most of the films in this section, there hasn’t been movement in a while.\nHourman\nRelease date: Unknown\nYes, the hero who takes a drug that makes him a hero for an hour was, back in 2021, rumored to be in development. Whether or not that’s still the case is unknown but we figured it was worth noting.\nUntitled Arkham Show\nRelease date: Unknown (on Max)\nIn addition to The Penguin, Matt Reeves has said he plans to expand the world of The Batman into Max shows. At one point, a series about Gotham PD was in the works, but now he says it might be more about the inner workings at Arkham Asylum. On October 25, The Staircase’s Antonio Campos came aboard as a writer—the third to hold that position on the potential series so far—and may direct and serve as showrunner if the show happens, according to a report in Variety.\nWant more io9 news? Check out when to expect the latest Marvel and Star Wars releases, what’s next for the DC Universe on film and TV, and everything you need to know about House of the Dragon and Lord of the Rings: The Rings of Power."
    },
    {
      "url": "https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856",
      "text": "There’s now over 30 feature films in addition to eight Disney+ shows in 15 years in the Marvel Cinematic Universe. 2023 got off to a promising start here’s what’s coming next from the MCU. In short: a lot, we began Phase Five with Ant-Man and the Wasp: Quantumania followed by Guardians of the Galaxy: Volume 3, Secret Invasion and by the fall we’ve got The Marvels on the horizon along with season 2 of Loki.\nHere’s the latest news for Marvel theatrical release dates and Marvel TV release dates on Disney+—which the studio can often tweak or reschedule—so we get it, keeping track of when your favorite superheroes are returning or making their debuts can be challenging. Don’t worry, to help you stay on top of things, we’re compiling all the current MCU release dates; when specific titles have been announced but still not officially scheduled, we’ll put them in order when we think they’re most likely to show up.\n(Last updated 6/16/23)\nWhat’s the next Marvel movie?\nThe Marvels\nRelease date: November 10 (In theaters)\nThe sequel to Captain Marvel will pull together three of the MCU’s most powerful women: Brie Larsen’s titular Captain, Ms. Marvel’s Iman Vellani as Kamala Khan, and Teyonah Parris as Monica Rambeau. Nia DaCosta (who most recently helmed the revival of Candyman) is directing the film.\nIn the finale of Ms. Marvel season one, Carol Danvers showed up in Kamala Khan’s bedroom, marking the first real tease of the film. The film release date change came with a poster. Most recently the teaser trailer dropped and here’s our breakdown of everything we saw.\nUpcoming Marvel Cinematic Universe Release Dates\nSecret Invasion\nRelease date: June 21 (On Disney+)\nThis series picks up storylines from both Captain Marvel and Spider-Man: Far From Home to explain the decades-long Skrull invasion of Earth. Samuel L. Jackson and Ben Mendelsohn will star withEmilia Clarke taking on the role of Talos’ grown daughter who has joined a rebellious splinter cell of Skrulls. Martin Freeman has also confirmed he will be appearing in Secret Invasion.\nThe Disney+ blurb of the series describes the series as a “crossover event series showcasing a faction of shape-shifting Skrulls who have been infiltrating Earth for years.” A trailer was released at D23.\nLoki Season 2\nRelease date: Fall 2023 (On Disney+)\nThe smash hit series about Tom Hiddleston’s antihero will return soon for more variant shenanigans across the multiverse. Hiddleston confirmed “the whole cast” of Loki’s first season will return for season two on an episode of Jimmy Kimmel Live. In December, we got a very, very brief tease of season two.\nEcho\nRelease date: November 29, 2023 (On Disney+)\nThis spinoff from the Hawkeye series will follow Echo, a deaf martial artist, as played by actress Alaqua Cox. Devery Jacobs (Reservation Dogs) co-stars. Echo officially began filming on May 24, according to a tweet by series creator Marion Dayre. According to James Clement on an episode of the Weekly Planet podcast, both Vincent D’Onofrio and Charlie Cox are set to return for the Echo series at Disney+.\nThe series was recently announced along with Ironheart, Agatha Coven of Chaos and What If season 2 as potentially moving to 2024.\nX-Men ‘97\nRelease date: Fall 2023 (On Disney+)\nThe X-Men are coming to the MCU… kinda. X-Men ‘97 is a revival of the classic ‘90s animated show, bringing back the same style, stories and yes, theme song, of the iconic series. (See more: X-Men ‘97 Looks Like a Nostalgic Blast From the Past)\nIronheart\nRelease date: 2024 (On Disney+)\nWith Tony Stark gone, the MCU needs a new super-genius inventor. Enter teenage prodigy Riri Williams (played by Dominique Thorne), who creates a brand new, ultra-advanced armored suit. Other cast members include Anthony Ramos (In the Heights) as the villain the Hood and Lyric Ross (This Is Us). Chinaka Hodge (TNT’s Snowpiercer) is attached as the head writer, and Black Panther director Ryan Coogler is an executive producer alongside Marvel’s Kevin Feige and others. Manny Montana (Good Girls) has joined the cast of Marvel’s Ironheart in an undisclosed role as well as Han Solo himself, Alden Ehrenreich.\nAgatha: Coven of Chaos\nRelease date: Winter 2024 (On Disney+)\nThis spinoff from WandaVision will star Kathryn Hahn as her fan-favorite character Agatha Harkness. Joe Locke (Heartstopper) and Aubrey Plaza (Hahn’s Parks and Recreation co-star, among her other many credits) are also in the cast, as is Patti LuPone. (A second WandaVision spin-off, this one focusing on Paul Bettany’s Vision, is also reportedly in the works.)\nCaptain America: Brave New World\nRelease date: August 26, 2024 (in Theaters)\nWe’ve got a new Captain America, so it was inevitable that we’d be getting a new Cap movie. Anthony Mackie will appear in the title role. Harrison Ford was announced to take over the role of General Thaddeus Ross and will make his debut in this release.\nDaredevil: Born Again\nRelease date: Spring 2024 (On Disney+)\nCharlie Cox and Vincent D’Onofrio will return as Daredevil and Kingpin for an 18-episode Disney+ series. Jon Bernthal has signed on to reprise his role as the Punisher. Things remain uncertain for Foggy and Karen.\nThunderbolts\nRelease date: December 20, 2024 (In theaters)\nMarvel Studios is readying a movie based on the comic Thunderbolts and director Jake Schreier has been tapped to bring it to life. This film marks the end of Phase Five of the Marvel Cinematic Universe. Steven Yeun (Nope) signed on for an undisclosed role\nBlade\nRelease date: February 14, 2025 (In theaters)\nDisney hasn’t revealed much about this reboot of the franchise that features a badass vampire-hunter who is also a vampire, but we know that it stars two-time Academy Award winner Mahershala Ali, who also played Cornell “Cottonmouth” Stokes in Netflix Marvel series Luke Cage. We also know Blade appeared (or at least his voice did) in the end credits of The Eternals. After losing director Bassam Tariq, who would have been the first U.S.-Pakistani person to helm a Marvel Studios film, Blade was put on pause, and its release date was shifted. But now it has a new director in place: Lovecraft Country’s Yann Demange, as well as a writer in Michael Starrbury, so the September 2024 date looks ever more likely.\nDeadpool 3\nRelease date: May 3, 2024 (In Theaters)\nRyan Reynolds’ “merc with the mouth” is set to appear in Disney’s first R-rated film following the company’s completed acquisition of Fox assets. Oh, and did you happen to hear that Hugh Jackman’s Wolverine is also appearing in this one? Unless you are cut off from all social media, you no doubt caught that announcement.\nDeadpool 3 writers Rhett Reese and Paul Wenick spoke with Den of Geek about how Deadpool’s move to the MCU will not affect the feel of the movie. Or, in Wernick’s words: “Deadpool’s gonna be Deadpool.” Reese also said that Disney has been more than willing to ensuring the franchise keeps its core identity. Shawn Levy (Free Guy) is directing.\nFantastic Four\nRelease date: May 2, 2025 (In theaters)\nPhase Six of the Marvel Cinematic Universe, kicks off with the MCU debut of Marvel’s most famous family. Jon Watts was scheduled to directbut he is no longer doing that—Matt Shakaman of WandaVision is now in the chair—and though we saw John Krasinski as Mr. Fantastic in Doctor Strange in the Multiverse of Madness, there’s no guarantee he returns.\nAvengers: The Kang Dynasty\nRelease date: May 1, 2026 (In theaters)\nSince neither Phase Four or Phase Five ended with Avengers movies, Phase Six will end with two, back to back. The first is The Kang Dynasty, a title which heavily suggests that Kang (Jonathan Majors) will play a major role. Destin Daniel Cretton (Shang-Chi) will direct.\nAvengers: Secret Wars\nRelease date: May 7, 2027 (In theaters)\nIt all comes down to this. Phase Six, and the whole Phase 4-6 arc of the Multiverse Saga, ends with Secret Wars. We don’t know anything about the plot other than the comics that the title is based on; Marvel veteran Michael Waldron (Loki, Doctor Strange in the Multiverse of Madness) is writing the script.\nArmor Wars\nRelease date: Unknown (In theaters)\nThis project—originally slated for a Disney+ series, but now getting the feature film treatment—will follow James Rhodes (Don Cheadle) as he tracks down stolen tech that allows criminals to replicate Iron Man technology.\nAlso: Marvel slotted several other projects for Phase Six that take place alongside Fantastic Four and the Avengers films. There are two in fall 2024, two in winter 2024, one in winter 2025, two in spring 2025 and two in summer 2025. Some of those are probably…\nUnscheduled But Probably Still Happening Shows & Movies\nMoon Knight Season 2\nRelease date: Unknown (On Disney+)\nMoon Knight himself, Oscar Isaac, was recently spotted in Egypt and teased that a second season of his show could be on the way. Marvel and Disney have yet to confirm.\nMarvel Zombies\nRelease date: Unknown (On Disney+)\nThis new animated show is loosely spun out from a breakout episode of What If? that saw MCU heroes battling a zombie apocalypse.\nSpider-Man: Freshman Year\nRelease date: Unknown (On Disney+)\nDisney says this new animated series follows Peter Parker “on his way to becoming Spider-Man in the MCU, with a journey unlike we’ve ever seen and a style that celebrates the character’s early comic book roots.”\nWhat if…? Season 2\nRelease date: Unknown (On Disney+)\nThe speculative animated series and its omnipresent narrator the Watcher will return with an all-new season. The show’s creators say next season will focus on new stories, new heroes, and “lots of fun.” Though the trailer still hasn’t been released, the Marvel Animation Panel at San Diego Comic Con revealed some Phase 4 characters that will be in the show.\nUntitled Wakanda Series\nRelease date: Unknown (On Disney+)\nNot much is known yet about this show set in Black Panther’s home country.\nUntitled Shang-Chi sequel\nRelease date: Unknown (In theaters)\nShang-Chi’s debut movie was compelling, exciting and fun. It also made a ton of money, so a sequel is inevitable. That the film’s director is making Avengers: The Kang Dynasty does throw it into limbo a bit.\nUntitled Wonder Man series\nRelease date: Unknown (On Disney+)\nMarvel Studios has announced that it’s moving ahead with a Wonder Man series. Shang-Chi and the Legend of the Ten Rings director Destin Daniel Cretton is attached to helm and Brooklyn 99 writer Andrew Guest (who also produced Hawkeye) is on board to showrun the series. On October 31, the title star was announced: genre favorite Yayha Abdul-Mateen II.\nUntitled mutants movie\nRelease date: Unknown (In theaters)\nNow that Disney owns the old Fox assets that included all the “mutant” Marvel superheroes, you can very likely count on characters like the X-Men making an MCU debut.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140",
      "text": "At a Glance:\nDoctor Who ended the eras of both Chris Chibnall as series showrunner and Jodie Whittaker as the 13th Doctor in 2022 with “The Power of the Doctor,” bringing to a close a three-season, three-special run.\nWhittaker’s replacement is returning star David Tennant. He will play the official 14th incarnation of the Doctor under returning showrunner Russell T. Davies, who revived Doctor Who in 2005 and managed the series until 2009.\nTennant will appear in three specials in November 2023 to coincide with the 60th anniversary of Doctor Who on November 23.\nHe’ll be joined by returning characters Donna Noble and Wilfred Mott, who were played by Catherine Tate and Bernard Cribbins in season four of Doctor Who. Neil Patrick Harris will play a new villain, while Heartstopper’s Yasmin Finney will play a character named Rose.\nTennant will be succeeded by Sex Education’s Ncuti Gatwa as the 15th Doctor. His announcement in May 2022 makes him the first Black male actor to play the character on-screen.\nGatwa will star in Doctor Who’s 14th season, set to air some time in 2024.\nMillie Gibson will co-star as the 15th Doctor’s companion.\nGame of Thrones star Indira Varma will play a mysterious character known as “the Duchess.”\nDoctor Who’s beloved tradition of doing a Christmas Special—no more New Year’s Day Specials, in other words—will return in 2023, with another confirmed for 2024.\nComedian Sooz Kempner will star in Doom’s Day, a new transmedia Doctor Who campaign tied into the anniversary. She’ll play Doom, the titular intergalactic assassin, who has found herself hunted by Death itself—and must use a purloined vortex manipulator with a day’s worth of time-jumping charge to find the Doctor and save herself.\nThis post was last updated 5/30/23.\nWhat’s Been Going on in Doctor Who?\nThree Doctor Who specials aired out the last days of Jodie Whittaker’s time as the Doctor in 2022. “Eve of the Daleks” saw the Doctor and her companions Dan (introduced in the prior 13th season, known as Doctor Who: Flux) and Yaz facing the titular iconic monsters in a time loop paradox. “Legend of the Sea Devils” revived the classic ‘70s monsters for a new adventure, while “Power of the Doctor” saw the 13th Doctor face off against the Master in an adventure that ultimately saw her mortally wounded, returning her companions to contemporary Earth while she regenerated into a new body.\nWhy Is David Tennant the Doctor Again? Is David Tennant Playing the 10th Doctor?\nWhittaker regenerated not into previously announced new Doctor Ncuti Gatwa, but David Tennant, who played the official 10th incarnation of the Time Lord from Christmas 2005 to New Year’s Day 2010, before reprising the role for Doctor Who’s 50th anniversary special, “The Day of the Doctor,” in 2013.\nWhile this marks his first return on-screen in the series since then, Tennant will not be playing the 10th Doctor, but the official 14th incarnation—and the character will be aware that they are both using a familiar form and are a new entity. Aside from the fact that Tennant is arguably the most popular actor to take on the role, so bringing him back for the 60th anniversary makes sense, there’s plenty of reasons Doctor Who can come up with as to why the Doctor’s regenerative process decided to re-use an old identity, more of which you can read about here.\nWhen Will Doctor Who Return in 2023?\nDoctor Who will return for three special episodes in November 2023, set to air in celebration of the series’ 60th anniversary.\nWhat Is Doctor Who’s 60th Anniversary Special About?\nAside from Tennant returning as the Doctor, he’ll be joined by former companions Donna Noble and Wilfred Mott, played by Catherine Tate and Bernard Cribbins (the actor’s last role prior to his passing in July 2022) in Doctor Who’s fourth season. Donna exited the series as a regular character after an adventure lead to her needing to have her memory wiped by the 10th Doctor, forgetting her time alongside him lest her mind face grievous harm, so just how Donna will play into the the story remains to be seen.\nThe Doctor and Donna will face a mysterious new adversary, played by Neil Patrick Harris, and will be joined in the specials by Yasmin Finney as a new character named Rose. How Finney’s Rose might connect to the other famous Rose of Doctor Who, Billie Piper’s Rose Tyler, also remains to be seen.\nIs There a Trailer for Doctor Who’s 60th Anniversary?\nThe first premiered at the end of “The Power of the Doctor,” and you can watch it above. The second premiered in December and you can watch it here:\nWhen Will Ncuti Gatwa Become the Doctor?\nGatwa is briefly seen in the trailer for Doctor Who’s 60th anniversary, so will presumably follow the long tradition of new Doctors appearing in the final moments of their predecessor’s last episodes to become the 15th Doctor. The BBC has announced that Gatwa will appear as the Doctor first “over the festive season” in 2023, before he takes over full-time in a new season of the show after that.\nIs There a Doctor Who Season 14 Release Date?\nThere’s no current release date for season 14 of Doctor Who, but it is expected to be broadcast some time in 2024.\nWhere Is Doctor Who Streaming in the U.S. and UK?\nCurrently, the first 13 seasons of the revived Doctor Who are streaming on the BBC iPlayer in the UK; in the U.S., the revived series streams exclusively on HBO Max. In both countries, episodes from the classic era of the show are available through Britbox.\nThis will change in 2023, at least in the U.S. The BBC and Disney have announced that as part of a new deal, Doctor Who will stream exclusively worldwide on Disney+, except for in the UK and Ireland, where it will still stream on the BBC iPlayer and BBC One. It’s currently unknown if this will affect Doctor Who’s place on BBC America, where it currently airs in the U.S..\nDoes Disney Co-Own Doctor Who Now?\nA report in the wake of the BBC/Disney announcement from British paper the Telegraph alleged that the deal will also see Disney contribute finances to help create the show, and while the series’ creative team will still hold control of the series primarily, the deal will allow Disney some level of say in the creative decisions for the series—as well as allowing access to talent or “cinematic production moments” previously inaccessible due to the BBC’s budget for the show.\nNone of this has been confirmed by the BBC, however. The announcement strictly focused on Disney’s acquisition of Doctor Who’s streaming rights, and did not mention any co-owning. The new era of the series will be made for the BBC by Bad Wolf Studios, created by former Doctor Who producer Julie Gardner and former BBC Controller of Fiction Jane Tranter—which is now owned by Sony Pictures Television, after the studio took a majority stake in Bad Wolf in December 2021. The series was previously made by BBC Studios directly.\nIn January, Davies did say that Doctor Who is now working with a bigger budget, telling GQ that Disney’s involvement came about as part of “the BBC’s notion to go for a streamer to invest in the show worldwide … We’re not on the budget level with Star Wars and the Marvel shows, [but] it’s better than it was … We’re not allowed to talk about budget… but it’s more than I’ve ever had to work with.”\nWant more io9 news? Check out when to expect the latest Marvel,\nStar Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about James Cameron’s Avatar: The Way of Water."
    },
    {
      "url": "https://gizmodo.com/star-trek-strange-new-worlds-season-3-premiere-recap-2000630467",
      "text": "It’s been almost two years since Star Trek: Strange New Worlds left us on a tense cliffhanger, and now it’s finally back to pay it off. It is perhaps an unfair pressure to put on the show, that circumstances outside of its control have kept this return anticipated for longer than it should have. But even beyond the context of its Hollywood strikes-induced delay, there was going to be pressure on Strange New Worlds to put its best foot forward regardless.\nSo… it’s perhaps not ideal that the series has returned with a bit of a mixed bag. A premiere of two episodes that couldn’t be further in tone from one another—one a grim, intense, high-stakes action conclusion to last season’s cliffhanger, the other a Spock character piece bursting with goofy, silly shenanigans—season three’s debut at its best speaks to the variety of storytelling modes Strange New Worlds can weave itself through.\nBut beyond the specific executions of those plots, these very different episodes both ring a bit hollow in similar ways, as they both struggle to both wrangle with the show’s episodic desires with increasingly serialized elements, and also struggle with how they handle their relationships to wider Trek canon.\nHegemony, Part II\nThe premiere episode itself, “Hegemony, Part II” (Strange New Worlds‘ first actual two-parter, made all the cuter by letting Anson Mount pick up with Star Trek tradition and lead us into the episode with the “And now, the continuation,” narration!), picks up like there hasn’t been a two-year wait to see just what Pike and the Enterprise crew will do to escape the wrath of the Gorn over Parnassus Beta.\nLike Strange New Worlds‘ prior Gorn-centric episodes, “Hegemony, Part II” provides a masterclass in high-stakes tension. Albeit more action-forward than the creepy Alien horror vibes of past Gorn encounters, the episode deftly and cleverly weaves three distinct plotlines together around them. First, we have Pike and the Bridge team racing to try and rescue their captured crew and the missing Parnassian colonists and save the Federation from a potential Gorn invasion; then, elsewhere on Enterprise we have Spock and Chapel trying to save Captain Batel from her Gorn infection; and then we have the aforementioned captured crew themselves—La’an, Ortegas, Sam Kirk, and Dr. M’Benga—trying to escape alive from what can only be described as “The Collector Base from the ending of Mass Effect 2, but full of Gorn.”\nIt’s a lot, and it’s all filled with high tension and big action setpieces, from body-horror rescues to starship and ground shootouts, and again, it’s all cleverly weaved so everything climaxes together just so: each thread of the narrative ends with our heroes saving the day, in spite of the odds, and with the Gorn, Strange New Worlds‘ most persistent of threats, are seemingly done for.\nAll that sounds good and fun, right? Well, it mostly is from a spectacle standpoint. But If this really is the end of Strange New Worlds‘ envisioning of the Gorn (save for some potential lingering trauma this season, more on that next episode) and the show has had all it wants to say in setting up this connection from here to the classic Star Trek episode “Arena,” then “Hegemony, Part II” feels like a climax that really doesn’t have a vision for the Gorn beyond treating them as unequivocal monsters for the most part.\nThere was a fleeting moment in part one where Spock and Chapel felt a twinge of regret for having to kill a Gorn warrior that seemed to suggest that Strange New Worlds was going to have the potential to pivot and bring some nuance to a species that it had, up to that point, treated as little more than primally aggressive creatures. But while that particular beat is paid off in their shared handling of curing Captain Batel’s infection (by feeding the Gorn embryos the sustenance they need so it doesn’t fatally burst out of her, letting it absorb into her system), the rest of “Hegemony, Part II” just continues to do that for the most part. There’s some attempts made, sure, as part of the way Pike and the crew eventually discover how they can stop the Gorn from invading the Federation—their aggression, it turns out, is driven by increased solar activity in their home system, with the Enterprise managing to reverse the effect just in time to send a huge Gorn armada back into hibernation.\nBut even that small layer of depth to the titular Hegemony is largely shadowed by Strange New Worlds continuing to portray the Gorn as explicitly animalistic monsters. The Federation doesn’t even consider co-existence, it sees war with the Gorn as inevitable and wants Enterprise not to find a peaceful solution, but a way to “punch back.” The capture of the away team and the colonists reveals that the Gorn, when they don’t violently impregnate their victims to breed, just melt down their prisoners into biomass fuel in a long, excruciating, and horrifying process, an act of profound evil. Even when La’an and the mostly-not-melted Enterprise away team (save for poor Ortegas, who loses a good chunk of one of her hands from not being brought out of pod-capitivty soon enough) are making their escape, there’s no humanization or understanding: the Gorn are there to run at them in droves and be gunned down.\nStrange New Worlds‘ Gorn are treated as largely undeserving of understanding (if anything, making their aggression driven by natural stellar phenomena underlines that these Gorn could never comprehend the concept of diplomacy), monsters that the Federation must bend rules to defeat no matter the cost. And by resolving things, seemingly for good in terms of what’s left of Strange New Worlds through putting the Gorn into an early hibernation—that even the show has Pike acknowledge is just punting the issue down the road for someone else to deal with—Strange New Worlds avoids having to wrestle with that treatment, and how it impacts Star Trek‘s broader approach to treating even the greatest of antagonists with nuance and depth.\nAnd even wilder, considering we know what Strange New Worlds is kicking the issue down the road to: it’s only six years after the fact when the events of “Arena” in original Star Trek take place. “Arena” is an episode of television almost 60 years older than “Hegemony, Part II” that somehow manages to give its singular Gorn a more nuanced and understanding portayal—and a more nuanced and understanding portrayal of humanity’s own path to Star Trek‘s utopian future, questioning the potential for both humanity and Gornkind alike’s potential for violence, and the hope in their striving to rise above it.\n“Hegemony, Part II” instead only considers that the Gorn are animals, and deserve conflict until it can make treating them better another show’s problem. Among the slick spectacle of all the action and tension that really works here, it’s an oddly incurious move for a show in a franchise that prides itself on its curiosity.\nWedding Bell Blues\nWell, after all that seriousness, why don’t we move on to something fun! “Wedding Bell Blues” is an interesting parallel to “Hegemony, Part II” despite being radically different in tone, like the equivalent of a photographer at the titular wedding yelling “let’s do a silly one,” but as an entire episode.\nIf “Hegemony, Part II” was the contination of the show’s action-disaster, year-of-Hell type riffing seen in prior episodes of the Gorn arc across season one and two, then “Wedding Bell Blues” is, somehow, the third in a line of camp comedies that can only be described as the “Something Silly Happens During a Time of Tumult In Spock’s Love Life” genre. An oddly specific trend!\nPicking up three months on from the events of “Hegemony, Part II”—a timeskip that allows Strange New Worlds to conventiently dump having to explore the lingering traumas of those events, for the most part, in order to wildly swing its tone—the episode sees Enterprise docked at Starbase One to celebrate the Federation’s centenary, only for things to take an awkward turn when Nurse Chapel returns from her fellowship not to romantically reunite with Spock, but reveal she is now actually in a very serious relationship with her mentor, Dr. Korby (guest star Cillian O’Sullivan) instead. Womp womp!\nOffered a strange drink by a mysterious bartender (none other than Our Flag Means Death‘s Rhys Darby) to soothe his heartache, Spock suddenly finds himself waking up in a reality where Enterprise is docked at Starbase One to intead celebrate his impending marriage to Chapel. From there, Strange New Worlds engages in a whole host of familiar comedies, as an unaffected Korby (and soon after a realizing Spock) race to try and snap everyone else out of the the mystery bartender-slash-wedding-planner’s illusion.\nIt’s a breezy and fun episode, but doesn’t really have much to do or say, even building itself around the interesting beat that we’re seeing a an inversion of Spock and Christine’s relationship in the original Trek (where Chapel pined after an unreciprocating Spock) as he wrestles with letting her go for good. The real hook is not necessarily that character arc, but instead the mystery of who Darby’s mystery illusionist really is…\nTo which, again, Strange New Worlds doesn’t really have a strong answer. Darby’s character has reality warping powers like original Trek‘s godlike being Trelane from “Squire of Gothos,” and certainly dresses the part (with the sideburns to match), but the climax of “Wedding Bell Blues” instead leans more to suggest that Darby is playing a Q, right down to a voice cameo by John de Lancie himself as a shapeless parent entity who shows up to stop the bartender playing with mortals so everyone can get on with actual reality.\nIt’s such an odd play to nostalgia, because Darby’s riff is neither explictly made out to be Trelane or a member of the Q Continuum in the text of the episode, but kind of a mish-mash of both, an aesthetic here, a particular handmotion. Which is, itself, a seperate play to nostalgia: there’s long been a fan theory that retroactively establishes Trelane, who’s real nature was never covered in “Gothos,” as a Q. It’s been touched on in Trek books, and even Strange New Worlds itself, via Lower Decks characters Boimler and Mariner joked about it in last season’s crossover episode as a nod to the theory.\nThis is the closest on-screen Trek has come to floating it as canon, but again, the episode leaves things vague and unanswered: a cloud voiced by John de Lancie comes in and tells Rhys Darby off, he turns into a cloud himself, and off they both go. What does Strange New World get by digging into this fleeting moment of fanon, but then only gesturing rather than saying anything explicit? What does whether or not this is Trelane, or a Q, or those are both the same thing, push out of our characters? Spock’s whole arc of reconciling how he feels about Christine moving on could’ve easily happened without the diversion of shenanigans.\nIt speaks to a strange relationship with ephemerality that Strange New Worlds has had as it’s progressed. The show’s desire to maintain that episodic vibe, switching up tone wildly from week to week with little carryover, is brushing up more and more with the times it wants to have things of consequence happen with its characters. Spock is perhaps the rare exception as we’ve seen him have to process first his doomed betrothal to T’Pring, and now losing Christine. But Chapel herself is put aside in the process of that latter arc, her romance with Korby happening entirely offscreen and then having to be defended on merit through the filter of this reality-warp-wedding-drama (interestingly, the arc of their entire would-be-romance kind of takes place almost entirely through these more comic episodes—getting together after Spock briefly became human in “Charades,” cutting their relationship off during the musical episode “Subspace Rhapsody,” and now this).\nThey’re not the only two characters impacted in “Wedding Bell Blues” either. The three-month timeskip lets La’an essentially acknoweledge that she can now be over her traumatic childhood encounter with the Gorn now they are dealt with and seemingly won’t show up again, meaning we do not get to really sit with her as she sits with concluding a defining element of her character. There’s also Ortegas, who has struggled to exist on the show so much that at this point all the show can do with her is have her say “I’m Erica Ortegas, and I fly the ship” instead of have an actual character. She literally did that again in “Hegemony, Part II” after being put through the wringer being horrifically injured during her capture and the escape—a truama “Wedding Bell Blues” brushes over for the most part, using its timeskip again to even literally handwave her losing part of her hand in the last episode (at least there you can thank Starfleet’s advanced medicine).\n“Wedding Bell Blues” tries to give Ortegas something more by introducing her brother Beto (Mynor Luken), but he immediately instead becomes a potential romantic foil for Uhura, away from Ortegas’ orbit. But it then also concludes with the revelation that, understandably, Ortegas is indeed dealing with trauma over her capture and injuries at the hand of the Gorn: a character depth the episode had spent its entire runtime ignoring, and essentially La’an’s own prior character arc now just transferred over to her. Which they can do, because she’s not really had much of a character so far, but also because Strange New Worlds‘ relationship with what actually matters for its characters from week to week has become so weird.\n“Hegemony, Part II” and “Wedding Bell Blues” are a likewise weird set of episodes to pair (perhaps unfairly, as the decision to release both at once is likely not a creative decision on behalf the show, but on Paramount), but they reflect something that’s been a flaw in the background of Strange New Worlds for a while now. The series wants to do big, deep things with both its characters and its connection to wider Star Trek continuity, but it also doesn’t want to commit with what it means to stick with some of those things in order to maintain its episodic variety. The show wants to jump from horror-disaster-action epics right into camp comedies and clean the slate each time, but cleaning that slate leaves its characters in an odd limbo.\nMaybe this is just a particularly off combo of episodes to amplify this flaw, but it’s also perhaps that Strange New Worlds is now in its third season—and the reality that there are now 24 finite episodes of its runtime ahead of it—and well into a familiar, comfortable pattern with itself. These are both episode formats we’ve seen the show execute on multiple times before, and now we can see the pattern ourselves… and some of the cracks in its approach, beneath the slick sheen.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650",
      "text": "Trying to keep track of what’s coming in the realm of Star Trek feels like trying to stop a tribble from procreating. Before even more new series are announced, here’s our guide of when to expect all the new Star Trek shows, as well as returning familiar favorites, and what else is in the works right now. Engage!\nThis post was last updated 7/14/23.\nCurrently Airing: Star Trek: Strange New Worlds Season 2\nThe Enterprise is back after a successful first season, and this time Captain Kirk will be along for the ride with another appearance by Paul Wesley after his surprise finale role in season one. Not much else is known about the season so far, other than one episode will see the show crossover with Star Trek: Lower Decks in a live-action/animated hybrid directed by The Next Generation’s Jonathan Frakes. The show has also been renewed for a third season.\nSeason two recaps:\n“Tomorrow and Tomorrow and Tomorrow”\n“Charades”\nUpcoming: Star Trek: Lower Decks Season 4\nThe third season of the animated series following the misfit crew of the USS Cerritos—and in particular its cadre of ensigns, Mariner (Tawny Newsome), Boimler (Jack Quaid), Tendi (Noël Wells), and Rutherford (Eugene Cordero)—once again followed our heroic ensigns and the remaining bridge officers aboard the Cerritos. Season four will be arriving in late summer. The show has also been renewed for a fifth season.\nUpcoming: Star Trek: Discovery Season 5\nExpected in early 2024, Discovery’s fifth season will be 10 episodes long, down from the 13 of prior seasons. In the wake of season four‘s climax earlier this year, Michael Burnham (Sonequa Martin-Green) led her crew in a desperate attempt to save the galaxy from a mysterious anomaly created by an extra-galactic race, ensuring peace and stability for the Federation once more… for now. As her romantic partner Book (David Ajala) pays time for his own role in a campaign to surreptitiously destroy that anomaly, we’re not sure what awaits Burnham and Discovery’s crew just yet, but given this show, we’re sure it’ll be very, very dramatic.\nIn Flux: Star Trek: Prodigy Season 2\nThe animated series aimed at younger Trek fans (and Janeway fans!) and kids at heart can be found on both Nickelodeon and Paramount+. The first season was divided into two parts, with part two wrapping up at the end of 2022; after Paramount+ announced it would not move forward with the show’s already greenlit season two, it was removed from the service. (A home release of the complete first season is still possible; the first 10 episodes are still available for purchase.) Fans are still waiting to hear if Prodigy season two will surface on a different outlet.\nUpcoming: Starfleet Academy\nIt’s really happening! After a long tease, filming on this series will begin in 2024. Here’s the official announcement from co-showrunners and executive producers Alex Kurtzman and Noga Landau:\n“Admission is now open to Starfleet Academy! Explore the galaxy! Captain your destiny! For the first time in over a century, our campus will be re-opened to admit individuals a minimum of 16 Earth years (or species equivalent) who dream of exceeding their physical, mental and spiritual limits, who value friendship, camaraderie, honor and devotion to a cause greater than themselves. The coursework will be rigorous, the instructors among the brightest lights in their respective fields, and those accepted will live and study side-by-side with the most diverse population of students ever admitted. Today we encourage all who share our dreams, goals and values to join a new generation of visionary cadets as they take their first steps toward creating a bright future for us all. Apply today! Ex Astris, Scientia!”\nUpcoming (movie): Star Trek: Section 31\nAnnounced as a TV series back in 2019 as a spinoff for fan-favorite Discovery guest star Michelle Yeoh, this plunge into the seediest side of Starfleet—the shadowy spy organization Section 31 first introduced in Deep Space Nine—is now planned as a Paramount+ film.\nNewly minted Oscar winner Yeoh will return as former emperor of the Mirror Universe’s Terran Empire, Phillipa Georgiou, now turned into a kinder, but still kickass person by her time with Michael Burnham. “I’m beyond thrilled to return to my Star Trek family and to the role I’ve loved for so long,” Yeoh said in a statement. “Section 31 has been near and dear to my heart since I began the journey of playing Philippa all the way back when this new golden age of Star Trek launched. To see her finally get her moment is a dream come true in a year that’s shown me the incredible power of never giving up on your dreams. We can’t wait to share what’s in store for you, and until then: live long and prosper (unless Emperor Georgiou decrees otherwise)!”\nWritten by Craig Sweeny and directed by Olatunde Osunsanmi, Star Trek: Section 31 will start production later this year, and eventually come to Paramount+.\nWhere Can I Stream Classic Star Trek Shows?\nThat’s all the new bits of Star Trek coming. But what about the old Star Trek? In the U.S. at least, the vast majority of classic Star Trek shows are available exclusively to stream on Paramount+ (albeit not without issues), although some holdouts remain on other streaming services. Here’s a full list of classic Star Trek shows and where to stream them, as well as links to our recommended episode guides for every series!\nStar Trek: The Original Series (Paramount+)\nStar Trek: The Animated Series (Paramount+)\nStar Trek: The Next Generation (Paramount+, Netflix)\nStar Trek: Deep Space Nine (Paramount+, Netflix)\nStar Trek: Voyager (Paramount+)\nStar Trek: Enterprise (Paramount+)\nWant more io9 news? Check out when to expect the latest Marvel and Star Wars releases, what’s next for the DC Universe on film and TV, and everything you need to know about House of the Dragon and Lord of the Rings: The Rings of Power."
    },
    {
      "url": "https://gizmodo.com/star-trek-strange-new-worlds-season-5-movie-2000641342",
      "text": "Just before the latest season of Star Trek: Strange New Worlds kicked off, we learned that the Enterprise‘s journey had set its end date: the show would conclude with a fifth and final season. However, that apparently wasn’t always going to be the case, and the show nearly ended sooner.\nThat’s according to Rebecca Romijn, who plays Una Chin-Riley (a.k.a. Number One) on the show. Speaking this past weekend at the Star Trek convention STLV in Las Vegas, the actress—via TrekCore—revealed that initially, Strange New Worlds would’ve come to an end after its currently-in-production fourth season, before being capped off with a feature-length movie. According to Romijn, showrunners Henry Alonso Meyers and Akiva Goldsman were able to convince Paramount to change plans, resulting in the six-episode season five.\nAt the very least that means Strange New Worlds fans are getting a little more Star Trek than originally planned (according to TrekCore, Romijn noted that the movie would’ve been “just” two hours), even if it still is a truncated season compared to prior ones. But it also speaks to some of the tumult Star Trek has faced in recent years as Paramount has contracted the franchise after years of a streaming renaissance, and the studio itself prepared to seek new ownership (it was made official last week that Skydance’s $8 billion takeover of the company had closed). Much of the Star Trek that helped define this new era for the series on streaming TV has wrapped up in the past few years, and with Strange New Worlds joining them in the next few, just one more series remains in production alongside it: Starfleet Academy, which will stream for at least two seasons.\nWhat, if any, Trek will come beyond that remains up in the air right now, although the hope of new ownership and a renewed focus on streaming could see a new generation of Trek shows emerge. Right now, much of the franchise’s definitive future lies in film, just like Strange New Worlds‘ almost did. Patrick Stewart has spent the years since the conclusion of Star Trek: Picard suggesting a new film was in the works, and on the theatrical side of things, there’s long been the perpetual hope of a fourth “Kelvin Timeline” Trek film—but there’s also Toby Haynes’ planned “origins” film detailing the early years of Starfleet post-First Contact. With all that in mind, a planned streaming movie conclusion to Strange New Worlds at least makes a little more sense.\nBut only a little. After all, despite a rich cinematic legacy, Star Trek fans will likely always insist that the boldly going is just better in a long-form TV format. Who knows—maybe it would’ve been a better bet than a Section 31 movie turned out to be?\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806",
      "text": "“Star Wars! Nothing but Star Wars! Give me those Star Wars! Don’t let them end…” Just as Bill Murray said it in 1978, we’re still saying it today. Star Wars is everywhere these days, with multiple movies and TV shows in the works from Disney and Lucasfilm. This article will give you the most up-to-date Star Wars release dates so you know exactly when every new Star Wars movie or Disney+ show will arrive.\nWhat are the next three movies? What TV shows are coming up? Have any TV shows or movies been canceled? What are people saying about what’s next? We’ve got you covered on all things in a galaxy far, far away.\nThis post was last updated on 9/13/2023.\nWhat’s the next Star Wars movie?\nSharmeen Obaid-Chioy’s New Jedi Order Film Film\nRelease Date: TBD, but May 26, 2026, December 18, 2026 or December 17, 2027 (In Theaters)\nAt Star Wars Celebration 2023 in London, Lucasfilm announced that three Star Wars movies are now in the works.\nJames Mangold (Indiana Jones 5) will direct a film 25,000 years before any known Star Wars timeline about the first Jedi to use the Force.\nDave Filoni will direct a film that’s kind of the Star Wars Disney+ Avengers, telling the story of a climactic event meeting the stories of The Book of Boba Fett, The Mandalorian, Ahsoka and more in the time between Return of the Jedi and The Force Awakens.\nAnd Sharmeen Obaid-Chioy will direct a film set 15 years after the events of The Rise of Skywalker following Rey (Daisy Ridley) as she creates a New Jedi Order.\nThis last one, we think, is the film that Damon Lindelof (Lost, The Leftovers, Watchmen) was co-writingwith Justin Britt-Gibson before departing the project. Steven Knight is now reportedly writing.\nA week after the news of these films first broke, it began to seem like the Rey project by Obaid-Chioy could be the first one out of the gate. However, in June, Disney shuffled its release schedule and moved its December 2025 Star Wars movie to May 2026, and added a third Star Wars movie to the schedule in December 2026. So maybe these three movies are on those dates. We’ll see.\nUpcoming Star Wars release dates\nThese shows and movies have all been officially announced and are in various stages of production, even if we don’t know when they will definitely come out.\nStar Wars: Ahsoka\nRelease Date: Now Playing (On Disney+)\nThe first full live-action Ahsoka Tano show from co-creator Dave Filoni is finally here. Rosario Dawson is, of course, returning. And our first look at footage confirmed that actress Natasha Liu Bordizzo has been cast as Sabine Wren; more recently, Eman Esfandi was confirmed as Ezra Bridger. At Star Wars Celebration this year we learned Mary Elizabeth Winstead is playing Hera Syndulla, Lars Mikkelsenis playing Grand Admiral Thrawn and Wes Chatham is his right-hand man.\nWhat does that all mean? Well, in the first teaser trailer, you can see she’ll make good onthe Star Wars Rebels finale and go after Thrawn. And what about the fact she knows Luke Skywalker now? And how does Ray Stevenson’s lightsaber-wielding character fit in?\nThe show is now airing on Disney+ and here you can read our weekly recaps:\nEpisode 1, “Master and Apprentice: and Episode 2, “Toil and Trouble”\nEpisode 6, premiering September 19\nEpisode 7, premiering September 26\nEpisode 7, premiering October 3\nStar Wars: Skeleton Crew\nRelease Date: 2023 (On Disney+)\nCreated by Spider-Man Homecoming/Far From Home/No Way Home director Jon Watts along with writer Chris Ford, this mystery Star Wars show is now currently in development. The title for the show was released during the Star Wars Celebration, and was previously internally referred as “Grammar Radio.” Celebration also revealed its headlining star, Jude Law.\nSet after the events of Return of the Jedi, Skeleton Crew is described as an adventure in the mold of Amblin adventures of the 1980s. The show will be about seeing the galaxy through the eyes of children (but it is not a kids show), and will follow a group of children who get lost in the galaxy and try to find their way home. Jon Watts explained that the series will take place during the same time period as the upcoming Ahsoka series and The Mandalorian.\nFilming on the series began in 2022 and ended in early 2023. And though not much is know about what happens on the show,it has been revealed that The Daniels, the Oscar-winning directors of Everything Everywhere All At Once, directed an episode. Ditto David Lowery, who did the film The Green Knight. Read more about the show here.\nio9 saw the first footage at Star Wars Celebration 2023 and you can read about it here. Three of the main stars of the show are played by Ravi Cabot-Conyers, Kyriana Kratter, and Robert Timothy Smit. Rumors suggest it could debut in November or December 2023.\nStar Wars: The Acolyte\nRelease Date: 2024 (On Disney+)\nRussian Doll co-creator Leslye Headland will be the first person to bring the excellent High Republic timeline into live-action with this show, long rumored to star Amandla Stenberg before an actual confirmation finally arrived at San Diego Comic-Con 2022—one of few Star Wars bits of news to emerge from the convention.\nIn an interview in 2022, Headland revealed the show would be about 100 years before the events of The Phantom Menace. “A lot of those characters haven’t even been born yet,” she said. “We’re taking a look at the political and personal and spiritual things that came up in a time period that we don’t know much about. My question when watching The Phantom Menace was always like, ‘Well, how did things get to this point?’ How did we get to a point where a Sith lord can infiltrate the Senate and none of the Jedi pick up on it? Like, what went wrong? What are the scenarios that led us to this moment?”\nIn an interview released later, Headland spoke about her goals for the series. For Headland, above all else The Acolyte is a mystery, and that mystery is figuring out what is going on in this peak period. It was also suggested that The Acolyte will bring more elements from the Expanded Universe to canon, but what parts that will be incorporated will remain to be seen.\nIn September 2022, both Jodie Turner-Smith and Squid Game’s Emmy-winning Lee Jung-Jae joined the cast, with an official announcement in November adding Carrie-Anne Moss, Manny Jacinto, and others to the roster. The first image, which you see above, was released in November and you can read about the first footage here, which was shown at Star Wars Celebration 2023.\nAnd no, despite what bullcrap rumors you may have been reading online, the show has not been canceled.\nAndor: Season 2\nRelease Date: August 2024 (On Disney+)\nSeason one of Tony Gilroy’s Rogue One prequel starring Diego Luna showed an excitingly different side of Star Wars. Season two will reportedly be spread across the four years leading up to Rogue One, with four episodes covering each year in Cassian Andor’s life until that fateful point. Filming began in late 2022.\nAt Star Wars Celebration 2023, Gilroy announced the show should be out in August 2024 and showed fans the first footage from the season. Read about it here. Plus, the final episodes of the season/series will take place just days before Rogue One, leading right into that story.\nOne minor hiccup though, due to the Writer’s Guild strike, showrunner and head writer Tony Gilroy left his duties show in May 2023. He’s unlikely to return until the Writer’s Strike is over, which could cause a delay.\nStar Wars: A Droid Story\nRelease Date: TBD (On Disney+)\nLucasfilm Animation is teaming up with Industrial Light and Magic for this streaming show that will “introduce us to a new hero, guided by legendary duo R2-D2 and C-3PO.” We don’t know anything beyond that and there hasn’t been a significant update in years, which could be a good thing or bad thing.\nStar Wars: Lando\nRelease Date: TBD (On Disney+)\nWay back in December 2020, Disney announced a bunch of Star Wars TV shows. Among them was a Lando show which, at the time, was going to be made by Dear White People creator Justin Simien. After that, things went quiet for about three years. Then,in an April 2023 article, Donald Glover hinted that he’s still interested and it’s still possible in the works. A May 2023 interview with Lucasfilm president Kathleen Kennedy confirmed it’s still in the works.\nThe first significant update in almost three years came in July when news broke that Simien has been off the project since he started working on Haunted Mansion, and not only is Donald Glover going to star in the series, he’s co-writing it with his brother Stephen.\nUntitled Taika Waititi Star Wars Movie\nRelease Date: TBD\nIn May 2020, news broke that Oscar-winning director of Thor: Ragnarok would be helming and co-writing along with Krysty Wilson-Cairns. “Taika’s approach to Star Wars will be fresh, unexpected, and … unique,” Lucasfilm president Kathleen Kennedy said. “His enormous talent and sense of humor will ensure that audiences are in for an unforgettable ride.”\nThere was a time when this was likely to be the next Star Wars film but, after Star Wars Celebration 2023, it seems like it’s now on the back burner. That was confirmed by Lucasfilm president Kathleen Kennedy who said the Oscar-winner is still working on the film, it’s just going slowly.\nIn the past, Waititi has discussed some broad ideas of what he wants to do with his upcoming film. Read those below.\nTaika Waititi Doesn’t Want Star Wars to Rely on Legacies\nAre You as Confused About Taika Waititi’s Star WarsMovie as We Are?\nUntitled Dave Filoni Star Wars Movie\nRelease Date: TBD\nWe mentioned this one above but, at some point, Dave Filoni will be directing a film that is meant to be a climactic event wrapping up stories that have begun on shows he’s involved with such as The Mandalorian, Ahsoka, The Book of Boba Fett, Skeleton Crew and others.\nUntitled James Mangold Star Wars Movie\nRelease Date: TBD\nThis was one of the three films announced at Star Wars Celebration but, like Filoni’s, isn’t likely to be next. This one is set 25,000 years before the original trilogy and tells the story of the first person to use the Force.\n“For me, it’s about, I want to be part of the saga, but I also don’t want to be holding so much lore in the air that you can hardly tell a story,” Mangold told io9 when asked about this film. “And what I really wanted to do…was just can we make a kind of the Ten Commandments of the Force, you know? A kind of origin story of how the Force came to be known, understood, wielded, and harnessed.” We love this idea so much we even wrote about it.\nStar Wars Movies and TV Shows That Are Currently Unscheduled and Haven’t Been Officially Announced, But We Think Are Still Happening\nThe Mandalorian Season 4\nRelease Date: TBD\nWith The Mandalorian Season 3 now in the books, all eyes look ahead to season 4. However, the season has not yet been officially announced. Unofficially though, series creator Jon Favreau said he’s already written a fourth season which he probably wouldn’t have done just for fun. It’s coming. It’s just a matter of when, especially with writers and actors on strike.\nThe Book of Boba Fett Season 2\nRelease Date: TBD (On Disney+)\nThe Book of Boba Fett season one ended with the implication that we’d see more of these character in the future. But alas, there has been no official announcement… yet. Dive into the making-of season one while we wait and ponder the words of executive producer Robert Rodriguez who said he knows when the character is coming back, but he can’t say when.\nUntitled Shawn Levy Movie\nRelease Date: TBD\nShawn Levy, the prolific director and producer behind Stranger Things, Night at the Museum, and Free Guy is gearing up to develop a film in a galaxy far far away. He’ll focus on that after completing Deadpool 3, which stars Ryan Reynolds and Hugh Jackman.\nStar Wars Movies and TV Shows That Are Currently Unscheduled and Probably NOT Going To Happen\nStar Wars: Rangers of the New Republic\nOriginally announced alongside shows like Obi-Wan Kenobi, Ahsoka, and Andor, Rangers of the New Republic was rumored to be Cara Dune’s show which would tie into The Mandalorian and Book of Boba Fett. However, with actress Gina Carano no longer a part of Star Wars, word on the street is this will no longer be happening. Nothing is official though.\nUntitled Rian Johnson Trilogy\nLet’s be honest. Do we think this is happening anymore? Probably not. Rian Johnson has moved on to other things. But, until we hear otherwise (and no one is officially saying), we’d be remiss if we didn’t mention that before the divisive release of The Last Jedi, Lucasfilm officially said Johnson would make his very own trilogy. It hasn’t officially been canceled yet but, in a new interview, Lucasfilm president Kathleen Kennedy suggested that it’s been placed on the back burner as Johnson does other things. With Johnson’s next film, Glass Onion, set for release in late 2022 though, he’s been quoted saying he still hopes these movies happen. So do we.\nStar Wars: Rogue Squadron\nFor several years, Wonder Woman director Patty Jenkins’ film about pilots in the Star Wars universe has been earmarked as the next film. Well, that’s no longer the case. After months of rumors suggesting it might move off its 2023 release date, Disney officially took it off the schedule. On December 13 2022, Jenkins said the movie is still in “active development” but recent news suggests it’s dead. Lucasfilm president Kathleen Kennedy disagrees, saying in May 2023 it’s still on the books.\nUntitled Kevin Feige Movie\nMarvel Studios President Kevin Feige is best known for helping create the Marvel Cinematic Universe. But as much as he loves Marvel, he loves Star Wars even more. And so it was exciting to hear that he was producing a Star Wars movie and even recruited Loki and Doctor Strange in the Multiverse of Madness writer Michael Waldron to help him. Feige doesn’t like to even acknowledge this project though and in a 2022 interview, Lucasfilm president Kathleen Kennedy also tiptoed around the project’s existence. Then, a few weeks before Star Wars Celebration 2023, we learned the project is likely dead.\nFor more, check out io9’s list of every canceled (or re-worked) Disney Star Wars project.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    }
  ],
  "argos_summary": "In the latest episodes of Star Trek: Strange New Worlds, titled \"The Sehlat Who Ate Its Tail\" and \"Wedding Bell Blues,\" the series explores the early dynamics of the iconic crew, particularly focusing on a young James T. Kirk as he faces leadership challenges aboard the U.S.S. Farragut. The episodes juxtapose high-stakes action and character-driven comedy, highlighting Kirk's development and the evolving relationships among the crew, including his interactions with Spock and Uhura. However, the series struggles with tonal consistency and character depth, particularly in addressing the aftermath of traumatic events and the complexities of its characters' arcs.",
  "argos_id": "QYNV2JFCX"
}